[
  {
    "title": "America’s quietest crop is set to take center stage in Trump–Xi talks",
    "description": "Trump and Xi Jinping meet as soybean trade war devastates U.S. farmers. China's tariffs shifted $30 billion crop exports to Brazil, hitting rural America hard.",
    "link": "https://www.foxnews.com/politics/americas-quietest-crop-set-take-center-stage-trump-xi-talks",
    "timestamp": "2025-10-29T23:25:31Z"
  },
  {
    "title": "What Texas’ Tylenol lawsuit and the Trump White House’s website have in common",
    "description": "Trump and MAGA are attempting to rewrite history and remake reality right before our eyes — and they’re weaponizing vulgarity to do both.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-white-house-website-texas-tylenol-lawsuit-rcna240417",
    "timestamp": "2025-10-29T23:24:13Z"
  },
  {
    "title": "Portland police say Trump's troop deployment inflamed protests",
    "description": "Portland police testified on Wednesday that President Donald Trump's order to deploy National Guard troops in their city inflamed protests and increased violence, in a trial over whether the troop deployment was legal. The Portland trial, before U.S. District…",
    "link": "https://japantoday.com/category/world/portland-police-say-trump%27s-troop-deployment-inflamed-protests1",
    "timestamp": "2025-10-29T23:21:31Z"
  },
  {
    "title": "Shorts now make more money for YouTube than long-form videos",
    "description": "In an after-hours earnings call, Google reported record revenue of $102.35 billion for Q3 2025, with YouTube accounting for $10.26 billion of that thanks to advertising earnings. Alphabet and Google CEO Sundar Pichai called the quarter “terrific,” with “doubl…",
    "link": "https://www.tubefilter.com/2025/10/29/shorts-now-make-more-money-for-youtube-than-long-form/",
    "timestamp": "2025-10-29T23:21:02Z"
  },
  {
    "title": "Newsom thinks he can be president, but California's policies are killing people",
    "description": "California Gov. Gavin Newsom finally admitted to what has been extremely obvious for some time: The Democrat wants to be president and is giving “serious thought” to a run for the White House in 2028.“I’d be lying otherwise,” Newsom said Oct. 26 on “CBS News …",
    "link": "https://freerepublic.com/focus/f-news/4349491/posts",
    "timestamp": "2025-10-29T23:19:36Z"
  },
  {
    "title": "Trump’s Russia Oil Sanctions Face Early Test in China Meeting",
    "description": "Ukraine and its allies have called on Donald Trump to pressure Xi Jinping over China’s support for Russia. Trump’s meeting with Xi later Thursday will be a major test of just how ready the US president is to get tough with Vladimir Putin.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-russia-oil-sanctions-face-early-test-in-china-meeting",
    "timestamp": "2025-10-29T23:19:09Z"
  },
  {
    "title": "Mike Bloomberg reiterates support for Andrew Cuomo as NYC mayoral race heats up in final stretch",
    "description": "Bloomberg doubles down on Cuomo endorsement as NYC mayor race tightens. Former governor trails democratic socialist Mamdani by 10 points with election week approaching.",
    "link": "https://www.foxnews.com/politics/mike-bloomberg-reiterates-support-andrew-cuomo-nyc-mayoral-race-heats-up-final-stretch",
    "timestamp": "2025-10-29T23:16:44Z"
  },
  {
    "title": "Trump blocks Israeli plan to expand control in Gaza following ceasefire violation",
    "description": "Following a deadly ceasefire breach, Israel sought to seize additional territory in Gaza - but US President Trump vetoed the move.",
    "link": "https://www.israelnationalnews.com/news/417032",
    "timestamp": "2025-10-29T23:15:08Z"
  },
  {
    "title": "Jonathan Karl explores Trump’s focus on retribution in new book",
    "description": "In his new book, ABC News' chief Washington correspondent Jonathan Karl offers a behind-the-scenes look at key moments on the 2024 campaign trail that ended one party's hold on the White House and brought another back to power. Geoff Bennett sat down with Kar…",
    "link": "https://biztoc.com/x/83b96561aa25c680",
    "timestamp": "2025-10-29T23:14:47Z"
  },
  {
    "title": "Trump: S. Korea to build its nuclear sub in US",
    "description": "United States President Donald Trump said that South Korea will build its nuclear-powered submarine, the production of which he approved on Wednesday, in the US.\"South Korea will be building its Nucle...",
    "link": "https://biztoc.com/x/4c4634bea11bc7d2",
    "timestamp": "2025-10-29T23:14:44Z"
  },
  {
    "title": "Trump and Chinese Leader, Xi Jinping, Meeting in South Korea for Trade Talks—Live Updates",
    "description": "Donald Trump is meeting with Chinese President Xi Jinping in South Korea on Wednesday evening. Follow Newsweek's live blog.",
    "link": "https://biztoc.com/x/228f50e903a00a7b",
    "timestamp": "2025-10-29T23:14:42Z"
  },
  {
    "title": "The East Wing gave women space to thrive in the White House — here's why",
    "description": "First intended as an entrance for social events, the East Wing became the first lady's office space. Historians say the shift was a key part of professionalizing staff for the president's wife.",
    "link": "https://www.npr.org/2025/10/29/nx-s1-5583985/white-house-east-wing-women",
    "timestamp": "2025-10-29T23:14:26Z"
  },
  {
    "title": "Senate approves Democratic resolution to block Trump's tariffs on Canada - CBS News",
    "description": "Senate approves Democratic resolution to block Trump's tariffs on CanadaCBS News Four Senate Republicans vote with Democrats in effort to end Trump tariffs on CanadaCNN Senate votes to block tariffs on CanadaThe Washington Post Senate votes against Trump’s 50…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179909650",
    "timestamp": "2025-10-29T23:13:11Z"
  },
  {
    "title": "House Republicans Say Democrats Have a New Leader: 'Schumer Is Waiting for Mamdani to Let Him Know When He Can Open the Government'",
    "description": "House Republicans Say Democrats Have a New Leader: 'Schumer Is Waiting for Mamdani to Let Him Know When He Can Open the Government'westernjournal.com",
    "link": "https://www.westernjournal.com/house-republicans-say-democrats-new-leader-schumer-waiting-mamdani-let-know-can-open-government/",
    "timestamp": "2025-10-29T23:12:45Z"
  },
  {
    "title": "A look at consumer prices 9 months into the second Trump administration",
    "description": "The Tribune is tracking 11 everyday costs for Americans — eggs, milk, bread, bananas, oranges, tomatoes, chicken, ground beef, gasoline, electricity and natural gas — and how they are changing, or not, under the second Trump administration. This tracker is up…",
    "link": "https://www.bostonherald.com/2025/10/29/september-us-consumer-goods-price-tracker/",
    "timestamp": "2025-10-29T23:11:55Z"
  },
  {
    "title": "Tit-for-tat tariffs, a shaky truce and turmoil: How we got to the Trump-Xi meeting",
    "description": "US President Donald Trump and Chinese leader Xi Jinping are set to meet to discuss a trade deal.",
    "link": "https://www.bbc.com/news/articles/c986j98qmj1o",
    "timestamp": "2025-10-29T23:11:08Z"
  },
  {
    "title": "What shutdown? Trump isn't canceling travel, golf or his ballroom even with the government shuttered",
    "description": "Shutdown",
    "link": "https://abcnews.go.com/Politics/wireStory/shutdown-trump-canceling-travel-golf-ballroom-government-shuttered-126990829",
    "timestamp": "2025-10-29T23:09:55Z"
  },
  {
    "title": "Senate vote on nullifying tariffs on Canada demonstrates opposition to Trump's trade policy",
    "description": "The Senate is passing legislation that would nullify U.S. tariffs on Canada",
    "link": "https://abcnews.go.com/Business/wireStory/senate-vote-nullifying-tariffs-canada-demonstrates-opposition-trumps-126997595",
    "timestamp": "2025-10-29T23:09:54Z"
  },
  {
    "title": "Canadian Pacific profits leap despite U.S. tariff turmoil and looming merger prospect",
    "description": "Canadian Pacific Kansas City Ltd. reported a big profit boost in its latest quarter despite U.S. tariff disruption and fears over fallout from a potential merger of rivals down the line. The railway saw net income for the quarter ended Sept. 30 rise 10 per ce…",
    "link": "https://financialpost.com/pmn/canadian-pacific-profits-leap-despite-u-s-tariff-turmoil-and-looming-merger-prospect-3",
    "timestamp": "2025-10-29T23:08:31Z"
  },
  {
    "title": "Nate Morris Backs 'America First' Tariffs; Mitch McConnell Opposes Trump Policies",
    "description": "Kentucky Senate Republican candidate Nate Morris voiced his support for President Donald Trump's tariff policies while Sen. Mitch McConnell (R-KY) has continued to oppose the president's agenda.\nThe post Nate Morris Backs ‘America First’ Tariffs; Mitch McConn…",
    "link": "https://www.breitbart.com/politics/2025/10/29/nate-morris-backs-america-first-tariffs-mitch-mcconnell-opposes-trump-policies/",
    "timestamp": "2025-10-29T23:07:48Z"
  },
  {
    "title": "Former Trump adviser claims Dems are exaggerating threat to marriage equality for political gain",
    "description": "A former adviser to Donald Trump has claimed Democrats are exaggerating the threat to marriage equality just to raise money and keep the nation “angry, divided and distrustful.”",
    "link": "https://www.advocate.com/politics/trumpster-says-marriage-equality-safe",
    "timestamp": "2025-10-29T23:05:43Z"
  },
  {
    "title": "Democrat running for Congress, 5 others indicted over Chicago immigration protest",
    "description": "By Renee Hickman and David Thomas CHICAGO (Reuters) -Six people, including a Democratic congressional candidate, were indicted Wednesday on charges of...",
    "link": "https://www.yahoo.com/news/articles/democrat-running-congress-5-others-230533250.html",
    "timestamp": "2025-10-29T23:05:33Z"
  },
  {
    "title": "State police slam Trump’s ICE agents after tear gas hits officers",
    "description": "Oregon state police are shredding President Donald Trump's ICE agents after officers \"suffered exposure\" from tear gas during a protest outside an ICE facility in Portland earlier this month. Judge Karin Immergut said she would decide on whether to hold the g…",
    "link": "https://www.rawstory.com/donald-trump-2674248037/",
    "timestamp": "2025-10-29T23:03:03Z"
  },
  {
    "title": "‘Non-interventionist’ Trump flexes muscles in Latin America",
    "description": "In a speech in Riyadh in May, President Donald Trump denounced generations of US interventionism, saying the Middle East was only made worse by Americans who fly in “giving you lectures on how to live and how to govern your own affairs.” Those views apparentl…",
    "link": "https://www.digitaljournal.com/world/non-interventionist-trump-flexes-muscles-in-latin-america/article",
    "timestamp": "2025-10-29T23:02:20Z"
  },
  {
    "title": "Food aid at risk of expiring as effort to fund SNAP benefits fails in Senate",
    "description": "Food aid for more than 40 million Americans is at risk of expiring at week's end",
    "link": "https://abcnews.go.com/Politics/wireStory/food-aid-risk-expiring-effort-fund-snap-benefits-126994439",
    "timestamp": "2025-10-29T23:01:53Z"
  },
  {
    "title": "US Army Corps of Engineers approves Enbridge plan to encase aging Great Lakes oil pipeline",
    "description": "The U.S. Army Corps of Engineers has approved energy company Enbridge's plan to encase a segment of an aging oil pipeline beneath a Great Lakes channel",
    "link": "https://abcnews.go.com/Business/wireStory/us-army-corps-engineers-approves-enbridge-plan-encase-126998688",
    "timestamp": "2025-10-29T23:01:51Z"
  },
  {
    "title": "'Non-interventionist' Trump flexes muscles in Latin America",
    "description": "In a speech in Riyadh in May, President Donald Trump denounced generations of US interventionism, saying the Middle East was only made worse by Americans who...",
    "link": "https://www.yahoo.com/news/articles/non-interventionist-trump-flexes-muscles-230143271.html",
    "timestamp": "2025-10-29T23:01:43Z"
  },
  {
    "title": "Israeli military kills two in new Gaza attack despite ‘resuming’ ceasefire",
    "description": "UN secretary-general strongly condemns Israeli attacks in Gaza on Tuesday, which killed more than 100 Palestinians.",
    "link": "https://www.aljazeera.com/news/2025/10/29/israeli-military-kills-two-in-new-gaza-attack-despite-resuming",
    "timestamp": "2025-10-29T23:01:31Z"
  },
  {
    "title": "Gavin Newsom is part of a disgusting new trend: Privileged people inventing ‘poorigin’ stories",
    "description": "Democrats used to be the party of the working class. In a bid to rebuild, party leaders are now overcompensating by clinging to any shred of a blue-collar existence.",
    "link": "https://nypost.com/2025/10/29/opinion/gavin-newsom-is-part-of-a-new-trend-inventing-poorigin-stories/",
    "timestamp": "2025-10-29T23:00:46Z"
  },
  {
    "title": "Painful to Watch: Top Biden Aide Admits to $4 Million Bonus if Biden Had Won Reelection",
    "description": "The fact that he was so lavishly compensated for his services is not the issue. The point is that a potential $4 million bonus is a powerful incentive to coverup a candidate’s deteriorating cognitive condition.\nThe post Painful to Watch: Top Biden Aide Admits…",
    "link": "https://legalinsurrection.com/2025/10/painful-to-watch-top-biden-aide-admits-to-4-million-bonus-if-biden-had-won-reelection/",
    "timestamp": "2025-10-29T23:00:14Z"
  },
  {
    "title": "A summit that bore fruit",
    "description": "PETALING JAYA: The 47th Asean Summit and Related Summits, chaired by Malaysia, showcased unprecedented diplomatic achievements and effective deliverables, while balancing the competing pressures of regional interests and global dynamics, analysts said. Read f…",
    "link": "https://www.thestar.com.my/news/nation/2025/10/30/a-summit-that-bore-fruit",
    "timestamp": "2025-10-29T23:00:00Z"
  },
  {
    "title": "What the U.S. Can Learn From China’s Technological Success",
    "description": "America only hurts itself by discounting what China has done well.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/10/united-states-china-technology/684754/",
    "timestamp": "2025-10-29T23:00:00Z"
  },
  {
    "title": "Husted Continues to Slam ‘Schumer Shutdown’",
    "description": "Even before the federal government shutdown started almost a month ago, Republicans united around the label of a “Schumer shutdown,” and such blame is sticking.... Read More\nThe post Husted Continues to Slam ‘Schumer Shutdown’ appeared first on The Daily Sign…",
    "link": "https://www.dailysignal.com/2025/10/29/husted-continues-to-slam-schumer-shutdown/",
    "timestamp": "2025-10-29T23:00:00Z"
  },
  {
    "title": "Washington’s $80-Billion Nuclear Play Targets AI’s Energy Hunger",
    "description": "The Trump Administration is following through on its pledge to revive America’s nuclear energy with a strategic partnership with Westinghouse and Cameco to help build large-scale nuclear power plants in the U.S. with a total investment of at least $80 billion…",
    "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Washingtons-80-Billion-Nuclear-Play-Targets-AIs-Energy-Hunger.html",
    "timestamp": "2025-10-29T23:00:00Z"
  },
  {
    "title": "Joy Behar Slams Jake Tapper for Not Writing About Trump’s Cognitive Abilities After Book About Biden’s | Video",
    "description": "\"The View\" co-host argues that the CNN journalist \"says nothing and writes nothing\" about the president's supposed mental decline\nThe post Joy Behar Slams Jake Tapper for Not Writing About Trump’s Cognitive Abilities After Book About Biden’s | Video appeared …",
    "link": "https://www.thewrap.com/joy-behar-slams-jake-tapper-trump-cognitive-decline-biden/",
    "timestamp": "2025-10-29T22:58:14Z"
  },
  {
    "title": "Putin Defies Trump With Second Nuclear Weapons Test In Days",
    "description": "Russia has successfully tested a nuclear-capable, nuclear-powered underwater drone, President Vladimir Putin said Wednesday, defying US President Donald Trump's warnings with Moscow's second test of a new nuclear weapons system in just a few days. Putin on Su…",
    "link": "https://freerepublic.com/focus/f-news/4349488/posts",
    "timestamp": "2025-10-29T22:56:25Z"
  },
  {
    "title": "Border Patrol Official No Longer Has To Brief Judge On Chicago Immigration Sweeps",
    "description": "A one-page suspension by an appeals court came before senior Border Patrol official Greg Bovino’s first meeting with a judge in downtown Chicago.",
    "link": "https://www.huffpost.com/entry/federal-enforcement-chicago_n_690295e6e4b057baa82d7947",
    "timestamp": "2025-10-29T22:55:55Z"
  },
  {
    "title": "Time to take on Obamacare, Dems’ cruel food-stamp game and other commentary",
    "description": "Democrats hope to use the shutdown to “extort the GOP into extending enriched ObamaCare subsidies” sold as “temporary pandemic support,” observes The Wall Street Journal editorial board.",
    "link": "https://nypost.com/2025/10/29/opinion/time-to-take-on-obamacare-dems-cruel-food-stamp-game-and-other-commentary/",
    "timestamp": "2025-10-29T22:53:00Z"
  },
  {
    "title": "The Fresh, New ‘Jacobin’ Faces of the Democrat Party",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post The Fresh, New ‘Jacobin’ Faces of the Democrat Party appeared first on …",
    "link": "https://www.dailysignal.com/2025/10/29/the-fresh-new-jacobin-faces-of-the-democrat-party/",
    "timestamp": "2025-10-29T22:52:00Z"
  },
  {
    "title": "Canadian Pacific profits leap despite U.S. tariff turmoil and looming merger prospect",
    "description": "Canadian Pacific Kansas City Ltd. reported a big profit boost in its latest quarter despite U.S. tariff disruption and fears over fallout from a potential merger of rivals down the line. The railway saw net income for the quarter ended Sept. 30 rise 10 per ce…",
    "link": "https://financialpost.com/pmn/canadian-pacific-profits-leap-despite-u-s-tariff-turmoil-and-looming-merger-prospect-2",
    "timestamp": "2025-10-29T22:51:27Z"
  },
  {
    "title": "Trump rallies the allies to break China’s dangerous mineral, rare earths monopoly",
    "description": "China’s suffocating stranglehold on critical minerals is a potent economic weapon — but Trump’s strategy, including international deals announced this week, is forcing Beijing’s hand.",
    "link": "https://nypost.com/2025/10/29/opinion/trump-rallies-the-allies-to-break-chinas-dangerous-mineral-rare-earths-monopoly/",
    "timestamp": "2025-10-29T22:48:53Z"
  },
  {
    "title": "These U.S. National Guards members say they’ll defy order to deploy in Chicago",
    "description": "Two Illinois National Guard members, both Democrats, say they will defy U.S. President Donald's Trump's order to deploy to the streets of Chicago.",
    "link": "https://www.cbc.ca/radio/asithappens/national-guard-dissent-9.6957454",
    "timestamp": "2025-10-29T22:42:06Z"
  },
  {
    "title": "AOC Tells Mom Giving Birth To Get A Real Job",
    "description": "https://babylonbee.com/news/aoc-tells-mom-giving-birth-to-get-a-real-job BRONX, NY — According to witnesses at the scene, Congresswoman Alexandria Ocasio-Cortez burst into a birthing suite at local Montefiore Hospital to tell off a woman in labor that she sho…",
    "link": "https://freerepublic.com/focus/f-chat/4349485/posts",
    "timestamp": "2025-10-29T22:41:54Z"
  },
  {
    "title": "The Art of the Grift: Bible-Pushing Prez Donald Trump Selling Bizarre MAGA Items, Is He Abusing His Position of Power?",
    "description": "Despite allegations claiming the Trumps are profiting off the president, the family business is running a robust online store.",
    "link": "https://radaronline.com/p/donald-trump-profiting-off-presidency-trump-2028-merch-store/",
    "timestamp": "2025-10-29T22:40:00Z"
  },
  {
    "title": "Gov. Jeff Landry: I’d let Trump pick LSU’s next football coach before AD Scott Woodward",
    "description": "Louisiana Gov. Jeff Landry is tired of what's been happening with the LSU football program.",
    "link": "https://nypost.com/2025/10/29/sports/gov-jeff-landry-id-let-trump-pick-lsus-next-coach-before-ad-scott-woodward/?utm_source=yahoo&amp;utm_campaign=nypost&amp;utm_medium=referral",
    "timestamp": "2025-10-29T22:39:01Z"
  },
  {
    "title": "Gov. Jeff Landry: I’d let Trump pick LSU’s next football coach before AD Scott Woodward",
    "description": "Louisiana Gov. Jeff Landry is tired of what's been happening with the LSU football program.",
    "link": "https://nypost.com/2025/10/29/sports/gov-jeff-landry-id-let-trump-pick-lsus-next-coach-before-ad-scott-woodward/",
    "timestamp": "2025-10-29T22:39:01Z"
  },
  {
    "title": "Negotiators were taking ‘important steps’ before Trump halted talks, ambassador says",
    "description": "Canadian and American trade negotiators were starting to put ideas about a potential agreement on paper before U.S. President Donald Trump abruptly ended trade talks last week, Canada’s ambassador in Washington says.",
    "link": "https://www.cbc.ca/news/politics/trade-talks-progress-before-trump-halts-negotiations-9.6959238",
    "timestamp": "2025-10-29T22:38:44Z"
  },
  {
    "title": "U.S. Senate rebuffs Trump on Canada tariffs amid GOP dissent on trade",
    "description": "The Republican-controlled Senate narrowly passed a bill to end Donald Trump’s tariffs on Canada, highlighting GOP dissent. Find out more now",
    "link": "https://financialpost.com/news/us-senate-rebuffs-trump-canada-tariffs",
    "timestamp": "2025-10-29T22:38:18Z"
  },
  {
    "title": "Senate Rebuffs Trump on Canada Tariffs Amid GOP Dissent on Trade",
    "description": "The Republican-controlled Senate narrowly passed a bill to end Donald Trump’s tariffs on Canada, highlighting GOP divisions over the duties just days after the president threatened to increase them further to punish the US’s northern neighbor.",
    "link": "https://financialpost.com/pmn/business-pmn/senate-rebuffs-trump-on-canada-tariffs-amid-gop-dissent-on-trade",
    "timestamp": "2025-10-29T22:38:18Z"
  },
  {
    "title": "Republican lawmaker says don't give China Nvidia's Blackwell chip",
    "description": "By Karen Freifeld (Reuters) -A leading Republican voice in Congress on China policy said on Wednesday that selling Nvidia's best AI chip to China \"would be...",
    "link": "https://finance.yahoo.com/news/republican-lawmaker-says-dont-china-223610651.html",
    "timestamp": "2025-10-29T22:36:10Z"
  },
  {
    "title": "China Confirms Xi and Trump Will Meet in South Korea on Thursday",
    "description": "The Chinese Foreign Ministry on Wednesday confirmed that dictator Xi Jinping will meet with President Donald Trump on the sidelines of the Asia-Pacific Economic Cooperation (APEC) forum in South Korea on Thursday.\nThe post China Confirms Xi and Trump Will Mee…",
    "link": "https://www.breitbart.com/asia/2025/10/29/china-confirms-xi-and-trump-will-meet-in-south-korea-on-thursday/",
    "timestamp": "2025-10-29T22:34:55Z"
  },
  {
    "title": "The Deadline for a Major Shutdown Casualty",
    "description": "Roughly 42 million Americans may not get their SNAP benefits on Saturday.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/10/snap-benefits-major-shutdown/684757/",
    "timestamp": "2025-10-29T22:33:00Z"
  },
  {
    "title": "Democratic congressional candidate indicted in anti-ICE protest that turned violent in Illinois",
    "description": "Democratic congressional candidate Katherine “Kat\" Abughazaleh is facing federal charges after allegedly blocking an ICE vehicle during an Illinois protest.",
    "link": "https://www.foxnews.com/politics/democratic-congressional-candidate-indicted-anti-ice-protest-turned-violent-illinois",
    "timestamp": "2025-10-29T22:32:07Z"
  },
  {
    "title": "Donald Trump Makes Nuclear Submarine Deal with South Korea",
    "description": "The United States will share nuclear-powered submarine technology with South Korea, President Donald Trump said Thursday, announcing the move on social media after meeting with South Korean President Lee Jae Myung.\nLee told Trump during their Wednesday meetin…",
    "link": "https://biztoc.com/x/a84a59cfd75fb31a",
    "timestamp": "2025-10-29T22:30:56Z"
  },
  {
    "title": "CNN’s Jake Tapper Predicts Gen Z Will Be ‘A Lot More Conservative,’ Sees Backlash to BLM and Progressive Politics ‘Being Forced Down Their Throats’",
    "description": "CNN's Jake Tapper said the youth is in revolt against Democrats and predicted Gen Z will be \"more conservative,\" due to BLM and other progressive programs\nThe post CNN’s Jake Tapper Predicts Gen Z Will Be ‘A Lot More Conservative,’ Sees Backlash to BLM and Pr…",
    "link": "https://www.mediaite.com/media/news/cnns-jake-tapper-predicts-gen-z-will-be-a-lot-more-conservative-sees-backlash-to-blm-and-progressive-politics-being-forced-down-their-throats/",
    "timestamp": "2025-10-29T22:30:47Z"
  },
  {
    "title": "4 Senate Republicans break with GOP to rebuke Trump over Canada tariffs",
    "description": "Senate Republicans sent President Donald Trump a \"symbolic\" rebuke on Wednesday by voting to end the national emergency he declared in February, justifying his increase in tariffs on Canadian goods, according to a new report. The Washington Post reported on W…",
    "link": "https://www.rawstory.com/trump-tariffs-2674248091/",
    "timestamp": "2025-10-29T22:30:12Z"
  },
  {
    "title": "Trump, Xi to meet seeking truce in damaging trade war",
    "description": "The tussle between the world's top two economies, has rocked markets and gummed up supply chains for months.",
    "link": "https://www.japantimes.co.jp/news/2025/10/30/world/politics/trump-xi-trade-war/",
    "timestamp": "2025-10-29T22:29:00Z"
  },
  {
    "title": "Feds Say Kat Abughazaleh “Impeded” ICE Agents. That Would Put Her on the Right Side of History.",
    "description": "If six people nonviolently protesting outside an ICE facility is a criminal conspiracy, all First Amendment-protected activity is at risk.\nThe post Feds Say Kat Abughazaleh “Impeded” ICE Agents. That Would Put Her on the Right Side of History. appeared first …",
    "link": "https://theintercept.com/2025/10/29/kat-abughazaleh-ice-protest-indictment/",
    "timestamp": "2025-10-29T22:28:28Z"
  },
  {
    "title": "Poll--2:1 'Strong' Support for Deporting All Economic Migrants",
    "description": "A new poll shows 2:1 strong support for deporting all non-criminal illegal migrants versus strong opposition. \nThe post Poll–2:1 ‘Strong’ Support for Deporting All Economic Migrants appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/10/29/poll-21-strong-support-for-deporting-all-economic-migrants/",
    "timestamp": "2025-10-29T22:26:23Z"
  },
  {
    "title": "Jonathan Karl explores Trump’s focus on retribution in new book",
    "description": "In his new book, ABC News' chief Washington correspondent Jonathan Karl offers a behind-the-scenes look at key moments on the 2024 campaign trail that ended one party's hold on the White House and brought another back to power. Geoff Bennett sat down with Kar…",
    "link": "https://www.pbs.org/newshour/show/jonathan-karl-explores-trumps-focus-on-retribution-in-new-book",
    "timestamp": "2025-10-29T22:25:13Z"
  },
  {
    "title": "Americans have a secret weapon against Trump",
    "description": "President Donald Trump is clearly unpopular: Most Americans disapprove of his performance and millions recently turned out for “No Kings” protests. So why is it that so many major corporations and billionaires are either actively assisting Trump’s attack on d…",
    "link": "https://www.vox.com/politics/466518/trump-business-boycott-democracy-resistance",
    "timestamp": "2025-10-29T22:24:00Z"
  },
  {
    "title": "Mark Levin Unloads on ‘Third Reich Bannon’ for Claiming Trump Can Serve Third Term",
    "description": "Fox News host Mark Levin blasted Steve Bannon on Wednesday for continuing to insist that President Donald Trump can serve a third term.\nThe post Mark Levin Unloads on ‘Third Reich Bannon’ for Claiming Trump Can Serve Third Term first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/mark-levin-unloads-on-third-reich-bannon-for-claiming-trump-can-serve-third-term/",
    "timestamp": "2025-10-29T22:22:24Z"
  },
  {
    "title": "Fed rate cut is too little, too late — time to show glum Jerome Powell the door",
    "description": "Fed chair Jerome Powell should be cheerleading Trump’s supply-side and pro-America policies, while waving cautionary flags about his tariffs. Instead, he's been a restraint on growth.",
    "link": "https://nypost.com/2025/10/29/opinion/fed-rate-cut-is-too-little-too-late-show-jerome-powell-the-door/",
    "timestamp": "2025-10-29T22:18:57Z"
  },
  {
    "title": "Canadian Pacific profits leap despite U.S. tariff turmoil and looming merger prospect",
    "description": "Canadian Pacific Kansas City Ltd. reported a big profit boost in its latest quarter despite U.S. tariff disruption and fears over fallout from a potential merger of rivals down the line. The railway saw net income for the quarter ended Sept. 30 rise 10 per ce…",
    "link": "https://financialpost.com/pmn/canadian-pacific-profits-leap-despite-u-s-tariff-turmoil-and-looming-merger-prospect",
    "timestamp": "2025-10-29T22:17:32Z"
  },
  {
    "title": "Shutdown pressure points pile up: From the Politics Desk",
    "description": "A series of deadlines are increasing the pressure on members of Congress to bring an end to the 29-day government shutdown.",
    "link": "https://www.nbcnews.com/politics/politics-news/shutdown-pressure-points-pile-up-politics-desk-rcna240647",
    "timestamp": "2025-10-29T22:15:55Z"
  },
  {
    "title": "Why Louisiana governor claims he will not allow LSU AD Scott Woodward to hire Brian Kelly replacement",
    "description": "The governor of Louisiana is attempting to cut LSU athletic director Scott Woodward out of the school's coaching search",
    "link": "https://www.sportingnews.com/us/ncaa-football/news/louisiana-governor-not-allow-lsu-athletic-director-hire/a55332e92032f4e688cb4a8e",
    "timestamp": "2025-10-29T22:14:32Z"
  },
  {
    "title": "Four Senate Republicans vote with Democrats in effort to end Trump tariffs on Canada",
    "description": "The Senate passed a resolution aimed at ending President Donald Trump’s tariffs on Canada, with four Republicans joining Democrats to rebuke the administration’s trade policies a day after they voted to terminate tariffs on Brazil. Sens. Rand Paul, Lisa Murko…",
    "link": "https://freerepublic.com/focus/f-news/4349482/posts",
    "timestamp": "2025-10-29T22:14:07Z"
  },
  {
    "title": "Why is Donald Trump so interested in rare earth minerals?",
    "description": "The US president has struck a number of deals in his tour of Asia this week.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/10/29/why-is-donald-trump-so-interested-in-rare-earth-minerals",
    "timestamp": "2025-10-29T22:13:28Z"
  },
  {
    "title": "US President Trump, New Zealand's Luxon discuss ties in South Korea meeting",
    "description": "WELLINGTON (Reuters) -New Zealand Prime Minister Christopher Luxon had his first in-person meeting with U.S. President Donald Trump late on Wednesday in South Korea, ahead of a dinner hosted by South Korean President Lee Jae Myung. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/30/us-president-trump-new-zealand039s-luxon-discuss-ties-in-south-korea-meeting",
    "timestamp": "2025-10-29T22:12:00Z"
  },
  {
    "title": "US will share tech to let South Korea build a nuclear-powered submarine, Trump says",
    "description": "The United States will share closely held technology to allow South Korea to build a nuclear-powered submarine, President Donald Trump said on social media...",
    "link": "https://www.yahoo.com/news/articles/us-share-tech-let-south-221059434.html",
    "timestamp": "2025-10-29T22:10:59Z"
  },
  {
    "title": "Things Are Getting Real For Democrats As Food Cliff For Millions Approaches",
    "description": "Democrats wanted a fight over health care, but it's the millions of people who rely on food assistance that could suffer the immediate consequences of a government shutdown.",
    "link": "https://www.huffpost.com/entry/democrats-government-shutdown-food-stamps_n_69027e97e4b057baa82d6cdb",
    "timestamp": "2025-10-29T22:10:45Z"
  },
  {
    "title": "Governor Jeff Landry makes major Scott Woodward declaration after LSU fired Brian Kelly",
    "description": "Louisiana Governor Jeff Landry said that Scott Woodward will not hire the next coach for the Tigers after firing Brian Kelly.",
    "link": "https://clutchpoints.com/ncaa-football/lsu-football-news-governor-landry-makes-announcement-after-kelly-firing",
    "timestamp": "2025-10-29T22:09:02Z"
  },
  {
    "title": "Senate Republicans release subpoenas sought by Jack Smith during Trump probe",
    "description": "Senate Republicans aren’t standing down in their investigation into the tactics Biden-era special counsel Jack Smith deployed as part of his probe into President Donald Trump’s efforts to subvert the 2020 presidential election results. \nStill smarting from re…",
    "link": "https://biztoc.com/x/72a64a25f91ba0a6",
    "timestamp": "2025-10-29T22:08:40Z"
  },
  {
    "title": "East Wing It Travel: Frontier's Monument to Mistaken Marketing",
    "description": "East Wing It Travel: Frontier's Monument to Mistaken Marketingwestword.com",
    "link": "http://www.westword.com/opinion/frontier-east-wing-it-campaign-a-monument-to-mistaken-marketing-40798349/",
    "timestamp": "2025-10-29T22:07:47Z"
  },
  {
    "title": "Four Republicans Team Up With Democrats To Block Trump’s Canada Tariffs",
    "description": "The Senate approved a resolution blocking President Donald Trump’s tariffs on Canada on Wednesday evening, dealing a symbolic blow to the president’s trade policy. Republican Sens. Rand Paul and Mitch McConnell of Kentucky, Susan Collins of Maine and Lisa Mur…",
    "link": "https://dailycaller.com/2025/10/29/four-republicans-democrats-trump-canada-tariffs/",
    "timestamp": "2025-10-29T22:06:30Z"
  },
  {
    "title": "Meta repents again to Republicans in hearing over moderation, while Google stands its ground",
    "description": "At a Senate hearing Wednesday on government censorship of tech platforms, a Meta executive expressed regret to Republican lawmakers for failing to speak out more against the Biden administration's requests that it remove health and election misinformation, in…",
    "link": "https://www.theverge.com/policy/809613/senate-commerce-jawboning-tech-speech-hearing",
    "timestamp": "2025-10-29T22:06:23Z"
  },
  {
    "title": "US Democratic congressional candidate indicted for Chicago ICE protest",
    "description": "Candidate Kat Abughazaleh decried the charges as 'political prosecution' amid a Trump standoff with Democratic cities.",
    "link": "https://www.aljazeera.com/news/2025/10/29/us-democratic-congressional-candidate-indicted-for-chicago-ice-protest",
    "timestamp": "2025-10-29T22:05:52Z"
  },
  {
    "title": "How Russia Sanctions Could Affect India",
    "description": "U.S. and EU penalties on Russian oil companies raise the stakes for New Delhi’s trade talks with Washington.",
    "link": "http://foreignpolicy.com/2025/10/29/india-russia-oil-sanctions-reliance-trump-trade/",
    "timestamp": "2025-10-29T22:05:42Z"
  },
  {
    "title": "Senate is voting on a Democratic effort to block Trump’s tariffs on Canadian imports",
    "description": "Senators are voting to terminate the national emergencies that Trump has used to impose tariffs.",
    "link": "https://www.bostonherald.com/2025/10/29/senate-vote-canada-trump-tariffs/",
    "timestamp": "2025-10-29T22:05:38Z"
  },
  {
    "title": "Trump-Xi meeting live: China and US to negotiate rare earths, tariffs",
    "description": "Tensions between China and the US have escalated amid Donald Trump's tariff threats and new restrictions on exports.",
    "link": "https://www.aljazeera.com/news/liveblog/2025/10/29/trump-xi-meeting-live-china-and-us-to-negotiate-rare-earths-tariffs",
    "timestamp": "2025-10-29T22:05:17Z"
  },
  {
    "title": "Democrats’ Shutdown Stops Traffic At Critical American Airport",
    "description": "A 75-minute ground stop was issued at Newark Liberty International Airport on Wednesday due to \"staffing issues\" spurred by the federal government shutdown.",
    "link": "https://dailycaller.com/2025/10/29/government-shutdown-newark-airport-air-traffic-controllers/",
    "timestamp": "2025-10-29T22:03:48Z"
  },
  {
    "title": "Senate Republicans defect, reject Trump's tariffs on Canadian goods",
    "description": "The Senate again voted to end President Donald Trump's emergency powers for Canadian tariffs, despite Vice President JD Vance warning Republicans against breaking with the White House.",
    "link": "https://www.foxnews.com/politics/senate-republicans-defect-reject-trumps-tariffs-canadian-goods",
    "timestamp": "2025-10-29T22:03:36Z"
  },
  {
    "title": "Tether now holds $135B in U.S. debt – Bigger than South Korea!",
    "description": "Tether backs USDT with $135B in Treasuries, becoming a major player in global liquidity markets.",
    "link": "https://ambcrypto.com/tether-becomes-17th-largest-u-s-debt-holder-with-135b-in-treasuries/",
    "timestamp": "2025-10-29T22:00:58Z"
  },
  {
    "title": "Why Trump Keeps Talking About a Third Term",
    "description": "From the daily newsletter: the legal writer Ruth Marcus on why the President and his allies have floated a seemingly unconstitutional idea.",
    "link": "https://www.newyorker.com/newsletter/the-daily/why-trump-keeps-talking-about-a-third-term",
    "timestamp": "2025-10-29T22:00:00Z"
  },
  {
    "title": "‘Not backing down’: Far-left Democrat candidate indicted after clashing with ICE during raucous demonstrations",
    "description": "'This political prosecution is an attack on all of our First Amendment rights'",
    "link": "https://www.wnd.com/2025/10/not-backing-down-far-left-democrat-candidate-indicted/",
    "timestamp": "2025-10-29T21:59:48Z"
  },
  {
    "title": "ICE and the Smartphone Panopticon",
    "description": "A new wave of digital tools has emerged to help citizens monitor Trump’s crackdown. But internet surveillance can also be used against you.",
    "link": "https://www.newyorker.com/culture/infinite-scroll/ice-and-the-smartphone-panopticon",
    "timestamp": "2025-10-29T21:59:09Z"
  },
  {
    "title": "Colorado says relocation of Space Command to Alabama is 'punishment' for mail-in voting",
    "description": "Colorado officials say the relocation of U.S. Space Command to Alabama was illegally motivated by President Donald Trump’s desire to punish Colorado for allowing mail-in voting",
    "link": "https://abcnews.go.com/US/wireStory/colorado-relocation-space-command-alabama-punishment-mail-voting-126997683",
    "timestamp": "2025-10-29T21:57:55Z"
  },
  {
    "title": "Senate is voting on a Democratic effort to block Trump's tariffs on Canadian imports",
    "description": "The Senate is voting on legislation that would nullify U.S. tariffs on Canada",
    "link": "https://abcnews.go.com/US/wireStory/senate-voting-democratic-effort-block-trumps-tariffs-canadian-126997561",
    "timestamp": "2025-10-29T21:57:53Z"
  },
  {
    "title": "FAA Halts Flights at New Jersey Airport Due to Staffing Issues During Schumer Shutdown",
    "description": "The Federal Aviation Administration (FAA) halted flights at Newark Liberty International Airport in New Jersey due to staffing shortages of air traffic controllers as the government shutdown continues, according to multiple reports.\nThe post FAA Halts Flights…",
    "link": "https://www.breitbart.com/politics/2025/10/29/faa-halts-flights-at-new-jersey-airport-due-to-staffing-issues-during-schumer-shutdown/",
    "timestamp": "2025-10-29T21:55:30Z"
  },
  {
    "title": "'Dirty cop!' Trump unleashes rant on enemies and people he fired",
    "description": "President Donald Trump unleashed a rant on his Truth Social platform on Wednesday, calling a former FBI agent he fired a \"dirty cop\" and listing out the names of his enemies and other people he has beefed with. The president is traveling across Asia — where h…",
    "link": "https://www.rawstory.com/donald-trump-2674247936/",
    "timestamp": "2025-10-29T21:55:03Z"
  },
  {
    "title": "Shinzo Abe Killer’s Trial Is Exposing the Christian Cult Entrenched in Japanese Politics",
    "description": "Tetsuya Yamagami is now on trial after the killing that forced a national reckoning.\nThe post Shinzo Abe Killer’s Trial Is Exposing the Christian Cult Entrenched in Japanese Politics appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/29/japan-shinzo-abe-assassination-trial-unification-church-moon/",
    "timestamp": "2025-10-29T21:54:41Z"
  },
  {
    "title": "Trump, 79, Fires Off Gibberish Truth Social Message",
    "description": "Donald Trump is facing mockery after sending out a gibberish Truth Social message on Wednesday before quickly deleting it. The chronically-online president, ...",
    "link": "https://www.thedailybeast.com/trump-79-fires-off-gibberish-truth-social-message/",
    "timestamp": "2025-10-29T21:48:56Z"
  },
  {
    "title": "'Something is rotten': Analyst urges action with harsh portrayal of Trump's 'odd behavior'",
    "description": "Writer Rafi Schwartz is puzzled how President Donald Trump’s apparent mental deterioration isn’t ringing alarm bells and scaring people.“Are we just going to sit around and pretend that the president isn’t having a lot of … questionable moments these days?” S…",
    "link": "https://www.rawstory.com/something-is-rotten-analyst-urges-action-with-harsh-portrayal-of-trump-s-odd-behavior/",
    "timestamp": "2025-10-29T21:47:03Z"
  },
  {
    "title": "Trump calls for probe into former FBI agent Giardina",
    "description": "United States President Donald Trump called on the legal authorities to investigate former Federal Bureau of Investigation Special Agent Walter Giardina, who was fired back in August.\"Former FBI Agent...",
    "link": "https://biztoc.com/x/b096e0680a921754",
    "timestamp": "2025-10-29T21:46:32Z"
  },
  {
    "title": "Trump: S. Korea gets nuclear sub green light",
    "description": "US President Donald Trump announced that South Korea has received approval to build a nuclear-powered submarine following a major trade and investment agreement between the two nations. In a post, Tru...",
    "link": "https://biztoc.com/x/4792b67b6b11aff1",
    "timestamp": "2025-10-29T21:46:29Z"
  }
]