[
  {
    "title": "'Down payment' for 'fan service': Trump's Kennedy Center picks flagged by analyst",
    "description": "President Donald Trump gave a pair of key Fox News hosts covering him coveted appointments to the board that runs the Kennedy Center — setting up yet another massive conflict of interest in a presidency infamous for them, wrote Jeremy Barr for The Washington …",
    "link": "https://www.rawstory.com/trump-fox-kennedy-appointments/",
    "timestamp": "2025-03-13T20:28:56Z"
  },
  {
    "title": "US deportation flights to Venezuela set to resume",
    "description": "Venezuela will once more accept deportation flights from the United States, both sides said Thursday, weeks after Caracas suspended cooperation in protest over Washington stripping oil giant Chevron of a sanctions waiver. “I am pleased to announce that Venezu…",
    "link": "https://www.digitaljournal.com/world/us-deportation-flights-to-venezuela-set-to-resume/article",
    "timestamp": "2025-03-13T20:28:27Z"
  },
  {
    "title": "The Brief – It’s time for Europe to become more Swiss",
    "description": "Excluding the far right is not working for Europe. Maybe it is time to think about something new.",
    "link": "https://www.euractiv.com/section/politics/opinion/the-brief-its-time-for-europe-to-become-more-swiss/",
    "timestamp": "2025-03-13T20:28:08Z"
  },
  {
    "title": "Why Elon Musk and DOGE Might Love a Government Shutdown",
    "description": "A shutdown would temporarily give the executive branch even broader powers over what government services are deemed \"essential.\"",
    "link": "https://www.newsweek.com/doge-government-shutdown-donald-trump-2044442",
    "timestamp": "2025-03-13T20:28:05Z"
  },
  {
    "title": "The Arms Industry Experiencing Boom from Asia to Europe",
    "description": "Ukraine is now the worldwide leader of arms imports, NATO has doubled imports, and Russia falls from the second spot in arms dealing. President Donald Trump has repeatedly claimed that Europe isn’t pulling its weight. Still, according to new data from the Sto…",
    "link": "https://nationalinterest.org/blog/buzz/the-arms-industry-experiencing-boom-from-asia-to-europe/",
    "timestamp": "2025-03-13T20:26:25Z"
  },
  {
    "title": "ECB's Villeroy: Tariffs tragedy for US economy",
    "description": "Member of the European Central Bank (ECB) Governing Council and Bank of France Governor Francois Villeroy de Galhau claimed on Thursday that the tariffs United States President Donald Trump introduced...",
    "link": "https://biztoc.com/x/ff53e7ce13a21d6d",
    "timestamp": "2025-03-13T20:26:17Z"
  },
  {
    "title": "Ticker: Wall Street enters ‘correction’ territory; Quit your whining",
    "description": "Wall Street’s sell-off hit a new low Thursday after President Donald Trump’s escalating trade war dragged the S&P 500 more than 10% below its record, which was set just last month.",
    "link": "https://www.bostonherald.com/2025/03/13/ticker-wall-street-enters-correction-territory-quit-your-whining/",
    "timestamp": "2025-03-13T20:24:45Z"
  },
  {
    "title": "TikTok is making some employees choose: PIP or severance",
    "description": "As TikTok and ByteDance staff get their annual performance scores, some are being offered a choice to go on a PIP or take severance and leave.",
    "link": "https://www.businessinsider.com/tiktok-employee-reviews-choose-pip-or-severance-2025-3",
    "timestamp": "2025-03-13T20:24:37Z"
  },
  {
    "title": "Keith Duggan: US visit gives North’s Deputy First Minister a chance to tell a new story",
    "description": "Emma Little-Pengelly and Donald Trump discussed the ‘long-standing and close ties’ between the US and Northern Ireland",
    "link": "https://www.irishtimes.com/world/us/2025/03/13/keith-duggan-us-visit-gives-norths-deputy-first-minister-a-chance-to-tell-a-new-story/",
    "timestamp": "2025-03-13T20:24:12Z"
  },
  {
    "title": "Here's What Happened Today: Thursday",
    "description": "Here’s your round-up of the day’s news.",
    "link": "https://www.thejournal.ie/evening-headlines-47-6649292-Mar2025/",
    "timestamp": "2025-03-13T20:23:39Z"
  },
  {
    "title": "Wall Street Tumbles 10% Below Its Record After Trump Escalates His Trade War",
    "description": "Wall Street’s sell-off hit a new low following President Donald Trump’s latest escalation in his trade war.",
    "link": "https://www.huffpost.com/entry/financial-markets_n_67d33e10e4b0756a721aba6d",
    "timestamp": "2025-03-13T20:23:29Z"
  },
  {
    "title": "Trump: It'll Be 'Disappointing' If Putin Doesn't Agree to Truce",
    "description": "President Donald Trump says serious talks are being held with Russia's Vladimir Putin about ending the war in Ukraine, but he says \"it doesn't mean anything until we hear what the final outcome is.\" Trump spoke at the White House.\nPutin said he wants to discu…",
    "link": "https://biztoc.com/x/216e443861c4c238",
    "timestamp": "2025-03-13T20:23:05Z"
  },
  {
    "title": "Donald Trump escalates trade war with Europe, threatening 200% tariffs on champagne and wine in latest retaliation",
    "description": "Trump threatens 200% tariffs on EU champagne and wine, retaliating against EU whiskey taxes. Trade war escalation risks prices, jobs, and US-EU economic relations.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-escalates-trade-war-with-europe-threatening-200-tariffs-on-champagne-and-wine-in-latest-retaliation/articleshow/118993184.cms",
    "timestamp": "2025-03-13T20:22:57Z"
  },
  {
    "title": "A 10% drop for stocks is scary, but isn't that rare",
    "description": "The U.S. stock market has just dropped 10% from its high set last month, hurt by worries about the economy and a global trade war",
    "link": "https://abcnews.go.com/Technology/wireStory/10-drop-stocks-scary-rare-119770768",
    "timestamp": "2025-03-13T20:22:20Z"
  },
  {
    "title": "Canadians’ travel appetite still big, but desire to visit U.S. fading: Transat CEO",
    "description": "MONTREAL — The head of Transat A.T. Inc. says Canadians’ appetite for travel remains unsated — at least for overseas trips _ even as pocketbook worries grow amid a trade war with the United States. Travellers continue to book transatlantic flights with the to…",
    "link": "https://financialpost.com/pmn/canadians-travel-appetite-still-big-but-desire-to-visit-u-s-fading-transat-ceo",
    "timestamp": "2025-03-13T20:22:02Z"
  },
  {
    "title": "Trump Threatens to Invade Greenland in Wild Press Conference",
    "description": "Donald Trump suggested Thursday that NATO Secretary General Mark Rutte could be “very instrumental” in helping him carry out his imperialist fantasy of wresting Greenland from Denmark.\r\nDuring a meeting in the Oval Office, Trump was asked about the “potential…",
    "link": "https://newrepublic.com/post/192736/donald-trump-threatens-invade-greenland",
    "timestamp": "2025-03-13T20:21:49Z"
  },
  {
    "title": "Toast, Shift4 lead drop in fintechs as investors exit stocks tied to consumer spending",
    "description": "Fintech stocks are under pressure as investors worry about companies heavily reliant on consumer spending.",
    "link": "https://www.cnbc.com/2025/03/13/toast-shift4-lead-drop-in-fintechs-investors-fret-over-spending.html",
    "timestamp": "2025-03-13T20:20:49Z"
  },
  {
    "title": "US wine shops and importers say Trump's threatened 200% tariff on European wines would kill demand",
    "description": "The United States is suddenly looking less bubbly for European wines.  President Donald Trump on Thursday threatened a 200% tariff on European wine...",
    "link": "https://www.yahoo.com/news/us-wine-shops-importers-trumps-202037175.html",
    "timestamp": "2025-03-13T20:20:37Z"
  },
  {
    "title": "Mahmoud Khalil Is an Easy Call",
    "description": "The case of Mahmoud Khalil, a Columbia University graduate student and green card holder who was detained by immigration officials after participating in",
    "link": "https://reason.com/2025/03/13/mahmoud-khalil-is-an-easy-call/",
    "timestamp": "2025-03-13T20:20:05Z"
  },
  {
    "title": "Undocumented Subprime Borrowers Pose Risk to Wall Street",
    "description": "Marcelo Rodriguez is in the middle of a chain of lending that has connected Wall Street to New York’s Spanish-speaking community, providing a lifeline to vulnerable borrowers including the undocumented. That lifeline is now starting to fray.",
    "link": "https://www.livemint.com/companies/news/undocumented-subprime-borrowers-pose-risk-to-wall-street-11741897190288.html",
    "timestamp": "2025-03-13T20:19:49Z"
  },
  {
    "title": "The Hitchhiker's Guide to where we stand with a potential government shutdown",
    "description": "Democrats are torn on how to vote for Trump's budget bill amid a looming government shutdown if an agreement is not made.",
    "link": "https://www.foxnews.com/politics/hitchhikers-guide-where-we-stand-potential-government-shutdown",
    "timestamp": "2025-03-13T20:18:49Z"
  },
  {
    "title": "March megastorm may bring blizzards, tornadoes, flooding and even fires across much of US",
    "description": "More than 100 million people in the U.S. will be in the path of an intense March storm starting Friday as the sprawling multi-day system threatens fires, blizzards, tornadoes, and flooding as it tracks eastward across the Great Plains.",
    "link": "https://phys.org/news/2025-03-megastorm-blizzards-tornadoes.html",
    "timestamp": "2025-03-13T20:17:44Z"
  },
  {
    "title": "'We engage with Trump's office, not opinions': Little-Pengelly",
    "description": "The  deputy first minister has said she engages \"with the office of president\" rather than his \"particular personal views\".",
    "link": "https://www.bbc.com/news/articles/c3e4dwdn243o",
    "timestamp": "2025-03-13T20:17:20Z"
  },
  {
    "title": "Tata Motors considers new ICE models as EV adoption slows, competition intensifies",
    "description": "Tata Motors has acknowledged increased competition from JSW Group’s MG Windsor&nbsp;",
    "link": "https://www.livemint.com/companies/tata-motors-new-ice-ev-adoption-slows-jsw-mg-windsor-nexon-mahindra-mahindra-bse-auto-hyundai-maruti-11741874292536.html",
    "timestamp": "2025-03-13T20:16:58Z"
  },
  {
    "title": "How Trump is implementing his plan to reduce the federal workforce",
    "description": "Since taking office, President Trump has championed the idea of reducing the federal workforce. A February 26 memo gave agencies until today to come up with a plan for that reduction. What does this memo mean and how is it different than the previous cuts fed…",
    "link": "https://www.npr.org/2025/03/13/1238261952/how-trump-is-implementing-his-plan-to-reduce-the-federal-workforce",
    "timestamp": "2025-03-13T20:16:32Z"
  },
  {
    "title": "Trump asks Supreme Court to intervene in bid to curb birthright citizenship",
    "description": "WASHINGTON — Donald Trump took the fight over his attempt to restrict automatic U.S. birthright citizenship to the Supreme Court on Thursday as the Republican president's administration asked the justices to narrow a judicial block imposed on this key element…",
    "link": "https://www.voanews.com/a/trump-asks-supreme-court-to-intervene-in-bid-to-curb-birthright-citizenship/8009956.html",
    "timestamp": "2025-03-13T20:15:52Z"
  },
  {
    "title": "Paranoia runs deep",
    "description": "Andrew Gelman has some thoughts on my thoughts regarding Naomi Wolf and the varieties of stupid experience. Gelman’s take is that Wolf’s post about how her computer went on the fritz “coincidentally” immediately after she endorsed Donald Trump is that Wolf wa…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/paranoia-runs-deep-3",
    "timestamp": "2025-03-13T20:15:34Z"
  },
  {
    "title": "Tesla warns Trump administration it is 'exposed' to retaliatory tariffs (Financial Times)",
    "description": "Financial Times:\nTesla warns Trump administration it is ‘exposed’ to retaliatory tariffs  —  Elon Musk's electric-car maker says levies could make it costlier to produce vehicles in the US  —  Elon Musk's electric-car maker Tesla has warned that President Don…",
    "link": "https://www.memeorandum.com/250313/p122",
    "timestamp": "2025-03-13T20:15:00Z"
  },
  {
    "title": "Algoma Steel CEO hopes for federal boost amid tariff pressures",
    "description": "Canadian steelmaker Algoma Steel Group Inc. ASTL-T is still making money despite newly imposed tariffs on Canadian steel imports, and the company’s CEO said a Buy Canadian mandate Ottawa could provide an important boost. \nU.S. President Donald Trump on Wednes…",
    "link": "https://biztoc.com/x/bd23329c7fabd3fa",
    "timestamp": "2025-03-13T20:13:53Z"
  },
  {
    "title": "Meta Successfully Blocks Promotion Of Tell-All Book About Company",
    "description": "Ironically, Mark Zuckerberg's company efforts to shut down the salacious book may only give it more free publicity.",
    "link": "https://www.huffpost.com/entry/meta-tell-all-book-careless-people_n_67d3113ce4b0e72dd7fee033",
    "timestamp": "2025-03-13T20:13:50Z"
  },
  {
    "title": "Trump Gets Brutal News From Republicans in Devastating Polls",
    "description": "Even though they won’t come right out and say it, Republicans are proving increasingly unhappy with Donald Trump’s trade war.\r\nA new Reuters-Ipsos poll out Thursday indicates that three in 10 Republicans believe the president has been “too erratic” in carryin…",
    "link": "https://newrepublic.com/post/192734/donald-trump-shocking-news-republicans-approval-poll",
    "timestamp": "2025-03-13T20:13:41Z"
  },
  {
    "title": "S&P 500 slides into a correction as trade and inflation weigh on traders",
    "description": "The widely followed stock index fell more than 10 percent as President Donald Trump threatened to escalate a tariff tiff with the European Union.",
    "link": "https://biztoc.com/x/433a652e0a7f3416",
    "timestamp": "2025-03-13T20:13:33Z"
  },
  {
    "title": "President Trump Warns Anti?Tesla Protesters They'll Go Through 'Hell' - Yahoo Finance",
    "description": "President Trump Warns Anti?Tesla Protesters They'll Go Through 'Hell'Yahoo Finance People Zoomed Into Donald Trump's Tesla Sales Pitch And Can't Believe What They're SeeingYahoo Entertainment Trump pitched Teslas on the White House lawn. His next move may be …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176705579",
    "timestamp": "2025-03-13T20:13:03Z"
  },
  {
    "title": "Trump Pardons Tenn. Republican Who Pleaded Guilty To Campaign Finance Scheme",
    "description": "Former state Sen. Brian Kelsey said he believed \"God used Donald Trump to save me.\"",
    "link": "https://www.huffpost.com/entry/trump-pardons-brian-kelsey-campaign-finance_n_67d31c30e4b022e5d6b34620",
    "timestamp": "2025-03-13T20:12:39Z"
  },
  {
    "title": "The Trump Administration Hosted An Entire Day Dedicated To Spreading Hate About Trans People",
    "description": "The day was a signal that the Trump administration will continue to prop up those who fearmonger and spread misinformation about trans people.",
    "link": "https://www.huffpost.com/entry/the-effort-put-into-detrans-awareness-day-shows-the-trump-admins-priorities_n_67d323f9e4b0e72dd7fee6f6",
    "timestamp": "2025-03-13T20:12:20Z"
  },
  {
    "title": "'That's capitulating!' Dem senator slams colleagues who want to cave on GOP bill",
    "description": "Sen. Cory Booker (D-NJ) argued Thursday that Democrats would be \"capitulating\" to President Donald Trump if they allowed the continuing resolution passed by the House of Representatives this week to sail through the Senate.In an interview with CNN's Manu Raju…",
    "link": "https://www.rawstory.com/cory-booker-2671324780/",
    "timestamp": "2025-03-13T20:11:26Z"
  },
  {
    "title": "Senate Dems Look to Give Trump Everything He Wants After a “Fake Fight” on Spending Bill",
    "description": "If Senate Democrats oppose Trump’s budget, why are they considering providing Republicans with the needed votes to invoke cloture?\nThe post Senate Dems Look to Give Trump Everything He Wants After a “Fake Fight” on Spending Bill appeared first on The Intercep…",
    "link": "https://theintercept.com/2025/03/13/senate-democrats-vote-government-shutdown/",
    "timestamp": "2025-03-13T20:11:20Z"
  },
  {
    "title": "A 10% drop for stocks is scary, but isn't that rare",
    "description": "The U.S. stock market has just dropped 10% from its high set last month, hurt by worries about the economy and a global trade war",
    "link": "https://www.wftv.com/news/10-drop-stocks-is/HLSMXODXGZHALE64M7KVKYUXHA/",
    "timestamp": "2025-03-13T20:10:55Z"
  },
  {
    "title": "Trump expected to invoke wartime Alien Enemies Act to carry out mass deportations: Sources",
    "description": "Trump expected to invoke wartime Alien Enemies Act to carry out mass deportations: Sourcesgo.com",
    "link": "https://abcnews.go.com/Politics/trump-expected-invoke-wartime-alien-enemies-act-carry/story?id=119769090",
    "timestamp": "2025-03-13T20:10:46Z"
  },
  {
    "title": "California Borrows $3.4 Billion for Medicaid Overrun as Congress Eyes Steep Cuts",
    "description": "Medi-Cal, California’s Medicaid program, borrowed $3.4 billion from the state — and will likely need even more — due to higher prescription costs and increased eligibility for seniors and immigrants. The top Republican in the state Senate is demanding a heari…",
    "link": "https://kffhealthnews.org/news/article/california-medi-cal-medicaid-budget-shortfall-loan-general-fund-costs/",
    "timestamp": "2025-03-13T20:10:23Z"
  },
  {
    "title": "Jack White Calls Trump An 'Orange F**king Gorilla' In Song",
    "description": "White also went after billionaire Trump confidante Elon Musk in his updated version of the song \"Corporation.\"",
    "link": "https://www.huffpost.com/entry/jack-white-donald-trump-orange-gorilla-corporation_n_67d324e2e4b0756a721aa707",
    "timestamp": "2025-03-13T20:10:11Z"
  },
  {
    "title": "Trump administration takes its birthright citizenship fight to the Supreme Court",
    "description": "The administration wants the justices to narrow lower court rulings that blocked the policy nationwide.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-birthright-citizenship-supreme-court-rcna196316",
    "timestamp": "2025-03-13T20:10:04Z"
  },
  {
    "title": "Dem AGs sue over Trump administration’s Department of Education layoffs",
    "description": "The attorneys general of 20 Democratic states hit the Trump administration with a lawsuit over recent cuts to the Department of Education.",
    "link": "https://www.foxnews.com/politics/dem-ags-sue-over-trump-administrations-education-department-layoffs",
    "timestamp": "2025-03-13T20:09:48Z"
  },
  {
    "title": "Trump threatens huge tariffs on European wine, others",
    "description": "United States President, Donald Trump, on Thursday, threatened to impose 200 percent tariffs on wine, champagne and other alcoholic beverages from European Union countries, in retaliation against the bloc’s planned levies on American-made whiskey. Trump has l…",
    "link": "https://punchng.com/trump-threatens-huge-tariffs-on-european-wine-others/",
    "timestamp": "2025-03-13T20:09:11Z"
  },
  {
    "title": "Five years ago, COVID gripped the world in fear. Now scientists, doctors warn Trump’s policies are weakening public health",
    "description": "Medical experts and scientists caution against letting down the nation’s guard.",
    "link": "https://www.bostonherald.com/2025/03/13/five-years-later-pandemic-response-fears-return/",
    "timestamp": "2025-03-13T20:09:02Z"
  },
  {
    "title": "Iconic Trump Photo, Decried by Journalists as 'Dangerous' Propaganda, Wins Journalism Award",
    "description": "What happened: Associated Press photographer Evan Vucci won a prestigious journalism award this week for his iconic shot of President Donald Trump moments after he was nearly assassinated during a 2024 campaign rally in Butler, Pa. The unforgettable image, fe…",
    "link": "https://freerepublic.com/focus/f-news/4304083/posts",
    "timestamp": "2025-03-13T20:08:42Z"
  },
  {
    "title": "We Now Have More Proof of How the Biden Admin Tried to Suffocate Free Speech",
    "description": "Joe Biden’s final act of shamelessness was pardoning his entire crime family in the final hours of his presidency. There’s a mountain of corruption that’s yet to be fully revealed. On the weaponization of government front, you’d think the sustained lawfare la…",
    "link": "https://freerepublic.com/focus/f-news/4304082/posts",
    "timestamp": "2025-03-13T20:08:09Z"
  },
  {
    "title": "Rebuilding the Democratic Party Begins and Ends With Reform",
    "description": "Democrats need to reconstruct their party with the purpose of delivering the government reforms that allow them to deliver for all Americans, writes Northeast Philly Rep. Jared Solomon.",
    "link": "https://www.phillymag.com/news/2025/03/13/democrats-rebuild-reform-party/",
    "timestamp": "2025-03-13T20:07:48Z"
  },
  {
    "title": "Trump's Tariffs Could Backfire on Elon Musk and Tesla: Report",
    "description": "Tesla's reported letter comes after unpredictable Trump trade policy moves that have unsettled businesses and markets.",
    "link": "https://www.newsweek.com/trumps-tariffs-could-backfire-elon-musk-tesla-report-2044505",
    "timestamp": "2025-03-13T20:07:38Z"
  },
  {
    "title": "Trump Threatens Federal Override on NY Pipeline Ahead of Hochul Meeting",
    "description": "President Donald Trump and New York Governor Kathy Hochul are set for a White House meeting on Friday to discuss a major pipeline project that New York has held up for years. Trump has threatened to use federal approval to override the state if it does not su…",
    "link": "https://biztoc.com/x/c791896780879c1f",
    "timestamp": "2025-03-13T20:05:55Z"
  },
  {
    "title": "The S&P 500 is officially in a correction. It's the trade war's fault.",
    "description": "The benchmark S&P 500 closed down 10% from its February peak. The whirlwind of tariff announcements in recent weeks have hammered investor confidence.",
    "link": "https://www.businessinsider.com/stock-market-today-sp500-correction-territory-selloff-trump-tariffs-trade-2025-3",
    "timestamp": "2025-03-13T20:05:45Z"
  },
  {
    "title": "Algoma Steel foresees challenges, opportunity from trade war as it works to cut costs",
    "description": "The chief executive of one of Canada’s largest steel producers says the company is in discussions with federal and provincial leaders to determine what government support might be available to help offset the Trump administration’s tariffs. Algoma Steel Group…",
    "link": "https://financialpost.com/pmn/algoma-steel-foresees-challenges-opportunity-from-trade-war-as-it-works-to-cut-costs-2",
    "timestamp": "2025-03-13T20:05:18Z"
  },
  {
    "title": "Vladimir Putin questions Ukraine ceasefire proposal",
    "description": "While agreeing 'in principle' to the proposed 30-day ceasefire in Ukraine, the Russian president seems a long way from signing off on it. Plus, US tariffs on Australian foodstuffs could be on the way.\nThe post Vladimir Putin questions Ukraine ceasefire propos…",
    "link": "http://www.crikey.com.au/2025/03/14/vladimir-putin-ukraine-ceasefire-us-tariffs-beef/",
    "timestamp": "2025-03-13T20:03:56Z"
  },
  {
    "title": "Trump’s tariffs threaten Indigenous businesses in Canada — the government must take action",
    "description": "Indigenous people and communities are up against unequal and harmful effects that are not only economic, but also social and cultural.",
    "link": "https://theconversation.com/trumps-tariffs-threaten-indigenous-businesses-in-canada-the-government-must-take-action-251878",
    "timestamp": "2025-03-13T20:03:52Z"
  },
  {
    "title": "How to shop amid tariff uncertainty",
    "description": "By Kimberly Palmer, NerdWallet\nAs President Donald Trump enacts his tariff plans, you may be wondering if you can expect higher prices when you shop.\nRelated Articles\nBusiness | \n \n \n The do’s and don’ts of using AI to manage your finances \n \n \n \nBusiness | \n…",
    "link": "https://biztoc.com/x/eda022d49f2ed96c",
    "timestamp": "2025-03-13T20:03:26Z"
  },
  {
    "title": "Trump and Musk have huge conflicts of interest. Who’s policing them?",
    "description": "In the past week, Donald Trump announced that he would buy a Tesla and advertised the company’s vehicles at an event that turned the White House lawn into a showroom benefitting his ally, Tesla CEO Elon Musk. He also said that vandalizing Tesla cars — as some…",
    "link": "https://www.vox.com/policy/403900/trump-musk-conflicts-of-interest-ethics-rules",
    "timestamp": "2025-03-13T20:03:06Z"
  },
  {
    "title": "Under Trump, Social Security resumes what it once called ‘clawback cruelty’",
    "description": "Advocates for Social Security beneficiaries described the action as cruel and harmful.",
    "link": "https://www.bostonherald.com/2025/03/13/under-trump-social-security-resumes-what-it-once-called-clawback-cruelty/",
    "timestamp": "2025-03-13T20:02:59Z"
  },
  {
    "title": "Trump Threatens Federal Override on NY Pipeline Ahead of Hochul Meeting",
    "description": "President Donald Trump and New York Governor Kathy Hochul are set to meet on Friday morning.",
    "link": "https://www.newsweek.com/trump-threatens-federal-override-ny-pipeline-hochul-meeting-2044468",
    "timestamp": "2025-03-13T20:02:07Z"
  },
  {
    "title": "Trump Secures Peace Deal Where Putin Gets Ukraine During The Week While Zelenskyy Gets Weekends And Two Weeks In The Summer",
    "description": "WASHINGTON, D.C. — In another unorthodox move highlighting his ability to think outside the box, President Donald Trump announced that he had secured a peace deal where Putin gets Ukraine on the weekdays while Zelenskyy gets Ukraine on the weekends and for tw…",
    "link": "https://freerepublic.com/focus/f-chat/4304081/posts",
    "timestamp": "2025-03-13T20:01:40Z"
  },
  {
    "title": "Experts say Palestinian activist Mahmoud Khalil can't be deported without due process",
    "description": "The White House says the secretary of state can revoke the visa of Palestinian activist Mahmoud Khalil -- but experts tell ABC News it can't happen without due process.",
    "link": "https://abcnews.go.com/US/experts-palestinian-activist-mahmoud-khalil-deported-due-process/story?id=119756360",
    "timestamp": "2025-03-13T20:01:28Z"
  },
  {
    "title": "Ireland Funds: The $1,000 a plate dinner that's jinxed more than one Irish Taoiseach in the past",
    "description": "One of the Taoiseach’s final events stateside before he heads home is the Ireland Funds dinner, a glitzy affair with the odd Irish celeb thrown in.",
    "link": "https://www.thejournal.ie/ireland-funds-dinner-micheal-martin-6648672-Mar2025/",
    "timestamp": "2025-03-13T20:00:53Z"
  },
  {
    "title": "Tesla Rebates Axed in Canadian Province as Trade War Widens",
    "description": "British Columbia, Canada’s third most populous province, pulled government subsidies for people to install Tesla Inc. chargers, widening efforts to spurn US goods in a trade war with President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/tesla-rebates-axed-in-canadian-province-as-trade-war-widens",
    "timestamp": "2025-03-13T20:00:23Z"
  },
  {
    "title": "'I'm not going to bend at all': Trump doubles down on tariff plans as stocks sink (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\n'I'm not going to bend at all': Trump doubles down on tariff plans as stocks sink … President Donald Trump on Thursday doubled down on his escalating tariff plans, even as his economic agenda continued to rattle investors and contribu…",
    "link": "https://www.memeorandum.com/250313/p121",
    "timestamp": "2025-03-13T20:00:05Z"
  },
  {
    "title": "イーロン・マスク「貧困層切り捨てれば7000億ドル削減できるけど、どうする？」",
    "description": "1：名無しさん＠おーぷん\n：25/03/12(水) 23:07:22ID:pJkPElon Musk Says DOGE Is Coming for Social Security, Medicare, Medicaid and More | Democracy Now!https://www.democracynow.org/2025/3/11/headlines/elon_musk_says_doge_is_coming_for_social_security_medic...",
    "link": "http://blog.livedoor.jp/kinisoku/archives/5589188.html",
    "timestamp": "2025-03-13T20:00:04Z"
  },
  {
    "title": "Are Elon Musk's politics threatening Tesla and his empire?",
    "description": "Investors are questioning the tech billionaire's involvement in Trump's administration, while shares in his Tesla electric-car company plummet.",
    "link": "https://www.dw.com/en/are-elon-musks-politics-threatening-tesla-and-his-empire/a-71896718",
    "timestamp": "2025-03-13T20:00:00Z"
  },
  {
    "title": "\"I Am Deeply Sorry To My Friends And Family\": 27 MAGA Voters Shared What Donald Trump Could Do To Lose Their Support, And For Some It's Too Late",
    "description": "\"I’m frightened for my future that he made seem so bright during his campaign.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/ashleyholt1/trump-supporters-share-how-he-lost-their-support",
    "timestamp": "2025-03-13T19:59:24Z"
  },
  {
    "title": "Almonds, whiskey, auto parts: EU's retaliatory tariffs set up these U.S. states and local products as the biggest losers",
    "description": "From California almonds to Tennessee whiskey and Michigan auto parts, some states and sectors will be hit hardest by U.S.-EU 'tit for tat' tariffs war.",
    "link": "https://www.cnbc.com/2025/03/13/almonds-whiskey-auto-parts-where-eu-tariffs-will-hit-hardest.html",
    "timestamp": "2025-03-13T19:58:55Z"
  },
  {
    "title": "\"Canada Is A Sovereign State\": Trump's Ambassador Pick",
    "description": "President Donald Trump&#039;s nominee to be the U.S. ambassador in Ottawa said on Thursday he views Canada as an independent nation, pledging to respect its sovereignty amid a global trade war and hostile rhetoric that has roiled diplomatic relations.",
    "link": "https://www.ndtv.com/world-news/canada-is-a-sovereign-state-trumps-ambassador-pick-peter-hoekstra-7919249",
    "timestamp": "2025-03-13T19:58:53Z"
  },
  {
    "title": "No Deal Yet Between Democrats and GOP as Government Funding Deadline Approaches",
    "description": "Republicans would need eight Democratic senators to join them to pass a continuing resolution to fund the government.",
    "link": "https://truthout.org/articles/no-deal-yet-between-democrats-and-gop-as-government-funding-deadline-approaches/",
    "timestamp": "2025-03-13T19:57:56Z"
  },
  {
    "title": "STEVE CORTES: Americans Overwhelmingly Back Trump’s Deportation Agenda",
    "description": "Americans overwhelmingly support the Trump-Vance administration’s moves on border and immigration issues and demand a return to law-and-order over migration issues.",
    "link": "https://dailycaller.com/2025/03/13/opinion-americans-overwhelmingly-back-trumps-deportation-agenda-steve-cortes/",
    "timestamp": "2025-03-13T19:57:37Z"
  },
  {
    "title": "Judge Orders Trump Administration To Bring Back Thousands Of Workers Affected By DOGE Cuts",
    "description": "Elon Musk‘s Department of Government Efficiency raced to terminate federal employees’ jobs in the opening weeks of President Donald Trump‘s administration. On Thursday, a federal judge ordered the reinstatement of thousands of workers impacted by the cuts.\nWh…",
    "link": "https://biztoc.com/x/d87615a02d52c1b5",
    "timestamp": "2025-03-13T19:56:20Z"
  },
  {
    "title": "Dismantling Public Education Is Dismantling Religious Freedom for Our Students | Opinion",
    "description": "The Trump administration recently announced the firing of nearly a third of all U.S. Department of Education workers. It's the latest step in their effort to gut the department, with the ultimate goal of fully dismantling it, despite having no legal authority…",
    "link": "https://biztoc.com/x/3a5ab8f1a5bcb1c8",
    "timestamp": "2025-03-13T19:55:53Z"
  },
  {
    "title": "The Kitchen restaurant in Boulder receives second bomb threat this year",
    "description": "The Kitchen is co-owned by Kimbal Musk, the brother of Elon Musk, the brother of Tesla owner and President Donald Trump advisor Elon Musk.",
    "link": "https://www.denverpost.com/2025/03/13/kitchen-restaurant-boulder-bomb-threat-elon-kimbal-musk/",
    "timestamp": "2025-03-13T19:55:33Z"
  },
  {
    "title": "Thousands Sign Christian Petition to Boycott 'Trump-Backing' Corporations",
    "description": "As part of their Lenten fast, more than 12,000 people have signed a petition launched by Christian organization Faithful America, committing to boycott \"one or more\" corporations that the group says align with President Donald Trump and his policies.\nNewsweek…",
    "link": "https://biztoc.com/x/5c3d2e94afd213d9",
    "timestamp": "2025-03-13T19:55:31Z"
  },
  {
    "title": "If Trump Wants New Pressure on Moscow, Oil and Gas Is 'Only Thing Left'",
    "description": "President Donald Trump said Wednesday that the United States can do \"devastating\" things to Russia's economy to put pressure on Moscow to accept a peace deal with Ukraine.\nBut there's a limit to what Trump can do to try and bend Russia to his will, analysts w…",
    "link": "https://biztoc.com/x/3845d8e3adc0e67d",
    "timestamp": "2025-03-13T19:55:29Z"
  },
  {
    "title": "Dismantling Public Education Is Dismantling Religious Freedom for Our Students | Opinion",
    "description": "Protect public education, defend religious freedom, and take action.",
    "link": "https://www.newsweek.com/dismantling-public-education-dismantling-religious-freedom-our-students-opinion-2044445",
    "timestamp": "2025-03-13T19:54:53Z"
  },
  {
    "title": "How to shop amid tariff uncertainty",
    "description": "More tariffs may be ahead, but there are ways consumers can prepare.",
    "link": "https://www.bostonherald.com/2025/03/13/how-to-shop-amid-tariff-uncertainty/",
    "timestamp": "2025-03-13T19:54:06Z"
  },
  {
    "title": "Trump wants Democrats to keep fighting for trans athletes in girls' sports: 'Don't think they can win a race'",
    "description": "Donald Trump suggested he hopes the Democratic party continues to push its stance on trans athletes in women's sports to hurt its future election prospects.",
    "link": "https://www.foxnews.com/sports/trump-wants-democrats-keep-fighting-trans-athletes-girls-sports-dont-think-can-win-race",
    "timestamp": "2025-03-13T19:54:03Z"
  },
  {
    "title": "Steven Soderbergh on 'Black Bag,' 'Contagion' Sequel and Donald Trump - Variety",
    "description": "Steven Soderbergh on 'Black Bag,' 'Contagion' Sequel and Donald TrumpVariety ‘Black Bag’ Review: Blanchett v. FassbenderThe New York Times ‘Black Bag’ Review: Steven Soderbergh’s Sly Spy ThrillerThe Wall Street Journal Cate Blanchett Shares What Gave Her ‘Low…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176705451",
    "timestamp": "2025-03-13T19:52:52Z"
  },
  {
    "title": "Trump’s Immigration Crackdown Is Specifically Targeting Children Again",
    "description": "Immigration officials are threatening to prioritize unaccompanied immigrant children for deportation.",
    "link": "https://slate.com/news-and-politics/2025/03/trump-immigration-deportation-children-trafficking.html",
    "timestamp": "2025-03-13T19:52:32Z"
  },
  {
    "title": "The Bitcoin Strategic Reserve Happened….Now What?",
    "description": "Many believed this would set off a massive rally as demand for bitcoin surged.",
    "link": "https://www.forbes.com/sites/alexanderblume/2025/03/13/the-bitcoin-strategic-reserve-happenednow-what/",
    "timestamp": "2025-03-13T19:51:55Z"
  },
  {
    "title": "IATSE Urges Against Kennedy Center Cancellations, Citing Removal Of “Critical Opportunities” For Crew",
    "description": "Amid a string of recent show cancellations at the Kennedy Center, the union that represents its crew is attempting to shine a light on the negative impact such moves can have on those behind-the-scenes workers. “When productions walk away, it leaves more than…",
    "link": "http://deadline.com/2025/03/iatse-urges-against-kennedy-center-cancellations-1236325662/",
    "timestamp": "2025-03-13T19:51:24Z"
  },
  {
    "title": "Oil Drops Below $67 as Trade War Fears Weigh on Demand",
    "description": "A bearish economic outlook, coupled with rising supply and geopolitical shifts, pushed oil prices lower.",
    "link": "https://www.rigzone.com/news/wire/oil_drops_below_67_as_trade_war_fears_weigh_on_demand-13-mar-2025-179916-article/",
    "timestamp": "2025-03-13T19:50:31Z"
  },
  {
    "title": "Loblaw clarifies made in Canada label confusion amid tariffs",
    "description": "No grocery store label is safe from the scrutiny of Canadian shoppers during the Canada-United States tariff war.\r\nThe federal government's initial retaliatory tariffs saw a long list of grocery items impacted by the 25 per cent duty.\r\nU.S. President Donald T…",
    "link": "https://dailyhive.com/toronto/tariffs-canada-loblaw-labelling",
    "timestamp": "2025-03-13T19:50:26Z"
  },
  {
    "title": "Thousands Sign Christian Petition to Boycott 'Trump-Backing' Corporations",
    "description": "For Lent, more than 12,000 people have pledged to boycott companies that Faithful America says is aligned with the president and his policies.",
    "link": "https://www.newsweek.com/thousands-sign-christian-petition-boycott-trump-backing-corporations-2044419",
    "timestamp": "2025-03-13T19:50:03Z"
  },
  {
    "title": "Fierce backlash forces California Dems to pull bill that would have destroyed self-defense rights",
    "description": "Democrats in California shut down an effort to erode self-defense rights after massive backlash from their constituents and Second Amendment advocates. \nAssemblyman Rick Chavez Zbur, a Democrat, said that misinformation had made him pull the bill that would h…",
    "link": "https://www.theblaze.com/news/calif-dems-pull-selfdefense-law",
    "timestamp": "2025-03-13T19:50:00Z"
  },
  {
    "title": "AtkinsRealis sells stake in 407 highway, rounding off turn to pure-play engineering",
    "description": "MONTREAL — AtkinsRealis Group Inc. announced the sale of its remaining stake in Ontario’s 407 toll highway operator in a $2.79 billion deal that caps off the company’s conversion into a pure-play engineering firm. The Montreal-based company said Thursday it h…",
    "link": "https://financialpost.com/pmn/atkinsrealis-sells-stake-in-407-highway-rounding-off-turn-to-pure-play-engineering-3",
    "timestamp": "2025-03-13T19:49:41Z"
  },
  {
    "title": "Greenland takeover by United States ‘will happen’, Trump predicts",
    "description": "US president says he still has a good relationship with North Korea as he meets Nato chief",
    "link": "https://www.irishtimes.com/world/us/2025/03/13/greenland-takeover-by-united-states-will-happen-trump-predicts/",
    "timestamp": "2025-03-13T19:49:26Z"
  },
  {
    "title": "'Capitulated and groveled': Author issues blistering attack as media ignores Trump book",
    "description": "Author Michael Wolff claimed Thursday that the news media is so terrified of President Donald Trump and his threat of lawsuits that they won't go near his new book on the president.Wolff described his book, All or Nothing: How Trump Recaptured America, as \"an…",
    "link": "https://www.rawstory.com/media-fears-trump/",
    "timestamp": "2025-03-13T19:48:03Z"
  },
  {
    "title": "'Cloak of secrecy' over Apple and Home Office showdown must be removed, US politicians tell tribunal",
    "description": "A 'cloak of secrecy' created by the UK in its encryption showdown with Apple must be removed, according to a cross-party group of politicians in America.",
    "link": "https://news.sky.com/story/cloak-of-secrecy-over-apple-and-home-office-showdown-must-be-removed-us-politicians-tell-tribunal-13328050",
    "timestamp": "2025-03-13T19:48:00Z"
  },
  {
    "title": "Arizona Democrats say they’ll vote against GOP bill to avert shutdown",
    "description": "A pair of Senate Democrats from a key battleground state on Thursday said that they would vote against the GOP’s six-month spending bill, raising questions about the possibility of a government shutdown when funding expires on Friday. Arizona Sens. Mark Kelly…",
    "link": "https://freerepublic.com/focus/f-news/4304079/posts",
    "timestamp": "2025-03-13T19:47:43Z"
  },
  {
    "title": "If Trump Wants New Pressure on Moscow, Oil and Gas Is 'Only Thing Left'",
    "description": "The president's best option to pressure Putin is the one thing he might be least willing to do: put a much tighter squeeze on Russia's oil and gas exports.",
    "link": "https://www.newsweek.com/if-trump-wants-new-pressure-moscow-oil-gas-only-thing-left-2044476",
    "timestamp": "2025-03-13T19:47:28Z"
  },
  {
    "title": "China’s Growing Concerns Over India-US Relations",
    "description": "Beijing wants to believe that friction with Trump will push India toward China. That’s a flawed assumption – but one that speaks to Chinese anxieties.",
    "link": "https://thediplomat.com/2025/03/chinas-growing-concerns-over-india-us-relations/",
    "timestamp": "2025-03-13T19:47:00Z"
  },
  {
    "title": "Duda: US nuclear weapons in Poland would be 'deterrent' for Russia",
    "description": "Andrzej Duda tells the BBC's Jeremy Bowen he is confident Donald Trump has a plan to handle Russia.",
    "link": "https://www.bbc.com/news/articles/ce98ym8k89do",
    "timestamp": "2025-03-13T19:46:52Z"
  },
  {
    "title": "Andrzej Duda: US nuclear weapons in Poland would be 'deterrent' for Russia",
    "description": "Andrzej Duda tells the BBC's Jeremy Bowen he is confident Donald Trump has a plan to handle Russia.",
    "link": "https://www.bbc.co.uk/news/articles/ce98ym8k89do",
    "timestamp": "2025-03-13T19:46:52Z"
  },
  {
    "title": "The U.S. Could Slap 25% Tariffs on European Beauty Imports. To What Effect?",
    "description": "The trade flow of fragrance and cosmetics from the EU to U.S. equaled $4.96 billion in 2023, according to the Fédération des Entreprises de la Beauté.",
    "link": "http://wwd.com/beauty-industry-news/beauty-features/us-could-slap-25-tariffs-european-beauty-imports-why-it-matters-1237046582/",
    "timestamp": "2025-03-13T19:45:47Z"
  },
  {
    "title": "Wall Street stocks sink on fresh Donald Trump tariff threats",
    "description": "Wall Street stocks sink on fresh Donald Trump tariff threats\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade war, follow the latest on tariffs and executiv…",
    "link": "https://biztoc.com/x/41849ad97b8b61a7",
    "timestamp": "2025-03-13T19:45:46Z"
  }
]