[
  {
    "title": "Analysis: Putin gives Trump just enough to claim progress on Ukraine peace",
    "description": "Trump made a big deal of his conversation with Putin, but there is little to shout about, Sarah Rainsford writes.",
    "link": "https://www.bbc.com/news/articles/cwyg2kzkggvo",
    "timestamp": "2025-03-18T23:40:37Z"
  },
  {
    "title": "Putin gives Trump bare minimum on Ukraine but the war goes on",
    "description": "Trump made a big deal of his conversation with Putin, but there is little to shout about, Sarah Rainsford writes.",
    "link": "https://www.bbc.co.uk/news/articles/cwyg2kzkggvo",
    "timestamp": "2025-03-18T23:40:37Z"
  },
  {
    "title": "Trump releases JFK assassination documents",
    "description": "WASHINGTON: United States President Donald Trump released material related to the 1963 assassination of President John F Kennedy on Tuesday (Mar 18), seeking to honour his campaign promise to provide more transparency about the shocking event in Texas. \"It's …",
    "link": "https://www.channelnewsasia.com/world/trump-releases-jfk-john-f-kennedy-assassination-documents-us-5009451",
    "timestamp": "2025-03-18T23:39:00Z"
  },
  {
    "title": "Senator Schumer Votes to Let the Big Wooden Horse into Troy",
    "description": "“In the wake of votes by a handful of key Democrats, led by Senate Minority Leader Chuck Schumer, to pass a GOP-led continuing resolution funding federal operations through the end of September, fissures have expanded within the Democratic Party on how best t…",
    "link": "https://www.mcsweeneys.net/articles/senator-schumer-votes-to-let-the-big-wooden-horse-into-troy",
    "timestamp": "2025-03-18T23:39:00Z"
  },
  {
    "title": "Trump releases JFK assassination documents",
    "description": "WASHINGTON: United States President Donald Trump released material related to the 1963 assassination of President John F Kennedy on Tuesday (Mar 18), seeking to honour his campaign promise to provide more transparency about the shocking event in Texas. \"It's …",
    "link": "https://www.channelnewsasia.com/world/trump-releases-john-f-kennedy-assassination-documents-us-5009451",
    "timestamp": "2025-03-18T23:39:00Z"
  },
  {
    "title": "US releases JFK assassination records",
    "description": "The Trump administration declassified 80,000 previously classified records related to former President John F. Kennedy's 1963 assassination.\nFollowing President Donald Trump's directive on Ma...",
    "link": "https://biztoc.com/x/a09161f9bf72569f",
    "timestamp": "2025-03-18T23:37:45Z"
  },
  {
    "title": "Judge Blocks Trump’s Ban On Transgender People In The Military",
    "description": "President Donald Trump signed the executive order, which stated “adoption of a gender identity inconsistent with an individual's sex conflicts with a soldier's commitment to an honorable, truthful, and disciplined lifestyle,” on Jan. 27.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/03/18/judge-blocks-trumps-ban-on-transgender-people-in-the-military/",
    "timestamp": "2025-03-18T23:36:21Z"
  },
  {
    "title": "China Faces PR Challenge in Zambia",
    "description": "An acidic waste spill from a Chinese-owned copper mine has contaminated the country’s most important waterway.",
    "link": "http://foreignpolicy.com/2025/03/18/china-zambia-copper-acid-spill-kafue-river/",
    "timestamp": "2025-03-18T23:36:14Z"
  },
  {
    "title": "Radio Free Europe sues Trump admin, Kari Lake over defunding",
    "description": "The Trump administration is facing pushback from Radio Free Europe/Radio Liberty over funding cuts to the news outlets made by the president last week.",
    "link": "https://www.foxnews.com/politics/radio-free-europe-sues-trump-admin-kari-lake-over-defunding",
    "timestamp": "2025-03-18T23:35:32Z"
  },
  {
    "title": "'Constitutional Crime': Outrage as Trump Fires Democrat FTC Commissioners",
    "description": "U.S. President Donald Trump said he fired the two Democrats on the Federal Trade Commission Tuesday, a move blasted by consumer rights and democracy advocates as yet another illegal abuse of power by the twice-impeached Republican felon.\n\nThe White House anno…",
    "link": "https://www.commondreams.org/news/trump-fires-fcc-commissioners",
    "timestamp": "2025-03-18T23:34:35Z"
  },
  {
    "title": "JFK Assassination Documents Made Public",
    "description": "The declassified files on the assassination of the 39th president, John F. Kennedy, more than 60 years ago were released Tuesday, in response to an... Read More\nThe post JFK Assassination Documents Made Public appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/18/jfk-assassination-documents-made-public/",
    "timestamp": "2025-03-18T23:33:24Z"
  },
  {
    "title": "Trump releases classified files on JFK assassination. Here’s what they say",
    "description": "'This could be a joke of a release, or it could be a breakthrough. We just won't know until we have time to process them'",
    "link": "https://www.wnd.com/2025/03/trump-releases-classified-files-on-jfk-assassination-heres-what-they-say/",
    "timestamp": "2025-03-18T23:32:35Z"
  },
  {
    "title": "Previously classified files related to JFK assassination released",
    "description": "The documents were posted on the website of the U.S. National Archives and Records Administration.",
    "link": "https://www.bostonherald.com/2025/03/18/jfk-assassination-classified-files-released/",
    "timestamp": "2025-03-18T23:31:39Z"
  },
  {
    "title": "Previously classified files related to JFK assassination released",
    "description": "The documents were posted on the website of the U.S. National Archives and Records Administration.",
    "link": "https://www.denverpost.com/2025/03/18/jfk-assassination-classified-files-released/",
    "timestamp": "2025-03-18T23:31:39Z"
  },
  {
    "title": "It’s not just a plummeting Tesla — investors are fleeing the US altogether",
    "description": "Global investors are fleeing US stocks as the chaos of the Trump regime roils capital markets. Their destination? Europe.\nThe post It’s not just a plummeting Tesla — investors are fleeing the US altogether appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/03/19/telsa-stocks-share-price-elon-musk-donald-trump-investors-stock-market/",
    "timestamp": "2025-03-18T23:31:12Z"
  },
  {
    "title": "Senate GOP Achieves Key Wins, But Hard Work ‘Still Ahead’ For Lawmakers Hoping To Pass Trump’s Agenda",
    "description": "Senate Republicans scored major wins during the first ten weeks of the 119th Congress, but the bulk of Trump's legislative agenda is still awaiting passage.",
    "link": "https://dailycaller.com/2025/03/18/senate-gop-wins-hard-work-ahead-lawmakers-trump-agenda/",
    "timestamp": "2025-03-18T23:30:30Z"
  },
  {
    "title": "Trump Gets a Taste of Putin’s Tactics",
    "description": "The Russian leader is offering few concessions in negotiations over Ukraine. How hard is Trump willing to push for the peace he promises?",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/putin-trump-ceasefire-proposal/682092/",
    "timestamp": "2025-03-18T23:30:16Z"
  },
  {
    "title": "US Releases Final Trove Of Secret John F Kennedy Assassination Files",
    "description": "The US National Archives on Tuesday released the final batch of files related to the November 1963 assassination of president John F. Kennedy -- a case that still fuels conspiracy theories more than 60 years after his death.",
    "link": "https://www.ndtv.com/world-news/us-releases-final-trove-of-secret-john-f-kennedy-assassination-files-7955807",
    "timestamp": "2025-03-18T23:29:19Z"
  },
  {
    "title": "Two Hunter Biden Whistleblowers Promoted to Top Trump Administration Positions",
    "description": "\"By taking a stand for whistleblowers, President Trump and his cabinet are ushering in a new era of transparency and accountability.”",
    "link": "https://www.westernjournal.com/two-hunter-biden-whistleblowers-promoted-top-trump-administration-positions/",
    "timestamp": "2025-03-18T23:28:34Z"
  },
  {
    "title": "Bitwise CIO Bullish on DeFi, Sees Aptos and Sui as ETF Contenders",
    "description": "Bitwise's CIO says DeFi is “substantially undervalued” as utility tokens are poised to grow amid the U.S.’s crypto-friendly pivot.",
    "link": "https://decrypt.co/310561/bitwise-cio-bullish-on-defi-sees-aptos-and-sui-as-etf-contenders",
    "timestamp": "2025-03-18T23:28:04Z"
  },
  {
    "title": "Previously Classified Files Related To JFK Assassination Released",
    "description": "Previously classified documents related to the 1963 assassination of President John F. Kennedy have been released following an order by President Donald Trump.",
    "link": "https://www.huffpost.com/entry/ap-us-jfk-assassination-documents_n_67da010de4b0177e4d711813",
    "timestamp": "2025-03-18T23:28:01Z"
  },
  {
    "title": "Trump says he didn't discuss aid to Ukraine with Putin",
    "description": "United States President Donald Trump said in a Fox News interview that the question of aid to Ukraine wasn't discussed in his call with Russian President Vladimir Putin.\nMore to come......",
    "link": "https://biztoc.com/x/454bc46a9ce4302e",
    "timestamp": "2025-03-18T23:26:49Z"
  },
  {
    "title": "ABC News Boss Recommits to ‘Straightforward Journalism’ After Layoffs and Trump Settlement: ‘We Must Earn Their Trust’",
    "description": "\"This is not easy. The entire industry has been challenged,\" Almin Karamehmedovic says\nThe post ABC News Boss Recommits to ‘Straightforward Journalism’ After Layoffs and Trump Settlement: ‘We Must Earn Their Trust’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/abc-news-boss-straightforward-journalism-almin-karamehmedovic/",
    "timestamp": "2025-03-18T23:26:47Z"
  },
  {
    "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
    "description": "Retiree advocates warn that the change will negatively impact older Americans in rural areas.",
    "link": "https://www.bostonherald.com/2025/03/18/social-security-identity-checks/",
    "timestamp": "2025-03-18T23:24:52Z"
  },
  {
    "title": "Trump Administration Releases JFK Files",
    "description": "\"All records previously withheld for classification\" were released Tuesday, according to the National Archives.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/18/trump-administration-releases-jfk-files/",
    "timestamp": "2025-03-18T23:24:18Z"
  },
  {
    "title": "JFK Files Released: What They Say About Kennedy's Assassination - Live Updates",
    "description": "The Trump administration has released a tranche of unredacted documents about the assassination of John F. Kennedy. Follow Newsweek's live blog for updates.",
    "link": "https://www.newsweek.com/jfk-files-released-what-they-say-about-kennedys-assassination-live-updates-2046887",
    "timestamp": "2025-03-18T23:23:01Z"
  },
  {
    "title": "Democratic FTC commissioners say they were just ‘illegally fired’ by President Trump",
    "description": "President Donald Trump fired the two remaining Democratic commissioners at the Federal Trade Commission Tuesday in what appears to be a conspicuous exercise of power over the independent agency. The White House confirmed the dismissals in an unsigned email re…",
    "link": "https://www.theverge.com/news/632267/democratic-ftc-commissioners-alvaro-bedoya-rebecca-kelly-slaughter-illegally-fired-trump",
    "timestamp": "2025-03-18T23:21:04Z"
  },
  {
    "title": "Australia's 'biggest defence export' was meant for the US first, but Canada snuck past Trump",
    "description": "For months, senior officials have been discussing exporting Australia's world-leading JORN radar technology to the United States, but after Donald Trump's return to the White House, Canada saw an opportunity and leapt.",
    "link": "https://www.abc.net.au/news/2025-03-19/canada-snuck-past-trump-buy-jorn-defence-radar/105069292",
    "timestamp": "2025-03-18T23:20:23Z"
  },
  {
    "title": "What state is the global climate really in?",
    "description": "As the current US administration seeks to play down and even question human-caused climate change, new findings paint a very different picture.",
    "link": "https://www.dw.com/en/what-state-is-the-global-climate-really-in/a-71963848",
    "timestamp": "2025-03-18T23:18:00Z"
  },
  {
    "title": "EU countries react to Trump-Putin call",
    "description": "The leaders of France and Germany have welcomed Russia’s decision to pause astrikes on Ukraine’s energy facilities Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614460-eu-reacts-trump-putin-call/",
    "timestamp": "2025-03-18T23:16:35Z"
  },
  {
    "title": "Government releases thousands of declassified records related to JFK assassination",
    "description": "The National Archives has released thousands of pages of declassified records related to the assassination of President John F. Kennedy in 1963.",
    "link": "https://abcnews.go.com/US/government-releases-thousands-declassified-records-related-jfk-assassination/story?id=119926288",
    "timestamp": "2025-03-18T23:16:05Z"
  },
  {
    "title": "Resist Putin’s extremist demands, Mr. President — Americans will back you",
    "description": "Vladimir Putin is still demanding the moon for a full Ukraine ceasefire; peacemaking President Donald Trump may soon need to drop the niceties and break out the sticks.",
    "link": "https://nypost.com/2025/03/18/opinion/resist-putins-extremist-demands-mr-president-americans-will-back-you/",
    "timestamp": "2025-03-18T23:15:38Z"
  },
  {
    "title": "NASA astronauts Butch Wilmore and Suni Williams return to Earth after 9 months stuck in space",
    "description": "Stuck in space no more, NASA astronauts Butch Wilmore and Suni Williams returned to Earth on Tuesday, hitching a different ride home to close out a saga that began with a bungled test flight more than nine months ago.",
    "link": "https://www.today.com/news/nasa-astronauts-return-earth-rcna196994",
    "timestamp": "2025-03-18T23:14:04Z"
  },
  {
    "title": "Government releases latest batch of JFK assassination documents",
    "description": "More than 60 years after President John F. Kennedy was gunned down in Dallas, the federal government began releasing what could be the final trove of documents delving into the assassination that shocked the nation and spawned countless conspiracy theories.",
    "link": "https://www.nbcnews.com/news/us-news/jfk-assassination-documents-release-rcna196808",
    "timestamp": "2025-03-18T23:13:57Z"
  },
  {
    "title": "Trump’s FTC Deletes Blogs Critical of Amazon and Microsoft",
    "description": "More than 300 posts have reportedly been removed.",
    "link": "https://gizmodo.com/trumps-ftc-deletes-blogs-critical-of-amazon-and-microsoft-2000577660",
    "timestamp": "2025-03-18T23:10:39Z"
  },
  {
    "title": "Why the US Continues to Kill Millions of Hens, Four Years Into Bird Flu Outbreak",
    "description": "The United States is entering its fourth year of a near continuous outbreak of the highly pathogenic avian influenza.\nDespite leadership changes at the country’s top agricultural and public health agencies, the government is continuing the strategy of culling…",
    "link": "https://www.globalresearch.ca/us-continues-kill-millions-hens-4-years-bird-flu-outbreak/5882197",
    "timestamp": "2025-03-18T23:10:09Z"
  },
  {
    "title": "Trump releases JFK assassination documents",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump released material related to the 1963 assassination of President John F. Kennedy on Tuesday, seeking to honor his campaign promise to provide more transparency about the shock event in Texas. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/19/trump-releases-jfk-assassination-documents",
    "timestamp": "2025-03-18T23:10:00Z"
  },
  {
    "title": "Trump Misleads on Jobs",
    "description": "Following the release of the latest jobs report on March 7, President Donald Trump suggested that his administration -- which has been in office since Jan. 20 -- is responsible for significant job growth. The growth in February was steady, but to support his …",
    "link": "https://www.factcheck.org/2025/03/trump-misleads-on-jobs/",
    "timestamp": "2025-03-18T23:08:10Z"
  },
  {
    "title": "Pentagon’s DEI Website Purge Draws Backlash for Purging Websites on Iwo Jima Flag-Raiser, Navajo Code Talkers, Black Medal of Honor Recipient",
    "description": "The Pentagon is facing backlash as multiple Department of Defense websites featuring military veterans who are women, minorities, or members of the LGBTQ+ community have been removed, archived, or edited as part of an effort by President Donald Trump's admini…",
    "link": "https://www.mediaite.com/politics/pentagons-dei-website-purge-draws-backlash-for-purging-websites-on-iwo-jima-flag-raiser-navajo-code-talkers-black-medal-of-honor-recipient/",
    "timestamp": "2025-03-18T23:07:20Z"
  },
  {
    "title": "Federal judge indefinitely blocks Trump’s ban on transgender service members | CNN Politics",
    "description": "A federal judge has indefinitely blocked President Donald Trump’s ban on transgender service members, dealing a major defeat to a controversial policy the president resurrected from his first term.",
    "link": "https://www.cnn.com/2025/03/18/politics/transgender-military-court-ruling/index.html",
    "timestamp": "2025-03-18T23:07:00Z"
  },
  {
    "title": "Trump, Putin float possibility of hockey matchup between NHL and Russian KHL; NHL declines to comment",
    "description": "The NHL cut off ties with the KHL in 2022, after Russia invaded Ukraine.",
    "link": "https://sports.yahoo.com/nhl/article/trump-putin-float-possibility-of-hockey-matchup-between-nhl-and-russian-khl-nhl-declines-to-comment-230511662.html",
    "timestamp": "2025-03-18T23:05:11Z"
  },
  {
    "title": "Donald Trump, Vladimir Putin float possibility of hockey matchup between NHL and Russian KHL; NHL declines to comment",
    "description": "The NHL cut off ties with the KHL in 2022, after Russia invaded Ukraine.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_fbc17dd7-d100-472b-9864-1cdcc829e4ec",
    "timestamp": "2025-03-18T23:05:11Z"
  },
  {
    "title": "Republican lawmaker wrangles with CNN host over judge halting deportation flights",
    "description": "Rep. Tim Burchett, R-Tenn., slammed CNN for liberal bias and poor ratings in a clash over a judge blocking the Trump administration's deportation flights.",
    "link": "https://www.foxnews.com/media/republican-lawmaker-wrangles-cnn-host-over-judge-halting-deportation-flights",
    "timestamp": "2025-03-18T23:00:25Z"
  },
  {
    "title": "Costa Rica: Allow Deported Migrants to Seek Asylum",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n The interior of Costa Rica’s migration reception center in Puntarenas, showing the play area for children behind a row of cots.\n © 2025 Private\n \n \n\n\n \n(Washington, DC) – Costa Rican Foreign Minister Arnoldo André Ti…",
    "link": "https://www.hrw.org/news/2025/03/18/costa-rica-allow-deported-migrants-seek-asylum",
    "timestamp": "2025-03-18T23:00:00Z"
  },
  {
    "title": "Trump vs. Biden: ‘Now, We’re Controlling the Border.’",
    "description": "It’s “beautiful” to see more Border Patrol agents back on the southern border since President Donald Trump entered the White House, Efrain Sella said.  ... Read More\nThe post Trump vs. Biden: ‘Now, We’re Controlling the Border.’ appeared first on The Daily Si…",
    "link": "https://www.dailysignal.com/2025/03/18/trump-vs-biden-now-were-controlling-border/",
    "timestamp": "2025-03-18T22:59:32Z"
  },
  {
    "title": "Twilight of the Islamic Republic: The rocky road to regime change in Iran has begun",
    "description": "This momentous period in history heralds the demise of religious despotism in Tehran, the disintegration of the regime of the corrupt, terrorist mullahs.",
    "link": "https://www.jpost.com/opinion/article-846549",
    "timestamp": "2025-03-18T22:58:38Z"
  },
  {
    "title": "Ukraine war: Trump, Putin agree to energy, infrastructure ceasefire; full truce unclear",
    "description": "Trump and Putin agree on Ukraine ceasefire, but broader peace deal remains uncertain; US-Russia relations shift.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-putin-call-ukraine-war-energy-infrastructure-truce/article69346433.ece",
    "timestamp": "2025-03-18T22:56:20Z"
  },
  {
    "title": "Never-'stuck’ Starliner astronauts return to Earth at last with Crew-9 duo in SpaceX Dragon splashdown",
    "description": "The first astronauts to fly on two different commercial spacecraft during a single mission, Suni Williams and Butch Wilmore, returned to Earth with ISS crewmates Nick Hague and Aleksandr Gorbunov.",
    "link": "http://www.collectspace.com/news/news-031825a-spacex-crew-9-boeing-starliner-astronauts-landing.html",
    "timestamp": "2025-03-18T22:55:49Z"
  },
  {
    "title": "NASA astronauts return to Earth after drawn-out mission in space",
    "description": "NASA astronauts Butch Wilmore and Suni Williams returned to Earth in a SpaceX capsule on Tuesday with a soft splashdown off Florida's coast, nine months after their faulty Boeing Starliner craft upended what was to be a week-long stay on the International Spa…",
    "link": "https://japantoday.com/category/world/nasa-astronauts-%27butch-and-suni%27-return-to-earth-after-drawn-out-mission-in-space1",
    "timestamp": "2025-03-18T22:55:24Z"
  },
  {
    "title": "Democratic FTC commissioners say they were ‘illegally fired’ | CNN Business",
    "description": "President Donald Trump fired two Democratic members of the Federal Trade Commission on Tuesday, with both commissioners saying they were ”illegally fired.”",
    "link": "https://www.cnn.com/2025/03/18/business/ftc-commissioners-fired/index.html",
    "timestamp": "2025-03-18T22:53:57Z"
  },
  {
    "title": "We’ll miss globalism when it’s gone",
    "description": "I have, like I suspect many readers, been in quite a bad mood for the last two months. My go-to joke explaining why — which I feel like should land with readers of this newsletter — has become: “I didn’t realize quite how much my overall optimism about the st…",
    "link": "https://www.vox.com/future-perfect/404830/usaid-trade-immigration-consensus",
    "timestamp": "2025-03-18T22:53:51Z"
  },
  {
    "title": "Trump fires two Federal Trade Commission members",
    "description": "United States President Donald Trump fired two members of the Federal Trade Commission (FTC), namely Commissioner Alvaro Bedoya and Commissioner Rebecca Slaughter.In a post on X, Bedoya called the mov...",
    "link": "https://biztoc.com/x/5fbb02ed093a011a",
    "timestamp": "2025-03-18T22:53:24Z"
  },
  {
    "title": "The silencing of Voice of America",
    "description": "The Trump administration has shuttered a number of federal agencies, and ordered another tranche closed last Friday. Among them was Voice of America — a news outlet founded to help the Allies fight the Nazis that still publishes and broadcasts today. Or did, …",
    "link": "https://www.vox.com/today-explained-newsletter/404897/trump-doge-voa-usagm-voice-america-first-fake-news",
    "timestamp": "2025-03-18T22:52:46Z"
  },
  {
    "title": "The Cost of an Open Border? Enormous.",
    "description": "Our southern border isn’t a line on a map. It’s a gaping hole in our national security and it’s bleeding us dry. Mexican cartels flood... Read More\nThe post The Cost of an Open Border? Enormous. appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/18/cost-open-border-enormous/",
    "timestamp": "2025-03-18T22:50:59Z"
  },
  {
    "title": "A movement, not a moment: How Birthright Israel can help ensure Jewish continuity",
    "description": "To ensure lasting change, we need to build a generation that is strong enough to withstand the storm. If our generation isn’t rooted in Jewish identity, we have nothing to defend.",
    "link": "https://www.jpost.com/opinion/article-846579",
    "timestamp": "2025-03-18T22:50:49Z"
  },
  {
    "title": "Faint Hopes and Trump’s Phony Peace",
    "description": "Hopes and reality On February 27 President Putin, in an address to FSB security officials, stated that the initial communication with the US administration “inspires certain hopes.” The world can understand what these hopes are, faint as they presently appear…",
    "link": "https://www.globalresearch.ca/faint-hopes-trump-phony-peace/5882213",
    "timestamp": "2025-03-18T22:50:01Z"
  },
  {
    "title": "Trans People in Prison Sue Trump Over Their Right to Medical Care",
    "description": "Six days after President Donald Trump’s inauguration in January, Alishea Kingdom went to a medical appointment at the federal prison in New Jersey where she’s incarcerated. It was time for her to take the hormonal medication she’d been prescribed years before…",
    "link": "https://www.motherjones.com/politics/2025/03/trans-lawsuit-prison-medical-care-gender-affirming-health-care/",
    "timestamp": "2025-03-18T22:49:25Z"
  },
  {
    "title": "NZ consumer confidence takes a hit as storm clouds gather",
    "description": "Global trade tensions and cost-of-living pressures at home dampen confidence.",
    "link": "https://www.nzherald.co.nz/business/nz-consumer-confidence-takes-a-hit-as-storm-clouds-gather/B5UH4R4KZZECJKJ3ILSVAOJVU4/",
    "timestamp": "2025-03-18T22:48:14Z"
  },
  {
    "title": "Analysts want details on debt plan",
    "description": "<p>Former premier Thaksin Shinawatra recently pitched a government-led household debt buyback programme as household debt tallied 89.6% of GDP as of the second quarter of 2024.</p>",
    "link": "https://www.bangkokpost.com/business/general/2982878/analysts-want-details-on-debt-plan",
    "timestamp": "2025-03-18T22:48:00Z"
  },
  {
    "title": "Top Tesla officials sell shares in recent weeks: 'Not a positive sign'",
    "description": "As Tesla stock has fallen in recent weeks, members of the board and an executive at Elon Musk's company have sold off millions of dollars in stock, according to filings.",
    "link": "https://abc7news.com/post/top-tesla-officials-sell-shares-recent-weeks-not-positive-sign/16046098/",
    "timestamp": "2025-03-18T22:47:38Z"
  },
  {
    "title": "Newsom Needs Extra $3B for Health Program Swamped by Illegals.",
    "description": "California Gavin Newsom (D-CA) is once again seeking a multi-billion loan from his state's general fund to cover Medicaid costs that have been sent",
    "link": "https://thenationalpulse.com/2025/03/18/newsom-needs-extra-3b-for-health-program-swamped-by-illegals/",
    "timestamp": "2025-03-18T22:47:03Z"
  },
  {
    "title": "IntelliEPI pushes expansion plans ahead despite CHIPS Act and defense budget shifts",
    "description": "US President Donald Trump recently threatened to abolish the CHIPS Act, but IntelliEPI chairman Yung-Chung Kao stated that the company's operations will be minimally affected. The company's second factory plan is ongoing, with increased investment in R&D.",
    "link": "https://www.digitimes.com/news/a20250317PD213/chips-act-intelliepi-donald-trump-expansion-budget.html",
    "timestamp": "2025-03-18T22:46:57Z"
  },
  {
    "title": "Top Tesla officials sell shares in recent weeks: 'Not a positive sign'",
    "description": "As Tesla stock has fallen in recent weeks, members of the board and an executive at Elon Musk's company have sold off millions of dollars in stock, according to filings.",
    "link": "https://abc13.com/post/top-tesla-officials-sell-shares-recent-weeks-not-positive-sign/16046098/",
    "timestamp": "2025-03-18T22:46:54Z"
  },
  {
    "title": "In Pics: Nasa Astronauts Sunita Williams, Butch Wilmore emerge from Dragon after SpaceX Crew 9 splashdown",
    "description": "Sunita Williams, Butch Wilmore Pics:",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/spacex-crew-9-splashdown-check-first-pics-of-nasa-astronauts-sunita-williams-butch-wilmore-after-returning-to-earth/articleshow/119180038.cms",
    "timestamp": "2025-03-18T22:46:38Z"
  },
  {
    "title": "WATCH: Tim Walz on MAGA folks: ‘I could kick most of their a**’",
    "description": "Failed VP candidate talks to Gavin Newsom about Democrats' predicament",
    "link": "https://www.wnd.com/2025/03/watch-tim-walz-on-maga-folks-i-could-kick-most-of-their-a/",
    "timestamp": "2025-03-18T22:45:02Z"
  },
  {
    "title": "Oligarchy vs. our democratic republic",
    "description": "Sen. Bernie Sanders doesn't seem to understand the difference between Stalin and Trump",
    "link": "https://www.wnd.com/2025/03/oligarchy-vs-our-democratic-republic/",
    "timestamp": "2025-03-18T22:44:20Z"
  },
  {
    "title": "The Trump right’s pro-Israel antisemitism",
    "description": "Over and over again, the Trump administration has claimed to be fighting antisemitism while wielding power against its domestic enemies. Yet, at the same time, there’s been a troubling surge in antisemitism among MAGA influencers and even some Trump administr…",
    "link": "https://www.vox.com/on-the-right-newsletter/404898/trump-pro-israel-antisemitism-musk-columbia",
    "timestamp": "2025-03-18T22:44:14Z"
  },
  {
    "title": "19 Reasons Why The Federal Reserve Is At The Heart Of Our Economic Problems",
    "description": "Most Americans have absolutely no idea how we got into the mess that we are in today.  The reason why the U.S. government is 36 trillion dollars in debt and our society as a whole is 102 trillion dollars in debt is because the system is performing exactly as …",
    "link": "http://theeconomiccollapseblog.com/19-reasons-why-the-federal-reserve-is-at-the-heart-of-our-economic-problems-2/",
    "timestamp": "2025-03-18T22:43:35Z"
  },
  {
    "title": "Top Tesla officials sell shares in recent weeks: 'Not a positive sign'",
    "description": "As Tesla stock has fallen in recent weeks, members of the board and an executive at Elon Musk's company have sold off millions of dollars in stock, according to filings.",
    "link": "https://abc7chicago.com/post/top-tesla-officials-sell-shares-recent-weeks-not-positive-sign/16046098/",
    "timestamp": "2025-03-18T22:43:35Z"
  },
  {
    "title": "What we can learn from a past tariff tiff (rerun)",
    "description": "Hey Smarties! Today we’re revisiting an episode from earlier this year that might help you make sense of all the tit for tat tariff fight from the past few weeks. It unpacks some tariff history and the potential economic consequences of President Trump’s ongo…",
    "link": "https://www.marketplace.org/shows/make-me-smart/what-we-can-learn-from-a-past-tariff-tiff-rerun/",
    "timestamp": "2025-03-18T22:40:37Z"
  },
  {
    "title": "Trump Fires Both Democratic FTC Commissioners in Move Lambasted as ‘Corruption Plain and Simple’",
    "description": "Former commissioners Alvaro Bedoya and Rebecca Kelly Slaughter spoke out against the president's latest effort to clear political opponents from independent government agencies\nThe post Trump Fires Both Democratic FTC Commissioners in Move Lambasted as ‘Corru…",
    "link": "https://www.thewrap.com/trump-fires-democratic-ftc-commissioners/",
    "timestamp": "2025-03-18T22:40:16Z"
  },
  {
    "title": "Justice: Trump targets the left’s lawfare",
    "description": "Regarding Perkins Coie order, 'Helping to rig an election is a crime against America'",
    "link": "https://www.wnd.com/2025/03/justice-trump-targets-the-lefts-lawfare/",
    "timestamp": "2025-03-18T22:39:45Z"
  },
  {
    "title": "Trump to release 80,000 pages on JFK assassination",
    "description": "The move seeks to honor his campaign promise to provide more transparency about the shock event in Texas.",
    "link": "https://www.japantimes.co.jp/news/2025/03/19/world/politics/trump-jfk-assassination/",
    "timestamp": "2025-03-18T22:39:00Z"
  },
  {
    "title": "NASA astronauts Butch Wilmore and Suni Williams return after 9 months stuck in space",
    "description": "Their SpaceX capsule parachuted into waters off the coast of Florida just hours after leaving the International Space Station.",
    "link": "https://richmond.com/news/nation-world/science/article_3bbe2318-3f1b-537b-ba60-addcff4f3384.html",
    "timestamp": "2025-03-18T22:38:00Z"
  },
  {
    "title": "Supreme Court chief rebukes Trump over call for judge's impeachment",
    "description": "The White House has repeatedly lashed out following court rulings it disagrees with such as the rejection of Trump's attempt to end birthright citizenship.",
    "link": "https://www.japantimes.co.jp/news/2025/03/19/world/politics/supreme-court-chief-trump-impeachment/",
    "timestamp": "2025-03-18T22:37:00Z"
  },
  {
    "title": "Ex-Secret Service Agent Backs Trump's Decision to Pull Hunter Biden Protection",
    "description": "Donald Trump's push to revoke Hunter and Ashley Biden's Secret Service protection has found some support from an ex-Secret Service agent. Richard Staropoli, a former special agent with 25 years in the Secret Service, joined us Tuesday to talk about…\n Permalink",
    "link": "https://www.tmz.com/2025/03/18/former-secret-service-agent-trump-decision-to-remove-hunter-biden-protection/",
    "timestamp": "2025-03-18T22:35:57Z"
  },
  {
    "title": "NASA astronauts Butch Wilmore and Sunita Williams return to Earth after record length space mission",
    "description": "The pair spent over nine months conducting experiments, fixing equipment, and completing spacewalks, making headlines with their extended stay aboard the International Space Station.",
    "link": "https://www.thehindubusinessline.com/news/science/nasa-astronauts-wilmore-williams-return-to-earth-after-286-days-space/article69346426.ece",
    "timestamp": "2025-03-18T22:35:32Z"
  },
  {
    "title": "Republican Tudor Dixon praises Trump as she eyes 2026 run for governor or Senate in key battleground",
    "description": "Republican Tudor Dixon praises President Trump as she eyes a 2026 run for either governor or Senate in battleground Michigan",
    "link": "https://www.foxnews.com/politics/republican-tudor-dixon-eyeing-2026-run-governor-senate-key-battleground",
    "timestamp": "2025-03-18T22:33:52Z"
  },
  {
    "title": "Zelenskiy Ready for Peace Proposal With Ukraine's Involvement",
    "description": "Ukrainian President Volodymyr Zelenskiy said the phone call between Donald Trump and Vladimir Putin shows that Russia isn’t ready for a ceasefire. Putin committed on Tuesday to limit Russian attacks on Ukrainian energy assets but declined to agree to a broade…",
    "link": "https://biztoc.com/x/6aeb53ed426f2ec7",
    "timestamp": "2025-03-18T22:31:08Z"
  },
  {
    "title": "No evidence Carrie Underwood sued 'The View' for $800M",
    "description": "A viral YouTube video claimed Underwood sued The View over comments co-host Joy Behar made in January 2025.",
    "link": "https://www.snopes.com//news/2025/03/18/carrie-underwood-sue-the-view-800-mil/",
    "timestamp": "2025-03-18T22:31:00Z"
  },
  {
    "title": "Trump fires both Democratic commissioners at the Federal Trade Commission",
    "description": "The two commissioners — Alvaro Bedoya and Rebecca Kelly Slaughter — said they were illegally terminated by President Donald Trump.",
    "link": "https://biztoc.com/x/c2f8e9ea74b85115",
    "timestamp": "2025-03-18T22:30:59Z"
  },
  {
    "title": "Semisonic blast Trump White House's 'Closing Time' deportation video",
    "description": "Semisonic is the latest music act to blast the Trump White House for using their song. They're calling out the administration for using their song 'Closing Time' in a deportation video.",
    "link": "https://ew.com/semisonic-blast-trump-white-house-closing-time-deportation-video-11699332",
    "timestamp": "2025-03-18T22:30:50Z"
  },
  {
    "title": "Trump fires two Democratic FTC members",
    "description": "The dismissal of the Federal Trade Commission members Tuesday potentially will allow President Donald Trump to fill their slots on the independent corporate regulator with officials more sympathetic to his administration.",
    "link": "https://biztoc.com/x/b4f9979d5383297d",
    "timestamp": "2025-03-18T22:30:46Z"
  },
  {
    "title": "Russia thwarts new Ukrainian incursion attempt (VIDEO)",
    "description": "Kiev has mounted multiple cross-border attacks, seeking to jeopardize Trump-Putin talks, the Russian Defense Ministry has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614450-ukrainian-cross-border-attacks/",
    "timestamp": "2025-03-18T22:29:55Z"
  },
  {
    "title": "Astronauts finally return to Earth after nine months in space",
    "description": "Their journey home closes out an unusual and closely watched chapter in spaceflight history.",
    "link": "https://7news.com.au/news/astronauts-finally-return-to-earth-after-nine-months-in-space-c-18086954",
    "timestamp": "2025-03-18T22:26:03Z"
  },
  {
    "title": "Putin demands concessions for ceasefire after call with Trump",
    "description": "US President Donald Trump and his Russian counterpart Vladimir Putin have had a phone call where Russia has agreed to pause its attacks on energy and infrastructure in Ukraine for thirty days. Russia has not committed to a full ceasefire and demands complete …",
    "link": "https://www.bbc.co.uk/programmes/w172zb9fkfcdmmk",
    "timestamp": "2025-03-18T22:26:00Z"
  },
  {
    "title": "Whoopi Goldberg Talks Deportation Risk for All Under Trump",
    "description": "Whoopi Goldberg Talks Deportation Risk for All Under Trumplittlethings.com",
    "link": "https://littlethings.com/entertainment/whoopi-goldberg-the-view-deported-trump-administration",
    "timestamp": "2025-03-18T22:23:16Z"
  },
  {
    "title": "Story of Trump staffers saying his 'terrible body odor' obstructs his agenda is pure satire",
    "description": "Tales of foul smells, impolite bodily noises, soiled clothing and other bodily issues often appear in online rumors about recent U.S. presidents.",
    "link": "https://www.snopes.com//fact-check/trump-body-odor-presidential-immunity/",
    "timestamp": "2025-03-18T22:23:00Z"
  },
  {
    "title": "Trump fires two Democratic FTC members",
    "description": "The dismissal of the Federal Trade Commission members Tuesday potentially will allow President Donald Trump to fill their slots on the independent corporate regulator with officials more sympathetic to his administration.",
    "link": "https://www.pbs.org/newshour/politics/trump-fires-two-democratic-ftc-members",
    "timestamp": "2025-03-18T22:22:55Z"
  },
  {
    "title": "'Classic authoritarian move': Critics alarmed as Trump eyes classifying fentanyl as WMD",
    "description": "An exclusive report that President Donald Trump is on the verge of declaring “illicit” fentanyl as a weapon of mass destruction was subjected to a thorough round of criticism as political observers pointed out the retro phrase and potential damages the execut…",
    "link": "https://www.rawstory.com/trump-fentanyl-2671353942/",
    "timestamp": "2025-03-18T22:22:20Z"
  },
  {
    "title": "NASA astronauts Butch Wilmore and Suni Williams return to Earth after 9 months stuck in space",
    "description": "NASA astronauts Butch Wilmore and Suni Williams have returned to Earth after being stuck in space for more than nine months",
    "link": "https://www.wsbtv.com/news/science/nasa-astronauts/5DNLFIE65NBVXFKOMWUBN5TGNI/",
    "timestamp": "2025-03-18T22:20:35Z"
  },
  {
    "title": "Pro-Palestinian Columbia activist Mahmoud Khalil issues first statement since arrest",
    "description": "Khalil, who was born in a Palestinian refugee camp in Syria, asserted that 'My unjust detention is indicative of the anti-Palestinian racism that both the Biden and Trump administrations have demonstrated' over the duration of the Gaza war",
    "link": "https://www.haaretz.com/israel-news/2025-03-19/ty-article/.premium/pro-palestinian-columbia-activist-mahmoud-khalil-issues-first-statement-since-arrest/00000195-ab3e-d705-a3d7-bb3ea7410000",
    "timestamp": "2025-03-18T22:20:00Z"
  },
  {
    "title": "Donald Trump Reveals He's Had More Recent Calls with Vladimir Putin",
    "description": "In an interview with the Washington Examiner, President Donald Trump disclosed that his Tuesday call with Russian President Vladimir Putin was not their first recent conversation.\nTrump told the conservative publication that the two leaders have engaged in mu…",
    "link": "https://biztoc.com/x/0906bc23f707fa91",
    "timestamp": "2025-03-18T22:19:52Z"
  }
]