[
  {
    "title": "China to impose tariffs of 34% on all US goods from Apr 10",
    "description": "BEIJING: China on Friday (Apr 4) announced a slew of additional tariffs and restrictions against US goods as a countermeasure to sweeping tariffs imposed by US President Donald Trump.",
    "link": "https://www.channelnewsasia.com/east-asia/china-impose-34-percent-tariff-us-goods-donald-trump-5044786",
    "timestamp": "2025-04-04T10:41:00Z"
  },
  {
    "title": "Sources: PGA Tour rejects PIF's recent $1.5B offer",
    "description": "The PGA Tour has rejected PIF's most recent offer to invest $1.5 billion into PGA Tour Enterprises, the tour's for-profit entity, which came with the caveat that the rival LIV Golf League would remain intact, sources confirmed to ESPN.",
    "link": "https://www.espn.com/golf/story/_/id/44529361/sources-pga-tour-rejects-pif-recent-offer-invest-15b",
    "timestamp": "2025-04-04T10:40:43Z"
  },
  {
    "title": "China claps back with its own tariffs on US imports in retaliation against Trump",
    "description": "China said on Friday it will impose a 34% tariff on all US imports starting April 10 after President Donald Trump's decision to hit Chinese imports.",
    "link": "https://www.businessinsider.com/china-retaliates-own-tariffs-against-trump-2025-4",
    "timestamp": "2025-04-04T10:40:22Z"
  },
  {
    "title": "China swings back with 34pc tariff on all US imports",
    "description": "China announced additional tariffs of 34pc on US goods on Friday, the most serious escalation in a trade war with President Donald Trump that has fed fears of a recession and triggered a global stock market rout. Beijing also announced it was adding several U…",
    "link": "https://www.independent.ie/business/china-swings-back-with-34pc-tariff-on-all-us-imports/a1292462327.html",
    "timestamp": "2025-04-04T10:39:43Z"
  },
  {
    "title": "Donald Trump Says 'Market Is Going To Boom,' Claiming '$6-7 Trillion' Worth Of Inflows Will Come After The Worst Selloff Since 2020",
    "description": "Despite a bloodbath on Thursday following the tariff announcements on several U.S. trading partners, President Donald Trump dismissed the concerns while talking to reporters before boarding Air Force One for his Miami visit.\nWhat Happened: President Trump com…",
    "link": "https://biztoc.com/x/09b06953e8c53507",
    "timestamp": "2025-04-04T10:39:36Z"
  },
  {
    "title": "China announces 34% retaliatory tariffs on US imports",
    "description": "Move towards full-blown trade war comes in response to levies imposed by Donald Trump",
    "link": "https://biztoc.com/x/bf15b3f43bf50a70",
    "timestamp": "2025-04-04T10:39:32Z"
  },
  {
    "title": "Review: Is the New Captain America Movie an Allegory for Donald Trump?",
    "description": "Never trust a president, even if he's an elderly but still charismatic Harrison Ford. That's one way to interpret Captain America: Brave New World. \nIn theory, Brave New World is the fourth movie in the Captain America subfranchise of the Marvel Cinematic Uni…",
    "link": "https://biztoc.com/x/c449a3828af90de5",
    "timestamp": "2025-04-04T10:39:30Z"
  },
  {
    "title": "US tariffs response: Taoiseach plays down Covid-like job supports",
    "description": "Crisis imposed by Donald Trump’s tariffs was ‘for the long haul’, says Micheál Martin",
    "link": "https://www.irishtimes.com/politics/2025/04/04/us-tariffs-response-taoiseach-plays-down-covid-like-job-supports/",
    "timestamp": "2025-04-04T10:39:29Z"
  },
  {
    "title": "Pain from tariffs ‘won’t be short-term’ with pharma industry in Trump crosshairs; China imposes 34pc retaliatory tariff on US goods",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/pain-from-tariffs-wont-be-short-term-with-pharma-industry-in-trump-crosshairs-china-imposes-34pc-retaliatory-tariff-on-us-goods/a616185087.html",
    "timestamp": "2025-04-04T10:39:26Z"
  },
  {
    "title": "You have questions about Trump’s tariffs. We have answers",
    "description": "President Donald Trump delivers remarks on reciprocal tariffs during an event in the Rose Garden entitled “Make America Wealthy Again” at the White House in Washington, DC, on April 2, 2025. | Brendan Smialowski/AFP via Getty Images\nPresident Donald Trump’s t…",
    "link": "https://biztoc.com/x/bb45bd73c4c4e510",
    "timestamp": "2025-04-04T10:39:12Z"
  },
  {
    "title": "Beijing hits back: China declares retaliatory tariffs on all US goods from April 10",
    "description": "On Thursday, President Trump unveiled a reciprocal plan to impose a 10% tariff on imports from all countries entering the US. He imposed a 34% tariff on China.",
    "link": "https://www.businesstoday.in/latest/economy/story/beijing-hits-back-china-declares-retaliatory-tariffs-on-all-us-goods-from-april-10-470729-2025-04-04",
    "timestamp": "2025-04-04T10:39:10Z"
  },
  {
    "title": "Russia urges restraint on all sides over Iran's nuclear programme",
    "description": "MOSCOW (Reuters) - Russia said on Friday that the question of Iran's nuclear programme should be resolved politically and diplomatically, urging restraint on all sides. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/04/russia-urges-restraint-on-all-sides-over-iran039s-nuclear-programme",
    "timestamp": "2025-04-04T10:39:00Z"
  },
  {
    "title": "Mike Pence honored with JFK Courage Award",
    "description": "The award, created in 1989, is presented to “public servants who have made courageous decisions of conscience without regard for the personal or professional consequences.”",
    "link": "https://www.wmur.com/article/mike-pence-jfk-profile-in-courage-award/64385525",
    "timestamp": "2025-04-04T10:35:00Z"
  },
  {
    "title": "Trump, Tariffs, and the Fate of the Dollar",
    "description": "Donald Trump’s attempt to reindustrialize the US economy by eliminating trade deficits will undoubtedly cause pain and disruption on a massive scale. But it is important to remember that both major US political parties have abandoned free trade in pursuit of …",
    "link": "https://www.project-syndicate.org/commentary/trump-tariffs-global-economic-reordering-by-mark-blyth-2025-04",
    "timestamp": "2025-04-04T10:34:38Z"
  },
  {
    "title": "Morning Bid: 'Magnificent' bear",
    "description": "It's Friday, so today I'll provide a quick overview of what's happening in global markets and then offer you some weekend reading suggestions away from the...",
    "link": "https://finance.yahoo.com/news/morning-bid-magnificent-bear-103415989.html",
    "timestamp": "2025-04-04T10:34:15Z"
  },
  {
    "title": "China Triggers Sudden Bitcoin Price ‘Crisis Scenario’ Fear",
    "description": "Analysts are warning the bitcoin price could be headed into a “crisis scenario\"...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/04/04/china-triggers-sudden-bitcoin-price-crisis-scenario-fear/",
    "timestamp": "2025-04-04T10:34:11Z"
  },
  {
    "title": "China hits back at Trump with 34% tariff on U.S. imports",
    "description": "HONG KONG — China announced a 34% tariff on all U.S. imports on Friday, escalating trade tensions between the world’s two biggest economies.",
    "link": "https://www.nbcnews.com/news/world/china-hits-back-trump-34-tariff-us-imports-rcna199665",
    "timestamp": "2025-04-04T10:32:52Z"
  },
  {
    "title": "Donald Trump triggers race to offer US concessions before tariffs hit - Financial Times",
    "description": "Donald Trump triggers race to offer US concessions before tariffs hitFinancial Times Here’s what could soon cost you a lot more because of Trump’s massive tariffsCNN The New York Times News Quiz, April 4, 2025The New York Times Reciprocal Tariff CalculationsU…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176922801",
    "timestamp": "2025-04-04T10:32:38Z"
  },
  {
    "title": "Most Canadians Support Building an Oil Pipeline That Would Sidestep US Market",
    "description": "More than three in four Canadians would support publicly funding an oil pipeline to carry crude from Alberta to eastern Canada, according to a poll commissioned by Bloomberg.",
    "link": "https://financialpost.com/pmn/business-pmn/most-canadians-support-building-an-oil-pipeline-that-would-sidestep-us-market",
    "timestamp": "2025-04-04T10:31:27Z"
  },
  {
    "title": "Trump fires three National Security Council officers after meeting far-right activist Laura Loomer for THIS reason",
    "description": "The Trump administration has fired three officials of the National Security Council after meeting far-right activist Laura Loomer on Wednesday. Before their firings were reported, Trump told reporters he would get rid of any staff deemed to be disloyal. The f…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-fires-three-national-security-council-officers-after-meeting-far-right-activist-laura-loomer-for-this-reason-loyalty/articleshow/119977762.cms",
    "timestamp": "2025-04-04T10:31:23Z"
  },
  {
    "title": "Netanyahu could visit the U.S. soon, Trump says as dozens killed by strike on school in Gaza",
    "description": "Israel's Prime Minister Benjamin Netanyahu could visit the United States as early as next week, President Donald Trump said.",
    "link": "https://www.nbcnews.com/news/world/israel-hamas-war-trump-netanyahu-us-visit-school-strike-gaza-rcna199654",
    "timestamp": "2025-04-04T10:31:03Z"
  },
  {
    "title": "Here’s How Much Trump’s Biggest Billionaire Donors Lost Thanks To Tariffs",
    "description": "Tariffs wiped out trillions of dollars in value Thursday, much of it held by the world’s richest people.",
    "link": "https://www.forbes.com/sites/kylemullins/2025/04/04/heres-how-much-trumps-biggest-billionaire-donors-lost-thanks-to-tariffs/",
    "timestamp": "2025-04-04T10:30:34Z"
  },
  {
    "title": "Exclusive: Wall Street Sours On Trump",
    "description": "A new Forbes survey of Wall Street heavyweights shows many who supported Trump’s economic promises have abandoned him – and a vast majority disapprove of the President’s economic policies.",
    "link": "https://www.forbes.com/sites/sergeiklebnikov/2025/04/04/exclusive-wall-street-sours-on-trump/",
    "timestamp": "2025-04-04T10:30:00Z"
  },
  {
    "title": "Trust Fund Fortunes: The World’s Richest Heirs 2025",
    "description": "They weren’t just born with a silver spoon—for these billionaires, it was pure gold.",
    "link": "https://www.forbes.com/sites/sylvanlebrun/2025/04/04/trust-fund-fortunes-the-worlds-richest-heirs-2025/",
    "timestamp": "2025-04-04T10:30:00Z"
  },
  {
    "title": "‘Nadir for the party’: US Democrats edge towards civil war",
    "description": "Progressives and moderates are divided over how to stand up to Donald Trump — and much else",
    "link": "https://biztoc.com/x/08a6187335e5080c",
    "timestamp": "2025-04-04T10:28:39Z"
  },
  {
    "title": "David Lammy says Trump has taken US economic policy back 100 years – video",
    "description": "The UK’s foreign minister David Lammy has said the US president Donald Trump’s recent announcement of tariffs against the country’s trade partners takes US policy back to ‘something that we’ve not seen for nearly a century’. Lammy said ‘all options’ were on t…",
    "link": "https://biztoc.com/x/e02db25ac0709e39",
    "timestamp": "2025-04-04T10:28:32Z"
  },
  {
    "title": "China Hits Trump's US With 34% Tariff",
    "description": "China's finance ministry said it would impose a 34 percent tariff on all U.S. goods starting from midnight on April 10, after President Donald Trump announced new tariffs on the Asian giant.\n\"China urges the US to immediately lift unilateral tariffs and resol…",
    "link": "https://biztoc.com/x/f6cc72734193315c",
    "timestamp": "2025-04-04T10:28:31Z"
  },
  {
    "title": "Trump Wants Direct Talks With 'Vulnerable' Iran",
    "description": "U.S. President Donald Trump says he wants \"direct talks\" with Iran in order to allay its unease about a new nuclear deal.\n\"I think they're concerned; I think they feel vulnerable, and I don't want them to feel that way,\" Trump told reporters on Air Force One …",
    "link": "https://biztoc.com/x/2042a54743a55f49",
    "timestamp": "2025-04-04T10:28:29Z"
  },
  {
    "title": "World's largest economies vow to retaliate against Trump tariffs",
    "description": "The News\nUS President Donald Trump’s reshaping of the global economy sparked rancor, fear, and threats of retribution from some of the world’s largest economies. \nFrance’s president called on European companies to pause US investments, and Canada said it woul…",
    "link": "https://biztoc.com/x/285e01c5064201c6",
    "timestamp": "2025-04-04T10:28:18Z"
  },
  {
    "title": "China imposes 34% tariffs on imports of US goods in retaliation | CNN Business",
    "description": "China said on Friday it will impose reciprocal 34% tariffs on all imports from the United States from April 10, making good on a promise to strike back after US President Donald Trump escalated a global trade war.",
    "link": "https://www.cnn.com/2025/04/04/business/china-us-tariffs-retaliation-hnk-intl/index.html",
    "timestamp": "2025-04-04T10:27:51Z"
  },
  {
    "title": "US Tariffs Are Driving Up The Costs Of e-Readers",
    "description": "Many of the world's most popular e-readers have increased prices. What are the most significant price jumps?\nThe post US Tariffs Are Driving Up The Costs Of e-Readers first appeared on Good e-Reader.",
    "link": "https://goodereader.com/blog/electronic-readers/us-tariffs-are-driving-up-the-costs-of-e-readers",
    "timestamp": "2025-04-04T10:27:20Z"
  },
  {
    "title": "Trump tariffs could stymie Big Tech's US data center spending spree",
    "description": "Electronics - which include smartphones, PCs and data-center equipment - were the second biggest imports last year at nearly $486 billion worth of goods, according to Census Bureau data. Bernstein analysts pegged data processing machine imports at about $200 …",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-tariffs-could-stymie-big-techs-us-data-center-spending-spree/articleshow/119977676.cms",
    "timestamp": "2025-04-04T10:25:10Z"
  },
  {
    "title": "China Hits Trump's US With 34% Retaliatory Tariffs",
    "description": "The Chinese finance ministry announced its response to President Donald Trump's \"reciprocal\" tariffs.",
    "link": "https://www.newsweek.com/china-trump-us-tariffs-2055275",
    "timestamp": "2025-04-04T10:24:22Z"
  },
  {
    "title": "Trump Wants Direct Talks With 'Vulnerable' Iran",
    "description": "Trump's statement comes as Iran has rejected overtures for direct negotiations over its nuclear program.",
    "link": "https://www.newsweek.com/trump-wants-direct-talks-vulnerable-iran-2055244",
    "timestamp": "2025-04-04T10:22:04Z"
  },
  {
    "title": "Nationwide Walmart Boycott Planned for April 7: What To Know",
    "description": "A post on The People's Union USA website says: \"This isn't just about skipping a store. It's about conscious spending and it's about discipline.\"",
    "link": "https://www.newsweek.com/nationwide-walmart-boycott-april-2055219",
    "timestamp": "2025-04-04T10:21:44Z"
  },
  {
    "title": "Taiwan Earmarks $2.7 Bn To Help Industries Hit By US Tariffs",
    "description": "Taiwan has earmarked $2.7 billion to help industries affected by US President Donald Trump's new tariffs, the government said Friday.",
    "link": "https://www.ibtimes.com/taiwan-earmarks-27-bn-help-industries-hit-us-tariffs-3768837",
    "timestamp": "2025-04-04T10:21:09Z"
  },
  {
    "title": "Japan stocks extend declines as Trump tariffs roil markets, Nikkei falls over 3% (Lee Ying Shan/CNBC)",
    "description": "Lee Ying Shan / CNBC:\nJapan stocks extend declines as Trump tariffs roil markets, Nikkei falls over 3% … Japan stocks led declines in the region on Friday, tracking steep losses on Wall Street after U.S. President Donald Trump's tariffs rattled global markets…",
    "link": "https://www.memeorandum.com/250404/p6",
    "timestamp": "2025-04-04T10:20:01Z"
  },
  {
    "title": "Female fencer disqualified after declining to fight trans opponent feared for career and personal life before viral protest",
    "description": "The 31-year-old kneeled on the fencing strip, or piste, before she ever launched an attack against Redmond Sullivan during their bout at the University of Maryland in College Park on March 30.",
    "link": "https://nypost.com/2025/04/04/us-news/female-fencer-stephanie-turner-refused-to-compete-against-transgender-opponent-redmond-sullivan-feared-career-from-usa-fencing/",
    "timestamp": "2025-04-04T10:19:55Z"
  },
  {
    "title": "Trump’s Vision Is Ending Globalism and Ushering in a New ‘Golden Age’ of Mercantilism For National Security",
    "description": "Let’s clear something up right away—tariffs aren’t just about economics. They’re not some wonky tax on imported widgets that only policy nerds care about. They’re a statement. They are an attempt to change bad behavior. A line in the sand. Tariffs are about p…",
    "link": "https://freerepublic.com/focus/f-news/4308767/posts",
    "timestamp": "2025-04-04T10:19:27Z"
  },
  {
    "title": "‘Free Le Pen’ – Trump to France",
    "description": "US President Donald Trump has denounced the criminal conviction of French right-wing politician Marine Le Pen Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615221-trump-le-pen-sentence/",
    "timestamp": "2025-04-04T10:18:35Z"
  },
  {
    "title": "Danish PM tells US ‘you cannot annex another country’ on Greenland visit",
    "description": "Denmark's Prime Minister is wrapping up her three-day visit to Greenland after telling the US \"you cannot annex another country\" - even when it comes to questions of international security.",
    "link": "https://www.independent.ie/world-news/north-america/danish-pm-tells-us-you-cannot-annex-another-country-on-greenland-visit/a1339549137.html",
    "timestamp": "2025-04-04T10:18:27Z"
  },
  {
    "title": "Taiwan earmarks $2.7 bn to help industries hit by US tariffs",
    "description": "Taiwan has earmarked $2.7 billion to help industries affected by US President Donald Trump’s new tariffs, the government said Friday. Taipei had sought to avoid Trump’s threatened levies by pledging increased investment in the United States and more purchases…",
    "link": "https://www.digitaljournal.com/world/taiwan-earmarks-2-7-bn-to-help-industries-hit-by-us-tariffs/article",
    "timestamp": "2025-04-04T10:17:33Z"
  },
  {
    "title": "Kremlin: Reports on Trump being advised not to call Putin 'fake'",
    "description": "Kremlin spokesperson Dmitry Peskov told journalists on Friday that the NBC news report about United States President Donald Trump being advised by his inner circle not to contact his Russian counterpa...",
    "link": "https://biztoc.com/x/0875291ca1abe8bf",
    "timestamp": "2025-04-04T10:17:23Z"
  },
  {
    "title": "Living abroad and hungry to see a Chinese movie on the biggest of screens, some took action",
    "description": "A group of Chinese people have decided they wanted the nation’s biggest movie to be big in the United States, literally.",
    "link": "https://www.clickondetroit.com/entertainment/2025/04/04/living-abroad-and-hungry-to-see-a-chinese-movie-on-the-biggest-of-screens-some-took-action/",
    "timestamp": "2025-04-04T10:17:18Z"
  },
  {
    "title": "FO° Talks: Josef Olmert on Syria, Part 5: Iranian Alliance and Investment",
    "description": "[This is the fifth part of a nine-part series. To read more, see Parts 1, 2, 3 and 4 here.] The Islamic Republic of Iran has a mission to spread Shi’ism in the Middle East, which is why it created the Shia Crescent. Their greater goal is to destroy the state …",
    "link": "https://www.fairobserver.com/world-news/middle-east-news/fo-talks-josef-olmert-on-syria-part-5-iranian-alliance-and-investment/",
    "timestamp": "2025-04-04T10:17:03Z"
  },
  {
    "title": "Danish PM Issues Blunt Rebuke To U.S. During Greenland Visit",
    "description": "Prime Minister Mette Frederiksen sent a defiant message amid Donald Trump's bid to control the Danish territory.",
    "link": "https://www.huffpost.com/entry/danish-leader-us-message-greenland_n_67efabb7e4b0b19d5431c2df",
    "timestamp": "2025-04-04T10:17:02Z"
  },
  {
    "title": "Analysis-In leaderless South Korea, Trump's tariffs will overshadow snap election",
    "description": "SEOUL (Reuters) - With a snap election looming, South Korea's rival parties jockeyed for position with vows to focus on the economy and livelihood, but the leaderless country remains hamstrung when it comes to confronting the biggest threat: Trump and tariffs…",
    "link": "https://www.thestar.com.my/news/world/2025/04/04/analysis-in-leaderless-south-korea-trump039s-tariffs-will-overshadow-snap-election",
    "timestamp": "2025-04-04T10:13:00Z"
  },
  {
    "title": "US judge to hear lawsuit of man deported to El Salvador in error",
    "description": "(Reuters) - A U.S. judge in Maryland is scheduled to hear arguments on Friday over the erroneous deportation of a Salvadoran man who was flown to El Salvador last month as part of an agreement by President Donald Trump's administration with that country's gov…",
    "link": "https://www.thestar.com.my/news/world/2025/04/04/us-judge-to-hear-lawsuit-of-man-deported-to-el-salvador-in-error",
    "timestamp": "2025-04-04T10:12:00Z"
  },
  {
    "title": "‘FREE MARINE LE PEN!’ Trump Torches ‘European Leftists’ and Cries ‘Lawfare’ in Fiery Defense of Convicted French Far-Right Leader",
    "description": "President Donald Trump leapt to the defense of French far-right leader Marine Le Pen on Friday, blasting her embezzlement conviction as “lawfare,” while comparing it to his own legal troubles. Le Pen, parliamentary leader of the country’s right-wing populist …",
    "link": "https://www.mediaite.com/news/free-marine-le-pen-trump-torches-european-leftists-and-cries-lawfare-in-fiery-defense-of-convicted-french-far-right-leader/",
    "timestamp": "2025-04-04T10:10:39Z"
  },
  {
    "title": "Scientists sue NIH, HHS, RFK Jr. over termination of research grants",
    "description": "Researchers who had millions of dollars' worth of grants terminated by the National Institutes of Health are suing the federal government.",
    "link": "https://abcnews.go.com/Health/scientists-sue-nih-hhs-rfk-jr-termination-research/story?id=120467017",
    "timestamp": "2025-04-04T10:09:28Z"
  },
  {
    "title": "Bytes: Week in Review — TikTok’s new bidders, Tesla sales slump and OpenAI raises $40 billion",
    "description": "OpenAI — the maker of ChatGPT — keeps raising more money, this time in a $40 billion round led by SoftBank. We’ll get into the strings attached in Marketplace “Tech Bytes — Week in Review.” Plus, what’s going on with Tesla’s sales slump? And how much is its p…",
    "link": "https://www.marketplace.org/shows/marketplace-tech/bytes-week-in-review-tiktoks-new-bidders-tesla-sales-slump-and-openai-raises-40-billion/",
    "timestamp": "2025-04-04T10:09:20Z"
  },
  {
    "title": "Arizona Mayor Says Locals Can Buy Food in Mexico To Avoid Tariff Rises",
    "description": "The mayor of the city of Douglas in Arizona has told Newsweek that residents can buy cheaper goods in Mexico after President Donald Trump rocked the stock market following his wave of tariffs.\n\"The tariffs will not impact us as much, as we can always cross to…",
    "link": "https://biztoc.com/x/a9955914c0db0f9b",
    "timestamp": "2025-04-04T10:06:34Z"
  },
  {
    "title": "China e-commerce vendors scramble to respond to Trump tariffs, ‘de minimis’ exemption end",
    "description": "Many of the country’s 120,000 online exporters, whose major market is the\nUnited States, are making those adjustments after US President\nDonald Trump imposed\n34 per cent reciprocal tariffs on Chinese imports and ended the “de minimis” exemption that allowed p…",
    "link": "https://biztoc.com/x/207ccff84943fac5",
    "timestamp": "2025-04-04T10:06:26Z"
  },
  {
    "title": "At this time of crisis, we must ask, where has Canada gone wrong?",
    "description": "Giles Gherson is president and chief executive of the Toronto Region Board of Trade.\nDespite some reprieve, U.S. President Donald Trump imposed a damaging array of tariffs on Canadian products this week; seemingly still committed to employing economic “force”…",
    "link": "https://biztoc.com/x/7d5b099f33e8da05",
    "timestamp": "2025-04-04T10:06:26Z"
  },
  {
    "title": "Trump's move to kill duty-free shipping from China will cost Canadian companies",
    "description": "Canadian companies, from smaller retail businesses to third-party logistics providers, will soon start paying tariffs on low-value shipments from China and Hong Kong bound for the United States.\nIn a Wednesday executive order, U.S. President Donald Trump decl…",
    "link": "https://biztoc.com/x/5112bbaf29c2edaf",
    "timestamp": "2025-04-04T10:06:25Z"
  },
  {
    "title": "Eric Trump Says This Country Will Win If They Try 'To Negotiate A Trade Deal With' Donald Trump: 'I Have Seen This Movie My Entire Life'",
    "description": "Eric Trump, son of President Donald Trump, has warned nations against being the last to negotiate a trade deal with his father, citing the risk of a losing outcome.\nWhat Happened: Eric, in a post on X on Thursday, cautioned countries about the potential pitfa…",
    "link": "https://biztoc.com/x/775994faf48bdb12",
    "timestamp": "2025-04-04T10:06:21Z"
  },
  {
    "title": "Trump tariffs are 'pure madness' and the European Union should not comply, former Italian PM says",
    "description": "U.S. President Donald Trump's so-called 'Liberation Day' trade tariffs are \"madness, pure madness\", according to former Italian Prime Minister and Dean of the IE School of Politics Enrico Letta, who called the reciprocal levies \"incomprehensible.\"\nSpeaking to…",
    "link": "https://biztoc.com/x/c9d4369380f32f7b",
    "timestamp": "2025-04-04T10:06:09Z"
  },
  {
    "title": "Elon Musk Lost $11B After Trump's Tariffs—and He Wasn't the Biggest Loser",
    "description": "Elon Musk, the CEO of Tesla and SpaceX, is a close political ally and major funder of President Donald Trump.",
    "link": "https://biztoc.com/x/9641316f8cee6297",
    "timestamp": "2025-04-04T10:06:03Z"
  },
  {
    "title": "Trump tariffs are 'pure madness' and the European Union should not comply, former Italian PM says",
    "description": "U.S. President Donald Trump's so-called 'Liberation Day' trade tariffs are \"madness, pure madness\", according to former Italian Prime Minister Enrico Letta.",
    "link": "https://www.cnbc.com/2025/04/04/trump-tariffs-are-pure-madness-and-the-european-union-should-not-comply-former-italian-pm-says.html",
    "timestamp": "2025-04-04T10:03:58Z"
  },
  {
    "title": "One Republican senator voted against confirming Trump nominee Harmeet Dhillon",
    "description": "Sen. Lisa Murkowski was the only Republican senator to vote against confirming Trump nominee Harmeet Dhillon to serve as assistant attorney general.",
    "link": "https://www.foxnews.com/politics/one-republican-senator-voted-against-confirming-trump-nominee-harmeet-dhillon",
    "timestamp": "2025-04-04T10:03:18Z"
  },
  {
    "title": "What Happens When USAID’s Global Public Health Programs Go Away?",
    "description": "USAID is responsible for global health efforts that have saved the lives of millions of children. What happens when those programs are cut?",
    "link": "https://www.scientificamerican.com/podcast/episode/what-happens-when-usaids-global-public-health-programs-go-away/",
    "timestamp": "2025-04-04T10:03:12Z"
  },
  {
    "title": "Stocks slide again after Trump tariff rout",
    "description": "Banking stocks retreat as investors fret about growth and price in far more central bank rate cuts",
    "link": "https://www.irishtimes.com/business/economy/2025/04/04/stocks-slide-again-after-trump-tariff-rout/",
    "timestamp": "2025-04-04T10:03:01Z"
  },
  {
    "title": "Jack Mintz: How to respond to Trump’s tariff provocations",
    "description": "Jack Mintz: Retaliation involves self-harm and diversification isn't easy. A re-worked deal with the U.S. is probably our best bet. Read on",
    "link": "https://financialpost.com/opinion/jack-mintz-how-to-respond-to-trumps-tariff-provocations",
    "timestamp": "2025-04-04T10:00:50Z"
  },
  {
    "title": "JD Vance bashed tariffs during Trump’s first term. Now, as VP, he’s championing them | CNN Politics",
    "description": "Vice President Vance previously blamed automation for lost manufacturing jobs and opposed ‘protectionist’ policies. Now, he’s championing Trump’s tariffs.",
    "link": "https://www.cnn.com/2025/04/04/politics/kfile-vance-trump-tariffs-protectionist-criticized-invs/index.html",
    "timestamp": "2025-04-04T10:00:36Z"
  },
  {
    "title": "Social Security targets tech team for layoffs at a time when systems are under strain",
    "description": "The Social Security Administration plans to slash its technology team by nearly one-third at a time when the agency’s complex and fragile computer systems are crashing more often.",
    "link": "https://www.cnn.com/2025/04/04/politics/social-security-tech-team-layoffs/index.html",
    "timestamp": "2025-04-04T10:00:36Z"
  },
  {
    "title": "Critical flaw in Apache Parquet’s Java Library allows remote code execution",
    "description": "Experts warn of a critical vulnerability impacting Apache Parquet’s Java Library that could allow remote code execution. Apache Parquet’s Java Library is a software library for reading and writing Parquet files in the Java programming language. Parquet is a c…",
    "link": "https://securityaffairs.com/176187/security/apache-parquets-java-library-critical-flaw.html",
    "timestamp": "2025-04-04T10:00:26Z"
  },
  {
    "title": "Trump’s move to kill duty-free shipping from China will cost Canadian companies",
    "description": "U.S. president eliminating 'de minimis' trade provision for goods originating from China and Hong Kong starting on May 2. Keep reading here.",
    "link": "https://financialpost.com/technology/donald-trump-kills-china-tariff-free-shipping",
    "timestamp": "2025-04-04T10:00:25Z"
  },
  {
    "title": "Inside Mark Carney's weirdly dreary campaign, where the dullness is the point",
    "description": "Even in a warehouse full of battery-powered buses, Mark Carney’s speech proved to be the furthest thing from electric.",
    "link": "https://nationalpost.com/news/canada/mark-carneys-dull-campaign",
    "timestamp": "2025-04-04T10:00:23Z"
  },
  {
    "title": "Trump’s War on Big Law",
    "description": "The firms in the president’s crosshairs must decide: cave to save their profits-per-partner or take up a tough fight?, writes legal columnist Elie Honig.",
    "link": "http://nymag.com/intelligencer/article/trumps-war-on-big-law.html",
    "timestamp": "2025-04-04T10:00:19Z"
  },
  {
    "title": "Terence Corcoran: How can voters make sense of economists’ competing views on tariffs?",
    "description": "Terence Corcoran: The collapse of trade theory has been feeding the looming economic crisis over free trade and tariffs. Find out more here",
    "link": "https://financialpost.com/opinion/terence-corcoran-how-can-voters-make-sense-of-economists-competing-views-on-tariffs",
    "timestamp": "2025-04-04T10:00:09Z"
  },
  {
    "title": "Lemon8 and TikTok Could Be Banned. Here's How the Apps Are Different",
    "description": "TikTok and Lemon8 are owned by the same parent company, but they offer different experiences.",
    "link": "https://www.cnet.com/tech/services-and-software/lemon8-and-tiktok-could-be-banned-heres-how-the-apps-are-different/",
    "timestamp": "2025-04-04T10:00:07Z"
  },
  {
    "title": "In a week, RFK Jr. fat-shames the West Virginia governor, fires 10k HHS workers, and enrages Wall Street",
    "description": "Last Friday, during an appearance in Martinsburg, West Virginia, our brain-wormed Health and Human Services Secretary Robert F. Kennedy Jr. ridiculed the state’s Gov\r\n. Patrick Morrisey's weight, making derogatory comments and suggesting public weigh-ins. He …",
    "link": "https://www.advocate.com/voices/rfk-jr-offends-everyone",
    "timestamp": "2025-04-04T10:00:03Z"
  },
  {
    "title": "The Dismal Science and the Trumpian Tariff Hullabaloo | Opinion",
    "description": "This experiment has just begun, and the jury is still out.",
    "link": "https://www.newsweek.com/dismal-science-trumpian-tariff-hullabaloo-opinion-2055148",
    "timestamp": "2025-04-04T10:00:02Z"
  },
  {
    "title": "Le Pen Conviction Proves Trump Right About Europe, Lawfare | Opinion",
    "description": "If the West is to present a real alternative to autocracy, it must recover the courage to permit real political debate, even when it is inconvenient.",
    "link": "https://www.newsweek.com/le-pen-conviction-proves-trump-right-about-europe-lawfare-opinion-2053318",
    "timestamp": "2025-04-04T10:00:01Z"
  },
  {
    "title": "Trade War",
    "description": "The latest episode of Trial Balloon is live for members. Donald Trump starts a trade war while Cory Booker gives Democrats hope. Join now to continue reading. Members get exclusive […]",
    "link": "https://politicalwire.com/2025/04/04/trade-war/",
    "timestamp": "2025-04-04T10:00:01Z"
  },
  {
    "title": "Republicans are sleepwalking into a midterm disaster. Wisconsin should be a wake-up call.",
    "description": "The results of a state Supreme Court race in Wisconsin should be a wake-up call for Republicans about the unpopularity of Elon Musk.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/wisconsin-supreme-court-musk-republicans-rcna199512",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Trump Has Upended the Lives of Afghan Refugees",
    "description": "When Hasib Satary and his family arrived in the United States on August 27, 2021—less than two weeks after the fall of Kabul—he was in dire need of resettlement services. It had been a stressful ten-day journey for Satary, a former U.S. embassy employee in th…",
    "link": "https://newrepublic.com/article/193577/afghan-refugees-trump-cut-resettlement",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Here’s What Trump’s Tariffs Could Do to the U.S. Auto Industry",
    "description": "Announcing a barrage of new tariffs on the White House lawn yesterday, Donald Trump promised that jobs and factories “will come roaring back into our country.” He paid special attention to the 20 or so autoworkers in the audience. “The autoworkers were fantas…",
    "link": "https://newrepublic.com/article/193590/trump-tariffs-auto-industry-layoffs",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Unravelling claims Biden abandoned NASA astronauts in space for political gain",
    "description": "Barry \"Butch\" Wilmore and Sunita \"Suni\" Williams had to stay at the International Space Station for nine months after their capsule malfunctioned.",
    "link": "https://www.snopes.com//news/2025/04/04/space-biden-nasa-astronauts/",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Retro Masculinity on Broadway, in “Glengarry Glen Ross” and “Good Night, and Good Luck”",
    "description": "Helen Shaw reviews David Mamet’s classic, starring Kieran Culkin and Bob Odenkirk, and George Clooney’s timely portrait of media courage, based on the story of Edward R. Murrow.",
    "link": "https://www.newyorker.com/magazine/2025/04/14/glengarry-glen-ross-good-night-and-good-luck-theatre-review-broadway",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "D.C.’s Blackness Made It a Cultural Capital. Now It’s a Political Target.",
    "description": "(Photo by Getty Images / Unsplash+)\r\n\n\n \n\n\n\n\n\n\nWashington, D.C. has always been the embodiment of Black culture in the U.S. But now the District of Columbia is in danger. These two facts are not unrelated. D.C. is in political chaos because Black people make …",
    "link": "https://nextcity.org/urbanist-news/d.c.s-blackness-made-it-a-cultural-capital.-now-its-a-political-target",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Bitcoin DeFi surge may boost BTC demand and adoption — Binance",
    "description": "The value locked in Bitcoin-based decentralized finance (BTCFi) has surged by more than 2,700% over the past year, potentially transforming Bitcoin from a passive store of value into a productive, yield-bearing asset, according to new research from Binance.BT…",
    "link": "https://cointelegraph.com/news/bitcoin-demand-skyrocket-2-700-bitcoin-defi-surge",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "DOGE wants to modernize Social Security’s legacy tech — what could possibly go wrong?",
    "description": "The Social Security Administration (SSA) payment system has more than 60 million lines of COBOL code. That makes it one of the world’s largest, not to mention oldest, codebases. Everyone agrees it needs to be updated. But, sorry, there’s no way it can be upda…",
    "link": "https://www.computerworld.com/article/3953741/doge-wants-to-modernize-social-securitys-legacy-tech-what-could-possibly-go-wrong.html",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Has Trump’s Legal Strategy Backfired?",
    "description": "Ruth Marcus on how the Trump Administration’s maximalist assertions of the scope of Presidential power and its insistence that any potential intrusion on executive authority necessitates emergency relief are faring poorly in court.",
    "link": "https://www.newyorker.com/news/the-lede/has-trumps-legal-strategy-backfired",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Palestinians Are Invisible to Mike Huckabee. To Trump, He’s Perfect.",
    "description": "Last week’s Senate confirmation hearing for former Arkansas\nGovernor Mike Huckabee to be Donald Trump’s ambassador to Israel contained one\nastonishing moment that no one seems to have noticed. Responding (or rather\ntrying to avoid responding) to a question fr…",
    "link": "https://newrepublic.com/article/193537/mike-huckabee-israel-confirmation-palestinians-invisible",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Trump’s tariff math is just not adding up",
    "description": "Donald Trump's global tariffs are based on the trade deficit with countries, not a reciprocal measure of their import taxes on American goods.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariff-chart-taxes-rcna199524",
    "timestamp": "2025-04-04T10:00:00Z"
  },
  {
    "title": "Israel's institutions under pressure after another week of multiple crises",
    "description": "NATIONAL AFFAIRS: For now, Israel’s institutions are holding the line. But how long they can continue to do so under such relentless pressure remains an open question.",
    "link": "https://www.jpost.com/israel-news/article-848801",
    "timestamp": "2025-04-04T09:59:56Z"
  },
  {
    "title": "Apple Takes A $250 Billion Hit In Market Capitalization Following President Donald Trump’s Announcement Of Raising Tariffs For Several Countries",
    "description": "The introduction of hefty tariffs by the Trump administration has unleashed a firestorm like no other, with Apple being one of the many companies that had to endure a massive blow on a Thursday because of the latest announcement. The company suffered a mammot…",
    "link": "https://wccftech.com/apple-250-billion-market-capitalization-drop-after-trump-tariff-announcement/",
    "timestamp": "2025-04-04T09:59:29Z"
  },
  {
    "title": "Arizona Mayor Says Locals Can Buy Food in Mexico To Avoid Tariff Rises",
    "description": "\"The tariffs will not impact us as much as we can always cross to Mexico to buy goods such as tortillas, cheese, or snacks,\" Mayor Jose Grijalva told Newsweek.",
    "link": "https://www.newsweek.com/arizona-mayor-locals-buy-food-mexico-tariff-2055215",
    "timestamp": "2025-04-04T09:58:59Z"
  },
  {
    "title": "Trump Open to Tariff Negotiation; Investors Await Labor Data and Powell",
    "description": "On today's podcast: 1) President Trump says he's open to tariff cuts in return for phenomenal offers. President Trump indicated that more tariffs are on the way, specifically mentioning pharmaceuticals, and reiterated his willingness to offer tariff relief fo…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/trump-open-to-tariff-negotiation-investors-await-labor-data-and-powell",
    "timestamp": "2025-04-04T09:57:27Z"
  },
  {
    "title": "What Trump’s betrayal of Ukraine means for the West, democracy and freedom",
    "description": "At the end of February, Donald Trump and Ukrainian President, Volodymyr Zelensky, had a public falling out during a White House meeting to discuss a mineral access deal with the US. Jim Rice comments that the public spat is representative of how Trump’s new p…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/04/04/what-trumps-betrayal-of-ukraine-means-for-the-west-democracy-and-freedom/",
    "timestamp": "2025-04-04T09:57:23Z"
  }
]