[
  {
    "title": "The Culture Wars Claim Another Victim",
    "description": "Like, whoa. Republican U.S. Representative Marjorie Taylor Greene said on Friday that she was resigning from her position and that her last day in office will be January 5, with her announcement coming after a public fallout with President Donald Trump. Green…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/the-culture-wars-claim-another-victim",
    "timestamp": "2025-11-22T01:27:52Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene to resign in January",
    "description": "Rep. Marjorie Taylor Greene, R-Ga., announced on Friday that she is resigning from her seat, following weeks of clashing with President Donald Trump.“If I am cast aside by MAGA Inc and replaced by Neocons, Big Pharma, Big Tech, Military Industrial War Complex…",
    "link": "https://www.nbcnews.com/politics/congress/rep-marjorie-taylor-greene-resign-january-rcna245278",
    "timestamp": "2025-11-22T01:26:47Z"
  },
  {
    "title": "Texas seeks Supreme Court order to use a congressional map judges held is likely racially biased (Mark Sherman/Associated Press)",
    "description": "Mark Sherman / Associated Press:\nTexas seeks Supreme Court order to use a congressional map judges held is likely racially biased  —  Texas on Friday asked the Supreme Court for an emergency order to be allowed to use a congressional redistricting plan pushed…",
    "link": "https://www.memeorandum.com/251121/p129",
    "timestamp": "2025-11-22T01:25:01Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,367",
    "description": "Here are the key events from day 1,367 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/22/russia-ukraine-war-list-of-key-events-day-1367",
    "timestamp": "2025-11-22T01:24:51Z"
  },
  {
    "title": "Breaking: Marjorie Taylor Greene to resign after fallout with Donald Trump",
    "description": "Republican US Representative Marjorie Taylor Greene has announced she will resign from her position.",
    "link": "https://www.abc.net.au/news/2025-11-22/marjorie-taylor-greene-resigns-after-trump-fallout/106040468",
    "timestamp": "2025-11-22T01:24:32Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene says she will resign Jan. 5",
    "description": "Rep. Marjorie Taylor Greene supported a bill compelling the release of the Jeffrey Epstein files by the DOJ, putting her on the bad side of President Trump.",
    "link": "https://www.cnbc.com/2025/11/21/marjorie-taylor-greene-resign-trump-epstein-mtg.html",
    "timestamp": "2025-11-22T01:24:20Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene says she will resign Jan. 5",
    "description": "Republican Rep. Marjorie Taylor Greene of Georgia announced on Friday night that she will resign her seat in the House of Representatives effective Jan. 5.\nGreene's announcement, in a video and statement posted on X, came after a dramatic break with President…",
    "link": "https://biztoc.com/x/91f47d717d50fd0d",
    "timestamp": "2025-11-22T01:24:06Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene of Georgia, former Trump loyalist, says she is resigning from Congress",
    "description": "Rep. Marjorie Taylor Greene of Georgia, a once-loyal supporter of President Donald Trump who has become a critic, said Friday she is resigning from Congress ...",
    "link": "https://www.yahoo.com/news/articles/rep-marjorie-taylor-greene-georgia-012330266.html",
    "timestamp": "2025-11-22T01:23:30Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene of Georgia, former Trump loyalist, says she is resigning from Congress",
    "description": "Rep. Marjorie Taylor Greene of Georgia, a once-loyal supporter of President Donald Trump who has become a critic, said Friday she is resigning from Congress in January.",
    "link": "https://www.bostonherald.com/2025/11/21/rep-marjorie-taylor-greene-of-georgia-former-trump-loyalist-says-she-is-resigning-from-congress/",
    "timestamp": "2025-11-22T01:23:30Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene of Georgia, former Trump loyalist, says she is resigning from Congress",
    "description": "Rep. Marjorie Taylor Greene of Georgia, a once-loyal supporter of President Donald Trump who has become a critic, said Friday she is resigning from Congress in January.",
    "link": "https://www.denverpost.com/2025/11/21/rep-marjorie-taylor-greene-of-georgia-former-trump-loyalist-says-she-is-resigning-from-congress/",
    "timestamp": "2025-11-22T01:23:30Z"
  },
  {
    "title": "Marjorie Taylor Greene announces resignation in January",
    "description": "This comes about 1 week after a public, online feud with President Donald Trump.",
    "link": "https://www.wsbtv.com/news/local/atlanta/marjorie-taylor-greene-announces-resignation-january/FGCS3A725JFHJMB67G6HEMILOM/",
    "timestamp": "2025-11-22T01:23:29Z"
  },
  {
    "title": "Trump ends temporary protected status for Somalis",
    "description": "Donald Trump announces an immediate end to Temporary Protected Status (TPS) for Somalis in Minnesota, impacting thousands and sparking legal challenges.\n\nRead More: https://punchng.com/trump-ends-temporary-protected-status-for-somalis/",
    "link": "https://punchng.com/trump-ends-temporary-protected-status-for-somalis/",
    "timestamp": "2025-11-22T01:23:15Z"
  },
  {
    "title": "Warren: Trump Is Trying to Take Mamdani’s Shine",
    "description": "Friday on CNN's \"The Lead,\" Sen. Elizabeth Warren (D-MA) said President Donald Trump was trying to take some of the \"shine\" of New York City Mayor-elect Zohran Mamdani during their Oval Office meeting.\nThe post Warren: Trump Is Trying to Take Mamdani’s Shine …",
    "link": "https://www.breitbart.com/clips/2025/11/21/warren-trump-is-trying-to-take-mamdanis-shine/",
    "timestamp": "2025-11-22T01:22:51Z"
  },
  {
    "title": "Marjorie Taylor Greene To Resign From Congress",
    "description": "The surprising news comes amid a public feud with President Donald Trump.",
    "link": "https://www.huffpost.com/entry/marjorie-taylor-greene-resigning-congress_n_69210e4ae4b0536e01ad2943",
    "timestamp": "2025-11-22T01:20:49Z"
  },
  {
    "title": "GOP Rep. Marjorie Taylor Greene to resign in January | CNN Politics",
    "description": "Georgia GOP Rep. Marjorie Taylor Greene announced Friday she will be resigning from office in January.",
    "link": "https://www.cnn.com/2025/11/21/politics/marjorie-taylor-greene-resign-in-january",
    "timestamp": "2025-11-22T01:20:33Z"
  },
  {
    "title": "Breaking: Hamas Breaches White House Perimeter",
    "description": "https://babylonbee.com/news/breaking-hamas-breaches-white-house-perimeterWASHINGTON, D.C. — President Donald Trump was rushed to an emergency bunker below the East Wing following reports that a member of Hamas breached the White House perimeter. According to …",
    "link": "https://freerepublic.com/focus/f-chat/4353946/posts",
    "timestamp": "2025-11-22T01:20:08Z"
  },
  {
    "title": "Sweden offers Canada a chance to revive its near-dead defence aerospace industry",
    "description": "Building Saab’s Gripen fighter jet and GlobalEye surveillance plane in Canada would create thousands of jobs – and infuriate Trump",
    "link": "https://www.theglobeandmail.com/business/commentary/article-sweden-saab-gripen-fighter-jet-defence/",
    "timestamp": "2025-11-22T01:18:54Z"
  },
  {
    "title": "Trump Tells Mamdani That He Wants Him to Succeed",
    "description": "President Donald Trump said he wants to see Zohran Mamdani succeed, saying after a highly anticipated sitdown that he’d “feel very comfortable” living in a New York run by the mayor-elect and that he doesn’t anticipate cutting off funding for the country’s mo…",
    "link": "https://biztoc.com/x/bd7b6da38575905f",
    "timestamp": "2025-11-22T01:13:03Z"
  },
  {
    "title": "Former Trump ally turned critic announces sudden resignation",
    "description": "Marjorie Taylor Greene - a one-time MAGA ally who has turned into a fierce critic of Donald Trump - has unexpectedly announced she is resigning from Congress.",
    "link": "https://news.sky.com/story/marjorie-taylor-greene-former-trump-ally-turned-critic-announces-sudden-resignation-13473807",
    "timestamp": "2025-11-22T01:11:00Z"
  },
  {
    "title": "Kennedy Center says it's being paid $7.4 million ahead of the World Cup draw",
    "description": "The Kennedy Center is receiving $7.4 million ahead of the World Cup draw next month",
    "link": "https://abcnews.go.com/US/wireStory/kennedy-center-paid-74-million-ahead-world-cup-127770609",
    "timestamp": "2025-11-22T01:09:53Z"
  },
  {
    "title": "Writer Details Her Customer Service Experience Trying To Secure A Trump Mobile SIM Card",
    "description": "We all knew Trump Mobile was the jig when it was first announced, and one tech writer for The Verge learned that likely remains to be the case.",
    "link": "https://hiphopwired.com/2917700/trump-mobile-sim-card-experience-details/",
    "timestamp": "2025-11-22T01:09:44Z"
  },
  {
    "title": "Trump Tells Mamdani He Can 'Just Say Yes' When Asked If He Thinks Trump Is a Fascist",
    "description": "President Donald Trump joked with New York City Mayor-Elect Zohran Mamdani, a Democratic Socialist, that he could \"just say yes,\" when asked if he was \"affirming\" his previous comments labeling Trump a fascist.\nThe post Trump Tells Mamdani He Can ‘Just Say Ye…",
    "link": "https://www.breitbart.com/politics/2025/11/21/trump-tells-mamdani-he-can-just-say-yes-when-asked-if-he-thinks-trump-is-a-fascist/",
    "timestamp": "2025-11-22T01:02:26Z"
  },
  {
    "title": "Ukraine, US to start talks in Switzerland on peace plan",
    "description": "Ukraine and the US will soon meet in Switzerland to discuss Washington's plan for ending the war with Russia, which currently heeds to some of Russia's hardline demands, Kyiv said.",
    "link": "https://www.rte.ie/news/ukraine/2025/1122/1545279-ukraine-russia/",
    "timestamp": "2025-11-22T01:02:17Z"
  },
  {
    "title": "Trump pushes Ukraine to accept plan ahead of deadline",
    "description": "US President Donald Trump has urged Ukraine to accept his administration's plan aimed at ending the war with Russia by ceding territory, saying his counterpart in Ukraine will \"have to like it\".",
    "link": "https://www.rte.ie/news/ukraine/2025/1122/1545279-trump-pushes-ukraine-to-accept-plan-ahead-of-deadline/",
    "timestamp": "2025-11-22T01:02:17Z"
  },
  {
    "title": "Trump pushes Ukraine to accept plan ahead of deadline",
    "description": "US President Donald Trump urged Ukraine to accept his administration's plan aimed at ending the war with Russia by ceding territory, saying his counterpart in Ukraine will \"have to like it.\"",
    "link": "https://www.rte.ie/news/world/2025/1122/1545279-trump-pushes-ukraine-to-accept-plan-ahead-of-deadline/",
    "timestamp": "2025-11-22T01:02:17Z"
  },
  {
    "title": "Former Dem senator says Biden's failure on border paved way for President Trump, defends crime crackdown",
    "description": "Former Democratic Sen. Joe Manchin blames former President Joe Biden's border failures for giving Trump cover to implement controversial policies.",
    "link": "https://www.foxnews.com/media/former-dem-senator-says-bidens-failure-border-paved-way-president-trump-defends-crime-crackdown",
    "timestamp": "2025-11-22T01:00:48Z"
  },
  {
    "title": "News From Nancy 11/21/2025 — Save Our Health Care",
    "description": "Dear Friends,  &nbsp;This week, Democrats responded to the calls from the American people – particularly from women – to release the Epstein Files and to continue to insist on a vote to extend the Affordable Care Act premium credits. As we predicted before th…",
    "link": "https://www.saveourhealthcare.org/news/112125",
    "timestamp": "2025-11-22T00:57:55Z"
  },
  {
    "title": "Tyson Foods to close major U.S. beef plant as cattle supplies fall | Honolulu Star-Advertiser",
    "description": "CHICAGO >> Tyson Foods will close a major beef plant in Lexington, Nebraska, with about 3,200 employees in January after U.S. cattle supplies dropped to their lowest level in nearly 75 years, the meatpacker said today.",
    "link": "https://www.staradvertiser.com/2025/11/21/breaking-news/tyson-foods-to-close-major-u-s-beef-plant-as-cattle-supplies-fall/",
    "timestamp": "2025-11-22T00:56:29Z"
  },
  {
    "title": "Republicans Call Out ‘Despicable’ Democrats After Majority Refuse to Condemn Socialism",
    "description": "House Republicans blasted Democrats on Friday after a majority refused to condemn the horrors of socialism, warning that the vote revealed “more Democrats support socialism than oppose it.”\nThe post Republicans Call Out ‘Despicable’ Democrats After Majority R…",
    "link": "https://www.breitbart.com/politics/2025/11/21/gop-calls-out-despicable-democrats-after-majority-refuse-to-condemn-socialism/",
    "timestamp": "2025-11-22T00:56:24Z"
  },
  {
    "title": "Supreme Court Blocks Order That Found Texas Congressional Map Is Likely Racially Biased",
    "description": "The U.S. Supreme Court has temporarily blocked a lower court court ruling that found Texas’ 2026 congressional redistricting plan likely discriminates on the basis of race.",
    "link": "https://www.huffpost.com/entry/election-2026-redistricting-texas_n_6921096de4b0d31c0a7a79b6",
    "timestamp": "2025-11-22T00:55:31Z"
  },
  {
    "title": "Elizabeth Warren Suggests Trump Wants To Take Mamdani’s ‘Shine’ And ‘Rub’ It On Himself",
    "description": "Sen. Elizabeth Warren said Friday on CNN that President Donald Trump is trying to latch onto New York City Mayor-elect Zohran Mamdani’s rising profile.",
    "link": "https://dailycaller.com/2025/11/21/elizabeth-warren-trump-jealous-mamdani/",
    "timestamp": "2025-11-22T00:55:23Z"
  },
  {
    "title": "I voted for Trump. Then the moms came for me.",
    "description": "My close friends blame me for everything that Donald Trump does.One year ago I, a lifelong Democrat, wrote in The Free Press that I had just voted for Trump. I realized that my party had turned its back on working-class families like my own—in favor of identi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4353939/posts",
    "timestamp": "2025-11-22T00:51:45Z"
  },
  {
    "title": "Kremlin uncertain about Trump-Putin summit",
    "description": "Kremlin press secretary Dmitry Peskov told TASS that it remains to be determined whether a new meeting between Russian President Vladimir Putin and his United States counterpart Donald Trump is necess...",
    "link": "https://biztoc.com/x/bf3280b1401cad36",
    "timestamp": "2025-11-22T00:51:00Z"
  },
  {
    "title": "Trump: There's So Much Media Attention Around Mamdani Meeting Because 'He's Different'",
    "description": "President Donald Trump said Friday that there is more media attention around his meeting with New York City Mayor-elect Zohran Mamdani than even some foreign leaders because Mamdani, a self-identified Democratic Socialist, is \"different.\"\nThe post Trump: Ther…",
    "link": "https://www.breitbart.com/politics/2025/11/21/trump-theres-so-much-media-attention-around-mamdani-meeting-because-hes-different/",
    "timestamp": "2025-11-22T00:50:44Z"
  },
  {
    "title": "Trump, Mamdani find common ground in their goals for NYC#shorts #mamdani #trump #politics #nyc",
    "description": "President Donald Trump said he wants to see Zohran Mamdani succeed, saying after a highly anticipated sitdown that he'd “feel ...",
    "link": "https://biztoc.com/x/c48b3c2b0f947cf0",
    "timestamp": "2025-11-22T00:44:54Z"
  },
  {
    "title": "Inspecting claim Education Department stopped counting nursing, other programs as 'professional degrees'",
    "description": "In late 2025, the Department of Education said it would no longer classify these credentials as professional degrees: education (including teaching master’s degrees), nursing (MSN, DNP), social work (MSW, DSW), public health (MPH, DrPH), physician assistant, …",
    "link": "https://www.snopes.com//fact-check/trump-professional-degrees-nursing/",
    "timestamp": "2025-11-22T00:43:00Z"
  },
  {
    "title": "From Steve Bannon to Elizabeth Warren, backlash erupts over push to block states from regulating AI",
    "description": "New efforts this week in Washington to effectively ban individual states from governing artificial intelligence have provoked bipartisan backlash.",
    "link": "https://www.nbcnews.com/tech/tech-news/steve-bannon-elizabeth-warren-bipartisan-backlash-erupts-push-block-st-rcna245040",
    "timestamp": "2025-11-22T00:41:39Z"
  },
  {
    "title": "IRS Clarifies How to Claim ‘No Tax on Tips’ Deductions",
    "description": "The Internal Revenue Service (IRS) has issued guidance that it said clarifies how to claim deductions associated with the “No Tax on Tips” law. The guidance also provides “transition relief” for workers who receive tips in specified service trades or business…",
    "link": "https://www.pymnts.com/taxes/2025/irs-clarifies-how-to-claim-no-tax-on-tips-deductions/",
    "timestamp": "2025-11-22T00:41:03Z"
  },
  {
    "title": "Democrats file police complaints over Trump’s posts accusing them of sedition",
    "description": "Several congressional Democrats filed police complaints over social media posts from President Donald Trump calling for them to face arrest and even punishment by death after they advised U.S. service members to defy illegal orders. At least three lawmakers —…",
    "link": "https://freerepublic.com/focus/f-news/4353934/posts",
    "timestamp": "2025-11-22T00:40:39Z"
  },
  {
    "title": "Calls Grow to Release Transcript of ‘Highly Disturbing’ Trump-MBS Call After Khashoggi Murder",
    "description": "The widow of Jamal Khashoggi on Friday joined Democratic members of Congress in urging President Donald Trump to release the transcript of a phone conversation between the US leader and Saudi Crown Prince Mohammed bin Salman following the journalist’s 2018 ki…",
    "link": "https://www.antiwar.com/blog/2025/11/21/calls-grow-to-release-transcript-of-highly-disturbing-trump-mbs-call-after-khashoggi-murder/",
    "timestamp": "2025-11-22T00:39:08Z"
  },
  {
    "title": "Insecurity: US defence chief asks FG to be decisive",
    "description": "The US Defence Secretary urges Nigeria’s government to take decisive action to curb the rising violence and persecution of Christians in the country.\n\nRead More: https://punchng.com/insecurity-us-defence-chief-asks-fg-to-be-decisive/",
    "link": "https://punchng.com/insecurity-us-defence-chief-asks-fg-to-be-decisive/",
    "timestamp": "2025-11-22T00:39:07Z"
  },
  {
    "title": "Politico Senior Writer Now Admits Epstein Files Release Unlikely to Harm Trump",
    "description": "Very sad news for those of you who have become connoisseurs of the hilarious inadvertent comedy provided by Politico's over-the-top obsession with the Jeffrey Epstein files the past few months. Those good times might soon be gone.No more laughs provided by a …",
    "link": "https://freerepublic.com/focus/f-chat/4353932/posts",
    "timestamp": "2025-11-22T00:35:33Z"
  },
  {
    "title": "Politico Senior Writer Now Admits Epstein Files Release Unlikely to Harm Trump",
    "description": "Very sad news for those of you who have become connoisseurs of the hilarious inadvertent comedy provided by Politico's over-the-top obsession with the Jeffrey Epstein files the past few months. Those good times might soon be gone.No more laughs provided by a …",
    "link": "https://freerepublic.com/focus/f-news/4353932/posts",
    "timestamp": "2025-11-22T00:35:33Z"
  },
  {
    "title": "After Threats Throughout NYC Campaign, Trump Lauds Mamdani at White House",
    "description": "While Gothamist's characterization of Friday's White House meeting between President Donald Trump and New York City Mayor-elect Zohran Mamdani as \"a surprising bromance\" was likely an overstretch, the far-right US leader did offer copious praise for the democ…",
    "link": "https://www.commondreams.org/news/trump-meets-mamdani",
    "timestamp": "2025-11-22T00:34:07Z"
  },
  {
    "title": "Trump and Mamdani meet at White House in cordial encounter: 7 key takeaways",
    "description": "For Mamdani, the first meeting with the US president in the Oval Office offered a chance to emphasise his campaign themes, particularly affordability and cost-of-living issues.",
    "link": "https://indianexpress.com/article/world/trump-mamdani-meeting-white-house-7-key-takeaways-10379387/",
    "timestamp": "2025-11-22T00:32:16Z"
  },
  {
    "title": "‘Just say yes’: Trump cuts in as NYC mayor-elect Mamdani dodges on calling him a ‘fascist’ at Oval Office",
    "description": "Democratic socialist NYC mayor-elect navigates awkward Oval Office moment as Trump jokes about being called 'fascist' during cooperation talks.",
    "link": "https://www.foxnews.com/politics/just-say-yes-trump-cuts-nyc-mayor-elect-mamdani-dodges-calling-him-fascist-oval-office",
    "timestamp": "2025-11-22T00:31:36Z"
  },
  {
    "title": "Police Unions Send Letter To Congress Urging Opposition To Carry Reciprocity Legislation",
    "description": "Concealed Carry Reciprocity legislation currently under consideration in the U.S. Congress is facing opposition from two large police unions that seemingly want officers to be armed and nobody else. Apparently unaware that all states have laws that allow carr…",
    "link": "https://www.thetruthaboutguns.com/police-unions-oppose-concealed-carry-reciprocity/",
    "timestamp": "2025-11-22T00:30:00Z"
  },
  {
    "title": "Why is Zelenskyy silent on the Trump administration's peace proposal?",
    "description": "Grok Summary of Video Transcript:In short, the draft is widely seen in Kyiv and Europe as a forced settlement that rewards Russian aggression and permanently weakens Ukraine, while Zelensky walks a tightrope: dependent on U.S. support, battered domestically, …",
    "link": "https://freerepublic.com/focus/f-bloggers/4353931/posts",
    "timestamp": "2025-11-22T00:29:13Z"
  },
  {
    "title": "Why is Zelenskyy silent on the Trump administration's peace proposal?",
    "description": "Grok Summary of Video Transcript:In short, the draft is widely seen in Kyiv and Europe as a forced settlement that rewards Russian aggression and permanently weakens Ukraine, while Zelensky walks a tightrope: dependent on U.S. support, battered domestically, …",
    "link": "https://freerepublic.com/focus/f-news/4353931/posts",
    "timestamp": "2025-11-22T00:29:13Z"
  },
  {
    "title": "Anyone expecting a showdown when Trump met Mamdani got a pretty big surprise",
    "description": "Against a backdrop of hate came an outbreak of harmony in the Oval Office - but there's still a danger of political conflict in the future.",
    "link": "https://news.sky.com/story/anyone-expecting-a-showdown-when-trump-met-mamdani-got-a-pretty-big-surprise-13473803",
    "timestamp": "2025-11-22T00:29:00Z"
  },
  {
    "title": "Texas seeks Supreme Court order to use congressional map judges ruled likely racially biased",
    "description": "Texas on Friday asked the Supreme Court for an emergency order to be allowed to use a congressional redistricting plan pushed by President Donald Trump that is favorable to Republicans in the 2026 elections despite a lower court ruling that it likely discrimi…",
    "link": "https://biztoc.com/x/3fc3a2ef4b3702ac",
    "timestamp": "2025-11-22T00:28:52Z"
  },
  {
    "title": "'No one believes you': MAGA diehards accuse FBI head Kash Patel of another huge 'cover up'",
    "description": "FBI Director Kash Patel and Deputy Director Dan Bongino faced a wave of online backlash Friday after giving an exclusive interview to Fox News Digital about the 2024 near assassination of President Donald Trump in Butler, Pennsylvania.According to the report,…",
    "link": "https://www.rawstory.com/kash-patel-2674332799/",
    "timestamp": "2025-11-22T00:28:49Z"
  },
  {
    "title": "Kash Patel and Dan Bongino have lost all credibility. Neither should bet on having a career in the conservative media after their FBI careers are over.",
    "description": "The FBI has concluded that would-be Trump assassin Thomas Crooks acted alone.Thomas Crooks was able to climb on top of a roof next to Trump’s Butler, Pennsylvania rally and put Trump in his scope.A bullet grazed President Trump’s ear on July 13, 2024 during h…",
    "link": "https://freerepublic.com/focus/f-news/4353930/posts",
    "timestamp": "2025-11-22T00:28:34Z"
  },
  {
    "title": "Trump reveals 'one thing in common' he has with Mamdani after Oval Office love fest",
    "description": "President Donald Trump sat down with New York City Mayor-elect Zohran Mamdani in the Oval Office Friday, marking the first time the socialist politician whom the administration has labeled a \"communist\" met with the MAGA chief. The pair found unity during the…",
    "link": "https://freerepublic.com/focus/f-news/4353926/posts",
    "timestamp": "2025-11-22T00:25:04Z"
  },
  {
    "title": "Ex-envoy urges Tinubu to tackle insecurity",
    "description": "A former ambassador urges President Tinubu to tackle insecurity, fulfilling his inaugural promise amid rising threats and advocating for security reform.\n\nRead More: https://punchng.com/ex-envoy-urges-tinubu-to-tackle-insecurity/",
    "link": "https://punchng.com/ex-envoy-urges-tinubu-to-tackle-insecurity/",
    "timestamp": "2025-11-22T00:24:40Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Exalts Mamdani Calling a Jovial Trump Fascist to His Face: ‘Amazing Moment in Politics’",
    "description": "\"That's OK. You can just say yes,\" the president told NYC's mayor-elect on Friday\nThe post CNN’s Kaitlan Collins Exalts Mamdani Calling a Jovial Trump Fascist to His Face: ‘Amazing Moment in Politics’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/mamdani-trump-fascist-kaitlan-collins-reaction/",
    "timestamp": "2025-11-22T00:23:53Z"
  },
  {
    "title": "Trump FDA Official Warns Recent Changes at Agency Risk Public Health: Report",
    "description": "Per reporting from The Washington Post on Friday, Dr. Richard Pazdur, a longtime FDA official whom President Donald Trump’s administration recently appointed to be the nation’s top drug regulator, has warned that several fast-tracked initiatives to overhaul d…",
    "link": "https://www.mediaite.com/media/news/trump-fda-official-warns-recent-changes-at-agency-risk-public-health-report/",
    "timestamp": "2025-11-22T00:23:29Z"
  },
  {
    "title": "Trump Declares, ‘It Was a Great Honor Meeting Zohran Mamdani’",
    "description": "President Donald Trump followed up his Oval Office lovefest with New York Mayor-Elect Zohran Mamdani with a post stating that he was honored to meet the 34-year-old political upstart.\nThe post Trump Declares, ‘It Was a Great Honor Meeting Zohran Mamdani’  fir…",
    "link": "https://www.mediaite.com/politics/trump-declares-it-was-a-great-honor-meeting-zohran-mamdani/",
    "timestamp": "2025-11-22T00:20:49Z"
  },
  {
    "title": "Takeaways from Trump and Mamdani visit: Both men get something they want, GOP loses a punching bag",
    "description": "Republicans hoped to make Mamdani a poster boy for Democratic party excess and radicalism.",
    "link": "https://www.bostonherald.com/2025/11/21/trump-mamdani-takeaways/",
    "timestamp": "2025-11-22T00:20:06Z"
  },
  {
    "title": "Social Media Erupts Over Trump Telling Mamdani It's OK To Call Him The 'F' Word",
    "description": "One social media user joked that the president \"literally likes Zohran more than his own sons.\"",
    "link": "https://www.huffpost.com/entry/social-media-trump-zohran-mamdani-meeting_n_6920dfa8e4b0d31c0a7a503d",
    "timestamp": "2025-11-22T00:18:56Z"
  },
  {
    "title": "Texas seeks Supreme Court order to use congressional map judges ruled likely racially biased",
    "description": "Texas on Friday asked the Supreme Court for an emergency order to be allowed to use a congressional redistricting plan pushed by President Donald Trump that is favorable to Republicans in the 2026 elections despite a lower court ruling that it likely discrimi…",
    "link": "https://www.pbs.org/newshour/politics/texas-seeks-supreme-court-order-to-use-congressional-map-judges-ruled-likely-racially-biased",
    "timestamp": "2025-11-22T00:16:43Z"
  },
  {
    "title": "Is this photo of Trump wearing a bathrobe across bed real?",
    "description": "Users reposted the picture amid the president's signing of a bill to release case files related to the late convicted sex offender Jeffrey Epstein.",
    "link": "https://www.snopes.com//fact-check/trump-photo-bathrobe-bed/",
    "timestamp": "2025-11-22T00:16:00Z"
  },
  {
    "title": "Putin envoy Dmitriev: Peace plan seeks to end Ukraine losses of land, lives",
    "description": "(Reuters) -Russian President Vladimir Putin's investment envoy, Kirill Dmitriev, said on Friday the U.S. plan for a settlement of the war in Ukraine was aimed at preventing more Ukrainian deaths and loss of territory. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/22/putin-envoy-dmitriev-peace-plan-seeks-to-end-ukraine-losses-of-land-lives",
    "timestamp": "2025-11-22T00:15:00Z"
  },
  {
    "title": "S&P 500, NASDAQ and Dow futures show big gains after Wall Street ended volatile week on a high with AI stocks dictating things; here’s how key indices performed",
    "description": "US stock futures recorded gains on Friday after Wall Street closed higher. Futures for the S&P 500, Dow, and NASDAQ also showed significant gains. After witnessing multiple fluctuations on Friday morning, the S&P 500 took off and rallied nearly 2% before fini…",
    "link": "https://economictimes.indiatimes.com/news/international/us/sp-500-nasdaq-and-dow-futures-show-big-gains-after-wall-street-ended-volatile-week-on-a-high-with-ai-stocks-dictating-things-heres-how-key-indices-performed/articleshow/125497405.cms",
    "timestamp": "2025-11-22T00:14:47Z"
  },
  {
    "title": "Texas seeks Supreme Court order to use a congressional map judges held is likely racially biased",
    "description": "The state called on the high court to intervene to avoid confusion.",
    "link": "https://www.bostonherald.com/2025/11/21/election-2026-redistricting-texas-scotus/",
    "timestamp": "2025-11-22T00:13:52Z"
  },
  {
    "title": "Putin, Zelenskyy respond to Trump's peace plan",
    "description": "As President Donald Trump pushes Ukraine and Russia to commit to a peace deal before Thanksgiving, both leaders suggested they would engage on it but signaled doubts it could succeed.Ukraine's President Volodymyr Zelenskyy warned his country may face a diffic…",
    "link": "https://freerepublic.com/focus/f-news/4353920/posts",
    "timestamp": "2025-11-22T00:09:48Z"
  },
  {
    "title": "Will Trump's no-show eclipse South Africa's G20 moment?",
    "description": "The host nation's goal of advocating for developing nations may be overshadowed by the absence of the US president.",
    "link": "https://www.bbc.com/news/articles/c20508y7w5yo",
    "timestamp": "2025-11-22T00:09:48Z"
  },
  {
    "title": "Trump and Mamdani’s White House Lovefest Leaves Trump Allies “Shocked,” Says Source",
    "description": "According to one former Trump official, the president “sincerely wants NYC to succeed and that means Mamdani has to as well.”",
    "link": "https://www.vanityfair.com/news/story/mamdanis-white-house-lovefest-leaves-trump-allies-shocked",
    "timestamp": "2025-11-22T00:08:12Z"
  },
  {
    "title": "Raskin: Congressional Republicans and Trump 'Moving in Completely Opposite Directions'",
    "description": "Friday on CNN's \"The Arena,\" Rep. Jamie Raskin (D-MD) said President Donald Trump and Republican lawmakers were \"moving in completely opposite directions.\"\nThe post Raskin: Congressional Republicans and Trump ‘Moving in Completely Opposite Directions’ appeare…",
    "link": "https://www.breitbart.com/clips/2025/11/21/raskin-congressional-republicans-and-trump-moving-in-completely-opposite-directions/",
    "timestamp": "2025-11-22T00:06:21Z"
  },
  {
    "title": "Mamdani Charms Trump in DC: NYC Federal Funding Threat Vanishes After Bizarre Meeting",
    "description": "As Zohran Mamdani takes power in New York, Trump's funding threats give way to a wary White House embrace, leaving residents to wonder what the socialist label will mean for their city's future.",
    "link": "https://www.ibtimes.com/mamdani-charms-trump-dc-nyc-federal-funding-threat-vanishes-after-bizarre-meeting-3790954",
    "timestamp": "2025-11-22T00:02:56Z"
  },
  {
    "title": "Trump-Mamdani — the start of a beautiful friendship?",
    "description": "President Donald Trump and Mayor-elect Zohran Mamdani staged a total love-fest Friday afternoon, and good for them — and especially good for New York.",
    "link": "https://nypost.com/2025/11/21/opinion/trump-mamdani-the-start-of-a-beautiful-friendship/",
    "timestamp": "2025-11-22T00:00:56Z"
  },
  {
    "title": "‘CPC designation a wake-up call for Nigeria’",
    "description": "Nigeria’s redesignation as a Country of Particular Concern (CPC) is a wake-up call for national reform, accountability, and inclusive security.\n\nRead More: https://punchng.com/cpc-designation-a-wake-up-call-for-nigeria/",
    "link": "https://punchng.com/cpc-designation-a-wake-up-call-for-nigeria/",
    "timestamp": "2025-11-22T00:00:44Z"
  },
  {
    "title": "Gun Rights Group Blasts Bondi for ‘Ultimate Betrayal’ of 2nd Am. for Making Argument That Could Ban ‘EVERY HANDGUN IN AMERICA’",
    "description": "Gun Owners of America lambasted Attorney General Pam Bondi on its social media accounts for a legal arguments her office made in a recent pleading, accusing the Trump administration of the \"ultimate betrayal\" of the Second Amendment.\nThe post Gun Rights Group…",
    "link": "https://www.mediaite.com/media/news/gun-rights-group-blasts-bondi-for-ultimate-betrayal-of-2nd-am-for-making-argument-that-could-ban-every-handgun-in-america/",
    "timestamp": "2025-11-21T23:59:02Z"
  },
  {
    "title": "Jack Posobiec Grills Socialist Zohran Mamdani About Plan to Raise Property Taxes on White People",
    "description": "Conservative journalist and political commentator Jack Posobiec grilled New York City Mayor-elect Zohran Mamdani about his plan to hike property taxes on the rich and white communities in the city.\nThe post Jack Posobiec Grills Socialist Zohran Mamdani About …",
    "link": "https://www.breitbart.com/politics/2025/11/21/jack-posobiec-grills-socialist-zohran-mamdani-about-plan-to-raise-property-taxes-on-white-people/",
    "timestamp": "2025-11-21T23:58:28Z"
  },
  {
    "title": "George Clooney Charms Londoners With Comedic Jabs at Brad Pitt, Donald Trump and Himself: ‘Ocean’s 14’ Will Be Like ‘The Golden Girls’",
    "description": "George Clooney had an enraptured London crowd in stitches Friday, taking comedic jabs at President Trump and Brad Pitt, while also sharing the devastating put-down he received from his son recently. Clooney, whose latest film “Jay Kelly” was released in theat…",
    "link": "https://variety.com/2025/film/global/george-clooney-londoners-brad-pitt-donald-trump-oceans-14-1236588894/",
    "timestamp": "2025-11-21T23:57:42Z"
  },
  {
    "title": "Trump, Mamdani Align on Affordability in Oval Office Meeting",
    "description": "President Donald Trump said he wants to see Zohran Mamdani succeed, saying after a highly anticipated sitdown that he’d “feel very comfortable” living in a New York run by the mayor-elect and that he doesn’t anticipate cutting off funding for the country’s mo…",
    "link": "https://biztoc.com/x/d347184c1c30d658",
    "timestamp": "2025-11-21T23:55:28Z"
  },
  {
    "title": "Ukraine envoy Keith Kellogg ‘quits’ after plan for US peace leaked",
    "description": "Donald Trump’s Ukraine envoy Lt Gen Keith Kellogg is leaving the role, it has emerged hours after a US plan to end the war leaked.Lt Gen Kellogg, 81, is expected to step down as US special envoy in January in a departure that will deal a hammer blow to Kyiv’s…",
    "link": "https://freerepublic.com/focus/f-news/4353919/posts",
    "timestamp": "2025-11-21T23:54:54Z"
  },
  {
    "title": "BBC Board Member Resigns Amid Fallout From Broadcaster Editing Trump Speech",
    "description": "The tech investor cited \"governance issues\" at the British broadcaster in his resignation.",
    "link": "https://www.huffpost.com/entry/bbc-board-resignation-trump_n_6920be5ce4b0536e01aced0b",
    "timestamp": "2025-11-21T23:54:50Z"
  },
  {
    "title": "House Bill Would Allow Bitcoin Payments for Federal Taxes",
    "description": "A bill introduced Thursday (Nov. 20) in the U.S. House would allow Americans to use Bitcoin to pay federal taxes and would direct those payments into the Strategic Bitcoin Reserve. The Bitcoin for America Act (H.R. 6180) was introduced by Rep. Warren Davidson…",
    "link": "https://www.pymnts.com/blockchain/bitcoin/2025/house-bill-would-allow-bitcoin-payments-for-federal-taxes/",
    "timestamp": "2025-11-21T23:54:47Z"
  },
  {
    "title": "G20 Summit to Begin in South Africa with Poor Attendance and Little Fanfare",
    "description": "South Africa has been preparing for a disappointing Group of 20 (G20) summit in Johannesburg this weekend that would be missing the leaders of the United States, China, Russia, Argentina, and Mexico — although President Cyril Ramaphosa claimed on Thursday tha…",
    "link": "https://www.breitbart.com/africa/2025/11/21/g20-summit-to-begin-in-south-africa-with-poor-attendance-and-little-fanfare/",
    "timestamp": "2025-11-21T23:52:56Z"
  },
  {
    "title": "'I'll be cheering for him': Takeaways from Trump and Mamdani's surprisingly cordial meeting",
    "description": "It was billed as potentially the political showdown of the year. Instead, both men gave one another praise.",
    "link": "https://www.bbc.com/news/articles/cvgqd42gl0qo",
    "timestamp": "2025-11-21T23:52:51Z"
  },
  {
    "title": "Fake AI Trump audio clip on ‘Epstein files’ gains traction",
    "description": "Left-leaning social media users have amplified an AI-generated audio clip purporting to show Trump screaming at US officials to block the release of documents\nThe post Fake AI Trump audio clip on ‘Epstein files’ gains traction appeared first on Digital Journa…",
    "link": "https://www.digitaljournal.com/social-media/fake-ai-trump-audio-clip-on-epstein-files-gains-traction/article",
    "timestamp": "2025-11-21T23:52:49Z"
  },
  {
    "title": "Trump pivots from bashing Mamdani, predicting he will 'do a great job' as mayor (Natalie Allison/Washington Post)",
    "description": "Natalie Allison / Washington Post:\nTrump pivots from bashing Mamdani, predicting he will ‘do a great job’ as mayor  —  Trump warmed to Mamdani, even declaring he would finally feel comfortable moving back to the city with the 34-year-old democratic socialist …",
    "link": "https://www.memeorandum.com/251121/p119",
    "timestamp": "2025-11-21T23:50:00Z"
  },
  {
    "title": "Trump-Mamdani meeting marked by surprising moments of praise",
    "description": "President Trump and NYC Mayor-elect Zohran Mamdani have hurled attacks at each other for months — but on Friday, they seemed to hit it off.",
    "link": "https://www.cbsnews.com/news/trump-mamdani-biggest-points-of-praise-oval-office-meeting-white-house/",
    "timestamp": "2025-11-21T23:49:00Z"
  },
  {
    "title": "Pinocchio: Prosecutor releases ‘damning’ evidence against Tish James",
    "description": "Accused of mortgage fraud for lying about residents in property",
    "link": "https://www.wnd.com/2025/11/pinocchio-prosecutor-releases-damning-evidence-against-tish-james/",
    "timestamp": "2025-11-21T23:48:58Z"
  },
  {
    "title": "Straight Nonsense: Back off from the Met Gala, Bezos",
    "description": "Opinion: Tasteless duds Jeff Bezos and Lauren Sanchez need to keep their grubby hands off of cultural institutions.",
    "link": "https://www.out.com/voices/straight-nonsense-jeff-bezos-lauren-sanchez",
    "timestamp": "2025-11-21T23:46:34Z"
  },
  {
    "title": "Zelenskyy faces pressure from Trump to accept his Ukraine peace plan",
    "description": "President Trump said he’d like to see Ukraine accept his peace plan by Thursday of next week. But the plan asks Ukraine to make concessions it's previously rejected, and President Zelenskyy said his country has to decide whether to lose a major partner, or lo…",
    "link": "https://www.pbs.org/newshour/show/zelenskyy-faces-pressure-from-trump-to-accept-his-ukraine-peace-plan",
    "timestamp": "2025-11-21T23:45:04Z"
  },
  {
    "title": "The White House has asked for the resignation of a top aide to FDA chief",
    "description": "The White House has asked for the resignation of a top aide to FDA chief\nCommissioner Marty Makary is pushing back on the demand, officials told POLITICO, in the latest development to roil the agency\nFood and Drug Administration Commissioner Marty Makary spea…",
    "link": "https://biztoc.com/x/2043ef5e3ba396ea",
    "timestamp": "2025-11-21T23:44:14Z"
  },
  {
    "title": "Raskin: Trump's 'Threats of Assassination' of Lawmakers Is an 'Impeachable Offense'",
    "description": "Friday on CNN's \"The Arena,\" Rep. Jamie Raskin (D-MD) said President Donald Trump committed an \"impeachable offense\" with his response to a video featuring Democratic lawmakers telling military members about refusing illegal orders.\nThe post Raskin: Trump’s ‘…",
    "link": "https://www.breitbart.com/clips/2025/11/21/raskin-trumps-threats-of-assassination-of-lawmakers-is-an-impeachable-offense/",
    "timestamp": "2025-11-21T23:44:07Z"
  },
  {
    "title": "Border Patrol’s Chaotic Week in North Carolina",
    "description": "Agents swept in and left residents to sort through fear, fact, and fiction.",
    "link": "https://www.theatlantic.com/newsletters/2025/11/border-patrol-durham-north-carolina-immigration-crackdown/685027/",
    "timestamp": "2025-11-21T23:41:00Z"
  },
  {
    "title": "EXCLUSIVE: Jeffrey Epstein Was 'Confident' He Would Get a Presidential Pardon From Trump — and Lashed Out Behind Bars With 'Threats' When He Was Denied Freedom, Famed Author Claims",
    "description": "Jeffrey Epstein and Donald Trump were once good friends who ran in elite Manhattan social circles, but all that came crumbling down.",
    "link": "https://radaronline.com/p/jeffrey-epstein-pardon-president-trump/",
    "timestamp": "2025-11-21T23:40:00Z"
  },
  {
    "title": "Friday, November 21. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,367.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/11/21/friday-november-21-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-11-21T23:39:02Z"
  },
  {
    "title": "A DMZ for Ukraine",
    "description": "Trump’s peace plan envisages a divide like the one that splits the Korean peninsula.",
    "link": "https://www.theatlantic.com/national-security/2025/11/dmz-ukraine-russia-trump-korea/685020/",
    "timestamp": "2025-11-21T23:37:00Z"
  },
  {
    "title": "What Boys Learn When Powerful Men Face No Consequences",
    "description": "For decades, Donald Trump has modeled a version of masculinity rooted in entitlement, impunity and the casual degradation of women—and he has done so from one of the most visible platforms on Earth. That visibility matters. When the most powerful man in the c…",
    "link": "https://msmagazine.com/2025/11/21/boys-men-learn-trump-epstein-abuse-women-violence-masculinity/",
    "timestamp": "2025-11-21T23:35:45Z"
  },
  {
    "title": "Trump, Mamdani promise to work to help NYC and tackle affordability in cordial meeting - ABC News",
    "description": "Trump, Mamdani promise to work to help NYC and tackle affordability in cordial meetingABC News Trump, Mamdani make love — not warPolitico Just Two Guys From QueensThe New York Times NYC Mayor-elect Zohran Mamdani meets with President Donald Trump in Oval Offi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180173249",
    "timestamp": "2025-11-21T23:33:18Z"
  },
  {
    "title": "Trump, Mamdani Speak After Oval Office Meeting",
    "description": "President Donald Trump said he wants to see Zohran Mamdani succeed, saying after a highly anticipated sitdown that he’d “feel very comfortable” living in a New York run by the mayor-elect and that he doesn’t anticipate cutting off funding for the country’s mo…",
    "link": "https://biztoc.com/x/814791dfbdc06fdd",
    "timestamp": "2025-11-21T23:33:06Z"
  },
  {
    "title": "Lib Columnist Melts Down Hearing National Anthem In Nation’s Capital",
    "description": "A liberal columnist complained Thursday about hearing the American national anthem play in the nation's capital, Washington, D.C.",
    "link": "https://dailycaller.com/2025/11/21/lib-columnist-melts-down-hearing-national-anthem-in-nations-capital/",
    "timestamp": "2025-11-21T23:32:53Z"
  }
]