[
  {
    "title": "Oil pulls back as U.S.–Iran talks set to resume: Here’s where negotiations stand",
    "description": "Tensions have remained on high alert throughout the Middle East for weeks after U.S. President Donald Trump indicated a strike on Iran could be imminent.",
    "link": "https://www.cnbc.com/2026/02/23/iran-us-talks-oil-falls-nuclear-negotiations.html",
    "timestamp": "2026-02-23T11:48:11Z"
  },
  {
    "title": "DHS spokeswoman Tricia McLaughlin’s replacement is even worse",
    "description": "Kristi Noem isn’t shaking up DHS, she’s doubling down on violence and propaganda",
    "link": "https://www.salon.com/2026/02/23/dhs-spokeswoman-tricia-mclaughlins-replacement-is-even-worse/",
    "timestamp": "2026-02-23T11:45:54Z"
  },
  {
    "title": "Singapore may lose slight competitive edge under new 15% US tariffs, but analysts say it remains resilient",
    "description": "Singapore offers a “certainty premium” backed by institutional stability and fiscal strength, observers say.",
    "link": "https://www.channelnewsasia.com/singapore/us-tariffs-asean-exports-markets-economy-growth-5946966",
    "timestamp": "2026-02-23T11:45:51Z"
  },
  {
    "title": "‘A check on his power’: Trump weakened but not deterred after tariff ruling, say analysts",
    "description": "The US Supreme Court may have imposed a legal check on Donald Trump’s presidential power, but for global businesses and governments, the era of tariff turbulence is far from over, say experts.",
    "link": "https://www.channelnewsasia.com/asia/usa-donald-trump-traiffs-supreme-court-trade-uncertainty-analysts-5947051",
    "timestamp": "2026-02-23T11:42:36Z"
  },
  {
    "title": "‘A check on his power’: Trump weakened but not deterred after tariff ruling, say analysts",
    "description": "<![CDATA[ The US Supreme Court may have imposed a legal check on Donald Trump’s presidential power, but for global businesses and governments, the era of tariff turbulence is far from over, say experts.  ]]>",
    "link": "https://www.channelnewsasia.com/asia/trump-tariffs-supreme-court-trade-uncertainty-analysts-5947051",
    "timestamp": "2026-02-23T11:42:00Z"
  },
  {
    "title": "Iran says ready for talks but will defend itself against US aggression",
    "description": "Remarks from Ministry of Foreign Affairs come after Trump says he is considering an attack if nuclear deal not reached.",
    "link": "https://www.aljazeera.com/news/2026/2/23/iran-says-ready-for-talks-but-will-defend-itself-against-us-aggression",
    "timestamp": "2026-02-23T11:40:38Z"
  },
  {
    "title": "Bitcoin treasury firms log rare selling streak as BTC trades near $66K",
    "description": "Continued selling from treasury companies and US Bitcoin ETFs threatens a deeper retracement for BTC, but analysts see it as a sign of a healthy flush in speculative leverage.",
    "link": "https://cointelegraph.com/news/bitcoin-treasury-selling-streak-btc-66-000",
    "timestamp": "2026-02-23T11:38:21Z"
  },
  {
    "title": "JPMorgan Chase Closed Trump Accounts After Capitol Riot, Court Filing Reveals",
    "description": "JPMorgan Chase admits it closed Donald Trump's accounts after Jan. 6 as he pursues a $5 billion lawsuit alleging political discrimination.",
    "link": "https://www.ibtimes.com.au/jpmorgan-chase-closed-trump-accounts-after-capitol-riot-court-filing-reveals-1861906",
    "timestamp": "2026-02-23T11:32:11Z"
  },
  {
    "title": "EU Pushes Back on US Tariff Moves Following Supreme Court Decision",
    "description": "The EU urges the U.S. to honor their trade deal after new tariffs were introduced following a Supreme Court ruling.",
    "link": "https://www.ibtimes.com.au/eu-pushes-back-us-tariff-moves-following-supreme-court-decision-1861904",
    "timestamp": "2026-02-23T11:31:10Z"
  },
  {
    "title": "Bitcoin stabilizes after overnight crypto rout, bouncing to $66,000",
    "description": "Bitcoin fell to $64,270 shortly after midnight UTC before rebounding to $66,300, as thin liquidity amplified moves tied to fresh U.S. tariff plans and geopolitical tensions.",
    "link": "https://www.coindesk.com/markets/2026/02/23/overnight-crypto-rout-reverses-bitcoin-rebounds-to-usd66-300",
    "timestamp": "2026-02-23T11:30:00Z"
  },
  {
    "title": "EU to suspend trade deal with US after supreme court ruled Trump's tariffs unlawful",
    "description": "The parliament’s trade committee had been due to give its green light tomorrow.",
    "link": "https://www.thejournal.ie/eu-to-suspend-trade-deal-with-us-after-supreme-court-ruled-trumps-tariffs-unlawful-6965050-Feb2026/",
    "timestamp": "2026-02-23T11:28:03Z"
  },
  {
    "title": "Evaluating the Trump Administration's New Most Favored Nation (MFN) Medicaid GENEROUS Model",
    "description": "The implementation of the Most Favored Nation (MFN) pricing and the introduction of the GENEROUS model in U.S. Medicaid present opportunities for pharmaceutical companies to align with international reference pricing strategies, potentially expanding market a…",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242441/28124/en/Evaluating-the-Trump-Administration-s-New-Most-Favored-Nation-MFN-Medicaid-GENEROUS-Model.html",
    "timestamp": "2026-02-23T11:27:00Z"
  },
  {
    "title": "$100 Oil Price Forecasts Resurface Amid U.S.-Iran Standoff",
    "description": "Oil price spikes to $90-$100 per barrel are “within reach” as the United States and Iran appear close to war, Fereidun Fesharaki, Chairman Emeritus at energy market consultancy FGE NexantECA, told Bloomberg Television on Monday. “I don’t think the US has a ch…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/100-Oil-Price-Forecasts-Resurface-Amid-US-Iran-Standoff.html",
    "timestamp": "2026-02-23T11:26:39Z"
  },
  {
    "title": "Ted Sarandos Pushes Back On Trump’s Call For Netflix To Fire Board Member Susan Rice: “He Likes To Do A Lot Of Things On Social Media”",
    "description": "Ted Sarandos attempted to playdown Donald Trump’s fiery request over the weekend for Netflix to fire board member Susan Rice, when questioned on the social media outburst in an interview on the BBC’s Today program on Monday. The Netflix co-CEO was asked about…",
    "link": "http://deadline.com/2026/02/ted-sarandos-trumps-netflix-susan-rice-1236732988/",
    "timestamp": "2026-02-23T11:25:14Z"
  },
  {
    "title": "JPMorgan admits closing accounts linked to Donald Trump",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_37c7e3a1-8d09-4fd6-80cd-b81d11a0efff",
    "timestamp": "2026-02-23T11:21:11Z"
  },
  {
    "title": "India-US trade deal: Why a ‘modify commitments’ clause in framework agreement offers New Delhi wriggle room",
    "description": "As US President Donald Trump says that the bilateral deal is on, this clause could now provide some much-needed space for India to recalibrate tariff and non-tariff concessions from its side.",
    "link": "https://indianexpress.com/article/explained/explained-economics/india-us-trade-deal-modify-commitments-clause-10547517/",
    "timestamp": "2026-02-23T11:16:20Z"
  },
  {
    "title": "Stocks sell off as traders wake up to the realization that Trump has ‘highly punitive’ options for new trade tariffs",
    "description": "Some of the things Trump might do next could be more extreme than his “Liberation Day” tariffs, and will certainly be more complex.",
    "link": "https://finance.yahoo.com/news/stocks-sell-off-traders-wake-111342816.html",
    "timestamp": "2026-02-23T11:13:42Z"
  },
  {
    "title": "US Market | Wall Street futures dip as tariff doubts hit risk appetite",
    "description": "U.S. stock index futures slipped on Monday as renewed ​tariff uncertainty unnerved investors after President Donald Trump announced a new 15% duty despite a Supreme Court ruling that struck down his broader levies.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-market-wall-street-futures-dip-as-tariff-doubts-hit-risk-appetite/articleshow/128711181.cms",
    "timestamp": "2026-02-23T11:13:11Z"
  },
  {
    "title": "US Market Today | All eyes on big tech earnings as AI anxiety and tariff turmoil keep investors on edge",
    "description": "Investors brace for a pivotal week, with Nvidia's earnings at the forefront, seeking AI reassurance amid trade policy shifts.  Tech stocks face scrutiny, while energy and industrials offer support.  Global markets, including India's IT sector, keenly await si…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-market-today-all-eyes-on-big-tech-earnings-as-ai-anxiety-and-tariff-turmoil-keep-investors-on-edge/articleshow/128711069.cms",
    "timestamp": "2026-02-23T11:07:59Z"
  },
  {
    "title": "Kristi Noem Repeatedly Claimed ICE Deported a Cannibal. It Was “Completely Made Up.”",
    "description": "Law enforcement sources told The Intercept that Noem’s tale about a cannibal was a fabrication.\nThe post Kristi Noem Repeatedly Claimed ICE Deported a Cannibal. It Was “Completely Made Up.” appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/02/23/kristi-noem-ice-cannibal/",
    "timestamp": "2026-02-23T11:07:00Z"
  },
  {
    "title": "Why are gold and silver prices rising again and will precious metals continue dream run or fall back sharply? Gold and silver rise, analysts insights and market outlook explained. Here's what should investors do now",
    "description": "Why are gold and silver prices rising again and will precious metals continue dream run or fall back sharply? Gold reached a three-week high after tariff changes, inflation data, and dollar weakness. Silver also gained. Investors shifted to precious metals du…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-are-gold-and-silver-prices-rising-again-and-will-precious-metals-continue-dream-run-or-fall-back-sharply-gold-and-silver-rise-analysts-insights-and-market-outlook-explained-heres-what-should-investors-do-now/articleshow/128710311.cms",
    "timestamp": "2026-02-23T11:05:53Z"
  },
  {
    "title": "India delays trade talks with US after Supreme Court ruling on tariffs – Reuters",
    "description": "The decision has reportedly come after the Supreme Court shut down Donald Trump’s tariffs imposed on various US trading partners Read Full Article at RT.com",
    "link": "https://www.rt.com/india/632925-india-trading-trump-tariffs/",
    "timestamp": "2026-02-23T11:02:19Z"
  },
  {
    "title": "The Payphone That Lets San Franciscans ‘Call a Republican’",
    "description": "Two pay phones, in San Francisco and Abilene, Texas, aimed to connect Americans across political divides.",
    "link": "https://www.kqed.org/news/12074002/the-payphone-that-lets-san-franciscans-call-a-republican",
    "timestamp": "2026-02-23T11:00:41Z"
  },
  {
    "title": "The Real State of the Union: Millions of\nAmericans Are Just Disgusted",
    "description": "This Tuesday night, America will bear witness to Donald Trump’s first State of the Union address of his second term. I know—the mere thought of it rots a little piece of our souls that we’re never getting back. At least you can skip it; I have to watch it. Wh…",
    "link": "https://newrepublic.com/article/206888/trump-state-union-failure-economy",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "James Talarico Puts His Faith in Texas Voters",
    "description": "The Senate candidate believes that Democrats can win in Texas by appealing to higher values. Will a politics “based on love” succeed in the age of Trump? Tad Friend reports on the G.O.P. primary race between John Cornyn and Ken Paxton, and on the primary cont…",
    "link": "https://www.newyorker.com/magazine/2026/03/02/james-talarico-profile",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "Jan Staller, Constructor of Image",
    "description": "The photographer shoots the bolts and beams of building sites. His latest subject? The Gateway tunnel project being targeted by Donald Trump, Nick Paumgarten reports.",
    "link": "https://www.newyorker.com/magazine/2026/03/02/jan-staller-constructor-of-image",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "Did Trump make over 4K wire transfers to Epstein totaling $1B? Claim doesn't add up",
    "description": "U.S. President Donald Trump made 4,725 wire transfers to the late, disgraced financier and convicted sex offender Jeffrey Epstein for a total of $1.1 billion.",
    "link": "https://www.snopes.com//fact-check/trump-money-transfers-epstein/",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "The Supreme Court’s Complicated Takedown of Trump’s Tariffs",
    "description": "The Supreme Court struck down President Donald Trump’s latest tariffs, but the ruling lacks full consensus on its reasoning or implications, Amy Davidson Sorkin writes.",
    "link": "https://www.newyorker.com/news/the-lede/the-supreme-courts-complicated-takedown-of-trumps-tariffs",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "German business morale sees biggest rise in nearly a year",
    "description": "German business morale posted its biggest rise in almost a year in February, data showed Monday, boosting hopes that Europe's top economy could be emerging from the worst of its slump.",
    "link": "https://www.thelocal.de/20260223/german-business-morale-sees-biggest-rise-in-nearly-a-year",
    "timestamp": "2026-02-23T10:58:34Z"
  },
  {
    "title": "'Staring down the barrel at higher costs': UK businesses face uncertain future over US tariffs",
    "description": "The UK has not ruled out retaliatory tariffs against the US, while the EU has put on hold the ratification of its trade deal with Washington.",
    "link": "https://news.sky.com/story/staring-down-the-barrel-at-higher-costs-uk-businesses-face-uncertain-future-over-us-tariffs-13511105",
    "timestamp": "2026-02-23T10:54:00Z"
  },
  {
    "title": "US tariff shuffle spins Indian exports into a trade puzzle",
    "description": "Indian exporters now face a temporary 10 percent tariff on shipments to the US for the next 150 days. This decision comes in response to a Supreme Court ruling that overturned previous tariff structures. Meanwhile, President Trump has hinted at a possible hik…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indian-exports-trump-modi-us-tariff-10-percent-trade-uncertainty-footwear-leather-seafood/articleshow/128709979.cms",
    "timestamp": "2026-02-23T10:53:11Z"
  },
  {
    "title": "EU says US must honor a trade deal after court blocks Trump tariffs",
    "description": "The European Union’s executive arm requested “full clarity” from the United States and asked its trade partner to fulfill its commitments after the U.S. Supreme Court struck down some of President Donald Trump’s most sweeping tariffs. Trump has lashed out at …",
    "link": "https://freerepublic.com/focus/f-backroom/4367958/posts",
    "timestamp": "2026-02-23T10:52:28Z"
  },
  {
    "title": "All we know about 21-year-old shot at Donald Trump’s Mar-a-Lago residence",
    "description": "A 21-year-old was shot and killed in a Mar-a-Lago shooting after attempting to breach the perimeter. Here’s everything we know about the incident.\n\nRead More: https://punchng.com/all-we-know-about-21-year-old-shot-at-donald-trumps-mar-a-lago-residence/",
    "link": "https://punchng.com/all-we-know-about-21-year-old-shot-at-donald-trumps-mar-a-lago-residence/",
    "timestamp": "2026-02-23T10:51:57Z"
  },
  {
    "title": "Analysts Examine What Tariff Decision Means for Oil",
    "description": "'The stick is now the same size for everyone', Rystad Chief Economist Claudio Galimberti warned.",
    "link": "https://www.rigzone.com/news/analysts_examine_what_tariff_decision_means_for_oil-23-feb-2026-183043-article/",
    "timestamp": "2026-02-23T10:47:41Z"
  },
  {
    "title": "Gold Rises as Trump Tariff Defeat Throws Trade Deals Into Doubt",
    "description": "President Donald Trump said Saturday he would impose a global tariff of 15% to preserve measures after the Supreme Court ruled against his use of emergency...",
    "link": "https://finance.yahoo.com/news/gold-rises-trump-tariff-defeat-030341452.html",
    "timestamp": "2026-02-23T10:47:31Z"
  },
  {
    "title": "Australia to Get Its First Trump Tower, Will Be Country's Tallest Building",
    "description": "Australia will soon have its first Trump Tower after plans for the $1.5 billion Australian dollar project are set to go ahead, local outlets reported on Monday.\nThe post Australia to Get Its First Trump Tower, Will Be Country’s Tallest Building appeared first…",
    "link": "https://www.breitbart.com/europe/2026/02/23/australia-to-get-its-first-trump-tower-will-be-countrys-tallest-building/",
    "timestamp": "2026-02-23T10:43:22Z"
  },
  {
    "title": "Decoding Section 122: The rarely used law behind Donald Trump’s new 15% global tariffs",
    "description": "President Trump has utilized a decades-old law, Section 122 of the Trade Act of 1974, to impose up to 15% import tariffs. This provision allows for temporary surcharges on goods, bypassing lengthy trade processes. However, these tariffs are subject to a 150-d…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/decoding-section-122-the-rarely-used-law-behind-donald-trumps-new-15-global-tariffs/articleshow/128709631.cms",
    "timestamp": "2026-02-23T10:41:59Z"
  },
  {
    "title": "Indian exports to attract 10% tariff in US for 150 days from Feb 24; uncertainty persists",
    "description": "Following a Supreme Court verdict against his earlier sweeping tariffs last week, Trump on February 21 imposed a 10 per cent tariff on all countries, including India, from February 24 for 150 days",
    "link": "https://www.thehindubusinessline.com/news/indian-exports-to-attract-10-tariff-in-us-for-150-days-from-feb-24-uncertainty-persists/article70666665.ece",
    "timestamp": "2026-02-23T10:41:14Z"
  },
  {
    "title": "How Trump's ICE Built Nationwide Police Alliance Right Under Democrats' Noses",
    "description": "Liberal activists and officials are coming up with ways to thwart the contracts after Trump’s officials gained a foothold for ICE.",
    "link": "https://www.westernjournal.com/trumps-ice-built-nationwide-police-alliance-right-democrats-noses/",
    "timestamp": "2026-02-23T10:41:04Z"
  },
  {
    "title": "China Urges U.S. to Scrap Tariffs After SCOTUS Ruling",
    "description": "China's Commerce Ministry on Monday called for the United States to rescind all tariffs after the U.S. Supreme Court struck down President Donald Trump's emergency tariffs.\nThe post China Urges U.S. to Scrap Tariffs After SCOTUS Ruling appeared first on Breit…",
    "link": "https://www.breitbart.com/asia/2026/02/23/china-urges-u-s-to-scrap-tariffs-after-scotus-ruling/",
    "timestamp": "2026-02-23T10:35:50Z"
  },
  {
    "title": "Top Trump Stooge Has Tantrum After Keystone Kash Busted at Team USA Hockey Bash",
    "description": "President Trump’s top mouthpiece has flipped out over criticism leveled at “Keystone” Kash Patel after the FBI director was busted celebrating with a U.S...",
    "link": "https://www.thedailybeast.com/top-trump-stooge-has-tantrum-after-keystone-kash-busted-at-team-usa-hockey-bash/",
    "timestamp": "2026-02-23T10:28:58Z"
  },
  {
    "title": "The Potomac Interceptor Disaster: Causes and Public Health Impact",
    "description": "The Potomac Interceptor Disaster: Causes and Public Health Impactthefocalpoints.com",
    "link": "https://www.thefocalpoints.com/p/the-potomac-interceptor-disaster",
    "timestamp": "2026-02-23T10:27:20Z"
  },
  {
    "title": "India sees more options on US trade deal after tariff ruling",
    "description": "India is reviewing its trade agreement with the United States. A recent US Supreme Court ruling has impacted tariff decisions. This development provides India an opportunity to re-evaluate its negotiation approach. The nation is not planning to withdraw from …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-sees-more-options-on-us-trade-deal-after-tariff-ruling/articleshow/128709331.cms",
    "timestamp": "2026-02-23T10:21:46Z"
  },
  {
    "title": "Mexico Fears More Violence After Army Kills Leader Of Powerful Jalisco Cartel",
    "description": "President Claudia Sheinbaum urged calm and authorities announced late Sunday they had cleared most of the cartel roadblocks across 20 states.",
    "link": "https://www.huffpost.com/entry/violence-erupts-over-mexico-cartel-leader-killing_n_699c27d4e4b074e2825a5919",
    "timestamp": "2026-02-23T10:17:42Z"
  },
  {
    "title": "Performative Negotiations to Humor Trump",
    "description": "Eight thinkers on four years of Russia’s war against Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/23/us-russia-ukraine-trump-putin-negotiations-four-years-peace-deal/",
    "timestamp": "2026-02-23T10:15:20Z"
  },
  {
    "title": "Trump’s Tariffs Weren’t Really About Trade Policy",
    "description": "They were about his nostalgia, his ego, his bigotry, and his greed.\nThe post Trump’s Tariffs Weren’t Really About Trade Policy appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/23/trump-tariffs-trade-policy-supreme-court/",
    "timestamp": "2026-02-23T10:15:00Z"
  },
  {
    "title": "\"Khamenei and These [Islamic].Nazis\": Trump Reposts Combative Speech Signaling Hardline Stance on Iran",
    "description": "President Trump amplifies a message calling for the elimination of the Iranian regime. Following a foiled Mar-a-Lago plot, the President signals a \"deal\" is off the table, citing Iran’s history of nuclear violations. U.S. President Donald Trump sparked intens…",
    "link": "https://freerepublic.com/focus/f-news/4367955/posts",
    "timestamp": "2026-02-23T10:13:10Z"
  },
  {
    "title": "S’pore retains lowest tariff edge in Asia even after US court ruling narrows the gap",
    "description": "Trade-oriented economies like Singapore will be supported by any pick-up in trade activity on lower tariffs.  Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/spore-retains-lowest-tariff-edge-in-asia-even-after-us-court-ruling-narrows-the-gap",
    "timestamp": "2026-02-23T10:11:48Z"
  },
  {
    "title": "India Sees More Options on US Trade Deal After Tariff Ruling",
    "description": "The US Supreme Court decision to strike down President Donald Trump’s emergency tariffs gives India more scope in negotiations over a trade deal, people familiar with the matter said.",
    "link": "https://financialpost.com/pmn/business-pmn/india-sees-more-options-on-us-trade-deal-after-tariff-ruling",
    "timestamp": "2026-02-23T10:09:47Z"
  },
  {
    "title": "Tariffs and prices: The Supreme Court just gave Trump an off ramp. He’s not taking it",
    "description": "President Donald Trump’s unprecedented use of tariffs has injected enormous uncertainty into the global economy, depressing US job growth and raising prices along the way.",
    "link": "https://www.cnn.com/2026/02/23/business/tariffs-prices-trump",
    "timestamp": "2026-02-23T10:09:25Z"
  },
  {
    "title": "Australia’s first Trump Tower planned for Gold Coast, set to be tallest in the country",
    "description": "The six-star hotel and residential tower will feature 285 hotel rooms, 272 residences and retail and dining space.",
    "link": "https://7news.com.au/news/australias-first-trump-tower-planned-for-gold-coast-set-to-be-tallest-in-the-country--c-21731062",
    "timestamp": "2026-02-23T10:07:54Z"
  },
  {
    "title": "Putin vows to bolster Russia’s nuclear triad",
    "description": "Developing the nuclear arsenal remains one of Russia’s absolute priorities, President Vladimir Putin has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632923-putin-bolster-russia-nuclear-weapons/",
    "timestamp": "2026-02-23T10:07:31Z"
  },
  {
    "title": "How Putin Sold a False Win in Ukraine to Trump",
    "description": "Eight thinkers on four years of Russia’s war against Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/23/trump-putin-russia-ukraine-war-casualties-cost-territory-gains-negotiations-peace-deal/",
    "timestamp": "2026-02-23T10:07:24Z"
  },
  {
    "title": "From dabblers to day traders, small investors' impact on Wall Street grows even in volatile market",
    "description": "For years, retail investors were dismissed by some on Wall Street as “dumb money.”",
    "link": "https://abcnews.com/Business/wireStory/dabblers-day-traders-small-investors-impact-wall-street-130401427",
    "timestamp": "2026-02-23T10:05:27Z"
  },
  {
    "title": "Four Years on, Europe Is Taking Over",
    "description": "Eight thinkers on four years of Russia’s war against Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/23/russia-europe-war-ukraine-nato-military-aid-defense-security-eu/",
    "timestamp": "2026-02-23T10:02:39Z"
  },
  {
    "title": "Trump eyes Section 301 probes as tariff backup: What it means for global trade and why it matters",
    "description": "America's trade chief signals new investigations under Section 301. This law allows action against unfair foreign trade practices. Probes could cover industrial policies, drug pricing, digital trade, and ocean pollution. Such moves could lead to new tariffs o…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-eyes-section-301-probes-as-tariff-backup-what-it-means-for-global-trade-and-why-it-matters-explainer-points/articleshow/128706706.cms",
    "timestamp": "2026-02-23T10:01:13Z"
  },
  {
    "title": "SEN ELIZABETH WARREN: President Trump's broken promise on credit cards",
    "description": "President Trump could lower costs quickly if he would follow through on his campaign promise to put a 10% cap on credit card interest rates.",
    "link": "https://www.foxnews.com/opinion/sen-elizabeth-warren-president-trumps-broken-promise-credit-cards",
    "timestamp": "2026-02-23T10:00:54Z"
  },
  {
    "title": "Ayatollah's arsenal vs. American firepower: Iran's top 4 threats and how we fight back",
    "description": "Iran's military tactics against US forces include ballistic missiles, Shahed drones, and swarming boats, but American forces have proven countermeasures.",
    "link": "https://www.foxnews.com/opinion/ayatollahs-arsenal-vs-american-firepower-irans-top-4-threats-how-we-fight-back",
    "timestamp": "2026-02-23T10:00:49Z"
  },
  {
    "title": "China dominates with 5,500 ships while America has under 100 — but Trump’s fighting back",
    "description": "President Donald Trump released a comprehensive Maritime Action Plan on Feb. 13 to restore America's maritime dominance as Chinese shipbuilding outproduces America.",
    "link": "https://www.foxnews.com/opinion/china-dominates-5500-ships-while-america-has-under-100-trumps-fighting-back",
    "timestamp": "2026-02-23T10:00:43Z"
  },
  {
    "title": "Checks and balances aren't working under Trump, growing majority says",
    "description": "On the eve of President Donald Trump's State of the Union address, two-thirds of Americans say the system of checks and balances that divides power between the White House, Congress and the courts is not working well, according to the latest PBS News/NPR/Mari…",
    "link": "https://www.pbs.org/newshour/politics/checks-and-balances-arent-working-under-trump-growing-majority-says",
    "timestamp": "2026-02-23T10:00:38Z"
  },
  {
    "title": "Chopra had close relationship with Epstein, told him to bring ‘your girls’ on trips",
    "description": "A CNN review of correspondence between Chopra and Epstein reveals that they shared a far more intimate friendship than was previously known.",
    "link": "https://www.cnn.com/2026/02/23/politics/deepak-chopra-jeffrey-epstein-files",
    "timestamp": "2026-02-23T10:00:34Z"
  },
  {
    "title": "Trump’s approval rating with independents hits a new low ahead of the State of the Union | CNN Politics",
    "description": "When President Donald Trump gives his State of the Union address Tuesday, he will face a public that increasingly questions his priorities and expresses broad doubts about whether his proposed policies are helping the nation, according to a new CNN poll condu…",
    "link": "https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll",
    "timestamp": "2026-02-23T10:00:34Z"
  },
  {
    "title": "Trump has sealed the border. Now, Democrats are hell-bent on ending immigration enforcement",
    "description": "Border encounters dropped dramatically from 249,740 in December 2023 to just 6,472 in December 2025 under Donald Trump's immigration enforcement policies.",
    "link": "https://www.foxnews.com/opinion/trump-has-sealed-border-now-democrats-hell-bent-ending-immigration-enforcement",
    "timestamp": "2026-02-23T10:00:34Z"
  },
  {
    "title": "Who is Abigail Spanberger, and why did Democrats choose her for to their State of the Union response?",
    "description": "Virginia Gov. Abigail Spanberger, a former House Democrat, is delivering her party's rebuttal to the State of the Union on Tuesday night.",
    "link": "https://www.foxnews.com/politics/who-abigail-spanberger-why-did-democrats-choose-her-state-union-response",
    "timestamp": "2026-02-23T10:00:33Z"
  },
  {
    "title": "Mamdani’s Surprisingly Moderate Start",
    "description": "Mayor Zohran Mamdani is governing like a big-city liberal. His base seems undeterred, writes David Freedlander.",
    "link": "http://nymag.com/intelligencer/article/mayor-zohran-mamdani-surprisingly-moderate-start.html",
    "timestamp": "2026-02-23T10:00:19Z"
  },
  {
    "title": "Thomas rips Supreme Court tariffs ruling, says majority 'errs' on Constitution",
    "description": "Justice Clarence Thomas cited President Richard Nixon's 1971 import surcharge precedent in his dissent, arguing Congress authorized tariff authority under emergency powers law.",
    "link": "https://www.foxnews.com/politics/thomas-rips-supreme-court-tariffs-ruling-says-majority-errs-constitution",
    "timestamp": "2026-02-23T10:00:09Z"
  },
  {
    "title": "Trump’s Rage at SCOTUS Explodes—then Backfires as GOPers Turn on Him",
    "description": "After the Supreme Court struck down Donald Trump’s tariffs, he detonated. He targeted justices Neil Gorsuch and Amy Coney Barrett, fuming that the ruling was an “embarrassment to their families.” He doubled down on the idea that he has unilateral tariff power…",
    "link": "https://newrepublic.com/article/206884/trump-rage-scotus-explodes-then-backfires-gopers-turn",
    "timestamp": "2026-02-23T10:00:00Z"
  },
  {
    "title": "Don’t Panic About Trump’s Election Threats",
    "description": "He has no authority to run federal elections. In this year’s midterms, the big threat to democracy is apathy and complacency. \nThe post Don’t Panic About Trump’s Election Threats  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/02/23/trump-election-threats-2026-midterm-elections/",
    "timestamp": "2026-02-23T10:00:00Z"
  },
  {
    "title": "The Scramble for Lithium",
    "description": "Casey A. Williams\n\n\n\nThea Riofrancos’s Extraction tells the story of how a rare earth mineral became the focus of a worldwide battle over the future of green energy and, by extension, capitalism. \r\n\n\r\n\n\nThe post The Scramble for Lithium appeared first on The …",
    "link": "https://www.thenation.com/?post_type=article&p=587678",
    "timestamp": "2026-02-23T10:00:00Z"
  },
  {
    "title": "China urges US to scrap all tariffs",
    "description": "China has urged the US to cancel tariffs imposed by President Donald Trump, warning they violate international trade rules and US law Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632917-china-trump-cancel-tariffs/",
    "timestamp": "2026-02-23T09:59:42Z"
  },
  {
    "title": "CEOs who despised Trump’s tariffs are still silent after Supreme Court ruling: ‘There’s no upside in speaking up’",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2026/02/23/ceo-despise-trump-tariffs-silent-supreme-court-ruling/",
    "timestamp": "2026-02-23T09:59:13Z"
  },
  {
    "title": "The Sopranos Star on Why ‘A Lot Of’ Its Characters Might Be Trump Supporters",
    "description": "The Sopranos star Michael Imperioli, who played Christopher Moltisanti throughout the show’s run, discussed how the show might have looked in the present political climate in a new interview. He claimed that “a lot of” the characters may have been supporters …",
    "link": "https://www.comingsoon.net/tv/news/2099460-the-sopranos-michael-imperioli-christopher-donald-trump-supporter",
    "timestamp": "2026-02-23T09:57:05Z"
  },
  {
    "title": "President Donald Trump calls U.S. men's Olympic hockey team after gold medal win (Sean Gentille/The Athletic)",
    "description": "Sean Gentille / The Athletic:\nPresident Donald Trump calls U.S. men's Olympic hockey team after gold medal win  —  Share full article  —  President Donald Trump placed a congratulatory video call to members of the United States Olympic men's hockey team after…",
    "link": "https://www.memeorandum.com/260223/p3",
    "timestamp": "2026-02-23T09:55:01Z"
  },
  {
    "title": "Two Scenarios for Europe as Trump Talks to Putin",
    "description": "Eight thinkers on four years of Russia’s war against Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/23/russia-ukraine-war-four-years-trump-putin-negotiations-europe-eu-economics-sanctions/",
    "timestamp": "2026-02-23T09:54:23Z"
  },
  {
    "title": "Bitcoin's Dip Under $65K Pushes Crypto Liquidations to $500M",
    "description": "Bitcoin's drop below $65K triggered over $500M in liquidations, as macro uncertainty from tariffs and geopolitics reprices risk assets.",
    "link": "https://decrypt.co/358813/bitcoins-dip-under-65k-pushes-crypto-liquidations-to-500m",
    "timestamp": "2026-02-23T09:52:34Z"
  },
  {
    "title": "Hungary Draws Rebuke Over Threat to Block EU Ukrainian Aid",
    "description": "Hungary prompted an outcry among European Union member states over its threat to block the latest sanctions package against Russia and a €90 billion ($106 billion) loan to Ukraine.",
    "link": "https://financialpost.com/pmn/business-pmn/hungary-draws-rebuke-over-threat-to-block-eu-ukrainian-aid",
    "timestamp": "2026-02-23T09:49:34Z"
  },
  {
    "title": "Asia and Europe Are Now Strategically Joined",
    "description": "Eight thinkers on four years of Russia’s war against Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/23/russia-ukraine-war-asia-china-india-japan-nato-geopolitics/",
    "timestamp": "2026-02-23T09:46:11Z"
  },
  {
    "title": "Toymaker Assesses Next Steps in US Supreme Court Tariff Refund Battle",
    "description": "Companies that hedged their bets by selling potential tariff refund claims to investors celebrated on Friday after the U.S. Supreme Court struck down President Donald Trump’s sweeping emergency tariffs. Now comes the hard part. “It’s a tiny win in what …",
    "link": "https://www.insurancejournal.com/news/national/2026/02/23/859071.htm",
    "timestamp": "2026-02-23T09:45:15Z"
  },
  {
    "title": "Huckabee mocks Arab League's condemnation of his remarks endorsing Israel's biblical territorial claims",
    "description": "US Ambassador to Israeli-occupied territories Mike Huckabee has pushed back against widespread criticism and mocked the Arab League's condemnation following his recent interview with American journalist Tucker Carlson, in which he endorsed the notion of Israe…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260222-presstv01.htm",
    "timestamp": "2026-02-23T09:42:48Z"
  },
  {
    "title": "Denmark rejects Trump's plan to send US hospital ship to Greenland",
    "description": "The leaders of Greenland and Denmark have rejected US President Donald Trump's plan to dispatch a hospital ship to the Arctic territory, saying the island does not need foreign medical assistance.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260222-presstv02.htm",
    "timestamp": "2026-02-23T09:42:42Z"
  },
  {
    "title": "Iran says any US attack including limited strikes would be 'act of aggression'",
    "description": "TEHRAN: Iran said on Monday (Feb 23) that any US attack, including limited strikes, would be an \"act of aggression\" that would precipitate a response, after President Donald Trump said he was consi",
    "link": "https://www.channelnewsasia.com/world/iran-us-attack-limited-strikes-act-aggression-5946901",
    "timestamp": "2026-02-23T09:42:02Z"
  },
  {
    "title": "US Troops in Middle East Being Redeployed for New Missions, Not Evacuated - Reports",
    "description": "Hundreds of US troops stationed at military bases in Qatar and Bahrain have been redeployed for other missions and operations, not evacuated, the New York Times reported.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260222-sputnik02.htm",
    "timestamp": "2026-02-23T09:40:56Z"
  },
  {
    "title": "Iran, other Muslim states slam US envoy's endorsement of 'Greater Israel' plot",
    "description": "Iran, along with several Islamic and Arab countries and organizations, has condemned comments by the US ambassador to the occupied territories, who suggested Israel has a right to expand its occupation to much of West Asia.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260222-presstv08.htm",
    "timestamp": "2026-02-23T09:39:50Z"
  },
  {
    "title": "Banks should focus on core business, not on mis-selling, says FM Sitharaman",
    "description": "“I’m glad the RBI is issuing guidance against mis-selling; The message should go to the banks that they cannot afford to mis-sell, and it is an offense,” she said",
    "link": "https://www.thehindubusinessline.com/money-and-banking/banks-should-focus-on-core-business-not-on-mis-selling-says-fm-sitharaman/article70666286.ece",
    "timestamp": "2026-02-23T09:37:33Z"
  },
  {
    "title": "Global Markets | Germany's DAX leads European shares lower on heightened US trade uncertainty",
    "description": "European shares dipped in choppy trading on Monday, rocked by a fresh wave of uncertainty regarding U.S. trade ‌policy after ⁠President ⁠Donald Trump announced a new rate of global tariffs.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/global-markets-germanys-dax-leads-european-shares-lower-on-heightened-us-trade-uncertainty/articleshow/128707816.cms",
    "timestamp": "2026-02-23T09:35:19Z"
  },
  {
    "title": "Europe hits back at 'pure tariff chaos' from the U.S., warning trade deals are at risk",
    "description": "European officials have reacted with disbelief to President Donald Trump's latest tariff policy, warning that trade deals could be at risk.",
    "link": "https://www.cnbc.com/2026/02/23/trump-15percent-global-tariff-europe-eu-uk-reaction.html",
    "timestamp": "2026-02-23T09:33:50Z"
  },
  {
    "title": "The US Supreme Court’s tariff rebuff: It’s time for Congress to assert its constitutional authority",
    "description": "The US Supreme Court ruling on reciprocal tariffs is a wake-up call for Congress. It was designed to be democracy’s first branch, not a bystander. Yet as Donald Trump pushed sweeping tariffs, lawmakers stood aside. America’s democracy must not let legislative…",
    "link": "https://www.livemint.com/opinion/online-views/us-supreme-court-tariff-congress-constitutional-authority-donald-trump-democracy-11771834880378.html",
    "timestamp": "2026-02-23T09:31:08Z"
  },
  {
    "title": "Political Meme Coins Implode: TRUMP Down 92%, MELANIA Nearly Wiped Out",
    "description": "US President Donald Trump namesake meme coins have collapsed, leaving many small holders deep in the red. Prices that once drew crowds and headlines have fallen back to earth with blunt force. Related Reading: XRP Flashes Rare On-Chain Signal That Once Preced…",
    "link": "http://www.newsbtc.com/meme-coins/political-meme-coins-implode-trump-down-92-melania-nearly-wiped-out/",
    "timestamp": "2026-02-23T09:30:53Z"
  },
  {
    "title": "Ted Sarandos Responds to Donald Trump’s Call to Fire Board Member Susan Rice: ‘He Likes to Do a Lot of Things on Social Media’",
    "description": "Ted Sarandos has brushed off Donald Trump’s social media demand that Netflix fire board member Susan Rice, saying the streamer’s bid for Warner Bros. Discovery is a business matter and not a political one. “He likes to do a lot of things on social media,” the…",
    "link": "https://variety.com/2026/tv/news/ted-sarandos-responds-donald-trump-fire-susan-rice-1236670063/",
    "timestamp": "2026-02-23T09:27:56Z"
  },
  {
    "title": "10 memorable moments from the Milan Cortina Winter Olympics",
    "description": "With 116 medal events over 16 days spread across northern Italy, the Milan Cortina Winter Olympics delivered many unforgettable moments. U.S. skier Lindsey Vonn’s Olympic story was supposed to be one of redemption. Instead she got hooked on a gate 13 seconds …",
    "link": "https://sports.yahoo.com/articles/10-memorable-moments-milan-cortina-092716573.html",
    "timestamp": "2026-02-23T09:27:16Z"
  }
]