[
  {
    "title": "Conservative YouTuber Goes Off On Left-Wing Commentator For Arguing Against Crackdown On Trans Athletes",
    "description": "Black Conservative Perspective rebuked Jack Cocchiarella for arguing against federal government restrictions on biological males playing female sports.",
    "link": "https://dailycaller.com/2026/01/16/conservative-youtuber-left-wing-commentator-arguing-against-crackdown-trans-athletes/",
    "timestamp": "2026-01-16T20:51:21Z"
  },
  {
    "title": "Antifa-Linked Website Posts Plans To ‘Take The Fight’ To ICE At Agent’s Home",
    "description": "A prominent anarchist blog is calling for a “disruptive” gathering at an Immigration and Customs Enforcement (ICE) agent’s home in Portland, Oregon, on Friday night. Masked protesters should arrive at the property at 6 p.m. and “TAKE THE FIGHT” to ICE, whethe…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362500/posts",
    "timestamp": "2026-01-16T20:49:48Z"
  },
  {
    "title": "Deficits boost U.S. debt but also inflate corporate profits and stocks, so reducing red ink could trigger a financial crisis, analysts warn",
    "description": "\"In the financialized U.S. economy, each dollar of deficit spending may flow into a dollar of corporate profit.\"",
    "link": "https://fortune.com/2026/01/16/deficits-boost-us-national-debt-inflate-corporate-profits-stocks-financial-crisis-trigger/",
    "timestamp": "2026-01-16T20:47:43Z"
  },
  {
    "title": "Watch Live: Donald Trump Attends Dedication Ceremony",
    "description": "President Donald Trump attends a dedication ceremony to rename a street in his honor in Florida, on Friday, January 16.\nThe post Watch Live: Donald Trump Attends Dedication Ceremony appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/16/watch-live-donald-trump-attends-dedication-ceremony/",
    "timestamp": "2026-01-16T20:47:04Z"
  },
  {
    "title": "China's 2025 economic growth likely slowest in decades: analysts",
    "description": "China's economy likely grew last year at its weakest rate in three decades, outside of the pandemic, according to an AFP survey of analysts ahead of official data on Monday. The world's second-largest economy struggled to shore up its property market while bo…",
    "link": "https://japantoday.com/category/business/china%27s-2025-economic-growth-likely-slowest-in-decades-analysts",
    "timestamp": "2026-01-16T20:45:55Z"
  },
  {
    "title": "Canada Circumvents Trump's Tariffs in Sweeping Trade Deal with China",
    "description": "After years of tension with Beijing, Prime Minister Mark Carney signed a massive energy deal with President Xi Jinping to expand commercial and policy engagement.",
    "link": "https://www.ibtimes.com/canada-circumvents-trumps-tariffs-sweeping-trade-deal-china-3795552",
    "timestamp": "2026-01-16T20:44:04Z"
  },
  {
    "title": "Defendant in Charlie Kirk's killing asks judge to disqualify prosecutors",
    "description": "The 22-year-old Utah man charged with killing conservative activist Charlie Kirk is due back in court Friday as his attorneys seek to disqualify prosecutors in the case over an alleged conflict of interest. Tyler Robinson is charged with aggravated murder in …",
    "link": "https://japantoday.com/category/world/defendant-in-charlie-kirk%27s-killing-asks-judge-to-disqualify-prosecutors",
    "timestamp": "2026-01-16T20:43:18Z"
  },
  {
    "title": "Ukrainian team heading to U.S. for security guarantee talks, Zelenskyy says",
    "description": "A Ukrainian delegation is en route to the U.S. for talks on security guarantees and a post-war recovery package, President Volodymyr Zelenskyy said on ‌Friday, expressing hope the documents could be signed on the sidelines of the World Economic Forum in Davos…",
    "link": "https://japantoday.com/category/world/ukrainian-team-heading-to-us-for-security-guarantee-talks-zelenskiy-says1",
    "timestamp": "2026-01-16T20:43:09Z"
  },
  {
    "title": "Nobel Prize inseparable from winner but medal can be given away, award body says",
    "description": "The Nobel Peace Prize remains inseparably linked to the person or organization that ‌won it, though the medal can be given away, the Norwegian Nobel Committee said on Friday, a day after last year's winner gave her medal to U.S. ⁠President Donald Trump. Venez…",
    "link": "https://japantoday.com/category/world/nobel-prize-inseparable-from-winner-but-medal-can-be-given-away-award-body-says",
    "timestamp": "2026-01-16T20:43:00Z"
  },
  {
    "title": "Venezuela opposition leader sees eventual elections but cautions about complex path ahead",
    "description": "Opposition leader Maria Corina Machado said on Friday she was confident the remnants of what she called Venezuela's “criminal regime” would eventually be dismantled and there would be an orderly transition to free elections, but cautioned that the road ahead …",
    "link": "https://japantoday.com/category/world/venezuela-opposition-leader-sees-eventual-elections-but-cautions-about-complex-path-ahead",
    "timestamp": "2026-01-16T20:42:41Z"
  },
  {
    "title": "Iran protests abate after deadly crackdown; Trump says Tehran calls off mass hangings",
    "description": "Iran's deadly crackdown appears to have broadly quelled protests for now, residents said on Friday, as state media reported more arrests in the shadow of repeated U.S. threats to intervene if the killing continues. U.S. President Donald Trump, whose repeated …",
    "link": "https://japantoday.com/category/world/iran-protests-abate-after-deadly-crackdown-trump-says-tehran-calls-off-mass-hangings",
    "timestamp": "2026-01-16T20:42:15Z"
  },
  {
    "title": "Canada, China slash EV, canola tariffs in reset of ties",
    "description": "Canada and China struck an initial trade deal on Friday that will slash tariffs on electric vehicles and canola, as both nations promised to tear down trade barriers while forging new strategic ties during Prime Minister Mark Carney's visit. The first Canadia…",
    "link": "https://japantoday.com/category/world/canada-china-slash-ev-canola-tariffs-in-reset-of-ties2",
    "timestamp": "2026-01-16T20:42:08Z"
  },
  {
    "title": "Trump says he may punish countries with tariffs if they don’t back U.S. controlling Greenland",
    "description": "U.S. President Donald Trump suggested Friday that he may punish countries with tariffs if they don’t back the U.S. controlling Greenland, a message that came as a bipartisan Congressional delegation sought to lower tensions in the Danish capital. Trump for mo…",
    "link": "https://japantoday.com/category/world/trump-says-he-may-punish-countries-with-tariffs-if-they-don%E2%80%99t-back-the-us-controlling-greenland",
    "timestamp": "2026-01-16T20:41:46Z"
  },
  {
    "title": "Trump to attend renaming part of Southern Blvd. as 'President Donald J. Trump Boulevard'",
    "description": "Six months after Palm Beach County commissioners voted 7-0 to rename a stretch of Southern Boulevard after President Donald Trump, a dedication ceremony for the formal name change will take place today. President Trump is expected to attend the ceremony today…",
    "link": "https://freerepublic.com/focus/f-news/4362499/posts",
    "timestamp": "2026-01-16T20:41:36Z"
  },
  {
    "title": "'The View' hosts call on Clintons to comply with subpoena, testify on Epstein",
    "description": "Co-hosts of \"The View\" call for former President Bill Clinton and Hillary Clinton to comply with subpoenas on Jeffrey Epstein case, citing importance of congressional oversight.",
    "link": "https://www.foxnews.com/media/the-view-hosts-call-clintons-comply-subpoena-testify-epstein",
    "timestamp": "2026-01-16T20:40:51Z"
  },
  {
    "title": "Trump says he may hit countries with tariffs if they do not back US on Greenland",
    "description": "US congressional delegation meets Danish and Greenlandic politicians in Copenhagen",
    "link": "https://www.irishtimes.com/world/us/2026/01/16/trump-says-he-may-hit-countries-with-tariffs-if-they-do-not-back-us-on-greenland/",
    "timestamp": "2026-01-16T20:40:09Z"
  },
  {
    "title": "Dr. Oz, TV star turned U.S. health boss, vows zip code will no longer determine life expectancy",
    "description": "Rural health care has long been a concern for lawmakers, as it can be difficult for hospitals and medical centers to maintain patient volumes high enough to remain financially sustainable",
    "link": "https://justthenews.com/nation/states/center-square/oz-your-zip-code-will-no-longer-determine-your-life-expectancy",
    "timestamp": "2026-01-16T20:40:08Z"
  },
  {
    "title": "Gov. Tim Walz Urges Minnesotans To Keep Calm, Carry Phones. Trump Freaks The F*ck Out. (Doktor Zoom/Wonkette)",
    "description": "Doktor Zoom / Wonkette:\nGov. Tim Walz Urges Minnesotans To Keep Calm, Carry Phones.  Trump Freaks The F*ck Out.  —  Minnesota Gov. Tim Walz on Wednesday gave a brief prime-time speech calling on the people of the state to keep resisting Donald Trump's invasio…",
    "link": "https://www.memeorandum.com/260116/p98",
    "timestamp": "2026-01-16T20:40:00Z"
  },
  {
    "title": "Donald Trump Says His Friend Got Fatter After Taking Ozempic",
    "description": "Donald Trump says Ozempic ain't the wonder-drug you might've heard many call it ... because he swears he has a friend who gained weight while taking the notorious weight-loss med. POTUS attended a meeting on Capitol Hill Friday about health care…\n Permalink",
    "link": "https://www.tmz.com/2026/01/16/trump-friend-took-ozempic/",
    "timestamp": "2026-01-16T20:39:49Z"
  },
  {
    "title": "Very Fake News: EPA Chief Lee Zeldin Attacks 'Dishonest' New York Times over Gold-Standard Pollution Rules",
    "description": "EPA Administrator Lee Zeldin attacked the \"dishonest\" New York Times for pushing a \"fake news claim\" that the agency is no longer considering \"lives saved\" when setting regulations.\nThe post Very Fake News: EPA Chief Lee Zeldin Attacks ‘Dishonest’ New York Ti…",
    "link": "https://www.breitbart.com/politics/2026/01/16/very-fake-news-epa-chief-lee-zeldin-attacks-dishonest-new-york-times-over-gold-standard-pollution-rules/",
    "timestamp": "2026-01-16T20:37:36Z"
  },
  {
    "title": "Brazil, EU hail trade deal as victory for multilateralism",
    "description": "Brazil’s President Luiz Inacio Lula da Silva and EU chief Ursula von der Leyen on Friday hailed a trade deal between the EU and South America’s Mercosur bloc as a victory for multilateralism at a time of global volatility. The pair met in Rio de Janeiro on th…",
    "link": "https://www.digitaljournal.com/world/brazil-eu-hail-trade-deal-as-victory-for-multilateralism/article",
    "timestamp": "2026-01-16T20:37:20Z"
  },
  {
    "title": "Dmitry Trenin: Russia and the EU drift toward an undeclared war",
    "description": "A cautious forecast of what international relations will look like in 2026 Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631057-dmitry-trenin-russia-and-eu-2026/",
    "timestamp": "2026-01-16T20:36:14Z"
  },
  {
    "title": "Federal Judges Uphold Massive Blow To GOP House Control In 2026 Midterms",
    "description": "The 2026 midterms will determine President Trump governing power, and a federal court just handed Democrats a huge advantage that puts his legacy in jeopardy.",
    "link": "https://dailycaller.com/2026/01/16/federal-judges-2026-midterms-gop-democrat-control-trump-california-texas/",
    "timestamp": "2026-01-16T20:34:48Z"
  },
  {
    "title": "California State Parks are Free This MLK Day",
    "description": "Gavin Newsom welcomed visitors back outdoors on Monday after President Donald Trump cut the holiday from a list of fee-free days at national parks.",
    "link": "https://www.kqed.org/news/12070184/california-state-parks-are-free-this-mlk-day",
    "timestamp": "2026-01-16T20:33:56Z"
  },
  {
    "title": "Trump: 'Great Healthcare Plan' Will Deliver 'Much Better Health Care at a Much Reduced' Cost",
    "description": "President Donald Trump said Friday that the \"Great Healthcare Plan\" framework will deliver \"much better health care at a much reduced\" cost and carry \"tremendous reductions,\" in response to a question from Breitbart News.\nThe post Trump: ‘Great Healthcare Pla…",
    "link": "https://www.breitbart.com/politics/2026/01/16/trump-great-healthcare-plan-will-deliver-tremendous-reductions-in-cost/",
    "timestamp": "2026-01-16T20:33:53Z"
  },
  {
    "title": "Trump’s ‘Free Speech’ Presidency Racked Up 200 Censorship Attempts In Its First Year",
    "description": "Weve said it before, and well keep saying it because apparently it needs repeating: Donald Trump is not a free speech president. He just plays one on TV while doing the exact opposite behind the scenes. And in front of the scenes. And basically everywhere. Ov…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180602408",
    "timestamp": "2026-01-16T20:33:24Z"
  },
  {
    "title": "‘Nothing’s changed’ in Gaza as US peace deal enters second phase",
    "description": "From his tent in Gaza City, Mahmoud Abdel Aal said residents were frustrated and worried because nothing had changed in the Palestinian territory since the start of the US-brokered ceasefire’s second phase. In a post-apocalyptic landscape of bombed-out buildi…",
    "link": "https://www.digitaljournal.com/world/nothings-changed-in-gaza-as-us-peace-deal-enters-second-phase/article",
    "timestamp": "2026-01-16T20:32:20Z"
  },
  {
    "title": "The Irish Times view on Donald Trump’s foreign policy: Washington goes rogue",
    "description": "The US has undertaken a profound and deeply worrying strategy shift",
    "link": "https://www.irishtimes.com/opinion/editorials/2026/01/16/the-irish-times-view-on-donald-trumps-foreign-policy-washington-goes-rogue/",
    "timestamp": "2026-01-16T20:32:00Z"
  },
  {
    "title": "Trump’s Push for Credit Card APR Cap is Popular; Effects May Not Be",
    "description": "Trump backs a 10% cap on credit card interest rates. Supporters cite savings for borrowers, while opponents warn of unintended consequences.",
    "link": "https://www.nerdwallet.com/credit-cards/news/trump-10-percent-apr-cap-consequences#article",
    "timestamp": "2026-01-16T20:30:56Z"
  },
  {
    "title": "Trump's foreign policy approval plummets to historic low",
    "description": "A new poll shows that President Donald Trump's approval rating on his handling of foreign policy has dipped to its lowest since he returned to the White House, according to reports Friday. A new Marist poll found that only 37% of adults in the United States a…",
    "link": "https://www.rawstory.com/donald-trump-foreign-policy-2674903386/",
    "timestamp": "2026-01-16T20:30:46Z"
  },
  {
    "title": "A Long History of Betrayal",
    "description": "Why Washington keeps encouraging foreign uprisings—and then walking away.",
    "link": "http://foreignpolicy.com/2026/01/16/trump-iran-protests-intervention-kurds-nixon-kissinger-hungary/",
    "timestamp": "2026-01-16T20:29:46Z"
  },
  {
    "title": "White House slams 'no-talent loser' Jimmy Kimmel after offering Trump his Emmy to pull ICE from Minnesota",
    "description": "White House communications director Steven Cheung called Jimmy Kimmel a \"no-talent loser\" on Friday after the host offered Trump his Emmy in exchange for removing ICE from Minneapolis.",
    "link": "https://www.foxnews.com/media/white-house-slams-no-talent-loser-jimmy-kimmel-after-offering-trump-his-emmy-pull-ice-minnesota",
    "timestamp": "2026-01-16T20:29:45Z"
  },
  {
    "title": "What in the World?",
    "description": "Test yourself on the week of Jan. 10: Trump threatens the U.S. Fed’s independence, Russia strikes Ukraine, and Uganda cuts internet access.",
    "link": "http://foreignpolicy.com/2026/01/16/foreign-policy-news-quiz-federal-reserve-trump-ukraine-russia-uganda/",
    "timestamp": "2026-01-16T20:28:24Z"
  },
  {
    "title": "Trump credits halted Iran executions for holding off military strikes",
    "description": "President Donald Trump is delaying military action in Iran after claiming execution cancellations, amid ongoing protests that have reportedly killed over 2,000 people.",
    "link": "https://www.foxnews.com/politics/trump-credits-halted-iran-executions-holding-off-military-strikes",
    "timestamp": "2026-01-16T20:27:53Z"
  },
  {
    "title": "Mike Lindell Promises ‘New Protester Laws’ and To Arrest All of the Anti-ICE Demonstrators If Elected Minnesota Governor",
    "description": "MyPillow founder Mike Lindell promised \"new protester laws\" and to arrest anti-ICE demonstrators if he becomes governor of Minnesota.\nThe post Mike Lindell Promises ‘New Protester Laws’ and To Arrest All of the Anti-ICE Demonstrators If Elected Minnesota Gove…",
    "link": "https://www.mediaite.com/media/podcasts/mike-lindell-promises-new-protester-laws-and-to-arrest-all-of-the-anti-ice-demonstrators-if-elected-minnesota-governor/",
    "timestamp": "2026-01-16T20:26:54Z"
  },
  {
    "title": "ICE agent who shot Renee Good was trained to track fugitives | Honolulu Star-Advertiser",
    "description": "Jonathan Ross stood before a small group of his fellow students at Anderson University in Indiana and cautioned that the war in Iraq was not the one they were seeing on television.",
    "link": "https://www.staradvertiser.com/2026/01/16/breaking-news/ice-agent-who-shot-renee-good-was-trained-to-track-fugitives/",
    "timestamp": "2026-01-16T20:26:22Z"
  },
  {
    "title": "Iran's exiled crown prince asks Europe's help to end regime",
    "description": "The eldest son of the last shah, Reza Pahlavi, has said Iran's regime is on its \"last legs\" and called on countries to take action in support of demonstrators. Reza Pahlavi, the exiled former crown prince of Iran, said Friday that democracies need to \"act now…",
    "link": "https://www.dw.com/en/irans-exiled-crown-prince-asks-europes-help-to-end-regime/a-75544196",
    "timestamp": "2026-01-16T20:26:00Z"
  },
  {
    "title": "Charlie Kirk’s Murder Prompts New Hate Crime Bill",
    "description": "GOP CA Assemblywoman Laurie Davies introduced a bill to add political affiliation to hate crime classifications, telling the DCNF she aims to \"lower the political temperature.\"",
    "link": "https://dailycaller.com/2026/01/16/charlie-kirks-murder-new-hate-crime-bill-melissa-hortman-davies-california/",
    "timestamp": "2026-01-16T20:24:25Z"
  },
  {
    "title": "Brazil’s Lula hails historic EU-Mercosur deal ahead of no-show at its signing",
    "description": "Brazilian President Lula da Silva and European Commission President Ursula von der Leyen celebrate the expected signing of a free trade agreement between the EU and Mercosur",
    "link": "https://abcnews.go.com/Business/wireStory/brazils-lula-hails-historic-eu-mercosur-deal-ahead-129290791",
    "timestamp": "2026-01-16T20:21:45Z"
  },
  {
    "title": "Trump pardons former Puerto Rican Gov. Wanda Vázquez Garced (NBC News)",
    "description": "NBC News:\nTrump pardons former Puerto Rican Gov. Wanda Vázquez Garced  —  She was indicted by the Justice Department in 2022 over her alleged participation in a bribery scheme.  She pleaded guilty in August to a reduced charge of a campaign finance violation.…",
    "link": "https://www.memeorandum.com/260116/p94",
    "timestamp": "2026-01-16T20:20:00Z"
  },
  {
    "title": "Trump Pardons Convicted Fraudster For The Second Time In Five Years",
    "description": "President Donald Trump pardoned nearly two dozen people this week including a woman who had a fraud conviction commuted by the president in 2021, according to multiple outlets, marking the latest pardons handed out by Trump in his second term.",
    "link": "https://freerepublic.com/focus/f-news/4362494/posts",
    "timestamp": "2026-01-16T20:20:00Z"
  },
  {
    "title": "Trump says $50B rural health plan funded by cutting Medicaid 'waste, fraud and abuse'",
    "description": "President Donald Trump announced a $50 billion increase in rural healthcare funding, claiming savings from cutting Medicaid waste will revitalize hospitals.",
    "link": "https://www.foxnews.com/politics/trump-says-50b-rural-health-plan-funded-cutting-medicaid-waste-fraud-abuse",
    "timestamp": "2026-01-16T20:19:45Z"
  },
  {
    "title": "Here's what happened today: Friday",
    "description": "The most important Irish and international stories you need to know today",
    "link": "https://www.thejournal.ie/news-fix-friday-72-6929718-Jan2026/",
    "timestamp": "2026-01-16T20:19:24Z"
  },
  {
    "title": "Dominion Energy wins bid to resume wind project Trump halted",
    "description": "The ruling marks the third time this week that an offshore wind project was allowed to resume despite a government stop-work order.",
    "link": "https://fortune.com/2026/01/16/dominion-energy-offshore-wind-project-wins-legal-fight-trump-administration-stop-order/",
    "timestamp": "2026-01-16T20:18:56Z"
  },
  {
    "title": "Trump's Iceland ambassador pick made a '52nd state' joke. Icelanders aren't laughing",
    "description": "When Trump's pick for U.S. ambassador to Iceland joked this week that the Nordic country should become the 52nd state, and he should be its governor, it didn't exactly go down well.",
    "link": "https://www.cbc.ca/news/world/us-ambassador-iceland-trump-9.7048349",
    "timestamp": "2026-01-16T20:18:30Z"
  },
  {
    "title": "Veterans stand with Afghan allies as Senate Republicans say they're a public safety risk",
    "description": "At a Senate Judiciary Committee hearing Wednesday Republicans accused the Biden administration of allowing tens of thousands to settle in the U.S. without vetting them.",
    "link": "https://www.kpbs.org/news/military/2026/01/16/veterans-stand-with-afghan-allies-as-senate-republicans-say-theyre-a-public-safety-risk",
    "timestamp": "2026-01-16T20:17:07Z"
  },
  {
    "title": "Trump threatens to slap tariffs on countries that won't let him take over Greenland",
    "description": "Trump threatens tariffs on Greenland, countries that oppose US takeoverby Jennifer Shutt, Daily Montanan January 16, 2026WASHINGTON — President Donald Trump threatened Friday to place tariffs on Greenland and any country that opposes his efforts to take over …",
    "link": "https://www.rawstory.com/trump-greenland-2674903430/",
    "timestamp": "2026-01-16T20:15:28Z"
  },
  {
    "title": "‘Tariff king’: Trump considers imposing economic pressures to secure Greenland",
    "description": "President Donald Trump reaffirmed his commitment on Friday to the U.S. acquiring Greenland, hinting that he may impose economic pressure on reluctant nations to secure their backing.Trump has argued that the acquisition of Greenland is imperative to America’s…",
    "link": "https://www.theblaze.com/news/tariff-king-trump-considers-imposing-economic-pressures-to-secure-greenland",
    "timestamp": "2026-01-16T20:15:00Z"
  },
  {
    "title": "Candace Owens Suggests Charlie Kirk Was Time Traveler That \"Agents\" Followed \"Since He Was Young\" To \"Change An Outcome\"",
    "description": "Candace Owens is now pushing that Charlie Kirk was a TIME TRAVELLER - and that he had \"AGENTS\" (yes, like the Matrix) monitoring him from childhood - and that he was killed because he tried to DISTURB space-time continuum. No, I'm not kidding.",
    "link": "https://freerepublic.com/focus/f-chat/4362491/posts",
    "timestamp": "2026-01-16T20:13:12Z"
  },
  {
    "title": "Republicans Struggle To Chart A Path On Trump’s Wall Street Housing Pledge",
    "description": "President Donald Trump has vowed to stop Wall Street from buying single-family homes, but Congressional Republicans have yet to implement or codify a plan.",
    "link": "https://dailycaller.com/2026/01/16/donald-trump-congress-institutional-investors-single-family-homes-wall-street-legislation/",
    "timestamp": "2026-01-16T20:12:49Z"
  },
  {
    "title": "Trump Says He’ll Make Tech Firms Pay for Power. They’d Love To",
    "description": "US President Donald Trump is calling for an emergency wholesale electricity auction that, he says, will force technology companies to pay for the new power they need to run massive AI data centers under construction across the country.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-hell-make-tech-firms-pay-for-power-theyd-love-to",
    "timestamp": "2026-01-16T20:12:42Z"
  },
  {
    "title": "Donald Trump praises Iran for halting mass executions",
    "description": "US President Donald Trump praised Iran for halting what he said were plans to hang more than 800 political prisoners.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/16/donald-trump-praises-iran-for-halting-mass-executions",
    "timestamp": "2026-01-16T20:12:25Z"
  },
  {
    "title": "Trump’s ‘Free Speech’ Presidency Racked Up 200 Censorship Attempts In Its First Year",
    "description": "We’ve said it before, and we’ll keep saying it because apparently it needs repeating: Donald Trump is not a free speech president. He just plays one on TV while doing the exact opposite behind the scenes. And in front of the scenes. And basically everywhere. …",
    "link": "https://www.techdirt.com/2026/01/16/trumps-free-speech-presidency-racked-up-200-censorship-attempts-in-its-first-year/",
    "timestamp": "2026-01-16T20:11:03Z"
  },
  {
    "title": "Panthers' Matthew Tkachuk Blasted by Fans After Praising Trump During White House Visit",
    "description": "Some left-wing fans were furious after Florida Panthers forward Matthew Tkachuk praised Donald Trump during a visit to the White House.\nThe post Panthers’ Matthew Tkachuk Blasted by Fans After Praising Trump During White House Visit appeared first on Breitbar…",
    "link": "https://www.breitbart.com/sports/2026/01/16/panthers-matthew-tkachuk-blasted-fans-after-praising-trump-during-white-house-visit/",
    "timestamp": "2026-01-16T20:10:19Z"
  },
  {
    "title": "Trump says he wants to keep Hassett in White House, clouding Fed chair selection",
    "description": "Trump’s comments upended expectations around the extensive search to find a new Fed chair.",
    "link": "https://www.bostonherald.com/2026/01/16/trump-says-he-wants-to-keep-hassett-in-white-house-clouding-fed-chair-selection/",
    "timestamp": "2026-01-16T20:09:16Z"
  },
  {
    "title": "‘Daily Show’ Jokes Trump’s Greenland Meeting Left Officials So Shaken They Became the Ben Affleck Meme | Video",
    "description": "\"You can tell this meeting didn't go well by the way the entire delegation rushed to smoke immediately after,\" host Jordan Klepper jokes\nThe post ‘Daily Show’ Jokes Trump’s Greenland Meeting Left Officials So Shaken They Became the Ben Affleck Meme | Video ap…",
    "link": "https://www.thewrap.com/media-platforms/politics/daily-show-greenland-denmark-smoking-jd-vance-marco-rubio-meeting/",
    "timestamp": "2026-01-16T20:09:14Z"
  },
  {
    "title": "Rahm Emanuel Slams Trump’s ICE as ‘Lawless Mob’ on CNN",
    "description": "Former Chicago Mayor Rahm Emanuel (D) slammed ICE under President Donald Trump as a \"lawless mob\" and to end the agency \"as you know it.\"\nThe post Rahm Emanuel Slams Trump’s ICE as ‘Lawless Mob’ on CNN first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/rahm-emanuel-slams-trumps-ice-as-lawless-mob-on-cnn/",
    "timestamp": "2026-01-16T20:09:05Z"
  },
  {
    "title": "MS NOW panel cracks up as Trump admin plays dumb on its own move: 'It's just laughable'",
    "description": "An MS NOW panel chuckled Friday after President Donald Trump and Health Secretary Robert F. Kennedy Jr. were caught off guard on a question over funding to Planned Parenthood during an Oval Office event this week. The laughter broke out during a segment about…",
    "link": "https://www.rawstory.com/tim-miller-2674903132/",
    "timestamp": "2026-01-16T20:06:03Z"
  },
  {
    "title": "TikTok using AI to block under-13 accounts across Europe — could the US be far behind?",
    "description": "The clock is Tikking on tweens' social media use.",
    "link": "https://nypost.com/2026/01/16/tech/tiktok-using-ai-to-block-under-13-accounts-across-europe/",
    "timestamp": "2026-01-16T20:04:37Z"
  },
  {
    "title": "Trump's Acceptance of Nobel Medal From Maria Machado Called 'Absurd' By Norwegian Officials",
    "description": "Political figures in Norway like, Kirsti Bergstø, Trygve Slagsvold Vedum, and Raymond Johansen have all criticized Machado's decision to give Trump the Nobel peace prize medal.",
    "link": "https://www.ibtimes.com/trumps-acceptance-nobel-medal-maria-machado-called-absurd-norwegian-officials-3795551",
    "timestamp": "2026-01-16T20:03:54Z"
  },
  {
    "title": "Trump megadonor’s firm gets first Venezuelan oil deal – FT",
    "description": "Commodity trader Vitol will begin selling crude seized by the US following an attack on Venezuela earlier this month Read Full Article at RT.com",
    "link": "https://www.rt.com/business/631054-us-sells-seized-venezuelan-oil/",
    "timestamp": "2026-01-16T20:03:11Z"
  },
  {
    "title": "Donald Trump says he wants Fed chair contender Kevin Hassett to stay in White House job (Financial Times)",
    "description": "Financial Times:\nDonald Trump says he wants Fed chair contender Kevin Hassett to stay in White House job  —  US president says moving National Economic Council director to central bank would be a ‘serious concern for me’  —  Donald Trump has played down the c…",
    "link": "https://www.memeorandum.com/260116/p91",
    "timestamp": "2026-01-16T20:01:26Z"
  },
  {
    "title": "Bitcoin Price Will Still Rally Above $99,000 Despite Bearish Sentiment, Here’s Why",
    "description": "Crypto analyst TARA has predicted that the Bitcoin price will still rally despite bearish signals that have surfaced. She highlighted why the flagship crypto could reach this level and what could happen once it touches the price target.  Analyst Predicts Bitc…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-will-rally-above-99000/",
    "timestamp": "2026-01-16T20:00:48Z"
  },
  {
    "title": "Venezuela opposition leader Machado cautions Trump admin on dealing with Maduro's cronies amid transition plan",
    "description": "Venezuelan opposition leader warns Trump administration that interim president Rodriguez represents U.S. adversaries rather than the Venezuelan people.",
    "link": "https://www.foxnews.com/politics/venezuela-opposition-leader-machado-cautions-trump-admin-dealing-maduros-cronies-amid-transition-plan",
    "timestamp": "2026-01-16T20:00:48Z"
  },
  {
    "title": "Report: Iranian Regime to Extend Internet Blackout For Two More Months as Deadly Crackdown Continues",
    "description": "\"Around 20,000 protesters arrested by Iranian authorities, NGO says.\"\nThe post Report: Iranian Regime to Extend Internet Blackout For Two More Months as Deadly Crackdown Continues first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/report-iranian-regime-to-extend-internet-blackout-for-two-more-months-as-deadly-crackdown-continues/",
    "timestamp": "2026-01-16T20:00:15Z"
  },
  {
    "title": "OpenAI has committed billions to recent chip deals. Some big names have been left out",
    "description": "OpenAI has inked multibillion-dollar deals with AI chipmakers including Nvidia, AMD, Broadcom and Cerebras.",
    "link": "https://www.cnbc.com/2026/01/16/openai-chip-deal-with-cerebras-adds-to-roster-of-nvidia-amd-broadcom.html",
    "timestamp": "2026-01-16T20:00:01Z"
  },
  {
    "title": "Bravo Reserve Bank Governor Anna Breman, but where’s Christopher Luxon as Donald Trump wreaks havoc? – Fran O’Sullivan",
    "description": "OPINION: The Government has yet to stand up for what NZ believes is important.",
    "link": "https://www.nzherald.co.nz/business/economy/bravo-reserve-bank-governor-anna-breman-but-wheres-christopher-luxon-as-donald-trump-wreaks-havoc-fran-osullivan/premium/SRFKZIEHAVBI3NEYR3QRVTRE5Y/",
    "timestamp": "2026-01-16T20:00:00Z"
  },
  {
    "title": "Three States You Need To Watch in 2026",
    "description": "This year’s midterm elections could decide the balance of power in Washington, as well as the ideological direction of the Democratic and Republican parties Swing... Read More\nThe post Three States You Need To Watch in 2026 appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/01/16/three-states-you-need-to-be-watching-in-2026/",
    "timestamp": "2026-01-16T20:00:00Z"
  },
  {
    "title": "Trump is waffling on Iran strikes. Here are four possible reasons why.",
    "description": "Is help really “on its way” for Iran’s protesters? That’s what President Donald Trump promised in a Truth Social post earlier this week, adding that “Iranians Patriots” should “KEEP PROTESTING – TAKE OVER YOUR INSTITUTIONS!!!” Trump first threatened that the …",
    "link": "https://www.vox.com/politics/475486/trump-iran-intervention-syria-libya-iraq",
    "timestamp": "2026-01-16T19:59:06Z"
  },
  {
    "title": "Trump says he wants to keep Hassett in White House, clouding Fed chair selection",
    "description": "President Donald Trump on Friday said he would like to keep his top economic adviser, Kevin Hassett, at the White House rather than potentially nominate him to replace Jerome Powell as chair of the Federal Reserve",
    "link": "https://abcnews.go.com/Business/wireStory/trump-hassett-white-house-clouding-fed-chair-selection-129290699",
    "timestamp": "2026-01-16T19:57:47Z"
  },
  {
    "title": "‘Loud, disruptive and joyous’: Antifa-linked website posts plans to harass ICE agent at his Portland home",
    "description": "'It’s time to take the battle to the actual people responsible for kidnapping, disappearing, and shooting our neighbors'",
    "link": "https://www.wnd.com/2026/01/loud-disruptive-joyous-antifa-linked-website-posts-plans/",
    "timestamp": "2026-01-16T19:57:34Z"
  },
  {
    "title": "Trump says he could impose tariffs on countries that oppose his goal of acquiring Greenland (Rebecca Shabad/NBC News)",
    "description": "Rebecca Shabad / NBC News:\nTrump says he could impose tariffs on countries that oppose his goal of acquiring Greenland  —  Officials from Greenland and Denmark, which controls the semi-autonomous territory, as well as a host of major U.S. allies, have rejecte…",
    "link": "https://www.memeorandum.com/260116/p86",
    "timestamp": "2026-01-16T19:55:01Z"
  },
  {
    "title": "Extreme makeovers: Federal Reserve vs. White House renovations (Dareh Gregorian/NBC News)",
    "description": "Dareh Gregorian / NBC News:\nExtreme makeovers: Federal Reserve vs. White House renovations  —  Both President Donald Trump and Federal Reserve Chair Jerome Powell are involved in controversial — and costly — rehabs of government buildings.  — Add NBC News to …",
    "link": "https://www.memeorandum.com/260116/p87",
    "timestamp": "2026-01-16T19:55:01Z"
  },
  {
    "title": "Putin talks to Iranian president",
    "description": "Russian President Vladimir Putin has phoned his Iranian counterpart, Masoud Pezeshkian, amid mass protests in the Islamic Republic Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/631055-putin-iran-president-phone-call-protests/",
    "timestamp": "2026-01-16T19:54:09Z"
  },
  {
    "title": "Omar, Minneapolis mayor accuse Trump admin of unleashing 'political retribution,' 'invasion' with ICE activity",
    "description": "Democrats are speaking out Friday against the Trump administration's immigration enforcement activity in Minnesota following the shooting of Renee Nicole Good.",
    "link": "https://www.foxnews.com/politics/omar-minneapolis-mayor-accuse-trump-admin-unleashing-political-retribution-invasion-ice-activity",
    "timestamp": "2026-01-16T19:53:58Z"
  },
  {
    "title": "White House economic advisor floats idea of 'Trump cards’ amid credit card battle with banks - CNBC",
    "description": "White House economic advisor floats idea of 'Trump cards’ amid credit card battle with banksCNBC Trump’s affordability pledge strikes directly at the heart of Wall Street’s profit engineCNN Anthony Scaramucci thinks Trump's 'hard-left' move to cap credit-card…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180602212",
    "timestamp": "2026-01-16T19:52:45Z"
  },
  {
    "title": "Trump Threatens Tariffs on Any Nation That Opposes US Efforts to Conquer Greenland",
    "description": "President Donald Trump on Friday suggested that he would expand his legally contested and costly tariff regime to target any countries that don't support his plan to conquer Greenland, a self-governing Danish territory opposed to a US takeover. While he was s…",
    "link": "https://www.commondreams.org/news/trump-greenland-tariffs",
    "timestamp": "2026-01-16T19:52:22Z"
  },
  {
    "title": "US says Canada will regret decision to allow Chinese EVs into their market",
    "description": "US comments came in response to deal by Canada PM Carney to allow 49,000 EVs into Canada at 15% tariff, down from 100%.",
    "link": "https://www.aljazeera.com/economy/2026/1/16/us-says-canada-will-regret-decision-to-allow-chinese-evs-into-their-market",
    "timestamp": "2026-01-16T19:51:13Z"
  },
  {
    "title": "Legendary basketball coach Bruce Pearl slams anti-Israel college protesters going silent on Iran",
    "description": "On the \"Ruthless\" podcast, former Auburn Tigers basketball coach Bruce Pearl slammed college protesters for going silent on the unrest in Iran after expressing outrage towards Israel.",
    "link": "https://www.foxnews.com/media/legendary-basketball-coach-bruce-pearl-slams-anti-israel-college-protesters-going-silent-iran",
    "timestamp": "2026-01-16T19:50:58Z"
  },
  {
    "title": "Jerome Powell’s Thankless Rescue of Trump",
    "description": "The Fed chair has saved Trump from his worst instincts but failed to do so for Biden.",
    "link": "https://www.theatlantic.com/ideas/2026/01/jerome-powell-fed-trump-thankless/685653/",
    "timestamp": "2026-01-16T19:50:54Z"
  },
  {
    "title": "Arizona Senator Shares Harshest Criticism Yet of Trump's Greenland Aspirations: 'Being an Idiot'",
    "description": "Arizona Sen. Ruben Gallego slammed President Donald Trump over his push to take over Greenland, saying it has \"nothing to do with actual security concerns.\"",
    "link": "https://www.ibtimes.com/arizona-senator-shares-harshest-criticism-yet-trumps-greenland-aspirations-being-idiot-3795550",
    "timestamp": "2026-01-16T19:50:21Z"
  },
  {
    "title": "US officials provide shifting accounts of ICE detainee death in Texas military camp",
    "description": "WASHINGTON, Jan 16 (Reuters) - U.S. immigration ‌officials on Friday provided a new but incomplete account of an immigrant detainee's death in Texas ‌after a report emerged suggesting it may have been homicide. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/17/us-officials-provide-shifting-accounts-of-ice-detainee-death-in-texas-military-camp",
    "timestamp": "2026-01-16T19:48:00Z"
  },
  {
    "title": "Blue state takes big step to pass revenge map against Trump-backed election-rigging scheme",
    "description": "Democrats in Virginia just took a big step in their plan to retaliate against mid-decade Republican gerrymanders enacted last year on President Donald Trump's orders.According to Politico, \"The Democrat-dominated Virginia Senate passed a constitutional amendm…",
    "link": "https://www.rawstory.com/virginia-gerrymandering-2674902808/",
    "timestamp": "2026-01-16T19:47:56Z"
  },
  {
    "title": "Trump’s Fateful Choice in Iran",
    "description": "Taking military action is risky. Falsely encouraging freedom fighters would be shameful.",
    "link": "https://www.theatlantic.com/international/2026/01/trump-iran-protests-irgc-khamenei/685648/",
    "timestamp": "2026-01-16T19:47:11Z"
  },
  {
    "title": "The Left Is So Desperate to Defend Their Minneapolis Narrative, They’ve Hit a New Low",
    "description": "The Democrats are desperate to maintain the narrative that Renee Good was an innocent woman gunned down by a fascist ICE agent. We all know it's not true, and we've all seen the multiple videos from different angles showing Good hit that ICE agent with her ve…",
    "link": "https://freerepublic.com/focus/f-news/4362488/posts",
    "timestamp": "2026-01-16T19:46:27Z"
  },
  {
    "title": "Emergency calls reveal chaos after Minneapolis ICE shooting as city braces for more unrest",
    "description": "By Brad Brooks, Joseph Ax and Renee HickmanMINNEAPOLIS, Jan 16 (Reuters) - Newly released transcripts of 911 calls and emergency dispatch records detail the chaotic and d… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/16/emergency-calls-reveal-chaos-after-minneapolis-ice-shooting-as-city-braces-for-more-unrest",
    "timestamp": "2026-01-16T19:45:40Z"
  },
  {
    "title": "Venezuela on Screen",
    "description": "From a contemplative documentary to a swashbuckling biopic, these films lend a sense of humanity to the present crisis.",
    "link": "http://foreignpolicy.com/2026/01/16/venezuela-movies-nicolas-maduro-donald-trump-documentary-biopic-review-simon-bolivar-films/",
    "timestamp": "2026-01-16T19:45:25Z"
  },
  {
    "title": "Affordability, rural health care among 2026 priorities for House, Speaker Hall says",
    "description": "Republican House Speaker Matt Hall said affordability is going to be the focus for the Michigan House in 2026, with healthcare costs key.",
    "link": "https://www.mlive.com/politics/2026/01/affordability-rural-health-care-among-2026-priorities-for-house-speaker-hall-says.html",
    "timestamp": "2026-01-16T19:45:10Z"
  },
  {
    "title": "Trump Has An Unpopular New Message For Americans",
    "description": "In the week and a half since Renee Good’s killing, the Trump administration has committed itself to a sinister new philosophy in Minneapolis.",
    "link": "https://www.huffpost.com/entry/renee-good-trump-ice-opinion_n_696a6aafe4b0eee204af38b4",
    "timestamp": "2026-01-16T19:42:42Z"
  },
  {
    "title": "Trump pardons former Puerto Rican Gov. Wanda Vázquez Garced",
    "description": "WASHINGTON — President Donald Trump pardoned former Puerto Rican Gov.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-pardons-former-puerto-rican-gov-wanda-vazquez-garced-rcna254457",
    "timestamp": "2026-01-16T19:39:01Z"
  },
  {
    "title": "Trump offers to restart mediation between Egypt and Ethiopia on Nile River water sharing",
    "description": "Jan 16 (Reuters) - The United States is ready to restart mediation between Egypt and Ethiopia to help resolve the issue of Nile River water sharing, President Donald Trum… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/16/trump-offers-to-restart-mediation-between-egypt-and-ethiopia-on-nile-river-water-sharing",
    "timestamp": "2026-01-16T19:38:03Z"
  },
  {
    "title": "Scott Jennings Mocked For 'F**king Stupid' Take On Tim Walz Statement About Minnesota",
    "description": "The conservative commentator delivered what critics called an \"unfathomably\" dumb misreading of Gov. Tim Walz's clear call for peace in Minnesota.",
    "link": "https://www.huffpost.com/entry/scott-jennings-mocked-take-tim-walz-statement-minnesota_n_696a4f62e4b0eee204af1e34",
    "timestamp": "2026-01-16T19:37:43Z"
  },
  {
    "title": "Palestinian committee set to govern Gaza under U.S. supervision meets in Cairo",
    "description": "The Palestinian committee set to govern Gaza under U.S. supervision met for the first time Friday in Cairo, as its leader pledged to get to work quickly to improve conditions there.",
    "link": "https://www.cbc.ca/news/world/gaza-palestinian-committee-trump-west-bank-9.7048942",
    "timestamp": "2026-01-16T19:36:29Z"
  },
  {
    "title": "US may punish nations resisting Greenland plan, says Trump",
    "description": "Indigenous Inuit leaders criticised the White House for treating Greenland as an asset rather than a people, warning that such rhetoric undermines international norms and disregards the sovereignty and rights of Indigenous populations.",
    "link": "https://www.thehindubusinessline.com/news/world/us-may-punish-nations-resisting-greenland-plan-says-trump/article70516400.ece",
    "timestamp": "2026-01-16T19:35:11Z"
  }
]