[
  {
    "title": "Erasure of Rainbow Memorial for Pulse Shooting Victims Raises Alarm in Florida",
    "description": "State Senator Carlos Guillermo Smith called the state’s reported paving over of the street crossing a “disgusting betrayal.”",
    "link": "http://hyperallergic.com/1036280/erasure-of-rainbow-memorial-for-pulse-shooting-victims-raises-alarm-in-florida/",
    "timestamp": "2025-08-22T15:52:19Z"
  },
  {
    "title": "After joining TikTok, Trump says he could extend sale deadline if needed",
    "description": "President Trump indicated potential U.S. buyers are interested in acquiring TikTok, suggesting a possible extension to ByteDance's divestiture deadline. Despite bipartisan security concerns, Trump downplayed the risks associated with the app, stating his admi…",
    "link": "https://economictimes.indiatimes.com/tech/technology/after-joining-tiktok-trump-says-he-could-extend-sale-deadline-if-needed/articleshow/123457993.cms",
    "timestamp": "2025-08-22T15:51:30Z"
  },
  {
    "title": "Fed Chair Jerome Powell talks inflation, employment, no firm rate cut details",
    "description": "Federal Reserve Chairman Jerome Powell on Friday did not give a clear indication of the central bank's plans to possibly cut interest rates amid pressure...",
    "link": "https://www.upi.com/Top_News/US/2025/08/22/Powell-Fed-speech-Trump-interest-rates-inflation-tariff/1451755870925/",
    "timestamp": "2025-08-22T15:50:38Z"
  },
  {
    "title": "Laura Loomer Isn’t Just Getting People Fired. She’s Setting Policy.",
    "description": "Far-right influencer Laura Loomer complained to State Secretary Marco Rubio about U.S. support for injured Gazan children. Then, the aid stopped.The self-appointed “loyalty enforcer” has had enormous success influencing the Trump administration from the safet…",
    "link": "https://newrepublic.com/post/199463/laura-loomer-setting-policy-palestine-visas-children",
    "timestamp": "2025-08-22T15:50:18Z"
  },
  {
    "title": "Trump–Bolton feud back in focus after FBI raid: 'Never had a clue … what a dope!'",
    "description": "FBI conducts raid on former National Security Advisor John Bolton's home following years of disputes with Trump following Bolton's departure from Trump's first administration.",
    "link": "https://www.foxnews.com/politics/trump-bolton-feud-back-focus-after-fbi-raid-never-had-clue-what-dope",
    "timestamp": "2025-08-22T15:47:08Z"
  },
  {
    "title": "Canada to drop many retaliatory tariffs in olive branch to Trump",
    "description": "After meeting with his cabinet, Carney said at a news conference Friday that the decision will take effect on Sept. 1, 2025.",
    "link": "https://torontosun.com/news/national/canada-to-drop-many-retaliatory-tariffs-in-olive-branch-to-trump",
    "timestamp": "2025-08-22T15:46:36Z"
  },
  {
    "title": "US Fed Reserve Chair Powell opens door to September rate cut",
    "description": "Powell's remarks offered little guidance about how soon or how quickly rates might continue to move lower.",
    "link": "https://www.aljazeera.com/economy/2025/8/22/us-fed-reserve-chair-powell-opens-door-to-september-rate-cut",
    "timestamp": "2025-08-22T15:46:27Z"
  },
  {
    "title": "Newsom Announces 'Very Important' International Partnership: What to Know",
    "description": "Newsom's office made the announcement on X in all caps, seemingly continuing to mock and mimic President Donald Trump.",
    "link": "https://biztoc.com/x/86a65943d74d7fa4",
    "timestamp": "2025-08-22T15:46:24Z"
  },
  {
    "title": "Russia trying to stop meeting on peace and prolong war, says Zelensky",
    "description": "Volodymyr Zelensky urges Western allies to impose fresh sanctions on Moscow if it shows no interest in peace.",
    "link": "https://www.bbc.com/news/articles/ckgjpmg4r23o",
    "timestamp": "2025-08-22T15:46:22Z"
  },
  {
    "title": "Trump’s Nobel Delusions",
    "description": "US President Donald Trump appears to find it unbearable that Barack Obama has a Nobel Peace Prize and he does not. But whereas Obama’s was premature, coming just months after he took office, Trump’s would be parodic, turning the Peace Prize into a punchline.",
    "link": "https://www.project-syndicate.org/commentary/trump-nobel-peace-prize-ambition-is-delusional-by-nina-l-khrushcheva-2025-08",
    "timestamp": "2025-08-22T15:46:14Z"
  },
  {
    "title": "FBI Raids Home of Trump Critic Bolton Over Documents Probe",
    "description": "FBI agents searched the home of John Bolton, President Donald Trump’s former national security adviser, in a sign that the White House is stepping up a campaign of retribution against some of its fiercest critics.\nThe search is linked to an inquiry into wheth…",
    "link": "https://biztoc.com/x/83a9c899c2fc322d",
    "timestamp": "2025-08-22T15:46:05Z"
  },
  {
    "title": "WATCH LIVE: Trump delivers remarks after Powell speech on interest rates",
    "description": "In a high-profile speech closely watched at the White House and on Wall Street, Powell said that there are risks of both rising unemployment and stubbornly higher inflation. Yet he suggested that with hiring sluggish, the job market could weaken further.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-delivers-remarks-after-powell-speech-on-interest-rates",
    "timestamp": "2025-08-22T15:45:35Z"
  },
  {
    "title": "SNL 51 Announcements \"In a Week or So\"; Johnson Returning as Trump",
    "description": "We know that NBC's Saturday Night Live will be kicking off Season 51 on Saturday, October 4th. Other than that? Well, that's about it. But it looks like that could be coming to an end based on what SNL EP Lorne Michaels had to share. During an interview with …",
    "link": "https://bleedingcool.com/tv/snl-51-announcements-in-a-week-or-so-johnson-returning-as-trump/",
    "timestamp": "2025-08-22T15:45:05Z"
  },
  {
    "title": "Debunking claim Newsom's press office responded to Bed Bath & Beyond post with expletive",
    "description": "Screenshot authentically shows an X post from California Gov. Gavin Newsom’s press office using an expletive followed by “BYE” in response to Bed Bath & Beyond’s announcement they won't open stores in the state.",
    "link": "https://www.snopes.com//fact-check/newsom-bed-bath-beyond-post/",
    "timestamp": "2025-08-22T15:45:00Z"
  },
  {
    "title": "'You cannot ignore this, America': Experts warn citizens about Trump admin's latest move",
    "description": "Social media users reacted to the early morning FBI raid on former national security adviser John Bolton's home.Federal agents searched the Bethesda, Maryland, home of the prominent critic of President Donald Trump around 7 a.m., while Bolton was away, as par…",
    "link": "https://www.rawstory.com/donald-trump-fascist-2673910912/",
    "timestamp": "2025-08-22T15:42:47Z"
  },
  {
    "title": "Social Security Update: Trump Official Hypes Major Changes",
    "description": "The SSA framed a visit as evidence that operational changes had produced measurable reductions in phone and office wait times.",
    "link": "https://www.newsweek.com/social-security-update-trump-official-hypes-major-changes-2117768",
    "timestamp": "2025-08-22T15:41:37Z"
  },
  {
    "title": "European Carriers Limit Shipping to US, Citing Tariff-Related Customs Regulations",
    "description": "German carriers Deutsche Post and DHL Parcel Germany will stop some shipments to the United States after Friday (Aug. 22) due to new U.S. customs regulations implemented in response to an executive order suspending the de minimis exemption. They join other Eu…",
    "link": "http://www.pymnts.com/shipping/2025/european-carriers-limit-shipping-to-us-citing-tariff-related-customs-regulations/",
    "timestamp": "2025-08-22T15:40:14Z"
  },
  {
    "title": "Fly Burevestnik Fly!",
    "description": "The Slack channel noticed that Russia was gearing up to test the SSC-X-9 Skyfall nuclear-powered cruise missile (aka Burevestnik), which Jeffrey and co. confirmed with satellite images. Reuters picked it up, noting how awkward all this was coming, as it did, …",
    "link": "https://www.armscontrolwonk.com/archive/1220748/fly-burevestnik-fly/",
    "timestamp": "2025-08-22T15:38:50Z"
  },
  {
    "title": "One of the Most Damning Books Ever About a British Royal Is Roiling the U.K. I Can See Why.",
    "description": "How many people are willing to dish the dirt on a royal despite that not being “the done thing”? Many, it turns out.",
    "link": "https://slate.com/culture/2025/08/royal-family-harry-meghan-william-andrew-entitled-book.html",
    "timestamp": "2025-08-22T15:38:17Z"
  },
  {
    "title": "Newsom Announces 'Very Important' International Partnership: What to Know",
    "description": "Newsom's office made the announcement on X in all caps, seemingly continuing to mock and mimic President Donald Trump.",
    "link": "https://www.newsweek.com/gavin-newsom-california-donald-trump-denmark-climate-troll-2117856",
    "timestamp": "2025-08-22T15:38:08Z"
  },
  {
    "title": "Brady United chooses DC criminals, politicians",
    "description": "It is said Donald Trump has a near-magical ability to make Democrats do insanely self-destructive things. They’re doing it to themselves. Trump doesn’t have to apply clumsy reverse psychology, their self-imposed Trump Derangement Syndrome and their raging hat…",
    "link": "https://freerepublic.com/focus/f-news/4336101/posts",
    "timestamp": "2025-08-22T15:37:51Z"
  },
  {
    "title": "Is Africa becoming the dumping ground for deported migrants from the US?",
    "description": "Uganda is now the lastest African country accepting a deal with the US government to take in unwanted migrants, joining Eswatini, South Sudan and Rwanda. Others might yet follow. But what's in it for African governments?",
    "link": "https://www.dw.com/en/is-africa-becoming-the-dumping-ground-for-deported-migrants-from-the-us/a-73729159",
    "timestamp": "2025-08-22T15:37:00Z"
  },
  {
    "title": "Is Africa becoming the US dumping ground for migrants?",
    "description": "Uganda is the latest African country to accept a deal with the US government to take in unwanted migrants, joining Eswatini, South Sudan and Rwanda. Others might yet follow. But what's in it for African governments?",
    "link": "https://www.dw.com/en/is-africa-becoming-the-us-dumping-ground-for-migrants/a-73729159",
    "timestamp": "2025-08-22T15:37:00Z"
  },
  {
    "title": "German, French Post Offices Restrict Packages To US Over Tariffs",
    "description": "The postal services of Germany and France on Friday announced a raft of restrictions on package deliveries to the United States due to tariffs imposed by President Donald Trump.",
    "link": "https://www.ibtimes.com/german-french-post-offices-restrict-packages-us-over-tariffs-3781469",
    "timestamp": "2025-08-22T15:36:19Z"
  },
  {
    "title": "Russia Launches India Charm Offensive as US Relations Sour",
    "description": "It comes as U.S. President Donald Trump imposed an additional 25 percent tariff on India for buying Russian oil.",
    "link": "https://biztoc.com/x/e8995face4b12748",
    "timestamp": "2025-08-22T15:34:55Z"
  },
  {
    "title": "National Guard members on DC streets for Trump’s crackdown will soon be armed, Pentagon says",
    "description": "Defense Secretary Pete Hegseth has ordered National Guard troops patrolling the streets of Washington be armed.",
    "link": "https://www.denverpost.com/2025/08/22/hegseth-dc-guard-members-armed/",
    "timestamp": "2025-08-22T15:32:26Z"
  },
  {
    "title": "National Guard members on DC streets for Trump’s crackdown will soon be armed, Pentagon says",
    "description": "Defense Secretary Pete Hegseth has ordered National Guard troops patrolling the streets of Washington be armed.",
    "link": "https://www.bostonherald.com/2025/08/22/hegseth-dc-guard-members-armed/",
    "timestamp": "2025-08-22T15:32:26Z"
  },
  {
    "title": "German, French post offices restrict packages to US over tariffs",
    "description": "The postal services of Germany and France on Friday announced a raft of restrictions on package deliveries to the United States due to tariffs imposed by President Donald Trump. DHL, which owns the Deutsche Post service, said that from Saturday it would “temp…",
    "link": "https://www.digitaljournal.com/world/german-french-post-offices-restrict-packages-to-us-over-tariffs/article",
    "timestamp": "2025-08-22T15:32:22Z"
  },
  {
    "title": "Russia rejects Zelensky meeting as diplomatic tension simmers",
    "description": "Russia Friday ruled out an immediate meeting with Volodymyr Zelensky, as diplomatic tension escalated with the Ukrainian president and US mediation efforts appeared to stumble.  Russian Foreign Minister Sergei Lavrov said “no meeting” between Vladimir Putin a…",
    "link": "https://www.digitaljournal.com/world/russia-rejects-zelensky-meeting-as-diplomatic-tension-simmers/article",
    "timestamp": "2025-08-22T15:32:22Z"
  },
  {
    "title": "FBI raids home of outspoken Trump critic John Bolton",
    "description": "FBI agents raided the home on Friday of one of US President Donald Trump’s most outspoken critics, his former national security adviser John Bolton. Trump, asked about the early morning FBI search of Bolton’s home, said he was “not a fan” of his former aide b…",
    "link": "https://www.digitaljournal.com/world/fbi-raids-home-of-outspoken-trump-critic-john-bolton/article",
    "timestamp": "2025-08-22T15:32:22Z"
  },
  {
    "title": "Attack On The Smithsonian Is A Threat To Our History",
    "description": "This is not simply a disagreement over museum curation; it’s a dangerous and calculated attempt to whitewash our history, silence uncomfortable truths, and undermine the very institutions we trust to preserve and interpret our collective past. – The Contrarian",
    "link": "https://contrarian.substack.com/p/a-nations-memory-is-not-a-political",
    "timestamp": "2025-08-22T15:31:00Z"
  },
  {
    "title": "Why gold may be losing its shine as a safe-haven investment",
    "description": "Gold is no longer the hedge against stock market dips that it once was.",
    "link": "https://theconversation.com/why-gold-may-be-losing-its-shine-as-a-safe-haven-investment-263694",
    "timestamp": "2025-08-22T15:30:39Z"
  },
  {
    "title": "Kentucky Official Claims JPMorgan CEO Threatened to Oust Her from Office",
    "description": "Allison Ball told conservatives that Jamie Dimon made the threat over her effort to blacklist his bank. JPMorgan calls her account “entirely false”",
    "link": "http://www.rollingstone.com/politics/politics-features/jamie-dimon-jpmorgan-kentucky-allison-ball-bank-1235413911/",
    "timestamp": "2025-08-22T15:30:00Z"
  },
  {
    "title": "Trump’s claim about a $600 billion ‘gift’ from the European Union quietly falls apart",
    "description": "Remember when Donald Trump said the E.U. would give him $600 billion that he could “do anything” he pleases with? That weird boast has now collapsed.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-claim-600-billion-gift-european-union-quietly-falls-apart-rcna226564",
    "timestamp": "2025-08-22T15:29:50Z"
  },
  {
    "title": "House Democrats Launch Investigation into $8 Billion Paramount-Skydance Merger",
    "description": "House Democrats have launched an investigation into the Paramount-Skydance merger, inquiring if the company gave President Donald Trump an \"illegal bribe\" to ensure the FCC approved the $8 billion deal.\nThe post House Democrats Launch Investigation into $8 Bi…",
    "link": "https://www.breitbart.com/entertainment/2025/08/22/house-democrats-launch-investigation-into-paramount-skydance-merger/",
    "timestamp": "2025-08-22T15:29:05Z"
  },
  {
    "title": "Live updates: Colorado lawmakers begin debating moves to limit corporate tax incentives to fill budget hole",
    "description": "The Colorado legislature resumed the special session on the budget shortfall Friday as lawmakers debate the elimination of tax breaks and spending cuts, along with artificial intelligence regulations.",
    "link": "https://www.denverpost.com/2025/08/22/legislature-special-session-budget-taxes-ai/",
    "timestamp": "2025-08-22T15:28:53Z"
  },
  {
    "title": "Poll on Ohio Races Is Already Out, and GOP Has Momentum",
    "description": "Democrat Party hopes for retaking the Senate in next year’s midterms may come down to former Sen. Sherrod Brown, D-Ohio, taking one of the Ohio... Read More\nThe post Poll on Ohio Races Is Already Out, and GOP Has Momentum appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/22/poll-on-ohio-races-is-already-out-and-gop-has-momentum/",
    "timestamp": "2025-08-22T15:28:23Z"
  },
  {
    "title": "Billion-Dollar Rail Companies Want Less Safety Checks. What Could Go Wrong?",
    "description": "Rail lobbyists representing giants like Union Pacific and Norfolk Southern want to automate track inspections. Why? It would bring rail carriers more profits. Critics warn this would undermine safety—or even cause a repeat of what happened in East Palestine.",
    "link": "https://freerepublic.com/focus/f-chat/4336100/posts",
    "timestamp": "2025-08-22T15:27:30Z"
  },
  {
    "title": "Russia Launches India Charm Offensive as US Relations Sour",
    "description": "It comes as U.S. President Donald Trump imposed an additional 25 percent tariff on India for buying Russian oil.",
    "link": "https://www.newsweek.com/russia-india-charm-vladimir-putin-donald-trump-2117647",
    "timestamp": "2025-08-22T15:26:57Z"
  },
  {
    "title": "What to Know about John Bolton, former Trump adviser whose home and office are searched by FBI",
    "description": "The former Trump national security adviser whose home and office are being searched by federal agents has been a vocal critic of the Republican president",
    "link": "https://abcnews.go.com/US/wireStory/john-bolton-former-trump-adviser-home-office-searched-124885543",
    "timestamp": "2025-08-22T15:26:56Z"
  },
  {
    "title": "Jasmine Crockett Claims ICE Is Just Supposed To Be a ‘Fancy Uber Driver’ for Illegal Migrants",
    "description": "Jasmine Crockett claimed in an interview with Gavin Newsom that ICE agents are supposed to be glorified \"Uber drivers\" instead of carrying out mass raids.\nThe post Jasmine Crockett Claims ICE Is Just Supposed To Be a ‘Fancy Uber Driver’ for Illegal Migrants f…",
    "link": "https://www.mediaite.com/media/podcasts/jasmine-crockett-claims-ice-is-just-supposed-to-be-a-fancy-uber-driver-for-illegal-migrants/",
    "timestamp": "2025-08-22T15:26:08Z"
  },
  {
    "title": "FBI Raids the Home of John Bolton (Inae Oh/Mother Jones)",
    "description": "Inae Oh / Mother Jones:\nFBI Raids the Home of John Bolton  —  Kash Patel wrote on X, “NO ONE is above the law.”  —  The FBI on Friday raided the Maryland home of John Bolton, who served as national security adviser during President Donald Trump's first term b…",
    "link": "https://www.memeorandum.com/250822/p52",
    "timestamp": "2025-08-22T15:25:01Z"
  },
  {
    "title": "FBI agents search ex-Trump adviser John Bolton's home",
    "description": "Federal Bureau of Investigation agents have searched the home of John Bolton, Donald Trump's former national security adviser, who has become a vocal critic of the US President.",
    "link": "https://www.rte.ie/news/us/2025/0822/1529725-john-bolton-search/",
    "timestamp": "2025-08-22T15:24:05Z"
  },
  {
    "title": "FBI agents search ex-Trump adviser John Bolton's home",
    "description": "Federal Bureau of Investigation agents have searched the home of John Bolton, Donald Trump's former national security advisor, who has become a vocal critic of the US President.",
    "link": "https://www.rte.ie/news/2025/0822/1529725-john-bolton-search/",
    "timestamp": "2025-08-22T15:24:05Z"
  },
  {
    "title": "New York court tosses Trump's $500M fraud fine",
    "description": "What happened\nA fractured New York state appellate court Thursday threw out the roughly $500 million penalty levied on President Donald Trump last year for fraudulently inflating his wealth and property values to obtain favorable loans. Trump claimed a \"total…",
    "link": "https://biztoc.com/x/829e14a0712a281c",
    "timestamp": "2025-08-22T15:24:03Z"
  },
  {
    "title": "French winemakers fear Trump tariffs will hit sales in crucial US market",
    "description": "EPERNAY, France (Reuters) -French wine and spirits producers are bracing for a 15% tariff on their exports to the United States, a crucial market, even as...",
    "link": "https://finance.yahoo.com/news/french-winemakers-fear-trump-tariffs-152352722.html",
    "timestamp": "2025-08-22T15:23:52Z"
  },
  {
    "title": "Dow soars over 700 points after Powell’s Jackson Hole speech, on track to blow past all-time high",
    "description": "Wall Street is rallying on Friday after the head of the Federal Reserve indicated the cuts to interest rates that investors and President Donald Trump have been craving so much may be coming soon, though he gave no clear clue about when.\nThe S&P 500 jumped 1.…",
    "link": "https://biztoc.com/x/10f3980c5163407c",
    "timestamp": "2025-08-22T15:23:38Z"
  },
  {
    "title": "The D Brief: DOD’s drone-warfare plans; ODNI to shrink further; ICE seeks volunteers; Black Hawk upgrades; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/08/the-d-brief-august-22-2025/407632/",
    "timestamp": "2025-08-22T15:21:55Z"
  },
  {
    "title": "Russia Rejects Zelensky Meeting As Diplomatic Tension Simmers",
    "description": "Russia Friday ruled out an immediate meeting with Volodymyr Zelensky, as diplomatic tension escalated with the Ukrainian president and US mediation efforts appeared to stumble.",
    "link": "https://www.ibtimes.com/russia-rejects-zelensky-meeting-diplomatic-tension-simmers-3781466",
    "timestamp": "2025-08-22T15:21:21Z"
  },
  {
    "title": "Embattled Bordeaux Winemakers See Trump's Tariffs As Latest Blow",
    "description": "The sun is shining, the grapes are ripe and a good harvest is expected but a heavy cloud is looming over Laurent Dubois's vineyard in southwestern France.",
    "link": "https://www.ibtimes.com/embattled-bordeaux-winemakers-see-trumps-tariffs-latest-blow-3781463",
    "timestamp": "2025-08-22T15:21:20Z"
  },
  {
    "title": "New Student Loan Guidance For ‘Big, Beautiful Bill’ Provides Updates On Repayment Changes",
    "description": "The Department of Education published new guidance on key changes that are coming for student loan borrowers after passage of the “One, Big, Beautiful Bill.”",
    "link": "https://www.forbes.com/sites/adamminsky/2025/08/22/new-student-loan-guidance-for-big-beautiful-bill-provides-updates-on-repayment-changes/",
    "timestamp": "2025-08-22T15:20:24Z"
  },
  {
    "title": "New York court tosses Trump's $500M fraud fine",
    "description": "A divided appeals court threw out a hefty penalty against President Trump for fraudulently inflating his wealth",
    "link": "https://theweek.com/business/trump-fraud-lawsuit-letitia-james",
    "timestamp": "2025-08-22T15:19:52Z"
  },
  {
    "title": "Canada to drop many retaliatory tariffs in olive branch to Trump, sources say",
    "description": "Canada will remove its retaliatory tariffs on a long list of U.S. products that comply with the existing North American trade deal. Read on",
    "link": "https://financialpost.com/news/economy/canada-to-drop-many-retaliatory-tariffs-sources",
    "timestamp": "2025-08-22T15:19:41Z"
  },
  {
    "title": "Canada to Drop Many Retaliatory Tariffs in Olive Branch to Trump",
    "description": "Canada will remove its retaliatory tariffs on a long list of US products that comply with the existing North American trade deal, seeking to lower tensions with the White House.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-to-drop-many-retaliatory-tariffs-in-olive-branch-to-trump",
    "timestamp": "2025-08-22T15:19:41Z"
  },
  {
    "title": "Latest updates: Carney announces removal of retaliatory tariffs on CUSMA-compliant U.S. goods",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/carney-announces-removal-of-retaliatory-tariffs-on-cusma-compliant-u-s-goods-9.6876782",
    "timestamp": "2025-08-22T15:17:56Z"
  },
  {
    "title": "Embattled Bordeaux winemakers see Trump’s tariffs as latest blow",
    "description": "The sun is shining, the grapes are ripe and a good harvest is expected but a heavy cloud is looming over Laurent Dubois’s vineyard in southwestern France. “It’s not up to me to pay the Trump tax!” he fumes, faced with the 15 percent in customs duties that is …",
    "link": "https://www.digitaljournal.com/business/embattled-bordeaux-winemakers-see-trumps-tariffs-as-latest-blow/article",
    "timestamp": "2025-08-22T15:17:32Z"
  },
  {
    "title": "Trump: Will Fire Fed Governor Lisa Cook If She Does Not Step Down After Allegation of Mortgage Fraud",
    "description": "President Donald Trump on Friday said he will fire Federal Reserve Governor Lisa Cook if she does not resign after she was accused of mortgage fraud. \nThe post Trump: Will Fire Fed Governor Lisa Cook If She Does Not Step Down After Allegation of Mortgage Frau…",
    "link": "https://www.breitbart.com/politics/2025/08/22/trump-will-fire-fed-governor-lisa-cook-if-she-does-not-step-down-after-allegation-of-mortgage-fraud/",
    "timestamp": "2025-08-22T15:16:17Z"
  },
  {
    "title": "Trump’s Racist Haiti Lies Are Killing an Entire Town",
    "description": "It’s been almost a year since President Donald Trump targeted Springfield, Ohio, with racist lies that Haitian immigrants had begun eating their neighbors’ pets in order to stir up his voter base. Now, the city’s Haitian immigrants, who helped revive Springfi…",
    "link": "https://newrepublic.com/post/199460/donald-trump-racist-haiti-lies-springfield-ohio-economy",
    "timestamp": "2025-08-22T15:14:23Z"
  },
  {
    "title": "FBI raids John Bolton’s home in national security probe – media (VIDEO)",
    "description": "Sources claim the operation is part of a high-profile investigation involving classified documents Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623421-bolton-home-raid-fbi/",
    "timestamp": "2025-08-22T15:14:15Z"
  },
  {
    "title": "How California Can Save US Democracy",
    "description": "Now that Donald Trump and his fellow Republicans have gone ahead with their unseemly campaign to gerrymander Texas congressional districts ahead of the 2026 elections, California is pursuing a redistricting of its own. But the principles guiding its efforts a…",
    "link": "https://www.project-syndicate.org/commentary/california-gavin-newsom-redistricting-justified-to-offset-trump-effort-in-texas-by-lenny-mendonca-and-laura-tyson-2025-08",
    "timestamp": "2025-08-22T15:13:59Z"
  },
  {
    "title": "Republicans Are Losing Latino Voters. But Democrats Aren't Winning Them",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSupport for Donald Trump among Latino voters is falling, but Democrats aren't benefiting from the shift. New polling shows a growing number of Latino voters feel politically disillusioned with both parties and…",
    "link": "https://biztoc.com/x/1d4210ea49434f16",
    "timestamp": "2025-08-22T15:13:02Z"
  },
  {
    "title": "Kim Jong-un Calls North Korea ‘the Most Powerful Army in the World’ in Praise of Ukraine War Units",
    "description": "North Korean state media reported on Thursday that communist dictator Kim Jong-un held a special event to honor his commanding officers in charge of North Korean troops aiding the Russian invasion of Ukraine, offering “warm militant encouragement” and applaus…",
    "link": "https://www.breitbart.com/asia/2025/08/22/kim-jong-un-calls-north-korea-the-most-powerful-army-in-the-world-in-praise-of-ukraine-war-units/",
    "timestamp": "2025-08-22T15:12:52Z"
  },
  {
    "title": "Donald Trump Reacts to John Bolton's FBI Home Raid",
    "description": "FBI agents entered Bolton's Bethesda, Maryland home at 7 a.m. Friday, as part of a classified records probe.",
    "link": "https://biztoc.com/x/e7e53294b8067310",
    "timestamp": "2025-08-22T15:12:22Z"
  },
  {
    "title": "Dow soars over 700 points after Powell’s Jackson Hole speech, on track to blow past all-time high",
    "description": "Treasury yields tumbled in the bond market after the release of the text of Powell’s speech.",
    "link": "https://fortune.com/2025/08/22/dow-soars-over-700-points-after-powells-jackson-hole-speech-on-track-to-blow-past-all-time-high/",
    "timestamp": "2025-08-22T15:12:10Z"
  },
  {
    "title": "Moments after Jerome Powell’s latest speech, Trump threatens to fire Fed governor Lisa Cook if she doesn’t resign",
    "description": "Moments after Federal Reserve Chair Jerome Powell’s closely watched speech at the Jackson Hole symposium on Friday, President Donald Trump dramatically escalated his ongoing assault on the central bank’s leadership by threatening to fire Governor Lisa Cook if…",
    "link": "https://biztoc.com/x/ccaa1390cb0b352a",
    "timestamp": "2025-08-22T15:12:07Z"
  },
  {
    "title": "Trump Speaks Out on FBI Raid at ‘Unpatriotic’ John Bolton’s Home: ‘I Could Be the One Starting It’",
    "description": "President Donald Trump claimed that he didn't know about the raid on John Bolton's home on Friday morning, before telling reporters he \"could know about it\" and \"could be the one starting it.\"\nThe post Trump Speaks Out on FBI Raid at ‘Unpatriotic’ John Bolton…",
    "link": "https://www.mediaite.com/media/news/trump-speaks-out-on-fbi-raid-at-unpatriotic-john-boltons-home-i-could-be-the-one-starting-it/",
    "timestamp": "2025-08-22T15:11:52Z"
  },
  {
    "title": "Pennsylvania bill could jail officials who hold crypto after 90 days",
    "description": "Pennsylvania lawmaker Ben Waxman, a Democrat, has introduced a bill that would prevent public officials from owning or transacting in digital assets while in office. The proposal, known as the House Bill 1812 (HB1812), aims to amend the state’s ethics and fin…",
    "link": "https://cryptoslate.com/pennsylvania-bill-could-jail-officials-who-hold-crypto-after-90-days/",
    "timestamp": "2025-08-22T15:11:17Z"
  },
  {
    "title": "Russia’s Lavrov says agenda ‘not ready at all’ for Putin-Zelenskyy summit",
    "description": "Russia's top diplomat Sergey Lavrov accuses Ukrainian President Zelenskyy of saying 'no to everything'.",
    "link": "https://www.aljazeera.com/news/2025/8/22/russias-lavrov-says-agenda-not-ready-at-all-for-putin-zelenskyy-summit",
    "timestamp": "2025-08-22T15:11:10Z"
  },
  {
    "title": "Trump’s intel chief freezes out Five Eyes allies on Ukraine",
    "description": "The intelligence alliance of the U.K., Canada, Australia and New Zealand as well as the U.S. is one of the closest in the world.",
    "link": "https://www.politico.eu/article/tulsi-gabbard-freeze-five-eyes-allies-on-ukraine-intel/",
    "timestamp": "2025-08-22T15:10:52Z"
  },
  {
    "title": "It Took CNN Merely Minutes To Trot Out Disgraced Former FBI Official To Whine About John Bolton Raid",
    "description": "CNN had former FBI Deputy Director Michael McCabe on air less than an hour after the home of former National Security Advisor John Bolton was raided by the FBI.",
    "link": "https://dailycaller.com/2025/08/22/cnn-andrew-mccabe-whine-john-bolton-raid/",
    "timestamp": "2025-08-22T15:09:52Z"
  },
  {
    "title": "Judge: Trump's US attorney in NJ serving unlawfully",
    "description": "The appointment of Trump's former personal defense lawyer, Alina Habba, as acting US attorney in New Jersey was ruled 'unlawful'",
    "link": "https://theweek.com/politics/alina-habba-trump-new-jersey-us-attorney-ruling",
    "timestamp": "2025-08-22T15:09:26Z"
  },
  {
    "title": "Jerome Powell Signals Fed May Soon Cut Interest Rates",
    "description": "Federal Reserve Chair Jerome Powell on Friday signaled that the central bank could potentially cut interest rates soon.",
    "link": "https://dailycaller.com/2025/08/22/jerome-powell-federal-reserve-interest-rates-jackson-hole/",
    "timestamp": "2025-08-22T15:09:22Z"
  },
  {
    "title": "Three killed in blue-city shootings as Trump threatens to expand federal crime crackdown",
    "description": "Overnight shootings leave three dead in Chicago as Trump discusses expanding federal law enforcement to crime-ridden cities across America.",
    "link": "https://www.foxnews.com/us/three-killed-blue-city-shootings-trump-threatens-expand-federal-crime-crackdown",
    "timestamp": "2025-08-22T15:07:02Z"
  },
  {
    "title": "What Is the Democrat Alternative to Trump?",
    "description": "The Pavlovian Left goes berserk at the mere prospect of each new Trump initiative. Its escalating reactive venom and hysteria are calibrated to the success... Read More\nThe post What Is the Democrat Alternative to Trump? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/22/what-is-democrat-alternative-trump/",
    "timestamp": "2025-08-22T15:06:52Z"
  },
  {
    "title": "Republicans Are Losing Latino Voters. But Democrats Aren't Winning Them.",
    "description": "A demographic that shifted toward Trump in 2024 now appears up for grabs heading into the midterms.",
    "link": "https://www.newsweek.com/latino-voters-trump-republicans-democrats-2026-midterms-2117379",
    "timestamp": "2025-08-22T15:05:28Z"
  },
  {
    "title": "Gaza City gripped by famine as UN chief says ‘food stacks up at borders because of systematic obstruction by Israel’",
    "description": "Gaza City and surrounding areas are officially suffering from famine, and it will likely spread, a global hunger monitor determined on Friday, an assessment that will escalate pressure on Israel to allow more aid into the Palestinian territory.",
    "link": "https://www.independent.ie/world-news/middle-east/gaza-city-gripped-by-famine-as-un-chief-says-food-stacks-up-at-borders-because-of-systematic-obstruction-by-israel/a1883501659.html",
    "timestamp": "2025-08-22T15:05:00Z"
  },
  {
    "title": "FBI searches home of Trump adviser-turned-critic John Bolton",
    "description": "Agents and police vehicles have been seen at Bolton's home in the Washington DC suburb of Bethesda, Maryland.",
    "link": "https://www.bbc.com/news/live/cr5vv3mrpndt?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-22T15:04:38Z"
  },
  {
    "title": "FBI Raids Home Of Outspoken Trump Critic John Bolton",
    "description": "FBI agents raided the home on Friday of one of US President Donald Trump's most outspoken critics, his former national security adviser John Bolton.",
    "link": "https://www.ibtimes.com/fbi-raids-home-outspoken-trump-critic-john-bolton-3781460",
    "timestamp": "2025-08-22T15:03:17Z"
  },
  {
    "title": "Donald Trump Reacts to John Bolton's FBI Home Raid",
    "description": "FBI agents entered Bolton's Bethesda, Maryland home at 7 a.m. Friday, as part of a classified records probe.",
    "link": "https://www.newsweek.com/donald-trump-john-bolton-fbi-raid-2117829",
    "timestamp": "2025-08-22T15:02:05Z"
  },
  {
    "title": "John Bolton Warned Days Ago Trump Was Coming After Him: ‘The Retribution Presidency’",
    "description": "Bolton warned earlier in the month that Trump was coming for him when asked about being on FBI Director Kash Patel’s “enemies list” by Jonathan Karl.\nThe post John Bolton Warned Days Ago Trump Was Coming After Him: ‘The Retribution Presidency’ first appeared …",
    "link": "https://www.mediaite.com/politics/john-bolton-warned-days-ago-trump-was-coming-after-him-the-retribution-presidency/",
    "timestamp": "2025-08-22T15:02:04Z"
  },
  {
    "title": "'Devastated': Outraged residents hit back as Trump orders LGBTQ shooting tribute erased",
    "description": "Republican Florida Gov. Ron DeSantis\r\n, following a directive from US President Donald Trump's administration, painted over a rainbow crosswalk in Orlando that for years had served as a memorial to the victims of the 2016 massacre at Pulse, a local LGBTQ+ nig…",
    "link": "https://www.rawstory.com/devastated-outraged-residents-hit-back-as-trump-orders-lgbtq-shooting-tribute-erased/",
    "timestamp": "2025-08-22T15:02:03Z"
  },
  {
    "title": "Lorne Michaels Confirms Cast Shake-Ups Coming to Saturday Night Live",
    "description": "He added that casting changes will \"be announced in a week or so.\"\nLorne Michaels Confirms Cast Shake-Ups Coming to Saturday Night Live\nWren Graves",
    "link": "https://consequence.net/2025/08/lorne-michaels-cast-shake-ups-snl/",
    "timestamp": "2025-08-22T15:00:54Z"
  },
  {
    "title": "Trump says he will fire Fed Governor Lisa Cook if she doesn't resign",
    "description": "President Donald Trump said he would fire Federal Reserve Governor Lisa Cook if she doesn't resign.",
    "link": "https://biztoc.com/x/d12c55eac75dae87",
    "timestamp": "2025-08-22T15:00:48Z"
  },
  {
    "title": "CBS denies report of news division losing $50 million a year, insists it is profitable",
    "description": "CBS News insists the organization is profitable after a reporter walked back claims the embattled network’s new ownership inherited a significant financial burden.",
    "link": "https://www.foxnews.com/media/cbs-denies-report-news-division-losing-50-million-year-insists-profitable",
    "timestamp": "2025-08-22T15:00:34Z"
  },
  {
    "title": "National Guard Denies Report Pete Hegseth Authorized Weapons in DC",
    "description": "With several states deploying some troops to Washington, D.C., the nation's capital has around 2,000 National Guard troops deployed.",
    "link": "https://www.newsweek.com/national-guard-denies-report-pete-hegseth-authorized-weapons-dc-2117811",
    "timestamp": "2025-08-22T15:00:24Z"
  },
  {
    "title": "Trump 'very angry' at Ukraine hitting Russian pipeline feeding Orbán (Csongor Körömi/Politico)",
    "description": "Csongor Körömi / Politico:\nTrump ‘very angry’ at Ukraine hitting Russian pipeline feeding Orbán  —  Hungary's leader complained to the U.S. president following a Ukrainian drone strike on the Druzhba oil pipeline.  —  U.S. President Donald Trump said he got “…",
    "link": "https://www.memeorandum.com/250822/p44",
    "timestamp": "2025-08-22T15:00:01Z"
  },
  {
    "title": "Powell signals Fed may cut rates soon even as inflation risks remain",
    "description": "Federal Reserve Chair Jerome Powell on Friday opened the door ever so slightly to lowering a key interest rate in the coming months but gave no hint on the timing of a move and suggested the central bank will proceed cautiously",
    "link": "https://www.daytondailynews.com/news/nation-world/powell-signals-fed-may-cut-rates-soon-even-as-inflation-risks-remain/3OPZ6UB4V5O65GSSLYLWALBHQU/",
    "timestamp": "2025-08-22T14:59:27Z"
  },
  {
    "title": "Justice Gorsuch Is Fed Up With Lower Courts Repeatedly Defying SCOTUS",
    "description": "Justice Neil Gorsuch called out lower courts on Thursday for a pattern of ignoring Supreme Court rulings.",
    "link": "https://dailycaller.com/2025/08/22/justice-gorsuch-is-fed-up-with-lower-courts-repeatedly-defying-scotus/",
    "timestamp": "2025-08-22T14:59:08Z"
  },
  {
    "title": "Donald Trump says will 'fire' Fed governor Lisa Cook if she doesn't resign",
    "description": "President Donald Trump has warned he will fire Federal Reserve Governor Lisa Cook if she does not resign, following allegations of mortgage fraud. FHFA Director William Pulte claims Cook falsified documents to secure favourable loan terms. Cook has rejected t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-says-will-fire-fed-governor-lisa-cook-if-she-doesnt-resign/articleshow/123457376.cms",
    "timestamp": "2025-08-22T14:58:11Z"
  },
  {
    "title": "Moments after Jerome Powell’s latest speech, Trump threatens to fire Fed governor Lisa Cook if she doesn’t resign",
    "description": "Two days earlier, the suddenly embattled Fed governor Lisa Cook said she had “no intention of being bullied to step down.”",
    "link": "https://fortune.com/2025/08/22/trump-says-fire-lisa-cook-federal-reserve-jerome-powell-jackson-hole/",
    "timestamp": "2025-08-22T14:57:53Z"
  },
  {
    "title": "Moments after Jerome Powell’s latest speech, Trump threatens to fire Fed governor Lisa Cook if she doesn’t resign",
    "description": "Two days earlier, the suddenly embattled Fed governor Lisa Cook said she had “no intention of being bullied to step down.”",
    "link": "https://www.yahoo.com/news/articles/moments-jerome-powell-latest-speech-145753779.html",
    "timestamp": "2025-08-22T14:57:53Z"
  },
  {
    "title": "Oil Edges Higher on Dovish Powell Speech, Trump’s India Pressure",
    "description": "West Texas Intermediate advanced to trade near $64 a barrel after Powell’s highly anticipated prepared remarks were more dovish than some investors...",
    "link": "https://finance.yahoo.com/news/oil-steady-focus-india-russia-004904848.html",
    "timestamp": "2025-08-22T14:57:21Z"
  },
  {
    "title": "How Walmart, Target, Home Depot and Lowe’s Confront Tariff Pressures",
    "description": "Walmart, Target, Home Depot and Lowe’s earnings reveal how tariffs are raising costs, reshaping pricing and pressuring profits in 2025.",
    "link": "https://observer.com/2025/08/walmart-target-home-depot-lowes-tariff/",
    "timestamp": "2025-08-22T14:57:20Z"
  },
  {
    "title": "Donald Trump’s Nobel Peace Prize is nowhere in sight",
    "description": "Donald Trump's attempt to broker peace between Russia and Ukraine is faltering, despite his efforts to position himself as a key mediator. The Alaska summit failed to yield a concrete agenda, with both sides remaining entrenched and accusations flying. Intens…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trumps-nobel-peace-prize-is-nowhere-in-sight/articleshow/123457337.cms",
    "timestamp": "2025-08-22T14:56:48Z"
  },
  {
    "title": "House Freedom Caucus’ future turns bleak as Chip Roy eyes Texas’ AG race",
    "description": "After setting its credibility on fire, and with its members giving up their seats, the House Freedom Caucus isn’t just losing, it’s evaporating.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/house-freedom-caucus-future-turns-bleak-chip-roy-eyes-texas-ag-race-rcna226545",
    "timestamp": "2025-08-22T14:55:57Z"
  },
  {
    "title": "Carney announces that Canada is dropping many retaliatory tariffs on U.S. goods",
    "description": "OTTAWA — Canada will drop some retaliatory tariffs on American products to match U.S. tariff exemptions for goods covered under the Canada-United States-Mexico Agreement, Prime Minister Mark Carney announced Friday. After meeting with his cabinet, Carney said…",
    "link": "https://toronto.citynews.ca/2025/08/22/pm-mark-carney-tariffs-update/",
    "timestamp": "2025-08-22T14:52:15Z"
  },
  {
    "title": "CNN anchor flags 'interesting tidbit' as JD Vance leans into 'cryptic' FBI leader comments",
    "description": "CNN's John Berman flagged an \"interesting tidbit\" as news broke about the FBI raid on former national security adviser John Bolton's home.Federal agents executed a search warrant at the home of the prominent critic of President Donald Trump, and the \"CNN News…",
    "link": "https://www.rawstory.com/john-bolton-kash-patel-cryptic/",
    "timestamp": "2025-08-22T14:52:09Z"
  }
]