[
  {
    "title": "Blow to William Ruto as High Court Suspends Implementation of KSh 280b Kenya-US Health Deal",
    "description": "High Court suspends President William Ruto's KSh 280 billion Kenya-US health deal, raising constitutional concerns over data privacy and potential risks to Kenyans.",
    "link": "https://www.tuko.co.ke/kenya/612350-blow-william-ruto-high-court-suspends-implementation-ksh-280b-kenya-health-deal/",
    "timestamp": "2025-12-11T08:15:24Z"
  },
  {
    "title": "Trump cannot 'separate reality from fantasy' after seething Truth Social post: analysis",
    "description": "Donald Trump is struggling to \"separate reality from fantasy\" and a recent Truth Social post makes it clear, a political commentator has claimed. The president has taken to the social media platform many times over the last few months but a 500-word tirade ab…",
    "link": "https://www.rawstory.com/trump-health-2674390074/",
    "timestamp": "2025-12-11T08:15:16Z"
  },
  {
    "title": "US Seizes Sanctioned Oil Tanker Off Coast of Venezuela, Trump Says",
    "description": "The U.S. has seized a sanctioned oil tanker off the coast of Venezuela, President Donald Trump said on Wednesday, a move that sent oil prices higher and sharply escalated tensions between Washington and Caracas. “We’ve just seized a tanker on …",
    "link": "https://www.insurancejournal.com/news/international/2025/12/11/850697.htm",
    "timestamp": "2025-12-11T08:15:04Z"
  },
  {
    "title": "Environmental group sues Trump for replacing national park pass photo with his own image",
    "description": "Environmental group files lawsuit challenging Trump's decision to replace winning national park photo with his face on 2026 America the Beautiful Pass.",
    "link": "https://www.foxnews.com/politics/environmental-group-sues-trump-replacing-national-park-pass-photo-his-own-image",
    "timestamp": "2025-12-11T08:09:42Z"
  },
  {
    "title": "The 8 at 8: Thursday",
    "description": "Here’s all the news you need to know as you start your day.",
    "link": "https://www.thejournal.ie/8-at-8-11-12-25-6900129-Dec2025/",
    "timestamp": "2025-12-11T08:00:23Z"
  },
  {
    "title": "Gemini Approved by CFTC to Offer U.S. Prediction Markets",
    "description": "Gemini said its affiliate Gemini Titan won CFTC approval to operate a Designated Contract Market, allowing the firm to offer regulated prediction markets in the U.S.",
    "link": "https://www.coindesk.com/markets/2025/12/11/gemini-becomes-first-crypto-exchange-approved-by-cftc-to-offer-u-s-prediction-markets",
    "timestamp": "2025-12-11T07:57:25Z"
  },
  {
    "title": "Venezuelan opposition leader Machado reappears in Oslo as a Nobel laureate",
    "description": "Venezuelan opposition leader Maria Corina Machado appeared in public for the first time in 11 months on Thursday, after a daring escape from her homeland, when she emerged from a hotel balcony in Norway's capital and waved to an emotional crowd of supporters …",
    "link": "https://www.independent.ie/world-news/europe/venezuelan-opposition-leader-machado-reappears-in-oslo-as-a-nobel-laureate/a817575969.html",
    "timestamp": "2025-12-11T07:46:19Z"
  },
  {
    "title": "Trump launches long-promised 'gold card' program",
    "description": "President Donald Trump has announced that his long-promised “ gold card ” was officially going on sale, offering legal status and an eventual pathway to U.S. citizenship for individuals paying $1 million and corporations ponying up twice that per foreign-born…",
    "link": "https://www.hurriyetdailynews.com/trump-launches-long-promised-gold-card-program-216688",
    "timestamp": "2025-12-11T07:42:16Z"
  },
  {
    "title": "Gavin Newsom Calls Trump 'Most Destructive President' In Lifetime, Warns US At 'Real Risk' Of Becoming Unrecognizable",
    "description": "Governor Gavin Newsom (D-Calif.) labeled President Donald Trump as a grave threat to the nation's democratic institutions and called on Americans to resist what he called a dangerous trajectory.\nNewsom Labels Trump ‘Reckless’ And A Threat To Democracy\nOn Wedn…",
    "link": "https://biztoc.com/x/afcaeb186ff41b8c",
    "timestamp": "2025-12-11T07:42:13Z"
  },
  {
    "title": "Gustavo Petro Responds to Trump Saying Colombia’s President ‘Will Be Next’",
    "description": "President Donald Trump said Colombia is \"producing a lot of drugs\" and threatened Petro.",
    "link": "https://biztoc.com/x/d1591bfba468e3d0",
    "timestamp": "2025-12-11T07:42:08Z"
  },
  {
    "title": "Venezuelan dissident appears in Norway after missing Nobel ceremony",
    "description": "María Corina Machado, who spent over a year in hiding in Venezuela, greeted supporters in Oslo, hours after her daughter accepted the Nobel Peace Prize in her name",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/12/10/world/americas/maria-corina-machado-venezuela-nobel.html",
    "timestamp": "2025-12-11T07:38:55Z"
  },
  {
    "title": "'Daily Show' Spots The Wild Way Trump Is Reminding People About The Epstein Files",
    "description": "The \"Daily Show\" crowd erupted in laughter over a \"completely real\" error that aired on Fox News.",
    "link": "https://www.huffpost.com/entry/daily-show-desi-lydic-trump-miners-epstein_n_693a625ee4b053d6e8ee2a7c",
    "timestamp": "2025-12-11T07:32:07Z"
  },
  {
    "title": "'Worst thing he ever said': Jimmy Kimmel says Trump is 'not all there' after speech",
    "description": "A rambling Donald Trump who made an affordability campaign trail appearance has been dubbed as \"not all there\" by Jimmy Kimmel.The talk show host compiled the many flubs of the president's speech, including a rambling attack on \"Indians\" who did not want the …",
    "link": "https://www.rawstory.com/trump-kimmel-2674390011/",
    "timestamp": "2025-12-11T07:31:57Z"
  },
  {
    "title": "Venezuelan opposition leader emerges from hiding after winning Nobel",
    "description": "Machado said she has missed much of her children’s lives while hiding, including graduations and weddings.",
    "link": "https://www.thejournal.ie/venezuelan-opposition-leader-emerges-from-hiding-after-winning-nobel-6900120-Dec2025/",
    "timestamp": "2025-12-11T07:31:06Z"
  },
  {
    "title": "Thailand-Cambodia fighting intensifies ahead of Trump call",
    "description": "Cambodia has urged the UN Security Council to intervene, accusing Thailand of targeting civilian infrastructure. Thailand's PM has said he will \"explain and clarify\" the situation to Donald Trump. Deadly clashes between Thailand and Cambodia near the disputed…",
    "link": "https://www.dw.com/en/thailand-cambodia-fighting-intensifies-ahead-of-trump-call/a-75100633",
    "timestamp": "2025-12-11T07:31:00Z"
  },
  {
    "title": "Thursday's papers: Kela's biggest recipients, US social media plan would impact Finnish tourists, and lunch prices to rise",
    "description": "The US is planning a rule that would require foreign tourists to show a five-year social media history before allowing them to visit the country.",
    "link": "https://yle.fi/a/74-20199103",
    "timestamp": "2025-12-11T07:30:27Z"
  },
  {
    "title": "Thailand reports first civilian deaths in renewed border conflict with Cambodia; Trump to reiterate ceasefire pursual",
    "description": "Heavy fighting continues on the Thai-Cambodian border. Three Thai civilians have died in the latest clashes. Both armies are using artillery and rockets. Hundreds of thousands have been displaced. International leaders are urging a return to ceasefire. The co…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/thailand-reports-first-civilian-deaths-in-renewed-border-conflict-with-cambodia-trump-to-reiterate-ceasefire-pursual/articleshow/125905819.cms",
    "timestamp": "2025-12-11T07:23:32Z"
  },
  {
    "title": "Thailand reports first civilian deaths in renewed border conflict with Cambodia",
    "description": "Three Thai civilians were killed as heavy combat continued along the country's border with Cambodia, the Thai military said Thursday, marking the country's first civilian fatalities since the fighting resumed. The latest large-scale fighting was set off by a …",
    "link": "https://japantoday.com/category/world/thailand-reports-first-civilian-deaths-in-renewed-border-conflict-with-cambodia",
    "timestamp": "2025-12-11T07:19:04Z"
  },
  {
    "title": "Court Blocks KSh 208B Ruto-US Health Deal Over Data Sharing Concerns",
    "description": "The High Court has temporarily halted the KSh 208B health deal between President Ruto and US President Trump signed on December 4 2025.",
    "link": "https://thekenyatimes.com/latest-kenya-times-news/blow-to-ruto-as-court-blocks-implementation-of-ksh208-billion-health-deal-with-trump/",
    "timestamp": "2025-12-11T07:17:24Z"
  },
  {
    "title": "US, Japan hold joint air exercise after China-Russia patrols",
    "description": "Japan said Thursday it held a joint air exercise with the United States in a show of force, days after Chinese-Russian patrols in the region and following weeks of diplomatic feuding between Tokyo and Beijing. The Japanese joint chiefs of staff said Wednesday…",
    "link": "https://www.digitaljournal.com/world/us-japan-hold-joint-air-exercise-after-china-russia-patrols/article",
    "timestamp": "2025-12-11T07:17:20Z"
  },
  {
    "title": "Venezuelan opposition leader Machado reappears in Norway after months in hiding",
    "description": "Venezuelan opposition leader María Corina Machado makes public appearance in Oslo after 11 months in hiding as daughter accepts Nobel Peace Prize on her behalf.",
    "link": "https://www.foxnews.com/world/venezuelan-opposition-leader-machado-reappears-norway-months-hiding",
    "timestamp": "2025-12-11T07:08:58Z"
  },
  {
    "title": "First civilians killed in Thailand as conflict with Cambodia erupts again following ceasefire",
    "description": "The first civilians have been killed in Thailand as the conflict with Cambodia erupted again, days after a ceasefire pushed by Donald Trump.",
    "link": "https://news.sky.com/story/first-civilians-killed-in-thailand-as-conflict-with-cambodia-erupts-again-following-ceasefire-13482025",
    "timestamp": "2025-12-11T07:04:00Z"
  },
  {
    "title": "US seizes sanctioned oil tanker off coast of Venezuela, Trump says",
    "description": "The U.S. has seized a sanctioned oil tanker off the coast of Venezuela, President Donald Trump said on Wednesday, a move that sent oil prices higher and sharply escalated tensions between Washington and Caracas.",
    "link": "https://www.independent.ie/world-news/north-america/us-seizes-sanctioned-oil-tanker-off-coast-of-venezuela-trump-says/a2145527628.html",
    "timestamp": "2025-12-11T07:03:27Z"
  },
  {
    "title": "Trump 'gold card' fast-tracks US visas for the wealthy",
    "description": "The Trump administration has introduced a website for applicants who can pay $1 million to expedite their visa process. Trump says it will provide \"citizenship for all qualified and vetted people.\" President Donald Trump's administration has launched a new, a…",
    "link": "https://www.dw.com/en/trump-gold-card-fast-tracks-us-visas-for-the-wealthy/a-75100618",
    "timestamp": "2025-12-11T06:59:00Z"
  },
  {
    "title": "Mexico raises tariffs on Chinese imports",
    "description": "Mexican lawmakers have backed a measure to raise tariffs on goods from China and other countries that do not have trade agreements with Mexico, despite strong pushback from Beijing.",
    "link": "https://www.hurriyetdailynews.com/mexico-raises-tariffs-on-chinese-imports-216686",
    "timestamp": "2025-12-11T06:55:11Z"
  },
  {
    "title": "DOJ Stops Monitoring Houston Illegal Dumping in Retreat From Environmental Justice",
    "description": "The U.S. Justice Department has withdrawn from an agreement with the city of Houston to curb illegal dumping in Black and Latino neighborhoods, part of the Trump administration’s broad dismantling of environmental justice initiatives. Federal authorities quie…",
    "link": "https://www.insurancejournal.com/news/southcentral/2025/12/11/850671.htm",
    "timestamp": "2025-12-11T06:48:36Z"
  },
  {
    "title": "U.S. Seizes Oil Tanker Off Venezuelan Coast",
    "description": "Some updates on the US capture of an oil tanker that had just departed from Venezuela.",
    "link": "https://www.nakedcapitalism.com/2025/12/u-s-seizes-oil-tanker-off-venezuelan-coast.html",
    "timestamp": "2025-12-11T06:26:16Z"
  },
  {
    "title": "High Court suspends sections of Ruto-Trump health deal",
    "description": "COFEK, in its petition, contends that the health deal signed on December 4, 2025, threatens the privacy of millions of Kenyans and violates constitutional and statutory safeguards.",
    "link": "https://www.standardmedia.co.ke/courts/article/2001536245/high-court-suspends-sections-of-ruto-trump-health-deal",
    "timestamp": "2025-12-11T06:25:35Z"
  },
  {
    "title": "Hamas proposes weapons 'freeze' in return for long-term truce",
    "description": "A top Hamas leader told Qatari news channel Al Jazeera on Wednesday that the militant group is open to a weapons \"freeze\", but rejects the demand for disarmament put forward in the U.S.-sponsored peace plan for Gaza.",
    "link": "https://www.hurriyetdailynews.com/hamas-proposes-weapons-freeze-in-return-for-long-term-truce-216685",
    "timestamp": "2025-12-11T06:24:28Z"
  },
  {
    "title": "Analysis-Pokrovsk's fall will not cause frontline collapse, but weakens Ukraine in Trump's eyes",
    "description": "KYIV, Dec 11 (Reuters) - Russia's capture of Pokrovsk appears to be a matter of 'when' not 'if', and while its fall will not trigger a collapse in Ukraine's defences, it weakens Kyiv at a sensitive juncture in U.S.-led negotiations to end the war. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/12/11/analysis-pokrovsk039s-fall-will-not-cause-frontline-collapse-but-weakens-ukraine-in-trump039s-eyes",
    "timestamp": "2025-12-11T06:24:00Z"
  },
  {
    "title": "No matter who wins the Warner Bros battle, the ultimate loser is the audience",
    "description": "For cinephiles, the challenge remains unchanged: Fighting to preserve wonder in an ecosystem that increasingly values convenience over curiosity, and metrics over magic",
    "link": "https://indianexpress.com/article/opinion/columns/warner-bros-netflix-stranger-things-batman-hbo-max-apple-tv-10414454/",
    "timestamp": "2025-12-11T06:22:46Z"
  },
  {
    "title": "Watch: Zohran Mamdani dances at Satamar event",
    "description": "The Mayor-elect attended events hosted by both Satmar factions in honor of Chof Aleph Kislev. President Trump also commemorated the event in a letter.",
    "link": "https://www.israelnationalnews.com/news/419146",
    "timestamp": "2025-12-11T06:20:10Z"
  },
  {
    "title": "US-Latin America ties Monroe Doctrine migration Trump Venezuela",
    "description": "The United States has deep ties to its southern neighbors. The Trump administration's efforts to wield its economic and military might are part of a long history of US entanglement and intervention in Latin America. In his first year in office, Donald Trump h…",
    "link": "https://www.dw.com/en/us-latin-america-ties-monroe-doctrine-migration-trump-venezuela/a-75079864",
    "timestamp": "2025-12-11T06:18:00Z"
  },
  {
    "title": "From Monroe to migration: Charting US-Latin America ties",
    "description": "The United States has deep ties to its southern neighbors. The Trump administration's efforts to wield its economic and military might are part of a long history of US entanglement and intervention in Latin America. In his first year in office, Donald Trump h…",
    "link": "https://www.dw.com/en/from-monroe-to-migration-charting-us-latin-america-ties/a-75079864",
    "timestamp": "2025-12-11T06:18:00Z"
  },
  {
    "title": "US-Latin America ties Monroe Doctrine migration Trump Venezuela",
    "description": "The United States has deep ties to its southern neighbors. The Trump administration's efforts to wield its economic and military might are part of a long history of US entanglement and intervention in Latin America.",
    "link": "https://www.dw.com/en/us-latin-america-ties-monroe-doctrine-migration-trump-venezuela/a-75079864",
    "timestamp": "2025-12-11T06:18:00Z"
  },
  {
    "title": "US seized 'very large' tanker near Venezuela, Trump says",
    "description": "The United States has seized a large oil tanker off the coast of Venezuela, President Donald Trump said Wednesday, which Caracas deemed a 'blatant theft' amid escalating tensions between the countries.",
    "link": "https://www.hurriyetdailynews.com/us-seized-very-large-tanker-near-venezuela-trump-says-216683",
    "timestamp": "2025-12-11T06:15:56Z"
  },
  {
    "title": "Ukraine sends US new plan to end the war as Trump blasts Europe",
    "description": "Ukraine has sent Washington an updated plan for ending Russia's invasion, Ukrainian officials told AFP Wednesday, as U.S. President Donald Trump laid into European leaders in the latest sign of a growing transatlantic rift.",
    "link": "https://www.hurriyetdailynews.com/ukraine-sends-us-new-plan-to-end-the-war-as-trump-blasts-europe-216682",
    "timestamp": "2025-12-11T06:12:07Z"
  },
  {
    "title": "US: Rubio restores Times New Roman over 'wasteful' Calibri",
    "description": "The US Secretary of State says the Calibri font, introduced under Joe Biden, is wasteful, confusing and degrades the department's correspondence. The move is part of Trump's bid to undo Biden's pro-diversity policies. US Secretary of State Marco Rubio has ord…",
    "link": "https://www.dw.com/en/us-rubio-restores-times-new-roman-over-wasteful-calibri/a-75100367",
    "timestamp": "2025-12-11T06:09:00Z"
  },
  {
    "title": "Schemes of Bankruptcy: The United Nations, Funding Dues and Human Rights",
    "description": "The United Nations, in turning 80, has been berated, dismissed and libelled. In September, US President Donald Trump took a hearty swipe at the body’s alleged impotence. “What is the purpose of the United Nations?” he posed to gathered world …\nThe post Scheme…",
    "link": "https://www.globalresearch.ca/united-nations-funding-dues-human-rights/5908622",
    "timestamp": "2025-12-11T06:07:26Z"
  },
  {
    "title": "Jake Tapper and Kaitlan Collins Sound Off on Trump’s Call for CNN to be Sold in WBD Deal: ‘Never Seen Anything Like This’ | Video",
    "description": "The CNN journalists' remarks come after the president said it was \"imperative\" for the news company to be put up for sale\nThe post Jake Tapper and Kaitlan Collins Sound Off on Trump’s Call for CNN to be Sold in WBD Deal: ‘Never Seen Anything Like This’ | Vide…",
    "link": "https://www.thewrap.com/jake-tapper-kaitlan-collins-react-trump-call-for-cnn-to-be-sold-in-wbd-deal/",
    "timestamp": "2025-12-11T06:05:26Z"
  },
  {
    "title": "Trump wants to keep farmers happy with cash. They're still worried about the future",
    "description": "American farmers face financial strain from trade disputes. President Trump announced a $12 billion aid package to help offset losses from reduced international sales. Farmers welcome the support but emphasize it is a temporary fix. They desire market stabili…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-wants-to-keep-farmers-happy-with-cash-theyre-still-worried-about-the-future/articleshow/125904196.cms",
    "timestamp": "2025-12-11T06:01:55Z"
  },
  {
    "title": "China and Brazil forge space partnership despite U.S. warnings of surveillance risks",
    "description": "China and Brazil launch a joint space lab despite U.S. diplomatic pressure. The project centers on a major new radio telescope. The U.S. warns the technology could be used for military surveillance. The telescope will have dual-use capabilities for tracking s…",
    "link": "https://www.naturalnews.com/2025-12-11-china-brazil-space-partnership-warnings-surveillance.html",
    "timestamp": "2025-12-11T06:00:00Z"
  },
  {
    "title": "Trump threatens “severe” Canadian fertilizer tariffs as farm relief plan takes shape",
    "description": "President Donald Trump warned of imposing “very severe” tariffs on Canadian fertilizer imports (potash and nitrogen), citing U.S. dependence on Canada—which supplies 95% of America’s potash—as a vulnerability. A new relief program allocates $11 billion to row…",
    "link": "https://www.naturalnews.com/2025-12-11-trump-threatens-severe-tariffs-on-canadian-fertilizer.html",
    "timestamp": "2025-12-11T06:00:00Z"
  },
  {
    "title": "European leaders defend continent amid Trump’s “weak” criticism",
    "description": "President Donald Trump labels the EU as “weak” and incompetent on migration and Ukraine, claiming countries like Britain, France and Germany are being “destroyed” by mass migration. He doubles down on his nationalist “America First” stance, favoring bilateral…",
    "link": "https://www.naturalnews.com/2025-12-11-european-leaders-defend-continent-amid-trumps-criticism.html",
    "timestamp": "2025-12-11T06:00:00Z"
  },
  {
    "title": "A new front in the trade war: Trump targets Canadian fertilizer",
    "description": "President Donald Trump has threatened “very severe” tariffs on Canadian fertilizer imports to bolster U.S. production. The threat comes alongside a new $12 billion aid package for American farmers struggling with high input costs. The U.S. is heavily reliant …",
    "link": "https://www.naturalnews.com/2025-12-11-new-front-trade-war-trump-targets-canadian-fertilizer.html",
    "timestamp": "2025-12-11T06:00:00Z"
  },
  {
    "title": "Trump’s phone call: A pivotal moment in the Thailand-Cambodia border crisis",
    "description": "President Donald Trump, known for his assertive foreign policy, decided to intervene in the ongoing Thailand-Cambodia border crisis, which had displaced over 500,000 people and claimed dozens of lives. His decision came as heavy fighting had erupted again, le…",
    "link": "https://www.naturalnews.com/2025-12-11-trumps-phone-call-pivotal-thailand-cambodia-border-crisis.html",
    "timestamp": "2025-12-11T06:00:00Z"
  },
  {
    "title": "Over 30 sanctioned ships in Venezuela at risk after US tanker seizure",
    "description": "HOUSTON: More than 30 US-sanctioned oil vessels doing business in Venezuela could face punishment by Washington after the Coast Guard seized a supertanker carrying Venezuelan crude for export, according",
    "link": "https://www.channelnewsasia.com/world/over-30-sanctioned-ships-in-venezuela-risk-after-us-tanker-seizure-5575546",
    "timestamp": "2025-12-11T05:57:55Z"
  },
  {
    "title": "Trump plans envision major U.S. investment in Russia, restoring oil flows to Europe: Report",
    "description": "President Donald Trump's peace proposal for Ukraine includes restoring Russian energy supplies to Europe. It also suggests significant U.S. investment in Russian rare earths and energy sectors. The plan outlines tapping frozen Russian sovereign assets for Ukr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-plans-envision-major-u-s-investment-in-russia-restoring-oil-flows-to-europe-report/articleshow/125904065.cms",
    "timestamp": "2025-12-11T05:53:58Z"
  },
  {
    "title": "Trump plans envision major U.S. investment in Russia, restoring oil flows to Europe, WSJ says",
    "description": "MOSCOW, Dec 11 (Reuters) - U.S. President Donald Trump's plan for peace in Ukraine includes proposals to restore Russian energy flows to Europe, major U.S. investment in Russian rare earths and energy, and tapping frozen Russian sovereign assets, the Wall Str…",
    "link": "https://www.thestar.com.my/news/world/2025/12/11/trump-plans-envision-major-us-investment-in-russia-restoring-oil-flows-to-europe-wsj-says",
    "timestamp": "2025-12-11T05:48:00Z"
  },
  {
    "title": "Trump Tries To Dance Away His Demons After Epstein-Like Twist On 'South Park'",
    "description": "The president celebrated the shocking Christmas \"miracle\" with total disregard for life.",
    "link": "https://www.huffpost.com/entry/south-park-season-finale-trump-satan-baby-epstein_n_693a31e2e4b0cfabad26566c",
    "timestamp": "2025-12-11T05:47:46Z"
  },
  {
    "title": "Cross-border fighting between Thailand, Cambodia enters fourth day",
    "description": "Both sides have accused each other of violating international law as they await a promised phone call from Donald Trump.",
    "link": "https://www.aljazeera.com/news/2025/12/11/cross-border-fighting-between-thailand-cambodia-enters-fourth-day",
    "timestamp": "2025-12-11T05:47:13Z"
  },
  {
    "title": "Taiwan to keep production of ‘most advanced’ chips at home: deputy FM",
    "description": "Taiwan plans to keep making the “most advanced” chips on home soil and remain “indispensable” to the global semiconductor industry, the deputy foreign minister told AFP, despite intense Chinese military pressure. The democratic island makes more than half of …",
    "link": "https://www.digitaljournal.com/world/taiwan-to-keep-production-of-most-advanced-chips-at-home-deputy-fm/article",
    "timestamp": "2025-12-11T05:42:34Z"
  },
  {
    "title": "Judge to decide degree of media access in Charlie Kirk killing case",
    "description": "Lawyers for the 22-year-old Utah man charged with killing Charlie Kirk are expected in court as they push to further limit media access in the high-profile criminal case",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-decide-degree-media-access-charlie-kirk-killing-128303077",
    "timestamp": "2025-12-11T05:41:25Z"
  },
  {
    "title": "GOP hardliners vexed as defense bill advances without CBDC ban",
    "description": "Conservatives in the Republican Party are frustrated that a promised ban on central bank digital currencies didn’t make it into a must-pass defense bill that’s now on its way to the Senate.",
    "link": "https://cointelegraph.com/news/gop-conservatives-angered-defense-bill-no-cbdc-ban",
    "timestamp": "2025-12-11T05:40:23Z"
  },
  {
    "title": "Mike Johnson Finally Reveals GOP’s Health Care Plan—and It’s Rough - NewsBreak",
    "description": "House Speaker Mike Johnson just unveiled Republicans’ plan to address spiking health care costs—and it’s a disaster. As Affordable Care Act tax credits are",
    "link": "https://www.newsbreak.com/share/4390553468696-mike-johnson-finally-reveals-gop-s-health-care-plan-and-it-s-rough?s=a2&amp;share_destination_id=NTQ2NDA5MDktMTc2NTQyOTExNzM3NA%3D%3D&amp;pd=03hGazFf&amp;hl=en_US&amp;send_time=1765429117&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.49.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-11T05:39:22Z"
  },
  {
    "title": "Trump launches gold card programme for expedited visas with a US$1 million price tag",
    "description": "WASHINGTON: United States President Donald Trump's administration officially launched his Trump Gold Card visa programme on Wednesday (Dec 10) to provide a pathway, with a steep price, for non-US",
    "link": "https://www.channelnewsasia.com/world/us-trump-gold-card-programme-expedited-visa-1-million-5575296",
    "timestamp": "2025-12-11T05:39:00Z"
  },
  {
    "title": "Idaho Supports Trump’s Aviation Choice — Senator Risch, Confirm Captain Anderson Now",
    "description": "Boise, Idaho, Dec. 10, 2025 (GLOBE NEWSWIRE) -- Experienced Pilots Advancing Safety (EPAS), a national organization of professional aviators committed to strengthening America’s aviation safety and global leadership, is urging Senator James Risch, Chairman of…",
    "link": "https://www.globenewswire.com/news-release/2025/12/11/3203602/0/en/Idaho-Supports-Trump-s-Aviation-Choice-Senator-Risch-Confirm-Captain-Anderson-Now.html",
    "timestamp": "2025-12-11T05:35:00Z"
  },
  {
    "title": "Trump wants to keep farmers happy with cash. They're still worried about the future",
    "description": "Farmers in the U.S. are feeling the strain from trade disputes, particularly with China",
    "link": "https://abcnews.go.com/Business/wireStory/trump-farmers-happy-cash-worried-future-128302797",
    "timestamp": "2025-12-11T05:33:25Z"
  },
  {
    "title": "Trump: ‘I love This Ilhan Omar,’ She ‘Does Nothing but B*****’",
    "description": "President Donald Trump blasted Rep. Ilhan Omar (D-MN) during his speech in Pennsylvania on Wednesday for “always complaining,” alleging that she married her brother and is in the United States illegally. “I love this Ilhan Omar, whatever the hell her name is,…",
    "link": "https://freerepublic.com/focus/f-chat/4356878/posts",
    "timestamp": "2025-12-11T05:30:58Z"
  },
  {
    "title": "Ellen Francis: At crucial time for Ukraine, US now sees Europe, not Russia, as Public Enemy No 1",
    "description": "Donald Trump’s new national security strategy berating Europe has triggered a wave of acrimony. European officials say the document has turned the Trump administration’s vitriol against European democracies into formal policy.",
    "link": "https://www.independent.ie/opinion/comment/ellen-francis-at-crucial-time-for-ukraine-us-now-sees-europe-not-russia-as-public-enemy-no-1/a1990056999.html",
    "timestamp": "2025-12-11T05:30:00Z"
  },
  {
    "title": "Letters: Tone-deaf housing advice shows Government still ignoring root of problem",
    "description": "The latest depressing episode in the housing debacle (‘Misguided advice on how to navigate moving back in with your parents won’t solve the housing crisis’, Irish Independent, December 10), copper-fastens the view the Government is simply not willing to recog…",
    "link": "https://www.independent.ie/opinion/letters/letters-tone-deaf-housing-advice-shows-government-still-ignoring-root-of-problem/a1075716957.html",
    "timestamp": "2025-12-11T05:30:00Z"
  },
  {
    "title": "Daughter accepts Nobel Peace Prize as Maria Corina Machado fails to arrive in Oslo in time for ceremony",
    "description": "Venezuelan opposition leader Maria Corina Machado has left the country after nearly a year in hiding to travel to Oslo to receive the Nobel Peace Prize, but after days of anticipation, Ms Machado was absent from the ceremony yesterday.",
    "link": "https://www.independent.ie/world-news/europe/daughter-accepts-nobel-peace-prize-as-maria-corina-machado-fails-to-arrive-in-oslo-in-time-for-ceremony/a1691089106.html",
    "timestamp": "2025-12-11T05:30:00Z"
  },
  {
    "title": "Newsom Reveals He Wants ‘To See Trans Kids,’ Says He’s Been a Strong ‘Advocate for the LGBTQ Community’",
    "description": "California Gov. Gavin Newsom (D) highlighted how he wanted “to see” transgender children, and that there is “no governor that’s done more pro-trans legislation” than he has. During an interview on an episode of The Ezra Klein Show, with New York Times columni…",
    "link": "https://freerepublic.com/focus/f-backroom/4356877/posts",
    "timestamp": "2025-12-11T05:28:54Z"
  },
  {
    "title": "Peace Prize laureate emerges from hiding to greet cheering crowds",
    "description": "Venezuelan opposition leader and Nobel Peace Prize laureate Maria Corina Machado, who has been living in hiding in fear for her safety, appears in public for the first time in almost a year.",
    "link": "https://www.abc.net.au/news/2025-12-11/maria-machado-greets-cheering-crowds-in-oslo-norway/106130560",
    "timestamp": "2025-12-11T05:17:47Z"
  },
  {
    "title": "Indiana redistricting is up for a final, deciding vote in the state Senate",
    "description": "Indiana state Senators are expected to take a final and deciding vote on redistricting Thursday, and the outcome is still uncertain",
    "link": "https://abcnews.go.com/Politics/wireStory/indiana-redistricting-final-deciding-vote-state-senate-128302822",
    "timestamp": "2025-12-11T05:17:42Z"
  },
  {
    "title": "Senate poised to reject extension of health care subsidies as costs rise for many",
    "description": "The Senate has rejected legislation to extend Affordable Care Act tax credits, essentially guaranteeing that millions of Americans will see a steep rise in costs at the beginning of the year.",
    "link": "https://www.news4jax.com/news/politics/2025/12/11/senate-poised-to-reject-extension-of-health-care-subsidies-as-costs-rise-for-many/",
    "timestamp": "2025-12-11T05:16:46Z"
  },
  {
    "title": "Peacemaker or Pirate of the Caribbean? Trump Celebrates Murder on the Open Seas",
    "description": "As defenseless Venezuelan fishermen are slaughtered by a military blindly obeying his illegal orders, President Trump — wearing a phony peace medallion — parades before the world urging it to “give peace a chance.” A combination of madness and make-believe, t…",
    "link": "https://www.juancole.com/2025/12/peacemaker-caribbean-celebrates.html",
    "timestamp": "2025-12-11T05:15:54Z"
  },
  {
    "title": "Time magazine to name its person of the year for 2025",
    "description": "Time magazine is set to name its person of the year for 2025",
    "link": "https://abcnews.go.com/Politics/wireStory/time-magazine-person-year-2025-128302146",
    "timestamp": "2025-12-11T05:09:27Z"
  },
  {
    "title": "Trump says the U.S. has seized an oil tanker off the coast of Venezuela",
    "description": "Using U.S. forces to take control of a merchant ship is unusual and marks the Trump administration's latest push to increase pressure on Maduro, who has been charged with narcoterrorism.",
    "link": "https://www.npr.org/2025/12/11/g-s1-101668/seized-oil-tanker-off-the-coast-venezuela",
    "timestamp": "2025-12-11T05:08:55Z"
  },
  {
    "title": "How Trump's trade deal and aid package affect American farmers",
    "description": "American farmers are feeling the strain from trade disputes under President Donald Trump, particularly with China. Trump has announced $12 billion in aid for U.S. farmers, but many farmers say that's not enough. South Dakota farmer Gene Stehly believes the ai…",
    "link": "https://apnews.com/article/trump-soybean-farmers-china-trade-tariffs-brazil-9663759ac3c9c7360bd5f23cb84180f0",
    "timestamp": "2025-12-11T05:08:36Z"
  },
  {
    "title": "The Trump Administration’s Policies Are Disrupting the Balkans",
    "description": "Washington’s decision to lift sanctions on a Bosnian Serb leader threatens the region’s delicate balance.\nThe post The Trump Administration’s Policies Are Disrupting the Balkans appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/the-trump-administrations-policies-are-disrupting-the-balkans/",
    "timestamp": "2025-12-11T05:05:00Z"
  },
  {
    "title": "China's impressive trade surplus is making things hard for trading partners",
    "description": "China's record breaking one trillion-dollar trade surplus shows Trump's tariffs have done little to tame Beijing's export juggernaut. In fact, they might have turbocharged it instead.",
    "link": "https://www.abc.net.au/news/2025-12-11/china-trade-surplus-tariffs-beijing-donald-trump-global-economy/106130778",
    "timestamp": "2025-12-11T05:03:50Z"
  },
  {
    "title": "Lawrence: Trump tries Epstein-style cover-up of second boat strike video",
    "description": "Donald Trump is trying to declare the crisis surrounding his Defense Secretary Pete Hegseth “dead,” MS NOW's Lawrence ...",
    "link": "https://biztoc.com/x/16c65007f8144282",
    "timestamp": "2025-12-11T05:03:15Z"
  },
  {
    "title": "David Ellison told Warner Bros. shareholders it's 'not too late' to switch teams from Netflix to Paramount",
    "description": "Paramount's CEO urged shareholders to tender their shares and slammed WBD for an \"opaque sales process\" that gave Netflix preferential treatment.",
    "link": "https://www.businessinsider.com/david-ellison-warner-bros-shareholders-paramount-netflix-2025-12",
    "timestamp": "2025-12-11T05:03:01Z"
  },
  {
    "title": "Brussels puts the map in Kyiv’s hands in territorial concessions debate",
    "description": "If Trump were to endorse Russia’s lines in Ukraine, decades of Western policy could shift overnight",
    "link": "https://www.euractiv.com/news/brussels-puts-the-map-in-kyivs-hands-in-territorial-concessions-debate/",
    "timestamp": "2025-12-11T05:00:52Z"
  },
  {
    "title": "Trump says he wants a new owner for CNN as part of any sale of Warner Bros. Discovery: 'A very dishonest group of people' (Charles Gasparino/New York Post)",
    "description": "Charles Gasparino / New York Post:\nTrump says he wants a new owner for CNN as part of any sale of Warner Bros. Discovery: ‘A very dishonest group of people’  —  Donald Trump said he wants a new owner for CNN as part of any sale of its parent Warner Bros. Disc…",
    "link": "https://www.memeorandum.com/251211/p1",
    "timestamp": "2025-12-11T05:00:05Z"
  },
  {
    "title": "Trump Derangement Syndrome in Honduras",
    "description": "The left lost bigly in Honduras.  In fact, it was so big that the leftist incumbent President Castro is claiming that the election was stolen.  Who stole it?  Well, she is not saying, except claiming that President Trump (who else?) me...",
    "link": "https://www.americanthinker.com/blog/2025/12/trump_derangement_syndrome_in_honduras.html",
    "timestamp": "2025-12-11T05:00:00Z"
  },
  {
    "title": "The Illusion of Peace and the Reality of Negotiation",
    "description": "In early December 2025, the Trump administration officially rebranded the U.S. Institute of Peace, a congressionally created agency, with Trump’s name prominently displayed on its headquarters in Washington, D.C. The State Department described ...",
    "link": "https://www.americanthinker.com/articles/2025/12/the_illusion_of_peace_and_the_reality_of_negotiation.html",
    "timestamp": "2025-12-11T05:00:00Z"
  },
  {
    "title": "Blue State Governors Are Blocking ‘No Tax on Tips’ for Their Constituents to Resist Trump",
    "description": "Democrats want us to believe they care about the little guy, the working class, the average American. Yet. somehow, their policies always seem to hurt the people they claim to help and enrich the elites who fund their campaigns. On the campaign trail last yea…",
    "link": "https://freerepublic.com/focus/f-news/4356870/posts",
    "timestamp": "2025-12-11T04:57:22Z"
  },
  {
    "title": "Marjorie Taylor Greene Slams Trump for Bragging About the Economy: ‘It’s Insulting to People’s Intelligence’",
    "description": "Rep. Marjorie Taylor Greene slammed President Donald Trump on Wednesday for giving the economy a grade of \"A-plus-plus-plus-plus-plus.\" \nThe post Marjorie Taylor Greene Slams Trump for Bragging About the Economy: ‘It’s Insulting to People’s Intelligence’ firs…",
    "link": "https://www.mediaite.com/politics/marjorie-taylor-greene-slams-trump-for-bragging-about-the-economy-its-insulting-to-peoples-intelligence/",
    "timestamp": "2025-12-11T04:57:13Z"
  },
  {
    "title": "Ukraine updates: NATO says alliance is Russia's next target",
    "description": "NATO chief Mark Rutte says allies are not adequately prepared to meet the threat Moscow poses. Meanwhile, Kyiv has reportedly sent a revised peace plan to Washington. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-nato-says-alliance-is-russias-next-target/live-75100132",
    "timestamp": "2025-12-11T04:54:00Z"
  },
  {
    "title": "Ukraine set for more peace plan talks with key allies",
    "description": "Ukraine is ready to join more talks with key partners from the \"Coalition of the Willing\" group that is meeting virtually this morning. Plus, keeping track of whether Ukraine sent a revised peace proposal to Washington. 'Coalition of the Willing' talks to foc…",
    "link": "https://www.dw.com/en/ukraine-set-for-more-peace-plan-talks-with-key-allies/live-75100132",
    "timestamp": "2025-12-11T04:54:00Z"
  },
  {
    "title": "Ukraine updates: NATO says alliance is Russia's next target",
    "description": "NATO chief Mark Rutte says allies are not adequately prepared to meet the threat Moscow poses. Meanwhile, Kyiv has reportedly sent a revised peace plan to Washington. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-nato-says-alliance-is-russias-next-target/live-75100132",
    "timestamp": "2025-12-11T04:54:00Z"
  },
  {
    "title": "Mexico approves up to 50% tariffs on China and other countries",
    "description": "The levies are set to take effect on 1 January and will apply to goods like cars, clothing and appliances.",
    "link": "https://www.bbc.com/news/articles/c36z43ll06zo",
    "timestamp": "2025-12-11T04:52:52Z"
  },
  {
    "title": "FBI Agents Who Knelt During George Floyd Protest Sue Trump Admin, Float 'Real' Reason They Did It",
    "description": "When we look back in time, 2020 will not be remembered for many good things. Most notably, a worldwide pandemic and the shutting down of society that came with it, and the worldwide protests that followed the death of George Floyd in Minneapolis. There will a…",
    "link": "https://freerepublic.com/focus/f-news/4356869/posts",
    "timestamp": "2025-12-11T04:50:37Z"
  },
  {
    "title": "Musk: Omar’s Somali remarks 'sound like treason'",
    "description": "Elon Musk accuses Rep. Ilhan Omar of treason over Somali remarks, after 2024 footage of her saying the US government “will do what we ask it to do” resurfaces.",
    "link": "https://www.israelnationalnews.com/news/419141",
    "timestamp": "2025-12-11T04:48:21Z"
  },
  {
    "title": "Trump Pardoned Them for Jan. 6. Now They Want Millions of Dollars (Zoe Tillman/Bloomberg)",
    "description": "Zoe Tillman / Bloomberg:\nTrump Pardoned Them for Jan. 6.  Now They Want Millions of Dollars  —  Almost 400 people pardoned or granted clemency by President Donald Trump in connection with the Jan. 6, 2021, attack on the US Capitol are now seeking millions of …",
    "link": "https://www.memeorandum.com/251210/p148",
    "timestamp": "2025-12-11T04:45:01Z"
  },
  {
    "title": "Zelensky must be ‘realistic’ – Trump",
    "description": "US President Donald Trump has said that Ukrainian leader Vladimir Zelensky should be “realistic” and hold elections Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629293-trimp-zelensky-be-realistic/",
    "timestamp": "2025-12-11T04:37:31Z"
  },
  {
    "title": "UK youth unemployment hits crisis point: Three million out of work as AI and economic pressures worsen job market",
    "description": "Britain faces a deepening youth unemployment crisis, with PwC’s latest index revealing three million young people out of work and nearly one million classified as NEET. PwC warns that structural weaknesses, regional disparities, and early AI-driven disruption…",
    "link": "https://timesofindia.indiatimes.com/education/news/uk-youth-unemployment-hits-crisis-point-three-million-out-of-work-as-ai-and-economic-pressures-worsen-job-market/articleshow/125902488.cms",
    "timestamp": "2025-12-11T04:33:37Z"
  },
  {
    "title": "Trump and Satan’s Baby Pulls an Epstein in South Park’s Christmas Episode",
    "description": "South Park's arc involving Donald Trump and Satan's love baby came to a epic conclusion with a Christmas-themed episode titled \"Crap Out.\"\nTrump and Satan’s Baby Pulls an Epstein in South Park’s Christmas Episode\nAlex Young",
    "link": "https://consequence.net/2025/12/south-park-trump-epstein-merry-christmas/",
    "timestamp": "2025-12-11T04:33:09Z"
  },
  {
    "title": "JUST IN: House Passes $900B Military Defense Bill – Hardline Conservatives Decry Liberal Provisions and Ukraine Funding in Bill",
    "description": "The US House of Representatives voted to pass a negotiated version of the National Defense Authorization Act on Wednesday, sending the Pentagon spending bill to the Senate for final approval. This bill was negotiated with Democrats in the House and the Senate…",
    "link": "https://freerepublic.com/focus/f-news/4356866/posts",
    "timestamp": "2025-12-11T04:32:37Z"
  },
  {
    "title": "Nifty struggling to hold its peak. 5 reasons why this is a worrying sign for investors",
    "description": "Nifty’s struggle near record highs signals weakening momentum as FII short positions rise, the rupee hovers near 90, and progress on the US-India trade deal remains slow. With midcaps and smallcaps under pressure and technical indicators turning cautious, inv…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-struggling-to-hold-its-peak-5-reasons-why-this-is-a-worrying-sign-for-investors/articleshow/125902622.cms",
    "timestamp": "2025-12-11T04:30:00Z"
  },
  {
    "title": "Ukraine sends US new plan to end the war as Trump blasts Europe",
    "description": "A Ukrainian official said it \"takes into account Ukraine's vision – it is a further proposal for adequate solutions to problematic issues\"",
    "link": "https://www.euractiv.com/news/ukraine-sends-us-new-plan-to-end-the-war-as-trump-blasts-europe/",
    "timestamp": "2025-12-11T04:27:21Z"
  },
  {
    "title": "South Park brings Antichrist plot to an end with Jeffrey Epstein-referencing twist in season finale",
    "description": "Donald Trump got his way in the Christmas-themed ‘South Park’ finale",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/south-park-finale-trump-epstein-antichrist-b2882127.html",
    "timestamp": "2025-12-11T04:23:38Z"
  }
]