[
  {
    "title": "5 things to know before the stock market opens Thursday",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/03/06/5-things-to-know-before-the-stock-market-opens-thursday-march-6.html",
    "timestamp": "2025-03-06T12:57:22Z"
  },
  {
    "title": "Homebuyers Receive Mortgage Interest Rate Warning",
    "description": "Mortgage rates are likely to dip as uncertainty around Trump's policies grows—but that may be as low as they are going to get this year, experts say.",
    "link": "https://www.newsweek.com/homebuyers-receive-mortgage-interest-rate-warning-2040446",
    "timestamp": "2025-03-06T12:55:30Z"
  },
  {
    "title": "After Trump pressure, China sells Panama port terminals to US private equity firm, MSC",
    "description": "In a blockbuster deal that could shift the balance of power in global port operations, a consortium of U.S. private equity firm BlackRock and MSC of Geneva has agreed to purchase the non-Chinese assets of Hong Kong-based subsidiary Hutchison Port Holdings, in…",
    "link": "https://freerepublic.com/focus/f-chat/4302448/posts",
    "timestamp": "2025-03-06T12:53:14Z"
  },
  {
    "title": "Enes Kanter Freedom sounds alarm on China's 'war' warning: 'Wake up America'",
    "description": "Former NBA player Enes Kanter Freedom sounded the alarm on China's \"war\" warning on Wednesday, imploring the U.S. to \"wake up.\" China released a statement on tariffs.",
    "link": "https://www.foxnews.com/sports/enes-kanter-freedom-sounds-alarm-chinas-war-warning-wake-up-america",
    "timestamp": "2025-03-06T12:53:07Z"
  },
  {
    "title": "DOGE Checks Will Be 'Very Different' to Stimulus Checks: Creator",
    "description": "President Trump has said he is considering sending out stimulus payments to taxpaying American families using money saved by DOGE.",
    "link": "https://www.newsweek.com/doge-checks-will-very-different-stimulus-checks-creator-2040514",
    "timestamp": "2025-03-06T12:52:27Z"
  },
  {
    "title": "Zelensky's Rivals Respond to Reports of 'Secret' Talks with Trump's Team",
    "description": "Volodymyr Zelensky's political rivals have addressed reports of \"secret\" talks with President Donald Trump's team, as speculation mounts over who could eventually succeed the Ukrainian leader.\nNewsweek contacted Ukraine's Foreign Ministry for comment via emai…",
    "link": "https://biztoc.com/x/1b9bab9f8f420ab7",
    "timestamp": "2025-03-06T12:51:32Z"
  },
  {
    "title": "Trump temporarily suspends tariffs on Mexico and Canada’s carmakers",
    "description": "US President Donald Trump is exempting the automakers from 25% tariffs for one month after negotiating with major industrial leaders. Auto stocks rose following the news.\nUS President Donald Trump is granting automakers in Mexico and Canada a one-month tariff…",
    "link": "https://biztoc.com/x/216100573ae66b47",
    "timestamp": "2025-03-06T12:51:28Z"
  },
  {
    "title": "Experts are watching these tech stocks are tariff nightmare looms",
    "description": "This week brought new turmoil for financial markets as U.S. President Donald Trump moved forward with his plans to levy new tariffs against his country’s top trading partners.\nIn keeping with a longstanding campaign promise, he has followed through on his pla…",
    "link": "https://biztoc.com/x/12d88bf1d7b6552d",
    "timestamp": "2025-03-06T12:50:45Z"
  },
  {
    "title": "Which Crypto Will Boom in 2025? Dawgz AI and The Next Big Players to Watch",
    "description": "With the next bull run approaching, traders are looking for the best high-growth opportunities before the market takes off. While established giants like Bitcoin and Ethereum remain strong, the real gains are in emerging projects with explosive potential. One…",
    "link": "https://zycrypto.com/which-crypto-will-boom-in-2025-dawgz-ai-and-the-next-big-players-to-watch/",
    "timestamp": "2025-03-06T12:50:14Z"
  },
  {
    "title": "Salesforce cuts diversity hiring goals, joining Meta and Google in scaling back DEI initiatives",
    "description": "Salesforce cuts explicit diversity hiring goals following Trump's executive orders, joining Amazon, Meta, and Google in scaling back DEI initiatives.",
    "link": "https://www.businessinsider.com/salesforce-cuts-diversity-hiring-goals-amid-dei-backlash-2025-3",
    "timestamp": "2025-03-06T12:48:42Z"
  },
  {
    "title": "ADA, SOL, XRP: Altcoins Under Consideration for U.S. Crypto Reserve Lag BTC in Retaking Sunday Highs",
    "description": "The market appears to be pricing in minimal expectations for these altcoins.",
    "link": "https://www.coindesk.com/markets/2025/03/06/ada-sol-xrp-altcoins-trump-named-for-crypto-reserve-lag-btc-in-retaking-sunday-highs-ahead-of-white-house-summit",
    "timestamp": "2025-03-06T12:48:33Z"
  },
  {
    "title": "'Social glue': Why it's no surprise European states are toughening language requirements",
    "description": "With many countries in Europe imposing new or tougher language requirements for residency or citizenship, experts say it's no surprise given the rise of nationalist parties and the importance of language to national identity.",
    "link": "https://www.thelocal.com/20250306/social-glue-why-its-no-surprise-european-states-are-toughening-language-requirements",
    "timestamp": "2025-03-06T12:47:31Z"
  },
  {
    "title": "Zelensky's Rivals Respond to Reports of 'Secret' Talks with Trump's Team",
    "description": "The Trump administration is reported to be applying pressure on Volodymyr Zelensky to hold wartime elections.",
    "link": "https://www.newsweek.com/zelensky-trump-secret-talks-rivals-2040520",
    "timestamp": "2025-03-06T12:46:13Z"
  },
  {
    "title": "Tánaiste contradicts US account of his conversation with Marco Rubio",
    "description": "Simon Harris insists US-Irish trade deficit was not discussed in call with secretary of state",
    "link": "https://www.irishtimes.com/politics/2025/03/06/tanaiste-contradicts-white-house-account-of-his-conversation-with-marco-rubio/",
    "timestamp": "2025-03-06T12:45:05Z"
  },
  {
    "title": "Trump's false claim that Stacey Abrams headed a group that got $1.9 billion (Glenn Kessler/Washington Post)",
    "description": "Glenn Kessler / Washington Post:\nTrump's false claim that Stacey Abrams headed a group that got $1.9 billion  —  In his speech to Congress, Trump played up unproven claims of malfeasance in green-energy funding.  —  Just now … — President Donald Trump, in an …",
    "link": "https://www.memeorandum.com/250306/p26",
    "timestamp": "2025-03-06T12:45:00Z"
  },
  {
    "title": "New Zealand's most senior diplomat in London loses his job over remarks about President Trump (Charlotte Graham-Mclay/Associated Press)",
    "description": "Charlotte Graham-Mclay / Associated Press:\nNew Zealand's most senior diplomat in London loses his job over remarks about President Trump  —  New Zealand's most senior envoy to the United Kingdom has lost his job over remarks he made about U.S. President Donal…",
    "link": "https://www.memeorandum.com/250306/p27",
    "timestamp": "2025-03-06T12:45:00Z"
  },
  {
    "title": "House Speaker Johnson's top aide is arrested on charge of driving under the influence, police say",
    "description": "The chief of staff to House Speaker Mike Johnson was arrested Tuesday night on suspicion of driving under the influence after crashing into a police vehicle following President Don",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/03/06/67c99875268e3e0e338b458b.html",
    "timestamp": "2025-03-06T12:44:48Z"
  },
  {
    "title": "James Carville explains why latest Trump move has him wanting to ‘punch the computer in frustration’",
    "description": "Longtime Democratic Party strategist James Carville scorched President Trump and Republicans for changing their tune on the economic consequences of the policies they ran on.",
    "link": "https://www.foxnews.com/media/james-carville-fights-urge-start-punching-my-computer-over-gops-support-tariffs",
    "timestamp": "2025-03-06T12:44:26Z"
  },
  {
    "title": "Trump preparing to sign order to dismantle Education Department",
    "description": "The president could sign the order as early as Thursday. He would need support from Congress to get it done.",
    "link": "https://www.wmur.com/article/trump-dismantle-department-of-education/64066895",
    "timestamp": "2025-03-06T12:44:21Z"
  },
  {
    "title": "Five Eyes: The intelligence alliance that keeps the U.S. ahead",
    "description": "Following an intense dispute between Donald Trump and Ukrainian President Volodymyr Zelenskyy, the U.S. has stopped sharing intelligence with Ukraine to increase pressure for peace talks. Meanwhile, France has affirmed continued support, but Britain's aid may…",
    "link": "https://economictimes.indiatimes.com/news/defence/five-eyes-the-intelligence-alliance-that-keeps-the-u-s-ahead/articleshow/118762750.cms",
    "timestamp": "2025-03-06T12:43:51Z"
  },
  {
    "title": "'We had to cancel': Tourism industry at risk as largest visitor group boycotts Trump plans",
    "description": "Canadians are scrapping plans to visit the U.S. to protest Donald Trump's economic and geopolitical attacks on their nation.The president has slapped 25-percent tariffs on many Canadian goods and has repeatedly stated that he wants to annex the country as the…",
    "link": "https://www.rawstory.com/canada-tourism-had-to-cancel/",
    "timestamp": "2025-03-06T12:43:46Z"
  },
  {
    "title": "US 'destroying' world order, Ukraine's ambassador to UK says",
    "description": "Valerii Zaluzhnyi's comments come amid an apparent cooling of tensions between Kyiv and Washington.",
    "link": "https://www.bbc.com/news/articles/cgq9n48el43o",
    "timestamp": "2025-03-06T12:43:11Z"
  },
  {
    "title": "HUD Secretary Scott Turner Visits Palisades, Eaton Fire Victims",
    "description": "Secretary of Housing and Urban Development (HUD) Scott Turner traveled to the Pacific Palisades on Wednesday evening to meet local residents and hear from them firsthand about their needs.\nThe post HUD Secretary Scott Turner Visits Palisades, Eaton Fire Victi…",
    "link": "https://www.breitbart.com/politics/2025/03/06/hud-secretary-scott-turner-visits-palisades-eaton-fire-victims/",
    "timestamp": "2025-03-06T12:42:56Z"
  },
  {
    "title": "Man accused of aiding Kabul airport bombing charged in US court",
    "description": "At least 170 Afghans and 13 US service members died in a bomb attack that caused then-President Joe Biden to face intense criticism.",
    "link": "https://www.bbc.com/news/articles/ce8m77e8jpmo",
    "timestamp": "2025-03-06T12:42:33Z"
  },
  {
    "title": "Whose Dog Was Being Wagged During Showtime Between Trump and Zelensky? Edward Curtin",
    "description": "Art requires the use of imagination, but so does political and social analysis. But imagination is just a first step; it proves nothing.\nEvidence is required. But imagination rules out nothing from the start. If one cannot imagine an hypothesis …\nThe post Who…",
    "link": "https://www.globalresearch.ca/whose-dog-wagged-showtime-trump-zelensky/5881457",
    "timestamp": "2025-03-06T12:42:09Z"
  },
  {
    "title": "Russia says Franco-British plan is bid to buy time for Ukraine",
    "description": "MOSCOW (Reuters) - Russia said on Thursday that a French and British peace initiative on Ukraine was a bid to buy time for Kyiv and prevent its military collapse. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/06/russia-says-franco-british-plan-is-bid-to-buy-time-for-ukraine",
    "timestamp": "2025-03-06T12:40:00Z"
  },
  {
    "title": "“This is your last warning!”: Trump’s ultimatum to ‘sick & twisted’ Hamas over hostage deal",
    "description": "United States breaks policy on negotiating with terrorist groups, holds secret talks with Hamas for hostages release.",
    "link": "https://www.thehindubusinessline.com/multimedia/video/this-is-your-last-warning-trumps-ultimatum-to-sick-twisted-hamas-over-hostage-deal/article69298652.ece",
    "timestamp": "2025-03-06T12:39:44Z"
  },
  {
    "title": "Top New Zealand diplomat fired for what he said about Trump",
    "description": "New Zealand's top diplomat to the UK, Phil Goff, was fired after making seemingly disparaging comments about President Donald Trump during an event in London.",
    "link": "https://www.foxnews.com/world/top-new-zealand-diplomat-fired-what-he-said-about-trump",
    "timestamp": "2025-03-06T12:38:54Z"
  },
  {
    "title": "After Trump threat, Hamas refuses to release more hostages without phase 2 ceasefire deal",
    "description": "Hamas ignored President Donald Trump's \"last warning\" to release the remaining Israeli hostages, saying it will only free them under a lasting ceasefire deal.",
    "link": "https://www.foxnews.com/world/after-trump-threat-hamas-refuses-release-more-hostages-without-phase-2-ceasefire-deal",
    "timestamp": "2025-03-06T12:38:35Z"
  },
  {
    "title": "How Trump justifies his tariffs — from budget balancing to protecting 'the soul' of America",
    "description": "How Trump justifies his tariffs — from budget balancing to protecting 'the soul' of Americaclickondetroit.com",
    "link": "https://www.clickondetroit.com/business/2025/03/06/how-trump-justifies-his-tariffs-from-budget-balancing-to-protecting-the-soul-of-america/",
    "timestamp": "2025-03-06T12:38:19Z"
  },
  {
    "title": "Florida Man Calls 911 Asking for Help to 'Assassinate' Trump",
    "description": "A man in Florida has been arrested after threatening to \"assassinate\" President Donald Trump while calling 911, police said.\nJustin Blaxton, 34, is accused of making a threat to discharge a destructive device, filing a false report of a bomb, and making false…",
    "link": "https://biztoc.com/x/a4e0b622c477b50f",
    "timestamp": "2025-03-06T12:36:30Z"
  },
  {
    "title": "Why Brown-Forman Corporation (BF-B) Went Up on Wednesday",
    "description": "We recently compiled a list of the 10 Stocks Lead Wednesday’s Charge, Mirror Broader Gains. In this article, we are going to take a look at where Brown...",
    "link": "https://finance.yahoo.com/news/why-brown-forman-corporation-bf-123530500.html",
    "timestamp": "2025-03-06T12:35:30Z"
  },
  {
    "title": "Trump sticking to Gaza relocation plan, as White House seems to dismiss Egyptian proposal",
    "description": "NSC spokesperson Brian Hughes states that Gaza is currently uninhabitable, and President Donald Trump remains committed to rebuilding Gaza free from Hamas.",
    "link": "https://www.foxnews.com/world/trump-sticking-gaza-relocation-plan-white-house-seems-dismiss-egyptian-proposal",
    "timestamp": "2025-03-06T12:34:28Z"
  },
  {
    "title": "Republicans Try to Rein in Elon Musk",
    "description": "Congressional Republicans are pushing to impose checks and balances on Musk and exert more control over DOGE's cuts.",
    "link": "https://www.newsweek.com/republicans-elon-musk-doge-cuts-2040452",
    "timestamp": "2025-03-06T12:34:02Z"
  },
  {
    "title": "Trump Reportedly Going to Give Linda McMahon an Order That Will Make Libs Seethe",
    "description": "President Donald J. Trump quipped that Secretary of Education Linda McMahon might not have a job for long. It seems he’s making good on that promise, reportedly drafting the executive order that’s been cooking for weeks: the abolishment of the department. It …",
    "link": "https://freerepublic.com/focus/f-chat/4302446/posts",
    "timestamp": "2025-03-06T12:33:48Z"
  },
  {
    "title": "Daylight saving time to be cancelled in US? Elon Musk asks Americans to vote on major change",
    "description": "Will daylight saving time cancelled in US? In a post on X, formerly known as Twitter, Elon Musk has put the future of daylight saving in hands of Americans after raising idea of canceling ritual with the poll receiving numerous responses. Trump himself had to…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/daylight-saving-time-to-be-cancelled-in-us-elon-musk-asks-americans-to-vote-on-major-change/articleshow/118762218.cms",
    "timestamp": "2025-03-06T12:33:41Z"
  },
  {
    "title": "Hamas says Trump's 'DEAD' threat to Gaza undermines ceasefire",
    "description": "Hamas said on Thursday that Donald Trump's threats would encourage Israel to disregard the fragile ceasefire, after the U.S. president said that unless hostages are freed, the people of Gaza would be \"DEAD.”",
    "link": "https://www.hurriyetdailynews.com/hamas-says-trumps-dead-threat-to-gaza-undermines-ceasefire-206601",
    "timestamp": "2025-03-06T12:33:15Z"
  },
  {
    "title": "Discord is reportedly \"in early talks with banks\" about going public, but the company won't comment on \"rumours or speculation\"",
    "description": "Would you invest?",
    "link": "https://www.gamesradar.com/games/discord-is-reportedly-in-early-talks-with-banks-about-going-public-but-the-company-wont-comment-on-rumours-or-speculation/",
    "timestamp": "2025-03-06T12:32:47Z"
  },
  {
    "title": "As Trump woos Russia, Kremlin shifts blame to Europe",
    "description": "As US President Trump halts support for Ukraine, the Kremlin shifts its antagonism towards European leaders while softening its stance on the US. Pro-Kremlin media echo Trump's criticism of Kyiv, with recent polling indicating Russians have become more hostil…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/as-trump-woos-russia-kremlin-shifts-blame-to-europe/articleshow/118762345.cms",
    "timestamp": "2025-03-06T12:32:37Z"
  },
  {
    "title": "Florida Man Calls 911 Asking for Help to 'Assassinate' Trump",
    "description": "Justin Blaxton asked for a ride to the airport so he could travel to the White House to \"assassinate\" Trump, said police.",
    "link": "https://www.newsweek.com/florida-man-911-assassinate-trump-justin-blaxton-2040467",
    "timestamp": "2025-03-06T12:32:36Z"
  },
  {
    "title": "Is Elon Musk romantically linked to mystery blonde woman Heather Valentino? Speculation about his connection to the woman runs rampant on social media",
    "description": "Heather Valentino, an aesthetician from Pennsylvania, was identified as the mysterious blonde sitting next to Elon Musk during Trump's speech. Social media was buzzing with speculation about their connection, but sources say they were strangers prior to the e…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-elon-musk-romantically-linked-to-mystery-blonde-woman-heather-valentino-speculation-about-his-connection-to-the-woman-runs-rampant-on-social-media/articleshow/118761604.cms",
    "timestamp": "2025-03-06T12:31:19Z"
  },
  {
    "title": "FO° Exclusive: Old Ghosts Come Roaring Back in New Germany",
    "description": "Germany’s recent election results have brought to the forefront the deepening fractures within the nation’s politics and society. The election showcased a significant shift in the political landscape, with the rise of the Alternative for Germany (AfD), a far-…",
    "link": "https://www.fairobserver.com/politics/fo-exclusive-old-ghosts-come-roaring-back-in-new-germany/",
    "timestamp": "2025-03-06T12:31:09Z"
  },
  {
    "title": "Trump Eyes Eliminating Education Department With New Order: Live Updates",
    "description": "Trump may take first steps to dismantle the Education Department this week, with an executive order in the works, sources say. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/trump-education-department-administration-live-updates-2040537",
    "timestamp": "2025-03-06T12:30:50Z"
  },
  {
    "title": "Disney and ABC News cuts include the shutdown of FiveThirtyEight",
    "description": "As President Donald Trump was giving his State-of-the-Union-type address on Tuesday, there was another breaking political news story. The Wall Street Journal’s Joe Flint reported that Disney was cutting about […]\nThe post Disney and ABC News cuts include the …",
    "link": "https://www.poynter.org/commentary/2025/538-disney-abc-layoffs-shut-down-nate-silver/",
    "timestamp": "2025-03-06T12:30:04Z"
  },
  {
    "title": "Draft executive order set for Thursday calls for closing Education Dept. (Laura Meckler/Washington Post)",
    "description": "Laura Meckler / Washington Post:\nDraft executive order set for Thursday calls for closing Education Dept.  —  Education Secretary Linda McMahon has said that congressional approval is needed to close the agency.  Deep cuts to the workforce are expected in the…",
    "link": "https://www.memeorandum.com/250306/p16",
    "timestamp": "2025-03-06T12:30:01Z"
  },
  {
    "title": "The Viral Video Meets the Authenticity Trap",
    "description": "For celebrities who use their platform to make a point, there’s a fine line between sincerity and self-awareness.",
    "link": "https://www.theatlantic.com/culture/archive/2025/03/hunter-schafer-celebrity-activism-trump-policies/681935/",
    "timestamp": "2025-03-06T12:30:00Z"
  },
  {
    "title": "‘Total Bullsh*t!’ House Dem Explodes at Trump in Profanity-Laced Rant – a Day After Glaring Congress Speech Protest",
    "description": "Rep. Melanie Stansbury (D-NM) let loose in a profanity-laced tirade during a House Oversight Committee hearing on sanctuary cities, slamming Republicans for grilling Democratic mayors on their compliance with the Trump administration’s immigration policy. New…",
    "link": "https://www.mediaite.com/news/total-bullsht-house-dem-explodes-at-trump-in-profanity-laced-rant-a-day-after-glaring-congress-speech-protest/",
    "timestamp": "2025-03-06T12:29:47Z"
  },
  {
    "title": "How Trump justifies his tariffs — from budget balancing to protecting ‘the soul’ of America",
    "description": "In Trump’s view, tariffs are a cure for many of the nation’s ills and a tool to reach new heights.",
    "link": "https://www.denverpost.com/2025/03/06/how-trump-justifies-tariffs/",
    "timestamp": "2025-03-06T12:29:46Z"
  },
  {
    "title": "Baristas are rebranding the Americano to ‘Canadiano’ in protest of Trump tariffs",
    "description": "Canadian baristas are rebranding a popular coffee drink—say your goodbyes to the Americano and embrace the Canadiano.\n\n\nBarista Magazine credits British Columbia’s Kicking Horse Coffee with kicking off the new trend.\n\n\n\"For 16 years, our Kicking Horse Café ha…",
    "link": "https://www.dailydot.com/culture/americano-rebranded-canadiano/",
    "timestamp": "2025-03-06T12:29:18Z"
  },
  {
    "title": "Britain warned to prepare for 'terrifying' possibility as Donald Trump could make major decision against UK",
    "description": "The UK have been urged to prepare for the possibility that US President Donald Trump could withdraw US support for the Trident nuclear-weapons system.",
    "link": "https://www.ladbible.com/news/uk-news/donald-trump-trident-nuclear-weapons-uk-risk-experts-warning-007001-20250306",
    "timestamp": "2025-03-06T12:28:26Z"
  },
  {
    "title": "NASA's stranded astronaut respond to Elon Musk's explosive claims about what is keeping them stuck in space?",
    "description": "Two NASA astronauts, Butch Wilmore and Suni Williams, have been stuck on the ISS for nearly 300 days due to technical malfunctions with Boeing's Starliner spacecraft. Elon Musk claims political reasons may be behind their extended stay. The astronauts address…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/nasas-stranded-astronaut-respond-to-elon-musks-explosive-claims-about-what-is-keeping-them-stuck-in-space/articleshow/118762064.cms",
    "timestamp": "2025-03-06T12:27:46Z"
  },
  {
    "title": "Ottawa, provinces agree to open the tap on Canadian booze",
    "description": "Ottawa has reached a deal with the majority of provinces to allow Canadian booze to flow more freely across the country just as U.S. liquor is pulled from their store shelves.",
    "link": "https://www.cbc.ca/news/politics/ottawa-provinces-agree-to-open-the-tap-on-canadian-booze-1.7476087",
    "timestamp": "2025-03-06T12:27:21Z"
  },
  {
    "title": "Zelenskyy arrives at emergency Europe summit amid pressure from US, Russia",
    "description": "Zelenskyy arrives at emergency Europe summit amid pressure from US, Russiago.com",
    "link": "https://abcnews.go.com/International/zelenskyy-arrives-emergency-europe-summit-amid-pressure-us/story?id=119503760",
    "timestamp": "2025-03-06T12:26:50Z"
  },
  {
    "title": "Federal appeals court sides with Trump on firing head of watchdog agency",
    "description": "President Trump got a victory in federal appeals court Wednesday when a judge cleared the way for him to fire Hampton Dellinger.",
    "link": "https://www.foxnews.com/politics/federal-appeals-court-sides-trump-firing-head-watchdog-agency",
    "timestamp": "2025-03-06T12:26:04Z"
  },
  {
    "title": "How bad a stock slump is this?",
    "description": "Donald Trump likes to talk in extremes. A stock market rally is the best ever. A decent economy is the best ever. \nThe President uses the stock market has a personal measure on his performance. But he doesn't like to talk about slumps. \nBut the market is in o…",
    "link": "https://biztoc.com/x/210026a5391d5d42",
    "timestamp": "2025-03-06T12:24:51Z"
  },
  {
    "title": "‘Thank You, Thank You’: Ukrainian president Zelensky’s 94-time gratitude video to America goes viral",
    "description": "Ukrainian President Volodymyr Zelensky thanked America 94 times, as per a viral video, reflecting his appreciation since the Russian invasion. Tensions arose during a White House meeting with Trump and Vance, leading to Zelensky's ejection. Trump suspended mi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/thank-you-thank-you-ukrainian-president-zelenskys-94-time-gratitude-video-to-america-goes-viral/articleshow/118760658.cms",
    "timestamp": "2025-03-06T12:24:39Z"
  },
  {
    "title": "Russian Lawmaker Praises Trump for 'Keeping All His Promises'",
    "description": "Russian MP Oleg Morozov welcomed the latest moves by the U.S. president to freeze aid and intelligence for Ukraine.",
    "link": "https://www.newsweek.com/morozov-trump-ukraine-aid-2040460",
    "timestamp": "2025-03-06T12:23:52Z"
  },
  {
    "title": "Minnesota Bill to Legalize Eating Beaver",
    "description": "According to startribune.com, about five months ago, the Minnesota House-Senate conference committee inserted a ban on eating beavers into the 2024 omnibus environment and natural resources bill. The ban only applies to nuisance beavers taken because they are…",
    "link": "https://freerepublic.com/focus/f-chat/4302444/posts",
    "timestamp": "2025-03-06T12:22:09Z"
  },
  {
    "title": "We must fight even harder to protect women’s health in the era of Trump and the global right",
    "description": "Much attention has been focused on the Trump administration’s rollback of women’s health and rights. But their alternative model of global health multilateralism will be equally damaging, writes Sophie Harman \n\nUS president Donald Trump has begun his attack o…",
    "link": "https://www.bmj.com/content/388/bmj.r459",
    "timestamp": "2025-03-06T12:21:17Z"
  },
  {
    "title": "European Rocket Aims For First Commercial Launch After Delays",
    "description": "After several false starts, Europe's new rocket Ariane 6 is aiming to finally blast off on its first commercial mission Thursday, carrying with it the continent's hopes of bolstering its security and independent access to space.",
    "link": "https://www.ibtimes.com/european-rocket-aims-first-commercial-launch-after-delays-3765328",
    "timestamp": "2025-03-06T12:21:15Z"
  },
  {
    "title": "Food rations for Rohingya refugees to be cut by half: UN",
    "description": "Officials have warned that the cuts will further increase food insecurity for members of the persecuted ethnic minority. The UN still hopes to raise enough funds to avert a nutrition crisis.",
    "link": "https://www.dw.com/en/food-rations-for-rohingya-refugees-to-be-cut-by-half-un/a-71843926",
    "timestamp": "2025-03-06T12:20:00Z"
  },
  {
    "title": "\"Complicates Matters Regarding Ceasefire\": Hamas On Trump's \"Dead\" Threat",
    "description": "Hamas said Thursday that Donald Trump&#039;s threats would encourage Israel to disregard the fragile ceasefire, after the US president said that unless hostages are freed, the people of Gaza would be &quot;DEAD&quot;.",
    "link": "https://www.ndtv.com/world-news/hamas-on-trumps-dead-threat-complicates-matters-regarding-ceasefire-7862678",
    "timestamp": "2025-03-06T12:19:40Z"
  },
  {
    "title": "Let's Call Elon Musk What He Is: A Parasite Extraordinaire",
    "description": "In a February article of her Reframing America newsletter, Antonia Scatton wrote, “For sixty years, a billionaire-funded network of corporations, politicians, PACs, news networks, churches, foundations and think tanks have demonized 'Washington' and governmen…",
    "link": "https://crooksandliars.com/2025/03/elon-musk-parasite-extraordinaire",
    "timestamp": "2025-03-06T12:19:26Z"
  },
  {
    "title": "Exclusive-UN slashes support for Rohingya refugees in Indonesia due to U.S. cuts, sources say",
    "description": "JAKARTA (Reuters) - The United Nations' migration agency has slashed aid to hundreds of Rohingya refugees in Indonesia, according to a letter seen by Reuters and two people briefed on the matter, because of massive funding cuts by their biggest donor, the Uni…",
    "link": "https://www.thestar.com.my/news/world/2025/03/06/exclusive-un-slashes-support-for-rohingya-refugees-in-indonesia-due-to-us-cuts-sources-say",
    "timestamp": "2025-03-06T12:19:00Z"
  },
  {
    "title": "Donald Trump's move towards multipolarity suits India: Jaishankar",
    "description": "External Affairs Minister S Jaishankar emphasized India's alignment with the US administration's move towards multipolarity, benefiting Indian interests. He highlighted ongoing discussions about a bilateral trade pact, India's diplomatic efforts in the Russia…",
    "link": "https://economictimes.indiatimes.com/news/india/donald-trumps-move-towards-multipolarity-suits-india-jaishankar/articleshow/118762010.cms",
    "timestamp": "2025-03-06T12:19:00Z"
  },
  {
    "title": "Under Karlie Kloss, i-D Magazine Is Still Punk",
    "description": "Thom Bettridge and Karlie Kloss lay out their vision for the British title that was founded in 1980.",
    "link": "http://wwd.com/business-news/media/karlie-kloss-i-d-magazine-reluanch-print-1237025499/",
    "timestamp": "2025-03-06T12:18:46Z"
  },
  {
    "title": "Judge Issues Nationwide Temporary Injunction Against NIH Research Cuts",
    "description": "A federal judge issued a temporary injunction Wednesday against NIH's plan to cut reimbursements of certain grant costs incurred by universities and other institutions.",
    "link": "https://www.forbes.com/sites/michaeltnietzel/2025/03/06/judge-issues-nationwide-temporary-injunction-against-nih-research-cuts/",
    "timestamp": "2025-03-06T12:18:08Z"
  },
  {
    "title": "How Trump justifies his tariffs – from budget balancing to protecting ‘the soul’ of America",
    "description": "WASHINGTON (AP) — To President Donald Trump, “tariff” is more than “the most beautiful word in the dictionary,” something he says often. Tariffs, in Trump’s view, are also a cure for a number of the nation’s ills and the tool to reach new heights. Most econom…",
    "link": "https://financialpost.com/pmn/how-trump-justifies-his-tariffs-from-budget-balancing-to-protecting-the-soul-of-america",
    "timestamp": "2025-03-06T12:18:03Z"
  },
  {
    "title": "Albania’s Upcoming Elections Could Install Pro-America Beachhead In Eastern Europe",
    "description": "‘The return of Trump marks the end of the use of U.S. taxpayers’ contribution, and U.S. power, against the conservative opposition parties around the world,’ says conservative leader Sali Berisha.",
    "link": "https://thefederalist.com/2025/03/06/albanias-upcoming-elections-could-install-pro-america-beachhead-in-eastern-europe/",
    "timestamp": "2025-03-06T12:17:51Z"
  },
  {
    "title": "Trump Presents the Gravest Threat to Social Security in Its 90-Year History",
    "description": "The last few weeks have been the most destabilizing for Social Security in its 90-year history.America’s historic retirement security program has survived world wars, pandemics, and recessions. But without a rapid course correction, it may not survive Donald …",
    "link": "https://otherwords.org/the-greatest-threat-to-social-security-in-its-90-year-history/",
    "timestamp": "2025-03-06T12:17:03Z"
  },
  {
    "title": "US Beefs Up Homeland Missile Defense Against North Korea's Nuclear Weapons",
    "description": "North Korea has acquired the ability to attack anywhere in the U.S. mainland with intercontinental ballistic missiles.",
    "link": "https://www.newsweek.com/us-news-alaska-ballistic-missile-defense-north-korea-nuclear-weapons-2040371",
    "timestamp": "2025-03-06T12:17:03Z"
  },
  {
    "title": "How Trump’s ‘Reverse Nixon’ Foreign Policy Can Avoid Nixon’s Costly Mistakes",
    "description": "President Trump’s 'reverse Nixon' approach carries profound risks, as the current geopolitical realities starkly contrast those of the 1970s.",
    "link": "https://thefederalist.com/2025/03/06/how-trumps-reverse-nixon-foreign-policy-can-avoid-nixons-costly-mistakes/",
    "timestamp": "2025-03-06T12:16:56Z"
  },
  {
    "title": "Trump reportedly to issue order to eliminate education department",
    "description": "President Donald Trump is reportedly set to issue an executive order to try to eliminate the Department of Education. Trump cannot abolish an entire department without Congress, but the administration may look for ways to defund programs instead, according to…",
    "link": "https://www.today.com/video/trump-to-sign-order-to-abolish-department-of-education-report-233626181843",
    "timestamp": "2025-03-06T12:16:09Z"
  },
  {
    "title": "No evidence Ukraine sold US weapons to Mexican cartels, militant groups",
    "description": "Russian propaganda has claimed Finnish gangsters, French rioters, Nigerian fighters and Mexican cartels received weapons from Ukraine.",
    "link": "https://www.snopes.com//news/2025/03/06/ukraine-black-market-weapon-sales/",
    "timestamp": "2025-03-06T12:16:00Z"
  },
  {
    "title": "DOGE abandons some VA plans and indictment in Sam Nordquist killing: Morning Rundown",
    "description": "Elon Musk, Donald Trump, veterans affairs, Ukraine, Russia, Sam Nordquist killing, Lester Holt, Tom Llamas, NBC Nightly News egg prices, pasture-raised chickens",
    "link": "https://www.nbcnews.com/news/doge-va-contracts-indictment-sam-nordquist-morning-rundown-rcna195063",
    "timestamp": "2025-03-06T12:15:50Z"
  },
  {
    "title": "Crypto Daybook Americas: Bitcoin Traders on Edge Ahead of Trump's Make or Break Crypto Summit",
    "description": "The day ahead in crypto: March 6, 2025",
    "link": "https://www.coindesk.com/daybook-us/2025/03/06/crypto-daybook-americas-bitcoin-traders-on-edge-ahead-of-trump-s-make-of-break-crypto-summit",
    "timestamp": "2025-03-06T12:15:48Z"
  },
  {
    "title": "The Nuclear-Level Risk of Superintelligent AI",
    "description": "AI researcher Dan Hendrycks and former Google CEO Eric Schmidt stress the dangers posed by superintelligent AI and offer a framework for preventing AI threats.",
    "link": "https://time.com/7265056/nuclear-level-risk-of-superintelligent-ai/",
    "timestamp": "2025-03-06T12:15:00Z"
  },
  {
    "title": "China slams US tariffs, says its economy is resilient but there are no winners in a trade war",
    "description": "China's commerce minister says Beijing will not yield to bullying and its economy can weather tariffs and other challenges, though there are “no winners in a trade war.\"",
    "link": "https://abcnews.go.com/Business/wireStory/china-slams-us-tariffs-economy-resilient-winners-trade-119504310",
    "timestamp": "2025-03-06T12:14:30Z"
  },
  {
    "title": "Trump touts tariffs while the market fears a recession",
    "description": "Data: Polymarket. Chart: Axios Visuals\nDonald Trump famously believes that \"trade wars are good, and easy to win,\" as he tweeted in 2018. The market, however, believes the opposite: That a trade war is bad, is easy to lose, and could plunge the U.S. into an a…",
    "link": "https://biztoc.com/x/d21a6c9dc4769593",
    "timestamp": "2025-03-06T12:14:10Z"
  },
  {
    "title": "India urged to counter US tariffs as ‘street fight’ looms",
    "description": "India must prepare for retaliatory measures if President Trump imposes higher tariffs on steel and aluminum. This action would significantly impact Indian exporters. Ongoing trade talks and tariff reductions hint at a negotiated deal. Ministries are working t…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-urged-to-counter-us-tariffs-as-street-fight-looms/articleshow/118761894.cms",
    "timestamp": "2025-03-06T12:12:54Z"
  },
  {
    "title": "US, Canadian leaders discuss trade amid new US tariffs",
    "description": "Top diplomats from the United States and Canada held talks Wednesday that included discussion of trade, while U.S. President Donald Trump delayed a new 25% tariff on vehicle imports from Canada and Mexico for a month.\n\n\nThe U.S. State Department said Secretar…",
    "link": "https://www.voanews.com/a/us-canadian-leaders-discuss-trade-amid-new-us-tariffs/8000867.html",
    "timestamp": "2025-03-06T12:12:39Z"
  },
  {
    "title": "UN releases $110 million to compensate global aid cut",
    "description": "Amid cuts by major countries, the UN is trying to fill the global aid gap. It has described 2025 as a year of \"unprecedented levels of suffering.\"",
    "link": "https://www.dw.com/en/un-releases-110-million-to-compensate-global-aid-cut/a-71844414",
    "timestamp": "2025-03-06T12:12:00Z"
  },
  {
    "title": "Transcript: Trump Press Sec Blurts Out the Real Aim of His Tariff Scam",
    "description": "The following is a lightly edited transcript of the March 6 episode of The Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nIn his sp…",
    "link": "https://newrepublic.com/article/192397/transcript-trump-press-sec-blurts-real-aim-tariff-scam",
    "timestamp": "2025-03-06T12:11:32Z"
  },
  {
    "title": "Make Alberta America",
    "description": "If Donald Trump wants a 51st state to the north, here’s how he can get one. For weeks, President Donald Trump has said that Canada should be America’s 51st state. He has mocked Canada’s economic dependence on the United States. He has condemned Canadian tarif…",
    "link": "https://freerepublic.com/focus/f-chat/4302443/posts",
    "timestamp": "2025-03-06T12:11:10Z"
  },
  {
    "title": "Ukrainian opposition leaders dismiss idea of wartime election",
    "description": "KYIV (Reuters) - Ukrainian opposition leaders have dismissed the idea of holding a wartime election, after a media report of contacts between them and U.S. officials and in the wake of President Donald Trump calling his Ukrainian counterpart Volodymyr Zelensk…",
    "link": "https://www.thestar.com.my/news/world/2025/03/06/ukrainian-opposition-leaders-dismiss-idea-of-wartime-election",
    "timestamp": "2025-03-06T12:11:00Z"
  },
  {
    "title": "'Stunning reversal': Trump reportedly plans new blow to Ukrainians fleeing Russian bombing",
    "description": "Donald Trump's war with Ukrainian President Volodymyr Zelensky appears to be entering a new stage according to a report from Reuters.\n\nThe U.S. president has been battling with the leader of the war-torn nation which was illegally invaded by Russia three year…",
    "link": "https://www.rawstory.com/trump-ukraine-2671280214/",
    "timestamp": "2025-03-06T12:10:58Z"
  },
  {
    "title": "MAGA Mike's Chief Of Staff Arrested For DUI After Trump Speech",
    "description": "Hayden Haynes, the chief of staff to House Speaker Mike Johnson, one of the most powerful aides on Capitol Hill, and a trusted and longtime aide to Johnson, was arrested after Donald Krasnov Trump's State of the Union address to Congress, for drunken driving …",
    "link": "https://crooksandliars.com/2025/03/maga-mikes-chief-staff-arrested-dui-after",
    "timestamp": "2025-03-06T12:10:15Z"
  },
  {
    "title": "Most voters think Dems don't have their act together, insider poll shows (Politico)",
    "description": "Politico:\nMost voters think Dems don't have their act together, insider poll shows  —  A liberal pollster finds just 10 percent of voters think Democrats have a good plan for opposing the president.  —  Voters still have a sour view of Democrats six weeks aft…",
    "link": "https://www.memeorandum.com/250306/p13",
    "timestamp": "2025-03-06T12:10:00Z"
  },
  {
    "title": "UN to halve Rohingya food aid in Bangladesh amid funding crunch",
    "description": "World Food Programme says 'severe funding shortfalls' to force cut in monthly food vouchers from $12.50 to $6.",
    "link": "https://www.aljazeera.com/news/2025/3/6/un-to-halve-rohingya-food-aid-in-bangladesh-amid-funding-crunch",
    "timestamp": "2025-03-06T12:08:32Z"
  },
  {
    "title": "Ukrainians call Trump's move to halt vital intel 'pathetic' and 'petty'",
    "description": "Ukraine has enough weapons to fight Russia unaffected for a few weeks, but President Trump’s cessation of intelligence-sharing will cost lives Ukrainians said.",
    "link": "https://www.nbcnews.com/news/world/ukraine-trump-intelligence-sharing-russia-putin-war-kyiv-zelenskyy-rcna194907",
    "timestamp": "2025-03-06T12:08:32Z"
  },
  {
    "title": "US 'destroying' international rules-based order by trying to meet Russia 'halfway', Ukraine's UK ambassador warns",
    "description": "The United States is \"finally destroying\" the international rules-based order by trying to meet Russia \"halfway\", Ukraine's ambassador to the UK has warned.",
    "link": "https://news.sky.com/story/us-destroying-international-rules-based-order-by-trying-to-meet-russia-halfway-ukraines-uk-ambassador-warns-13322700",
    "timestamp": "2025-03-06T12:06:00Z"
  },
  {
    "title": "Support for million children under threat amid aid freeze-UNICEF",
    "description": "UNICEF warns that global foreign aid cuts threaten support for millions of children, urges donors to sustain funding for critical programs amid US decision to pause funding.",
    "link": "https://www.standardmedia.co.ke/health/health-science/article/2001513267/support-for-million-children-under-threat-amid-aid-freeze-unicef",
    "timestamp": "2025-03-06T12:04:54Z"
  },
  {
    "title": "China slams US tariffs, says its economy is resilient but there are no winners in a trade war",
    "description": "China remains firm against U.S. tariffs and expresses openness to negotiate, emphasizing that coercion will not work. Despite challenges, China plans to expand globally, support its economy through increased consumer demand and investment, and draft strategie…",
    "link": "https://economictimes.indiatimes.com/news/international/business/china-slams-us-tariffs-says-its-economy-is-resilient-but-there-are-no-winners-in-a-trade-war/articleshow/118761717.cms",
    "timestamp": "2025-03-06T12:03:23Z"
  },
  {
    "title": "China slams US tariffs, says its economy is resilient but there are no winners in a trade war",
    "description": "China will not yield to bullying and its economy can weather higher tariffs imposed by U.S. President Donald Trump and other challenges, the Chinese commerce minister said Thursday, though he added that there are “no winners in a trade war.\"\nSpeaking on the s…",
    "link": "https://biztoc.com/x/341b23547acdbf3f",
    "timestamp": "2025-03-06T12:03:18Z"
  },
  {
    "title": "As Trump Woos Russia, Kremlin Shifts Blame To Europe",
    "description": "For three years, the Kremlin saw the United States as its biggest enemy, accusing US President Joe Biden of prolonging the Ukraine conflict by supplying weapons to Kyiv.",
    "link": "https://www.ibtimes.com/trump-woos-russia-kremlin-shifts-blame-europe-3765325",
    "timestamp": "2025-03-06T12:03:08Z"
  },
  {
    "title": "As Trump Woos Russia, Kremlin Shifts Blame To Europe",
    "description": "For three years, the Kremlin saw the United States as its biggest enemy, accusing US President Joe Biden of prolonging the Ukraine conflict by supplying weapons to Kyiv.",
    "link": "https://www.ibtimes.com.au/trump-woos-russia-kremlin-shifts-blame-europe-1856645",
    "timestamp": "2025-03-06T12:03:07Z"
  },
  {
    "title": "What Americans really think of Trump’s Ukraine policy",
    "description": "US President Donald Trump and Ukraine’s President Volodymyr Zelensky meet in the Oval Office of the White House in Washington, DC, February 28, 2025. | Saul Loeb/AFP via Getty Images\nPresident Donald Trump has completely upended America’s position on the Ukra…",
    "link": "https://biztoc.com/x/21dc335b1bf04d05",
    "timestamp": "2025-03-06T12:03:05Z"
  }
]