[
  {
    "title": "Trump's Latest Executive Order is a Sham--and a Warning (Marc Elias/Democracy Docket)",
    "description": "Marc Elias / Democracy Docket:\nTrump's Latest Executive Order is a Sham—and a Warning  —  The greatest threat to Donald Trump's authoritarian dream is not the courts — it is free and fair elections.  While the courts can stand in the way of his twisted vision…",
    "link": "https://www.memeorandum.com/250326/p92",
    "timestamp": "2025-03-26T19:30:01Z"
  },
  {
    "title": "Democrats narrowly win a Pennsylvania Senate seat, scoring an upset in Republican-leaning suburbs | CNN Politics",
    "description": "Democrat James Andrew Malone narrowly won a special election for a Pennsylvania state Senate seat in a stretch of Republican-leaning suburbs and farming communities, scoring an upset in a territory that a Democrat hasn’t represented in the chamber for 136 yea…",
    "link": "https://www.cnn.com/2025/03/26/politics/pennsylvania-state-senate-special-election-malone/index.html",
    "timestamp": "2025-03-26T19:29:45Z"
  },
  {
    "title": "Copper prices surge to record high amid tariff anxiety",
    "description": "Copper prices surge to record high amid tariff anxietyabc12.com",
    "link": "https://www.abc12.com/news/business/copper-prices-surge-to-record-high-amid-tariff-anxiety/article_2ec639ac-c1cb-557d-81ee-c3a4803d4985.html",
    "timestamp": "2025-03-26T19:29:00Z"
  },
  {
    "title": "Kids Are Getting Sick From RFK Jr.’s False Measles Remedy, Doctors Say",
    "description": "Nearly 380 cases of measles have been identified in the US this year, the highest number since 2019.",
    "link": "https://truthout.org/articles/kids-are-getting-sick-from-rfk-jr-s-false-measles-remedy-doctors-say/",
    "timestamp": "2025-03-26T19:28:29Z"
  },
  {
    "title": "Javier Bardem Signs Letter by Israeli, Palestinian Fathers to End War",
    "description": "The plea for a return to negotiations and a possible ceasefire in Gaza by Rami Elhanan and Bassam Aramin was published in the Spanish newspaper El Pais.",
    "link": "http://www.hollywoodreporter.com/news/general-news/javier-bardem-signs-letter-israeli-palestinian-end-war-1236173312/",
    "timestamp": "2025-03-26T19:28:00Z"
  },
  {
    "title": "Exclusive: DOJ Orders Law Schools to Halt 'Abominable' DEI Admissions Practices",
    "description": "The Department of Justice has ordered every U.S. law school to halt DEI admissions, which AG Pam Bondi called an \"abominable practice.\"\nThe post Exclusive: DOJ Orders Law Schools to Halt ‘Abominable’ DEI Admissions Practices appeared first on Breitbart.",
    "link": "https://www.breitbart.com/education/2025/03/26/exclusive-doj-orders-law-schools-halt-abominable-dei-admissions-practices/",
    "timestamp": "2025-03-26T19:27:28Z"
  },
  {
    "title": "What’s the fallout of the US security breach?",
    "description": "Donald Trump downplays the disclosure of sensitive military information.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/3/26/whats-the-fallout-of-the-us-security-breach",
    "timestamp": "2025-03-26T19:26:49Z"
  },
  {
    "title": "Microsoft has killed \"several\" data center projects in the U.S. and Europe, according to reports",
    "description": "Bloomberg is reporting that Microsoft is reducing its data center footprint globally, citing oversupply.",
    "link": "https://www.windowscentral.com/microsoft/microsoft-has-killed-several-data-center-projects-in-the-u-s-and-europe-according-to-reports",
    "timestamp": "2025-03-26T19:26:48Z"
  },
  {
    "title": "Voice Of America’s Director Sues To Reverse Trump Administration’s Shutdown Of U.S.-Backed Media Outlet",
    "description": "The director of Voice of America filed suit against Trump administration officials today, seeking a court order to stop the dismantling of the U.S. operated international broadcaster. In a lawsuit filed in U.S. District Court in Washington, Michael Abramowitz…",
    "link": "http://deadline.com/2025/03/voice-of-america-trump-shutdown-1236351476/",
    "timestamp": "2025-03-26T19:26:17Z"
  },
  {
    "title": "The Trump Team’s Denials Are Laughable",
    "description": "The president’s officials must know that what they did in the Signal group chat was wrong—and dangerous.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/03/signal-group-chat-trump-denials/682179/",
    "timestamp": "2025-03-26T19:26:00Z"
  },
  {
    "title": "The Real Outrage About the Yemen Signal Group Is That It Called for Attack on Civilian Home",
    "description": "“We had positive ID of him walking into his girlfriend’s building and it’s now collapsed.”\nThe post The Real Outrage About the Yemen Signal Group Is That It Called for Attack on Civilian Home appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/03/26/signal-chat-yemen-strike/",
    "timestamp": "2025-03-26T19:25:45Z"
  },
  {
    "title": "The ‘state secrets privilege’ sounds mysterious. Here’s what it is and how it works",
    "description": "The Trump administration is invoking a powerful tool in seeking to cut off a judge’s inquiry into whether it defied his order.",
    "link": "https://www.bostonherald.com/2025/03/26/state-secrets-privilege-explainer/",
    "timestamp": "2025-03-26T19:25:10Z"
  },
  {
    "title": "Episcopal bishop criticized by President Trump has a 2-book deal with young readers publisher",
    "description": "Both are based on the Right Rev. Mariann Edgar Budde’s best-selling 'How We Learn to Be Brave.'",
    "link": "https://www.bostonherald.com/2025/03/26/books-episcopal-bishop-budde/",
    "timestamp": "2025-03-26T19:24:41Z"
  },
  {
    "title": "Trump Takes Presidential Power To A Whole New Level In New Court Filing",
    "description": "The Trump administration claims it has vast power to declare people in the U.S.  terrorists and send them to a foreign prison — without hearings or evidence.",
    "link": "https://www.huffpost.com/entry/trump-alien-enemies-act-tren-de-aragua-terrorists-el-salvador_n_67e43a17e4b03483d8f9a801",
    "timestamp": "2025-03-26T19:24:20Z"
  },
  {
    "title": "Donald Trump's Losing Control of the Narrative With Swing Voters: Data",
    "description": "Tens of thousands of swing voters tracked online are further expressing a \"growing fear\" about President Trump's \"long-term direction.\"",
    "link": "https://www.newsweek.com/donald-trump-poll-swing-voters-maga-2050996",
    "timestamp": "2025-03-26T19:23:28Z"
  },
  {
    "title": "MAGA defends Yemen Signal convo leak with semantic ‘attack’ isn’t ‘war plans’ stance",
    "description": "Supporters of President Donald Trump have concocted a new excuse to downplay the administration's embarrassing leak of sensitive military plans by arguing over the difference between an \"attack\" and \"war.\"\n\n\nThe latest excuse comes after Jeffrey Goldberg, the…",
    "link": "https://www.dailydot.com/debug/attack-war-signal-yemen-plan-leak/",
    "timestamp": "2025-03-26T19:22:59Z"
  },
  {
    "title": "'Bad people': Trump still raging over Colorado's unflattering painting of him",
    "description": "President Donald Trump blamed \"bad people\" for an unflattering portrait of him that was hung in Colorado's state Capitol building.After complaining about the portrait on his Truth Social platform, he took to Newsmax to air additional grievances.Trump told hos…",
    "link": "https://www.rawstory.com/trump-colorado-portrait/",
    "timestamp": "2025-03-26T19:22:55Z"
  },
  {
    "title": "Fani Willis 'thinks she's above the law,' says Georgia lawmaker in subpoena fight",
    "description": "Georgia lawmakers deliberated Wednesday on how to press Fulton County District Attorney Fani Willis to comply with a committee subpoena.",
    "link": "https://www.foxnews.com/politics/fani-willis-thinks-shes-above-law-georgia-lawmaker-subpoena-fight-says",
    "timestamp": "2025-03-26T19:22:37Z"
  },
  {
    "title": "Fani Willis and Nathan Wade Spotted Together at LAX After Testifying Their Relationship Ended in 2023 (VIDEO)",
    "description": "Fulton County DA Fani Willis and Nathan Wade were recently seen together at LAX, raising questions about their purportedly ended relationship. This revelation adds a new layer to ongoing investigations.\nThe post Fani Willis and Nathan Wade Spotted Together at…",
    "link": "https://www.thegatewaypundit.com/2025/03/fani-willis-nathan-wade-spotted-together-lax-after/",
    "timestamp": "2025-03-26T19:20:56Z"
  },
  {
    "title": "Senior US Republican wants probe into Signal chat on Houthi attack",
    "description": "WASHINGTON: A powerful US Senate Republican called on Wednesday (Mar 26) for an independent probe of Trump administration officials' discussion of sensitive attack plans on Signal, after c",
    "link": "https://www.channelnewsasia.com/world/us-lawmakers-probe-signal-chat-houthi-attack-5026241",
    "timestamp": "2025-03-26T19:19:00Z"
  },
  {
    "title": "Marjorie Taylor Green-Led DOGE Panel Rips ‘Radical Left’ NPR and PBS, Calls to End Public Funding",
    "description": "NPR boss Katherine Maher was questioned about 2020 tweets in which she called President Trump a \"fascist\" and \"deranged racist sociopath\" \nThe post Marjorie Taylor Green-Led DOGE Panel Rips ‘Radical Left’ NPR and PBS, Calls to End Public Funding appeared firs…",
    "link": "https://www.thewrap.com/marjorie-taylor-greene-npr-pbs-congressional-hearing/",
    "timestamp": "2025-03-26T19:18:55Z"
  },
  {
    "title": "NTSB chairwoman says reviewing the data after midair crash may prevent the next aviation accident",
    "description": "The head of the agency investigating the deadly midair collision that killed 67 said Wednesday that someone should have spotted the alarming number of near misses in the skies over the nation’s capital beforehand and reviewing the data now could preven...",
    "link": "https://abcnews.go.com/Business/wireStory/ntsb-chairwoman-reviewing-data-after-midair-crash-prevent-120190296",
    "timestamp": "2025-03-26T19:18:17Z"
  },
  {
    "title": "WestJet launches Wi-Fi service powered by Elon Musk’s Starlink",
    "description": "MONTREAL — WestJet has launched an on-board Wi-Fi service powered by Starlink, the satellite internet technology made by Elon Musk’s rocket company, SpaceX, sparking a limited backlash from Canadians. In an email, the airline confirmed it activated the servic…",
    "link": "https://financialpost.com/pmn/westjet-launches-wi-fi-service-powered-by-elon-musks-starlink",
    "timestamp": "2025-03-26T19:16:33Z"
  },
  {
    "title": "EU ‘rearmament’ plan meets resistance over debt concerns – Politico",
    "description": "Southern European states have been pushing against EU militarization plan over fears of rising debt, according to a report Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614819-eu-rearmament-plan-resistance/",
    "timestamp": "2025-03-26T19:15:29Z"
  },
  {
    "title": "DOGE marks millions — all 120+ years old — as deceased in Social Security database",
    "description": "The Department of Government Efficiency announced Monday evening that it had purged roughly 7 million Social Security number-holders listed as at least 120 years old. Earlier this month, the DOGE revealed that the Social Security Administration's database had…",
    "link": "https://freerepublic.com/focus/f-news/4306931/posts",
    "timestamp": "2025-03-26T19:15:10Z"
  },
  {
    "title": "President Trump Directs the Declassification and Release of FBI Russiagate Files – Essentially, “the Mar-a-Lago Binder”",
    "description": "Yesterday President Donald Trump signed an executive order targeting: “Immediate Declassification of Materials Related to the Federal Bureau of Investigation’s Crossfire Hurricane Investigation.” [ORDER TEXT HERE]Within the XO President Trump informs the Atto…",
    "link": "https://freerepublic.com/focus/f-bloggers/4306930/posts",
    "timestamp": "2025-03-26T19:14:45Z"
  },
  {
    "title": "President Trump Directs the Declassification and Release of FBI Russiagate Files – Essentially, “the Mar-a-Lago Binder”",
    "description": "Yesterday President Donald Trump signed an executive order targeting: “Immediate Declassification of Materials Related to the Federal Bureau of Investigation’s Crossfire Hurricane Investigation.” [ORDER TEXT HERE]Within the XO President Trump informs the Atto…",
    "link": "https://freerepublic.com/focus/f-news/4306930/posts",
    "timestamp": "2025-03-26T19:14:45Z"
  },
  {
    "title": "Trump plans to eliminate U.S. funding for malaria and worldwide child vaccination: report",
    "description": "President Donald Trump's administration has notified Congress in a new letter they intend to eliminate several foreign aid programs critical for public health, including efforts to combat malaria and a grant to a program responsible for vaccinating millions o…",
    "link": "https://www.rawstory.com/trump-usaid-2671511944/",
    "timestamp": "2025-03-26T19:14:42Z"
  },
  {
    "title": "Air force chief 'very comfortable' with response to Chinese warships",
    "description": "In his first interview since assuming the job last year, Air Marshall Stephen Chappell has warned the country is in a period of strategic volatility as potential military threats grow across the Indo-Pacific, and insists Australia is not overly reliant on the…",
    "link": "https://www.abc.net.au/news/2025-03-27/air-marshal-chief-comfortable-chinese-warship-response/105100672",
    "timestamp": "2025-03-26T19:14:29Z"
  },
  {
    "title": "Atlantic story on Yemen chat reportedly showed a rare time Vance broke with Trump",
    "description": "JD Vance made a noteworthy statement in the Signal chat, breaking with Donald Trump and questioning if the attacks on the Houthis in Yemen should be delayed.",
    "link": "https://abcnews.go.com/Politics/atlantic-story-yemen-chat-reportedly-showed-rare-instance/story?id=120139751",
    "timestamp": "2025-03-26T19:13:54Z"
  },
  {
    "title": "Trump Orders Department Of Education Closure: What Happens Next",
    "description": "President Trump has issued an executive order to close the Department of Education, which will reshape federal education policy and affect 49.5 million students.",
    "link": "https://www.forbes.com/sites/sarahhernholm/2025/03/26/trump-orders-department-of-education-closure-what-happens-next/",
    "timestamp": "2025-03-26T19:13:09Z"
  },
  {
    "title": "Why is the US bombing Yemen in the first place?",
    "description": "The Trump administration's snowballing \"Signalgate\" scandal has helped refocus public attention onto one of the nation's least-understood military entanglements",
    "link": "https://theweek.com/politics/signal-leak-yemen-bomb-hegseth-goldberg",
    "timestamp": "2025-03-26T19:12:53Z"
  },
  {
    "title": "Youngkin revives park at Monroe's estate, but Dem leaders oppose it",
    "description": "A proposal to turn Oak Hill, the 18th-century Loudoun County estate of President James Monroe into a state park looks ominous when the General Assembly returns next week.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_0c78d0a3-8c4e-4abb-b1db-2dd9ef683eff.html",
    "timestamp": "2025-03-26T19:12:00Z"
  },
  {
    "title": "Trump expected to announce new auto tariffs this afternoon",
    "description": "President Donald Trump is expected to announce new measures imposing tariffs on automobiles Wednesday afternoon.",
    "link": "https://biztoc.com/x/dbb59c26c8b7a31a",
    "timestamp": "2025-03-26T19:11:34Z"
  },
  {
    "title": "Hegseth says no classified information was shared in Signal group chat: 'Nobody's texting war plans'",
    "description": "Defense Secretary Pete Hegseth push backed amid questions about possible classified information being share during a group chat earlier this month.",
    "link": "https://www.foxnews.com/politics/hegseth-says-no-classified-information-shared-signal-group-chat-nobodys-texting-war-plans",
    "timestamp": "2025-03-26T19:11:23Z"
  },
  {
    "title": "The reappearance of Neil Gorsuch’s sporadic textualism",
    "description": "In a gun control case, no less:  The Supreme Court on Wednesday upheld a Biden administration regulation on the nearly impossible-to-trace weapons called ghost guns, clearing the way for continued serial numbers, background checks and age verification require…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/the-reappearance-of-neil-gorsuchs-sporadic-textualism",
    "timestamp": "2025-03-26T19:11:17Z"
  },
  {
    "title": "Trump tariffs could push up inflation: senior Fed official",
    "description": "US President Donald Trump's tariff plans could increase inflation by as much as 1.2 percentage points if they are fully implemented.\nThe post Trump tariffs could push up inflation: senior Fed official appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/trump-tariffs-could-push-up-inflation-senior-fed-official/article",
    "timestamp": "2025-03-26T19:10:33Z"
  },
  {
    "title": "PublicSquare Is an Inadvertent Gift to People Who Don’t Want to Fund Fascism",
    "description": "I don’t know where I heard about PublicSquare, and I’m not sure why people in my sphere (including me) are just now learning about this four-year-old, not-new company. Probably because it’s stupid and who cares? But for whatever reason, all of my algorithms i…",
    "link": "https://www.thestranger.com/news/2025/03/25/79983467/publicsquare-is-an-inadvertent-gift-to-people-who-dont-want-to-fund-fascism",
    "timestamp": "2025-03-26T19:10:00Z"
  },
  {
    "title": "Taiwan's silicon crucible: Chris Miller dissects how Trump's tariff blitz reshapes US-China chip war dynamics",
    "description": "In the shadow of broader trade tensions, tariffs on Chinese goods have quietly doubled during the first two months of Donald Trump's second term—a significant economic shift that has gone largely unnoticed. Renowned \"Chip War\" author Chris Miller brought this…",
    "link": "https://www.digitimes.com/news/a20250325VL209/taiwan-war-tsmc.html",
    "timestamp": "2025-03-26T19:10:00Z"
  },
  {
    "title": "Trump expected to announce new auto tariffs this afternoon",
    "description": "President Donald Trump is expected to announce new measures imposing tariffs on automobiles Wednesday afternoon.",
    "link": "https://www.nbcnews.com/business/autos/trump-auto-tariffs-which-companies-how-much-when-what-to-know-rcna198223",
    "timestamp": "2025-03-26T19:09:29Z"
  },
  {
    "title": "‘Deceptive’: Election-integrity team warns Democrat running for state Supreme Court to quit lying",
    "description": "Charges her claims are in violation of judicial code of conduct",
    "link": "https://www.wnd.com/2025/03/deceptive-election-integrity-team-warns-democrat-running-for-state-supreme-court-to-quit-lying/",
    "timestamp": "2025-03-26T19:08:52Z"
  },
  {
    "title": "NTSB chairwoman says reviewing the data after midair crash may prevent the next aviation accident",
    "description": "The NTSB leader told Congress that someone should have spotted the alarming number of near misses in the skies over the nation’s capital.",
    "link": "https://www.bostonherald.com/2025/03/26/congress-hearings-aircraft-collision-ntsb/",
    "timestamp": "2025-03-26T19:08:08Z"
  },
  {
    "title": "Karoline Leavitt Confronted in Briefing About Dave Portnoy’s Call for Firings at the White House Over Signalgate",
    "description": "New York Post reporter Steven Nelson asked White House Press Secretary Karoline Leavitt about Dave Portnoy's call for the NSA to step down.\nThe post Karoline Leavitt Confronted in Briefing About Dave Portnoy’s Call for Firings at the White House Over Signalga…",
    "link": "https://www.mediaite.com/news/karoline-leavitt-confronted-in-briefing-about-dave-portnoys-call-for-firings-at-the-white-house-over-signalgate/",
    "timestamp": "2025-03-26T19:08:07Z"
  },
  {
    "title": "‘You’re A Rabid Progressive’: CEO Of Taxpayer-Funded NPR Skewered For Left-Wing Statements, ‘Pro-Censorship’ Views",
    "description": "Katherine Maher faced questions from Republicans at a House Oversight Subcommittee hearing over her history of far-left statements and support for censorship.",
    "link": "https://dailycaller.com/2025/03/26/npr-ceo-gop-grilling-rabid-left-wing-statements-censorship/",
    "timestamp": "2025-03-26T19:07:30Z"
  },
  {
    "title": "City council unanimously backs restricting U.S. companies from bidding on Toronto contracts",
    "description": "Council unanimously backed Chow’s 10-point plan to respond to the tariff fight on Wednesday, though some councillors said Toronto needs to be careful not to alienate potential visitors from the U.S., or American companies looking to invest in the city.",
    "link": "https://www.cbc.ca/news/canada/toronto/toronto-tariff-response-plan-1.7494034",
    "timestamp": "2025-03-26T19:07:20Z"
  },
  {
    "title": "TRUMP Pimps Out The EASTER BUNNY For Corporate Cash Grab",
    "description": "David Shuster explains how Donald Trump even finds a way to turn the annual White House Easter Egg Hunt on the grounds into a gauche, gross opportunity for for even more corporate corruption. Trump has added sponsorships so billionaires, corporate interests, …",
    "link": "https://crooksandliars.com/2025/03/trump-pimps-out-easter-bunny-corporate",
    "timestamp": "2025-03-26T19:07:13Z"
  },
  {
    "title": "Co-POTUS Floats Idea Of Financial Compensation For Jan. 6 Rioters",
    "description": "It wasn't enough for co-president Donald Trump to grant clemency to about 1,500 rioters, so now he's floating the idea of monetary compensation for his supporters who stormed the Capitol, including hundreds convicted of assaulting police, carrying firearms, a…",
    "link": "https://crooksandliars.com/2025/03/co-potus-floats-idea-financial",
    "timestamp": "2025-03-26T19:07:13Z"
  },
  {
    "title": "Mike Johnson Suggests Eliminating Federal Courts After Trump Rulings Blocked",
    "description": "“We can eliminate an entire district court,” Republican House Speaker Mike Johnson told reporters.",
    "link": "https://truthout.org/articles/mike-johnson-suggests-eliminating-federal-courts-after-trump-rulings-blocked/",
    "timestamp": "2025-03-26T19:06:03Z"
  },
  {
    "title": "Trump Signs Executive Order To Require Proof Of Citizenship To Vote",
    "description": "President Trump signed an executive order requiring states to require proof of citizenship to vote in federal elections to \"secure our elections.\"",
    "link": "https://dailycaller.com/2025/03/26/trump-executive-order-citizenship-proof-vote-id/",
    "timestamp": "2025-03-26T19:05:35Z"
  },
  {
    "title": "We Need the Voice of America Now More Than Ever",
    "description": "Cutting off independent media abroad leaves the United States vulnerable at home.",
    "link": "http://foreignpolicy.com/2025/03/26/trump-voa-rfa-cuts-truth-russia-propaganda/",
    "timestamp": "2025-03-26T19:05:28Z"
  },
  {
    "title": "CARRIE SHEFFIELD: Tom Emmer Is Right To Call Out Republican Self-Sabotage",
    "description": "Republicans are riding a wave of enthusiasm and good will after a historic November victory, yet some are still mired in self-sabotage.",
    "link": "https://dailycaller.com/2025/03/26/carrie-sheffield-tom-emmer-is-right-to-call-out-republican-self-sabotage/",
    "timestamp": "2025-03-26T19:04:48Z"
  },
  {
    "title": "Why Dave Roberts backs off and joins the Dodgers' visit to the White House",
    "description": "The Los Angeles Dodgers are riding high after their 2024 World Series win, and now they&apos;re gearing up for a special pit stop- a White House visit on April 7. Manager Dave Robe",
    "link": "https://www.marca.com/en/mlb/los-angeles-dodgers/2025/03/26/67e44f49e2704e74b98b45be.html",
    "timestamp": "2025-03-26T19:03:21Z"
  },
  {
    "title": "Ten Questions for NPR’s Katherine Maher - What Republicans should ask the public radio CEO when she testifies before Congress",
    "description": "Katherine Maher is preparing for the hot seat. The embattled NPR CEO is scheduled to testify before Congress later today and will face intense scrutiny from Republicans who have already introduced legislation to defund the left-wing radio station. Last year, …",
    "link": "https://freerepublic.com/focus/f-chat/4306927/posts",
    "timestamp": "2025-03-26T19:02:45Z"
  },
  {
    "title": "Trump tariffs could push up inflation: senior Fed official",
    "description": "US President Donald Trump’s tariff plans could increase inflation by as much as 1.2 percentage points if they are fully implemented, a senior Federal Reserve official said Wednesday. Trump made tackling inflation a key campaign issue in the run-up to the 2024…",
    "link": "https://www.digitaljournal.com/world/trump-tariffs-could-push-up-inflation-senior-fed-official/article",
    "timestamp": "2025-03-26T19:02:33Z"
  },
  {
    "title": "Trump's executive order on elections is far-reaching. But will it actually stick?",
    "description": "President Donald Trump’s executive order seeking broad changes to how elections are run in the U.S. is vast in scope and holds the potential to reorder the voting landscape across the country, even as it faces almost certain litigation",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-executive-order-elections-reaching-stick-120155420",
    "timestamp": "2025-03-26T19:02:25Z"
  },
  {
    "title": "Tuya Inc. (TUYA) Integrates Emotional AI to Enhance Smart Home Ecosystem",
    "description": "We recently published a list of Top 11 AI News Updates on Wall Street’s Radar. In this article, we are going to take a look at where Tuya Inc. (NYSE:TUYA...",
    "link": "https://finance.yahoo.com/news/tuya-inc-tuya-integrates-emotional-190215088.html",
    "timestamp": "2025-03-26T19:02:15Z"
  },
  {
    "title": "Rubio visits the Caribbean, where energy and migration will top his agenda this week",
    "description": "U.S. Secretary of State Marco Rubio is in Jamaica as part of a tour of the Caribbean as the Trump administration increasingly focuses its attention on the Western Hemisphere",
    "link": "https://abcnews.go.com/International/wireStory/rubio-visits-caribbean-energy-migration-top-agenda-week-120180698",
    "timestamp": "2025-03-26T19:02:10Z"
  },
  {
    "title": "Elon Musk's Noxious Politics May Tank Tesla",
    "description": "Elon Musk's pivot toward right-wing politics is having an undeniable market impact on his car company, and not the good kind.",
    "link": "https://www.jalopnik.com/elon-musks-noxious-politics-may-tank-tesla-1851763604/",
    "timestamp": "2025-03-26T19:02:04Z"
  },
  {
    "title": "SAP SE (SAP) & DataRobot Team Up for AI-Driven Business Insights & Automation",
    "description": "We recently published a list of Top 11 AI News Updates on Wall Street’s Radar. In this article, we are going to take a look at where SAP SE (NYSE:SAP) stands...",
    "link": "https://finance.yahoo.com/news/sap-se-sap-datarobot-team-190038859.html",
    "timestamp": "2025-03-26T19:00:38Z"
  },
  {
    "title": "Bitcoin Remains Strong Despite Slower Capital Inflows – Expert Unravels Liquidity Growth",
    "description": "Bitcoin has reclaimed the $85,500 level after a strong move to the upside, reigniting hopes for a push toward the psychological $90,000 mark. However, despite the recent bullish momentum, uncertainty continues to weigh heavily on global financial markets. Fea…",
    "link": "https://bitcoinist.com/bitcoin-remains-strong-despite-slower-capital-inflows-expert-unravels-liquidity-growth/",
    "timestamp": "2025-03-26T19:00:38Z"
  },
  {
    "title": "Pete Hegseth and the Art of Incompetence | Opinion",
    "description": "It's funny watching Washington types clutch their pearls over something that sounds exactly like the kind of incompetence we've come to expect from them.",
    "link": "https://www.newsweek.com/pete-hegseth-art-incompetence-opinion-2050362",
    "timestamp": "2025-03-26T19:00:01Z"
  },
  {
    "title": "CNN Analyst: Trump is More Popular Than Ever, ‘Right Track’ Data ‘Through the Roof’",
    "description": "\"The congressional generic ballot looks a heck of a lot more like when Republicans win than when Democrats win.\"\nThe post CNN Analyst: Trump is More Popular Than Ever, ‘Right Track’ Data ‘Through the Roof’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/03/cnn-analyst-trump-is-more-popular-than-ever-right-track-data-through-the-roof/",
    "timestamp": "2025-03-26T19:00:00Z"
  },
  {
    "title": "Reports Suggest China Could Participate in Ukraine Peacekeeping Mission",
    "description": "As European leaders attempt to organize a Ukraine peacekeeping mission amid a push by US President Donald Trump to clinch a cease-fire deal between Moscow and Kyiv, reports have spread that Beijing may want to play a role in maintaining the peace. The German …",
    "link": "https://oilprice.com/Geopolitics/International/Reports-Suggest-China-Could-Participate-in-Ukraine-Peacekeeping-Mission.html",
    "timestamp": "2025-03-26T19:00:00Z"
  },
  {
    "title": "Tesla slides 6% as looming auto tariffs tank tech stocks",
    "description": "Shares of mega-cap tech leaders tumbled Wednesday afternoon after a surprise announcement of auto tariffs from the White House.",
    "link": "https://www.businessinsider.com/tesla-stock-price-trump-auto-tariffs-trade-war-tech-stocks-2025-3",
    "timestamp": "2025-03-26T18:59:53Z"
  },
  {
    "title": "What Is Happening to Social Security Under the Trump Administration and Should You Be Concerned About Yours?",
    "description": "Here's what you need to know about where things stand.",
    "link": "https://time.com/7271888/social-security-under-trump-administration-elon-musk-concerns/",
    "timestamp": "2025-03-26T18:59:46Z"
  },
  {
    "title": "Box Inc. (BOX) Partners with DataBank to Transform AI-Powered Content Management",
    "description": "We recently published a list of Top 11 AI News Updates on Wall Street’s Radar. In this article, we are going to take a look at where Box Inc (NYSE:BOX...",
    "link": "https://finance.yahoo.com/news/box-inc-box-partners-databank-185937463.html",
    "timestamp": "2025-03-26T18:59:37Z"
  },
  {
    "title": "Elon Musk tapped to help lead investigation into Signal chat leak: White House",
    "description": "White House press secretary Karoline Leavitt said on Wednesday that Elon Musk will help lead the investigation into the Signal chat leak.",
    "link": "https://www.foxnews.com/politics/elon-musk-tapped-help-lead-investigation-signal-chat-leak-white-house",
    "timestamp": "2025-03-26T18:59:17Z"
  },
  {
    "title": "Prophet of Doom? Living Nostradamus issues eerie prediction on Donald Trump’s fate and a dark economic future for America; here's what he said",
    "description": "Renowned psychic Athos Salomé, known as the \"Living Nostradamus,\" predicts turmoil during Donald Trump's second term. Salomé foresees economic instability, heightened Big Tech influence, and geopolitical tensions, particularly with BRICS nations due to new ta…",
    "link": "https://economictimes.indiatimes.com/news/international/us/prophet-of-doom-living-nostradamus-issues-eerie-prediction-on-donald-trumps-fate-and-a-dark-economic-future-for-america-heres-what-he-said/articleshow/119554359.cms",
    "timestamp": "2025-03-26T18:57:30Z"
  },
  {
    "title": "Tesla shares drop on plunging European sales, concerns about Trump's tariffs",
    "description": "Tesla shares slid on Wednesday, continuing their downward trajectory for the year, after a rally over the past few days.",
    "link": "https://www.cnbc.com/2025/03/26/tesla-drops-on-slowing-european-sales-concerns-about-trump-tariffs.html",
    "timestamp": "2025-03-26T18:57:28Z"
  },
  {
    "title": "US government’s attack on free speech, science, and research is causing a brain drain",
    "description": "How do you create a brain drain and lose your status as eminent destination for scientists and researchers? The United States seems to be sending out questionnaires to researchers at universities and research institutes outside of the United States, asking th…",
    "link": "https://www.osnews.com/story/141972/us-governments-attack-on-free-speech-science-and-research-is-causing-a-brain-drain/",
    "timestamp": "2025-03-26T18:55:22Z"
  },
  {
    "title": "Reporters Grill Karoline Leavitt On How Leaked Attack Plans Weren’t Classified",
    "description": "Reporters challenged White House press secretary Karoline Leavitt on how the attack plans inadvertently leaked in a Signal chat were not classified.",
    "link": "https://dailycaller.com/2025/03/26/reporters-karoline-leavitt-leaked-attack-plans-classified/",
    "timestamp": "2025-03-26T18:54:53Z"
  },
  {
    "title": "Gov. Maura Healey slams President Trump over attempt to cancel public health grants",
    "description": "Gov. Maura Healey lashed out at President Donald Trump Wednesday over his administration’s attempt to cancel more than $11 billion in COVID-19-related grants across the country, of which Massachusetts was expected to receive $100 million over the next year.",
    "link": "https://www.bostonherald.com/2025/03/26/gov-maura-healey-slams-president-trump-over-attempt-to-cancel-public-health-grants/",
    "timestamp": "2025-03-26T18:52:47Z"
  },
  {
    "title": "War Plans Leak Reveals The Shocking Incompetence Of The Trump Administration",
    "description": "\"We are currently clean on [operational security],\" Defense Secretary Pete Hegseth wrote to other officials, along with the editor-in-chief of The Atlantic.",
    "link": "https://www.huffpost.com/entry/leak-of-war-plans-reveal-the-shocking-incompetence-of-the-trump-administration_n_67e420aee4b0993b821bf26f",
    "timestamp": "2025-03-26T18:51:46Z"
  },
  {
    "title": "Democrats' Chances of Flipping House Seat Trump Won by 30 Points: Poll",
    "description": "A new poll showed a Democrat within the margin of error, despite the district's solidly Republican lean.",
    "link": "https://www.newsweek.com/josh-weil-randy-fine-poll-florida-special-election-2050992",
    "timestamp": "2025-03-26T18:50:19Z"
  },
  {
    "title": "What's Going On With Tesla Shares Wednesday?",
    "description": "Tesla, Inc. (NASDAQ:TSLA) stock is trading lower amid overall market weakness, possibly due to uncertainty around tariffs.\nThe Details: On Monday, the Wall Street Journal reported that President Donald Trump and his administration may narrow upcoming tariffs …",
    "link": "https://biztoc.com/x/d2cb1d2c7c221b81",
    "timestamp": "2025-03-26T18:49:43Z"
  },
  {
    "title": "Bank of Canada says it would have likely held rate steady if not for tariff uncertainty",
    "description": "The Bank of Canada's top decision makers signalled they likely would have hit pause on the interest rate easing cycle earlier this month if not for the substantial uncertainty around tariffs from the United States.",
    "link": "https://www.cbc.ca/news/business/bank-of-canada-interest-rates-tariffs-1.7494013",
    "timestamp": "2025-03-26T18:49:43Z"
  },
  {
    "title": "The White House’s radical offensive against law firms isn’t just about law firms",
    "description": "When pressed, Donald Trump has said he wants law firms “to behave themselves.” It's worth appreciating what that means in practice.",
    "link": "https://biztoc.com/x/9b104082225ea70a",
    "timestamp": "2025-03-26T18:49:27Z"
  },
  {
    "title": "Kennedy Center Lays Off Social Impact Staffers Tasked With Reaching New And Diverse Audiences – Reports",
    "description": "The Kennedy Center in Washington D.C. has reportedly laid off as many as seven staffers of its Social Impact team, all but dismantling an initiative established in 2020 to “leverage the arts” to “advance justice and equity.” According to the Washington Post a…",
    "link": "http://deadline.com/2025/03/kennedy-center-social-impact-layoffs-1236351244/",
    "timestamp": "2025-03-26T18:48:29Z"
  },
  {
    "title": "19 founders and VCs working with Elon Musk's DOGE | TechCrunch",
    "description": "Silicon Valley used to take a backseat to Washington, D.C. But now, the people disrupting technology have taken the wheel at the highest echelons of",
    "link": "https://techcrunch.com/2025/03/26/19-founders-and-vcs-working-with-elon-musks-doge/",
    "timestamp": "2025-03-26T18:47:09Z"
  },
  {
    "title": "Tesla is suing to open dealerships in Wisconsin. It's become a big deal in the Supreme Court race",
    "description": "Tesla CEO Elon Musk is supporting the conservative candidate in the race to fill a seat on the Wisconsin Supreme Court, which could ultimately decide a Tesla lawsuit",
    "link": "https://abcnews.go.com/Business/wireStory/tesla-suing-open-dealerships-wisconsin-become-big-deal-120187331",
    "timestamp": "2025-03-26T18:46:17Z"
  },
  {
    "title": "Tesla is suing to open dealerships in Wisconsin. It’s become a big deal in the Supreme Court race",
    "description": "Tesla CEO Elon Musk is supporting the conservative candidate in the race.",
    "link": "https://www.bostonherald.com/2025/03/26/tesla-dealerships-wisconsin-supreme-court/",
    "timestamp": "2025-03-26T18:45:34Z"
  },
  {
    "title": "Trump Media Looking To Partner With Crypto.com for Potential ETF Launch",
    "description": "President Donald Trump’s media company has plans to launch a series of digital asset exchange-traded funds (ETFs) in partnership with the exchange Crypto.com. Trump Media and Technology Group plans to roll out the ETFs through the firm’s fintech brand, Truth.…",
    "link": "https://dailyhodl.com/2025/03/26/trump-media-looking-to-partner-with-crypto-com-for-potential-etf-launch/",
    "timestamp": "2025-03-26T18:45:23Z"
  },
  {
    "title": "Trump Cuts Threaten Universities, Could Lead to “Lost Generation” of Scientists",
    "description": "Some conservative lawmakers are quietly urging the president to restore research funding as cuts threaten academic institutions in their states",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/03/26/trumps-test-for-gop-lawmakers-defend-him-or-local-universities-00245965",
    "timestamp": "2025-03-26T18:45:00Z"
  },
  {
    "title": "White House says President Trump will announce auto tariffs today",
    "description": "WASHINGTON — White House Press Secretary Karoline Leavitt said U.S. President Donald Trump will announce tariffs on auto imports at 4 p.m. Wednesday in the Oval Office. Leavitt did not offer details about how the tariffs would affect the North American automo…",
    "link": "https://financialpost.com/pmn/white-house-says-president-trump-will-announce-auto-tariffs-today",
    "timestamp": "2025-03-26T18:42:53Z"
  },
  {
    "title": "Putin's 'crazy' ceasefire demands akin to British 'reoccupying' NSW",
    "description": "The Russian President reportedly wants Ukraine to cede territory his troops have never occupied as part of negotiations taking place to end the war, which continues to rage despite multiple summits.",
    "link": "https://www.abc.net.au/news/2025-03-27/vladimir-putin-ceasefire-demands-include-new-russia-blueprint/105091560",
    "timestamp": "2025-03-26T18:42:38Z"
  },
  {
    "title": "Signal war plans leak: Bombing people is OK, talking about it is not",
    "description": "Donald Trump’s team has revealed a lot more than just the Yemen attack during the chat with the accidentally invited Atlantic journalist Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614801-yemen-bombing-signal-leak/",
    "timestamp": "2025-03-26T18:42:25Z"
  },
  {
    "title": "Bank of Canada would have held interest rate at 3% in March, if not for tariff threats",
    "description": "Bank of Canada would have held interest rate at 3% in March in the absence of trade uncertainty with the United States. Read more",
    "link": "https://financialpost.com/news/economy/bank-of-canada-would-have-held-rate-march-but-for-tariff-threats",
    "timestamp": "2025-03-26T18:42:17Z"
  },
  {
    "title": "WATCH LIVE: Trump makes new auto tariff announcement at White House",
    "description": "White House press secretary Karoline Leavitt said Wednesday the tariffs would be detailed at an afternoon news conference.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-makes-new-auto-tariff-announcement-at-white-house",
    "timestamp": "2025-03-26T18:40:49Z"
  },
  {
    "title": "Federal Workers Appeal Trump DEI Layoffs as Biased, Illegal (Chris Marr/Bloomberg)",
    "description": "Chris Marr / Bloomberg:\nFederal Workers Appeal Trump DEI Layoffs as Biased, Illegal … Federal workers laid off in connection with President Donald Trump's anti-DEI executive orders said their terminations were discriminatory and violated their First Amendment…",
    "link": "https://www.memeorandum.com/250326/p87",
    "timestamp": "2025-03-26T18:40:00Z"
  },
  {
    "title": "White House says Elon Musk is helping them figure out how a reporter was added to a secret Signal group chat",
    "description": "The White House says Elon Musk's team will help probe how a reporter was added to a sensitive Signal chat about airstrike plans.",
    "link": "https://www.businessinsider.com/white-house-elon-musk-investigate-signal-group-chat-access-2025-3",
    "timestamp": "2025-03-26T18:39:04Z"
  },
  {
    "title": "DOGE is already breaking Social Security",
    "description": "DOGE-related cuts are causing issues at the Social Security Administration — by design.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/social-security-elon-musk-doge-cuts-issues-rcna198034",
    "timestamp": "2025-03-26T18:38:53Z"
  },
  {
    "title": "'The View' hosts call out Jasmine Crockett for mocking Greg Abbott's disability, say it was 'beneath her'",
    "description": "\"The View\" co-hosts denounced comments from Rep. Jasmine Crockett, D-Texas, aimed at Texas Governor Greg Abbott and urged her to publicly apologize.",
    "link": "https://www.foxnews.com/media/the-view-hosts-call-out-jasmine-crockett-mocking-greg-abbotts-disability-beneath-her",
    "timestamp": "2025-03-26T18:38:46Z"
  }
]