[
  {
    "title": "Bitcoin bucks downtrend with rally to $85.8K — Are BTC bulls really back?",
    "description": "Bitcoin (BTC) reclaimed the $84,500 level on April 14, and the recovery appears partially fueled by the announcement of partial import tariff relief by US President Donald Trump. However, traders’ optimism faded on April 13 when it became apparent that the re…",
    "link": "https://cointelegraph.com/news/bitcoin-bucks-downtrend-with-rally-to-85-8-k-are-btc-bulls-really-back",
    "timestamp": "2025-04-14T20:15:00Z"
  },
  {
    "title": "Voters widely oppose taxpayer-funded gender surgeries, revealing Democrat Party's vulnerability: poll",
    "description": "Taxpayer-funded transgender treatments remain widely unpopular among American voters, according to a new poll done by American Principles Project.",
    "link": "https://www.foxnews.com/politics/voters-widely-oppose-taxpayer-funded-gender-surgeries-revealing-democrat-partys-vulnerability-poll",
    "timestamp": "2025-04-14T20:13:45Z"
  },
  {
    "title": "Trump moots attack on Iran's nuclear facilities as talks continue",
    "description": "US President Donald Trump has reiterated his threat of drastic consequences for Iran over its nuclear programme, including a potential attack on Tehran's...",
    "link": "https://www.yahoo.com/news/trump-moots-attack-irans-nuclear-201326254.html",
    "timestamp": "2025-04-14T20:13:26Z"
  },
  {
    "title": "Ohio State Trophy Falls Apart in JD Vance's Hands During White House Visit",
    "description": "The moment came during the national champion Buckeyes' trip to the White House to meet President Donald Trump.",
    "link": "https://www.newsweek.com/ohio-state-trophy-falls-apart-jd-vances-hands-during-white-house-visit-2059684",
    "timestamp": "2025-04-14T20:13:00Z"
  },
  {
    "title": "California cities are trying to figure out how fake voices mocking Musk and Zuckerberg were added to crosswalks",
    "description": "An AI Elon Musk voice can be heard in a video recorded at one California crosswalk saying, \"Will you be my friend? I'll give you a Cybertruck.\"",
    "link": "https://www.businessinsider.com/elon-musk-mark-zuckerberg-ai-voices-crosswalks-california-hack-2025-4",
    "timestamp": "2025-04-14T20:12:49Z"
  },
  {
    "title": "What's Going On With Nio Stock Monday?",
    "description": "Nio Inc. (NYSE:NIO) shares traded higher on Monday after President Donald Trump and his administration announced that electronics are exempt from the 145% reciprocal tariffs on Chinese goods.\nThe Details: According to the New York Post, the announcement exemp…",
    "link": "https://biztoc.com/x/6478fb39f1b4dde2",
    "timestamp": "2025-04-14T20:12:29Z"
  },
  {
    "title": "Small firms sue Trump, reject 'imaginary emergency'",
    "description": "Five small businesses filed a lawsuit Monday against US President Donald Trump, accusing him of overstepping his authority by imposing new tariffs under what they call a \"figment of his own imaginatio...",
    "link": "https://biztoc.com/x/ddeae531299361e3",
    "timestamp": "2025-04-14T20:12:25Z"
  },
  {
    "title": "Trump Says Tariffs Being Met With 'Great Enthusiasm'",
    "description": "US President Donald trump says his economic polices have been met with \"great enthusiasm\" and the US is 'doing great' on trade during Oval Office meeting with El Salvador's president. Trump spoke after another week of reeling markets that saw the Republican a…",
    "link": "https://biztoc.com/x/f16045cb2177170e",
    "timestamp": "2025-04-14T20:12:19Z"
  },
  {
    "title": "Trump considers pausing his auto tariffs as the world economy endures whiplash",
    "description": "President Donald Trump on Monday suggested that he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.\n“I’m looking at something to help some of the car companies w…",
    "link": "https://biztoc.com/x/1163b7f68238f7ba",
    "timestamp": "2025-04-14T20:12:16Z"
  },
  {
    "title": "Scale of U.S. dollar declines and euro gains amid Trump tariffs catches investors off guard",
    "description": "Amid the madness of financial markets over the last two weeks, one particular move has caught many investors off guard — the sharp fall of the U.S. dollar and gains for the euro.\nThe U.S. dollar index has plunged to a three-year low since U.S. President Donal…",
    "link": "https://biztoc.com/x/df9203d6edb1080d",
    "timestamp": "2025-04-14T20:12:11Z"
  },
  {
    "title": "Dow climbs 300 points as stocks extend rally after Trump signals more tariff relief is possible",
    "description": "Stocks continued to rally Monday as investors cheered President Donald Trump’s Friday night tariff exemption. Additionally, Trump suggested he might give the auto industry some relief, and his officials are reportedly prioritizing negotiations with some count…",
    "link": "https://biztoc.com/x/c02c0a5de33a660a",
    "timestamp": "2025-04-14T20:12:03Z"
  },
  {
    "title": "Miyares, other AGs call for vape crackdown",
    "description": "Federal officials need to step up efforts to bar imported e-cigarettes that target youth with sweet flavors, a coalition of state attorneys general, including Virginia’s Jason Miyares, said in a letter to top Trump Administration officials.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_fc38100e-92fd-4f5f-ac11-9149bfaf97d5.html",
    "timestamp": "2025-04-14T20:12:00Z"
  },
  {
    "title": "Outgoing U.S. Envoy Accuses Russia of Dropping Cluster Bombs on Ukraine",
    "description": "Outgoing U.S. Ambassador to Ukraine Bridget Brink says Russia attacked the Ukrainian city of Sumy with cluster munitions, killing dozens.\nThe post Outgoing U.S. Envoy Accuses Russia of Dropping Cluster Bombs on Ukraine appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/04/14/outgoing-u-s-envoy-accuses-russia-dropping-cluster-bombs-ukraine/",
    "timestamp": "2025-04-14T20:10:44Z"
  },
  {
    "title": "And when I was a kid, we believed that putting a railroad spike on the tracks would derail the train [Facepalm]",
    "description": "And when I was a kid, we believed that putting a railroad spike on the tracks would derail the train",
    "link": "https://www.fark.com/comments/13634318/And-when-I-was-a-kid-we-believed-that-putting-a-railroad-spike-on-tracks-would-derail-train",
    "timestamp": "2025-04-14T20:09:15Z"
  },
  {
    "title": "Bernie Sanders’ Coachella Appearance Splits Social Media",
    "description": "Senator Bernie Sanders spoke to the crowd at Coachella on Saturday, after being introduced by fellow Congressman Maxwell Frost and singer-songwriter Clairo. His appearance got a mixed reaction on social media, mostly positive.",
    "link": "https://hiphopwired.com/playlist/bernie-sanders-coachella-appearance-splits-social-media/",
    "timestamp": "2025-04-14T20:09:13Z"
  },
  {
    "title": "Who Is Kilmar Abrego Garcia? About the Man Who Was Mistakenly Deported to El Salvador",
    "description": "Abrego Garcia was mistakenly deported amid Donald Trump's crackdown on immigration. Learn about him and get updates on the fight to get him back to the U.S.",
    "link": "https://hollywoodlife.com/feature/kilmar-abrego-garcia-deported-5380583/",
    "timestamp": "2025-04-14T20:06:56Z"
  },
  {
    "title": "Trump says he might exempt auto parts from 25 percent tariff",
    "description": "Just weeks ahead of May 3 deadline for auto parts tariff, Trump says U.S. auto makers need more time to sort out their supply chains.",
    "link": "https://www.thestar.com/business/trump-says-he-might-give-tariff-exemption-to-canadian-auto-parts/article_29f41b11-78c6-4628-8136-4ae48f3bf5f4.html",
    "timestamp": "2025-04-14T20:05:51Z"
  },
  {
    "title": "Can the President Appoint Principal Officers without the Senate? (Anne Joseph O'Connell/Default)",
    "description": "Anne Joseph O'Connell / Default:\nCan the President Appoint Principal Officers without the Senate?  —  Trump claims he can fire officers not picked by the president and hire acting leaders for Senate-confirmed roles outside the Vacancies Act.  —  Meet The Auth…",
    "link": "https://www.memeorandum.com/250414/p90",
    "timestamp": "2025-04-14T20:05:00Z"
  },
  {
    "title": "UFC begins partnership with Meta's Threads as Elon Musk sits ringside",
    "description": "UFC 314 saw an integration with Meta's Threads platform in place of where viewers would typically see fan posts from Elon Musk's X.The Kaseya Center in Miami, Florida, saw a plethora of political attendees, including President Donald Trump but also Robert F. …",
    "link": "https://www.theblaze.com/fearless/ufc-meta-integration-elon-musk",
    "timestamp": "2025-04-14T20:05:00Z"
  },
  {
    "title": "Biden not only let terrorists into U.S., he gave them Social Security cards!",
    "description": "Collected Medicaid, unemployment, student loans, even tax refunds",
    "link": "https://www.wnd.com/2025/04/biden-not-only-let-terrorists-into-u-s-he-gave-them-social-security-cards/",
    "timestamp": "2025-04-14T20:04:22Z"
  },
  {
    "title": "NASA's Indian-Origin Diversity Chief Sacked After Trump's Executive Order",
    "description": "NASA&#039;s Diversity, Equity, and Inclusion or DEI chief Neela Rajendra, who is of Indian origin, has been sacked by the US space agency in compliance with Donald Trump&#039;s executive order to &quot;terminate&quot; all persons employed under such initiativ…",
    "link": "https://www.ndtv.com/world-news/nasas-indian-origin-diversity-chief-neela-rajendra-sacked-after-donald-trumps-executive-order-8164963",
    "timestamp": "2025-04-14T20:03:51Z"
  },
  {
    "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
    "description": "A group of five small businesses on Monday sued President Donald Trump, seeking to block new tariffs that he has imposed on foreign imports in recent weeks.",
    "link": "https://www.nbcnews.com/business/business-news/us-businesses-sue-block-trump-tariffs-say-trade-deficits-are-not-emerg-rcna201213",
    "timestamp": "2025-04-14T20:03:42Z"
  },
  {
    "title": "Trump and El Salvador making no moves to return man wrongly deported and sent to notorious prison",
    "description": "Kilmar Abrego Garcia has not been returned to the US despite court orders to do so.",
    "link": "https://www.thejournal.ie/trump-and-el-salvador-making-no-moves-to-return-man-wrongly-deported-and-sent-to-notorious-prison-6678177-Apr2025/",
    "timestamp": "2025-04-14T20:02:32Z"
  },
  {
    "title": "Bitcoin Rises as Inflation Expectations Intensify Among Consumers",
    "description": "Investors will be watching Fed Chair Powell on Wednesday for clues about the central bank’s recession odds, one analyst says",
    "link": "https://decrypt.co/314744/bitcoin-rises-as-inflation-expectations-intensify-consumers",
    "timestamp": "2025-04-14T20:02:25Z"
  },
  {
    "title": "Janet Yellen: American Manufacturing Is a ‘Pipe Dream,’ May Not Be a ‘Desirable Goal’",
    "description": "Former President Joe Biden’s U.S. Treasury Secretary Janet Yellen blasted President Donald Trump’s tariffs on Monday, saying the return of American manufacturing is just a “pipe dream” that may not even be a “desirable goal.” Yellen, who chaired the Federal R…",
    "link": "https://freerepublic.com/focus/f-news/4310990/posts",
    "timestamp": "2025-04-14T20:01:23Z"
  },
  {
    "title": "Wall Street up at close as trade games continue",
    "description": "Major stock exchanges on Wall Street ended the Monday session with solid gains as United States President Donald Trump revealed some technological products will be omitted from the 145% tariff on Chin...",
    "link": "https://biztoc.com/x/b01efd4239eb4a21",
    "timestamp": "2025-04-14T20:01:01Z"
  },
  {
    "title": "Critical Rare Earth Exports From China Halted Amid Trade War",
    "description": "China has halted the exports of critical rare earth minerals and magnets as the trade war with the United States expands.  Rare earth minerals are key to the semiconductor and auto industries worldwide, and they have come to a screeching halt amid an escalati…",
    "link": "https://www.shtfplan.com/headline-news/critical-rare-earth-exports-from-china-halted-amid-trade-war",
    "timestamp": "2025-04-14T20:00:53Z"
  },
  {
    "title": "‘Satanic Cult’ Follower Allegedly Plotting Trump’s Murder Sought Help From Ukrainian, Russian Contacts, DOJ Says",
    "description": "The DOJ says two assassination plots against President Donald Trump are tied to eastern Europe through alleged accomplices based in Russia and Ukraine.",
    "link": "https://dailycaller.com/2025/04/14/nikita-casap-allegedly-plotting-trump-assassination-sought-help-ukrainian-russian-contacts/",
    "timestamp": "2025-04-14T20:00:07Z"
  },
  {
    "title": "Trump urges the FCC to punish '60 Minutes' over reports on Greenland and Ukraine (Brian Stelter/CNN)",
    "description": "Brian Stelter / CNN:\nTrump urges the FCC to punish ‘60 Minutes’ over reports on Greenland and Ukraine  —  President Donald Trump has a “hope” for his Federal Communications Commission: that the agency will punish CBS for airing “60 Minutes” reports he doesn't…",
    "link": "https://www.memeorandum.com/250414/p89",
    "timestamp": "2025-04-14T20:00:04Z"
  },
  {
    "title": "CLOSED DOOR SAVED FROM DOMESTIC TERROR",
    "description": "The suspect is described as a mechanic who had previously expressed disdain for Democrats on social media, sources told ABC News.",
    "link": "https://6abc.com/post/possible-motives-surface-cody-balmer-arrested-allegedly-setting-pennsylvania-governor-josh-shapiros-residence-fire/16169308/",
    "timestamp": "2025-04-14T20:00:03Z"
  },
  {
    "title": "Polling shows growing number of Republicans identify with the MAGA movement",
    "description": "As President Donald Trump nears the 100-day mark of his second term, recent polling from NBC News shows how he has consolidated the Republican Party not just around himself, but also around his broader “Make America Great Again” movement.",
    "link": "https://www.nbcnews.com/politics/trump-administration/polling-shows-growing-number-republicans-identify-maga-movement-rcna201071",
    "timestamp": "2025-04-14T20:00:00Z"
  },
  {
    "title": "Blue Origin launched an all-female crew with Katy Perry and Lauren Sánchez into space—what does that really prove?",
    "description": "Pop star Katy Perry, journalist Gayle King, and Lauren Sánchez, a former journalist who is Jeff Bezos’s fiancé, were among six women who traveled aboard Blue Origin’s all-female, celebrity-studded, suborbital space mission on Monday morning.\n\n\n\nThis marks the…",
    "link": "https://www.fastcompany.com/91316445/blue-origin-all-female-space-flight-katy-perry-lauren-sanchez-what-does-it-prove",
    "timestamp": "2025-04-14T20:00:00Z"
  },
  {
    "title": "Dana White reveals how he got invited to infamous dinner with President Donald Trump and Bill Maher",
    "description": "UFC CEO Dana White reveals how he ended up as the fourth person in the room when musician Kid Rock arranged a dinner for President Donald Trump to meet one of his fiercest critics, HBO host and comedian Bill Maher.",
    "link": "https://www.mmafighting.com/2025/4/14/24408335/dana-white-reveals-how-he-got-invited-to-infamous-dinner-with-president-donald-trump-and-bill-maher",
    "timestamp": "2025-04-14T20:00:00Z"
  },
  {
    "title": "How a trade war could impact the price of clothing: 'Ultimately no one wins,' expert says",
    "description": "Few consumer goods are immune from the effects of new tariffs on imported goods, but apparel may be among the hardest hit.",
    "link": "https://www.cnbc.com/2025/04/14/how-a-trade-war-could-impact-the-price-of-clothing.html",
    "timestamp": "2025-04-14T19:59:08Z"
  },
  {
    "title": "What to know about the Kilmar Armando Abrego Garcia case | CNN Politics",
    "description": "A Maryland man’s efforts to return to the US after being mistakenly deported to El Salvador last month hit a major new roadblock on Monday when the country’s president vowed to keep the father of three locked in a notorious mega-prison.",
    "link": "https://www.cnn.com/2025/04/14/politics/what-to-know-about-the-kilmar-armando-abrego-garcia-case/index.html",
    "timestamp": "2025-04-14T19:58:43Z"
  },
  {
    "title": "Trump wants to deport some US citizens to El Salvador",
    "description": "WASHINGTON: US President Donald Trump said on Monday (Apr 14) he wants to deport some violent criminals who are US citizens to El Salvador, where they would be incarcerated under an agreem",
    "link": "https://www.channelnewsasia.com/world/trump-wants-deport-some-us-citizens-el-salvador-5065506",
    "timestamp": "2025-04-14T19:57:43Z"
  },
  {
    "title": "SEC Postpones Decision on Staking Proposal for Grayscale Ethereum ETFs",
    "description": "The regulator will approve or reject the staking proposal, or begin proceedings on the matter, by June 1.",
    "link": "https://decrypt.co/314743/sec-postpones-decision-on-staking-for-grayscale-ethereum-etfs",
    "timestamp": "2025-04-14T19:57:19Z"
  },
  {
    "title": "Nobel-Winning Scientist Says His Researchers Are Fleeing the Country Because of Trump's Cruelty",
    "description": "Last year, University of Washington School of Medicine professor of biochemistry David Baker won the Nobel Prize for his work on designing proteins that can be used in drugs, vaccines, materials, and sensors. But now that the Trump administration has begun to…",
    "link": "https://futurism.com/neoscope/nobel-winning-scientist-researchers-fleeing-us-trump",
    "timestamp": "2025-04-14T19:55:57Z"
  },
  {
    "title": "'Profoundly chilling message': Pentagon eyes scrapping programs for sex assault victims",
    "description": "The Pentagon, under Secretary of Defense Pete Hegseth, is reportedly planning to scrap regulations meant to help victims of sexual assault in the military, according to reporting in The Intercept.The action is in response to President Donald Trump's executive…",
    "link": "https://www.rawstory.com/in-the-military/",
    "timestamp": "2025-04-14T19:55:15Z"
  },
  {
    "title": "Trump floats legally questionable proposal to deport U.S. citizens",
    "description": "If an immigrant who the government claims is a gang member can be deported to El Salvador without any due process rights, then why not a U.S. citizen?",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-floats-legally-questionable-proposal-deport-us-citizens-rcna201183",
    "timestamp": "2025-04-14T19:54:18Z"
  },
  {
    "title": "President 'Nuclear Dorito' mocked as fake tan reaches record new levels during meeting with El Salvador's President Nayib Bukele [Dumbass]",
    "description": "President 'Nuclear Dorito' mocked as fake tan reaches record new levels during meeting with El Salvador's President Nayib Bukele",
    "link": "https://www.fark.com/comments/13634440/President-Nuclear-Dorito-mocked-as-fake-tan-reaches-record-new-levels-during-meeting-with-El-Salvadors-President-Nayib-Bukele",
    "timestamp": "2025-04-14T19:53:15Z"
  },
  {
    "title": "Auto stocks are getting a boost as Trump weighs tariff exemptions",
    "description": "\"I'm looking at something to help car companies with it,\" President Donald Trump told reporters.",
    "link": "https://www.businessinsider.com/us-auto-stocks-rally-carmakers-trump-tariff-exemption-tesla-manufacturer-2025-4",
    "timestamp": "2025-04-14T19:52:53Z"
  },
  {
    "title": "Will the Supreme Court Stop Donald Trump?",
    "description": "By defying the Justices’ ruling on a man mistakenly sent to El Salvador, the Administration has shown that it is not owed the deference typically shown to the executive branch.",
    "link": "https://www.newyorker.com/news/the-lede/will-the-supreme-court-stop-donald-trump",
    "timestamp": "2025-04-14T19:52:14Z"
  },
  {
    "title": "Harvard University Announces It Won’t Surrender to Trump",
    "description": "An American university is finally standing up to Donald Trump’s egregious demands amidst a flurry of schools spinelessly bending to the president’s will in recent weeks.\r\nHarvard University announced Monday it will not comply with the White House’s demands th…",
    "link": "https://newrepublic.com/post/193977/harvard-university-wont-surrender-trump",
    "timestamp": "2025-04-14T19:51:35Z"
  },
  {
    "title": "Trump administration research cuts prompt scientists to seek jobs in Europe",
    "description": "David Die Dejean is passionate about studying tuna. Last year, he landed a dream job at National Oceanic and Atmospheric Administration in Miami to pursue his research. By January, he was settled in, had received a good review and loved working with his colle…",
    "link": "https://www.fastcompany.com/91315929/trump-administration-research-cuts-force-scientists-to-seek-jobs-in-europe",
    "timestamp": "2025-04-14T19:51:24Z"
  },
  {
    "title": "US Army to control land on Mexico border as part of base, migrants could be detained, officials say",
    "description": "A legal expert said the move is likely to be challenged in the courts.",
    "link": "https://www.bostonherald.com/2025/04/14/trump-military-border/",
    "timestamp": "2025-04-14T19:51:18Z"
  },
  {
    "title": "Semiconductor tariffs coming, may be this week, hints US president",
    "description": "US News: President Donald Trump has signalled that he will announce further tariffs this week on semiconductors.",
    "link": "https://timesofindia.indiatimes.com/world/us/semiconductor-tariffs-coming-may-be-this-week-hints-us-president/articleshow/120290040.cms",
    "timestamp": "2025-04-14T19:50:57Z"
  },
  {
    "title": "What we know now that Trump has paused tariffs on electronics",
    "description": "Commerce Secretary Howard Lutnick later said that this was only a temporary reprieve — telling ABC's \"This Week\" on Sunday that electronics will be included under future sector-specific tariffs on semiconductor products, set to arrive in \"probably a month or …",
    "link": "https://www.pbs.org/newshour/economy/what-we-know-now-that-trump-has-paused-tariffs-on-electronics",
    "timestamp": "2025-04-14T19:50:48Z"
  },
  {
    "title": "Trump admin looks to reshape LatAm ties along immigration, trade lines",
    "description": "The News\nUS President Donald Trump hosted El Salvadore President Nayib Bukele in Washington Monday, while US Treasury Secretary Scott Bessent met Argentina’s President Javier Milei in Buenos Aires.\nThe meetings underscored Trump’s priorities in Latin America,…",
    "link": "https://biztoc.com/x/11279cbe6e3527da",
    "timestamp": "2025-04-14T19:49:56Z"
  },
  {
    "title": "Confusion reigns after Trump exempts electronics from new tariff regime. Here’s what we know",
    "description": "By WYATTE GRANTHAM-PHILIPS, AP Business Writer\nConfusion over President Donald Trump’s tariffs remains following a weekend of questions around trade in consumer electronics.\nOn Friday the Trump administration paused its new taxes on electronics imported into …",
    "link": "https://biztoc.com/x/7b423a11affff684",
    "timestamp": "2025-04-14T19:49:56Z"
  },
  {
    "title": "Something Beautiful Can Come From The Trump Era — Even If It’s Painful Right Now",
    "description": "We triumphed before and we'll do it again.",
    "link": "https://www.huffpost.com/entry/fighting-transphobia-ballroom-culture-lgbtq_n_67fd491ce4b081fb1e972177",
    "timestamp": "2025-04-14T19:48:50Z"
  },
  {
    "title": "Small businesses sue Trump administration over authority to impose tariffs",
    "description": "A group of US businesses filed a lawsuit Monday arguing that President Donald Trump's tariffs are illegal under the International Emergency Economic Powers Act (IEEPA).",
    "link": "https://www.abc12.com/news/business/small-businesses-sue-trump-administration-over-authority-to-impose-tariffs/article_f257cc12-c88a-5e56-9491-03ea24cda8c5.html",
    "timestamp": "2025-04-14T19:48:00Z"
  },
  {
    "title": "Rep Ro Khanna tees up 2028 rivalry during pointed speech in JD Vance's home state",
    "description": "Considered a 2028 presidential contender, Rep. Ro Khanna delivered remarks in Vice President JD Vance's home state of Ohio, framing an early rivalry between the two rising political leaders.",
    "link": "https://www.foxnews.com/politics/rep-ro-khanna-tees-up-2028-rivalry-during-pointed-speech-jd-vances-home-state",
    "timestamp": "2025-04-14T19:45:54Z"
  },
  {
    "title": "El Cajon immigration raid shows stark change in enforcement priorities under President Trump",
    "description": "Previous administrations prioritized unauthorized immigrants with violent criminal records when making decisions on who is sent to detention. All 15 people arrested in the El Cajon raid in late March were sent to detention.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/04/14/el-cajon-immigration-raid-shows-stark-change-in-enforcement-priorities-under-president-trump",
    "timestamp": "2025-04-14T19:45:32Z"
  },
  {
    "title": "Harvard Refuses To Give In To Trump Administration Demands",
    "description": "The university said it would \"not surrender its independence\" or \"relinquish its constitutional rights\" despite billions being at risk.",
    "link": "https://www.huffpost.com/entry/harvard-university-trump-threats_n_67fd54e9e4b0d6c85e487073",
    "timestamp": "2025-04-14T19:43:21Z"
  },
  {
    "title": "A Budget Battle That Could Determine Speaker Johnson’s Future",
    "description": "Speaker of the House Mike Johnson is staking his political future on one daunting task—delivering a budget reconciliation bill that will satisfy both houses of... Read More\nThe post A Budget Battle That Could Determine Speaker Johnson’s Future appeared first …",
    "link": "https://www.dailysignal.com/2025/04/14/budget-battle-that-will-determine-mike-johnsons-future/",
    "timestamp": "2025-04-14T19:42:08Z"
  },
  {
    "title": "'Challenge accepted': MAGA officials tried to 'stiffen Trump’s spine' against Meta CEO",
    "description": "Although Silicon Valley billionaire Mark Zuckerberg — whose Meta owns the social media platforms Facebook and Instagram — was critical of President Donald Trump in the past, he reached out to him after the 2024 election and attended Trump's inauguration. Zuck…",
    "link": "https://www.rawstory.com/meta-trump-2671767716/",
    "timestamp": "2025-04-14T19:42:04Z"
  },
  {
    "title": "Trump Keeps Falsely Claiming Ukraine Started the War With Russia",
    "description": "On Sunday night, CBS’s 60 Minutes aired an interview featuring Ukrainian President Volodymyr Zelenskyy, who once again deplored the fact that US officials have been promoting Russian disinformation about the war between the two countries. By Monday morning, P…",
    "link": "https://www.motherjones.com/politics/2025/04/trump-ukraine-war-russia-disinformation/",
    "timestamp": "2025-04-14T19:41:01Z"
  },
  {
    "title": "Nvidia promises to produce up to $500 billion worth of AI servers in the US",
    "description": "Following Trump's threat to impose tariffs on semiconductors, Nvidia announces half a trillion investment plan in the US. Read more...",
    "link": "https://www.neowin.net/news/nvidia-promises-to-produce-up-to-500-billion-worth-of-ai-servers-in-the-us/",
    "timestamp": "2025-04-14T19:40:01Z"
  },
  {
    "title": "You Can’t Seriously Be Shocked That Big Law Caved to Trump",
    "description": "On Friday, five more Big Law firms capitulated to President Donald Trump’s demands, committing to provide a total of $600 million in “pro bono” legal services to causes aligned with the president’s “conservative ideals.” All told, the world’s largest firms no…",
    "link": "https://newrepublic.com/article/193971/big-law-firms-cave-trump-immoral-work",
    "timestamp": "2025-04-14T19:38:29Z"
  },
  {
    "title": "Harvard University goes against US President Donald Trump, rejects policy changes demand",
    "description": "A letter to Harvard authority from the Trump administration on Friday demanded that the university reduce the power of students and faculty members over the university's affairs.",
    "link": "https://economictimes.indiatimes.com/news/international/us/harvard-university-goes-against-us-president-donald-trump-rejects-policy-changes-demand/articleshow/120289996.cms",
    "timestamp": "2025-04-14T19:38:23Z"
  },
  {
    "title": "The SAVE Act Is Not Just About “Married Women”— It’s About Trans People, Too",
    "description": "A bill passed by the House last week could disenfranchise millions, including most trans people, if it becomes law.",
    "link": "https://truthout.org/articles/the-save-act-is-not-just-about-married-women-its-about-trans-people-too/",
    "timestamp": "2025-04-14T19:38:20Z"
  },
  {
    "title": "Trump says he's looking at certain tariff exemptions for automakers: 'They need a little bit of time'",
    "description": "President Donald Trump signaled Monday that more tariff relief could be on the way for auto manufacturers after he already provided the industry with a one-month pause related to tariffs on goods from Canada and Mexico imposed on March 4.",
    "link": "https://www.foxnews.com/politics/trump-says-hes-looking-certain-tariff-exemptions-automakers-they-need-little-bit-time",
    "timestamp": "2025-04-14T19:38:02Z"
  },
  {
    "title": "Library of Congress Defends National Recording Registry After Bill Maher’s ‘New Rules’ Jab",
    "description": "The Real Time commentator questioned why government needs to protect songs by Celine Dion and Elton John, to which the Library replied: \"Because it upholds our collective history\"",
    "link": "http://www.rollingstone.com/music/music-news/bill-maher-library-of-congress-registry-celine-dion-1235317063/",
    "timestamp": "2025-04-14T19:37:43Z"
  },
  {
    "title": "Trump’s Tariff Rationale Challenged in Suit by Small Companies",
    "description": "Several small US businesses sued President Donald Trump over his “Liberation Day” tariffs in the latest legal challenge to his use of sweeping executive powers to extract concessions from foreign trade partners.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-tariff-rationale-challenged-in-suit-by-small-companies",
    "timestamp": "2025-04-14T19:36:07Z"
  },
  {
    "title": "Confusion reigns after Trump exempts electronics from new tariff regime. Here’s what we know",
    "description": "Economists warn tariffs will raise costs and lead to higher prices for consumers.",
    "link": "https://www.bostonherald.com/2025/04/14/tech-tariffs-explained/",
    "timestamp": "2025-04-14T19:35:52Z"
  },
  {
    "title": "Oil Prices Flat Amid Trade and Iran Talks",
    "description": "Oil held steady as U.S. trade pauses clashed with rising inflation fears.",
    "link": "https://www.rigzone.com/news/wire/oil_prices_flat_amid_trade_and_iran_talks-14-apr-2025-180234-article/",
    "timestamp": "2025-04-14T19:35:15Z"
  },
  {
    "title": "Taylor Lorenz’s Fawning Over Alleged United Assassin Is Normalizing Political Violence",
    "description": "Lorenz's dismissive attitude is not just tasteless; it's part of a broader, calculated effort by the left to normalize political violence and numb the American public to its rising frequency.",
    "link": "https://thefederalist.com/2025/04/14/taylor-lorenzs-fawning-over-alleged-united-assassin-is-normalizing-political-violence/",
    "timestamp": "2025-04-14T19:34:30Z"
  },
  {
    "title": "Harvard Defies Trump Amid Battle Over Billions in Funding",
    "description": "The ivy league university said they \"will not surrender\" to the Trump administration's list of demands.",
    "link": "https://www.newsweek.com/harvard-defies-trump-battle-billions-funding-2059663",
    "timestamp": "2025-04-14T19:34:09Z"
  },
  {
    "title": "Trump Insults Reporter Asking Why He's Defying Supreme Court",
    "description": "The president snapped at Collins during a meeting with El Salvador's president, Nayib Bukele.",
    "link": "https://www.huffpost.com/entry/trump-insults-kaitlan-collins-supreme-court-deportation-question_n_67fc1792e4b0afe00ba8e79f",
    "timestamp": "2025-04-14T19:33:51Z"
  },
  {
    "title": "EXCLUSIVE: Mike Rogers Preaches GOP Unity As He Takes Second Shot At A Michigan Senate Seat",
    "description": "Former Republican Michigan Rep. Mike Rogers is taking another crack at a Senate bid after narrowly losing to Democratic Michigan Sen. Elissa Slotkin.",
    "link": "https://dailycaller.com/2025/04/14/exclusive-mike-rogers-preaches-gop-unity-takes-second-shot-michigan-senate-seat/",
    "timestamp": "2025-04-14T19:33:40Z"
  },
  {
    "title": "Trump administration sued over tariffs in US Court of International Trade",
    "description": "The lawsuit was filed by the Liberty Justice Center, a legal advocacy group, on behalf of five US businesses that import goods from countries targeted by the tariffs.",
    "link": "https://www.jpost.com/international/article-850127",
    "timestamp": "2025-04-14T19:30:55Z"
  },
  {
    "title": "Trans Norwegian politician wants to give asylum to transgender people fleeing Trump's policies",
    "description": "The Green Party candidate and district spokesperson vying to become first out trans member of Norway’s parliament said they would like to extend asylum to transgender folks in the U.S. fleeing the anti-transgender policies of the Trump administration. Karina …",
    "link": "https://www.advocate.com/politics/norwegian-us-trans-asylum",
    "timestamp": "2025-04-14T19:30:02Z"
  },
  {
    "title": "Plans to celebrate America's 250th anniversary were underway. Then came the funding cuts",
    "description": "Community celebrations being planned to commemorate the nation's 250th anniversary next year are at risk of being significantly scaled back or canceled because of federal funding cuts under Trump's administration.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_3d958009-c5d6-5353-a78a-ad034045ca9b.html",
    "timestamp": "2025-04-14T19:30:00Z"
  },
  {
    "title": "Trump Just Escalated His War on Coal Miners. Their Unions Are Fighting Back.",
    "description": "The Trump administration’s feckless business-first, workers-last approach is leaving the nation’s coal miners to die—and now their unions are taking him to court.",
    "link": "https://inthesetimes.com/article/trump-silica-rule-coal-miners-union",
    "timestamp": "2025-04-14T19:30:00Z"
  },
  {
    "title": "Trump Proves With This Petty Decision That Obama Lives Rent Free in His Head",
    "description": "President Donald Trump has made no secret about his hostility towards former President Barack Obama, using his platform to spread misinformation, including claims that Obama was not born in this country and calling him the founder of ISIS. But late last week,…",
    "link": "https://www.theroot.com/trump-proves-with-this-petty-decision-that-obama-lives-1851776092",
    "timestamp": "2025-04-14T19:30:00Z"
  },
  {
    "title": "Plans to celebrate America's 250th anniversary were underway. Then came the funding cuts",
    "description": "Community celebrations being planned to commemorate the nation's 250th anniversary next year are at risk of being significantly scaled back or canceled because of federal funding cuts under Trump's administration.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_a81fbaea-fefd-5991-a76e-79147423c14f.html",
    "timestamp": "2025-04-14T19:30:00Z"
  },
  {
    "title": "Top Lawyers, Jan. 6 Prosecutors Urge DC Court to Investigate Trump Appointee for ‘Violations of His Oath of Office’ in Scathing Letter",
    "description": "A group of attorneys -- including a former judge, former member of Congress, and several January 6 prosecutors -- have signed a letter urging the D.C. Court of Appeals to investigate Ed Martin, President Donald Trump’s nominee and the current interim acting U…",
    "link": "https://www.mediaite.com/news/top-lawyers-jan-6-prosecutors-urge-dc-court-to-investigate-trump-appointee-for-violations-of-his-oath-of-office-in-scathing-letter/",
    "timestamp": "2025-04-14T19:28:44Z"
  },
  {
    "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
    "description": "A group of businesses on Monday sued President Donald Trump, seeking to block new tariffs that he has imposed on foreign imports in recent weeks.\nThe lawsuit in the U.S. Court of International Trade alleges that Trump has illegally usurped Congress' power to …",
    "link": "https://biztoc.com/x/05741803be8f444f",
    "timestamp": "2025-04-14T19:27:53Z"
  },
  {
    "title": "The Real Reason El Salvador’s President Nayib Bukele Cozied Up to Trump",
    "description": "Donald Trump’s deepening partnership with El Salvador’s president, Nayib Bukele, was on display as the two leaders rejected the idea of returning a man mistakenly deported by the U.S. and locked up in a Salvadoran mega-prison. Meeting at the White House, they…",
    "link": "https://www.motherjones.com/politics/2025/04/the-real-reason-el-salvadors-president-nayib-bukele-cozied-up-to-trump/",
    "timestamp": "2025-04-14T19:27:50Z"
  },
  {
    "title": "The Real Reason El Salvador’s President Nayib Bukele Cozied Up to Trump",
    "description": "Donald Trump’s deepening partnership with El Salvador’s president, Nayib Bukele, was on display as the two leaders rejected the idea of returning a man mistakenly deported by the U.S. and locked up in a Salvadoran mega-prison. Meeting at the White House, they…",
    "link": "https://www.motherjones.com/politics/2025/04/el-salvador-nayib-bukele-trump-deportation/",
    "timestamp": "2025-04-14T19:27:50Z"
  },
  {
    "title": "Trump administration sued over tariffs in U.S. Court of International Trade",
    "description": "A legal advocacy group on Monday asked the U.S. Court of International Trade to block President Donald Trump’s sweeping tariffs on foreign trading partners, arguing that the president overstepped his authority.\nThe lawsuit was filed by the Liberty Justice Cen…",
    "link": "https://biztoc.com/x/cf2336df6f4c77ab",
    "timestamp": "2025-04-14T19:27:37Z"
  },
  {
    "title": "People are utilizing ChatGPT to turn their dogs into humans",
    "description": "They're putting the \"man\" in man's best friend.",
    "link": "https://nypost.com/2025/04/14/lifestyle/people-are-utilizing-chatgpt-to-turn-their-dogs-into-humans/",
    "timestamp": "2025-04-14T19:27:09Z"
  },
  {
    "title": "Harvard University rejects Trump DEI demands, imperiling $9 billion in federal funding - NewsBreak",
    "description": "Harvard University rejected a proposed deal with President Donald Trump, putting $9 billion in federal funding at risk. The Trump administration proposed c",
    "link": "https://www.newsbreak.com/share/3962468395735-harvard-university-rejects-trump-dei-demands-imperiling-9-billion-in-federal-funding?s=a2&share_destination_id=NDgzNjg1MDUtMTc0NDY1ODY2NTc0Ng%3D%3D&pd=03GwrBx9&hl=en_US&send_time=1744658665&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.15.2%22%2C%22languages%22%3A%22en%22%7D&sep=ns_push_exp_rt_bucketv12-control%2Cns_foryou_recall_exp_25q2-control%2Cns_local_strategy_25q1_exp-v12%2Cns_foryou_blend_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v8",
    "timestamp": "2025-04-14T19:27:04Z"
  },
  {
    "title": "New York Times Lies About Why Kash Patel Suspended Analyst Key To FBI Corruption",
    "description": "FBI reporter Adam Goldman is a paid shill for the world's worst people. He's not just a hack; he has no morals at all.",
    "link": "https://thefederalist.com/2025/04/14/new-york-times-lies-about-why-kash-patel-suspended-analyst-key-to-fbi-corruption/",
    "timestamp": "2025-04-14T19:26:45Z"
  },
  {
    "title": "Trump administration wants to halve State Dept budget, slash foreign aid 75%",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump's administration wants to halve the State Department budget, cutting more than $30 billion, in fiscal 2026, four U.S. officials familiar with the plan said on Monday - a massive reduction that could see nearl…",
    "link": "https://www.thestar.com.my/news/world/2025/04/15/trump-administration-wants-to-halve-state-dept-budget-slash-foreign-aid-75",
    "timestamp": "2025-04-14T19:26:00Z"
  },
  {
    "title": "Watch Live: Donald Trump Welcomes Ohio State College Football Champions to White House",
    "description": "President Donald Trump hosts a ceremony to honor the members of the college football champion Ohio State Buckeyes team at the White House on Monday, April 14.\nThe post Watch Live: Donald Trump Welcomes Ohio State College Football Champions to White House appe…",
    "link": "https://www.breitbart.com/sports/2025/04/14/watch-live-donald-trump-welcomes-ohio-state-college-football-champions-to-white-house/",
    "timestamp": "2025-04-14T19:25:37Z"
  },
  {
    "title": "DOGE cuts hobble office that would aid NASA and SpaceX Mars landings",
    "description": "NASA's crucial Astrogeology Science Center, vital for safe lunar and Martian landings, faces potential staff cuts of at least 20% due to cost-cutting measures initiated by the Department of Government Efficiency. This reduction, impacting experienced mapmaker…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/doge-cuts-hobble-office-that-would-aid-nasa-and-spacex-mars-landings/articleshow/120289835.cms",
    "timestamp": "2025-04-14T19:24:18Z"
  },
  {
    "title": "Trump administration wants to halve State Dept budget, slash foreign aid 75%",
    "description": "The Trump administration is proposing a significant reduction to the State Department's budget, potentially slashing it by half in fiscal year 2026. This drastic cut, exceeding $30 billion, could lead to the closure of nearly 30 U.S. missions, primarily in Af…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-wants-to-halve-state-dept-budget-slash-foreign-aid-75/articleshow/120289832.cms",
    "timestamp": "2025-04-14T19:24:09Z"
  },
  {
    "title": "Trump Flagrantly Targets Political Opponents in Executive Orders",
    "description": "In August 1971, during President Richard Nixon's first term in office, White House Counsel John Dean drafted a memo titled \"Dealing with our Political",
    "link": "https://reason.com/2025/04/14/trump-flagrantly-targets-political-opponents-in-executive-orders/",
    "timestamp": "2025-04-14T19:23:53Z"
  },
  {
    "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
    "description": null,
    "link": "https://www.cnbc.com/2025/04/14/us-businesses-sue-to-block-trump-tariffs-say-trade-deficits-are-not-an-emergency.html",
    "timestamp": "2025-04-14T19:22:47Z"
  },
  {
    "title": "ROOKE: China’s Using Unconventional Warfare To Fight Trump’s Tariffs",
    "description": "President Trump hopes to equalize the U.S.'s incredible trade imbalance with China by imposing hefty tariffs. Still, China isn't taking the hit lying down.",
    "link": "https://dailycaller.com/2025/04/14/rooke-china-trump-tariff-tiktok/",
    "timestamp": "2025-04-14T19:22:12Z"
  },
  {
    "title": "El Salvador president refuses to release man wrongly deported by Trump administration and held in notorious gang prison",
    "description": "Donald Trump’s top advisers and the president of El Salvador have said they have no basis for the Central American nation to return a Maryland man who was wrongly deported there last month.",
    "link": "https://www.independent.ie/world-news/el-salvador-president-refuses-to-release-man-wrongly-deported-by-trump-administration-and-held-in-notorious-gang-prison/a2085627842.html",
    "timestamp": "2025-04-14T19:22:09Z"
  },
  {
    "title": "El Salvador president refuses to release wrongly deported man back to the US",
    "description": "Donald Trump’s top advisers and the president of El Salvador have said they have no basis for the Central American nation to return a Maryland man who was wrongly deported there last month.",
    "link": "https://www.independent.ie/world-news/el-salvador-president-refuses-to-release-wrongly-deported-man-back-to-the-us/a2085627842.html",
    "timestamp": "2025-04-14T19:22:08Z"
  },
  {
    "title": "Report: Government Bureaucrats Tried to Stop Trump from Canceling Illegal Aliens' Social Security Benefits",
    "description": "Government bureaucrats tried to stop President Donald Trump's administration from canceling Social Security benefits for illegal aliens, including those who were released into the United States by former President Joe Biden, a report details.\nThe post Report:…",
    "link": "https://www.breitbart.com/politics/2025/04/14/report-government-bureaucrats-tried-to-stop-trump-from-canceling-illegal-aliens-social-security-benefits/",
    "timestamp": "2025-04-14T19:21:01Z"
  }
]