[
  {
    "title": "Comics Giveaway Day in The Daily LITG, 18th of December 2025",
    "description": "Comics Giveaway Day was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in a history of comi…",
    "link": "https://bleedingcool.com/comics/comics-giveaway-day-in-the-daily-litg-18th-of-december-2025/",
    "timestamp": "2025-12-18T11:40:04Z"
  },
  {
    "title": "The Bravofication of American government",
    "description": "President Donald Trump is reflected in the glasses of White House Chief of Staff Susie Wiles, as he talks to the press on the South Lawn of the White House in Washington, DC, on October 5, 2025. | Andrew Caballero-Reynolds/AFP via Getty Images \nKey takeaways\n…",
    "link": "https://biztoc.com/x/ddbdbc937861d83d",
    "timestamp": "2025-12-18T11:38:43Z"
  },
  {
    "title": "Trump Media, fusion power firm TAE Technologies combine in $6 billion deal",
    "description": "U.S. President Donald Trump's social media firm is entering the fusion-power business through a $6 billion merger with privately held TAE Technologies...",
    "link": "https://finance.yahoo.com/news/trump-media-tae-technologies-combine-113634290.html",
    "timestamp": "2025-12-18T11:36:34Z"
  },
  {
    "title": "China Backs Venezuela's Request for Urgent UN Security Council Meeting Over US Actions",
    "description": "MOSCOW (Sputnik) - China opposes any unilateral acts of intimidation and supports Venezuela's request to convene an urgent meeting of the United Nations Security Council in response to US actions, Chinese Foreign Ministry Spokesperson Guo Jiakun stated at a p…",
    "link": "https://sputnikglobe.com/20251218/china-backs-venezuelas-request-for-urgent-un-security-council-meeting-over-us-actions-1123320006.html",
    "timestamp": "2025-12-18T11:34:34Z"
  },
  {
    "title": "What’s true — and what isn’t — about Jeffrey Epstein, 6 years later",
    "description": "Six years after his death, convicted sex offender Jeffrey Epstein still makes headlines. He stars in conspiracy theories and falsehoods — about what government files reveal about him, the island where he […]\nThe post What’s true — and what isn’t — about Jeffr…",
    "link": "https://www.poynter.org/fact-checking/2025/facts-about-jeffrey-epstein/",
    "timestamp": "2025-12-18T11:30:53Z"
  },
  {
    "title": "CatholicVote launches campaign urging Trump to reject marijuana rescheduling plans",
    "description": "CatholicVote launches campaign urging Trump to reject marijuana rescheduling from Schedule I to III, citing public health risks and addiction concerns.",
    "link": "https://www.foxnews.com/media/catholicvote-launches-new-campaign-urging-trump-reject-marijuana-rescheduling-plans",
    "timestamp": "2025-12-18T11:30:16Z"
  },
  {
    "title": "Donald Trump’s biggest attack dog is Joe Biden’s legacy",
    "description": "FCC Chair Brendan Carr should stand as a tough lesson for Democrats",
    "link": "https://www.salon.com/2025/12/18/donald-trumps-biggest-attack-dog-is-joe-bidens-legacy/",
    "timestamp": "2025-12-18T11:30:15Z"
  },
  {
    "title": "Democrats should try to win in Florida (Matthew Yglesias/Slow Boring)",
    "description": "Matthew Yglesias / Slow Boring:\nDemocrats should try to win in Florida  —  In 2024, Donald Trump beat Kamala Harris 56.03 to 42.37 in Texas.  Democrats in the state are currently engaged in a contested Senate primary between James Talarico and Jasmine Crocket…",
    "link": "https://www.memeorandum.com/251218/p7",
    "timestamp": "2025-12-18T11:30:01Z"
  },
  {
    "title": "Trump Media & Technology Group to Merge with TAE Technologies, a Premier Fusion Power Company, in All-Stock Transaction Valued at More Than $6 Billion",
    "description": "Combined company expects to site and commence construction of the first utility-scale fusion power plant in 2026   Fusion power to blaze path toward...",
    "link": "https://www.globenewswire.com/news-release/2025/12/18/3207544/0/en/Trump-Media-Technology-Group-to-Merge-with-TAE-Technologies-a-Premier-Fusion-Power-Company-in-All-Stock-Transaction-Valued-at-More-Than-6-Billion.html",
    "timestamp": "2025-12-18T11:30:00Z"
  },
  {
    "title": "Victor Davis Hanson: ‘You Don’t Criticize People in Oedipean Fashion That Are Killed by Their Sons’",
    "description": "In this episode of “Victor Davis Hanson: In His Own Words,” Victor Davis Hanson and Jack Fowler discuss the tragic murder of director-activist Rob Reiner... Read More\nThe post Victor Davis Hanson: ‘You Don’t Criticize People in Oedipean Fashion That Are Kille…",
    "link": "https://www.dailysignal.com/2025/12/18/victor-davis-hanson-you-dont-criticize-people-in-oedipean-fashion-that-are-killed-by-their-sons/",
    "timestamp": "2025-12-18T11:30:00Z"
  },
  {
    "title": "Kamala Harris Slams White House Plaques: ‘Americans Deserve Better’",
    "description": "The former vice president responded to partisan plaques that President Donald Trump added to his Presidential Walk of Fame.",
    "link": "https://biztoc.com/x/11b768f5c7b33744",
    "timestamp": "2025-12-18T11:27:25Z"
  },
  {
    "title": "In 2025, Trump told FIFA, Olympics and NCAA to get in line. For the most part, they complied",
    "description": "Whether he was accepting awards from FIFA, attending the Ryder Cup as a specially invited guest or hosting Olympic leaders at the White House, President Donald Trump figured out how to get himself in the headlines for sports stories, while also shaping...",
    "link": "https://abcnews.go.com/Politics/wireStory/2025-trump-told-fifa-olympics-ncaa-line-part-128513110",
    "timestamp": "2025-12-18T11:25:34Z"
  },
  {
    "title": "Does the US have any real claim on Venezuelan oil as Stephen Miller says?",
    "description": "US companies developed Venezuelan oil fields until the country nationalised its oil reserves in the 1970s.",
    "link": "https://www.aljazeera.com/news/2025/12/18/does-the-us-have-any-real-claim-on-venezuelan-oil-as-stephen-miller-says",
    "timestamp": "2025-12-18T11:23:06Z"
  },
  {
    "title": "Bessent’s 2025 Saw Powell and Argentina Rescues, Deficit Angst",
    "description": "From leading US trade negotiations with China and charting a course for the world’s biggest bond market to calming investors spooked by President Donald Trump’s most aggressive economic announcements, it’s been a busy 2025 for Scott Bessent.",
    "link": "https://financialpost.com/pmn/business-pmn/bessents-2025-saw-powell-and-argentina-rescues-deficit-angst",
    "timestamp": "2025-12-18T11:19:29Z"
  },
  {
    "title": "Marjorie Taylor Greene’s trans youth care ban passes US House after three Democrats break ranks",
    "description": "A bill that would criminalise gender-affirming care for trans young people just barely passed its first vote, and three Democrats helped it to pass. House bill HR 3492, dubbed the ‘Protect Children’s Innocence Act’, passed through the US House with a slim maj…",
    "link": "https://www.thepinknews.com/2025/12/18/trans-youth-care-ban-marjorie-taylor-greene-bill-mtg/",
    "timestamp": "2025-12-18T11:17:37Z"
  },
  {
    "title": "Comedian applauded for his hot take on ‘straight, progressive people’",
    "description": "People have applauded a queer comedian for his hot take on how “straight people have terrible taste in gay people”. Comedian and writer George Civeris recently appeared on Subway Takes hosted by Kareem Rahma. The series sees Rahma chat to people, usually on t…",
    "link": "https://www.thepinknews.com/2025/12/18/comedian-applauded-for-his-hot-take-on-straight-progressive-people/",
    "timestamp": "2025-12-18T11:08:47Z"
  },
  {
    "title": "Now They're Coming for Your Citizenship",
    "description": "U.S. Citizenship and Immigration Services has reportedly been given quotas to meet in denaturalizing citizens in 2026.",
    "link": "https://www.jezebel.com/citizenship-stripped-denaturalization-push-2026-us-immigration-services-justice-department",
    "timestamp": "2025-12-18T11:06:10Z"
  },
  {
    "title": "Americans facing soaring health insurance costs may get a lifeline in 2026, experts say",
    "description": "NEW YORK/WASHINGTON, Dec 18 (Reuters) - Americans facing skyrocketing Obamacare health insurance premiums could still get a break from expanded government...",
    "link": "https://www.yahoo.com/news/articles/americans-facing-soaring-health-insurance-110551671.html",
    "timestamp": "2025-12-18T11:05:51Z"
  },
  {
    "title": "Conventional Wisdom: The Susie Wiles Tell-All Edition",
    "description": "White House Chief of Staff Susie Wiles sat for 11 on-the-record interviews over nearly a year with Vanity Fair's Chris Whipple. She described President Donald Trump as having an \"alcoholic's personality,\" Vice President JD Vance as being \"a conspiracy theoris…",
    "link": "https://biztoc.com/x/af3fefedbdca3e19",
    "timestamp": "2025-12-18T11:05:40Z"
  },
  {
    "title": "Uncommon Knowledge: The Quiet Promise That Could Define Trump’s 2026",
    "description": "In his end-of-year address, President Donald Trump slipped in a line that drew less attention than the headline-grabbing talk of tariffs and $1,776 \"warrior dividends\": build enough electrical supply to power America’s AI boom. It sounded almost dull beside t…",
    "link": "https://biztoc.com/x/0e7c36527a7ae0b2",
    "timestamp": "2025-12-18T11:05:40Z"
  },
  {
    "title": "Trump’s open bid for oil from Venezuela reeks of neocolonialism",
    "description": "President Donald Trump escalated his effort to force regime change in Venezuela on Tuesday by announcing a blockade of all “sanctioned oil tankers” coming in and out of the country. \nOn Truth Social, Trump boasted about the military assets he’s moved into the…",
    "link": "https://biztoc.com/x/26e8c7213c898188",
    "timestamp": "2025-12-18T11:05:32Z"
  },
  {
    "title": "Turning Point USA’s annual convention begins in the shadow of Charlie Kirk’s killing",
    "description": "In any other year, under different circumstances, AmericaFest would be one big celebration for the Grand Old Party.\nLast year, Turning Point USA’s annual convention served as a victory lap for Donald Trump, who’d won reelection in no small part thanks to the …",
    "link": "https://biztoc.com/x/2dd61db3c62e2b51",
    "timestamp": "2025-12-18T11:05:28Z"
  },
  {
    "title": "Fed chair contender Christopher Waller says weak jobs data is strengthening the case for more rate cuts: ‘AI is stalling hiring’",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/12/18/fed-chair-governor-christopher-waller-rate-cut-jobs-data-ai/",
    "timestamp": "2025-12-18T11:05:21Z"
  },
  {
    "title": "The looming showdown over IVF, explained",
    "description": "President Donald Trump outlined plans to expand IVF access during an October event at the White House. \nPresident Donald Trump says he wants Americans to have more babies, and his administration is willing to try almost anything, from cash bonuses to transpor…",
    "link": "https://biztoc.com/x/4897c107c688ae7f",
    "timestamp": "2025-12-18T11:05:17Z"
  },
  {
    "title": "Pope Leo appoints pro-migrant archbishop of New York, signaling Church’s more robust approach to Trump | CNN",
    "description": "Pope Leo has appointed a new archbishop of New York who has first-hand experience of countries from where millions have emigrated to the United States, signaling the potential for a more outspoken approach from bishops on immigration.",
    "link": "https://www.cnn.com/2025/12/18/us/ronald-hicks-pope-archbishop-new-york-intl",
    "timestamp": "2025-12-18T11:04:59Z"
  },
  {
    "title": "US crypto industry cheers 2025 wins, but party may fizzle next year",
    "description": "Dec 18 : After celebrating Donald Trump's second presidential term by swilling cocktails and partying to Snoop Dogg at a pre-inauguration event in January, the crypto industry went on to notch major legislative and regulatory victories this year.But the party…",
    "link": "https://www.channelnewsasia.com/business/us-crypto-industry-cheers-2025-wins-party-may-fizzle-next-year-5638031",
    "timestamp": "2025-12-18T11:03:39Z"
  },
  {
    "title": "Dan Bongino replies to Kash Patel's praise following departure announcement: 'honor of a lifetime'",
    "description": "Deputy FBI Director thanked FBI Director Kash Patel after Patel praised Bongino in a post on Wednesday after Bongino's announcement that he plans to depart the FBI.",
    "link": "https://www.foxnews.com/politics/dan-bongino-replies-kash-patels-praise-following-departure-announcement-honor-lifetime",
    "timestamp": "2025-12-18T11:03:30Z"
  },
  {
    "title": "They quit government to protest Trump. Now they are running for Congress to stop him",
    "description": "By Joseph Ax CAPE MAY, New Jersey, Dec 18 (Reuters) - It was Megan O'Rourke's dream job. As a top climate scientist for the U.S.",
    "link": "https://www.yahoo.com/news/articles/quit-government-protest-trump-now-110302982.html",
    "timestamp": "2025-12-18T11:03:02Z"
  },
  {
    "title": "$1,776 warrior dividend isn’t the whole story — here’s what else troops are getting from Trump",
    "description": "Trump’s $1,776 warrior dividend brings Christmas checks to nearly 1.5 million U.S. service members nationwide. But the bonus is only part of Trump’s broader military support agenda. The 2026 defense bill includes a 4% pay raise. It also funds new barracks, fa…",
    "link": "https://economictimes.indiatimes.com/news/international/us/1776-warrior-dividend-isnt-the-whole-story-heres-what-else-troops-are-getting-from-trump-all-you-need-to-know-about-trumps-1776-warrior-dividend-checks/articleshow/126056628.cms",
    "timestamp": "2025-12-18T11:02:58Z"
  },
  {
    "title": "Jeff Flake on Free Trade, Immigration, and Trump's GOP",
    "description": "\"If we're gonna put up immigration barriers, we better do a lot more in terms of trade barriers to make it more free trade, or we will decline,\" the former Arizona senator tells Reason's Nick Gillespie.",
    "link": "https://reason.com/2025/12/18/qa-jeff-flake-on-the-gop/",
    "timestamp": "2025-12-18T11:00:44Z"
  },
  {
    "title": "Welcome to the K-shaped economy: Canadians look back on a 'brutal' or 'great' year in Donald Trump's trade war",
    "description": "No two trade stories are unlike finds the Financial Post's Joe O'Connor when he reconnects with Canadian business people on the frontlines. Some are getting crushed and some are getting ahead",
    "link": "https://financialpost.com/feature/welcome-to-the-k-shaped-economy-canadians-look-back-on-a-brutal-or-great-year-in-donald-trumps-trade-war",
    "timestamp": "2025-12-18T11:00:15Z"
  },
  {
    "title": "Welcome to the K-shaped economy: Canadians look back on a 'brutal' or 'great' year in Donald Trump's trade war",
    "description": "No two trade stories are unlike finds the Financial Post's Joe O'Connor when he reconnects with Canadian business people on the frontlines. Some are getting crushed and some are getting ahead",
    "link": "https://financialpost.com/feature/canada-economy-k-shaped-trump-trade-war-picks-casualties",
    "timestamp": "2025-12-18T11:00:15Z"
  },
  {
    "title": "Karoline Leavitt’s White House doublethink is straight out of Orwell",
    "description": "The press secretary's playbook is lifted from \"1984.\"",
    "link": "https://www.salon.com/2025/12/18/karoline-leavitts-white-house-doublethink-is-straight-out-of-orwell/",
    "timestamp": "2025-12-18T11:00:07Z"
  },
  {
    "title": "Norman Podhoretz Was the Ultimate Neocon",
    "description": "My late father knew Norman Podhoretz (Alav Hashalom) when they were both counselors at a Jewish summer camp in upstate New York. This would have been in 1946, maybe 1947. Assigned to write lyrics for an official camp song, they got in trouble for making satir…",
    "link": "https://newrepublic.com/article/204583/norman-podhoretz-ultimate-neocon-obituary",
    "timestamp": "2025-12-18T11:00:00Z"
  },
  {
    "title": "The Americans Who Saw All This Coming—but Were Ignored and Maligned",
    "description": "Imagine I sent you\nback in time to July 2015 with the goal of saving liberal democracy in America.\nDonald Trump announced his candidacy a month ago, the polls are showing him\nwith a narrow lead, and the media—while noting his\nextreme rhetoric—are mostly treat…",
    "link": "https://newrepublic.com/article/204254/survey-2024-election-cassandras-trump-2025",
    "timestamp": "2025-12-18T11:00:00Z"
  },
  {
    "title": "Posts claim Polaroids of Trump and Epstein with young females are real. They're wrong",
    "description": "An image authentically shows four Polaroid photos of U.S. President Donald Trump and the late sex offender Jeffrey Epstein with young females.",
    "link": "https://www.snopes.com//fact-check/trump-epstein-polaroids-women/",
    "timestamp": "2025-12-18T11:00:00Z"
  },
  {
    "title": "Treasuries Advance Before Release of US Inflation Report",
    "description": "US Treasuries edged higher on Thursday ahead of a US inflation report which policymakers and investors will be parsing for clues on the outlook for monetary policy next year.",
    "link": "https://financialpost.com/pmn/business-pmn/treasuries-advance-before-release-of-us-inflation-report",
    "timestamp": "2025-12-18T10:59:00Z"
  },
  {
    "title": "Politics: Trump’s Affordability Weave",
    "description": "The president can’t seem to stay focused on the issue that voters care about most.",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/trump-s-affordability-weave-e608143/",
    "timestamp": "2025-12-18T10:56:00Z"
  },
  {
    "title": "She’s Married to the Architect of Trump’s Darkest Policies. She Wants America to Love Her. It’s Not Going Well.",
    "description": "I spent a month in her head. I was surprised by what I found.",
    "link": "https://slate.com/news-and-politics/2025/12/donald-trump-stephen-miller-wife-katie-news.html",
    "timestamp": "2025-12-18T10:40:00Z"
  },
  {
    "title": "Azerbaijan Ships First Fuel Cargo to Armenia in Decades",
    "description": "Azerbaijan has dispatched its first fuel cargo to Armenia since the collapse of the Soviet Union, testing the reopening of trade links between the two South Caucasus rivals after decades of conflict.",
    "link": "https://financialpost.com/pmn/business-pmn/azerbaijan-ships-first-fuel-cargo-to-armenia-in-decades",
    "timestamp": "2025-12-18T10:38:24Z"
  },
  {
    "title": "EXCLUSIVE: CBP Busts Meth Breakfast Cereal Smuggling Attempt",
    "description": "Customs and Border Protection has thwarted a large drug smuggling attempt in Texas. CBP officers in the Lone Star State discovered a tractor trailer filled with cereal ingredients. More than $10.3 million in alleged methamphetamine was found hidden inside the…",
    "link": "https://freerepublic.com/focus/f-bloggers/4357933/posts",
    "timestamp": "2025-12-18T10:38:14Z"
  },
  {
    "title": "World shares are mixed after AI worries drag Wall Street tech stocks lower",
    "description": "World shares are mixed after declines for AI stocks dragged the U.S. market to its worst day in nearly a month",
    "link": "https://abcnews.go.com/US/wireStory/world-shares-mixed-after-ai-worries-drag-wall-128511008",
    "timestamp": "2025-12-18T10:37:31Z"
  },
  {
    "title": "AOC Answers JD Vance 2028 Matchup Question With 4 Stomping Words",
    "description": "The congresswoman reacted to a new poll with a blunt prediction about a hypothetical race against the vice president.",
    "link": "https://www.huffpost.com/entry/aoc-jd-vance-polling-response_n_6943ce60e4b045d9788d1413",
    "timestamp": "2025-12-18T10:36:40Z"
  },
  {
    "title": "Melania Trump Gives Fans A Sneak-Peek At Highly Anticipated Documentary Trailer",
    "description": "Melania Trump stepped into the spotlight with confidence, unveiling the first trailer for her highly anticipated new documentary, \"Melania.\"",
    "link": "https://dailycaller.com/2025/12/18/melania-trump-unveils-documentary-trailer-donald-baron-inside-look-white-house-fashion/",
    "timestamp": "2025-12-18T10:35:26Z"
  },
  {
    "title": "Rory McIlroy’s squad narrowly defeated by Team Scheffler in Golf Channel Games at Trump course in Florida",
    "description": "Scottie Scheffler eclipsed Rory McIlroy in a play-off to win the inaugural Golf Channel Games at Trump National Golf Club Jupiter in Florida.",
    "link": "https://www.independent.ie/sport/golf/rory-mcilroys-squad-narrowly-defeated-by-team-scheffler-in-golf-channel-games-at-trump-course-in-florida/a2130417132.html",
    "timestamp": "2025-12-18T10:34:55Z"
  },
  {
    "title": "US aid cuts force Rohingya girls into marriage, children into hard labour",
    "description": "The cuts have closed schools in Rohingya camps in Bangladesh, leaving children vulnerable to exploitation.",
    "link": "https://www.aljazeera.com/gallery/2025/12/18/us-aid-cuts-force-rohingya-girls-into-marriage-children-into-hard-labour",
    "timestamp": "2025-12-18T10:34:44Z"
  },
  {
    "title": "Watch -- Operation Southern Spear: New U.S. Military Strike Kills Four Drug Traffickers",
    "description": "The United States Southern Command (SOUTHCOM) on Wednesday announced a new \"lethal kinetic strike\" on a drug-trafficking vessel as part of Operation Southern Spear killed four narco-terrorists.\nThe post Watch — Operation Southern Spear: New U.S. Military Stri…",
    "link": "https://www.breitbart.com/politics/2025/12/18/watch-operation-southern-spear-new-u-s-military-strike-kills-four-drug-traffickers/",
    "timestamp": "2025-12-18T10:34:09Z"
  },
  {
    "title": "Kristi Noem Meets With Trump, Internet Can’t Believe Photo She Posts After",
    "description": "Social-media users noticed something unusual in photos Kristi Noem shared from a visit with Donald Trump, sparking debate nline.",
    "link": "https://biztoc.com/x/d08c35c2e48892ef",
    "timestamp": "2025-12-18T10:32:05Z"
  },
  {
    "title": "Melania Trump Drops First Look At New Documentary MELANIA: 'Here We Go Again'",
    "description": "The first lady has unveiled a trailer for an Amazon.com, Inc. (NASDAQ:AMZN)-backed documentary that promises rare behind-the-scenes footage of the days leading up to Donald Trump's 2025 inauguration.\nTrailer Teases Return To The Spotlight\nMelania Trump on Wed…",
    "link": "https://biztoc.com/x/9e13e54c74a109dd",
    "timestamp": "2025-12-18T10:32:04Z"
  },
  {
    "title": "Donald Trump’s ‘Warrior Dividend' Checks Will Cost More Than $2.5 Billion",
    "description": "President Donald Trump has announced that he plans to issue $1,776 checks to U.S. military service members.\nSpeaking from the White House during a televised address, Trump dubbed the payment the “Warrior Dividend” to commemorate the nation’s founding.\n“Milita…",
    "link": "https://biztoc.com/x/c4506b97b317e61c",
    "timestamp": "2025-12-18T10:31:56Z"
  },
  {
    "title": "Battenfeld: Mass. Democratic election officials stonewall Trump on voter rolls",
    "description": "Battenfeld: Secretary of State William Galvin, the eight-term Democratic fossil running the state’s elections, won’t let the Trump administration see details of the state’s voting records.",
    "link": "https://www.bostonherald.com/2025/12/18/battenfeld-mass-democratic-election-officials-stonewall-trump-on-voter-rolls/",
    "timestamp": "2025-12-18T10:30:19Z"
  },
  {
    "title": "US strike on alleged drug boat kills four as Trump claims Venezuela ‘took all of our oil’",
    "description": "Latest attack in Pacific brings death toll to 99 since US began campaign in September",
    "link": "https://www.irishtimes.com/world/americas/2025/12/18/us-strike-on-alleged-drug-boat-kills-four-as-trump-claims-venezuela-took-all-of-our-oil/",
    "timestamp": "2025-12-18T10:24:48Z"
  },
  {
    "title": "Venezuela reacts defiantly to US oil blockade",
    "description": "Venezuela struck a defiant note on Dec. 17, insisting its crude oil exports were not impacted by U.S. President Donald Trump's announcement of a potentially crippling blockade.",
    "link": "https://www.hurriyetdailynews.com/venezuela-reacts-defiantly-to-us-oil-blockade-216953",
    "timestamp": "2025-12-18T10:22:31Z"
  },
  {
    "title": "Market Wrap: Sensex slips 78 pts, Nifty below 25,850 amid broader market weakness",
    "description": "Indian markets ended mostly flat on Thursday, with the Sensex down 78 points and Nifty 50 nearly unchanged. IT and financial stocks led gains, while metals, pharma, and energy lagged. Mid- and small-caps outperformed. The rupee strengthened slightly, global c…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slips-78-pts-nifty-below-25850-amid-broader-market-weakness/articleshow/126056044.cms",
    "timestamp": "2025-12-18T10:17:52Z"
  },
  {
    "title": "Inflation report to be released Thursday expected to show slight uptick in November",
    "description": "The inflation rate stands a percentage point higher than the Fed's target of 2%.",
    "link": "https://abcnews.go.com/Business/inflation-report-released-thursday-expected-show-slight-uptick/story?id=128480220",
    "timestamp": "2025-12-18T10:12:00Z"
  },
  {
    "title": "Senate Confirms Isaacman As NASA Administrator",
    "description": "Approved In Bipartisan Vote After Unusual Selection Process The U.S. Senate approved Jared Isaacman for the role of NASA Administrator on December 17 in a 67-30 vote with sixteen Democrats joining 51 Republicans in the confirmation vote, in one of the agency’…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=77E146FD-D3B7-4488-B0CD-7B3A5CBF6B65",
    "timestamp": "2025-12-18T10:05:00Z"
  },
  {
    "title": "GOP seizes on Dem civil war as progressives jump into key 2026 Senate races: ‘They're in shambles’",
    "description": "Progressive Democrats enter competitive Senate primaries amid party divisions, with Rep. Jasmine Crockett's Texas campaign highlighting ideological rifts.",
    "link": "https://www.foxnews.com/politics/gop-seizes-dem-civil-war-progressives-jump-key-2026-senate-races-theyre-shambles",
    "timestamp": "2025-12-18T10:00:50Z"
  },
  {
    "title": "The America first National Security Strategy — through the eyes of 'We the People'",
    "description": "Trump's 'America First' strategy matches public demand for stronger military against China, yet Americans favor more NATO support than suggested.",
    "link": "https://www.foxnews.com/opinion/america-first-security-strategy-through-eyes-we-people",
    "timestamp": "2025-12-18T10:00:27Z"
  },
  {
    "title": "MORNING GLORY: RIP Norman Podhoretz",
    "description": "Conservative intellectual Norman Podhoretz, whose Commentary Magazine editorship influenced American political discourse and potentially Reagan's presidency, has passed away.",
    "link": "https://www.foxnews.com/opinion/morning-glory-rip-norman-podhoretz",
    "timestamp": "2025-12-18T10:00:19Z"
  },
  {
    "title": "Trump launches massive ‘Freedom 250’ push to ignite America’s 250th birthday celebration",
    "description": "President Donald Trump's new Freedom 250 partnership features patriotic events, educational toolkits and a 50-state tour celebrating America's founding anniversary.",
    "link": "https://www.foxnews.com/politics/trump-launches-massive-freedom-250-push-ignite-americas-250th-birthday-celebration",
    "timestamp": "2025-12-18T10:00:18Z"
  },
  {
    "title": "World’s biggest oil reserve holder faces US chokehold as Trump targets Venezuela’s shadow tanker fleet",
    "description": "Trump orders total blockade of Venezuelan oil tankers as the South American nation controls world's largest oil reserves with over 300 billion barrels.",
    "link": "https://www.foxnews.com/politics/worlds-biggest-oil-reserve-holder-faces-us-chokehold-trump-targets-venezuelas-shadow-tanker-fleet",
    "timestamp": "2025-12-18T10:00:12Z"
  },
  {
    "title": "D.C.'s homeless hide in plain sight, growing sicker and costing taxpayers more",
    "description": "The White House says encampment sweeps have enhanced the capital, but city leaders estimate nearly 700 homeless people roam by day and bed down outdoors by night.",
    "link": "https://www.cbsnews.com/news/washington-dc-homeless-health-care-costs/",
    "timestamp": "2025-12-18T10:00:06Z"
  },
  {
    "title": "Washington’s Homeless Hide in Plain Sight, Growing Sicker and Costing Taxpayers More",
    "description": "The White House says encampment sweeps have enhanced the capital, but city leaders estimate nearly 700 homeless people roam by day and bed down outdoors by night. Some have scattered to the suburbs while others avoid detection, making it hard for medical prov…",
    "link": "https://kffhealthnews.org/news/article/washington-dc-homelessness-crackdown-hiding-plain-sight-street-medicine/",
    "timestamp": "2025-12-18T10:00:00Z"
  },
  {
    "title": "Zohran Mamdani on FDR, LaGuardia—and Trump",
    "description": "John Nichols\n\n\n\nIn an exclusive interview with The Nation, the mayor-elect goes behind the scenes of his meeting with the president and talks about some of his political heroes.\r\n\n\r\n\n\nThe post Zohran Mamdani on FDR, LaGuardia—and Trump appeared first on The N…",
    "link": "https://www.thenation.com/?post_type=article&p=580964",
    "timestamp": "2025-12-18T10:00:00Z"
  },
  {
    "title": "What’s Wrong with The American Revolution by Ken Burns",
    "description": "The acclaimed filmmaker’s latest PBS series is long on muskets and bayonets, but the political history of the Revolution remains strangely understated. \nThe post What’s Wrong with The American Revolution by Ken Burns  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/12/18/whats-wrong-with-the-american-revolution-ken-burns/",
    "timestamp": "2025-12-18T10:00:00Z"
  },
  {
    "title": "Worried About Health Insurance Costs? There May Be Cheaper Options — But With Trade-Offs",
    "description": "As the clock ticks down on the 2026 Obamacare open enrollment season, frustrated consumers may have to make sacrifices on coverage to get a price they can stomach. But cheaper alternatives come with risks.",
    "link": "https://kffhealthnews.org/news/article/aca-obamacare-cheaper-health-insurance-plans-premiums-short-term-indemnity/",
    "timestamp": "2025-12-18T10:00:00Z"
  },
  {
    "title": "Call 911 or Risk Losing the Baby? Raids Force Some Immigrants To Avoid Care",
    "description": "More immigrants in New Orleans and Mississippi are skipping important health care appointments and experiencing heightened stress amid federal immigration raids.",
    "link": "https://kffhealthnews.org/news/article/immigration-deportation-risk-immigrants-avoid-health-care-new-orleans-mississippi/",
    "timestamp": "2025-12-18T10:00:00Z"
  },
  {
    "title": "Our Favorite Lit Hub Stories From 2025",
    "description": "From essays to interviews, excerpts to blog posts, reading lists to poems, we publish a lot of good stuff at Lit Hub, if we do say so ourselves. And while we are proud of all of the pieces we’ve shared",
    "link": "https://lithub.com/our-favorite-lit-hub-stories-from-2025/",
    "timestamp": "2025-12-18T09:59:21Z"
  },
  {
    "title": "Spot Bitcoin ETF sees sharp inflow revival amid shifting US rate signals",
    "description": "Fidelity’s FBTC dominated inflows, with BlackRock’s IBIT also posting strong demand. Cumulative net inflows into US spot Bitcoin ETFs have exceeded $57 billion. Shifting US rate expectations are shaping institutional ETF positioning. Spot Bitcoin exchange-tra…",
    "link": "https://coinjournal.net/news/spot-bitcoin-etf-sees-sharp-inflow-revival-amid-shifting-us-rate-signals/",
    "timestamp": "2025-12-18T09:49:35Z"
  },
  {
    "title": "'F**k Them And Their Dolls...': Mary Trump Exposes Grinch-Like Irony In Uncle's Holiday Advice",
    "description": "Donald Trump's niece sarcastically suggested there's only one way this Christmas to \"prove to Donald that you’re a real American.\"",
    "link": "https://www.huffpost.com/entry/mary-trump-donald-trump-holiday-irony_n_6943c50be4b0bafbdede3d79",
    "timestamp": "2025-12-18T09:47:46Z"
  },
  {
    "title": "Maduro Discussed US Threats Against Venezuela With UN Secretary-General",
    "description": "UN/MEXICO CITY (Sputnik) - Venezuelan President Nicolas Maduro spoke with UN Secretary-General Antonio Guterres by phone to warn of the escalation of threats against Venezuela and their dangerous consequences for regional peace, the Venezuelan government said.",
    "link": "https://sputnikglobe.com/20251218/maduro-discussed-us-threats-against-venezuela-with-un-secretary-general-1123319532.html",
    "timestamp": "2025-12-18T09:43:09Z"
  },
  {
    "title": "Trump Addresses The Nation: It's Not My Fault!",
    "description": "Donald Trump spoke to the nation for under twenty minutes Wednesday night and used his time not to assure Americans that help is on the way as they suffer from inflation and healthcare issues, but instead to proclaim nothing is his fault. \nTrump didn't mentio…",
    "link": "https://crooksandliars.com/2025/12/trump-speech-nation-its-not-my-fault",
    "timestamp": "2025-12-18T09:42:44Z"
  },
  {
    "title": "Venezuelans brace for hardship as Trump threatens oil blockade",
    "description": "After years of shortages and economic collapse, Venezuelans face fresh uncertainty as Trump threatens an oil blockade — but many say they're too exhausted to do anything but endure.",
    "link": "https://www.npr.org/2025/12/18/nx-s1-5647750/venezuela-oil-trump-maduro",
    "timestamp": "2025-12-18T09:42:30Z"
  },
  {
    "title": "Charlie Kirk Wine, And Indiana Tells Trump Buh-Bye!",
    "description": "Yes, we had to discuss the requisite stories of Pete Hegseth, Pirate of the Caribbean, Donald Trump getting better sleep during meetings than Mel Brooks’ 2000 year old man—and Trump prostrating himself before Vlad Putin.\nLawrence followed with something darke…",
    "link": "https://crooksandliars.com/2025/12/charlie-kirk-wine-and-indiana-tells-trump",
    "timestamp": "2025-12-18T09:42:25Z"
  },
  {
    "title": "Mike's Blog Round Up",
    "description": "Horizons: What scares Donald Trump and his enablers about so-called \"sh**thole countries.\"\nPharyngula: Joe Lonsdale, emblematic of the problems of the rich. \nGod's Spies: Writing versus journalism – which tells the better truth?\nPublic Health Post: 2025 year …",
    "link": "https://crooksandliars.com/2025/12/mikes-blog-round-2",
    "timestamp": "2025-12-18T09:41:55Z"
  },
  {
    "title": "House GOP passes narrow health care package, letting key Obamacare subsidies expire",
    "description": "(CNN) — House Republicans on Wednesday approved a narrow package designed to lower health care costs for some Americans in the coming years – marking a win for leadership even",
    "link": "https://www.wkow.com/news/national/house-gop-passes-narrow-health-care-package-letting-key-obamacare-subsidies-expire/article_e474cb57-683d-5c83-a5a7-4fc29266c58f.html",
    "timestamp": "2025-12-18T09:41:52Z"
  },
  {
    "title": "Furious Venezuelan Regime Appeals to U.N. over 'Evil' Trump Oil Blockade",
    "description": "Venezuela's socialist Maduro regime has requested an urgent U.N. Security Council meeting to address President Donald Trump's order to impose a blockade of all sanctioned oil tankers entering or leaving Venezuela.\nThe post Furious Venezuelan Regime Appeals to…",
    "link": "https://www.breitbart.com/latin-america/2025/12/18/furious-venezuelan-regime-appeals-to-u-n-over-evil-trump-oil-blockade/",
    "timestamp": "2025-12-18T09:36:36Z"
  },
  {
    "title": "Modest but steady economic growth lets Europe get by without an interest rate cut",
    "description": "Interest rates in Europe are going to stay right where they are at a meeting of European Central Bank officials",
    "link": "https://abcnews.go.com/International/wireStory/modest-steady-economic-growth-lets-europe-interest-rate-128511620",
    "timestamp": "2025-12-18T09:31:38Z"
  },
  {
    "title": "Here’s the global playbook being used to crack down on climate protest",
    "description": "A new study finds that repression of environmental protest is rising worldwide and Indigenous land defenders face the greatest risk.",
    "link": "https://grist.org/global-indigenous-affairs-desk/heres-the-global-playbook-being-used-to-crack-down-on-climate-protest/",
    "timestamp": "2025-12-18T09:30:00Z"
  },
  {
    "title": "US announces largest-ever arms sale to Taiwan",
    "description": "The US has approved its largest-ever arms package for Taiwan, worth $11.1 billion, featuring advanced rocket systems, missiles and drones Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629586-us-taiwan-arms-sale/",
    "timestamp": "2025-12-18T09:21:45Z"
  },
  {
    "title": "Fact-checking Trump's presidential address claim he's brought prices down",
    "description": "President Donald Trump said during his presidential address on Wednesday night that his administration is \"bringing our economy back from the brink of ruin.\"",
    "link": "https://abcnews.go.com/Politics/fact-checking-trumps-presidential-address-claim-brought-gas/story?id=128506721",
    "timestamp": "2025-12-18T09:21:17Z"
  },
  {
    "title": "Modest but steady economic growth lets Europe get by without an interest rate cut",
    "description": "FRANKFURT, Germany (AP) — Signs of a modest economic upswing in Europe will likely let the European Central Bank keep interest rates unchanged Thursday for a fourth straight meeting. President Christine Lagarde has said at recent meetings that monetary policy…",
    "link": "https://financialpost.com/pmn/modest-but-steady-economic-growth-lets-europe-get-by-without-an-interest-rate-cut",
    "timestamp": "2025-12-18T09:21:13Z"
  },
  {
    "title": "Controversial FBI deputy director to resign next month",
    "description": "While Dan Bongino did not say when in January he would leave or what he would do next, US president Donald Trump said earlier in the day: \"Dan did a great job. I think he wants to go back to his show.\"",
    "link": "https://news.sky.com/story/dan-bongino-controversial-fbi-deputy-director-to-resign-next-month-13485083",
    "timestamp": "2025-12-18T09:17:00Z"
  },
  {
    "title": "European Central Bank leaves rates unchanged with economy showing signs of modest growth",
    "description": "The European Central Bank is leaving interest rates unchanged for the fourth meeting in a row as the economy in the 20 countries that use the euro increasingly looks strong enough to get by without the stimulus of lower borrowing costs for businesses and cons…",
    "link": "https://www.wsbtv.com/news/business/european-central/ZUKMRRZFDM4ABIH7W2GUY3QPPI/",
    "timestamp": "2025-12-18T09:16:13Z"
  },
  {
    "title": "10,000 CDL drivers out-of-service with English language proficiency violations: Where's the rates bump?",
    "description": "Are 10,000 drivers really sidelined after ELP violations? Or are some states letting them go? Overdrive finds the real story.",
    "link": "https://www.overdriveonline.com/business/article/15774485/10000-cdl-drivers-placed-outofservice-for-english-langauge-proficiency-violations-wheres-the-rates-bump",
    "timestamp": "2025-12-18T09:14:27Z"
  },
  {
    "title": "Palmer Luckey told you so",
    "description": "When the memelord founded Anduril, defense was a dirty word in tech. Now 'ew' is 'oorah.'",
    "link": "https://www.businessinsider.com/palmer-luckey-america-worlds-gun-store-defense-tech-2025-12",
    "timestamp": "2025-12-18T09:11:01Z"
  }
]