[
  {
    "title": "White House Takes Issue With Pope’s Comments on Immigration",
    "description": "The White House is disputing Pope Leo XIV’s characterization this week of what he regards as the “inhuman treatment” of immigrants by the Trump administration. ... Read More\nThe post White House Takes Issue With Pope’s Comments on Immigration appeared first o…",
    "link": "https://www.dailysignal.com/2025/10/04/white-house-disputes-popes-comments-on-immigration/",
    "timestamp": "2025-10-04T13:30:00Z"
  },
  {
    "title": "The Trump plan may end Gaza war — but the pain of the massacre that sparked it will live on",
    "description": "Sick Jew-hatred, alas, will long linger, as will the pain that Jews have endured these past years.",
    "link": "https://nypost.com/2025/10/04/opinion/the-trump-plan-may-end-gaza-war-but-the-pain-of-the-massacre-that-sparked-it-will-live-on/",
    "timestamp": "2025-10-04T13:29:11Z"
  },
  {
    "title": "Play stupid games, don’t win stupid prizes",
    "description": "I’m far from an expert on this topic, but this entire exercise seems ludicrous on its face: This did not go the way Prime Minister Benjamin Netanyahu wanted. On Monday, the Israeli leader won a peace plan from President Trump that promised him total victory, …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/play-stupid-games-dont-win-stupid-prizes",
    "timestamp": "2025-10-04T13:28:19Z"
  },
  {
    "title": "Leaked Texts Reveal Trump Officials Floated Airborne Troops to ‘War-Ravaged’ US City",
    "description": "Trump administration officials privately discussed sending one of the country’s most hardened combat units into Portland, Oregon, leaked Signal messages reveal.\nThe post Leaked Texts Reveal Trump Officials Floated Airborne Troops to ‘War-Ravaged’ US City firs…",
    "link": "https://www.mediaite.com/media/news/leaked-texts-reveal-trump-officials-floated-airborne-troops-to-war-ravaged-us-city/",
    "timestamp": "2025-10-04T13:25:23Z"
  },
  {
    "title": "White conservatives can't stop blaming Barack Obama for their own racism [Asinine]",
    "description": "White conservatives can't stop blaming Barack Obama for their own racism",
    "link": "https://www.fark.com/comments/13833986/White-conservatives-cant-stop-blaming-Barack-Obama-for-their-own-racism",
    "timestamp": "2025-10-04T13:20:24Z"
  },
  {
    "title": "Malawi's Mutharika sworn in for second term as president",
    "description": "BLANTYRE (Reuters) -Malawi's Peter Mutharika vowed to root out government corruption and rebuild an ailing economy after he was sworn in on Saturday for a second term as president of the southern African nation. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/04/malawi039s-mutharika-sworn-in-for-second-term-as-president",
    "timestamp": "2025-10-04T13:20:00Z"
  },
  {
    "title": "‘No idea what she’s talking about!’ Chicago mayor slams Kristi Noem for ‘delusional' claim",
    "description": "Chicago Mayor Brandon Johnson fired off at Homeland Security Secretary Kristi Noem Saturday in response to what he called her “delusional” claims that protesters in Illinois’ most-populated city were threatening to harm federal agents and their families.On Fr…",
    "link": "https://www.rawstory.com/chicago-2674154826/",
    "timestamp": "2025-10-04T13:20:00Z"
  },
  {
    "title": "Democrats slammed for meme of Karoline Leavitt in Sombrero — Trump did the same days earlier",
    "description": "Democrats recently targeted  White House Press Secretary Karoline Leavitt in a currently-deleted X post, portraying her in a sombrero and mustache amid what they referred to as the  Trump shutdown.  The tweet stated:  TRUMP SHUTDOWN = NO FIESTA  and was remov…",
    "link": "https://economictimes.indiatimes.com/news/international/us/democrats-slammed-for-meme-of-karoline-leavitt-in-sombrero-trump-did-the-same-days-earlier/articleshow/124308118.cms",
    "timestamp": "2025-10-04T13:19:18Z"
  },
  {
    "title": "Netanyahu under pressure as Trump pushes Gaza deal with Hamas",
    "description": "US president Donald Trump&#039;s order to halt fire in Gaza has forced Israeli Prime Minister Benjamin Netanyahu to ban his m",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/10/4/netanyahu-under-pressure-as-trump-pushes-gaza-deal-with-hamas",
    "timestamp": "2025-10-04T13:12:49Z"
  },
  {
    "title": "Trump's \"N-Words\" Are Sort of What You'd Expect at This Point",
    "description": "Trump's \"N-Words\" Are Sort of What You'd Expect at This Pointcafemom.com",
    "link": "https://cafemom.com/entertainment/trumps-two-n-words-are-sort-of-what-youd-expect-at-this-point",
    "timestamp": "2025-10-04T13:08:00Z"
  },
  {
    "title": "Donald Trump's $100,000 H-1B Visa Hit by Major Legal Hurdle",
    "description": "President Donald Trump does not have the constitutional authority to impose a $100,000 fee on new H-1B visas for highly skilled foreign workers, according to a lawsuit opposing the move.\nA group of unions, employers and religious groups represented by attorne…",
    "link": "https://biztoc.com/x/b77c6754a5d3ed73",
    "timestamp": "2025-10-04T13:05:19Z"
  },
  {
    "title": "World Liberty Financial Sells WLFI Token at 25% Premium to Bitcoin Miner Hut 8",
    "description": "Donald Trump's World Liberty Financial sold roughly 100 million WLFI tokens to Bitcoin miner Hut 8 for $25 million.",
    "link": "https://beincrypto.com/world-liberty-financial-sold-tokens-at-a-premium-to-bitcoin-miner/",
    "timestamp": "2025-10-04T13:05:13Z"
  },
  {
    "title": "Bill Maher Ridicules ‘Manly’ Trump Administration In Blistering Rant On Bonkers Military Speech",
    "description": "Bill Maher roasted Trump and Pete Hegseth on their over-the-top military speeches, mocking the notion they represent a \"manly administration.\"\nThe post Bill Maher Ridicules ‘Manly’ Trump Administration In Blistering Rant On Bonkers Military Speech first appea…",
    "link": "https://www.mediaite.com/media/entertainment/bill-maher-ridicules-manly-trump-administration-in-blistering-rant-on-bonkers-military-speech/",
    "timestamp": "2025-10-04T13:00:48Z"
  },
  {
    "title": "Legal threats are pushing Trump's tariff strategy in new directions. Don't expect more certainty.",
    "description": "The Supreme Court won’t consider the fate of President Trump’s blanket tariffs until November, but the White House already appears to be making adjustments...",
    "link": "https://finance.yahoo.com/news/legal-threats-are-pushing-trumps-tariff-strategy-in-new-directions-dont-expect-more-certainty-130045707.html",
    "timestamp": "2025-10-04T13:00:45Z"
  },
  {
    "title": "Mike Johnson hasn’t sworn in this new Democrat. Is it because she wants to release the Epstein files?",
    "description": "Adelita Grijalva of Arizona came to Washington DC this week, but returned two days later, a little confused",
    "link": "https://uk.news.yahoo.com/mike-johnson-hasn-t-sworn-130007632.html",
    "timestamp": "2025-10-04T13:00:07Z"
  },
  {
    "title": "FACT FOCUS: Democrats did not shut down government to give health care to immigrants - NewsBreak",
    "description": "President Donald Trump and other high-ranking Republicans claim Democrats forced the government shutdown fight because they want to give free health care t",
    "link": "https://www.newsbreak.com/share/4269009889946-fact-focus-democrats-did-not-shut-down-government-to-give-health-care-to-immigrants?s=a2&amp;share_destination_id=MzA3ODg1MTc3LTE3NTk1ODI3NTk1NzQ%3D&amp;pd=0KpqzxIY&amp;hl=en_US&amp;send_time=1759582759&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-04T13:00:05Z"
  },
  {
    "title": "Palestinians report new airstrikes after Trump call to stop bombs...",
    "description": "Israeli airstrikes on the Gaza Strip continued on Saturday, Palestinian sources said, despite US President Donald Trump's call to immediately halt the...",
    "link": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:251004-99-232022/",
    "timestamp": "2025-10-04T13:00:04Z"
  },
  {
    "title": "A Fair Shot for the Trump Phone",
    "description": "When Donald Jr. and Eric Trump announced the launch of Trump Mobile in June, the prospect of an “America First” alternative in a phone marketplace... Read More\nThe post A Fair Shot for the Trump Phone appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/04/a-fair-shot-for-the-trump-phone/",
    "timestamp": "2025-10-04T13:00:00Z"
  },
  {
    "title": "Legal Setbacks Mount For Trump’s Birthright Order Before Likely Supreme Court Review",
    "description": "A three-judge panel of the 1st U.S. Circuit Court of Appeals in Boston said in a unanimous decision that the Republican president cannot enforce the order.",
    "link": "https://www.huffpost.com/entry/legal-setbacks-mount-for-trumps-birthright-order-before-likely-supreme-court-review_n_68e118a8e4b01314b83e0270",
    "timestamp": "2025-10-04T12:59:46Z"
  },
  {
    "title": "Hamas showing it is 'ready for peace': Turkey's Erdogan",
    "description": "\"Hamas has shown, as it has done many times before, that it is ready for peace. Thus, a window of opportunity has opened for lasting peace in our region,\" Erdogan told a ceremony in Istanbul.",
    "link": "https://economictimes.indiatimes.com/news/defence/hamas-showing-it-is-ready-for-peace-turkeys-erdogan/articleshow/124307903.cms",
    "timestamp": "2025-10-04T12:50:18Z"
  },
  {
    "title": "Trump Responds After Hamas Agrees to Release Israeli Hostages",
    "description": "After Hamas agreed to parts of President Donald Trump's Gaza proposal, the president posted a message to his Truth Social platform, describing it as an “unprecedented day” and announcing they are “very close to achieving peace in the Middle East.” NBC’s Julie…",
    "link": "https://www.today.com/video/trump-responds-to-hamas-agreeing-to-parts-of-peace-proposal-249090629997",
    "timestamp": "2025-10-04T12:50:02Z"
  },
  {
    "title": "The Next Mamdani? Meet Minneapolis’s Muslim Socialist Mayoral Candidate",
    "description": "The Mamdani momentum is taking the country by storm. After his big New York City primary win shocked the Democratic establishment, socialists like Zohran Mamdani are not just gaining popularity, but are actually being recognized as serious candidates in elect…",
    "link": "https://freerepublic.com/focus/f-news/4344283/posts",
    "timestamp": "2025-10-04T12:44:48Z"
  },
  {
    "title": "Trump is reviving large sales of coal from public lands. Will anyone want it?",
    "description": "U.S. officials in the coming days are set to hold the government's biggest coal sales in more than a decade, offering 600 million tons from publicly owned reserves next to strip mines in Montana and Wyoming.\nThe sales are a signature piece of President Donald…",
    "link": "https://biztoc.com/x/601e71f74902d352",
    "timestamp": "2025-10-04T12:43:29Z"
  },
  {
    "title": "Inside the uranium plant at the center of U.S. plans to expand nuclear power",
    "description": "Urenco operates the only uranium enrichment plant in the U.S. It is boosting production as the U.S. bans Russian fuel at the same time nuclear demand grows.",
    "link": "https://www.cnbc.com/2025/10/04/urenco-centrus-orano-enriched-uranium-nuclear-russia-ai-data-center.html",
    "timestamp": "2025-10-04T12:40:09Z"
  },
  {
    "title": "Israel troops still operating in Gaza after Trump, hostage family appeals",
    "description": "Israel said Saturday its troops were still operating in Gaza and warned residents not to return, despite calls from the families of Israeli hostages and US President Donald Trump for an immediate halt to the fighting.",
    "link": "https://www.hurriyetdailynews.com/israel-troops-still-operating-in-gaza-after-trump-hostage-family-appeals-214311",
    "timestamp": "2025-10-04T12:40:06Z"
  },
  {
    "title": "October 3, 2025 — Although President Donald J. Trump has not appeared in public since Tuesday ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nOctober 3, 2025  —  Although President Donald J. Trump has not appeared in public since Tuesday, his social media account has been posting up a storm.  Just three weeks ago, administration officials were insi…",
    "link": "https://www.memeorandum.com/251004/p16",
    "timestamp": "2025-10-04T12:40:00Z"
  },
  {
    "title": "Millions of demonstrators strike, march across Spain, Italy, Portugal to protest war in Gaza",
    "description": "Italy already saw more than 2 million people rally on Friday across the country in a one-day general strike to support the residents of Gaza.",
    "link": "https://nypost.com/2025/10/04/world-news/protesters-gather-across-spain-italy-and-portugal-against-the-war-in-gaza/",
    "timestamp": "2025-10-04T12:35:34Z"
  },
  {
    "title": "Hamas showing it is ready for peace: Erdoğan",
    "description": "President Recep Tayyip Erdoğan on Saturday welcomed Hamas's positive reaction to a peace deal proposed by U.S. President Donald Trump, and said the group was \"ready for peace.\"",
    "link": "https://www.hurriyetdailynews.com/hamas-showing-it-is-ready-for-peace-erdogan-214310",
    "timestamp": "2025-10-04T12:35:17Z"
  },
  {
    "title": "Trump is reviving large sales of coal from public lands. Will anyone want it?",
    "description": "U.S. officials in coming days are set to hold the government’s biggest coal sales in more than a decade.",
    "link": "https://www.ksat.com/business/2025/10/04/trump-is-reviving-large-sales-of-coal-from-public-lands-will-anyone-want-it/",
    "timestamp": "2025-10-04T12:34:52Z"
  },
  {
    "title": "Fox News AI Newsletter: Trump order harnesses AI to fight childhood cancer",
    "description": "Executive order signed by President Donald Trump tasks Robert F. Kennedy Jr.'s MAHA Commission with using AI to find new cures for childhood cancers.",
    "link": "https://www.foxnews.com/tech/ai-newsletter-trump-order-harnesses-ai-fight-childhood-cancer",
    "timestamp": "2025-10-04T12:30:59Z"
  },
  {
    "title": "‘This Is A Big Day!’ Trump Celebrates Hostage Deal In Friday Night Oval Office Statement",
    "description": "President Donald Trump celebrated a \"very special day\" with a brief Oval Office statement on the deal to release hostages and move toward peace in Gaza.\nThe post ‘This Is A Big Day!’ Trump Celebrates Hostage Deal In Friday Night Oval Office Statement first ap…",
    "link": "https://www.mediaite.com/online/this-is-a-big-day-trump-celebrates-hostage-deal-in-friday-night-oval-office-statement/",
    "timestamp": "2025-10-04T12:30:28Z"
  },
  {
    "title": "The Kremlin’s reporter",
    "description": "Pavel Zarubin has access to President Putin that other journalists can only dream of. He interviews him regularly, and travels around the world covering huge geopolitical meetings, even posting to his vast social media audience from Putin's meetings with Dona…",
    "link": "https://www.bbc.co.uk/programmes/p0m680pn",
    "timestamp": "2025-10-04T12:30:00Z"
  },
  {
    "title": "What happens during US government shutdown? How does it impact the US, India?",
    "description": "The US shutdown could cause ripple effects on the global supply chains, which could potentially affect India and other Asian factories. Indian stock markets may see minor short-term effects",
    "link": "https://www.thehindubusinessline.com/blexplainer/what-happens-during-us-government-shutdown-how-does-it-impact-the-us-india/article70124600.ece",
    "timestamp": "2025-10-04T12:26:35Z"
  },
  {
    "title": "Hamas just accepted Trump’s ‘peace’ plan. Here’s what it didn’t accept.",
    "description": "Hamas just accepted Donald Trump’s “peace” plan. Here’s what Hamas didn't accept, how Trump reacted, and why Netanyahu was blindsided.",
    "link": "https://mondoweiss.net/2025/10/hamas-just-accepted-trumps-peace-plan-heres-what-it-didnt-accept/",
    "timestamp": "2025-10-04T12:25:58Z"
  },
  {
    "title": "Business groups urge Trump to reconsider $100,000 H-1B application fee",
    "description": "President Donald Trump's new $100,000 H-1B visa application fee has drawn criticism from US business groups, warning it could harm the economy.",
    "link": "https://www.newsbytesapp.com/news/business/trump-s-100-000-h-1b-application-fee-facing-pushback-from-businesses/story",
    "timestamp": "2025-10-04T12:25:49Z"
  },
  {
    "title": "New Supreme Court Term Confronts Justices With Trump's Aggressive Assertion Of Presidential Power",
    "description": "The justices will pass judgment in the next 10 months on some of Trump's most controversial efforts.",
    "link": "https://www.huffpost.com/entry/new-supreme-court-term-confronts-justices-with-trumps-aggressive-assertion-of-presidential-power_n_68e10fc2e4b0c7ccc3c1e865",
    "timestamp": "2025-10-04T12:25:30Z"
  },
  {
    "title": "Trump is reviving large sales of coal from public lands. Will anyone want it?",
    "description": "BILLINGS, Mont. (AP) — U.S. officials in the coming days are set to hold the government’s biggest coal sales in more than a decade, offering 600 million tons from publicly owned reserves next to strip mines in Montana and Wyoming. The sales are a signature pi…",
    "link": "https://financialpost.com/pmn/trump-is-reviving-large-sales-of-coal-from-public-lands-will-anyone-want-it",
    "timestamp": "2025-10-04T12:22:22Z"
  },
  {
    "title": "Climate Villains Deserve the Hell They're Making on Earth",
    "description": "As imagined by Dante Alighieri (1265-1321) in The Divine Comedy\r\n, Hell has nine \r\nlevels, with the lowest reserved for the very worst souls. Although it is no longer fashionable to believe that Hell exists, we can't prove that it doesn't. And it is generally…",
    "link": "https://www.commondreams.org/opinion/climate-hell-on-earth",
    "timestamp": "2025-10-04T12:22:05Z"
  },
  {
    "title": "Trump wants to mine more coal from public lands as appetite for it lags",
    "description": "U.S. officials in coming days are set to hold the government’s biggest coal sales in more than a decade. About 600 million tons of the fuel will be auctioned from publicly owned reserves next to strip mines in Montana and Wyoming. Data analyzed by The Associa…",
    "link": "https://apnews.com/article/trump-coal-public-lands-sales-3239c138a851b157c340fe3f5d1fc600",
    "timestamp": "2025-10-04T12:19:33Z"
  },
  {
    "title": "Trump is reviving large sales of coal from public lands. Will anyone want it?",
    "description": "U.S. officials in the coming days are set to hold the government's biggest coal sales in more than a decade, offering 600 million tons from publicly owned...",
    "link": "https://finance.yahoo.com/news/trump-reviving-large-sales-coal-121933968.html",
    "timestamp": "2025-10-04T12:19:33Z"
  },
  {
    "title": "Japan's ruling party elects Sanae Takaichi as new leader, likely first female PM",
    "description": "An admirer of former British Prime Minister Margaret Thatcher, Sanae Takaichi is a protege of the ultra-conservative vision of former Japanese Prime Minister Shinzo Abe.",
    "link": "https://www.cbsnews.com/news/japan-ruling-party-elected-sanae-takaichi-as-new-leader/",
    "timestamp": "2025-10-04T12:16:52Z"
  },
  {
    "title": "Radioactive issues could still derail Gaza ceasefire despite momentum for peace",
    "description": "The speed with which the diplomacy is moving is dizzying but the question remains whether or not it will lead to concrete developments, or instead become mired in quicksand like so many previous peace processes in the Middle East.",
    "link": "https://news.sky.com/story/radioactive-issues-could-still-derail-gaza-ceasefire-despite-momentum-for-peace-13444095",
    "timestamp": "2025-10-04T12:07:00Z"
  },
  {
    "title": "Trump White House Makes Brutal Gaffe In Now-Deleted Post",
    "description": "Trump's White House made a brutal gaffe in an X/Twitter post that was deleted, claiming a statement from Hamas was actually from \"President Donald J. Trump.\"\nThe post Trump White House Makes Brutal Gaffe In Now-Deleted Post first appeared on Mediaite.",
    "link": "https://www.mediaite.com/online/trump-white-house-makes-brutal-gaffe-in-now-deleted-post/",
    "timestamp": "2025-10-04T12:06:04Z"
  },
  {
    "title": "With ‘no juggernaut’ in the field, Colorado Republicans — 19 and counting — line up for governor’s race",
    "description": "A baseball lineup’s worth of conservative candidates for Colorado governor showed for a GOP forum this week -- and that was only half of the declared field in the still-early 2026 Republican contest.",
    "link": "https://www.denverpost.com/2025/10/04/colorado-governor-race-republican-field-debate/",
    "timestamp": "2025-10-04T12:00:36Z"
  },
  {
    "title": "Putin faces carnage coming to Moscow...",
    "description": "AS Vladimir Putin feeds waves of Russians into the meatgrinder in Ukraine, his capital city remains almost completely unscathed by the war. The bloody carnage spiralling on the frontline is a far c…",
    "link": "https://www.the-sun.com/news/15264631/putin-echo-chamber-capital-insulated-ukraine-war/",
    "timestamp": "2025-10-04T12:00:08Z"
  },
  {
    "title": "McClellan: Community standards when cruelty is cool",
    "description": "Bill McClellan writes: Words have lost whatever shock value they once had. We’re conditioned to coarseness and tough talk.",
    "link": "https://www.stltoday.com/news/local/column/bill-mcclellan/article_def3f0fc-9a20-46cd-bcea-70886655dc61.html",
    "timestamp": "2025-10-04T12:00:00Z"
  },
  {
    "title": "US running out of money to keep nuclear arsenal safe",
    "description": "Funding to oversee the weapons’ safety could lapse due to an ongoing government shutdown, the energy secretary has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625895-us-nuclear-arsenal-monitoring-funding/",
    "timestamp": "2025-10-04T11:58:43Z"
  },
  {
    "title": "Israel's army says it will advance preparations for the first phase of Trump's plan",
    "description": "Israel's army is advancing preparations for Trump's peace plan to end the Gaza war and return hostages, following Hamas's conditional acceptance. Trump, keen to deliver peace, secured Netanyahu's endorsement, but skepticism remains over Hamas's commitment to …",
    "link": "https://economictimes.indiatimes.com/news/defence/israels-army-says-it-will-advance-preparations-for-the-first-phase-of-trumps-plan/articleshow/124307285.cms",
    "timestamp": "2025-10-04T11:57:49Z"
  },
  {
    "title": "Gazans Hail Trump Ceasefire Call As Hamas Agrees To Free Hostages",
    "description": "Smoke billowed over Gaza City on Saturday, yet for the first time in months, residents felt a ceasefire was within reach as they welcomed US President Donald Trump's call for Israel to stop bombing.",
    "link": "https://www.ibtimes.com/gazans-hail-trump-ceasefire-call-hamas-agrees-free-hostages-3785588",
    "timestamp": "2025-10-04T11:57:17Z"
  },
  {
    "title": "Journalist Arrested While Covering Protest Near Atlanta Deported To El Salvador",
    "description": "Mario Guevara’s arrest and detention drew condemnation from journalism, press freedom and civil liberties groups.",
    "link": "https://www.huffpost.com/entry/journalist-arrested-while-covering-protest-near-atlanta-deported-to-el-salvador_n_68e1087ae4b01314b83e0109",
    "timestamp": "2025-10-04T11:56:00Z"
  },
  {
    "title": "Senior US senator wants to boost pressure on China over Taiwan",
    "description": "WASHINGTON: The chairman of the US Senate Foreign Relations Committee said on Friday (Oct 3) he will introduce legislation to deter aggression against Taiwan by identifying targets for economic measures that could be deployed rapidly if China acts against the…",
    "link": "https://www.channelnewsasia.com/world/senior-us-senator-boost-pressure-china-taiwan-5384841",
    "timestamp": "2025-10-04T11:55:44Z"
  },
  {
    "title": "Trump Makes America Dream Expensive For Indian Students",
    "description": "US President Donald Trump’s decision to cap international undergraduate students to 15 per cent of a college, with no more than 5 per cent from any single country, has evoked sharp criticism from Telugu students, who form a considerable chuck from India seeki…",
    "link": "https://freerepublic.com/focus/f-chat/4344274/posts",
    "timestamp": "2025-10-04T11:52:02Z"
  },
  {
    "title": "Have bad have tariffs been for Canada’s supermarkets?",
    "description": "Loblaw, Metro and Sobeys owner Empire have continued to reap higher profits and report slightly better gross profit margins than last year, deftly weathering the tariff squalls.",
    "link": "https://www.thestar.com/business/tariffs-what-tariffs-how-loblaws-metro-and-sobeys-are-keeping-profits-high-despite-trumps-threats/article_1dba7859-6050-453d-b1dc-e7b621bbdf2d.html",
    "timestamp": "2025-10-04T11:47:48Z"
  },
  {
    "title": "Ukraine updates: Russia hits passenger train, injures dozens",
    "description": "Russia has continued attacks on civilians in Ukraine with a strike targeting a passenger train station. Meanwhile, Moscow and Kyiv traded attacks on each other's energy infrastructure. DW has the latest. At least 30 Ukrainians were injured when a Russian dron…",
    "link": "https://www.dw.com/en/ukraine-updates-russia-hits-passenger-train-injures-dozens/live-74235600",
    "timestamp": "2025-10-04T11:45:00Z"
  },
  {
    "title": "America’s Toddler-in-Chief: When Personal Grievance Becomes National Policy",
    "description": "If someone treats us badly or hurts our feelings, we feel resentful. Such a response is a normal and hard-wired reaction to experiences of rejection, neglect, and criticism. Such resentment might be a passing feeling or it might endure over time. Despite bein…",
    "link": "https://www.commondreams.org/opinion/toddler-trump",
    "timestamp": "2025-10-04T11:42:06Z"
  },
  {
    "title": "‘He didn’t listen to you’: Trump torched for being openly defied in ceasefire demand",
    "description": "President Donald Trump is being torched online after being openly defied by Israeli leadership in his call Friday for the Middle Eastern nation to “immediately stop the bombing of Gaza\r\n,” with 20 Gazans killed\r\n in Israeli strikes over the past 12 hours acco…",
    "link": "https://www.rawstory.com/trump-2674154448/",
    "timestamp": "2025-10-04T11:39:24Z"
  },
  {
    "title": "House Democrat Hammers His Own Side for Government Shutdown, Blames 'Far-Left Groups'",
    "description": "\"The shutdown is hurting Americans and our economy, and the irony is it has only handed more power to the president.\"",
    "link": "https://www.westernjournal.com/house-democrat-hammers-side-government-shutdown-blames-far-left-groups/",
    "timestamp": "2025-10-04T11:38:50Z"
  },
  {
    "title": "4 Ways Your Holiday Shopping Could Be Affected If the US Has To Pay Back Tariffs",
    "description": "The U.S. may have to refund tariff money, which could put a stop to tariffs just in time for the holidays. But how could it impact your holiday shopping?",
    "link": "https://finance.yahoo.com/news/4-ways-holiday-shopping-could-113706494.html",
    "timestamp": "2025-10-04T11:37:06Z"
  },
  {
    "title": "Government Shutdown Prompts Concern Among Education Officials for Potential Impacts to Schools and Student Loans",
    "description": "Here's how the government shutdown can impact schools and student loans.",
    "link": "https://www.ibtimes.com/government-shutdown-prompts-concern-among-education-officials-potential-impacts-schools-student-3785586",
    "timestamp": "2025-10-04T11:34:55Z"
  },
  {
    "title": "“Be cool when you walk down”: Trump compliments the way Obama would “bop down the stairs” of Air Force One",
    "description": "While addressing military members in Quantico, Virginia, on Tuesday, President Donald Trump pivoted from praising troops to commenting on stair etiquette—and used Barack Obama as an example.\n\n\nIn his speech, Trump criticized President Biden’s physical stumble…",
    "link": "https://www.dailydot.com/viral-politics/trump-quantico-speech-obama-bop-down-the-stairs/",
    "timestamp": "2025-10-04T11:30:23Z"
  },
  {
    "title": "Canadians are staying away. U.S. tourism states are feeling it",
    "description": "Some Canadians say Donald Trump's behaviour is convincing them to spend their vacations elsewhere.",
    "link": "https://nationalpost.com/news/canada/canada-us-tourism",
    "timestamp": "2025-10-04T11:30:19Z"
  },
  {
    "title": "Netanyahu: Israel Prepares for “Immediate Implementation” of Trump Peace Plan After Hamas Signals Partial Agreement",
    "description": "Israel willing \"to end the war in accordance with the principles Israel has set that align with President Trump's vision,\" Prime Minister Netanyahu said.\nThe post Netanyahu: Israel Prepares for “Immediate Implementation” of Trump Peace Plan After Hamas Signal…",
    "link": "https://legalinsurrection.com/2025/10/netanyahu-israel-prepares-for-immediate-implementation-of-trump-peace-plan-after-hamas-signals-partial-agreement/",
    "timestamp": "2025-10-04T11:30:10Z"
  },
  {
    "title": "Hardline Hamas ally endorses Trump’s plan to end war as heavy airstrikes reported in Gaza",
    "description": "Palestinian Islamic Jihad, a hardline ally of Hamas that also holds hostages, on Saturday endorsed the group's response to a U.S. plan to end the war in Gaza, a move that could help pave the way for the release of Israelis still held by both parties.",
    "link": "https://www.independent.ie/world-news/middle-east/hardline-hamas-ally-endorses-trumps-plan-to-end-war-as-heavy-airstrikes-reported-in-gaza/a1192928529.html",
    "timestamp": "2025-10-04T11:30:06Z"
  },
  {
    "title": "EPA's job is to protect America's air, water and land. Here's how a shutdown affects that",
    "description": "During the shutdown, essential EPA staff will continue to work, but many functions will cease. That could lead to increased pollution risks and halted cleanup efforts.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_79dedb03-42b6-583e-9e62-f69d7c03bc85.html",
    "timestamp": "2025-10-04T11:30:00Z"
  },
  {
    "title": "Trump's trade agenda has a new flashpoint: The humble soybean",
    "description": "The humble soybean is the latest flashpoint in the Trump administration’s campaign to reshape global trade",
    "link": "https://www.nbcnews.com/business/economy/trump-trade-argentina-china-soybeans-rcna235257",
    "timestamp": "2025-10-04T11:30:00Z"
  },
  {
    "title": "Senior US senator wants to boost pressure on China over Taiwan",
    "description": "WASHINGTON (Reuters) -The chairman of the U.S. Senate Foreign Relations Committee said on Friday he will introduce legislation to deter aggression against...",
    "link": "https://www.yahoo.com/news/articles/senior-us-senator-wants-boost-112709051.html",
    "timestamp": "2025-10-04T11:27:09Z"
  },
  {
    "title": "Treasury Unveils Draft Designs For Trump Dollar Coin Ahead Of Nation's 250th Anniversary",
    "description": "The coin, which is being produced under the Circulating Collectible Coin Redesign Act of 2020, will mark the semiquincentennial of the signing of the Declaration of Independence.",
    "link": "https://www.ibtimes.com/treasury-unveils-draft-designs-trump-dollar-coin-ahead-nations-250th-anniversary-3785547",
    "timestamp": "2025-10-04T11:24:38Z"
  },
  {
    "title": "Judge temporarily blocks Trump’s National Guard deployment in Portland | CNN",
    "description": "A federal judge in Oregon has granted a temporary restraining order blocking the Trump administration from deploying the National Guard into Portland.",
    "link": "https://www.cnn.com/2025/10/04/us/what-we-know-portland-chicago-national-guard-deployments",
    "timestamp": "2025-10-04T11:21:36Z"
  },
  {
    "title": "Tycoon who is cousin of former President George W. Bush expected to launch run for Maine governor",
    "description": "Bush, assuming he runs as a Republican, is not likely to align himself with the MAGA movement, as he has called President Donald Trump 'personally troubled'. And in December 2023, he donated $50,000 to a super PAC that was in support of Nikki Haley, Trump's m…",
    "link": "https://freerepublic.com/focus/f-news/4344271/posts",
    "timestamp": "2025-10-04T11:20:48Z"
  },
  {
    "title": "Trump’s $2,000 Tariff ‘Dividend’ Stimulus Check Idea Could Be About To Blow Up The Bitcoin Price, Crypto And Stock Market",
    "description": "U.S. president Donald Trump has floated the idea of a $2,000 Covid stimulus check-style tariff dividend that could trigger a bitcoin price, crypto and stock market surge...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/10/04/trumps-2000-tariff-dividend-stimulus-check-idea-could-be-about-to-blow-up-the-bitcoin-price-crypto-and-stock-market/",
    "timestamp": "2025-10-04T11:15:01Z"
  },
  {
    "title": "Supreme Court’s emergency docket delivers Trump string of wins as final tests loom",
    "description": "President Donald Trump has won a string of cases on the Supreme Court's emergency docket this year, but many of these temporary victories will face full merit reviews.",
    "link": "https://www.foxnews.com/politics/supreme-courts-emergency-docket-delivers-trump-string-wins-final-tests-loom",
    "timestamp": "2025-10-04T11:00:31Z"
  },
  {
    "title": "Trump Can't Stop Using This 1 Word — Here's What It Says About Him",
    "description": "This one small word the president likes to use offers a key window into his worldview.",
    "link": "https://www.huffpost.com/entry/trumps-favorite-insult-reveals-more-than-he-might-realize-goog_n_68de92fce4b0614822240a3c",
    "timestamp": "2025-10-04T11:00:18Z"
  },
  {
    "title": "Israel’s army says it will advance preparations for first phase of Trump’s plan",
    "description": "The army said it was instructed by Israel’s leaders to ‘advance readiness’ for the implementation of the plan.",
    "link": "https://www.thejournal.ie/israel-hamas-trump-peace-plan-6835089-Oct2025/",
    "timestamp": "2025-10-04T11:00:16Z"
  },
  {
    "title": "Trump’s week in review: Shutdown showdowns and armed cartel conflict",
    "description": "Trump gives Hamas until Sunday for Gaza peace deal while meeting with military leaders and also declaring U.S. in armed conflict with drug cartels this week.",
    "link": "https://www.foxnews.com/politics/trumps-week-review-shutdown-showdowns-armed-cartel-conflict",
    "timestamp": "2025-10-04T11:00:15Z"
  },
  {
    "title": "Conservatives Call for More Action Against SPLC After FBI Formally Cuts It Off",
    "description": "Conservative legislators praised the FBI under Kash Patel for formally distancing itself from the Southern Poverty Law Center, and some called on the federal government... Read More\nThe post Conservatives Call for More Action Against SPLC After FBI Formally C…",
    "link": "https://www.dailysignal.com/2025/10/04/conservatives-call-more-action-against-splc-after-fbi-formally-cuts-it-off/",
    "timestamp": "2025-10-04T11:00:00Z"
  },
  {
    "title": "The Democrats Must Regain the Working-Class Vote in 2026",
    "description": "With the Trump administration gradually altering the form of US government from a “flawed democracy” to an emerging dictatorship, the 2026 general midterm election becomes especially important for the future of the country. And for the future of the Democrati…",
    "link": "https://www.commondreams.org/opinion/dems-working-class-2026",
    "timestamp": "2025-10-04T10:56:06Z"
  },
  {
    "title": "Links 10/4/2025",
    "description": "Our bubbly daily links: herring farts, Antartic ice loss, Trump declares war, rupee at new low, Hamaspartial acceptance of peace plan, Canada debt, EU manufacturing shinks, Trump coin, farmer tariff bailout, TikTok to heart Israell, AI power shortage, moar Ch…",
    "link": "https://www.nakedcapitalism.com/2025/10/links-10-4-2025.html",
    "timestamp": "2025-10-04T10:55:56Z"
  },
  {
    "title": "Finnish Foreign Minister: Hamas announcement \"very positive\"",
    "description": "Foreign Minister Elina Valtonen (NCP) welcomed US moves to end the war in Gaza. According to a Middle East expert at Finnish Institute of International Affairs, \"Hamas has played its cards and the game is over\".",
    "link": "https://yle.fi/a/74-20186659",
    "timestamp": "2025-10-04T10:49:53Z"
  },
  {
    "title": "Donald Trump believes he has a license to kill",
    "description": "After saying the U.S. is at war, POTUS takes out another Venezuelan boat",
    "link": "https://www.salon.com/2025/10/04/donald-trump-believes-he-has-a-license-to-kill/",
    "timestamp": "2025-10-04T10:45:05Z"
  },
  {
    "title": "Did Trump's crime crackdown in Washington work? It's complicated",
    "description": "President Trump declared victory over crime in Washington D.C. after deploying federal forces, but experts question the lasting impact. While gun offenses decreased, overall violent crime remained largely unchanged. Data suggests crime was already declining b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-trumps-crime-crackdown-in-washington-work-its-complicated/articleshow/124306366.cms",
    "timestamp": "2025-10-04T10:44:54Z"
  },
  {
    "title": "Abbas signals readiness for Gaza talks with Trump",
    "description": "Palestinian President Mahmoud Abbas on Saturday welcomed United States President Donald Trump's plan to end the war in Gaza and begin detailed negotiations.\nIn a statement shared by Wafa news age...",
    "link": "https://biztoc.com/x/f73bd813a09c5fe8",
    "timestamp": "2025-10-04T10:41:20Z"
  },
  {
    "title": "Reaction after Trump calls for end to bombing in Gaza",
    "description": "Donald Trump has called for Israel to halt its bombing of Gaza after Hamas said it was ready to release hostages and agreed to some aspects of the U.S...",
    "link": "https://www.yahoo.com/news/articles/reaction-trump-calls-end-bombing-103604574.html",
    "timestamp": "2025-10-04T10:36:04Z"
  },
  {
    "title": "Israeli airstrikes claim more lives in Gaza hours after Trump tells Israel to ‘immediately’ stop bombing",
    "description": "Gaza City’s Baptist hospital reported casualties from a strike on a home in the Tuffah neighbourhood, including four dead and several wounded, while Nasser hospital in Khan Younis said two children were killed and eight others wounded in a drone strike on a c…",
    "link": "https://indianexpress.com/article/world/israeli-airstrikes-gaza-hours-trump-israel-immediately-stop-bombing-10287412/",
    "timestamp": "2025-10-04T10:32:23Z"
  },
  {
    "title": "Green Party membership overtakes Liberal Democrats under new leader",
    "description": "Around 20,000 people have joined the Green Party in the past few months, and new leader Zack Polanski says he has \"undoubtedly\" had a role in this success.",
    "link": "https://news.sky.com/story/green-party-membership-overtakes-liberal-democrats-under-polanski-13444030",
    "timestamp": "2025-10-04T10:31:00Z"
  },
  {
    "title": "Right-wing Sanae Takaichi set to be Japan's first female premier",
    "description": "TOKYO (Reuters) -Japan's ruling party picked hardline conservative Sanae Takaichi as its head on Saturday, putting her on course to become the country's...",
    "link": "https://www.yahoo.com/news/articles/wing-sanae-takaichi-set-japans-103024867.html",
    "timestamp": "2025-10-04T10:30:24Z"
  },
  {
    "title": "Fact Check: Is A $1702 Stimulus Payment Actually Coming For Everyone This October?",
    "description": "Rumors of a $1,702 stimulus check for Americans have circulated, but you must live in a very specific area in order to qualify for the payment.",
    "link": "https://www.moneydigest.com/1985812/fact-check-1702-stimulus-payment-coming-october/",
    "timestamp": "2025-10-04T10:30:00Z"
  },
  {
    "title": "Trump freezes $2.1B for Chicago transit projects in latest ‘punishment’ of blue states",
    "description": "Federal budget director Russ Vought announced on social media that the money has been put on hold “to ensure funding is not flowing via race-based contracting.”",
    "link": "https://www.stltoday.com/news/local/government-politics/article_f02d1568-a2c4-4048-876f-63eb4b1119d2.html",
    "timestamp": "2025-10-04T10:30:00Z"
  },
  {
    "title": "Centrist Republicans warn against Trump's partisan shutdown strategy",
    "description": "WASHINGTON (Reuters) -President Donald Trump's freezing of funds for Democratic-led states has raised concerns among some centrist Republicans in the U.S. Congress, who worry that leaning into these divisions could make it harder to end an ongoing government …",
    "link": "https://www.thestar.com.my/news/world/2025/10/04/centrist-republicans-warn-against-trump039s-partisan-shutdown-strategy",
    "timestamp": "2025-10-04T10:25:00Z"
  },
  {
    "title": "Trump says the U.S. can grow its way out of $37 trillion in debt. Ray Dalio’s debt-cycle research says not so fast",
    "description": "President Donald Trump’s assertion that U.S. growth can tame debt echoes what Ray Dalio has called the most dangerous phase of a debt cycle: when leaders mistake prosperity for immunity.In an interview with One America News on Thursday, Trump pointed to his “…",
    "link": "https://biztoc.com/x/e799d2f1d4d358c1",
    "timestamp": "2025-10-04T10:18:51Z"
  },
  {
    "title": "US officials deny rumors of troops returning to Afghanistan, reject claims on Bagram airbase",
    "description": "US officials have debunked widespread rumours of American troops returning to Afghanistan or regaining control of Bagram airbase, calling them \"entirely baseless.\" This denial follows social media speculation and former President Trump's threats demanding Bag…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-officials-deny-rumors-of-troops-returning-to-afghanistan-reject-claims-on-bagram-airbase/articleshow/124306058.cms",
    "timestamp": "2025-10-04T10:18:33Z"
  },
  {
    "title": "Israel says Gaza City still a ‘combat zone’ after Trump says ‘stop bombing’",
    "description": "The Israeli army repeats threat to Palestinians to leave northern Gaza to the south and not to return to Gaza City.",
    "link": "https://www.aljazeera.com/news/2025/10/4/israel-says-gaza-city-still-a-combat-zone-after-trump-says-stop-bombing",
    "timestamp": "2025-10-04T10:18:31Z"
  },
  {
    "title": "Japan's ruling party elects Sanae Takaichi as leader, likely to become first female PM",
    "description": "Japan's governing party on Saturday elected Sanae Takaichi, a hard-line ultra-conservative and China hawk, as its new leader, making her likely to become the country's first female prime minister.",
    "link": "https://www.npr.org/2025/10/04/g-s1-92073/japans-sanae-takaichi-likely-to-become-first-female-pm",
    "timestamp": "2025-10-04T10:17:39Z"
  },
  {
    "title": "Analysis-Did Trump’s crime crackdown in Washington work? It’s complicated",
    "description": "WASHINGTON, October 4 (Reuters) -After mobilizing hundreds of federal agents and thousands of soldiers to the nation's capital, President Donald Trump has declared victory over what he called a \"crisis\" of crime in Washington, and floated the idea of using su…",
    "link": "https://www.thestar.com.my/news/world/2025/10/04/analysis-did-trumps-crime-crackdown-in-washington-work-its-complicated",
    "timestamp": "2025-10-04T10:17:00Z"
  },
  {
    "title": "Centrist Republicans warn against Trump's partisan shutdown strategy",
    "description": "WASHINGTON (Reuters) -President Donald Trump's freezing of funds for Democratic-led states has raised concerns among some centrist Republicans in the U.S...",
    "link": "https://www.yahoo.com/news/articles/centrist-republicans-warn-against-trumps-101658977.html",
    "timestamp": "2025-10-04T10:16:58Z"
  },
  {
    "title": "US Border Patrol raid sweeps in citizens, families as Chicago crackdown intensifies",
    "description": "CHICAGO (Reuters) -U.S. Border Patrol agents deployed to Chicago led a late-night raid on an apartment building this week, rappelling from helicopters onto rooftops and breaking down doors in an operation authorities said targeted gang members but which swept…",
    "link": "https://www.thestar.com.my/news/world/2025/10/04/us-border-patrol-raid-sweeps-in-citizens-families-as-chicago-crackdown-intensifies",
    "timestamp": "2025-10-04T10:11:00Z"
  },
  {
    "title": "Funding for 6 Hawaii energy projects terminated | Honolulu Star-Advertiser",
    "description": "At least $67 million in federal funding for six Hawaii energy projects appears to have been pulled by the Trump administration over qualms about worthiness.",
    "link": "https://www.staradvertiser.com/2025/10/04/hawaii-news/funding-for-6-hawaii-energy-projects-terminated/",
    "timestamp": "2025-10-04T10:08:49Z"
  }
]