[
  {
    "title": "In Trump’s Immigration Crackdown, Schools Are Just Collateral Damage",
    "description": "How do teachers reassure their students when armed men really are out to get them and their families?",
    "link": "https://www.huffpost.com/entry/ice-wreaking-havoc-minnesota-schools_n_6973dd0be4b0bae0f7817757",
    "timestamp": "2026-01-23T21:37:42Z"
  },
  {
    "title": "Trump announces outlines of health care plan he wants Congress to consider",
    "description": "President Donald Trump on Thursday announced the outlines of a health care plan he wants Congress to take up as Republicans have faced increasing pressure to address rising health costs",
    "link": "https://www.cherokeephoenix.org/news/trump-announces-outlines-of-health-care-plan-he-wants-congress-to-consider/article_fb1c0ebf-862a-44bd-a7cc-678d784ff9ca.html",
    "timestamp": "2026-01-23T21:37:06Z"
  },
  {
    "title": "Inside the '60 Minutes' Bloodbath — New CBS Boss Bari Weiss Eyes Axing Two Correspondents After They Question Her Leadership",
    "description": "The new editor-in-chief has already cleaned house of many CBS employees who dared to challenge her.",
    "link": "https://radaronline.com/p/60-minutes-cbs-boss-bari-weiss-fire-scott-pelley-sharyn-alfonsi/",
    "timestamp": "2026-01-23T21:36:58Z"
  },
  {
    "title": "Prince Harry says British troops deserve 'respect' after Trump's NATO comments",
    "description": "'I served there. I made lifelong friends there. And I lost friends there. The United Kingdom alone had 457 service personnel killed'Prince Harry, who served in Afghanistan, has released a statement in response to Donald Trump's remarks that Nato soldiers - in…",
    "link": "https://ohnotheydidnt.livejournal.com/131813804.html",
    "timestamp": "2026-01-23T21:35:30Z"
  },
  {
    "title": "‘People are mad’: First-ever parking fees at San Diego’s Balboa Park draw anger",
    "description": "San Diego’s new paid parking at Balboa Park has sparked widespread backlash as museum visits dropped and residents complained about the additional cost to access one of the city’s most iconic spaces.",
    "link": "https://www.kpbs.org/news/politics/2026/01/23/people-are-mad-first-ever-parking-fees-at-san-diegos-balboa-park-draw-anger",
    "timestamp": "2026-01-23T21:34:48Z"
  },
  {
    "title": "‘BE VIGILANT’: Assistant Health Secretary Warns What Can Happen if Pro-Lifers Don’t Vote",
    "description": "Assistant Secretary for Health and Human Services Brian Christine warned that the administration’s pro-life wins can be lost if pro-lifers don’t vote in November. “We... Read More\nThe post ‘BE VIGILANT’: Assistant Health Secretary Warns What Can Happen if Pro…",
    "link": "https://www.dailysignal.com/2026/01/23/be-vigilant-assistant-health-secretary-warns-what-can-happen-if-pro-lifers-dont-vote/",
    "timestamp": "2026-01-23T21:33:00Z"
  },
  {
    "title": "‘CBS Evening News’ has largest audience in years despite liberal complaints",
    "description": "Major milestone for network comes 3 months after Bari Weiss took over as editor-in-chief",
    "link": "https://www.wnd.com/2026/01/cbs-evening-news-has-largest-audience-years-despite/",
    "timestamp": "2026-01-23T21:31:24Z"
  },
  {
    "title": "Donald Trump's Latest Tweet Basically Proves He Has No Idea How Global Warming Works",
    "description": "\"BREAKING: Trump is an imbecile...\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/meganeliscomb/trump-global-warming-winter-storms",
    "timestamp": "2026-01-23T21:29:07Z"
  },
  {
    "title": "Friday, January 23. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Zelenskyy and Ukraine at the WEF in Davos",
    "link": "https://www.forbes.com/sites/katyasoldak/2026/01/23/friday-january-23-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2026-01-23T21:27:34Z"
  },
  {
    "title": "Airlines canceling flights to Middle East amid Iran tensions...",
    "description": "Airlines canceling flights to Middle East amid Iran tensions...\r\n\n \n \n \n (Third column, 1st story, link)",
    "link": "https://www.i24news.tv/en/news/middle-east/artc-slew-of-international-airlines-canceling-flights-to-middle-east-destinations-including-israel-amid-iran-tensions",
    "timestamp": "2026-01-23T21:25:43Z"
  },
  {
    "title": "This heinous Trump abuse won't topple its targets — but the real point is much scarier",
    "description": "Earlier this week, President Donald Trump’s corrupt and lawless Justice Department served grand jury subpoenas on Minnesota Gov. Tim Walz, State Attorney Gen. Keith Ellison, Minneapolis Mayor Jacob Frey, St. Paul Mayor Kaohly Her and two county administrators…",
    "link": "https://www.rawstory.com/trump-minnesota-2675005616/",
    "timestamp": "2026-01-23T21:24:18Z"
  },
  {
    "title": "5 Left-Wing Deceptions That Shaped The Trump Border Agenda Debate",
    "description": "Democrats are making sure the narrative surrounding the Trump administration's deportation policies is confusing and completely negative.",
    "link": "https://dailycaller.com/2026/01/23/democrats-trump-deportations-media-misinformation-ice-dhs-illegal-immigration-5-year-old-boy-false/",
    "timestamp": "2026-01-23T21:21:39Z"
  },
  {
    "title": "Trump pushes ‘Trump-a-palooza’ midterm convention as GOP braces for tough elections",
    "description": "Republicans make history as the RNC greenlights a first-ever midterm convention to boost Trump and GOP candidates ahead of crucial 2024 presidential elections.",
    "link": "https://www.foxnews.com/politics/trump-pushes-trump-a-palooza-midterm-convention-gop-braces-tough-elections",
    "timestamp": "2026-01-23T21:16:51Z"
  },
  {
    "title": "Trans youth still have a safe haven in California — but that could change",
    "description": "Lawsuits and Trump administration policy changes are targeting trans athletes, bans on outing by school staff and health care. Some California policies are in jeopardy.",
    "link": "https://www.kpbs.org/news/quality-of-life/2026/01/23/trans-youth-still-have-a-safe-haven-in-california-but-that-could-change",
    "timestamp": "2026-01-23T21:13:19Z"
  },
  {
    "title": "Prince Harry Rebukes Trump on Allies' Sacrifice",
    "description": "The UK's Prince Harry joined the outraged response on Friday to President Trump's contention that US allies largely hung back during the fighting in Afghanistan after 9/11. Harry, who did two tours in Afghanistan while serving in the British army, said in a s…",
    "link": "https://www.newser.com/story/382502/prince-harry-rebukes-trump-on-allies-sacrifice.html",
    "timestamp": "2026-01-23T21:13:00Z"
  },
  {
    "title": "Merz, Meloni question Trump’s Peace Board but keep door open to talks",
    "description": "Germany and Italy say Trump’s Peace Board must change before they can join, while Spain declines outright.",
    "link": "https://www.israelnationalnews.com/news/421384",
    "timestamp": "2026-01-23T21:08:14Z"
  },
  {
    "title": "UK’s Starmer slams Trump over ‘insulting’ Afghanistan comments",
    "description": "Trump's comments on NATO allies unlikely to smooth relations as tensions linger after Greenland tariff threats.",
    "link": "https://www.aljazeera.com/news/2026/1/23/frankly-appalling-uks-starmer-slams-trump-over-afghanistan-comments",
    "timestamp": "2026-01-23T21:08:08Z"
  },
  {
    "title": "Trump Tells Europe To Put Its Big Boy Pants On",
    "description": "The Trump administration’s blunt approach may be precisely what Europe needs.",
    "link": "https://dailycaller.com/2026/01/23/donald-trump-howard-lutnick-europe-world-economic-forum-defense-davos/",
    "timestamp": "2026-01-23T21:07:10Z"
  },
  {
    "title": "Trump Delivers Message to March for Life: 'Every Child Is a Gift from God'",
    "description": "WASHINGTON—President Donald Trump delivered a video message to those participating in the 53rd March for Life, declaring, \"The work to rebuild a culture that supports life continues.\"\nThe post Trump Delivers Message to March for Life: ‘Every Child Is a Gift f…",
    "link": "https://www.breitbart.com/politics/2026/01/23/trump-delivers-message-to-march-for-life-every-child-is-a-gift-from-god/",
    "timestamp": "2026-01-23T21:03:34Z"
  },
  {
    "title": "Trump cancels Puerto Rico solar project designed to help 30,000 low-income families in rural areas",
    "description": "Javier Rúa Jovet, public policy director for Puerto Rico’s Solar and Energy Storage Association, disputed the Trump rationale for the move.",
    "link": "https://fortune.com/2026/01/23/trump-cancels-puerto-rico-solar-project-low-income-rural-areas/",
    "timestamp": "2026-01-23T21:01:27Z"
  },
  {
    "title": "‘Massive fleet’ heading to Iran – Trump",
    "description": "US President Donald Trump has issued new threats to use military force against Iran Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631438-iran-trump-massive-fleet/",
    "timestamp": "2026-01-23T21:01:04Z"
  },
  {
    "title": "Bitcoin’s latest price dip is not a full bear market signal… yet – Here’s why",
    "description": "Bitcoin's market is in a very tricky position right now.",
    "link": "https://ambcrypto.com/bitcoins-latest-price-dip-is-not-a-full-bear-market-signal-yet-heres-why/",
    "timestamp": "2026-01-23T21:00:32Z"
  },
  {
    "title": "Trump stuns Democrats with unexpected outreach on housing and cost-of-living crisis",
    "description": "Donald Trump has quietly reached out to top Democratic senators Elizabeth Warren and Chuck Schumer to discuss the affordability crisis, a move Politico described as a striking and unexpected shift for a president with a long record of scorched-earth politics.…",
    "link": "https://www.rawstory.com/interest-rates-2675008830/",
    "timestamp": "2026-01-23T21:00:03Z"
  },
  {
    "title": "Dana White: UFC White House cost will be enormous",
    "description": "UFC White House is unlike anything Dana White has worked on before",
    "link": "https://www.mmafighting.com/ufc/467416/dana-white-sphere-is-chump-change-compared-to-ufc-white-house-cost",
    "timestamp": "2026-01-23T21:00:00Z"
  },
  {
    "title": "Tories claim government in retreat on Chagos Islands 'surrender'",
    "description": "Senior Tories claim the government is in retreat on its controversial Chagos Islands handover, after the latest showdown in parliament was unexpectedly postponed.",
    "link": "https://news.sky.com/story/tories-claim-government-in-retreat-on-chagos-surrender-after-donald-trump-broadside-13498208",
    "timestamp": "2026-01-23T20:58:00Z"
  },
  {
    "title": "Tucker on What the Violent ICE Protests Are Really About and What It Means for White America",
    "description": "Tucker on What the Violent ICE Protests Are Really About and What It Means for White America The Replacement is here and front and center. I know there are people here who dislike him. However there is a lot of truth here about the upcoming White genocide. I …",
    "link": "https://freerepublic.com/focus/f-bloggers/4363632/posts",
    "timestamp": "2026-01-23T20:57:45Z"
  },
  {
    "title": "IMF chief sees global GDP growth as ‘beautiful but not enough’ to handle ‘the debt that is hanging around our necks’",
    "description": "Governments need to take care of “those who are falling off the wagon,\" Kristalina Georgieva said on a panel discussion in Davos.",
    "link": "https://fortune.com/2026/01/23/global-growth-beautiful-but-not-enough-imf-chief-georgieva-debt-hanging-around-our-necks/",
    "timestamp": "2026-01-23T20:57:21Z"
  },
  {
    "title": "‘CBS Evening News’ Rakes In Higher Ratings Despite Liberals Moaning",
    "description": "\"CBS Evening News\" achieved its largest audience since 2021 on Monday, marking a major victory for the network's editor-in-chief, Bari Weiss.",
    "link": "https://dailycaller.com/2026/01/23/cbs-evening-news-record-high-ratings-liberals/",
    "timestamp": "2026-01-23T20:55:21Z"
  },
  {
    "title": "Vance Says 'Affordability Crisis' Is Real But It's Biden's Fault",
    "description": "He claimed the country was \"on the cusp of the greatest economic year\" in its history.",
    "link": "https://littlethings.com/entertainment/vance-affordability-crisis-bidens-fault",
    "timestamp": "2026-01-23T20:54:02Z"
  },
  {
    "title": "TikTok finalizes deal to form new American entity",
    "description": "TikTok has finalized a deal to create a new American entity, avoiding the looming threat of a ban in the United States that has been in discussion for years. The social video platform company signed agreements with major investors including Oracle, Silver Lak…",
    "link": "https://japantoday.com/category/tech/tiktok-finalizes-deal-to-form-new-american-version-of-the-app",
    "timestamp": "2026-01-23T20:53:54Z"
  },
  {
    "title": "Oregon marijuana prices remain depressed, but industry hopes lower taxes will give it a lift",
    "description": "There’s no sign of the market turning around. But even if revenues don’t grow, marijuana businesses may get smaller tax bills.",
    "link": "https://www.oregonlive.com/business/2026/01/oregon-marijuana-prices-remain-depressed-but-industry-hopes-lower-taxes-will-give-it-a-lift.html",
    "timestamp": "2026-01-23T20:53:35Z"
  },
  {
    "title": "‘Daily Show’ Says Trump’s $1.4 Billion Fortune Makes George Washington Look Stupid and Poor | Video",
    "description": "\"You should have had them molars iced out,\" host Josh Johnson jokes of the nation's first president \nThe post ‘Daily Show’ Says Trump’s $1.4 Billion Fortune Makes George Washington Look Stupid and Poor | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/daily-show-mocks-trump-fortune-comedy-central/",
    "timestamp": "2026-01-23T20:53:27Z"
  },
  {
    "title": "Reporter's Notebook: Clinton contempt vote gains steam as Democrats join GOP in Epstein probe standoff",
    "description": "House committee refers Bill and Hillary Clinton for contempt of Congress charges for allegedly failing to comply with Epstein investigation subpoenas.",
    "link": "https://www.foxnews.com/politics/reporters-notebook-clinton-contempt-vote-gains-steam-democrats-join-gop-epstein-probe-standoff",
    "timestamp": "2026-01-23T20:53:19Z"
  },
  {
    "title": "Kennedy Center Scrambles After Grammy Winner Cancels Appearances",
    "description": "The Kennedy Center is scrambling to find a replacement for a pair of shows after the Grammy-winning soprano Renée Fleming canceled her appearances. Those...",
    "link": "https://www.thedailybeast.com/kennedy-center-scrambles-after-grammy-winner-renee-fleming-cancels-appearances/",
    "timestamp": "2026-01-23T20:52:41Z"
  },
  {
    "title": "The News Roundup For January 23, 2026",
    "description": "ICE is continuing its Minnesota crackdown. This week, agents were reportedly <a href=\"https://www.theguardian.com/us-news/2026/jan/22/us-citizens-racial-profiling-ice\"target=\"_blank\"   >targeting members of the public based on race.</a> Now, state officials a…",
    "link": "https://www.npr.org/2026/01/23/nx-s1-5686479/the-news-roundup-for-january-23-2026",
    "timestamp": "2026-01-23T20:51:31Z"
  },
  {
    "title": "‘Hiding Behind a Screen Won’t Protect You’: Big Tech Helped Identify ICE Threat Suspects",
    "description": "Social media companies helped federal law enforcement identify two men this week who allegedly made online threats to kill Immigration and Customs Enforcement agents.  On... Read More\nThe post ‘Hiding Behind a Screen Won’t Protect You’: Big Tech Helped Identi…",
    "link": "https://www.dailysignal.com/2026/01/23/hiding-behind-a-screen-wont-protect-you-big-tech-helped-identify-ice-threat-suspects/",
    "timestamp": "2026-01-23T20:50:00Z"
  },
  {
    "title": "U.S. targets Iran's 'shadow fleet' over crackdown on protesters",
    "description": "The United States on Friday imposed sanctions on nine vessels of what is known as ‌the shadow fleet and eight related firms, the U.S. Treasury Department said, as the Trump administration sought to escalate pressure on Iran over the recent killing of proteste…",
    "link": "https://japantoday.com/category/world/us-targets-iran%27s-%27shadow-fleet%27-over-crackdown-on-protesters1",
    "timestamp": "2026-01-23T20:49:59Z"
  },
  {
    "title": "EU concerned about Trump 'concentration of powers' over 'Board of Peace', document says",
    "description": "The European Union’s foreign policy arm has raised questions about U.S. President Donald Trump’s broad powers over his new ‌Board of Peace, according to an internal document seen by Reuters. Trump has urged world leaders to join his Board of Peace initiative …",
    "link": "https://japantoday.com/category/world/eu-concerned-about-trump-%27concentration-of-powers%27-over-%27board-of-peace%27-document-says1",
    "timestamp": "2026-01-23T20:49:43Z"
  },
  {
    "title": "Minnesotans begin economic strike to protest Trump's surge in immigration agents",
    "description": "Scores of businesses across Minnesota were closing up for the day on Friday in what religious leaders and labor unions describe as a general strike to protest U.S. President ‌Donald Trump's deployment of thousands of immigration enforcement officers on the st…",
    "link": "https://japantoday.com/category/world/minnesotans-begin-economic-strike-to-protest-trump%27s-surge-in-immigration-agents1",
    "timestamp": "2026-01-23T20:49:32Z"
  },
  {
    "title": "Russia, Ukraine sit for tense talks on thorny territorial issue",
    "description": "Ukrainian and Russian negotiators met in Abu Dhabi on Friday to tackle the vital issue of territory, with no sign of a compromise, as Russian airstrikes plunged Ukraine into its worst ‌energy crisis of the four-year war. Kyiv is under mounting U.S. pressure t…",
    "link": "https://japantoday.com/category/world/russia-ukraine-sit-for-tense-talks-on-thorny-territorial-issue1",
    "timestamp": "2026-01-23T20:49:23Z"
  },
  {
    "title": "UK's Starmer calls Trump's remarks on allies in Afghanistan 'frankly appalling'",
    "description": "British Prime Minister Keir Starmer called U.S. President Donald Trump's comments about European troops staying off the front lines in Afghanistan insulting and appalling, joining a chorus of criticism from ‌other European officials and veterans. &quot;I cons…",
    "link": "https://japantoday.com/category/world/uk%27s-starmer-calls-trump%27s-remarks-on-allies-in-afghanistan-%27frankly-appalling%271",
    "timestamp": "2026-01-23T20:49:15Z"
  },
  {
    "title": "Prime Minister Mark Carney to speak after cabinet retreat in Quebec City",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/mark-carney-cabinet-meeting-news-conference-live-updates-9.7058683",
    "timestamp": "2026-01-23T20:46:39Z"
  },
  {
    "title": "Erika Kirk Launches Tour Amid Protests, Ongoing Clothing Controversy",
    "description": "Reading Time: 3 minutesErika Kirk has embarked on a new 30-city tour. And as usual, she's attracting controversy.\nErika Kirk Launches Tour Amid Protests, Ongoing Clothing Controversy was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/01/erika-kirk-launches-tour-amid-protests-ongoing-clothing-controversy/",
    "timestamp": "2026-01-23T20:46:37Z"
  },
  {
    "title": "How We Build a Better System: Celebrating Ranked-Choice Voting Day",
    "description": "Weekend Reading for Women’s Representation is a compilation of stories about women’s representation in politics, sports and entertainment, judicial offices and the private sector—with a little gardening mixed in!\nThis week:\n—Friday marks is Ranked-Choice Voti…",
    "link": "https://msmagazine.com/2026/01/23/ranked-choice-voting-day-women/",
    "timestamp": "2026-01-23T20:46:12Z"
  },
  {
    "title": "Here's What Happened Today: Friday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/evening-fix-231-6936649-Jan2026/",
    "timestamp": "2026-01-23T20:46:11Z"
  },
  {
    "title": "Vance: Military buildup ensures options if Iran 'does something stupid'",
    "description": "US Vice President JD Vance says the US buildup in the Persian Gulf ensures Trump has options if Iran acts, stressing the need to protect American assets and personnel.",
    "link": "https://www.israelnationalnews.com/news/421383",
    "timestamp": "2026-01-23T20:43:14Z"
  },
  {
    "title": "The Irish Times view on Ireland and the US: old relationship will need to be redefined",
    "description": "Nostalgia for previous eras and US engagement with the peace process provides no contemporary comfort",
    "link": "https://www.irishtimes.com/opinion/editorials/2026/01/23/the-irish-times-view-on-ireland-and-the-us-old-relationship-will-need-to-be-redefined/",
    "timestamp": "2026-01-23T20:42:00Z"
  },
  {
    "title": "Trump’s Threats to Imprison Minnesota Democrats Are Doomed. That’s Not the Point.",
    "description": "While this effort is destined to fail, it still has the power to inflict long-term damage.",
    "link": "https://slate.com/news-and-politics/2026/01/trump-prosecution-minnesota-democrats-fail-frey-walz.html",
    "timestamp": "2026-01-23T20:41:36Z"
  },
  {
    "title": "The Israel-Iran Detente Won’t Last",
    "description": "The next round could be bigger and uglier than last year’s 12-day war.",
    "link": "http://foreignpolicy.com/2026/01/23/iran-israel-netanyahu-war-detente-nuclear-program-missiles/",
    "timestamp": "2026-01-23T20:39:49Z"
  },
  {
    "title": "Trump Administration Plans More Deportation Flights to Iran Amid Violent Crackdown in the Country",
    "description": "With thousands of people dead in Iran, the Trump administration still plans to go ahead with a deportation flight as early as this weekend.",
    "link": "https://reason.com/2026/01/23/the-trump-administration-plans-to-deport-iranians-amid-deadly-crackdown-in-iran/",
    "timestamp": "2026-01-23T20:39:00Z"
  },
  {
    "title": "Democrats Aren’t Doing Much to Stop ICE",
    "description": "Seven Democratic House members voted for a Department of Homeland Security funding bill, and Minority Leader Hakeem Jeffries did basically nothing to stop them.",
    "link": "https://www.esquire.com/news-politics/politics/a70113164/democrats-department-homeland-security-funding-bill/",
    "timestamp": "2026-01-23T20:39:00Z"
  },
  {
    "title": "JD Vance Tells Pro-Lifers Not to Lose Hope in Trump Admin, Details ‘Undoing Evils’ of Biden Presidency",
    "description": "Vice President JD Vance told thousands of pro-life advocates at the 53rd annual March for Life on Friday not to lose hope over the Trump administration's handling of abortion and detailed how they are \"undoing evils\" of the Biden administration.\nThe post JD V…",
    "link": "https://www.breitbart.com/politics/2026/01/23/jd-vance-tells-pro-lifers-not-to-lose-hope-in-trump-admin-details-undoing-evils-of-biden-presidency/",
    "timestamp": "2026-01-23T20:35:35Z"
  },
  {
    "title": "What in the World?",
    "description": "Test yourself on the week of Jan. 17: Trump threatens Europe, the World Economic Forum begins, and China’s demographic slide continues.",
    "link": "http://foreignpolicy.com/2026/01/23/foreign-policy-news-quiz-trump-europe-tariff-threat-world-economic-forum-china-demographics/",
    "timestamp": "2026-01-23T20:35:33Z"
  },
  {
    "title": "Trump privately frustrated that he risks losing control of immigration message amid Minnesota chaos | CNN Politics",
    "description": "The ongoing protests and images coming out of Minnesota have prompted concerns from some Trump administration officials over the optics of the immigration crackdown as Americans grow alarmed by the chaotic scenes unfolding in the state.",
    "link": "https://www.cnn.com/2026/01/23/politics/minnesota-immigration-protests-trump-worries",
    "timestamp": "2026-01-23T20:32:14Z"
  },
  {
    "title": "US considering total Cuba oil blockade – Politico",
    "description": "The US is reportedly weighing a full oil blockade on Cuba in order to topple its government this year Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631440-us-cuba-oil-blockade/",
    "timestamp": "2026-01-23T20:30:58Z"
  },
  {
    "title": "American Tennis Players Shut Down Insufferable “Reporter” Who Tried To Bait Them Into Condemning The United States At The Australian Open",
    "description": "We’re in the middle of the Australian Open right now, one of the 4 major tennis tournaments collectively known as the “grand slams,” and it didn’t take long for a press conference to turn into a circus down in Melbourne. Several American tennis stars are bein…",
    "link": "https://freerepublic.com/focus/f-chat/4363629/posts",
    "timestamp": "2026-01-23T20:30:31Z"
  },
  {
    "title": "American Tennis Players Shut Down Insufferable “Reporter” Who Tried To Bait Them Into Condemning The United States At The Australian Open",
    "description": "We’re in the middle of the Australian Open right now, one of the 4 major tennis tournaments collectively known as the “grand slams,” and it didn’t take long for a press conference to turn into a circus down in Melbourne. Several American tennis stars are bein…",
    "link": "https://freerepublic.com/focus/f-news/4363629/posts",
    "timestamp": "2026-01-23T20:30:31Z"
  },
  {
    "title": "Doctor Makes Concerning Claims About Donald Trump’s Cognitive Health, Says Symptoms Are Worsening - NewsBreak",
    "description": "There are fresh concerns about President Trump’s mental and physical health as a leading medical expert shared his opinion. Dr. Vin Gupta is a medical anal",
    "link": "https://www.newsbreak.com/share/4456605733611-doctor-makes-concerning-claims-about-donald-trump-s-cognitive-health-says-symptoms-are-worsening?s=a2&amp;share_destination_id=MjM0MDQ4ODgtMTc2OTIwMDE1NDE0MA%3D%3D&amp;pd=01aCgCa3&amp;hl=en_US&amp;send_time=1769200154&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.3.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-23T20:29:46Z"
  },
  {
    "title": "Economic leaders at Davos say global growth is resilient despite trade disruptions by Trump",
    "description": "Leading global economic policymakers at the World Economic Forum in Davos urged countries and businesses to filter out the turmoil from a week of clashes with the Trump administration and focus on boosting growth and fighting inequality in a world where trade…",
    "link": "https://www.pbs.org/newshour/economy/economic-leaders-at-davos-say-global-growth-is-resilient-despite-trade-disruptions-by-trump",
    "timestamp": "2026-01-23T20:29:34Z"
  },
  {
    "title": "Vance, lawmakers defend Trump’s abortion policies at March for Life",
    "description": "U.S. Vice President JD Vance speaks at the March for Life rally on Jan. 23, 2026, in Washington, D.C. | Credit: EWTN News/Screenshot\n\nJan 23, 2026 / 15:29 pm (CNA).\nVice President JD Vance and Republican lawmakers defended President Donald Trump’s abortion-re…",
    "link": "https://www.ewtnnews.com/world/us/jd-vance-headlines-march-for-life-2026",
    "timestamp": "2026-01-23T20:29:27Z"
  },
  {
    "title": "You don’t need to be a liberal to oppose Trump’s ICE",
    "description": "America’s immigration debate has often centered on the morality of mass deportation. Progressives have argued that exiling law-abiding families is inherently wrong — no matter their immigration status. Conservatives have insisted that vigorous internal enforc…",
    "link": "https://www.vox.com/politics/476263/trump-ice-minnesota-constitution-renee-good",
    "timestamp": "2026-01-23T20:29:19Z"
  },
  {
    "title": "Enraged Trump warns key ally will now be 'eaten up' by China after rebuffing him",
    "description": "President Donald Trump fired off a scathing post Friday on Truth Social, lambasting Canada for rejecting a proposed \"Golden Dome\" project over Greenland and cozying up to China instead.In the bombastic message, Trump claimed the dome would actually benefit Am…",
    "link": "https://www.rawstory.com/trump-canada-2675013368/",
    "timestamp": "2026-01-23T20:28:49Z"
  },
  {
    "title": "New Legal Documents Show Marco Rubio Targeted Students for Op-Eds and Protesting",
    "description": "Rubio accused students including Mahmoud Khalil of supporting terrorism, but records unsealed after litigation by The Intercept undermine his claims.\nThe post New Legal Documents Show Marco Rubio Targeted Students for Op-Eds and Protesting appeared first on T…",
    "link": "https://theintercept.com/2026/01/23/mahmoud-khalil-palestine-protest-rubio/",
    "timestamp": "2026-01-23T20:27:55Z"
  },
  {
    "title": "Trump Considering Naval Blockade on Cuban Oil Imports in Latest Push for Regime Change: Report",
    "description": "President Donald Trump is reportedly considering a naval blockade to restrict Cuban oil imports as part of his continued push for regime change.\nThe post Trump Considering Naval Blockade on Cuban Oil Imports in Latest Push for Regime Change: Report first appe…",
    "link": "https://www.mediaite.com/media/news/trump-considering-naval-blockade-on-cuban-oil-imports-in-latest-push-for-regime-change-report/",
    "timestamp": "2026-01-23T20:26:20Z"
  },
  {
    "title": "Did Barron Trump save woman's life in London as he watched her being attacked over FaceTime?",
    "description": "A U.K. court reportedly heard a recording of the U.S. president's youngest son telling an emergency operator he witnessed the attack.",
    "link": "https://www.snopes.com//news/2026/01/23/woman-barron-trump-london-facetime/",
    "timestamp": "2026-01-23T20:26:00Z"
  },
  {
    "title": "Europe to Remember Trump's Disrespect — WP Quotes Unnamed Leader",
    "description": "According to journalist Fareed Zakaria, the EU was relieved by Trump's backtracking on plans to take Greenland by forceWASHINGTON, January 23. /TASS/. Europe won't forget the disdain the administration of US President Donald Trump has shown it, The Washington…",
    "link": "https://freerepublic.com/focus/f-news/4363625/posts",
    "timestamp": "2026-01-23T20:25:10Z"
  },
  {
    "title": "Russia, Ukraine to discuss territory as Trump says both sides 'want to make a deal'",
    "description": "Abu Dhabi hosts trilateral meeting with the U.S., Ukraine and Russia in a possible sign that the nearly four-year war could be coming to an end.",
    "link": "https://www.foxnews.com/world/russia-ukraine-discuss-territory-trump-says-both-sides-want-make-deal",
    "timestamp": "2026-01-23T20:25:10Z"
  },
  {
    "title": "ICE Tells Legal Observer, 'We Have a Nice Little Database, and Now You're Considered a Domestic Terrorist'",
    "description": "The video is the latest example of federal immigration authorities labeling anyone who opposes them a \"domestic terrorist.\"",
    "link": "https://reason.com/2026/01/23/ice-tells-legal-observer-we-have-a-nice-little-database-and-now-youre-considered-a-domestic-terrorist/",
    "timestamp": "2026-01-23T20:23:57Z"
  },
  {
    "title": "Incompetence all the way down",
    "description": "As others have pointed out, one of the key differences between the first Trump administration and the current iteration is that in the first one, he was willing to appoint people who were acceptable to the Republican party establishment to key positions. Of c…",
    "link": "https://freethoughtblogs.com/singham/2026/01/23/incompetence-all-the-way-down/",
    "timestamp": "2026-01-23T20:21:36Z"
  },
  {
    "title": "The U.S. has ‘escalation dominance’ in a debt war: Europe would face a violent market crash if it dumps Treasuries",
    "description": "Europe accounts for about a third of U.S. government bonds held overseas, or roughly 10% of the overall Treasury market.",
    "link": "https://fortune.com/2026/01/23/us-debt-war-escalation-dominance-europe-treasury-bonds-weaponization/",
    "timestamp": "2026-01-23T20:20:10Z"
  },
  {
    "title": "Judge who blasted Trump as 'authoritarian' blocks US from deporting pro-Palestinian campus activists",
    "description": "U.S. District Judge William G. Young issues scathing criticism of Trump administration for allegedly targeting pro-Palestinian campus protesters unconstitutionally.",
    "link": "https://www.foxnews.com/politics/judge-who-blasted-trump-authoritarian-blocks-trump-from-deporting-non-citizes-pro-palestinian-activit",
    "timestamp": "2026-01-23T20:18:37Z"
  },
  {
    "title": "Trump’s ‘Board of Peace’ comes into confounding focus",
    "description": "What began as a plan to redevelop the Gaza Strip is quickly emerging as a new lever of global power for a president intent on upending the standing world order",
    "link": "https://theweek.com/politics/trump-board-of-peace-gaza-united-nations-world-order",
    "timestamp": "2026-01-23T20:16:56Z"
  },
  {
    "title": "Judge rules US Justice Department filed a lawsuit over Georgia voter data in the wrong city",
    "description": "A federal judge in Georgia on Friday dismissed a U.S. Justice Department lawsuit seeking voter information from the state, ruling the federal government had ...",
    "link": "https://www.yahoo.com/news/articles/judge-rules-us-justice-department-201644990.html",
    "timestamp": "2026-01-23T20:16:44Z"
  },
  {
    "title": "State Dept Memos Admit It Had Almost No Grounds to Deport Pro-Palestine Students",
    "description": "The memos were released by a judge who, last week, slammed Rubio, Noem, and Trump for “unconstitutional” actions.",
    "link": "https://truthout.org/articles/state-dept-memos-admit-it-had-almost-no-grounds-to-deport-pro-palestine-students/",
    "timestamp": "2026-01-23T20:13:56Z"
  },
  {
    "title": "Jamie Dimon is learning what happens when a CEO dares to defy Trump | CNN Business",
    "description": "Top Wall Street bankers during the Trump 2.0 era have tread carefully around the subject of politics generally and President Donald Trump specifically. The consensus has generally been: Smile and nod, stay in your lane, don’t become a target.",
    "link": "https://www.cnn.com/2026/01/23/business/jamie-dimon-donald-trump",
    "timestamp": "2026-01-23T20:13:31Z"
  },
  {
    "title": "Trump's cognitive decline 'getting worse' with President mirroring father's health - NewsBreak",
    "description": "NBC medical analyst Dr. Vin Gupta has warned that Donald Trump is showing a \"trend line\" in cognitive decline that \"seems to be getting worse\" after the pr",
    "link": "https://www.newsbreak.com/share/4456783930423-trump-s-cognitive-decline-getting-worse-with-president-mirroring-father-s-health?_f=app_share&amp;pd=04MO81JH&amp;lang=en_US&amp;send_time=1769199101&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.1.11%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-23T20:12:08Z"
  },
  {
    "title": "Whitewashing History",
    "description": "The Trump administraiton is making sure that you can’t learn about slavery: National Park Service staff on Thursday took down an exhibit on slavery at Independence National Historical Park in Philadelphia, which had been targeted last year by President Donald…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/whitewashing-history",
    "timestamp": "2026-01-23T20:10:00Z"
  },
  {
    "title": "Joe Rogan claims Trump using brutal ICE tactics to bury Epstein files 'on purpose'",
    "description": "Mega podcaster Joe Rogan speculated that President Donald Trump was using Immigration and Customs Enforcement tactics to drown out the coverage of the Department of Justice's refusal to comply with a law requiring the release of files related to sex offender …",
    "link": "https://www.rawstory.com/rogan-ice-drowns-out-epstein/",
    "timestamp": "2026-01-23T20:09:54Z"
  },
  {
    "title": "US completes withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization. Federal officials announced the completion Thursday. The decision follows President Donald Trump's announcement a year ago. The U.S. owes about $280 million to the WHO, and unresolved i…",
    "link": "https://www.kob.com/ap-top-news/us-completes-withdrawal-from-world-health-organization/",
    "timestamp": "2026-01-23T20:07:48Z"
  },
  {
    "title": "DJ Moby Says 'Trump Is Not America': 'Clearly Battling Frontotemporal Dementia'",
    "description": "Far-left DJ star Moby went on the attack against President Donald Trump ad claiming that he is \"battling\" mental health issues.\nThe post DJ Moby Says ‘Trump Is Not America’: ‘Clearly Battling Frontotemporal Dementia’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2026/01/23/dj-moby-says-trump-is-not-america-clearly-battling-frontotemporal-dementia/",
    "timestamp": "2026-01-23T20:07:24Z"
  },
  {
    "title": "Trump Comms Director Lewdly Posts Democratic Influencer Might Enjoy Being Spanked By Him",
    "description": "In a Thursday back-and-forth with Democratic influencer Harry Sisson, White House Communications Director Steven Cheung suggested that Sisson might like being spanked by him, posting on X that “he’s a sick freak.” Cheung’s initial jab was in response to a Thu…",
    "link": "https://www.mediaite.com/online/trump-comms-director-lewdly-posts-democratic-influencer-might-enjoy-being-spanked-by-him/",
    "timestamp": "2026-01-23T20:07:10Z"
  },
  {
    "title": "UBS Considers Offering Crypto Trading Through Private Bank",
    "description": "Swiss banking giant UBS reportedly plans to begin offering cryptocurrency trading in response to growing demand from wealthy clients. UBS has been considering partners for this push into crypto for months but has not yet made a decision, Bloomberg reported Fr…",
    "link": "https://www.pymnts.com/cryptocurrency/2026/ubs-considers-offering-crypto-trading-through-private-bank/",
    "timestamp": "2026-01-23T20:05:46Z"
  },
  {
    "title": "Trump envoys to visit Israel, press Netanyahu on Rafah opening",
    "description": "Trump’s envoys Steve Witkoff and Jared Kushner to arrive in Israel on Saturday and meet Netanyahu to discuss reopening the Rafah crossing and Gaza’s rehabilitation.",
    "link": "https://www.israelnationalnews.com/news/421381",
    "timestamp": "2026-01-23T20:02:12Z"
  },
  {
    "title": "Greenland not for sale – MP",
    "description": "Greenland’s people and sovereignty are “not for sale” and will not bow to a new “colonizer,” MP Kuno Fencker told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631425-fencker-greenland-sale-trump/",
    "timestamp": "2026-01-23T20:02:11Z"
  },
  {
    "title": "Yen volatile on rate check speculation, dollar set for sharp weekly drop",
    "description": "The yen suddenly strengthened ⁠on Friday, raising market speculation that authorities had conducted a rate check, often a precursor to intervention.",
    "link": "https://www.cnbc.com/2026/01/23/yen-volatile-as-rate-check-speculation-swirls-dollar-set-for-steep-weekly-drop.html",
    "timestamp": "2026-01-23T20:01:34Z"
  },
  {
    "title": "TikTok lands big wins in Canada and the U.S. a year after “going dark”",
    "description": "The popular video app will create a new \"U.S. TikTok,\" while its Canadian business will be allowed to continue operating. Find out more here",
    "link": "https://financialpost.com/technology/tiktok-lands-wins-in-canada-u-s",
    "timestamp": "2026-01-23T20:00:54Z"
  },
  {
    "title": "Philadelphia sues Trump administration over removal of slavery exhibit from public park",
    "description": "Outraged critics accused President Donald Trump of \"whitewashing history\" on Friday after the National Park Service removed an exhibit on slavery at Philadelphia's Independence National Historical Park in response to his executive order \"restoring truth and s…",
    "link": "https://www.pbs.org/newshour/politics/philadelphia-sues-trump-administration-over-removal-of-slavery-exhibit-from-public-park",
    "timestamp": "2026-01-23T20:00:45Z"
  },
  {
    "title": "Trump Rescinds Canada’s Invitation to the Board of Peace",
    "description": "Oh, Canada...\nThe post Trump Rescinds Canada’s Invitation to the Board of Peace first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/trump-rescinds-canadas-invitation-to-the-board-of-peace/",
    "timestamp": "2026-01-23T20:00:19Z"
  },
  {
    "title": "Weaker radiation limits will not help nuclear energy",
    "description": "Relaxing radiation safety standards could place women and children at higher risks of health issues",
    "link": "https://www.scientificamerican.com/article/weaker-radiation-limits-will-not-help-nuclear-energy/",
    "timestamp": "2026-01-23T20:00:00Z"
  },
  {
    "title": "Trump's remarks about NATO troops in Afghanistan 'insulting,' 'appalling,' says U.K.'s Starmer",
    "description": "British Prime Minister Keir Starmer has signalled that U.S. President Donald Trump should apologize for his false assertion that troops from non-U.S. NATO countries avoided the front line during the Afghanistan war, describing Trump's remarks as \"insulting\" a…",
    "link": "https://www.cbc.ca/news/world/starmer-trump-nato-afghanistan-9.7058277",
    "timestamp": "2026-01-23T19:59:00Z"
  },
  {
    "title": "'You cannot rewrite history': Minister blasts Trump's claims about allies in Afghanistan",
    "description": "Finance Minister François-Philippe Champagne pushed back against U.S. President Donald Trump's latest comments about America's allies in Afghanistan as an attempt to rewrite the history books.",
    "link": "https://www.cbc.ca/news/politics/trump-nato-allies-comments-afghanistan-9.7058277",
    "timestamp": "2026-01-23T19:59:00Z"
  },
  {
    "title": "Director Kash Patel Fires FBI Agents Linked to Lawfare Against Trump",
    "description": "FBI Director Kash Patel has purged his department of agents linked to the Biden administration’s efforts to jail the Democrat former president’s electoral foe, Donald Trump. Patel forced out field office leaders and other senior agents connected to the two cr…",
    "link": "https://freerepublic.com/focus/f-bloggers/4363622/posts",
    "timestamp": "2026-01-23T19:57:51Z"
  },
  {
    "title": "Trump rescinds Canada's invite to join his Board of Peace amid feud with Carney",
    "description": "President Trump rescinded an invitation for Canada to join his newly-formed \"Board of Peace\" amid an escalating feud with Prime Minister Mark Carney.",
    "link": "https://abcnews.go.com/Politics/trump-rescinds-canadas-invite-join-board-peace-amid/story?id=129493222",
    "timestamp": "2026-01-23T19:57:50Z"
  },
  {
    "title": "Philadelphia sues Trump administration for removing evidence of slavery from George Washington’s house",
    "description": "Crews removed the exhibit which included the names and other biographical details about the nine people enslaved by the Washingtons at the mansion.",
    "link": "https://fortune.com/2026/01/23/did-george-washington-own-slaves-philadelphia-museum-trump-removes-evidence/",
    "timestamp": "2026-01-23T19:56:38Z"
  }
]