[
  {
    "title": "Adani representatives meet Trump officials in push to end US bribery cases",
    "description": "Adani's representatives are trying to make the case that his prosecution does not align with Trump's priorities and should be reconsidered",
    "link": "https://www.thehindubusinessline.com/companies/adani-representatives-meet-trump-officials-in-push-to-end-us-bribery-cases/article69539928.ece",
    "timestamp": "2025-05-05T05:54:51Z"
  },
  {
    "title": "Eaton Fire Survivors Organize Protests Against State Farm 'Lowballing'",
    "description": "Survivors of the Eaton Fire in Altadena and Pasadena have organized protests against State Farm, the largest home insurer in the state, for allegedly \"lowballing\" estimates of damage.\nThe post Eaton Fire Survivors Organize Protests Against State Farm ‘Lowball…",
    "link": "https://www.breitbart.com/politics/2025/05/04/eaton-fire-survivors-organize-protest-against-state-farm-lowballing/",
    "timestamp": "2025-05-05T05:53:16Z"
  },
  {
    "title": "Asian currencies surge on weaker dollar, oil falls",
    "description": "Asian currencies advanced amid broad weakness in the dollar and US assets as investors awaited further progress on trade deals. Crude oil slumped 3.6% after OPEC+ agreed to a further surge in output.",
    "link": "https://www.bangkokpost.com/business/general/3018140/asian-currencies-surge-on-weaker-dollar-oil-falls",
    "timestamp": "2025-05-05T05:52:00Z"
  },
  {
    "title": "Trump says he will lower tariffs on China ‘at some point’",
    "description": "President Donald Trump says tariffs on Chinese imports to the United States will eventually be lowered, after both Beijing and Washington appeared to soften their positions about potential trade talks.\n“At some point, I’m going to lower them because otherwise…",
    "link": "https://biztoc.com/x/ae4300048331d469",
    "timestamp": "2025-05-05T05:50:45Z"
  },
  {
    "title": "Peter Schiff Says Trump's 100% Tariff On Foreign Films 'Pointless,' Warns Netflix Subscribers Would Bear Cost",
    "description": "Economist Peter Schiff criticized President Donald Trump‘s proposed 100% tariff on foreign-produced movies, questioning its implementation and suggesting that Netflix Inc. (NASDAQ:NFLX) subscribers would ultimately bear the cost.\nWhat Happened: “Today Trump a…",
    "link": "https://biztoc.com/x/09de10385703ed63",
    "timestamp": "2025-05-05T05:50:38Z"
  },
  {
    "title": "Houthis report US strikes after Israel vows revenge for airport attack",
    "description": "Yemen's Houthi rebels on Monday blamed Washington for around 10 strikes in and around the capital Sanaa after a missile fired by the Iran-backed group struck the area of Israel's main airport.",
    "link": "https://www.hurriyetdailynews.com/houthis-report-us-strikes-after-israel-vows-revenge-for-airport-attack-208795",
    "timestamp": "2025-05-05T05:47:02Z"
  },
  {
    "title": "Trump says ordering ‘100% tariff’ on all movies produced abroad",
    "description": "US President Donald Trump said Sunday he was ordering new tariffs on all films made outside the United States, claiming Hollywood was being “devastated” by a trend of US filmmakers and studios working abroad. The announcement comes as the White House is comin…",
    "link": "https://www.digitaljournal.com/entertainment/trump-says-ordering-100-tariff-on-all-movies-produced-abroad/article",
    "timestamp": "2025-05-05T05:45:12Z"
  },
  {
    "title": "US warplanes carry out 35 strikes across Yemen since early Sunday",
    "description": "US warplanes have carried out dozens of strikes across Yemen as the nation's military forces escalate their operations and naval blockade in response to foreign aggression while continuing their steadfast support for Palestinians in the besieged Gaza Strip. U…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250504-presstv07.htm",
    "timestamp": "2025-05-05T05:45:08Z"
  },
  {
    "title": "Yemeni Armed Forces announce imposition of aerial blockade on Israel",
    "description": "The Yemeni Armed Forces have announced that they will impose a complete aerial blockade on the Israeli enemy through repeated targeting of airports. The Yemeni Armed Forces have announced that they will impose a complete aerial blockade on the Israeli enemy t…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250504-presstv02.htm",
    "timestamp": "2025-05-05T05:44:38Z"
  },
  {
    "title": "Iran rejects allegations of role in Yemen's retaliatory operations",
    "description": "Iran has firmly denounced recent accusations by US and Israeli officials about its involvement in Yemeni retaliatory operations, calling them \"baseless\" and \"misleading.\" Iran has firmly denounced recent accusations by US and Israeli officials about its invol…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250504-presstv01.htm",
    "timestamp": "2025-05-05T05:44:34Z"
  },
  {
    "title": "Ultranationalist Simion Set To Face Moderate Dan In Romanian Presidential Runoff",
    "description": "Near-final Results have given ultranationalist George Simion a solid victory in the first round of Romania's presidential election, but he did not capture the majority needed to avoid a runoff on May 18, likely against Bucharest Mayor Nicursor Dan. Near-final…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250505-rferl01.htm",
    "timestamp": "2025-05-05T05:41:52Z"
  },
  {
    "title": "Adani Group stocks rally up to 7% after Gautam Adani's team meets Trump officials over US bribery case",
    "description": "Adani Group stocks rallied up to 7% on May 5 after reports emerged that Gautam Adani’s team met officials from former US President Donald Trump’s administration, seeking dismissal of bribery-related charges. Adani Enterprises rose 5.7%, while Adani Total Gas …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-stocks-rally-up-to-7-after-gautam-adanis-team-meets-trump-officials-over-us-bribery-case/articleshow/120889604.cms",
    "timestamp": "2025-05-05T05:41:51Z"
  },
  {
    "title": "Global economy already feeling drag from Trump tariffs",
    "description": "The silver lining could be that this reduces inflationary pressures and so will give central banks elsewhere greater scope to boost the economy with interest rate cuts",
    "link": "https://www.thehindubusinessline.com/news/world/global-economy-already-feeling-drag-from-trump-tariffs/article69539921.ece",
    "timestamp": "2025-05-05T05:41:44Z"
  },
  {
    "title": "Romanian Ultranationalist Simion Set To Win First Round Of Presidential Vote -- Race Tight For Second Place",
    "description": "Romanian ultranationalist George Simion appeared to wrap up a solid victory, though not the majority needed to avoid a runoff, in a presidential election nearly six months after an initial vote was abruptly canceled amid allegations of a Russian influence cam…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250504-rferl03.htm",
    "timestamp": "2025-05-05T05:41:37Z"
  },
  {
    "title": "Trump says ordering ‘100% tariff’ on all movies produced abroad",
    "description": "US President Donald Trump said Sunday he was ordering new tariffs on all films made outside the United States, claiming Hollywood was being “devastated” by a trend of US filmmakers and studios working abroad. The announcement comes as the White House is comin…",
    "link": "https://www.digitaljournal.com/world/trump-says-ordering-100-tariff-on-all-movies-produced-abroad/article",
    "timestamp": "2025-05-05T05:32:20Z"
  },
  {
    "title": "Trump Says Ordering '100% Tariff' On All Movies Produced Abroad",
    "description": "US President Donald Trump said Sunday he was ordering new tariffs on all films made outside the United States, claiming Hollywood was being \"devastated\" by a trend of US filmmakers and studios working abroad.",
    "link": "https://www.ibtimes.com/trump-says-ordering-100-tariff-all-movies-produced-abroad-3772447",
    "timestamp": "2025-05-05T05:30:11Z"
  },
  {
    "title": "During Prague Visit, Zelenskyy Says 'Eager' Putin Should Focus On Peace, Not Parades",
    "description": "Ukrainian President Volodymyr Zelenskyy called on his Russian counterpart Vladimir Putin to focus on reaching a peace deal to end the war between Russia and Ukraine instead of being \"eager\" to show off military hardware in next week's Victory Day parade. Ukra…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250504-rferl02.htm",
    "timestamp": "2025-05-05T05:28:40Z"
  },
  {
    "title": "Trump Reveals His Red Line in Ukraine Peace Push",
    "description": "US President Donald Trump said that the United States may one day decide to withdraw from the process of negotiations on the settlement of the Ukraine conflict. US President Donald Trump said that the United States may one day decide to withdraw from the proc…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250504-sputnik01.htm",
    "timestamp": "2025-05-05T05:28:36Z"
  },
  {
    "title": "Albanese faces Trump test with Australia's minerals as potential tool",
    "description": "SYDNEY -- Having rode voter distaste for U.S. President Donald Trump's administration to a thumping election victory, Australian Prime Minister Anthony Albanese now faces the thorny question of how to handle relations with his American counterpart, with exper…",
    "link": "https://biztoc.com/x/a7591e29d4c0cef2",
    "timestamp": "2025-05-05T05:28:35Z"
  },
  {
    "title": "Trump to impose 100 pct tariff on all movies \"produced in foreign lands\"",
    "description": "LOS ANGELES, May 4 (Xinhua) -- U.S. President Donald Trump said on Sunday that he is authorizing to",
    "link": "http://en.people.cn/n3/2025/0505/c90000-20310475.html",
    "timestamp": "2025-05-05T05:27:28Z"
  },
  {
    "title": "Pro-Trump candidate leads in first round of Romania’s presidential election",
    "description": "In today’s edition of The Capitals, read about France promising American academics boundless 'freedom' (but little cash), the Czech president expecting a delivery of 1.8 million shells to Ukraine, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-pro-trump-candidate-leads-in-first-round-of-romanias-presidential-election/",
    "timestamp": "2025-05-05T05:22:57Z"
  },
  {
    "title": "New Zealand film officials discussing Donald Trump’s announcement of 100% tariff on films produced outside US",
    "description": "Trump says movies made outside the US are a 'sort of a threat to our country'.",
    "link": "https://www.nzherald.co.nz/nz/politics/new-zealand-film-officials-discussing-donald-trumps-announcement-of-100-tariff-on-films-produced-outside-us/DMR6MGLVDRCAFKJKQDEFZ277EU/",
    "timestamp": "2025-05-05T05:16:11Z"
  },
  {
    "title": "US Federal Reserve likely to defy Trump, keep rates unchanged this week",
    "description": "Despite pressure from Trump to cut interest rates, the Federal Reserve is expected to hold steady, influenced by concerns over inflation and the potential impact of tariffs.",
    "link": "https://www.thehindubusinessline.com/news/world/us-federal-reserve-likely-to-defy-trump-keep-rates-unchanged-this-week/article69539852.ece",
    "timestamp": "2025-05-05T05:07:36Z"
  },
  {
    "title": "Scott Bessent Defends Trump's Economic Agenda As 'Engine Designed To Drive Economic Growth,' Despite GDP Contraction And Falling Approval",
    "description": "Treasury Secretary Scott Bessent defended President Donald Trump‘s economic agenda on Sunday in an op-ed, arguing that the administration’s approach will benefit Main Street while maintaining Wall Street’s strength.\nWhat Happened: “President Trump intends to …",
    "link": "https://biztoc.com/x/5651c5a4670775e4",
    "timestamp": "2025-05-05T05:06:39Z"
  },
  {
    "title": "Trump imposes 100% tariff on foreign films in bid to revive ‘dying’ Hollywood",
    "description": "Governments worldwide, including in Europe, have boosted tax credits and cash rebates to grab a bigger slice of the $248 billion set to be spent on content production in 2025.",
    "link": "https://www.euractiv.com/section/politics/news/trump-imposes-100-tariff-on-foreign-films-in-bid-to-revive-dying-hollywood/",
    "timestamp": "2025-05-05T05:04:07Z"
  },
  {
    "title": "Romanian hard-right leader clear winner in first-round presidential vote",
    "description": "Ballots from nearly 99.6% of voting stations showed Bucharest Mayor Nicusor Dan, 55, was in second place at around 21%.",
    "link": "https://www.japantimes.co.jp/news/2025/05/05/world/politics/romanian-hard-right-presidential-vote/",
    "timestamp": "2025-05-05T05:04:00Z"
  },
  {
    "title": "Donald Trump, Roger Goodell expected to announce Commanders as 2027 NFL Draft host",
    "description": "The Commanders are turning to the commander-in-chief to make a major announcement on Monday.",
    "link": "https://nypost.com/2025/05/05/sports/donald-trump-expected-to-announce-washington-d-c-as-2027-nfl-draft-host/",
    "timestamp": "2025-05-05T05:01:58Z"
  },
  {
    "title": "The new White House influencer briefings are a terrible look",
    "description": "These propaganda dissemination sessions are more suited to Pyongyang",
    "link": "https://www.irishtimes.com/business/2025/05/05/the-new-white-house-influencer-briefings-are-a-terrible-look/",
    "timestamp": "2025-05-05T05:00:01Z"
  },
  {
    "title": "Germany’s incoming chancellor Friedrich Merz known for impulsive shifts and rhetorical sharpshooting",
    "description": "Ex-chancellor Angela Merkel has announced she will attend Tuesday’s swearing-in ceremony in Berlin",
    "link": "https://www.irishtimes.com/life-style/people/2025/05/05/germanys-incoming-chancellor-merz-known-for-impulsive-shifts-and-rhetorical-sharpshooting/",
    "timestamp": "2025-05-05T05:00:00Z"
  },
  {
    "title": "Let’s halt this creeping evil that is attention-harvesting: a pedestrian could be naked, or on fire, and the zombies on their phones wouldn’t blink",
    "description": "You wouldn’t send your child out on the M50 to play, so how does it seem appropriate to hand anyone under 16 a smartphone?",
    "link": "https://www.irishtimes.com/life-style/people/2025/05/05/lets-halt-this-creeping-evil-that-is-attention-harvesting-a-pedestrian-could-be-naked-or-on-fire-and-the-zombies-on-their-phones-wouldnt-blink/",
    "timestamp": "2025-05-05T05:00:00Z"
  },
  {
    "title": "Pence says January 6 attack’s failure ‘became a triumph of freedom’ as he receives JFK Profile in Courage Award",
    "description": "Former Vice President Mike Pence said Sunday while receiving the John F. Kennedy Profile in Courage Award that January 6, 2021, “became a triumph of freedom” because Congress returned to do its constitutional duty after the attack on the Capitol.",
    "link": "https://www.cnn.com/2025/05/04/politics/mike-pence-jfk-award-january-6",
    "timestamp": "2025-05-05T04:56:42Z"
  },
  {
    "title": "Trump Denies Personal Profit From Memecoin Venture: 'I Haven't Even Looked'",
    "description": "President Donald Trump refuted claims that he is financially benefiting from his Official Trump (CRYPTO: TRUMP) meme coin during an interview that aired Sunday.\nWhat Happened: In a wide-ranging interview with NBC News, Trump was asked about his potential fina…",
    "link": "https://biztoc.com/x/711117d35cae48c6",
    "timestamp": "2025-05-05T04:55:29Z"
  },
  {
    "title": "White House shares AI image of Trump as Jedi, but Star Wars fans spot lightsaber \"blunder\"",
    "description": "The White House's Star Wars Day post featuring Trump with a red lightsaber backfired, drawing criticism for associating him with the villainous Sith Lords. This followed an AI-generated image of Trump as the Pope that also faced backlash. Adding to the contro…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-shares-ai-image-of-trump-as-jedi-but-star-wars-fans-spot-lightsaber-blunder/articleshow/120888439.cms",
    "timestamp": "2025-05-05T04:52:27Z"
  },
  {
    "title": "Trump Has “No Authority” To Impose 100% Movie Tariffs, Gavin Newsom Says; Studios Scrambling To Find Out What POTUS Wants",
    "description": "EXCLUSIVE: Typical of Donald Trump, the details of POTUS’ just announced bombshell 100% tariffs on movies made outside America are vague. Yet, what is already very clear, as studios and streamers try to figure out next steps, is that the Governor of Californi…",
    "link": "http://deadline.com/2025/05/trump-movie-tariffs-gavin-newsom-response-1236385079/",
    "timestamp": "2025-05-05T04:45:45Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,166",
    "description": "These are the key events on day 1,166 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/5/russia-ukraine-war-list-of-key-events-day-1166",
    "timestamp": "2025-05-05T04:44:52Z"
  },
  {
    "title": "Trump Open To Extending TikTok Deadline, Says He Has 'Warm Spot' For The App",
    "description": "On Friday, President Donald Trump said he would consider pushing back the June 19 deadline for ByteDance to sell TikTok's U.S. operations if a deal is not finalized in time. This marks the third time he's granted a reprieve to the short video app used by over…",
    "link": "https://biztoc.com/x/f81efb425f319f20",
    "timestamp": "2025-05-05T04:44:46Z"
  },
  {
    "title": "Trump says he wants a fair trade deal with China",
    "description": "ABOARD AIR FORCE ONE, May 4 (Reuters) - U.S. President Donald Trump on Sunday said the U.S. was meeting with many countries, including China, on trade deals, and his main priority with China was to secure a fair trade deal.\nTrump told reporters aboard Air For…",
    "link": "https://biztoc.com/x/a4285e9821b31194",
    "timestamp": "2025-05-05T04:44:24Z"
  },
  {
    "title": "Polish far-right candidate’s Chicago visit causes stir",
    "description": "Presidential candidate Karol Nawrocki was denied an official speaking opportunity during a commemoration event.",
    "link": "https://www.euractiv.com/section/politics/news/polish-far-right-candidates-chicago-visit-causes-stir/",
    "timestamp": "2025-05-05T04:41:01Z"
  },
  {
    "title": "All Foreign-Produced Films Expected To Be Subjected to 100% Tariffs",
    "description": "SummaryPresident Trump announces 100% tariffs on all foreign produced films outside of AmericaHe claims the film industry is in a \"very fast death\" due to incentives around the worldMajor studios and companies like Disney, Netflix and more will be affected, b…",
    "link": "https://hypebeast.com/2025/5/trump-all-foreign-produced-films-us-100-percent-tariffs-policy-announcement",
    "timestamp": "2025-05-05T04:40:40Z"
  },
  {
    "title": "Victorious Australian PM holds 'warm' chat with Trump",
    "description": "Following his landslide election victory, partly fueled by voter distrust of Donald Trump, Australian Prime Minister Anthony Albanese reported a \"warm\" conversation with the US President. Albanese highlighted the importance of the nations' security alliance a…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/victorious-australian-pm-holds-warm-chat-with-trump/articleshow/120888103.cms",
    "timestamp": "2025-05-05T04:40:29Z"
  },
  {
    "title": "US President Donald Trump claims credit for 'good parts' of economy, blames Biden for rest",
    "description": "Donald Trump attributed the US economy's positive aspects to his policies, while blaming Joe Biden for the negative ones. He acknowledged responsibility but highlighted his short tenure. Despite economic concerns, Trump anticipates a significant boom, particu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-president-donald-trump-claims-credit-for-good-parts-of-economy-blames-biden-for-rest/articleshow/120888284.cms",
    "timestamp": "2025-05-05T04:40:26Z"
  },
  {
    "title": "\"If US, Israel Attack...\": Iran's Warning Amid Houthi Missile Strikes",
    "description": "Iran&#039;s comments also followed the country unveiling a new solid-fuel ballistic missile called &#039;Qassem Bassir&#039; - which has a range of 1,200 kilometres.",
    "link": "https://www.ndtv.com/world-news/irans-strike-back-warning-to-us-israel-if-they-respond-to-houthi-attacks-8332519",
    "timestamp": "2025-05-05T04:37:17Z"
  },
  {
    "title": "Former Vice President Mike Pence honored by Kennedy family in receiving the JFK 'Profile in Courage Award'",
    "description": "Former Vice President Mike Pence was awarded the John F. Kennedy Profile in Courage Award for his refusal to honor President Trump's request to overturn the 2020 election results.",
    "link": "https://www.foxnews.com/politics/former-vice-president-mike-pence-honored-kennedy-family-receiving-jfk-profile-courage-award",
    "timestamp": "2025-05-05T04:34:59Z"
  },
  {
    "title": "Australia and New Zealand pledge support for film industries after Trump proposes tariffs",
    "description": "Australia and New Zealand have pledged to strongly defend their film industries following U.S. President Donald Trump's announcement of a proposed 100% tariff on movies produced outside the United States. Both countries are awaiting further details, with Aust…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/australia-and-new-zealand-pledge-support-for-film-industries-after-trump-proposes-tariffs/articleshow/120888169.cms",
    "timestamp": "2025-05-05T04:34:29Z"
  },
  {
    "title": "Mike Pence receives JFK Profile in Courage Award for January 6 actions",
    "description": "BOSTON — Former Vice President Mike Pence on Sunday repeatedly invoked the Constitution and said it is what “binds us all together” after receiving the John F. Kennedy Profile in Courage Award.",
    "link": "https://www.nbcnews.com/politics/politics-news/mike-pence-receives-jfk-profile-courage-award-january-6-actions-rcna204763",
    "timestamp": "2025-05-05T04:30:20Z"
  },
  {
    "title": "Victorious Australian PM Holds 'Warm' Chat With Trump",
    "description": "Australia's prime minister said Monday he held a \"warm\" conversation with Donald Trump, days after storming to an election victory partly shaped by voters' distrust of the US president.",
    "link": "https://www.ibtimes.com/victorious-australian-pm-holds-warm-chat-trump-3772442",
    "timestamp": "2025-05-05T04:30:06Z"
  },
  {
    "title": "Victorious Australian PM holds ‘warm’ chat with Trump",
    "description": "Australia’s prime minister said Monday he held a “warm” conversation with Donald Trump, days after storming to an election victory partly shaped by voters’ distrust of the US president.  Left-leaning Prime Minister Anthony Albanese won by a landslide on Satur…",
    "link": "https://www.digitaljournal.com/world/victorious-australian-pm-holds-warm-chat-with-trump/article",
    "timestamp": "2025-05-05T04:27:20Z"
  },
  {
    "title": "Trump threatens 100% tariff on foreign-made films",
    "description": "Trump threatens 100% tariff on foreign-made films\nTrump threatens 100% tariff on foreign-made films\nNEW YORK (AP) — President Donald Trump is opening a new salvo in his tariff war, targeting films made outside the U.S.\nIn a post Sunday night on his Truth Soci…",
    "link": "https://biztoc.com/x/35154cb3d39ae146",
    "timestamp": "2025-05-05T04:22:56Z"
  },
  {
    "title": "Trump has 'no idea' who Australian election loser Peter Dutton is",
    "description": "The US president also described election winner Anthony Albanese as \"a friend of mine\".",
    "link": "https://www.bbc.com/news/articles/cjewqxjqex0o",
    "timestamp": "2025-05-05T04:22:54Z"
  },
  {
    "title": "Malaysia plans cargo rail link to Bangkok to boost trade",
    "description": "KUALA LUMPUR - Malaysia is planning to start a direct rail cargo service between its capital Kuala Lumpur and Bangkok this year to boost bilateral and regional trade, state media reported, citing the transport minister.",
    "link": "https://www.bangkokpost.com/business/general/3018110/malaysia-plans-cargo-rail-link-to-bangkok-to-boost-trade",
    "timestamp": "2025-05-05T04:19:00Z"
  },
  {
    "title": "Former US VP handed JFK courage award",
    "description": "The former vice president of the United States, Mike Pence, has been handed a courage award for his January 6 actions.",
    "link": "https://news.sky.com/story/former-us-vice-president-mike-pence-handed-jfk-courage-award-13362079",
    "timestamp": "2025-05-05T04:19:00Z"
  },
  {
    "title": "Oil prices drop $2 with most Asian markets closed for holidays",
    "description": "Crude oil prices declined following OPEC+'s decision to boost production. US futures also experienced a dip. Global markets showed mixed performance with losses in Australia and Taiwan. Wall Street extended its winning streak amid trade war concerns. Job grow…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-drop-2-with-most-asian-markets-closed-for-holidays/articleshow/120887800.cms",
    "timestamp": "2025-05-05T04:16:25Z"
  },
  {
    "title": "Oil prices drop $2 with most Asian markets closed for holidays",
    "description": "Oil prices have fallen more than $2 a barrel after the OPEC+ group of oil producing nations said it plans to increase output.",
    "link": "https://www.clickondetroit.com/business/2025/05/05/oil-prices-drop-2-with-most-asian-markets-closed-for-holidays/",
    "timestamp": "2025-05-05T04:16:18Z"
  },
  {
    "title": "Laissez faire: France promises American academics boundless ‘freedom’ (but little cash)",
    "description": "France and the EU are pouncing on the US's impending brain drain to present themselves as “stable spaces” where researchers can work “without taboos\".",
    "link": "https://www.euractiv.com/section/politics/news/make-research-great-again-just-not-in-america-says-europe/",
    "timestamp": "2025-05-05T04:15:14Z"
  },
  {
    "title": "‘Hollywood is dying’: Donald Trump orders 100% tariff on non-US movies in a bid to save the American film industry",
    "description": "Hollywood | World | Entertainment In a post on social media, Trump declared he was authorizing the US Trade Representative to start the process to impose the levy in order to revive America’s movie industry.",
    "link": "https://www.wionews.com/entertainment/donald-trump-orders-100-tariff-on-non-us-movies-in-a-bid-to-save-the-american-film-industry-hollywood-is-dying-9033517",
    "timestamp": "2025-05-05T04:15:11Z"
  },
  {
    "title": "Federal Reserve likely to defy Trump, keep rates unchanged this week",
    "description": "The Federal Reserve is expected to maintain current interest rates. This decision comes amid pressure from Donald Trump and scrutiny over inflation. Trump claims there is no inflation, but data suggests otherwise. Tariffs add complexity to the Fed's decision-…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-reserve-likely-to-defy-trump-keep-rates-unchanged-this-week/articleshow/120887741.cms",
    "timestamp": "2025-05-05T04:13:43Z"
  },
  {
    "title": "Trump is trying to put a tariff on movies made outside the US to stop Hollywood 'dying a very fast death'",
    "description": "Trump said the US's film industry is \"dying a very fast death\" because productions are shifting out of the country.",
    "link": "https://www.businessinsider.com/trump-trying-to-put-tariff-on-movies-from-outside-us-2025-5",
    "timestamp": "2025-05-05T04:13:17Z"
  },
  {
    "title": "Donald Trump hints at some trade deals as early as this week, sparking hopes for India",
    "description": "US President Donald Trump hinted at possible trade agreements with nations as early as this week to sidestep higher US import taxes. Discussions are ongoing with several countries, with Trump holding the final decision-making power. India is in talks with the…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-hints-at-some-trade-deals-as-early-as-this-week-sparking-hopes-for-india/articleshow/120887739.cms",
    "timestamp": "2025-05-05T04:11:58Z"
  },
  {
    "title": "Donald Trump hints at some trade deals as early as this week, sparking hopes for India",
    "description": "US President Donald Trump hinted at possible trade agreements with nations as early as this week to sidestep higher US import taxes. Discussions are ongoing with several countries, with Trump holding the final decision-making power. India is in talks with the…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/donald-trump-hints-at-some-trade-deals-as-early-as-this-week-sparking-hopes-for-india/articleshow/120887555.cms",
    "timestamp": "2025-05-05T04:11:58Z"
  },
  {
    "title": "Iran unveils new ballistic missile with 1,200 km range",
    "description": "Tehran (AFP) May 4, 2025\n\n\n Iran on Sunday unveiled a new solid-fuel ballistic missile with a range of 1,200 kilometres (745 miles), state television reported, at a time of rising tensions with the West. \n\n\"The solid propellant Ghassem Basir ballistic missile…",
    "link": "https://www.spacewar.com/reports/Iran_unveils_new_ballistic_missile_with_1200_km_range_999.html",
    "timestamp": "2025-05-05T04:10:09Z"
  },
  {
    "title": "Chinese president to visit Russia on May 7-10: Kremlin",
    "description": "Moscow (AFP) May 4, 2025\n\n\n Chinese President Xi Jinping will visit Russia on May 7-10 and join his Russian counterpart Vladimir Putin at commemorations of the Allied victory against Nazi Germany, the Kremlin said on Sunday. \n\nThe visit coincides with heighte…",
    "link": "https://www.spacewar.com/reports/Chinese_president_to_visit_Russia_on_May_7-10_Kremlin_999.html",
    "timestamp": "2025-05-05T04:10:09Z"
  },
  {
    "title": "Patriot defense system headed for Ukraine as ceasefire hopes dim",
    "description": "Washington DC (UPI) May 4, 2025 \n\n\n An Israel-based Patriot air defense system is being moved to Ukraine to help in its ongoing battle against a three-year long Russian invasion, officials announced Sunday. \n The system will be sent after it is refurbished, a…",
    "link": "https://www.spacewar.com/reports/Patriot_defense_system_headed_for_Ukraine_as_ceasefire_hopes_dim_999.html",
    "timestamp": "2025-05-05T04:10:09Z"
  },
  {
    "title": "Trump threatens 100% tariff on foreign-made films",
    "description": "President Donald Trump is opening a new salvo in his tariff war, targeting films made outside the United States.",
    "link": "https://www.wsls.com/business/2025/05/05/trump-threatens-100-tariff-on-foreign-made-films/",
    "timestamp": "2025-05-05T04:09:07Z"
  },
  {
    "title": "Federal Reserve likely to defy Trump, keep rates unchanged this week",
    "description": "WASHINGTON (AP) — The Federal Reserve will likely keep its key short-term interest rate unchanged on Wednesday, despite weeks of harsh criticism and demands from President Donald Trump that the Fed reduce borrowing costs. After causing a sharp drop in financi…",
    "link": "https://financialpost.com/pmn/federal-reserve-likely-to-defy-trump-keep-rates-unchanged-this-week",
    "timestamp": "2025-05-05T04:09:06Z"
  },
  {
    "title": "US Federal Reserve likely to defy President Trump, keep rates unchanged this week",
    "description": "Despite pressure from President Trump to cut interest rates, the Federal Reserve is expected to hold steady, influenced by concerns over inflation and the potential impact of tariffs. Fed officials are wary after past misjudgments on inflation, preferring to …",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-federal-reserve-likely-to-defy-president-trump-keep-rates-unchanged-this-week/articleshow/120887694.cms",
    "timestamp": "2025-05-05T04:08:27Z"
  },
  {
    "title": "At last, Trump Takes Aim at the Public Broadcasting Monopoly",
    "description": "ABOARD AIR FORCE ONE On Thursday, while most Americans slept, a decisive blow was struck in a battle long overdue. President Donald Trump, with the swift stroke of his pen, aimed the lance of executive power at the heart of America’s taxpayer-funded media est…",
    "link": "https://www.lewrockwell.com/2025/05/no_author/at-last-trump-takes-aim-at-the-public-broadcasting-monopoly/",
    "timestamp": "2025-05-05T04:01:00Z"
  },
  {
    "title": "Trump is acting like it’s his choice whether he obeys the Constitution | CNN Politics",
    "description": "Americans are learning what it’s like to live with a president who sees no constraints on his actions and who apparently fears paying no price for them.",
    "link": "https://www.cnn.com/2025/05/05/politics/constitution-trump-nbc-interview-tariffs-canada",
    "timestamp": "2025-05-05T04:00:50Z"
  },
  {
    "title": "Can Diplomacy Stop the War in Ukraine? Dueling Peace Plans.",
    "description": "On April 17, the U.S. presented Ukrainian and European officials with a framework for peace that declared itself “the final offer.” On April 23, Ukrainian and European officials, denying the “final offer” statement, presented the U.S. with an alternative peac…",
    "link": "https://original.antiwar.com/ted_snider/2025/05/04/can-diplomacy-stop-the-war-in-ukraine-deuling-peace-plans/",
    "timestamp": "2025-05-05T04:00:48Z"
  },
  {
    "title": "Stolen victimhood?",
    "description": "Politicians often leverage their past valor to further their careers. It is a way to demonstrate to their constituency their willingness to make personal sacrifices.  It has proved to be an effective tool. The war hero image propelled the likes ...",
    "link": "https://www.americanthinker.com/blog/2025/05/stolen_victimhood.html",
    "timestamp": "2025-05-05T04:00:00Z"
  },
  {
    "title": "60 Minutes lionizes Trump-hating attorney Marc Elias, mastermind of the Russia hoax",
    "description": "After an unprecedented on-air hissy fit last week over the forced exit of a longtime editor, 60 Minutes's Scott Pelley decided to go all in on the Trump-hate, using his on-air time to praise and promote Marc Elias, the architect of the Russia hoa...",
    "link": "https://www.americanthinker.com/blog/2025/05/60_minutes_lionizes_trump_hating_attorney_marc_elias_mastermind_of_the_russia_hoax.html",
    "timestamp": "2025-05-05T04:00:00Z"
  },
  {
    "title": "The Party of Disbelief",
    "description": "Where you stand as an individual or an organization says a great deal about your morals and values. In looking at the current Democratic Party, it is easy to see why they are hemorrhaging followers. Reviewing the party’s activities in the last ...",
    "link": "https://www.americanthinker.com/articles/2025/05/the_party_of_disbelief.html",
    "timestamp": "2025-05-05T04:00:00Z"
  },
  {
    "title": "The Oracle of Omaha Steps Down",
    "description": "After over six decades at the helm of Berkshire Hathaway, the end of this year marks the finale: Investment legend Warren Buffett is stepping down. Buffett weathered market storms and geopolitical turbulence by translating the Bretton Woods order int...",
    "link": "https://www.americanthinker.com/articles/2025/05/the_oracle_of_omaha_steps_down.html",
    "timestamp": "2025-05-05T04:00:00Z"
  },
  {
    "title": "Mitsotakis basks in Trump’s praise as Greek exporters fear US tariff ‘butterfly effect’",
    "description": "Greece may be ‘small potatoes’ in trade with US, but Chinese investment there could influence Trump’s thinking",
    "link": "https://www.irishtimes.com/world/europe/2025/05/05/mitsotakis-basks-in-trumps-praise-as-greek-exporters-fear-us-tariff-butterfly-effect/",
    "timestamp": "2025-05-05T04:00:00Z"
  },
  {
    "title": "Trump’s plan for Alcatraz is absolute genius",
    "description": "Donald Trump has announced that he’s reopening Alcatraz as a federal prison for the worst of the worst in America. I couldn’t be more delighted, because it’s a wonderful idea at both practical and symbolic levels.\r\n\r\nTrump made the ...",
    "link": "https://www.americanthinker.com/blog/2025/05/trump_s_plan_for_alcatraz_is_absolute_genius.html",
    "timestamp": "2025-05-05T04:00:00Z"
  },
  {
    "title": "Trump says he will reopen 'enlarged and rebuilt' Alcatraz prison",
    "description": "President Donald Trump on Sunday said he will direct several federal agencies to \"reopen a substantially enlarged and rebuilt Alcatraz,\" a facility that for decades served as a federal prison and is now a national park.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-says-will-reopen-enlarged-rebuilt-alcatraz-prison-rcna204743",
    "timestamp": "2025-05-05T03:59:22Z"
  },
  {
    "title": "Trump Orders Reopening of Alcatraz Prison",
    "description": "US President Donald Trump said he had ordered the restoration and reopening of the famed Alcatraz prison on an island in San Francisco Bay to house the country's most dangerous criminals.",
    "link": "https://sputnikglobe.com/20250505/trump-orders-reopening-of-alcatraz-prison-1121981385.html",
    "timestamp": "2025-05-05T03:59:00Z"
  },
  {
    "title": "In New York, a GOP congressman is shelled with questions about Trump during raucous town hall",
    "description": "Voters in U.S. Rep. Mike Lawler’s suburban New York swing district unloaded a barrage of criticism on the Republican during a raucous town hall, peppering him with questions around President Donald Trump’s aggressive agenda before devolving into a chao...",
    "link": "https://abcnews.go.com/Politics/wireStory/new-york-gop-congressman-shelled-questions-trump-raucous-121458724",
    "timestamp": "2025-05-05T03:58:30Z"
  },
  {
    "title": "Trump threatens 100% tariff on foreign-made films",
    "description": "President Donald Trump is opening a new salvo in his tariff war, targeting films made outside the U_S_ Trump said Sunday night that he has authorized the Department of Commerce and the Office of the U_S_ Trade Representative to slap a 100% tariff “on any and …",
    "link": "https://www.clickondetroit.com/business/2025/05/05/trump-threatens-100-tariff-on-foreign-made-films/",
    "timestamp": "2025-05-05T03:56:49Z"
  },
  {
    "title": "US reciprocal tariff on Malaysia may be reduced, says Anwar",
    "description": "KUALA LUMPUR: There is a possibility that the 24% reciprocal tariff rate imposed by President Donald Trump on Malaysia may be reduced, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/05/05/us-reciprocal-tariff-on-malaysia-may-be-reduced-says-anwar",
    "timestamp": "2025-05-05T03:54:00Z"
  },
  {
    "title": "Trump says won't remove Fed chair Powell, says good parts of economy are his doing - KSL News",
    "description": "Trump says won't remove Fed chair Powell, says good parts of economy are his doingKSL News Trump Rules Out Firing Powell While Pushing Him to Cut RatesBloomberg.com Trump says he won't remove Fed chair Powell, says good parts of economy are his doingReuters T…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177320383",
    "timestamp": "2025-05-05T03:52:30Z"
  },
  {
    "title": "Trump pushes for ‘total dismantlement’ of Iran’s nuclear program",
    "description": "US President Donald Trump has called for a complete shutdown of Iran’s nuclear research Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616781-trump-iran-nuclear-dismantle/",
    "timestamp": "2025-05-05T03:52:06Z"
  },
  {
    "title": "Trump says won't remove Fed chair Powell, says good parts of economy are his doing",
    "description": "Estimated read time: 3-4 minutes\n- President Donald Trump will not remove Jerome Powell as the Fed Chair before 2026, despite criticism.\n- Trump blames former President Joe Biden for economic downturn.\n- Trump's tariff policies have caused market volatility; …",
    "link": "https://biztoc.com/x/0e00ab01a3a5be84",
    "timestamp": "2025-05-05T03:49:32Z"
  },
  {
    "title": "Saying Hollywood is dying, Trump orders 100% tariff on non-U.S. movies to save it",
    "description": "U.S. President Donald Trump on Sunday announced a 100% tariff on movies produced outside the country, saying the U.S. movie industry was dying a \"very fast death\" due to the incentives that other countries were offering to draw American filmmakers.\n\"This is a…",
    "link": "https://biztoc.com/x/53ef9642df7b703b",
    "timestamp": "2025-05-05T03:49:24Z"
  },
  {
    "title": "Albanese says had 'positive' talks with Trump",
    "description": "Australian Prime Minister Anthony Albanese told reporters on Monday that he had a \"warm and positive conversation\" with United States President Donald Trump.\n\"We talked about how AUKUS...",
    "link": "https://biztoc.com/x/9ab0b85b628e6409",
    "timestamp": "2025-05-05T03:49:18Z"
  },
  {
    "title": "Saying Hollywood is dying, Trump orders 100% tariff on non-U.S. movies to save it",
    "description": "No details were provided on how the tariffs would be implemented.",
    "link": "https://www.japantimes.co.jp/business/2025/05/05/trump-hollywood-tariff-movies/",
    "timestamp": "2025-05-05T03:48:00Z"
  },
  {
    "title": "Donald Trump threatens 100% tariff on films made outside the US: 'Movie industry in America is DYING a very fast death'",
    "description": "Donald Trump proposes a 100% tariff on foreign-made films, citing a \"National Security threat\" due to other countries' incentives luring filmmakers away from the U.S. He aims to revitalize the American movie industry, which he believes is declining. This move…",
    "link": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/donald-trump-threatens-100-tariff-on-films-made-outside-the-us-movie-industry-in-america-is-dying-a-very-fast-death/articleshow/120887173.cms",
    "timestamp": "2025-05-05T03:47:25Z"
  },
  {
    "title": "Australia can no longer take a ‘business as usual’ approach to the US. On security, it’s time for courage and confidence",
    "description": "It might be tempting for Labor to continue a ‘small target’ when it comes to Donald Trump. But the new government needs the courage to ask difficult questions.",
    "link": "https://theconversation.com/australia-can-no-longer-take-a-business-as-usual-approach-to-the-us-on-security-its-time-for-courage-and-confidence-255598",
    "timestamp": "2025-05-05T03:47:21Z"
  },
  {
    "title": "After its landslide win, Labor should have courage and confidence on security – and our alliance with the US",
    "description": "It might be tempting for Labor to continue a ‘small target’ when it comes to Donald Trump. But the new government needs the courage to ask difficult questions.",
    "link": "https://theconversation.com/after-its-landslide-win-labor-should-have-courage-and-confidence-on-security-and-our-alliance-with-the-us-255598",
    "timestamp": "2025-05-05T03:47:21Z"
  },
  {
    "title": "Oil prices drop $2 with most Asian markets closed for holidays",
    "description": "HONG KONG (AP) — Oil prices fell more than $2 a barrel early Monday after the OPEC+ group of oil producing nations said it plans to increase output. U.S. futures fell U.S. benchmark crude oil sank $2.21 or 3.8% to $56.08 per barrel in electronic trading on th…",
    "link": "https://financialpost.com/pmn/oil-prices-drop-2-with-most-asian-markets-closed-for-holidays",
    "timestamp": "2025-05-05T03:41:21Z"
  },
  {
    "title": "Trump orders reopening of Alcatraz prison",
    "description": "U.S. President Donald Trump said on Sunday he was directing the Federal Bureau of Prisons to rebuild and reopen the infamous Alcatraz prison in the San Francisco Bay to &quot;house America’s most ruthless and violent Offenders.&quot; &quot;REBUILD, AND OPEN A…",
    "link": "https://japantoday.com/category/world/trump-orders-the-reopening-of-alcatraz-prison",
    "timestamp": "2025-05-05T03:38:23Z"
  },
  {
    "title": "Wealthy Chinese turn away from US real estate as Trump amps up trade war with Beijing",
    "description": "Wealthy mainland Chinese are increasingly shifting their attention and capital away from the United States to other real estate markets amid rising geopolitical tensions between Washington and Beijing, according to property agents.",
    "link": "https://www.bangkokpost.com/property/3018075/wealthy-chinese-turn-away-from-us-real-estate-as-trump-amps-up-trade-war-with-beijing",
    "timestamp": "2025-05-05T03:37:00Z"
  },
  {
    "title": "Trump says he will reopen Alcatraz prison",
    "description": "Donald Trump wants to reopen Alcatraz. He directs his government to expand the prison. Alcatraz closed in 1963 due to high costs. It housed notorious criminals like Al Capone. The island is now a tourist site. Nancy Pelosi questions the plan's feasibility. Tr…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-proposes-reopening-alcatraz-a-controversial-plan-to-tackle-violent-crime/articleshow/120884943.cms",
    "timestamp": "2025-05-05T03:36:35Z"
  },
  {
    "title": "Australia's re-elected PM Albanese says he had 'warm' talks with Trump on tariffs",
    "description": "Australian Prime Minister Anthony Albanese said on Monday he had a &quot;warm conversation&quot; with U.S. President Donald Trump on tariffs and the AUKUS defense pact after his center-left Labor party decisively beat the conservatives in a weekend election. …",
    "link": "https://japantoday.com/category/world/australia%27s-re-elected-pm-albanese-says-he-had-%27warm%27-talks-with-trump-on-tariffs",
    "timestamp": "2025-05-05T03:36:35Z"
  }
]