[
  {
    "title": "Israel’s air strength is giving it a free hand over Iran",
    "description": "The Iranian military has been largely unable to prevent missile attacks and Israeli aircraft from entering its air space.",
    "link": "https://theconversation.com/israels-air-strength-is-giving-it-a-free-hand-over-iran-259073",
    "timestamp": "2025-06-17T12:37:09Z"
  },
  {
    "title": "Israeli aggression and Iranian nuclear brinkmanship made this confrontation all but inevitable",
    "description": "Iran has been playing a dangerous game that it no longer has the power to win.",
    "link": "https://theconversation.com/israeli-aggression-and-iranian-nuclear-brinkmanship-made-this-confrontation-all-but-inevitable-259024",
    "timestamp": "2025-06-17T12:37:07Z"
  },
  {
    "title": "Trump Considers Adding Another 36 Countries to Divisive Travel Ban",
    "description": "Donald Trump is considering expanding his travel ban on foreign countries by 36, according to a State Department cable that gives countries a deadline.\nThe post Trump Considers Adding Another 36 Countries to Divisive Travel Ban first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-considers-adding-another-36-countries-to-divisive-travel-ban/",
    "timestamp": "2025-06-17T12:36:46Z"
  },
  {
    "title": "Air strikes hit Tehran as Israel says it killed Iranian military commander",
    "description": "Israeli air strikes hit targets in Iran with explosions seen in the capital Tehran.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/17/air-strikes-hit-tehran-as-israel-says-it-killed-iranian-military-commander",
    "timestamp": "2025-06-17T12:36:20Z"
  },
  {
    "title": "What is the NPT, and why has Iran threatened to pull out of the treaty?",
    "description": "The NPT bars members that don't have nuclear weapons from acquiring them. But critics call the treaty discriminatory.",
    "link": "https://www.aljazeera.com/news/2025/6/17/what-is-the-npt-and-why-has-iran-threatened-to-pull-out-of-the-treaty",
    "timestamp": "2025-06-17T12:36:03Z"
  },
  {
    "title": "Americans cut back sharply on their spending last month amid tariffs | CNN Business",
    "description": "Americans are feeling a hangover from their tariff-fueled buying frenzy early in the spring.",
    "link": "https://www.cnn.com/2025/06/17/economy/us-retail-sales-may",
    "timestamp": "2025-06-17T12:35:55Z"
  },
  {
    "title": "The use of federal troops to quell Los Angeles protests recalls militarized law enforcement during the Civil Rights Movement",
    "description": "During Jim Crow segregation, political leaders used domestic military power to preserve the interests of racial authoritarians.",
    "link": "https://theconversation.com/the-use-of-federal-troops-to-quell-los-angeles-protests-recalls-militarized-law-enforcement-during-the-civil-rights-movement-258866",
    "timestamp": "2025-06-17T12:35:42Z"
  },
  {
    "title": "The use of federal troops to quell Los Angles protests recalls militarized law enforcement during the Civil Rights Movement",
    "description": "During Jim Crow segregation, political leaders used domestic military power to preserve the interests of racial authoritarians.",
    "link": "https://theconversation.com/the-use-of-federal-troops-to-quell-los-angles-protests-recalls-militarized-law-enforcement-during-the-civil-rights-movement-258866",
    "timestamp": "2025-06-17T12:35:42Z"
  },
  {
    "title": "The Escalating Political Violence Didn't Come From Nowhere",
    "description": "Michele Goodwin\n\n\n\nDonald Trump issued a statement after the Minnesota shootings saying that this violence “will not be tolerated,” but his words ring hollow.\r\n\n\r\n\n\nThe post The Escalating Political Violence Didn't Come From Nowhere appeared first on The Nati…",
    "link": "https://www.thenation.com/article/politics/political-violence-trump/",
    "timestamp": "2025-06-17T12:35:40Z"
  },
  {
    "title": "A radical proposal to abolish state government and strengthen American democracy",
    "description": "What would the United States be without its states? A better, more democatic country, says one legal scholar.",
    "link": "https://theconversation.com/a-radical-proposal-to-abolish-state-government-and-strengthen-american-democracy-256955",
    "timestamp": "2025-06-17T12:35:31Z"
  },
  {
    "title": "White House fires NRC commissioner (Peter Behr/E&E News)",
    "description": "Peter Behr / E&E News by POLITICO:\nWhite House fires NRC commissioner … President Donald Trump has fired Christopher Hanson from the Nuclear Regulatory Commission, fueling speculation that White House is planning a much stronger role in safety regulation of n…",
    "link": "https://www.memeorandum.com/250617/p29",
    "timestamp": "2025-06-17T12:35:01Z"
  },
  {
    "title": "Seth Meyers Was ‘Feeling Pretty Bummed’ Until 1 Photo Of Trump",
    "description": "Seth Meyers Was ‘Feeling Pretty Bummed’ Until 1 Photo Of Trumphuffpost.com",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-photo_n_685155b9e4b072f3c80e7a33",
    "timestamp": "2025-06-17T12:34:29Z"
  },
  {
    "title": "BREAKING: Trump's Physical And Mental Health Issues On Display at G7 Summit: Leaves A Day Early After Humiliating Himself.",
    "description": "BREAKING: Trump's Physical And Mental Health Issues On Display at G7 Summit: Leaves A Day Early After Humiliating Himself.substack.com",
    "link": "https://deanblundell.substack.com/p/breaking-trumps-physical-and-mental",
    "timestamp": "2025-06-17T12:32:47Z"
  },
  {
    "title": "Trump disputes intel chief Tulsi Gabbard on Iran",
    "description": "President Donald Trump disputed his own director of national intelligence, Tulsi Gabbard, on how developed Iran’s nuclear capabilities are and said Iran was on the verge of obtaining a nuclear weapon when Israel struck in recent days.I don't care what she sai…",
    "link": "https://freerepublic.com/focus/f-news/4323541/posts",
    "timestamp": "2025-06-17T12:31:56Z"
  },
  {
    "title": "Trump says he won't call Minnesota Gov. Walz after lawmaker shootings because it would 'waste time' (Darlene Superville/Associated Press)",
    "description": "Darlene Superville / Associated Press:\nTrump says he won't call Minnesota Gov. Walz after lawmaker shootings because it would ‘waste time’  —  President Donald Trump said Tuesday that he he won't call Minnesota Gov. Tim Walz after the targeted shootings of tw…",
    "link": "https://www.memeorandum.com/250617/p28",
    "timestamp": "2025-06-17T12:30:00Z"
  },
  {
    "title": "The most trafficked mammal is the pangolin. US officials say it's an endangered species",
    "description": "U.S. officials proposed Monday to protect the pangolin, a small, nocturnal mammal covered in scales, under the Endangered Species Act.",
    "link": "https://roanoke.com/news/nation-world/science/article_210627e5-8978-5dcb-936c-15fb99699692.html",
    "timestamp": "2025-06-17T12:30:00Z"
  },
  {
    "title": "The most trafficked mammal is the pangolin. US officials say it's an endangered species",
    "description": "U.S. officials proposed Monday to protect the pangolin, a small, nocturnal mammal covered in scales, under the Endangered Species Act.",
    "link": "https://richmond.com/news/nation-world/science/article_db4f096e-21bc-59a0-a8ac-30e9c9d773bf.html",
    "timestamp": "2025-06-17T12:30:00Z"
  },
  {
    "title": "‘Trump Is America’s Hitler’: The Left’s 10 Most Outrageous Comments About LA Riots",
    "description": "Although protesters injured 10 deputies with the Los Angeles Sheriff’s Office on the first day of riots alone, the Left has attempted to portray the anti-ICE riots... Read More\nThe post ‘Trump Is America’s Hitler’: The Left’s 10 Most Outrageous Comments About…",
    "link": "https://www.dailysignal.com/2025/06/17/trump-is-americas-hitler-10-most-outrageous-comments-la-riots/",
    "timestamp": "2025-06-17T12:30:00Z"
  },
  {
    "title": "‘Purgatory:’ Fed officials left in limbo as tariffs complicate this week’s rate decision",
    "description": "The U.S. economy is mostly in good shape but that isn’t saving Federal Reserve chair Jerome Powell from a spell of angst.",
    "link": "https://www.bostonherald.com/2025/06/17/federal-reserve-tariffs-rate-cut/",
    "timestamp": "2025-06-17T12:29:50Z"
  },
  {
    "title": "Trump says he won’t call Gov. Tim Walz after Minnesota shootings: 'He's a mess'",
    "description": "WASHINGTON — Days after a Minnesota state lawmaker was killed and another injured in a \"politically motivated assassination,\" President Donald Trump said on Tuesday that he would not call the state's governor, eschewing a traditional presidential response to …",
    "link": "https://www.nbcnews.com/politics/white-house/trump-says-wont-call-gov-tim-walz-minnesota-shootings-mess-rcna213432",
    "timestamp": "2025-06-17T12:28:43Z"
  },
  {
    "title": "Steve Bannon Warns Iran War Will Break MAGA and ‘Be the End of Israel!’",
    "description": "MAGA firebrand Steve Bannon warned that U.S. military involvement in the spiraling conflict between Israel and Iran could not only permanently fracture President Donald Trump’s political coalition – but also spell “the end” for Israel itself. His warning on M…",
    "link": "https://www.mediaite.com/media/tv/steve-bannon-warns-iran-war-will-break-maga-and-be-the-end-of-israel/",
    "timestamp": "2025-06-17T12:27:47Z"
  },
  {
    "title": "Here’s the one question the CHRO of IBM asks during every interview",
    "description": "In the age of AI, job candidates need to be comfortable talking about the ways they’ve failed.",
    "link": "https://fortune.com/2025/06/17/one-question-chro-ibm-ask-during-every-interview/",
    "timestamp": "2025-06-17T12:26:33Z"
  },
  {
    "title": "Defense Minister Katz: 'We Will Certainly Deal with Fordow'",
    "description": "Minister Israel Katz clarifies that Israel is also going to deal with the Fordow nuclear enrichment facility, which operates underground beneath a mountain.",
    "link": "https://www.israelnationalnews.com/news/410175",
    "timestamp": "2025-06-17T12:26:26Z"
  },
  {
    "title": "No Tax on Overtime, Tips Changed in Senate Bill: What To Know",
    "description": "Nixing federal income taxes on overtime and tipped income was one of the president's top policy promises during his 2024 election campaign.",
    "link": "https://www.newsweek.com/no-tax-tips-overtime-senate-bill-2086524",
    "timestamp": "2025-06-17T12:24:23Z"
  },
  {
    "title": "After Minnesota shooting, Congress holds emergency briefings on security",
    "description": "The shootings come after credible threats to members of Congress have more than doubled in the last decade and after several violent attacks on lawmakers and their families.",
    "link": "https://www.pbs.org/newshour/politics/after-minnesota-shooting-congress-holds-emergency-briefings-on-security",
    "timestamp": "2025-06-17T12:23:56Z"
  },
  {
    "title": "Stock Market Today: Dow Jones Futures Fall On Trump Iran News; Circle Stock Surges (Live Coverage)",
    "description": "Futures for the Dow Jones Industrial Average and other major stock indexes traded lower Tuesday, after President Donald Trump left the G7 summit early to deal with the Israel-Iran conflict. Among the early movers on the stock market today was Circle Internet …",
    "link": "https://biztoc.com/x/5aa493a2f942c0af",
    "timestamp": "2025-06-17T12:23:20Z"
  },
  {
    "title": "Donald Trump at the situation room in the White House following Israel-Iran war - 5 key things he can do",
    "description": "US President Donald Trump weighs options on Iran's nuclear program after Israeli missile strikes and a proposed assassination plan. Trump is considering sending envoys for diplomacy. He also faces pressure from supporters concerned about further Middle East i…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-at-the-situation-room-in-the-white-house-following-israel-iran-war-5-key-things-he-can-do-donald-trump-news-iran-israel-war-latest-news/articleshow/121909009.cms",
    "timestamp": "2025-06-17T12:23:06Z"
  },
  {
    "title": "Israel's Strikes Against Tehran Broaden As Trump Issues Ominous Warning",
    "description": "Israel’s air campaign against Iran’s capital appeared to broaden on the fourth day of an intensifying conflict as Trump posted an ominous message warning residents of the city to evacuate.",
    "link": "https://www.huffpost.com/entry/ap-ml-mideast-wars-iran-israel-airstrikes_n_68515c5be4b0e06f8e60d427",
    "timestamp": "2025-06-17T12:20:40Z"
  },
  {
    "title": "Oil prices rise 2% after Trump calls for evacuation of Tehran",
    "description": "Prices are rising again after President Donald Trump left the G7 summit in Canada early and demanded that everyone evacuate Iran's capital city.",
    "link": "https://www.cnbc.com/2025/06/17/oil-prices-iran-israel-conflict.html",
    "timestamp": "2025-06-17T12:20:15Z"
  },
  {
    "title": "EU to help evacuate citizens from Middle East after Israel-Iran strikes",
    "description": "\"We are assisting member states to evacuate their citizens that wish to leave,\" the EU's top diplomat, Kaja Kallas, said after an emergency meeting on Tuesday.",
    "link": "https://www.euractiv.com/section/politics/news/eu-to-help-evacuate-citizens-from-middle-east-after-israel-iran-strikes/",
    "timestamp": "2025-06-17T12:19:48Z"
  },
  {
    "title": "Menendez to report to prison for 11-year term for corruption",
    "description": "Former Sen. Bob Menendez, a Democrat from New Jersey, to report to federal prison on an 11-year sentence in a sweeping bribery and corruption scandal.",
    "link": "https://www.foxnews.com/politics/menendez-report-prison-11-year-term-corruption",
    "timestamp": "2025-06-17T12:18:28Z"
  },
  {
    "title": "Iran 'very close' to being able to make a #nuclear weapon: #Trump",
    "description": "US President Donald Trump tells reporters onboard Air Force One that Iran was \"very close\" to being able to make a nuclear ...",
    "link": "https://biztoc.com/x/ec372f986d05b971",
    "timestamp": "2025-06-17T12:17:34Z"
  },
  {
    "title": "Trump's order to leave Tehran adds to fear as Iranians share 'last photo of home'",
    "description": "Tehran's almost 10 million residents must now decide whether to shelter in their homes or attempt to leave.",
    "link": "https://www.bbc.com/news/articles/c3d19nm21kko",
    "timestamp": "2025-06-17T12:17:22Z"
  },
  {
    "title": "Congress is holding emergency briefings on security after Minnesota shootings",
    "description": "Members of Congress are attending emergency security briefings after the killing of a Minnesota state lawmaker.",
    "link": "https://www.bostonherald.com/2025/06/17/minnesota-shootings-congress-security-briefings/",
    "timestamp": "2025-06-17T12:15:50Z"
  },
  {
    "title": "Rachel Maddow Sums Up Trump With 2 Triggering Words",
    "description": "The MSNBC anchor also predicted a laughable legacy for the president.",
    "link": "https://www.huffpost.com/entry/rachel-maddow-2-words-donald-trump_n_6851507ce4b072f3c80e760d",
    "timestamp": "2025-06-17T12:14:49Z"
  },
  {
    "title": "Preemptive Strike or Act of War? Israel Attacked Iran Amid Sinking Global Support for Assault on Gaza",
    "description": "Israel is intensifying its war on Iran, bombing the headquarters of the country’s national TV network on Monday and assassinating another top military leader. Israeli Prime Minister Benjamin Netanyahu has also suggested killing Iran’s supreme leader, Ayatolla…",
    "link": "https://www.democracynow.org/2025/6/17/iran_israel",
    "timestamp": "2025-06-17T12:14:45Z"
  },
  {
    "title": "The Trump family's licensing",
    "description": "The Trump family just made a call on its next big business — Trump Mobile— a Trump-branded mobile phone service and smartphone.",
    "link": "https://www.businessinsider.com/trump-mobile-family-eric-licensing-phone-etf-media-2025-6",
    "timestamp": "2025-06-17T12:12:34Z"
  },
  {
    "title": "Trump says he’s seeking a “real end” to Iran-Israel conflict",
    "description": "Donald Trump told reporters on Air Force One he’s looking for a “real end” to the Iran-Israel conflict,",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/17/trump-says-hes-seeking-a-real-end-to-iran-israel-conflict",
    "timestamp": "2025-06-17T12:12:13Z"
  },
  {
    "title": "US Debt Holders Should Brace for Impact",
    "description": "With neither Congress nor the White House demonstrating even a modicum of fiscal discipline, the US Federal Reserve will almost certainly be forced into monetizing enough federal debt to prevent a default in the near future. That means higher inflation, and t…",
    "link": "https://www.project-syndicate.org/commentary/us-treasury-yield-increases-likely-under-current-policies-by-willem-h-buiter-and-anne-c-sibert-2025-06",
    "timestamp": "2025-06-17T12:11:48Z"
  },
  {
    "title": "Los tenedores de deuda estadounidense deben prepararse para el impacto",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/us-treasury-yield-increases-likely-under-current-policies-by-willem-h-buiter-and-anne-c-sibert-2025-06/spanish",
    "timestamp": "2025-06-17T12:11:48Z"
  },
  {
    "title": "PGA Tour announces Brian Rolapp as CEO and successor to Jay Monahan",
    "description": "Rolapp will lead both the PGA Tour's for-profit entity, PGA Tour Enterprises, the the competitive arm of the Tour.",
    "link": "https://www.nbcsports.com/golf/news/pga-tour-announces-brian-rolapp-as-ceo-and-successor-to-jay-monahan",
    "timestamp": "2025-06-17T12:11:07Z"
  },
  {
    "title": "Veterans hospitals can now deny care based on political affiliation & marital status",
    "description": "I’m not sure where to even start with this story. Again, Donald Trump hasn’t even been back in the White House for five full months, and we’ve already seen multiple stock market crashes, mass deportations, threats of an American invasion of Canada, threats of…",
    "link": "https://www.celebitchy.com/927158/veterans_hospitals_can_now_deny_care_based_on_political_affiliation_marital_status/",
    "timestamp": "2025-06-17T12:10:48Z"
  },
  {
    "title": "Trump’s Russia-China Pitch To The Kananaskis G-7 Meeting An Insult",
    "description": "The Kananaskis G-7 meeting talks about Trump's pitch to allow China and Russia entry in their group could create internal divisions and reduce their deterrent influence.",
    "link": "https://www.forbes.com/sites/andyjsemotiuk/2025/06/17/trumps-russia-china-pitch-to-the-kananaskis-g-7-meeting-an--insult/",
    "timestamp": "2025-06-17T12:10:16Z"
  },
  {
    "title": "Forbes Daily: New Phone Service Continues To Blur Lines For Trump",
    "description": "Today’s Forbes Daily covers Trump Mobile cell service, latest on Israel-Iran conflict, deportation to target large US cities, billionaire builds travel business and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/06/17/forbes-daily-new-phone-service-continues-to-blur-lines-for-trump/",
    "timestamp": "2025-06-17T12:08:05Z"
  },
  {
    "title": "Zelensky Worried Aid to Ukraine Will Decrease in Wake of Israel-Iran War",
    "description": "Ukrainian President Volodymyr Zelensky is worried that he will have to accept the fact that due to the escalation of the conflict between Israel and Iran, the United States will stop providing military assistance to Ukraine in favor of the …\nThe post Zelensky…",
    "link": "https://www.globalresearch.ca/zelensky-worried-aid-ukraine-decrease-wake-israel-iran-war/5891306",
    "timestamp": "2025-06-17T12:07:40Z"
  },
  {
    "title": "The Latest: Trump issues ominous warning to Tehran, urging residents to ‘evacuate’",
    "description": "In the span of about eight hours, President Donald Trump went from suggesting a nuclear deal with Iran remained “achievable” to urging Tehran’s 9.5 million...",
    "link": "https://www.yahoo.com/news/latest-trump-issues-ominous-warning-120737364.html",
    "timestamp": "2025-06-17T12:07:37Z"
  },
  {
    "title": "Self-Defence and Acceptable Murder: Netanyahu Dreams of Regime Change. Dr. Binoy Kampmark",
    "description": "Regarding Iran, the flexible scope of Israeli self-defence includes the killing of a thick layer of military leaders, preferably while sleeping in the bosom of their families.\nThe post Self-Defence and Acceptable Murder: Netanyahu Dreams of Regime Change. Dr.…",
    "link": "https://www.globalresearch.ca/self-defence-acceptable-murder-netanyahu-dreams-regime-change/5891294",
    "timestamp": "2025-06-17T12:06:28Z"
  },
  {
    "title": "‘I Don’t Care What She Said!’ Trump Rebukes His Own DNI Tulsi Gabbard, Insists Iran ‘Very Close’ to Getting a Nuke",
    "description": "President Donald Trump has rejected the assessment of his own Director of National Intelligence Tulsi Gabbard on Iran's nuclear capability.\nThe post ‘I Don’t Care What She Said!’ Trump Rebukes His Own DNI Tulsi Gabbard, Insists Iran ‘Very Close’ to Getting a …",
    "link": "https://www.mediaite.com/media/news/i-dont-care-what-she-said-trump-rebukes-his-own-dni-tulsi-gabbard-insists-iran-very-close-to-getting-a-nuke/",
    "timestamp": "2025-06-17T12:05:01Z"
  },
  {
    "title": "Trump denies reaching out to Iran, threatens to 'come down so hard'",
    "description": "\"I'm not too much in the mood to negotiate,\" President Donald Trump said on Tuesday.",
    "link": "https://abcnews.go.com/Politics/trump-denies-reaching-iran-threatens-hard-tehran-strikes/story?id=122920648",
    "timestamp": "2025-06-17T12:05:00Z"
  },
  {
    "title": "Want to Make Crypto Millions Like Trump? These 3 Top Altcoins Could Be Your Chance",
    "description": "In the latest financial disclosure form filed by Donald Trump, he has reported assets worth more than $1.6B. Interestingly, crypto ventures alone earned the US president over $57.3M – his second-highest source of income in 2024. Only income from his hospitali…",
    "link": "https://bitcoinist.com/make-crypto-millions-like-trump-top-3-altcoins/",
    "timestamp": "2025-06-17T12:04:29Z"
  },
  {
    "title": "Kraft Heinz to remove artificial dyes from U.S. products by end of 2027",
    "description": "Kraft Heinz said Tuesday that it will remove FD&C artificial dyes from its products by the end of 2027, and will not launch any new products in the U.S. containing those ingredients",
    "link": "https://www.nbcnews.com/business/business-news/kraft-heinz-remove-artificial-dyes-us-products-end-2027-rcna213436",
    "timestamp": "2025-06-17T12:04:06Z"
  },
  {
    "title": "Trump says he won’t call Minnesota Gov. Walz after lawmaker shootings because it would ‘waste time’",
    "description": "President Trump won't call Minnesota Gov. Tim Walz after the targeted shootings of two state lawmakers.",
    "link": "https://www.bostonherald.com/2025/06/17/trump-walz-minnesota-lawmakers-shot/",
    "timestamp": "2025-06-17T12:03:49Z"
  },
  {
    "title": "Israel’s 4th day of strikes against Tehran broaden as Trump issues ominous warning",
    "description": "Israel says its sweeping assault on Iran's top military leaders, uranium enrichment sites and nuclear scientists, is necessary to prevent its longtime adversary from getting any closer to building an atomic weapon.",
    "link": "https://www.pbs.org/newshour/world/israels-4th-day-of-strikes-against-tehran-broaden-as-trump-issues-ominous-warning",
    "timestamp": "2025-06-17T12:02:03Z"
  },
  {
    "title": "Kandi Burruss Defends Todd Chrisley Pardon Support",
    "description": "Kandi Burruss has addressed the backlash she received after she congratulated Todd Chrisley, who recently received a presidential pardon from Donald Trump and has since been released from prison. Fans quickly slammed Kandi for supporting Todd, but Kandi doubl…",
    "link": "https://mediatakeout.com/kandi-burruss-defends-todd-chrisley-pardon-support/",
    "timestamp": "2025-06-17T12:00:57Z"
  },
  {
    "title": "Judge Dismisses Lawsuit Against Trump by Columbia University Faculty",
    "description": "\"Our democracy cannot very well function if individual judges issue extraordinary relief to every plaintiff who clamors to object to executive action.\"\nThe post Judge Dismisses Lawsuit Against Trump by Columbia University Faculty first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/06/judge-dismisses-lawsuit-against-trump-by-columbia-university-faculty/",
    "timestamp": "2025-06-17T12:00:55Z"
  },
  {
    "title": "Trump Mobile and the T1 Phone Don't Make Any Sense, Even for Trump Fans",
    "description": "Commentary: If you make a splashy announcement and expect to be taken seriously, at least hire a proofreader and get your specs correct.",
    "link": "https://www.cnet.com/tech/mobile/trump-mobile-and-the-t1-phone-dont-make-any-sense-even-for-trump-fans/",
    "timestamp": "2025-06-17T12:00:09Z"
  },
  {
    "title": "Trump’s Tariffs Risk Damage to Service Sectors",
    "description": "“President Donald Trump says U.S. factories hollowed out by rapacious foreign competition can produce well-paying new jobs only if they are protected by the highest tariffs since the 1930s,” the Washington Post reports. “But those",
    "link": "https://politicalwire.com/2025/06/17/trumps-tariffs-risk-damage-to-service-sectors/",
    "timestamp": "2025-06-17T12:00:00Z"
  },
  {
    "title": "Forget red white and blue, Trump’s America is shamelessly paved in fool's gold",
    "description": "It's shamelessly defiant against design trends.",
    "link": "https://www.creativebloq.com/design/branding/forget-red-white-and-blue-trumps-america-is-shamelessly-paved-in-fools-gold",
    "timestamp": "2025-06-17T12:00:00Z"
  },
  {
    "title": "Day 1,210 of WW3. Brave Sir Stinky ran away . . . from meeting Zelenskyy at the G7 summit. Orc cluster-munition missile strike hits Kyiv, and Mordor repatriates the bodies of UAF troops - including dead orcs. This is your Tuesday Ukraine War thread [News]",
    "description": "Day 1,210 of WW3. Brave Sir Stinky ran away . . . from meeting Zelenskyy at the G7 summit. Orc cluster-munition missile strike hits Kyiv, and Mordor repatriates the bodies of UAF troops - including dead orcs. This is your Tuesday Ukraine War thread",
    "link": "https://www.fark.com/comments/13709552/Day-1210-of-WW3-Brave-Sir-Stinky-ran-away-from-meeting-Zelenskyy-at-G7-summit-Orc-cluster-munition-missile-strike-hits-Kyiv-Mordor-repatriates-bodies-of-UAF-troops-including-dead-orcs-This-is-your-Tuesday-Ukraine-War-thread",
    "timestamp": "2025-06-17T12:00:00Z"
  },
  {
    "title": "Three Priorities for Science Philanthropy (Blog)",
    "description": "How philanthropy can help sustain scientific discovery in a changing research landscape.",
    "link": "https://ssir.org/articles/entry/science-philanthropy-responds-to-deep-government-cuts",
    "timestamp": "2025-06-17T12:00:00Z"
  },
  {
    "title": "Protecting the Public During the Violent Riots in Los Angeles",
    "description": "Protesters in Los Angeles once again launch violent assaults this weekend against U.S. Immigration and Customs Enforcement and law enforcement officers. Agitators at the Federal... Read More\nThe post Protecting the Public During the Violent Riots in Los Angel…",
    "link": "https://www.dailysignal.com/2025/06/17/protecting-the-public-during-the-violent-riots-in-los-angeles/",
    "timestamp": "2025-06-17T12:00:00Z"
  },
  {
    "title": "The Perfect Astronaut Is Changing",
    "description": "To get to Mars, NASA might finally need to hire explorers.",
    "link": "https://www.theatlantic.com/science/archive/2025/06/perfect-astronaut-mars/683202/",
    "timestamp": "2025-06-17T12:00:00Z"
  },
  {
    "title": "MAGA 'Prophet' Hank Kunneman Is Rewriting His Prophecies In Real Time",
    "description": "After prophesying to Mike Lindell that he would win the defamation lawsuit filed against him and be avenged by God, self-proclaimed \"prophet\" Hank Kunneman now claims that Lindell will win on appeal.",
    "link": "https://www.peoplefor.org/rightwingwatch/maga-prophet-hank-kunneman-rewriting-his-prophecies-real-time",
    "timestamp": "2025-06-17T12:00:00Z"
  },
  {
    "title": "How is Pope Leo XIV related to Madonna, Justin Bieber, and Angelina Jolie? The surprising truth hidden in his family tree",
    "description": "Pope Leo XIV, the first American pontiff, has shocked the world not with doctrine, but with DNA. A genealogical study by The New York Times reveals he is distantly related to celebrities like Madonna, Justin Bieber, and Angelina Jolie, tracing his lineage bac…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/how-is-pope-leo-xiv-related-to-madonna-justin-bieber-and-angelina-jolie-the-surprising-truth-hidden-in-his-family-tree/articleshow/121909812.cms",
    "timestamp": "2025-06-17T11:57:22Z"
  },
  {
    "title": "David Hogg Says Dems Backing Iran War Should Be Primaried",
    "description": "The former DNC vice chair said that Democrats must present a united front against \"Trump and his war.\"",
    "link": "https://www.newsweek.com/david-hogg-dems-backing-war-primaried-2086558",
    "timestamp": "2025-06-17T11:56:41Z"
  },
  {
    "title": "OpenAI signs $200 million Pentagon deal",
    "description": "OpenAI was awarded $200 million to “prototype frontier AI capabilities,” the US Department of Defense has announced Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619521-openai-awarded-pentagon-contract/",
    "timestamp": "2025-06-17T11:56:01Z"
  },
  {
    "title": "Trump’s America Teeters: Protests, Violence, Mexico Tensions, and Iran-Israel Trap Threaten Collapse",
    "description": "The United States is engulfed in a multifaceted political crisis, marked by widespread protests, escalating political violence, and provocative foreign policy moves. As President Donald Trump, in his second term as the 47th president, pursues an aggressive ag…",
    "link": "https://www.globalresearch.ca/trump-america-teeters-protests-violence/5891221",
    "timestamp": "2025-06-17T11:52:57Z"
  },
  {
    "title": "Bitcoin Price Holds Steady Amid Iran Conflict Fears",
    "description": "Analysts told Decrypt they expect Bitcoin to remain stable until there is more clarity about the U.S. response to Middle East tensions.",
    "link": "https://decrypt.co/325536/bitcoin-price-holds-steady-amid-iran-conflict-fears",
    "timestamp": "2025-06-17T11:52:13Z"
  },
  {
    "title": "‘He Can’t Be’: Doc Rivers Explains Why Trump Isn’t The 1 Insult Everyone Uses",
    "description": "The NBA legend, a Democrat, also named “the greatest marketing coup in the history of marketing,” that Republicans have pulled off.",
    "link": "https://www.huffpost.com/entry/doc-rivers-donald-trump-insult_n_68513875e4b0e06f8e60af40",
    "timestamp": "2025-06-17T11:51:54Z"
  },
  {
    "title": "The Buck Stops Somewhere Over There",
    "description": "Judicial nominations are one area in which it doesn't much matter whether one holds a unitary executive theory of the presidency or not. In other cases, it does. For example, if an FCC chairman were to grossly abuse his office, raising or dropping investigati…",
    "link": "https://prawfsblawg.blogs.com/prawfsblawg/2025/06/the-buck-stops-somewhere-over-there.html",
    "timestamp": "2025-06-17T11:51:13Z"
  },
  {
    "title": "Trump Jr claims trans ‘movement’ is ‘most violent domestic terror threat’",
    "description": "Donald Trump Jr, son of US president Donald Trump, has baselessly claimed trans people are the “most violent domestic terror threat” in the US, just days after a “right-leaning” preacher was arrested for allegedly murdering a Democrat politician and her husba…",
    "link": "https://www.thepinknews.com/2025/06/17/trump-jr-trans-vance-boelter-melissa-hortman/",
    "timestamp": "2025-06-17T11:50:46Z"
  },
  {
    "title": "EU Top Envoy Warns of Broader Conflict If US Is Involved in Iran",
    "description": "US military involvement in the spiraling conflict between Iran and Israel risks spreading throughout the Middle East, the European Union’s top diplomat warned on Tuesday.",
    "link": "https://financialpost.com/pmn/business-pmn/eu-top-envoy-warns-of-broader-conflict-if-us-is-involved-in-iran",
    "timestamp": "2025-06-17T11:50:34Z"
  },
  {
    "title": "NAACP won't invite Trump to convention, breaking a 116-year tradition (Niha Masih/Washington Post)",
    "description": "Niha Masih / Washington Post:\nNAACP won't invite Trump to convention, breaking a 116-year tradition  —  The civil rights group condemned what it said was President Donald Trump's attempt to undermine democracy.  It has invited sitting presidents since 1909.  …",
    "link": "https://www.memeorandum.com/250617/p23",
    "timestamp": "2025-06-17T11:50:01Z"
  },
  {
    "title": "‘I have never seen such open corruption’: Trump’s crypto deals and loosening of rules shock observers",
    "description": "After courtship with crypto industry, president now profits immensely from a sector he once said ‘seems like a scam’\nCryptocurrency multibillionaire Justin Sun could barely contain his glee.\nLast month, Sun publicly flaunted a $100,000 Donald Trump-branded wa…",
    "link": "https://biztoc.com/x/f689e0fc6274d141",
    "timestamp": "2025-06-17T11:49:23Z"
  },
  {
    "title": "Trump says he won't call Minnesota Gov. Walz after lawmaker shootings because it would 'waste time'",
    "description": "President Donald Trump said Tuesday that he he won’t call Minnesota Gov. Tim Walz after the targeted shootings of two state lawmakers because it would “waste...",
    "link": "https://www.yahoo.com/news/trump-says-wont-call-minnesota-114745339.html",
    "timestamp": "2025-06-17T11:47:45Z"
  },
  {
    "title": "Tuesday: Hili dialogue",
    "description": "Welcome to the Cruelest Day: Tuesday, June 17, 2025, and National Apple Strudel Day.  Here is an apple strudel and an Einspänner (coffee) I consumed at one of the great coffee shops in Vienna, the pink-themed Aida chain, Home of Strudel (photo taken in Octobe…",
    "link": "https://whyevolutionistrue.com/2025/06/17/tuesday-hili-dialogue-534/",
    "timestamp": "2025-06-17T11:45:54Z"
  },
  {
    "title": "Trump Mobile Is Now a Thing — Because Why Not",
    "description": "The other day we saw a trademark filing for “Trump Mobile,” and turns out it was the real deal as it has been officially announced.",
    "link": "https://www.androidheadlines.com/2025/06/trump-mobile-is-now-a-thing-because-why-not.html",
    "timestamp": "2025-06-17T11:44:52Z"
  },
  {
    "title": "Minnesota shooting suspect had over 45 Democrat politicians on his list of potential targets",
    "description": "Investigators say Vance Boelter appeared to spend months preparing for the shootings — the latest in a string of political attacks across the U.S.",
    "link": "https://fortune.com/2025/06/17/minnesota-shooting-suspect-vance-boelter-45-democrat-politicians-list-targets/",
    "timestamp": "2025-06-17T11:42:35Z"
  },
  {
    "title": "Impeach Trump? Is that a Solution for Anything?",
    "description": "We are witnessing, like clockwork, a drive to blame Trump and his people for the transformation of the United States into a police state and to set up the Democratic Party as saviors.\nThe post Impeach Trump? Is that a Solution for Anything? appeared first on …",
    "link": "https://www.globalresearch.ca/impeach-trump-solution-anything/5891159",
    "timestamp": "2025-06-17T11:42:10Z"
  },
  {
    "title": "Trump Lashes Out at CNN on Air Force One When Kaitlan Collins Displeases Him",
    "description": "President Donald Trump lashed out at CNN when he became displeased with anchor and White House correspondent Kaitlan Collins over the questions she was asking.\nThe post Trump Lashes Out at CNN on Air Force One When Kaitlan Collins Displeases Him first appeare…",
    "link": "https://www.mediaite.com/media/news/trump-lashes-out-at-cnn-on-air-force-one-when-kaitlan-collins-displeases-him/",
    "timestamp": "2025-06-17T11:42:05Z"
  },
  {
    "title": "Israel and Iran trade strikes as hostilities extend into fifth day",
    "description": "Concerns grow that the conflict could spark a wider regional war.",
    "link": "https://www.aljazeera.com/news/2025/6/17/israel-and-iran-trade-strikes-as-hostilities-extend-into-fifth-day",
    "timestamp": "2025-06-17T11:41:16Z"
  },
  {
    "title": "Trump’s Moment of Truth",
    "description": "Playbook: “President Donald Trump will gather his closest military advisers in the Situation Room this morning as he weighs perhaps the most consequential decision of his presidency: whether to join Israel’s bombardment of Iran. Trump’s",
    "link": "https://politicalwire.com/2025/06/17/trumps-moment-of-truth/",
    "timestamp": "2025-06-17T11:37:52Z"
  },
  {
    "title": "IDF General: War Will Not End Until Missile, Nuclear Threat Destroyed",
    "description": "Israel will not stop fighting Iran until it has destroyed the Iranian regime’s ballistic missiles and its nuclear facilities, Israel Defense Forces (IDF) Operations Directorate chief Maj. Gen. Oded Basiuk said Tuesday. Basiuk spoke as speculation mounted abou…",
    "link": "https://www.breitbart.com/middle-east/2025/06/17/idf-general-war-will-not-end-until-missile-nuclear-threat-destroyed/",
    "timestamp": "2025-06-17T11:37:17Z"
  },
  {
    "title": "Trump Gives Cryptic Reason For His Call For Tehran's Immediate Evacuation",
    "description": "The president shut down an earlier assessment by his Director of National Intelligence Tulsi Gabbard on Iran's nuclear program: \"I don't care what she said.\"",
    "link": "https://www.huffpost.com/entry/trump-cryptic-tehran-evacuation_n_68512bd4e4b0e06f8e609e8d",
    "timestamp": "2025-06-17T11:37:10Z"
  },
  {
    "title": "Former Coast Guard officer arrested after allegedly threatening to assassinate Trump: FBI",
    "description": "Virginia resident Peter Stinson allegedly made graphic threats against Trump involving guns, poisoning and even knives on multiple social media platforms.",
    "link": "https://nypost.com/2025/06/17/us-news/former-coast-guard-officer-arrested-after-allegedly-threatening-to-assassinate-trump-fbi/",
    "timestamp": "2025-06-17T11:36:09Z"
  },
  {
    "title": "Now we are six: G7 leaders try to salvage their summit after Trump’s early exit",
    "description": "Six of the Group of Seven leaders will try to show the club still has clout despite the early departure of President Donald Trump.",
    "link": "https://www.bostonherald.com/2025/06/17/g7-leaders-ukraine-without-trump/",
    "timestamp": "2025-06-17T11:35:23Z"
  },
  {
    "title": "Trump says he's looking at something 'better than a ceasefire'",
    "description": "President Donald Trump unexpectedly departed the Group of Seven summit yesterday and said he was heading back to Washington to deal with conflicts in the Middle East.",
    "link": "https://www.nbcnews.com/politics/politics-news/live-blog/trump-administration-tariffs-iran-israel-live-updates-rcna212918",
    "timestamp": "2025-06-17T11:35:04Z"
  },
  {
    "title": "Trump at 1AM Posts 'Stay Tuned!' on US Action in Iran, After Advising Citizens of Tehran to Evacuate (Troy Matthews/MeidasTouch News)",
    "description": "Troy Matthews / MeidasTouch News:\nTrump at 1AM Posts ‘Stay Tuned!’ on US Action in Iran, After Advising Citizens of Tehran to Evacuate  —  Trump is making early morning posts announcing that Iran accepting a nuclear deal “would have saved a lot of lives”  —  …",
    "link": "https://www.memeorandum.com/250617/p13",
    "timestamp": "2025-06-17T11:35:00Z"
  },
  {
    "title": "Trump 'Reamed Out' Hegseth for Flop Birthday Parade: Author (Julia Ornedo/The Daily Beast)",
    "description": "Julia Ornedo / The Daily Beast:\nTrump ‘Reamed Out’ Hegseth for Flop Birthday Parade: Author  —  P***ED OFF  —  The president wanted a “menacing” military parade but got the opposite instead, Michael Wolff tells The Daily Beast Podcast.  —  President Donald Tr…",
    "link": "https://www.memeorandum.com/250617/p15",
    "timestamp": "2025-06-17T11:35:00Z"
  },
  {
    "title": "Dems Make ‘Political Stunt’ Padilla A Martyr While Ignoring Victims’ Pain",
    "description": "Padilla pulled his stunt at the same time as a hearing on 'sanctuary' states and the governors who run them.",
    "link": "https://thefederalist.com/2025/06/17/dems-make-political-stunt-padilla-a-martyr-while-ignoring-victims-pain/",
    "timestamp": "2025-06-17T11:30:49Z"
  },
  {
    "title": "‘Big Risk’—Surprise Bitcoin Price Crash Fear Emerges",
    "description": "Analysts are warning that the rising risk of Iran closing the Strait of Hormuz key global oil market passage could spark a fresh round of crypto volatility...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/06/17/big-risk-surprise-bitcoin-price-crash-fear-emerges/",
    "timestamp": "2025-06-17T11:30:47Z"
  },
  {
    "title": "US Stock Market’s Outperformance Is Over, BofA Survey Shows",
    "description": "Global stocks will beat US equities over the next five years, according to Bank of America Corp.’s latest fund manager survey, adding evidence that investors increasingly see America’s market dominance as coming to an end.",
    "link": "https://financialpost.com/pmn/business-pmn/us-stock-markets-outperformance-is-over-bofa-survey-shows",
    "timestamp": "2025-06-17T11:30:22Z"
  },
  {
    "title": "Trump and Burgum are erasing history, one National Park at a time (Opinion)",
    "description": "Interior Secretary Doug Burgum issued an order to counter what he calls a revisionist movement that “seeks to undermine the remarkable achievements of the United States by casting its founding principles and historical milestones in a negative light.”",
    "link": "https://www.denverpost.com/2025/06/17/trump-burgum-erasing-history-national-parks/",
    "timestamp": "2025-06-17T11:30:17Z"
  },
  {
    "title": "Why Assad’s Fall Made Israel’s Large-Scale Air War With Iran Possible",
    "description": "For decades Israel sought U.S. assistance to attack Iran's nuclear program. But now it's going solo. Here's why the fall of Assad in Syria changed the strategic calculus.",
    "link": "https://www.forbes.com/sites/sebastienroblin/2025/06/17/why-assads-fall-made-israels-large-scale-air-war-with-iran-possible/",
    "timestamp": "2025-06-17T11:30:12Z"
  },
  {
    "title": "How Ivermectin Became Right-Wing Aspirin",
    "description": "Once a suspect COVID treatment, now a cure for everything",
    "link": "https://www.theatlantic.com/health/archive/2025/06/ivermectin-miracle-drug-right-wing-aspirin/683197/",
    "timestamp": "2025-06-17T11:30:00Z"
  }
]