[
  {
    "title": "Trump celebrates 100 days in office with campaign-style rally",
    "description": "Donald Trump promised Tuesday that he is just getting started as he marked the radical and vengeful beginning of a presidency that has shaken the world and destabilized the United States.",
    "link": "https://www.hurriyetdailynews.com/trump-celebrates-100-days-in-office-with-campaign-style-rally-208629",
    "timestamp": "2025-04-30T05:48:15Z"
  },
  {
    "title": "Switzerland Tourism's Hilarious \"Thank You Note\" to President Donald Trump - YouTube, Apr 2025",
    "description": null,
    "link": "https://www.youtube.com/supported_browsers?next_url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D-YSW5nk6Qm0",
    "timestamp": "2025-04-30T05:47:01Z"
  },
  {
    "title": "Eric Trump: 'If banks don’t watch what’s coming, they’ll be extinct in ten years'",
    "description": "\"The modern financial system is broken, it's slow, it's expensive,\" the executive vice president of the Trump Organization told CNBC.",
    "link": "https://www.cnbc.com/2025/04/30/eric-trump-if-banks-dont-watch-whats-coming-theyll-be-extinct-in-ten-years-.html",
    "timestamp": "2025-04-30T05:46:27Z"
  },
  {
    "title": "Donald Trump officials eye changes to Biden's AI chip export rule, sources say",
    "description": "The Framework for Artificial Intelligence Diffusion, as the rule is called, was issued by the US Department of Commerce in January, a week before the end of the administration of former President Joe Biden. Companies must comply with its restrictions starting…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/donald-trump-officials-eye-changes-to-bidens-ai-chip-export-rule-sources-say/articleshow/120753738.cms",
    "timestamp": "2025-04-30T05:46:27Z"
  },
  {
    "title": "How Much Have Elon Musk and the DOGE Boys Cost Us?",
    "description": "Back when Elon Musk was just getting his “Department of Government Efficiency” (DOGE) off the ground, he was boasting that he would eliminate $2 trillion in annual spending that was waste. That’s almost one-third of the federal budget. Needless to say, this w…",
    "link": "https://www.counterpunch.org/2025/04/30/how-much-have-elon-musk-and-the-doge-boys-cost-us/",
    "timestamp": "2025-04-30T05:45:44Z"
  },
  {
    "title": "Decatur Schools Board of Education unanimously votes to reinstate DEI policies",
    "description": "The City Schools of Decatur Board of Education unanimously voted to restore all Equity, Diversity, and Inclusion policies with no conditions.",
    "link": "https://www.wsbtv.com/news/local/dekalb-county/decatur-schools-board-education-unanimously-votes-reinstate-dei-policies/NBAT74TR55CNNIV3W6KYFCDDTQ/",
    "timestamp": "2025-04-30T05:45:35Z"
  },
  {
    "title": "Financial markets may be the last guardrail on Trump",
    "description": "WASHINGTON - Since returning to the White House, Donald Trump has ushered in sweeping changes to international geopolitics and US government administration with little regard for norms that have constrained predecessors.",
    "link": "https://www.bangkokpost.com/business/general/3014735/financial-markets-may-be-the-last-guardrail-on-trump",
    "timestamp": "2025-04-30T05:45:00Z"
  },
  {
    "title": "Pakistan says India planning strike as tensions soar over Kashmir attack",
    "description": "Pakistan's information minister said Wednesday that Islamabad had \"credible intelligence\" that India was planning an imminent military strike and he vowed a \"decisive response\", as worries of spiralling conflict grew over a deadly attack in Kashmir.",
    "link": "https://www.hurriyetdailynews.com/pakistan-says-india-planning-strike-as-tensions-soar-over-kashmir-attack-208628",
    "timestamp": "2025-04-30T05:43:53Z"
  },
  {
    "title": "China's export orders dip in April as Trump's tariffs begin to bite",
    "description": "Monthly surveys of Chinese factory managers shows export orders slowed in April as higher tariffs on U.S. imports began to kick in",
    "link": "https://abcnews.go.com/Business/wireStory/chinas-export-orders-dip-april-trumps-tariffs-begin-121305426",
    "timestamp": "2025-04-30T05:42:17Z"
  },
  {
    "title": "Xi's dream may be dying and Trump is not his biggest problem",
    "description": "The real battleground of the current trade war might be China's domestic economy",
    "link": "https://www.bbc.com/news/articles/cpq7y8vl55yo",
    "timestamp": "2025-04-30T05:40:17Z"
  },
  {
    "title": "Carney vows to lead 'united Canada' against Trump after election win",
    "description": "Prime Minister Mark Carney pledged Tuesday to confront U.S. President Donald Trump with the \"overwhelming positive force\" of a united Canada after a dramatic election win that earned the Liberal Party a minority government.",
    "link": "https://www.hurriyetdailynews.com/carney-vows-to-lead-united-canada-against-trump-after-election-win-208627",
    "timestamp": "2025-04-30T05:39:52Z"
  },
  {
    "title": "ABC News’ Terry Moran Challenges Trump To ‘Pick’ Up Phone And Order Alleged Gangbanger Returned",
    "description": "ABCs Terry Morgan challenged Trump to \"pick\" up the phone and call El Salvador's President to demand the return of illegal migrant Kilmar Armando Abrego Garcia.",
    "link": "https://dailycaller.com/2025/04/30/terry-moran-donald-trump-kilmar-abrego-garcia-deportation-el-salvador/",
    "timestamp": "2025-04-30T05:38:07Z"
  },
  {
    "title": "AirBorne flaws can lead to fully hijack Apple devices",
    "description": "Vulnerabilities in Apple’s AirPlay protocol and SDK exposed Apple and third-party devices to attacks, including remote code execution. Oligo Security found serious flaws, collectively tracked as AirBorne, in Apple’s AirPlay protocol and SDK, affecting Apple a…",
    "link": "https://securityaffairs.com/177225/hacking/airborne-flaws-can-lead-to-fully-hijack-apple-devices.html",
    "timestamp": "2025-04-30T05:36:57Z"
  },
  {
    "title": "US threatens to quit Russia-Ukraine effort unless 'concrete proposals'",
    "description": "Secretary of State Marco Rubio warned on Tuesday that the United States would give up on mediation unless Russia and Ukraine put forward \"concrete proposals,\" as U.S. patience wanes on an early priority for Donald Trump.",
    "link": "https://www.hurriyetdailynews.com/us-threatens-to-quit-russia-ukraine-effort-unless-concrete-proposals-208626",
    "timestamp": "2025-04-30T05:36:42Z"
  },
  {
    "title": "FULL TRANSCRIPT: Trump's exclusive 100 days broadcast interview with ABC News - ABC News",
    "description": "FULL TRANSCRIPT: Trump's exclusive 100 days broadcast interview with ABC NewsABC News Trump discusses first 100 days of historic presidency in exclusive ABC interviewABC News Watch 'President Trump the First 100 Days: The Interview in the Oval Office' Tuesday…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177215413",
    "timestamp": "2025-04-30T05:33:02Z"
  },
  {
    "title": "Poll: Moderates Shift Towards Trump on Immigration Policy",
    "description": "Swing-voting moderates are rallying to President Donald Trump as Democrats continue their desperate opposition to the enforcement of the nation's popular immigration laws.\nThe post Poll: Moderates Shift Towards Trump on Immigration Policy appeared first on Br…",
    "link": "https://www.breitbart.com/politics/2025/04/29/poll-moderates-shift-towards-trump-on-immigration/",
    "timestamp": "2025-04-30T05:32:07Z"
  },
  {
    "title": "Auto giant Volkswagen posts 37% drop in first-quarter profit as Trump tariffs jolt industry",
    "description": "Europe's biggest carmaker reported operating profit of 2.9 billion euros ($3.3 billion) for the first three months of the year.",
    "link": "https://www.cnbc.com/2025/04/30/volkswagen-q1-earnings-2025.html",
    "timestamp": "2025-04-30T05:30:12Z"
  },
  {
    "title": "As Elon Musk gained power in Washington, his popularity has fallen, an AP-NORC poll finds",
    "description": "Elon Musk spent years building cachet as a business titan and tech visionary, brushing aside critics and sceptics to become the richest person on the planet. Read full story",
    "link": "https://www.thestar.com.my/tech/tech-news/2025/04/30/as-elon-musk-gained-power-in-washington-his-popularity-has-fallen-an-ap-norc-poll-finds",
    "timestamp": "2025-04-30T05:30:00Z"
  },
  {
    "title": "US threatens to quit Russia-Ukraine effort unless 'concrete proposals'",
    "description": "Secretary of State Marco Rubio warned on Tuesday that the United States would give up on mediation unless Russia and Ukraine put forward \"concrete proposals,\" as US patience wanes on an early priority for Donald Trump. The United States already put together a…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-threatens-to-quit-russia-ukraine-effort-unless-concrete-proposals/articleshow/120753292.cms",
    "timestamp": "2025-04-30T05:28:19Z"
  },
  {
    "title": "Asian shares rise after gains on Wall Street as corporate profits pile higher",
    "description": "Shares are mixed in Asia after U.S. stocks rose again as companies reported stronger-than-expected profits.",
    "link": "https://www.clickondetroit.com/business/2025/04/30/asian-shares-rise-after-gains-on-wall-street-as-corporate-profits-pile-higher/",
    "timestamp": "2025-04-30T05:26:51Z"
  },
  {
    "title": "Montana Republicans dominated the 2024 election. How did Democrats gain power at the statehouse?",
    "description": "Montana Republicans dominated in the fall election, but moderates in the party have shared power with Democrats in the statehouse",
    "link": "https://abcnews.go.com/Politics/wireStory/montana-republicans-dominated-2024-election-democrats-gain-power-121305423",
    "timestamp": "2025-04-30T05:26:19Z"
  },
  {
    "title": "Equinor Earnings Slide on Oil Trading Weakness, LNG Outage",
    "description": "Equinor ASA said first-quarter profit fell from a year earlier amid weaker oil trading, lower gas prices and a prolonged outage in northern Norway.",
    "link": "https://financialpost.com/pmn/business-pmn/equinor-earnings-slide-on-oil-trading-weakness-lng-outage",
    "timestamp": "2025-04-30T05:21:58Z"
  },
  {
    "title": "Trump Administration Targets Biden-Era AI Chip Curbs, Could Scrap Country Tiers And Tighten Access To Nvidia's H100 Chips: Report",
    "description": "The Donald Trump administration is reportedly considering sweeping changes to Joe Biden-era restrictions on AI chip exports.\nWhat Happened: Trump officials are weighing a significant overhaul of the Framework for Artificial Intelligence Diffusion, a rule issu…",
    "link": "https://biztoc.com/x/98e5b0b5fca9532c",
    "timestamp": "2025-04-30T05:18:24Z"
  },
  {
    "title": "Trump's Call To Jeff Bezos Over Amazon's Tariff Display Earns Peter Schiff's Ire: 'Type Of Stuff You Might Expect To See In China'",
    "description": "Economist Peter Schiff criticized President Donald Trump on Tuesday for reportedly pressuring Amazon.com Inc. (NASDAQ:AMZN) founder Jeff Bezos to abandon plans that would show consumers the cost of tariffs on product prices.\nWhat Happened: “Apparently, Trump …",
    "link": "https://biztoc.com/x/d112ec00a4c16d01",
    "timestamp": "2025-04-30T05:18:22Z"
  },
  {
    "title": "Unpredictable and disruptive or canny and persistent - what exactly is Trump's foreign policy?",
    "description": "So, after 100 days of Donald Trump the big question for me remains - does the US president have a coherent foreign policy or is he just winging it?",
    "link": "https://news.sky.com/story/unpredictable-and-disruptive-or-canny-and-persistent-what-exactly-is-donald-trumps-foreign-policy-13358374",
    "timestamp": "2025-04-30T05:17:00Z"
  },
  {
    "title": "Trump says 'China probably will eat those tariffs'; defends his trade war moves",
    "description": "President Trump defended his aggressive trade policies toward China, asserting Beijing would likely absorb the tariffs despite concerns about rising prices for American consumers. He dismissed economic anxieties, claiming the tariffs are a necessary reset of …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-china-probably-will-eat-those-tariffs-defends-his-trade-war-moves/articleshow/120752266.cms",
    "timestamp": "2025-04-30T05:16:25Z"
  },
  {
    "title": "Trump Reiterates That Putin Wants to Stop Ukraine Conflict",
    "description": "MOSCOW (Sputnik) - Russian President Vladimir Putin is ready to end the conflict in Ukraine, US President Donald Trump said in an interview with ABC News, aired on his 100th day in office.",
    "link": "https://sputnikglobe.com/20250430/trump-reiterates-that-putin-wants-to-stop-ukraine-conflict-1121955385.html",
    "timestamp": "2025-04-30T05:15:25Z"
  },
  {
    "title": "US threatens to quit Russia-Ukraine effort unless 'concrete proposals'",
    "description": "Secretary of State Marco Rubio warned on Tuesday that the United States would give up on mediation unless Russia and Ukraine put forward \"concrete proposals,\" as US patience wanes on an early priority for Donald Trump. The United States already put together a…",
    "link": "https://timesofindia.indiatimes.com/world/us/us-threatens-to-quit-russia-ukraine-effort-unless-concrete-proposals/articleshow/120752715.cms",
    "timestamp": "2025-04-30T05:13:56Z"
  },
  {
    "title": "Takeaways from Canada's election: America's northern ally rejects Trump after he dominates race - AP News",
    "description": "Takeaways from Canada's election: America's northern ally rejects Trump after he dominates raceAP News Canada election results live: Carney vows ‘Trump will never break us’ as Liberal Party falls short of majorityThe Independent Mark Carney prepares for talks…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177215205",
    "timestamp": "2025-04-30T05:12:36Z"
  },
  {
    "title": "China’s export orders dip in April as Trump’s tariffs begin to bite",
    "description": "Higher tariffs on U.S. imports of products from China appear to be taking a toll on the world’s second-largest economy, according to monthly surveys of Chinese factory managers released Wednesday. The official survey by the China Federation of Logistics and P…",
    "link": "https://financialpost.com/pmn/chinas-export-orders-dip-in-april-as-trumps-tariffs-begin-to-bite",
    "timestamp": "2025-04-30T05:12:31Z"
  },
  {
    "title": "Trump says voters unhappy about the economy and his China trade war should deal with it because 'they did sign up for it actually'",
    "description": "\"Well, they did sign up for it, actually. And this is what I campaigned on,\" President Donald Trump said of the reciprocal tariffs he imposed.\nRoberto Schmidt/AFP via Getty Images\nPresident Donald Trump's tariff policy has sparked fear and uncertainty in the …",
    "link": "https://biztoc.com/x/29a7c0e768699a3e",
    "timestamp": "2025-04-30T05:07:20Z"
  },
  {
    "title": "Murphy: 'Donald Trump Is Trying to Destroy Our Democracy'",
    "description": "Senator Chris Murphy (D-CT) claimed Tuesday on CNN’s \"Anderson Cooper 360\" that President Donald Trump \"is trying to destroy our democracy.\"\nThe post Murphy: ‘Donald Trump Is Trying to Destroy Our Democracy’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/04/29/murphy-donald-trump-is-trying-to-destroy-our-democracy/",
    "timestamp": "2025-04-30T05:06:42Z"
  },
  {
    "title": "Analysis-Investors seek new tariff-proof market niches as Wall St chaos hits Europe",
    "description": "LONDON (Reuters) -Investors who rushed out of Wall Street during a month of U.S. policy shocks that raised European growth risks are turning their attention ...",
    "link": "https://finance.yahoo.com/news/analysis-investors-seek-tariff-proof-050409946.html",
    "timestamp": "2025-04-30T05:04:09Z"
  },
  {
    "title": "Pedro Almodóvar calls Trump ‘greatest mistake of our time’ as he receives Chaplin award",
    "description": "Celebrated Spanish director slams Trump administration’s crackdown on immigrants and trans rights",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/pedro-almodovar-donald-trump-greatest-mistake-chaplin-award-b2741989.html",
    "timestamp": "2025-04-30T05:03:24Z"
  },
  {
    "title": "Sanaa, Yemen: UK launches strikes against Houthis, in first joint US operation under Trump",
    "description": "Britain’s military launched airstrikes against Houthi targets in Yemen on Tuesday with US forces, its defense ministry said – the first public acknowledgment of a joint operation since the Trump administration escalated the US campaign against the militant gr…",
    "link": "https://www.cnn.com/2025/04/30/middleeast/uk-strike-houthis-yemen-intl-hnk/index.html",
    "timestamp": "2025-04-30T05:02:59Z"
  },
  {
    "title": "Loss of FEMA Program Spells Disaster for Hundreds of Communities and Projects",
    "description": "The textile mills that once served as the backbone of Mount Pleasant, North Carolina, have long been shuttered, and officials believed federal money would be key to the town’s overdue revitalization. They hoped an improved stormwater drainage system and secur…",
    "link": "https://www.insurancejournal.com/news/national/2025/04/30/821900.htm",
    "timestamp": "2025-04-30T05:02:30Z"
  },
  {
    "title": "US threatens to quit Russia-Ukraine effort unless ‘concrete proposals’",
    "description": "Secretary of State Marco Rubio warned on Tuesday that the United States would give up on mediation unless Russia and Ukraine put forward “concrete proposals,” as US patience wanes on an early priority for Donald Trump. The US president had vowed to end the wa…",
    "link": "https://www.digitaljournal.com/world/us-threatens-to-quit-russia-ukraine-effort-unless-concrete-proposals/article",
    "timestamp": "2025-04-30T05:02:21Z"
  },
  {
    "title": "Tariff talks with India going great, think will have deal: Trump",
    "description": "US President Trump optimistic about trade deal with India, negotiations progressing well, potential for job creation and growth.",
    "link": "https://www.thehindubusinessline.com/news/national/tariff-talks-with-india-going-great-think-will-have-deal-trump/article69507895.ece",
    "timestamp": "2025-04-30T05:02:16Z"
  },
  {
    "title": "Trump says voters unhappy about the economy and his China trade war should deal with it because 'they did sign up for it actually'",
    "description": "\"Well, they did sign up for it, actually. And this is what I campaigned on,\" Trump said of the reciprocal tariffs he imposed.",
    "link": "https://www.businessinsider.com/trump-voters-signed-up-for-tariffs-when-they-backed-him-2025-4",
    "timestamp": "2025-04-30T05:02:01Z"
  },
  {
    "title": "Don’t Let Trump Get Away with Deep Sea Mining",
    "description": "Once again, Donald Trump is taking steps to destroy our planet. He signed an executive order fast-tracking deep-sea mining in U.S. and international waters for critical minerals such as cobalt, nickel, and manganese. The problem is that such activity will cau…",
    "link": "https://www.counterpunch.org/2025/04/30/dont-let-trump-get-away-with-deep-sea-mining/",
    "timestamp": "2025-04-30T05:01:48Z"
  },
  {
    "title": "The lavratory of democracy",
    "description": "You will have almost certainly guessed the second state to ban fluoride in its public drinking water: Florida is poised to become the second state to ban fluoride in public drinking water, over the concerns of dentists and public health advocates who say the …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/the-lavratory-of-democracy",
    "timestamp": "2025-04-30T05:01:43Z"
  },
  {
    "title": "Trump jokes that he’d like to be next pope",
    "description": "President Donald Trump on Tuesday joked that he would like to succeed Pope Francis, who died last week at the age of 88.",
    "link": "https://nypost.com/2025/04/30/us-news/trump-jokes-hed-like-to-be-the-next-pope-after-pope-francis-death/",
    "timestamp": "2025-04-30T05:01:20Z"
  },
  {
    "title": "Britain at risk of losing ground to rival fintech and crypto hubs, execs warn",
    "description": "\"I think the U.K. will get it right — but there is a risk if you get it wrong that you drive innovation to other markets,\" Coinbase's U.K. head told CNBC.",
    "link": "https://www.cnbc.com/2025/04/30/uk-risks-losing-ground-to-rival-fintech-and-crypto-hubs-execs-say.html",
    "timestamp": "2025-04-30T05:00:33Z"
  },
  {
    "title": "Can Trump Bring Peace to Congo?",
    "description": "Despite a U.S.-brokered agreement, many experts remain skeptical.",
    "link": "http://foreignpolicy.com/2025/04/30/congo-conflict-m23-rebels-trump-rubio-us-peace-deal-critical-minerals/",
    "timestamp": "2025-04-30T05:00:30Z"
  },
  {
    "title": "Trump's 100 day fight with democracy",
    "description": "In the short period which has elapsed since Donald Trump took office (again) in January, he has slashed public health funding, gone after education, attacked media freedom, and challenged the authority of the legal system of the courts.Some of this seems outr…",
    "link": "https://shows.acast.com/newstatesman/episodes/trumps-100-day-fight-with-democracy",
    "timestamp": "2025-04-30T05:00:00Z"
  },
  {
    "title": "Richard Branson criticises Donald Trump's tariffs",
    "description": "Sir Richard Branson told the BBC he wanted to \"make London prosperous for everybody\".",
    "link": "https://www.bbc.com/news/articles/cq5w156y3jeo",
    "timestamp": "2025-04-30T04:59:50Z"
  },
  {
    "title": "A town refuses to give up the school's Native American mascot — and gets Trump's support",
    "description": "A New York City suburb has become the latest flashpoint in the enduring debate over the place of Indigenous imagery in American sports",
    "link": "https://abcnews.go.com/Politics/wireStory/town-refuses-give-schools-native-american-mascot-gets-121304397",
    "timestamp": "2025-04-30T04:54:32Z"
  },
  {
    "title": "Amber Ruffin Says It Would Have Been ‘Impossible’ to Make Jokes About ‘Both’ Democrats and Republicans at White House Correspondents’ Dinner: ‘They Would Not Have Liked It’",
    "description": "Comedian Amber Ruffin explained why she was axed from Saturday’s White House Correspondents’ Dinner on Tuesday night’s episode of “The Late Show with Stephen Colbert.” Ruffin was originally slated to headline the WHC Dinner, joining a long line of comedians w…",
    "link": "https://variety.com/2025/tv/news/amber-ruffin-white-house-correspondents-donald-trump-1236382133/",
    "timestamp": "2025-04-30T04:52:34Z"
  },
  {
    "title": "George Clooney's wife could be barred from US over ICC warrants",
    "description": "British lawyers who helped bring about the ICC arrest warrants against Netanyahu and Gallant warned by UK Foreign Office they could face sanctions from the US, including Amal Clooney, wife of famous American actor George Clooney.",
    "link": "https://www.israelnationalnews.com/news/407618",
    "timestamp": "2025-04-30T04:51:26Z"
  },
  {
    "title": "Trump Praises Bezos As Amazon Denies Plan To Display Tariff Cost",
    "description": "US President Donald Trump on Tuesday said Amazon founder Jeff Bezos \"did the right thing\" by stopping a plan to show consumers how much US tariffs add to each price tag.",
    "link": "https://www.ibtimes.com/trump-praises-bezos-amazon-denies-plan-display-tariff-cost-3771911",
    "timestamp": "2025-04-30T04:49:35Z"
  },
  {
    "title": "Conservative commentator David Horowitz dies at 86",
    "description": "David Horowitz, a conservative commentator, author and activist, died on Tuesday at the age of 86 following a lengthy battle with cancer.",
    "link": "https://www.foxnews.com/media/conservative-commentator-david-horowitz-dies-86",
    "timestamp": "2025-04-30T04:48:50Z"
  },
  {
    "title": "Turkish electronics sector may thrive from trade wars",
    "description": "The Turkish electronics sector has the chance to seize a significant opportunity amid trade wars, as countries facing tariffs are seeking alternative suppliers from markets like Türkiye, a representative told Anadolu Agency.",
    "link": "https://www.hurriyetdailynews.com/turkish-electronics-sector-may-thrive-from-trade-wars-208625",
    "timestamp": "2025-04-30T04:46:18Z"
  },
  {
    "title": "James Carville outlines ‘winning message’ for Democrats, stands by Trump-Hitler comparisonsny",
    "description": "The 'Ragin' Cajun' also shared his take on the party's leadership, messaging problems.",
    "link": "https://nypost.com/2025/04/30/media/james-carville-outlines-winning-message-for-democrats/",
    "timestamp": "2025-04-30T04:41:45Z"
  },
  {
    "title": "US not normalizing relations with Syria 'at this time’: State Department",
    "description": "The U.S. is not normalizing diplomatic relations with Syria \"at this time,\" the State Department said Tuesday.",
    "link": "https://www.hurriyetdailynews.com/us-not-normalizing-relations-with-syria-at-this-time-state-department-208624",
    "timestamp": "2025-04-30T04:40:27Z"
  },
  {
    "title": "Trump congratulates Carney on election victory; leaders agree to meet in person",
    "description": "Following Mark Carney's Liberal party victory in the Canadian election, US President Donald Trump offered his congratulations. The leaders discussed the crucial Canada-US relationship amidst ongoing trade tensions and tariffs impacting the Canadian economy. B…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-congratulates-carney-on-election-victory-leaders-agree-to-meet-in-person/articleshow/120751665.cms",
    "timestamp": "2025-04-30T04:36:59Z"
  },
  {
    "title": "US Senate confirms Tom Barrack as ambassador to Türkiye",
    "description": "The U.S. Senate on Tuesday confirmed Tom Barrack as President Donald Trump’s ambassador to Türkiye, approving the nomination in a 60-36 vote.",
    "link": "https://www.hurriyetdailynews.com/us-senate-confirms-tom-barrack-as-ambassador-to-turkiye-208623",
    "timestamp": "2025-04-30T04:35:02Z"
  },
  {
    "title": "Trump Attacks Judges at 100 Days Rally, Plays Video of Men He Sent to El Salvador",
    "description": "Clips of imprisoned migrants having their heads shaved and marched into prison cells drew boisterous cheers from the president's supporters",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-100-days-rally-imprisoned-migrants-video-1235328235/",
    "timestamp": "2025-04-30T04:32:35Z"
  },
  {
    "title": "Pfizer's CEO said the company could make 'tremendous investments' in the US if Trump's tariffs go away",
    "description": "Albert Bourla said Pfizer is being \"frugal\" with investments because of the uncertainty surrounding tariffs.",
    "link": "https://www.businessinsider.com/pfizer-ceo-trump-tariffs-stopping-tremendous-investments-in-us-2025-4",
    "timestamp": "2025-04-30T04:30:53Z"
  },
  {
    "title": "Trump administration removes Doug Emhoff from board of US Holocaust Memorial Museum",
    "description": "Trump administration removes Doug Emhoff from board of US Holocaust Memorial Museumgo.com",
    "link": "https://abcnews.go.com/Politics/trump-administration-removes-doug-emhoff-board-us-holocaust/story?id=121297023",
    "timestamp": "2025-04-30T04:30:00Z"
  },
  {
    "title": "U.S. and U.K. forces conduct joint military operation in Yemen, Britain says",
    "description": "The operation was said to be against a Houthi military target responsible for making drones like those used to attack shipping.",
    "link": "https://www.japantimes.co.jp/news/2025/04/30/world/politics/us-uk-military-operation-yemen/",
    "timestamp": "2025-04-30T04:23:00Z"
  },
  {
    "title": "CNBC's The China Connection newsletter: A tech boom is underway",
    "description": "China's tech world isn't getting distracted by whether the U.S. and China will talk on trade.",
    "link": "https://www.cnbc.com/2025/04/30/cnbcs-the-china-connection-newsletter-a-tech-boom-is-underway.html",
    "timestamp": "2025-04-30T04:21:33Z"
  },
  {
    "title": "Takeaways from AP's report on how Trump's immigration crackdown resonates in the Texas Panhandle",
    "description": "Confusion and fear are rippling through the immigrant communities of the Texas panhandle, where newcomers have come for generation to work in its immense meatpacking plants. A series of orders from President Donald Trump have ended legal pathways for immigran…",
    "link": "https://www.seattlepi.com/business/article/takeaways-from-ap-s-report-on-how-trump-s-20301705.php",
    "timestamp": "2025-04-30T04:20:52Z"
  },
  {
    "title": "After a year of turmoil, The Washington Post is taking note of its journalism again",
    "description": "So many headlines about The Washington Post over the past year had little to do with its journalism",
    "link": "https://abcnews.go.com/Business/wireStory/after-year-turmoil-washington-post-taking-note-journalism-121304393",
    "timestamp": "2025-04-30T04:14:48Z"
  },
  {
    "title": "Takeaways from AP’s report on how Trump’s immigration crackdown resonates in the Texas Panhandle",
    "description": "PANHANDLE, Texas (AP) — After his inauguration, President Donald Trump issued a series of orders ending legal pathways for immigrants to live and work in the U.S. Those orders resonate powerfully in the Texas Panhandle, where nearly half of workers in the mea…",
    "link": "https://financialpost.com/pmn/takeaways-from-aps-report-on-how-trumps-immigration-crackdown-resonates-in-the-texas-panhandle",
    "timestamp": "2025-04-30T04:13:48Z"
  },
  {
    "title": "Japan Tariff Envoy Departs For Round Two Of US Talks",
    "description": "Tokyo's tariffs envoy departed Wednesday for a second round of negotiations in Washington, where Japan could offer concessions such as tweaking vehicle import procedures to secure relief from Donald Trump's trade levies.",
    "link": "https://www.ibtimes.com/japan-tariff-envoy-departs-round-two-us-talks-3771909",
    "timestamp": "2025-04-30T04:12:17Z"
  },
  {
    "title": "California sent investigators to ICE facilities. They found more detainees, and health care gaps - NewsBreak",
    "description": "A California law empowers state investigators to check on conditions at ICE detention centers. A new report raises concerns about health care inside them.",
    "link": "https://www.newsbreak.com/share/3984544501391-california-sent-investigators-to-ice-facilities-they-found-more-detainees-and-health-care-gaps?s=a2&share_destination_id=MTI1MTE3MTEwLTE3NDU5ODYyNjM1NjU%3D&pd=08SyfuGT&hl=en_US&send_time=1745986263&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.17.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q2-v8%2Cns_foryou_rank_exp_25q2-v5%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q2-v6%2Cns_foryou_blend_exp_25q1-v7%2Cns_foryou_model_exp_25q2-v2%2Cns_local_strategy_25q1_exp-control",
    "timestamp": "2025-04-30T04:11:36Z"
  },
  {
    "title": "Trump's tariffs loom over American economy as shipments from China fall",
    "description": "American businesses are reeling from President Trump's unpredictable trade policies, leading to order cancellations and postponed expansions. Massive tariffs on imports, particularly from China, threaten to cause shortages and higher prices for consumers.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariffs-loom-over-american-economy-as-shipments-from-china-fall/articleshow/120750675.cms",
    "timestamp": "2025-04-30T04:11:25Z"
  },
  {
    "title": "China creates list of US-made goods exempt from 125% tariffs, sources say",
    "description": "China is reportedly creating a 'whitelist' of U.S. goods exempt from tariffs, quietly notifying companies as it seeks to mitigate the trade war's impact. Simultaneously, China surveys businesses to assess the tariff war's effects, signaling a nuanced approach…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-creates-list-of-us-made-goods-exempt-from-125-tariffs-sources-say/articleshow/120750652.cms",
    "timestamp": "2025-04-30T04:10:49Z"
  },
  {
    "title": "The Take: What happens to the children of deportees from the US?",
    "description": "As the Trump administration deports tens of thousands, what happens to the children separated from their parents?",
    "link": "https://www.aljazeera.com/podcasts/2025/4/30/the-take-what-happens-to-the-children-of-deportees-from-the-us",
    "timestamp": "2025-04-30T04:10:00Z"
  },
  {
    "title": "After a year of turmoil, The Washington Post is taking note of its journalism again",
    "description": "After a brutal year of headlines about The Washington Post, executive editor Matt Murray sounded almost relieved to be talking about journalism.  In an...",
    "link": "https://www.yahoo.com/news/turmoil-washington-post-taking-note-040738405.html",
    "timestamp": "2025-04-30T04:07:38Z"
  },
  {
    "title": "Japan tariff envoy departs for round two of US talks",
    "description": "Tokyo’s tariffs envoy departed Wednesday for a second round of negotiations in Washington, where Japan could offer concessions such as tweaking vehicle import procedures to secure relief from Donald Trump’s trade levies. Ryosei Akazawa may also reportedly off…",
    "link": "https://www.digitaljournal.com/world/japan-tariff-envoy-departs-for-round-two-of-us-talks/article",
    "timestamp": "2025-04-30T04:07:32Z"
  },
  {
    "title": "Trump's tariffs loom over the economy as shipments from China fall",
    "description": "American businesses are cancelling orders from China, postponing expansion plans and hunkering down to see what trade policy surprises President Donald Trump plans to spring on them next",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-tariffs-loom-economy-shipments-china-fall-121303740",
    "timestamp": "2025-04-30T04:07:04Z"
  },
  {
    "title": "About that hug ... Whitmer risks backlash from Democrats as she embraces Trump in Michigan",
    "description": "Michigan Gov. Gretchen Whitmer and President Donald Trump shared a hug as he arrived in her home state on Tuesday",
    "link": "https://abcnews.go.com/Politics/wireStory/hug-whitmer-risks-backlash-democrats-embraces-trump-michigan-121303737",
    "timestamp": "2025-04-30T04:06:49Z"
  },
  {
    "title": "How News Corps lost the Plot on Covering Trump",
    "description": "By Nan Levinson It’s not a good time to be an American journalist. Or a consumer of American journalism. Or, for that matter, even a skimmer of the headlines crawling across American phones. Donald Trump is suing media corporations and targeting individual jo…",
    "link": "https://www.juancole.com/2025/04/corps-covering-trump.html",
    "timestamp": "2025-04-30T04:04:47Z"
  },
  {
    "title": "'Oh God!': James Carville Marks Trump's First 100 Days In 'Big Time' Fashion",
    "description": "The longtime Democratic strategist and instructor said the president \"earned\" a grade that he never gave one of his students.",
    "link": "https://www.huffpost.com/entry/james-carville-trump-first-100-days-second-term_n_6811844ee4b00bb8ae4baf5e",
    "timestamp": "2025-04-30T04:04:43Z"
  },
  {
    "title": "Japan keen to team up with ASEAN for free trade system",
    "description": "ASEAN said it will continue constructive dialogue with Washington while maintaining the rules-based multilateral trade system.",
    "link": "https://www.japantimes.co.jp/business/2025/04/30/japan-thailand-energy-industry-dialogue/",
    "timestamp": "2025-04-30T04:04:00Z"
  },
  {
    "title": "What Can Trump Achieve With Russia–Ukraine?",
    "description": "Trump’s rhetoric on Russia leaves something to be desired, but reflects a real lack of leverage.\nThe post What Can Trump Achieve With Russia–Ukraine? appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/what-can-trump-achieve-with-russia-ukraine/",
    "timestamp": "2025-04-30T04:03:00Z"
  },
  {
    "title": "Trump’s First 100 Days of Tariffs: The First Steps Toward the Golden Age of America",
    "description": "The administration has made a strong start toward righting what is wrong with our trade policy.\nThe post Trump’s First 100 Days of Tariffs: The First Steps Toward the Golden Age of America appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trumps-first-100-days-of-tariffs-the-first-steps-toward-the-golden-age-of-america/",
    "timestamp": "2025-04-30T04:03:00Z"
  },
  {
    "title": "How Donald Trump Upended Canadian Politics and Helped the Liberals Win",
    "description": "On April 28, Canadians elected the Liberal Party of Canada to a fourth consecutive term. This is a rare feat for a political party in Canada and in this case, one of special significance, for just months ago, the Liberals seemed destined for near-complete des…",
    "link": "https://www.challies.com/articles/how-donald-trump-upended-canadian-politics-and-helped-the-liberals-win/",
    "timestamp": "2025-04-30T04:02:00Z"
  },
  {
    "title": "Investors turn to emerging market debt after Trump tariffs hit U.S. Treasurys",
    "description": "Investors have been piling into emerging market bonds as Treasurys' long-held reputation as a safe haven took a beating following U.S. President Donald Trump's \"reciprocal\" tariffs.\nEmerging market local currency bond yields slid by 13 basis points between Ap…",
    "link": "https://biztoc.com/x/1e5b21953beb2c9b",
    "timestamp": "2025-04-30T04:01:12Z"
  },
  {
    "title": "British and European marketers trim ad spend in the face of Trump’s tariffs",
    "description": "U.K. ad spend forecasts have been cut back in the face of tariff disruption, while exporters are reconsidering their U.S. presence.",
    "link": "http://digiday.com/marketing/british-and-european-marketers-trim-ad-spend-in-the-face-of-trumps-tariffs/",
    "timestamp": "2025-04-30T04:01:00Z"
  },
  {
    "title": "The Stakes of Donald Trump’s Negotiations With the Islamic Republic of Iran",
    "description": "The general public is completely unaware of the real stakes in the negotiations between Washington and Tehran. This article presents a situation in which lies have been piling up over three decades, making any progress particularly difficult. Contrary to popu…",
    "link": "https://www.lewrockwell.com/2025/04/thierry-meyssan/the-stakes-of-donald-trumps-negotiations-with-the-islamic-republic-of-iran/",
    "timestamp": "2025-04-30T04:01:00Z"
  },
  {
    "title": "100 Days: What Trump Told TIME",
    "description": "On April 22, U.S. President Donald Trump did an interview with Time on his first one hundred days in office. On foreign policy he made two bold claims. The first was that he would successfully conclude diplomatic deals in the Ukrainian-Russian war and in Iran…",
    "link": "https://original.antiwar.com/ted_snider/2025/04/29/100-days-what-trump-told-time/",
    "timestamp": "2025-04-30T04:00:54Z"
  },
  {
    "title": "Global populists once emulated Trump. Now they’re running from him",
    "description": "Donald Trump was supposed to destroy establishment centrists with an anti-woke global populist revolt. But his wild second presidency may be doing the opposite.",
    "link": "https://www.cnn.com/2025/04/30/politics/carney-trump-starmer-macron-world-leaders-change-elections/index.html",
    "timestamp": "2025-04-30T04:00:50Z"
  },
  {
    "title": "The Path to Peace: Europeanization Then Normalization",
    "description": "Reprinted with permission from The Realist Review. Much has been made of Donald Trump and Volodymyr Zelensky’s tête-à-tête in Saint Peter’s Basilica over the weekend. If nothing else, the optics were stunning: The US and Ukrainian president looked to be patch…",
    "link": "https://original.antiwar.com/james-carden/2025/04/29/europeanization-then-normalization/",
    "timestamp": "2025-04-30T04:00:35Z"
  },
  {
    "title": "President Trump, Rock On!",
    "description": "“I am flying high over Tupelo, Mississippi, with America’s hottest band, and we are all about to die.”  That’s the opening line for a fictional Rolling Stone article in Cameron Crowe’s somewhat autobi...",
    "link": "https://www.americanthinker.com/articles/2025/04/president_trump_rock_on.html",
    "timestamp": "2025-04-30T04:00:00Z"
  },
  {
    "title": "Venezuela: Brutal Crackdown Since Elections",
    "description": "Bolivarian National Guard detain demonstrators as people gather to protest presidential election results that awarded Nicolás Maduro a third term, in Caracas, Venezuela, July 30, 2024.\n © 2024 REUTERS/Leonardo Fernandez Viloria\n \n \n\n\n \nVenezuelan authorities …",
    "link": "https://www.hrw.org/news/2025/04/30/venezuela-brutal-crackdown-elections",
    "timestamp": "2025-04-30T04:00:00Z"
  },
  {
    "title": "Yes, J.B. Pritzger is running for president: Time to make him a figure of fun",
    "description": "Q. What’s the 2028 version of Joe Biden and Kamala Harris?\r\n\r\n \r\n\r\nA. J.B. Pritzker and Stacey Abrams. Their campaign slogan is Make America Morbidly Obese Again.\r\n\r\n \r\n\r\nPritzker has subtly, but very clearly called&nbs...",
    "link": "https://www.americanthinker.com/blog/2025/04/yes_j_b_pritzger_is_running_for_president_time_to_make_him_a_figure_of_fun.html",
    "timestamp": "2025-04-30T04:00:00Z"
  },
  {
    "title": "Who will be our Pericles?",
    "description": "In his extensive and deeply intellectual essay “The Athenian Mirror: Reflections on Democracy in Crisis,” Roger Kimball pays homage to the Athens of the time of Pericles.  Kimball reflects on what has been called one of the grea...",
    "link": "https://www.americanthinker.com/blog/2025/04/who_will_be_our_pericles.html",
    "timestamp": "2025-04-30T04:00:00Z"
  }
]