[
  {
    "title": "FL GOP Bill Would Allow Employers to Schedule Child Workers for Overnight Shifts",
    "description": "“This bill is going to lead to exploitation of children,” one critic of the proposal said.",
    "link": "https://truthout.org/articles/fl-gop-bill-would-allow-employers-to-schedule-child-workers-for-overnight-shifts/",
    "timestamp": "2025-03-26T20:16:20Z"
  },
  {
    "title": "Poll: Trump's Mass Deportation Agenda Wins Broad Support from Americans",
    "description": "President Donald Trump's mass deportation agenda is winning broad support from Americans, a new poll reveals.\nThe post Poll: Trump’s Mass Deportation Agenda Wins Broad Support from Americans appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/26/poll-trumps-mass-deportation-agenda-wins-broad-support-americans/",
    "timestamp": "2025-03-26T20:15:51Z"
  },
  {
    "title": "Appeals court rules against Trump motion to halt deportations block",
    "description": "The DOJ sought emergency relief from a federal appeals court to let officials summarily deport people under the Alien Enemies Act while litigation continues.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/alien-enemies-act-appeals-court-ruling-trump-rcna197867",
    "timestamp": "2025-03-26T20:15:14Z"
  },
  {
    "title": "US-Canada border eyed as vulnerability by China, Russia, says Patel: 'The enemy adapts'",
    "description": "The sudden security at the southern U.S. border with Mexico could open up threats to the U.S. northern border with Canada, FBI Director Kash Patel told lawmakers.",
    "link": "https://www.foxnews.com/politics/us-canada-border-eyed-vulnerability-china-russia-says-patel-the-enemy-adapts",
    "timestamp": "2025-03-26T20:14:08Z"
  },
  {
    "title": "WestJet launches Wi-Fi service powered by Elon Musk’s Starlink",
    "description": "The connectivity comes as controversy around Musk grows due to his ties to Donald Trump, prompting backlash against the airline. Read on.",
    "link": "https://financialpost.com/transportation/westjet-launches-wi-fi-service-powered-by-elon-musks-starlink-2",
    "timestamp": "2025-03-26T20:12:40Z"
  },
  {
    "title": "Rubio says US to examine Russia conditions, peace to ‘take time’",
    "description": "Secretary of State Marco Rubio said Wednesday the United States will examine Russia’s requested conditions for agreements with Ukraine, but cautioned that a peace deal would take time. “It won’t be simple. It’ll take some time, but at least we’re on that road…",
    "link": "https://www.digitaljournal.com/world/rubio-says-us-to-examine-russia-conditions-peace-to-take-time/article",
    "timestamp": "2025-03-26T20:12:21Z"
  },
  {
    "title": "Signal Chat Leak: Republicans Say Military Plans Should Have Been Classified—Breaking With White House (Live Updates)",
    "description": "Political fallout is mounting as some Republicans are breaking with the White House on the severity of the leak.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/26/signal-chat-leak-republicans-say-military-plans-should-have-been-classified-breaking-with-white-house-live-updates/",
    "timestamp": "2025-03-26T20:09:16Z"
  },
  {
    "title": "Federal appeals court maintains temporary block on Trump’s use of Alien Enemies Act for deportations | CNN Politics",
    "description": "A divided federal appeals court has maintained a temporary block on President Donald Trump’s ability to use the Alien Enemies Act to quickly deport alleged members of a Venezuelan gang.",
    "link": "https://www.cnn.com/2025/03/26/politics/alien-enemies-act-trump-dc-circuit-court-of-appeals/index.html",
    "timestamp": "2025-03-26T20:09:04Z"
  },
  {
    "title": "Estonia's Tsahkna Says Putin Playing With Trump, Feels Reassured by Rubio",
    "description": "The foreign affairs minister's comments to Newsweek followed the announcement of a deal between Russia and Ukraine to cease military action in the Black Sea.",
    "link": "https://www.newsweek.com/estonia-tsahkna-putin-playing-trump-reassured-rubio-ukraine-2050917",
    "timestamp": "2025-03-26T20:08:47Z"
  },
  {
    "title": "The loudest silence: Top Democrats remain mum amid violent attacks on Tesla",
    "description": "House Minority Leader Hakeem Jeffries and former Speaker Nancy Pelosi refused to condemn the violence against Tesla when confronted on Capitol Hill.",
    "link": "https://www.foxnews.com/politics/loudest-silence-top-democrats-remain-mum-violence-against-tesla",
    "timestamp": "2025-03-26T20:08:40Z"
  },
  {
    "title": "'You're Fired?' Trump Must Find His Inner CEO in Security Scandal | Opinion",
    "description": "The supposedly pro-business Trump administration has distressed actual business leaders with its confusing, hostile trade policies and diplomatic flip flops: first favoring our allies and then our adversaries.",
    "link": "https://www.newsweek.com/youre-fired-trump-must-find-his-inner-ceo-security-scandal-opinion-2051075",
    "timestamp": "2025-03-26T20:07:41Z"
  },
  {
    "title": "Trump expected to unveil auto tariffs during Oval Office press conference Wednesday",
    "description": "Donald Trump will make an announcement Wednesday afternoon about tariffs on auto imports, said White House Press Secretary Karoline Leavitt.",
    "link": "https://nationalpost.com/news/canada/trump-auto-tariffs-oval-office",
    "timestamp": "2025-03-26T20:07:21Z"
  },
  {
    "title": "Trump to make 'special announcement' on cars",
    "description": "United States President Donald Trump revealed on Wednesday that he will make \"a big, special announcement on cars\" to accompany the upcoming tariffs on foreign automobile businesses.Speaking at a Whit...",
    "link": "https://biztoc.com/x/25d5e83986ffa19c",
    "timestamp": "2025-03-26T20:07:12Z"
  },
  {
    "title": "Ski-Doo maker BRP delays financial forecast amid trade uncertainty",
    "description": "Economic uncertainty stirred up by whipsawing U.S. tariff threats prompted BRP Inc. to push back its financial forecast for the coming year, with the trade limbo exacerbating weak consumer demand that drove the Ski-Doo maker to an earnings loss last quarter. …",
    "link": "https://financialpost.com/pmn/ski-doo-maker-brp-delays-financial-forecast-amid-trade-uncertainty-2",
    "timestamp": "2025-03-26T20:05:40Z"
  },
  {
    "title": "Senate GOP confirms Trump health nominees in major MAHA win - The Lion",
    "description": "(Daily Caller News Foundation) – The Senate confirmed two of President Donald Trump’s health nominees Tuesday evening, largely along party lines, in a win for the ‘Make America Healthy Again’ movement. Senators voted 53-47 to confirm Jay Bhattacharya to lead …",
    "link": "https://readlion.com/senate-gop-confirms-trump-health-nominees-in-major-maha-win/",
    "timestamp": "2025-03-26T20:04:22Z"
  },
  {
    "title": "Alibaba Head Warns AI Industry Is Showing Signs of Bubble",
    "description": "For years now, experts have warned of an AI bubble that's ready to burst. Companies continue to pour tens of billions of dollars into building out massive data centers to meet the demands of increasingly power-hungry AI models. And even tech executives are wo…",
    "link": "https://futurism.com/alibaba-ai-industry-signs-bubble",
    "timestamp": "2025-03-26T20:03:40Z"
  },
  {
    "title": "US Says Ukraine-Russia Peace Deal Will \"Take Some Time\"",
    "description": "Secretary of State Marco Rubio said Wednesday the United States will examine Russia&#039;s requested conditions for agreements with Ukraine, but cautioned that a peace deal would take time.",
    "link": "https://www.ndtv.com/world-news/us-says-ukraine-russia-peace-deal-will-take-some-time-8019167",
    "timestamp": "2025-03-26T20:02:55Z"
  },
  {
    "title": "Trump Burger Is Coming For Kemah",
    "description": "The owner of the original Bellville location is opening a location in Kemah on Friday, and another outpost in Cypress and Houston proper",
    "link": "https://houston.eater.com/2025/3/26/24394699/houston-trump-burger-kemah-cypress-texas-restaurant-openings",
    "timestamp": "2025-03-26T20:01:37Z"
  },
  {
    "title": "Dutton hypes ‘big announcement’ in tonight’s budget reply",
    "description": "The opposition leader is set to deliver his budget reply speech tonight, and the issue of salmon farming has dominated a particularly gross Senate question time.\nThe post Dutton hypes ‘big announcement’ in tonight’s budget reply appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/03/27/peter-dutton-2025-budget-reply-salmon-farming/",
    "timestamp": "2025-03-26T20:01:37Z"
  },
  {
    "title": "Signal Messaging Non-Imbroglio",
    "description": "In the latest commentary, a critical analysis of the recent claims against Trump's team reveals a complex narrative steeped in political theater, questioning the integrity of mainstream media and the implications of communication practices.\nThe post Signal Me…",
    "link": "https://www.thegatewaypundit.com/2025/03/signal-messaging-non-imbroglio/",
    "timestamp": "2025-03-26T20:00:40Z"
  },
  {
    "title": "Turkish Student at Tufts University Handcuffed, Detained by Masked Agents",
    "description": "Surveillance video appears to show six people, their faces covered, taking away Rumeysa Ozturk's phone as she yelled and was handcuffed.",
    "link": "https://time.com/7271931/turkish-student-at-tufts-university-detained-masked-agents/",
    "timestamp": "2025-03-26T20:00:39Z"
  },
  {
    "title": "Student Loan Forgiveness May Wither in the Courts, Says This Expert. What You Can Do Now",
    "description": "The path for current student loans is uncertain, but forgiveness options look even less likely for future borrowers.",
    "link": "https://www.cnet.com/personal-finance/loans/student-loan-forgiveness-may-wither-in-the-courts-says-this-expert-what-you-can-do-now/",
    "timestamp": "2025-03-26T20:00:00Z"
  },
  {
    "title": "Palisades Nuclear Plant Revival Sparks Industry Interest",
    "description": "In recent years, interest in developing the U.S. nuclear power capacity has grown. Under the Biden administration’s push for a green transition, more companies were encouraged to invest in clean energy. In addition, the power demand is expected to grow much m…",
    "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Palisades-Nuclear-Plant-Revival-Sparks-Industry-Interest.html",
    "timestamp": "2025-03-26T20:00:00Z"
  },
  {
    "title": "The SignalGate Scandal, the Lies, and the Text Messages",
    "description": "In the first big scandal of the Trump administration, the editor-in-chief of The Atlantic was invited to participate in a top-secret texting session about bombing the Houthis. Jeffrey Goldberg first thought it was a joke or a scam, but he joined the group and…",
    "link": "https://dianeravitch.net/2025/03/26/the-signalgate-scandal-the-lies-and-the-text-messages/",
    "timestamp": "2025-03-26T20:00:00Z"
  },
  {
    "title": "Tariff man doubles down on his passion",
    "description": "<p>US President Donald Trump has long been a staunch advocate of import tariffs, proudly calling himself \"Tariff Man\" and asserting that tariff is \"the most beautiful word in the dictionary.\"</p>",
    "link": "https://www.bangkokpost.com/opinion/opinion/2988557/tariff-man-doubles-down-on-his-passion",
    "timestamp": "2025-03-26T20:00:00Z"
  },
  {
    "title": "‘Snow White’ Producer’s Son Slams Rachel Zegler for ‘Hijacking’ Movie With Political Posts: ‘Clearly Hurt the Film’s Box Office’",
    "description": "In a since-deleted statement, Jonah Platt came to his father Marc's defense after reports that he flew out to \"reprimand\" the actress \nThe post ‘Snow White’ Producer’s Son Slams Rachel Zegler for ‘Hijacking’ Movie With Political Posts: ‘Clearly Hurt the Film’…",
    "link": "https://www.thewrap.com/rachel-zegler-snow-white-producer-jonah-platt/",
    "timestamp": "2025-03-26T19:58:56Z"
  },
  {
    "title": "Auto tariffs on imports to U.S. coming today: Trump",
    "description": "White House Secretary Karoline Leavitt did not offer details about how the tariffs would affect the North American automobile industry, which is integrated among Canada, Mexico and the United States.",
    "link": "https://www.nationalobserver.com/2025/03/26/news/auto-tariffs-imports-us-trump",
    "timestamp": "2025-03-26T19:57:52Z"
  },
  {
    "title": "Lithuania's Budrys Hails Black Sea Truce, Wants Ukraine Security Guarantees",
    "description": "Lithuanian Minister of Foreign Affairs Kęstutis Budrys spoke with Newsweek about Russia, Ukraine, and the NATO alliance.",
    "link": "https://www.newsweek.com/lithuania-budrys-hails-black-sea-truce-wants-urkaine-security-guarantees-2051029",
    "timestamp": "2025-03-26T19:56:27Z"
  },
  {
    "title": "Bishop slammed by Trump after inauguration prayer service scores 2-book deal",
    "description": "The Episcopal bishop who in January angered President Donald Trump has a deal for two books for young people. Both are based on the Right Rev. Mariann Edgar Budde’s best-selling “How We Learn to Be Brave.” Penguin Young Readers announced Wednesday that it wil…",
    "link": "https://nypost.com/2025/03/26/us-news/bishop-slammed-by-trump-after-inauguration-prayer-service-scores-2-book-deal/",
    "timestamp": "2025-03-26T19:56:24Z"
  },
  {
    "title": "Tilman Fertitta to resign as CEO of Landry's, Fertitta Entertainment, Inc. if confirmed to become US ambassador to Italy",
    "description": "Tilman Fertitta to resign as CEO of Landry's, Fertitta Entertainment, Inc. if confirmed to become US ambassador to Italyabc13.com",
    "link": "https://abc13.com/post/tilman-fertitta-resign-ceo-landrys-entertainment-confirmed-become-us-ambassador-italy/16086161/",
    "timestamp": "2025-03-26T19:56:05Z"
  },
  {
    "title": "Trump to make 'special announcements' on cars",
    "description": "United States President Donald Trump revealed on Wednesday that he will make \"a big, special announcement on cars\" to accompany the upcoming tariffs on foreign automobile businesses.Speaking at a Whit...",
    "link": "https://biztoc.com/x/9b751b03a4854b28",
    "timestamp": "2025-03-26T19:55:58Z"
  },
  {
    "title": "WTI Nears $70 as Supplies Tighten",
    "description": "Oil prices climbed after a US report showed falling crude and gasoline inventories, signaling tighter short-term supplies.",
    "link": "https://www.rigzone.com/news/wire/wti_nears_70_as_supplies_tighten-26-mar-2025-180045-article/",
    "timestamp": "2025-03-26T19:53:34Z"
  },
  {
    "title": "The Atlantic Has an Owner Committed to the Cause: Laurene Powell Jobs",
    "description": "When The Atlantic’s Jeffrey Goldberg was added to a Signal chat with Trump’s national security brass, it led to one of the wildest scoops of his career—and raised a host of questions: Did he securely destroy the war plans? What about his phone?",
    "link": "https://www.status.news/p/atlantic-jeffrey-goldberg-signal-texts-war-plans",
    "timestamp": "2025-03-26T19:52:30Z"
  },
  {
    "title": "Trump Admin Moves To Stifle China’s Ability To Weaponize American Tech Against Americans",
    "description": "The Bureau of Industry and Security (BIS) announced that it was adding 80 companies to a trade blacklist, citing national security concerns.",
    "link": "https://dailycaller.com/2025/03/26/trump-admin-moves-to-stifle-chinas-ability-to-weaponize-american-tech-against-americans/",
    "timestamp": "2025-03-26T19:52:24Z"
  },
  {
    "title": "The Atlantic releases the Signal chat showing Hegseth's detailed attack plans against the Houthis",
    "description": "The Atlantic has released the Signal chat among Trump senior national security officials. It shows that Defense Secretary Pete Hegseth provided the exact times of warplane launches and when bombs would drop — before the men and women flying those…",
    "link": "https://apnews.com/article/hegseth-atlantic-war-plans-signal-yemen-houthis-c0addd08c627ab01a37ea63621cb695e",
    "timestamp": "2025-03-26T19:50:00Z"
  },
  {
    "title": "'Well, the Pentagon says it was not': Rubio dodges questions about classified info in chat",
    "description": "Secretary of State Marco Rubio was in Jamaica on Wednesday, where he was asked by reporters about the growing scandal around officials in President Donald Trump's administration using a Signal chat to post war plans against Houthi rebels in Yemen.On Monday, a…",
    "link": "https://www.rawstory.com/signal-scandal-2671519505/",
    "timestamp": "2025-03-26T19:46:29Z"
  },
  {
    "title": "Rubio breaks silence on leaked Signal chat: 'Someone made a big mistake'",
    "description": "Secretary of State Marco Rubio for the first time since the Signal chat exchange debacle was revealed this week admitted \"someone made a big mistake\" in adding a journalist to group chat.",
    "link": "https://www.foxnews.com/world/rubio-breaks-silence-leaked-signal-chat-someone-made-big-mistake",
    "timestamp": "2025-03-26T19:46:04Z"
  },
  {
    "title": "Trump’s executive order on elections is far-reaching. But will it actually stick?",
    "description": "The executive order is vast in scope and holds the potential to reorder the voting landscape.",
    "link": "https://www.denverpost.com/2025/03/26/trump-election-executive-order-explainer/",
    "timestamp": "2025-03-26T19:45:59Z"
  },
  {
    "title": "Trump’s executive order on elections is far-reaching. But will it actually stick?",
    "description": "The executive order is vast in scope and holds the potential to reorder the voting landscape.",
    "link": "https://www.bostonherald.com/2025/03/26/trump-election-executive-order-explainer/",
    "timestamp": "2025-03-26T19:45:59Z"
  },
  {
    "title": "Was Justin Trudeau forced to congratulate Donald Trump on his historic election win and praise the Republican leader’s amazing campaign? Here's what a briefing note says",
    "description": "Former Canadian PM Justin Trudeau congratulated US President Donald Trump on his 2024 re-election. A briefing note prepared before their call highlighted anticipated discussions on trade, particularly the Canada-US-Mexico Agreement (CUSMA). They emphasized ec…",
    "link": "https://economictimes.indiatimes.com/news/international/us/was-justin-trudeau-forced-to-congratulate-donald-trump-on-his-historic-election-win-and-praise-the-republican-leaders-amazing-campaign-heres-what-a-briefing-note-says/articleshow/119554544.cms",
    "timestamp": "2025-03-26T19:45:33Z"
  },
  {
    "title": "Huge Announcement: Watch Moment POTUS Pledges Final Justice for Babbitt and Byrd",
    "description": "\"[S]he was innocently standing there and they even say trying to hold back the crowd, and a man... shot her, and I think it's a disgrace.\"",
    "link": "https://www.westernjournal.com/huge-announcement-watch-moment-potus-pledges-final-justice-babbitt-byrd/",
    "timestamp": "2025-03-26T19:45:21Z"
  },
  {
    "title": "Bessent: Trump may raise sanctions on Russia for leverage",
    "description": "United States Treasury Secretary Scott Bessent said on Wednesday that US President Donald Trump \"would not hesitate\" to increase the sanctions imposed on Russia for a negotiating advantage.\"It will be...",
    "link": "https://biztoc.com/x/40644a6ba9c9a97c",
    "timestamp": "2025-03-26T19:45:09Z"
  },
  {
    "title": "Reporter Digs Up Photo of Waltz Standing Next to Goldberg at 2021 Event He Moderated After NSA Adviser Claims He Never Met Him",
    "description": "National Security Adviser Mike Waltz has insisted that he \"never met\" Atlantic editor in chief Jeffrey Goldberg in the wake of his stunning reporting on a leaked Signal chat, but it did not take long for a reporter to dig up photographic evidence to the contr…",
    "link": "https://www.mediaite.com/online/reporter-digs-up-photo-of-waltz-standing-next-to-goldberg-at-2021-event-he-moderated-after-nsa-adviser-claims-he-never-met-him/",
    "timestamp": "2025-03-26T19:44:36Z"
  },
  {
    "title": "Congressman Keith Self Blasts Jasmine Crockett, Defends Governor Abbott",
    "description": "Congressman Keith Self is blasting Congresswoman Jasmine Crockett for cracking a joke about Texas Governor Greg Abbott's disability ... though he refused to condemn President Donald Trump for doing something similar. The Republican representative…\n Permalink",
    "link": "https://www.tmz.com/2025/03/26/congressman-keith-self-slams-jasmine-crockett-defends-greg-abbott/",
    "timestamp": "2025-03-26T19:42:32Z"
  },
  {
    "title": "India awaits clarity on Trump's tariffs; officials say New Delhi will react after US makes announcement",
    "description": "India is preparing to respond appropriately to the US' reciprocal tariffs, expected to be implemented next week. While there is uncertainty surrounding the tariffs, Indian officials and industries are concerned about potential impacts on jobs and seeking swif…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-awaits-clarity-on-trumps-tariffs-officials-say-new-delhi-will-react-after-us-makes-announcement/articleshow/119555788.cms",
    "timestamp": "2025-03-26T19:41:09Z"
  },
  {
    "title": "Inside Job? How The Atlantic’s Jeffrey Goldberg May Have Infiltrated Trump’s Security Chat (VIDEO)",
    "description": "The unexpected presence of Jeffrey Goldberg in a Trump security chat raises critical questions about intent and accountability. Delve into the implications of this potential infiltration and its impact on national security.\nThe post Inside Job? How The Atlant…",
    "link": "https://www.thegatewaypundit.com/2025/03/inside-job-how-atlantics-jeffrey-goldberg-may-have/",
    "timestamp": "2025-03-26T19:40:17Z"
  },
  {
    "title": "UPS Rolls Out Tool to Help Shoppers Avoid Surprise Tariffs",
    "description": "UPS is debuting a tool to help online shoppers view the added cost of tariffs. UPS Global Checkout is designed to ease international trade as a trade war between the United States and other nations complicates eCommerce shipping, according to a Wednesday (Mar…",
    "link": "https://www.pymnts.com/shipping/2025/ups-rolls-out-tool-help-shoppers-avoid-surprise-tariffs/",
    "timestamp": "2025-03-26T19:38:17Z"
  },
  {
    "title": "Trump asks Supreme Court to halt millions of dollars in ‘DEI’-related education grants",
    "description": "The diversity-related request comes from the Department of Education, which the president wants to dismantle.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-asks-supreme-court-education-dei-related-grants-rcna198222",
    "timestamp": "2025-03-26T19:37:49Z"
  },
  {
    "title": "Kavanaugh and Barrett appear likely to break with the Supreme Court’s MAGA wing",
    "description": "The Supreme Court spent Wednesday morning giving very serious consideration to a case that no one should take seriously.  FCC v. Consumers’ Research asks the justices to revive a long-dead legal doctrine known as “nondelegation,” which places strict limits on…",
    "link": "https://www.vox.com/scotus/405913/supreme-court-kavanaugh-barrett-nondelegation-fcc-consumers-research",
    "timestamp": "2025-03-26T19:37:48Z"
  },
  {
    "title": "Why Lawyers Are Standing Up To Big Law",
    "description": "Plus, Lattice CEO on AI agents vs digital workers, DOGE cuts could lead to a U.S. science brain drain and unsecured work group chats gone wrong in this week’s Careers newsletter.",
    "link": "https://www.forbes.com/sites/mariagraciasantillanalinares/2025/03/26/why-lawyers-are-standing-up-to-big-law/",
    "timestamp": "2025-03-26T19:37:36Z"
  },
  {
    "title": "This year's March Madness reflects rise of Red State America",
    "description": "The outlook for a blue state sports comeback anytime soon looks bleak.  According to Rivals, 28 of this year’s top 40 high school basketball prospects were located in red states.",
    "link": "https://www.foxnews.com/opinion/years-march-madness-reflects-rise-red-state-america",
    "timestamp": "2025-03-26T19:37:08Z"
  },
  {
    "title": "Why Black Folks Believe Trump Is Trying To Use Us to Declare Martial Law and What Does That Mean?",
    "description": "Photo: Greg Nash-Pool (Getty Images)\r\nBlack Americans are carefully reading signs from the White House. And if you’ve been paying attention to President Donald Trump’s first 65 days in office, then you should be on high alert! Since January, Trump has signed …",
    "link": "https://www.theroot.com/why-black-folks-believe-trump-is-trying-to-use-us-to-de-1851772545",
    "timestamp": "2025-03-26T19:37:00Z"
  },
  {
    "title": "Inside Mike Johnson's meeting with judiciary hawks over Trump court standoff",
    "description": "House Republicans on the Judiciary Committee privately met with Speaker Mike Johnson on Tuesday.",
    "link": "https://www.foxnews.com/politics/inside-mike-johnsons-meeting-judiciary-hawks-over-trump-court-standoff",
    "timestamp": "2025-03-26T19:35:59Z"
  },
  {
    "title": "Senate Republicans warm to hiking the debt limit in their sweeping party-line bill",
    "description": "Senate Republicans are warming up to the idea of including a debt ceiling increase in their big party-line bill to advance President Donald Trump’s agenda.",
    "link": "https://www.nbcnews.com/politics/congress/senate-republicans-debt-limit-sweeping-party-line-bill-rcna198161",
    "timestamp": "2025-03-26T19:33:07Z"
  },
  {
    "title": "Facing possible primary challenge from Trump ally, long-serving senator gets backing of leader Thune",
    "description": "Republican Sen. John Cornyn of Texas, facing a possible 2026 primary challenge from Texas Attorney General Ken Paxton, a President Trump ally, lands the endorsement of Senate Majority Leader John Thune.",
    "link": "https://www.foxnews.com/politics/facing-possible-primary-challenge-from-trump-ally-long-serving-senator-backing-leader-thune",
    "timestamp": "2025-03-26T19:32:03Z"
  },
  {
    "title": "Comedian Mike Glazer Heckled by Trump Supporter, Called 'Jew Pig'",
    "description": "Comedian Mike Glazer got heckled by a Donald Trump supporter in the middle of his stand-up act, with the guy calling Mike a \"Jew pig\" ... and it's all on video. Mike was telling a joke about sitting in a corner with his weed pen when suddenly he…\n Permalink",
    "link": "https://www.tmz.com/2025/03/26/comedian-mike-glazer-called-jew-pig-by-trump-supporter/",
    "timestamp": "2025-03-26T19:30:58Z"
  },
  {
    "title": "Trump's Latest Executive Order is a Sham--and a Warning (Marc Elias/Democracy Docket)",
    "description": "Marc Elias / Democracy Docket:\nTrump's Latest Executive Order is a Sham—and a Warning  —  The greatest threat to Donald Trump's authoritarian dream is not the courts — it is free and fair elections.  While the courts can stand in the way of his twisted vision…",
    "link": "https://www.memeorandum.com/250326/p92",
    "timestamp": "2025-03-26T19:30:01Z"
  },
  {
    "title": "Democrats narrowly win a Pennsylvania Senate seat, scoring an upset in Republican-leaning suburbs | CNN Politics",
    "description": "Democrat James Andrew Malone narrowly won a special election for a Pennsylvania state Senate seat in a stretch of Republican-leaning suburbs and farming communities, scoring an upset in a territory that a Democrat hasn’t represented in the chamber for 136 yea…",
    "link": "https://www.cnn.com/2025/03/26/politics/pennsylvania-state-senate-special-election-malone/index.html",
    "timestamp": "2025-03-26T19:29:45Z"
  },
  {
    "title": "Copper prices surge to record high amid tariff anxiety",
    "description": "Copper prices surge to record high amid tariff anxietyabc12.com",
    "link": "https://www.abc12.com/news/business/copper-prices-surge-to-record-high-amid-tariff-anxiety/article_2ec639ac-c1cb-557d-81ee-c3a4803d4985.html",
    "timestamp": "2025-03-26T19:29:00Z"
  },
  {
    "title": "Kids Are Getting Sick From RFK Jr.’s False Measles Remedy, Doctors Say",
    "description": "Nearly 380 cases of measles have been identified in the US this year, the highest number since 2019.",
    "link": "https://truthout.org/articles/kids-are-getting-sick-from-rfk-jr-s-false-measles-remedy-doctors-say/",
    "timestamp": "2025-03-26T19:28:29Z"
  },
  {
    "title": "Javier Bardem Signs Letter by Israeli, Palestinian Fathers to End War",
    "description": "The plea for a return to negotiations and a possible ceasefire in Gaza by Rami Elhanan and Bassam Aramin was published in the Spanish newspaper El Pais.",
    "link": "http://www.hollywoodreporter.com/news/general-news/javier-bardem-signs-letter-israeli-palestinian-end-war-1236173312/",
    "timestamp": "2025-03-26T19:28:00Z"
  },
  {
    "title": "Exclusive: DOJ Orders Law Schools to Halt 'Abominable' DEI Admissions Practices",
    "description": "The Department of Justice has ordered every U.S. law school to halt DEI admissions, which AG Pam Bondi called an \"abominable practice.\"\nThe post Exclusive: DOJ Orders Law Schools to Halt ‘Abominable’ DEI Admissions Practices appeared first on Breitbart.",
    "link": "https://www.breitbart.com/education/2025/03/26/exclusive-doj-orders-law-schools-halt-abominable-dei-admissions-practices/",
    "timestamp": "2025-03-26T19:27:28Z"
  },
  {
    "title": "What’s the fallout of the US security breach?",
    "description": "Donald Trump downplays the disclosure of sensitive military information.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/3/26/whats-the-fallout-of-the-us-security-breach",
    "timestamp": "2025-03-26T19:26:49Z"
  },
  {
    "title": "Microsoft has killed \"several\" data center projects in the U.S. and Europe, according to reports",
    "description": "Bloomberg is reporting that Microsoft is reducing its data center footprint globally, citing oversupply.",
    "link": "https://www.windowscentral.com/microsoft/microsoft-has-killed-several-data-center-projects-in-the-u-s-and-europe-according-to-reports",
    "timestamp": "2025-03-26T19:26:48Z"
  },
  {
    "title": "Voice Of America’s Director Sues To Reverse Trump Administration’s Shutdown Of U.S.-Backed Media Outlet",
    "description": "The director of Voice of America filed suit against Trump administration officials today, seeking a court order to stop the dismantling of the U.S. operated international broadcaster. In a lawsuit filed in U.S. District Court in Washington, Michael Abramowitz…",
    "link": "http://deadline.com/2025/03/voice-of-america-trump-shutdown-1236351476/",
    "timestamp": "2025-03-26T19:26:17Z"
  },
  {
    "title": "The Trump Team’s Denials Are Laughable",
    "description": "The president’s officials must know that what they did in the Signal group chat was wrong—and dangerous.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/03/signal-group-chat-trump-denials/682179/",
    "timestamp": "2025-03-26T19:26:00Z"
  },
  {
    "title": "The Real Outrage About the Yemen Signal Group Is That It Called for Attack on Civilian Home",
    "description": "“We had positive ID of him walking into his girlfriend’s building and it’s now collapsed.”\nThe post The Real Outrage About the Yemen Signal Group Is That It Called for Attack on Civilian Home appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/03/26/signal-chat-yemen-strike/",
    "timestamp": "2025-03-26T19:25:45Z"
  },
  {
    "title": "The ‘state secrets privilege’ sounds mysterious. Here’s what it is and how it works",
    "description": "The Trump administration is invoking a powerful tool in seeking to cut off a judge’s inquiry into whether it defied his order.",
    "link": "https://www.bostonherald.com/2025/03/26/state-secrets-privilege-explainer/",
    "timestamp": "2025-03-26T19:25:10Z"
  },
  {
    "title": "Episcopal bishop criticized by President Trump has a 2-book deal with young readers publisher",
    "description": "Both are based on the Right Rev. Mariann Edgar Budde’s best-selling 'How We Learn to Be Brave.'",
    "link": "https://www.bostonherald.com/2025/03/26/books-episcopal-bishop-budde/",
    "timestamp": "2025-03-26T19:24:41Z"
  },
  {
    "title": "Trump Takes Presidential Power To A Whole New Level In New Court Filing",
    "description": "The Trump administration claims it has vast power to declare people in the U.S.  terrorists and send them to a foreign prison — without hearings or evidence.",
    "link": "https://www.huffpost.com/entry/trump-alien-enemies-act-tren-de-aragua-terrorists-el-salvador_n_67e43a17e4b03483d8f9a801",
    "timestamp": "2025-03-26T19:24:20Z"
  },
  {
    "title": "Donald Trump's Losing Control of the Narrative With Swing Voters: Data",
    "description": "Tens of thousands of swing voters tracked online are further expressing a \"growing fear\" about President Trump's \"long-term direction.\"",
    "link": "https://www.newsweek.com/donald-trump-poll-swing-voters-maga-2050996",
    "timestamp": "2025-03-26T19:23:28Z"
  },
  {
    "title": "MAGA defends Yemen Signal convo leak with semantic ‘attack’ isn’t ‘war plans’ stance",
    "description": "Supporters of President Donald Trump have concocted a new excuse to downplay the administration's embarrassing leak of sensitive military plans by arguing over the difference between an \"attack\" and \"war.\"\n\n\nThe latest excuse comes after Jeffrey Goldberg, the…",
    "link": "https://www.dailydot.com/debug/attack-war-signal-yemen-plan-leak/",
    "timestamp": "2025-03-26T19:22:59Z"
  },
  {
    "title": "'Bad people': Trump still raging over Colorado's unflattering painting of him",
    "description": "President Donald Trump blamed \"bad people\" for an unflattering portrait of him that was hung in Colorado's state Capitol building.After complaining about the portrait on his Truth Social platform, he took to Newsmax to air additional grievances.Trump told hos…",
    "link": "https://www.rawstory.com/trump-colorado-portrait/",
    "timestamp": "2025-03-26T19:22:55Z"
  },
  {
    "title": "Fani Willis 'thinks she's above the law,' says Georgia lawmaker in subpoena fight",
    "description": "Georgia lawmakers deliberated Wednesday on how to press Fulton County District Attorney Fani Willis to comply with a committee subpoena.",
    "link": "https://www.foxnews.com/politics/fani-willis-thinks-shes-above-law-georgia-lawmaker-subpoena-fight-says",
    "timestamp": "2025-03-26T19:22:37Z"
  },
  {
    "title": "Fani Willis and Nathan Wade Spotted Together at LAX After Testifying Their Relationship Ended in 2023 (VIDEO)",
    "description": "Fulton County DA Fani Willis and Nathan Wade were recently seen together at LAX, raising questions about their purportedly ended relationship. This revelation adds a new layer to ongoing investigations.\nThe post Fani Willis and Nathan Wade Spotted Together at…",
    "link": "https://www.thegatewaypundit.com/2025/03/fani-willis-nathan-wade-spotted-together-lax-after/",
    "timestamp": "2025-03-26T19:20:56Z"
  },
  {
    "title": "Senior US Republican wants probe into Signal chat on Houthi attack",
    "description": "WASHINGTON: A powerful US Senate Republican called on Wednesday (Mar 26) for an independent probe of Trump administration officials' discussion of sensitive attack plans on Signal, after c",
    "link": "https://www.channelnewsasia.com/world/us-lawmakers-probe-signal-chat-houthi-attack-5026241",
    "timestamp": "2025-03-26T19:19:00Z"
  },
  {
    "title": "Marjorie Taylor Green-Led DOGE Panel Rips ‘Radical Left’ NPR and PBS, Calls to End Public Funding",
    "description": "NPR boss Katherine Maher was questioned about 2020 tweets in which she called President Trump a \"fascist\" and \"deranged racist sociopath\" \nThe post Marjorie Taylor Green-Led DOGE Panel Rips ‘Radical Left’ NPR and PBS, Calls to End Public Funding appeared firs…",
    "link": "https://www.thewrap.com/marjorie-taylor-greene-npr-pbs-congressional-hearing/",
    "timestamp": "2025-03-26T19:18:55Z"
  },
  {
    "title": "NTSB chairwoman says reviewing the data after midair crash may prevent the next aviation accident",
    "description": "The head of the agency investigating the deadly midair collision that killed 67 said Wednesday that someone should have spotted the alarming number of near misses in the skies over the nation’s capital beforehand and reviewing the data now could preven...",
    "link": "https://abcnews.go.com/Business/wireStory/ntsb-chairwoman-reviewing-data-after-midair-crash-prevent-120190296",
    "timestamp": "2025-03-26T19:18:17Z"
  },
  {
    "title": "WestJet launches Wi-Fi service powered by Elon Musk’s Starlink",
    "description": "MONTREAL — WestJet has launched an on-board Wi-Fi service powered by Starlink, the satellite internet technology made by Elon Musk’s rocket company, SpaceX, sparking a limited backlash from Canadians. In an email, the airline confirmed it activated the servic…",
    "link": "https://financialpost.com/pmn/westjet-launches-wi-fi-service-powered-by-elon-musks-starlink",
    "timestamp": "2025-03-26T19:16:33Z"
  },
  {
    "title": "EU ‘rearmament’ plan meets resistance over debt concerns – Politico",
    "description": "Southern European states have been pushing against EU militarization plan over fears of rising debt, according to a report Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614819-eu-rearmament-plan-resistance/",
    "timestamp": "2025-03-26T19:15:29Z"
  },
  {
    "title": "DOGE marks millions — all 120+ years old — as deceased in Social Security database",
    "description": "The Department of Government Efficiency announced Monday evening that it had purged roughly 7 million Social Security number-holders listed as at least 120 years old. Earlier this month, the DOGE revealed that the Social Security Administration's database had…",
    "link": "https://freerepublic.com/focus/f-news/4306931/posts",
    "timestamp": "2025-03-26T19:15:10Z"
  },
  {
    "title": "President Trump Directs the Declassification and Release of FBI Russiagate Files – Essentially, “the Mar-a-Lago Binder”",
    "description": "Yesterday President Donald Trump signed an executive order targeting: “Immediate Declassification of Materials Related to the Federal Bureau of Investigation’s Crossfire Hurricane Investigation.” [ORDER TEXT HERE]Within the XO President Trump informs the Atto…",
    "link": "https://freerepublic.com/focus/f-bloggers/4306930/posts",
    "timestamp": "2025-03-26T19:14:45Z"
  },
  {
    "title": "President Trump Directs the Declassification and Release of FBI Russiagate Files – Essentially, “the Mar-a-Lago Binder”",
    "description": "Yesterday President Donald Trump signed an executive order targeting: “Immediate Declassification of Materials Related to the Federal Bureau of Investigation’s Crossfire Hurricane Investigation.” [ORDER TEXT HERE]Within the XO President Trump informs the Atto…",
    "link": "https://freerepublic.com/focus/f-news/4306930/posts",
    "timestamp": "2025-03-26T19:14:45Z"
  },
  {
    "title": "Trump plans to eliminate U.S. funding for malaria and worldwide child vaccination: report",
    "description": "President Donald Trump's administration has notified Congress in a new letter they intend to eliminate several foreign aid programs critical for public health, including efforts to combat malaria and a grant to a program responsible for vaccinating millions o…",
    "link": "https://www.rawstory.com/trump-usaid-2671511944/",
    "timestamp": "2025-03-26T19:14:42Z"
  },
  {
    "title": "Air force chief 'very comfortable' with response to Chinese warships",
    "description": "In his first interview since assuming the job last year, Air Marshall Stephen Chappell has warned the country is in a period of strategic volatility as potential military threats grow across the Indo-Pacific, and insists Australia is not overly reliant on the…",
    "link": "https://www.abc.net.au/news/2025-03-27/air-marshal-chief-comfortable-chinese-warship-response/105100672",
    "timestamp": "2025-03-26T19:14:29Z"
  },
  {
    "title": "Atlantic story on Yemen chat reportedly showed a rare time Vance broke with Trump",
    "description": "JD Vance made a noteworthy statement in the Signal chat, breaking with Donald Trump and questioning if the attacks on the Houthis in Yemen should be delayed.",
    "link": "https://abcnews.go.com/Politics/atlantic-story-yemen-chat-reportedly-showed-rare-instance/story?id=120139751",
    "timestamp": "2025-03-26T19:13:54Z"
  },
  {
    "title": "Trump Orders Department Of Education Closure: What Happens Next",
    "description": "President Trump has issued an executive order to close the Department of Education, which will reshape federal education policy and affect 49.5 million students.",
    "link": "https://www.forbes.com/sites/sarahhernholm/2025/03/26/trump-orders-department-of-education-closure-what-happens-next/",
    "timestamp": "2025-03-26T19:13:09Z"
  },
  {
    "title": "Why is the US bombing Yemen in the first place?",
    "description": "The Trump administration's snowballing \"Signalgate\" scandal has helped refocus public attention onto one of the nation's least-understood military entanglements",
    "link": "https://theweek.com/politics/signal-leak-yemen-bomb-hegseth-goldberg",
    "timestamp": "2025-03-26T19:12:53Z"
  },
  {
    "title": "Youngkin revives park at Monroe's estate, but Dem leaders oppose it",
    "description": "A proposal to turn Oak Hill, the 18th-century Loudoun County estate of President James Monroe into a state park looks ominous when the General Assembly returns next week.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_0c78d0a3-8c4e-4abb-b1db-2dd9ef683eff.html",
    "timestamp": "2025-03-26T19:12:00Z"
  },
  {
    "title": "Trump expected to announce new auto tariffs this afternoon",
    "description": "President Donald Trump is expected to announce new measures imposing tariffs on automobiles Wednesday afternoon.",
    "link": "https://biztoc.com/x/dbb59c26c8b7a31a",
    "timestamp": "2025-03-26T19:11:34Z"
  },
  {
    "title": "Hegseth says no classified information was shared in Signal group chat: 'Nobody's texting war plans'",
    "description": "Defense Secretary Pete Hegseth push backed amid questions about possible classified information being share during a group chat earlier this month.",
    "link": "https://www.foxnews.com/politics/hegseth-says-no-classified-information-shared-signal-group-chat-nobodys-texting-war-plans",
    "timestamp": "2025-03-26T19:11:23Z"
  },
  {
    "title": "The reappearance of Neil Gorsuch’s sporadic textualism",
    "description": "In a gun control case, no less:  The Supreme Court on Wednesday upheld a Biden administration regulation on the nearly impossible-to-trace weapons called ghost guns, clearing the way for continued serial numbers, background checks and age verification require…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/the-reappearance-of-neil-gorsuchs-sporadic-textualism",
    "timestamp": "2025-03-26T19:11:17Z"
  },
  {
    "title": "Trump tariffs could push up inflation: senior Fed official",
    "description": "US President Donald Trump's tariff plans could increase inflation by as much as 1.2 percentage points if they are fully implemented.\nThe post Trump tariffs could push up inflation: senior Fed official appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/trump-tariffs-could-push-up-inflation-senior-fed-official/article",
    "timestamp": "2025-03-26T19:10:33Z"
  },
  {
    "title": "PublicSquare Is an Inadvertent Gift to People Who Don’t Want to Fund Fascism",
    "description": "I don’t know where I heard about PublicSquare, and I’m not sure why people in my sphere (including me) are just now learning about this four-year-old, not-new company. Probably because it’s stupid and who cares? But for whatever reason, all of my algorithms i…",
    "link": "https://www.thestranger.com/news/2025/03/25/79983467/publicsquare-is-an-inadvertent-gift-to-people-who-dont-want-to-fund-fascism",
    "timestamp": "2025-03-26T19:10:00Z"
  },
  {
    "title": "Taiwan's silicon crucible: Chris Miller dissects how Trump's tariff blitz reshapes US-China chip war dynamics",
    "description": "In the shadow of broader trade tensions, tariffs on Chinese goods have quietly doubled during the first two months of Donald Trump's second term—a significant economic shift that has gone largely unnoticed. Renowned \"Chip War\" author Chris Miller brought this…",
    "link": "https://www.digitimes.com/news/a20250325VL209/taiwan-war-tsmc.html",
    "timestamp": "2025-03-26T19:10:00Z"
  }
]