[
  {
    "title": "Major Japanese automakers wary of Trump tariffs",
    "description": "The U.S. president says he plans to impose tariffs of 25% on automobile imports to the U.S., though he has not said which countries would be subject to them.",
    "link": "https://www.japantimes.co.jp/business/2025/02/19/companies/us-tariffs-japanese-carmakers/",
    "timestamp": "2025-02-19T07:31:00Z"
  },
  {
    "title": "CNBC Daily Open: The S&P 500 notches a record — investors are unfazed by Trump’s blitz",
    "description": "U.S. President Donald Trump suggested Ukraine was to blame for Russia's invasion of the country, and his administration left strict merger rules intact.",
    "link": "https://www.cnbc.com/2025/02/19/cnbc-daily-open-the-sp-500-notches-a-record-amid-trump-uncertainty.html",
    "timestamp": "2025-02-19T07:30:01Z"
  },
  {
    "title": "Trump floats 25% tariffs on US car, drug, chip imports",
    "description": "Move would be dramatic widening of trade war",
    "link": "https://www.irishtimes.com/business/2025/02/19/trump-floats-25-tariffs-on-us-car-drug-chip-imports/",
    "timestamp": "2025-02-19T07:29:30Z"
  },
  {
    "title": "Hamas offers to release all captives for end to Israel’s war on Gaza",
    "description": "Hamas says it seeks a lasting ceasefire and a full Israeli pullout, rejecting conditions for its removal from Gaza.",
    "link": "https://www.aljazeera.com/news/2025/2/19/hamas-offers-to-release-all-captives-for-end-to-israels-war-on-gaza",
    "timestamp": "2025-02-19T07:23:23Z"
  },
  {
    "title": "Did Biden ‘abandon’ NASA astronauts? Elon Musk makes startling claims about Sunita Williams, Butch Wilmore",
    "description": "Elon Musk and US President Donald Trump have accused former President Joe Biden of deliberately leaving two NASA astronauts stranded on the International Space Station (ISS) for \"political reasons.\" Astronauts Sunita Williams and Butch Wilmore were meant to r…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-biden-abandon-nasa-astronauts-elon-musk-makes-startling-claims-about-sunita-williams-butch-wilmore/articleshow/118379615.cms",
    "timestamp": "2025-02-19T07:19:04Z"
  },
  {
    "title": "US on the brink of bankruptcy? Elon Musk and Trump weigh in",
    "description": "Tesla CEO and DOGE Head Elon Musk criticised the US spending and warned of potential bankruptcy due to a $2 trillion deficit. He highlighted ineffective tax expenditure and waste, fraud, and abuse. US President Donald Trump agreed, pointing to inflation and e…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-on-the-brink-of-bankruptcy-elon-musk-and-trump-weigh-in/articleshow/118380100.cms",
    "timestamp": "2025-02-19T07:11:18Z"
  },
  {
    "title": "Washington’s auto tariffs to be around 25 percent",
    "description": "President Donald Trump said on Feb. 18 that U.S. tariffs on imported cars would be around 25 percent, providing new information on duties he is expected to unveil around April 2.",
    "link": "https://www.hurriyetdailynews.com/washingtons-auto-tariffs-to-be-around-25-percent-206000",
    "timestamp": "2025-02-19T07:10:56Z"
  },
  {
    "title": "Video: White House Shares Footage Of Illegal Migrants In Chains, Handcuffs",
    "description": "The White House has posted a controversial video showing undocumented immigrants being shackled and led onto a deportation flight from Seattle.",
    "link": "https://www.ndtv.com/world-news/us-illegal-migrants-video-white-house-shares-footage-of-illegal-migrants-in-chains-handcuffs-7743973",
    "timestamp": "2025-02-19T07:07:24Z"
  },
  {
    "title": "EU to push forward with Apple and Meta investigations",
    "description": "Next month, the European Union will announce whether Apple and Meta have adhered to the Digital Markets Act rules. Teresa Ribera, the competition chief for the bloc, confirmed this in an interview with Reuters.\n\nShe noted that the Union would not back down on…",
    "link": "https://www.gsmarena.com/eu_to_push_forward_with_apple_and_meta_investigations-news-66605.php",
    "timestamp": "2025-02-19T07:03:01Z"
  },
  {
    "title": "Zuckerberg's Meta under Trump: 'As an American, my only option is to quit its platforms'",
    "description": "With Meta’s new policy changes for American users, many are moving to alternative platforms for free speech protection.",
    "link": "https://www.thejournal.ie/readme/freedom-of-speech-meta-freedom-of-speech-freedom-of-speech-on-instagram-6620108-Feb2025/",
    "timestamp": "2025-02-19T07:00:46Z"
  },
  {
    "title": "Madan Sabnavis: De-dollarization is an idea whose time hasn’t come",
    "description": "The US froze Russia’s dollar assets in 2022 and stunned global holders of US bonds as forex reserves. But the world is stuck with dollar dominance as no other currency can take over its role.",
    "link": "https://www.livemint.com/opinion/online-views/dedollarization-dollar-assets-forex-reserves-global-trade-currency-renminbi-yuan-yen-pound-euro-imf-donald-trump-trade-11739879691245.html",
    "timestamp": "2025-02-19T07:00:13Z"
  },
  {
    "title": "A Prayer for Leonard Peltier",
    "description": "Indigenous political prisoner Leonard Peltier finally returns home. In the last moments of his presidency, Joe Biden commuted his two consecutive life sentences to home confinement. Many in Indian Country see this executive clemency as a significant victory i…",
    "link": "https://www.counterpunch.org/?p=354957",
    "timestamp": "2025-02-19T07:00:04Z"
  },
  {
    "title": "Mexico: Serious Deficiencies in Homicide Investigations",
    "description": "Officials from the forensic medical service place unidentified bodies in a mass grave near Ciudad Juárez, Chihuahua, Mexico, March 15, 2024. \n © 2024 Luis Torres/EPA-EFE/Shutterstock\n \n \n\n\n \nMexican authorities are failing to adequately investigate high numbe…",
    "link": "https://www.hrw.org/news/2025/02/19/mexico-serious-deficiencies-homicide-investigations",
    "timestamp": "2025-02-19T07:00:00Z"
  },
  {
    "title": "Trump’s Gaza Plan: A Green Light for Ethnic Cleansing?",
    "description": "Let’s be clear: the forced displacement of Palestinians is not a new idea. US President Donald Trump’s latest proposal to take “long-term ownership” of Gaza, to “clean out” the “mess”, and to turn it into a “Riviera of the Middle East” is just the latest iter…",
    "link": "https://www.counterpunch.org/2025/02/19/trumps-gaza-plan-a-green-light-for-ethnic-cleansing/",
    "timestamp": "2025-02-19T06:59:04Z"
  },
  {
    "title": "Brazil’s former president Jair Bolsonaro charged with leading plot to overthrow government",
    "description": "Charges come after two-year investigation into election-denying movement that culminated in riots",
    "link": "https://www.irishtimes.com/world/americas/2025/02/19/brazils-former-president-jair-bolsonaro-charged-with-leading-plot-to-overthrow-government/",
    "timestamp": "2025-02-19T06:56:11Z"
  },
  {
    "title": "From Tariffs to Turmoil",
    "description": "Donald Trump announced 25 percent tariffs on foreign steel and aluminum imports on February 10, doubling down on his protectionist agenda to “boost” the U.S. economy through import taxes, a move that could disrupt trade with key partners. Set to take effect o…",
    "link": "https://www.counterpunch.org/2025/02/19/from-tariffs-to-turmoil/",
    "timestamp": "2025-02-19T06:55:48Z"
  },
  {
    "title": "Why Education “Reformers” Will Find a Home in the Trump Administration",
    "description": "During Donald Trump’s first presidential term and the Joe Biden presidential administration, proponents of education reform declared their movement dead. Their well-funded campaign to blame teachers for low scores on standardized tests, threaten public school…",
    "link": "https://www.counterpunch.org/2025/02/19/why-education-reformers-will-find-a-home-in-the-trump-administration/",
    "timestamp": "2025-02-19T06:55:03Z"
  },
  {
    "title": "Trump bashes Zelensky, 'confident' on Ukraine deal",
    "description": "President Donald Trump sniped at Ukrainian leader Volodymyr Zelensky Tuesday and effectively blamed him for Moscow's invasion — even as he said he was more confident of a deal to end the war after U.S.-Russia talks.",
    "link": "https://www.hurriyetdailynews.com/trump-bashes-zelensky-confident-on-ukraine-deal-205998",
    "timestamp": "2025-02-19T06:53:25Z"
  },
  {
    "title": "Mayor of London says Trump ‘absolutely’ welcome to visit UK after previous rally to ban president",
    "description": "Mayor of London Sir Sadiq Khan has said that President Donald Trump is “absolutely” welcome to visit the UK after previously rallying for the government to ban him from visiting.  In 2019, Sir Khan urged the UK government to ban the then-president ahead of hi…",
    "link": "https://www.thepinknews.com/2025/02/19/sadiq-khan-donald-trump/",
    "timestamp": "2025-02-19T06:48:25Z"
  },
  {
    "title": "Opinion: US, Russia, China Have Found A New 'Negotiating Table' In Middle East",
    "description": "The Saudis are not stopping just at giving space to the US and Russia to debate Ukraine. As per reports, Riyadh is also open to hosting talks between Iran and the US over the former&#039;s nuclear programme.",
    "link": "https://www.ndtv.com/opinion/us-russia-china-have-found-a-new-negotiating-table-in-middle-east-7744295",
    "timestamp": "2025-02-19T06:45:33Z"
  },
  {
    "title": "Trump to Gaza: We Will Replace You",
    "description": "“They are coming to replace us.” It sounds like the tagline of a horror movie. And indeed, what the far right whispers into ears, chants at hate-filled rallies, and translates into odious legislation in white-majority countries is very much a horror movie in …",
    "link": "https://www.counterpunch.org/2025/02/19/trump-to-gaza-we-will-replace-you/",
    "timestamp": "2025-02-19T06:45:10Z"
  },
  {
    "title": "How to Find Climate Data and Science the Trump Administration Doesn’t Want You to See",
    "description": "Government scientists at NOAA collect and provide crucial public information about coastal conditions that businesses, individuals and other scientists rely on. NOAA’s National Ocean Service Eric Nost, University of Guelph and Alejandro Paz, Massachusetts Ins…",
    "link": "https://www.counterpunch.org/2025/02/19/how-to-find-climate-data-and-science-the-trump-administration-doesnt-want-you-to-see/",
    "timestamp": "2025-02-19T06:44:06Z"
  },
  {
    "title": "Trump says AP will continue to be curtailed at White House until it changes style to Gulf of America",
    "description": "President Donald Trump said Tuesday that he will continue to restrict The Associated Press' access to his events and news conferences until the news outlet goes along with his renaming of the Gulf of Mexico in its reports. He acknowledged that the move was a …",
    "link": "https://japantoday.com/category/world/trump-says-ap-will-continue-to-be-curtailed-at-white-house-until-it-changes-style-to-gulf-of-america",
    "timestamp": "2025-02-19T06:42:13Z"
  },
  {
    "title": "Top ministry officials to meet US envoy over frozen US health aid",
    "description": "Health CS admits a funding gap of Sh30 billion after President Trump's order. She has also asked county governments to chip in and absorb some staff.",
    "link": "http://www.standardmedia.co.ke/national/article/2001512084/top-ministry-officials-to-meet-us-envoy-over-frozen-us-health-aid",
    "timestamp": "2025-02-19T06:40:56Z"
  },
  {
    "title": "\"Nobody Can Argue With Me\": Trump Recalls Reciprocal Tariff Talks With PM",
    "description": "In a joint televised interview with billionaire Elon Musk, US President Donald Trump made it clear that India will not be spared from Washington&#039;s reciprocal tariffs.",
    "link": "https://www.ndtv.com/world-news/donald-trump-heres-what-were-going-to-do-what-trump-told-pm-modi-on-reciprocal-tariffs-7744243",
    "timestamp": "2025-02-19T06:39:49Z"
  },
  {
    "title": "Small and midcap stocks may face volatility, but long-term returns still strong: Vikas Khemani",
    "description": "​Every day there was some negative news flow, global concern, geopolitical concern, inflation concern, oil prices, commodity, everything was kind of uncertain. But if you look at in that period, whether you bought smallcaps or largecaps, that vintage really d…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/small-and-midcap-stocks-may-face-volatility-but-long-term-returns-still-strong-vikas-khemani/articleshow/118378883.cms",
    "timestamp": "2025-02-19T06:39:08Z"
  },
  {
    "title": "SEC Acknowledges Bitwise’s Spot XRP ETF Filing Adding to a Crowded List",
    "description": "SEC's approval of Bitwise XRP ETF will depend on public feedback and the filing’s compliance with its investor protection standards.",
    "link": "https://decrypt.co/306629/sec-acknowledges-bitwises-spot-xrp-etf-filing",
    "timestamp": "2025-02-19T06:38:39Z"
  },
  {
    "title": "In Joint Interview, Trump Outlines Elon Musk's Role As 'Enforcer-In-Chief'",
    "description": "US President Donald Trump painted Elon Musk as his enforcer-in-chief Tuesday, hailing the tech billionaire&#039;s zeal in implementing the blizzard of executive orders.",
    "link": "https://www.ndtv.com/world-news/in-joint-interview-donald-trump-outlines-elon-musks-role-as-enforcer-in-chief-7744242",
    "timestamp": "2025-02-19T06:38:33Z"
  },
  {
    "title": "Clive Palmer, Pauline Hanson trade barbs over failed bid to unify parties",
    "description": "Entering their 70s, Clive Palmer and Pauline Hanson attempted to unify their parties to capture more disaffected voters. But the deal fell apart.",
    "link": "https://www.abc.net.au/news/2025-02-19/clive-palmer-pauline-hanson-fail-unify-parties/104957330",
    "timestamp": "2025-02-19T06:37:52Z"
  },
  {
    "title": "The Federal Government is Too Small",
    "description": "When Donald Trump was born, the federal government workforce made up 4.5 percent of all nonfarm workers (Figure 1). Today, the federal workforce makes up only 1.5 percent. This is a massive two-thirds reduction from Trump’s birth year. Contrary to the claims …",
    "link": "https://www.counterpunch.org/2025/02/19/the-federal-government-is-too-small/",
    "timestamp": "2025-02-19T06:34:52Z"
  },
  {
    "title": "As L.A. Victims Await Aid, Mayor Karen Bass Blames Fire Chief -- Again",
    "description": "Los Angeles Mayor Karen Bass is blaming L.A. Fire Department (LAFD) Chief Kirsten Crowley -- again -- for they city's failure to prepare adequately for the extreme winds that spread the Palisades Fire on January 7.\nThe post As L.A. Victims Await Aid, Mayor Ka…",
    "link": "https://www.breitbart.com/politics/2025/02/18/as-l-a-victims-await-aid-mayor-karen-bass-blames-fire-chief-again/",
    "timestamp": "2025-02-19T06:33:40Z"
  },
  {
    "title": "The Policies of Sri Lanka’s New Government: a Historic Opportunity Lost",
    "description": "On the right, Anura Kumara Dissanayake, President of Sri Lanka. On the left, Dr. S. Jaishankar, India’s Minister of External Affairs. Photo: MEAphotogallery, Flickr, CC, Can you give us a quick summary of the crisis in Sri Lanka in 2022? It began with a popul…",
    "link": "https://www.counterpunch.org/2025/02/19/the-policies-of-sri-lankas-new-government-a-historic-opportunity-lost/",
    "timestamp": "2025-02-19T06:33:30Z"
  },
  {
    "title": "Expanding Access to In Vitro Fertilization - The White House",
    "description": "Expanding Access to In Vitro FertilizationThe White House Trump wants to lower the cost of IVF. New executive order seeks ideas to do thatNPR Trump signs order to study how to expand IVF and calls for 'radical transparency' from governmentLos Angeles Times Tr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176301919",
    "timestamp": "2025-02-19T06:32:56Z"
  },
  {
    "title": "German minister backtracks on derogation from organic pasture rules",
    "description": "In today's edition of the Capitals, read about Spain's ‘competitiveness lab’, Prague-Bratislava mending attempts, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-german-minister-backtracks-on-derogation-from-organic-pasture-rules/",
    "timestamp": "2025-02-19T06:31:08Z"
  },
  {
    "title": "Australian aluminium manufacturers brace for impact of Donald Trump's tariffs",
    "description": "The federal government may need to take measures to protect the local aluminium industry if Donald Trump's 25 per cent tariffs go ahead, warns the nation's largest aluminium manufacturer.",
    "link": "https://www.abc.net.au/news/2025-02-19/aluminium-manufacturers-brace-for-impact-of-trumps-tariffs/104955344",
    "timestamp": "2025-02-19T06:28:26Z"
  },
  {
    "title": "Nearly 300 deportees from U.S. held in Panama hotel",
    "description": "The migrants hailed from 10 mostly Asian countries the U.S. has difficulty deporting migrants to directly. Panama is being used as a stopover.",
    "link": "https://www.npr.org/2025/02/19/nx-s1-5301668/panama-us-deportees-hotel",
    "timestamp": "2025-02-19T06:28:11Z"
  },
  {
    "title": "AI 'hallucinations' in court papers spell trouble for lawyers",
    "description": "Advances in generative AI are helping reduce the time lawyers need to research and draft legal briefs, leading many law firms to contract with AI vendors or build their own AI tools. Sixty-three percent of lawyers surveyed by Reuters' parent company Thomson R…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-hallucinations-in-court-papers-spell-trouble-for-lawyers/articleshow/118378541.cms",
    "timestamp": "2025-02-19T06:26:31Z"
  },
  {
    "title": "Elon Musk Mulls $5,000 Checks For Taxpaying Americans Using DOGE Savings, But X Users Unsure",
    "description": "Elon Musk said Tuesday he will consult with the U.S. president regarding a proposal to take a portion of the DOGE's total savings and send them as tax refund checks to taxpaying Americans across the country.",
    "link": "https://www.ibtimes.com/elon-musk-mulls-5000-checks-taxpaying-americans-using-doge-savings-x-users-unsure-3764215",
    "timestamp": "2025-02-19T06:24:23Z"
  },
  {
    "title": "U.S. CISA adds SonicWall SonicOS and Palo Alto PAN-OS flaws to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds SonicWall SonicOS and Palo Alto PAN-OS vulnerabilities to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added Apple iOS and iPadO…",
    "link": "https://securityaffairs.com/174375/security/u-s-cisa-adds-sonicwall-sonicos-and-palo-alto-pan-os-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-02-19T06:24:17Z"
  },
  {
    "title": "Watch: Trump and Musk discuss conflict of interests",
    "description": "Asked about potential conflicts between his businesses and US government role, Musk said he’s “never asked the president for anything.”",
    "link": "https://www.bbc.com/news/videos/c1enp4gpdgqo",
    "timestamp": "2025-02-19T06:22:07Z"
  },
  {
    "title": "Hamas, Israel agree return of six hostages, bodies held in Gaza",
    "description": "Hamas and Israel announced a deal Tuesday for the release of six living hostages from Gaza and the return of four captives' bodies — including, the militants said, the remains of two young boys seen as national symbols back home.",
    "link": "https://www.hurriyetdailynews.com/hamas-israel-agree-return-of-six-hostages-bodies-held-in-gaza-205993",
    "timestamp": "2025-02-19T06:21:26Z"
  },
  {
    "title": "EU Eyes Stricter Food Import Rules In Agriculture Policy Review",
    "description": "The EU plans to crackdown on food imports that do not meet its standards as part of an agricultural policy review to be published Wednesday that looks to appease disgruntled farmers amid global trade tensions.",
    "link": "https://www.ibtimes.com/eu-eyes-stricter-food-import-rules-agriculture-policy-review-3764217",
    "timestamp": "2025-02-19T06:21:17Z"
  },
  {
    "title": "New Arena, New Attitudes? Cash Spat In Spotlight At UN Nature Talks",
    "description": "The world's biggest nature conservation conference resumes in Rome next week for an urgent attempt at overcoming a deadlock between northern and southern countries over funding for nature protection.",
    "link": "https://www.ibtimes.com/new-arena-new-attitudes-cash-spat-spotlight-un-nature-talks-3764216",
    "timestamp": "2025-02-19T06:18:23Z"
  },
  {
    "title": "New Arena, New Attitudes? Cash Spat In Spotlight At UN Nature Talks",
    "description": "The world's biggest nature conservation conference resumes in Rome next week for an urgent attempt at overcoming a deadlock between northern and southern countries over funding for nature protection.",
    "link": "https://www.ibtimes.com.au/new-arena-new-attitudes-cash-spat-spotlight-un-nature-talks-1856317",
    "timestamp": "2025-02-19T06:18:20Z"
  },
  {
    "title": "Insider threat: cyber security experts on giving Elon Musk and DOGE the keys to US government IT systems",
    "description": "What Elon Musk has seen, he can never unsee.",
    "link": "https://theconversation.com/insider-threat-cyber-security-experts-on-giving-elon-musk-and-doge-the-keys-to-us-government-it-systems-250046",
    "timestamp": "2025-02-19T06:12:14Z"
  },
  {
    "title": "Asian markets swing as traders assess tariff threats, US-Russia talks",
    "description": "Asian markets were mixed Wednesday after President Donald Trump broadened his tariff threats, while traders were also assessing the geopolitical outlook after the first high-level official US-Russia talks since the invasion of Ukraine. Regional investors stru…",
    "link": "https://punchng.com/asian-markets-swing-as-traders-assess-tariff-threats-us-russia-talks/",
    "timestamp": "2025-02-19T06:11:21Z"
  },
  {
    "title": "Russia, US to name negotiators on ending Ukraine war",
    "description": "Russia and the United States on Tuesday agreed to establish teams to negotiate a path to ending the war in Ukraine after talks that drew a strong rebuke from Kiev over its exclusion.",
    "link": "https://www.hurriyetdailynews.com/russia-us-to-name-negotiators-on-ending-ukraine-war-205991",
    "timestamp": "2025-02-19T06:09:57Z"
  },
  {
    "title": "EU to crack down on substandard food imports",
    "description": "The EU plans to crack down on food imports that do not meet its standards as part of an agricultural policy review to be published Wednesday that looks to appease disgruntled farmers amid global trade tensions. The European Commission is due to unveil a new b…",
    "link": "https://punchng.com/eu-to-crack-down-on-substandard-food-imports/",
    "timestamp": "2025-02-19T06:06:06Z"
  },
  {
    "title": "US withdrawal from UN Human Rights Council sparks concerns about China",
    "description": "Tibetan and Uyghur groups and other activists have expressed concern over the U.S. withdrawal from the U.N. Human Rights Council, saying the move will remove a key voice speaking out against autocratic countries that don't respect human rights, including Chin…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/02/china-250218-rfa04.htm",
    "timestamp": "2025-02-19T06:04:29Z"
  },
  {
    "title": "US won’t withdraw forces from Europe, Trump envoy assures Poland",
    "description": "Duda and Kellogg discussed Russian hybrid warfare and concerns about US engagement on the continent.",
    "link": "https://www.euractiv.com/section/politics/news/us-wont-withdraw-forces-from-europe-trump-envoy-assures-poland/",
    "timestamp": "2025-02-19T06:02:57Z"
  },
  {
    "title": "Zelensky says Ukraine 'greatly' values relations with Türkiye",
    "description": "Ukraine \"greatly\" values its relations with Türkiye and the stance on the country's \"sovereignty and territorial integrity,\" said President Volodymyr Zelenskyy, who met Turkish President Recep Tayyip Erdoğan in Ankara on Tuesday.",
    "link": "https://www.hurriyetdailynews.com/zelensky-says-ukraine-greatly-values-relations-with-turkiye-205990",
    "timestamp": "2025-02-19T06:01:25Z"
  },
  {
    "title": "“The Russia Hoax”: A tale of power, manipulation and political intrigue",
    "description": "In 2016, former FBI Director James Comey launched an investigation into then-candidate Donald Trump, labeled as a “counterintelligence matter,” despite lack of credible evidence, setting the stage for a two-year saga involving the FBI, U.S. intelligence agenc…",
    "link": "https://www.naturalnews.com/2025-02-19-russia-hoax-tale-of-power-manipulation-intrigue.html",
    "timestamp": "2025-02-19T06:00:00Z"
  },
  {
    "title": "With just ONE HOUR to decide, Zelensky REJECTS U.S. proposal for rare earth minerals in exchange for military aid",
    "description": "With just one hour to decide, Ukrainian President Volodymyr Zelensky rejected a U.S. proposal to gain access to Ukraine’s rare earth mineral reserves in exchange for billions in military aid. The proposal was presented during U.S. Treasury Secretary Scott Bes…",
    "link": "https://www.naturalnews.com/2025-02-19-zelensky-rejects-us-proposal-rare-earth-minerals.html",
    "timestamp": "2025-02-19T06:00:00Z"
  },
  {
    "title": "Snart dags för reboot av Daredevil",
    "description": "Kolla in teaser för Daredevil: Born Again\n\n\n\n\n\n\n\n\n\n\nDisney har släppt en teaser för sin kommande reboot av Daredevil, en tv-serie som handlar om den blinde advokaten Matt Murdoch (Charlie Cox) som på sin fritid även lattjar runt som superhjälten Daredevil. \n\n…",
    "link": "https://feber.se/film/snart-dags-for-reboot-av-daredevil/476905/",
    "timestamp": "2025-02-19T06:00:00Z"
  },
  {
    "title": "U.S. and Russia seek peace in Ukraine, leaving Zelensky in panic over potential aid cuts",
    "description": "The U.S. and Russia agreed to work toward ending the Ukraine war during high-level talks in Riyadh, signaling a potential thaw in relations. Ukraine was excluded from the talks, sparking outrage from President Zelensky, who fears being sidelined in a deal tha…",
    "link": "https://www.naturalnews.com/2025-02-19-russia-peacve-ukraine-zelensky-panic-cuts.html",
    "timestamp": "2025-02-19T06:00:00Z"
  },
  {
    "title": "The case for holding Norm Eisen accountable: Deep State’s legal mastermind exposed",
    "description": "Norm Eisen, a Harvard Law graduate and friend of former President Obama, is seen as a key figure in what conservatives view as a coordinated effort to undermine President Donald Trump’s presidency. Eisen’s involvement in the so-called “Color Revolution” again…",
    "link": "https://www.naturalnews.com/2025-02-19-norm-eisen-deep-states-legal-mastermind-exposed.html",
    "timestamp": "2025-02-19T06:00:00Z"
  },
  {
    "title": "Trump Wants Eric Adams’ Charges to Go Away. This Biden-Nominated Judge Gets the Final Say",
    "description": "Trump wants the New York mayor’s charges to go away. Dale Ho gets the final say.",
    "link": "https://time.com/7258728/judge-dale-ho-eric-adams-charges-dismissal-trump-biden/",
    "timestamp": "2025-02-19T06:00:00Z"
  },
  {
    "title": "Senate advances Kash Patelâ\u0080\u0099s FBI Director nomination, final vote expected Thursday",
    "description": "The Senate advanced Kash Patel’s nomination for FBI director in a 48-45 party-line vote, setting the stage for a final confirmation vote Thursday. Patel, a Trump nominee, pledges to combat violent crime, illegal immigration, and drug trafficking while restori…",
    "link": "https://www.naturalnews.com/2025-02-19-senate-kash-patel-fbi-director.html",
    "timestamp": "2025-02-19T06:00:00Z"
  },
  {
    "title": "Trump realigns DHS, Removes Climate Initiatives: A new era of national security focus",
    "description": "President Donald Trump orders DHS to eliminate climate change activities and terminology, marking a significant shift away from previous administrations’ climate-focused policies. The directive is seen as an attempt to redirect resources towards immediate thr…",
    "link": "https://www.naturalnews.com/2025-02-19-trump-realigns-dhs-removes-climate-change-new-era-national-security-focus.html",
    "timestamp": "2025-02-19T06:00:00Z"
  },
  {
    "title": "With Trump threatening tariffs, Porsche, BMW look to next German govt for way out of crisis",
    "description": "Germany’s auto industry is facing challenges with declining sales, high production costs, and trade tensions. The upcoming election is crucial as parties debate over necessary steps to revive growth. Key issues include tariffs, high manufacturing costs, depen…",
    "link": "https://economictimes.indiatimes.com/news/international/business/with-trump-threatening-tariffs-porsche-bmw-look-to-next-german-government-for-way-out-of-crisis/articleshow/118377546.cms",
    "timestamp": "2025-02-19T05:57:37Z"
  },
  {
    "title": "Just, lasting peace in Ukraine possible, Erdoğan tells NATO's Rutte",
    "description": "A just and lasting peace on war in Ukraine is possible, Turkish President Recep Tayyip Erdoğan told NATO Secretary General Mark Rutte over a phone call on Tuesday, Türkiye's Communications Directorate said.",
    "link": "https://www.hurriyetdailynews.com/just-lasting-peace-in-ukraine-possible-erdogan-told-rutte-205989",
    "timestamp": "2025-02-19T05:49:00Z"
  },
  {
    "title": "Senate advances nomination of Kash Patel, Trump's pick for FBI director",
    "description": "The Senate voted Tuesday along party lines to advance the nomination of Kash Patel, President Donald Trump's pick for FBI director, setting up a final vote on the Trump ally.",
    "link": "https://www.foxnews.com/politics/senate-advances-nomination-kash-patel-trumps-pick-fbi-director",
    "timestamp": "2025-02-19T05:47:05Z"
  },
  {
    "title": "You can never truly go back",
    "description": "> But because of how information works in our new world run by digital platforms, the difference between the illusion of power and the real thing is vanishingly small. And in an attention economy, they effectively become the same thing over time.",
    "link": "https://www.garbageday.email/p/you-can-never-truly-go-back",
    "timestamp": "2025-02-19T05:47:01Z"
  },
  {
    "title": "Robert De Niro on his TV debut as a US president: We need heroes like this on screen and in the real world too",
    "description": "De Niro’s political thriller Zero Day couldn’t be better timed. The actor, who plays a courageous US president, has been one of Trump’s most outspoken public critics",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/02/19/robert-de-niro-on-his-tv-debut-as-a-us-president-we-need-heroes-like-this-on-screen-and-in-the-real-world-too/",
    "timestamp": "2025-02-19T05:45:00Z"
  },
  {
    "title": "Trump imposes his vision on America in departure from first-term stumbles",
    "description": "President Donald Trump is going further than ever before to enforce his decisions",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-imposes-vision-america-departure-term-stumbles-118953426",
    "timestamp": "2025-02-19T05:42:27Z"
  },
  {
    "title": "Dollar firm on Ukraine tensions, kiwi bounces as RBNZ signals slower easing pace",
    "description": "TOKYO : The U.S. dollar steadied on Wednesday as investors eyed tariff threats and tense Russia-Ukraine negotiations, while the New Zealand dollar clawed back losses after the central bank indicated its aggressive rate cuts were set to slow.The Reserve Bank o…",
    "link": "https://www.channelnewsasia.com/business/dollar-firm-ukraine-tensions-kiwi-bounces-rbnz-signals-slower-easing-pace-4946411",
    "timestamp": "2025-02-19T05:40:47Z"
  },
  {
    "title": "Indian-American lawyer Kash Patel, who went viral for saying 'Jai Shree Krishna', closer to becoming FBI director. His education, family and net worth",
    "description": "Kash Patel is likely to become the next FBI director after the U.S. Senate's party-line vote advanced his nomination. Patel plans to focus on illegal immigration and violent crime but faces criticism for supporting false election fraud claims and conspiracy t…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/indian-american-lawyer-kash-patel-who-went-viral-for-saying-jai-shree-krishna-closer-to-coming-fbi-director-his-education-family-and-net-worth/articleshow/118376315.cms",
    "timestamp": "2025-02-19T05:38:04Z"
  },
  {
    "title": "Porsche, BMW Need Germany Pivot for Way Out of Crisis",
    "description": "Carmakers in Europe’s biggest economy struggle with waning sales and worsening trade ties with the US.",
    "link": "https://financialpost.com/pmn/business-pmn/porsche-bmw-need-germany-pivot-for-way-out-of-crisis",
    "timestamp": "2025-02-19T05:34:58Z"
  },
  {
    "title": "Stock market today: Asia stocks mixed as Chinese technology stocks slip",
    "description": "Asia stocks were mixed Wednesday, as Chinese technology stocks faltered after a short-term rally.",
    "link": "https://www.clickondetroit.com/business/2025/02/19/stock-market-today-asia-stocks-mixed-as-chinese-technology-stocks-slip/",
    "timestamp": "2025-02-19T05:32:47Z"
  },
  {
    "title": "Trump teases 25 percent semiconductor tariffs that will go ‘substantially higher’",
    "description": "Envisions phased introduction dependent on manufacturing commitments\nUnited States President Donald Trump has hinted at substantial tariffs on imported semiconductors.…",
    "link": "https://www.theregister.com/2025/02/19/trump_semiconductor_tariff_plan/",
    "timestamp": "2025-02-19T05:32:15Z"
  },
  {
    "title": "Nepal took a risk on a $500 million US grant. It may now regret it.",
    "description": "Nepal accepted a $500 million grant from the U.S. to expand its infrastructure, despite facing pressure from China. However, with the Trump administration's freeze on foreign aid, the project's future is uncertain. Nepali leaders fear repercussions and regret…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/nepal-took-a-risk-on-a-500-million-us-grant-it-may-now-regret-it-/articleshow/118377009.cms",
    "timestamp": "2025-02-19T05:27:57Z"
  },
  {
    "title": "ByteDance’s US Backers Say China Growth to Counter Any TikTok Ban Damage",
    "description": "Some American ByteDance investors say they don’t need US TikTok for success",
    "link": "https://financialpost.com/pmn/business-pmn/bytedances-us-backers-say-china-growth-to-counter-any-tiktok-ban-damage",
    "timestamp": "2025-02-19T05:24:49Z"
  },
  {
    "title": "Japan raises auto tariff issue with U.S. as Trump threatens hike",
    "description": "The U.S. president's threat to impose a 25% levy on car imports would likely deliver a big blow to Japan’s economy.",
    "link": "https://www.japantimes.co.jp/business/2025/02/19/economy/auto-tariff-japan-reaction/",
    "timestamp": "2025-02-19T05:21:00Z"
  },
  {
    "title": "Donald Trump imposes his vision on America in departure from first-term stumbles",
    "description": "During his second term, President Trump is taking a stronger, more controlled approach, backed by loyalists and targeting previous opposition. Changes include halting the Consumer Financial Protection Bureau's activities, dropping charges against allies, and …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-imposes-his-vision-on-america-in-departure-from-first-term-stumbles/articleshow/118376629.cms",
    "timestamp": "2025-02-19T05:17:11Z"
  },
  {
    "title": "Tesla selects showroom locations in New Delhi, Mumbai for India debut, sources say",
    "description": "The company also posted job ads this week for 13 mid-level roles in India, including some store and customer relationship managers",
    "link": "https://www.thehindubusinessline.com/companies/tesla-selects-showroom-locations-in-new-delhi-mumbai-for-india-debut-sources-say/article69236878.ece",
    "timestamp": "2025-02-19T05:15:13Z"
  },
  {
    "title": "Dr. Reddy’s shares fall 6%, Aurobindo Pharma 10% as Trump signals 25% tariffs on pharma imports",
    "description": "Dr. Reddy’s Laboratories fell 5.8% to Rs 1,128.90, while Zydus Lifesciences dropped 4.8%. Sun Pharma, India's largest drugmaker, declined by 3.2% to Rs 1,647.35, becoming the top loser on the BSE Sensex and one of the top five decliners on the Nifty 50.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-shares-fall-6-aurobindo-pharma-10-as-trump-signals-25-tariffs-on-pharma-imports/articleshow/118376492.cms",
    "timestamp": "2025-02-19T05:12:54Z"
  },
  {
    "title": "Valuations looking reasonable, but earnings growth remains a concern: Dipan Mehta",
    "description": "​Specifically, we do not have a stock list ready, like a shopping list per se. We are still observing what has happened in the quarter which has gone by.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/valuations-looking-reasonable-but-earnings-growth-remains-a-concern-dipan-mehta/articleshow/118376238.cms",
    "timestamp": "2025-02-19T05:07:08Z"
  },
  {
    "title": "History unearthed: What if Trump succeeded in ethnically Cleansing Gaza?",
    "description": "( Middle East Monitor ) - US President Donald Trump’s son-in-law Jared Kushner said in a 2020 interview that he had read 25 books on the Middle East. Such intellectual bravado wouldn’t matter if it weren’t for the fact that Kushner served as the President’s M…",
    "link": "https://www.juancole.com/2025/02/unearthed-succeeded-ethnically.html",
    "timestamp": "2025-02-19T05:06:39Z"
  },
  {
    "title": "Sean Hannity’s Donald Trump-Elon Musk Sit Down Interview: Plenty Of Softballs And Few Surprises",
    "description": "Perhaps the most unexpected thing about Sean Hannity’s hour-long sit down with Donald Trump and Elon Musk — a first — was the initial question that the Fox News host posed to the duo. “So he’s working for free with DOGE. He’s kind of put a lot of his life on …",
    "link": "http://deadline.com/2025/02/trump-musk-sean-hannity-fox-news-1236294348/",
    "timestamp": "2025-02-19T05:05:44Z"
  },
  {
    "title": "Twilight of the Fourth Estate",
    "description": "The press is less bothered by state interference than by its ideological hobgoblins.\nThe post Twilight of the Fourth Estate appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/twilight-of-the-fourth-estate/",
    "timestamp": "2025-02-19T05:05:00Z"
  },
  {
    "title": "韓·中 외무장관 회담 어떤 소통 할까?",
    "description": "By driving a wedge between the US and South Africa, a leading member of the so-called Global South, Donald Trump is strengthening China’s hand https://t.co/vL8W1c8fgw— Bloomberg Middle East (@middleeast) February 11, 2025 On today’s Big Take DC podcast, Bloom…",
    "link": "https://ryueyes11.tistory.com/511491",
    "timestamp": "2025-02-19T05:04:35Z"
  },
  {
    "title": "The Heart (or Graphite) of Greed: Why Donald Trump’s Obsession with Greenland Is All About China",
    "description": "( Tomdispatch.com ) - In early January, Donald Trump Jr.’s private plane landed on a snowy airfield in Greenland. There was little fanfare upon his arrival, but his 14 million social-media fans were certainly tagging along. “Greenland coming in hot…well, actu…",
    "link": "https://www.juancole.com/2025/02/graphite-obsession-greenland.html",
    "timestamp": "2025-02-19T05:04:02Z"
  },
  {
    "title": "Judge refuses to block Elon Musk from accessing sensitive government data",
    "description": "Serious concerns have been raised about Musk and his Department of Government Efficiency.",
    "link": "https://7news.com.au/news/judge-refuses-to-block-elon-musk-from-accessing-sensitive-government-data-c-17775148",
    "timestamp": "2025-02-19T05:03:25Z"
  },
  {
    "title": "Europe’s War Party Takes Aim at Trump",
    "description": "The U.S. president should press ahead in pursuit of Ukraine peace.\nThe post Europe’s War Party Takes Aim at Trump appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/europes-war-party-takes-aim-at-trump/",
    "timestamp": "2025-02-19T05:03:00Z"
  },
  {
    "title": "Nearly 300 deportees from US held in Panama hotel as officials try to return them to their countries",
    "description": "Panama is detaining in a hotel nearly 300 people from various countries deported by the United States, not allowing them to leave while waiting for international authorities to organize a return to their countries",
    "link": "https://abcnews.go.com/International/wireStory/300-deportees-us-held-panama-hotel-officials-return-118947330",
    "timestamp": "2025-02-19T05:02:21Z"
  },
  {
    "title": "Will Argentinian President Milei's LIBRA 'Fiasco' be A Deathblow for Memecoin Craze?",
    "description": "Will Argentinian President Milei's LIBRA 'Fiasco' be A Deathblow for Memecoin Craze?coindesk.com",
    "link": "https://www.coindesk.com/business/2025/02/18/will-argentina-president-milei-s-crypto-fisco-be-a-deathblow-for-memecoin-craze",
    "timestamp": "2025-02-19T05:01:08Z"
  },
  {
    "title": "‘I love the president’: Trump, Musk heap on praise in gushy interview",
    "description": "US president claims DOGE will save hundreds of billions of dollars without cutting healthcare and welfare benefits.",
    "link": "https://www.aljazeera.com/news/2025/2/19/trump-musk-lavish-each-other-with-praise-as-they-defend-cost-cutting-drive",
    "timestamp": "2025-02-19T05:01:04Z"
  },
  {
    "title": "While client climate commitments waver, some media agencies are doubling down",
    "description": "Agencies hope B Corp status is still an effective calling card, but momentum among brands is turning due to a changed political climate.",
    "link": "http://digiday.com/marketing/while-client-climate-commitments-waver-some-media-agencies-are-doubling-down/",
    "timestamp": "2025-02-19T05:01:00Z"
  },
  {
    "title": "Hallelujah! President Trump Actually Wants To Give Peace a Chance",
    "description": "Wow! These are the most powerful and consequential 36 words spoken by any US President. Ever. “One of the first meetings I want to have is with President Xi of China, President Putin of Russia, and I want to say, ‘let’s cut our military budget in half.’ And w…",
    "link": "https://original.antiwar.com/david_stockman/2025/02/18/hallelujah-president-trump-actually-wants-to-give-peace-a-chance/",
    "timestamp": "2025-02-19T05:00:58Z"
  },
  {
    "title": "Trump’s Gaza Plan: A Green Light for Ethnic Cleansing?",
    "description": "Let’s be clear: the forced displacement of Palestinians is not a new idea. US President Donald Trump’s latest proposal to take “long-term ownership” of Gaza, to “clean out” the “mess”, and to turn it into a “Riviera of the Middle East” is just the latest iter…",
    "link": "https://original.antiwar.com/ramzy-baroud/2025/02/18/trumps-gaza-plan-a-green-light-for-ethnic-cleansing/",
    "timestamp": "2025-02-19T05:00:57Z"
  },
  {
    "title": "Senate advances nomination of Trump FBI pick Kash Patel",
    "description": "WASHINGTON — The U.S. Senate on Tuesday voted to advance the nomination of Kash Patel to be the director of the FBI, putting a staunch ally of President Donald Trump and a critic of the bureau on track to run the most prominent U.S. law enforcement agency.\n\n\n…",
    "link": "https://www.voanews.com/a/senate-advances-nomination-of-trump-fbi-pick-kash-patel/7980183.html",
    "timestamp": "2025-02-19T05:00:05Z"
  },
  {
    "title": "If Zelensky does not want to negotiate with the U.S., we will negotiate with someone else",
    "description": "In the first month of Donald Trump's presidency, the U.S. government has already made strides in stabilizing the economy, curbing excessive spending, managing migration flows, deporting illegal immigrants, and reasserting America’s leadersh...",
    "link": "https://www.americanthinker.com/blog/2025/02/if_zelensky_does_not_want_to_negotiate_with_the_u_s_we_will_negotiate_with_someone_else.html",
    "timestamp": "2025-02-19T05:00:00Z"
  },
  {
    "title": "Guardians of Liberty: Trump and the Constitution",
    "description": "The United States was born not just in rebellion against a distant monarch, but in revolt against tyranny itself.  The Founding Fathers put their lives, property, wealth, and honor on the line to establish a great nation based on freedom, l...",
    "link": "https://www.americanthinker.com/articles/2025/02/guardians_of_liberty_trump_and_the_constitution.html",
    "timestamp": "2025-02-19T05:00:00Z"
  }
]