[
  {
    "title": "Woman Detained on Honeymoon Faces Deportation Despite Being Stateless",
    "description": "Ward Sakeik has been detained for four months and now faces deportation to an unknown location, her husband says.",
    "link": "https://www.newsweek.com/stateless-woman-detained-honeymoon-faces-deportation-2085161",
    "timestamp": "2025-06-13T16:08:17Z"
  },
  {
    "title": "“Game On”: Republicans in Congress Celebrate Israel’s Attack on Iran",
    "description": "Donald Trump has praised Israel’s sweeping military operation targeting Iran’s nuclear facilities and military leaders, and Republicans have already started taking up positions as faithful cheerleaders. \r\nShortly after the strikes in Iran were first reported …",
    "link": "https://newrepublic.com/post/196802/republicans-congress-celebrate-israel-attack-iran",
    "timestamp": "2025-06-13T16:08:09Z"
  },
  {
    "title": "Pizza delivery monitor alerts to secret Israel attack",
    "description": "The timing of Israel’s plan to attack Iran was top secret. But Washington pizza delivery trackers guessed something was up before the first bombs fell. About an hour before Iranian state TV first reported loud explosions in Tehran, pizza orders around the Pen…",
    "link": "https://www.digitaljournal.com/world/pizza-delivery-monitor-alerts-to-secret-israel-attack/article",
    "timestamp": "2025-06-13T16:07:20Z"
  },
  {
    "title": "House GOP Vote to Take Back Funds for NPR/PBS Imperils 'Future of Public Broadcasting'",
    "description": "The U.S. House of Representatives on Thursday narrowly approved a rescission package that would take back funding for PBS and NPR, as well international aid programs—a move that supporters of public media quickly decried.Earlier in June, the Trump White House…",
    "link": "https://www.commondreams.org/news/rescission-npr-pbs-house",
    "timestamp": "2025-06-13T16:07:11Z"
  },
  {
    "title": "How Netanyahu used a Biblical prophecy to attack Iran",
    "description": "Israel initiated a military operation against Iran, named \"Rising Lion,\" drawing inspiration from a biblical verse symbolizing Israel's strength. Prime Minister Netanyahu's placement of a handwritten note with the verse at the Western Wall foreshadowed the st…",
    "link": "https://economictimes.indiatimes.com/news/defence/how-netanyahu-used-a-biblical-prophecy-to-attack-iran/articleshow/121833888.cms",
    "timestamp": "2025-06-13T16:06:12Z"
  },
  {
    "title": "Immigration raids on California farms seen threatening businesses supplying America’s food",
    "description": "VENTURA, Calif. (AP) — Large-scale immigration raids at packinghouses and fields in California are threatening businesses that supply much of the country’s food, farm bureaus say. Dozens of farmworkers have been arrested recently after uniformed federal agent…",
    "link": "https://financialpost.com/pmn/immigration-raids-on-california-farms-seen-threatening-businesses-supplying-americas-food",
    "timestamp": "2025-06-13T16:06:03Z"
  },
  {
    "title": "Peachy Payout: Porsha Williams Wins Prenup Battle With Simon Guobadia, Reportedly Recieving $40K Alimony & Stake In $7M Mansion",
    "description": "According to a source, under the prenup deal, Porsha Williams is set to receive $40,000 monthly in alimony from her ex-husband Simon Guobadia and will keep the Rolls Royce he gifted her in 2022.\nThe post Peachy Payout: Porsha Williams Wins Prenup Battle With …",
    "link": "https://bossip.com/3124915/peachy-payout-porsha-williams-wins-prenup-battle-with-simon-guobadia-reportedly-recieving-40k-alimony-stake-in-7m-mansion/",
    "timestamp": "2025-06-13T16:05:50Z"
  },
  {
    "title": "Immigration raids on California farms seen threatening businesses supplying America’s food",
    "description": "immigration raids in California farms threaten businesses that supply much of the country’s food, farm bureaus say.",
    "link": "https://www.bostonherald.com/2025/06/13/raids-california-farms-america-food/",
    "timestamp": "2025-06-13T16:05:49Z"
  },
  {
    "title": "Brevard County prepares for No Kings Day rally",
    "description": "Major rallies are expected Saturday around central Florida to protest the Trump administration and its impacts on local communities.",
    "link": "https://www.wftv.com/news/local/brevard-county/brevard-county-prepares-no-kings-day-rally/L7YW7W3SMZADJOM5ERJX35QMIA/",
    "timestamp": "2025-06-13T16:05:28Z"
  },
  {
    "title": "E. Jean Carroll: Appeals court denies Trump plea to review $5 million judgment in abuse and defamation case",
    "description": "A federal appeals court on Friday rejected another attempt by President Donald Trump to review a $5 million judgment against him for sexually abusing and then defaming E. Jean Carroll.",
    "link": "https://www.cnn.com/2025/06/13/politics/appeals-court-e-jean-carroll",
    "timestamp": "2025-06-13T16:05:27Z"
  },
  {
    "title": "Kim Gordon Remakes “BYE BYE” into Trump Protest Song: Stream",
    "description": "\"BYE BYE 25!\" reworks the lyrics to list out words that have been flagged and used to cancel grant projects or research proposals.\nKim Gordon Remakes “BYE BYE” into Trump Protest Song: Stream\nScott Sterling",
    "link": "https://consequence.net/2025/06/kim-gordon-bye-bye-25-trump-protest/",
    "timestamp": "2025-06-13T16:04:13Z"
  },
  {
    "title": "Tucker Carlson Calls Trump “Complicit” After Israel’s Attack on Iran",
    "description": "Supporting Israel’s assault on Iran has caused the president to lose some of his longest-term acolytes.\r\nOne such loss apparently includes Tucker Carlson, who issued a newsletter to his audience Friday grimly titled: “This Could Be the Final Newsletter Before…",
    "link": "https://newrepublic.com/post/196808/tucker-carlson-calls-trump-complicit-israel-attack-iran",
    "timestamp": "2025-06-13T16:02:14Z"
  },
  {
    "title": "Is Trump's military parade 'just a parade'?",
    "description": "Everybody loves a parade, right? President Donald Trump does: He is overseeing a lavish military parade Saturday in Washington, D.C., ostensibly to celebrate Flag Day and the Army's 250th birthday. But the event comes amid a Trump-ordered National Guard deplo…",
    "link": "https://biztoc.com/x/c5e7886cdce6545a",
    "timestamp": "2025-06-13T16:02:09Z"
  },
  {
    "title": "Israel Releases Details of Unprecedented Attack on Iran",
    "description": "Israeli media claim this could be just the opening stage of a two-week campaign against Iran. In the early hours of June 13, 2025, about 200 Israeli aircraft struck multiple targets across Iran as part of Operation Rising Lion. You can read more about this in…",
    "link": "https://theaviationist.com/2025/06/13/israel-attack-iran-details/",
    "timestamp": "2025-06-13T16:01:47Z"
  },
  {
    "title": "The Restraining Order Against Federalizing the California National Guard Highlights Trump's Lawlessness",
    "description": "California Gov. Gavin Newsom argues that President Donald Trump's unilateral deployment of that state's National Guard was illegal and unconstitutional.",
    "link": "https://reason.com/2025/06/13/the-restraining-order-against-federalizing-the-california-national-guard-highlights-trumps-lawlessness/",
    "timestamp": "2025-06-13T16:00:56Z"
  },
  {
    "title": "RFK Jr. Hands Medicaid Data to ICE as It Ramps Up War on Immigrants",
    "description": "The Trump administration is giving the personal data of Medicaid-enrolled immigrants to the Department of Homeland Security, according to the Associated Press. The Department of Homeland Security forced the Centers for Medicare and Medicaid Services—which is …",
    "link": "https://newrepublic.com/post/196814/rfk-jr-hands-medicaid-data-ice-deportations",
    "timestamp": "2025-06-13T16:00:52Z"
  },
  {
    "title": "SCOOP: Comer probing Newsom, Bass response to Los Angeles riots",
    "description": "The House Oversight Committee is investigating the protests in Los Angeles, sending letters to the top Democratic officials involved in the response.",
    "link": "https://www.foxnews.com/politics/scoop-comer-probing-newsom-bass-response-los-angeles-riots",
    "timestamp": "2025-06-13T16:00:33Z"
  },
  {
    "title": "Iran is reeling from Israel's unprecedented attack - and it may only be the start",
    "description": "Israel's Operation Rising Lion is more extensive and ambitious than anything that has come before, including the missile exchanges it had with Iran last year",
    "link": "https://www.bbc.com/news/articles/cvg72ny4xeyo",
    "timestamp": "2025-06-13T15:59:59Z"
  },
  {
    "title": "America’s 250th Birthday Party, Brought to You by MAGA",
    "description": "A Fox News alum in his mid-20s is in charge of planning the celebration.",
    "link": "https://www.theatlantic.com/politics/archive/2025/06/america-250th-birthday-party-fox-news/683167/",
    "timestamp": "2025-06-13T15:59:00Z"
  },
  {
    "title": "How to Help Affected People Amid ICE Raids, Deportation, and Protests in Los Angeles and Beyond",
    "description": "Here's how to help impacted people amid the ongoing ICE raids in Los Angeles, including donations, mental health resources, and knowing protesters' rights.",
    "link": "https://www.cosmopolitan.com/politics/a65034968/how-to-help-ice-raids-deportation-protests-los-angeles/",
    "timestamp": "2025-06-13T15:58:00Z"
  },
  {
    "title": "Trump’s Cartoonish Performance of Masculine Strength, from Los Angeles to Washington, D.C.",
    "description": "Donald Trump’s decision to mobilize the military in Los Angeles was made against the reasoned judgment and expressed wishes of LA Mayor Karen Bass and California Governor Gavin Newsom. The recent actions of the president present yet another opportunity to obs…",
    "link": "https://msmagazine.com/2025/06/13/trump-masculinity-strong-man-los-angeles-protests-flag-day-birthday/",
    "timestamp": "2025-06-13T15:57:53Z"
  },
  {
    "title": "UF athletics budget tops $200 million, Gators basketball spending up 20%",
    "description": "GAINESVILLE — A $2.4 million projected spending increase for Florida’s national championship basketball program and $20.5 million newly allotted for student-athletes highlight a Gators athletic department budget now standing at more than $205 million. The 202…",
    "link": "https://www.orlandosentinel.com/2025/06/13/florida-gators-athletics-uaa-scott-stricklin-todd-golden/",
    "timestamp": "2025-06-13T15:57:00Z"
  },
  {
    "title": "Trump loses bid for appeals court to reconsider $5m loss to E Jean Carroll",
    "description": "The decision means the Supreme Court is Trump's last avenue of appealing the New York jury's 2023 judgement.",
    "link": "https://www.bbc.com/news/articles/c20x59gvn5xo",
    "timestamp": "2025-06-13T15:56:39Z"
  },
  {
    "title": "Home appliances swept up in expansion of Trump steel tariffs (Reuters)",
    "description": "Reuters:\nHome appliances swept up in expansion of Trump steel tariffs  —  A range of imported household appliances including dishwashers, washing machines, refrigerators and more will be subject to President Donald Trump's expanded steel tariffs starting late…",
    "link": "https://www.memeorandum.com/250613/p69",
    "timestamp": "2025-06-13T15:55:01Z"
  },
  {
    "title": "UNI Drops Hard After V-Shaped Rebound Fizzles Amid Mounting Middle East Tension",
    "description": "Uniswap (UNI) reversed steep losses after a flash crash but slipped again as Trump warned of “more brutal” strikes against Iran.",
    "link": "https://www.coindesk.com/markets/2025/06/13/uni-drops-hard-after-v-shaped-rebound-fizzles-amid-mounting-middle-east-tension",
    "timestamp": "2025-06-13T15:54:14Z"
  },
  {
    "title": "Is Trump's military parade 'just a parade'?",
    "description": "Critics see an 'echo of authoritarianism'",
    "link": "https://theweek.com/politics/trump-military-parade-army-washington-dc-birthday-flag-day",
    "timestamp": "2025-06-13T15:53:06Z"
  },
  {
    "title": "Federal appeals court won't reconsider Trump's $5 million loss to E. Jean Carroll",
    "description": "Trump failed to persuade a federal appeals court to reconsider the $5 million verdict won by E. Jean Carroll after a jury found he sexually abused and defamed the former magazine columnist in the 1990s.",
    "link": "https://www.nbcnews.com/politics/donald-trump/federal-appeals-court-wont-reconsider-trumps-5-million-loss-e-jean-car-rcna212888",
    "timestamp": "2025-06-13T15:52:37Z"
  },
  {
    "title": "Republicans to watch when Trump’s $9.4 billion cut comes to the Senate",
    "description": "In an age of unprecedented national debt, $9.4 billion is just a drop in a bucket, coming in at about 27 bucks per American. But still — still! — it might not pass the U.S. Senate, where it’s headed after the House of Representatives’ yes vote on Thursday. Th…",
    "link": "https://www.theblaze.com/columns/opinion/republicans-to-watch-when-trumps-9-4-billion-cut-comes-to-the-senate",
    "timestamp": "2025-06-13T15:52:25Z"
  },
  {
    "title": "Canada calling for de-escalation between Israel and Iran, says foreign affairs minister",
    "description": "Foreign Affairs Minister Anita Anand says Canada is calling for de-escalation after Israel targeted Iran’s nuclear sites and killed Iranian military leaders with a barrage of airstrikes early on Friday.",
    "link": "https://www.cbc.ca/news/politics/israel-iran-canada-anand-1.7560564",
    "timestamp": "2025-06-13T15:52:24Z"
  },
  {
    "title": "Travel Stocks Sink, Energy Shares Soar as Israel Strikes Iran",
    "description": "Israel’s strikes on Iran rippled through the US stock market on Friday, sinking shares of travel companies and lifting energy and defense stocks as traders braced for the possibility of a wider Middle East conflict.",
    "link": "https://financialpost.com/pmn/business-pmn/travel-stocks-sink-energy-shares-soar-as-israel-strikes-iran",
    "timestamp": "2025-06-13T15:51:08Z"
  },
  {
    "title": "06/13/25",
    "description": "Hi all,",
    "link": "https://www.advocate.com/newsletter/06-13-25",
    "timestamp": "2025-06-13T15:49:18Z"
  },
  {
    "title": "Trump: Iran Ignored 60-Day Deadline to Make Deal",
    "description": "President Donald Trump said Friday that Iranian officials ignored the 60-day window he gave them to make a deal on Iran's nuclear program. \nThe post Trump: Iran Ignored 60-Day Deadline to Make Deal appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/13/trump-iran-ignored-60-day-deadline-to-make-deal/",
    "timestamp": "2025-06-13T15:49:12Z"
  },
  {
    "title": "CBP's Predator Drone Flights Over LA Are a Dangerous Escalation",
    "description": "Custom and Border Protection flying powerful Predator B drones over Los Angeles further breaks the seal on federal involvement in civilian matters typically handled by state or local authorities.",
    "link": "https://www.wired.com/story/cbp-predator-drone-flights-la-protests/",
    "timestamp": "2025-06-13T15:48:50Z"
  },
  {
    "title": "By Promoting Amnesty For Illegal Workers, Trump Is Selling Out ‘America First’ For Cheap Labor",
    "description": "Americans voted for Trump on the promise of mass deportations. He should keep his promise — all of it. Mass Deportations Now.”It wasn’t just a slogan on signs — it was a rallying cry that galvanized millions of voters. The promise was the restoration of Ameri…",
    "link": "https://freerepublic.com/focus/f-news/4322844/posts",
    "timestamp": "2025-06-13T15:47:24Z"
  },
  {
    "title": "No Kings protest: List of Minnesota rallies",
    "description": "Dozens of No Kings protests against President Donald Trump's policies are planned for Minnesota on Saturday. Here's a list.",
    "link": "https://www.fox9.com/news/no-kings-protest-minnesota-list",
    "timestamp": "2025-06-13T15:44:48Z"
  },
  {
    "title": "Vietnam’s Ready For High Stakes US Trade Talks To Avoid Steep Tariffs",
    "description": "Vietnam, a substantial producer of athletic performance shoes, is hoping to avoid the 46 percent reciprocal tariffs when 90-day pause ends on July 9.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/vietnam-athletic-performance-shoes-tariffs-us-trade-talks-1237916391/",
    "timestamp": "2025-06-13T15:43:44Z"
  },
  {
    "title": "After Israeli Strikes on Iran, Trump Tells Free Beacon: ‘I Feel Very Good’",
    "description": "President Donald Trump said he was in good spirits following Israel's punishing strike on Iran's nuclear facilities Thursday evening.\nThe post After Israeli Strikes on Iran, Trump Tells Free Beacon: ‘I Feel Very Good’ appeared first on .",
    "link": "https://freebeacon.com/trump-administration/after-israeli-strikes-on-iran-trump-tells-free-beacon-i-feel-very-good/",
    "timestamp": "2025-06-13T15:43:20Z"
  },
  {
    "title": "War, trade and Air India crash cast cloud over Paris Air Show",
    "description": "The Paris Air Show opens amidst a complex backdrop of war, tariffs, and the Air India crash, overshadowing the usual Airbus-Boeing rivalry. Boeing CEO Kelly Ortberg cancelled his appearance due to the 787 Dreamliner crash investigation. Trump's tariffs and su…",
    "link": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/war-trade-and-air-india-crash-cast-cloud-over-paris-air-show/articleshow/121833370.cms",
    "timestamp": "2025-06-13T15:42:52Z"
  },
  {
    "title": "Trump must stand firm with Israel to slam the door on Iran’s nukes — and achieve Middle East peace",
    "description": "The US and Israel are perfectly aligned in ending Iran’s nuclear weapons ambitions for good — and Tehran won't comply unless it perceives zero daylight between the two allies.",
    "link": "https://nypost.com/2025/06/13/opinion/trump-must-stand-with-israel-to-slam-the-door-on-iran-nukes/",
    "timestamp": "2025-06-13T15:42:35Z"
  },
  {
    "title": "Kilmar Abrego Garcia pleads not guilty to human smuggling charges",
    "description": "Facing mounting pressure to return Abrego Garcia to the U.S., the Trump administration brought him back last week. However, he was immediately taken into custody on new criminal charges filed by the U.S. Attorney’s Office for the Middle District of Tennessee.",
    "link": "https://www.pbs.org/newshour/nation/kilmar-abrego-garcia-pleads-not-guilty-to-human-smuggling-charges",
    "timestamp": "2025-06-13T15:42:23Z"
  },
  {
    "title": "Macron says Israel has ‘right to defend itself’, speaks to Netanyahu",
    "description": "French President Emmanuel Macron, who on Friday defended Israel’s right to protect itself, spoke by phone to Israeli Prime Minister Benjamin Netanyahu following a spike in diplomatic tensions, the Elysee said. The French presidency said the phone conversation…",
    "link": "https://www.digitaljournal.com/world/macron-says-israel-has-right-to-defend-itself-speaks-to-netanyahu/article",
    "timestamp": "2025-06-13T15:42:20Z"
  },
  {
    "title": "Detained Columbia protester asks judge to order his release, says government missed appeal deadline",
    "description": "The judge gave the government until Friday afternoon to formally reply to the request.",
    "link": "https://www.bostonherald.com/2025/06/13/mahmoud-khalil/",
    "timestamp": "2025-06-13T15:42:07Z"
  },
  {
    "title": "Over 24 hours, Trump’s authoritarian-style vision comes into focus (again)",
    "description": "Every once in a while, Donald Trump has a day — a single, 24-hour period — in which his authoritarian vision comes into focus.",
    "link": "https://biztoc.com/x/8fefb32d15d93bf3",
    "timestamp": "2025-06-13T15:40:15Z"
  },
  {
    "title": "As NATO boosts defence spending, Europe’s arms industry faces pressure to deliver. ‘This is really keeping me up at night’ says NATO chief",
    "description": "NATO leaders meeting in The Hague this month look set to agree to a major increase in military budgets under pressure from US President Donald Trump.\nBut as Europe promises to ramp up defence spending and wean itself from reliance on the United States, a key …",
    "link": "https://biztoc.com/x/36cedd1fa183a9c9",
    "timestamp": "2025-06-13T15:40:05Z"
  },
  {
    "title": "Trump’s Assault on California Is Faltering",
    "description": "Trump’s assault on California is faltering. A federal judge’s ruling challenging the National Guard order, backlash to roughing up Senator Padilla, and growing ‘No Kings’ protests show the administration may have overplayed its hand in the state.",
    "link": "http://nymag.com/intelligencer/article/trump-california-backlash.html",
    "timestamp": "2025-06-13T15:39:18Z"
  },
  {
    "title": "US Veterans Oppose Trump's 'Illegal' Takeover Of National Guard",
    "description": "\"Veterans ...agree that President Trump's takeover of Los Angeles is not only illegal – it poses a dangerous and serious risk to Americans,\" says Gov. Newsom.",
    "link": "https://www.newsweek.com/us-veterans-oppose-trump-illegal-takeover-national-guard-2085195",
    "timestamp": "2025-06-13T15:38:32Z"
  },
  {
    "title": "President Trump: ‘I always knew the date for Israel's attack on Iran'",
    "description": "President Trump reveals that Israel’s military action followed a 60-day deadline he set for Iran to agree to a revised nuclear deal. After Iran failed to comply, Trump said he anticipated the strike. Despite tensions, the US remains open to renewed talks.",
    "link": "https://www.israelnationalnews.com/news/409954",
    "timestamp": "2025-06-13T15:37:00Z"
  },
  {
    "title": "Military Expert Explains Why Iran Has Yet To Use This 1 Strong Tool Against Israel",
    "description": "\"Iran still has options here,\" retired Adm. James Stavridis said.",
    "link": "https://www.huffpost.com/entry/james-stavridis-reflects-on-israel-iran-attacks_n_684c2a71e4b070091d774191",
    "timestamp": "2025-06-13T15:36:47Z"
  },
  {
    "title": "Trump Calls on Iran to Agree to Nuclear Deal ‘Before There Is Nothing Left’",
    "description": "After Israel launched attacks on Iran’s military leaders and nuclear infrastructure, Trump said Iran now has “a second chance” at a nuclear deal",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-iran-israel-attack-nuclear-deal-1235364072/",
    "timestamp": "2025-06-13T15:36:44Z"
  },
  {
    "title": "Donald Trump's Approval Rating on Immigration Plunges",
    "description": "Of the ten most recent polls which surveyed voters on immigration, six show Trump with a negative net approval rating on immigration.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-immigration-2085189",
    "timestamp": "2025-06-13T15:36:08Z"
  },
  {
    "title": "US prepares for 'No Kings' protests against Trump",
    "description": "As US President Donald Trump gears up for the first major military parade in the US in decades, protesters are planning \"No Kings\" events all over the country on Saturday.",
    "link": "https://www.dw.com/en/us-prepares-for-no-kings-protests-against-trump/a-72890236",
    "timestamp": "2025-06-13T15:36:00Z"
  },
  {
    "title": "How Israel and the U.S. manufactured a fake crisis with Iran that could lead to all-out war",
    "description": "The long-dreaded war in the Persian Gulf between a U.S.-backed Israel and Iran appears imminent, and it is all based on a manufactured crisis aimed at undermining the Iran nuclear negotiations.",
    "link": "https://mondoweiss.net/2025/06/how-israel-and-the-u-s-manufactured-a-fake-crisis-with-iran-that-could-lead-to-all-out-war/",
    "timestamp": "2025-06-13T15:35:00Z"
  },
  {
    "title": "Touting ‘Trump Cards,’ president makes dubious claims, unveils weird new website",
    "description": "Remember when Donald Trump suggested he'd sell American citizenship to “very high-level people” who paid $5 million? He's moving forward with the idea.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/touting-trump-cards-president-makes-dubious-claims-unveils-weird-new-w-rcna212867",
    "timestamp": "2025-06-13T15:32:39Z"
  },
  {
    "title": "Political Changes Don’t Weaken the Case for Green Business",
    "description": "Businesses that fail to manage climate-driven risks will face higher costs, increased regulatory scrutiny, and reputational damage. Although political developments in some countries would seem to discourage “green” business strategies, consumer preferences an…",
    "link": "https://www.project-syndicate.org/commentary/anti-green-politics-doesnt-weaken-case-for-sustainable-production-and-climate-adaptation-by-jonathan-hall-2025-06",
    "timestamp": "2025-06-13T15:32:05Z"
  },
  {
    "title": "Israel’s attack on Iran was years in the making. How did they get here?",
    "description": "The attack comes after decades of mutual hostility and a long-running shadow war of covert strikes and sabotage.",
    "link": "https://www.bostonherald.com/2025/06/13/israel-iran-history/",
    "timestamp": "2025-06-13T15:31:31Z"
  },
  {
    "title": "What drove the tech right’s — and Elon Musk’s — big, failed bet on Trump",
    "description": "I live and work in the San Francisco Bay Area, and I don’t know anyone who says they voted for Donald Trump in 2016 or 2020. I know, on the other hand, quite a few who voted for him in 2024, and quite a few more who — while they didn’t vote for Trump because …",
    "link": "https://biztoc.com/x/6072a954134003f8",
    "timestamp": "2025-06-13T15:28:51Z"
  },
  {
    "title": "Nippon Steel needs 'management freedom' for U.S. Steel deal, says exec",
    "description": "TOKYO -- A Nippon Steel executive told Nikkei on Friday the acquisition of U.S. Steel requires \"a degree of management freedom\" to go ahead, after U.S. President Donald Trump said he would exercise \"total control\" over the fate of his nation's iconic steelmak…",
    "link": "https://biztoc.com/x/2a06e8d18f382d9c",
    "timestamp": "2025-06-13T15:28:46Z"
  },
  {
    "title": "Trump Urges Iran to Make Nuclear Deal to Avoid Further Attacks",
    "description": "US President Donald Trump urged Iran to accept a nuclear deal with Washington to avoid further attacks, which Prime Minister Benjamin Netanyahu vowed would probably happen over the coming days as Israel looks to deal a severe blow to Tehran’s nuclear program.…",
    "link": "https://biztoc.com/x/2f80a3f8e93de314",
    "timestamp": "2025-06-13T15:28:46Z"
  },
  {
    "title": "Netanyahu: US knew about attack on Iran in advance",
    "description": "Israeli Prime Minister Benjamin Netanyahu said on Friday that Israel informed the United States ahead of its strike on Iran, adding that it will be up to US President Donald Trump to decide what Ameri...",
    "link": "https://biztoc.com/x/707b4c9056d2a6d0",
    "timestamp": "2025-06-13T15:28:38Z"
  },
  {
    "title": "Slog AM: Israel Strikes Iran, One Person Survives India Air Crash, a No Kings Weekend",
    "description": "The Stranger's morning news roundup.\n \n by Nathalie Graham\n \n \n \n Israel Strikes Iran: On Friday, Israel launched military strikes on Iran. It targeted the country's nuclear sites and killed at least two of Iran's top military officials. The nuclear sites wer…",
    "link": "https://www.thestranger.com/slog-am/2025/06/13/80098126/slog-am-israel-strikes-iran-one-person-survives-india-air-crash-a-no-kings-weekend",
    "timestamp": "2025-06-13T15:28:00Z"
  },
  {
    "title": "Federal judge blocks Trump’s election overhaul that had been challenged as unconstitutional",
    "description": "The Republican president’s March 25 executive order sought to compel officials to require documentary proof of citizenship for everyone registering to vote for federal elections, accept only mailed ballots received by Election Day and condition federal electi…",
    "link": "https://www.pbs.org/newshour/politics/federal-judge-blocks-trumps-election-overhaul-that-had-been-challenged-as-unconstitutional",
    "timestamp": "2025-06-13T15:27:50Z"
  },
  {
    "title": "Inside The Clandestine Israeli Operation To Kneecap Iran",
    "description": "Israel launched a massive wave of airstrikes on Iran Thursday night which crippled Iranian nuclear and military assets, a move that was months in the making",
    "link": "https://dailycaller.com/2025/06/13/inside-clandestine-israeli-operation-kneecap-iran-nuclear-program-regime/",
    "timestamp": "2025-06-13T15:26:11Z"
  },
  {
    "title": "China customs allows import of eligible pork, poultry products from some US plants",
    "description": "BEIJING (Reuters) -China has approved 106 new U.S. pork and poultry plants to export eligible products produced on or after June 12, Chinese Customs said in ...",
    "link": "https://www.yahoo.com/news/china-customs-allows-import-eligible-152542314.html",
    "timestamp": "2025-06-13T15:25:42Z"
  },
  {
    "title": "Newsom tries to give Trump the Biden treatment, says he's 'not all there'",
    "description": "Governor Gavin Newsom claimed Trump is making up conversations about L.A. riots response while tensions escalate over deployment of National Guard and Marines in California.",
    "link": "https://www.foxnews.com/media/newsom-tries-give-trump-biden-treatment-hes-not-all-there",
    "timestamp": "2025-06-13T15:25:38Z"
  },
  {
    "title": "Starmer Says UK Has ‘Grave Concerns’ on Iran Nuclear Program",
    "description": "Prime Minister Keir Starmer said the UK has “grave concerns” about Iran’s nuclear program and backed Israel’s right to self-defense, while calling for de-escalation in a conflict that risks engulfing the Middle East.",
    "link": "https://financialpost.com/pmn/business-pmn/starmer-says-uk-has-grave-concerns-on-iran-nuclear-program",
    "timestamp": "2025-06-13T15:25:35Z"
  },
  {
    "title": "Sen. John Fetterman calls for US to supply anything Israel needs for Iran attack",
    "description": "Sen. Fetterman urges full U.S. support for Israel against Iran, advocating military aid.",
    "link": "https://nypost.com/2025/06/13/world-news/sen-john-fetterman-calls-for-us-to-supply-anything-israel-needs-for-iran-attack/",
    "timestamp": "2025-06-13T15:24:28Z"
  },
  {
    "title": "Todd Chrisley returns to social media after Trump pardon to congratulate his son",
    "description": "‘Welcome back Todd we've missed you,’ one person commented on Chrisley’s Instagram return",
    "link": "https://www.the-independent.com/life-style/todd-chrisley-instagram-donald-trump-pardon-b2769635.html",
    "timestamp": "2025-06-13T15:23:40Z"
  },
  {
    "title": "Second federal judge sides against Trump's election executive order",
    "description": "A second federal judge on Friday blocked an executive order from President Donald Trump aimed at overhauling elections in the U.S. Trump's March 25 executive order sought to compel officials to require documentary proof of citizenship for everyone registering…",
    "link": "https://freerepublic.com/focus/f-news/4322837/posts",
    "timestamp": "2025-06-13T15:23:10Z"
  },
  {
    "title": "Gulf countries fear Israel-Iran spillover",
    "description": "Gulf countries on Friday unanimously condemned Israel’s strikes on Iran, fearing an escalation that could threaten economic interests and security. “Gulf states are very much caught between a rock and a hard place,” Sanam Vakil, director of the Chatham House …",
    "link": "https://www.digitaljournal.com/world/gulf-countries-fear-israel-iran-spillover/article",
    "timestamp": "2025-06-13T15:22:20Z"
  },
  {
    "title": "Men who stole $6M golden toilet from English mansion sentenced to prison",
    "description": "Two men who stole a $6.4 million golden toilet from an English mansion have been sentenced to more than two years in prison",
    "link": "https://abcnews.go.com/International/wireStory/men-stole-6-million-golden-toilet-english-mansion-122816880",
    "timestamp": "2025-06-13T15:22:10Z"
  },
  {
    "title": "Ford CEO says rare earth supply is ‘day to day’ after plant halt",
    "description": "Ford Motor Co. continues to struggle to obtain rare earth magnet supplies that are essential to car production. Find out more here.",
    "link": "https://financialpost.com/transportation/autos/ford-ceo-says-rare-earth-supply-is-day-to-day",
    "timestamp": "2025-06-13T15:21:44Z"
  },
  {
    "title": "Lawrence O'Donnell says Trump 'completely surrendered' on this key campaign promise",
    "description": "Lawrence O’Donnell says Trump surrendered on his campaign promise of mass deportation, after the president admitted his crackdown is hurting American farmers.",
    "link": "https://www.msnbc.com/top-stories/latest/lawrence-odonnell-trump-surrender-farm-workers-immigration-rcna212825",
    "timestamp": "2025-06-13T15:20:48Z"
  },
  {
    "title": "Donald Trump Is Running the Military Like a Warlord",
    "description": "Jeet Heer\n\n\n\nThe quickest way for the United States to become fascist is by politicizing the military.\r\n\n\r\n\n\nThe post Donald Trump Is Running the Military Like a Warlord appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/trump-politicization-military-warlord/",
    "timestamp": "2025-06-13T15:20:12Z"
  },
  {
    "title": "Tucker Carlson Blasts Trump as ‘Complicit’ in Iran Strikes as He Posts ‘Final Newsletter Before All-Out War’",
    "description": "Tucker Carlson issued what he called possible the \"final newsletter before all-out war\" following Israel's airstrikes against Iran.\nThe post Tucker Carlson Blasts Trump as ‘Complicit’ in Iran Strikes as He Posts ‘Final Newsletter Before All-Out War’ first app…",
    "link": "https://www.mediaite.com/media/tucker-carlson-blasts-trump-as-complicit-in-iran-strikes-as-he-posts-final-newsletter-before-all-out-war/",
    "timestamp": "2025-06-13T15:19:04Z"
  },
  {
    "title": "Tucker Carlson Releases ‘Final Newsletter Before All-Out War,’ Blasts Trump as ‘Complicit’",
    "description": "Tucker Carlson issued what he called possible the \"final newsletter before all-out war\" following Israel's airstrikes against Iran.\nThe post Tucker Carlson Releases ‘Final Newsletter Before All-Out War,’ Blasts Trump as ‘Complicit’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tucker-carlson-releases-final-newsletter-before-all-out-war-blasts-trump-as-complicit/",
    "timestamp": "2025-06-13T15:19:04Z"
  },
  {
    "title": "BREAKING: Tucker Carlson Blasts Trump as ‘Complicit’ in Iran Strikes as He Posts ‘Final Newsletter Before All-Out War’",
    "description": "Tucker Carlson issued what he called possible the \"final newsletter before all-out war\" following Israel's airstrikes against Iran.\nThe post BREAKING: Tucker Carlson Blasts Trump as ‘Complicit’ in Iran Strikes as He Posts ‘Final Newsletter Before All-Out War’…",
    "link": "https://www.mediaite.com/media/breaking-tucker-carlson-blasts-trump-as-complicit-in-iran-strikes-as-he-posts-final-newsletter-before-all-out-war/",
    "timestamp": "2025-06-13T15:19:04Z"
  },
  {
    "title": "U.S. Officials Fear ‘Tiananmen Square Moment’ at Trump’s Military Parade",
    "description": "U.S. officials are reportedly worried about “a potential Tiananmen Square moment” at Trump’s military parade on Saturday, coinciding with anti-Trump protests planned nationwide.\nThe post U.S. Officials Fear ‘Tiananmen Square Moment’ at Trump’s Military Parade…",
    "link": "https://www.mediaite.com/media/tv/u-s-officials-fear-tiananmen-square-moment-at-trumps-military-parade/",
    "timestamp": "2025-06-13T15:17:59Z"
  },
  {
    "title": "Trump is finally getting his chance to try to top France with a grand military parade in DC",
    "description": "The White House says the parade will go on rain or shine, but could be delayed by lightning.",
    "link": "https://www.bostonherald.com/2025/06/13/trump-military-parade-weather/",
    "timestamp": "2025-06-13T15:16:28Z"
  },
  {
    "title": "Trump Warns Iran of ‘Even More Brutal’ Attacks Without Nuclear Deal: Live Updates - WSJ",
    "description": "Trump Warns Iran of ‘Even More Brutal’ Attacks Without Nuclear Deal: Live UpdatesWSJ Trump Issues Grave Warning to Iran After Israeli Strikes: ‘No More Death, No More Destruction’Time Magazine Donald Trump pledged to restore peace. Now a new conflict has star…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178039543",
    "timestamp": "2025-06-13T15:13:14Z"
  },
  {
    "title": "Sneak Peek: What’s Up With Men? Ms. Magazine Summer Issue Tackles ‘Brocasts,’ JD Vance and the State of American Manhood",
    "description": "It’s true that many boys and men are struggling. It’s also true that the right has successfully weaponized those struggles in their relentless attacks on feminists, liberals and progressives, and anyone else they can accuse of “wokeism,” and subsequently disp…",
    "link": "https://msmagazine.com/2025/06/13/sneak-peek-men-ms-magazine-summer-2025-print-issue-jd-vance-masculinity/",
    "timestamp": "2025-06-13T15:12:52Z"
  },
  {
    "title": "Could New Border Restrictions Literally Tear the Haskell Free Library Apart?",
    "description": "The library, which straddles the U.S.-Canadian border, has seamlessly served patrons in both countries since 1904. That’s all changing thanks to rising international tensions. \nListen and subscribe on Apple Podcasts, Spotify, and all major podcast apps.\r\n\n\n\nK…",
    "link": "https://www.atlasobscura.com/articles/podcast-library-on-the-border",
    "timestamp": "2025-06-13T15:12:00Z"
  },
  {
    "title": "Israel Bombing Iran Has Already Caused a MAGA Civil War",
    "description": "MAGA seems to be split on whether continuing to fight and fund Israel’s wars against the rest of the Middle East is “America First” or not. \r\nIsrael bombed multiple cities and nuclear facilities in Iran Thursday night, dragging its US benefactor into a war ag…",
    "link": "https://newrepublic.com/post/196800/israel-bombs-iran-trump-maga-netanyahu",
    "timestamp": "2025-06-13T15:09:16Z"
  },
  {
    "title": "Archer drops as much as 15% on $850 million share sale following Trump air taxi pilot program",
    "description": "Archer Aviation's stock dropped after the maker of electric vertical takeoff and landing vehicles said it sold $850 million worth of shares.",
    "link": "https://www.cnbc.com/2025/06/13/archer-aviation-drops-15percent-on-850-million-share-sale-.html",
    "timestamp": "2025-06-13T15:08:08Z"
  },
  {
    "title": "Polish Elections: Conservative Momentum And The Fight For Economic Freedom",
    "description": "Last week’s victory of conservative candidate Karol Nawrocki, and good first-round results for free-market forces, give Poland a new opportunity for continued prosperity",
    "link": "https://www.forbes.com/sites/alejandrochafuen/2025/06/13/polish-elections-conservative-momentum-and-the-fight-for-economic-freedom/",
    "timestamp": "2025-06-13T15:08:07Z"
  },
  {
    "title": "Donald Trump Suffers Legal Blow in E. Jean Carroll Case",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has lost his bid to have a federal appeals court overturn the $5 million verdict awarded to E. Jean Carroll, after a jury concluded he sexually abused and defamed the former magazine col…",
    "link": "https://biztoc.com/x/681e383a3c64af4c",
    "timestamp": "2025-06-13T15:06:55Z"
  },
  {
    "title": "Trump: Iran calling me to speak",
    "description": "United States President Donald Trump claimed on Friday that Iran is \"calling me to speak\" after Israel's so-called preemptive strikes on its territory.Speaking to NBC News, Trump said that Tehran \"mis...",
    "link": "https://biztoc.com/x/5e7d4afcc4497308",
    "timestamp": "2025-06-13T15:06:48Z"
  },
  {
    "title": "Sweden, Netherlands say before NATO summit they will spend 5% of GDP on defense",
    "description": "Sweden and the Netherlands say they intend to increase defense spending to 5% of their gross domestic product in line with U.S. President Donald Trump’s demands",
    "link": "https://abcnews.go.com/Business/wireStory/sweden-netherlands-nato-summit-spend-5-gdp-defense-122815247",
    "timestamp": "2025-06-13T15:06:44Z"
  },
  {
    "title": "Archer Aviation secures $850 million after Trump orders boost for electric air taxis",
    "description": "Air taxi maker Archer Aviation on Thursday said it raised $850 million in funding following executive orders signed by U.S. President Donald Trump to boost electric air taxis.\nTrump’s orders also focused on bolstering U.S. defenses against hostile drones, and…",
    "link": "https://biztoc.com/x/fa27d03fcb837bb0",
    "timestamp": "2025-06-13T15:06:35Z"
  },
  {
    "title": "California police illegally share license plate reader data to ICE",
    "description": "LAPD and the counties of San Diego, Orange, and Riverside have repeatedly shared automated license plate reader data to federal agencies",
    "link": "https://calmatters.org/economy/technology/2025/06/california-police-sharing-license-plate-reader-data/",
    "timestamp": "2025-06-13T15:06:20Z"
  },
  {
    "title": "Iran to retaliate against Israel in ‘near future’ – media",
    "description": "Iran has not yet retaliated against Israel’s attack but is expected to do so shortly, local media reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619195-iran-retaliation-against-israel/",
    "timestamp": "2025-06-13T15:06:04Z"
  }
]