[
  {
    "title": "The truth behind Trump's claims about autism and paracetamol, or Tylenol – video",
    "description": "Global health agencies and regulators have dismissed unscientific advice from Donald Trump, who made an unproven link between autism and the use of everyday painkillers and vaccines. But the science wasn’t the only problem with that press conference. Matilda …",
    "link": "https://biztoc.com/x/97eb20779374b485",
    "timestamp": "2025-09-25T06:42:22Z"
  },
  {
    "title": "CNBC Daily Open: U.S. tech shares pull back amid growing AI bubble worries",
    "description": "On days like these, it looks like being a trader of individual stocks has its advantages over investing in exchange-traded funds.",
    "link": "https://www.cnbc.com/2025/09/25/cnbc-daily-open-us-tech-shares-pull-back-amid-growing-ai-bubble-worries.html",
    "timestamp": "2025-09-25T06:41:46Z"
  },
  {
    "title": "Switzerland Lost Reputation of Neutral Mediator - Lavrov",
    "description": "Russian Foreign Minister Sergey Lavrov told Swiss Foreign Minister Ignazio Cassis that Switzerland has lost its reputation as a credible neutral mediator.",
    "link": "https://sputnikglobe.com/20250925/switzerland-lost-reputation-of-neutral-mediator---lavrov-1122849658.html",
    "timestamp": "2025-09-25T06:35:40Z"
  },
  {
    "title": "Analysis-Global investors, blindsided by stunning US comeback, jump back in",
    "description": "LONDON (Reuters) -An investor  out of the United States and into Europe and Asia has reversed course as big money managers ride a wave of AI and interest...",
    "link": "https://finance.yahoo.com/news/analysis-global-investors-blindsided-stunning-063509317.html",
    "timestamp": "2025-09-25T06:35:09Z"
  },
  {
    "title": "Analysis:Global investors, blindsided by stunning US comeback, jump back in",
    "description": "LONDON :An investor out of the United States and into Europe and Asia has reversed course as big money managers ride a wave of AI and interest rate-cut euphoria into the year-end, ditching the \"rest-of-the world\" trade for now. Global fund managers had offloa…",
    "link": "https://www.channelnewsasia.com/business/analysisglobal-investors-blindsided-stunning-us-comeback-jump-back-in-5368506",
    "timestamp": "2025-09-25T06:35:09Z"
  },
  {
    "title": "Vietnam's top leader to pay rare visit to North Korea in October, sources say",
    "description": "HANOI (Reuters) -Vietnam's Communist Party chief To Lam is expected to visit North Korea next month, two Vietnamese officials said, marking the first visit in nearly 20 years for a Vietnamese leader to the largely isolated nation. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/25/vietnam039s-top-leader-to-pay-rare-visit-to-north-korea-in-october-sources-say",
    "timestamp": "2025-09-25T06:32:00Z"
  },
  {
    "title": "White House Instructs US Agencies to Prepare Layoff Plans for Possible Shutdown",
    "description": "The White House's Office of Management and Budget (OMB) has instructed US government agencies to prepare staff reduction plans in the event of a possible shutdown of the federal government, US media reported, citing a memorandum.",
    "link": "https://sputnikglobe.com/20250925/white-house-instructs-us-agencies-to-prepare-layoff-plans-for-possible-shutdown-1122849290.html",
    "timestamp": "2025-09-25T06:30:30Z"
  },
  {
    "title": "'Trump has given blank cheque to Netanyahu': Harris condemns Israel’s war; faces protesters on first night of book tour",
    "description": "Kamala Harris faced protests regarding the Israel-Gaza conflict during her book tour launch in New York, criticising Donald Trump for allegedly giving Israel a “blank cheque.” She expressed empathy for Palestinians, acknowledging their suffering as outrageous…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-has-given-blank-cheque-to-netanyahu-kamala-harris-condemns-israels-war-in-gaza-faces-protesters-on-first-night-of-book-tour/articleshow/124106219.cms",
    "timestamp": "2025-09-25T06:28:37Z"
  },
  {
    "title": "Under promise, over deliver? China unveils new climate goals",
    "description": "China has announced its first specific emission reduction targets. The nation aims to cut greenhouse gases by 7-10 percent by 2035. While some view this as modest, experts believe China will exceed its goals. China's role is crucial for global climate targets…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/under-promise-over-deliver-china-unveils-new-climate-goals/articleshow/124106752.cms",
    "timestamp": "2025-09-25T06:28:27Z"
  },
  {
    "title": "DAVE BOSSIE: Thorough Investigation Of Radical Left Is Warranted",
    "description": "With the assassination of Charlie Kirk, what’s been taking place in America can no longer be ignored and must be dealt with once and for all.",
    "link": "https://dailycaller.com/2025/09/25/opinion-thorough-investigation-of-radical-left-is-warranted-dave-bossie/",
    "timestamp": "2025-09-25T06:27:05Z"
  },
  {
    "title": "Nippon Steel sees small gap with Washington over US Steel's golden share authority",
    "description": "TOKYO (Reuters) -There is a small gap between Nippon Steel and the U.S. government over the authority of a golden share tied to its acquisition of U.S. Steel...",
    "link": "https://finance.yahoo.com/news/nippon-steel-sees-small-gap-062635788.html",
    "timestamp": "2025-09-25T06:26:35Z"
  },
  {
    "title": "As the Liberals jostle for influence at home, Albanese plays global statesman",
    "description": "Welcome back to your weekly federal politics update, where Brett Worthington gets you up to speed on the happenings from Parliament House.",
    "link": "https://www.abc.net.au/news/2025-09-25/hastie-ley-trump-un-palestine-cop-turkiye-bradfield-byelection/105814488",
    "timestamp": "2025-09-25T06:25:12Z"
  },
  {
    "title": "Orsted resumes work on US offshore wind farm",
    "description": "Denmark's Orsted said it had resumed work on a US offshore wind project after a federal judge on Monday ruled it could restart construction while the Trump administration's legal case to fully halt the project continues.",
    "link": "https://www.rte.ie/news/business/2025/0925/1535221-orsted-resumes-work-on-us-offshore-wind-farm/",
    "timestamp": "2025-09-25T06:20:56Z"
  },
  {
    "title": "Albanese and Starmer to meet for a frank exchange of views (and possibly some political advice)",
    "description": "The Australian prime minister will meet with his British counterpart – and may off some advice on fending off an electoral challenge from the right.",
    "link": "https://theconversation.com/albanese-and-starmer-to-meet-for-a-frank-exchange-of-views-and-possibly-some-political-advice-265751",
    "timestamp": "2025-09-25T06:15:19Z"
  },
  {
    "title": "‘There’s The Threat Again’: Kimmel Addresses Trump’s Reaction To His Return To Air",
    "description": "On Tuesday night, Trump had referred to Kimmel as an “arm of” the Democratic Party and appeared to suggest he may sue ABC over the comedian’s return to air.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/09/25/theres-the-threat-again-kimmel-addresses-trumps-reaction-to-his-return-to-air/",
    "timestamp": "2025-09-25T06:12:30Z"
  },
  {
    "title": "Kimmel scores decade-high ratings amid Trump fight: Disney",
    "description": "Late-night host Jimmy Kimmel had his biggest audience in a decade when he returned to US TV screens.\nThe post Kimmel scores decade-high ratings amid Trump fight: Disney appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/entertainment/kimmel-scores-decade-high-ratings-amid-trump-fight-disney/article",
    "timestamp": "2025-09-25T06:10:28Z"
  },
  {
    "title": "Babies can get hepatitis B at birth. Here’s why Trump is wrong about delaying the vaccine",
    "description": "If a newborn is exposed to hepatitis B at birth, there’s a 90% chance they’ll develop a lifelong infection.",
    "link": "https://theconversation.com/babies-can-get-hepatitis-b-at-birth-heres-why-trump-is-wrong-about-delaying-the-vaccine-265970",
    "timestamp": "2025-09-25T06:10:17Z"
  },
  {
    "title": "Trump slams globalism, climate “hoax” and weak immigration policies in fiery UN speech",
    "description": "President Donald Trump warned that uncontrolled migration is “destroying” Western nations, boasting about his administration’s mass deportations halting illegal crossings. He urged European leaders to tighten borders or risk national failure, citing record mi…",
    "link": "https://www.naturalnews.com/2025-09-25-trump-slams-globalism-climate-hoax-immigration-policies.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "Washington escalates SANCTIONS against pro-censorship Brazilian judge, this time targeting his wife and finances",
    "description": "The Trump administration imposed sanctions on Brazilian Supreme Court Justice Alexandre de Moraes’ wife (Viviane Barci de Moraes) and their family-linked financial entity (Lex Institute), freezing U.S.-based assets. The sanctions target Moraes for his “oppres…",
    "link": "https://www.naturalnews.com/2025-09-25-washington-escalates-sanctions-against-alexandre-de-moraes.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "The Highest-Paid Golfers At The 2025 Ryder Cup",
    "description": "Forbes' list of the Ryder Cup's highest-paid golfers features Jon Rahm, Scottie Scheffler and three other players earning big money on and off the course.",
    "link": "https://www.forbes.com/sites/justinbirnbaum/2025/09/25/the-highest-paid-golfers-at-the-2025-ryder-cup/",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "Trump’s fiery UN speech targets immigration, climate change and global conflicts",
    "description": "Trump condemned the UN’s climate agenda as a “con job,” dismissed renewable energy as “all bankrupt” and vowed to withdraw from climate agreements to prioritize U.S. energy independence and fossil fuel jobs, arguing that climate policies destroy economies whi…",
    "link": "https://www.naturalnews.com/2025-09-25-trumps-un-speech-targets-immigration-climate-change-conflicts.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "Trump and Putin push for Ukraine peace deal as Zelensky clings to power â\u0080\u0093 will diplomacy prevail?",
    "description": "Trump-Putin Alignment: Trump has shifted from demanding an immediate ceasefire to pursuing a broader diplomatic deal, recognizing Russia’s military dominance and Ukraine’s weakening position, while Putin shows openness to talks if Ukraine abandons NATO ambiti…",
    "link": "https://www.naturalnews.com/2025-09-25-trump-and-putin-push-for-ukraine-peace-deal-as-zelensky-clings-to-power.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "The Vaccine â\u0080\u009cTITANTICâ\u0080\u009d is SINKING as the autism link is coming to the surface like a huge glacier thatâ\u0080\u0099s been buried for decades",
    "description": "Oh, the holy grail of medicine, vaccines, may not be “all that” after all, and the vaccine cult is coming apart at the seams as they are forced to reconsider their faith-based medicine protocol. Yes, the “safe and effective” ship is sinking, and the pro-jab f…",
    "link": "https://www.naturalnews.com/2025-09-25-vaccine-titantic-is-sinking-autism-link-is-coming-to-surface.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "Trump pledges to block Israeli annexation of West Bank in closed-door meeting with Muslim leaders",
    "description": "Trump privately vowed to Muslim leaders that he will block Israel’s West Bank annexation plans during a UNGA side meeting. The pledge contradicts pro-annexation voices in his administration and Netanyahu’s hardline coalition pushing for sovereignty. Arab nati…",
    "link": "https://www.naturalnews.com/2025-09-25-trump-block-israeli-annexation-west-bank.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "Trump Derangement Syndrome in FULL EFFECT as lunatic Libtards who are pregnant are now taking Tylenol by the handful",
    "description": "A fresh controversy erupted on Monday after President Donald Trump warned that acetaminophen (Tylenol) use during pregnancy may be linked to an increased risk of autism and attention-deficit hyperactivity disorder (ADHD). Speaking publicly, Trump advised expe…",
    "link": "https://www.naturalnews.com/2025-09-25-tds-pregnant-libtards-now-taking-tylenol-by-the-handful.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "Wakefield vindicated? Trumpâ\u0080\u0099s vaccine overhaul sparks backlash, rekindles autism debate",
    "description": "President Trump advocates splitting MMR vaccine into three separate doses and delaying hepatitis B shots until age 12. Robert F. Kennedy Jr. pushes for autism research into vaccines while facing criticism from medical experts. Wakefield’s controversial 1998 s…",
    "link": "https://www.naturalnews.com/2025-09-25-trumps-vaccine-overhaul-sparks-backlash-rekindles-autism-debate.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "Trump’s $100K H-1B visa fee sparks fears of tech exodus and economic slowdown",
    "description": "Trump’s $100,000 H-1B visa fee sparks fears of economic stagnation, with Berenberg Bank cutting U.S. growth forecasts to 1.5 percent, citing labor force shrinkage and productivity reliance. While large corporations like Netflix can absorb the cost, startups w…",
    "link": "https://www.naturalnews.com/2025-09-25-trumps-new-visa-fee-sparks-tech-exodus-fears.html",
    "timestamp": "2025-09-25T06:00:00Z"
  },
  {
    "title": "India eyes French fighter jet engines as US talks stall",
    "description": "India considers French engines for fighter jets amid slow US talks, aiming to boost domestic defence manufacturing capabilities.",
    "link": "https://www.bloomberg.com/news/articles/2025-09-25/india-may-opt-for-french-fighter-jet-engines-as-us-talks-drag-on",
    "timestamp": "2025-09-25T05:59:37Z"
  },
  {
    "title": "Eric Trump’s Wild Tale Of Watching His Father Stop A War Raises Eyebrows",
    "description": "The Trump scion parroted his father's boast, which has been dubbed \"misleading\" by fact-checkers.",
    "link": "https://www.huffpost.com/entry/eric-trump-dad-war-claim_n_68d4d06de4b0bba54aaa7f8b",
    "timestamp": "2025-09-25T05:58:49Z"
  },
  {
    "title": "DOJ investigator Glenn Prager claims Trump protecting others in Epstein files cover-up",
    "description": "Glenn Prager, former Justice Department investigator, was recorded claiming President Donald Trump shields people implicated in Jeffrey Epstein case files. DOJ disputes Prager's statements and says he lacks access to investigation facts",
    "link": "https://economictimes.indiatimes.com/news/international/us/doj-investigator-glenn-prager-claims-trump-protecting-others-in-epstein-files-cover-up/articleshow/124106130.cms",
    "timestamp": "2025-09-25T05:56:59Z"
  },
  {
    "title": "Palestinian president to address UN virtually after US barred him from attending in person",
    "description": "The Trump administration barred Mahmoud Abbas and his senior aides from travelling to New York for the annual gathering of world leaders.",
    "link": "https://www.thejournal.ie/palestinian-president-united-nations-mahmoud-abbas-6826213-Sep2025/",
    "timestamp": "2025-09-25T05:56:03Z"
  },
  {
    "title": "China unveils specific emissions targets",
    "description": "China on Wednesday issued its first ever absolute targets for cutting planet-warming gases, a landmark pledge from the world's top polluter as the United States doubles down on fossil fuels and Europe falters.",
    "link": "https://www.hurriyetdailynews.com/china-unveils-specific-emissions-targets-213963",
    "timestamp": "2025-09-25T05:55:50Z"
  },
  {
    "title": "Trump, RFK Jr. May Be Right About Acetaminophen, But Why The Rush?",
    "description": "Tell me if you’ve heard this one before: A senile reality TV star and a publicity-seeking nepo baby walk into a press conference and announce that a widely used pain reliever may cause autism … Punch line? No punch line. It really happened, though few would h…",
    "link": "https://www.counterpunch.org/2025/09/25/trump-rfk-jr-may-be-right-about-acetaminophen-but-why-the-rush/",
    "timestamp": "2025-09-25T05:54:36Z"
  },
  {
    "title": "Water, Water, Everywhere? (Not Anymore!)",
    "description": "The truck wheel’s inner tube was right in front of me, no longer half-submerged in the pond’s late summer muck. After so many hot weeks without rain, the water had dried up and the garbage was completely exposed. My feet barely sank into the mud as I pulled t…",
    "link": "https://www.counterpunch.org/2025/09/25/water-water-everywhere-not-anymore/",
    "timestamp": "2025-09-25T05:53:14Z"
  },
  {
    "title": "Türkiye’s renewable energy share surpasses 60 pct: Erdoğan",
    "description": "Türkiye has increased the share of renewable energy in its total installed capacity to over 60 percent as of this year, the Turkish president said Wednesday.",
    "link": "https://www.hurriyetdailynews.com/turkiyes-renewable-energy-share-surpasses-60-pct-erdogan-213962",
    "timestamp": "2025-09-25T05:51:00Z"
  },
  {
    "title": "Key takeaways from day two at the UN's world leaders week",
    "description": "The world's most powerful people are meeting in New York this week. Here are the key takeaways from the UN summit's second day.",
    "link": "https://www.abc.net.au/news/2025-09-25/united-nations-general-assembly-day-two-takeaways/105814272",
    "timestamp": "2025-09-25T05:50:43Z"
  },
  {
    "title": "H-1B visa: Amid chaos on $100,000 fee hike, Bill Gates' old video goes viral — ‘15 IITians helped strengthen Microsoft’",
    "description": "The video assumes significance as tech companies scramble to find solutions to Trump's new H-1B visa rules, which mandates tech professionals from foreign countries to pay $100,000 to the administration in order to secure work in the US.",
    "link": "https://www.livemint.com/companies/people/h1b-visa-amid-chaos-on-100-000-fee-hike-bill-gates-old-video-goes-viral-15-iitians-helped-strengthen-microsoft-11758777039886.html",
    "timestamp": "2025-09-25T05:49:32Z"
  },
  {
    "title": "Leader of Belarus opposition warns Trump: Beware of her nation's president",
    "description": "Sviatlana Tsikhanouskaya cautioned Donald Trump regarding Alexander Lukashenko's intentions. She suggested Lukashenko might be trying to deceive Trump with prisoner releases. While appreciating the releases, Tsikhanouskaya urged caution. She highlighted that …",
    "link": "https://timesofindia.indiatimes.com/world/us/leader-of-belarus-opposition-warns-trump-beware-of-her-nations-president/articleshow/124105468.cms",
    "timestamp": "2025-09-25T05:49:26Z"
  },
  {
    "title": "Who killed the Brussels effect?",
    "description": "In today’s edition: Ursula von der Leyen says NATO should shoot down Russian jets, ex-Palestinian PM casts doubt on the EU’s ‘Donor Group’ plan for Gaza, a Slovak MEP mocks the EU transport debate with an Instagram stunt, and the Brussels effect fades as the …",
    "link": "https://www.euractiv.com/news/rapporteur-who-killed-the-brussels-effect/",
    "timestamp": "2025-09-25T05:47:34Z"
  },
  {
    "title": "South Korean Tech Giant Naver Weighs Move To Acquire Upbit Operator Dunamu",
    "description": "South Korea’s Naver is said to be moving close to a landmark deal that would give the internet giant control over Upbit, the country’s largest cryptocurrency...",
    "link": "https://cryptonews.com/news/upbit-deal-south-korean-tech-giant-naver-weighs-move-to-acquire-dunamu/",
    "timestamp": "2025-09-25T05:38:10Z"
  },
  {
    "title": "The Department of War: Trump’s Costly Contradictions",
    "description": "Donald Trump’s decision to change the name of the Department of Defense to the Department of War, announced on September 5, 2025, has kicked up a storm of debate. This is more than a symbolic tweak. It exposes cracks in Trump’s foreign policy narrative. The e…",
    "link": "https://www.counterpunch.org/2025/09/25/the-department-of-war-trumps-costly-contradictions/",
    "timestamp": "2025-09-25T05:34:42Z"
  },
  {
    "title": "Jimmy Kimmel’s ratings hit 6.3 million despite ongoing boycott from local stations",
    "description": "Before being taken off the air, Kimmel’s show was averaging about 1.77 million viewers during the second quarter of this year",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-kimmel-ratings-youtube-viewership-return-monologue-b2833304.html",
    "timestamp": "2025-09-25T05:33:14Z"
  },
  {
    "title": "Lawrence: How can Democrats negotiate with Trump, the 'world's most powerful man-baby'?",
    "description": "MSNBC's Lawrence O'Donnell reacts to one UK newspaper calling Donald Trump “deranged\" and \"the world's most powerful ...",
    "link": "https://biztoc.com/x/0fc7d048e3986fbe",
    "timestamp": "2025-09-25T05:32:13Z"
  },
  {
    "title": "Taoiseach to discuss trade and conflict with Canadian PM",
    "description": "The Taoiseach is in Canada for a bilateral meeting with the Canadian Prime Minster Mark Carney.",
    "link": "https://www.rte.ie/news/world/2025/0925/1535211-canada-martin/",
    "timestamp": "2025-09-25T05:27:46Z"
  },
  {
    "title": "Who is Agastya Goel? The Indian-origin winner of physics US olympiad seen with Trump",
    "description": "Indian-origin teenager Agastya Goel, part of the US team, achieved a historic gold at the International Physics Olympiad in Paris, a feat that led to a White House visit and praise from Donald Trump. A student at Henry M. Gunn High School, Agastya's accomplis…",
    "link": "https://timesofindia.indiatimes.com/education/news/who-is-agastya-goel-the-indian-origin-physics-us-olympiad-winner-seen-with-trump/articleshow/124105576.cms",
    "timestamp": "2025-09-25T05:25:15Z"
  },
  {
    "title": "To bromance Τραμπ - Ερντογάν: Η χημεία, τα δισεκατομμύρια και τα γεωπολιτικά ναρκοπέδια",
    "description": "Ο Ερντογάν επιστρέφει στον Λευκό Οίκο για μια επίδειξη προσωπικής χημείας με τον Τραμπ και deals - Τα αγκάθια όμως επιμένουνΝατάσα Στασινού • nstasinou@naftemporiki.grΓια πρώτη φορά έπειτα από σχεδόν έξι χρόνια, ο Ρετζέπ Ταγίπ Ερντογάν θα καθίσει απέναντι από…",
    "link": "https://i-epikaira.blogspot.com/2025/09/to-bromance.html",
    "timestamp": "2025-09-25T05:18:00Z"
  },
  {
    "title": "The Indo Daily: Trump, Connolly and the role of Hamas: A political storm in Ireland, a diplomatic shift at the UN",
    "description": "At the UN, global powers are cooling on Israel, but Donald Trump made sure MAGA’s support was loud and clear on a global stage.",
    "link": "https://www.independent.ie/podcasts/the-indo-daily/the-indo-daily-trump-connolly-and-the-role-of-hamas-a-political-storm-in-ireland-a-diplomatic-shift-at-the-un/a912989100.html",
    "timestamp": "2025-09-25T05:13:22Z"
  },
  {
    "title": "Charlie Kirk coin: Late TPUSA co-founder Kirk to become youngest person on US currency under proposed bill",
    "description": "Republican lawmakers are proposing a bill to mint 400,000 silver dollar coins honoring the late conservative activist Charlie Kirk, who tragically died at 31. The coins, slated for 2026, would feature Kirk's likeness and the inscription \"Well done, good and f…",
    "link": "https://economictimes.indiatimes.com/news/international/us/charlie-kirk-coin-bill-could-make-him-the-youngest-person-ever-on-us-currency-lawmakers-say-its-a-fitting-honor/articleshow/124105366.cms",
    "timestamp": "2025-09-25T05:11:39Z"
  },
  {
    "title": "Gregg Jarrett Warns Comey May Not Be ‘In The Clear’ Even If Prosecutors Don’t Indict",
    "description": "Gregg Jarrett said even if prosecutors decline to indict Comey, he may not be \"in the clear\" due to new evidence uncovered by the agency.",
    "link": "https://dailycaller.com/2025/09/25/gregg-jarrett-warns-comey-may-not-be-in-the-clear-even-if-prosecutors-dont-indict/",
    "timestamp": "2025-09-25T05:11:24Z"
  },
  {
    "title": "Trump demands investigation over escalator, teleprompter ‘sabotage’ at UN",
    "description": "US president says Secret Service is investigating 'three very sinister events' at UN headquarters in New York.",
    "link": "https://www.aljazeera.com/news/2025/9/25/trump-demands-investigation-over-escalator-teleprompter-sabotage-at-un",
    "timestamp": "2025-09-25T05:10:19Z"
  },
  {
    "title": "Daniel Geary: Trump’s contempt for the United Nations builds on a long American tradition",
    "description": "Trump’s speech can be seen as a kind of unintentional parody of the contempt with which previous US leaders have treated the UN and world opinion",
    "link": "https://www.irishtimes.com/opinion/2025/09/25/daniel-geary-trumps-contempt-for-the-united-nations-builds-on-a-long-american-tradition/",
    "timestamp": "2025-09-25T05:05:00Z"
  },
  {
    "title": "Zelensky’s “Stockholm syndrome” and the takeaways from the Rubio–Lavrov meeting",
    "description": "Analysts say Trump’s sudden shift on Ukraine sends more signals to allies and U.S. voters than to Moscow\nThe post Zelensky’s “Stockholm syndrome” and the takeaways from the Rubio–Lavrov meeting appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/09/25/zelenskys-stockholm-syndrome-and-the-takeaways-from-the-rubio-lavrov-meeting/",
    "timestamp": "2025-09-25T05:04:03Z"
  },
  {
    "title": "Jimmy Kimmel Goes Right Back to Roasting Trump, Compares Him to Biff From ‘Back to the Future’ | Video",
    "description": "The \"Jimmy Kimmel Live!\" host also reads \"real, unedited text messages\" his co-workers got from family members during the brief suspension\nThe post Jimmy Kimmel Goes Right Back to Roasting Trump, Compares Him to Biff From ‘Back to the Future’ | Video appeared…",
    "link": "https://www.thewrap.com/jimmy-kimmel-back-roasting-trump-biff-back-to-the-future-video/",
    "timestamp": "2025-09-25T05:01:50Z"
  },
  {
    "title": "New embassy 'next chapter' in Ireland-US relations - Govt",
    "description": "Tánaiste and Minister for Foreign Affairs Simon Harris has opened the new Irish embassy in Washington.",
    "link": "https://www.rte.ie/news/us/2025/0925/1535200-irish-embassy-washington/",
    "timestamp": "2025-09-25T05:00:00Z"
  },
  {
    "title": "Jimmy Kimmel Live! Returns With Record-Breaking Views (3 Times More)",
    "description": "Jimmy Kimmel Live! has drawn millions of viewers on broadcast during Kimmel’s highly anticipated return from suspension. Cameras captured the host delivering an emotional monologue on free speech, mixing sincerity with humor as he addressed the controversy su…",
    "link": "https://www.comingsoon.net/tv/news/2032765-jimmy-kimmel-live-views-viewership-6-million-numbers",
    "timestamp": "2025-09-25T04:56:01Z"
  },
  {
    "title": "India may opt for French fighter jet engines as US talks drag on",
    "description": "India considers French engines for fighter jets. Discussions with the US on joint manufacturing face delays. New Delhi aims to replace older jets with nearly 200 advanced aircraft. The nation seeks to boost domestic defense production. India allowed private f…",
    "link": "https://economictimes.indiatimes.com/news/defence/india-may-opt-for-french-fighter-jet-engines-as-us-talks-drag-on/articleshow/124104947.cms",
    "timestamp": "2025-09-25T04:54:49Z"
  },
  {
    "title": "Is the Middle East about to get an 'Islamic NATO'?",
    "description": "Israel's first-ever attack on a Gulf state is causing changes in Arab defense policies, with more calls for regional cooperation and common defense pacts. Some politicians have even called for an \"Islamic NATO.\"",
    "link": "https://www.dw.com/en/is-the-middle-east-about-to-get-an-islamic-nato/a-74111424",
    "timestamp": "2025-09-25T04:51:00Z"
  },
  {
    "title": "Elon Musk's DOGE Uncovered the Biggest Health Care Heist in American History",
    "description": "What if I told you that cartels and other bad actors from around the world conspired to undermine the integrity...",
    "link": "https://pjmedia.com/victoria-taft/2025/09/24/the-biggest-health-care-heist-that-you-probably-never-heard-of-n4944085",
    "timestamp": "2025-09-25T04:46:49Z"
  },
  {
    "title": "All the Times Donald Trump Jr. Praised ‘South Park’ Before Being Roasted by the Show",
    "description": "‘South Park’s Don Jr. will haunt your nightmares",
    "link": "https://www.cracked.com/article_48505_all-the-times-donald-trump-jr-praised-south-park-before-being-roasted-by-the-show.html",
    "timestamp": "2025-09-25T04:45:00Z"
  },
  {
    "title": "It isn't your imagination; Google Cloud is flooding the zone | TechCrunch",
    "description": "While the industry's biggest players cement ever-tighter partnerships, Google is hellbent on capturing the next generation of AI companies before they become too big to court.",
    "link": "https://techcrunch.com/2025/09/24/it-isnt-your-imagination-google-cloud-is-flooding-the-zone/",
    "timestamp": "2025-09-25T04:43:02Z"
  },
  {
    "title": "Eric Schmidt says America's 'chaotic, confusing' style is its greatest strength in the AI race",
    "description": "Former Google CEO Eric Schmidt says the US shouldn't fear its \"chaotic, confusing\" style of innovation — it should lean into it.",
    "link": "https://www.businessinsider.com/eric-schmidt-america-chaotic-innovation-ai-race-strength-china-2025-9",
    "timestamp": "2025-09-25T04:41:41Z"
  },
  {
    "title": "It isn’t your imagination; Google Cloud is flooding the zone",
    "description": "While the industry's biggest players cement ever-tighter partnerships, Google is hellbent on capturing the next generation of AI companies before they become...",
    "link": "https://finance.yahoo.com/news/isn-t-imagination-google-cloud-044136872.html",
    "timestamp": "2025-09-25T04:41:36Z"
  },
  {
    "title": "Editorial: When politicians play doctor",
    "description": "Donald Trump is relentless in his campaign of disinformation, attributing autism risks to paracetamol",
    "link": "https://timesofmalta.com/article/editorial-when-politicians-play-doctor.1116724",
    "timestamp": "2025-09-25T04:41:00Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,309",
    "description": "Here are the key events on day 1,309 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/9/25/russia-ukraine-war-list-of-key-events-day-1309",
    "timestamp": "2025-09-25T04:39:47Z"
  },
  {
    "title": "Oil and gas executives sour on their cheerleader-in-chief",
    "description": "President Donald Trump used the world stage this week to sell American oil and gas. But U.S. oil and gas producers are increasingly feeling sour about the president.\nA quarterly survey of oil and gas companies released today by the Federal Reserve Bank of Dal…",
    "link": "https://biztoc.com/x/db4a8c13f105006b",
    "timestamp": "2025-09-25T04:39:39Z"
  },
  {
    "title": "Trump’s 21-point plan to end the war: What comes next for Gaza, and the conditions set by Arab leaders",
    "description": "According to Axios, the US president intends to present the plan next Monday to Israeli Prime Minister Benjamin Netanyahu, who will visit the White House\nThe post Trump’s 21-point plan to end the war: What comes next for Gaza, and the conditions set by Arab l…",
    "link": "https://en.protothema.gr/2025/09/25/trumps-21-point-plan-to-end-the-war-what-comes-next-for-gaza-and-the-conditions-set-by-arab-leaders/",
    "timestamp": "2025-09-25T04:39:23Z"
  },
  {
    "title": "Dallas ICE facility shooting: What we know about the suspect Joshua Jahn and what happened",
    "description": "Evidence the FBI has gathered on Wednesday’s shooting that killed a detainee at a Dallas ICE field office includes a handwritten note indicating a desire to “give ICE agents real terror,” as well as other clues suggesting “a high degree of pre-attack planning…",
    "link": "https://www.cnn.com/2025/09/25/us/wwk-dallas-ice-facility-shooting",
    "timestamp": "2025-09-25T04:36:26Z"
  },
  {
    "title": "China leads nations with new climate plans, defying U.S. climate denial",
    "description": "China's reduction target marked the first time the world's biggest emitter pledged a cut in emissions, rather than just limiting their growth.",
    "link": "https://www.japantimes.co.jp/environment/2025/09/25/climate-change/china-climate-plans-us-denial/",
    "timestamp": "2025-09-25T04:34:00Z"
  },
  {
    "title": "The day after the canceled meeting in New York – Mitsotakis’ messages to Ankara",
    "description": "The Greek government moved quickly to manage the fallout from the cancellation of the planned meeting in New York between Prime Minister Kyriakos Mitsotakis and Turkish President Recep Tayyip Erdoğan. Officials sought to downplay the drama while making clear …",
    "link": "https://en.protothema.gr/2025/09/25/the-day-after-the-canceled-meeting-in-new-york-mitsotakis-messages-to-ankara/",
    "timestamp": "2025-09-25T04:33:31Z"
  },
  {
    "title": "Trump Peace Proposal for Palestine: All Hostages Returned, Hamas Out, 'Islamic Arab' Interim Gov't",
    "description": "Great plan. It will -- and did -- get all of the golf claps from the international arena. Don't expect it to go anywhere, though, because Hamas will never agree to go anywhere else. It's still worth a shot, though, even just for the value of clarifying which …",
    "link": "https://freerepublic.com/focus/f-news/4342511/posts",
    "timestamp": "2025-09-25T04:31:35Z"
  },
  {
    "title": "Conor McKeon: The worst thing you can be in Donald Trump’s America is a loser",
    "description": "Trump is coming. We knew this already, but additional notice landed on Wednesday morning in an email from the PGA of America warning of expanded, quite possibly intimate, security checks for those of us lucky enough to share the property with the Commander in…",
    "link": "https://www.independent.ie/sport/golf/conor-mckeon-the-worst-thing-you-can-be-in-donald-trumps-america-is-a-loser/a247161249.html",
    "timestamp": "2025-09-25T04:30:00Z"
  },
  {
    "title": "Opinion: India Needs More Than Data For AI Ambitions As China-US AI War Rages",
    "description": "China's gigantic lead in renewable energy may give it an edge for the future and which is why India also needs to double down on its ambitious renewable energy plans.",
    "link": "https://www.ndtvprofit.com/opinion/india-needs-more-than-data-for-ai-ambitions-as-china-us-ai-war-rages",
    "timestamp": "2025-09-25T04:30:00Z"
  },
  {
    "title": "US president Donald Trump was wrongly influenced by Volodymyr Zelensky, says Kremlin",
    "description": "The Kremlin yesterday flatly rejected what Donald Trump said was the rationale behind his rhetorical U-turn on the war in Ukraine, saying it appeared that the US president had been influenced by Ukraine’s leader and was mistaken.",
    "link": "https://www.independent.ie/world-news/europe/us-president-donald-trump-was-wrongly-influenced-by-volodymyr-zelensky-says-kremlin/a13775341.html",
    "timestamp": "2025-09-25T04:30:00Z"
  },
  {
    "title": "Israeli troops push towards the centre of Gaza City amid exodus",
    "description": "Israeli forces pushed towards the heart of Gaza City yesterday, placing at risk the lives of Palestinians who had stayed in hopes that growing pressure on Israel for a ceasefire would mean they would not lose their homes.",
    "link": "https://www.independent.ie/world-news/middle-east/israeli-troops-push-towards-the-centre-of-gaza-city-amid-exodus/a1152558273.html",
    "timestamp": "2025-09-25T04:30:00Z"
  },
  {
    "title": "Sniper wrote ‘anti-ICE’ on bullet before Dallas attack, ?say US officials",
    "description": "A gunman who wrote “anti-ICE” on an unused bullet killed two detainees and wounded another yesterday at an Immigration and Customs Enforcement (ICE) field office in Dallas, Texas, before taking their own life, officials said.",
    "link": "https://www.independent.ie/world-news/north-america/sniper-wrote-anti-ice-on-bullet-before-dallas-attack-say-us-officials/a280249191.html",
    "timestamp": "2025-09-25T04:30:00Z"
  },
  {
    "title": "Stop Russia or face ‘most destructive’ arms race, Ukrainian president Volodymyr Zelensky tells United Nations",
    "description": "Ukrainian president Volodymyr Zelensky urged world powers to help stop Russia’s war in his country in a speech to the United Nations yesterday, warning of a dangerous arms race that he said the fighting was helping unleash.",
    "link": "https://www.independent.ie/world-news/europe/stop-russia-or-face-most-destructive-arms-race-ukrainian-president-volodymyr-zelensky-tells-united-nations/a1694581602.html",
    "timestamp": "2025-09-25T04:30:00Z"
  },
  {
    "title": "‘South Park’ Abandons Controversial Topic of Charlie Kirk for Gaza and Abortion",
    "description": "By\n Opheli Garcia Lawler\n Published: September 24th, 2025",
    "link": "https://www.cracked.com/article_48507_south-park-abandons-controversial-topic-of-charlie-kirk-for-gaza-and-abortion.html",
    "timestamp": "2025-09-25T04:30:00Z"
  },
  {
    "title": "Letters: Donald Trump’s climate-change denial leaves us weaker in the midst of a global crisis",
    "description": "In his address to the United Nations General Assembly, Donald Trump portrayed climate agreements as a “globalist concept” that forces successful nations to “inflict pain on themselves”.",
    "link": "https://www.independent.ie/opinion/letters/letters-donald-trumps-climate-change-denial-leaves-us-weaker-in-the-midst-of-a-global-crisis/a948323257.html",
    "timestamp": "2025-09-25T04:30:00Z"
  },
  {
    "title": "Malaysia AEM delegation to meet US trade official on Sept 25",
    "description": "KUALA LUMPUR: Malaysia is set to hold a meeting with the United States' top trade official on Thursday (Sept 25), Datuk Seri Tengku Zafrul Abdul Aziz confirms. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/09/25/malaysia-aem-delegation-to-meet-us-trade-official-on-sept-25",
    "timestamp": "2025-09-25T04:28:00Z"
  },
  {
    "title": "Japan and ASEAN nations to cooperate on bolstering supply chains",
    "description": "Japan and ASEAN are slated to set up a task force to select areas in which they will cooperate.",
    "link": "https://www.japantimes.co.jp/business/2025/09/25/economy/japan-asean-supply-chain-boost/",
    "timestamp": "2025-09-25T04:28:00Z"
  },
  {
    "title": "Escalator-Gate Continues: Trump Demands Investigation Into Potential 'Triple Sabotage' of His Visit at the UN",
    "description": "President Donald Trump’s visit to the United Nations was marred by several “technical malfunctions.” An escalator stopped suddenly as he and First Lady Melania stepped on it, almost causing them to be pitched forward onto their faces, then his teleprompter su…",
    "link": "https://freerepublic.com/focus/f-news/4342510/posts",
    "timestamp": "2025-09-25T04:27:06Z"
  },
  {
    "title": "Jordan Klepper Sees the Strategy in Trump’s Ukraine Pivot: ‘Can’t Lose a War If You’re on Both Sides’ | Video",
    "description": "The \"Daily Show\" host jokes he could switch sides again \"if he gets complimented by a Russian lady or sees a photo of that dog that looks like Vladimir Putin\"\nThe post Jordan Klepper Sees the Strategy in Trump’s Ukraine Pivot: ‘Can’t Lose a War If You’re on B…",
    "link": "https://www.thewrap.com/jordan-klepper-daily-show-trump-ukraine-cant-lose-both-sides-video/",
    "timestamp": "2025-09-25T04:23:46Z"
  },
  {
    "title": "‘Underwhelming’: China’s new climate target falls far short, experts say",
    "description": "Pledge to cut emissions by 7-10 percent does not go far enough, though renewables rollout a cause for hope, expert say.",
    "link": "https://www.aljazeera.com/economy/2025/9/25/underwhelming-chinas-new-climate-target-falls-far-short-experts-say",
    "timestamp": "2025-09-25T04:23:13Z"
  },
  {
    "title": "NATO divided on how to respond to repeated Russian incursions | CNN Politics",
    "description": "NATO allies are divided over whether the alliance should make it a policy to shoot down Russian jets that violate NATO’s airspace, with some countries including the US, Poland, and Baltic nations signaling that future violations should be met with force, whil…",
    "link": "https://www.cnn.com/2025/09/25/politics/nato-divided-repeated-russian-incursions-response",
    "timestamp": "2025-09-25T04:22:40Z"
  },
  {
    "title": "Trump-targeted GOP congressman Massie tours his Kentucky district with support from Sen. Rand Paul",
    "description": "Republican Rep. Thomas Massie of Kentucky has enlisted help from a key ally, Sen. Rand Paul, as he tries to fend off President Donald Trump’s threats to oust him from Congress",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-targeted-gop-congressman-massie-tours-kentucky-district-125915911",
    "timestamp": "2025-09-25T04:22:21Z"
  },
  {
    "title": "Denmark PM apologises to indigenous Greenlanders who faced forced contraception",
    "description": "The apology by Mette Frederiksen in Greenland’s capital, Nuuk, hopes to close a traumatic chapter in Greenland's history.",
    "link": "https://www.abc.net.au/news/2025-09-25/denmark-pm-apologises-to-greenland-over-contraception/105816090",
    "timestamp": "2025-09-25T04:19:08Z"
  },
  {
    "title": "Luigi Mangione's Lawyers Blame Trump For Violating Right To Fair Trial By Publicly Calling Him 'A Pure Assassin'",
    "description": "Lawyers for Luigi Mangione, the man accused of killing UnitedHealth Group Inc. (NYSE:UNH) CEO Brian Thompson, argued in a Tuesday filing that President Donald Trump has violated Mangione's right to a fair trial by publicly portraying him as guilty and that Ju…",
    "link": "https://biztoc.com/x/0f420a853e7fddd2",
    "timestamp": "2025-09-25T04:17:23Z"
  },
  {
    "title": "Jimmy Kimmel Predicts Trump Will “Try To Sue” ABC After Rant About Talk Show Return: “He Does Know Bad Ratings”",
    "description": "As Jimmy Kimmel gets back into the swing of things, his regularly scheduled jokes about President Donald Trump have resumed. On Wednesday’s episode of Jimmy Kimmel Live!, following a major viewership boost for ABC, the comedian predicted Trump will “try to su…",
    "link": "http://deadline.com/2025/09/jimmy-kimmel-trump-does-know-bad-ratings-1236555293/",
    "timestamp": "2025-09-25T04:16:43Z"
  },
  {
    "title": "‘South Park’ Tortures FCC Chair Brendan Carr in New Episode",
    "description": "It’s pretty clear what Trey Parker and Matt Stone think about television’s top censor",
    "link": "https://www.cracked.com/article_48506_south-park-tortures-fcc-chair-brendan-carr-in-new-episode.html",
    "timestamp": "2025-09-25T04:15:00Z"
  },
  {
    "title": "Trump is hosting Turkey's Erdogan at the White House as the US considers lifting ban on F-35 sales",
    "description": "President Donald Trump plans to meet with Turkish President Recep Tayyip Erdogan at the White House on Thursday",
    "link": "https://abcnews.go.com/US/wireStory/trump-hosting-turkeys-erdogan-white-house-us-considers-125915828",
    "timestamp": "2025-09-25T04:06:49Z"
  },
  {
    "title": "Is Benjamin Netanyahu on a Mission to Realize a Greater Israel?",
    "description": "By Amin Saikal, The University of Western Australia, Victoria University, Australian National University (The Conversation) - Much of the world is focused on a two-state solution in resolving the long-running Israeli-Palestinian conflict, but Israeli Prime Mi…",
    "link": "https://www.juancole.com/2025/09/benjamin-netanyahu-mission.html",
    "timestamp": "2025-09-25T04:06:32Z"
  },
  {
    "title": "Kimmel Saga no Laughing Matter: Trump and the North Koreanization of America",
    "description": "( Foreign Policy in Focus ) - Jesters once had considerably more leeway than the average person to make fun of the king. If otherwise loyal subjects made light of their leader, they could lose their head. Jesters, however, could test the limits of the possibl…",
    "link": "https://www.juancole.com/2025/09/laughing-koreanization-america.html",
    "timestamp": "2025-09-25T04:06:17Z"
  },
  {
    "title": "Trump Continues Rampage Against U.N., Citing ‘Three Very Sinister Events’",
    "description": "He's now calling for an investigation into a stopped escalator and a faulty teleprompter.",
    "link": "https://www.huffpost.com/entry/trump-united-nations_n_68d4b647e4b01e99f72d990f",
    "timestamp": "2025-09-25T04:03:16Z"
  },
  {
    "title": "Europe Surrenders to Trump",
    "description": "The dependence of the old continent on America is bad for both. \nThe post Europe Surrenders to Trump appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/europe-surrenders-to-trump/",
    "timestamp": "2025-09-25T04:01:00Z"
  }
]