[
  {
    "title": "Judges Have Rebuked Trump’s Mass Detention of Immigrants Thousands of Times",
    "description": "Hundreds of judges across the nation have ruled over 4,400 times that President Donald Trump’s immigration enforcement arm is detaining people unlawfully, according to a new Reuters review of court documents. And that’s just since October.  The Trump administ…",
    "link": "https://www.motherjones.com/politics/2026/02/judges-reuters-immigration-detention/",
    "timestamp": "2026-02-14T18:28:46Z"
  },
  {
    "title": "Gideon Sa'ar to represent Israel at Trump's Peace Council",
    "description": "Foreign Minister Gideon Sa'ar to fly to Washington to attend Peace Council, at the request of Israeli Prime Minister Benjamin Netanyahu.",
    "link": "https://www.israelnationalnews.com/news/422403",
    "timestamp": "2026-02-14T18:28:44Z"
  },
  {
    "title": "Top Trump envoys to join Ukraine peace talks in Geneva – Reuters",
    "description": "President Donald Trump’s envoys Steve Witkoff and Jared Kushner will reportedly join the upcoming Russia-US-Ukraine peace talks in Geneva Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632516-trump-envoys-russia-us-ukraine-talks/",
    "timestamp": "2026-02-14T18:27:08Z"
  },
  {
    "title": "Trump Slams Bill Maher as a ‘Highly Overrated Lightweight’ and Calls Their White House Dinner a ‘Complete Waste of Time’: ‘He Is No Different Than Kimmel, Fallon, or Colbert’",
    "description": "Donald Trump posted a lengthy message to Truth Social on Saturday morning in which he recalled his White House dinner with “Real Time” host Bill Maher. The president called the evening a “total waste of time” and said Maher is “no different” than his more lib…",
    "link": "https://variety.com/2026/tv/news/trump-bill-maher-white-house-dinner-waste-of-time-1236663505/",
    "timestamp": "2026-02-14T18:23:33Z"
  },
  {
    "title": "Column: Trump's US$1.5T defense dream hits rust-belt reality",
    "description": "US President Donald Trump has requested a fiscal year 2027 defense budget of US$1.5 trillion. This represents a nearly 50% increase from fiscal year 2026's roughly US$1 trillion. Trump's goal is clear: rebuild a strong military. Experts expect the budget to s…",
    "link": "https://www.digitimes.com/news/a20260209PD224/budget-donald-trump-2027-military-aircraft.html",
    "timestamp": "2026-02-14T18:22:00Z"
  },
  {
    "title": "Son of Iran's last shah urges U.S. action as supporters rally in Munich",
    "description": "In Munich, around 200,000 of his supporters thronged the streets calling on World leadersto ramp up pressure against the Islamic republic.",
    "link": "https://nationalpost.com/news/world/son-of-irans-last-shah-urges-u-s-action-as-supporters-rally-in-munich",
    "timestamp": "2026-02-14T18:21:36Z"
  },
  {
    "title": "Grassroots Organizers in Wisconsin Offer Blueprint for Beating Back Data Centers",
    "description": "Private equity firms are investing heavily in new AI data centers, but local communities are finding ways to fight back.",
    "link": "https://truthout.org/articles/grassroots-organizers-in-wisconsin-offer-blueprint-for-beating-back-data-centers/",
    "timestamp": "2026-02-14T18:20:47Z"
  },
  {
    "title": "Arizona Sheriff Denies Damning Claim About Guthrie Case, Rubio Heads To Munich Summit: Live Updates",
    "description": "\"Sometimes in life you waste time!\" President Donald Trump said about his dinner date with self-described comedian Bill Maher.",
    "link": "https://www.huffpost.com/entry/trump-breaks-up-with-bill-maher-on-valentines-day_n_6990b5eee4b0d24cb0c47b58",
    "timestamp": "2026-02-14T18:17:02Z"
  },
  {
    "title": "Can Meme Coins Power a Senate Bid? Virginia’s Mark Moran Says Yes",
    "description": "Mark Moran is using a meme coin on Solana to elevate his U.S. Senate bid, rallying degens against a pro-crypto Democrat in Virginia.",
    "link": "https://decrypt.co/358070/can-meme-coins-power-senate-bid-virginia-mark-moran-says-yes",
    "timestamp": "2026-02-14T18:14:46Z"
  },
  {
    "title": "Elie Mystal Loses It on CNN Guest Over Epstein Files: ‘I Am NOT Deflecting!’",
    "description": "Pete Seat went at it with Elie Mystal over the Epstein files on CNN's Table For Five Saturday, accusing him of deflecting his question.\nThe post Elie Mystal Loses It on CNN Guest Over Epstein Files: ‘I Am NOT Deflecting!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/elie-mystal-loses-it-on-cnn-guest-over-epstein-files-i-am-not-deflecting/",
    "timestamp": "2026-02-14T18:12:28Z"
  },
  {
    "title": "Rosie O'Donnell Reveals Secret U.S. Trip After Leaving Amid Trump Presidency",
    "description": "Rosie O’Donnell revealed she secretly traveled to the United States after leaving the country amid Donald Trump’s second term as president. “I was recently home for two weeks and I did not really tell anyone,” O’Donnell, 63, said after calling into SiriusXM’s…",
    "link": "https://www.usmagazine.com/celebrity-news/news/rosie-odonnell-made-secret-u-s-trip-after-leaving-amid-trump-presidency/",
    "timestamp": "2026-02-14T18:11:31Z"
  },
  {
    "title": "200,000 people protest against Iran regime as world leaders gather nearby",
    "description": "Around 200,000 people demonstrated against the Iranian regime on the sidelines of a gathering of world leaders on Saturday.",
    "link": "https://news.sky.com/story/200-000-people-protest-against-iran-regime-as-world-leaders-gather-nearby-13507668",
    "timestamp": "2026-02-14T18:02:00Z"
  },
  {
    "title": "Trump’s Attack on Green Energy Hits Manufacturing Sector Hard",
    "description": "United States President Donald Trump has repeatedly pledged to ramp up the country’s manufacturing capacity and create more American jobs across a wide range of industries. While Trump has supported the expansion of certain industries, he has hindered the ope…",
    "link": "https://oilprice.com/Energy/Energy-General/Trumps-Attack-on-Green-Energy-Hits-Manufacturing-Sector-Hard.html",
    "timestamp": "2026-02-14T18:00:00Z"
  },
  {
    "title": "Zelenskyy says U.S. too often asks Ukraine, not Russia, for concessions, ahead of Geneva peace talks",
    "description": "Ukrainian President Volodymyr Zelenskyy voiced hope on Saturday that U.S.-brokered peace talks in Geneva next week would be substantive, but he said Ukraine was being asked \"too often\" to make concessions.",
    "link": "https://www.cbc.ca/news/world/ukrainian-president-zelenskyy-geneva-talks-9.7090537",
    "timestamp": "2026-02-14T17:59:40Z"
  },
  {
    "title": "Bill Maher Burns Trump Officials For 'Biggest Dick Move In History'",
    "description": "The \"Real Time\" host also discussed a different kind of \"dick\" elsewhere in the episode.",
    "link": "https://www.huffpost.com/entry/bill-maher-trump-dick-move_n_698e4a52e4b0967ff00a48b9",
    "timestamp": "2026-02-14T17:59:36Z"
  },
  {
    "title": "India's power must protect democracy beyond borders: Author Marianne Williamson at ET Now GBS 2026",
    "description": "India's economic strength positions it to lead globally. Author Marianne Williamson urges India to embrace its democratic potential for worldwide benefit. She highlights that economic prosperity alone does not guarantee stability or democratic values.  Modern…",
    "link": "https://economictimes.indiatimes.com/news/india/indias-power-must-protect-democracy-beyond-borders-author-marianne-williamson-at-et-now-gbs-2026/articleshow/128357149.cms",
    "timestamp": "2026-02-14T17:59:30Z"
  },
  {
    "title": "Ukraine's Zelenskyy at MSC: Putin is a 'slave to war'",
    "description": "Almost four years after Russia launched its invasion of Ukraine, peace is nowhere in sight. At the Munich Security Conference, Ukrainian President Volodymyr Zelenskiyy said his country needed more weapons — fast.",
    "link": "https://www.dw.com/en/ukraines-zelenskyy-at-msc-putin-is-a-slave-to-war/a-75973922",
    "timestamp": "2026-02-14T17:54:00Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Rips Trump Attacks On Women Reporters — Tells Press To Stand Up To Him",
    "description": "Kaitlan Collins called out President Donald Trump's \"inappropriate\" attacks on women reporters, and said it's important for reporters to show \"backbone.\"\nThe post CNN’s Kaitlan Collins Rips Trump Attacks On Women Reporters — Tells Press To Stand Up To Him fir…",
    "link": "https://www.mediaite.com/media/podcasts/cnns-kaitlan-collins-rips-trump-attacks-on-women-reporters/",
    "timestamp": "2026-02-14T17:51:46Z"
  },
  {
    "title": "Hundreds of Anti-Trans Bills Have Already Been Introduced This Year",
    "description": "Advocates say the wave of legislation is the culmination of a decade-long campaign to undo victories for LGBTQ+ rights.",
    "link": "https://prismreports.org/2026/02/09/anti-transgender-bills-2026/",
    "timestamp": "2026-02-14T17:47:37Z"
  },
  {
    "title": "Advocates sound alarm over GOP’s environment-destroying ‘monstrosity’",
    "description": "Advocates for animal welfare, environmental protection, public health, and small family farms fiercely condemned various “industry-backed poison pills” in the long-awaited Farm Bill draft unveiled Friday by a key Republican in the US House of Representatives.…",
    "link": "https://www.rawstory.com/farm-bill/",
    "timestamp": "2026-02-14T17:46:02Z"
  },
  {
    "title": "Trump slams Bill Maher in Truth Social post as ‘extremely nervous,’ ‘ZERO confidence in himself’",
    "description": "President Trump shared his regrets about sharing precious minutes dining with comedian Bill Maher, host of HBO’s “Real Time,” during an event organized by singer Kid Rock back in April.",
    "link": "https://nypost.com/2026/02/14/us-news/trump-slams-bill-maher-in-truth-social-post-as-extremely-nervous-zero-confidence-in-himself/",
    "timestamp": "2026-02-14T17:45:57Z"
  },
  {
    "title": "Pinker and Tupy tout worldwide progress, espouse an objective morality",
    "description": "In this Free Press article, Steve Pinker and Marian Tupy (the latter identified as “the founder and editor of HumanProgress.org, a senior fellow at the Cato Institute, and co-author of Superabundance”) once again recount the undoubtable progress that humanity…",
    "link": "https://whyevolutionistrue.com/2026/02/14/pinker-and-tupy-tout-worldwide-progress-espouse-an-objective-morality/",
    "timestamp": "2026-02-14T17:45:20Z"
  },
  {
    "title": "Does ‘Christian genocide’ capture the reality of Nigeria’s security map?",
    "description": "Longstanding, regionally fragmented security crises in Nigeria are fueled by a complex mix of factors Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/632345-nigeria-security-crisis-and-threats/",
    "timestamp": "2026-02-14T17:42:18Z"
  },
  {
    "title": "Trump Blasts ‘Total Waste of Time’ Dinner With Bill Maher: ‘Extremely Nervous … ZERO Confidence in Himself’",
    "description": "Donald Trump appeared frustrated Saturday after thinking over his April dinner with TV host Bill Maher (presumably the one that also included Kid Rock and Dana White). Trump ripped into the experience in a lengthy post shared on Truth Social in which he descr…",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-dinner-with-bill-maher-extremely-nervous-zero-confidence/",
    "timestamp": "2026-02-14T17:39:10Z"
  },
  {
    "title": "Gavin Newsom calls Trump ‘un-American’ after ditching California for second overseas trip in less than a month",
    "description": "California Gov. Gavin Newsom ripped President Trump as “un-American” during an appearance in Munich Saturday after leaving the Golden State state behind for a second European sojourn in less than a month. Newsom took the stage at the Munich Security Conferenc…",
    "link": "https://nypost.com/2026/02/14/us-news/gavin-newsom-calls-trump-un-american-after-ditching-california-for-second-overseas-trip-in-less-than-a-month/",
    "timestamp": "2026-02-14T17:38:58Z"
  },
  {
    "title": "Oil rises on US inflation optimism despite Opec supply concern",
    "description": "Oil rises on US inflation optimism despite Opec supply concerngulf-times.com",
    "link": "https://www.gulf-times.com/article/720521/business/oil-rises-on-us-inflation-optimism-despite-opec-supply-concern",
    "timestamp": "2026-02-14T17:38:32Z"
  },
  {
    "title": "AEW Grand Slam Australia Preview: Your Guide to Tony Khan Down Under",
    "description": "The Chadster cannot believe what Tony Khan is putting The Chadster through tonight  As if it wasn't bad enough that The Chadster is living in an abandoned Blockbuster Video with a family of raccoons, now The Chadster has to sit here on a busted-up recli…",
    "link": "https://bleedingcool.com/tv/aew-grand-slam-australia-preview-your-guide-to-tony-khan-down-under/",
    "timestamp": "2026-02-14T17:37:07Z"
  },
  {
    "title": "US prepares for weeks-long operation in Iran",
    "description": "Two US officials told Reuters that the US military is preparing for a weeks-long operation in Iran if Trump orders an attack.",
    "link": "https://www.israelnationalnews.com/news/422401",
    "timestamp": "2026-02-14T17:37:00Z"
  },
  {
    "title": "Trump trounces Biden energy records in just months as admin celebrates 1 year of 'historic gains': data",
    "description": "White House marks National Energy Dominance Council anniversary with Interior Secretary Doug Burgum touting energy production gains and lower gas prices under Trump administration.",
    "link": "https://www.foxnews.com/politics/trump-trounces-biden-energy-records-just-months-admin-celebrates-1-year-historic-gains-data",
    "timestamp": "2026-02-14T17:35:12Z"
  },
  {
    "title": "Rosie O'Donnell quietly returns to US after abandoning country over Trump's victory",
    "description": "After a self-imposed political exile to Ireland following President Donald Trump’s re-election, Rosie O'Donnell quietly returned to the United States. During an interview with Chris Cuomo (snip) the 63-year-old actress revealed she recently returned to the co…",
    "link": "https://freerepublic.com/focus/f-chat/4366850/posts",
    "timestamp": "2026-02-14T17:33:29Z"
  },
  {
    "title": "Iran, US spar as diaspora organises rallies abroad calling for action",
    "description": "Iranian families release footage online commemorating loved ones shot during nationwide antigovernment protests.",
    "link": "https://www.aljazeera.com/news/2026/2/14/iran-us-spar-as-diaspora-organises-rallies-abroad-calling-for-action",
    "timestamp": "2026-02-14T17:32:59Z"
  },
  {
    "title": "Trump Rages at Bill Maher In Bonkers And Oddly-Detailed Rant About Their Infamous Dinner",
    "description": "President Donald Trump raged at comedian and pundit Bill Maher in a rambling and oddly detailed rant that included a derisive account of their dinner together.\nThe post Trump Rages at Bill Maher In Bonkers And Oddly-Detailed Rant About Their Infamous Dinner f…",
    "link": "https://www.mediaite.com/media/entertainment/trump-rages-at-bill-maher-in-bonkers-and-oddly-detailed-rant-about-their-infamous-dinner/",
    "timestamp": "2026-02-14T17:32:59Z"
  },
  {
    "title": "Marco Rubio reassures Europe’s leaders of US backing if they change course",
    "description": "Secretary of State Marco Rubio applied a velvet glove to the Trump administration’s still-clenched fist during his high-profile speech at the Munich Security Conference on Saturday, offering some reassurance to uneasy European leaders that the US remains comm…",
    "link": "https://www.cnn.com/2026/02/14/europe/marco-rubio-europe-partnership-munich-intl",
    "timestamp": "2026-02-14T17:30:45Z"
  },
  {
    "title": "Donald Trump Rages At Bill Maher, Says “It Was A Total Waste Of Time For Me To Have This Jerk At The White House”",
    "description": "Donald Trump returned to bashing Bill Maher on Saturday, almost a year after the HBO Real Time host dined with him at the White House. The president took...",
    "link": "https://deadline.com/2026/02/trump-bill-maher-white-house-dinner-1236724910/",
    "timestamp": "2026-02-14T17:30:37Z"
  },
  {
    "title": "Donald Trump Rages At Bill Maher, Says “It Was A Total Waste Of Time For Me To Have This Jerk At The White House”",
    "description": "Donald Trump returned to bashing Bill Maher on Saturday, almost a year after the HBO Real Time host dined with him at the White House. The president took offense at some of Maher’s jokes and commentary on Friday, including the president’s prediction that Chin…",
    "link": "http://deadline.com/2026/02/trump-bill-maher-white-house-dinner-1236724910/",
    "timestamp": "2026-02-14T17:30:37Z"
  },
  {
    "title": "Dangerously irresponsible gun owners",
    "description": "I have often railed about the fact that a car is recognized as a dangerous item in the hands of anyone and hence we require an age requirement, training, and certification before people are allowed to use one. And yet people in the US can just walk into some …",
    "link": "https://freethoughtblogs.com/singham/2026/02/14/dangerously-irresponsible-gun-owners/",
    "timestamp": "2026-02-14T17:30:09Z"
  },
  {
    "title": "Canada wants Iran government change, increases sanctions",
    "description": "TORONTO, Feb 14 (Reuters) - ⁠Canadian Foreign Affairs Minister Anita Anand said ⁠Canada wants a change of government in ‌Iran but would not say whether it would support a U.S. military strike, the Globe and Mail reported ​on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/15/canada-wants-iran-government-change-increases-sanctions",
    "timestamp": "2026-02-14T17:26:00Z"
  },
  {
    "title": "VIDEO: Immigrant Restaurant Owner Offers ICE Agents Free Meals Because 'It's the Right Thing to Do'",
    "description": "An immigrant restaurant owner in Catalina, Arizona, is showing warm hospitality to U.S. Immigration and Customs Enforcement (ICE) agents as they face an increase in threats.\nThe post VIDEO: Immigrant Restaurant Owner Offers ICE Agents Free Meals Because ‘It’s…",
    "link": "https://www.breitbart.com/politics/2026/02/14/video-immigrant-restaurant-owner-offers-ice-agents-free-meals-because-its-the-right-thing-to-do/",
    "timestamp": "2026-02-14T17:21:35Z"
  },
  {
    "title": "Rubio Says U.S. and Europe ‘Belong Together’ In Speech To World Leaders",
    "description": "Rubio adopted a more conciliatory tone in his speech than J.D. Vance did one year ago at the Munich Security Conference, signaling a shift.",
    "link": "https://time.com/7378722/rubio-europe-speech-us-trump/",
    "timestamp": "2026-02-14T17:21:01Z"
  },
  {
    "title": "Hundreds of Thousands Protest Islamist Iranian Regime in Munich",
    "description": "About 200,000 people joined a demonstration against the Iranian government in Munich on Saturday, police said, as world leaders gathered nearby for a security conference.\nThe post Hundreds of Thousands Protest Islamist Iranian Regime in Munich appeared first …",
    "link": "https://www.breitbart.com/europe/2026/02/14/hundreds-of-thousands-protest-islamist-iranian-regime-in-munich/",
    "timestamp": "2026-02-14T17:20:23Z"
  },
  {
    "title": "President Trump Delivers Biggest Regulatory Relief in History",
    "description": "President Trump Delivers Biggest Regulatory Relief in History The following is from the Trump team.  This week, President Donald J.\nThe post President Trump Delivers Biggest Regulatory Relief in History appeared first on The Gateway Pundit.",
    "link": "https://joehoft.com/president-trump-delivers-biggest-regulatory-relief-history/",
    "timestamp": "2026-02-14T17:20:20Z"
  },
  {
    "title": "Canada wants Iran government change, increases sanctions",
    "description": "TORONTO, Feb 14 (Reuters) - Canadian Foreign Affairs Minister Anita Anand said Canada wants a change of government in Iran but would not say whether it would support a U.… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/14/canada-wants-iran-government-change-increases-sanctions",
    "timestamp": "2026-02-14T17:13:05Z"
  },
  {
    "title": "Rubio casts US, the 'child of Europe', as critical friend to allies",
    "description": "MUNICH, Feb 14 (Reuters) - Secretary of State ⁠Marco Rubio cast the United States as the \"child of Europe\" in a message of unity on Saturday, offering some reassurance as well as levelling more criticism at allies after a year of ⁠turmoil in transatlantic rel…",
    "link": "https://www.thestar.com.my/news/world/2026/02/15/rubio-casts-us-the-039child-of-europe039-as-critical-friend-to-allies",
    "timestamp": "2026-02-14T17:08:00Z"
  },
  {
    "title": "Trump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted - NewsBreak",
    "description": "Trust in government health agencies has plummeted, according to health policy and research group KFF, with declines across the political spectrum. And expe",
    "link": "https://www.newsbreak.com/share/4491502925052-trump-promised-rfk-jr-would-restore-faith-in-american-health-care-a-year-in-trust-has-plummeted?s=a2&amp;share_destination_id=MTk3NzQ1MTkzLTE3NzEwODg3NDM1MDQ%3D&amp;pd=0DNiYbQE&amp;hl=en_US&amp;send_time=1771088743&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.6.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-14T17:06:35Z"
  },
  {
    "title": "Trump insider Tom Barrack kept in contact with Epstein for years, files show",
    "description": "Tom Barrack, a top U.S. diplomat and longtime friend of President Trump, networked and socialized with Epstein for years, CBS News found.",
    "link": "https://www.cbsnews.com/news/tom-barrack-jeffrey-epstein-files/",
    "timestamp": "2026-02-14T17:00:00Z"
  },
  {
    "title": "Latin America’s Rightward Turn Continues in Costa Rica",
    "description": "Voters are looking for solutions to crime and disorder.\nThe post Latin America’s Rightward Turn Continues in Costa Rica appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/latin-americas-rightward-turn-continues-in-costa-rica/",
    "timestamp": "2026-02-14T17:00:00Z"
  },
  {
    "title": "Zelenskyy knocks Trump admin for hitting Ukraine with demands ‘too often’: report",
    "description": "Ukrainian President Volodymyr Zelenskyy took aim at the Trump administration on Saturday after accusing it of pressing Kyiv for concessions in its ongoing efforts to end the war, while sparing Russia from comparable demands, NBC News reported\r\n.“The Americans…",
    "link": "https://www.rawstory.com/ukraine-2675269820/",
    "timestamp": "2026-02-14T16:59:24Z"
  },
  {
    "title": "Trump Plans Executive Order On Voter ID",
    "description": "President Trump announces executive order requiring voter ID for 2026 midterms if SAVE America Act fails in Senate. 83% of Americans support the requirement.",
    "link": "https://dailycaller.com/2026/02/14/trump-executive-order-voter-id/",
    "timestamp": "2026-02-14T16:55:19Z"
  },
  {
    "title": "The coming weeks could see key tests of U.S. consumers' outlook",
    "description": "Valentine's Day, early tax refunds and Presidents Day sales all offer hints about how U.S. consumers are feeling about their finances.",
    "link": "https://www.nbcnews.com/business/consumer/tax-refunds-consumer-confidence-rcna259056",
    "timestamp": "2026-02-14T16:50:16Z"
  },
  {
    "title": "Trump tells soldiers to vote GOP in campaign-style rally at Fort Bragg (Isaac Arnsdorf/Washington Post)",
    "description": "Isaac Arnsdorf / Washington Post:\nTrump tells soldiers to vote GOP in campaign-style rally at Fort Bragg  —  Army policy prohibits partisan displays, and most service members refrained from cheering.  —  FORT BRAGG, N.C. — President Donald Trump's rally on Fr…",
    "link": "https://www.memeorandum.com/260214/p31",
    "timestamp": "2026-02-14T16:50:01Z"
  },
  {
    "title": "NATO boss reveals conversation with dog",
    "description": "NATO Secretary-General Mark Rutte has said he had a conversation with a dog in Kiev, as he sought to rally support for Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632529-nato-boss-dog-talk/",
    "timestamp": "2026-02-14T16:49:50Z"
  },
  {
    "title": "Fragmenting Latino vote now a wildcard in elections (Russell Contreras/Axios)",
    "description": "Russell Contreras / Axios:\nFragmenting Latino vote now a wildcard in elections  —  Latino voters aren't realigning — they're fragmenting.  — Consultants and pollsters tell Axios that after moving toward Donald Trump in 2024, the nation's fastest-growing elect…",
    "link": "https://www.memeorandum.com/260214/p28",
    "timestamp": "2026-02-14T16:45:01Z"
  },
  {
    "title": "Trump erupts over ‘waste of time’ dinner with ‘jerk’ Bill Maher in unhinged tirade",
    "description": "President Donald Trump launched into a near 500-word spiel Saturday to voice his regret over having hosted comedian Bill Maher at the White House, calling the television host a “jerk” who displayed “zero confidence” during their recent time together.Writing o…",
    "link": "https://www.rawstory.com/trump-2675269808/",
    "timestamp": "2026-02-14T16:38:12Z"
  },
  {
    "title": "Pelosi Warns of Trump ‘Surveillance’ Ahead of Midterms: ‘It’s Not Right’",
    "description": "Nancy Pelosi warned MS NOW about \"surveillance by the intelligence operation\" ahead of the midterms, telling Democrats to not \"put anything past\" Trump.\nThe post Pelosi Warns of Trump ‘Surveillance’ Ahead of Midterms: ‘It’s Not Right’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/pelosi-warns-of-trump-surveillance-ahead-of-midterms-its-not-right/",
    "timestamp": "2026-02-14T16:35:10Z"
  },
  {
    "title": "Starmer sends UK strike group to Arctic, cites rising Russia threat as Trump pushes Greenland deal",
    "description": "U.K. to deploy aircraft carrier strike group to Arctic regions amid Russian threat concerns, Prime Minister Keir Starmer announces at Munich Security Conference.",
    "link": "https://www.foxnews.com/world/starmer-sends-uk-strike-group-artic-cites-rising-russia-threat-trump-pushes-greenland-deal",
    "timestamp": "2026-02-14T16:33:53Z"
  },
  {
    "title": "Trump Erased the Endangerment Finding. Here Come the Lawsuits. - The New York Times",
    "description": "Trump Erased the Endangerment Finding. Here Come the Lawsuits.The New York Times Opinion | Trump’s Climate Liberation ActThe Wall Street Journal EPA boss offers forceful defense for scrapping landmark Obama climate policyPolitico How dangerous is Donald Trump…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180792528",
    "timestamp": "2026-02-14T16:32:46Z"
  },
  {
    "title": "James Carville Crowns Kristi Noem ‘Dumbest S**t Female’ in Trump Administration in Blistering Rant",
    "description": "James Carville held nothing back in a blistering rant targeting members of Trump's administration, including Homeland Security Secretary Kristi Noem.\nThe post James Carville Crowns Kristi Noem ‘Dumbest S**t Female’ in Trump Administration in Blistering Rant f…",
    "link": "https://www.mediaite.com/media/podcasts/james-carville-crowns-kristi-noem-dumbest-st-female-in-trump-administration-in-blistering-rant/",
    "timestamp": "2026-02-14T16:29:05Z"
  },
  {
    "title": "The Rise of Stephen Miller",
    "description": "Panelists joined to discuss the senior Trump aide—and how he’s become the enforcer of some of the president’s most controversial policies.",
    "link": "https://www.theatlantic.com/national/2026/02/stephen-miller-washington-week/686011/",
    "timestamp": "2026-02-14T16:18:50Z"
  },
  {
    "title": "Silence of the Lambs Team on Criticism From Trans, LGBTQ Viewers",
    "description": "As the hit movie turns 35, Ted Levine opens up to The Hollywood Reporter about complicated feelings over playing Buffalo Bill and the representation of gender: \"It's unfortunate that the film vilified that, and it's f***ing wrong.\"",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/silence-of-the-lambs-35-anniversary-interviews-1236504956/",
    "timestamp": "2026-02-14T16:15:25Z"
  },
  {
    "title": "IN RETREAT: LGBTQ Mafia Loses More Than Half Its Fortune 500 Partners",
    "description": "Transgender orthodoxy is in retreat in medicine, the courts, and even business—as the LGBTQ mafia bleeds allies in corporate America. The Human Rights Campaign has... Read More\nThe post IN RETREAT: LGBTQ Mafia Loses More Than Half Its Fortune 500 Partners app…",
    "link": "https://www.dailysignal.com/2026/02/14/retreat-lgbtq-mafia-human-rights-campaign-hrc-loses-more-than-half-fortune-500-partners/",
    "timestamp": "2026-02-14T16:00:00Z"
  },
  {
    "title": "200,000 join Iran demonstration in Munich",
    "description": "About 200,000 people joined a demonstration against the Iranian government in Munich on Saturday, police said, as world leaders gathered nearby for a security conference.",
    "link": "https://www.thelocal.de/20260214/200000-join-iran-demonstration-in-munich",
    "timestamp": "2026-02-14T15:55:55Z"
  },
  {
    "title": "Maher: Environmentalists 'Exaggerated', Made Doomsday Predictions That Didn't Happen, But Trump Deregulation Is Wrong",
    "description": "On Friday’s broadcast of HBO’s “Real Time,” host Bill Maher criticized President Donald Trump’s administration for its rollback on environmental regulations but did say that environmentalists have “exaggerated” at times and didn’t help their cause “sometimes,…",
    "link": "https://www.breitbart.com/clips/2026/02/14/maher-environmentalists-exaggerated-made-doomsday-predictions-that-didnt-happen-but-trump-deregulation-is-wrong/",
    "timestamp": "2026-02-14T15:55:53Z"
  },
  {
    "title": "White House Celebrates Valentine's Day with Cards Featuring Nicolás Maduro, Greenland",
    "description": "Move aside, Melania -- Donald Trump's White House is celebrating Valentine's Day with some cheeky cards that applaud the administration's accomplishments ... while mocking the left. Check out the V-Day cards the White House posted to ring in the…",
    "link": "https://www.tmz.com/2026/02/14/white-house-valentines-day-cards-maduro-trump-greenland/",
    "timestamp": "2026-02-14T15:55:42Z"
  },
  {
    "title": "Trump reveals US helicopter pilots were wounded in Maduro raid - Military Times",
    "description": "Trump reveals US helicopter pilots were wounded in Maduro raidMilitary Times Trump tells soldiers to vote GOP in campaign-style rally at Fort BraggThe Washington Post Over hot plates and politics, diners divided on Trump's Fort Bragg visitABC11 Raleigh-Durham…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180792420",
    "timestamp": "2026-02-14T15:53:14Z"
  },
  {
    "title": "Rosie Perez BLASTS Kamala Harris … Explains Why Latinos Chose Trump!",
    "description": "Actress Rosie Perez is making headlines after candid comments about the last presidential election and why she believes so many Latino voters shifted. During a recent podcast appearance, Rosie said she struggled to get a clear sense of what Kamala Harris stoo…",
    "link": "https://mediatakeout.com/rosie-perez-blasts-kamala-harris-explains-why-latinos-chose-trump/",
    "timestamp": "2026-02-14T15:52:20Z"
  },
  {
    "title": "From Greenland to Milan: Denmark to play USA in men's hockey at 2026 Olympics",
    "description": "Danish players say it's just another game, but the simmering political undertones will not be far below the surface at the Milan-Cortina Games.",
    "link": "https://nationalpost.com/sports/olympics/from-greenland-to-milan-denmark-to-play-usa-in-mens-hockey-at-2026-olympics",
    "timestamp": "2026-02-14T15:51:14Z"
  },
  {
    "title": "How China built a chip industry, and why it's still not enough",
    "description": "China's artificial intelligence sector is booming with investment and startups. However, a severe shortage of advanced semiconductors is a major hurdle. US export controls prevent access to crucial chipmaking tools.",
    "link": "https://economictimes.indiatimes.com/tech/technology/how-china-built-a-chip-industry-and-why-its-still-not-enough/articleshow/128352817.cms",
    "timestamp": "2026-02-14T15:48:49Z"
  },
  {
    "title": "Marco Rubio UNLOADS on Useless United Nations in Germany — “Has No Answers” to World’s Biggest Crises",
    "description": "At the 2026 Munich Security Conference in Germany, Secretary of State Marco Rubio delivered a thunderous rebuke of the failed globalist order — calling out international institutions like the United Nations for their stunning impotence in the face of war, ter…",
    "link": "https://www.thegatewaypundit.com/2026/02/marco-rubio-unloads-useless-united-nations-germany-has/",
    "timestamp": "2026-02-14T15:45:20Z"
  },
  {
    "title": "Trump Holds Melania’s Hand During Careful Air Force One Descent Amid Health Concerns",
    "description": "President Donald Trump carefully descended Air Force One holding Melania’s hand during a Palm Beach visit amidst ongoing health scrutiny.",
    "link": "https://www.inquisitr.com/trump-holds-melanias-hand-during-careful-air-force-one-descent-amid-health-concerns",
    "timestamp": "2026-02-14T15:44:54Z"
  },
  {
    "title": "Vladimir Putin’s finally starting to sweat — so it’s time for Trump to turn up the heat",
    "description": "With Vladimir Putin's war machine sputtering, it's time to push the Kremlin even harder to force an end to his war on Ukraine.",
    "link": "https://nypost.com/2026/02/14/opinion/putins-finally-starting-to-sweat-time-for-trump-to-turn-up-the-heat/",
    "timestamp": "2026-02-14T15:42:00Z"
  },
  {
    "title": "Marco Rubio seeks to heal divides with Europe as he rejects 'end of the transatlantic era'",
    "description": "Secretary of State Marco Rubio sought to paper over cracks in the relationship between the U.S. and Europe in a speech at the Munich Security Conference, though foreign diplomats were less convinced that real change would follow",
    "link": "https://www.nbcnews.com/world/europe/marco-rubio-seeks-heal-divides-europe-rejects-end-transatlantic-era-rcna259066",
    "timestamp": "2026-02-14T15:38:39Z"
  },
  {
    "title": "Zelenskyy says Ukraine, not Russia, is facing pressure to make concessions to end war",
    "description": "Ukrainian President Volodymyr Zelenskyy has accused the U.S. of focusing on Ukrainian concessions to bring an end to the war, rather than pressing Russia.",
    "link": "https://www.nbcnews.com/world/ukraine/zelenskyy-ukraine-not-russia-pressure-concessions-rcna259055",
    "timestamp": "2026-02-14T15:33:44Z"
  },
  {
    "title": "Rubio backs Trump policy while telling trans-Atlantic allies ‘our home may be in the Western hemisphere, but we will always be a child of Europe’",
    "description": "Rubio said the United States would remain forever tied to the continent even as it pushes for changes in the relationship and the institutions that have been the bulwark of the post-World War II world order.",
    "link": "https://fortune.com/2026/02/14/marco-rubio-trump-policy-trans-atlantic-allies-munich-security-conference/",
    "timestamp": "2026-02-14T15:33:33Z"
  },
  {
    "title": "Viral ‘bush people’ costumes from Bad Bunny’s Super Bowl halftime show go up for sale",
    "description": "The viral grass costumes were part of Bad Bunny’s Super Bowl halftime show, which drew 128.2 million viewers",
    "link": "https://www.the-independent.com/arts-entertainment/music/bad-bunny-super-bowl-halftime-show-costumes-for-sale-b2920467.html",
    "timestamp": "2026-02-14T15:26:49Z"
  },
  {
    "title": "Melania Trump’s Valentine’s Day message to troops takes unexpected patriotic turn at Fort Bragg ceremony—here’s what she said",
    "description": "First Lady Melania Trump visited troops in North Carolina. She spoke about Valentine's Day and love letters. She connected them to patriotism and family devotion. President Donald Trump also spoke. He praised the soldiers for a recent operation. He then urged…",
    "link": "https://economictimes.indiatimes.com/news/international/us/melania-trumps-valentines-day-message-to-troops-takes-unexpected-patriotic-turn-at-fort-bragg-ceremonyheres-what-she-said/articleshow/128351372.cms",
    "timestamp": "2026-02-14T15:24:09Z"
  },
  {
    "title": "Meloni Says Italy Will Join Trump's Board of Peace as Observer - Reports",
    "description": "MOSCOW (Sputnik) - Italy has received an invitation to join the US-led Board of Peace as an observer and plans to accept, Italian Prime Minister Giorgia Meloni said on Saturday.",
    "link": "https://sputnikglobe.com/20260214/meloni-says-italy-will-join-trumps-board-of-peace-as-observer---reports-1123634387.html",
    "timestamp": "2026-02-14T15:23:19Z"
  },
  {
    "title": "Energy market complex; India is wedded to strategic autonomy: Jaishankar",
    "description": "Speaking at the Munich Security Conference, Jaishankar said India's independent decision-making remains central to its approach",
    "link": "https://www.business-standard.com/world-news/india-wedded-strategic-autonomy-jaishankar-russian-oil-imports-126021401360_1.html",
    "timestamp": "2026-02-14T15:15:05Z"
  },
  {
    "title": "For New Yorkers, Stonewall’s new Pride flag is only step one",
    "description": "As local leaders raised a new Pride flag\r\n at Stonewall Thursday afternoon, Kiki Ball-Change watched through sunglasses, bundled up in a matching fur coat. Replacing it was one piece of the puzzle, she said. More important was that hundreds of people rallied …",
    "link": "https://www.advocate.com/politics/stonewall-pride-flag-activism-trump",
    "timestamp": "2026-02-14T15:05:36Z"
  },
  {
    "title": "‘That’s Wild!’ CNN’s Abby Phillip Stunned By Trump Fury At Allies Calling Out Racist Video",
    "description": "Abby Phillip was stunned to learn that Trump is so enraged at allies who called out his racist video post that he's putting them on his \"enemies list.\"\nThe post ‘That’s Wild!’ CNN’s Abby Phillip Stunned By Trump Fury At Allies Calling Out Racist Video first a…",
    "link": "https://www.mediaite.com/media/news/thats-wild-cnns-abby-phillip-stunned-by-trump-fury-at-allies-calling-out-racist-video/",
    "timestamp": "2026-02-14T15:05:07Z"
  },
  {
    "title": "Nonprofit Launches to Implement Trump’s Election Integrity Executive Order",
    "description": "A new Trump-aligned nonprofit is launching to fill a gap in enforcement of the president’s election integrity executive order. Nicole Kelly, senior counsel at Lex... Read More\nThe post Nonprofit Launches to Implement Trump’s Election Integrity Executive Order…",
    "link": "https://www.dailysignal.com/2026/02/14/nonprofit-launches-to-implement-trumps-election-integrity-executive-order/",
    "timestamp": "2026-02-14T15:00:00Z"
  },
  {
    "title": "About 200,000 join Iran demonstration in Munich: police",
    "description": "Around 200,000 people demonstrated against the Iranian government in Munich on Saturday, denouncing the leadership following deadly repression of nationwide protests. Exiled son of the former shah, Reza Pahlavi, spoke at a nearby security conference, calling …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/about-200000-join-iran-demonstration-in-munich-police/articleshow/128351764.cms",
    "timestamp": "2026-02-14T14:59:46Z"
  },
  {
    "title": "Teen Female Wrestler Expresses 'Relief' Education Department Investigating Alleged Sexual Assault by Transgender Opponent",
    "description": "The teenage female wrestler who was allegedly sexually assaulted by a transgender opponent is taking a stand for other young women in sports.\nThe post Teen Female Wrestler Expresses ‘Relief’ Education Department Investigating Alleged Sexual Assault by Transge…",
    "link": "https://www.breitbart.com/education/2026/02/14/teen-female-wrestler-expresses-relief-education-department-investigating-alleged-sexual-assault-by-transgender-opponent/",
    "timestamp": "2026-02-14T14:53:12Z"
  },
  {
    "title": "Trump staff supplied applause during 'overtly political' speech to silent service members",
    "description": "Donald Trump's appearance at Ft. Bragg military base in North Carolina on Friday was met with a muted response from attending service members that put local GOP officials and the president’s staff in the position of of having to show enthusiasm for his remark…",
    "link": "https://www.rawstory.com/trump-military-speech-2675269626/",
    "timestamp": "2026-02-14T14:52:10Z"
  },
  {
    "title": "WATCH: Romantic Valentine’s Day lights in Michigan",
    "description": "Dearborn Peace Park West is decorated with Valentine’s Day-themed lights and displays.",
    "link": "https://abcnews.com/video/130168207/",
    "timestamp": "2026-02-14T14:50:19Z"
  },
  {
    "title": "'This action is lawless': States sue Trump admin to preempt public health funding cuts, quickly win restraining order - NewsBreak",
    "description": "\"Defendants are using funding to execute a policy objective unrelated to the public-health grants,\" the judge in the case opined. \"This is likely unlawful.",
    "link": "https://www.newsbreak.com/share/4491996013361-this-action-is-lawless-states-sue-trump-admin-to-preempt-public-health-funding-cuts-quickly-win-restraining-order?s=a2&amp;share_destination_id=MjE5Mjk2NjYzLTE3NzEwODAxMTM4OTI%3D&amp;pd=0Eq94xb7&amp;hl=en_US&amp;send_time=1771080113&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.5.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-14T14:43:11Z"
  },
  {
    "title": "Bill Maher Compares Taylor Swift’s Exes To Travis Kelce In Blunt ‘Real Time’ Monologue",
    "description": "From “tortured poets” to tight ends, Maher traces Swift’s love life.",
    "link": "https://decider.com/2026/02/14/bill-maher-taylor-swift-travis-kelce-real-time-monologue/",
    "timestamp": "2026-02-14T14:40:56Z"
  },
  {
    "title": "Deadly drone strikes cloud US-brokered Russia-Ukraine talks in Geneva",
    "description": "Ukrainian President Volodymyr Zelenskyy and US Secretary of State Marco Rubio hint at difficulties in next week's talks.",
    "link": "https://www.aljazeera.com/news/2026/2/14/deadly-drone-strikes-cloud-us-brokered-russia-ukraine-talks-in-geneva",
    "timestamp": "2026-02-14T14:35:32Z"
  },
  {
    "title": "The shocking, rule-breaking new move in pro wrestling: getting specific about politics | CNN Business",
    "description": "The viral-video chants of “F**k ICE” from the crowd at an All Elite Wrestling bout earlier this month were the latest, loudest sign of a shift within pro wrestling.",
    "link": "https://www.cnn.com/2026/02/14/business/pro-wrestling-politics-cec",
    "timestamp": "2026-02-14T14:35:06Z"
  },
  {
    "title": "States ready to seize Supreme Court redistricting decision amid countdown to midterm elections",
    "description": "Louisiana Attorney General Liz Murrill arrived at the Supreme Court shortly before 10 a.m. on January 9 and took a seat in the spectator section of the...",
    "link": "https://www.cnn.com/2026/02/14/politics/supreme-court-voting-rights-louisiana",
    "timestamp": "2026-02-14T14:30:47Z"
  },
  {
    "title": "Bannon courted Epstein in his efforts to 'take down' Pope Francis...",
    "description": "Steve Bannon, a longtime adviser to US President Donald Trump, discussed opposition strategies with convicted sex offender Jeffrey Epstein against Pope Francis, with Bannon saying he hoped to “take down” the pontiff, according to newly released files from the…",
    "link": "https://www.cnn.com/2026/02/14/world/bannon-epstein-take-down-pope-francis-latam-intl",
    "timestamp": "2026-02-14T14:19:36Z"
  },
  {
    "title": "Tax refunds jump 22% so far, claims Scott Bessent – what should filers look for this season?",
    "description": "The average tax refund has increased by 22% this season, according to Treasury Secretary Scott Bessent. The IRS has not released official data yet, and early figures can be misleading, says expert.",
    "link": "https://www.livemint.com/money/personal-finance/tax-refunds-jump-22-so-far-claims-scott-bessent-what-should-filers-look-for-this-season-11771073834655.html",
    "timestamp": "2026-02-14T14:16:47Z"
  },
  {
    "title": "Steve Bannon courted Epstein in his efforts to 'take down' Pope Francis (Christopher Lamb/CNN)",
    "description": "Christopher Lamb / CNN:\nSteve Bannon courted Epstein in his efforts to ‘take down’ Pope Francis  —  Steve Bannon, a former White House adviser to US President Donald Trump, discussed opposition strategies with convicted sex offender Jeffrey Epstein against Po…",
    "link": "https://www.memeorandum.com/260214/p13",
    "timestamp": "2026-02-14T14:15:02Z"
  },
  {
    "title": "EU leaders welcome US tone shift in Rubio's Munich speech",
    "description": "European leaders have cautiously welcomed a softer tone from the US at the Munich Security Conference, but American independence remained top of mind for Secretary of State Marco Rubio.",
    "link": "https://www.dw.com/en/european-leaders-von-der-leyen-starmer-wadephul-welcome-rubio-speech-in-munich/a-75970369",
    "timestamp": "2026-02-14T14:10:00Z"
  }
]