[
  {
    "title": "‘The choice isn’t between domestic and foreign talent; the nation was built on both’",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-science-pharmacies-europe-netanyahu",
    "timestamp": "2025-12-01T18:23:27Z"
  },
  {
    "title": "Zelenskiy says US peace plan ‘looks better’ with revisions but work continues",
    "description": "Putin to meet US special envoy Steve Witkoff on Tuesday",
    "link": "https://www.irishtimes.com/world/europe/2025/12/01/zelenskiy-says-us-peace-plan-looks-better-with-revisions-but-work-continues/",
    "timestamp": "2025-12-01T18:22:50Z"
  },
  {
    "title": "TSA Breaks Screening Record over Thanksgiving Weekend",
    "description": "The Transportation Security Administration (TSA) broke a record in screening the highest number of individuals ever on Sunday, November 30, the federal agency revealed on Monday. “BREAKING NEWS: Yesterday, TSA screened about 3,133,924 individuals, the highest…",
    "link": "https://www.breitbart.com/politics/2025/12/01/tsa-breaks-screening-record-over-thanksgiving-weekend-highest-number-ever-in-tsas-history/",
    "timestamp": "2025-12-01T18:22:28Z"
  },
  {
    "title": "Land and security are the main sticking points as Russia and Ukraine mull Trump's peace proposal",
    "description": "Diplomats are working to end the Russia-Ukraine war. The US is leading new peace talks. Ukrainian and Russian officials are meeting with US representatives. Key issues like land cession and Ukraine's security remain unresolved. President Putin demands Ukraini…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/land-and-security-are-the-main-sticking-points-as-russia-and-ukraine-mull-trumps-peace-proposal/articleshow/125701263.cms",
    "timestamp": "2025-12-01T18:20:54Z"
  },
  {
    "title": "As regime change looms at the Fed, one candidate emerges as frontrunner for chair",
    "description": "President Donald Trump knows who he's going to select as the next Federal Reserve chair but isn't saying yet.",
    "link": "https://www.cnbc.com/2025/12/01/as-regime-change-looms-at-the-fed-one-candidate-emerges-as-frontrunner-for-chair.html",
    "timestamp": "2025-12-01T18:18:01Z"
  },
  {
    "title": "Trump Says He Has No Idea What The MRI Was For",
    "description": "Donald Trump, in a nasty fashion, told reporters on Air Force One over the weekend that he would release his MRI results, but had no idea what part of the body the test was done on, except that he aced the cognitive test.\nGov. Walz certainly got under Trump's…",
    "link": "https://crooksandliars.com/2025/12/trump-no-idea-MRI",
    "timestamp": "2025-12-01T18:15:42Z"
  },
  {
    "title": "Trump Warns Israel Not to ‘Interfere’ in ‘Syria’s Evolution’ After Military Clash",
    "description": "\"It is very important that Israel maintain a strong and true dialogue with Syria, and that nothing takes place that will interfere with Syria’s evolution\"\nThe post Trump Warns Israel Not to ‘Interfere’ in ‘Syria’s Evolution’ After Military Clash first appeare…",
    "link": "https://www.mediaite.com/media/news/trump-warns-israel-not-to-interfere-in-syrias-evolution-after-military-clash/",
    "timestamp": "2025-12-01T18:15:40Z"
  },
  {
    "title": "'Kids Know Better': Walz Hits Trump For Slur Tossed During Unhinged Thanksgiving Rant",
    "description": "Gov. Tim Walz whacked Trump for normalizing the sort of behavior we saw from him during his unhinged rant on Thanksgiving, where the narcissist did his best to ruin the holiday for everyone and called Walz \"retarded.\"\nMeet the Press host Kristen Welker asked …",
    "link": "https://crooksandliars.com/2025/11/kids-know-better-walz-hits-trump-slur",
    "timestamp": "2025-12-01T18:15:35Z"
  },
  {
    "title": "Honduras: Results Unclear in Razor-Thin Presidential Race -- But Ruling Socialists Out",
    "description": "Preliminary results from Honduran authorities indicate that conservative candidate Nasry Asfura is narrowly leading the presidential election.\nThe post Honduras: Results Unclear in Razor-Thin Presidential Race — But Ruling Socialists Out appeared first on Bre…",
    "link": "https://www.breitbart.com/national-security/2025/12/01/honduras-results-unclear-razor-thin-presidential-race-ruling-socialists-out/",
    "timestamp": "2025-12-01T18:09:17Z"
  },
  {
    "title": "Trump says Israel must seek ‘strong and true dialogue’ with Syria",
    "description": "Donald Trump warns against actions that could 'interfere with Syria’s evolution' amid new Israeli incursion, strikes.",
    "link": "https://www.aljazeera.com/news/2025/12/1/trump-says-israel-must-seek-strong-and-true-dialogue-with-syria",
    "timestamp": "2025-12-01T18:09:08Z"
  },
  {
    "title": "‘Why Would We Pardon This Guy?’ GOP Senator Trashes Trump’s Pardon of Former Honduran President",
    "description": "A GOP senator questioned why Donald Trump pardoned former Honduran president Juan Orlando Hernandez, who was serving 45 years for drug trafficking.\nThe post ‘Why Would We Pardon This Guy?’ GOP Senator Trashes Trump’s Pardon of Former Honduran President first …",
    "link": "https://www.mediaite.com/media/news/why-would-we-pardon-this-guy-gop-senator-trashes-trumps-pardon-of-former-honduran-president/",
    "timestamp": "2025-12-01T18:08:48Z"
  },
  {
    "title": "Trump Pressures Republicans as Indiana Mulls Redistricting",
    "description": "The Indiana State House is set to convene this afternoon to discuss a redistricting effort to boost Republicans chances in the 2026 midterms. President Donald... Read More\nThe post Trump Pressures Republicans as Indiana Mulls Redistricting appeared first on T…",
    "link": "https://www.dailysignal.com/2025/12/01/trump-pressures-republicans-as-indiana-mulls-redistricting/",
    "timestamp": "2025-12-01T18:08:01Z"
  },
  {
    "title": "Why Trump’s 'very evident' decline is so 'devastating' for MAGA: analysis",
    "description": "During former President Joe Biden's four years in the White House, Donald Trump repeatedly attacked \"Sleepy Joe\" as being in both physical and mental decline. But now that the 79-year-old President Trump is back in the White House, he becomes furious when sim…",
    "link": "https://www.rawstory.com/alternet-posts/trump-lurie-mental-decline/",
    "timestamp": "2025-12-01T18:08:00Z"
  },
  {
    "title": "Following National Guard shooting, Trump vows to ‘denaturalize migrants’",
    "description": "Donald Trump has seized on the shooting of two National Guard members in Washington, D.C., in ways that are consistent with the president’s anti-immigrant vision. Almost immediately in the wake of Wednesday’s deadly violence, for example, the Republican said …",
    "link": "https://biztoc.com/x/8cae95684319118d",
    "timestamp": "2025-12-01T18:07:29Z"
  },
  {
    "title": "Western senators cannot support this Trump nominee who wants to liquidate public lands (Opinion)",
    "description": "Trump's BLM nominee Steve Pearce’s vision for our public lands is not conservation or even balanced management -- it’s liquidation.",
    "link": "https://www.denverpost.com/2025/12/01/steve-pearce-trump-blm-public-lands/",
    "timestamp": "2025-12-01T18:05:13Z"
  },
  {
    "title": "Is Trump’s $2,000 tariff dividend coming in December 2025? IRS stimulus updates and who may qualify",
    "description": "IRS stimulus check: Trump’s $2,000 tariff dividend: Trump’s proposed $2,000 tariff dividend is driving new questions as December 2025 begins. Many want to know what the IRS is preparing, what Congress may allow, and who might qualify if any payment moves forw…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-trumps-2000-tariff-dividend-coming-in-december-2025-irs-stimulus-updates-and-who-may-qualify/articleshow/125699513.cms",
    "timestamp": "2025-12-01T18:04:02Z"
  },
  {
    "title": "Trump says asylum suspension may be indefinite: “We don’t want these people”",
    "description": "The US president called several countries \"unfriendly\", left open the possibility of stripping citizens of their citizenship and attacked a Democratic Muslim congresswoman\nThe post Trump says asylum suspension may be indefinite: “We don’t want these people” a…",
    "link": "https://en.protothema.gr/2025/12/01/trump-says-asylum-suspension-may-be-indefinite-we-dont-want-these-people/",
    "timestamp": "2025-12-01T18:03:23Z"
  },
  {
    "title": "Ex-Secretary of Defense Declares There’s No Question a ‘War Crime’ Was Committed if Hegseth Attacked Drug Boat Survivors",
    "description": "Former Defense Secretary Leon Panetta said there is no doubt Pete Hegseth committed a \"war crime,\" if a recent WaPo story on a second drug boat strike is true\nThe post Ex-Secretary of Defense Declares There’s No Question a ‘War Crime’ Was Committed if Hegseth…",
    "link": "https://www.mediaite.com/politics/ex-secretary-of-defense-declares-theres-no-question-a-war-crime-was-committed-if-hegseth-attacked-drug-boat-survivors/",
    "timestamp": "2025-12-01T18:02:08Z"
  },
  {
    "title": "State panel recommends 3 casino gambling projects in Bronx, Queens",
    "description": "An artist rendering of the proposed Metropolitan Park in Queens.\n \n\nThe board is advancing the Bally’s Bronx, Hard Rock Metropolitan Park and Resorts World New York City proposals. [ more › ]",
    "link": "https://gothamist.com/news/state-panel-recommends-3-casino-gambling-projects-in-bronx-queens",
    "timestamp": "2025-12-01T18:02:00Z"
  },
  {
    "title": "Trump’s Latest Exploitation of a Killing Will Also Fail",
    "description": "Ross Barkan writes that Trump’s effort to whip up anti-immigrant backlash after the National Guard shooting is reminiscent of the post-Charlie Kirk censorship push and will end just as futilely.",
    "link": "http://nymag.com/intelligencer/article/trumps-exploitation-of-national-guard-shooting-will-fail.html",
    "timestamp": "2025-12-01T18:01:14Z"
  },
  {
    "title": "Climate Crisis? The French are Uprooting Vines to Reduce Production",
    "description": "Remember all those times you've been told wine is facing a climate crisis?",
    "link": "https://wattsupwiththat.com/2025/12/01/climate-crisis-the-french-are-uprooting-vines-to-reduce-production/",
    "timestamp": "2025-12-01T18:00:00Z"
  },
  {
    "title": "US appeals court disqualifies Trump ally as US Attorney",
    "description": "Alina Habba has been unlawfully serving as top federal prosecutor for New Jersey",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/12/01/nyregion/alina-habba-unlawful.html",
    "timestamp": "2025-12-01T17:59:24Z"
  },
  {
    "title": "To the Socialists of All Parties",
    "description": "Friedrich Hayek's most popular work was dedicated to \"the socialists of all parties.\" That phrase perfectly captures politics in 2025.",
    "link": "https://reason.com/2025/12/01/to-the-socialists-of-all-parties/",
    "timestamp": "2025-12-01T17:57:00Z"
  },
  {
    "title": "As Trump envoy heads to Moscow, Russian Nobel winner says prisoners' lives are at stake",
    "description": "LONDON, Dec 1 (Reuters) - As a U.S. envoy heads to Moscow to negotiate over a complex blueprint for peace in Ukraine, Russian Nobel Peace Prize winner Dmitry Muratov says a vital element is missing from the agenda. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/02/as-trump-envoy-heads-to-moscow-russian-nobel-winner-says-prisoners039-lives-are-at-stake",
    "timestamp": "2025-12-01T17:56:00Z"
  },
  {
    "title": "Trump Claims $300M White House Ballroom Only Uses Private Donations, Funding as Construction Nears Completion",
    "description": "US President Donald Trump announced that the White House ballroom is almost done. And he claimed not using any money from taxpayers.",
    "link": "https://www.ibtimes.com/trump-claims-300m-white-house-ballroom-only-uses-private-donations-funding-construction-nears-3791722",
    "timestamp": "2025-12-01T17:55:27Z"
  },
  {
    "title": "See photos of Melania Trump’s White House Christmas decorations, including a LEGO Trump",
    "description": "In a change this year after the East Wing was torn down, the official White House Christmas tree in the Blue Room also honors Gold Star families that lost a member during active-duty military service.",
    "link": "https://www.pbs.org/newshour/politics/see-photos-of-melania-trumps-white-house-christmas-decorations-including-a-lego-trump",
    "timestamp": "2025-12-01T17:53:21Z"
  },
  {
    "title": "Kumbaya, Nose-In-The-Air Europeans Mulling Over Same Move As Trump",
    "description": "French lawmakers are considering whether to exclude foreigners from publicly funded health care, a policy similar to one championed by President Donald Trump.",
    "link": "https://dailycaller.com/2025/12/01/france-free-healthcare-long-term-visas-non-eu-foreigners-francois-gernigon/",
    "timestamp": "2025-12-01T17:53:03Z"
  },
  {
    "title": "Scott Jennings Excoriates ‘Total Clown’ Gavin Newsom’s Presidential Prospects",
    "description": "Scott Jennings said he was completely unconcerned about Democratic California Gov. Gavin Newsom's presidential viability.",
    "link": "https://dailycaller.com/2025/12/01/scott-jennings-excoriates-clown-gavin-newsoms-presidential-prospects/",
    "timestamp": "2025-12-01T17:52:39Z"
  },
  {
    "title": "Gas Prices Fall To Lowest In Four Years",
    "description": "Americans are finally seeing relief at the gas pump. Gasoline prices across the U.S. fell to the lowest national average since May of 2021, according to the American Automobile Association. The driver’s club says that on Monday, the national average\nThe post …",
    "link": "https://www.breitbart.com/economy/2025/12/01/gas-prices-fall-to-lowest-in-four-years/",
    "timestamp": "2025-12-01T17:51:55Z"
  },
  {
    "title": "Russia should shed the Soviet lens on India, and embrace its growth story",
    "description": "India and Russia's strategic partnership requires an economic reset.  Bilateral trade has surged due to oil imports, creating a significant deficit for India.  Russia needs to diversify its economic ties beyond China.  India can offer alternatives in sectors …",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/russia-should-shed-the-soviet-lens-on-india-and-embrace-its-growth-story/articleshow/125700384.cms",
    "timestamp": "2025-12-01T17:51:10Z"
  },
  {
    "title": "ICE Barbie Makes U-Turn After Caving to Staff Who Trashed Her Leadership",
    "description": "The Federal Emergency Management Agency has reversed course after reportedly caving to pressure from its own staff, ordering them back to work after they...",
    "link": "https://www.thedailybeast.com/ice-barbie-quietly-caves-in-standoff-with-staff-who-trashed-her-leadership/",
    "timestamp": "2025-12-01T17:46:12Z"
  },
  {
    "title": "FBI Still Reeks Of Trump Derangement Syndrome Months Into Second Admin, Report Finds",
    "description": "Nearly a year into President Donald Trump’s second term, deep resistance to his agenda persists inside the FBI, according to an explosive new report.",
    "link": "https://dailycaller.com/2025/12/01/fbi-tds-report-kash-patel-ice/",
    "timestamp": "2025-12-01T17:45:40Z"
  },
  {
    "title": "Trump, Netanyahu discuss Gaza in phone call",
    "description": "United States President Donald Trump spoke with Israeli Prime Minister Benjamin Netanyahu on the phone on Monday to discuss the situation in Gaza, the prime minister's office announced.The two leaders...",
    "link": "https://biztoc.com/x/ac2312899b26efd7",
    "timestamp": "2025-12-01T17:45:22Z"
  },
  {
    "title": "AI becomes a political wedge issue, creating odd bedfellows across parties",
    "description": "Artificial intelligence is increasingly emerging as a key wedge issue — not between the major political parties, but within them.",
    "link": "https://www.nbcnews.com/politics/elections/ai-wedge-issue-midterms-2028-bedfellows-rcna244811",
    "timestamp": "2025-12-01T17:43:32Z"
  },
  {
    "title": "Trump warns Israel not to 'interfere' in Syria",
    "description": "U.S. President Donald Trump warned Israel on Dec. 1 against destabilizing Syria and its new leadership, days after a deadly operation by Israeli forces in the south of the country.",
    "link": "https://www.hurriyetdailynews.com/trump-warns-israel-not-to-interfere-in-syria-216349",
    "timestamp": "2025-12-01T17:43:04Z"
  },
  {
    "title": "Ghosted on Capitol Hill: Rogue anti-Trump judges now refuse to testify before U.S. Senate",
    "description": "'I can promise you that the last thing in the world they would want to do ... is answering questions under oath from United States senators'",
    "link": "https://www.wnd.com/2025/12/ghosted-capitol-hill-rogue-anti-trump-judges-now/",
    "timestamp": "2025-12-01T17:38:00Z"
  },
  {
    "title": "‘There Is No Greater Genius’: Josh Brolin Praises Donald Trump",
    "description": "Hollywood actor Josh Brolin praised President Donald Trump's marketing instincts in a Saturday interview with The Independent.",
    "link": "https://dailycaller.com/2025/12/01/josh-brolin-donald-trump-marketing-skills-praise-actor/",
    "timestamp": "2025-12-01T17:36:35Z"
  },
  {
    "title": "Minnesota judge under fire for tossing $7.2M taxpayer-fraud conviction tied to alleged ‘lavish lifestyle’",
    "description": "Minnesota judge Sarah West sparks controversy after overturning jury's guilty verdict in $7.2 million Medicaid fraud case, citing insufficient evidence.",
    "link": "https://www.foxnews.com/us/minnesota-judge-under-fire-tossing-7-2m-taxpayer-fraud-conviction-tied-alleged-lavish-lifestyle",
    "timestamp": "2025-12-01T17:36:30Z"
  },
  {
    "title": "US accused of killing Venezuelan drug boat survivors – Trump’s military agenda is based on impunity",
    "description": "The Trump administration’s military strategy in Latin America breaches long-established legal rules and norms in three key ways.",
    "link": "https://theconversation.com/us-accused-of-killing-venezuelan-drug-boat-survivors-trumps-military-agenda-is-based-on-impunity-270891",
    "timestamp": "2025-12-01T17:36:20Z"
  },
  {
    "title": "The Defense Department is investigating Kelly over the ‘illegal orders’ video. Experts doubt they can actually prosecute him",
    "description": "President Donald Trump has accused Kelly and the five other Democratic lawmakers in the video of sedition \"punishable by DEATH.\"",
    "link": "https://biztoc.com/x/bfb1dc86465762c1",
    "timestamp": "2025-12-01T17:34:22Z"
  },
  {
    "title": "Trump's 'Ugly Immigrant' Picture: The 50 shades of Brown and Black",
    "description": "An Afghan immigrant's violent act near the White House intensifies anti-immigration sentiment in the US. This incident is being used by hardliners to push for stricter policies. Donald Trump has vowed to halt migration from certain countries and deport foreig…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/trumps-ugly-immigrant-picture-the-50-shades-of-brown-and-black/articleshow/125700028.cms",
    "timestamp": "2025-12-01T17:33:52Z"
  },
  {
    "title": "Trump commutes prison sentence for this former executive convicted of Ponzi-like scheme",
    "description": "President Donald Trump has commuted the prison sentence of former investment manager David Gentile, who was convicted of defrauding investors — the latest in a series of clemency actions Trump has taken in white-collar criminal cases.Gentile had reported to p…",
    "link": "https://biztoc.com/x/7a154c5152ffd852",
    "timestamp": "2025-12-01T17:33:38Z"
  },
  {
    "title": "White House Christmas Decorations, Theme Unveiled for 2025: Lego Portrait of Donald Trump & More Seen",
    "description": "The White House Christmas decoration photos have been put into place. The State Dining Room was put on display on Monday (December 1) to see what had been put up in Washington, DC. The theme of the decor this year is “Home Is Where The Heart Is,” meant to cap…",
    "link": "https://www.justjared.com/2025/12/01/white-house-christmas-decorations-theme-unveiled-for-2025-lego-portrait-of-donald-trump-more-seen/",
    "timestamp": "2025-12-01T17:32:51Z"
  },
  {
    "title": "White House Christmas Decorations, Theme Unveiled for 2025: Lego Portraits of Donald Trump & More Seen",
    "description": "The White House Christmas decoration photos have been put into place. The State Dining Room was put on display on Monday (December 1) to see what had been put up in Washington, DC. The theme of the decor this year is “Home Is Where The Heart Is,” meant to cap…",
    "link": "https://www.justjared.com/2025/12/01/white-house-christmas-decorations-theme-unveiled-for-2025-lego-portraits-of-donald-trump-more-seen/",
    "timestamp": "2025-12-01T17:32:51Z"
  },
  {
    "title": "Melania Trump reveals white house Christmas decorations with “home is where the heart is” theme",
    "description": "Melania Trump revealed the new White House Christmas decorations with a theme focused on home, kindness, and American history. The design uses bright colors, special symbols, and a new layout because of recent construction. Visitors will see many trees, light…",
    "link": "https://economictimes.indiatimes.com/news/international/us/melania-trump-reveals-white-house-christmas-decorations-with-home-is-where-the-heart-is-theme/articleshow/125699793.cms",
    "timestamp": "2025-12-01T17:32:35Z"
  },
  {
    "title": "Trump order ignored by Venezuela's leader — and he shut down airspace in response: report",
    "description": "President Donald Trump presented Venezuelan President Nicolás Maduro with an ultimatum during their recent phone call, according to sources, but he instead responded with demands of his own.The U.S. president confirmed the call had taken place but declined to…",
    "link": "https://www.rawstory.com/trump-maduro/",
    "timestamp": "2025-12-01T17:32:11Z"
  },
  {
    "title": "The Defense Department is investigating Kelly over the ‘illegal orders’ video. Experts doubt they can actually prosecute him",
    "description": "President Donald Trump has accused Kelly and the five other Democratic lawmakers in the video of sedition \"punishable by DEATH.\"",
    "link": "https://www.pbs.org/newshour/politics/the-defense-department-is-investigating-kelly-over-the-illegal-orders-video-experts-doubt-they-can-actually-prosecute-him",
    "timestamp": "2025-12-01T17:29:46Z"
  },
  {
    "title": "Republican Socialism: Trump Is Taking Federal Stakes in Private Companies",
    "description": "The Trump administration's pivot toward socialism did not come without warning.",
    "link": "https://reason.com/2025/12/02/republican-socialism/",
    "timestamp": "2025-12-01T17:29:39Z"
  },
  {
    "title": "‘Very important’ for Israel to keep dialogue with Syria, says Donald Trump",
    "description": "This is a historic opportunity, and adds to the success already attained for peace in the Middle East, Trump said.",
    "link": "https://indianexpress.com/article/world/very-important-for-israel-to-keep-dialogue-with-syria-says-donald-trump-10396620/",
    "timestamp": "2025-12-01T17:28:05Z"
  },
  {
    "title": "Trump warns Israel not to 'interfere' in Syria",
    "description": "President Donald Trump has cautioned Israel regarding its actions in Syria. He stressed the importance of dialogue between the two nations. Trump expressed satisfaction with Syria's current leadership under President Ahmed al-Sharaa. He believes good relation…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-warns-israel-not-to-interfere-in-syria/articleshow/125699833.cms",
    "timestamp": "2025-12-01T17:26:20Z"
  },
  {
    "title": "President Trump invites Prime Minister Netanyahu to the White House",
    "description": "Prime Minister Benjamin Netanyahu spoke a short while ago with US President Donald Trump.According to the Prime Minister's office, the two leaders emphasized in their conversation the importance and commitment to disarming Hamas and demilitarizing the Gaza St…",
    "link": "https://www.israelnationalnews.com/flashes/671538",
    "timestamp": "2025-12-01T17:26:00Z"
  },
  {
    "title": "Zelenskyy arrives in Paris for talks with Macron as US-led peace negotiations advance",
    "description": "Ukrainian President Volodymyr Zelenskyy met French President Emmanuel Macron in Paris. This meeting is part of efforts to broker a ceasefire in Ukraine. Earlier, Ukrainian and US officials held productive talks. French President Macron seeks fair and lasting …",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskyy-arrives-in-paris-for-talks-with-macron-as-us-led-peace-negotiations-advance/articleshow/125699798.cms",
    "timestamp": "2025-12-01T17:24:49Z"
  },
  {
    "title": "Why the Gulf Monarchs Shower Trump With Gifts",
    "description": "Franklin Foer: “Until Donald Trump, no U.S. president had ever yielded to royal temptations from abroad. But in his second term, Trump has discarded that old inhibition in its totality. Since 2022, the Trump family has been promised hundreds of millions of do…",
    "link": "https://politicalwire.com/2025/12/01/why-the-gulf-monarchs-shower-trump-with-gifts/",
    "timestamp": "2025-12-01T17:24:20Z"
  },
  {
    "title": "Trump Faces Backlash For Using A Slur In Thanksgiving Post",
    "description": "Trump Faces Backlash For Using A Slur In Thanksgiving Postlittlethings.com",
    "link": "https://littlethings.com/entertainment/donald-trump-backlash-slur-thanksgiving-post",
    "timestamp": "2025-12-01T17:24:15Z"
  },
  {
    "title": "JPMorgan and Strike CEO Jack Mallers Go Silent, Leaving 'Debanking' Questions Unanswered",
    "description": "For now, Jack Mallers decided to not comment any further and JPMorgan declined to explain why it debanked the CEO of a company very similar to newly launched JPM Coin.",
    "link": "https://www.coindesk.com/business/2025/12/01/jpmorgan-and-strike-ceo-jack-mallers-go-silent-leave-debanking-questions-unanswered",
    "timestamp": "2025-12-01T17:24:13Z"
  },
  {
    "title": "Once Again, The Trump Administration Is Caught Lying About Deportation Options For Kilmar Abrego Garcia",
    "description": "The Trump administration just lies and lies and lies. Those in charge assume they can just bluster their way past the system of checks and balances. For everything else, there’s AI generated memes depicting Trump taking a shit on the people he serves. Win-win…",
    "link": "https://www.techdirt.com/2025/12/01/once-again-the-trump-administration-is-caught-lying-about-deportation-options-for-kilmar-abrego-garcia/",
    "timestamp": "2025-12-01T17:22:42Z"
  },
  {
    "title": "US to zero out tariffs on UK pharma under trade deal",
    "description": "The United States on Monday exempted British pharmaceuticals from import tariffs under a unique deal which sees the UK increase spending on American drugs by 25 percent. The accord aims to “address long-standing imbalances in US-UK pharmaceutical trade,” endi…",
    "link": "https://www.digitaljournal.com/world/us-to-zero-out-tariffs-on-uk-pharma-under-trade-deal/article",
    "timestamp": "2025-12-01T17:22:20Z"
  },
  {
    "title": "Why Gen Z and millennial consumers feel disillusioned — and how they can drive real change",
    "description": "Political consumerism — the act of buying or boycotting products for political or ethical reasons — is on the rise among younger generations.",
    "link": "https://theconversation.com/why-gen-z-and-millennial-consumers-feel-disillusioned-and-how-they-can-drive-real-change-270137",
    "timestamp": "2025-12-01T17:22:20Z"
  },
  {
    "title": "ICC vows to stand firm amid US sanctions",
    "description": "The president of the International Criminal Court and key European members on Monday issued a defiant declaration of the tribunal’s independence in the face of US sanctions against several of its top officials. Opening an annual meeting that brought together …",
    "link": "https://www.digitaljournal.com/world/icc-vows-to-stand-firm-amid-us-sanctions/article",
    "timestamp": "2025-12-01T17:22:20Z"
  },
  {
    "title": "Gran Colombia Redux",
    "description": "The US can bomb Venezuelan military and civilian targets from the USS Gerald R. Ford but it’s difficult to imagine anyone signing off on a ground...",
    "link": "https://www.lrb.co.uk/blog/2025/december/gran-colombia-redux",
    "timestamp": "2025-12-01T17:20:42Z"
  },
  {
    "title": "‘It’s a Disaster!’ CNN Data Guru Breaks Down Historically Bad Poll for Trump",
    "description": "CNN's Harry Enten broke down a historically bad Gallup poll for President Donald Trump and its implications on Monday morning.\nThe post ‘It’s a Disaster!’ CNN Data Guru Breaks Down Historically Bad Poll for Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/its-a-disaster-cnn-data-guru-breaks-down-historically-bad-poll-for-trump/",
    "timestamp": "2025-12-01T17:20:32Z"
  },
  {
    "title": "Scott Jennings Says He’d Be Shocked If Democrats Don’t Nominate Socialist In 2028",
    "description": "Scott Jennings asserted he would be stunned if the Democratic Party did not nominate a socialist for president in 2028.",
    "link": "https://dailycaller.com/2025/12/01/scott-jennings-democrats-nominate-socialist-2028/",
    "timestamp": "2025-12-01T17:19:53Z"
  },
  {
    "title": "Bitcoin dips below $85,000 in cryptocurrency rout",
    "description": "Bitcoin declined 33% in just eight weeks.",
    "link": "https://www.bostonherald.com/2025/12/01/bitcoin-crypto/",
    "timestamp": "2025-12-01T17:19:06Z"
  },
  {
    "title": "Markwayne Mullin May Be An Idiot, But At Least He's Not Smart",
    "description": "We watch so you never have to!",
    "link": "https://www.wonkette.com/p/markwayne-mullin-may-be-an-idiot",
    "timestamp": "2025-12-01T17:18:36Z"
  },
  {
    "title": "Trump doubles down after mental health slur against Tim Walz: ‘There’s something wrong with him’ - NewsBreak",
    "description": "Donald Trump has doubled down on his criticism of Minnesota Governor Tim Walz , despite backlash for using a mental health slur. The president levied an ab",
    "link": "https://www.newsbreak.com/share/4374078820556-trump-doubles-down-after-mental-health-slur-against-tim-walz-there-s-something-wrong-with-him?_f=app_share&amp;pd=0BTCVtjv&amp;lang=en_US&amp;send_time=1764609461&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.47.0.44%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-01T17:18:17Z"
  },
  {
    "title": "Trump to meet with advisers on Venezuela as US ramps up pressure",
    "description": "WASHINGTON, Dec 1 (Reuters) - U.S. President Donald Trump plans to meet on Monday with top advisers to discuss Venezuela, among other topics, two sources familiar with the matter said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/02/trump-to-meet-with-advisers-on-venezuela-as-us-ramps-up-pressure",
    "timestamp": "2025-12-01T17:18:00Z"
  },
  {
    "title": "Republican targeted by pipe bomb threat for refusing Trump's demand",
    "description": "Indiana state Sen. Jean Leising (R) said she was the newest victim of threats after refusing a demand from President Donald Trump to redistrict the state ahead of the 2026 midterm elections.In a Sunday post on X, Leising revealed that her home \"was the target…",
    "link": "https://www.rawstory.com/indiana-trump-redistricting/",
    "timestamp": "2025-12-01T17:15:30Z"
  },
  {
    "title": "Tim Walz Admits Welfare State ‘Attracts Criminals,’ Dodges Blame For Fraud Problem",
    "description": "Democratic Minnesota Gov. Tim Walz said his state \"attracts criminals\" when asked Sunday about rampant welfare fraud linked to Somali residents.",
    "link": "https://dailycaller.com/2025/12/01/tim-walz-somali-fraud-minnesota-attracts-criminals-trump/",
    "timestamp": "2025-12-01T17:14:31Z"
  },
  {
    "title": "U.S. House Lawmakers Detail Grievances Over Government's 'Choke Point 2.0'",
    "description": "French Hill, the chairman of the House Financial Services Committee, issued a report outlining what went on at several U.S. crypto regulators in past years.",
    "link": "https://www.coindesk.com/policy/2025/12/01/u-s-house-lawmakers-detail-grievances-over-government-s-choke-point-2-0",
    "timestamp": "2025-12-01T17:14:21Z"
  },
  {
    "title": "Rooting Out DEI Allowed FBI Agents To Actually Do Their Jobs, Report Shows",
    "description": "Several anonymous sources have praised the Federal Bureau of Investigation (FBI) for axing its DEI programs, according to a recent report.",
    "link": "https://dailycaller.com/2025/12/01/dei-fbi-agents-kash-patel-report/",
    "timestamp": "2025-12-01T17:14:18Z"
  },
  {
    "title": "Trump Supports Hegseth Amid War Crimes Report, But Concedes ‘We’ll Look Into It’",
    "description": "The Republican leaders of both the House and Senate Armed Services Committees released statements over the weekend vowing investigations into Hegseth’s alleged order.\nThe post Trump Supports Hegseth Amid War Crimes Report, But Concedes ‘We’ll Look Into It’ fi…",
    "link": "https://www.mediaite.com/media/news/trump-supports-hegseth-amid-war-crimes-report-but-concedes-well-look-into-it/",
    "timestamp": "2025-12-01T17:12:35Z"
  },
  {
    "title": "Lawmakers To Consider 19 Bills for Childproofing the Internet",
    "description": "KOSA is back, along with more than a dozen other bills that will erode free speech and privacy in the name of protecting kids.",
    "link": "https://reason.com/2025/12/01/lawmakers-to-consider-19-bills-for-childproofing-the-internet/",
    "timestamp": "2025-12-01T17:12:13Z"
  },
  {
    "title": "Trump Spirals When Asked Why He Pardoned Notorious Drug Trafficker",
    "description": "President Donald Trump offered up a truly nonsensical rationale for his latest presidential pardon. While traveling on Air Force One Sunday, Trump was asked about his decision to pardon former Honduran President Juan Orlando Hernández, who was sentenced to 45…",
    "link": "https://newrepublic.com/post/203781/donald-trump-pardon-drug-trafficker-honduras",
    "timestamp": "2025-12-01T17:11:53Z"
  },
  {
    "title": "Trump Insists He’s Doing Ballroom “RIGHT” Amid Fight With Architect",
    "description": "Donald Trump issued a cryptic message regarding his White House ballroom project, promising online that the 90,000-square-foot project would be done “right.”The president referred to the construction zone as the “presidential ballroom” in a Truth Social post …",
    "link": "https://newrepublic.com/post/203787/donald-trump-ballroom-fight-architect",
    "timestamp": "2025-12-01T17:11:37Z"
  },
  {
    "title": "Hassett Odds Soar As Trump Confirms He's Made Decision On Next Fed Chair",
    "description": "Hassett Odds Soar As Trump Confirms He's Made Decision On Next Fed Chair\n \nPresident Donald Trump said on Nov. 30 that he has already decided on his pick to replace Federal Reserve Chair Jerome Powell, adding that an announcement is forthcoming, but declining…",
    "link": "https://biztoc.com/x/38bf393225c2b0e7",
    "timestamp": "2025-12-01T17:11:11Z"
  },
  {
    "title": "Honduras votes amid Trump push, pardon vow",
    "description": "President Trump said he will pardon former Honduran president Juan Orlando Hernández, who is serving 45 years for drug trafficking",
    "link": "https://theweek.com/politics/honduras-president-election-hernandez-trump-pardon",
    "timestamp": "2025-12-01T17:09:49Z"
  },
  {
    "title": "DSA-linked DC councilmember mounts mayoral bid to succeed Bowser",
    "description": "Washington D.C. Coucilmember Janeese Lewis George has mounted a mayoral bid following current Mayor Muriel Bowser's announcement that she will not seek another term",
    "link": "https://www.foxnews.com/politics/dsa-linked-dc-councilmember-mounts-mayoral-bid-succeed-bowser",
    "timestamp": "2025-12-01T17:09:37Z"
  },
  {
    "title": "NATO considers ‘more aggressive’ response to Russia’s hybrid threats",
    "description": "NATO considers 'more aggressive' stance against Russia's hybrid warfare, including pre-emptive cyber operations, as tensions escalate over sabotage.",
    "link": "https://www.foxnews.com/world/nato-considers-more-aggressive-response-russias-hybrid-threats",
    "timestamp": "2025-12-01T17:06:58Z"
  },
  {
    "title": "This honest Reagan judge resigned under Trump — his explanation will floor you",
    "description": "Today I want to share with you a statement by former federal judge Mark L. Wolf explaining why he resigned from the federal bench in early November. I found it sobering and troubling. The statement appeared in The Atlantic.By way of background, Wolf served in…",
    "link": "https://www.rawstory.com/trump-corruption-2674357498/",
    "timestamp": "2025-12-01T17:06:43Z"
  },
  {
    "title": "Sex Crimes. State Crimes. War Crimes. (The Bulwark)",
    "description": "The Bulwark:\nSex Crimes.  State Crimes.  War Crimes.  —  We're detecting a pattern with this administration.  —  You really just can't take breaks around here, huh?  While we were all busy digesting dinner Thanksgiving night, Donald Trump was tapping away at …",
    "link": "https://www.memeorandum.com/251201/p49",
    "timestamp": "2025-12-01T17:05:04Z"
  },
  {
    "title": "Monday’s Campaign Round-Up, 12.1.25: Texas’ Troy Nehls joins the retirement parade",
    "description": "Today’s installment of campaign-related news items from across the country.\n* With just one day remaining before Tennessee’s congressional special election, Donald Trump and House Speaker Mike Johnson are holding a Monday tele-rally in support of Republican M…",
    "link": "https://biztoc.com/x/e1cce24c06add678",
    "timestamp": "2025-12-01T17:03:43Z"
  },
  {
    "title": "UK and US agree zero-tariff deal on pharmaceuticals",
    "description": "LONDON (AP) — The U.K. has secured a 0% tariff rate for all U.K. medicines exported to the U.S. for at least three years, officials said Monday, in return for the U.K. spending more on new medicines. Under the deal, the U.S. agreed to exempt U.K.-origin pharm…",
    "link": "https://financialpost.com/pmn/uk-and-us-agree-zero-tariff-deal-on-pharmaceuticals",
    "timestamp": "2025-12-01T17:02:01Z"
  },
  {
    "title": "SMILE...",
    "description": "A pretrial court hearing for state murder charges in connection with the December 2024 killing of UnitedHealthcare CEO Brian Thompson took place in Manhattan court Monday morning.",
    "link": "https://www.themirror.com/news/politics/luigi-mangione-cuts-relaxed-figure-1537102",
    "timestamp": "2025-12-01T17:00:14Z"
  },
  {
    "title": "CNN’s Elie Honig Points Out Alleged US Strike on ‘Defenseless’ Survivors Is Literally a Textbook Example of a War Crime",
    "description": "Honig pointed out that a “double tap” strike on a ship was a textbook example of an “illegal” act cited in the DoD's \"own manual on the law of war.”\nThe post CNN’s Elie Honig Points Out Alleged US Strike on ‘Defenseless’ Survivors Is Literally a Textbook Exam…",
    "link": "https://www.mediaite.com/media/tv/cnns-elie-honig-points-out-alleged-us-strike-on-defenseless-survivors-is-literally-a-textbook-example-of-a-war-crime/",
    "timestamp": "2025-12-01T16:59:56Z"
  },
  {
    "title": "‘Your culture sucks’: Watch media face attack white Americans as he brags ‘brown people’ are breeding big-time in bizarre rant",
    "description": "'Your story is a sh***y story, filled with misery. It's filled with bland chicken. It's filled with terrible, terrible, dry-ass meat'",
    "link": "https://www.wnd.com/2025/12/your-culture-sucks-watch-media-face-attack-white/",
    "timestamp": "2025-12-01T16:57:55Z"
  },
  {
    "title": "Trump Administration Unveils Details On Most-Favored Nation Prices For Drugs",
    "description": "CMS announced in Nov. a new drug payment model called GENEROUS, designed to make most-favored nation prices available to state Medicaid programs via manufacturer rebates.",
    "link": "https://www.forbes.com/sites/joshuacohen/2025/12/01/trump-administration-unveils-details-on-most-favored-nation-prices-for-drugs/",
    "timestamp": "2025-12-01T16:56:40Z"
  },
  {
    "title": "US, UK agree to zero tariffs on medicines; UK commits to higher spending",
    "description": "The deal involves a major change in how the UK values drugs and will apply to all new medicines, not just US ones.",
    "link": "https://www.aljazeera.com/economy/2025/12/1/us-uk-agree-to-zero-tariffs-on-medicines-uk-commits-to-higher-spending",
    "timestamp": "2025-12-01T16:55:06Z"
  },
  {
    "title": "Congress seeks answers in ‘kill everybody’ strike report",
    "description": "Lawmakers suggest the Trump administration’s follow-up boat strike may be a war crime",
    "link": "https://theweek.com/politics/war-crimes-hegseth-boat-strikes",
    "timestamp": "2025-12-01T16:53:44Z"
  },
  {
    "title": "Trump releases fraudster executive days into prison sentence",
    "description": "The former investment manager was convicted of defrauding thousands of investors.",
    "link": "https://www.bbc.com/news/articles/c7vmn61l75ro",
    "timestamp": "2025-12-01T16:51:22Z"
  },
  {
    "title": "‘Flat Out Lies!’ Ana Navarro Argues Trump’s War March With Venezuela Has Nothing to Do With Drugs",
    "description": "Ana Navarro declared Monday that Donald Trump's desire for regime change in Venezuela had nothing to do with stopping the flow of illegal drugs.\nThe post ‘Flat Out Lies!’ Ana Navarro Argues Trump’s War March With Venezuela Has Nothing to Do With Drugs first a…",
    "link": "https://www.mediaite.com/media/news/flat-out-lies-ana-navarro-argues-trumps-war-march-with-venezuela-has-nothing-to-do-with-drugs/",
    "timestamp": "2025-12-01T16:51:17Z"
  },
  {
    "title": "ICC president vows to resist US and Russian pressure despite sanctions and threats",
    "description": "Nine members of the International Criminal Court have been sanctioned by the U.S.",
    "link": "https://www.bostonherald.com/2025/12/01/icc-annual-meeting/",
    "timestamp": "2025-12-01T16:49:52Z"
  },
  {
    "title": "Trump commutes 7-year prison sentence of former private equity CEO David Gentile",
    "description": "WASHINGTON — President Donald Trump has commuted the seven-year sentence of former private equity CEO David Gentile, a White House official confirmed",
    "link": "https://biztoc.com/x/1111828136b2050f",
    "timestamp": "2025-12-01T16:48:55Z"
  },
  {
    "title": "I toured the White House to see Melania Trump's Christmas decorations. The East Wing is no more, but the display was still dazzling.",
    "description": "First lady Melania Trump unveiled the 2025 White House Christmas decorations centered on the theme \"Home Is Where The Heart Is.\"",
    "link": "https://www.businessinsider.com/melania-trump-white-house-christmas-decorations-photos-2025-12",
    "timestamp": "2025-12-01T16:47:35Z"
  },
  {
    "title": "'Major error' by Trump has created formidable opponent to MAGA's reign: analyst",
    "description": "President Donald Trump's violent threats aimed at several Democrats, and specifically Sen. Mark Kelly (D-AZ), have now positioned the lawmaker for a potential presidential run in 2028, a commentator said Monday.In an analysis published by Salon's Jason Kyle H…",
    "link": "https://www.rawstory.com/donald-trump-mark-kelly/",
    "timestamp": "2025-12-01T16:46:46Z"
  },
  {
    "title": "US announces zero-tariff pharmaceutical deal with Britain",
    "description": "The United States and Britain have announced a deal to secure zero tariffs on British pharmaceutical products and medical technology in return for Britain spending more on medicines and overhauling how it values drugs.",
    "link": "https://www.rte.ie/news/uk/2025/1201/1546742-us-uk-pharma-deal/",
    "timestamp": "2025-12-01T16:45:25Z"
  },
  {
    "title": "Lane Kiffin LSU contract, salary details after becoming Tigers' football coach",
    "description": "How much is Lane Kiffin making as LSU's football coach? Here's what to know of his reported contract details and salary:",
    "link": "https://www.usatoday.com/story/sports/ncaaf/sec/2025/12/01/lane-kiffin-lsu-football-contract-salary/87549750007/",
    "timestamp": "2025-12-01T16:42:05Z"
  }
]