[
  {
    "title": "Trump Mocks Time Magazine After Cover Puts Musk Behind President's Desk",
    "description": "Time magazine&#039;s latest cover featured billionaire Elon Musk sitting behind the Resolute Desk in the Oval Office, a move likely aimed at stoking US President Donald Trump&#039;s ire.",
    "link": "https://www.ndtv.com/world-news/still-in-business-donald-trump-mocks-time-magazine-after-cover-puts-elon-musk-behind-presidents-desk-7669662",
    "timestamp": "2025-02-09T07:34:56Z"
  },
  {
    "title": "Patrick Mahomes just keeps winning. He's not bothered with people who are mad about it",
    "description": "He's in his fifth Super Bowl and has won three of them already. He's won two MVP awards, three Super Bowl MVP awards, been named to the Pro Bowl six times and an All-Pro three times.",
    "link": "https://www.wtae.com/article/patrick-mahomes-just-keeps-winning/63700160",
    "timestamp": "2025-02-09T07:34:23Z"
  },
  {
    "title": "China to roll back clean power subsidies after boom",
    "description": "China's top economic planning agency said on Sunday it was taking steps to scale back subsidies for renewable energy projects after a boom in solar and wind ...",
    "link": "https://finance.yahoo.com/news/china-roll-back-clean-power-072928623.html",
    "timestamp": "2025-02-09T07:29:28Z"
  },
  {
    "title": "Ishiba, after meeting Trump, voices optimism over averting tariffs",
    "description": "Japanese Prime Minister Shigeru Ishiba expressed optimism on Sunday that his country could avoid higher U.S. tariffs, saying President Donald Trump had &quot;recognized&quot; Japan's huge investment in the U.S. and the American jobs that it creates. At his fi…",
    "link": "https://japantoday.com/category/politics/japan-pm-ishiba-after-meeting-trump-voices-optimism-over-averting-tariffs",
    "timestamp": "2025-02-09T07:28:19Z"
  },
  {
    "title": "N Korean leader Kim slams U.S.-S Korea-Japan partnership and vows to boost his nuclear program",
    "description": "North Korean leader Kim Jong Un said an elevated U.S. security partnership with South Korea and Japan poses a grave threat to his country and vowed to further bolster his nuclear weapons program, state media reported Sunday. Kim has previously made similar wa…",
    "link": "https://japantoday.com/category/politics/north-korean-leader-kim-jong-un-vows-to-further-develop-nuclear-forces2",
    "timestamp": "2025-02-09T07:27:59Z"
  },
  {
    "title": "Israel Shocked by 3 Starved Hostages; Slams CNN for 'Violating Every Ethical Standard'",
    "description": "Israelis were shocked Saturday at the physical condition of three emaciated hostages released by Hamas under the ongoing ceasefire deal, with many condemning the evident starvation of the Israelis after nearly 500 days in captivity.\nThe post Israel Shocked by…",
    "link": "https://www.breitbart.com/middle-east/2025/02/08/israel-shocked-by-3-starved-hostages-slams-cnn-for-violating-every-ethical-standard/",
    "timestamp": "2025-02-09T07:27:52Z"
  },
  {
    "title": "New look Middle East had started to draw investors... and then came Trump",
    "description": "LONDON/JERUSALEM, Feb 9 (Reuters) - A historic shake-up of the Middle East is starting to draw international investors, warming to the prospects of relative peace and economic recovery after so much turmoil.\nPresident Donald Trump's proposal that the U.S. tak…",
    "link": "https://biztoc.com/x/4c07d98dabb589b0",
    "timestamp": "2025-02-09T07:27:09Z"
  },
  {
    "title": "US updates: Trump says he’s spoken with Putin about Ukraine",
    "description": "US President Donald Trump has urged Moscow and Kyiv to negotiate an end to the war in Ukraine. Meanwhile, back home, he revoked security clearances for top Biden administration officials. Follow DW for more. President Donald Trump says he has spoken his Russi…",
    "link": "https://www.dw.com/en/us-updates-trump-says-hes-spoken-with-putin-about-ukraine/live-71551445",
    "timestamp": "2025-02-09T07:25:00Z"
  },
  {
    "title": "Reckless pipe dream or game changer in a stalled conflict? Trump’s Gaza ‘takeover’",
    "description": "Experts say Trump’s proposal is a legal, diplomatic, geopolitical, and humanitarian minefield, with some Trump allies suggesting it was brought up as a negotiating tactic.",
    "link": "https://www.jpost.com/israel-news/article-841273",
    "timestamp": "2025-02-09T07:21:43Z"
  },
  {
    "title": "Benjamin Netanyahu “is not interested in the second stage”",
    "description": "Netanyahu \"is not interested in the second stage” of the ceasefire deal, according to laywer Mohammad Dahleh.",
    "link": "https://www.aljazeera.com/program/quotable/2025/2/9/benjamin-netanyahu-is-not-interested-in-the-second",
    "timestamp": "2025-02-09T07:17:33Z"
  },
  {
    "title": "Patrick Mahomes just keeps winning. He's not bothered with people who are mad about it",
    "description": "He's in his fifth Super Bowl and has won three of them already. He's won two MVP awards, three Super Bowl MVP awards, been named to the Pro Bowl six times and an All-Pro three times.",
    "link": "https://www.wlwt.com/article/patrick-mahomes-just-keeps-winning/63700160",
    "timestamp": "2025-02-09T07:07:39Z"
  },
  {
    "title": "China's tit-for-tat tariffs, Modi-Trump talks, Malaysia GDP",
    "description": "Welcome to Your Week in Asia.\nChina's retaliatory tariffs on some U.S. goods are expected to come into force this week, as the two heavyweight economies launch a fresh trade war.\nIndia's leader Narendra Modi will be in Washington to meet with his American cou…",
    "link": "https://biztoc.com/x/d7417dfb74420130",
    "timestamp": "2025-02-09T07:04:25Z"
  },
  {
    "title": "Saudi Arabia rejects Netanyahu's remarks on displacing Palestinians",
    "description": "Saudi Arabia on Sunday strongly condemned the recent statements of Israeli Prime Minister Benjamin Netanyahu, who had called for the displacement of Palestinians to the kingdom.",
    "link": "https://www.hurriyetdailynews.com/saudi-arabia-rejects-netanyahus-remarks-on-displacing-palestinians-205594",
    "timestamp": "2025-02-09T07:03:20Z"
  },
  {
    "title": "No, Trump Can't Take Back Your Student Loan Forgiveness -- Except in This Situation",
    "description": "You likely won't have to repay debt relief you already received, but time is running out if you're still in line for forgiveness.",
    "link": "https://www.cnet.com/personal-finance/no-trump-cant-take-back-your-student-loan-forgiveness-except-in-this-situation/",
    "timestamp": "2025-02-09T07:00:00Z"
  },
  {
    "title": "Ishiba says Trump didn't push defense spending hike or discuss tariffs",
    "description": "Ishiba also echoed Trump's pledge to help mediate a move by Japan’s Nippon Steel to invest in U.S. Steel rather than purchasing the American company.",
    "link": "https://www.japantimes.co.jp/news/2025/02/09/japan/politics/ishiba-trump-defense-spending-tariffs/",
    "timestamp": "2025-02-09T06:53:00Z"
  },
  {
    "title": "US ends aid to South Africa over land law, Israel stance",
    "description": "U.S. President Donald Trump has signed an executive order cutting U.S. financial assistance to South Africa, citing concerns over its land expropriation law, its genocide case against Israel at the International Court of Justice (ICJ), and closer ties with Ir…",
    "link": "https://www.hurriyetdailynews.com/us-ends-aid-to-south-africa-over-land-law-israel-stance-205592",
    "timestamp": "2025-02-09T06:49:19Z"
  },
  {
    "title": "Trump to sanction ICC prosecutor – Reuters",
    "description": "Washington has reportedly blacklisted ICC prosecutor Karim Khan, who had launched a war crimes probe into Netanyau Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612392-trump-to-sanction-icc-prosecutor/",
    "timestamp": "2025-02-09T06:46:37Z"
  },
  {
    "title": "US judge blocks Musk's cost-cutting team from Treasury data",
    "description": "A U.S. judge issued an emergency order early Saturday blocking Elon Musk's government reform team from accessing personal and financial data for millions of Americans stored at the Treasury Department, court documents showed.",
    "link": "https://www.hurriyetdailynews.com/us-judge-blocks-musks-cost-cutting-team-from-treasury-data-205591",
    "timestamp": "2025-02-09T06:42:33Z"
  },
  {
    "title": "Scientists Deplore Sharp US Cut In Medical Research Funding",
    "description": "The National Institutes of Health (NIH) said late Friday it was setting a 15 percent limit on its funding of &quot;indirect,&quot; or overhead, costs linked to research.",
    "link": "https://www.ndtv.com/world-news/scientists-deplore-sharp-us-cut-in-medical-research-funding-7669399",
    "timestamp": "2025-02-09T06:39:04Z"
  },
  {
    "title": "Trump says he is ending Biden's security clearances, daily intelligence briefings",
    "description": "U.S. President Donald Trump said on Friday that he is ending former President Joe Biden's security clearances and stopping his daily intelligence briefings.",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-250208-pdo01.htm",
    "timestamp": "2025-02-09T06:36:25Z"
  },
  {
    "title": "Letters to the editor",
    "description": "Herald readers sound off about the closing of the Pappas Rehabilitation Hospital for Children and the pausing of funds to USAID.",
    "link": "https://www.bostonherald.com/2025/02/09/letters-to-the-editor-669/",
    "timestamp": "2025-02-09T06:35:50Z"
  },
  {
    "title": "Iran ready to negotiate with US but not under 'maximum pressure': Minister",
    "description": "Iran was ready to negotiate with the United States but not under the \"maximum pressure\" strategy of U.S. President Donald Trump, Tehran's chief diplomat suggested on Saturday.",
    "link": "https://www.hurriyetdailynews.com/iran-ready-to-negotiate-with-us-but-not-under-maximum-pressure-minister-205590",
    "timestamp": "2025-02-09T06:35:38Z"
  },
  {
    "title": "US judge blocks Musk’s cost-cutting team from treasury data",
    "description": "A United States district judge, Paul Engelmayer issued an emergency order early Saturday blocking Elon Musk’s government reform team from accessing personal and financial data for millions of Americans stored at the Treasury Department, court documents showed…",
    "link": "https://punchng.com/us-judge-blocks-musks-cost-cutting-team-from-treasury-data/",
    "timestamp": "2025-02-09T06:35:29Z"
  },
  {
    "title": "IRGC cmdrs.: Khamenei must let us build nuclear weapons",
    "description": "“We have never been this vulnerable, and it may be our last chance to obtain one before it’s too late,” an official was cited as saying.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-841264",
    "timestamp": "2025-02-09T06:34:48Z"
  },
  {
    "title": "Chris Riddell on Donald Trump’s plan to take over and redevelop Gaza – cartoon - The Guardian",
    "description": "Chris Riddell on Donald Trump’s plan to take over and redevelop Gaza – cartoonThe Guardian Trump’s Gaza proposal frustrates his new Arab American supportersThe Washington Post It's Horrifying How Many Israelis Support the Expulsion of PalestiniansHaaretz Opin…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176162229",
    "timestamp": "2025-02-09T06:33:03Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events – day 1,081",
    "description": "Here are the key developments on the 1,081st day of Russia’s full-scale invasion of Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/2/9/russia-ukraine-war-list-of-key-events-day-1081",
    "timestamp": "2025-02-09T06:30:37Z"
  },
  {
    "title": "Britain navigates rough transatlantic waters as Trump roils 'special relationship'",
    "description": "Britain under Prime Minister Keir Starmer is looking to navigate its relationship with the US during Trump's second term, with hopes of securing a trade deal while managing pressures over defense spending and maintaining ties with the EU. Appointment of Peter…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/britain-navigates-rough-transatlantic-waters-as-trump-roils-special-relationship/articleshow/118084514.cms",
    "timestamp": "2025-02-09T06:29:23Z"
  },
  {
    "title": "Nextrush Unplugged Weekend*Elon Musk",
    "description": "Newsdump Update: Saturday Ruling From Federal Judge Against Department Of Government Efficiency... The Democrats want you to believe Elon Musk and his crew are hackers stealing from your bank accounts... Welcome to this week's attempt at media excellence your…",
    "link": "https://freerepublic.com/focus/f-bloggers/4296168/posts",
    "timestamp": "2025-02-09T06:22:56Z"
  },
  {
    "title": "EU's largest far-right bloc makes show of force in Spain",
    "description": "Far-right leaders, including Hungary’s Viktor Orban and France’s Marine Le Pen, gathered in Madrid to rally behind Patriots for Europe as it seeks greater influence in the EU.",
    "link": "https://www.japantimes.co.jp/news/2025/02/09/world/far-right-spain-rally/",
    "timestamp": "2025-02-09T06:21:00Z"
  },
  {
    "title": "Hamas, Israel complete fifth hostage-prisoner swap under Gaza deal",
    "description": "Israel and Hamas completed their fifth hostage-prisoner swap under a fragile Gaza ceasefire deal on Saturday, with the frail, disoriented appearance of the three freed Israelis sparking dismay among their relatives.",
    "link": "https://www.hurriyetdailynews.com/hamas-israel-complete-fifth-hostage-prisoner-swap-under-gaza-deal-205587",
    "timestamp": "2025-02-09T06:18:37Z"
  },
  {
    "title": "‘Will the US go to war for Estonia or Latvia?’ Former French ambassador on the new world disorder",
    "description": "Worldview: Gérard Araud says the idea of fighting for democracy is completely alien to Trump",
    "link": "https://www.irishtimes.com/opinion/2025/02/08/will-the-us-go-to-war-for-estonia-or-latvia-former-french-ambassador-on-the-new-world-disorder/",
    "timestamp": "2025-02-09T06:15:00Z"
  },
  {
    "title": "How Sam Altman sidestepped Elon Musk to win over Donald Trump",
    "description": "After helping President Trump get elected, Elon Musk was poised to dominate the country’s A.I. policies. Then OpenAI CEO Altman sneaked into the White House.",
    "link": "https://biztoc.com/x/91efaa4da26a71eb",
    "timestamp": "2025-02-09T06:09:05Z"
  },
  {
    "title": "New look Middle East had started to draw investors... and then came Trump",
    "description": "International investors are optimistic about the Middle East following recent peace developments and economic recovery potentials. Positive changes include Egypt's first dollar debt sale in four years, Israel's bond market recovery, and Lebanon's efforts to a…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/new-look-middle-east-had-started-to-draw-investors-and-then-came-trump/articleshow/118084181.cms",
    "timestamp": "2025-02-09T06:07:16Z"
  },
  {
    "title": "Trump: 'I would like a deal done with Iran' rather than 'bombing the hell out of it'",
    "description": "\"I would like a deal done with Iran on non-nuclear. I would prefer that to bombing the hell out of it,\" the president was cited as saying.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-841255",
    "timestamp": "2025-02-09T06:01:07Z"
  },
  {
    "title": "‘Bitcoin’s cycle top isn’t in, just mid-bull pullback’ – Analyst",
    "description": "Wondering what's next for BTC amid its subdued price action? Here are some key on-chain and historical insights.",
    "link": "https://ambcrypto.com/bitcoins-cycle-top-isnt-in-just-mid-bull-pullback-analyst/",
    "timestamp": "2025-02-09T06:00:35Z"
  },
  {
    "title": "Leader of the free world: Trump intervention could be the key to freedom for Canada’s version of J6 prisoners",
    "description": "Canadian truck drivers, part of the Freedom Convoy movement, protested against Wuhan coronavirus (COVID-19) vaccine mandates. The movement expanded into a broader rejection of Canadian Prime Minister Justin Trudeau’s government, leading to a state of emergenc…",
    "link": "https://www.naturalnews.com/2025-02-09-trump-intervention-key-freedom-canadas-j6-prisoners.html",
    "timestamp": "2025-02-09T06:00:00Z"
  },
  {
    "title": "Palestinians reject Trumpâ\u0080\u0099s Gaza ‘Riviera’ plan, vow to stay on their land",
    "description": "President Trump proposes expelling Palestinians from Gaza and transforming it into a tourist destination, drawing fierce criticism. Palestinians see the plan as a threat to their existence and a continuation of the Nakba, vowing resistance. The proposal faces…",
    "link": "https://www.naturalnews.com/2025-02-09-palestinians-reject-trump-riviera-plan-vow-to-stay.html",
    "timestamp": "2025-02-09T06:00:00Z"
  },
  {
    "title": "Trump administration reopens vast federal lands for oil and gas drilling: A boon for affordable energy",
    "description": "President Trump’s Interior Department has reopened 625 million acres of federal lands and waters for oil and gas drilling, reversing the Biden administration’s climate-focused policies. The decision includes vast swaths of the Arctic National Wildlife Refuge …",
    "link": "https://www.naturalnews.com/2025-02-09-trump-reopens-federal-lands-oil-gas-drilling.html",
    "timestamp": "2025-02-09T06:00:00Z"
  },
  {
    "title": "Netanyahu: Israel delays Iran’s nuclear weapons program by a decade",
    "description": "Israeli Prime Minister Benjamin Netanyahu stated that Iran could have developed nuclear weapons ten years ago if not for Israeli interventions, amid new intelligence reports indicating that Iranian scientists are exploring faster methods to develop nuclear we…",
    "link": "https://www.naturalnews.com/2025-02-09-netanyahu-israel-delays-iran-nuclear-weapons-program.html",
    "timestamp": "2025-02-09T06:00:00Z"
  },
  {
    "title": "Trump tariffs threaten Ireland’s service economy too",
    "description": "There is a risk of escalation through the treatment of social media companies",
    "link": "https://www.irishtimes.com/business/2025/02/09/trump-tariffs-threaten-irelands-service-economy-too/",
    "timestamp": "2025-02-09T06:00:00Z"
  },
  {
    "title": "A surefire path to WWIII: Desperate Zelensky calls for NUKES to stop Russia",
    "description": "Ukrainian President Volodymyr Zelensky has called for the West to arm Kyiv with nuclear weapons to deter Russian aggression, raising concerns about a potential global catastrophe. Zelensky’s proposal stems from the frustration with the West’s reluctance to pr…",
    "link": "https://www.naturalnews.com/2025-02-09-desperate-zelensky-calls-for-nukes-stop-russia.html",
    "timestamp": "2025-02-09T06:00:00Z"
  },
  {
    "title": "Decriminalizing carbon dioxide: The unraveling of EPA’s flawed Endangerment Finding",
    "description": "President Donald Trump signed an executive order directing the EPA to reassess the legality and applicability of the Endangerment Finding, a move seen as a step toward dismantling federal environmental regulations. The Clean Air Act of 1963 didn’t initially l…",
    "link": "https://www.naturalnews.com/2025-02-09-the-unraveling-of-epas-flawed-endangerment-finding.html",
    "timestamp": "2025-02-09T06:00:00Z"
  },
  {
    "title": "Trump revokes security clearances for Biden's top aides",
    "description": "WASHINGTON, Feb. 8 (Xinhua) -- U.S. President Donald Trump has revoked former Secretary of State Ant",
    "link": "http://en.people.cn/n3/2025/0209/c90000-20274536.html",
    "timestamp": "2025-02-09T05:58:11Z"
  },
  {
    "title": "US approves sale of $7.4 bn in bombs, missiles to Israel",
    "description": "Washington (AFP) Feb 7, 2025\n\n\n The United States on Friday announced the approval of the sale of more than $7.4 billion in bombs, missiles and related equipment to Israel, which has used American-made weapons to devastating effect during the war in Gaza. \n\nT…",
    "link": "https://www.spacewar.com/reports/US_approves_sale_of_74_bn_in_bombs_missiles_to_Israel_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "Canada willing to join US 'Iron Dome' missile shield: minister",
    "description": "Ottawa (AFP) Feb 6, 2025\n\n\n Canada is prepared to join US President Donald Trump's proposed development of an \"Iron Dome\" missile defense shield, Defense Minister Bill Blair said Thursday. \n\nBlair, in a call with reporters at the end of a trip to Washington, …",
    "link": "https://www.spacewar.com/reports/Canada_willing_to_join_US_Iron_Dome_missile_shield_minister_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "Trump will cry wolf once too often",
    "description": "Washington DC (UPI) Feb 6, 2025 \n\n\n As the principal author of \"shock and awe,\" I believe Donald Trump is in great debt to me for all the shock and awe he is applying at home and abroad with strokes of a Sharpie and verbal dictates. \n Threatening high tariffs…",
    "link": "https://www.spacewar.com/reports/Trump_will_cry_wolf_once_too_often_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "France delivers first Mirage 2000 fighter jets to Ukraine: minister",
    "description": "Paris (AFP) Feb 6, 2025\n\n\n France has delivered a first consignment of Mirage 2000-5 fighter jets to Ukraine to help Kyiv defend its airspace against Russia, Defence Minister Sebastien Lecornu said on Thursday. \n\n\"The first of these aircraft have arrived in U…",
    "link": "https://www.spacedaily.com/reports/France_delivers_first_Mirage_2000_fighter_jets_to_Ukraine_minister_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "China slams US 'Cold War mentality' in SAmerica: China appoints 'wolf warrior' to European affairs post",
    "description": "Beijing (AFP) Feb 7, 2025\n\n\n China on Friday condemned a \"Cold War mentality\" by the United States in Latin America, saying it had complained over comments by Secretary of State Marco Rubio during a visit to the region. \n\nSince winning the US election in Nove…",
    "link": "https://www.spacewar.com/reports/China_slams_US_Cold_War_mentality_in_Latin_America_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "Israeli officers warned against criticising Trump's Gaza plan; Israel hits Hamas weapons facility in Syria",
    "description": "Jerusalem (AFP) Feb 7, 2025\n\n Israeli Defence Minister Israel Katz on Friday warned officers not to \"speak out\" against US President Donald Trump's plan to \"take over\" Gaza, which the army's intelligence chief reportedly criticised. \n\n\"There will be no realit…",
    "link": "https://www.spacewar.com/reports/Defence_minister_warns_Israeli_officers_against_criticising_Trumps_Gaza_plan_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "Taiwan says detects six Chinese balloons near island",
    "description": "Taipei (AFP) Feb 7, 2025\n\n\n Taiwan detected six Chinese balloons off the island, the defence ministry said Friday, as Beijing maintains military pressure to push its claim of sovereignty. \n\nThe six balloons were spotted in the 24 hours to 6:00 am on Friday (2…",
    "link": "https://www.spacedaily.com/reports/Taiwan_says_detects_six_Chinese_balloons_near_island_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "UK's Lammy warns US aid cuts could see China step into 'gap'",
    "description": "London (AFP) Feb 7, 2025\n\n\n British Foreign Secretary David Lammy on Friday warned that US President Donald Trump's moves to freeze foreign aid and dismantle the USAID agency could see \"China and others step into that gap\". \n\nThe UK's top diplomat pointed to …",
    "link": "https://www.terradaily.com/reports/UKs_Lammy_warns_US_aid_cuts_could_see_China_step_into_gap_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "Iran's Khamenei warns against negotiating with US",
    "description": "Tehran (AFP) Feb 7, 2025\n\n\n Iran's supreme leader Ayatollah Ali Khamenei said Friday that there should not be negotiations with the United States, days after US President Donald Trump called for a new nuclear deal. \n\n\"You should not negotiate with such a gove…",
    "link": "https://www.spacewar.com/reports/Irans_Khamenei_warns_against_negotiating_with_US_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "Indonesia halts Trump development; as 100s protest Beijing 'mega embassy' in London",
    "description": "Jakarta (AFP) Feb 7, 2025\n\n The Indonesian government has blocked a billion-dollar real estate development outside Jakarta that was to include luxury properties under US President Donald Trump's brand, citing environmental damage, officials said Friday. \n\nTru…",
    "link": "https://www.spacewar.com/reports/Indonesia_halts_development_of_estate_hosting_Trump_properties_999.html",
    "timestamp": "2025-02-09T05:54:51Z"
  },
  {
    "title": "Trump demands full disclosure on assassination threats: ‘No more holding back’",
    "description": "US President Donald Trump has demanded that the Secret Service provide him with full details regarding two assassination attempts on his life. Trump questioned why one suspect had multiple phones and the other used foreign encrypted apps. The first attempt oc…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-demands-full-disclosure-on-assassination-threats-no-more-holding-back/articleshow/118083237.cms",
    "timestamp": "2025-02-09T05:49:12Z"
  },
  {
    "title": "Saudi Arabia rejects PM Netanyahu's remarks on displacing Palestinians",
    "description": "Netanyahu appeared to be joking when responding to an interviewer on Channel 14 who mistakenly said \"Saudi state\" instead of \"Palestinian state\" before correcting himself.",
    "link": "https://www.jpost.com/middle-east/article-841256",
    "timestamp": "2025-02-09T05:48:54Z"
  },
  {
    "title": "Trump says he spoke to Putin on ending Ukraine war",
    "description": "United States President Donald Trump told New York Post aboard Air Force One that he had already spoken to his Russian colleague Vladimir Putin on the phone. Trump revealed that Putin expressed willin...",
    "link": "https://biztoc.com/x/66ac594f0b8f111a",
    "timestamp": "2025-02-09T05:46:57Z"
  },
  {
    "title": "Pentagon Doubles Number Of News Outlets To 'Rotate' Out From Office Spaces",
    "description": "In the first round, the Defense Department said a week ago the New York Times, NBC News, Politico and the National Public Radio had to vacate their dedicated workspaces at the Pentagon.",
    "link": "https://www.ndtv.com/world-news/pentagon-doubles-number-of-news-outlets-to-rotate-out-from-office-spaces-7669087",
    "timestamp": "2025-02-09T05:36:10Z"
  },
  {
    "title": "Thousands protest Trump, Musk, and ‘Project 2025’ at N.C. State Capitol [not 'thousands' -photos - barf alert]",
    "description": "Thousands of peaceful protesters encircled the North Carolina State Capitol in Raleigh for hours Wednesday as part of a nationwide movement opposing President Donald Trump and his agenda.(snip) North Carolinians marched counterclockwise around the Capitol and…",
    "link": "https://freerepublic.com/focus/f-chat/4296166/posts",
    "timestamp": "2025-02-09T05:34:32Z"
  },
  {
    "title": "'The feel of a coup': Elon Musk said to be poised to 'defy' major judicial order (David McAfee/Raw Story)",
    "description": "David McAfee / Raw Story:\n‘The feel of a coup’: Elon Musk said to be poised to ‘defy’ major judicial order  —  Elon Musk appears poised to defy a judicial order, according to observers.  —  Musk, the richest man in the world and an appointee of Donald Trump, …",
    "link": "https://www.memeorandum.com/250209/p1",
    "timestamp": "2025-02-09T05:20:00Z"
  },
  {
    "title": "Trump says he has spoken to Putin about Ukraine – media",
    "description": "The New York Post hasn’t provided any quotes from the reported phone call in its interview with the US president",
    "link": "https://www.rt.com/news/612394-trump-putin-alleged-call/",
    "timestamp": "2025-02-09T05:18:05Z"
  },
  {
    "title": "Eagles' Jalen Hurts responds to Trump attending Super Bowl LIX: 'He's welcome to do what he wants'",
    "description": "President Donald Trump will become the first sitting U.S. president to attend a Super Bowl, and the stars playing in the game are aware of his attendance. Trump's expected presence sparked an enthusiastic reaction among multiple Kansas City Chiefs players, in…",
    "link": "https://freerepublic.com/focus/f-chat/4296163/posts",
    "timestamp": "2025-02-09T05:17:12Z"
  },
  {
    "title": "Britain navigates rough transatlantic waters as Trump roils the 'special relationship'",
    "description": "Ever since Winston Churchill coined the phrase, politicians have extolled the “special relationship” between the United States and Britain",
    "link": "https://abcnews.go.com/International/wireStory/britain-navigates-rough-transatlantic-waters-trump-roils-special-118616766",
    "timestamp": "2025-02-09T05:10:57Z"
  },
  {
    "title": "House Republicans mull taxes on scholarships and changes to student loan programs",
    "description": "As Republicans in Congress look for ways to slash spending, some legislators are floating new taxes on college scholarships, an end to student loan repayment plans and a big hike in taxes on university endowments",
    "link": "https://abcnews.go.com/US/wireStory/house-republicans-mull-taxes-scholarships-student-loan-programs-118616489",
    "timestamp": "2025-02-09T05:10:29Z"
  },
  {
    "title": "As female representation hits new highs among states, constitutions still assume officials are male",
    "description": "A record 13 women had been serving as governor this year",
    "link": "https://abcnews.go.com/US/wireStory/female-representation-hits-new-highs-states-constitutions-assume-118616671",
    "timestamp": "2025-02-09T05:10:27Z"
  },
  {
    "title": "Latino workers working to overcome a technological divide brought on by automation, AI",
    "description": "As jobs become more reliant on technology some Latino workers can be left behind due to a lack of digital skills exacerbated by a lack of accessibility",
    "link": "https://abcnews.go.com/US/wireStory/latino-workers-working-overcome-technological-divide-brought-automation-118616488",
    "timestamp": "2025-02-09T05:10:18Z"
  },
  {
    "title": "Judd Apatow Weighs In on 'It Ends With Us' Drama at DGA Awards",
    "description": "The filmmaker hosted the DGA ceremony for the sixth time and also mocked Donald Trump, Elon Musk and this year's best picture nominees during his monologue.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/judd-apatow-dga-awards-monologue-it-ends-with-us-drama-1236131196/",
    "timestamp": "2025-02-09T05:07:23Z"
  },
  {
    "title": "Trump says he has spoken to Putin about ending war in Ukraine, the New York Post reports",
    "description": "(Reuters) - U.S. President Donald Trump said that he has talked to Russian President Vladimir Putin on the phone to discuss an end to the war in Ukraine, the New York Post reported late on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/09/trump-says-he-has-spoken-to-putin-about-ending-war-in-ukraine-the-new-york-post-reports",
    "timestamp": "2025-02-09T05:07:00Z"
  },
  {
    "title": "Trump says he has spoken to Putin about ending war in Ukraine, the New York Post reports",
    "description": "U.S. President Donald Trump announced discussions with Russian President Vladimir Putin regarding ending the war in Ukraine. Trump mentioned a possible meeting with Ukrainian President Volodymyr Zelenskiy soon. The conflict, nearing its third anniversary, has…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-he-has-spoken-to-putin-about-ending-war-in-ukraine-the-new-york-post-reports/articleshow/118083183.cms",
    "timestamp": "2025-02-09T05:06:59Z"
  },
  {
    "title": "Trump’s Apparent Gaza Scheme Endangers His Entire Legacy",
    "description": "The plan outlined at the press conference would be a betrayal of America First principles, as well as a costly mistake.\nThe post Trump’s Apparent Gaza Scheme Endangers His Entire Legacy appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trumps-apparent-gaza-scheme-endangers-his-entire-legacy/",
    "timestamp": "2025-02-09T05:05:00Z"
  },
  {
    "title": "Efficiency − or Empire? How Elon Musk’s hostile Takeover could end Government as we know it",
    "description": "By Allison Stanger, Middlebury (The Conversation) - Elon Musk’s role as the head of the Department of Government Efficiency, also known as DOGE, is on the surface a dramatic effort to overhaul the inefficiencies of federal bureaucracy. But beneath the rhetori…",
    "link": "https://www.juancole.com/2025/02/efficiency-%e2%88%92-government.html",
    "timestamp": "2025-02-09T05:04:08Z"
  },
  {
    "title": "The Death of USAID Heralds the End of Nation-Building",
    "description": "Conservatives in government have long watched in exasperation as the agency thumbed its nose at the U.S. national interest.\nThe post The Death of USAID Heralds the End of Nation-Building appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/the-death-of-usaid-heralds-the-end-of-nation-building/",
    "timestamp": "2025-02-09T05:03:00Z"
  },
  {
    "title": "Trump says he’s spoken with Putin as Russia’s war in Ukraine approaches third anniversary | CNN Politics",
    "description": "President Donald Trump announced in an interview published Saturday that he has spoken with Russian President Vladimir Putin.",
    "link": "https://www.cnn.com/2025/02/08/politics/trump-putin-speak-interview-saturday/index.html",
    "timestamp": "2025-02-09T05:02:25Z"
  },
  {
    "title": "Abram X. Kendi: last of the race hustlers?",
    "description": "The Civil Rights Movement has been a historic American success, and Americans of good will have always been glad for it. But playing the race card has, for many, been a ticket to money and infamy. \r\n\r\nJesse Jackson perfected the tactic of extort...",
    "link": "https://www.americanthinker.com/blog/2025/02/abram_x_kendi_last_of_the_race_hustlers.html",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "The Second Amendment: new Trumpian opportunities",
    "description": "As Barack Obama sneered, elections have consequences. Among them, with Donald Trump’s reelection, is a new respect for the Second Amendment, the part of the Bill of Rights that secures the rest. For the first time in many years, there is real p...",
    "link": "https://www.americanthinker.com/blog/2025/02/the_second_amendment_new_trumpian_opportunities.html",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "Why do most Americans still believe the US to be the ‘Greatest Nation on Earth’?",
    "description": "You’d wonder if Donald Trump’s childlike depiction of geopolitics helps ordinary Americans, or infantilises them",
    "link": "https://www.irishtimes.com/life-style/people/2025/02/09/why-do-most-americans-still-believe-the-us-to-be-the-greatest-nation-on-earth/",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "After the failures of lawfare, a leftist judge plows forward to new heights of judicial overreach",
    "description": "After the outrageous coordinated lawfare against President Trump propelled him to the White House for a second time, you'd think the legal establishment might just be more ... circumspect about its means of Getting Trump. You'd think they&#39...",
    "link": "https://www.americanthinker.com/blog/2025/02/after_the_failures_of_lawfare_a_leftist_judge_plows_forward_to_new_heights_of_judicial_overreach.html",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "Musk's minions",
    "description": "If you’ve listened to the ranting of the legacy media and the Democrats, you’d think that Elon Musk has hired a bunch of snot-nosed teenagers to serve in the Department of Government Efficiency (DOGE).\r\n\r\nThe reality is far from that fals...",
    "link": "https://www.americanthinker.com/blog/2025/02/musk_s_minions.html",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "I am a Jordanian Palestinian and I support Trump’s settlement plans for Gazans",
    "description": "President Donald Trump’s suggestion that Gaza’s Palestinians relocate to Jordan and Egypt on a “short term or long term” basis has been dismissed as diplomatically “unprecedented.”\r\n\r\nThe critics are wrong.\r\n\r\nJord...",
    "link": "https://www.americanthinker.com/blog/2025/02/i_am_a_jordanian_palestinian_and_i_support_trump_s_settlement_plans_for_gazans.html",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "Trump imposes sanity on a green EV market",
    "description": "The Electric Vehicle (EV) doom loop has been closing for several years. As I noted in California: electric vehicles are on fire!, California’s most recent wildfires exposed, yet again, EVs manifold weaknesses. Among them are:\r\n\r\n*1000-pound bat...",
    "link": "https://www.americanthinker.com/blog/2025/02/trump_imposes_sanity_on_a_green_ev_market.html",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "Is Trump criminalizing 'trans identity'?",
    "description": "It was one of Donald Trump’s campaign promises, one of many that got him elected. As Democrats/socialists/communists (D/s/cs) are discovering to their horror, he keeps his promises, promises like this executive order: \r\n\r\n\r\nIt is the polic...",
    "link": "https://www.americanthinker.com/blog/2025/02/is_trump_criminalizing_trans_identity.html",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "DOGE is killing the DemBorg",
    "description": "One of the arguments against DOGE’s activities at USAID and other government offices is that the money saved is an infinitesimally small part of the federal budget and overall debt.\r\n\r\nThat may be true, although all taxpayers are, or should be,...",
    "link": "https://www.americanthinker.com/blog/2025/02/doge_is_killing_the_demborg.html",
    "timestamp": "2025-02-09T05:00:00Z"
  },
  {
    "title": "House Republicans mull taxes on scholarships and changes to student loan programs",
    "description": "As Republicans in Congress look for ways to slash spending, some legislators are floating new taxes on college scholarships, an end to student loan repayment...",
    "link": "https://www.yahoo.com/news/house-republicans-mull-taxes-scholarships-045134534.html",
    "timestamp": "2025-02-09T04:51:34Z"
  },
  {
    "title": "Air traffic controllers say FAA hiring practices, ‘immunity program,’ led to DC plane crash",
    "description": "Air traffic controllers say an FAA “immunity program” fails to hold people accountable for their mistakes, even with deadly consequences. Current and former air traffic controllers warn that the Federal Aviation Administration’s hiring practices and “immunity…",
    "link": "https://freerepublic.com/focus/f-news/4296160/posts",
    "timestamp": "2025-02-09T04:31:47Z"
  },
  {
    "title": "US judge declines to block Elon Musk's DOGE from Labor Department systems - NewsBreak",
    "description": "(Reuters) -A federal judge on Friday declined to block Elon Musk's government cost-cutting department from accessing the U.S. Department of Labor's systems",
    "link": "https://www.newsbreak.com/share/3796596022539-us-judge-declines-to-block-elon-musk-s-doge-from-labor-department-systems?s=a2&share_destination_id=MTkzNzg4ODAyLTE3MzkwNzUxMzQ3MDc%3D&pd=0D77Jqs7&hl=en_US&send_time=1739075134&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v1%2Cns_foryou_rank_exp_25q1-v3%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_blend_exp_25q1-v4%2Cns_foryou_recall_exp_25q1-v8",
    "timestamp": "2025-02-09T04:26:14Z"
  },
  {
    "title": "Modi-Trump meet, Q3 earnings among 8 factors that could impact D-Street trade this week",
    "description": "Modi trump meet: Markets will watch for any comments from US President Trump on the economy and geopolitics, as Prime Minister Modi visits the USA next week for talks with Trump and US officials, potentially impacting stocks. Additionally, investors may favor…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/modi-trump-meet-q3-earnings-among-8-factors-that-could-impact-d-street-trade-this-week/articleshow/118082222.cms",
    "timestamp": "2025-02-09T04:12:47Z"
  },
  {
    "title": "A blueprint for sustainable peace: The White House and Middle East waters",
    "description": "The Abraham Accords represent an unprecedented opportunity to integrate water diplomacy and regional sustainable tourism into peacebuilding frameworks, transcending politics.",
    "link": "https://www.jpost.com/opinion/article-841214",
    "timestamp": "2025-02-09T04:07:32Z"
  },
  {
    "title": "Netanyahu should be prime minister for all Israel, not just Channel 14",
    "description": "Netanyahu is not just the prime minister of Channel 14 viewers. He’s the prime minister of all of us.",
    "link": "https://www.jpost.com/opinion/article-841236",
    "timestamp": "2025-02-09T04:03:23Z"
  },
  {
    "title": "PM Benjamin Netanyahu en route to Israel following US trip",
    "description": "Prime Minister Benjamin Netanyahu and his wife, Sara Netanyahu, have begun their trip back to Israel from the",
    "link": "https://www.jpost.com/breaking-news/article-841250",
    "timestamp": "2025-02-09T04:02:47Z"
  },
  {
    "title": "Donald Trump revokes security clearances for Biden's top diplomat Antony Blinken, security official Jake Sullivan",
    "description": "President Donald Trump has revoked security clearances for Antony Blinken and Jake Sullivan, alongside other key officials from the Biden administration. This move follows Trump's revocation of Joe Biden's access to intelligence briefings. The revocations sig…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-revokes-security-clearances-for-bidens-top-diplomat-antony-blinken-security-official-jake-sullivan/articleshow/118082140.cms",
    "timestamp": "2025-02-09T04:01:32Z"
  },
  {
    "title": "So far, so good for Ishiba — at least for now",
    "description": "It's safe to say, Ishiba’s visit to the U.S. went well. But we mustn't become complacent.",
    "link": "https://www.japantimes.co.jp/commentary/2025/02/09/japan/so-far-so-good-for-ishiba/",
    "timestamp": "2025-02-09T04:01:00Z"
  },
  {
    "title": "Billionaire Elon Musk says not interested in acquiring TikTok",
    "description": "Elon Musk has confirmed he has no interest in acquiring TikTok, a decision he made clear during a summit hosted by The WELT Group. Despite U.S. President Donald Trump's suggestion, Musk emphasized that he typically builds companies from scratch rather than pu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/billionaire-elon-musk-says-not-interested-in-acquiring-tiktok/articleshow/118082132.cms",
    "timestamp": "2025-02-09T04:00:30Z"
  },
  {
    "title": "Patrick Mahomes just keeps winning. He's not bothered with people who are mad about it",
    "description": "He's in his fifth Super Bowl and has won three of them already. He's won two MVP awards, three Super Bowl MVP awards, been named to the Pro Bowl six times and an All-Pro three times.",
    "link": "https://www.wdsu.com/article/patrick-mahomes-just-keeps-winning/63700160",
    "timestamp": "2025-02-09T03:51:17Z"
  },
  {
    "title": "Trump orders security access stripped from new list of enemies: ‘Bad guy. Take away his passes’ - NewsBreak",
    "description": "President Donald Trump has removed the security clearances from several more of his perceived enemies. Trump, who had already removed former President Joe",
    "link": "https://www.newsbreak.com/share/3797807211532-trump-orders-security-access-stripped-from-new-list-of-enemies-bad-guy-take-away-his-passes?s=a2&share_destination_id=MTQzOTU1NDUzLTE3MzkxNDQzMjU0OTE%3D&pd=09k1O9Aj&hl=en_US&send_time=1739144325&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v4%2Cns_foryou_rank_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v9",
    "timestamp": "2025-02-09T03:47:34Z"
  },
  {
    "title": "All The Times The Simpsons Correctly Predicted the Super Bowl",
    "description": "For more than 30 years, The Simpsons has been one of the most beloved TV shows of all time, recognized for its humor, heart, and ability to hold a mirror up to society, reflecting the world back to audiences through its zany lens. Since debuting in 1989, the …",
    "link": "http://comicbook.com/anime/news/all-the-times-the-simpsons-correctly-predicted-the-super-bowl/",
    "timestamp": "2025-02-09T03:46:21Z"
  },
  {
    "title": "A DOGE Origin Story: How Barack Obama Laid The Groundwork For Elon Musk",
    "description": "The U.S. Digital Service hired from the porn industry and a gender studies department, building a legion of queer activists. Now it's DOGE. Democrats thought they could shutter the Department of Government Efficiency before it even started, filing lawsuits th…",
    "link": "https://freerepublic.com/focus/f-news/4296151/posts",
    "timestamp": "2025-02-09T03:45:39Z"
  }
]