[
  {
    "title": "Backlash erupts after Ohio Democratic AG candidate posts about ‘killing’ Trump: 'Absolute psychopath'",
    "description": "Ohio Democratic attorney general candidate sparks fierce backlash after Facebook post saying he plans to \"kill Donald Trump\" through legal conviction.",
    "link": "https://www.foxnews.com/politics/backlash-erupts-after-ohio-democratic-ag-candidate-posts-about-killing-trump",
    "timestamp": "2026-01-28T15:02:10Z"
  },
  {
    "title": "Iran Ready For Dialogue With US, But Will Defend Itself if Pushed - Mission to UN",
    "description": "WASHINGTON (Sputnik) - Tehran is open to negotiations but will defend itself if provoked, Iran’s Mission to the UN said on Wednesday, responding to remarks by US President Donald Trump that US warships are heading toward Iran.",
    "link": "https://sputnikglobe.com/20260128/iran-ready-for-dialogue-with-us-but-will-defend-itself-if-pushed---mission-to-un-1123542732.html",
    "timestamp": "2026-01-28T15:01:41Z"
  },
  {
    "title": "What’s Going On With The US Dollar And How Does It Affect Bitcoin, Ethereum Prices?",
    "description": "The Bitcoin and Ethereum prices rallied after reports of the US dollar crashing spread across the market. Recent data show that the US dollar has fallen to its lowest level in four years, raising concerns about the strength of the world’s dominant reserve cur…",
    "link": "http://www.newsbtc.com/news/bitcoin/us-dollar-bitcoin-ethereum/",
    "timestamp": "2026-01-28T15:00:46Z"
  },
  {
    "title": "US sending ICE unit to Winter Olympics for security, prompting concern and confusion in Italy",
    "description": "The ICE agents deployed to Italy will have a different role from the one seen in immigration crackdowns in the U.S., per officials.",
    "link": "https://www.boston.com/sports/world-news/2026/01/28/us-sending-ice-unit-winter-olympics-security-concern-confusion-italy/",
    "timestamp": "2026-01-28T15:00:25Z"
  },
  {
    "title": "Tehran Erupts – Massive Protests Overnight – Trump Says Large Armada Is Heading to Iran",
    "description": "Tehran erupts overnight – massive protests against the Islamist regime.  The people are still standing.  After being bloodied and buried for a month, the people will not give up.\nThe post Tehran Erupts – Massive Protests Overnight – Trump Says Large Armada Is…",
    "link": "https://joehoft.com/tehran-erupts-massive-protests-overnight-trump-says-massive-armada-is-heading-to-iran/",
    "timestamp": "2026-01-28T15:00:11Z"
  },
  {
    "title": "IRS watchdog says some taxpayers could see 'greater challenges' during 2026 filing season",
    "description": "Some taxpayers could see \"greater challenges\" during the 2026 filing season, according to the national taxpayer advocate. Here's what filers need to know.",
    "link": "https://www.cnbc.com/2026/01/28/irs-tax-season-2026.html",
    "timestamp": "2026-01-28T15:00:01Z"
  },
  {
    "title": "‘Humanity needs to wake up’ to AI dangers, says Anthropic chief",
    "description": "Dario Amodei has posted a 20,000-word essay detailing potentially catastrophic risks from powerful technology in years to come",
    "link": "https://www.irishtimes.com/business/2026/01/28/humanity-needs-to-wake-up-to-ai-dangers-says-anthropic-chief/",
    "timestamp": "2026-01-28T15:00:00Z"
  },
  {
    "title": "Pressure Mounts on Iran as U.S. Warships Enter Region",
    "description": "A US aircraft carrier group arrived in the Middle East on January 27 as tensions mount over a possible strike against Iran after a brutal crackdown on protests that rights groups say killed thousands of people. Amid the turmoil, the Iranian currency, the rial…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/Pressure-Mounts-on-Iran-as-US-Warships-Enter-Region.html",
    "timestamp": "2026-01-28T15:00:00Z"
  },
  {
    "title": "Man arrested after spraying unknown substance on Rep. Ilhan Omar at Minneapolis town hall",
    "description": "Minneapolis police said officers saw the man use a syringe to spray an unknown liquid at Omar. They immediately arrested him and booked him at the county jail for third-degree assault.",
    "link": "https://www.pbs.org/newshour/politics/man-arrested-after-spraying-unknown-substance-on-rep-ilhan-omar-at-minneapolis-town-hall",
    "timestamp": "2026-01-28T14:59:20Z"
  },
  {
    "title": "‘I meant what I said in Davos’: Carney says he really is planning a Canada split with the U.S. along with 12 new trade deals",
    "description": "He also visibly rolled his eyes at Treasury Secretary Scott Bessent’s contention that he had walked back his comments at the World Economic Forum.",
    "link": "https://fortune.com/2026/01/28/carney-meant-what-he-said-in-davos-splitting-with-america-new-trade-deals/",
    "timestamp": "2026-01-28T14:56:41Z"
  },
  {
    "title": "Apple CEO Tim Cook Says “Deescalation” Needed In Minneapolis, Says He Shared His Views With Trump",
    "description": "Apple CEO Tim Cook weighed in on Donald Trump’s immigration crackdown in Minneapolis, which has led to further national outrage following federal agents killing of Alex Pretti. In a memo to employees, per Bloomberg, Cook said that it was “time for deescalatio…",
    "link": "http://deadline.com/2026/01/tim-cook-trump-alex-pretti-minneapolis-1236699887/",
    "timestamp": "2026-01-28T14:56:25Z"
  },
  {
    "title": "Donald Trump Has Callous Reaction to Rep. Ilhan Omar Being Sprayed By Unknown Substance",
    "description": "Donald Trump, the President, has reacted to the news that U.S. Democratic Representative Ilhan Omar was sprayed with an unknown substance during a town hall event that was all caught on video. The scary situation unfolded on Tuesday (January 27), where footag…",
    "link": "https://www.justjared.com/2026/01/28/donald-trump-has-callous-reaction-to-rep-ilhan-omar-being-sprayed-by-unknown-substance/",
    "timestamp": "2026-01-28T14:56:23Z"
  },
  {
    "title": "The Dispatch Warns Trump and GOP Have ‘Brought Our Country to the Verge of Something Awful and Unspeakable’",
    "description": "The Dispatch published a rare, unsparing editorial raking President Donald Trump and his \"enablers\" in the GOP over the coals on Wednesday.\nThe post The Dispatch Warns Trump and GOP Have ‘Brought Our Country to the Verge of Something Awful and Unspeakable’ fi…",
    "link": "https://www.mediaite.com/media/news/the-dispatch-warns-trump-and-gop-have-brought-our-country-to-the-verge-of-something-awful-and-unspeakable/",
    "timestamp": "2026-01-28T14:56:15Z"
  },
  {
    "title": "The Dangers of Undermining U.S. Civil–Military Relations",
    "description": "This is an important piece about the relationship between civilians and the president and the military. Worth reading to understand the level of manipulation the leftists are using to deny the country safety and security A fundamental element of U.S. civil–mi…",
    "link": "https://freerepublic.com/focus/f-news/4364366/posts",
    "timestamp": "2026-01-28T14:56:12Z"
  },
  {
    "title": "President Trump Calls For 'Ridiculous' Bill Belichick Hall of Fame Snub To Be Overturned",
    "description": "President Donald Trump is no stranger to wanting voting results overturned (see 2020 election) ... and he's singing a familiar tune with the Bill Belichick Hall of Fame snub -- calling the whole situation \"ridiculous.\" Nos. 45 and 47 weighed in on…\n Permalink",
    "link": "https://www.tmz.com/2026/01/28/donald-trump-bill-belichick-hall-of-fame-snub/",
    "timestamp": "2026-01-28T14:56:11Z"
  },
  {
    "title": "Fed to deliver first interest rate decision of the year as pressure from Trump mounts: Follow for live updates",
    "description": "Central bankers cut rates three times last year, but are cautious about lowering borrowing costs any further due to a weakening job market. President Donald Trump has said his pick for a new Fed Chair to replace Jerome Powell, whose term ends in May, will cut…",
    "link": "https://www.cnn.com/business/live-news/federal-reserve-interest-rate-01-28-2026",
    "timestamp": "2026-01-28T14:56:07Z"
  },
  {
    "title": "Brent, WTI Options On Longest Bullish Run Since 2024 as Iran Risk Looms",
    "description": "Open interest in Brent call options has accrued at the fastest pace this month in at least six years.",
    "link": "https://www.ndtvprofit.com/markets/oil-options-on-longest-bullish-run-since-2024-as-iran-risk-looms-10901742",
    "timestamp": "2026-01-28T14:55:22Z"
  },
  {
    "title": "Why Minneapolis Indictments Are Coming",
    "description": "Philadelphia D.A. Larry Krasner on the ins and outs of prosecuting crimes committed by law enforcement.\nThe post Why Minneapolis Indictments Are Coming appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/01/28/why-minneapolis-indictments-are-coming/",
    "timestamp": "2026-01-28T14:55:18Z"
  },
  {
    "title": "Man guilty of assault after Barron Trump reported attack to UK police",
    "description": "Donald Trump's son told officers he had seen the victim being beaten up during a video call in January 2025.",
    "link": "https://www.bbc.com/news/articles/cd6wpdpylj1o",
    "timestamp": "2026-01-28T14:54:59Z"
  },
  {
    "title": "Oil Options on Longest Bullish Run Since 2024 as Iran Risk Looms",
    "description": "Oil traders are paying a premium for bullish call options for the longest stretch in about 14 months as they huddle in the options market to protect against the risk of a new confrontation between the US and Iran.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-options-on-longest-bullish-run-since-2024-as-iran-risk-looms",
    "timestamp": "2026-01-28T14:54:54Z"
  },
  {
    "title": "Senate Democrat demands Trump fire 'creep' Stephen Miller in exchange for his DHS funding vote",
    "description": "Sen. Ruben Gallego, D-Ariz., is joined by Sen. Thom Tillis, R-N.C., in his disdain for White House Deputy Chief of Staff for Policy Stephen Miller.",
    "link": "https://www.foxnews.com/politics/senate-democrat-demands-trump-fire-creep-stephen-miller-exchange-his-dhs-funding-vote",
    "timestamp": "2026-01-28T14:52:20Z"
  },
  {
    "title": "Trump Threatens Iran: ‘Next Attack Will Be Far Worse’",
    "description": "President Donald Trump issued a warning to the Iranian regime, reminding the leaders of past U.S. strikes on Iran and threatening the “next attack will be far worse” if the... Read More\nThe post Trump Threatens Iran: ‘Next Attack Will Be Far Worse’  appeared …",
    "link": "https://www.dailysignal.com/2026/01/28/trump-threatens-iran-next-attack-will-be-far-worse/",
    "timestamp": "2026-01-28T14:52:00Z"
  },
  {
    "title": "Make deal or 'worse' attack to come, Trump tells Iran",
    "description": "US President Donald Trump has urged Iran to come to the table and make a deal on nuclear weapons or the next attack by the United States could be far worse.",
    "link": "https://www.rte.ie/news/world/2026/0128/1555581-iran/",
    "timestamp": "2026-01-28T14:51:49Z"
  },
  {
    "title": "LAMB OF GOD's RANDY BLYTHE Slams TRUMP Administration, ICE & All The Other Scumbags: \"Fuck The Fascists. Do Not Comply\"",
    "description": "\"Like most of you… I am tired, y'all. So goddamned tired. The open moral collapse of all three branches our government is utterly exhausting.\"\nThe post LAMB OF GOD's RANDY BLYTHE Slams TRUMP Administration, ICE & All The Other Scumbags: \"Fuck The Fascists. Do…",
    "link": "https://metalinjection.net/news/lamb-of-gods-randy-blythe-slams-trump-administration-ice-all-the-other-scumbags-fuck-the-fascists-do-not-comply",
    "timestamp": "2026-01-28T14:50:57Z"
  },
  {
    "title": "Trump May Soon Have an Airport Named After Him",
    "description": "“President Donald Trump already has a street named after him in Palm Beach — and the airport could be next,” Politico reports. “State senators took the first step toward renaming ‘Palm Beach International Airport’ as ‘Donald J. Trump International Airport’ on…",
    "link": "https://politicalwire.com/2026/01/28/trump-may-soon-have-an-airport-named-after-him/",
    "timestamp": "2026-01-28T14:50:51Z"
  },
  {
    "title": "Trump Ally Shocked at President's 'Psychological State' in Private Meeting (Leigh Kimmins/The Daily Beast)",
    "description": "Leigh Kimmins / The Daily Beast:\nTrump Ally Shocked at President's ‘Psychological State’ in Private Meeting  —  FRESH CONCERN  —  European leader came out of a meeting with the U.S. president “traumatized” by his state of mind.  —  A key European ally of Dona…",
    "link": "https://www.memeorandum.com/260128/p40",
    "timestamp": "2026-01-28T14:50:01Z"
  },
  {
    "title": "Holidays and a viral bear cup drive strong quarterly sales at Starbucks",
    "description": "Starbucks reported stronger-than-expected sales in its fiscal first quarter as holiday drinks and a viral bear cup helped drive sales",
    "link": "https://abcnews.go.com/Business/wireStory/holidays-viral-bear-cup-drive-strong-quarterly-sales-129629809",
    "timestamp": "2026-01-28T14:49:05Z"
  },
  {
    "title": "Tyler, The Creator Calls Out ICE Again, Shares 'Paid In Full' Clip: \"F**k Ice”",
    "description": "The Grammy-winning rapper condemned ICE and “anyone that voted for that man” via his Instagram Stories. See the post here.",
    "link": "https://www.rap-up.com/article/tyler-the-creator-condemns-ice-paid-in-full-clip",
    "timestamp": "2026-01-28T14:49:04Z"
  },
  {
    "title": "Watch Live: Breitbart News at Trump Accounts Summit",
    "description": "Breitbart News speaks with members of the Trump White House and lawmakers at a summit to detail the Trump accounts on Wednesday, January 28.\nThe post Watch Live: Breitbart News at Trump Accounts Summit appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/28/watch-live-breitbart-news-at-trump-accounts-summit/",
    "timestamp": "2026-01-28T14:47:59Z"
  },
  {
    "title": "Kristen Stewart says she’ll likely leave US after Trump’s ‘terrifying’ threats",
    "description": "Twilight star Kristen Stewart has said she would consider leaving the US because of Donald Trump’s “terrifying” threats to the film industry. Stewart, who recently said she would be drawn to the idea of remaking Twilight with a “huge budget and a bunch of lov…",
    "link": "https://www.thepinknews.com/2026/01/28/kristen-stewart-says-shell-likely-leave-us-after-trumps-terrifying-threats/",
    "timestamp": "2026-01-28T14:47:30Z"
  },
  {
    "title": "WATCH LIVE: Secretary of State Marco Rubio to Give First Public Testimony on Venezuela Policy Since Maduro Ouster Before Senate Committee",
    "description": "Secretary of State Marco Rubio will sit for testimony before the Senate Foreign Relations Committee this morning to discuss the Trump Administration’s policy on Venezuela.  This is Rubio’s first public testimony since the Trump Administration’s arrest of Vene…",
    "link": "https://www.thegatewaypundit.com/2026/01/watch-live-secretary-state-marco-rubio-give-first/",
    "timestamp": "2026-01-28T14:45:32Z"
  },
  {
    "title": "In six violent encounters, evidence contradicts Trump immigration officials' narratives (Reuters)",
    "description": "Reuters:\nIn six violent encounters, evidence contradicts Trump immigration officials' narratives  —  U.S. President Donald Trump's top immigration officials have repeatedly made statements after violent encounters involving federal agents - including two fata…",
    "link": "https://www.memeorandum.com/260128/p39",
    "timestamp": "2026-01-28T14:45:03Z"
  },
  {
    "title": "CNN polling guru predicts a humiliating opening box office for Melania documentary",
    "description": "‘Melania’ is projected to earn between $1 million and $5 million opening weekend — after Amazon spent $75 million to acquire and promote it",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/melania-opening-box-office-prediction-b2909414.html",
    "timestamp": "2026-01-28T14:44:04Z"
  },
  {
    "title": "ICE agent's chilling threat to Minnesota civilian if they raised their voice caught on camera",
    "description": "An ICE agent was filmed threatening a citizen after they raised their voice at him",
    "link": "https://www.ladbible.com/news/us-news/ice-agent-threat-minnesota-resident-erase-voice-viral-666735-20260128",
    "timestamp": "2026-01-28T14:43:54Z"
  },
  {
    "title": "US unblocks Venezuelan assets – interim president",
    "description": "The US has unblocked some of Venezuela’s frozen assets, acting President Delcy Rodriguez has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631663-us-unblocks-venezuela-assets/",
    "timestamp": "2026-01-28T14:43:40Z"
  },
  {
    "title": "The ‘Melania’ Documentary Is Shaping Up To Be One Of The Biggest Box Office Bombs In The History Of Mankind And The Moving Image",
    "description": "Melania, the Brett Ratner directed documentary about former adult entertainment model and current First Lady Melania Trump, is shaping up to be one of the biggest bombs in the history of the art form known as cinema. While the film premieres in over 2,000 mov…",
    "link": "https://brobible.com/culture/article/melania-documentary-ticket-sales/",
    "timestamp": "2026-01-28T14:42:49Z"
  },
  {
    "title": "PhonePe IPO: Can the fintech giant convince markets it’s about more than payments?",
    "description": "According to the updated draft IPO papers filed last week, the contribution of payments to the Walmart-owned firm’s operating revenues declined to 86.92% in H1FY26 from 92.32% a year prior, as newer verticals like lending and insurance scaled faster. While st…",
    "link": "https://economictimes.indiatimes.com/tech/technology/phonepe-ipo-can-the-fintech-giant-convince-markets-its-about-more-than-payments/articleshow/127713359.cms",
    "timestamp": "2026-01-28T14:42:13Z"
  },
  {
    "title": "Gunmen kill three policemen in ambush in Nigeria's Katsina state",
    "description": "MAIDUGURI, Nigeria, Jan 28 (Reuters) - Three police ‌officers were killed and two others wounded when ‌suspected armed gang members ambushed a routine patrol in northwest Nigeria's Katsina state on Tuesday, the police said on Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/28/gunmen-kill-three-policemen-in-ambush-in-nigeria039s-katsina-state",
    "timestamp": "2026-01-28T14:42:00Z"
  },
  {
    "title": "Should Europe worry about euro strength and dollar weakness?",
    "description": "The euro has reached its highest level against the US dollar since 2021. That has consequences for European companies and consumers, but few think the European Central Bank should intervene yet. The US dollar continues to fall sharply in value against other m…",
    "link": "https://www.dw.com/en/should-europe-worry-about-euro-strength-and-dollar-weakness/a-75696199",
    "timestamp": "2026-01-28T14:42:00Z"
  },
  {
    "title": "‘PLAYING WITH FIRE!’ Trump torches Minneapolis Mayor Jacob Frey after ‘very good conversation’ turns bad",
    "description": "'Could somebody in his inner sanctum please explain that this statement is a very serious violation of the Law'",
    "link": "https://www.wnd.com/2026/01/playing-fire-trump-torches-minneapolis-mayor-jacob-frey/",
    "timestamp": "2026-01-28T14:41:40Z"
  },
  {
    "title": "Disasters of politics and technology",
    "description": "40 years ago this morning, the space shuttle Challenger disintegrated a little more than a minute into its flight.. Old man thought: The time that has passed since then is almost exactly the same as the time between that morning and the end of World War II, w…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/disasters-of-politics-and-technology",
    "timestamp": "2026-01-28T14:41:29Z"
  },
  {
    "title": "Holidays and a viral bear cup drive strong quarterly sales at Starbucks",
    "description": "Starbucks reported stronger-than-expected sales in its fiscal first quarter as holiday drinks and a viral bear cup helped drive sales.",
    "link": "https://www.bostonherald.com/2026/01/28/starbucks-earnings-boosted-bear-cup/",
    "timestamp": "2026-01-28T14:38:55Z"
  },
  {
    "title": "Alleged Ilhan Omar Attacker Warned Neighbor He ‘Might Get Arrested’ Ahead of Confronting Congresswoman",
    "description": "The alleged man who attacked Rep. Ilhan Omar (D-MN) at a town hall warned a neighbor ahead of the event that he \"might get arrested.\"\nThe post Alleged Ilhan Omar Attacker Warned Neighbor He ‘Might Get Arrested’ Ahead of Confronting Congresswoman first appeare…",
    "link": "https://www.mediaite.com/media/news/alleged-ilhan-omar-attacker-warned-neighbor-he-might-get-arrested-ahead-of-confronting-congresswoman/",
    "timestamp": "2026-01-28T14:37:51Z"
  },
  {
    "title": "Jimmy Kimmel Slams ‘Melania’ Doc as ‘$75 Million Bribe Amazon Made for Her,’ Refuses to Believe Donald Trump Likes the Movie: ‘He Saw the First Eight Minutes and Fell Asleep’",
    "description": "Jimmy Kimmel is always targeting Donald Trump in his monologues on “Jimmy Kimmel Live,” but his latest one took aim at Trump’s wife, Melania, ahead of her eponymous documentary opening in theaters nationwide. Directed by Brett Ratner, “Melania” is being distr…",
    "link": "https://variety.com/2026/film/news/jimmy-kimmel-melania-documentary-bribe-amazon-1236643268/",
    "timestamp": "2026-01-28T14:37:09Z"
  },
  {
    "title": "BBC announces interim director general",
    "description": "Rhodri Talfan Davies, who led BBC Cymru Wales from 2011 to 2020, will begin the new role on 3 April until a new, permanent director general starts work.",
    "link": "https://news.sky.com/story/bbc-announces-interim-director-general-13500196",
    "timestamp": "2026-01-28T14:37:00Z"
  },
  {
    "title": "‘Had Herself Sprayed’: Trump Dismisses Omar Town Hall Attack",
    "description": "President Donald Trump said that Rep. Ilhan Omar, D-Minn., “probably had herself sprayed” after the congresswoman was attacked by a man with a syringe at... Read More\nThe post ‘Had Herself Sprayed’: Trump Dismisses Omar Town Hall Attack appeared first on The …",
    "link": "https://www.dailysignal.com/2026/01/28/had-herself-sprayed-trump-dismisses-omar-town-hall-attack/",
    "timestamp": "2026-01-28T14:36:53Z"
  },
  {
    "title": "Will Trump Bomb Iran Again?",
    "description": "Iranian protests have exposed the regime's fragility, and its future hangs in the balance.",
    "link": "https://www.jezebel.com/will-trump-bomb-iran-again",
    "timestamp": "2026-01-28T14:36:42Z"
  },
  {
    "title": "‘That’s Just Not True!’ CNN’s Elie Honig Clashes With Tiffany Cross Over Charlie Kirk",
    "description": "CNN's Elie Honig was stunned by Tiffany Cross's claim that Tyler Robinson, the man accused of assassinating Charlie Kirk, was \"right-wing.\"\nThe post ‘That’s Just Not True!’ CNN’s Elie Honig Clashes With Tiffany Cross Over Charlie Kirk first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/thats-just-not-true-cnns-elie-honig-clashes-with-tiffany-cross-over-charlie-kirk/",
    "timestamp": "2026-01-28T14:35:38Z"
  },
  {
    "title": "India, Canada to Anchor Trade in Energy, Critical Minerals",
    "description": "Canadian officials are liaising with international partners to create new frameworks for critical minerals trade.",
    "link": "https://www.ndtvprofit.com/economy/india-canada-to-anchor-trade-in-energy-critical-minerals-10901570",
    "timestamp": "2026-01-28T14:34:48Z"
  },
  {
    "title": "Why Greenland Matters",
    "description": "The announcement of a skeletal agreement between US President Donald Trump and NATO Secretary-General Mark Rutte was good news, even if it turns out to be a fig leaf for a failed land grab. The brouhaha over Trump’s rhetoric was obscuring what is a genuinely …",
    "link": "https://www.project-syndicate.org/commentary/why-greenland-matters-by-michael-froman-2026-01",
    "timestamp": "2026-01-28T14:33:50Z"
  },
  {
    "title": "S&P 500 Hits 7000 Ahead of Big Tech Earnings",
    "description": "The Dow, S&P 500, and Nasdaq are rising as the stock market braces for the Federal Reserve's latest decision on interest rates.",
    "link": "https://www.barrons.com/livecoverage/stock-market-news-today-012826",
    "timestamp": "2026-01-28T14:32:42Z"
  },
  {
    "title": "Watchdog Contradicts DHS Story",
    "description": "A CBP watchdog report challenges DHS statements about Alex Pretti’s behavior before officers fatally shot him.",
    "link": "https://reason.com/2026/01/28/watchdog-contradicts-dhs-story/",
    "timestamp": "2026-01-28T14:31:28Z"
  },
  {
    "title": "The Unsettling Experience of Reporting on Trump’s Health",
    "description": "What was it like interviewing Donald Trump about his health? Chatting with Intelligencer’s Ben Terris about a surreal reporting experience.",
    "link": "http://nymag.com/intelligencer/article/what-it-was-like-reporting-on-donald-trumps-health.html",
    "timestamp": "2026-01-28T14:31:26Z"
  },
  {
    "title": "Rap artist Nicki Minaj pledges support for Trump accounts",
    "description": "Minaj will attend a summit Wednesday with President Donald Trump and Treasury Secretary Scott Bessent to promote Trump accounts.",
    "link": "https://www.cnbc.com/2026/01/28/trump-accounts-nicki-minaj.html",
    "timestamp": "2026-01-28T14:30:22Z"
  },
  {
    "title": "This Trump-linked firm is hoarding Bitcoin instead of selling: What’s the play?",
    "description": "As Bitcoin trades 28% below its 2025 peak, American Bitcoin Corp. used the pullback to expand its reserves.",
    "link": "https://ambcrypto.com/this-trump-linked-firm-is-hoarding-bitcoin-instead-of-selling-whats-the-play/",
    "timestamp": "2026-01-28T14:30:01Z"
  },
  {
    "title": "Ilhan Omar backed by House Republicans after Minnesota town hall attack",
    "description": "GOP lawmakers from across the ideological spectrum condemned the attack on Rep. Ilhan Omar after a man confronted the Minnesota Democrat and sprayed a substance during her public event.",
    "link": "https://www.foxnews.com/politics/ilhan-omar-backed-house-republicans-after-minnesota-town-hall-attack",
    "timestamp": "2026-01-28T14:29:59Z"
  },
  {
    "title": "Exclusive: Leaked “Board of Peace” Resolution Outlines U.S.-Led Plan to Rule Over Gaza",
    "description": "The so-called Board of Peace that President Donald Trump officially launched in Davos, Switzerland last week is developing sweeping plans for a U.S.-backed administration to rule Gaza, according to a draft of the Board’s resolution.\nDrop Site obtained the uns…",
    "link": "https://www.globalresearch.ca/leaked-board-peace-resolution-outlines-us-led-plan-rule-over-gaza/5913869",
    "timestamp": "2026-01-28T14:29:31Z"
  },
  {
    "title": "President Trump calls Bill Belichick's Hall of Fame snub 'ridiculous'",
    "description": "After Bill Belichick didn't make the cut for Pro Football Hall of Fame, Donald Trump said the decision \"should be overturned\" in a social media post.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_58a8dcc0-a2e7-45a6-b1a0-cc413efa9fb0",
    "timestamp": "2026-01-28T14:28:43Z"
  },
  {
    "title": "Ilhan Omar Sprayed With Unknown Substance at Town Hall; Trump Blames Congresswoman For …",
    "description": "Reading Time: 2 minutesCongresswoman Ilhan Omar was targeted in a bizarre attack on Tuesday night.\nIlhan Omar Sprayed With Unknown Substance at Town Hall; Trump Blames Congresswoman For … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/01/ilhan-omar-sprayed-with-unknown-substance-at-town-hall-trump-blames-congresswoman-for-attack/",
    "timestamp": "2026-01-28T14:24:53Z"
  },
  {
    "title": "Trump’s ‘Board of Peace’ Is the Nail in Gaza’s Coffin",
    "description": "US President Donald Trump has declared the three-month “ceasefire” in Gaza a great success, and now wants to move on to phase two of his so-called “peace plan”.\nWhat does success look like? Israeli soldiers have killed more than 460 …\nThe post Trump’s ‘Board …",
    "link": "https://www.globalresearch.ca/trumps-board-of-peace-is-the-nail-in-gazas-coffin/5913799",
    "timestamp": "2026-01-28T14:23:01Z"
  },
  {
    "title": "The dollar could have further to fall as its decline creates a 'double-edged sword' for America",
    "description": "The U.S. dollar fell on Tuesday after President Donald Trump insisted the currency — which declined notably last year — is doing \"great.\"",
    "link": "https://www.cnbc.com/2026/01/28/us-dollar-usd-greenback-dxy-sell-america-bear-market-bubble.html",
    "timestamp": "2026-01-28T14:22:49Z"
  },
  {
    "title": "BRICS Agenda, United States Global Dominance and Africa’s Development Priorities",
    "description": "Donald Trump has been leading the United States as its president since January 2025. Washington’s priority is to Make America Great Again (MAGA). Trump’s tariffs have rippled many economies from Latin America through Asian region to the continent of Africa. ……",
    "link": "https://www.globalresearch.ca/brics-agenda-united-states-global-dominance-africa-development-priorities/5913635",
    "timestamp": "2026-01-28T14:22:19Z"
  },
  {
    "title": "Selected Articles: Are We Witnessing America’s Slow Unraveling? Trump Seeks “The Weaponization of Federal Institutions”",
    "description": "Are We Witnessing America’s Slow Unraveling? Trump Seeks “The Weaponization of Federal Institutions”\nBy Drago Bosnic, January 27, 2026\nThe latest chaos in the world’s most aggressive country suggests that divisions between states and the federal center are an…",
    "link": "https://www.globalresearch.ca/selected-articles-america-slow-unraveling-trump-seeks-weaponizaton-federal-institutions/5913902",
    "timestamp": "2026-01-28T14:21:08Z"
  },
  {
    "title": "Design proposals for Trump's Dulles International Airport overhaul include Zaha Hadid Architects, Adjaye Associates, Grimshaw",
    "description": "Competing design proposals have been unveiled for a new terminal at Washington Dulles International Airport. Last month, President Trump called for a rebuilding of the airport, reportedly calling the existing Eero Saarinen facilities “terrible” and “incorrect…",
    "link": "https://archinect.com/news/article/150521848/design-proposals-for-trump-s-dulles-international-airport-overhaul-include-zaha-hadid-architects-adjaye-associates-grimshaw",
    "timestamp": "2026-01-28T14:21:00Z"
  },
  {
    "title": "Design proposals for Dulles International Airport overhaul include Zaha Hadid Architects, Adjaye Associates, Grimshaw",
    "description": "Competing design proposals have been unveiled for a new terminal at Washington Dulles International Airport. Last month, President Trump called for a rebuilding of the airport, reportedly calling the existing facilities “terrible” and “incorrectly designed.” …",
    "link": "https://archinect.com/news/article/150521848/design-proposals-for-dulles-international-airport-overhaul-include-zaha-hadid-architects-adjaye-associates-grimshaw",
    "timestamp": "2026-01-28T14:21:00Z"
  },
  {
    "title": "Anti-immigration AfD party wants to bring ICE to Germany",
    "description": "The far-right party's Bavarian chapter is further intensifying its hard-line anti-immigration stance in calling for an authoritarian police force similar to the US's Immigration and Customs Enforcement agency.",
    "link": "https://www.thelocal.de/20260128/anti-immigration-afd-party-wants-to-bring-ice-to-germany",
    "timestamp": "2026-01-28T14:19:32Z"
  },
  {
    "title": "Trump Says Rep. Ilhan Omar 'Had Herself Sprayed' in Minneapolis Attack",
    "description": "President Donald Trump says he has his doubts about the strange syringe attack on Rep. Ilhan Omar Tuesday night ... claiming she \"probably\" set the incident up herself! We told you all about it -- the Democratic congresswoman representing…",
    "link": "https://www.tmz.com/2026/01/28/trump-says-ilhan-omar-had-herself-sprayed/",
    "timestamp": "2026-01-28T14:19:24Z"
  },
  {
    "title": "Trump warns Iran time is running out for nuclear deal, says U.S. armada ready for 'violence'",
    "description": "Time is running out for Iran to make a deal, President Donald Trump warned Wednesday, as he urged the Islamic Republic to negotiate on nuclear weapons or face the force of a “massive armada” of American ships.“Like with Venezuela, it is, ready, willing, and a…",
    "link": "https://www.nbcnews.com/world/iran/iran-nuclear-deal-trump-armada-ships-venezuela-violence-rcna256287",
    "timestamp": "2026-01-28T14:18:54Z"
  },
  {
    "title": "Trump delayed strikes on Iran because US didn't have assets in place for larger war: Expert",
    "description": "Middle East expert Trita Parsi has warned that a potential US military confrontation with Iran remains a real possibility amid escalated tensions between the two countries, noting that while war is not \"off the table\", any such conflict would come at a high p…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-delayed-strikes-on-iran-because-us-didnt-have-assets-in-place-for-larger-war-expert/articleshow/127712109.cms",
    "timestamp": "2026-01-28T14:17:03Z"
  },
  {
    "title": "Iran and its proxies threaten retaliation against US and Israel amid US military buildup",
    "description": "Tehran and its regional proxy groups have threatened retaliation against the United States and Israel as Washington moves additional military assets into the Middle East after the regime’s lethal crackdown on protesters. Regime-affiliated outlets and proxy le…",
    "link": "https://www.longwarjournal.org/archives/2026/01/iran-and-its-proxies-threaten-retaliation-against-us-and-israel-amid-us-military-buildup.php",
    "timestamp": "2026-01-28T14:14:53Z"
  },
  {
    "title": "Dem leader makes case for how 'pathological liar' Noem could be impeached: 'We can do it'",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) condemned Homeland Security Secretary Kristi Noem as he threatened to impeach her if President Donald Trump did not remove her. The DHS secretary has fallen under heavy criticism for overseeing an immigration surge…",
    "link": "https://www.rawstory.com/impeach-kristi-noem-liar/",
    "timestamp": "2026-01-28T14:13:50Z"
  },
  {
    "title": "US Fed expected to keep interest rates steady",
    "description": "The US Federal Reserve opened its two-day policy meeting yesterday, poised to keep interest rates unchanged as officials gauge the health of the jobs market and try to manage stubborn inflation.",
    "link": "https://www.rte.ie/news/business/2026/0128/1555574-us-fed-expected-to-keep-interest-rates-steady/",
    "timestamp": "2026-01-28T14:13:00Z"
  },
  {
    "title": "TikTok is suppressing ‘content critical of President Trump’ in the US, California governor claims – as investigation looks into whether it 'violates' state law",
    "description": "California Governor Gavin Newsom is launching a review of TikTok's potential violations after more users are reporting anti-Trump censorship.",
    "link": "https://www.techradar.com/computing/tiktok/tiktok-is-suppressing-content-critical-of-president-trump-in-the-us-california-governor-claims-as-investigation-looks-into-whether-it-violates-state-law",
    "timestamp": "2026-01-28T14:11:41Z"
  },
  {
    "title": "‘Davos of Latin America’ Sets Up Test of Lula’s Regional Clout",
    "description": "Brazil’s Luiz Inacio Lula da Silva returned to power vowing to revive South American political and economic unity. A regional event this week shows he’s now fighting to maintain clout in his own backyard.",
    "link": "https://financialpost.com/pmn/business-pmn/davos-of-latin-america-sets-up-test-of-lulas-regional-clout",
    "timestamp": "2026-01-28T14:08:47Z"
  },
  {
    "title": "Trump tells Iran 'time running out' for nuclear deal",
    "description": "Iran is back in US President Donald Trump's focus after he appears to have rolled back his threats over Greenland. This time, German Chancellor Merz also said the Iranian government's \"days are numbered.\" US President Donald Trump again issued threats against…",
    "link": "https://www.dw.com/en/trump-tells-iran-time-running-out-for-nuclear-deal/a-75698178",
    "timestamp": "2026-01-28T14:08:00Z"
  },
  {
    "title": "Trump makes new threats against Iran over nuclear deal",
    "description": "Iran is back in US President Donald Trump's focus after he appears to have rolled back his threats over Greenland.",
    "link": "https://www.dw.com/en/trump-makes-new-threats-against-iran-over-nuclear-deal/a-75698178",
    "timestamp": "2026-01-28T14:08:00Z"
  },
  {
    "title": "‘Whoa!’ Trump Fan Stunned When Tiffany Cross Hits Him With ‘Personal Attack’ in CNN Brawl",
    "description": "Tiffany Cross stunned prominent Trump fan Kevin O’Leary with a jab that made anchor Abby Phillip step in to say \"Let's not make personal attacks.\"\nThe post ‘Whoa!’ Trump Fan Stunned When Tiffany Cross Hits Him With ‘Personal Attack’ in CNN Brawl first appeare…",
    "link": "https://www.mediaite.com/media/news/whoa-trump-fan-stunned-when-tiffany-cross-hits-him-with-personal-attack-in-cnn-brawl/",
    "timestamp": "2026-01-28T14:07:40Z"
  },
  {
    "title": "Trump threatens Iran with 'major destruction' as US fleet arrives in Gulf",
    "description": "The US president says Tehran should make a deal or face military strikes as tensions between the two countries escalates.",
    "link": "https://www.abc.net.au/news/2026-01-29/us-donald-trump-threatens-iran-with-major-destruction/106280948",
    "timestamp": "2026-01-28T14:07:39Z"
  },
  {
    "title": "Trump Tells Iran ‘Massive Armada’ Is Heading Its Way As He Urges Nuclear Deal",
    "description": "The president said a large fleet was headed towards Iran.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2026/01/28/trump-tells-iran-massive-armada-is-heading-its-way-as-he-urges-nuclear-deal/",
    "timestamp": "2026-01-28T14:06:41Z"
  },
  {
    "title": "Trump lashes out at 'loser' Republican senators who confronted him about Kristi Noem",
    "description": "President Donald Trump was defiant when confronted about Republican senators calling for him to dismiss Homeland Security Secretary Kristi Noem.According to ABC News correspondent Rachel Scott questioned the president about Sens. Thom Tillis (R-NC) and Lisa M…",
    "link": "https://www.rawstory.com/trump-noem-loser-gop-senators/",
    "timestamp": "2026-01-28T14:05:03Z"
  },
  {
    "title": "Don't Kid Yourself: Trump Is Just Trying To Placate Senate Democrats",
    "description": "Pay attention. Trump is trying to convince us that he's a reasonable man so he can soften the plans by Senate Dems to use the budget process to put new restraints on DHS. He's playing dumb: \"I didn't know what the people I hired and talk to ten times a day we…",
    "link": "https://crooksandliars.com/2026/01/dont-kid-yourself-trump-just-trying",
    "timestamp": "2026-01-28T14:03:33Z"
  },
  {
    "title": "Man Who Sprayed Ilhan Omar at Town Hall Was Huge Fan of Trump",
    "description": "The man who attacked Representative Ilhan Omar by spraying an unknown substance appears to have been a big supporter of Donald Trump and MAGA. Anthony Kazmierczak, 55, followed multiple right-wing accounts on X, including Libs of TikTok, Charlie Kirk, Ben Sha…",
    "link": "https://newrepublic.com/post/205795/who-attacked-ilhan-omar-town-hall-fan-trump",
    "timestamp": "2026-01-28T14:03:30Z"
  },
  {
    "title": "Tensions Rising between the US and Canada",
    "description": "As the USMCA— the free trade agreement between Mexico, the United States, and Canada—review approaches, the relationship between Washington and Ottawa becomes more strained, with the latest incident being the exchange of statements between Canadian Prime Mini…",
    "link": "https://www.globalresearch.ca/tensions-rising-between-the-us-and-canada/5913859",
    "timestamp": "2026-01-28T14:03:08Z"
  },
  {
    "title": "US Democrats call for Trump to fire Homeland Security chief",
    "description": "Top House Democrats have threatened to impeach US Homeland Security Secretary Kristi Noem if Donald Trump doesn’t fire her\n\n  Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631654-democrats-noem-impeachment/",
    "timestamp": "2026-01-28T14:01:38Z"
  },
  {
    "title": "President Trump Determined 66 Organizations “Contrary to the Interests of the US”",
    "description": "President Donald Trump issued Executive Order No. 14199 entitled “Withdrawing the United States from International Organizations, Conventions or Treaties that are Contrary to the Interests of the United States.” \nThe post President Trump Determined 66 Organiz…",
    "link": "https://www.globalresearch.ca/president-determined-66-organizations-contrary-interests-us/5913829",
    "timestamp": "2026-01-28T14:00:18Z"
  },
  {
    "title": "The Anti-Fascist Group Fighting Trump — And Some Critics on the Left",
    "description": "Refuse Fascism has been ready for years to meet this moment — but have its ties to a former 1960s radical become an albatross hampering its ambitious agenda?",
    "link": "http://www.rollingstone.com/politics/politics-features/antifa-crackdown-refuse-fascism-1235504152/",
    "timestamp": "2026-01-28T14:00:00Z"
  },
  {
    "title": "Does TikTok's new terms of service allow app to track sensitive info like immigration status?",
    "description": "A review of the app's former privacy policy revealed it has tracked this information for a while.",
    "link": "https://www.snopes.com//news/2026/01/28/tiktok-gender-immigration-tracking/",
    "timestamp": "2026-01-28T14:00:00Z"
  },
  {
    "title": "SoftBank mulls new $30bn OpenAI investment",
    "description": "Japanese giant already owns around 11% of the ChatGPT firmSoftBank invested $30bn in OpenAI in 2025 as part of Masayoshi Son’s AI visionOpenAI chief Sam Altman…",
    "link": "https://www.telecomtv.com/content/digital-platforms-services/softbank-mulls-new-30bn-openai-investment-54733/",
    "timestamp": "2026-01-28T13:58:14Z"
  },
  {
    "title": "Trump health fears escalate as prominent ally left ‘traumatized’ after meeting - NewsBreak",
    "description": "Slovakia's Prime Minister Robert Fico, a vocal Trump supporter, was reportedly left shocked after meeting the US president in Florida, with EU sources clai",
    "link": "https://www.newsbreak.com/share/4464254893653-trump-health-fears-escalate-as-prominent-ally-left-traumatized-after-meeting?_f=app_share&amp;pd=0J5ihv1Q&amp;lang=en_US&amp;send_time=1769608592&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.1.11%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-28T13:57:30Z"
  },
  {
    "title": "Man arrested after spraying unknown substance on Rep. Ilhan Omar at Minneapolis town hall",
    "description": "Omar continued the town hall after he was ushered out of the room.",
    "link": "https://www.bostonherald.com/2026/01/28/ilhan-omar-sprayed-unknown-substance/",
    "timestamp": "2026-01-28T13:54:40Z"
  }
]