[
  {
    "title": "CNN analyst refers to event honoring Americans slain by illegal migrants as 'so-called Angel Moms'",
    "description": "CNN reporter Seung Min Kim appeared to scoff at President Donald Trump's tribute to families killed by illegal immigrants a \"so-called Angel Moms\" event.",
    "link": "https://www.foxnews.com/media/cnn-analyst-appears-downplay-trump-event-so-called-angel-moms-americans-slain-illegal-migrants",
    "timestamp": "2026-02-25T12:30:35Z"
  },
  {
    "title": "2026 — Donald Trump — State of the Union — In Person (Donald Trump/Roll Call)",
    "description": "Donald Trump / Roll Call:\n2026 — Donald Trump — State of the Union — In Person  —  Full transcript of Donald Trump's State of the Union on February 24, 2026 (10,617 words).  In Person.",
    "link": "https://www.memeorandum.com/260225/p13",
    "timestamp": "2026-02-25T12:30:01Z"
  },
  {
    "title": "Is Connor Hellebuyck playing tonight? Jets' goalie return timeline from Olympics gains clarity",
    "description": "He was in top form at the Olympics.",
    "link": "https://www.sportingnews.com/us/nhl/winnipeg-jets/news/connor-hellebuyck-playing-tonight-jets-goalie-return-timeline-olympics/b320171e0473113e97ad4557",
    "timestamp": "2026-02-25T12:28:00Z"
  },
  {
    "title": "Venice Biennale Announces Participating Artists, Christophe Leribault Poised to Replace Ousted Louvre President: Morning Links for February 25, 2026",
    "description": "Christophe Leribault Poised to Replace Ousted Louvre President",
    "link": "https://www.artnews.com/art-news/news/venice-biennale-announces-participating-artists-christophe-leribault-poised-to-replace-ousted-louvre-president-morning-links-for-february-25-2026-1234774514/",
    "timestamp": "2026-02-25T12:27:45Z"
  },
  {
    "title": "Why is Mike Tindall wearing a red ‘Make England Great Again’ hat?",
    "description": "The Six Nations rugby tournament began earlier this month, and on Saturday, the Princess of Wales made her first appearance to support her patronage, England’s rugby team. She was sent out specifically to distract from Prince Andrew’s arrest. Somewhat hilario…",
    "link": "https://www.celebitchy.com/963909/why_is_mike_tindall_wearing_a_red_make_england_great_again_hat/",
    "timestamp": "2026-02-25T12:27:07Z"
  },
  {
    "title": "Key Takeaways From Trump's 2026 State of the Union Address",
    "description": "At nearly two hours, President Donald Trump delivered the longest State of the Union in history, touting his polices, taking shots at Democrats and the Supreme Court, focusing on his immigration crackdown, and sending a warning to Iran. The biggest bipartisan…",
    "link": "https://www.today.com/video/trump-touts-wins-slams-dems-and-scotus-in-state-of-the-union-258261573856",
    "timestamp": "2026-02-25T12:26:36Z"
  },
  {
    "title": "These bitcoin-linked stocks are doing better than BTC",
    "description": "The day ahead in crypto: Feb. 25, 2026",
    "link": "https://www.coindesk.com/daybook-us/2026/02/25/these-bitcoin-linked-stocks-are-doing-better-than-btc",
    "timestamp": "2026-02-25T12:25:20Z"
  },
  {
    "title": "Trump Has Peak Trump Reaction After Trying On Olympian’s Gold Medal",
    "description": "Of course he did.",
    "link": "https://www.huffpost.com/entry/donald-trump-olympian-medal_n_699ecbc1e4b0967090fda6d6",
    "timestamp": "2026-02-25T12:22:34Z"
  },
  {
    "title": "France warns against risk of nuclear proliferation",
    "description": "Arms control treaties are expiring and countries are looking to develop their own arsenals in the face of geopolitical uncertainty, a French official tells reporters.",
    "link": "https://www.politico.eu/article/france-warns-against-nuclear-proliferation-risk/",
    "timestamp": "2026-02-25T12:22:14Z"
  },
  {
    "title": "New report shows NSA is working. So, why are payers, providers still mad?",
    "description": "A new report suggests greater in-network participation since the No Surprises Act, but more work needs to be done to iron out the law's wrinkles for major stakeholders.",
    "link": "https://www.techtarget.com/revcyclemanagement/news/366639535/New-report-shows-NSA-is-working-So-why-are-payers-providers-still-mad",
    "timestamp": "2026-02-25T12:18:00Z"
  },
  {
    "title": "US-UK tech deal cautiously restarts with focus on nuclear projects, FT reports",
    "description": "Feb 25 : The U.S. and Britain have tentatively restarted work on their multi-billion-pound \"tech prosperity deal\", which was paused last year after President Donald Trump piled pressure on the UK to cede ground in wider trade talks, the Financial Times report…",
    "link": "https://www.channelnewsasia.com/business/us-uk-tech-deal-cautiously-restarts-focus-nuclear-projects-ft-reports-5952531",
    "timestamp": "2026-02-25T12:17:30Z"
  },
  {
    "title": "A blue tie and plenty of buzz: Barron Trump’s State of the Union appearance explained",
    "description": "Barron Trump's choice of a blue tie at the State of the Union address sparked viewer reactions, with many expecting red for solidarity. Additionally, his tie knot drew criticism, with some viewers suggesting he needed assistance. Barron, currently a sophomore…",
    "link": "https://economictimes.indiatimes.com/news/international/us/a-blue-tie-and-plenty-of-buzz-barron-trumps-state-of-the-union-appearance-explained/articleshow/128781369.cms",
    "timestamp": "2026-02-25T12:17:15Z"
  },
  {
    "title": "Wasserman Schultz: Need Tax Credits to 'Make Sure' ACA Policies 'Remain Affordable'",
    "description": "During NewsNation’s State of the Union coverage on Tuesday, Rep. Debbie Wasserman Schultz (D-FL) said that part of the Democratic Party’s agenda is to extend tax credits to “make sure that the Affordable Care Act policies remain affordable.” Host Leland\nThe p…",
    "link": "https://www.breitbart.com/clips/2026/02/25/wasserman-schultz-need-tax-credits-to-make-sure-aca-policies-remain-affordable/",
    "timestamp": "2026-02-25T12:17:01Z"
  },
  {
    "title": "Dial shows how voters reacted to Trump criticizing Democrats for partial government shutdown",
    "description": "A live poll showed a stark partisan divide as voters reacted to President Donald Trump’s State of the Union comments about the government shutdown.",
    "link": "https://www.foxnews.com/politics/dial-shows-how-voters-reacted-trump-criticizing-democrats-partial-government-shutdown",
    "timestamp": "2026-02-25T12:15:20Z"
  },
  {
    "title": "Zelensky Says More Trilateral Meetings With Russia in March, Talks With U.S. This Week",
    "description": "A Ukrainian delegation is set to meet Thursday with American envoys in the run-up to another round of trilateral talks with Russia.\nThe post Zelensky Says More Trilateral Meetings With Russia in March, Talks With U.S. This Week appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/02/25/zelensky-says-more-trilateral-meetings-with-russia-in-march-talks-with-u-s-this-week/",
    "timestamp": "2026-02-25T12:13:32Z"
  },
  {
    "title": "Could Viktor Orbán Lose in April?",
    "description": "Before Donald Trump arrived on the scene in the United States, Viktor Orbán’s Hungary had already heralded the rise of populist illiberalism and the new far right. That is why all who seek to prevent or escape strongman rule will be watching the upcoming parl…",
    "link": "https://www.project-syndicate.org/commentary/hungarian-election-why-viktor-orban-could-lose-to-peter-magyar-by-zselyke-csaky-2026-02",
    "timestamp": "2026-02-25T12:13:09Z"
  },
  {
    "title": "People Are Sharing Positive Stories About Dr. Fauci After Trump’s Undeserved Backlash Towards Him",
    "description": "Dr. Anthony Fauci, the top infectious diseases expert in the United States, has been coming under fire from the White House more and more. Most recently, President Donald Trump called him “a little bit of an alarmist” in an interview with Fox News on Sunday, …",
    "link": "https://www.boredpanda.com/fauci-positive-stories-msn/",
    "timestamp": "2026-02-25T12:08:02Z"
  },
  {
    "title": "Why Obama’s White House didn’t ‘see Trump coming’",
    "description": "Newly released oral history of the Obama years suggests Trump was a blind spot for the Democrat",
    "link": "https://theweek.com/politics/trump-obama-oral-history",
    "timestamp": "2026-02-25T12:06:51Z"
  },
  {
    "title": "Read the complete transcript of Trump’s 2026 State of the Union",
    "description": "The address covered immigration, the economy and more.",
    "link": "https://www.bostonherald.com/2026/02/25/state-of-the-union-transcript/",
    "timestamp": "2026-02-25T12:06:50Z"
  },
  {
    "title": "Speechwriters split after Trump’s record-breaking SOTU: ‘Living in his own reality’ vs. ‘Resounding speech’",
    "description": "Trump delivers record-breaking State of the Union as speechwriters split on performance, with allies praising the address while critics cite disconnect.",
    "link": "https://www.foxnews.com/politics/speechwriters-split-trumps-record-breaking-sotu-living-reality-vs-resounding-speech",
    "timestamp": "2026-02-25T12:00:58Z"
  },
  {
    "title": "Fact-checking the State of the Union and the Trump's surgeon general pick faces a Senate grilling: Morning Rundown",
    "description": "In today’s newsletter: Trump’s State of the Union tackled the economy and immigration as his approval ratings on both issues fall.",
    "link": "https://www.nbcnews.com/news/us-news/fact-checking-state-union-trumps-surgeon-general-pick-faces-senate-gri-rcna260574",
    "timestamp": "2026-02-25T12:00:44Z"
  },
  {
    "title": "Yosemite Won’t Require Car Reservations in 2026. Park Advocates Are Worried",
    "description": "Park advocates say Yosemite scrapping timed tickets could mean overcrowding and long wait times this summer — and even damage to the park.",
    "link": "https://www.kqed.org/news/12074364/yosemite-national-park-no-reservations-2026-glacier-arches-timed-entry",
    "timestamp": "2026-02-25T12:00:30Z"
  },
  {
    "title": "State of the Union takeaways: Sales mode on the economy, patriotism and partisan attacks",
    "description": "Trump painted a picture of a “roaring” economy, even as polls show many Americans remain anxious. He also lashed out at Democrats and defended tariffs in a record-long speech.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_c8b26dab-82f4-54e7-aa2c-017364a55d99.html",
    "timestamp": "2026-02-25T12:00:00Z"
  },
  {
    "title": "A Lot Of Lying",
    "description": "<ul>\n<li>The Longest SOTU In History</li>\n<li>More Democratic Election Wins</li>\n<li>The Bride Of Charlie</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/lot-lying",
    "timestamp": "2026-02-25T12:00:00Z"
  },
  {
    "title": "Meet the companies and billionaires looking to make a massive profit off Trump’s plans in Gaza",
    "description": "U.S. companies are aiming to make huge profits from the Gaza reconstruction plan, with several billionaires on Trump's Board of Peace openly discussing the opportunity to make billions.",
    "link": "https://mondoweiss.net/2026/02/meet-the-companies-and-billionaires-looking-to-make-a-massive-profit-off-trumps-plans-in-gaza/",
    "timestamp": "2026-02-25T12:00:00Z"
  },
  {
    "title": "Online influencer faces confirmation hearing for surgeon general in U.S. Senate",
    "description": "The U.S. Senate is holding a confirmation hearing today for wellness influencer Casey Means, the Trump administration’s pick for surgeon general",
    "link": "https://www.scientificamerican.com/article/online-influencer-faces-confirmation-hearing-for-surgeon-general-in-u-s/",
    "timestamp": "2026-02-25T12:00:00Z"
  },
  {
    "title": "This photo doesn't show Melania Trump on Epstein's plane. Here's where it was really taken",
    "description": "A photo authentically shows future U.S. first lady Melania Trump, then Melania Knauss, posing partially nude for modeling pictures on the late sex offender Jeffrey Epstein's airplane.",
    "link": "https://www.snopes.com//fact-check/epstein-photo-plane-melania-trump/",
    "timestamp": "2026-02-25T12:00:00Z"
  },
  {
    "title": "Being MAGA Means Never Resigning, Even When Your Alleged Affair Turns Deadly",
    "description": "Texts continue to illustrate the alleged affair between Tony Gonzales and a married staffer, who later committed suicide.",
    "link": "https://www.jezebel.com/tony-gonzales-affair-congress-texas-regina-santos-aviles-suicide-resignation-investigation-lawsuit",
    "timestamp": "2026-02-25T11:56:52Z"
  },
  {
    "title": "What Trump said at State of the Union address",
    "description": "US President Donald Trump’s State of the Union address both aggravated and excited lawmakers.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/25/what-trump-said-at-state-of-the-union-address",
    "timestamp": "2026-02-25T11:56:38Z"
  },
  {
    "title": "Report Claims Thousands of Bots Boosted Nicki Minaj’s Political Posts!",
    "description": "A new report suggests much of the online attention Nicki Minaj has been receiving lately may not be coming solely from real fans. Over the past year, the rapper has leaned into a combative social media presence, posting frequent critiques of Democratic leader…",
    "link": "https://mediatakeout.com/report-claims-thousands-of-bots-boosted-nicki-minajs-political-posts/",
    "timestamp": "2026-02-25T11:55:48Z"
  },
  {
    "title": "US to end health aid to Zimbabwe after funding talks collapse",
    "description": "The U.S. is to wind down health assistance to Zimbabwe after the African country withdrew from talks on a proposed $367 million bilateral funding deal",
    "link": "https://abcnews.com/International/wireStory/us-end-health-aid-zimbabwe-after-funding-talks-130486469",
    "timestamp": "2026-02-25T11:52:39Z"
  },
  {
    "title": "'This is false': One of Trump's biggest claims at address fact-checked by his own website",
    "description": "While President Donald Trump proudly boasted Tuesday during his State of the Union address that he had helped secure $18 trillion in investments into the United States during his first year in office, the claim was immediately labeled as false\r\n Wednesday by …",
    "link": "https://www.rawstory.com/trump-2675330471/",
    "timestamp": "2026-02-25T11:47:45Z"
  },
  {
    "title": "Trump hides in plain sight at the State of the Union",
    "description": "The president waited until most viewers had tuned out to reveal his worst impulses",
    "link": "https://www.salon.com/2026/02/25/trump-hides-in-plain-sight-at-the-state-of-the-union/",
    "timestamp": "2026-02-25T11:45:44Z"
  },
  {
    "title": "The UK’s proposed social media ban explained",
    "description": "The UK government will use new legal powers to lay the groundwork for an under-16 social media ban after its consultation on children’s digital well-being, but opponents warn the measures being considered will only treat the symptoms of the problem if they ig…",
    "link": "https://www.computerweekly.com/news/366639424/The-UKs-proposed-social-media-ban-explained",
    "timestamp": "2026-02-25T11:45:00Z"
  },
  {
    "title": "What to Know About Killing of Powerful Cartel Leader ‘El Mencho’ in Mexico",
    "description": "The Mexican army killed the country’s most powerful cartel leader and one of the United States’ most wanted fugitives, notching a major victory while cartel members responded with a wave of violence across the country. The killing Sunday of Jalisco …",
    "link": "https://www.insurancejournal.com/news/international/2026/02/25/859547.htm",
    "timestamp": "2026-02-25T11:40:07Z"
  },
  {
    "title": "Sen. Blumenthal probes Binance over alleged $1.7 billion in crypto Iran-linked transactions",
    "description": "Sen. Richard Blumenthal sends Binance chief a letter over sanctions laws violations, as the exchange reiterates denial and cites strict KYC controls.",
    "link": "https://www.coindesk.com/business/2026/02/25/u-s-senator-opens-probe-on-binance-over-alleged-usd1-7-billion-flow-to-iranian-entities",
    "timestamp": "2026-02-25T11:38:01Z"
  },
  {
    "title": "Australian diplomats' families offered evacuation over Iran threat",
    "description": "The Australian government offers to evacuate the families of Australian diplomats and officials from some of its missions in the Middle East, with the prospect of US strikes on Iran leaving the region on high alert.",
    "link": "https://www.abc.net.au/news/2026-02-25/australian-diplomats-families-offered-evacuation/106389298",
    "timestamp": "2026-02-25T11:37:02Z"
  },
  {
    "title": "Merz in China: German chancellor, Xi seek more cooperation",
    "description": "Friedrich Merz said he saw a \"great opportunity\" for the industrial exporters, while Xi Jinping called for \"enhanced strategic cooperation.\" China has been courting Western leaders amid Trump's trade tensions. Merz's visit to China is the first by a German ch…",
    "link": "https://www.dw.com/en/merz-in-china-german-chancellor-xi-seek-more-cooperation/live-76110529",
    "timestamp": "2026-02-25T11:37:00Z"
  },
  {
    "title": "US Fed moves to drop reputation risk in bank reviews",
    "description": "This initiative follows actions taken by former President Donald Trump to address what he identified as unfair account closures by financial institutions.",
    "link": "https://www.retailbankerinternational.com/news/us-drop-reputation-risk-bank-reviews/",
    "timestamp": "2026-02-25T11:35:39Z"
  },
  {
    "title": "Ukraine’s moment to secure EU membership: Between Hungarian and French elections",
    "description": "Kyiv wants to get a mention of EU accession in 2027 into any peace deal negotiated by Donald Trump.",
    "link": "https://www.politico.eu/article/ukraine-eu-membership-hungary-france-elections/",
    "timestamp": "2026-02-25T11:32:26Z"
  },
  {
    "title": "Transcript: Trump Epstein Scandal Takes Damning Turn as Dem Drops Bomb",
    "description": "The following is a lightly edited transcript of the February 25 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. The Epst…",
    "link": "https://newrepublic.com/article/207010/transcript-trump-epstein-scandal-takes-damning-turn-dem-drops-bomb",
    "timestamp": "2026-02-25T11:31:54Z"
  },
  {
    "title": "Circle tops revenue expectations on strong stablecoin circulation, shares surge",
    "description": "Feb 25 : Circle surpassed Wall Street expectations for fourth quarter revenue on Wednesday, as income from reserves got a boost from a rise in circulation of its stablecoin token, sending its shares surging over 15 per cent in premarket trading.USDC, Circle's…",
    "link": "https://www.channelnewsasia.com/business/circle-tops-revenue-expectations-strong-stablecoin-circulation-shares-surge-5952426",
    "timestamp": "2026-02-25T11:30:31Z"
  },
  {
    "title": "West won’t deploy troops to Ukraine without Putin’s approval – Telegraph",
    "description": "Western officials have privately conceded that there will be no NATO troops in Ukraine without Russian consent, The Telegraph has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/633022-nato-troops-ukraine-telegraph/",
    "timestamp": "2026-02-25T11:30:15Z"
  },
  {
    "title": "Circle's fourth-quarter revenue rises on strong stablecoin circulation",
    "description": "Circle reported an increase in fourth-quarter revenue on Wednesday, as income from reserves got a boost from ‌a rise in circulation of its stablecoin token...",
    "link": "https://finance.yahoo.com/news/circles-fourth-quarter-revenue-rises-112921598.html",
    "timestamp": "2026-02-25T11:29:21Z"
  },
  {
    "title": "Congressman removed from State of the Union for protesting with 'black people aren't apes' sign",
    "description": "Several Democrats left the speech early while Rep Ilhan Omar could be heard shouting “you have killed Americans”",
    "link": "https://www.thejournal.ie/congressman-removed-after-state-of-the-union-protest-6966936-Feb2026/",
    "timestamp": "2026-02-25T11:28:03Z"
  },
  {
    "title": "Mike Johnson Says He ‘Could Have Ejected’ Democrats From Chamber Over ‘Shameful Display’ During Trump’s SOTU",
    "description": "House Speaker Mike Johnson (R-LA) told Newsmax that he \"could have ejected\" several Democrats during President Donald Trump's State of the Union address.\nThe post Mike Johnson Says He ‘Could Have Ejected’ Democrats From Chamber Over ‘Shameful Display’ During …",
    "link": "https://www.mediaite.com/media/tv/mike-johnson-says-he-could-have-ejected-democrats-from-chamber-over-shameful-display-during-trumps-sotu/",
    "timestamp": "2026-02-25T11:25:57Z"
  },
  {
    "title": "Tabloids Buzz Over Barron Trump's 'Eyebrow-Raising' Fashion Choice At SOTU",
    "description": "The president's son had tongues wagging in certain circles for his attire at the speech.",
    "link": "https://www.huffpost.com/entry/barron-trump-blue-tie-state-of-the-union_n_699ecba0e4b0dce804cd0551",
    "timestamp": "2026-02-25T11:21:36Z"
  },
  {
    "title": "ByteDance valued at $550 billion in proposed share sale by General Atlantic",
    "description": "General Atlantic, which first invested in ByteDance in 2017 when the company was valued at about $20 billion, started the ​process to sell some of its shares in weeks and hopes to close the sale in March. Details of the financial terms of the stake sale, Gene…",
    "link": "https://economictimes.indiatimes.com/tech/technology/bytedance-valued-at-550-billion-in-proposed-share-sale-by-general-atlantic-sources-say/articleshow/128780043.cms",
    "timestamp": "2026-02-25T11:16:48Z"
  },
  {
    "title": "Blatter criticizes Infantino and calls FIFA a 'dictatorship'",
    "description": "Former FIFA president Joseph Blatter has criticized current federation boss Gianni Infantino, calling him autocratic and submissive. \"What is FIFA today? It consists only of its president, Infantino.",
    "link": "https://dpa-international.com/sports/urn:newsml:dpa.com:20090101:260225-99-643666/",
    "timestamp": "2026-02-25T11:15:04Z"
  },
  {
    "title": "Trump dodges mention of tariff refunds in State of the Union speech",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2026/02/25/trump-tariff-refunds-state-of-the-union-speech/",
    "timestamp": "2026-02-25T11:09:19Z"
  },
  {
    "title": "Trump Humiliated During His Big Speech With Republican Losses",
    "description": "While President Donald Trump was yelling at Democrats and berating the Supreme Court at his State of the Union address, members of his Republican party were ...",
    "link": "https://www.thedailybeast.com/donald-trump-humiliated-during-state-of-the-union-with-republican-losses/",
    "timestamp": "2026-02-25T11:05:59Z"
  },
  {
    "title": "GOP stays competitive in midterms despite Trump's negative ratings: Poll",
    "description": "Republicans increasingly want their party to follow Trump's direction.",
    "link": "https://abcnews.com/Politics/gop-stays-competitive-midterms-despite-trumps-negative-ratings/story?id=130460299",
    "timestamp": "2026-02-25T11:01:37Z"
  },
  {
    "title": "Has the U.K. Become Ungovernable?",
    "description": "Has the U.K. become ungovernable? Speaking with Cambridge University’s Helen Thompson about Prime Minister Keir Starmer’s grim prospects and the British political permacrisis.",
    "link": "http://nymag.com/intelligencer/article/keir-starmer-is-in-trouble-can-anyone-govern-the-u-k.html",
    "timestamp": "2026-02-25T11:00:47Z"
  },
  {
    "title": "The Abundance Gang Has a Big AI Problem",
    "description": "In early February, Axios reported that “Ezra Klein’s Abundance movement is getting some backup” in the form of a new group: Next American Era, headed by former Democratic Congressional Campaign Committee head, Illinois congresswoman, and longtime Washington i…",
    "link": "https://newrepublic.com/article/206423/abundance-ai-problem-data-centers",
    "timestamp": "2026-02-25T11:00:00Z"
  },
  {
    "title": "The Trump Administration’s War on Data Has Fresh Casualties",
    "description": "The federal government is littered with incomprehensible acronyms representing a host of divisions and agencies. But throughout the civil service there are departments with mission mandates that, while technical—and at times obscure— fulfill specific and freq…",
    "link": "https://newrepublic.com/article/206971/trump-war-data-opre-research",
    "timestamp": "2026-02-25T11:00:00Z"
  },
  {
    "title": "Trump’s ICE Is Quietly Stockpiling Weaponry—and It Should Alarm Us All",
    "description": "The “Forever Wars” abroad and the Global War on Terror after the September 11 attacks left behind a long trail of failure, disillusionment, and death—but they also funneled huge sums of taxpayer money to companies that supplied the equipment that made all tha…",
    "link": "https://newrepublic.com/article/206994/ice-stockpiling-military-weaponry-trump-forever-war",
    "timestamp": "2026-02-25T11:00:00Z"
  },
  {
    "title": "The rise of the strongman president has endangered US democracy",
    "description": "Trajectory of Power by Terry Moe and William Howell charts the expansion of US presidential power during the modern era and its consequences for democracy. This extract from the book's introduction describes how the Republican Party pursued the empowerment of…",
    "link": "https://blogs.lse.ac.uk/lsereviewofbooks/2026/02/25/book-extract-trajectory-of-power-the-rise-of-the-strongman-presidency-terry-m-moe-william-g-howell/",
    "timestamp": "2026-02-25T10:59:07Z"
  },
  {
    "title": "Justice Amy Coney Barrett's face says it all as Trump awkwardly blasts SCOTUS to their faces after very frosty welcome",
    "description": "Donald Trump faced-off in-person with Supreme Court justices who ruled against his tariffs last week. The four justices who attended his State of the Union address were forced to remain stoned-faced as the president berated them in front of a joint session of…",
    "link": "https://freerepublic.com/focus/f-chat/4368220/posts",
    "timestamp": "2026-02-25T10:58:52Z"
  },
  {
    "title": "Jasmine Crockett trashes Trump, boycotts his speech: 'The current state of our union is grim'",
    "description": "Rep. Jasmine Crockett said she would skip President Donald Trump's State of the Union speech, and described the state of the American union as \"grim.\"",
    "link": "https://www.foxnews.com/politics/jasmine-crockett-boycotts-trump-state-of-the-union",
    "timestamp": "2026-02-25T10:58:05Z"
  },
  {
    "title": "German Chancellor Merz meets Xi Jinping in China to strengthen trade, strategic ties",
    "description": "German Chancellor Friedrich Merz met with Chinese leader Xi Jinping in Beijing on Wednesday, hoping to bolster ties with his country's largest trade partner and high-tech rival as Europe's biggest economy struggles. China, the world's number two economy, over…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/german-chancellor-merz-meets-xi-jinping-in-china-to-strengthen-trade-strategic-ties/articleshow/128779240.cms",
    "timestamp": "2026-02-25T10:55:23Z"
  },
  {
    "title": "Karen Tumulty: With disapproval rating at 60pc, Donald Trump tries to paint a new reality for America in State of the Union speech",
    "description": "On Tuesday,US president Donald Trump delivered what was effectively not one, but two State of the Union addresses.",
    "link": "https://www.independent.ie/world-news/karen-tumulty-with-disapproval-rating-at-60pc-donald-trump-tries-to-paint-a-new-reality-for-america-in-state-of-the-union-speech/a128251826.html",
    "timestamp": "2026-02-25T10:53:15Z"
  },
  {
    "title": "With disapproval rating at 60pc, Trump tries to paint a new reality for America in State of the Union speech",
    "description": "· President Donald Trump night delivered what was effectively not one, but two State of the Union addresses.",
    "link": "https://www.independent.ie/world-news/with-disapproval-rating-at-60pc-trump-tries-to-paint-a-new-reality-for-america-in-state-of-the-union-speech/a128251826.html",
    "timestamp": "2026-02-25T10:53:15Z"
  },
  {
    "title": "MFA advises Singaporeans to leave Iran while flights remain available",
    "description": "SINGAPORE: Singaporeans who are currently in Iran should remain vigilant, monitor the situation closely, and leave as soon as practicable while flights remain available, the Ministry of Foreign Affairs (MFA) said on Wednesday (Feb 25). They should also avoid …",
    "link": "https://www.channelnewsasia.com/singapore/mfa-travel-advisory-singaporeans-leave-iran-5952261",
    "timestamp": "2026-02-25T10:51:46Z"
  },
  {
    "title": "Zelenskyy says Ukrainian officials to meet Trump envoys in Geneva for more talks",
    "description": "Ukraine President Volodymyr Zelenskyy says a Ukrainian delegation is set to meet Thursday with American envoys in the run-up to another round of trilateral talks with Russia",
    "link": "https://abcnews.com/International/wireStory/zelenskyy-ukrainian-officials-meet-trump-envoys-geneva-russia-130485836",
    "timestamp": "2026-02-25T10:51:26Z"
  },
  {
    "title": "Stephen Colbert Targets Trump’s ‘Incredibly Long’ Speech in Last Live Show",
    "description": "During his most recent live broadcast of The Late Show with Stephen Colbert, host Stephen Colbert took aim at President Donald Trump’s State of the Union address. Labeling it “incredibly long,” Colbert focused on the extended runtime along with the central me…",
    "link": "https://www.comingsoon.net/tv/news/2100686-stephen-colbert-donald-trump-state-of-union-speech-live-show",
    "timestamp": "2026-02-25T10:49:52Z"
  },
  {
    "title": "Mexico Has Finally Toppled a Major Drug Kingpin. What Comes Next Matters More.",
    "description": "El Mencho’s death is a start, but the country’s troubles run much deeper.",
    "link": "https://slate.com/news-and-politics/2026/02/el-mencho-death-mexico-killed-raid-cartels-trump-sheinbaum.html",
    "timestamp": "2026-02-25T10:45:00Z"
  },
  {
    "title": "Fact-checking Trump's longest ever State of the Union",
    "description": "President Donald Trump said the US \"is winning again\" - making a series of claims about his record in a speech which lasted almost two hours.",
    "link": "https://www.bbc.com/news/articles/cgmlzg0p8k2o",
    "timestamp": "2026-02-25T10:40:47Z"
  },
  {
    "title": "Pat McAfee makes stunning gesture during Team USA’s $150K Gold medal celebration",
    "description": "The USA men's hockey team wrapped up their 2026 Winter Olympics run with a gold medal in Milano-Cortina, Italy, after beating Canada in overtime. But the celebration did not stop when the final horn sounded. Less than 24 hours after clinching the title, Team …",
    "link": "https://www.thebiglead.com/pat-mcafee-gesture-team-usa-150k-gold-medal-celebration-miami/",
    "timestamp": "2026-02-25T10:37:30Z"
  },
  {
    "title": "US slaps steep import duties on solar imports from India and Indonesia – media",
    "description": "The protectionist US move to assist American producers threatens to increase consumer costs. Read Full Article at RT.com",
    "link": "https://www.rt.com/india/633020-us-slaps-steep-import-duties/",
    "timestamp": "2026-02-25T10:36:54Z"
  },
  {
    "title": "How Europe can resolve its Trump-China dilemma",
    "description": "Europe faces a dilemma in its engagement with China. While closer relations with Beijing could reduce European dependence on the US, it would also risk provoking a harsh response from … Continued\nThe post How Europe can resolve its Trump-China dilemma first a…",
    "link": "https://blogs.lse.ac.uk/europpblog/2026/02/25/europe-china-relations-trump-strategy/",
    "timestamp": "2026-02-25T10:36:48Z"
  },
  {
    "title": "I never paid for a flight ticket in past 10 years: Ashish Lath, CEO, SaveSage",
    "description": "In the past 10 years, Ashish Lath took 400 flights without spending any money, which includes around 80 international ones. He stayed in hotels for 100 nights without paying anything, getting 23% return on expenses in value terms by using 15 credit cards.",
    "link": "https://www.livemint.com/money/personal-finance/i-never-paid-for-a-flight-ticket-in-past-10-years-ashish-lath-ceo-savesage-shark-tank-india-season-5-11772013771198.html",
    "timestamp": "2026-02-25T10:32:13Z"
  },
  {
    "title": "Takeaways from Trump's address: Sales mode on economy, heavy on patriotism, dark turn on Democrats - AP News",
    "description": "Takeaways from Trump's address: Sales mode on economy, heavy on patriotism, dark turn on DemocratsAP News Takeaways from Donald Trump’s State of the Union addressCNN Who Said It Better? How Trump’s Economic Pitch Echoes Biden’s.The New York Times What Trump a…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180858148",
    "timestamp": "2026-02-25T10:32:05Z"
  },
  {
    "title": "Trump’s tariffs got quashed by America's Supreme Court—but India’s position has strengthened",
    "description": "A US Supreme Court setback to Donald Trump’s tariff policy has reshuffled the trade deck. New Delhi finds itself better armed now to finalize a deal that can best serve India’s interests, but it must play its cards well.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-tariffs-quashed-america-supreme-court-india-trade-deal-exports-11771934612154.html",
    "timestamp": "2026-02-25T10:30:38Z"
  },
  {
    "title": "Aston Martin to cut up to 20% of its workforce as tariff and China pain rocks automakers",
    "description": "British automaker Aston Martin — known for its sleek supercars favored by James Bond — announced that it would cut as many as 20% of its employees.",
    "link": "https://www.businessinsider.com/aston-martin-job-cuts-employees-tariffs-china-2026-2",
    "timestamp": "2026-02-25T10:29:00Z"
  },
  {
    "title": "Trump targets trans minors and gender-affirming care in State of the Union address",
    "description": "In his State of the Union address on Tuesday (24 February), President Donald Trump pointed his focus towards transgender youth, specifically referencing the story of Sage Blair, a Virginia teenager who was invited to the State of the Union alongside her mothe…",
    "link": "https://www.thepinknews.com/2026/02/25/trump-targets-trans-minors-and-gender-affirming-care-in-state-of-the-union-address/",
    "timestamp": "2026-02-25T10:26:27Z"
  },
  {
    "title": "Jimmy Kimmel Shreds Trump’s ‘Nutjob’ Speech with ‘Real’ State of the Union Address",
    "description": "Kimmel explained his team delayed taping as long as possible while waiting for the president’s nearly 108-minute address to conclude.\nThe post Jimmy Kimmel Shreds Trump’s ‘Nutjob’ Speech with ‘Real’ State of the Union Address first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/jimmy-kimmel-shreds-trumps-nutjob-speech-with-real-state-of-the-union-address/",
    "timestamp": "2026-02-25T10:25:12Z"
  },
  {
    "title": "What to expect from the next round of U.S.-Iran talks as Trump threatens Tehran",
    "description": "The upcoming talks come as the U.S. continues to build up military forces in the region and as Trump warns of \"bad things\" if Iran doesn't agree to a deal.",
    "link": "https://www.cnbc.com/2026/02/25/us-iran-talks-nuclear-trump-oil-prices-war-conflict.html",
    "timestamp": "2026-02-25T10:23:07Z"
  },
  {
    "title": "US Supreme Court’s stunning verdict on tariffs",
    "description": "By blocking tariffs, it hits at the heart of President Trump’s economic policies. The money from tariffs was already factored for spending and deficit reduction",
    "link": "https://www.thehindubusinessline.com/opinion/us-supreme-courts-stunning-verdict-on-tariffs/article70675122.ece",
    "timestamp": "2026-02-25T10:17:05Z"
  },
  {
    "title": "Iran pushes back against Trump ahead of Geneva talks in face of major deployment",
    "description": "Iran has pushed back against U.S. President Donald Trump’s pressure tactics ahead of critical talks in Geneva over Tehran’s nuclear program",
    "link": "https://abcnews.com/International/wireStory/iran-pushes-back-trump-ahead-geneva-talks-face-130485620",
    "timestamp": "2026-02-25T10:13:02Z"
  },
  {
    "title": "The DIY solar hack arriving in US homes",
    "description": "Americans are embracing easy, plug‑and‑play solar units that slash energy costs — even as Washington tries to slow the clean‑energy shift.",
    "link": "https://www.dw.com/en/the-diy-solar-hack-arriving-in-us-homes/a-76106659",
    "timestamp": "2026-02-25T10:13:00Z"
  },
  {
    "title": "US states begin plugging into balcony solar",
    "description": "Simple, money-saving plug-in solar systems are taking off in the US, despite the best efforts by the Trump administration to quash the shift toward renewable energy.",
    "link": "https://www.dw.com/en/us-states-begin-plugging-into-balcony-solar/a-76106659",
    "timestamp": "2026-02-25T10:13:00Z"
  },
  {
    "title": "Which countries are urging citizens to leave Iran amid US threat of force?",
    "description": "Countries issue warnings for citizens to leave Iran amid potential US military strikes.",
    "link": "https://www.aljazeera.com/news/2026/2/25/which-countries-are-urging-citizens-to-leave-iran-amid-us-threat-of-force",
    "timestamp": "2026-02-25T10:12:21Z"
  },
  {
    "title": "FactChecking Trump’s State of the Union Address",
    "description": "In the first State of the Union Address of his second term, President Donald Trump proclaimed that \"our nation is back, bigger, better, richer and stronger than ever before.\" But our review of his speech found that he distorted a number of facts about the sta…",
    "link": "https://www.factcheck.org/2026/02/factchecking-trumps-state-of-the-union-address/",
    "timestamp": "2026-02-25T10:10:49Z"
  },
  {
    "title": "Inside Miami’s Billionaire Bunker, a manmade island for the .01% where billionaires like Jeff Bezos and Mark Zuckerberg shell out for total privacy",
    "description": "A single bridge, 24/7 police, and $150M estates make Indian Creek in Miami America’s most exclusive enclave.",
    "link": "https://fortune.com/2026/02/25/miami-florida-billionaire-bunker-taxes-wealth-tax-mark-zuckerberg-jeff-bezos-real-estate/",
    "timestamp": "2026-02-25T10:08:00Z"
  },
  {
    "title": "Washington warned Kiev after strikes on Russian port hit US-linked oil infrastructure – envoy",
    "description": "The Ukrainian ambassador to the US revealed that in November she was contacted about the attack Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/633011-stefanishina-us-protest-kazakhstan/",
    "timestamp": "2026-02-25T10:07:58Z"
  },
  {
    "title": "Zelensky schedules high-level Ukraine–US Geneva talks for Thursday",
    "description": "Rustem Umerov, Ukraine’s lead negotiator, is set to meet US envoy Steve Witkoff in Geneva on Thursday as part of preparations for anticipated trilateral talks with Russia in early March, Kyiv announced. Ukrainian President Volodymyr Zelenskyy said the discuss…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelensky-confirms-high-stakes-geneva-talks-with-us-envoys-ahead-of-new-trump-led-ukrainerussia-peace-push/articleshow/128777677.cms",
    "timestamp": "2026-02-25T10:07:51Z"
  },
  {
    "title": "Trump sues New Jersey over order restricting immigration agents",
    "description": "The US Justice Department has sued New Jersey, seeking to overturn an executive order that limits where federal immigration agents can operate.\n\nRead More: https://punchng.com/trump-sues-new-jersey-over-order-restricting-immigration-agents/",
    "link": "https://punchng.com/trump-sues-new-jersey-over-order-restricting-immigration-agents/",
    "timestamp": "2026-02-25T10:07:13Z"
  },
  {
    "title": "Tensions escalate in the Middle East: U.S. F-22s and refueling aircraft deployed to Israel – “If you sow the wind, you will reap the whirlwind,” Iran warns",
    "description": "The United States are reinforcing their military presence in the Middle East – Iran sends messages to Washington with posters in the streets ahead of tomorrow’s talks in Geneva\nThe post Tensions escalate in the Middle East: U.S. F-22s and refueling aircraft d…",
    "link": "https://en.protothema.gr/2026/02/25/tensions-escalate-in-the-middle-east-u-s-f-22s-and-refueling-aircraft-deployed-to-israel-if-you-sow-the-wind-you-will-reap-the-whirlwind-iran-warns/",
    "timestamp": "2026-02-25T10:02:16Z"
  }
]