[
  {
    "title": "Israelis are hailing Trump as Cyrus returned – but who was Cyrus the Great, anyway?",
    "description": "One wonders what Cyrus the Great, founder of the Achaemenid Persian empire, would think of the comparison.",
    "link": "https://theconversation.com/israelis-are-hailing-trump-as-cyrus-returned-but-who-was-cyrus-the-great-anyway-267312",
    "timestamp": "2025-10-13T05:38:49Z"
  },
  {
    "title": "Priyanka Chopra returns to India: Praises National capital's beauty; writes, 'Dilli ki khoobsoorti'",
    "description": "Priyanka Chopra Jonas has returned to India, landing in Delhi after a New York Diwali bash. She's in the capital to celebrate her best friend Tamanna Dutt's birthday, expressing her admiration for Delhi's beauty. The actress also shared a sweet moment with hu…",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-praises-delhis-beauty-during-visit-for-friends-birthday/articleshow/124518452.cms",
    "timestamp": "2025-10-13T05:38:03Z"
  },
  {
    "title": "At the Sharm el-Sheikh summit on Gaza after Trump’s invitation today, Mitsotakis: Greece will be there along with Cyprus",
    "description": "“A response to those who want to see a Greece isolated and miserable,” wrote the Prime Minister regarding the invitation from the US President\nThe post At the Sharm el-Sheikh summit on Gaza after Trump’s invitation today, Mitsotakis: Greece will be there alon…",
    "link": "https://en.protothema.gr/2025/10/13/at-the-sharm-el-sheikh-summit-on-gaza-after-trumps-invitation-today-mitsotakis-greece-will-be-there-along-with-cyprus/",
    "timestamp": "2025-10-13T05:36:39Z"
  },
  {
    "title": "Latest Developments In The Gaza Ceasefire",
    "description": "A Red Cross convoy was on its way to pick up a first group of Israeli hostages to be freed by Hamas as part of a Gaza ceasefire deal, the Israeli military said Monday.",
    "link": "https://www.ibtimes.com.au/latest-developments-gaza-ceasefire-1860818",
    "timestamp": "2025-10-13T05:36:16Z"
  },
  {
    "title": "Latest Developments In The Gaza Ceasefire",
    "description": "A Red Cross convoy was on its way to pick up a first group of Israeli hostages to be freed by Hamas as part of a Gaza ceasefire deal, the Israeli military said Monday.",
    "link": "https://www.ibtimes.com/latest-developments-gaza-ceasefire-3786679",
    "timestamp": "2025-10-13T05:36:13Z"
  },
  {
    "title": "First group of 7 hostages arrive in Israel",
    "description": "All living hostages held by Hamas are expected to be released in exchange for Palestinian prisoners. Meanwhile, US President Donald Trump is heading to the region to for a peace summit in Egypt. Follow DW. US President Donald Trump arrives in Tel Aviv \nIsrael…",
    "link": "https://www.dw.com/en/first-group-of-7-hostages-arrive-in-israel/live-74326286",
    "timestamp": "2025-10-13T05:36:00Z"
  },
  {
    "title": "First group of Israeli hostages released to Red Cross",
    "description": "All living hostages held by Hamas are expected to be released in exchange for Palestinian prisoners. Meanwhile, US President Donald Trump is heading to the region to for a peace summit in Egypt. Follow DW.",
    "link": "https://www.dw.com/en/first-group-of-israeli-hostages-released-to-red-cross/live-74326286",
    "timestamp": "2025-10-13T05:36:00Z"
  },
  {
    "title": "First group of 7 hostages in Israeli custody",
    "description": "All living hostages held by Hamas are expected to be released in exchange for Palestinian prisoners. Meanwhile, US President Donald Trump is heading to the region to for a peace summit in Egypt. Follow DW.",
    "link": "https://www.dw.com/en/first-group-of-7-hostages-in-israeli-custody/live-74326286",
    "timestamp": "2025-10-13T05:36:00Z"
  },
  {
    "title": "Seven Israeli hostages return from Gaza as Trump arrives",
    "description": "All living hostages held by Hamas are expected to be released in exchange for Palestinian prisoners. Meanwhile, US President Donald Trump is heading to the region to for a peace summit in Egypt. Follow DW.",
    "link": "https://www.dw.com/en/seven-israeli-hostages-return-from-gaza-as-trump-arrives/live-74326286",
    "timestamp": "2025-10-13T05:36:00Z"
  },
  {
    "title": "Why silver is riskier than gold, according to Goldman Sachs",
    "description": "Silver could face \"significantly more\" volatility and downside risk than gold, since only gold enjoys central-bank support.",
    "link": "https://markets.businessinsider.com/news/commodities/gold-price-today-silver-riskier-investment-central-banks-goldman-sachs-2025-10",
    "timestamp": "2025-10-13T05:33:57Z"
  },
  {
    "title": "Anupamaa: Prakash’s tue intentions come to light as Anupama refuses to back down",
    "description": "Prakash's hidden agenda is revealed as he admits Sonu Rathod's father is funding him, dismissing Anupama's influence. Meanwhile, Khyati and Leela decide to leave the village due to the unrest. Anupama, however, remains determined to fight for justice for Sama…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/anupamaa-prakashs-tue-intentions-come-to-light-as-anupama-refuses-to-back-down/articleshow/124518458.cms",
    "timestamp": "2025-10-13T05:33:42Z"
  },
  {
    "title": "'Score a hundred and take them': Tendulkar recalls Amre's unforgettable gesture",
    "description": "During the launch of his sportswear brand, Sachin Tendulkar recalled how his senior and friend Pravin Amre gifted him his first pair of cricket shoes as a teenager. Amre had promised the shoes if Tendulkar scored a century, a gesture Tendulkar never forgot, h…",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/news/score-a-hundred-and-take-them-sachin-tendulkar-recalls-pravin-amres-unforgettable-gesture/articleshow/124518339.cms",
    "timestamp": "2025-10-13T05:32:41Z"
  },
  {
    "title": "Meenakshi Seshadri's Diwali message: Urges safe celebrations; says, 'Celebrate with joy, but be careful'",
    "description": "Veteran actress Meenakshi Seshadri shares a Diwali message. She asks everyone to celebrate with happiness and caution. Seshadri advises against giving large firecrackers to children. She also warns against lighting them in cars or buildings. She encourages li…",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/meenakshi-seshadris-diwali-message-urges-safe-celebrations-says-celebrate-with-joy-but-be-careful/articleshow/124518382.cms",
    "timestamp": "2025-10-13T05:32:19Z"
  },
  {
    "title": "Live: Israel and Hamas await release of hostages and prisoners",
    "description": "US President Donald Trump is headed to Israel, having declared the war \"over\".",
    "link": "https://www.channelnewsasia.com/world/israel-hamas-hostages-release-prisoners-exchange-trump-live-5397961",
    "timestamp": "2025-10-13T05:31:57Z"
  },
  {
    "title": "Time to hunker down: Swaminathan Aiyar advises patience amid global uncertainty",
    "description": "Economist Swaminathan Aiyar believes Donald Trump will yield in US-China trade disputes. However, a new cold war is emerging globally. Countries must now focus on security and self-reliance. India needs to increase defense spending and use its economic levera…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/time-to-hunker-down-swaminathan-aiyar-advises-patience-amid-global-uncertainty/articleshow/124518413.cms",
    "timestamp": "2025-10-13T05:31:45Z"
  },
  {
    "title": "China's stocks sink on fresh US trade war salvo",
    "description": "HONG KONG/SHANGHAI (Reuters) -China stocks fell sharply in volatile trade on Monday as a renewed trade war between Washington and Beijing hit risk appetite...",
    "link": "https://finance.yahoo.com/news/chinas-stocks-sink-fresh-us-053144761.html",
    "timestamp": "2025-10-13T05:31:44Z"
  },
  {
    "title": "China trade beats forecasts in September as tariff fears rise",
    "description": "China's trade grew faster than expected last month, official data showed Monday, though fresh fears are rising of a major escalation in the tariff war between Beijing and Washington.",
    "link": "https://www.hurriyetdailynews.com/china-trade-beats-forecasts-in-september-as-tariff-fears-rise-214613",
    "timestamp": "2025-10-13T05:31:41Z"
  },
  {
    "title": "Nobel prize in economics to be announced Monday: Who will win?",
    "description": "Three researchers who probed the process of business innovation have won the Nobel memorial prize in economics for explaining how new products and inventions promote economic growth and human welfare, even as they leave older companies in the dust. The prize …",
    "link": "https://apnews.com/article/nobel-prize-economics-2347b4214e029b132458269c33df192e",
    "timestamp": "2025-10-13T05:31:25Z"
  },
  {
    "title": "‘War is over’ Trump declares on Air Force One as he heads to Israel for hostage release",
    "description": "“I think people are tired of it,” he added. “It’s been centuries, OK, not just recent. It’s been centuries. I think people are tired of it. Yeah, the ceasefire is going to hold.”",
    "link": "https://nypost.com/2025/10/13/world-news/war-is-over-trump-declares-on-air-force-one-as-he-heads-to-israel-for-hostage-release/",
    "timestamp": "2025-10-13T05:31:15Z"
  },
  {
    "title": "First of surviving Israeli hostages handed over to Red Cross by Hamas",
    "description": "Hamas has said 20 living hostages will be exchanged for more than 1,900 Palestinian prisoners held by Israel.",
    "link": "https://uk.news.yahoo.com/first-surviving-israeli-hostages-handed-052927762.html",
    "timestamp": "2025-10-13T05:29:27Z"
  },
  {
    "title": "Hamas handed over seven surviving hostages to Red Cross",
    "description": "Hamas was set to release all surviving hostages on Monday in exchange for Palestinian prisoners held by Israel, as U.S. President Donald Trump headed to the region for a peace summit having declared the war \"over\".",
    "link": "https://www.hurriyetdailynews.com/hamas-and-israel-set-for-hostage-and-prisoner-exchanges-214612",
    "timestamp": "2025-10-13T05:29:00Z"
  },
  {
    "title": "Israel waits for Hamas to release remaining hostages before Monday deadline",
    "description": "Israeli prime minister Benjamin Netanyahu says prisoner release ‘is the beginning of a new path’",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/13/israel-hamas-gaza-hostages-ceasefire-live-updates/",
    "timestamp": "2025-10-13T05:28:56Z"
  },
  {
    "title": "How the United States is eating Trump's tariffs",
    "description": "America's new import tariffs are hitting U.S. businesses and shoppers hard.  Contrary to President Trump's claims, foreign nations are not paying the price.  Early signs show American firms absorbing costs and passing some to consumers.  This situation compli…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-the-united-states-is-eating-trumps-tariffs/articleshow/124518354.cms",
    "timestamp": "2025-10-13T05:25:54Z"
  },
  {
    "title": "Hamas begins releasing hostages held in Gaza for more than 2 years",
    "description": "Hamas begins process of freeing 20 living hostages on Monday after Israel’s military halted its campaign in the Gaza Strip — the first stages of its peace plan.",
    "link": "https://www.msnbc.com/msnbc/news/hamas-releasing-hostages-gaza-peace-plan-rcna237212",
    "timestamp": "2025-10-13T05:25:50Z"
  },
  {
    "title": "Israel-Gaza live updates: Trump to address Israeli government Monday",
    "description": "U.S. President Donald Trump is scheduled on Monday to address the Knesset.",
    "link": "https://abcnews.go.com/International/live-updates/israel-gaza-live-updates/?id=126446763",
    "timestamp": "2025-10-13T05:22:52Z"
  },
  {
    "title": "Hamas publishes list of over 1,900 Palestinian prisoners set for release under ceasefire",
    "description": "Hamas on Monday published list of over 1,900 Palestinian prisoners it said will be released in Israel-Hamas war ceasefire. The release comes after the militant group offered a list of the 20 living hostages it would release as part of the deal.",
    "link": "https://www.thehindubusinessline.com/news/world/hamas-publishes-list-of-over-1900-palestinian-prisoners-set-for-release-under-ceasefire/article70157373.ece",
    "timestamp": "2025-10-13T05:21:32Z"
  },
  {
    "title": "MARA Holdings Buys $46 Million in Bitcoin Post-Crypto Market Tumble",
    "description": "MARA has bought $46 million BTC after Friday's event, with one analyst saying the firm is \"taking a call\" that Bitcoin has more room to run.",
    "link": "https://decrypt.co/343979/mara-holdings-46-million-bitcoin-historic-market-crash",
    "timestamp": "2025-10-13T05:21:19Z"
  },
  {
    "title": "Watch Live: Hamas to Release Israeli Hostages From Gaza",
    "description": "As the fragile ceasefire in Gaza holds, Israel anticipates the release of all remaining Israeli hostages, including its final 20 living hostages, from Hamas captivity Monday morning, under the first phase of a historic U.S.-brokered peace plan spearheaded by …",
    "link": "https://www.breitbart.com/middle-east/2025/10/12/watch-live-hamas-to-release-israeli-hostages-from-gaza/",
    "timestamp": "2025-10-13T05:21:09Z"
  },
  {
    "title": "All living Israeli hostages freed, nearly 2,000 Palestinian prisoners released",
    "description": "All 20 living hostages held by Hamas and hundreds of Palestinian prisoners held by Israel walked free Monday as part of a ceasefire pausing two years of war that decimated the Gaza Strip and killed tens of thousands of Palestinians.",
    "link": "https://www.cbc.ca/news/world/israel-gaza-hostages-released-9.6936698",
    "timestamp": "2025-10-13T05:19:54Z"
  },
  {
    "title": "IMF Meetings To Begin Under Fresh Cloud Of US-China Trade Tensions",
    "description": "The IMF and World Bank's semi-annual gathering of finance ministers and central bank governors gets underway in Washington on Monday, against the backdrop of new trade threats from the world's two largest economies.",
    "link": "https://www.ibtimes.com/imf-meetings-begin-under-fresh-cloud-us-china-trade-tensions-3786677",
    "timestamp": "2025-10-13T05:18:05Z"
  },
  {
    "title": "Trump praises Erdoğan's 'fantastic' role in securing Gaza ceasefire",
    "description": "U.S. President Donald Trump on Sunday praised Türkiye’s role in efforts to secure a ceasefire deal in Gaza, describing President Recep Tayyip Erdogan as “fantastic” and emphasizing Ankara’s influence in the region.",
    "link": "https://www.hurriyetdailynews.com/trump-praises-erdogans-fantastic-role-in-securing-gaza-ceasefire-214610",
    "timestamp": "2025-10-13T05:16:46Z"
  },
  {
    "title": "Donald Trump To Get Israel's Highest Civilian Award For Hostage Deal",
    "description": "US President Donald Trump will receive Israel's highest civilian award for his role in bringing an end to the Gaza war and ensuring the release of all hostages abducted by Hamas two years ago.",
    "link": "https://www.ndtvprofit.com/world/donald-trump-to-get-israels-highest-civilian-award-for-hostage-deal",
    "timestamp": "2025-10-13T05:12:17Z"
  },
  {
    "title": "IMF meetings to begin under fresh cloud of US-China trade tensions",
    "description": "The IMF and World Bank's semi-annual gathering of finance ministers and central bank governors gets underway in Washington on Monday, against the backdrop of...",
    "link": "https://finance.yahoo.com/news/imf-meetings-begin-under-fresh-051036378.html",
    "timestamp": "2025-10-13T05:10:36Z"
  },
  {
    "title": "US calls for China to release 30 leaders of influential underground church",
    "description": "Zion Church, founded by pastor Jin Mingri in 2007, is one of China's largest underground church networks.",
    "link": "https://www.bbc.com/news/articles/c364n004wxzo",
    "timestamp": "2025-10-13T05:07:18Z"
  },
  {
    "title": "Trump's reignited trade war with China clouds IMF, World Bank meetings",
    "description": "WASHINGTON (Reuters) -Finance chiefs gathering in Washington this week were ready to discuss the global economy's surprising resilience in the face of Donald...",
    "link": "https://www.yahoo.com/news/articles/trumps-reignited-trade-war-china-050416049.html",
    "timestamp": "2025-10-13T05:04:16Z"
  },
  {
    "title": "Worldview: Trump is deploying the army to wage war against an imagined ‘enemy within’",
    "description": "Worldview: The US president has been rapidly intensifying domestic military operations during his second term",
    "link": "https://www.irishtimes.com/opinion/2025/10/11/worldview-trump-is-deploying-the-army-to-wage-war-against-an-imagined-enemy-within/",
    "timestamp": "2025-10-13T05:03:00Z"
  },
  {
    "title": "Analysis-How the United States is eating Trump's tariffs",
    "description": "FRANKFURT/WASHINGTON (Reuters) -U. companies and consumers are bearing the brunt of the country's new import tariffs, early indications show, contradicting...",
    "link": "https://finance.yahoo.com/news/analysis-united-states-eating-trumps-050137442.html",
    "timestamp": "2025-10-13T05:01:37Z"
  },
  {
    "title": "Data centres costing €5.6bn have planning approval but no electricity, industry warns",
    "description": "Access to electricity and gas restricts because of risk of blackouts due to power-hungry sector",
    "link": "https://www.irishtimes.com/ireland/2025/10/13/data-centres-costing-56bn-have-planning-approval-but-no-power-industry-warns/",
    "timestamp": "2025-10-13T05:00:01Z"
  },
  {
    "title": "Countdown to the release of hostages – Scheduled for 8 o’clock, according to Israel (live)",
    "description": "The release of hostages by Hamas will begin at 8 o’clock in the Netzarim corridor and continue at 10 in Khan Younis – Trump also arriving in Israel\nThe post Countdown to the release of hostages – Scheduled for 8 o’clock, according to Israel (live) appeared fi…",
    "link": "https://en.protothema.gr/2025/10/13/countdown-to-the-release-of-hostages-scheduled-for-8-oclock-according-to-israel-live/",
    "timestamp": "2025-10-13T04:54:22Z"
  },
  {
    "title": "A frenetic diplomatic schedule looms for Japan’s next leader — whoever that may be",
    "description": "Japanese diplomacy has landed in a precarious position following the exit of Komeito from the LDP-led ruling bloc as a spate of summits and meetings loom at the end of this month.",
    "link": "https://www.japantimes.co.jp/news/2025/10/13/japan/politics/japan-prime-minister-diplomacy/",
    "timestamp": "2025-10-13T04:53:00Z"
  },
  {
    "title": "China's market rally faces test as U.S. trade rift flare: 'much more difficult couple of weeks now'",
    "description": "China's market rebound may be heading into choppier waters as a resurgence of U.S.-China trade tensions threaten to derail investor optimism.",
    "link": "https://www.cnbc.com/2025/10/13/china-market-shares-csi-300-shanghai-composite-rally-faces-test-us-trade-rift-flares-xi-trump.html",
    "timestamp": "2025-10-13T04:52:39Z"
  },
  {
    "title": "China trade beats forecasts in September as tariff fears rise",
    "description": "China's trade grew faster than expected last month, official data showed Monday, though fresh fears are rising of a major escalation in the tariff war between Beijing and Washington. The world's second-largest economy has in recent years been mired in a persi…",
    "link": "https://japantoday.com/category/business/china-trade-beats-forecasts-in-september-as-tariff-fears-rise",
    "timestamp": "2025-10-13T04:50:28Z"
  },
  {
    "title": "Trump Stuns With Latest ‘Hoax’ Claim: ‘The What Of What Was What Now?’",
    "description": "The president attempted to rewrite the history of a scandal in which he was not even involved.",
    "link": "https://www.huffpost.com/entry/donald-trump-rewrite-history_n_68ec7f2ae4b0e8380ba8c621",
    "timestamp": "2025-10-13T04:48:47Z"
  },
  {
    "title": "Swiss aquatic magic makes a splash",
    "description": "The stage was theirs – as were the water tank and the pool! With Indian-Swiss performer BombayMami singing Chak Dhoom Dhoom and artistic swimmers weaving magic in the water, gliding gracefully like mermaids, the recent edition of the Swiss Art Night, aptly ti…",
    "link": "https://timesofindia.indiatimes.com/entertainment/events/delhi/swiss-aquatic-magic-makes-a-splash/articleshow/124517701.cms",
    "timestamp": "2025-10-13T04:48:41Z"
  },
  {
    "title": "China’s Iron Ore, Copper and Coal Imports Rise to Annual High",
    "description": "China’s commodities purchases broadly turned higher in September as buyers stocked up to meet the usual rise in industrial demand during the autumn months.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-iron-ore-copper-and-coal-imports-rise-to-annual-high",
    "timestamp": "2025-10-13T04:48:39Z"
  },
  {
    "title": "Los Angeles Lakers vs Golden State Warriors Preseason Game Results - Austin Reaves headlines team’s first preseason win",
    "description": "Los Angeles Lakers secured their first preseason victory against the Golden State Warriors, with Austin Reaves leading the charge with 21 points. Rui Hachimura and Dalton Knecht also contributed significantly. Bronny James showcased impressive dunking skills.…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/los-angeles-lakers-vs-golden-state-warriors-preseason-game-results-austin-reaves-headlines-teams-first-preseason-win/articleshow/124517611.cms",
    "timestamp": "2025-10-13T04:46:33Z"
  },
  {
    "title": "Crude oil futures rise as Trump backtracks on China tariff threat",
    "description": "Crude oil futures had fallen nearly 4% on Friday after Trump threatened to impose additional 100% tariff on China",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-as-trump-backtracks-on-china-tariff-threat/article70157329.ece",
    "timestamp": "2025-10-13T04:45:54Z"
  },
  {
    "title": "World leaders throw their weight behind the Gaza ceasefire deal",
    "description": "The U.S. and Egyptian presidents are chairing a summit for peace, aiming to end the two-year war in Gaza after a ceasefire deal",
    "link": "https://abcnews.go.com/International/wireStory/world-leaders-throw-weight-gaza-ceasefire-deal-126461213",
    "timestamp": "2025-10-13T04:45:51Z"
  },
  {
    "title": "Hamas publishes a list of over 1,900 Palestinian prisoners it says will be released in truce",
    "description": "Hamas and Israel are exchanging hostages and prisoners as a ceasefire takes hold, marking a significant step in ending the devastating war. Living hostages are expected to return home first, while hundreds of Palestinian prisoners await release. U.S. Presiden…",
    "link": "https://economictimes.indiatimes.com/news/defence/hamas-publishes-a-list-of-over-1900-palestinian-prisoners-it-says-will-be-released-in-truce/articleshow/124517627.cms",
    "timestamp": "2025-10-13T04:44:06Z"
  },
  {
    "title": "Singapore investors join gold rush as record-breaking rally continues",
    "description": "Gold prices hit a fresh record high of US$4,059.30 on Oct 13, driven by reignited US-China trade tensions. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/singapore-investors-join-gold-rush-as-record-breaking-rally-continues",
    "timestamp": "2025-10-13T04:43:41Z"
  },
  {
    "title": "Markets open lower as Trump’s tariff threats trigger global uncertainty",
    "description": "Markets cautious as Sensex and Nifty fall on renewed U.S.-China trade tensions, with sectoral movers and technical indicators analyzed.",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/markets-open-lower-as-trumps-tariff-threats-trigger-global-uncertainty/article70157303.ece",
    "timestamp": "2025-10-13T04:38:53Z"
  },
  {
    "title": "Asian shares skid after Wall Street tumbles to its worst day since April as China trade woes worsen",
    "description": "Asian shares tumbled on Monday as escalating trade tensions with China shattered a monthslong calm on Wall Street.  U.S. stocks skidded on Friday after...",
    "link": "https://finance.yahoo.com/news/asian-shares-skid-wall-street-043707654.html",
    "timestamp": "2025-10-13T04:37:07Z"
  },
  {
    "title": "Putin says Trump 'doing a lot' to resolve crises",
    "description": "Moscow (AFP) Oct 10, 2025\n\n\n Russian President Vladimir Putin said on Friday that his US counterpart was \"doing a lot\" to resolve world \"crises\" but that it was not for him to decide whether Donald Trump should receive the Nobel prize. \n\nSince returning to th…",
    "link": "https://www.spacewar.com/reports/Putin_says_Trump_doing_a_lot_to_resolve_crises_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Trump says may warn Putin Ukraine could get Tomahawks",
    "description": "Washington (AFP) Oct 12, 2025\n\n US President Donald Trump said Sunday he may warn Russian counterpart Vladimir Putin that Ukraine could get Tomahawk cruise missiles if Moscow does not end its invasion. \n\nTrump has been mulling potential supplies of the long-r…",
    "link": "https://www.spacewar.com/reports/Trump_says_may_warn_Putin_Ukraine_could_get_Tomahawks_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "North Korea shows off 'most powerful' missile at military parade",
    "description": "Seoul (AFP) Oct 11, 2025\n\n\n North Korea showed off its \"most powerful\" intercontinental ballistic missile at a military parade attended by top officials from Russia and China, Pyongyang's state media reported Saturday. \n\nThe event to mark 80 years under the r…",
    "link": "https://www.spacewar.com/reports/North_Korea_shows_off_most_powerful_missile_at_military_parade_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Trump issues order to pay military as US shutdown drags on",
    "description": "Washington (AFP) Oct 11, 2025\n\n\n President Donald Trump said Saturday he had issued an order for the military to be paid next week despite the ongoing government shutdown during which many civil servants are working without salaries. \n\nTrump said he had order…",
    "link": "https://www.spacewar.com/reports/Trump_issues_order_to_pay_military_as_US_shutdown_drags_on_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "US announces deal for Qatar air force facility in Idaho",
    "description": "Washington (AFP) Oct 11, 2025\n\n\n US Defense Secretary Pete Hegseth announced Friday that Qatar will be allowed to build an air force facility at Mountain Home Air Base in Idaho that will house F-15 fighter jets and pilots. \n\nThe announcement comes soon after …",
    "link": "https://www.spacedaily.com/reports/US_announces_deal_for_Qatar_air_force_facility_in_Idaho_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Trump says US 'wants to help China, not hurt it'",
    "description": "Washington (AFP) Oct 12, 2025\n\n President Donald Trump said Sunday the United States wants to help China, not hurt it, striking a conciliatory tone days after threatening an additional 100 percent tariff on the world's second-largest economy. \n\nTrump's statem…",
    "link": "https://www.spacewar.com/reports/Trump_says_US_wants_to_help_China_not_hurt_it_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "UK, France, Germany aim to restart Iran nuclear talks",
    "description": "London (AFP) Oct 10, 2025\n\n\n Britain, France and Germany will seek to restart stalled nuclear talks with Iran and the United States, the three European countries said in a joint statement on Friday. \n\nTheir announcement came nearly two weeks after UN sanction…",
    "link": "https://www.spacewar.com/reports/UK_France_Germany_aim_to_restart_Iran_nuclear_talks_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "North Korea reports holding 'grand' military parade",
    "description": "Seoul (AFP) Oct 10, 2025\n\n\n North Korea held a \"grand military parade\" to mark 80 years under the ruling Workers' Party, showing off some of its most advanced weapons to a bevy of high-level foreign guests, state media reported Saturday. \n\nThe event came as l…",
    "link": "https://www.spacewar.com/reports/North_Korea_reports_holding_grand_military_parade_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Spain says 'committed to NATO' after Trump expulsion threat",
    "description": "Madrid (AFP) Oct 10, 2025\n\n\n Spain hit back at Donald Trump on Friday after the US President suggested expelling the country from NATO for failing to meet his ramped-up defence spending target. \n\nIn June, the 32-nation military alliance agreed to massively bo…",
    "link": "https://www.spacewar.com/reports/Spain_says_committed_to_NATO_after_Trump_expulsion_threat_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Nobel Peace Prize winner Machado dedicates award to Trump",
    "description": "Caracas (AFP) Oct 10, 2025\n\n Venezuelan opposition leader Maria Corina Machado dedicated her Nobel Peace Prize on Friday to the people of Venezuela - and US President Donald Trump, for his \"decisive support\" for her country's pro-democracy movement. \n\n\"I dedi…",
    "link": "https://www.spacewar.com/reports/Nobel_Peace_Prize_winner_Machado_dedicates_award_to_Trump_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Middle East: Israel awaits release of hostages held in Gaza",
    "description": "All living hostages held by Hamas are expected to be released in exchange for Palestinian prisoners. Meanwhile, US President Donald Trump is heading to the region to for a peace summit in Egypt. Follow DW.",
    "link": "https://www.dw.com/en/middle-east-israel-awaits-release-of-hostages-held-in-gaza/live-74326286",
    "timestamp": "2025-10-13T04:34:00Z"
  },
  {
    "title": "First group of Israeli hostages released",
    "description": "All living hostages held by Hamas are expected to be released in exchange for Palestinian prisoners. Meanwhile, US President Donald Trump is heading to the region to for a peace summit in Egypt. Follow DW. Israeli media report seven hostages have been handed …",
    "link": "https://www.dw.com/en/first-group-of-israeli-hostages-released/live-74326286",
    "timestamp": "2025-10-13T04:34:00Z"
  },
  {
    "title": "Big questions surround 3rd-quarter earnings",
    "description": "Donald Trump has said he thinks quarterly earnings are a waste of time. There hasn't been a huge groundswell of support to releasing corporate earnings, say, twice a year.\nSo the ritual of companies releasing earnings reports and holding earnings call is stil…",
    "link": "https://biztoc.com/x/079feec9b3d304ed",
    "timestamp": "2025-10-13T04:32:45Z"
  },
  {
    "title": "WRAPUP 2-Trump To Be Lauded In Israel As Long-held Hostages Return Home",
    "description": "Israel and Hamas were locked in tense, albeit indirect, negotiations over the list of Palestinian prisoners to be freed.",
    "link": "https://www.huffpost.com/entry/trump-israel-hostages-return-speech_n_68ec7fa5e4b096c4c84fb04f",
    "timestamp": "2025-10-13T04:31:12Z"
  },
  {
    "title": "India’s beauty maestro Dr. Shagun Gupta takes center stage at Permanent Makeup (PMU) Tokyo Summit 2025",
    "description": "Dr. Shagun Gupta, a leading Indian beauty expert, will co-organize and be the chief guest at the PMU Tokyo Summit 2025. This prestigious event, held from November 1st to 3rd, 2025, will bring together global influencers in permanent beauty and aesthetic techn…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/indias-beauty-maestro-dr-shagun-gupta-takes-center-stage-at-permanent-makeup-pmu-tokyo-summit-2025/articleshow/124517396.cms",
    "timestamp": "2025-10-13T04:30:05Z"
  },
  {
    "title": "Nidal Al-Mughrabi: Why Hamas decided to trust Donald Trump and release the hostages",
    "description": "Hamas has called Donald Trump a racist, a “recipe for chaos” and a man with an absurd vision for Gaza.",
    "link": "https://www.independent.ie/opinion/analysis/nidal-al-mughrabi-why-hamas-decided-to-trust-donald-trump-and-release-the-hostages/a100881421.html",
    "timestamp": "2025-10-13T04:30:00Z"
  },
  {
    "title": "Sikh man with tumour held by US immigration denied medical care - family",
    "description": "Paramjit Singh, an Indian passport holder, has lived in the US on a green card since 1994.",
    "link": "https://www.bbc.com/news/articles/cm2z7gkd87lo",
    "timestamp": "2025-10-13T04:28:37Z"
  },
  {
    "title": "China Trade Beats Forecasts In September As Tariff Fears Rise",
    "description": "China's trade grew faster than expected last month, official data showed Monday, though fresh fears are rising of a major escalation in the tariff war between Beijing and Washington.",
    "link": "https://www.ibtimes.com/china-trade-beats-forecasts-september-tariff-fears-rise-3786671",
    "timestamp": "2025-10-13T04:27:09Z"
  },
  {
    "title": "China's rare earth exports fall sharply in September",
    "description": "China, the world's largest exporter of rare earths, sold 4,000.3 tonnes of rare earths in September, down 30.9% from August",
    "link": "https://www.thehindubusinessline.com/news/world/chinas-rare-earth-exports-fall-sharply-in-september/article70157296.ece",
    "timestamp": "2025-10-13T04:25:54Z"
  },
  {
    "title": "Philippines says China rammed their ship in South China Sea",
    "description": "The Philippines accused a Chinese ship of deliberately colliding with a Philippine vessel near Thitu Island in the disputed South China Sea, also using water cannons. China, however, blamed the Philippines, stating its vessels illegally entered the waters and…",
    "link": "https://timesofindia.indiatimes.com/world/china/philippines-says-china-rammed-their-ship-in-south-china-sea/articleshow/124517057.cms",
    "timestamp": "2025-10-13T04:23:31Z"
  },
  {
    "title": "China trade beats forecasts in September as tariff fears rise",
    "description": "China’s trade grew faster than expected last month, official data showed Monday, though fresh fears are rising of a major escalation in the tariff war between Beijing and Washington. The world’s second-largest economy has in recent years been mired in a persi…",
    "link": "https://www.digitaljournal.com/world/china-trade-beats-forecasts-in-september-as-tariff-fears-rise/article",
    "timestamp": "2025-10-13T04:22:32Z"
  },
  {
    "title": "Asian TT: Hong Kong make short work of Indian men",
    "description": "The Indian men's table tennis team was eliminated from the Asian Championships after a 0-3 quarterfinal loss to Hong Kong. Despite moments of brilliance, the Indian players struggled under pressure, failing to capitalize on crucial points. Head coach Massimo …",
    "link": "https://timesofindia.indiatimes.com/sports/more-sports/others/asian-tt-hong-kong-make-short-work-of-indian-men/articleshow/124517295.cms",
    "timestamp": "2025-10-13T04:21:55Z"
  },
  {
    "title": "Donald Trump Makes Admission About His Chances Of Heaven",
    "description": "Fox News' Peter Doocy asked the president about his afterlife prospects.",
    "link": "https://www.huffpost.com/entry/donald-trump-heaven_n_68ec794ae4b04c87b806c335",
    "timestamp": "2025-10-13T04:21:45Z"
  },
  {
    "title": "Taiwan sees no significant impact on chip sector from China rare earths curbs",
    "description": "Taiwan is home to the world's largest contract chipmaker TSMC, the producer of the vast majority of advanced chips that are a key component of artificial intelligence applications.",
    "link": "https://indianexpress.com/article/technology/tech-news-technology/taiwan-sees-no-significant-impact-on-chip-sector-from-china-rare-earths-curbs-10303621/",
    "timestamp": "2025-10-13T04:20:01Z"
  },
  {
    "title": "MP shocker: Youth made to wash feet, drink water as 'punishment' over AI-generated image; 6 booked",
    "description": "In Damoh, Madhya Pradesh, a young man faced public humiliation at a village panchayat for an AI-generated meme. He was allegedly forced to wash and drink water from the feet of another man as punishment. The incident, captured on video and widely shared, has …",
    "link": "https://timesofindia.indiatimes.com/city/bhopal/mp-shocker-youth-made-to-wash-feet-drink-water-as-punishment-over-ai-generated-image-6-booked/articleshow/124516854.cms",
    "timestamp": "2025-10-13T04:18:50Z"
  },
  {
    "title": "China's exports, imports top forecasts amid backdrop of fresh trade tensions",
    "description": "China's export growth accelerates, diversifying markets beyond U.S., amid trade war tensions with Trump administration.",
    "link": "https://www.thehindubusinessline.com/news/world/chinas-exports-imports-top-forecasts-amid-backdrop-of-fresh-trade-tensions/article70157273.ece",
    "timestamp": "2025-10-13T04:18:46Z"
  },
  {
    "title": "China's rare earth export ban broadens; US vows strong retaliation",
    "description": "China, on October 9, announced a major expansion of its rare earth export controls, escalating tensions with the US and drawing sharp criticism from President Donald Trump. In response, Trump vowed to impose 100% tariffs on Chinese goods starting on November …",
    "link": "https://www.digitimes.com/news/a20251013PD217/china-rare-earth-materials-exports-usa-taiwan.html",
    "timestamp": "2025-10-13T04:18:35Z"
  },
  {
    "title": "Jasmine Crockett Launches Investigation Into Alleged Cover Up Of Trump’s Failing Health: ‘The American People Deserve the Truth’ - NewsBreak",
    "description": "Congresswoman Jasmine Crockett (TX-30) has formally demanded answers from the White House regarding President Donald J. Trump’s health, citing what she cal",
    "link": "https://www.newsbreak.com/share/4286932363008-jasmine-crockett-launches-investigation-into-alleged-cover-up-of-trump-s-failing-health-the-american-people-deserve-the-truth?s=a2&amp;share_destination_id=MzUwNDAwOTQyLTE3NjAzMjg5NzQ3MDI%3D&amp;pd=0NiFI6Ya&amp;hl=en_US&amp;send_time=1760328974&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.3%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-13T04:18:11Z"
  },
  {
    "title": "Release of hostages to begin at 8 a.m., says Hamas, Herzog awards Trump medal of honor (10pm Pacific/ 1am Eastern) -- Live Updates",
    "description": "Hamas tells Red Cross that release of hostages will begin at 8:00 a.m. (10pm Pacific/ 1am Eastern). The report also mentioned that a technical meeting was held last night between Hamas and the Red Cross team to arrange the handover. Herzog to give Trump presi…",
    "link": "https://freerepublic.com/focus/f-news/4346028/posts",
    "timestamp": "2025-10-13T04:14:02Z"
  },
  {
    "title": "China’s exports to US drop in September, while rise in global shipments hits a 6-month high",
    "description": "HONG KONG (AP) — China’s exports to the United States fell 27% in September from the year before, even though growth in its global exports hit a six-month high. Customs figures released Monday showed that China’s worldwide exports were 8.3% higher than a year…",
    "link": "https://financialpost.com/pmn/chinas-exports-to-us-drop-in-september-while-rise-in-global-shipments-hits-a-6-month-high",
    "timestamp": "2025-10-13T04:12:50Z"
  },
  {
    "title": "China’s Export Growth Hits Six-Month High as Trade War Escalates - Bloomberg.com",
    "description": "China’s Export Growth Hits Six-Month High as Trade War EscalatesBloomberg.com China September exports beat expectations, imports rise at fastest pace since April 2024CNBC China exports accelerate as Xi Jinping and Donald Trump raise stakes in trade warFinanci…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179767220",
    "timestamp": "2025-10-13T04:12:25Z"
  },
  {
    "title": "Sensex falls over 400 pts, Nifty slips below 25,200 as global trade tensions flare",
    "description": "Indian benchmark indices Sensex and Nifty opened lower Monday, impacted by financial and oil & gas sector declines. Renewed global trade tensions, fueled by U.S. President Trump's actions against Beijing and China's rare earth export restrictions, rattled inv…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-400-pts-nifty-slips-below-25200-as-global-trade-tensions-flare/articleshow/124517045.cms",
    "timestamp": "2025-10-13T04:06:43Z"
  },
  {
    "title": "World leaders throw their weight behind the Gaza ceasefire deal",
    "description": "The U.S. and Egyptian presidents are chairing a gathering of world leaders dubbed “the Summit for Peace” to support ending the two-year war in Gaza after a...",
    "link": "https://www.yahoo.com/news/articles/world-leaders-throw-weight-behind-040631173.html",
    "timestamp": "2025-10-13T04:06:31Z"
  },
  {
    "title": "Is Donald Trump Intent Upon Imposing Martial Law in America?",
    "description": "History In 1936, the Nazi dictatorship in Germany organized SiPo, or Sicherheitspolizei. The move merged the Gestapo (Geheime Staatspolizei) and the Kriminalpolizei (Kripo, the criminal police). SiPo targeted political opposition to the Nazis, primarily commu…",
    "link": "https://www.lewrockwell.com/2025/10/no_author/is-donald-trump-intent-upon-imposing-martial-law-in-america/",
    "timestamp": "2025-10-13T04:01:00Z"
  },
  {
    "title": "Can Marijuana Legalization Help Keep Republican Majorities in Congress?",
    "description": "Eight years ago this month I commented that “I would not be surprised to see the US government legalize marijuana within the next five years.” That conclusion came upon my consideration of the then 64 percent nationwide support for legalization among American…",
    "link": "https://www.lewrockwell.com/2025/10/no_author/can-marijuana-legalization-help-keep-republican-majorities-in-congress/",
    "timestamp": "2025-10-13T04:01:00Z"
  },
  {
    "title": "Donald Trump, 79, Skewered for Embarrassing Geographical Flub",
    "description": "Donald Trump has made an awkward Middle East geographical blunder as he heads to Israel for the release of hostages from Gaza. Trump, 79, was talking to...",
    "link": "https://www.thedailybeast.com/donald-trump-79-skewered-for-embarrassing-geographical-flub/",
    "timestamp": "2025-10-13T04:00:33Z"
  },
  {
    "title": "Let's make Columbus Day great again",
    "description": "You can say Happy Columbus Day again. Delighted to see that because Columbus is totally misunderstood. Furthermore, much of this Columbus Derangement Syndrome is not really about what the guy did in 1492.\r\n\r\nThis is another attack on our culture, our...",
    "link": "https://www.americanthinker.com/blog/2025/10/let_s_make_columbus_day_great_again.html",
    "timestamp": "2025-10-13T04:00:00Z"
  },
  {
    "title": "The new Gazan Board of Peace: Can it work?",
    "description": "When I first heard this news about the Board of Peace in Gaza, I felt some trepidation: Does Donald Trump need one more project to lead, given all that he’s doing in the U.S.? But the fact is, Trump is probably the best person to head this Boar...",
    "link": "https://www.americanthinker.com/blog/2025/10/the_new_gazan_board_of_peace_can_it_work.html",
    "timestamp": "2025-10-13T04:00:00Z"
  },
  {
    "title": "From Oslo To Obsolescence: The Death Of The Nobel Peace Prize",
    "description": "The Nobel Peace Prize is dead—and it died of cowardice.\r\n\r\nThey gave Barack Obama a Nobel Peace Prize for hope.\r\n\r\nDonald Trump earned a ten for results—and got no prize.\r\n\r\nThat single fact reveals more about the moral and institutional ...",
    "link": "https://www.americanthinker.com/articles/2025/10/from_oslo_to_obsolescence_the_death_of_the_nobel_peace_prize.html",
    "timestamp": "2025-10-13T04:00:00Z"
  },
  {
    "title": "MAHA movement appeals to USDA’s Secretary Brooke Rollins to support small farms",
    "description": "Various organizations supporting the MAHA movement have written a letter to USDA’s Secretary Brooke Rollins, imploring her to adopt policies that support organic and regenerative farming to restore soil and food quality and boost struggling sma...",
    "link": "https://www.americanthinker.com/blog/2025/10/maha_movement_appeals_to_usda_s_secretary_brooke_rollins_to_support_small_farms.html",
    "timestamp": "2025-10-13T04:00:00Z"
  },
  {
    "title": "China's exports to US fall 27% in September, while global shipments jump",
    "description": "China has reported its exports to the United States fell 27% in September from the year before, even though growth in its global exports hit a six-month high. Customs figures released Monday showed that China's worldwide exports were 8.3% higher than a year e…",
    "link": "https://apnews.com/article/china-trade-trump-tariffs-exports-4d65b77167ed9193244942923f0eef8d",
    "timestamp": "2025-10-13T03:57:20Z"
  },
  {
    "title": "China's exports to US drop in September, while rise in global shipments hits a 6-month high",
    "description": "China's exports to the United States fell 27% in September from the year before, even though growth in its global exports hit a six-month high.  Customs...",
    "link": "https://www.yahoo.com/news/articles/chinas-exports-us-drop-september-035719679.html",
    "timestamp": "2025-10-13T03:57:19Z"
  },
  {
    "title": "Trump, oldest elected US president, in 'excellent' health: doctor - NewsBreak",
    "description": "Donald Trump is in \"excellent overall health,\" his physician said Friday after the 79-year-old -- the oldest elected president in US history -- underwent h",
    "link": "https://www.newsbreak.com/share/4284129155719-trump-oldest-elected-us-president-in-excellent-health-doctor?s=a2&amp;share_destination_id=MjUzMjk1NzM0LTE3NjAzMjc3ODU0MjU%3D&amp;pd=0H8nn4uG&amp;hl=en_US&amp;send_time=1760327785&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-13T03:56:52Z"
  },
  {
    "title": "Iran Boycotts Gaza Peace Summit",
    "description": "Iranian Foreign Minister Abbas Araghchi announced that neither President Pezeshkian nor he will attend the Sharm El-Sheikh summit, despite Egypt’s invitation.",
    "link": "https://sputnikglobe.com/20251013/iran-boycotts-gaza-peace-summit-1122948839.html",
    "timestamp": "2025-10-13T03:56:00Z"
  }
]