[
  {
    "title": "ICE Arrests 68 Tren de Aragua Gang Members",
    "description": "Federal authorities arrested 68 members of the notorious gang Tren De Aragua this week, according to a new report from the Department of Homeland Security (DHS). “In less than 100 days, the Trump Administration has arrested 394 members of the Tren De Aragua—a…",
    "link": "https://freerepublic.com/focus/f-news/4306335/posts",
    "timestamp": "2025-03-24T01:13:11Z"
  },
  {
    "title": "Are Tiger Woods & Vanessa Trump Dating? Inside the Rumors",
    "description": "Multiple reports surfaced in early March suggesting that Tiger and Vanessa were quietly dating. Find out if it's true and learn more about their relationship here.",
    "link": "https://hollywoodlife.com/2025/03/23/tiger-woods-vanessa-trump-dating/",
    "timestamp": "2025-03-24T01:10:08Z"
  },
  {
    "title": "Share Market Highlights: Sensex jumps 1.4%, Nifty gains 1.32% as foreign buying lifts markets",
    "description": "Sensex, Nifty updates on 24 March 2025: The benchmark BSE Sensex jumped 1.4% to 77,984.38, while the NSE Nifty gained 1.32% to 23,658, driven by renewed foreign investor interest and bargain hunting. Banking and IT stocks led the rally. The Indian rupee surge…",
    "link": "https://www.thehindubusinessline.com/markets/stock-market-highlights-24-march-2025/article69365394.ece",
    "timestamp": "2025-03-24T01:10:00Z"
  },
  {
    "title": "Russia-Ukraine War Live News Updates: Ukraine, US teams hold talks in Saudi Arabia, US envoy hopeful on ending war",
    "description": "Russia-Ukraine War Live News Updates: Ukraine, US teams hold talks in Saudi Arabia, US envoy hopeful on ending war",
    "link": "https://m.economictimes.com/news/newsblogs/india-news-pm-modi-donald-trump-kunal-kamra-eknath-shinde-venessa-trump-tiger-woods-elon-musk-pope-francis-gaza-israel-war-ukraine-russia-heathrow-airport-march-24/liveblog/119399580.cms",
    "timestamp": "2025-03-24T01:04:17Z"
  },
  {
    "title": "CNBC Daily Open: Tariff flexibility sounds good, but also signals uncertainty",
    "description": "\"Flexibility\" connotes openness to change. U.S. President Donald Trump expressed Friday the possibility of being flexible with tariffs, which may have helped stocks tick up, pushing the three key U.S. benchmarks into the green for the week.\nBut, in its sugges…",
    "link": "https://biztoc.com/x/b43018b40e7dc5d7",
    "timestamp": "2025-03-24T01:04:01Z"
  },
  {
    "title": "Nikki Glaser Says She Now Considers Possibility Of Death Threats Or Being “Detained” Before Doing Political Humor: “It’s Like A Real Fear”",
    "description": "﻿Nikki Glaser was one of the few celebrities to walk the red carpet at this year’s Mark Twain Prize — certainly not because of the honoree, but perhaps because of the “elephant in the room.” Glaser said that she expected the evening would focus on honoree Con…",
    "link": "http://deadline.com/2025/03/nikki-glaser-death-threats-political-jokes-1236347416/",
    "timestamp": "2025-03-24T01:01:58Z"
  },
  {
    "title": "TV News Orgs Avoid Saying ‘Gulf of Mexico’ During Astronaut Splashdown, Transcript Review Shows",
    "description": "Newscasters \"tied themselves in knots, performing linguistic gymnastics to stay out of Donald Trump’s crosshairs,\" Oliver Darcy writes\nThe post TV News Orgs Avoid Saying ‘Gulf of Mexico’ During Astronaut Splashdown, Transcript Review Shows appeared first on T…",
    "link": "https://www.thewrap.com/tv-news-avoid-gulf-of-mexico-astronaut-splashdown-trump/",
    "timestamp": "2025-03-24T01:01:16Z"
  },
  {
    "title": "Small-cap mutual funds can be good starting point for new investors: Vinit Sambre, Equities head, DSP Investment Managers",
    "description": "Unlike many fund managers, Vinit Sambre, Head, Equities, DSP Investment Managers, believes that small-cap funds are ideal for first-time investors. This, despite the category taking a massive beating during this market fall. In conversation with Kayezad E. Ad…",
    "link": "https://economictimes.indiatimes.com/wealth/invest/small-cap-mutual-funds-can-be-good-starting-point-for-new-investors-vinit-sambre-equities-head-dsp-investment-managers/articleshow/119310959.cms",
    "timestamp": "2025-03-24T01:00:00Z"
  },
  {
    "title": "Serbia’s massive protests: The risks and opportunities for Vucic",
    "description": "Vucic himself could emerge from the ongoing protests in a stronger position domestically if he only heeds the EU’s recommendations.",
    "link": "https://www.jpost.com/opinion/article-847232",
    "timestamp": "2025-03-24T00:56:55Z"
  },
  {
    "title": "Schumer: 'I won't step down' amid pressure from critics",
    "description": "Senate Minority leader Chuck Schumer, D-N,Y, has rejected calls from his critics to vacate his post, part of the ongoing rancor swirling in Congress about...",
    "link": "https://www.upi.com/Top_News/US/2025/03/23/schumer-wont-step-down-amid-pressure/2051742777471/",
    "timestamp": "2025-03-24T00:56:01Z"
  },
  {
    "title": "Tiger Woods and Vanessa Trump Confirm Relationship With PDA Photo",
    "description": "Tiger Woods and Vanessa Trump's love is in full swing—and Instagram official.\nThe golf champion and the 47-year-old, ex-wife of President Donald Trump's eldest son Donald Trump Jr., has confirmed...",
    "link": "https://www.eonline.com/news/1415142/tiger-woods-confirms-hes-dating-vanessa-trump",
    "timestamp": "2025-03-24T00:54:03Z"
  },
  {
    "title": "Netanyahu After Deadliest Night Yet for Gazan Children: This is Just the Beginning",
    "description": "Israel Katz, the IDF head, says the ‘game has changed’ in Gaza Israeli Prime Minister Benjamin Netanyahu, who is particularly bold these days because he owns the occupant inside the White House, warned Gazans that the airstrikes that killed at least 430 — inc…",
    "link": "https://www.activistpost.com/netanyahu-after-deadliest-night-yet-for-gazan-children-this-is-just-the-beginning/",
    "timestamp": "2025-03-24T00:54:00Z"
  },
  {
    "title": "CNBC Daily Open: Tariff flexibility sounds good, but also signals uncertainty",
    "description": "We will probably not have any clarification on how the reciprocal tariffs will play out until April 2 — provided Trump isn’t also flexible with the start date.",
    "link": "https://www.cnbc.com/2025/03/24/cnbc-daily-open-tariff-flexibility-could-also-mean-uncertainty.html",
    "timestamp": "2025-03-24T00:53:19Z"
  },
  {
    "title": "Tiger Woods Shares First Photos With Vanessa Trump, Goes Instagram Official: 'Love Is In the Air'",
    "description": "Tiger Woods and Vanessa Trump are making their relationship official! The 49-year-old pro golfer and the 47-year-old ex wife of Donald Trump Jr were revealed to be dating earlier this month, and it was also reported that things were “very casual.” Well, now, …",
    "link": "https://www.justjared.com/2025/03/23/tiger-woods-shares-first-photos-with-vanessa-trump-goes-instagram-official-love-is-in-the-air/",
    "timestamp": "2025-03-24T00:51:12Z"
  },
  {
    "title": "Protestors target Walnut Creek Tesla store, Trump, Elon Musk",
    "description": "Upwards of 1,000 protestors took to the downtown shopping area of Walnut Creek on Saturday to protest changes in government policy and institutions being made by President Donald Trump and DOGE head Elon Musk.",
    "link": "https://www.ktvu.com/news/protesters-target-tesla-elon-musk-trump-east-bay-march",
    "timestamp": "2025-03-24T00:49:15Z"
  },
  {
    "title": "Tiger Woods Confirms His Relationship With Vanessa Trump In A Social Media Post",
    "description": "Tiger Woods has confirmed his relationship with the former daughter-in-law of President Donald Trump.",
    "link": "https://www.huffpost.com/entry/bc-glf-woods-vanessa-trump_n_67e0aac9e4b0fde512a029d0",
    "timestamp": "2025-03-24T00:47:30Z"
  },
  {
    "title": "Former US Attorney Jessica Aber had 'medical issue' prior to unexpected death: source",
    "description": "As authorities investigate the death of former United States Attorney Jessica D. Aber, a family friend has revealed that the 43-year-old had a chronic health condition.",
    "link": "https://www.foxnews.com/us/former-us-attorney-jessica-aber-had-medical-issue-prior-unexpected-death-source",
    "timestamp": "2025-03-24T00:46:32Z"
  },
  {
    "title": "Defense Officials Ready to Present Plans for Space-Age 'Golden Dome'—Could It Actually Become a Reality?",
    "description": "Then-President Ronald Reagan was widely mocked by Democrats in 1983 when he proposed a “Star Wars”-like weapons system (the Strategic Defense Initiative aka SDI) designed to protect the United States from attack. Many years later, some of the technology devel…",
    "link": "https://freerepublic.com/focus/f-bloggers/4306325/posts",
    "timestamp": "2025-03-24T00:44:11Z"
  },
  {
    "title": "Trump Wants to Fix American Shipbuilding. It Won’t Be Easy",
    "description": "If U.S. shipbuilding shortfalls are not rectified soon, America may not be able to maintain the superior fleets it has enjoyed for many years.\nThe post Trump Wants to Fix American Shipbuilding. It Won’t Be Easy appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/trump-wants-to-fix-american-shipbuilding-it-wont-be-easy/",
    "timestamp": "2025-03-24T00:42:53Z"
  },
  {
    "title": "'Nobody likes a bad picture of themselves': Trump rages that Obama painting is 'wonderful'",
    "description": "Donald Trump on Sunday complained about a painting of himself, saying that the same artist did one of President Obama, and that \"he looks wonderful.\"\n\nTrump took to Truth Social over the weekend, saying, \"Nobody likes a bad picture or painting of themselves, …",
    "link": "https://www.rawstory.com/trump-painting-obama-wonderful/",
    "timestamp": "2025-03-24T00:42:07Z"
  },
  {
    "title": "Why Europe can’t defend itself",
    "description": "Imagine a world in which western Europe was actually able to stick it to Vladimir Putin and Donald Trump simultaneously. As if. Back in the real world, there’s a remote possibility the Europeans might get their act together sufficiently to stand up to one, or…",
    "link": "https://biztoc.com/x/a951e6e39e65a497",
    "timestamp": "2025-03-24T00:41:49Z"
  },
  {
    "title": "‘Tesla Takedown’ protest lines South Jersey highway",
    "description": "Hundreds of people toting signs lined Route 70 in Cherry Hill Saturday to protest outside a Tesla dealership as part of the national movement nicknamed “Tesla Takedowns.”\nThe protest was another in the national movement that has emerged since President Donald…",
    "link": "https://biztoc.com/x/3ed4c032eea8d728",
    "timestamp": "2025-03-24T00:41:44Z"
  },
  {
    "title": "Bar That Threw Out MAGA Customer Proves Again That Leftists Are the Most Intolerant People on Earth",
    "description": "On March 16, I wrote here about Chatterbox Jazz, a club in Indianapolis where a bartender of the he/she/it variety petulantly grabbed a baseball bat and threatened a MAGA hat-wearing customer to get out of the bar, or else. The place was inundated both with p…",
    "link": "https://freerepublic.com/focus/f-bloggers/4306324/posts",
    "timestamp": "2025-03-24T00:40:51Z"
  },
  {
    "title": "Canada's PM Mark Carney Calls For Snap Election Amid Tense US Relations: Asks For 'Strong, Positive Mandate To Deal With President Trump'",
    "description": "Canadian Prime Minister Mark Carney has announced a federal election set for April 28, citing the need to counteract President Donald Trump’s recent tariffs.\nWhat Happened: Carney, who recently took office following Justin Trudeau’s resignation, stated on the…",
    "link": "https://biztoc.com/x/4549ca64a7d18589",
    "timestamp": "2025-03-24T00:30:19Z"
  },
  {
    "title": "China’s Energy Transition at Odds With Solar Glut, Cheap Power",
    "description": "The green energy transition in China is at a critical juncture, as oversupply in the solar sector, declining power prices, and continued reliance on fossil fuels threaten to derail progress.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-energy-transition-at-odds-with-solar-glut-cheap-power",
    "timestamp": "2025-03-24T00:30:13Z"
  },
  {
    "title": "Twenty New England Universities Challenged By Equal Protection Project Over BIPOC Fellowship",
    "description": "BIPOC Fellowship is open to \"everybody except for white people and that’s discrimination. Civil rights laws protect everybody. not just certain groups,”\nThe post Twenty New England Universities Challenged By Equal Protection Project Over BIPOC Fellowship firs…",
    "link": "https://legalinsurrection.com/2025/03/twenty-new-england-universities-challenged-by-equal-protection-project-over-north-star-collective-bipoc-fellowshipw/",
    "timestamp": "2025-03-24T00:30:07Z"
  },
  {
    "title": "India-China relations: Modi's hope for a thaw amid uncertain geopolitics",
    "description": "India and China are natural competitors but developments in strained ties can help with easing diplomatic tensions.",
    "link": "https://www.bbc.com/news/articles/cj4nkxv4e4po",
    "timestamp": "2025-03-24T00:28:55Z"
  },
  {
    "title": "Tiger Woods and Vanessa Trump's relationship goes public in stunning reveal",
    "description": "What was a rumor, or there were only press reports, today has just been confirmed with a publication on Instagram where Tiger Woods appears publicly very close to Vanessa Trump.\n\nT",
    "link": "https://www.marca.com/en/golf/2025/03/24/67e0a6e246163f9a928b458b.html",
    "timestamp": "2025-03-24T00:27:59Z"
  },
  {
    "title": "Man Drives Vehicle Into Group of Tesla Protesters Near Mar-a-Lago in Florida",
    "description": "A Florida man drove his SUV slowly into a crowd of Tesla protesters Saturday, forcing them to quickly retreat or be hit by the vehicle, police said.\nThe post Man Drives Vehicle Into Group of Tesla Protesters Near Mar-a-Lago in Florida first appeared on Mediai…",
    "link": "https://www.mediaite.com/news/man-drives-vehicle-into-group-of-tesla-protesters-near-mar-a-lago-in-florida/",
    "timestamp": "2025-03-24T00:27:46Z"
  },
  {
    "title": "Trump's \"transactional foreign policy\" hits deadlock",
    "description": "U.S. President Donald Trump speaks at a joint press conference with French President Emmanuel Macro",
    "link": "http://en.people.cn/n3/2025/0324/c90000-20292709.html",
    "timestamp": "2025-03-24T00:21:29Z"
  },
  {
    "title": "Attorney General Pam Bondi Slams Federal Judges, Defends Trump’s Use Of Alien Enemies Act",
    "description": "Attorney General Pam Bondi launched a forceful attack on members of the federal judiciary Sunday, accusing judges of overstepping their authority and obstructing President Donald Trump’s policy agenda. During a Fox News interview on Sunday Morning Futures, Bo…",
    "link": "https://freerepublic.com/focus/f-news/4306320/posts",
    "timestamp": "2025-03-24T00:19:52Z"
  },
  {
    "title": "Why April is shaping up to be a BIG month for ASX 200 gold stocks",
    "description": "Already soaring ASX 200 gold stocks could enjoy another month of outperformance in April. But why?\nThe post Why April is shaping up to be a BIG month for ASX 200 gold stocks appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/03/24/why-april-is-shaping-up-to-be-a-big-month-for-asx-200-gold-stocks/",
    "timestamp": "2025-03-24T00:19:18Z"
  },
  {
    "title": "Tiger Woods Publicly Announces New Girlfriend, Who Happens To Be Donald Trump Jr.’s Ex-Wife",
    "description": "Tiger Woods is going official with Vanessa Trump. Two weeks ago, rumors began swirling that Woods had been dating Donald Trump Jr.’s ex-wife for months. According to the Daily Mail, Woods and Trump have seen each other since Thanksgiving. ‘Tiger and Vanessa h…",
    "link": "https://brobible.com/sports/article/tiger-woods-vanessa-trump-instagram/",
    "timestamp": "2025-03-24T00:18:44Z"
  },
  {
    "title": "1 Killed, 15 Wounded In US Airstrike On Yemen's Capital",
    "description": "Local residents described the strike as &quot;very violent,&quot; noting that rescue teams were still searching for possible survivors under the rubble.",
    "link": "https://www.ndtv.com/world-news/1-killed-15-wounded-in-us-airstrike-on-yemens-capital-7994937",
    "timestamp": "2025-03-24T00:18:19Z"
  },
  {
    "title": "Conan O'Brien to Receive Mark Twain Prize Amid Kennedy Center Drama",
    "description": "The comedian's lifetime achievement honor occurs amid unprecedented leadership changes and artistic protests at the national cultural center.",
    "link": "https://www.newsweek.com/conan-obrien-receive-mark-twain-prize-kennedy-center-drama-2049357",
    "timestamp": "2025-03-24T00:18:06Z"
  },
  {
    "title": "Yemen's Hudaydah airport, others targeted in new US 'aggression'",
    "description": "The US military has attacked the airport in Hudaydah in the latest \"American aggression\" against Yemen since Washington announced heavy strikes on the impoverished country one week ago.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250323-presstv08.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "Caribbean countries to express concern to Rubio over additional fees on China-made vessels",
    "description": "Caribbean Community (CARICOM) leaders plan to tell US Secretary of State Marco Rubio next week that the US-proposed \"fines\" on Chinese-made cargo vessels would hurt the region's oil and gas industry as well as push up transportation costs, Bloomberg quoted Gu…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/03/china-250323-globaltimes04.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "Refusing to negotiate directly with the U.S. is a tactic, not a strategy: Foreign minister",
    "description": "Foreign Minister Abbas Araqchi says Iran has decided it is not going to negotiate directly with the United States government for the time being, and that it is a tactic, not a strategy.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250323-irna01.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "US announcement of sixth-gen F-47 fighter draws analyses from Chinese experts",
    "description": "The US' recent announcement of the F-47 fighter jet has drawn intensive analyses from Chinese military affairs experts and observers, who acknowledged the aircraft being a real sixth-generation fighter jet for featuring typical characteristics such as a taill…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250323-globaltimes01.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "Sober Expectations In Russia And Ukraine Ahead Of Saudi Talks",
    "description": "Russian and Ukrainian negotiators will be in the same country as they hold talks with a US delegation in Saudi Arabia, but few expect a major breakthrough.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250323-rferl02.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "US Expects Tangible Progress From Negotiations With Russia in Saudi Arabia",
    "description": "The United States expects tangible progress from the upcoming negotiations with Russia in Saudi Arabia, US President Donald Trump's special envoy for the Middle East, Steve Witkoff, said on Sunday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250323-sputnik01.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "Yemeni forces hit Israel's Ben Gurion airport again with hypersonic ballistic missile",
    "description": "Yemeni Armed Forces have launched another missile attack at the occupying Israeli regime, backing the brave Palestinian resistance against the oppressing regime forces.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250323-presstv04.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "FM: Iran acts upon own interests irrespective of Trump's expectations",
    "description": "Foreign Minister Abbas Araghchi says Iran acts based on its own interests in disregard of the expectations held by US President Donald Trump, stressing Tehran's commitment to diplomacy.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250323-presstv02.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "Hamas condemns US-Israel aggression against Yemen, Lebanon, Syria",
    "description": "The Islamic Resistance Movement Hamas has strongly condemned the brutal US aggression against Yemen, and Israel's aggression against Lebanon, and Syria.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250323-presstv05.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "5-Year-Old Child Killed In Latest Russian Attacks On Ukraine",
    "description": "Russian forces launched a drone attack overnight on the Ukrainian capital, Kyiv, killing three people - including a 5-year-old child - and injuring 10 others, according to the city administration.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250323-rferl03.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "Iran says resolute on its nuclear rights, warns West of counterproductive pressure",
    "description": "The Islamic Republic is resolute on its nuclear rights and warns against the adverse consequences of the West's counterproductive pressure campaign, says the Atomic Energy Organization of Iran (AEOI).",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250323-presstv01.htm",
    "timestamp": "2025-03-24T00:16:45Z"
  },
  {
    "title": "Sinaloa Cartel smuggler at U.S.-Canada border says he'll \"always\" find a way to get migrants into the U.S.",
    "description": "Migrants, some with help from smugglers found on TikTok, are crossing the U.S.-Canada border. A Sinaloa cartel member says President Trump's illegal immigration crackdown will not stop the smuggling.",
    "link": "https://www.cbsnews.com/news/smuggler-migrants-us-canada-border-60-minutes-transcript/",
    "timestamp": "2025-03-24T00:10:11Z"
  },
  {
    "title": "Second lady Usha Vance to visit Greenland as Trump pushes for ownership of the Danish territory",
    "description": "Vance will be joined by Energy Secretary Chris Wright and national security adviser Michael Waltz, two Trump administration sources told NBC News.",
    "link": "https://www.nbcnews.com/politics/trump-administration/second-lady-usha-vance-visit-greenland-trump-mike-waltz-chris-wright-rcna197708",
    "timestamp": "2025-03-24T00:08:39Z"
  },
  {
    "title": "US expected to drop industry-specific tariffs in April",
    "description": "The United States is refining its tariff strategy, moving away from broad industry-specific levies, The Wall Street Journal reported, citing a White House official.\nWhile President Donald Trump had p...",
    "link": "https://biztoc.com/x/c1b786e9593d329a",
    "timestamp": "2025-03-24T00:07:51Z"
  },
  {
    "title": "Day 64: Could Trump's legacy surpass Reagan's?",
    "description": " Follow Trump 100 on your podcast app ",
    "link": "https://news.sky.com/story/trump-100-day-64-could-trumps-legacy-surpass-reagans-13334625",
    "timestamp": "2025-03-24T00:01:00Z"
  },
  {
    "title": "Why India wants critical minerals in its trade deal with US",
    "description": "While India ranks third in the world for rare earth reserves, the US holds the seventh position.",
    "link": "https://www.livemint.com/industry/new-delhi-critical-minerals-trade-us-tax-coal-lithium-joe-biden-piyush-goyal-commerce-ev-trump-tariff-11742725587144.html",
    "timestamp": "2025-03-24T00:00:17Z"
  },
  {
    "title": "Trump Revokes Temporary Status For 530,000 Cubans And Venezuelans",
    "description": "Looks like Trump really wants to piss off a group of people that reliably vote for him, because he is revoking the temporary protected status for over 500,000 people that come from a group that typically vote Republican - Cuban and Venezuelan migrants.\nNBC is…",
    "link": "https://crooksandliars.com/2025/03/trump-revokes-temporary-status-530000",
    "timestamp": "2025-03-24T00:00:01Z"
  },
  {
    "title": "The Time George Foreman Wanted to Talk",
    "description": "Society\n \n \n / \n March 24, 2025\n \r\n\n \nThe Time George Foreman Wanted to Talk\r\n\n\n\nWith the passing of the boxing legend, I want to recall an interview I never expected and will never forget\r\n\n\n\r\n\n \n \n Dave Zirin \r\n\n \n \n Share\n \n \n Copy Link\r\n\n Facebook\r\n\n X (T…",
    "link": "https://www.thenation.com/article/society/george-foreman-dies-memory/",
    "timestamp": "2025-03-24T00:00:00Z"
  },
  {
    "title": "'Offensive and false': Alberta Premier's office denies Smith urged U.S. to interfere in federal election",
    "description": "The office of Alberta Premier Danielle Smith is vehemently denying accusations that she asked the U.S. to interfere with Canadian federal politics, as comments Smith made during an interview with an American news outlet earlier this month made waves this week…",
    "link": "https://www.cbc.ca/news/canada/edmonton/alberta-premier-smith-u-s-canada-election-interference-breitbart-1.7491318",
    "timestamp": "2025-03-23T23:57:56Z"
  },
  {
    "title": "Read the email Paul Weiss Chairman Brad Karp sent to staff after striking a deal with Trump: 'Clients perceived our firm as being persona non grata'",
    "description": "President Donald Trump withdrew his executive order against the law firm Paul Weiss after cutting a deal.\nAlex Wong/Getty Images\nPaul Weiss Chairman Brad Karp sent an email to employees on Sunday.\nThe email addressed the firm's deal with Trump after an execut…",
    "link": "https://biztoc.com/x/e23ccde8ff8a034c",
    "timestamp": "2025-03-23T23:56:35Z"
  },
  {
    "title": "US and Ukraine hold talks in Saudi Arabia",
    "description": "The US and Ukraine held talks in Riyadh on Sunday as part of Trump’s shuttle diplomacy aimed at ending the conflict with Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614673-us-ukraine-hold-talks/",
    "timestamp": "2025-03-23T23:50:15Z"
  },
  {
    "title": "Asia-Pacific markets live: Hang Seng Index, Nikkei",
    "description": "Asia-Pacific markets are set to open mixed on Monday as Donald Trump's April 2 tariffs deadline loom.",
    "link": "https://www.cnbc.com/2025/03/24/asia-pacific-markets-live-hang-seng-index-nikkei.html",
    "timestamp": "2025-03-23T23:46:59Z"
  },
  {
    "title": "Read the email Paul Weiss Chairman Brad Karp sent to staff after striking a deal with Trump: 'Clients perceived our firm as being persona non grata'",
    "description": "Paul Weiss Chairman Brad Karp sent an email to employees on Sunday explaining why the law firm struck a deal with President Donald Trump last week.",
    "link": "https://www.businessinsider.com/paul-weiss-brad-karp-email-staff-trump-deal-executive-order-2025-3",
    "timestamp": "2025-03-23T23:44:52Z"
  },
  {
    "title": "‘Villainous’: Trump and Musk erupt when they learn dark history of anti-deportation judge",
    "description": "'If you don't want us to drag these people, maybe they should learn to hide their bias'",
    "link": "https://www.wnd.com/2025/03/villainous-trump-and-musk-erupt-when-they-learn-dark-history-of-anti-deportation-judge/",
    "timestamp": "2025-03-23T23:42:58Z"
  },
  {
    "title": "Tiger Woods makes Vanessa Trump relationship official in heartfelt post: ‘Love is in the air’",
    "description": "Tiger Woods is making it social media official.",
    "link": "https://nypost.com/2025/03/23/sports/tiger-woods-makes-vanessa-trump-relationship-official-in-heartfelt-post/",
    "timestamp": "2025-03-23T23:40:22Z"
  },
  {
    "title": "'I Don't Care Who Don't Like It': Actor Malik Yoba No Longer Identifies as a 'Black' Man In a Shocking Declaration to Fans",
    "description": "Malik Yoba has stirred up backlash online following his controversial views on identifying as a \"Black\" man. The 'New York Undercover' actor recently shared a",
    "link": "https://atlantablackstar.com/2025/03/23/malik-yoba-no-longer-black-man-non-white-instead/",
    "timestamp": "2025-03-23T23:37:31Z"
  },
  {
    "title": "Tiger Woods confirms Vanessa Trump relationship on social media: 'Love is in the air'",
    "description": "Golf legend Tiger Woods announced on Sunday he and Vanessa Trump are dating. Woods revealed his relationship situation in posts across social media.",
    "link": "https://www.foxnews.com/sports/tiger-woods-confirms-vanessa-trump-relationship-social-media-love-air",
    "timestamp": "2025-03-23T23:37:24Z"
  },
  {
    "title": "Trump's tariffs will end in tears all round",
    "description": "<p>If US President Donald Trump is skilled at anything, it is demagoguery. By stoking voters' fears and prejudices, he manages to win support for, or distract from, extreme policies that benefit himself, his family, and his (mostly ultra-rich) cronies, and ca…",
    "link": "https://www.bangkokpost.com/opinion/opinion/2986023/trumps-tariffs-will-end-in-tears-all-round",
    "timestamp": "2025-03-23T23:35:00Z"
  },
  {
    "title": "Tiger Woods Confirms Vanessa Trump Romance, Posts PDA Photo",
    "description": "Tiger Woods has just confirmed his relationship with Vanessa Trump ... posting a couple pics to his X account -- including one where the two are cuddled up. The golf legend announced the exciting news mere minutes ago with a couple photos including…",
    "link": "https://www.tmz.com/2025/03/23/tiger-woods-confirms-vanessa-trump-romance-posts-photo-pda/",
    "timestamp": "2025-03-23T23:33:02Z"
  },
  {
    "title": "Trump’s 15% cap on grant costs will spark the reform the academy needs",
    "description": "The Trump administration wants to cap \"indirect\" costs at 15% of grant awards. Good.",
    "link": "https://nypost.com/2025/03/23/opinion/trump-15-cap-on-grant-costs-will-spark-the-reform-the-academy-needs/",
    "timestamp": "2025-03-23T23:32:32Z"
  },
  {
    "title": "Oil Steadies at Start of Week as Market Weighs Trump’s Tariffs",
    "description": "(Bloomberg) -- Oil was steady at the start of the week as traders weighed the fallout from more US tariffs and an upcoming boost in OPEC+ supply.Most Read...",
    "link": "https://finance.yahoo.com/news/oil-steadies-start-week-market-232852832.html",
    "timestamp": "2025-03-23T23:28:52Z"
  },
  {
    "title": "Tiger Woods confirms relationship with Vanessa Trump, Donald Trump Jr.'s ex-wife",
    "description": "Tiger Woods put several weeks of speculation to bed on Sunday as he announced his relationship with Vanessa Trump, Donald Trump Jr.'s ex-wife, in a post on X.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_cc743962-a05d-4785-a07d-7e9d4a3ac920",
    "timestamp": "2025-03-23T23:28:33Z"
  },
  {
    "title": "Tiger Woods confirms romance with Vanessa Trump: ‘Life is better with you’",
    "description": "Page Six confirmed earlier this month that Woods and Trump were secretly dating.",
    "link": "https://pagesix.com/2025/03/23/celebrity-news/tiger-woods-confirms-romance-with-vanessa-trump-life-is-better-with-you/",
    "timestamp": "2025-03-23T23:22:56Z"
  },
  {
    "title": "Canadian Prime Minister Mark Carney says Trump won't 'break' Canada, blasts 'unjustified trade actions'",
    "description": "Canadian Prime Minister Mark Carney called a snap election for April.\nAndrej Ivanov/Getty Images\nPrime Minister Mark Carney on Sunday said US President Donald Trump won't \"break\" Canada.\n\"We are facing the most significant crisis of our lifetimes,\" he said of…",
    "link": "https://biztoc.com/x/cdc8abff4f991126",
    "timestamp": "2025-03-23T23:22:16Z"
  },
  {
    "title": "Trump Racking Up Important Legal Victories As Left’s Lawfare Ramps Up",
    "description": "The left couldn’t defeat President Donald Trump at the ballot box. Now, their only hope seems to be defeating him at the courthouse. More than... Read More\nThe post Trump Racking Up Important Legal Victories As Left’s Lawfare Ramps Up appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/03/23/trump-court-victories-left-lawfare/",
    "timestamp": "2025-03-23T23:21:44Z"
  },
  {
    "title": "No injuries after man drives car into protesters outside Tesla dealership",
    "description": "A Florida sheriff's office says a man drove his car into protesters gathered outside a Tesla dealership in Palm Beach County, but nobody was injured.",
    "link": "https://www.cbsnews.com/miami/news/man-drives-car-into-protesters-outside-a-tesla-dealership-nobody-hurt-sheriff-says/",
    "timestamp": "2025-03-23T23:15:43Z"
  },
  {
    "title": "Confronting the complex realities of Polish-Jewish identity",
    "description": "Nuance is in order regarding Poland and its Jews; Jennifer Stark-Blumenthal calls for a reevaluation of Jews’ attitudes toward Poles, as well as Poles’ understanding of Jews.",
    "link": "https://www.jpost.com/opinion/article-847210",
    "timestamp": "2025-03-23T23:11:55Z"
  },
  {
    "title": "How the Democratic Party became a massive disgrace",
    "description": "The Democratic Party, once a reliable supporter of Israel and Jewish causes, is changing; Schumer has let it happen.",
    "link": "https://www.jpost.com/opinion/article-847216",
    "timestamp": "2025-03-23T23:11:36Z"
  },
  {
    "title": "Canadian Prime Minister Mark Carney says Trump won't 'break' Canada, blasts 'unjustified trade actions'",
    "description": "Carney, who called a snap election on April 28, said Canadians need to \"build the strongest economy in the G7.\"",
    "link": "https://www.businessinsider.com/canada-carney-trump-snap-election-trade-2025-3",
    "timestamp": "2025-03-23T23:10:49Z"
  },
  {
    "title": "Knocking on doors, posting signs: federal election campaign hits the ground running in Winnipeg",
    "description": "With an federal election now looming just shy of over a month, candidates from Canada’s major parties hit the ground running in Winnipeg on Sunday.",
    "link": "https://www.cbc.ca/news/canada/manitoba/federal-election-winnipeg-manitoba-votes-1.7491335",
    "timestamp": "2025-03-23T23:04:58Z"
  },
  {
    "title": "Conan O'Brien is set to receive the Mark Twain Prize for humor as politics roils the Kennedy Center",
    "description": "Conan O'Brien is set to receive the Mark Twain Prize on Sunday night at the John F. Kennedy Center for the Performing Arts, where the backstage drama of the host institution may hang over the celebration. O'Brien, 61, was named the latest recipient of the awa…",
    "link": "https://japantoday.com/category/entertainment/conan-o%27brien-is-set-to-receive-the-mark-twain-prize-for-humor-as-politics-roils-the-kennedy-center",
    "timestamp": "2025-03-23T23:04:48Z"
  },
  {
    "title": "JFK-related records reveal past CIA secrets but also some personal data",
    "description": "History buffs dove into thousands of pages of government records released online last week, hoping for new nuggets about President John F Kennedy's assassination. They instead found revelations about U.S. espionage in the massive document dump that also expos…",
    "link": "https://japantoday.com/category/world/correction-jfk-assassination-documents-what-to-know-story",
    "timestamp": "2025-03-23T23:03:11Z"
  },
  {
    "title": "Jasmine Crockett describes Democratic donor talk on Schumer 'reminiscent' of Biden being taken down",
    "description": "Rep. Jasmine Crockett, D-Texas., compared discussions around Sen. Chuck Schumer to talk about former President Biden before he dropped out of the 2024 race.",
    "link": "https://www.foxnews.com/media/jasmine-crockett-describes-democratic-donor-talk-schumer-reminiscent-biden-being-taken-down",
    "timestamp": "2025-03-23T23:00:33Z"
  },
  {
    "title": "US delegation aims for Black Sea ceasefire in Ukraine, Russia talks",
    "description": "RIYADH/KYIV (Reuters) - A U.S. delegation will seek progress toward a Black Sea ceasefire and a broader cessation of violence in the war in Ukraine when it meets for talks with Russian officials on Monday, after discussions with diplomats from Ukraine on Sund…",
    "link": "https://www.thestar.com.my/news/world/2025/03/24/us-delegation-aims-for-black-sea-ceasefire-in-ukraine-russia-talks",
    "timestamp": "2025-03-23T23:00:00Z"
  },
  {
    "title": "Will Guam Be America’s Next Pearl Harbor?",
    "description": "Donald Trump’s neocolonial foreign policy could invite a surprise Chinese attack on an underprepared American island in the South Pacific.\nThe post Will Guam Be America’s Next Pearl Harbor? appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/03/23/will-guam-be-americas-next-pearl-harbor/",
    "timestamp": "2025-03-23T22:58:00Z"
  },
  {
    "title": "'Nothing in the world comes close to it': US unveils new F-47 Fighter Jet",
    "description": "US President Donald Trump announced that Boeing has been awarded the contract to produce the US Air Force’s next-generation fighter jet, the F-47. The aircraft, classified as a sixth-generation fighter, is expected to be the most advanced fighter jet ever dev…",
    "link": "https://freerepublic.com/focus/f-news/4306302/posts",
    "timestamp": "2025-03-23T22:57:31Z"
  },
  {
    "title": "What Happens to Antitrust Under Trump?",
    "description": "From tariffs to deportations, Trump’s policies are inflationary—but enforcing antitrust laws could help working families.\nThe post What Happens to Antitrust Under Trump? appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/03/23/what-happens-to-antitrust-under-trump/",
    "timestamp": "2025-03-23T22:55:00Z"
  },
  {
    "title": "Rosie O’Donnell Questions ‘Why’ Donald Trump Won Every Swing State Considering He Is ‘Best Friends’ With a ‘Man Who Owns and",
    "description": "Rosie O&rsquo;Donnell Questions &lsquo;Why&rsquo; Donald Trump Won Every Swing State Considering He Is &lsquo;Best Friends&rsquo; With a &lsquo;Man Who Owns and Runs the Internet&rsquo;: &lsquo;I Would Hope that Would be Investigated&rsquo;Yahoo View Full Cov…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176799673",
    "timestamp": "2025-03-23T22:52:15Z"
  },
  {
    "title": "Noem to visit El Salvador prison that took in hundred of deported criminals: 'Clear message'",
    "description": "Secretary Kristi Noem is scheduled to visit various locations in Central America next week, including El Salvador's Terrorism Confinement Center, Fox can exclusively reveal.",
    "link": "https://www.foxnews.com/politics/noem-visit-el-salvador-prison-took-hundred-deported-criminals-clear-message",
    "timestamp": "2025-03-23T22:50:37Z"
  },
  {
    "title": "A deal in the desert? US and Ukraine meet ahead of Russia ceasefire talks",
    "description": "US negotiators are holding talks in Saudi Arabia with Ukraine on Sunday, and separately with Russia on Monday.",
    "link": "https://www.bbc.com/news/articles/cly65gm5jp9o",
    "timestamp": "2025-03-23T22:47:17Z"
  },
  {
    "title": "'Gimme a break!' Lawmaker says Trump admin just 'gave up the game' on Social Security",
    "description": "Donald Trump is \"failing in the presidency,\" and \"giving up the game\" on Social Security, a lawmaker said on Sunday.Becca Balint, a Democratic representative from Vermont, appeared on MSNBC over the weekend. There, she was asked about Donald Trump's attacks o…",
    "link": "https://www.rawstory.com/trump-game-social-security/",
    "timestamp": "2025-03-23T22:43:47Z"
  },
  {
    "title": "'Chilling and Unprecedented': Trump Memo Threatens Law Firms That Cross His Administration",
    "description": "Legal advocacy groups have issued a sharp rebuke to U.S. President Donald Trump's directive aimed at holding \"accountable\" law firms and lawyers that, according to him, \"engage in frivolous, unreasonable, and vexatious litigation against the United States.\"\"A…",
    "link": "https://www.commondreams.org/news/trump-law-firms-directive",
    "timestamp": "2025-03-23T22:40:39Z"
  },
  {
    "title": "ICE Arrest 31 Illegals at Cockfight in Puerto Rico",
    "description": "ICE arrested 31 illegal aliens at a cockfight in San Juan, Puerto Rico, the agency said in a press release.\nThe post ICE Arrest 31 Illegals at Cockfight in Puerto Rico appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/03/23/ice-arrest-31-illegals-at-cockfight-in-puerto-rico/",
    "timestamp": "2025-03-23T22:40:03Z"
  },
  {
    "title": "Kane argues Democratic Party has created a ‘masculinity problem’ for itself - Washington Examiner",
    "description": "Glenn Jacobs, also known by his wrestling moniker Kane, also offered some pointers on how the Democratic Party can win back male voters.",
    "link": "https://www.washingtonexaminer.com/news/entertainment/3356444/kane-democratic-party-created-masculinity-problem-for-itself/",
    "timestamp": "2025-03-23T22:38:21Z"
  },
  {
    "title": "The Cuban Missile Crisis has a lesson for today’s stock market as the next Trump tariffs could fuel a huge rebound, top Wall Street forecaster says",
    "description": "The stock market's trajectory during the Cuban Missile Crisis could provide a template for how investors will respond to President Donald Trump's upcoming reciprocal tariffs, according to Fundstrat Global Advisors cofounder Tom Lee, who has a strong recent tr…",
    "link": "https://biztoc.com/x/8e5eb7fc0632da83",
    "timestamp": "2025-03-23T22:36:52Z"
  },
  {
    "title": "The Meager Agenda of Abundance Liberals",
    "description": "What the Democratic Party’s most buzzed-about policy movement gets right—and wrong.\nThe post The Meager Agenda of Abundance Liberals appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/03/23/the-meager-agenda-of-abundance-liberals/",
    "timestamp": "2025-03-23T22:35:00Z"
  },
  {
    "title": "Leaders for the 5 main parties pitch why they should be prime minister",
    "description": "The race to choose Canada's next prime minister began Sunday with each of the main party leaders making their pitch for why they are uniquely qualified to lead the country through a crisis.",
    "link": "https://www.cbc.ca/news/politics/five-pitches-for-prime-minister-1.7491290",
    "timestamp": "2025-03-23T22:32:37Z"
  },
  {
    "title": "Ukraine, U.S. teams hold talks in Saudi Arabia, U.S. envoy hopeful on ending war",
    "description": "Moscow agreed to a U.S. proposal to stop attacks on energy infrastructure but both Russia and Ukraine have reportedly continued strikes.",
    "link": "https://www.japantimes.co.jp/news/2025/03/24/world/politics/ukraine-us-saudi-arabia-envoy/",
    "timestamp": "2025-03-23T22:30:00Z"
  },
  {
    "title": "Labor gains big lead in a Morgan poll, but drops back in YouGov",
    "description": "The latest Morgan poll will be heartening for the government ahead of a federal election - but it may be a pro-Labor outlier.",
    "link": "https://theconversation.com/labor-gains-big-lead-in-a-morgan-poll-but-drops-back-in-yougov-252380",
    "timestamp": "2025-03-23T22:27:47Z"
  },
  {
    "title": "Billion-Dollar US Levies on Chinese Ships Risk ‘Trade Apocalypse’",
    "description": "Critics will tell a hearing on Monday that the move against commercial ships could be more disruptive for global trade than Trump’s tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/billion-dollar-us-levies-on-chinese-ships-risk-trade-apocalypse",
    "timestamp": "2025-03-23T22:23:26Z"
  },
  {
    "title": "Five things to look for in Canada's election",
    "description": "Canadians will vote in April after what will be a short 36-day campaign - but possibly one of the most consequential in recent history.",
    "link": "https://www.bbc.com/news/articles/c07zxy98g45o",
    "timestamp": "2025-03-23T22:21:29Z"
  }
]