[
  {
    "title": "EU set to halt U.S. trade deal over Trump’s latest tariff threat",
    "description": "“The EPP is in favor of the EU-US trade deal, but given Donald Trump’s threats regarding Greenland, approval is not possible at this stage.”",
    "link": "https://fortune.com/2026/01/17/eu-us-trade-deal-trump-nato-tariffs-greenland-takeover-threat/",
    "timestamp": "2026-01-17T21:26:32Z"
  },
  {
    "title": "Trump tariff threat over Greenland 'unacceptable', European leaders say",
    "description": "The US president says several European allies opposed to his plans to buy Greenland will face 10% tariffs from February.",
    "link": "https://www.bbc.com/news/articles/cy4qjwk9n2no",
    "timestamp": "2026-01-17T21:19:46Z"
  },
  {
    "title": "European Union and Mercosur bloc of South American nations sign landmark free trade agreement",
    "description": "The European Union and the Mercosur bloc of South American countries formally signed a long-sought landmark free trade agreement on Saturday, capping more than a quarter-century of torturous negotiations to strengthen commercial ties in the face of rising pro…",
    "link": "https://japantoday.com/category/world/european-union-and-mercosur-bloc-of-south-american-nations-sign-landmark-free-trade-agreement",
    "timestamp": "2026-01-17T21:19:42Z"
  },
  {
    "title": "Ukrainian delegation arrives in U.S. for peace talks as Russia hammers energy sites",
    "description": "A Ukrainian delegation arrived in the United States for talks Saturday on a U.S.-led diplomatic push to end the nearly 4-year-old war as Russian attacks again took aim at Ukraine's power grid, cutting electricity and heating in freezing temperatures. Kyrylo B…",
    "link": "https://japantoday.com/category/world/ukrainian-delegation-arrives-in-us-for-peace-talks-as-russia-hammers-energy-sites",
    "timestamp": "2026-01-17T21:18:50Z"
  },
  {
    "title": "Khamenei calls Trump a ‘criminal,’ blames him for protest casualties and damage",
    "description": "Iran’s supreme leader Ayatollah Ali Khamenei on Saturday said authorities “must break the back of the seditionists” and blamed US President Donald Trump for “casualties” after the Islamic Republic’s bloody crackdown on a protest wave against the country’s cle…",
    "link": "https://freerepublic.com/focus/f-news/4362645/posts",
    "timestamp": "2026-01-17T21:18:48Z"
  },
  {
    "title": "Iran's leader Khamenei accuses Trump of inciting deadly protests",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei on Saturday blamed President Donald Trump for weeks of demonstrations that rights groups said have led to more than 3,000 deaths. &quot;We consider the U.S. president criminal for the casualties, damages and slande…",
    "link": "https://japantoday.com/category/world/iran%27s-leader-khamenei-accuses-trump-of-inciting-deadly-protests1",
    "timestamp": "2026-01-17T21:18:42Z"
  },
  {
    "title": "Board of Peace for Gaza is forming with ambitions for a wider mandate of other conflicts",
    "description": "President Donald Trump’s “Board of Peace,” which was initially seen as a mechanism focused on ending the Israel-Hamas war in Gaza, is taking shape with ambitions to have a far broader mandate of other global crises, potentially rivaling the United Nations in …",
    "link": "https://japantoday.com/category/world/board-of-peace-for-gaza-is-forming-with-ambitions-for-a-wider-mandate-of-other-conflicts",
    "timestamp": "2026-01-17T21:18:36Z"
  },
  {
    "title": "Trump vows tariffs on 8 European nations over Greenland",
    "description": "U.S. President Donald Trump on Saturday vowed to implement a wave of increasing tariffs on European allies until the United States is allowed to buy Greenland, escalating a row over the future of Denmark's vast Arctic island. In a post ‌on Truth Social, Trump…",
    "link": "https://japantoday.com/category/world/trump-vows-tariffs-on-eight-european-nations-over-greenland4",
    "timestamp": "2026-01-17T21:18:19Z"
  },
  {
    "title": "Trump Gives Compassionate Response to Renee Good's Father, Calls Her Likely 'Wonderful' Under 'Normal Circumstances'",
    "description": "Trump Gives Compassionate Response to Renee Good's Father, Calls Her Likely 'Wonderful' Under 'Normal Circumstances'westernjournal.com",
    "link": "https://www.westernjournal.com/trump-gives-compassionate-response-renee-goods-father-calls-likely-wonderful-normal-circumstances/",
    "timestamp": "2026-01-17T21:17:34Z"
  },
  {
    "title": "Piers Morgan clashes with Roger Waters, accuses the rocker of propping up dictators while attacking Trump",
    "description": "On Friday's episode of \"Uncensored,\" host Piers Morgan called out Pink Floyd's Roger Waters for slamming the U.S. while 'trying to prop up terrorists and powerful dictatorships.'",
    "link": "https://www.foxnews.com/media/piers-morgan-clashes-roger-waters-accuses-rocker-propping-up-dictators-while-attacking-trump",
    "timestamp": "2026-01-17T21:16:52Z"
  },
  {
    "title": "Trump sends big message in US-Canada ice hockey rivalry with delegation selections for Milan-Cortina Games",
    "description": "US women's hockey stars rare eady to fight Canada at Winter Olympics as Trump announces presidential delegation for Milan-Cortina games.",
    "link": "https://www.foxnews.com/sports/trump-sends-big-message-us-canada-ice-hockey-rivalry-delegation-selections-milan-cortina-games",
    "timestamp": "2026-01-17T21:16:07Z"
  },
  {
    "title": "'Trump could be hauled off to jail': MAGA allies issue panicked plea to GOP lawmakers",
    "description": "MAGA allies sounded the alarm over the weekend, with one Trump-associated attorney issuing a panicked plea to Senate Republicans.It started when Curtis Houck of Newsbusters, which purports to \"expose and combat liberal media bias,\" reported on a video of a li…",
    "link": "https://www.rawstory.com/trump-jail-2674905484/",
    "timestamp": "2026-01-17T21:15:06Z"
  },
  {
    "title": "Europe vows 'firm' response to new Trump tariffs over Greenland (Politico)",
    "description": "Politico:\nEurope vows ‘firm’ response to new Trump tariffs over Greenland  —  “Tariffs would undermine transatlantic relations and risk a dangerous downward spiral,” von der Leyen said in a post on X.  —  The EU vowed a “firm” response to new tariffs imposed …",
    "link": "https://www.memeorandum.com/260117/p48",
    "timestamp": "2026-01-17T21:10:00Z"
  },
  {
    "title": "Vance and Rubio set to attend Winter Olympics opening ceremony in Italy. Trump isn't on the list",
    "description": "The White House has announced that U.S. Vice President JD Vance will lead an American delegation to the 2026 Winter Olympics",
    "link": "https://abcnews.go.com/US/wireStory/vance-rubio-set-attend-winter-olympics-opening-ceremony-129315215",
    "timestamp": "2026-01-17T21:09:46Z"
  },
  {
    "title": "Britney Spears’ Iranian American ex-husband Sam Asghari says Trump should intervene in Iran",
    "description": "The Post spoke with Sam Asghari after he attended Westwood protests, where he said U.S. involvement in Iran is “the most American thing you can do.”",
    "link": "https://nypost.com/2026/01/17/us-news/britney-spears-ex-sam-asghari-says-donald-trump-should-intervene-in-iran/",
    "timestamp": "2026-01-17T21:06:43Z"
  },
  {
    "title": "Tim Dillon Blasts Dog Masks at Mar-a-Lago Party: ‘Didn’t a Furry Supposedly Shoot Charlie Kirk?’ | Video",
    "description": "Comedian Tim Dillon appeared out of patience for the Trump administration in the Saturday episode of \"The Tim Dillon Show.\" Dillion took Trump to task for hosting a gala event for the Hero Dogs Awards on January 9 at Mar-a-Lago, chiefly because many attendees…",
    "link": "https://www.thewrap.com/media-platforms/politics/comedian-tim-dillon-dog-masks-mar-a-lago-dog-party-video/",
    "timestamp": "2026-01-17T21:05:55Z"
  },
  {
    "title": "US issues aviation warnings for eastern Pacific over ‘military activities’",
    "description": "The US aviation authority has issued multiple warnings over impending “military activities” in the eastern Pacific and Central America Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631089-us-faa-aviation-warnings/",
    "timestamp": "2026-01-17T21:03:15Z"
  },
  {
    "title": "Just when Wall Street and Corporate America were looking forward to a year without trade fears, the ‘Tariff King’ strikes again",
    "description": "Trump announced tariffs on eight NATO allies and said earlier in the week that countries that do business with Iran would be hit with a 25% duty.",
    "link": "https://fortune.com/2026/01/17/trump-trade-war-nato-tariff-iran-duty-china-eu-deal-inflation-gdp-growth/",
    "timestamp": "2026-01-17T21:00:29Z"
  },
  {
    "title": "Joachim Trier’s ‘Sentimental Value’ Sweeps Board At European Film Awards – Full Winners List",
    "description": "UPDATE WITH FULL WINNERS: Norwegian director Joachim Trier’s Sentimental Value swept the board at the 38th European Film Awards in Berlin on Saturday evening. The drama scooped Best Film, Best Director, Best Screenwriter for Eskil Vogt and Trier, as well as B…",
    "link": "http://deadline.com/2026/01/2026-european-film-awards-full-list-1236685950/",
    "timestamp": "2026-01-17T21:00:00Z"
  },
  {
    "title": "EU warns of downward spiral after Trump threatens tariffs over Greenland",
    "description": "BRUSSELS, Jan 17 (Reuters) - European Union leaders on Saturday warned of a “dangerous downward spiral” over U.S. President Donald Trump’s vow to implement increasing tar… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/17/eu-warns-of-downward-spiral-after-trump-threatens-tariffs-over-greenland",
    "timestamp": "2026-01-17T20:58:06Z"
  },
  {
    "title": "President Trump pardons Rep. Womack's son",
    "description": "President Donald Trump pardoned Rep. Steve Womack's son, James Womack, who was sentenced to 96 months in prison for the distribution of methamphetamine in May 2024.",
    "link": "https://www.4029tv.com/article/president-trump-pardons-rep-womacks-son/70033310",
    "timestamp": "2026-01-17T20:55:37Z"
  },
  {
    "title": "US troops pull out of major Iraq airbase amid ongoing regional consolidation effort, progress against ISIS",
    "description": "The U.S. withdrawal of troops from Ain al-Asad airbase was completed by Friday as part of regional consolidation following progress on ISIS as CENTCOM calls for 'teamwork.'",
    "link": "https://www.foxnews.com/world/us-troops-pull-out-major-iraq-airbase-amid-ongoing-regional-consolidation-effort-progress-against-isis",
    "timestamp": "2026-01-17T20:54:58Z"
  },
  {
    "title": "EU calls emergency envoys meeting for Sunday after Trump vows tariffs linked to Greenland",
    "description": "BRUSSELS, ‌Jan 17 (Reuters) - Ambassadors ‌from the European ‌Union's 27 countries will convene on Sunday for ‍an emergency ‍meeting after ‌U.S. President Donald Trump ‍vowed ​a wave of ⁠increasing tariffs on European allies ‌until the United States ⁠is ‍allo…",
    "link": "https://www.thestar.com.my/news/world/2026/01/18/eu-calls-emergency-envoys-meeting-for-sunday-after-trump-vows-tariffs-linked-to-greenland",
    "timestamp": "2026-01-17T20:52:00Z"
  },
  {
    "title": "Vance and Rubio set to attend Winter Olympics opening ceremony in Italy. Trump isn't on the list",
    "description": "U.S. Vice President JD Vance will lead an American delegation to the 2026 Winter Olympics in Italy and attend the opening ceremony, the White House said Saturday. Vance will be joined by U.S. Secretary of State Marco Rubio, second lady Usha Vance, U.S. Ambass…",
    "link": "https://sports.yahoo.com/articles/vance-rubio-set-attend-winter-205100725.html",
    "timestamp": "2026-01-17T20:51:00Z"
  },
  {
    "title": "Trump Calls for ‘New Leadership’ in Iran After Reading Khamenei Posts",
    "description": "Trump made the call after being read a series of posts on X by Khamenei that attacked him, POLITICO reported.",
    "link": "https://time.com/7347132/trump-khamenei-iran-protests/",
    "timestamp": "2026-01-17T20:47:44Z"
  },
  {
    "title": "Heritage report warns: Family decline threatens America’s next 250",
    "description": "'They understand that this is a civilizational problem'",
    "link": "https://www.wnd.com/2026/01/heritage-report-warns-family-decline-threatens-americas-next/",
    "timestamp": "2026-01-17T20:47:28Z"
  },
  {
    "title": "‘World Peace Is At Stake’: Trump Throws Down Gauntlet With Sweeping Pressure Tactic To Acquire Greenland",
    "description": "President Donald Trump slapped tariffs on eight European allies Saturday in a push to force the sale of Greenland to the United States.",
    "link": "https://dailycaller.com/2026/01/17/trump-tariffs-europe-greenland-purchase-deal/",
    "timestamp": "2026-01-17T20:44:04Z"
  },
  {
    "title": "Iran supreme leader acknowledges thousands killed during recent protests",
    "description": "Iran's supreme leader has for the first time publicly acknowledged that thousands of people were killed during recent protests. In a speech on Saturday, Ayatollah Ali Khamenei said thousands had been killed, \"some in an inhuman, savage manner\", and blamed the…",
    "link": "https://freerepublic.com/focus/f-news/4362638/posts",
    "timestamp": "2026-01-17T20:41:45Z"
  },
  {
    "title": "Khamenei Celebrates ‘Defeat’ of U.S., Mocks ‘Criminal’ Trump: America Must Be ‘Held Accountable’",
    "description": "“The Iranian nation defeated the U.S.,” declared Iran’s Ayatollah Ali Khamenei, insisting the U.S. must “be held accountable.”\nThe post Khamenei Celebrates ‘Defeat’ of U.S., Mocks ‘Criminal’ Trump: America Must Be ‘Held Accountable’ appeared first on Breitbar…",
    "link": "https://www.breitbart.com/politics/2026/01/17/khamenei-celebrates-defeat-u-s-mocks-criminal-trump-america-must-be-held-accountable/",
    "timestamp": "2026-01-17T20:38:02Z"
  },
  {
    "title": "Olympics-Vance to lead US delegation to Milano Cortina Winter Games",
    "description": "Jan 17 (Reuters) - United States Vice President JD Vance will lead the American presidential delegation to the opening ceremony of the Milano Cortina Winter Olympics, President Donald Trump announced",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_9300a4c3-5e76-41cc-8f0d-b58ac34ebfc5",
    "timestamp": "2026-01-17T20:38:01Z"
  },
  {
    "title": "Europe will remain united - EU chief on Greenland tariffs",
    "description": "European Commission President Ursula von der Leyen has warned against Donald Trump's threat of tariffs of up to 25% for eight European countries, which the US president said he will impose until a deal is reached for the US to purchase Greenland.",
    "link": "https://www.rte.ie/news/world/2026/0117/1553673-greenland-tariffs-reaction/",
    "timestamp": "2026-01-17T20:37:12Z"
  },
  {
    "title": "The Boys: Kripke's \"Perfect\" Response to Trump/Homelander Milk Vibe",
    "description": "Okay! We get it! Enough already! It's pretty clear at this point that the real world and the world of Prime Video and Showrunner Eric Kripke's The Boys are connected in some way that modern science couldn't even begin to understand. The lines between the two …",
    "link": "https://bleedingcool.com/tv/the-boys-kripkes-perfect-response-to-trump-homelander-milk-vibe/",
    "timestamp": "2026-01-17T20:37:07Z"
  },
  {
    "title": "8 European countries will face tariffs for opposing US control of Greenland: Trump",
    "description": "President Donald Trump said on Jan 17 that he would charge a 10 percent import tax starting in February on goods from eight European nations because of their opposition to American control of Greenland, setting up a potentially dangerous test of U.S. partners…",
    "link": "https://www.hurriyetdailynews.com/8-european-countries-will-face-tariffs-for-opposing-us-control-of-greenland-trump-217939",
    "timestamp": "2026-01-17T20:35:40Z"
  },
  {
    "title": "EU-US trade deal ‘on hold’ after new Trump tariffs",
    "description": "The pact, designed to avoid hefty tariffs on European exports, cannot be passed in light of Washington's threats against Greenland, lawmakers say.",
    "link": "https://www.politico.eu/article/eu-us-trade-deal-on-hold-after-new-trump-tariffs/",
    "timestamp": "2026-01-17T20:34:58Z"
  },
  {
    "title": "Iran's leader calls Trump a 'criminal' for backing protests",
    "description": "He blamed demonstrators for causing thousands of deaths.",
    "link": "https://abcnews.go.com/International/wireStory/irans-leader-calls-trump-criminal-backing-protests-blames-129305931",
    "timestamp": "2026-01-17T20:33:19Z"
  },
  {
    "title": "‘Hands Off Greenland’ Protests Draw Thousands as Trump Makes Aggressive Push for Denmark’s Arctic Island: ‘Not for Sale!’",
    "description": "Thousands gathered in Copenhagen and other cities across Denmark and Greenland to protest against President Trump's push to \"acquire\" the island on Saturday\nThe post ‘Hands Off Greenland’ Protests Draw Thousands as Trump Makes Aggressive Push for Denmark’s Ar…",
    "link": "https://www.mediaite.com/politics/hands-off-greenland-protests-draw-thousands-as-trump-makes-aggressive-push-for-denmarks-arctic-island-not-for-sale/",
    "timestamp": "2026-01-17T20:32:54Z"
  },
  {
    "title": "US Justice Department probing Minnesota Governor Walz, other officials, source says",
    "description": "Summary Subpoenas prepared for Minnesota governor and Minneapolis mayor Minnesota Democrats alleged to have impeded immigration agents Walz says Trump has 'weaponized' federal justice system WASHINGTON, Jan 16 (Reuters) - The U.S. Justice Department has opene…",
    "link": "https://freerepublic.com/focus/f-news/4362636/posts",
    "timestamp": "2026-01-17T20:29:29Z"
  },
  {
    "title": "Who Are the Shadowy Contractors That Are Training ICE’s Attack Teams?",
    "description": "ICE is spending big on firearms, munitions, and weapons training firms to further militarize its forces.",
    "link": "https://www.levernews.com/shadow-contractors-are-training-ices-attack-teams/",
    "timestamp": "2026-01-17T20:29:20Z"
  },
  {
    "title": "Trump calls for new leadership in Iran following nationwide protests",
    "description": "President Donald Trump on Saturday called for regime change in Iran following protests that have roiled the country in recent weeks.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-new-leadership-iran-protests-ayatollah-ali-khamenei-rcna254561",
    "timestamp": "2026-01-17T20:28:52Z"
  },
  {
    "title": "Europe to Respond to US Duties Related to Greenland — Macron",
    "description": "According to the French president, Paris will join the military exercises in Greenland based on its commitment to the sovereignty of states in Europe and the United NationsPARIS, January 17. /TASS/. French President Emmanuel Macron has promised a coordinated …",
    "link": "https://freerepublic.com/focus/f-news/4362635/posts",
    "timestamp": "2026-01-17T20:27:44Z"
  },
  {
    "title": "Report reveals overwhelming Democratic tilt at Yale",
    "description": "Not a single professor from Yale University donated to Republicans in 2025, an analysis by the Yale Daily News has indicated Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631088-report-democratic-tilt-yale-professors/",
    "timestamp": "2026-01-17T20:13:19Z"
  },
  {
    "title": "The Toilets On The U.S. Navy's Newest Supercarrier Are Still Clogging",
    "description": "The Vacuum, Collection, Holding and Transfer sewage system on USS Gerald R. Ford was developed for cruise ships, but maybe too small for the massive aircraft carrier",
    "link": "https://www.forbes.com/sites/petersuciu/2026/01/17/the-toilets-on-the-us-navys-newest-supercarrier-are-still-clogging/",
    "timestamp": "2026-01-17T20:08:30Z"
  },
  {
    "title": "Beijing’s best friend in DC",
    "description": "In response to Trump’s completely unprovoked and negative-sum belligerence, Mark Carney has reversed a tariff in Chinese EVs that he imposed at the urging of the American government in 2024. (Don’t think it’s a coincidence that this is also a big “fuck you” t…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/beijings-best-friend-in-dc",
    "timestamp": "2026-01-17T20:05:20Z"
  },
  {
    "title": "Trump Announces Tariffs on European Allies for Sending Troops to Greenland",
    "description": "Trump announced tariffs on eight European allies for taking part in a joint military exercise, after threatening to annex the island.",
    "link": "https://time.com/7347120/greenland-trump-protests-tariffs/",
    "timestamp": "2026-01-17T20:00:49Z"
  },
  {
    "title": "IOC responds to calls to ban USA from Winter Olympics over Venezuela crisis: What's their decision?",
    "description": "The International Olympic Committee has made clear it will not bar the United States from competing at the upcoming Winter Olympics, despite growing calls to do so following events",
    "link": "https://www.marca.com/en/olympic-games/2026/01/17/696bc8da22601da23f8b4591.html",
    "timestamp": "2026-01-17T20:00:40Z"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-17-01-26-6930445-Jan2026/",
    "timestamp": "2026-01-17T20:00:26Z"
  },
  {
    "title": "Cuba’s Energy Crisis Will Worsen Without Venezuelan Oil",
    "description": "Cuba has been experiencing a worsening energy crisis for several years, which has led it to rely heavily on Venezuela for its fuel. Following the United States' intervention in Venezuela earlier this month, Cuba is expected to lose a vital supply chain for fu…",
    "link": "https://oilprice.com/Energy/Energy-General/Cubas-Energy-Crisis-Will-Worsen-Without-Venezuelan-Oil.html",
    "timestamp": "2026-01-17T20:00:00Z"
  },
  {
    "title": "EU, Mercosur bloc sign free trade deal after 25 years of negotiations",
    "description": "European and South American leaders say pact sends 'clear signal' amid concerns over global tariffs, isolationism.",
    "link": "https://www.aljazeera.com/news/2026/1/17/eu-mercosur-bloc-sign-free-trade-deal-after-25-years-of-negotiations",
    "timestamp": "2026-01-17T19:59:40Z"
  },
  {
    "title": "Trump’s Concepts of a Non-plan on Health Care",
    "description": "The so-called Great Health Care Plan would do next to nothing to lower overall costs or premiums paid by individuals, families and employers.",
    "link": "http://washingtonmonthly.com/2026/01/17/trump-great-health-care-plan/",
    "timestamp": "2026-01-17T19:56:08Z"
  },
  {
    "title": "Trump Calls for ‘New Leadership’ in Iran, Says ‘Sick Man’ Ayatollah Ali Khamenei Has Made Nation ‘Worst Place to Live’",
    "description": "President Donald Trump, responding to Ayatollah Ali Khamenei’s attempt to blame him for recent protester deaths, slammed the Iranian Supreme Leader as a “sick man” and called for “new leadership,” declaring: “His country is the worst place to live anywhere in…",
    "link": "https://www.breitbart.com/politics/2026/01/17/trump-calls-for-new-leadership-in-iran-says-sick-man-ayatollah-ali-khamenei-has-made-nation-worst-place-to-live/",
    "timestamp": "2026-01-17T19:56:02Z"
  },
  {
    "title": "Immigrant Rights Advocates Say Trump’s First Year Was “Much Worse” Than Expected",
    "description": "“Trump wants us to hang our heads and give up, but that's not happening,” says organizer Rossy Alfaro.",
    "link": "https://truthout.org/articles/immigrant-rights-advocates-say-trumps-first-year-was-much-worse-than-expected/",
    "timestamp": "2026-01-17T19:53:24Z"
  },
  {
    "title": "FAA Issues Warnings for U.S. Airlines Flying Over Central and South America",
    "description": "Federal authorities are warning U.S. airlines about flying over areas of Central and South America due to possible military activity.\nThe post FAA Issues Warnings for U.S. Airlines Flying Over Central and South America appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/17/faa-issues-warnings-u-s-airlines-flying-over-central-south-america/",
    "timestamp": "2026-01-17T19:50:11Z"
  },
  {
    "title": "A Wave of New Polls Shows Trump’s Support Cratering Across the Board",
    "description": "As President Donald Trump wraps up the first year of his second term—one marked by US aggression abroad and rising political violence at home—a wave of new polls released this week shows him and his policies at remarkably high, and in some cases record, level…",
    "link": "https://www.motherjones.com/politics/2026/01/polling-trump-popularity-policy-immigration-economy-election/",
    "timestamp": "2026-01-17T19:47:25Z"
  },
  {
    "title": "Greenland row: German military ends short deployment amid rising tensions",
    "description": "Germany is pulling its troops out of Greenland after a very brief assessment Mission. The withdrawal amid President Donald Trump’s tariff threats and his claim that Greenland should belong to the US. Germany ends Greenland recon mission\n\nTrump said he will im…",
    "link": "https://www.dw.com/en/greenland-row-german-military-ends-short-deployment-amid-rising-tensions/live-75550031",
    "timestamp": "2026-01-17T19:44:00Z"
  },
  {
    "title": "Greenland row: EU weighing response to Trump tariff plan",
    "description": "European Council President Antonio Costa said the EU was weighing a joint response to a new US tariff plan to impose levies of 10% on 8 European nations, including Germany, France and the UK. Follow the latest.",
    "link": "https://www.dw.com/en/greenland-row-eu-weighing-response-to-trump-tariff-plan/live-75550031",
    "timestamp": "2026-01-17T19:44:00Z"
  },
  {
    "title": "Clip of Ted Cruz Warning People About Trump Resurfaces",
    "description": "Clip of Ted Cruz Warning People About Trump Resurfaceslittlethings.com",
    "link": "https://littlethings.com/entertainment/ted-cruz-trump-resurfaced-clip",
    "timestamp": "2026-01-17T19:43:55Z"
  },
  {
    "title": "This CIA plot has shaped the US relationship with Iran for decades",
    "description": "Protesters are urging US President Donald Trump to help dismantle Iran's theocracy. If he answers the call, it won't be the first time the US government has toppled an Iranian government.",
    "link": "https://www.abc.net.au/news/2026-01-18/us-cia-plotted-1953-iran-coup/106233952",
    "timestamp": "2026-01-17T19:42:27Z"
  },
  {
    "title": "Trump threatens new tariffs on European allies over Greenland until deal reached, as thousands protest (CNN)",
    "description": "CNN:\nTrump threatens new tariffs on European allies over Greenland until deal reached, as thousands protest  —  President Donald Trump said Saturday the United States will impose new tariffs on several European countries unless a deal is reached for the purch…",
    "link": "https://www.memeorandum.com/260117/p43",
    "timestamp": "2026-01-17T19:40:00Z"
  },
  {
    "title": "European Film Awards: ‘Sentimental Value’ Triumphs So Far with Wins for Renate Reinsve and Stellan Skarsgård (Updating)",
    "description": "See all the winners of the 38th European Film Awards so far. The ceremony is happening in Berlin on January 17.",
    "link": "https://www.indiewire.com/awards/results/european-film-awards-2026-winners-list-1235173569/",
    "timestamp": "2026-01-17T19:36:59Z"
  },
  {
    "title": "How one White House council is fighting to end ‘regulatory reign of terror’",
    "description": "'We really want to break through that red tape and allow projects to move through the process more smoothly'",
    "link": "https://www.wnd.com/2026/01/how-one-white-house-council-is-fighting-end/",
    "timestamp": "2026-01-17T19:36:16Z"
  },
  {
    "title": "Trump announces tariffs on NATO allies for opposing US control of Greenland",
    "description": "President Donald Trump announced that the NATO countries who have sent small contingents of troops to Greenland will be charged a 10% tariff on all goods.",
    "link": "https://abcnews.go.com/US/trump-announces-tariffs-nato-allies-opposing-us-control/story?id=129310383",
    "timestamp": "2026-01-17T19:36:09Z"
  },
  {
    "title": "Dem lawmaker issues dire warning not to fall for Trump’s trap as protesters clash",
    "description": "As protests continue to erupt in Minnesota following the ICE killing\r\n of Renee Good, Rep. Illhan Omar (D-MN) issued a stark warning Saturday, urging demonstrators not to fall into what she described as a trap set by President Donald Trump.What appear to be t…",
    "link": "https://www.rawstory.com/minneapolis/",
    "timestamp": "2026-01-17T19:35:58Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.wisn.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:35:45Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.ketv.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:35:16Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.wyff4.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:34:44Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.wlky.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:33:06Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.koco.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:33:05Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.kmbc.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:32:55Z"
  },
  {
    "title": "‘It Was a SET UP’: Trump Goes Off After Michael Cohen Claims He Felt ‘Coerced’ In Fraud Cases",
    "description": "Donald Trump ranted on Truth Social following revelations from Michael Cohen that he felt \"coerced\" to provide certain testimony in Trump's fraud trials.\nThe post ‘It Was a SET UP’: Trump Goes Off After Michael Cohen Claims He Felt ‘Coerced’ In Fraud Cases fi…",
    "link": "https://www.mediaite.com/media/news/it-was-a-set-up-trump-goes-off-after-michael-cohen-claims-he-felt-coerced-in-fraud-cases/",
    "timestamp": "2026-01-17T19:32:26Z"
  },
  {
    "title": "AP obtains documents showing Venezuelan leader Delcy Rodríguez has been on DEA’s radar for years",
    "description": "WASHINGTON (AP) — When President Donald Trump announced the audacious capture of Nicolás Maduro to face drug trafficking charges in the U.S., he portrayed the strongman’s vice president and longtime aide as America’s preferred partner to stabilize Venezuela a…",
    "link": "https://freerepublic.com/focus/f-news/4362627/posts",
    "timestamp": "2026-01-17T19:32:12Z"
  },
  {
    "title": "Trump Threatens Tariffs Against Europe If They Don't Support His Takeover Of Greenland",
    "description": "Hey, Supreme Court. If you need any more proof of Trump corruption when it comes to tariffs, watch this segment.\nDuring the White House round table on Health Care today, Donald Trump told NATO nations like France, and Germany, that if they refuse to support t…",
    "link": "https://crooksandliars.com/2026/01/trump-threatens-tariffs-against-europe-if",
    "timestamp": "2026-01-17T19:31:17Z"
  },
  {
    "title": "Megyn Kelly: People Protest ICE Because They’re Too Ugly To Have Sex",
    "description": "I’m old enough to remember when Megyn Kelly decided to make a big splash by confronting Donald Trump over his misogynistic comments. During a 2015 presidential debate, she suggested that his temperament was not suited for the presidency because he had called …",
    "link": "https://crooksandliars.com/2026/01/megyn-kelly-people-protest-ice-because",
    "timestamp": "2026-01-17T19:30:53Z"
  },
  {
    "title": "Donald Trump Calls CNN 'Fake News' and Then Brags About the Network Crediting Him for Biggest Mortgage Rate Drop in Years",
    "description": "Donald Trump attacked CNN in late-night posts while simultaneously promoting the network’s coverage praising him.",
    "link": "https://radaronline.com/p/donald-trump-calls-cnn-fake-news-brags-biggest-mortgage-rate-drop/",
    "timestamp": "2026-01-17T19:30:00Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.koat.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:27:06Z"
  },
  {
    "title": "Demonstrators march for Iran in Boston; urge US intervention",
    "description": "Demonstrators marched through the streets of Boston, Massachusetts on Saturday to support the people of Iran amid deadly government protests.",
    "link": "https://www.wcvb.com/article/boston-rally-supports-iran-protesters/70033284",
    "timestamp": "2026-01-17T19:26:07Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.wgal.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:26:05Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.wxii12.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:26:00Z"
  },
  {
    "title": "Tariffs escalate tensions between the US and longtime allies that say Denmark’s territory is not for sale",
    "description": "Most European countries have been opposed to Trump’s efforts to take over Greenland.",
    "link": "https://syndication.washingtonpost.com/nss/stories/VI4LBBCE7VE4NPH5QVR26GKD6Q",
    "timestamp": "2026-01-17T19:25:58Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.kcra.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:25:56Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise risk of autism",
    "description": "The latest work adds to the growing body of research refuting claims made by the Trump administration last year when the president promoted unproven ties between the painkiller and autism.",
    "link": "https://www.4029tv.com/article/new-research-bolsters-evidence-that-tylenol-doesnt-raise-risk-of-autism-despite-trumps-claims/70033234",
    "timestamp": "2026-01-17T19:25:37Z"
  },
  {
    "title": "Trump threatens Europe with tariffs over Greenland as protesters rally",
    "description": "WEST PALM, Florida/NUUK: US President Donald Trump on Saturday (Jan 17) escalated his quest to acquire Greenland, threatening multiple European nations with tariffs of up to 25 per cent until his purchase of the",
    "link": "https://www.channelnewsasia.com/world/trump-threatens-europe-tariffs-over-greenland-protesters-rally-5866021",
    "timestamp": "2026-01-17T19:20:25Z"
  },
  {
    "title": "Trump vows tariffs on eight European nations over Greenland",
    "description": "\"Tariffs would undermine transatlantic relations and risk a dangerous downward spiral,\" says European Union Chief Ursula von der Leyen and Antonio Costa, president of the European Council.",
    "link": "https://www.channelnewsasia.com/world/trump-vows-tariffs-eight-european-nations-over-greenland-5866021",
    "timestamp": "2026-01-17T19:20:00Z"
  },
  {
    "title": "Los Angeles Billionaire Moves To Nevada After California Threatens To Tax Wealth",
    "description": "Hankey, 82, had lived in California all his life and had built his Hankey Group financial services empire there since 1972. But he says he read about the proposed new tax this fall and by December was looking for property in Nevada",
    "link": "https://freerepublic.com/focus/f-news/4362625/posts",
    "timestamp": "2026-01-17T19:19:25Z"
  },
  {
    "title": "Trump: NATO members to face tariffs increasing to 25% until a Greenland purchase deal is struck - NewsBreak",
    "description": "President Donald Trump said eight NATO members' U.S. imports will face escalating tariffs \"until such time as a Deal is reached for the Complete and Total",
    "link": "https://www.newsbreak.com/share/4447134177365-trump-nato-members-to-face-tariffs-increasing-to-25-until-a-greenland-purchase-deal-is-struck?_f=app_share&amp;pd=01Fxa0rm&amp;lang=en_US&amp;send_time=1768677490&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.0.49%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-17T19:18:39Z"
  },
  {
    "title": "As Trump's deadline for a cap on credit card rates looms, banks have only questions and no answers",
    "description": "As Trump's deadline for a cap on credit card rates looms, banks have only questions and no answerswsls.com",
    "link": "https://www.wsls.com/news/politics/2026/01/17/as-trumps-deadline-for-a-cap-on-credit-card-rates-looms-banks-have-only-questions-and-no-answers/",
    "timestamp": "2026-01-17T19:16:03Z"
  },
  {
    "title": "Photos show Greenlanders brave near-freezing temperatures to march against Trump’s takeover threats",
    "description": "NUUK, Greenland (AP) — Thousands of Greenlanders marched through snow and ice in the capital, Nuuk, to protest U.S.",
    "link": "https://apnews.com/photo-gallery/photos-protest-greenland-trump-takeover-threats-nuuk-de1eedfae1d5b36a30adaaebb74e3966",
    "timestamp": "2026-01-17T19:15:30Z"
  },
  {
    "title": "EU parliament trade chief urges anti-coercion response after Trump Greenland tariff threat",
    "description": "BRUSSELS, Jan. 17 (Xinhua) -- Bernd Lange, chair of the European Parliament's Committee on International Trade, on Saturday urged the European Commission to trigger the EU's anti-coercion instrument after U.S. President Donald Trump threatened additional tari…",
    "link": "https://www.thestar.com.my/news/world/2026/01/18/eu-parliament-trade-chief-urges-anti-coercion-response-after-trump-greenland-tariff-threat",
    "timestamp": "2026-01-17T19:11:00Z"
  },
  {
    "title": "“Utter Buffoonery”: Trump Slaps NATO Allies With Tariffs over Greenland, Even as More Republicans Revolt",
    "description": "Donald Trump promised on Saturday to issue a series of increasing tariffs on European NATO allies until he is permitted to buy Greenland, the latest escalation in his already feverish threats to take over the Arctic country, which is part of Denmark. Trump an…",
    "link": "https://www.motherjones.com/politics/2026/01/greenland-nato-tarrifs-europeans-allies-republicans/",
    "timestamp": "2026-01-17T19:09:36Z"
  },
  {
    "title": "Abigail Spanberger Makes History, Sworn In As Virginia's 1st Female Governor",
    "description": "Since Virginia first became a commonwealth in 1776, only men have held the post.",
    "link": "https://www.huffpost.com/entry/abigail-spanberger-virginia_n_696bdd5be4b043a3642351b0",
    "timestamp": "2026-01-17T19:08:49Z"
  },
  {
    "title": "Cliff Taylor: Trump’s latest tariffs threat is worrying news for Ireland",
    "description": "Ireland cannot avoid being caught up in any major fallout between the US and EU",
    "link": "https://www.irishtimes.com/world/us/2026/01/17/cliff-taylor-trumps-latest-tariffs-threat-is-worrying-news-for-ireland/",
    "timestamp": "2026-01-17T19:08:36Z"
  },
  {
    "title": "These legal loopholes could let Trump use troops against protesters",
    "description": "By Jennifer Selin, Associate Professor of Law, Arizona State University. As protesters and federal law enforcement clashed in Minneapolis on Jan. 14, 2026, in the wake of a second shooting of a civilian by federal agents, President Donald Trump threatened to …",
    "link": "https://www.rawstory.com/trump-insurrection-act-2674899993/",
    "timestamp": "2026-01-17T19:07:57Z"
  },
  {
    "title": "Trump says he’ll charge 8 European countries a 10% tariff for opposing US control of Greenland - National | Globalnews.ca",
    "description": "Trump says the U.S. will impose a 10% tariff on goods from eight European countries after they opposed American control of Greenland, escalating tensions with key allies.digi",
    "link": "https://globalnews.ca/news/11617981/trump-says-hell-charge-8-european-countries-a-10-tariff-for-opposing-us-control-of-greenland/",
    "timestamp": "2026-01-17T19:07:47Z"
  },
  {
    "title": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: “He Will Lose It” – European Film Awards",
    "description": "Norwegian actress Liv Ullmann has suggested U.S. President Donald Trump is unlikely to remain in possession of the Nobel Peace Prize gifted to him this past week by Venezuelan opposition leader María Corina Machado. The actress, director and screenwriter and …",
    "link": "http://deadline.com/2026/01/norwegian-star-liv-ullmann-comments-trump-nobel-peace-prize-1236686028/",
    "timestamp": "2026-01-17T19:05:29Z"
  },
  {
    "title": "Trump: NATO members to face tariffs increasing to 25% until a Greenland purchase deal is struck - NewsBreak",
    "description": "President Donald Trump said eight NATO members' U.S. imports will face escalating tariffs \"until such time as a Deal is reached for the Complete and Total",
    "link": "https://www.newsbreak.com/share/4447134177365-trump-nato-members-to-face-tariffs-increasing-to-25-until-a-greenland-purchase-deal-is-struck?_f=app_share&amp;pd=0DkJuaFb&amp;lang=en_US&amp;send_time=1768676473&amp;s=i16&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.1.1.6%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-17T19:05:00Z"
  },
  {
    "title": "The Stupidest Trump Move So Far (Paul Krugman)",
    "description": "Paul Krugman:\nThe Stupidest Trump Move So Far  —  Donald Trump has many weird obsessions, but his fixation on acquiring Greenland may be the weirdest.  Alas, it's also consequential.  European nations are taking it seriously enough that they have sent militar…",
    "link": "https://www.memeorandum.com/260117/p37",
    "timestamp": "2026-01-17T19:05:00Z"
  },
  {
    "title": "Watch: ARTE Europe Weekly: Trump wants Greenland: What can Europe do?",
    "description": "Watch: ARTE Europe Weekly: Trump wants Greenland: What can Europe do?timesofmalta.com",
    "link": "https://timesofmalta.com/article/watch-arte-europe-weekly-trump-wants-greenland-europe-do.1122625",
    "timestamp": "2026-01-17T19:04:39Z"
  }
]