[
  {
    "title": "Dems suffering from Musk Derangement Syndrome",
    "description": "Democrats have finally found someone they hate more than Donald Trump.",
    "link": "https://nypost.com/2025/02/07/opinion/dems-suffering-from-musk-derangement-syndrome/",
    "timestamp": "2025-02-07T22:48:28Z"
  },
  {
    "title": "ICE makes staggering 11K illegal migrant arrests in just 18 days — forcing agency to take over four federal prisons",
    "description": "US Immigration and Customs Enforcement agents arrested an astounding 11,000 illegal migrants in the first 18 days of the Trump administration – which is already a third of the total busts the agency made last year under former President Joe Biden, The Post ha…",
    "link": "https://freerepublic.com/focus/f-news/4295844/posts",
    "timestamp": "2025-02-07T22:47:44Z"
  },
  {
    "title": "Trump angling for nine-figure payout from CBS to settle $10B lawsuit over Harris interview: sources",
    "description": "Sources with knowledge of the negotiations told The Post that Trump’s lawyers are poised to ask for as much as nine figures – a sum that would vastly exceed the $16 million recently paid by ABC and the $25 million doled out by Meta in recent weeks.",
    "link": "https://nypost.com/2025/02/07/business/trump-angling-for-nine-figure-payout-from-cbs-to-settle-10b-lawsuit-over-harris-interview-sources/",
    "timestamp": "2025-02-07T22:47:05Z"
  },
  {
    "title": "The Utter Bliss—and Impending Angst—of Donald Trump’s Palm Beach",
    "description": "At a recent art gala co-chaired by the wife of the president’s pick for secretary of the Navy, many residents of the old-line Republican stronghold were living their best lives—even as their chaotic, come-lately brethren continue to stream into Mar-a-Lago. Pl…",
    "link": "https://www.vanityfair.com/style/story/donald-trump-palm-beach-true-colors",
    "timestamp": "2025-02-07T22:46:24Z"
  },
  {
    "title": "Threats follow Michigan lawmaker who said she had surgery to remove reproductive organs",
    "description": "Michigan state Rep. Laurie Pohutsky told a crowd of protestors at the Michigan state Capitol building earlier that she had elective surgery to remove her reproductive organs out of concern about contraception access. The 36-year-old Democrat said the personal…",
    "link": "https://www.seattlepi.com/news/politics/article/threats-follow-michigan-lawmaker-who-said-she-had-20154571.php",
    "timestamp": "2025-02-07T22:46:16Z"
  },
  {
    "title": "Exclusive: Trump Air Force nominee arranged satellite contract in manner that favored Musk's SpaceX, sources say (Reuters)",
    "description": "Reuters:\nExclusive: Trump Air Force nominee arranged satellite contract in manner that favored Musk's SpaceX, sources say  —  President Donald Trump's nominee as Air Force Secretary, currently a top official at the national spy satellite agency, arranged a mu…",
    "link": "https://www.memeorandum.com/250207/p124",
    "timestamp": "2025-02-07T22:45:00Z"
  },
  {
    "title": "The public won't get to see Elon Musk's financial disclosures. Here's why that matters",
    "description": "The wealthiest man in the world is in charge of a powerful new government task force fundamentally changing the government.",
    "link": "https://www.cbsnews.com/news/the-public-wont-see-elon-musk-financial-disclosure-why-that-matters/",
    "timestamp": "2025-02-07T22:44:37Z"
  },
  {
    "title": "Trump Nominates Donut Shop Owner to Serve as US Ambassador to Costa Rica",
    "description": "President Donald Trump announced that he appointed a donut shop owner from Houston, Texas, to serve as the US ambassador to Costa Rica.",
    "link": "https://www.ibtimes.com/trump-nominates-donut-shop-owner-serve-us-ambassador-costa-rica-3762894",
    "timestamp": "2025-02-07T22:40:36Z"
  },
  {
    "title": "Musk DOGE Staffer Was Fired for Allegedly Leaking Company Secrets",
    "description": "A controversial member of Elon Musk’s DOGE was terminated from his internship at an Arizona cybersecurity firm two years ago after allegedly leaking the company’s secrets online, according to a report. Bloomberg reported Friday that 19-year-old Edward Coristi…",
    "link": "https://www.mediaite.com/news/musk-doge-staffer-was-fired-for-allegedly-leaking-company-secrets/",
    "timestamp": "2025-02-07T22:40:23Z"
  },
  {
    "title": "Trump administration temporarily blocked from placing 2,200 USAID workers on paid leave",
    "description": "U.S. District Judge Carl Nichols, who was nominated by President Donald Trump, sided with two federal employee associations in agreeing to a pause in plans to put the employees on paid leave as of midnight Friday.",
    "link": "https://biztoc.com/x/1775139be6703184",
    "timestamp": "2025-02-07T22:39:55Z"
  },
  {
    "title": "Musk pledges to rehire young DOGE member after recent racist posts",
    "description": "Elon Musk, controversially charged with remaking government for President Donald Trump, said Friday he would rehire a young member of the so-called Department of Government Efficiency after the man resigned Thursday over racist social media posts.\nMusk’s move…",
    "link": "https://biztoc.com/x/7b1f72a7d42326c2",
    "timestamp": "2025-02-07T22:39:51Z"
  },
  {
    "title": "US Consumer Sentiment Hits 7-Month Low After Trump Takes Office",
    "description": "Following Donald Trump's first few weeks as president, preliminary data shows consumer sentiment has dropped in February.",
    "link": "https://biztoc.com/x/d4d54e6b09bebe5a",
    "timestamp": "2025-02-07T22:39:49Z"
  },
  {
    "title": "Elon Musk's DOGE Training an AI to Analyze Government Spending",
    "description": "Billionaire Elon Musk's so-called Department of Government Efficiency (DOGE) is ripping through the federal government's agencies at a breakneck pace, to the horror of former government officials, who have been relegated to the sidelines. As part of their eff…",
    "link": "https://futurism.com/elon-musk-doge-ai-government",
    "timestamp": "2025-02-07T22:39:41Z"
  },
  {
    "title": "Nolte: Wapo’s Ruth Marcus Accidentally Admits Trump’s No Fascist",
    "description": "Ruth Marcus, a far-left columnist at the disgraced Washington Post, has just accidentally admitted her bête noir, Donald Trump, is no fascist.\nThe post Nolte: Wapo’s Ruth Marcus Accidentally Admits Trump’s No Fascist appeared first on Breitbart.",
    "link": "https://www.breitbart.com/the-media/2025/02/07/nolte-wapos-ruth-marcus-accidentally-admits-trumps-no-fascist/",
    "timestamp": "2025-02-07T22:39:12Z"
  },
  {
    "title": "Top federal agency with history of wasteful spending could be next DOGE target",
    "description": "Elon Musk's Department of Government Efficiency (DOGE) efforts appear ready to shift focus to the Social Security Administration, which is likely to spark criticisms from Democrats similar to those in response to DOGE's moves against the U.S. Agency for Inter…",
    "link": "https://www.foxnews.com/politics/top-federal-agency-history-wasteful-spending-could-be-next-doge-target",
    "timestamp": "2025-02-07T22:38:39Z"
  },
  {
    "title": "79 Countries Express 'Unwavering Support' For International Criminal Court Following Trump Sanctions",
    "description": "Countries have overwhelmingly come out in support of the International Criminal Court (ICC) after President Donald Trump imposed sanctions against the court for its investigations into Israel.",
    "link": "https://www.ibtimes.com/79-countries-express-unwavering-support-international-criminal-court-following-trump-sanctions-3762892",
    "timestamp": "2025-02-07T22:38:18Z"
  },
  {
    "title": "Trudeau says Trump threat to annex Canada 'is a real thing'",
    "description": "The prime minister told an economic summit in Toronto he believes Trump is eyeing Canada's critical minerals.",
    "link": "https://www.bbc.com/news/articles/czx82j5wd8vo",
    "timestamp": "2025-02-07T22:38:03Z"
  },
  {
    "title": "US Consumer Sentiment Hits 7-Month Low After Trump Takes Office",
    "description": "Following Donald Trump's first few weeks as president, preliminary data shows consumer sentiment has dropped in February.",
    "link": "https://www.newsweek.com/us-consumer-sentiment-hits-7-month-low-after-trump-takes-office-2028151",
    "timestamp": "2025-02-07T22:37:24Z"
  },
  {
    "title": "The legal resistance to Trump's barrage of executive actions has begun",
    "description": "This week’s Deadline: Legal Newsletter looks at how judges have dealt the president a series of losses, plus other legal news.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-lawsuits-executive-actions-deadline-newsletter-rcna191176",
    "timestamp": "2025-02-07T22:37:02Z"
  },
  {
    "title": "Trump's 'God Squad' Holds Increasing Sway At White House",
    "description": "Donald Trump said at his inauguration that he had been \"saved by God.\"",
    "link": "https://www.ibtimes.com/trumps-god-squad-holds-increasing-sway-white-house-3762891",
    "timestamp": "2025-02-07T22:36:22Z"
  },
  {
    "title": "Trump administration preparing to restart immigrant family detention",
    "description": "The Trump administration is moving forward with restarting the detention of migrant families, including those with young children.",
    "link": "https://www.nbcnews.com/politics/national-security/trump-administration-preparing-restart-immigrant-family-detention-rcna191230",
    "timestamp": "2025-02-07T22:36:16Z"
  },
  {
    "title": "Shiv Sena (UBT) holds protest in Jammu, seeks deportation of Bangladeshis, Rohingyas on US pattern",
    "description": "JAMMU, Feb 7: The Shiv Sena held a protest demonstration here on Friday, asking the Centre to draw inspiration from the US and deport illegal Bangladeshis and Rohingya immigrants from the country with a particular focus on Jammu and Kashmir. Scores of activis…",
    "link": "https://thehillstimes.in/national/shiv-sena-ubt-holds-protest-in-jammu-seeks-deportation-of-bangladeshis-rohingyas-on-us-pattern",
    "timestamp": "2025-02-07T22:35:00Z"
  },
  {
    "title": "EXCLUSIVE: Personal Diary of USAID Staffer Reveals 'Apocalyptic Suffering' at Beleaguered Agency",
    "description": "Donald Trump is doing what he promised to do during the campaign by unleashing Elon Musk and his efficiency minions on the federal bureaucracy to eliminate taxpayer-funded DEI programs and other forms of wasteful spending. Democrats have reacted in the usual …",
    "link": "https://freebeacon.com/satire/exclusive-personal-diary-of-usaid-staffer-reveals-apocalyptic-suffering-at-beleaguered-agency/",
    "timestamp": "2025-02-07T22:34:48Z"
  },
  {
    "title": "USAID Controversy Live Updates: Judge Blocks Trump From Putting 2,200 Staff On Leave",
    "description": "Trump has attacked the aid agency’s leadership, saying they were a “bunch of radical lunatics.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/02/07/usaid-controversy-live-updates-judge-blocks-trump-from-putting-2200-staff-on-leave/",
    "timestamp": "2025-02-07T22:34:18Z"
  },
  {
    "title": "Federal Election Commission Chief Refuses to Leave After Being Fired by Trump, Vows to 'Stir Up Some Good Trouble'",
    "description": "The Chair of the Federal Election Commission has stated that she will not leave her position after being fired under President Donald Trump's administration.",
    "link": "https://www.ibtimes.com/federal-election-commission-chief-refuses-leave-after-being-fired-trump-vows-stir-some-good-3762889",
    "timestamp": "2025-02-07T22:34:09Z"
  },
  {
    "title": "SET index searches for a new bottom",
    "description": "<p>The SET index extended its decline in January, marking the third consecutive month of reductions following an October high of 1,506 points.</p>",
    "link": "https://www.bangkokpost.com/business/investment/2956613/set-index-searches-for-a-new-bottom",
    "timestamp": "2025-02-07T22:33:00Z"
  },
  {
    "title": "SET index searches for a new bottom",
    "description": "<p>The SET index extended its decline in January, marking the third consecutive month of reductions following an October high of 1,506 points.</p>",
    "link": "https://www.bangkokpost.com/business/general/2956613/set-index-searches-for-a-new-bottom",
    "timestamp": "2025-02-07T22:33:00Z"
  },
  {
    "title": "Trump administration temporarily blocked from placing 2,200 USAID workers on paid leave",
    "description": "U.S. District Judge Carl Nichols, who was nominated by President Donald Trump, sided with two federal employee associations in agreeing to a pause in plans to put the employees on paid leave as of midnight Friday.",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-temporarily-blocked-from-placing-2200-usaid-workers-on-paid-leave",
    "timestamp": "2025-02-07T22:32:22Z"
  },
  {
    "title": "Trump Says He'll Announce Reciprocal Tariffs Next Week",
    "description": "President Donald Trump said he plans to unveil reciprocal tariffs next week in a major escalation of his trade war with US economic partners.\nTrump made the announcement during a meeting with visiting Japanese Prime Minister Shigeru Ishiba on Friday and said …",
    "link": "https://biztoc.com/x/2fff2b39a11ef64f",
    "timestamp": "2025-02-07T22:28:45Z"
  },
  {
    "title": "Here Are All The Major Lawsuits Against Trump And Musk—As Judge Halts Some USAID Staff Cuts",
    "description": "Judges have blocked some of Trump and Musk's early moves—for now.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/07/here-are-all-the-major-lawsuits-against-trump-and-musk-as-judge-halts-some-usaid-staff-cuts/",
    "timestamp": "2025-02-07T22:27:58Z"
  },
  {
    "title": "Ending USAID programs could undercut Trump's goal of slashing migration to the U.S., groups say",
    "description": "In Colombia and Haiti, U.S. funding supports farming and fishing and provides incentives for people to stay rather than migrate to the U.S.",
    "link": "https://www.nbcnews.com/news/latino/cutting-usaid-migration-us-border-rcna191169",
    "timestamp": "2025-02-07T22:27:44Z"
  },
  {
    "title": "US Announces $7 Billion in Arms Sales to Israel After Netanyahu DC Visit",
    "description": "This significant US arms sale occurs amidst a fragile ceasefire agreement between Israel and Hamas.",
    "link": "https://www.newsweek.com/us-announces-7-billion-arms-sales-israel-after-netanyahu-dc-visit-2028166",
    "timestamp": "2025-02-07T22:27:42Z"
  },
  {
    "title": "LGBTQ+ education nonprofit GLSEN lays off 60% of staff in major relaunch",
    "description": "GLSEN\r\n, the national nonprofit dedicated to fostering safe and inclusive schools for LGBTQ\r\n+ students, has laid off 60 percent of its workforce. The organization’s leader says that the business\r\n decision was painful and necessary in response to mounting fi…",
    "link": "https://www.advocate.com/news/glsen-layoffs-restructuring",
    "timestamp": "2025-02-07T22:27:16Z"
  },
  {
    "title": "States absorb big increases in Medicaid for sicker-than-expected enrollees after COVID-19 pandemic",
    "description": "States are absorbing substantial increases in health care costs for the poor, as they realize that the people remaining on Medicaid rolls after the COVID-19 pandemic are sicker than anticipated and costlier to care for. In Pennsylvania, state budget makers ju…",
    "link": "https://www.seattlepi.com/news/politics/article/states-absorb-big-increases-in-medicaid-for-20154543.php",
    "timestamp": "2025-02-07T22:27:15Z"
  },
  {
    "title": "Woke Lancet Freaks Out over Trump’s Climate, Gender Realism",
    "description": "The once illustrious Lancet medical journal is in full meltdown over Donald Trump’s repudiation of its favorite ideological projects, such as climate alarmism, global abortion funding, and “gender diversity.”\nThe post Woke Lancet Freaks Out over Trump’s Clima…",
    "link": "https://www.breitbart.com/politics/2025/02/07/woke-lancet-freaks-out-over-trumps-climate-gender-realism/",
    "timestamp": "2025-02-07T22:26:40Z"
  },
  {
    "title": "Dem shares plans to 'fight back' at 'complicit and spineless' Republicans: lawmaker",
    "description": "A Florida Democrat shared his party's ideas on how to \"fight back\" against President Donald Trump acting as an \"opposition party\" — and slammed his \"complicit and spineless\" GOP colleagues for enabling \"corrupt billionaires\" to \"eviscerate the federal governm…",
    "link": "https://www.rawstory.com/maxwell-frost-2671116981/",
    "timestamp": "2025-02-07T22:25:34Z"
  },
  {
    "title": "The Elite Lawyers Working for Elon Musk’s DOGE Include Former Supreme Court Clerks",
    "description": "by Justin Elliott, Avi Asher-Schapiro and Andy Kroll \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nAs members of Elon Musk’s Department of Go…",
    "link": "https://www.propublica.org/article/elon-musk-doge-lawyers-supreme-court",
    "timestamp": "2025-02-07T22:25:00Z"
  },
  {
    "title": "Anduril in talks to raise money at $28 billion valuation as defense-tech booms",
    "description": "Anduril has signed a term sheet to raise up to $2.5 billion at a valuation of $28 billion, according to sources close to the company.",
    "link": "https://www.cnbc.com/2025/02/07/anduril-in-talks-to-raise-money-at-28-billion-valuation.html",
    "timestamp": "2025-02-07T22:24:22Z"
  },
  {
    "title": "Thaksin to work on crypto plan",
    "description": "<p>Former prime minister Thaksin Shinawatra has been assigned to make a proposal and recommendation for the Association of Southeast Asian Nations (Asean) to start working towards adopting a cryptocurrency, he said on Friday.</p>",
    "link": "https://www.bangkokpost.com/business/general/2956503/thaksin-to-work-on-crypto-plan",
    "timestamp": "2025-02-07T22:24:00Z"
  },
  {
    "title": "Thaksin to work on crypto plan",
    "description": "<p>Thaksin Shinawatra has been assigned to make a proposal and recommendation for Asean to start working towards adopting a cryptocurrency, he said on Friday.</p>",
    "link": "https://www.bangkokpost.com/thailand/general/2956503/thaksin-to-work-on-crypto-plan",
    "timestamp": "2025-02-07T22:24:00Z"
  },
  {
    "title": "Judge pauses Trump plan to put thousands of USAID staff on leave",
    "description": "Only about 600 out of 10,000 employees would have kept working at the agency under the president's plan.",
    "link": "https://www.bbc.com/news/articles/cdd9p8g405no",
    "timestamp": "2025-02-07T22:23:40Z"
  },
  {
    "title": "Anduril In Talks To Raise Funding At $28 Billion Valuation",
    "description": "Founders Fund, which is leading the deal, is expected to contribute $1 billion to the $2.5 billion funding round.",
    "link": "https://www.forbes.com/sites/davidjeans/2025/02/07/anduril-in-talks-to-raise-funding-at-28-billion-valuation/",
    "timestamp": "2025-02-07T22:22:59Z"
  },
  {
    "title": "Trump 'supportive' of AUKUS, as Australia sends Washington $798m",
    "description": "US Defense Secretary Pete Hegseth says Donald Trump is \"supportive\" of the AUKUS alliance, after Australia sent a $US500 million ($798 million) payment to Washington as part of it.",
    "link": "https://www.abc.net.au/news/2025-02-08/donald-trump-supportive-of-aukus-pete-hegseth-says/104913062",
    "timestamp": "2025-02-07T22:21:30Z"
  },
  {
    "title": "The Labor Market Is Suffering, but Today's Jobs Data Looks Just Peachy",
    "description": "Layoffs, wildfires and deportations. Why is the jobs report still positive?",
    "link": "https://www.cnet.com/personal-finance/the-labor-market-is-suffering-but-todays-jobs-data-looks-just-peachy/",
    "timestamp": "2025-02-07T22:21:00Z"
  },
  {
    "title": "WATCH: Dems Harass Federal ‘Security Guard’ Posted Outside of Education Department: ‘Gimme That ID Again!’",
    "description": "Democrats surrounded and harassed a stoic federal security guard blocking the Department of Education building as they demanded to be let into the building Friday morning.\nThe post WATCH: Dems Harass Federal ‘Security Guard’ Posted Outside of Education Depart…",
    "link": "https://freebeacon.com/media/watch-dems-harass-federal-security-guard-posted-outside-of-education-department-gimme-that-id-again/",
    "timestamp": "2025-02-07T22:20:30Z"
  },
  {
    "title": "Colorado Tesla dealership vandalized in arson attempt, police say",
    "description": "A Colorado Tesla dealership was vandalized after someone tried to set it on fire early Friday morning and left graffiti that was “offensive and hateful in nature,” Loveland police said.",
    "link": "https://www.denverpost.com/2025/02/07/colorado-tesla-vandalism-arson-elon-musk-donald-trump-nazi-cars/",
    "timestamp": "2025-02-07T22:20:28Z"
  },
  {
    "title": "Trump pauses repeal of tariff on packages as they pile up at US customs",
    "description": "WASHINGTON/LONDON/LOS ANGELES — U.S. President Donald Trump paused his administration's repeal of duty-free treatment of low-cost packages from China on Friday, giving the Commerce Department time to make the order workable, after the rapid change sparked cha…",
    "link": "https://www.voanews.com/a/trump-pauses-repeal-of-tariff-on-packages-as-they-pile-up-at-us-customs-/7967176.html",
    "timestamp": "2025-02-07T22:19:33Z"
  },
  {
    "title": "Judge blocks Trump, Musk's shutdown of USAID",
    "description": "Judge Carl Nichols blocked Donald Trump and Elon Musk's attempted USAID shutdown days after the American Foreign Service Association filed a lawsuit.",
    "link": "https://www.businessinsider.com/trump-musk-doge-usaid-shutdown-blocked-2025-2",
    "timestamp": "2025-02-07T22:19:18Z"
  },
  {
    "title": "Time puts Elon Musk behind the Resolute desk for latest cover",
    "description": "Time published its latest cover Friday morning, featuring a striking image of a government leader sitting behind the Resolute desk in the Oval Office.",
    "link": "https://www.nbcnews.com/politics/politics-news/time-puts-elon-musk-resolute-desk-latest-cover-rcna191279",
    "timestamp": "2025-02-07T22:18:58Z"
  },
  {
    "title": "Trump seeks to slash Japan trade deficit through LNG exports and tariffs",
    "description": "WASHINGTON -- U.S. President Donald Trump told Japanese Prime Minister Shigeru Ishiba that he is looking to end America's trade deficit with its key ally and that it can be done \"very quickly\" through the expansion of energy exports.\nTrump greeted Ishiba at t…",
    "link": "https://biztoc.com/x/1a7ba5187a53612b",
    "timestamp": "2025-02-07T22:17:34Z"
  },
  {
    "title": "Elon Just Got a Legendary Letter from Trump's DOJ - Threats to DOGE Are Finished",
    "description": "D.C.'s U.S. Attorney has said that he will back Elon Musk's Department of Government Efficiency investigations and staff to the hilt.",
    "link": "https://www.westernjournal.com/elon-just-got-legendary-letter-trumps-doj-threats-doge-finished/",
    "timestamp": "2025-02-07T22:16:58Z"
  },
  {
    "title": "BEAUTIFUL: Corrupt USAID Signs Stripped from Washington Headquarters Amid Agency Overhaul",
    "description": "In a striking move signaling a significant overhaul, USAID signage has been removed from its Washington headquarters, marking a drastic reduction in staff and the agency's potential dissolution under the Trump administration.\nThe post BEAUTIFUL: Corrupt USAID…",
    "link": "https://www.thegatewaypundit.com/2025/02/beautiful-corrupt-usaid-signs-stripped-washington-headquarters-amid/",
    "timestamp": "2025-02-07T22:15:45Z"
  },
  {
    "title": "Trump Wrong About U.S. Rank in Education Spending and Outcomes",
    "description": "As justification for dismantling the federal Department of Education, President Donald Trump has repeatedly claimed that U.S. schools are \"ranked 40 out of 40\" in educational outcomes compared with other countries, while the U.S. \"ranked No. 1 in cost per pup…",
    "link": "https://www.factcheck.org/2025/02/trump-wrong-about-u-s-rank-in-education-spending-and-outcomes/",
    "timestamp": "2025-02-07T22:15:43Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration from placing 2,200 USAID workers on paid leave",
    "description": "A federal judge on Friday temporarily blocked the Trump administration from placing 2,200 employees of the U.S. Agency for International Development on paid leave.",
    "link": "https://www.wftv.com/news/local/judge-temporarily-blocks-trump-administration-placing-2200-usaid-workers-paid-leave/RWUZA37VPRD5HKMNBTSA2Z6V6A/",
    "timestamp": "2025-02-07T22:15:28Z"
  },
  {
    "title": "US Approves Sale Of $7.4 Billion In Bombs, Missiles To Israel",
    "description": "The United States on Friday announced the approval of the sale of more than $7.4 billion in bombs, missiles and related equipment to Israel, which has used American-made weapons to devastating effect during the war in Gaza.",
    "link": "https://www.ndtv.com/world-news/us-approves-sale-of-7-4-billion-in-bombs-missiles-to-israel-7660425",
    "timestamp": "2025-02-07T22:14:02Z"
  },
  {
    "title": "Video ordering Americans to leave Nigeria shows comedian, not president | Fact check",
    "description": "That's not the president of Nigeria in the clip. That's a comedian from Great Britain whose stage name is President Obonjo.",
    "link": "https://www.usatoday.com/story/news/factcheck/2025/02/07/nigeria-president-deporting-americans-video-fact-check/78333461007/",
    "timestamp": "2025-02-07T22:13:34Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration from placing 2,200 USAID workers on leave",
    "description": "Federal workers associations sued, arguing the president lacks the authority to shut down an agency enshrined in congressional legislation.",
    "link": "https://richmond.com/news/nation-world/crime-courts/politics-washington-trump-republicans-rubio/article_6c586baa-952f-54a6-a69a-983d64d76cb7.html",
    "timestamp": "2025-02-07T22:10:00Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration from placing 2,200 USAID workers on leave",
    "description": "Federal workers associations sued, arguing the president lacks the authority to shut down an agency enshrined in congressional legislation.",
    "link": "https://roanoke.com/news/nation-world/crime-courts/politics-washington-trump-republicans-rubio/article_28ba764c-2da2-5006-ad24-6db4ade7ff78.html",
    "timestamp": "2025-02-07T22:10:00Z"
  },
  {
    "title": "Trump says Japan’s Nippon will invest ‘heavily’ in US Steel — but that purchasing it is off the table",
    "description": "WASHINGTON — President Trump said Friday that Japan’s Nippon Steel would be allowed to invest “heavily” in US Steel, but would still not be able to outright purchase it. “They’ve agreed to invest heavily in US Steel, as opposed to own it, and that sounds very…",
    "link": "https://nypost.com/2025/02/07/us-news/trump-says-japans-nippon-will-invest-heavily-in-us-steel-but-that-purchasing-it-is-off-the-table/",
    "timestamp": "2025-02-07T22:09:33Z"
  },
  {
    "title": "No Shock There: Elon Musk’s White DOGE Staffer Resigns After Wildly Racist Tweets Resurface",
    "description": "Elon Musk’s DOGE employee Marko Elez resigns over racist X posts \nThe post No Shock There: Elon Musk’s White DOGE Staffer Resigns After Wildly Racist Tweets Resurface appeared first on Bossip.",
    "link": "http://bossip.com/2773408/elon-musks-doge-employee-resigns-over-racist-x-posts/",
    "timestamp": "2025-02-07T22:09:26Z"
  },
  {
    "title": "Shopify pushes for 'open trade' as Trump delays import exemption | TechCrunch",
    "description": "Shopify has published a post advocating for 'open' trade as the Trump Administration ways ending a tax exemption for certain imports.",
    "link": "https://techcrunch.com/2025/02/07/shopify-pushes-for-open-trade-as-trump-delays-import-exemption/",
    "timestamp": "2025-02-07T22:08:28Z"
  },
  {
    "title": "Trump updates Iran peace deal effort to reflect new realities, analysts say",
    "description": "WASHINGTON — U.S. President Donald Trump’s peace overtures toward Iran this week —  made as he signed a directive to put the country under “maximum pressure” for malign behavior — signal a revived policy that some analysts say has evolved from his first term …",
    "link": "https://www.voanews.com/a/trump-updates-iran-peace-deal-effort-to-reflect-new-realities-analysts-say/7967220.html",
    "timestamp": "2025-02-07T22:08:27Z"
  },
  {
    "title": "Is Donald Trump Afraid of Elon Musk?",
    "description": "The president has long operated without anything resembling worry when it comes to appointments or executive action, but as his most powerful—and richest—political ally chainsaws his way through the federal government, some observers wonder if Trump might be …",
    "link": "https://www.vanityfair.com/news/story/is-donald-trump-afraid-of-elon-musk",
    "timestamp": "2025-02-07T22:08:06Z"
  },
  {
    "title": "RFK Jr. had up to $1.2 million in credit card debt — what experts say about tackling high balances",
    "description": "Robert F. Kennedy Jr.'s recent financial disclosures show a \"massive\" amount of credit card debt, according to experts.",
    "link": "https://www.cnbc.com/2025/02/07/what-rfk-jrs-financial-disclosures-may-teach-us-about-managing-debt.html",
    "timestamp": "2025-02-07T22:07:53Z"
  },
  {
    "title": "Majority of Canadians want government to pledge advertising dollars to domestic news outlets",
    "description": "The report comes after the federal government confirmed Wednesday it was ending its advertising boycott of Meta’s social media sites.",
    "link": "https://nationalpost.com/news/majority-of-canadians-want-government-to-pledge-advertising-dollars-to-domestic-news-outlets",
    "timestamp": "2025-02-07T22:07:29Z"
  },
  {
    "title": "Trump and Japanese PM say Japan is looking at investment in US Steel instead of purchase",
    "description": "U.S. President Donald Trump and Japanese Prime Minister Shigeru Ishiba said on Friday Japan was looking at an investment in U.S. Steel instead of an acquisition.",
    "link": "https://biztoc.com/x/9f2a932d214cb2af",
    "timestamp": "2025-02-07T22:06:57Z"
  },
  {
    "title": "Trump is trying to halt the EV charger buildout. Experts say it's not that easy",
    "description": "Experts are questioning President Donald Trump’s latest effort to slow the electric vehicle charging buildout in the U.S.\nIn a letter Thursday night, the Trump administration directed states to stop spending money for EV charging infrastructure, funds they we…",
    "link": "https://biztoc.com/x/91159b764513499d",
    "timestamp": "2025-02-07T22:06:45Z"
  },
  {
    "title": "Trump-Appointed Judge Temporarily Blocks Efforts to Dismantle USAID",
    "description": "On Friday, U.S. District Judge Carl Nichols stated that he intends to issue a \"very limited\" temporary order to prevent President Donald Trump's administration from taking specific actions to dismantle the U.S. Agency for International Development (USAID).\nTh…",
    "link": "https://biztoc.com/x/060b45832e5991cf",
    "timestamp": "2025-02-07T22:06:44Z"
  },
  {
    "title": "Marjorie Taylor Greene Says She's Considering Running for Governor of Georgia",
    "description": "Georgia Gov. Brian Kemp is term-limited and cannot seek re-election as governor next year, while Senator's Jon Ossoff seat is also up for reelection in 2026",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-considering-running-governor-georgia-3762883",
    "timestamp": "2025-02-07T22:06:42Z"
  },
  {
    "title": "Trump says he’ll roll out reciprocal tariffs next week. Here are his possible targets",
    "description": "President Donald Trump on Friday said his administration would soon have an announcement about reciprocal tariffs. Peter Navarro, a longtime adviser to the president, has a target list for him.",
    "link": "https://biztoc.com/x/51e24ef269336627",
    "timestamp": "2025-02-07T22:06:40Z"
  },
  {
    "title": "Shopify pushes for ‘open trade’ as Trump delays import exemption",
    "description": "On the same day that President Donald Trump delayed ending a trade exemption targeting certain Chinese imports, ecommerce company Shopify published a blog post making its stance on U.S. trade policy clear. In the post, Shopify endorsed “open trade,” calling f…",
    "link": "https://biztoc.com/x/fce05254f39b0a3e",
    "timestamp": "2025-02-07T22:06:33Z"
  },
  {
    "title": "BJ’s Wholesale Club Holdings Inc. (BJ) Among the Top Discount Stores Stocks for 2025",
    "description": "We recently published a list of Top 8 Discount Stores Stocks For 2025. In this article, we are going to take a look at where BJ’s Wholesale Club Holdings Inc...",
    "link": "https://finance.yahoo.com/news/bj-wholesale-club-holdings-inc-220621513.html",
    "timestamp": "2025-02-07T22:06:21Z"
  },
  {
    "title": "10 cheap cars to buy now, according to Consumer Reports",
    "description": "Tariffs were one of President Donald Trump’s biggest campaign promises, and they have become a reality, albeit with a few caveats.\nAmong the 50+ executive orders Trump signed within his first three weeks in office was one implementing an additional 25% tariff…",
    "link": "https://biztoc.com/x/fa778fa61a088832",
    "timestamp": "2025-02-07T22:06:18Z"
  },
  {
    "title": "WATCH: Trump talks trade with Japan’s prime minister",
    "description": "President Donald Trump said Friday he wants to slash the U.S. trade deficit with Japan as he welcomed Japanese Prime Minister Shigeru Ishiba to the White House for their first face-to-face meeting.",
    "link": "https://biztoc.com/x/443bb620a0a6f828",
    "timestamp": "2025-02-07T22:06:13Z"
  },
  {
    "title": "How Vance is carving out his role as VP: From the Politics Desk",
    "description": "JD Vance is carving out his role as vice president, focusing on TikTok, Capitol Hill and foreign policy issues at the outset of Trump's second term.",
    "link": "https://www.nbcnews.com/politics/jd-vance-carving-role-vp-politics-desk-rcna191284",
    "timestamp": "2025-02-07T22:06:03Z"
  },
  {
    "title": "China Condemns U.S. ‘Coercion’ Over Panama Canal",
    "description": "Panama maintains that U.S. President Donald Trump did not push the Latin American country to leave the Belt and Road Initiative.",
    "link": "https://foreignpolicy.com/2025/02/07/china-panama-canal-us-trump-bri-mulino/",
    "timestamp": "2025-02-07T22:06:01Z"
  },
  {
    "title": "Judge Temporarily Blocks Trump Administration From Placing 2,200 USAID Workers On Paid Leave",
    "description": "U.S. District Judge Carl Nichols sided with two federal employee associations in agreeing to a pause in plans to put the employees on paid leave as of midnight Friday.",
    "link": "https://www.huffpost.com/entry/judge-temporarily-blocks-trump-administration-usaid-workers-paid-leave_n_67a68287e4b0682fe26cf916",
    "timestamp": "2025-02-07T22:05:19Z"
  },
  {
    "title": "Musk to rehire Doge aide who resigned over racist posts",
    "description": "Vice-President JD Vance had said the young employee should be given a second chance.",
    "link": "https://www.bbc.com/news/articles/c93q625y04wo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-02-07T22:05:05Z"
  },
  {
    "title": "Donald Trump reveals his feelings for Travis Kelce, after saying months ago he hates Taylor Swift",
    "description": "Donald Trump shared his thoughts on the upcoming Super Bowl in a post on his Truth Social platform, offering praise for some of the NFL&apos;s biggest stars while also voicing his",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/02/07/67a6834fe2704e4b018b457e.html",
    "timestamp": "2025-02-07T22:04:58Z"
  },
  {
    "title": "American importers stockpile Prosecco as hedge against Trump tariffs",
    "description": "American importers have been stockpiling Italian bubbly Prosecco as a hedge against the possible impact of tariffs threatened by President Donald Trump, wine industry data show.",
    "link": "https://nypost.com/2025/02/07/us-news/us-importers-stockpile-italian-prosecco-as-a-hedge-against-possible-trump-tariffs/",
    "timestamp": "2025-02-07T22:04:45Z"
  },
  {
    "title": "‘It Really Disturbs Me:’ One Republican’s Dire Warning to His Party",
    "description": "Rep. Josh Brecheen, R-Okla., has a dire warning for his fellow Republicans—find a way to make President Donald Trump’s agenda affordable or face economic collapse.... Read More\nThe post ‘It Really Disturbs Me:’ One Republican’s Dire Warning to His Party appea…",
    "link": "https://www.dailysignal.com/2025/02/07/eally-disturbs-me-republicans-dire-warning-party/",
    "timestamp": "2025-02-07T22:04:34Z"
  },
  {
    "title": "Costco Wholesale Corporation (COST) Among the Top Discount Stores Stocks for 2025",
    "description": "We recently published a list of Top 8 Discount Stores Stocks For 2025. In this article, we are going to take a look at where Costco Wholesale Corporation (NASDAQ:COST) stands against other top discount stores stocks for 2025. When Donald Trump announced tarif…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_f611ec02-22e3-4ae9-84d6-2d9a95518a74",
    "timestamp": "2025-02-07T22:03:10Z"
  },
  {
    "title": "Catholic Relief Services Cuts Staff, Migration Efforts, as USAID Scandal Grows",
    "description": "Catholic Relief Services is making massive cuts after President Trump slashed the federal government's funding for mass migration.\nThe post Catholic Relief Services Cuts Staff, Migration Efforts, as USAID Scandal Grows appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/02/07/catholic-relief-services-cuts-staff-migration-efforts-as-usaid-scandal-grows/",
    "timestamp": "2025-02-07T22:02:35Z"
  },
  {
    "title": "Trump is trying to halt the EV charger buildout. Experts say it's not that easy",
    "description": "DETROIT (AP) — Experts are questioning President Donald Trump’s latest effort to slow the electric vehicle charging buildout in the U.S.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_377191cc-5ea0-459c-b37a-b86d1f494d16",
    "timestamp": "2025-02-07T22:02:28Z"
  },
  {
    "title": "Musk's next target? Trump says DOGE will look at Department of Education, Pentagon funding",
    "description": "President Donald Trump said he has instructed Elon Musk to look into wasteful government spending at the Department of Education and the Pentagon.",
    "link": "https://www.foxnews.com/politics/trump-says-doge-take-look-department-education-pentagon-funding",
    "timestamp": "2025-02-07T22:02:06Z"
  },
  {
    "title": "Dollar General Corporation (DG) Among the Top Discount Stores Stocks for 2025",
    "description": "We recently published a list of Top 8 Discount Stores Stocks For 2025. In this article, we are going to take a look at where Dollar General Corporation (NYSE:DG) stands against other top discount stores stocks for 2025. When Donald Trump announced tariffs on …",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_49bcdc8e-883b-43cc-8286-9b2bacb49c4c",
    "timestamp": "2025-02-07T22:01:03Z"
  },
  {
    "title": "Wall Street slips as consumers get more worried about inflation",
    "description": "U.S. stocks are falling Friday after a discouraging report suggested U.S. consumers are bracing for much higher inflation.",
    "link": "https://www.wishtv.com/news/business/wall-street-slips-as-consumers-get-more-worried-about-inflation-amazon-slides/",
    "timestamp": "2025-02-07T22:00:33Z"
  },
  {
    "title": "Sport And Politics Entwine As Trump Makes Historic Super Bowl Visit",
    "description": "Donald Trump will make history on Sunday when he becomes the first sitting US President to attend the Super Bowl, writing a new chapter in an often-strained relationship with the NFL that has been marked by decades of animosity.",
    "link": "https://www.ibtimes.com.au/sport-politics-entwine-trump-makes-historic-super-bowl-visit-1856004",
    "timestamp": "2025-02-07T22:00:24Z"
  },
  {
    "title": "WATCH: Trump talks trade with Japan’s prime minister",
    "description": "President Donald Trump said Friday he wants to slash the U.S. trade deficit with Japan as he welcomed Japanese Prime Minister Shigeru Ishiba to the White House for their first face-to-face meeting.",
    "link": "https://www.pbs.org/newshour/world/watch-trump-talks-trade-with-japans-prime-minister",
    "timestamp": "2025-02-07T22:00:20Z"
  },
  {
    "title": "Sport And Politics Entwine As Trump Makes Historic Super Bowl Visit",
    "description": "Donald Trump will make history on Sunday when he becomes the first sitting US President to attend the Super Bowl, writing a new chapter in an often-strained relationship with the NFL that has been marked by decades of animosity.",
    "link": "https://www.ibtimes.com/sport-politics-entwine-trump-makes-historic-super-bowl-visit-3762880",
    "timestamp": "2025-02-07T22:00:18Z"
  },
  {
    "title": "Members of Congress Warn About Looming Debt Crisis",
    "description": "As Republicans in Congress explore how they will accomplish President Donald Trump’s agenda through budget reconciliation, concerns about a national debt crisis percolate in the... Read More\nThe post Members of Congress Warn About Looming Debt Crisis appeared…",
    "link": "https://www.dailysignal.com/2025/02/07/members-of-congress-warn-about-looming-debt-crisis/",
    "timestamp": "2025-02-07T22:00:16Z"
  },
  {
    "title": "DOGE Staffer Who Quit Over Racist Posts Is Already Coming Back to Work",
    "description": "Elon Musk announced Friday that the Department of Government Efficiency employee who quit for a range of racist social media posts will be reinstated.\r\nMusk made a series of social media posts expressing his support for Marko Elez, the DOGE staffer who wrote …",
    "link": "https://newrepublic.com/post/191327/elon-musk-rehire-doge-staffer-racist-posts",
    "timestamp": "2025-02-07T22:00:11Z"
  },
  {
    "title": "Trump-Appointed Judge Temporarily Blocks Efforts to Dismantle USAID",
    "description": "This decision follows a lawsuit filed by the largest U.S. government workers' union and an association of foreign service workers.",
    "link": "https://www.newsweek.com/trump-appointed-judge-temporarily-blocks-efforts-dismantle-usaid-2028153",
    "timestamp": "2025-02-07T21:59:20Z"
  },
  {
    "title": "Project 2025 architect confirmed by the Senate to lead Office of Management and Budget",
    "description": "With a party-line vote, the Republican\r\n-controlled Senate has confirmed Russell Vought, a chief architect of the extremist policy blueprint Project 2025, to lead the Office of Management and Budget, giving him sweeping authority over federal spending. The Th…",
    "link": "https://www.advocate.com/politics/russell-vought-project-2025-confirmed",
    "timestamp": "2025-02-07T21:58:57Z"
  },
  {
    "title": "Judge pauses Trump plan to put USAID staff on leave",
    "description": "Judge Carl Nichols said he would be entering a \"very limited\" temporary restraining order directed at the 2,200 at-risk USAID workers.",
    "link": "https://www.cnbc.com/2025/02/07/trump-usaid-staff-leave-pause.html",
    "timestamp": "2025-02-07T21:58:27Z"
  },
  {
    "title": "Trump Suspends $5 Billion Electric Vehicle Charging Station Program",
    "description": "President Donald Trump’s administration halted the $5 billion Biden electric vehicle charging program, which has been criticized for its poor production of charging stations. Emily Biondi, the associate administrator for the Office of Planning, Environment, a…",
    "link": "https://freerepublic.com/focus/f-news/4295833/posts",
    "timestamp": "2025-02-07T21:58:22Z"
  },
  {
    "title": "Dollar Tree, Inc. (DLTR) Among the Top Discount Stores Stocks for 2025",
    "description": "We recently published a list of Top 8 Discount Stores Stocks For 2025. In this article, we are going to take a look at where Dollar Tree, Inc. (NASDAQ:DLTR) stands against other top discount stores stocks for 2025. When Donald Trump announced tariffs on China…",
    "link": "https://finance.yahoo.com/news/dollar-tree-inc-dltr-among-215807120.html",
    "timestamp": "2025-02-07T21:58:07Z"
  }
]