[
  {
    "title": "Breaking News Live Updates: Tens of thousands march in US against Trump 'devastation'",
    "description": "Breaking News Live Updates: Tens of thousands of protesters flooded the streets of major US cities on Saturday to oppose the divisive policies of President Donald Trump, in the largest demonstrations since his return to the White House.",
    "link": "https://m.economictimes.com/news/newsblogs/today-news-live-updates-pm-modi-sri-lanka-visit-ram-navami-ayodhya-us-trump-tariffs-hands-off-protests-russia-ukraine-news-today-6-april-india-world-news/liveblog/120028899.cms",
    "timestamp": "2025-04-06T00:50:41Z"
  },
  {
    "title": "James Carville Opens Nominations for Crowdsourced Trump ‘Collaborators’ List Who He’s ‘NOT’ Saying Should Have Their Heads Shaved and Be ‘Spit On’",
    "description": "The Democrat and cable news regular invited public nominations to his list of the \"treasonous\" people \"collaborating\" with the Trump \"regime.\"\nThe post James Carville Opens Nominations for Crowdsourced Trump ‘Collaborators’ List Who He’s ‘NOT’ Saying Should H…",
    "link": "https://www.mediaite.com/politics/james-carville-opens-nominations-for-crowdsourced-trump-collaborators-list-who-hes-not-saying-should-have-their-heads-shaved-and-be-spit-on/",
    "timestamp": "2025-04-06T00:41:08Z"
  },
  {
    "title": "\"Elon Can Oligargle Des Nutz\"",
    "description": "Here are all the signs and shirts and dogs we saw at today's rally. Good job showin' up, Seattle.\n \n by Megan Seling\n \n \n \n Photos by Megan Seling\nThousands of people filled Seattle Center today as part of the Hands Off national day of protest. AP is reportin…",
    "link": "https://www.thestranger.com/news/2025/04/05/79999711/elon-can-oligargle-des-nutz",
    "timestamp": "2025-04-06T00:31:00Z"
  },
  {
    "title": "Donald Trump’s new world order",
    "description": "President Trump has upended the international order to promote his “America First” agenda. He has thrown countries and their leaders around the world off balance with his radical departure from decades-old United States foreign policy. With so many changes go…",
    "link": "https://www.bbc.co.uk/programmes/p0l2k0n9",
    "timestamp": "2025-04-06T00:30:00Z"
  },
  {
    "title": "Thousands of protesters line Division Street in Spokane to rally against Trump and Musk",
    "description": "Thousands of protesters lined Spokane’s North Division Street and hundreds more poured onto the side of U.S. Highway 95 in Coeur d’Alene Saturday to rally against the policies of President Donald Trump and his adviser Elon Musk.",
    "link": "https://www.spokesman.com/stories/2025/apr/05/thousands-of-protesters-line-division-street-in-sp/",
    "timestamp": "2025-04-06T00:26:38Z"
  },
  {
    "title": "Trump Says America Will Win ‘Economic Revolution,’ Promises ‘Historic’ Result",
    "description": "President Donald Trump said that the United States is in the midst of an “economic revolution” and urged Americans to “hang tough” for a “historic” result. Trump’s comments came in a Truth Social post on Saturday, just days after he announced his worldwide re…",
    "link": "https://freerepublic.com/focus/f-news/4309113/posts",
    "timestamp": "2025-04-06T00:23:57Z"
  },
  {
    "title": "Anti-Trump rally draws thousands to downtown Denver",
    "description": "A crowd of thousands heard speeches and marched through downtown Denver on Saturday to protest the actions of the Trump administration.",
    "link": "https://www.denverpost.com/2025/04/05/anti-trump-rally-march-downtown-denver/",
    "timestamp": "2025-04-06T00:23:44Z"
  },
  {
    "title": "Mark Cuban weighs in on transgender athletes in women's sports: 'People just aren't ready'",
    "description": "Dallas Mavericks minority owner Mark Cuban gave his take on the issue of trans athletes in women's sports in an interview on \"The Stephen A. Smith Show.\"",
    "link": "https://www.foxnews.com/sports/mark-cuban-weighs-trans-athletes-womens-sports-people-just-arent-ready",
    "timestamp": "2025-04-06T00:23:07Z"
  },
  {
    "title": "Trump administration appoints junior officer to oversee U.S. Foreign Service",
    "description": "The move comes as Trump shrinks the federal workforce and looks to revamp the U.S. diplomatic corps to ensure a dedicated implementation of his \"America First\" policies.",
    "link": "https://www.japantimes.co.jp/news/2025/04/06/world/politics/trump-junior-officer-us-foreign-service/",
    "timestamp": "2025-04-06T00:23:00Z"
  },
  {
    "title": "Trump says Australia has banned American beef, but that is not true",
    "description": "Cattle Australia says Donald Trump fails to recognise that the US has had access to the Australian market since 2019, provided it can demonstrate its beef comes from cattle born, raised and slaughtered in the US.",
    "link": "https://www.abc.net.au/news/2025-04-06/trump-claims-australia-bans-american-beef-imports-incorrect/105139686",
    "timestamp": "2025-04-06T00:17:30Z"
  },
  {
    "title": "US cancels visas for South Sudanese over deportation dispute",
    "description": "The African nation is \"taking advantage\" of the US by not accepting its citizens, says the top US diplomat.",
    "link": "https://www.bbc.com/news/articles/cn5x775plnlo",
    "timestamp": "2025-04-06T00:11:17Z"
  },
  {
    "title": "'Hang tough, it won't be easy': Trump defiant on tariffs",
    "description": "The comments came as Trump's widest-ranging trade measures took effect in a move that could trigger retaliation and escalating economic tensions.",
    "link": "https://www.japantimes.co.jp/business/2025/04/06/economy/trump-defiant-tariffs/",
    "timestamp": "2025-04-06T00:11:00Z"
  },
  {
    "title": "Thousands in Fargo-Moorhead protest Trump administration during 'Hands Off Day of Action'",
    "description": "\"We the people are saying to Elon Musk and Donald Trump to take their hands off our democracy and follow the rule of law,\" organizer Lyn Dockter-Pinnick of Moorhead said.",
    "link": "https://www.inforum.com/news/fargo/thousands-in-fargo-moorhead-protest-trump-administration-during-hands-off-day-of-action",
    "timestamp": "2025-04-06T00:08:50Z"
  },
  {
    "title": "‘Hands Off’ rallies organize in San Diego to push against Trump Administration",
    "description": "Thousands of San Diegans joined the movement on Saturday to push against President Donald Trump’s administration.",
    "link": "https://www.nbcsandiego.com/news/local/hands-off-rallies-organize-in-san-diego-to-push-against-trump-administration/3796243/",
    "timestamp": "2025-04-06T00:08:03Z"
  },
  {
    "title": "This 15-Year-Old Just Scorched Team Trump in a Frankly Amazing Interview (Mother Jones)",
    "description": "Mother Jones:\nThis 15-Year-Old Just Scorched Team Trump in a Frankly Amazing Interview  —  The kids are all right.  —  On Saturday, thousands of people all across the globe took to the streets to protest President Donald Trump's administration.  Out of the do…",
    "link": "https://www.memeorandum.com/250405/p77",
    "timestamp": "2025-04-06T00:05:01Z"
  },
  {
    "title": "Senate GOP approves framework for Trump’s tax breaks",
    "description": "Washington, April 5: Senate Republicans plugged away overnight and into early Saturday morning to approve their multitrillion-dollar tax breaks and spending cuts framework, hurtling past hardened Democratic opposition toward what President Donald Trump calls …",
    "link": "https://thehillstimes.in/international/senate-gop-approves-framework-for-trumps-tax-breaks",
    "timestamp": "2025-04-06T00:05:00Z"
  },
  {
    "title": "Anti-Trump protesters gather in Washington, other U.S. cities",
    "description": "Some 1,200 demonstrations nationwide were expected to form one of the largest single days of protest against President Donald Trump since he was sworn in on Jan. 20.",
    "link": "https://www.japantimes.co.jp/news/2025/04/06/world/politics/us-trump-protests/",
    "timestamp": "2025-04-06T00:04:00Z"
  },
  {
    "title": "Grapevine April 6, 2025: From the distaff side",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/opinion/article-848964",
    "timestamp": "2025-04-06T00:03:35Z"
  },
  {
    "title": "JPMorgan: Trump's Tariffs Are the Largest Tax Hike Since 1968 and Could Tip the World Into Recession",
    "description": "JPMorgan estimates that the tariffs will impose a financial burden of approximately £540.86 billion ($700 billion) on U.S. consumers.",
    "link": "https://www.ibtimes.com/jpmorgan-trumps-tariffs-are-largest-tax-hike-since-1968-could-tip-world-recession-3768940",
    "timestamp": "2025-04-06T00:03:10Z"
  },
  {
    "title": "Trump has turned his back on the foundation of US economic might - the fallout will be messy",
    "description": "Trump has turned his back on the foundation of US economic might - the fallout will be messy\nPresident Donald Trump has built another wall, and he thinks everyone else is going to pay for it. But his decision to impose sweeping tariffs of at least 10% on almo…",
    "link": "https://biztoc.com/x/d8a09806c66d829f",
    "timestamp": "2025-04-06T00:02:46Z"
  },
  {
    "title": "Thousands Swarm DC Streets to Protest Trump, Musk and Israel's War on Gaza",
    "description": "While President Donald Trump played golf, thousands of demonstrators across the nation and around the globe gathered to protest the Trump administration, Elon Musk and Israel's war on Gaza.",
    "link": "https://www.ibtimes.com/thousands-swarm-dc-streets-protest-trump-musk-israels-war-gaza-3768939",
    "timestamp": "2025-04-06T00:02:00Z"
  },
  {
    "title": "What grocery items may cost more due to Trump's tariffs? Seafood, coffee, olive oil, more",
    "description": "Following President Donald Trump's recent round of reciprocal tariffs, many grocery shoppers' wallets could be impacted in the coming months.",
    "link": "https://www.usatoday.com/story/money/2025/04/05/groceries-price-increase-trump-tariffs/82953625007/",
    "timestamp": "2025-04-06T00:01:41Z"
  },
  {
    "title": "Solana Jumps in Price After PayPal and Venmo Roll Out Support for SOL and Chainlink (LINK)",
    "description": "Solana defied the crypto market doldrums and surged by more than 5% on Friday after the retail payment giants PayPal and Venmo rolled out support for SOL. PayPal announced on Friday that users of both payment platforms could now buy, sell, hold and transfer S…",
    "link": "https://dailyhodl.com/2025/04/05/solana-jumps-in-price-after-paypal-and-venmo-roll-out-support-for-sol-and-chainlink-link/",
    "timestamp": "2025-04-06T00:00:53Z"
  },
  {
    "title": "Getting Rid of DEI Is Like “Getting Soap Out Of A Sponge”",
    "description": "\"Trump is now squeezing that sponge and a lot of the easy stuff is coming out now.... But DEI is going to persist for the foreseeable future... Do this for six to 10 years. and I think you will deal mortal damage to DEI. Do it for two to three years, and they…",
    "link": "https://legalinsurrection.com/2025/04/getting-rid-of-dei-is-like-getting-soap-out-of-a-sponge/",
    "timestamp": "2025-04-06T00:00:09Z"
  },
  {
    "title": "China electronics casts neighbourly eye on India",
    "description": "US President Trump's tariffs are prompting Chinese electronics companies like Haier, Lenovo, and Hisense to explore exporting from Indian factories to reduce costs. Companies are urging India's government to ease FDI rules for smoother investment processes. I…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/china-electronics-casts-neighbourly-eye-on-india/articleshow/120023610.cms",
    "timestamp": "2025-04-06T00:00:00Z"
  },
  {
    "title": "Trump has turned his back on the foundation of US economic might - the fallout will be messy",
    "description": "What made the US step back from the system that it profited handsomely from for decades?",
    "link": "https://www.bbc.com/news/articles/cp34nkj1kv2o",
    "timestamp": "2025-04-05T23:59:04Z"
  },
  {
    "title": "Judge Rules Trump 'Covertly' Withheld FEMA Funding From States With Sanctuary Laws",
    "description": "A judge revealed the Trump administration has been withholding federal aid from blue states with sanctuary laws, defying a previous court order.",
    "link": "https://www.ibtimes.com/judge-rules-trump-covertly-withheld-fema-funding-states-sanctuary-laws-3768935",
    "timestamp": "2025-04-05T23:58:36Z"
  },
  {
    "title": "'Ugly and dangerous turn': Conservative analyst points to 'writing on the wall' for GOP​",
    "description": "Republicans are \"frozen\" and still \"on their knees\" when it comes to standing up to Donald Trump, but they privately believe the President has brought a dangerous change to the party, according to a conservative analyst on Saturday.Conservative political pund…",
    "link": "https://www.rawstory.com/republicans-are-frozen-charlie-sykes/",
    "timestamp": "2025-04-05T23:57:27Z"
  },
  {
    "title": "Trump Shares Video Suggesting He’s Crashing Stock Market On Purpose",
    "description": "President Donald Trump shared a TikTok video on his Truth Social account that asserted that he is crashing the stock market intentionally. “Trump is crashing the stock market by 20% this month, but he’s doing it on purpose. This is why Warren Buffett just sai…",
    "link": "https://freerepublic.com/focus/f-bloggers/4309107/posts",
    "timestamp": "2025-04-05T23:56:28Z"
  },
  {
    "title": "Tariffs news: Jaguar Land Rover in UK pauses shipments to US amid tariff uncertainty",
    "description": "One of the UK’s biggest car producers has sensationally announced it is pausing shipments to the United States as it works to mitigate the effect of a 25 per cent tax on vehicle imports.",
    "link": "https://thenightly.com.au/business/tariffs-news-jaguar-land-rover-in-uk-pauses-shipments-to-us-amid-tariff-uncertainty-c-18277208",
    "timestamp": "2025-04-05T23:53:24Z"
  },
  {
    "title": "Trump's tariffs take effect",
    "description": "US President Donald Trump's unilateral 10% tariff on all imports from many countries have taken effect, with higher levies on goods from 57 larger...",
    "link": "https://www.odt.co.nz/business/trumps-tariffs-take-effect",
    "timestamp": "2025-04-05T23:52:44Z"
  },
  {
    "title": "This Index Is Officially in a Bear Market -- and It Could Be a Once-in-a-Generation Opportunity for Investors",
    "description": "It's no secret that the stock market took a massive nosedive after President Donald Trump revealed his \"reciprocal tariff\" plans, but there are some areas of the market that took the news worse than others.\nIn fact, the Russell 2000, which is widely considere…",
    "link": "https://biztoc.com/x/ab5d7c16119298e1",
    "timestamp": "2025-04-05T23:51:36Z"
  },
  {
    "title": "Iran’s currency falls to record low against dollar as tensions run high",
    "description": "Tehran, April 5: Iran’s rial currency traded Saturday at a record low against the US dollar as the country returned to work after a long holiday, costing over 1 million rials for a single greenback as tensions between Tehran and Washington likely will push it…",
    "link": "https://thehillstimes.in/international/irans-currency-falls-to-record-low-against-dollar-as-tensions-run-high",
    "timestamp": "2025-04-05T23:50:00Z"
  },
  {
    "title": "Trump just torched Labour’s plan. Here’s what they’ll do instead",
    "description": "When a senior figure in the government called the White House on Wednesday morning to find out how bad Donald Trump’s tariffs were going to be for Britain, information was scant. Even Trump’s aides were in the dark about what he would decide. At 9pm that even…",
    "link": "https://freerepublic.com/focus/f-news/4309104/posts",
    "timestamp": "2025-04-05T23:48:56Z"
  },
  {
    "title": "U.S. progress against resilient Houthi militants remains murky",
    "description": "Trump's administration has offered limited evidence of weapons deployed and targets hit to back up his assertion.",
    "link": "https://www.japantimes.co.jp/news/2025/04/06/world/us-progress-houthi-militants/",
    "timestamp": "2025-04-05T23:47:00Z"
  },
  {
    "title": "'Hands Off!' Anti-Trump Americans flood Washington",
    "description": "<p>WASHINGTON - When Liz Gabbitas joined thousands of fellow protesters Saturday in the US capital, she thought her message to the Trump administration would be best delivered through her homemade sign: a cardboard guillotine.</p>",
    "link": "https://www.bangkokpost.com/world/2996726/hands-off-anti-trump-americans-flood-washington",
    "timestamp": "2025-04-05T23:45:00Z"
  },
  {
    "title": "Thousands brave cold in Denver anti-Trump protest as part of nationwide network of \"Hands Off!\" events",
    "description": "Among the crowd of several thousand were supporters of many causes: Palestinian liberation, Ukrainian solidarity, preserving the national parks, LGBTQ rights, immigrants' rights, trans rights, and women's rights.",
    "link": "https://www.cbsnews.com/colorado/news/thousands-denver-anti-trump-protest-network-hands-off-protests/",
    "timestamp": "2025-04-05T23:44:25Z"
  },
  {
    "title": "Iran's currency falls to a record low against the dollar as tensions run high",
    "description": "Iran’s rial currency traded at a record low against the U.S. dollar as the country returned to work after a long holiday.",
    "link": "https://www.clickondetroit.com/business/2025/04/05/irans-currency-falls-to-record-low-against-the-dollar-as-tensions-run-high/",
    "timestamp": "2025-04-05T23:42:13Z"
  },
  {
    "title": "With the economy cratering, people being disappeared, and protests nationwide, The White House would like you to know the important news of the day: Donald Trump won a golf tournament that he likely was the only participant in [Asinine]",
    "description": "With the economy cratering, people being disappeared, and protests nationwide, The White House would like you to know the important news of the day: Donald Trump won a golf tournament that he likely was the only participant in",
    "link": "https://www.fark.com/comments/13623896/With-economy-cratering-people-being-disappeared-protests-nationwide-The-White-House-would-like-you-to-know-important-news-of-day-Donald-Trump-won-a-golf-tournament-that-he-likely-was-only-participant-in",
    "timestamp": "2025-04-05T23:42:00Z"
  },
  {
    "title": "Musk Calls For United States And European Union To Move To Zero-Tariff System",
    "description": "Topline\nElon Musk, billionaire Tesla CEO and Department of Government Efficiency chief, told a meeting of Italy’s right-wing League Party he wants the United States and Europe to move to a system of zero tariffs and free trade, days after President Donald Tru…",
    "link": "https://biztoc.com/x/6a1489047d698528",
    "timestamp": "2025-04-05T23:40:33Z"
  },
  {
    "title": "Trump promised a manufacturing boom. Industries are not so sure",
    "description": "Some question the tariffs' underlying logic, saying that supply chain issues, high costs, and other obstacles stand may in the way.",
    "link": "https://www.japantimes.co.jp/business/2025/04/06/economy/trump-tariffs-manufacturing-boom/",
    "timestamp": "2025-04-05T23:40:00Z"
  },
  {
    "title": "Not to let crisis go waste, Pakistan says US tariffs opportunity for new negotiations",
    "description": "Islamabad, April 5: Prime Minister Shehbaz Sharif set up two committees to tackle the economic implication of the new tariffs imposed by US President Donald Trump, Finance Minister Muhammad Aurangzeb said on Saturday. The two bodies include a steering committ…",
    "link": "https://thehillstimes.in/international/not-to-let-crisis-go-waste-pakistan-says-us-tariffs-opportunity-for-new-negotiations",
    "timestamp": "2025-04-05T23:35:00Z"
  },
  {
    "title": "'Hands Off!' Protesters on Why They Are Rallying Against Trump and Musk",
    "description": "Thousands of protesters packed Manhattan's Fifth Avenue on Saturday in a sweeping show of opposition to the Trump administration, joining the nationwide \"Hands Off!\" movement targeting President Donald Trump and billionaire Elon Musk.\nWhy It Matters\nThe prote…",
    "link": "https://biztoc.com/x/0d9788427868b78f",
    "timestamp": "2025-04-05T23:29:37Z"
  },
  {
    "title": "'Hands Off!' Anti-Trump Americans Flood Washington",
    "description": "When Liz Gabbitas joined thousands of fellow protesters Saturday in the US capital, she thought her message to the Trump administration would be best delivered through her homemade sign: a cardboard guillotine.",
    "link": "https://www.ibtimes.com/hands-off-anti-trump-americans-flood-washington-3768937",
    "timestamp": "2025-04-05T23:27:07Z"
  },
  {
    "title": "'Hands Off!' Protesters on Why They Are Rallying Against Trump and Musk",
    "description": "Protesters targeted Trump and Musk over federal layoffs, immigration crackdowns, and U.S. involvement in Ukraine and Gaza, among other issues.",
    "link": "https://www.newsweek.com/hands-off-protesters-why-they-are-rallying-against-trump-musk-2055931",
    "timestamp": "2025-04-05T23:25:42Z"
  },
  {
    "title": "Volkswagen announces sneaky plan to get back at Trump",
    "description": "Volkswagen is going to let its customers know just how much President Donald Trump's tariffs will cost Americans. The German automotive manufacturing giant is reportedly adding a new line item to its vehicle stickers. Volkswagen will print an 'import fee' on …",
    "link": "https://freerepublic.com/focus/f-chat/4309098/posts",
    "timestamp": "2025-04-05T23:24:10Z"
  },
  {
    "title": "You Can Stop Asking Where the Mass Opposition Is. It’s Everywhere.",
    "description": "It is a cliche to begin a story about a rally with a quote from a funny sign, but one small piece of floppy brown cardboard floating down 40th Street in Manhattan on Saturday seemed to capture the mood of this weekend’s “Hands Off” protests against President …",
    "link": "https://www.motherjones.com/politics/2025/04/hands-off-donald-trump-fear-new-york-city/",
    "timestamp": "2025-04-05T23:23:21Z"
  },
  {
    "title": "Doug Emhoff publicly criticizes his law firm for coming to agreement with Trump administration",
    "description": "Speaking at a charity gala dinner Thursday night in Los Angeles, former second gentleman Doug Emhoff condemned the decision by his law firm to preemptively come to an arrangement with the Trump administration to avoid an executive order targeting the firm, so…",
    "link": "https://freerepublic.com/focus/f-news/4309097/posts",
    "timestamp": "2025-04-05T23:23:06Z"
  },
  {
    "title": "Chicago protestors rally against Trump, Musk Saturday",
    "description": "Protestors held signs, calling for the dismantling of the Department of Government Efficiency or DOGE saying they’re deeply concerned about the future of…",
    "link": "https://www.nbcchicago.com/news/local/chicago-groups-protestors-rally-against-president-donald-trump-and-elon-musk/3714834/",
    "timestamp": "2025-04-05T23:14:31Z"
  },
  {
    "title": "Nationwide protests erupt against Trump tariffs and policies",
    "description": "Protests erupted across the United States on Saturday as part of the \"Hands Off!\" movement, opposing the Trump administration's recent actions.Demonstrators ga",
    "link": "https://katu.com/news/local/nationwide-protests-erupt-against-trump-tariffs-and-policies",
    "timestamp": "2025-04-05T23:12:14Z"
  },
  {
    "title": "It Is Happening Here — Trump is following the playbook of autocrats around the world — and it could change America forever. (Paul Blumenthal/HuffPost)",
    "description": "Paul Blumenthal / HuffPost:\nIt Is Happening Here  —  Trump is following the playbook of autocrats around the world — and it could change America forever.  —  In his first 2 1/2 months in office, President Donald Trump has embraced sweeping arbitrary executive…",
    "link": "https://www.memeorandum.com/250405/p69",
    "timestamp": "2025-04-05T23:10:07Z"
  },
  {
    "title": "China Hit With 54% \"Reciprocal Tariff\" Rate Following Trump Address. 3 Things Pinduoduo Stock Investors Should Know",
    "description": "In This Article:\nStocks plunged on Thursday in response to President Donald Trump's \"reciprocal tariffs.\"\nWhile the president had telegraphed his desire for punitive tariffs to try to balance the trade deficit the U.S. has with much of the world, investors we…",
    "link": "https://biztoc.com/x/b3ec7c7b2cf385fc",
    "timestamp": "2025-04-05T23:07:07Z"
  },
  {
    "title": "The Chattering Classes: Searching for Ursula; Don’t Look Up in Valencia; UNRWA-liable; L’Espresso Robusto in Parliament; Austria’s ‘Cosa Nostra’ in the EIB",
    "description": "Euractiv’s weekly newsletter on politics, lobbying, and the media.",
    "link": "https://www.euractiv.com/section/politics/opinion/the-chattering-classes-searching-for-ursula-dont-look-up-in-valencia-unrwa-liable-lespresso-robusto-in-parliament-austrias-cosa-nostra-in-the-eib/",
    "timestamp": "2025-04-05T23:06:14Z"
  },
  {
    "title": "Patrick Mahomes' mom shares emotional White House visit amid Trump ties",
    "description": "Randi Mahomes, mother of Kansas City Chiefs superstar Patrick Mahomes, is making headlines-this time for something far from the football field. Earlier this week, she shared a phot",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/04/06/67f1aac522601d9f4d8b4593.html",
    "timestamp": "2025-04-05T23:05:47Z"
  },
  {
    "title": "France needs to sort its political mess - or else the populist winds blowing from the US will strengthen",
    "description": "Contemplating the turmoil sown by the return of President Trump, nobody could deny that the results of leadership elections in major nations matter to the rest of the world.",
    "link": "https://news.sky.com/story/france-needs-to-sort-its-political-mess-or-else-the-populist-winds-blowing-from-the-us-will-strengthen-13341745",
    "timestamp": "2025-04-05T23:01:00Z"
  },
  {
    "title": "Artist behind Trump portrait criticised by president says '41-year business in danger of not recovering'",
    "description": "An artist whose official portrait of Donald Trump was publicly criticised by the president said her business is now \"in danger of not recovering\".",
    "link": "https://news.sky.com/story/artist-behind-trump-portrait-criticised-by-president-as-truly-the-worst-says-business-in-danger-of-not-recovering-13343013",
    "timestamp": "2025-04-05T23:01:00Z"
  },
  {
    "title": "Bitcoin Indicator Signals Momentum Building – Capital Inflows Surge 350% In 2 Weeks",
    "description": "Bitcoin is facing critical selling pressure as bulls struggle to reclaim the $90,000 level, while bears continue to test — but fail to break — the $81,000 support zone. The market remains stuck in a tight range, caught between resistance and support, with mac…",
    "link": "https://bitcoinist.com/bitcoin-indicator-signals-momentum-building-capital-inflows-surge-350-in-2-weeks/",
    "timestamp": "2025-04-05T23:00:48Z"
  },
  {
    "title": "Trump extends TikTok deadline after tariffs blow up deal to sell the app to U.S. investors",
    "description": "President Donald Trump keeps TikTok alive for at least another 75 days by announcing an extension of his executive order.",
    "link": "https://www.phonearena.com/news/trump-extends-tiktok-deadline_id169203",
    "timestamp": "2025-04-05T23:00:45Z"
  },
  {
    "title": "Democrat Strategist James Carville Spirals, Fantasizes About Treating Those Working With President Trump Like Nazi Collaborators (Video)",
    "description": "In a striking commentary, James Carville equates cooperation with the Trump administration to WWII-era Nazi collaboration, raising alarms about the escalating political rhetoric and its implications for national discourse.\nThe post Democrat Strategist James C…",
    "link": "https://www.thegatewaypundit.com/2025/04/democrat-strategist-james-carville-spirals-fantasizes-about-treating/",
    "timestamp": "2025-04-05T23:00:35Z"
  },
  {
    "title": "Ethereum, Solana And Cardano Trend After Crypto Crash – Here’s What You Should Know",
    "description": "Despite the recent crypto crash that sent most digital assets tumbling, Ethereum (ETH), Solana (SOL) and Cardano (ADA) have managed to hold their ground. According to latest reports, these three cryptocurrencies are now leading the charts as the most trending…",
    "link": "http://www.newsbtc.com/altcoin/ethereum-solana-and-cardano-trend-after-crypto-crash-heres-what-you-should-know/",
    "timestamp": "2025-04-05T23:00:30Z"
  },
  {
    "title": "As Trump tariffs sink in, conservatives challenge whether they're legal (Maegan Vazquez/Washington Post)",
    "description": "Maegan Vazquez / Washington Post:\nAs Trump tariffs sink in, conservatives challenge whether they're legal  —  The New Civil Liberties Alliance, a legal nonprofit, has filed a complaint on behalf of a small stationery company in Florida.  —  Just now  —  A gro…",
    "link": "https://www.memeorandum.com/250405/p68",
    "timestamp": "2025-04-05T23:00:01Z"
  },
  {
    "title": "Taiwan Invested $165 Billion. Trump Hit Back With Tariffs.",
    "description": "Taiwan may have thought that it had bought its way out of hefty U.S. tariffs with last month’s announcement of a $100-billion investment in chip factories in the United States. Oh, was Taiwan wrong. As President Donald Trump’s tariff plan dropped on Wednesday…",
    "link": "https://oilprice.com/Energy/Energy-General/Taiwan-Invested-165-Billion-Trump-Hit-Back-With-Tariffs.html",
    "timestamp": "2025-04-05T23:00:00Z"
  },
  {
    "title": "Silver lining to US tariff",
    "description": "PETALING JAYA: The imposition of tariffs by the United States is not all doom-and-gloom as it has a silver lining for the nation, say trade groups. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/06/silver-lining-to-us-tariff",
    "timestamp": "2025-04-05T23:00:00Z"
  },
  {
    "title": "M’sia reaches out to Trump allies",
    "description": "MELAKA: Malaysia is engaging senior figures close to US President Donald Trump to initiate discussions over the 24% ta­riffs on Malaysian exports to the country, says Prime Minister Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/06/msia-reaches-out-to-trump-allies",
    "timestamp": "2025-04-05T23:00:00Z"
  },
  {
    "title": "Tariffs news: US tariffs start as Donald Trump hails 'economic revolution'",
    "description": "A baseline 10 per cent levy announced by US President Donald Trump has begun being collected at ports of entry across the United States.",
    "link": "https://thenightly.com.au/business/us-tariffs-start-as-trump-hails-economic-revolution-c-18277514",
    "timestamp": "2025-04-05T22:59:25Z"
  },
  {
    "title": "Donald Trump delays TikTok ban, but will it remain available in the U.S. in June? The truth behind the decision",
    "description": "President Donald Trump announced on Friday that his administration will delay the enforcement of a U.S. law requiring TikTok&apos;s Chinese parent company, ByteDance, to divest its",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/04/06/67f1a919ca474166468b457b.html",
    "timestamp": "2025-04-05T22:53:54Z"
  },
  {
    "title": "Sean Penns Non-Profit Wins Withdrawal of Case at Trump NLRB",
    "description": "US labor board prosecutors are ditching a Biden-era complaint that alleged Sean Penn illegally threatened his non-profit’s workers, the latest sign of a more management-friendly enforcement approach under President Donald Trump.",
    "link": "https://www.livemint.com/companies/news/sean-penns-non-profit-wins-withdrawal-of-case-at-trump-nlrb-11743893433791.html",
    "timestamp": "2025-04-05T22:50:33Z"
  },
  {
    "title": "Medicare will not cover these weight-loss drugs, Trump administration decides",
    "description": "The Centers for Medicare and Medicaid Services said late Friday that it would not cover the medications under Medicare’s Part D prescription drug coverage.",
    "link": "https://www.oregonlive.com/business/2025/04/medicare-will-not-cover-these-popular-drugs-trump-administration-decides.html",
    "timestamp": "2025-04-05T22:48:24Z"
  },
  {
    "title": "Pensacola protest draws 500 in opposition to Trump's government efficiency plans",
    "description": "PENSACOLA, Fla. -- Nearly 500 Pensacola protestors gathered saturday in opposition of president donald trump and Elon Musk's department of government efficiency",
    "link": "https://weartv.com/news/local/pensacola-protest-draws-500-in-opposition-to-trumps-government-efficiency-plans",
    "timestamp": "2025-04-05T22:46:46Z"
  },
  {
    "title": "Photo gallery: Thousands rally in 'Hands Off!' protests against Trump and Musk",
    "description": "Photo gallery: Thousands rally in ‘Hands Off!’ protests against Trump and Musk\nA demonstrator shouts slogans during a “Hands Off!” protest against President Donald Trump on Saturday, April 5, 2025, in New York. (AP Photo/Andres Kudacki)\nA demonstrator carries…",
    "link": "https://biztoc.com/x/d732a9ac1ddaac8b",
    "timestamp": "2025-04-05T22:45:27Z"
  },
  {
    "title": "Judge Leans Toward Contempt Proceedings For Trump Admin In Venezuelan Deportations Case",
    "description": "Judge Leans Toward Contempt Proceedings For Trump Admin In Venezuelan Deportations Case\n \nAuthored by Sam Dorman via The Epoch Times (emphasis ours),\nU.S. District Judge James Boasberg seemed inclined during a hearing on April 3 to find there was probable cau…",
    "link": "https://biztoc.com/x/3c87f7b6789240e5",
    "timestamp": "2025-04-05T22:45:04Z"
  },
  {
    "title": "Trump urges Americans to 'hang tough' on tariffs plan as markets tumble (Michael Dorgan/Fox News)",
    "description": "Michael Dorgan / Fox News:\nTrump urges Americans to ‘hang tough’ on tariffs plan as markets tumble  —  Trump on Truth Social claimed that an ‘economic revolution’ is taking place  —  President Donald Trump is doubling down on his controversial tariffs program…",
    "link": "https://www.memeorandum.com/250405/p66",
    "timestamp": "2025-04-05T22:45:01Z"
  },
  {
    "title": "Musk hopes US, Europe move to zero-tariff free-trade zone",
    "description": "Elon Musk hopes for a “zero-tariff” system between the US and Europe that would effectively create “a free-trade zone,” he said on Saturday, days after levies set by US President Donald Trump sent global markets into a tailspin.\n“Both Europe and the United St…",
    "link": "https://biztoc.com/x/1aded2f1504021e0",
    "timestamp": "2025-04-05T22:44:46Z"
  },
  {
    "title": "United States Accidentally Places Tariffs On Penguins That They Most Certainly Cannot Pay",
    "description": "Even most apolitical of United States citizens couldn’t help but pay attention as Donald Trump placed massive tariffs on the rest of the world this past week. The tariffs, which Trump says are meant to bring industry back to the U.S., blew up the world’s econ…",
    "link": "https://brobible.com/culture/article/united-states-places-tariffs-penguins-heard-mcdonald-islands/",
    "timestamp": "2025-04-05T22:44:16Z"
  },
  {
    "title": "Thousands in New Hampshire participate in nationwide 'Hands Off!' protest",
    "description": "With signs and rally chants, protesters across the state took part in the national event.",
    "link": "https://www.wmur.com/article/hands-off-protest-nh-concord-doge-04052025/64396203",
    "timestamp": "2025-04-05T22:41:26Z"
  },
  {
    "title": "Trump-Hating British Labour MP Arrested on Charges of Child Sex Abuse and Abduction",
    "description": "A Labour MP has been arrested on serious allegations of child abduction and sexual offences, prompting immediate suspension by the party. The ongoing investigation raises significant concerns about accountability and public trust.\nThe post Trump-Hating Britis…",
    "link": "https://www.thegatewaypundit.com/2025/04/trump-hating-british-labour-mp-arrested-charges-child/",
    "timestamp": "2025-04-05T22:40:27Z"
  },
  {
    "title": "Israel’s Netanyahu set for talks with Trump in Washington, DC",
    "description": "US media reports citing unnamed US and Israeli officials say the meeting would take place at the White House on Monday.",
    "link": "https://www.aljazeera.com/news/2025/4/5/israels-netanyahu-set-for-talks-with-trump-in-washington-dc",
    "timestamp": "2025-04-05T22:39:58Z"
  },
  {
    "title": "This 15-Year-Old Just Scorched Team Trump in a Frankly Amazing Interview",
    "description": "On Saturday, thousands of people all across the globe took to the streets to protest President Donald Trump’s administration. Out of the dozens of great people our reporters spoke to, one young interviewee stood out. Senior Editor Michael Mechanic bumped into…",
    "link": "https://www.motherjones.com/politics/2025/04/15-year-old-donald-trump-doge-hands-off-protests-princeton-new-jersey/",
    "timestamp": "2025-04-05T22:39:56Z"
  },
  {
    "title": "Jaguar and Land Rover maker pauses shipments to US as it develops post-tariff plans",
    "description": "LONDON (AP) — The maker of Jaguar and Land Rover cars is pausing shipments to the U.S. as Britain's struggling auto industry begins to respond to the 25% tax on vehicle imports imposed by President Donald Trump.",
    "link": "https://www.wral.com/story/jaguar-land-rover-to-enact-shipment-pause-to-us-in-april-as-it-develops-post-tariff-plans/21945705/",
    "timestamp": "2025-04-05T22:39:18Z"
  },
  {
    "title": "More countries express strong opposition to US tariffs, call for 'proportionate' response",
    "description": "More countries have voiced strong opposition to the US' new sweeping tariffs, with leaders from Europe, Asia, and Africa opposing the move and calling for more action to prevent further trade escalation.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250405-globaltimes02.htm",
    "timestamp": "2025-04-05T22:38:52Z"
  },
  {
    "title": "Zelensky used lie detectors to investigate leak – FT",
    "description": "Ukrainian leader Vladimir Zelennsky reportedly made officials take polygraph tests Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615282-zelensky-ukraine-lie-detectors/",
    "timestamp": "2025-04-05T22:38:45Z"
  },
  {
    "title": "My Trump-Loving Massachusetts Hometown Just Showed The Hell Up",
    "description": "Massachusetts may be a reliably blue state, but my hometown of Marshfield is not. In 2016, then-Democratic nominee Hillary Clinton decisively won the state in her face-off against President Donald Trump, earning nearly 61 percent of the vote. But in Marshfiel…",
    "link": "https://www.motherjones.com/politics/2025/04/my-trump-loving-massachusetts-hometown-just-showed-the-hell-up/",
    "timestamp": "2025-04-05T22:34:02Z"
  },
  {
    "title": "India to be patient in trade talks, to protect dairy, agriculture; Curb Chinese dumping: Officials",
    "description": "India is meticulously negotiating trade agreements in light of US-imposed tariffs, focusing on protecting sensitive sectors like dairy and agriculture. The government aims to prevent goods dumping from countries with steeper tariffs and provide support to imp…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-to-be-patient-in-trade-talks-to-protect-dairy-agriculture-curb-chinese-dumping-officials/articleshow/120023734.cms",
    "timestamp": "2025-04-05T22:34:00Z"
  },
  {
    "title": "Netanyahu Traveling To US To Meet Trump, Discuss Iran, Tariffs",
    "description": "Israeli Prime Minister Benjamin Netanyahu will travel to the United States on April 6 to meet with President Donald Trump for discussions on the \"Iranian threat\" and new US trade tariffs, the Israeli leader's office said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/04/israel-250405-rferl01.htm",
    "timestamp": "2025-04-05T22:30:54Z"
  },
  {
    "title": "Zelenskyy Calls Out 'Weak' US Response To Russian Playground Strike That Killed 9 Children",
    "description": "Ukrainian President Volodymyr Zelenskyy has sharply criticized a \"weak\" US response to a Russian air attack that hit a playground, killing at least 18 people, half of whom were children.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250405-rferl01.htm",
    "timestamp": "2025-04-05T22:30:54Z"
  },
  {
    "title": "Joseph Wu in U.S. for 'secret talks' via special channel: Report",
    "description": "Joseph Wu (吳釗燮), head of Taiwan's National Security Council (NSC), is on a visit to the United States to hold talks with the U.S. government via a \"special channel,\" days after China held its latest military exercises around Taiwan, the Financial Times report…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250405-cna03.htm",
    "timestamp": "2025-04-05T22:30:50Z"
  },
  {
    "title": "Russia: Ukraine increases energy attacks despite U.S.-brokered moratorium",
    "description": "Russia says Ukraine has increased its attacks on Russian energy infrastructure, hitting targets 14 times in the last 24 hours, despite a U.S.-brokered moratorium.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250405-irna01.htm",
    "timestamp": "2025-04-05T22:30:50Z"
  },
  {
    "title": "Increased U.S. military presence in Indo-Pacific 'deterrence' to China: Analysts",
    "description": "The United States' recent military activities in the Indo-Pacific region are aimed at deterring China, two analysts from a Taiwanese military-backed think tank told CNA.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250405-cna02.htm",
    "timestamp": "2025-04-05T22:30:50Z"
  },
  {
    "title": "Lai meets with ICT industry representatives amid U.S. tariff shock",
    "description": "President Lai Ching-te (賴清德) on Saturday met with representatives from the information and communications technology (ICT) industry which will soon face heavy tariffs on products exported to the U.S.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250405-cna04.htm",
    "timestamp": "2025-04-05T22:30:50Z"
  },
  {
    "title": "Ukraine 'multiplying' energy attacks in Russia despite 30-day moratorium: Moscow",
    "description": "Russia says Ukraine has increased its attacks on the country's energy infrastructure, hitting targets 14 times in the last 24 hours in violation of an energy truce deal brokered by the president of the United States.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250405-presstv01.htm",
    "timestamp": "2025-04-05T22:30:50Z"
  },
  {
    "title": "Iran wants dialogue with other countries on equal footing: President",
    "description": "President Masoud Pezeshkian has once again rejected foreign threats and pressure against Iran, saying the Islamic Republic will interact with other nations based on reciprocity and from an equal position.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250405-irna02.htm",
    "timestamp": "2025-04-05T22:30:49Z"
  },
  {
    "title": "US threats contradict its calls for diplomacy, Iran open to talks on 'equal footing': President",
    "description": "Iranian President Masoud Pezeshkian has criticized the language of threat against Tehran, saying the country is willing to engage in negotiations \"on equal footing.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250405-presstv02.htm",
    "timestamp": "2025-04-05T22:30:49Z"
  },
  {
    "title": "DOD Task Force to Assess Progress of DEI Elimination",
    "description": "A nine-member Defense Department task force headed by Jules W. Hurst III, an Army veteran who is performing the duties of undersecretary of defense for personnel and readiness, will visit numerous military installations, including military service academies, …",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250404-dodnews02.htm",
    "timestamp": "2025-04-05T22:30:49Z"
  },
  {
    "title": "Trump Ignites US Nuclear Comeback With Texas Plant",
    "description": "The Trump administration's drive to revive American manufacturing and power a growing artificial intelligence industry is accelerating with a new nuclear energy project in Texas, The Washington Times reported.A manufacturing facility in Texas is preparing to …",
    "link": "https://freerepublic.com/focus/f-news/4309087/posts",
    "timestamp": "2025-04-05T22:30:31Z"
  },
  {
    "title": "The Resistance Rumbles",
    "description": "The “Hands Off” protest in Washington, D.C., drew thousands of people with a lot of feelings—but as-yet-inchoate anger at the Trump administration.",
    "link": "https://www.theatlantic.com/politics/archive/2025/04/protest-washington-hands-off/682317/",
    "timestamp": "2025-04-05T22:30:00Z"
  },
  {
    "title": "Thousands march in downtown San Diego for 'Hands Off' protest",
    "description": "The \"Hands Off\" protests rallied against the administration's spending cuts, mass layoffs and other policies.",
    "link": "https://www.kpbs.org/news/politics/2025/04/05/thousands-march-in-downtown-san-diego-for-hands-off-protest",
    "timestamp": "2025-04-05T22:29:05Z"
  },
  {
    "title": "Thousands in Milwaukee join nationwide 'Hands Off!' protests",
    "description": "Organizers said the protests are meant to highlight reproductive rights, voting access and other topics.",
    "link": "https://www.wisn.com/article/thousands-in-milwaukee-join-nationwide-hands-off-protests-against-trump-musk/64395971",
    "timestamp": "2025-04-05T22:28:34Z"
  }
]