[
  {
    "title": "Grapevine March 2, 2025: When orange replaced yellow",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/israel-news/article-844272",
    "timestamp": "2025-03-02T03:53:02Z"
  },
  {
    "title": "Nations fail to break deadlock on UN climate report timing",
    "description": "BANGKOK: Nations failed to break a deadlock over the timing of the UN's next blockbuster assessment of climate change science after a marathon meeting in China that US envoys skipped. At issue was whether the Intergovernmental Panel on Climate Change (IPCC), …",
    "link": "https://www.channelnewsasia.com/sustainability/nations-fail-break-deadlock-un-climate-report-timing-4970356",
    "timestamp": "2025-03-02T03:52:48Z"
  },
  {
    "title": "Mia Love is Dying",
    "description": "Former congresswoman Mia Love was diagnosed with glioblastoma, a type of brain cancer, in 2022, and she has been battling the disease ever since. Sadly, her daughter, Abigale, took to X on Saturday and announced that treatment is no longer working, the cancer…",
    "link": "https://freerepublic.com/focus/f-chat/4301455/posts",
    "timestamp": "2025-03-02T03:52:46Z"
  },
  {
    "title": "US to deploy 3,000 more troops to southern border",
    "description": "The US Northern Command said it was deploying more troops to the US border with Mexico to curb illegal immigration and the flow of drugs. President Trump has cracked down on immigration since assuming office in January.",
    "link": "https://www.dw.com/en/us-to-deploy-3000-more-troops-to-southern-border/a-71796438",
    "timestamp": "2025-03-02T03:49:00Z"
  },
  {
    "title": "Trump's effort to fire government watchdog 'unlawful', judge rules",
    "description": "President Donald Trump's effort to remove the head of a federal watchdog agency was \"unlawful,\" a federal judge in Washington, D.C., said Saturday.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trumps-effort-fire-government-watchdog-unlawful-judge-rules-rcna194371",
    "timestamp": "2025-03-02T03:39:27Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line",
    "description": "Demonstrators protested outside Tesla stores in the U.S. and Europe against CEO Elon Musk's support for President Trump's federal spending cuts. The protests aim to discourage purchases of Tesla vehicles and stocks. Some Tesla cars were vandalized amid concer…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/anti-doge-protests-at-tesla-stores-target-elon-musks-bottom-line/articleshow/118657898.cms",
    "timestamp": "2025-03-02T03:34:11Z"
  },
  {
    "title": "Trump’s clash with Zelenskyy leaves Moscow both thrilled and wary",
    "description": "Moscow is celebrating Trump’s shift away from unwavering U.S. support for Ukraine, but some in the Kremlin fear his unpredictability could create new risks.",
    "link": "https://www.japantimes.co.jp/news/2025/03/02/world/politics/russia-zelenskyy-oval-office/",
    "timestamp": "2025-03-02T03:33:00Z"
  },
  {
    "title": "Surprise surprise: Donald Trump was a frequent flier according to Epstein flight logs released by his own AG - NewsBreak",
    "description": "Surprise surprise: Donald Trump was a frequent flier according to Epstein flight logs released by his own AG - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3834235167939-surprise-surprise-donald-trump-was-a-frequent-flier-according-to-epstein-flight-logs-released-by-his-own-ag?_f=app_share&amp;pd=03tlSldI&amp;lang=en_US&amp;send_time=1740885881&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v3%2Cns_local_strategy_25q1_exp-v1%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v4&amp;s=i2",
    "timestamp": "2025-03-02T03:25:08Z"
  },
  {
    "title": "Trump’s tariff convulsions are wreaking havoc on tequila makers",
    "description": "US President Trump's fluctuating tariff threats have disrupted Mexico's tequila industry, causing inventory surges and deferred payments. Tequila producers, heavily reliant on the US market, face significant sales drops and operational challenges due to the l…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trumps-tariff-convulsions-are-wreaking-havoc-on-tequila-makers/articleshow/118657812.cms",
    "timestamp": "2025-03-02T03:22:28Z"
  },
  {
    "title": "Rob Manfred considering petition to remove Pete Rose from MLB’s ineligible list",
    "description": "MLB's controversial all-time hits king could have a shot at the Baseball Hall of Fame.",
    "link": "https://nypost.com/2025/03/01/sports/rob-manfred-considering-removing-pete-rose-from-mlbs-ineligible-list/",
    "timestamp": "2025-03-02T03:20:03Z"
  },
  {
    "title": "‘America is back in counterterrorism business’: Donald Trump rolls back Biden rules on drone strikes outside war zones",
    "description": "President Donald Trump has revoked Biden-era restrictions on drone strikes and commando raids outside traditional war zones, returning to his earlier, more flexible rules. This change allows commanders greater autonomy in targeting militants but raises concer…",
    "link": "https://economictimes.indiatimes.com/news/defence/america-is-back-in-the-business-of-counterterrorism-donald-trump-rolls-back-biden-rules-on-drone-strikes-outside-war-zones/articleshow/118657806.cms",
    "timestamp": "2025-03-02T03:19:52Z"
  },
  {
    "title": "US Spaceship Hours Away From Daring Moon Landing Attempt",
    "description": "Nicknamed &quot;Ghost Riders in the Sky,&quot; the mission comes just over a year after the first-ever commercial lunar landing and is part of a NASA partnership with industry to cut costs and support Artemis.",
    "link": "https://www.ndtv.com/world-news/firefly-aerospace-blue-ghost-mission-1-us-spaceship-hours-away-from-daring-moon-landing-attempt-near-mons-latreille-7827544",
    "timestamp": "2025-03-02T03:19:41Z"
  },
  {
    "title": "Rubio expedites delivery of $4 billion in military aid to Israel",
    "description": "WASHINGTON — U.S. Secretary of State Marco Rubio said on Saturday he had signed a declaration to expedite delivery of about $4 billion in military assistance to Israel.\n\n\nThe Trump administration, which took office on Jan. 20, has approved nearly $12 billion …",
    "link": "https://www.voanews.com/a/rubio-expedites-delivery-of-4-billion-in-military-aid-to-israel-/7994060.html",
    "timestamp": "2025-03-02T03:19:35Z"
  },
  {
    "title": "Trump USAID shutdown could spark a global humanitarian crisis",
    "description": "Trump’s move to dismantle USAID could reshape foreign aid, hurt US farmers, and empower rivals like China and Russia.",
    "link": "https://www.jpost.com/opinion/article-844246",
    "timestamp": "2025-03-02T03:15:15Z"
  },
  {
    "title": "Trump Signs Order to Designate English as Official Language of the U.S. - The New York Times",
    "description": "Trump Signs Order to Designate English as Official Language of the U.S.The New York Times Designating English as the Official Language of The United StatesThe White House Trump signs executive order making English the official language of the U.S.NPR Presiden…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176584695",
    "timestamp": "2025-03-02T03:12:39Z"
  },
  {
    "title": "Judge Says Trump Can’t Fire Independent Watchdog",
    "description": "“A federal judge on Saturday said President Donald Trump cannot summarily fire the head of an independent watchdog agency, setting up a likely Supreme Court battle over Trump’s sweeping attempt to reshape the federal workforce",
    "link": "https://politicalwire.com/2025/03/01/judge-says-trump-cant-fire-independent-watchdog/",
    "timestamp": "2025-03-02T03:06:30Z"
  },
  {
    "title": "Jon Jones' secret pre-fight ritual: How visualization gives him an edge",
    "description": "Being the greatest of all time requires more than just talent-it demands a mental edge. According to Joe Rogan, Jon Jones has mastered this advantage with a unique pre-fight ritual",
    "link": "https://www.marca.com/en/ufc/2025/03/02/67c3b121e2704ee26b8b4574.html",
    "timestamp": "2025-03-02T03:05:49Z"
  },
  {
    "title": "Making English the official US language can’t erase the fact that the US has millions of Spanish speakers and a long multilingual history",
    "description": "Trump’s campaign produced campaign materials in Spanish to reach more voters. Now that he’s president, his White House is going English-only.",
    "link": "https://theconversation.com/making-english-the-official-us-language-cant-erase-the-fact-that-the-us-has-millions-of-spanish-speakers-and-a-long-multilingual-history-250030",
    "timestamp": "2025-03-02T03:04:24Z"
  },
  {
    "title": "Judge rules head of watchdog agency must keep his job, says Trump’s bid to oust him was unlawful",
    "description": "U.S. District Judge Amy Berman Jackson sided with Hampton Dellinger, who leads the Office of Special Counsel.",
    "link": "https://nypost.com/2025/03/01/us-news/head-of-watchdog-agency-must-keep-his-job-trumps-bid-to-rid-him-unlawful/",
    "timestamp": "2025-03-02T03:01:52Z"
  },
  {
    "title": "MLB commissioner Rob Manfred considering petition to reinstate Pete Rose, per report",
    "description": "Rose, who was placed on the permanently ineligible list in 1989 because of gambling, died in September of last year",
    "link": "https://www.cbssports.com/mlb/news/mlb-commissioner-rob-manfred-considering-petition-to-reinstate-pete-rose-per-report/",
    "timestamp": "2025-03-02T03:00:51Z"
  },
  {
    "title": "Ukraine signs £2.26 billion UK loan deal for weapons production after failed Trump talks",
    "description": "The United Kingdom has agreed to provide Ukraine with a £2.26 billion ($2.84 billion) loan to strengthen its defence capabilities. The loan, structured to be repaid using profits from immobilised Russian sovereign assets, was signed during a virtual ceremony …",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-secures-2-26-billion-uk-loan-for-weapons-production-after-failed-trump-talks/articleshow/118657629.cms",
    "timestamp": "2025-03-02T03:00:19Z"
  },
  {
    "title": "Examining claim Trump was recruited by KGB in 1987 and given codename 'Krasnov'",
    "description": "A former Kazakh security official's Facebook post started the rumor.",
    "link": "https://www.snopes.com//news/2025/03/02/trump-kgb-operative-krasnov/",
    "timestamp": "2025-03-02T03:00:00Z"
  },
  {
    "title": "Elon Musk's DOGE website lists Nashville's Social Security office among cuts",
    "description": "Elon Musk's efforts to slash federal spending may be taking aim at a Nashville office that serves thousands of retirees, people with disabilities and children who have lost parents.",
    "link": "https://www.newschannel5.com/news/newschannel-5-investigates/elon-musks-doge-website-lists-nashvilles-social-security-office-among-cuts",
    "timestamp": "2025-03-02T02:47:03Z"
  },
  {
    "title": "Judge rules head of watchdog agency must keep his job, says Trump's bid to oust him was unlawful",
    "description": "A federal judge has ruled that the head of a federal watchdog agency must remain in his job, saying President Donald Trump’s bid to remove the special counsel was unlawful",
    "link": "https://abcnews.go.com/US/wireStory/judge-rules-head-watchdog-agency-job-trumps-bid-119334838",
    "timestamp": "2025-03-02T02:46:25Z"
  },
  {
    "title": "Wayne Gretzky faces backlash in Canada over support for Donald Trump",
    "description": "Trump's provocative comments about making Canada the 51st U.S. state have raised tensions.",
    "link": "https://www.japantimes.co.jp/sports/2025/03/02/more-sports/wayne-gretzky-trump-support/",
    "timestamp": "2025-03-02T02:45:00Z"
  },
  {
    "title": "Judge rules head of watchdog agency must keep his job; says Trump's bid to oust him was unlawful",
    "description": "The head of a federal watchdog agency must remain in his job, a judge in Washington ruled on Saturday, saying President Donald Trump's bid to remove the special counsel was unlawful.  U.S. District Judge Amy Berman Jackson sided with Hampton Dellinger, who le…",
    "link": "https://japantoday.com/category/world/judge-rules-head-of-watchdog-agency-must-keep-his-job-says-trump%27s-bid-to-oust-him-was-unlawful",
    "timestamp": "2025-03-02T02:44:29Z"
  },
  {
    "title": "Trump designates English as only official US language",
    "description": "President Donald Trump has signed an executive order declaring English the only official language of the United States Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613564-trump-english-only-language/",
    "timestamp": "2025-03-02T02:43:22Z"
  },
  {
    "title": "Head of federal watchdog agency fired by Trump should remain on the job, judge rules | CNN Politics",
    "description": "A federal judge ruled Saturday that the head of a government watchdog agency whom President Donald Trump is attempting to fire is entitled to remain in the post, setting up a dispute that will almost certainly be decided by the Supreme Court.",
    "link": "https://www.cnn.com/2025/03/01/politics/federal-judge-watchdog-agency-dellinger-trump/index.html",
    "timestamp": "2025-03-02T02:43:00Z"
  },
  {
    "title": "Trump aims to increase domestic lumber, investigate imports",
    "description": "United States President Donald Trump signed two executive actions to increase domestic lumber production and investigate potential harm to national security posed by lumber imports.The order, which th...",
    "link": "https://biztoc.com/x/a777b3daad820ff1",
    "timestamp": "2025-03-02T02:42:58Z"
  },
  {
    "title": "Private US spaceship hours from Moon landing attempt",
    "description": "After a long journey through space, a US company is just hours away from attempting a daring lunar touchdown — its spacecraft poised to become only the second private lander to achieve the feat if it succeeds. Firefly Aerospace’s Blue Ghost Mission 1 is targe…",
    "link": "https://www.digitaljournal.com/world/private-us-spaceship-hours-from-moon-landing-attempt/article",
    "timestamp": "2025-03-02T02:42:35Z"
  },
  {
    "title": "Jamie Little's return to INDYCAR part of a busy year for FOX Sports announcer",
    "description": "Motorsports viewers might associate Jamie Little with FOX’s coverage of NASCAR’s Cup Series, but she'll be a fixture on FOX's INDYCAR coverage.",
    "link": "https://www.foxsports.com/stories/motor/jamie-littles-return-indycar-part-busy-year-fox-sports-announcer",
    "timestamp": "2025-03-02T02:41:31Z"
  },
  {
    "title": "Commissioner’s Office Considering Petition To Remove Pete Rose From Ineligible List",
    "description": "MLB Commissioner Rob Manfred is considering a petition filed by the family of Pete Rose to have Rose posthumously reinstated from the ineligible list, according to a report from Don Van Natta Jr. of ESPN. Rose passed away in September at the age of 83, and Va…",
    "link": "https://www.mlbtraderumors.com/2025/03/manfred-petition-rose-ineligible-list.html",
    "timestamp": "2025-03-02T02:37:11Z"
  },
  {
    "title": "Donald Trump to issue 'complete pardon' of former MLB great Pete Rose",
    "description": "Trump made the declaration late Friday on his Truth Social account. It wasn't exactly clear what the pardon would cover.",
    "link": "https://www.japantimes.co.jp/sports/2025/03/02/baseball/mlb/donald-trump-pardon-pete-rose/",
    "timestamp": "2025-03-02T02:37:00Z"
  },
  {
    "title": "Rubio signs declaration to expedite delivery of $4 billion in military aid to Israel",
    "description": "U.S. Secretary of State Marco Rubio has signed a declaration to expedite the delivery of approximately $4 billion in military aid to Israel. The Trump administration has approved nearly $12 billion in military sales to support Israel amid a fragile ceasefire …",
    "link": "https://economictimes.indiatimes.com/news/defence/rubio-signs-declaration-to-expedite-delivery-of-4-billion-in-military-aid-to-israel/articleshow/118657554.cms",
    "timestamp": "2025-03-02T02:34:25Z"
  },
  {
    "title": "Poll reveals public is split on whether Micheál Martin should criticise Donald Trump on US visit",
    "description": "The public is divided on whether the Taoiseach should make any criticism at all of US president Donald Trump when he holds his crucial first meeting with him in less than a fortnight.",
    "link": "https://www.independent.ie/irish-news/poll-reveals-public-is-split-on-whether-micheal-martin-should-criticise-donald-trump-on-us-visit/a1670230520.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "Fionnán Sheahan: Donald Trump’s World War III talk shows up parish-pump nature of Micheál Martin’s ‘Lowry lackeys’ row",
    "description": "A tough-talking leader riding roughshod over his opponents in his second term in office meets Donald Trump in 10 days’ time.",
    "link": "https://www.independent.ie/opinion/analysis/fionnan-sheahan-donald-trumps-world-war-iii-talk-shows-up-parish-pump-nature-of-micheal-martins-lowry-lackeys-row/a1138335139.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "The Sunday Independent’s view: Micheál Martin’s visit to the White House just got a lot trickier",
    "description": "For poet Seamus Heaney, peacemaking happens when “hope and history rhyme”. The scenes in the White House on Friday, when Donald Trump and his vice-president JD Vance publicly bullied and humiliated Ukraine’s Volodymyr Zelensky, could not have been farther fro…",
    "link": "https://www.independent.ie/opinion/editorial/the-sunday-independents-view-micheal-martins-visit-to-the-white-house-just-got-a-lot-trickier/a696803485.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "Letters: If only ‘falsehoods’ had been around when I was younger",
    "description": "Sir — I was interested to observe An Taoiseach trying to argue that he did not accuse Mary Lou of telling lies when he accused her of “ag insint breaga aris”, during Leader’s Questions recently.",
    "link": "https://www.independent.ie/opinion/letters/letters-if-only-falsehoods-had-been-around-when-i-was-younger/a1489689871.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "FDI chiefs look for help to reassure their nervous staff as Donald Trump threatens tariffs on European Union goods",
    "description": "Big multinational employers have warned local business representatives that their employees are nervous as US president Donald Trump threatens to impose tariffs on goods coming from the EU.",
    "link": "https://www.independent.ie/business/irish/fdi-chiefs-look-for-help-to-reassure-their-nervous-staff-as-donald-trump-threatens-tariffs-on-european-union-goods/a1735652653.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "Adrian Weckler: Despite Trump’s threats, to make money in Europe, you have to be in Europe. Steve Jobs knew that",
    "description": "Last week, Apple unveiled a $500bn investment plan for the US, including a new factory. Donald Trump was triumphant. But does that come at Cork’s expense?",
    "link": "https://www.independent.ie/business/technology/adrian-weckler-despite-trumps-threats-to-make-money-in-europe-you-have-to-be-in-europe-steve-jobs-knew-that/a90261365.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "Oval Office outburst: ‘The Europeans have their backs against the wall – will they rise to the occasion?’",
    "description": "For Kyiv’s European allies, the shouting match in the Oval Office has intensified the pressure to fill the gaps in US aid with their own weapons, and to face up to whether they can go it alone in arming Ukraine.",
    "link": "https://www.independent.ie/world-news/europe/oval-office-outburst-the-europeans-have-their-backs-against-the-wall-will-they-rise-to-the-occasion/a366443130.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "\"We Can Get Back At Elon\": Anti-DOGE Protests Hit Tesla Stores In US",
    "description": "The demonstrations are part of a growing backlash in North America and Europe to Musk&#039;s disruptive role in Washington.",
    "link": "https://www.ndtv.com/world-news/anti-doge-protests-hit-tesla-stores-in-us-we-can-get-back-at-elon-musk-donald-trump-government-7827377",
    "timestamp": "2025-03-02T02:27:00Z"
  },
  {
    "title": "Vance Family Moved to ‘Undisclosed Location’ After Pro-Ukrainian Protesters Disrupt Ski Trip",
    "description": "Vice President JD Vance and his family were moved to an “undisclosed location” after they were met with pro-Ukrainian protesters outside of a ski resort in Vermont. Protesters could be seen holding signs at Sugarbush Ski Resort that read “Vance is a traitor. …",
    "link": "https://freerepublic.com/focus/f-news/4301449/posts",
    "timestamp": "2025-03-02T02:25:36Z"
  },
  {
    "title": "Federal judge rules Trump’s firing of head of special counsel was unlawful, will maintain his job",
    "description": "Federal Judge Amy Berman Jackson ruled late Saturday evening that President Donald Trump's firing of the head of the Office of Special Counsel, Hampton Dellinger, was unlawful, keeping him in his post.",
    "link": "https://www.foxnews.com/politics/federal-judge-rules-trumps-firing-head-special-counsel-unlawful-maintain-his-job",
    "timestamp": "2025-03-02T02:15:47Z"
  },
  {
    "title": "Elon Musk Defends Nazi-Like Gesture: 'Meant In The Most Positive Spirit Possible'",
    "description": "Elon Musk addressed the public backlash he received after displaying a Nazi-like hand gesture at an inaugural celebration for President Donald Trump, defending himself by saying he is not a Nazi — while also making Nazi jokes.\n“It was obviously meant in the m…",
    "link": "https://biztoc.com/x/b0660bf003f7f71c",
    "timestamp": "2025-03-02T02:10:13Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line (Associated Press)",
    "description": "Associated Press:\nAnti-DOGE protests at Tesla stores target Elon Musk's bottom line  —  Demonstrators gathered outside Tesla stores across the U.S. Saturday to protest the automaker's billionaire CEO, Elon Musk, and his push to slash government spending on be…",
    "link": "https://www.memeorandum.com/250301/p86",
    "timestamp": "2025-03-02T02:10:01Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US",
    "description": "It rescinds a mandate from former President Bill Clinton that required the government and organizations that received federal funding to provide language assistance to non-English speakers.",
    "link": "https://www.wcvb.com/article/trump-signs-order-designating-english-as-the-official-language-of-the-us/63993724",
    "timestamp": "2025-03-02T02:07:43Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US - NewsBreak",
    "description": "President Donald Trump has signed an executive order declaring English the official language of the United States, reversing a policy from the Clinton adm",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?s=a2&share_destination_id=MTU2MzcwNDA2LTE3NDA4ODExMTA2MDQ%3D&pd=0Aa75Kiz&hl=en_US&send_time=1740881110&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.8.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v5%2Cns_foryou_model_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_blend_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v18",
    "timestamp": "2025-03-02T02:07:21Z"
  },
  {
    "title": "Trump signs executive order making English official language of US",
    "description": "President Donald Trump on Saturday signed an executive order making English the official language of the U.S.",
    "link": "https://www.foxnews.com/politics/trump-signs-executive-order-making-english-official-language-us",
    "timestamp": "2025-03-02T02:07:12Z"
  },
  {
    "title": "\"Can Freely Exchange Ideas\": Trump Makes English Official US Language",
    "description": "The White House published an executive order by Trump which says it is &quot;long past time&quot; that English is declared as the nation&#039;s official language.",
    "link": "https://www.ndtv.com/world-news/donald-trump-makes-english-official-us-language-can-freely-exchange-ideas-7827315",
    "timestamp": "2025-03-02T02:06:45Z"
  },
  {
    "title": "J.D. Vance Asked About Being 'Putin's Puppet' While Skiing in Vermont, On Video",
    "description": "J.D. Vance may have been hoping for a relaxing weekend of skiing up in Vermont ... but, instead he nearly got taken out by another skier -- and called \"Putin's puppet\" by someone else on the mountain. The vice president headed up to Sugarbush…",
    "link": "https://www.tmz.com/2025/03/01/j-d-vance-skiing-vermont-putin-puppet-video/",
    "timestamp": "2025-03-02T02:06:10Z"
  },
  {
    "title": "Norwegian fuel supplier refuses U.S. warships over Ukraine",
    "description": "Norwegian fuel company Haltbakk Bunkers has announced it will cease supplying fuel to U.S. military forces in Norway and American ships docking in Norwegian ports, citing dissatisfaction with recent U.S. policy towards Ukraine. In a strongly worded statement,…",
    "link": "https://freerepublic.com/focus/f-news/4301446/posts",
    "timestamp": "2025-03-02T02:04:19Z"
  },
  {
    "title": "Trump signs order designating English official US language",
    "description": "President Donald Trump signed on Saturday an executive order designating English as the official language of the United States.\n\n\nThe order allows government agencies and organizations that receive federal funding to choose whether to continue to offer docume…",
    "link": "https://www.voanews.com/a/trump-signs-order-designating-english-official-us-language/7994047.html",
    "timestamp": "2025-03-02T02:02:49Z"
  },
  {
    "title": "FBI Probing Biden’s $20 Billion Green Fund for Potential Fraud",
    "description": "Specifically, FBI agents reportedly interviewed EPA employees this week as part of an escalating investigation of the Greenhouse Gas Reduction Fund (GGRF), a $20 billion program that awarded billions of dollars to green groups loaded with Democrat donors and …",
    "link": "https://wattsupwiththat.com/2025/03/01/fbi-probing-bidens-20-billion-green-fund-for-potential-fraud/",
    "timestamp": "2025-03-02T02:00:00Z"
  },
  {
    "title": "Private US spaceship hours from Moon landing attempt",
    "description": "Firefly Aerospace's Blue Ghost Mission 1 is scheduled for a lunar landing attempt near Mons Latreille, marking only the second private lunar landing if successful. This mission, part of NASA's partnership to support the Artemis program, carries ten scientific…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/private-us-spaceship-hours-from-moon-landing-attempt/articleshow/118657376.cms",
    "timestamp": "2025-03-02T01:59:06Z"
  },
  {
    "title": "Israel agrees to Trump envoy’s temporary Gaza ceasefire extension proposal as first phase expires: reports",
    "description": "As the first phase of the temporary ceasefire in Gaza ends, the Israeli government said Saturday night it had agreed to a proposal by Trump envoy Steve Witkoff to extend it.",
    "link": "https://www.foxnews.com/world/israel-agrees-trump-envoys-gaza-ceasefire-proposal-first-phase-expires",
    "timestamp": "2025-03-02T01:57:29Z"
  },
  {
    "title": "'Total panic' as USAID cuts jobs from Syria to Haiti",
    "description": "In 2023, USAID spent $42 billion to support programs across 157 countries — ranging from malaria and HIV prevention to fighting starvation and helping those displaced by war.",
    "link": "https://www.japantimes.co.jp/news/2025/03/02/world/politics/usaid-jobs-syria-haiti/",
    "timestamp": "2025-03-02T01:57:00Z"
  },
  {
    "title": "Rubio announces $4B military aid to Israel, reversing Biden's arms hold",
    "description": "Secretary of State announces he has signed a declaration to use emergency authorities to expedite the delivery of approximately $4 billion in military assistance to Israel: Israel has no greater ally in the White House than President Trump.",
    "link": "https://www.israelnationalnews.com/news/404708",
    "timestamp": "2025-03-02T01:54:15Z"
  },
  {
    "title": "WWE Elimination Chamber: U.S. Anthem Treated Like a Heel by Toronto",
    "description": "Based on the opening of the WWE Elimination Chamber in Toronto, the biggest heel of tonight's PLE is Donald Trump – and the folks in attendance at the Rogers Centre in Toronto, Ontario, Canada, took out their anger over Trump's recent verbal and policy attack…",
    "link": "https://bleedingcool.com/tv/wwe-elimination-chamber-u-s-anthem-treated-like-a-heel-by-toronto/",
    "timestamp": "2025-03-02T01:54:08Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US - NewsBreak",
    "description": "President Donald Trump has signed an executive order declaring English the official language of the United States, reversing a policy from the Clinton adm",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?_f=app_share&pd=05axlBno&lang=en_US&send_time=1740880310&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v6%2Cns_foryou_model_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_blend_exp_25q1-v4%2Cns_local_strategy_25q1_exp-v5%2Cns_foryou_rank_exp_25q1-v7&s=i2",
    "timestamp": "2025-03-02T01:52:34Z"
  },
  {
    "title": "Judge rules head of watchdog agency must keep his job, says Donald Trump's bid to oust him was unlawful",
    "description": "A federal judge ruled that Hampton Dellinger must remain in his position as head of the Office of Special Counsel, stating that President Trump's attempt to remove him was unlawful. The decision underscores the importance of protecting the independence of the…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/judge-rules-head-of-watchdog-agency-must-keep-his-job-says-donald-trumps-bid-to-oust-him-was-unlawful/articleshow/118657348.cms",
    "timestamp": "2025-03-02T01:51:19Z"
  },
  {
    "title": "NATO chief says he told Volodymyr Zelenskyy to restore relationship with Donald Trump",
    "description": "NATO Secretary-General Mark Rutte advised Ukrainian President Volodymyr Zelenskyy to mend relations with US President Donald Trump, emphasizing the need for respect towards Trump's previous support for Ukraine, including the supply of Javelin missiles. Rutte …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/nato-chief-says-he-told-volodymyr-zelenskyy-to-restore-relationship-with-donald-trump/articleshow/118657342.cms",
    "timestamp": "2025-03-02T01:49:22Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US - NewsBreak",
    "description": "President Donald Trump has signed an executive order declaring English the official language of the United States, reversing a policy from the Clinton adm",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?_f=app_share&pd=01Fxa0rm&lang=en_US&send_time=1740880104&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v2%2Cns_local_strategy_25q1_exp-v13%2Cns_foryou_model_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-v7%2Cns_foryou_blend_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v4&s=i2",
    "timestamp": "2025-03-02T01:48:57Z"
  },
  {
    "title": "\"What Did You Do\": US Federal Workers Get 2nd Mail On Justifying Jobs",
    "description": "It came a week after Elon Musk engineered the first mass emailing to the federal government&#039;s two million employees, ordering them to justify their work or risk being fired.",
    "link": "https://www.ndtv.com/world-news/donald-trump-elon-musk-doge-us-federal-workers-get-2nd-mail-on-justifying-jobs-what-did-you-do-7827256",
    "timestamp": "2025-03-02T01:47:40Z"
  },
  {
    "title": "Judge Rules Head Of Watchdog Agency Must Keep His Job, Says Trump's Bid To Oust Him Was Unlawful",
    "description": "A federal judge has ruled that the head of a federal watchdog agency must remain in his job, saying President Donald Trump’s bid to remove the special counsel was unlawful.",
    "link": "https://www.huffpost.com/entry/us-trump-whistleblower-agency_n_67c3b749e4b035be7367ac78",
    "timestamp": "2025-03-02T01:43:43Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US",
    "description": "It rescinds a mandate from former President Bill Clinton that required the government and organizations that received federal funding to provide language assistance to non-English speakers.",
    "link": "https://www.ketv.com/article/trump-signs-order-designating-english-as-the-official-language-of-the-us/63993724",
    "timestamp": "2025-03-02T01:42:44Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US",
    "description": "It rescinds a mandate from former President Bill Clinton that required the government and organizations that received federal funding to provide language assistance to non-English speakers.",
    "link": "https://www.wlwt.com/article/trump-signs-order-designating-english-as-the-official-language-of-the-us/63993724",
    "timestamp": "2025-03-02T01:42:44Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US",
    "description": "It rescinds a mandate from former President Bill Clinton that required the government and organizations that received federal funding to provide language assistance to non-English speakers.",
    "link": "https://www.wtae.com/article/trump-signs-order-designating-english-as-the-official-language-of-the-us/63993724",
    "timestamp": "2025-03-02T01:42:32Z"
  },
  {
    "title": "Toronto fans boo US national anthem at WWE Elimination Chamber; Pat McAfee responds, calling Canada 'terrible'",
    "description": "Fans at WWE Elimination Chamber in Toronto booed \"The Star-Spangled Banner,\" prompting sports commentator Pat McAfee to condemn Canada.",
    "link": "https://www.foxnews.com/sports/toronto-wrestling-fans-boo-us-national-anthem-wwe-elimination-chamber",
    "timestamp": "2025-03-02T01:39:41Z"
  },
  {
    "title": "As Trump rises, Xi 'takes the temperature' of the US-Australia bond",
    "description": "As Donald Trump up-ends world order during his first few weeks in power, Xi Jinping is quietly testing the boundaries of this new reality, and the fallout could be felt in Ukraine, Taiwan and Australia.",
    "link": "https://www.abc.net.au/news/2025-03-02/china-russia-ukraine-new-relations-under-trump/104983738",
    "timestamp": "2025-03-02T01:37:12Z"
  },
  {
    "title": "Rubio signs declaration to expedite delivery of $4 billion in military aid to Israel",
    "description": "Rubio said he had used emergency authority to expedite the delivery of military assistance to Israel to its Middle East ally, now in a fragile ceasefire with Hamas militants in their war in Gaza.",
    "link": "https://www.jpost.com/breaking-news/article-844270",
    "timestamp": "2025-03-02T01:36:36Z"
  },
  {
    "title": "FIFA President Gianni Infantino leaves the door open for banned country’s return to the World Cup",
    "description": "While attending the annual IFAB meeting, FIFA President Gianni Infantino left the door open for a banned country to return to the World Cup.\n The 2026 FIFA World Cup will be the first to be hosted by three nations—the United States, Mexico, and Canada—marking…",
    "link": "https://worldsoccertalk.com/news/fifa-president-gianni-infantino-leaves-the-door-open-for-banned-countrys-return-to-the-world-cup/",
    "timestamp": "2025-03-02T01:32:21Z"
  },
  {
    "title": "Christian Birthright turns faith leaders into active Israel advocates",
    "description": "“The church can’t be silent. Today’s complacency is tomorrow’s captivity. What if today’s complacency is tomorrow’s Holocaust?”",
    "link": "https://www.jpost.com/opinion/article-844268",
    "timestamp": "2025-03-02T01:28:18Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line",
    "description": "Demonstrators have gathered outside Tesla stores across the U.S. to protest the automaker’s billionaire leader, Elon Musk.",
    "link": "https://www.wsls.com/news/politics/2025/03/02/anti-doge-protests-at-tesla-stores-target-elon-musks-bottom-line/",
    "timestamp": "2025-03-02T01:28:18Z"
  },
  {
    "title": "Zelensky’s Diplomatic Failure",
    "description": "Ukrainian President Volodymyr Zelensky did not “do his homework” when stepping foot into the Oval Office with President Trump and his Vice, JD Vance. What went wrong? As Ukrainian President Volodymyr Zelensky faced off against Donald Trump in the Oval Office,…",
    "link": "https://nationalinterest.org/blog/buzz/zelenskys-diplomatic-failure/",
    "timestamp": "2025-03-02T01:27:21Z"
  },
  {
    "title": "Europe's nightmare is here: They have to fight Putin without the U.S.",
    "description": "The European Union is aiming to follow up with an emergency package of €20 billion ($21 billion) in military aid for Ukraine at an emergency summit in Brussels.",
    "link": "https://www.japantimes.co.jp/news/2025/03/02/world/politics/europe-nightmare-putin-us/",
    "timestamp": "2025-03-02T01:27:00Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line",
    "description": "Demonstrators gathered outside Tesla stores across the U.S. Saturday to protest the automaker's billionaire CEO, Elon Musk.",
    "link": "https://www.detroitnews.com/story/business/2025/03/01/anti-doge-protests-at-tesla-stores-target-elon-musks-bottom-line/81003805007/",
    "timestamp": "2025-03-02T01:23:40Z"
  },
  {
    "title": "Israel Endorses Plan To Extend Gaza Ceasefire For Ramzan",
    "description": "The proposal, put forward by US President Donald Trump&#039;s Middle East envoy, would cover Ramzan, due to end late March, and Passover, lasting through mid-April.",
    "link": "https://www.ndtv.com/world-news/israel-hamas-war-ramzan-2025-israel-endorses-plan-to-extend-gaza-ceasefire-for-ramadan-as-first-phase-draws-to-close-7827183",
    "timestamp": "2025-03-02T01:21:07Z"
  },
  {
    "title": "Trump orders probe into US lumber imports",
    "description": "WASHINGTON — President Donald Trump on Saturday ordered a new trade investigation that could heap more tariffs on imported lumber, adding to existing duties on Canadian softwood lumber and 25% tariffs on all Canadian and Mexican goods set to take effect next …",
    "link": "https://www.voanews.com/a/trump-orders-new-tariff-probe-into-us-lumber-imports-/7994040.html",
    "timestamp": "2025-03-02T01:20:42Z"
  },
  {
    "title": "'What was he to do?' CNN host confronts GOP lawmaker over attacks on Ukrainian leader",
    "description": "Rep. Nicole Malliotakis (R-NY) was confronted on CNN on Saturday over her attacks on Ukrainian President Volodymyr Zelensky.\n\nMalliotakis appeared on MSNBC after the Oval Office blow-up during which Donald Trump and J.D. Vance yelled at Zelensky, and insisted…",
    "link": "https://www.rawstory.com/nicole-malliotakis-ukraine-smile/",
    "timestamp": "2025-03-02T01:15:37Z"
  },
  {
    "title": "In the US, DEI is under attack. But under a different name, it might live on",
    "description": "Donald Trump has promised to \"terminate\" diversity programmes. But a rebrand might yet save them.",
    "link": "https://www.bbc.com/news/articles/c24110m30ddo",
    "timestamp": "2025-03-02T01:13:19Z"
  },
  {
    "title": "Donald Trump signs executive order making English official language of US - NewsBreak",
    "description": "President Donald Trump has signed an executive order declaring English the official language of the United States, reversing a policy from the Clinton adm",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?_f=app_share&pd=0EHCFDV0&lang=en_US&send_time=1740881844&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v12%2Cns_push_exp_rt_bucketv12-control%2Cns_foryou_rank_exp_25q1-v7%2Cns_foryou_blend_exp_25q1-v4%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_model_exp_25q1-v6&s=i2",
    "timestamp": "2025-03-02T01:12:03Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US - NewsBreak",
    "description": "President Donald Trump has signed an executive order declaring English the official language of the United States, reversing a policy from the Clinton adm",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?s=a2&share_destination_id=NTU3NDI0MDMtMTc0MDg4MDM0NTI5NQ%3D%3D&pd=03lt91FD&hl=en_US&send_time=1740880345&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.3.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-control%2Cns_local_strategy_25q1_exp-v14%2Cns_foryou_model_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_recall_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v1",
    "timestamp": "2025-03-02T01:12:03Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US - NewsBreak",
    "description": "President Donald Trump signed on Saturday an executive order designating English as the official language of the United States. The order allows governmen",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?_f=app_share&pd=08aDdv4h&lang=en_US&send_time=1740882081&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_rank_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v14%2Cns_foryou_blend_exp_25q1-v3%2Cns_foryou_model_exp_25q1-control&s=i2",
    "timestamp": "2025-03-02T01:12:03Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US - NewsBreak",
    "description": "President Donald Trump has signed an executive order declaring English the official language of the United States, reversing a policy from the Clinton adm",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?_f=app_share&pd=0G4XHhEl&lang=en_US&send_time=1740880095&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-control%2Cns_foryou_model_exp_25q1-v5%2Cns_local_strategy_25q1_exp-v18%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v5&s=i2",
    "timestamp": "2025-03-02T01:12:03Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US - NewsBreak",
    "description": "President Donald Trump signed on Saturday an executive order designating English as the official language of the United States. The order allows governmen",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?_f=app_share&pd=045JnjgF&lang=en_US&send_time=1740880326&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v14%2Cns_foryou_blend_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v3%2Cns_foryou_rank_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v6%2Cns_foryou_model_exp_25q1-v8&s=i2",
    "timestamp": "2025-03-02T01:12:03Z"
  },
  {
    "title": "Donald Trump signs executive order making English official language of US - NewsBreak",
    "description": "President Donald Trump has signed an executive order declaring English the official language of the United States, reversing a policy from the Clinton adm",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?s=a2&share_destination_id=MjE3ODc5NzE5LTE3NDA4ODA3OTM5Nzg%3D&pd=0EkCT1Uw&hl=en_US&send_time=1740880793&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.8.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v6%2Cns_foryou_blend_exp_25q1-v4%2Cns_local_strategy_25q1_exp-v13%2Cns_foryou_rank_exp_25q1-v7%2Cns_push_exp_rt_bucketv12-v9",
    "timestamp": "2025-03-02T01:12:03Z"
  },
  {
    "title": "Most European leaders back Zelenskyy ahead of crisis talks in London",
    "description": "Zelenskyy arrived Saturday in London ahead of a summit to discuss Ukraine amid fallout from his meeting with Trump the prior day.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_3d83900d-6536-5786-8cec-331fde9d9e82.html",
    "timestamp": "2025-03-02T01:09:00Z"
  },
  {
    "title": "Most European leaders back Zelenskyy ahead of crisis talks in London",
    "description": "Zelenskyy arrived Saturday in London ahead of a summit to discuss Ukraine amid fallout from his meeting with Trump the prior day.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_620ea8f6-91fe-5b4f-8888-444575f6d250.html",
    "timestamp": "2025-03-02T01:09:00Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk’s bottom line",
    "description": "The demonstrations are part of a growing backlash in North America and Europe to Musk’s disruptive role in Washington.",
    "link": "https://nypost.com/2025/03/01/us-news/anti-doge-protests-at-tesla-stores-target-elon-musks-bottom-line/",
    "timestamp": "2025-03-02T01:05:20Z"
  },
  {
    "title": "Nothing has changed in US crypto banking since Trump returned: Caitlin Long",
    "description": "Despite the Trump administration being more crypto-friendly than its predecessor, it still hasn't addressed the issue of crypto debanking, Custodia Bank CEO Caitlin Long said.",
    "link": "https://cointelegraph.com/news/trump-administration-hasnt-addressed-crypto-debanking-issues",
    "timestamp": "2025-03-02T01:03:52Z"
  },
  {
    "title": "U.S.-UK Trade Agreement Has Big Pro-Growth Potential",
    "description": "A UK-U.S. trade agreement could point the way to making other major trading nations recognize the advantages of removing regulatory obstacles to trade liberalization.",
    "link": "https://www.forbes.com/sites/aldenabbott/2025/03/01/us-uk-trade-agreement-has-big-pro-growth-potential/",
    "timestamp": "2025-03-02T01:03:24Z"
  },
  {
    "title": "UK’s Starmer embraces Zelensky after Trump fiasco",
    "description": "British Prime Minister Keir Starmer has reassured Ukrainian leader Vladimir Zelensky of UK’s “unwavering support,” and promised a new loan Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613563-london-starmer-zelensky-loan/",
    "timestamp": "2025-03-02T01:03:16Z"
  },
  {
    "title": "People rally in Bentonville to support Ukraine",
    "description": "People gathered at the Bentonville Square on Saturday afternoon to make their voices heard.",
    "link": "https://www.4029tv.com/article/an-embarrassment-and-a-humiliation-people-rally-in-bentonville-to-support-ukraine/63993605",
    "timestamp": "2025-03-02T01:03:00Z"
  }
]