[
  {
    "title": "Scotiabank CEO Sees ‘Trump Doctrine’ as Positive for Growth",
    "description": "Bank of Nova Scotia’s international business could benefit from a rightward political shift in Latin America alongside rising US influence in the region, Chief Executive Officer Scott Thomson said.",
    "link": "https://www.livemint.com/companies/news/scotiabank-ceo-sees-trump-doctrine-as-positive-for-growth-11767729300151.html",
    "timestamp": "2026-01-06T19:54:59Z"
  },
  {
    "title": "Trump Announces California's Time Has Come - 'Fraud Investigation' Underway",
    "description": "As President Donald Trump cracks down on fraud in federally funded programs, he announces which state is next.",
    "link": "https://www.westernjournal.com/trump-announces-californias-time-come-fraud-investigation-underway/",
    "timestamp": "2026-01-06T19:53:56Z"
  },
  {
    "title": "Israel and Syria resume diplomatic dialogue after months of silence under US mediation",
    "description": "Israel and Syria reportedly resume diplomatic talks with U.S. backing under Trump's Middle East peace vision, focusing on border security and regional stability.",
    "link": "https://www.foxnews.com/world/israel-syria-resume-diplomatic-dialogue-after-months-silence-under-us-mediation",
    "timestamp": "2026-01-06T19:51:40Z"
  },
  {
    "title": "Scotiabank CEO Sees ‘Trump Doctrine’ as Positive for Growth",
    "description": "Bank of Nova Scotia’s international business could benefit from a rightward political shift in Latin America alongside rising US influence in the region, Chief Executive Officer Scott Thomson said.",
    "link": "https://financialpost.com/pmn/business-pmn/scotiabank-ceo-sees-trump-doctrine-as-positive-for-growth",
    "timestamp": "2026-01-06T19:50:49Z"
  },
  {
    "title": "Trump White House Publishes Government-Sanctioned Lies About January 6",
    "description": "The Trump White House published a false Jan 6 narrative on WhiteHouse.gov, replacing court records and video evidence with a state-approved rewrite of history.\nThe post Trump White House Publishes Government-Sanctioned Lies About January 6 first appeared on M…",
    "link": "https://www.mediaite.com/opinion/trump-white-house-publishes-government-sanctioned-lies-about-january-6/",
    "timestamp": "2026-01-06T19:49:51Z"
  },
  {
    "title": "Resolution to block Trump from invading Greenland introduced by Sen. Gallego",
    "description": "Concerns about U.S. action against Greenland have grown after the U.S. attack on Venezuela, which led to the capture of leader Nicolas Maduro.",
    "link": "https://www.cnbc.com/2026/01/06/trump-greenland-resolution-gallego-invading.html",
    "timestamp": "2026-01-06T19:49:46Z"
  },
  {
    "title": "US may intercept and seize oil tanker sailing near UK, reports say",
    "description": "US officials have a warrant to seize the Russian-flagged ship accused of breaking sanctions.",
    "link": "https://www.bbc.com/news/articles/c7v0deypjl4o",
    "timestamp": "2026-01-06T19:47:29Z"
  },
  {
    "title": "Pirro touts DC crime is being prosecuted 'like never before' in announcing year-end stats",
    "description": "U.S. Attorney Jeanine Pirro said Tuesday that under President Donald Trump's leadership, \"We have seen a renewed focus on cracking down on violent offenders.\"",
    "link": "https://www.foxnews.com/politics/pirro-touts-dc-crime-prosecuted-like-never-before-announcing-year-end-stats",
    "timestamp": "2026-01-06T19:47:09Z"
  },
  {
    "title": "Supreme Court Tariff Ruling Could Be Days Away",
    "description": "The Supreme Court has scheduled an opinion day for Friday (Jan. 9). And as Bloomberg News noted in a report Tuesday (Jan. 6), that’s a sign that a decision on White House tariffs could be coming soon. While the court never says what rulings are coming, the re…",
    "link": "https://www.pymnts.com/legal/2026/supreme-court-tariff-ruling-could-be-days-away/",
    "timestamp": "2026-01-06T19:46:47Z"
  },
  {
    "title": "Everything Trump’s Done to Take Over Greenland as His Obsession Grows",
    "description": "The White House triggered international alarm when it ordered U.S. troops to storm Venezuela and capture the country’s leader Nicolas Maduro. Donald Trump’s blatant violation of international law and order transformed his rhetoric, which was until Saturday bl…",
    "link": "https://newrepublic.com/post/204988/donald-trump-take-over-greenland-timeline",
    "timestamp": "2026-01-06T19:45:07Z"
  },
  {
    "title": "Trump calls for canceling the election and hints at a ‘Constitutional Movement’ ahead",
    "description": "Donald Trump has suggested cancelling the upcoming election. He spoke to House Republicans about his desire to run again. Trump acknowledged the Constitution prevents a third term but mused about a 'constitutional movement'. He also repeated claims the 2020 e…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-calls-for-canceling-the-election-and-hints-at-a-constitutional-movement-ahead/articleshow/126380441.cms",
    "timestamp": "2026-01-06T19:41:43Z"
  },
  {
    "title": "Jimmy Kimmel Says Trump Invaded Venezuela to Distract Us From Epstein Files: ‘What Is He Thinking?’ | Video",
    "description": "\"This is literally the plot of the movie 'Wag the Dog,'\" the late night ABC host notes\nThe post Jimmy Kimmel Says Trump Invaded Venezuela to Distract Us From Epstein Files: ‘What Is He Thinking?’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/jimmy-kimmel-trump-venezuela-epstein-files-distraction-video/",
    "timestamp": "2026-01-06T19:41:08Z"
  },
  {
    "title": "Ex-Husband of Trump Advisor Launches Congressional Bid on Anti-Trump Platform",
    "description": "Formerly married to Kellyanne Conway, a senior adviser to Trump's White House, George Conway announced on Tuesday that he will be running to replace Nadler.",
    "link": "https://www.ibtimes.com/ex-husband-trump-advisor-launches-congressional-bid-anti-trump-platform-3794524",
    "timestamp": "2026-01-06T19:40:49Z"
  },
  {
    "title": "‘That’s Gonna Be Your Issue’: Trump Gives House GOP Midterm Playbook",
    "description": "President Donald Trump told a gathering of House Republicans that healthcare should be their top issue as they begin campaigning for the 2026 midterm elections.... Read More\nThe post ‘That’s Gonna Be Your Issue’: Trump Gives House GOP Midterm Playbook appeare…",
    "link": "https://www.dailysignal.com/2026/01/06/thats-gonna-be-your-issue-trump-gives-house-gop-midterm-playbook/",
    "timestamp": "2026-01-06T19:39:18Z"
  },
  {
    "title": "Despite reality, GOP’s Tom Emmer touts Trump as ‘the president of peace’",
    "description": "On Saturday morning, as Americans learned that Donald Trump had deployed U.S. forces to bomb Venezuela and capture Nicolás Maduro, the president’s Republican allies in Congress did what they always do: They played the role of partisan cheerleaders.\nIn one esp…",
    "link": "https://biztoc.com/x/f707cc2d21b0499b",
    "timestamp": "2026-01-06T19:39:07Z"
  },
  {
    "title": "Maduro Could Have Avoided His Capture Entirely if He Had Checked This App",
    "description": "The bets on Maduro’s ouster should be treated like a five-alarm fire.",
    "link": "https://slate.com/technology/2026/01/maduro-prediction-market-polymarket-kalshi-app.html",
    "timestamp": "2026-01-06T19:39:00Z"
  },
  {
    "title": "The Tea, Spilled by Morning Joe: ‘We are going to keep the oil’",
    "description": "This is the Jan. 6, 2026, edition of “The Tea, Spilled by Morning Joe” newsletter. Subscribe here to get it delivered straight to your inbox Monday through Friday.\nDonald Trump was excited and proud yesterday when I spoke with him by phone to gain insight int…",
    "link": "https://biztoc.com/x/4cb6b938a30b94a6",
    "timestamp": "2026-01-06T19:38:31Z"
  },
  {
    "title": "CNN Never-Trumper Savages ‘Psychotic’ Stephen Miller Meltdown On Jake Tapper",
    "description": "Adam Kinzinger savaged Trump Deputy Chief of Staff for Policy Stephen Miller over his \"psychotic\" interview with Jake Tapper.\nThe post CNN Never-Trumper Savages ‘Psychotic’ Stephen Miller Meltdown On Jake Tapper first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/cnn-never-trumper-savages-psychotic-stephen-miller-meltdown-on-jake-tapper/",
    "timestamp": "2026-01-06T19:38:22Z"
  },
  {
    "title": "There’s 1 Former Capitol Police Officer Who Isn’t Finished With Donald Trump",
    "description": "The former police officer says the pursuit of accountability for Jan. 6 has evolved in the five years since the Capitol attack.",
    "link": "https://www.huffpost.com/entry/jan-6-accountability-harry-dunn_n_695d5c83e4b0b0e75cf0bb89",
    "timestamp": "2026-01-06T19:38:21Z"
  },
  {
    "title": "How Trump can get Greenland — without grabbing it by force",
    "description": "A lightly armed contingent of American crossing guards could probably take the Arctic island over in a couple of days — but the Greenland challenge is political and diplomatic, not military.",
    "link": "https://nypost.com/2026/01/06/opinion/how-trump-can-get-greenland-without-grabbing-it/",
    "timestamp": "2026-01-06T19:37:39Z"
  },
  {
    "title": "Georgia sets March 10 election to replace Marjorie Taylor Greene in Congress",
    "description": "Voters in northwest Georgia will head to the polls on March 10 to choose a successor to U.S. Rep. Marjorie Taylor Greene",
    "link": "https://abcnews.go.com/Politics/wireStory/georgia-sets-march-10-election-replace-marjorie-taylor-128955736",
    "timestamp": "2026-01-06T19:37:14Z"
  },
  {
    "title": "Trump set off a chain of events that will end in disaster",
    "description": "During rambling remarks on Jan. 3, President Donald Trump announced that the United States had bombed Venezuela, “captured” President Nicolás Maduro and his wife, and gained control of that country’s oil reserves.Now what? Trump has no idea, but historical pr…",
    "link": "https://www.rawstory.com/trump-venezuela-2674850312/",
    "timestamp": "2026-01-06T19:36:58Z"
  },
  {
    "title": "Iran protesters emboldened by Trump admin’s Persian messaging after Obama-Biden inaction, activists say",
    "description": "US shifts Iran policy as Trump administration revives aggressive messaging toward Tehran, contrasting sharply with previous diplomatic approaches.",
    "link": "https://www.foxnews.com/world/iran-protesters-emboldened-trump-admins-persian-messaging-after-obama-biden-inaction-activists-say",
    "timestamp": "2026-01-06T19:36:12Z"
  },
  {
    "title": "Special election set to replace Marjorie Taylor Greene in Congress",
    "description": "Gov. Brian Kemp has set a special election for Tuesday, March 10, 2026, to replace Marjorie Taylor Greene in Georgia’s 14th congressional district. On Nov. 21, 2025, Greene - who was elected to the northwest Georgia district in 2020 and overwhelmingly re-elec…",
    "link": "https://freerepublic.com/focus/f-gop/4360726/posts",
    "timestamp": "2026-01-06T19:34:10Z"
  },
  {
    "title": "Trump administration says there are ways US can lift Venezuelan oil output quickly",
    "description": "WASHINGTON/MIAMI, Jan 6 (Reuters) - The ‌Trump administration on Tuesday dismissed analysts' estimates that it would take years to ramp up Venezuela's crude production, saying there were ways ‌to quickly boost the country's oil sector. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/07/trump-administration-says-there-are-ways-us-can-lift-venezuelan-oil-output-quickly",
    "timestamp": "2026-01-06T19:34:00Z"
  },
  {
    "title": "Georgia sets March 10 election to replace Marjorie Taylor Greene in Congress",
    "description": "Greene resigned from Congress following a tumultuous five years.",
    "link": "https://www.bostonherald.com/2026/01/06/election-2026-georgia-house/",
    "timestamp": "2026-01-06T19:32:53Z"
  },
  {
    "title": "After Trump Snub, Machado Says She’d Share Nobel Peace Prize With Him",
    "description": "The Trump administration has provided vague details about its future plans in Venezuela.",
    "link": "https://truthout.org/articles/after-trump-snub-machado-says-shed-share-nobel-peace-prize-with-him/",
    "timestamp": "2026-01-06T19:31:56Z"
  },
  {
    "title": "Donald Trump Just Gave Democrats A Suuuuuper Smart Reason To Show Up In 2026",
    "description": "\"This is very motivating for voters. Just not in the way he thinks it is...\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/trump-impeach-comment",
    "timestamp": "2026-01-06T19:31:39Z"
  },
  {
    "title": "Harvard dean removed after anti-White, anti-police social media posts resurfaced",
    "description": "Gregory Davis, former Harvard Dunster House dean, no longer serves in role following revelation of posts calling police \"racist and evil\" and defending looting as democracy.",
    "link": "https://www.foxnews.com/us/harvard-dean-removed-after-anti-white-anti-police-social-media-posts-resurfaced",
    "timestamp": "2026-01-06T19:30:01Z"
  },
  {
    "title": "PM Modi ‘not that happy with me’ over high tariffs: Trump",
    "description": "Trump says PM Modi is unhappy over US tariffs imposed on India for Russian oil purchases, as Washington levies up to 50% duties and flags Apache delays.",
    "link": "https://www.thehindubusinessline.com/news/pm-modi-not-that-happy-with-me-over-high-tariffs-trump/article70479737.ece",
    "timestamp": "2026-01-06T19:29:14Z"
  },
  {
    "title": "Sebastian Stan May Be Joining THE BATMAN: PART II Opposite Robert Pattinson",
    "description": "Matt Reeves is continuing to quietly assemble an impressive cast for The Batman: Part II, and the latest name in the mix is a big one. After recently bringing Scarlett Johansson into the fold, the director now has his sights set on one of her longtime Marvel …",
    "link": "https://geektyrant.com/news/sebastian-stan-may-be-joining-the-batman-part-ii-opposite-robert-pattinson",
    "timestamp": "2026-01-06T19:28:00Z"
  },
  {
    "title": "Tim Walz Refuses To Resign As He Faces Major Backlash For Somali Scandal",
    "description": "Democratic Minnesota Gov. Tim Walz pledged to stand his ground while lawmakers are calling on him to resign over his handling of the Somali fraud scandal.",
    "link": "https://dailycaller.com/2026/01/06/tim-walz-resignation-calls-somali-fraud/",
    "timestamp": "2026-01-06T19:28:00Z"
  },
  {
    "title": "What’s Next for Venezuela After Maduro? One Expert Has Some Surprising Answers.",
    "description": "This isn’t the next Iraq War, he says, but there’s still plenty to be concerned about.",
    "link": "https://slate.com/news-and-politics/2026/01/venezuela-maduro-trump-kidnapping.html",
    "timestamp": "2026-01-06T19:25:59Z"
  },
  {
    "title": "CNN’s Harry Enten Says Support For Trump Admin Ousting Maduro Has Gone ‘Through The Roof’",
    "description": "'It's been a dramatic change'",
    "link": "https://dailycaller.com/2026/01/06/cnns-harry-enten-support-trump-admin-maduro/",
    "timestamp": "2026-01-06T19:25:30Z"
  },
  {
    "title": "Lt. Michael Byrd Who Shot Ashli Babbitt Dead on Jan. 6, 2021 in Cold Blood, Runs an ‘Unaccredited’ Day-Care Center in Maryland at His Home and Has Pocketed $190 Million in HHS Funds",
    "description": "In one of his autopen’s last acts before Joe Biden left office was to pardon Capt. Mike Byrd, the DC officer who shot and killed January 6 protester Ashli Babbitt in cold blood during the protests on Capitol Hill on January 6, 2021. As TGP’s Brian Lupo noted,…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360724/posts",
    "timestamp": "2026-01-06T19:23:34Z"
  },
  {
    "title": "Wisconsin health leaders balk at new US vaccine recommendations for children",
    "description": "Wisconsin health leaders say they are \"greatly concerned\" about the new vaccine guidelines released Monday by the federal government.",
    "link": "https://www.wpr.org/news/wisconsin-health-leaders-new-us-childhood-vaccine-recommendations",
    "timestamp": "2026-01-06T19:23:26Z"
  },
  {
    "title": "Defending A Dictator: Inside The Legal Team Representing Nicolás Maduro",
    "description": "Venezuelan dictator Nicolás Maduro and his wife, Cilia Flores, have hired the best lawyers an ousted dictatorial head of state can buy.",
    "link": "https://dailycaller.com/2026/01/06/nicolas-maduro-cilia-flores-lawyers-barry-pollack-mark-donnelly/",
    "timestamp": "2026-01-06T19:23:15Z"
  },
  {
    "title": "Trump to House Republicans: You Should 'Insist' on Voter ID",
    "description": "WASHINGTON–President Donald Trump pushed for voter identification legislation on Monday while speaking at a House Republican retreat at the Trump-Kennedy Center. \nThe post Trump to House Republicans: You Should ‘Insist’ on Voter ID appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/06/trump-to-house-republicans-you-should-insist-voter-id/",
    "timestamp": "2026-01-06T19:23:04Z"
  },
  {
    "title": "Israel, Syria agree to dedicated communication line in US-brokered talks",
    "description": "Joint mechanism will be used to de-escalate militarily, and may pave the road for an eventual security agreement.",
    "link": "https://www.aljazeera.com/news/2026/1/6/israel-syria-agree-to-dedicated-communication-line-in-us-brokered-talks",
    "timestamp": "2026-01-06T19:22:39Z"
  },
  {
    "title": "Trump Store in the Philly suburbs closing due to declining sales",
    "description": "Mike Domanico's store thrived during the Biden administration, but Trump's return to the White House has been bad for business.",
    "link": "https://www.inquirer.com/business/trump-store-bensalem-bucks-county-closing-20260106.html",
    "timestamp": "2026-01-06T19:22:38Z"
  },
  {
    "title": "'Everybody loses': MIT expert blasts Trump for creating a massive new 'mess'",
    "description": "The short-term plan Donald Trump has for Venezuela has been denounced as a \"mess\" by a climate expert. While the president has made it clear that oil is a leading factor in the U.S. strike on Venezuela, the administration may have trouble putting together its…",
    "link": "https://www.rawstory.com/trump-oil-2674852331/",
    "timestamp": "2026-01-06T19:22:33Z"
  },
  {
    "title": "The Erasure of January 6",
    "description": "A version of the below article first appeared in David Corn’s newsletter, Our Land. The newsletter comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture. Subscribing costs just $5 a mo…",
    "link": "https://www.motherjones.com/politics/2026/01/january-6-5th-anniversary-capitol-mob-trump-orwell/",
    "timestamp": "2026-01-06T19:22:07Z"
  },
  {
    "title": "Satellite image taken after US strikes in Venezuela shows damage beyond a key military base. There are scars at an airport too.",
    "description": "Craters and damage are visible in a Saturday image taken of the Higuerote Airport on Venezuela's northern coast.",
    "link": "https://www.businessinsider.com/satellite-image-show-damage-at-airport-following-us-strikes-2026-1",
    "timestamp": "2026-01-06T19:20:17Z"
  },
  {
    "title": "Ukraine: Allies endorse 'robust' security guarantees",
    "description": "France's Emmanuel Macron said allies had agreed on \"robust\" security guarantees for Kyiv after an eventual ceasefire. That came as more than 30 allies met in Paris. Follow DW for the latest.",
    "link": "https://www.dw.com/en/ukraine-allies-endorse-robust-security-guarantees/live-75402633",
    "timestamp": "2026-01-06T19:20:00Z"
  },
  {
    "title": "Trump pushes back against Democrats' criticism of Maduro raid (Aamer Madhani/Associated Press)",
    "description": "Aamer Madhani / Associated Press:\nTrump pushes back against Democrats' criticism of Maduro raid  —  President Donald Trump on Tuesday pushed back against Democratic criticism of this weekend's military operation that led to the capture of Nicolás Maduro, noti…",
    "link": "https://www.memeorandum.com/260106/p106",
    "timestamp": "2026-01-06T19:20:00Z"
  },
  {
    "title": "Iran Security forces clash with protesters at Grand Bazaar, at least 36 killed in demonstrations",
    "description": "Security forces fired tear gas and dispersed demonstrators as the market shut down. The protests Tuesday come as Iran's rial currency fell to a record low.",
    "link": "https://www.pbs.org/newshour/world/iran-security-forces-clash-with-protesters-at-grand-bazaar-at-least-36-killed-in-demonstrations",
    "timestamp": "2026-01-06T19:19:53Z"
  },
  {
    "title": "Gavin Newsom Taunts Right-Wing Influencer Benny Johnson With ‘Grindr’ Jab",
    "description": "After right-wing influencer Benny Johnson announced he was heading to California, Governor Gavin Newsom's notorious X account had a comeback at the ready.\nThe post Gavin Newsom Taunts Right-Wing Influencer Benny Johnson With ‘Grindr’ Jab first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/gavin-newsom-taunts-right-wing-influencer-benny-johnson-with-grindr-jab/",
    "timestamp": "2026-01-06T19:18:52Z"
  },
  {
    "title": "China's Foreign Ministry Demands Maduro's Immediate Release, Rips 'So-Called' Trial",
    "description": "A spokesperson for China's Foreign Ministry on Tuesday demanded the immediate release of Venezuelan President Nicolás Maduro and his wife from US custody and condemned the Trump administration's trampling of international law.\"The US disregards President Madu…",
    "link": "https://www.commondreams.org/news/china-us-venezuela",
    "timestamp": "2026-01-06T19:17:51Z"
  },
  {
    "title": "Greenland’s melting ice and landslide-prone fjords make the oil and minerals Trump is eyeing dangerous to extract",
    "description": "Melting ice, thawing permafrost and crumbling fjord walls are just a few of the risks climate change poses for those living and working in Greenland.",
    "link": "https://www.yahoo.com/news/articles/greenland-melting-ice-landslide-prone-191732079.html",
    "timestamp": "2026-01-06T19:17:32Z"
  },
  {
    "title": "Federal Red Tape Plunges Under Trump",
    "description": "Trump carried over a deregulatory agenda from his first term. Unfortunately, he has also continued a taste for unilateral action.",
    "link": "https://reason.com/2026/01/07/federal-red-tape-plunges-under-trump/",
    "timestamp": "2026-01-06T19:16:39Z"
  },
  {
    "title": "Trump: Is Greenland next? | The Latest",
    "description": "After the removal of Venezuela’s president, Nicolás Maduro, there are fears Donald Trump could turn his sights to Greenland, after he renewed his calls for the US to take control of the semi-autonomous Danish territory. While European leaders convened in Pari…",
    "link": "https://biztoc.com/x/038d36c1236285dc",
    "timestamp": "2026-01-06T19:16:27Z"
  },
  {
    "title": "Key Elements of the 2026 National Defense Authorization Act",
    "description": "On Dec. 18, President Donald Trump signed the National Defense Authorization Act (NDAA) for Fiscal Year 2026, authorizing approximately $900 billion in spending. The expansive bill covers many topics, including lifting sanctions on Syria, approving important …",
    "link": "https://warontherocks.com/2026/01/key-elements-of-the-2026-national-defense-authorization-act/",
    "timestamp": "2026-01-06T19:15:42Z"
  },
  {
    "title": "Trump predicts he will be impeached if Republicans do not win in the midterms (Megan Lebowitz/NBC News)",
    "description": "Megan Lebowitz / NBC News:\nTrump predicts he will be impeached if Republicans do not win in the midterms  —  If Republicans aren't victorious, “I'll get impeached,” Trump said.  — Add NBC News to Google  —  WASHINGTON — President Donald Trump had a warning fo…",
    "link": "https://www.memeorandum.com/260106/p104",
    "timestamp": "2026-01-06T19:15:00Z"
  },
  {
    "title": "Walz refuses to quit after dropping re-election bid amid Minnesota fraud firestorm: 'Over my dead body'",
    "description": "Embattled Democrat ended re-election bid but vows to stay in office as Amy Klobuchar considers gubernatorial campaign.",
    "link": "https://www.foxnews.com/politics/walz-refuses-quit-after-dropping-re-election-bid-amid-minnesota-fraud-firestorm-over-my-dead-body",
    "timestamp": "2026-01-06T19:14:40Z"
  },
  {
    "title": "Trump Mobile's phone nowhere to be found",
    "description": "A golden phone that President Donald Trump’s family business promised to release last year remains mysteriously under wraps as the technology industry serves up a gluttony of new gadgets in Las Vegas this week",
    "link": "https://www.wpxi.com/news/business/trump-mobiles-golden/DC5ZPRRL442FBEZZX3EE3MOBNE/",
    "timestamp": "2026-01-06T19:14:06Z"
  },
  {
    "title": "Trump Successfully Murders U.S. Public Media",
    "description": "Donald Trump and his authoritarian friends have successfully destroyed the Corporation for Public Broadcasting (CPB), the closest this country has gotten to having a useful and effective publicly-funded media. The CPB this week voted to officially shut down, …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180529117",
    "timestamp": "2026-01-06T19:12:33Z"
  },
  {
    "title": "Prediction markets show rising odds Trump seizes Panama Canal, moves on Greenland",
    "description": "Prediction market traders raised their bets that more international shakeups may be coming.",
    "link": "https://www.cnbc.com/2026/01/06/prediction-markets-trump-panama-greenland-iran.html",
    "timestamp": "2026-01-06T19:10:31Z"
  },
  {
    "title": "US crypto market structure bill could be delayed until 2027: Report",
    "description": "The midterm elections in November could cause some Senate Democrats to withhold support for the Responsible Financial Innovation Act due to conflict of interest concerns.",
    "link": "https://cointelegraph.com/news/us-crypto-market-structure-bill-delayed",
    "timestamp": "2026-01-06T19:09:27Z"
  },
  {
    "title": "Rep. Doug LaMalfa's Death at 65 Announced by Donald Trump",
    "description": "Doug LaMalfa, a California Republican who served in Congress for more than a decade, died Monday. The politician's death was announced by President Donald Trump during a gathering of House Republicans at the Kennedy Center Tuesday. POTUS said he…\n Permalink",
    "link": "https://www.tmz.com/2026/01/06/republican-representative-doug-lamalfa-dead/",
    "timestamp": "2026-01-06T19:09:26Z"
  },
  {
    "title": "Trump Successfully Murders U.S. Public Media",
    "description": "Donald Trump and his authoritarian friends have successfully destroyed the Corporation for Public Broadcasting (CPB), the closest this country has gotten to having a useful and effective publicly-funded media. The CPB this week voted to officially shut down, …",
    "link": "https://www.techdirt.com/2026/01/06/trump-successfully-murders-u-s-public-media/",
    "timestamp": "2026-01-06T19:08:53Z"
  },
  {
    "title": "Trump tells Republicans to be 'flexible' on abortion restrictions to get a health care deal",
    "description": "President Donald Trump wants Republicans to get a deal on health care insurance assistance by being flexible on a long-standing budget policy that bars federal money from being spent on abortion services. Trump made his request during a speech to House Republ…",
    "link": "https://www.kob.com/ap-top-news/ap-top-news-political/trump-tells-republicans-to-be-flexible-on-abortion-restrictions-to-get-a-health-care-deal/",
    "timestamp": "2026-01-06T19:08:15Z"
  },
  {
    "title": "Ray Dalio says AI is in ‘the early stages of a bubble,’ so watch out for 2026",
    "description": "After strong returns in U.S. markets last year, 2026 might be a different story.",
    "link": "https://fortune.com/2026/01/06/ray-dalio-says-ai-is-in-the-early-stages-of-a-bubble-so-watch-out-for-2026/",
    "timestamp": "2026-01-06T19:07:51Z"
  },
  {
    "title": "Donald Trump Is Channeling George W. Bush",
    "description": "Iraq showed that removing a dictator isn’t the same thing as overcoming a dictatorship.",
    "link": "http://foreignpolicy.com/2026/01/06/trump-venezuela-maduro-bush-iraq-saddam-military-war-victory/",
    "timestamp": "2026-01-06T19:07:29Z"
  },
  {
    "title": "Syria, Israel to form US-supervised joint group for intelligence sharing, de-escalation",
    "description": "Syria and Israel agree to a US-supervised joint group for intelligence sharing and military de-escalation, aiming for lasting security and stability.\n\nRead More: https://punchng.com/syria-israel-to-form-us-supervised-joint-group-for-intelligence-sharing-de-es…",
    "link": "https://punchng.com/syria-israel-to-form-us-supervised-joint-group-for-intelligence-sharing-de-escalation/",
    "timestamp": "2026-01-06T19:06:07Z"
  },
  {
    "title": "The Indo Daily: Venezuela, Cuba, Greenland – Is Donald Trump redrawing the map of global power?",
    "description": "When Trump issued his executive order renaming the Gulf of Mexico the “Gulf of America”, few could have imagined that the US president had much grander plans to reshape the map of geopolitical power.",
    "link": "https://www.independent.ie/podcasts/the-indo-daily/the-indo-daily-venezuela-cuba-greenland-is-donald-trump-redrawing-the-map-of-global-power/a924538316.html",
    "timestamp": "2026-01-06T19:05:42Z"
  },
  {
    "title": "Trump HHS slashes advised child vaccinations",
    "description": "What happened\nHealth Secretary Robert F. Kennedy Jr. Monday announced that the Centers for Disease Control and Prevention will now recommend that children get vaccinated against 11 communicable diseases, not 17. The decision, made by political appointees at t…",
    "link": "https://biztoc.com/x/a36ee9eeadd30152",
    "timestamp": "2026-01-06T19:05:33Z"
  },
  {
    "title": "U.S. Senate back to crypto talks as industry's make-or-break bill faces time crunch",
    "description": "Senators met to restart the high-stakes negotiation over the crypto market structure bill, and one of them reportedly said a markup is planned next week.",
    "link": "https://www.coindesk.com/policy/2026/01/06/u-s-senate-back-to-crypto-talks-as-industry-s-make-or-break-bill-faces-time-crunch",
    "timestamp": "2026-01-06T19:05:20Z"
  },
  {
    "title": "Dan Bongino Tears Into Matt Gaetz After Declaring War Against MAGA ‘Life-Losers’",
    "description": "“That’s right doggie, backpedal away. Good move. Now go blame the Jews for your dumbass tweet,” Bongino wrote to Gaetz.\nThe post Dan Bongino Tears Into Matt Gaetz After Declaring War Against MAGA ‘Life-Losers’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/dan-bongino-tears-into-matt-gaetz-after-declaring-war-against-maga-life-losers/",
    "timestamp": "2026-01-06T19:05:16Z"
  },
  {
    "title": "Trump Family Staying in Power: How One of The Don's Sons Could Completely Derail Veep JD Vance's 2028 Presidential Plans",
    "description": "A recent opinion poll revealed Donald Trump's eldest son gaining favorability for the 2028 Republican presidential nominee over the vice president.",
    "link": "https://radaronline.com/p/donald-trump-jr-could-derail-jd-vance-presidency-2028/",
    "timestamp": "2026-01-06T19:05:00Z"
  },
  {
    "title": "Even as Trump Suggests US Taxpayers May Foot the Bill, How Bullish Is Big Oil on Venezuela?",
    "description": "While President Donald Trump has openly stated that the US will seize Venezuela's oil in the wake of the US military's abduction of Venezuelan President Nicolás Maduro, there are questions about just how much interest big oil companies have in the president's…",
    "link": "https://www.commondreams.org/news/trump-venezuela-oil-companies",
    "timestamp": "2026-01-06T19:04:00Z"
  },
  {
    "title": "Turkey's Erdogan Tells Trump Violating Sovereignty Risks 'Serious Global Complications' After Maduro's Capture",
    "description": "Turkish President Recep Tayyip Erdogan said he warned U.S. counterpart Donald Trump against actions that violate national sovereignty.",
    "link": "https://www.ibtimes.com/turkeys-erdogan-tells-trump-violating-sovereignty-risks-serious-global-complications-after-3794522",
    "timestamp": "2026-01-06T19:03:32Z"
  },
  {
    "title": "More than 2M Epstein files still unpublished, DOJ confirms",
    "description": "The DOJ reveals over 2 million Epstein-related files are still under review, with under 1% released more than two weeks after December deadline passed.",
    "link": "https://www.foxnews.com/politics/more-than-2m-epstein-files-still-unpublished-doj-confirms",
    "timestamp": "2026-01-06T19:03:23Z"
  },
  {
    "title": "Greenland says island not for sale as Denmark seeks US talks",
    "description": "Greenland and Denmark reaffirm the island is not for sale after renewed claims by Donald Trump, seeking diplomatic talks with the US to resolve the issue.\n\nRead More: https://punchng.com/greenland-says-island-not-for-sale-as-denmark-seeks-us-talks/",
    "link": "https://punchng.com/greenland-says-island-not-for-sale-as-denmark-seeks-us-talks/",
    "timestamp": "2026-01-06T19:02:57Z"
  },
  {
    "title": "Trump says he would be impeached if Republicans lose Congress in midterms",
    "description": "US president predicts 'epic' victory for his party in the November vote that will determine control of House and Senate.",
    "link": "https://www.aljazeera.com/news/2026/1/6/trump-says-he-would-be-impeached-if-republicans-lose-congress-in-midterms",
    "timestamp": "2026-01-06T19:01:45Z"
  },
  {
    "title": "Trump Targets California In Fraud Probe And Newsom Claims He Welcomes Investigation",
    "description": "Newsom said President Donald Trump and his administration should go ahead with their investigations into fraud and wasteful spending in his state.",
    "link": "https://dailycaller.com/2026/01/06/newsom-trump-california-fraud-investigation/",
    "timestamp": "2026-01-06T19:00:38Z"
  },
  {
    "title": "Mexico risks Trump's ire with Cuban oil shipments (Jude Webber/Financial Times)",
    "description": "Jude Webber / Financial Times:\nMexico risks Trump's ire with Cuban oil shipments  —  US President Donald Trump threatens Mexico and says Cuban regime will fall after capture of Venezuela's Nicolás Maduro  —  Mexico overtook Venezuela to become Cuba's top oil …",
    "link": "https://www.memeorandum.com/260106/p101",
    "timestamp": "2026-01-06T19:00:22Z"
  },
  {
    "title": "The Russian Roots of Trump's Venezuela and Greenland Operations (Dave Troy/America 2.0)",
    "description": "Dave Troy / America 2.0:\nThe Russian Roots of Trump's Venezuela and Greenland Operations  —  An investigation by America 2.0 has revealed that Vladimir Putin has been attempting to influence Donald Trump to seize both Venezuela and Greenland since at least 20…",
    "link": "https://www.memeorandum.com/260106/p100",
    "timestamp": "2026-01-06T19:00:22Z"
  },
  {
    "title": "The Antidote to Fear is Courage",
    "description": "Why we have to be louder and bolder about being against fascism.",
    "link": "https://inthesetimes.com/article/antidote-to-fear-is-courage-fascism-antifa-trump",
    "timestamp": "2026-01-06T19:00:00Z"
  },
  {
    "title": "At Turning Point USA, JD Vance Picks Up Where Charlie Kirk Left Off",
    "description": "Vice President JD Vance gave the closing keynote speech at Turning Point USA’s AmericaFest 2025 conference in Phoenix on Dec. 21. It was the first TP gathering since the right-wing organization’s co-founder, Charlie Kirk, was assassinated in September, and th…",
    "link": "https://msmagazine.com/2026/01/06/turning-point-usa-charlie-kirk-jd-vance-speech-america/",
    "timestamp": "2026-01-06T18:59:58Z"
  },
  {
    "title": "CA Republican Congressman Doug LaMalfa dies at age 65",
    "description": "Rep. Doug LaMalfa, a fourth generation rice farmer and Republican who for the last 13 years represented much of California’s rural north in Congress, has died. He was 65. His sudden death, confirmed Tuesday morning by House Republican leadership, further shri…",
    "link": "https://freerepublic.com/focus/f-news/4360717/posts",
    "timestamp": "2026-01-06T18:59:35Z"
  },
  {
    "title": "Regime change means different things to different people. Either way, it hasn’t happened in Venezuela … yet",
    "description": "Talk of regime change brings up uncomfortable memories of the chaos after the overthrow of Iraq’s Saddam Hussein.",
    "link": "https://theconversation.com/regime-change-means-different-things-to-different-people-either-way-it-hasnt-happened-in-venezuela-yet-272697",
    "timestamp": "2026-01-06T18:57:32Z"
  },
  {
    "title": "'Way worse than Maduro': Venezuelans celebrate but the power struggle is just getting started",
    "description": "Venezuelans are celebrating what once felt impossible — but inside the country, armed powerbrokers, nervous officials and rival factions are already jostling over what comes next.",
    "link": "https://www.abc.net.au/news/2026-01-07/venezuela-hope-dreams-maduro-machado-voices-challenges/106202872",
    "timestamp": "2026-01-06T18:54:08Z"
  },
  {
    "title": "Trump tells Republicans to be 'flexible' on abortion restrictions to get a health care deal",
    "description": "President Donald Trump wants Republicans to get a deal on health care insurance assistance by being flexible on a long-standing amendment that bars federal money from being spent on abortion services",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-tells-republicans-flexible-abortion-restrictions-health-care-128953982",
    "timestamp": "2026-01-06T18:53:56Z"
  },
  {
    "title": "Newsom Taunts Trump Over His 'Shriveled Little Brain' After Health Confession",
    "description": "The California governor blasted Trump as a “deranged habitual liar whose relationship with reality ended years ago.”",
    "link": "https://www.thedailybeast.com/newsom-taunts-trump-over-his-shriveled-little-brain-after-health-confession/",
    "timestamp": "2026-01-06T18:53:12Z"
  },
  {
    "title": "Trump White House Launches Stunning January 6 Website Trashing ‘Violent’ Capitol Police",
    "description": "President Trump's White House launched a website dedicated to the January 6 Capitol Riot that said Dems \"staged the real insurrection\" and police made it worse\nThe post Trump White House Launches Stunning January 6 Website Trashing ‘Violent’ Capitol Police fi…",
    "link": "https://www.mediaite.com/politics/trump-white-house-launches-stunning-january-6-website-trashing-violent-capitol-police/",
    "timestamp": "2026-01-06T18:52:46Z"
  },
  {
    "title": "Venezuelan opposition leader Machado vows to return home",
    "description": "In her first interview since the ousting of president Nicolás Maduro, María Corina Machado also says she is confident she would win any election held in Venezuela.",
    "link": "https://www.abc.net.au/news/2026-01-07/maria-corina-machado-vows-to-return-to-venezuela/106205438",
    "timestamp": "2026-01-06T18:52:36Z"
  },
  {
    "title": "Trump In High-Speed Chase From International Cops After Breaking International Law",
    "description": "SOMEWHERE IN THE NEVADA DESERT — U.S. President Donald Trump was spotted fleeing from international cops in a high-speed chase after allegedly breaking international law again.",
    "link": "https://babylonbee.com/news/trump-in-high-speed-chase-from-international-cops-after-breaking-international-law",
    "timestamp": "2026-01-06T18:51:46Z"
  },
  {
    "title": "Bitfinex Hack Mastermind Behind $10 Billion Theft Gets Early Release",
    "description": "Ilya Lichtenstein, the man behind the massive 2016 Bitfinex Bitcoin theft, has been released early from prison. Read how the First Step Act and a trail of Walmart gift cards led to this major update in one of the world's largest crypto thefts.",
    "link": "https://hackread.com/bitfinex-hack-mastermind-gets-early-release/",
    "timestamp": "2026-01-06T18:51:19Z"
  },
  {
    "title": "European leaders push for ‘legally binding’ security guarantees in Ukraine peace deal",
    "description": "Meeting of pro-Kyiv coalition in Paris seeks US buy-in on plan to deter future Russia threats",
    "link": "https://www.irishtimes.com/world/europe/2026/01/06/european-leaders-push-for-legally-binding-security-guarantees-in-ukraine-peace-deal/",
    "timestamp": "2026-01-06T18:50:37Z"
  },
  {
    "title": "Five Years Ago, a Mob Tried to Take Over the Government. In 2026, It’s Clear They Won.",
    "description": "In their darkest, bat-ridden heart of hearts, Republicans have accepted the violence of January 6 as an effective long-term political strategy.",
    "link": "https://www.esquire.com/news-politics/politics/a69927196/january-6-five-year-anniversary/",
    "timestamp": "2026-01-06T18:50:00Z"
  },
  {
    "title": "Trump tells Republicans to be ‘flexible’ on abortion restrictions to get a health care deal",
    "description": "Trump tells Republicans to be ‘flexible’ on abortion restrictions to get a health care dealtwincities.com",
    "link": "https://www.twincities.com/2026/01/06/us-election-2026-trump-abortion/",
    "timestamp": "2026-01-06T18:49:45Z"
  },
  {
    "title": "Vivek Ramaswamy Rage Quits Social Media After Being Bullied For Being Indian",
    "description": "Vivek Ramaswamy announced in a Monday Wall Street Journal op-ed that he had quit Instagram and X after facing attacks for being Indian.",
    "link": "https://dailycaller.com/2026/01/06/vivek-ramaswamy-rage-quits-social-media-after-being-bullied-for-being-indian/",
    "timestamp": "2026-01-06T18:49:24Z"
  },
  {
    "title": "Béla Tarr, Hungarian director known for bleak and beautiful films, dies at 70",
    "description": "Celebrated Hungarian filmmaker Béla Tarr, known for films like \"Sátántangó\" and \"The Turin Horse,\" has died at 70.",
    "link": "https://www.pbs.org/newshour/arts/bela-tarr-hungarian-director-known-for-bleak-and-beautiful-films-dies-at-70",
    "timestamp": "2026-01-06T18:49:15Z"
  },
  {
    "title": "Three Cheers for Hilton Hotel Workers Who Banned ICE — Until Their Corporate Bosses Stomped Them Out",
    "description": "Big businesses will always side with fascistic powers-that-be, so we need to stand up for the workers who push back.\nThe post Three Cheers for Hilton Hotel Workers Who Banned ICE — Until Their Corporate Bosses Stomped Them Out appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/01/06/hilton-ban-ice-minneapolis-workers/",
    "timestamp": "2026-01-06T18:48:44Z"
  },
  {
    "title": "Trump says Democrats are 'meaner' than Republicans, warns of impeachment if GOP loses midterms",
    "description": "Trump warned Republicans that Democrats will pursue impeachment if they win midterm elections, calling their policies 'horrendous' during GOP retreat.",
    "link": "https://www.foxnews.com/politics/trump-says-democrats-meaner-than-republicans-warns-impeachment-gop-loses-midterms",
    "timestamp": "2026-01-06T18:47:49Z"
  },
  {
    "title": "LMAO, rappers are now showing up to the Somali Learing Center in Minneapolis",
    "description": " LMAO, rappers are now showing up to the Somali Learing Center in Minneapolis \"We got a concert for the kids, we finna turn up!\"  I'm sure the \"KIDS\" will appreciate it! All zero of them! Nick Shirley has started a MOVEMENT!",
    "link": "https://freerepublic.com/focus/f-news/4360715/posts",
    "timestamp": "2026-01-06T18:44:31Z"
  },
  {
    "title": "LMAO, rappers are now showing up to the Somali Learing Center in Minneapolis",
    "description": " LMAO, rappers are now showing up to the Somali Learing Center in Minneapolis \"We got a concert for the kids, we finna turn up!\"  I'm sure the \"KIDS\" will appreciate it! All zero of them! Nick Shirley has started a MOVEMENT!",
    "link": "https://freerepublic.com/focus/f-chat/4360715/posts",
    "timestamp": "2026-01-06T18:44:31Z"
  }
]