[
  {
    "title": "UK to expand submarine fleet as defence review calls for 'warfighting readiness'",
    "description": "LONDON (Reuters) -Britain will increase the size of its nuclear-powered attack submarine fleet, the government has announced ahead of a defence review expected to say the country must invest billions to be ready and equipped to fight a modern war. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/06/02/uk-to-expand-submarine-fleet-as-defence-review-calls-for-039warfighting-readiness039",
    "timestamp": "2025-06-01T21:48:00Z"
  },
  {
    "title": "Polish conservative Nawrocki leads presidential vote",
    "description": "WARSAW:  Eurosceptic Karol Nawrocki established a lead in Sunday's (May 1) presidential election in Poland, late exit polls showed, with the ballot seen as a test of the nation's support for a pro-European course versus Donald Trump-style nationalism. A late …",
    "link": "https://www.channelnewsasia.com/world/polish-conservative-karol-nawrocki-leads-presidential-vote-5162136",
    "timestamp": "2025-06-01T21:43:00Z"
  },
  {
    "title": "UK to build up to 12 new attack submarines",
    "description": "The defence review on Monday is expected to recommend the armed forces move to \"warfighting readiness\".",
    "link": "https://www.bbc.com/news/articles/c4g2jr1m49no",
    "timestamp": "2025-06-01T21:35:07Z"
  },
  {
    "title": "Oil under $65 a boon for consumers, but a burden on producers",
    "description": "U.S. President Donald Trump's tariffs, his call to &quot;drill baby drill&quot; and especially a decision by OPEC+ to hike crude output quotas have oil prices trading at lows not seen since the COVID pandemic. That is good news for consumers but not so much f…",
    "link": "https://japantoday.com/category/business/oil-under-65-a-boon-for-consumers-but-a-burden-on-producers",
    "timestamp": "2025-06-01T21:31:05Z"
  },
  {
    "title": "The UK seeks to send a message to Moscow as it outlines higher defense spending",
    "description": "The British government is about to outline the biggest increase in defense spending since the end of the Cold War as it seeks to send “a message to Moscow.”.",
    "link": "https://www.clickondetroit.com/business/2025/06/01/the-uk-seeks-to-send-a-message-to-moscow-as-it-outlines-higher-defense-spending/",
    "timestamp": "2025-06-01T21:30:35Z"
  },
  {
    "title": "The 2028 podcast primary is underway as Democrats try to reshape their image",
    "description": "Trump showed that Democratic candidates need to master the podcast space, which is typically looser than a news conference or traditional interview.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_bc07d932-f1cc-5c85-9c14-a665d740b9b7.html",
    "timestamp": "2025-06-01T21:30:00Z"
  },
  {
    "title": "Indigenous leader pulls out of B.C. trade mission to Asia over Bills 14, 15",
    "description": "B.C. Premier David Eby spoke to media a day after B.C. Assembly of First Nations Regional Chief Terry Teegee withdrew from the trade mission, citing criticism of Bills 14 and 15, two pieces of legislation aimed at speeding up certain projects.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/eby-trade-mission-terry-teegee-1.7549397",
    "timestamp": "2025-06-01T21:27:10Z"
  },
  {
    "title": "Traders shift to short-term tactics in response to tariffs — Web3 CEO",
    "description": "Traders are increasingly grabbing profits whenever and wherever they can instead of focusing on long-term strategies due to heightened economic uncertainty.",
    "link": "https://cointelegraph.com/news/traders-shift-short-term-tactics-response-tariffs",
    "timestamp": "2025-06-01T21:25:23Z"
  },
  {
    "title": "Bessent says Trump-Xi call would ease trade logjam — ‘I believe we will see something very soon’",
    "description": "A logjam in the trade talks between the United States and China could be broken once Presidents Donald Trump and Xi Jinping speak, US officials said Sunday — a conversation they said could happen soon.\nTrump on Friday accused Beijing of violating a deal reach…",
    "link": "https://biztoc.com/x/f4a1ce8f2f5014fe",
    "timestamp": "2025-06-01T21:24:46Z"
  },
  {
    "title": "U.S. asks Australia to increase defense spending to 3.5% of GDP",
    "description": "U.S. Defense Secretary Pete Hegseth asked Australia to increase its defense spending to 3.5% of gross domestic product during a meeting with Australian Defense Minister Richard Marles, the Pentagon said on Sunday. The defense chiefs also discussed security is…",
    "link": "https://japantoday.com/category/world/us-asks-australia-to-increase-defense-spending-to-3.5-of-gdp",
    "timestamp": "2025-06-01T21:21:51Z"
  },
  {
    "title": "DHS removes list of 'sanctuary' cities after sheriffs push back on non-compliant label",
    "description": "The U.S. Department of Homeland Security removed a list of &quot;sanctuary&quot; states, cities and counties from its website following sharp criticism from a sheriffs' association that said a list of &quot;non-compliant&quot; sheriffs could severely damage t…",
    "link": "https://japantoday.com/category/world/dhs-removes-list-of-%27sanctuary%27-cities-after-sheriffs-push-back-on-non-compliant-label",
    "timestamp": "2025-06-01T21:21:31Z"
  },
  {
    "title": "Poland's Trzaskowski on course for tight presidential election win",
    "description": "Liberal Warsaw Mayor Rafal Trzaskowski appeared set for a razor-thin win in Poland's presidential election on Sunday, an exit poll showed, in a vote seen as a test of the nation's support for a pro-European course versus Donald Trump-style nationalism. An exi…",
    "link": "https://japantoday.com/category/world/poland%27s-trzaskowski-on-course-for-tight-presidential-election-win1",
    "timestamp": "2025-06-01T21:21:12Z"
  },
  {
    "title": "“Bad Things” Happen in Washington. “Putin is Playing with Fire”, Philip Giraldi",
    "description": "There were quite a lot of what Donald Trump might describe as “bad things” taking place in Washington over the past week, to include the worsening of relations with China\nThe post “Bad Things” Happen in Washington. “Putin is Playing with Fire”, Philip Giraldi…",
    "link": "https://www.globalresearch.ca/bad-things-happen-washington/5889078",
    "timestamp": "2025-06-01T21:20:59Z"
  },
  {
    "title": "Over 30 killed near aid site in Gaza",
    "description": "More than 30 Palestinians were killed and dozens more injured on Sunday in southern Gaza near a humanitarian aid distribution site run by a U.S. company, according to local health officials. Witnesses said the Israeli military had opened fire as Palestinians …",
    "link": "https://japantoday.com/category/world/over-30-killed-near-aid-site-in-gaza-palestinian-health-authorities-say1",
    "timestamp": "2025-06-01T21:20:40Z"
  },
  {
    "title": "‘Ruination’: President Trump issues warning as radical judges threaten to block his tariffs",
    "description": "'That would allow other Countries to hold our Nation hostage'",
    "link": "https://www.wnd.com/2025/06/ruination-president-trump-issues-warning-as-radical-judges-threaten-to-block-his-tariffs/",
    "timestamp": "2025-06-01T21:17:18Z"
  },
  {
    "title": "Key climate target of airline decarbonization in peril: IATA",
    "description": "The airline industry's flagship goal of decarbonizing by 2050 is now &quot;in peril&quot; due to climate-skeptic policies, including those of U.S. President Donald Trump, the leading airline association IATA warned on Sunday. The emergence of leaders favoring…",
    "link": "https://japantoday.com/category/features/environment/key-climate-target-of-airline-decarbonisation-%27in-peril%27-iata",
    "timestamp": "2025-06-01T21:14:48Z"
  },
  {
    "title": "Boston Marathoner Kicked Off Team for Speaking Out About Transgender Issue",
    "description": "New mom and marathoner Natalie Daniels was booted from her running club for saying that people who identify as transgender should not compete against biological women in sports. When Daniels began training for the Boston Marathon just a few months postpartum,…",
    "link": "https://freerepublic.com/focus/f-bloggers/4320397/posts",
    "timestamp": "2025-06-01T21:11:37Z"
  },
  {
    "title": "Trump Delays Imposing Tariffs but EU Is Not in the Clear Yet",
    "description": "In February, Trump declared that trade between his country and the EU would drop significantly because the bloc had been “very unfair.”\nThe post Trump Delays Imposing Tariffs but EU Is Not in the Clear Yet appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/trump-delays-imposing-tariffs-eu-not-clear-yet/5889092",
    "timestamp": "2025-06-01T21:11:34Z"
  },
  {
    "title": "Elon Musk Sure Seems Happy to Be Fleeing DC",
    "description": "Elon Musk is leaving DC not with a bang but a whimper…and, it appears, with some new enemies in the White House. In an interview that aired Sunday on CBS, days after he announced he was departing DOGE, Musk insisted he has never been in lockstep with the Trum…",
    "link": "https://www.motherjones.com/politics/2025/06/elon-musk-sure-seems-happy-to-be-fleeing-dc/",
    "timestamp": "2025-06-01T21:09:07Z"
  },
  {
    "title": "Poland heading for political uncertainty after presidential election run-off",
    "description": "Pro-EU candidate had narrowest of leads after polls closed with 50.3 per cent",
    "link": "https://www.irishtimes.com/world/europe/2025/06/02/poland-heading-for-political-uncertainty-after-presidential-election-run-off/",
    "timestamp": "2025-06-01T21:06:06Z"
  },
  {
    "title": "The Irish Times view on Trump’s latest tariff move: this is how trade wars start",
    "description": "Brussels has held off from responding to the US president’s import duties so far - but may not do so for much longer",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/06/01/the-irish-times-view-on-trumps-latest-tariff-move-this-is-how-trade-wars-start/",
    "timestamp": "2025-06-01T21:05:00Z"
  },
  {
    "title": "‘Who Was Signing Those?’: Ex-WH Doctor Asks Who Was ‘In Charge’ During Biden Admin",
    "description": "Republican Texas Rep. Ronny Jackson said Sunday that Americans \"need to know\" if former President Joe Biden was really \"in charge\" during his White House term.",
    "link": "https://dailycaller.com/2025/06/01/ronny-jackson-biden-health-who-was-signing-those/",
    "timestamp": "2025-06-01T21:01:38Z"
  },
  {
    "title": "Reconciliation at Risk: 50 Years After the Vietnam War",
    "description": "April 30 marked 50 years since the fall of Saigon and the end of the Vietnam war. Vietnam’s closest partners, including China, Cambodia, and Laos, sent representatives to the commemorations held in Ho Chi Minh City, formerly Saigon. Notably missing from the m…",
    "link": "https://freerepublic.com/focus/f-chat/4320395/posts",
    "timestamp": "2025-06-01T21:00:42Z"
  },
  {
    "title": "Let's join the Santa Cruz Rebellion!",
    "description": "I want to move Santa Cruz to join the rebellion. Wanna come along?",
    "link": "https://www.bangkokpost.com/opinion/opinion/3039622/lets-join-the-santa-cruz-rebellion-",
    "timestamp": "2025-06-01T21:00:00Z"
  },
  {
    "title": "Many Trump Spending And Deregulatory Executive Orders Bypass DOGE",
    "description": "While Musk’s DOGE drew headlines, Trump’s broader deregulatory push is led by OMB and others also charged with cutting spending and slashing regulation.",
    "link": "https://www.forbes.com/sites/waynecrews/2025/06/01/many-trump-spending-and-deregulatory-executive-orders-bypass-doge/",
    "timestamp": "2025-06-01T20:58:27Z"
  },
  {
    "title": "UK gears up to combat Russian threat - but questions remain about funding for new spending",
    "description": "Sir Keir Starmer will pledge to buy more attack submarines and put the military on a war footing as part of a major defence review - but without making any new spending promises.",
    "link": "https://news.sky.com/story/strategic-defence-review-uk-gears-up-to-combat-russian-threat-but-questions-remain-about-funding-for-new-spending-13377981",
    "timestamp": "2025-06-01T20:57:00Z"
  },
  {
    "title": "Anthony Albanese comes out swinging against Trump’s increased steel tariffs",
    "description": "The prime minister has rebuked the US over its decision to double tariffs on steel and aluminium imports, and Ukraine has carried out a massive attack on Russian air bases.\nThe post Anthony Albanese comes out swinging against Trump’s increased steel tariffs a…",
    "link": "http://www.crikey.com.au/2025/06/02/anthony-albanese-donald-trump-tariffs-defence-russia-ukraine/",
    "timestamp": "2025-06-01T20:56:59Z"
  },
  {
    "title": "Miley Cyrus opens up about father Billy Ray Cyrus’ struggle with sobriety and their complex bond",
    "description": "Miley Cyrus opens up about her relationship with father Billy Ray Cyrus, discussing their family dynamics, sobriety and differing generational experiences.",
    "link": "https://www.foxnews.com/entertainment/miley-cyrus-opens-up-father-billy-ray-cyrus-struggle-sobriety-complex-bond",
    "timestamp": "2025-06-01T20:55:42Z"
  },
  {
    "title": "WATCH: Jasmine Crockett tries to describe Dem ‘playbook’ on the fly. It doesn’t go well",
    "description": "'I want to break it down into the simplest terms that I can, because some of this can be really, really complicated'",
    "link": "https://www.wnd.com/2025/06/watch-jasmine-crockett-tries-to-describe-dem-playbook-on-the-fly-it-doesnt-go-well/",
    "timestamp": "2025-06-01T20:53:23Z"
  },
  {
    "title": "Ukraine's audacious drone attack sends critical message to Russia - and the West",
    "description": "The BBC's Paul Adams reflects on the impact of Ukraine's major drone attack on Russian bombers.",
    "link": "https://www.bbc.co.uk/news/articles/c0r1jv0rn0ko",
    "timestamp": "2025-06-01T20:52:16Z"
  },
  {
    "title": "Ukraine's audacious drone attack sends critical message to Russia - and the West",
    "description": "The BBC's Paul Adams reflects on the impact of Ukraine's major drone attack on Russian bombers.",
    "link": "https://www.bbc.com/news/articles/c0r1jv0rn0ko",
    "timestamp": "2025-06-01T20:52:16Z"
  },
  {
    "title": "Polish presidential election too close to call, exit poll suggests",
    "description": "Warsaw Mayor Rafal Trzaskowski claims early victory but his winning margin is well within margin of error, exit poll suggests.",
    "link": "https://www.bbc.com/news/articles/cx27897vedno",
    "timestamp": "2025-06-01T20:51:52Z"
  },
  {
    "title": "Wall Street sets Palantir stock price for next 12 months",
    "description": "While Palantir (NASDAQ: PLTR) is seeing a surge in government contracts, Wall Street analysts remain cautious.\nNotably, momentum in the stock accelerated after reports that President Donald Trump tapped Palantir to organize personal data for several federal a…",
    "link": "https://biztoc.com/x/607fa1c90b03b0af",
    "timestamp": "2025-06-01T20:51:12Z"
  },
  {
    "title": "The Irish Times view on financial regulation: time to spread the net",
    "description": "Proposed EU-wide stress tests of the funds sector are welcome in order to judge the extent of risk in this area",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/06/01/the-irish-times-view-on-financial-regulation-time-to-spread-the-net/",
    "timestamp": "2025-06-01T20:50:00Z"
  },
  {
    "title": "Senators warn: Putin ‘preparing for more war’",
    "description": "Russian President Vladimir Putin is stalling at the peace table while preparing a new military offensive in Ukraine, two senior U.S. senators warned Sunday, arguing that the next two weeks could shape the future of a war that has already smashed cities, displ…",
    "link": "https://www.bostonherald.com/2025/06/01/senators-warn-putin-preparing-for-more-war/",
    "timestamp": "2025-06-01T20:47:31Z"
  },
  {
    "title": "US can’t cut China off completely, but must defend AI and American innovation from nonstop theft: Sen Rounds",
    "description": "Sen. Mike Rounds discussed U.S. strategies to combat China's intellectual property theft and AI's role in maintaining economic leadership in exclusive interview with Fox Digital.",
    "link": "https://www.foxnews.com/politics/us-cant-cut-china-off-completely-must-defend-ai-american-innovation-from-nonstop-theft-sen-rounds",
    "timestamp": "2025-06-01T20:46:19Z"
  },
  {
    "title": "Canada scrambles to strike a deal as Ontario trade envoy races to stop Trump tariffs before G7 summit",
    "description": "Despite escalating trade tensions and recent tariff hikes, Ontario's trade representative remains optimistic about resolving disputes with the U.S. He emphasizes proactive engagement with Republican lawmakers and highlights Canada's importance as a key tradin…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/canada-scrambles-to-strike-a-deal-as-ontario-trade-envoy-races-to-stop-trump-tariffs-before-g7-summit/articleshow/121556200.cms",
    "timestamp": "2025-06-01T20:37:27Z"
  },
  {
    "title": "Virginia House Republicans pick Del. Terry Kilgore as new leader",
    "description": "The chamber's prior GOP leader, former House Speaker Todd Gilbert, R-Shenandoah, is a candidate to become the next U.S. attorney for the Western District of Virginia.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_c8f14c99-fe2b-41ad-8102-485a8425fad6.html",
    "timestamp": "2025-06-01T20:37:00Z"
  },
  {
    "title": "'Catastrophic': Trump is now going after 'the best idea we ever had'",
    "description": "President Donald Trump’s push to slash federal spending could have devastating consequences for America’s national parks, with proposed budget cuts threatening to gut the Park Service and dismantle protections for the country’s most treasured landscapes, the …",
    "link": "https://www.rawstory.com/catastrophic-trump-is-now-going-after-the-best-idea-we-ever-had/",
    "timestamp": "2025-06-01T20:31:06Z"
  },
  {
    "title": "After Todd And Julie Chrisley Were Pardoned, A Presidential Official Shared Some Advice For Them: ‘I Know That They’re Anxious To Get Out Here’",
    "description": "The Chrisleys are no longer behind bars.",
    "link": "https://www.cinemablend.com/television/after-todd-julie-chrisley-were-pardoned-presidential-official-shared-advice-for-them",
    "timestamp": "2025-06-01T20:19:24Z"
  },
  {
    "title": "Justice Department’s New White Collar Crime Priorities",
    "description": "The Justice Department issued its new policies for white collar crime which appear  to deprioritize enforcement of important white collar crime laws",
    "link": "https://www.forbes.com/sites/steveweisman/2025/06/01/justice-departments-new-white-collar-crime-priorities/",
    "timestamp": "2025-06-01T20:18:26Z"
  },
  {
    "title": "Trump Treasury Chief Claps Back at Brennan: ‘YOU Said There’d Be Big Inflation – There Hasn’t Been’",
    "description": "Scott Bessent clapped back at Margaret Brennan on Sunday over inflation, as they each brought up comments made by the other in a previous Sunday morning battle.\nThe post Trump Treasury Chief Claps Back at Brennan: ‘YOU Said There’d Be Big Inflation – There Ha…",
    "link": "https://www.mediaite.com/media/tv/trump-treasury-chief-claps-back-at-brennan-you-said-thered-be-big-inflation-there-hasnt-been/",
    "timestamp": "2025-06-01T20:18:17Z"
  },
  {
    "title": "Mike Lindell Floats Bringing a MyPillow to His Dominion Trial After a Lawyer Called Them ‘Lumpy’",
    "description": "During an interview with Steve Bannon over the weekend, Lindell said one of Dominion's attorneys previously called his pillows \"lumpy.\"\nThe post Mike Lindell Floats Bringing a MyPillow to His Dominion Trial After a Lawyer Called Them ‘Lumpy’ first appeared on…",
    "link": "https://www.mediaite.com/media/news/mike-lindell-floats-bringing-a-mypillow-to-his-dominion-trial-after-a-lawyer-called-them-lumpy/",
    "timestamp": "2025-06-01T20:18:08Z"
  },
  {
    "title": "Trump 'flew too close to the sun' and unwittingly made a resistance 'hero': host",
    "description": "Donald Trump may have inadvertently created a resistance \"hero\" with his latest actions.That's the opinion of journalist Antonia Hylton, who co-hosts MSNBC's The Weekend: Primetime. On their show Saturday night, Hylton highlighted Trump's war against Harvard.…",
    "link": "https://www.rawstory.com/trump-flew-close-sun-hero/",
    "timestamp": "2025-06-01T20:15:11Z"
  },
  {
    "title": "Stephanopoulos Accuses Trump of ‘Staggering’ Corruption",
    "description": "George Stephanopoulos opened his Sunday show with a scathing accusation of corruption by Donald Trump and his family – just six months after ABC agreed to a $16 million payment to settle a defamation lawsuit",
    "link": "https://politicalwire.com/2025/06/01/stephanopoulos-accuses-trump-of-staggering-corruption/",
    "timestamp": "2025-06-01T20:13:14Z"
  },
  {
    "title": "Trump Celebrates 101 Years of the Border Patrol: 'Guardians of Our Sovereignty'",
    "description": "\"Every day, Border Patrol agents selflessly risk their lives to repel the flow of deadly drugs, weapons, criminals, and terrorists ...\"",
    "link": "https://www.westernjournal.com/trump-celebrates-101-years-border-patrol-guardians-sovereignty/",
    "timestamp": "2025-06-01T20:08:43Z"
  },
  {
    "title": "Todd Chrisley's Daughter Lindsie Shares Post About 'The Story of the Lord'",
    "description": "Lindsie Chrisley shared a subtle quote after her father, Todd Chrisley, was released from prison after receiving a presidential pardon. “See the story of the Lord unfolding,” an anonymous quote read, which Lindsie, 35, shared via her Instagram Story on Sunday…",
    "link": "https://www.usmagazine.com/celebrity-news/news/lindsie-chrisley-shares-spiritual-quote-after-todds-prison-release/#article",
    "timestamp": "2025-06-01T20:03:04Z"
  },
  {
    "title": "Variety report claims 'The Boys' and 'Handmaid's Tale' imaginary fascist worlds are becoming reality",
    "description": "Variety's Michael Schneider argued the imaginary fascist worlds of \"The Boys\" and \"The Handmaid's Tale\" are becoming reality in an article published by the outlet on Friday.",
    "link": "https://www.foxnews.com/media/variety-report-claims-the-boys-handmaids-tale-imaginary-fascist-worlds-becoming-reality",
    "timestamp": "2025-06-01T20:00:31Z"
  },
  {
    "title": "5 Years After the Floyd Riots, the Left’s Thirst for Political Violence Has Not Quenched",
    "description": "Five years after the death of George Floyd, the political Left is increasingly embracing violence as legitimate action, aided and abetted by soft-on-crime forces funded... Read More\nThe post 5 Years After the Floyd Riots, the Left’s Thirst for Political Viole…",
    "link": "https://www.dailysignal.com/2025/06/01/five-years-after-floyd-riots-lefts-thirst-for-political-violence-has-not-quenched/",
    "timestamp": "2025-06-01T20:00:00Z"
  },
  {
    "title": "Brewing tariff court battles won’t spike White House leverage in trade talks, Lutnick says - Politico",
    "description": "Brewing tariff court battles won’t spike White House leverage in trade talks, Lutnick saysPolitico Trump Administration: Latest News and Live UpdatesThe New York Times How a small wine company complicated Trump’s sweeping tariff plansThe Washington Post Will …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177894545",
    "timestamp": "2025-06-01T19:55:02Z"
  },
  {
    "title": "50 Cent claims he will personally intervene with Trump to stop any pardon of Diddy",
    "description": "‘He said some really bad things about Trump,’ the rapper said of Diddy",
    "link": "https://www.the-independent.com/news/world/americas/crime/50-cent-diddy-trump-pardon-b2761630.html",
    "timestamp": "2025-06-01T19:52:00Z"
  },
  {
    "title": "Three years into his war on Ukraine, what does Putin really want?",
    "description": "President Trump wants to make a deal with Vladimir Putin to end the war in Ukraine. Putin says Russia wants to engage in peace talks, but Putin has also been ordering the most widespread and violent aerial attacks on Ukraine in years. This has led Trump to cr…",
    "link": "https://www.npr.org/2025/06/01/1253506257/three-years-into-his-war-on-ukraine-what-does-putin-really-want",
    "timestamp": "2025-06-01T19:50:36Z"
  },
  {
    "title": "Jeffries, Hochul rage at Trump after Nadler’s aide nabbed by DHS agents: ‘Clearly trying to intimidate’",
    "description": "House Minority Leader Hakeem Jeffries accused the Trump administration of \"clearly trying to intimidate Democrats\" after federal agents handcuffed one of Rep. Jerry Nadler's aides in his Manhattan office.",
    "link": "https://nypost.com/2025/06/01/us-news/hakeem-jeffries-kathy-hochul-rage-at-trump-after-nadlers-aide-nabbed-by-dhs-agents-clearly-trying-to-intimidate/",
    "timestamp": "2025-06-01T19:50:30Z"
  },
  {
    "title": "Trump says courts threatening 'ruination of America' if they disagree with him",
    "description": "President Donald Trump warned that courts ruling against him could bring on the economic \"ruination of the United States.\"\n\nIn a Sunday post on his Truth Social platform, the president said that he did not expect the court to strip him of the power to impose …",
    "link": "https://www.rawstory.com/trump-ruination-of-america/",
    "timestamp": "2025-06-01T19:48:49Z"
  },
  {
    "title": "'I'm over knife attack,' says Salman Rushdie",
    "description": "The literary giant spoke at the Hay Festival about getting back to fiction and free speech.",
    "link": "https://www.bbc.com/news/articles/c98pwpdj7kyo",
    "timestamp": "2025-06-01T19:47:06Z"
  },
  {
    "title": "Liberal candidate Trzaskowski leads in Polish presidential elections runoff",
    "description": "Liberal candidate Rafal Trzaskowski is leading with 50.3 percent in the Polish presidential elections, early exit polls showed Sunday night.",
    "link": "https://www.hurriyetdailynews.com/liberal-candidate-trzaskowski-leads-in-polish-presidential-elections-runoff-209824",
    "timestamp": "2025-06-01T19:47:00Z"
  },
  {
    "title": "Elon Musk says he doesn't 'want to take responsibility for everything the administration’s doing'",
    "description": "President Donald Trump lauded billionaire Elon Musk on Friday as the Tesla CEO wrapped up his time in government service after four turbulent months leading the so-called Department of Government Efficiency (DOGE).\n\"This will be his last day, but not really, …",
    "link": "https://biztoc.com/x/88ead1d205aa5c83",
    "timestamp": "2025-06-01T19:44:48Z"
  },
  {
    "title": "Jacinda Ardern’s memoir and the untold stories from her time as Prime Minister",
    "description": "A Different Kind of Power tells the personal challenges behind her public, political face.",
    "link": "https://www.nzherald.co.nz/lifestyle/jacinda-arderns-memoir-and-the-untold-stories-from-her-time-as-prime-minister/JAXKH52ZNFHW7LUC3MZAK4Z574/",
    "timestamp": "2025-06-01T19:43:17Z"
  },
  {
    "title": "Fake News: CNN, BBC Ran Unverified Claims Israel Killed Palestinians at Aid Site",
    "description": "CNN and the BBC ran with fake news, pushed by Hamas, that claimed Sunday that dozens of Palestinians were killed at a U.S.-backed humanitarian aid site in Gaza, according to evidence released later in the day.\nThe post Fake News: CNN, BBC Ran Unverified Claim…",
    "link": "https://www.breitbart.com/middle-east/2025/06/01/fake-news-cnn-bbc-ran-unverified-claims-israel-killed-palestinians-at-aid-site/",
    "timestamp": "2025-06-01T19:43:02Z"
  },
  {
    "title": "After trip to Ukraine, U.S. senators warn Putin is preparing new offensive",
    "description": "Republican Sen. Lindsey Graham and Democratic Sen. Richard Blumenthal spoke to The Associated Press in Paris after meeting President Volodymyr Zelenskyy and touring neighborhoods shattered by what they called the worst Russian bombardments since the full-scal…",
    "link": "https://www.pbs.org/newshour/politics/after-trip-to-ukraine-u-s-senators-warn-putin-is-preparing-new-offensive",
    "timestamp": "2025-06-01T19:39:21Z"
  },
  {
    "title": "Elon Musk says he doesn't 'want to take responsibility for everything the administration’s doing'",
    "description": "\"I was disappointed to see the massive spending bill,\" Elon Musk said on CBS's \"Sunday Morning.\"",
    "link": "https://www.cnbc.com/2025/06/01/musk-says-doesnt-want-responsibility-for-all-trump-policies.html",
    "timestamp": "2025-06-01T19:35:52Z"
  },
  {
    "title": "Can President Donald Trump fix the national debt? Republican senators, many investors and even Elon Musk have doubts",
    "description": "WASHINGTON — President Donald Trump faces the challenge of convincing Republican senators, global investors, voters and even Elon Musk that he won’t bury the federal government in debt with his multitrillion-dollar tax breaks package.\nThe response so far from…",
    "link": "https://biztoc.com/x/babc5c8cfd32ab6c",
    "timestamp": "2025-06-01T19:33:37Z"
  },
  {
    "title": "Musk talks about Trump administration in CBS interview — despite asking to avoid the subject - The Hill",
    "description": "Musk talks about Trump administration in CBS interview — despite asking to avoid the subjectThe Hill Elon Musk on DOGE and why he doesn't want to \"take responsibility for everything the administration's doing\"CBS News Brooks and Capehart on Elon Musk’s impact…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177894411",
    "timestamp": "2025-06-01T19:32:47Z"
  },
  {
    "title": "Steelers legend Rocky Bleier names US President Donald Trump an 'honorary Steeler'",
    "description": "Steelers legend Rocky Bleier attended President Donald Trump's rally and named him an 'honorary Steeler'",
    "link": "https://steelerswire.usatoday.com/story/sports/nfl/steelers/2025/06/01/steelers-donald-trump-honorary-rocky-bleier/83979590007/",
    "timestamp": "2025-06-01T19:29:48Z"
  },
  {
    "title": "Trump Could Reportedly Settle ‘Thousands’ of White South Africans Within Months",
    "description": "Critics of the White House accepting people fleeing South Africa have accused Trump of letting them cut in line due to the color of their skin.\nThe post Trump Could Reportedly Settle ‘Thousands’ of White South Africans Within Months first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/trump-could-reportedly-settle-thousands-of-white-south-africans-within-months/",
    "timestamp": "2025-06-01T19:29:07Z"
  },
  {
    "title": "Bill Maher Praises Trump Harvard Policy: It's an 'Asshole Factory'",
    "description": "HBO host Bill Maher is backing President Donald Trump's intense scrutiny on Harvard University.\nThe post Bill Maher Praises Trump Harvard Policy: It’s an ‘Asshole Factory’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/06/01/bill-maher-praises-trump-harvard-policy-its-an-asshole-factory/",
    "timestamp": "2025-06-01T19:24:24Z"
  },
  {
    "title": "China Knocks Hegseth's 'Cold War Mentality' After He Calls The Country A Threat",
    "description": "China's foreign ministry claimed the defense secretary has \"deliberately ignored the call for peace and development by countries in the region.\"",
    "link": "https://www.huffpost.com/entry/china-pete-hegseth-cold-war-mentality_n_683ca643e4b0cceca406d18f",
    "timestamp": "2025-06-01T19:23:39Z"
  },
  {
    "title": "Poland: Karol Nawrocki expected to win presidential vote",
    "description": "Conservative Karol Nawrocki, who was backed by US President Donald Trump, won a narrow victory over his pro-EU rival according to Polish media, delivering a blow to Prime Minister Donald Tusk's government. DW has more Poles were choosing between Warsaw's pro-…",
    "link": "https://www.dw.com/en/poland-conservative-karol-nawrocki-wins-presidential-vote/live-72747255",
    "timestamp": "2025-06-01T19:23:00Z"
  },
  {
    "title": "Poland: Vote too close to call, Trzaskowski claims victory",
    "description": "Liberal Rafal Trzaskowski claimed victory after the runoff round in Poland, but exit polls indicate the race is still neck-and-neck. DW has the latest.",
    "link": "https://www.dw.com/en/poland-vote-too-close-to-call-trzaskowski-claims-victory/live-72747255",
    "timestamp": "2025-06-01T19:23:00Z"
  },
  {
    "title": "Chaos erupts as ICE raids office of top Democrat and detains staff",
    "description": "Chaotic scenes unfolded in lower Manhattan as federal agents stormed Democratic Rep. Jerry Nadler's office and handcuffed a female staffer in dramatic video footage. The 77-year-old longtime congressman erupted in fury after Department of Homeland Security of…",
    "link": "https://freerepublic.com/focus/f-chat/4320371/posts",
    "timestamp": "2025-06-01T19:22:06Z"
  },
  {
    "title": "Musk Fends Off Trump Questions in Tense Interview Exchange (Corbin Bolies/The Daily Beast)",
    "description": "Corbin Bolies / The Daily Beast:\nMusk Fends Off Trump Questions in Tense Interview Exchange  —  DONALD WHO?  —  The Tesla CEO bristled when asked about politics.  —  A CBS interview with Elon Musk went off the rails after he was asked about President Donald T…",
    "link": "https://www.memeorandum.com/250601/p57",
    "timestamp": "2025-06-01T19:20:00Z"
  },
  {
    "title": "'India needs to be watchful of any trade diversion risk due to steel tariff challenges'",
    "description": "Indian steel industry executives are concerned about potential trade diversion into the country following the US's decision to double tariffs on steel and aluminum imports. JSW Steel and AMNS India emphasize the need for proactive trade measures to protect th…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/steel/india-needs-to-be-watchful-of-any-trade-diversion-risk-due-to-steel-tariff-challenges/articleshow/121555665.cms",
    "timestamp": "2025-06-01T19:19:10Z"
  },
  {
    "title": "White House planning to replace NASA administrator nominee",
    "description": "The White House said on Saturday it would name a new nominee for NASA administrator, just days before billionaire Jared Isaacman, the current pick, was to face his planned Senate confirmation vote.",
    "link": "https://www.bostonherald.com/2025/06/01/white-house-planning-to-replace-nasa-administrator-nominee/",
    "timestamp": "2025-06-01T19:17:37Z"
  },
  {
    "title": "Trump's reason for dumping Elon Musk associate is falling apart: NYT",
    "description": "The reasons given by White House insiders on why Donald Trump withdrew the nomination of Elon Musk associate Jared Isaacman to head NASA are now being questioned.According to a report from the New York Times' Maggie Haberman and Ryan Mac, the dismissal of Isa…",
    "link": "https://www.rawstory.com/trump-musk-nasa-nyt/",
    "timestamp": "2025-06-01T19:15:38Z"
  },
  {
    "title": "Central Floridians still seeing higher grocery prices amid economic uncertainty",
    "description": "Central Floridians are still battling high prices when making their weekly grocery run. When it comes to cans and other metal-based packaging, it's possible the latest tariffs on steel and aluminum could impact grocery prices further.",
    "link": "https://www.clickorlando.com/news/local/2025/06/01/central-floridians-still-seeing-higher-grocery-prices-amid-economic-uncertainty/",
    "timestamp": "2025-06-01T19:15:17Z"
  },
  {
    "title": "Rand Paul says he would support 'big, beautiful bill' if debt ceiling hike removed",
    "description": "Sen. Rand Paul, R-Ky., said on Sunday that he would support President Donald Trump's \"big, beautiful bill\" if the debt ceiling hike was removed. Paul told CBS' \"Face the Nation\" host Margaret Brennan that he and three other Republican senators will hold out a…",
    "link": "https://freerepublic.com/focus/f-news/4320368/posts",
    "timestamp": "2025-06-01T19:15:10Z"
  },
  {
    "title": "Gov. Tim Walz calls on Democrats to be 'fierce' and 'bully the s-t' out of President Trump (Shane Galvin/New York Post)",
    "description": "Shane Galvin / New York Post:\nGov. Tim Walz calls on Democrats to be ‘fierce’ and ‘bully the s-t’ out of President Trump  —  Minnesota Governor Tim Walz encouraged Democrats to be ‘meaner’ and to ‘bully the s-t’ our of President Donald Trump during a speech i…",
    "link": "https://www.memeorandum.com/250601/p56",
    "timestamp": "2025-06-01T19:15:00Z"
  },
  {
    "title": "Can Trump Force Harvard to Improve? (Ben Sasse/Wall Street Journal)",
    "description": "Ben Sasse / Wall Street Journal:\nCan Trump Force Harvard to Improve?  —  Probably not.  But the president's supporters hope the example will cause leaders of other universities to get serious about reform.  —  Three outcomes are possible in Donald Trump's war…",
    "link": "https://www.memeorandum.com/250601/p55",
    "timestamp": "2025-06-01T19:10:01Z"
  },
  {
    "title": "Pro-EU candidate narrowly ahead of Trump-inspired rival in Poland's presidential election, exit poll shows",
    "description": "Liberal pro-EU candidate Rafal Trzaskowski appears set to narrowly win Poland's presidential election, according to an exit poll.",
    "link": "https://news.sky.com/story/pro-eu-candidate-narrowly-ahead-of-nationalist-rival-in-polands-presidential-election-exit-poll-shows-13377915",
    "timestamp": "2025-06-01T19:09:00Z"
  },
  {
    "title": "Trump-inspired candidate wins Poland's presidential election",
    "description": "Conservative historian Karol Nawrocki, who draws inspiration from Donald Trump, has won Poland's presidential election.",
    "link": "https://news.sky.com/story/trump-inspired-candidate-karol-nawrocki-wins-polands-presidential-election-13378011",
    "timestamp": "2025-06-01T19:09:00Z"
  },
  {
    "title": "European Proposal to Send Troops to Ukraine Allegedly ‘Almost Dead’",
    "description": "It appears that Western media are already recognizing that Europe is incapable of sending troops to the battlefield in Ukraine. In a recent article in the Financial Times (FT), diplomatic sources reported that the Franco-British plan to deploy troops to …\nThe…",
    "link": "https://www.globalresearch.ca/european-proposal-send-troops-ukraine-allegedly-dead/5889100",
    "timestamp": "2025-06-01T19:06:15Z"
  },
  {
    "title": "Polish election: Presidency too close to call as exit polls show neck-and-neck race",
    "description": "The outcome between liberal Warsaw mayor Rafał Trzaskowski and right-wing populist Karol Nawrocki is set to be razor-thin.",
    "link": "https://www.euractiv.com/section/politics/news/polish-election-presidency-too-close-to-call-as-exit-polls-show-neck-and-neck-race/",
    "timestamp": "2025-06-01T19:05:51Z"
  },
  {
    "title": "Biological Man Wins Two Titles In Women’s Track And Field Events As Trump Threatens To Cut Federal Funding",
    "description": "A transgender athlete in California took first place in the girls’ high and triple jump championship events Saturday, as Donald Trump threatened to cut funding.",
    "link": "https://dailycaller.com/2025/06/01/biological-male-wins-track-field-trump-california-womens-sports/",
    "timestamp": "2025-06-01T19:00:20Z"
  },
  {
    "title": "Tariffs and Turmoil Undermine Trump's Oil and Gas Promises",
    "description": "When U.S. President Donald Trump came into office in January, he promised to back greater oil and gas production, doubling down on his “drill, baby, drill” catch phrase. He rapidly introduced executive orders aimed at encouraging new oil and gas exploration a…",
    "link": "https://oilprice.com/Energy/Energy-General/Tariffs-and-Turmoil-Undermine-Trumps-Oil-and-Gas-Promises.html",
    "timestamp": "2025-06-01T19:00:00Z"
  },
  {
    "title": "US Tariff Impact: Prices Surge At Walmart And Target, Employees Say—Some Jumps Top 38%",
    "description": "The tariffs imposed by President Donald Trump are reportedly leading to significant price increases at Walmart Inc. (NYSE:WMT) and Target Corporation (NYSE:TGT) stores across the U.S.\nWhat Happened: The Walmart employees have been sharing images on Reddit tha…",
    "link": "https://biztoc.com/x/f7d0141fe620cc2f",
    "timestamp": "2025-06-01T18:59:43Z"
  },
  {
    "title": "There's a 'nasty' new nickname for Trump, but it gets something wrong",
    "description": "Donald Trump's team is fighting one of the most consequential legal cases in the US history, but there are plenty more where that came from: 250 lawsuits are currently featuring his administration.",
    "link": "https://www.abc.net.au/news/2025-06-02/donald-trump-unitary-executive-theory/105362150",
    "timestamp": "2025-06-01T18:57:06Z"
  },
  {
    "title": "Elon Musk on DOGE and why he doesn't want to \"take responsibility for everything the administration's doing\" - CBS News",
    "description": "Elon Musk on DOGE and why he doesn't want to \"take responsibility for everything the administration's doing\"CBS News Elon Musk says he’s caught between supporting and opposing Donald Trump: ‘Creates a bone of contention’Mint Musk’s departure marks new chapter…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177894075",
    "timestamp": "2025-06-01T18:52:46Z"
  },
  {
    "title": "Trump, Xi to talk this week about trade, key advisor says - Axios",
    "description": "Trump, Xi to talk this week about trade, key advisor saysAxios Trump, Xi likely to speak soon on minerals trade dispute, aides sayReuters Hassett: Trump will have 'a wonderful conversation' this week with XiABC News Signs of thawing? US-China trade war may ea…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177894073",
    "timestamp": "2025-06-01T18:52:36Z"
  },
  {
    "title": "‘Wildly Inappropriate!’ Fox’s Howard Kurtz Destroys Scott Pelley’s Viral Anti-Trump Commencement Speech — Suggests it Shows CBS is ‘Incredibly Biased’",
    "description": "Fox's Howard Kurtz went after 60 Minutes correspondent Scott Pelley for his viral commencement speech at Wake Forest — which took aim at President Trump.\nThe post ‘Wildly Inappropriate!’ Fox’s Howard Kurtz Destroys Scott Pelley’s Viral Anti-Trump Commencement…",
    "link": "https://www.mediaite.com/media/wildly-inappropriate-foxs-howard-kurtz-destroys-scott-pelleys-viral-anti-trump-commencement-speech-suggests-it-shows-cbs-is-incredibly-biased/",
    "timestamp": "2025-06-01T18:52:29Z"
  },
  {
    "title": "Ukraine destroys dozens of Russian warplanes with drone attack deep inside Russia",
    "description": "Ukrainian forces target 5 airfields deep inside Russia, striking 40 aircraft including bombers and reconnaissance planes Ukrainian forces destroyed dozens of Russian warplanes with a drone attack on air bases deep within Russian territory on Sunday. Ukrainian…",
    "link": "https://freerepublic.com/focus/f-news/4320360/posts",
    "timestamp": "2025-06-01T18:51:04Z"
  },
  {
    "title": "50 Cent Pledges to Prevent a Trump Pardon for Diddy: ‘I’m Gonna Reach Out’",
    "description": "\"Donald doesn’t take well to disrespect, and doesn’t forget who chooses to go against him,\" 50 Cent says of pre-verdict maneuvering",
    "link": "http://www.rollingstone.com/music/music-news/50-cent-pledges-prevent-trump-pardon-diddy-1235352202/",
    "timestamp": "2025-06-01T18:48:13Z"
  },
  {
    "title": "Ukraine's drone attack in Russia shows Kyiv felt it had nothing to lose",
    "description": "An audacious Ukrainian drone attack against multiple airbases across Russia is a humiliating security breach for Vladimir Putin that will doubtless trigger a furious response.",
    "link": "https://news.sky.com/story/ukraines-drone-attack-in-russia-shows-kyiv-felt-it-had-nothing-to-lose-13377952",
    "timestamp": "2025-06-01T18:42:00Z"
  },
  {
    "title": "Supreme Court helping Trump undo one of Biden’s most egregious migrant moves",
    "description": "If the Supreme Court does not once and for all put the kibosh on categorical parole programs, the next Biden, the next Mayorkas, could institute a program on steroids, rolling out the red carpet for pretty much any and every person around the world not alread…",
    "link": "https://nypost.com/2025/06/01/opinion/supreme-court-helping-trump-undo-one-of-bidens-most-egregious-migrant-moves/",
    "timestamp": "2025-06-01T18:36:20Z"
  }
]