[
  {
    "title": "FAIR: America’s Opinion Pages Overwhelmingly Supported Trump’s Attack on Iran",
    "description": "56% of Americans opposed Trump’s bombing. Why wasn’t this reflected in the range of opinions presented by America’s top press outlets?",
    "link": "https://fair.org/home/americas-opinion-pages-overwhelmingly-supported-trumps-attack-on-iran/",
    "timestamp": "2025-07-25T21:47:57Z"
  },
  {
    "title": "Dem Admits Party’s Epstein Files Attack Line Is ‘Bulls*it’",
    "description": "Some House Democrats are privately protesting their party’s messaging on the Jeffrey Epstein files, with one arguing that Democratic lawmakers’ purported outrage at the administration’s handling of the documents is \"bullshit.\"",
    "link": "https://dailycaller.com/2025/07/25/house-democrats-protest-epstein-files-messaging/",
    "timestamp": "2025-07-25T21:47:06Z"
  },
  {
    "title": "House working on plan to do a REAL investigation of Jan. 6",
    "description": "Infamous partisan panel ignored evidence and claimed Trump was an insurrectionist",
    "link": "https://www.wnd.com/2025/07/house-working-plan-do-real-investigation-jan-6/",
    "timestamp": "2025-07-25T21:46:38Z"
  },
  {
    "title": "Trump: EU deal biggest of all if we make it",
    "description": "United States President Donald Trump told reporters on Friday that the trade deal with the European Union would be \"the biggest of them all if we make it.\" The president confirmed he will me...",
    "link": "https://biztoc.com/x/4c3e02ad8ed50c0f",
    "timestamp": "2025-07-25T21:46:21Z"
  },
  {
    "title": "Homeless executive order reinforces Florida law; How effective will it be in Pensacola?",
    "description": "PENSACOLA, Fla. -- An executive order signed by President Donald Trump will make it easier for cities and states to remove homeless people from the streets.Trum",
    "link": "https://weartv.com/news/local/homeless-executive-order-reinforces-florida-law-how-effective-will-it-be-in-pensacola",
    "timestamp": "2025-07-25T21:45:34Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.07.25 1080p WEB H264-onX",
    "description": "Season , Episode – ““DEEPLY Disturbing And Shocking!” US Fascism With Mehdi Hasan & Victor Davis-Hanson”Mehdi Hasan’s viral debate on Jubilee against far-right conservatives has sparked some interesting conversations, not least because one of the self-proclai…",
    "link": "https://post.rlsbb.cc/piers-morgan-uncensored-2025-07-25-1080p-web-h264-onx/",
    "timestamp": "2025-07-25T21:43:44Z"
  },
  {
    "title": "Paramount gets green light for $8 billion merger. But what is the psychic cost for company?",
    "description": "With this week’s FCC approval, the merger between Paramount Global and Skydance Media is expected to be completed in the coming weeks at a value of $8 billion. The question for the new company is whether the psychic cost is much higher. It has been a particul…",
    "link": "https://financialpost.com/pmn/paramount-gets-green-light-for-8-billion-merger-but-what-is-the-psychic-cost-for-company",
    "timestamp": "2025-07-25T21:43:26Z"
  },
  {
    "title": "The dire state of Gaza negotiations, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The Trump administration is stepping back from ceasefi…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/421297/israel-hamas-ceasefire-negotiations-gaza-famine-crisis",
    "timestamp": "2025-07-25T21:42:06Z"
  },
  {
    "title": "Paramount gets green light for $8 billion merger. But what is the psychic cost for company?",
    "description": "With this week’s FCC approval, the merger between Paramount Global and Skydance Media is expected to be completed in the coming weeks at a value of $8...",
    "link": "https://finance.yahoo.com/news/paramount-gets-green-light-8-214142246.html",
    "timestamp": "2025-07-25T21:41:42Z"
  },
  {
    "title": "‘You Must Be Kidding’: Media Matters, Collapsing Under Siege from Elon Musk, Fumes at Massive Legal Bills From Marc Elias Firm",
    "description": "The law firm of Democratic super-lawyer Marc Elias and its longtime client Media Matters suffered a major rift earlier this year stemming from a lawsuit filed against the liberal media group by Elon Musk and his social media company X.\nThe post ‘You Must Be K…",
    "link": "https://freebeacon.com/democrats/you-must-be-kidding-media-matters-fumed-at-massive-legal-bills-from-marc-elias-firm/",
    "timestamp": "2025-07-25T21:40:23Z"
  },
  {
    "title": "Trump Will Meet with EU on Sunday to Work on Trade Deal",
    "description": "President Donald Trump arrived in Scotland Friday for his state visit to the United Kingdom and shared that he is set to meet with the European Union on Sunday to discuss a potential trade deal.\nThe post Trump Will Meet with EU on Sunday to Work on Trade Deal…",
    "link": "https://www.breitbart.com/politics/2025/07/25/trump-will-meet-with-eu-on-sunday-to-work-on-trade-deal/",
    "timestamp": "2025-07-25T21:38:47Z"
  },
  {
    "title": "Absolutely Not – Senators Graham and Cornyn Ask DOJ to Appoint Special Counsel to Investigate President Obama and Intelligence Weaponization Against Trump",
    "description": "Senator Lindsey Graham (Judiciary Committee) and Senator John Cornyn (SSCI) are requesting Attorney General Pam Bondi to appoint a special counsel to look into the Obama administration’s weaponization of the U.S. Intelligence Community to target Donald Trump …",
    "link": "https://freerepublic.com/focus/f-bloggers/4330784/posts",
    "timestamp": "2025-07-25T21:36:44Z"
  },
  {
    "title": "'South Park' Donald Trump Episode: White House Responds",
    "description": "'South Park' Donald Trump Episode: White House Respondscafemom.com",
    "link": "https://cafemom.com/entertainment/south-park-donald-trump-episode-white-house-responds-bed-satan",
    "timestamp": "2025-07-25T21:35:17Z"
  },
  {
    "title": "Democrats and advocates criticize Trump's executive order on homelessness",
    "description": "Homeless advocates are criticizing an executive order President Donald Trump signed this week to restore order",
    "link": "https://abcnews.go.com/US/wireStory/democrats-advocates-criticize-trumps-executive-order-homelessness-124084843",
    "timestamp": "2025-07-25T21:35:12Z"
  },
  {
    "title": "Donald Trump Defends 'Weak Dollar,' Economic Analysts Respond",
    "description": "While the U.S. dollar gained ground Friday, it is still set for a weekly drop amid ongoing tariff negotiations and bank meetings scheduled for next week.",
    "link": "https://biztoc.com/x/156abd27bbc288ce",
    "timestamp": "2025-07-25T21:35:07Z"
  },
  {
    "title": "Anti-Trump DA Alvin Bragg sure acts like he has something to hide — we’re suing to find out",
    "description": "DA Bragg has hundreds of records of communications with or about political agents about his prosecution of Donald Trump — and he won't explain why the public isn’t entitled to see them.",
    "link": "https://nypost.com/2025/07/25/opinion/were-suing-to-expose-alvin-braggs-anti-trump-lawfare/",
    "timestamp": "2025-07-25T21:33:41Z"
  },
  {
    "title": "What does Trump’s college sports executive order mean? Breaking down the impact",
    "description": "“President Donald J. Trump Saves College Sports.” If only it was that simple. The 176th executive order President Trump signed in the past seven months was announced Thursday with an audaciously headlined statement from the White House. We don’t know how this…",
    "link": "https://sports.yahoo.com/article/does-trump-college-sports-executive-213104515.html",
    "timestamp": "2025-07-25T21:31:04Z"
  },
  {
    "title": "FinTechs Petition Trump to Advance Open Banking Rule Amid Fee Controversy",
    "description": "For open banking to function, traditional financial institutions and FinTechs must collaborate as data is passed from the traditional players to digital innovators, forging new products and services set on improving credit access, speeding payments and keepin…",
    "link": "http://www.pymnts.com/news/regulation/2025/fintechs-petition-trump-advance-open-banking-rule-amid-fee-controversy/",
    "timestamp": "2025-07-25T21:31:01Z"
  },
  {
    "title": "Trump in Scotland for first UK trip since re-election",
    "description": "Donald Trump says \"it's great to be in Scotland\" as he lands for a four-day private visit.",
    "link": "https://www.bbc.com/news/articles/cy8g8w431wyo",
    "timestamp": "2025-07-25T21:30:12Z"
  },
  {
    "title": "Liberal media watchdog weighs shutting down as it ‘scrambles’ to fend off MAGA assault",
    "description": "The nonprofit media watchdog group Media Matters is reportedly considering shutting down, the New York Times reported\r\n Friday, as the nonprofit scrambles to fend off “legal assaults” from allies of President Donald Trump.“The group has slashed the size of it…",
    "link": "https://www.rawstory.com/media-matters-2673761047/",
    "timestamp": "2025-07-25T21:30:12Z"
  },
  {
    "title": "Israel Considers ‘Alternative Options’ to Cease-Fire Talks With Hamas",
    "description": "Foreign pressure to end the war is mounting as Gaza’s hunger crisis worsens.",
    "link": "http://foreignpolicy.com/2025/07/25/israel-hamas-cease-fire-talks-us-gaza-aid-hunger-crisis-france-palestine-statehood/",
    "timestamp": "2025-07-25T21:29:19Z"
  },
  {
    "title": "EXCLUSIVE: Trump Transportation Department Alleviates ‘Green New Deal’ Program",
    "description": "FIRST ON THE DAILY SIGNAL—President Donald Trump’s Department of Transportation is moving away from the Biden administration’s climate justice initiative which made it harder and... Read More\nThe post EXCLUSIVE: Trump Transportation Department Alleviates ‘Gre…",
    "link": "https://www.dailysignal.com/2025/07/25/exclusive-trump-transportation-department-alleviates-green-new-deal-program/",
    "timestamp": "2025-07-25T21:29:00Z"
  },
  {
    "title": "How Should Dems Run For Office In 'The Epstein Files' Era?",
    "description": "Michigan state Sen. Mallory McMorrow is running for fellow Democrat U.S. Sen. Gary Peters’ soon-to-be vacated seat. And in a new video, she demonstrates how she has outdone all other candidates in the race so far.\nPosted on Instagram, the video features McMor…",
    "link": "https://crooksandliars.com/2025/07/how-should-dems-run-office-epstein-files",
    "timestamp": "2025-07-25T21:27:32Z"
  },
  {
    "title": "Donald Trump Defends 'Weak Dollar,' Economic Analysts Respond",
    "description": "While the U.S. dollar gained ground Friday, it is still set for a weekly drop amid ongoing tariff negotiations and bank meetings scheduled for next week.",
    "link": "https://www.newsweek.com/donald-trump-defends-weak-dollar-economic-analysts-respond-2104336",
    "timestamp": "2025-07-25T21:25:24Z"
  },
  {
    "title": "‘South Park’ creators reveal battle with network over wild Trump depiction, joke they’re ‘terribly sorry’",
    "description": "\"South Park\" creators Trey Parker and Matt Stone discussed their controversial season 27 premiere at San Diego Comic-Con on Thursday.",
    "link": "https://nypost.com/2025/07/25/media/south-park-creators-reveal-battle-with-network-over-wild-trump-depiction-joke-theyre-terribly-sorry/",
    "timestamp": "2025-07-25T21:25:05Z"
  },
  {
    "title": "Over 2 dozen Planned Parenthood facilities shut down amid federal funding losses",
    "description": "In recent months, more than two dozen Planned Parenthood locations have announced they will close. / Credit: Jonathan Weiss/Shutterstock\n\nWashington, D.C. Newsroom, Jul 25, 2025 / 17:25 pm (CNA).\nMore than two dozen Planned Parenthood facilities across the co…",
    "link": "https://www.catholicnewsagency.com/news/265581/over-2-dozen-planned-parenthood-facilities-shut-down-amid-federal-funding-losses",
    "timestamp": "2025-07-25T21:25:00Z"
  },
  {
    "title": "A global HIV/AIDS program that saved millions of lives faces cuts under the Trump administration",
    "description": "WASHINGTON — The Trump administration is considering a dramatic cutback and eventual phasing out of the President’s Emergency Plan for AIDS Relief (PEPFAR), the U.S. program to combat HIV/AIDS in developing countries that has been widely credited with saving …",
    "link": "https://www.nbcnews.com/politics/trump-administration/global-hivaids-program-saved-millions-lives-faces-cuts-trump-administr-rcna221025",
    "timestamp": "2025-07-25T21:24:08Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.07.25 1080p WEB H264-onX",
    "description": "Season , Episode – ““DEEPLY Disturbing And Shocking!” US Fascism With Mehdi Hasan & Victor Davis-Hanson”Mehdi Hasan’s viral debate on Jubilee against far-right conservatives has sparked some interesting conversations, not least because one of the self-proclai…",
    "link": "https://post.rlsbb.ru/piers-morgan-uncensored-2025-07-25-1080p-web-h264-onx/",
    "timestamp": "2025-07-25T21:24:07Z"
  },
  {
    "title": "Bitcoin to Reach $150,000 Soon: Billionaire Investor Mike Novogratz",
    "description": "Mike Novogratz, the billionaire CEO of Galaxy Digital, is bullish on Bitcoin and recently stated that the premier digital currency is likely to reach $150k in the coming months.",
    "link": "https://zycrypto.com/bitcoin-to-reach-150000-soon-billionaire-investor-mike-novogratz/",
    "timestamp": "2025-07-25T21:24:02Z"
  },
  {
    "title": "Trump Arrives in Scotland for Four-Day Visit",
    "description": "Donald Trump arrived in Scotland on Friday evening for a private five-day visit of his mother’s ancestral home, taking in two golf resorts he owns. UK Prime Minister Keir Starmer knows full well that when it comes to this US president, little is ever really p…",
    "link": "https://biztoc.com/x/47356a1b63b561be",
    "timestamp": "2025-07-25T21:23:48Z"
  },
  {
    "title": "'Extremely disappointing': Little Leaguers denied visas into US due to Trump travel ban",
    "description": "President Donald Trump's administration has denied a Venezuelan Little League team from coming into the United States to compete in the Senior League World Series.Little League International confirmed to Newsweek on Friday that the Cacique Mara team, from Mar…",
    "link": "https://www.rawstory.com/little-league-world-series/",
    "timestamp": "2025-07-25T21:21:49Z"
  },
  {
    "title": "Trump, EU Chief To Meet Sunday In Push For Trade Deal",
    "description": "EU chief Ursula von der Leyen and US President Donald Trump said Friday they would meet in Scotland this weekend in a decisive push to resolve a months-long transatlantic trade standoff.",
    "link": "https://www.ibtimes.com/trump-eu-chief-meet-sunday-push-trade-deal-3779485",
    "timestamp": "2025-07-25T21:21:13Z"
  },
  {
    "title": "Newsmax’s Greg Kelly Says Convicted Child Sex Trafficker Ghislaine Maxwell ‘Just Might Be a Victim’",
    "description": "Newsmax host Greg Kelly said on his show Thursday that convicted child sex trafficker Ghislaine Maxwell \"just might be a victim\" -- a comment that drew loud and swift backlash.\nThe post Newsmax’s Greg Kelly Says Convicted Child Sex Trafficker Ghislaine Maxwel…",
    "link": "https://www.mediaite.com/media/news/newsmaxs-greg-kelly-says-convicted-child-sex-trafficker-ghislaine-maxwell-just-might-be-a-victim/",
    "timestamp": "2025-07-25T21:20:27Z"
  },
  {
    "title": "For CNET's Daily Tariff Price Impact Tracker, I'm Watching 11 Key Products for Inflation",
    "description": "With the reality of tariff-driven inflation arriving in earnest, it's more important than ever to keep tabs on the prices that most impact you.",
    "link": "https://www.cnet.com/tech/for-cnets-daily-tariff-price-impact-tracker-im-watching-11-key-products-for-inflation/",
    "timestamp": "2025-07-25T21:20:00Z"
  },
  {
    "title": "‘It’s Important We Send A Message’: Tom Homan Tells Stephen A. Smith Why Trump Admin Can’t Only Deport Criminals",
    "description": "Tom Homan explained to Stephen A. Smith why Donald Trump's administration cannot limit deportations to only illegal immigrants who commit additional crimes.",
    "link": "https://dailycaller.com/2025/07/25/tom-homan-stephen-a-smith-trump-admin-cant-only-deport-criminals/",
    "timestamp": "2025-07-25T21:19:08Z"
  },
  {
    "title": "Is Elon Musk to blame for Tesla's struggles? Experts weigh in",
    "description": "Tesla's profits plunged 16% over a three-month stretch ending in June.",
    "link": "https://abcnews.go.com/Business/elon-musk-blame-teslas-struggles-experts-weigh/story?id=124039268",
    "timestamp": "2025-07-25T21:18:00Z"
  },
  {
    "title": "A man is halted climbing the US-Mexico border wall. Under new Trump rules, US troops sound the alarm",
    "description": "Inside an armored vehicle, an Army scout uses a joystick to direct a long-range optical scope toward a man perched atop the U.S.-Mexico border wall cutting across the hills of this Arizona frontier community.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/07/25/a-man-is-halted-climbing-the-us-mexico-border-wall-under-new-trump-rules-us-troops-sound-the-alarm",
    "timestamp": "2025-07-25T21:17:47Z"
  },
  {
    "title": "The IRS Gives Churches More Say Over Their Religious Activities",
    "description": "The Internal Revenue Service says it will relax its long-standing ban on churches engaging in political campaign activity. Churches, of course, must decide whether to... Read More\nThe post The IRS Gives Churches More Say Over Their Religious Activities  appea…",
    "link": "https://www.dailysignal.com/2025/07/25/irs-gives-churches-say-religious-activities/",
    "timestamp": "2025-07-25T21:16:13Z"
  },
  {
    "title": "S&P/TSX composite rises Friday, U.S. markets also close higher",
    "description": "Canada’s main stock index capped off the week with a more than 100-point bump on Friday, while U.S. markets set more records even as the latest U.S. tariff deadline looms. The S&P/TSX composite index closed up 122.09 points at 27,494.35. In New York, the Dow …",
    "link": "https://financialpost.com/pmn/sp-tsx-composite-rises-friday-u-s-markets-also-close-higher",
    "timestamp": "2025-07-25T21:15:52Z"
  },
  {
    "title": "Justice Dept. finishes second day of Ghislaine Maxwell interview (Washington Post)",
    "description": "Washington Post:\nJustice Dept. finishes second day of Ghislaine Maxwell interview  —  President Trump said he was not considering granting clemency to Maxwell, a former associate of Jeffrey Epstein.  —  just now  —  President Donald Trump said Friday he was n…",
    "link": "https://www.memeorandum.com/250725/p98",
    "timestamp": "2025-07-25T21:15:02Z"
  },
  {
    "title": "The View Warned It's 'Next to Be Pulled Off Air' After 'Irrelevant Loser' Joy Behar's Strange On-air Rant About Donald Trump",
    "description": "The Trump White House warned the ladies of 'The View' that they could be 'pulled off the air' following Joy Behar's unhinged rant.",
    "link": "https://radaronline.com/p/the-view-warned-cancelation-joy-behar-donald-trump-rant/",
    "timestamp": "2025-07-25T21:15:00Z"
  },
  {
    "title": "‘We are dying’: Palestinians slam world’s inaction as hunger ravages Gaza",
    "description": "Gaza hospitals report nine more deaths from starvation as Israel's blockade plunges enclave into worsening crisis.",
    "link": "https://www.aljazeera.com/news/2025/7/25/we-are-dying-palestinians-slam-worlds-inaction-as-hunger-ravages-gaza",
    "timestamp": "2025-07-25T21:13:16Z"
  },
  {
    "title": "Donald Trump Dealt Legal Blow Over Sanctuary Cities",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA federal judge dealt a blow to President Donald Trump and his immigration agenda when she dismissed a lawsuit the administration filed against Illinois and Chicago over their \"sanctuary city\" policies.\nThe De…",
    "link": "https://biztoc.com/x/fa7ec49b19059725",
    "timestamp": "2025-07-25T21:13:00Z"
  },
  {
    "title": "Donald Trump vs U.S. Supreme Court - Full list of cases involving President before top court",
    "description": "Major cases involving US President Donald Trump are pending at the Supreme Court.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-vs-u-s-supreme-court-full-list-of-cases-involving-president-before-top-court/articleshow/122912997.cms",
    "timestamp": "2025-07-25T21:11:30Z"
  },
  {
    "title": "Trump says he hasn’t ‘had a lot of luck’ with Canada ahead of latest tariff deadline",
    "description": "WASHINGTON — U.S. President Donald Trump said Friday his administration hasn’t “had a lot of luck with Canada” in its trade negotiations, tempering expectations of a deal ahead of next week’s deadline to avert tariffs. “I think Canada could be one where they …",
    "link": "https://financialpost.com/pmn/trump-says-he-hasnt-had-a-lot-of-luck-with-canada-ahead-of-latest-tariff-deadline-3",
    "timestamp": "2025-07-25T21:11:10Z"
  },
  {
    "title": "Ghislaine Maxwell’s Lawyer Says She Gave Information About ‘100 Different People’ to the DOJ",
    "description": "Convicted sex trafficker Ghislaine Maxwell has now told the Department of Justice about ‘100 different people’ allegedly associated with Jeffrey Epstein, according to her attorney. The claim from her lawyer, David Oscar Markus, comes just after Maxwell faced …",
    "link": "https://www.mediaite.com/politics/ghislaine-maxwells-lawyer-says-she-gave-information-about-100-different-people-to-the-doj/",
    "timestamp": "2025-07-25T21:10:49Z"
  },
  {
    "title": "House ethics panel tells Rep. Alexandria Ocasio-Cortez to pay more for Met Gala attendance",
    "description": "Reports on unrelated ethics allegations against representatives from Pennsylvania, Florida and Texas were also issued.",
    "link": "https://www.bostonherald.com/2025/07/25/alexandria-ocasio-cortez-house-ethics-ruling/",
    "timestamp": "2025-07-25T21:10:24Z"
  },
  {
    "title": "Donald Trump Dealt Legal Blow Over Sanctuary Cities",
    "description": "Judge Lindsay Jenkins dismissed the Trump administration's lawsuit, saying it was an effort to encroach on state sovereignty.",
    "link": "https://www.newsweek.com/trump-sanctuary-city-lawsuit-dismissed-judge-2104361",
    "timestamp": "2025-07-25T21:09:08Z"
  },
  {
    "title": "Man Married to US Citizen Held in Alligator Alcatraz After Traffic Stop",
    "description": "Two brothers from Mexico were arrested during a traffic stop and are now being held at the Alligator Alcatraz detention center.",
    "link": "https://www.newsweek.com/man-married-us-citizen-held-alligator-alcatraz-traffic-stop-2104356",
    "timestamp": "2025-07-25T21:06:20Z"
  },
  {
    "title": "Ohio Looking Into Changes for Law School Accreditation Process",
    "description": "President Donald Trump signed an executive order in April affecting the accreditation process for institutions of higher learning. As Elizabeth Troutman Mitchell covered in an... Read More\nThe post Ohio Looking Into Changes for Law School Accreditation Proces…",
    "link": "https://www.dailysignal.com/2025/07/25/ohio-looking-into-changes-for-law-school-accreditation-process/",
    "timestamp": "2025-07-25T21:03:56Z"
  },
  {
    "title": "Donald Trump Denies Being Briefed That His Name Appeared In Jeffrey Epstein Files, Despite Wall Street Journal Report That He Was Informed",
    "description": "President Donald Trump denied that he was briefed on his name appearing in the case files of Jeffrey Epstein, seeming contradicting a recent report in The Wall Street Journal that he was. After Air Force One landed in Scotland on Friday, a reporter asked Trum…",
    "link": "http://deadline.com/2025/07/trump-jeffrey-epstein-files-wall-street-journal-1236469107/",
    "timestamp": "2025-07-25T21:02:51Z"
  },
  {
    "title": "Trump Pulls Habba's Nomination For New Jersey's Top Prosecutor, Making Her Acting US Attorney",
    "description": "Trump Pulls Habba's Nomination For New Jersey's Top Prosecutor, Making Her Acting US Attorney\n \nAuthored by Jacob Burg via The Epoch Times (emphasis ours),\nPresident Donald Trump withdrew his nomination of Alina Habba to serve as New Jersey’s top federal pros…",
    "link": "https://biztoc.com/x/91ca558db182e8e7",
    "timestamp": "2025-07-25T21:02:03Z"
  },
  {
    "title": "Donald Trump Says His Supreme Court Win Helps Obama—'He Owes Me Big'",
    "description": "The U.S. Supreme Court's ruling last year on presidential immunity has broadened the limits of legal protection for presidents.",
    "link": "https://biztoc.com/x/6ca9c8610c742a5a",
    "timestamp": "2025-07-25T21:01:35Z"
  },
  {
    "title": "Ghislaine Maxwell Gave DOJ Details About 100 People Linked to Epstein",
    "description": "\"She was asked maybe about 100 different people, she answered questions about everybody and she didn’t hold anything back.\"\nThe post Ghislaine Maxwell Gave DOJ Details About 100 People Linked to Epstein first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/ghislaine-maxwell-gave-doj-details-about-100-people-linked-to-epstein/",
    "timestamp": "2025-07-25T21:00:50Z"
  },
  {
    "title": "\"Going to F*** Me\": Trump Crashes Out Over Epstein Chaos (Edith Olmsted/New Republic)",
    "description": "Edith Olmsted / New Republic:\n“Going to F*** Me”: Trump Crashes Out Over Epstein Chaos … Donald Trump privately fears that his relationship with Jeffrey Epstein is about to detonate, Politico reported Thursday.  —  In the Oval Office recently, Trump was spira…",
    "link": "https://www.memeorandum.com/250725/p94",
    "timestamp": "2025-07-25T21:00:37Z"
  },
  {
    "title": "The next big health care fight that's splitting Republicans: From the Politics Desk",
    "description": "After passing President Donald Trump’s sweeping megabill that included steep cuts to Medicaid, Republicans have another big health care fight on their hands.",
    "link": "https://www.nbcnews.com/politics/politics-news/big-health-care-fight-splitting-republicans-politics-desk-rcna221167",
    "timestamp": "2025-07-25T21:00:00Z"
  },
  {
    "title": "‘Make America Healthy Agenda’ Scores More Wins on Froot Loops and Flu Vaccines",
    "description": "At this point, it is clear that Kennedy’s MAHA movement has used a mix of regulatory action, public pressure, and grassroots campaigning to initiate some significant changes in food policy. It will be interesting to see if there are noticeable impacts on chro…",
    "link": "https://wattsupwiththat.com/2025/07/25/make-america-healthy-agenda-scores-more-wins-on-froot-loops-and-flu-vaccines/",
    "timestamp": "2025-07-25T21:00:00Z"
  },
  {
    "title": "NOAA Puts 2 Officials Who Investigated Trump For Changing A Forecast Map On Leave",
    "description": "President Donald Trump drew on a map of a forecast for Hurricane Dorian in 2019. He did it to indicate the storm would go over Alabama. It didn't.",
    "link": "https://www.huffpost.com/entry/noaa-puts-2-officials-who-investigated-trump-for-changing-a-forecast-map-on-leave_n_6883dbc3e4b09c928ae1dd45",
    "timestamp": "2025-07-25T20:59:59Z"
  },
  {
    "title": "S&P 500, Nasdaq, Dow Jones climb to record high. Check top stocks",
    "description": "US stock market indexes S&P 500, Dow Jones, and Nasdaq have performed exceptionally well.",
    "link": "https://economictimes.indiatimes.com/news/international/us/sp-500-nasdaq-dow-jones-climb-to-record-high-check-top-stocks/articleshow/122912987.cms",
    "timestamp": "2025-07-25T20:58:12Z"
  },
  {
    "title": "Fema announces funds for states to detain undocumented migrants",
    "description": "The Trump administration is seeking local assistance for its federal mass deportation efforts.",
    "link": "https://www.bbc.com/news/articles/c5ypy14ll32o",
    "timestamp": "2025-07-25T20:57:21Z"
  },
  {
    "title": "Donald Trump Says His Supreme Court Win Helps Obama—'He Owes Me Big'",
    "description": "The U.S. Supreme Court's ruling last year on presidential immunity has broadened the limits of legal protection for presidents.",
    "link": "https://www.newsweek.com/donald-trump-says-his-supreme-court-win-helps-obamahe-owes-me-big-2104344",
    "timestamp": "2025-07-25T20:55:30Z"
  },
  {
    "title": "South Park Creators 'Terribly Sorry' for Making Trump Mad, Fought for Unblurred Penis - TooFab",
    "description": "South Park Creators 'Terribly Sorry' for Making Trump Mad, Fought for Unblurred PenisTooFab Trump's 'South Park' ProblemPolitico ‘South Park’ creators double down on episode skewering TrumpThe Hill ‘We’re terribly sorry’: South Park creators respond with humo…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178468926",
    "timestamp": "2025-07-25T20:54:25Z"
  },
  {
    "title": "President Trump Delivers Again: ICE Arrests Surge Nationwide",
    "description": "Across the country, arrests of criminal illegal immigrants have soared as President Donald J. Trump makes good on his promise to rid our communities of these threats to public safety — making sure illegal immigrant killers, rapists, gangbangers, and other vio…",
    "link": "https://freerepublic.com/focus/f-news/4330781/posts",
    "timestamp": "2025-07-25T20:53:59Z"
  },
  {
    "title": "Donald Trump arrives in Scotland for five-day visit set to mix diplomacy and golf",
    "description": "Trump began a five-day trip today which will include visits to his two golf clubs and meetings with Keir Starmer and Ursula von der Leyen.",
    "link": "https://www.thejournal.ie/donald-trump-arrives-in-scotland-for-five-day-visit-6774284-Jul2025/",
    "timestamp": "2025-07-25T20:52:36Z"
  },
  {
    "title": "US Congress urges Trump to press Netanyahu on Gaza deal",
    "description": "Members of the United States Congress called on President Donald Trump's administration on Friday to exert more pressure on Israeli Prime Minister Benjamin Netanyahu to reach a Gaza ceasefire deal. \"T...",
    "link": "https://biztoc.com/x/fffcc4d5bfc7de00",
    "timestamp": "2025-07-25T20:50:43Z"
  },
  {
    "title": "Trump Seeks Even Higher Tariffs: 'Between 15 Percent and 50 Percent' on Imports From All Countries",
    "description": "President Donald Trump said on Wednesday that \"we'll have a straight, simple tariff of anywhere between 15% and 50%.\" Hiking the baseline reciprocal tariff rate to 15 percent means a 50 percent higher tax on American manufacturers and consumers than Trump ori…",
    "link": "https://biztoc.com/x/80ce826bb706d666",
    "timestamp": "2025-07-25T20:50:41Z"
  },
  {
    "title": "'Beirut Beefcake' Who Cosplayed as Little Mermaid and Compared Trump to Qaddafi Gets New Show on Disney+",
    "description": "James Longman, aka the \"Beirut Beefcake,\" the most prominent (openly) gay correspondent at ABC News, just launched a new show on the Disney+ streaming app. Longman, who fell out with his former bosses at the BBC for comparing Donald Trump to Libyan dictator M…",
    "link": "https://freebeacon.com/media/beirut-beefcake-who-cosplayed-as-little-mermaid-and-compared-trump-to-qaddafi-gets-new-show-on-disney/",
    "timestamp": "2025-07-25T20:50:04Z"
  },
  {
    "title": "Jordan, other countries could airdrop aid into Gaza as humanitarian crisis worsens",
    "description": "The Kingdom of Jordan will airdrop humanitarian aid into Gaza as Palestinians face widespread starvation and diplomatic talks over a ceasefire breakdown.",
    "link": "https://abcnews.go.com/Politics/jordan-countries-airdrop-aid-gaza-humanitarian-crisis-worsens/story?id=124042849",
    "timestamp": "2025-07-25T20:49:11Z"
  },
  {
    "title": "An Easy Summer Project Worth Doing",
    "description": "Finding small moments of joy can make every day feel—at least a little—like vacation.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/summer-joy-moments/683676/",
    "timestamp": "2025-07-25T20:49:00Z"
  },
  {
    "title": "Donald Trump Wants To Punish Anyone Who Doesn’t Like Him",
    "description": "The president has turned his eyes towards the biggest platform for criticism: the media.",
    "link": "https://www.huffpost.com/entry/donald-trump-punish-media-critics_n_6883d628e4b09c928ae1d70b",
    "timestamp": "2025-07-25T20:48:47Z"
  },
  {
    "title": "Fake AI Photos Of Trump With Epstein Flood Internet",
    "description": "Fake AI-generated photos and videos purporting to show Donald Trump and convicted sex offender Jeffrey Epstein socializing with underage girls have flooded social media, racking up millions of views, researchers said Friday.",
    "link": "https://www.ibtimes.com/fake-ai-photos-trump-epstein-flood-internet-3779482",
    "timestamp": "2025-07-25T20:48:19Z"
  },
  {
    "title": "Trump Seeks Even Higher Tariffs: 'Between 15 Percent and 50 Percent' on Imports From All Countries",
    "description": "The 10 percent baseline reciprocal tariff rate was bad for America; the 15 percent rate is even worse.",
    "link": "https://reason.com/2025/07/25/trump-seeks-even-higher-tariffs-between-15-percent-and-50-percent-on-imports-from-all-countries/",
    "timestamp": "2025-07-25T20:47:13Z"
  },
  {
    "title": "Trump Birthright Order Blocked Again in New Win for Blue States (Erik Larson/Bloomberg)",
    "description": "Erik Larson / Bloomberg:\nTrump Birthright Order Blocked Again in New Win for Blue States  —  A federal judge in Boston issued the second nationwide block of President Donald Trump's birthright citizenship limits this month as the lawsuits continue, in another…",
    "link": "https://www.memeorandum.com/250725/p91",
    "timestamp": "2025-07-25T20:45:01Z"
  },
  {
    "title": "EXCLUSIVE: Trump's Shooter's Twisted Secret Life — Thomas Crooks, 20, Built Deadly Bombs In His Bedroom And Sharpened His Rifle Aim...Before Attempting To Assassinate The Prez",
    "description": "Thomas Matthew Crooks attempted to kill Donald Trump during a July 2024 rally, but not much is known about the 20-year-old killer.",
    "link": "https://radaronline.com/p/trump-shooter-thomas-crooks-twisted-secret-life-revealed-built-bombs/",
    "timestamp": "2025-07-25T20:45:00Z"
  },
  {
    "title": "What Trump actually means when he proclaims he is 'saving college sports'",
    "description": "Trump signed an executive order establishing national regulations for the NCAA’s NIL program, which top college athletes have relied on for compensation for their playing and endorsement deals.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-nil-executive-order-college-sports-ncaa-rcna220964",
    "timestamp": "2025-07-25T20:44:45Z"
  },
  {
    "title": "Trump says Putin-Zelensky meeting ‘is going to happen’",
    "description": "The Kremlin has insisted such a summit should only take place to finalize a peace deal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622007-trump-putin-zelensky-meeting/",
    "timestamp": "2025-07-25T20:43:48Z"
  },
  {
    "title": "Bolsas de NY fecha em alta, enquanto S&P 500 e Nasdaq renovam recordes",
    "description": "O índice Dow Jones fechou em alta de 0,47%, aos 44.901,92 pontos\nThe post Bolsas de NY fecha em alta, enquanto S&P 500 e Nasdaq renovam recordes appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/mercados/bolsas-de-ny-fecha-em-alta-enquanto-sp-500-e-nasdaq-renovam-recordes/",
    "timestamp": "2025-07-25T20:42:56Z"
  },
  {
    "title": "CBS said ‘The Late Show’ had declined. YouTube viewership paints a different picutre.",
    "description": "CBS' shocking cancellation of The Late Show with Stephen Colbert has come under intense scrutiny since the decision was announced on July 17. Many people, including some of Colbert's colleagues in the late-night universe, have argued that the move was an act …",
    "link": "https://www.tubefilter.com/2025/07/25/cbs-cancels-late-show-stephen-colbert-youtube-viewership/",
    "timestamp": "2025-07-25T20:42:37Z"
  },
  {
    "title": "Trump mixes presidential and personal business on Scotland trip",
    "description": "President Trump will meet with European leaders to discuss trade ahead of a self-imposed August deadline.",
    "link": "https://www.cbsnews.com/news/trump-visits-scotland-golf-courses-meetings-trade/",
    "timestamp": "2025-07-25T20:42:12Z"
  },
  {
    "title": "Artist pulls art from Smithsonian gallery after museum tries to alter her trans Statue of Liberty painting",
    "description": "Michelle Obama's portrait painter Amy Sherald cancels show amid Trump administration's push against leftist ideology.",
    "link": "https://nypost.com/2025/07/25/media/artist-pulls-art-from-smithsonian-gallery-after-museum-tries-to-alter-her-trans-statue-of-liberty-painting/",
    "timestamp": "2025-07-25T20:42:04Z"
  },
  {
    "title": "Trump may fast-track sanctions on Russia",
    "description": "Trump says the US may impose tariffs on Russia’s trade partners before his previously announced 50-day deadline arrives Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622008-trump-russia-sooner-sanctions/",
    "timestamp": "2025-07-25T20:41:42Z"
  },
  {
    "title": "Scandal: WSJ Reports Trump’s Name Appears In Their Article About The Epstein Files",
    "description": "https://babylonbee.com/news/scandal-wsj-reports-trumps-name-appears-in-their-article-about-the-epstein-filesNEW YORK, NY — In what many were calling the greatest political scandal in American history, the Wall Street Journal confirmed that Donald Trump's name…",
    "link": "https://freerepublic.com/focus/f-chat/4330778/posts",
    "timestamp": "2025-07-25T20:38:42Z"
  },
  {
    "title": "Some Republicans push to undo gambling tax hike they passed in Trump's megabill",
    "description": "Some top Republicans are regretting that they inserted a tax hike on gamblers into President Donald Trump’s megabill.",
    "link": "https://www.nbcnews.com/politics/congress/republicans-gambling-tax-hike-trump-megabill-rcna220852",
    "timestamp": "2025-07-25T20:36:25Z"
  },
  {
    "title": "TYT’s Ana Kasparian Lauds MAGA Base for Demanding Trump Come Clean on Epstein",
    "description": "Ana Kasparian commended the MAGA base for continuing to push for the release of the Epstein files despite pushback from President Donald Trump.\nThe post TYT’s Ana Kasparian Lauds MAGA Base for Demanding Trump Come Clean on Epstein first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/tyts-ana-kasparian-lauds-maga-base-for-demanding-trump-come-clean-on-epstein/",
    "timestamp": "2025-07-25T20:35:28Z"
  },
  {
    "title": "Real-time crypto laundering exposes CEX vulnerabilities — Report",
    "description": "New data reveals $3B stolen in 2025 crypto hacks, with funds laundered in minutes—often before hacks are disclosed. Are CEXs prepared to keep up?",
    "link": "https://cointelegraph.com/news/real-time-crypto-laundering-cex-vulnerabilities-report",
    "timestamp": "2025-07-25T20:33:18Z"
  },
  {
    "title": "Trump Birthright Order Blocked Again",
    "description": "\"A federal judge in Boston issued the second nationwide block of President Donald Trump’s birthright citizenship limits this month as the lawsuits continue, in another sign that a recent U.S. Supreme Court decision restricting 'universal",
    "link": "https://politicalwire.com/2025/07/25/trump-birthright-order-blocked-again/",
    "timestamp": "2025-07-25T20:32:57Z"
  },
  {
    "title": "Is Harry Reid’s Ghost Haunting Senate Republicans? Why Else Are They Continuing Reid’s Blockade of Trump Nominees?",
    "description": "Harry Reid, the former Democrat leader of the U.S. Senate, left the Senate in 2017 and died in 2021, but his ghost must still be... Read More\nThe post Is Harry Reid’s Ghost Haunting Senate Republicans? Why Else Are They Continuing Reid’s Blockade of Trump Nom…",
    "link": "https://www.dailysignal.com/2025/07/25/is-harry-reids-ghost-haunting-senate-republicans-else-are-continuing-reids-blockade-trump-nominees/",
    "timestamp": "2025-07-25T20:32:15Z"
  },
  {
    "title": "Rep. Clark accuses President Trump of cover-up over Epstein files",
    "description": "\"This 180 that he's done is a cover-up,\" Rep. Clark, the Democratic House Minority Whip, said about the president.",
    "link": "https://www.wcvb.com/article/katherine-clark-trump-epstein-cover-up-accusation/65513235",
    "timestamp": "2025-07-25T20:31:36Z"
  },
  {
    "title": "Trump admin cracks down on Oregon and Virginia for defying Title IX and women's sports executive order",
    "description": "Linda McMahon and the Deptartment of Education ramped up enforcement of Title IX, with updates on actions against Oregon and Virginia relating to gender ideology.",
    "link": "https://www.foxnews.com/sports/trump-admin-cracks-down-oregon-virginia-defying-title-ix-womens-sports-executive-order",
    "timestamp": "2025-07-25T20:30:25Z"
  },
  {
    "title": "The Good, The Bad, And The Incredibly Stupid In Trump’s AI Action Plan",
    "description": "We’ve spent years documenting the challenges of crafting sensible AI policy, from Biden’s misguided plan, to various state-level attempts at regulation. Now Trump’s AI Action Plan has landed, offering a striking example of how even potentially useful policy i…",
    "link": "https://www.techdirt.com/2025/07/25/the-good-the-bad-and-the-incredibly-stupid-in-trumps-ai-action-plan/",
    "timestamp": "2025-07-25T20:29:39Z"
  },
  {
    "title": "Trump: 'Hamas Didn't Really Want to Make a Deal. I Think They Want to Die'",
    "description": "President Donald Trump confirmed Friday that the U.S. and Israel had ended talks with the Palestinian terrorist group Hamas, due to the organization's intransigence.\nThe post Trump: ‘Hamas Didn’t Really Want to Make a Deal. I Think They Want to Die’ appeared …",
    "link": "https://www.breitbart.com/middle-east/2025/07/25/trump-hamas-didnt-really-want-to-make-a-deal-i-think-they-want-to-die/",
    "timestamp": "2025-07-25T20:29:27Z"
  },
  {
    "title": "The FCC's Paramount/Skydance Decision Aims To Reshape Broadcast Journalism by Bureaucratic Fiat",
    "description": "A few weeks ago, Paramount, which owns CBS, announced that it would pay $16 million to settle a laughable lawsuit in which President Donald Trump claimed the network had committed consumer fraud by editing a pre-election interview with former Vice President K…",
    "link": "https://biztoc.com/x/71701ea969d2ac81",
    "timestamp": "2025-07-25T20:28:31Z"
  },
  {
    "title": "Trump Says He Could Pardon Ghislaine Maxwell But Hasn’t Thought About It",
    "description": "President Donald Trump said he had the ability to pardon Ghislaine Maxwell, the associate of disgraced financier Jeffrey Epstein, in exchange for her cooperation with ongoing investigations but had not yet considered whether to do so.\n“I’m allowed to do it, b…",
    "link": "https://biztoc.com/x/54b32f551d7dca87",
    "timestamp": "2025-07-25T20:28:25Z"
  },
  {
    "title": "\"Baseless?!\"",
    "description": "\"Baseless?!\"\n \nAuthored by James Howard Kunstler,\n\"If you can arrest a former president named Donald Trump, you can arrest a former president named Barack Obama.\"\n- Peachy Keenan on \"X\"\nDon’t you think it’s time for The New York Times to stop using the cliché…",
    "link": "https://biztoc.com/x/471ecc12bae3ce17",
    "timestamp": "2025-07-25T20:28:25Z"
  }
]