[
  {
    "title": "Everybody's pretty much agreed to it, says Trump on Gaza peace plan",
    "description": "US President Donald Trump stated the Gaza peace plan needs no changes. He confirmed positive discussions with Hamas and other nations are underway. Hostage release is expected soon, possibly within days. This initiative aims to end the Gaza conflict and bring…",
    "link": "https://economictimes.indiatimes.com/news/defence/everybodys-pretty-much-agreed-to-it-says-trump-on-gaza-peace-plan/articleshow/124328262.cms",
    "timestamp": "2025-10-06T00:52:31Z"
  },
  {
    "title": "ICE rolls Portland protester away on flatbed cart as Trump says city is 'burning to the ground'",
    "description": "No-nonsense Immigrations and Customs Enforcement agents in Portland wheeled a protester away from a demonstration on a flatbed cart when he refused to walk himself. The agency shared footage of the shock interaction after President Donald Trump noted the city…",
    "link": "https://freerepublic.com/focus/f-chat/4344573/posts",
    "timestamp": "2025-10-06T00:52:27Z"
  },
  {
    "title": "Trump appears to reveal another strike on alleged cartel drug boat",
    "description": "President Donald Trump appeared to reveal Sunday that the U.S. had carried out another strike on an alleged drug cartel boat from Venezuela.",
    "link": "https://abcnews.go.com/Politics/trump-appears-reveal-strike-alleged-cartel-drug-boat/story?id=126237676",
    "timestamp": "2025-10-06T00:45:40Z"
  },
  {
    "title": "Jimmy Kimmel’s Suspension Launches Congressional Investigation",
    "description": "On September 17, fans were shocked to learn that Jimmy Kimmel and his Emmy-winning show had been suspended indefinitely by Disney and ABC. The move came after ABC’s two largest affiliate broadcasters, NexStar Media and Sinclair Broadcasting, announced they wo…",
    "link": "https://insidethemagic.net/2025/10/jimmy-kimmels-suspension-launches-congressional-investigation-against-brendan-carr-ks1/",
    "timestamp": "2025-10-06T00:45:34Z"
  },
  {
    "title": "Stephen Miller’s Own Cousin Disowned Him in Wrenching Post",
    "description": "Stephen Miller’s own cousin has disowned him for becoming “the face of evil” as the architect of the Trump administration’s hardline immigration crackdown...",
    "link": "https://www.thedailybeast.com/stephen-millers-own-cousin-disowned-him-in-wrenching-post/",
    "timestamp": "2025-10-06T00:44:03Z"
  },
  {
    "title": "Trump Tells Google & YouTube TV To Restore Univision Access: “Very Bad For Republicans”",
    "description": "In a Truth Social post made yesterday, President Donald Trump pressed Google-owned YouTube TV to restore access to Univision, citing the Spanish-language broadcast network’s favorable coverage of him and Republicans as reason for doing so.\n“I hope Univision, …",
    "link": "https://biztoc.com/x/8457e8e4b9758577",
    "timestamp": "2025-10-06T00:39:20Z"
  },
  {
    "title": "Trump: Fannie Mae, Freddie Mac to get Big Homebuilders going",
    "description": "United States President Donald Trump urged two government-sponsored mortgage giants, the Federal National Mortgage Association (Fannie Mae) and the Federal Home Loan Mortgage Corporation (Freddie Mac)...",
    "link": "https://biztoc.com/x/26528427fc169bad",
    "timestamp": "2025-10-06T00:39:03Z"
  },
  {
    "title": "US strikes on Venezuelan boats ‘an act of kindness’ – Trump",
    "description": "US President Donald Trump has claimed that strikes on alleged Venezuelan cartel boats neutralized a key smuggling route Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625963-strikes-on-venezuelan-boats-act/",
    "timestamp": "2025-10-06T00:34:56Z"
  },
  {
    "title": "Trump Is Successfully Bullying Netanyahu",
    "description": "The more the president puts the prime minister in his place, the more likely it is that the Gaza war will end.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/10/trump-netanyahu-gaza/684462/",
    "timestamp": "2025-10-06T00:28:08Z"
  },
  {
    "title": "Portland police chief touts 'crowd support' approach as ICE facility faces ongoing violence",
    "description": "Portland Police Chief Bob Day responded to federal criticism of police handling of anti-ICE protests as Trump administration plans National Guard deployment.",
    "link": "https://www.foxnews.com/us/portland-police-chief-touts-crowd-support-approach-ice-facility-faces-ongoing-violence",
    "timestamp": "2025-10-06T00:28:04Z"
  },
  {
    "title": "Trump sends troops from California to Portland after court denies deployment",
    "description": "The move appears aimed at circumventing a court order that barred deploying troops in Portland.",
    "link": "https://www.bbc.com/news/articles/c740elm70z7o",
    "timestamp": "2025-10-06T00:24:34Z"
  },
  {
    "title": "Melania Trump channels ‘Top Gun’ in leather bomber for naval station visit",
    "description": "The first lady made an appearance at Naval Station Norfolk in Norfolk, Va., to celebrate the US Navy's 250th anniversary over the weekend.",
    "link": "https://pagesix.com/2025/10/05/style/melania-trump-channels-top-gun-in-leather-bomber-for-naval-station-visit/",
    "timestamp": "2025-10-06T00:17:54Z"
  },
  {
    "title": "Watch: Will President Trump get a Nobel Peace Prize?",
    "description": "The BBC asked Americans in Washington what they think the US president needs to do to earn the prestigious award.",
    "link": "https://www.bbc.com/news/videos/cj6xwz5x8exo",
    "timestamp": "2025-10-06T00:17:03Z"
  },
  {
    "title": "Using Helicopters And Chemical Agents, Immigration Agents Become Increasingly Aggressive In Chicago",
    "description": "Activists, residents and elected leaders say increasingly combative tactics used by federal immigration agents are sparking violence and fueling neighborhood tensions.",
    "link": "https://www.huffpost.com/entry/federal-crackdown-chicago_n_68e30937e4b08634f761ce35",
    "timestamp": "2025-10-06T00:15:02Z"
  },
  {
    "title": "Trump pushing Israel and Hamas for Gaza deal within days - Axios",
    "description": "Trump pushing Israel and Hamas for Gaza deal within daysAxios Israel-Gaza peace deal: Donald Trump urges all sides to ‘move fast’; warns of ‘massive bloodshed’The Times of India Exclusive: Trump says Hamas faces ‘complete obliteration’ if it insists on stayin…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179672620",
    "timestamp": "2025-10-06T00:12:57Z"
  },
  {
    "title": "Why Trump’s speech to US military top brass was such a disaster",
    "description": "The president of the United States seemingly does not understand what the military is forNo dictator or would-be dictator on day one has ever assembled before him in one room the entire senior officer corps of his armed forces in order to have them belittled …",
    "link": "https://freerepublic.com/focus/f-chat/4344566/posts",
    "timestamp": "2025-10-06T00:12:53Z"
  },
  {
    "title": "Republicans Warn Of Pain Ahead As US Shutdown Faces Second Week",
    "description": "Trump administration officials and top Republicans warned Sunday that Americans will increasingly feel the pain of an ongoing US government shutdown as most federal operations remained shuttered.",
    "link": "https://www.ibtimes.com/republicans-warn-pain-ahead-us-shutdown-faces-second-week-3785640",
    "timestamp": "2025-10-06T00:12:10Z"
  },
  {
    "title": "Hollywood’s ‘Job’ Is To Explain Democracy and Warn Americans That Trump Is An ‘Autocrat,’ Director Rob Reiner Claims",
    "description": "Veteran director Rob Reiner told MSNBC he is worried America is one year away from becoming a hellish \"full-on autocracy\" under President Donald Trump\nThe post Hollywood’s ‘Job’ Is To Explain Democracy and Warn Americans That Trump Is An ‘Autocrat,’ Director …",
    "link": "https://www.mediaite.com/media/hollywoods-job-is-to-explain-democracy-and-warn-americans-that-trump-is-an-autocrat-director-rob-reiner-claims/",
    "timestamp": "2025-10-06T00:11:02Z"
  },
  {
    "title": "Putin says Tomahawk supply to Ukraine would destroy U.S. relations",
    "description": "MOSCOW, Oct 5 (Reuters) - Russian President Vladimir Putin said that if the United States supplied Tomahawk missiles to Ukraine for long-range strikes deep into Russia then it would lead to the destruction of Moscow's relationship with Washington.Less than tw…",
    "link": "https://freerepublic.com/focus/f-news/4344565/posts",
    "timestamp": "2025-10-06T00:08:58Z"
  },
  {
    "title": "150 U.S. Health Workers Demand Trump End Support For Israel's Destruction Of Gaza",
    "description": "The workers, all of whom volunteered in Gaza's hospitals, hope to share their harrowing testimony with the president to usher in a permanent ceasefire.",
    "link": "https://www.huffpost.com/entry/american-health-workers-demand-trump-end-israel-gaza_n_68e2f9a4e4b0b59bd0eeb55a",
    "timestamp": "2025-10-06T00:06:53Z"
  },
  {
    "title": "Trump sends Californian National Guard troops to Oregon",
    "description": "US President Donald Trump deploys at least 200 Californian National Guard troops to Portland after a judge blocked him from deploying local troops in Oregon.",
    "link": "https://www.abc.net.au/news/2025-10-06/donald-trump-sends-californian-national-guard-troops-to-oregon/105855384",
    "timestamp": "2025-10-06T00:05:23Z"
  },
  {
    "title": "Albanese’s speech to UK Labour wasn’t partisan — it was factional",
    "description": "Why has Albanese stuck his neck out for the incumbent? Because Starmer has, in many, ways emulated Albanese. \nThe post Albanese’s speech to UK Labour wasn’t partisan — it was factional appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/10/06/anthony-albanese-uk-labour-keir-starmer/",
    "timestamp": "2025-10-06T00:03:03Z"
  },
  {
    "title": "Stephen Miran Goes to War with the Federal Reserve",
    "description": "The Trump appointee wants super-sized rate cuts. Federal Reserve Governor Stephen Miran, the new kid at the Eccles Building, wants 50-basis-point interest rate cut. When does he want them? Now! Since arriving at the US central bank, President Donald Trump’s a…",
    "link": "https://freerepublic.com/focus/f-news/4344563/posts",
    "timestamp": "2025-10-06T00:02:01Z"
  },
  {
    "title": "Trump calls on Fannie Mae and Freddie Mac to get big homebuilders 'going'",
    "description": "President Donald Trump on Sunday urged U.S. mortgage financing companies Fannie Mae and Freddie Mac to \"get Big Homebuilders going,\" saying without providing...",
    "link": "https://finance.yahoo.com/news/trump-calls-fannie-mae-freddie-000111824.html",
    "timestamp": "2025-10-06T00:01:11Z"
  },
  {
    "title": "UK Mainstream MELTDOWN as Israeli Gov’t Invites Tommy Robinson to Holy Land",
    "description": "The UK establishment Jewish lobby went into absolute meltdown over the weekend as Israeli Diaspora Minister Amichai Chikli invited British patriot Tommy Robinson to visit Israel.\nThe post UK Mainstream MELTDOWN as Israeli Gov’t Invites Tommy Robinson to Holy …",
    "link": "https://www.thegatewaypundit.com/2025/10/uk-mainstream-meltdown-as-israeli-govt-invites-tommy/",
    "timestamp": "2025-10-06T00:00:40Z"
  },
  {
    "title": "Volunteer scientists work ‘nights and weekends’ to guide vaccine advice in US",
    "description": "Medical specialists, wary of the guidance provided by Trump’s team, offer up their own advice independently of the government.",
    "link": "https://www.nature.com/articles/d41586-025-03181-7",
    "timestamp": "2025-10-06T00:00:00Z"
  },
  {
    "title": "Another court fight brews as Trump sends California National Guard troops to Oregon",
    "description": "California Gov. Gavin Newsom said Sunday he would go to court to fight the move by President Donald Trump to send National Guard members from his state to Oregon, where protesters have gathered near a U.S. Immigration and Customs Enforcement building in Portl…",
    "link": "https://biztoc.com/x/37122fc200f450cb",
    "timestamp": "2025-10-05T23:54:24Z"
  },
  {
    "title": "Judge appeals ruling by court to block sending troops to Portland",
    "description": "The Justice Department has appealed a ruling by a lower court judge blocking the mobilization of 200 National Guard troops to Portland.",
    "link": "https://www.upi.com/Top_News/US/2025/10/05/judge-appeals-troops-blocked-in-portland/4471759707783/",
    "timestamp": "2025-10-05T23:53:33Z"
  },
  {
    "title": "Defense contractors brace for climate threats despite Trump's denials",
    "description": "Washington DC (UPI) Oct 2, 2025 \n\n\n President Donald Trump repeatedly calls climate change a \"hoax,\" but the nation's five largest defense contractors say they are challenged to balance the Earth's warming with operational demands, technological adaptations a…",
    "link": "https://www.spacewar.com/reports/Defense_contractors_brace_for_climate_threats_despite_Trumps_denials_999.html",
    "timestamp": "2025-10-05T23:53:02Z"
  },
  {
    "title": "Shield or Spark? The U.S. Golden Dome and the New Missile Arms Race",
    "description": "Budapest, Hungary (SPX) Oct 06, 2025\n\n\nThe launch of the US 'Golden Dome' missile defence initiative has already set in motion ripple effects across the globe. Rival nations are considering their own layered missile defence architectures, and experts warn thi…",
    "link": "https://www.spacewar.com/reports/Shield_or_Spark_The_U_S__Golden_Dome_and_the_New_Missile_Arms_Race_999.html",
    "timestamp": "2025-10-05T23:53:02Z"
  },
  {
    "title": "Trump wants Nobel but 'forgotten' peacemakers more likely, experts say",
    "description": "Stockholm (AFP) Oct 2, 2025\n\n\n US President Donald Trump has made it clear he wants the Nobel Peace Prize when it is announced next week but experts predict he has little chance against those toiling on forgotten causes outside the limelight. \n\nThe prestigiou…",
    "link": "https://www.spacewar.com/reports/Trump_wants_Nobel_but_forgotten_peacemakers_more_likely_experts_say_999.html",
    "timestamp": "2025-10-05T23:53:02Z"
  },
  {
    "title": "EU eyes building 'drone wall': question is, what is it?",
    "description": "Copenhagen (AFP) Oct 2, 2025\n\n\n European Union leaders are discussing setting up a \"drone wall\" of defences after high-profile air incursions by Russia. \n\nBut the plan appears to mean different things to different countries, and not everyone seems entirely co…",
    "link": "https://www.spacewar.com/reports/EU_eyes_building_drone_wall_question_is_what_is_it_999.html",
    "timestamp": "2025-10-05T23:53:02Z"
  },
  {
    "title": "Mr. President: Nix the tariff ‘dividend’ checks, shrink the deficit instead",
    "description": "As if President Joe Biden's COVID \"stimulus\" checks weren’t bad enough, his successor is floating the idea of “tariff rebates” — when Uncle Sam is already $37 trillion in the hole.",
    "link": "https://nypost.com/2025/10/05/opinion/mr-president-nix-the-tariff-dividend-checks-shrink-the-deficit-instead/",
    "timestamp": "2025-10-05T23:52:58Z"
  },
  {
    "title": "Trump just 'turbocharged' his troop deployment problems by 'ignoring the facts': analyst",
    "description": "President Donald Trump's legal problems over deploying National Guard troops to various cities got much worse this week, according to one analyst. A federal judge in Oregon on Saturday issued an order prohibiting the Trump administration from deploying Oregon…",
    "link": "https://www.rawstory.com/trump-2674156726/",
    "timestamp": "2025-10-05T23:51:29Z"
  },
  {
    "title": "Another court fight brews as Trump sends California National Guard troops to Oregon",
    "description": "California Gov. Gavin Newsom said Sunday he would go to court to fight the move by President Donald Trump to send National Guard members from his state to Oregon, where protesters have gathered near a U.S. Immigration and Customs Enforcement building in Portl…",
    "link": "https://www.pbs.org/newshour/politics/another-court-fight-brews-as-trump-sends-california-national-guard-troops-to-oregon",
    "timestamp": "2025-10-05T23:46:20Z"
  },
  {
    "title": "Trump, 79, Admits He'll ‘Probably’ Fall Down Stairs One Day",
    "description": "The president began his speech to Navy sailors, who are going unpaid due to the government shutdown, 45 minutes late.",
    "link": "https://www.thedailybeast.com/trump-79-admits-hell-probably-fall-down-stairs-one-day/",
    "timestamp": "2025-10-05T23:44:22Z"
  },
  {
    "title": "Government shutdown entering sixth day as Republicans and Democrats remain at an impasse",
    "description": "Republican and Democratic lawmakers at an impasse on reopening the federal government provided few public signs Sunday of meaningful negotiations taking place to end what is about to be a six-day shutdown — with President Donald Trump saying that layoffs are …",
    "link": "https://www.wpxi.com/news/local/government-shutdown-entering-sixth-day-republicans-democrats-remain-an-impasse/4NGVL626HBAYNGXQQUU6C6VWLU/",
    "timestamp": "2025-10-05T23:43:29Z"
  },
  {
    "title": "BBC finds Russian guards, Iranian trucks and rusting railway on Trump's Caucasus peace route",
    "description": "The planned Trump Route in the South Caucasus could reshape the geopolitics of a region that borders Russia and Iran.",
    "link": "https://www.bbc.com/news/articles/c78nr234v5mo",
    "timestamp": "2025-10-05T23:43:19Z"
  },
  {
    "title": "Illegal Immigrants Are Already Getting Health Care Under Donald Trump",
    "description": "The program financing ER care for illegal immigrants has been around for four decades, and not even Trump wants to take it away.",
    "link": "https://www.thebulwark.com/p/government-shutdown-emergency-medical-care-illegal-immigrants",
    "timestamp": "2025-10-05T23:43:03Z"
  },
  {
    "title": "Rubio says Gaza war has hurt Israel's global support. How has that played out at the UN?",
    "description": "UNITED NATIONS, Oct 5 (Reuters) - The United States cannot ignore the impact the war in Gaza has had on Israel's global standing, U.S. Secretary of State Marco Rubio said on Sunday, as Israel's diplomatic isolation mounts despite Washington's attempts to shie…",
    "link": "https://freerepublic.com/focus/f-news/4344555/posts",
    "timestamp": "2025-10-05T23:37:01Z"
  },
  {
    "title": "Bad Bunny fires back at Super Bowl halftime show critics",
    "description": "Bad Bunny has mocked those criticising the decision to choose him as the Super Bowl halftime show headliner by joking that they \"have four months to learn Spanish\" before his performance next year.",
    "link": "https://www.perthnow.com.au/entertainment/celebrity-gossip/bad-bunny-fires-back-at-super-bowl-halftime-show-critics-c-20249877",
    "timestamp": "2025-10-05T23:34:02Z"
  },
  {
    "title": "Hamas calls for swift hostage-prisoner swap as Trump urges quick talks",
    "description": "The push follows Hamas' positive response to Trump's roadmap for an end to the fighting and the release of captives in exchange for Palestinians held in Israeli jails.",
    "link": "https://www.japantimes.co.jp/news/2025/10/06/world/hamas-israel-gaza-talks/",
    "timestamp": "2025-10-05T23:30:00Z"
  },
  {
    "title": "Trump moves Calif. troops to Oregon",
    "description": "President Donald Trump is sending California National Guard members to Oregon after a judge temporarily blocked his administration from deploying that state's guard to Portland, and Gov. Gavin Newsom pledged Sunday to fight the move in court.",
    "link": "https://www.bostonherald.com/2025/10/05/trump-moves-calif-troops-to-oregon/",
    "timestamp": "2025-10-05T23:29:18Z"
  },
  {
    "title": "Senator Tells Voters Exactly Who’s To Blame For Government Shutdown: 'Tsunami Of Trump's Creation'",
    "description": "Sen. Cory Booker pleaded with Trump to “come to the table” and help Americans.",
    "link": "https://www.huffpost.com/entry/senator-cory-booker-trump-government-shutdown_n_68e28fcee4b060c19f1abb53",
    "timestamp": "2025-10-05T23:28:56Z"
  },
  {
    "title": "Dana White promises 'greatest fight card ever assembled' for potential White House UFC event in 2026",
    "description": "UFC CEO Dana White predicted the June 2026 White House fight card will be the \"greatest ever assembled,\" with fighters lobbying to participate in the historic event.",
    "link": "https://www.foxnews.com/sports/dana-white-promises-greatest-fight-card-ever-assembled-potential-white-house-ufc-event-2026",
    "timestamp": "2025-10-05T23:28:14Z"
  },
  {
    "title": "Pete Hegseth Blasts Woke Diversity at Navy's 250th Anniversary",
    "description": "War Secretary Pete Hegseth addressed a lively audience of U.S. Navy Sailors in Virginia to commemorate the military branch's 250th anniversary, reiterating President Donald Trump's emphasis on \"America first, and peace through strength\" and blasting diversity…",
    "link": "https://www.breitbart.com/national-security/2025/10/05/pete-hegseth-blasts-woke-diversity-at-navys-250th-anniversary/",
    "timestamp": "2025-10-05T23:26:54Z"
  },
  {
    "title": "Government shutdown entering sixth day as Republicans and Democrats remain at an impasse",
    "description": "WASHINGTON (AP) — Republican and Democratic lawmakers at an impasse on reopening the federal government provided few public signs Sunday of meaningful negotiations taking place to end<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/government-shutdown…",
    "link": "https://whdh.com/news/government-shutdown-entering-sixth-day-as-republicans-and-democrats-remain-at-an-impasse/",
    "timestamp": "2025-10-05T23:25:54Z"
  },
  {
    "title": "White House spokesperson calls 'Saturday Night Live' a 'waste' of time after season premiere",
    "description": "White House spokesperson Abigail Jackson gave a brief response to Entertainment Weekly about NBC’s “Saturday Night Live\" after its 51st season premiere.",
    "link": "https://www.foxnews.com/media/white-house-spokesperson-calls-saturday-night-live-waste-time-after-season-premiere",
    "timestamp": "2025-10-05T23:24:19Z"
  },
  {
    "title": "FACT FOCUS: Democrats did not shut down the government to give health care to ‘illegal immigrants’",
    "description": "President Donald Trump and other high-ranking Republicans claim Democrats forced the government shutdown fight because they want to give free health care to immigrants in the U.S. illegally. Democrats are trying to extend tax credits that make health insuranc…",
    "link": "https://freerepublic.com/focus/f-news/4344551/posts",
    "timestamp": "2025-10-05T23:23:50Z"
  },
  {
    "title": "China Is Beating the US in the Battle for Energy Export Dominance",
    "description": "China’s exports of clean energy technology hit a record in August, with $20 billion shipped globally.",
    "link": "https://financialpost.com/pmn/business-pmn/china-is-beating-the-us-in-the-battle-for-energy-export-dominance",
    "timestamp": "2025-10-05T23:22:48Z"
  },
  {
    "title": "Harvard needs to answer for ‘hunting rats’ prof who shot near a synagogue",
    "description": "When authorities caught up with the shooter, Carlos Portugal Gouvea, he said he was \"hunting rats.\"",
    "link": "https://nypost.com/2025/10/05/opinion/harvard-needs-to-answer-for-hunting-rats-prof-who-shot-near-a-synagogue/",
    "timestamp": "2025-10-05T23:22:42Z"
  },
  {
    "title": "Is Sanae Takaichi Japan’s Margaret Thatcher — or its next Liz Truss?",
    "description": "The rise of Japan’s first female leader is being hailed as a transformative moment for Japan. But in truth it may be more adaptation than reinvention.",
    "link": "https://theconversation.com/is-sanae-takaichi-japans-margaret-thatcher-or-its-next-liz-truss-266478",
    "timestamp": "2025-10-05T23:20:41Z"
  },
  {
    "title": "Labor retains big lead in Newspoll and all other federal polls",
    "description": "The latest federal opinion polling has put Labor clearly ahead of the struggling Liberals. Support for One Nation is stronger than for the Greens in some results.",
    "link": "https://theconversation.com/labor-retains-big-lead-in-newspoll-and-all-other-federal-polls-266376",
    "timestamp": "2025-10-05T23:15:32Z"
  },
  {
    "title": "China hawks grow queasy over Trump’s push for deals with Beijing",
    "description": "As Trump pursues a trade pact with the U.S.’s biggest economic and strategic rival, advocates of a tougher China policy fear they’re being sidelined inside the administration.",
    "link": "https://www.japantimes.co.jp/news/2025/10/06/asia-pacific/politics/china-hawks-trump-deal/",
    "timestamp": "2025-10-05T23:15:00Z"
  },
  {
    "title": "'Never seen him this scared': Trump's behavior analyzed amid turmoil and health concerns - NewsBreak",
    "description": "A journalist who has closely covered President Donald Trump over the last decade says he's \"never seen him this scared\" before. Salon's Brian Karem details",
    "link": "https://www.newsbreak.com/share/4271711523297-never-seen-him-this-scared-trump-s-behavior-analyzed-amid-turmoil-and-health-concerns?s=a2&amp;share_destination_id=MTk3NDMyNTQxLTE3NTk2NDE2Mzc5Mzg%3D&amp;pd=0DMPDpUv&amp;hl=en_US&amp;send_time=1759641637&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control",
    "timestamp": "2025-10-05T23:14:10Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,320",
    "description": "Here are the key events from day 1,320 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/10/5/russia-ukraine-war-list-of-key-events-day-1320",
    "timestamp": "2025-10-05T23:12:28Z"
  },
  {
    "title": "Pritzker Claims Trump ‘Incited’ Anti-ICE Protestors to Become Violent: ‘They Make It Look Like It’s a War Zone’",
    "description": "Illinois Gov. JB Pritzker continued to bash President Trump for sending ICE agents to Chicago, saying protestors have been \"incited to want to do something\"\nThe post Pritzker Claims Trump ‘Incited’ Anti-ICE Protestors to Become Violent: ‘They Make It Look Lik…",
    "link": "https://www.mediaite.com/media/news/pritzker-claims-trump-incited-anti-ice-protestors-to-become-violent-they-make-it-look-like-its-a-war-zone/",
    "timestamp": "2025-10-05T23:11:08Z"
  },
  {
    "title": "Trump Vows to Get Service Members 'Every Last Penny' During Government Shutdown",
    "description": "President Donald Trump vowed that he would get United States military service members \"every last penny\" as the government shutdown stretched into its fifth day.\nThe post Trump Vows to Get Service Members ‘Every Last Penny’ During Government Shutdown appeared…",
    "link": "https://www.breitbart.com/politics/2025/10/05/trump-vows-to-get-service-members-every-last-penny-during-government-shutdown/",
    "timestamp": "2025-10-05T23:10:46Z"
  },
  {
    "title": "Hakeem Jeffries: ‘No Democrat on Capitol Hill’ is pushing for health care to undocumented immigrants - NewsBreak",
    "description": "House Minority Leader Hakeem Jeffries (D-N.Y.) addresses the claim laid out by Vice President JD Vance, House Speaker Mike Johnson (R-La.) and other Republ",
    "link": "https://www.newsbreak.com/share/4274793642331-hakeem-jeffries-no-democrat-on-capitol-hill-is-pushing-for-health-care-to-undocumented-immigrants?s=a2&amp;share_destination_id=MTk3MTAwNzA5LTE3NTk3MDU2NDY3Njg%3D&amp;pd=0DL0thPw&amp;hl=en_US&amp;send_time=1759705646&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.37.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-10-05T23:10:27Z"
  },
  {
    "title": "US considers bailout for soybean farmers",
    "description": "US President Donald Trump is considering a bailout of at least $10 billion to help the country’s soybean farmers survive a boycott from China.\nThe humble soybean has become a flashpoint in the trade war between the world’s two largest economies after Beijing …",
    "link": "https://biztoc.com/x/851b595464754f93",
    "timestamp": "2025-10-05T23:10:08Z"
  },
  {
    "title": "Rob Reiner Says U.S Will Become An ‘Autocracy’ If Trump Is Allowed to ‘Control the Media’ and ‘Commandeer the Election’: ‘We Have a Year’ to Stop Him",
    "description": "During a recent appearance on MSNBC, Oscar-nominated director Rob Reiner issued a call to action against Donald Trump. He said it is “our job now” as influential voices to fight against the president’s insertion of the National Guard into major cities, as wel…",
    "link": "https://variety.com/2025/film/news/rob-reiner-autocracy-trump-control-media-election-1236540712/",
    "timestamp": "2025-10-05T23:09:11Z"
  },
  {
    "title": "'Massive bloodshed will follow': Trump ratchets up pressure on upcoming Israel-Hamas talks",
    "description": "President Donald Trump ratcheted up the pressure on Monday's peace negotiations between Israel and Hamas by threatening that \"massive bloodshed will follow\" if a deal is not struck soon. \"There have been very positive discussions with Hamas, and Countries fro…",
    "link": "https://www.rawstory.com/trump-2674156705/",
    "timestamp": "2025-10-05T23:03:55Z"
  },
  {
    "title": "Trump tells troops 'every last penny' coming despite ongoing government shutdown affecting military pay",
    "description": "Government shutdown freezes military paychecks as President Donald Trump assures troops aboard USS Harry S. Truman they will get back pay and 3.8% raise.",
    "link": "https://www.foxnews.com/politics/trump-tells-troops-every-last-penny-coming-despite-ongoing-government-shutdown-affecting-military-pay",
    "timestamp": "2025-10-05T23:02:19Z"
  },
  {
    "title": "Monzo Weighs New Attempt at Landing US Banking License",
    "description": "British FinTech Monzo is reportedly weighing a new application for a U.S. banking license. The company is considering restarting its plans to become a U.S. lender as it tries to speed its expansion in America, the Financial Times (FT) reported Sunday (Oct. 5)…",
    "link": "http://www.pymnts.com/news/digital-banking/2025/monzo-weighs-new-attempt-at-landing-us-banking-license/",
    "timestamp": "2025-10-05T23:00:58Z"
  },
  {
    "title": "“The Enigma of April Fool’s Day: Trump’s Hidden War to Save the Republic” – New from David Clements",
    "description": "The Enigma of April Fool’s Day: Trump’s Hidden War to Save the Republic – New from David Clements The following is the latest from former Professor and Attorney David Clements.  See transcript below: A SHADOW ENGULFS OUR REPUBLIC, its sacred vote plundered fo…",
    "link": "https://joehoft.com/the-enigma-of-april-fools-day-trumps-hidden-war-to-save-the-republic-new-from-david-clements/",
    "timestamp": "2025-10-05T23:00:35Z"
  },
  {
    "title": "The 13th Largest Army in World Is Unleashing Violence in Chicago",
    "description": "As federal agents kill and use extreme force in Chicago, their budget surges.",
    "link": "https://inthesetimes.com/article/ice-immigration-chicago-trump-broadview",
    "timestamp": "2025-10-05T23:00:00Z"
  },
  {
    "title": "Wall Street’s Hottest Clean-Energy Bet Hits a Ceiling",
    "description": "A couple of years ago, a cross-section of Wall Street was highly bullish on the community solar sector, with some predicting that it was poised to become the most prevalent model of residential solar power distribution in the United States. First unveiled abo…",
    "link": "https://oilprice.com/Alternative-Energy/Solar-Energy/Wall-Streets-Hottest-Clean-Energy-Bet-Hits-a-Ceiling.html",
    "timestamp": "2025-10-05T23:00:00Z"
  },
  {
    "title": "What to know about meaning of Hegseth's tattoos",
    "description": "Rumors about Hegseth's tattoos have consistently circulated online since Donald Trump nominated him as defense secretary.",
    "link": "https://www.snopes.com//news/2025/10/05/hegseth-nazi-tattoos/",
    "timestamp": "2025-10-05T23:00:00Z"
  },
  {
    "title": "Trump On A Dollar? Treasury Is One Step Closer To Approving 2026 Trump Coin",
    "description": "The U.S. Treasury Department has taken the next step toward introducing a 2026 commemorative $1 coin featuring President Donald J. Trump for America's 250th Anniversary.",
    "link": "https://www.forbes.com/sites/dougmelville/2025/10/05/trump-on-a-dollar-treasury-is-one-step-closer-to-approving-2026-trump-coin/",
    "timestamp": "2025-10-05T22:59:47Z"
  },
  {
    "title": "Hakeem Jeffries: ‘No Democrat on Capitol Hill’ is pushing for health care to undocumented immigrants - NewsBreak",
    "description": "House Minority Leader Hakeem Jeffries (D-N.Y.) addresses the claim laid out by Vice President JD Vance, House Speaker Mike Johnson (R-La.) and other Republ",
    "link": "https://www.newsbreak.com/share/4274793642331-hakeem-jeffries-no-democrat-on-capitol-hill-is-pushing-for-health-care-to-undocumented-immigrants?s=a2&amp;share_destination_id=MTI5MzEyMjE2LTE3NTk3MDUxNTIxNDM%3D&amp;pd=08ka0uBv&amp;hl=en_US&amp;send_time=1759705152&amp;share_comment_id=t3o5x54k1ui5&amp;actBtn=shareButton&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-05T22:59:40Z"
  },
  {
    "title": "Israel strikes Gaza, killing 24 before Egypt talks on Trump ceasefire plan",
    "description": "Israel and Hamas set to hold indirect talks on Monday to discuss a US-led initiative largely accepted by both sides.",
    "link": "https://www.aljazeera.com/news/2025/10/5/israel-strikes-gaza-killing-24-before-egypt-talks-on-trump-ceasefire-plan",
    "timestamp": "2025-10-05T22:58:37Z"
  },
  {
    "title": "Trump: UFC fights to take place at the White House in June | Honolulu Star-Advertiser",
    "description": "President Donald Trump said on Sunday that a previously announced Ultimate Fighting Championship event at the White House will take place on June 14 next year, which will be the president’s 80th birthday.",
    "link": "https://www.staradvertiser.com/2025/10/05/sports/sports-breaking/trump-ufc-fights-to-take-place-at-the-white-house-in-june/",
    "timestamp": "2025-10-05T22:56:22Z"
  },
  {
    "title": "Shutdown Kills Key Federal Cybersecurity Information-Sharing Program",
    "description": "The 2015 Cybersecurity Information Sharing Act provided a legal framework for companies to share data with the government, but Congress failed to renew it before the shutdown.\nDon't miss out on our latest stories. Add PCMag as a preferred source on Google.Ami…",
    "link": "https://uk.pcmag.com/security/160452/shutdown-kills-key-federal-cybersecurity-information-sharing-program",
    "timestamp": "2025-10-05T22:55:16Z"
  },
  {
    "title": "Shutdown Kills Key Federal Cybersecurity Information-Sharing Program",
    "description": "The 2015 Cybersecurity Information Sharing Act provided a legal framework for companies to share data with the government, but Congress failed to renew it before the shutdown.\nDon't miss out on our latest stories. Add PCMag as a preferred source on Google.Ami…",
    "link": "https://me.pcmag.com/en/security/32646/shutdown-kills-key-federal-cybersecurity-information-sharing-program",
    "timestamp": "2025-10-05T22:55:16Z"
  },
  {
    "title": "Lawyer warns Trump just 'empowered' Stephen Miller with 'striking' national security memo",
    "description": "President Donald Trump issued a \"striking\" national security memo recently that would allow the administration to go after American citizens using the same tools the country uses to protect itself from foreign adversaries, according to one analyst. Ryan Goodm…",
    "link": "https://www.rawstory.com/ryan-goodman-2674156666/",
    "timestamp": "2025-10-05T22:53:14Z"
  },
  {
    "title": "India wants to lure its best minds back from the US - but it won't be easy",
    "description": "Driving reverse migration from the US at scale will require a concerted effort that's currently missing, experts say.",
    "link": "https://www.bbc.com/news/articles/c1792qwg85qo",
    "timestamp": "2025-10-05T22:52:47Z"
  },
  {
    "title": "Trump warns of 'massive bloodshed' if Hamas fails to agree to peace deal: 'MOVE FAST'",
    "description": "President Donald Trump posted on social media minutes before a Hamas peace proposal deadline, warning of massive bloodshed if talks fail.",
    "link": "https://www.foxnews.com/politics/trump-warns-massive-bloodshed-hamas-fails-agree-peace-deal-move-fast",
    "timestamp": "2025-10-05T22:36:44Z"
  },
  {
    "title": "Trump considers massive bailout of at least $10 billion for American farmers hurt by his trade war (CNN)",
    "description": "CNN:\nTrump considers massive bailout of at least $10 billion for American farmers hurt by his trade war  —  American farmers are having a tough year, in no small part because of President Donald Trump's trade war.  Now, the White House is gearing up to extend…",
    "link": "https://www.memeorandum.com/251005/p59",
    "timestamp": "2025-10-05T22:35:00Z"
  },
  {
    "title": "Rob Reiner Predicts 1 Year Before ‘Democracy Completely Leaves,’ America, Military at Midterm Polling Booths | Video",
    "description": "The United States has \"about a year\" before \"democracy completely leaves us,\" director Rob Reiner told Ali Velshi on MSNBC Sunday. Reiner cited recent deployments of National Guard soldiers to Portland, Oregon, and Chicago, Illinois, as part of the basis for …",
    "link": "https://www.thewrap.com/rob-reiner-year-democracy-america-military-midterm-polling-booths-video/",
    "timestamp": "2025-10-05T22:34:53Z"
  },
  {
    "title": "Hamas readies for Gaza talks that US hopes will halt war, free hostages",
    "description": "CAIRO/JERUSALEM/CAIRO/WASHINGTON (Reuters) -Hamas officials arrived in Egypt on Sunday ahead of talks with Israel that the U.S. hopes will lead to a halt in ...",
    "link": "https://www.yahoo.com/news/articles/hamas-readies-gaza-talks-us-223447615.html",
    "timestamp": "2025-10-05T22:34:47Z"
  },
  {
    "title": "Trump Credits Himself For Predicting Threat of Osama Bin Laden in One Of His Books, ‘Whatever the Hell the Title’",
    "description": "President Trump repeated his claim that he predicted Osama bin Laden was a threat to the U.S. before the 9/11 terror attacks, but didn't get proper credit\nThe post Trump Credits Himself For Predicting Threat of Osama Bin Laden in One Of His Books, ‘Whatever t…",
    "link": "https://www.mediaite.com/media/news/trump-credits-himself-for-predicting-threat-of-osama-bin-laden-in-one-of-his-books-whatever-the-hell-the-title/",
    "timestamp": "2025-10-05T22:31:52Z"
  },
  {
    "title": "An Unexpected Line in the Sand",
    "description": "There has been talk for millennia about the wheat and the tares and the eventual separation of the two that Jesus foretold. I don’t know... Read More\nThe post An Unexpected Line in the Sand appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/05/an-unexpected-line-in-the-sand/",
    "timestamp": "2025-10-05T22:30:00Z"
  },
  {
    "title": "Rob Reiner Warns That Trump Wants “Control Of Media” To “Commandeer The Election”: “Beyond McCarthy Era-Esque”",
    "description": "With Donald Trump recently sending 300 California National Guard troops to Oregon, Rob Reiner is using his platform to warn that democracy is at risk. The Oscar nominee pleaded that it’s “our job now” as storytellers in Hollywood to call attention to recent a…",
    "link": "http://deadline.com/2025/10/rob-reiner-trump-control-media-beyond-mccarthy-era-esque-1236570666/",
    "timestamp": "2025-10-05T22:24:21Z"
  },
  {
    "title": "Hassett says layoffs will come if Trump thinks shutdown negotiations 'are going nowhere'",
    "description": "Hassett says layoffs will come if Trump thinks shutdown negotiations 'are going nowhere'go.com",
    "link": "https://abcnews.go.com/Politics/hassett-layoffs-trump-thinks-shutdown-negotiations/story?id=126235602",
    "timestamp": "2025-10-05T22:22:06Z"
  },
  {
    "title": "Surprise in Japan’s leadership race is set to roil financial markets as the yen tumbles against the dollar",
    "description": "With Japan's debt burden already more than 200% of its GDP, the prospect of more debt-fueled stimulus spending could cause investors to demand higher rates.",
    "link": "https://fortune.com/2025/10/05/dollar-vs-yen-japan-prime-minister-sanae-takaichi-bonds-us-debt-treasury-yield/",
    "timestamp": "2025-10-05T22:20:52Z"
  },
  {
    "title": "Trump blasts judge who blocked Portland troop deployment, saying she ‘ought to be ashamed of himself’",
    "description": "President Donald Trump on Sunday blasted a federal judge who blocked his deployment of Oregon National Guard troops, while repeatedly referring to her as a man. Trump appointed U.S. District Judge Karin J. Immergut, who on Saturday rejected the federal govern…",
    "link": "https://freerepublic.com/focus/f-news/4344543/posts",
    "timestamp": "2025-10-05T22:13:34Z"
  },
  {
    "title": "UFC fights to take place at White House on June 14, Trump says",
    "description": "He made the announcement during a speech at Naval Station Norfolk to mark the upcoming 250th anniversary of the U.S. Navy. Trump in July had announced that a UFC event would take place at the White House in 2026, but did not give a date. He counts UFC Preside…",
    "link": "https://sports.yahoo.com/article/ufc-fights-place-white-house-221130782.html",
    "timestamp": "2025-10-05T22:11:30Z"
  },
  {
    "title": "GOP Spin Doctor Goes Into Tailspin Over Trump's Tariff Trouble",
    "description": "GOP spinmeister Scott Jennings stepped into Trump's tariff war fiasco while appearing on CNN and got sucked down in the muck quickly.\nAs the gentle reader already knows, Donny Dementia has screwed up things so badly, that China is boycotting American soybeans…",
    "link": "https://crooksandliars.com/2025/10/gop-spin-doctor-goes-tailspin-over-trumps",
    "timestamp": "2025-10-05T22:10:09Z"
  },
  {
    "title": "Rick Wilson: Democrats Should Want To Teach Trump's Base A Painful Lesson",
    "description": "Former Republican strategist Rick Wilson wants Democrats to stop saving Republicans from themselves. I know Rick Wilson is not our friend, but I think he's right here when it comes to what it's going to take to get through to a bunch of Trump's base on the da…",
    "link": "https://crooksandliars.com/2025/10/rick-wilson-democrats-should-want-teach",
    "timestamp": "2025-10-05T22:10:08Z"
  },
  {
    "title": "Trump promises ‘across the board pay raises’ for US military during Navy’s 250th birthday celebration",
    "description": "President Trump on Sunday promised \"across the board pay raises\" for US service members while celebrating the Navy’s 250th birthday – as he blasted Democrats over the federal government shutdown.",
    "link": "https://nypost.com/2025/10/05/us-news/trump-promises-across-the-board-pay-raises-for-us-military-during-navys-250th-birthday-celebration/",
    "timestamp": "2025-10-05T22:07:37Z"
  },
  {
    "title": "Trump warns Hamas: Time is of the essence, or massive bloodshed will follow",
    "description": "Trump says talks with Hamas to end Gaza war and release hostages are progressing fast, but warns: “Time is of the essence or massive bloodshed will follow.” Technical teams meet Monday in Egypt.",
    "link": "https://www.israelnationalnews.com/news/415868",
    "timestamp": "2025-10-05T22:06:00Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Secretary of State Marco Rubio said Sunday on NBC News’ “Meet the Press” that ongoing negotiations between Hamas and Israel are not yet the end of the war and that setting up a group to govern Gaza would take “some time,” but emphasized that there was a plan …",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-october-5-rcna235292",
    "timestamp": "2025-10-05T22:00:42Z"
  },
  {
    "title": "Jeffries calls Trump behavior 'unhinged' and 'unreasonable' when asked if he feels he can negotiate with him",
    "description": "House Minority Leader Hakeem Jeffries called President Donald Trump's behavior \"unhinged\" and \"unreasonable\" as he was asked about the president's memes and whether or not he could still negotiate with him.",
    "link": "https://www.foxnews.com/media/jeffries-calls-trump-behavior-unhinged-unreasonable",
    "timestamp": "2025-10-05T22:00:38Z"
  },
  {
    "title": "Takaichi win as Japan leader may delay, not derail, BOJ rate hikes",
    "description": "TOKYO (Reuters) -With Sanae Takaichi set to become Japan's prime minister, advancing expansionist economic policies, chances have risen that the central bank...",
    "link": "https://finance.yahoo.com/news/takaichi-win-japan-leader-may-215952533.html",
    "timestamp": "2025-10-05T21:59:52Z"
  }
]