[
  {
    "title": "Trump labels 6 Democrats who told troops to refuse unlawful orders 'traitors' who should be arrested",
    "description": "President Donald Trump slammed the six Democrats who appeared in a video telling troops to defy \"illegal\" orders.",
    "link": "https://www.foxnews.com/politics/trump-labels-6-democrats-who-told-troops-refuse-unlawful-orders-traitors-who-should-arrested",
    "timestamp": "2025-11-20T14:38:03Z"
  },
  {
    "title": "Bondi and Halligan’s Spectacularly Bad Lawyering for Trump",
    "description": "The Department of Justice’s inappropriate, unethical, and incompetent actions in the case against James Comey are veering toward “uncharted legal territory.”",
    "link": "https://www.thebulwark.com/p/bondi-halligan-comey-james-prosecution",
    "timestamp": "2025-11-20T14:34:42Z"
  },
  {
    "title": "FO° Talks: What Does Trump’s Japan Visit and Meeting with Xi Jinping Mean for the Indo-Pacific?",
    "description": "Fair Observer’s Video Producer Rohan Khattar Singh speaks with Saya Kiba, a professor at Kobe City University of Foreign Studies in Japan, about US President Donald Trump’s five-day tour of Japan, South Korea and Malaysia. The discussion examines how the newl…",
    "link": "https://www.fairobserver.com/region/asia_pacific/fo-talks-what-does-trumps-japan-visit-and-meeting-with-xi-jinping-mean-for-the-indo-pacific/",
    "timestamp": "2025-11-20T14:29:09Z"
  },
  {
    "title": "US President's Son Donald Trump Jr. Visits Taj Mahal",
    "description": "Donald Trump Jr., son of US President Donald Trump, visited the Taj Mahal in Agra on Thursday and spent nearly an hour exploring the monument under an elaborate security arrangement, officials said.",
    "link": "https://www.ndtvprofit.com/nation/us-presidents-son-donald-trump-jr-visits-taj-mahal",
    "timestamp": "2025-11-20T14:28:57Z"
  },
  {
    "title": "Economic forecasts point to a Democrat win in the 2026 US midterm elections",
    "description": "Available data suggests the Democratic Party will win ten seats and gain control of the House of Representatives in the midterms.",
    "link": "https://theconversation.com/economic-forecasts-point-to-a-democrat-win-in-the-2026-us-midterm-elections-270178",
    "timestamp": "2025-11-20T14:27:03Z"
  },
  {
    "title": "The Netherlands suspends takeover of Nexperia, easing tensions with China",
    "description": "Dutch government's decision to relinquish control of chipmaker comes after major disruption to automotive supply chains.",
    "link": "https://www.aljazeera.com/economy/2025/11/20/the-netherlands-suspends-takeover-of-nexperia-easing-tensions-with-china",
    "timestamp": "2025-11-20T14:26:46Z"
  },
  {
    "title": "Karl Rove Declares Trump Has Finally Begun to ‘Correct His Course’ — and Reveals What GOP Must Do Next",
    "description": "Legendary GOP operative Karl Rove praised President Donald Trump for finally beginning to \"correct his course\" in a new column.\nThe post Karl Rove Declares Trump Has Finally Begun to ‘Correct His Course’ — and Reveals What GOP Must Do Next first appeared on M…",
    "link": "https://www.mediaite.com/media/news/karl-rove-declares-trump-has-finally-begun-to-correct-his-course-and-reveals-what-gop-must-do-next/",
    "timestamp": "2025-11-20T14:25:27Z"
  },
  {
    "title": "Netra Mantena’s wedding: Justin Bieber, Jennifer Lopez to perform; Donald Trump Jr, Ranveer Singh, Hrithik Roshan, Madhuri Dixit among attendees",
    "description": "US-based billionaire Rama Raju Mantena’s daughter, Netra Mantena, is set to tie the knot with Vamsi Gadiraju in a grand three-day celebration.",
    "link": "https://indianexpress.com/article/entertainment/bollywood/netra-mantenas-wedding-justin-bieber-jennifer-lopez-to-perform-ranveer-singh-madhuri-dixit-among-attendees-10376557/",
    "timestamp": "2025-11-20T14:24:59Z"
  },
  {
    "title": "Republican Senators Take Aim at Boasberg",
    "description": "As support grows to impeach Trump's biggest nemesis on the federal bench, the embattled D.C. chief judge plans to resume contempt proceedings against the administration. Are Republicans finally preparing to oust Judge James “Jeb” Boasberg? This week, six Repu…",
    "link": "https://freerepublic.com/focus/f-chat/4353577/posts",
    "timestamp": "2025-11-20T14:24:26Z"
  },
  {
    "title": "Trump Peace Plan Would Force Ukraine To Give Up Donbas And Cut Military",
    "description": "The Trump administration is circulating a new Ukraine peace framework that would require Kyiv to surrender the eastern Donbas region and scale back its military in exchange for U.S. security guarantees, a Western official told CNN. \nThe 28-point draft, review…",
    "link": "https://biztoc.com/x/2025cc8c161dc733",
    "timestamp": "2025-11-20T14:24:03Z"
  },
  {
    "title": "Bondi Says DOJ Will ‘Follow the Law’ on Release of Epstein Files",
    "description": "US Attorney General Pam Bondi said the Justice Department “will follow the law” after the passage of legislation compelling the government to release files on sex trafficker Jeffrey Epstein.\nBondi, speaking to reporters Wednesday after the Senate sent the bil…",
    "link": "https://biztoc.com/x/37790113e7847e05",
    "timestamp": "2025-11-20T14:23:57Z"
  },
  {
    "title": "GE Appliances expands US supply chain as production shifts to Kentucky from China",
    "description": "The company announced $150 million in contracts that span 10 states and cover crucial segments of the supplier chain for the appliance maker.",
    "link": "https://www.wdrb.com/news/business/ge-appliances-expands-us-supply-chain-as-production-shifts-to-kentucky-from-china/article_062f5262-8261-4199-99b3-8bd9aff4936a.html",
    "timestamp": "2025-11-20T14:22:40Z"
  },
  {
    "title": "‘I Never Said It Was THAT Jeffrey Epstein’ Jasmine Crockett Grilled on CNN for Naming ‘Totally Different’ Epstein as GOP Donor",
    "description": "Kaitlan Collins grilled Jasmine Crockett over her naming \"Jeffrey Epstein\" as a GOP donor — despite the man being a different person than the late sex predator.\nThe post ‘I Never Said It Was THAT Jeffrey Epstein’ Jasmine Crockett Grilled on CNN for Naming ‘To…",
    "link": "https://www.mediaite.com/media/tv/i-never-said-it-was-that-jeffrey-epstein-jasmine-crockett-grilled-on-cnn-for-naming-totally-different-epstein-as-gop-donor/",
    "timestamp": "2025-11-20T14:21:52Z"
  },
  {
    "title": "'Capitulation': Everything we know about new US plans to end war in Ukraine",
    "description": "European allies of Kyiv say \"peace cannot be capitulation\" as details of a new plan to end the Ukraine war emerge.",
    "link": "https://www.abc.net.au/news/2025-11-21/what-is-the-new-ukraine-peace-plan-explained/106034920",
    "timestamp": "2025-11-20T14:19:22Z"
  },
  {
    "title": "'Moon landing status': Republicans warn Trump Epstein scandal will 'dog' rest of his days",
    "description": "The Jeffrey Epstein files will \"dog the president\" well into his second term, according to GOP members who will \"never stop talking about it\".Longtime GOP member Alex Conant told CNN the president will struggle to shift the conversation away from the Epstein …",
    "link": "https://www.rawstory.com/donald-trump-epstein-2674312948/",
    "timestamp": "2025-11-20T14:18:13Z"
  },
  {
    "title": "Trump’s History With Jeffrey Epstein: Here’s The Full Timeline",
    "description": "Trump signed legislation Wednesday to force the Justice Department to release its investigatory files related to Jeffrey Epstein.",
    "link": "https://www.forbes.com/sites/saradorn/2025/11/20/trumps-history-with-jeffrey-epstein-heres-the-full-timeline/",
    "timestamp": "2025-11-20T14:17:45Z"
  },
  {
    "title": "US job growth beats expectations in September",
    "description": "US job growth accelerated in September, but the unemployment rate rose to 4.4% and the economy shed jobs in the prior month, suggesting labour market conditions remained sluggish.",
    "link": "https://www.rte.ie/news/business/2025/1120/1544990-us-non-farm-payroll-figures/",
    "timestamp": "2025-11-20T14:17:26Z"
  },
  {
    "title": "CDC Updates Website To Promote Debunked Theory On Vaccines And Autism",
    "description": "“DO NOT TRUST THIS AGENCY. This is a national embarrassment,” said ex-CDC vaccines chief Dr. Demetre Daskalakis.",
    "link": "https://www.huffpost.com/entry/cdc-updates-website-vaccines-autism_n_691efde2e4b00ed8a94f35d3",
    "timestamp": "2025-11-20T14:16:49Z"
  },
  {
    "title": "Rep. Vindman Demands Transcript Of Call Between Trump And MBS",
    "description": "The White House is facing calls to release a “shocking and disturbing” phone call between Donald Trump and the Saudi Crown Prince about the gruesome murder of journalist Jamal Khashoggi. Via The Daily Beast:\nOne day after the president insisted Mohammed bin S…",
    "link": "https://crooksandliars.com/2025/11/rep-vindman-demands-transcript-call",
    "timestamp": "2025-11-20T14:16:39Z"
  },
  {
    "title": "Trump Signs Epstein Bill Late At Night, Announces It On Truth Social",
    "description": "Look, we all know Trump and Bondi will do anything to stop whatever they identify as harmful to Trump from coming out, but we also know they're not smart enough to identify every little tidbit, as Julie K. Brown said. Brown is the reporter who first dragged t…",
    "link": "https://crooksandliars.com/2025/11/trump-signs-epstein-bill-late-night",
    "timestamp": "2025-11-20T14:16:21Z"
  },
  {
    "title": "U.S. greenlights AI chip exports to Gulf tech giants after Saudi Crown Prince's Washington visit",
    "description": "The approval marks a major reversal for the U.S., which had previously balked at the idea of direct exports to state-backed AI companies in the Gulf.",
    "link": "https://www.cnbc.com/2025/11/20/us-approves-ai-chip-exports-to-gulf-after-saudi-crown-prince-visit.html",
    "timestamp": "2025-11-20T14:16:08Z"
  },
  {
    "title": "US adds 119,000 jobs in September but unemployment hits four-year peak",
    "description": "Figures complicate Fed decision on rates next month",
    "link": "https://www.irishtimes.com/business/2025/11/20/us-adds-119000-jobs-in-september-but-unemployment-hits-four-year-peak/",
    "timestamp": "2025-11-20T14:15:33Z"
  },
  {
    "title": "What is up with Marjorie Taylor Greene?",
    "description": "MTG has defied Trump, repented of her sins — and positioned herself as a MAGA true believer",
    "link": "https://www.salon.com/2025/11/20/what-is-up-with-marjorie-taylor-greene/",
    "timestamp": "2025-11-20T14:10:54Z"
  },
  {
    "title": "Americans can now pocket $2000 for spotting litter — the simple 2-step reward program going viral",
    "description": "New York City Illegal Dumping Reward program offers residents a new method to report those who dump garbage, debris, and construction waste in the city. The DSNY currently enables New Yorkers to submit video proof of offenders, supporting authorities to trace…",
    "link": "https://economictimes.indiatimes.com/news/international/us/americans-can-now-pocket-2000-for-spotting-litter-the-simple-2-step-reward-program-going-viral/articleshow/125464378.cms",
    "timestamp": "2025-11-20T14:10:11Z"
  },
  {
    "title": "In surprise shift, Democrats are ahead in redistricting fight (Washington Post)",
    "description": "Washington Post:\nIn surprise shift, Democrats are ahead in redistricting fight  —  After early redistricting wins, Trump faces setbacks over maps for Texas, Indiana and other Republican-led states, frustrating his allies.  —  Just now  —  President Donald Tru…",
    "link": "https://www.memeorandum.com/251120/p27",
    "timestamp": "2025-11-20T14:10:01Z"
  },
  {
    "title": "With shutdown over, Gov. Hochul DEMANDS Trump release HEAP (Home Energy Assistance Program) funding as winter looms",
    "description": "ALBANY, N.Y. — Governor Kathy Hochul is calling on President Donald Trump to release $400 million in federal funds for the Home Energy Assistance Program. Governor Hochul said 1.5 million New Yorkers will rely on HEAP to help them heat their homes this winter…",
    "link": "https://freerepublic.com/focus/f-news/4353573/posts",
    "timestamp": "2025-11-20T14:09:44Z"
  },
  {
    "title": "Jihadists in Fresh Attack on Nigerian Church, Murdering Two and Kidnapping Others",
    "description": "A church in rural Nigeria was attacked by jihadists Wednesday with at least two people murdered before the pastor and some worshippers were kidnapped, police and witnesses said. The attack comes just days after 25 girls were abducted from a boarding school.\nT…",
    "link": "https://www.breitbart.com/faith/2025/11/20/jihadists-in-fresh-attack-on-nigerian-church-murdering-two-and-kidnapping-others/",
    "timestamp": "2025-11-20T14:09:08Z"
  },
  {
    "title": "IAEA passes resolution demanding nuclear access from Iran; Tehran rejects",
    "description": "'The resolution will have its own consequences', Iran's ambassador to the UN nuclear watchdog says.",
    "link": "https://www.aljazeera.com/news/2025/11/20/iaea-passes-resolution-demanding-nuclear-access-from-iran-tehran-rejects",
    "timestamp": "2025-11-20T14:08:10Z"
  },
  {
    "title": "Nvidia earnings takeaways: Bubble talk, 'half a trillion' forecast and China orders",
    "description": "CEO Jensen Huang sounded confident in the company's products and bullish on the company's outlook during a call with analysts.",
    "link": "https://www.cnbc.com/2025/11/20/nvda-stock-earnings-ai-bubble-china.html",
    "timestamp": "2025-11-20T14:06:31Z"
  },
  {
    "title": "Trump Snubbed by Dick Cheney's Family: Report",
    "description": "The Cheney family has not invited either President Donald Trump or Vice President JD Vance to former VP Dick Cheney's funeral.",
    "link": "https://www.westernjournal.com/trump-snubbed-dick-cheneys-family-report/",
    "timestamp": "2025-11-20T14:05:03Z"
  },
  {
    "title": "Trump Gives Universities Another Opportunity To Join His Effort To Restore Higher Education",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | November 19, 2025\nPresident Donald Trump is extending the deadline for universities to sign the higher education compact, giving preferential funding to schools that agree to certain terms, The Daily Signal f…",
    "link": "https://biztoc.com/x/2b7412ab0e8d303e",
    "timestamp": "2025-11-20T14:01:58Z"
  },
  {
    "title": "Leftists and Moderates Are Trying to Be More Like Each Other",
    "description": "The Democratic Party’s rival factions might actually have managed to find an economic message they can agree on.",
    "link": "https://www.theatlantic.com/ideas/2025/11/leftists-moderates-democrats-economy/684992/",
    "timestamp": "2025-11-20T14:01:00Z"
  },
  {
    "title": "Ex-Trump Official Exposes GOP’s True View Of Trump And... Yikes",
    "description": "Anthony Scaramucci explained how the \"surface cracks\" are \"becoming more structural\" and foundational.",
    "link": "https://www.huffpost.com/entry/anthony-scaramucci-donald-trump_n_691f0c63e4b0d33fcd98c64f",
    "timestamp": "2025-11-20T14:00:52Z"
  },
  {
    "title": "House Oversight Has Subpoenaed Epstein's Financial Records",
    "description": "Rep. James Comer, the Republican chair of the House Oversight Committee has subpoenaed Jeffrey Epstein's financial records from JPMorgan Chase, Deutsche Bank and the U.S. Virgin Islands.\nComer’s cover letter to JPMorgan notes that the institution internally i…",
    "link": "https://crooksandliars.com/2025/11/house-oversight-has-subpoenaed-epstein",
    "timestamp": "2025-11-20T14:00:01Z"
  },
  {
    "title": "Michelle Obama, Like Fancy Fingernails on a Chalkboard",
    "description": "When one of the most famous black women in America starts scolding the “white people,” you can feel the double standard marching to center stage.... Read More\nThe post Michelle Obama, Like Fancy Fingernails on a Chalkboard appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/11/20/michelle-obama-like-fancy-fingernails-on-a-chalkboard/",
    "timestamp": "2025-11-20T14:00:00Z"
  },
  {
    "title": "New Olivia Nuzzi Allegation Puts Vanity Fair, New York Magazine in a Bind",
    "description": "As the embattled journalist returns to the public eye, and becomes embroiled in a second ethics scandal, two news outlets that published her byline are staying silent \nThe post New Olivia Nuzzi Allegation Puts Vanity Fair, New York Magazine in a Bind appeared…",
    "link": "https://www.thewrap.com/olivia-nuzzi-rfk-sanford-vanity-fair-ny-mag/",
    "timestamp": "2025-11-20T14:00:00Z"
  },
  {
    "title": "How Section 907 Blocks America’s Search For Rare Earth Minerals",
    "description": "The Trump administration's attempt to break China's monopoly on critical minerals requires foreign partnerships and legal reform. A good place to start is Azerbaijan.",
    "link": "https://www.forbes.com/sites/marktemnycky/2025/11/20/how-section-907-blocks-americas-search-for-rare-earth-minerals/",
    "timestamp": "2025-11-20T14:00:00Z"
  },
  {
    "title": "Unpacking claim Trump's 'spiritual adviser' was arrested on child molestation charge",
    "description": "Morris once served on Trump's evangelical advisory board, but the White House denied claims that he was the president's current spiritual adviser.",
    "link": "https://www.snopes.com//fact-check/trump-spiritual-adviser-arrest/",
    "timestamp": "2025-11-20T14:00:00Z"
  },
  {
    "title": "Commentator on Jack Smith Probe: ‘We shouldn’t lose focus over who directed Arctic Frost’",
    "description": "A political commentator for NonLib Take says getting to the bottom of the Arctic Frost controversy must reveal who ordered telecom companies to give up phone records for Jack Smith’s investigation of President Trump. Arynne Wexler, in a post on X, said the ce…",
    "link": "https://freerepublic.com/focus/f-chat/4353569/posts",
    "timestamp": "2025-11-20T13:58:59Z"
  },
  {
    "title": "Donald Trump Calls for Jimmy Kimmel to Be Pulled Off ABC After Epstein Jokes: ‘Get the Bum Off the Air!’",
    "description": "U.S. President Donald Trump is railing against Jimmy Kimmel again after the late-night host roasted him on Tuesday over the ongoing Epstein files saga. On Wednesday night, Trump officially signed a bill calling on the Justice Department to finally release the…",
    "link": "https://variety.com/2025/tv/news/donald-trump-slams-jimmy-kimmel-epstein-jokes-get-him-off-air-1236586652/",
    "timestamp": "2025-11-20T13:58:17Z"
  },
  {
    "title": "'This is a structural goods recession': U.S. freight market is starting to roll over as Chinese trade plummets",
    "description": "Trump tariffs impact on holiday goods have logistics experts warning traditional peak holiday shipping season looks virtually non-existent this year.",
    "link": "https://www.cnbc.com/2025/11/20/trump-tariffs-trade-china-import-decline-freight-recession.html",
    "timestamp": "2025-11-20T13:57:23Z"
  },
  {
    "title": "Brendan Carr’s FCC launches probe into BBC’s Trump edit",
    "description": "FCC chair Brendan Carr has reportedly written to the BBC, PBS, and NPR announcing an investigation into whether a controversial BBC documentary with a misleading edit of a Donald Trump speech was ever aired in the US. Breitbart obtained a copy of the letter, …",
    "link": "https://www.theverge.com/news/824913/bbc-pbs-npr-probe-trump-speech-news-distortion-fcc-brendan-carr",
    "timestamp": "2025-11-20T13:56:24Z"
  },
  {
    "title": "Dems Telling Troops To Disobey Illegal Orders, And Trump's Nazis Are Flipping Their Sh*t",
    "description": "Cry more.",
    "link": "https://www.wonkette.com/p/dems-telling-troops-to-disobey-illegal",
    "timestamp": "2025-11-20T13:55:39Z"
  },
  {
    "title": "Trump Questions Why ABC Keeps Kimmel on the Air Despite ‘No Talent’ and ‘Poor Ratings’",
    "description": "\"Why do the TV Syndicates put up with it? Also, totally biased coverage. Get the bum off the air,\" the president shares two months after the late night host's brief suspension\nThe post Trump Questions Why ABC Keeps Kimmel on the Air Despite ‘No Talent’ and ‘P…",
    "link": "https://www.thewrap.com/trump-jimmy-kimmel-suspended-abc-ratings-truth-social/",
    "timestamp": "2025-11-20T13:54:55Z"
  },
  {
    "title": "Thursday, November 20, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/thursday-november-20-2025/",
    "timestamp": "2025-11-20T13:54:03Z"
  },
  {
    "title": "Trump not invited to Dick Cheney funeral: report",
    "description": "President Donald Trump was reportedly not invited to former VP Dick Cheney's funeral at National Cathedral amid ongoing tensions with Cheney family.",
    "link": "https://www.foxnews.com/politics/trump-not-invited-dick-cheney-funeral-report",
    "timestamp": "2025-11-20T13:52:55Z"
  },
  {
    "title": "US Job Growth Smashed Expectations In September",
    "description": "The U.S. economy added 119,000 nonfarm payroll jobs in September, according to Bureau of Labor Statistics (BLS) data released Thursday morning.",
    "link": "https://dailycaller.com/2025/11/20/job-growth-september/",
    "timestamp": "2025-11-20T13:52:44Z"
  },
  {
    "title": "‘Yes, it is an ambitious, crazy thing’: Scenes from the Kennedy Center’s Saudi-U.S. AI mind-meld, with Trump, MBS, Musk and Huang",
    "description": "President Donald Trump is increasingly counting on the tech sector and the development of artificial intelligence to deliver on his economic agenda, a reality laid bare this week as he hosted Saudi Arabia’s Crown Prince Mohammed bin Salman.\nThe crown prince h…",
    "link": "https://biztoc.com/x/088bf39b00deca6f",
    "timestamp": "2025-11-20T13:50:34Z"
  },
  {
    "title": "Donald Trump Gets Much-Needed Boost From Delayed Jobs Report",
    "description": "Thursday's report from the Department of Labor marks the first official jobs reading since the government shutdown.",
    "link": "https://biztoc.com/x/95f533f1e7863578",
    "timestamp": "2025-11-20T13:50:19Z"
  },
  {
    "title": "Trump administration eyes sweeping federal power over AI, draft order shows",
    "description": "Trump's sweeping AI executive order would block states from setting their own artificial intelligence rules, creating litigation task force.",
    "link": "https://www.foxnews.com/politics/trump-administration-eyes-sweeping-federal-power-over-ai-draft-order-shows",
    "timestamp": "2025-11-20T13:50:15Z"
  },
  {
    "title": "Saudi Arabia makes major commitment to US – White House",
    "description": "Saudi Arabia has agreed to raise investment in the US to almost $1 trillion, the White House has announced Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628059-saudi-arabia-us-commitment/",
    "timestamp": "2025-11-20T13:50:15Z"
  },
  {
    "title": "Why prices won't — and shouldn't — go down — ﻿They hardly ever fall. (Vox)",
    "description": "Vox:\nWhy prices won't — and shouldn't — go down  —  ﻿They hardly ever fall.  When they do, it usually means serious trouble. … Before his second term, then-former President Donald Trump ran a campaign in 2024 promising to lower the prices of pretty much every…",
    "link": "https://www.memeorandum.com/251120/p22",
    "timestamp": "2025-11-20T13:50:04Z"
  },
  {
    "title": "Trump held Americans’ Thanksgiving travel hostage to force through health care cuts, Democratic senator suggests",
    "description": "Sen. Tammy Duckworth wants to know why the FAA and Transportation Secretary Sean Duffy haven't shown the safety data behind their order to cut flights.",
    "link": "https://fortune.com/2025/11/20/trump-held-americans-thanksgiving-travel-hostage-government-shutdown-tammy-duckworth/",
    "timestamp": "2025-11-20T13:50:03Z"
  },
  {
    "title": "How ‘South Park’ Has Become a Beacon of Resistance in America",
    "description": "Sure, the show has been around for a staggering 28 seasons. But in 2025, creators Trey Parker and Matt Stone have been on a fresh crusade to save democracy one dick joke at a time",
    "link": "http://www.rollingstone.com/culture/culture-features/south-park-trey-parker-matt-stone-trump-resistance-voices-1235460268/",
    "timestamp": "2025-11-20T13:49:00Z"
  },
  {
    "title": "How ‘South Park’ Has Become a Beacon of Resistance in America",
    "description": "Sure, the show has been around for a staggering 28 seasons. But in 2025, creators Trey Parker and Matt Stone have been on a fresh crusade to save democracy one dick joke at a time",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-features/south-park-trey-parker-matt-stone-trump-resistance-voices-1235460268/",
    "timestamp": "2025-11-20T13:49:00Z"
  },
  {
    "title": "Trump told to 'bang some heads' as 'panicky' Republicans threaten to overturn plan: report",
    "description": "In the face of plummeting approval numbers for the Republican Party, Donald Trump is being urged to reassert his dominance over a GOP that has grown increasingly panicky as the 2026 midterms loom.This week, a Fox News poll showed Republicans facing a possible…",
    "link": "https://www.rawstory.com/gop-panic-trump/",
    "timestamp": "2025-11-20T13:45:17Z"
  },
  {
    "title": "WMT stock: Walmart share price jumps after Walmart earnings report raises sales outlook for e-retail giant",
    "description": "Walmart stock was under scanner after Walmart earnings report showd higher quarterly revenue on Thursday.",
    "link": "https://economictimes.indiatimes.com/news/international/us/wmt-stock-walmart-share-price-jumps-after-walmart-earnings-report-raises-sales-outlook-for-e-retail-giant/articleshow/125464542.cms",
    "timestamp": "2025-11-20T13:42:36Z"
  },
  {
    "title": "Trump Media shares have lost 70% of their value YTD",
    "description": "As whispers grow in Washington about President Donald Trump's waning influence over the Republican Party, investors are rapidly backing away from his company's stock. In the past week, shares of Trump Media & Technology Group have fallen 18% and the stock is …",
    "link": "https://biztoc.com/x/d68c607e0d13fd2e",
    "timestamp": "2025-11-20T13:39:26Z"
  },
  {
    "title": "Trump urges Scott Bessent to take Fed chair role, ‘but he wants no part of it, he likes being secretary of the Treasury’",
    "description": "For the second time in two days, President Donald Trump said Wednesday that he would like to appoint Treasury Secretary Scott Bessent to chair the Federal Reserve.\nYet Bessent keeps saying he doesn’t want the job, Trump added, in comments to the U.S.-Saudi In…",
    "link": "https://biztoc.com/x/1fe200893f68a8a1",
    "timestamp": "2025-11-20T13:39:13Z"
  },
  {
    "title": "Trump Continues Attack On ABC",
    "description": "“Donald Trump went after Jimmy Kimmel again, calling for ABC to remove him from the air, Deadline reports. Said Trump, on Truth Social: “Why does ABC Fake News keep Jimmy Kimmel, a man with NO TALENT and VERY POOR TELEVISION RATINGS, on the air? Why do the TV…",
    "link": "https://politicalwire.com/2025/11/20/trump-continues-attack-on-abc/",
    "timestamp": "2025-11-20T13:38:02Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Calls BS On Trump Taking Credit for Epstein Bill He Tried to Kill — and On What HE Didn’t Say",
    "description": "CNN anchor Kaitlan Collins called BS on President Donald Trump over a statement \"taking credit\" for the Epstein Files bill he \"tried to kill.\"\nThe post CNN’s Kaitlan Collins Calls BS On Trump Taking Credit for Epstein Bill He Tried to Kill — and On What HE Di…",
    "link": "https://www.mediaite.com/media/tv/cnns-kaitlan-collins-calls-bs-on-trump-taking-credit-for-epstein-bill-he-tried-to-kill-and-on-what-he-didnt-say/",
    "timestamp": "2025-11-20T13:37:33Z"
  },
  {
    "title": "Melania Trump ‘Deeply Uncomfortable’ Because of This — Source",
    "description": "Sources claim that Melania Trump is reportedly upset after Eric Trump publicly repeated what he claimed Barron Trump had said to former President Joe Biden...",
    "link": "https://www.realitytea.com/2025/11/20/melania-trump-furious-family-member-barron/",
    "timestamp": "2025-11-20T13:36:43Z"
  },
  {
    "title": "GE Appliances bolsters ties with US suppliers as it moves production from China to Kentucky",
    "description": "GE Appliances says it has awarded more than $150 million in new contracts to U.S. suppliers as a result of its decision to shift production from China to Kentucky",
    "link": "https://abcnews.go.com/Business/wireStory/ge-appliances-bolsters-ties-us-suppliers-moves-production-127706280",
    "timestamp": "2025-11-20T13:34:01Z"
  },
  {
    "title": "Donald Trump Continues Attack On ABC With Call To Drop Jimmy Kimmel After Late-Night Host Makes Jeffrey Epstein Jokes",
    "description": "Donald Trump went after Jimmy Kimmel again, calling for ABC to remove him from the air, after the late-night host In a Truth Social post at 12:49 a.m. ET, Trump posted, “Why does ABC Fake News keep Jimmy Kimmel, a man with NO TALENT and VERY POOR TELEVISION R…",
    "link": "http://deadline.com/2025/11/trump-jimmy-kimmel-jeffrey-epstein-1236624554/",
    "timestamp": "2025-11-20T13:33:29Z"
  },
  {
    "title": "Trump says he’ll meet with Zohran Mamdani at the White House: ‘Further details to follow!’",
    "description": "President Donald Trump said late Wednesday that the long-awaited meeting with New York City Mayor-elect Zohran Mamdani would happen in Washington later this week, setting up an in-person clash between the political polar opposites who for months have antagoni…",
    "link": "https://biztoc.com/x/ab77db7c224012d3",
    "timestamp": "2025-11-20T13:28:39Z"
  },
  {
    "title": "Alan Cumming Was Offered ‘The Traitors’ UK Hosting Gig Before Claudia Winkleman",
    "description": "Claudia Winkleman’s iconic outfits and trademark fringe seen on the BBC’s version of The Traitors may never have happened. BBC Chief Content Officer Kate Phillips has admitted that the broadcaster and producer Stephen Lambert had originally asked The Traitors…",
    "link": "http://deadline.com/2025/11/alan-cumming-traitors-uk-host-offer-1236624520/",
    "timestamp": "2025-11-20T13:28:31Z"
  },
  {
    "title": "Trump caves to democracy, signs bill to release Epstein files",
    "description": "President Donald Trump signed legislation Wednesday that compels his administration to release files on convicted sex offender Jeffrey Epstein, bowing to political pressure from his own party after initially resisting those efforts.\nTrump could have chosen to…",
    "link": "https://biztoc.com/x/f06e7ef730fc8d53",
    "timestamp": "2025-11-20T13:28:24Z"
  },
  {
    "title": "Trump tariff exemptions explained: Indian tea, coffee and spice exporters stand to benefit — here is how",
    "description": "While President Trump’s latest action is primarily aimed at keeping domestic US inflation in check, it is expected to assist Indian exporters of agricultural commodities, who have been facing a 50% tariff rate since late August.",
    "link": "https://www.livemint.com/industry/agriculture/trump-tariff-exemptions-explained-indian-tea-coffee-and-spice-exporters-stand-to-benefit-here-is-how-11763636751073.html",
    "timestamp": "2025-11-20T13:25:42Z"
  },
  {
    "title": "‘Hawk Tuah’ Girl Added to Lawsuit Over Alleged Crypto Memecoin Fraud",
    "description": "The suit claims that the HAWK coin was rigged from the start to inflate its value rapidly before crashing.",
    "link": "https://gizmodo.com/hawk-tuah-girl-added-to-lawsuit-over-alleged-crypto-memecoin-fraud-2000688482",
    "timestamp": "2025-11-20T13:25:22Z"
  },
  {
    "title": "The TikTok ‘Ban’ Continues To Be One Of The Biggest Turds In Tech Policy History",
    "description": "After four years of hyperventilation about TikTok’s impact on privacy, propaganda, and national security, and a year after the app was to be banned from app stores via an act of Congress, TikTok remains widely available. The Trump administration insists they …",
    "link": "https://www.techdirt.com/2025/11/20/the-tiktok-ban-continues-to-be-one-of-the-biggest-turds-in-tech-policy-history/",
    "timestamp": "2025-11-20T13:25:00Z"
  },
  {
    "title": "Democrat Rep. Sheila Cherfilus-McCormick Immediately Hit With Censure Threat",
    "description": "Democratic Florida Rep. Sheila Cherfilus-McCormick could be removed from several House committees after being charged by federal prosecutors Wednesday night with funneling federal disaster funds into her campaign account. Republican Rep. Greg Steube, said he …",
    "link": "https://dailycaller.com/2025/11/20/sheila-cherfilus-mccormick-censure-indictment-greg-steube/",
    "timestamp": "2025-11-20T13:24:25Z"
  },
  {
    "title": "Transcript: Trump’s Anti-Affordability Agenda Hits Colleges",
    "description": "This is a lightly edited transcript of the November 18 edition of Right Now With Perry Bacon. You can watch the video here or by following this show on YouTube or Substack.Perry Bacon: I’m Perry Bacon. I’m the host of The New Republic Show, Right Now. I’m joi…",
    "link": "https://newrepublic.com/article/203313/transcript-trump-anti-affordability-agenda-hits-colleges",
    "timestamp": "2025-11-20T13:22:07Z"
  },
  {
    "title": "Trump to meet incoming New York Mayor Zohran Mamdani",
    "description": "Trump has framed Mandani as a dangerous \"communist\", while the New York mayor has said he will take on Trump.",
    "link": "https://www.bbc.com/news/articles/cvgmgddyjl0o",
    "timestamp": "2025-11-20T13:21:10Z"
  },
  {
    "title": "Trump urges Scott Bessent to take Fed chair role, ‘but he wants no part of it, he likes being secretary of the Treasury’",
    "description": "In comments to the U.S.-Saudi Investment Forum, Trump said, \"I think we’ll leave him — so let’s cross your name off right, officially, right?”",
    "link": "https://fortune.com/2025/11/20/trump-scott-bessent-federal-reserve-chair-treasury-secretary/",
    "timestamp": "2025-11-20T13:20:42Z"
  },
  {
    "title": "Trump privately backs steep tariffs on Russia’s trade partners – US senator",
    "description": "US President Donald Trump has privately urged lawmakers to approve a bill that would slap 500% tariffs on Russia’s trade partners Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628049-trump-backs-tariffs-russian-partners/",
    "timestamp": "2025-11-20T13:19:14Z"
  },
  {
    "title": "Farmers – long Trump backers – bear the costs of new tariffs, restricted immigration and slashed renewable energy subsidies",
    "description": "In the past, farmers have balanced their political beliefs against market logic. How much pressure can farmers endure?",
    "link": "https://theconversation.com/farmers-long-trump-backers-bear-the-costs-of-new-tariffs-restricted-immigration-and-slashed-renewable-energy-subsidies-269221",
    "timestamp": "2025-11-20T13:18:08Z"
  },
  {
    "title": "Nvidia's earnings blowout, Walmart's outlook, Fed minutes and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/11/20/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-11-20T13:17:31Z"
  },
  {
    "title": "Trump Administration Mulls Delaying Semiconductor Tariffs To Avoid China Clash: Report",
    "description": "The Trump administration is reportedly contemplating a delay in imposing tariffs on semiconductors, a move that marks a significant shift from President Donald Trump‘s earlier stance.\nChip Tariff Decision Under Review\nThe officials have been communicating thi…",
    "link": "https://biztoc.com/x/cffc40690ef5ac9a",
    "timestamp": "2025-11-20T13:17:25Z"
  },
  {
    "title": "Trump says he’ll meet with Zohran Mamdani at the White House: ‘Further details to follow!’",
    "description": "The sit-down, which Trump said on social media would take place Friday in the Oval Office, could possibly represent a detente of sorts.",
    "link": "https://fortune.com/2025/11/20/trump-to-meet-zohran-mamdani-white-house-oval-office/",
    "timestamp": "2025-11-20T13:16:03Z"
  },
  {
    "title": "1,500% price increase on some rare earth elements squeezes chipmaking business — Yttrium surge caused by trade war between U.S. and China",
    "description": "Yttrium prices are surging as the trade war between China and the U.S. have caused supply to dry up.",
    "link": "https://www.tomshardware.com/tech-industry/manufacturing/1-500-percent-price-increase-on-some-rare-earth-elements-squeezes-chipmaking-business-yttrium-surge-caused-by-trade-war-between-u-s-and-china",
    "timestamp": "2025-11-20T13:13:17Z"
  },
  {
    "title": "Trump Media shares have lost 70% of their value YTD",
    "description": "Shares are ever-so-slightly above their all-time low. The stock plunge has erased more than $5 billion in wealth for Trump and his family",
    "link": "https://qz.com/trump-media-stock-plunge-net-worth",
    "timestamp": "2025-11-20T13:12:23Z"
  },
  {
    "title": "Elon Musk says AI will eradicate poverty; Paytm CEO Vijay Shekhar Sharma approves",
    "description": "Elon Musk first made the comments at the US-Saudi Investment Forum in Washington, where US President Donald Trump hosted Saudi Crown Prince Mohammed bin Salman",
    "link": "https://www.livemint.com/companies/people/elon-musk-says-ai-will-eradicate-poverty-paytm-ceo-vijay-shekhar-sharma-approves-11763638904827.html",
    "timestamp": "2025-11-20T13:11:44Z"
  },
  {
    "title": "Zohran Mamdani reveals what he plans to discuss with President Trump in Oval Office meeting",
    "description": "New York City mayor-elect Zohran Mamdani plans to address affordability during his upcoming White House meeting with President Donald Trump.",
    "link": "https://www.foxnews.com/media/mamdani-reveals-what-he-plans-discuss-president-trump-oval-office-meeting",
    "timestamp": "2025-11-20T13:10:35Z"
  },
  {
    "title": "The Download: what’s next for electricity, and living in the conspiracy age",
    "description": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. Three things to know about the future of electricity The International Energy Agency recently released the latest version…",
    "link": "https://www.technologyreview.com/2025/11/20/1128183/the-download-whats-next-for-electricity-and-living-in-the-conspiracy-age/",
    "timestamp": "2025-11-20T13:10:00Z"
  },
  {
    "title": "Trump caves to democracy, signs bill to release Epstein files",
    "description": "The bill requires the DOJ to release all files and communications related to Epstein within 30 days. Redactions for \"embarrassment\" are not allowed.",
    "link": "https://fortune.com/2025/11/20/trump-signs-bill-to-release-epstein-files/",
    "timestamp": "2025-11-20T13:08:54Z"
  },
  {
    "title": "Trans NFL Cheerleader Alleges She Was FIRED After Trump Was Re-Elected",
    "description": "Justine Lindsay, the cheerleader who made NFL history in 2022, says she was pushed off the Carolina TopCats roster in August 2025 for one reason only. “I was cut because I’m trans,” she told Gaye Magazine during an emotional Instagram Live. Before the intervi…",
    "link": "https://mediatakeout.com/trans-nfl-cheerleader-alleges-she-was-fired-after-trump-was-re-elected/",
    "timestamp": "2025-11-20T13:08:48Z"
  },
  {
    "title": "GE Appliances bolsters ties with US suppliers as it moves production from China to Kentucky",
    "description": "LOUISVILLE, Ky. (AP) — GE Appliances on Thursday touted wide-ranging ripple effects from shifting production from China to Kentucky as it announced more than $150 million in new contracts awarded to U.S.-based suppliers. The supplier contracts range in value …",
    "link": "https://financialpost.com/pmn/ge-appliances-bolsters-ties-with-us-suppliers-as-it-moves-production-from-china-to-kentucky",
    "timestamp": "2025-11-20T13:08:35Z"
  },
  {
    "title": "The 2026 Midterms: Prop 50’s victory in California has secured Governor Gavin Newsom as the leader of the Trump redistricting counterattack",
    "description": "Earlier this month Californians voted to approve Proposition 50 to temporarily suspend the state’s nonpartisan redistricting commission to redraw the Congressional map and potentially create five more Democratic House seats. Jeff Cummins writes that as the sp…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/11/20/the-2026-midterms-prop-50s-victory-in-california-has-secured-governor-gavin-newsom-as-the-leader-of-the-trump-redistricting-counterattack/",
    "timestamp": "2025-11-20T13:07:33Z"
  },
  {
    "title": "In Myanmar, Illicit Rare Earth Mining Is Taking a Heavy Toll",
    "description": "As China has cut back on domestic extraction of rare earth minerals, uncontrolled mining in Myanmar has boomed in areas ruled by ethnic armies. New reporting in Wa territory reveals the activity is damaging water supplies, forests, and the health of workers a…",
    "link": "https://e360.yale.edu/features/myanmar-rare-earth-mining",
    "timestamp": "2025-11-20T13:04:00Z"
  },
  {
    "title": "GE Appliances bolsters ties with US suppliers as it moves production from China to Kentucky",
    "description": "GE Appliances on Thursday touted wide-ranging ripple effects from shifting production from China to Kentucky as it announced more than $150 million in new...",
    "link": "https://finance.yahoo.com/news/ge-appliances-bolsters-ties-us-130254956.html",
    "timestamp": "2025-11-20T13:02:54Z"
  },
  {
    "title": "Walmart lifts outlook in quarterly results with e-commerce boost",
    "description": "US retail giant Walmart reported higher quarterly revenue Thursday and raised its outlook, in an expectations-beating earnings report as American households feel the squeeze from rising costs of living. The results of Walmart, which caters to buyers across in…",
    "link": "https://www.digitaljournal.com/world/walmart-lifts-outlook-in-quarterly-results-with-e-commerce-boost/article",
    "timestamp": "2025-11-20T13:02:32Z"
  }
]