[
  {
    "title": "Melania Trump shocks guests by breaking First Lady protocol in unprecedented move at stunning White House ceremony",
    "description": "Melania Trump and President Donald Trump signed the 'Take It Down Act'. This law aims to protect revenge porn victims. Melania championed the legislation and lobbied for its passage. The president praised her efforts. Melania highlighted the law's importance …",
    "link": "https://economictimes.indiatimes.com/news/international/us/melania-trump-shocks-guests-by-breaking-first-lady-protocol-in-unprecedented-move-at-stunning-white-house-ceremony/articleshow/121297669.cms",
    "timestamp": "2025-05-20T17:42:46Z"
  },
  {
    "title": "UK, France, Canada warn Israel of sanctions: Is opinion shifting on Gaza?",
    "description": "UK imposes sanctions on Israeli settlers as European leaders mount pressure on Israel to end its Gaza offensive.",
    "link": "https://www.aljazeera.com/news/2025/5/20/uk-france-canada-warn-israel-of-sanctions-is-opinion-shifting-on-gaza",
    "timestamp": "2025-05-20T17:41:27Z"
  },
  {
    "title": "Trump said to pledge $25B funding for Golden Dome",
    "description": "US President Donald Trump is set to announce a $25 billion funding package for the Golden Dome Project, Politico reported on Tuesday, citing a White House official.More to come.....",
    "link": "https://biztoc.com/x/f349c4aeba372ce6",
    "timestamp": "2025-05-20T17:40:53Z"
  },
  {
    "title": "Trump migrant detentions at Guantanamo Bay cost $100,000 per person daily, senator says",
    "description": "WASHINGTON (Reuters) -President Donald Trump's use of the Guantanamo Bay naval base to house migrants appears to cost $100,000 per day for each detainee, U.S. Senator Gary Peters said during a hearing on Tuesday, decrying what he described as a prime example …",
    "link": "https://www.thestar.com.my/news/world/2025/05/21/trump-migrant-detentions-at-guantanamo-bay-cost-100000-per-person-daily-senator-says",
    "timestamp": "2025-05-20T17:40:00Z"
  },
  {
    "title": "A man once sued by the SEC wins Trump crypto contest to have dinner with the president",
    "description": "We now know who won the contest to attend an intimate dinner with President Donald Trump by buying his cryptocurrency — and he's a familiar face to Securities and Exchange Commission regulators and law enforcement officials.",
    "link": "https://www.nbcnews.com/business/business-news/trump-coin-crypto-dinner-who-is-top-holder-justin-sun-rcna207983",
    "timestamp": "2025-05-20T17:38:52Z"
  },
  {
    "title": "Iran's Khamenei Fed Up With Trump's \"Nonsense\" Demands, Defers Future Talks",
    "description": "Iran&#039;s Supreme Leader Ayatollah Ali Khamenei has let his displeasure about Donald Trump and the US administration&#039;s demands in the crucial nuclear talks be known publicly, calling them nonsensical and utterly outrageous.",
    "link": "https://www.ndtv.com/world-news/irans-ayatollah-khamenei-fed-up-with-donald-trumps-nonsense-demands-defers-future-talks-8465040",
    "timestamp": "2025-05-20T17:38:36Z"
  },
  {
    "title": "'Fall of stunning velocity': Inside the crash and burn of Ron DeSantis",
    "description": "Florida Governor Ron DeSantis once looked like the inevitable heir to Donald Trump's MAGA movement, but observers have been stunned by the collapse of his political fortunes on the national stage — and back in his home state.The 46-year-old Republican was ano…",
    "link": "https://www.rawstory.com/ron-desantis-political-future/",
    "timestamp": "2025-05-20T17:38:06Z"
  },
  {
    "title": "Honda reveals delay of $15-billion Canada investment part of shift in EV strategy",
    "description": "Honda's Canada EV project with focus on batteries is taking a back seat as the company shifts to focus on hybrids. Read more",
    "link": "https://financialpost.com/commodities/energy/electric-vehicles/honda-cutting-ev-investment-delaying-canadian-plans",
    "timestamp": "2025-05-20T17:37:16Z"
  },
  {
    "title": "Who is the billionaire who transformed the iconic Playboy Mansion after five years of renovations? Here's how it looks now",
    "description": "The Playboy Mansion, once owned by Hugh Hefner, was bought by Daren Metropoulos in 2016. After five years of big changes, it's now fully renovated and looks very modern and fancy.",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-the-billionaire-who-transformed-the-iconic-playboy-mansion-after-five-years-of-renovations-heres-how-it-looks-now/articleshow/121298156.cms",
    "timestamp": "2025-05-20T17:36:59Z"
  },
  {
    "title": "Inside Trump's urgent meeting with House GOP to pass the 'big, beautiful bill'",
    "description": "President Donald Trump addressed House Republicans in a closed-door meeting on Capitol Hill on Tuesday.",
    "link": "https://www.foxnews.com/politics/inside-trump-urgent-meeting-house-gop-pass-big-beautiful-bill",
    "timestamp": "2025-05-20T17:36:35Z"
  },
  {
    "title": "‘They better be let in’: Eric Swalwell promises more unannounced visits to ICE",
    "description": "'They're not worthy of much of a heads-up because of the amount of lies that they've told the American people'",
    "link": "https://www.wnd.com/2025/05/they-better-be-let-in-eric-swalwell-promises-more-unannounced-visits-to-ice/",
    "timestamp": "2025-05-20T17:36:11Z"
  },
  {
    "title": "‘Don’t F*ck Around With Medicaid’: Trump Moves To Quash GOP Schisms Over ‘One Big, Beautiful Bill’",
    "description": "President Donald Trump moved to quash House Republicans' debate over key aspects of his \"one big, beautiful bill\" with a visit to Capitol Hill Monday morning.",
    "link": "https://dailycaller.com/2025/05/20/trump-visits-hill-to-save-one-big-beautiful-bill/",
    "timestamp": "2025-05-20T17:35:56Z"
  },
  {
    "title": "JD Vance’s Surprise Admission About Trump, Medicaid Boomerangs on Him",
    "description": "As House Republicans prepare to slash hundreds of billions of dollars from Medicaid, it’s been widely observed that these cuts will screw over countless voters who backed one Donald J. Trump in the 2024 election. As many Democrats note, such cuts undermine th…",
    "link": "https://newrepublic.com/article/195499/jd-vance-trump-medicaid-cuts",
    "timestamp": "2025-05-20T17:35:51Z"
  },
  {
    "title": "Violent & Jealous Sean “Diddy” Combs Demanded $20K “Recoup,” Cassie Ventura’s Mother Tells Sex-Trafficking Trial; Family Had To Take Out Home Loan To Pay Multi-Millionaire",
    "description": "Cassie Ventura’s mother wasn’t on the stand long today in Sean “Diddy” Combs’ sex-trafficking trial, but she certainly offered a damning glimpse at the violent and manipulative self-described “toxic relationship” her daughter had with the Bad Boy Records foun…",
    "link": "http://deadline.com/2025/05/diddy-trial-cassie-ventura-mother-testimony-1236405938/",
    "timestamp": "2025-05-20T17:35:43Z"
  },
  {
    "title": "JMP Reiterates Outperform on Salesforce (CRM), Cites Agentforce Pricing Shift",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Salesforce Inc. (NYSE:CRM) stands ...",
    "link": "https://finance.yahoo.com/news/jmp-reiterates-outperform-salesforce-crm-173404762.html",
    "timestamp": "2025-05-20T17:34:04Z"
  },
  {
    "title": "Evercore ISI Reiterates Outperform on Apple (AAPL), Targets $250",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands...",
    "link": "https://finance.yahoo.com/news/evercore-isi-reiterates-outperform-apple-173357056.html",
    "timestamp": "2025-05-20T17:33:57Z"
  },
  {
    "title": "Raymond James Reiterates Strong Buy on NVIDIA (NVDA), Targets $150",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA...",
    "link": "https://finance.yahoo.com/news/raymond-james-reiterates-strong-buy-173356486.html",
    "timestamp": "2025-05-20T17:33:56Z"
  },
  {
    "title": "Build 2025 Highlights Microsoft (MSFT)’s Push Toward a Collaborative AI Future",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT...",
    "link": "https://finance.yahoo.com/news/build-2025-highlights-microsoft-msft-173349564.html",
    "timestamp": "2025-05-20T17:33:49Z"
  },
  {
    "title": "Trump expected to announce 'Golden Dome' missile defenses costing billions",
    "description": "WASHINGTON: US President Donald Trump is expected to announce on Tuesday (May 20) the concept he wants for a future Golden Dome missile defence program, which would",
    "link": "https://www.channelnewsasia.com/world/trump-expected-announce-golden-dome-missile-defenses-costing-billions-5142501",
    "timestamp": "2025-05-20T17:32:53Z"
  },
  {
    "title": "French luxury group Chanel’s full year profit tumbles 28% due to ‘challenging macroeconomic’ conditions",
    "description": "Chanel said the headwinds raise questions over whether it will raise prices, as it typically does twice a year, in March and in September.",
    "link": "https://www.livemint.com/companies/company-results/french-luxury-group-chanel-s-full-year-profit-tumbles-28-due-to-challenging-macroeconomic-conditions-11747761616815.html",
    "timestamp": "2025-05-20T17:32:12Z"
  },
  {
    "title": "Trump announces 'Golden Dome' missile defence project plans",
    "description": "WASHINGTON: US President Donald Trump annouced plans on Tuesday (May 20) for a future Golden Dome missile defence program, which would likely cost taxpayers tens of",
    "link": "https://www.channelnewsasia.com/world/trump-announces-golden-dome-missile-defence-project-plans-5142501",
    "timestamp": "2025-05-20T17:32:00Z"
  },
  {
    "title": "Trump announces 'Golden Dome' missile defense project plans",
    "description": "WASHINGTON: US President Donald Trump annouced plans on Tuesday (May 20) for a future Golden Dome missile defence program, which would likely cost taxpayers tens of",
    "link": "https://www.channelnewsasia.com/world/trump-announces-golden-dome-missile-defense-project-plans-5142501",
    "timestamp": "2025-05-20T17:32:00Z"
  },
  {
    "title": "Jake Tapper says the media didn’t cover up Biden’s ‘Original Sin’: ‘We were just lied to’",
    "description": "Eleven minutes into the June 27 presidential debate, CNN anchor Dana Bash slipped a note to her colleague Jake Tapper after President Biden gave a rambling, incoherent answer. “He just lost the election,” she wrote. The event at the network’s Atlanta studios …",
    "link": "https://freerepublic.com/focus/f-news/4318111/posts",
    "timestamp": "2025-05-20T17:31:06Z"
  },
  {
    "title": "Trump migrant detentions at Guantanamo Bay cost $100,000 per person daily, senator says",
    "description": "WASHINGTON (Reuters) -President Donald Trump's use of the Guantanamo Bay naval base to house migrants appears to cost $100,000 per day for each detainee, U.S...",
    "link": "https://www.yahoo.com/news/trump-migrant-detentions-guantanamo-bay-173043423.html",
    "timestamp": "2025-05-20T17:30:43Z"
  },
  {
    "title": "Germany Vows More Sanctions On Russia After U.S./Russia Phone Call",
    "description": "Germany has vowed to put more sanctions on Russia in the aftermath of the phone call between Donald Trump and Vladimir Putin. The call allegedly alluded to the possibility of a ceasefire agreement between Russia and Ukraine.",
    "link": "https://www.shtfplan.com/headline-news/germany-vows-more-sanctions-on-russia-after-u-s-russia-phone-call",
    "timestamp": "2025-05-20T17:30:14Z"
  },
  {
    "title": "President Deals",
    "description": "I do think that even our finest foreign policy/affairs minds are always about 15 years behind where the rest of the world actually is.\nJapan on Tuesday clarified its stance on U.S. tariffs, saying it wants all new levies put into place by the administration o…",
    "link": "https://www.eschatonblog.com/2025/05/president-deals.html",
    "timestamp": "2025-05-20T17:30:00Z"
  },
  {
    "title": "European Stocks Gain for Fourth Straight Day; Orsted Jumps",
    "description": "European stocks rose for a fourth consecutive day, helped by renewable-energy stocks after President Donald Trump lifted an order halting construction on Equinor ASA’s $5 billion project off the coast of New York.",
    "link": "https://financialpost.com/pmn/business-pmn/european-stocks-gain-for-fourth-straight-day-orsted-jumps",
    "timestamp": "2025-05-20T17:29:47Z"
  },
  {
    "title": "Musk says he will cut back on political spending after paying at least $250M backing Trump in 2024",
    "description": "Elon Musk, the richest person in the world and a key financial supporter of President Donald Trump, says he’ll be spending less on political campaigns.",
    "link": "https://biztoc.com/x/e91ab5f76d9baf43",
    "timestamp": "2025-05-20T17:29:35Z"
  },
  {
    "title": "Keen quietly closed its Portland factory: report",
    "description": "Keen quietly closed its Portland factory: reportoregonlive.com",
    "link": "https://www.oregonlive.com/business/2025/05/keen-quietly-closed-its-portland-factory-report.html",
    "timestamp": "2025-05-20T17:28:29Z"
  },
  {
    "title": "Falling back into the shadows? How to keep internal displacement on the humanitarian agenda",
    "description": "Media coverage often focuses on those fleeing their country as refugees, while internally displaced people remain less visible and beholden to national governments.",
    "link": "https://theconversation.com/falling-back-into-the-shadows-how-to-keep-internal-displacement-on-the-humanitarian-agenda-255856",
    "timestamp": "2025-05-20T17:28:26Z"
  },
  {
    "title": "Why Trump Is Threatening to Investigate Bruce Springsteen",
    "description": "Donald Trump was prosecuted over campaign finance violations — so he wants to use them against celebrities like Springsteen, Oprah, and Beyonce.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-bruce-springsteen-threat-investigate-election-law-1235343852/",
    "timestamp": "2025-05-20T17:27:59Z"
  },
  {
    "title": "WHO Adopts A 'Pandemic Agreement' After The Chaos Of COVID",
    "description": "The U.S. was not part of the historic agreement, which received a scathing critique from Robert F. Kennedy Jr.",
    "link": "https://www.huffpost.com/entry/ap-eu-switzerland-who-pandemic-agreement_n_682cb986e4b01f0f394aeef4",
    "timestamp": "2025-05-20T17:27:18Z"
  },
  {
    "title": "Mom stabbed 7-year-old son for making a mess in their Rogers Park apartment: prosecutors",
    "description": "A woman is jailed after prosecutors on Monday accused her of stabbing her 7-year-old son for making a mess in their Rogers Park apartment over the weekend. As we reported Saturday, Chicago police arrested the woman at Evanston Hospital after she went there to…",
    "link": "https://freerepublic.com/focus/f-news/4318110/posts",
    "timestamp": "2025-05-20T17:25:45Z"
  },
  {
    "title": "Trump supporters find unlikely common ground with blue state congressman at town hall: 'I love it'",
    "description": "President Donald Trump supporters and Americans for Prosperity protesters lined the streets outside Democrat Rep. Ro Khanna's town hall in battleground Pennsylvania on Saturday night.",
    "link": "https://www.foxnews.com/politics/trump-supporters-find-unlikely-common-ground-blue-state-congressman-town-hall",
    "timestamp": "2025-05-20T17:25:13Z"
  },
  {
    "title": "Trump Ridiculed After Declaring Food Assistance Cut Will 'Give Everyone Much More Food': 'Doesn't Even Make Sense'",
    "description": "Social media users are mocking President Donald Trump for claiming that his proposed cuts to government funded food assistance programs would actually give Americans more access to food by helping decrease food prices nationwide.",
    "link": "https://www.ibtimes.com/trump-ridiculed-after-declaring-food-assistance-cut-will-give-everyone-much-more-food-doesnt-3774092",
    "timestamp": "2025-05-20T17:25:08Z"
  },
  {
    "title": "Trump tries to persuade, and threaten, GOP to back his budget bill",
    "description": "The massive tax and immigration bill, which is central to Trump’s second-term plans, faces continued resistance from both moderates and GOP hard-liners.President Donald Trump carted his bully pulpit to Capitol Hill on Tuesday, trying to persuade — and, at tim…",
    "link": "https://freerepublic.com/focus/f-news/4318109/posts",
    "timestamp": "2025-05-20T17:25:01Z"
  },
  {
    "title": "Exclusive: Marsha Blackburn Issues Bill to Ban Birth Tourism Loophole Used by Thousands of Foreigners Annually",
    "description": "Sen. Marsha Blackburn (R-TN) is issuing a bill that would effectively eliminate the multimillion-dollar birth tourism industry, where foreign nationals secure temporary visas to the United States for the sole purpose of delivering their unborn children who th…",
    "link": "https://www.breitbart.com/politics/2025/05/20/exclusive-marsha-blackburn-ban-birth-tourism-loophole/",
    "timestamp": "2025-05-20T17:24:38Z"
  },
  {
    "title": "Kash and Bongino losing trust over Epstein",
    "description": "This past weekend on Sunday Morning Futures with Maria Bartiromo, FBI director Kash Patel and his deputy, Dan Bongino, made a stunning declaration: Jeffrey Epstein committed suicide. That was it. Case closed. Bongino even said he’s “seen the file,” as if that…",
    "link": "https://freerepublic.com/focus/f-news/4318108/posts",
    "timestamp": "2025-05-20T17:24:28Z"
  },
  {
    "title": "Analysis-Trump-Putin call on war in Ukraine is another blow to Kyiv and its allies",
    "description": "KYIV/BERLIN/PARIS (Reuters) -For Ukraine and its allies, who spent months trying to win Donald Trump over to their cause in the war started by Russia, it is back to square one. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/21/analysis-trump-putin-call-on-war-in-ukraine-is-another-blow-to-kyiv-and-its-allies",
    "timestamp": "2025-05-20T17:23:00Z"
  },
  {
    "title": "Elon Musk Says He’ll Remain Tesla CEO For Next 5 Years And ‘Do A Lot Less’ Political Spending",
    "description": "Earlier reports suggested Tesla’s board was searching for a successor to Musk, who shot down the claim as “deliberately false.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/05/20/elon-musk-says-hell-remain-tesla-ceo-for-next-5-years-and-do-a-lot-less-political-spending/",
    "timestamp": "2025-05-20T17:22:06Z"
  },
  {
    "title": "Trump-Putin call on war in Ukraine is another blow to Kyiv and its allies",
    "description": "Donald Trump altered his approach to the Russia-Ukraine war after speaking with Vladimir Putin. He dropped demands for a ceasefire. This shift worries Ukraine and its allies. They fear reduced US support. Europe is trying to maintain aid. However, US weapons …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-putin-call-on-war-in-ukraine-is-another-blow-to-kyiv-and-its-allies/articleshow/121298356.cms",
    "timestamp": "2025-05-20T17:20:24Z"
  },
  {
    "title": "Nolte: Donald Trump's Job Approval Soars to 55%",
    "description": "The latest polling shows President Trump’s job approval rating has surged to 55 percent approve while only 44 percent disapprove.\nThe post Nolte: Donald Trump’s Job Approval Soars to 55% appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/20/nolte-donald-trumps-job-approval-soars-55/",
    "timestamp": "2025-05-20T17:19:29Z"
  },
  {
    "title": "Ramstad: No business can ‘eat’ all the tariffs, not even Walmart",
    "description": "So many people think big companies have so much money. Even Donald Trump.\nOver the weekend, the president sounded like a full-on anti-corporate populist leftie after executives at Walmart, the nation’s biggest company by revenue, warned they would have to rai…",
    "link": "https://biztoc.com/x/f79da7ad6c9c75b2",
    "timestamp": "2025-05-20T17:18:58Z"
  },
  {
    "title": "Musk says he will cut back on political spending after paying at least $250M backing Trump in 2024",
    "description": "Elon Musk, the richest person in the world and a key financial supporter of President Donald Trump, says he’ll be spending less on political campaigns.",
    "link": "https://www.pbs.org/newshour/politics/musk-says-he-will-cut-back-on-political-spending-after-paying-at-least-250m-backing-trump-in-2024",
    "timestamp": "2025-05-20T17:18:05Z"
  },
  {
    "title": "First Nations Worry Canada’s Push to Be an “Energy Superpower” Will Harm Them",
    "description": "Canada’s new prime minister is pushing to accelerate energy projects in a bid to decrease dependence on the US.",
    "link": "https://truthout.org/articles/first-nations-worry-canadas-push-to-be-an-energy-superpower-will-harm-them/",
    "timestamp": "2025-05-20T17:17:51Z"
  },
  {
    "title": "Trump Just Made Mike Johnson’s Job Harder",
    "description": "\"President Donald Trump was supposed to unite House Republicans. Instead, he came to the Capitol to rail against blue-state Republicans and hardline conservatives, leaving the two groups more dug in than ever,\" Punchbowl News reports.",
    "link": "https://politicalwire.com/2025/05/20/trump-just-made-mike-johnsons-job-harder/",
    "timestamp": "2025-05-20T17:16:55Z"
  },
  {
    "title": "Elon Musk Signals Retreat From Politics: ‘I Think I’ve Done Enough’",
    "description": "Elon Musk on Tuesday hinted that he could be much less involved in politics by the time the next election cycle rolls around -- at least financially.\nThe post Elon Musk Signals Retreat From Politics: ‘I Think I’ve Done Enough’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/elon-musk-signals-retreat-from-politics-i-think-ive-done-enough/",
    "timestamp": "2025-05-20T17:15:58Z"
  },
  {
    "title": "Jake Tapper Admits to Megyn Kelly He Didn't Press Biden on Health",
    "description": "Kelly accused the media of protecting the former president and pressed the authors on why their reporting hadn't come out sooner.",
    "link": "https://www.newsweek.com/jake-tapper-biden-book-megyn-kelly-interview-2074759",
    "timestamp": "2025-05-20T17:15:42Z"
  },
  {
    "title": "Doubts over US reliability grow in India after Trump’s diplomatic cover to Pakistan",
    "description": "Doubts over the United States' reliability as a strategic partner have resurfaced in India following US President Donald Trump’s recent actions seen as favourable to Pakistan. Indian strategic circles are frustrated by Trump's perceived diplomatic support for…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/doubts-over-us-reliability-grow-in-india-after-trumps-diplomatic-cover-to-pakistan/articleshow/121298264.cms",
    "timestamp": "2025-05-20T17:15:14Z"
  },
  {
    "title": "Donald Trump goes to Capitol Hill and warns House Republicans: Vote for my 'Big, Beautiful Bill' or get primaried",
    "description": "Donald Trump's much favored \"Big, Beautiful Bill\" has created a fissure within the Republican party.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-goes-to-capitol-hill-and-warns-house-republicans-vote-for-my-big-beautiful-bill-or-get-primaried/articleshow/121298209.cms",
    "timestamp": "2025-05-20T17:15:00Z"
  },
  {
    "title": "Trump struggles to convince Republican holdouts in Congress on tax bill",
    "description": "SummaryTrump meets with divided House Republicans Tax provisions, Medicaid cuts lead disputes Bill would extend tax cuts from Trump's first term WASHINGTON, May 20 (Reuters) - President Donald Trump on Tuesday pressed his fellow Republicans in the U.S. Congre…",
    "link": "https://freerepublic.com/focus/f-news/4318102/posts",
    "timestamp": "2025-05-20T17:14:13Z"
  },
  {
    "title": "Taiwan’s leader wants dialogue with China, but warns of need for stronger defences",
    "description": "Lai is taking more assertive approach towards Beijing, but there are fears over future US support for island",
    "link": "https://www.irishtimes.com/world/2025/05/20/taiwans-leader-wants-dialogue-with-china-but-warns-of-need-for-stronger-defences/",
    "timestamp": "2025-05-20T17:13:17Z"
  },
  {
    "title": "China Demonstrates High Cost Of Trumpian Uncertainty",
    "description": "China’s 5.4% growth rate in the first three months of the year is as impressive as it is disorienting.",
    "link": "https://www.forbes.com/sites/williampesek/2025/05/20/china-demonstrates-high-cost-of-trumpian-uncertainty/",
    "timestamp": "2025-05-20T17:12:57Z"
  },
  {
    "title": "‘You Did!’ Mark Halperin Refuses to Let Joe Scarborough Off the Hook for Infamous ‘Best Biden Ever’ Monologue",
    "description": "Mark Halperin refused to let Joe Scarborough off the hook over his infamous March 2024 rant about the \"best [Joe] Biden ever.\"\nThe post ‘You Did!’ Mark Halperin Refuses to Let Joe Scarborough Off the Hook for Infamous ‘Best Biden Ever’ Monologue first appeare…",
    "link": "https://www.mediaite.com/news/you-did-mark-halperin-refuses-to-let-joe-scarborough-off-the-hook-for-infamous-best-biden-ever-monologue/",
    "timestamp": "2025-05-20T17:12:45Z"
  },
  {
    "title": "‘You Did!’ Mark Halperin Refuses to Let Joe Scarborough Off the Hook for Infamous ‘Best Biden Ever’ Monologue",
    "description": "Mark Halperin refused to let Joe Scarborough off the hook over his infamous March 2024 rant about the \"best [Joe] Biden ever.\"\nThe post ‘You Did!’ Mark Halperin Refuses to Let Joe Scarborough Off the Hook for Infamous ‘Best Biden Ever’ Monologue first appeare…",
    "link": "https://www.mediaite.com/media/news/you-did-mark-halperin-refuses-to-let-joe-scarborough-off-the-hook-for-infamous-best-biden-ever-monologue/",
    "timestamp": "2025-05-20T17:12:45Z"
  },
  {
    "title": "At Hill Hearing, Rubio Warns of Possibility of New ‘Full-Scale Civil War’ in Syria",
    "description": "Secretary of State Marco Rubio laid out the Trump administration’s foreign policy agenda and defended government reforms from attacks by Democrats on the Senate Foreign... Read More\nThe post At Hill Hearing, Rubio Warns of Possibility of New ‘Full-Scale Civil…",
    "link": "https://www.dailysignal.com/2025/05/20/hill-hearing-rubio-warns-possibility-of-new-full-scale-civil-war-syria/",
    "timestamp": "2025-05-20T17:11:36Z"
  },
  {
    "title": "It’s Becoming Clearer What Trump Really Wants from Russia",
    "description": "The two leaders talked for more than two hours—and they probably didn't spend much of it discussing the prospects for peace.",
    "link": "https://slate.com/news-and-politics/2025/05/russia-ukraine-trump-putin-phone-call-ceasefire.html",
    "timestamp": "2025-05-20T17:11:23Z"
  },
  {
    "title": "Cadillac's EVs are attracting new buyers, including more customers trading in Teslas",
    "description": "DETROIT — Cadillac’s expanding all-electric vehicle lineup is attracting a notable number of new buyers to the American luxury brand, including an increase this year of Tesla owners trading in their EVs.",
    "link": "https://www.nbcnews.com/business/autos/cadillacs-evs-are-attracting-new-buyers-customers-trading-teslas-rcna207951",
    "timestamp": "2025-05-20T17:11:00Z"
  },
  {
    "title": "Elon Musk commits to stay as Tesla CEO for 5 more years amid political backlash",
    "description": "Elon Musk confirmed he’ll remain Tesla CEO for at least five more years despite growing political backlash and legal challenges. At the Qatar Economic Forum, Musk said he plans to cut back on political spending and emphasised his need for voting control over …",
    "link": "https://www.livemint.com/companies/news/elon-musk-commits-to-stay-as-tesla-ceo-for-5-more-years-amid-political-backlash-11747759658592.html",
    "timestamp": "2025-05-20T17:10:04Z"
  },
  {
    "title": "Trump Scares Global Leaders With How Fast He Caved to Putin on Call",
    "description": "Several world leaders were shocked by how submissive Donald Trump was to Moscow’s demands following a two-hour phone call with Russian President Vladimir Putin.\r\nShortly after hanging up Monday with his favorite autocrat, Trump hopped on the line with Ukraini…",
    "link": "https://newrepublic.com/post/195501/donald-trump-vladimir-putin-call-global-leaders-terrified",
    "timestamp": "2025-05-20T17:09:27Z"
  },
  {
    "title": "Senior DOJ Official Suggests Criminal Charges for Jill Biden After Latest Revelations",
    "description": "After Joe Biden's cancer diagnosis was announced on Sunday, many have slammed Jill Biden for \"elder abuse.\"",
    "link": "https://www.westernjournal.com/senior-doj-official-suggests-criminal-charges-jill-biden-latest-revelations/",
    "timestamp": "2025-05-20T17:09:26Z"
  },
  {
    "title": "Trump on Capitol Hill implores divided Republicans to unify behind his big tax cuts bill",
    "description": "WASHINGTON (AP) — President Donald Trump implored House Republicans at the Capitol to drop their fights over his big tax cuts bill and get it done, using encouraging words but also the hardened language of politics over the multitrillion-dollar package that i…",
    "link": "https://freerepublic.com/focus/f-news/4318100/posts",
    "timestamp": "2025-05-20T17:08:13Z"
  },
  {
    "title": "Elon Musk says he plans to spend 'a lot less' on future political contributions",
    "description": "Billionaire Elon Musk says he is now planning to spend \"a lot less\" on political contributions in the future after he was a major contributor to President Trump's reelection effort.",
    "link": "https://www.scrippsnews.com/entertainment/celebrity/elon-musk-says-he-plans-to-spend-a-lot-less-on-future-political-contributions",
    "timestamp": "2025-05-20T17:07:32Z"
  },
  {
    "title": "Nick Saban on Donald Trump's push to fix college sports: 'I don't think we need a commission'",
    "description": "Trump is eyeing Saban to co-chair a presidential commission looking into issues ailing college athletics",
    "link": "https://www.cbssports.com/college-football/news/nick-saban-on-donald-trumps-push-to-fix-college-sports-i-dont-think-we-need-a-commission/",
    "timestamp": "2025-05-20T17:07:30Z"
  },
  {
    "title": "Elon Musk granted exception to South Africa's Black ownership rules to operate Starlink",
    "description": "South Africa will loosen its Black ownership laws to allow Elon Musk to operate his Starlink service in his home country.The tech mogul claims to have been prohibited by what he calls \"openly racist ownership laws\" from setting up his satellite-powered intern…",
    "link": "https://www.rawstory.com/elon-musk-south-africa/",
    "timestamp": "2025-05-20T17:07:22Z"
  },
  {
    "title": "Trump fails to convince SALT caucus to back tax bill",
    "description": "President Donald Trump failed during a visit Tuesday to Capitol Hill to sway key House Republicans from blue states to drop opposition to a major tax bill, which they say does not go far enough in boosting so-called SALT deductions for their constituents.\nOpp…",
    "link": "https://biztoc.com/x/31de9a8fbea3d2c2",
    "timestamp": "2025-05-20T17:07:19Z"
  },
  {
    "title": "Nick Saban: 'I don't think we need a commission' on college sports. Here's why",
    "description": "Nick Saban continued to push his message ahead of a reported federal commission on college sports.",
    "link": "https://www.tuscaloosanews.com/story/sports/college/football/2025/05/20/nick-saban-reiterates-lack-of-need-for-federal-commission-on-college-sports/83732317007/",
    "timestamp": "2025-05-20T17:06:19Z"
  },
  {
    "title": "Third Trump-Putin call paves the way for trade, not sanctions",
    "description": "What did US President Donald Trump and his Russian counterpart Vladimir Putin talk about in their third call? The two have interpreted the conversation differently. But Ukraine likely wasn't the only topic.",
    "link": "https://www.dw.com/en/third-trump-putin-call-paves-the-way-for-trade-not-sanctions/a-72610113",
    "timestamp": "2025-05-20T17:05:00Z"
  },
  {
    "title": "Oil Swings in Choppy Trade as Investors Await Clarity on Iran",
    "description": "(Bloomberg) -- Oil swung in a choppy trade as broader financial markets weakened and uncertainty lingered about whether sanctions on Iran will be loosened or...",
    "link": "https://finance.yahoo.com/news/oil-steadies-focus-russia-ukraine-233204499.html",
    "timestamp": "2025-05-20T17:01:57Z"
  },
  {
    "title": "House Republican Concedes ‘Maybe It Needs to Be Addressed’ When Questioned on Trump Crypto Grift",
    "description": "Rich McCormick conceded when pressed by Mediaite founder Dan Abrams that \"maybe\" President Donald Trump's crypto \"entanglements\" need to be \"addressed.\"\nThe post House Republican Concedes ‘Maybe It Needs to Be Addressed’ When Questioned on Trump Crypto Grift …",
    "link": "https://www.mediaite.com/media/podcasts/house-republican-concedes-maybe-it-needs-to-be-addressed-when-questioned-on-trump-crypto-grift/",
    "timestamp": "2025-05-20T17:01:24Z"
  },
  {
    "title": "House Republican Concedes ‘Maybe It Needs to Be Addressed’ When Questioned on Trump Crypto Grift",
    "description": "Rich McCormick conceded when pressed by Mediaite founder Dan Abrams that \"maybe\" President Donald Trump's crypto \"entanglements\" need to be \"addressed.\"\nThe post House Republican Concedes ‘Maybe It Needs to Be Addressed’ When Questioned on Trump Crypto Grift …",
    "link": "https://www.mediaite.com/podcasts/house-republican-concedes-maybe-it-needs-to-be-addressed-when-questioned-on-trump-crypto-grift/",
    "timestamp": "2025-05-20T17:01:24Z"
  },
  {
    "title": "Musk Says Will Spend 'A Lot Less' On Political Campaigns",
    "description": "Billionaire Elon Musk said Tuesday he was pulling back from spending his fortune on politics, asserting his Tesla electric car company was doing well despite blowback over his support of US President Donald Trump.",
    "link": "https://www.ibtimes.com/musk-says-will-spend-lot-less-political-campaigns-3774091",
    "timestamp": "2025-05-20T17:00:24Z"
  },
  {
    "title": "Ukrainians Feel No Closer To Peace After Trump-Putin Call",
    "description": "Ukrainians felt no closer to peace following Donald Trump's two-hour phone call with Vladimir Putin on Monday, despite the US leader hailing the talks as a starting point for ending Russia's war.",
    "link": "https://www.ibtimes.com/ukrainians-feel-no-closer-peace-after-trump-putin-call-3774088",
    "timestamp": "2025-05-20T17:00:22Z"
  },
  {
    "title": "Musk Reveals Plans to Reduce Political Spending in Future Elections: 'I Think I've Done Enough'",
    "description": "After pouring over $250 million into Trump's 2024 campaign, billionaire Elon Musk says he plans to scale back political donations in future elections.",
    "link": "https://www.ibtimes.com/musk-reveals-plans-reduce-political-spending-future-elections-i-think-ive-done-enough-3774082",
    "timestamp": "2025-05-20T17:00:14Z"
  },
  {
    "title": "EXCLUSIVE: New SBA Database Aims to Boost Supply Chains to ‘Make Onshoring Great Again’",
    "description": "FIRST ON THE DAILY SIGNAL—The Trump administration has launched a new tool to help small businesses identify American manufacturers and producers. Small Business Administration chief... Read More\nThe post EXCLUSIVE: New SBA Database Aims to Boost Supply Chain…",
    "link": "https://www.dailysignal.com/2025/05/20/exclusive-trump-administration-gives-small-businesses-boost/",
    "timestamp": "2025-05-20T17:00:00Z"
  },
  {
    "title": "Kingdom Hearts Art Museum Trading Cards Debut in August",
    "description": "Square Enix announced a collection of Kingdom Hearts Art Museum trading cards, which will launch in Japan on August 30, 2025. A single pack of six cards will cost 550円 (~$4). It is also possible to buy a box of 20 packs for 11,000円 (~$76). As a reminder, thes…",
    "link": "https://www.siliconera.com/kingdom-hearts-art-museum-trading-cards-debut-in-august/",
    "timestamp": "2025-05-20T17:00:00Z"
  },
  {
    "title": "Israel’s Gaza aid plan could lead to ‘war crime’, UN agency chief says",
    "description": "Philippe Lazzarini says ‘primary intent’ of US-backed proposal is to push population south and even out of strip",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/20/israels-gaza-aid-plan-could-lead-to-war-crime-un-agency-chief-says/",
    "timestamp": "2025-05-20T16:59:20Z"
  },
  {
    "title": "Trump fails to convince SALT caucus to back tax bill",
    "description": null,
    "link": "https://www.cnbc.com/2025/05/20/trump-tax-bill-salt-gop.html",
    "timestamp": "2025-05-20T16:58:51Z"
  },
  {
    "title": "Mississippi tornado survivors await assistance from FEMA as Trump overhauls agency",
    "description": "The emergency management director in one of the state's hardest-hit counties said debris removal operations have ground to a halt and people who lost their homes aren't getting the help they need.",
    "link": "https://www.pbs.org/newshour/nation/mississippi-tornado-survivors-await-assistance-from-fema-as-trump-overhauls-agency",
    "timestamp": "2025-05-20T16:58:06Z"
  },
  {
    "title": "CBS News in distress amid Trump’s pressure campaign: ‘There’s a lot of fear’",
    "description": "Sometimes the arguments could be heard well down the hall. The topic was “60 Minutes,” and the tension was audible. CBS News chief Wendy McMahon was clashing with her bosses over upcoming stories on the newsmagazine — in part because President Trump’s legally…",
    "link": "https://freerepublic.com/focus/f-bloggers/4318098/posts",
    "timestamp": "2025-05-20T16:57:24Z"
  },
  {
    "title": "JPMorgan CEO Issues Inflation Warning",
    "description": "\"I think the chance of inflation going up and stagflation is a little higher than other people think,\" Jamie Dimon said on Monday.",
    "link": "https://www.newsweek.com/jpmorgan-ceo-jamie-dimon-inflation-stagflation-warning-2074774",
    "timestamp": "2025-05-20T16:56:41Z"
  },
  {
    "title": "Trump to name Michael Guetlein as Golden Dome head",
    "description": "United States President Donald Trump is expected to name Space Force General Michael Guetlein as the head of the Golden Dome project, the Washington Street Journal (WSJ) reported on Tuesday.According ...",
    "link": "https://biztoc.com/x/ee15d649c3f9d6c4",
    "timestamp": "2025-05-20T16:56:10Z"
  },
  {
    "title": "In 'Original Sin,' Jake Tapper describes a 'cover-up' of Joe Biden's decline",
    "description": "Tapper's book, co-authored by Alex Thompson, describes a president who struggled to function: \"One person told us that the presidency was, at best, a five-person board with Joe Biden as chairman.\"",
    "link": "https://www.npr.org/2025/05/20/nx-s1-5398050/joe-bidens-decline-jake-tapper-original-sin",
    "timestamp": "2025-05-20T16:55:20Z"
  },
  {
    "title": "There’s a Reason Cancer Studies Are Designed to Exclude People Like Joe Biden",
    "description": "At 82, would he even qualify for the trials he funded?",
    "link": "https://slate.com/technology/2025/05/joe-biden-cancer-diagnosis-research-trials-experimental-treatment.html",
    "timestamp": "2025-05-20T16:55:20Z"
  },
  {
    "title": "WATCH: President Trump Honors Three Fallen Deputies with First-Ever 'Medals of Sacrifice'",
    "description": "President Donald Trump on Monday honored three Florida deputies killed in the line of duty in 2024 with the first-ever Medals of Sacrifice.\nThe post WATCH: President Trump Honors Three Fallen Deputies with First-Ever ‘Medals of Sacrifice’ appeared first on Br…",
    "link": "https://www.breitbart.com/law-and-order/2025/05/20/watch-president-trump-honors-three-fallen-deputies-with-first-ever-medals-of-sacrifice/",
    "timestamp": "2025-05-20T16:52:34Z"
  },
  {
    "title": "US Masters Swimming under investigation after trans athlete takes five women's gold medals at Texas event",
    "description": "Texas investigates U.S. Masters Swimming policy after trans swimmer's wins, examining potential violations of state law protecting women's sports integrity.",
    "link": "https://www.foxnews.com/sports/us-masters-swimming-under-investigation-after-trans-athlete-takes-five-womens-gold-medals-texas-event",
    "timestamp": "2025-05-20T16:51:12Z"
  },
  {
    "title": "US trade panel's vote paves way for stiff tariffs on many solar imports",
    "description": "The U.S. International Trade Commission determined on Tuesday that domestic solar panel makers were materially harmed or threatened by a flood of cheap imports from four Southeast Asian nations, bringing the United States a step closer to imposing stiff dutie…",
    "link": "https://www.channelnewsasia.com/business/us-trade-panels-vote-paves-way-stiff-tariffs-many-solar-imports-5142571",
    "timestamp": "2025-05-20T16:50:39Z"
  },
  {
    "title": "Elon Musk says he’ll spend ‘a lot less’ money on politics | CNN Business",
    "description": "Elon Musk spent a record amount of money on the 2024 election to help get President Donald Trump elected.",
    "link": "https://www.cnn.com/2025/05/20/business/elon-musk-politics-spending",
    "timestamp": "2025-05-20T16:50:07Z"
  },
  {
    "title": "Trump tries to persuade, and threaten, GOP to support his budget bill (Washington Post)",
    "description": "Washington Post:\nTrump tries to persuade, and threaten, GOP to support his budget bill  —  The massive tax and immigration bill, which is central to Trump's second-term plans, faces continued resistance from both moderates and GOP hard-liners.  —  President D…",
    "link": "https://www.memeorandum.com/250520/p77",
    "timestamp": "2025-05-20T16:50:00Z"
  },
  {
    "title": "SEC crypto task force to release first report 'in the next few months'",
    "description": "US Securities and Exchange Commission (SEC) Paul Atkins appeared before lawmakers in one of his first hearings since becoming chair of the financial regulator, addressing questions about his plans for the cryptocurrency industry.In a May 20 hearing discussing…",
    "link": "https://cointelegraph.com/news/sec-chair-paul-atkins-report-crypto-months",
    "timestamp": "2025-05-20T16:49:07Z"
  },
  {
    "title": "US Health Agency Demands Drugmakers’ US Prices Match What Similar Nations Pay",
    "description": "The US Department of Health and Human Services is demanding that pharmaceutical companies cut drug prices to the lowest price offered to nations with economies that are similar to the US’s, the agency announced Tuesday.",
    "link": "https://financialpost.com/pmn/business-pmn/us-health-agency-demands-drugmakers-us-prices-match-what-similar-nations-pay",
    "timestamp": "2025-05-20T16:48:57Z"
  },
  {
    "title": "Trump to unveil plans for US missile defense shield that could cost billions",
    "description": "Donald Trump will announce the initial plans for the Golden Dome missile defense plan at the White House Tuesday afternoon, three U.S. officials confirmed to ABC News.",
    "link": "https://abcnews.go.com/Politics/trump-unveil-plans-us-missile-defense-shield-cost/story?id=121995258",
    "timestamp": "2025-05-20T16:48:48Z"
  },
  {
    "title": "Try to Make Any Sense of What Trump Says About Cutting Food Assistance",
    "description": "Donald Trump seems to think that cuts to food assistance means cheaper and more abundant food for everyone. \r\n“You campaigned on lowering the price of groceries. How can you justify cutting food assistance in this [budget] bill?” a reporter asked the presiden…",
    "link": "https://newrepublic.com/post/195496/trump-cut-food-assistance-budget-bill",
    "timestamp": "2025-05-20T16:48:05Z"
  },
  {
    "title": "Republican Holdouts Resist Trump Demand To Back Medicaid And Tax Cut Bill",
    "description": "Some lawmakers see the resistance cracking like it's cracked before.",
    "link": "https://www.huffpost.com/entry/big-beautiful-bill-house-trump-conservatives_n_682ca2e0e4b01df8005f33c0",
    "timestamp": "2025-05-20T16:47:19Z"
  },
  {
    "title": "SCOTUS Just Fine With Trump Revoking Protections For 350,000 Venezuelans In US Legally",
    "description": "Meanwhile, it appears Kristi Noem believes habeas corpus is just the puppies she shot along the way.",
    "link": "https://www.wonkette.com/p/scotus-just-fine-with-trump-revoking",
    "timestamp": "2025-05-20T16:47:15Z"
  }
]