[
  {
    "title": "GOP lawmakers praise Trump call with Putin after Biden 'refused to even pick up the phone'",
    "description": "President Donald Trump was hailed by GOP lawmakers after a phone call with Russian President Vladimir Putin, while Democrats remain unconvinced the country will enter into a peace deal.",
    "link": "https://www.foxnews.com/politics/gop-lawmakers-praise-trump-call-putin-after-biden-refused-even-pick-up-phone",
    "timestamp": "2025-03-18T20:48:43Z"
  },
  {
    "title": "Minnesota Republican Arrested in Underage Prostitution Sting",
    "description": "Both Republicans and Democrats are calling out their senatorial colleague for his alleged criminality.",
    "link": "https://www.newsweek.com/eichorn-minnesota-arrest-minor-prostitution-senate-republican-2046765",
    "timestamp": "2025-03-18T20:46:42Z"
  },
  {
    "title": "Would Support Proposal To Stop Energy Infrastructure Strikes: Zelensky",
    "description": "President Volodymyr Zelenskiy said Ukraine would support a US proposal to stop strikes on Russian energy infrastructure, and that he hoped to speak to U.S. President Donald Trump about his phone call on Tuesday with Russian President Vladimir Putin.",
    "link": "https://www.ndtv.com/world-news/ukraine-would-support-proposal-to-stop-energy-infrastructure-strikes-zelensky-7955338",
    "timestamp": "2025-03-18T20:45:52Z"
  },
  {
    "title": "Putin-Trump phone call: key takeaways",
    "description": "Russian President Vladimir Putin and US President Donald Trump held a phone call to address the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614453-putin-trump-talks-takeaways/",
    "timestamp": "2025-03-18T20:45:34Z"
  },
  {
    "title": "Countries Must Fill in Void Left by Shift in U.S. FCPA Enforcement, Says Leading Whistleblower Attorney",
    "description": "On February 10, President Donald Trump Trump issued an Executive Order halting enforcement of the Foreign Corrupt Practices Act (FCPA). In light of this shift in U.S. anti-corruption policy, leading whistleblower attorney Stephen M. Kohn is calling for a “Rev…",
    "link": "https://whistleblowersblog.org/foreign-corruption-whistleblowers/countries-must-fill-in-void-left-by-shift-in-u-s-fcpa-enforcement-says-leading-whistleblower-attorney/",
    "timestamp": "2025-03-18T20:45:32Z"
  },
  {
    "title": "Trump to attend NCAA men's wrestling championship (Jake Traylor/Politico)",
    "description": "Jake Traylor / Politico:\nTrump to attend NCAA men's wrestling championship  —  The trip comes weeks after the NCAA moved to ban transgender women from competing in women's sports in line with Trump's policy.  —  President Donald Trump plans to attend the NCAA…",
    "link": "https://www.memeorandum.com/250318/p120",
    "timestamp": "2025-03-18T20:45:02Z"
  },
  {
    "title": "Hungary passes bill against annual Budapest Pride march",
    "description": "<p>BUDAPEST - Hungarian lawmakers passed a bill on Tuesday aimed at banning Budapest's annual Pride march, the latest in a series of measures under Prime Minister Viktor Orban's government, which critics say curtail the rights of the EU country's LGBTQ commun…",
    "link": "https://www.bangkokpost.com/world/2982651/hungary-passes-bill-against-annual-budapest-pride-march",
    "timestamp": "2025-03-18T20:45:00Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "Here’s what made the headlines today.",
    "link": "https://www.thejournal.ie/headlines-today-tuesday-news-fix-6653151-Mar2025/",
    "timestamp": "2025-03-18T20:44:32Z"
  },
  {
    "title": "DOGE Marks 3.2 Million Social Security Accounts 120 Years and Older as 'Deceased'",
    "description": "The Department of Government Efficiency (DOGE) has marked approximately 3.2 million Social Security number-holders for people aged 120 and older as \"deceased\" as part of ongoing efforts to root out fraud.\nThe post DOGE Marks 3.2 Million Social Security Accoun…",
    "link": "https://www.breitbart.com/economy/2025/03/18/doge-marks-3-2-million-social-security-accounts-120-years-and-older-as-deceased/",
    "timestamp": "2025-03-18T20:43:45Z"
  },
  {
    "title": "Could Syria be the next frontier for Palestinian refugees?",
    "description": "After Trump’s statements, Arab governments emphasized their rejection of transferring Gaza’s population.",
    "link": "https://www.jpost.com/middle-east/article-846629",
    "timestamp": "2025-03-18T20:43:10Z"
  },
  {
    "title": "Why Non-white Voters and Young Men Drifted to Trump",
    "description": "Data analyst David Shor explains how Trump attracted an unlikely coalition, with especially large gains among non-white voters and young men, but may now be unraveling it with his conduct in office.",
    "link": "http://nymag.com/intelligencer/article/why-nonwhite-voters-and-young-men-drifted-to-trump.html",
    "timestamp": "2025-03-18T20:42:28Z"
  },
  {
    "title": "DOGE’s USAID dismantling likely violates the Constitution, judge rules",
    "description": "The order requires the Trump administration to restore email and computer access to all employees of USAID, including those put on administrative leave, though it appears to stops short of reversing firings or fully resurrecting the agency.",
    "link": "https://www.pbs.org/newshour/politics/doges-usaid-dismantling-likely-violates-the-constitution-judge-rules",
    "timestamp": "2025-03-18T20:41:53Z"
  },
  {
    "title": "Zelenskyy open to halting strikes on energy but needs details from Trump",
    "description": "Volodymyr Zelenskyy says he would support a proposal to stop strikes on energy infrastructure, but needs more details.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/3/18/zelenskyy-open-to-halting-strikes-on-energy-but-needs-details-from-trump",
    "timestamp": "2025-03-18T20:41:53Z"
  },
  {
    "title": "‘DOGE has broken into our building’: Federal bureaucrats panic, call cops for ‘illegal takeover’",
    "description": "Deposed leader claims agency is 'a private non-profit'",
    "link": "https://www.wnd.com/2025/03/doge-has-broken-into-our-building-federal-bureaucrats-panic-call-cops/",
    "timestamp": "2025-03-18T20:41:52Z"
  },
  {
    "title": "As Trump cuts aid, EU leaders look to contain ISIS-linked camps",
    "description": "55,000 Islamic State-linked detainees  are being held in Al Hol and Roj camps in northeastern Syria.",
    "link": "https://www.politico.eu/article/donald-trump-foreign-aid-cuts-eu-isis-camps-al-hol-roj/",
    "timestamp": "2025-03-18T20:41:51Z"
  },
  {
    "title": "New PM Carney anticipating conflict-of-interest screen around Brookfield dealings",
    "description": "Prime Minister Mark Carney says he expects the government's ethics commissioner will recommend he set up a screen around his previous business dealings to avoid any potential conflicts of interest.",
    "link": "https://www.cbc.ca/news/politics/carney-brookfield-screen-1.7486801",
    "timestamp": "2025-03-18T20:41:10Z"
  },
  {
    "title": "Pentagon is cutting up to 60,000 civilian jobs, administration aims for at least 5 percent total reduction",
    "description": "The official said Tuesday that to reach the goal of a 5% to 8% cut in a civilian workforce of more than 900,000, the department aims to cut another 6,000 positions a month by simply not replacing workers who routinely leave.",
    "link": "https://www.pbs.org/newshour/politics/pentagon-is-cutting-up-to-60000-civilian-jobs-administration-aims-for-at-least-5-percent-total-reduction",
    "timestamp": "2025-03-18T20:40:37Z"
  },
  {
    "title": "Big Bank Lobbying Groups Celebrate Trump’s Pick for Fed Vice Chair",
    "description": "Last night, President Trump nominated Michelle Bowman as the Federal Reserve’s Vice Chair for Supervision, a key role that oversees the Fed’s regulatory efforts. Bowman’s appointment was yet another gift from the Trump administration to the banking industry, …",
    "link": "https://www.commondreams.org/newswire/big-bank-lobbying-groups-celebrate-trumps-pick-for-fed-vice-chair",
    "timestamp": "2025-03-18T20:40:25Z"
  },
  {
    "title": "Trump is attacking libraries and museums in every state. Here are 3 things you can do to help communities fight back",
    "description": "On Friday, President Donald Trump issued yet another executive order aimed at gutting our federal agencies in the name of fiscal efficiency, this time slashing much-needed funding for libraries and museums nationwide.\nHis target is the Institute of Museum and…",
    "link": "https://biztoc.com/x/b43ed5ee0adaada1",
    "timestamp": "2025-03-18T20:40:05Z"
  },
  {
    "title": "The Irish Times view on Ireland and big pharma: State faces risks from overreliance",
    "description": "Major players have tried to use the importance of the sector to jobs and tax here to get Irish support at EU level",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/03/18/the-irish-times-view-on-ireland-and-big-pharma-state-faces-risks-from-overreliance/",
    "timestamp": "2025-03-18T20:40:00Z"
  },
  {
    "title": "I Teach Jewish Studies. Trump’s Department of Education Just Made My Job So Much Harder.",
    "description": "Students were willing to be honest in class. Now they're worried.",
    "link": "https://slate.com/life/2025/03/antisemitism-definition-trump-university-columbia-department-education.html",
    "timestamp": "2025-03-18T20:38:46Z"
  },
  {
    "title": "FBI arrests alleged MS-13 leader with help of Mexican government",
    "description": "FBI arrests alleged MS-13 leader with help of Mexican governmentgo.com",
    "link": "https://abcnews.go.com/Politics/fbi-arrests-alleged-ms-13-leader-mexican-government/story?id=119924149",
    "timestamp": "2025-03-18T20:38:11Z"
  },
  {
    "title": "HHS Website Removes Advisory Declaring Gun Violence a Public Health Crisis",
    "description": "The HHS web page that once featured the former surgeon general’s advisory on gun violence now reads “Page Not Found.”…",
    "link": "https://truthout.org/articles/hhs-website-removes-advisory-declaring-gun-violence-a-public-health-crisis/",
    "timestamp": "2025-03-18T20:37:59Z"
  },
  {
    "title": "Letters: Courts must check Trump’s abuse of wartime powers for deportations",
    "description": "\"The slippery slope is turning into an avalanche of the abuse of power. Immigrants today, citizens tomorrow; a dictatorship next week.\" -- Bob Stephenson, Englewood",
    "link": "https://www.denverpost.com/2025/03/18/trump-deportations-abuse-wartime-powers/",
    "timestamp": "2025-03-18T20:37:39Z"
  },
  {
    "title": "UK, EU in Talks to Accelerate Arms for Ukraine Before Ceasefire",
    "description": "The UK and European Union are in talks to accelerate arms shipments to Ukraine ahead of a potential full ceasefire, Britain’s foreign secretary told Bloomberg shortly before Vladimir Putin agreed to a limited truce.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-eu-in-talks-to-accelerate-arms-for-ukraine-before-ceasefire",
    "timestamp": "2025-03-18T20:37:13Z"
  },
  {
    "title": "Elon Musk’s Just-Revealed Texts to His Friend Tell You a Lot About His Character",
    "description": "Oculus founder-turned-defense-contractor Palmer Luckey is opening up about his not-quite-friendship with Elon Musk — and about the dumb \"anti-woke\" stuff they like to talk about. In an appearance on the Wall Street Journal's \"What's News\" podcast, the AI weap…",
    "link": "https://futurism.com/elon-musks-texts-friends-character",
    "timestamp": "2025-03-18T20:36:37Z"
  },
  {
    "title": "CASEY RYAN: Yes, American Education Can Survive Just Fine Without Federal Department",
    "description": "Trump can continue to clean up our nation’s education system without a hitch once ED is eliminated.",
    "link": "https://dailycaller.com/2025/03/18/opinion-american-education-can-survive-just-fine-without-federal-department-casey-ryan/",
    "timestamp": "2025-03-18T20:36:09Z"
  },
  {
    "title": "Trump’s War on Universities Is More Dangerous Than You Think",
    "description": "What his attack on Columbia means for America’s entire democratic system.",
    "link": "http://foreignpolicy.com/2025/03/18/trump-columbia-universities-attack-education-global-leader/",
    "timestamp": "2025-03-18T20:35:20Z"
  },
  {
    "title": "Decoding Michelle Obama's Speech, Which Perfectly Predicted Trump's Destructive Actions",
    "description": "During former Vice President Kamala Harris’ presidential campaign, a number of big names and political officials came onto the stage to help her gather votes. However, when former First Lady Michelle Obama grabbed the mic, she also took that moment to serve a…",
    "link": "https://www.theroot.com/decoding-michelle-obamas-speech-which-perfectly-predic-1851770805",
    "timestamp": "2025-03-18T20:35:00Z"
  },
  {
    "title": "Elon Musk has been buying up X shares near his initial purchase price",
    "description": "Elon Musk invested US$150 million to acquire X shares last year at a valuation near what he paid for the company’s equity in 2022. Read on",
    "link": "https://financialpost.com/investing/elon-musk-buying-x-shares-near-initial-purchase-price",
    "timestamp": "2025-03-18T20:34:54Z"
  },
  {
    "title": "Dropkick Murphys ‘broke up’ with Elon Musk before Ken Casey’s anti-Trump remarks at Boston show",
    "description": "Dropkick Murphys’ leading man Ken Casey says the punk band “broke up” with Elon Musk long before rumors started to swirl that the group’s X account got suspended because the singer called out a concertgoer flaunting a MAGA hat.",
    "link": "https://www.bostonherald.com/2025/03/18/dropkick-murphys-broke-up-with-elon-musk-before-ken-caseys-anti-trump-remarks-at-boston-show/",
    "timestamp": "2025-03-18T20:33:51Z"
  },
  {
    "title": "Chief Justice Roberts rebukes Trump and GOP rhetoric about impeaching judges - CNN",
    "description": "Chief Justice Roberts rebukes Trump and GOP rhetoric about impeaching judgesCNN Republicans Move to Impeach Judge After John Roberts' Rebuke of TrumpNewsweek Live updates: John Roberts rebukes Trump; USAID dismantling 'likely' unconstitutionalThe Hill Donald …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176765065",
    "timestamp": "2025-03-18T20:33:38Z"
  },
  {
    "title": "Live: Wall Street drops ahead of US Fed interest rates decision, ASX to follow suit",
    "description": "A fall on Wall Street is likely to send Australian stocks lower, as investors exercise caution ahead of a monetary policy decision from the Federal Reserve. Follow the latest updates in our live blog.",
    "link": "https://www.abc.net.au/news/2025-03-19/asx-markets-business-live-news-march-19-2025/105069228",
    "timestamp": "2025-03-18T20:33:37Z"
  },
  {
    "title": "Live: Wall Street plunges ahead of US Fed rates decision, ASX to follow suit",
    "description": "A fall on Wall Street is likely to send Australian stocks lower, as investors exercise caution ahead of a monetary policy decision from the Federal Reserve. Follow the latest updates in our live blog.",
    "link": "https://www.abc.net.au/news/2025-03-19/asx-markets-business-live-news-dec12-2023/105069228",
    "timestamp": "2025-03-18T20:33:37Z"
  },
  {
    "title": "Why Musk is dumping cash into Wisconsin's Supreme Court race",
    "description": "Ayman Mohyeldin highlights the upcoming Wisconsin Supreme Court election and explains how Musk's millions could help tip the race toward a Trump ally.",
    "link": "https://www.msnbc.com/top-stories/latest/musk-trump-wisconsin-supreme-court-election-rcna196736",
    "timestamp": "2025-03-18T20:33:23Z"
  },
  {
    "title": "Ford says energy surcharge remains on table but he won't 'antagonize' U.S. in talks",
    "description": "Ontario Premier Doug Ford is keeping the possibility of reintroducing a surcharge on electricity exported to the United States in his back pocket, but says for now he doesn't want to \"antagonize\" American officials.",
    "link": "https://www.cbc.ca/news/canada/toronto/doug-ford-ontario-energy-surcharge-still-on-table-us-tariffs-1.7486948",
    "timestamp": "2025-03-18T20:33:06Z"
  },
  {
    "title": "Canadian 'American Pie' Actress Was Held By ICE For 12 Days",
    "description": "Jasmine Mooney says she's still processing the \"inhumane\" conditions of the detention centers.",
    "link": "https://littlethings.com/entertainment/canadian-actress-known-for-american-pie-speaks-out-after-being-held-by-ice-for-12-days",
    "timestamp": "2025-03-18T20:32:30Z"
  },
  {
    "title": "Russia’s Putin agrees to 30-day halt in attacks on Ukraine energy targets",
    "description": "Announcement comes after Russian leader held a lengthy phone call with US President Donald Trump.",
    "link": "https://www.aljazeera.com/news/2025/3/18/russias-putin-agrees-to-30-day-halt-in-attacks-on-ukraine-energy-targets",
    "timestamp": "2025-03-18T20:32:25Z"
  },
  {
    "title": "Court Docs Reveal Just How Many Tren De Aragua Gangbangers Are On ICE’s Deportation List",
    "description": "Newly submitted court documents reveal just how many members of a ruthless Venezuelan gang are being held in ICE custody and detained elsewhere in the U.S.",
    "link": "https://dailycaller.com/2025/03/18/court-docs-reveal-tren-de-aragua-numbers/",
    "timestamp": "2025-03-18T20:31:43Z"
  },
  {
    "title": "Could the Bluest State in the Nation Get Voter ID?",
    "description": "California, one of the most solidly blue states in the nation, could be voting on adopting voter ID—an initiative that President Donald Trump called for... Read More\nThe post Could the Bluest State in the Nation Get Voter ID? appeared first on The Daily Signa…",
    "link": "https://www.dailysignal.com/2025/03/18/could-the-bluest-state-in-the-nation-get-voter-id/",
    "timestamp": "2025-03-18T20:31:35Z"
  },
  {
    "title": "Trump claims ‘contract for Peace’ in the works after 90-minute call with Putin",
    "description": "In a high-stakes phone call, US President Donald Trump and Russian President Vladimir Putin agreed to an immediate halt on strikes targeting Ukraine’s energy and infrastructure. While this is seen as the first step towards broader negotiations, Putin stopped …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-claims-contract-for-peace-in-the-works-after-90-minute-call-with-putin/articleshow/119177133.cms",
    "timestamp": "2025-03-18T20:30:20Z"
  },
  {
    "title": "Bill Gates warns he can’t make up funding difference after US government stripped global health payments: report - NewsBreak",
    "description": "Billionaire Bill Gates is reportedly appealing to the White House to keep funding global health programs – and warning that his own foundation is unable t",
    "link": "https://www.newsbreak.com/share/3861716894162-bill-gates-warns-he-can-t-make-up-funding-difference-after-us-government-stripped-global-health-payments-report?s=a2&share_destination_id=MjE0Mzc0NjMxLTE3NDI0MDcyNDQ3NzM%3D&pd=0EVUdLcy&hl=en_US&send_time=1742407244&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.11.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v3%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_model_exp_25q1-control%2Cns_local_strategy_25q1_exp-control%2Cns_foryou_rank_exp_25q1-v1",
    "timestamp": "2025-03-18T20:29:19Z"
  },
  {
    "title": "Bill Gates warns he can’t make up funding difference after US government stripped global health payments: report - NewsBreak",
    "description": "Billionaire Bill Gates is reportedly appealing to the White House to keep funding global health programs – and warning that his own foundation is unable t",
    "link": "https://www.newsbreak.com/share/3861716894162-bill-gates-warns-he-can-t-make-up-funding-difference-after-us-government-stripped-global-health-payments-report?_f=app_share&pd=07TiCGBg&lang=en_US&send_time=1742410093&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.11.0.51%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v8%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_blend_exp_25q1-v5&s=i2",
    "timestamp": "2025-03-18T20:29:19Z"
  },
  {
    "title": "Immigrants disappear from US detainee tracking system after deportation flights",
    "description": "Many families have no idea where to find their loved ones.",
    "link": "https://www.denverpost.com/2025/03/18/trump-deportations-searches/",
    "timestamp": "2025-03-18T20:29:17Z"
  },
  {
    "title": "Immigrants disappear from US detainee tracking system after deportation flights",
    "description": "Many families have no idea where to find their loved ones.",
    "link": "https://www.bostonherald.com/2025/03/18/trump-deportations-searches/",
    "timestamp": "2025-03-18T20:29:17Z"
  },
  {
    "title": "Russia, Ukraine accuse each other of attempting cross-border attack",
    "description": "(Reuters) - Russia and Ukraine accused each other of trying to launch cross-border attacks on Tuesday, each saying its forces had repelled attempted incursions. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/19/russia-ukraine-accuse-each-other-of-attempting-cross-border-attack",
    "timestamp": "2025-03-18T20:29:00Z"
  },
  {
    "title": "Some States Consider Bills That Would Punish People Seeking Abortions",
    "description": "Lawmakers in several states have introduced bills that would allow authorities to charge people who obtain abortions with homicide.",
    "link": "https://time.com/7269263/bills-punishing-people-seeking-abortions/",
    "timestamp": "2025-03-18T20:28:54Z"
  },
  {
    "title": "Why Donald Trump's Claims About Joe Biden's Signature Could Struggle",
    "description": "Joe Biden's preemptive pardons for Trump enemies are legal and binding, several attorneys have told Newsweek.\nPresident Donald Trump wrote on Monday that Biden's pardons for the January 6 committee are invalid because they were signed with an autopen.\nWhy It …",
    "link": "https://biztoc.com/x/58bb65184e2991cd",
    "timestamp": "2025-03-18T20:28:49Z"
  },
  {
    "title": "Canada PM Carney Announces Deal With Australia To Boost Arctic Radar",
    "description": "Prime Minister Mark Carney announced Tuesday a Can$6 billion (US$4.2 billion) deal with Australia to develop an Arctic radar system, warning that Canada must take more responsibility for its defence as US priorities shift.",
    "link": "https://www.ibtimes.com/canada-pm-carney-announces-deal-australia-boost-arctic-radar-3766748",
    "timestamp": "2025-03-18T20:27:07Z"
  },
  {
    "title": "'Taking over the Capitol again': Violent J6 rioter now seeks Marco Rubio's old Senate seat",
    "description": "A pardoned Jan. 6 defendant who was accused of violently attacking police at the Capitol is hoping to take over the Florida Senate seat vacated by Secretary of State Marco Rubio.Jake Lang never stood trial for his alleged role in the insurrection due to repea…",
    "link": "https://www.rawstory.com/jan-6-defendants-2671353588/",
    "timestamp": "2025-03-18T20:27:00Z"
  },
  {
    "title": "BARR: Government Over-Regulation Is Handing China The Energy Future",
    "description": "President Donald Trump’s planned executive order to bolster U.S. shipbuilding acknowledges a hard truth: China is winning the global economic battle, at least in the maritime sector.",
    "link": "https://dailycaller.com/2025/03/18/bob-barr-government-regulation-china-green-energy-future/",
    "timestamp": "2025-03-18T20:25:57Z"
  },
  {
    "title": "Is the US headed for recession? Donald Trump, Elon Musk, and White House allies debate the economy as Wall Street signals trouble ahead",
    "description": "Rising recession fears clash with Trump’s tariff strategy as economists warn of 50/50 odds. Explore the global trade war risks and Wall Street’s meltdown.",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-the-us-headed-for-recession-donald-trump-elon-musk-and-white-house-allies-debate-the-economy-as-wall-street-signals-trouble-ahead/articleshow/119177562.cms",
    "timestamp": "2025-03-18T20:25:54Z"
  },
  {
    "title": "Wiz Snubbed Google Then Said ‘Yes’ to an Extra $9 Billion",
    "description": "(Bloomberg) -- Last summer, investors persuaded the founders of cyber startup Wiz to turn down Google’s $23 billion takeover offer. They feared the US...",
    "link": "https://finance.yahoo.com/news/wiz-snubbed-google-then-said-202542585.html",
    "timestamp": "2025-03-18T20:25:42Z"
  },
  {
    "title": "Tesla investor calls for Elon Musk to step down as boss (James Sillars/Sky News)",
    "description": "James Sillars / Sky News:\nTesla investor calls for Elon Musk to step down as boss  —  Wealth manager Ross Gerber tells Sky News that Musk's time has become too stretched and his work alongside President Donald Trump too divisive.  —  Business and economics re…",
    "link": "https://www.memeorandum.com/250318/p115",
    "timestamp": "2025-03-18T20:25:00Z"
  },
  {
    "title": "‘Really is the best AI’: Left-wingers warm up to Grok as it shares brutal anti-Trump, Musk replies",
    "description": "Left-wing critics of Elon Musk are warming up to the billionaire's artificial intelligence (AI) program, Grok, after getting it to dish out anti-Musk and anti-Trump comments.\n\n\n\"Thank you for being honest @grok,\" posted one person, along with Grok stating tha…",
    "link": "https://www.dailydot.com/debug/grok-elon-musk-donald-trump/",
    "timestamp": "2025-03-18T20:24:04Z"
  },
  {
    "title": "Why Donald Trump's Claims About Joe Biden's Signature Could Struggle",
    "description": "Trump claims that Biden's pardons are \"vacant\" and \"void\", experts told Newsweek otherwise.",
    "link": "https://www.newsweek.com/president-donald-trump-joe-biden-pardons-january-6-committee-congress-2046622",
    "timestamp": "2025-03-18T20:23:55Z"
  },
  {
    "title": "Canada PM Carney announces deal with Australia to boost Arctic radar",
    "description": "Prime Minister Mark Carney announced Tuesday a Can$6 billion (US$4.2 billion) deal with Australia to develop an Arctic radar system, warning that Canada must take more responsibility for its defence as US priorities shift. Carney made the announcement in Iqal…",
    "link": "https://www.digitaljournal.com/world/canada-pm-carney-announces-deal-with-australia-to-boost-arctic-radar/article",
    "timestamp": "2025-03-18T20:22:32Z"
  },
  {
    "title": "Trump to Host Top UAE Official for Chips, Investment Talks",
    "description": "US President Donald Trump is expected to host a senior UAE official for dinner Tuesday at the White House, as the Gulf nation pushes to ease access to US technology by investing in the country.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-host-top-uae-official-for-chips-investment-talks",
    "timestamp": "2025-03-18T20:21:51Z"
  },
  {
    "title": "Putin 'showing signs of mini-stroke' as Kremlin insider drops major health bombshell - NewsBreak",
    "description": "EXCLUSIVE: Speculation about Vladimir Putin's health continues to grow ahead of his call with US President Donald Trump.",
    "link": "https://www.newsbreak.com/share/3861341357659-putin-showing-signs-of-mini-stroke-as-kremlin-insider-drops-major-health-bombshell?s=a2&share_destination_id=MjkyMjEzNDQzLTE3NDIzMjkyMjkyNDA%3D&pd=0Jm643A4&hl=en_US&send_time=1742329229&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.11.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v3%2Cns_local_strategy_25q1_exp-v10%2Cns_push_exp_rt_bucketv12-v1%2Cns_foryou_rank_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-v7%2Cns_foryou_model_exp_25q1-v9",
    "timestamp": "2025-03-18T20:21:21Z"
  },
  {
    "title": "Commerce Secretary Disbands PPAC and TPAC",
    "description": "IPWatchdog has learned that Commerce Secretary Howard Lutnick has decided to end all current appointments to both the Patent Public Advisory Committee (PPAC) and Trademark Public Advisory Committee (TPAC), effective immediately. Secretary Lutnick is expected …",
    "link": "https://ipwatchdog.com/2025/03/18/secretary-lutnick-disbands-ppac-tpac/id=187394/",
    "timestamp": "2025-03-18T20:21:11Z"
  },
  {
    "title": "Charles Oliveira: UFC fans 'should forget about Conor McGregor coming back'",
    "description": "Conor McGregor is no longer on Charles Oliveira's radar.",
    "link": "https://mmajunkie.usatoday.com/2025/03/ufc-charles-oliveira-conor-mcgregor-never-fight-again",
    "timestamp": "2025-03-18T20:20:47Z"
  },
  {
    "title": "'Trump Derangement Syndrome' Bill Guy Arrested For Soliciting A Minor For Prostitution",
    "description": "Minnesota state Sen. Justin Eichorn is not a drag queen.",
    "link": "https://www.wonkette.com/p/trump-derangement-syndrome-bill-guy",
    "timestamp": "2025-03-18T20:20:41Z"
  },
  {
    "title": "Promised release of JFK files has Trump supporters bracing for disappointment",
    "description": "Voters across the political spectrum are bracing for disappointment after President Donald Trump announced on Tuesday that he would release new files regarding the assassination of John F. Kennedy.\n\n\nTrump promised the so-called JFK files in remarks to report…",
    "link": "https://www.dailydot.com/debug/jfk-files-trump-supporters-disappointment/",
    "timestamp": "2025-03-18T20:19:23Z"
  },
  {
    "title": "The Putin-Trump call was a resounding success – whatever was said",
    "description": "Imagine the Russian and American leaders having a productive 2.5-hour-long conversation just two months ago Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614446-trump-putin-phone-call/",
    "timestamp": "2025-03-18T20:19:13Z"
  },
  {
    "title": "Amy Coney Barrett Recusing Herself From a Case on Public Funding For Religious Schools Is Mighty Interesting",
    "description": "When one recalls Clarence Thomas's arrogant refusal to recuse himself from hearing cases involving the January 6 insurrectionists, Barrett's decision to recuse herself here looks like high principle.",
    "link": "https://www.esquire.com/news-politics/politics/a64222844/oklahoma-catholic-school-funding-scotus/",
    "timestamp": "2025-03-18T20:18:00Z"
  },
  {
    "title": "‘Selling their souls’: Congresswoman rips news outlet for sexually suggestive headline with Trump offering his bed to her",
    "description": "'These works of fiction either belong in the bargain bin of the fantasy section in a discount bookstore or should be repurposed as tissue paper'",
    "link": "https://www.wnd.com/2025/03/selling-their-souls-congresswoman-rips-news-outlet-for-sexually-suggestive-headline-with-trump-offering-his-bed-to-her/",
    "timestamp": "2025-03-18T20:17:52Z"
  },
  {
    "title": "Judge rules DOGE's USAID dismantling likely violates the Constitution",
    "description": "The lawsuit singled out billionaire Elon Musk as a defendant covered by the preliminary injunction.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_323f17aa-814b-5f76-ace3-baa036a27009.html",
    "timestamp": "2025-03-18T20:17:00Z"
  },
  {
    "title": "Putin Placates Trump, But Dodges Wider Ukrainian Peace Deal",
    "description": "Russia has agreed to stop attacks on Ukrainian energy facilities, but is demanding concessions before it will agree to a wider ceasefire.",
    "link": "http://www.rollingstone.com/politics/politics-news/putin-placates-trump-dodges-ukraine-peace-deal-1235298903/",
    "timestamp": "2025-03-18T20:16:50Z"
  },
  {
    "title": "Campbell weighs in for transgender passports",
    "description": "A Trump campaign promise followed by a swiftly signed executive order could place transgender Bay State residents at risk of harm and may violate state laws, according to the Attorney General of Massachusetts and her colleagues from 11 other states.",
    "link": "https://www.bostonherald.com/2025/03/18/campbell-weighs-in-for-transgender-passports/",
    "timestamp": "2025-03-18T20:16:48Z"
  },
  {
    "title": "Trump's chaos could spook the ad business",
    "description": "People who run businesses hate uncertainty. There's a lot of uncertainty right now.",
    "link": "https://www.businessinsider.com/trumps-chaos-could-spook-ad-business-spending-2025-3",
    "timestamp": "2025-03-18T20:16:04Z"
  },
  {
    "title": "Former Surgeon General to Hospitals: Make 'Economic Case' for Public Health",
    "description": "Dr. Jerome Adams, former U.S. surgeon general during the first Trump administration, recently offered some communication advice for health care professionals.",
    "link": "https://www.newsweek.com/jerome-adams-former-surgeon-general-economic-benefits-public-health-2046745",
    "timestamp": "2025-03-18T20:15:23Z"
  },
  {
    "title": "‘Quiet panic’ as national rental assistance program set to run out of cash",
    "description": "Federal housing authorities announced that a COVID-era emergency housing voucher is running out of cash — and there’s no plan to save it.",
    "link": "https://www.kpbs.org/news/economy/2025/03/18/national-rental-assistance-program-running-out-of-money",
    "timestamp": "2025-03-18T20:14:30Z"
  },
  {
    "title": "Donald Trump Jr. reveals his thoughts on ex Vanessa’s new relationship with Tiger Woods",
    "description": "Happy ex-wife, happy life! A source exclusively told Page Six that Donald Trump Jr. is “fully supportive” of Vanessa Trump’s new relationship with Tiger Woods. Watch the full video to hear Page Six Senior Reporter Sarah Jones give the inside scoop on Don. Jr’…",
    "link": "https://pagesix.com/video/donald-trump-jr-reveals-his-thoughts-on-ex-vanessas-new-relationship-with-tiger-woods/",
    "timestamp": "2025-03-18T20:14:21Z"
  },
  {
    "title": "Live: PM agrees to sell $6.5b missile detection system to Canada",
    "description": "Anthony Albanese and new Canadian PM Mark Carney formalise a $6.5 billion deal for Canada to purchase an Australian-made military missile detection system. Follow live.",
    "link": "https://www.abc.net.au/news/2025-03-19/federal-politics-live-blog-march-19/105069154",
    "timestamp": "2025-03-18T20:12:25Z"
  },
  {
    "title": "Tesla's stock slump is driving Wall Street crazy — but not Elon Musk's employees",
    "description": "Wall Street is sounding the alarm over Tesla's stock slump. The sentiment among employees? Shrug.",
    "link": "https://www.businessinsider.com/tesla-stock-price-drop-employees-react-2025-3",
    "timestamp": "2025-03-18T20:11:32Z"
  },
  {
    "title": "Trump, Putin agree to begin ceasefire negotiations in Middle East, White House says",
    "description": "President Donald Trump spoke with Russian President Vladimir Putin for at least 90 minutes Tuesday about ending the war in Ukraine, the White House said, noting that the two leaders agreed that \"negotiations will begin immediately in the Middle East.\" The two…",
    "link": "https://freerepublic.com/focus/f-news/4305151/posts",
    "timestamp": "2025-03-18T20:11:18Z"
  },
  {
    "title": "Dropkick Murphys Singer Attacks Trump After Scolding MAGA Fan: ‘He’s a Rat and a Coward’",
    "description": "Ken Casey, the frontman for Irish rock band Dropkick Murphys, went on a tirade against President Donald Trump during a recent podcast appearance where he called Trump a \"rat\" and a \"coward\" for \"turning\" on America.\nThe post Dropkick Murphys Singer Attacks Tr…",
    "link": "https://www.breitbart.com/entertainment/2025/03/18/dropkick-murphys-singer-attacks-trump-after-scolding-maga-fan-hes-a-rat-and-a-coward/",
    "timestamp": "2025-03-18T20:11:14Z"
  },
  {
    "title": "Medicaid Round Table: Connecticut is Confronting A Health Care Crisis - NewsBreak",
    "description": "NEW HAVEN, CT – With Medicaid facing unprecedented cuts at the federal level, Connecticut is on the verge of a healthcare crisis that could devastate famil",
    "link": "https://www.newsbreak.com/share/3860838439486-medicaid-round-table-connecticut-is-confronting-a-health-care-crisis?s=a2&share_destination_id=MjAwNzE3NTUyLTE3NDIzMjg2NDI1MTY%3D&pd=0DaBnse0&hl=en_US&send_time=1742328642&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v13%2Cns_foryou_rank_exp_25q1-v7%2Cns_foryou_recall_exp_25q1-v3",
    "timestamp": "2025-03-18T20:11:13Z"
  },
  {
    "title": "What Sky's correspondents think about the Trump-Putin call",
    "description": "Donald Trump and Vladimir Putin spoke on the phone on Tuesday for at least 90 minutes.",
    "link": "https://news.sky.com/story/what-skys-correspondents-think-about-the-trump-putin-phone-call-13331596",
    "timestamp": "2025-03-18T20:11:00Z"
  },
  {
    "title": "Maine responds to Trump admin's declaration state violated Title IX by allowing transgenders in girls sports",
    "description": "The Maine Principals’ Association issued a response to the DHHS announcement that the state violated Title IX by letting trans athletes in girls sports.",
    "link": "https://www.foxnews.com/sports/maine-responds-trump-admins-declaration-state-violated-title-ix-allowing-transgenders-girls-sports",
    "timestamp": "2025-03-18T20:10:54Z"
  },
  {
    "title": "Carney signals he's in no rush to speak with Trump after visit to U.K., France",
    "description": "Prime Minister Mark Carney signalled Tuesday he is in no rush to speak to his U.S. counterpart about the ongoing trade war between the two countries, saying a call will come at the \"appropriate time.\"",
    "link": "https://www.cbc.ca/news/politics/carney-trump-call-appropriate-time-1.7486880",
    "timestamp": "2025-03-18T20:10:51Z"
  },
  {
    "title": "Podcaster Joe Rogan doesn't support Donald Trump on Canada, instead wants this country to be USA's 51st state",
    "description": "Joe Rogan slams US-Canada tensions as “ridiculous,” urging unity amid anthem booing and Trump’s tariff threats. Explore the feud’s roots in sports, trade, and diplomacy.",
    "link": "https://economictimes.indiatimes.com/news/international/us/podcaster-joe-rogan-doesnt-support-donald-trump-on-canada-instead-wants-this-country-to-be-usas-51st-state/articleshow/119177320.cms",
    "timestamp": "2025-03-18T20:10:25Z"
  },
  {
    "title": "Here’s Where Trump’s Government Layoffs Are Targeted—As Pentagon Reportedly Plans 60,000 Job Cuts",
    "description": "The Trump administration has laid off thousands amid cost-cutting efforts.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/18/heres-where-trumps-government-layoffs-are-targeted-as-judge-orders-reinstatement-of-thousands-of-fired-workers/",
    "timestamp": "2025-03-18T20:10:17Z"
  },
  {
    "title": "Pro-Trump Lawmaker Behind Bill to Name ‘TDS’ a Mental Illness Jailed Same Day For Allegedly Soliciting Teen For Sex",
    "description": "Minnesota State Senator Justin Eichorn (R) had a very busy Monday. He was one of five Republican co-authors to introduce a bill that would add \"Trump Derangement Syndrome\" (\"TDS\") to the state's statutory definition of mental illness. And, according to police…",
    "link": "https://www.mediaite.com/crime/pro-trump-lawmaker-behind-bill-to-name-tds-a-mental-illness-jailed-same-day-for-allegedly-soliciting-teen-for-sex/",
    "timestamp": "2025-03-18T20:08:49Z"
  },
  {
    "title": "Republicans Move to Impeach Judge After John Roberts' Rebuke of Trump",
    "description": "Texas Representative Brandon Gill criticized the judge in a post on X.",
    "link": "https://www.newsweek.com/judge-boasberg-impeachment-filing-brandon-gill-2046750",
    "timestamp": "2025-03-18T20:08:06Z"
  },
  {
    "title": "US closes lower with Trump-Putin call in limelight",
    "description": "Major stock indexes in the United States ended Tuesday's session with losses after US President Donald Trump and his Russian counterpart Vladimir Putin held an eagerly expected phone call. The two lea...",
    "link": "https://biztoc.com/x/5432b66921ec9a80",
    "timestamp": "2025-03-18T20:06:54Z"
  },
  {
    "title": "Former Republican governor of key swing state mulls bid to flip Senate seat",
    "description": "Former New Hampshire Gov. Chris Sununu, in an interview with Fox News Digital, on the possibility of launching a 2026 Senate run and on his relationship with President Donald Trump.",
    "link": "https://www.foxnews.com/politics/former-republican-governor-key-swing-state-mulls-bid-flip-senate-seat",
    "timestamp": "2025-03-18T20:06:52Z"
  },
  {
    "title": "U.S. could lose democracy status, says global watchdog",
    "description": "Possibly defying a court order. Urging his Justice Department to prosecute nemeses. Repeatedly calling the media 'illegal.' Declaring a predecessor's pardon null and void. U.S. President Donald Trump has done these things in the past few days.",
    "link": "https://www.cbc.ca/news/world/trump-democracy-report-1.7486317",
    "timestamp": "2025-03-18T20:06:52Z"
  },
  {
    "title": "Putin Agrees to Limit Ukraine Attacks But Won’t Commit to Truce",
    "description": "Vladimir Putin committed in a phone call with Donald Trump to limit Russian attacks on Ukrainian energy infrastructure for 30 days but declined to accept the broader ceasefire that the US sought.\nThe Russian and US presidents agreed that the two sides would b…",
    "link": "https://biztoc.com/x/7d09a193438f73d6",
    "timestamp": "2025-03-18T20:06:22Z"
  },
  {
    "title": "Ankara pushes for closer cooperation, seeks Erdogan-Trump meeting",
    "description": "Turkish President Erdogan is seeking a White House meeting with Trump, aiming to strengthen ties and discuss regional stability, including conflicts in Ukraine and Syria.",
    "link": "https://www.jpost.com/american-politics/article-846620",
    "timestamp": "2025-03-18T20:06:12Z"
  },
  {
    "title": "Ukraine would support proposal to stop energy infrastructure strikes, Zelenskiy says",
    "description": "KYIV (Reuters) - President Volodymyr Zelenskiy said Ukraine would support a U.S. proposal to stop strikes on Russian energy infrastructure, and that he hoped to speak to U.S. President Donald Trump about his phone call on Tuesday with Russian President Vladim…",
    "link": "https://www.thestar.com.my/news/world/2025/03/19/ukraine-would-support-proposal-to-stop-energy-infrastructure-strikes-zelenskiy-says",
    "timestamp": "2025-03-18T20:06:00Z"
  },
  {
    "title": "Ukraine open to energy ceasefire, but Volodymyr Zelensky demands details from Donald Trump",
    "description": "Ukraine has signalled tentative support for a U.S.-brokered agreement to halt strikes on Russian energy infrastructure, following a call between U.S. President Donald Trump and Russian President Vladimir Putin. Ukrainian President Volodymyr Zelensky emphasise…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ukraine-open-to-energy-ceasefire-but-volodymyr-zelensky-demands-details-from-donald-trump/articleshow/119177233.cms",
    "timestamp": "2025-03-18T20:05:46Z"
  },
  {
    "title": "Teslas Torched at Las Vegas Facility in ‘Targeted Attack’",
    "description": "Authorities say the suspect damaged five cars with Molotov cocktails and a firearm and spray-painted \"Resist\" on the front of the building",
    "link": "http://www.rollingstone.com/culture/culture-news/teslas-destroyed-attack-las-vegas-facility-1235298866/",
    "timestamp": "2025-03-18T20:05:08Z"
  },
  {
    "title": "As Israel Bombs Gaza, Tlaib, Sanders Plead: “NO MORE MILITARY AID TO ISRAEL”",
    "description": "“They will never stop until there are sanctions and an arms embargo,” Rep. Rashida Tlaib warned.",
    "link": "https://truthout.org/articles/as-israel-bombs-gaza-tlaib-sanders-plead-no-more-military-aid-to-israel/",
    "timestamp": "2025-03-18T20:04:55Z"
  },
  {
    "title": "'It's a Heist': Real Federal Auditors Are Horrified by DOGE",
    "description": "WIRED talked to actual federal auditors about how government auditing works—and how DOGE is doing the opposite.",
    "link": "https://www.wired.com/story/federal-auditors-doge-elon-musk/",
    "timestamp": "2025-03-18T20:04:53Z"
  }
]