[
  {
    "title": "Russia kills 27 civilians in Ukraine as the Kremlin remains defiant over Trump threats",
    "description": "The attacks came despite Trump’s threat to punish Russia with sanctions and tariffs.",
    "link": "https://www.bostonherald.com/2025/07/29/russia-ukraine-war-civilians-killed/",
    "timestamp": "2025-07-29T17:09:35Z"
  },
  {
    "title": "Trump's EU Deal May Not Hurt Putin",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nEuropean Union chief Ursula von der Leyen said the deal she struck with Donald Trump will lessen the reliance on Russia's energy exports but there is doubt over whether the agreement can curb funding for Vladi…",
    "link": "https://biztoc.com/x/e18be1754bd84b1e",
    "timestamp": "2025-07-29T17:09:06Z"
  },
  {
    "title": "Palestinian involved in Oscar-winning West Bank film shot dead by Israeli settler, director says",
    "description": "Odeh Hathaleen, who was killed, helped film the Oscar-winning documentary No Other Land.",
    "link": "https://www.bbc.com/news/articles/c776x78517po",
    "timestamp": "2025-07-29T17:08:31Z"
  },
  {
    "title": "Some Democrats warn that Epstein is a 'distraction' from Trump's unpopular big bill",
    "description": "Democrats can’t stop talking about releasing the Jeffrey Epstein files. But some say it is a distraction from Donald Trump's unpopular big, beautiful bill.",
    "link": "https://www.nbcnews.com/politics/congress/democrats-warn-epstein-distraction-trumps-unpopular-big-bill-rcna221535",
    "timestamp": "2025-07-29T17:05:44Z"
  },
  {
    "title": "WATCH: Donald Trump Cuts Ribbon to Officially Open Second Golf Course at Aberdeen",
    "description": "President Donald Trump officially cut the ribbon for the new golf course at Trump International Golf Links Aberdeen on Monday, the final day of his historic trip to Scotland.\nThe post WATCH: Donald Trump Cuts Ribbon to Officially Open Second Golf Course at Ab…",
    "link": "https://www.breitbart.com/politics/2025/07/29/watch-donald-trump-cuts-ribbon-officially-open-second-golf-course-aberdeen/",
    "timestamp": "2025-07-29T17:05:41Z"
  },
  {
    "title": "The Hunted Have Become the Hunters",
    "description": "After enduring four brutal years of being relentlessly prosecuted, surveilled, slandered, and even shot at, President Trump has returned to finish what he started. His mission remains the same, to Make America Great Again, but to accomplish his goals he must …",
    "link": "https://freerepublic.com/focus/f-chat/4331462/posts",
    "timestamp": "2025-07-29T17:05:28Z"
  },
  {
    "title": "UK To Recognize Palestine State By Fall Unless Israel Stops War",
    "description": "Prime Minister Keir Starmer said the UK would formally recognize a Palestinian state by the United Nations General Assembly in September if Israel does not stop its war in Gaza.",
    "link": "https://www.ndtvprofit.com/world/uk-to-recognize-palestine-state-by-fall-unless-israel-stops-war",
    "timestamp": "2025-07-29T17:05:15Z"
  },
  {
    "title": "VCU Health to stop medicinal care for transgender youth",
    "description": "The VCU Health System will stop providing medicinal care related to gender transition for children under 19 years old, as the Trump administration seeks to ban gender-affirming health care for minors.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_0d392925-838b-410a-b2c9-08c33b05c788.html",
    "timestamp": "2025-07-29T17:04:00Z"
  },
  {
    "title": "All the Canonical Donald Trumps on ‘South Park’",
    "description": "Not all ‘South Park’ Trumps were created equally",
    "link": "https://www.cracked.com/article_47614_all-the-canonical-donald-trumps-on-south-park.html",
    "timestamp": "2025-07-29T17:03:00Z"
  },
  {
    "title": "Trump's EU Deal May Not Hurt Putin",
    "description": "The EU's Ursula von der Leyen said too much Russian energy still enters Europe, despite sanctions.",
    "link": "https://www.newsweek.com/trump-gas-energy-eu-deal-2105616",
    "timestamp": "2025-07-29T17:02:25Z"
  },
  {
    "title": "Nationwide Walmart Boycott Planned For August 1: What to Know",
    "description": "The People's Union USA is launching another boycott of the retail giant.",
    "link": "https://www.newsweek.com/nationwide-walmart-boycott-planned-august-peoples-union-what-know-2105798",
    "timestamp": "2025-07-29T17:02:19Z"
  },
  {
    "title": "This Scottish Protester's Simple Words About Donald Trump Are Going Viral",
    "description": "\"If you think you're embarrassed, what do you think those of us who are sane over here feel.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/scottish-protesters-words-for-trump",
    "timestamp": "2025-07-29T17:00:58Z"
  },
  {
    "title": "What to Expect From Chevron’s Massive Guyana Investment",
    "description": "Guyana has been the hot new spot for oil exploration in recent years, following several big discoveries. Multiple oil majors are investing in operations in the South American country, as they aim to pump “low-carbon oil” in a bid to continue developing their …",
    "link": "https://oilprice.com/Energy/Energy-General/What-to-Expect-From-Chevrons-Massive-Guyana-Investment.html",
    "timestamp": "2025-07-29T17:00:00Z"
  },
  {
    "title": "Cambodia-Thailand Truce Broadly Holds Despite Shaky Start",
    "description": "An uneasy ceasefire between Thailand and Cambodia appeared to hold on Tuesday, as military commanders met despite Bangkok's allegations the truce had been breached with sporadic skirmishes.",
    "link": "https://www.ibtimes.com.au/cambodia-thailand-truce-broadly-holds-despite-shaky-start-1859883",
    "timestamp": "2025-07-29T16:57:16Z"
  },
  {
    "title": "Revenue hit seen from US-PH deal",
    "description": "THE Philippines could lose roughly P3 billion to P6 billion in forgone revenues from zero tariffs on selected products from the United States, a Cabinet official said on Tuesday.",
    "link": "https://www.manilatimes.net/2025/07/30/business/top-business/revenue-hit-seen-from-us-ph-deal/2158258",
    "timestamp": "2025-07-29T16:56:08Z"
  },
  {
    "title": "Trump Used Your Tax Dollars to Open His New Scottish Golf Course (Rolling Stone)",
    "description": "Rolling Stone:\nTrump Used Your Tax Dollars to Open His New Scottish Golf Course  —  The president continues to profit off of the office in increasingly blatant — and costly — ways  —  President Donald Trump continued his Profit-Off-The-Presidency World Tour t…",
    "link": "https://www.memeorandum.com/250729/p51",
    "timestamp": "2025-07-29T16:55:00Z"
  },
  {
    "title": "The Simpsons Season 37 & FOX Animation Domination Lineup Premiere Date Revealed",
    "description": "The Simpsons season 37 returns to screens later in 2025, and Fox finally announced its premiere date along with Bob's Burgers and Krapopolis returns.",
    "link": "https://screenrant.com/the-simpsons-universal-basic-guys-krapopolis-bobs-brugers-2025-release-date/",
    "timestamp": "2025-07-29T16:53:19Z"
  },
  {
    "title": "P&G Estimates $1 Bn Tariff Hit, Plans Some US Price Hikes",
    "description": "Procter & Gamble executives projected a $1 billion hit from US tariffs over the next year on Tuesday as the consumer products giant said it would institute limited price hikes in the United States.",
    "link": "https://www.ibtimes.com/pg-estimates-1-bn-tariff-hit-plans-some-us-price-hikes-3779730",
    "timestamp": "2025-07-29T16:51:13Z"
  },
  {
    "title": "FEMA to require states use terrorism prevention funds for migrant arrests",
    "description": "WASHINGTON (Reuters) -The Federal Emergency Management Agency will require states to spend part of their federal terrorism prevention funds on helping the Trump administration arrest migrants, as part of the U.S. president's transformation of the agency.  Rea…",
    "link": "https://www.thestar.com.my/news/world/2025/07/30/fema-to-require-states-use-terrorism-prevention-funds-for-migrant-arrests",
    "timestamp": "2025-07-29T16:51:00Z"
  },
  {
    "title": "'Almost sarcastic': Trump dig at Rupert Murdoch seen as clear attempt to 'poke the bear'",
    "description": "President Donald Trump's defamation lawsuit against Rupert Murdoch and the Wall Street Journal has gotten personal.The president claims he personally told the media mogul claims he'd penned a bawdy birthday message for Jeffrey Epstein two decades prior were f…",
    "link": "https://www.rawstory.com/trump-lawsuit-rupert-murdoch/",
    "timestamp": "2025-07-29T16:50:49Z"
  },
  {
    "title": "John Roberts has become the worst modern Supreme Court chief justice | Opinion",
    "description": "With each passing week, Chief Justice John Roberts and his Republican-friendly colleagues bestow never-before-enjoyed authorities upon the Trump Administration. The plan seems to be — if we grant the president everything he dreams of, maybe he’ll leave the hi…",
    "link": "https://freerepublic.com/focus/f-chat/4331460/posts",
    "timestamp": "2025-07-29T16:50:28Z"
  },
  {
    "title": "John Roberts has become the worst modern Supreme Court chief justice | Opinion",
    "description": "With each passing week, Chief Justice John Roberts and his Republican-friendly colleagues bestow never-before-enjoyed authorities upon the Trump Administration. The plan seems to be — if we grant the president everything he dreams of, maybe he’ll leave the hi…",
    "link": "https://freerepublic.com/focus/f-news/4331460/posts",
    "timestamp": "2025-07-29T16:50:28Z"
  },
  {
    "title": "The Supreme Court Needs to Draw a Line in the Sand on the Judicial Insurrection",
    "description": "District court judges have usurped President Donald Trump’s control over the Executive Branch, too often requiring the Supreme Court to intervene to stop the judicial... Read More\nThe post The Supreme Court Needs to Draw a Line in the Sand on the Judicial Ins…",
    "link": "https://www.dailysignal.com/2025/07/29/supreme-court-needs-draw-line-sand-judicial-insurrection/",
    "timestamp": "2025-07-29T16:50:21Z"
  },
  {
    "title": "DOJ Files Complaint Against Judge Boasberg, Alleging Misconduct",
    "description": "\"By expressing his view that a particular litigant would violate court orders, Judge Boasberg degraded public confidence in the integrity of the judiciary.\"\nThe post DOJ Files Complaint Against Judge Boasberg, Alleging Misconduct first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/07/doj-files-complaint-against-judge-boasberg-alleging-misconduct/",
    "timestamp": "2025-07-29T16:49:06Z"
  },
  {
    "title": "Trump Environmental Protection Agency moves to repeal finding that allows climate regulation",
    "description": "President Donald Trump’s administration has proposed revoking a scientific finding that's long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change.",
    "link": "https://www.clickondetroit.com/business/2025/07/29/trump-epa-moves-to-repeal-landmark-finding-that-allows-climate-regulation/",
    "timestamp": "2025-07-29T16:48:42Z"
  },
  {
    "title": "In the country that Trump claims 'nobody has ever heard of', his name evokes fear and panic",
    "description": "A blanket of thick fog covers Lesotho's capital, Maseru.",
    "link": "https://news.sky.com/story/lesotho-in-the-country-that-trump-claims-nobody-has-ever-heard-of-his-name-evokes-fear-and-panic-13403636",
    "timestamp": "2025-07-29T16:47:00Z"
  },
  {
    "title": "With AI plan, Trump keeps chipping away at a foundational environmental law",
    "description": "By MELINA WALLING and MATTHEW DALY\nWhen President Donald Trump rolled out a plan to boost artificial intelligence and data centers, a key goal was wiping away barriers to rapid growth.\nRelated Articles\n \n \n \n Trump’s EPA moves to repeal finding that allows cl…",
    "link": "https://biztoc.com/x/b68a325bf6b87e28",
    "timestamp": "2025-07-29T16:46:09Z"
  },
  {
    "title": "Starmer says UK will recognize Palestinian state unless Israel agrees to a ceasefire",
    "description": "The Prime Minister called for Israel to address the \"appalling situation in Gaza.\"",
    "link": "https://www.bostonherald.com/2025/07/29/britain-palestinians/",
    "timestamp": "2025-07-29T16:43:31Z"
  },
  {
    "title": "Pete Buttigieg says Democrats must end ‘preachy’ politics to combat Trump’s autocratic government takeover",
    "description": "Pete Buttigieg is no longer in the Cabinet or actively campaigning, but this week, the former Transportation secretary stepped back into the national political spotlight with a pair of interviews that touched on LGBTQ+ rights, authoritarianism, and the intern…",
    "link": "https://www.advocate.com/news/pete-buttigieg-democrats-preachy-politics",
    "timestamp": "2025-07-29T16:42:57Z"
  },
  {
    "title": "Lionesses Party With Thousands Of Fans After Euro 2025 Triumph",
    "description": "England's victorious Lionesses celebrated their dramatic Women's Euro 2025 triumph along with tens of thousands of ecstatic fans outside Buckingham Palace on Tuesday.",
    "link": "https://www.ibtimes.com.au/lionesses-party-thousands-fans-after-euro-2025-triumph-1859880",
    "timestamp": "2025-07-29T16:42:10Z"
  },
  {
    "title": "US, China finish talks in Stockholm as tariff truce holds for now",
    "description": "U.S. and Chinese officials concluded talks in Stockholm, aiming to de-escalate trade tensions and extend a tariff truce established in May. While no major breakthroughs were announced, both sides agreed to pursue an extension of the 90-day truce. The discussi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-china-finish-talks-in-stockholm-as-tariff-truce-holds-for-now/articleshow/122980531.cms",
    "timestamp": "2025-07-29T16:41:19Z"
  },
  {
    "title": "Traveled cross-country from Vegas...",
    "description": "Traveled cross-country from Vegas...\r\n\n \n \n \n (Top headline, 2nd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Madman Took Wrong Elevator...\r\nUPDATE...\r\nFootball Players With CTE Have Turned to Violence...",
    "link": "https://www.the-sun.com/news/14846967/shooting-new-york-football-cte/",
    "timestamp": "2025-07-29T16:40:38Z"
  },
  {
    "title": "Netanyahu's Approval Among Americans Plunges to Record Low—Poll",
    "description": "A majority of Americans view Netanyahu negatively for the first time, according to a new poll.",
    "link": "https://www.newsweek.com/netanyahu-approval-american-plunges-low-poll-2105749",
    "timestamp": "2025-07-29T16:39:12Z"
  },
  {
    "title": "Slog AM: Debora Juarez Back On Council,  Ann Davison Stabs Denny Blaine In The Back(side), Manhattan Gunman Likely Targeted NFL",
    "description": "The Stranger's Morning News Roundup\n \n by Vivian McCall\n \n \n \n I’m back from vacation: It was nice (thanks for asking). I’ve returned to better weather. Today, it’ll be sunny with a balmy high of 81. Temperatures will drop to the high 50s tonight before heati…",
    "link": "https://www.thestranger.com/slog-am/2025/07/29/80170879/slog-am-debora-juarez-back-on-council-ann-davison-stabs-denny-blaine-in-the-backside-manhattan-gunman-likely-targeted-nfl",
    "timestamp": "2025-07-29T16:39:00Z"
  },
  {
    "title": "When I Worked at Donald Trump’s Casino, He Walked In With Jeffrey Epstein—and a Teenager Not Old Enough to Be There",
    "description": "Afterward he asked, “Am I in trouble?”",
    "link": "https://slate.com/news-and-politics/2025/07/donald-trump-jeffrey-epstein-files-list-fbi-news.html",
    "timestamp": "2025-07-29T16:38:49Z"
  },
  {
    "title": "The Epstein Conspiracy Flames That Trump Fanned Are Now Blowing Back on Him",
    "description": "On August 10, 2019, Jeffrey Epstein—accused of sex trafficking in minor girls—committed suicide in his jail cell while awaiting trial, and a new conspiracy theory was born: Powerful forces silenced him. Releasing the Justice Department’s files on Epstein woul…",
    "link": "https://www.commondreams.org/opinion/trump-epstein-conspiracy",
    "timestamp": "2025-07-29T16:37:43Z"
  },
  {
    "title": "Vance warns of 'penalty' for Dems who opposed the 'big, beautiful, bill' ahead of 2026 midterms",
    "description": "Vice President JD Vance is gearing up for the 2026 midterm elections and cautioned those who opposed President Donald Trump's \"big, beautiful bill\" should face consequences.",
    "link": "https://www.foxnews.com/politics/vance-warns-penalty-dems-who-opposed-big-beautiful-bill-ahead-2026-midterms",
    "timestamp": "2025-07-29T16:36:42Z"
  },
  {
    "title": "Trump’s endorsement boosts Senate candidate who almost flipped a key swing seat",
    "description": "Trump's endorsement clears the GOP field for Mike Rogers in Michigan's 2026 Senate race while Democrats face a crowded primary in the battleground state that Trump narrowly won in 2024.",
    "link": "https://www.foxnews.com/politics/trumps-endorsement-boosts-senate-candidate-who-almost-flipped-key-swing-seat",
    "timestamp": "2025-07-29T16:35:49Z"
  },
  {
    "title": "Scottish Bagpipes Drown Out Trump",
    "description": "Scotland always gives Donald Trump a warm reception.\nAnonymous posted a funny video.\nHow despicable for the President of the United States to use taxpayer money to fly to Scotland and use that trip to open up a new golf course that was promoted via the presid…",
    "link": "https://crooksandliars.com/2025/07/scottish-bagpipes-drown-out-trump",
    "timestamp": "2025-07-29T16:35:14Z"
  },
  {
    "title": "Make Entertainment Great Again Act: Republican wants to rename Kennedy Center for Trump",
    "description": "One historian recently described the Republican effort to name a bunch of stuff after Donald Trump as “pretty crazy.” The Kennedy Center is now on the list.",
    "link": "https://biztoc.com/x/9dadf09363b2862d",
    "timestamp": "2025-07-29T16:34:56Z"
  },
  {
    "title": "With AI plan, Trump keeps chipping away at a foundational environmental law",
    "description": "NEPA is a foundational environmental law in the United States.",
    "link": "https://www.bostonherald.com/2025/07/29/climate-trump-ai-environment/",
    "timestamp": "2025-07-29T16:34:46Z"
  },
  {
    "title": "'Worst-Case Scenario of Famine' Unfolding in Gaza: IPC Report",
    "description": "The latest alert on Gaza from the world's leading authority on starvation and malnutrition is not a warning of what could come in the besieged enclave, where Israel is still blocking nearly all humanitarian aid, but of the \"worst-case scenario\" that has alrea…",
    "link": "https://www.commondreams.org/news/ipc-and-famine",
    "timestamp": "2025-07-29T16:33:54Z"
  },
  {
    "title": "Trump’s Break With Netanyahu On Gaza: A Timeline Of Ally, MAGA Pressure",
    "description": "Steve Bannon said young MAGA voters are backing away from Israel, signaling a broader shift among conservatives as criticism of Netanyahu’s Gaza policies intensifies pressure on Trump.",
    "link": "https://www.forbes.com/sites/yezensaadah/2025/07/29/trumps-break-with-netanyahu-on-gaza-a-timeline-of-ally-maga-pressure/",
    "timestamp": "2025-07-29T16:32:32Z"
  },
  {
    "title": "Trump's EU Deal Could Cost Pharma Industry $19 Billion, Analyst Warns",
    "description": "The 15 percent tariff rate agreed under the new deal could significantly impact pharma firms reliant on European imports.",
    "link": "https://www.newsweek.com/trump-eu-tariff-deal-cost-pharmaceutical-industry-billions-2105746",
    "timestamp": "2025-07-29T16:31:29Z"
  },
  {
    "title": "This Week In Bitcoin: 4 Things To Keep An Eye On That Could Impact Price",
    "description": "As Bitcoin (BTC) continues to trade in a volatile yet increasingly bullish market, a crypto analyst points to key developments that could drive a breakout past $130,000. From macroeconomic shifts to major technical breakouts and unexpected geopolitical tailwi…",
    "link": "https://bitcoinist.com/this-week-in-bitcoin/",
    "timestamp": "2025-07-29T16:30:07Z"
  },
  {
    "title": "Comedians Says Colbert Cancelation Will Mean More Trump Jokes, Not Less",
    "description": "By\n Matt Solomon\n Published: July 29th, 2025",
    "link": "https://www.cracked.com/article_47612_comedians-says-colbert-cancelation-will-mean-more-trump-jokes-not-less.html",
    "timestamp": "2025-07-29T16:30:00Z"
  },
  {
    "title": "Renaming the Kennedy Center for Donald and Melania Trump would violate the law that created it (NBC News)",
    "description": "NBC News:\nRenaming the Kennedy Center for Donald and Melania Trump would violate the law that created it  —  The Kennedy Center can't include new memorials or plaques — for donors or presidents — under U.S. law.  Republicans would need to change that to renam…",
    "link": "https://www.memeorandum.com/250729/p46",
    "timestamp": "2025-07-29T16:30:00Z"
  },
  {
    "title": "L'Oreal posts 2.4% rise in second-quarter sales",
    "description": "L'Oreal reported a 2.4% rise in second-quarter sales today, missing forecasts as growth in Europe slowed more than expected and demand at travel outlets in Asia was subdued.",
    "link": "https://www.rte.ie/news/business/2025/0729/1526004-loreal-posts-2-4-rise-in-second-quarter-sales/",
    "timestamp": "2025-07-29T16:29:20Z"
  },
  {
    "title": "Ottawa’s counter tariffs could cost Canadians $9 billion this year — or $550 per household, warns think tank",
    "description": "Canada's counter-tariffs on American imports are expected to cost every Canadian household almost $550 this year, says MEI. Read on",
    "link": "https://financialpost.com/news/economy/counter-tariffs-could-cost-canadians-9-billion-this-year",
    "timestamp": "2025-07-29T16:29:01Z"
  },
  {
    "title": "HHS pulls millions from Duke under Trump DEI order, alleging race-based hiring at health arm",
    "description": "Federal officials freeze Duke Health's $108 million grant funding over concerns that its diversity, equity and inclusion programs may violate anti-discrimination laws",
    "link": "https://www.foxnews.com/politics/hhs-pulls-millions-from-duke-under-trump-dei-order-alleging-race-based-hiring-health-arm",
    "timestamp": "2025-07-29T16:28:05Z"
  },
  {
    "title": "‘Dangerous Game’: Senate GOP Warns Of Retribution If Dems Do Not Relent Blockade Of Trump’s Nominees",
    "description": "Senate Republicans are warning that Democrats risk blowing up precedent if they do not undo their stalling of the confirmation process for Trump's nominees.",
    "link": "https://dailycaller.com/2025/07/29/senate-gop-democrats-nominees-trump/",
    "timestamp": "2025-07-29T16:27:51Z"
  },
  {
    "title": "Trump’s religious rhetoric clashes with Canada’s secular politics",
    "description": "Religion plays a far more subdued role in the public sphere in Canada.",
    "link": "https://www.bostonherald.com/2025/07/29/canada-vs-us-faith-in-politics/",
    "timestamp": "2025-07-29T16:27:37Z"
  },
  {
    "title": "Farage torches UK minister over 'disgusting' predator jab in free speech clash",
    "description": "The U.K.'s Online Safety Act sparks heated debate between Nigel Farage and Peter Kyle, highlighting tensions between child protection measures and freedom of speech concerns.",
    "link": "https://www.foxnews.com/world/farage-torches-uk-minister-over-disgusting-predator-jab-free-speech-clash",
    "timestamp": "2025-07-29T16:27:09Z"
  },
  {
    "title": "Why can't Trump shake Epstein? | US politics with Katie Stallard and Freddie Hayward",
    "description": "Once upon a time Donald Trump loved to talk about conspiracy theories. Now, well, not so much.Why can’t Trump shake the Epstein story - and what could it mean for his presidency?--Last week, Katie Stallard and Freddie Hayward talked about how Donald Trump wan…",
    "link": "https://shows.acast.com/newstatesman/episodes/why-cant-trump-shake-epstein-us-politics-with-katie-stallard",
    "timestamp": "2025-07-29T16:26:12Z"
  },
  {
    "title": "MSNBC Goes Full Racist, Attacking Sydney Sweeney Ad Campaign",
    "description": "Remember how, in recent years, nearly every high-profile “racist incident” that dominated the headlines eventually turned out to be a false flag or outright hoax? Well, nothing’s changed. The outrage-obsessed left has apparently run out of real things to be a…",
    "link": "https://freerepublic.com/focus/f-news/4331453/posts",
    "timestamp": "2025-07-29T16:25:15Z"
  },
  {
    "title": "ICE Barbie Invites Ridicule With Latest Horsey Stunt",
    "description": "Noem never passes up a good photo op, and that's what she did yesterday, riding a horse in Argentina for the assembled photographers and videographers. Ostensibly in Argentina on state business, many speculated it was just a paid holiday for her and boyfriend…",
    "link": "https://crooksandliars.com/2025/07/ice-barbie-invites-ridicule-latest-horsey",
    "timestamp": "2025-07-29T16:25:02Z"
  },
  {
    "title": "Epstein-Trump Networks Were Mapped, Trump Should Be Scared",
    "description": "Dave Troy and his team at America 2.0 mapped the connections between Epstein and Trump. Based on the data that Troy found, Trump should be freaking out about his secrets being uncovered. Troy wrote:\n\n\"Epstein's long association with Donald Trump resulted in s…",
    "link": "https://crooksandliars.com/2025/07/epstein-trump-networks-were-mapped-trump",
    "timestamp": "2025-07-29T16:25:01Z"
  },
  {
    "title": "Trump’s Gaza aid promise ignores starving kids elsewhere",
    "description": "President Trump just made headlines with his latest humanitarian pledge, but the details reveal a troubling pattern that’s got advocates scratching their heads. Donald Trump announces Gaza food aid plans during a high-profile appearance with British Prime Min…",
    "link": "https://rollingout.com/2025/07/29/trump-gaza-aid-ignores-starving-kids/",
    "timestamp": "2025-07-29T16:24:51Z"
  },
  {
    "title": "Trump administration moves to repeal scientific finding that underpins climate regulation",
    "description": "U.S. President Donald Trump’s administration on Tuesday proposed revoking a scientific finding that has long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change.\nThe proposed Environmental Protection Agency rul…",
    "link": "https://biztoc.com/x/42e73aae52981315",
    "timestamp": "2025-07-29T16:24:16Z"
  },
  {
    "title": "US layoffs: This pharma firm to cut jobs amid $3 billion cost-reduction plan. Here's what we know",
    "description": "Merck plans to cut jobs as part of a $3 billion cost-reduction strategy by 2027, while also lowering its 2025 revenue forecast. The company aims to optimise its operations and reinvest savings into new medicines amid declining sales of its HPV vaccine.",
    "link": "https://www.livemint.com/companies/us-layoffs-merck-pharma-firm-to-cut-jobs-amid-3-billion-cost-reduction-plan-heres-what-we-know-11753804204816.html",
    "timestamp": "2025-07-29T16:24:05Z"
  },
  {
    "title": "'Collapse': Steve Bannon warns newest crisis poised to decimate Trump's presidency",
    "description": "Key allies to President Donald Trump’s MAGA movement are issuing dire warnings that the president’s support of Israel amid its partial blockade of aid into the Gaza Strip will result in a near-total “collapse of support” among the president’s most diehard sup…",
    "link": "https://www.rawstory.com/gaza-2673779667/",
    "timestamp": "2025-07-29T16:23:31Z"
  },
  {
    "title": "Britain to recognize Palestinian state unless Israel meets certain conditions, UK’s Starmer says",
    "description": "British Prime Minister Keir Starmer has said the UK will recognize a Palestinian state in September unless Israel takes “substantive steps to end the...",
    "link": "https://www.cnn.com/2025/07/29/middleeast/britain-palestinian-state-starmer-intl-latam",
    "timestamp": "2025-07-29T16:22:08Z"
  },
  {
    "title": "IMF upgrades global growth forecast as tariffs ease",
    "description": "A softening of Trump tariffs since April means global growth could be stronger, the IMF says",
    "link": "https://www.bbc.co.uk/news/articles/cn84gg2y5kpo",
    "timestamp": "2025-07-29T16:21:16Z"
  },
  {
    "title": "Conservative who ridiculed Hillary fans with classic meme and was criminally charged now strikes back",
    "description": "Doug Mackey confirms he's working with high-profile former DOGE lawyer to recover damages from Biden-orchestrated war on his speech",
    "link": "https://www.wnd.com/2025/07/conservative-who-ridiculed-hillary-fans-classic-meme-was/",
    "timestamp": "2025-07-29T16:20:42Z"
  },
  {
    "title": "Make Entertainment Great Again Act: Republican wants to rename Kennedy Center for Trump",
    "description": "One historian recently described the Republican effort to name a bunch of stuff after Donald Trump as “pretty crazy.” The Kennedy Center is now on the list.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/make-entertainment-great-act-republican-wants-rename-kennedy-center-tr-rcna221747",
    "timestamp": "2025-07-29T16:20:29Z"
  },
  {
    "title": "Explained: The Misconduct Complaint Against Judge James Boasberg",
    "description": "The Department of Justice has accused a top D.C. judge of bias over remarks about the Trump administration in an immigration case.",
    "link": "https://www.newsweek.com/explained-misconduct-complaint-against-judge-james-boasberg-2105641",
    "timestamp": "2025-07-29T16:20:21Z"
  },
  {
    "title": "Book reviews: 'The Mission: The CIA in the 21st Century' by Tim Weiner and 'The Aviator and the Showman: Amelia Earhart, George Putnam, and the Marriage That Made an American Icon' by Laurie Gwen Shapiro",
    "description": "Book reviews: 'The Mission: The CIA in the 21st Century' by Tim Weiner and 'The Aviator and the Showman: Amelia Earhart, George Putnam, and the Marriage That Made an American Icon' by Laurie Gwen Shapiro",
    "link": "https://theweek.com/culture-life/books/the-mission-tim-weiner-amelia-earhart-laurie-gwen-shapiro",
    "timestamp": "2025-07-29T16:18:20Z"
  },
  {
    "title": "World Court Says Polluter States Must Compensate Victims for Harms They Cause",
    "description": "The ICJ has issued a landmark ruling establishing an international human right to a clean environment.",
    "link": "https://truthout.org/articles/world-court-says-polluter-states-must-compensate-victims-for-harms-they-cause/",
    "timestamp": "2025-07-29T16:18:19Z"
  },
  {
    "title": "\"Attempted to take entire credit for Operation Sindoor\": Gaurav Gogoi rebukes PM Modi's speech in Lok Sabha",
    "description": "Gaurav Gogoi, a Congress MP, has criticized Prime Minister Narendra Modi. Gogoi claims Modi tried to take sole credit for Operation Sindoor during his Lok Sabha speech. He also alleges Modi avoided responsibility for the Pahalgam terror attack. Gogoi further …",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/attempted-to-take-entire-credit-for-operation-sindoor-gaurav-gogoi-rebukes-pm-modis-speech-in-lok-sabha/articleshow/122980252.cms",
    "timestamp": "2025-07-29T16:18:06Z"
  },
  {
    "title": "Even Just Wars Can Become Monstrous",
    "description": "Matt Labash describes himself as “about as pro-Israel as they come. (God’s Chosen People, and all.)” \"But when even Donald Trump admits that the Gazans are getting starved, well then maybe partisans need to start",
    "link": "https://politicalwire.com/2025/07/29/even-just-wars-can-become-monstrous/",
    "timestamp": "2025-07-29T16:17:10Z"
  },
  {
    "title": "Calling out President Macron: It's really about ego, not diplomacy",
    "description": "The failed French president plays statesman on the world stage while undermining the very principles he claims to uphold. Opinion.",
    "link": "https://www.israelnationalnews.com/news/412444",
    "timestamp": "2025-07-29T16:16:48Z"
  },
  {
    "title": "Apple closes store in China for first time",
    "description": "The US tech giant has been struggling with falling local sales worsened by Washington’s escalating trade tensions with Beijing Read Full Article at RT.com",
    "link": "https://www.rt.com/business/622144-apple-china-retail-store-shutdown/",
    "timestamp": "2025-07-29T16:14:42Z"
  },
  {
    "title": "The Fed's Two-Day Policy Meeting Kicked Off Tuesday—What You Need To Know",
    "description": "Key Takeaways\n-\nThe Federal Reserve kicked off its two-day policy meeting Tuesday.\n-\nThe Fed is widely expected to keep its key interest rate at 4.25% to 4.5%, the same as it has been since December.\n-\nPresident Donald Trump has demanded the Fed cut rates, bu…",
    "link": "https://biztoc.com/x/44b4006d4981f1db",
    "timestamp": "2025-07-29T16:14:19Z"
  },
  {
    "title": "Former NASA Boss Says We May Be Destroying America’s Only Shot at Space",
    "description": "One of the driving forces behind the Hubble Space Telescope is sounding the alarm on president Donald Trump's disastrous space policy. That ex-NASA executive, former associate administrator for spaceflight Joe Rothenberg, warns that the agency's current predi…",
    "link": "https://futurism.com/former-nasa-boss-destroying-space",
    "timestamp": "2025-07-29T16:13:31Z"
  },
  {
    "title": "Stephen Colbert Defends Beyonce from Trump, Mocks Paramount-Skydance Merger with Pee Jokes",
    "description": "Soon-to-be canceled left-wing late-night host Stephen Colbert unleashed on his own network and President Donald Trump in his return to the show on Monday evening.\nThe post Stephen Colbert Defends Beyoncé from Trump, Mocks Paramount-Skydance Merger with Pee Jo…",
    "link": "https://www.breitbart.com/entertainment/2025/07/29/stephen-colbert-defends-beyonce-from-trump-mocks-paramount-skydance-merger-with-pee-jokes/",
    "timestamp": "2025-07-29T16:13:09Z"
  },
  {
    "title": "Trump Denies Seeking Summit With Xi, But 'May' Visit China, As Stockholm Talks Pave Way",
    "description": "Trump Denies Seeking Summit With Xi, But 'May' Visit China, As Stockholm Talks Pave Way\n \nPresident Donald Trump on Tuesday pushed back on reports saying he's looking for a summit with Chinese President Xi Jinping, but strangely conceded it's possible he coul…",
    "link": "https://biztoc.com/x/b6956c1dcae05480",
    "timestamp": "2025-07-29T16:13:05Z"
  },
  {
    "title": "Keep Digging, Donald. You’re Keeping the Epstein Scandal Alive.",
    "description": "Joan Walsh\n\n\n\nTrump’s bizarre claim that he fell out with the indicted child sex trafficker because Epstein “stole” workers from Mar-a-Lago only raises more lurid questions.\r\n\n\r\n\n\nThe post Keep Digging, Donald. You’re Keeping the Epstein Scandal Alive. appear…",
    "link": "https://www.thenation.com/article/politics/keep-digging-donald-keeping-epstein-scandal/",
    "timestamp": "2025-07-29T16:13:03Z"
  },
  {
    "title": "Spain’s major export item is struggling under fresh tariffs from Trump",
    "description": "Spain’s black olive exporters, subject to harsh tariffs since U.S. President Donald Trump’s first term, are warning it will be difficult to survive an extra 15% they now face under the European Union’s latest trade deal with the United States.\nEU goods now fa…",
    "link": "https://biztoc.com/x/fce9e31fae584903",
    "timestamp": "2025-07-29T16:12:59Z"
  },
  {
    "title": "Trump contradicts Israel, says 'starvation' in Gaza",
    "description": "What happened\nPresident Donald Trump Monday acknowledged that there is \"real starvation\" in Gaza and suggested that Israel could be doing more to alleviate the suffering of the Palestinians. His assessment, delivered during a press conference alongside Britis…",
    "link": "https://biztoc.com/x/a32b69323474fff9",
    "timestamp": "2025-07-29T16:12:33Z"
  },
  {
    "title": "Displaced Cambodians Return Home After Thailand Truce",
    "description": "As Cambodia and Thailand's ceasefire held Tuesday, Lat Laem hared back home -- one of the first evacuees to return to the frontier since deadly cross-border clashes sent more than 300,000 people fleeing.",
    "link": "https://www.ibtimes.com/displaced-cambodians-return-home-after-thailand-truce-3779728",
    "timestamp": "2025-07-29T16:12:10Z"
  },
  {
    "title": "With the fiscal year drawing to a close, Congressional leaders are gearing up for a shutdown fight",
    "description": "Republican lawmakers view the Democrats as itching for a shutdown after a series of political losses this year.",
    "link": "https://www.pbs.org/newshour/politics/with-the-fiscal-year-drawing-to-a-close-congressional-leaders-are-gearing-up-for-a-shutdown-fight",
    "timestamp": "2025-07-29T16:11:45Z"
  },
  {
    "title": "Six months in, young people have soured on Trump's job handling",
    "description": "Most Americans under 30 approved at the start of President Trump's second term but are dissatisfied with the economy's direction.",
    "link": "https://www.cbsnews.com/news/young-people-trumps-job-handling-cbs-news-analysis/",
    "timestamp": "2025-07-29T16:11:38Z"
  },
  {
    "title": "Dean Cain Is Still Flying High: ‘Lois & Clark’ Heartthrob Tells All on Supporting Trump, Opposing ‘Woke’ Superman and Overcoming Sexual Harassment",
    "description": "Dean Cain is about to pull off a lightning-fast costume change that would impress even Superman. Standing in front of an infinity pool overlooking a golf course and the Las Vegas Strip in the distance, the actor is wearing a faded gray T-shirt, gym shorts and…",
    "link": "https://variety.com/2025/tv/news/dean-cain-trump-woke-superman-sexually-harassed-1236473005/",
    "timestamp": "2025-07-29T16:10:23Z"
  },
  {
    "title": "UK Set to Join US Allies in Recognizing Palestine",
    "description": "PM Keir Starmer emphasized that recognition would be conditional on progress toward a two-state solution and meaningful peace efforts.",
    "link": "https://www.newsweek.com/uk-palestinian-state-israel-ceasefire-gaza-2105827",
    "timestamp": "2025-07-29T16:09:18Z"
  },
  {
    "title": "‘The Simpsons’ creator says show won’t end until Donald Trump dies",
    "description": "The Simpsons creator Matt Groening has suggested that the show won’t end until Donald Trump dies. The series has been running since 1989, becoming the longest-running animated TV show and sitcom ever. However, while speaking at San Diego Comic-Con, Groening s…",
    "link": "https://freerepublic.com/focus/f-news/4331450/posts",
    "timestamp": "2025-07-29T16:08:58Z"
  },
  {
    "title": "Trump contradicts Israel, says 'starvation' in Gaza",
    "description": "The president suggests Israel could be doing more to alleviate the suffering of Palestinians",
    "link": "https://theweek.com/politics/trump-netanyahu-gaza-starvation",
    "timestamp": "2025-07-29T16:08:29Z"
  },
  {
    "title": "L'Oreal to push for tariff exemption as US market improves",
    "description": "PARIS (Reuters) -L'Oreal  warned on Tuesday that the EU's trade deal with the U.S. would be costly and that the cosmetics maker would push for tariff...",
    "link": "https://finance.yahoo.com/news/loreal-posts-2-4-rise-160740853.html",
    "timestamp": "2025-07-29T16:07:40Z"
  },
  {
    "title": "“Playing Dress-Up”: Ex-Agent Warns FBI Leaders Are in Over Their Heads",
    "description": "The current leaders of the FBI have “no idea what they’re doing,” according to outgoing employees.The federal investigative agency is undergoing a “radical deprofessionalization,” with a growing emphasis on ideological loyalty to the Trump administration over…",
    "link": "https://newrepublic.com/post/198562/fbi-kash-patel-dan-bongino-no-clue",
    "timestamp": "2025-07-29T16:06:06Z"
  },
  {
    "title": "Democrats Don’t Need to Be Popular. They Just Need to Win.",
    "description": "Disappointed Democrats are driving polls showing high unfavorable ratings for their party. They’ll feel better when Democrats start winning elections this year and next.",
    "link": "http://nymag.com/intelligencer/article/democrats-dont-need-to-be-popular-they-just-need-to-win.html",
    "timestamp": "2025-07-29T16:04:39Z"
  },
  {
    "title": "Breaking: UK could recognise Palestinian state in September, PM Starmer says",
    "description": "British PM Keir Starmer says his country will recognise a Palestinian state as early as September, unless Israel takes significant steps to end the war in Gaza.",
    "link": "https://www.abc.net.au/news/2025-07-30/int-starmer-says-uk-could-recognise-palestinian-state-as-early-a/105588518",
    "timestamp": "2025-07-29T16:04:26Z"
  },
  {
    "title": "UK could recognise Palestinian state in September, PM Starmer says",
    "description": "British PM Keir Starmer says his country will recognise a Palestinian state as early as September, unless Israel takes significant steps to end the war in Gaza.",
    "link": "https://www.abc.net.au/news/2025-07-30/starmer-says-uk-could-recognise-palestinian-state-september/105588518",
    "timestamp": "2025-07-29T16:04:26Z"
  },
  {
    "title": "Stablecoin Supply to Grow as Much as $75B Following Passage of GENIUS Act, BofA Says",
    "description": "The bank expects further adoption of tokenized assets and money market mutual funds once the crypto market structure bill, the CLARITY Act, becomes law. What to know: Bank of America (BAC) says the GENIUS Act, signed into law last Friday by President Donald T…",
    "link": "https://www.activistpost.com/stablecoin-supply-to-grow-as-much-as-75b-following-passage-of-genius-act-bofa-says/",
    "timestamp": "2025-07-29T16:04:00Z"
  },
  {
    "title": "ICE Arrests Police Officer for Trying to Buy Gun",
    "description": "Jon Luke Evans was employed as a reserve police officer with the Old Orchard Beach Police Department at the time of his arrest.",
    "link": "https://www.newsweek.com/ice-arrests-police-officer-gun-2105688",
    "timestamp": "2025-07-29T16:03:51Z"
  },
  {
    "title": "EXCLUSIVE: Republicans Strongly Agree With Trump That Hospitals Gouge Americans On Drug Pricing, According To New Poll",
    "description": "A majority of Republicans feel that massive nonprofit hospital networks overprescribe medications and inflate their pricing to enrich themselves",
    "link": "https://dailycaller.com/2025/07/29/republicans-donald-trump-hospitals-drug-pricing-poll-building-americas-future/",
    "timestamp": "2025-07-29T16:03:36Z"
  },
  {
    "title": "Endorsement of Graham - a big mistake or a rational calculation?",
    "description": "Keep your friends close and your enemies even closer -Sun Tzu President Donald Trump's endorsement of scandal-plagued RINO Lindsey Graham ahead of the 2026 Senate election came as an unpleasant surprise. How the leader and mastermind behind MAGA could support…",
    "link": "https://freerepublic.com/focus/f-gop/4331449/posts",
    "timestamp": "2025-07-29T16:01:59Z"
  }
]