[
  {
    "title": "Judge temporarily blocks Trump and Musk’s administration overhaul",
    "description": "‘The President may broadly restructure federal agencies only when authorised by Congress’",
    "link": "https://7news.com.au/news/judge-temporarily-blocks-trump-and-musks-administration-overhaul-c-18647933",
    "timestamp": "2025-05-10T07:48:14Z"
  },
  {
    "title": "President Donald Trump Just Called for a Drastic Social Security Change -- but It Comes With Unintended Consequences",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_627fe0ed-7f8b-44fa-a86a-5ceab8117341",
    "timestamp": "2025-05-10T07:44:00Z"
  },
  {
    "title": "Russia wants end to arms supplies for Ukraine as ceasefire condition",
    "description": "Russia wants the United States and the European Union to cease their arms supplies to Kiev as a precondition for a 30-day ceasefire in the Ukraine war, the...",
    "link": "https://www.yahoo.com/news/russia-wants-end-arms-supplies-073920396.html",
    "timestamp": "2025-05-10T07:39:20Z"
  },
  {
    "title": "Ex-Trump admin official Camryn Kinsey ‘doing well’ after fainting during live television interview",
    "description": "The former Division I cheerleader sat still for a few seconds before her eyes shut and she fell off her chair, landing on the stage below.",
    "link": "https://nypost.com/2025/05/10/media/ex-trump-admin-official-camryn-kinsey-gives-update-after-collapse-on-fox-news-appearance/",
    "timestamp": "2025-05-10T07:39:17Z"
  },
  {
    "title": "European leaders arrive in Kyiv to show support after Putin’s parade",
    "description": "Leaders of Britain, France, Germany, Poland in Ukraine.",
    "link": "https://www.euractiv.com/section/politics/news/european-leaders-arrive-in-kyiv-to-show-support-after-putins-parade/",
    "timestamp": "2025-05-10T07:28:41Z"
  },
  {
    "title": "Gulf diplomatic source claims Trump will announce US recognition of Palestinian state",
    "description": "Saudi Arabia will host a Gulf-US summit in mid-May, part of US President Donald Trump's first visit to Saudi Arabia during his second term. This follows the summit held on May 21, 2017, during Trump's first term.The summit, hosted by Saudi Arabia in its capit…",
    "link": "https://freerepublic.com/focus/f-news/4316102/posts",
    "timestamp": "2025-05-10T07:27:52Z"
  },
  {
    "title": "European leaders arrive in Kyiv amid push for 30-day ceasefire",
    "description": "The leaders of four European countries have arrived in Kyiv as calls intensify for Russia to agree to a monthlong ceasefire in the war",
    "link": "https://abcnews.go.com/International/wireStory/european-leaders-arrive-kyiv-amid-push-30-day-121664248",
    "timestamp": "2025-05-10T07:27:44Z"
  },
  {
    "title": "European leaders arrive in Kyiv to show support after Putin's parade",
    "description": "KYIV (Reuters) -The leaders of Britain, France, Germany and Poland arrived in Kyiv on Saturday for talks with Ukrainian President Volodymyr Zelenskiy in a show of unity a day after Russia's Vladimir Putin hosted his allies in a Victory Day parade on Red Squar…",
    "link": "https://www.thestar.com.my/news/world/2025/05/10/european-leaders-arrive-in-kyiv-to-show-support-after-putin039s-parade",
    "timestamp": "2025-05-10T07:27:00Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene says she won’t run for Senate while blasting Dems and fellow Republicans",
    "description": "\"Someone once said, ‘The Senate is where good ideas go to die.’ They were right. That’s why I’m not running,\" Greene wrote as she announced her decision.",
    "link": "https://nypost.com/2025/05/10/us-news/georgia-rep-marjorie-taylor-greene-says-she-wont-run-for-senate-while-blasting-dems-and-fellow-republicans/",
    "timestamp": "2025-05-10T07:26:06Z"
  },
  {
    "title": "US judge temporarily blocks Trump's plans for mass layoffs of public workers",
    "description": "In an executive order in February, Trump called for a “critical transformation of the Federal bureaucracy” and directed agencies to cull workers who are not deemed essential.",
    "link": "https://www.thejournal.ie/us-judge-temporarily-blocks-trumps-plans-for-mass-layoffs-of-public-workers-6701395-May2025/",
    "timestamp": "2025-05-10T07:24:15Z"
  },
  {
    "title": "China's Consumption Slide Deepens As Tariff War Bites",
    "description": "China said Saturday that consumer prices slumped in April for the third straight month, reflecting persistent challenges as leaders attempt to revive an economy stymied by sluggish spending and a fierce trade war with Washington.",
    "link": "https://www.ibtimes.com/chinas-consumption-slide-deepens-tariff-war-bites-3773118",
    "timestamp": "2025-05-10T07:21:16Z"
  },
  {
    "title": "China’s consumption slide deepens as tariff war bites",
    "description": "China said Saturday that consumer prices slumped in April for the third straight month, reflecting persistent challenges as leaders attempt to revive an economy stymied by sluggish spending and a fierce trade war with Washington. The world’s second-largest ec…",
    "link": "https://www.digitaljournal.com/world/chinas-consumption-slide-deepens-as-tariff-war-bites/article",
    "timestamp": "2025-05-10T07:17:32Z"
  },
  {
    "title": "Putin ‘doing whatever possible’ for Ukraine peace – Kremlin",
    "description": "The Kremlin hopes US President Donald Trump will help bring more “wisdom” in discussions with Ukraine, spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617272-putin-doing-whatever-possible-ukraine-peace/",
    "timestamp": "2025-05-10T07:07:12Z"
  },
  {
    "title": "As US, China begin trade talks in Geneva, Trump's tariff hammer looks less mighty than he claims",
    "description": "Amidst a tense trade war, the U.S. and China are set to engage in preliminary talks in Geneva, though prospects for a swift resolution remain uncertain. Despite Trump's confidence in tariffs, China has retaliated, showing a willingness to withstand economic p…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/as-us-china-begin-trade-talks-in-geneva-trumps-tariff-hammer-looks-less-mighty-than-he-claims/articleshow/121051997.cms",
    "timestamp": "2025-05-10T07:01:30Z"
  },
  {
    "title": "Arab countries hope for big US business amid unresolved Gaza war",
    "description": "US President Trump visits Saudi Arabia, Qatar and the United Arab Emirates from May 13-16. Much is at stake for the US and regional leaders seeking to boost ties while walking a tightrope over Gaza, Israel and Iran.",
    "link": "https://www.dw.com/en/arab-countries-hope-for-big-us-business-amid-unresolved-gaza-war/a-72489255",
    "timestamp": "2025-05-10T06:53:00Z"
  },
  {
    "title": "Arab countries hope for big US business amid Gaza war",
    "description": "US President Trump visits Saudi Arabia, Qatar and the United Arab Emirates from May 13-16. Much is at stake for the US and regional leaders seeking to boost ties while walking a tightrope over Gaza, Israel and Iran.",
    "link": "https://www.dw.com/en/arab-countries-hope-for-big-us-business-amid-gaza-war/a-72489255",
    "timestamp": "2025-05-10T06:53:00Z"
  },
  {
    "title": "Yle investigation into TikTok data centre raises security concerns",
    "description": "Over the past year, the Finnish project quietly became a joint venture between Chinese investors and a Dubai billionaire.",
    "link": "https://yle.fi/a/74-20160971",
    "timestamp": "2025-05-10T06:52:03Z"
  },
  {
    "title": "China expresses concern, offers help to resolve India-Pakistan conflict",
    "description": "BEIJING: China expressed \"deep concern\" on Saturday (May 10) over the escalating situation between India and Pakistan and offered to play a constructive role in resolving the matter, according to a statem",
    "link": "https://www.channelnewsasia.com/asia/china-expresses-concern-offers-help-resolve-india-pakistan-conflict-5121441",
    "timestamp": "2025-05-10T06:46:32Z"
  },
  {
    "title": "Mexico sues Google for changing ‘Gulf of Mexico’ to ‘Gulf of America’ after Trump’s order",
    "description": "Trump signed an order on his first day back in the White House in January to rename the northern part of the gulf to the Gulf of America.",
    "link": "https://nypost.com/2025/05/10/us-news/mexico-sues-google-for-changing-gulf-of-mexico-to-gulf-of-america-after-trump-executive-order/",
    "timestamp": "2025-05-10T06:46:04Z"
  },
  {
    "title": "Donald Trump's surprising message sends stocks surging",
    "description": "",
    "link": "https://biztoc.com/x/2061ebdbb138fb81",
    "timestamp": "2025-05-10T06:40:05Z"
  },
  {
    "title": "Judge pauses much of Trump administration's massive downsizing of federal agencies",
    "description": "The Trump administration must halt much of its dramatic downsizing of the federal workforce, a California judge ordered Friday. Judge Susan Illston in San Francisco issued the emergency order in a lawsuit filed last week by labor unions and cities, one of mul…",
    "link": "https://japantoday.com/category/world/judge-pauses-much-of-trump-administration%27s-massive-downsizing-of-federal-agencies",
    "timestamp": "2025-05-10T06:33:05Z"
  },
  {
    "title": "US judge temporarily blocks Trump plans for mass layoffs",
    "description": "A U.S. judge has temporarily blocked federal agencies from proceeding with mass layoffs of government workers ordered by President Trump, citing the need for Congressional approval. Judge Susan Illston issued a two-week pause, stating the administration's wor…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-judge-temporarily-blocks-trump-plans-for-mass-layoffs/articleshow/121051326.cms",
    "timestamp": "2025-05-10T06:29:43Z"
  },
  {
    "title": "Whiplash reversals mean Trump’s erratic trade policy is as clear as mud",
    "description": "The specifics of the administration’s economic masterplan – from strollers to movies to China – change by the day\nDecades of economic orthodoxy failed millions of Americans, according to Donald Trump, who marched back into the White House promising to shred t…",
    "link": "https://biztoc.com/x/8f075275913cba78",
    "timestamp": "2025-05-10T06:17:41Z"
  },
  {
    "title": "Swedish cardinal hails Pope Leo, takes dig at Trump",
    "description": "Swedish Cardinal Anders Arborelius, who took part in the conclave to elect the Catholic Church's new pope, hailed Leo XIV on Friday as \"gentle and humble\" -- and very \"unlike\" US President Donald Trump.",
    "link": "https://www.thelocal.se/20250510/swedish-cardinal-hails-pope-leo-takes-dig-at-trump",
    "timestamp": "2025-05-10T06:09:49Z"
  },
  {
    "title": "How US-China tariffs reached sky-high levels in 3 months",
    "description": "US and China are set to meet in Switzerland for trade talks. This follows months of increasing tariffs between the two nations. These tariffs have negatively impacted exporters and economies. The US has tariffs of 145% on Chinese goods. China's tariffs on US …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-us-china-tariffs-reached-sky-high-levels-in-3-months/articleshow/121050851.cms",
    "timestamp": "2025-05-10T06:05:11Z"
  },
  {
    "title": "\"India's Approach Always Responsible, Remains So\", S Jaishankar Tells US",
    "description": "A senior US official and a close aide of President Donald Trump has highlighted the need for de-escalating the situation between India and Pakistan.",
    "link": "https://www.ndtv.com/india-news/us-tells-s-jaishankar-india-pak-should-identify-methods-to-de-escalate-8377956",
    "timestamp": "2025-05-10T06:02:19Z"
  },
  {
    "title": "European leaders arrive in Kyiv in show of solidarity against Russia",
    "description": "The leaders of France, Britain and Germany arrived in Ukraine on Saturday for talks with President Volodymyr Zelensky, vowing to ratchet up pressure on Russia until it agrees a ceasefire the day after a lavish military parade in Moscow.",
    "link": "https://www.thelocal.com/20250510/european-leaders-arrive-in-kyiv-in-show-of-solidarity-against-russia",
    "timestamp": "2025-05-10T06:00:41Z"
  },
  {
    "title": "Nicole Shanahan exposes RFK Jr.â\u0080\u0099s â\u0080\u0098Broken Promiseâ\u0080\u0099 â\u0080\u0093 Claims Surgeon General Pick Casey Means is a â\u0080\u0098Manchurian Assetâ\u0080\u0099 in shocking allegation",
    "description": "The health freedom movement is in turmoil as Shanahan accuses Kennedy of deception and shadowy control — while Dr. Robert Malone defends Kennedy’s Surgeon General nominee – Casey Means – amid vaccine silence controversy. In fact, Nicole Shanahan had some toug…",
    "link": "https://www.naturalnews.com/2025-05-10-nicole-shanahan-exposes-rfkjr-broken-promise.html",
    "timestamp": "2025-05-10T06:00:00Z"
  },
  {
    "title": "EU goes on offense to retain firms and counter Trump’s tariffs",
    "description": "(Bloomberg) -- he European Union is planning to counter President Donald Trump’s efforts to lure companies to the US by easing the bloc’s regulatory burden...",
    "link": "https://finance.yahoo.com/news/eu-goes-offense-retain-firms-060000243.html",
    "timestamp": "2025-05-10T06:00:00Z"
  },
  {
    "title": "Virologist who endorsed HCQ for COVID-19 appointed to top pandemic post at HHS",
    "description": "Steven J. Hatfill, a former White House COVID-19 advisor under Trump and advocate for hydroxychloroquine (HCQ) as an early COVID-19 treatment, has been appointed as a special adviser to the HHS’ Administration for Strategic Preparedness and Response (ASPR). H…",
    "link": "https://www.naturalnews.com/2025-05-10-virologist-hcq-covid-appointed-top-pandemic-post.html",
    "timestamp": "2025-05-10T06:00:00Z"
  },
  {
    "title": "Kentucky Rep. Comer warns: Epstein files may have been DESTROYED amid delays with DOJ release of documents",
    "description": "Rep. James Comer (R-KY) warns that critical Epstein files may have been destroyed by the DOJ or FBI, suggesting a deliberate coverup to conceal ties between Epstein’s network and powerful figures, including potential government involvement. Despite orders to …",
    "link": "https://www.naturalnews.com/2025-05-10-comer-epstein-files-possibly-destroyed-doj-delays.html",
    "timestamp": "2025-05-10T06:00:00Z"
  },
  {
    "title": "Judge pauses much of Trump administration's massive downsizing of federal agencies",
    "description": "A California judge has ordered the Trump administration to halt much of its massive downsizing of the federal workforce",
    "link": "https://abcnews.go.com/US/wireStory/judge-pauses-trump-administrations-massive-downsizing-federal-agencies-121660969",
    "timestamp": "2025-05-10T05:58:24Z"
  },
  {
    "title": "Grapevine: Big deal",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/israel-news/article-853176",
    "timestamp": "2025-05-10T05:56:05Z"
  },
  {
    "title": "Ukraine: Merz, Macron, Starmer and Tusk in Kyiv",
    "description": "The leaders of Germany, France, the UK and Poland are in Kyiv to meet President Volodymyr Zelenskzy. DW has the latest. The leaders of Britain, France, Germany arrived in Kyiv on a visit showing solidarity with Ukraine \nGerman Chancellor Friedrich Merz France…",
    "link": "https://www.dw.com/en/ukraine-merz-macron-starmer-and-tusk-in-kyiv/live-72497759",
    "timestamp": "2025-05-10T05:53:00Z"
  },
  {
    "title": "Elon Musk reignites feud with Sam Altman over past Trump remarks",
    "description": "Elon Musk, a cofounder-turned-critic of OpenAI, sued the company last year, alleging it had strayed from its mission of serving the public interest. On May 4, OpenAI reaffirmed that it would stay under nonprofit control, shelving earlier plans to convert into…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/elon-musk-reignites-feud-with-sam-altman-over-past-trump-remarks/articleshow/121050422.cms",
    "timestamp": "2025-05-10T05:43:13Z"
  },
  {
    "title": "Macron, Merz, Starmers and Tusk in Kiev for a teleconference of the coalition of the willing – Mitsotakis will also participate",
    "description": "The US Embassy in Ukraine warns of a strike on Kiev in the coming days\nThe post Macron, Merz, Starmers and Tusk in Kiev for a teleconference of the coalition of the willing – Mitsotakis will also participate appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/05/10/macron-merz-starmers-and-tusk-in-kiev-for-a-teleconference-of-the-coalition-of-the-willing-mitsotakis-will-also-participate/",
    "timestamp": "2025-05-10T05:40:28Z"
  },
  {
    "title": "Former ambassador Herzog: Biden backed Israel during war, but key officials were ‘hostile’",
    "description": "Herzog also discussed Gaza's day after, the Iran nuclear issue, and the hostages still held by Hamas.",
    "link": "https://www.jpost.com/israel-news/article-853399",
    "timestamp": "2025-05-10T05:37:34Z"
  },
  {
    "title": "Qataris search for bodies of Americans killed by Islamic State in Syria ahead of Trump visit",
    "description": "While the sources did tell Reuters whose remains the Qataris were searching for, it is believed that the bodies of two journalists and one aid worker are being recovered.",
    "link": "https://www.jpost.com/middle-east/article-853398",
    "timestamp": "2025-05-10T05:24:31Z"
  },
  {
    "title": "Mexico sues Google for changing 'Gulf of Mexico' to 'Gulf of America' after Trump's order",
    "description": "Mexico has sued Google after it changed the label for the Gulf of Mexico to the Gulf of America on its maps platform to match U.S. President Donald Trump's executive order.",
    "link": "https://www.foxnews.com/politics/mexico-sues-google-changing-gulf-mexico-gulf-america-after-trumps-order",
    "timestamp": "2025-05-10T05:18:40Z"
  },
  {
    "title": "Hegseth Warns Migrants Crossing into Pentagon's Border Zone: 'You Will Be Charged'",
    "description": "Secretary of Defense Pete Hegseth issued a warning to illegal aliens thinking of crossing into the United States through land controlled by the U.S. military, telling them they \"will be charged.\"\nThe post Hegseth Warns Migrants Crossing into Pentagon’s Border…",
    "link": "https://www.breitbart.com/immigration/2025/05/09/hegseth-warns-migrants-crossing-pentagon-border-zone-charged/",
    "timestamp": "2025-05-10T05:13:29Z"
  },
  {
    "title": "US, Chinese officials to meet in Geneva to discuss tariffs, as the world looks for signs of hope",
    "description": "Treasury Secretary Scott Bessent and US Trade Representative Jamieson Greer will meet in Geneva with a Chinese delegation led by Vice Premier He Lifeng",
    "link": "https://www.thehindubusinessline.com/news/world/us-chinese-officials-to-meet-in-geneva-to-discuss-tariffs-as-the-world-looks-for-signs-of-hope/article69560067.ece",
    "timestamp": "2025-05-10T05:08:05Z"
  },
  {
    "title": "India, Pakistan move closer to full war",
    "description": "ISLAMABAD &mdash; Pakistan's army said it struck several Indian military sites early Saturday in retaliation for missile strikes on airbases, a significant escalation that moves the two nuclear-armed neighbours closer to all-out war.",
    "link": "https://www.bangkokpost.com/world/3022257/india-and-pakistan-move-closer-to-full-war-after-bases-targeted",
    "timestamp": "2025-05-10T05:08:00Z"
  },
  {
    "title": "Irish-founded Tullow Oil faces $1.4bn refinancing headache amid falling crude prices",
    "description": "Shares in the exploration firm have slumped and are being sold off at rates not seen in five years",
    "link": "https://www.irishtimes.com/business/2025/05/10/tullow-oil-gas-falling-prices/",
    "timestamp": "2025-05-10T05:00:01Z"
  },
  {
    "title": "Never mind the new pope, who’s going to replace Liveline’s spiritual leader, Joe Duffy?",
    "description": "Michael McDowell coy at book launch, Bertie gives state-of-the-world address and Mark Daly feels the heat",
    "link": "https://www.irishtimes.com/politics/2025/05/10/miriam-lords-week-never-mind-the-new-pope-whos-going-to-replace-livelines-spiritual-leader-joe-duffy/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "What does the latest round of EU retaliatory tariffs mean for Ireland?",
    "description": "Getting caught in US-EU trade dispute would ‘definitely curtail our expansion plans’ says Irish seafood firm",
    "link": "https://www.irishtimes.com/politics/2025/05/10/what-does-the-latest-round-of-eu-retaliatory-tariffs-mean-for-ireland/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "‘Be prepared’: Home Depot worker issues warning about new changes to the car industry",
    "description": "Earlier this year, President Donald Trump announced a sweeping array of tariffs on every country on Earth. While many of these tariffs have since been halted, there is still a baseline 10% tariff on every country, with goods from China receiving a significant…",
    "link": "https://www.dailydot.com/news/home-depot-worker-car-industry/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "Two dolls instead of 30? Toys become the latest symbol of Trump's trade war",
    "description": "Toy dolls have become the latest rhetorical poster child for President Donald Trump's tariffs crusade",
    "link": "https://abcnews.go.com/Business/wireStory/dolls-30-toys-become-latest-symbol-trumps-trade-121646128",
    "timestamp": "2025-05-10T04:54:23Z"
  },
  {
    "title": "Two dolls instead of 30? Toys become the latest symbol of Trump's trade war",
    "description": "Toy dolls have become the latest rhetorical poster child for President Donald Trump's tariffs crusade",
    "link": "https://abcnews.go.com/US/wireStory/dolls-30-toys-become-latest-symbol-trumps-trade-121646126",
    "timestamp": "2025-05-10T04:54:22Z"
  },
  {
    "title": "How US-China tariffs reached sky-high levels in 3 months",
    "description": "Talks planned this weekend between U.S. and Chinese officials in Switzerland are a culmination of more than three months of dizzying rounds of retaliatory tariffs between the two countries that have crippled each other’s exporters and dragged on their economi…",
    "link": "https://www.seattlepi.com/news/world/article/how-us-china-tariffs-reached-sky-high-levels-in-3-20320396.php",
    "timestamp": "2025-05-10T04:53:25Z"
  },
  {
    "title": "Trade deal platform for going further - Mandelson",
    "description": "The UK ambassador to the US spoke to BBC Newsnight in his first broadcast interview since appointment.",
    "link": "https://www.bbc.com/news/articles/cn5yzw24v9ro",
    "timestamp": "2025-05-10T04:49:17Z"
  },
  {
    "title": "Mayor of Newark, New Jersey, released after arrest at immigration detention center",
    "description": "The mayor of Newark, New Jersey, has been released from custody after being arrested at a federal immigration detention center where he has been protesting its opening this week",
    "link": "https://abcnews.go.com/US/wireStory/mayor-newark-new-jersey-released-after-arrest-immigration-121663382",
    "timestamp": "2025-05-10T04:46:29Z"
  },
  {
    "title": "US and Chinese officials meet in Geneva to discuss tariffs",
    "description": "The U.S. Treasury Secretary and America’s top trade negotiator will meet with high-ranking Chinese officials in Switzerland this weekend to de-escalate a dispute that threatens to cut off trade between the world’s two biggest economies and damage the g...",
    "link": "https://abcnews.go.com/International/wireStory/us-chinese-officials-meet-geneva-discuss-tariffs-world-121663197",
    "timestamp": "2025-05-10T04:43:19Z"
  },
  {
    "title": "Lea Michele explains why internet theory about her reading skills is so ‘frustrating’",
    "description": "The actor’s ability to read and write has been a source of internet humour since 2017",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/lea-michele-interview-cant-read-internet-theory-b2748384.html",
    "timestamp": "2025-05-10T04:41:55Z"
  },
  {
    "title": "Trump involved in discussions over suspending habeas corpus, sources say (CNN)",
    "description": "CNN:\nTrump involved in discussions over suspending habeas corpus, sources say  —  President Donald Trump has been personally involved in discussions inside the administration over potentially suspending habeas corpus, a legal procedure that allows people to c…",
    "link": "https://www.memeorandum.com/250510/p2",
    "timestamp": "2025-05-10T04:40:01Z"
  },
  {
    "title": "De minimis changes: 'I freaked out and spent $400 online'",
    "description": "'I freaked out and spent $400 online – it felt like a last hurrah'\nEarlier this year, Deborah Grushkin, an enthusiastic online shopper from New Jersey, \"freaked out\".\nUS President Donald Trump had signed an order to stop allowing packages from China worth les…",
    "link": "https://biztoc.com/x/0090198c1871b2bf",
    "timestamp": "2025-05-10T04:38:31Z"
  },
  {
    "title": "US-China trade talk optimism drives oil prices to weekly gains",
    "description": "Oil prices surged nearly 2% on Friday, marking their first weekly gain since mid-April, fueled by optimism surrounding a U.S.-UK trade agreement and upcoming U.S.-China talks. Brent crude settled at $63.91 a barrel, while WTI reached $61.02, both benchmarks u…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/us-china-trade-talk-optimism-drives-oil-prices-to-weekly-gains/articleshow/121048611.cms",
    "timestamp": "2025-05-10T04:36:45Z"
  },
  {
    "title": "US dollar makes weekly gains on renewed trade deal optimism",
    "description": "The dollar is poised for a weekly gain against major currencies amid optimism surrounding potential U.S.-China trade talks, fueled by a recent U.S.-UK trade agreement. While the Federal Reserve held rates steady, the Bank of England cut them. Bitcoin's resurg…",
    "link": "https://economictimes.indiatimes.com/markets/forex/us-dollar-makes-weekly-gains-on-renewed-trade-deal-optimism/articleshow/121048496.cms",
    "timestamp": "2025-05-10T04:32:46Z"
  },
  {
    "title": "China's consumption slide deepens as tariff war bites",
    "description": "BEIJING: China said on Saturday (May 10) that consumer prices slumped in April for the third straight month, reflecting persistent challenges as leaders attempt to revive an economy stymied by sluggish spending and a fierce trade war with Washington. The worl…",
    "link": "https://www.channelnewsasia.com/east-asia/chinas-consumption-slide-deepens-tariff-war-bites-5121326",
    "timestamp": "2025-05-10T04:30:57Z"
  },
  {
    "title": "Gold edges higher on softer dollar ahead of key US-China trade talks",
    "description": "Gold prices surged over 1% on Friday, buoyed by a weaker dollar and market anticipation surrounding U.S.-China trade talks. Spot gold reached $3,340.29 an ounce, marking a 3.1% weekly gain and a 27% rise year-to-date. Trump's tariff comments and geopolitical …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-edges-higher-on-softer-dollar-ahead-of-key-us-china-trade-talks/articleshow/121048418.cms",
    "timestamp": "2025-05-10T04:29:19Z"
  },
  {
    "title": "Europe leaders head to Kiev on unprecedented visit",
    "description": "The leaders of France, Britain, Germany and Poland will make an unprecedented joint visit to Ukraine on Saturday for talks with President Volodymyr Zelensky, vowing to ratchet up pressure on Russia until it agrees a ceasefire.",
    "link": "https://www.hurriyetdailynews.com/europe-leaders-head-to-kiev-on-unprecedented-visit-209014",
    "timestamp": "2025-05-10T04:29:00Z"
  },
  {
    "title": "'I freaked out and spent $400 online – it felt like a last hurrah'",
    "description": "'I freaked out and spent $400 online – it felt like a last hurrah'\nEarlier this year, Deborah Grushkin, an enthusiastic online shopper from New Jersey, \"freaked out\".\nUS President Donald Trump had signed an order to stop allowing packages from China worth les…",
    "link": "https://biztoc.com/x/1f7d933dd6524d56",
    "timestamp": "2025-05-10T04:26:59Z"
  },
  {
    "title": "Europe's Stoxx up marginally, Germany's DAX hits record high on hopes of easing trade tensions",
    "description": "European stock markets saw gains. Germany's DAX reached a record high. Investors felt relieved by signs of a possible ease in the global trade war. U.S. and China are expected to discuss trade. BP shares increased following takeover speculation. Energy and re…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-up-marginally-germanys-dax-hits-record-high-on-hopes-of-easing-trade-tensions/articleshow/121048322.cms",
    "timestamp": "2025-05-10T04:26:32Z"
  },
  {
    "title": "Europe's Stoxx jumps 600 points, Germany's DAX hits record high on hopes of easing trade tensions",
    "description": "European stock markets saw gains. Germany's DAX reached a record high. Investors felt relieved by signs of a possible ease in the global trade war. U.S. and China are expected to discuss trade. BP shares increased following takeover speculation. Energy and re…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-jumps-600-points-germanys-dax-hits-record-high-on-hopes-of-easing-trade-tensions/articleshow/121048322.cms",
    "timestamp": "2025-05-10T04:26:32Z"
  },
  {
    "title": "Live updates: Pakistan and India agree to ceasefire; Trump makes the surprise announcement",
    "description": "US President Donald Trump made a surprise announcement that Pakistan and India have agreed to a ceasefire after their conflict escalated further overnight. Top Pakistani and Indian officials have confirmed the halt in fighting. Follow for live updates.",
    "link": "https://www.cnn.com/world/live-news/india-pakistan-operation-sindoor-05-10-25",
    "timestamp": "2025-05-10T04:26:23Z"
  },
  {
    "title": "New US envoy to Türkiye says he is 'eager' to 'building bridges'",
    "description": "New U.S. Ambassador to Türkiye Tom Barrack said Friday that he is “eager to get to work building bridges” with the Turkish people.",
    "link": "https://www.hurriyetdailynews.com/new-us-envoy-to-turkiye-says-he-is-eager-to-building-bridges-209013",
    "timestamp": "2025-05-10T04:25:01Z"
  },
  {
    "title": "Global stocks, Bitcoin rally on renewed trade deal hopes",
    "description": "Global stocks showed strength, nearing six-week highs. This followed a US-UK trade agreement, boosting hopes for tariff talks. India offered tariff cuts to the US, seeking exemptions. Germany's Dax hit a record high. The US-UK deal is seen as a positive sign …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-bitcoin-rally-on-renewed-trade-deal-hopes/articleshow/121048110.cms",
    "timestamp": "2025-05-10T04:19:16Z"
  },
  {
    "title": "When Politics Leaves Reality Behind",
    "description": "Sacramento (Special to Informed Comment; Feature) - The traditional left–right political spectrum no longer captures the forces driving division in America today. That model works when we’re dealing with competing ideologies and when ideological disagreement …",
    "link": "https://www.juancole.com/2025/05/politics-leaves-reality.html",
    "timestamp": "2025-05-10T04:15:18Z"
  },
  {
    "title": "Paschal Donohoe on How Feminist Economics Can Change Our World; Making Sense of Chaos; and Why We’re Getting Poorer",
    "description": "These authors seek to understand the behaviour of economies and the influence they have on our societies",
    "link": "https://www.irishtimes.com/culture/books/review/2025/05/10/books-in-brief-paschal-donohoe-on-how-feminist-economics-can-change-our-world-making-sense-of-chaos-and-why-were-getting-poorer/",
    "timestamp": "2025-05-10T04:15:00Z"
  },
  {
    "title": "US Stocks end flat as investors await US-China trade talks",
    "description": "Wall Street saw a quiet end to the week as investors awaited U.S.-China trade discussions. Donald Trump suggested tariff adjustments before the meeting in Switzerland. The Dow, S&P 500, and Nasdaq experienced slight weekly declines. Energy sector showed gains…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-flat-as-investors-await-us-china-trade-talks/articleshow/121047974.cms",
    "timestamp": "2025-05-10T04:14:08Z"
  },
  {
    "title": "South Korean conservative party moves to switch presidential candidates as election turmoil deepens",
    "description": "People Power Party’s original presidential candidate Kim Moon Soo has denounced the move as an “overnight political coup”.",
    "link": "https://www.channelnewsasia.com/east-asia/south-korean-conservative-party-moves-switch-presidential-candidates-election-turmoil-deepens-5121261",
    "timestamp": "2025-05-10T04:14:00Z"
  },
  {
    "title": "Wall Street Week Ahead: US market leadership faces test as economic data takes centre stage",
    "description": "Investors are keenly awaiting economic data this week. They are observing if the US stock market's leadership shifts from defensive sectors. This shift could signal a higher risk appetite. Upcoming data includes the Consumer Price Index and retail sales figur…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-us-market-leadership-faces-test-as-economic-data-takes-centre-stage/articleshow/121047922.cms",
    "timestamp": "2025-05-10T04:11:49Z"
  },
  {
    "title": "Europe leaders head to Kyiv on unprecedented visit",
    "description": "The leaders of France, Britain, Germany and Poland  will make an unprecedented joint visit to Ukraine on Saturday for talks with President Volodymyr Zelensky...",
    "link": "https://www.yahoo.com/news/europe-leaders-head-kyiv-unprecedented-215018020.html",
    "timestamp": "2025-05-10T04:08:37Z"
  },
  {
    "title": "France, Germany blocking Türkiye’s EU bid for domestic politics: Fidan",
    "description": "Foreign Minister Hakan Fidan said Friday that Türkiye’s bid for EU membership is being blocked by France and Germany for domestic political reasons.",
    "link": "https://www.hurriyetdailynews.com/france-germany-blocking-turkiyes-eu-bid-for-domestic-politics-fidan-209011",
    "timestamp": "2025-05-10T04:07:38Z"
  },
  {
    "title": "Families of Hamas-held hostages tell of growing concern for their fate",
    "description": "One family said the hostages were at risk \"every day\" they continued to be held captive.",
    "link": "https://www.bbc.com/news/articles/c8d1pngdjzmo",
    "timestamp": "2025-05-10T04:07:35Z"
  },
  {
    "title": "China in distress: Protests, economic signals reveal pressure from U.S. tariffs",
    "description": "In the \"socialist market economy\" of China, some cracks are visible that show a country unprepared to stand up to Trump tariffs long-term. China has been increasingly opaque in markets and manufacturing information. As Beijing and Washington meet this weekend…",
    "link": "https://freerepublic.com/focus/f-news/4316088/posts",
    "timestamp": "2025-05-10T04:06:39Z"
  },
  {
    "title": "'I freaked out and spent $400 online – it felt like a last hurrah'",
    "description": "How consumers are reacting to shipping changes that mean low-value packages entering the US no longer avoid tariffs.",
    "link": "https://www.bbc.com/news/articles/c4g2j45d5zeo",
    "timestamp": "2025-05-10T04:01:38Z"
  },
  {
    "title": "The Real Evil Empire May Surprise You",
    "description": "Forty years ago this month, I was commissioned a second lieutenant in the U.S. Air Force. I would be part of America’s all-volunteer force (AVF) for 20 years, hitting my marks and retiring as a lieutenant colonel in 2005. In my two decades of service, I met a…",
    "link": "https://www.lewrockwell.com/2025/05/no_author/the-real-evil-empire-may-surprise-you/",
    "timestamp": "2025-05-10T04:01:00Z"
  },
  {
    "title": "Will Trump Follow Nixon’s IRS Road to Ruin?",
    "description": "On Friday morning, President Trump proclaimed on his Truth Social: “We are going to be taking away Harvard’s Tax Exempt Status. It’s what they deserve!” Trump is being hailed as a hero for demanding that the IRS bring Harvard University to its knees. But Trum…",
    "link": "https://www.lewrockwell.com/2025/05/james-bovard/will-trump-follow-nixons-irs-road-to-ruin/",
    "timestamp": "2025-05-10T04:01:00Z"
  },
  {
    "title": "After papal election, Liz Cheney demonstrates how Trump continues to live rent-free inside her head",
    "description": "With Pope Leo XIV's election in the Vatican, politicians and world leaders of all kinds moved to deliver their congratulations, extending their best wishes.\r\n\r\nBut then there's Liz Cheney, still dreaming of Donald Trump over anything else, ev...",
    "link": "https://www.americanthinker.com/blog/2025/05/after_papal_election_liz_cheney_demonstrates_how_trump_continues_to_live_rent_free_inside_her_head.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "No escaping Alcatraz as Trump offers up another shiny distraction",
    "description": "The president’s suggestion to reopen the island prison-turned-museum just serves to move attention away from the issues that matter",
    "link": "https://www.irishtimes.com/world/us/2025/05/10/trump-alcatraz-reopen/",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Lessons from life with the black bears in New Mexico's mountains",
    "description": "It's probably true that most human beings today spend much of their lives in search of stability and security.\r\n\r\nThat likely goes double for those living in war-torn countries or those without adequate food supplies, personal safety, or democrat...",
    "link": "https://www.americanthinker.com/blog/2025/05/lessons_from_life_with_the_black_bears_in_new_mexico_s_mountains.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Leftists are right that it’s not a coincidence that the DOJ is looking into Letitia James",
    "description": "News broke yesterday that the DOJ had officially opened a criminal investigation into Letitia James’s more recent real estate transactions. Leftists immediately countered with the accusation that this investigation was no coincidence, and is no...",
    "link": "https://www.americanthinker.com/blog/2025/05/leftists_are_right_that_it_s_not_a_coincidence_that_the_doj_is_looking_into_letitia_james.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Trump Just Fired the Librarian of Congress, Here's Why Black People Should Care",
    "description": "In just over 100 days, we’ve seen President Donald Trump work overtime to erase every ounce of cultural and racial diversity from our government institutions, including threatening to end funding to the National Museum of African American History. His latest …",
    "link": "https://www.theroot.com/trump-just-fired-the-librarian-of-congress-heres-why-b-1851780094",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Maybe Donald will visit Letitia’s trial",
    "description": "About a year ago, AG Leticia James was in the courtroom watching President Trump on trial.  My guess is that she was enjoying the show and imagining what her TV ads for governor were going to be like.  “Vote for me because no one, not...",
    "link": "https://www.americanthinker.com/blog/2025/05/maybe_donald_will_visit_leticia_s_trial.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "A Canada-China embrace?",
    "description": "Now-former Canadian Prime Minister Justin Trudeau famously complimented China’s government.\r\n\r\nNewly installed Canadian Prime Minister Mark Carney is a globalist who has frequently criticized his American counterpart, President Donald Trump.\r\n\r...",
    "link": "https://www.americanthinker.com/blog/2025/05/canada_and_china_to_reconcile.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "The Folly of Realism: How the West Deceived Itself about Russia and Betrayed Ukraine by Alexander Vindman – An unsparing critique of US ‘crisis management’ policy",
    "description": "The writer’s theme is one of lost opportunities that could have prevented today’s war",
    "link": "https://www.irishtimes.com/culture/books/review/2025/05/10/the-folly-of-realism-how-the-west-deceived-itself-about-russia-and-betrayed-ukraine-by-alexander-vindman-an-unsparing-critique-of-us-crisis-management-policy/",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Trump’s latest bluster about reopening Alcatraz offers up another shiny distraction",
    "description": "The president’s suggestion to reopen the island prison-turned-museum just serves to move attention away from the issues that matter",
    "link": "https://www.irishtimes.com/world/us/2025/05/10/trumps-latest-bluster-about-reopening-alcatraz-offers-up-another-shiny-distraction/",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Celebrating Victory, Celebrating Defeat",
    "description": "President Donald Trump issued a proclamation celebrating Victory in Europe Day (VE Day), marking the 80th anniversary of the unconditional surrender of Nazi Germany on May 8, 1945. He stated “we celebrate the unmatched might, strength, and powe...",
    "link": "https://www.americanthinker.com/articles/2025/05/celebrating_victory_celebrating_defeat.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "The US and China are finally talking. Why now?",
    "description": "The US and China are finally talking. Why now?\nThe US-China trade war could be letting up, with the world's two largest economies set to begin talks in Switzerland.\nTop trade officials from both sides will meet on Saturday in the first high-level meeting sinc…",
    "link": "https://biztoc.com/x/474f2c2fffc27d0e",
    "timestamp": "2025-05-10T03:53:32Z"
  },
  {
    "title": "US Top Diplomat Marco Rubio Calls Pakistan Army Chief, Urges De-escalation",
    "description": "Marco Rubio also offered US assistance in starting &quot;constructive&quot; talks between the two countries to &quot;avoid future conflicts.",
    "link": "https://www.ndtv.com/world-news/us-top-diplomat-marco-rubio-calls-pakistan-army-chief-urges-de-escalation-8377248",
    "timestamp": "2025-05-10T03:53:09Z"
  },
  {
    "title": "News Summary Intelligence Report 5/9/2025*Newsdump Friday*European Leaders Visit Kiev*MTG Declines Senate Run*Pakistan-India Trade Attacks*Trump Talks Lower China Tariffs*World Leaders At Russia's Victory Day***",
    "description": "House Ways and Means Committee partially revealing tax legislation... leaders of at least four nations headed into Ukraine...Kremlin appreciation for President Trump's efforts to settle the war... South African officials criticizing the US plan to take in whi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4316084/posts",
    "timestamp": "2025-05-10T03:47:18Z"
  },
  {
    "title": "GOP Megadonor Ken Griffin Warns Trump Tariffs Are 'Terrifying,' Says Government Is Picking 'Winners And Losers' Amid Soaring Trade Deficit",
    "description": "Citadel founder Ken Griffin is sounding the alarm on President Donald Trump‘s tariff policies, warning they have “unleashed an era of crony capitalism” where the government picks “winners and losers” in the economy.\nWhat Happened: “Tariffs open the doors to c…",
    "link": "https://biztoc.com/x/e049fbe58652ae4e",
    "timestamp": "2025-05-10T03:42:19Z"
  },
  {
    "title": "America Humbled",
    "description": "America Humbled\n \nAuthored by Arthur Schaper via American Greatness,\nThe United States, the American people, Donald Trump, and even myself: we have all been humbled over the last four years—or the last sixteen years … or even thirty years.\nAnd we needed it.\nM…",
    "link": "https://biztoc.com/x/50996203b8c6d4ce",
    "timestamp": "2025-05-10T03:42:19Z"
  }
]