[
  {
    "title": "Trump's Battle With California Heats Up",
    "description": "The Trump administration launched three investigations in California in a single day amid claims that the Golden State is trying to thwart President Donald Trump's policies.\nWhy It Matters\nTrump's California investigations include everything from university a…",
    "link": "https://biztoc.com/x/e1cb23d71708584e",
    "timestamp": "2025-03-28T13:32:25Z"
  },
  {
    "title": "And in other Executive Order’s “restoring truth and sanity to American history by revitalizing key cultural institutions…”",
    "description": "photo by Tim Brown From the White House: \"Fact Sheet: President Donald J. Trump Restores Truth and Sanity to American History Today, President Donald J. Trump signed an Executive Order restoring truth and sanity to American history by revitalizing key cultura…",
    "link": "https://www.popville.com/2025/03/trump-executive-order-smithsonian-museums/",
    "timestamp": "2025-03-28T13:30:57Z"
  },
  {
    "title": "Hillary Clinton Says Trump Admin Signal Chat 'Put Our Troops in Jeopardy'",
    "description": "\"It's not the hypocrisy that bothers me; it's the stupidity,\" Clinton wrote in an op-ed.",
    "link": "https://www.newsweek.com/hillary-clinton-says-trump-admin-signal-chat-put-our-troops-jeopardy-2052030",
    "timestamp": "2025-03-28T13:30:46Z"
  },
  {
    "title": "'Junk insurance': Patient shocked by $7k colonoscopy bill despite coverage",
    "description": "Tim Winard knew he needed to buy health insurance when he left his management job in manufacturing to launch his own business.\nIt was the first time he had shopped around for coverage, searching for a plan that would cover him and his wife, who was also betwe…",
    "link": "https://www.rawstory.com/health-insurance-bill/",
    "timestamp": "2025-03-28T13:30:35Z"
  },
  {
    "title": "Russia says it reserves the right to resume striking Ukrainian energy targets if Kyiv flouts moratorium",
    "description": "Russia has threatened to withdraw from an agreement to halt strikes on each other's energy infrastructure if Ukraine continues such attacks, following allegations of Ukraine targeting a Russian gas station. Meanwhile, Moscow remains committed to the moratoriu…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-says-it-reserves-the-right-to-resume-striking-ukrainian-energy-targets-if-kyiv-flouts-moratorium/articleshow/119658299.cms",
    "timestamp": "2025-03-28T13:30:33Z"
  },
  {
    "title": "Trump's Battle With California Heats Up",
    "description": "The Justice Department has said that California colleges may be guilty of racial discrimination",
    "link": "https://www.newsweek.com/trump-battle-california-heats-2051968",
    "timestamp": "2025-03-28T13:29:51Z"
  },
  {
    "title": "'Charm offensive failed': Not one Greenlander was willing to publicly welcome Usha Vance",
    "description": "An advance team knocked on doors in Greenland’s capital Nuuk seeking someone who would welcome a visit from second lady Usha Vance, but every single person said no, according to a Danish TV report.Vice president J.D. Vance joined his wife on the trip after sh…",
    "link": "https://www.rawstory.com/usha-vance-greenland-2671626897/",
    "timestamp": "2025-03-28T13:28:28Z"
  },
  {
    "title": "Beware: Trump’s Middle Eastern rhetoric echoes Obama",
    "description": "Middle Israel: Sorry to make this rude analogy to a man who is actually trying to defend us, but we have already been to this movie, and it starred Barack Obama.",
    "link": "https://www.jpost.com/opinion/article-847911",
    "timestamp": "2025-03-28T13:27:22Z"
  },
  {
    "title": "Greenland parties announce broad coalition government amid Trump pressure",
    "description": "NUUK, Greenland (Reuters) -Greenland's Democrats and three more parties announced a government coalition agreement on Friday, just hours before a visit by U.S. Vice President JD Vance to the Arctic island that President Donald Trump has expressed interest in …",
    "link": "https://www.thestar.com.my/news/world/2025/03/28/greenland-parties-announce-broad-coalition-government-amid-trump-pressure",
    "timestamp": "2025-03-28T13:27:00Z"
  },
  {
    "title": "Greenland Parties Announce Broad Coalition Government",
    "description": "Greenland&#039;s Democrats and three more parties announced a government coalition agreement on Friday, just hours before a visit by US Vice President JD Vance to the Arctic island that President Donald Trump has expressed interest in acquiring.",
    "link": "https://www.ndtv.com/world-news/greenland-parties-announce-broad-coalition-government-8033286",
    "timestamp": "2025-03-28T13:26:46Z"
  },
  {
    "title": "Putin calls to remove Zelenskyy, 'finish off' Ukrainian troops",
    "description": "MURMANSK: Russian President Vladimir Putin called on Friday (Mar 28) for a \"transitional administration\" to be put in place in Ukraine and vowed his army would \"finish off\" Ukrainian troops, in hardline remarks as US President Donald Trump pushes for a ceasef…",
    "link": "https://www.channelnewsasia.com/world/putin-calls-remove-zelenskyy-finish-ukrainian-troops-5030276",
    "timestamp": "2025-03-28T13:26:00Z"
  },
  {
    "title": "DAVID MARCUS: Hey Dems, knock it off with the anti-Tesla stochastic terrorism",
    "description": "Columnist and wordsmith David Marcus recalls Democrats' near constant use of an odd phrase they say described violence-inspiring rhetoric on the right, but notes its absence in describing the leftist attacks on Tesla.",
    "link": "https://www.foxnews.com/opinion/david-marcus-hey-dems-knock-off-anti-tesla-stochastic-terrorism",
    "timestamp": "2025-03-28T13:25:19Z"
  },
  {
    "title": "Another law firm targeted by Trump sues to block punishing executive order (Politico)",
    "description": "Politico:\nAnother law firm targeted by Trump sues to block punishing executive order  —  Jenner & Block is the second law firm to try to fight Trump in court over his executive orders.  —  A law firm targeted by President Donald Trump sued Friday to bar enfor…",
    "link": "https://www.memeorandum.com/250328/p26",
    "timestamp": "2025-03-28T13:25:00Z"
  },
  {
    "title": "Trump Holds Tele-Rally with Florida GOP’s Randy Fine Ahead of Critical Special House Election",
    "description": "President Donald Trump urged voters in Florida’s Sixth Congressional District to get out and vote for Republican Randy Fine in a critical special House election during a tele-rally with the candidate on Thursday. Trump urged those on the call to support Fine …",
    "link": "https://freerepublic.com/focus/f-news/4307279/posts",
    "timestamp": "2025-03-28T13:24:52Z"
  },
  {
    "title": "Law firm Jenner & Block sues over Trump executive order, becoming 2nd firm to do so",
    "description": "A prominent Washington law firm targeted by President Donald Trump has sued to block an executive order that threatens its federal contracts and the security clearances of its employees",
    "link": "https://abcnews.go.com/US/wireStory/law-firm-jenner-block-sues-trump-executive-order-120255488",
    "timestamp": "2025-03-28T13:24:33Z"
  },
  {
    "title": "How Musk, Soros and other billionaires are shaping history's most expensive court race",
    "description": "ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox.\n\nTen years ago, when Wisconsin lawmakers approved a bill to allow unlimited spending in state elections, only o…",
    "link": "https://www.rawstory.com/how-musk-soros-and-other-billionaires-are-shaping-most-expensive-court-race/",
    "timestamp": "2025-03-28T13:23:47Z"
  },
  {
    "title": "Leftist WI Supreme Court Candidate Endorsed By Radical Tesla Protest Group",
    "description": "Trump-hating Indivisible is one of Crawford’s most gushing endorsers, and one of the left's most hostile Tesla/Musk protesters.",
    "link": "https://thefederalist.com/2025/03/28/leftist-wi-supreme-court-candidate-endorsed-by-radical-tesla-protest-group/",
    "timestamp": "2025-03-28T13:23:40Z"
  },
  {
    "title": "U.S. inflation gauge remained high in February but consumer spending recovered after steep fall",
    "description": "An inflation gauge closely watched by the Federal Reserve remained high last month even before the impact of most tariffs has been felt",
    "link": "https://www.pbs.org/newshour/nation/u-s-inflation-gauge-remained-high-in-february-but-consumer-spending-recovered-after-steep-fall",
    "timestamp": "2025-03-28T13:23:37Z"
  },
  {
    "title": "Chinese regulator to vet Panama ports deal: Hong Kong media",
    "description": "China’s market regulator said it will review Hong Kong conglomerate CK Hutchison’s sale of Panama Canal ports to a US-led consortium, a Beijing-backed newspaper in Hong Kong reported on Friday. The business empire built by Hong Kong billionaire Li Ka-shing of…",
    "link": "https://www.digitaljournal.com/world/chinese-regulator-to-vet-panama-ports-deal-hong-kong-media/article",
    "timestamp": "2025-03-28T13:22:20Z"
  },
  {
    "title": "French, Lebanese presidents condemn Israeli strikes on Beirut as 'unacceptable'",
    "description": "\"Israel is France's friend\", Macron told reporters, adding France could thus express disagreements over some of Israel's actions.",
    "link": "https://www.jpost.com/middle-east/article-847990",
    "timestamp": "2025-03-28T13:22:14Z"
  },
  {
    "title": "Canada’s economy got hot in January, but StatCan points to February chill",
    "description": "OTTAWA — Statistics Canada says the Canadian economy was off to a solid start in January but early signs suggest growth hit a wall in February. The agency said Friday that real gross domestic product rose 0.4 per cent in January thanks largely to a boom in th…",
    "link": "https://financialpost.com/pmn/canadas-economy-got-hot-in-january-but-statcan-points-to-february-chill",
    "timestamp": "2025-03-28T13:22:10Z"
  },
  {
    "title": "Chinese Regulator To Vet Panama Ports Deal: Hong Kong Media",
    "description": "China's market regulator said it will review Hong Kong conglomerate CK Hutchison's sale of Panama Canal ports to a US-led consortium, a Beijing-backed newspaper in Hong Kong reported on Friday.",
    "link": "https://www.ibtimes.com/chinese-regulator-vet-panama-ports-deal-hong-kong-media-3768025",
    "timestamp": "2025-03-28T13:21:22Z"
  },
  {
    "title": "Nikola founder Trevor Milton says granted full pardon by Trump",
    "description": "Trevor Milton, the founder of bankrupt electric and hydrogen-powered truck maker Nikola who was convicted of fraud, has been pardoned by U.S. President Donald Trump, Milton said in a social media post on Thursday.\nMilton was sentenced to four years in prison …",
    "link": "https://biztoc.com/x/0be273fabdb4943d",
    "timestamp": "2025-03-28T13:20:51Z"
  },
  {
    "title": "Trump executive order to force changes at Smithsonian Institution, targeting funding for programs with ‘improper ideology’",
    "description": "President Donald Trump has signed an executive order on the Smithsonian Institution that targets funding to programs that contain what he calls \"divisive narratives\" and \"improper ideology.\"",
    "link": "https://biztoc.com/x/7ef4c99a199a357c",
    "timestamp": "2025-03-28T13:20:48Z"
  },
  {
    "title": "Iran Threatens U.S. Allies and Bases: \"Powder Kegs\"",
    "description": "While Iran has responded to a letter from U.S. President Donald Trump offering a diplomatic opening, the rhetoric on conflict remains high",
    "link": "https://biztoc.com/x/847fa175a0ba5d2e",
    "timestamp": "2025-03-28T13:20:39Z"
  },
  {
    "title": "Trump Blames Mike Waltz for Signal Chat Leak",
    "description": "Some of Donald Trump’s most ardent backers are voicing frustration with his team’s refusal to admit fault over the Signal intelligence breach, a rare crack in the president’s wall of support.\nTrump’s demand for loyalty above all else has been a defining featu…",
    "link": "https://biztoc.com/x/8a37575adc5da35a",
    "timestamp": "2025-03-28T13:20:32Z"
  },
  {
    "title": "NASA Disgusted by Elon Musk's Disrespect",
    "description": "Under president Donald Trump and his number one henchman Elon Musk' orders, swathes of NASA are being laid to waste — and staffers are fuming. As CNN reports, mass layoffs gutting three offices earlier this year have resulted in employees questioning the spac…",
    "link": "https://futurism.com/nasa-disgusted-elon-musk-layoffs",
    "timestamp": "2025-03-28T13:20:21Z"
  },
  {
    "title": "Trump giving too much ground on Ukraine, says Farage",
    "description": "The Reform UK leader says Russia appears to be \"getting far too much\" in US-led ceasefire talks.",
    "link": "https://www.bbc.com/news/articles/cjd3d3jdxkjo",
    "timestamp": "2025-03-28T13:19:04Z"
  },
  {
    "title": "Israel strikes Beirut for first time since Hezbollah ceasefire began",
    "description": "The Israeli Defense Forces says it launched strikes on a Hezbollah drone storage facility in the Beirut suburb of Dahieh.",
    "link": "https://www.abc.net.au/news/2025-03-29/israel-strikes-beirut-for-first-time-since-hezbollah-ceasefire/105111348",
    "timestamp": "2025-03-28T13:17:01Z"
  },
  {
    "title": "Tesla Takedown Prepares for Its Biggest Day of Anti-Musk Protests",
    "description": "On Saturday, Elon Musk’s Tesla dealerships around the world will be met with protests. \r\nOrganizers are calling it the Tesla Takedown Global Day of Action, and plan to hold rallies at over 200 Tesla locations, including close to 50 in California. They hope to…",
    "link": "https://newrepublic.com/post/193300/tesla-takedown-biggest-day-anti-musk-protests-march-29",
    "timestamp": "2025-03-28T13:16:52Z"
  },
  {
    "title": "Wisconsin Supreme Court race; Musk to hold rally, deliver $2M to voters",
    "description": "Billionaire Elon Musk said he plans to hold a rally in Wisconsin to “personally hand over\" $2 million to a pair of voters who have already cast their ballots in the state’s hotly contested Supreme Court race, despite a state law that prohibits giving anything…",
    "link": "https://www.fox6now.com/news/wisconsin-supreme-court-race-musk-hold-rally-deliver-2m-voters",
    "timestamp": "2025-03-28T13:15:38Z"
  },
  {
    "title": "JENNY BETH MARTIN: The Left’s Anti-Tesla Protests Are Domestic Terrorism",
    "description": "Opponents of President Trump’s efforts to cut the size and scope of government are committing acts of domestic terrorism against Tesla.",
    "link": "https://dailycaller.com/2025/03/28/opinion-left-anti-tesla-protests-domestic-terrorism-jenny-beth-martin/",
    "timestamp": "2025-03-28T13:14:30Z"
  },
  {
    "title": "Putin not discussed introducing foreign rule in Ukraine with Trump - Kremlin",
    "description": "Russian President Vladimir Putin and U.S. President Donald Trump did not discuss the idea of implementing foreign administration in Ukraine during their phone conversation, said Kremlin spokesperson Dmitry Peskov, APA's Moscow correspondent reports According …",
    "link": "https://freerepublic.com/focus/f-chat/4307275/posts",
    "timestamp": "2025-03-28T13:13:56Z"
  },
  {
    "title": "'Democrats smell blood' due to 'unspeakably bad' news for Trump: MSNBC panel",
    "description": "The Donald Trump administration's inability to just admit that including The Atlantic editor-in-chief Jeffrey Goldberg to a Signal chat where plans for an attack on Yemen were detailed is handing Democrats a weapon as polling on the scandal shows a substantia…",
    "link": "https://www.rawstory.com/bad-news-trump/",
    "timestamp": "2025-03-28T13:13:35Z"
  },
  {
    "title": "GDP hit wall in February after January boost, says StatsCan",
    "description": "Statistics Canada says the Canadian economy was off to a solid start in January but early signs suggest growth hit a wall in February.",
    "link": "https://www.cbc.ca/news/business/statcan-gdp-february-1.7495854",
    "timestamp": "2025-03-28T13:12:20Z"
  },
  {
    "title": "Map Shows How Medicaid and SNAP Cuts Could Hit Your State",
    "description": "The Commonwealth Fund report, released on March 25, predicted that millions of jobs across the country would be lost following the passing of the GOP's budget.",
    "link": "https://www.newsweek.com/medicaid-snap-benefit-cuts-map-jobs-budget-republicans-trump-doge-2051915",
    "timestamp": "2025-03-28T13:11:40Z"
  },
  {
    "title": "Iran Threatens U.S. Allies and Bases: \"Powder Kegs\"",
    "description": "While Iran has responded to a letter from U.S. President Donald Trump offering a diplomatic opening, the rhetoric on conflict remains high",
    "link": "https://www.newsweek.com/united-states-iran-nuclear-warning-2051988",
    "timestamp": "2025-03-28T13:11:08Z"
  },
  {
    "title": "Trump executive order to force changes at Smithsonian Institution, targeting funding for programs with ‘improper ideology’",
    "description": "President Donald Trump has signed an executive order on the Smithsonian Institution that targets funding to programs that contain what he calls \"divisive narratives\" and \"improper ideology.\"",
    "link": "https://www.pbs.org/newshour/nation/trump-executive-order-to-force-changes-at-smithsonian-institution-targeting-funding-for-programs-with-improper-ideology",
    "timestamp": "2025-03-28T13:11:06Z"
  },
  {
    "title": "US inflation remained elevated last month as consumer spending recovered",
    "description": "An inflation gauge closely watched by the Federal Reserve remained high last month even before the impact of most tariffs has been felt.",
    "link": "https://richmond.com/news/nation-world/business/economy/article_c8076ebd-1c1a-5e75-89b1-d8611d4a39b2.html",
    "timestamp": "2025-03-28T13:10:00Z"
  },
  {
    "title": "How Legal Immigrants Could Boost US Economy",
    "description": "More highly skilled legal immigrants in the United States would mean stronger economic growth, according to a new study.\nWhy It Matters\nPresident Donald Trump has vowed to carry out the largest deportation program in American history, ramping up removals of m…",
    "link": "https://biztoc.com/x/1934d8ff7156590f",
    "timestamp": "2025-03-28T13:09:38Z"
  },
  {
    "title": "Consumer Watchdog Seeks to Vacate Discrimination Case it Already Won",
    "description": "The top U.S. consumer finance agency on Wednesday asked a court to undo an enforcement case which the watchdog had already won last year, accusing prior agency officials of abusing their power as they sought to enforce diversity, equity and …",
    "link": "https://www.insurancejournal.com/news/national/2025/03/28/817554.htm",
    "timestamp": "2025-03-28T13:09:04Z"
  },
  {
    "title": "Donald Trump's 25 Percent Tariffs Could Kill Off The Cheap Car",
    "description": "We're looking at which cars Donald Trump's new 25 percent import tariffs will hit hardest and his threats against automakers if they raise prices.",
    "link": "https://www.jalopnik.com/1821074/trump-25-percent-auto-tariffs-could-kill-cheap-cars/",
    "timestamp": "2025-03-28T13:07:39Z"
  },
  {
    "title": "New Trump Policy Would Eliminate Union Rights For A Million Workers",
    "description": "The administration is trying to use a national security exemption to eliminate union rights for hundreds of thousands of workers.",
    "link": "https://www.huffpost.com/entry/trump-unions-executive-order_n_67e6916ee4b086a4e8de460b",
    "timestamp": "2025-03-28T13:06:52Z"
  },
  {
    "title": "Nikola founder Trevor Milton says Trump pardoned him in securities fraud case",
    "description": "Milton, who compared his prosecution by the Justice Department to its criminal cases against President Trump, said he had been \"railroaded\" in the fraud case.",
    "link": "https://www.cnbc.com/2025/03/28/trump-pardons-nikola-trevor-milton-ceo-securities-fraud-electric-vehicle.html",
    "timestamp": "2025-03-28T13:04:30Z"
  },
  {
    "title": "How Legal Immigrants Could Boost US Economy",
    "description": "Increasing visas for higher-skilled workers and reducing them for lower-skilled workers would boost the economy, a new study says.",
    "link": "https://www.newsweek.com/legal-immigration-boost-economy-us-2051951",
    "timestamp": "2025-03-28T13:03:25Z"
  },
  {
    "title": "Apple faces modest fines as EU seeks to avoid tensions with America",
    "description": "Apple and Meta Platforms Inc. are expected to face fines under the European Union’s competition regulations for Big Tech by the end of next…\nThe post Apple faces modest fines as EU seeks to avoid tensions with America appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/03/28/apple-faces-modest-fines-as-eu-seeks-to-avoid-tensions-with-america/",
    "timestamp": "2025-03-28T13:03:24Z"
  },
  {
    "title": "Mahmoud Khalil Challenges US Deportation in Federal Court: Live Updates",
    "description": "Lawyers for Mahmoud Khalil, a Columbia student facing deportation for pro-Palestinian activism, will be in New Jersey court today. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/mahmoud-khalil-deportation-hearing-trump-columbia-university-live-updates-2052013",
    "timestamp": "2025-03-28T13:02:49Z"
  },
  {
    "title": "Latest Trump Order Seen as Message to Workers: 'Fall in Line or Else'",
    "description": "President Donald Trump's latest attack on the working class was delivered in the form of an executive order late Thursday that seeks to strip the collective bargaining rights from hundreds of thousands of federal government workers, a move that labor rights a…",
    "link": "https://www.commondreams.org/news/trump-collective-bargaining-federal-workers",
    "timestamp": "2025-03-28T13:02:36Z"
  },
  {
    "title": "Jimmy Kimmel Says Trump Should Call Pete Hegseth And Mike Waltz Eric And Don Jr.: “Said And Done So Many Stupid Things”",
    "description": "Kimmel is continuing to dissect the fallout of the leaked Signal chat.",
    "link": "https://decider.com/2025/03/28/jimmy-kimmel-trump-pete-hegseth-mike-waltz-eric-don-jr/",
    "timestamp": "2025-03-28T13:01:57Z"
  },
  {
    "title": "Gold rallies Rs 1,100 to scale new record high of Rs 92,150 per 10 g",
    "description": "Gold prices rallied by Rs 1,100 to hit a fresh peak of Rs 92,150 per 10 grams in the national capital on Friday amid rise in precious metal rates in the overseas markets, according to the All India Sarafa Association. The precious metal of 99.9 per cent purit…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-rallies-rs-1100-to-scale-new-record-high-of-rs-92150-per-10-g/articleshow/119657022.cms",
    "timestamp": "2025-03-28T13:01:37Z"
  },
  {
    "title": "IRS sharing info with ICE would put illegal immigrants between 'rock and a hard place': expert",
    "description": "Cooperation between the Internal Revenue Service and U.S. Immigration and Customs Enforcement would put some illegal immigrants is a difficult position, says one expert.",
    "link": "https://www.foxnews.com/politics/irs-sharing-info-ice-would-put-illegal-immigrants-between-rock-hard-place-expert",
    "timestamp": "2025-03-28T13:00:26Z"
  },
  {
    "title": "EHN: “The Revolutionary War was fought to give consent to the governed and to end taxation without representation. President Trump’s rhetoric runs counter to this history.”",
    "description": "photo by angela n. From the office of Congresswoman Eleanor Holmes Norton: \"Congresswoman Eleanor Holmes Norton (D-DC) released a statement tonight after President Trump signed an anti-D.C. home rule executive order (EO) establishing a task force to combat cr…",
    "link": "https://www.popville.com/2025/03/we-are-so-screwed/",
    "timestamp": "2025-03-28T13:00:02Z"
  },
  {
    "title": "Wyatt Hendrickson recounts ‘unreal’ upset of Gable Steveson, reveals future plans including possible MMA move",
    "description": "Wyatt Hendrickson talks potential MMA career after historic upset of Gable Steveson.",
    "link": "https://www.mmafighting.com/2025/3/28/24395561/wyatt-hendrickson-recounts-unreal-upset-gable-steveson-reveals-future-plans-possible-mma-move",
    "timestamp": "2025-03-28T13:00:00Z"
  },
  {
    "title": "John Connelly: Trump Never Learned the Lesson of Chamberlain at Munich",
    "description": "President Trump and Vice President Vance berate President Zelensky at the White House, February 28, 2025 (OSV News photo/Brian Snyder, Reuters) John Connelly is a historian of East Central Europe at the University of California at Berkeley. This essay appeare…",
    "link": "https://dianeravitch.net/2025/03/28/john-connelly-trump-never-learned-the-lesson-of-chamberlain-at-munich/",
    "timestamp": "2025-03-28T13:00:00Z"
  },
  {
    "title": "Book industry fears Canada's proposed counter-tariffs against U.S.-printed books will do more harm than good",
    "description": "Publishers, booksellers, authors and libraries — basically anyone involved in Canada’s book world — are worried countertariffs, proposed by the Canadian government on U.S.-published works, will do irreversible damage to the industry as we know it.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/canada-counter-tariffs-books-1.7495408",
    "timestamp": "2025-03-28T13:00:00Z"
  },
  {
    "title": "Trump Goes After Law Firm With Ties To Robert Mueller",
    "description": "Trump said Mueller's probe of Russian interference in the 2016 presidential election \"epitomizes the weaponization of government.\"",
    "link": "https://www.huffpost.com/entry/trump-targets-law-firm-with-mueller-ties_n_67e680dee4b086a4e8de3c4c",
    "timestamp": "2025-03-28T12:58:47Z"
  },
  {
    "title": "FBI Arrests 36-Year-Old Nevada Man for Allegedly Setting Fire to Teslas",
    "description": "The fires been described as terrorism by federal authorities.",
    "link": "https://gizmodo.com/fbi-arrests-36-year-old-nevada-man-for-allegedly-setting-fire-to-teslas-2000581855",
    "timestamp": "2025-03-28T12:58:24Z"
  },
  {
    "title": "Trump order targets ‘improper’ ideology at the Smithsonian Institution",
    "description": "Donald Trump is targeting content at the Smithsonian Institution that he considers “improper” and “anti-American.” What could possibly go wrong?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-order-targets-improper-ideology-smithsonian-institution-rcna198535",
    "timestamp": "2025-03-28T12:57:03Z"
  },
  {
    "title": "Kristi Noem Went To El Salvador And All She Got Was This Nazi Propaganda Video",
    "description": "I mean, look for yourself.",
    "link": "https://www.wonkette.com/p/kristi-noem-went-to-el-salvador-and",
    "timestamp": "2025-03-28T12:55:55Z"
  },
  {
    "title": "XRP price may drop another 40% as Trump tariffs spook risk traders",
    "description": "The XRP (XRP) market is flashing warning signs as a bearish technical pattern emerges on its weekly chart, coinciding with macroeconomic pressures from anticipated US tariffs in April.XRP descending triangle pattern hints at 40% drop\r\nSince its late 2024 rall…",
    "link": "https://cointelegraph.com/news/xrp-price-drop-40-trump-tariffs-spook-risk-traders",
    "timestamp": "2025-03-28T12:55:46Z"
  },
  {
    "title": "Recession fear is back? Donald Trump's tariffs could force lay offs, job cuts, claim economists",
    "description": "US President Donald Trump's tariffs have created a sense of uncertainty, according to economic pundits.",
    "link": "https://economictimes.indiatimes.com/news/international/us/recession-fear-is-back-donald-trumps-tariffs-could-force-lay-offs-claim-economists/articleshow/119656578.cms",
    "timestamp": "2025-03-28T12:54:41Z"
  },
  {
    "title": "Musk promises to go to Wisconsin to personally deliver $2 million to voters in Supreme Court race",
    "description": "Billionaire Elon Musk says he plans to hold a rally in Wisconsin to “personally hand over” $2 million to a pair of voters who have already cast their ballots in the state’s hotly contested Supreme Court race",
    "link": "https://abcnews.go.com/Politics/wireStory/musk-promises-wisconsin-personally-deliver-2-million-voters-120253899",
    "timestamp": "2025-03-28T12:54:33Z"
  },
  {
    "title": "RECAP | Canada election: Carney says Trump ‘respected sovereignty of our country’ during private call",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/recap-canada-election-carney-says-trump-respected-sovereignty-of-our-country-during-private-call-9.6702313",
    "timestamp": "2025-03-28T12:54:06Z"
  },
  {
    "title": "US consumer spending rises in February; core inflation firmer",
    "description": "U.S. consumer spending saw a rebound in February, driven by rising prices. Donald Trump's new tariff actions have sparked fears of economic slowdown and heightened inflation. The PCE price index rose 0.3% in February, reflecting growing inflation expectations…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-consumer-spending-rises-in-february-core-inflation-firmer/articleshow/119656665.cms",
    "timestamp": "2025-03-28T12:53:52Z"
  },
  {
    "title": "Meloni backs Vance’s attack on EU",
    "description": "The US is right to call out European elites for democratic backsliding, Italy’s prime minister has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614904-meloni-vance-western-values/",
    "timestamp": "2025-03-28T12:51:16Z"
  },
  {
    "title": "CHARLEBOIS: Canola, pork, seafood burn while feds worship auto sector",
    "description": "China has imposed crippling tariffs on key Canadian agri-food exports: 100% on grains and canola, and 25% on pork, lobster and seafood.",
    "link": "https://torontosun.com/opinion/columnists/charlebois-canola-pork-and-seafood-burn-while-feds-worship-auto-sector",
    "timestamp": "2025-03-28T12:50:08Z"
  },
  {
    "title": "'Will backfire badly': Right-wing legal scholars warn Trump against defying courts",
    "description": "Politico's Ankush Khardori this week spoke with several right-wing legal scholars about the prospects of President Donald Trump defying court orders and he came away with the conclusion that doing so \"will backfire badly\" on the president and his allies.While…",
    "link": "https://www.rawstory.com/trump-supreme-court-2671626766/",
    "timestamp": "2025-03-28T12:49:02Z"
  },
  {
    "title": "Apple set to face ‘minimal fines’ under the DMA as EU fears Trump retaliation",
    "description": "According to the report from the Financial Times, citing “people familiar with the decisions,” Apple is set to be “fined and ordered to revise its App Store rules” as soon as next week. The fines, however, won’t be as dramatic as initially expected, thanks in…",
    "link": "https://9to5mac.com/2025/03/28/apple-eu-minimal-fines-trump-dma/",
    "timestamp": "2025-03-28T12:48:55Z"
  },
  {
    "title": "FACT CHECK: Did Elon Musk Say Tesla Is ‘Doomed?’",
    "description": "A viral post shared on Facebook claims Elon Musk purportedly said, “Tesla is doomed.” Verdict: False Musk has not referenced the claim on his verified X account @elonmusk, and there is no other evidence to support the claim. Fact Check: President Donald Trump…",
    "link": "https://checkyourfact.com/2025/03/28/fact-check-musk-tesla-doomed/",
    "timestamp": "2025-03-28T12:47:58Z"
  },
  {
    "title": "Mark Carney says Old US-Canada Relationship 'Is Over' Amid Trump Tariffs",
    "description": "Canadian Prime Minister Mark Carney said the relationship the country has previously enjoyed with the U.S. is now \"over\" amid ongoing tensions and backlash to President Donald Trump's tariff plans.\nCarney's comments came one day after Trump announced he would…",
    "link": "https://biztoc.com/x/d31ac926fce5b95e",
    "timestamp": "2025-03-28T12:47:38Z"
  },
  {
    "title": "Companies now offering free therapy for Canadians stressing about Trump",
    "description": "It has been a tumultuous time for Canadians amid an ongoing cost-of-living crisis that has been exacerbated by the tariffs imposed by United States President Donald Trump.\r\nNew data from Mental Health Research Canada (MHRC) suggests that nearly half (42 per c…",
    "link": "https://dailyhive.com/canada/canadians-free-therapy-trump-tariffs",
    "timestamp": "2025-03-28T12:47:07Z"
  },
  {
    "title": "US inflation remained elevated last month as consumer spending recovered",
    "description": "The report from the Commerce Department showed that consumer prices increased 2.5% in February.",
    "link": "https://www.bostonherald.com/2025/03/28/us-consumer-spending-inflation-february/",
    "timestamp": "2025-03-28T12:46:53Z"
  },
  {
    "title": "We analyzed racial justice statements from the 500 largest US companies and found that DEI officials really did have an influence",
    "description": "Only 1 in 5 Fortune 500 companies made strong racial justice commitments in response to the 2020 Black Lives Matter protests. Those companies were more likely to have DEI staff.",
    "link": "https://theconversation.com/we-analyzed-racial-justice-statements-from-the-500-largest-us-companies-and-found-that-dei-officials-really-did-have-an-influence-249999",
    "timestamp": "2025-03-28T12:46:47Z"
  },
  {
    "title": "‘This Is Just Dumb!’ Hillary Clinton Torches ‘Slash-And-Burn’ Trump Admin in Scathing NYT Op-Ed",
    "description": "Former State Secretary Hillary Clinton torched President Donald Trump’s “slash-and-burn” administration as “feeble” and “dumb” while mocking the Signalgate scandal that saw military plans shared on a commercial group chat that accidentally included a journali…",
    "link": "https://www.mediaite.com/news/this-is-just-dumb-hillary-clinton-torches-slash-and-burn-trump-admin-in-scathing-nyt-op-ed/",
    "timestamp": "2025-03-28T12:46:20Z"
  },
  {
    "title": "‘State secrets’ claim over deportation flight details breaks with past practice",
    "description": "The Justice Department’s decision to invoke the rarely used state secrets privilege in a bid to avoid giving a federal judge’s details on questions on two deportation flights has opened a complicated new front in the government’s ongoing resistance to turning…",
    "link": "https://www.cnn.com/2025/03/28/politics/state-secrets-deportation-flight-explainer/index.html",
    "timestamp": "2025-03-28T12:46:01Z"
  },
  {
    "title": "Trump Targets Smithsonian, Myanmar Cultural Heritage Damaged by Earthquake, and More: Morning Links for March 28, 2025",
    "description": "Trump is targeting the Smithsonian, an earthquake in Myanmar damaged cultural sites, and more global art news.",
    "link": "https://www.artnews.com/art-news/news/trump-targets-smithsonian-myanmar-earthquake-morning-links-1234737160/",
    "timestamp": "2025-03-28T12:45:25Z"
  },
  {
    "title": "Trump signs executive order to end collective bargaining at agencies involved with national security",
    "description": "President Donald Trump is ending collective bargaining with federal labor unions in agencies with national security missions across the federal government, citing authority granted him under a 1978 law.",
    "link": "https://www.clickondetroit.com/news/politics/2025/03/28/trump-signs-executive-order-to-end-collective-bargaining-at-agencies-involved-with-national-security/",
    "timestamp": "2025-03-28T12:45:22Z"
  },
  {
    "title": "US inflation remained elevated last month as consumer spending recovered",
    "description": "WASHINGTON (AP) — An inflation gauge closely watched by the Federal Reserve remained high last month even before the impact of most tariffs has been felt. Americans’ spending rebounded in February after a steep fall last month and incomes increased. Friday’s …",
    "link": "https://financialpost.com/pmn/us-inflation-remained-elevated-last-month-as-consumer-spending-recovered",
    "timestamp": "2025-03-28T12:45:22Z"
  },
  {
    "title": "Mark Carney says Old US-Canada Relationship 'Is Over' Amid Trump Tariffs",
    "description": "Canada's prime minister said the county needs to \"dramatically reduce\" its reliance on the U.S.",
    "link": "https://www.newsweek.com/mark-carney-relationship-over-canada-us-trump-tariffs-2051884",
    "timestamp": "2025-03-28T12:44:49Z"
  },
  {
    "title": "Friday, March 28, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/friday-march-28-2025/",
    "timestamp": "2025-03-28T12:43:10Z"
  },
  {
    "title": "Trump Organization eyes multi-billion-dollar projects in Vietnam amid tariff risks",
    "description": "The Trump Organization and its partner in Vietnam are working on multiple investments worth billions of dollars in golf courses, hotels and real estate projects in the Southeast Asian country, a spokesman for the consortium told Reuters",
    "link": "https://tuoitrenews.vn/news/business/20250328/trump-organization-eyes-multibilliondollar-projects-in-vietnam-amid-tariff-risks/85581.html",
    "timestamp": "2025-03-28T12:42:55Z"
  },
  {
    "title": "Trump DHS Begins Sending Notices To Migrants Biden Paroled Into US: Pack Your Bags",
    "description": "Termination notices are being delivered to hundreds of thousands of migrants who entered the U.S. through CHNV, a fraud-ridden parole program launched by Biden.",
    "link": "https://dailycaller.com/2025/03/28/termination-notices-sent-to-chnv-migrants/",
    "timestamp": "2025-03-28T12:41:05Z"
  },
  {
    "title": "Markets close FY25 on a subdued note amid tariff concerns",
    "description": "The Nifty 50 dropped 72.60 points (0.31 per cent) to settle at 23,519.35, while the Sensex fell 191.51 points (0.25 per cent) to close at 77,414.92",
    "link": "https://www.thehindubusinessline.com/markets/markets-close-fy25-on-a-subdued-note-amid-tariff-concerns/article69385868.ece",
    "timestamp": "2025-03-28T12:40:55Z"
  },
  {
    "title": "Trump Holds Tele-Rally with Florida GOP's Randy Fine Ahead of Critical Special House Election",
    "description": "President Donald Trump urged voters in Florida's Sixth Congressional District to get out and vote for Republican Randy Fine in a critical special House election during a tele-rally with the candidate on Thursday.\nThe post Trump Holds Tele-Rally with Florida G…",
    "link": "https://www.breitbart.com/politics/2025/03/28/trump-holds-tele-rally-with-florida-gops-randy-fine-ahead-of-key-election/",
    "timestamp": "2025-03-28T12:40:16Z"
  },
  {
    "title": "Bedlam, Pending",
    "description": "\"You need a sufficient amount of ruthlessness to run a country\" — Will Chamberlain on \"X\"",
    "link": "https://www.kunstler.com/p/bedlam-pending",
    "timestamp": "2025-03-28T12:39:43Z"
  },
  {
    "title": "Why Turkey’s Pro-Democracy Protests Probably Won’t Succeed",
    "description": "President Erdogan is calculating he can ride out the upheaval caused by the arrest of his top rival, Istanbul Mayor Ekrem Imamoglu.",
    "link": "https://time.com/7272177/turkey-imamoglu-arrest-erdogan-authoritarianism/",
    "timestamp": "2025-03-28T12:38:28Z"
  },
  {
    "title": "Melania Trump to be deported? Elon Musk's stern warning to Congresswoman over her shocking calls",
    "description": "Will Donald Trump's wife Melania Trump will be deported from US? Democrat leader Maxine Waters sparked controversy after she made shocking calls to deport the First Lady of the United States and probing the matter. This prompted a stern reply from DOGE chief …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/melania-trump-to-be-deported-elon-musks-stern-warning-to-congresswoman-over-her-shocking-calls/articleshow/119655510.cms",
    "timestamp": "2025-03-28T12:37:45Z"
  },
  {
    "title": "Trump Should Redo Mexico-Canada Trade Deal, Key Lawmaker Says",
    "description": "A key Republican lawmaker called on President Donald Trump to renegotiate the US-Mexico-Canada free-trade agreement in order to provide an off-ramp to new tariffs on automobiles announced this week.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-should-redo-mexico-canada-trade-deal-key-lawmaker-says",
    "timestamp": "2025-03-28T12:36:53Z"
  },
  {
    "title": "EU To Issue Minimal Fines To Apple And Meta To Avoid Retaliation From Trump Administration",
    "description": "is set to impose minor penalties on Apple Inc. AAPL and Meta Platforms Inc. META, the parent company of Facebook, under its Digital Markets Act (DMA).\nWhat Happened: To avoid escalating tensions with U.S. President Donald Trump, the EU has decided to limit fi…",
    "link": "https://biztoc.com/x/6225592fdccc6ce8",
    "timestamp": "2025-03-28T12:36:44Z"
  }
]