[
  {
    "title": "Brazil's Lula asks Trump to lift tariffs in video call",
    "description": "Brazil's leader held a \"positive\" call with US President Donald Trump, and discussed punitive measures imposed by the US president who has claimed a criminal case against Brazil's ex-president Jair Bolsonaro was biased.",
    "link": "https://www.dw.com/en/brazils-lula-asks-trump-to-lift-tariffs-in-video-call/a-74255362",
    "timestamp": "2025-10-06T15:55:00Z"
  },
  {
    "title": "Democratic candidate for New Jersey governor Mikie Sherrill trashes the pork roll, will now definitely lose the race to Republican Jack Ciattarelli [Dumbass]",
    "description": "Democratic candidate for New Jersey governor Mikie Sherrill trashes the pork roll, will now definitely lose the race to Republican Jack Ciattarelli",
    "link": "https://www.fark.com/comments/13835702/Democratic-candidate-for-New-Jersey-governor-Mikie-Sherrill-trashes-pork-roll-will-now-definitely-lose-race-to-Republican-Jack-Ciattarelli",
    "timestamp": "2025-10-06T15:54:34Z"
  },
  {
    "title": "Trump posts message for Gen Zers on TikTok: 'You owe me big'",
    "description": "Last week, Donald Trump gave formal approval to a group of US investors, including Larry Ellison, to purchase TikTok.",
    "link": "https://www.businessinsider.com/trump-tiktok-saved-deal-status-2025-10",
    "timestamp": "2025-10-06T15:54:30Z"
  },
  {
    "title": "Stephen Miller Sparks Fury With Attack on Trump-Appointed Judge: ‘Genuinely Disgusting’",
    "description": "“This sweaty online lust to obliterate the judicial system and declare martial law is genuinely disgusting stuff,\" replied Derek Thompson\nThe post Stephen Miller Sparks Fury With Attack on Trump-Appointed Judge: ‘Genuinely Disgusting’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/politics/stephen-miller-sparks-fury-with-attack-on-trump-appointed-judge-genuinely-disgusting/",
    "timestamp": "2025-10-06T15:54:12Z"
  },
  {
    "title": "Billionaire beef boss says Americans crave so much protein the country is outpacing its own production and turning to imports",
    "description": "Wesley Batista says GLP-1 drugs could be fueling the protein-diet fad.",
    "link": "https://fortune.com/2025/10/06/wesley-batista-jbs-protein-diet-glp1-drugs-ozempic-meat-imports/",
    "timestamp": "2025-10-06T15:54:01Z"
  },
  {
    "title": "Mike Johnson fires back at Hakeem Jeffries' 'desperate' call for televised shutdown debate",
    "description": "Speaker Mike Johnson rejects Minority Leader Hakeem Jeffries' challenge for a primetime House floor debate on the ongoing government shutdown.",
    "link": "https://www.foxnews.com/politics/mike-johnson-fires-back-hakeem-jeffries-desperate-call-televised-shutdown-debate",
    "timestamp": "2025-10-06T15:50:52Z"
  },
  {
    "title": "Trump’s Offshore Wind Crackdown Sends Shockwaves Through Supplier Industry",
    "description": "The Trump administration’s attack on the offshore wind industry is squeezing a key revenue stream for the subcontractors that help build wind farms, forcing many to put investment plans on ice.",
    "link": "https://gcaptain.com/trumps-offshore-wind-crackdown-sends-shockwaves-through-supplier-industry/",
    "timestamp": "2025-10-06T15:50:25Z"
  },
  {
    "title": "Lula asks Trump to lift 40% tariff on Brazilian imports",
    "description": "Brazilian President Luiz Inácio Lula da Silva has asked U.S. President Donald Trump to lift the 40% tariff on Brazilian imports",
    "link": "https://abcnews.go.com/Business/wireStory/lula-asks-trump-lift-40-tariff-brazilian-imports-126257565",
    "timestamp": "2025-10-06T15:49:40Z"
  },
  {
    "title": "No Kings Protest on October 18: Peaceful protests set to be the largest against Trump across US - all details",
    "description": "Millions are expected to participate in nationwide 'No Kings' protests on October 18. Organizers anticipate the largest peaceful demonstration in modern American history. This event aims to counter President Donald Trump's administration's actions. Groups lik…",
    "link": "https://economictimes.indiatimes.com/news/international/us/no-kings-protest-on-october-18-peaceful-protests-set-to-be-the-largest-against-trump-across-us-all-details/articleshow/124342271.cms",
    "timestamp": "2025-10-06T15:49:22Z"
  },
  {
    "title": "‘This Is SICK!’ White House Accuses Chicago Mayor of Defending ‘Killers’ and ‘Rapists’ With ‘ICE-Free Zones’",
    "description": "The White House called the move by Chicago Mayor Brandon Johnson “sick” and accusing the mayor of protecting \"killers\" and \"rapists.\"\nThe post ‘This Is SICK!’ White House Accuses Chicago Mayor of Defending ‘Killers’ and ‘Rapists’ With ‘ICE-Free Zones’ first a…",
    "link": "https://www.mediaite.com/media/news/this-is-sick-white-house-accuses-chicago-mayor-of-defending-killers-and-rapists-with-ice-free-zones/",
    "timestamp": "2025-10-06T15:49:12Z"
  },
  {
    "title": "Judge Scolds Trump Admin For Being In 'Direct Contradiction' Of Portland Troops Order",
    "description": "The Trump-appointed judge was not happy the president tried to circumvent her.",
    "link": "https://www.huffpost.com/entry/judge-scolds-trump-admin-for-being-in-direct-contradiction-of-portland-troops-order_n_68e3ca32e4b0b59bd0ef246a",
    "timestamp": "2025-10-06T15:47:14Z"
  },
  {
    "title": "Federal Workers Say Trump Is Trampling Their First Amendment Rights During Shutdown",
    "description": "The administration has used workers' autoreplies to amplify its political message. Employees say it's blatantly illegal.",
    "link": "https://www.huffpost.com/entry/trump-out-of-office-emails-shutdown-lawsuit_n_68e3d275e4b0bfa6f4949e5f",
    "timestamp": "2025-10-06T15:46:20Z"
  },
  {
    "title": "Why This Supreme Court Term Will Be A Blockbuster",
    "description": "The court will consider Trump’s tariffs, LGBTQ conversion therapy, and more.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/10/06/why-this-supreme-court-term-will-be-a-blockbuster/",
    "timestamp": "2025-10-06T15:45:32Z"
  },
  {
    "title": "Stephen Miller’s Own Cousin Calls Him the “Face of Evil”",
    "description": "Stephen Miller’s own cousin called the White House deputy chief of staff “evil” and a disgrace to his family.“I am living with the deep pain of watching someone I once loved become the face of evil,” Alisa Kasmer, Miller’s cousin, wrote in a July Facebook pos…",
    "link": "https://newrepublic.com/post/201387/stephen-miller-cousin-face-of-evil",
    "timestamp": "2025-10-06T15:45:25Z"
  },
  {
    "title": "House Republican Tells Newsmax ‘Our Economy Right Now Is Not Great, The Jobs Report Was Not Great’",
    "description": "Ryan Zinke admitted to Newsmax that the economy isn't doing great under President Donald Trump as the week-long government shutdown drags on.\nThe post House Republican Tells Newsmax ‘Our Economy Right Now Is Not Great, The Jobs Report Was Not Great’ first app…",
    "link": "https://www.mediaite.com/media/news/house-republican-tells-newsmax-our-economy-right-now-is-not-great-the-jobs-report-was-not-great/",
    "timestamp": "2025-10-06T15:44:54Z"
  },
  {
    "title": "Germany's far-right AfD seeks closer ties with Donald Trump and the MAGA movement",
    "description": "Representatives of the far-right Alternative for Germany (AfD) have holding high-profile talks in Washington. Relations with the US had long been a contentious issue within the party.",
    "link": "https://www.dw.com/en/germanys-far-right-afd-seeks-closer-ties-with-donald-trump-and-the-maga-movement/a-74254801",
    "timestamp": "2025-10-06T15:44:00Z"
  },
  {
    "title": "Could Trump end up doing more to revive the two-state solution than Biden?",
    "description": "The U.S. president's plan to end Israel's war in Gaza may be almost comically vague and self-serving, but with unexpected Arab and European backing, it could inadvertently breathe new life into the two-state idea",
    "link": "https://www.haaretz.com/israel-news/2025-10-06/ty-article/.premium/could-trump-end-up-doing-more-to-revive-the-two-state-solution-than-biden/00000199-b92a-d5c1-ad9d-f96baf9a0000",
    "timestamp": "2025-10-06T15:43:53Z"
  },
  {
    "title": "What to know as key talks to end the war in Gaza are set to begin",
    "description": "Tuesday marks two years since the war began.",
    "link": "https://www.bostonherald.com/2025/10/06/gaza-peace-talks-explained/",
    "timestamp": "2025-10-06T15:43:01Z"
  },
  {
    "title": "Trump Says White House UFC Fight Will Take Place On His 80th Birthday",
    "description": "A $45 million military parade was held on the same day for the president’s recent birthday in June.",
    "link": "https://www.huffpost.com/entry/trump-white-house-ufc-fight_n_68e3bfcee4b0bfa6f4948b8a",
    "timestamp": "2025-10-06T15:42:00Z"
  },
  {
    "title": "Freedom’s feisty fighter: Angelo Codevilla’s scrappy rise from penniless immigrant to MAGA guru",
    "description": "At a time of war abroad and political violence at home, a new book called “Fighting Enemies Foreign and Domestic” couldn’t be more relevant. Or could it? This slender volume just published by Encounter Books is all about the life and thought of Angelo Codevil…",
    "link": "https://nypost.com/2025/10/06/opinion/freedoms-feisty-fighter-angelo-codevillas-scrappy-rise-from-penniless-immigrant-to-maga-guru/",
    "timestamp": "2025-10-06T15:40:47Z"
  },
  {
    "title": "Pivotal talks between Israel and Hamas begin in Egypt on eve of second Gaza war anniversary",
    "description": "Israel has continued with airstrikes despite Trump's order to stop.",
    "link": "https://www.pbs.org/newshour/world/pivotal-talks-between-israel-and-hamas-begin-in-egypt-on-eve-of-second-gaza-war-anniversary",
    "timestamp": "2025-10-06T15:40:13Z"
  },
  {
    "title": "Bitcoin, Ethereum, Solana ETFs Surge as Crypto Funds Pull in Record $5.95 Billion",
    "description": "Bitcoin soared to a new peak price over the weekend following a record week for cryptocurrency ETF investments, with nearly $6 billion worth.",
    "link": "https://decrypt.co/343045/bitcoin-ethereum-solana-etfs-surge-crypto-funds-record-5-95-billion",
    "timestamp": "2025-10-06T15:38:55Z"
  },
  {
    "title": "Trump mocks Al Sharpton with old photo of MSNBC host, calls on FCC to look into his show",
    "description": "President Donald Trump urged the FCC to review NBC's license while mocking Rev. Al Sharpton's show ratings and referencing the civil rights activist's past controversies.",
    "link": "https://www.foxnews.com/media/trump-mocks-al-sharpton-old-photo-msnbc-host-calls-fcc-look-his-show",
    "timestamp": "2025-10-06T15:38:35Z"
  },
  {
    "title": "Dem Leader Challenges Mike Johnson to Live, Primetime Debate Over Shutdown",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) on Monday challenged House Speaker Mike Johnson to a primetime TV debate over the government shutdown\nThe post Dem Leader Challenges Mike Johnson to Live, Primetime Debate Over Shutdown first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/dem-leader-challenges-mike-johnson-to-live-primetime-debate-over-shutdown/",
    "timestamp": "2025-10-06T15:38:26Z"
  },
  {
    "title": "The D Brief: Guard deployments on hold; 4th speedboat bombed; Russia strikes Lviv; China’s black-market oil; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/10/the-d-brief-october-06-2025/408615/",
    "timestamp": "2025-10-06T15:37:39Z"
  },
  {
    "title": "What makes this US shutdown different (and more difficult)",
    "description": "Shutdowns fights have become increasingly common but in a polarised Washington, both sides see merit in digging in.",
    "link": "https://www.bbc.com/news/articles/cwydzenj6epo",
    "timestamp": "2025-10-06T15:37:26Z"
  },
  {
    "title": "Israel and Hamas negotiators start mediated talks in Egypt on Trump's Gaza cease-fire plan",
    "description": "A Hamas official said the group will take a 'tough stance' on releasing senior Fatah official Marwan Barghouti and is willing to distance itself from Gaza's governing body; an Israeli source said a key sticking point remains which Palestinian security prisone…",
    "link": "https://www.haaretz.com/israel-news/2025-10-06/ty-article/.premium/israel-hamas-negotiators-begin-talks-on-trumps-gaza-cease-fire-plan-in-egypt/00000199-b9bd-db56-a5db-bdbf96930000",
    "timestamp": "2025-10-06T15:37:12Z"
  },
  {
    "title": "Donald Trump Tells 'Young People of TikTok': You Owe Me Big",
    "description": "President Trump declared in a TikTok video that young people using the platform \"owe\" him for saving the app.",
    "link": "https://biztoc.com/x/ab6ddec1f650fece",
    "timestamp": "2025-10-06T15:36:51Z"
  },
  {
    "title": "Former NATO chief claims Trump threatened to pull US out",
    "description": "Jens Stoltenberg said the bloc was on the verge of dissolving during the American president’s first term Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625995-stoltenberg-trump-quit-nato/",
    "timestamp": "2025-10-06T15:35:08Z"
  },
  {
    "title": "Trump taps longtime investigator to serve as next Justice Department watchdog",
    "description": "President Donald Trump has tapped a career government attorney as the next independent watchdog of the Justice Department",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-taps-longtime-investigator-serve-justice-department-watchdog-126257307",
    "timestamp": "2025-10-06T15:34:32Z"
  },
  {
    "title": "Another Signal scandal? Texts suggest Team Trump eyed 82nd Airborne for Portland",
    "description": "Newly disclosed texts suggest administration officials used Signal (again) to discuss deploying an elite infantry division for use on American soil.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pete-hegseth-signal-scandal-texts-portland-rcna235885",
    "timestamp": "2025-10-06T15:34:08Z"
  },
  {
    "title": "Conservative writer Bari Weiss named editor-in-chief of CBS News",
    "description": "Appointment of media figure known for pro-Israel, anti-'woke' stances comes as US media firms feel Trump pressure.",
    "link": "https://www.aljazeera.com/news/2025/10/6/conservative-writer-bari-weiss-named-editor-in-chief-of-cbs-news",
    "timestamp": "2025-10-06T15:34:00Z"
  },
  {
    "title": "Schumer's shutdown scheme explained: Dems double down on Obamacare credits as standoff drags on",
    "description": "The government shutdown enters its sixth day as Senate Minority Leader Chuck Schumer, D-N.Y., demands a deal on expiring Obamacare tax credits before reopening.",
    "link": "https://www.foxnews.com/politics/schumers-shutdown-scheme-explained-dems-double-down-obamacare-credits-standoff-drags",
    "timestamp": "2025-10-06T15:31:58Z"
  },
  {
    "title": "'They can win this!' Columnist sees way to 'make Trump cave' in shutdown fight",
    "description": "Democratic lawmakers have a strong opportunity to come out on top in the ongoing government shutdown, argued political commentator and columnist Michael Tomasky in an analysis published Monday in The New Republic — but only “if they’re willing to use it.”“If …",
    "link": "https://www.rawstory.com/government-shutdown-2674158236/",
    "timestamp": "2025-10-06T15:30:21Z"
  },
  {
    "title": "Supreme Court declines to hear Ghislaine Maxwell appeal",
    "description": "The US Supreme Court has declined to hear an appeal by Ghislaine Maxwell, the accomplice of notorious sex offender Jeffrey Epstein, of her sex trafficking conviction.",
    "link": "https://www.rte.ie/news/us/2025/1006/1537126-us-supreme-court-maxwell/",
    "timestamp": "2025-10-06T15:29:02Z"
  },
  {
    "title": "Hakeem Jeffries Challenges Speaker Mike Johnson to a Shutdown Debate",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) is challenging Speaker Mike Johnson (R-LA) to a debate on the government shutdown, despite the fact that the Speaker successfully passed a clean continuing resolution (CR), which Democrats rejected.\nThe post Hakeem…",
    "link": "https://www.breitbart.com/politics/2025/10/06/hakeem-jeffries-challenges-speaker-mike-johnson-to-a-shutdown-debate/",
    "timestamp": "2025-10-06T15:28:33Z"
  },
  {
    "title": "Progressive Leadership: How To Have More Impact Under Donald Trump",
    "description": "Despite being under threat from the Trump Administration, progressive lawyers continue to advocate for immigrants, LGBTQ+ communities and other vulnerable people.",
    "link": "https://www.forbes.com/sites/pklein/2025/10/06/progressive-leadership-how-to-have-more-impact-under-donald-trump/",
    "timestamp": "2025-10-06T15:28:20Z"
  },
  {
    "title": "Chicago Mayor Creates ‘ICE-Free Zones’ to Block Raids by ‘Rogue’ Arrest Teams",
    "description": "Johnson signed an executive order establishing “ICE-free zones” and slammed enforcement agents as a “rogue” and “reckless group.”\nThe post Chicago Mayor Creates ‘ICE-Free Zones’ to Block Raids by ‘Rogue’ Arrest Teams first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/chicago-mayor-creates-ice-free-zones-to-block-raids-by-rogue-arrest-teams/",
    "timestamp": "2025-10-06T15:26:48Z"
  },
  {
    "title": "US Supreme Court girds for culture wars with LGBT, guns and race cases",
    "description": "WASHINGTON (Reuters) -The U.S. Supreme Court is set to wade back into the nation's culture wars during its new nine-month term that begins on Monday with a...",
    "link": "https://www.yahoo.com/news/articles/us-supreme-court-girds-culture-152619764.html",
    "timestamp": "2025-10-06T15:26:19Z"
  },
  {
    "title": "Transcript: Democrats Got Something Really Big Done in New Mexico",
    "description": "The following is a lightly edited transcript of the October 3 episode ofRight Now With Perry Bacon. You can watch this interview here. Perry Bacon: I’m honored to be joined today by Michelle Lujan Grisham, the governor of the great state of New Mexico—a beaut…",
    "link": "https://newrepublic.com/article/201364/transcript-democrats-got-something-really-big-done-new-mexico",
    "timestamp": "2025-10-06T15:23:33Z"
  },
  {
    "title": "Army veteran-turned-MAGA rising star jumps into fiery GOP Senate primary as polls tighten",
    "description": "Republican Rep. Wesley Hunt of Texas announces Senate run, joining incumbent Sen. John Cornyn and Attorney General Ken Paxton in heated GOP primary battle.",
    "link": "https://www.foxnews.com/politics/army-veteran-maga-rising-star-jumps-into-fiery-gop-senate-primary-polls-tighten",
    "timestamp": "2025-10-06T15:22:31Z"
  },
  {
    "title": "Indirect talks on ending Gaza war begin in Egypt",
    "description": "Delegations from Hamas and Israel on Oct. 6 began indirect talks in the Egyptian resort town of Sharm El-Sheikh on ending the nearly two-year war in Gaza, Egyptian state-linked media reported.",
    "link": "https://www.hurriyetdailynews.com/indirect-talks-on-ending-gaza-war-begin-in-egypt-214390",
    "timestamp": "2025-10-06T15:21:33Z"
  },
  {
    "title": "President Donald Trump's approval rating by state as of October 2025",
    "description": "President Trump's latest actions, including the handling of the Jeffrey Epstein case and tariffs, are reflected in his approval rating in each state.",
    "link": "https://thelistwire.usatoday.com/story/life/2025/10/06/president-donald-trump-approval-rating-united-states-october/86548333007/",
    "timestamp": "2025-10-06T15:20:59Z"
  },
  {
    "title": "'People Are Being Robbed': Maine's Platner Credited for Showing Democrats How to Win Back Trump Voters",
    "description": "Democratic US Senate candidate Graham Platner over the weekend earned plaudits after he urged compassion to working-class Americans who have been taken in President Donald Trump's false promises.During a town hall event at an American Legion post in Caribou, …",
    "link": "https://www.commondreams.org/news/graham-platner-2674158082",
    "timestamp": "2025-10-06T15:20:58Z"
  },
  {
    "title": "The meme-ification of political violence",
    "description": "Political violence as memes: What the media (and Trump) doesn't understand about the internet-pilled killers of Charlie Kirk and ICE detainees in Dallas.",
    "link": "https://www.msnbc.com/msnbc/news/memeification-political-violence-mass-shooting-rcna235540",
    "timestamp": "2025-10-06T15:19:28Z"
  },
  {
    "title": "‘Every argument has a rational, emotional and rhetorical component’",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-wnba-states-left-ai",
    "timestamp": "2025-10-06T15:19:06Z"
  },
  {
    "title": "GB News’ homophobic slur breached Ofcom code – but channel won’t face any sanctions",
    "description": "The UK’s media regulator will take no action against GB News despite finding the channel breached the broadcasting code by using a homophobic slur. Ofcom concluded the right-wing television channel had breached its Broadcasting Code in January, when presenter…",
    "link": "https://www.thepinknews.com/2025/10/06/gb-news-breach-ofcom/",
    "timestamp": "2025-10-06T15:18:38Z"
  },
  {
    "title": "Supreme Court Rejects Bid to Sue Meta Over Church Shooting",
    "description": "The US Supreme Court declined a chance to open social media companies to lawsuits over content recommended by their algorithms, turning away an appeal that accused Meta Platforms Inc.’s Facebook of radicalizing a man who killed nine South Carolina churchgoers…",
    "link": "https://www.insurancejournal.com/news/national/2025/10/06/842809.htm",
    "timestamp": "2025-10-06T15:18:34Z"
  },
  {
    "title": "A Trump-supporting Rep. claims two Democrat-run cities rack up “about 50 murders a weekend,” numbers wildly at odds with reality.",
    "description": "A MAGA congressman was caught making a gross exaggeration of murder rates in Portland and Chicago as he sought to defend his boss defying the courts to send ...",
    "link": "https://www.thedailybeast.com/maga-lawmaker-makes-wildly-inaccurate-defense-of-donald-trumps-shock-troop-crackdowns-in-portland-and-chicago/",
    "timestamp": "2025-10-06T15:18:28Z"
  },
  {
    "title": "Rep. Wesley Hunt Enters Texas Senate Race, Angering Top Republicans",
    "description": "The close Trump ally’s decision to jump into the bitter Senate primary scrambles the race and threatens the GOP’s ability to hold onto the seat next year.",
    "link": "https://www.huffpost.com/entry/wesley-hunt-texas-senate-cornyn_n_68e3c095e4b0b59bd0ef1c25",
    "timestamp": "2025-10-06T15:17:02Z"
  },
  {
    "title": "Illinois Sues Trump for Putting Americans Under “Threat of Occupation”",
    "description": "The state of Illinois and the city of Chicago sued the Trump administration on Monday over its decision to send hundreds of National Guardsmen into the streets of Chicago. “The American people, regardless of where they reside, should not live under the threat…",
    "link": "https://newrepublic.com/post/201385/illinois-sues-trump-threat-occupation-military-troops",
    "timestamp": "2025-10-06T15:15:00Z"
  },
  {
    "title": "Illinois, Chicago sue to stop Trump from sending National Guard troops to the city",
    "description": "Trump has long threatened to send troops to Chicago.",
    "link": "https://www.bostonherald.com/2025/10/06/national-guard-cities/",
    "timestamp": "2025-10-06T15:14:30Z"
  },
  {
    "title": "Trump and Infantino's bond shapes a 'MAGA' World Cup",
    "description": "",
    "link": "https://biztoc.com/x/907e79bc4d5fcac7",
    "timestamp": "2025-10-06T15:14:08Z"
  },
  {
    "title": "Canada's last hockey stick factory survives in face of tariff threats",
    "description": "Roustan Hockey, Canada's last major wooden hockey stick factory, faces challenges from trade tensions",
    "link": "https://abcnews.go.com/International/wireStory/canadas-hockey-stick-factory-survives-face-tariff-threats-126250504",
    "timestamp": "2025-10-06T15:14:04Z"
  },
  {
    "title": "Lula asks Trump to remove 40% tariff on Brazilian goods",
    "description": "Brazilian President Luiz Inacio Lula da Silva and his United States counterpart Donald Trump held a call on Monday, the former's office said in a statement, adding that the two leaders agreed to meet ...",
    "link": "https://biztoc.com/x/609cfd63e0d21c1c",
    "timestamp": "2025-10-06T15:14:00Z"
  },
  {
    "title": "Kremlin welcomes Trump's comments to extend nuclear arms pact",
    "description": "The Kremlin has welcomed U.S. President Donald Trump’s comments about Russia’s offer to extend the last remaining nuclear arms treaty with the United States, saying it raises hope for keeping the pact alive after it expires in February",
    "link": "https://abcnews.go.com/International/wireStory/kremlin-welcomes-trumps-comments-putins-offer-extend-new-126253222",
    "timestamp": "2025-10-06T15:13:34Z"
  },
  {
    "title": "Trump Reportedly Rips Netanyahu Being ‘F**king Negative’ On Hamas Peace Deal Response: ‘This Is A Win’",
    "description": "Trump reportedly ripped Israeli Prime Minister Benjamin Netanyahu after he poured cold water on a hopeful response from Hamas to Trump's proposed peace deal",
    "link": "https://dailycaller.com/2025/10/06/trump-reportedly-rips-netanyahu-being-fking-negative-on-hamas-peace-deal-response-this-is-a-win/",
    "timestamp": "2025-10-06T15:13:03Z"
  },
  {
    "title": "Israel, Hamas meet in Egypt to revive Trump peace plan ahead of Oct. 7 anniversary",
    "description": "Israel and Hamas delegations convene in Egypt one day before the 2nd anniversary of Hamas terror attacks to negotiate details of President Donald Trump's comprehensive peace proposal.",
    "link": "https://www.foxnews.com/world/israel-hamas-meet-egypt-revive-trump-peace-plan-ahead-oct-7-anniversary",
    "timestamp": "2025-10-06T15:12:33Z"
  },
  {
    "title": "Trump’s Deployment of National Guard to Oregon and Illinois Triggers Legal Chaos",
    "description": "President Donald Trump is trying to deploy National Guard units from California and Texas to Portland and elsewhere in defiance of state leaders and a federal court order.",
    "link": "http://nymag.com/intelligencer/article/trump-national-guard-oregon-illinois-legal-chaos.html",
    "timestamp": "2025-10-06T15:12:32Z"
  },
  {
    "title": "'Demonic': Marjorie Taylor Greene demands English language law before Bad Bunny show",
    "description": "Rep. Marjorie Taylor Greene (R-LA) lashed out at the NFL's decision to have Puerto Rican rapper Bad Bunny perform at the Super Bowl halftime show by calling on Congress to make English the official language of the United States.\"Bad Bunny says America has 4 m…",
    "link": "https://www.rawstory.com/marjorie-taylor-2674158324/",
    "timestamp": "2025-10-06T15:11:10Z"
  },
  {
    "title": "The Judge Standing up to Trump’s Portland Invasion",
    "description": "“Freedom,” wrote George Orwell in Nineteen Eighty-Four, “is the freedom to say two plus two make four. Once that is granted, all else follows.” But what if the test is whether a president can add two and two and get in the neighborhood of four? What if the pr…",
    "link": "http://washingtonmonthly.com/2025/10/06/the-judge-standing-up-to-trumps-portland-invasion/",
    "timestamp": "2025-10-06T15:10:46Z"
  },
  {
    "title": "We Found the 'Enemy from Within' (Jennifer Rubin/The Contrarian)",
    "description": "Jennifer Rubin / The Contrarian:\nWe Found the ‘Enemy from Within’  —  He's in the White House  —  For Donald Trump, the “enemy from within” includes not only undocumented immigrants, drug cartels, foreign terrorists, liberal activists, and the press.  ICE's r…",
    "link": "https://www.memeorandum.com/251006/p65",
    "timestamp": "2025-10-06T15:10:01Z"
  },
  {
    "title": "Stellantis to channel $10bn into US operations amid strategic shift",
    "description": "The funds are anticipated to be distributed over several years and may be directed towards plant enhancements, among others.",
    "link": "https://www.just-auto.com/news/stellantis-us-operations/",
    "timestamp": "2025-10-06T15:09:59Z"
  },
  {
    "title": "Trump's War On Chicago Will Continue Until Chicago Says 'Thank You'!",
    "description": "But has Kristi Noem found a place to take a dump yet?",
    "link": "https://www.wonkette.com/p/trumps-war-on-chicago-will-continue",
    "timestamp": "2025-10-06T15:08:07Z"
  },
  {
    "title": "Trump mulls extending tariff relief for US carmakers",
    "description": "Moreno anticipates that the US President will reach a decision on the matter shortly.",
    "link": "https://www.just-auto.com/news/trump-tariff-us-car-makers/",
    "timestamp": "2025-10-06T15:07:26Z"
  },
  {
    "title": "Trump claims $17 trillion in new US investments. The real number is likely much less",
    "description": "President Donald Trump claims his policies have generated $17 trillion in new investments, but the real number is likely much less. The White House website only lists $8.8 trillion, though even that number appears to be padded with investment commitments made…",
    "link": "https://apnews.com/article/trump-tariffs-investment-trillions-economy-jobs-eb4ca4b9ed632bd12c559c1ec5fd5764",
    "timestamp": "2025-10-06T15:05:53Z"
  },
  {
    "title": "Las Vegas job market drops after tourism slump",
    "description": "Hiring has slowed in America’s casino capital and around the country.",
    "link": "https://www.reviewjournal.com/post/3481977",
    "timestamp": "2025-10-06T15:05:06Z"
  },
  {
    "title": "CBS Is About to Hand Over Its Newsroom to an Anti-Woke Crusader. You Should Be Worried.",
    "description": "She’s made a career railing against “wokeness.” Now she’s in charge of a venerated newsroom.",
    "link": "https://slate.com/technology/2025/10/cbs-news-bari-weiss-the-free-press-woke.html",
    "timestamp": "2025-10-06T15:05:00Z"
  },
  {
    "title": "Portland Anti-ICE Protestors Get Into ‘Tussles’ When They ‘Get Bored,’ The Atlantic Writer Tells MSNBC",
    "description": "Most anti-ICE protestors are getting into \"tussles\" when they simply \"get bored or are looking for something to do,\" The Atlantic's Isaac Stanley-Becker said\nThe post Portland Anti-ICE Protestors Get Into ‘Tussles’ When They ‘Get Bored,’ The Atlantic Writer T…",
    "link": "https://www.mediaite.com/media/portland-anti-ice-protestors-get-into-tussles-when-they-get-bored-the-atlantic-writer-tells-msnbc/",
    "timestamp": "2025-10-06T15:04:47Z"
  },
  {
    "title": "Bitcoin hits new all-time record high",
    "description": "NEW YORK :Bitcoin hit a new record high on Monday as the world's largest cryptocurrency by market value continued to benefit from strong investor demand.The rally since the start of the year has been fueled by institutional investors, friendlier policies unde…",
    "link": "https://www.channelnewsasia.com/business/bitcoin-hits-new-all-time-record-high-5387016",
    "timestamp": "2025-10-06T15:03:50Z"
  },
  {
    "title": "Bitcoin hovers near all-time high",
    "description": "NEW YORK (Reuters) -Bitcoin hovered near its record high on Monday as the world's largest cryptocurrency by market value continued to benefit from strong...",
    "link": "https://finance.yahoo.com/news/bitcoin-hovers-near-time-high-150350216.html",
    "timestamp": "2025-10-06T15:03:50Z"
  },
  {
    "title": "Bitcoin hovers near all-time high",
    "description": "NEW YORK :Bitcoin hovered near its record high on Monday as the world's largest cryptocurrency by market value continued to benefit from strong demand from investors.The rally in bitcoin since the start of the year has been underpinned by flows from instituti…",
    "link": "https://www.channelnewsasia.com/business/bitcoin-hovers-near-all-time-high-5387016",
    "timestamp": "2025-10-06T15:03:50Z"
  },
  {
    "title": "Democrat Amy McGrath launches comeback bid in seeking the seat of retiring Sen. Mitch McConnell",
    "description": "Democrat and retired Marine aviator Amy McGrath has entered the Senate campaign in Kentucky",
    "link": "https://abcnews.go.com/Politics/wireStory/democrat-amy-mcgrath-launches-comeback-bid-seeking-seat-126255829",
    "timestamp": "2025-10-06T15:03:00Z"
  },
  {
    "title": "Pro-Palestine protests are ‘carnivals of hatred’ – UK Conservative leader",
    "description": "British streets have been turned into “theaters of intimidation” by anti-Israel demonstrators, Kemi Badenoch has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625994-uk-palestine-israel-badenoch/",
    "timestamp": "2025-10-06T15:02:44Z"
  },
  {
    "title": "Agency asks for more time to appoint new prosecutor in Georgia election case against Trump",
    "description": "The head of a nonpartisan agency tasked with finding a new prosecutor for the Georgia election interference case against President Donald Trump is asking for more time",
    "link": "https://abcnews.go.com/Politics/wireStory/agency-asks-time-appoint-new-prosecutor-georgia-election-126255689",
    "timestamp": "2025-10-06T15:02:23Z"
  },
  {
    "title": "The Real-Time Demise of American Democracy Under Trump",
    "description": "For generations, Americans have been taught that the United States is the world’s beacon of democracy. Politicians across the spectrum speak of the nation as a “shining city on a hill,” a place where freedom and the rule of law set the standard for the rest o…",
    "link": "https://www.commondreams.org/opinion/demise-us-democracy-trump",
    "timestamp": "2025-10-06T15:01:18Z"
  },
  {
    "title": "Antifa Forcing Homeless Elderly Into Helping Anti-ICE Protesters, Police Say",
    "description": "\"Antifa\" activists have forced elderly homeless people to help them confront law enforcement during anti-ICE protests in Portland, according to local police.",
    "link": "https://dailycaller.com/2025/10/06/antifa-forcing-homeless-elderly-into-helping-anti-ice-protesters-police-say/",
    "timestamp": "2025-10-06T15:00:22Z"
  },
  {
    "title": "For Charlie Kirk, conservatives will knock 500,000 New Jersey doors",
    "description": "“Doors win wars” is more than just a slogan. It’s a proven fact.In Pennsylvania, our Citizens Alliance team executed the largest Republican ballot-chasing program in the country, knocking on more than 510,000 doors in 2024. The public goal was for Donald Trum…",
    "link": "https://www.theblaze.com/columns/opinion/for-charlie-kirk-conservatives-will-knock-500000-new-jersey-doors",
    "timestamp": "2025-10-06T15:00:00Z"
  },
  {
    "title": "Give President Trump Nobel Peace Prize, Israeli hostage families urge",
    "description": "The families of the captives remaining in Gaza called on the Norwegian Nobel Committee on Monday to award President Trump with the Peace Prize over his work to secure a hostage exchange deal.",
    "link": "https://nypost.com/2025/10/06/world-news/give-president-trump-nobel-peace-prize-israeli-hostage-families-urge/",
    "timestamp": "2025-10-06T14:58:23Z"
  },
  {
    "title": "Political Independents And Warning Signs For Trump",
    "description": "We’ve known for some time that Donald Trump has severe weaknesses in the polls on the economy and especially inflation and tariffs.",
    "link": "https://www.forbes.com/sites/bowmanmarsico/2025/10/06/political-independents-and-warning-signs-for-trump/",
    "timestamp": "2025-10-06T14:57:58Z"
  },
  {
    "title": "Zelenskiy Implores Allies to Pay for US Weapons Ahead of Winter",
    "description": "Ukraine is in talks with key donors to pay for another batch of US weapons even as some allies have been dragging their feet over providing financing, President Volodymyr Zelenskiy said.",
    "link": "https://financialpost.com/pmn/business-pmn/zelenskiy-implores-allies-to-pay-for-us-weapons-ahead-of-winter",
    "timestamp": "2025-10-06T14:56:35Z"
  },
  {
    "title": "‘Beyond Disqualifying’: Glenn Youngkin Says Democrat AG Candidate’s Texts Are ‘Where The Violent Left Is’",
    "description": "Republican Gov. Glenn Youngkin of Virginia told Brian Kilmeade he initially thought someone was playing a joke when he heard about violent texts from Jay Jones.",
    "link": "https://dailycaller.com/2025/10/06/glenn-youngkin-dem-ag-candidates-texts-violent-left/",
    "timestamp": "2025-10-06T14:55:07Z"
  },
  {
    "title": "Putin the architect: Russia’s vision for a post-Western world",
    "description": "At Valdai, Moscow laid out not a challenge to the West, but a blueprint for a world of equals – where balance replaces control Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/625985-putin-architect-russia-valdai/",
    "timestamp": "2025-10-06T14:55:05Z"
  },
  {
    "title": "'Tonight the rule of law said 'hell no\" (Politico)",
    "description": "Politico:\n'Tonight the rule of law said 'hell no\"  —  JUDICIAL CLAPBACK — Gavin Newsom took a victory lap Sunday night after a federal judge once again blocked President Donald Trump from sending the National Guard into Oregon — including 300 California troop…",
    "link": "https://www.memeorandum.com/251006/p62",
    "timestamp": "2025-10-06T14:55:00Z"
  },
  {
    "title": "Illinois Sues To Block Trump From Deploying National Guard Troops To Chicago",
    "description": "Illinois filed a lawsuit seeking to block Trump from deploying hundreds of federalized National Guard troops into the streets of Chicago.",
    "link": "https://www.huffpost.com/entry/illinois-chicago-lawsuit-trump-national-guard_n_68e3d77de4b0bfa6f494a2a6",
    "timestamp": "2025-10-06T14:54:41Z"
  },
  {
    "title": "Illinois Sues to Block National Guard Deployment to Chicago Area",
    "description": "Illinois sued the Trump administration over its plan to deploy National Guard troops to the Chicago area, setting off a fresh legal battle over the president’s authority to use soldiers to respond to protests over his immigration crackdown. The lawsuit …",
    "link": "https://www.insurancejournal.com/news/midwest/2025/10/06/842791.htm",
    "timestamp": "2025-10-06T14:54:30Z"
  },
  {
    "title": "Judge Blocks Deployment of National Guard to Portland",
    "description": "A federal judge has blocked President Donald Trump’s move to send National Guard troops to Portland, Oregon.   U.S. District Judge Karin Immergut issued an... Read More\nThe post Judge Blocks Deployment of National Guard to Portland appeared first on The Daily…",
    "link": "https://www.dailysignal.com/2025/10/06/judge-blocks-deployment-national-guard-portland/",
    "timestamp": "2025-10-06T14:54:24Z"
  },
  {
    "title": "Supreme Court Denies Ghislaine Maxwell’s Appeal To Overturn Sex Trafficking Conviction",
    "description": "The Supreme Court has declined to hear Ghislaine Maxwell's case to appeal her sex trafficking and abuse of minors convictions.",
    "link": "https://dailycaller.com/2025/10/06/ghislaine-maxwell-jeffrey-epstein-supreme-court-appeal-sex-trafficking/",
    "timestamp": "2025-10-06T14:54:04Z"
  },
  {
    "title": "Younger Voters Least Likely To Elect Female President But Want More Women In Gov’t, Poll Says",
    "description": "The majority of voters want more women in elected office, according to a new American University poll released on Monday.",
    "link": "https://dailycaller.com/2025/10/06/younger-voters-seek-more-female-representation-in-govt-but-sour-on-president/",
    "timestamp": "2025-10-06T14:52:07Z"
  },
  {
    "title": "Diane Goodstein house burnt to ground in massive blaze: Is MAGA behind the fire at South Carolina judge’s house?",
    "description": "A $1.5 million beachfront home belonging to South Carolina Judge Diane Goodstein was destroyed by a massive fire, sending three family members, including her former-state senator husband, to the hospital. The blaze erupted at her luxury Jeremy Cay residence, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-diane-goodstein-house-burnt-to-ground-in-massive-blaze-is-maga-behind-the-fire-at-south-carolina-judges-house/articleshow/124342904.cms",
    "timestamp": "2025-10-06T14:51:42Z"
  },
  {
    "title": "CBS buys commentary website The Free Press, installs founder Bari Weiss as CBS News editor-in-chief",
    "description": "Some at CBS News have expressed worry that the move will be seen as friendly to President Donald Trump.",
    "link": "https://biztoc.com/x/3b6395ded7e00716",
    "timestamp": "2025-10-06T14:51:33Z"
  }
]