[
  {
    "title": "Vance issues ultimatum to Russia, Ukraine on peace negotiations",
    "description": "Vice President JD Vance warned Russia and Ukraine that the U.S. could \"walk away\" if the two countries do not strike a deal to end the ongoing war.",
    "link": "https://www.foxnews.com/politics/vance-issues-ultimatum-russia-ukraine-peace-negotiations",
    "timestamp": "2025-04-23T12:39:47Z"
  },
  {
    "title": "Richard Branson accuses Trump of ‘doing so much damage’ to the world",
    "description": "Virgin Atlantic founder says ‘erratic’ decisions from US president have been ‘awful for everyone’\nSir Richard Branson has attacked Donald Trump’s policies as “doing so much damage” to the world, adding that he did not believe the US president’s actions were b…",
    "link": "https://biztoc.com/x/381a1c16ed2b69e1",
    "timestamp": "2025-04-23T12:39:03Z"
  },
  {
    "title": "EVs, tariffs in spotlight as Chinese automakers take leading role at Shanghai auto show",
    "description": "Automakers are showcasing new models at the Shanghai auto show, navigating a complex landscape of trade tensions and fierce competition. Chinese manufacturers are gaining ground both domestically and globally, particularly in the electric vehicle sector, whil…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/evs-tariffs-in-spotlight-as-chinese-automakers-take-leading-role-at-shanghai-auto-show/articleshow/120553052.cms",
    "timestamp": "2025-04-23T12:36:12Z"
  },
  {
    "title": "EU seeks to attract American scholars as Trump freezes funds",
    "description": "The European Union is presenting itself as a safe destination for academics facing funding cuts in the US as it tries to atrract top talent with higher grants and freedom for research.",
    "link": "https://www.dw.com/en/eu-seeks-to-attract-american-scholars-as-trump-freezes-funds/a-72311714",
    "timestamp": "2025-04-23T12:35:00Z"
  },
  {
    "title": "‘No Scott!’ CNN’s Abby Phillip Shoots Down Jennings Over Trump’s Assault on Fed Chair",
    "description": "Abby Phillip shot down Scott Jennings for repeating an argument about the influence of President Donald Trump’s attacks on Fed Chair Jerome Powell.\nThe post ‘No Scott!’ CNN’s Abby Phillip Shoots Down Jennings Over Trump’s Assault on Fed Chair first appeared o…",
    "link": "https://www.mediaite.com/news/no-scott-cnns-abby-phillip-shoots-down-jennings-over-trumps-assault-on-fed-chair/",
    "timestamp": "2025-04-23T12:34:50Z"
  },
  {
    "title": "Watch: 'The Office' Star Rainn Wilson Hits Back at MSNBC Host Saying Trump, Musk Created Distrust in Media",
    "description": "Actor Rainn Wilson, who played Dwight Schrute on \"The Office,\" hit back at MSNBC host Stephanie Ruhle saying that Donald Trump, Elon Musk were responsible for American distrust in the media.\nThe post Watch: ‘The Office’ Star Rainn Wilson Hits Back at MSNBC Ho…",
    "link": "https://www.breitbart.com/entertainment/2025/04/23/the-office-star-rainn-wilson-hits-back-at-msnbc-host-saying-trump-musk-created-distrust-in-media/",
    "timestamp": "2025-04-23T12:34:41Z"
  },
  {
    "title": "Josh Shapirio: Trump made 'very gracious' call after antisemitism arson attack",
    "description": "US President calls Jewish governor whose home was targeted in an antisemitic arson attack on the night of the Seder from his private cellphone.",
    "link": "https://www.israelnationalnews.com/news/407272",
    "timestamp": "2025-04-23T12:34:16Z"
  },
  {
    "title": "China Says 'Door Open' To Trade Talks After Trump Signals Tariffs Will Fall",
    "description": "China said on Wednesday the door was \"wide open\" for trade talks with Washington, a day after US President Donald Trump signalled the possibility of a \"substantial\" lowering of tariffs on Beijing.",
    "link": "https://www.ibtimes.com.au/china-says-door-open-trade-talks-after-trump-signals-tariffs-will-fall-1858167",
    "timestamp": "2025-04-23T12:33:57Z"
  },
  {
    "title": "Hegseth Declares Anyone Who Mishandles Government Info Should Be 'Held Accountable' in Resurfaced Clips",
    "description": "As Defense Secretary Pete Hegseth faces mounting scrutiny for sharing military details in group chats, resurfaced comments from his past are drawing accusations of hypocrisy.",
    "link": "https://www.ibtimes.com/hegseth-declares-anyone-who-mishandles-government-info-should-held-accountable-resurfaced-clips-3770982",
    "timestamp": "2025-04-23T12:31:40Z"
  },
  {
    "title": "US State Department To Cut Positions, Rights Offices",
    "description": "President Donald Trump's top diplomat Marco Rubio on Tuesday unveiled a restructuring of the US State Department that will cut positions and scale back human rights offices, saying the \"bloated\" organization was ideologically out of sync with the administrati…",
    "link": "https://www.ibtimes.com.au/us-state-department-cut-positions-rights-offices-1858164",
    "timestamp": "2025-04-23T12:31:39Z"
  },
  {
    "title": "Musk To Reduce White House Role As Tesla Profits Plunge",
    "description": "Elon Musk will significantly scale back his Trump administration work in May to focus on Tesla, the billionaire announced Tuesday as the electric vehicle maker reported a 71 percent drop in first-quarter profits.",
    "link": "https://www.ibtimes.com.au/musk-reduce-white-house-role-tesla-profits-plunge-1858162",
    "timestamp": "2025-04-23T12:31:37Z"
  },
  {
    "title": "Trump Says Has 'No Intention' Of Firing Fed Chief",
    "description": "US President Donald Trump said Tuesday he had no plans to fire the Federal Reserve chief, in apparently conciliatory remarks after berating him and triggering market turmoil.",
    "link": "https://www.ibtimes.com.au/trump-says-has-no-intention-firing-fed-chief-1858160",
    "timestamp": "2025-04-23T12:31:35Z"
  },
  {
    "title": "New Trump Task Force Vows To Root Out 'Anti-Christian Bias'",
    "description": "US Attorney General Pam Bondi hosted the opening meeting of an \"anti-Christian bias\" task force Tuesday, as the government pressed federal workers to inform on work colleagues engaging in discriminatory behavior.",
    "link": "https://www.ibtimes.com.au/new-trump-task-force-vows-root-out-anti-christian-bias-1858158",
    "timestamp": "2025-04-23T12:31:33Z"
  },
  {
    "title": "EU Slaps Fines On Apple And Meta, Risking Trump Fury",
    "description": "The EU on Wednesday slapped Apple and Meta with 700 million euros in fines for breaking digital competition rules, risking the wrath of US President Donald Trump.",
    "link": "https://www.ibtimes.com.au/eu-slaps-fines-apple-meta-risking-trump-fury-1858150",
    "timestamp": "2025-04-23T12:31:25Z"
  },
  {
    "title": "The Trump Administration Is Objectively Pro-Cancer",
    "description": "America used to have the best medical research system in the world. Elon Musk and RFK Jr. are ripping it to shreds.",
    "link": "https://prospect.org/health/2025-04-23-trump-administration-objectively-pro-cancer/",
    "timestamp": "2025-04-23T12:30:31Z"
  },
  {
    "title": "The top producer at '60 Minutes' has quit. He says he can no longer run the show as he always has",
    "description": "With his show involved in a bitter dispute with President Trump, the top executive at \"60 Minutes\" abruptly resigned Tuesday while saying he's losing the freedom to run it independently.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_223ace2e-0931-5778-81ac-fc9746cdee6a.html",
    "timestamp": "2025-04-23T12:30:00Z"
  },
  {
    "title": "The top producer at '60 Minutes' has quit. He says he can no longer run the show as he always has",
    "description": "With his show involved in a bitter dispute with President Trump, the top executive at \"60 Minutes\" abruptly resigned Tuesday while saying he's losing the freedom to run it independently.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_77a2c2b1-49b2-51fd-86fb-e69bffb3b296.html",
    "timestamp": "2025-04-23T12:30:00Z"
  },
  {
    "title": "Who is Jennifer Rauchet? Pete Hegseth's wife who has been embroiled in Signal gate",
    "description": "Jennifer Rauchet, Pete Hegseth's wife and former Fox News producer, faces scrutiny for her involvement in a leaked Signal group chat discussing sensitive military operations. The chat, which included details of impending strikes on Houthi militants, has spark…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-jennifer-rauchet-pete-hegseths-wife-who-has-been-embroiled-in-signal-gate/articleshow/120552621.cms",
    "timestamp": "2025-04-23T12:29:54Z"
  },
  {
    "title": "Apollo Makes $220 Million Bet on Community Solar for Demand Boom",
    "description": "Apollo Global Management Inc. is spending as much as $220 million to form a joint venture with a Vermont-based community solar company to help serve the growing US demand for electricity.",
    "link": "https://financialpost.com/pmn/business-pmn/apollo-makes-220-million-bet-on-community-solar-for-demand-boom",
    "timestamp": "2025-04-23T12:29:32Z"
  },
  {
    "title": "Josh Shapiro Reveals Trump Finally Called Him Following Arson At His Home",
    "description": "The president had not reached out to the Democratic governor in the immediate aftermath of the attack.",
    "link": "https://www.huffpost.com/entry/josh-shapiro-discusses-call-trump_n_6808c309e4b05f43aef2cf52",
    "timestamp": "2025-04-23T12:28:46Z"
  },
  {
    "title": "Dow Jones Jumps 700 Points On Trump Comments; Apple, Nvidia, Tesla Rally",
    "description": "Futures for the Dow Jones Industrial Average and other major stock indexes traded sharply higher Wednesday, as President Donald Trump lowered the rhetorical temperature on the subjects of China trade and Federal Reserve Chairman Jerome Powell. Apple (AAPL) an…",
    "link": "https://biztoc.com/x/c2849eba6d50e86a",
    "timestamp": "2025-04-23T12:28:32Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "In This Article:\nU.S. stock futures are pointing sharply higher after President Donald Trump said that he had \"no intention\" of firing Federal Reserve Chair Jerome Powell and struck a softer tone on China; the European Union (EU) fines Apple (AAPL) and Meta P…",
    "link": "https://biztoc.com/x/cbfd71d4c8c53509",
    "timestamp": "2025-04-23T12:28:12Z"
  },
  {
    "title": "Stock Futures Surge Higher as Trump Eases China, Powell Fears",
    "description": "Updated 51 min ago\nStock Futures Surge Higher as Trump Eases China, Powell Fears\nU.S. stock futures jumped higher early Wednesday as the market looked set to continue its rebound after President Donald Trump eased fears on two fronts–the U.S.-China trade war …",
    "link": "https://biztoc.com/x/f87360efc32e146c",
    "timestamp": "2025-04-23T12:27:57Z"
  },
  {
    "title": "Manhunt under way in Kashmir after deadly attack on tourists",
    "description": "The attack in Indian-administered Kashmir came amid the peak tourist season and prompted global condemnation.",
    "link": "https://www.aljazeera.com/gallery/2025/4/23/india-hunts-gunmen-in-kashmir-tourist-hotspot",
    "timestamp": "2025-04-23T12:27:56Z"
  },
  {
    "title": "Apple and Meta Hit With $800 Million in Fines From European Union",
    "description": "Apple and Meta have been ordered to pay a combined Euros 700 million ($799 million) in fines by the European Union, the first issued by antitrust regulators under new sanctions brought in to curtail the dominance of Big Tech. Apple was issued with a Euros 500…",
    "link": "https://variety.com/2025/biz/global/apple-meta-fines-european-union-1236375787/",
    "timestamp": "2025-04-23T12:27:19Z"
  },
  {
    "title": "Trump blinks — and stocks come roaring back",
    "description": "U.S. stocks were surging into the green on Wednesday morning after President Donald Trump backed off his threat to fire Federal Reserve Chair Jerome Powell — at least for now. Read more...",
    "link": "https://qz.com/s-p-500-nasdaq-dow-ba-tsla-pm-futures-april-23-1851777424",
    "timestamp": "2025-04-23T12:27:00Z"
  },
  {
    "title": "Netflix’s ‘Tiger King’ Marries Fellow Prison Inmate",
    "description": "Netflix star Joe Exotic is a married man again after marrying fellow inmate Jorge. Joe announced the news via his account on X, formerly Twitter. “Never been more proud of someone,” Joe wrote on X. “Meet my husband Jorge Flores Maldonado.” Never been more pro…",
    "link": "https://mediatakeout.com/netflixs-tiger-king-marries-fellow-prison-inmate/",
    "timestamp": "2025-04-23T12:22:52Z"
  },
  {
    "title": "Meta, Apple fined 700 million euros for violating EU antitrust rules",
    "description": "LONDON (Reuters) -European Union regulators on Wednesday imposed fines on Apple and Meta totalling 700 million euros ($877 million) for violating new...",
    "link": "https://finance.yahoo.com/news/meta-apple-fined-700-million-122246763.html",
    "timestamp": "2025-04-23T12:22:46Z"
  },
  {
    "title": "Meta, Apple fined 700 million euros for violating EU antitrust rules",
    "description": "LONDON :European Union regulators on Wednesday imposed fines on Apple and Meta totalling 700 million euros ($877 million) for violating new antitrust rules, the first sanctions under landmark legislation aimed at curbing Big Tech's power.Here is some reaction…",
    "link": "https://www.channelnewsasia.com/business/meta-apple-fined-700-million-euros-violating-eu-antitrust-rules-5083811",
    "timestamp": "2025-04-23T12:22:46Z"
  },
  {
    "title": "US Stock Market Futures Surge – Dow, S&P 500, and Nasdaq soar as Trump softens stance on Jerome Powell and eases China tariffs",
    "description": "US stock market futures surged early Wednesday after Donald Trump softened his tone towards Jerome Powell and hinted at easing China tariffs. This shift boosted investor confidence, lifting major stock indices. Dow futures soared 683 points, S&P 500 rose 2.3%…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-futures-surge-dow-sp-500-and-nasdaq-soar-as-trump-softens-stance-on-jerome-powell-and-eases-china-tariffs/articleshow/120552231.cms",
    "timestamp": "2025-04-23T12:20:57Z"
  },
  {
    "title": "Bitcoin Surpasses $90,000 as Investors Seek Alternatives Amid Market Volatility",
    "description": "Bitcoin reclaimed the $90,000 mark for the first time since March 2025.",
    "link": "https://finance.yahoo.com/news/bitcoin-surpasses-90-000-investors-122012216.html",
    "timestamp": "2025-04-23T12:20:12Z"
  },
  {
    "title": "'Risky gamble': Trump administration is waging a behind-the-scenes war on children",
    "description": "ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox.\n\nThe clear-cutting across the federal government under President Donald Trump has been dramatic with mass termi…",
    "link": "https://www.rawstory.com/risky-gamble-trump-administration-is-waging-a-behind-the-scenes-war-on-children/",
    "timestamp": "2025-04-23T12:19:45Z"
  },
  {
    "title": "European Union fines Apple €500 million and Meta €200 million in separate digital cases",
    "description": "The commission, which is the EU's executive arm, also fined Meta Platforms 200 million euros because it forced Facebook and Instagram users to choose between seeing personalised ads or paying to avoid them.",
    "link": "https://economictimes.indiatimes.com/tech/technology/european-union-fines-apple-500-million-and-meta-200-million-in-separate-digital-cases/articleshow/120552387.cms",
    "timestamp": "2025-04-23T12:19:19Z"
  },
  {
    "title": "Elon Musk says he'll do less DOGE — and Tesla stock pops 7%",
    "description": "Tesla (TSLA) CEO Elon Musk said late Tuesday that he would take a big step back from his work leading the Department of Government Efficiency, cheering investors who have worried he is distracted and sending the stock up despite a brutal quarterly earnings re…",
    "link": "https://qz.com/tesla-stock-earnings-elon-musk-doge-trump-1851777425",
    "timestamp": "2025-04-23T12:18:00Z"
  },
  {
    "title": "Elon Musk says he'll do less DOGE — and Tesla stock pops 7%",
    "description": "Tesla (TSLA) CEO Elon Musk said late Tuesday that he would take a big step back from his work leading the Department of Government Efficiency, cheering...",
    "link": "https://finance.yahoo.com/news/elon-musk-says-hell-less-121800568.html",
    "timestamp": "2025-04-23T12:18:00Z"
  },
  {
    "title": "I Just Got Into Harvard. My MAGA Grandparents’ 6-Word Reaction To My Acceptance Devastated Me.",
    "description": "“This was the first time in my life that I had ever truly gotten mad at my grandparents.”",
    "link": "https://www.huffpost.com/entry/harvard-acceptance-maga-grandparents-response_n_6806a994e4b052543c13a41a",
    "timestamp": "2025-04-23T12:17:40Z"
  },
  {
    "title": "Swiss chocolate maker Lindt temporarily increases stocks in Canada to cushion impact of tariffs",
    "description": "Swiss chocolate maker Lindt & Spruengli said it is still working out how to deal with the escalating trade war launched by U.S. President Donald Trump and has temporarily increased stocks in Canada to cushion the impact of tariffs.\nThe company said in March i…",
    "link": "https://biztoc.com/x/fdbde08e62324478",
    "timestamp": "2025-04-23T12:17:03Z"
  },
  {
    "title": "'We won't survive': Thai rice farmers brace for tariff impact",
    "description": "The Thai rice sector worries tariffs unleashed by U.S. President Donald Trump could slash demand for Thai rice in its most valuable foreign market and create turmoil in an export industry worth billions of dollars. - REUTERS",
    "link": "https://www.bangkokpost.com/video/world/3009710",
    "timestamp": "2025-04-23T12:17:00Z"
  },
  {
    "title": "Posthaste: Holes emerge in Trump’s plan to bring back manufacturing",
    "description": "United States President Donald Trump\n \n \n \n \n \n aims to bring manufacturing back to the U.S. and with it the good old days of American factory towns, but the country might not have enough workers or the appetite for a return to the assembly lines. \n \n \n \n \n \n…",
    "link": "https://biztoc.com/x/5ea0d24fa50a51ca",
    "timestamp": "2025-04-23T12:16:38Z"
  },
  {
    "title": "European Union Slaps Apple and Meta With Hundreds of Millions in Fines",
    "description": "European Union watchdogs fined Apple and Meta hundreds of millions of euros Wednesday as they stepped up enforcement of the 27-nation bloc's digital competition rules.\nThe post European Union Slaps Apple and Meta With Hundreds of Millions in Fines appeared fi…",
    "link": "https://www.breitbart.com/europe/2025/04/23/eu-slaps-apple-and-meta-with-hundreds-of-millions-in-fines-in-digital-competition-cases/",
    "timestamp": "2025-04-23T12:15:42Z"
  },
  {
    "title": "MAHA at Work: FDA to Ban All Artificial Food Dyes from Food Products",
    "description": "The FDA's groundbreaking decision to ban artificial food dyes highlights significant health concerns linked to these additives, reflecting a pivotal moment in food safety policy. Insights and implications await in the full analysis.\nThe post MAHA at Work: FDA…",
    "link": "https://gatewayhispanic.com/video/fda-to-ban-artificial-food-dyes-linked-to-disease/",
    "timestamp": "2025-04-23T12:15:31Z"
  },
  {
    "title": "Elon Musk steps back from Trump administration: What will happen to DOGE? Here's what to expect",
    "description": "Tesla shareholders are pressuring Elon Musk to resign from his government position at the Department of Government Efficiency (DOGE) and fully dedicate himself to the EV maker. This comes as Tesla's profits plummeted by 71% in the first quarter of 2025. Musk …",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-steps-back-from-trump-administration-what-will-happen-to-doge-heres-what-to-expect/articleshow/120551754.cms",
    "timestamp": "2025-04-23T12:14:15Z"
  },
  {
    "title": "Abby Phillip Hilariously Tries For Straight Answer Out Of Squirrelly Scott Jennings",
    "description": "\"I'm going to give you a third try on this one,\" the CNN host said to the GOP pundit as they sparred over Trump.",
    "link": "https://www.huffpost.com/entry/abby-phillip-scott-jennings-cnn-federal-reserve_n_6808bb4de4b05f43aef2c45b",
    "timestamp": "2025-04-23T12:12:15Z"
  },
  {
    "title": "Orders to leave the country — some for US citizen — sow confusion among immigrants",
    "description": "U.S. Customs and Border Protection is quietly revoking permits of people who used CBP One. But some notices are reaching U.S. citizens.",
    "link": "https://www.bostonherald.com/2025/04/23/immigration-online-app-confusion/",
    "timestamp": "2025-04-23T12:11:39Z"
  },
  {
    "title": "Orders to leave the country — some for US citizens — sow confusion among immigrants",
    "description": "U.S. Customs and Border Protection is quietly revoking permits of people who used CBP One. But some notices are reaching U.S. citizens.",
    "link": "https://www.denverpost.com/2025/04/23/immigration-online-app-confusion/",
    "timestamp": "2025-04-23T12:11:39Z"
  },
  {
    "title": "Trump’s Drive to Undermine Our Progress on Clean Transportation Will Erode Our Health",
    "description": "Picture this: You’re a kid in New York City living in the South Bronx and you have asthma. While friends go outside to play, you stay behind, worried that an asthma attack could send you to the hospital. Your neighborhood is surrounded by three highways and f…",
    "link": "https://www.commondreams.org/opinion/trump-clean-transit",
    "timestamp": "2025-04-23T12:09:03Z"
  },
  {
    "title": "Harsh Goenka reveals what his wife’s gold is worth today — and a lesson for those who prefer phones and cars",
    "description": "Industrialist Harsh Goenka's anecdote highlights gold's enduring value amid economic uncertainty, contrasting its appreciation with depreciating assets like cars and phones. His wife's investment in gold significantly outperformed his purchases over the past …",
    "link": "https://economictimes.indiatimes.com/news/new-updates/gold-lasts-5-generations-harsh-goenka-shares-timeless-lesson-on-value-of-assets-like-gold-vs-phones-and-cars/articleshow/120552103.cms",
    "timestamp": "2025-04-23T12:07:03Z"
  },
  {
    "title": "Stocks storming ahead this morning after Trump said he plans to be 'very nice' to China",
    "description": "President \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n said he plans to be “very nice” to \n \n \n \n \n \n China in any trade talks\n \n \n \n \n \n and that \n \n \n \n \n \n tariffs will drop\n \n \n \n \n \n if the two countries can reach a deal, a sign he may be backing down from his to…",
    "link": "https://biztoc.com/x/13493042a4d710ab",
    "timestamp": "2025-04-23T12:06:05Z"
  },
  {
    "title": "Elon Musk vows to spend less time in DC after Tesla’s profits drop 71%",
    "description": "Some of the most visible and successful protests of 2025 have been the organized demonstrations and disinvestments from all things Elon Musk and Tesla. Since Musk accepted his position at the newly-formed DOGE in the Trump administration, people around the wo…",
    "link": "https://www.celebitchy.com/919024/elon_musk_vows_to_spend_less_time_in_dc_after_teslas_profits_drop_71/",
    "timestamp": "2025-04-23T12:05:50Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "News of the day for April 23, 2025",
    "link": "https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-april-23-2025-11720294",
    "timestamp": "2025-04-23T12:05:19Z"
  },
  {
    "title": "XRP price targets $3.00 as Trump’s Fed stance fuels crypto rally",
    "description": "Open interest jumps 20% to $3.89B in 24 hours. RSI climbs to 58, signalling bullish momentum. Risk remains if XRP loses $2.00 key support level. Ripple’s XRP is gaining traction again, climbing steadily above the $2.00 mark after a volatile start to April. As…",
    "link": "https://coinjournal.net/news/xrp-price-targets-3-00-as-trumps-fed-stance-fuels-crypto-rally/",
    "timestamp": "2025-04-23T12:05:15Z"
  },
  {
    "title": "Federal judge alleges 'willful and bad faith refusal' to comply in Abrego Garcia deportation case",
    "description": "A federal judge in Maryland said the Trump administration is ignoring orders and acting in \"bad faith\" on Kilmar Abrego Garcia's return from El Salvador.",
    "link": "https://www.foxnews.com/politics/federal-judge-alleges-willful-bad-faith-refusal-comply-abrego-garcia-deportation-case",
    "timestamp": "2025-04-23T12:04:45Z"
  },
  {
    "title": "Stocks roar higher after Trump’s reversal on Jerome Powell, following advisers’ warnings",
    "description": "President Donald Trump’s recent attacks on Federal Reserve Chair Jerome Powell caused alarm among some of his top advisers, who warned him that any attempt to remove the head of the central bank could cause as much market turmoil as his ongoing trade war, acc…",
    "link": "https://www.cnn.com/2025/04/23/business/stock-market-dow-jerome-powell-fed-trump/index.html",
    "timestamp": "2025-04-23T12:01:01Z"
  },
  {
    "title": "Canadian hockey fans travel to U.S. with mixed feelings to support NHL teams",
    "description": "Mark Jarry has cut as many American goods as possible from his personal spending. The Montrealer also stopped taking regular trips south of the Canadian border after U.S. President Donald Trump threatened to make Canada the 51st state. That changed when Jarry…",
    "link": "https://www.cbc.ca/sports/hockey/nhl/canadian-hockey-fans-travel-to-u-s-with-mixed-feelings-to-support-nhl-teams-1.7516155",
    "timestamp": "2025-04-23T12:00:36Z"
  },
  {
    "title": "Wiz Khalifa Outs Himself As Flat Earth Conspiracy Theorist",
    "description": "Wiz Khalifa has revealed that he believes in the widely debunked conspiracy theory that planet Earth is in fact flat and not round.",
    "link": "https://hiphopdx.com/news/wiz-khalifa-outs-himself-as-flat-earth-conspiracy-theorist",
    "timestamp": "2025-04-23T12:00:36Z"
  },
  {
    "title": "Live updates: The latest on Trump’s presidency | CNN Politics",
    "description": "President Donald Trump is forging ahead with both his domestic and foreign agendas, even as he signals a potential U-turn on his trade war with China amid ongoing market volatility. Follow here for the latest live news updates.",
    "link": "https://www.cnn.com/politics/live-news/trump-presidency-news-04-23-25/index.html",
    "timestamp": "2025-04-23T12:00:32Z"
  },
  {
    "title": "Posthaste: Holes emerge in Trump’s plan to bring back manufacturing",
    "description": "As U.S. President Donald Trump aims to bring manufacturing back to the U.S., the country might not have the workers for it. Read more.",
    "link": "https://financialpost.com/news/holes-emerge-trump-plan-bring-back-manufacturing",
    "timestamp": "2025-04-23T12:00:22Z"
  },
  {
    "title": "Is REAL ID really necessary? What authorities are saying",
    "description": "The Trump administration is set to enforce a law requiring Americans to obtain REAL IDs starting on May 7, 2025, after the requirement was delayed for two decades.",
    "link": "https://www.foxnews.com/politics/real-id-really-necessary-what-authorities-saying",
    "timestamp": "2025-04-23T12:00:17Z"
  },
  {
    "title": "Day 1,155 of WW3. Even the Swiss are tired of Kremlin propaganda, joining EU sanctions on orc media outlets. Ukraine asks for an end to attacks on civilian targets, so Moscow attacks a bus full of civilians. This is your Wednesday Ukraine War thread [News]",
    "description": "Day 1,155 of WW3. Even the Swiss are tired of Kremlin propaganda, joining EU sanctions on orc media outlets. Ukraine asks for an end to attacks on civilian targets, so Moscow attacks a bus full of civilians. This is your Wednesday Ukraine War thread",
    "link": "https://www.fark.com/comments/13644656/Day-1155-of-WW3-Even-Swiss-are-tired-of-Kremlin-propaganda-joining-EU-sanctions-on-orc-media-outlets-Ukraine-asks-for-an-end-to-attacks-on-civilian-targets-so-Moscow-attacks-a-bus-full-of-civilians-This-is-your-Wednesday-Ukraine-War-thread",
    "timestamp": "2025-04-23T12:00:00Z"
  },
  {
    "title": "Jackson Lahmeyer Says Biden's Presidency Was 'God's Judgment Upon Our Nation'",
    "description": "MAGA pastor Jackson Lahmeyer declares that Joe Biden was a \"wicked ruler\" and \"an instrument of God's judgment upon our nation.\"",
    "link": "https://www.peoplefor.org/rightwingwatch/jackson-lahmeyer-says-bidens-presidency-was-gods-judgment-upon-our-nation",
    "timestamp": "2025-04-23T12:00:00Z"
  },
  {
    "title": "Suspend Habeas Corpus",
    "description": "<ul>\n<li>MAGA Influencers And Conspiracy Theorists</li>\n<li>Pleading For An Exemption</li>\n<li>Wrongly Detained</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/suspend-habeas-corpus",
    "timestamp": "2025-04-23T12:00:00Z"
  },
  {
    "title": "Forbes Daily: Elon Musk To Step Back From DOGE As Tesla Takes A Hit",
    "description": "Today’s Forbes Daily newsletter covers possible trade war deescalation, a brewing police tech rivalry, White House to go after student loan borrowers' wages and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/04/23/forbes-daily-elon-musk-to-step-back-from-doge-as-tesla-takes-a-hit/",
    "timestamp": "2025-04-23T11:59:22Z"
  },
  {
    "title": "Foreign Leader Says His US Visa Has Been Revoked, Rages Against Trump",
    "description": "Colombian President Gustavo Petro claimed President Donald Trump's administration had taken away his visa to travel to the United States.",
    "link": "https://www.westernjournal.com/foreign-leader-says-us-visa-revoked-rages-trump/",
    "timestamp": "2025-04-23T11:58:41Z"
  },
  {
    "title": "Is it the right time to invest in PepeX as meme coins rocket?",
    "description": "The meme coin sector saw substantial growth, with meme coin market capitalization climbing to $58.5 billion. This momentum has also lifted sentiment around early-stage projects like PepeX. PepeX is positioning itself as a next-gen meme coin launchpad. Top mem…",
    "link": "https://coinjournal.net/news/is-it-the-right-time-to-invest-in-pepex-as-meme-coins-rocket/",
    "timestamp": "2025-04-23T11:56:28Z"
  },
  {
    "title": "Katy Perry receives massive blow after facing backlash for her Blue Origin Space mission",
    "description": "Katy Perry received a massive blow as the singer delivered a heartbreaking news days after her Blue Origin space flight. Katy Perry returned to Earth last week after reaching space aboard Amazon founder Jeff Bezos's Blue Origin New Shepard rocket but she has …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-katy-perry-shows-cancelled-mexico-receives-massive-blow-after-facing-backlash-for-her-blue-origin-space-mission/articleshow/120551777.cms",
    "timestamp": "2025-04-23T11:55:33Z"
  },
  {
    "title": "U.S. auto industry warns new auto parts tariffs will hike prices, cut sales",
    "description": "A coalition of U.S. auto industry groups on Tuesday urged President Donald Trump not to impose 25 per cent tariffs on imported auto parts, warning they would cut vehicle sales and raise prices.",
    "link": "https://biztoc.com/x/468ddd706039e9e0",
    "timestamp": "2025-04-23T11:54:30Z"
  },
  {
    "title": "Stocks storming ahead this morning after Trump said he plans to be ‘very nice’ to China",
    "description": "Donald Trump said tariffs will drop if the U.S. and China can reach a deal, a sign he may be backing down from his tough stance. Read on",
    "link": "https://financialpost.com/news/economy/stocks-soar-trump-eases-china-fears",
    "timestamp": "2025-04-23T11:54:19Z"
  },
  {
    "title": "Trump Is No Peace President. Call Him the Proliferation President",
    "description": "Much to my astonishment, some voters thought Donald Trump might be a “peace president.” I never bought it, so won’t outline the case for such magical thinking here, but his major increase already excessive U.S. weapons transfers to Israel as it continues its …",
    "link": "https://www.commondreams.org/opinion/trump-peace-president",
    "timestamp": "2025-04-23T11:54:03Z"
  },
  {
    "title": "EU slaps Meta, Apple with nearly $800m fines",
    "description": "The penalties are the first to be issued under the bloc’s Digital Markets Act.",
    "link": "https://www.aljazeera.com/news/2025/4/23/eu-slaps-meta-and-apple-with-a-combined-700-million-euros-fine",
    "timestamp": "2025-04-23T11:52:13Z"
  },
  {
    "title": "London talks on ending Russia-Ukraine war pared down as Vance says it’s decision time on peace deal",
    "description": "\"It’s time for them to either say yes or for the United States to walk away from this process,\" said Vance.",
    "link": "https://www.bostonherald.com/2025/04/23/russia-ukraine-vance-peace-deal/",
    "timestamp": "2025-04-23T11:52:12Z"
  },
  {
    "title": "Exclusive-Putin's central banker Nabiullina will serve until 2027 despite attacks, sources say",
    "description": "MOSCOW (Reuters) - Russian central bank chief Elvira Nabiullina is safe in her job for two more years with President Vladimir Putin's personal support but the Kremlin will face a succession dilemma when her record tenure ends in 2027, two senior sources told …",
    "link": "https://www.thestar.com.my/news/world/2025/04/23/exclusive-putin039s-central-banker-nabiullina-will-serve-until-2027-despite-attacks-sources-say",
    "timestamp": "2025-04-23T11:51:00Z"
  },
  {
    "title": "As Trump's EPA ends 'environmental justice,' minority communities may pay a price",
    "description": "The Trump administration withdrew a lawsuit against a Louisiana chloroprene-emitting plant, raising concerns in the predominantly Black community nearby. Simultaneously, EPA's environmental justice and DEI programs faced cuts, sparking criticism over potentia…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/as-trumps-epa-ends-environmental-justice-minority-communities-may-pay-a-price/articleshow/120551817.cms",
    "timestamp": "2025-04-23T11:49:01Z"
  },
  {
    "title": "Rupee logs worst day in 2 weeks on dollar strength, position unwinding",
    "description": "The Indian rupee logged its steepest fall in two weeks, pressured by a recovery in the U.S. dollar index and as traders unwound long positions on the local unit after it failed to climb above a key level.",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-logs-worst-day-in-2-weeks-on-dollar-strength-position-unwinding/articleshow/120551794.cms",
    "timestamp": "2025-04-23T11:48:08Z"
  },
  {
    "title": "NYT Goes Full 'Trump Is Hitler' Then Gaslights Us Over It",
    "description": "<p>It's gaslighting for The New York Times to try to paint Larry David's essay as anything but one that equates Donald Trump with Adolf Hitler.</p>",
    "link": "https://www.realclearpolitics.com/2025/04/23/nyt_goes_full_trump_is_hitler_then_gaslights_us_over_it_645276.html",
    "timestamp": "2025-04-23T11:46:59Z"
  },
  {
    "title": "Trump Admin Ramps Up Bid To Eliminate 'Anti-Christian Bias'",
    "description": "The White House in February established the Task Force to Eradicate Anti-Christian Bias and the VA has now reportedly established its own similar task force.",
    "link": "https://www.newsweek.com/trump-anti-christian-bias-taskforce-va-2062909",
    "timestamp": "2025-04-23T11:46:08Z"
  },
  {
    "title": "The U.S. Should Not Sell Weapons to Turkey | Opinion",
    "description": "Only pressure on Turkey will push it to become the ally that America expects it to be.",
    "link": "https://www.newsweek.com/us-should-not-sell-weapons-turkey-opinion-2062789",
    "timestamp": "2025-04-23T11:45:01Z"
  },
  {
    "title": "Oil Rises on Iran Sanctions, Trump's Softer Tone",
    "description": "12 min ago\nOil Rises on Iran Sanctions, Trump's Softer Tone\nOil prices were rising for a second consecutive day after the U.S. widened sanctions on Iran and President Donald Trump softened his tone on both China and the Federal Reserve.\nBrent crude and WTI we…",
    "link": "https://biztoc.com/x/2605dc7c780f7ed9",
    "timestamp": "2025-04-23T11:44:00Z"
  },
  {
    "title": "US-Europe talks to end Ukraine war downgraded as Rubio cancels London trip",
    "description": "Talks between the U.S., Ukraine and European officials to discuss ending Russia's war in Ukraine faltered on Wednesday as U.S. Secretary of State Marco Rubio abruptly canceled his trip to London and negotiations were downgraded.",
    "link": "https://nypost.com/2025/04/23/world-news/us-europe-talks-to-end-ukraine-war-downgraded-as-rubio-cancels-london-trip/",
    "timestamp": "2025-04-23T11:43:37Z"
  },
  {
    "title": "Bishops ‘have got to be fired’: The Maga Catholics trying to take back control of the church",
    "description": "Growing number of Americans hope Pope Francis’s death will mark a decisive conservative shift for the papacy",
    "link": "https://www.irishtimes.com/world/europe/2025/04/23/bishops-have-got-to-be-fired-the-maga-catholics-trying-to-take-back-control-of-the-church/",
    "timestamp": "2025-04-23T11:41:55Z"
  },
  {
    "title": "US judge blocks Trump’s Voice of America funding cut",
    "description": "The US president previously described the US media arm as biased and an unnecessary burden on American taxpayers Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616147-us-judge-trump-voa/",
    "timestamp": "2025-04-23T11:41:21Z"
  },
  {
    "title": "Veteran Chinese astronaut to lead fresh crew to space station",
    "description": "Jiuquan, China (AFP) April 23, 2025\n\n\n China announced on Wednesday that a veteran astronaut will lead two crew members on their first flight to the Tiangong space station, the latest milestone in its race to send a manned mission to the Moon by 2030. \n\nThe S…",
    "link": "https://www.spacedaily.com/reports/Veteran_Chinese_astronaut_to_lead_fresh_crew_to_space_station_999.html",
    "timestamp": "2025-04-23T11:40:50Z"
  },
  {
    "title": "The U.S. cannot confront China alone, former Deputy Secretary of State warns",
    "description": "Washington DC (UPI) Apr 23, 2025 \n\n\n The United States must strengthen its alliances with global partners, particularly South Korea and Japan, to face the rising challenge posed by China, the former chief architect of White House strategy on Asia said Wednesd…",
    "link": "https://www.spacewar.com/reports/The_US_cannot_confront_China_alone_former_Deputy_Secretary_of_State_warns_999.html",
    "timestamp": "2025-04-23T11:40:50Z"
  },
  {
    "title": "Iran slams US sanctions as 'hostile' ahead of new round of talks",
    "description": "Tehran (AFP) April 23, 2025\n\n Iran's foreign ministry on Wednesday condemned new US sanctions targeting its oil network, calling the move a sign of Washington's \"hostile approach\" ahead of a third round of nuclear talks. \n\nIn a statement, foreign ministry spo…",
    "link": "https://www.spacewar.com/reports/Iran_slams_US_sanctions_as_hostile_ahead_of_new_round_of_talks_999.html",
    "timestamp": "2025-04-23T11:40:50Z"
  },
  {
    "title": "Iran top diplomat in China to discuss nuclear talks",
    "description": "Beijing (AFP) April 23, 2025\n\n\n Iranian Foreign Minister Abbas Araghchi was visiting China on Wednesday for consultations ahead of a new round of nuclear talks with the United States. \n\nIran and the United States are set to meet in Oman on Saturday for a thir…",
    "link": "https://www.spacewar.com/reports/Iran_top_diplomat_in_China_to_discuss_nuclear_talks_999.html",
    "timestamp": "2025-04-23T11:40:50Z"
  },
  {
    "title": "India hunts gunmen who killed 26 in Kashmir tourist hotspot",
    "description": "Pahalgam (AFP) April 23, 2025\n\n\n Indian security forces in Kashmir were conducting a major manhunt on Wednesday, a day after gunmen opened fire on tourists and killed 26 people in the region's worst attack on civilians in a quarter of a century. \n\nPrime Minis…",
    "link": "https://www.spacewar.com/reports/India_hunts_gunmen_who_killed_26_in_Kashmir_tourist_hotspot_999.html",
    "timestamp": "2025-04-23T11:40:50Z"
  },
  {
    "title": "Vladimir Putin says he's open to holding direct, 'limited', cease-fire talks with Ukraine",
    "description": "Washington DC (UPI) Apr 22, 2025 \n\n\n Russian President Vladimir Putin on Tuesday held out the prospect of direct peace talks with Ukraine for the first time since the early days of the war amid mounting pressure on both Moscow and Kyiv from the United States …",
    "link": "https://www.spacewar.com/reports/Vladimir_Putin_says_hes_open_to_holding_direct_limited_cease-fire_talks_with_Ukraine_999.html",
    "timestamp": "2025-04-23T11:40:50Z"
  },
  {
    "title": "French FM says Iraq should not be dragged into regional conflicts",
    "description": "Baghdad (AFP) April 23, 2025\n\n\n France's Foreign Minister said on Wednesday that Iraq should not be pulled into conflicts in a turbulent Middle East during his first visit to the country, which has suffered from decades of instability. \n\nJean-Noel Barrot will…",
    "link": "https://www.spacewar.com/reports/French_FM_says_Iraq_should_not_be_dragged_into_regional_conflicts_999.html",
    "timestamp": "2025-04-23T11:40:50Z"
  },
  {
    "title": "CartelFi price to jump soon: should you invest now?",
    "description": "CartelFi’s presale has surpassed $1 million in early contributions, signaling growing interest. The token currently trades at $0.0352, with less than two days remaining before the next price hike. CartelFi’s value proposition centers on activating dormant mem…",
    "link": "https://coinjournal.net/news/cartelfi-price-to-jump-soon-should-you-invest-now/",
    "timestamp": "2025-04-23T11:40:33Z"
  },
  {
    "title": "The European Union fines Apple 500 million euros and Meta 200 million in separate digital cases",
    "description": "An EU commission fined Apple and Meta hundreds of millions as they stepped up enforcement of digital competition rules.",
    "link": "https://www.bostonherald.com/2025/04/23/europe-apple-meta-fines/",
    "timestamp": "2025-04-23T11:39:10Z"
  },
  {
    "title": "Vance’s peace call on Ukraine not an ultimatum – Kremlin",
    "description": "The Kremlin has downplayed remarks by US Vice President J.D. Vance urging an immediate truce between Ukraine and Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616145-kremlin-vance-ultimatum-ukraine/",
    "timestamp": "2025-04-23T11:36:03Z"
  },
  {
    "title": "White House says Trump has no plans to fire Pete Hegseth",
    "description": "President Donald Trump is standing by his embattled Secretary of Defense, Pete Hegseth, and brushing off concerns even as new details are emerging about the military information Hegseth shared in a second group chat on Signal that included his family and frie…",
    "link": "https://www.today.com/video/trump-stands-by-embattled-hegseth-amid-signal-app-controversy-238150213885",
    "timestamp": "2025-04-23T11:35:24Z"
  },
  {
    "title": "Trump Store Touts ‘Presidential Gold Note’ As Tariffs Rattle Markets And Gold Prices Soar",
    "description": "The $47 note contains about $11 worth of gold.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/04/23/trump-store-gold-note-tariffs-gold-prices-presidential/",
    "timestamp": "2025-04-23T11:34:53Z"
  },
  {
    "title": "Trump engaged in 'awkward high school situation' with China: White House reporter",
    "description": "A White House reporter called out president Donald Trump's \"awkward\" overtures to China to reach an agreement to end his trade war.Secretary of state Scott Bessent said Tuesday that Trump's 145-percent tariffs were not sustainable and that he expects a \"de-es…",
    "link": "https://www.rawstory.com/trump-tariffs-china-2671830206/",
    "timestamp": "2025-04-23T11:34:12Z"
  },
  {
    "title": "Here’s How Middle-Class Retirees Should Consider Preparing for Trump’s Social Security Tax Plan",
    "description": "President Donald Trump has pledged to eliminate federal taxes on Social Security benefits, and earlier this year, U.S. Rep. Thomas Massie, R-Ky., introduced a bill to do just that.\nLearn More: Who Would Benefit the Most from Trump’s Social Security Tax Plan?\n…",
    "link": "https://biztoc.com/x/c2084a2856083f70",
    "timestamp": "2025-04-23T11:33:22Z"
  },
  {
    "title": "Catholic faithful pay their final respects to Pope Francis in St. Peter’s Basilica",
    "description": "Wednesday is the start of three days of public viewing ahead of the pontiff’s funeral.",
    "link": "https://www.bostonherald.com/2025/04/23/vatican-pope-francis-final-respects/",
    "timestamp": "2025-04-23T11:32:17Z"
  },
  {
    "title": "Tesla investors react positively to Musk pledge to step back from U.S. government role",
    "description": "Tesla shares surged about five per cent in premarket trading on Wednesday after Elon Musk said he would spend less time working for the U.S. administration, kindling hopes that the billionaire CEO would devote more time to the struggling EV maker's brand and …",
    "link": "https://www.cbc.ca/news/business/tesla-musk-doge-1.7516138",
    "timestamp": "2025-04-23T11:30:12Z"
  }
]