[
  {
    "title": "Trump administration halts $1B in federal funding for Cornell, $790M for Northwestern",
    "description": "More than $1 billion in federal funding for Cornell and around $790 million for Northwestern have been frozen as the government investigates alleged civil rights violations at both universities",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-halts-1-billion-federal-funding-cornell-120625589",
    "timestamp": "2025-04-09T08:09:23Z"
  },
  {
    "title": "Meet the angel investors who are shaking up Silicon Valley",
    "description": "The data is clear: More women angel investors writing checks means more women founders getting investments.",
    "link": "https://www.businessinsider.com/angel-investors-shaking-up-silicon-valley-masculine-energy-women-2025-4",
    "timestamp": "2025-04-09T08:09:01Z"
  },
  {
    "title": "M'sia to hold high-level meetings before Washington DC trip, says Fahmi",
    "description": "PUTRAJAYA: Malaysia will hold two high-level meetings before deciding how to respond to the United States' reciprocal tariffs, said Communications Minister Datuk Fahmi Fadzil. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/09/m039sia-to-hold-high-level-meetings-before-washington-dc-trip-says-fahmi",
    "timestamp": "2025-04-09T08:07:00Z"
  },
  {
    "title": "You can no longer buy Razer laptops in the U.S.",
    "description": "Razer has halted sales of its popular and powerful Blade series of gaming laptops in the U.S. following new tariffs going into effect.",
    "link": "https://www.phonearena.com/news/you-can-no-longer-buy-razer-laptops-in-the-u.s._id169308",
    "timestamp": "2025-04-09T08:05:44Z"
  },
  {
    "title": "US freezes funds for Cornell, Northwestern after pro-Palestinian protests",
    "description": "The White House says Cornell University's $1bn and Northwestern University's $790m in federal funding have been blocked.",
    "link": "https://www.aljazeera.com/news/2025/4/9/trump-administration-freezes-funds-for-cornell-northwestern-universities",
    "timestamp": "2025-04-09T08:03:55Z"
  },
  {
    "title": "Musk slams 'moron' Trump aide in deepening tariff spat",
    "description": "Elon Musk blasted President Donald Trump's senior trade advisor Peter Navarro as \"truly a moron\" in a growing rift over the U.S. tariff policy.",
    "link": "https://www.hurriyetdailynews.com/musk-slams-moron-trump-aide-in-deepening-tariff-spat-207845",
    "timestamp": "2025-04-09T08:03:26Z"
  },
  {
    "title": "Live updates: Trump news, US tariffs escalate global trade war, CNN town hall with Bernie Sanders",
    "description": "President Donald Trump continues to forge ahead with his domestic and foreign policy agenda as he implements his global tariff plan. Follow for the latest live news updates.",
    "link": "https://www.cnn.com/politics/live-news/trump-tariffs-cnn-town-hall-04-09-25/index.html",
    "timestamp": "2025-04-09T08:03:24Z"
  },
  {
    "title": "US Takes Aim At Zuckerberg's Social Media Kingdom",
    "description": "Barring any eleventh-hour intervention, social media juggernaut Meta will stand trial next week facing serious US government allegations that it abused its market power to acquire Instagram and WhatsApp before they could become competitors.",
    "link": "https://www.ibtimes.com/us-takes-aim-zuckerbergs-social-media-kingdom-3769344",
    "timestamp": "2025-04-09T08:03:19Z"
  },
  {
    "title": "Why economists say a global recession is heading our way",
    "description": "The escalating trade war between the U.S. and nearly every single one of its major trading partners has sparked a flurry of predictions and concerns that a global recession could be around the corner.",
    "link": "https://www.cbc.ca/news/business/global-recession-tariffs-1.7505272",
    "timestamp": "2025-04-09T08:01:05Z"
  },
  {
    "title": "Ashish Launches Bridal Range With a DTC Approach",
    "description": "Ashish Gupta, a master in camp, glamourous sequin creations debuts his first bridal collection with a direct-to-consumer approach.",
    "link": "http://wwd.com/fashion-news/designer-luxury/ashish-launch-bridal-collection-confetti-veil-1237077127/",
    "timestamp": "2025-04-09T08:01:00Z"
  },
  {
    "title": "Budget fight tests the limits of Trump loyalty in Congress | CNN Politics",
    "description": "Budget fight tests the limits of Trump loyalty in Congress | CNN Politicscnn.com",
    "link": "https://www.cnn.com/2025/04/09/politics/budget-fight-trump-loyalty-test-congress/index.html",
    "timestamp": "2025-04-09T08:00:35Z"
  },
  {
    "title": "California sheriff vows to defy statewide sanctuary law: ‘This is common sense’",
    "description": "A California sheriff has openly said he will defy a sanctuary state law in certain conditions, citing his duty to provide public safety.",
    "link": "https://www.foxnews.com/us/california-sheriff-vows-defy-statewide-sanctuary-law-common-sense",
    "timestamp": "2025-04-09T08:00:12Z"
  },
  {
    "title": "A Liberal and a Conservative knocked on the same door and some polite trash talk ensued",
    "description": "'After the election, one of us will help you,' the Liberal MP says before pausing for a brief second. 'I suspect it'll be me'",
    "link": "https://nationalpost.com/news/politics/liberal-conservative-come-face-to-face-on-campaign-trail",
    "timestamp": "2025-04-09T08:00:04Z"
  },
  {
    "title": "Nuclear Energy Support Near Record High in U.S.",
    "description": "Americans support nuclear energy and offer mixed views on fracking and offshore drilling, while a diminished majority prefer renewable energy development over more fossil fuel production.",
    "link": "https://news.gallup.com/poll/659180/nuclear-energy-support-near-record-high.aspx",
    "timestamp": "2025-04-09T08:00:00Z"
  },
  {
    "title": "Pierre Poilievre is boasting about his rallies. But does size indicate success?",
    "description": "Conservative Leader Pierre Poilievre has been boasting about the size of his political rallies. But the size of such events may not be indicative of wide-scale support for a campaign or predictive of electoral success, some political analysts say.",
    "link": "https://www.cbc.ca/news/politics/pierre-poilievre-crowd-sizes-1.7504980",
    "timestamp": "2025-04-09T08:00:00Z"
  },
  {
    "title": "US takes aim at Zuckerberg’s social media kingdom",
    "description": "Barring any eleventh-hour intervention, social media juggernaut Meta will stand trial next week facing serious US government allegations that it abused its market power to acquire Instagram and WhatsApp before they could become competitors. By moving forward,…",
    "link": "https://www.digitaljournal.com/world/us-takes-aim-at-zuckerbergs-social-media-kingdom/article",
    "timestamp": "2025-04-09T07:57:20Z"
  },
  {
    "title": "Trump Tariffs Take Effect and U.S. ‘Don’t Necessarily’ Want to Make Deals",
    "description": "4 min ago\nTrump Tariffs Take Effect and U.S. ‘Don’t Necessarily’ Want to Make Deals\nPresident Donald Trump’s sweeping tariffs on countries around the world, including a 104% levy on Chinese imports, took effect early Wednesday, dramatically altering the globa…",
    "link": "https://biztoc.com/x/18f3cdbe97d3cddb",
    "timestamp": "2025-04-09T07:57:11Z"
  },
  {
    "title": "Who is Ryosei Akazawa, Japan's tariffs negotiator?",
    "description": "The man tasked with convincing the U.S. drop its tariffs on Japanese goods is one of the prime minister's closest allies and busiest ministers.",
    "link": "https://www.japantimes.co.jp/news/2025/04/09/japan/politics/akazawa-profile/",
    "timestamp": "2025-04-09T07:55:00Z"
  },
  {
    "title": "Trump’s tariffs are officially in effect, including 104 percent on China",
    "description": "President Donald Trump’s promised higher tariffs have gone into effect today, targeting many countries whose goods imported to the US were already subject to a 10 percent base tariff that started on April 5th.  The White House announced the tariffs on April 2…",
    "link": "https://www.theverge.com/news/645215/trump-us-tariffs-china-eu",
    "timestamp": "2025-04-09T07:54:15Z"
  },
  {
    "title": "Trump’s New Hot Take On His Tariffs Sparks 1 Hell Of An Eye-Roll Online",
    "description": "The president claimed his use of the description was \"positive,\" but critics begged to differ.",
    "link": "https://www.huffpost.com/entry/donald-trump-tariffs-hot-take-reaction_n_67f61f44e4b0e7553a0bf193",
    "timestamp": "2025-04-09T07:50:32Z"
  },
  {
    "title": "트럼프 쇼크",
    "description": "President Trump has slapped a 26% tariff on US imports from India, higher than the levies applied to goods from the European Union, Japan and South Korea.Here's why, and what it means. ⤵️ https://t.co/nU6M6Foo1J— Bloomberg (@business) April 4, 2025 South Kore…",
    "link": "https://ryueyes11.tistory.com/511556",
    "timestamp": "2025-04-09T07:49:46Z"
  },
  {
    "title": "China vows ‘resolute and effective measures’ after Trump’s 104% tariffs take effect | CNN Business",
    "description": "China has promised to take “resolute and effective measures” to safeguard its rights and interests, hours after US President Donald Trump’s 104% tariffs on Chinese imports took effect on Wednesday.",
    "link": "https://www.cnn.com/2025/04/09/business/china-us-reciprocal-tariffs-reaction-hnk-intl/index.html",
    "timestamp": "2025-04-09T07:47:03Z"
  },
  {
    "title": "Govt in touch with exporters to minimise US tariff impact, say sources",
    "description": "Trump tariffs: The cabinet is also expected to discuss India’s strategy as Trump’s 26 per cent tariffs come into effect today.",
    "link": "https://www.businesstoday.in/latest/economy/story/govt-in-touch-with-exporters-to-minimise-us-tariff-impact-say-sources-471356-2025-04-09",
    "timestamp": "2025-04-09T07:45:36Z"
  },
  {
    "title": "Iran Ready to 'Seal a Deal' With US",
    "description": "Iranian Foreign Minister Abbas Araqchi says upcoming talks with the U.S. could guarantee results but \"wall of mistrust\" remains.",
    "link": "https://www.newsweek.com/iran-ready-seal-nuclear-deal-us-2057232",
    "timestamp": "2025-04-09T07:43:55Z"
  },
  {
    "title": "Opinion: Piyush Goyal's Deep Tech 'FOMO' Is Not Unique",
    "description": "The Indian minister wants entrepreneurs to join the wave of nationalism sweeping through the world, across China, Europe, and America.",
    "link": "https://www.ndtv.com/opinion/piyush-goyals-deep-tech-fomo-is-not-unique-8123138",
    "timestamp": "2025-04-09T07:41:46Z"
  },
  {
    "title": "MrBeast criticises Trump tariffs, highlights impact on his chocolate brand Feastables",
    "description": "Feastables is currently produced in both Peru and the US, but the company sources its cocoa internationally and ensures fair pay for farmers. “We pay our farmers a living income, use fair trade certified beans, etc. so I was already spending a lot on cocoa,” …",
    "link": "https://economictimes.indiatimes.com/tech/technology/mrbeast-criticises-trump-tariffs-highlights-impact-on-his-chocolate-brand-feastables/articleshow/120120798.cms",
    "timestamp": "2025-04-09T07:38:16Z"
  },
  {
    "title": "Temple Street report provides major challenge for new Minister for Health",
    "description": "Elsewhere, Simon Harris is in DC to meet the man who has dubbed Ireland his 'favourite tax scam'",
    "link": "https://www.irishtimes.com/politics/2025/04/09/temple-street-report-provides-major-challenge-for-new-minister-for-health/",
    "timestamp": "2025-04-09T07:35:59Z"
  },
  {
    "title": "European stocks slump at open as Trump tariffs kick in",
    "description": "European stock markets sank on Wednesday as US President Donald Trump’s steep new tariffs came into effect and triggered a fresh sell-off in global equities. Indices fell back into the red at the open, a day after partially rebounding from a day-long sell-off…",
    "link": "https://punchng.com/european-stocks-slump-at-open-as-trump-tariffs-kick-in/",
    "timestamp": "2025-04-09T07:35:36Z"
  },
  {
    "title": "Trump China Tariffs Hit Crypto Hard: $BTC At $75K, $ETH Below $1,500, $XRP At $1.77",
    "description": "President Trump's new tariffs on China are hurting crypto real hard as the world's largest cryptocurrency by market cap plunged to $75,000—thousands of dollars far from its all-time high of $108,000 on Inauguration Day 2025.",
    "link": "https://www.ibtimes.com/trump-china-tariffs-hit-crypto-hard-btc-75k-eth-below-1500-xrp-177-3769319",
    "timestamp": "2025-04-09T07:35:27Z"
  },
  {
    "title": "Trump warns pharmaceuticals tariff on the way",
    "description": "As global markets continued to suffer, last night Donald Trump warned that more tariffs were on the way, including on pharmaceuticals\nRead more: Trump warns pharmaceuticals tariff on the way",
    "link": "https://biztoc.com/x/47aed7eb387b0d88",
    "timestamp": "2025-04-09T07:35:24Z"
  },
  {
    "title": "Texas Attorney General Ken Paxton to Primary Challenge Senator John Cornyn",
    "description": "Texas Attorney General Ken Paxton announced a primary challenge against the Lone State state's longtime Sen. John Cornyn in what might shape up to be an ugly battle.\nThe post Texas Attorney General Ken Paxton to Primary Challenge Senator John Cornyn appeared …",
    "link": "https://www.breitbart.com/politics/2025/04/09/texas-attorney-general-ken-paxton-to-primary-challenge-senator-john-cornyn/",
    "timestamp": "2025-04-09T07:35:18Z"
  },
  {
    "title": "The Latest: Asia shares sink as US tariffs take effect",
    "description": "Asian and European shares sank again on Wednesday as the latest set of U.S. tariffs, including a 104% levy on Chinese imports, went into effect.",
    "link": "https://www.clickondetroit.com/business/2025/04/09/the-latest-asia-shares-sink-as-us-tariffs-take-effect/",
    "timestamp": "2025-04-09T07:34:30Z"
  },
  {
    "title": "Republicans are going public with their growing worries about Trump's tariffs",
    "description": "Republican senators are confronting the Trump administration with a bevy of worries about the economic impacts of the president’s sweeping tariff strategy.",
    "link": "https://www.clickondetroit.com/news/politics/2025/04/09/republicans-are-going-public-with-their-growing-worries-about-trumps-tariffs/",
    "timestamp": "2025-04-09T07:34:29Z"
  },
  {
    "title": "Apple Exported $17 Billion in iPhones From India Last Year, Minister Says",
    "description": "US President Donald Trump’s levies on China — and his threat to impose a further 50 percent tariff — could push Apple to move more manufacturing toward India and countries in Southeast Asia. Still, a complete shift away from the company’s longtime manufacturi…",
    "link": "https://www.gadgets360.com/mobiles/news/apple-exported-usd-17-billion-iphone-india-last-year-tech-minister-ashwini-vaishnaw-8123064",
    "timestamp": "2025-04-09T07:34:22Z"
  },
  {
    "title": "Asian markets resume slide; Nikkei 225 drops 5% as Trump's salvo of tariffs takes effect",
    "description": "Asian and European shares slid on Wednesday, with Japan's Nikkei 225 dipping more than 5%, as the latest set of U.S. tariffs including a massive 104% levy on Chinese imports took effect. Markets have been wobbly for days, with investors flummoxed over what to…",
    "link": "https://japantoday.com/category/business/asian-markets-resume-slide-and-tokyo%27s-nikkei-225-drops-5-as-trump%27s-latest-salvo-of-tariffs-takes-effect",
    "timestamp": "2025-04-09T07:34:17Z"
  },
  {
    "title": "Tahawwur Rana's extradition will expose Pakistani state actors' role in 26/11 attacks: Sources",
    "description": "Tahawwur Rana, accused in the Mumbai terror attack, will likely be extradited to India soon. He has exhausted all legal options in the US. Indian agencies aim to uncover Pakistan's role in the 26/11 attacks through Rana. A multi-agency team is in the US to br…",
    "link": "https://economictimes.indiatimes.com/news/india/tahawwur-ranas-extradition-will-expose-pakistani-state-actors-role-in-26/11-attacks-sources/articleshow/120120691.cms",
    "timestamp": "2025-04-09T07:31:53Z"
  },
  {
    "title": "Bitcoin Events announces the highly anticipated Strategic Bitcoin Reserve Summit is just one week away!",
    "description": "Taking place virtually on April 15, 2025, this pioneering event will unite global financial leaders, […]",
    "link": "https://ambcrypto.com/bitcoin-events-announces-the-highly-anticipated-strategic-bitcoin-reserve-summit-is-just-one-week-away/",
    "timestamp": "2025-04-09T07:30:39Z"
  },
  {
    "title": "European stock markets slump as Trump's tariffs kick in",
    "description": "European stock markets sank at the open on Wednesday as US President Donald Trump's steep new tariffs came into effect and triggered a fresh sell-off in global equities.",
    "link": "https://www.thelocal.com/20250409/european-stock-markets-slump-as-trumps-tariffs-kick-in",
    "timestamp": "2025-04-09T07:30:20Z"
  },
  {
    "title": "Economists Say America’s Trade Deficits, Which Trump Seeks to Close With Tariffs, Are a Sign of Dominance Not Weakness",
    "description": "The faster the U.S. economy grows, the more imports Americans tend to buy and the wider trade deficits tend to get.",
    "link": "https://time.com/7275957/trump-tariffs-usa-trade-deficits-economic-growth-strength-world-order/",
    "timestamp": "2025-04-09T07:30:00Z"
  },
  {
    "title": "European Stocks Resume Selloff as Trump’s Tariffs Go Into Effect",
    "description": "European stocks slumped on Wednesday as US President Donald Trump’s tariffs took effect, triggering a renewed selloff across global financial markets.",
    "link": "https://financialpost.com/pmn/business-pmn/european-stocks-resume-selloff-as-trumps-tariffs-go-into-effect",
    "timestamp": "2025-04-09T07:29:53Z"
  },
  {
    "title": "Taiwan's Minister of Economic Affairs dismisses merger rumors between GlobalFoundries and UMC",
    "description": "Since taking office, President Donald Trump has wielded tariffs as a tool to disrupt global trade. On April 9, Taiwan's Minister of Economic Affairs, J.W. Kuo, addressed these major shifts in international trade during a legislative session in Taiwan's Econom…",
    "link": "https://www.digitimes.com/news/a20250409PD237/taiwan-globalfoundries-umc-merger.html",
    "timestamp": "2025-04-09T07:27:09Z"
  },
  {
    "title": "Trump disrupts global economic order even though the US is dominant",
    "description": "By declaring a trade war on the rest of the world, President Donald Trump has panicked global financial markets and raised the risk of a recession",
    "link": "https://abcnews.go.com/Business/wireStory/trump-disrupts-global-economic-order-us-dominant-120625047",
    "timestamp": "2025-04-09T07:26:35Z"
  },
  {
    "title": "Trump assures GOP budget holdouts on spending cuts (Politico)",
    "description": "Politico:\nTrump assures GOP budget holdouts on spending cuts  —  Speaker Mike Johnson is projecting confidence about finalizing a GOP budget plan after he and President Donald Trump went to work on a group of Republican holdouts at a White House meeting Tuesd…",
    "link": "https://www.memeorandum.com/250409/p7",
    "timestamp": "2025-04-09T07:25:13Z"
  },
  {
    "title": "New Trump Tariffs Imposed With Over 100% on China",
    "description": "President Donald Trump has now imposed a tariff of 104 percent on imports from China after his deadline for Beijing passed.\nLast week, Trump announced a 34 percent \"reciprocal\" tariff on China in addition to a 10 percent baseline tariff. He said the cost of t…",
    "link": "https://biztoc.com/x/e29754655838611f",
    "timestamp": "2025-04-09T07:24:06Z"
  },
  {
    "title": "South Sudanese children die as US aid cuts shutter medical services: NGO",
    "description": "US aid cuts force South Sudanese clinics to close, leaving cholera patients dead on a desperate trek for medical care.",
    "link": "https://www.aljazeera.com/news/2025/4/9/us-aid-cuts-leave-south-sudan-children-dead-as-medical-services-collapse",
    "timestamp": "2025-04-09T07:22:21Z"
  },
  {
    "title": "How the powerful are using lawsuit threats to silence media and 'Murder the Truth'",
    "description": "President Trump is no fan of the free press. But he's not the only powerful person in the U.S. using the courts to silence unfavorable coverage, a New York Times editor and author tells NPR.",
    "link": "https://www.npr.org/2025/04/09/nx-s1-5318045/freedom-of-the-press-lawsuits-trump",
    "timestamp": "2025-04-09T07:19:30Z"
  },
  {
    "title": "Bandt reckons losers are burning down the world while Dutton goes Thatcher mode",
    "description": "The Greens leader has criticised the major parties for their ties to the US while the Coalition's gas push has garnered support from across the ideological spectrum.",
    "link": "https://www.abc.net.au/news/2025-04-09/adam-bandt-press-club-dutton-albanese-gas-federal-election/105155802",
    "timestamp": "2025-04-09T07:19:14Z"
  },
  {
    "title": "New Trump Tariffs Imposed With Over 100% on China",
    "description": "President Donald Trump's deadline for China to withdraw its tariff retaliation had passed.",
    "link": "https://www.newsweek.com/new-trump-tariffs-imposed-china-2057236",
    "timestamp": "2025-04-09T07:16:00Z"
  },
  {
    "title": "Judge orders White House to restore media access to US news agency",
    "description": "Judge rules that Trump administration ban on US news agency from presidential events violates First Amendment rights.",
    "link": "https://www.aljazeera.com/news/2025/4/9/judge-orders-white-house-to-restore-media-access-to-us-news-agency",
    "timestamp": "2025-04-09T07:13:32Z"
  },
  {
    "title": "Letters to the editor",
    "description": "Herald readers sound off on Mike Kennealy's challenge to Gov. Maura Healey, and increasing the defense budget for the U.S. Navy",
    "link": "https://www.bostonherald.com/2025/04/09/letters-to-the-editor-690/",
    "timestamp": "2025-04-09T07:12:48Z"
  },
  {
    "title": "The ALA Sues Over the Scuppering of the IMLS [Publishers Weekly]",
    "description": "A lawsuit filed in federal court on April 7 by the American Library Association and the American Federation of State, County, and Municipal Employees alleges that the Trump administration’s recent “evisceration” of the Institute of Museum and Libra",
    "link": "https://www.publishersweekly.com/pw/by-topic/industry-news/libraries/article/97502-the-american-library-association-sues-over-scuppering-of-the-insitute-of-museum-and-library-services.html",
    "timestamp": "2025-04-09T07:09:03Z"
  },
  {
    "title": "Nintendo Switch 2 Sales Forecast Is Cut by Researcher Over Trump Tariffs",
    "description": "Researcher DFC Intelligence cut its 2025 global forecast for sales of Nintendo Co.’s upcoming Switch 2 video-game console. The forecast would still make the Switch 2 the fastest-selling game console of all time, but it’s indicative of the widespread uncertain…",
    "link": "https://www.gadgets360.com/games/news/nintendo-switch-2-sales-forecast-cut-researcher-trump-tariff-8122828",
    "timestamp": "2025-04-09T07:07:33Z"
  },
  {
    "title": "Ukraine says captured two Chinese nationals fighting for Russia",
    "description": "President Volodymyr Zelensky said Tuesday that Ukrainian troops had captured two Chinese citizens fighting alongside Russian forces, with Kiev demanding an explanation from Beijing.",
    "link": "https://www.hurriyetdailynews.com/ukraine-says-captured-two-chinese-nationals-fighting-for-russia-207840",
    "timestamp": "2025-04-09T07:06:52Z"
  },
  {
    "title": "\"Daydream\": Kim Jong Un's Sister Slams Denuclearization Efforts",
    "description": "Kim Jong Un&#039;s powerful sister slammed US-led efforts to take away North Korea&#039;s nuclear weapons, saying the idea of denuclearising the country was a &quot;daydream&quot;.",
    "link": "https://www.ndtv.com/world-news/kim-jong-uns-sister-slams-denuclearization-efforts-calls-it-daydream-8122810",
    "timestamp": "2025-04-09T07:05:10Z"
  },
  {
    "title": "'Best the coach can do': Kotak's Nilesh Shah on RBI's 25 bps rate cut amid Trump tariff tension",
    "description": "RBI slashed the key policy interest rate by 25 basis points—the second cut in a row—to help shield the economy from external shocks, particularly the escalating tariff measures announced by US",
    "link": "https://www.businesstoday.in/latest/economy/story/best-the-coach-can-do-kotaks-nilesh-shah-on-rbis-25-bps-rate-cut-amid-trump-tariff-tension-471345-2025-04-09",
    "timestamp": "2025-04-09T07:02:07Z"
  },
  {
    "title": "Meta Accused of Assisting China's AI Ambitions, Whistleblower to Tell Congress",
    "description": "Former policy chief Sarah Wynn-Williams said Meta allegedly compromised U.S. interests and misled lawmakers about its AI dealings with China.",
    "link": "https://decrypt.co/314061/meta-accused-chinas-ai-ambitions-whistleblower",
    "timestamp": "2025-04-09T07:01:35Z"
  },
  {
    "title": "Taiwan's tech giants shine as Trump's tariff tempest rages on—But for how long?",
    "description": "As US President Donald Trump enforces reciprocal tariffs internationally, global financial markets experience turmoil, particularly affecting electronics hardware manufacturers. Despite this challenging environment, the March 2025 revenue reports of major Tai…",
    "link": "https://www.digitimes.com/news/a20250409PD213/taiwan-electronics-revenue-donald-trump-tariffs.html",
    "timestamp": "2025-04-09T07:01:28Z"
  },
  {
    "title": "Donald Trump’s allies, supporters and donors, led by Elon Musk, push to end tariff war",
    "description": "While far from the only Republican defector from President Trump's tariff regimen, Elon Musk is among the most prominent. Here are a few others on Team Trump who have their doubts.",
    "link": "https://www.foxnews.com/politics/donald-trumps-allies-supporters-donors-led-elon-musk-push-end-tariff-war",
    "timestamp": "2025-04-09T07:00:23Z"
  },
  {
    "title": "Could Trump's tariffs tip the world into recession?",
    "description": "Donald Trump's \"Liberation Day\" tariffs last week spooked the markets.",
    "link": "https://news.sky.com/story/could-trumps-tariffs-tip-the-world-into-recession-13344231",
    "timestamp": "2025-04-09T06:59:00Z"
  },
  {
    "title": "Late-Night TV Hosts Respond to Trump’s ‘Bold Vision for Destroying the Economy’",
    "description": "Late-night TV hosts responded to Donald Trump's tariffs plan, calling it a \"bold vision for destroying the economy.\"",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/late-night-tv-hosts-trumps-tariffs-1235313505/",
    "timestamp": "2025-04-09T06:58:06Z"
  },
  {
    "title": "\"India, China Relationship Is...\": Beijing's Message After Trump's 104% Tariff",
    "description": "Donald Trump&#039;s tariffs are doing, it appears, what decades of political and diplomatic wrangling could not, at least with any great degree of success - to get India and China to work together.",
    "link": "https://www.ndtv.com/world-news/india-china-ties-donald-trump-tariffs-india-china-relationship-is-beijings-message-after-trumps-104-tariff-8122746",
    "timestamp": "2025-04-09T06:57:53Z"
  },
  {
    "title": "How BYD dethroned Tesla and how it will navigate Trump’s tariffs",
    "description": "Chinese EV giant BYD expanded its global market share on the back of lower prices, vertical integration and research and development. However, it now faces challenges amid tariff wars and growing strategic concerns.",
    "link": "https://www.livemint.com/companies/news/byd-vs-tesla-trump-s-tariffs-chinese-ev-company-byds-r-d-investments-warren-buffets-investment-in-byd-11744179309658.html",
    "timestamp": "2025-04-09T06:57:26Z"
  },
  {
    "title": "India central bank cuts interest rates as Trump tariffs kick in",
    "description": "India’s central bank cut interest rates in the world’s fifth-largest economy on Wednesday as US President Donald Trump’s tariffs kicked in and policymakers warned of “challenging global economic conditions”. The cut, the second this year, aims to boost a slow…",
    "link": "https://www.digitaljournal.com/world/india-central-bank-cuts-interest-rates-as-trump-tariffs-kick-in/article",
    "timestamp": "2025-04-09T06:57:20Z"
  },
  {
    "title": "India Central Bank Cuts Interest Rates As Trump Tariffs Kick In",
    "description": "India's central bank cut interest rates in the world's fifth-largest economy on Wednesday as US President Donald Trump's tariffs kicked in and policymakers warned of \"challenging global economic conditions\".",
    "link": "https://www.ibtimes.com/india-central-bank-cuts-interest-rates-trump-tariffs-kick-3769340",
    "timestamp": "2025-04-09T06:57:17Z"
  },
  {
    "title": "New Mexico governor mobilizes National Guard to tackle crime emergency in Albuquerque",
    "description": "Gov. Michelle Lujan Grisham on Tuesday declared a state of emergency in New Mexico’s largest city, saying that a significant increase in crime in Albuquerque warrants the help of the New Mexico National Guard.",
    "link": "https://nypost.com/2025/04/09/us-news/new-mexico-governor-mobilizes-national-guard-to-tackle-crime-emergency-in-albuquerque/",
    "timestamp": "2025-04-09T06:56:31Z"
  },
  {
    "title": "India eyes fall deadline for US trade pact: Jaishankar says ‘more talks with Americans in six weeks than in two years with EU'",
    "description": "External Affairs Minister (EAM) S Jaishankar spoke about the impact of the recent set of tariffs introduced by the US on countries across the world. He saw a silver lining and said that this would further boost the trade talks in place with the US. Jaishankar…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-eyes-fall-deadline-for-us-trade-pact-jaishankar-says-more-talks-with-americans-in-six-weeks-than-in-two-years-with-eu/articleshow/120119645.cms",
    "timestamp": "2025-04-09T06:55:37Z"
  },
  {
    "title": "North Korean Leader's Sister Fires Nuclear Warning at Trump",
    "description": "Kim Yo Jong is one of North Korea's top foreign policy officials.",
    "link": "https://www.newsweek.com/north-korea-kim-jong-un-sister-nuclear-weapons-warning-us-donald-trump-2057234",
    "timestamp": "2025-04-09T06:53:42Z"
  },
  {
    "title": "Morning Bid: Markets cower as 104% tariffs on China begin - Reuters",
    "description": "Morning Bid: Markets cower as 104% tariffs on China beginReuters April 8, 2025 - Donald Trump presidency newsCNN China Holds Fire on Immediate Retaliation Against New US TariffsBloomberg Why China thinks it might win a trade war with TrumpThe Economist Trump'…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176982635",
    "timestamp": "2025-04-09T06:53:07Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Travelling for abortions, tariffs on pharma, and another Slow Down Day.",
    "link": "https://www.thejournal.ie/the-8-at-8-wednesday-49-6672972-Apr2025/",
    "timestamp": "2025-04-09T06:47:57Z"
  },
  {
    "title": "India GDP growth faces risks from Trump tariff rude shock and RBI isn't mincing words",
    "description": "RBI Governor Sanjay Malhotra acknowledged that US tariff measures have increased uncertainties, making it difficult to assess the impact on economic growth. While growth is improving, it remains below desired levels. The MPC has revised the FY26 GDP growth fo…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/india-gdp-growth-faces-risks-from-trump-tariff-rude-shock-and-rbi-isnt-mincing-words/articleshow/120117377.cms",
    "timestamp": "2025-04-09T06:45:27Z"
  },
  {
    "title": "'Self-Sabotage': Critics, X Users Blast Trump As 104% China Tariffs Crash Global Markets",
    "description": "Critics of U.S. President Trump expressed their thoughts on the ongoing shakeup global markets—US stocks included—are experiencing following new tariffs his administration imposed on China.",
    "link": "https://www.ibtimes.com/self-sabotage-critics-x-users-blast-trump-104-china-tariffs-crash-global-markets-3769331",
    "timestamp": "2025-04-09T06:43:29Z"
  },
  {
    "title": "As Trump hikes tariffs again, nervous businesses weigh what comes next",
    "description": "As Trump hikes tariffs again, nervous businesses weigh what comes next\nUS President Donald Trump is ripping up the rulebook on trade that has been in place for more than 50 years.\nHis latest round of sweeping tariffs, which came into force shortly after midni…",
    "link": "https://biztoc.com/x/9959e091cebac501",
    "timestamp": "2025-04-09T06:40:29Z"
  },
  {
    "title": "Trumps Signs Pro-Coal Executive Orders",
    "description": "President Donald Trump signed several executive orders on Tuesday that should incentivize the construction of new coal power plants in the latest stark departure from his predecessor. “We're bringing back an industry that was abandoned,” Trump said, as quoted…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trumps-Signs-Pro-Coal-Executive-Orders.html",
    "timestamp": "2025-04-09T06:39:01Z"
  },
  {
    "title": "Prabowo seeks layoff task force to address US tariff implications",
    "description": "President Prabowo Subianto has instructed the Red and White Cabinet to establish a special task force to handle layoffs as part of anticipatory measures ...",
    "link": "https://en.antaranews.com/news/351045/prabowo-seeks-layoff-task-force-to-address-us-tariff-implications",
    "timestamp": "2025-04-09T06:37:10Z"
  },
  {
    "title": "Apple iPhones might cost $3,500 if they’re made in the US",
    "description": "US President Donald Trump has boasted “jobs and factories will come roaring back” as he unleashed unprecedented tariffs around the world during his “Liberation Day” address.",
    "link": "https://www.cnn.com/2025/04/09/tech/apple-iphones-cost-tariffs-impact-intl-hnk/index.html",
    "timestamp": "2025-04-09T06:36:39Z"
  },
  {
    "title": "Trump just rolled out 2 major changes to his China tariffs",
    "description": "In an executive order on Tuesday, the president outlined the two changes — raising tariffs on China to 104% and increasing the de minimis tariffs.",
    "link": "https://www.businessinsider.com/trump-rolled-out-2-major-changes-china-tariffs-2025-4",
    "timestamp": "2025-04-09T06:32:49Z"
  },
  {
    "title": "Devina Mehra: Trump’s tariffs will create more problems than they solve",
    "description": "The US President insists that his country’s trade partners have been unfair to it, even though America Inc has not complained. Most value addition, businesses reckoned, lay not in manufacturing but in intangibles like intellectual property and brands. Think A…",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-us-tariffs-inflation-consumer-confidence-stagflation-us-economy-trade-deficits-india-exports-us-fed-nifty50-11744130843806.html",
    "timestamp": "2025-04-09T06:30:02Z"
  },
  {
    "title": "CNBC Daily Open: The humongous 104% tariff on China is live — even Musk seems perturbed",
    "description": "Despite growing consternation and concern expressed by economists and CEOs, Trump administration officials have been stubborn in defending its trade policies.",
    "link": "https://www.cnbc.com/2025/04/09/cnbc-daily-open-104percent-china-tariff-is-live-even-musk-seems-perturbed.html",
    "timestamp": "2025-04-09T06:30:01Z"
  },
  {
    "title": "RBI warns of global shockwaves hitting India as Trump tariff timebomb lands",
    "description": "Amidst escalating trade tensions, RBI Governor Sanjay Malhotra addressed concerns over the newly imposed US tariffs on Indian goods, anticipating a negative impact on India's exports and overall economic growth. He highlighted the uncertainties in accurately …",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/rbi-warns-of-global-shockwaves-hitting-india-as-trump-tariff-timebomb-lands/articleshow/120117583.cms",
    "timestamp": "2025-04-09T06:26:05Z"
  },
  {
    "title": "Trump’s ‘Insulting' Boast About Foreign Countries And His Tariffs Gets Slammed Online",
    "description": "Critics also suggested it could be the “real reason” for the president’s tariffs.",
    "link": "https://www.huffpost.com/entry/donald-trump-tariffs-boast-reaction_n_67f60e06e4b06e09261da701",
    "timestamp": "2025-04-09T06:24:28Z"
  },
  {
    "title": "US exports drove Vietnam's economic success - then came Trump's tariffs",
    "description": "The tariffs are a huge blow for countries like Vietnam, Thailand and Cambodia that rely on exports.",
    "link": "https://www.bbc.com/news/articles/crm332189djo",
    "timestamp": "2025-04-09T06:24:28Z"
  },
  {
    "title": "Beijing calls US Vice President 'ignorant' and 'disrespectful' over 'Chinese peasants' remark",
    "description": "<p>Beijing lashed out at US Vice President JD Vance for comments he made about \"Chinese peasants,\" adding a personal dimension to the tensions between the world's biggest economies just as a global trade war unfolds.</p>",
    "link": "https://www.bangkokpost.com/world/2999232/jd-vances-chinese-peasants-remarks-get-sharp-rebuke-from-beijing",
    "timestamp": "2025-04-09T06:23:00Z"
  },
  {
    "title": "Metal stocks tank up to 18% in a week amid tariff woes, sector braces for more pain",
    "description": "On April 2, the Trump administration introduced reciprocal tariffs on over 60 countries, with a base tariff rate of 10%. India's reciprocal tariff is set at 26%. Additionally, a 25% tariff on steel and aluminum imports to the U.S. has been in effect since Mar…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/metal-stocks-tank-up-to-18-in-a-week-amid-tariff-woes-sector-braces-for-more-pain/articleshow/120117878.cms",
    "timestamp": "2025-04-09T06:19:03Z"
  },
  {
    "title": "Donald Trump Says Countries 'Kissing My Ass' Over Tariffs",
    "description": "The president spoke at an NRCC dinner with an economic backdrop of sharp market losses and fears of a recession over his tariffs.",
    "link": "https://biztoc.com/x/48832d26882d21ff",
    "timestamp": "2025-04-09T06:18:15Z"
  },
  {
    "title": "Wednesday's papers: Trade war woes, Americans fleeing Trump, and White House notches Finland as a win",
    "description": "The impact of US President Donald Trump's policies dominates Finnish newspaper headlines on Wednesday morning.",
    "link": "https://yle.fi/a/74-20154825",
    "timestamp": "2025-04-09T06:17:39Z"
  },
  {
    "title": "India central bank cuts interest rates as Trump tariffs kick in",
    "description": "MUMBAI: India's central bank cut interest rates in the world's fifth-largest economy on Wednesday (Apr 9) as Donald Trump's tariffs kicked in and policymakers warned of \"challenging global economic",
    "link": "https://www.channelnewsasia.com/asia/india-central-bank-cuts-interest-rates-trump-tariffs-kick-5054091",
    "timestamp": "2025-04-09T06:17:20Z"
  },
  {
    "title": "Donald Trump Says Countries 'Kissing My Ass' Over Tariffs",
    "description": "The president spoke at an NRCC dinner with an economic backdrop of sharp market losses and fears of a recession over his tariffs.",
    "link": "https://www.newsweek.com/trump-countries-kissing-my-ass-tariffs-2057223",
    "timestamp": "2025-04-09T06:16:54Z"
  },
  {
    "title": "Why gold has slipped during the market rout despite safe-haven status",
    "description": "While global markets have been reeling from Donald Trump's sweeping tariffs, gold prices remain near record highs. Bullion is currently exempt from the US import charges, as central banks including the Federal Reserve drive demand.",
    "link": "https://www.abc.net.au/news/2025-04-09/central-banks-stockpile-gold-drive-demand-and-price/105064918",
    "timestamp": "2025-04-09T06:13:09Z"
  },
  {
    "title": "'Boys will be boys': Musk dubs Trump's top trade adviser as 'dumber than a sack of bricks' and a moron",
    "description": "Elon Musk has publicly attacked Donald Trump's trade advisor, Peter Navarro, calling him \"dumber than a sack of bricks\" over newly imposed tariffs. This outburst follows Musk's appeal to Trump regarding the tariffs, which have cost him billions. The feud high…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/boys-will-be-boys-musk-dubs-trumps-top-trade-adviser-as-dumber-than-a-sack-of-bricks-and-a-moron/articleshow/120117470.cms",
    "timestamp": "2025-04-09T06:10:03Z"
  },
  {
    "title": "Trump says he told Taiwan's TSMC he'd slap a 100% tax on it if it doesn't make its chips in the US",
    "description": "\"All I did is say, 'If you don't build your plant here, you are gonna pay a big tax. 25, maybe 50, maybe 75, maybe 100%,'\" President Donald Trump said of Taiwan's TSMC on Tuesday.\nAnna Moneymaker via Getty Images\nIn March, TSMC said it will invest $100 billio…",
    "link": "https://biztoc.com/x/ee4f18497fe7d722",
    "timestamp": "2025-04-09T06:07:32Z"
  }
]