[
  {
    "title": "Historian offers measured defence of Sir John A. Macdonald",
    "description": "Patrice Dutil recruits history to paint balanced portrait of Canada’s first prime minister",
    "link": "https://nationalpost.com/entertainment/books/historian-offers-measured-defence-of-sir-john-a-macdonald",
    "timestamp": "2025-04-22T01:14:37Z"
  },
  {
    "title": "Oil prices climb on short-covering, but tariff concerns linger",
    "description": "Oil prices climbed in early trade on Tuesday as investors took advantage of the previous day's losses to cover short positions, although concerns persisted...",
    "link": "https://finance.yahoo.com/news/oil-prices-climb-short-covering-011207928.html",
    "timestamp": "2025-04-22T01:12:07Z"
  },
  {
    "title": "Trump administration weighs pro-family policies amid falling US birthrates",
    "description": "Among the ideas under consideration are a $5,000 \"baby bonus\" for new mothers, and reserving 30% of Fulbright scholarships for applicants who are married or have children.",
    "link": "https://www.jpost.com/international/article-850993",
    "timestamp": "2025-04-22T01:11:00Z"
  },
  {
    "title": "US Education department to resume student loan collections from May 5, affecting millions in default",
    "description": "The US Education Department will restart student loan collections from 5 May, targeting over 5 million borrowers in default. Wage garnishment and benefit offsets will resume after a pause that began during the COVID-19 pandemic. The decision ends years of len…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/student-loans-debt-collection-us-education-department-to-resume-student-loan-collections-from-may-5-affecting-millions-in-default/articleshow/120501580.cms",
    "timestamp": "2025-04-22T01:08:44Z"
  },
  {
    "title": "Cardinals to meet after death of Pope Francis, plan for funeral",
    "description": "Following Pope Francis' unexpected death at 88, cardinals are convening to plan his funeral, which global leaders, including Donald Trump and Javier Milei, will attend. The Vatican anticipates the ceremony between Friday and Sunday, with Francis requesting bu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/cardinals-to-meet-after-death-of-pope-francis-plan-for-funeral/articleshow/120501622.cms",
    "timestamp": "2025-04-22T01:08:08Z"
  },
  {
    "title": "Larry David Spoofs Bill Maher’s White House Visit With ‘My Dinner With Adolf’ Essay: ‘Private Hitler Was a Completely Different Animal’",
    "description": "Larry David spoofed Bill Maher’s glowing review of his White House dinner with Donald Trump with a satirical essay in The New York Times entitled, “My Dinner With Adolf.” “I had been a vocal critic of his on the radio from the beginning, pretty much predictin…",
    "link": "https://variety.com/2025/tv/news/larry-david-bill-maher-donald-trump-dinner-with-adolf-essay-1236374517/",
    "timestamp": "2025-04-22T01:07:48Z"
  },
  {
    "title": "Cardinals to meet after death of Pope Francis, plan for funeral",
    "description": "VATICAN CITY (Reuters) - Cardinals were due to meet on Tuesday to plan Pope Francis' funeral, which leaders from around the world will attend ahead of a conclave next month to elect a new head of the Roman Catholic Church. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/22/cardinals-to-meet-after-death-of-pope-francis-plan-for-funeral",
    "timestamp": "2025-04-22T01:07:00Z"
  },
  {
    "title": "GOP railed against China-tied firm — but Trump’s inaugural fund cashed their $1M check",
    "description": "President Donald Trump's inaugural fund accepted $1 million from a China-linked firm that his campaign, along with the Michigan Republican Party, used to whip up voters into paranoia during the 2024 elections last year, The Detroit News reported Monday evenin…",
    "link": "https://www.rawstory.com/donald-trump-2671816869/",
    "timestamp": "2025-04-22T01:03:55Z"
  },
  {
    "title": "Asian stocks drop after US selloff, dollar steady",
    "description": "An index of Asian shares retreated while equity futures for US stocks rose slightly, indicating shares may bounce back after the S&P 500 fell more than 2% Monday. A gauge of the greenback steadied in early trading, after weakening to a 15-month low. Gold jump…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-drop-after-us-selloff-dollar-steady/articleshow/120501579.cms",
    "timestamp": "2025-04-22T01:02:47Z"
  },
  {
    "title": "Advocates Urge Seattle Children’s To Offer Gender-Affirming Surgery To Trans People Under 19",
    "description": "A letter signed by at least 550 individuals, health care professionals, and advocacy groups is urging Seattle Children’s Hospital to restore access to gender-affirming surgical care to trans people under 19.\n \n by Vivian McCall\n \n \n \n A letter signed by at le…",
    "link": "https://www.thestranger.com/news/2025/04/21/80024477/advocates-urge-seattle-childrens-to-offer-gender-affirming-surgery-to-trans-people-under-19",
    "timestamp": "2025-04-22T01:02:00Z"
  },
  {
    "title": "Democratic lawmaker argues his party shouldn't look kindly on foreign governments aiding Trump",
    "description": "Rep. Jamie Raskin suggested during a conversation on \"Pod Save America\" that Democrats should be keeping score with nations aiding President Donald Trump.",
    "link": "https://www.foxnews.com/media/democratic-lawmaker-argues-his-party-shouldnt-look-kindly-foreign-governments-aiding-trump",
    "timestamp": "2025-04-22T01:00:52Z"
  },
  {
    "title": "Wyden readies anti-tariff push, hears woes of local businesses",
    "description": "Tariffs announced this month have already ripped into sales, bruised profit margins and sparked worries about layoffs.",
    "link": "https://www.oregonlive.com/business/2025/04/wyden-readies-anti-tariff-push-hears-woes-of-local-businesses.html",
    "timestamp": "2025-04-22T00:59:25Z"
  },
  {
    "title": "Putin says he is open to direct peace talks with Ukraine",
    "description": "Amidst ongoing conflict, Russian President Vladimir Putin has proposed bilateral talks with Ukraine, a first since the war's early stages. Ukrainian President Volodymyr Zelenskiy expressed eagerness to discuss a ceasefire, particularly concerning attacks on c…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/putin-says-he-is-open-to-direct-peace-talks-with-ukraine/articleshow/120501559.cms",
    "timestamp": "2025-04-22T00:59:00Z"
  },
  {
    "title": "CNBC Daily Open: Trump's escalating attacks on Powell are making investors cautious of the U.S.",
    "description": "With no market closure to shield shares from U.S. President Trump’s threats of interfering in the Federal Reserve, investors unloaded their stocks.",
    "link": "https://www.cnbc.com/2025/04/22/cnbc-daily-open-trumps-attacks-on-powell-make-investors-wary-of-us.html",
    "timestamp": "2025-04-22T00:56:04Z"
  },
  {
    "title": "US senator says new 9/11 investigation could happen",
    "description": "Republican Senator Ron Johnson has suggested that new congressional hearings into the September 11 attacks may be forthcoming Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616080-investigation-johnson-911-attacks/",
    "timestamp": "2025-04-22T00:55:00Z"
  },
  {
    "title": "Detainee recounts chaotic near-deportation that was paused amid a court fight",
    "description": "Eduardo Daboin Rall, a Venezuelan national who was among at least 28 detainees placed on a bus Friday night for deportation to El Salvador before the vehicle dramatically turned around amid a legal fight, told NBC News the episode \"made me cry\" and fear that …",
    "link": "https://www.nbcnews.com/politics/immigration/detainee-recounts-chaotic-deportation-was-paused-court-fight-rcna202283",
    "timestamp": "2025-04-22T00:49:23Z"
  },
  {
    "title": "Student Loans In Default To Be Referred To Debt Collection, Education Department Says",
    "description": "The Education Dept. will begin collection next month on student loans in default, including the garnishing of wages for potentially millions of borrowers, officials said.",
    "link": "https://www.huffpost.com/entry/education-student-loans-default-debt-collection_n_6806e59ce4b052543c13bd08",
    "timestamp": "2025-04-22T00:48:28Z"
  },
  {
    "title": "Karoline Leavitt Denies NPR Story of White House Looking to Replace Hegseth",
    "description": "White House press secretary Karoline Leavitt denied a story from NPR on Monday that alleged the White House is looking to replace Secretary of Defense Pete Hegseth.\nThe post Karoline Leavitt Denies NPR Story of White House Looking to Replace Hegseth appeared …",
    "link": "https://www.breitbart.com/politics/2025/04/21/karoline-leavitt-denies-npr-white-house-replace-hegseth/",
    "timestamp": "2025-04-22T00:47:51Z"
  },
  {
    "title": "Harvard sues Trump over $2.2bn funding freeze",
    "description": "Harvard University is suing Donald Trump's administration after it rejected a list of demands from the White House and had $2.2bn (£1.6bn) of government funding frozen.",
    "link": "https://news.sky.com/story/harvard-university-sues-over-2-2bn-funding-freeze-after-rejecting-demands-from-donald-trumps-administration-13353518",
    "timestamp": "2025-04-22T00:47:00Z"
  },
  {
    "title": "The trade debate revisited",
    "description": "Within the Trump administration there is a vigorous debate between two camps.  One group, headed by Peter Navarro, might be called the “true believers”.  They favor mercantilist economic policies of the sort that Argentina implemented during the 1940s and 195…",
    "link": "https://www.econlib.org/the-trade-debate-revisited/",
    "timestamp": "2025-04-22T00:46:14Z"
  },
  {
    "title": "Harvard sues Trump over US federal funding cuts",
    "description": "NEW YORK - Harvard sued US President Donald Trump's administration Monday in a sharp escalation of the fight between the prestigious university and the Republican, who has threatened its funding and sought to impose outside political supervision.",
    "link": "https://www.bangkokpost.com/world/3008376/harvard-sues-trump-over-us-federal-funding-cuts",
    "timestamp": "2025-04-22T00:45:00Z"
  },
  {
    "title": "Hegseth Remains Isolated and Defiant",
    "description": "“President Donald Trump on Monday dismissed a deepening controversy surrounding Pete Hegseth, declaring the embattled defense secretary is ‘doing a great job’ despite seismic dysfunction within the Pentagon amid political infighting, numerous firings, and rep…",
    "link": "https://politicalwire.com/2025/04/21/hegseth-remains-isolated-and-defiant/",
    "timestamp": "2025-04-22T00:45:00Z"
  },
  {
    "title": "Why Trump Is Standing by Hegseth, for Now",
    "description": "Trump is currently supporting his defense secretary, but some in the administration are speculating about how long Pete Hegseth will last.",
    "link": "https://www.theatlantic.com/politics/archive/2025/04/trump-hegseth-signal-pentagon/682531/",
    "timestamp": "2025-04-22T00:40:02Z"
  },
  {
    "title": "Student loan crackdown coming",
    "description": "The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.",
    "link": "https://www.bostonherald.com/2025/04/21/student-loan-crackdown-coming/",
    "timestamp": "2025-04-22T00:38:40Z"
  },
  {
    "title": "Trump's Bowling Ball Tale Bounces Back, Japan Refutes President's Car Safety Test Claims",
    "description": "President Donald Trump has once again brought up his claim regarding a peculiar vehicle safety test in Japan, which he describes as a non-tariff barrier. However, according to a report on Monday, Japan’s transport ministry refuted this assertion.\nWhat Happene…",
    "link": "https://biztoc.com/x/d1b163dc2e8de95f",
    "timestamp": "2025-04-22T00:38:02Z"
  },
  {
    "title": "US President Donald Trump, First Lady Melania to attend Pope Francis' funeral in Rome",
    "description": "Following the death of Pope Francis at 88, former US President Donald Trump and First Lady Melania Trump will attend his funeral in Rome. Prime Minister Narendra Modi expressed condolences, cherishing the Pope's affection for India, and India has declared a t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-president-donald-trump-first-lady-melania-to-attend-pope-francis-funeral-in-rome/articleshow/120501451.cms",
    "timestamp": "2025-04-22T00:37:47Z"
  },
  {
    "title": "'Google Donald Trump': Maxwell Frost Hits Back At Fox News Host's Fumble",
    "description": "Will Cain later made \"no apologies\" for not knowing about the clip of the president's chilling plan for citizens.",
    "link": "https://www.huffpost.com/entry/maxwell-frost-fox-news-will-cain-trump-homegrowns_n_6806cb02e4b00144787a99b1",
    "timestamp": "2025-04-22T00:35:45Z"
  },
  {
    "title": "Pope Francis' death from a stroke sets off global tributes and mourning",
    "description": "World leaders from U.S. President Donald Trump to Russian leader Vladimir Putin paid tribute to the pope's moral and spiritual leadership.",
    "link": "https://www.japantimes.co.jp/news/2025/04/22/world/pope-francis-death-reaction/",
    "timestamp": "2025-04-22T00:35:00Z"
  },
  {
    "title": "Have You Heard of This 'Dark Woke' Phenomenon?",
    "description": "Democrats are scrambling to craft new strategies to get back into power after their ignominious defeat in 2024. Folks on the left have finally decided to give up on identity politics and focus on solutions – okay, I can’t finish this sentence with a straight …",
    "link": "https://freerepublic.com/focus/f-bloggers/4312446/posts",
    "timestamp": "2025-04-22T00:33:55Z"
  },
  {
    "title": "Donald Trump's Trade War: JPMorgan Predicts Deals, Higher Taxes and Potential Recession Avoidance",
    "description": "JPMorgan (NYSE:JPM) has predicted that the ongoing tariff war initiated by President Donald Trump could lead to some agreements between the US and its trade ...",
    "link": "https://finance.yahoo.com/news/donald-trumps-trade-war-jpmorgan-003138895.html",
    "timestamp": "2025-04-22T00:31:38Z"
  },
  {
    "title": "'Not out of the woods': Hegseth may be doomed — even if Trump wants to keep him",
    "description": "President Donald Trump's administration has made clear they are still standing by Defense Secretary Pete Hegseth even as a new facet of the \"Signalgate\" scandal has been exposed — but ultimately, it might not even matter whether Trump wants to keep him, accor…",
    "link": "https://www.rawstory.com/pete-hegseth-2671816794/",
    "timestamp": "2025-04-22T00:31:09Z"
  },
  {
    "title": "The Mainstream Media’s Everlasting Love Affair with Joe Biden",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post The Mainstream Media’s Everlasting Love Affair with Joe Biden appeared …",
    "link": "https://www.dailysignal.com/2025/04/21/mainstream-medias-everlasting-love-affair-joe-biden/",
    "timestamp": "2025-04-22T00:30:12Z"
  },
  {
    "title": "'I Wanted It To Work': Ukrainians Disappointed By Easter Truce",
    "description": "Many Ukrainians felt let down by a 30-hour Easter truce announced by Russia, even if some welcomed a brief lull in fighting after more than three years of war.",
    "link": "https://www.ibtimes.com/i-wanted-it-work-ukrainians-disappointed-easter-truce-3770835",
    "timestamp": "2025-04-22T00:27:16Z"
  },
  {
    "title": "US Supreme Court to hear LGBTQ+ books in schools case",
    "description": "The Supreme Court in the US is set to hear a case on whether parents should be able to remove their children from schools when LGBTQ+ books are being discussed.  On Tuesday (22 April), the Supreme Court will hear the case relating to the issues of religion in…",
    "link": "https://www.thepinknews.com/2025/04/22/us-supreme-court-lgbtq-books-schools-case/",
    "timestamp": "2025-04-22T00:27:01Z"
  },
  {
    "title": "'Bigoted parents' poised to get 'floating veto' to censor teachers: expert",
    "description": "A Supreme Court showdown is brewing in the world of religious freedom that could hand over certain groups and individuals with a staggering set of new control powers over public education in the country, in a key test of the separation of church and state.Tha…",
    "link": "https://www.rawstory.com/supreme-court-2671816773/",
    "timestamp": "2025-04-22T00:24:42Z"
  },
  {
    "title": "Gold Surges to Record as Trump Ramps Up Threats on Fed’s Powell",
    "description": "Gold rose to an all-time-high, after concern that President Donald Trump could fire Federal Reserve Chair Jerome Powell triggered a flight from US stocks, bonds and the dollar.",
    "link": "https://financialpost.com/pmn/business-pmn/gold-surges-to-record-as-trump-ramps-up-threats-on-feds-powell",
    "timestamp": "2025-04-22T00:21:38Z"
  },
  {
    "title": "Gold hits record of US$3,500 in flight to haven but metrics show upswing could pause",
    "description": "Gold rose to an all-time-high, after concern that President Donald Trump could fire Federal Reserve Chair Jerome Powell triggered a flight from U.S. stocks, bonds and the dollar",
    "link": "https://financialpost.com/investing/gold-surges-to-record-as-trump-ramps-up-threats-on-feds-powell",
    "timestamp": "2025-04-22T00:21:38Z"
  },
  {
    "title": "Gold slides from $3,500 on profit booking after rally to record",
    "description": "Gold retreated after topping $3,500 an ounce for the first time as traders booked profit following a nearly 10% rally this month. Read more.",
    "link": "https://financialpost.com/investing/gold-slides-3500-profit-booking-rally-record",
    "timestamp": "2025-04-22T00:21:38Z"
  },
  {
    "title": "Harvard Sues Trump Over US Federal Funding Cuts",
    "description": "Harvard sued US President Donald Trump's administration Monday in a sharp escalation of the fight between the prestigious university and the Republican, who has threatened its funding and sought to impose outside political supervision.",
    "link": "https://www.ibtimes.com/harvard-sues-trump-over-us-federal-funding-cuts-3770833",
    "timestamp": "2025-04-22T00:21:17Z"
  },
  {
    "title": "Donald Trump Is ‘Looking Forward’ to Attending Pope Francis’ Funeral",
    "description": "President Donald Trump announced that he and First Lady Melania Trump are “looking forward” to attending Pope Francis’ funeral. “Melania and I will be going to the funeral of Pope Francis, in Rome,” the president, 78, wrote via Truth Social on Monday, April 2…",
    "link": "https://www.usmagazine.com/celebrity-news/news/donald-trump-and-melania-attending-pope-francis-funeral-in-rome/#article",
    "timestamp": "2025-04-22T00:19:01Z"
  },
  {
    "title": "Fox News’ Jessica Tarlov Says She Knows It’s Hard for Trump to Apologize Because She Has a Toddler | Video",
    "description": "\"I have a toddler and I know what it's like when their face is covered in chocolate and they say 'I didn't eat the cookies, I didn't eat the cookies Momma,'\" the host says\nThe post Fox News’ Jessica Tarlov Says She Knows It’s Hard for Trump to Apologize Becau…",
    "link": "https://www.thewrap.com/jessica-tarlov-donald-trump-toddler-kilmar-abrego-garcia-fox-news/",
    "timestamp": "2025-04-22T00:16:34Z"
  },
  {
    "title": "Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say",
    "description": "Police responded to the skyscraper where President Donald Trump keeps a penthouse.",
    "link": "https://www.bostonherald.com/2025/04/21/trump-tower-arrest/",
    "timestamp": "2025-04-22T00:14:36Z"
  },
  {
    "title": "US stocks, dollar tumble as Trump slams Fed’s Powell again",
    "description": "Wall Street stocks tumbled early on Monday amid lingering uncertainty over Donald Trump’s trade policy as the President slammed Federal Reserve chair Jerom",
    "link": "https://www.newstalkzb.co.nz/news/business/major-loser-us-stocks-dollar-tumble-as-trump-slams-fed-s-powell-again/",
    "timestamp": "2025-04-22T00:10:50Z"
  },
  {
    "title": "Rep. Jamie Raskin Vows Revenge On Foreign Leaders Who Work With Trump",
    "description": "Rep. Jamie Raskin (D-MD) has sunk to a new low, vowing political retribution against foreign leaders who dare to work with President Donald Trump in a stunning display of political pettiness and desperation. Rather than putting America first, Raskin is threat…",
    "link": "https://freerepublic.com/focus/f-news/4312439/posts",
    "timestamp": "2025-04-22T00:09:42Z"
  },
  {
    "title": "Wife of Bob Menendez convicted in bribery case",
    "description": "Nadine Menendez found guilty in her federal corruption trial, echoing the earlier conviction of her husband, ex-Sen. Bob Menendez. Prosecutors say the couple accepted bribes, including gold and a luxury car, in exchange for political favors.",
    "link": "https://www.israelnationalnews.com/news/407179",
    "timestamp": "2025-04-22T00:08:36Z"
  },
  {
    "title": "Control Illusions and the Era of Multipolar Geopolitics and the War of Gas…",
    "description": "Three weeks ago, we boldly decided to escape a world so drenched in misinformation it felt like we’d fallen into a Gogol fever dream. Instead of moustachioed bureaucrats chasing invisible papers, we got two penguins in bowties waddling into Bourbon & Nuuk Pub…",
    "link": "https://energycentral.com/c/og/control-illusions-and-era-multipolar-geopolitics-and-war-gas%E2%80%A6",
    "timestamp": "2025-04-22T00:05:41Z"
  },
  {
    "title": "Trump says he faces stricter rules than Biden on immigration",
    "description": "United States President Donald Trump criticized former President Joe Biden's immigration policies, accusing him of allowing \"millions of criminals\" into the country \"unchecked and u...",
    "link": "https://biztoc.com/x/1eb18e9dbe38efae",
    "timestamp": "2025-04-22T00:05:10Z"
  },
  {
    "title": "America’s auto jobs are not coming back",
    "description": "At the White House Rose Garden press conference with which he let loose this month’s whirlwind of tariffs, Donald Trump brought to the lectern a retired car industry worker from Detroit. Up came Brian Pannebecker of the United Auto Workers trade union. “I hav…",
    "link": "https://biztoc.com/x/4111d523ed5c4b4b",
    "timestamp": "2025-04-22T00:05:00Z"
  },
  {
    "title": "Watchdog sues Uber over subscription practices",
    "description": "The FTC accused Uber of charging people for its Uber One subscription service without getting their consent.",
    "link": "https://www.bbc.com/news/articles/c1drkq0dy07o",
    "timestamp": "2025-04-22T00:04:37Z"
  },
  {
    "title": "Australia Election: PM Albanese's Party Holds Slim Lead As Voting Begins",
    "description": "Early voting in the Australian election began on Tuesday, with Prime Minister Anthony Albanese&#039;s centre-left Labor party holding a slim lead over the conservative opposition coalition.",
    "link": "https://www.ndtv.com/world-news/australia-election-pm-anthony-albaneses-party-holds-slim-lead-as-voting-begins-8222670",
    "timestamp": "2025-04-22T00:02:56Z"
  },
  {
    "title": "Trump Endorses BOTH Candidates in Arizona Governor Race: ‘Either One Will Never Let You Down’",
    "description": "President Trump endorsed both Republican candidates in the 2026 AZ gubernatorial race, throwing his support behind Rep. Andy Biggs and Karrin Taylor Robson.\nThe post Trump Endorses BOTH Candidates in Arizona Governor Race: ‘Either One Will Never Let You Down’…",
    "link": "https://www.mediaite.com/politics/trump-endorses-both-candidates-in-arizona-governor-race-either-one-will-never-let-you-down/",
    "timestamp": "2025-04-22T00:00:20Z"
  },
  {
    "title": "Clients in wait and watch mode, will take a quarter to gauge impact of tariffs: Accenture",
    "description": "Accenture's Asia-Oceania CEO said the current uncertainty will provide a tailwind to AI-led transformation among companies. The company's India head said a new generation of coders will be needed who are prompt engineers.",
    "link": "https://www.livemint.com/companies/accenture-asia-pacific-india-businesses-it-services-spending-revenue-genai-wipro-infosys-tcs-11744888231114.html",
    "timestamp": "2025-04-22T00:00:09Z"
  },
  {
    "title": "NPR urges its stations to lobby members of Congress as Trump admin seeks to pull federal funding",
    "description": "NPR is sounding the alarm in a memo urging its member stations to contact their members of Congress as the Trump administration seeks to cut its federal funding.",
    "link": "https://www.foxnews.com/media/npr-urges-its-stations-lobby-members-congress-trump-admin-seeks-pull-federal-funding",
    "timestamp": "2025-04-22T00:00:07Z"
  },
  {
    "title": "Alphabet in talks to ramp up pixel production in India",
    "description": "Alphabet is in discussions with Dixon Technologies and Foxconn to shift Google Pixel smartphone production to India, particularly for US-bound devices, due to potential tariffs on Vietnam. The company aims to mitigate sourcing risks and is exploring localizin…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/alphabet-inc-shifts-google-pixel-production-from-vietnam-to-india-amid-us-tariff-concerns/articleshow/120501448.cms",
    "timestamp": "2025-04-22T00:00:00Z"
  },
  {
    "title": "Revitalizing American Institutions | March 2025",
    "description": "In the March 2025 edition of Inside RAI, The Center for Revitalizing American Institutions released a limited podcast series on civics education and hosted a daylong conference at Hoover on the same topic. The conference featured a discussion involving Gen. J…",
    "link": "https://www.hoover.org/news/revitalizing-american-institutions-march-2025",
    "timestamp": "2025-04-22T00:00:00Z"
  },
  {
    "title": "Alphabet Inc shifts Google Pixel production from Vietnam to India amid US tariff concerns",
    "description": "Alphabet is in discussions with Dixon Technologies and Foxconn to shift Google Pixel smartphone production to India, particularly for US-bound devices, due to potential tariffs on Vietnam. The company aims to mitigate sourcing risks and is exploring localizin…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/alphabet-inc-shifts-google-pixel-production-from-vietnam-to-india-amid-us-tariff-concerns/articleshow/120496733.cms",
    "timestamp": "2025-04-22T00:00:00Z"
  },
  {
    "title": "Revitalizing American Institutions | February 2025",
    "description": "In the February 2025 edition of Inside RAI, The Center for Revitalizing American Institutions launches a new limited podcast series to foster civics education excellence. Senior Fellow Morris P. Fiorina applies the lessons learned from his Unstable Majorities…",
    "link": "https://www.hoover.org/news/revitalizing-american-institutions-february-2025",
    "timestamp": "2025-04-22T00:00:00Z"
  },
  {
    "title": "Marjorie Taylor Greene says ‘Evil is being defeated by the hand of God,’ hours after Pope’s passing",
    "description": "While it remains unclear if the post was specifically targeting Pope Francis, Greene has been a longtime critic of the Catholic church after leaving the religion years ago.",
    "link": "https://www.wsbtv.com/news/local/atlanta/marjorie-taylor-greene-says-evil-is-being-defeated-by-hand-god-hours-after-popes-passing/6MH2AHRGFFGO5NSP73H7VCH2SI/",
    "timestamp": "2025-04-21T23:56:32Z"
  },
  {
    "title": "'At least 5 votes': Unlikely pair of Supreme Court justices look ready to save Obamacare",
    "description": "Americans recently celebrated the 15th anniversary of the Affordable Care Act — former President Barack Obama's landmark healthcare reform legislation known as \"Obamacare\" — being signed into law. And two Supreme Court justices appear poised to protect it in …",
    "link": "https://www.rawstory.com/obamacare-2671816786/",
    "timestamp": "2025-04-21T23:55:07Z"
  },
  {
    "title": "Trump Announces Pope Francis Funeral Plans, Melania Also Confirmed",
    "description": "Trump posted on Truth Social, \"Melania and I will be going to the funeral of Pope Francis, in Rome. We look forward to being there!\"",
    "link": "https://www.westernjournal.com/trump-announces-pope-francis-funeral-plans-melania-also-confirmed/",
    "timestamp": "2025-04-21T23:51:53Z"
  },
  {
    "title": "Pro-crypto Paul Atkins officially sworn in as SEC Chairman",
    "description": "Atkins' leadership may signal a shift towards more crypto-friendly policies, potentially impacting market regulations and investor protections.\nThe post Pro-crypto Paul Atkins officially sworn in as SEC Chairman appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/pro-bitcoin-sec-chair/",
    "timestamp": "2025-04-21T23:51:51Z"
  },
  {
    "title": "Trump Reveals Plans to Attend Pope Francis’s Funeral",
    "description": "President Donald Trump announced that he and First Lady Melania Trump would be attending Pope Francis’s funeral after the Vatican announced early Monday that the Pope had died at the age of 88. “Melania and I will be going to the funeral of Pope Francis, in R…",
    "link": "https://freerepublic.com/focus/f-news/4312435/posts",
    "timestamp": "2025-04-21T23:51:33Z"
  },
  {
    "title": "Trump's shadow looms large over Australian and Canadian elections",
    "description": "Recent polls have shown the opposition leaders in Australia and Canada moving from a strong position to become election underdogs in recent months. There's one major contributing factor.",
    "link": "https://www.abc.net.au/news/2025-04-22/donald-trump-affecting-opposition-in-canada-and-australia/105196740",
    "timestamp": "2025-04-21T23:50:00Z"
  },
  {
    "title": "U.S. assets slump again as Trump sharpens attack on Fed chief",
    "description": "Trump called Jerome Powell a 'loser' for not cutting interest rates, underscoring questions about whether the U.S. President will try to fire Powell.",
    "link": "https://www.japantimes.co.jp/business/2025/04/22/economy/us-assets-trump-fed-chief/",
    "timestamp": "2025-04-21T23:47:00Z"
  },
  {
    "title": "DEI Hire Pete Hegseth Is Getting Fried On X Following Latest Security Lapse On Signal",
    "description": "Pete Hegseth, is embroiled in another scandal after details surfaced on Sunday of another Signal chat sharing sensitive information.",
    "link": "https://hiphopwired.com/playlist/pete-hegseth-signal-scandal-reactions/",
    "timestamp": "2025-04-21T23:44:18Z"
  },
  {
    "title": "U.S. Derivatives Watchdog Weighs 24/7 Action With Crypto Oversight on Horizon",
    "description": "The Commodity Futures Trading Commission has opened a public-comment period for around-the-clock derivatives activity, as seen in the digital assets space.",
    "link": "https://www.coindesk.com/policy/2025/04/21/u-s-derivatives-watchdog-weighs-24-7-action-with-crypto-oversight-on-horizon",
    "timestamp": "2025-04-21T23:43:10Z"
  },
  {
    "title": "Puerto Rico government demands answers from Luma after island-wide blackout",
    "description": "The company has five days to explain why a transmission line failed.",
    "link": "https://www.bostonherald.com/2025/04/21/puerto-rico-blackout-luma/",
    "timestamp": "2025-04-21T23:40:40Z"
  },
  {
    "title": "Sebastian Stan Got Marvel Role After Manager Said the Only Thing Saving His Career Was ‘$65,000 in Residuals’ from ‘Hot Tub Time Machine’",
    "description": "Sebastian Stan revealed in a new cover story for Vanity Fair that his acting career was more or less on life support when he landed the role of Bucky Barnes in 2011’s “Captain America: The First Avenger.” The role changed Stan’s career. Not only has he stayed…",
    "link": "https://variety.com/2025/film/news/sebastian-stan-marvel-offer-hot-tub-time-machine-residuals-1236374290/",
    "timestamp": "2025-04-21T23:38:19Z"
  },
  {
    "title": "Superior Culture, Inferior Culture?",
    "description": "So my general read is, Cambodian Khmer culture is far superior to much of American culture. First, I think the biggest critique I have about American culture is that we are slaves to consumerism capitalism. I am myself find myself victim to this. For example,…",
    "link": "https://erickimphotography.com/blog/2025/04/21/superior-culture-inferior-culture/",
    "timestamp": "2025-04-21T23:38:08Z"
  },
  {
    "title": "NYPD never publicly stated Trump was 5 feet, 10 inches tall and weighed 287 pounds",
    "description": "The New York Police Department publicly confirmed that U.S. President Donald Trump is 5 feet, 10 inches tall and weighs 287 pounds.",
    "link": "https://www.snopes.com//fact-check/trump-weight-height-nypd/",
    "timestamp": "2025-04-21T23:36:00Z"
  },
  {
    "title": "Pope Francis, who led with humility, dies at 88",
    "description": "Pope Francis, history's first Latin American pontiff who charmed the world with his humble style and concern for the poor but alienated conservatives with critiques of capitalism and climate change, died Monday. He was 88.",
    "link": "https://www.bostonherald.com/2025/04/21/pope-francis-who-led-with-humility-dies-at-88/",
    "timestamp": "2025-04-21T23:31:58Z"
  },
  {
    "title": "Investors Expect Secondhand Stores to Profit as Tariffs Challenge Retailers",
    "description": "Investors reportedly expect new U.S. tariffs to be good for sellers of secondhand goods. In the time since the White House announced tariffs on April 2, the shares of two such firms — ThredUp and Savers Value Village — have gone up 31% and 22%, respectively, …",
    "link": "https://www.pymnts.com/news/retail/2025/investors-expect-secondhand-stores-to-profit-as-tariffs-challenge-retailers/",
    "timestamp": "2025-04-21T23:31:55Z"
  },
  {
    "title": "Trump’s tirade against Fed chair Powell roils markets as investors question endgame",
    "description": "U.S. President Donald Trump roiled markets by reigniting his public tirade against Federal Reserve chair Jerome Powell, sending everything from the U.S. dollar to U.S. stocks lower as investors weigh the President’s willingness to sever the central bank’s lon…",
    "link": "https://biztoc.com/x/d883bbccc9fc5c65",
    "timestamp": "2025-04-21T23:31:49Z"
  },
  {
    "title": "Student loans in default to be referred to debt collection, Education Department says",
    "description": "The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.",
    "link": "https://www.news4jax.com/business/2025/04/21/student-loans-in-default-to-be-referred-to-debt-collection-education-department-says/",
    "timestamp": "2025-04-21T23:30:32Z"
  },
  {
    "title": "Pope Francis’ death puts major choice before his church",
    "description": "With the death of Pope Francis, not only will the church mourn a beloved leader — it must also confront a major choice.",
    "link": "https://nypost.com/2025/04/21/opinion/death-of-pope-francis-puts-major-choice-before-his-church/",
    "timestamp": "2025-04-21T23:26:50Z"
  },
  {
    "title": "This is the man, Kilmar Abrego Garcia, that the Courts are trying to save from being deported?",
    "description": "He was supposed to be, according to the Judge and the Democrats, a wonderful father from Maryland, but then they noticed he had “MS-13” tattooed onto his knuckles (and lots of really bad stories about his past!). This is the gang that is, perhaps, the worst o…",
    "link": "https://freerepublic.com/focus/f-news/4312431/posts",
    "timestamp": "2025-04-21T23:24:38Z"
  },
  {
    "title": "Trump Reveals Plans to Attend Pope Francis's Funeral",
    "description": "President Donald Trump announced that he and First Lady Melania Trump would be attending Pope Francis's funeral after the Vatican announced early Monday that the Pope had died at the age of 88.\nThe post Trump Reveals Plans to Attend Pope Francis’s Funeral app…",
    "link": "https://www.breitbart.com/europe/2025/04/21/trump-reveals-plans-to-attend-pope-francis-funeral/",
    "timestamp": "2025-04-21T23:24:17Z"
  },
  {
    "title": "Early voting in Australia election begins, PM Albanese's party holds slender lead",
    "description": "SYDNEY (Reuters) - Early voting in the Australian election began on Tuesday, with Prime Minister Anthony Albanese's centre-left Labor party holding a slim lead over the conservative opposition coalition. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/22/early-voting-in-australia-election-begins-pm-albanese039s-party-holds-slender-lead",
    "timestamp": "2025-04-21T23:23:00Z"
  },
  {
    "title": "With the FCC Scrutinizing DEI Policies, CBS Settles in Anti-White Discrimination Case",
    "description": "CBS Studios will settle a case brought by a script coordinator who accused the company of using illegal racial quotas to discriminate against straight white men.\nThe post With the FCC Scrutinizing DEI Policies, CBS Settles in Anti-White Discrimination Case ap…",
    "link": "https://freebeacon.com/latest-news/with-the-fcc-scrutinizing-dei-policies-cbs-settles-in-anti-white-discrimination-case/",
    "timestamp": "2025-04-21T23:22:53Z"
  },
  {
    "title": "'Wonderful champions!' Trump gives full-throated endorsement to 2 candidates in same race",
    "description": "President Donald Trump made two endorsements for the same race in a post to his Truth Social platform on Monday evening — giving the nod to two separate politicians for governor of Arizona.\"I like Karrin Taylor Robson of Arizona a lot, and when she asked me t…",
    "link": "https://www.rawstory.com/trump-arizona-2671816725/",
    "timestamp": "2025-04-21T23:22:17Z"
  },
  {
    "title": "Harvard University Sues Trump Over US Federal Funding Cuts",
    "description": "Harvard sued US President Donald Trump&#039;s administration Monday in a sharp escalation of the fight between the prestigious university and the Republican, who has threatened its funding and sought to impose outside political supervision.",
    "link": "https://www.ndtv.com/world-news/harvard-university-sues-trump-over-us-federal-funding-cuts-8222552",
    "timestamp": "2025-04-21T23:22:11Z"
  },
  {
    "title": "U.S. Congressman Backtracks On Social Media Post Claiming He Fired Weapons At Nuclear-Armed Russia",
    "description": "The post leaves little room for interpretation. It sure looks like a sitting U.S. congressman fired shots into Russia, ratcheting up tensions.",
    "link": "https://thefederalist.com/2025/04/21/u-s-congressman-backtracks-on-social-media-post-claiming-he-fired-weapons-at-nuclear-armed-russia/",
    "timestamp": "2025-04-21T23:21:57Z"
  },
  {
    "title": "Why Trump’s Auto Tariffs Are Set to Raise Car Prices",
    "description": "President Donald Trump is betting that a 25% tariff on imports of vehicles and automotive parts will bring more manufacturing to US shores.\nBut realizing that ambition rests on a major overhaul of the globally integrated supply chains the auto industry has sp…",
    "link": "https://biztoc.com/x/9594515e89874147",
    "timestamp": "2025-04-21T23:20:52Z"
  },
  {
    "title": "Trump needs to end his war with Jerome Powell now — one way or another",
    "description": "On Monday, furious over Jerome Powell's refusal to budge on lower interest rates, President Trump took to TruthSocial to call the Fed chair a \"major loser,\" the latest in a series of increasingly heated barbs.",
    "link": "https://nypost.com/2025/04/21/opinion/trump-needs-to-end-his-war-with-jerome-powell-now-one-way-or-another/",
    "timestamp": "2025-04-21T23:19:24Z"
  },
  {
    "title": "Trump: US can't give every person it wants to deport a trial",
    "description": "US President Donald Trump said to give everyone a trial \"would take, without exaggeration, 200 years.\" Lawyers for Venezuelan migrants demand to give migrants 30 days' notice before deporting them.",
    "link": "https://www.dw.com/en/trump-us-cant-give-every-person-it-wants-to-deport-a-trial/a-72304947",
    "timestamp": "2025-04-21T23:18:00Z"
  },
  {
    "title": "Canada's top candidates talk up fossil fuels as climate slips down agenda",
    "description": "Amid tariff threats from the US, energy and economic security are at the forefront Canada's federal election.",
    "link": "https://www.bbc.com/news/articles/c87pev3jpyyo",
    "timestamp": "2025-04-21T23:16:49Z"
  },
  {
    "title": "Commander Suspended After Trump, Vance, Hegseth Removed from Chain-of-Command Board",
    "description": "The Army confirmed the removal of the commander of a post where pictures of Donald Trump and Pete Hegseth were not on display.",
    "link": "https://www.westernjournal.com/commander-suspended-trump-vance-hegseth-removed-chain-command-board/",
    "timestamp": "2025-04-21T23:16:40Z"
  },
  {
    "title": "Thailand faces hit from US-China trade war",
    "description": "Economists are voicing concerns over escalating tension between the US and China, saying Thailand cannot avoid the indirect repercussions of global trade uncertainty that could strain the country's export and supply chain.",
    "link": "https://www.bangkokpost.com/business/general/3008099/thailand-faces-hit-from-us-china-trade-war",
    "timestamp": "2025-04-21T23:16:00Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures climb as Trump escalates tensions with the Fed",
    "description": "US stock futures traded flat after a bruising day on Wall Street, marked by renewed criticism of Federal Reserve Chair Jerome Powell by President Trump.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-climb-as-trump-escalates-tensions-with-the-fed-231542763.html",
    "timestamp": "2025-04-21T23:15:42Z"
  },
  {
    "title": "Reports: Trump Successfully Gets Illegal Aliens to Self-Deport from U.S.",
    "description": "President Donald Trump's crackdown on illegal immigration is successfully getting illegal aliens to self-deport from the United States, a concept once mocked by the establishment media.\nThe post Reports: Trump Successfully Gets Illegal Aliens to Self-Deport f…",
    "link": "https://www.breitbart.com/politics/2025/04/21/reports-trump-successfully-gets-illegal-aliens-to-self-deport-from-u-s/",
    "timestamp": "2025-04-21T23:13:20Z"
  },
  {
    "title": "Thai rice exports fall 30% as Trump tariff fears grow",
    "description": "Rice exports dropped by 30% year-on-year in the first quarter to 2.1 million tonnes, an industry association said.",
    "link": "https://www.bangkokpost.com/business/general/3008084/thai-rice-exports-fall-30-as-trump-tariff-fears-grow",
    "timestamp": "2025-04-21T23:13:00Z"
  },
  {
    "title": "5 million student loan borrowers face mandatory collections starting May 5",
    "description": "Some 5 million Americans with defaulted student loan payments will have their loans sent for collections on May 5, the Department of Education announced on Monday.",
    "link": "https://abcnews.go.com/Politics/5-million-student-loan-borrowers-face-mandatory-collections/story?id=121031631",
    "timestamp": "2025-04-21T23:12:01Z"
  },
  {
    "title": "'Stymied at every turn!' Trump whines that Supreme Court 'intimidated' by 'radical' Dems",
    "description": "President Donald Trump railed against the Supreme Court on Monday, which he said has \"stymied\" him at \"every turn.\" The Supreme Court recently temporarily blocked the Trump administration from deporting Venezuelan migrants under the Alien Enemies Act. The hig…",
    "link": "https://www.rawstory.com/trump-deportation-2671816738/",
    "timestamp": "2025-04-21T23:10:43Z"
  },
  {
    "title": "Harvard University sues to block Trump from slashing billions in research funding",
    "description": "Harvard University sued on Monday (Apr 21) to block US President Donald Trump from freezing billions of dollars in federal funding after the elite research institution rejected a list of White House demands that it said would undermine its independence. The l…",
    "link": "https://www.channelnewsasia.com/world/harvard-university-sues-block-donald-trump-slash-billions-research-funding-5079671",
    "timestamp": "2025-04-21T23:10:33Z"
  },
  {
    "title": "DHL makes drastic change to deliveries amid U.S.-China trade war",
    "description": ", one of the largest courier services that U.S. consumers depend on for mail and package deliveries, is responding to President Donald Trump's recent policy changes, which shook the nation.\nOn April 2, Trump announced a 10% \"baseline\" tariff on all countries …",
    "link": "https://biztoc.com/x/36e299f64e7b5b6d",
    "timestamp": "2025-04-21T23:09:30Z"
  },
  {
    "title": "Jim Cramer on how Trump's stance on China harms Nvidia and Apple",
    "description": "CNBC's Jim Cramer on Monday opined on why it's currently hard to hold on to two of his favorite stocks, Nvidia and Apple.",
    "link": "https://www.cnbc.com/2025/04/21/jim-cramer-how-trumps-china-stance-harms-nvidia-and-apple.html",
    "timestamp": "2025-04-21T23:08:27Z"
  },
  {
    "title": "Larry David’s “My Dinner With Hitler” Essay Pokes Fun At Bill Maher’s White House Meal With Trump",
    "description": "It’s fairly clear what prompted Larry David’s satirical essay today for the New York Times entitled “My Dinner With Hitler.” “Eventually I concluded that hate gets us nowhere,” writes David of his fictional meeting with the Führer. “I knew I couldn’t change h…",
    "link": "http://deadline.com/2025/04/larry-david-bill-maher-trump-dinner-hitler-1236373338/",
    "timestamp": "2025-04-21T23:07:40Z"
  },
  {
    "title": "Harvard University sues to block Trump from slashing billions in research funding",
    "description": "Harvard alleges the Trump administration's actions were arbitrary and unlawful and violated the university's First Amendment rights to free speech",
    "link": "https://www.haaretz.com/israel-news/2025-04-22/ty-article/harvard-university-sues-trump-administration-media-reports-say/00000196-5a92-d653-a196-db9a2ac40000",
    "timestamp": "2025-04-21T23:07:15Z"
  },
  {
    "title": "This market downturn is 'manufactured' and unrelated to earnings, Jim Cramer says",
    "description": "CNBC's Jim Cramer on Monday suggested the market losing streak is \"manufactured\" and unrelated to the strength of companies' earnings.",
    "link": "https://www.cnbc.com/2025/04/21/market-downturn-is-manufactured-unrelated-to-earnings-jim-cramer-says-.html",
    "timestamp": "2025-04-21T23:06:35Z"
  }
]