[
  {
    "title": "Iran halts planned executions as Gulf allies avert Trump strike — US",
    "description": "The US reports Iran has halted 800 executions of protesters following pressure from President Trump and diplomatic efforts from Gulf allies.\n\nRead More: https://punchng.com/iran-halts-planned-executions-as-gulf-allies-avert-trump-strike-us/",
    "link": "https://punchng.com/iran-halts-planned-executions-as-gulf-allies-avert-trump-strike-us/",
    "timestamp": "2026-01-15T18:31:32Z"
  },
  {
    "title": "US lawmakers demand action from SEC on Justin Sun enforcement case",
    "description": "Three House Democrats warned that leaving the SEC's case against the Tron founder unresolved could ”undermine investors’ confidence” in the financial regulator.",
    "link": "https://cointelegraph.com/news/us-lawmakers-sec-justin-sun-case",
    "timestamp": "2026-01-15T18:30:52Z"
  },
  {
    "title": "The Dogbert Puppet From the Lost ‘Dilbert’ Live-Action TV Show Is Haunting",
    "description": "\"I think they spent upwards of $20, $25 on it,\" Scott Adams complained in 1999.",
    "link": "https://gizmodo.com/the-dogbert-puppet-from-the-lost-dilbert-live-action-tv-show-is-haunting-2000710684",
    "timestamp": "2026-01-15T18:30:18Z"
  },
  {
    "title": "Donald Trump Caught Awkwardly Snubbing Pal RFK Jr. During Cringeworthy Moment On Live TV",
    "description": "The president didn't take the health secretary's hand when he reached out for a handshake before discussing the bill.",
    "link": "https://radaronline.com/p/donald-trump-snubs-robert-f-kennedy-jr-school-milk-bill-awkward-moment-video/",
    "timestamp": "2026-01-15T18:30:04Z"
  },
  {
    "title": "Is Tony Dokoupil’s ‘CBS Evening News’ Overhaul Worth the Trouble?",
    "description": "Plus, \"Live with Kelly and Mark\" notches a season-best performance and Packers-Bears game sets new NFL streaming record\nThe post Is Tony Dokoupil’s ‘CBS Evening News’ Overhaul Worth the Trouble? appeared first on TheWrap.",
    "link": "https://www.thewrap.com/commentary-analysis/columns/tony-dokoupils-cbs-evening-news-overhaul-ratings/",
    "timestamp": "2026-01-15T18:30:00Z"
  },
  {
    "title": "How can parents claim the $1,000 Trump Account when filing 2025 taxes — here’s who qualifies for the federal seed benefit",
    "description": "Parents filing 2025 taxes can now open a Trump Account for children. The IRS allows a $1,000 federal seed contribution using Form 4547. Eligible kids under 18 gain tax-deferred investment access, early-use flexibility, and long-term financial growth, as Washi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/how-can-parents-claim-the-1000-trump-account-when-filing-2025-taxes-heres-who-qualifies-for-the-federal-seed-benefit/articleshow/126550139.cms",
    "timestamp": "2026-01-15T18:29:55Z"
  },
  {
    "title": "‘Law & Order’ Star Chris Meloni Compares ICE to Nazis, Calls Trump ‘Pedophile’ in Unhinged Rants",
    "description": "\"Law & Order\" star Chris Meloni has compared U.S. immigration agents to Nazis and without evidence called President Donald Trump a \"pedophile\" in a series of unhinged social media rants.\nThe post ‘Law & Order’ Star Chris Meloni Compares ICE to Nazis, Calls Tr…",
    "link": "https://www.breitbart.com/entertainment/2026/01/15/law-order-star-chris-meloni-compares-ice-to-nazis-calls-trump-pedophile-in-unhinged-rants/",
    "timestamp": "2026-01-15T18:28:42Z"
  },
  {
    "title": "Pam Bondi Visibly Furious At Prosecutors Who Reportedly Quit Rather Than Probe ICE Shooting Victim's Widow",
    "description": "“They want to be part of the resistance? Yeah, bring it on,” the U.S. attorney general said.",
    "link": "https://www.huffpost.com/entry/pam-bondi-prosecutors-quit-renee-good_n_69690cb5e4b0774cc19f404a",
    "timestamp": "2026-01-15T18:27:43Z"
  },
  {
    "title": "Hochul won’t rule out tax hikes if re-elected as questions swirl over universal child care funding",
    "description": "Gov. Kathy Hochul wouldn’t rule out future income tax hikes in the Empire State on Tuesday – as questions swirl over how the state will fund its promised universal child care program.",
    "link": "https://nypost.com/2026/01/15/us-news/hochul-wont-rule-out-tax-hikes-after-election-as-questions-swirl-over-universal-child-care-funding/",
    "timestamp": "2026-01-15T18:26:27Z"
  },
  {
    "title": "Trump Asks Congress to Pass New Health Care Affordability Plan",
    "description": "The plan includes key Trump initiatives, such as reduced prescription drug prices and price transparency for providers.",
    "link": "https://www.theepochtimes.com/us/trump-asks-congress-to-pass-new-health-care-affordability-plan-5971553",
    "timestamp": "2026-01-15T18:25:29Z"
  },
  {
    "title": "10% of US House members have announced they’re not running for reelection, an AP analysis shows",
    "description": "A record number of seats are up for grabs at this point in the cycle.",
    "link": "https://www.bostonherald.com/2026/01/15/congressional-retirements/",
    "timestamp": "2026-01-15T18:23:07Z"
  },
  {
    "title": "Four Arab states urged against US-Iran escalation, official says",
    "description": "Four Arab states, including Saudi Arabia, Qatar, Oman, and Egypt, engaged in intense diplomacy with the U.S. and Iran to avert a threatened U.S. attack. They warned Washington of regional security and economic repercussions, while urging Iran to avoid retalia…",
    "link": "https://economictimes.indiatimes.com/news/defence/four-arab-states-urged-against-us-iran-escalation-official-says/articleshow/126551570.cms",
    "timestamp": "2026-01-15T18:22:56Z"
  },
  {
    "title": "Most Americans say 'no' to Greenland takeover, with even Republicans split: poll",
    "description": "New polls show 86% of Americans oppose military action to take Greenland as Trump intensifies push for U.S. control of the strategic Arctic territory.",
    "link": "https://www.foxnews.com/politics/most-americans-say-no-greenland-takeover-even-republicans-split-poll",
    "timestamp": "2026-01-15T18:21:14Z"
  },
  {
    "title": "Venezuela: Machado presents Trump her Nobel Peace Prize",
    "description": "Sidelined by Trump, Venezuelan opposition leader Maria Corina Machado visited Washington, while interim President Delcy Rodriguez has called for \"diplomacy\" with the US, and aims to attract more oil investment.",
    "link": "https://www.dw.com/en/venezuela-machado-presents-trump-her-nobel-peace-prize/a-75526772",
    "timestamp": "2026-01-15T18:21:00Z"
  },
  {
    "title": "Venezuela: Trump meets Machado as US seizes oil tanker",
    "description": "US forces in the Caribbean have seized a 6th sacntioned oil tanker with ties to Venezuela as sidelined opposition leader Maria Corina Machado is visiting the White House.",
    "link": "https://www.dw.com/en/venezuela-trump-meets-machado-as-us-seizes-oil-tanker/a-75526772",
    "timestamp": "2026-01-15T18:21:00Z"
  },
  {
    "title": "NATO Makes Teensy Deployments To Greenland As Trump Presses For Control",
    "description": "Several European NATO countries are sending small contingents of military personnel to Greenland this week for joint exercises with Denmark.",
    "link": "https://dailycaller.com/2026/01/15/nato-makes-teensy-deployments-to-greenland-as-trump-presses-for-control/",
    "timestamp": "2026-01-15T18:20:02Z"
  },
  {
    "title": "Michigan Gov. Gretchen Whitmer warns of worsening auto industry under Trump's tariff strategy (Isabella Volmert/Associated Press)",
    "description": "Isabella Volmert / Associated Press:\nMichigan Gov. Gretchen Whitmer warns of worsening auto industry under Trump's tariff strategy  —  Michigan Gov. Gretchen Whitmer offered a contrasting view of manufacturing in Detroit, just days after President Donald Trum…",
    "link": "https://www.memeorandum.com/260115/p77",
    "timestamp": "2026-01-15T18:20:01Z"
  },
  {
    "title": "For decades, he kept Netanyahu's deepest secrets. Now he tells all",
    "description": "Gabi Picker was Benjamin Netanyahu's intimate confidant and go-to man for special tasks – the kind that had to be hidden from Sara. Until now, he kept it all to himself. He's no longer willing to stay silent",
    "link": "https://www.haaretz.com/israel-news/2026-01-15/ty-article-magazine/.highlight/for-decades-he-kept-netanyahus-deepest-secrets-now-he-tells-all/0000019b-c183-d85c-a9fb-f1c779440000",
    "timestamp": "2026-01-15T18:18:03Z"
  },
  {
    "title": "Trump Releases ‘Great Healthcare Plan’ to Lower Drug Prices, Premiums",
    "description": "\"You're going to get a better deal and better care. We will have maximum price transparency, and costs will come down incredibly.\"\nThe post Trump Releases ‘Great Healthcare Plan’ to Lower Drug Prices, Premiums first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/trump-releases-great-healthcare-plan-to-lower-drug-prices-premiums/",
    "timestamp": "2026-01-15T18:15:55Z"
  },
  {
    "title": "Watch Live: Karoline Leavitt Holds White House Press Conference",
    "description": "Trump Press Secretary Karoline Leavitt speaks with reporters at the White House on Thursday, January 15.\nThe post Watch Live: Karoline Leavitt Holds White House Press Conference appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/15/watch-live-karoline-leavitt-holds-white-house-press-conference-4/",
    "timestamp": "2026-01-15T18:15:04Z"
  },
  {
    "title": "75% of Americans oppose US attempting to take control of Greenland, CNN poll finds (CNN)",
    "description": "CNN:\n75% of Americans oppose US attempting to take control of Greenland, CNN poll finds  —  South America Election polls Donald Trump  —  Three-quarters of Americans say they oppose the United States attempting to take control of Greenland, according to a new…",
    "link": "https://www.memeorandum.com/260115/p76",
    "timestamp": "2026-01-15T18:15:00Z"
  },
  {
    "title": "Trump's health care plan promises direct payments, but it needs Congress’ approval",
    "description": "The Trump administration announced a health care plan aimed at lowering costs for patients. The announcements comes as Obamacare open enrollment ends in most states.",
    "link": "https://www.nbcnews.com/health/health-news/trump-health-care-plan-direct-payments-obamacare-congress-rcna254232",
    "timestamp": "2026-01-15T18:13:55Z"
  },
  {
    "title": "Faulty Assumptions About Iran Have Driven a Failed U.S. Policy",
    "description": "Believing that the clerical regime could be pragmatic was a mistake.",
    "link": "http://foreignpolicy.com/2026/01/15/faulty-assumptions-about-iran-have-driven-a-failed-u-s-policy/",
    "timestamp": "2026-01-15T18:12:00Z"
  },
  {
    "title": "Renee Good Was a Casualty of Trump's Order Against 'Political Violence'",
    "description": "The administration's written policies make it likely that more people like Renee Good will be targets, and victims, of ICE.",
    "link": "https://reason.com/2026/01/15/renee-good-was-a-casualty-of-trumps-order-against-political-violence/",
    "timestamp": "2026-01-15T18:10:06Z"
  },
  {
    "title": "Trump announces outlines of health care plan he wants Congress to consider (Associated Press)",
    "description": "Associated Press:\nTrump announces outlines of health care plan he wants Congress to consider  —  President Donald Trump on Thursday announced the outlines of a health care plan he wants Congress to take up as Republicans have faced increasing pressure to addr…",
    "link": "https://www.memeorandum.com/260115/p75",
    "timestamp": "2026-01-15T18:10:05Z"
  },
  {
    "title": "ICE Official Resigns To Challenge Swing-District Democrat",
    "description": "Madison Sheahan, the agency's No. 2 official, resigned Thursday to challenge Democratic Rep. Marcy Kaptur in Ohio.",
    "link": "https://www.huffpost.com/entry/trump-ice-official-congress-ohio_n_69690f30e4b0774cc19f41fd",
    "timestamp": "2026-01-15T18:08:42Z"
  },
  {
    "title": "What happens if Trump is impeached again - will he be removed from office? Here are the scenarios",
    "description": "Talk of Donald Trump impeachment has returned after new corruption claims by Democrats. Any impeachment must start in the House, where Democrats currently lack numbers. Even if Trump is impeached again, removal is very hard because the Senate needs a two-thir…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-happens-if-trump-is-impeached-again-will-he-be-removed-from-office-here-are-the-scenarios/articleshow/126551037.cms",
    "timestamp": "2026-01-15T18:07:51Z"
  },
  {
    "title": "Tim Walz Urges Minnesotans to 'Resist' Federal 'Occupation'",
    "description": "Minnesota Gov. Tim Walz is pouring \"fuel on the fire\" in Minnesota by calling on \"radical leftists to RESIST and HARASS federal law enforcement,\" a social media site for House Republicans declared. \nThe post Tim Walz Urges Minnesotans to ‘Resist’ Federal ‘Occ…",
    "link": "https://www.breitbart.com/crime/2026/01/15/tim-walz-urges-minnesotans-to-resist-federal-occupation/",
    "timestamp": "2026-01-15T18:07:37Z"
  },
  {
    "title": "Venezuelan Opposition Leader María Corina Machado Arrives At White House For Trump Meeting",
    "description": "Machado won the Nobel Peace Prize Trump has publicly said he believes he deserved.",
    "link": "https://www.forbes.com/sites/saradorn/2026/01/15/venezuelan-opposition-leader-mara-corina-machado-arrives-at-white-house-for-trump-meeting/",
    "timestamp": "2026-01-15T18:07:31Z"
  },
  {
    "title": "With Tie-Breaking Vote From Vance, Senate Kills Venezuela War Powers Resolution",
    "description": "“Trump is turning the Caribbean into a dangerous powder keg — and Congress must rein him in,” said Chuck Schumer.",
    "link": "https://www.newsfromthestates.com/article/war-powers-resolution-fails-us-senate-after-2-republicans-flip-vance-breaks-tie",
    "timestamp": "2026-01-15T18:06:34Z"
  },
  {
    "title": "Exiled crown prince’s plan for Iran is mostly aimed at Trump, experts say",
    "description": "Exiled Crown Prince Reza Pahlavi has outlined his vision for a democratic Iran on social media. His plan includes ending a pursuit of nuclear weapons, confronting drug trafficking, and recognizing Israel. Experts say his proposals, which were expressed in Eng…",
    "link": "https://apnews.com/article/iran-protests-reza-pahlavi-trump-shah-63348442feefaaf1cdd7fffc142b2062",
    "timestamp": "2026-01-15T18:06:11Z"
  },
  {
    "title": "Ominous Sign? New Army Recruitment Ads Say 'Visit Lovely Greenland'",
    "description": "U.S. — In yet another potentially ominous sign that President Donald Trump was dead-set on the United States acquiring the territory for strategic and national security purposes, new U.S. Army recruitment ads offered prospective enlistees the opportunity to &…",
    "link": "https://babylonbee.com/news/ominous-sign-new-army-recruitment-ads-say-visit-lovely-greenland",
    "timestamp": "2026-01-15T18:05:41Z"
  },
  {
    "title": "Resisting An Occupation",
    "description": "They are flailing. Donald Trump is doing what he does in his rally speeches – tossing things at the wall to see what gets the best reaction. Recently that reaction is escaping him. His polling is underwater everywhere. He is losing in the courts. So he wants …",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/resisting-an-occupation",
    "timestamp": "2026-01-15T18:02:30Z"
  },
  {
    "title": "Cuba pays tribute to soldiers killed in Maduro capture",
    "description": "Cuba paid tribute on Thursday to 32 soldiers killed in the US military strike that ousted Venezuelan leader Nicolas Maduro, in a ceremony attended by revolutionary leader Raul Castro. Havana, under pressure from US President Donald Trump, had decreed two days…",
    "link": "https://www.digitaljournal.com/world/cuba-pays-tribute-to-soldiers-killed-in-maduro-capture/article",
    "timestamp": "2026-01-15T18:02:20Z"
  },
  {
    "title": "Two Republican Senators Traveling to Denmark to Assure NATO Trump Won’t Take Greenland",
    "description": "Trump’s ongoing threats to acquire Greenland by anymeans necessary have led to strong division within his own party and anger across Europe.\nThe post Two Republican Senators Traveling to Denmark to Assure NATO Trump Won’t Take Greenland first appeared on Medi…",
    "link": "https://www.mediaite.com/politics/two-republican-senators-traveling-to-denmark-to-assure-nato-trump-wont-take-greenland/",
    "timestamp": "2026-01-15T18:02:06Z"
  },
  {
    "title": "Mexico says trade pact with US will survive despite Trump’s skepticism",
    "description": "By Emily Green and Raul CortesMEXICO CITY, Jan 15 (Reuters) - Amid persistent doubts over the future of the U.S.-Mexico-Canada trade pact, Mexico’s Economy Minister Marce… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/15/mexico-says-trade-pact-with-us-will-survive-despite-trump-s-skepticism",
    "timestamp": "2026-01-15T18:02:03Z"
  },
  {
    "title": "Elon Musk Turns Off Grok AI's Ability to Generate Sexualized Images of Real People After Global Backlash",
    "description": "Elon Musk's Grok AI chatbot will no longer allow users to sexualize images of real people by portraying their targets in revealing clothing, the company announced Wednesday evening, following global criticism over the tool's usage as a \"nudify\" app to portray…",
    "link": "https://www.breitbart.com/tech/2026/01/15/elon-musk-turns-off-grok-ais-ability-to-generate-sexualized-images-of-real-people-after-global-backlash/",
    "timestamp": "2026-01-15T18:01:52Z"
  },
  {
    "title": "Trump threatens to use Insurrection Act in Minnesota in response to Ice protests",
    "description": "Protests continue across state and governor urges peace one week after federal agent shot and killed Renee Good",
    "link": "https://www.irishtimes.com/world/us/2026/01/15/trump-threatens-to-use-insurrection-act-in-minnesota-in-response-to-ice-protests/",
    "timestamp": "2026-01-15T18:01:06Z"
  },
  {
    "title": "Trump Threatens to Invoke Insurrection Act in Minnesota",
    "description": "President Donald Trump has threatened to invoke the Insurrection Act in response to ongoing protests over ICE activity in the state of Minnesota.",
    "link": "https://www.tmz.com/2026/01/15/trump-threatens-action-in-minnesota/",
    "timestamp": "2026-01-15T18:00:35Z"
  },
  {
    "title": "Dana White names 2 huge stars that likely won’t be at UFC White House",
    "description": "Dana White might not have Conor McGregor or Jon Jones at White House event",
    "link": "https://www.mmafighting.com/ufc/466431/dana-white-conor-mcgregor-vs-michael-chandler-wont-happen-at-ufc-white-house",
    "timestamp": "2026-01-15T18:00:00Z"
  },
  {
    "title": "Why China Is Unlikely to Rush to Iran’s Defense",
    "description": "As Iran’s clerical rulers face one of the biggest threats to their grip on power in years and the United States threatens potential military action in support of Iranian protesters, China has few options -- and growing hesitancy -- to help its partner in Tehr…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/Why-China-Is-Unlikely-to-Rush-to-Irans-Defense.html",
    "timestamp": "2026-01-15T18:00:00Z"
  },
  {
    "title": "'Treason': Elon Musk urges imprisonment of educators accurately teaching US history",
    "description": "Self-proclaimed “free speech absolutist” Elon Musk believes schoolteachers should be “imprisoned” for educating students on topics that portray America negatively—including the nation’s history of racism and the displacement of Native Americans.The world’s ri…",
    "link": "https://www.rawstory.com/treason-elon-musk-urges-imprisonment-of-educators-accurately-teaching-us-history/",
    "timestamp": "2026-01-15T17:59:29Z"
  },
  {
    "title": "A Federal Agent Shot Another Person in Minneapolis. Then Trump Threatened the Insurrection Act.",
    "description": "The Trump administration’s offensive against immigrants in Minneapolis—and those who seek to help them—continued to intensify Wednesday night and into Thursday after a federal agent shot another person during an immigration operation.  President Donald Trump,…",
    "link": "https://www.motherjones.com/politics/2026/01/ice-dhs-shooting-protests-minneapolis-insurrection-act/",
    "timestamp": "2026-01-15T17:58:04Z"
  },
  {
    "title": "‘Treason!’ Republican Calls for Arrest of Minneapolis Mayor",
    "description": "Randy Fine said that Minneapolis mayor Jacob Frey (D) was promoting civil war following Frey's latest appeal to protesters battling ICE presence.\nThe post ‘Treason!’ Republican Calls for Arrest of Minneapolis Mayor first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/treason-republican-calls-for-arrest-of-minneapolis-mayor/",
    "timestamp": "2026-01-15T17:58:00Z"
  },
  {
    "title": "Iran’s nationwide protests appear increasingly smothered after crackdown and internet outage",
    "description": "A bloody crackdown killed at least 2,637 people, activists say.",
    "link": "https://www.denverpost.com/2026/01/15/iran-protests-smothered/",
    "timestamp": "2026-01-15T17:57:38Z"
  },
  {
    "title": "Iran’s nationwide protests appear increasingly smothered after crackdown and internet outage",
    "description": "A bloody crackdown killed at least 2,637 people, activists say.",
    "link": "https://www.bostonherald.com/2026/01/15/iran-protests-smothered/",
    "timestamp": "2026-01-15T17:57:38Z"
  },
  {
    "title": "Whitmer warns Trump's tariff strategy aids China in Detroit Auto Show speech",
    "description": "In a tale of two speeches, Michigan Gov. Gretchen Whitmer has offered a rebuttal to President Donald Trump's defense of his tariff policies, made just days before by the president in Detroit. While speaking at the Detroit Auto Show, she critiqued his strong-a…",
    "link": "https://apnews.com/article/michigan-governor-gretchen-whitmer-tariff-speech-detroit-fc06ef9c7f0918b94d3ef42cbc604e16",
    "timestamp": "2026-01-15T17:56:37Z"
  },
  {
    "title": "Abduction of Maduro an act of war – Venezuelan attorney general (VIDEO)",
    "description": "The US attack on Venezuela and abduction of President Nicolas Maduro is an act of war, Attorney General Tarek William Saab has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631005-us-maduro-abduction-venezuela/",
    "timestamp": "2026-01-15T17:56:23Z"
  },
  {
    "title": "Trump unveils health care plan aimed at lowering costs",
    "description": "By Tami Luhby, CNN (CNN) — President Donald Trump unveiled a multipart proposal on Thursday aimed at lowering prescription drug prices and reducing health insurance premiums, as well as increasing price transparency within the health care system. The White Ho…",
    "link": "https://abc17news.com/politics/national-politics/cnn-us-politics/2026/01/15/trump-unveils-health-care-plan-aimed-at-lowering-costs/",
    "timestamp": "2026-01-15T17:56:15Z"
  },
  {
    "title": "Iranian protestors hold Trump assassination attempt photo, chant 'death to America,' state media shows",
    "description": "Iranian protesters reportedly displayed signs calling for President Donald Trump's assassination, chanting 'death to America' at Tehran University.",
    "link": "https://www.foxnews.com/politics/iranian-protestors-hold-trump-assassination-attempt-photo-chant-death-america-state-media-shows",
    "timestamp": "2026-01-15T17:55:22Z"
  },
  {
    "title": "‘Daily Show’ Calls Out Trump’s Hypocrisy Over Minnesota and Iran Protests: ‘I Don’t Know What’s More Terrifying’ | Video",
    "description": "\"None of this had to happen if Donald Trump treated Americans with respect for their inherent rights,\" host Jordan Klepper says\nThe post  ‘Daily Show’ Calls Out Trump’s Hypocrisy Over Minnesota and Iran Protests: ‘I Don’t Know What’s More Terrifying’ | Video …",
    "link": "https://www.thewrap.com/media-platforms/politics/daily-show-trump-double-standard-iran-minnesota-protesters-ice-video/",
    "timestamp": "2026-01-15T17:54:52Z"
  },
  {
    "title": "Why American Big Oil isn’t buying the Venezuela ‘victory’",
    "description": "Despite all the effort and fanfare, the kidnapping of Maduro wasn’t quite the regime change expected – and top energy executives know this Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631011-us-venezuela-oil-victory/",
    "timestamp": "2026-01-15T17:50:56Z"
  },
  {
    "title": "New York offshore wind project to resume construction after judge lifts Trump suspension",
    "description": "Equinor, the Norwegian company developing the project, said it \"will now focus on safely restarting construction activities.\"",
    "link": "https://www.cnbc.com/2026/01/15/judge-allows-equinor-empire-wind-construction-trump.html",
    "timestamp": "2026-01-15T17:50:40Z"
  },
  {
    "title": "LGBTQ+ Americans are going back in the closet under Donald Trump: report",
    "description": "LGBTQ+ people are going back into the closet during Donald Trump's second term as queer visibility decreases across the board, new research has found.",
    "link": "https://www.advocate.com/news/lgbtq-safety-coming-out-trump",
    "timestamp": "2026-01-15T17:50:16Z"
  },
  {
    "title": "US fascism is killing art",
    "description": "Funding cuts and censorship are hitting US art institutions hard, while the Trump administration pushes its own brand of right-wing slop – are we seeing, in the words of Guillermo del Toro, a ‘prelude to fascism’?",
    "link": "https://www.dazeddigital.com/art-photography/article/69424/1/decline-art-america-warning-sign-of-fascism-on-the-rise-donald-trump-museums?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=us-fascism-is-killing-art",
    "timestamp": "2026-01-15T17:50:00Z"
  },
  {
    "title": "Goldman Sachs, Morgan Stanley see double-digit profit jumps amid surging stock market",
    "description": "Goldman Sachs and Morgan Stanley have reported strong profits in the fourth quarter, driven by a surging stock market and increased deal making",
    "link": "https://abcnews.go.com/Business/wireStory/goldman-sachs-morgan-stanley-double-digit-profit-jumps-129248415",
    "timestamp": "2026-01-15T17:49:55Z"
  },
  {
    "title": "Trump Suggests U.S. ‘Shouldn’t Even Have’ November Midterms",
    "description": "The president previously claimed he’d be impeached if Republicans lose control of Congress.",
    "link": "https://www.forbes.com/sites/alisondurkee/2026/01/15/trump-suggests-us-shouldnt-even-have-november-midterms/",
    "timestamp": "2026-01-15T17:49:51Z"
  },
  {
    "title": "Texas Poll Shows Tough Primary for Cornyn and Crockett",
    "description": "A new poll on the Texas Senate primaries reveals incumbent Sen. John Cornyn, R-Texas, is facing tough Republican competition, and Democrat Rep. Jasmine Crockett’s path... Read More\nThe post Texas Poll Shows Tough Primary for Cornyn and Crockett appeared first…",
    "link": "https://www.dailysignal.com/2026/01/15/texas-poll-shows-tough-primary-for-cornyn-and-crockett/",
    "timestamp": "2026-01-15T17:48:59Z"
  },
  {
    "title": "Donald Trump threatens to bring in 219-year-old law following ICE controversy",
    "description": "Donald Trump has threatened to use the Insurrection Act, amid protests against Immigration and Customs Enforcement (ICE) in Minnesota.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-insurrection-act-threats-ice-protests-916560-20260115",
    "timestamp": "2026-01-15T17:48:20Z"
  },
  {
    "title": "Judge hands offshore wind another victory against Trump, clearing way for NY project",
    "description": "A federal judge has cleared the way for a New York offshore wind project to resume construction",
    "link": "https://abcnews.go.com/US/wireStory/judge-hands-offshore-wind-industry-victory-trump-clearing-129246885",
    "timestamp": "2026-01-15T17:47:22Z"
  },
  {
    "title": "UN chief’s last annual speech slams world leaders for lack of cooperation",
    "description": "Antonio Guterres appears to take aim at the US, which recently slashed its contribution, telling UN to 'adapt or die'.",
    "link": "https://www.aljazeera.com/news/2026/1/15/uns-guterres-slams-world-leaders-putting-intl-cooperation-on-deathwatch",
    "timestamp": "2026-01-15T17:45:44Z"
  },
  {
    "title": "Washington Post reporter's home searched in leak probe",
    "description": "Press freedom advocates are concerned this week's raid on a Washington Post journalist's home will deter reporting on government actions and silence whistleblowers.",
    "link": "https://www.wcvb.com/article/washington-post-journalist-home-search/70011587",
    "timestamp": "2026-01-15T17:45:17Z"
  },
  {
    "title": "Control of the House is at the center of midterms. These charts help explain the fight",
    "description": "Republicans hold a narrow majority that they've tried to insure with gerrymandering.",
    "link": "https://www.bostonherald.com/2026/01/15/election-2026-house-explained/",
    "timestamp": "2026-01-15T17:44:58Z"
  },
  {
    "title": "‘Classic tactic of the swamp’: 81 Republicans vote with Dems to fund slush fund that targeted conservatives",
    "description": "House rejects effort to strip $315 billion from so-called 'democracy promotion programs'",
    "link": "https://www.wnd.com/2026/01/classic-tactic-swamp-81-republicans-vote-dems-fund/",
    "timestamp": "2026-01-15T17:42:38Z"
  },
  {
    "title": "European troops arrive in Greenland as talks with US highlight 'disagreement' over island's future",
    "description": "European nations are sending troops to Greenland in a show of support for Denmark amid \"fundamental disagreement\" with the U.S. over the Arctic island's future. Denmark is increasing its military presence, while France, Germany, and others deploy symbolic tro…",
    "link": "https://economictimes.indiatimes.com/news/defence/european-troops-arrive-in-greenland-as-talks-with-us-highlight-disagreement-over-islands-future/articleshow/126550850.cms",
    "timestamp": "2026-01-15T17:41:44Z"
  },
  {
    "title": "Nicolle Wallace Calls Out Joe Rogan's Take On ICE Operations As 'Both Sides' Bulls**t",
    "description": "The podcaster said he can \"see both perspectives\" of President Donald Trump sending federal immigration agents to Minnesota.",
    "link": "https://www.huffpost.com/entry/nicolle-wallace-joe-rogan-both-sides_n_6968ef58e4b0774cc19f33c2",
    "timestamp": "2026-01-15T17:40:33Z"
  },
  {
    "title": "Trump Tells Reuters ‘We Shouldn’t Even Have an Election’ Ahead of Midterms",
    "description": "President Donald Trump managed expectations for the upcoming midterm elections, acknowledging he's frustrated with the potential of Republicans losing.\nThe post Trump Tells Reuters ‘We Shouldn’t Even Have an Election’ Ahead of Midterms first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/trump-tells-reuters-we-shouldnt-even-have-an-election-ahead-of-midterms/",
    "timestamp": "2026-01-15T17:40:29Z"
  },
  {
    "title": "US 30-year fixed-rate mortgage drops to near 3-1/2-year low of 6.06%",
    "description": "mortgage rates fell significantly this week after the Trump ​administration initiated purchases of mortgage-backed securities to ‌boost housing affordability....",
    "link": "https://finance.yahoo.com/news/us-30-fixed-rate-mortgage-174010604.html",
    "timestamp": "2026-01-15T17:40:10Z"
  },
  {
    "title": "Lawmakers propose $2.5B agency to boost production of rare earths and other critical minerals",
    "description": "The U.S. is under pressure to cut its dependence on China, after a trade truce last year.",
    "link": "https://www.bostonherald.com/2026/01/15/congress-critical-minerals/",
    "timestamp": "2026-01-15T17:37:31Z"
  },
  {
    "title": "Immigration officials fired shots in 17 incidents in Trump's second term",
    "description": "Immigration officials fired shots in 17 incidents in Trump's second termwmur.com",
    "link": "https://www.wmur.com/article/ice-immigration-shots-fired-data/70009978",
    "timestamp": "2026-01-15T17:35:47Z"
  },
  {
    "title": "Judge clears way for New York offshore wind project, handing industry another victory against Trump",
    "description": "District Judge Carl J. Nichols, an appointee of President Donald Trump, faulted the government for not responding to key points in Empire Wind's court filings, including the contention that the administration violated proper procedure.",
    "link": "https://www.pbs.org/newshour/nation/judge-clears-way-for-new-york-offshore-wind-project-handing-industry-another-victory-against-trump",
    "timestamp": "2026-01-15T17:35:17Z"
  },
  {
    "title": "Trump threatens to invoke Insurrection Act, deploy military to Minnesota (Jacob Knutson/Democracy Docket)",
    "description": "Jacob Knutson / Democracy Docket:\nTrump threatens to invoke Insurrection Act, deploy military to Minnesota  —  President Donald Trump has threatened to invoke the Insurrection Act and send the military to Minnesota to put down protests against Immigration and…",
    "link": "https://www.memeorandum.com/260115/p66",
    "timestamp": "2026-01-15T17:35:00Z"
  },
  {
    "title": "US sanctions Khamenei aide, other Iranian officials over protest crackdown",
    "description": "New penalties come as Trump welcomes purported Iranian decision to halt execution of antigovernment demonstrators.",
    "link": "https://www.aljazeera.com/news/2026/1/15/us-sanctions-khamenei-aide-other-iranian-officials-over-protest-crackdown",
    "timestamp": "2026-01-15T17:34:23Z"
  },
  {
    "title": "Immigration officials fired shots in 17 incidents in Trump's second term",
    "description": "Immigration officials fired shots in 17 incidents in Trump's second termkoco.com",
    "link": "https://www.koco.com/article/ice-immigration-shots-fired-data/70009978",
    "timestamp": "2026-01-15T17:33:22Z"
  },
  {
    "title": "Top Doctor Calls for Trump, 79, to Be Evaluated After Struggling to Keep His Eyes Open",
    "description": "Dr. Jonathan Reiner, who served as Vice President Dick Cheney’s cardiologist, flagged Trump’s newest drowsy Oval Office moment as a concern.",
    "link": "https://www.thedailybeast.com/top-doctor-calls-for-trump-79-to-be-evaluated-after-struggling-to-keep-his-eyes-open/",
    "timestamp": "2026-01-15T17:33:15Z"
  },
  {
    "title": "Authorities Identify Venezuelan Migrant Shot In Minneapolis By Federal Law Enforcement",
    "description": "Julio Cesar Sosa-Celis was shot and injured as federal law enforcement attempted to arrest him during a “targeted traffic stop,” DHS said.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2026/01/15/authorities-identify-venezuelan-migrant-shot-in-minneapolis-by-federal-law-enforcement/",
    "timestamp": "2026-01-15T17:32:26Z"
  },
  {
    "title": "Trump Adviser Makes Shocking Claim About $3 Meal for Americans, Including 'a Piece of Broccoli' & a Single Tortilla",
    "description": "Donald Trump‘s Secretary of Agriculture laid out a shocking meal that she said Americans could prepare at home for only $3. Speaking to NewsNation on Wednesday (January 14), Secretary Brooke Rollins was asked about the new food pyramid that Trump‘s administra…",
    "link": "https://www.justjared.com/2026/01/15/trump-adviser-makes-shocking-claim-about-3-meal-for-americans-brooke-rollin/",
    "timestamp": "2026-01-15T17:31:49Z"
  },
  {
    "title": "What is the US Insurrection Act threatened on Minnesota?",
    "description": "A look at the US Insurrection Act, the law that President Trump has threatened to use to put an end to protests over federal immigration raids in the northern state of Minnesota.",
    "link": "https://www.rte.ie/news/us/2026/0115/1553335-us-insurrection-act/",
    "timestamp": "2026-01-15T17:31:00Z"
  },
  {
    "title": "House Democrats demand probe into Trump DOJ's criminal investigation of Fed Chair Powell",
    "description": "House Democrats demand a probe into the Trump administration's criminal investigation of Fed Chairman Jerome Powell over his testimony and central bank independence.",
    "link": "https://www.foxnews.com/politics/house-democrats-demand-probe-trump-dojs-criminal-investigation-fed-chair-powell",
    "timestamp": "2026-01-15T17:30:43Z"
  },
  {
    "title": "Linda Hasenfratz: Here’s how Canada can balance U.S. and China trade",
    "description": "Canada is caught between trade negotiations with the world’s two largest economies — the U.S. and China — but there are solutions. Read on.",
    "link": "https://financialpost.com/news/economy/canada-balance-us-china-trade",
    "timestamp": "2026-01-15T17:29:08Z"
  },
  {
    "title": "George Santos Slams ‘Piece of Sh*t’ Snitches and Suggests He Had ‘Plenty of Reasons to Talk’",
    "description": "George Santos slammed \"piece of s**t\" snitches, including Tekashi 6ix9ine, and suggested he avoided squealing behind bars despite \"plenty of reasons to talk.\"\nThe post George Santos Slams ‘Piece of Sh*t’ Snitches and Suggests He Had ‘Plenty of Reasons to Talk…",
    "link": "https://www.mediaite.com/media/podcasts/george-santos-slams-piece-of-sht-snitches-and-suggests-he-had-plenty-of-reasons-to-talk/",
    "timestamp": "2026-01-15T17:26:39Z"
  },
  {
    "title": "Venezuela Calls Trump a Liar: Top Henchman Says Country Has No Political Prisoners",
    "description": "Venezuelan Interior Minister — and long-suspected drug lord — Diosdado Cabello claimed Wednesday the nation's socialist regime does not have political prisoners, but instead lucky criminals who are being given \"another opportunity\" by the regime.\nThe post Ven…",
    "link": "https://www.breitbart.com/latin-america/2026/01/15/venezuela-calls-trump-a-liar-top-henchman-says-country-has-no-political-prisoners/",
    "timestamp": "2026-01-15T17:21:32Z"
  },
  {
    "title": "Trump unveils health-care plan outline as Congress wrestles over Obamacare subsidies",
    "description": "Trump urged Congress, which is grappling over an extension of key ACA tax credits, to pass \"The Great Healthcare Plan\" without delay.",
    "link": "https://www.cnbc.com/2026/01/15/trump-congress-aca-subsidies-health-care.html",
    "timestamp": "2026-01-15T17:19:00Z"
  },
  {
    "title": "Equinor Wins Ruling to Resume Wind Project Halted by Trump",
    "description": "A US judge ruled Equinor ASA can resume building its multibillion-dollar wind project near New York, marking the second time this week a federal court has blocked the Trump administration from enforcing a halt on offshore developments.",
    "link": "https://financialpost.com/pmn/business-pmn/equinor-wins-ruling-to-resume-wind-project-halted-by-trump",
    "timestamp": "2026-01-15T17:17:51Z"
  },
  {
    "title": "Canada’s Carney hails improving ties with China",
    "description": "Carney is on a four-day trip to China, the first by a Canadian PM since 2017, in a move to thaw tense relations.",
    "link": "https://www.aljazeera.com/economy/2026/1/15/canadas-carney-hails-improving-ties-with-china",
    "timestamp": "2026-01-15T17:17:37Z"
  },
  {
    "title": "Socialist Minnesota City Council Member Complains About Jacob Frey, Police Chief Wanting To Calm Things Down",
    "description": "A Democratic Socialist city council member in Minnesota complained that Democratic members in her state are calling on anti-ICE protests to remain peaceful.",
    "link": "https://dailycaller.com/2026/01/15/socialist-minnesota-city-council-member-complains-jacob-frey-police-chief-protests/",
    "timestamp": "2026-01-15T17:16:24Z"
  },
  {
    "title": "Fundraisers for worker whom Trump flipped off near $1 million",
    "description": "A former Ford employee who was suspended for heckling President Donald Trump is set to receive at least $810,000 from fundraisers.",
    "link": "https://www.washingtonexaminer.com/news/house/4419955/fundraisers-detroit-worker-trump-flipped-off-nears-1-million/",
    "timestamp": "2026-01-15T17:15:23Z"
  },
  {
    "title": "Nato Arctic defence needed against Russia - Cooper",
    "description": "She called on allies to \"double down\" and unite around the shared threat of Russian aggression.",
    "link": "https://www.bbc.com/news/articles/c3ve3dy676wo",
    "timestamp": "2026-01-15T17:15:10Z"
  },
  {
    "title": "Trump says exiled Iranian prince 'seems very nice,' doubts whether he has backing to lead the country",
    "description": "President Donald Trump expresses uncertainty about exiled Iranian crown prince's potential leadership role, saying \"I don't know how he'd play\" in future Iran.",
    "link": "https://www.foxnews.com/politics/trump-says-exiled-iranian-prince-seems-very-nice-doubts-whether-he-has-backing-lead-country",
    "timestamp": "2026-01-15T17:14:29Z"
  },
  {
    "title": "Stop attacking ICE: Trump warns Minnesota officials there’s a federal Insurrection Act",
    "description": "Calls on 'corrupt politicians' to stop the 'professional agitators and insurrectionists'",
    "link": "https://www.wnd.com/2026/01/stop-attacking-ice-trump-warns-minnesota-officials-theres/",
    "timestamp": "2026-01-15T17:12:44Z"
  },
  {
    "title": "Trump announces outlines of health care plan he wants Congress to consider",
    "description": "The White House said Trump's plan would codify his efforts to lower drug prices by tying prices to the lowest price paid by other countries.",
    "link": "https://www.detroitnews.com/story/news/politics/2026/01/15/trump-announces-outlines-of-health-care-plan-he-wants-congress-to-consider/88197450007/",
    "timestamp": "2026-01-15T17:10:59Z"
  },
  {
    "title": "Federal judges allow California to use new U.S. House map ahead of 2026 midterms",
    "description": "The ruling is a victory for Democrats in the state-by-state mid-decade redistricting battle that could help determine which party wins control of the U.S. House in 2026.",
    "link": "https://www.pbs.org/newshour/politics/federal-judges-allow-california-to-use-new-u-s-house-map-ahead-of-2026-midterms",
    "timestamp": "2026-01-15T17:10:04Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Calls on Congress to Enact (The White House)",
    "description": "The White House:\nFact Sheet: President Donald J. Trump Calls on Congress to Enact  —  The Great Healthcare Plan  —  CALLING ON CONGRESS TO LOWER HEALTHCARE COSTS: Today, President Donald J. Trump called on Congress to enact the Great Healthcare Plan, a compre…",
    "link": "https://www.memeorandum.com/260115/p62",
    "timestamp": "2026-01-15T17:10:02Z"
  },
  {
    "title": "Jeffries Bashes CBS News: 'Is This Lindell TV?",
    "description": "Democratic House leader Hakeem Jeffries told the Jim Acosta Show that watching CBS News both sides the January 6 insurrection was akin to MAGA propaganda like Mike Lindell TV, Newsmax and Fox News.\nIn a 20 minute interview, Jeffries touched on many topics, bu…",
    "link": "https://crooksandliars.com/2026/01/hakeem-jeffries-bashes-cbs-news-lindell-tv",
    "timestamp": "2026-01-15T17:08:59Z"
  },
  {
    "title": "Cost estimates vary, even as Denmark says Greenland is not for sale",
    "description": "President Donald Trump's plans to acquire Greenland could cost U.S. taxpayers up front and over the long term. Denmark's leaders have said the semi-autonomous Danish territory isn't for sale. So have Greenland's leaders, who depend on fishing and subsidies fr…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362291/posts",
    "timestamp": "2026-01-15T17:08:50Z"
  },
  {
    "title": "Alyssa Farah Griffin Warns of ‘Tremendous Clashes’ if Trump Takes ‘Extreme Step’ of Invoking the Insurrection Act",
    "description": "Alyssa Farah Griffin warned of dire repercussions in Minneapolis if Donald Trump makes good on his threat to invoke the Insurrection Act to quell protests.\nThe post Alyssa Farah Griffin Warns of ‘Tremendous Clashes’ if Trump Takes ‘Extreme Step’ of Invoking t…",
    "link": "https://www.mediaite.com/media/news/alyssa-farah-griffin-warns-of-tremendous-clashes-if-trump-takes-extreme-step-of-invoking-the-insurrection-act/",
    "timestamp": "2026-01-15T17:08:39Z"
  },
  {
    "title": "Trump announces outlines of health care plan he wants Congress to consider",
    "description": "President Donald Trump has announced the outlines of a health care plan he wants Congress to take up.",
    "link": "https://www.news4jax.com/business/2026/01/15/trump-announces-outlines-of-health-care-plan-he-wants-congress-to-consider/",
    "timestamp": "2026-01-15T17:08:10Z"
  }
]