[
  {
    "title": "Gov. Walz compares ICE to the Gestapo, Trump admin calls remarks 'dangerous'",
    "description": "The Department of Homeland Security is calling out Governor Tim Walz after the governor made comments comparing ICE to the Gestapo while speaking to law school graduates over the weekend.",
    "link": "https://www.fox9.com/news/gov-walz-compares-ice-gestapo-trump-admin-calls-remarks-dangerous",
    "timestamp": "2025-05-20T16:26:13Z"
  },
  {
    "title": "Friends without benefits: How the long running Trump Putin bromance is still not delivering",
    "description": "President Donald Trump's phone call with Russia’s Vladimir Putin did not achieve great strides on ending the war in Ukraine",
    "link": "https://www.nbcnews.com/world/russia/trump-putin-russia-ukraine-war-ceasefire-talks-zelenskyy-turkey-rcna207903",
    "timestamp": "2025-05-20T16:25:35Z"
  },
  {
    "title": "I've Been Tracking Tariff Price Impacts Every Day and Here's What I've Found So Far",
    "description": "CNET is keeping track of the daily price movements of products vulnerable to Donald Trump's tariff policies.",
    "link": "https://www.cnet.com/tech/ive-been-tracking-tariff-price-impacts-every-day-and-heres-what-ive-found-so-far/",
    "timestamp": "2025-05-20T16:25:00Z"
  },
  {
    "title": "Tron founder Justin Sun says he's the top $TRUMP meme coin holder",
    "description": "Chinese-born crypto billionaire Justin Sun says he’s now the top holder of the Trump-themed $TRUMP meme token — securing him a seat at a private dinner with the president.",
    "link": "https://www.cnbc.com/2025/05/20/justin-sun-trump-dinner.html",
    "timestamp": "2025-05-20T16:24:02Z"
  },
  {
    "title": "Trump Reversed His NY Wind Farm Stance After Hochul Agreed to Pipelines",
    "description": "The Trump administration is allowing construction to resume on a $5 billion wind farm off Long Island after reaching a deal with New York Governor Kathy Hochul that could allow new natural gas pipelines to be built in the state.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-reversed-his-ny-wind-farm-stance-after-hochul-agreed-to-pipelines",
    "timestamp": "2025-05-20T16:23:29Z"
  },
  {
    "title": "Massie unmoved on Trump's 'big, beautiful bill' after president's personal pitch",
    "description": "President Donald Trump called Rep. Thomas Massie a “grandstander” during his visit to the Capitol Tuesday morning to whip support for his “big, beautiful bill,” after previously calling for other Republicans to wage primary challenges against the Kentucky Rep…",
    "link": "https://biztoc.com/x/26c652bfbf08f01c",
    "timestamp": "2025-05-20T16:22:45Z"
  },
  {
    "title": "Honda pulls back on EV strategy for now and will push hybrid sales",
    "description": "The maker of Civic and Accord car models will be more aggressive in producing hybrids.",
    "link": "https://www.bostonherald.com/2025/05/20/japan-honda-ev-strategy/",
    "timestamp": "2025-05-20T16:22:39Z"
  },
  {
    "title": "Trump Hands Putin a Win With Retreat From Ukraine Peace Talks",
    "description": "President Donald Trump's phone call with Vladimir Putin revealed that Trump is no longer pushing for a ceasefire in Ukraine and is not threatening new sanctions on Russia. European leaders are disappointed and fear that Trump is disengaging from diplomatic ef…",
    "link": "https://biztoc.com/x/0a1cb9593a62a185",
    "timestamp": "2025-05-20T16:22:35Z"
  },
  {
    "title": "What We Know About the Charges Against LaMonica McIver",
    "description": "Federal officials have filed charges against New Jersey congresswoman LaMonica McIver, alleging that she assaulted federal agents during an ICE facility scuffle earlier this month.",
    "link": "http://nymag.com/intelligencer/article/rep-lamonica-mciver-charged-for-alleged-ice-assault.html",
    "timestamp": "2025-05-20T16:22:26Z"
  },
  {
    "title": "Trump Admin Clarifies: Only WHITE Anti-Semites Will Be Granted Asylum In This Country",
    "description": "For years, the DHS has been expanding its intrusive surveillance of anyone attempting to enter this country. (It has also expanded this to include people leaving the country.) The current onboarding procedure for US entry includes demands for account password…",
    "link": "https://www.techdirt.com/2025/05/20/trump-admin-clarifies-only-white-anti-semites-will-be-granted-asylum-in-this-country/",
    "timestamp": "2025-05-20T16:22:20Z"
  },
  {
    "title": "Rubio warns Syria may be weeks from collapse and civil war",
    "description": "US Secretary of State Marco Rubio tells lawmakers that Syria’s fragile transitional government is on the verge of collapse, potentially plunging the country into a full-scale civil war and territorial split.",
    "link": "https://www.israelnationalnews.com/news/408679",
    "timestamp": "2025-05-20T16:22:00Z"
  },
  {
    "title": "Joe Scarborough Constantly Invokes Trump’s Name As He Rambles On For 3 Minutes Defending His ‘Best Biden Ever’ Comment",
    "description": "Joe Scarborough ranted for three minutes in an effort to defend his viral March 2024 claim that Joe Biden was \"the best Biden ever.\"",
    "link": "https://dailycaller.com/2025/05/20/joe-scarborough-invokes-trumps-name-defending-biden-ever-comment/",
    "timestamp": "2025-05-20T16:18:31Z"
  },
  {
    "title": "Tariffs choke off China's smartphone exports to the US, hitting a 14-year low",
    "description": "Latest data shows that Trump tariffs have significantly decreased China's smartphone shipments to the United States. Read more...",
    "link": "https://www.neowin.net/news/tariffs-choke-off-chinas-smartphone-exports-to-the-us-hitting-a-14-year-low/",
    "timestamp": "2025-05-20T16:18:02Z"
  },
  {
    "title": "Trump DOJ said to pay $5M to family of Jan. 6 rioter",
    "description": "The US will pay a hefty sum to the family of Capitol rioter Ashli Babbitt, who was fatally shot on January 6",
    "link": "https://theweek.com/politics/ashli-babbitt-jan-6-settlement",
    "timestamp": "2025-05-20T16:16:50Z"
  },
  {
    "title": "Recent spy scandals reveal how western allies are increasingly unreliable friends",
    "description": "Spying is getting easier as the technology needed gets cheaper and cheaper.",
    "link": "https://theconversation.com/recent-spy-scandals-reveal-how-western-allies-are-increasingly-unreliable-friends-256353",
    "timestamp": "2025-05-20T16:16:49Z"
  },
  {
    "title": "The success of DOGE depends on Congress and the Executive Branch, Elon Musk says",
    "description": "At the Qatar Economic Forum, Musk praised DOGE's work while also emphasizing that their cuts will also require buy-in from the legislative branch.",
    "link": "https://www.businessinsider.com/elon-musk-doge-congress-executive-branch-progress-2025-5",
    "timestamp": "2025-05-20T16:16:31Z"
  },
  {
    "title": "Home Depot says it doesn’t expect to boost prices because of tariffs",
    "description": "Other companies have warned that price hikes are inevitable due to the U.S. trade war.",
    "link": "https://www.bostonherald.com/2025/05/20/home-depot-results/",
    "timestamp": "2025-05-20T16:16:07Z"
  },
  {
    "title": "'60 Minutes' Reportedly Under Increased Scrutiny As Network Mulls Settlement With Trump",
    "description": "CBS News CEO Wendy McMahon was the second top executive to step down in recent weeks amid the network's effort to strike a deal with the president.",
    "link": "https://www.huffpost.com/entry/cbs-leadership-tensions-60-minutes_n_682c882de4b095274fad804a",
    "timestamp": "2025-05-20T16:16:04Z"
  },
  {
    "title": "Russia’s Two Minds on Ukraine",
    "description": "Now that Russia has the upper hand on the battlefield in Ukraine, it is well-positioned to secure a highly favorable agreement to end the fighting – an outcome that most of its population would welcome. So, why is the Kremlin showing no willingness to negotia…",
    "link": "https://www.project-syndicate.org/commentary/russia-is-conflicted-over-whether-to-end-the-war-in-ukraine-by-nina-l-khrushcheva-2025-05",
    "timestamp": "2025-05-20T16:15:59Z"
  },
  {
    "title": "WATCH: Crowd Erupts in Cheers as Teenage Girl Takes a Bold Stand After Finishing Second to Transgender (Bio Male) at California High School Track and Field Meet",
    "description": "A female California high school athlete who had her glory stolen from her by a boy dressing up as a girl made sure to let the world know who deserved the glory.\nThe post WATCH: Crowd Erupts in Cheers as Teenage Girl Takes a Bold Stand After Finishing Second t…",
    "link": "https://www.thegatewaypundit.com/2025/05/watch-crowd-erupts-cheers-as-teenage-girl-takes/",
    "timestamp": "2025-05-20T16:15:39Z"
  },
  {
    "title": "Elon Musk’s Far-Right Tendencies Exposed By His AI Bot",
    "description": "Grok, the AI chatbot created by Elon Musk, was busted sharing claims of \"white genocide\" to users on X, formerly Twitter.",
    "link": "https://hiphopwired.com/2710890/elon-musks-far-right-tendencies-exposed-by-his-ai-bot/",
    "timestamp": "2025-05-20T16:15:33Z"
  },
  {
    "title": "Was he annoyed with Donald Trump and his cabinet members after DOGE's poor performance? Elon Musk says he will cut political spending in a blow to Republicans",
    "description": "Elon Musk political spending is making headlines as the billionaire reveals he’s stepping back from politics after heavily funding Donald Trump’s 2024 campaign. Speaking at a Bloomberg forum in Qatar, Musk said, “I think I’ve done enough,” after contributing …",
    "link": "https://economictimes.indiatimes.com/news/international/us/was-he-annoyed-with-donald-trump-and-his-cabinet-members-after-doges-poor-performance-elon-musk-says-he-will-cut-political-spending-in-a-blow-to-republicans/articleshow/121296961.cms",
    "timestamp": "2025-05-20T16:14:58Z"
  },
  {
    "title": "Ukrainian terrorist plots foiled near Kremlin – Putin to Trump",
    "description": "Vladimir Putin told Donald Trump that Kiev tried to intimidate foreign leaders visiting Moscow on Victory Day, Putin’s aide has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617919-ushakov-putin-told-trump-ukrainian-threats-victory-day/",
    "timestamp": "2025-05-20T16:14:37Z"
  },
  {
    "title": "Daily Show Host Confronts Violent January 6 Rioter: ‘How Did They Manipulate You to Punch a Cop?’",
    "description": "The Daily Show's Jordan Klepper confronted a January 6 Capitol rioter who pleaded guilty to assaulting a police officer, but blamed \"paid instigators.\"\nThe post Daily Show Host Confronts Violent January 6 Rioter: ‘How Did They Manipulate You to Punch a Cop?’ …",
    "link": "https://www.mediaite.com/tv/daily-show-host-confronts-violent-january-6-rioter-how-did-they-manipulate-you-to-punch-a-cop/",
    "timestamp": "2025-05-20T16:14:13Z"
  },
  {
    "title": "Daily Show Host Confronts Violent January 6 Rioter: ‘How Did They Manipulate You to Punch a Cop?’",
    "description": "The Daily Show's Jordan Klepper confronted a January 6 Capitol rioter who pleaded guilty to assaulting a police officer, but blamed \"paid instigators.\"\nThe post Daily Show Host Confronts Violent January 6 Rioter: ‘How Did They Manipulate You to Punch a Cop?’ …",
    "link": "https://www.mediaite.com/media/tv/daily-show-host-confronts-violent-january-6-rioter-how-did-they-manipulate-you-to-punch-a-cop/",
    "timestamp": "2025-05-20T16:14:13Z"
  },
  {
    "title": "MSNBC Has a Joe Biden Problem",
    "description": "While the nation has been preoccupied with discussing Biden's apparent decline, one cable news network has nearly entirely removed itself from it: MSNBC.\nThe post MSNBC Has a Joe Biden Problem first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/msnbc-has-a-joe-biden-problem/",
    "timestamp": "2025-05-20T16:14:08Z"
  },
  {
    "title": "Iowa sheriff who won't join immigration enforcement program heeds risk of 'sanctuary' status",
    "description": "An Iowa sheriff is warning his county may be publicly shamed by the Trump administration for insufficiently backing the president’s immigration agenda",
    "link": "https://abcnews.go.com/Politics/wireStory/iowa-sheriff-join-immigration-enforcement-program-heeds-risk-121993553",
    "timestamp": "2025-05-20T16:13:51Z"
  },
  {
    "title": "US Tariffs on Asian Solar Gear Hit 3,521% After Panel Vote",
    "description": "US duties on solar equipment from four Southeast Asian countries are now set to take effect, following a government trade commission’s conclusion Tuesday the imports threaten domestic manufacturers.",
    "link": "https://financialpost.com/pmn/business-pmn/us-tariffs-on-asian-solar-gear-hit-3521-after-panel-vote",
    "timestamp": "2025-05-20T16:13:15Z"
  },
  {
    "title": "GOP senators renew call for DOD watchdog to probe former Joint Chiefs boss Milley for alleged misconduct",
    "description": "Republican senators are renewing calls for the Pentagon’s watchdog to investigate alleged misconduct and efforts to “undermine the chain of command\" by former Chairman of the Joint Chiefs of Staff Gen. Mark Milley, Fox News Digital has learned.",
    "link": "https://www.foxnews.com/politics/gop-senators-renew-call-dod-watchdog-probe-former-joint-chiefs-boss-milley-alleged-misconduct",
    "timestamp": "2025-05-20T16:12:00Z"
  },
  {
    "title": "Trump drops ceasefire demand after Putin call",
    "description": "What happened\nPresident Donald Trump and Russian President Vladimir Putin spoke for two hours Monday in a phone call Trump characterized as \"excellent\" and Putin described as \"very informative and very frank.\" Trump said \"some progress has been made\" toward e…",
    "link": "https://biztoc.com/x/feeb2c44c21c49fd",
    "timestamp": "2025-05-20T16:11:34Z"
  },
  {
    "title": "WATCH LIVE: White House holds briefing as Trump visits Capitol Hill to unify GOP on budget bill",
    "description": "President Donald Trump went to Capitol Hill early Tuesday to seal the deal on his “big, beautiful bill.”",
    "link": "https://biztoc.com/x/66574c046fc005fb",
    "timestamp": "2025-05-20T16:11:27Z"
  },
  {
    "title": "Portugal's far-right Chega makes historic election gains. Some are comparing it to Trump",
    "description": "Portugal’s third general election in three years has failed to deliver the result that could break the worst spell of political instability for decades in the European Union country of 10.6 million people.",
    "link": "https://www.cbc.ca/news/world/portugal-election-immigration-1.7538831",
    "timestamp": "2025-05-20T16:10:51Z"
  },
  {
    "title": "Trump ‘Upset’ by Photos of Gazan Children — Urges Israel to ‘End’ War: Report",
    "description": "President Donald Trump reportedly grew “upset” after seeing images of Gazan children and babies, and is privately urging Israeli Prime Minister Benjamin Netanyahu to bring his country’s military campaign in Gaza to an end, according to senior White House offi…",
    "link": "https://www.mediaite.com/news/trump-upset-by-photos-of-gazan-children-urges-israel-to-end-war-report/",
    "timestamp": "2025-05-20T16:10:38Z"
  },
  {
    "title": "Trump ‘Upset’ by Photos of Gazan Children — Urges Israel to ‘End’ War: Report",
    "description": "President Donald Trump reportedly grew “upset” after seeing images of Gazan children and babies, and is privately urging Israeli Prime Minister Benjamin Netanyahu to bring his country’s military campaign in Gaza to an end, according to senior White House offi…",
    "link": "https://www.mediaite.com/media/news/trump-upset-by-photos-of-gazan-children-urges-israel-to-end-war-report/",
    "timestamp": "2025-05-20T16:10:38Z"
  },
  {
    "title": "Neil Young Calls Out Donald Trump's Fight With Bruce Springsteen",
    "description": "Neil Young Calls Out Donald Trump's Fight With Bruce Springsteenhollywoodreporter.com",
    "link": "http://www.hollywoodreporter.com/news/music-news/neil-young-trump-bruce-springsteen-fight-1236222481/",
    "timestamp": "2025-05-20T16:08:56Z"
  },
  {
    "title": "Dave Portnoy Mocks Trump for Claiming Taylor Swift Isn’t ‘Hot’ Anymore: He ‘Couldn’t Be More Wrong’",
    "description": "Barstool Sports founder Dave Portnoy came to the defense of Taylor Swift after President Donald Trump declared the singer is \"no longer hot.\"\nThe post Dave Portnoy Mocks Trump for Claiming Taylor Swift Isn’t ‘Hot’ Anymore: He ‘Couldn’t Be More Wrong’ first ap…",
    "link": "https://www.mediaite.com/tv/dave-portnoy-mocks-trump-for-claiming-taylor-swift-isnt-hot-anymore-he-couldnt-be-more-wrong/",
    "timestamp": "2025-05-20T16:08:50Z"
  },
  {
    "title": "Dave Portnoy Mocks Trump for Claiming Taylor Swift Isn’t ‘Hot’ Anymore: He ‘Couldn’t Be More Wrong’",
    "description": "Barstool Sports founder Dave Portnoy came to the defense of Taylor Swift after President Donald Trump declared the singer is \"no longer hot.\"\nThe post Dave Portnoy Mocks Trump for Claiming Taylor Swift Isn’t ‘Hot’ Anymore: He ‘Couldn’t Be More Wrong’ first ap…",
    "link": "https://www.mediaite.com/media/tv/dave-portnoy-mocks-trump-for-claiming-taylor-swift-isnt-hot-anymore-he-couldnt-be-more-wrong/",
    "timestamp": "2025-05-20T16:08:50Z"
  },
  {
    "title": "How Hunger Games: Sunrise on the Reaping cast stacks up against original",
    "description": "The latest film in the Hunger Games franchise is slated for release on November 20, 2026",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/hunger-games-sunrise-reaping-cast-pictures-b2754637.html",
    "timestamp": "2025-05-20T16:08:47Z"
  },
  {
    "title": "‘I Love Trump!’: Korean Boy Band Singer Leeteuk Gives Shout Out To US President On Stage",
    "description": "The lead singer of Korean boy band Super Junior declared his love for Donald Trump Sunday while on stage in Los Angeles.",
    "link": "https://dailycaller.com/2025/05/20/korean-k-pop-super-junior-leeteuk-i-love-trump-donald-los-angeles-concert-fans/",
    "timestamp": "2025-05-20T16:08:47Z"
  },
  {
    "title": "Trump administration ends approval of annual COVID-19 shots for many",
    "description": "A vaccine expert at Children’s Hospital of Philadelphia warns: “The only thing that can come of this will make vaccines less insurable and less available.”",
    "link": "https://www.pennlive.com/health/2025/05/trump-administration-ends-approval-of-annual-covid-19-shots-for-many.html",
    "timestamp": "2025-05-20T16:08:22Z"
  },
  {
    "title": "Elon Musk \"Finished,\" His Close Allies Admit",
    "description": "Toxic Elon Musk's time within the government has expired, and Republicans couldn't be happier. \"He’s finished, done, gone,\" one GOP official, who was granted anonymity by Politico to be able to talk trash, said of Musk. \"He polls terrible. People hate him.\" T…",
    "link": "https://futurism.com/officials-elon-musk-finished-gone",
    "timestamp": "2025-05-20T16:08:12Z"
  },
  {
    "title": "Trump officials set new requirements for COVID vaccines in healthy adults and children",
    "description": "Annual COVID-19 shots for healthy younger adults and children will no longer be routinely approved under a major new policy shift unveiled Tuesday by the Trump administration.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_e4897574-4520-51e2-959a-768426d67632.html",
    "timestamp": "2025-05-20T16:05:00Z"
  },
  {
    "title": "Trump officials set new requirements for COVID vaccines in healthy adults and children",
    "description": "Annual COVID-19 shots for healthy younger adults and children will no longer be routinely approved under a major new policy shift unveiled Tuesday by the Trump administration.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_fe3bd2e4-bc69-5742-9f32-4cf9c2ad52c1.html",
    "timestamp": "2025-05-20T16:05:00Z"
  },
  {
    "title": "Trump Thinks He Knows What Started the Pandemic",
    "description": "The lab-leak theory of COVID-19’s origins has became a principle of MAGA governance.",
    "link": "https://www.theatlantic.com/science/archive/2025/05/lab-leak-pandemic-trump-maga/682854/",
    "timestamp": "2025-05-20T16:05:00Z"
  },
  {
    "title": "Banks, Grassley Press Pentagon IG For Answers On Mark Milley’s ‘Alleged Misconduct’",
    "description": "Republican Sens. Jim Banks of Indiana and Chuck Grassley of Iowa are seeking answers about the Pentagon’s inquiry into retired Gen. Mark Milley’s “alleged misconduct” during his time leading the Joint Chiefs of Staff. “The nation’s highest-ranking military of…",
    "link": "https://thefederalist.com/2025/05/20/banks-grassley-press-pentagon-ig-for-answers-on-mark-milleys-alleged-misconduct/",
    "timestamp": "2025-05-20T16:04:39Z"
  },
  {
    "title": "Transgender Student in Boys Locker Room Sparks Fight With Church",
    "description": "\"This is about safety and privacy, not political correctness,\" Virginia Attorney General Jason Miyares said.",
    "link": "https://www.newsweek.com/transgender-church-pastor-virginia-youngkin-2074731",
    "timestamp": "2025-05-20T16:03:53Z"
  },
  {
    "title": "Trump expected to announce ‘Golden Dome’ space missile defenses that will cost billions",
    "description": "If realized, the system would mark the first time that the U.S. would put weapons in space.",
    "link": "https://www.denverpost.com/2025/05/20/trump-golden-dome/",
    "timestamp": "2025-05-20T16:03:40Z"
  },
  {
    "title": "Trump expected to announce ‘Golden Dome’ space missile defenses that will cost billions",
    "description": "If realized, the system would mark the first time that the U.S. would put weapons in space.",
    "link": "https://www.bostonherald.com/2025/05/20/trump-golden-dome/",
    "timestamp": "2025-05-20T16:03:40Z"
  },
  {
    "title": "Trump drops ceasefire demand after Putin call",
    "description": "Following a phone call with Russia's president, Trump backed off an earlier demand that Putin agree to an immediate ceasefire with Ukraine",
    "link": "https://theweek.com/world-news/trump-putin-russia-ukraine-war-ceasefire",
    "timestamp": "2025-05-20T16:03:08Z"
  },
  {
    "title": "Republican Wants FEMA Help After Voting to Cut Funding",
    "description": "Tornados and severe storms ravaged Missouri late last week, and Senator Josh Hawley is calling on FEMA to help rebuild.",
    "link": "https://www.newsweek.com/republican-senator-josh-hawley-fema-missouri-tornado-funding-2074711",
    "timestamp": "2025-05-20T16:02:41Z"
  },
  {
    "title": "Elon Musk Says Will Spend A 'Lot Less' On Political Campaigns",
    "description": "Billionaire Elon Musk said Tuesday he was pulling back from spending his fortune on politics, asserting his Tesla electric car company was doing well despite blowback over his support of US President Donald Trump.",
    "link": "https://www.ndtv.com/world-news/elon-musk-says-will-spend-a-lot-less-on-political-campaigns-us-elections-donald-trump-8464333",
    "timestamp": "2025-05-20T16:02:30Z"
  },
  {
    "title": "CNN’s Jennings to Dem Strategist: Your Answer to Biden Cover-Up Is ‘Trump’",
    "description": "Monday on CNN’s “NewsNight,” CNN contributor Scott Jennings batted down co-panelist Democrat strategist Julie Roginsky’s response to recent revelations about former President Joe Biden’s health. Roginsky argued the focus should be on President Donald Trump, n…",
    "link": "https://freerepublic.com/focus/f-news/4318091/posts",
    "timestamp": "2025-05-20T16:02:25Z"
  },
  {
    "title": "Trump Pushes Divided Republicans to Get Behind His ‘Big, Beautiful Bill’",
    "description": "Trump arrived on Capitol Hill with a warning to the House GOP: vote against his massive tax and spending bill, and you might get primaried.",
    "link": "https://time.com/7287051/trump-house-republicans-tax-spending-bill/",
    "timestamp": "2025-05-20T16:02:14Z"
  },
  {
    "title": "Politicians React to Biden’s Cancer Diagnosis: Trump, Obama & More",
    "description": "Democrats weren't the only ones who voiced their support for Joe Biden when his cancer diagnosis was revealed.",
    "link": "https://hollywoodlife.com/feature/politicians-react-to-biden-cancer-5418369/",
    "timestamp": "2025-05-20T16:00:50Z"
  },
  {
    "title": "WATCH LIVE: White House holds briefing as Trump visits Capitol Hill to unify GOP on budget bill",
    "description": "President Donald Trump went to Capitol Hill early Tuesday to seal the deal on his “big, beautiful bill.”",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-holds-briefing-as-trump-visits-capitol-hill-to-unify-gop-on-budget-bill",
    "timestamp": "2025-05-20T16:00:30Z"
  },
  {
    "title": "Steven Paul’s SP Media, In Wake Of Jon Voight Plan, Acquires Avenue Six Studios To Boost Hollywood Production",
    "description": "EXCLUSIVE: SP Media Group, a production and entertainment company led by veteran producer and Special Advisor to Hollywood Ambassador Jon Voight, has acquired Avenue Six Studios, a production facility in Van Nuys, CA. Deadline first told you this was in the w…",
    "link": "http://deadline.com/2025/05/jon-voight-steven-paul-sp-media-six-avenue-studios-la-production-1236405800/",
    "timestamp": "2025-05-20T16:00:14Z"
  },
  {
    "title": "How CFOs Are Preparing For A Looming Recession",
    "description": "Also in the Forbes CFO newsletter: Listening to tech vendors may be bad for your budget, Moody’s downgrade doesn’t do much to markets, Trump’s tax cuts start moving.",
    "link": "https://www.forbes.com/sites/cfo/2025/05/20/how-cfos-are-preparing-for-a-looming-recession/",
    "timestamp": "2025-05-20T16:00:11Z"
  },
  {
    "title": "Putin and Trump Discuss Ceasefire, Trade in Two-Hour Call",
    "description": "US President Donald Trump said that Moscow and Kyiv will \"immediately\" begin cease-fire talks following his latest call with Russian leader Vladimir Putin. In a post on TruthSocial, Trump said his May 19 call with Putin lasted two hours and went \"very well.\" …",
    "link": "https://oilprice.com/Geopolitics/International/Putin-and-Trump-Discuss-Ceasefire-Trade-in-Two-Hour-Call.html",
    "timestamp": "2025-05-20T16:00:00Z"
  },
  {
    "title": "Cruz Predicts Reconciliation Bill Passage — 'But There Will Probably Be a Lot of Twists and Turns'",
    "description": "Monday on FNC's \"Hannity,\" Sen. Ted Cruz (R-TX) the passage of President Donald Trump's  so-called \"big, beautiful bill.\"\nThe post Cruz Predicts Reconciliation Bill Passage — ‘But There Will Probably Be a Lot of Twists and Turns’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/05/20/cruz-predicts-reconciliation-bill-passage-but-there-will-probably-be-a-lot-of-twists-and-turns/",
    "timestamp": "2025-05-20T15:59:36Z"
  },
  {
    "title": "EU, Britain Go Ahead With New Russia Sanctions Without Waiting for Trump",
    "description": "The EU and Britain announced new sanctions against Russia on Tuesday without waiting for the United States to join them, a day after President Donald Trump's phone call with Vladimir Putin failed to elicit a promise for a ceasefire in Ukraine.",
    "link": "https://gcaptain.com/eu-britain-go-ahead-with-new-russia-sanctions-without-waiting-for-trump/",
    "timestamp": "2025-05-20T15:59:33Z"
  },
  {
    "title": "‘Kyiv should be ours’: Russians boosted after Putin-Trump call",
    "description": "A day after Vladimir Putin and Donald Trump spoke by phone on Ukraine, showering each other with compliments, Russian home-maker Anastasia had one wish: for Moscow to finish what it started in 2022. In the fourth spring of Moscow’s devastating offensive, whic…",
    "link": "https://www.digitaljournal.com/world/kyiv-should-be-ours-russians-boosted-after-putin-trump-call/article",
    "timestamp": "2025-05-20T15:57:20Z"
  },
  {
    "title": "Rubio says Syria could be weeks away from ‘full-scale civil war’",
    "description": "US Secretary of State Marco Rubio warned Tuesday that Syria could be weeks away from a fresh civil war of “epic proportions,” as he called for support to the transitional leadership. “It is our assessment that, frankly, the transitional authority, given the c…",
    "link": "https://www.digitaljournal.com/world/rubio-says-syria-could-be-weeks-away-from-full-scale-civil-war/article",
    "timestamp": "2025-05-20T15:57:20Z"
  },
  {
    "title": "‘Criminal charges?’ Longtime Democrat questions whether Jill Biden guilty of elder abuse",
    "description": "'She knew about President Biden's health problems. But still wanted him to run for president. Evil'",
    "link": "https://www.wnd.com/2025/05/criminal-charges-longtime-democrat-questions-whether-jill-biden-guilty-of-elder-abuse/",
    "timestamp": "2025-05-20T15:57:16Z"
  },
  {
    "title": "Rubio Says Syria Could Be Weeks Away From 'Full-scale Civil War'",
    "description": "US Secretary of State Marco Rubio warned Tuesday that Syria could be weeks away from a fresh civil war of \"epic proportions,\" as he called for support to the transitional leadership.",
    "link": "https://www.ibtimes.com/rubio-says-syria-could-weeks-away-full-scale-civil-war-3774079",
    "timestamp": "2025-05-20T15:57:15Z"
  },
  {
    "title": "'That's a lie!' Trump snaps as reporter cites source saying he's lost patience with GOP",
    "description": "President Donald Trump met with the Republican House Caucus on Tuesday, where he discussed the budget bill that included significant cuts to Medicaid and other services to help reduce the cost of tax cuts. Speaking to the press outside the meeting, Trump grew…",
    "link": "https://www.rawstory.com/trump-budget-2672170924/",
    "timestamp": "2025-05-20T15:56:44Z"
  },
  {
    "title": "Democratic Senator Under Fire for 'Disappointing' Vote to Make Trump-Pardoned Charles Kushner an Ambassador: 'I'm Furious'",
    "description": "Sen. Cory Booker drew backlash for backing Charles Kushner's confirmation as U.S. ambassador to France, making him the only Democrat to support the nominee.",
    "link": "https://www.ibtimes.com/democratic-senator-under-fire-disappointing-vote-make-trump-pardoned-charles-kushner-3774077",
    "timestamp": "2025-05-20T15:56:08Z"
  },
  {
    "title": "U.S. to limit annual COVID vaccines to at-risk groups, older people - National | Globalnews.ca",
    "description": "Annual COVID-19 shots for healthy younger adults and children will no longer be routinely approved under a major new vaccine policy shift unveiled Tuesday.",
    "link": "http://globalnews.ca/news/11187710/covid-vaccine-united-states-new-guidelines-trump/",
    "timestamp": "2025-05-20T15:55:57Z"
  },
  {
    "title": "‘We’re Just Getting Started’: Noem Defends DHS Record, Funding Request at Budget Hearing",
    "description": "Homeland Security Secretary Kristi Noem testified before a Senate panel Tuesday on her department’s budget request for fiscal year 2026, touting the work DHS has... Read More\nThe post ‘We’re Just Getting Started’: Noem Defends DHS Record, Funding Request at B…",
    "link": "https://www.dailysignal.com/2025/05/20/were-just-get/",
    "timestamp": "2025-05-20T15:55:53Z"
  },
  {
    "title": "DHS Secretary Kristi Noem Confidently Bombs Question About Habeas Corpus in Shocking Hearing Exchange",
    "description": "“Habeas corpus, excuse me, that's, that's incorrect,” Hassan declared as Noem added, “President Lincoln used it.”\nThe post DHS Secretary Kristi Noem Confidently Bombs Question About Habeas Corpus in Shocking Hearing Exchange first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/dhs-secretary-kristi-noem-confidently-bombs-question-about-habeas-corpus-in-shocking-hearing-exchange/",
    "timestamp": "2025-05-20T15:55:42Z"
  },
  {
    "title": "Gulf nations pivot from crude to code",
    "description": "Qatar, Saudi Arabia and Abu Dhabi are embracing AI with massive investments. Indian IT firms must grab the moment",
    "link": "https://www.thehindubusinessline.com/opinion/gulf-nations-pivot-from-crude-to-code/article69598876.ece",
    "timestamp": "2025-05-20T15:54:00Z"
  },
  {
    "title": "'He's finished, gone and people hate him': Trump has wiped Elon Musk’s name from Truth Social",
    "description": "Elon Musk's influence within the Trump administration seems to be waning, marked by a decline in mentions from the President Donald Trump on Truth Social and reduced visibility at White House briefings. This shift coincides with Musk's DOGE role ending soon a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-hes-finished-gone-and-people-hate-him-trump-has-wiped-elon-musks-name-from-truth-social/articleshow/121296803.cms",
    "timestamp": "2025-05-20T15:52:40Z"
  },
  {
    "title": "Trump DOJ charging House Democrat in ICE fracas",
    "description": "Rep. LaMonica McIver is being charged with assault over a clash outside an immigration detention facility in Newark",
    "link": "https://theweek.com/politics/rep-lamonica-mciver-ice-charges",
    "timestamp": "2025-05-20T15:51:13Z"
  },
  {
    "title": "Trump officials set new, more stringent requirements for COVID vaccines",
    "description": "Federal health officials will no longer routinely approve annual COVID-19 shots for younger adults and children who are healthy",
    "link": "https://www.boston.com/news/health/2025/05/20/trump-officials-set-new-more-stringent-requirements-for-covid-vaccines/",
    "timestamp": "2025-05-20T15:51:00Z"
  },
  {
    "title": "How MAGA Are Republicans? Comparisons Now to Record High",
    "description": "The percent of Republicans who identify as MAGA peaked in March. Here's where that number is now.",
    "link": "https://www.newsweek.com/maga-republicans-comparison-record-high-poll-2074724",
    "timestamp": "2025-05-20T15:50:11Z"
  },
  {
    "title": "Trump pushes House GOP holdouts to get behind the massive bill for his agenda (NBC News)",
    "description": "NBC News:\nTrump pushes House GOP holdouts to get behind the massive bill for his agenda  —  In a closed-door meeting, Trump urged blue-state Republicans to accept a deal on SALT and warned conservatives against seeking deep cuts to Medicaid.  —  WASHINGTON — …",
    "link": "https://www.memeorandum.com/250520/p66",
    "timestamp": "2025-05-20T15:50:01Z"
  },
  {
    "title": "'He's Not a Detail Guy': Trump Pitches Very Different Reconciliation Bill to House GOP (NOTUS)",
    "description": "NOTUS:\n'He's Not a Detail Guy': Trump Pitches Very Different Reconciliation Bill to House GOP  —  “Don't fuck around with Medicaid,” Trump told House Republicans, according to a source in the room.  — Copy  —  President Donald Trump arrived on Capitol Hill Tu…",
    "link": "https://www.memeorandum.com/250520/p65",
    "timestamp": "2025-05-20T15:50:01Z"
  },
  {
    "title": "Trump officials set new requirements for COVID vaccines in healthy adults and children",
    "description": "Federal health officials will no longer routinely approve annual COVID-19 shots for younger adults and children who are healthy",
    "link": "https://www.wftv.com/news/trump-officials-set/RX24ESE4IFGBXBV2UJBSKNLG2Q/",
    "timestamp": "2025-05-20T15:49:33Z"
  },
  {
    "title": "Trump on discussion with House Republicans over budget bill: ‘A meeting of love’",
    "description": "President Donald Trump and House Speaker Mike Johnson spoke to reporters following a closed-door meeting with House Republicans over the reconciliation bill. NBC News’ Sam Brock reports on Trump’s focus on lowering drug costs and addressing concerns over Medi…",
    "link": "https://biztoc.com/x/e65ed6e429acd6af",
    "timestamp": "2025-05-20T15:49:04Z"
  },
  {
    "title": "Trump Says Birthright Citizenship Is Only 'About the Babies of Slaves.' Historical Evidence Says Otherwise",
    "description": "During the recent oral arguments in Trump v. Casa, Solicitor General John Sauer repeatedly defended President Donald Trump's executive order stripping birthright citizenship from millions of U.S.-born children on the grounds that the 14th Amendment \"extended …",
    "link": "https://biztoc.com/x/388c83ded393f443",
    "timestamp": "2025-05-20T15:49:04Z"
  },
  {
    "title": "Elon Musk says he’ll do ‘a lot less’ political spending in the future: ‘I think I’ve done enough’",
    "description": "Elon Musk, the richest person in the world and a key financial supporter of President Donald Trump, said Tuesday that he’ll be spending less on political campaigns.\nMusk revealed his decision via videoconference during a Bloomberg forum in Doha, Qatar. It cou…",
    "link": "https://biztoc.com/x/2f4625373b0e2511",
    "timestamp": "2025-05-20T15:49:02Z"
  },
  {
    "title": "Jamie Dimon warns investors about future economic pain",
    "description": "We're not out of the economic woods yet. \nAt least not according to JP Morgan JPM CEO Jamie Dimon, who spoke Monday at the bank's annual investors conference. \nThe fear and trepidation that markets felt when President Donald Trump first unveiled his tariff pl…",
    "link": "https://biztoc.com/x/702f4069e5bdc061",
    "timestamp": "2025-05-20T15:49:02Z"
  },
  {
    "title": "Elon Musk Spirals When Asked About Making Money Off Trump Friendship",
    "description": "Elon Musk is having a hard time explaining his cushy new Starlink contracts.\r\nWhile speaking with Bloomberg at the Qatar Economic Forum Tuesday, the world’s richest man aggressively dodged a direct question about his space-based internet network’s reported de…",
    "link": "https://newrepublic.com/post/195488/elon-musk-spirals-donald-trump-south-africa-starlink",
    "timestamp": "2025-05-20T15:48:59Z"
  },
  {
    "title": "Is Donald Trump doing the world a favour by isolating the United States?",
    "description": "Loosening the American grip on global power could be an essential first step towards achieving a more just and balanced international order.",
    "link": "https://theconversation.com/is-donald-trump-doing-the-world-a-favour-by-isolating-the-united-states-252671",
    "timestamp": "2025-05-20T15:48:59Z"
  },
  {
    "title": "Kid Rock and Dolly Parton's Sister Clash Over US Birth Rates",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDolly Parton's sister fired back at Kid Rock after the musician blamed plummeting birth rates in the United States on \"ugly-a**\" and \"crazy\" liberal women.\nSinger and songwriter Stella Parton, a frequent criti…",
    "link": "https://biztoc.com/x/7cd2990051aa4677",
    "timestamp": "2025-05-20T15:48:56Z"
  },
  {
    "title": "BRICS Democracies Are Losing Leverage",
    "description": "To increase their bargaining power, Brazil, India, and South Africa should resurrect a dormant diplomatic forum.",
    "link": "http://foreignpolicy.com/2025/05/20/india-brazil-south-africa-brics-ibsa-russia-china-trump/",
    "timestamp": "2025-05-20T15:46:05Z"
  },
  {
    "title": "Former Atlanta Mayor Keisha Lance Bottoms Announces Run for Governor",
    "description": "Former Atlanta Mayor Keisha Lance Bottoms, a Democrat, announced on Monday she is running for governor in the Peach State.\nThe post Former Atlanta Mayor Keisha Lance Bottoms Announces Run for Governor appeared first on Breitbart.",
    "link": "https://www.breitbart.com/pre-viral/2025/05/20/former-atlanta-mayor-keisha-lance-bottoms-announces-run-for-governor/",
    "timestamp": "2025-05-20T15:45:52Z"
  },
  {
    "title": "FDA sets new requirements for COVID vaccines in healthy adults and children",
    "description": "Federal health officials will no longer routinely approve annual COVID-19 shots for younger adults and children who are healthy",
    "link": "https://abcnews.go.com/Health/wireStory/trump-officials-set-new-requirements-covid-vaccines-healthy-121990192",
    "timestamp": "2025-05-20T15:43:59Z"
  },
  {
    "title": "Gulf deal-making spree also benefited Elon Musk and his family",
    "description": "Elon Musk secured multiple deals in the Persian Gulf, including approvals for SpaceX's Starlink service and Neuralink's clinical trial in Abu Dhabi. Musk's companies have deep ties to the region, with past investments from Gulf funds. His family members are a…",
    "link": "https://economictimes.indiatimes.com/tech/technology/gulf-deal-making-spree-also-benefited-elon-musk-and-his-family/articleshow/121296893.cms",
    "timestamp": "2025-05-20T15:43:56Z"
  },
  {
    "title": "Musk says will spend ‘a lot less’ on political campaigns",
    "description": "Billionaire Elon Musk said Tuesday he was pulling back from spending his fortune on politics, asserting his Tesla electric car company was doing well despite blowback over his support of US President Donald Trump. “In terms of political spending, I’m going to…",
    "link": "https://www.digitaljournal.com/news/musk-says-will-spend-a-lot-less-on-political-campaigns-2/article",
    "timestamp": "2025-05-20T15:42:32Z"
  },
  {
    "title": "Musk says will spend ‘a lot less’ on political campaigns",
    "description": "Billionaire Elon Musk said Tuesday he was pulling back from spending his fortune on politics, asserting his Tesla electric car company was doing well despite blowback over his support of US President Donald Trump. “In terms of political spending, I’m going to…",
    "link": "https://www.digitaljournal.com/world/musk-says-will-spend-a-lot-less-on-political-campaigns-2/article",
    "timestamp": "2025-05-20T15:42:32Z"
  },
  {
    "title": "Vance looks to cultivate the pope as a new diplomatic partner for the U.S.",
    "description": "Vice President JD Vance shuffled between presidents and prime ministers this week, tending to complicated relationships with U.S. allies and puzzling over two wars.",
    "link": "https://www.nbcnews.com/politics/jd-vance/vance-cultivate-pope-new-diplomatic-partner-us-rcna207760",
    "timestamp": "2025-05-20T15:42:23Z"
  },
  {
    "title": "Kid Rock and Dolly Parton's Sister Clash Over US Birth Rates",
    "description": "Kid Rock blames \"ugly\" liberal women for low birth rates, as Stella Parton brands him a \"lil weasel.\"",
    "link": "https://www.newsweek.com/kid-rock-stella-parton-women-birth-rates-2074685",
    "timestamp": "2025-05-20T15:42:23Z"
  },
  {
    "title": "Explained: The New US-Backed Gaza Aid Plan And Why The UN Doesn't Like It",
    "description": "A US-backed organization aims to start work in the Gaza Strip by the end of May overseeing a new model of aid distribution in the Palestinian enclave, but the United Nations says the plan is not impartial or neutral, and it won&#039;t be involved.",
    "link": "https://www.ndtv.com/world-news/explained-the-new-us-backed-gaza-aid-plan-and-why-the-un-doesnt-like-it-8464143",
    "timestamp": "2025-05-20T15:41:35Z"
  },
  {
    "title": "‘Shut the F* Up!’ Don Lemon Rages at Media for Continued Biden Hysteria",
    "description": "Don Lemon launched a furious broadside at colleagues in the press still covering former President Joe Biden‘s 2024 campaign while failing to hold the current president, Donald Trump, properly accountable. In an extended monologue on The Don Lemon Show, broadc…",
    "link": "https://www.mediaite.com/tv/shut-the-f-up-don-lemon-rages-at-media-for-continued-biden-hysteria/",
    "timestamp": "2025-05-20T15:41:08Z"
  },
  {
    "title": "‘Shut the F* Up!’ Don Lemon Rages at Media for Continued Biden Hysteria",
    "description": "Don Lemon launched a furious broadside at colleagues in the press still covering former President Joe Biden‘s 2024 campaign while failing to hold the current president, Donald Trump, properly accountable. In an extended monologue on The Don Lemon Show, broadc…",
    "link": "https://www.mediaite.com/media/tv/shut-the-f-up-don-lemon-rages-at-media-for-continued-biden-hysteria/",
    "timestamp": "2025-05-20T15:41:08Z"
  },
  {
    "title": "After Pam Bondi, Transportation Secretary Sean Duffy sold stocks two days before Donald Trump announced 'Liberation Day' tariffs",
    "description": "US Transportation Secretary Sean Duffy sold shares in multiple firms just before US president Donald Trump's tariff announcement in February 2025, raising concerns about potential insider trading. While Duffy's spokesperson claims an outside manager handled t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-pam-bondi-transportation-secretary-sean-duffy-sold-stocks-two-days-before-donald-trump-announced-liberation-day-tariffs/articleshow/121295882.cms",
    "timestamp": "2025-05-20T15:39:07Z"
  },
  {
    "title": "Donald Trump Wants Pope Leo's Brother to Visit Him at White House",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nIn comments to reporters on Monday, President Donald Trump said he wants Pope Leo XIV's brother, Louis Prevost, to visit the White House.\n\"I like the pope's brother. You know, one of the pope's brothers — actu…",
    "link": "https://biztoc.com/x/cfd05f1054377aa2",
    "timestamp": "2025-05-20T15:38:14Z"
  }
]