[
  {
    "title": "TKDN reform to accelerate certificate issuance: Minister",
    "description": "Industry Minister Agus Gumiwang Kartasasmita stated that the Indonesian government is currently conducting reform for the regulation related to the domestic ...",
    "link": "https://en.antaranews.com/news/354157/tkdn-reform-to-accelerate-certificate-issuance-minister",
    "timestamp": "2025-05-06T09:51:21Z"
  },
  {
    "title": "IRS appoints Trish Turner to head crypto division amid resignations",
    "description": "Veteran US Internal Revenue Service (IRS) official Trish Turner has been appointed to lead the agency’s digital assets division following the departure of two key crypto-focused executives.Turner, who has spent over 20 years at the IRS and most recently serve…",
    "link": "https://cointelegraph.com/news/trish-turner-irs-crypto-division-leadership-shiftpto-division-amid-leadership-shakeup",
    "timestamp": "2025-05-06T09:50:25Z"
  },
  {
    "title": "Distributional and Macroeconomic Effects of Trump 2.0: The Rich Get Richer and the Poor Get Poorer",
    "description": "The likely outcome of Trump policies are a recession, a rise in inequality, and a further fall in living standards of working and middle-class Americans",
    "link": "https://www.nakedcapitalism.com/2025/05/distributional-and-macroeconomic-effects-of-trump-2-0-the-rich-get-richer-and-the-poor-get-poorer.html",
    "timestamp": "2025-05-06T09:50:06Z"
  },
  {
    "title": "US Commerce Secretary Lutnick Skeptical Of Trade Deal With Canada's 'Socialist Regime' Ahead Of Trump-Carney Meeting: 'They've Been Basically Feeding Off Of Us For Decades Upon Decades..'",
    "description": "Howard Lutnick, the U.S. Commerce Secretary, has voiced his concerns regarding the likelihood of a trade agreement with Canada ahead of a meeting between President Donald Trump and the newly elected Canadian Prime Minister Mark Carney on Tuesday.\nWhat Happene…",
    "link": "https://biztoc.com/x/3ad0bbc1a52bb8c3",
    "timestamp": "2025-05-06T09:49:32Z"
  },
  {
    "title": "Wall Street Elite Warm Up to Tariffs; Trump-Carney Meeting",
    "description": "On today's podcast: 1) Scott Bessent walked on stage at the largest gathering in months of Wall Street’s champions of global trade, aiming to explain why President Donald Trump is putting up hurdles to global trade. 2) Canadian Prime Minister Mark Carney said…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/wall-street-elite-warm-up-to-tariffs-trump-carney-meeting",
    "timestamp": "2025-05-06T09:45:54Z"
  },
  {
    "title": "Teamsters Praise Trump’s Movie Tariffs, Rip Hollywood Studios’ ‘Un-American Addiction to Outsourcing Our Members’ Work’",
    "description": "The Teamsters labor union is overjoyed at President Donald Trump’s move to impose tariffs on films produced overseas, applauding it as a “strong step” toward “reining in the studios’ un-American addiction to outsourcing our members’ work.”\nThe post Teamsters …",
    "link": "https://www.breitbart.com/entertainment/2025/05/06/teamsters-praise-trumps-movie-tariffs-rip-hollywood-studios-un-american-addiction-to-outsourcing-our-members-work/",
    "timestamp": "2025-05-06T09:45:42Z"
  },
  {
    "title": "Bernie Sanders To Democrats: Resisting Trump Is ‘Not Good Enough’",
    "description": "With the Democratic brand tarnished, the stage is set for the 83-year-old Vermont senator to shape the party’s direction in an unprecedented way.",
    "link": "https://www.huffpost.com/entry/bernie-sanders-donald-trump_n_6818af84e4b064ed9fd4e060",
    "timestamp": "2025-05-06T09:45:03Z"
  },
  {
    "title": "Ukraine fires drones on Moscow days before Red Square parade",
    "description": "MOSCOW - A barrage of Ukrainian drones forced Russian airports, including in Moscow, to restrict flights on Tuesday &mdash; three days before the Kremlin will hold its grand military parade on Red Square to mark the defeat of the Nazis.",
    "link": "https://www.bangkokpost.com/world/3019047/ukraine-fires-drones-on-moscow-days-before-red-square-parade",
    "timestamp": "2025-05-06T09:45:00Z"
  },
  {
    "title": "NCIS fans left feeling vindicated as two characters return in spin-off series",
    "description": "‘How is this real?’ one stunned fan said in response to new series",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/ncis-cast-ziva-tony-2025-b2745550.html",
    "timestamp": "2025-05-06T09:44:45Z"
  },
  {
    "title": "Ukraine Fires Drones On Moscow Days Before Red Square Parade",
    "description": "A barrage of Ukrainian drones forced Russian airports, including in Moscow, to restrict flights on Tuesday -- three days before the Kremlin will hold its grand military parade on Red Square to mark the defeat of the Nazis.",
    "link": "https://www.ibtimes.com/ukraine-fires-drones-moscow-days-before-red-square-parade-3772604",
    "timestamp": "2025-05-06T09:42:10Z"
  },
  {
    "title": "Barbie maker to hike prices on US toys amid Trump tariffs",
    "description": "In This Article:\nMattel, the US-based toy manufacturer behind Barbie and Hot Wheels, has withdrawn its annual financial forecast for 2025, citing uncertainties stemming from new tariffs imposed by President Donald Trump on imports from China and other Asian c…",
    "link": "https://biztoc.com/x/df2670445a918744",
    "timestamp": "2025-05-06T09:39:37Z"
  },
  {
    "title": "If You’re Looking For Evidence Of The Media Screwing Over America, Look No Further",
    "description": "By Mary Rooke, Daily Caller News Foundation | May 01, 2025\nOne of the more prominent symptoms of Trump Derangement Syndrome (TDS) is that it makes the left act completely insane. President Donald Trump got elected in part on the promise that he would close th…",
    "link": "https://biztoc.com/x/1d6e72dfca12e3bd",
    "timestamp": "2025-05-06T09:38:54Z"
  },
  {
    "title": "How Canada should decrease economic reliance on the U.S., according to three former Ottawa trade leaders",
    "description": "As Prime Minister Mark Carney sits down with U.S. President Donald Trump for the first time, hoping to start mending trade relations during their Tuesday meeting, he’s also under pressure to decrease Canada’s economic reliance on its unstable neighbour by inc…",
    "link": "https://biztoc.com/x/f344b694cb4b29ea",
    "timestamp": "2025-05-06T09:38:45Z"
  },
  {
    "title": "Tariffs Did Not Make America Great And Won’t Make America Great Again",
    "description": "By Joshua Mawhorter, Mises Wire | May 02, 2025\nSeveral times President Donald Trump has made the claim that tariffs, especially during the McKinley era, made America wealthy; so wealthy, in fact, that the government did not know what to do with the money. Her…",
    "link": "https://biztoc.com/x/00cb65a99dcdce0a",
    "timestamp": "2025-05-06T09:38:41Z"
  },
  {
    "title": "Chinese fighter jets soar over Egypt in first joint exercises",
    "description": "Analysts say the 18-day drills also help Egypt assert itself as a major regional power among the Arab nations and North Africa amid growing regional turbulence.",
    "link": "https://www.jpost.com/middle-east/article-852834",
    "timestamp": "2025-05-06T09:38:30Z"
  },
  {
    "title": "Trump Will Start Nominating Federal Judges ‘Rapidly,’ He Says",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | May 04, 2025\nPresident Donald Trump will nominate federal judges “rapidly,” he told The Daily Signal on Sunday night.About 100 days into Trump’s first term, the Senate had already confirmed a new Supreme Cour…",
    "link": "https://biztoc.com/x/cd0ac5b7bd365e57",
    "timestamp": "2025-05-06T09:38:20Z"
  },
  {
    "title": "Trump Orders FDA To Fast-Track US Drug Production As Tariff Threat Looms On Imported Medicines: Cites National Security Concerns",
    "description": "President Donald Trump signed an executive order Monday directing the Food and Drug Administration to accelerate approvals for domestic pharmaceutical manufacturing facilities as his administration prepares to announce new tariffs on imported medicines within…",
    "link": "https://biztoc.com/x/21f9256cdb595819",
    "timestamp": "2025-05-06T09:38:15Z"
  },
  {
    "title": "Ukraine Destroys Rare Russian Naval Radar-on-Wheels: Video",
    "description": "\"And, it seems, it has never been hit during the entire war,\"  a Ukrainian military unit said of the strike.",
    "link": "https://www.newsweek.com/ukraine-destroys-russian-naval-radar-video-2068413",
    "timestamp": "2025-05-06T09:37:56Z"
  },
  {
    "title": "Trump Betrays His Base. Richard C. Cook",
    "description": "Marjorie Taylor Greene (R-GA) has been one of the most steadfast and articulate congressional supporters of President Donald Trump through thick and thin. When she takes him to task you know that something is seriously wrong. Read about it here …\nThe post Tru…",
    "link": "https://www.globalresearch.ca/trump-betrays-his-base/5886140",
    "timestamp": "2025-05-06T09:31:12Z"
  },
  {
    "title": "At Social Security, These Are the Days of the Living Dead",
    "description": "More proof at Social Security of the damage done by letting DOGE run wild.",
    "link": "https://www.nakedcapitalism.com/2025/05/at-social-security-these-are-the-days-of-the-living-dead.html",
    "timestamp": "2025-05-06T09:30:18Z"
  },
  {
    "title": "How Many Biden Appointees ‘Burrowed In’ To The Permanent Bureaucracy?",
    "description": "By Tyler O'Neil, The Daily Signal | May 04, 2025\nLeft-leaning federal bureaucrats aim to oppose President Donald Trump from within the administrative state, and some Biden administration appointees have attempted to “burrow in” to the federal bureaucracy by s…",
    "link": "https://biztoc.com/x/be2537ebe2c57fec",
    "timestamp": "2025-05-06T09:27:53Z"
  },
  {
    "title": "Federal Judges Ruling Against Deportations Is ‘Big’ Emergency, Trump Tells ‘Meet The Press’",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | May 04, 2025\nPresident Donald Trump said he doesn’t plan to lift the state of emergency he declared at the southern border on his first day in office because “we have a massive emergency overall.”\n“It’s an ov…",
    "link": "https://biztoc.com/x/895ba3e3fcbc1d83",
    "timestamp": "2025-05-06T09:27:35Z"
  },
  {
    "title": "Editorial: Mr President, The Name ‘MahamaCares’ Is Too Political",
    "description": "On April 29, 2025 President John Dramani Mahama launched the Medical Trust Fund in Accra. The Trust, which is popularly known as MahamaCares, according to a Daily Graphic report, is a landmark initiative introduced by the government to decisively confront the…",
    "link": "https://thechronicle.com.gh/editorial-mr-president-the-name-mahamacares-is-too-political/",
    "timestamp": "2025-05-06T09:25:51Z"
  },
  {
    "title": "Barbie maker to hike prices on US toys amid Trump tariffs",
    "description": "The company attributes its decision largely to the uncertainty brought on by the reintroduction of tariffs on Chinese goods.",
    "link": "https://www.retail-insight-network.com/news/barbie-maker-to-hike-prices-on-us-toys-amid-trump-tariffs/",
    "timestamp": "2025-05-06T09:22:01Z"
  },
  {
    "title": "Trump’s 100 Days And The Legal War In Washington",
    "description": "By Hans von Spakovsky via The Daily Signal | May 04, 2025\nDuring his first 100 days in office, President Donald Trump acted with unprecedented speed to make major changes in government policies and root out the pervasive waste, fraud, and diversity, equity, a…",
    "link": "https://biztoc.com/x/e05be4c17ff651ae",
    "timestamp": "2025-05-06T09:17:03Z"
  },
  {
    "title": "Trump Demands ‘Bigger, Badder’ Alcatraz To Lock Up Nation’s Worst Criminals",
    "description": "By Melanie Wilcox, Daily Caller News Foundation | May 04, 2025\nPresident Donald Trump announced Sunday evening that he wants to bring back one of America’s most feared prisons — Alcatraz — and make it bigger than ever. In a Truth Social post that lit up the i…",
    "link": "https://biztoc.com/x/9304c6a6eafdfd0d",
    "timestamp": "2025-05-06T09:16:47Z"
  },
  {
    "title": "Mattel: Your kid's next Barbies may be more expensive",
    "description": "Mattel said it may have to change its pricing in the US.\nAP Images / Alan Diaz\nMattel said it may have to adjust toy prices because of President Donald Trump's tariffs on China.\nTrump hit China with a 145% tariff. The US imports nearly 80% of its toys from Ch…",
    "link": "https://biztoc.com/x/001dc4c4814b7fef",
    "timestamp": "2025-05-06T09:16:37Z"
  },
  {
    "title": "‘Only Republican Who Can Perform’: John James Is Determined To Flip Governorship Red During Midterms",
    "description": "By Adam Pack via Daily Caller News Foundation | May 01, 2025\nRepublican Michigan Rep. John James believes the fate of President Donald Trump’s agenda in the upcoming midterm cycle could run through the battleground state.\nJames, an Iraq War veteran and a voca…",
    "link": "https://biztoc.com/x/5eb49041922a7ee3",
    "timestamp": "2025-05-06T09:16:34Z"
  },
  {
    "title": "Time to push Putin ‘to the corner,’ Estonian foreign minister says",
    "description": "The News\nEstonia’s foreign minister wants the US and Europe to work together to push Russian President Vladimir Putin “to the corner” after US President Donald Trump’s overtures revealed the Russian leader to be unserious about Ukraine peace talks.\n“Trump has…",
    "link": "https://biztoc.com/x/941a34fbe3bdd1db",
    "timestamp": "2025-05-06T09:16:29Z"
  },
  {
    "title": "US carries out more aggression against Yemen",
    "description": "The United States carries out more airstrikes in different areas in Yemen, as Washington presses ahead with its aggression against the Arab country.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250505-presstv08.htm",
    "timestamp": "2025-05-06T09:12:13Z"
  },
  {
    "title": "Donald Trump’s harsh budget will cost LGBTQ+ people $2.67 billion, experts claim",
    "description": "Donald Trump’s newly proposed federal budget could financially impact the LGBTQ+ community to the tune of $2.67 billion, a major non-profit has warned. A string of budget cuts totalling $163 billion were proposed by the 78-year-old president during a Friday (…",
    "link": "https://www.thepinknews.com/2025/05/06/donald-trump-budget-costs-lgbtq-people-2-67-billion/",
    "timestamp": "2025-05-06T09:12:01Z"
  },
  {
    "title": "Trump’s trade war with Canada has blown up in his face. Now he has a crucial meeting with Mark Carney",
    "description": "Canadian Prime Minister Mark Carney will visit US President Donald Trump at the White House on Tuesday in what could be one of the most contentious meetings between the neighboring countries’ leaders in years.",
    "link": "https://www.cnn.com/2025/05/06/business/canada-trump-carney-trade-war-tariffs",
    "timestamp": "2025-05-06T09:09:49Z"
  },
  {
    "title": "Friedrich Merz Suffers Surprise Setback In Bid To Become Germany's Next Chancellor",
    "description": "Merz is seeking to take the helm of the country after outgoing Chancellor Olaf Scholz's government collapsed last year.",
    "link": "https://www.huffpost.com/entry/germany-merz-suffers-historic-defeat-parliament_n_6819cf80e4b09d0e11f8428f",
    "timestamp": "2025-05-06T09:09:06Z"
  },
  {
    "title": "Possible Trump tariff on films could mean 'massive loss' for N.L. industry, says producer",
    "description": "Donald Trump wants more movies to be made in the United States, and a Newfoundland-based production company says it could have dire effects on the film industry if proposed tariffs come into effect.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/nl-trump-film-tariffs-1.7527079",
    "timestamp": "2025-05-06T09:08:54Z"
  },
  {
    "title": "Why Fed is likely to wait for signs of weakening economy before lowering interest rates",
    "description": "The Federal Reserve is set to hold interest rates steady and hint it's in no hurry to cut as tariffs threaten to heat up inflation amid solid economy",
    "link": "https://www.usatoday.com/story/money/2025/05/06/fed-wait-longer-cut-rates/83457838007/",
    "timestamp": "2025-05-06T09:07:22Z"
  },
  {
    "title": "National brands used to celebrate Pride Month. Then came the DEI backlash.",
    "description": "Celebrating Pride with colorful displays of solidarity used to be a must. But amid the Trump crackdown on DEI and trans rights, support is waning.",
    "link": "https://www.usatoday.com/story/money/2025/05/06/pride-month-defections-dei-backlash/83376447007/",
    "timestamp": "2025-05-06T09:05:55Z"
  },
  {
    "title": "Mattel: Your kid's next Barbies may be more expensive",
    "description": "Mattel's CEO Ynon Kreiz said he expects \"40% to 50% of our product will be priced at $20 or less.\"",
    "link": "https://www.businessinsider.com/mattel-says-barbies-going-to-get-more-expensive-2025-5",
    "timestamp": "2025-05-06T09:05:45Z"
  },
  {
    "title": "‘A Small Price To Celebrate America’s Greatness’: Trump Champions $45 Million Military Parade",
    "description": "By Melanie Wilcox, Daily Caller News Foundation | May 04, 2025\nPresident Donald Trump is defending the price tag for his planned Flag Day military parade, calling the $45 million estimate “peanuts” compared to the value of honoring America’s military might an…",
    "link": "https://biztoc.com/x/96844532fb2cdb76",
    "timestamp": "2025-05-06T09:05:40Z"
  },
  {
    "title": "'Can't take a joke?': Trump's bizarre response on his 'loved' AI viral image of him as Pope",
    "description": "President Donald Trump last week posted an AI-generated image of himself as the Pope, inviting criticism from all quarters. Now, the President has claimed that the image was loved by the Catholics. The image showed Trump in a white cassock and a Mitre hat wit…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/cant-take-a-joke-trumps-bizarre-response-on-his-loved-ai-viral-image-of-him-as-pope/articleshow/120927639.cms",
    "timestamp": "2025-05-06T09:04:10Z"
  },
  {
    "title": "Trump calls AI pope image a joke, but experts say it’s no laughing matter",
    "description": "Trump told reporters on Monday that the pope image was posted as a joke on his Truth Social account, which was then reposted by the White House across social media.",
    "link": "https://www.jpost.com/omg/article-852827",
    "timestamp": "2025-05-06T09:03:03Z"
  },
  {
    "title": "Ukraine Nears Patriot Missile Boost as Peace Talks Hit a Wall",
    "description": "\"Vladimir, STOP!\" President Donald Trump said after Moscow launched a barrage of drones and missiles on the Ukrainian capital last month.",
    "link": "https://www.newsweek.com/ukraine-patriot-air-defense-systems-us-greece-2068358",
    "timestamp": "2025-05-06T09:01:27Z"
  },
  {
    "title": "Trump to Meet Carney for First Time Since Canadian's Election Win",
    "description": "U.S. President Donald Trump will sit down with newly elected Prime Minister Mark Carney in Washington, DC, on Tuesday for the first meeting between the two since the Canadian's election win.\nThe post Trump to Meet Carney for First Time Since Canadian’s Electi…",
    "link": "https://www.breitbart.com/europe/2025/05/06/trump-to-meet-carney-for-first-time-since-canadians-election-win/",
    "timestamp": "2025-05-06T09:01:27Z"
  },
  {
    "title": "Did Angelina Jolie's father suggest Donald Trump's movie tariffs? Here's what Jon Voight proposed…",
    "description": "Actor Jon Voight presented his plan to boost US jobs in the entertainment industry to US President Donald Trump over the weekend. We take a look at his proposal.&nbsp;",
    "link": "https://www.livemint.com/industry/media/angelina-jolie-father-jon-voight-suggest-donald-trump-hollywood-movie-tariffs-what-proposal-detail-entertainment-us-jobs-11746503876601.html",
    "timestamp": "2025-05-06T09:01:04Z"
  },
  {
    "title": "LIZ PEEK: What Kamala Harris buzz is telling us. Read between the lines, America",
    "description": "Harris was not deemed a successful vice president, earning consistent negative favorability ratings. Given her poor showing in 2024 why would anyone consider giving her a second chance?",
    "link": "https://www.foxnews.com/opinion/liz-peek-what-kamala-harris-buzz-telling-us-read-between-lines-america",
    "timestamp": "2025-05-06T09:00:58Z"
  },
  {
    "title": "DR. MARC SIEGEL: Trump is right to block 'dangerous' gain-of-function research",
    "description": "President Trump was correct to issue an executive order on Monday that will block federal funding for gain-of-function research in China, Iran, and elsewhere, including the U.S.",
    "link": "https://www.foxnews.com/opinion/dr-marc-siegel-trump-right-block-dangerous-gain-function-research",
    "timestamp": "2025-05-06T09:00:53Z"
  },
  {
    "title": "Trump’s latest move proves his manufacturing Golden Age is just fools’ gold",
    "description": "Trump's tariff fight is chasing a Golden Age of America that's already here. The US exported over $2 trillion worth of goods in 2024. Tariffs will only make life harder for Americans.",
    "link": "https://www.foxnews.com/opinion/trumps-latest-move-proves-his-manufacturing-golden-age-just-fools-gold",
    "timestamp": "2025-05-06T09:00:50Z"
  },
  {
    "title": "Project 2025 vowed to roll back LGBTQ+ rights. Here's everything Trump has done so far",
    "description": "Donald Trump claimed on the campaign trail that he had \"nothing to do\" with Project 2025 — but now that he's in office, he's implementing it.",
    "link": "https://www.advocate.com/politics/project-2025-lgbtq-so-far",
    "timestamp": "2025-05-06T09:00:03Z"
  },
  {
    "title": "Gavin Newsom says he wants to work with Trump to 'Make America Film Again'",
    "description": "Newsom's comment comes a day after Trump said he was considering a 100% tariff on movies made outside the US.",
    "link": "https://www.businessinsider.com/gavin-newsom-donald-trump-us-film-industry-hollywood-tariffs-2025-5",
    "timestamp": "2025-05-06T09:00:02Z"
  },
  {
    "title": "At Social Security, These Are the Days of the Living Dead",
    "description": "In recent weeks, Social Security has been plagued by problems related to technology, system errors, and even the marking of living people as dead.",
    "link": "https://kffhealthnews.org/news/article/social-security-administration-beneficiaries-marked-dead-ssn-numbers-delays/",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "Meet the Florida group chipping away at public benefits one state at a time",
    "description": "The Trump administration's \"Make America Healthy Again\" platform has boosted the agenda of a conservative think tank that's been working for more than a decade to reshape the nation's public assistance programs.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/05/06/nx-s1-5387527/fga-foundation-for-government-accountability-states-snap-work-requirements",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "Critics warn DOJ is being politicized despite vows to end its purported weaponization",
    "description": "Critics warn that despite President Trump's call to end the purported weaponization of the Justice Department, it has become more politicized in the president's first three months back in office.",
    "link": "https://www.npr.org/2025/05/06/g-s1-64305/weaponization-doj-trump-bondi-justice-department",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "Federal housing cuts could affect Roanoke, officials say",
    "description": "“This attack on poor people, it shouldn't be that way,\" said Roanoke's housing authority director. \"The attack should be on poverty, not poor people.”",
    "link": "https://roanoke.com/news/local/government-politics/article_77a7ad6a-e79d-4708-8103-87a7489f4f5e.html",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "Trump Seethes as Karl Rove’s Harsh On-Air Poll Warning Deflates MAGA",
    "description": "President Donald Trump is angry at longtime GOP strategist Karl Rove. That’s because Rove delivered Trump a stern warning on Fox News about his sliding approval ratings. What caught our attention, though, is what Rove said about immigration, in particular. Ro…",
    "link": "https://newrepublic.com/article/194891/trump-seethes-karl-rove-harsh-on-air-poll-warning-deflates-maga",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "This Republican Just Cracked the Doors Open to Higher Taxes on the Wealthy (Or Did He?)",
    "description": "We’ll need to read the fine print of any Republican tax bill to see who pays more or less. \nThe post This Republican Just Cracked the Doors Open to Higher Taxes on the Wealthy (Or Did He?) appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/05/06/this-republican-just-cracked-the-doors-open-to-higher-taxes-on-the-wealthy-or-did-he/",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "Congressional Republicans Have Two Bad Options",
    "description": "How to make sense of their stumbling progress—perhaps—toward a major fiscal bill",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/05/congress-budget-bill-trump/682711/",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "HIV Testing and Outreach Falter as Trump Funding Cuts Sweep the South",
    "description": "A disruption in federal funds has jeopardized HIV testing and outreach in Mississippi, and researchers warn of a resurgence of the epidemic in the South.",
    "link": "https://kffhealthnews.org/news/article/hiv-testing-outreach-falter-trump-funding-cuts-sweep-south/",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "MORNING GLORY: 'REAL ID' is coming for you",
    "description": "Be aware that the deadline to obtain a REAL ID, which will be necessary in order to fly without a passport, is May 7th.",
    "link": "https://www.foxnews.com/opinion/morning-glory-real-id-coming-you",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "Internal VA Emails Reveal How Trump Cuts Jeopardize Veterans’ Care, Including To “Life-Saving Cancer Trials”",
    "description": "by Eric Umansky and Vernal Coleman \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nEarlier this year, doctors at Veterans Affairs hospitals in …",
    "link": "https://www.propublica.org/article/trump-veterans-affairs-budget-staff-cuts-jeopardize-cancer-research",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "Inside the Trump Assault on the Consumer Financial Protection Bureau",
    "description": "An agency lawyer and union representative opens up about the Trump/Musk rampage on the CFPB, what happens next, and why he’s still optimistic. \nThe post Inside the Trump Assault on the Consumer Financial Protection Bureau appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/05/06/inside-the-trump-assault-on-the-consumer-financial-protection-bureau/",
    "timestamp": "2025-05-06T09:00:00Z"
  },
  {
    "title": "Blow for Merz as he misses majority in first vote for chancellor",
    "description": "Germany's conservative leader Friedrich Merz suffered a serious blow on Tuesday when he failed to win a parliamentary majority in the first round of voting to become the next chancellor.",
    "link": "https://www.hurriyetdailynews.com/blow-for-merz-as-he-misses-majority-in-first-vote-for-chancellor-208853",
    "timestamp": "2025-05-06T08:59:50Z"
  },
  {
    "title": "Israeli PM warns of \"intensive\" Gaza offensive, with senior official saying window still open for deal",
    "description": "Israeli Prime Minister Benjamin Netanyahu warned on Monday that the country's new offensive in the Gaza Strip would be \"intensive,\" referring to a plan approved by his security cabinet on escalating the ongoing campaign in Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250506-pdo03.htm",
    "timestamp": "2025-05-06T08:58:40Z"
  },
  {
    "title": "New ‘Bring Your Own Installer (BYOI)’ technique allows to bypass EDR",
    "description": "A new BYOI technique lets attackers bypass SentinelOne EDR, disable protection, and deploy Babuk ransomware by exploiting the agent upgrade process. Aon’s Stroz Friedberg discovered a new “Bring Your Own Installer” (BYOI)  EDR bypass technique that exploits a…",
    "link": "https://securityaffairs.com/177494/hacking/new-bring-your-own-installer-byoi-technique-allows-to-bypass-edr.html",
    "timestamp": "2025-05-06T08:57:20Z"
  },
  {
    "title": "Iran: Diplomacy based on mutual respect, interests 'sole path' to achieve deal",
    "description": "Iranian Foreign Minister Abbas Araghchi asserts that the only way to achieve a deal with the United States is through diplomacy based on mutual respect and mutual interests.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250505-presstv03.htm",
    "timestamp": "2025-05-06T08:55:49Z"
  },
  {
    "title": "Trump’s disturbing vision for Gaza has inspired Netanyahu’s plan to seize the Strip",
    "description": "Israel’s plans echo Donald Trump’s own wild plans in the past that the Palestinians be forced out of Gaza to allow the US to turn the enclave into a “Riviera of the Middle East”, writes chief international correspondent Bel Trew",
    "link": "https://www.the-independent.com/life-style/royal-family/queen-prince-philip-related-cousins-b1833057.html",
    "timestamp": "2025-05-06T08:55:48Z"
  },
  {
    "title": "Diplomacy based on 'mutual respect' is the only way to reach a deal: Araqchi",
    "description": "Iranian Foreign Minister Abbas Araqchi has emphasized that diplomacy rooted in \"mutual respect and mutual interest\" is the only viable path to securing a deal in the ongoing indirect negotiations between Tehran and Washington.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250505-irna04.htm",
    "timestamp": "2025-05-06T08:55:45Z"
  },
  {
    "title": "Trump Seeks Iran Nuclear Dismantling, Hints At Flexibility",
    "description": "US President Donald Trump says the goal of negotiations with Iran is to ensure the \"total dismantlement\" of Tehran's nuclear program but would consider allowing Iran to maintain a civilian nuclear energy program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250505-rferl01.htm",
    "timestamp": "2025-05-06T08:55:10Z"
  },
  {
    "title": "Why BP PLC (BP) Soared on Monday",
    "description": "We recently published a list of Why These 10 Firms Soared on Monday. In this article, we are going to take a look at where BP PLC (NYSE:BP) stands against...",
    "link": "https://finance.yahoo.com/news/why-bp-plc-bp-soared-085128170.html",
    "timestamp": "2025-05-06T08:51:28Z"
  },
  {
    "title": "China doesn't fear trade war, urges equal, respectful talks, envoy says",
    "description": "China doesn't want or fear a trade war, and talks should be conducted in an equal, respectful and reciprocal manner, Beijing's top envoy in Washington said, as the US-China Business Council cautioned that hefty duties, if they take hold, would significantly r…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/05/china-250506-globaltimes01.htm",
    "timestamp": "2025-05-06T08:51:15Z"
  },
  {
    "title": "Why Maplebear Inc. (CART) Soared on Monday",
    "description": "We recently published a list of Why These 10 Firms Soared on Monday. In this article, we are going to take a look at where Maplebear Inc. (NASDAQ:CART...",
    "link": "https://finance.yahoo.com/news/why-maplebear-inc-cart-soared-085108831.html",
    "timestamp": "2025-05-06T08:51:08Z"
  },
  {
    "title": "Why PBF Energy Inc. (PBF) Soared on Monday",
    "description": "We recently published a list of Why These 10 Firms Soared on Monday. In this article, we are going to take a look at where PBF Energy Inc. (NYSE:PBF) stands ...",
    "link": "https://finance.yahoo.com/news/why-pbf-energy-inc-pbf-085045795.html",
    "timestamp": "2025-05-06T08:50:45Z"
  },
  {
    "title": "Why BioCryst Pharmaceuticals, Inc. (BCRX) Soared on Monday",
    "description": "We recently published a list of Why These 10 Firms Soared on Monday. In this article, we are going to take a look at where BioCryst Pharmaceuticals, Inc...",
    "link": "https://finance.yahoo.com/news/why-biocryst-pharmaceuticals-inc-bcrx-085015021.html",
    "timestamp": "2025-05-06T08:50:15Z"
  },
  {
    "title": "Trump’s Trade Tariffs Hit Global Markets Harder Than 2008 Crisis",
    "description": "On April 2, US President Donald Trump signed a decree introducing \"reciprocal\" tariffs on imports from more than 180 countries and territories.",
    "link": "https://sputnikglobe.com/20250506/trumps-trade-tariffs-hit-global-markets-harder-than-2008-crisis-1121987336.html",
    "timestamp": "2025-05-06T08:50:11Z"
  },
  {
    "title": "Putin Gears Up For 'Grandest' Victory Day Amid Ukraine Conflict",
    "description": "Russian President Vladimir Putin will address the \"grandest\" ever annual Victory Day parade in Moscow on Friday, evoking the Soviet Union's defeat of Nazi Germany in World War II to rally support for his troops fighting in Ukraine.",
    "link": "https://www.ibtimes.com/putin-gears-grandest-victory-day-amid-ukraine-conflict-3772603",
    "timestamp": "2025-05-06T08:48:18Z"
  },
  {
    "title": "Putin Gears Up For 'Grandest' Victory Day Amid Ukraine Conflict",
    "description": "Russian President Vladimir Putin will address the \"grandest\" ever annual Victory Day parade in Moscow on Friday, evoking the Soviet Union's defeat of Nazi Germany in World War II to rally support for his troops fighting in Ukraine.",
    "link": "https://www.ibtimes.com.au/putin-gears-grandest-victory-day-amid-ukraine-conflict-1858546",
    "timestamp": "2025-05-06T08:48:17Z"
  },
  {
    "title": "Jimmy Kimmel Trolls Eric Trump With An 'Entirely Different' Kind Of Message",
    "description": "The late night host said the president's latest merch might mean something a little different than what people think.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-eric-trump-2028_n_6819b589e4b085c2f857e1e7",
    "timestamp": "2025-05-06T08:46:03Z"
  },
  {
    "title": "100 Days of Secretary Noem: Making America Safe Again",
    "description": "In her first 100 days on the job, Secretary Kristi Noem returned the Department of Homeland Security (DHS) to its core mission of securing the homeland.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/05/sec-250505-dhs01.htm",
    "timestamp": "2025-05-06T08:44:37Z"
  },
  {
    "title": "Trump Announces New National Holidays for World War I and II Victories",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump announced on Monday that he had designated May 8 and November 11 as new national holidays to commemorate U.S. victories in the Second and First World Wars.\nThe announcement, made via Tru…",
    "link": "https://biztoc.com/x/b2151d1d3e242056",
    "timestamp": "2025-05-06T08:43:09Z"
  },
  {
    "title": "Czechs Say Initiative Delivered 500,000 Artillery Shells To Ukraine This Year",
    "description": "Czech Prime Minister Petr Fiala said around 500,000 artillery shells have been delivered to Ukraine this year under a Czech-led global effort to support Kyiv in its fight against Russia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250505-rferl01.htm",
    "timestamp": "2025-05-06T08:42:18Z"
  },
  {
    "title": "Patience Wears Thin In Washington As Ukraine Peace Deal Eludes Trump",
    "description": "In his first 100 days in office, one key foreign policy goal has eluded US President Donald Trump: ending the war on Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250506-rferl01.htm",
    "timestamp": "2025-05-06T08:41:42Z"
  },
  {
    "title": "Trump Announces New National Holidays for World War I and II Victories",
    "description": "May 8 and November 11 are new national holidays for WWII and WWI victories that don't replace Veterans Day or close businesses.",
    "link": "https://www.newsweek.com/trump-world-war-national-holidays-announcement-2068364",
    "timestamp": "2025-05-06T08:41:35Z"
  },
  {
    "title": "Iratxe García: \"The world is bigger than Trump. It's time to diversify our alliances.\"",
    "description": "Global Europe\r\nDuring a plenary debate on the EU response to US trade measures with the Commission and the Council, S&D leader Iratxe García Pérez called for a firm EU position on negotiations with Trump over tariffs, while the countermeasures are on hold for…",
    "link": "http://pr.euractiv.com/node/269802",
    "timestamp": "2025-05-06T08:41:15Z"
  },
  {
    "title": "New Satellite Image Shows U.S. Aircraft Carrier at War with Houthis",
    "description": "The U.S. has increased its military deployment in the Middle East as it faces attacks by the Houthis and as a warning to Iran amid ongoing tensions.",
    "link": "https://www.newsweek.com/new-satellite-image-shows-us-aircraft-carrier-war-houthis-2068361",
    "timestamp": "2025-05-06T08:34:02Z"
  },
  {
    "title": "Mattel gets 40% of its toys from China and says it will raise prices ‘where necessary’ to offset Trump tariff costs",
    "description": "Mattel Inc., the maker of Barbie dolls, Hot Wheels cars and other popular toys, said Monday that it would have to raise prices for some products sold in the U.S. “where necessary” to offset higher costs related to President Donald Trump’s tariffs.\nThe El Segu…",
    "link": "https://biztoc.com/x/711ad0c092addfb5",
    "timestamp": "2025-05-06T08:32:17Z"
  },
  {
    "title": "'Scientist walked with the girlfriend...': Trump halts virus research funding to China, blaming Covid on lab leak",
    "description": "President Donald Trump  has halted biological research funding to adversaries such as China and Iran because of concerns COVID-19 originated in a Chinese lab. His executive order dealing with a type of biomedical research comes at a time of heightened tension…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-order-federal-funding-china-covid-lab-leak-scientist-walked-with-the-girlfriend-trump-halts-virus-research-funding-to-china-blaming-covid-on-lab-leak/articleshow/120926276.cms",
    "timestamp": "2025-05-06T08:31:41Z"
  },
  {
    "title": "US Senate crypto bills stall amid Trump ties and ethics concerns",
    "description": "Efforts to pass crypto legislation in the US Senate face mounting resistance amid growing ethical concerns around US President Donald Trump’s ties to crypto.In a May 5 letter to the US Office of Government Ethics, Senators Elizabeth Warren and Jeff Merkley sa…",
    "link": "https://cointelegraph.com/news/senate-crypto-bills-trump-ethics-concerns",
    "timestamp": "2025-05-06T08:23:39Z"
  },
  {
    "title": "Trump threatens tariffs on foreign films: Who could be hit?",
    "description": "Popular US films from Wicked to Nosferatu were filmed in other countries including Australia and the UK.",
    "link": "https://www.aljazeera.com/news/2025/5/6/trump-threatens-tariffs-on-foreign-films-who-could-be-hit",
    "timestamp": "2025-05-06T08:20:23Z"
  },
  {
    "title": "Romania Names Interim Premier As Turmoil Deepens",
    "description": "Romania's liberal interior minister Catalin Predoiu became interim premier on Tuesday, the presidency announced, a day after the prime minister's resignation deepened political tumult in the EU nation.",
    "link": "https://www.ibtimes.com/romania-names-interim-premier-turmoil-deepens-3772595",
    "timestamp": "2025-05-06T08:12:11Z"
  },
  {
    "title": "Germany's Merz fails to be elected chancellor in shock first-round vote",
    "description": "BERLIN (Reuters) -German conservative leader Friedrich Merz failed to secure enough parliamentary votes to become chancellor on Tuesday in a major blow that ...",
    "link": "https://www.yahoo.com/news/merz-fails-elected-chancellor-german-081046149.html",
    "timestamp": "2025-05-06T08:10:46Z"
  },
  {
    "title": "International industry on edge after Trump touts 100% tariff threat on films made outside US",
    "description": "US president Donald Trump says he is planning to meet with entertainment industry reps to discuss ways to improve Hollywood’s fortunes, after spooking the global production sector on Sunday with a vague proposal to place 100% tariffs on movies produced",
    "link": "https://www.c21media.net/news/international-industry-on-edge-after-trump-touts-100-tariff-threat-on-films-made-outside-us/",
    "timestamp": "2025-05-06T08:10:31Z"
  },
  {
    "title": "Minorities are redefining American politics - opinion",
    "description": "It's time to break the myth of the democratic minority bloc",
    "link": "https://www.jpost.com/opinion/article-852813",
    "timestamp": "2025-05-06T08:10:29Z"
  },
  {
    "title": "After Trump vows tariffs on foreign movies, the Canadian film industry says he's lost the plot",
    "description": "U.S. President Donald Trump wants to impose a 100 per cent tariff on movies produced outside the country, a move that could devastate the Canadian film landscape — but experts are scratching their heads over how such a tax would work, given how intertwined th…",
    "link": "https://biztoc.com/x/63385051299fd6f7",
    "timestamp": "2025-05-06T08:10:00Z"
  },
  {
    "title": "Hollywood Tariff Push Sparked By Trump-Jon Voight Meeting Where Actor Proposed Levies In 'Certain Limited Circumstances:' Report",
    "description": "President Donald Trump‘s decision to levy a 100% tariff on foreign films resulted from a proposal by actor Jon Voight and his manager, Steven Paul.\nWhat Happened: Voight and his manager had a meeting with Trump and they submitted a “comprehensive plan”, follo…",
    "link": "https://biztoc.com/x/2b7eacdfd2da1ac0",
    "timestamp": "2025-05-06T08:09:56Z"
  },
  {
    "title": "Student Loan Update: Wage Garnishment Timeline Revealed by Education Department",
    "description": "The Department of Education is beginning involuntary collection on student loans that are in default.",
    "link": "https://www.newsweek.com/student-loan-wage-garnishment-timeline-2068379",
    "timestamp": "2025-05-06T08:09:32Z"
  },
  {
    "title": "Trump denies any involvement in AI pope image amid Catholic backlash",
    "description": "The controversy erupted just days before a historic Vatican conclave to elect the successor to Pope Francis.",
    "link": "https://www.christiantoday.com/news/trump-denies-any-involvement-in-ai-pope-image-amid-catholic-backlash",
    "timestamp": "2025-05-06T08:08:00Z"
  },
  {
    "title": "Romania names interim premier as turmoil deepens",
    "description": "Romania’s liberal interior minister Catalin Predoiu became interim premier on Tuesday, the presidency announced, a day after the prime minister’s resignation deepened political tumult in the EU nation. Romania’s pro-EU Prime Minister Marcel Ciolacu stepped do…",
    "link": "https://www.digitaljournal.com/world/romania-names-interim-premier-as-turmoil-deepens/article",
    "timestamp": "2025-05-06T08:07:20Z"
  },
  {
    "title": "‘A lot of people know’ who blew up Nord Stream – Trump",
    "description": "The US president has made it clear that he does not believe claims that Russia destroyed its own pipelines Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616829-trump-nord-stream-us/",
    "timestamp": "2025-05-06T08:07:05Z"
  }
]