[
  {
    "title": "Bitcoin prices are recovering as gold retreats because a surprise “framework deal” just killed the tariff threat",
    "description": "President Donald Trump's announcement that he would not impose tariffs scheduled for Feb. 1 triggered a sharp reversal in risk assets, with Bitcoin rebounding above $90,000 after testing $87,300 earlier in the session. The move erased most of a two-day sellof…",
    "link": "https://cryptoslate.com/bitcoin-prices-are-recovering-as-gold-retreats-because-a-surprise-framework-deal-just-killed-the-tariff-threat/",
    "timestamp": "2026-01-22T12:35:56Z"
  },
  {
    "title": "UK’s Starmer welcomes Trump move to drop Greenland tariff threat",
    "description": "LONDON, Jan 22 - British Prime Minister Keir Starmer told his Danish counterpart on Thursday that U.S. President Donald Trump’s decision not to pursue tariffs on European… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/22/uk-s-starmer-welcomes-trump-move-to-drop-greenland-tariff-threat",
    "timestamp": "2026-01-22T12:35:42Z"
  },
  {
    "title": "House moves to finish government funding as Democrats decry Homeland Security bill",
    "description": "With Republicans in charge of both chambers of Congress and the White House, Democrats have few good options to express their opposition.",
    "link": "https://www.bostonherald.com/2026/01/22/congress-budget-democrats-homeland-security/",
    "timestamp": "2026-01-22T12:33:41Z"
  },
  {
    "title": "President Trump reverses Greenland stance, cancels European tariffs",
    "description": "President Donald Trump reversed his stance on Greenland, agreeing with NATO on a framework for Arctic security and canceling planned tariffs on European nations.",
    "link": "https://www.kcci.com/article/president-trump-reverses-greenland-stance-cancels-european-tariffs/70087465",
    "timestamp": "2026-01-22T12:33:12Z"
  },
  {
    "title": "Ukraine peace talks down to one sticking point – Witkoff",
    "description": "US special envoy Steve Witkoff is traveling to Moscow to resolve what he describes as one last issue in the Ukraine peace talks Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631334-witkoff-ukraine-peace-one-issue/",
    "timestamp": "2026-01-22T12:33:08Z"
  },
  {
    "title": "In populist split, Trump’s fans in Europe broke with him on Greenland - The Washington Post",
    "description": "In populist split, Trump’s fans in Europe broke with him on GreenlandThe Washington Post For Europe’s far right, Trump has become a liabilitypolitico.eu Donald Trump’s bullying is irritating his European populist chumsThe Economist Europe's far right and popu…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180637506",
    "timestamp": "2026-01-22T12:33:02Z"
  },
  {
    "title": "Watch! Internet can’t stop talking about how this newlywed bride used her Rs 2,100 shagun",
    "description": "A viral wedding video shows a bride, still in her bridal attire, taking charge at a petrol pump. She uses wedding 'shagun' money to pay for fuel, demonstrating shared responsibility and a relatable, practical approach to married life. The clip has garnered mi…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/watch-internet-cant-stop-talking-about-how-this-newlywed-bride-used-her-rs-2100-shagun/articleshow/127152654.cms",
    "timestamp": "2026-01-22T12:32:49Z"
  },
  {
    "title": "Trump in Board of Peace launch: Gaza will be 'beautifully rebuilt' in conjunction with UN",
    "description": "U.S. President Donald Trump said Hamas 'were literally born with weapons in their hands – they have to give up weapons. If they won't do it, it will be the end of them.' He added that Iran 'wants to talk, and we will talk'",
    "link": "https://www.haaretz.com/israel-news/2026-01-22/ty-article/.premium/trump-gaza-will-be-beautifully-rebuilt-then-we-can-move-on-to-other-things-with-un/0000019b-e578-d1e6-a99b-e7f98ec10000",
    "timestamp": "2026-01-22T12:32:44Z"
  },
  {
    "title": "Trump misspoke at Davos. Karoline Leavitt told reporters not to believe their ears.",
    "description": "This is The Poynter Report, your daily guide to the news about news. Subscribe to get it in your inbox every weekday. Greenland? Iceland? What is President Donald Trump talking […]\nThe post Trump misspoke at Davos. Karoline Leavitt told reporters not to belie…",
    "link": "https://www.poynter.org/commentary/2026/did-trump-call-greenland-iceland-davos-speech/",
    "timestamp": "2026-01-22T12:30:19Z"
  },
  {
    "title": "Prabowo joins launch of Gaza Board of Peace at WEF 2026 in Davos",
    "description": "Indonesian President Prabowo Subianto attended the launch of the Gaza Board of Peace on Thursday on the sidelines of the World Economic Forum (WEF) 2026 at ...",
    "link": "https://en.antaranews.com/news/401134/prabowo-joins-launch-of-gaza-board-of-peace-at-wef-2026-in-davos",
    "timestamp": "2026-01-22T12:30:04Z"
  },
  {
    "title": "Federal Judge Nixes Rule That Enabled Clearcutting in the Name of Taming Wildfires",
    "description": "This story was originally published by Inside Climate News and is reproduced here as part of the Climate Desk collaboration. A niche rule established by the US Forest Service to justify the clearing of tens of thousands of acres of forest in the name of reduc…",
    "link": "https://www.motherjones.com/politics/2026/01/oregon-district-court-logging-rule-clearcutting-thinning-forests-wildfire-mitigation-ce6/",
    "timestamp": "2026-01-22T12:30:00Z"
  },
  {
    "title": "The Real Fight for the Smithsonian",
    "description": "Its museums, more than any others, shape the nation’s narrative. No wonder the country argues about it.",
    "link": "https://www.theatlantic.com/culture/2026/01/smithsonian-history-storytelling-moca-monuments/685702/",
    "timestamp": "2026-01-22T12:30:00Z"
  },
  {
    "title": "House moves to finish government funding as Democrats decry Homeland Security bill",
    "description": "The House is looking to pass this year’s final batch of spending bills",
    "link": "https://abcnews.go.com/US/wireStory/house-moves-finish-government-funding-democrats-decry-homeland-129448007",
    "timestamp": "2026-01-22T12:29:53Z"
  },
  {
    "title": "NATO chief Mark Rutte's shows he's the 'Trump Whisperer' after Greenland diplomacy with Trump",
    "description": "NATO Secretary-General Mark Rutte appears to have been instrumental in persuading U.S. President Donald Trump to scrap his threat of tariffs as he presses for control over Greenland",
    "link": "https://abcnews.go.com/International/wireStory/nato-chief-mark-ruttes-shows-trump-whisperer-after-129448435",
    "timestamp": "2026-01-22T12:29:51Z"
  },
  {
    "title": "Indian Ocean should be free from ‘big power rivalry’ – ex-diplomat on Trump’s Chagos claim",
    "description": "India supports Mauritius’ sovereignty over the Chagos Islands, Dilip Sinha has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/india/631341-indian-ocean-should-be-free/",
    "timestamp": "2026-01-22T12:29:02Z"
  },
  {
    "title": "Trump launches 'Board of Peace' at Davos",
    "description": "DAVOS, Switzerland: US President Donald Trump kicked off his new \"Board of Peace\" at Davos on Thursday (Jan 22), with a signing ceremony for a body with a US$1 billion membership fee and a controversial list of in",
    "link": "https://www.channelnewsasia.com/world/donald-trump-launches-board-peace-rival-un-5875576",
    "timestamp": "2026-01-22T12:29:00Z"
  },
  {
    "title": "Are your tolls unpaid? New government rules make toll clearance mandatory before selling your vehicle or renewing fitness certificate",
    "description": "News News: The Indian government has taken a crucial step regarding the collection of tolls on National Highways. For a toll-free road system to become a reality.",
    "link": "https://timesofindia.indiatimes.com/auto/news/are-your-tolls-unpaid-new-government-rules-make-toll-clearance-mandatory-before-selling-your-vehicle-or-renewing-fitness-certificate/articleshow/127149620.cms",
    "timestamp": "2026-01-22T12:28:13Z"
  },
  {
    "title": "What is the Board of Peace that Trump signed at Davos and who are its members?",
    "description": "President Donald Trump launched the Board of Peace at Davos on January 22, 2026. This new group will oversee post-war Gaza and global conflicts. Trump serves as the lifelong Chairman. Over 20 nations joined, including Israel and Saudi Arabia. Membership costs…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-the-board-of-peace-that-trump-signed-at-davos-and-who-are-its-members/articleshow/127150792.cms",
    "timestamp": "2026-01-22T12:27:15Z"
  },
  {
    "title": "Skoda Kushaq facelift Monte Carlo vs Standard compared: Which should you buy",
    "description": "The Monte Carlo is better suited to those who want a sportier appearance. ​​​The Prestige, in comparison, is aimed at buyers looking for a more understated and comfortable SUV. With cleaner exterior detailing, a lighter interior colour scheme and comfort-focu…",
    "link": "https://timesofindia.indiatimes.com/auto/cars/skoda-kushaq-facelift-monte-carlo-vs-standard-compared-which-should-you-buy/articleshow/127118068.cms",
    "timestamp": "2026-01-22T12:27:08Z"
  },
  {
    "title": "President Trump reverses Greenland stance, cancels European tariffs",
    "description": "President Donald Trump reversed his stance on Greenland, agreeing with NATO on a framework for Arctic security and canceling planned tariffs on European nations.",
    "link": "https://www.wmur.com/article/president-trump-reverses-greenland-stance-cancels-european-tariffs/70087465",
    "timestamp": "2026-01-22T12:26:38Z"
  },
  {
    "title": "Trump's latest tariffs U-turn is sparking a global market rally — and reviving talk of the 'TACO trade'",
    "description": "\"Donald Trump’s TACO bell has rung once again, much to the joy of financial markets,\" one investor said on Thursday.",
    "link": "https://www.cnbc.com/2026/01/22/trump-tariffs-greenland-europe-deal-taco-trade-sell-america.html",
    "timestamp": "2026-01-22T12:26:33Z"
  },
  {
    "title": "Donald Trump had Gavin Newsom removed from speaking at a Davos event",
    "description": "The world’s elite have gathered in Davos, Switzerland this week for the World Economic Forum. I remember when Davos was such a hotspot, actual celebrities mingled with trade ministers and business titans. These days, Davos is a bummer because of Donald Trump …",
    "link": "https://www.celebitchy.com/958291/donald_trump_had_gavin_newsom_removed_from_speaking_at_a_davos_event/",
    "timestamp": "2026-01-22T12:25:16Z"
  },
  {
    "title": "From ‘ending Ukraine-Russia war soon’ to unveiling ‘Board of Peace’: Key highlights of Donald Trump’s speech",
    "description": "Trump suggested that the Board of Peace, which will be headed by him, has global ambitions.",
    "link": "https://indianexpress.com/article/world/ukraine-russia-war-board-of-peace-key-highlights-of-donald-trumps-speech-10488995/",
    "timestamp": "2026-01-22T12:25:09Z"
  },
  {
    "title": "Would Barack Obama run again? Michelle Obama responds to third-term speculation if Trump changes law",
    "description": "Michelle Obama firmly stated her opposition to her husband, Barack Obama, running for a third term, even if laws were changed. She believes two terms are sufficient, emphasizing the need for new visions and energy to address the country's evolving challenges.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/would-barack-obama-run-again-michelle-obama-responds-to-third-term-speculation-if-trump-changes-law/articleshow/127148733.cms",
    "timestamp": "2026-01-22T12:24:26Z"
  },
  {
    "title": "Greenland dispute shows why Europe must be more self-reliant, Taoiseach says",
    "description": "Speaking at Davos, Micheal Martin also confirmed Ireland had been invited to join Trump’s Gaza peace board",
    "link": "https://www.irishtimes.com/business/2026/01/22/greenland-dispute-shows-why-europe-must-be-more-self-reliant-taoiseach-says/",
    "timestamp": "2026-01-22T12:24:10Z"
  },
  {
    "title": "Volatility and hidden risks: 2026 is year of living dangerously for investors and markets",
    "description": "Gold prices have rocketed, and when that happens it is time to worry",
    "link": "https://www.irishtimes.com/your-money/2026/01/22/volatility-and-hidden-risks-2026-is-year-of-living-dangerously-for-investors-and-markets/",
    "timestamp": "2026-01-22T12:21:35Z"
  },
  {
    "title": "Backstage stare down cave sees Stephen Miller taunted by foe: 'Honestly, we feel sorry'",
    "description": "California Gov. Gavin Newsom roasted President Donald Trump and some of his top officials during his trip to the World Economic Forum in Switzerland.The presumed Democratic 2028 presidential contender needled White House deputy chief of staff Stephen Miller o…",
    "link": "https://www.rawstory.com/gavin-newsom-stephen-miller/",
    "timestamp": "2026-01-22T12:16:26Z"
  },
  {
    "title": "New trade map takes shape in Davos amid Trump tariffs",
    "description": "President Donald Trump's use of tariffs as a foreign policy tool added fresh impetus in Davos this week to efforts to boost global trade beyond the US, with frustration palpable among many of Washington's top trading partners.",
    "link": "https://www.rte.ie/news/business/2026/0122/1554506-new-trade-map-takes-shape-in-davos-amid-trump-tariffs/",
    "timestamp": "2026-01-22T12:14:33Z"
  },
  {
    "title": "Washington state considers eliminating interest on medical debt",
    "description": "Washington state considers eliminating interest on medical debtoregonlive.com",
    "link": "https://www.oregonlive.com/nation/2026/01/washington-state-considers-eliminating-interest-on-medical-debt.html",
    "timestamp": "2026-01-22T12:14:01Z"
  },
  {
    "title": "Epstein and the US bid for Greenland – the link you probably never knew (RT VIDEO)",
    "description": "History has thrown up an unusual link as Trump bids to acquire Greenland from Denmark Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631342-virgin-islands-greenland-epstein/",
    "timestamp": "2026-01-22T12:13:08Z"
  },
  {
    "title": "India deeply engaged on trade matters: Vaishnaw on Trump's remarks on US deal",
    "description": "Following Donald Trump's optimistic statement about a \"good\" trade deal with India, Union Minister Ashwini Vaishnaw expressed encouragement, highlighting India's significant role in global trade. Trump, speaking at the World Economic Forum, praised Prime Mini…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-deeply-engaged-on-trade-matters-vaishnaw-on-trumps-remarks-on-us-deal/articleshow/127151344.cms",
    "timestamp": "2026-01-22T12:11:06Z"
  },
  {
    "title": "Trump sought Greenland deal that would hand U.S. more control over security",
    "description": "President Donald Trump arrived in Davos on Wednesday looking to negotiate a deal that would give the U.S. more control over Greenland's security and in the broader Arctic region, a congressional official and two former U.S. officials told NBC News.",
    "link": "https://www.nbcnews.com/world/greenland/trump-greenland-deal-us-control-security-arctic-nato-denmark-rcna255360",
    "timestamp": "2026-01-22T12:10:52Z"
  },
  {
    "title": "Greenland or Iceland: Do you know the difference?",
    "description": "Donald Trump mixed up the two countries in Davos. Will you make the same mistake in our quiz?",
    "link": "https://www.politico.eu/article/greenland-iceland-donald-trump-davos-quiz/",
    "timestamp": "2026-01-22T12:10:16Z"
  },
  {
    "title": "Silicon Valley Pours Out Lobbying Cash and Flattery to Win Over Deal-Minded Trump",
    "description": "Silicon Valley has learned how to succeed in Donald Trump’s Washington: Spend record amounts. Visit the White House. Flatter the president as often as you can.",
    "link": "https://financialpost.com/pmn/business-pmn/silicon-valley-pours-out-lobbying-cash-and-flattery-to-win-over-deal-minded-trump",
    "timestamp": "2026-01-22T12:08:29Z"
  },
  {
    "title": "Rapid rollback of Kurdish-led forces reshapes Sharaa's Syria",
    "description": "The retreat of the Syrian Democratic Forces (SDF) in the north-east marks the biggest change of control in Syria since the fall of Bashar al-Assad.",
    "link": "https://www.bbc.com/news/articles/c9311l0d40qo",
    "timestamp": "2026-01-22T12:08:12Z"
  },
  {
    "title": "Transcript: Trump Press Sec Goes Full Cult as Davos Mockery Gets Worse",
    "description": "The following is a lightly edited transcript of the January 22 episode of TheDaily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. By now you…",
    "link": "https://newrepublic.com/article/205534/transcript-trump-press-sec-goes-full-cult-davos-mockery-gets-worse",
    "timestamp": "2026-01-22T12:08:07Z"
  },
  {
    "title": "Trump drops Greenland tariff threat and massive winter storm to slam Eastern states: Morning Rundown",
    "description": "Trump meets with NATO's secretary general on Greenland. A memo shows that ICE told officers and agents they can forcibly enter homes without a judicial warrant. And a major storm is set to bring record cold to the U.S.",
    "link": "https://www.nbcnews.com/news/us-news/trump-drops-greenland-tariff-threat-winter-storm-morning-rundown-rcna255346",
    "timestamp": "2026-01-22T12:07:55Z"
  },
  {
    "title": "EU leaders gather to chart a new course for transatlantic ties after Trump threats over Greenland",
    "description": "European Union leaders are gathering for emergency talks to address transatlantic relations after a turbulent two weeks dominated by U.S. President Donald Trump's renewed threats to take control of Greenland",
    "link": "https://abcnews.go.com/International/wireStory/eu-leaders-gather-chart-new-transatlantic-ties-after-129447474",
    "timestamp": "2026-01-22T12:05:34Z"
  },
  {
    "title": "The Police, and other bands you’re not in any way surprised hated each other",
    "description": "THE music industry is known for making people who are already dickheads worse. But these artists were so egotistical or strange it’s a wonder they managed to make any music together.",
    "link": "https://www.thedailymash.co.uk/news/arts-entertainment/the-police-and-other-bands-youre-not-in-any-way-surprised-hated-each-other-20260122263602",
    "timestamp": "2026-01-22T12:00:34Z"
  },
  {
    "title": "Quote of the day by Parashar: \"The Importance of Lagna in a Horoscope\"",
    "description": "Rishi Parashar's Brihat Parashar Hora Shastra highlights the paramount importance of Lagna in Vedic astrology. Representing the physical body, appearance, and vitality, Lagna serves as the foundation for all twelve houses in a horoscope. It dictates physical …",
    "link": "https://timesofindia.indiatimes.com/astrology/others/quote-of-the-day-by-parashar-the-importance-of-lagna-in-a-horoscope/articleshow/127132989.cms",
    "timestamp": "2026-01-22T12:00:13Z"
  },
  {
    "title": "Donald Trump Still Wants Greenland, But Does He Want Its Rare Earths Too?",
    "description": "Donald Trump Still Wants Greenland, But Does He Want Its Rare Earths Too?",
    "link": "https://www.wired.com/video/watch/donald-trump-still-wants-greenland-but-does-he-want-its-rare-earths-too/",
    "timestamp": "2026-01-22T12:00:00Z"
  },
  {
    "title": "Alberta’s Fiscal Crisis Is Self-Inflicted",
    "description": "Smith gambled that strong oil prices would deliver her chaos-making government a safe ride on the roller-coaster. But if Trump’s Venezuela gambit succeeds, Smith’s increasingly unpopular government could find itself flying off the track all together.",
    "link": "https://www.resilience.org/stories/2026-01-22/albertas-fiscal-crisis-is-self-inflicted/",
    "timestamp": "2026-01-22T11:55:02Z"
  },
  {
    "title": "Denmark rejects sovereignty talks over Greenland",
    "description": "Denmark’s prime minister insisted that her country can’t negotiate on its sovereignty after President Donald Trump said he agreed a “framework of a future deal” on Arctic security with the head of NATO.",
    "link": "https://www.koco.com/article/denmark-rejects-greenland-sovereignty-talks/70088362",
    "timestamp": "2026-01-22T11:54:06Z"
  },
  {
    "title": "Jack Smith is ‘not afraid’ of Donald Trump, his legal team says ahead of Thursday testimony - CNN",
    "description": "Jack Smith is ‘not afraid’ of Donald Trump, his legal team says ahead of Thursday testimonyCNN Jack Smith to Testify Before Congress on Trump InvestigationsThe New York Times Jack Smith testimony will warn Americans not to take the rule of law 'for granted'NB…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180637374",
    "timestamp": "2026-01-22T11:53:15Z"
  },
  {
    "title": "Trump unveils ‘Board of Peace’ at Davos",
    "description": "Donald Trump launches his ‘Board of Peace’ at Davos, a body with a $1B membership fee and a controversial list of invitees aiming to rival the UN.\n\nRead More: https://punchng.com/trump-unveils-board-of-peace-at-davos/",
    "link": "https://punchng.com/trump-unveils-board-of-peace-at-davos/",
    "timestamp": "2026-01-22T11:50:19Z"
  },
  {
    "title": "Gold price drops big on Thursday. Short-term gold rate predicted by experts",
    "description": "Gold rate prediction: Gold price is further pressured by fading expectations of U.S. interest rate cuts in ‌the near ‌term.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-drops-big-on-thursday-short-term-gold-rate-predicted-by-experts/articleshow/127149055.cms",
    "timestamp": "2026-01-22T11:49:57Z"
  },
  {
    "title": "MAGA Lawmakers Pull 'Pathetic' Cake Stunt To Applaud Trump's Greenland Threats",
    "description": "Some Republican House members gathered at Kennedy Center for a slice of idiocy.",
    "link": "https://www.huffpost.com/entry/maga-anna-paulina-luna-andy-ogles-greenland-cake-kennedy-center_n_6971f927e4b0e15d54cbf760",
    "timestamp": "2026-01-22T11:49:45Z"
  },
  {
    "title": "Denmark's Prime Minister Has A Warning For Trump Following Davos 'Deal'",
    "description": "Trump walked back threats to place tariffs on European countries opposing his desire to seize Greenland and ruled out the use of force.",
    "link": "https://www.huffpost.com/entry/denmark-greenland-security-talks_n_69720a86e4b08d1cc243aa4b",
    "timestamp": "2026-01-22T11:48:18Z"
  },
  {
    "title": "Republican Defends Trump Mixing Up Greenland With Iceland, Chalks It Up to ‘His Brand’",
    "description": "A Republican guest on CNN NewsNight defended President Donald Trump for repeatedly confusing Greenland with Iceland on Wednesday.\nThe post Republican Defends Trump Mixing Up Greenland With Iceland, Chalks It Up to ‘His Brand’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/republican-defends-trump-mixing-up-greenland-with-iceland-chalks-it-up-to-his-brand/",
    "timestamp": "2026-01-22T11:46:47Z"
  },
  {
    "title": "Trump at Davos marks the start of a new era in world affairs",
    "description": "Delegates at the World Economic Forum at Davos have been confronted with starkly opposing visions of the future of world affairs.",
    "link": "https://theconversation.com/trump-at-davos-marks-the-start-of-a-new-era-in-world-affairs-274007",
    "timestamp": "2026-01-22T11:45:31Z"
  },
  {
    "title": "Mapping the 10 countries with the most overseas territories",
    "description": "Nations worldwide maintain territories for strategic and military purposes, often remnants of colonial empires.",
    "link": "https://www.aljazeera.com/news/2026/1/22/mapping-the-10-countries-with-the-most-overseas-territories",
    "timestamp": "2026-01-22T11:44:08Z"
  },
  {
    "title": "Massive security alert at Trump's Doonbeg resort after suspicious package discovery",
    "description": "For the members and staff of the Trump International Golf Links & Hotel in Doonbeg, Ireland, the morning of Wednesday, January 21, 2026, was supposed to be another normal morning o",
    "link": "https://www.marca.com/en/golf/2026/01/22/69720d4c268e3e4b5b8b45d0.html",
    "timestamp": "2026-01-22T11:43:20Z"
  },
  {
    "title": "Dendias on Turkey: The extension of our waters is our unilateral right – We do not tolerate the Casus Belli",
    "description": "“These are not serious matters. Interference in a country’s internal affairs is not customary,” he said regarding the criticism directed personally at him by Ankara and the scenarios about a personal agenda. “I speak with both of them,” he said about Karamanl…",
    "link": "https://en.protothema.gr/2026/01/22/dendias-on-turkey-the-extension-of-our-waters-is-our-unilateral-right-we-do-not-tolerate-the-casus-belli/",
    "timestamp": "2026-01-22T11:43:00Z"
  },
  {
    "title": "Russia-China cooperation in Arctic is a concern for NATO, top general says",
    "description": "Jan 22 (Reuters) - Increased cooperation between China and Russia is a source of concern for NATO, the top commander of the trans-Atlantic alliance Alexus Grynkewich said… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/22/russia-china-cooperation-in-arctic-is-a-concern-for-nato-top-general-says",
    "timestamp": "2026-01-22T11:42:50Z"
  },
  {
    "title": "Starmer welcomes Trump dropping tariff threats over Greenland",
    "description": "The prime minister says the \"hard yards\" of bolstering Arctic security can begin after the US president's shift.",
    "link": "https://www.bbc.com/news/articles/cjrzzn98qv3o",
    "timestamp": "2026-01-22T11:41:16Z"
  },
  {
    "title": "'Nobody’s going to believe him': Trump’s Greenland 'deal' sparks relief — and confusion",
    "description": "Trump said he had the \"concept of a deal\" on Greenland, but didn't share details of the agreement — or who agreed to it.",
    "link": "https://www.cnbc.com/2026/01/22/trumps-greenland-deal-framework-and-tariff-backdown-confuse.html",
    "timestamp": "2026-01-22T11:40:31Z"
  },
  {
    "title": "Morning Bid: Davos détente",
    "description": "By Mike Dolan Jan 22 -   What matters in U.S. and global markets today By Mike Dolan, Editor-At-Large, Finance and Markets World stocks bounced back after...",
    "link": "https://finance.yahoo.com/news/morning-bid-davos-d-tente-113408841.html",
    "timestamp": "2026-01-22T11:39:11Z"
  },
  {
    "title": "Denmark says its sovereignty is not negotiable after Trump’s Greenland about-turn",
    "description": "Denmark's Prime Minister wrote that NATO is aware of the position that anything political can be negotiated on “but we cannot negotiate on our sovereignty.”",
    "link": "https://www.bostonherald.com/2026/01/22/denmark-leader-sovereignty-not-negotiable/",
    "timestamp": "2026-01-22T11:38:36Z"
  },
  {
    "title": "India among those absent at signing ceremony of Trump's 'Board of Peace'",
    "description": "US President Donald Trump launched his \"Board of Peace\" in Davos to foster lasting peace in Gaza and resolve global conflicts. While many nations, including India, France, and the UK, did not attend the unveiling, others like Pakistan and Saudi Arabia joined …",
    "link": "https://economictimes.indiatimes.com/news/india/india-among-those-absent-at-signing-ceremony-of-trumps-board-of-peace/articleshow/127148219.cms",
    "timestamp": "2026-01-22T11:37:13Z"
  },
  {
    "title": "'Trump murdered it': Urgent 'therapy' session called as leaders traumatized by president",
    "description": "World leaders and European Union dignitaries believe the American Dream is dead at the hands of Donald Trump. Following the president's speech in Davos, Switzerland, anonymous sources from within the governments of several countries cited growing concerns wit…",
    "link": "https://www.rawstory.com/trump-american-dream/",
    "timestamp": "2026-01-22T11:36:10Z"
  },
  {
    "title": "Son-in-law of Venezuelan opposition candidate freed from jail, wife says",
    "description": "Rafael Tudares was arrested after his father-in-law, Edmundo González, ran against Nicolás Maduro in the election.",
    "link": "https://www.bbc.com/news/articles/cq5yywx39e7o",
    "timestamp": "2026-01-22T11:35:20Z"
  },
  {
    "title": "EU leaders to reassess U.S. ties despite Trump U-turn on Greenland",
    "description": "BRUSSELS, Jan 22 (Reuters) - EU leaders ‌will rethink their ties with the U.S. at an emergency summit on Thursday after Donald Trump's threat of tariffs and even military action to acquire ‌Greenland badly shook confidence in the transatlantic relationship, d…",
    "link": "https://www.thestar.com.my/news/world/2026/01/22/eu-leaders-to-reassess-us-ties-despite-trump-u-turn-on-greenland",
    "timestamp": "2026-01-22T11:35:00Z"
  },
  {
    "title": "Denmark says Greenland sovereignty a ‘clear red line’ and NATO cannot negotiate on its behalf",
    "description": "Trump said the deal reached yesterday with NATO gives the US ‘everything we wanted’.",
    "link": "https://www.thejournal.ie/denmark-us-trump-nato-deal-6934796-Jan2026/",
    "timestamp": "2026-01-22T11:34:55Z"
  },
  {
    "title": "Chinese companies reportedly considering sourcing H200 chips from the black market as chips held at the border — demand for Nvidia AI GPUs remain high despite political uncertainty",
    "description": "Days after Beijing stopped the entry of H200 chips at the border, Chinese tech companies are reportedly considering purchasing them from the black market at a higher price just to get their hands on the powerful AI GPU.",
    "link": "https://www.tomshardware.com/tech-industry/chinese-companies-reportedly-considering-sourcing-h200-chips-from-the-black-market-as-chips-held-at-the-border-demand-for-nvidia-ai-gpus-remain-high-despite-political-uncertainty",
    "timestamp": "2026-01-22T11:34:38Z"
  },
  {
    "title": "Scott Bessent Is in Denial – and the Bond Market Is Watching",
    "description": "Far from warning Donald Trump against undermining foreign investors’ confidence in the US, his Treasury secretary is backing the president and downplaying the risks of a bond selloff. But markets are telling a different story.",
    "link": "https://www.project-syndicate.org/commentary/scott-bessent-is-underestimating-the-risk-of-a-us-treasury-selloff-by-desmond-lachman-2026-01",
    "timestamp": "2026-01-22T11:33:55Z"
  },
  {
    "title": "Rupee edges up from all-time low to 91.62 against US dollar",
    "description": "The rupee rises to 91.62 against the dollar, influenced by RBI intervention and positive equity trends amid geopolitical uncertainties.",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-edges-up-from-all-time-low-to-9162-against-us-dollar/article70537596.ece",
    "timestamp": "2026-01-22T11:32:01Z"
  },
  {
    "title": "Trump and world leaders sign Gaza Board of Peace charter",
    "description": "",
    "link": "https://www.foxnews.com/politics/trump-world-leaders-sign-gaza-board-peace-charter",
    "timestamp": "2026-01-22T11:31:58Z"
  },
  {
    "title": "President Trump’s Davos remarks on Greenland misrepresented US and Danish history",
    "description": "President Donald Trump made his pitch to acquire Greenland to international leaders in Davos, Switzerland, Jan. 21, saying for the first time he did not plan for the U.S. to take the […]\nThe post President Trump’s Davos remarks on Greenland misrepresented US …",
    "link": "https://www.poynter.org/fact-checking/2026/did-greenland-ever-belong-to-usa/",
    "timestamp": "2026-01-22T11:30:57Z"
  },
  {
    "title": "10 Thursday AM Reads",
    "description": "My morning train WFH reads: • Donald Trump vs. the World: “The bond market cannot be bullied, fooled, or bribed. It does not flatter or make deals. It reveals all.” (The Bulwark) • Greenland Clash Risks Undermining America’s Place in World Economic Order: The…",
    "link": "https://ritholtz.com/2026/01/10-thursday-am-reads-481/",
    "timestamp": "2026-01-22T11:30:46Z"
  },
  {
    "title": "Don’t buy MAGA’s baby boom hype",
    "description": "Usha Vance, Karoline Leavitt and Katie Miller's pregnancies do not signal a return to the 1950s",
    "link": "https://www.salon.com/2026/01/22/dont-buy-magas-baby-boom-hype/",
    "timestamp": "2026-01-22T11:30:31Z"
  },
  {
    "title": "Jack Smith is set to testify at a public hearing about his Trump investigations",
    "description": "Smith was appointed in 2022 by Biden's Justice Department to oversee investigations into Trump.",
    "link": "https://www.bostonherald.com/2026/01/22/jack-smith-trump-investigations-hearing/",
    "timestamp": "2026-01-22T11:30:07Z"
  },
  {
    "title": "Trump launches ‘Board of Peace’ with claims that world is ‘richer, safer’",
    "description": "Board was mooted as part of plan for Gaza  ceasefire but Trump has suggested a broader geopolitical role",
    "link": "https://www.irishtimes.com/world/middle-east/2026/01/22/trump-launches-board-of-peace-with-claims-that-world-is-richer-safer/",
    "timestamp": "2026-01-22T11:29:33Z"
  },
  {
    "title": "Russia-Ukraine peace talks ‘down to one issue’, says US envoy Witkoff",
    "description": "The announcement comes before a meeting between US President Trump and his Ukrainian counterpart, Zelenskyy, in Davos.",
    "link": "https://www.aljazeera.com/news/2026/1/22/russia-ukraine-peace-talks-down-to-one-issue-says-us-envoy-witkoff",
    "timestamp": "2026-01-22T11:26:30Z"
  },
  {
    "title": "Trump Signs Board of Peace Charter, Vowing to ‘End’ Hamas If It Doesn’t Disarm",
    "description": "Trump said the body would “stop generations of hatred and bloodshed” in the Middle East “and forge a beautiful, everlasting and glorious peace” for the world.\nThe post Trump Signs Board of Peace Charter, Vowing to ‘End’ Hamas If It Doesn’t Disarm first appear…",
    "link": "https://www.mediaite.com/media/tv/trump-signs-board-of-peace-charter-vowing-to-end-hamas-if-it-doesnt-disarm/",
    "timestamp": "2026-01-22T11:25:57Z"
  },
  {
    "title": "Jimmy Kimmel Interviews Trump’s ‘Badly Bruised Right Hand’ in Skit Mocking FCC Warning",
    "description": "The skit came after the FCC instructed networks to offer political candidates equal time on their shows, warning against shows “motivated by partisan purposes.”\nThe post Jimmy Kimmel Interviews Trump’s ‘Badly Bruised Right Hand’ in Skit Mocking FCC Warning fi…",
    "link": "https://www.mediaite.com/media/tv/jimmy-kimmel-interviews-trumps-badly-bruised-right-hand-in-skit-mocking-fcc-warning/",
    "timestamp": "2026-01-22T11:25:28Z"
  },
  {
    "title": "Vance heads to Minneapolis amid tension over ICE crackdown",
    "description": "MINNEAPOLIS, Jan 22 (Reuters) - Vice President ‌JD Vance is expected to visit Minneapolis on Thursday to show support for a massive federal law enforcement operation underway in a city that ‌has been on edge since an ICE officer shot dead a 37-year-old mother…",
    "link": "https://www.thestar.com.my/news/world/2026/01/22/vance-heads-to-minneapolis-amid-tension-over-ice-crackdown",
    "timestamp": "2026-01-22T11:25:00Z"
  },
  {
    "title": "Trump rolls out his Board of Peace at Davos, but may top US allies aren’t participating",
    "description": "Trump emphasized global participation, despite many U.S. allies opting out.",
    "link": "https://www.bostonherald.com/2026/01/22/trump-board-of-peace-unveiling/",
    "timestamp": "2026-01-22T11:23:38Z"
  },
  {
    "title": "\"We’re gonna come back – it’s gonna be bigger than Oasis.\" Kyle Gass reflects on the \"highly inappropriate, dangerous\" joke that forced Tenacious D to go on hiatus, and reveals his horror over the \"tsunami of s**t\" that followed",
    "description": "Tenacious D's Kyle Gass on the joke which caused the group's world to crumble around them",
    "link": "https://www.loudersound.com/bands-artists/tenacious-d-trump-joke-horror-regret",
    "timestamp": "2026-01-22T11:21:21Z"
  },
  {
    "title": "La Hongrie bloque une plateforme de paris prédisant la victoire de l'opposition : des parieurs meilleurs que les sondeurs ? (Anglais)",
    "description": "Polymarket hosts a betting option for the upcoming Hungarian election, where Péter Magyar currently leads in the odds – one user even bet over 225,000 USD on th",
    "link": "https://english.atlatszo.hu/2026/01/22/better-than-polling-betting-platform-predicting-tisza-victory-blocked-in-hungary/",
    "timestamp": "2026-01-22T11:21:12Z"
  },
  {
    "title": "Donald Trump's latest visa ban hits African countries hard",
    "description": "A decision by the US government to suspend visa procedures for numerous countries, including African ones, has come into effect. Experts say it is part of Donald Trump's strategy of portraying immigrants as a threat.",
    "link": "https://www.dw.com/en/donald-trumps-latest-visa-ban-hits-african-countries-hard/a-75590864",
    "timestamp": "2026-01-22T11:21:00Z"
  },
  {
    "title": "Trump's latest visa ban hits African countries hardest",
    "description": "A decision by the US to suspend visa procedures for numerous countries, including African, has come into effect. Experts say it is part of President Trump's plan to portray immigrants as a threat to Americans.",
    "link": "https://www.dw.com/en/trumps-latest-visa-ban-hits-african-countries-hardest/a-75590864",
    "timestamp": "2026-01-22T11:21:00Z"
  },
  {
    "title": "Donald Trump and world leaders sign ‘Board of Peace’ charter",
    "description": "Donald Trump hosted a signing ceremony in Davos, Switzerland, to announce the first charter of his ‘Board of Peace'.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/22/donald-trump-and-world-leaders-sign-board-of-peace-charter",
    "timestamp": "2026-01-22T11:20:00Z"
  },
  {
    "title": "UK PM Starmer: time for ‘hard yards’ on Arctic security after U.S. tariff threat dropped",
    "description": "LONDON, Jan 22 (Reuters) - British Prime Minister Keir Starmer said there would be “hard yards” ahead to address security concerns in the Arctic after U.S. President Dona… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/22/uk-pm-starmer-time-for-hard-yards-on-arctic-security-after-u-s-tariff-threat-dropped",
    "timestamp": "2026-01-22T11:17:13Z"
  },
  {
    "title": "For Europe’s far right, Trump has become a liability - politico.eu",
    "description": "For Europe’s far right, Trump has become a liabilitypolitico.eu Europe’s Populists Embraced Trump. Now They Are Getting Buyer’s Remorse.The Wall Street Journal Donald Trump’s bullying is irritating his European populist chumsThe Economist Europe's far right a…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180637286",
    "timestamp": "2026-01-22T11:12:32Z"
  },
  {
    "title": "What we know about Trump's 'framework of future deal' over Greenland",
    "description": "Denmark and Greenland have made it clear they will not relinquish sovereignty of the world's largest island.",
    "link": "https://www.bbc.com/news/articles/c86vvjxe9z7o",
    "timestamp": "2026-01-22T11:10:17Z"
  },
  {
    "title": "U.S. deports eight Palestinians to West Bank using private jet",
    "description": "A private jet was apparently chartered specifically by U.S. authorities for the deportation and belongs to an Israeli-American businessman, Haaretz has learned. According to reports in Forbes, the businessman is a partner in real estate investments with U.S. …",
    "link": "https://www.haaretz.com/us-news/2026-01-22/ty-article/.premium/u-s-deports-eight-palestinians-to-west-bank-using-private-jet/0000019b-e51f-de75-a1bf-e57f38bd0000",
    "timestamp": "2026-01-22T11:09:53Z"
  },
  {
    "title": "Fire at Cox's Bazar refugee camp in Bangladesh destroyed homes and displaced thousands of Rohingya",
    "description": "A massive fire this week has destroyed hundreds of makeshift homes in a Rohingya refugee camp in Cox's Bazar, Bangladesh, displacing more than 2,000 people",
    "link": "https://abcnews.go.com/International/wireStory/fire-coxs-bazar-refugee-camp-bangladesh-destroyed-homes-129445988",
    "timestamp": "2026-01-22T11:09:30Z"
  },
  {
    "title": "Trump Launches His Board of Peace Despite Discord From Allies",
    "description": "President Donald Trump officially launched his Board of Peace initiative, barreling ahead with a project he says will promote geopolitical stability even as its creation spurs rancor and reservations from key allies.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-launches-his-board-of-peace-despite-discord-from-allies",
    "timestamp": "2026-01-22T11:06:59Z"
  },
  {
    "title": "Interim Venezuela leader to visit US",
    "description": "Venezuela’s interim president, Delcy Rodriguez, will visit the US, signaling a significant shift in Venezuela-US relations after Maduro’s removal.\n\nRead More: https://punchng.com/interim-venezuela-leader-to-visit-us/",
    "link": "https://punchng.com/interim-venezuela-leader-to-visit-us/",
    "timestamp": "2026-01-22T11:05:58Z"
  },
  {
    "title": "Trump Launches Promised ‘Board of Peace’ at Davos",
    "description": "U.S. President Donald Trump launched his new \"Board of Peace\" on Thursday at the World Economic Forum (WEF) in Davos, Switzerland.\nThe post Trump Launches Promised ‘Board of Peace’ at Davos appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/01/22/trump-launches-promised-board-of-peace-at-davos/",
    "timestamp": "2026-01-22T11:01:44Z"
  },
  {
    "title": "Yale hosts controversial speaker Trita Parsi accused of promoting Iranian regime interests",
    "description": "Controversial Iranian American Trita Parsi to speak at Yale, sparking outrage amid deadly Iran protests that allegedly killed over 16,000 people.",
    "link": "https://www.foxnews.com/us/yale-hosts-controversial-speaker-trita-parsi-accused-promoting-iranian-regime-interests",
    "timestamp": "2026-01-22T11:00:55Z"
  },
  {
    "title": "'Assassination culture' is on the rise, especially among women, study warns",
    "description": "New survey reveals women are 15% more likely to tolerate political violence, with heavy social media use driving concerning \"assassination culture\" trends.",
    "link": "https://www.foxnews.com/us/assassination-culture-rise-especially-among-women-study-warns",
    "timestamp": "2026-01-22T11:00:54Z"
  },
  {
    "title": "Jack Smith faces public grilling on Capitol Hill about Trump prosecutions",
    "description": "Jack Smith appears for public testimony Thursday before House Republicans after closed-door deposition, facing questions about subpoenaing phone records.",
    "link": "https://www.foxnews.com/politics/jack-smith-faces-public-grilling-capitol-hill-about-trump-prosecutions",
    "timestamp": "2026-01-22T11:00:54Z"
  },
  {
    "title": "Trump’s second term has eroded the foundations of our democracy",
    "description": "The president's second term has chipped away at ideas of diversity and inclusivity.",
    "link": "https://www.salon.com/2026/01/22/trumps-second-term-has-eroded-the-foundations-of-our-democracy-partner/",
    "timestamp": "2026-01-22T11:00:40Z"
  }
]