[
  {
    "title": "Pod Save Australia: Why our obsession with US politics isn't going anywhere",
    "description": "Huge crowds have flocked to live shows for the popular and influential Pod Save America podcast, suggesting Australia's obsession with US politics isn't going away anytime soon.",
    "link": "https://www.abc.net.au/news/2026-02-17/pod-save-america-why-australians-are-obssessed-with-us-politics/106327878",
    "timestamp": "2026-02-16T21:56:48Z"
  },
  {
    "title": "Germany‘s central bank president touts stablecoin and CBDC benefits for EU",
    "description": "In a speech at the New Year’s Reception of the American Chamber of Commerce in Frankfurt, Deutsche Bundesbank President Joachim Nagel addressed concerns on stablecoins and CBDCs.",
    "link": "https://cointelegraph.com/news/germany-central-bank-president-stablecoins",
    "timestamp": "2026-02-16T21:56:24Z"
  },
  {
    "title": "US troops arrive in Nigeria on training mission",
    "description": "Nigeria's government is seeking US help with training, technical support and intelligence-sharing, to combat violence from extremist groups threatening its territory. The United States has sent 100 soldiers to Nigeria, with the hopes of helping the West Afric…",
    "link": "https://www.dw.com/en/us-troops-arrive-in-nigeria-on-training-mission/a-75997231",
    "timestamp": "2026-02-16T21:56:00Z"
  },
  {
    "title": "JUST IN: Anderson Cooper Leaving 60 Minutes — Turned Down Offer to Renew His Deal With CBS News",
    "description": "Anderson Cooper is reportedly leaving 60 Minutes after turning down an offer from CBS News to renew his contract.\nThe post JUST IN: Anderson Cooper Leaving 60 Minutes — Turned Down Offer to Renew His Deal With CBS News first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/just-in-anderson-cooper-leaving-60-minutes-turned-down-offer-to-renew-his-deal-with-cbs-news/",
    "timestamp": "2026-02-16T21:54:23Z"
  },
  {
    "title": "Secretary of State Marco Rubio in Europe: No Foreign National Has a Right to a Visa in America",
    "description": "Secretary of State Marco Rubio is making it clear to the world's migrants that they do not have a right to immigrate to the United States.\nThe post Secretary of State Marco Rubio in Europe: No Foreign National Has a Right to a Visa in America appeared first o…",
    "link": "https://www.breitbart.com/politics/2026/02/16/secretary-of-state-marco-rubio-in-europe-no-foreign-national-has-a-right-to-a-visa-in-america/",
    "timestamp": "2026-02-16T21:52:50Z"
  },
  {
    "title": "Anderson Cooper Ends Tenure As ’60 Minutes’ Correspondent",
    "description": "Anderson Cooper is exiting as a correspondent for 60 Minutes after nearly two decades with the CBS News newsmagazine. Cooper has reported for the show while anchoring full time on CNN, under an agreement between the network and CBS. But he decided not to rene…",
    "link": "http://deadline.com/2026/02/anderson-cooper-departs-60-minutes-1236726337/",
    "timestamp": "2026-02-16T21:52:19Z"
  },
  {
    "title": "German carnival revellers take swipes at Putin, Trump, Epstein",
    "description": "At Düsseldorf’s carnival, sculptor Jacques Tilly is on trial in absentia in Moscow over satirical floats targeting Vladimir Putin.",
    "link": "https://www.channelnewsasia.com/world/german-carnival-revellers-take-swipes-putin-trump-epstein-5935076",
    "timestamp": "2026-02-16T21:51:00Z"
  },
  {
    "title": "Alleged Antifa Leader Who Fled FBI Now Set To Testify In Terrorism Trial",
    "description": "Dallas, Texas, resident Benjamin Song has agreed to testify in court about a terrorist attack by an \"Antifa cell\" prosecutors say he led, court records show.",
    "link": "https://dailycaller.com/2026/02/16/alleged-antifa-leader-fbi-testify-terrorism-trial/",
    "timestamp": "2026-02-16T21:49:23Z"
  },
  {
    "title": "'People shouldn't be dying just for existing'",
    "description": "Coco Gauff says it is \"tough to wake up\" and see what is happening back home in the United States amid the president's immigration crackdown.",
    "link": "https://www.bbc.com/sport/tennis/articles/cn5g2747192o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2026-02-16T21:49:13Z"
  },
  {
    "title": "People shouldn't be dying in the streets just for existing - Gauff on ICE",
    "description": "Coco Gauff says it is \"tough to wake up\" and see what is happening back home in the United States amid the president's immigration crackdown.",
    "link": "https://www.bbc.com/sport/tennis/articles/cn5g2747192o",
    "timestamp": "2026-02-16T21:49:08Z"
  },
  {
    "title": "Japan likely to send Gaza envoy to 1st Board of Peace meeting led by U.S.",
    "description": "Japan is considering sending Takeshi Okubo, ambassador in charge of Gaza reconstruction assistance, to the first meeting of the U.S.-led Board of Peace, to be held in Washington this week, government sources said Monday. Although Japan has yet to decide wheth…",
    "link": "https://japantoday.com/category/politics/japan-likely-to-send-gaza-envoy-to-board-of-peace-meeting-led-by-us",
    "timestamp": "2026-02-16T21:47:50Z"
  },
  {
    "title": "U.S. troops arrive in Nigeria to help train soldiers, country's military says",
    "description": "The arrival followed a request by the Nigerian government to the U.S government for help with training, technical support and intelligence-sharing, the military said in a statement.",
    "link": "https://www.pbs.org/newshour/world/u-s-troops-arrive-in-nigeria-to-help-train-soldiers-countrys-military-says",
    "timestamp": "2026-02-16T21:47:08Z"
  },
  {
    "title": "Trump says idea of renaming N.Y. Penn Station after him was raised by others, 'not me'",
    "description": "President Donald Trump on Monday repeated his opposition to a massive public works project to create another tunnel connecting New York and New Jersey and distanced himself from reports that he wanted to make federal funding for it contingent on renaming New …",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-renaming-new-york-penn-station-dulles-gateway-tunnel-funds-rcna259267",
    "timestamp": "2026-02-16T21:46:14Z"
  },
  {
    "title": "Nigeria says 100 more U.S. military personnel arrive to tackle Islamists",
    "description": "About 100 U.S. military personnel have arrived in Nigeria as ‌Washington scales up an operation to target Islamist insurgents, a Nigerian defense spokesperson said. U.S. President Donald Trump ‌has accused Nigeria of failing to ⁠protect Christians from Islami…",
    "link": "https://japantoday.com/category/world/nigeria-says-100-more-u.s.-military-personnel-arrive-to-tackle-islamists",
    "timestamp": "2026-02-16T21:44:34Z"
  },
  {
    "title": "Prosecutors plan to charge Israeli settler with killing Palestinian activist in the West Bank",
    "description": "Israeli prosecutors said Monday that they plan to charge a settler in the killing of a Palestinian activist during a confrontation that was caught on video, opening a rare prosecution of violence by Jewish settlers in the occupied West Bank. Attacks from sett…",
    "link": "https://japantoday.com/category/world/prosecutors-plan-to-charge-an-israeli-settler-with-killing-a-palestinian-activist-in-the-west-bank",
    "timestamp": "2026-02-16T21:44:16Z"
  },
  {
    "title": "Iran meets U.N. nuclear watchdog in Geneva ahead of a second round of U.S. talks",
    "description": "Iran's top diplomat met with the head of the U.N. nuclear watchdog agency on Monday, ahead of a second round of negotiations with the United States over Tehran's nuclear program. Iranian Foreign Minister Abbas Araghchi met with Rafael Grossi, director-general…",
    "link": "https://japantoday.com/category/world/iran-meets-un-nuclear-watchdog-in-geneva-ahead-of-a-second-round-of-us-talks",
    "timestamp": "2026-02-16T21:43:58Z"
  },
  {
    "title": "Bishop Barron lauds U.S. secretary of state’s speech to Munich Security Conference",
    "description": "Marco Rubio’s speech elicited a standing ovation and widespread accolades, including from the bishop of Winona-Rochester, Minnesota.",
    "link": "https://www.ewtnnews.com/world/europe/bishop-praises-secretary-of-state-marco-rubio-s-speech-on-christian-roots-of-u-s-europe",
    "timestamp": "2026-02-16T21:36:00Z"
  },
  {
    "title": "Texas Republican Ken Paxton is stepping up his Senate bid against Cornyn",
    "description": "Texas Attorney General Ken Paxton will be in an unfamiliar setting Monday night: heading his first campaign rally since the Republican announced his candidacy for the U.S. Senate 10 months ago.",
    "link": "https://www.pbs.org/newshour/politics/texas-republican-ken-paxton-is-stepping-up-his-senate-bid-against-cornyn",
    "timestamp": "2026-02-16T21:35:24Z"
  },
  {
    "title": "WATCH: Newsmax Guest Floored By Host Citing a Grok Definition in Her Question",
    "description": "Mike Nellis was floored during an interview when the host asked about the future of the Democratic Party before citing Elon Musk's AI tool Grok for clarification.\nThe post WATCH: Newsmax Guest Floored By Host Citing a Grok Definition in Her Question first app…",
    "link": "https://www.mediaite.com/media/news/watch-newsmax-guest-floored-by-host-citing-a-grok-definition-in-her-question/",
    "timestamp": "2026-02-16T21:34:52Z"
  },
  {
    "title": "America’s vanishing cattle herd drives beef prices up 15%",
    "description": "The nation's cattle herd has shrunk in recent years to the smallest since the early 1950s because droughts and higher production costs.",
    "link": "https://www.bostonherald.com/2026/02/16/americas-vanishing-cattle-herd-drives-15-price-hikes-for-beef/",
    "timestamp": "2026-02-16T21:33:51Z"
  },
  {
    "title": "Republican Joins With Dems on Constitutional Amendment to Give Congress Power to Reject Trump Pardons",
    "description": "\"This amendment creates a narrow, commonsense check to ensure the pardon power is used fairly and responsibly regardless of who occupies the White House\"\nThe post Republican Joins With Dems on Constitutional Amendment to Give Congress Power to Reject Trump Pa…",
    "link": "https://www.mediaite.com/media/news/republican-joins-with-dems-on-constitutional-amendment-to-give-congress-power-to-reject-trump-pardons/",
    "timestamp": "2026-02-16T21:33:11Z"
  },
  {
    "title": "Lula Faces Political Blowback in Brazil Over Carnival Parade Row",
    "description": "A Carnival parade honoring Brazilian President Luiz Inácio Lula da Silva took a controversial turn on Monday, as opposition leaders argue the tribute amounted to improper campaigning for the leftist incumbent.",
    "link": "https://financialpost.com/pmn/business-pmn/lula-faces-political-blowback-in-brazil-over-carnival-parade-row",
    "timestamp": "2026-02-16T21:29:21Z"
  },
  {
    "title": "Trump Admin Ordered to Restore Slavery Exhibits Stripped From Historic Site in Philly",
    "description": "A judge has ordered Donald Trump's admin to restore exhibits about slavery taken from the President's House Site in Philadelphia last month.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-ordered-restore-slavery-exhibits-presidents-house-1235517544/",
    "timestamp": "2026-02-16T21:23:35Z"
  },
  {
    "title": "Trump Nominee Is Huge Racist, If You Can Believe It",
    "description": "And yet, Jeremy Carl is up for a high-level State Department post.",
    "link": "https://www.wonkette.com/p/trump-nominee-is-huge-racist-if-you",
    "timestamp": "2026-02-16T21:20:54Z"
  },
  {
    "title": "Trump ‘Deeply Committed’ to Success of Hungary, Rubio Tells Orban",
    "description": "Sec. of State Marco Rubio said President Trump is “deeply committed” to the success of Hungarian Prime Minister Viktor Orban.\nThe post Trump ‘Deeply Committed’ to Success of Hungary, Rubio Tells Orban appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/02/16/trump-deeply-committed-success-hungary-rubio-tells-orban/",
    "timestamp": "2026-02-16T21:16:45Z"
  },
  {
    "title": "Savannah Guthrie’s Family ‘Cleared as Possible Suspects’ in Nancy Guthrie Case",
    "description": "Authorities have cleared Savannah Guthrie’s family as potential suspects amid the ongoing investigation into Nancy Guthrie’s disappearance. “To be clear … the Guthrie family — to include all siblings and spouses — have been cleared as possible suspects in thi…",
    "link": "https://www.usmagazine.com/celebrity-news/news/savannah-guthries-family-cleared-as-possible-suspects-in-nancy-guthrie-case/",
    "timestamp": "2026-02-16T21:10:26Z"
  },
  {
    "title": "'He’s just blatantly lying': Trump called out over 'ecological disaster' blame game",
    "description": "The internet was quick to correct President Donald Trump on Monday after he blasted Maryland's Democratic governor over a sewage spill in the Potomac River, then was mocked for lying about it. Trump tried to hurl an attack at one of his critics, Gov. Wes Moor…",
    "link": "https://www.rawstory.com/donald-trump-lying-2675273614/",
    "timestamp": "2026-02-16T21:05:18Z"
  },
  {
    "title": "The Pentagon Just Sent a Terrifying Message to AI Companies",
    "description": "Donald Trump’s so-called Department of War is threatening to cut ties with Anthropic because it won’t help the Pentagon conduct mass surveillance on Americans or make fully autonomous weapons that the administration can use however it likes.A senior Trump adm…",
    "link": "https://newrepublic.com/post/206631/pentagon-just-sent-terrifying-message-ai-companies",
    "timestamp": "2026-02-16T21:05:07Z"
  },
  {
    "title": "Trump border czar leaves door open to ICE deployment in other sanctuary cities as feds leave Minneapolis",
    "description": "Border czar Tom Homan warned that other sanctuary cities could face Minnesota-like ICE deployment as the Trump administration turns its focus off of Minneapolis.",
    "link": "https://www.foxnews.com/politics/trump-border-czar-leaves-door-open-ice-deployment-other-sanctuary-cities-feds-leave-minneapolis",
    "timestamp": "2026-02-16T21:00:47Z"
  },
  {
    "title": "Potomac Interceptor Rupture Poised to Become the Largest Sewage Spill in U.S. History",
    "description": "This man-caused disaster not merely a technical breakdown but a profound public health, environmental, and governance crisis affecting downstream communities.\nThe post Potomac Interceptor Rupture Poised to Become the Largest Sewage Spill in U.S. History first…",
    "link": "https://legalinsurrection.com/2026/02/potomac-interceptor-rupture-poised-to-become-the-largest-sewage-spill-in-u-s-history/",
    "timestamp": "2026-02-16T21:00:44Z"
  },
  {
    "title": "US Seizes Another Oil Tanker For Defying Its “Quarantine”",
    "description": "The United States has taken control of another oil tanker for defying ruler Donald Trump's \"quarantine.\" The Pentagon said that “the vessel tried to defy President Trump’s quarantine – hoping to slip away. We tracked it from the Caribbean to the Indian Ocean,…",
    "link": "https://www.shtfplan.com/headline-news/us-seizes-another-oil-tanker-for-defying-its-quarantine",
    "timestamp": "2026-02-16T21:00:34Z"
  },
  {
    "title": "Young Voters Abandon Trump",
    "description": "Sarah Longwell: “The past two months have been some of the worst for Donald Trump’s approval rating—ever. Polling aggregators have his net approval in the low 40s, with 34 percent approval on the economy and 30 percent on cost of living. In individual polls, …",
    "link": "https://politicalwire.com/2026/02/16/young-voters-abandon-trump/",
    "timestamp": "2026-02-16T21:00:00Z"
  },
  {
    "title": "Alleged image of Trump and blindfolded girls isn't what it seems",
    "description": "An image from the U.S. Department of Justice's Epstein files authentically showed President Donald Trump sitting in a room looking at a group of blindfolded girls.",
    "link": "https://www.snopes.com//fact-check/trump-blindfolded-girls/",
    "timestamp": "2026-02-16T20:54:00Z"
  },
  {
    "title": "Trump blasts Newsom’s UK pact, warns foreign leaders as 2028 buzz builds",
    "description": "Trump slams California Gov. Newsom's European diplomacy tour as \"inappropriate,\" warning UK leaders against partnering with the Democratic governor.",
    "link": "https://www.foxnews.com/politics/trump-blasts-newsoms-uk-pact-warns-foreign-leaders-2028-buzz-builds",
    "timestamp": "2026-02-16T20:52:44Z"
  },
  {
    "title": "George W. Bush Launches Substack With Love Letter to George Washington: ‘For a Leader, Humility is the Ultimate Strength’",
    "description": "George W. Bush became the latest writer to join Substack on Monday, with the 43rd POTUS launching his blog with a lengthy post honoring George Washington\nThe post George W. Bush Launches Substack With Love Letter to George Washington: ‘For a Leader, Humility …",
    "link": "https://www.mediaite.com/media/george-w-bush-launches-substack-with-love-letter-to-george-washington-for-a-leader-humility-is-the-ultimate-strength/",
    "timestamp": "2026-02-16T20:52:42Z"
  },
  {
    "title": "US-Iran talks set to resume amid rising tensions",
    "description": "US and Iran are set to resume talks aimed at resolving the dispute over Tehran’s nuclear program Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632632-us-iran-nuclear-talks/",
    "timestamp": "2026-02-16T20:48:55Z"
  },
  {
    "title": "George W. Bush Torches Trump in Presidents’ Day Message",
    "description": "Former President George W. Bush won’t defy the “code of silence” that prevents ex-U.S. leaders from publicly chastising their successors, but he’s apparently not opposed to throwing shade.In a Presidents’ Day essay published Monday by the pro-democracy instit…",
    "link": "https://newrepublic.com/post/206630/george-w-bush-torches-trump-president-day-message",
    "timestamp": "2026-02-16T20:48:06Z"
  },
  {
    "title": "‘MAGA loudmouths’ make big admission about Trump endorsements: report",
    "description": "Republican candidates — and loyal MAGA influencers — no longer view President Donald Trump's endorsement with the same value it used to have, according to a report Monday. The Down Ballot Substack's David Nir and Jeff Singer described how Arizona Republican c…",
    "link": "https://www.rawstory.com/maga-trump-endorsement/",
    "timestamp": "2026-02-16T20:39:49Z"
  },
  {
    "title": "Denver considers kicking out Flock — but keeping license plate cameras",
    "description": "The mayor’s office confirmed it's seeking bids from providers and plans to submit a new contract to the council “in the coming weeks,” a spokesman said",
    "link": "https://www.denverpost.com/2026/02/16/denver-flock-cameras-license-plates-other-bidders/",
    "timestamp": "2026-02-16T20:39:03Z"
  },
  {
    "title": "California Congressman Eric Swalwell's Secret Erotic Poetry Uncovered",
    "description": "Congressman Eric Swalwell was evidently a big fan of erotica in college ... and now we're getting a glimpse of some of what he wrote! The Daily Mail uncovered a sexually graphic poem penned by the Democrat from California apparently written when he…\n Permalink",
    "link": "https://www.tmz.com/2026/02/16/eric-swalwell-wrote-sexy-poetry-at-19-years-old/",
    "timestamp": "2026-02-16T20:37:39Z"
  },
  {
    "title": "Cuba's Havana piles with trash as US chokehold halts garbage trucks",
    "description": "HAVANA, Feb 16 (Reuters) - Garbage has ⁠begun to pile up on street corners in the Cuban capital of Havana, ⁠attracting hordes of flies and reeking of rotten food, in one of the ‌most visible impacts of the U.S. bid to prevent oil from reaching the Caribbean's…",
    "link": "https://www.thestar.com.my/news/world/2026/02/17/cuba039s-havana-piles-with-trash-as-us-chokehold-halts-garbage-trucks",
    "timestamp": "2026-02-16T20:36:00Z"
  },
  {
    "title": "Vanessa Trump reveals what she thinks about golf after dating Tiger Woods and daughter Kai's rise",
    "description": "Golf has long defined the life and legacy of Tiger Woods. As a 15-time Major champion and one of the most influential figures in modern sport, the game is inseparable from his iden",
    "link": "https://www.marca.com/en/golf/2026/02/16/69937d0446163f8c158b45d9.html",
    "timestamp": "2026-02-16T20:35:04Z"
  },
  {
    "title": "Federal judge orders Trump administration to restore slavery exhibits to the President's House (The Philadelphia Inquirer)",
    "description": "The Philadelphia Inquirer:\nFederal judge orders Trump administration to restore slavery exhibits to the President's House  —  A federal judge ordered President Donald Trump's administration to restore the slavery exhibits that the National Park Service remove…",
    "link": "https://www.memeorandum.com/260216/p59",
    "timestamp": "2026-02-16T20:35:01Z"
  },
  {
    "title": "Cuba’s Havana piles with trash as US chokehold halts garbage trucks",
    "description": "HAVANA, Feb 16 (Reuters) - Garbage has begun to pile up on street corners in the Cuban capital of Havana, attracting hordes of flies and reeking of rotten food, in one of… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/16/cuba-s-havana-piles-with-trash-as-us-chokehold-halts-garbage-trucks",
    "timestamp": "2026-02-16T20:33:27Z"
  },
  {
    "title": "Gateway Hudson Tunnel funding resumes with $30M payment - Gothamist",
    "description": "Gateway Hudson Tunnel funding resumes with $30M paymentGothamist Trump rages against Gateway tunnel project, threatening to withhold federal assistancePolitico U.S. Judge Says Trump Cannot Halt Funding for Gateway Tunnel Project - The New York TimesThe New Yo…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180806714",
    "timestamp": "2026-02-16T20:33:12Z"
  },
  {
    "title": "Trump Brutally Mocked on Presidents Day With Satirical Floats at German Festival",
    "description": "Donald Trump might’ve been celebrating Presidents Day stateside ... but over in Germany, they were dragging him through the streets -- literally. Düsseldorf’s infamous \"Rose Monday\" carnival parade unleashed a brutal procession of Trump…",
    "link": "https://www.tmz.com/2026/02/16/trump-mocked-with-german-parade-floats/",
    "timestamp": "2026-02-16T20:31:19Z"
  },
  {
    "title": "Trump Threatens Death Penalty For Nancy Guthrie Kidnappers If She Isn’t Returned Alive",
    "description": "President Donald Trump is threatening “very, very severe — the most severe” federal consequences for those responsible for the abduction of Nancy Guthrie, if the 84-year-old mother of Today co-host Savannah Guthrie is not returned alive. Trump made his commen…",
    "link": "http://deadline.com/2026/02/trump-death-penalty-nancy-guthrie-kidnappers-1236726183/",
    "timestamp": "2026-02-16T20:26:39Z"
  },
  {
    "title": "Kansas Mayor Who Voted for Trump as Noncitizen Faces Felony Charges",
    "description": "A small-town Kansas mayor is in trouble for voting illegally as a noncitizen—but he has the support of his town. Joe Ceballos was recently reelected mayor of Coldwater, Kansas, by a comfortable 101-20 margin. But just hours before the results came in, Ceballo…",
    "link": "https://newrepublic.com/post/206627/kansas-mayor-voted-trump-noncitizen-felony-charges",
    "timestamp": "2026-02-16T20:24:30Z"
  },
  {
    "title": "How to make friends and influence people in the MAGA media ecosystem",
    "description": "That this is now a successful career strategy tells you all you need to know about Donald Trump, MAGA, and the Republican party (three terms for exactly the same thing at this point): In recent days, Fine has declared “Palestinian” identity evil and compared …",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/how-to-make-friends-and-influence-people-in-the-maga-media-ecosystem",
    "timestamp": "2026-02-16T20:21:14Z"
  },
  {
    "title": "Klobuchar updates on efforts to end Canada tariffs during Moorhead visit",
    "description": "Sean Syverson, owner of Swing Barrel Brewing Company, talked about the ongoing unpredictability businesses are facing around tariffs at a press conference with U.S. Sen. Amy Klobuchar, D-Minn.",
    "link": "https://www.inforum.com/news/moorhead/klobuchar-updates-on-efforts-to-end-canada-tariffs-during-moorhead-visit",
    "timestamp": "2026-02-16T20:15:36Z"
  },
  {
    "title": "GA Senate Candidate Says He Didn’t Vote For Nearly Two Decades",
    "description": "Derek Dooley, a former football coach, says he did not vote for nearly two decades. He thinks that makes him a good candidate to replace Georgia’s Jon Ossoff in the U.S. Senate.\nI guess Herschel Walker was unavailable.\nDooley did not vote for Donald Trump in …",
    "link": "https://crooksandliars.com/2026/02/ga-senate-candidate-says-he-didn-t-vote",
    "timestamp": "2026-02-16T20:13:47Z"
  },
  {
    "title": "Trump Boasts He Now Has Highest Approval Rating Of Any Current U.S. President",
    "description": "WASHINGTON, D.C. — President Donald Trump proudly announced Monday that he now has the highest approval rating of any current U.S. president.",
    "link": "https://babylonbee.com/news/trump-boasts-he-now-has-highest-approval-rating-of-any-current-us-president",
    "timestamp": "2026-02-16T20:13:39Z"
  },
  {
    "title": "Pro-Trump Radio Host Calls Spike Lee a ‘Little P*ssy’ in Wild Rant About Director’s Pro-Palestine Outfit",
    "description": "Sid Rosenberg shredded Spike Lee for wearing a pro-Palestine outfit to the NBA All-Star Game, calling the director a \"little p*ssy\" who deserved a pummeling\nThe post Pro-Trump Radio Host Calls Spike Lee a ‘Little P*ssy’ in Wild Rant About Director’s Pro-Pales…",
    "link": "https://www.mediaite.com/media/pro-trump-radio-host-calls-spike-lee-a-little-pssy-in-wild-rant-about-directors-pro-palestine-outfit/",
    "timestamp": "2026-02-16T20:07:49Z"
  },
  {
    "title": "ROOKE: Vance And Rubio Deliver One-Two Punch To Our Western Allies In Munich",
    "description": "Few maneuvers capture the essence of strategic persuasion as vividly as the \"one-two punch\" masterfully delivered at the Munich Security Conference.",
    "link": "https://dailycaller.com/2026/02/16/jd-vance-marco-rubio-munich-security-conference-christian-hertitage-western-civilization-viral-speech-history/",
    "timestamp": "2026-02-16T20:05:45Z"
  },
  {
    "title": "'Really?' Pam Bondi buried on MS NOW for dragging Marilyn Monroe into Epstein saga",
    "description": "A massive list of names discovered in the Jeffrey Epstein files, which was released over the weekend by Attorney General Pam Bondi, contained a handful of celebrities, including one who died when the accused sex trafficker was still a child.That led to rolled…",
    "link": "https://www.rawstory.com/pam-bondi-2675273128/",
    "timestamp": "2026-02-16T20:01:53Z"
  },
  {
    "title": "Sharia law victim who fled Somalia issues endorsement in critical Senate race",
    "description": "Ayaan Hirsi Ali, who fled Sharia law, has endorsed Sen. John Cornyn, R-Texas, for re-election in a critical Senate race that could determine whether the GOP retains its majority.",
    "link": "https://www.foxnews.com/politics/exclusive-sharia-law-victim-who-fled-somalia-issues-endorsement-critical-senate-race",
    "timestamp": "2026-02-16T20:01:22Z"
  },
  {
    "title": "Treasury boss Iain Rennie raises flags over New Zealand being indebted to opaque foreign investors, as global factors push up interest costs",
    "description": "Around 60% of new New Zealand Government Bonds are now held offshore.",
    "link": "https://www.nzherald.co.nz/business/economy/treasury-boss-iain-rennie-raises-flags-over-nz-being-indebted-to-opaque-foreign-investors-as-global-factors-push-up-interest-costs/premium/LWFOQHVEM5DKVIZXTXCXY3PMSU/",
    "timestamp": "2026-02-16T20:00:00Z"
  },
  {
    "title": "Trump wants critical minerals. So do Cornwall’s MPs.",
    "description": "Global leaders are going head to head over critical minerals and national security. For some U.K. lawmakers, it is chance to grab both investment and votes.",
    "link": "https://www.politico.eu/article/labour-uk-parliament-seat-critical-minerals-noah-law-jayne-kirkham/",
    "timestamp": "2026-02-16T20:00:00Z"
  },
  {
    "title": "Rubio shines on global stage while AOC, Whitmer, and Newsom take heat",
    "description": "Democratic 2028 hopefuls face criticism after Munich Security Conference appearances, with Alexandria Ocasio-Cortez drawing scrutiny for foreign policy stumbles.",
    "link": "https://www.foxnews.com/politics/rubio-shines-global-stage-while-aoc-whitmer-newsom-take-heat",
    "timestamp": "2026-02-16T19:55:59Z"
  },
  {
    "title": "'No way out': Young voters now regret voting for Trump",
    "description": "Young voters who pledged their support to Donald Trump and the Republican Party at the last election are suffering from buyer's remorse. A collection of young people who voted for the GOP at the 2024 election highlighted the many problems now facing their gen…",
    "link": "https://www.rawstory.com/trump-midterms-2675272269/",
    "timestamp": "2026-02-16T19:55:02Z"
  },
  {
    "title": "Stephen A Smith says Trump right to secure border, says 'emergency efforts were necessary' after Biden's term",
    "description": "Stephen A. Smith said he begrudgingly understands President Donald Trump's extraordinary methods to enforce immigration after former President Joe Biden's mishandling of the border.",
    "link": "https://www.foxnews.com/media/stephen-smith-says-trump-right-secure-border-says-emergency-efforts-were-necessary-after-bidens-term",
    "timestamp": "2026-02-16T19:54:23Z"
  },
  {
    "title": "After Years of Border Crisis, Small Texas Town ‘Back to Mayberry’",
    "description": "BRACKETTVILLE, Texas—The chaos caused by millions of illegal immigrants flooding across the southwest border under the Biden administration left scars on this border town. The constant high-speed chases, buzzing helicopters, screaming emergency sirens, hurrie…",
    "link": "https://freerepublic.com/focus/f-chat/4367092/posts",
    "timestamp": "2026-02-16T19:51:20Z"
  },
  {
    "title": "'The Most Severe': Donald Trump Calls for Nancy Guthrie Kidnappers to Face Death Penalty If She Doesn't Come Home Alive",
    "description": "President Donald Trump said he'd want the DOJ to seek the death penalty against Nancy Guthrie's kidnappers.",
    "link": "https://radaronline.com/p/donald-trump-calls-for-nancy-guthrie-kidnapper-death-penalty-if-found-dead/",
    "timestamp": "2026-02-16T19:45:00Z"
  },
  {
    "title": "Senate Dems Push Trump DOJ to Reveal All Talks With Lobbyists About Ouster of Antitrust Chief",
    "description": "A group of Democrats in the US Senate is pressuring President Donald Trump's Justice Department to hand over any and all communications between the agency and corporate lobbyists related to last week's ouster of antitrust chief Gail Slater, which came weeks b…",
    "link": "https://www.commondreams.org/news/gail-slater-firing",
    "timestamp": "2026-02-16T19:44:11Z"
  },
  {
    "title": "Francesca Albanese Defenders Decry Bid to Remove UN Expert Over Misrepresented Israel Remarks",
    "description": "Human rights advocates, United Nations officials, and prominent international artists are among those defending UN independent Palestine expert Francesca Albanese in recent days amid a smear campaign by several European foreign ministers and pro-Israel groups…",
    "link": "https://www.commondreams.org/news/defending-francesca-albanese",
    "timestamp": "2026-02-16T19:42:39Z"
  },
  {
    "title": "France’s Macron eyes fighter jet deal in India",
    "description": "French President Emmanuel Macron begins a three-day visit to India on Tuesday, with talks focused on artificial intelligence cooperation and a potential multibillion dollar Dassault Rafale fighter jet deal. France is seeking to expand its military partnership…",
    "link": "https://www.digitaljournal.com/world/frances-macron-eyes-fighter-jet-deal-in-india/article",
    "timestamp": "2026-02-16T19:42:20Z"
  },
  {
    "title": "Nolte: Trump Warns Kidnappers Death Penalty Awaits if Nancy Guthrie Not Returned Alive",
    "description": "President Donald Trump used the bully pulpit Monday to threaten Nancy Guthrie’s alleged kidnappers with the death penalty if they do not return the 84-year-old alive.\nThe post Nolte: Trump Warns Kidnappers Death Penalty Awaits if Nancy Guthrie Not Returned Al…",
    "link": "https://www.breitbart.com/politics/2026/02/16/nolte-trump-warns-kidnappers-death-penalty-awaits-if-nancy-guthrie-not-returned-alive/",
    "timestamp": "2026-02-16T19:41:08Z"
  },
  {
    "title": "Huckabee warns: Iran faces ‘second kick of a mule’",
    "description": "US Ambassador Mike Huckabee says US and Israel are aligned on Iran, calls Trump-Netanyahu talks historic, warns threat is global.",
    "link": "https://www.israelnationalnews.com/news/422521",
    "timestamp": "2026-02-16T19:31:10Z"
  },
  {
    "title": "President Trump Threatens Nancy Guthrie Kidnappers With Death Penalty",
    "description": "President Donald Trump is issuing a threat to the alleged abductor or abductors of Savannah Guthrie’s mom, Nancy Guthrie. Trump, 79, told the New York Post on Monday, February 16, that her kidnappers would face “very, very severe — the most severe” federal co…",
    "link": "https://www.usmagazine.com/celebrity-news/news/president-trump-threatens-nancy-guthrie-kidnappers-with-death-penalty/",
    "timestamp": "2026-02-16T19:27:28Z"
  },
  {
    "title": "America holds its breath as search for TV host's mother enters third week",
    "description": "People are not watching the search for Nancy Guthrie because they are obligated to, but because this story touches something universal: the ache of not knowing.",
    "link": "https://news.sky.com/story/america-holds-its-breath-as-search-for-tv-host-savannah-guthries-mother-enters-third-week-13508343",
    "timestamp": "2026-02-16T19:25:00Z"
  },
  {
    "title": "STEVE MILLOY: Louisiana Larceny And President Trump’s Lousy Friends",
    "description": "President Donald Trump has a lousy friend in Republican Louisiana Gov. Jeff Landry. The governor recently unveiled a new plan purporting to align Louisiana with",
    "link": "https://dailycaller.com/2026/02/16/opinion-louisiana-larceny-and-president-trumps-lousy-friends-steve-milloy/",
    "timestamp": "2026-02-16T19:23:31Z"
  },
  {
    "title": "CTU on the Death of Ofelia Torres",
    "description": "A statement from the Chicago Teachers Union on the passing of Ofelia Torres, a 16-year-old junior at Lake View High School: After months of fighting both cancer and the cruelty of Trump’s unconscionable and inhumane immigration policies, one of our own precio…",
    "link": "https://www.commondreams.org/newswire/ctu-on-the-death-of-ofelia-torres",
    "timestamp": "2026-02-16T19:19:15Z"
  },
  {
    "title": "Stephen A. Smith Dismisses Idea Racism Could Tank Potential Presidential Run: Americans ‘Don’t Give a Damn’",
    "description": "ESPN star Stephen A. Smith said he is not worried about racism hurting his chances of becoming president, if he decides to run, during a new interview with CBS\nThe post Stephen A. Smith Dismisses Idea Racism Could Tank Potential Presidential Run: Americans ‘D…",
    "link": "https://www.mediaite.com/media/stephen-a-smith-dismisses-idea-racism-could-tank-potential-presidential-run-americans-dont-give-a-damn/",
    "timestamp": "2026-02-16T19:17:23Z"
  },
  {
    "title": "Ukraine's Zelesnkyy says he met with Democratic senators, thanked US for support",
    "description": "Ukraine's President Volodymyr Zelenskyy noted that he thanked America for its support while meeting with U.S. Sens. Richard Blumenthal and Sheldon Whitehouse.",
    "link": "https://www.foxnews.com/world/ukraines-zelesnkyy-says-he-met-democratic-senators-thanked-us-support",
    "timestamp": "2026-02-16T19:14:26Z"
  },
  {
    "title": "Trump Insists Others ‘Brought Up’ Renaming Landmark ‘TRUMP STATION’ — Despite Report He Held Up Billions in Public Funds to Make it Happen",
    "description": "President Donald Trump denied that he wanted to rename New York City's Penn Station the \"TRUMP STATION,\" despite a recent report that he withheld billions of dollars in federal funding to do just that.\nThe post Trump Insists Others ‘Brought Up’ Renaming Landm…",
    "link": "https://www.mediaite.com/media/news/trump-insists-others-brought-up-renaming-landmark-trump-station-despite-report-he-held-up-billions-in-public-funds-to-make-it-happen/",
    "timestamp": "2026-02-16T19:11:58Z"
  },
  {
    "title": "If the SEC stays softer, Aave’s DAO could start capturing $100M+ annualized revenue",
    "description": "Aave Labs posted a governance proposal on Feb. 12 asking tokenholders to endorse a strategic package that would direct 100% of Aave-branded product revenue to the DAO treasury, formalize brand protection, and center the roadmap on Aave V4. The initiative was …",
    "link": "https://cryptoslate.com/if-the-sec-stays-softer-aaves-dao-could-start-capturing-100m-annualized-revenue/",
    "timestamp": "2026-02-16T19:10:50Z"
  },
  {
    "title": "What we know about the dissapearance of Nancy Guthrie two weeks on",
    "description": "There have been several apparent breakthroughs in the case, but two weeks on Nancy’s whereabouts are still unknown.",
    "link": "https://www.thejournal.ie/nancy-guthrie-2-6959071-Feb2026/",
    "timestamp": "2026-02-16T19:09:26Z"
  },
  {
    "title": "Trump Administration Creating Plan for Tech Companies to Pay Full Costs of AI Data Center Power, Water Usage",
    "description": "The Trump administration is exploring measures to require technology companies building data centers to absorb all associated utility and infrastructure costs as electricity prices continue to rise across the United States.\nThe post Trump Administration Creat…",
    "link": "https://www.breitbart.com/tech/2026/02/16/trump-administration-creating-plan-for-tech-companies-to-pay-full-costs-of-ai-data-center-power-water-usage/",
    "timestamp": "2026-02-16T19:06:30Z"
  },
  {
    "title": "It’s The Munich Security Conference, Starring AOC, An Astronaut, And The Woman Who Warned Everybody!",
    "description": "Also featuring a cameo from sniveling dictator-sucker Marco Rubio.",
    "link": "https://www.wonkette.com/p/its-the-munich-security-conference",
    "timestamp": "2026-02-16T19:03:29Z"
  },
  {
    "title": "Pres. Trump coming to north Georgia this week",
    "description": "President Donald Trump is set to speak Thursday in Rome, according to sources.",
    "link": "https://www.wsbtv.com/news/local/pres-trump-coming-north-georgia-this-week/Y6XMKVEQQVA4BARYXQ66X5UC4A/",
    "timestamp": "2026-02-16T19:02:33Z"
  },
  {
    "title": "'Pretty girls should always smile': The oldest trick in the patriarchal playbook",
    "description": "Why men telling women to “smile” and “look happy” has nothing to do with happiness — and everything to do with control, writes Simon Tierney.",
    "link": "https://www.thejournal.ie/readme/women-should-smile-more-6954733-Feb2026/",
    "timestamp": "2026-02-16T19:00:43Z"
  },
  {
    "title": "Agitator arrested on battery charge outside Trump's West Palm Beach golf course",
    "description": "Police arrested a man arrested he allegedly struck an anti-Trump protester outside Trump's West Palm Beach golf course during this weekend.",
    "link": "https://www.foxnews.com/us/agitator-arrested-battery-charge-outside-trumps-west-palm-beach-golf-course",
    "timestamp": "2026-02-16T19:00:02Z"
  },
  {
    "title": "Families fear 'forced confessions' of 'scapegoats' could result in executions",
    "description": "Families of Baha'i youth arrested by Iran's security forces say they've been subject to \"forced confessions\" and fear they may face the death penalty.",
    "link": "https://www.abc.net.au/news/2026-02-17/iran-forced-confessions-bahai-scapegoats-face-execution/106349538",
    "timestamp": "2026-02-16T18:57:54Z"
  },
  {
    "title": "GOP states move to make church service disruptions a felony after Minnesota storming",
    "description": "GOP leaders are mulling efforts to increase penalties on protesters disrupting church services, in direct response to the Minnesota unrest.",
    "link": "https://www.foxnews.com/politics/gop-states-move-make-church-service-disruptions-felony-after-minnesota-storming",
    "timestamp": "2026-02-16T18:56:25Z"
  },
  {
    "title": "George W. Bush launches subtle Presidents' Day digs at Trump",
    "description": "Former President George W. Bush aimed subtle digs at Donald Trump in a Presidents' Day message — laying out observations about the nation's first leader amid the country's current troubled times.The 43rd president of the United States described the significan…",
    "link": "https://www.rawstory.com/george-w-bush-2675273071/",
    "timestamp": "2026-02-16T18:55:48Z"
  },
  {
    "title": "No Plan for Mideast Peace Will Work Without Recognizing Palestinians' Full Humanity",
    "description": "When President Donald Trump convened his so-called Board of Peace in Davos, Switzerland, a key item on the agenda was to endorse his son-in-law Jared Kushner’s extravagant (and, I might add, detached from reality) plan for a “New Gaza.” The rendering of Kushn…",
    "link": "https://www.commondreams.org/opinion/peace-palestinian-rights",
    "timestamp": "2026-02-16T18:51:55Z"
  },
  {
    "title": "Donald Trump Warns Nancy Guthrie Abductors Will Face Death Penalty If She Dies",
    "description": "Donald Trump is making it crystal clear ... if Nancy Guthrie’s kidnappers don’t bring her back alive, they could be staring down the ultimate punishment: the death penalty. The President told the New York Post in a phone call the abductors need…",
    "link": "https://www.tmz.com/2026/02/16/trump-wants-death-penalty-if-nancy-guthrie-is-dead/",
    "timestamp": "2026-02-16T18:51:35Z"
  },
  {
    "title": "UFC CEO Dana White confirms White House card is done",
    "description": "What once looked like a wild idea from President of the United States Donald Trump appears one step closer to materializing. UFC CEO Dana White provided a major update on the event held at the White House later this year.…",
    "link": "https://www.thebiglead.com/ufc-ceo-dana-white-white-house-card-done/",
    "timestamp": "2026-02-16T18:46:12Z"
  },
  {
    "title": "Obama Calls Trump’s Racist Video A ‘Clown Show’",
    "description": "Obama Calls Trump’s Racist Video A ‘Clown Show’littlethings.com",
    "link": "https://littlethings.com/entertainment/obama-speaks-out-trump-racist-ape-post",
    "timestamp": "2026-02-16T18:43:59Z"
  },
  {
    "title": "Nancy Guthrie case update: Trump warns of ‘most severe’ penalties as search for Nancy Guthrie intensifies",
    "description": "President Trump vowed \"most severe\" federal penalties for those responsible for kidnapping Nancy Guthrie, mother of NBC's Savannah Guthrie. He indicated the Justice Department would seek the death penalty if she is killed. The FBI is investigating, with recen…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nancy-guthrie-case-update-trump-warns-of-most-severe-penalties-as-search-for-nancy-guthrie-intensifies/articleshow/128433542.cms",
    "timestamp": "2026-02-16T18:42:40Z"
  },
  {
    "title": "Marco Rubio on Iran Talks: ‘We Are Dealing With Radical Shiite Clerics’ Driven by ‘Pure Theology’",
    "description": "Secretary of State Marco Rubio said the United States is negotiating with Iran’s leadership despite what he described as “radical Shiite clerics” who make political decisions based on “pure theology.”\nThe post Marco Rubio on Iran Talks: ‘We Are Dealing With R…",
    "link": "https://www.breitbart.com/politics/2026/02/16/marco-rubio-on-iran-talks-we-are-dealing-with-radical-shiite-clerics-driven-by-pure-theology/",
    "timestamp": "2026-02-16T18:37:57Z"
  },
  {
    "title": "Orban vital for US ‘national interest’ – Rubio",
    "description": "US Secretary of State Marco Rubio has pledged Washington’s support for Hungarian PM Viktor Orban ahead of parliamentary elections Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632614-us-hungary-orban-support/",
    "timestamp": "2026-02-16T18:37:02Z"
  },
  {
    "title": "Carney Taps Veteran Charette as Chief Trade Negotiator to US",
    "description": "Canadian Prime Minister Mark Carney appointed a veteran public servant as his government’s next chief trade negotiator with the US, putting her at the center of a review of the North American trade pact at a time of testy relations between the two countries.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-taps-veteran-charette-as-chief-trade-negotiator-to-us",
    "timestamp": "2026-02-16T18:31:03Z"
  }
]