[
  {
    "title": "India and Pakistan agreed to an immediate ceasefire – Donald Trump announced it",
    "description": "The US President congratulated both countries for common sense and \"great intelligence\"\nThe post India and Pakistan agreed to an immediate ceasefire – Donald Trump announced it appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/05/10/india-and-pakistan-agreed-to-an-immediate-ceasefire-donald-trump-announced-it/",
    "timestamp": "2025-05-10T12:24:34Z"
  },
  {
    "title": "\"None Of Our Business\" To \"Long Night Of Talks\": US' Changing Stance On India-Pak Tension",
    "description": "US President Donald Trump was the first leader today to announce nuclear-armed neighbours India and Pakistan agreed to a ceasefire. Minutes later, Foreign Secretary Vikram Misri confirmed the ceasefire.",
    "link": "https://www.ndtv.com/world-news/none-of-our-business-to-long-night-of-talks-us-changing-stance-on-india-pak-tension-8380380",
    "timestamp": "2025-05-10T12:24:28Z"
  },
  {
    "title": "Donald Trump says Pakistan and India have agreed to ‘full and immediate ceasefire’",
    "description": "WASHINGTON DC: Pakistan’s Deputy Prime Minister has announced that India and Pakistan have agreed to a full and immediate ceasefire, though India has yet to issue an official statement. Meanwhile, former U.S. President Donald Trump claimed the agreement follo…",
    "link": "https://english.khabarhub.com/2025/10/465656/",
    "timestamp": "2025-05-10T12:24:04Z"
  },
  {
    "title": "Donald Trump Says India and Pakistan Have Agreed Immediate Ceasefire",
    "description": "President Donald Trump has congratulated both countries for using \"common sense and great intelligence\" to end the conflict.",
    "link": "https://biztoc.com/x/8bb22e57ae2ed7bb",
    "timestamp": "2025-05-10T12:23:57Z"
  },
  {
    "title": "Trump says India and Pakistan have agreed to a ceasefire",
    "description": "U.S. President Donald Trump said Saturday that India and Pakistan agreed to a ceasefire after U.S.-mediated talks. Neither country has immediately confirmed a deal.",
    "link": "https://www.independent.ie/world-news/middle-east/trump-says-india-and-pakistan-have-agreed-to-a-ceasefire/a1383287411.html",
    "timestamp": "2025-05-10T12:23:55Z"
  },
  {
    "title": "Trump says India, Pakistan agreed to ceasefire; no official confirmation yet",
    "description": "President Trump announces India and Pakistan ceasefire after US-mediated talks, with no immediate confirmation from either country.",
    "link": "https://www.thehindubusinessline.com/news/trump-says-india-pakistan-agreed-to-ceasefire-no-official-confirmation-yet/article69560987.ece",
    "timestamp": "2025-05-10T12:22:46Z"
  },
  {
    "title": "Trump says India and Pakistan agreed to ‘immediate ceasefire’",
    "description": "Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617305-trump-india-pakistan-ceasefire/",
    "timestamp": "2025-05-10T12:21:18Z"
  },
  {
    "title": "Victor Davis Hanson: Pollsters Have No Reputation After This Decade-Long Hatred Of Donald Trump",
    "description": "THE DAILY SIGNAL: Mainstream media would have you believe that Trump’s first 100 days were a failure—despite securing the border and strong economic gains. Victor Davis Hanson breaks down the polling regarding Donald Trump’s early 2025 presidency on today’s e…",
    "link": "https://freerepublic.com/focus/f-chat/4316122/posts",
    "timestamp": "2025-05-10T12:19:25Z"
  },
  {
    "title": "Ukraine, European Allies Push for 30-Day Ceasefire With Russia",
    "description": "Ukraine and its allies are ready for a \"full, unconditional ceasefire\" with Russia for at least 30 days starting on Monday, Ukrainian FM Andrii Sybiha said Saturday.\nThe post Ukraine, European Allies Push for 30-Day Ceasefire With Russia appeared first on Bre…",
    "link": "https://www.breitbart.com/europe/2025/05/10/ukraine-european-allies-push-for-30-day-ceasefire-with-russia/",
    "timestamp": "2025-05-10T12:19:10Z"
  },
  {
    "title": "Donald Trump's Approval Rating on Economy Plunges to New Low",
    "description": "The president's approval rating on the economy has fallen, though his overall approval rating has increased slightly since April.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-economy-plunges-new-low-2070511",
    "timestamp": "2025-05-10T12:18:52Z"
  },
  {
    "title": "Breaking: Donald Trump says India and Pakistan have agreed to ceasefire",
    "description": "The US President said India and Pakistan have agreed to a \"full and immediate ceasefire,\" amid both countries launching strikes and counter-strikes against each other's military installations.",
    "link": "https://www.abc.net.au/news/2025-05-10/trump-posts-on-truth-social-india-pakistan-ceasefire/105278284",
    "timestamp": "2025-05-10T12:18:46Z"
  },
  {
    "title": "India and Pakistan confirm immediate ceasefire after US mediated talks",
    "description": "The US President said India and Pakistan have agreed to a \"full and immediate ceasefire,\" amid both countries launching strikes and counter-strikes against each other's military installations.",
    "link": "https://www.abc.net.au/news/2025-05-10/india-pakistan-confirm-immediate-ceasefire/105278284",
    "timestamp": "2025-05-10T12:18:46Z"
  },
  {
    "title": "India and Pakistan confirm immediate ceasefire after US mediated talks",
    "description": "The US President said India and Pakistan have agreed to a \"full and immediate ceasefire,\" after four days of strikes and counter-strikes between the two countries.",
    "link": "https://www.abc.net.au/news/2025-05-10/india-accuses-pakistan-of-ceasefire-violations/105278284",
    "timestamp": "2025-05-10T12:18:46Z"
  },
  {
    "title": "Community reacts to Penn State Health ending gender affirming care for those under 19",
    "description": "Dozens rallied outside Penn State Health in Hershey Friday demanding the company continue to save the lives of trans youth.",
    "link": "https://local21news.com/news/local/community-reacts-to-penn-state-health-ending-gender-affirming-care-for-those-under-19",
    "timestamp": "2025-05-10T12:16:00Z"
  },
  {
    "title": "Trump says India and Pakistan have agreed to a ceasefire",
    "description": "United States President Donald Trump on Saturday (May 10) said that India and Pakistan have agreed to a \"full and immediate ceasefire\", amid both countries launching strikes and counter-strikes against each other's military installations. \"After a long night …",
    "link": "https://www.channelnewsasia.com/world/trump-says-india-pakistan-agreed-ceasefire-5121651",
    "timestamp": "2025-05-10T12:15:00Z"
  },
  {
    "title": "Donald Trump Says India and Pakistan Have Agreed Immediate Ceasefire",
    "description": "President Donald Trump has congratulated both countries for using \"common sense and great intelligence\" to end the conflict.",
    "link": "https://www.newsweek.com/india-pakistan-conflict-agree-immediate-ceasefire-donald-trump-2070514",
    "timestamp": "2025-05-10T12:14:32Z"
  },
  {
    "title": "‘Thank You for Your Attention to This Matter!’ Trump Drops Major Ceasefire Announcement in Casual Fashion",
    "description": "Donald Trump announced that India and Pakistan had reached a ceasefire agreement after several days of mounting tensions between the two countries.\nThe post ‘Thank You for Your Attention to This Matter!’ Trump Drops Major Ceasefire Announcement in Casual Fash…",
    "link": "https://www.mediaite.com/news/thank-you-for-your-attention-to-this-matter-trump-drops-major-ceasefire-announcement-in-casual-fashion/",
    "timestamp": "2025-05-10T12:13:50Z"
  },
  {
    "title": "India moves warships toward Pakistan, tensions rise, world watches in silence",
    "description": "India has escalated its military presence near Pakistan, deploying warships equipped with supersonic cruise missiles. The naval strike group, which includes an aircraft carrier, guided-missile destroyers, frigates, and anti-submarine vessels, has moved within…",
    "link": "https://freerepublic.com/focus/f-bloggers/4316120/posts",
    "timestamp": "2025-05-10T12:13:10Z"
  },
  {
    "title": "TRUMP: I am pleased to announce that India and Pakistan have agreed to a FULL AND IMMEDIATE CEASEFIRE.",
    "description": "Donald J. Trump @realDonaldTrump After a long night of talks mediated by the United States, I am pleased to announce that India and Pakistan have agreed to a FULL AND IMMEDIATE CEASEFIRE. Congratulations to both Countries on using Common Sense and Great Intel…",
    "link": "https://freerepublic.com/focus/f-news/4316119/posts",
    "timestamp": "2025-05-10T12:12:30Z"
  },
  {
    "title": "India and Pakistan agree ‘immediate ceasefire’ after days of strikes, Donald Trump says",
    "description": "Conflict had escalated between neighbouring nations over attack on Indian tourists in Kashmir",
    "link": "https://www.irishtimes.com/world/asia-pacific/2025/05/10/india-and-pakistan-agree-immediate-ceasefire-after-days-of-strikes-donald-trump-says/",
    "timestamp": "2025-05-10T12:11:29Z"
  },
  {
    "title": "India, Pakistan agree to ceasefire, Trump announces",
    "description": "After days of strikes and counter-strikes, India and Pakistan have agreed to a \"full and immediate\" ceasefire, US President Donald Trump has announced. As yet, neither country has confirmed the arrangement. DW has more.",
    "link": "https://www.dw.com/en/india-pakistan-agree-to-ceasefire-trump-announces/live-72497443",
    "timestamp": "2025-05-10T12:11:00Z"
  },
  {
    "title": "Trump says India and Pakistan have agreed to 'immediate ceasefire'",
    "description": "The U.S. leader said the nuclear-armed rivals had agreed to a \"full\" ceasefire after both launched strikes and counterstrikes against each other's military installations.",
    "link": "https://www.japantimes.co.jp/news/2025/05/10/asia-pacific/india-pakistan-missile-strikes-trump/",
    "timestamp": "2025-05-10T12:11:00Z"
  },
  {
    "title": "Updates: India, Pakistan agree to ceasefire",
    "description": "After days of strikes and counter-strikes, India and Pakistan have agreed to a \"full and immediate\" ceasefire. Both countries have confirmed the truce. DW has more. The ceasefire was first announced by US President Donald Trump\nThe foreign ministries of India…",
    "link": "https://www.dw.com/en/updates-india-pakistan-agree-to-ceasefire/live-72497443",
    "timestamp": "2025-05-10T12:11:00Z"
  },
  {
    "title": "Trump announces that India and Pakistan have agreed to 'full and immediate ceasefire'",
    "description": "“Congratulations to both Countries on using Common Sense and Great Intelligence. Thank you for your attention to this matter!” he wrote on social media site Truth Social.",
    "link": "https://www.thejournal.ie/india-pakistan-ceasefire-trump-6701533-May2025/",
    "timestamp": "2025-05-10T12:10:23Z"
  },
  {
    "title": "Trump Says \"Full, Immediate\" India-Pak Ceasefire After \"Long Night Of Talks\"",
    "description": "In a massive statement after four days of hostilities, US President Donald Trump has said India and Pakistan have agreed to a &quot;full and immediate&quot; ceasefire following a &quot;long night of talks&quot; mediated by the United States.",
    "link": "https://www.ndtv.com/world-news/india-and-pakistan-have-agreed-to-full-and-immediate-ceasefire-trumps-big-claim-on-truth-social-8380244",
    "timestamp": "2025-05-10T12:09:22Z"
  },
  {
    "title": "India and Pakistan agree to a full and immediate ceasefire: Trump",
    "description": "India and Pakistan have agreed to a full and immediate ceasefire following US-mediated talks, US President Donald Trump claimed on Saturday. In a post on Truth Social, he said, “After a long night of talks mediated by the United States, I am pleased to announ…",
    "link": "https://economictimes.indiatimes.com/news/defence/india-and-pakistan-agree-to-a-full-and-immediate-ceasefire-trump/articleshow/121057952.cms",
    "timestamp": "2025-05-10T12:08:36Z"
  },
  {
    "title": "European leaders in Kyiv call on Moscow for unconditional 30-day ceasefire",
    "description": "\"Fruitful\" phone call with US President Donald Trump during the meeting, Ukraine says.",
    "link": "https://www.euractiv.com/section/politics/news/european-leaders-in-kyiv-call-on-moscow-for-unconditional-30-day-ceasefire/",
    "timestamp": "2025-05-10T12:08:28Z"
  },
  {
    "title": "Trump says India and Pakistan have agreed to a ceasefire",
    "description": "Pakistan and India began trading blows after twenty-six people were killed when terrorists opened fire at tourists in India's Jammu and Kashmir territory.",
    "link": "https://www.jpost.com/breaking-news/article-853414",
    "timestamp": "2025-05-10T12:04:54Z"
  },
  {
    "title": "European leaders say Trump agreed to sanction Russia unless ceasefire agreed",
    "description": "The leaders of four major European countries visited Kyiv, amid a push for Moscow to agree to a truce and launch peace talks on ending the nearly three-year war.",
    "link": "https://www.abc.net.au/news/2025-05-10/european-leaders-agree-ukraine-ceasefire/105278224",
    "timestamp": "2025-05-10T12:04:18Z"
  },
  {
    "title": "European leaders and Zelenskyy call Trump to discuss 30-day ceasefire",
    "description": "The leaders of four major European countries visited Kyiv, amid a push for Moscow to agree to a truce and launch peace talks on ending the nearly three-year war.",
    "link": "https://www.abc.net.au/news/2025-05-10/coalition-of-the-willing-meet-in-kyiv/105278224",
    "timestamp": "2025-05-10T12:04:18Z"
  },
  {
    "title": "Bill Maher Torches Trump Over ‘Two Dolls’ Rants: ‘Losing An Imaginary Negotiation — To Children’",
    "description": "Bill Maher mocked Trump as a \"dealmaker-in-chief\" who is losing an \"imaginary negotiation\" to hypothetical little girls in the midst of his global trade war.\nThe post Bill Maher Torches Trump Over ‘Two Dolls’ Rants: ‘Losing An Imaginary Negotiation — To Child…",
    "link": "https://www.mediaite.com/news/bill-maher-torches-trump-over-two-dolls-rants-losing-an-imaginary-negotiation-to-children/",
    "timestamp": "2025-05-10T12:01:49Z"
  },
  {
    "title": "'Increasingly vulnerable to threats': Trump slammed for skipping critical intel briefings",
    "description": "Since his inauguration in January, President Donald Trump has attended just 12 briefings from intelligence officials of the President’s Daily Brief, Politico reported Friday.During his first term, Trump attended these briefings with intel officials twice a we…",
    "link": "https://www.rawstory.com/trump-intel-2671928473/",
    "timestamp": "2025-05-10T12:00:58Z"
  },
  {
    "title": "“Thank God it’s over” — and more from the Colorado legislature this week",
    "description": "Another regular session of the Colorado legislature has adjourned for the year. In the words of Senate Majority Leader Robert Rodriguez: “Thank God it’s over.”",
    "link": "https://www.denverpost.com/2025/05/10/colorado-labor-bill-veto-trump-immigration-legislature/",
    "timestamp": "2025-05-10T12:00:52Z"
  },
  {
    "title": "BROADCAST BIAS: Networks ooze with sympathy to anyone who opposes Trump",
    "description": "If it's a day ending in 'Y,' the the major media are trying to find someone they can use to attack Trump. Even if the opponents chant about destroying Israel 'From the river to the sea.'",
    "link": "https://www.foxnews.com/opinion/broadcast-bias-networks-ooze-sympathy-anyone-who-opposes-trump",
    "timestamp": "2025-05-10T12:00:41Z"
  },
  {
    "title": "Vanity Fair claims America’s ‘obsession’ with protein is tied to MAGA movement",
    "description": "Vanity Fair publishes an article trying to correlate high-protein diets to the MAGA movement and the \"manosphere\" and explains why conservatives play a role in the desire to eat a high-protein diet.",
    "link": "https://www.foxnews.com/media/vanity-fair-claims-americas-obsession-protein-tied-maga-movement",
    "timestamp": "2025-05-10T12:00:27Z"
  },
  {
    "title": "For Your Weekend Listening",
    "description": "The latest episode of Trial Balloon is live for members. The new Pope is no fan of Donald Trump or J.D. Vance. And Trump is no fan of free trade. . You’ll get new episodes",
    "link": "https://politicalwire.com/2025/05/10/for-your-weekend-listening-70/",
    "timestamp": "2025-05-10T12:00:23Z"
  },
  {
    "title": "Why longtime Trump ally and former Republican Gov. Paul LePage is aiming for a political comeback",
    "description": "Former two-term Republican Gov. of Maine Paul LePage says his ally President Donald Trump is a top reason why he's trying for a political comeback and launching a bid for Congress",
    "link": "https://www.foxnews.com/politics/why-longtime-trump-ally-former-maine-gov-paul-lepage-aiming-political-comeback",
    "timestamp": "2025-05-10T12:00:04Z"
  },
  {
    "title": "This Artist’s Take On America’s Histories Is A Vibrant Act Of Resistance",
    "description": "Choctaw and Cherokee artist Jeffrey Gibson imagines a future of abundance in his historic exhibit, “the space in which to place me.\"",
    "link": "https://www.huffpost.com/entry/jeffrey-gibson-space-in-which-to-place-me-art-exhibit_n_681e15f4e4b02fbba8e83c4f",
    "timestamp": "2025-05-10T12:00:03Z"
  },
  {
    "title": "Trump's crypto agenda is being threatened by his pursuit of personal profits",
    "description": "Some lawmakers who had shown a willingness to support crypto legislation are backtracking on concerns about President Trump's personal ventures in the space.",
    "link": "https://www.cnbc.com/2025/05/10/trumps-crypto-agenda-threatened-by-his-pursuits-of-personal-profits.html",
    "timestamp": "2025-05-10T12:00:01Z"
  },
  {
    "title": "Lines in the Sand and Sea: Some of the World's Contested Names and Regions",
    "description": "From Trump's flirtation with renaming the Persian Gulf to the reignited conflict in Kashmir, these are some of the territorial disputes around the world.",
    "link": "https://www.newsweek.com/contested-borders-waters-regions-naming-trump-kashmir-2069589",
    "timestamp": "2025-05-10T12:00:01Z"
  },
  {
    "title": "Business travel was making a post-Covid comeback — until the trade war diverted it",
    "description": "Business travel was finally making a post-Covid comeback, but recent U.S. policy swings have upended the $1 trillion industry's sunny outlook just months ago.",
    "link": "https://www.nbcnews.com/business/travel/trade-war-putting-business-travel-holding-pattern-rcna203561",
    "timestamp": "2025-05-10T12:00:00Z"
  },
  {
    "title": "Embattled NY AG Letitia James claims she’s being followed on Trump’s orders: ‘Revenge tour!’",
    "description": "New York Attorney General Letitia bizarrely ranted to a crowd that she’s being followed on the orders of President Donald Trump – days before reports surfaced that Trump's Department of Justice had actually launched a criminal probe into mortgage fraud claims…",
    "link": "https://nypost.com/2025/05/10/us-news/letitia-james-trump-sending-people-to-my-house-as-revenge/",
    "timestamp": "2025-05-10T12:00:00Z"
  },
  {
    "title": "Mutually Assured Law Enforcement Destruction",
    "description": "Earlier this week, U.S. Immigration and Customs Enforcement agents raided at least nine restaurants in the nation’s capital, requesting proof that the establishments are not... Read More\nThe post Mutually Assured Law Enforcement Destruction appeared first on …",
    "link": "https://www.dailysignal.com/2025/05/10/mutually-assured-law-enforcement-destruction/",
    "timestamp": "2025-05-10T12:00:00Z"
  },
  {
    "title": "Pakistan And India Hint At De-Escalation After Trading Missile Strikes",
    "description": "It follows weeks of clashes that were triggered by a gun massacre on tourists last month that India blames Pakistan for.",
    "link": "https://www.huffpost.com/entry/pakistan-india-hint-at-de-escalation_n_681f3c1de4b0108bb6b708d0",
    "timestamp": "2025-05-10T11:59:30Z"
  },
  {
    "title": "China and US kick off high-stakes trade talks in Geneva",
    "description": "Meeting between He Lifeng and Scott Bessent comes a day after Donald Trump said he was open to cutting tariffs",
    "link": "https://biztoc.com/x/6544de12ec1332ce",
    "timestamp": "2025-05-10T11:50:39Z"
  },
  {
    "title": "FO° Exclusive: Mark Carney Leads Liberals to a Fourth Consecutive Victory",
    "description": "Glenn Carle: I think we have to give at least two minutes to Canada, a country very dear to my heart. Atul Singh: Yes, exactly. Let’s talk about Mark Carney Leading Liberals to a Fourth Consecutive Victory. That is huge. So let me paint what’s happened very q…",
    "link": "https://www.fairobserver.com/world-news/us-news/fo-exclusive-mark-carney-leads-liberals-to-a-fourth-consecutive-victory/",
    "timestamp": "2025-05-10T11:48:43Z"
  },
  {
    "title": "Russia and Ukraine blame each other as fighting continues despite Moscow's truce",
    "description": "MOSCOW (Reuters) - Russia said on Saturday that fighting had been taking place in four regions of Ukraine despite this week's unilateral ceasefire by Moscow, saying its troops had been forced to respond to Ukrainian attacks. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/10/russia-and-ukraine-blame-each-other-as-fighting-continues-despite-moscow039s-truce",
    "timestamp": "2025-05-10T11:48:00Z"
  },
  {
    "title": "How Jewish athletes are preparing for the first Maccabiah since October 7",
    "description": "This summer’s Maccabiah Games mark Israel’s first major international event since Oct. 7, 2023, spotlighting Jewish unity, Israeli resilience, and the power of sport.",
    "link": "https://www.jpost.com/israel-news/sports/article-853226",
    "timestamp": "2025-05-10T11:47:31Z"
  },
  {
    "title": "US and Chinese officials start Geneva talks on easing trade war",
    "description": "The United States is seeking to reduce its trade deficit with China and convince Beijing to renounce what the Washington says is a mercantilist economic model",
    "link": "https://www.rappler.com/business/united-states-china-start-tariff-trade-talks-geneva/",
    "timestamp": "2025-05-10T11:47:27Z"
  },
  {
    "title": "How Pope Leo XIV's social media posts offer insight into his politics",
    "description": "Before he became Pope Leo XIV, Cardinal Robert Prevost weighed in on political issues, occasionally posted on social media with some messages appearing to be critical of President Donald Trump and Vice President JD Vance. Reporting for Saturday TODAY, NBC’s M…",
    "link": "https://www.today.com/video/what-direction-will-pope-leo-xiv-take-the-catholic-church-239308357755",
    "timestamp": "2025-05-10T11:47:06Z"
  },
  {
    "title": "US to fast-track investments from Middle East before Trump trip: Report",
    "description": "US is looking to fast-track investments by UAE, Saudi Arabia and Qatar, Bloomberg News said.",
    "link": "https://www.aljazeera.com/economy/2025/5/10/us-to-fast-track-investments-from-middle-east-before-trump-trip-report",
    "timestamp": "2025-05-10T11:46:13Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to CaturSaturday, May 10, 2025, and shabbos for Jewish cats. It’s also National Lipid Day, so stock up on your fats, like this rib-eye cut of Angus beef.  I’d sear this sucker for 1.5 minutes on each side in a cast iron pan (after a day of marinating …",
    "link": "https://whyevolutionistrue.com/2025/05/10/saturday-hili-dialogue-531/",
    "timestamp": "2025-05-10T11:45:12Z"
  },
  {
    "title": "Romanian presidential candidates divided over Netanyahu ICC arrest warrant",
    "description": "Romania's presidential race has a new issue dividing voters: whether or not to invite Prime Minister Netanyahu while he has an active ICC arrest warrant.",
    "link": "https://www.jpost.com/international/article-853412",
    "timestamp": "2025-05-10T11:42:23Z"
  },
  {
    "title": "European Leaders Meet Zelensky in Ukraine, Urge Russia For 30-Day Ceasefire",
    "description": "The leaders of Britain, France, Germany and Poland met Ukrainian President Volodymyr Zelenskiy for talks in Kyiv on Saturday in a show of unity a day after Russia&#039;s Vladimir Putin hosted his allies at a Victory Day parade in Red Square.",
    "link": "https://www.ndtv.com/world-news/european-leaders-meet-zelensky-in-ukraine-urge-russia-for-30-day-ceasefire-8380071",
    "timestamp": "2025-05-10T11:40:19Z"
  },
  {
    "title": "Tariff talks begin between US and Chinese officials in Geneva",
    "description": "There are hopes that the trade dispute between the two countries will now de-escalate.",
    "link": "https://www.thejournal.ie/tariff-talks-us-china-geneva-6701508-May2025/",
    "timestamp": "2025-05-10T11:37:18Z"
  },
  {
    "title": "Maybe Donald will visit Letitia’s trial",
    "description": "As my late mother used to say, God has a great sense of humor. About a year ago, AG Leticia James was in the courtroom watching President Trump on trial. My guess is that she was enjoying the show and imagining what her TV ads for governor were going to be li…",
    "link": "https://freerepublic.com/focus/f-chat/4316114/posts",
    "timestamp": "2025-05-10T11:34:10Z"
  },
  {
    "title": "Trump Announces Judge Jeanine Pirro As Interim US Attorney for DC",
    "description": "President Donald Trump appointed Fox News’ Judge Jeanine Pirro as the interim U.S. Attorney for the District of Columbia. Known for her no-nonsense style and unapologetic defense of the America First agenda, Pirro’s appointment signals a sharp turn away from …",
    "link": "https://freerepublic.com/focus/f-chat/4316113/posts",
    "timestamp": "2025-05-10T11:33:33Z"
  },
  {
    "title": "Who is Jeanine Pirro, newly appointed Interim U.S. Attorney for D.C.",
    "description": "American President, Donald Trump, appointed Jeanine Pirro as the interim top federal prosecutor for Washington, D.C. Pirro's career includes being Westchester County District Attorney and a Fox News legal analyst. She authored 'Liars, Leakers, and Liberals'. …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/who-is-jeanine-pirro-newly-appointed-interim-u-s-attorney-for-d-c/articleshow/121057247.cms",
    "timestamp": "2025-05-10T11:33:11Z"
  },
  {
    "title": "Trump’s Orwellian Erasure of Women",
    "description": "Through executive order, President Donald Trump has used an Orwellian playbook to erase women from the public record.",
    "link": "https://time.com/7284644/trumps-erasure-of-women/",
    "timestamp": "2025-05-10T11:30:00Z"
  },
  {
    "title": "Trump's Popularity Skyrockets After He Deports All Cyclists",
    "description": "U.S. — Despite controversies surrounding tariffs and the defunding of dozens of large government departments, a new poll showed President Donald Trump's popularity skyrocketed after he announced the deportation of all cyclists. The president made the historic…",
    "link": "https://freerepublic.com/focus/f-chat/4316112/posts",
    "timestamp": "2025-05-10T11:25:57Z"
  },
  {
    "title": "JUST IN — Ukraine, European allies want 30-day truce with Russia starting Monday, Kyiv says",
    "description": "The leaders of Germany, France, the UK and Poland met President Volodymyr Zelenskyy in Kyiv. DW has the latest. Ukraine, European allies want 30-day truce with Russia starting Monday\nThe leaders of Britain, France, Germany arrived in Kyiv on a visit showing s…",
    "link": "https://www.dw.com/en/ukraine-european-allies-want-30-day-truce-with-russia-starting-monday/live-72497759",
    "timestamp": "2025-05-10T11:23:00Z"
  },
  {
    "title": "Ukraine claims it’s ready for 30-day ceasefire",
    "description": "Moscow earlier accused Kiev of continuing attacks despite Russia’s proposal for a 72-hour truce Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617296-ukraine-claims-ready-ceasefire/",
    "timestamp": "2025-05-10T11:21:27Z"
  },
  {
    "title": "NY State Budget Includes $10M for Private Legal Fees Tied to Defense of Lawsuits by Trump Administration (Tish James)",
    "description": "A New York budget item negotiated by Albany Democrats sets aside $10 million to cover “reasonable\" private legal expenses that state employees incur in defense of actions brought by President Donald Trump's administration since Jan. 1. Although the fund is fo…",
    "link": "https://freerepublic.com/focus/f-news/4316111/posts",
    "timestamp": "2025-05-10T11:20:10Z"
  },
  {
    "title": "The Baby Tax: Trump’s Tariffs Are an Assault on New Parents",
    "description": "Donald Trump calls himself the “fertilization president” and says he wants Americans to have more children. He’s advocated for expanding IVF access and even proposed paying mothers $5,000 bucks per newborn. But with his recent announcement of global tariffs —…",
    "link": "https://biztoc.com/x/35a178be7db2cc5a",
    "timestamp": "2025-05-10T11:17:43Z"
  },
  {
    "title": "Long-range Russian attacks continue to kill Ukrainians amid ceasefire deadlock",
    "description": "Following a failed ceasefire proposal, Russia has intensified attacks on Ukraine, resulting in numerous civilian casualties. Since March 11, over 117 civilians have been killed in Russian aerial attacks, excluding casualties from short-range weapons. Despite …",
    "link": "https://economictimes.indiatimes.com/news/defence/long-range-russian-attacks-continue-to-kill-ukrainians-amid-ceasefire-deadlock/articleshow/121057210.cms",
    "timestamp": "2025-05-10T11:11:38Z"
  },
  {
    "title": "Trump faces Mideast tensions on return to his 'happy place'",
    "description": "US President Donald Trump heads for Saudi Arabia, Qatar and the United Arab Emirates on Monday, eyeing big business deals even as accords on the Middle East's hotspots will be harder to seal.While Israel's war in Gaza and Iran's nuclear program will loom larg…",
    "link": "https://www.rawstory.com/trump-middle-east-2671928320/",
    "timestamp": "2025-05-10T11:09:37Z"
  },
  {
    "title": "NATO chief comments on potential Ukrainian membership",
    "description": "Kiev was never promised accession to the US-led military bloc as part of a peace deal with Moscow, Mark Rutte has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617289-rutte-nato-ukraine-membership/",
    "timestamp": "2025-05-10T11:06:20Z"
  },
  {
    "title": "The remaking of Marco Rubio",
    "description": "Secretary of State Marco Rubio and President Donald Trump in the Oval Office on April 7, 2025. | Yuri Gripas/Abaca/Bloomberg via Getty Images\nPerhaps you’ve heard about wearing multiple hats at work, but four? It might be too many for most people, but not Mar…",
    "link": "https://biztoc.com/x/a94157190abb5eb3",
    "timestamp": "2025-05-10T11:06:09Z"
  },
  {
    "title": "Tariff talks begin between US and Chinese officials in Geneva",
    "description": "Chinese state media report the U.S. Treasury Secretary and America’s top trade negotiator have begun talks with high-ranking Chinese officials in Switzerland to de-escalate a dispute that threatens to cut off trade between the world’s two biggest econo...",
    "link": "https://abcnews.go.com/US/wireStory/tariff-talks-begin-us-chinese-officials-geneva-world-121664702",
    "timestamp": "2025-05-10T11:01:03Z"
  },
  {
    "title": "Handwriting Analysts Have Seen Trump's Giant Signature — And They Have Thoughts",
    "description": "The way your letters slant or curve and the direction of your pen strokes can reveal a lot about your personality, according to graphologists.",
    "link": "https://www.huffpost.com/entry/donald-trumps-striking-signature-has-people-wondering-if-theres-a-meaning-behind-it-handwriting-analysts-weigh-in-goog_n_681cf62be4b02fbba8e792d5",
    "timestamp": "2025-05-10T11:00:02Z"
  },
  {
    "title": "Move Fast And Break The Law",
    "description": "The federalist society is so last century, honey.",
    "link": "https://slate.com/podcasts/amicus/2025/05/musk-zuckerberg-bezos-and-the-law-kara-swisher-on-big-techs-constitutional-ambush",
    "timestamp": "2025-05-10T11:00:00Z"
  },
  {
    "title": "Trump makes a deal, Bill Gates on Elon Musk's DOGE, and an airport melts down: Business news roundup",
    "description": "President Donald Trump on Thursday announced the first trade deal following his blitz of tariffs, as the U.S. and the United Kingdom agreed to an accord amid Trump’s growing trade war with China and other countries.Read more...",
    "link": "https://qz.com/trump-trade-bill-gates-elon-musk-doge-newark-airport-1851779974",
    "timestamp": "2025-05-10T11:00:00Z"
  },
  {
    "title": "Trump administration halts research to help babies with heart defects",
    "description": "James Antaki, a Cornell biomedical engineering professor, recently lost a federal grant to support PediaFlow, a device to help babies with heart defects.",
    "link": "https://www.nbcnews.com/news/us-news/pediaflow-research-babies-heart-defects-trump-administration-rcna197155",
    "timestamp": "2025-05-10T11:00:00Z"
  },
  {
    "title": "Trump tariffs hit Missouri farmers hard, they say. ‘That’s going to come out of my pocket’",
    "description": "U.S. and China are expected to hold trade talks Saturday through Monday in Switzerland.",
    "link": "https://www.stltoday.com/news/local/business/article_d9cb189a-a92c-43b5-bb20-d9270049de0b.html",
    "timestamp": "2025-05-10T11:00:00Z"
  },
  {
    "title": "EU chief urges Ukraine ceasefire 'without pre-conditions'",
    "description": "A ceasefire in Ukraine must be implemented without pre-conditions, European Commission President Ursula von der Leyen said on Saturday, warning that Moscow would face more sanctions if it breached it. We stand ready to maintain strong pressure on Russia and i…",
    "link": "https://timesofindia.indiatimes.com/world/europe/eu-chief-urges-ukraine-ceasefire-without-pre-conditions/articleshow/121056775.cms",
    "timestamp": "2025-05-10T10:59:40Z"
  },
  {
    "title": "Michael Hudson: The Catholic Church, the Crusades, and the Origins of International Banking",
    "description": "A wide ranging talk that corrects the record about banking, such as the the Catholic Church, as opposed to Jews, being the prime mover",
    "link": "https://www.nakedcapitalism.com/2025/05/michael-hudson-the-catholic-church-the-crusades-and-the-origins-of-international-banking.html",
    "timestamp": "2025-05-10T10:54:16Z"
  },
  {
    "title": "Ras Baraka Blasts Alina Habba After Arrest: 'Get Better Information'",
    "description": "The Newark, New Jersey, mayor has responded to accusations of trespass at an ICE facility from interim U.S. Attorney Alina Habba.",
    "link": "https://www.newsweek.com/ras-baraka-blasts-alina-habba-after-arrest-get-better-information-2070507",
    "timestamp": "2025-05-10T10:52:51Z"
  },
  {
    "title": "Dem Rep. Bera: Trump 'Pulls Us Into' Things Like Gender-Neutral Bathrooms Because We Want Equality",
    "description": "On Friday’s broadcast of NewsNation’s “Cuomo,” Rep. Ami Bera (D-CA) stated that President Donald Trump “is a master at deception, pulling us into these culture wars” and said that Democrats fight for gender-neutral bathrooms “because we do want equality for\nT…",
    "link": "https://www.breitbart.com/clips/2025/05/10/dem-rep-bera-trump-pulls-us-into-things-like-gender-neutral-bathrooms-because-we-want-equality/",
    "timestamp": "2025-05-10T10:40:47Z"
  },
  {
    "title": "Crypto Suddenly Braced For A Huge China Earthquake As $1 Million Bitcoin Price Predicted To Flip Gold",
    "description": "Federal Reserve chair Jerome Powell has been warned a $2.5 trillion “avalanche” is suddenly heading for the U.S. dollar...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/05/10/sudden-25-trillion-avalanche-fed-dollar-warning-as-1-million-bitcoin-price-predicted-to-flip-gold/",
    "timestamp": "2025-05-10T10:40:41Z"
  },
  {
    "title": "Tal Shoham: Hamas rigged a bomb above us in case the IDF came near",
    "description": "Shoham and the other hostages shared a soaked mattress and were fed a single pita per day in a space Shoham said was “40 ft. long, less than three ft. wide.”",
    "link": "https://www.jpost.com/israel-news/article-853409",
    "timestamp": "2025-05-10T10:40:39Z"
  },
  {
    "title": "Sam Altman Extends Olive Branch To Elon Musk: \"Let's Be Friends\"",
    "description": "Sam Altman has expressed a willingness to work with Elon Musk despite the duo being involved in a feud for some time.",
    "link": "https://www.ndtv.com/world-news/sam-altman-extends-olive-branch-to-elon-musk-after-old-posts-surface-lets-be-friends-8379665",
    "timestamp": "2025-05-10T10:35:09Z"
  },
  {
    "title": "US, China start talks in Geneva to ease trade war",
    "description": "High-ranking officials from the United States and China held talks in Switzerland on Saturday in a tentative first step towards defusing a trade war that...",
    "link": "https://www.dailysabah.com/business/economy/us-china-start-talks-in-geneva-to-ease-trade-war",
    "timestamp": "2025-05-10T10:30:44Z"
  },
  {
    "title": "VPM school initiative 'on pause' as Trump targets public media",
    "description": "Programming for Richmond and Petersburg public preschool students is on the local front line of a multiple-front national assault by President Donald Trump on public broadcasting.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_a3b34785-ee31-4433-aff6-0b23c023a152.html",
    "timestamp": "2025-05-10T10:30:00Z"
  },
  {
    "title": "As Trump’s Tariffs Rock The Market, Sports Team Owners Have Nothing To Fear",
    "description": "The president’s erratic policies are raising concerns the economy might be headed for a downturn, but history suggests that franchise values will continue to climb regardless.",
    "link": "https://www.forbes.com/sites/justinbirnbaum/2025/05/10/as-trumps-tariffs-rock-the-market-sports-team-owners-have-nothing-to-fear/",
    "timestamp": "2025-05-10T10:30:00Z"
  },
  {
    "title": "‘Trump Smacked That Thing To Bits’: Gutfield Says President Exposed Trick Democrats Use To Exploit People",
    "description": "By Hailey Gomez, Daily Caller News Foundation | May 06, 2025\nFox News’ Greg Gutfeld said Tuesday that President Donald Trump’s win made voters realize how the Democrat Party has used virtue signaling to “exploit people.”\nDuring former Vice President Kamala Ha…",
    "link": "https://biztoc.com/x/8737719908924338",
    "timestamp": "2025-05-10T10:21:55Z"
  },
  {
    "title": "Trump Announces First Wave Of Federal Court Nominations",
    "description": "By Reagan Reese, Daily Caller News Foundation | May 06, 2025\nWith 46 current judicial appointments to make, President Donald Trump began the process Tuesday by nominating five judges, in addition to one last week, according to a list shared with the Daily Cal…",
    "link": "https://biztoc.com/x/815f91dbef89a0cc",
    "timestamp": "2025-05-10T10:21:50Z"
  },
  {
    "title": "‘Time For Accountability’: Ted Cruz Rattles Off List Of Times Taxpayer-Funded NPR Was Biased Against Conservatives",
    "description": "By Harold Hutchison, Daily Caller News Foundation | May 06, 2025\nRepublican Sen. Ted Cruz of Texas called out National Public Radio (NPR) for bias against conservatives in a video posted to X Tuesday. President Donald Trump announced that NPR and the Public B…",
    "link": "https://biztoc.com/x/c45fc8705057a686",
    "timestamp": "2025-05-10T10:21:43Z"
  },
  {
    "title": "Qatar leads search in Syria for bodies of US hostages killed by ISIL",
    "description": "The search and rescue group has found the remains of three unidentified bodies so far, according to anonymous sources.",
    "link": "https://www.aljazeera.com/news/2025/5/10/qatari-mission-searches-for-bodies-of-us-hostages-killed-by-isil-in-syria",
    "timestamp": "2025-05-10T10:21:07Z"
  },
  {
    "title": "Arab countries hope for big US business amid war in Gaza",
    "description": "Donald Trump is set to embark on his first foreign trip, bearing symbolic gifts for Saudi Arabia, Qatar, and the UAE. Discussions will center on economic engagement, regional security, and potential deals, including a Saudi civil nuclear program. A \"very big …",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/arab-countries-hope-for-big-us-business-amid-war-in-gaza/articleshow/121055888.cms",
    "timestamp": "2025-05-10T10:16:12Z"
  },
  {
    "title": "US and China seek to de-escalate trade war",
    "description": "Senior US and Chinese officials have met in Geneva seeking to defuse trade war tensions. Since President Donald Trump's tariff rollout, tariffs on goods imports between the world's two largest economies have soared.",
    "link": "https://www.dw.com/en/us-and-china-seek-to-de-escalate-trade-war/a-72499779",
    "timestamp": "2025-05-10T10:15:00Z"
  },
  {
    "title": "Brittany Mahomes is included in Bill Belichick and Jordon Hudson's controversial relationship by surprise",
    "description": "Bill Belichick&apos;s girlfriend, Jordon Hudson, is being compared to another frequently targeted woman in football&apos;s spotlight: Brittany Mahomes. \nHudson has reportedly been",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/05/10/681f2624e2704ec0718b45a7.html",
    "timestamp": "2025-05-10T10:11:23Z"
  },
  {
    "title": "The Fox-to-Trump Funnel sweeps up Jeanine Pirro of 'The Five'",
    "description": "The Fox-to-Trump Funnel sweeps up Jeanine Pirro of 'The Five'\nOn the eve of President Trump's inauguration, Fox News star Jeanine Pirro stood on the stage at a party in his honor, his son Donald Trump Jr. by her side.\nA Trump official responsible for hiring r…",
    "link": "https://biztoc.com/x/82abfce8a2334367",
    "timestamp": "2025-05-10T10:11:10Z"
  },
  {
    "title": "Stephen A. Smith Says He’s ‘Glad’ Trump Won Because Dems ‘Have Played’ Black Americans Like ‘Suckers’",
    "description": "By Jason Cohen, Daily Caller News Foundation | May 06, 2025\nESPN’s Stephen A. Smith said Monday he was pleased with President Donald Trump’s 2024 election victory because he believes the Democratic Party has long manipulated black voters.\nTrump garnered 13% o…",
    "link": "https://biztoc.com/x/9b29010ab8c459c8",
    "timestamp": "2025-05-10T10:11:04Z"
  },
  {
    "title": "Trump Admin Upgrades Social Security Telephone Services",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | May 06, 2025\nUnder President Donald Trump, the Social Security Administration is upgrading its telephone services using a modern telephone platform available at all offices nationwide, The Daily Signal has le…",
    "link": "https://biztoc.com/x/3c02ab17d3a3e845",
    "timestamp": "2025-05-10T10:10:54Z"
  },
  {
    "title": "DEI is emerging triumphant in shareholder battles across corporate America from Coca-Cola to Berkshire Hathaway",
    "description": "No matter where you stand politically, it’s hard to deny that it’s been a banner year for the anti-DEI movement: President Donald Trump has issued executive orders designed to stamp out diversity practices in both the private and public sector, and several la…",
    "link": "https://biztoc.com/x/fc130830d2a059f2",
    "timestamp": "2025-05-10T10:10:52Z"
  },
  {
    "title": "Mr. Carney goes to Washington: FP Video unpacks the meeting and where tariffs go from here",
    "description": "As Prime Minister \n \n \n \n \n \n Mark Carney\n \n \n \n \n \n travelled this week across the border to our neighbours to the south, FP Video talked to CEOs, trade experts and executive directors about how Canada should deal with the United States, why \n \n \n \n \n \n Dona…",
    "link": "https://biztoc.com/x/fe932d980e53457d",
    "timestamp": "2025-05-10T10:10:40Z"
  }
]