[
  {
    "title": "Hegseth insists Iran strikes were 'intentionally limited' as US faces prospect of escalating war",
    "description": "Hegseth insists Iran strikes were 'intentionally limited' as US faces prospect of escalating wargo.com",
    "link": "https://abcnews.go.com/Politics/hegseth-insists-iran-strikes-intentionally-limited-us-faces/story?id=123091283",
    "timestamp": "2025-06-22T13:55:00Z"
  },
  {
    "title": "The Iranian Nuclear Strike Was Donald Trump’s Finest Hour",
    "description": "In his finest hour yet as commander-in-chief, Trump greenlit a well-developed plan to carry out a righteous operation to make the world a safer place.\nThe post The Iranian Nuclear Strike Was Donald Trump’s Finest Hour first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/the-iranian-nuclear-strike-was-donald-trumps-finest-hour/",
    "timestamp": "2025-06-22T13:51:56Z"
  },
  {
    "title": "Before and After Images Show Impact of US Strikes on Iran Nuclear Site",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nNew satellite imagery shows large craters and ash at Iran's Fordow nuclear facility following U.S. airstrikes that President Donald Trump said had \"totally obliterated\" Tehran's major nuclear sites.\nThe Contex…",
    "link": "https://biztoc.com/x/630648e75e676f51",
    "timestamp": "2025-06-22T13:51:52Z"
  },
  {
    "title": "Bitcoin Suddenly Braced For $37 Trillion Fed Price Earthquake As Trump Suddenly Flips",
    "description": "Bitcoin has surged over the last year, helped by U.S. president Donald Trump’s prediction that “massive” bitcoin and crypto investment is coming.\nThe bitcoin price, up around 50% since plummeting to April lows, has found a floor at $100,000 despite a surprise…",
    "link": "https://biztoc.com/x/2f44c895280f9cce",
    "timestamp": "2025-06-22T13:51:25Z"
  },
  {
    "title": "Before and After Images Show Impact of US Strikes on Iran Nuclear Site",
    "description": "The U.S. \"achieved destruction of capabilities\" at Fordow, U.S. Defense Secretary Pete Hegseth said.",
    "link": "https://www.newsweek.com/us-strikes-nuclear-sites-fordow-natanz-isfahan-2088943",
    "timestamp": "2025-06-22T13:50:42Z"
  },
  {
    "title": "What to know about the conflict between Israel and Iran, and the US intervention",
    "description": "The United States has inserted itself into Israel’s war against Iran, bombing three of the Islamic Republic’s nuclear sites overnight. U.S. President Donald Trump asserted Iran’s key nuclear sites were “completely and fully obliterated,” and warned there woul…",
    "link": "https://apnews.com/article/israel-attack-iran-strike-nuclear-us-news-5adea3ffa51264e0c7c803d8acfde338",
    "timestamp": "2025-06-22T13:49:53Z"
  },
  {
    "title": "Bombing Iran’s Nuclear Sites Complicates Hunt for What’s Left",
    "description": "The task of ensuring Iran doesn’t build a weapon might just have got tougher.",
    "link": "https://financialpost.com/pmn/business-pmn/bombing-irans-nuclear-sites-complicates-hunt-for-whats-left",
    "timestamp": "2025-06-22T13:49:46Z"
  },
  {
    "title": "Anti-Trump 'No More War' Protests Today: What We Know",
    "description": "There are protests planned in multiple states by multiple groups for Sunday following the U.S. strike on Iran nuclear facilities.",
    "link": "https://www.newsweek.com/no-more-war-protest-donald-trump-iran-us-strike-israel-2088964",
    "timestamp": "2025-06-22T13:48:53Z"
  },
  {
    "title": "Iran's Parliament Votes To Close Straits of Hormuz After US Attacks",
    "description": "The vote took place Sunday after the U.S. on Saturday evening hit three Iranian nuclear sites and significantly damaged the country's capabilities.",
    "link": "https://www.newsweek.com/iran-parliament-vote-close-straits-hormuz-us-attacks-2088968",
    "timestamp": "2025-06-22T13:48:41Z"
  },
  {
    "title": "Democrats Call For Congressional Vote On Trump's 'Illegal' War Against Iran",
    "description": "Republican lawmakers cheered the strikes against Iran despite the president's campaign promises to keep the U.S. out of military entanglements abroad.",
    "link": "https://www.huffpost.com/entry/iran-donald-trump-strikes_n_6857f9e0e4b05236097fb562",
    "timestamp": "2025-06-22T13:48:19Z"
  },
  {
    "title": "'Quite significant': Pentagon description of Iran bombing site raises questions",
    "description": "Immediately following a Sunday morning Pentagon press conference regarding the Saturday bombing attack on Iran ordered by Donald Trump, longtime New York Times Pentagon reporter Helene Cooper noted the wording used for one site by Chairman of the Joint Chiefs…",
    "link": "https://www.rawstory.com/pentagon-iran-bombing/",
    "timestamp": "2025-06-22T13:45:34Z"
  },
  {
    "title": "Oil to open higher as U.S. strikes on Iran boost supply risk premium",
    "description": "Oil is likely to rise by $3-5 per barrel when trading resumes on Sunday evening after the U.S. attacked Iran at the weekend, market analysts said, with gains expected to accelerate only if Iran retaliates hard and causes a major oil supply disruption. \nU.S. P…",
    "link": "https://biztoc.com/x/970e357b089fa3a6",
    "timestamp": "2025-06-22T13:40:20Z"
  },
  {
    "title": "Trump’s Son Says “Mexico Would be Decapitated in Four Seconds” if US Is Attacked",
    "description": "Eric Trump, son of Donald Trump, spoke during the interview with Fox News about Washington’s national defense and security strategy in the face of foreign threats\nThe post Trump’s Son Says “Mexico Would be Decapitated in Four Seconds” if US Is Attacked appear…",
    "link": "https://www.globalresearch.ca/trump-son-mexico-decapitated-four-seconds-us-attacked/5892154",
    "timestamp": "2025-06-22T13:39:31Z"
  },
  {
    "title": "Did Trump violate Constitution with strike on Iran? Republicans in Congress at odds",
    "description": "'Why didn't you call us back from vacation to vote on military action if there was a serious threat to our country?'",
    "link": "https://www.wnd.com/2025/06/did-trump-violate-constitution-strike-iran-republicans-congress/",
    "timestamp": "2025-06-22T13:39:09Z"
  },
  {
    "title": "Iranian media assesses damage from US attack",
    "description": "President Donald Trump has claimed that Tehran’s nuclear facilities were “completely and totally obliterated” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620232-iran-israel-trump-fordow/",
    "timestamp": "2025-06-22T13:37:32Z"
  },
  {
    "title": "Gold price: Gold rate predicted by experts amidst Iran Israel war",
    "description": "Iran-Israel war and the USA's involvement has put on focus on Gold price. Gold's appeal lies not just in crisis-driven uncertainties but in its growing utility.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-gold-rate-predicted-by-experts-amidst-iran-israel-war/articleshow/122007061.cms",
    "timestamp": "2025-06-22T13:36:48Z"
  },
  {
    "title": "Trump’s support keeps growing while Democrats howl at the moon",
    "description": "Rather than offer alternative agendas and compromises with President Donald Trump, Democrats are throwing fits and howling at the moon — all while Trump's support grows.",
    "link": "https://nypost.com/2025/06/22/opinion/trumps-support-keeps-growing-while-democrats-howl-at-the-moon/",
    "timestamp": "2025-06-22T13:36:27Z"
  },
  {
    "title": "U.S. enters war on Iran, strikes nuclear facilities",
    "description": "After a week of anticipation, the U.S. struck Iran's nuclear facilities in Fordow, Natanz, and Isfahan. Iran accuses the U.S. of \"betraying diplomacy\" and violating international law and the UN Charter.",
    "link": "https://mondoweiss.net/2025/06/u-s-enters-war-on-iran-strikes-nuclear-facilities/",
    "timestamp": "2025-06-22T13:36:21Z"
  },
  {
    "title": "Iran may decide that killing Americans is the best way to retaliate",
    "description": "The US president has given the Iranians a choice: negotiate or face devastating escalation.",
    "link": "https://news.sky.com/story/iran-may-decide-that-killing-americans-is-the-best-way-to-retaliate-13387086",
    "timestamp": "2025-06-22T13:33:00Z"
  },
  {
    "title": "Donald Trump's war dilemma: Should America put boots on the ground in Iran or not?",
    "description": "Having struck Iran directly, the US has the Iraq and Afghanistan quagmires to ponder, as also Colin Powell’s you-break-it-you-own-it rule. It’s possible that Trump will opt for what makes him look like a winner, but he’s probably right that nobody knows what …",
    "link": "https://www.livemint.com/opinion/online-views/united-states-israel-iran-trump-gaza-hezbollah-hamas-tel-aviv-west-asia-oil-prices-america-donald-trump-netanyahu-ali-11750593060090.html",
    "timestamp": "2025-06-22T13:32:15Z"
  },
  {
    "title": "Trump Brags Of ‘Obliterating’ Iran’s Nuclear Program, But Top Adviser Is More Cautious",
    "description": "Joint Chiefs of Staff chair Caine says that knowing exactly how much damage Saturday night’s raid did will take time to determine.",
    "link": "https://www.huffpost.com/entry/hegseth-caine-iran_n_6857fc44e4b05236097fb599",
    "timestamp": "2025-06-22T13:32:02Z"
  },
  {
    "title": "Belarusian President Lukashenko Frees Opposition Leader and 13 Other Political Prisoners After 6-Hour Meeting With US Envoy Keith Kellogg, in Victory for Trump Diplomacy",
    "description": "Kellogg helped score a win for the peace efforts by the Trump administration.\nThe post Belarusian President Lukashenko Frees Opposition Leader and 13 Other Political Prisoners After 6-Hour Meeting With US Envoy Keith Kellogg, in Victory for Trump Diplomacy ap…",
    "link": "https://www.thegatewaypundit.com/2025/06/belarusian-president-lukashenko-frees-opposition-leader-13-other/",
    "timestamp": "2025-06-22T13:30:45Z"
  },
  {
    "title": "Hundreds of Voice of America reporters fired as Trump guts outlet (Max Matza/BBC)",
    "description": "Max Matza / BBC:\nHundreds of Voice of America reporters fired as Trump guts outlet  —  Hundreds of journalists for Voice of America (VOA) - most of its remaining staff - have been fired by President Donald Trump's administration, effectively shutting down the…",
    "link": "https://www.memeorandum.com/250622/p25",
    "timestamp": "2025-06-22T13:30:01Z"
  },
  {
    "title": "Vance says U.S. 'not at war with Iran, we're at war with Iran's nuclear program' (Megan Lebowitz/NBC News)",
    "description": "Megan Lebowitz / NBC News:\nVance says U.S. 'not at war with Iran, we're at war with Iran's nuclear program'  —  President Donald Trump said Saturday night that the U.S. had dropped bombs on three Iranian nuclear sites, the first time the U.S. has directly att…",
    "link": "https://www.memeorandum.com/250622/p24",
    "timestamp": "2025-06-22T13:30:01Z"
  },
  {
    "title": "US strikes Iran: How Tom Cruise's Top Gun: Maverick eerily predicted Donald Trump's Operation Midnight Hammer",
    "description": "In June 2025, President Trump—new term, same instincts—ordered a real-world operation that bore eerie resemblance to Maverick. Seven B-2 bombers took off from the US under the cloak of midnight. The mission: Operation Midnight Hammer. The target: Iran’s Fordo…",
    "link": "https://timesofindia.indiatimes.com/world/us/us-strikes-iran-tom-cruise-top-gun-donald-trump-operation-midnight-hammer/articleshow/122006855.cms",
    "timestamp": "2025-06-22T13:28:33Z"
  },
  {
    "title": "Strikes on Iran Were ‘Highly Classified Mission' – Pentagon Chief",
    "description": "The Department of Defense said that the goal of US strikes on Iran’s nuclear facilities was to “destroy or severely degrade” the Islamic Republic’s nuclear program.",
    "link": "https://sputnikglobe.com/20250622/strikes-on-iran-were-highly-classified-mission--pentagon-chief-1122318358.html",
    "timestamp": "2025-06-22T13:28:10Z"
  },
  {
    "title": "Animation shows how huge bunker buster bombs that US dropped on Iran hit targets deep underground",
    "description": "The US has struck Iran's nuclear facility with specialised weapons nicknamed 'bunker busters', with Donald Trump calling it a military success",
    "link": "https://www.ladbible.com/news/us-news/bunker-buster-bombs-iran-us-explained-889272-20250622",
    "timestamp": "2025-06-22T13:27:13Z"
  },
  {
    "title": "Iran has little choice but to retaliate against US - but will Russia and China back them?",
    "description": "Donald Trump's decision to attack Iran could trigger a wider regional or even global war, but much will hinge on how Russia and China - Tehran's most powerful allies - respond.",
    "link": "https://news.sky.com/story/iran-has-little-choice-but-to-retaliate-against-us-as-russia-faces-urgent-decision-on-how-to-back-tehran-13387090",
    "timestamp": "2025-06-22T13:27:00Z"
  },
  {
    "title": "President Trump – What It Takes to be Part of the Chosen Ones. No Evidence that Iran Wants to Build Nuclear Weapons. “Donald, The Emperor without Clothes”. Peter Koenig",
    "description": "Trump the Peace President may well end up as one of US history’s most monstrous war Presidents and associate genociders.\nHe was with the Gaza massacre from day one. He was part of the Hamas attack on 7 October 23. …\nThe post President Trump – What It Takes to…",
    "link": "https://www.globalresearch.ca/president-trump-part-chosen-ones/5892144",
    "timestamp": "2025-06-22T13:25:10Z"
  },
  {
    "title": "Defense Secretary Hegseth: 'This Mission Was Not, Has Not Been About Regime Change'",
    "description": "President Donald Trump desires a cessation of hostilities and a path towards peace following successful strikes Saturday that devastated Iran's nuclear capabilities, Defense Secretary Pete Hegseth made clear Sunday.\nThe post Defense Secretary Hegseth: ‘This M…",
    "link": "https://www.breitbart.com/politics/2025/06/22/defense-secretary-hegseth-this-mission-was-not-has-not-been-about-regime-change/",
    "timestamp": "2025-06-22T13:25:03Z"
  },
  {
    "title": "US lawmakers condemn Trump for ‘unconstitutional’ attack on Iran",
    "description": "US lawmakers and American citizens have condemned Donald Trump’s decision to bomb Iran's nuclear sites.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/22/us-lawmakers-condemn-trump-for-unconstitutional-attack-on-iran",
    "timestamp": "2025-06-22T13:21:40Z"
  },
  {
    "title": "Donald Trump Announces 'Spectacular Military Success' As US Strikes Key Iranian Nuclear Sites",
    "description": "On Saturday night President Donald Trump declared successful strikes on three crucial Iranian nuclear sites, terming it a ‘spectacular military success’.\nWhat Happened: The US military executed precision strikes on the Fordo, Natanz, and Isfahan nuclear facil…",
    "link": "https://biztoc.com/x/a8b41eac7a610593",
    "timestamp": "2025-06-22T13:18:38Z"
  },
  {
    "title": "'Bold And Brilliant': Pete Hegseth Slathers Praise Over Trump After Iran Strike",
    "description": "Defense Secretary Pete Hegseth praised President Donald Trump for his \"bold\" and \"brilliant\" leadership in his first press conference since the U.S. military conducted a strike on Iran.\n\n\n\"It was an incredible and overwhelming success,\" Hegseth told reporters…",
    "link": "https://crooksandliars.com/2025/06/bold-and-brilliant-pete-hegseth-slathers",
    "timestamp": "2025-06-22T13:18:18Z"
  },
  {
    "title": "Senior Russian Official Reveals Countries Are Ready to Supply Iran With Nuclear Warheads",
    "description": "Dmitry Medvedev warned the United States that several countries are ready to arm Iran with their nuclear warheads after the US bombing of nuclear facilities. \nThe post Senior Russian Official Reveals Countries Are Ready to Supply Iran With Nuclear Warheads fi…",
    "link": "https://www.mediaite.com/media/news/senior-russian-official-reveals-countries-are-ready-to-supply-iran-with-nuclear-warheads/",
    "timestamp": "2025-06-22T13:17:12Z"
  },
  {
    "title": "Tulsi Changes Her Tune, Now Says Iran Could Produce Nuclear Weapon 'Within Weeks'",
    "description": "Threatened with imminent expulsion from her cabinet position, Tulsi Gabbard did what everyone else in Trump's orbit does: she denied saying what she previously said about Iran's capabilities for producing nuclear weapons. That she and the White House convenie…",
    "link": "https://crooksandliars.com/2025/06/tulsi-changes-her-tune-says-iran-could",
    "timestamp": "2025-06-22T13:16:09Z"
  },
  {
    "title": "Special Needs Families Beg Senators Not To Cut Their Medicaid",
    "description": "The New York Times reported on the Little Lobbyists’ efforts in a heartbreaking article. They are a group of children with serious medical needs and their parents who rely on Medicaid. They went to Capitol Hill last week to warn that Trump’s Big Beautiful Bil…",
    "link": "https://crooksandliars.com/2025/06/special-needs-families-beg-senators-not",
    "timestamp": "2025-06-22T13:16:09Z"
  },
  {
    "title": "Enemies Within: Information Ties Top USAID Official to Dirty Eric Ciaramella and the First Bogus Attempt to Impeach President Trump",
    "description": "Trump Attorney Rudy Giuliani joined Jesse Watters in 2020 where he broke news about the January 2016 meeting in the Obama White House organized by the anti-Trump CIA whistleblower Eric Ciaramella.\nThe post Enemies Within: Information Ties Top USAID Official t…",
    "link": "https://www.thegatewaypundit.com/2025/06/enemies-within-information-ties-top-usaid-official-dirty/",
    "timestamp": "2025-06-22T13:15:34Z"
  },
  {
    "title": "Satellite images show the damage at Iran's deeply buried Fordow nuclear site after massive US strikes",
    "description": "US B-2 Spirit stealth bomber aircraft dropped heavy bunker-buster bombs on Fordow and other Iranian nuclear sites.",
    "link": "https://www.businessinsider.com/satellite-images-damage-iran-fordow-nuclear-site-after-us-strikes-2025-6",
    "timestamp": "2025-06-22T13:14:04Z"
  },
  {
    "title": "'Bold and brilliant': Pete Hegseth slathers praise on Trump for Iran strike",
    "description": "Defense Secretary Pete Hegseth praised President Donald Trump for his \"bold\" and \"brilliant\" leadership in his first press conference since the U.S. military conducted a strike on Iran.\"It was an incredible and overwhelming success,\" Hegseth told reporters on…",
    "link": "https://www.rawstory.com/hegseth-praises-trump-for-iran/",
    "timestamp": "2025-06-22T13:13:28Z"
  },
  {
    "title": "Israel-Iran conflict in 'decisive phase' after US strikes, say experts",
    "description": "Tensions escalate as the US strikes Iranian nuclear sites at Fordow, Natanz, and Esfahan. President Trump claims the sites are obliterated. Experts fear a radiation leak and potential closure of the Strait of Hormuz. This closure could severely impact the glo…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-iran-conflict-in-decisive-phase-after-us-strikes-say-experts/articleshow/122006924.cms",
    "timestamp": "2025-06-22T13:12:46Z"
  },
  {
    "title": "DOD reveals stunning new details following Trump's attack on Iran",
    "description": "Defense Secretary Pete Hegseth and Chairman of the Joint Chiefs of Staff Gen. Dan Caine revealed stunning new details following President Donald Trump's historic strikes against Iranian nuclear sites on Saturday. Hegseth and Caine confirmed deception was invo…",
    "link": "https://www.theblaze.com/news/dod-reveals-details-iran-attack",
    "timestamp": "2025-06-22T13:12:27Z"
  },
  {
    "title": "Trump Flip-Flops on Iran Regime Change",
    "description": "In the beginning of his second term (2024), President Donald Trump predicted that he would be remembered as a ‘peacemaker and unifier ‘ suggesting on Inauguration Day that “Our power will stop all wars and bring a new spirit of unity to a world that has been …",
    "link": "https://www.globalresearch.ca/trump-flip-flops-iran-regime-change/5892160",
    "timestamp": "2025-06-22T13:12:10Z"
  },
  {
    "title": "Trump has opened a Pandora's box (Edward Luce/Financial Times)",
    "description": "Edward Luce / Financial Times:\nTrump has opened a Pandora's box  —  The US president hopes that his display of power in Iran will stop the war — but that is not his decision to make  —  They say with Donald Trump that accusation is confession.  Having warned …",
    "link": "https://www.memeorandum.com/250622/p23",
    "timestamp": "2025-06-22T13:10:00Z"
  },
  {
    "title": "Oil markets tense amid U.S. airstrikes on Iran, while Bitcoin price holds steady",
    "description": "Global oil markets are on high alert following U.S. airstrikes on three of Iran’s nuclear facilities, Fordow, Isfahan, and Natanz, with fears mounting over a potential closure of the critical Strait of Hormuz. The military action, announced by President Donal…",
    "link": "https://cryptoslate.com/oil-markets-tense-amid-u-s-airstrikes-on-iran-while-bitcoin-price-holds-steady/",
    "timestamp": "2025-06-22T13:09:57Z"
  },
  {
    "title": "Critics Ramp Up Scrutiny On the 22-Year-Old ‘Former Lawn Boy’ Trump Put in Charge of Terrorism Prevention Unit — Amid Iran Threats of Retribution",
    "description": "Amid threats of retribution from Iran, critics have ramped up scrutiny on the 22-year-old who was assigned to a major terrorism-prevention post by Trump.\nThe post Critics Ramp Up Scrutiny On the 22-Year-Old ‘Former Lawn Boy’ Trump Put in Charge of Terrorism P…",
    "link": "https://www.mediaite.com/media/news/critics-ramp-up-scrutiny-on-the-22-year-old-former-lawn-boy-trump-put-in-charge-of-terrorism-prevention-unit-amid-iran-threats-of-retribution/",
    "timestamp": "2025-06-22T13:09:01Z"
  },
  {
    "title": "Trump Proposes $1,000 'Trump Accounts' for Babies",
    "description": "Trump Proposes $1,000 'Trump Accounts' for Babiescafemom.com",
    "link": "https://cafemom.com/entertainment/trump-proposes-1000-trump-account-for-babies-as-part-of-his-one-big-beautiful-bill",
    "timestamp": "2025-06-22T13:07:49Z"
  },
  {
    "title": "Vance says U.S. 'not at war with Iran, we’re at war with Iran’s nuclear program'",
    "description": "WASHINGTON — Vice President JD Vance said on Sunday that the U.S. is not at war with Iran, but with Tehran's nuclear weapons program, and declined to confirm with 100% confidence that the country’s nuclear sites had been completely destroyed",
    "link": "https://www.nbcnews.com/politics/trump-administration/vance-says-us-not-war-iran-re-war-irans-nuclear-program-rcna214329",
    "timestamp": "2025-06-22T13:07:42Z"
  },
  {
    "title": "Trump Just Silenced the Internet’s Alpha Bros Over Iran",
    "description": "The U.S. strikes on Iran shattered the online brotherhood of MAGA masculinity.",
    "link": "https://gizmodo.com/trump-just-silenced-the-internets-alpha-bros-over-iran-2000618732",
    "timestamp": "2025-06-22T13:07:03Z"
  },
  {
    "title": "US bombs Iran: What we know about US strikes on Iran’s nuclear facilities",
    "description": "US President Donald Trump ordered the US military to bomb three nuclear sites in Iran. Here’s what we know.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/22/us-bombs-iran-what-we-know-about-us-strikes-on-irans-nuclear-facilities",
    "timestamp": "2025-06-22T13:06:51Z"
  },
  {
    "title": "Defense Secretary Pete Hegseth Says U.S. Bombing Of Iran “Devastated” Its Nuclear Program; Final Damage Assessment Still Pending",
    "description": "Secretary of Defense Pete Hegseth said that the U.S. bombing of Iran “devastated the Iranian nuclear program,” concluding that the Tehran regime’s nuclear ambitions “have been obliterated.” His comments were based on initial assessments of the damage from the…",
    "link": "http://deadline.com/2025/06/u-s-iran-nuclear-strikes-hegseth-1236439388/",
    "timestamp": "2025-06-22T13:06:46Z"
  },
  {
    "title": "Lapid: 'The world has become safer since last night'",
    "description": "Opposition leader Yair Lapid visited the site of a recent Iranian missile strike in Tel Aviv today, and delivered a statement contrasting Israel and its allies with the Iranian regime.",
    "link": "https://www.israelnationalnews.com/news/410461",
    "timestamp": "2025-06-22T13:06:20Z"
  },
  {
    "title": "Inside Look at the Rise of Political Violence in the United States",
    "description": "After an alarming rise in recent of political violence, including an assassination attempt on Donald Trump, a gunman in Minnesota targeting Democratic lawmakers, and now a man accused of trying to kidnap the Mayor of Memphis, many lawmakers across the country…",
    "link": "https://www.today.com/video/us-lawmakers-express-concerns-amid-rise-in-political-violence-242051141545",
    "timestamp": "2025-06-22T13:01:04Z"
  },
  {
    "title": "Which Crypto IPOs Could Be Next Following Circle?",
    "description": "Following Circle’s hugely successful IPO, big names in the crypto industry are preparing listings as investor demand soars.",
    "link": "https://decrypt.co/326369/which-crypto-ipos-could-be-next-following-circle",
    "timestamp": "2025-06-22T13:01:02Z"
  },
  {
    "title": "Pro-life movement confronts high abortion rates three years after Dobbs",
    "description": "Pro-life movement faces challenges as abortions remain frequent after Dobbs, focusing on defunding Planned Parenthood, restricting abortion pills and backing political candidates",
    "link": "https://www.foxnews.com/politics/pro-life-movement-confronts-high-abortion-rates-three-years-after-dobbs",
    "timestamp": "2025-06-22T13:00:54Z"
  },
  {
    "title": "Iran Regime Says Nuclear Sites ‘Evacuated a While Ago’ — Claims They “Didn’t Suffer a Major Blow”",
    "description": "President Donald Trump authorized precision strikes on three of Iran’s pivotal nuclear sites—Fordow, Natanz, and Esfahan—on Saturday, deploying B‑2 stealth bombers armed with Massive Ordnance Penetrators (MOPs) and Tomahawk missiles.\nThe post Iran Regime Says…",
    "link": "https://www.thegatewaypundit.com/2025/06/iran-regime-says-nuclear-sites-evacuated-while-ago/",
    "timestamp": "2025-06-22T13:00:44Z"
  },
  {
    "title": "'Baby steps': Leader Thune details his work to corral Republicans behind Trump's legislative vision",
    "description": "Leader Thune works to balance fiscal hawks' demands for deeper cuts with concerns about Medicaid changes in Trump's bill, describing the process as \"incremental baby steps\" toward July 4.",
    "link": "https://www.foxnews.com/politics/baby-steps-leader-thune-details-his-work-corral-republicans-behind-trumps-legislative-vision",
    "timestamp": "2025-06-22T13:00:38Z"
  },
  {
    "title": "Despite Trump’s backing, crypto is choosing MiCA over America: Paybis",
    "description": "As Europe embraces MiCA, crypto volumes surged 70% for platforms like Paybis. Meanwhile, U.S. retail activity dropped, even under Trump’s pro-crypto stance.",
    "link": "https://cointelegraph.com/news/crypto-flows-to-europe-under-mica-trump-us-retreat",
    "timestamp": "2025-06-22T13:00:31Z"
  },
  {
    "title": "Weekend Beacon 6/22/25",
    "description": "If and when the Tehran regime falls, what will happen to the ayatollah's apologists? Will they suffer amnesia and insist they were on the people's side all along? Time to take those screenshots—the reckoning can't come soon enough.\nThe post Weekend Beacon 6/2…",
    "link": "https://freebeacon.com/newsletters/weekend-beacon-6-22-25/",
    "timestamp": "2025-06-22T13:00:26Z"
  },
  {
    "title": "What Kissinger did (and didn't) say about Trump",
    "description": "Popular Facebook posts include two quotes that are accurate representations of Kissinger's comments, while several others appear to be fabricated.",
    "link": "https://www.snopes.com//fact-check/trump-kissinger-quotes/",
    "timestamp": "2025-06-22T13:00:00Z"
  },
  {
    "title": "Kerry Kennedy allegedly getting $1M+ to save family’s reputation — as cousin Caroline is ‘virtually blacklisted’ over son’s odd behavior",
    "description": "Today, they’re earning a schoolyard reputation for infighting with mean-spirited attacks on siblings and cousins, bizarre social media rants, and historically bitchy personal feuds.",
    "link": "https://nypost.com/2025/06/22/us-news/kerry-kennedy-allegedly-getting-1m-to-save-familys-legacy/",
    "timestamp": "2025-06-22T13:00:00Z"
  },
  {
    "title": "Iran-Israel conflict: Diplomacy window shut early",
    "description": "The reason points to Trump’s military advisors backing continued attacks as Israel had already softened the ground through their lightning strikes",
    "link": "https://www.thehindubusinessline.com/opinion/iran-israel-conflict-diplomacy-window-shut-early/article69724518.ece",
    "timestamp": "2025-06-22T13:00:00Z"
  },
  {
    "title": "NATO Offers to Tweak 5% Spending Goal to Win Spanish Approval",
    "description": "NATO is adjusting its defense spending language to secure Spain's support ahead of its summit, changing the commitment from \"we\" to \"allies\" for a 5% GDP target. Spanish PM Pedro Sanchez opposes this target, advocating for 2.1%. The summit will also address b…",
    "link": "https://www.livemint.com/companies/news/nato-offers-to-tweak-5-spending-goal-to-win-spanish-approval-11750597193767.html",
    "timestamp": "2025-06-22T12:59:53Z"
  },
  {
    "title": "Commission Proposes New Local Authorities for Palisades, Malibu, Altadena After Fire",
    "description": "A blue-ribbon commission established by Los Angeles County after the Palisades and Eaton Fires suggests creating new local authorities for the Pacific Palisades, Malibu, and Altadena to manage their own rebuilding.\nThe post Commission Proposes New Local Autho…",
    "link": "https://www.breitbart.com/politics/2025/06/22/commission-proposes-new-local-authorities-for-palisades-malibu-altadena-after-fire/",
    "timestamp": "2025-06-22T12:58:33Z"
  },
  {
    "title": "Mitch McConnell weighs in on U.S. strikes in Iran",
    "description": "Indiana Governor Mike Braun and Senator Todd Young gave their thoughts on the U.S. strikes in Iran, and now, Senator Mitch McConnell has given his thoughts.",
    "link": "https://www.tristatehomepage.com/news/mitch-mcconnell-weighs-in-on-u-s-strikes-in-iran/",
    "timestamp": "2025-06-22T12:58:14Z"
  },
  {
    "title": "Operation Midnight Hammer: How six bunker busters and 75 precision weapons powered the US’s second-largest B-2 strike",
    "description": "In the early hours of Sunday, the United States launched a surprise aerial assault on three major Iranian nuclear sites in a covert operation named 'Midnight Hammer'. This marked the most extensive B-2 bomber mission in US history. With 75 precision-guided we…",
    "link": "https://economictimes.indiatimes.com/news/defence/operation-midnight-hammer-how-six-bunker-busters-and-75-precision-weapons-powered-the-uss-second-largest-b-2-strike/articleshow/122006421.cms",
    "timestamp": "2025-06-22T12:57:58Z"
  },
  {
    "title": "Oil prices expected to be impacted following US bombing of Iran nuclear sites",
    "description": "The global oil market is a point of major focus after the U.S. attacked three key Iranian nuclear sites on Saturday night.\nOil prices are expected to rise following what President Donald Trump called \"a spectacular military success\" in which, he said, Iran's …",
    "link": "https://biztoc.com/x/3629eaa0b471ba48",
    "timestamp": "2025-06-22T12:56:17Z"
  },
  {
    "title": "Inside 44-hour non-stop secret mission to bomb Iran’s nuclear site using $2.1 billion stealth plane",
    "description": "The US military deployed B-2 stealth bombers to bomb Iran's bases, with Donald Trump calling the mission a 'success'",
    "link": "https://www.ladbible.com/news/world-news/usa-bombs-iran-b2-stealth-bombers-explained-214913-20250622",
    "timestamp": "2025-06-22T12:55:07Z"
  },
  {
    "title": "Iran nuclear facilities 'totally obliterated' after U.S. strikes, Trump says (James Downie/MSNBC)",
    "description": "James Downie / MSNBC:\nIran nuclear facilities ‘totally obliterated’ after U.S. strikes, Trump says  —  Trump has argued that Iran is very close to a nuclear weapon, though the U.S. intelligence community disagrees with that assessment.  —  President Donald Tr…",
    "link": "https://www.memeorandum.com/250622/p20",
    "timestamp": "2025-06-22T12:55:00Z"
  },
  {
    "title": "You can’t bomb, shoot and kill your way to peace, despite what Trump thinks",
    "description": "Last night, after eight days of Israeli air assaults, the United States has entered the war on Iran in a major escalation of the conflict.",
    "link": "https://www.thejournal.ie/readme/united-states-iran-attack-6740276-Jun2025/",
    "timestamp": "2025-06-22T12:53:44Z"
  },
  {
    "title": "Before US strikes on Iran, Israeli attacks dealt a ‘severe blow’",
    "description": "The IAF hit over 50% of Iranian missile launchers, has flown over 1,000 sorties, hitting nuclear sites, missile production and even Iranian fighter jets and refueling jets. Report.",
    "link": "https://www.israelnationalnews.com/news/410460",
    "timestamp": "2025-06-22T12:52:19Z"
  },
  {
    "title": "US signals a willingness to renew talks with Iran and avoid a prolonged war",
    "description": "The Trump administration on Sunday signaled a willingness to renew talks with Iran and avoid a prolonged war in the aftermath of a surprise attack on three of the country’s nuclear sites as U.S. officials assessed Tehran’s nuclear ambitions and the threat of …",
    "link": "https://www.denverpost.com/2025/06/22/us-signals-a-willingness-to-renew-talks-with-iran-and-avoid-a-prolonged-war/",
    "timestamp": "2025-06-22T12:50:48Z"
  },
  {
    "title": "Trump is open to regime change in Iran, after his administration said that wasn’t the goal",
    "description": "The Trump administration on Sunday signaled a willingness to renew talks with Iran and avoid a prolonged war in the aftermath of a surprise attack on three of the country’s nuclear sites as U.S. officials assessed Tehran’s nuclear ambitions and the threat of …",
    "link": "https://www.denverpost.com/2025/06/22/trump-is-open-to-regime-change-in-iran-after-his-administration-said-that-wasnt-the-goal/",
    "timestamp": "2025-06-22T12:50:48Z"
  },
  {
    "title": "US signals a willingness to renew talks with Iran and avoid a prolonged war",
    "description": "Defense Secretary Pete Hegseth said Sunday that America “does not seek war” with Iran in the aftermath of a surprise attack overnight on three of that country’s nuclear sites.",
    "link": "https://www.bostonherald.com/2025/06/22/us-signals-a-willingness-to-renew-talks-with-iran-and-avoid-a-prolonged-war/",
    "timestamp": "2025-06-22T12:50:48Z"
  },
  {
    "title": "Trump is open to regime change in Iran, after his administration said that wasn’t the goal",
    "description": "Defense Secretary Pete Hegseth said Sunday that America “does not seek war” with Iran in the aftermath of a surprise attack overnight on three of that country’s nuclear sites.",
    "link": "https://www.bostonherald.com/2025/06/22/trump-is-open-to-regime-change-in-iran-after-his-administration-said-that-wasnt-the-goal/",
    "timestamp": "2025-06-22T12:50:48Z"
  },
  {
    "title": "Vance says Iran has a renewed chance to pursue ‘the path of peace’ after US attack",
    "description": "Defense Secretary Pete Hegseth said Sunday that America “does not seek war” with Iran in the aftermath of a surprise attack overnight on three of that country’s nuclear sites.",
    "link": "https://www.bostonherald.com/2025/06/22/vance-says-iran-has-a-renewed-chance-to-pursue-the-path-of-peace-after-us-attack/",
    "timestamp": "2025-06-22T12:50:48Z"
  },
  {
    "title": "Pentagon says US doesn't want to pursue war with Iran after bombing 3 of its nuclear sites",
    "description": "Defense Secretary Pete Hegseth said Sunday that America “does not seek war” with Iran in the aftermath of a surprise attack overnight on three of that...",
    "link": "https://www.yahoo.com/news/pentagon-says-us-doesnt-want-125048874.html",
    "timestamp": "2025-06-22T12:50:48Z"
  },
  {
    "title": "US bombing of Iran has an unlikely Nazi Germany link; Hitler invaded USSR on June 22, Trump’s forces attack on same date 84 years later",
    "description": "In a surprise move, the US military targeted Iranian nuclear sites. This action escalates the ongoing conflict between Israel and Iran. The strikes occurred after Israeli attacks on Iranian air defenses. The US strikes came as Russia observed Nazi Germany’s s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-bombing-of-iran-has-an-unlikely-nazi-germany-link-hitler-invaded-ussr-on-june-22-trumps-forces-attack-on-same-date-84-years-later/articleshow/122006683.cms",
    "timestamp": "2025-06-22T12:50:32Z"
  },
  {
    "title": "Iran’s Foreign Minister Heading for Moscow Talks with Putin",
    "description": "Iran’s foreign minister will head to Moscow late Sunday night to meet with Russian President Vladimir Putin in the wake of U.S. strikes on Tehran’s nuclear facilities. The Daily Telegraph reports Abbas Araghchi confirmed Iran “reserves all options to defend i…",
    "link": "https://freerepublic.com/focus/f-news/4324598/posts",
    "timestamp": "2025-06-22T12:50:05Z"
  },
  {
    "title": "Hegseth claims Iran's nuclear ambitions 'obliterated' after U.S. strikes",
    "description": "Defense Secretary Pete Hegseth echoed remarks made by President Donald Trump Saturday following strikes on three major nuclear enrichment facilities in Iran.",
    "link": "https://www.cnbc.com/2025/06/22/hegseth-iran-us-attack.html",
    "timestamp": "2025-06-22T12:49:18Z"
  },
  {
    "title": "Full: Trump address, US bombs Iran",
    "description": "President Donald Trump delivered a presidential address after the U.S. struck Iranian nuclear sites on Saturday.",
    "link": "https://www.fox6now.com/video/1662491",
    "timestamp": "2025-06-22T12:47:30Z"
  },
  {
    "title": "“War Starts Right Now”: Iran’s Revolutionary Guard Vows Retaliation After Trump Orders Bombing of Three Nuclear Sites",
    "description": "President Donald Trump ordered the U.S.\nThe post “War Starts Right Now”: Iran’s Revolutionary Guard Vows Retaliation After Trump Orders Bombing of Three Nuclear Sites appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/war-starts-right-now-irans-revolutionary-guard-vows/",
    "timestamp": "2025-06-22T12:45:55Z"
  },
  {
    "title": "Pakistan Will Nominate 'Genuine Peacemaker' Trump for Nobel Peace Prize",
    "description": "Pakistan has announced plans to nominate President Donald Trump for the Nobel Peace Prize, citing his role in easing tensions between nuclear-armed neighbors India and Pakistan.\nThe proposal follows Trump’s unexpected declaration of a ceasefire in May, which …",
    "link": "https://biztoc.com/x/55934f9983414d70",
    "timestamp": "2025-06-22T12:45:24Z"
  },
  {
    "title": "Pope Leo Urges Diplomatic End to Middle East Wars Before World Falls Into 'Irreparable Abyss'",
    "description": "In the wake of the American strikes on nuclear sites in the Islamist-run nation of Iran, Pope Leo XIV called for a return to diplomacy and prayed for peace to come to the Middle East.\nThe post Pope Leo Urges Diplomatic End to Middle East Wars Before World Fal…",
    "link": "https://www.breitbart.com/europe/2025/06/22/pope-leo-urges-diplomatic-end-to-middle-east-wars-before-world-falls-into-irreparable-abyss/",
    "timestamp": "2025-06-22T12:45:05Z"
  },
  {
    "title": "Iranian nuclear program 'devastated'— US defense secretary",
    "description": "US Secretary of Defense Hegseth called strikes on Iran that included 14 bunker-busting 30,000-pound bombs an \"overwhelming success.\" Iran's top diplomat defended the country's right to \"a legitimate response.\" US President Donald Trump says 3 nuclear sites in…",
    "link": "https://www.dw.com/en/iranian-nuclear-program-devastated-us-defense-secretary/live-72996785",
    "timestamp": "2025-06-22T12:44:00Z"
  },
  {
    "title": "Iran State TV Says Every American in the Region ‘Now a Legitimate Target’",
    "description": "Hamas condemns 'blatant U.S. aggression' against regime's nuclear program.\nThe post Iran State TV Says Every American in the Region ‘Now a Legitimate Target’  first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/iran-state-tv-says-every-american-in-the-region-now-a-legitimate-target/",
    "timestamp": "2025-06-22T12:40:36Z"
  },
  {
    "title": "Special Coverage: US Attacks Nuclear Sites in Iran",
    "description": "American bombers struck Iran’s three main nuclear sites overnight, putting the US directly into Tehran’s war with Israel despite President Donald Trump’s longtime promises to avoid new conflicts.Addressing the nation late on Saturday in Washington, Trump said…",
    "link": "https://omny.fm/shows/bloomberg-surveillance/special-coverage-us-attacks-nuclear-sites-in-iran",
    "timestamp": "2025-06-22T12:39:08Z"
  },
  {
    "title": "US Strikes Iranian Nuclear Sites, Trump Says",
    "description": "President Donald Trump said Iran’s major nuclear enrichment facilities were “completely and totally obliterated” after the United States dropped bombs on them — and warned that American forces would carry out further hostilities if Tehran does not negotiate a…",
    "link": "https://www.today.com/news/us-strikes-iranian-nuclear-sites-trump-says-rcna214333",
    "timestamp": "2025-06-22T12:38:19Z"
  },
  {
    "title": "US stock market outlook: Will S&P 500, Dow Jones, Nasdaq crash or rise amidst Iran Israel war?",
    "description": "Donald Trump-headed USA's direct involvement Iran Israel war is set to have an impact on the US Stock Market.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-outlook-will-sp-500-dow-jones-nasdaq-crash-or-rise-amidst-iran-israel-war/articleshow/122006577.cms",
    "timestamp": "2025-06-22T12:37:53Z"
  },
  {
    "title": "Iran Delivers Furious Warning, Speaks of ‘Unprecedented Level of Danger and Chaos’ After ‘Heinous’ U.S. Strikes",
    "description": "\"The warmongering and lawless Administration in Washington is solely responsible for the dangerous consequences of its act of aggression.\"",
    "link": "https://time.com/7296512/iran-responds-united-states-strikes-trump-nuclear-sites-warning/",
    "timestamp": "2025-06-22T12:37:33Z"
  },
  {
    "title": "'An astonishing double cross': Trump accused of betraying his supporters",
    "description": "Donald Trump's decision to launch an attack on Iran without approval from Congress was hammered by a Democratic senator on MSNBC early Sunday morning as he accused the president of a \"double cross\" perpetrated on U.S. voters.Speaking with the hosts of \"The We…",
    "link": "https://www.rawstory.com/trump-double-cross-iran/",
    "timestamp": "2025-06-22T12:35:47Z"
  },
  {
    "title": "Expert confident Iran's nuclear program is 'no longer' after massive US strike",
    "description": "An expert says Iran’s nuclear program 'is no longer' after U.S. B-2 strikes on key sites; Netanyahu was reportedly informed ahead of the operation.",
    "link": "https://www.foxnews.com/politics/expert-confident-irans-nuclear-program-no-longer-after-massive-us-strike",
    "timestamp": "2025-06-22T12:35:12Z"
  },
  {
    "title": "Analysis: The answer to this question is key after Trump’s strike on Iran | CNN",
    "description": "After the United States’ overnight strikes on Iran’s secretive nuclear program, the most important question is at least a “known unknown” – that is, what remains of it. The answer could define the region for decades to come.",
    "link": "https://www.cnn.com/2025/06/22/middleeast/unknowns-after-trump-strike-iran-intl-cmd",
    "timestamp": "2025-06-22T12:34:30Z"
  },
  {
    "title": "Hegseth: Iran strikes not about regime change",
    "description": "United States Defense Secretary Pete Hegseth insisted on Sunday that the strikes on Iran's nuclear facilities were \"not about regime change\" in that country.\"The president [Donald Trump] authorized a ...",
    "link": "https://biztoc.com/x/4bc7d6c021d18a0d",
    "timestamp": "2025-06-22T12:34:05Z"
  }
]