[
  {
    "title": "‘HIGHLY PROBLEMATIC’: DOJ Raised Concerns Over Biden Autopen Clemencies",
    "description": "The Biden administration’s Justice Department raised concerns about the Biden White House using broad categories to grant clemency to groups of people rather than identifying... Read More\nThe post ‘HIGHLY PROBLEMATIC’: DOJ Raised Concerns Over Biden Autopen C…",
    "link": "https://www.dailysignal.com/2025/08/20/highly-problematic-doj-raised-concerns-biden-autopen-clemency/",
    "timestamp": "2025-08-20T14:54:02Z"
  },
  {
    "title": "Meet Newsom Press Flack Izzy Gardon: Trolling Trump, with $40 Billion in Fire Relief at Risk",
    "description": "Meet Izzy Gardon — the press flack behind the “@GovPressOffice” account that has begun imitating and mocking President Donald Trump, with the state still needing $40 billion in federal aid for fire victims. Gardon, who lists his term as “student body presiden…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335637/posts",
    "timestamp": "2025-08-20T14:52:48Z"
  },
  {
    "title": "Trump demands the resignation of a key Fed official as he broadens his attacks on the central bank",
    "description": "President Donald Trump called for Fed Governor Lisa Cook to resign after the director of the FHFA said she may have committed mortgage fraud.",
    "link": "https://www.businessinsider.com/trump-fed-lisa-cook-resignation-mortgage-fhfa-doj-bondi-powell-2025-8",
    "timestamp": "2025-08-20T14:52:11Z"
  },
  {
    "title": "Wall Street tech selloff deepens, European shares steady",
    "description": "MUMBAI/SAN FRANCISCO :Wall Street shares dropped on Wednesday, with a tech selloff extending into a second day, while a key meeting of central bankers later this week remained in focus for currency and rates traders.The S&P 500 declined 0.5 per cent and the t…",
    "link": "https://www.channelnewsasia.com/business/wall-street-tech-selloff-deepens-european-shares-steady-5303721",
    "timestamp": "2025-08-20T14:50:48Z"
  },
  {
    "title": "Wall Street drops as tech selloff persists, European shares steady",
    "description": "MUMBAI :Shares on Wall Street dropped for a second successive day on Wednesday as weakness in the tech sector persisted while a key meeting of central bankers later this week remained in focus for currency and rates traders. The S&P 500 declined 0.8 per cent …",
    "link": "https://www.channelnewsasia.com/business/wall-street-drops-tech-selloff-persists-european-shares-steady-5303721",
    "timestamp": "2025-08-20T14:50:48Z"
  },
  {
    "title": "Russia sees potential in exporting LNG to India, says First Deputy PM Denis Manturov",
    "description": "Russia is exploring opportunities to export liquefied natural gas to India, according to First Deputy Prime Minister Denis Manturov. Manturov also expressed Russia's interest in expanding nuclear energy cooperation with India. This development follows the U.S…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/russia-sees-potential-in-exporting-lng-to-india-says-first-deputy-pm-denis-manturov/articleshow/123413240.cms",
    "timestamp": "2025-08-20T14:50:11Z"
  },
  {
    "title": "Monetary policy needs to remain watchful amid uncertainty on the external front, says RBI Governor Malhotra",
    "description": "In the August policy, the RBI’s six-member MPC unanimously voted to leave the policy repo rate unchanged at 5.5 per cent and maintain the policy stance as ‘neutral’.",
    "link": "https://indianexpress.com/article/business/economy/monetary-policy-needs-to-remain-watchful-rbi-governor-sanjay-malhotra-10201198/",
    "timestamp": "2025-08-20T14:49:47Z"
  },
  {
    "title": "Ukraine war: what an ‘article 5-style’ security guarantee might look like",
    "description": "UKraine’s allies are talking about security guarantees which would resemble protections given by the Nato treaty. So what does that mean?",
    "link": "https://theconversation.com/ukraine-war-what-an-article-5-style-security-guarantee-might-look-like-263475",
    "timestamp": "2025-08-20T14:49:27Z"
  },
  {
    "title": "The White House Is Beefing With a Musician Over ... Decor?",
    "description": "President Donald Trump is notoriously incapable of taking even petty criticisms in stride. The White House’s latest spat with The White Stripes’ Jack White does little to change that perception.On Tuesday, White posted a photo on Instagram of President Trump …",
    "link": "https://newrepublic.com/post/199323/donald-trump-white-house-white-stripes-jack-white-decor",
    "timestamp": "2025-08-20T14:49:11Z"
  },
  {
    "title": "Trump, Putin, And The Future Of Ukraine’s War",
    "description": "By Victor Davis Hanson, The Daily Signal | August 18, 2025\nHello, this is Victor Davis Hanson for The Daily Signal. President Donald Trump met Russian President Vladimir Putin last week for the much-anticipated summit, I guess we would call it, in Anchorage, …",
    "link": "https://biztoc.com/x/af8eec720a0e3ca4",
    "timestamp": "2025-08-20T14:49:04Z"
  },
  {
    "title": "FO° Talks: Iran Vows Stronger Response If Attacked Again By America, Israel",
    "description": "Fair Observer Founder’s Video Producer & Social Media Manager, Rohan Khattar Singh, talks with Steven Zunes, director of Middle Eastern Studies and professor of politics at the University of San Francisco. They analyze the US–Israel–Iran relationship and its …",
    "link": "https://www.fairobserver.com/world-news/middle-east-news/fo-talks-iran-vows-stronger-response-if-attacked-again-by-america-israel/",
    "timestamp": "2025-08-20T14:48:42Z"
  },
  {
    "title": "Many towns are unprepared to handle train derailments and hazmat spills",
    "description": "Train derailments involving spills of 1,000 gallons or more of hazardous materials happen a few times a year, often resulting in evacuations or fires",
    "link": "https://abcnews.go.com/Business/wireStory/towns-unprepared-handle-train-derailments-hazmat-spills-124811098",
    "timestamp": "2025-08-20T14:46:30Z"
  },
  {
    "title": "Just 35 complaints of debanking cite political bias despite Trump order",
    "description": "Less than one percent of customers who filed detailed complaints about checking or savings account closures with the U.S. Consumer Financial Protection Bureau over the last 13 years accused banks of acting for political or religious reasons, even as the White…",
    "link": "https://freerepublic.com/focus/f-news/4335635/posts",
    "timestamp": "2025-08-20T14:46:13Z"
  },
  {
    "title": "Al Jardine Rips Mike Love for Self-Indulgent Speech at Brian Wilson’s Funeral",
    "description": "\"Mike wanted everybody to know that he wrote every single word of 'Good Vibrations,'\" Jardine told Rolling Stone.\nAl Jardine Rips Mike Love for Self-Indulgent Speech at Brian Wilson’s Funeral\nEddie Fu",
    "link": "https://consequence.net/2025/08/al-jardine-mike-love-brian-wilson-funeral/",
    "timestamp": "2025-08-20T14:46:02Z"
  },
  {
    "title": "With black paint on border barriers, Trump and Noem are repeating a familiar mistake",
    "description": "The last time Donald Trump ordered officials to apply black paint to border wall barriers, it was an expensive failure. Naturally, he's trying it again.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/black-paint-border-barriers-trump-noem-are-repeating-familiar-mistake-rcna226052",
    "timestamp": "2025-08-20T14:45:27Z"
  },
  {
    "title": "'Seriously concerning' detail spotted in White House has people worried over Donald Trump running for third term",
    "description": "People spot 'seriously concerning' detail which suggests Donald Trump could be interested in running for a third term during summit with European leaders.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-white-house-four-more-years-hat-671915-20250820",
    "timestamp": "2025-08-20T14:45:21Z"
  },
  {
    "title": "ICEing the U.S. Economy (Paul Krugman)",
    "description": "Paul Krugman:\nICEing the U.S. Economy  —  Mass deportations will hurt more than people realize  —  Donald Trump has been able to convert Immigration and Customs Enforcement (and Customs and Border Protection, which is effectively part of the same operation) i…",
    "link": "https://www.memeorandum.com/250820/p54",
    "timestamp": "2025-08-20T14:45:02Z"
  },
  {
    "title": "Why International Recognition of a Palestinian State Actually Matters",
    "description": "International recognition of a Palestinian state isn’t just symbolic.",
    "link": "https://www.theatlantic.com/international/archive/2025/08/palestinian-state-west-recognition/683930/",
    "timestamp": "2025-08-20T14:45:00Z"
  },
  {
    "title": "'WTF are you guys doing?' DOJ exposes 'black and white evidence' that Biden admin knew autopenned pardons were legally flawed",
    "description": "The Oversight Project obtained damning internal emails this week from the Justice Department revealing a high-level understanding in the Biden administration that the autopenned commutations issued on Jan. 17 in the former president's name were legally flawed…",
    "link": "https://www.theblaze.com/news/wtf-are-you-guys-doing-doj-exposes-black-and-white-evidence-biden-admin-knew-autopenned-pardons-were-legally-flawed",
    "timestamp": "2025-08-20T14:44:46Z"
  },
  {
    "title": "Trump Wants To Paint Border Wall Black So It’s Too Hot To Touch",
    "description": "Homeland Security Secretary Kristi Noem applied paint herself to a small section of a fence.",
    "link": "https://littlethings.com/entertainment/trump-wants-to-paint-border-wall-black-so-its-too-hot-to-touch",
    "timestamp": "2025-08-20T14:43:36Z"
  },
  {
    "title": "Russia says must be part of Ukraine security guarantees talks",
    "description": "Russia's foreign minister downplayed the meeting between Trump and European leaders, describing it as a \"clumsy\" attempt to change the US president's position on Ukraine",
    "link": "https://www.euractiv.com/section/politics/news/russia-says-must-be-part-of-ukraine-security-guarantees-talks/",
    "timestamp": "2025-08-20T14:43:34Z"
  },
  {
    "title": "Keeping the Transatlantic Relationship Alive",
    "description": "Despite heightened transatlantic tensions, European leaders need to focus on the long term. By articulating exactly what it will take to keep America as a long-term, reliable partner in defense, and then to hold it to its commitments, they can set the stage f…",
    "link": "https://www.project-syndicate.org/commentary/europe-nato-how-to-manage-trump-by-jim-o-brien-2025-08",
    "timestamp": "2025-08-20T14:42:41Z"
  },
  {
    "title": "Migrants Who ‘Despise’ US To Be Denied Benefits Under New Trump Admin Policy",
    "description": "The Trump administration is making it much more difficult for foreign nationals who display anti-American behavior to live and work in the United States.",
    "link": "https://dailycaller.com/2025/08/20/anti-american-migrants-denied-benefits/",
    "timestamp": "2025-08-20T14:41:59Z"
  },
  {
    "title": "National suicide hotline for LGBTQ+ youth went dead. Colorado and other states are scrambling to help.",
    "description": "Colorado contracts with Solari Crisis & Human Services to answer 988 calls, and that the training had already been equipping call-takers on the general line to support LGBTQ+ young people.",
    "link": "https://www.denverpost.com/2025/08/20/988-suicide-hotline-lgbtq-youth/",
    "timestamp": "2025-08-20T14:41:02Z"
  },
  {
    "title": "New Schiff leak claim from whistleblower echoes years of similar accusations",
    "description": "Sen. Adam Schiff has repeatedly shut down claims he leaked classified information, including in August when the Trump admin released Democratic whistleblower testimony.",
    "link": "https://www.foxnews.com/politics/new-schiff-leak-claim-from-whistleblower-echoes-years-similar-accusations",
    "timestamp": "2025-08-20T14:40:03Z"
  },
  {
    "title": "Musk shoots down WSJ claim he’s abandoned his political party plans",
    "description": "Elon Musk has rejected a WSJ report that he has paused his America Party plans, taking aim at the outlet’s reporting Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623330-musk-wsj-party-claims/",
    "timestamp": "2025-08-20T14:39:32Z"
  },
  {
    "title": "Damning Texts Show Just How Obsessed Jeanine Pirro Is With Trump",
    "description": "Interim U.S. Attorney for the District of Columbia Jeanine Pirro once bragged about helping out President Donald Trump and the Republican Party as a Fox News host, according to newly unredacted court documents in Smartmatic’s $2.7 billion defamation lawsuit a…",
    "link": "https://newrepublic.com/post/199343/donald-trump-2020-fox-news-smartmatic-jeanine-pirro",
    "timestamp": "2025-08-20T14:39:15Z"
  },
  {
    "title": "Intel in talks with large investors for equity boost at discount, CNBC reports",
    "description": "The new funding would be another financial lifeline for Intel, as billions of dollars in investment to expand its contract manufacturing business, which is...",
    "link": "https://tech.yahoo.com/business/articles/intel-talks-large-investors-equity-143856674.html",
    "timestamp": "2025-08-20T14:38:56Z"
  },
  {
    "title": "What to know about Trump’s bid for the U.S. government to own a piece of Intel",
    "description": "The Trump administration is in talks to secure a 10% stake in Intel in exchange for converting government grants that were pledged to Intel under President Joe Biden.",
    "link": "https://www.pbs.org/newshour/politics/what-to-know-about-trumps-bid-for-the-u-s-government-to-own-a-piece-of-intel",
    "timestamp": "2025-08-20T14:38:56Z"
  },
  {
    "title": "DC Residents' Anger at Fed Presence Grows as Poll Shows 'Overwhelming' Opposition to Trump Takeover",
    "description": "Residents of Washington, DC are getting increasingly fed up with US President Donald Trump's deployment of the National Guard and other federal law enforcement officials in their city.Zeteo journalist Prem Thakker reported on Tuesday that residents in Columbi…",
    "link": "https://www.commondreams.org/news/washington-dc-trump-poll",
    "timestamp": "2025-08-20T14:38:14Z"
  },
  {
    "title": "Trump wants Fed's Lisa Cook out over mortgage fraud claims",
    "description": "President Donald Trump on Wednesday morning demanded the resignation of Federal Reserve official Lisa Cook in his latest attack against the central bank.\nThe call for Cook's resignation came less than a day after Federal Housing Finance Agency director Bill P…",
    "link": "https://biztoc.com/x/798270adbb43ad91",
    "timestamp": "2025-08-20T14:38:04Z"
  },
  {
    "title": "Meet May Mailman, the lawyer leading Trump administration’s pursuit of universities",
    "description": "A 37-year old lawyer known for her “ruthless efficiency and engaging personality” is leading the Trump administration’s effort to “root out perceived liberal bias from colleges and deter the use of race in admissions,” according to a profile in the New York T…",
    "link": "https://www.abajournal.com/news/article/meet-may-mailman-the-lawyer-leading-trump-administrations-pursuit-of-universities",
    "timestamp": "2025-08-20T14:38:00Z"
  },
  {
    "title": "Kristi Noem Paints Border Wall Black",
    "description": "Democrats prefer the color black when it comes to race, but paint the border wall black to help keep out foreign invaders and they are not likely to be pleased: Homeland Security Secretary Kristi Noem announced Tuesday that the U.S.-Mexico border wall will be…",
    "link": "https://moonbattery.com/kristi-noem-paints-border-wall-black/",
    "timestamp": "2025-08-20T14:37:45Z"
  },
  {
    "title": "Trump Administration To Paint Border Wall Black To Deter Crossings",
    "description": "The Department of Homeland Security announced Tuesday that the southern border wall will be painted black to make it harder to climb in the heat, CNN reported. \nDHS Secretary Kristi Noem said the decision came at the request of President Donald Trump, who arg…",
    "link": "https://biztoc.com/x/aa9419b21ac40854",
    "timestamp": "2025-08-20T14:37:25Z"
  },
  {
    "title": "‘The Days of Stupidity Are Over in the USA!’ New Trump Tirade Takes Aim at Longtime Nemesis",
    "description": "Trump blasted wind and solar as a “scam” causing record energy costs — but data show renewables often slow price hikes and cut consumer bills.\nThe post ‘The Days of Stupidity Are Over in the USA!’ New Trump Tirade Takes Aim at Longtime Nemesis first appeared …",
    "link": "https://www.mediaite.com/opinion/the-days-of-stupidity-are-over-in-the-usa-new-trump-tirade-takes-aim-at-longtime-nemesis/",
    "timestamp": "2025-08-20T14:36:08Z"
  },
  {
    "title": "‘South Park’ Targets Trump’s D.C. Police Takeover In New Episode",
    "description": "Towelie, a recurring “South Park” character, returns for the series’ upcoming episode and takes a trip to Washington, D.C., where U.S. Army troops are stationed.",
    "link": "https://www.forbes.com/sites/conormurray/2025/08/20/south-park-targets-trumps-dc-police-takeover-in-new-episode/",
    "timestamp": "2025-08-20T14:34:53Z"
  },
  {
    "title": "Trump Calls Netanyahu A ‘War Hero,’ Adds: ‘I Guess I Am Too’",
    "description": "The president, who avoided the Vietnam War draft after being diagnosed with “bone spurs,” repeated a claim that he’s “settled six wars.”",
    "link": "https://www.huffpost.com/entry/trump-war-hero-israel-iran_n_68a5bfd3e4b08e59891e7473",
    "timestamp": "2025-08-20T14:33:50Z"
  },
  {
    "title": "'It's problematic': Columnist highlights 'glaring reason' Trump's plan falls on its face",
    "description": "A columnist noted the irony of President Donald Trump demanding immigrants ace a \"moral fitness\" test that he likely couldn't pass himself.The U.S. Citizenship and Immigration Services announced that agents would focus primarily on the “good moral character” …",
    "link": "https://www.rawstory.com/trump-good-moral-character/",
    "timestamp": "2025-08-20T14:32:57Z"
  },
  {
    "title": "Intel in talks with other large investors for equity boost at discount, sources say",
    "description": "It comes after SoftBank announced it would invest $2 billion in the struggling chipmaker.",
    "link": "https://www.cnbc.com/2025/08/20/intel-investors-equity-softbank-trump.html",
    "timestamp": "2025-08-20T14:29:24Z"
  },
  {
    "title": "‘Certainly Not!’ Joe Rogan Bludgeons Trump Claim That Epstein Story Is a ‘Hoax’",
    "description": "Joe Rogan, on his Monday podcast, obliterated President Donald Trump's claim that the Jeffrey Epstein story is a Democratic-driven hoax.\nThe post ‘Certainly Not!’ Joe Rogan Bludgeons Trump Claim That Epstein Story Is a ‘Hoax’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/certainly-not-joe-rogan-bludgeons-trump-claim-that-epstein-story-is-a-hoax/",
    "timestamp": "2025-08-20T14:28:39Z"
  },
  {
    "title": "Russia 'almost immediately' offers concessions in Trump-Putin Alaska talks",
    "description": "Witkoff noted that these concessions were partly achieved because the U.S. side tested Russia’s willingness to adopt a more flexible stance. Trump and his team focused on securing a long-term peace agreement rather than a temporary ceasefire during the Anchor…",
    "link": "https://freerepublic.com/focus/f-news/4335634/posts",
    "timestamp": "2025-08-20T14:27:39Z"
  },
  {
    "title": "Ohio Governor Sending National Guard to Assist In Fighting Crime In DC",
    "description": "By Rebecca Downs, The Daily Signal | August 18, 2025\nPresident Donald Trump and Attorney General Pam Bondi are on a mission to curb crime in the nation’s capital, and it turns out they’re getting an assist from Republican governors. Ohio Gov. Mike DeWine is a…",
    "link": "https://biztoc.com/x/5bac56b5a9103183",
    "timestamp": "2025-08-20T14:26:54Z"
  },
  {
    "title": "Trump White House Joins TikTok As Ban Deadline Looms; “I Am Your Voice,” POTUS Tells Followers",
    "description": "The White House has launched a TikTok account, even as the app’s Chinese parent company faces a deadline next month to divest the social media platform. The account debuted on Tuesday and is up to almost 122,000 followers. That is a fraction of the more than …",
    "link": "http://deadline.com/2025/08/trump-white-house-tiktok-1236493001/",
    "timestamp": "2025-08-20T14:26:36Z"
  },
  {
    "title": "It Sure Looks Like Trump Is in the Epstein Files, Robert Garcia Says",
    "description": "Donald Trump is not cleared of wrongdoing in relation to the Epstein files, according to House Oversight Ranking Member Robert Garcia.Speaking on former Attorney General Bill Barr’s testimony before the Oversight Committee Tuesday, Garcia contradicted Oversig…",
    "link": "https://newrepublic.com/post/199340/donald-trump-epstein-files-bill-barr-testimony",
    "timestamp": "2025-08-20T14:25:48Z"
  },
  {
    "title": "Trump Calls For Fed Governor To Resign, Widening Pressure On Central Bank...",
    "description": "Trump Calls For Fed Governor To Resign, Widening Pressure On Central Bank...\r\n\n \n \n \n (Second column, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Snaps up more than $100 million in bonds while in office...\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!  …",
    "link": "https://www.barrons.com/articles/trump-calls-for-fed-governor-to-resign-widening-pressure-on-central-bank-68bac838",
    "timestamp": "2025-08-20T14:25:46Z"
  },
  {
    "title": "Lisa Cook pressured to resign from her role as Fed governor as Trump cites mortgage fraud allegations",
    "description": "President Donald Trump on Wednesday called on a top policymaker at the Federal Reserve to resign, after one of his allies alleged that she committed mortgage fraud.",
    "link": "https://www.cnn.com/2025/08/20/economy/trump-pushes-for-fed-governor-lisa-cook-resignation",
    "timestamp": "2025-08-20T14:25:12Z"
  },
  {
    "title": "Corporate Media Dredge Up Deep State Fossils To Moan About How Trump Is Handling Ukraine-Russia Talks",
    "description": "Corporate media outlets have been bringing on former foreign policy officials to complain about how Donald Trump has been handling the Russia-Ukraine war.",
    "link": "https://dailycaller.com/2025/08/20/corporate-media-dredge-up-deep-state-fossils-trump-ukraine-russia-talks/",
    "timestamp": "2025-08-20T14:23:56Z"
  },
  {
    "title": "“As racist as always”: Martina Navratilova lashes at Donald Trump for attacking Smithsonian museums on slavery",
    "description": "Martina Navratilova swiftly condemned Donald Trump's criticism of the Smithsonian Institution's exhibits on slavery. Trump, in a Truth Social post, accused the museums of being overly focused on negative aspects of American history and labeled them \"woke.\" Na…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/as-racist-as-always-martina-navratilova-lashes-at-donald-trump-for-attacking-smithsonian-museums-on-slavery/articleshow/123412828.cms",
    "timestamp": "2025-08-20T14:22:59Z"
  },
  {
    "title": "Trump demands Fed's Cook resign after housing official calls for 'mortgage fraud' probe",
    "description": "Trump has targeted the Federal Reserve and its chairman, Jerome Powell, as he pressures the central bank to slash interest rates.",
    "link": "https://www.cnbc.com/2025/08/20/trump-fed-cook-pulte-mortgage-bondi.html",
    "timestamp": "2025-08-20T14:21:07Z"
  },
  {
    "title": "Trump Shows Off DJ Skillz on New White House Patio — With Umbrellas ‘Literally From Mar-a-Lago’",
    "description": "Trump's press pool was treated to a demonstration of his DJ skills on the new White House patio — which boasts umbrellas \"literally\" flown in from Mar-a-Lago.\nThe post Trump Shows Off DJ Skillz on New White House Patio — With Umbrellas ‘Literally From Mar-a-L…",
    "link": "https://www.mediaite.com/media/news/trump-shows-off-dj-skillz-on-new-white-house-patio-with-umbrellas-literally-from-mar-a-lago/",
    "timestamp": "2025-08-20T14:20:48Z"
  },
  {
    "title": "Karoline Leavitt Melts Down Over Trump's Failed Putin Sumitt",
    "description": "White House press secretary Karoline Levitt vilified the press and foreign policy experts for taking a negative outlook on Donald Trump's Alaska Summit with Vladimir Putin.\nTo all credible observers the summit was a black guy for America, an embarrasment for …",
    "link": "https://crooksandliars.com/2025/08/karoline-leavitt-melts-down-over-trumps",
    "timestamp": "2025-08-20T14:20:41Z"
  },
  {
    "title": "Trump's tariff shadow loomed over monetary policy decision in August, minutes show",
    "description": "Uncertainty about tariffs forced the six-member panel to unanimously vote for a status quo on interest rates, despite a benign inflation, showed minutes.",
    "link": "https://www.livemint.com/industry/trumps-tariff-shadow-loomed-large-over-monetary-policy-committee-decision-in-august-minutes-show-inflation-11755696310651.html",
    "timestamp": "2025-08-20T14:20:07Z"
  },
  {
    "title": "Paint it black: Feds recolor border wall to make it scorching to touch",
    "description": "The president understands hot temperatures 'will make it even harder for people to climb'",
    "link": "https://www.wnd.com/2025/08/paint-it-black-feds-recolor-border-wall-make/",
    "timestamp": "2025-08-20T14:17:09Z"
  },
  {
    "title": "As Target Names New CEO, Stock Tumbles 10% As DEI Hit And Tariffs Drag On Sales",
    "description": "As Target announces a new CEO, the retailer is reporting declines in revenue and operating income. As shares tumble 10% their DEI pullback & tariffs are dragging on sales",
    "link": "https://www.forbes.com/sites/dougmelville/2025/08/20/as-target-names-new-ceo-stock-tumbles-10-as-dei-hit-and-tariffs-drag-on-sales/",
    "timestamp": "2025-08-20T14:16:49Z"
  },
  {
    "title": "'Scam of the century!' Trump rages against 'windmills' as admin panics over energy costs",
    "description": "President Donald Trump fired off Wednesday against “windmills” and “solar” as being the “scam of the century” following reports of skyrocketing energy prices, reports that have left at least one Trump administration official worried about the upcoming midterm…",
    "link": "https://www.rawstory.com/trump-2673904514/",
    "timestamp": "2025-08-20T14:16:34Z"
  },
  {
    "title": "Russia's foreign minister derides 'clumsy' Western efforts on Ukraine war as NATO meets",
    "description": "Russia said Wednesday attempts to resolve security issues relating to Ukraine without Moscow's participation were a \"road to nowhere,\" and that much diplomatic work needs to be done before Vladimir Putin and Volodymyr Zelenskyy are ever in the same room.",
    "link": "https://www.cbc.ca/news/world/russia-lavrov-ukraine-war-nato-1.7613419",
    "timestamp": "2025-08-20T14:16:20Z"
  },
  {
    "title": "What's Surya? IBM-NASA 'AI Telescope' That Will Predict Solar Weather",
    "description": "The National Aeronautics and Space Administration, in a collaboration with the International Business Machines Corp., have launched, 'Surya', an \"AI telescope for the sun\" to track solar weather better with a 16% more accuracy than previous systems. The name …",
    "link": "https://www.ndtvprofit.com/science/technology-artificial-intelligence-space-ibm-nasa-ai-model-surya-sun-solar-weather-prediction",
    "timestamp": "2025-08-20T14:16:03Z"
  },
  {
    "title": "US Ally Sends American-made Drone to Patrol China-Claimed Waters",
    "description": "The SeaGuardian drone can provide persistent maritime domain awareness, capable of flying continuously for over 30 hours.",
    "link": "https://www.newsweek.com/japan-sends-american-made-drone-patrol-china-claimed-waters-2116225",
    "timestamp": "2025-08-20T14:15:57Z"
  },
  {
    "title": "NATO defense chiefs to hold a virtual meeting on security guarantees for Ukraine",
    "description": "Italian Admiral Giuseppe Cavo Dragone said on Wednesday 32 defense chiefs are participating in the talks",
    "link": "https://www.bostonherald.com/2025/08/20/nato-defense-chiefs-ukraine-guarantees/",
    "timestamp": "2025-08-20T14:15:57Z"
  },
  {
    "title": "Trump bought more than $100 million in bonds since January",
    "description": "President Donald Trump has purchased at least $103 million worth of corporate and municipal bonds since taking office in January, according to new filings from the Office of Government Ethics.\nThe documents, released late Tuesday night, show that Trump began …",
    "link": "https://biztoc.com/x/7f61c28e48ade92b",
    "timestamp": "2025-08-20T14:15:52Z"
  },
  {
    "title": "Comedian Tim Dillon Loses It Over Trump’s DC Crackdown: ‘This Is Everything Alex Jones Always Talked About’",
    "description": "Comedian Tim Dillon trashed President Donald Trump's recent attempts to curb crime in Washington, D.C., calling it a \"fascist kind of wet dream.\"\nThe post Comedian Tim Dillon Loses It Over Trump’s DC Crackdown: ‘This Is Everything Alex Jones Always Talked Abo…",
    "link": "https://www.mediaite.com/media/podcasts/comedian-tim-dillon-loses-it-over-trumps-dc-crackdown-this-is-everything-alex-jones-always-talked-about/",
    "timestamp": "2025-08-20T14:15:43Z"
  },
  {
    "title": "Trump slams states relying on wind, solar energy",
    "description": "United States President Donald Trump expressed his disapproval of renewable energy projects in a Truth Social post on Wednesday. \"Any State that has built and relied on WINDMILLS and SOLAR for power a...",
    "link": "https://biztoc.com/x/58077401fe7e7531",
    "timestamp": "2025-08-20T14:15:37Z"
  },
  {
    "title": "Trump may want lower interest rates for consumers, but it sure is convenient for the national debt he’s creating, too",
    "description": "Donald Trump has escalated attacks on Jerome Powell, blaming high rates for freezing the housing market and urging the Fed to deliver cuts. While Trump frames the issue as consumer pain, Wharton’s Joao Gomes told Fortune that cheaper borrowing would also ease…",
    "link": "https://biztoc.com/x/e53f98d0b3d1b15d",
    "timestamp": "2025-08-20T14:15:31Z"
  },
  {
    "title": "Trump’s ambiguity is the worst of all worlds - Financial Times",
    "description": "Trump’s ambiguity is the worst of all worldsFinancial Times How Europe Learned to Speak So Trump Would ListenThe New York Times Why Trump deserves credit for his Ukraine push — and why it may all fall apartCNN Donald Trump is becoming the greatest unifier of …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178780280",
    "timestamp": "2025-08-20T14:15:31Z"
  },
  {
    "title": "Trump calls on a Fed governor to resign following mortgage fraud allegations",
    "description": "President Donald Trump said on Truth Social that Federal Reserve Governor Lisa Cook “must resign, now!!!”Trump’s comment came after the director of the U.S.",
    "link": "https://biztoc.com/x/e1d62b5113e684c6",
    "timestamp": "2025-08-20T14:15:26Z"
  },
  {
    "title": "Jonah Goldberg on the Real Reason He Left Fox News: Backing Trump ‘Requires You To Lie’",
    "description": "Conservative pundit Jonah Goldberg left Fox News over Tucker Carlson, landed at CNN, and remains a principled outlier in today’s pro-Trump media world.\nThe post Jonah Goldberg on the Real Reason He Left Fox News: Backing Trump ‘Requires You To Lie’ first appe…",
    "link": "https://www.mediaite.com/opinion/jonah-goldberg-on-the-real-reason-he-left-fox-news-backing-trump-requires-you-to-lie/",
    "timestamp": "2025-08-20T14:14:34Z"
  },
  {
    "title": "Lawrence O’Donnell Pinpoints the One Thing Trump Said About Putin After Meeting ‘That Wasn’t Crazy’ | Video",
    "description": "\"But it is something that everyone else has already been saying about Vladimir Putin,\" the MSNBC host marvels\nThe post Lawrence O’Donnell Pinpoints the One Thing Trump Said About Putin After Meeting ‘That Wasn’t Crazy’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/lawrence-odonnell-one-thing-trump-said-about-putin-not-crazy/",
    "timestamp": "2025-08-20T14:14:14Z"
  },
  {
    "title": "NATO scrambles warplanes as Russia hits near Romanian border in Ukraine",
    "description": "NATO aircraft scrambled from Romania following a large-scale Russian attack on across Ukraine overnight, including in the Odesa region near Danube River border with allied nation.",
    "link": "https://www.foxnews.com/world/nato-scrambles-warplanes-russia-hits-near-romanian-border-ukraine",
    "timestamp": "2025-08-20T14:14:11Z"
  },
  {
    "title": "Federal Reserve's Cook says \"no intention of being bullied to step down\"",
    "description": "WASHINGTON:  Federal Reserve Governor Lisa Cook said on Wednesday (Aug 20) she had \"no intention of being bullied to step down\" from her role at the central bank, amid calls from US President Donald Trump to do so, according to a statement a Fox Business repo…",
    "link": "https://www.channelnewsasia.com/world/federal-reserves-cook-says-no-intention-being-bullied-step-down-5305041",
    "timestamp": "2025-08-20T14:14:00Z"
  },
  {
    "title": "Texas House to vote on controversial redistricting plan",
    "description": "State Democrats have indicated they plan on fighting the bill from the floor.",
    "link": "https://abcnews.go.com/Politics/texas-house-vote-controversial-redistricting-plan/story?id=124807364",
    "timestamp": "2025-08-20T14:12:47Z"
  },
  {
    "title": "Trump buys more than $100 million in bonds in office, disclosure shows",
    "description": "Donald Trump's recent disclosures reveal over $100 million in bond purchases since assuming office. The filings, submitted to the U.S. Office of Government Ethics, detail more than 600 transactions, including corporate bonds from Citigroup, Morgan Stanley, We…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-buys-more-than-100-million-in-bonds-in-office-disclosure-shows/articleshow/123412681.cms",
    "timestamp": "2025-08-20T14:12:47Z"
  },
  {
    "title": "California Dems Prefer Gavin Newsom Over Kamala Harris For 2028: POLL",
    "description": "California Democrats prefer Gavin Newsom over Kamala Harris in a 2028 presidential primary matchup, a Politico-Citrin Center-Possibility Lab poll found.",
    "link": "https://dailycaller.com/2025/08/20/california-democrats-gavin-newsom-kamala-harris/",
    "timestamp": "2025-08-20T14:12:39Z"
  },
  {
    "title": "Russia Says Must Be Part Of Ukraine Security Guarantees Talks",
    "description": "Russia said on Wednesday it had to be part of any discussion on security guarantees for Ukraine and downplayed the likelihood of an imminent summit with President Volodymyr Zelensky, tempering hopes for a quick peace deal.",
    "link": "https://www.ibtimes.com/russia-says-must-part-ukraine-security-guarantees-talks-3781289",
    "timestamp": "2025-08-20T14:12:06Z"
  },
  {
    "title": "Putin gifts random Alaskan man a $22,000 motorcycle and he has no idea why",
    "description": "Mark Warren found it 'so strange' when the fancy new motorcycle arrived from the Russians",
    "link": "https://www.ladbible.com/news/world-news/putin-alaska-anchorage-gift-ural-motorcycle-725848-20250820",
    "timestamp": "2025-08-20T14:12:00Z"
  },
  {
    "title": "Judicial Smackdown: Judge Boasberg vs. the Constitution",
    "description": "It’s a tale fit for a thriller novel or action movie: planes on the tarmac waiting to take members of a violent gang to a foreign... Read More\nThe post Judicial Smackdown: Judge Boasberg vs. the Constitution appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/20/judicial-smackdown-judge-boasberg-vs-constitution/",
    "timestamp": "2025-08-20T14:09:27Z"
  },
  {
    "title": "Trump exposed this startling truth — and it got America steamrolled",
    "description": "I don’t know why, but few are saying what’s plainly obvious about the president’s “summit” with his Russian counterpart. He’s afraid of him.Donald Trump made all kinds of noise about “severe consequences\r\n” that Vladimir Putin would face if he did not agree t…",
    "link": "https://www.rawstory.com/raw-investigates/trump-putin-2673900650/",
    "timestamp": "2025-08-20T14:08:42Z"
  },
  {
    "title": "Why a top economist agrees with Trump that Powell is too late in cutting interest rates",
    "description": "The Fed made a \"huge mistake\" not raising rates during the pandemic. Now it risks another blunder, top economist Mohamed El-Erian says.",
    "link": "https://www.businessinsider.com/interest-rates-trump-powell-fed-too-late-mohamed-el-erian-2025-8",
    "timestamp": "2025-08-20T14:07:37Z"
  },
  {
    "title": "Rabid Leftist Arrested For Threatening To Kill Trump And Major Media Refuse To Cover It",
    "description": "The threat of homicide is more sobering considering Trump was twice nearly assassinated while campaigning and guarded by the Secret Service.",
    "link": "https://thefederalist.com/2025/08/20/leftist-arrested-for-threatening-to-assassinate-trump-and-the-media-is-not-all-over-it/",
    "timestamp": "2025-08-20T14:07:24Z"
  },
  {
    "title": "Rabid Leftist Arrested For Threatening To Assassinate Trump And The Media Is Not All Over It",
    "description": "The threat of homicide is more sobering considering Trump was twice nearly assassinated while campaigning and guarded by the Secret Service.",
    "link": "https://thefederalist.com/2025/08/20/rabid-leftist-arrested-for-threatening-to-assassinate-trump-and-the-media-is-not-all-over-it/",
    "timestamp": "2025-08-20T14:07:24Z"
  },
  {
    "title": "Russia says must be part of Ukraine security guarantees talks",
    "description": "Russia said on Wednesday it had to be part of any discussion on security guarantees for Ukraine and downplayed the likelihood of an imminent summit with President Volodymyr Zelensky, tempering hopes for a quick peace deal. NATO military chiefs were meanwhile …",
    "link": "https://www.digitaljournal.com/world/russia-says-must-be-part-of-ukraine-security-guarantees-talks/article",
    "timestamp": "2025-08-20T14:07:21Z"
  },
  {
    "title": "Official cause of death of cult leader who turned blue was eventually found mummified",
    "description": "Members of the 'Love Has Won' cult believed Amy Carlson's ill health was a result of her 'taking on all the pain of mankind' before her death in 2021.",
    "link": "https://www.ladbible.com/news/us-news/love-has-won-cult-leader-amy-carlson-cause-of-death-blue-skin-973864-20250820",
    "timestamp": "2025-08-20T14:06:52Z"
  },
  {
    "title": "Elon Musk halts plans for new political party, prioritizing business instead: report",
    "description": "Elon Musk's plan to launch the America Party has been shelved for now, as the tech billionaire focuses on businesses and maintaining ties to VP JD Vance, according to The Wall Street Journal.",
    "link": "https://www.foxnews.com/politics/elon-musk-halts-plans-new-political-party-prioritizing-business-instead-report",
    "timestamp": "2025-08-20T14:06:34Z"
  },
  {
    "title": "Top law enforcement agency offers cash awards for tips leading to DC arrests amid Trump's crime crackdown",
    "description": "Federal intervention in Washington DC leads to over 550 arrests and significant crime decreases, with 46% drop in robberies and 83% reduction in carjackings.",
    "link": "https://www.foxnews.com/politics/top-law-enforcement-agency-offers-cash-awards-tips-leading-dc-arrests-trumps-crime-crackdown",
    "timestamp": "2025-08-20T14:05:16Z"
  },
  {
    "title": "Star Wars’ Mark Hamill Reveals What Kept Him From Fleeing the US After Trump Victory",
    "description": "Star Wars actor Mark Hamill revealed he seriously considered fleeing the United States after President Donald Trump's victory in 2024.\nThe post Star Wars’ Mark Hamill Reveals What Kept Him From Fleeing the US After Trump Victory first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/entertainment/star-wars-mark-hamill-reveals-what-kept-him-from-fleeing-the-us-after-trump-victory/",
    "timestamp": "2025-08-20T14:05:12Z"
  },
  {
    "title": "Trump bought more than $100 million in bonds since January, filings show (Steve Kopack/NBC News)",
    "description": "Steve Kopack / NBC News:\nTrump bought more than $100 million in bonds since January, filings show  —  The purchases could let the president make money off companies and local entities that could be affected by his agenda.  —  President Donald Trump has purcha…",
    "link": "https://www.memeorandum.com/250820/p47",
    "timestamp": "2025-08-20T14:05:01Z"
  },
  {
    "title": "MSNBC calls Newsom's imitation of Trump \"embarrassing\" for Democratic Party",
    "description": "If you didn't know, Gavin Newsom and his social media team have been mocking Donald Trump online. For example: Well, MSNBC's Morning Joe is not having it.  HOLY CRAP! Gavin Newsom has just lost left-wing Morning Joe, who is calling his impersonation of Dona…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335632/posts",
    "timestamp": "2025-08-20T14:04:55Z"
  },
  {
    "title": "Trump buys more than $100 million in bonds in office, disclosure shows",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump has bought more than $100 million in company, state and municipal bonds since taking office in January, his...",
    "link": "https://www.yahoo.com/news/articles/trump-buys-more-100-million-140450574.html",
    "timestamp": "2025-08-20T14:04:50Z"
  },
  {
    "title": "Trump buys more than $100 million in bonds in office, disclosure shows",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump has bought more than $100 million in company, state and municipal bonds since taking office in January, his...",
    "link": "https://finance.yahoo.com/news/trump-buys-more-100-million-140450170.html",
    "timestamp": "2025-08-20T14:04:50Z"
  },
  {
    "title": "Charlie Kirk Says Trump Admin Should Forcefully Make Blue City Mayor Do ‘Bare Minimum’ To Comply With ICE",
    "description": "Charlie Kirk said on Wednesday that President Donald Trump should take legal action against Democrat Boston Mayor Michelle Wu.",
    "link": "https://dailycaller.com/2025/08/20/charlie-kirk-trump-michelle-wu-boston-ice-illegal-immigrants/",
    "timestamp": "2025-08-20T14:04:27Z"
  },
  {
    "title": "WATCH LIVE: Texas GOP poised to pass new congressional map",
    "description": "The vote follows prodding by President Donald Trump, eager to stave off a midterm defeat that would deprive his party of control of the House of Representatives, and weeks of delays after dozens of Texas Democratic state lawmakers fled the state in protest.",
    "link": "https://biztoc.com/x/7021029699a9302c",
    "timestamp": "2025-08-20T14:04:15Z"
  },
  {
    "title": "Trump calls for Fed governor's resignation as ally requests DOJ probe",
    "description": "President Donald Trump on Wednesday called for the resignation of a Federal Reserve governor after one of his allies submitted a referral requesting that she be investigated for mortgage fraud.\nFederal Housing and Finance Agency (FHFA) Director Bill Pulte on …",
    "link": "https://biztoc.com/x/92f39f74ab65ab9e",
    "timestamp": "2025-08-20T14:04:13Z"
  },
  {
    "title": "Zelenskyy’s speedrun of gratitude—nine thank yous in one minute—shows how foreign leaders talk to Trump",
    "description": "Ukrainian President Volodymyr Zelenskyy wasn’t going to risk being accused of being ungrateful this time.\nWith peace talks on the table and a chance to rebound from his disastrous White House scolding six months ago, Zelenskyy made sure to show his gratitude …",
    "link": "https://biztoc.com/x/0c3dfc16b10ff925",
    "timestamp": "2025-08-20T14:04:04Z"
  }
]