[
  {
    "title": "New ICE Data Exposes Trump’s Big Lie on Deportations",
    "description": "For the first time since the beginning of the government shutdown in October, Immigration and Customs Enforcement has published information about the thousands of immigrants detained in facilities across the country—and the new data is a doozy.President Donal…",
    "link": "https://newrepublic.com/post/203528/ice-data-donald-trump-deportations-criminal-record",
    "timestamp": "2025-11-21T19:43:26Z"
  },
  {
    "title": "How Larry Summers' Harvard class reacted to his co-instructor saying his 'insights and wisdom' will be missed",
    "description": "Former Treasury Secretary Larry Summers said he'd leave Harvard and withdraw from public life after his links to Jeffrey Epstein were made public.",
    "link": "https://www.businessinsider.com/larry-summers-jeffrey-epstein-harvard-university-students-react-2025-11",
    "timestamp": "2025-11-21T19:42:59Z"
  },
  {
    "title": "Affordability Wars",
    "description": "Vance offers conflicting explanations for high prices, as Trump, who has denied they’re high at all, meets with Mamdani, whose unlikely New York City win was fueled by the affordability crisis. \nThe post Affordability Wars appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/21/affordability-wars-trump-mamdani-vance/",
    "timestamp": "2025-11-21T19:41:29Z"
  },
  {
    "title": "How Yesterday’s Fiction Foretells Tomorrow’s Politics",
    "description": "From medieval Europe to the Trump era, life really does imitate art.",
    "link": "http://foreignpolicy.com/2025/11/21/political-fictions-patrick-boucheron-review-history-populism-trump/",
    "timestamp": "2025-11-21T19:40:11Z"
  },
  {
    "title": "Nigerian bishop calls for U.S. military intervention at congressional hearing",
    "description": "Bishop Wilfred Anagbe of the Nigerian Diocese of Makurdi in Benue state at a breakfast at Capitol Hill organized by Aid to the Church in Need, Jan. 30, 2024. / Credit: Peter Pinedo/CNA\n\nWashington, D.C. Newsroom, Nov 21, 2025 / 14:40 pm (CNA).\nA Nigerian Cath…",
    "link": "https://www.catholicnewsagency.com/news/268007/nigerian-bishop-calls-for-us-military-intervention-at-congressional-hearing",
    "timestamp": "2025-11-21T19:40:00Z"
  },
  {
    "title": "Security Council Shamefully Grants Colonial Domination Over Palestine to the US",
    "description": "A UN Special Rapporteur has decried the resolution as a violation of Palestinian people’s right to self-determination.",
    "link": "https://truthout.org/articles/security-council-shamefully-grants-colonial-domination-over-palestine-to-the-us/",
    "timestamp": "2025-11-21T19:39:37Z"
  },
  {
    "title": "JD Vance Shreds the Republican Party Pre-Trump as a ‘Disaster for the United States of America’",
    "description": "\"I'm glad the president got us away from that Republican Party. It lost, but it was also a disaster for the United States of America\"\nThe post JD Vance Shreds the Republican Party Pre-Trump as a ‘Disaster for the United States of America’ first appeared on Me…",
    "link": "https://www.mediaite.com/politics/jd-vance-shreds-the-republican-party-pre-trump-as-a-disaster-for-the-united-states-of-america/",
    "timestamp": "2025-11-21T19:38:54Z"
  },
  {
    "title": "Merz: Good call with Trump on Ukraine plan",
    "description": "German Chancellor Friedrich Merz announced on X on Friday that he has aligned on \"next steps\" for a Ukraine peace framework following a private call with the United States President Donald Trump.\"I ju...",
    "link": "https://biztoc.com/x/e958befd9dac94c3",
    "timestamp": "2025-11-21T19:38:50Z"
  },
  {
    "title": "After calling Mamdani a ‘100% Communist lunatic,’ Trump now says ‘we’re looking for the same things’",
    "description": "The Republican president and new Democratic star have indicated an openness to come together for the city they've both called home.",
    "link": "https://fortune.com/2025/11/21/trump-mamdani-meeting-says-civil-new-york-affordable/",
    "timestamp": "2025-11-21T19:38:44Z"
  },
  {
    "title": "The News Roundup For November 21, 2025",
    "description": "Congress voted overwhelmingly to authorize the release of the Epstein files. President Donald Trump welcomed the decision, <a href=\"https://apnews.com/article/donald-trump-jeffrey-epstein-justice-department-4872c23a3ed03bf3d4c526581d3aed59\"target=\"_blank\"   >…",
    "link": "https://www.npr.org/2025/11/21/nx-s1-5616545/the-news-roundup-for-november-21-2025",
    "timestamp": "2025-11-21T19:38:07Z"
  },
  {
    "title": "Why Trump's tariff rollback won't lower grocery prices right away",
    "description": "President Donald Trump is rolling back tariffs on some imported food items, but that won't lower prices at the grocery store right away.",
    "link": "https://www.cnbc.com/2025/11/21/food-inflation-price-trump-tariffs.html",
    "timestamp": "2025-11-21T19:35:01Z"
  },
  {
    "title": "‘Classic Donald Trump!’ Fox News’ Hugh Hewitt Praises Trump for Wild Execution Rant",
    "description": "Fox News' Hugh Hewitt praised President Donald Trump for his wild Truth Social rant on Thursday, deeming it \"classic Donald Trump.\"\nThe post ‘Classic Donald Trump!’ Fox News’ Hugh Hewitt Praises Trump for Wild Execution Rant first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/classic-donald-trump-fox-news-hugh-hewitt-praises-trump-for-wild-execution-rant/",
    "timestamp": "2025-11-21T19:34:13Z"
  },
  {
    "title": "House Democrats Call Capitol Police in Response to Trump's 'Seditious Behavior' Allegation",
    "description": "Democratic House leadership announced they contacted Capitol Police in response to President Donald Trump's social media posts.",
    "link": "https://www.westernjournal.com/house-democrats-call-capitol-police-response-trumps-seditious-behavior-allegation/",
    "timestamp": "2025-11-21T19:30:56Z"
  },
  {
    "title": "Donald Trump Says He Wasn't Threatening 'Seditious' Politicians With Death",
    "description": "President Donald Trump is now insisting he didn't threaten any members of Congress with death ... but, he does think they're in hot water. The 47th president discussed his controversial comments in an interview with Fox News host Brian Kilmeade…\n Permalink",
    "link": "https://www.tmz.com/2025/11/21/donald-trump-says-not-threaten-congress-death/",
    "timestamp": "2025-11-21T19:30:13Z"
  },
  {
    "title": "UFC legend wants Topuria vs Makhachev at the White House",
    "description": "More and more people are jumping on the bandwagon of a possible showdown between Ilia Topuria and Islam Makhachev. &apos;El Matador&apos; became UFC lightweight champion last June",
    "link": "https://www.marca.com/en/ufc/2025/11/21/6920bb7d46163ffe608b45c0.html",
    "timestamp": "2025-11-21T19:29:22Z"
  },
  {
    "title": "BBC board member Banerji quits after Trump scandal",
    "description": "BBC board member Shumeet Banerji resigned on Friday as the UK broadcaster continues to deal with the aftermath of a botched US President Donald Trump edit.He claimed that he was not consulted during t...",
    "link": "https://biztoc.com/x/709f5f0363c143f7",
    "timestamp": "2025-11-21T19:27:23Z"
  },
  {
    "title": "The 2 men fueling Sudan’s civil war",
    "description": "President Donald Trump announced that the US would intervene to end the civil war in Sudan. This promise came at the request of the Saudi crown prince Mohammed bin Salman. The conflict in Sudan — which has been marked by serious human rights abuses by both si…",
    "link": "https://www.vox.com/podcasts/469982/sudan-civil-war-genocide-famine-generals",
    "timestamp": "2025-11-21T19:27:22Z"
  },
  {
    "title": "U.S. Rep. Eric Swalwell is running for California governor",
    "description": "Rep. Eric Swalwell, a Democrat who served as a House manager in President Donald Trump’s 2021 impeachment trial, has launched his bid for California governor.",
    "link": "https://www.pbs.org/newshour/politics/u-s-rep-eric-swalwell-is-running-for-california-governor",
    "timestamp": "2025-11-21T19:25:17Z"
  },
  {
    "title": "Kashoggi’s widow and Democrats demand release of a call transcript with Trump and Saudi crown prince",
    "description": "It is unlikely that the Trump administration would voluntarily release the 2019 call transcript.",
    "link": "https://www.bostonherald.com/2025/11/21/trump-saudi-arabia-congress/",
    "timestamp": "2025-11-21T19:24:29Z"
  },
  {
    "title": "Kashoggi’s widow and Democrats demand release of a call transcript with Trump and Saudi crown prince",
    "description": "It is unlikely that the Trump administration would voluntarily release the 2019 call transcript.",
    "link": "https://www.denverpost.com/2025/11/21/trump-saudi-arabia-congress/",
    "timestamp": "2025-11-21T19:24:29Z"
  },
  {
    "title": "Ukraine facing ‘one of most difficult moments’ as Trump sets Thanksgiving deadline for peace plan",
    "description": "Kremlin quietly welcomes US proposals that would meet many of Russia’s war aims",
    "link": "https://www.irishtimes.com/world/europe/2025/11/21/ukraine-facing-one-of-most-difficult-moments-as-trump-sets-thanksgiving-deadline-for-peace-plan/",
    "timestamp": "2025-11-21T19:22:27Z"
  },
  {
    "title": "‘Hundreds of death threats’: Violent woman who attacked influencer sued after Alvin Bragg fails to prosecute",
    "description": "Manhattan DA 'has shown to people, with letting this case be dropped, … that they can go assault somebody and hurt them if they disagree with them and nothing is going to happen'",
    "link": "https://www.wnd.com/2025/11/hundreds-death-threats-violent-woman-who-attacked-influencer/",
    "timestamp": "2025-11-21T19:19:23Z"
  },
  {
    "title": "Hulk Hogan's son teases wrestling career after snapping selfie outside ring: 'You never know'",
    "description": "Nick Hogan hinted at a wrestling career months after his father Hulk Hogan’s death, saying the sport “makes me feel so much closer to Dad.\"",
    "link": "https://www.foxnews.com/sports/hulk-hogans-son-teases-wrestling-career-after-snapping-selfie-outside-ring-you-never-know",
    "timestamp": "2025-11-21T19:18:12Z"
  },
  {
    "title": "Trump Transportation Department’s Deregulation Blitz Puts Public Safety at Risk",
    "description": "Overseeing the rollback are dozens of political appointees who previously worked for industries regulated by the agency.",
    "link": "https://www.propublica.org/article/trump-dot-regulation-safety-rollback-sean-duffy",
    "timestamp": "2025-11-21T19:16:48Z"
  },
  {
    "title": "‘In the old days, it was death’: Trump rages again against Democratic military veterans",
    "description": "Even among those who’ve come to expect the worst from Donald Trump, his threatening rhetoric toward six Democratic members of Congress was extraordinary. On Tuesday, the Democrats, each of whom served in the military, the intelligence community or both, appea…",
    "link": "https://biztoc.com/x/2d56d1aa5e74a22e",
    "timestamp": "2025-11-21T19:16:36Z"
  },
  {
    "title": "Trump Is Confused by Zohran Mamdani’s Viral Election Night Warning",
    "description": "President Trump had some words for New York City Mayor-elect Zohran Mamdani ahead of their Friday afternoon meeting at the White House.“Well, I was hitting him a little hard too, in all fairness. I don’t know exactly what he means by ‘turn the volume up,’ bec…",
    "link": "https://newrepublic.com/post/203532/trump-confused-zohran-mamdani-viral-election-night-warning",
    "timestamp": "2025-11-21T19:14:43Z"
  },
  {
    "title": "Trump Says Democratic Lawmakers Should Die For Telling The Military To Obey Their Oath",
    "description": "The President of the United States is calling for the execution of six Democratic lawmakers—all military veterans or former intelligence officers—because they reminded US service members of their oath to the Constitution. Thats not hyperbole or exaggeration. …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180170395",
    "timestamp": "2025-11-21T19:12:59Z"
  },
  {
    "title": "Oakland's new mayor Barbara Lee fights high crime and tells federal law enforcement to stay away",
    "description": "Barbara Lee has been Oakland’s mayor for half a year",
    "link": "https://abcnews.go.com/US/wireStory/oaklands-new-mayor-barbara-lee-fights-high-crime-127761417",
    "timestamp": "2025-11-21T19:10:59Z"
  },
  {
    "title": "Fugees rapper Pras Michel sentenced to 14 years in billion-dollar scam",
    "description": "Fugees rapper Pras Michel was sentenced to 14 years in prison for his role in a billion-dollar Malaysian scam and illegal campaign contributions.\n\nRead More: https://punchng.com/fugees-rapper-pras-michel-sentenced-to-14-years-in-billion-dollar-scam/",
    "link": "https://punchng.com/fugees-rapper-pras-michel-sentenced-to-14-years-in-billion-dollar-scam/",
    "timestamp": "2025-11-21T19:07:01Z"
  },
  {
    "title": "Trump Predicts He'll 'Get On Fine' With Zohran Mamdani At White House Meeting—Live Updates",
    "description": "Donald Trump is meeting with New York City Mayor-elect Zohran Mamdani in the Oval Office at 3 p.m. ET on Friday. Follow live.",
    "link": "https://biztoc.com/x/deca8a14b327dc58",
    "timestamp": "2025-11-21T19:05:42Z"
  },
  {
    "title": "White House Rips 'Communist' Mamdani Ahead of Trump Meeting",
    "description": "Donald Trump and New York City Mayor-elect Zohran Mamdani are set to meet at the White House on Friday, the president said in a social media post.\nThe meeting marks the first time the two leaders will come together to discuss how they can work with each other…",
    "link": "https://biztoc.com/x/722e173728885400",
    "timestamp": "2025-11-21T19:05:31Z"
  },
  {
    "title": "7 things to know about the Justice Department’s Epstein files",
    "description": "After months of rancor and recriminations, Congress has passed and President Donald Trump has signed legislation compelling the Justice Department to give the public everything it has on Jeffrey Epstein. Here’s a look at what’s expected to be made public, wha…",
    "link": "https://biztoc.com/x/1df94db8e7297ee3",
    "timestamp": "2025-11-21T19:05:21Z"
  },
  {
    "title": "MAGA Disarray And The Accumulated Debt Of Corruption (Brian Beutler/Off Message)",
    "description": "Brian Beutler / Off Message:\nMAGA Disarray And The Accumulated Debt Of Corruption  —  They'd bring America down rather than face accountability, but accountability is not optional.  —  Why did Republicans close ranks around Donald Trump in 2016, when they cou…",
    "link": "https://www.memeorandum.com/251121/p82",
    "timestamp": "2025-11-21T19:05:03Z"
  },
  {
    "title": "Trump Says Democratic Lawmakers Should Die For Telling The Military To Obey Their Oath",
    "description": "The President of the United States is calling for the execution of six Democratic lawmakers—all military veterans or former intelligence officers—because they reminded US service members of their oath to the Constitution. That’s not hyperbole or exaggeration.…",
    "link": "https://www.techdirt.com/2025/11/21/trump-says-democratic-lawmakers-should-die-for-telling-the-military-to-obey-their-oath/",
    "timestamp": "2025-11-21T19:04:15Z"
  },
  {
    "title": "Israeli airstrike on Palestinian refugee camp in Lebanon kills 13 young boys,",
    "description": "An Israeli airstrike on the Palestinian refugee camp of Ain al-Hilweh in Lebanon killed 13 people amid escalating Israeli bombardment across Lebanon, threatening the ceasefire with Hezbollah - which Israel has already broken dozens of times.",
    "link": "https://mondoweiss.net/2025/11/israeli-airstrike-on-palestinian-refugee-camp-in-lebanon-kills-13-young-boys/",
    "timestamp": "2025-11-21T19:03:55Z"
  },
  {
    "title": "Even Podcast Bros Are Wondering If Something Is Wrong With Trump’s ‘Brain’",
    "description": "“Do you think he’s getting dementia?” comedian Matt McCusker asked Shane Gillis on a recent episode of their manosphere-friendly podcast.",
    "link": "https://www.huffpost.com/entry/even-podcast-bros-are-wondering-if-something-is-wrong-with-trumps-brain_n_69209080e4b06c13afa49ce2",
    "timestamp": "2025-11-21T19:03:53Z"
  },
  {
    "title": "'Absurd Yet Predictable': US Close to Losing Measles Elimination Status Under RFK Jr.",
    "description": "US public health officials warned this week that the country is close to following Canada in losing its measles elimination status, a deadly and preventable setback many experts attribute to the vaccine-averse policies and practices of Health and Human Servic…",
    "link": "https://www.commondreams.org/news/rfk-measles-elimination",
    "timestamp": "2025-11-21T19:03:37Z"
  },
  {
    "title": "Why Comcast could go all out to buy Warner Bros. Discovery",
    "description": "Paramount, Comcast, and Netflix are battling over Warner Bros. Discovery. Comcast may be more motivated to make a deal than David Ellison's Paramount.",
    "link": "https://www.businessinsider.com/comcast-warner-bros-discovery-wbd-paramount-skydance-david-ellison-netflix-2025-11",
    "timestamp": "2025-11-21T19:03:20Z"
  },
  {
    "title": "Putin says U.S. plan for Ukraine could form the basis for a final peace settlement",
    "description": "The plan includes many of Russian President Vladimir Putin's demands. Ukraine's President Volodymyr Zelenskyy said Friday that his country is at \"truly one of the most difficult moments in our history.\"",
    "link": "https://www.npr.org/2025/11/21/g-s1-98791/ukraine-russia-war-us-peace-plan",
    "timestamp": "2025-11-21T19:02:44Z"
  },
  {
    "title": "BREAKING: Putin Says Trump's Thanksgiving Day Peace Proposal Could Finally End War in Ukraine",
    "description": "BREAKING: Putin Says Trump's Thanksgiving Day Peace Proposal Could Finally End War in Ukrainewesternjournal.com",
    "link": "https://www.westernjournal.com/breaking-putin-says-trumps-thanksgiving-day-peace-proposal-finally-end-war-ukraine/",
    "timestamp": "2025-11-21T19:02:14Z"
  },
  {
    "title": "Larry Donnelly: Is this the beginning of the end for Donald Trump?",
    "description": "Our columnist writes that the US President’s u-turn on releasing the Epstein files conveyed that he is losing control of former Republican allies.",
    "link": "https://www.thejournal.ie/readme/donald-trump-beginning-of-end-epstein-files-republicans-6880539-Nov2025/",
    "timestamp": "2025-11-21T19:00:32Z"
  },
  {
    "title": "Senator Chris Van Hollen on the Epstein Files, and the Leadership Crisis in Washington",
    "description": "The Maryland Democrat talks with David Remnick about Chuck Schumer’s leadership of a fractured party, and whether Van Hollen himself harbors presidential ambitions.",
    "link": "https://www.newyorker.com/podcast/the-new-yorker-radio-hour/senator-chris-van-hollen-on-the-epstein-files-and-the-leadership-crisis-in-washington",
    "timestamp": "2025-11-21T19:00:00Z"
  },
  {
    "title": "Why Is Leaving MAGA So Difficult?",
    "description": "Rich Logis was a MAGA warrior before he hung up his red hat, and founded the organization Leaving MAGA to help others do the same. He speaks with the New Yorker Radio Hour producer Adam Howard.",
    "link": "https://www.newyorker.com/podcast/the-new-yorker-radio-hour/why-is-leaving-maga-so-difficult",
    "timestamp": "2025-11-21T19:00:00Z"
  },
  {
    "title": "Mamdani Trump meeting time: When does New York Mayor-elect Zohran Mamdani meeting with U.S. President Donald Trump begin?",
    "description": "Trump Mamdani meeting: Both U.S. President Donald Trump and New York City Mayor-elect Zohran Mamdani hail from the Queens borough of New York City and both are masters of political theater -- but their styles couldn't be more different.",
    "link": "https://economictimes.indiatimes.com/news/international/us/mamdani-trump-meeting-time-when-does-new-york-mayor-elect-zohran-mamdani-meeting-with-u-s-donald-trump-begin/articleshow/125493485.cms",
    "timestamp": "2025-11-21T18:57:06Z"
  },
  {
    "title": "Democrats defend message to troops as Trump, officials suggest they be punished",
    "description": "Trump called them \"bad people\" who \"broke the law.\"",
    "link": "https://abcnews.go.com/Politics/democrats-defend-message-troops-trump-officials-suggest-punished/story?id=127751866",
    "timestamp": "2025-11-21T18:57:01Z"
  },
  {
    "title": "Wells Fargo Whistleblower on Sham Interviews Wins Right to Sue",
    "description": "A whistleblower who accused Wells Fargo & Co. of conducting sham interviews with minority job candidates will now be able to sue the bank over his firing.",
    "link": "https://www.livemint.com/companies/news/wells-fargo-whistleblower-on-sham-interviews-wins-right-to-sue-11763751344019.html",
    "timestamp": "2025-11-21T18:55:43Z"
  },
  {
    "title": "Zelensky warns Ukraine risks losing US support over White House peace plan",
    "description": "Vladimir Putin says the plan could be the \"basis\" for peace but warns Russia is prepared to fight on.",
    "link": "https://www.bbc.com/news/articles/cy5g4r9l4dlo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-11-21T18:55:19Z"
  },
  {
    "title": "Zelensky warns Ukraine risks losing US support over White House peace plan",
    "description": "Vladimir Putin says the plan could be the \"basis\" for peace but warns Russia is prepared to fight on.",
    "link": "https://www.bbc.com/news/articles/cy5g4r9l4dlo",
    "timestamp": "2025-11-21T18:55:15Z"
  },
  {
    "title": "House votes to denounce 'horrors' of socialism ahead of Mamdani-Trump meeting (Meredith Lee Hill/Politico)",
    "description": "Meredith Lee Hill / Politico:\nHouse votes to denounce ‘horrors’ of socialism ahead of Mamdani-Trump meeting  —  The House voted 285-98 to approve a resolution condemning the “horrors of socialism” Friday morning, just hours before President Donald Trump is se…",
    "link": "https://www.memeorandum.com/251121/p76",
    "timestamp": "2025-11-21T18:55:03Z"
  },
  {
    "title": "Jordan seeks info from banks in probe of Jack Smith (Hailey Fuchs/Politico)",
    "description": "Hailey Fuchs / Politico:\nJordan seeks info from banks in probe of Jack Smith  —  House Judiciary Chair Jim Jordan is asking major banks to hand over communications and materials related to former special counsel Jack Smith's far-reaching investigations into P…",
    "link": "https://www.memeorandum.com/251121/p79",
    "timestamp": "2025-11-21T18:55:03Z"
  },
  {
    "title": "Report: Barack Obama secretly huddles with Dems ‘to plot his party’s return to power’",
    "description": "Nearly 2 decades after he promised to 'fundamentally transform' America, he's still claiming to pursue 'change'",
    "link": "https://www.wnd.com/2025/11/report-barack-obama-secretly-huddles-dems-plot-his/",
    "timestamp": "2025-11-21T18:53:45Z"
  },
  {
    "title": "Eric Swalwell Enters CA Governor’s Race with Platform of Resisting Trump",
    "description": "Rep. Eric Swalwell, D-Calif., has announced he is running for California governor in 2026 election, pitching himself as the candidate who will go after the... Read More\nThe post Eric Swalwell Enters CA Governor’s Race with Platform of Resisting Trump appeared…",
    "link": "https://www.dailysignal.com/2025/11/21/eric-swalwell-enters-ca-governors-race-with-platform-of-resisting-trump/",
    "timestamp": "2025-11-21T18:53:12Z"
  },
  {
    "title": "Delivering on President Trump’s Call To Strengthen Foster Care: A Home for Every Child",
    "description": "President Donald Trump recently signed the executive order, “Fostering the Future,” a landmark action advancing first lady Melania Trump’s whole-of-government commitment to improving outcomes for... Read More\nThe post Delivering on President Trump’s Call To S…",
    "link": "https://www.dailysignal.com/2025/11/21/delivering-on-president-trumps-call-to-strengthen-foster-care-a-home-for-every-child/",
    "timestamp": "2025-11-21T18:53:03Z"
  },
  {
    "title": "Trump’s Border Chief Framed Protesters for Violence. Then the Bodycam Footage Came Out.",
    "description": "The Trump administration faced back-to-back rebukes in a pair of cases that challenged the president’s efforts to intimidate or terrorize deep-blue cities.",
    "link": "https://slate.com/news-and-politics/2025/11/bodycam-trump-border-chief-bovino-framed-chicago-protesters.html",
    "timestamp": "2025-11-21T18:52:50Z"
  },
  {
    "title": "Report: Iran nears 2,000 missiles, restoring arsenal after Rising Lion",
    "description": "Channel 13 News reports Iran has renewed most of its missile arsenal and may reach 2,000 rockets within months. Israel monitors the buildup as Tehran restores nuclear sites.",
    "link": "https://www.israelnationalnews.com/news/418161",
    "timestamp": "2025-11-21T18:51:18Z"
  },
  {
    "title": "Alyssa Farah Griffin Condemns Hypocrisy of Conservatives Calling to ‘Take Down the Rhetoric’",
    "description": "Alyssa Farah Griffin called on fellow conservatives to be as outraged over Donald Trump's rhetoric toward Dems as they were over Charlie Kirk's assassination.\nThe post Alyssa Farah Griffin Condemns Hypocrisy of Conservatives Calling to ‘Take Down the Rhetoric…",
    "link": "https://www.mediaite.com/media/news/alyssa-farah-griffin-condemns-hypocrisy-of-conservatives-calling-to-take-down-the-rhetoric/",
    "timestamp": "2025-11-21T18:50:42Z"
  },
  {
    "title": "Dem Rep. Goodlander: Trump Has Become 'Unglued by a Simple Statement of Federal Law'",
    "description": "Friday on CNN's \"The Situation Room,\" Rep. Maggie Goodlander (D-NH) said President Donald Trump has become \"unglued by a simple statement of federal law\" in his response to a video featuring Democratic lawmakers telling military members about refusing illegal…",
    "link": "https://www.breitbart.com/clips/2025/11/21/dem-rep-goodlander-trump-has-become-unglued-by-a-simple-statement-of-federal-law/",
    "timestamp": "2025-11-21T18:49:15Z"
  },
  {
    "title": "Trump administration sues California over giving in-state tuition to immigrants in US illegally",
    "description": "The Trump administration has sued California for providing in-state college tuition, scholarships, and state-funded financial aid to students who do not have...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-sues-california-over-184846649.html",
    "timestamp": "2025-11-21T18:48:46Z"
  },
  {
    "title": "Mamdani dodges question on socialism vote ahead of high-stakes meeting with Trump",
    "description": "NYC mayor-elect Mamdani dodged questions about a House vote condemning socialism just hours before his scheduled White House meeting with President Trump.",
    "link": "https://www.foxnews.com/politics/mamdani-dodges-question-socialism-vote-ahead-high-stakes-meeting-trump",
    "timestamp": "2025-11-21T18:48:31Z"
  },
  {
    "title": "Sedition? Hanging? Really? Trump media rants take insane turn | Opinion",
    "description": "Donald Trump's second term hasn't been normal from the start. Now, calling for hanging Sen. Mark Kelly and others for sedition, it's become insane.",
    "link": "https://www.azcentral.com/story/entertainment/media/2025/11/21/trump-sedition-insane/87396246007/",
    "timestamp": "2025-11-21T18:48:02Z"
  },
  {
    "title": "G20 draft declaration defies US with 'climate change' references, source says",
    "description": "JOHANNESBURG (Reuters) -A G20 draft leaders' declaration includes references to \"climate change\" in defiance of U.S. objections, a source familiar with the matter said on Friday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/22/g20-draft-declaration-defies-us-with-039climate-change039-references-source-says",
    "timestamp": "2025-11-21T18:47:00Z"
  },
  {
    "title": "7 things to know about the Justice Department’s Epstein files",
    "description": "After months of rancor and recriminations, Congress has passed and President Donald Trump has signed legislation compelling the Justice Department to give the public everything it has on Jeffrey Epstein. Here’s a look at what’s expected to be made public, wha…",
    "link": "https://www.pbs.org/newshour/politics/7-things-to-know-about-the-justice-departments-epstein-files",
    "timestamp": "2025-11-21T18:44:55Z"
  },
  {
    "title": "Is Trump Giving Illegal Orders? Dems Just Blew the Question Wide Open.",
    "description": "House Speaker Mike Johnson is outraged—absolutely outraged—that Democrats dared to suggest in that viral video this week that military and intelligence professionals should be wary of following illegal orders. “That was a wildly inappropriate thing for so-cal…",
    "link": "https://newrepublic.com/article/203525/trump-venezuela-boats-illegal-democrats-video",
    "timestamp": "2025-11-21T18:43:20Z"
  },
  {
    "title": "‘These claims are simply false’: Dems in video accused of subverting the Constitution",
    "description": "'If service members are truly under 'enormous stress,' why are retention and recruitment numbers soaring?'",
    "link": "https://www.wnd.com/2025/11/these-claims-are-simply-false-dems-video-accused/",
    "timestamp": "2025-11-21T18:43:08Z"
  },
  {
    "title": "Taoiseach joined by other world leaders in pledging combined billions to fight deadly diseases",
    "description": "The shadow of Donald Trump and his boycott of this year’s G20 loomed large over their addresses.",
    "link": "https://www.thejournal.ie/g20-ireland-micheal-martin-6882459-Nov2025/",
    "timestamp": "2025-11-21T18:39:31Z"
  },
  {
    "title": "Sources: MLS cuts 'Rooney Rule' hiring policies",
    "description": "Major League Soccer has drastically altered its hiring policy around front office and coaching positions by eliminating its minority interview requirements and many of the enforcement mechanisms surrounding those mandates, multiple sources tell ESPN.",
    "link": "https://www.espn.com/soccer/story/_/id/47049364/mls-scales-back-rooney-rule-alters-hiring-policies-sources",
    "timestamp": "2025-11-21T18:39:29Z"
  },
  {
    "title": "‘Morning Joe’ Eviscerates Mike Johnson, Karoline Leavitt for Defending Trump’s Sedition Threats: ‘This Is Orwellian!’ | Video",
    "description": "\"These people are lying through their teeth,\" host Joe Scarborough says\nThe post ‘Morning Joe’ Eviscerates Mike Johnson, Karoline Leavitt for Defending Trump’s Sedition Threats: ‘This Is Orwellian!’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/morning-joe-mike-johnson-karoline-leavitt-trump-sedition-threats-video/",
    "timestamp": "2025-11-21T18:39:08Z"
  },
  {
    "title": "Lindsey Halligan Fumbles Comey Case Badly, Critics Clown Struggle Lawyer",
    "description": "Observers of the indictment against former FBI director James Comey were astounded after interim U.S. attorney Lindsey Halligan revealed in a Virginia court that she didn’t disclose both counts of the indictment to all of the grand jury. The admission – which…",
    "link": "https://hiphopwired.com/2915950/lindsey-halligan-fumbles-comey-case-badly-critics-clown-struggle-lawyer/",
    "timestamp": "2025-11-21T18:38:46Z"
  },
  {
    "title": "Trump Says He’s ‘Not Threatening Death’ Against Democrats Following Controversial Comment",
    "description": "President Donald Trump said a group of Democrats who urged military members to “refuse illegal orders” were displaying “SEDITIOUS BEHAVIOR, punishable by DEATH!”",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/11/21/trump-says-hes-not-threatening-death-against-democrats-following-controversial-comment/",
    "timestamp": "2025-11-21T18:37:45Z"
  },
  {
    "title": "3-Time Trump Voter Feels Like President’s Handling Of This One Issue Has ‘Only Gotten Worse’",
    "description": "The woman’s remarks come after a new poll reveals more Americans, including Republicans, are breaking from Trump on this key issue.",
    "link": "https://www.huffpost.com/entry/donald-trump-cost-of-living-voter-let-down_n_692099b2e4b0d31c0a7a25e3",
    "timestamp": "2025-11-21T18:36:22Z"
  },
  {
    "title": "A Federal Judge Melted Down in Texas’s Gerrymandering Wars",
    "description": "A federal district-court judge in Texas released one of the strangest dissents in recent legal history on Wednesday, effectively accusing one of his colleagues of judicial misconduct and making a series of personal attacks on legal groups and political figure…",
    "link": "https://newrepublic.com/article/203522/texas-judge-dissent-gerrymandering-wars",
    "timestamp": "2025-11-21T18:35:17Z"
  },
  {
    "title": "Stop violence against Christians, Pentagon chief urges Nigeria",
    "description": "US Defense Secretary Pete Hegseth urged Nigeria’s National Security Advisor to take urgent action to stop violence against Christians amid rising conflict.\n\nRead More: https://punchng.com/stop-violence-against-christians-pentagon-chief-urges-nigeria/",
    "link": "https://punchng.com/?p=1990764",
    "timestamp": "2025-11-21T18:35:03Z"
  },
  {
    "title": "Territorial concessions by Ukraine, a capped army and security guarantees: What's in Trump's draft plan",
    "description": "Ripples of alarm were coursing from Kyiv through  Europe, as details emerged of President Donald Trump’s 28-point peace plan for Russia and Ukraine.",
    "link": "https://www.nbcnews.com/world/ukraine/trump-peace-plan-proposal-end-russia-ukraine-war-rcna245096",
    "timestamp": "2025-11-21T18:33:50Z"
  },
  {
    "title": "Trump Calls For Death of “Seditious” Democrats, Slammed Online",
    "description": "President Donald Trump called for the trial, and death of six Democrats who made a video calling for troops to refuse illegal orders, netting a wide backlash afterward.",
    "link": "https://hiphopwired.com/2917373/trump-calls-for-death-of-seditious-democrats/",
    "timestamp": "2025-11-21T18:32:15Z"
  },
  {
    "title": "Trump’s peace plan is a demand for Ukraine’s surrender",
    "description": "US President Donald Trump (left) greets Ukrainian President Volodymyr Zelenskyy at the White House on October 17, 2025, in Washington, DC. | Chen Mengtong/China News Service/VCG via Getty Images \nThe Trump administration has been something of a pendulum in it…",
    "link": "https://biztoc.com/x/e43b4e702d13a7ec",
    "timestamp": "2025-11-21T18:32:12Z"
  },
  {
    "title": "Schools fear disruptions as White House begins dismantling Department of Education",
    "description": "Much of the Education Department’s work now will be spread across four other federal departments. For President Donald Trump, it’s a step toward fully closing the department and giving states more power over schooling. Yet many states say it will complicate t…",
    "link": "https://biztoc.com/x/65c7deb2fa8b6a12",
    "timestamp": "2025-11-21T18:31:43Z"
  },
  {
    "title": "Russia dangling $100,000,000,000 ‘carrot’ as payoff to Trump",
    "description": "No further Nato expansion. Occupied Ukrainian territory recognised as Russian, including by the US. No prosecution for Russia for war crimes. These are some of the clauses – part of a ‘surrender document’, brokered by Donald Trump – that Ukraine is facing aft…",
    "link": "https://freerepublic.com/focus/f-news/4353872/posts",
    "timestamp": "2025-11-21T18:31:06Z"
  },
  {
    "title": "Busted: California congressional candidate claims Maryland home as primary residence",
    "description": "Rep. Alexandria Ocasio-Cortez's (D-NY) former chief of staff appears to have claimed a Maryland home as his \"primary residence\" while living nearly 3,000 miles away in San Francisco, according to a new report. The San Francisco Standard reported on Friday tha…",
    "link": "https://www.rawstory.com/nancy-pelosi-2674331808/",
    "timestamp": "2025-11-21T18:31:02Z"
  },
  {
    "title": "Coast Guard Announces It Is Super-Duper Double-Plus Sure Swastikas Are Bad",
    "description": "Apparently there was some confusion.",
    "link": "https://www.wonkette.com/p/coast-guard-announces-it-is-super",
    "timestamp": "2025-11-21T18:30:51Z"
  },
  {
    "title": "Trump’s bout of ‘explosive rage’ exposed an 'unnerving' truth: column",
    "description": "A columnist for The Guardian argued on Friday that President Donald Trump's attempt at \"cuteness\" when he called a reporter a \"piggy\" has backfired spectacularly. Earlier this week, Trump was asked about the Jeffrey Epstein files while on Air Force One. In re…",
    "link": "https://www.rawstory.com/trump-2674331900/",
    "timestamp": "2025-11-21T18:30:49Z"
  },
  {
    "title": "CNN’s Jake Tapper Goes Off on Trump in Blistering Rant Over Calls to Execute Democrats",
    "description": "Jake Tapper was visibly incensed as he tore into President Donald Trump over his calls to execute Democrats who warned against following illegal orders.\nThe post CNN’s Jake Tapper Goes Off on Trump in Blistering Rant Over Calls to Execute Democrats first appe…",
    "link": "https://www.mediaite.com/media/tv/cnns-jake-tapper-goes-off-on-trump-in-blistering-rant-over-calls-to-execute-democrats/",
    "timestamp": "2025-11-21T18:30:47Z"
  },
  {
    "title": "EU backs Ukraine as Trump sets ultimatum on 28-point peace plan",
    "description": "Earlier, Trump confirmed he had given Kyiv until 27 November to accept his administration’s proposal to end the war with Russia",
    "link": "https://www.euractiv.com/news/eu-backs-ukraine-as-trump-sets-ultimatum-on-28-point-peace-plan/",
    "timestamp": "2025-11-21T18:30:08Z"
  },
  {
    "title": "'Very difficult choice': Zelenskyy rejects fundamentals of Trump's peace plan",
    "description": "Despite numerous setbacks, President Donald Trump remains committed to ending the war between Russia and Ukraine — a war that has resulted in over a million casualties and turned much of Eastern Ukraine into drone-netted wasteland.To this end, his administrat…",
    "link": "https://www.theblaze.com/news/very-difficult-choice-ukraine-rejects-trumps-28-point-plan-to-end-the-war",
    "timestamp": "2025-11-21T18:30:00Z"
  },
  {
    "title": "European cars could become cheaper in EU trade deal",
    "description": "Australia and the European Union “edging closer” to a free trade deal and a luxury car tax is potentially on the table as a bargaining chip.",
    "link": "https://www.abc.net.au/news/2025-11-22/albanese-european-cars-cheaper/106039956",
    "timestamp": "2025-11-21T18:29:49Z"
  },
  {
    "title": "Trump tariff cut may ease pain for U.S. coffee and beef lovers",
    "description": "Donald Trump’s decision to remove a key tariff on Brazilian coffee and beef may deliver some relief to markets and consumers. Read more here",
    "link": "https://financialpost.com/commodities/tariff-cut-may-ease-coffee-beef-pain",
    "timestamp": "2025-11-21T18:29:32Z"
  },
  {
    "title": "Trump’s Ukraine Peace Plan Is Basically an Early Christmas Gift for Putin",
    "description": "There's one essential thing the authors of this plan fail to understand about the war.",
    "link": "https://slate.com/news-and-politics/2025/11/trump-28-point-ukraine-peace-plan-russia-putin.html",
    "timestamp": "2025-11-21T18:27:56Z"
  },
  {
    "title": "Schools fear disruptions as White House begins dismantling Department of Education",
    "description": "Much of the Education Department’s work now will be spread across four other federal departments. For President Donald Trump, it’s a step toward fully closing the department and giving states more power over schooling. Yet many states say it will complicate t…",
    "link": "https://www.pbs.org/newshour/education/schools-fear-disruptions-as-white-house-begins-dismantling-department-of-education",
    "timestamp": "2025-11-21T18:27:22Z"
  },
  {
    "title": "Progress on overdose deaths could be jeopardized by federal cuts, critics say",
    "description": "The cuts come at a time of steady progress in the fight against opioid addiction.",
    "link": "https://www.bostonherald.com/2025/11/21/overdose-deaths-progress-jeopardized/",
    "timestamp": "2025-11-21T18:26:55Z"
  },
  {
    "title": "Trump’s peace plan is a demand for Ukraine’s surrender",
    "description": "The Trump administration has been something of a pendulum in its position on the war in Ukraine, swinging between pro-Ukraine and pro-Russia positions over the past year. This week, it is swinging hard toward Moscow.  Earlier this week, Axios reported on a ne…",
    "link": "https://www.vox.com/politics/469993/trump-ukraine-peace-plan-zelenskyy",
    "timestamp": "2025-11-21T18:26:22Z"
  },
  {
    "title": "Layoffs are piling up, raising worker anxiety. Here are some companies that have cut jobs recently",
    "description": "Major companies have recently announced layoffs, including Amazon, UPS, and Microsoft. Learn about the economic factors driving job cuts and their impact on workers across various industries in Oklahoma and nationwide.",
    "link": "https://www.news9.com/business/layoffs-are-piling-up-raising-worker-anxiety-here-are-some-companies-that-have-cut-jobs-recently",
    "timestamp": "2025-11-21T18:24:19Z"
  },
  {
    "title": "Scott Jennings Defends Trump’s Execution Rant: ‘He Has Every Right to Be Outraged!’",
    "description": "Scott Jennings went off on \"clown\" Democratic lawmakers who participated in a video that led to Trump suggesting they be arrested for \"seditious behavior.\"\nThe post Scott Jennings Defends Trump’s Execution Rant: ‘He Has Every Right to Be Outraged!’ first appe…",
    "link": "https://www.mediaite.com/media/podcasts/scott-jennings-defends-trumps-execution-rant-he-has-every-right-to-be-outraged/",
    "timestamp": "2025-11-21T18:23:37Z"
  },
  {
    "title": "BESSENT: Oil prices could drop further if 'something happens down in Venezuela'...",
    "description": "BESSENT: Oil prices could drop further if 'something happens down in Venezuela'...\r\n\n \n \n \n (Second column, 1st story, link)\r\n\n \r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.washingtonexaminer.com/policy/economy/3894669/scott-bessent-oil-prices-venezuela/",
    "timestamp": "2025-11-21T18:22:38Z"
  },
  {
    "title": "Loot first: Donald Trump’s transactional presidency",
    "description": "Loot first: Donald Trump’s transactional presidency\nOur weekly podcast on democracy in America. This week, how President Trump runs the nation’s business alongside his own.\nA Swiss delegation donated a gold bar and a Rolex clock to President Trump’s president…",
    "link": "https://biztoc.com/x/62b5e2ee64126cb3",
    "timestamp": "2025-11-21T18:20:59Z"
  }
]