[
  {
    "title": "Mr. Deals",
    "description": "Ah well\nUS President Donald Trump said he would dictate tariff levels for US trading partners looking to avoid higher duties, appearing to move away from the idea that he would engage in back-and-forth negotiations.\n“We’re going to put very fair numbers down,…",
    "link": "https://www.eschatonblog.com/2025/05/mr-deals.html",
    "timestamp": "2025-05-06T19:30:00Z"
  },
  {
    "title": "Carney visits Trump: Key moments from the high-stakes encounter",
    "description": "Trump dominated the discussion, but Carney made his position clear on issues like tariffs and Canada becoming America's 51st state.",
    "link": "https://www.bbc.co.uk/news/videos/c2303k3n38ko",
    "timestamp": "2025-05-06T19:27:46Z"
  },
  {
    "title": "California’s high-speed train to lose federal funding, Trump says",
    "description": "By Maxwell Adler and Skylar Woodhouse | Bloomberg\nPresident Donald Trump said Tuesday that the federal government would not finance California’s high-speed rail project, escalating tensions over the state’s long-delayed infrastructure plan.\nTrump’s comments c…",
    "link": "https://biztoc.com/x/7ba1eaf2ba3a3278",
    "timestamp": "2025-05-06T19:27:02Z"
  },
  {
    "title": "Former US soldier and Holocaust survivor warns against fascism",
    "description": "As a US soldier, George Leitmann, now 99, helped liberate Germany from National Socialism. Eighty years after World War Two ended, he is sounding a warning against the return of fascism.",
    "link": "https://www.dw.com/en/former-us-soldier-and-holocaust-survivor-warns-against-fascism/a-72448740",
    "timestamp": "2025-05-06T19:27:00Z"
  },
  {
    "title": "Industrial name with AI ties makes a key move to boost its growing data center business",
    "description": "The deal will give Dover a business that has experienced a double-digit organic growth rate over the last three years.",
    "link": "https://www.cnbc.com/2025/05/06/industrial-name-with-ai-ties-makes-a-key-move-to-boost-its-growing-data-center-business.html",
    "timestamp": "2025-05-06T19:26:38Z"
  },
  {
    "title": "Mass MoCA losses National Endowment for the Arts money to Trump ‘priorities’",
    "description": "Native Jeffrey Gibson’s installed artwork “Power Full Because We’re Different” seeks to uplift queer and Indigenous communities",
    "link": "https://www.masslive.com/business/2025/05/mass-moca-losses-national-endowment-for-the-arts-money-to-trump-priorities.html",
    "timestamp": "2025-05-06T19:25:28Z"
  },
  {
    "title": "EXCLUSIVE: Trump Admin Upgrades Social Security Telephone Services",
    "description": "FIRST ON THE DAILY SIGNAL—Under President Donald Trump, the Social Security Administration is upgrading its telephone services using a modern telephone platform available at all... Read More\nThe post EXCLUSIVE: Trump Admin Upgrades Social Security Telephone S…",
    "link": "https://www.dailysignal.com/2025/05/06/exclusive-trump-admin-upgrades-social-security-telephone-services/",
    "timestamp": "2025-05-06T19:24:56Z"
  },
  {
    "title": "21Shares launches ETP for Crypto.com's Cronos token",
    "description": "21Shares has launched an exchange traded product (ETP) in Europe, providing investors with exposure to Crypto.com’s Cronos token, the asset manager said. The ETP is listed on Euronext’s Paris and Amsterdam exchanges, 21Shares said in a May 6 announcement. \r\nC…",
    "link": "https://cointelegraph.com/news/21-shares-launches-cronos-etp",
    "timestamp": "2025-05-06T19:24:42Z"
  },
  {
    "title": "NYC Restaurateur Reveals Trump Was An Annoying Guest: 'He Wasn't Very Bright'",
    "description": "“Even then he seemed like a caricature of a rich, pushy New Yorker with diabolical taste,” Keith McNally said.",
    "link": "https://www.huffpost.com/entry/restaurateur-keith-mcnally-donald-trump-balthazar_n_681a3033e4b0981671adbc54",
    "timestamp": "2025-05-06T19:23:56Z"
  },
  {
    "title": "What the Next Pope Can Learn From Francis: A Muslim's Reflection | Opinion",
    "description": "May the next pope walk the path Francis helped illuminate—with humility, courage, and the conviction that faith must always serve justice.",
    "link": "https://www.newsweek.com/what-next-pope-can-learn-francis-muslims-reflection-opinion-2068557",
    "timestamp": "2025-05-06T19:23:36Z"
  },
  {
    "title": "Houthis: Attacks on Israel to continue after ceasefire with US",
    "description": "The head of the Houthi Supreme Political Council, Mahdi al-Mashat, warned Israelis to \"remain in shelters\" after agreeing to stop attacking international shipping.",
    "link": "https://www.israelnationalnews.com/news/407950",
    "timestamp": "2025-05-06T19:22:00Z"
  },
  {
    "title": "Washington Post Celebrates Pulitzer Prize Win of Cartoonist Who Quit the Paper in Protest After Having Anti-Bezos Cartoon Spiked",
    "description": "The spiked cartoon that Telnaes resigned in protest over also quickly went viral after her win\nThe post Washington Post Celebrates Pulitzer Prize Win of Cartoonist Who Quit the Paper in Protest After Having Anti-Bezos Cartoon Spiked first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/washington-post-celebrates-pulitzer-prize-win-of-cartoonist-who-quit-the-paper-in-protest-after-having-anti-bezos-cartoon-spiked/",
    "timestamp": "2025-05-06T19:21:33Z"
  },
  {
    "title": "Carney says Canada is not for sale, Trump replies, 'Never say never' (Diana Stancy/Fox News)",
    "description": "Diana Stancy / Fox News:\nCarney says Canada is not for sale, Trump replies, ‘Never say never’  —  Trump has repeatedly discussed Canada becoming another US state, along with sharing plans to acquire Greenland and the Panama Canal  —  Despite President Donald …",
    "link": "https://www.memeorandum.com/250506/p107",
    "timestamp": "2025-05-06T19:20:01Z"
  },
  {
    "title": "Who Is Vinay Prasad? RFK Jr. Taps Pharma Critic To Lead FDA Vaccine Program",
    "description": "Prasad's appointment marks the latest addition of a medical skeptic and critics of COVID-19 policies to federal health leadership.",
    "link": "https://www.newsweek.com/who-vinay-prasad-rfk-jr-taps-pharma-critic-lead-fda-vaccine-program-2068776",
    "timestamp": "2025-05-06T19:19:55Z"
  },
  {
    "title": "Canadian Prime Minister's 'Grimace' Called Out After Trump Says Us Doesn't 'Do Much Business With Canada': 'He's Dying Inside'",
    "description": "Prime Minister Mark Carney struggled to maintain a neutral facial expression as President Donald Trump dismissed the economic value of trade with Canada.",
    "link": "https://www.ibtimes.com/canadian-prime-ministers-grimace-called-out-after-trump-says-us-doesnt-do-much-business-3772650",
    "timestamp": "2025-05-06T19:17:07Z"
  },
  {
    "title": "Newark Airport meltdown adds to alarming trend of air traffic chaos under Trump",
    "description": "Rachel Maddow breaks down the chaotic first few months of air travel under the Trump administration, after reports of a communications failure at Newark Airport.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/newark-airport-meltdown-air-traffic-chaos-trump-rcna205117",
    "timestamp": "2025-05-06T19:16:18Z"
  },
  {
    "title": "Trump Has Nothing To Say After Prime Minister Dismisses His Canada Dreams",
    "description": "One social media user said the president reacted like \"a naughty little bully brought to the principal’s office\" who \"suddenly turns into the quietest kid in class.\"",
    "link": "https://www.huffpost.com/entry/trump-mark-carney-dashes-canada-dreams_n_681a3dfbe4b0981671adc958",
    "timestamp": "2025-05-06T19:16:15Z"
  },
  {
    "title": "Supreme Court allows Trump to enforce transgender ban in U.S. military",
    "description": "3 leftist justices would have let those requiring medical treatment, accommodations to remain in ranks",
    "link": "https://www.wnd.com/2025/05/supreme-court-allows-trump-to-enforce-transgender-ban-in-u-s-military/",
    "timestamp": "2025-05-06T19:16:05Z"
  },
  {
    "title": "Trump’s wanton destruction of the economy damaging his standing among his critical constituency of low-information voters",
    "description": "Donald Trump has many obvious political liabilities, which causes too many people to assume that beating him is an easy task. The problem is that he also has some unique political strengths, most notably his ability to mobilize sporadic and first-time voters.…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/trumps-wanton-destruction-of-the-economy-damaging-his-standing-among-his-critical-constituency-of-low-information-voters",
    "timestamp": "2025-05-06T19:14:46Z"
  },
  {
    "title": "US Amb. Mike Huckabee and former hostage Omer Shem Tov meet at Friends of Zion event",
    "description": "Ambassador Huckabee speaks about Omer's deep connection to the Jewish people and faith, 'I was deeply moved by your smile. God resides within you. You are stronger than the hatred that surrounded you for 505 days.”",
    "link": "https://www.israelnationalnews.com/news/407948",
    "timestamp": "2025-05-06T19:14:00Z"
  },
  {
    "title": "India has agreed already to drop its tariffs to nothing: President Trump",
    "description": "President Trump announced that India has agreed to eliminate its high tariffs, a move he attributes to his negotiation skills. He emphasized that India would not have made such an agreement with anyone else. Trump also outlined his vision for trade relations,…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-has-agreed-already-to-drop-its-tariffs-to-nothing-president-trump/articleshow/120942410.cms",
    "timestamp": "2025-05-06T19:13:34Z"
  },
  {
    "title": "Canada's Prime Minister holds trade and sovereignty talks with US President",
    "description": "WASHINGTON: Canadian Prime Minister Mark Carney told US President Donald Trump on Tuesday (May 6) that his country is “not for sale, it won’t be for sale–ever,” delivering a firm message on Canada’s sovereignty during his first visit to the White House",
    "link": "https://www.channelnewsasia.com/world/canadas-prime-minister-holds-trade-and-sovereignty-talks-us-president-5112081",
    "timestamp": "2025-05-06T19:13:01Z"
  },
  {
    "title": "Carney's body language during his Trump meeting spoke volumes",
    "description": "Donald Trump welcomed Mark Carney to an Oval Office refurbished, in his words, \"with love and carat gold\".",
    "link": "https://news.sky.com/story/mark-carneys-body-language-during-his-trump-meeting-spoke-volumes-13362971",
    "timestamp": "2025-05-06T19:13:00Z"
  },
  {
    "title": "Colombia’s desert north feels the pain of Trump’s cuts",
    "description": "For residents of Colombia’s largest migrant camp, an already tough life is getting tougher thanks to Donald Trump’s aid cuts. Eight months pregnant and 20 years old, Astrid lives on an abandoned dust-blown airstrip in Colombia’s Guajira desert. Home is a lean…",
    "link": "https://www.digitaljournal.com/world/colombias-desert-north-feels-the-pain-of-trumps-cuts/article",
    "timestamp": "2025-05-06T19:12:20Z"
  },
  {
    "title": "Top US court allows Trump’s ban on trans troops to take effect",
    "description": "A divided US Supreme Court on Tuesday allowed President Donald Trump’s ban on transgender military personnel to take effect while litigation proceeds, putting thousands of troops at risk of dismissal. The decision — which the court’s three liberal justices op…",
    "link": "https://www.digitaljournal.com/world/top-us-court-allows-trumps-ban-on-trans-troops-to-take-effect/article",
    "timestamp": "2025-05-06T19:12:20Z"
  },
  {
    "title": "Top US Court Allows Trump's Ban On Trans Troops To Take Effect",
    "description": "A divided US Supreme Court on Tuesday allowed President Donald Trump's ban on transgender military personnel to take effect while litigation proceeds, putting thousands of troops at risk of dismissal.",
    "link": "https://www.ibtimes.com/top-us-court-allows-trumps-ban-trans-troops-take-effect-3772648",
    "timestamp": "2025-05-06T19:12:18Z"
  },
  {
    "title": "Colombia's Desert North Feels The Pain Of Trump's Cuts",
    "description": "For residents of Colombia's largest migrant camp, an already tough life is getting tougher thanks to Donald Trump's aid cuts.",
    "link": "https://www.ibtimes.com/colombias-desert-north-feels-pain-trumps-cuts-3772645",
    "timestamp": "2025-05-06T19:12:17Z"
  },
  {
    "title": "As Trump Pushes Privatization of USPS, Amazon May Be Preparing to Take Over",
    "description": "A new CEO statement from Amazon suggests it could be angling to take over the US Postal Service.",
    "link": "https://truthout.org/articles/as-trump-pushes-privatization-of-usps-amazon-may-be-preparing-to-take-over/",
    "timestamp": "2025-05-06T19:11:51Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "The Office of the United Nations High Commissioner on Refugees is gravely concerned by the rapidly increasing number of Sudanese refugees crossing into eastern Chad due to escalating violence in Sudan’s North Darfur region, with nearly 20,000 people — mostly …",
    "link": "https://press.un.org/en/2025/db250506.doc.htm",
    "timestamp": "2025-05-06T19:11:44Z"
  },
  {
    "title": "Democrat’s win in North Carolina Supreme Court race must be certified, federal judge says",
    "description": "A federal judge has ordered the results of North Carolina’s Supreme Court race to be certified, in a ruling that, if upheld, would wrap up an election that had drawn out for months after a challenge over the eligibility of thousands of ballots.",
    "link": "https://www.msnbc.com/top-stories/latest/north-carolina-supreme-court-alison-riggs-certify-federal-judge-rcna205120",
    "timestamp": "2025-05-06T19:11:25Z"
  },
  {
    "title": "Kristi Noem Gets Brutal Fact-Check on Deporting U.S. Citizens",
    "description": "Secretary of Homeland Security Kristi Noem was brutally called out Tuesday after she claimed the United States was not deporting its own citizens. \r\nDuring a hearing before the House Appropriations Subcommittee on Homeland Security, Representative Lauren Unde…",
    "link": "https://newrepublic.com/post/194931/kristi-noem-brutal-fact-check-deportations-us-citizens",
    "timestamp": "2025-05-06T19:10:52Z"
  },
  {
    "title": "Report: Pro-Immigration Lawyers Whine that Trump Deportations Apply to All Illegals, Including Irish",
    "description": "President Donald Trump's administration is reportedly deporting illegal aliens from Ireland, says a lament from several immigration lawyers in the Irish Star news site.\nThe post Report: Pro-Immigration Lawyers Whine that Trump Deportations Apply to All Illega…",
    "link": "https://www.breitbart.com/economy/2025/05/06/trumps-deputies-deporting-irish-migrants/",
    "timestamp": "2025-05-06T19:05:22Z"
  },
  {
    "title": "Supreme Court allows Trump ban on transgender members of the military to take effect, for now",
    "description": "The Supreme Court acted Tuesday in the dispute over a policy that presumptively disqualifies transgender people from military service.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_030c05b9-7be1-5857-82dd-00bb3364bb4d.html",
    "timestamp": "2025-05-06T19:05:00Z"
  },
  {
    "title": "US Transfers, Upgrades Missile Defense System From Israel To Ukraine",
    "description": "US Transfers, Upgrades Missile Defense System From Israel To Ukraine\n \nVia The Libertarian Institute \nThe Donald Trump administration is moving forward with a Joe Biden-era plan to move a retired Patriot missile system from Israel to Ukraine. Washington will …",
    "link": "https://biztoc.com/x/fb97c6ee1a8ac75f",
    "timestamp": "2025-05-06T19:04:44Z"
  },
  {
    "title": "SCOTUS Gives Trump Big Win on Pentagon Transgender Policy",
    "description": "The Supreme Court delivered President Donald Trump a win on Tuesday, allowing him to exclude openly transgender individuals from the military.\nThe post SCOTUS Gives Trump Big Win on Pentagon Transgender Policy appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/06/scotus-gives-trump-big-win-on-pentagon-transgender-policy/",
    "timestamp": "2025-05-06T19:04:34Z"
  },
  {
    "title": "Trump tells Carney CUSMA is 'good deal for everybody' but leaves door open for termination",
    "description": "Prime Minister \n \n \n \n \n \n Mark Carney\n \n \n \n \n \n and U.S. President \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n both used their first meeting in Washington, D.C., Tuesday to suggest the current North American trade agreement would be subject to renegotiation, with T…",
    "link": "https://biztoc.com/x/1ff519246d8a698c",
    "timestamp": "2025-05-06T19:04:15Z"
  },
  {
    "title": "Is the White House’s Plan for Trans Youth Just ‘Conversion Therapy Lite’?",
    "description": "A new 400-page report from the Department of Health and Human Services calls for psychotherapy for kids struggling with their gender — but experts worry it's covering up something darker",
    "link": "http://www.rollingstone.com/culture/culture-features/trans-youth-hhs-report-conversion-therapy-1235332473/",
    "timestamp": "2025-05-06T19:04:09Z"
  },
  {
    "title": "Judge bars Trump administration from shrinking agencies that fund libraries, settle labor disputes",
    "description": "Twenty-one states sued over the executive order.",
    "link": "https://www.bostonherald.com/2025/05/06/trump-agencies-libraries-and-museums/",
    "timestamp": "2025-05-06T19:03:50Z"
  },
  {
    "title": "IDF Destroys Airport Used for Weapons Shipments in Devastating Strike on Houthis",
    "description": "Israel \"completely destroyed\" Yemen’s Sanaa International Airport on Tuesday, delivering a crippling blow to the Iran-backed Houthis who had used the facility to transport weapons and terrorist fighters across the Middle East.\nThe post IDF Destroys Airport Us…",
    "link": "https://freebeacon.com/israel/idf-destroys-airport-used-for-weapons-shipments-in-devastating-strike-on-houthis/",
    "timestamp": "2025-05-06T19:03:43Z"
  },
  {
    "title": "The Fed meets with uncertainty permeating the air. Here's what to expect",
    "description": "Central bank policymakers can do little for now except sit and wait as events unfold.",
    "link": "https://www.cnbc.com/2025/05/06/the-fed-meets-with-uncertainty-permeating-the-air-heres-what-to-expect.html",
    "timestamp": "2025-05-06T19:03:16Z"
  },
  {
    "title": "Judge bars Trump administration from shrinking agencies that fund libraries, settle labor disputes",
    "description": "A federal judge has temporarily barred President Donald Trump’s administration from dramatically shrinking three agencies that fund libraries, settle labor disputes and support state business contracting programs",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-bars-trump-administration-shrinking-agencies-fund-libraries-121531172",
    "timestamp": "2025-05-06T19:02:22Z"
  },
  {
    "title": "Trump Pentagon nominee under scrutiny in hearing for partisan comments",
    "description": "A retired U.S. brigadier general who failed to get through the confirmation process in the first Trump administration is getting renewed scrutiny for his political and anti-Islamic social media posts",
    "link": "https://abcnews.go.com/US/wireStory/trump-pentagon-nominee-scrutiny-hearing-partisan-comments-121529652",
    "timestamp": "2025-05-06T19:02:21Z"
  },
  {
    "title": "Carney tells Trump that Canada 'won't be for sale, ever'",
    "description": "The Canadian PM responds firmly as the president proposes a \"wonderful marriage\" of incorporating Canada into the US.",
    "link": "https://www.bbc.com/news/articles/c4g4gw18753o",
    "timestamp": "2025-05-06T19:01:17Z"
  },
  {
    "title": "Jocelyn Benson says miscarriage prompted her to prioritize reproductive health",
    "description": "LANSING, Mich. (AP) — Ahead of a nationally watched bid to become Michigan's next governor, Democrat Jocelyn Benson is releasing a memoir this month that includ",
    "link": "https://midmichigannow.com/news/local/jocelyn-benson-says-miscarriage-prompted-her-to-prioritize-reproductive-health",
    "timestamp": "2025-05-06T19:01:03Z"
  },
  {
    "title": "National Insecurity: The Trump Administration’s NATSEC Boys Just Can’t Stop Fucking Up",
    "description": "If you feel this nation is beset on all sides by the inequities of the selfish and the tyrannies of evil men, you probably should be scared shitless that the clowns are running the circus. Of course, those backing Trump aren’t truly concerned about any of thi…",
    "link": "https://www.techdirt.com/2025/05/06/national-insecurity-the-trump-administrations-natsec-boys-just-cant-stop-fucking-up/",
    "timestamp": "2025-05-06T19:00:57Z"
  },
  {
    "title": "Trump says the US will stop bombing Yemen's Houthis after rebels say they'll stop targeting ships",
    "description": "Trump says the US will stop bombing Yemen's Houthis after rebels say they'll stop targeting shipsnews4jax.com",
    "link": "https://www.news4jax.com/news/politics/2025/05/06/trump-says-the-us-will-stop-bombing-yemens-houthis-after-rebels-say-theyll-stop-targeting-ships/",
    "timestamp": "2025-05-06T19:00:57Z"
  },
  {
    "title": "Trade War Fallout in China a Mystery; Beijing Stopped Reporting Key Economic Data",
    "description": "\"Never Kneel Down! Bowing to a bully [U.S.] is like drinking poison to quench thirst — it only deepens the crisis.\"\nThe post Trade War Fallout in China a Mystery; Beijing Stopped Reporting Key Economic Data first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trade-war-fallout-in-china-a-mystery-beijing-stopped-reporting-key-economic-data/",
    "timestamp": "2025-05-06T19:00:38Z"
  },
  {
    "title": "The Call Is Coming From Inside the House: Why We Need Ed Martin as US Attorney",
    "description": "In the 1979 horror classic “When a Stranger Calls” a babysitter keeps getting crank phone calls from a stranger asking her to “check the children.” At first, the babysitter blows off the calls as just a practical joke, but as the calls increase in frequency a…",
    "link": "https://www.thegatewaypundit.com/2025/05/call-is-coming-inside-house-why-we-need/",
    "timestamp": "2025-05-06T19:00:29Z"
  },
  {
    "title": "Florida exits Bitcoin Reserve race – Here’s what it means for state-led crypto adoption",
    "description": "Florida withdraws Bitcoin treasury plan as North Carolina advances digital asset investments, signaling diverging state policies.",
    "link": "https://ambcrypto.com/florida-exits-bitcoin-reserve-race-heres-what-it-means-for-state-led-crypto-adoption/",
    "timestamp": "2025-05-06T19:00:11Z"
  },
  {
    "title": "Trump’s Kennedy Center Debut: Les Mis and Six-Figure Checks",
    "description": "The president will attend a fundraiser and a showing of Les Misérables at an institution he hopes to remake in his image.",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/trumps-kennedy-center-appearance/682710/",
    "timestamp": "2025-05-06T19:00:00Z"
  },
  {
    "title": "ESPN’s Stephen A. Smith Is Already Plotting His Law & Order Return — Ahead of His Debut",
    "description": "It doesn’t matter that Stephen A. Smith, ESPN host/sometime actor/presidential hopeful? (we’ll get to that later), won’t make his Law & Order debut until later this week. It’s also of no concern that his character gets murdered before the opening theme plays:…",
    "link": "https://tvline.com/previews/stephen-a-smith-law-and-order-season-24-interview-1235446026/",
    "timestamp": "2025-05-06T19:00:00Z"
  },
  {
    "title": "Accused Tesla Vandal Released to Receive ‘Gender-Affirming Care’",
    "description": "A court released from jail a suspect who allegedly set fire to Tesla vehicles in Kansas City, Missouri, in order to allow the suspect to... Read More\nThe post Accused Tesla Vandal Released to Receive ‘Gender-Affirming Care’ appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/06/accused-tesla-vandal-released-receive-gender-affirming-care/",
    "timestamp": "2025-05-06T19:00:00Z"
  },
  {
    "title": "Trump Brags About Gold-Plated Office While Telling Americans to Cut Expenses (Nikki McCann Ramirez/Rolling Stone)",
    "description": "Nikki McCann Ramirez / Rolling Stone:\nTrump Brags About Gold-Plated Office While Telling Americans to Cut Expenses  —  The president gloated about his “24-karat gold” White House renovation as his nonsensical tariff agenda drives up prices for consumers  —  A…",
    "link": "https://www.memeorandum.com/250506/p104",
    "timestamp": "2025-05-06T19:00:00Z"
  },
  {
    "title": "Who won the election culture wars? Not Dutton or Palmer",
    "description": "Reactionary newspapers and the outdoor advertising sector might have immediately profited from the last few weeks of the election campaign but it didn't seem to help politicians at the polls.",
    "link": "https://www.abc.net.au/news/2025-05-07/welcome-to-country-peter-dutton-clive-palmer-voice/105252762",
    "timestamp": "2025-05-06T19:00:00Z"
  },
  {
    "title": "Trump tells Carney CUSMA is ‘good deal for everybody’ but leaves door open for termination",
    "description": "Prime Minister Mark Carney and President Donald Trump used their first meeting to suggest the trade agreement needed changes. Read on",
    "link": "https://financialpost.com/news/trump-tells-carney-cusma-is-good-deal-for-everybody-but-leaves-door-open-for-termination",
    "timestamp": "2025-05-06T18:59:59Z"
  },
  {
    "title": "'Blindsided': Experts say Trump threw major ally 'under the bus' with off-the-cuff remark",
    "description": "President Donald Trump claimed Tuesday that Houthi rebels in Yemen \"don't want to fight anymore,\" but that may be news to Israel, which has been engaging in retaliatory bombing of Yemen's main airport.According to The New York Times, Tuesday's strikes that ki…",
    "link": "https://www.rawstory.com/houthis-trump/",
    "timestamp": "2025-05-06T18:59:37Z"
  },
  {
    "title": "MSNBC Guest Mocks Americans and Warns U.S. Could Start War With Canada",
    "description": "MSNBC's Katy Tur listened as Canadian journalist Stephen Marche mocked Americans and warned that his country and the United States could be headed for war.\nThe post MSNBC Guest Mocks Americans and Warns U.S. Could Start War With Canada first appeared on Media…",
    "link": "https://www.mediaite.com/tv/msnbc-guest-mocks-americans-and-warns-u-s-could-start-war-with-canada/",
    "timestamp": "2025-05-06T18:59:16Z"
  },
  {
    "title": "German election surprises break European shares hot streak",
    "description": "Pan-European STOXX 600 index snapped a 10-day winning streak",
    "link": "https://www.irishtimes.com/business/2025/05/06/german-election-surprises-break-european-shares-hot-streak/",
    "timestamp": "2025-05-06T18:57:56Z"
  },
  {
    "title": "U.S. trade deficit hits record as companies front-load pharmaceuticals",
    "description": "NEW YORK, May 6 (Xinhua) -- The U.S. trade deficit ballooned 14 percent to a record 140.5 billion U.S. dollars in March, as businesses stockpiled goods to get ahead of sweeping tariffs that President Donald Trump imposed the following month. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/07/us-trade-deficit-hits-record-as-companies-front-load-pharmaceuticals",
    "timestamp": "2025-05-06T18:57:00Z"
  },
  {
    "title": "Israel's plan to expand military campaign in Gaza strikes fear into Palestinians",
    "description": "Israel's plan to expand its Gaza offensive, displace people within the enclave and take control of aid distribution has horrified Gazans who have already suffered multiple displacements and severe food shortages for nearly 19 months.",
    "link": "https://www.cbc.ca/news/world/israel-plan-gaza-reaction-1.7527434",
    "timestamp": "2025-05-06T18:56:12Z"
  },
  {
    "title": "Canadian PM Carney Tries to Disarm Trump With Real Estate Talk",
    "description": "Prime Minister Mark Carney had a clear strategy for telling President Donald Trump to his face that Canada won’t become the 51st US state: put it in the language of a land deal.",
    "link": "https://financialpost.com/pmn/business-pmn/canadian-pm-carney-tries-to-disarm-trump-with-real-estate-talk",
    "timestamp": "2025-05-06T18:56:04Z"
  },
  {
    "title": "Wittman: Cuts to federal share of Medicaid costs 'a no-go'",
    "description": "Rep. Rob Wittman, R-1st, said he has expressed his concerns about the proposals to House Speaker Mike Johnson, R-La., and House Majority Leader Steve Scalise, R-La.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_1e72e119-5e66-4dfa-b34e-a8796f177f6c.html",
    "timestamp": "2025-05-06T18:56:00Z"
  },
  {
    "title": "DOJ Won't Appeal Judge's Order Against Trump's Anti-Voting Decree (Jacob Knutson/Democracy Docket)",
    "description": "Jacob Knutson / Democracy Docket:\nDOJ Won't Appeal Judge's Order Against Trump's Anti-Voting Decree  —  The Department of Justice (DOJ) does not plan to appeal a judge's order blocking President Donald Trump from adding a proof of citizenship requirement on a…",
    "link": "https://www.memeorandum.com/250506/p103",
    "timestamp": "2025-05-06T18:55:01Z"
  },
  {
    "title": "Supreme Court allows military to ban transgender troops while case continues (Washington Post)",
    "description": "Washington Post:\nSupreme Court allows military to ban transgender troops while case continues  —  President Donald Trump issued an executive order to remove transgender troops from the military soon after taking office in January.  —  A divided Supreme Court …",
    "link": "https://www.memeorandum.com/250506/p102",
    "timestamp": "2025-05-06T18:55:01Z"
  },
  {
    "title": "Critic of drug industry and COVID-19 measures to lead FDA vaccine program",
    "description": "The Food and Drug Administration says that a prominent medical contrarian and critic of the drug industry will head its vaccine center",
    "link": "https://abcnews.go.com/Business/wireStory/critic-drug-industry-covid-19-measures-lead-fda-121528273",
    "timestamp": "2025-05-06T18:54:31Z"
  },
  {
    "title": "Critic of drug industry and COVID-19 measures to lead FDA vaccine program",
    "description": "The Food and Drug Administration says that a prominent medical contrarian and critic of the drug industry will head its vaccine center",
    "link": "https://abcnews.go.com/Health/wireStory/critic-drug-industry-covid-19-measures-lead-fda-121528272",
    "timestamp": "2025-05-06T18:54:30Z"
  },
  {
    "title": "Head of Social Security blames ‘DEI’ and ‘gender ideology’ for long wait times",
    "description": "The head of the Social Security Administration blamed \"DEI\" and \"gender ideology\" for recent delays in service.",
    "link": "https://www.msnbc.com/top-stories/latest/social-security-delays-wait-times-dei-trump-newsletter-rcna205125",
    "timestamp": "2025-05-06T18:54:07Z"
  },
  {
    "title": "“Wait Till You See What’s Coming”: Tom Homan Threatens Blue City, State Leaders with Arrest, Reveals Promise to Lock Up Sanctuary City Leaders",
    "description": "In an epic warning, Border Czar Tom Homan promised retribution to Democrat leaders who defy President Donald Trump’s immigration policy. Specifically singling out so-called sanctuary cities, Homan stated, “Wait till you see what’s coming,” in his ominous warn…",
    "link": "https://freerepublic.com/focus/f-news/4315386/posts",
    "timestamp": "2025-05-06T18:53:53Z"
  },
  {
    "title": "Albanese’s flying high, but can he bring down the cost of living?",
    "description": "The election may be over, but cost of living is still front of mind for Australians. These graphs show how we got here and what the new government has to do to rein in rising prices.",
    "link": "https://www.abc.net.au/news/2025-05-07/can-albanese-government-fix-the-economy-four-corners/105260320",
    "timestamp": "2025-05-06T18:53:24Z"
  },
  {
    "title": "Trump said to want to speed up nuclear deployment",
    "description": "United States President Donald Trump's administration is hoping to accelerate the deployment of nuclear reactors through executive orders, Axios reported on Tuesday.According to the media outlet, the ...",
    "link": "https://biztoc.com/x/5e70783fb2a74fdb",
    "timestamp": "2025-05-06T18:53:09Z"
  },
  {
    "title": "Trump administration asks judge to toss suit restricting abortion medication access",
    "description": "President Donald Trump's administration has asked a judge to toss out a lawsuit from three Republican-led states seeking to cut off telehealth access to the abortion medication mifepristone.",
    "link": "https://biztoc.com/x/ba5c7f8e62788313",
    "timestamp": "2025-05-06T18:52:59Z"
  },
  {
    "title": "Critic of drug industry and COVID-19 measures to lead FDA vaccine program",
    "description": "Dr. Vinay Prasad was named to oversee the program for vaccines and biotech drugs.",
    "link": "https://www.bostonherald.com/2025/05/06/fda-vaccine-chief/",
    "timestamp": "2025-05-06T18:52:32Z"
  },
  {
    "title": "Backstories of Kamala Harris’ and Nicki Minaj’s Met Gala Jewels",
    "description": "Like many of the notable guests at the Met Gala, the former vice president and the rapper weren't wearing gifts.",
    "link": "http://wwd.com/fashion-news/fashion-scoops/kamala-harris-nicki-minaj-met-gala-jewels-1237686819/",
    "timestamp": "2025-05-06T18:51:24Z"
  },
  {
    "title": "Trump Announces the Houthis Have Contacted Him and Thrown in the Towel: 'They Have Capitulated'",
    "description": "After weeks of pounding by U.S. forces, the Houthi rebels have \"capitulated,\" according to President Donald Trump.",
    "link": "https://www.westernjournal.com/trump-announces-houthis-contacted-thrown-towel-capitulated/",
    "timestamp": "2025-05-06T18:50:58Z"
  },
  {
    "title": "Brooklyn-bred star defense attorney Joe Tacopina turned down Diddy after A$AP Rocky acquittal",
    "description": "Joe Tacopina has represented Donald Trump, a baseball legend and an A$AP Rocky -- but he turned down Sean \"Diddy\" Combs when the rapper came calling.",
    "link": "https://nypost.com/2025/05/06/business/nyc-bred-star-defense-attorney-joe-tacopina-turns-down-diddy/",
    "timestamp": "2025-05-06T18:50:18Z"
  },
  {
    "title": "Canada 'not for sale,' Carney tells Trump as they meet",
    "description": "Meeting Donald Trump in the White House, Canadian Prime Minister Mark Carney said his country \"won't be for sale, ever\" and Canadians have no wish to join the US. \"Never say never,\" Trump replied.",
    "link": "https://www.dw.com/en/canada-not-for-sale-carney-tells-trump-as-they-meet/a-72456185",
    "timestamp": "2025-05-06T18:50:00Z"
  },
  {
    "title": "Carney tells Trump: Canada 'won't be for sale, ever'",
    "description": "Canadian Prime Minister Mark Carney on Tuesday told President Donald Trump at the White House that Canada would never be ...",
    "link": "https://biztoc.com/x/dd4fa7eb2d2b6228",
    "timestamp": "2025-05-06T18:49:14Z"
  },
  {
    "title": "Coming up: Canadian PM Mark Carney holds press briefing following Donald Trump talk",
    "description": "Watch live from 8pm BST as Canadian prime minister Mark Carney speaks to the press following a meeting at the White House ...",
    "link": "https://biztoc.com/x/fcd7db894fbdd51a",
    "timestamp": "2025-05-06T18:49:04Z"
  },
  {
    "title": "Trump's crypto ventures cause tensions to bubble over as Democratic lawmaker scuttles key hearing",
    "description": "Although Congress had appeared likely earlier this year to pass legislation governing digital assets for the first time, Democrats have grown increasingly frustrated as Republican Trump and his family members have promoted their personal crypto projects.",
    "link": "https://economictimes.indiatimes.com/tech/technology/trumps-crypto-ventures-cause-tensions-to-bubble-over-as-democratic-lawmaker-scuttles-key-hearing/articleshow/120942060.cms",
    "timestamp": "2025-05-06T18:48:19Z"
  },
  {
    "title": "US Supreme Court allows Trump to enforce transgender military ban",
    "description": "A lower court had placed an injuction on the ban, which transgender servicemembers argue hamper military readiness",
    "link": "https://www.bbc.com/news/articles/cd020jl887go",
    "timestamp": "2025-05-06T18:47:20Z"
  },
  {
    "title": "FM Nirmala Sitharaman calls EU free trade deal a 'high priority'",
    "description": "Finance Minister Nirmala Sitharaman expressed optimism about finalizing a free trade agreement with the European Union by the end of the year, emphasizing its high priority for both sides. While aiming for closer trade ties, she criticized the EU's Carbon Bor…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/fm-nirmala-sitharaman-calls-eu-free-trade-deal-a-high-priority/articleshow/120941978.cms",
    "timestamp": "2025-05-06T18:45:56Z"
  },
  {
    "title": "FDA Names Vinay Prasad as New Head of Vaccines, Biologics",
    "description": "FDA Commissioner Marty Makary named Vinay Prasad, a hematologist oncologist and critic of the Covid-19 vaccine for children, as the next director of the Center for Biologics and Research.",
    "link": "https://financialpost.com/pmn/business-pmn/fda-names-vinay-prasad-as-new-head-of-vaccines-biologics",
    "timestamp": "2025-05-06T18:45:47Z"
  },
  {
    "title": "Oman says it mediated a ceasefire between U.S., Yemen's Houthis",
    "description": "WASHINGTON — Oman said it mediated a ceasefire deal between Yemen’s Houthis and the U.S., marking a major shift in the Iran-aligned group’s policy since the start of Israel’s war in Gaza in Oct. 2023.",
    "link": "https://www.nbcnews.com/world/yemen/oman-says-mediated-ceasefire-us-yemens-houthis-rcna205175",
    "timestamp": "2025-05-06T18:45:34Z"
  },
  {
    "title": "Trump's course to host DP World Tour's Scottish Championship",
    "description": "U.S. President Donald Trump's golf course in Aberdeenshire will host the DP World Tour's Scottish Championship, tour organisers said on Tuesday. The $2.75 million tournament has been added to the 2025 DP World Tour's global schedule from August 7-10 and will …",
    "link": "https://www.channelnewsasia.com/sport/trumps-course-host-dp-world-tours-scottish-championship-5112781",
    "timestamp": "2025-05-06T18:44:13Z"
  },
  {
    "title": "Trump Halts U.S. Bombing of Houthis, Citing Ceasefire Pledge That the Houthis Deny",
    "description": "President Donald Trump announced Tuesday that the United States will cease military operations against Houthi forces in Yemen, claiming the Iran-aligned group agreed to stop disrupting maritime traffic in vital...",
    "link": "https://gcaptain.com/trump-halts-u-s-bombing-of-houthis-citing-ceasefire-pledge-that-the-houthis-deny/",
    "timestamp": "2025-05-06T18:43:03Z"
  },
  {
    "title": "Treasury’s Bessent Warns CBDC Would Convey ‘Weakness’",
    "description": "The official previously said that a CBDC was not needed in the U.S.",
    "link": "https://decrypt.co/318165/treasurys-bessent-warns-cbdc-would-convey-weakness",
    "timestamp": "2025-05-06T18:42:47Z"
  },
  {
    "title": "Did Trump’s Alcatraz idea come from a Donald Trump Jr. joke?",
    "description": "In January, Trump Jr. floated the idea of turning Alcatraz back into a prison.",
    "link": "https://www.bostonherald.com/2025/05/06/did-trumps-alcatraz-idea-come-from-a-donald-trump-jr-joke/",
    "timestamp": "2025-05-06T18:42:05Z"
  },
  {
    "title": "Trump said to be looking to speed up nuclear deployment",
    "description": "United States President Donald Trump's administration is hoping to accelerate the deployment of nuclear reactors through executive orders, Axios reported on Tuesday.According to the media outlet, the ...",
    "link": "https://biztoc.com/x/0a21e7f3b60ad5c7",
    "timestamp": "2025-05-06T18:42:01Z"
  },
  {
    "title": "Canadian Prime Minister Mark Carney Calls Trump a 'Transformational President'",
    "description": "Canadian Prime Minister Mark Carney complimented President Donald Trump as a \"transformational president\" during his visit to the White House on Tuesday.\nThe post Canadian Prime Minister Mark Carney Calls Trump a ‘Transformational President’ appeared first on…",
    "link": "https://www.breitbart.com/politics/2025/05/06/canadian-prime-minister-mark-carney-calls-trump-a-transformational-president/",
    "timestamp": "2025-05-06T18:41:16Z"
  },
  {
    "title": "Trump administration asks judge to toss suit restricting abortion medication access",
    "description": "President Donald Trump's administration has asked a judge to toss out a lawsuit from three Republican-led states seeking to cut off telehealth access to the abortion medication mifepristone.",
    "link": "https://www.pbs.org/newshour/nation/trump-administration-asks-judge-to-toss-suit-restricting-abortion-medication-access",
    "timestamp": "2025-05-06T18:40:21Z"
  },
  {
    "title": "Supreme Court allows Trump ban on transgender members of the military to take effect, for now",
    "description": "The Supreme Court is allowing President Donald Trump’s administration to enforce a ban on transgender people in the military, while legal challenges proceed",
    "link": "https://www.wftv.com/news/politics/supreme-court-allows/7RAQHFIWKNAQ7FL2CS3NWDZTHE/",
    "timestamp": "2025-05-06T18:39:18Z"
  },
  {
    "title": "Trump critics launch new group to highlight rising costs",
    "description": "NEW YORK, May 6 (Xinhua) -- A bipartisan group of President Donald Trump's critics is launching a new organization, dubbed the Cost Coalition, to highlight Trump's struggle to control rising costs in the early months of his new presidency, reported The Associ…",
    "link": "https://www.thestar.com.my/news/world/2025/05/07/trump-critics-launch-new-group-to-highlight-rising-costs",
    "timestamp": "2025-05-06T18:39:00Z"
  },
  {
    "title": "Donations To Luigi Mangione’s Legal Defense Fund Surpass $1M",
    "description": "More than 28,000 people have donated, organizers of the effort said.",
    "link": "https://www.huffpost.com/entry/luigi-mangione-donations-pass-1-million_n_681a4041e4b0981671adcb5c",
    "timestamp": "2025-05-06T18:37:53Z"
  },
  {
    "title": "Trump’s Tariffs Won’t Make Hollywood Great Again, but There’s a Plan That Can",
    "description": "President Donald Trump says US movie production is “dying.” There’s something that could help, but it isn’t a 100 percent tariff on foreign-produced films.",
    "link": "https://www.wired.com/story/trumps-tariffs-wont-make-hollywood-great-again-but-theres-a-plan-that-can/",
    "timestamp": "2025-05-06T18:37:51Z"
  },
  {
    "title": "JUST IN: Supreme Court Allows Trump Administration to Move Forward With Transgender Military Ban",
    "description": "The Supreme Court on Tuesday ruled that President Donald Trump's administration can move forward with its ban on transgender people in the military.\nThe post JUST IN: Supreme Court Allows Trump Administration to Move Forward With Transgender Military Ban firs…",
    "link": "https://www.mediaite.com/news/just-in-supreme-court-allows-trump-administration-to-move-forward-with-transgender-military-ban/",
    "timestamp": "2025-05-06T18:37:34Z"
  },
  {
    "title": "Watch Mark Carney tell Trump Canada will not be 51st state",
    "description": "President Trump and Canadian Prime Minister Mark Carney met in the Oval Office, where Carney told Mr. Trump that Canada is not for sale​, and never will be.",
    "link": "https://www.cbsnews.com/news/mark-carney-trump-meeting-video-canada-not-for-sale/",
    "timestamp": "2025-05-06T18:35:17Z"
  }
]