[
  {
    "title": "Sen. Amy Klobuchar Beclowns Herself on SNAP Cuts",
    "description": "Pro Tip, Senator Klobuchar: if you want to give people the impression that Donald Trump and the Republicans are looking to starve women and children out of spite, it's better not to put that message out there by dragging out a morbidly obese public employee a…",
    "link": "https://freerepublic.com/focus/f-news/4322765/posts",
    "timestamp": "2025-06-13T05:19:37Z"
  },
  {
    "title": "Jimmy Kimmel Jokes That Trump Seeing ‘Les Misérables’ Is Like ‘Kanye Going to Fiddler on the Roof’ | Video",
    "description": "The ABC host's point being the works in question advance the exact opposite of the politics of Trump or West\nThe post Jimmy Kimmel Jokes That Trump Seeing ‘Les Misérables’ Is Like ‘Kanye Going to Fiddler on the Roof’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-monologue-trump-les-miserables/",
    "timestamp": "2025-06-13T05:18:35Z"
  },
  {
    "title": "Czech government hit with no-confidence vote over $45M Bitcoin scandal",
    "description": "The Czech Republic’s main opposition party has called for a no-confidence vote in the government over the ongoing scandal involving a $45 million Bitcoin payment from a convicted criminal.",
    "link": "https://cointelegraph.com/news/czech-government-no-confidence-vote-bitcoin-scandal",
    "timestamp": "2025-06-13T05:17:22Z"
  },
  {
    "title": "North Korea Rejects Trump's Letter to Kim: Report",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nNorth Korean officials reportedly rejected a letter from U.S. President Donald Trump intended to open the door for dialogue with North Korean supreme leader Kim Jong Un.\nNewsweek reached out to the White House…",
    "link": "https://biztoc.com/x/1846c752644d421f",
    "timestamp": "2025-06-13T05:13:50Z"
  },
  {
    "title": "Trump: Iran cannot have a nuclear bomb",
    "description": "United States President Donald Trump was aware of Israel's strikes beforehand, Fox News reported, citing a phone call held between Trump and the outlet's anchor, Bret Baier.\"Iran cannot have a nuclear...",
    "link": "https://biztoc.com/x/270e79bff4948112",
    "timestamp": "2025-06-13T05:13:35Z"
  },
  {
    "title": "Winning: House Passes Rescissions Bill With Massive Spending Cuts, Package Moves to Senate",
    "description": "On Thursday, the United States House of Representatives narrowly passed the first rescissions package, which will eliminate billions in unnecessary spending by the federal government. The bill will now go to the Senate, where it requires only a simple majorit…",
    "link": "https://freerepublic.com/focus/f-news/4322763/posts",
    "timestamp": "2025-06-13T05:11:12Z"
  },
  {
    "title": "Israel launches strike on Iran’s nuclear facilities – country braced for retaliation",
    "description": "Prime Minister Benjamin Netanyahu called the attack an urgent operation to disrupt Tehran’s imminent plans to build a nuclear weapon",
    "link": "https://www.jewishnews.co.uk/israel-launches-strike-on-irans-nuclear-facilities-country-braced-for-retaliation/",
    "timestamp": "2025-06-13T05:10:36Z"
  },
  {
    "title": "[Live update] Israel targets Iran: IRGC, Iran military chiefs killed, Khamenei threatens revenge\nTehran planning 'a harsh response,' • IDF hits Natanz nuclear site • IDF attacks on Iran expected to continue 'for days at a time'.",
    "description": "Israel targets Iran: IRGC, Iran military chiefs killed, Khamenei threatens revenge Tehran planning 'a harsh response,' Iranian security source says • IDF hits Natanz nuclear site • IDF attacks on Iran expected to continue 'for days at a time'. June 13, 7:24 A…",
    "link": "https://freerepublic.com/focus/f-news/4322762/posts",
    "timestamp": "2025-06-13T05:10:23Z"
  },
  {
    "title": "North Korea Rejects Trump's Letter to Kim: Report",
    "description": "Trump \"remains receptive\" to reengaging with South Korean strongman Kim Jong Un, White House spokesperson Karoline Leavitt said.",
    "link": "https://www.newsweek.com/north-korea-rejects-donald-trump-letter-kim-jong-un-2084586",
    "timestamp": "2025-06-13T05:04:30Z"
  },
  {
    "title": "Israel hits Iran",
    "description": "In today’s edition of The Capitals, read about what’s at stake at the G7, why it may be the ‘worst moment’ to celebrate Schengen as the 40th anniversary approaches, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/2264775/",
    "timestamp": "2025-06-13T05:02:13Z"
  },
  {
    "title": "Israel Launches Massive Airstrikes on Iran's Leaders, Nuclear Sites, Refineries",
    "description": "The Israel Defense Forces (IDF) launched a massive and devastating set of preemptive airstrikes on Iran's leaders, its military, its nuclear sites, and its refineries early Friday morning local time.\nThe post Israel Launches Massive Airstrikes on Iran’s Leade…",
    "link": "https://www.breitbart.com/middle-east/2025/06/12/israel-launches-massive-airstrikes-on-irans-leaders-nuclear-sites-refineries/",
    "timestamp": "2025-06-13T05:00:38Z"
  },
  {
    "title": "Digicel ‘poised to refinance €2bn early’ as it wins highest credit rating in years",
    "description": "Move will be helped by US authorities ending an investigation into phone company",
    "link": "https://www.irishtimes.com/business/2025/06/13/digicel-poised-to-refinance-2bn-early-as-it-wins-highest-credit-rating-in-years/",
    "timestamp": "2025-06-13T05:00:01Z"
  },
  {
    "title": "Justine McCarthy: Humanity might yet prove the species that was too stupid and greedy to save itself",
    "description": "In Ireland, we call it “mé féinism” - but now it’s everywhere. Could people power save us?",
    "link": "https://www.irishtimes.com/opinion/2025/06/13/justine-mccarthy-humanity-might-yet-prove-the-species-that-was-too-stupid-and-greedy-to-save-itself/",
    "timestamp": "2025-06-13T05:00:01Z"
  },
  {
    "title": "Neil Young sounds like a rambling one-man band on Talkin to the Trees",
    "description": "On his 48th album, we find the Godfather of Grunge beetling along heroically/tediously in the same old tyre tracks he’s been stuck in for years",
    "link": "https://www.the-independent.com/arts-entertainment/music/reviews/neil-young-review-talkin-to-the-trees-glastonbury-daryl-hannah-b2768830.html",
    "timestamp": "2025-06-13T05:00:00Z"
  },
  {
    "title": "Market Realities Continue to Mug Faddish ‘Energy Transitions’",
    "description": "Renewable has been the buzzword in the pop language of the energy sector. Two decades have passed since we were first told that weather-dependent wind turbines and solar panels would eclipse long-dependable and readily available coal, oil and natural gas as p…",
    "link": "https://wattsupwiththat.com/2025/06/12/market-realities-continue-to-mug-faddish-energy-transitions/",
    "timestamp": "2025-06-13T05:00:00Z"
  },
  {
    "title": "Never again is now: Netanyahu as Israel launches strikes on Iran's nuclear, missile sites",
    "description": "Israeli Prime Minister Benjamin Netanyahu announces Operation Rising Lion. This is a military campaign against Iran's nuclear and missile programs. Israel has struck Iranian targets. Netanyahu claims Iran is developing nuclear weapons. He compares the situati…",
    "link": "https://economictimes.indiatimes.com/news/defence/never-again-is-now-netanyahu-as-israel-launches-strikes-on-irans-nuclear-missile-sites/articleshow/121818811.cms",
    "timestamp": "2025-06-13T04:56:47Z"
  },
  {
    "title": "Israel chose to act now, whether Trump likes it or not",
    "description": "There has been a growing tension between the leaders over Iran - now the US is distancing itself from Israel's \"unilateral action\".",
    "link": "https://www.bbc.com/news/articles/cwyw04x1kqpo",
    "timestamp": "2025-06-13T04:54:09Z"
  },
  {
    "title": "Israel strikes key Iranian nuclear sites: What we know about Natanz, Fordo, and others",
    "description": "Israel launched a significant attack on Iran, targeting nuclear and military facilities, resulting in explosions in Tehran and the reported deaths of key Iranian figures. This escalation follows rising tensions over Iran's nuclear program, deemed a threat by …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israel-strikes-key-iranian-nuclear-sites-what-we-know-about-natanz-fordo-and-others/articleshow/121818612.cms",
    "timestamp": "2025-06-13T04:49:14Z"
  },
  {
    "title": "As NATO ups defence spending, can Europe produce the weapons?",
    "description": "Brussels, Belgium (AFP) June 13, 2025\n\n\n NATO leaders meeting in The Hague this month look set to agree to a major increase in military budgets under pressure from US President Donald Trump. \n\nBut as Europe promises to ramp up defence spending and wean itself…",
    "link": "https://www.spacewar.com/reports/As_NATO_ups_defence_spending_can_Europe_produce_the_weapons_999.html",
    "timestamp": "2025-06-13T04:49:13Z"
  },
  {
    "title": "US says airstrike killed Islamic State official in Syria",
    "description": "Washington (AFP) June 12, 2025\n\n\n The US military announced Thursday that a recent airstrike had killed an Islamic State group official in northwest Syria. \n\nIn a post to social media, US Central Command (CENTCOM) said its forces \"conducted a precision airstr…",
    "link": "https://www.spacewar.com/reports/US_says_airstrike_killed_Islamic_State_official_in_Syria_999.html",
    "timestamp": "2025-06-13T04:49:13Z"
  },
  {
    "title": "Australia 'confident' in US nuclear sub deal despite review",
    "description": "Sydney (AFP) June 12, 2025\n\n\n Australia said Thursday it is \"very confident\" in the future of a US agreement to equip its navy with a fleet of nuclear-powered submarines, after the Trump administration put the pact under review. \n\nThe 2021 AUKUS deal joins Au…",
    "link": "https://www.spacewar.com/reports/Australia_confident_in_US_nuclear_sub_deal_despite_review_999.html",
    "timestamp": "2025-06-13T04:49:13Z"
  },
  {
    "title": "Rubio warns Iran against targeting US over Israeli strikesearthicbm",
    "description": "Washington (AFP) June 13, 2025\n\n US Secretary of State Marco Rubio warned Iran late Thursday not to respond to Israeli strikes by hitting American bases, saying Washington was not involved. \n\n\"We are not involved in strikes against Iran and our top priority i…",
    "link": "https://www.spacewar.com/reports/Rubio_warns_Iran_against_targeting_US_over_Israeli_strikes_999.html",
    "timestamp": "2025-06-13T04:49:13Z"
  },
  {
    "title": "Appeals Court Lets Trump Keep National Guard for Now",
    "description": "“An appeals court late Thursday allowed President Donald Trump, for now, to keep the California National Guard deployed in response to protests in Los Angeles, blocking a federal judge’s move just hours earlier that ordered",
    "link": "https://politicalwire.com/2025/06/13/appeals-court-lets-trump-keep-national-guard-for-now/",
    "timestamp": "2025-06-13T04:45:04Z"
  },
  {
    "title": "Crude oil futures surge over 9% after Israel strikes Iran’s nuclear and missile sites",
    "description": "Crude oil futures jump over 9% after Israel’s strikes on Iran’s nuclear sites. Brent hits $76.19 as Middle East tensions threaten global oil supply routes.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-surge-israel-strikes-iran-nuclear-sites/article69689962.ece",
    "timestamp": "2025-06-13T04:43:53Z"
  },
  {
    "title": "Woke gender studies student who's now in her ELEVENTH year of college is terrified Trump will deport her",
    "description": "A graduate student fears she won't be able to complete her 11th year of college in America because President Donald Trump might deport her. Oriette D’Angelo, a doctoral student studying Spanish and Gender, Women and Sexuality studies at the University of Iowa…",
    "link": "https://freerepublic.com/focus/f-backroom/4322761/posts",
    "timestamp": "2025-06-13T04:40:57Z"
  },
  {
    "title": "Trump to attend security meeting on Friday after Israeli strikes on Iran",
    "description": "Following Israeli strikes on Iran, which targeted nuclear facilities and military commanders, President Trump will convene a National Security Council meeting. The U.S. is distancing itself from the strikes, prioritizing the protection of American forces. The…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-to-attend-security-meeting-on-friday-after-israeli-strikes-on-iran/articleshow/121818443.cms",
    "timestamp": "2025-06-13T04:40:43Z"
  },
  {
    "title": "What to know about Israel’s major attack on Iran",
    "description": "The attack pushed the region into a new and uncertain phase.",
    "link": "https://www.bostonherald.com/2025/06/13/israel-attack-on-iran-explained/",
    "timestamp": "2025-06-13T04:40:28Z"
  },
  {
    "title": "Air taxi maker Archer raises $850 million after Trump executive order",
    "description": "Air taxi maker Archer Aviation on Thursday said it raised $850 million in funding following executive orders signed by U.S. President Donald Trump to boost electric air taxis.Trump's orders also focused on bolstering U.S. defenses against hostile drones, and …",
    "link": "https://www.channelnewsasia.com/business/air-taxi-maker-archer-raises-850-million-after-trump-executive-order-5179586",
    "timestamp": "2025-06-13T04:40:07Z"
  },
  {
    "title": "Israel hits Iran with 'preemptive' strikes",
    "description": "Israel has launched strikes on Iran, the country's defense minister said. The development comes after US President Donald Trump had warned Israel could soon hit Iran's nuclear sites. DW has the latest. Israel says Iran has launched 100 drones in retaliation\nI…",
    "link": "https://www.dw.com/en/israel-hits-iran-with-preemptive-strikes/live-72891501",
    "timestamp": "2025-06-13T04:40:00Z"
  },
  {
    "title": "Tennessee judge to hear arguments about releasing Kilmar Abrego Garcia from pretrial detention",
    "description": "A Tennessee judge is scheduled to hear arguments about whether Kilmar Abrego Garcia can be released from jail pending the outcome of a federal trial on human smuggling charges",
    "link": "https://abcnews.go.com/Politics/wireStory/tennessee-judge-hear-arguments-releasing-kilmar-abrego-garcia-122804149",
    "timestamp": "2025-06-13T04:38:24Z"
  },
  {
    "title": "Attacking Iran, Israel brazenly defies 'man of peace' Trump",
    "description": "Despite President Trump's pleas for peace and ongoing diplomatic efforts with Iran, Israeli Prime Minister Netanyahu launched a preemptive strike against Iran's nuclear program, creating a significant rift between the two allies.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/attacking-iran-israel-brazenly-defies-man-of-peace-trump/articleshow/121818367.cms",
    "timestamp": "2025-06-13T04:37:48Z"
  },
  {
    "title": "Israel-Iran conflict: Senior US Democrat condemns Tel Aviv's 'reckless escalation'",
    "description": "Senior US Democrats have condemned Israel's recent airstrikes on Iran, labeling them a reckless escalation that threatens regional stability and diplomatic efforts. Senator Jack Reed and others call for restraint from both nations amid escalating tensions.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israel-iran-conflict-senior-us-democrat-condemns-tel-avivs-reckless-escalation-us-president-donald-trumps/articleshow/121818339.cms",
    "timestamp": "2025-06-13T04:37:06Z"
  },
  {
    "title": "Markets plunge over 1% as Israel-Iran tensions spark risk-off sentiment on Friday",
    "description": "Indian markets plunge on Israel-Iran tensions; Sensex falls 860+ points, crude oil surges 12%, gold hits six-week high amid global geopolitical risks.",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/indian-markets-fall-israel-iran-conflict-oil-gold-surge/article69689952.ece",
    "timestamp": "2025-06-13T04:36:31Z"
  },
  {
    "title": "Trump can keep National Guard deployed to Los Angeles for now, appeals court rules (Reuters)",
    "description": "Reuters:\nTrump can keep National Guard deployed to Los Angeles for now, appeals court rules  —  A U.S. appeals court on Thursday allowed President Donald Trump to maintain his deployment of National Guard troops in Los Angeles amid protests over stepped-up im…",
    "link": "https://www.memeorandum.com/250613/p2",
    "timestamp": "2025-06-13T04:35:00Z"
  },
  {
    "title": "EXCLUSIVE Teen robber pays ultimate price for carjacking and mugging spree after targeting concealed carry holder",
    "description": "A teenage armed robber was shot dead when he tried to mug a man minutes after stealing another car from a woman at gunpoint. Daone Feazell, 18, was gunned down in Humboldt Park, on Chicago's West Side, at 10.48pm on Tuesday, ending a brief but violent crime s…",
    "link": "https://freerepublic.com/focus/f-chat/4322757/posts",
    "timestamp": "2025-06-13T04:31:54Z"
  },
  {
    "title": "Ripple, SEC Ask Court to Dissolve XRP Injunction, Release $125M in Escrow",
    "description": "The joint filing proposes a $50 million payment to the SEC and marks a key step toward settling the years-long legal battle over XRP sales.",
    "link": "https://decrypt.co/325015/ripple-sec-ask-court-to-dissolve-xrp-injunction-release-125m-in-escrow",
    "timestamp": "2025-06-13T04:31:12Z"
  },
  {
    "title": "Tennessee judge to hear arguments about releasing Kilmar Abrego Garcia from pretrial detention",
    "description": "A Tennessee judge is scheduled to hear arguments about whether Kilmar Abrego Garcia can be released from jail pending the outcome of a federal trial on human smuggling charges",
    "link": "https://abcnews.go.com/US/wireStory/tennessee-judge-hear-arguments-releasing-kilmar-abrego-garcia-122804147",
    "timestamp": "2025-06-13T04:30:22Z"
  },
  {
    "title": "Trump can keep National Guard deployed to LA for now, appeals court rules",
    "description": "A US appeals court has temporarily blocked a federal judge's order that directed President Donald Trump to return control of National Guard troops to California.",
    "link": "https://www.abc.net.au/news/2025-06-13/trump-can-keep-national-guard-deployed-to-la-for-now/105413678",
    "timestamp": "2025-06-13T04:29:57Z"
  },
  {
    "title": "Israeli strikes on Iran lead to new test of Trump’s ability to deliver on ‘America first’ agenda",
    "description": "Just before the attack, Trump was still hopeful there would be time for diplomacy.",
    "link": "https://www.bostonherald.com/2025/06/13/trump-israel-iran/",
    "timestamp": "2025-06-13T04:29:54Z"
  },
  {
    "title": "Trump tariffs boost US lithium battery manufacturing",
    "description": "US President Donald Trump set up a tariff wall to protect and boost American manufacturing, particularly in key industries like electric EV power batteries and energy storage batteries. By focusing on these two critical sectors, Trump ensured that manufacturi…",
    "link": "https://www.digitimes.com/news/a20250613PD230/lithium-battery-manufacturing-donald-trump-tariffs-tesla.html",
    "timestamp": "2025-06-13T04:28:48Z"
  },
  {
    "title": "Trump is finally getting his chance to try to top France with a grand military parade in DC",
    "description": "US News: Eight years after President Donald Trump was dazzled by a grand military parade down the Champs-Elysees in Paris, he is finally getting a chance to tr.",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-is-finally-getting-his-chance-to-try-to-top-france-with-a-grand-military-parade-in-dc/articleshow/121817628.cms",
    "timestamp": "2025-06-13T04:24:35Z"
  },
  {
    "title": "Trump Reportedly ‘Was Aware’ of Israel’s Plan to Attack Iran Ahead of Time: ‘There Were No Surprises’",
    "description": "Trump was reportedly aware of Israel's plan to attack Iran ahead of time, despite his administration's insistence it had nothing to do with the strikes.\nThe post Trump Reportedly ‘Was Aware’ of Israel’s Plan to Attack Iran Ahead of Time: ‘There Were No Surpri…",
    "link": "https://www.mediaite.com/politics/trump-reportedly-was-aware-of-israels-plan-to-attack-iran-ahead-of-time-there-were-no-surprises/",
    "timestamp": "2025-06-13T04:24:27Z"
  },
  {
    "title": "US still wants talks with Iran on Sunday: US official",
    "description": "Despite a massive attack by Israel on Iran, the United States still aims to proceed with planned talks on Sunday, according to a US official. Oman had scheduled the talks, involving Steve Witkoff, a negotiator close to President Trump.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-still-wants-talks-with-iran-on-sunday-us-official/articleshow/121817827.cms",
    "timestamp": "2025-06-13T04:19:58Z"
  },
  {
    "title": "The Trump vs. Musk battle was inevitable — but once again the president comes out on top",
    "description": "Both men expect to get 100% of what they desire, and a complete coincidence of desires would have turned them into alter egos of each other.",
    "link": "https://nypost.com/2025/06/13/opinion/the-trump-vs-musk-battle-was-inevitable-but-once-again-the-president-comes-out-on-top/",
    "timestamp": "2025-06-13T04:18:54Z"
  },
  {
    "title": "Reader callout: would you buy bitcoin as an investment?",
    "description": "Cryptocurrency prices have surged since the election of Donald Trump as investors bet on market",
    "link": "https://biztoc.com/x/4b8426690c20b1e3",
    "timestamp": "2025-06-13T04:18:34Z"
  },
  {
    "title": "Trump Regains Control Of Troops In L.A. From Newsom Thanks To Appeals Court; Governor Was To Take Command Of National Guard On Friday – Updated",
    "description": "UPDATE, 9:16 PM: Gavin Newsom’s renewed control of the California National Guard didn’t last more than a few hours thanks to a federal appeals court. “The...",
    "link": "https://deadline.com/2025/06/trump-court-ruling-troops-la-newsom-1236432420/",
    "timestamp": "2025-06-13T04:16:00Z"
  },
  {
    "title": "Israel’s Netanyahu banks on TACO Trump as he Launches War on Iran to disrupt Negotiations",
    "description": "Ann Arbor (Informed Comment) - The government led by Israeli Prime Minister Benjamin Netanyahu on Thursday launched a war on Iran, bombing sites related to the latter's civilian nuclear refinement program at Natanz and Fordow but also targeting Tehran apartme…",
    "link": "https://www.juancole.com/2025/06/netanyahu-launches-negotiations.html",
    "timestamp": "2025-06-13T04:15:14Z"
  },
  {
    "title": "Trump can keep National Guard deployed to Los Angeles for now, appeals court rules",
    "description": "A U.S. appeals court has temporarily allowed President Trump to maintain National Guard deployment in Los Angeles amid immigration enforcement protests, pausing a lower court ruling. This decision keeps command with the president for now, pending a hearing on…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-can-keep-national-guard-deployed-to-los-angeles-for-now-appeals-court-rules/articleshow/121817691.cms",
    "timestamp": "2025-06-13T04:14:34Z"
  },
  {
    "title": "Trump is finally getting his chance to try to top France with a grand military parade in DC",
    "description": "Eight years after Donald Trump was dazzled while watching a grand military parade in Paris, the president is finally getting a chance to try to top the spectacle",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-finally-chance-top-france-grand-military-parade-122803968",
    "timestamp": "2025-06-13T04:14:30Z"
  },
  {
    "title": "Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
    "description": "Apple shifts iPhone exports from India to US to avoid high tariffs, with Foxconn sending $4.4 billion worth in 2025.",
    "link": "https://www.thehindubusinessline.com/info-tech/foxconn-sends-97-of-india-iphone-exports-to-us-as-apple-tackles-trumps-tariffs/article69689876.ece",
    "timestamp": "2025-06-13T04:13:31Z"
  },
  {
    "title": "Operation Rising Lion: What we know about Israel's attacks on Iran",
    "description": "Iranian state media reported Revolutionary Guards chief Hossein Salami was among those killed.",
    "link": "https://www.bbc.com/news/articles/cdj9vj8glg2o",
    "timestamp": "2025-06-13T04:13:17Z"
  },
  {
    "title": "가 족같은 트럼프에 저항하라",
    "description": "US Senator Alex Padilla of California was forcibly removed from a news conference and handcuffed as he tried to confront Homeland Security Secretary Kristi Noem. Listen to that and the latest stories on Bloomberg News Now. https://t.co/a8dVyPRAyb— Bloomberg (…",
    "link": "https://ryueyes11.tistory.com/511678",
    "timestamp": "2025-06-13T04:12:02Z"
  },
  {
    "title": "What do we know about Israel's strikes on Iran and what might happen next?",
    "description": "Israel has launched strikes on dozens of targets in Iran, killing members of the country's elite paramilitary unit and nuclear scientists. Here's what we know so far.",
    "link": "https://www.abc.net.au/news/2025-06-13/israel-strikes-on-iran-nuclear-targets-what-do-we-know/105413916",
    "timestamp": "2025-06-13T04:08:48Z"
  },
  {
    "title": "Appeals court allows National Guard deployment to continue",
    "description": "The United States 9th Circuit Court of Appeals has temporarily blocked US District Judge Charles Breyer's order, directing US President Donald Trump to return control of National Guard troops deployed...",
    "link": "https://biztoc.com/x/8cae79bc8d6be7d0",
    "timestamp": "2025-06-13T04:07:21Z"
  },
  {
    "title": "BOJ Is Said to See Inflation Running Stronger Than Expected",
    "description": "Bank of Japan officials see prices rising a little stronger than they expected earlier in the year, a factor that may open the door to discussions over whether to raise interest rates if global trade tensions ease, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/boj-is-said-to-see-inflation-running-stronger-than-expected",
    "timestamp": "2025-06-13T04:06:53Z"
  },
  {
    "title": "Asian shares slide while oil prices surge after Israel's strike on Iran",
    "description": "Asia shares have opened lower while oil prices surged after Israel attacked Iran’s capital early Friday amid tensions over Tehran’s rapidly advancing nuclear program",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-slide-oil-prices-surge-after-israels-122803502",
    "timestamp": "2025-06-13T04:06:31Z"
  },
  {
    "title": "Threat to Rule of Law: Sen. Padilla thrown to Ground, Cuffed at Noem DHS Press Conference",
    "description": "'This isn't just shocking,' said Rep. Jimmy Gomez (D-Calif.). 'It's a threat to the rule of law and democratic accountability.' By Jon Queally. | - ( Commondreams.org ) - Democratic Senator Alex Padilla of California was forcibly removed from a press conferen…",
    "link": "https://www.juancole.com/2025/06/threat-padilla-conference.html",
    "timestamp": "2025-06-13T04:06:11Z"
  },
  {
    "title": "Federal Appeals Court Restores Trump’s Control of Ca. National Guard",
    "description": "Only hours after a federal district judge ordered Trump to return control of the California National Guard to Governor Gavin Newsom, a three judge federal appeals court blocked the lower court‘s order. The Orlando Sentinel reported: The 9th U.S. Circuit Court…",
    "link": "https://dianeravitch.net/2025/06/13/federal-appeals-court-restores-trumps-control-of-ca-national-guard/",
    "timestamp": "2025-06-13T04:05:00Z"
  },
  {
    "title": "How Pete Rose and Donald Trump Are the Dregs of American “Masculinity”",
    "description": "By Robert Lipsyte ( Tomdispatch.com ) - Thanks to our current misbegotten model of manhood, we are once again arguing about this moral question: Should former Cincinnati Reds player and manager Pete Rose be inducted into Baseball’s Hall of Fame? In a sane tim…",
    "link": "https://www.juancole.com/2025/06/manhood-american-maleness.html",
    "timestamp": "2025-06-13T04:04:00Z"
  },
  {
    "title": "Federal Court Rightly Invalidates Trump's Illegal Federalization of California National Guard Troops",
    "description": "Earlier tonight, Federal District Court Judge Charles Breyer issued a ruling against President Donald Trump's federalization of some 4000 California",
    "link": "https://reason.com/volokh/2025/06/13/federal-court-rightly-invalidates-trumps-illegal-federalization-of-california-national-guard-troops/",
    "timestamp": "2025-06-13T04:02:42Z"
  },
  {
    "title": "Palantir: The Intersection of Government and Corporate Power",
    "description": "International Man: Palantir is a data analytics and AI company known for its work with governments, particularly in defense, intelligence, and law enforcement. Critics argue it enables mass surveillance, predictive policing, and military applications. A signi…",
    "link": "https://www.lewrockwell.com/2025/06/doug-casey/palantir-the-intersection-of-government-and-corporate-power/",
    "timestamp": "2025-06-13T04:01:00Z"
  },
  {
    "title": "California Launches Investigation of State Farm for Abusing Fire Victims",
    "description": "California Insurance Commissioner Ricardo Lara launched an official investigation into State Farm for abusive practices against policyholders in the wake of the Palisades Fire and the Eaton Fire in January.\nThe post California Launches Investigation of State …",
    "link": "https://www.breitbart.com/politics/2025/06/12/california-launches-investigation-of-state-farm-for-abusing-fire-victims/",
    "timestamp": "2025-06-13T04:00:49Z"
  },
  {
    "title": "Thank you for letting me be myself again",
    "description": "You may have heard that Sly Stone passed away this week. He and his band recorded some great dancing tunes back in the 1970s. Some say that Sly was disco before Saturday Night Fever and that may be true. One of Sly's biggest hits was &q...",
    "link": "https://www.americanthinker.com/blog/2025/06/thank_you_for_letting_me_by_myself_again.html",
    "timestamp": "2025-06-13T04:00:00Z"
  },
  {
    "title": "Ashli Babbitt Didn’t Have to Die—For Multiple Reasons",
    "description": "On June 6, 2025, the Department of Justice and the estate of Ashli Babbitt signed a settlement in the wrongful death lawsuit filed by Judicial Watch on behalf of Ashli’s family.\r\n\r\nThe man who shot and killed Ashli was Lieutenant Michael Byrd, ...",
    "link": "https://www.americanthinker.com/articles/2025/06/ashli_babbitt_didn_t_have_to_die_for_multiple_reasons.html",
    "timestamp": "2025-06-13T04:00:00Z"
  },
  {
    "title": "Destroying Iran's nuclear weapons is a gift to the Iranian people",
    "description": "The military strike by Israel going on in full force as this article is published. This decisive action to preserve its existence is the height of realism. It is also a golden opportunity for regime change in Tehran. Opinion.",
    "link": "https://www.israelnationalnews.com/news/409918",
    "timestamp": "2025-06-13T03:57:00Z"
  },
  {
    "title": "Trump: I knew of Israel's Iran strikes in advance",
    "description": "Trump tells Fox News he was aware of Israel’s strikes in Iran beforehand but emphasizes the US was not militarily involved: \"We will defend Israel if necessary.\"",
    "link": "https://www.israelnationalnews.com/news/409917",
    "timestamp": "2025-06-13T03:56:00Z"
  },
  {
    "title": "Appeals court temporarily blocks judge’s ruling to return control of National Guard to California",
    "description": "The court said it would hold a hearing on the matter on June 17.",
    "link": "https://www.pbs.org/newshour/politics/appeals-court-temporarily-blocks-judges-ruling-to-return-control-of-national-guard-to-california",
    "timestamp": "2025-06-13T03:54:41Z"
  },
  {
    "title": "Appeals court temporarily blocks judge's ruling to return control of National Guard to California",
    "description": "The 9th U.S. Circuit Court of Appeals has temporarily blocked a federal judge’s order that directed President Donald Trump to return control of National Guard troops to California after he deployed them there following protests in Los Angeles over immigration…",
    "link": "https://www.wsbtv.com/news/national/appeals-court/62UJANZ3GJHPXFXCACK2LTRGP4/",
    "timestamp": "2025-06-13T03:53:22Z"
  },
  {
    "title": "Iran-Israel War: Why Israel bombed Iran’s nuclear sites and what it means for global security, oil, and trade",
    "description": "Iran-Israel War news: In a dramatic escalation, Israel launched Operation Rising Lion, striking nuclear and military infrastructure deep within Iran, citing concerns over Iran's nuclear weapons program. Prime Minister Netanyahu declared it a necessary act for…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/iran-israel-war-why-israel-bombed-irans-nuclear-sites-and-what-it-means-for-global-security-oil-and-trade/articleshow/121817049.cms",
    "timestamp": "2025-06-13T03:52:28Z"
  },
  {
    "title": "Did Israel Just \"Blow Up\" Trump's Bid For an Iran Nuke Deal?",
    "description": "On Thursday, Trump said he worried a strike might sink negotiations — or maybe it would help! What Netanyahu wants seems obvious.\nThe post Did Israel Just “Blow Up” Trump’s Bid For an Iran Nuke Deal? appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/12/israel-iran-attack-trump-nuke-deal/",
    "timestamp": "2025-06-13T03:51:17Z"
  },
  {
    "title": "Akazawa sees a deal with U.S. sparing Japan from higher car levies",
    "description": "Akazawa heads to the U.S. as the two nations eye a potential trade deal out of an expected summit in Canada between Trump and Prime Minister Shigeru Ishiba.",
    "link": "https://www.japantimes.co.jp/business/2025/06/13/akazawa-sixth-trade-talks-tariffs/",
    "timestamp": "2025-06-13T03:50:00Z"
  },
  {
    "title": "Sinister George Soros anti-ICE ‘plot’ emerges amid LA riots… as ‘paid’ foreign agitators are finally exposed.",
    "description": "With thanks to the Daily Mail for having brought this issue to our attention. \nArticle by James Reinl\n“President Donald Trump‘s claim that ‘paid agitators’ are wreaking havoc in Los Angeles has raised questions about the protest groups …\nThe post Sinister Geo…",
    "link": "https://www.globalresearch.ca/sinister-george-soros-anti-ice-plot-emerges-amid-la-riots-as-paid-foreign-agitators-are-finally-exposed/5890726",
    "timestamp": "2025-06-13T03:49:56Z"
  },
  {
    "title": "Trump says 'changes' are coming to immigration enforcement after complaints from farmers and the hospitality industry",
    "description": "There may be some changes coming to the Trump administration's approach to immigration enforcement. President Donald Trump said in a Truth Social post on Thursday that both farmers and \"people in the Hotel and Leisure business\" have said that his approach to …",
    "link": "https://freerepublic.com/focus/f-news/4322753/posts",
    "timestamp": "2025-06-13T03:48:31Z"
  },
  {
    "title": "Uyghur Forced Labor Continues to Plague Global Supply Chains",
    "description": "Several reports over the past two weeks have shed light on the ongoing human rights issue of Uyghur forced labor and its impact on global supply chains. The most recent report was published on Wednesday, as Donald Trump and Xi Jinping agreed to a trade deal t…",
    "link": "https://chinadigitaltimes.net/2025/06/uyghur-forced-labor-continues-to-plague-global-supply-chains/",
    "timestamp": "2025-06-13T03:47:26Z"
  },
  {
    "title": "Akazawa Sees a Deal With US Sparing Japan From Higher Car Levies",
    "description": "Japan’s top trade negotiator expects a trade deal with the US to spare Tokyo from higher auto tariffs, even if US President Donald Trump decides to increase them against other nations.",
    "link": "https://financialpost.com/pmn/business-pmn/akazawa-sees-a-deal-with-us-sparing-japan-from-higher-car-levies",
    "timestamp": "2025-06-13T03:46:28Z"
  },
  {
    "title": "Trump Administration Seeks To Distance US From Israeli Strikes On Iran",
    "description": "Marco Rubio, Trump's secretary of state and national security adviser, stressed that Israel's strikes were unilateral.",
    "link": "https://www.huffpost.com/entry/trump-admin-distances-us-israel-strikes_n_684b9dc5e4b0c4fd78ff8245",
    "timestamp": "2025-06-13T03:45:14Z"
  },
  {
    "title": "With Israel Strike, Mark Levin Wins MAGA Battle Over Trump's Iran Policy",
    "description": "When Israel struck Iran, it also capped a long-running power struggle within Trump's inner circle.",
    "link": "https://www.newsweek.com/mark-levin-trump-maga-iran-israel-strike-2084905",
    "timestamp": "2025-06-13T03:43:41Z"
  },
  {
    "title": "Oil surges, stocks fall on Middle East fears as Israel strikes Iran",
    "description": "Oil prices soared more than 12 percent and stocks sank Friday after Israel launched \"preemptive\" strikes on Iranian nuclear and military sites and warned of ...",
    "link": "https://finance.yahoo.com/news/oil-surges-stocks-fall-middle-022051146.html",
    "timestamp": "2025-06-13T03:36:52Z"
  },
  {
    "title": "Senior US Democrat condemns Israel’s ‘reckless escalation’",
    "description": "Democratic senators sharply criticized US ally Israel on Thursday for its strikes on Iran, as the White House distanced itself from the attack but Republican senators voiced gratitude to Israel. “Israel’s alarming decision to launch airstrikes on Iran is a re…",
    "link": "https://www.digitaljournal.com/world/senior-us-democrat-condemns-israels-reckless-escalation/article",
    "timestamp": "2025-06-13T03:32:20Z"
  },
  {
    "title": "Police officers file civil lawsuit seeking court order to hang Jan. 6 plaque at U.S. Capitol",
    "description": "Two police officers who defended the Capitol during the Jan. 6, 2021 attack filed a federal civil lawsuit, asking a judge to order the hanging of a plaque to honor police heroes who protected the Capitol, lawmakers and staff from rioters. The lawsuit cites a …",
    "link": "https://freerepublic.com/focus/f-news/4322749/posts",
    "timestamp": "2025-06-13T03:32:07Z"
  },
  {
    "title": "‘May God Bless the Forces of Civilization’: Netanyahu Announces Operation ‘Rising Lion’ to Roll Back Iranian Threat",
    "description": "Following the launch of Operation Rising Lion — Israel’s military campaign targeting Iran’s nuclear and missile infrastructure — Prime Minister Benjamin Netanyahu vowed decisive action, declaring Friday that the Jewish State will continue striking Iran “as lo…",
    "link": "https://www.breitbart.com/politics/2025/06/12/netanyahu-announces-operation-rising-lion-roll-back-iranian-threat/",
    "timestamp": "2025-06-13T03:28:16Z"
  },
  {
    "title": "‘I Fully Support This Attack’: John Fetterman Encourages Israel to ‘Keep Wiping Out’ Iranians",
    "description": "Sen. John Fetterman (D-PA) encouraged Israel to \"keep wiping out\" Iranian scientists and military officials after the country launched an attack on Iran.\nThe post ‘I Fully Support This Attack’: John Fetterman Encourages Israel to ‘Keep Wiping Out’ Iranians fi…",
    "link": "https://www.mediaite.com/politics/i-fully-support-this-attack-john-fetterman-encourages-israel-to-keep-wiping-out-iranians/",
    "timestamp": "2025-06-13T03:27:10Z"
  },
  {
    "title": "Donald Trump’s antics may work with Elon Musk, but not with China",
    "description": "Trump’s tactics may work against Elon Musk given that his administration has leverage over Musk’s critical business activities. But with China, it does not.",
    "link": "https://www.japantimes.co.jp/commentary/2025/06/13/world/trump-musk-china/",
    "timestamp": "2025-06-13T03:25:00Z"
  },
  {
    "title": "Australian dollar dives as Israel's strike on Iran shakes markets",
    "description": "The Australian dollar falls heavily against the US dollar, losing 1 per cent against the greenback in the space of a couple of hours on the news of Israel's air strikes on Iran. The Aussie is often seen as a proxy for global financial and political instabilit…",
    "link": "https://www.abc.net.au/news/2025-06-13/australian-dollar-dives-israel-iran-strike-geopolitical-markets/105413386",
    "timestamp": "2025-06-13T03:24:21Z"
  },
  {
    "title": "5 things to know about Alexandr Wang, the buzzy Scale AI founder",
    "description": "Mark Zuckerberg's biggest bet on Meta AI will ride on the back of a fellow dropout who has dazzled Silicon Valley over the last decade.",
    "link": "https://www.businessinsider.com/alexandr-wang-scale-ai-meta-zuckerberg-mit-dropout-net-worth-2025-6",
    "timestamp": "2025-06-13T03:23:03Z"
  },
  {
    "title": "Iran vows ‘severe punishment’ for Israeli attack",
    "description": "Iran has promised to retaliate after Israel bombed its territory Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619069-iran-vow-israel-revenge/",
    "timestamp": "2025-06-13T03:16:18Z"
  },
  {
    "title": "President Donald Trump to visit Pittsburgh for innovation summit with Senator McCormick",
    "description": "President Donald Trump is set to visit Pittsburgh to attend an innovation summit with Senator David McCormick.",
    "link": "https://www.wpxi.com/news/local/president-donald-trump-visit-pittsburgh-innovation-summit-with-senator-mccormick/EO5DCTZUURAQFGXMM4Q2C5ZEAM/",
    "timestamp": "2025-06-13T03:15:55Z"
  },
  {
    "title": "Trump Told Netanyahu Not To Attack Iran: WSJ",
    "description": "The call went unheeded.\nThe post Trump Told Netanyahu Not To Attack Iran: WSJ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-told-netanyahu-not-to-attack-iran-wsj/",
    "timestamp": "2025-06-13T03:15:06Z"
  },
  {
    "title": "Iran accuses US of 'supporting' Israel in carrying out strikes on Tehran's nuclear sites",
    "description": "Iran accused the United States of supporting Israeli military strikes on its nuclear sites. This happened after Israel launched a preemptive strike on Iranian nuclear and military locations. The US denied involvement, with Senator Rubio emphasizing their prio…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-accuses-us-of-supporting-israel-in-carrying-out-strikes-on-tehrans-nuclear-sites/articleshow/121816398.cms",
    "timestamp": "2025-06-13T03:12:46Z"
  },
  {
    "title": "Israel strikes Iran: What we know",
    "description": "JERUSALEM: Israel said on Friday (Jun 13) it had carried out strikes on Iranian nuclear and military sites, promising to continue military action \"to remove this threat.\" The strikes h",
    "link": "https://www.channelnewsasia.com/world/israel-strikes-iran-what-we-know-5179376",
    "timestamp": "2025-06-13T03:12:00Z"
  },
  {
    "title": "The road ahead after the NCAA settlement comes with risk, reward and warnings",
    "description": "Two days after the approval of a groundbreaking $2.8 billion antitrust settlement, thousands of athletic directors and department personnel traveled to Orlando, Florida, for the annual National Association of Collegiate Directors of Athletics convention.",
    "link": "https://www.nbcsports.com/college-football/news/the-road-ahead-after-the-ncaa-settlement-comes-with-risk-reward-and-warnings",
    "timestamp": "2025-06-13T03:06:36Z"
  },
  {
    "title": "Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
    "description": "Between March and May, 97% of iPhones exported from India by Foxconn were shipped to the U.S., highlighting Apple’s move to bypass U.S. tariffs on China. Exports hit $3.2 billion in that period. Apple is rapidly scaling Indian production, with made-in-India i…",
    "link": "https://economictimes.indiatimes.com/tech/technology/foxconn-sends-97-of-india-iphone-exports-to-us-as-apple-tackles-trumps-tariffs/articleshow/121816444.cms",
    "timestamp": "2025-06-13T03:05:58Z"
  },
  {
    "title": "After Trump feud, role of Musk's SpaceX in Golden Dome missile shield in question",
    "description": "A new framework for the U.S. missile defense system is now being considered that could reduce the role of Elon Musk's SpaceX.",
    "link": "https://www.japantimes.co.jp/news/2025/06/13/world/trump-musk-feud-golden-dome/",
    "timestamp": "2025-06-13T03:04:00Z"
  },
  {
    "title": "Walmart distances itself from Christy Walton’s ad supporting anti-Trump protest movement",
    "description": "Walmart clarified its stance after heiress Christy Walton funded a newspaper ad urging civic action tied to protests against President Donald Trump. The company emphasized Walton’s actions were independent and unrelated to any corporate involvement, amid crit…",
    "link": "https://economictimes.indiatimes.com/news/international/us/walmart-distances-itself-from-christy-waltons-ad-supporting-anti-trump-protest-movement/articleshow/121816289.cms",
    "timestamp": "2025-06-13T03:01:14Z"
  },
  {
    "title": "Trump Can And Should Fire Fed Boss Over Economy",
    "description": "Trump Can And Should Fire Fed Boss Over Economy\n \nAuthored by Christian Whiton via RealClearPolitics,\nFederal Reserve kingpin Jerome Powell is busy doing what he does best: sabotaging a prosperous economy so that President Donald Trump and his fellow Republic…",
    "link": "https://biztoc.com/x/ac5d56c6bfc2a9ae",
    "timestamp": "2025-06-13T03:00:50Z"
  }
]