[
  {
    "title": "Iran is already a cauldron as US ramps up temperature",
    "description": "Under the threat of US forces building up in the region, Tehran is attempting to project strength and unity. But seething popular anger has not abated in the weeks following a government crackdown that killed thousands of protesters, according to accounts fro…",
    "link": "https://www.independent.ie/world-news/iran-is-already-a-cauldron-as-us-ramps-up-temperature/a1161513755.html",
    "timestamp": "2026-02-20T05:30:00Z"
  },
  {
    "title": "Tony Blair praises US president ‘for seeing Gaza’s potential’",
    "description": "Former British prime minister Tony Blair praised US president Donald Trump for recognising Gaza’s potential during the inaugural meeting of the Board of Peace.",
    "link": "https://www.independent.ie/world-news/britain/tony-blair-praises-us-president-for-seeing-gazas-potential/a1471507937.html",
    "timestamp": "2026-02-20T05:30:00Z"
  },
  {
    "title": "Tehran must do a deal or face ‘bad things’ within 10 days, Donald Trump says",
    "description": "US president Donald Trump warned Iran on Thursday that it must reach a deal over its nuclear programme or “bad things” will happen and appeared to set a 10-day deadline before the US might take action.",
    "link": "https://www.independent.ie/world-news/north-america/tehran-must-do-a-deal-or-face-bad-things-within-10-days-donald-trump-says/a1049277170.html",
    "timestamp": "2026-02-20T05:30:00Z"
  },
  {
    "title": "Searches continue after Andrew's release from custody",
    "description": "Detectives will continue their searches of Andrew Mountbatten-Windsor's former home in Berkshire following his release from custody after he was arrested on suspicion of misconduct in public office.",
    "link": "https://www.rte.ie/news/2026/0220/1559444-andrew-arrest-searches/",
    "timestamp": "2026-02-20T05:25:54Z"
  },
  {
    "title": "UK may consider law to remove Andrew from succession",
    "description": "A law to remove Andrew Mountbatten-Windsor from the line of succession will be considered by the UK government after police finish investigating the King's brother, it is understood.",
    "link": "https://www.rte.ie/news/uk/2026/0220/1559444-andrew-arrest-searches/",
    "timestamp": "2026-02-20T05:25:54Z"
  },
  {
    "title": "The Bezos-Musk rivalry and the changing power of media",
    "description": "Elon Musk knows something Jeff Bezos doesn’t. Each has had turns as the world’s richest man, and both are media overlords. But whereas Musk’s purchase of Twitter arguably won a presidential election and briefly put the fate of the United States federal govern…",
    "link": "https://freerepublic.com/focus/f-news/4367556/posts",
    "timestamp": "2026-02-20T05:24:34Z"
  },
  {
    "title": "Alien files incoming: Trump orders government release of UFO records",
    "description": "President Donald Trump said on Thursday he would direct federal agencies to begin releasing government files ‌related to aliens and unidentified flying objects, pointing to what he described as strong public interest in the issue. In a social media post, Trum…",
    "link": "https://japantoday.com/category/world/alien-files-incoming-trump-orders-government-release-of-ufo-records1",
    "timestamp": "2026-02-20T05:22:06Z"
  },
  {
    "title": "Trump Compares his Gaza Peace Plan to the Melania Movie, and he is Right",
    "description": "Trump's Gaza plans have no concrete reality, consisting of a mere Potemkin Village:  the 2.3 million Palestinians in Gaza are sleeping rough",
    "link": "https://www.juancole.com/2026/02/trump-compares-melania.html",
    "timestamp": "2026-02-20T05:15:07Z"
  },
  {
    "title": "Trump says he's declassifying files about aliens and UFOs. That's going to make some longtime betters on Polymarket very rich.",
    "description": "Trump says he'll release UFO files. Alien bettors on Polymarket have been wagering millions on government confirmation.",
    "link": "https://www.businessinsider.com/trump-declassified-ufo-alien-files-betters-polymarket-2026-2",
    "timestamp": "2026-02-20T05:12:29Z"
  },
  {
    "title": "Heavy end to week as big stocks drag sharemarket 1% lower – Market close",
    "description": "The NZ sharemarket reversed most gains made on Thursday after mixed company results.",
    "link": "https://www.nzherald.co.nz/business/markets/shares/heavy-end-to-week-as-big-stocks-drag-sharemarket-1-lower-market-close/premium/BUSDAQG5IFALXPO4ILOZNWFENA/",
    "timestamp": "2026-02-20T05:11:33Z"
  },
  {
    "title": "Seth Meyers’ Eerily Accurate Prediction About Trump Teasing UFOs to Distract From Epstein Files Resurfaces | Video",
    "description": "\"They’re so desperate to distract everyone,” the \"Late Night\" host said seven months ago in a clip about the president and aliens\nThe post Seth Meyers’ Eerily Accurate Prediction About Trump Teasing UFOs to Distract From Epstein Files Resurfaces | Video appea…",
    "link": "https://www.thewrap.com/industry-news/business/seth-meyers-donald-trump-ufos-epstein-files-resurfaces-video/",
    "timestamp": "2026-02-20T05:10:54Z"
  },
  {
    "title": "Working for a Nuclear-Free Future, or 85 Seconds to My Own Midnight?",
    "description": "The Bulletin of the Atomic Scientists just moved its Doomsday Clock to 85 seconds to nuclear midnight, four seconds closer than ever before.",
    "link": "https://www.juancole.com/2026/02/working-nuclear-midnight.html",
    "timestamp": "2026-02-20T05:04:19Z"
  },
  {
    "title": "CLARITY Act On Track For April Passage, Senator Says",
    "description": "US lawmakers and crypto leaders say a major bill could move fast. According to an on-site interview, Senator Bernie Moreno told reporters he hopes the US CLARITY Act will clear Congress by April. Related Reading: Crypto Lobby Group Sounds Alarm Over Senate’s …",
    "link": "https://bitcoinist.com/clarity-act-on-track-for-april-passage-senator-says/",
    "timestamp": "2026-02-20T05:00:27Z"
  },
  {
    "title": "Trump Directs US Government To Prepare Release of Files on Aliens and UFOs",
    "description": "US President Donald Trump says he will direct US agencies, including the defence department, to \"begin the process of identifying and releasing\" government files on aliens and extraterrestrial life. From a report: Trump made the declaration in a post on Truth…",
    "link": "https://news.slashdot.org/story/26/02/20/0450230/trump-directs-us-government-to-prepare-release-of-files-on-aliens-and-ufos",
    "timestamp": "2026-02-20T05:00:00Z"
  },
  {
    "title": "Iran war clouds, FII exodus drag Indian markets; IT stocks bleed as crude surges",
    "description": "Sensex opened at 82,272.49 and Nifty 50 opened at around 25,400",
    "link": "https://www.thehindubusinessline.com/markets/iran-war-clouds-fii-exodus-drag-indian-markets-it-stocks-bleed-as-crude-surges/article70654732.ece",
    "timestamp": "2026-02-20T04:58:07Z"
  },
  {
    "title": "Indonesia's Prabowo voices support for Trump's Gaza peace plan",
    "description": "Indonesian President Prabowo Subianto expressed full support for the 20-point Gaza peace plan initiated by US President Donald Trump at the inaugural meeting ...",
    "link": "https://en.antaranews.com/news/405206/indonesias-prabowo-voices-support-for-trumps-gaza-peace-plan",
    "timestamp": "2026-02-20T04:55:08Z"
  },
  {
    "title": "Stacey Abrams: 'This Is a Country that Is in the Midst of an Authoritarian Takeover'",
    "description": "Thursday on MS NOW's \"All In,\" former Georgia State Representative Stacey Abrams said President Donald Trump is leading an \"authoritarian takeover.\"\nThe post Stacey Abrams: ‘This Is a Country that Is in the Midst of an Authoritarian Takeover’ appeared first o…",
    "link": "https://www.breitbart.com/clips/2026/02/19/stacey-abrams-this-is-a-country-that-is-in-the-midst-of-an-authoritarian-takeover/",
    "timestamp": "2026-02-20T04:54:23Z"
  },
  {
    "title": "Trump Warns Of 'Bad Things' If Iran Doesn't Make A Deal, As Second U.S. Carrier Nears Mideast",
    "description": "Iran held annual military drills with Russia as a second American aircraft carrier drew closer to the Middle East.",
    "link": "https://www.huffpost.com/entry/trump-iran_n_6997e4f8e4b041f92b3f09cb",
    "timestamp": "2026-02-20T04:47:39Z"
  },
  {
    "title": "The US is offering Iran a lifeline – will it take it?",
    "description": "The talks are still alive. Just. Iranian and US diplomats, engaging indirectly through Omani intermediaries, have yet to make any substantive progress towards a framework of understanding that governs further talks – as Kafkaesque as that might sound – but th…",
    "link": "https://freerepublic.com/focus/f-news/4367552/posts",
    "timestamp": "2026-02-20T04:40:01Z"
  },
  {
    "title": "Custodia CEO Says Trump Family Crypto Ties Are Part of Clarity Act Problem",
    "description": "At ETH Denver, Caitlin Long said the ethics controversy around Trump-linked crypto projects has complicated Senate support.",
    "link": "https://decrypt.co/358695/custodia-ceo-trump-family-crypto-ties-clarity-act-problem",
    "timestamp": "2026-02-20T04:36:25Z"
  },
  {
    "title": "Banner of Donald Trump unfurled at Justice Department headquarters",
    "description": "WASHINGTON, Feb 19 (Reuters) - A ⁠banner of U.S. President Donald Trump has been unfurled outside the headquarters of the Justice ⁠Department in the latest effort to stamp his identity on a Washington institution. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/20/banner-of-donald-trump-unfurled-at-justice-department-headquarters",
    "timestamp": "2026-02-20T04:34:00Z"
  },
  {
    "title": "Hakeem Jeffries: Trump 'Doesn't Know What He's Doing Anymore'",
    "description": "Thursday on MS NOW's \"The Briefing,\" House Minority Leader Hakeem Jeffries (D-NY) claimed President Donald Trump didn't \"know what he's doing anymore.\"\nThe post Hakeem Jeffries: Trump ‘Doesn’t Know What He’s Doing Anymore’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/02/19/hakeem-jeffries-trump-doesnt-know-what-hes-doing-anymore/",
    "timestamp": "2026-02-20T04:31:55Z"
  },
  {
    "title": "Amanda Carpenter: Americans Are Rejecting Trump's 'Propaganda Presidency'",
    "description": "Thursday on MS NOW's \"Deadline,\" political commentator Amanda Carpenter claimed Americans are rejecting President Donald Trump's \"propaganda presidency.\"\nThe post Amanda Carpenter: Americans Are Rejecting Trump’s ‘Propaganda Presidency’ appeared first on Brei…",
    "link": "https://www.breitbart.com/clips/2026/02/19/amanda-carpenter-americans-are-rejecting-trumps-propaganda-presidency/",
    "timestamp": "2026-02-20T04:30:11Z"
  },
  {
    "title": "Historian flags part of American society Trump made irrelevant: 'Flipped it on its head'",
    "description": "President Donald Trump appears to have made one key part of American society irrelevant, according to one historian. Trump has repeatedly attacked American institutions like the judicial branch and Congress in an effort to impose his will. He has also called …",
    "link": "https://www.rawstory.com/trump-2675287221/",
    "timestamp": "2026-02-20T04:28:17Z"
  },
  {
    "title": "\"Going to put 200% tariffs, if you fight\": Trump reiterates India-Pakistan \"ceasefire\" claim",
    "description": "Speaking at his Board of Peace, Trump also increased the number of jets that were shot down during the conflict, raising the total from 8 to 11",
    "link": "https://www.thehindubusinessline.com/news/going-to-put-200-tariffs-if-you-fight-trump-reiterates-india-pakistan-ceasefire-claim/article70654706.ece",
    "timestamp": "2026-02-20T04:27:29Z"
  },
  {
    "title": "Fetterman on Iran: You can't negotiate with cancer",
    "description": "Senator John Fetterman speaks out against a potential Iran deal, calling the country a “cancer\" and urging the US to take forceful action to prevent Iran from acquiring nuclear weapons.",
    "link": "https://www.israelnationalnews.com/news/422712",
    "timestamp": "2026-02-20T04:18:17Z"
  },
  {
    "title": "Pam spam",
    "description": "We will wake up someday soon and kick ourselves for breaking down and ignoring laws, rules and order at every turn.",
    "link": "https://www.ncspin.com/pam-spam",
    "timestamp": "2026-02-20T04:14:03Z"
  },
  {
    "title": "Trump Wants An Airport Renamed After Him While His Company Trademarks Those Same Names",
    "description": "Remember how Donald Trump was going to drain the swamp as president? The idea, spilling out from his first campaign for president, was that Washington was horribly corrupt, that politicians and unelected government stooges were making money from their positio…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180829858",
    "timestamp": "2026-02-20T04:13:06Z"
  },
  {
    "title": "Fact Check: Seattle Seahawks Did NOT Decline a White House Invitation",
    "description": "Did the Super Bowl champion Seattle Seahawks refuse an invitation to the White House? No, that's not true: There's no evidence the team has been invited to Washington for a reception with President Donald Trump or that the team has...",
    "link": "https://leadstories.com/hoax-alert/2026/02/fact-check-seattle-seahawks-did-not-decline-a-white-house-invitation.html",
    "timestamp": "2026-02-20T04:11:51Z"
  },
  {
    "title": "Trump Wants An Airport Renamed After Him While His Company Trademarks Those Same Names",
    "description": "Remember how Donald Trump was going to “drain the swamp” as president? The idea, spilling out from his first campaign for president, was that Washington was horribly corrupt, that politicians and unelected government stooges were making money from their posit…",
    "link": "https://www.techdirt.com/2026/02/19/trump-wants-an-airport-renamed-after-him-while-his-company-trademarks-those-same-names/",
    "timestamp": "2026-02-20T04:08:15Z"
  },
  {
    "title": "Texas' Senate primary race between Crockett and Talarico ramps up after pulled Colbert interview",
    "description": "Democratic Rep. Jasmine Crockett of Texas is urging supporters to look at experience in a heated U.S. Senate primary with state Rep. James Talarico as he rides on wider attention thanks to late-night host Stephen Colbert",
    "link": "https://abcnews.com/Politics/wireStory/texas-senate-primary-race-crockett-talarico-ramps-after-130322147",
    "timestamp": "2026-02-20T04:05:29Z"
  },
  {
    "title": "Trump Pledges to Release the Alien Files: 'Extremely Interesting'",
    "description": "President Donald Trump announced on Thursday that he will be releasing all government files related to UFOs and aliens.\nThe post Trump Pledges to Release the Alien Files: ‘Extremely Interesting’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/02/19/trump-pledges-release-alien-files-extremely-interesting/",
    "timestamp": "2026-02-20T04:05:09Z"
  },
  {
    "title": "James Comer Claims ‘Trump Is Completely Exonerated’ by the Epstein Files",
    "description": "House Oversight Committee chair James Comer (R-KY) told Fox News host Sean Hannity that President Donald Trump was “completely exonerated” of wrongdoing in the documents relating to convicted sex offender Jeffrey Epstein. Comer joined Thursday’s edition of Ha…",
    "link": "https://www.mediaite.com/media/news/james-comer-claims-trump-is-completely-exonerated-by-the-epstein-files/",
    "timestamp": "2026-02-20T03:53:48Z"
  },
  {
    "title": "India attends Trump's Board of Peace meeting as observer nation",
    "description": "Trump announced that the US will commit $10 billion to the Board, whose members include 27 nations such as Argentina, Armenia, Azerbaijan, Hungary, Pakistan, Saudi Arabia and the UAE",
    "link": "https://www.thehindubusinessline.com/news/india-attends-trumps-board-of-peace-meeting-as-observer-nation/article70654648.ece",
    "timestamp": "2026-02-20T03:52:24Z"
  },
  {
    "title": "Donald Trump Calls Andrew Mountbatten-Windsor's Arrest 'So Bad for the Royal Family'",
    "description": "US President Trump calls Andrew Mountbatten-Windsor's arrest, which took place Thursday, a \"shame\" and \"very sad.\"",
    "link": "https://www.ibtimes.com.au/donald-trump-calls-andrew-mountbatten-windsors-arrest-so-bad-royal-family-1861771",
    "timestamp": "2026-02-20T03:50:23Z"
  },
  {
    "title": "Trump claims he'll order agencies to begin releasing records on aliens, UFOs",
    "description": "U.S. President Donald Trump said ‌on Thursday he would direct federal agencies to begin releasing government files related to aliens and unidentified flying objects, citing what he described as strong public interest in the issue.",
    "link": "https://www.cbc.ca/news/world/trump-ufo-records-9.7098654",
    "timestamp": "2026-02-20T03:50:00Z"
  },
  {
    "title": "Trump mulls preliminary limited strike on Iran to force nuclear deal, report says",
    "description": "RECAP: Trump Mulls Limited Preliminary Strike on Iran to Pressure Nuclear Deal, Report Says. Iran Tells UN Chief It Will Respond 'Decisively' if Subjected to Military Aggression. Trump Mulls Preliminary Limited Strike on Iran to Force Nuclear Deal, Report Says",
    "link": "https://www.haaretz.com/israel-news/2026-02-20/ty-article-live/trump-mulls-preliminary-limited-strike-on-iran-to-force-nuclear-deal-report-says/0000019c-791d-dfbe-a39f-797f41120000",
    "timestamp": "2026-02-20T03:49:13Z"
  },
  {
    "title": "Trump Boasts About Melania’s Film Success but Insists There’s ‘Not Room in One Family for Two Stars’",
    "description": "“She has a very successful movie out right now, like number one. Can you believe this?” the president says\nThe post Trump Boasts About Melania’s Film Success but Insists There’s ‘Not Room in One Family for Two Stars’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/culture-lifestyle/culture/trump-boasts-about-melanias-film-success-but-insists-theres-not-room-in-one-family-for-two-stars/",
    "timestamp": "2026-02-20T03:42:32Z"
  },
  {
    "title": "Grandmother urges voters to abandon party loyalty after defending Trump at Black History Month event",
    "description": "Forlesia Cook, who lost grandson to gun violence, urges voters to choose causes over party loyalty in America while defending President Trump against racism allegations.",
    "link": "https://www.foxnews.com/media/grandmother-urges-voters-abandon-party-loyalty-after-defending-trump-black-history-month-event",
    "timestamp": "2026-02-20T03:38:35Z"
  },
  {
    "title": "Alien files incoming: Trump orders government release of UFO records",
    "description": "In a social media post, Trump said he would order ‌Pentagon chief Pete Hegseth and other agencies to release the information, calling the matter \"extremely interesting and important”",
    "link": "https://www.thehindubusinessline.com/news/world/alien-files-incoming-trump-orders-government-release-of-ufo-records/article70654625.ece",
    "timestamp": "2026-02-20T03:37:57Z"
  },
  {
    "title": "US Market | Investors eye policy signals that could shape Wall Street’s next move",
    "description": "Global markets, especially Wall Street, are keenly awaiting the IMF's annual review of U.S. economic policies, due February 25. The assessment will scrutinize fiscal sustainability, trade imbalances, and the dollar's global standing. Elevated U.S. deficits fo…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-market-investors-eye-policy-signals-that-could-shape-wall-streets-next-move/articleshow/128589187.cms",
    "timestamp": "2026-02-20T03:37:45Z"
  },
  {
    "title": "Gold steadies near $5,000 as Iran risks, Fed outlook in focus",
    "description": "The gold market has been volatile since a historic rout at the start of the month, with bullion dropping from a record peak above $5,595 an ounce to nearly $4,400 in just two days",
    "link": "https://www.bloomberg.com/news/articles/2026-02-19/gold-steadies-near-5-000-as-iran-risks-fed-outlook-in-focus",
    "timestamp": "2026-02-20T03:35:42Z"
  },
  {
    "title": "Prabowo reaffirms Indonesia's commitment to Palestinian peace",
    "description": "President Prabowo Subianto reaffirmed Indonesia&rsquo;s support for Palestinian peace through active participation in the Board of Peace (BoP), ...",
    "link": "https://en.antaranews.com/news/405194/prabowo-reaffirms-indonesias-commitment-to-palestinian-peace",
    "timestamp": "2026-02-20T03:35:18Z"
  },
  {
    "title": "Venezuela approves amnesty that may release of hundreds detained for political reasons",
    "description": "Venezuela's acting president has signed into law an amnesty bill that could lead to the release of politicians, activists, lawyers and many others. The approval marks a stark turn for the nation.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5720220/venezuela-approves-amnesty-that-may-release-of-hundreds-detained-for-political-reasons",
    "timestamp": "2026-02-20T03:33:04Z"
  },
  {
    "title": "Indonesia, US remove tariffs on 99 percent of US goods",
    "description": "Indonesia and the United States have agreed to eliminate tariff barriers on more than 99 percent of US goods exported to Indonesia across all sectors, the ...",
    "link": "https://en.antaranews.com/news/405190/indonesia-us-remove-tariffs-on-99-percent-of-us-goods",
    "timestamp": "2026-02-20T03:29:08Z"
  },
  {
    "title": "Meta cuts stock awards by 5% for most employees, FT reports",
    "description": "Meta reduced its annual distribution of stock ​options by about ​5% for most of its staff, as CEO ​Mark Zuckerberg ploughs billions of dollars into its artificial intelligence goals, the Financial Times reported on Thursday.",
    "link": "https://economictimes.indiatimes.com/tech/technology/meta-cuts-stock-awards-by-5-for-most-employees-ft-reports/articleshow/128588980.cms",
    "timestamp": "2026-02-20T03:24:46Z"
  },
  {
    "title": "Our Jesse",
    "description": "Both Jesse Helms and Jesse Jackson were polarizing figures.",
    "link": "https://www.ncspin.com/our-jesse",
    "timestamp": "2026-02-20T03:21:38Z"
  },
  {
    "title": "Gold dips as dollar ticks up; all eyes on inflation data",
    "description": "Gold prices dipped slightly as the dollar strengthened, with investors awaiting crucial U.S. inflation data for monetary policy direction. Geopolitical tensions and a hawkish Federal Reserve outlook also influenced market sentiment. Analysts anticipate contin…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-dips-as-dollar-ticks-up-all-eyes-on-inflation-data/articleshow/128588786.cms",
    "timestamp": "2026-02-20T03:17:33Z"
  },
  {
    "title": "Trump orders Pentagon to release files on UFOs and aliens",
    "description": "\"I don't know if they're real or not,\" US President Trump said of aliens. But he said interest in the topic led him to order the declassification of information related to extraterrestrial life.",
    "link": "https://www.dw.com/en/trump-orders-pentagon-to-release-files-on-ufos-and-aliens/a-76051806",
    "timestamp": "2026-02-20T03:15:00Z"
  },
  {
    "title": "Iran Has 15 Days Maximum to Make Deal With US - Trump",
    "description": "US President Donald Trump said on Thursday that Iran has 15 days maximum to make a deal with the United States.",
    "link": "https://sputnikglobe.com/20260220/iran-has-15-days-maximum-to-make-deal-with-us---trump-1123662212.html",
    "timestamp": "2026-02-20T03:14:00Z"
  },
  {
    "title": "Trump orders release of US government files on aliens",
    "description": "It comes just hours after the US president accused Barack Obama of revealing classified information when he said that aliens \"are real\" during a podcast appearance.",
    "link": "https://news.sky.com/story/trump-directs-us-government-to-release-files-on-alien-and-extraterrestrial-life-13509808",
    "timestamp": "2026-02-20T03:12:00Z"
  },
  {
    "title": "Texas woman missing after failing to report to prison for threatening to kill fed judge overseeing Trump election fraud case",
    "description": "\"I don't want to be that FBI agent that didn't go check on Lee Harvey Oswald two days before John Kennedy was assassinated. That happened. And that's the footnote in history,\" a prosecutor said.",
    "link": "https://nypost.com/2026/02/19/us-news/texas-woman-missing-after-failing-to-report-to-prison-for-threatening-to-kill-federal-judge-overseeing-trump-election-fraud-case/",
    "timestamp": "2026-02-20T03:11:44Z"
  },
  {
    "title": "Trump directs government to release UFO, extraterrestrial files",
    "description": "President Donald Trump says he's directing the Pentagon and other government agencies to identify and release files related to extraterrestrials and UFOs because of \"tremendous interest.\"",
    "link": "https://www.wmur.com/article/trump-government-release-ufo-extraterrestrial-files/70425865",
    "timestamp": "2026-02-20T03:09:10Z"
  },
  {
    "title": "Gavin Newsom’s blunt two-word response to running for president",
    "description": "Gov. Gavin Newsom appears to be adopting the playbook of every presidential candidate, ever. There’s the tell-all memoir set to launch Tuesday; the two trips in three weeks to Europe to appear ‘presidential’; and the headline-grabbing social media campaign th…",
    "link": "https://nypost.com/2026/02/19/us-news/gavin-newsoms-blunt-two-word-response-to-running-for-president/",
    "timestamp": "2026-02-20T03:06:39Z"
  },
  {
    "title": "Iran rebuilding nuclear program despite Trump talks, opposition figure claims",
    "description": "Iran is reportedly working to rebuild nuclear sites damaged during June 22 \"Midnight Hammer\" operation as the regime participates in Geneva talks.",
    "link": "https://www.foxnews.com/world/iran-rebuilding-nuclear-program-despite-trump-talks-opposition-figure-claims",
    "timestamp": "2026-02-20T03:05:51Z"
  },
  {
    "title": "Iran warns US bases, assets 'legitimate targets' if attacked",
    "description": "Iran has issued a stern warning to the United States. Iranian ambassador Amir Saeid Iravani stated that US bases and assets in the region will be considered legitimate targets. This comes amid escalating tensions and military deployments by the US. Iran insis…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-warns-us-bases-assets-legitimate-targets-if-attacked/articleshow/128588276.cms",
    "timestamp": "2026-02-20T03:05:18Z"
  },
  {
    "title": "X files? Trump says he's ordering release of data on UFOs and aliens",
    "description": "Files should \"include any and all other information connected to these highly complex, but extremely interesting and important, matters\", said US President Donald Trump.",
    "link": "https://www.channelnewsasia.com/world/trump-ufo-uap-aliens-area-51-obama-5941996",
    "timestamp": "2026-02-20T03:04:00Z"
  },
  {
    "title": "Trump orders release of UFO and alien files after Obama comments",
    "description": "President Trump directs the Pentagon to release files on UFOs and extraterrestrials, following Obama’s comments on aliens.",
    "link": "https://www.israelnationalnews.com/news/422709",
    "timestamp": "2026-02-20T03:02:20Z"
  },
  {
    "title": "Winter Won’t Last — Bitcoin’s Next Season Is Near, Michael Saylor Says",
    "description": "Michael Saylor keeps things upbeat. He told a TV interviewer that the current Bitcoin dip feels milder than past crashes and that a quicker rebound is likely. He even said, “Spring is coming, and Bitcoin is winning.” Related Reading: Ethereum Staking Reaches …",
    "link": "http://www.newsbtc.com/news/bitcoin/winter-wont-last-bitcoins-next-season-is-near-michael-saylor-says/",
    "timestamp": "2026-02-20T03:00:53Z"
  },
  {
    "title": "What does Trump’s $7bn Gaza relief pledge mean? Key questions after Board of Peace meeting",
    "description": "The meeting focused not only on rebuilding Gaza but also on the disarmament of Hamas and future security arrangements in the territory.",
    "link": "https://indianexpress.com/article/world/us-news/what-does-trumps-7bn-gaza-relief-pledge-mean-gaza-board-of-peace-10541703/",
    "timestamp": "2026-02-20T03:00:27Z"
  },
  {
    "title": "AS DOJ GOES MIA!",
    "description": "The British police have taken action. Where on Earth is Pam Bondi’s DOJ? asks Holly Baxter",
    "link": "https://www.the-independent.com/news/world/americas/andrew-arrest-epstein-trump-doj-b2923827.html",
    "timestamp": "2026-02-20T03:00:14Z"
  },
  {
    "title": "55% of Indian Americans disapprove of Trump's India policies: Survey",
    "description": "A new survey reveals Indian Americans are unhappy with Donald Trump's approach to India. Trade and technology issues have strained ties. Many also face online racism and discrimination. This impacts their political leanings and views on US-India relations. Th…",
    "link": "https://economictimes.indiatimes.com/news/india/55-of-indian-americans-disapprove-of-trumps-india-policies-survey/articleshow/128588061.cms",
    "timestamp": "2026-02-20T02:59:36Z"
  },
  {
    "title": "US holds secret indictment of Delcy Rodriguez, top opposition journo claims",
    "description": "A US-funded opposition journalist revealed the Trump DOJ has crafted a secret indictment of Venezuela’s Acting President to “hold it over her head,” and will execute it if she “derails.” The Trump administration is using a secret indictment to assert leverage…",
    "link": "https://www.activistpost.com/us-holds-secret-indictment-of-delcy-rodriguez-top-opposition-journo-claims/",
    "timestamp": "2026-02-20T02:59:00Z"
  },
  {
    "title": "The Orwellian twist in Trump's first Board of Peace meeting",
    "description": "Unless the Board of Peace begins to focus and genuinely tries to make the world a better place, this may well prove to be yet another monument to Donald Trump.",
    "link": "https://www.abc.net.au/news/2026-02-20/donald-trumps-gaza-board-of-peace-speech-leaves-questions/106367958",
    "timestamp": "2026-02-20T02:56:49Z"
  },
  {
    "title": "The Orwellian twist in Trump's first Board of Peace meeting",
    "description": "Unless the Board of Peace begins to focus and genuinely tries to make the world a better place, this may well prove to be yet another monument to Donald Trump.",
    "link": "https://www.abc.net.au/news/2026-02-20/donald-trump-gaza-board-of-peace-speech-leaves-questions/106367958",
    "timestamp": "2026-02-20T02:56:49Z"
  },
  {
    "title": "President Prabowo pledges 8,000 troops for Gaza peace force",
    "description": "President Prabowo Subianto has affirmed Indonesia&rsquo;s readiness to deploy at least 8,000 peacekeeping troops to Gaza, Palestine, to join the International ...",
    "link": "https://en.antaranews.com/news/405174/president-prabowo-pledges-8000-troops-for-gaza-peace-force",
    "timestamp": "2026-02-20T02:55:38Z"
  },
  {
    "title": "Indonesia's president reaches a trade deal with US while in Washington for Trump's Board of Peace",
    "description": "The White House has announced a trade agreement with Indonesia",
    "link": "https://abcnews.com/Business/wireStory/indonesias-president-reaches-trade-deal-us-washington-trumps-130319161",
    "timestamp": "2026-02-20T02:53:51Z"
  },
  {
    "title": "Indonesia's president reaches a trade deal with US while in Washington for Trump's Board of Peace",
    "description": "The White House has announced a trade agreement with Indonesia",
    "link": "https://abcnews.com/US/wireStory/indonesias-president-reaches-trade-deal-us-washington-trumps-130319160",
    "timestamp": "2026-02-20T02:53:50Z"
  },
  {
    "title": "Leslie Wexner says Epstein makes 'Bernie Madoff look like a Boy Scout': Deposition",
    "description": "In a deposition, billionaire Leslie Wexner offered few new details about his interactions with Jeffrey Epstein and sought to distance himself from the sex offender.",
    "link": "https://abcnews.com/US/leslie-wexner-epstein-makes-bernie-madoff-boy-scout/story?id=130316200",
    "timestamp": "2026-02-20T02:52:37Z"
  },
  {
    "title": "Indonesia finalizes agreement with Trump administration to slash tariff rate to 19%",
    "description": "US President Donald Trump and Indonesian President Prabowo Subianto finalized a trade agreement on February 19, a deal that is expected to allow Indonesia to avoid the threatened 32% tariffs and instead face a 19% rate for most goods. In exchange, Jakarta wil…",
    "link": "https://www.digitimes.com/news/a20260220VL201/donald-trump-indonesia-tariffs.html&chid=10",
    "timestamp": "2026-02-20T02:50:34Z"
  },
  {
    "title": "Trump Makes UFO Announcement as Seth Meyers Predicted He Would After Epstein Revelations",
    "description": "President Donald Trump announced that he will order his administration to release files about unidentified aerial phenomena and potential alien life.\nThe post Trump Makes UFO Announcement as Seth Meyers Predicted He Would After Epstein Revelations first appea…",
    "link": "https://www.mediaite.com/politics/trump/trump-makes-ufo-announcement-as-seth-meyers-predicted-he-would-after-epstein-revelations/",
    "timestamp": "2026-02-20T02:50:23Z"
  },
  {
    "title": "'I spoke to PM Modi, he is excited about the Gaza peace plan,' says Trump at inaugural Board of Peace meeting",
    "description": "Prime Minister Narendra Modi is reportedly excited about US President Donald Trump's Gaza peace plan. India attended a meeting of Trump's newly formed 'Board of Peace' as an observer. This international body aims to bring stability to Gaza after the conflict.…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/i-spoke-to-pm-modi-he-is-excited-about-the-gaza-peace-plan-says-trump-at-inaugural-board-of-peace-meeting/articleshow/128587465.cms",
    "timestamp": "2026-02-20T02:45:03Z"
  },
  {
    "title": "James Cameron Doesn’t Quite Tell Senator That Netflix Buying WB Is Cinema Equivalent Of Shuffling Deck Chairs On The Titanic, But Mega-Director Gets Pretty Close",
    "description": "James Cameron may sarcastically call himself a “humble movie farmer,” but the Oscar winning blockbuster director wants the folks in DC to know he’s not joking when he says “the proposed sale of Warner Brothers Discovery to Netflix will be disastrous for the t…",
    "link": "http://deadline.com/2026/02/james-cameron-netflix-movie-theaters-letter-1236730218/",
    "timestamp": "2026-02-20T02:35:44Z"
  },
  {
    "title": "Domestic shares likely to open flat, sentiment subdued on US-Iran tensions",
    "description": "Domestic shares expected to open flat as oil prices rise amid US-Iran tensions, impacting investor sentiment.",
    "link": "https://www.thehindubusinessline.com/markets/domestic-shares-likely-to-open-flat-sentiment-subdued-on-us-iran-tensions/article70654581.ece",
    "timestamp": "2026-02-20T02:35:28Z"
  },
  {
    "title": "Trump To Declassify Files On Extraterrestrials",
    "description": "President Donald Trump announced Thursday that he will move to declassify long-guarded government files related to extraterrestrial life.",
    "link": "https://dailycaller.com/2026/02/19/trump-declassify-files-extraterrestrials/",
    "timestamp": "2026-02-20T02:34:48Z"
  },
  {
    "title": "US pays about $160m towards nearly $4bn in UN dues",
    "description": "President Trump has slashed foreign aid and repeatedly criticised the United Nations for failing to meet its goals.",
    "link": "https://www.aljazeera.com/news/2026/2/20/us-pays-about-160m-towards-nearly-4bn-in-un-dues",
    "timestamp": "2026-02-20T02:33:34Z"
  },
  {
    "title": "Trump writes to Bangladesh's new PM Tarique; seeks 'decisive action' on defence front",
    "description": "South Asia News: Dhaka: In his first letter to Bangladesh PM Tarique Rahman, US President Donald Trump has pushed for making US-Bangladesh ties \\\"stronger than ever bef.",
    "link": "https://timesofindia.indiatimes.com/world/south-asia/trump-writes-to-bangladeshs-new-pm-tarique-seeks-decisive-action-on-defence-front/articleshow/128587279.cms",
    "timestamp": "2026-02-20T02:30:39Z"
  },
  {
    "title": "Inside Tom Arnold and Roseanne Barr's Nasty Divorce — Abuse Allegations, Savage Digs and 'Fat' Jokes",
    "description": "Tom Arnold and Roseanne Barr's marriage crashed and burned in 1994.",
    "link": "https://okmagazine.com/p/tom-arnold-roseanne-barr-relationship-timeline-marriage-divorce/",
    "timestamp": "2026-02-20T02:30:00Z"
  },
  {
    "title": "Trump says he doesn't know if aliens are real but directs government to release files on UFOs, more",
    "description": "President Donald Trump says he’s directing the Pentagon and other government agencies to identify and release files related to extraterrestrials and UFOs because of “tremendous interest.”",
    "link": "https://abcnews.com/US/wireStory/trump-aliens-real-directs-government-release-files-ufos-130324251",
    "timestamp": "2026-02-20T02:29:54Z"
  },
  {
    "title": "Andrew’s arrest: will anything like this now happen in the US? Why hasn’t it so far?",
    "description": "Overall, the former prince’s arrest throws into stark relief the state of the rule of law in the US compared to other democracies like the UK.",
    "link": "https://theconversation.com/andrews-arrest-will-anything-like-this-now-happen-in-the-us-why-hasnt-it-so-far-276512",
    "timestamp": "2026-02-20T02:24:35Z"
  },
  {
    "title": "Auchincloss: Now Is 'Ideal' Time to Get AUMF for Strikes to Hit Iran's Nuclear, Ballistic Missile Program",
    "description": "On Thursday’s broadcast of CNN’s “AC360,” Rep. Jake Auchincloss (D-MA) stated that “Iran is not in control of the skies, because of the Israeli strikes last year, anything above 10,000 feet, Iran really has no domain awareness and no ability\nThe post Auchincl…",
    "link": "https://www.breitbart.com/clips/2026/02/19/auchincloss-now-is-ideal-time-to-get-aumf-for-strikes-to-hit-irans-nuclear-ballistic-missile-program/",
    "timestamp": "2026-02-20T02:23:15Z"
  },
  {
    "title": "Stocks drop, oil rises after Trump Iran threat",
    "description": "Most Asia equities fell and oil prices rose Friday after Donald Trump ratcheted up Middle East tensions by hinting at possible military strikes on Iran if it did not make a “meaningful deal” in nuclear talks. The remarks fanned geopolitical concerns and cast …",
    "link": "https://www.digitaljournal.com/world/stocks-drop-oil-rises-after-trump-iran-threat/article",
    "timestamp": "2026-02-20T02:22:32Z"
  },
  {
    "title": "North Korea’s Kim Jong Un launches key party congress held every 5 years",
    "description": "Kim focuses on improving economic activity in opening speech at Ninth Congress of the Workers' Party of Korea.",
    "link": "https://www.aljazeera.com/news/2026/2/20/north-koreas-kim-jong-un-launches-key-party-congress-held-every-5-years",
    "timestamp": "2026-02-20T02:22:11Z"
  },
  {
    "title": "Trump says he doesn't know if aliens are real but directs govt to release files on UFOs, more",
    "description": "President Donald Trump has ordered government agencies to release files on aliens and UFOs. This follows former President Barack Obama's comments suggesting aliens might exist. Public interest in UFOs grew after leaked Navy videos in 2017. Congress held heari…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-he-doesnt-know-if-aliens-are-real-but-directs-govt-to-release-files-on-ufos-more/articleshow/128586978.cms",
    "timestamp": "2026-02-20T02:21:29Z"
  },
  {
    "title": "Canada’s Alberta to Hold Referendum on New Restrictions for Immigrants",
    "description": "The Canadian province of Alberta will hold a referendum on restricting immigration and reducing newcomers’ access to public services as it grapples with falling crude prices and a growing budget shortfall.",
    "link": "https://financialpost.com/pmn/business-pmn/canadas-alberta-to-hold-referendum-on-new-restrictions-for-immigrants",
    "timestamp": "2026-02-20T02:21:06Z"
  },
  {
    "title": "Trump says he is directing the Pentagon to release files related to UFOs and aliens",
    "description": "President Donald Trump on Thursday said that he was directing agencies to release files pertaining to “alien and extraterrestrial life.”Trump wrote on Truth Social that “based on the tremendous interest shown,” he would be directing Defense Secretary Pete Heg…",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-says-directing-pentagon-release-files-related-ufos-aliens-rcna259833",
    "timestamp": "2026-02-20T02:13:27Z"
  },
  {
    "title": "Board of Peace: Donald Trump claims he averted India-Pak war with 200% tariff threat",
    "description": "US President Donald Trump reiterated his claim of saving millions of lives during the India and Pakistan conflict in 2024, stating that he threatened to impose a \"200 per cent tariff\" and both countries halted the conflict as there's \"nothing like money.\"",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/board-of-peace-donald-trump-claims-he-averted-india-pak-war-with-200-tariff-threat/articleshow/128586416.cms",
    "timestamp": "2026-02-20T02:12:10Z"
  },
  {
    "title": "The Missing Voices in the Epstein Files’ Media Commentary: Sexual Assault Prevention Educators",
    "description": "The Epstein files scandal has all the elements of a gigantic media spectacle. It encompasses everything from true crime to political intrigue, and offers a peak behind closed doors into the lifestyles of the rich and famous. It has more than a little sex and …",
    "link": "https://msmagazine.com/2026/02/19/epstein-men-protect-experts-masculinity-male-peer-complicit-sexual-assault/",
    "timestamp": "2026-02-20T02:06:52Z"
  },
  {
    "title": "Gutfeld Defends Trump Making $4 Billion Since Taking Office Because ‘That’s Not Being Stolen From Me’",
    "description": "Fox News’ Greg Gutfeld defended President Donald Trump’s massive personal financial gains while in office, telling co-hosts on Thursday that “he’s never taken money from me, I’m ok.” In a wild rant on The Five, Gutfeld claimed that the Democratic Party was “t…",
    "link": "https://www.mediaite.com/media/news/gutfeld-defends-trump-making-4-billion-since-taking-office-because-thats-not-being-stolen-from-me/",
    "timestamp": "2026-02-20T02:02:42Z"
  },
  {
    "title": "US Plans Online Portal To Bypass Content Bans In Europe and Elsewhere",
    "description": "The U.S. State Department is reportedly developing a site called freedom.gov that would let users in Europe and elsewhere access content restricted under local laws, \"including alleged hate speech and terrorist propaganda,\" reports Reuters. Washington views t…",
    "link": "https://yro.slashdot.org/story/26/02/19/2247257/us-plans-online-portal-to-bypass-content-bans-in-europe-and-elsewhere",
    "timestamp": "2026-02-20T02:02:00Z"
  },
  {
    "title": "Trump considering initial limited strike against Iran, source says",
    "description": "Trump says \"bad things\" will happen if deal isn’t reached.",
    "link": "https://abcnews.com/Politics/trump-initial-limited-strike-iran-source/story?id=130319679",
    "timestamp": "2026-02-20T01:59:59Z"
  },
  {
    "title": "Board of Peace: Trump gets pledges for Gaza reconstruction and troop commitments",
    "description": "At the inaugural Board of Peace meeting, President Trump announced significant pledges for Gaza's reconstruction and security. Nine nations will contribute $7 billion and five will send troops for a stabilization force.  The U.S. also pledged $10 billion.  Ho…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/board-of-peace-trump-gets-pledges-for-gaza-reconstruction-and-troop-commitments/articleshow/128586077.cms",
    "timestamp": "2026-02-20T01:56:24Z"
  },
  {
    "title": "MAHA and leopards eating the faces",
    "description": "“Donald Trump loves to do favors for corporate interests that remunerate and flatter him” and “MAHA is the darkly ironic slogan of a crackpot anti-vaxx failson” are the definition of “not news.” And yet, for some people it’s never too late to learn things the…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/maha-and-leopards-eating-the-faces",
    "timestamp": "2026-02-20T01:55:59Z"
  }
]