[
  {
    "title": "Democratic-led states sue to stop Trump from withholding $600M in health grants",
    "description": "Four Democratic-led states that have become frequent targets of President Donald Trump have sued to block his administration from cutting off hundreds of millions in public health grants",
    "link": "https://abcnews.com/Politics/wireStory/democratic-led-states-sue-stop-trump-withholding-600m-130088435",
    "timestamp": "2026-02-12T04:45:51Z"
  },
  {
    "title": "Mark Kelly: Trump 'Trying to Break' the U.S. Justice System",
    "description": "On Wednesday on CNN's \"The Source,\" Sen. Mark Kelly (D-AZ) said President Donald Trump was trying to break the system of justice in the United States.\nThe post Mark Kelly: Trump ‘Trying to Break’ the U.S. Justice System appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/02/11/mark-kelly-trump-trying-to-break-the-u-s-justice-system/",
    "timestamp": "2026-02-12T04:40:57Z"
  },
  {
    "title": "Bad Bunny, Good Neighbor",
    "description": "For 13 minutes on the most-watched stage in American culture, Puerto Rico Rapper Bad Bunny made the United States feel expansive, uncontained, Caribbean rhythm–centered, and alive with a sense of belonging that crossed borders without asking permission. \nAs a…",
    "link": "https://www.globalresearch.ca/bad-bunny-good-neighbor/5915373",
    "timestamp": "2026-02-12T04:40:04Z"
  },
  {
    "title": "INR rebounds well in opening trades; Sustained dollar weakness supports",
    "description": "The Indian rupee rebounded well in opening trades on Thursday, as dollar index stayed well below 97 mark. US Dollar Index holds losses below 97.00 despite stronger-than-expected NFP report. INR opened at Rs 90.55 per dollar and hit a high of 90.40 so far duri…",
    "link": "https://www.business-standard.com/markets/capital-market-news/inr-rebounds-well-in-opening-trades-sustained-dollar-weakness-supports-126021200354_1.html",
    "timestamp": "2026-02-12T04:36:19Z"
  },
  {
    "title": "Democratic-led states sue Trump administration over $600M in health cuts",
    "description": "Four Democratic-led states that have become frequent targets of President Donald Trump have sued to block his administration from cutting off hundreds of millions in public health grants. The Department of Health and Human Services told Congress it's rescindi…",
    "link": "https://apnews.com/article/public-health-funding-cuts-trump-democrats-09d985ce03532a89718d4a43aea96eae",
    "timestamp": "2026-02-12T04:33:10Z"
  },
  {
    "title": "House passes GOP elections overhaul (Meredith Lee Hill/Politico)",
    "description": "Meredith Lee Hill / Politico:\nHouse passes GOP elections overhaul  —  The House passed a major GOP elections overhaul Wednesday after intense pressure from President Donald Trump, tech mogul Elon Musk and hard-right influencers.  But the legislation still has…",
    "link": "https://www.memeorandum.com/260211/p145",
    "timestamp": "2026-02-12T04:30:00Z"
  },
  {
    "title": "White House fires federal prosecutor just five hours after his swearing in",
    "description": "President Donald Trump's White House fired a federal prosecutor on Wednesday just five hours after he was sworn in by a federal judge. Donald T. Kinsella, 78, was appointed by a panel of judges to serve as an interim U.S. Attorney in the Northern District of …",
    "link": "https://www.rawstory.com/white-house-2675261344/",
    "timestamp": "2026-02-12T04:26:12Z"
  },
  {
    "title": "Exclusive – Secretary Lutnick: Trump Reasserting American Dominance by Ending Countries Taking Advantage of Us",
    "description": "During a Breitbart News policy discussion on Wednesday, Commerce Secretary Howard Lutnick described how President Donald Trump’s trade approach is focused on ending decades of foreign economic advantage over the United States, pointing to long-term trade imba…",
    "link": "https://www.breitbart.com/politics/2026/02/11/exclusive-secretary-lutnick-trump-reasserting-american-dominance-by-ending-countries-taking-advantage-of-usexclusive-secretary-lutnick-trump-reasserting-american-dominance-by-ending-countri/",
    "timestamp": "2026-02-12T04:17:51Z"
  },
  {
    "title": "Trump Admin Fires U.S. Attorney Within Hours Of His Appointment",
    "description": "President Donald Trump’s administration fired a U.S. attorney on Wednesday, hours after he was appointed by federal judges. Donald Kinsella was appointed the U.S. attorney in New York’s Northern District in place of John A. Sarcone III, who left his post as t…",
    "link": "https://www.mediaite.com/media/news/trump-admin-fires-u-s-attorney-within-hours-of-his-appointment/",
    "timestamp": "2026-02-12T04:17:43Z"
  },
  {
    "title": "LA Mayoral Candidate Nithya Ramen “Disappointed” Casey Wasserman Still Backed By LA28 Board Despite Jeffrey Epstein Connections",
    "description": "The decision by the LA28 board to keep Casey Wasserman around to lead Olympics despite his amorous appearance in the Epstein Files is earning scorn from two more members of the Los Angeles City Council, including one running for Mayor. “I am disappointed by t…",
    "link": "http://deadline.com/2026/02/casey-wasserman-la28-nithya-raman-mayor-jeffrey-epstein-1236716851/",
    "timestamp": "2026-02-12T04:17:06Z"
  },
  {
    "title": "U.S. attorney chosen to replace Trump pick is quickly fired by White House",
    "description": "Federal judges in upstate New York appointed a new U.S. attorney. The White House fired him hours later. This marks a clash between the Trump administration and the judiciary. The appointed attorney had over 50 years of experience. The administration previous…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/u-s-attorney-chosen-to-replace-trump-pick-is-quickly-fired-by-white-house/articleshow/128237388.cms",
    "timestamp": "2026-02-12T04:16:43Z"
  },
  {
    "title": "Dutch speed skater Jutta Leerdam combines Olympic gold and influencer attitude",
    "description": "An Olympic champion already at the Milan-Cortina Games, she goes for a second gold on Sunday in the 500 metres event.\n\nSo is 27-year-old Leerdam a leading star of her sport or more of an influencer?\n\nShe certainly doesn't go unnoticed -- just like her boyfrie…",
    "link": "https://www.france24.com/en/live-news/20260212-dutch-speed-skater-jutta-leerdam-combines-olympic-gold-and-influencer-attitude",
    "timestamp": "2026-02-12T04:15:20Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Strengthens United States National Defense with America’s Beautiful Clean Coal Power Generation Fleet",
    "description": "STRENGTHENING NATIONAL DEFENSE WITH RELIABLE COAL POWER: Today, President Donald J. Trump signed an Executive Order directing the Department of War to prioritize long-term Power Purchase Agreements with America’s beautiful, clean coal fleet to ensure military…",
    "link": "https://freerepublic.com/focus/f-news/4366512/posts",
    "timestamp": "2026-02-12T04:14:34Z"
  },
  {
    "title": "Daily Briefing: Bangladesh goes to first parliamentary polls after Sheikh Hasina’s ouster",
    "description": "In today's edition: Chargesheet in contaminated cough syrup deaths in MP; Sanjaya Baru opinion; what and why India needs to learn from Australia's batsmen; and more",
    "link": "https://indianexpress.com/article/live-news/daily-briefing-bangladesh-elections-top-news-today-10527837/",
    "timestamp": "2026-02-12T04:14:04Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Unleashes Commercial Fishing in the Atlantic",
    "description": "UNLEASHING OPPORTUNITY IN THE ATLANTIC: Today, President Donald J. Trump signed a proclamation to unleash commercial fishing in the Atlantic, advancing the America First Fishing Policy.The proclamation restores commercial fishing access to all 4,913 square mi…",
    "link": "https://freerepublic.com/focus/f-news/4366511/posts",
    "timestamp": "2026-02-12T04:12:01Z"
  },
  {
    "title": "AOC Says Pam Bondi ‘Knows She’s Implicated in a Massive Cover-Up’ to Protect Those in Epstein Files | Video",
    "description": "\"We all saw today the performance that she had. She was screaming and thrashing,\" the congresswoman from New York adds\nThe post AOC Says Pam Bondi ‘Knows She’s Implicated in a Massive Cover-Up’ to Protect Those in Epstein Files | Video appeared first on TheWr…",
    "link": "https://www.thewrap.com/media-platforms/politics/aoc-reacts-pam-bondi-hearing-epstein-files-cover-up-claims/",
    "timestamp": "2026-02-12T04:05:28Z"
  },
  {
    "title": "Trump directs military to strike new deals with coal-fired power plants: 'Going to be buying a lot of coal' (Jasmine Baehr/Fox News)",
    "description": "Jasmine Baehr / Fox News:\nTrump directs military to strike new deals with coal-fired power plants: ‘Going to be buying a lot of coal’  —  President touts ‘more reliable power and stronger and more resilient grid power’ while criticizing wind energy as ‘crazy …",
    "link": "https://www.memeorandum.com/260211/p144",
    "timestamp": "2026-02-12T04:05:01Z"
  },
  {
    "title": "Premier League club interested in USMNT coach Mauricio Pochettino",
    "description": "Mauricio Pochettino is busy preparing for the World Cup this summer, but could there be a London calling after that?  If Tottenham has its way, that would be exactly what would happen, but the Premier League club may have to turn to its Plan B in the short te…",
    "link": "https://nypost.com/2026/02/11/sports/tottenham-interested-in-usmnt-coach-mauricio-pochettino-after-thomas-frank-firing/",
    "timestamp": "2026-02-12T04:03:49Z"
  },
  {
    "title": "Crypto lender halted withdrawals during Bitcoin's fall last week",
    "description": "Crypto lending platform BlockFills suspended customer deposits and withdrawals last week to protect clients and restore liquidity around the time Bitcoin tumbled to $60,000.",
    "link": "https://cointelegraph.com/news/crypto-lender-blockfills-suspended-withdrawals",
    "timestamp": "2026-02-12T04:02:27Z"
  },
  {
    "title": "US House of Representatives Supports Resolution Against Trump's Tariffs on Canada",
    "description": "The US House of Representatives has supported a resolution against the tariffs imposed by US President Donald Trump on Canada.",
    "link": "https://sputnikglobe.com/20260212/us-house-of-representatives-supports-resolution-against-trumps-tariffs-on-canada-1123622699.html",
    "timestamp": "2026-02-12T03:59:00Z"
  },
  {
    "title": "Will PM listen or 'grip' on him too strong: Rahul Gandhi slams US deal",
    "description": "Congress leader Rahul Gandhi on Thursday alleged that the government ignored the voices of workers and farmers while making decisions concerning their future and asked whether Prime Minister Narendra Modi will listen to them now or if there is a \"grip\" on him…",
    "link": "https://www.business-standard.com/politics/will-pm-listen-or-grip-on-him-too-strong-rahul-gandhi-slams-us-deal-126021200170_1.html",
    "timestamp": "2026-02-12T03:57:05Z"
  },
  {
    "title": "Iran’s top adviser: Missile program is non-negotiable",
    "description": "Iran's missile program is a \"red line\" and non-negotiable, says Ali Shamkhani, amid US-Iran tensions.",
    "link": "https://www.israelnationalnews.com/news/422307",
    "timestamp": "2026-02-12T03:52:39Z"
  },
  {
    "title": "A year into Trump tariffs, Chinese factories and ports are buzzing with activity",
    "description": "A year after Trump's tariffs spooked manufacturers and customers, Chinese factories and ports were humming unfethered ahead of the Lunar New Year holiday.",
    "link": "https://www.cnbc.com/2026/02/12/trump-tariffs-cny-chinese-factories-and-ports-are-buzzing-with-activity.html",
    "timestamp": "2026-02-12T03:50:45Z"
  },
  {
    "title": "Trump threatens US lawmakers with ‘consequences’ over tariff pushback",
    "description": "President Donald Trump has warned Republican lawmakers they will face political “consequences” after the House of Representatives vote Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632336-trump-canada-tariffs-consequences/",
    "timestamp": "2026-02-12T03:40:10Z"
  },
  {
    "title": "Move over, ‘Merkron.’ Europe’s new power couple is ‘Merzoni’",
    "description": "How an alliance between Germany’s and Italy’s leaders is reshaping Europe.",
    "link": "https://fortune.com/2026/02/11/what-is-merzoni-meloni-merz-germany-italy-europe-alliance/",
    "timestamp": "2026-02-12T03:38:55Z"
  },
  {
    "title": "Bondi clashes with Democrats as she struggles to turn the page on Epstein files furor",
    "description": "Attorney General Pam Bondi launched into a defense of President Donald Trump as she tried to turn the page from criticism of the Justice Department’s handling of the Jeffrey Epstein files.",
    "link": "https://www.wpxi.com/news/local/bondi-clashes-with-democrats-she-struggles-turn-page-epstein-files-furor/WBVTQG5UJ5CCLEXNHH3EPZKNYU/",
    "timestamp": "2026-02-12T03:34:49Z"
  },
  {
    "title": "Every Single Grand Juror Rejected Trump DOJ’s Case for Indicting Dem Lawmakers: Report",
    "description": "The DOJ needed yes votes from 12 grand jurors in order to indict six Democratic members of Congress on Tuesday. They reportedly got none.\nThe post Every Single Grand Juror Rejected Trump DOJ’s Case for Indicting Dem Lawmakers: Report first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/news/every-single-grand-juror-rejected-trump-dojs-case-for-indicting-dem-lawmakers-report/",
    "timestamp": "2026-02-12T03:29:18Z"
  },
  {
    "title": "Exclusive -- Sen. Sheehy on Jobs Numbers: U.S. Businesses 'Investing in American Jobs in America'",
    "description": "Sen. Tim Sheehy (R-MT), during a Breitbart News policy event, reacted to the jobs numbers that were released on Wednesday, pointing out that it means, \"American businesses are investing in American jobs in America.\"\nThe post Exclusive — Sen. Sheehy on Jobs Nu…",
    "link": "https://www.breitbart.com/economy/2026/02/11/exclusive-tim-sheehy-jobs-numbers-u-s-businesses-investing-american-jobs-america/",
    "timestamp": "2026-02-12T03:23:40Z"
  },
  {
    "title": "Trump hails trade deal with India as historic, says US coal exports to rise",
    "description": "US President Donald Trump has hailed the trade deal with India as \"historic\" and said America will increase its coal exports dramatically to the country and to others with which it has trade agreements.\n\"And under our leadership, we're becoming a massive ener…",
    "link": "https://www.business-standard.com/economy/news/trump-hails-trade-deal-with-india-as-historic-says-us-coal-exports-to-rise-126021200106_1.html",
    "timestamp": "2026-02-12T03:21:44Z"
  },
  {
    "title": "'China shock': Germany struggles as key market turns business rival",
    "description": "Insatiable Chinese demand for German exports, from cars to factory equipment, helped underpin a long boom in the eurozone's biggest economy, but times have changed, adding to the country's economic headwinds.\n\nAs Chancellor Friedrich Merz reportedly readies t…",
    "link": "https://www.france24.com/en/live-news/20260212-china-shock-germany-struggles-as-key-market-turns-business-rival",
    "timestamp": "2026-02-12T03:21:21Z"
  },
  {
    "title": "Trump Presents Plan For Military To Work With Coal Plants",
    "description": "President Donald Trump on Wednesday announced a sweeping plan to tie America’s coal industry directly to national defense.",
    "link": "https://dailycaller.com/2026/02/11/trump-presents-plan-military-coal-plants/",
    "timestamp": "2026-02-12T03:17:21Z"
  },
  {
    "title": "US President Trump hails trade deal with India as 'historic'",
    "description": "“We've made historic trade deals with Japan, Korea, India and others to increase our coal exports dramatically,” Trump said Wednesday during an event titled ‘Champion of Coal’",
    "link": "https://www.thehindubusinessline.com/news/world/us-president-trump-hails-trade-deal-with-india-as-historic/article70622418.ece",
    "timestamp": "2026-02-12T03:17:18Z"
  },
  {
    "title": "Trump’s Onstage Glitch Sparks Concern Over Health Online – ‘Get That Man Into a Hospital’ - NewsBreak",
    "description": "US President Donald Trump’s health is under scrutiny again. The reason? During the White House Champion of Coal event, Trump glitched and struggled to read",
    "link": "https://www.newsbreak.com/share/4488920913429-trump-s-onstage-glitch-sparks-concern-over-health-online-get-that-man-into-a-hospital?_f=app_share&amp;pd=0Oi8J8GA&amp;lang=en_US&amp;send_time=1770865963&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.4.1.12%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-02-12T03:15:16Z"
  },
  {
    "title": "Nebraska Plans To Hand Over Sensitive Data On Every Registered Voter In State To DOJ",
    "description": "“Once the data is released, that bell cannot be unrung,” lawyers for Common Cause wrote in a brief seeking an injunction.",
    "link": "https://www.huffpost.com/entry/nebraska-election-data-doj_n_698d4374e4b0ba74045866e1",
    "timestamp": "2026-02-12T03:11:36Z"
  },
  {
    "title": "The NFL could repeat the dose and have not one, but three Latin artists at Super Bowl LXI",
    "description": "The NFL appears to have struck gold in the Hispanic market. Following Bad Bunny&apos;s historic - albeit polarizing - performance at Super Bowl LX, rumors about who will take the s",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/12/698d43fae2704e22598b4570.html",
    "timestamp": "2026-02-12T03:08:55Z"
  },
  {
    "title": "44 murders in 43 days: Two people killed in overnight shootings in Israel",
    "description": "Two People Killed in Overnight Shootings in Israel. Major Haredi Leader Says 'No Yeshiva Student Will Enlist in Army' Amid Legislation Push. Wall Street Journal: Second Aircraft Carrier Prepares to Deploy to Middle East",
    "link": "https://www.haaretz.com/israel-news/2026-02-12/ty-article-live/44-murders-in-43-days-two-people-killed-in-overnight-shootings-in-israel/0000019c-4fad-dc30-a9de-cffd3f960000",
    "timestamp": "2026-02-12T03:07:55Z"
  },
  {
    "title": "Trump orders Pentagon to buy electricity generated by coal",
    "description": "Trump's order is the latest move by US administration to boost fossil fuel industry despite climate change concerns.",
    "link": "https://www.aljazeera.com/economy/2026/2/12/trump-orders-pentagon-to-buy-electricity-generated-by-coal",
    "timestamp": "2026-02-12T03:06:51Z"
  },
  {
    "title": "Trump, 79, Smears Makeup on Decaying Hand",
    "description": "The chalky beige coating covering the president’s chronically bruised hand was visible from afar.",
    "link": "https://www.thedailybeast.com/trump-79-smears-makeup-on-decaying-hand/",
    "timestamp": "2026-02-12T03:06:31Z"
  },
  {
    "title": "‘What the hell?’ Senator baffled by Mike Johnson's ‘clueless’ remarks",
    "description": "A Democratic Senator was baffled on Wednesday by some \"clueless\" comments Speaker Mike Johnson (R-LA) made about President Donald Trump's latest failed indictment. Sen. Mark Kelly (D-AZ) joined CNN's Kaitlan Collins on \"The Source\" to discuss the Trump admini…",
    "link": "https://www.rawstory.com/mike-johnson-2675261298/",
    "timestamp": "2026-02-12T02:59:03Z"
  },
  {
    "title": "Busted: Republican called out by powerful union after false claim of invitation snub",
    "description": "Pro-Trump Michigan Senate candidate Mike Rogers claimed that one of the most important labor unions in the state snubbed him for one of their key events, rather than the other way around — but the union had the receipts proving otherwise.On Wednesday morning,…",
    "link": "https://www.rawstory.com/mike-rogers-uaw/",
    "timestamp": "2026-02-12T02:53:15Z"
  },
  {
    "title": "Rep. Brandon Gill Asks Bondi About Biden-Harris DOJ Weaponizing Justice System",
    "description": "Rep. Brandon Gill (R-TX) asked Attorney General Pam Bondi about several instances in which the Biden-Harris Department of Justice (DOJ) weaponized the justice system.\nThe post Rep. Brandon Gill Asks Bondi About Biden-Harris DOJ Weaponizing Justice System appe…",
    "link": "https://www.breitbart.com/politics/2026/02/11/rep-brandon-gill-asks-bondi-about-biden-harris-doj-weaponizing-justice-system3209778/",
    "timestamp": "2026-02-12T02:49:07Z"
  },
  {
    "title": "Israel to join Trump's 'Board of Peace', Netanyahu says",
    "description": "Israel has joined U.S. President Trump's \"Board of Peace,\" a new initiative aimed at stabilizing Gaza and tackling global conflicts. The board, launched in January, will hold its first meeting on February 19. While some allies have joined, many Western nation…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israel-to-join-trumps-board-of-peace-netanyahu-says/articleshow/128234644.cms",
    "timestamp": "2026-02-12T02:44:08Z"
  },
  {
    "title": "US House overturn Trump’s Canada tariffs in rare bipartisan rebuke",
    "description": "The US House voted 219-211 on Wednesday to challenge President Donald Trump’s tariffs on Canada, with several Republicans joining Democrats in a rare rebuke of his trade policy. The largely symbolic measure seeks to end the national emergency underpinning the…",
    "link": "https://www.france24.com/en/americas/20260212-us-house-overturn-trump-canada-tariffs-bipartisan",
    "timestamp": "2026-02-12T02:42:10Z"
  },
  {
    "title": "Four states sue Trump administration over cuts to public health funding",
    "description": "Four Democratic-led states have filed a lawsuit to stop the Trump administration from cutting $600 million in public health funds. California, Colorado, Illinois, and Minnesota claim the cuts are politically motivated. The funding supports vital health progra…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/four-states-sue-trump-administration-over-cuts-to-public-health-funding/articleshow/128234493.cms",
    "timestamp": "2026-02-12T02:41:48Z"
  },
  {
    "title": "Trump hails US energy exports after trade deals with India, Japan, South Korea",
    "description": "Trump calls US the world’s top energy producer, citing India, Japan, and South Korea trade deals that boost coal exports. India emphasizes national interest in energy sourcing.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-hails-us-energy-exports-after-trade-deals-with-india-japan-south-korea/article70622377.ece",
    "timestamp": "2026-02-12T02:37:34Z"
  },
  {
    "title": "ICE is pushing Minneapolis underground",
    "description": "Minneapolis was not the war zone I expected to find. Depending on who you are and where you live, things can seem, for a few fleeting moments, almost normal, like a few blocks or neighborhoods over people aren't being tear gassed or rounded up by ICE or, in t…",
    "link": "https://www.theverge.com/policy/877106/minneapolis-ice-cbp-occupation-immigration-raid-mutual-aid",
    "timestamp": "2026-02-12T02:35:28Z"
  },
  {
    "title": "Trump directs Defense Department to buy ​electricity from coal-fired plants",
    "description": "President Trump is boosting coal power. The Pentagon will now purchase electricity from coal plants. Six coal plants will receive $175 million for upgrades. This move aims to support the coal sector amidst a shift away from fossil fuels. The administration is…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-directs-defense-department-to-buy-electricity-from-coal-fired-plants-pentagon/articleshow/128234097.cms",
    "timestamp": "2026-02-12T02:31:44Z"
  },
  {
    "title": "Trump caves on his own snubs as retaliation ploy against Dem governors backfires",
    "description": "President Donald Trump on Wednesday walked back a snub he gave to two Democratic Governors. Last week, Trump notably did not invite Democratic governors Wes Moore of Maryland and Jared Polis of Colorado to the upcoming National Governors Association meeting a…",
    "link": "https://www.rawstory.com/trump-2675261269/",
    "timestamp": "2026-02-12T02:29:53Z"
  },
  {
    "title": "US colleges received $5.2 bn in foreign funds in 2025, shows govt data",
    "description": "The Education Department released the data Wednesday, touting a new website it says is aimed at bringing more transparency to foreign funding at US colleges",
    "link": "https://www.business-standard.com/world-news/us-colleges-received-5-2-bn-in-foreign-funds-in-2025-shows-govt-data-126021200096_1.html",
    "timestamp": "2026-02-12T02:22:44Z"
  },
  {
    "title": "Russia to evacuate tourists from Cuba amid US-engineered fuel crisis",
    "description": "Russia will operate only return flights from Cuba as 'evacuation' of tourists from Caribbean island gets under way.",
    "link": "https://www.aljazeera.com/news/2026/2/12/russia-to-evacuate-tourists-from-cuba-amid-us-engineered-fuel-crisis",
    "timestamp": "2026-02-12T02:20:22Z"
  },
  {
    "title": "Trump admin warns Peru over sovereignty threat from Chinese port",
    "description": "The Chancay port on Peru's Pacific coast was conceived as a crucial new trade link between Asia and Latin America, but its status as a flashpoint between Washington and Beijing is intensifying",
    "link": "https://www.business-standard.com/world-news/trump-admin-warns-peru-over-sovereignty-threat-from-chinese-port-126021200092_1.html",
    "timestamp": "2026-02-12T02:16:42Z"
  },
  {
    "title": "Gold, silver dip as dollar rises after strong US jobs data",
    "description": "Gold and silver prices declined on Thursday. This happened as the U.S. dollar strengthened following robust January jobs data. Strong employment figures reduced expectations for early interest rate cuts by the Federal Reserve. Investors are now awaiting infla…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-silver-dip-as-dollar-rises-after-strong-us-jobs-data/articleshow/128233525.cms",
    "timestamp": "2026-02-12T02:08:17Z"
  },
  {
    "title": "US vows to drive ‘dramatic increase’ in Venezuelan oil output",
    "description": "US Energy Secretary Chris Wright vowed a “dramatic increase” in Venezuelan oil output and deeper ties with Caracas on Wednesday, after meeting interim leader Delcy Rodríguez in Caracas, pledging to “make the Americas great again.” Wright is the highest-rankin…",
    "link": "https://www.france24.com/en/americas/20260212-us-vows-to-drive-dramatic-increase-in-venezuelan-oil-output",
    "timestamp": "2026-02-12T02:05:44Z"
  },
  {
    "title": "Taiwan leader wants greater defence cooperation with Europe: AFP interview",
    "description": "Lai told AFP in his first interview with an international news agency since taking office in 2024 that Taiwan also supports the island's semiconductor companies investing overseas, including in Europe.\n\nTaiwan has stepped up efforts to strengthen security and…",
    "link": "https://www.france24.com/en/live-news/20260212-taiwan-leader-wants-greater-defence-cooperation-with-europe-afp-interview",
    "timestamp": "2026-02-12T02:05:18Z"
  },
  {
    "title": "Plotters, kingmakers and dark horses — the Liberals vying for control",
    "description": "Parliament House has entered the spill zone, where politics is at its most primal. Here are the Liberals jostling for control of their much-reduced party.",
    "link": "https://www.abc.net.au/news/2026-02-12/the-liberals-vying-for-control-of-party/106335554",
    "timestamp": "2026-02-12T02:05:02Z"
  },
  {
    "title": "Trump insists Iran nuclear talks continue in meeting with Netanyahu",
    "description": "President Donald Trump met for more than two hours behind closed doors with Israeli Prime Minister Benjamin Netanyahu on Wednesday and said he'd insisted that negotiations with Iran continue as the US pushes for a nuclear deal with Tehran\nNetanyahu entered th…",
    "link": "https://www.business-standard.com/world-news/trump-insists-iran-nuclear-talks-continue-in-meeting-with-netanyahu-126021200025_1.html",
    "timestamp": "2026-02-12T02:04:56Z"
  },
  {
    "title": "Bondi clashes with Democrats as she struggles to turn the page on Epstein files furor",
    "description": "Attorney General Pam Bondi passionately defended Donald Trump during a combative hearing, aggressively deflecting questions about the Jeffrey Epstein files. She accused Democrats of using the issue to distract from Trump's successes, while Republicans sought …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/bondi-clashes-with-democrats-as-she-struggles-to-turn-the-page-on-epstein-files-furor/articleshow/128233349.cms",
    "timestamp": "2026-02-12T01:58:47Z"
  },
  {
    "title": "Meet the high-profile Emirati business leader lawmakers are linking to Epstein ‘torture’ email",
    "description": "U.S. officials have identified DP World's Sultan Ahmed bin Sulayem as the recipient of a 2009 email from Jeffrey Epstein regarding a supposed \"torture video.\"",
    "link": "https://www.cnbc.com/2026/02/12/epstein-files-sultan-ahmed-bin-sulayem-dp-world-email-dubai-uae-emirati.html",
    "timestamp": "2026-02-12T01:51:01Z"
  },
  {
    "title": "‘She Really Dehumanized Us Today’: Epstein Victim Decries ‘Circus Act’ Pam Bondi For Refusing To Apologize To Survivors At Hearing",
    "description": "Jeffrey Epstein survivor Marina Lacerda decried Attorney General Pam Bondi’s performance at a congressional hearing on Wednesday, claiming the attorney general “has become a circus act” who was “trying to distract” from the true gravity of the Epstein case. L…",
    "link": "https://www.mediaite.com/media/news/she-really-dehumanized-us-today-epstein-victim-decries-circus-act-pam-bondi-for-refusing-to-apologize-to-survivors-at-hearing/",
    "timestamp": "2026-02-12T01:51:00Z"
  },
  {
    "title": "Canada built a bridge. Now Trump wants half",
    "description": "President Donald Trump spent years promising to make Mexico pay for a wall at the US southern border. Mexico did not. In a strange twist, Trump is now threatening to block the opening of a bridge at the northern border that Canada actually already paid for. T…",
    "link": "https://freerepublic.com/focus/f-news/4366502/posts",
    "timestamp": "2026-02-12T01:50:12Z"
  },
  {
    "title": "Breaking with Trump, US House votes to pass a bill ending Canada tariffs",
    "description": "The vote was a rare rebuke against Trump from the Republican-led chamber, as Congress members face midterm elections.",
    "link": "https://www.aljazeera.com/news/2026/2/12/breaking-with-trump-us-house-votes-to-pass-a-bill-ending-canada-tariffs",
    "timestamp": "2026-02-12T01:49:59Z"
  },
  {
    "title": "US Energy Secretary Chris Wright touts oil production on Venezuela visit",
    "description": "Democrats introduce legislation to force Donald Trump's administration to be transparent about Venezuelan oil sales.",
    "link": "https://www.aljazeera.com/news/2026/2/12/us-energy-secretary-chris-wright-touts-oil-production-on-venezuela-visit",
    "timestamp": "2026-02-12T01:48:46Z"
  },
  {
    "title": "Trump's latest 'crony bridgegate' gets searing rebuke from WSJ editors",
    "description": "The \"crony bridgegate\" scandal President Donald Trump cooked up this week earned the president a searing rebuke from the conservative Wall Street Journal editorial board. Earlier this week, Trump threatened to shut down the opening of the Gordie Howe Internat…",
    "link": "https://www.rawstory.com/trump-2675261216/",
    "timestamp": "2026-02-12T01:48:11Z"
  },
  {
    "title": "From Venezuela to Tehran, Trump keeps the world guessing — to his advantage",
    "description": "We Americans are a parochial people — we’re homebodies.",
    "link": "https://nypost.com/2026/02/11/opinion/from-venezuela-to-tehran-trump-keeps-the-world-guessing-to-his-advantage/",
    "timestamp": "2026-02-12T01:48:07Z"
  },
  {
    "title": "‘Racist, Misogynistic Trash’: Democratic Rep Throws Tirade Over SAVE America Act On House Floor",
    "description": "Delia Ramirez unleashed a fiery speech on the House floor Wednesday blasting Republicans over the Safeguard American Voter Eligibility (SAVE) Act.",
    "link": "https://dailycaller.com/2026/02/11/rdelia-ramirez-throws-tirade-save-america-act-house-floor/",
    "timestamp": "2026-02-12T01:47:05Z"
  },
  {
    "title": "US House Rebukes Trump’s Canada Tariffs in Rare Bipartisan Vote",
    "description": "The U.S. House of Representatives voted 219–211 to rebuke President Donald Trump’s tariffs on Canadian imports, marking a rare bipartisan challenge to the White House’s trade policy. Six Republicans joined Democrats in supporting a resolution focused at endin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-house-rebukes-trumps-canada-tariffs-in-rare-bipartisan-vote/articleshow/128232881.cms",
    "timestamp": "2026-02-12T01:40:03Z"
  },
  {
    "title": "Nancy Mace forced to respond after brutal GOP snub in governor's race",
    "description": "Rep. Nancy Mace (R-SC) got a bitter blow in her candidacy for governor of South Carolina as outgoing Gov. Henry McMaster endorsed his lieutenant governor, Pamela Evette, to succeed him — leading some to speculate President Donald Trump, who is close with McMa…",
    "link": "https://www.rawstory.com/nancy-mace-2675261158/",
    "timestamp": "2026-02-12T01:39:36Z"
  },
  {
    "title": "Oil prices rise on concerns about US-Iran tensions",
    "description": "On Thursday, oil prices experienced a modest uptick amid growing unease regarding the escalating confrontations between the U.S. and Iran. Both Brent crude and U.S. West Texas Intermediate futures climbed in response, following a positive close the previous d…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-rise-on-concerns-about-us-iran-tensions/articleshow/128232854.cms",
    "timestamp": "2026-02-12T01:39:26Z"
  },
  {
    "title": "House votes to block Trump tariffs on Canada in rare bipartisan rebuke",
    "description": "The House has voted to slap back President Donald Trump's tariffs on Canada, a rare if largely symbolic rebuke of the White House agenda as Republicans joined Democrats over the objections of GOP leadership.\nWednesday's tally, 219-211, was among the first tim…",
    "link": "https://www.business-standard.com/world-news/house-votes-to-block-trump-tariffs-on-canada-in-rare-bipartisan-rebuke-126021200061_1.html",
    "timestamp": "2026-02-12T01:36:12Z"
  },
  {
    "title": "Venezuelan AG wants amnesty for toppled leader Maduro",
    "description": "Maduro was captured by US forces in a deadly military strike on January 3 and spirited away to New York to stand trial on drug charges.\n\nHis vice president Delcy Rodriguez took his place with the consent of US President Donald Trump, provided she does Washing…",
    "link": "https://www.france24.com/en/live-news/20260212-venezuelan-ag-wants-amnesty-for-toppled-leader-maduro",
    "timestamp": "2026-02-12T01:35:14Z"
  },
  {
    "title": "Pentagon pushing AI companies to expand on classified networks, sources say",
    "description": "The Pentagon is pushing the top AI companies including OpenAI and Anthropic to make their artificial-intelligence tools available ​on classified networks without many of the standard restrictions ​that the companies apply to users.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/pentagon-pushing-ai-companies-to-expand-on-classified-networks-sources-say/articleshow/128231949.cms",
    "timestamp": "2026-02-12T01:31:30Z"
  },
  {
    "title": "Trump threatens 'consequences' after 6 House Republicans voted to reverse his Canada tariffs",
    "description": "President Trump threatens to back primary challengers against six House Republicans who voted with Democrats to undo his Canada tariffs.",
    "link": "https://www.foxnews.com/politics/trump-threatens-consequences-after-6-house-republicans-vote-reverse-his-canada-tariffs",
    "timestamp": "2026-02-12T01:30:22Z"
  },
  {
    "title": "Death toll in Iran protest crackdown rises over 7,000, say activists",
    "description": "The death toll from a crackdown over Iran's nationwide protests last month has reached at least 7,002 people killed with many more still feared dead, activists said Thursday.\nThe US-based Human Rights Activists News Agency, which offered the latest figures, h…",
    "link": "https://www.business-standard.com/world-news/death-toll-in-iran-protest-crackdown-rises-over-7-000-say-activists-126021200069_1.html",
    "timestamp": "2026-02-12T01:28:49Z"
  },
  {
    "title": "Religious freedom violations: APC, NNPP back Kwankwaso as US sanctions tension rises",
    "description": "US lawmakers propose sanctions against Kwankwaso and others for religious freedom violations, sparking backlash from Nigerian political parties APC and NNP\n\nRead More: https://punchng.com/religious-freedom-violations-apc-nnpp-back-kwankwaso-as-us-sanctions-te…",
    "link": "https://punchng.com/religious-freedom-violations-apc-nnpp-back-kwankwaso-as-us-sanctions-tension-rises/",
    "timestamp": "2026-02-12T01:26:33Z"
  },
  {
    "title": "Graham hails Trump and Netanyahu: They seek peace, but not in a fake way",
    "description": "Senator Lindsey Graham praises the White House meeting between President Trump and Prime Minister Netanyahu, highlighting their focus on the Iranian threat and their leadership for peace and stability.",
    "link": "https://www.israelnationalnews.com/news/422303",
    "timestamp": "2026-02-12T01:21:12Z"
  },
  {
    "title": "WaPo Eats Crow For Reporting White House Didn’t Announce Something Trump Literally Put On Truth Social",
    "description": "The Washington Post issued a public correction Wednesday after claiming National Guard troops withdrew from three major cities without any public notice.",
    "link": "https://dailycaller.com/2026/02/11/wapo-corrects-report-donald-trump-national-guard/",
    "timestamp": "2026-02-12T01:14:48Z"
  },
  {
    "title": "GOP-led House passes controversial 'show your papers' bill that would affect 146M people",
    "description": "US House approves bill mandating proof of citizenship for voting in federal electionsby Ashley Murray, Pennsylvania Capital-Star February 11, 2026WASHINGTON — The U.S. House passed legislation Wednesday that would require the public to produce a passport or b…",
    "link": "https://www.rawstory.com/citizenship-election/",
    "timestamp": "2026-02-12T01:10:37Z"
  },
  {
    "title": "Republicans Debut 'Nigeria Religious Freedom' Act Demanding Report on U.S. Support for Persecuted Christians",
    "description": "House Republicans, led by Reps. Chris Smith (R-NJ) and Riley Moore (R-WV), introduced a bill on Monday calling for the State Department to offer comprehensive reports on American actions to protect Christians persecuted by a host jihadist terror threats in Ni…",
    "link": "https://www.breitbart.com/africa/2026/02/11/republicans-debut-nigeria-religious-freedom-act-demanding-report-on-u-s-support-for-persecuted-christians/",
    "timestamp": "2026-02-12T01:04:33Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,449",
    "description": "These are the key developments from day 1,449 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2026/2/12/russia-ukraine-war-list-of-key-events-day-1449",
    "timestamp": "2026-02-12T01:03:56Z"
  },
  {
    "title": "US economy: Trump’s ‘Golden Age’ is a fairytale",
    "description": "The US president doesn’t seem to understand what the latest economic numbers mean for one of his biggest promises.",
    "link": "https://www.smh.com.au/business/the-economy/trump-s-golden-age-is-a-bit-of-a-fairytale-20260212-p5o1mn.html",
    "timestamp": "2026-02-12T01:03:51Z"
  },
  {
    "title": "Trump calls India-US trade deal ‘historic’ as tariff cuts and coal exports take centre stage",
    "description": "US President Donald Trump hailed a new India-US trade deal as historic, anticipating a significant boost in American energy exports, particularly coal. The interim agreement reduces US tariffs on Indian goods and India lowers duties on American industrial, en…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-calls-india-us-trade-deal-historic-as-tariff-cuts-and-coal-exports-take-centre-stage/articleshow/128231856.cms",
    "timestamp": "2026-02-12T01:03:51Z"
  },
  {
    "title": "Pentagon prepares to send second aircraft carrier toward Iran – WSJ",
    "description": "The Department of War has reportedly instructed another aircraft carrier strike group to prepare for possible deployment to the Middle East Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632335-us-aircraft-carrier-iran/",
    "timestamp": "2026-02-12T01:03:14Z"
  },
  {
    "title": "Trump Flat-Out Threatens Republicans — After 6 Jump Ship to Tank Key Tariff Vote: You Will ‘Seriously Suffer the Consequences’",
    "description": "President Donald Trump blatantly threatened congressional members of his party on Wednesday, warning that “any Republican” who voted against his tariffs would “seriously suffer the consequences.” Trump’s post to Truth Social came right as six members of the H…",
    "link": "https://www.mediaite.com/media/news/trump-flat-out-threatens-republicans-after-6-jump-ship-to-tank-key-tariff-vote-you-will-seriously-suffer-the-consequences/",
    "timestamp": "2026-02-12T01:02:43Z"
  },
  {
    "title": "Strategic observations from Carlisle: Electoral politics, media, and information environment",
    "description": "By Santosh Kumar Dhakal, Major General (Retd.) Nepal Army Introduction In 2016–17, I was nominated to attend the War Course […]\nThe post Strategic observations from Carlisle: Electoral politics, media, and information environment appeared first on Peoples' Re…",
    "link": "https://mypeoplesreview.com/2026/02/12/strategic-observations-from-carlisle-electoral-politics-media-and-information-environment/",
    "timestamp": "2026-02-12T01:01:03Z"
  },
  {
    "title": "She took America’s training — then cashed i​n for China",
    "description": "When Team USA freestyle skier Hunter Hess used his platform at the Olympics to bash President Donald Trump, BlazeTV host Sara Gonzales pointed out that “you don’t actually have to represent this country.”“There is one Olympian who took that very seriously, ac…",
    "link": "https://www.theblaze.com/shows/sara-gonzales-unfiltered/she-took-americas-training-then-cashed-in-for-china",
    "timestamp": "2026-02-12T01:00:00Z"
  },
  {
    "title": "US Military Helping Trump to Build Massive Network of ‘Concentration Camps,’ Navy Contract Reveals",
    "description": "The Department of Homeland Security is using a repurposed $55 billion Navy contract to convert warehouses into makeshift jails and plan sprawling tent cities in remote areas. In the wake of immigration agents’ killings of three US citizens within a matter of …",
    "link": "https://www.activistpost.com/us-military-helping-trump-to-build-massive-network-of-concentration-camps-navy-contract-reveals/",
    "timestamp": "2026-02-12T01:00:00Z"
  },
  {
    "title": "House Votes to Cancel Tariffs on Canada, Rebuking Trump",
    "description": "Lawmakers in the House delivered a bipartisan message to President Trump on his trade policy Wednesday, voting to cancel tariffs on Canada in a move that directly challenges his approach to international commerce. Six Republicans joined Democrats to approve a…",
    "link": "https://www.newser.com/story/383573/house-votes-to-cancel-tariffs-on-canada-rebuking-trump.html",
    "timestamp": "2026-02-12T01:00:00Z"
  },
  {
    "title": "Lawyers Of Chicago Woman Shot By Federal Agents Say Documents Show How DHS Lies About Investigations",
    "description": "\"We just cannot trust the words of our federal officials,” one attorney said.",
    "link": "https://www.huffpost.com/entry/ap-us-federal-enforcement-chicago_n_698d1f90e4b0967ff00390f3",
    "timestamp": "2026-02-12T00:59:17Z"
  },
  {
    "title": "Breitbart Business Digest: The Great Reprivatization and the Amazing January Jobs Report",
    "description": "The acceleration of America's economic growth under President Trump is driving up hiring without the need for the arrival of hundreds of thousands of workers crossing our borders in defiance of our immigration laws.\nThe post Breitbart Business Digest: The Gre…",
    "link": "https://www.breitbart.com/economy/2026/02/11/breitbart-business-digest-the-great-reprivatization-and-the-amazing-january-jobs-report/",
    "timestamp": "2026-02-12T00:56:39Z"
  },
  {
    "title": "Trump tariffs face rare setback as US House votes to block Canada duties",
    "description": "US House lawmakers voted Wednesday to reject Donald Trump's tariffs on Canadian goods, sweeping aside the president's last-gasp threat of election consequences for Republicans to deliver a rare rebuke on his signature economic policy. \"Any Republican, in the …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-tariffs-face-rare-setback-as-us-house-votes-to-block-canada-duties/articleshow/128231871.cms",
    "timestamp": "2026-02-12T00:55:29Z"
  },
  {
    "title": "Jan. 6 rioter pardoned by Trump convicted of child molestation",
    "description": "A Jan. 6 rioter pardoned by President Donald Trump has been convicted of child molestation and other crimes, after he tried to use an anticipated payout from the Trump administration to silence one victim, according to a Florida prosecutor's office",
    "link": "https://www.nbcnews.com/news/crime-courts/jan-6-rioter-pardoned-trump-convicted-child-molestation-rcna258635",
    "timestamp": "2026-02-12T00:55:19Z"
  },
  {
    "title": "Wild Exchange: Nadler Makes Mistake of Insulting Bondi, Triggering a Scorched Earth Response Where She Brings the Receipts on His Hypocrisy and 'Gutter' Behavior",
    "description": "Wild Exchange: Nadler Makes Mistake of Insulting Bondi, Triggering a Scorched Earth Response Where She Brings the Receipts on His Hypocrisy and 'Gutter' Behaviorwesternjournal.com",
    "link": "https://www.westernjournal.com/wild-exchange-nadler-makes-mistake-insulting-bondi-triggering-scorched-earth-response-brings-receipts-hypocrisy-gutter-behavior/",
    "timestamp": "2026-02-12T00:54:35Z"
  },
  {
    "title": "In rare move, Republican-led US House challenges Trump on Canada tariffs",
    "description": "The vote highlights growing unease among lawmakers over trade policy, economic pressures on constituents, and the balance of power between Congress and the president",
    "link": "https://www.thehindubusinessline.com/news/world/in-rare-move-republican-led-us-house-challenges-trump-on-canada-tariffs/article70622335.ece",
    "timestamp": "2026-02-12T00:54:29Z"
  },
  {
    "title": "US House votes to rescind Trump tariffs on Canada",
    "description": "WASHINGTON: US House lawmakers voted on Wednesday (Feb 12) to reject Donald Trump's tariffs on Canadian goods, sweeping aside the president's last-gasp threat of election consequences for Republicans to deliver a rare rebuke on his signature economic policy.T…",
    "link": "https://www.channelnewsasia.com/world/us-house-votes-rescind-trump-tariffs-canada-5924841",
    "timestamp": "2026-02-12T00:46:35Z"
  },
  {
    "title": "US Will Send Troops to Nigeria to Train the Military to Fight Extremism",
    "description": "DAKAR, Senegal (AP) — The United States is sending troops to Nigeria to help train the West African nation's military in fighting extremism, Nigerian authorities said Wednesday, as a multifaceted security crisis spreads in the north of the country.The America…",
    "link": "https://freerepublic.com/focus/f-chat/4366498/posts",
    "timestamp": "2026-02-12T00:46:26Z"
  },
  {
    "title": "'Very chilling': GOP senators slam Trump admin's bungled indictment attempt against Dems",
    "description": "With President Donald Trump's Justice Department trying, and failing, to secure a criminal indictment against Sens. Mark Kelly (D-AZ) and Elissa Slotkin (D-MI) for their roles in a video advising active-duty troops they must refuse illegal orders, Senate Repu…",
    "link": "https://www.rawstory.com/senate-gop-2675261016/",
    "timestamp": "2026-02-12T00:46:09Z"
  },
  {
    "title": "Exclusive-Pentagon pushing AI companies to expand on classified networks, sources say",
    "description": "Feb 11 : The Pentagon is pushing the top AI companies including OpenAI and Anthropic to make their artificial-intelligence tools available on classified networks without many of the standard restrictions that the companies apply to users. During a White House…",
    "link": "https://www.channelnewsasia.com/business/exclusive-pentagon-pushing-ai-companies-expand-classified-networks-sources-say-5925036",
    "timestamp": "2026-02-12T00:45:40Z"
  }
]