[
  {
    "title": "Dismantling Public Education Is Dismantling Religious Freedom for Our Students | Opinion",
    "description": "The Trump administration recently announced the firing of nearly a third of all U.S. Department of Education workers. It's the latest step in their effort to gut the department, with the ultimate goal of fully dismantling it, despite having no legal authority…",
    "link": "https://biztoc.com/x/3a5ab8f1a5bcb1c8",
    "timestamp": "2025-03-13T19:55:53Z"
  },
  {
    "title": "The Kitchen restaurant in Boulder receives second bomb threat this year",
    "description": "The Kitchen is co-owned by Kimbal Musk, the brother of Elon Musk, the brother of Tesla owner and President Donald Trump advisor Elon Musk.",
    "link": "https://www.denverpost.com/2025/03/13/kitchen-restaurant-boulder-bomb-threat-elon-kimbal-musk/",
    "timestamp": "2025-03-13T19:55:33Z"
  },
  {
    "title": "Thousands Sign Christian Petition to Boycott 'Trump-Backing' Corporations",
    "description": "As part of their Lenten fast, more than 12,000 people have signed a petition launched by Christian organization Faithful America, committing to boycott \"one or more\" corporations that the group says align with President Donald Trump and his policies.\nNewsweek…",
    "link": "https://biztoc.com/x/5c3d2e94afd213d9",
    "timestamp": "2025-03-13T19:55:31Z"
  },
  {
    "title": "If Trump Wants New Pressure on Moscow, Oil and Gas Is 'Only Thing Left'",
    "description": "President Donald Trump said Wednesday that the United States can do \"devastating\" things to Russia's economy to put pressure on Moscow to accept a peace deal with Ukraine.\nBut there's a limit to what Trump can do to try and bend Russia to his will, analysts w…",
    "link": "https://biztoc.com/x/3845d8e3adc0e67d",
    "timestamp": "2025-03-13T19:55:29Z"
  },
  {
    "title": "Dismantling Public Education Is Dismantling Religious Freedom for Our Students | Opinion",
    "description": "Protect public education, defend religious freedom, and take action.",
    "link": "https://www.newsweek.com/dismantling-public-education-dismantling-religious-freedom-our-students-opinion-2044445",
    "timestamp": "2025-03-13T19:54:53Z"
  },
  {
    "title": "How to shop amid tariff uncertainty",
    "description": "More tariffs may be ahead, but there are ways consumers can prepare.",
    "link": "https://www.bostonherald.com/2025/03/13/how-to-shop-amid-tariff-uncertainty/",
    "timestamp": "2025-03-13T19:54:06Z"
  },
  {
    "title": "Trump wants Democrats to keep fighting for trans athletes in girls' sports: 'Don't think they can win a race'",
    "description": "Donald Trump suggested he hopes the Democratic party continues to push its stance on trans athletes in women's sports to hurt its future election prospects.",
    "link": "https://www.foxnews.com/sports/trump-wants-democrats-keep-fighting-trans-athletes-girls-sports-dont-think-can-win-race",
    "timestamp": "2025-03-13T19:54:03Z"
  },
  {
    "title": "Steven Soderbergh on 'Black Bag,' 'Contagion' Sequel and Donald Trump - Variety",
    "description": "Steven Soderbergh on 'Black Bag,' 'Contagion' Sequel and Donald TrumpVariety ‘Black Bag’ Review: Blanchett v. FassbenderThe New York Times ‘Black Bag’ Review: Steven Soderbergh’s Sly Spy ThrillerThe Wall Street Journal Cate Blanchett Shares What Gave Her ‘Low…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176705451",
    "timestamp": "2025-03-13T19:52:52Z"
  },
  {
    "title": "Trump’s Immigration Crackdown Is Specifically Targeting Children Again",
    "description": "Immigration officials are threatening to prioritize unaccompanied immigrant children for deportation.",
    "link": "https://slate.com/news-and-politics/2025/03/trump-immigration-deportation-children-trafficking.html",
    "timestamp": "2025-03-13T19:52:32Z"
  },
  {
    "title": "The Bitcoin Strategic Reserve Happened….Now What?",
    "description": "Many believed this would set off a massive rally as demand for bitcoin surged.",
    "link": "https://www.forbes.com/sites/alexanderblume/2025/03/13/the-bitcoin-strategic-reserve-happenednow-what/",
    "timestamp": "2025-03-13T19:51:55Z"
  },
  {
    "title": "IATSE Urges Against Kennedy Center Cancellations, Citing Removal Of “Critical Opportunities” For Crew",
    "description": "Amid a string of recent show cancellations at the Kennedy Center, the union that represents its crew is attempting to shine a light on the negative impact such moves can have on those behind-the-scenes workers. “When productions walk away, it leaves more than…",
    "link": "http://deadline.com/2025/03/iatse-urges-against-kennedy-center-cancellations-1236325662/",
    "timestamp": "2025-03-13T19:51:24Z"
  },
  {
    "title": "Oil Drops Below $67 as Trade War Fears Weigh on Demand",
    "description": "A bearish economic outlook, coupled with rising supply and geopolitical shifts, pushed oil prices lower.",
    "link": "https://www.rigzone.com/news/wire/oil_drops_below_67_as_trade_war_fears_weigh_on_demand-13-mar-2025-179916-article/",
    "timestamp": "2025-03-13T19:50:31Z"
  },
  {
    "title": "Loblaw clarifies made in Canada label confusion amid tariffs",
    "description": "No grocery store label is safe from the scrutiny of Canadian shoppers during the Canada-United States tariff war.\r\nThe federal government's initial retaliatory tariffs saw a long list of grocery items impacted by the 25 per cent duty.\r\nU.S. President Donald T…",
    "link": "https://dailyhive.com/toronto/tariffs-canada-loblaw-labelling",
    "timestamp": "2025-03-13T19:50:26Z"
  },
  {
    "title": "Thousands Sign Christian Petition to Boycott 'Trump-Backing' Corporations",
    "description": "For Lent, more than 12,000 people have pledged to boycott companies that Faithful America says is aligned with the president and his policies.",
    "link": "https://www.newsweek.com/thousands-sign-christian-petition-boycott-trump-backing-corporations-2044419",
    "timestamp": "2025-03-13T19:50:03Z"
  },
  {
    "title": "Fierce backlash forces California Dems to pull bill that would have destroyed self-defense rights",
    "description": "Democrats in California shut down an effort to erode self-defense rights after massive backlash from their constituents and Second Amendment advocates. \nAssemblyman Rick Chavez Zbur, a Democrat, said that misinformation had made him pull the bill that would h…",
    "link": "https://www.theblaze.com/news/calif-dems-pull-selfdefense-law",
    "timestamp": "2025-03-13T19:50:00Z"
  },
  {
    "title": "AtkinsRealis sells stake in 407 highway, rounding off turn to pure-play engineering",
    "description": "MONTREAL — AtkinsRealis Group Inc. announced the sale of its remaining stake in Ontario’s 407 toll highway operator in a $2.79 billion deal that caps off the company’s conversion into a pure-play engineering firm. The Montreal-based company said Thursday it h…",
    "link": "https://financialpost.com/pmn/atkinsrealis-sells-stake-in-407-highway-rounding-off-turn-to-pure-play-engineering-3",
    "timestamp": "2025-03-13T19:49:41Z"
  },
  {
    "title": "Greenland takeover by United States ‘will happen’, Trump predicts",
    "description": "US president says he still has a good relationship with North Korea as he meets Nato chief",
    "link": "https://www.irishtimes.com/world/us/2025/03/13/greenland-takeover-by-united-states-will-happen-trump-predicts/",
    "timestamp": "2025-03-13T19:49:26Z"
  },
  {
    "title": "'Capitulated and groveled': Author issues blistering attack as media ignores Trump book",
    "description": "Author Michael Wolff claimed Thursday that the news media is so terrified of President Donald Trump and his threat of lawsuits that they won't go near his new book on the president.Wolff described his book, All or Nothing: How Trump Recaptured America, as \"an…",
    "link": "https://www.rawstory.com/media-fears-trump/",
    "timestamp": "2025-03-13T19:48:03Z"
  },
  {
    "title": "'Cloak of secrecy' over Apple and Home Office showdown must be removed, US politicians tell tribunal",
    "description": "A 'cloak of secrecy' created by the UK in its encryption showdown with Apple must be removed, according to a cross-party group of politicians in America.",
    "link": "https://news.sky.com/story/cloak-of-secrecy-over-apple-and-home-office-showdown-must-be-removed-us-politicians-tell-tribunal-13328050",
    "timestamp": "2025-03-13T19:48:00Z"
  },
  {
    "title": "Arizona Democrats say they’ll vote against GOP bill to avert shutdown",
    "description": "A pair of Senate Democrats from a key battleground state on Thursday said that they would vote against the GOP’s six-month spending bill, raising questions about the possibility of a government shutdown when funding expires on Friday. Arizona Sens. Mark Kelly…",
    "link": "https://freerepublic.com/focus/f-news/4304079/posts",
    "timestamp": "2025-03-13T19:47:43Z"
  },
  {
    "title": "If Trump Wants New Pressure on Moscow, Oil and Gas Is 'Only Thing Left'",
    "description": "The president's best option to pressure Putin is the one thing he might be least willing to do: put a much tighter squeeze on Russia's oil and gas exports.",
    "link": "https://www.newsweek.com/if-trump-wants-new-pressure-moscow-oil-gas-only-thing-left-2044476",
    "timestamp": "2025-03-13T19:47:28Z"
  },
  {
    "title": "China’s Growing Concerns Over India-US Relations",
    "description": "Beijing wants to believe that friction with Trump will push India toward China. That’s a flawed assumption – but one that speaks to Chinese anxieties.",
    "link": "https://thediplomat.com/2025/03/chinas-growing-concerns-over-india-us-relations/",
    "timestamp": "2025-03-13T19:47:00Z"
  },
  {
    "title": "Duda: US nuclear weapons in Poland would be 'deterrent' for Russia",
    "description": "Andrzej Duda tells the BBC's Jeremy Bowen he is confident Donald Trump has a plan to handle Russia.",
    "link": "https://www.bbc.com/news/articles/ce98ym8k89do",
    "timestamp": "2025-03-13T19:46:52Z"
  },
  {
    "title": "Andrzej Duda: US nuclear weapons in Poland would be 'deterrent' for Russia",
    "description": "Andrzej Duda tells the BBC's Jeremy Bowen he is confident Donald Trump has a plan to handle Russia.",
    "link": "https://www.bbc.co.uk/news/articles/ce98ym8k89do",
    "timestamp": "2025-03-13T19:46:52Z"
  },
  {
    "title": "The U.S. Could Slap 25% Tariffs on European Beauty Imports. To What Effect?",
    "description": "The trade flow of fragrance and cosmetics from the EU to U.S. equaled $4.96 billion in 2023, according to the Fédération des Entreprises de la Beauté.",
    "link": "http://wwd.com/beauty-industry-news/beauty-features/us-could-slap-25-tariffs-european-beauty-imports-why-it-matters-1237046582/",
    "timestamp": "2025-03-13T19:45:47Z"
  },
  {
    "title": "Wall Street stocks sink on fresh Donald Trump tariff threats",
    "description": "Wall Street stocks sink on fresh Donald Trump tariff threats\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade war, follow the latest on tariffs and executiv…",
    "link": "https://biztoc.com/x/41849ad97b8b61a7",
    "timestamp": "2025-03-13T19:45:46Z"
  },
  {
    "title": "How Many Executive Orders Has Donald Trump Signed Compared to Joe Biden?",
    "description": "President Donald Trump has used executive orders to push through his policy agenda, issuing nearly 90 in just two months. While supporters view his approach as decisive leadership in the face of legislative gridlock, his heavy reliance on executive action has…",
    "link": "https://biztoc.com/x/d2cde2b55dda9fc7",
    "timestamp": "2025-03-13T19:45:43Z"
  },
  {
    "title": "Trump asks SCOTUS to allow birthright citizenship ban",
    "description": "United States President Donald Trump's administration asked the US Supreme Court (SCOTUS) on Thursday to allow him to carry out his plans of ending birthright citizenship after three federal appeals c...",
    "link": "https://biztoc.com/x/60140443e0e64e04",
    "timestamp": "2025-03-13T19:45:26Z"
  },
  {
    "title": "All eyes on Democrats as US barrels toward shutdown deadline",
    "description": "<p>WASHINGTON - The US government, already shaken to its core by Donald Trump's radical reforms, could begin shutting down entirely at the weekend as Democrats face the stark option of opposing the president's federal funding plans -- even if it blows up in t…",
    "link": "https://www.bangkokpost.com/world/2979423/all-eyes-on-democrats-as-us-barrels-toward-shutdown-deadline",
    "timestamp": "2025-03-13T19:45:00Z"
  },
  {
    "title": "Union Busting - In one of this morning's Daily Presidential Rants, Donald Trump insisted ... (Kevin Kruse/Campaign Trails)",
    "description": "Kevin Kruse / Campaign Trails:\nUnion Busting  —  In one of this morning's Daily Presidential Rants, Donald Trump insisted - as he has many times before - that the European Union was “formed for the primary purpose of ‘screwing’ the United States of America.” …",
    "link": "https://www.memeorandum.com/250313/p119",
    "timestamp": "2025-03-13T19:45:00Z"
  },
  {
    "title": "Shall We See How the President's Brilliant Trade War Strategies Are Affecting The Folks?",
    "description": "If the trade war has a front line, it probably runs through places like Point Roberts in Washington state.",
    "link": "https://www.esquire.com/news-politics/politics/a64177660/trump-tariffs-pressure-us-farmers/",
    "timestamp": "2025-03-13T19:45:00Z"
  },
  {
    "title": "Michelle Obama makes first public appearance since skipping President Trump’s inauguration",
    "description": "The former first lady's last public appearance was in December 2024 on \"The Jennifer Hudson Show.\"",
    "link": "https://pagesix.com/2025/03/13/celebrity-news/michelle-obama-makes-first-public-appearance-since-skipping-trumps-inauguration/",
    "timestamp": "2025-03-13T19:43:52Z"
  },
  {
    "title": "Carville: Trump’s Second Term ‘Serious Crisis,’ ‘Entire Idea of the United States Is in Jeopardy’",
    "description": "Democratic strategist James Carville said Wednesday on “The Chris Cuomo Project” podcast that he believed President Donald Trump’s second term is the most “serious crisis” the United States has ever faced. Carville said, “I think right now, and I’m going be v…",
    "link": "https://freerepublic.com/focus/f-bloggers/4304078/posts",
    "timestamp": "2025-03-13T19:43:49Z"
  },
  {
    "title": "iPhone users rejoice: Apple secretly rolls out new feature that could revolutionize the experience for over 300 million users; here’s what you need to know",
    "description": "Apple's new Shazam update simplifies music discovery for iPhone users. Identified songs can now be directly added to Spotify or Apple Music playlists without opening the Shazam app. Users need to install Shazam, add the 'Recognise Music' control to the Contro…",
    "link": "https://economictimes.indiatimes.com/news/international/us/iphone-users-rejoice-apple-secretly-rolls-out-new-feature-that-could-revolutionize-the-experience-for-over-300-million-users-heres-what-you-need-to-know/articleshow/118992140.cms",
    "timestamp": "2025-03-13T19:43:48Z"
  },
  {
    "title": "Do voters fear PM Peter Dutton would be a surprise packet?",
    "description": "Peter Dutton is tantalisingly close to power, but the last steps will be the hardest.",
    "link": "https://www.abc.net.au/news/2025-03-14/do-voters-fear-pm-peter-dutton-would-be-a-surprise-packet/105049370",
    "timestamp": "2025-03-13T19:43:34Z"
  },
  {
    "title": "EU Poised to Back Extension of Sanctions on Russian Tycoons",
    "description": "The European Union is nearing an agreement to extend sanctions on individual Russians, including a number of billionaires, after Hungary dropped its opposition.",
    "link": "https://www.livemint.com/companies/news/eu-poised-to-back-extension-of-sanctions-on-russian-tycoons-11741895000776.html",
    "timestamp": "2025-03-13T19:43:20Z"
  },
  {
    "title": "Trump Rewrites History to Help Vladimir Putin",
    "description": "Donald Trump is once again rewriting history to make it seem like Russian President Vladimir Putin never invaded Ukraine. \r\nDuring an appearance Thursday in the Oval Office with NATO Secretary General Mark Rutte, Trump seemed unsure whether Russia would forfe…",
    "link": "https://newrepublic.com/post/192727/donald-trump-rewrites-history-vladimir-putin",
    "timestamp": "2025-03-13T19:43:13Z"
  },
  {
    "title": "How Many Executive Orders Has Donald Trump Signed Compared to Joe Biden?",
    "description": "Donald Trump has signed 89 executive orders in his second term—more than double Biden at the same point in his first term.",
    "link": "https://www.newsweek.com/how-many-executive-orders-has-donald-trump-signed-compared-joe-biden-2044396",
    "timestamp": "2025-03-13T19:39:52Z"
  },
  {
    "title": "Director Raoul Peck Compares Trump’s Political Agenda to ‘Mein Kampf’",
    "description": "Haitian filmmaker Raoul Peck went off on an extended rant against Donald Trump during an interview at the Joburg Film Festival this week, calling Trump and his followers Nazis and insisting that the administration is filled with “crazy people” who are putting…",
    "link": "https://freerepublic.com/focus/f-news/4304077/posts",
    "timestamp": "2025-03-13T19:39:48Z"
  },
  {
    "title": "Trump administration asks Supreme Court to let birthright citizenship changes proceed",
    "description": "Trump has said he thinks the Supreme Court will let him restrict birthright citizenship to bolster security along the southern border.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/13/trump-supreme-court-birthright-executive-order-citizenship/79302891007/",
    "timestamp": "2025-03-13T19:38:03Z"
  },
  {
    "title": "Alberta brewers concerned about cost of beer cans amid aluminum tariff war",
    "description": "Not even cracking open a cold one is safe from tariffs. As the Canada-U.S. trade war continues to dominate headlines, Alberta's beer industry is paying close attention to how this is impacting the price of metal cans.",
    "link": "https://www.cbc.ca/news/canada/calgary/beer-cans-aluminum-tariffs-canada-us-trade-war-alberta-1.7482686",
    "timestamp": "2025-03-13T19:37:03Z"
  },
  {
    "title": "From inflation to trade battles; here are 5 key risks that could derail the U.S. economy under Donald Trump",
    "description": "Investors worry about five main risks to the US economy under President Trump: rising inflation, falling consumer confidence, uncertain tariffs and trade wars, declining stock markets, and the Federal Reserve's handling of interest rates. These factors contri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/from-inflation-to-trade-battles-here-are-5-key-risks-that-could-derail-the-u-s-economy-under-donald-trump/articleshow/118991239.cms",
    "timestamp": "2025-03-13T19:36:34Z"
  },
  {
    "title": "4 Factors That Could Affect Your Debt — and What You Can Do",
    "description": "Tariffs, interest rates and policy changes could affect your debt load. Here's what experts say to watch for, and how to manage your debt in a changing economy.",
    "link": "https://www.nerdwallet.com/article/finance/factors-that-could-affect-your-debt-and-what-you-can-do#article",
    "timestamp": "2025-03-13T19:35:33Z"
  },
  {
    "title": "Trump Asks Supreme Court to Resolve Birthright Citizenship Question",
    "description": "The White House filed a series of appeals to the Supreme Court on Thursday, asking the justices to allow President Donald Trump's executive order on birthright citizenship to be implemented in part after several federal judges blocked it from going forward.\nW…",
    "link": "https://biztoc.com/x/839d85874e357637",
    "timestamp": "2025-03-13T19:35:28Z"
  },
  {
    "title": "'Nobody wants to give bad news': Analyst claims Trump being kept in 'bubble' by handlers",
    "description": "During his first term as president, Donald Trump bitterly clashed with a long list of conservative Republicans who served in his administration — including those he chose for secretary of state (Rex Tillerson), national security adviser (John Bolton) and Whit…",
    "link": "https://www.rawstory.com/nobody-wants-to-give-him-bad-news-analyst-claims-trump-being-kept-in-bubble-by-handle/",
    "timestamp": "2025-03-13T19:35:28Z"
  },
  {
    "title": "Watch: Police Move in as Agitators Refuse Order to Leave Trump Tower",
    "description": "Protesters jammed NYC's trump Tower on Thursday in support of a pro-Hamas sympathizer who led anti-Semitic campus protests last year.",
    "link": "https://www.westernjournal.com/watch-police-move-agitators-refuse-order-leave-trump-tower/",
    "timestamp": "2025-03-13T19:35:12Z"
  },
  {
    "title": "Trump Asks Supreme Court to Resolve Birthright Citizenship Question",
    "description": "The president  is appealing to the justices to help facilitate his birthright citizenship plan, signed by executive order but immediately blocked by lower courts.",
    "link": "https://www.newsweek.com/trump-asks-supreme-court-resolve-birthright-citizenship-question-2044482",
    "timestamp": "2025-03-13T19:33:53Z"
  },
  {
    "title": "Universities that enable protest encampments would lose funding under proposed law",
    "description": "New legislation aims to penalize college campuses that enable protest encampments, which were a widespread phenomenon last year as a means of protesting the war between Israel and Hamas.",
    "link": "https://www.foxnews.com/politics/universities-enable-protest-encampments-lose-funding-under-proposed-law",
    "timestamp": "2025-03-13T19:31:47Z"
  },
  {
    "title": "Trump asks Europe again for more defence cash, leaves NATO strategy elusive",
    "description": "The number of countries paying their share of defence costs in NATO “should be higher, much higher,” US President Donald Trump said while sitting next to NATO chief Mark Rutte in the Oval Office on Thursday.\nTrump’s request is not a surprise. His number one a…",
    "link": "https://biztoc.com/x/c85c6e343e473f1f",
    "timestamp": "2025-03-13T19:31:46Z"
  },
  {
    "title": "Variable-rate mortgages continue to lure borrowers, despite the risks",
    "description": "Variable-rate mortgages continue to lure borrowers as interest rates drop, but be aware of rising inflation expectations. Find out more.",
    "link": "https://financialpost.com/real-estate/mortgages/mortgage-rates/variable-rate-mortgages-lure-borrowers-despite-risks",
    "timestamp": "2025-03-13T19:31:25Z"
  },
  {
    "title": "‘I love my mother-in-law’, Vance tells media over DEI scrutiny",
    "description": "US Vice President J.D. Vance has defended his family member over reports of her support for Diversity, Equity, and Inclusion Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614166-us-vance-dei-criticism/",
    "timestamp": "2025-03-13T19:31:04Z"
  },
  {
    "title": "Transgender lawmaker slams Republicans' 'bizarre' focus on culture wars",
    "description": "Rep. Sarah McBride, the first openly transgender member of Congress, accused Republicans of being \"obsessed with culture war issues,\" saying the focus was \"weird\" and \"bizarre.\"",
    "link": "https://www.foxnews.com/politics/transgender-lawmaker-slams-republicans-bizarre-focus-culture-wars",
    "timestamp": "2025-03-13T19:30:15Z"
  },
  {
    "title": "US Deports 10-Year-Old Girl Who Was Partway Through Brain Cancer Treatment",
    "description": "A 10-year-old girl is now unable to continue her brain cancer treatment after she was deported by US immigration authorities to Mexico, NBC News reports. The girl, an American citizen, and her four siblings, were forced out of the country when the US Customs …",
    "link": "https://futurism.com/neoscope/us-deported-girl-brain-cancer",
    "timestamp": "2025-03-13T19:29:25Z"
  },
  {
    "title": "Required Reading",
    "description": "This week: Isabella Hammad on Etel Adnan, a mural for Emily Pike, the problem with mainstream film, experimental ASMR, legalizing bodega cats, and much more.",
    "link": "http://hyperallergic.com/995932/required-reading-724/",
    "timestamp": "2025-03-13T19:28:38Z"
  },
  {
    "title": "Trump asks Supreme Court to intervene on blocks to his birthright citizenship order",
    "description": "The Trump administration is asking the Supreme Court to significantly narrow nationwide injunctions blocking his order redefining birthright citizenship in the U.S.",
    "link": "https://abcnews.go.com/Politics/trump-asks-supreme-court-intervene-blocks-birthright-citizenship/story?id=119767488",
    "timestamp": "2025-03-13T19:28:20Z"
  },
  {
    "title": "Mass. budget observers warn against ‘preemptive panic’ amid federal funding threats",
    "description": "Massachusetts budget observers and key lawmakers are cautioning against panic and rash decisions amid threats to federal funding.",
    "link": "https://www.bostonherald.com/2025/03/13/mass-budget-observers-warn-against-preemptive-panic-amid-federal-funding-threats/",
    "timestamp": "2025-03-13T19:28:08Z"
  },
  {
    "title": "Trump Takes Birthright Citizenship To Supreme Court: Here’s Where Trump And Musk Are Winning—And Losing—In Court",
    "description": "Dozens of lawsuits have been filed challenging the Trump administration’s policies.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/13/trump-takes-birthright-citizenship-to-supreme-court-heres-where-trump-and-musk-are-winning-and-losing-in-court/",
    "timestamp": "2025-03-13T19:28:03Z"
  },
  {
    "title": "Trump asks Supreme Court to review ban on birthright citizenship",
    "description": "The White House argues that nationwide injunctions blocking President Donald Trump's birthright citizenship executive order are overly broad and has asked the Supreme Court for relief.",
    "link": "https://www.foxnews.com/politics/trump-asks-supreme-court-review-ban-birthright-citizenship",
    "timestamp": "2025-03-13T19:27:50Z"
  },
  {
    "title": "Director Raoul Peck Compares Trump's Political Agenda to 'Mein Kampf'",
    "description": "Haitian filmmaker Raoul Peck went off on an extended rant against Donald Trump during an interview at the Joburg Film Festival this week, calling Trump and his followers Nazis and insisting that the administration is filled with \"crazy people\" who are putting…",
    "link": "https://www.breitbart.com/entertainment/2025/03/13/director-raoul-peck-compares-trumps-political-agenda-to-mein-kampf/",
    "timestamp": "2025-03-13T19:26:38Z"
  },
  {
    "title": "As Social Security faces an uncertain future, some question whether the program should be privatized",
    "description": "New leadership in Washington has prompted questions about Social Security's future. Some experts say privatizing the program could be the answer.",
    "link": "https://www.cnbc.com/2025/03/13/as-social-security-faces-an-uncertain-future-some-say-it-should-be-privatized.html",
    "timestamp": "2025-03-13T19:25:01Z"
  },
  {
    "title": "Trump on U.S. annexation of Greenland: 'I think it'll happen' (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump on U.S. annexation of Greenland: 'I think it'll happen' … President Donald Trump said Thursday that he thought that the potential annexation of Greenland by the United States would happen.  —  Trump defended that idea, saying the U.S.…",
    "link": "https://www.memeorandum.com/250313/p117",
    "timestamp": "2025-03-13T19:25:00Z"
  },
  {
    "title": "Metals Mayhem Hits American Manufacturing and Trade Ties",
    "description": "On today’s Big Take DC podcast: The impact Trump’s metals tariffs could have on the US economy and its relationships with some of its closest allies.",
    "link": "https://financialpost.com/pmn/business-pmn/metals-mayhem-hits-american-manufacturing-and-trade-ties",
    "timestamp": "2025-03-13T19:24:48Z"
  },
  {
    "title": "Government Shutdown Possible Tomorrow: How Your Taxes Might Suffer",
    "description": "The House passed a measure to keep the government funded, but the shutdown threat is still present because the bill may lack votes in the Senate.",
    "link": "https://www.cnet.com/personal-finance/taxes/government-shutdown-possible-tomorrow-how-your-taxes-might-suffer/",
    "timestamp": "2025-03-13T19:24:13Z"
  },
  {
    "title": "Trump says Zelenskyy 'has no cards', but this minerals deal may be one",
    "description": "Washington and Kyiv both say they're keen to sign a deal that would give the US a future stake in Ukraine's vast state-owned mineral wealth. This is why Donald Trump wants access to it.",
    "link": "https://www.abc.net.au/news/2025-03-14/donald-trump-volodymyr-zelenskyy-minerals-deal-explained/105050048",
    "timestamp": "2025-03-13T19:24:13Z"
  },
  {
    "title": "Elon Musk wants to use AI to run US gov’t, but experts say ‘very bad’ idea",
    "description": "Gov't use of AI can go wrong in many ways, experts say, including lack of transparency on how tools are trained.",
    "link": "https://www.aljazeera.com/economy/2025/3/13/elon-musk-wants-to-use-ai-to-run-us-govt-but-experts-say-very-bad-idea",
    "timestamp": "2025-03-13T19:23:48Z"
  },
  {
    "title": "Ukraine worried about Russia’s maximalist demands as Trump open to direct talks with Putin",
    "description": "\"Ukraine made it clear that it will not recognise Russia's rights over our territory,” a Ukrainian official told reporters.",
    "link": "https://www.euractiv.com/section/politics/news/ukraine-worried-about-russias-maximalist-demands-as-trump-open-to-direct-talks-with-putin/",
    "timestamp": "2025-03-13T19:23:03Z"
  },
  {
    "title": "Left-Wing Group Indivisible Tells Local Activists: We Will Reimburse Your DOGE Protest Expenses, Including 'Chicken Suits'",
    "description": "Indivisible, the left-wing group behind red-district town hall protests targeting Elon Musk's DOGE, is providing local activists with a \"reimbursement program\" that covers certain expenses associated with opposing what it calls the \"Trump-Musk coup.\" Included…",
    "link": "https://freebeacon.com/democrats/left-wing-group-indivisible-tells-local-activists-we-will-reimburse-your-doge-protest-expenses-including-chicken-suits/",
    "timestamp": "2025-03-13T19:22:18Z"
  },
  {
    "title": "Trump asks Europe again for more defence cash, leaves NATO strategy elusive",
    "description": "Rutte visits White House while Trump piles Ukraine and European capitals with threats",
    "link": "https://www.euractiv.com/section/defence/news/trump-asks-europe-again-for-more-defence-cash-leaves-nato-strategy-elusive/",
    "timestamp": "2025-03-13T19:22:09Z"
  },
  {
    "title": "DOGE may be using an algorithm to fire federal workers",
    "description": "In the past month and a half, the Trump Administration has drastically reduced the federal government workforce.\r\n\n\n\n\nThe cuts alone have generated concern and anger among workers and those who rely on US government services. Adding to the angst: a new concer…",
    "link": "https://www.computerworld.com/article/3845336/doge-may-be-using-an-algorithm-to-fire-federal-workers.html",
    "timestamp": "2025-03-13T19:22:06Z"
  },
  {
    "title": "Enough Is Enough: Supreme Court Rules First Amendment Does Not Apply To Meghan Markle",
    "description": "WASHINGTON, D.C. — In a landmark unanimous decision, the United States Supreme Court ruled that the First Amendment, guaranteeing the right of free speech to American citizens, does not apply to Meghan Markle.",
    "link": "https://babylonbee.com/news/enough-is-enough-supreme-court-rules-first-amendment-does-not-apply-to-meghan-markle",
    "timestamp": "2025-03-13T19:20:44Z"
  },
  {
    "title": "AtkinsRealis sells stake in 407 highway, rounding off turn to pure-play engineering",
    "description": "MONTREAL — AtkinsRealis Group Inc. announced the sale of its remaining stake in Ontario’s 407 toll highway operator in a $2.79 billion deal that caps off the company’s conversion into a pure-play engineering firm. The Montreal-based company said Thursday it h…",
    "link": "https://financialpost.com/pmn/atkinsrealis-sells-stake-in-407-highway-rounding-off-turn-to-pure-play-engineering-2",
    "timestamp": "2025-03-13T19:20:21Z"
  },
  {
    "title": "White House Abruptly Yanks CDC Nomination of Dave Weldon, Longtime Vaccine Skeptic",
    "description": "The Trump administration withdrew Weldon's nomination just minutes before a crucial Senate committee hearing.",
    "link": "https://gizmodo.com/white-house-abruptly-yanks-cdc-nomination-of-dave-weldon-longtime-vaccine-skeptic-2000575701",
    "timestamp": "2025-03-13T19:20:19Z"
  },
  {
    "title": "Michael Wolff Claims to Have Been Banned From News Networks Over Latest Trump Book",
    "description": "Writer and journalist Michael Wolff has written three bestselling books about President Donald Trump that were extensively covered by the major news networks. He recently released his fourth book All or Nothing: How Trump Recaptured America, which would also …",
    "link": "https://www.adweek.com/tvnewser/michael-wolff-banned-donald-trump-all-or-nothing/",
    "timestamp": "2025-03-13T19:20:01Z"
  },
  {
    "title": "US judge orders federal agencies to rehire fired workers",
    "description": "A US judge on Thursday ordered six federal agencies to rehire thousands of probationary workers fired as part of Donald Trump's push to slash the size and...",
    "link": "https://www.yahoo.com/news/us-federal-judge-orders-agencies-184130875.html",
    "timestamp": "2025-03-13T19:19:05Z"
  },
  {
    "title": "Trump Doubles-Down on Tariff Plans",
    "description": "\"President Donald Trump on Thursday doubled down on his escalating tariff plans, even as his economic agenda continued to rattle investors and contribute to a weekslong stock market sell-off,\" CNBC reports. Said Trump: \"I’m not",
    "link": "https://politicalwire.com/2025/03/13/trump-doubles-down-on-tariff-plans/",
    "timestamp": "2025-03-13T19:18:32Z"
  },
  {
    "title": "Aussie cafe imposes US drink tax over Trump's 'schoolyard bullying'",
    "description": "When Ukraine's president faced a fiery meeting with Donald Trump at the White House, his plight struck a chord with a couple 16,000 kilometres away in rural Australia.",
    "link": "https://www.abc.net.au/news/2025-03-14/rural-cafe-imposes-tariffs-on-us-produce-ukraine-solidarity/105040906",
    "timestamp": "2025-03-13T19:17:37Z"
  },
  {
    "title": "Blue state's LGBT 'conversion therapy' ban violates Constitution, 'very easy case' for SCOTUS, says expert",
    "description": "The U.S. Supreme Court has agreed to take up a case challenging a Colorado law's ban on so-called \"conversion therapy\" for minors after it declined to hear a similar case last year.",
    "link": "https://www.foxnews.com/politics/blue-states-lgbt-conversion-therapy-ban-violates-constitution-very-easy-case-scotus-says-expert",
    "timestamp": "2025-03-13T19:16:49Z"
  },
  {
    "title": "Biden’s ‘green’ giveaway: What happened to $20 billion quickly dispersed?",
    "description": "'This is a setup that is prone to corruption, abuse and cronyism'",
    "link": "https://www.wnd.com/2025/03/bidens-green-giveaway-what-happened-to-20-billion-quickly-dispersed/",
    "timestamp": "2025-03-13T19:16:40Z"
  },
  {
    "title": "Trump takes his plan to end birthright citizenship to the Supreme Court",
    "description": "WASHINGTON — The Trump administration on Thursday asked the Supreme Court to narrow nationwide injunctions that blocked the president’s plan to end automatic birthright citizenship.",
    "link": "https://www.nbcnews.com/politics/supreme-court/trump-takes-plan-end-birthright-citizenship-supreme-court-rcna196314",
    "timestamp": "2025-03-13T19:15:56Z"
  },
  {
    "title": "Gutting the Department of Education Is as Cruel as It Is Stupid",
    "description": "The DOE was created to ensure equal access to public education throughout the country. Trump wants to torch the effort",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-plan-gut-department-education-stupid-cruel-1235295797/",
    "timestamp": "2025-03-13T19:15:53Z"
  },
  {
    "title": "Trump's evil has no expiration date",
    "description": "When Kamala Harris said “we’re not going back,” she was doing more than repeating a campaign slogan. She was tapping into a belief, widely shared among liberals and Democrats, that progress can’t be stopped.This was a powerful and persuasive statement at the …",
    "link": "https://www.rawstory.com/raw-investigates/trump-s-evil-has-no-expiration-date/",
    "timestamp": "2025-03-13T19:15:45Z"
  },
  {
    "title": "Judge orders Trump to rehire probationary workers let go in mass firings across multiple agencies",
    "description": "SAN FRANCISCO (AP) — A federal judge in San Francisco ordered President Donald Trump's administration to rehire thousands, if not tens of thousands, of probationary workers let go in mass firings across multiple agencies, blasting their tactics Thursday as he…",
    "link": "https://www.thesunchronicle.com/news/nation_world/judge-orders-trump-to-rehire-probationary-workers-let-go-in-mass-firings-across-multiple-agencies/article_78361d62-003f-11f0-bb1e-13fa53994f56.html",
    "timestamp": "2025-03-13T19:15:00Z"
  },
  {
    "title": "Trump administration asks Supreme Court to partly allow birthright citizenship restrictions",
    "description": "WASHINGTON — The Trump administration is asking the Supreme Court to allow restrictions on birthright citizenship to partly take effect while legal fights play out. In emergency applications filed at the high court on Thursday, the administration asked the ju…",
    "link": "https://nypost.com/2025/03/13/us-news/trump-administration-asks-supreme-court-to-partly-allow-birthright-citizenship-restrictions/",
    "timestamp": "2025-03-13T19:15:00Z"
  },
  {
    "title": "Trump Says Annexation of Greenland ‘Will Happen’",
    "description": "\"President Donald Trump said Thursday that he thought that the potential annexation of Greenland by the United States would happen,\" CNBC reports. \"Trump defended that idea, saying the U.S. needs the massive Arctic island –",
    "link": "https://politicalwire.com/2025/03/13/trump-says-annexation-of-greenland-will-happen/",
    "timestamp": "2025-03-13T19:14:11Z"
  },
  {
    "title": "Law prof suspended over exam question, class discussion can sue for First Amendment retaliation, 7th Circuit says",
    "description": "A federal appeals court has revived a First Amendment retaliation claim by a professor at the University of Illinois Chicago School of Law who used an “expurgated racial slur” on an exam question, leading to an investigation, required diversity training, a su…",
    "link": "https://www.abajournal.com/news/article/law-prof-suspended-over-exam-question-class-discussion-can-sue-for-first-amendment-retaliation-7th-circuit-says",
    "timestamp": "2025-03-13T19:14:00Z"
  },
  {
    "title": "Cooler heads must prevail with Trump – Australia shouldn’t give up on the ‘special friendship’",
    "description": "Should Australia be worried that Trump will cast it aside following his harsh words for Europe? We shouldn’t panic – our overlapping interests with the US are enduring.",
    "link": "https://theconversation.com/cooler-heads-must-prevail-with-trump-australia-shouldnt-give-up-on-the-special-friendship-252012",
    "timestamp": "2025-03-13T19:13:26Z"
  },
  {
    "title": "‘Most Logical Explanation’: Carville Floats Baseless Theory About Trump Pushing For Russia-Ukraine Ceasefire",
    "description": "James Carville suggested that Donald Trump is only pursuing a Russia-Ukraine ceasefire because Russian President Vladimir Putin directed him to do so.",
    "link": "https://dailycaller.com/2025/03/13/james-carville-theory-trump-russia-ukraine-ceasefire/",
    "timestamp": "2025-03-13T19:12:41Z"
  },
  {
    "title": "America's Insane Paw-Paw Is Tariffing Again",
    "description": "Donald Krasnov Trump reacted to the European Union (EU) retaliating against his stupid trade war which targets Republican states by announcing a massive tariff of \"200%,\" and at this point, it's not clear why he doesn't impose an eleventy bazillion percent ta…",
    "link": "https://crooksandliars.com/2025/03/200-percent-tariff-americas-insane-pawpaw",
    "timestamp": "2025-03-13T19:11:26Z"
  },
  {
    "title": "Most Americans Worried Trump Is Too Close to Russia",
    "description": "A new Reuters/Ipsos poll finds more than half of Americans, including one in four Republicans, think President Donald Trump is \"too closely aligned\" with Russia, as he radically realigns U.S. foreign policy.",
    "link": "https://politicalwire.com/2025/03/13/most-americans-think-trump-is-too-close-to-russia/",
    "timestamp": "2025-03-13T19:11:10Z"
  },
  {
    "title": "Trump’s Bizarre 51st State Obsession is Starting to Look Like Evidence of Cognitive Decline",
    "description": "Trump's bizarre obsession with insisting that Canada become the \"51st State\" has pivoted from trollish trash talk to something in which he seems to believe.\nThe post Trump’s Bizarre 51st State Obsession is Starting to Look Like Evidence of Cognitive Decline f…",
    "link": "https://www.mediaite.com/opinion/trumps-bizarre-51st-state-obsession-is-starting-to-look-like-evidence-of-cognitive-decline/",
    "timestamp": "2025-03-13T19:10:48Z"
  },
  {
    "title": "Intel's new CEO Lip-Bu Tan has a history as a successful underdog",
    "description": "\"One of the most powerful technology executives you've never heard of.\"",
    "link": "https://www.itnews.com.au/news/intels-new-ceo-lip-bu-tan-has-a-history-as-a-successful-underdog-615693?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Technology+feed",
    "timestamp": "2025-03-13T19:10:07Z"
  },
  {
    "title": "NATO Chief Silenced by Trump’s Bonkers Canada Rant",
    "description": "President Donald Trump gushed about his dreams of expanding America’s borders by taking over Canada while the NATO chief sat silently beside him. “Canada...",
    "link": "https://www.thedailybeast.com/nato-chief-mark-rutte-mum-as-trump-goes-on-bonkers-canada-rant/",
    "timestamp": "2025-03-13T19:09:58Z"
  },
  {
    "title": "Wait, What? Federal Spending Is UP Under Trump",
    "description": "President Donald Trump and multibillionaire Elon Musk have justified the chaotic and cruel federal cuts by the so-called Department of Government Efficiency by claiming that they’re saving taxpayers money.\n“We’ve taken back the money and reduced our debt to f…",
    "link": "https://crooksandliars.com/2025/03/wait-what-federal-spending-under-trump",
    "timestamp": "2025-03-13T19:09:23Z"
  },
  {
    "title": "Trump Shows Off ‘Real’ Laugh In Resurfaced Clip, And The Internet Can’t Believe It",
    "description": "“Uh, this is actually a big deal,” one social media user wrote.",
    "link": "https://www.huffpost.com/entry/donald-trump-real-laugh-resurfaced-clip_n_67d2ff3ae4b0554ff89bcc83",
    "timestamp": "2025-03-13T19:07:05Z"
  }
]