[
  {
    "title": "Jobs in USA: Massive lay offs could happen soon in USA, warn experts",
    "description": "Job lay offs threat is getting more prominent even as analysts are keeping a close eye on US economic data this week.",
    "link": "https://economictimes.indiatimes.com/news/international/us/jobs-in-usa-massive-lay-offs-could-happen-soon-in-usa-warn-experts/articleshow/121628651.cms",
    "timestamp": "2025-06-04T16:44:41Z"
  },
  {
    "title": "Nolte: Media Fail -- Trump Tops Obama’s Job Approval Rating",
    "description": "More voters approve of the job President Trump is doing than approved of the job former President Barry Obama was doing on this same day during Barry’s second term.\nThe post Nolte: Media Fail — Trump Tops Obama’s Job Approval Rating appeared first on Breitbar…",
    "link": "https://www.breitbart.com/the-media/2025/06/04/nolte-media-fail-trump-tops-obamas-job-approval-rating/",
    "timestamp": "2025-06-04T16:44:19Z"
  },
  {
    "title": "Trump Attacked One of His Top Allies Out of the Blue. We Know Why.",
    "description": "The brute force of Trump’s political power means that, for now at least, the president has the whip hand.",
    "link": "https://slate.com/news-and-politics/2025/06/why-trump-attacks-leonard-leo-explained.html",
    "timestamp": "2025-06-04T16:43:36Z"
  },
  {
    "title": "Big government is still good, even with Trump in power",
    "description": "It’s easy to look at Donald Trump’s second term and conclude that the less power and reach the federal government has, the better. After all, a smaller government might provide Trump or someone like him with fewer opportunities to disrupt people’s lives, leav…",
    "link": "https://biztoc.com/x/8fa3fd9d42a74d9d",
    "timestamp": "2025-06-04T16:43:35Z"
  },
  {
    "title": "MAGA destroys top job applicant who 'debased' himself to hide woke past: report",
    "description": "In a shocking turn of events, University of Michigan President Santa Ono's bid for the top job at the University of Florida went up in flames, thanks to Florida's far-right political machine. Ono, who resigned from his Michigan post in May to pursue the Flori…",
    "link": "https://www.rawstory.com/santa-ono/",
    "timestamp": "2025-06-04T16:42:58Z"
  },
  {
    "title": "Iran's Khamenei rejects US zero uranium enrichment demand as '100% against' its interests",
    "description": "Iran opposes US demands to halt uranium enrichment, with Khamenei asserting Iran’s capability to produce nuclear fuel and its nuclear program as a matter of national pride.",
    "link": "https://www.foxnews.com/world/irans-khamenei-rejects-us-zero-uranium-enrichment-demand-100-against-its-interests",
    "timestamp": "2025-06-04T16:42:57Z"
  },
  {
    "title": "Zelenskyy wants face-to-face talks with Putin. Putin says there’s nothing to talk about after Ukraine’s attacks",
    "description": "Ukrainian President Volodymyr Zelenskyy on Wednesday dismissed Russia's ceasefire proposal as \"an ultimatum\" and renewed his call for direct talks with Russian President Vladimir Putin to break the deadlock over the war, which has dragged on for nearly 3½ yea…",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-wants-face-to-face-talks-with-putin-putin-says-theres-nothing-to-talk-about-after-ukraines-attacks",
    "timestamp": "2025-06-04T16:40:49Z"
  },
  {
    "title": "Step inside \"Trump Burger,\" the Texas chain started by an immigrant obsessed with the president",
    "description": "Amid endless debate over whether or not In-N-Out, Five Guys or Shake Shack puts up the best burger, we have a new — and yuge! — contender entering the crowded upscale burger market. From Deseret News: A Donald Trump impersonator, dozens of American flags and …",
    "link": "https://freerepublic.com/focus/f-chat/4320953/posts",
    "timestamp": "2025-06-04T16:40:15Z"
  },
  {
    "title": "Sen. Democrats Call for Stop to Funneling Money to Starlink in States",
    "description": "Since taking office, Trump and his administration have hit the $42.5 billion Broadband Equity, Access, and Deployment fund with several major roadblocks.",
    "link": "https://gizmodo.com/sen-democrats-call-for-stop-to-funneling-money-to-starlink-in-states-2000611062",
    "timestamp": "2025-06-04T16:40:00Z"
  },
  {
    "title": "We Are No Longer a Serious Country – Paul Krugman",
    "description": "And the world is starting to notice",
    "link": "https://paulkrugman.substack.com/p/we-are-no-longer-a-serious-country",
    "timestamp": "2025-06-04T16:39:36Z"
  },
  {
    "title": "Big government is still good, even with Trump in power",
    "description": "It’s easy to look at Donald Trump’s second term and conclude that the less power and reach the federal government has, the better. After all, a smaller government might provide Trump or someone like him with fewer opportunities to disrupt people’s lives, leav…",
    "link": "https://www.vox.com/policy/415421/big-government-small-government-trump-democracy",
    "timestamp": "2025-06-04T16:39:07Z"
  },
  {
    "title": "Whoopi Goldberg Accuses Elon Musk Of “Destroying Peoples’ Lives” Before Leaving Trump Administration: “Suddenly You Woke Up?”",
    "description": "\"You came out [of] your fog?\"",
    "link": "https://decider.com/2025/06/04/whoopi-goldberg-accuses-elon-musk-destroying-peoples-lives-before-leaving-trump-administration-suddenly-you-woke-up/",
    "timestamp": "2025-06-04T16:38:23Z"
  },
  {
    "title": "Pro-Trump pastor hit by damning allegations of 'psychological abuse'",
    "description": "Evangelical singer/preacher Sean Feucht has been a prominent figure in the MAGA movement, preaching far-right Christian nationalist views and heading the nonprofits Sean Feucht Ministries and Light a Candle. Feucht, according to Rolling Stone, founded the gro…",
    "link": "https://www.rawstory.com/pro-trump-pastor-hit-by-damning-allegations-of-psychological-abuse/",
    "timestamp": "2025-06-04T16:38:23Z"
  },
  {
    "title": "‘The View’: Alyssa Farah Griffin Says Elon Musk Could ‘Tank’ Trump If He Really Wants To | Video",
    "description": "The ABC host argues that Musk standing firm against Trump's spending bill could be \"devastating for his administration\"\nThe post ‘The View’: Alyssa Farah Griffin Says Elon Musk Could ‘Tank’ Trump If He Really Wants To | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-view-alyssa-farah-griffin-elon-musk-could-tank-trump/",
    "timestamp": "2025-06-04T16:38:16Z"
  },
  {
    "title": "WATCH: Law professor addresses unprecedented nature of judicial attacks under Trump administration",
    "description": "\"I worry that we are on a path toward few, if any, meaningful limits on the president,\" Shaw said.",
    "link": "https://www.pbs.org/newshour/politics/watch-law-professor-addresses-unprecedented-nature-of-judicial-attacks-under-trump-administration",
    "timestamp": "2025-06-04T16:37:35Z"
  },
  {
    "title": "Canada ‘will take some time’ before responding to higher U.S. steel, aluminum tariffs, Carney says",
    "description": "Prime Minister Mark Carney says Canada will not immediately retaliate after U.S. President Donald Trump raised tariffs on steel and aluminum to 50 per cent, citing ongoing negotiations over a new trade and security deal with Washington.\nSpeaking to reporters …",
    "link": "https://biztoc.com/x/e8bf45023254f1a7",
    "timestamp": "2025-06-04T16:36:34Z"
  },
  {
    "title": "Ladies of The View Claim Trump Is ‘Afraid’ of Elon Musk as Tesla Boss Tears Into Big Beautiful Bill",
    "description": "The ladies of The View took a strong stance on President Donald Trump's relationship with Elon Musk, with Whoopi Goldberg and Joy Behar agreeing the commander in chief is \"afraid\" of the Tesla billionaire.\nThe post Ladies of The View Claim Trump Is ‘Afraid’ o…",
    "link": "https://www.mediaite.com/media/tv/ladies-of-the-view-claim-trump-is-afraid-of-elon-musk-as-tesla-boss-tears-into-big-beautiful-bill/",
    "timestamp": "2025-06-04T16:36:21Z"
  },
  {
    "title": "Palantir and the Age of Authoritarian Entrepreneurs",
    "description": "Palantir probably has access to your data, John Herrman writes, and the company has signaled it will do what Trump wants with that data.",
    "link": "http://nymag.com/intelligencer/article/palantir-and-the-age-of-authoritarian-entrepreneurs.html",
    "timestamp": "2025-06-04T16:35:09Z"
  },
  {
    "title": "'In His Digital Wallet': Democrats Blast Latest Trump-Backed Crypto Product During House Hearing",
    "description": "The last time House lawmakers convened to discuss crypto, Trump had announced a private dinner for $TRUMP holders a day before.",
    "link": "https://decrypt.co/323663/in-his-digital-wallet-democrats-blast-latest-trump-backed-crypto-product-house-hearing",
    "timestamp": "2025-06-04T16:34:20Z"
  },
  {
    "title": "Trump’s Budget Would Limit Investigations Into Abuse, Neglect of Disabled People",
    "description": "Dismantling a key HHS agency, gutting important programs, and cuts to Medicaid will roll back decades of progress.",
    "link": "https://truthout.org/articles/trumps-budget-would-limit-investigations-into-abuse-neglect-of-disabled-people/",
    "timestamp": "2025-06-04T16:33:42Z"
  },
  {
    "title": "Hollywood Legend Reveals Trump Bitched Him Out For ‘Wussing Out’ On TV Over Stolen Election Lie",
    "description": "David Mamet revealed that Trump called and lectured him for 20 minutes after he \"wussed out\" on TV and softened on the \"stolen election\" lie.\nThe post Hollywood Legend Reveals Trump Bitched Him Out For ‘Wussing Out’ On TV Over Stolen Election Lie first appear…",
    "link": "https://www.mediaite.com/media/news/hollywood-legend-reveals-trump-bitched-him-out-for-wussing-out-on-tv-over-stolen-election-lie/",
    "timestamp": "2025-06-04T16:32:33Z"
  },
  {
    "title": "'Literally running the show': Shock report reveals full reach of Project 2025",
    "description": "Despite repeatedly attempting to distance himself\r\n from Project 2025 during his reelection campaign, U.S. President Donald Trump's administration employs dozens of senior officials with links to the Heritage Foundation-led plan to expand executive power and …",
    "link": "https://www.rawstory.com/literally-running-the-show-shock-report-reveals-full-reach-of-project-2025/",
    "timestamp": "2025-06-04T16:30:44Z"
  },
  {
    "title": "Bryson DeChambeau is back to competing, preparing for US Open title defense after 'fun side quests'",
    "description": "As much as Bryson DeChambeau loves to practice and compete, the U.S. Open champion also appreciates the limited LIV Golf schedule that gives him time to pursue other interests. DeChambeau arrived at Robert Trent Jones Golf Club for LIV Golf Virginia after a c…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_55a707ba-ba98-464a-9e98-1bda8ef35eeb",
    "timestamp": "2025-06-04T16:29:51Z"
  },
  {
    "title": "Carney hints retaliation is coming for Trump's latest steel and aluminum tariffs",
    "description": "Mark Carney said his government will take 'some time but not much' to respond to Donald Trump’s 50 per cent tariffs on steel and aluminum.",
    "link": "https://nationalpost.com/news/carney-hints-retaliation-is-coming-for-trumps-latest-steel-and-aluminum-tariffs",
    "timestamp": "2025-06-04T16:28:50Z"
  },
  {
    "title": "What is the ‘revenge tax’ in the US tax bill?",
    "description": "Provision allows US to impose additional taxes on entities from countries that it says impose unfair taxes on US firms.",
    "link": "https://www.aljazeera.com/economy/2025/6/4/what-is-the-revenge-tax-in-the-us-tax-bill",
    "timestamp": "2025-06-04T16:26:30Z"
  },
  {
    "title": "Even the Trumps Are Confused About How Many Crypto Offerings They Have",
    "description": "Donald Trump Jr. and Eric Trump are in a fight over the legitimacy of a Trump-branded crypto wallet that they claim is bogus.",
    "link": "http://nymag.com/intelligencer/article/even-the-trumps-are-confused-about-their-many-crypto-deals.html",
    "timestamp": "2025-06-04T16:26:24Z"
  },
  {
    "title": "Trump’s Middle East pivot aims to counter China’s rising influence",
    "description": "Trump is trying to strengthen ties with Gulf states in an attempt to contain China’s growing regional ambitions.",
    "link": "https://theconversation.com/trumps-middle-east-pivot-aims-to-counter-chinas-rising-influence-257366",
    "timestamp": "2025-06-04T16:25:32Z"
  },
  {
    "title": "Trump Calls Xi 'Tough' Ahead Of The Phone Call With Beijing",
    "description": "President Donald Trump on Wednesday called Chinese President Xi Jinping a “very tough” negotiator on social media platform Truth Social. “I like President Xi… but he is extremely hard to make a deal with,” Trump posted. \nThe comment comes as Trump prepares fo…",
    "link": "https://biztoc.com/x/8deba2f4dd3cbce6",
    "timestamp": "2025-06-04T16:25:21Z"
  },
  {
    "title": "Iranian Supreme Leader Lashes Out at Trump Admin Amid Nuclear Talks: ‘Rude and Arrogant Leaders’",
    "description": "Iranian supreme leader Ali Khamenei lashed out at the Trump administration in a defiant Wednesday speech, calling the U.S. nuclear deal proposal \"nonsense\" and taking aim at \"the rude and arrogant leaders of America.\"\nThe post Iranian Supreme Leader Lashes Ou…",
    "link": "https://freebeacon.com/national-security/iranian-supreme-leader-lashes-out-at-trump-admin-amid-nuclear-talks-rude-and-arrogant-leaders/",
    "timestamp": "2025-06-04T16:23:53Z"
  },
  {
    "title": "Pennsylvania sues USDA over cutting funding to $1 billion food aid program for states",
    "description": "Pennsylvania has filed a lawsuit against the U.S. Department of Agriculture, saying the agency, under President Donald Trump, illegally cut off funding through a program designed to distribute more than $1 billion to states",
    "link": "https://abcnews.go.com/US/wireStory/pennsylvania-suing-usda-cutting-funding-1-billion-food-122495388",
    "timestamp": "2025-06-04T16:23:28Z"
  },
  {
    "title": "Trump airs frustrations with Xi and Powell over elusive economic goals",
    "description": "President Donald Trump’s overnight volley of social media posts revealed his frustrations with decision makers whose cooperation he needs to secure some of his top economic objectives.",
    "link": "https://biztoc.com/x/a49d38fb978a4c6b",
    "timestamp": "2025-06-04T16:23:19Z"
  },
  {
    "title": "States Left Without Aid After FEMA Was Not Told Trump Had Signed Off on Disaster Relief: Report",
    "description": "Because the Trump administration is refusing to coordinate directly with FEMA, delays in sending funds to states are putting lives at risk, officials warned.",
    "link": "https://www.ibtimes.com/states-left-without-aid-after-fema-was-not-told-trump-had-signed-off-disaster-relief-report-3775157",
    "timestamp": "2025-06-04T16:22:12Z"
  },
  {
    "title": "These Republicans Now Say They Regret Voting For Trump’s Policy Bill",
    "description": "Rep. Marjorie Taylor Greene, R-Ga., said she won’t vote for the bill again if the Senate doesn’t remove a provision preventing states from implementing artificial intelligence regulations.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/04/these-republicans-now-say-they-regret-voting-for-trumps-policy-bill/",
    "timestamp": "2025-06-04T16:21:19Z"
  },
  {
    "title": "What Happened When the FBI Asked for Dirt on Docs Treating Trans Kids: ‘F-ck Off Nazi Dickheads’",
    "description": "It's the Trump Administration's latest move to target health care providers working with trans youth.",
    "link": "http://www.rollingstone.com/politics/politics-features/trans-youth-health-care-fbi-tip-line-1235354963/",
    "timestamp": "2025-06-04T16:19:55Z"
  },
  {
    "title": "Trump Commerce Secretary Stuns Republican Senator By Undercutting Trump’s Justification For Sweeping Tariffs",
    "description": "Kennedy grilled Lutnick after the Trump cabinet member appeared to undercut Trump’s stated goal for the tariffs – to bring down other countries’ trade barriers on the U.S.\nThe post Trump Commerce Secretary Stuns Republican Senator By Undercutting Trump’s Just…",
    "link": "https://www.mediaite.com/politics/trump-commerce-secretary-stuns-republican-senator-by-undercutting-trumps-justification-for-sweeping-tariffs/",
    "timestamp": "2025-06-04T16:19:24Z"
  },
  {
    "title": "‘Korean Donald Trump’ emerges from the chaos in Seoul",
    "description": "The man now in charge of the Republic of Korea once styled himself after Bernie Sanders but changed his tune – and has won Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618637-south-korean-donald-trump/",
    "timestamp": "2025-06-04T16:19:22Z"
  },
  {
    "title": "Trump-Backed World Liberty Financial Airdrops Millions of Stablecoins to 85,000 Wallets",
    "description": "The airdrop was designed partly to test the platform’s readiness for a full rollout of DeFi services.",
    "link": "https://decrypt.co/323661/trump-backed-world-liberty-financial-airdrops-millions-stablecoins-85000-wallets",
    "timestamp": "2025-06-04T16:18:28Z"
  },
  {
    "title": "Trump’s “Big, Beautiful Bill” Would Massively Expand Government Spending in One Area",
    "description": "Two historic changes in the Republican budget bill haven’t gotten that much attention.",
    "link": "https://slate.com/news-and-politics/2025/06/big-beautiful-bill-donald-trump-government-spending-republicans-immigration.html",
    "timestamp": "2025-06-04T16:17:45Z"
  },
  {
    "title": "As trial opens, Mike Lindell’s attorneys say he spread claims about Dominion official because he was ‘triggered’",
    "description": "Defamation case is based on election conspiracy promoted by MyPillow CEO.",
    "link": "https://www.bostonherald.com/2025/06/04/colorado-defamation-trial-mike-lindell-dominion-election-conspiracy/",
    "timestamp": "2025-06-04T16:17:21Z"
  },
  {
    "title": "Trump administration renegotiating 'overly generous' Biden Chips Act grants",
    "description": "WASHINGTON :President Donald Trump's administration is renegotiating some of former President Joe Biden's grants to semiconductor firms that were \"overly generous,\" U.S. Commerce Secretary Howard Lutnick said at a hearing on Wednesday.Biden's Chips Act aimed …",
    "link": "https://www.channelnewsasia.com/business/trump-administration-renegotiating-overly-generous-biden-chips-act-grants-5166311",
    "timestamp": "2025-06-04T16:17:06Z"
  },
  {
    "title": "Trump renegotiating Biden-era Chips Act grants, Lutnick says",
    "description": "WASHINGTON :President Donald Trump's administration is renegotiating some of former President Joe Biden's grants to semiconductor firms, U.S. Commerce Secretary Howard Lutnick said at a hearing on Wednesday, suggesting some awards may be axed. Some of the Bid…",
    "link": "https://www.channelnewsasia.com/business/trump-renegotiating-biden-era-chips-act-grants-lutnick-says-5166311",
    "timestamp": "2025-06-04T16:17:06Z"
  },
  {
    "title": "Massie calls on Elon Musk to fund primary challenges against Republicans who backed Trump tax bill",
    "description": "Rep. Thomas Massie is calling on Elon Musk to fund election challenges against Republicans who supported President Donald Trump's agenda bill.",
    "link": "https://www.foxnews.com/politics/massie-calls-elon-musk-fund-primary-challenges-against-republicans-who-backed-trump-tax-bill",
    "timestamp": "2025-06-04T16:14:58Z"
  },
  {
    "title": "Harvard Students 'Incredibly Afraid' Over Future Career After Trump's Move",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThere has been a chill in the air at Harvard University since President Donald Trump began his unprecedented attack on the college.\nHarvard University is going toe-to-toe against the administration in a high-s…",
    "link": "https://biztoc.com/x/1699d8f1af89f331",
    "timestamp": "2025-06-04T16:14:55Z"
  },
  {
    "title": "Gavin Newsom Defies Trump With Groundbreaking Pollution Program",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCalifornia Governor Gavin Newsom has responded to President Donald Trump's rollback of climate protections by unveiling a \"first-of-its-kind\" pollution monitoring program.\nThe state is launching its Statewide …",
    "link": "https://biztoc.com/x/2dcabaaccf16ce08",
    "timestamp": "2025-06-04T16:14:20Z"
  },
  {
    "title": "Restaurant Worker Wrestled to Ground by ICE Agents in the Middle of Shift",
    "description": "DHS told Newsweek that the man was using a false name and Social Security number.",
    "link": "https://www.newsweek.com/romero-edilzar-yaxcal-tiul-early-bird-worker-detained-ice-2080947",
    "timestamp": "2025-06-04T16:13:44Z"
  },
  {
    "title": "Middle East Leaders Surprisingly Fine With Iran Enriching Uranium, Lankford Says",
    "description": "Leaders in a handful of Middle Eastern countries are surprisingly sanguine about the prospect of Iran enriching its own uranium, Sen. James Lankford, R-Okla., told... Read More\nThe post Middle East Leaders Surprisingly Fine With Iran Enriching Uranium, Lankfo…",
    "link": "https://www.dailysignal.com/2025/06/04/middle-east-leaders-surprisingly-fine-iran-enriching-uranium-lankford-says/",
    "timestamp": "2025-06-04T16:12:05Z"
  },
  {
    "title": "The 4chan-Coded Ideology Behind Elon Musk’s War on Normies",
    "description": "In September, Elon Musk amplified a post from Autism Capital—a pro-Trump X account that he often reposts—that read: “Only high T alpha males and aneurotypical people (hey autists!) are actually free to parse new information with an objective ‘is this true?’ f…",
    "link": "https://www.motherjones.com/politics/2025/06/elon-musk-aspie-supremacy-4chan-autism/",
    "timestamp": "2025-06-04T16:12:01Z"
  },
  {
    "title": "Trump's tax bill would add $2.4 trillion to the debt, says Congress' budget watchdog",
    "description": "The Trump-backed budget bill has come under fire from former DOGE head Elon Musk and some GOP senators as it moves through Congress.",
    "link": "https://www.cnbc.com/2025/06/04/trump-tax-bill-debt.html",
    "timestamp": "2025-06-04T16:10:13Z"
  },
  {
    "title": "Adjusting Imports of Aluminum and Steel into the United States (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nAdjusting Imports of Aluminum and Steel into the United States  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  1. On January 11, 2018, the Secretary of Commerce (Secretary) transmitted to me a report on th…",
    "link": "https://www.memeorandum.com/250604/p69",
    "timestamp": "2025-06-04T16:10:01Z"
  },
  {
    "title": "CBO Projects Trump Tariffs to Cut Budget Gap by $2.8 Trillion",
    "description": "President Donald Trump’s tariff policies in effect as of mid-May would help to shrink US fiscal deficits by an estimated $2.8 trillion, according to the nonpartisan Congressional Budget Office.",
    "link": "https://financialpost.com/pmn/business-pmn/cbo-projects-trump-tariffs-to-cut-budget-gap-by-2-8-trillion",
    "timestamp": "2025-06-04T16:08:56Z"
  },
  {
    "title": "'Act of self-deception': Trump faces crisis as GOP rebels vow to dig in heels",
    "description": "WASHINGTON — President Donald Trump and House Speaker Mike Johnson need to back off — or so argue many Senate Republicans set on overhauling the House-passed\r\n One Big Beautiful Bill Act, which would turn much of Trump's campaign rhetoric into law. After the …",
    "link": "https://www.rawstory.com/raw-investigates/trump-budget-bill-spending-cuts/",
    "timestamp": "2025-06-04T16:07:43Z"
  },
  {
    "title": "Harvard Students 'Incredibly Afraid' Over Future Career After Trump's Move",
    "description": "\"I am incredibly afraid,\" Alfred Williamson, a Harvard student from Wales, who is currently studying in Denmark, told Newsweek.",
    "link": "https://www.newsweek.com/harvard-university-student-afraid-trump-immigration-2080881",
    "timestamp": "2025-06-04T16:07:40Z"
  },
  {
    "title": "Trump airs frustrations with Xi and Powell over elusive economic goals",
    "description": "President Donald Trump’s overnight volley of social media posts revealed his frustrations with decision makers whose cooperation he needs to secure some of his top economic objectives.",
    "link": "https://www.nbcnews.com/business/economy/trump-frustrated-over-china-jerome-powell-elusive-economic-goals-rcna210929",
    "timestamp": "2025-06-04T16:07:14Z"
  },
  {
    "title": "Mar-A-Lago Intruder Busted After Jumping Wall To Marry Trump’s Granddaughter: Police",
    "description": "Anthony Thomas Reyes said he intended to “spread the gospel\" to Trump and marry the president's 18-year-old granddaughter, according to police.",
    "link": "https://www.huffpost.com/entry/mar-a-lago-trespasser-anthony-reyes-kai-trump_n_68404e38e4b0cc37620116e5",
    "timestamp": "2025-06-04T16:07:00Z"
  },
  {
    "title": "10.9 million Americans could lose health insurance under Trump's proposed bill",
    "description": "The nonpartisan Congressional Budget Office says the bill will add $2.4 trillion to the deficit over the next decade in order to help pay for tax cuts.",
    "link": "https://www.mlive.com/news/2025/06/trumps-tax-bill-could-leave-you-uninsured-while-adding-24-trillion-to-the-deficit-analysis-finds.html",
    "timestamp": "2025-06-04T16:06:39Z"
  },
  {
    "title": "How Will Revoking Chinese Student Visas Actually Work?",
    "description": "Though the Trump administration hasn’t provided details, a rough estimate suggests a staggering impact.",
    "link": "http://foreignpolicy.com/2025/06/04/china-student-visa-revocation-ccp-trump-state-rubio-universities/",
    "timestamp": "2025-06-04T16:06:12Z"
  },
  {
    "title": "Germany unveils tax breaks to boost stagnant economy",
    "description": "Germany's government on Wednesday put forward a sweeping package of corporate tax breaks aimed at boosting investment and pulling Europe's largest economy out of the doldrums.",
    "link": "https://www.thelocal.de/20250604/germany-unveils-tax-breaks-to-boost-stagnant-economy",
    "timestamp": "2025-06-04T16:05:52Z"
  },
  {
    "title": "Mayoral candidate Andrew Cuomo’s health care record in NY isn’t just about COVID-19",
    "description": "The New York City mayoral contender left his mark on various policy areas, ranging from ‘Obamacare’ to funding cuts.",
    "link": "https://gothamist.com/news/mayoral-candidate-andrew-cuomos-health-care-record-in-ny-isnt-just-about-covid-19",
    "timestamp": "2025-06-04T16:03:37Z"
  },
  {
    "title": "Gavin Newsom Defies Trump With Groundbreaking Pollution Program",
    "description": "The unveiling of the SMMI comes amid sweeping federal actions targeting state-level environmental rules.",
    "link": "https://www.newsweek.com/gavin-newsom-pollution-program-california-2080928",
    "timestamp": "2025-06-04T16:03:24Z"
  },
  {
    "title": "European steel sector on high alert amid slow-moving trade negotiations",
    "description": "The EU steel sector warned on Wednesday of overcapacities flooding the EU market after US president Donald Trump doubled tariffs on the sector to 50%. The new tariffs have increased pressure on the EU’s negotiating teams trying to break the deadlock in its on…",
    "link": "https://biztoc.com/x/4a782f0a6a79aaff",
    "timestamp": "2025-06-04T16:03:14Z"
  },
  {
    "title": "Trump's sweeping bill to cut taxes by $3.75 trillion but will burden millions of Americans. Check details",
    "description": "The Congressional Budget Office projected President Trump's tax bill will cut taxes by $3.7 trillion while increasing the deficit by $2.4 trillion over ten years, also causing millions to lose health insurance. The estimate comes as Trump and other Republican…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-sweeping-bill-to-cut-taxes-by-3-75-trillion-but-will-burden-millions-of-americans-check-details/articleshow/121627998.cms",
    "timestamp": "2025-06-04T16:03:08Z"
  },
  {
    "title": "Musk Gets Out—and Gets Off Easy",
    "description": "The below article first appeared in David Corn’s newsletter, Our Land. The newsletter comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture. Subscribing costs just $5 a month—but you c…",
    "link": "https://www.motherjones.com/politics/2025/06/musk-doge-leaves-dc-media-fail/",
    "timestamp": "2025-06-04T16:03:05Z"
  },
  {
    "title": "South Korea elects liberal Lee as president",
    "description": "Lee Jae-myung, leader of the Democratic Party, was elected president following months of political instability in the wake of Yoon Suk Yeol's impeachment",
    "link": "https://theweek.com/world-news/lee-south-korea-new-president",
    "timestamp": "2025-06-04T16:02:30Z"
  },
  {
    "title": "Trump Pardons Are Big Business for Lobbyists",
    "description": "\"Seeking a pardon from President Donald Trump has become big business for lobbying and consulting firms close to the administration, with wealthy hopefuls willing to spend millions of dollars for help getting their case in",
    "link": "https://politicalwire.com/2025/06/04/trump-pardons-are-big-business-for-lobbyists/",
    "timestamp": "2025-06-04T16:00:42Z"
  },
  {
    "title": "Crypto And The Trumps: The Untold Story, According To Don Jr.",
    "description": "US President Donald Trump’s eldest son, Donald Trump Jr., says his family turned to Bitcoin and crypto after facing banking roadblocks. According to a recent CNBC Squawk Box interview, the Trump Organization suddenly found it hard to borrow money once politic…",
    "link": "https://bitcoinist.com/crypto-and-the-trumps-the-untold-story-according-to-don-jr/",
    "timestamp": "2025-06-04T16:00:05Z"
  },
  {
    "title": "‘Talks ongoing amid contingency steps’",
    "description": "PETALING JAYA: Talks with the United States on the proposed tariff increase are still in progress, while the government has begun rolling out contingency measures such as market diversification and economic reforms, according to Malaysia's chief negotiator, M…",
    "link": "https://www.thestar.com.my/news/nation/2025/06/05/talks-ongoing-amid-contingency-steps",
    "timestamp": "2025-06-04T16:00:00Z"
  },
  {
    "title": "A Plan To Deploy NATO Troops To Ukraine Is “Dead”",
    "description": "An anonymous source has told the Financial Times that the plan by the United Kingdom and France to put NATO (North Atlantic Treaty Organization) troops on the ground in Ukraine is “dead.” The plan is still being pushed by some Western backers. However, the U.…",
    "link": "https://www.activistpost.com/a-plan-to-deploy-nato-troops-to-ukraine-is-dead/",
    "timestamp": "2025-06-04T16:00:00Z"
  },
  {
    "title": "President would have to brutally kill volunteer for access to nuclear codes in seriously grim proposal",
    "description": "America's nuclear codes might be carried in a suitcase but a previously touted method involved killing an innocent man first",
    "link": "https://www.ladbible.com/news/us-news/usa-nuclear-codes-stored-suitcase-historical-violent-method-600752-20250604",
    "timestamp": "2025-06-04T15:59:33Z"
  },
  {
    "title": "You Will Never See a More Vivid Example of What Is Running Through Republicans’ Heads Right Now Than This",
    "description": "Finally, a senator just admits it.",
    "link": "https://slate.com/news-and-politics/2025/06/elon-musk-trump-joni-ernst-apology-senate-bill.html",
    "timestamp": "2025-06-04T15:59:22Z"
  },
  {
    "title": "U.S. stock market today: Dow Jones, S&P 500, and Nasdaq rise slightly as weak ADP jobs data fuels Fed rate cut hopes and tech stocks power market gains",
    "description": "U.S. stocks rise slightly as weak jobs data keeps gains limited. On Wednesday, the Dow Jones added 71 points, while the S&P 500 and Nasdaq rose by 0.3%. However, May’s private sector hiring dropped sharply, with only 37,000 jobs added — the lowest in over two…",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-stock-market-today-dow-jones-sp-500-and-nasdaq-rise-slightly-as-weak-adp-jobs-data-fuels-fed-rate-cut-hopes-and-tech-stocks-power-market-gains/articleshow/121627121.cms",
    "timestamp": "2025-06-04T15:59:08Z"
  },
  {
    "title": "Trump Tariffs Will Shrink Economy and Increase Inflation Per Damning CBO Report",
    "description": "Trump's controversial tariff policies will shrink the size of the US economy and lead to rising inflation according to a recent report from the nonpartisan CBO.\nThe post Trump Tariffs Will Shrink Economy and Increase Inflation Per Damning CBO Report first app…",
    "link": "https://www.mediaite.com/politics/trump/trump-tariffs-will-shrink-economy-and-increase-inflation-per-damning-cbo-report/",
    "timestamp": "2025-06-04T15:56:53Z"
  },
  {
    "title": "Trump just got fresh fuel in his fight against the Fed",
    "description": "Trump has frequently critiqued the Fed Chair in 2025, calling Powell a \"major loser.\" On Wednesday, weaker private payrolls spurred fresh calls for rate cuts.",
    "link": "https://www.businessinsider.com/trump-fed-interest-rates-powell-job-market-adp-private-payrolls-2025-6",
    "timestamp": "2025-06-04T15:56:01Z"
  },
  {
    "title": "Intruder Arrested at Donald Trump’s Mar-a-Lago Resort",
    "description": "Donald Trump had an unexpected visitor at his Mar-a-Lago resort.\nDuring the early hours of June 3, Anthony Reyes, a 23-year-old man from Texas, attempted to break into the president’s beach club...",
    "link": "https://www.eonline.com/news/1418312/intruder-arrested-at-donald-trumps-mar-a-lago-resort",
    "timestamp": "2025-06-04T15:55:14Z"
  },
  {
    "title": "CNET's Tariff Price Tracker: What I've Found Watching 11 Key Products Daily for Price Changes",
    "description": "Trump's tariff plans are still in doubt legally, but they've already had real impacts on certain products.",
    "link": "https://www.cnet.com/tech/cnets-tariff-price-tracker-what-ive-found-watching-11-key-products-daily-for-price-changes/",
    "timestamp": "2025-06-04T15:55:00Z"
  },
  {
    "title": "Nearly 11 Million Americans Will Lose Healthcare to Pay for Trump’s Billionaire Tax Cuts",
    "description": "Today, the non-partisan Congressional Budget Office (CBO) reported that congressional Republicans’ budget betrayal would strip nearly 11 million Americans of their healthcare coverage while adding $2.4 trillion to the national deficit. Between discontinuing A…",
    "link": "https://www.commondreams.org/newswire/nearly-11-million-americans-will-lose-healthcare-to-pay-for-trumps-billionaire-tax-cuts",
    "timestamp": "2025-06-04T15:54:54Z"
  },
  {
    "title": "Trump Order to Hospitals on Emergency Abortions 'Means Women Will Die,' Warn Advocates",
    "description": "Ensuring unequivocally that hospitals must provide abortion care to patients whose pregnancies have placed them in life-threatening medical emergencies is not \"the policy of this administration,\" said the nation's top health agency on Tuesday—making clear, sa…",
    "link": "https://www.commondreams.org/news/trump-emtala",
    "timestamp": "2025-06-04T15:53:57Z"
  },
  {
    "title": "SNAP Cuts Could Cost Michigan $900 Million: 'Unacceptable'",
    "description": "Around 15 percent of Michigan's population rely on SNAP benefits to purchase essential groceries.",
    "link": "https://www.newsweek.com/snap-cuts-cost-michigan-900-million-2080895",
    "timestamp": "2025-06-04T15:53:18Z"
  },
  {
    "title": "IMEC a catalyst towards vision of Viksit Bharat: Dammu Ravi",
    "description": "The India-Middle East-Europe Economic Corridor aims to connect India and Europe. It involves railways, ports, and digital infrastructure. Experts discussed its potential at a conference organized by Chintan Research Foundation. The project promises trade bene…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/imec-a-catalyst-towards-vision-of-viksit-bharat-dammu-ravi/articleshow/121627933.cms",
    "timestamp": "2025-06-04T15:53:12Z"
  },
  {
    "title": "Cuts to USAID severed longstanding American support for Indigenous people around the world",
    "description": "Without American help, Indigenous people in the Amazon are worried.",
    "link": "https://www.bostonherald.com/2025/06/04/indigenous-affairs-doge-cuts/",
    "timestamp": "2025-06-04T15:52:16Z"
  },
  {
    "title": "Trump Calls Fed Chair ‘Unbelievable’ After May Job Slump",
    "description": "President Donald Trump renewed pressure on Federal Reserve Chair Jerome Powell to lower interest rates, citing a slowdown in job growth reported by payroll firm ADP. \nPosting on Truth Social, Trump wrote, “Too Late Powell must now lower the rate. He is unbeli…",
    "link": "https://biztoc.com/x/608ea4c3c629f082",
    "timestamp": "2025-06-04T15:52:07Z"
  },
  {
    "title": "Elon Musk slams Trump's 'pork-filled' signature bill",
    "description": "What happened\nPresident Donald Trump Tuesday told Senate Republicans he wants them to pass his multitrillion-dollar \"big, beautiful bill\" and deliver it to his desk by July 4. But Trump ally and leading donor Elon Musk, who left the administration Friday, urg…",
    "link": "https://biztoc.com/x/f018db61c3c6f02d",
    "timestamp": "2025-06-04T15:52:05Z"
  },
  {
    "title": "Ex-Trump advisor calls for seizure of US senator’s passport",
    "description": "Steve Bannon has accused the Republican senator of “stirring up” the Ukraine conflict by falsely promising Kiev US support Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618659-trump-adviser-graham-passport/",
    "timestamp": "2025-06-04T15:48:45Z"
  },
  {
    "title": "'Silence is deafening': Insider flags Trump's lack of response to major critique",
    "description": "A veteran Florida reporter said he was bracing for president Donald Trump's inevitable response to Elon Musk's sharp criticism of his legislative priority.The tech billionaire described Trump's sought-after \"big beautiful bill\" as a \"disgusting abomination,\" …",
    "link": "https://www.rawstory.com/trump-respnse-to-musk/",
    "timestamp": "2025-06-04T15:48:34Z"
  },
  {
    "title": "Elon Musk's outrageous attack on Donald Trump's big, beautiful bill: Is this the end of their alliance?",
    "description": "Elon Musk's criticism of a Republican-backed spending bill has strained his relationship with Donald Trump. This political involvement has sparked a backlash against Tesla, resulting in declining sales in key European markets like the UK, France, and Germany.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-outrageous-attack-on-donald-trumps-big-beautiful-bill-is-this-the-end-of-their-alliance-elon-musk-news-donald-trump-news/articleshow/121627794.cms",
    "timestamp": "2025-06-04T15:46:26Z"
  },
  {
    "title": "Trump is 'Furious' After Elon Musk Brands His 'Big, Beautiful' as 'Disgusting', Fox Host Says",
    "description": "President Donald Trump is allegedly enraged after his billionaire ally, Elon Musk, took to social media to denounce his \"one big, beautiful\" spending bill.",
    "link": "https://www.ibtimes.com/trump-furious-after-elon-musk-brands-his-big-beautiful-disgusting-fox-host-says-3775155",
    "timestamp": "2025-06-04T15:46:12Z"
  },
  {
    "title": "Elon Musk slams Trump's 'pork-filled' signature bill",
    "description": "Days after leaving the administration, Musk unleashed his contempt for Trump's 'big, beautiful bill'",
    "link": "https://theweek.com/politics/elon-musk-slams-trump-bill",
    "timestamp": "2025-06-04T15:45:52Z"
  },
  {
    "title": "German leader is meeting Trump for the first time, so will it be another Starmer love-in, or a Zelenskyy-style brush off?",
    "description": "The German chancellor will hold his first face-to-face meeting with President Trump later.",
    "link": "https://news.sky.com/story/german-chancellor-friedrich-merz-is-meeting-donald-trump-for-the-first-time-so-will-it-be-another-starmer-love-in-or-a-zelenskyy-style-brush-off-13379146",
    "timestamp": "2025-06-04T15:45:00Z"
  },
  {
    "title": "Texas hospital that discharged woman with doomed pregnancy violated law",
    "description": "Texas hospital that discharged woman with doomed pregnancy violated lawtwincities.com",
    "link": "https://www.twincities.com/2025/06/04/abortion-texas-hospital/",
    "timestamp": "2025-06-04T15:42:53Z"
  },
  {
    "title": "Dem Strategist Says Party Should Ditch ‘Liberal Joe Rogan’ Plan For … Jasmine Crockett",
    "description": "Max Burns wrote in an op-ed published in The Hill that Democratic Texas Rep. Jasmine Crockett is one of Democrats' \"rawest and most watchable communicators.\"",
    "link": "https://dailycaller.com/2025/06/04/dem-strategist-liberal-joe-rogan-jasmine-crockett/",
    "timestamp": "2025-06-04T15:42:45Z"
  },
  {
    "title": "Anderson Cooper Hilariously Rejects Birthday Offer From Fellow CNN Reporter: 'Uh, I'm Good'",
    "description": "The 58-year-old kindly vetoed a gift from fellow CNN reporter Donie O'Sullivan, who reported live from MyPillow CEO Mike Lindell's defamation trial in Colorado.",
    "link": "https://www.huffpost.com/entry/anderson-cooper-donie-osullivan-mypillow-birthday-offer_n_68401b98e4b0d48557aa7464",
    "timestamp": "2025-06-04T15:42:20Z"
  },
  {
    "title": "Semiconductor Supplier GlobalFoundries to Spend $16B to Boost US Chip Production",
    "description": "In This Article:\nKey Takeaways\n-\nGlobalFoundries plans to spend more than $16 billion to increase chip production in the U.S.\n-\nThe supplier of major tech firms said the move followed calls by President Donald Trump to increase domestic manufacturing.\n-\nGloba…",
    "link": "https://biztoc.com/x/bdddaf017dba10c0",
    "timestamp": "2025-06-04T15:41:32Z"
  },
  {
    "title": "Slog AM: Layoffs at SIFF, FBI Raids Nazi House in Lacey, Harvey Milk Ship Too Gay—Even For The Navy",
    "description": "The Stranger's morning news roundup.\n \n by Vivian McCall\n \n \n \n SIFF Layoffs: The nonprofit that runs the Seattle International Film Festival (and many cool movie theaters in town) is laying off nine full-time workers across multiple departments, according to…",
    "link": "https://www.thestranger.com/slog-am/2025/06/04/80086578/slog-am-layoffs-at-siff-fbi-raids-nazi-house-in-lacey-harvey-milk-ship-too-gay-even-for-the-navy",
    "timestamp": "2025-06-04T15:41:00Z"
  },
  {
    "title": "CBO: Trump 'Big Beautiful Bill Act' could add $2.4T to deficit, leave 11 million without health insurance",
    "description": "The budget office is projecting 10.9 million more people will be uninsured in 2034 because of changes to health care.",
    "link": "https://abc30.com/post/trump-urges-senators-get-big-tax-bill-done-july-4th/16655506/",
    "timestamp": "2025-06-04T15:40:59Z"
  },
  {
    "title": "Elon Musk may be the only person in the world who can criticize Donald Trump in public. For now",
    "description": "Donald Trump gave Elon Musk a \"key to the White House\" after Musk criticized Trump's budget bill. Now Musk has criticized the same bill with even stronger language — and Trump has yet to respond.\nALLISON ROBBERT/AFP via Getty Images\nIf you come at Donald Trum…",
    "link": "https://biztoc.com/x/18134d89690f800e",
    "timestamp": "2025-06-04T15:40:55Z"
  }
]