[
  {
    "title": "Israel And Iran Trade Strikes For A Third Day As Nuclear Talks Are Called Off",
    "description": "Israel unleashed airstrikes across Iran for a third day and threatened even greater force as some Iranian missiles evaded Israeli air defenses to strike buildings in the heart of the country.",
    "link": "https://www.huffpost.com/entry/ap-ml-mideast-wars-iran-israel-strikes_n_684eb124e4b0fcc49377b0fc",
    "timestamp": "2025-06-15T11:46:03Z"
  },
  {
    "title": "Sunday: Hili dialogue",
    "description": "Welcome to the sabbath for goyische cats: Sunday, June 15, 2025, and National Big Boy Day, celebrating the restaurant and its eponymous hamburger. There are 61 locations, and here’s how a Big Boy burger is assembled. First, the caption: An illustration showin…",
    "link": "https://whyevolutionistrue.com/2025/06/15/sunday-hili-dialogue-538/",
    "timestamp": "2025-06-15T11:45:58Z"
  },
  {
    "title": "Trump Primes Bitcoin And Crypto For A Price Game-Changer Predicted To ‘Unleash’ Trillions",
    "description": "The U.S. Senate is poised to vote on the Trump administration’s landmark stablecoin bill, predicted to \"unleash\" trillions of dollars...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/06/15/trump-primes-bitcoin-for-a-congress-crypto-price-game-changer-predicted-to-unleash-trillions/",
    "timestamp": "2025-06-15T11:45:16Z"
  },
  {
    "title": "Iran, Israel trade strikes for a third day",
    "description": "Israel hits key energy sites and residential areas while Iranian attacks kill 10, escalating fears of a bigger conflict.",
    "link": "https://www.aljazeera.com/gallery/2025/6/15/iran-israel-trade-strikes-for-a-third-day",
    "timestamp": "2025-06-15T11:43:46Z"
  },
  {
    "title": "USAID Official and Three Others Plead Guilty After Decade-Long, Half-Billion Dollar Bribery Scheme Falls Apart",
    "description": "The bribes included cash, laptops, thousands of dollars in tickets to a suite at an NBA game, a country club wedding, and jobs for relatives.",
    "link": "https://www.westernjournal.com/usaid-official-three-others-plead-guilty-decade-long-half-billion-dollar-bribery-scheme-falls-apart/",
    "timestamp": "2025-06-15T11:38:04Z"
  },
  {
    "title": "Donald Trump Issues Warning to Iran as Israel Violence Escalates",
    "description": "The U.S. had \"nothing to do with the attack on Iran\" late on Saturday, the president has said.",
    "link": "https://biztoc.com/x/0707d0d7699f44d3",
    "timestamp": "2025-06-15T11:34:04Z"
  },
  {
    "title": "Tariffs, wildfires and AI on the agenda as Canada hosts world leaders at G7",
    "description": "OTTAWA — Prime Minister Mark Carney has tried to pare down Canada’s priorities as the G7 summit host, but there’s still a lengthy list of global issues for leaders to discuss over the coming days. “Leaders (will) meet at a moment of enormous flux globally, wh…",
    "link": "https://toronto.citynews.ca/2025/06/15/tariffs-wildfires-and-ai-on-the-agenda-as-canada-hosts-world-leaders-at-g7/",
    "timestamp": "2025-06-15T11:30:19Z"
  },
  {
    "title": "LEONARD GREENE: 'No Kings' protesters rain on Trump's military parade",
    "description": "Trump was determined on Saturday to waste taxpayer money on a jingoistic military parade, like the ones you might see in China, Russia or North Korea, that coincided with Flag Day and the president…",
    "link": "https://www.nydailynews.com/2025/06/15/leonard-greene-no-kings-protesters-rain-on-trumps-military-parade/",
    "timestamp": "2025-06-15T11:30:07Z"
  },
  {
    "title": "We know how to really hurt Donald Trump",
    "description": "Tell him that he had a tiny crowd size at his expensive parade. Tiny crowd at Trump’s military parade. Quite the turnout… SAD!pic.twitter.com/NcNvEjw4rF — Republicans against Trump (@RpsAgainstTrump) June 14, 2025 For an event that shut down much of central W…",
    "link": "https://freethoughtblogs.com/pharyngula/2025/06/15/we-know-how-to-really-hurt-donald-trump/",
    "timestamp": "2025-06-15T11:29:42Z"
  },
  {
    "title": "Donald Trump Issues Warning to Iran as Israel Violence Escalates",
    "description": "The U.S. had \"nothing to do with the attack on Iran\" late on Saturday, the president has said.",
    "link": "https://www.newsweek.com/donald-trump-iran-warning-nuclear-program-deal-israel-strikes-2085674",
    "timestamp": "2025-06-15T11:28:21Z"
  },
  {
    "title": "Macron heads to Greenland in show of European solidarity",
    "description": "Earlier this year, President Trump stirred controversy by refusing to rule out the use of force in a potential bid to assert control over Greenland.",
    "link": "https://www.euractiv.com/section/politics/news/macron-heads-to-greenland-in-show-of-european-solidarity/",
    "timestamp": "2025-06-15T11:24:07Z"
  },
  {
    "title": "Albanese confirms Trump meeting as Americans take to streets",
    "description": "Anthony Albanese has confirmed he will have his first in-person meeting with Donald Trump in Canada.",
    "link": "https://7news.com.au/news/albanese-confirms-trump-meeting-as-americans-take-to-streets-c-19037071",
    "timestamp": "2025-06-15T11:22:18Z"
  },
  {
    "title": "Putin Tells Trump That Russia Ready to Resume Peace Negotiations with Ukraine",
    "description": "Russian President Vladimir Putin told his US counterpart Donald Trump Saturday that Moscow was ready to hold a fresh round of peace talks with Kyiv after June 22, once the sides complete exchanging prisoners and soldiers' bodies.\nThe post Putin Tells Trump Th…",
    "link": "https://www.breitbart.com/europe/2025/06/15/putin-tells-trump-that-russia-ready-to-resume-peace-negotiations-with-ukraine/",
    "timestamp": "2025-06-15T11:17:12Z"
  },
  {
    "title": "The Normal President",
    "description": "By quarterbacking Israel’s attack on Iran, Trump brought an end to a particularly demoralizing era in U.S. history. The main reason Israel’s massive attack on Iranian leadership, nuclear facilities, and other targets came as a surprise is that no one believes…",
    "link": "https://freerepublic.com/focus/f-chat/4323157/posts",
    "timestamp": "2025-06-15T11:09:12Z"
  },
  {
    "title": "Greenland is a European territory, says French foreign minister",
    "description": "PARIS (Reuters) -Greenland is a European territory and it is normal that Europe and France show their interest, French Foreign Minister Jean Noel Barrot told RTL radio on Sunday when asked about French President Emmanuel Macron's visit to the Arctic island. R…",
    "link": "https://www.thestar.com.my/news/world/2025/06/15/greenland-is-a-european-territory-says-french-foreign-minister",
    "timestamp": "2025-06-15T11:05:00Z"
  },
  {
    "title": "Anti-Trump ABC News Reporter Fired for Personal Attacks Is Already Back",
    "description": "The former ABC News correspondent was critical of Donald Trump during an April interview regarding the president's first 100 days.",
    "link": "https://www.westernjournal.com/anti-trump-abc-news-reporter-fired-personal-attacks-already-back/",
    "timestamp": "2025-06-15T11:04:32Z"
  },
  {
    "title": "Tanks, Flyovers and Protests: Army Celebrates Its 250th Year, Trump Celebrates his 79th",
    "description": "Thousands across the country and the Bay Area spent the day participating in demonstrations against the parade and Trump's broader political agenda.",
    "link": "https://www.kqed.org/news/12044504/tanks-flyovers-and-protests-army-celebrates-its-250th-year-trump-celebrates-his-79th",
    "timestamp": "2025-06-15T11:00:44Z"
  },
  {
    "title": "Trump pocketed over $57 mn from crypto coin sales",
    "description": "US President Donald Trump pocketed more than $57 million from token sales by the crypto venture he and his sons helped launch last year, according to federal financial disclosure forms released by the White House.",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/trump-pocketed-over-57-mn-from-crypto-coin-sales/articleshow/121862236.cms",
    "timestamp": "2025-06-15T11:00:16Z"
  },
  {
    "title": "Left-wing advocacy groups in the hot seat as anti-ICE riots trigger investigation: 'Not protected speech'",
    "description": "Senate investigation targets CHIRLA and activist groups after Los Angeles anti-ICE protests, with an organization's director vowing not to back down",
    "link": "https://www.foxnews.com/politics/left-wing-advocacy-groups-hot-seat-anti-ice-riots-trigger-investigation-not-protected-speech",
    "timestamp": "2025-06-15T11:00:06Z"
  },
  {
    "title": "‘Solid evidence’: Iran says US bears responsibility for Israel’s aggression",
    "description": "Foreign Minister Abbas Araghchi says US President Donald Trump publicly and explicitly confirmed he knew about attacks.",
    "link": "https://www.aljazeera.com/news/2025/6/15/solid-evidence-iran-says-us-bears-responsibility-for-israels-aggression",
    "timestamp": "2025-06-15T10:53:13Z"
  },
  {
    "title": "Musk's Daring Gambit Has Managed to Do Something Remarkable: Alienate Democrats AND Republicans",
    "description": "It appears that Elon Musk has seriously overestimated his popularity among his right wing fans. In another one of his masterful gambits, the world's richest man turned-coat and viciously lashed out his former best-friend-in-chief Donald Trump this month.  Wit…",
    "link": "https://futurism.com/musk-gambit-democrats-republicans",
    "timestamp": "2025-06-15T10:45:29Z"
  },
  {
    "title": "Manhunt underway in Minnesota as police name suspect in shootings of Democratic politicians",
    "description": "Democratic State Representative Melissa Hortman and her husband Mark were killed at their home in the Minneapolis suburb of Brooklyn Park.",
    "link": "https://www.thejournal.ie/minnesota-manhunt-police-name-suspect-melissa-hortman-6733755-Jun2025/",
    "timestamp": "2025-06-15T10:33:13Z"
  },
  {
    "title": "'No Kings' Protests See Major Crowds, Violence in Some States",
    "description": "Despite peaceful demonstrations reported in multiple cities, violence flared at some anti-Trump protests over the weekend.",
    "link": "https://www.newsweek.com/no-kings-protests-major-crowds-violence-2085650",
    "timestamp": "2025-06-15T10:32:17Z"
  },
  {
    "title": "G7 summit: Middle East conflict set to dominate meeting",
    "description": "German Chancellor Friedrich Merz told reporters that the conflict in the Middle East, along with Russia's invasion of Ukraine, will be among the key issues at the three-day meeting of the G7 organization. Germany's leader Friedrich Merz says conflict in the M…",
    "link": "https://www.dw.com/en/g7-summit-middle-east-conflict-set-to-dominate-meeting/live-72915936",
    "timestamp": "2025-06-15T10:32:00Z"
  },
  {
    "title": "Putin says Russia is ready for next round of Ukraine talks",
    "description": "Russian President Vladimir Putin has told his U.S. counterpart, Donald Trump, that Moscow is ready to hold a fresh round of peace talks with Kiev after June 22, once the sides complete exchanging prisoners and soldiers' bodies.",
    "link": "https://www.hurriyetdailynews.com/putin-says-russia-is-ready-for-next-round-of-ukraine-talks-210315",
    "timestamp": "2025-06-15T10:29:33Z"
  },
  {
    "title": "Americans don't see Supreme Court as politically neutral, Reuters/Ipsos poll finds",
    "description": "WASHINGTON (Reuters) -Americans are divided on major issues that the U.S. Supreme Court is due to rule on in the coming weeks, but most agree on one thing - neither Republicans nor Democrats see the nation's top judicial body as politically neutral, according…",
    "link": "https://www.thestar.com.my/news/world/2025/06/15/americans-don039t-see-supreme-court-as-politically-neutral-reutersipsos-poll-finds",
    "timestamp": "2025-06-15T10:21:00Z"
  },
  {
    "title": "G7 leaders meet in Canada hoping to avoid Trump clash",
    "description": "Amidst growing rifts with the U.S. over foreign policy and trade, G7 leaders convene in Canada, striving to avoid clashes with President Trump. Issues like U.S. tariffs, Middle East conflicts, and Ukraine are expected to dominate discussions, overshadowing Ca…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/g7-leaders-meet-in-canada-hoping-to-avoid-trump-clash/articleshow/121861816.cms",
    "timestamp": "2025-06-15T10:18:30Z"
  },
  {
    "title": "Trump’s ‘birthday parade’ rolls through Washington as millions join ‘No Kings’ counter protests across US",
    "description": "A massive military parade to celebrate the US Army’s 250th anniversary, requested by President Donald Trump to coincide with his birthday, rolled through Washington DC on Saturday.",
    "link": "https://www.independent.ie/world-news/north-america/trumps-birthday-parade-rolls-through-washington-as-millions-join-no-kings-counter-protests-across-us/a1172980524.html",
    "timestamp": "2025-06-15T10:15:25Z"
  },
  {
    "title": "Americans don't see Supreme Court as politically neutral, Reuters/Ipsos poll finds",
    "description": "WASHINGTON (Reuters) -Americans are divided on major issues that the U.S. Supreme Court is due to rule on in the coming weeks, but most agree on one thing - ...",
    "link": "https://www.yahoo.com/news/americans-dont-see-supreme-court-101359321.html",
    "timestamp": "2025-06-15T10:13:59Z"
  },
  {
    "title": "Israel keeps up Iran strikes after deadly missile barrage",
    "description": "Israel intensified its attacks on Iran, hitting defence sites and fuel storage. This followed Iranian missile strikes on Israel, resulting in casualties. Tehran experienced heavy smoke due to the strikes. The US President Donald Trump denied involvement but w…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-keeps-up-iran-strikes-after-deadly-missile-barrage/articleshow/121861783.cms",
    "timestamp": "2025-06-15T10:13:16Z"
  },
  {
    "title": "GOP Organizing Big Senate Move After LA Riots: Report",
    "description": "\"Democrats put such violent illegal aliens and their anarchist sympathizers ahead of the police, law-abiding citizens and...\"",
    "link": "https://www.westernjournal.com/gop-organizing-big-senate-move-la-riots-report/",
    "timestamp": "2025-06-15T10:09:15Z"
  },
  {
    "title": "Manhunt enters second day for suspect in Minnesota lawmakers attack",
    "description": "Officials identified Vance Luther Boelter (57) as suspect who allegedly killed Democrat and husband and attacked second lawmaker",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/06/14/us/politics/minnesota-shootings-gunman-suspect.html",
    "timestamp": "2025-06-15T10:07:54Z"
  },
  {
    "title": "PENTAGON SPLIT OVER POLICY...",
    "description": "PENTAGON SPLIT OVER POLICY...\r\n\n \n \n \n (Top headline, 7th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:IRAN DIRECT HIT TEL AVIV...\r\n200 BALLISTIC MISSILES LAUNCHED...\r\nATTACKS KILL AT LEAST 10, DOZENS INJURED...\r\nThree-month-old baby pulled out of rubble alive..…",
    "link": "https://www.semafor.com/article/06/14/2025/a-split-in-trumps-israel-policy",
    "timestamp": "2025-06-15T10:01:36Z"
  },
  {
    "title": "Trump’s latest travel ban is as misguided as his last one",
    "description": "The Trump administration’s move to close US gates to people from a dozen countries might escape court rejection, but it’s just as bad as the president’s first-term travel ban. It’s sure to disrupt lives without making America safer.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-us-travel-ban-immigration-policy-supreme-court-joe-biden-visa-overstays-homeland-security-somali-refugees-11749808546796.html",
    "timestamp": "2025-06-15T10:00:02Z"
  },
  {
    "title": "Ayo Edebiri and Mark Ruffalo among stars at ‘No Kings’ anti-Trump protests",
    "description": "Millions turned up to protest president in hundreds of cities across the US",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/no-kings-trump-protest-mark-uffalo-ayo-edebiri-b2770354.html",
    "timestamp": "2025-06-15T10:00:01Z"
  },
  {
    "title": "Trump can't quit while he's ahead. The Los Angeles protests prove it.",
    "description": "President Donald Trump deployed the National Guard and Marines to \"protect\" Los Angeles. But while polls show immigration is a winning issue he pushed too hard.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-poll-los-angeles-protests-immigration-rcna212751",
    "timestamp": "2025-06-15T10:00:00Z"
  },
  {
    "title": "The AI Industry Is Ready to Get Rich off Trump’s Defense Department",
    "description": "“My request to all of you is: Please, become rich off selling to the United States Army.” \r\nThis was Army Secretary Dan Driscoll’s parting message at the end of his Exchange session at the AI+ Expo for National Competitiveness, earlier this month. \r\nIt was th…",
    "link": "https://newrepublic.com/article/196763/ai-industry-trump-defense-department",
    "timestamp": "2025-06-15T10:00:00Z"
  },
  {
    "title": "Gavin Newsom has landed on a real strategy for resisting Trump",
    "description": "California Governor Gavin Newsom has pivoted to being a leader of the Democrats' resistance against Donald Trump over the L.A. protests over immigration.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/gavin-newsom-trump-la-protests-los-angeles-rcna212664",
    "timestamp": "2025-06-15T10:00:00Z"
  },
  {
    "title": "Trump’s Funding Cuts Leave Alaska Native Village in the Dark, Stalling Clean Energy Dreams",
    "description": "This story was originally published by Grist and is reproduced here as part of the Climate Desk collaboration. For the fewer than a hundred people that make up the entire population of Port Heiden, Alaska, fishing provides both a paycheck and a full dinner pl…",
    "link": "https://www.motherjones.com/politics/2025/06/trumps-funding-cuts-leave-alaska-native-village-in-the-dark-stalling-clean-energy-dreams/",
    "timestamp": "2025-06-15T10:00:00Z"
  },
  {
    "title": "Iran missiles kill 10 in Israel in night of mutual attacks",
    "description": "Iranian missile fire on Israel killed at least 10 people overnight, authorities said Sunday, as the foes exchanged new waves of attacks in their most intense confrontation in history. In Iran, a heavy cloud of smoke billowed over the capital after Israeli air…",
    "link": "https://www.digitaljournal.com/world/iran-missiles-kill-10-in-israel-in-night-of-mutual-attacks/article",
    "timestamp": "2025-06-15T09:57:20Z"
  },
  {
    "title": "It's a common workplace problem: Things got heated during a disagreement. Now what?",
    "description": "Jim WATSON / AFP\nElon Musk walked back comments he made during the \"first buddy\" fallout with President Donald Trump.\nIt's a common workplace problem: Things got heated during a disagreement. Now what?\nCareer experts shared tips with BI on how to make up with…",
    "link": "https://biztoc.com/x/9185f59f7cdb2c51",
    "timestamp": "2025-06-15T09:54:20Z"
  },
  {
    "title": "It's a common workplace problem: Things got heated during a disagreement. Now what?",
    "description": "Things got heated during a disagreement with your boss. Now what? Career experts told BI how to make up with your manager after a conflict at work.",
    "link": "https://www.businessinsider.com/fix-relationship-boss-workplace-manager-fight-mistakes-conflict-career-experts-2025-6",
    "timestamp": "2025-06-15T09:47:01Z"
  },
  {
    "title": "AG primary goes electric in battle over energy, experience",
    "description": "The Democratic primary for attorney general has become a heavyweight fight, but not necessarily between the two candidates.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_2c62cd95-047e-4324-ab43-b86cc77a30b6.html",
    "timestamp": "2025-06-15T09:45:00Z"
  },
  {
    "title": "Israel and Iran trade strikes for 3rd day as nuclear talks are called off",
    "description": "Israel unleashed airstrikes across Iran for a third day on Sunday and threatened even greater force as some Iranian missiles evaded Israeli air defenses to strike buildings in the heart of the country. Planned talks on Iran's nuclear program, which could prov…",
    "link": "https://www.cbc.ca/news/world/israel-iran-attacks-trump-weighs-in-1.7561756",
    "timestamp": "2025-06-15T09:36:38Z"
  },
  {
    "title": "Ajit Ranade: West Asia’s upheaval intensifies India’s challenges of geopolitics",
    "description": "The Israel-Iran war will make it harder for New Delhi to navigate global turbulence even as an oil flare-up poses a threat. But it could also spur domestic policy changes—in favour trade diversification, for example—that strengthen our economy.",
    "link": "https://www.livemint.com/opinion/online-views/israel-iran-conflict-middle-east-tehran-tel-aviv-india-oil-price-houthis-hezbollah-nuclear-us-china-hormuz-ali-khamenei-11749970420850.html",
    "timestamp": "2025-06-15T09:33:37Z"
  },
  {
    "title": "My 5-year-old survived cancer twice. Medical innovation shouldn't be political. | Opinion",
    "description": "An mRNA-based diagnostic test is being developed that could catch cancers earlier, when they're more treatable. But this innovation is under threat.",
    "link": "https://www.indystar.com/story/opinion/columnists/2025/06/15/mrna-cancer-research-treatment-under-attack/84188405007/",
    "timestamp": "2025-06-15T09:30:41Z"
  },
  {
    "title": "The clock's ticking on Trump's immunity — and he just broke the law",
    "description": "This week, when border czar Tom Homan threatened to arrest\r\n California Gov. Gavin Newsom and Los Angeles Mayor Karen Bass, Donald Trump goaded him on, telling reporters,\r\n “I would do it if I were Tom. I think it's great!” and adding, “Gavin likes the public…",
    "link": "https://www.rawstory.com/raw-investigates/newsom-vs-trump-2672364990/",
    "timestamp": "2025-06-15T09:30:02Z"
  },
  {
    "title": "Trump promises to respond with 'full strength and might' of US military if Iran attacks America",
    "description": "U.S. President Donald Trump warned on Sunday that any attack against the U.S. will be met with the \"full strength and might\" of the U.S. military.",
    "link": "https://www.foxnews.com/world/trump-promises-respond-full-strength-might-us-military-iran-attacks-america",
    "timestamp": "2025-06-15T09:28:29Z"
  },
  {
    "title": "Vance Boelter's Friend Reveals More Details About Assassination Suspect",
    "description": "David Carlson, who says that he has known Boelter since fourth grade, described the shooting suspect as a \"great guy.\"",
    "link": "https://www.newsweek.com/vance-boelter-roommate-assassination-melissa-hortman-2085651",
    "timestamp": "2025-06-15T09:27:56Z"
  },
  {
    "title": "‘Cringe spectacle’: US Army's parade in Trump’s $45 Million birthday event mocked",
    "description": "President Donald Trump hosted the largest US military parade in decades on his 79th birthday as protesters rallied across the country to accuse him of acting like a dictator. - 'Happy Birthday' - Trump had openly dreamed since his first term as president of h…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/cringe-spectacle-us-armys-parade-in-trumps-45-million-birthday-event-mocked/articleshow/121861320.cms",
    "timestamp": "2025-06-15T09:27:02Z"
  },
  {
    "title": "Security Affairs newsletter Round 528 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly Security Affairs newsletter has arrived! Every week, the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Palo Alt…",
    "link": "https://securityaffairs.com/179014/breaking-news/security-affairs-newsletter-round-528-by-pierluigi-paganini-international-edition.html",
    "timestamp": "2025-06-15T09:23:11Z"
  },
  {
    "title": "Trump's Harvard battle is making some students consider European universities instead",
    "description": "The Trump administration has tried to stop Harvard University from enrolling foreign students.\nAnna Moneymaker/Getty Images\nEuropean universities say Donald Trump's battle with Harvard is driving a rise in international applicants.\nHarvard is battling Trump i…",
    "link": "https://biztoc.com/x/3d250f745c084b74",
    "timestamp": "2025-06-15T09:21:20Z"
  },
  {
    "title": "Anxious Harvard-bound Singaporeans press ahead with plans, even as some still don’t have visas",
    "description": "Singaporean students bound for Harvard University are still pressing ahead with their plans despite uncertainty over US President Donald Trump's ban on foreign students, even as some still do not have their visas. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/15/anxious-harvard-bound-singaporeans-press-ahead-with-plans-even-as-some-still-dont-have-visas",
    "timestamp": "2025-06-15T09:21:00Z"
  },
  {
    "title": "What if Pakistan does mine its own crypto? There are 3 problems with its plan",
    "description": "International News: Pakistan wants to set aside 2,000 megawatts to mine bitcoins and set up AI data centres. But can it power bitcoins when it can’t power Karachi?",
    "link": "https://timesofindia.indiatimes.com/toi-plus/international/what-if-pakistan-does-mine-its-own-crypto-there-are-3-problems-with-its-plan/articleshow/121861204.cms",
    "timestamp": "2025-06-15T09:18:08Z"
  },
  {
    "title": "Trump's Harvard battle is making some students consider European universities instead",
    "description": "Top European universities say they're benefiting from Trump's US visa legal battle, with a rise in interest from international students.",
    "link": "https://www.businessinsider.com/harvard-trump-visa-crackdown-applications-european-universities-2025-6",
    "timestamp": "2025-06-15T09:17:02Z"
  },
  {
    "title": "Manhunt under way in US for suspect who shot Minnesota lawmakers",
    "description": "Search continues for Vance Luther Boelter, who allegedly killed Democratic politician Melissa Hortman and her husband.",
    "link": "https://www.aljazeera.com/news/2025/6/15/manhunt-under-way-in-us-for-suspect-who-shot-minnesota-lawmakers",
    "timestamp": "2025-06-15T09:15:37Z"
  },
  {
    "title": "Trump says US had 'nothing to do with' Israeli attack against Iran, warns against attacks on America [and]\n Three drones targeting a base housing U.S. troops in western Iraq were intercepted",
    "description": "U.S. President Donald Trump said the U.S. had \"nothing to do with\" Israel's attack against Iran Sunday morning, warning that any attack against the U.S. will be met with the \"full strength and might\" of the U.S. military. \"If we are attacked in any way, shape…",
    "link": "https://freerepublic.com/focus/f-news/4323147/posts",
    "timestamp": "2025-06-15T09:12:27Z"
  },
  {
    "title": "Trump celebrates 79th birthday at $45m military parade as America stirred by deep unrest",
    "description": "The modest crowd for the Washington, DC, event must have wounded the vanity of Trump, who gave only a short speech",
    "link": "https://www.irishtimes.com/world/us/2025/06/15/trump-celebrates-79th-birthday-at-45m-military-parade-as-america-stirred-by-deep-unrest/",
    "timestamp": "2025-06-15T09:09:55Z"
  },
  {
    "title": "UK Sends Jets to Protect Its Military Bases Over Iran Threat",
    "description": "The UK is moving aircraft to the Middle East to protect its military bases, Prime Minister Keir Starmer said, as he urged Israel and Iran to de-escalate their conflict.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-sends-jets-to-protect-its-military-bases-over-iran-threat",
    "timestamp": "2025-06-15T09:08:32Z"
  },
  {
    "title": "Central Banks worldwide expected to keep interest rates frozen as nations eye Israel-Iran turmoil, Trump's trade war",
    "description": "Central banks around the world are expected to keep the interest rates frozen in the coming week while evaluating the impact of trade disruptions from US President Donald Trump, along with the escalating Israel-Iran conflict.&nbsp;",
    "link": "https://www.livemint.com/industry/banking/central-banks-worldwide-expected-to-keep-interest-rates-frozen-as-nations-eye-israel-iran-turmoil-trumps-trade-war-11749976692014.html",
    "timestamp": "2025-06-15T09:04:48Z"
  },
  {
    "title": "Trump warns Iran against attacking",
    "description": "Tehran will face “the full strength and might of the US Armed Forces” if it targets American assets, Trump has warned Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619347-trump-us-iran-israel/",
    "timestamp": "2025-06-15T09:03:44Z"
  },
  {
    "title": "Kids are ditching traditional college for career tech programs. Parents are concerned.",
    "description": "There's an emerging generational divide on attending college after high school.",
    "link": "https://www.usatoday.com/story/news/education/2025/06/15/kids-ditch-traditional-college-after-high-school/84027992007/",
    "timestamp": "2025-06-15T09:03:27Z"
  },
  {
    "title": "Pols & Politics: Karen Spilka compares ICE arrests to Adolf Hitler’s rise to power",
    "description": "Senate President Karen Spilka compared sweeping arrests by federal immigration authorities since President Donald Trump took office in January to Adolf Hitler’s rise to power in Europe during the 1930s.",
    "link": "https://www.bostonherald.com/2025/06/15/pols-politics-karen-spilka-compares-ice-arrests-to-adolf-hitlers-rise-to-power/",
    "timestamp": "2025-06-15T09:03:05Z"
  },
  {
    "title": "Holders Mexico win Gold Cup opener amid LA tensions",
    "description": "Holders Mexico begin their defence of the Gold Cup with a 3-2 win over the Dominican Republic.",
    "link": "https://www.bbc.com/sport/football/live/cm26qdmrpq4t",
    "timestamp": "2025-06-15T09:03:01Z"
  },
  {
    "title": "UFC: Dvalishvili keeps bantamweight title vs O’Malley; Usman beats Buckley",
    "description": "Georgian Dvalishvili defeated home favourite at UFC 316 in three rounds in front of US President Trump in New Jersey.",
    "link": "https://www.aljazeera.com/sports/2025/6/15/ufc-dvalishvili-keeps-bantamweight-title-vs-omalley-usman-beats-buckley",
    "timestamp": "2025-06-15T09:02:30Z"
  },
  {
    "title": "After RFK Jr. autism claims, CT families respond — one with poetry",
    "description": "Robert F. Kennedy Jr. painted a bleak picture of people with autism spectrum disorder, or ASD, that was especially hurtful to some.",
    "link": "http://ctmirror.org/2025/06/15/rfk-jr-autism-ct-families-respond/",
    "timestamp": "2025-06-15T09:00:50Z"
  },
  {
    "title": "Democrat Michigan AG Asked FBI to Raid Protesters’ Homes — But Won’t Tell Students Why",
    "description": "“It’s a terribly unusual thing,” a lawyer said about sealed affidavits in an investigation of alleged pro-Palestine vandalism.\nThe post Democrat Michigan AG Asked FBI to Raid Protesters’ Homes — But Won’t Tell Students Why appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/15/university-michigan-fbi-raid-students-palestine/",
    "timestamp": "2025-06-15T09:00:00Z"
  },
  {
    "title": "Donald Trump 'considering adding another 36 countries' to travel ban list",
    "description": "Donald Trump is considering adding another 36 countries to his list of places banned from travelling to the US",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-travel-ban-list-more-471986-20250615",
    "timestamp": "2025-06-15T08:59:36Z"
  },
  {
    "title": "Donald Trump threatens 'levels never seen before' as he addresses Israel and Iran conflict",
    "description": "Speaking on the conflict between Israel and Iran, Donald Trump threatened Iran with 'levels never seen before' if it hits anything American.",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-israel-iran-threatens-768102-20250615",
    "timestamp": "2025-06-15T08:58:39Z"
  },
  {
    "title": "Trump’s $45 million birthday parade turns into a drowsy disaster",
    "description": "Donald Trump's birthday parade faced unexpected attention. The event in Washington, D.C., showcased military might. However, Trump seemed uninterested. Reports suggest he may have dozed off. Social media erupted with jokes. Critics questioned the parade's cos…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-45-million-birthday-parade-turns-into-a-drowsy-disaster/articleshow/121861068.cms",
    "timestamp": "2025-06-15T08:56:44Z"
  },
  {
    "title": "Ruotuväki: Stubb in weekly contact with Trump",
    "description": "Alexander Stubb maintains exceptionally close ties with the United States for a Finnish president.",
    "link": "https://yle.fi/a/74-20167845",
    "timestamp": "2025-06-15T08:56:25Z"
  },
  {
    "title": "Mel Gibson Calls Out Gavin Newsom, Karen Bass amid ‘Rampant Lawlessness’ in L.A.: ‘How Much More of Their Destructive Decision-Making Are We Going to Tolerate’",
    "description": "Oscar-winning star Mel Gibson called out California Gov. Gavin Newsom and Los Angeles Mayor Karen Bass for their mishandling of the violent anti-ICE riots that roiled the City of Angels.",
    "link": "https://www.breitbart.com/entertainment/2025/06/15/mel-gibson-calls-out-gavin-newsom-karen-bass-amid-rampant-lawlessness-in-l-a-how-much-more-of-their-destructive-decision-making-are-we-going-to-tolerate/",
    "timestamp": "2025-06-15T08:52:14Z"
  },
  {
    "title": "Trump threatens retaliation if Iran strikes U.S. bases",
    "description": "President Donald Trump warned Iran that he would deploy the \"full force\" of the military should Iran attack U.S. assets in the region.",
    "link": "https://www.nbcnews.com/world/middle-east/live-blog/iran-israel-attacks-live-updates-rcna213113",
    "timestamp": "2025-06-15T08:41:11Z"
  },
  {
    "title": "It's a pretty miserable time to take a big financial risk",
    "description": "Americans are uneasy about buying real estate, changing careers, and more. Here's what to know about timing big purchases and risks in this economy.",
    "link": "https://www.businessinsider.com/big-purchases-financial-risks-economic-uncertainty-real-estate-careers-2025-6",
    "timestamp": "2025-06-15T08:37:01Z"
  },
  {
    "title": "Manu Joseph: What Elon Musk can learn from the ‘richest man ever’",
    "description": "Before Elon Musk became the richest man in the world, there was Jacob Fugger, a 16th-century banker worth $400 billion in today's money. But unlike Musk, Fugger knew the limits of his power and would not have picked a fight with US President Donald Trump.",
    "link": "https://www.livemint.com/opinion/online-views/elon-musk-jakob-fugger-donald-trump-jeffrey-epstein-holy-roman-empire-charles-v-greg-steinmetz-richest-man-in-the-world-11749806539056.html",
    "timestamp": "2025-06-15T08:30:00Z"
  },
  {
    "title": "Trump clears way for Nippon Steel to buy U.S. Steel",
    "description": "TOKYO -- U.S. President Donald Trump on Friday cancelled the decision by former President Joe Biden to block Nippon Steel's acquisition of U.S. Steel, paving the way for the Japanese company to finalize its takeover of its American counterpart.\nNippon Steel i…",
    "link": "https://biztoc.com/x/3fff589f59ec8f08",
    "timestamp": "2025-06-15T08:26:01Z"
  },
  {
    "title": "Pentagon chief assures lawmakers on review of US-Britain-Australia pact",
    "description": "'Congress will be involved' in 30-day assessment of Aukus alliance formed to counter Beijing's regional clout, defence secretary testifies Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/15/pentagon-chief-assures-lawmakers-on-review-of-us-britain-australia-pact",
    "timestamp": "2025-06-15T08:23:00Z"
  },
  {
    "title": "VW in Brazil: A dark history",
    "description": "Brazil is one of VW's most critical foreign bases. The company's past in the country is blighted by decades of human rights abuses and exploitation.",
    "link": "https://www.dw.com/en/vw-in-brazil-a-dark-history/a-72863310",
    "timestamp": "2025-06-15T08:19:00Z"
  },
  {
    "title": "VW in Brazil: A dark history",
    "description": "Brazil is one of VW's most critical foreign bases. The company's past in the country is blighted by decades of human rights abuses and exploitation. US President Donald Trump is trying to turn back time by using import tariffs as a tool to force international…",
    "link": "https://www.dw.com/en/vw-in-brazil-a-dark-history/a-72863310",
    "timestamp": "2025-06-15T08:19:00Z"
  },
  {
    "title": "Iran does not want conflict with Israel to expand but will defend itself, foreign minister says",
    "description": "DUBAI (Reuters): Iran does not want its conflict with Israel to expand to neighbouring countries unless the situation is forced, Foreign Minister Abbas Araqchi said on Sunday (June 15), adding its response had been based on self-defence. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/06/15/iran-does-not-want-conflict-with-israel-to-expand-but-will-defend-itself-foreign-minister-says",
    "timestamp": "2025-06-15T08:17:00Z"
  },
  {
    "title": "Tanks, troops and flyovers in D.C. as Trump gets his military parade - The Washington Post",
    "description": "Tanks, troops and flyovers in D.C. as Trump gets his military paradeThe Washington Post D.C. onlookers line streets for Trump military parade; 'No Kings' protests unfold nationwideNBC News WATCH: Army 250th anniversary celebration in Washington DCFOX 5 DC Don…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178053745",
    "timestamp": "2025-06-15T08:15:08Z"
  },
  {
    "title": "Trump Raked in $57.3 Million From Crypto Venture, Per White House Financial Disclosures",
    "description": "President Donald Trump earned money in 2024 from a variety of sources, including luxury properties and royalty payments and licensing earnings for the use of his name and likeness last year, and big bucks from his crypto venture with World Liberty Financial, …",
    "link": "https://biztoc.com/x/2c2134c4d6ac5296",
    "timestamp": "2025-06-15T08:14:52Z"
  },
  {
    "title": "Israel-Iran conflict: latest developments",
    "description": "Israel and Iran traded fire for a third straight day on Sunday, with rising casualties and expanding targets marking a sharp escalation in the conflict...",
    "link": "https://www.yahoo.com/news/israel-iran-conflict-latest-developments-081214845.html",
    "timestamp": "2025-06-15T08:12:14Z"
  },
  {
    "title": "Netanyahu has two war aims: destroying Iran’s nuclear program and regime change. Are either achievable?",
    "description": "There are few clear paths to an immediate end to the fighting between Israel and Iran. And what comes after the war could be even more concerning.",
    "link": "https://theconversation.com/netanyahu-has-two-war-aims-destroying-irans-nuclear-program-and-regime-change-are-either-achievable-259014",
    "timestamp": "2025-06-15T08:08:45Z"
  },
  {
    "title": "Message from the Editor: Israel’s attack on Iran a dangerous escalation",
    "description": "What makes this attack all the more significant is not just its scale, but the geopolitical context",
    "link": "https://www.irishtimes.com/media/2025/06/15/message-from-the-editor-israels-attack-on-iran-a-dangerous-escalation/",
    "timestamp": "2025-06-15T08:08:33Z"
  },
  {
    "title": "Sitdown Sunday: The spying scandal with an Irish twist that's gripping Silicon Valley",
    "description": "Settle down in a comfy chair with some of the week’s best longreads.",
    "link": "https://www.thejournal.ie/sitdown-sunday-longreads-longform-29-6730086-Jun2025/",
    "timestamp": "2025-06-15T08:00:54Z"
  },
  {
    "title": "Todd and Savannah Chrisley Hug After His Release From Prison, on Video",
    "description": "Todd Chrisley's been out of prison for a few weeks now ... but, it looks like nothing could be sweeter than the moment he got to hug his daughter Savannah as a free man -- and, TMZ has obtained video of that very moment. We now have exclusive video…\n Permalink",
    "link": "https://www.tmz.com/2025/06/15/todd-savannah-chrisley-hug-after-release-federal-prison/",
    "timestamp": "2025-06-15T08:00:53Z"
  },
  {
    "title": "Carney's first foreign policy test begins at G7 — amid Middle East crisis and Trump's trade war",
    "description": "Prime Minister Mark Carney will welcome leaders of the world's most powerful democratic countries Sunday for the start of a three-day meeting in the Rocky Mountains — a high-stakes summit that longtime G7 observers say could be one of the most consequential i…",
    "link": "https://www.cbc.ca/news/politics/g7-carney-setup-piece-1.7559717",
    "timestamp": "2025-06-15T08:00:00Z"
  },
  {
    "title": "How the trade war with the U.S. could fix Canada's internet",
    "description": "Canada’s current trade war with the U.S. has many people fearing what Donald Trump is going to do next. But there are some who believe the severing of trade ties with America is more of an unshackling, freeing Canada to fix what they view as a longstanding pr…",
    "link": "https://www.cbc.ca/radio/trade-war-internet-1.7559918",
    "timestamp": "2025-06-15T08:00:00Z"
  },
  {
    "title": "Carney, Trump to sit down Monday ahead of G7 start as work continues on tariff deal",
    "description": "In his first big test at the G7, Prime Minister Mark Carney will meet with U.S. President Donald Trump on Monday morning, according to an official in his office.",
    "link": "https://www.cbc.ca/news/politics/carney-trump-meeting-g7s-1.7561891",
    "timestamp": "2025-06-15T08:00:00Z"
  }
]