[
  {
    "title": "Cracker Barrel says it \"could've done a better job\" with release of new logo that angered some fans",
    "description": "Cracker Barrel says it \"could've done a better job\" with release of new logo that angered some fanswsbradio.com",
    "link": "https://www.wsbradio.com/news/cracker-barrel-says/YFJRO47LCZBU7P2W2U44OKUKCI/",
    "timestamp": "2025-08-25T22:05:55Z"
  },
  {
    "title": "Fact check: Trump’s barrage of false claims about crime in Washington, DC | CNN Politics",
    "description": "President Donald Trump delivered a barrage of false claims about crime in Washington, DC, during a series of Monday comments defending his takeover of the police force and deployment of the National Guard in the nation’s capital.",
    "link": "https://www.cnn.com/2025/08/25/politics/fact-check-trump-dc-national-guard",
    "timestamp": "2025-08-25T22:05:06Z"
  },
  {
    "title": "Panel Wants Birthday Book, Client List From Epstein Estate",
    "description": "The House Oversight Committee on Monday issued a sweeping subpoena to the estate of Jeffrey Epstein, demanding to see any client lists the disgraced financier may have had, as well as a leather-bound \"birthday book\" reportedly put together by Ghislaine Maxwel…",
    "link": "https://www.newser.com/story/374091/panel-wants-birthday-book-client-list-from-epstein-estate.html",
    "timestamp": "2025-08-25T22:05:00Z"
  },
  {
    "title": "'We’re just gonna do it': Trump plans to rename Defense Department to Department of War",
    "description": "President Donald Trump announces his administration will likely rename the Department of Defense to the Department of War to restore a \"warrior ethos\" and move away from \"woke ideology.\"",
    "link": "https://www.israelnationalnews.com/news/413858",
    "timestamp": "2025-08-25T22:04:03Z"
  },
  {
    "title": "Cracker Barrel finally responds to ‘woke’ logo backlash",
    "description": "The \"old timer\" — a.k.a., “Uncle Herschel” — will still appear on the menu and road signs: “He’s not going anywhere,” the chain insists.",
    "link": "https://www.yahoo.com/news/article/cracker-barrel-finally-responds-to-woke-logo-backlash-220319570.html",
    "timestamp": "2025-08-25T22:03:19Z"
  },
  {
    "title": "Cracker Barrel responds to ‘woke’ logo outcry, as Trump urges them to revert back",
    "description": "The \"old timer\" — a.k.a., “Uncle Herschel” — will still appear on the menu and road signs: “He’s not going anywhere,” the chain insists.",
    "link": "https://www.yahoo.com/news/article/cracker-barrel-responds-to-woke-logo-outcry-as-trump-urges-them-to-revert-back-220319651.html",
    "timestamp": "2025-08-25T22:03:19Z"
  },
  {
    "title": "DC is murder-free thanks to Trump — but his haters won’t accept reality",
    "description": "Leftists may resist the truth, but it’s simple: When you raise the risks of committing crime, crime falls.",
    "link": "https://nypost.com/2025/08/25/opinion/dc-is-murder-free-thanks-to-trump-but-haters-wont-face-reality/",
    "timestamp": "2025-08-25T22:01:18Z"
  },
  {
    "title": "Chicago Crime Rate Compared to Other Cities as Trump Threatens Crackdown",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has threatened to send National Guard troops into Chicago to address crime—but the latest data from the Federal Bureau of Statistics (FBI) shows several major cities have higher rates of…",
    "link": "https://biztoc.com/x/4f157c3d2fa0916f",
    "timestamp": "2025-08-25T22:01:16Z"
  },
  {
    "title": "President Trump Should Return to an ‘America First’ Foreign Policy",
    "description": "This post President Trump Should Return to an ‘America First’ Foreign Policy appeared first on Daily Reckoning.\nDr. Paul makes the case for ending American involvement in foreign wars.\nThe post President Trump Should Return to an ‘America First’ Foreign Polic…",
    "link": "https://dailyreckoning.com/president-trump-should-return-to-an-america-first-foreign-policy/",
    "timestamp": "2025-08-25T22:00:18Z"
  },
  {
    "title": "Cold War Plutonium Could Power Future U.S. Reactors",
    "description": "Plutonium material from dismantled U.S. nuclear warheads from the Cold War could be offered to American power firms as a fuel to potentially use in advanced nuclear technologies, under a draft plan of the Trump Administration.    The U.S. does not use plutoni…",
    "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Cold-War-Plutonium-Could-Power-Future-US-Reactors.html",
    "timestamp": "2025-08-25T22:00:00Z"
  },
  {
    "title": "Brazil’s government says it will buy some domestic products hit by Trump’s tariffs",
    "description": "SAO PAULO (AP) — Brazil’s government said on Monday it will buy several domestic products hit by the 50% higher U.S. tariffs, such as acai, coconut water, mangoes and Brazilian nuts — and that it will pay an “adequate” price for them. Coffee and beef did not …",
    "link": "https://financialpost.com/pmn/brazils-government-says-it-will-buy-some-domestic-products-hit-by-trumps-tariffs",
    "timestamp": "2025-08-25T21:59:51Z"
  },
  {
    "title": "Chicago Crime Rate Compared to Other Cities as Trump Threatens Crackdown",
    "description": "Illinois Governor J.B. Pritzker said Trump's threats are an attempt to \"intimidate his political rivals\" on Monday.",
    "link": "https://www.newsweek.com/chicago-crime-rate-compared-trump-threatens-cracdown-2119052",
    "timestamp": "2025-08-25T21:59:25Z"
  },
  {
    "title": "Three Russian Il-20 Intercepts in a Week off Alaska by NORAD",
    "description": "NORAD scrambled U.S. Air Force F-16s to intercept Russian Il-20 surveillance aircraft three times in the Alaskan ADIZ in less than one week. The North American Aerospace Defense Command (NORAD) reported three separate intercepts of Russian Il-20 “Coot” survei…",
    "link": "https://theaviationist.com/2025/08/25/three-russian-il-20-intercepts-in-a-week-off-alaska-by-norad/",
    "timestamp": "2025-08-25T21:58:30Z"
  },
  {
    "title": "Netanyahu Apologizes, Trump Responds After Israel Double-Taps Hospital, Killing 20",
    "description": "Netanyahu said Israel “deeply regrets” a strike on Gaza’s Nasser Hospital and President Donald Trump said he was “not happy” about it.",
    "link": "https://dailycaller.com/2025/08/25/benjamin-netanyahu-apologizes-donald-trump-idf-hospital-20-dead/",
    "timestamp": "2025-08-25T21:57:16Z"
  },
  {
    "title": "As Trump appears to waffle on National Guard in Chicago, Pritzker says, ‘do not come’",
    "description": "Illinois Gov. JB Pritzker indeed made it clear he wasn’t inviting Trump to send the National Guard to Chicago",
    "link": "https://www.stltoday.com/news/local/government-politics/article_4f2550c1-6152-4e19-ab1b-5e8f6c5c740f.html",
    "timestamp": "2025-08-25T21:57:00Z"
  },
  {
    "title": "Cracker Barrel says it ‘could’ve done a better job’ with release of new logo that angered some fans",
    "description": "Cracker Barrel is sticking with its new logo but apologizing to fans who were angered when the change was announced last week. “If the last few days have shown us anything, it’s how deeply people care about Cracker Barrel. We’re truly grateful for your heartf…",
    "link": "https://financialpost.com/pmn/cracker-barrel-says-it-couldve-done-a-better-job-with-release-of-new-logo-that-angered-some-fans",
    "timestamp": "2025-08-25T21:56:46Z"
  },
  {
    "title": "House Committee Subpoenas Jeffrey Epstein’s Estate For ‘Birthday Book’ Allegedly Containing Trump Letter",
    "description": "The book reportedly contains a letter from President Donald Trump, according to The Wall Street Journal, though Trump has refuted the story and its findings as “fake.”",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/08/25/house-committee-subpoenas-jeffrey-epsteins-estate-for-birthday-book-allegedly-containing-trump-letter/",
    "timestamp": "2025-08-25T21:56:45Z"
  },
  {
    "title": "Trump suggests many Americans 'like a dictator'",
    "description": "U.S. President Donald Trump on Monday suggested many Americans would like a dictator as he signed orders to tighten his federal clampdown on the capital Washington and to prosecute flag-burners. During a rambling 80-minute event in the Oval Office, Trump lamb…",
    "link": "https://japantoday.com/category/world/trump-suggests-many-americans-%27like-a-dictator%27",
    "timestamp": "2025-08-25T21:56:25Z"
  },
  {
    "title": "Israel bombs hospital, kills journalists, medics, dozens more across Gaza",
    "description": "'Double-tap' attack on Nasser Hospital kills at least 21 Palestinians and draws global condemnation.",
    "link": "https://www.aljazeera.com/news/2025/8/25/israel-bombs-hospital-kills-journalists-medics-dozens-more-across-gaza",
    "timestamp": "2025-08-25T21:55:10Z"
  },
  {
    "title": "Kinzinger Blows Up Trump Falsehood Using President’s Own Actions: ‘Debunking One of His Biggest Conspiracies’",
    "description": "Former Rep. Adam Kinzinger demolished a longtime talking point of President Donald Trump's, and he used the president's recent actions to do so.\nThe post Kinzinger Blows Up Trump Falsehood Using President’s Own Actions: ‘Debunking One of His Biggest Conspirac…",
    "link": "https://www.mediaite.com/media/tv/kinzinger-blows-up-trump-falsehood-using-presidents-own-actions-debunking-one-of-his-biggest-conspiracies/",
    "timestamp": "2025-08-25T21:54:59Z"
  },
  {
    "title": "Canary Files for 'American-Made' Crypto ETF—Will XRP, Solana and Cardano Make the Cut?",
    "description": "Canary Capital has filed for an ETF that will give investors exposure to coins created in America or primarily supported by U.S. operations.",
    "link": "https://decrypt.co/336700/canary-american-made-crypto-etf-xrp-solana-cardano",
    "timestamp": "2025-08-25T21:54:44Z"
  },
  {
    "title": "Trump Says Israel Needs to End War With Hamas 'Soon'",
    "description": "President Donald Trump called for Israel to end its war with Hamas soon. “It's got to get over with because, between the hunger ...",
    "link": "https://biztoc.com/x/e4b95c65bd365324",
    "timestamp": "2025-08-25T21:54:15Z"
  },
  {
    "title": "LIVE: Gov. Pritzker holds presser amid Trump’s threats to send National Guard to Chicago",
    "description": "Watch live coverage as Illinois Gov. J.B. Pritzker holds a news conference in response to reports that President Donald Trump is ...",
    "link": "https://biztoc.com/x/47362a3ed26296e7",
    "timestamp": "2025-08-25T21:54:12Z"
  },
  {
    "title": "'Yikes': Trump's dark hand bruises trigger alarm as health questions persist",
    "description": "President Donald Trump had two public events on Monday morning, and for the first time, makeup wasn't covering the bruises on his hands. What it revealed was a shock to those who saw the dark purple on his right hand, while his left appears to be healing. Dur…",
    "link": "https://www.rawstory.com/trump-health-2673917333/",
    "timestamp": "2025-08-25T21:52:50Z"
  },
  {
    "title": "Illinois’ JB Pritzker Rages Against Trump’s Fascist Takeover Plan",
    "description": "Illinois Governor J.B. Pritzker slammed President Donald Trump for planning to bring National Guard troops to Chicago while defunding state and local law enforcement. During a press conference Monday, the Democratic lawmaker said that Trump’s plan to replicat…",
    "link": "https://newrepublic.com/post/199570/illinois-governor-jb-pritzker-rages-trump-fascist-takeover-chicago",
    "timestamp": "2025-08-25T21:51:24Z"
  },
  {
    "title": "5 Most Insane Gaffes From Trump’s Day of Marathon Pressers",
    "description": "President Donald Trump on Monday had multiple press conferences that ended up running extremely long due to a handful of patented marathon rants.\nThe post 5 Most Insane Gaffes From Trump’s Day of Marathon Pressers first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/5-most-insane-gaffes-from-trumps-marathon-pressers/",
    "timestamp": "2025-08-25T21:49:44Z"
  },
  {
    "title": "Trump Order to Kill Cashless Bail Will Exacerbate Inequality While Doing Nothing to Fight Crime, Experts Say",
    "description": "US President Donald Trump signed a pair of executive orders on Monday aimed at ending the policy of cashless bail for people accused of crimes, a move criminal justice reform advocates say will heighten the already massive inequality within the system while d…",
    "link": "https://www.commondreams.org/news/cashless-bail",
    "timestamp": "2025-08-25T21:47:09Z"
  },
  {
    "title": "Maine clinics denied Medicaid funds for low-income patients during lawsuit over Trump cuts to abortion providers",
    "description": "Without Medicaid, the much smaller provider in Maine says it will have to stop serving hundreds of primary care patients by the end of October.",
    "link": "https://www.pbs.org/newshour/health/maine-clinics-denied-medicaid-funds-for-low-income-patients-during-lawsuit-over-trump-cuts-to-abortion-providers",
    "timestamp": "2025-08-25T21:46:21Z"
  },
  {
    "title": "Trump’s Right-Wing Socialism",
    "description": "The president is embodying the type of big government that right-wing politicians and thinkers have been warning about for a century.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/trump-big-government-socialism/684003/",
    "timestamp": "2025-08-25T21:43:00Z"
  },
  {
    "title": "Trump signs proclamation commemorating Abbey Gate attack anniversary with Gold Star families",
    "description": "President Donald Trump honored 13 military service members killed in the Abbey Gate bombing during the Afghanistan withdrawal with a proclamation ceremony.",
    "link": "https://www.foxnews.com/politics/trump-signs-proclamation-commemorating-abbey-gate-attack-anniversary-gold-star-families",
    "timestamp": "2025-08-25T21:40:17Z"
  },
  {
    "title": "Trump honors Abbey Gate Gold Star families on anniversary with proclamation (Mike Brest/Washington Examiner)",
    "description": "Mike Brest / Washington Examiner:\nTrump honors Abbey Gate Gold Star families on anniversary with proclamation  —  President Donald Trump met with the Gold Star families of the 13 U.S. service members killed in the Abbey Gate bombing and signed a proclamation …",
    "link": "https://www.memeorandum.com/250825/p118",
    "timestamp": "2025-08-25T21:40:01Z"
  },
  {
    "title": "Tim Walz Doesn’t Mince Words on Trump: ‘These Are Fascist Policies’",
    "description": "Tim Walz didn't mince words on Donald Trump at the Democratic National Committee's summer meetings in Minnesota, calling his policies \"fascist.\"",
    "link": "http://www.rollingstone.com/politics/politics-news/tim-walz-trump-fascist-policies-1235415337/",
    "timestamp": "2025-08-25T21:39:48Z"
  },
  {
    "title": "Harold Ford Jr.: Any politician who resists this is 'foolish,' playing a 'dangerous and ugly' kind of politics",
    "description": "'The Five' discusses President Donald Trump signing an executive order to end cashless bail in Washington, D.C. and floating bringing his crime crackdown to Chicago.",
    "link": "https://www.foxnews.com/video/6377373143112",
    "timestamp": "2025-08-25T21:39:33Z"
  },
  {
    "title": "Trump says China must ensure rare earth magnets or face 200 per cent tariffs",
    "description": "US President Donald Trump said on Monday that China must ensure the US supply of rare earth magnets or face 200 per cent tariffs, and that he will continue to allow Chinese students into the country.\n“They have to give us magnets,” otherwise “we have to charg…",
    "link": "https://biztoc.com/x/85ae76ba908a57c0",
    "timestamp": "2025-08-25T21:38:41Z"
  },
  {
    "title": "Israel Kills 5 Palestinian Journalists, Dismissing Global Calls For Press Freedom",
    "description": "Israeli Prime Minister Benjamin Netanyahu called the bombing of Nasser Hospital that killed journalists and medics a \"tragic mishap.\"",
    "link": "https://www.huffpost.com/entry/israel-kills-5-palestinian-journalists-gaza-press-freedom_n_68acbed5e4b08b3201ee8bee",
    "timestamp": "2025-08-25T21:38:41Z"
  },
  {
    "title": "Israel Strikes Gaza Hospital Twice",
    "description": "The deadly attack killed at least 20 people, including five journalists.",
    "link": "http://foreignpolicy.com/2025/08/25/israel-gaza-nasser-hospital-strike-journalists-famine/",
    "timestamp": "2025-08-25T21:36:20Z"
  },
  {
    "title": "Trump's crime crackdown targets contenders for the 2028 election",
    "description": "President Donald Trump said that his federal crime crackdown will sully the records of contenders for the 2028 Democratic presidential nomination.",
    "link": "https://www.bostonglobe.com/2025/08/25/business/trump-vance-national-guard-push-2028/",
    "timestamp": "2025-08-25T21:35:24Z"
  },
  {
    "title": "Trump, Bolton, and the FBI Raid Details the Media Isn’t Telling You",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Trump, Bolton, and the FBI Raid Details the Media Isn’t Telling You app…",
    "link": "https://www.dailysignal.com/2025/08/25/trump-bolton-and-the-fbi-raid-details-the-media-isnt-telling-you/",
    "timestamp": "2025-08-25T21:34:54Z"
  },
  {
    "title": "'24-karat gold!' Trump brags about Oval Office makeover while honoring fallen soldiers",
    "description": "President Donald Trump heaped praise on his Oval Office renovation during a ceremony on Monday to honor fallen U.S. soldiers. Trump met with the families of the 13 soldiers who died after terrorists bombed Abbey Gate at the airport in Kabul, Afghanistan, in 2…",
    "link": "https://www.rawstory.com/trump-2673917479/",
    "timestamp": "2025-08-25T21:33:26Z"
  },
  {
    "title": "Trump says Americans might like to have a dictator in the White House",
    "description": "The president complained that the Democrat-run cities on which he is foisting federal forces have not been appreciative.",
    "link": "https://www.thejournal.ie/donald-trump-americans-would-like-dictator-6799176-Aug2025/",
    "timestamp": "2025-08-25T21:33:06Z"
  },
  {
    "title": "North Korea military denounces US-South Korea drills, state media says",
    "description": "SEOUL (Reuters) -North Korea said U.S.-South Korea joint military drills proved Washington's intention to \"occupy\" the Korean peninsula and aim at its enemy countries in the region, state media reported. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/26/north-korea-military-denounces-us-south-korea-drills-state-media-says",
    "timestamp": "2025-08-25T21:33:00Z"
  },
  {
    "title": "House Oversight subpoenas Jeffrey Epstein estate",
    "description": "House Oversight Committee Chairman James Comer issued a new subpoena to the estate of Jeffrey Epstein.",
    "link": "https://abcnews.go.com/Politics/house-oversight-subpoenas-jeffrey-epstein-estate/story?id=124963143",
    "timestamp": "2025-08-25T21:32:20Z"
  },
  {
    "title": "FEMA staffers warn Trump’s cuts will result in Katrina-level catastrophe",
    "description": "Nearly 200 current and former employees of the US emergency response agency urge Congress to protect FEMA.",
    "link": "https://www.aljazeera.com/news/2025/8/25/chk_femastaffers-warn-trumps-cuts-will-result-in-katrina-level-catastrophe",
    "timestamp": "2025-08-25T21:30:52Z"
  },
  {
    "title": "Epstein’s estate subpoenaed by House Oversight Committee",
    "description": "It's the latest effort by both Republicans and Democrats to respond to public clamor for more disclosure in the investigation into Epstein.",
    "link": "https://fortune.com/2025/08/25/jeffrey-epstein-estate-subpoena-house-oversight-committee/",
    "timestamp": "2025-08-25T21:29:35Z"
  },
  {
    "title": "Trump directs Department of Justice to penalize cities and states that use cashless bail",
    "description": "On Monday, President Donald Trump, who has called cashless bail a \"government-backed crime spree,\" signed an executive order to end the policy nationwide. The order restricts the allocation of \"Federal policies and resources\" to jurisdictions and states with …",
    "link": "https://biztoc.com/x/cc44e458ffbd75c5",
    "timestamp": "2025-08-25T21:27:17Z"
  },
  {
    "title": "Cracker Barrel assures customers its values remain the same amid logo uproar",
    "description": "Cracker Barrel on Monday tried to reassure customers that its values have remained the same after receiving criticism following a new logo reveal and general brand refresh.",
    "link": "https://www.nbcnews.com/business/business-news/cracker-barrel-logo-values-rcna227088",
    "timestamp": "2025-08-25T21:25:41Z"
  },
  {
    "title": "Majority Of Voters Say Trump’s DC Crime Crackdown Was ‘Justified,’ Feel ‘Unsafe’",
    "description": "A majority of Americans back President Donald Trump’s crime crackdown in the District of Columbia and believe large American cities are unsafe, according to recent polling. A Harvard CAPS/Harris poll released Monday found that 54% of registered voters said th…",
    "link": "https://dailycaller.com/2025/08/25/trump-dc-crime-crackdown-poll-unsafe-cities/",
    "timestamp": "2025-08-25T21:23:28Z"
  },
  {
    "title": "Canadian grave of British general who torched White House in 1814 draws visitors amid trade war",
    "description": "‘I’ve got friends in the U.S. and when you raise that, they look at us like we have three heads,’ said one visitor from Toronto. ‘They think we’re too nice’",
    "link": "https://nationalpost.com/news/canada/halifax-grave-of-british-general-who-torched-white-house-in-1814-draws-visitors",
    "timestamp": "2025-08-25T21:22:14Z"
  },
  {
    "title": "Donald Trump Kicks His Own Staffer Out of Oval Office After Phone Noise Interrupts His Speech: 'Get Out of the Room'",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_181d64c4-188c-4f36-a4fe-8bfb19ff9b55",
    "timestamp": "2025-08-25T21:22:09Z"
  },
  {
    "title": "DC school year starts with parents on edge over Trump’s armed patrols",
    "description": "As schools opened across the capital city, parental social media groups and listservs were buzzing with reports and rumors of checkpoints and arrests.",
    "link": "https://www.pbs.org/newshour/education/dc-school-year-starts-with-parents-on-edge-over-trumps-armed-patrols",
    "timestamp": "2025-08-25T21:21:46Z"
  },
  {
    "title": "Trump directs Department of Justice to penalize cities and states that use cashless bail",
    "description": "As part of his response to the alleged crime emergencies taking place nationwide, Trump signed an executive order restricting federal funding from jurisdictions with cashless bail policies.",
    "link": "https://reason.com/2025/08/25/trump-directs-doj-to-penalize-states-and-cities-that-use-cashless-bail/",
    "timestamp": "2025-08-25T21:21:08Z"
  },
  {
    "title": "Feds fight to keep 'Alligator Alcatraz' open amid legal battle as 3rd challenge is filed",
    "description": "The federal government over the weekend asked a judge in Miami to put on hold her ruling ordering the winding down of an immigration detention center built by the state of Florida in the Everglades wilderness and nicknamed “Alligator Alcatraz,” pending an app…",
    "link": "https://japantoday.com/category/world/feds-fight-to-keep-%27alligator-alcatraz%27-open-amid-legal-battle-as-3rd-challenge-is-filed",
    "timestamp": "2025-08-25T21:19:00Z"
  },
  {
    "title": "Wrongly deported migrant Abrego detained again; may be sent to Uganda",
    "description": "Kilmar Abrego, the migrant whose wrongful deportation to his native El Salvador made him a symbol of President Donald Trump's immigration crackdown, was detained again by U.S. immigration officials in Baltimore on Monday and may be deported a second time, thi…",
    "link": "https://japantoday.com/category/world/wrongly-deported-migrant-abrego-detained-again-may-be-sent-to-uganda2",
    "timestamp": "2025-08-25T21:18:53Z"
  },
  {
    "title": "Trump envoy says officials working 'very, very hard' on ending Russia-Ukraine war",
    "description": "U.S. President Donald Trump’s special envoy Keith Kellogg said in Kyiv on Monday that officials are “working very, very hard” on efforts to end the three-year war between Russia and Ukraine, as a lack of progress fuels doubts about whether a peace settlement …",
    "link": "https://japantoday.com/category/world/trump-envoy-says-officials-working-%27very-very-hard%27-on-ending-russia-ukraine-war",
    "timestamp": "2025-08-25T21:18:47Z"
  },
  {
    "title": "Trump says he wants to meet North Korea's Kim again",
    "description": "U.S. President Donald Trump said Monday he hoped to meet again with North Korea's Kim Jong Un, possibly this year, as he held White House talks with South Korea's dovish new leader that got off awkwardly. Hours before President Lee Jae Myung arrived for his l…",
    "link": "https://japantoday.com/category/world/trump-eyes-n.korea-meet-as-he-ambushes-s.korea-leader",
    "timestamp": "2025-08-25T21:18:30Z"
  },
  {
    "title": "Israel hits Gaza hospital, killing at least 20 people, including five journalists",
    "description": "Israel struck Nasser hospital in the south of the Gaza Strip on Monday, killing at least 20 people, including five journalists who worked for Reuters, the Associated Press, Al Jazeera and others. Cameraman Hussam al-Masri, a Reuters contractor, was killed nea…",
    "link": "https://japantoday.com/category/world/israel-hits-gaza-hospital-killing-at-least-20-people-including-five-journalists3",
    "timestamp": "2025-08-25T21:18:23Z"
  },
  {
    "title": "Trump Suggests Many Americans 'Like A Dictator'",
    "description": "US President Donald Trump on Monday suggested many Americans would like a dictator as he signed orders to tighten his federal clampdown on the capital Washington and to prosecute flag-burners.",
    "link": "https://www.ibtimes.com/trump-suggests-many-americans-like-dictator-3781642",
    "timestamp": "2025-08-25T21:18:13Z"
  },
  {
    "title": "Russia Will Ramp Up Hybrid Warfare if Ukraine Fighting Ends",
    "description": "European states would be primary targets for Moscow.",
    "link": "http://foreignpolicy.com/2025/08/25/ukraine-russia-hybrid-warfare-trump-peace/",
    "timestamp": "2025-08-25T21:15:53Z"
  },
  {
    "title": "Trump says US will accept 600,000 Chinese students as part of trade deal (Naomi Lim/Washington Examiner)",
    "description": "Naomi Lim / Washington Examiner:\nTrump says US will accept 600,000 Chinese students as part of trade deal  —  President Donald Trump announced the United States is prepared to accept up to 600,000 Chinese students as part of a trade deal his administration is…",
    "link": "https://www.memeorandum.com/250825/p114",
    "timestamp": "2025-08-25T21:15:01Z"
  },
  {
    "title": "Can Donald Trump's National Guard Deployments Be Stopped?",
    "description": "Legal analysts weighed in on Trump's threats to send National Guard troops into Chicago.",
    "link": "https://www.newsweek.com/can-donald-trump-national-guard-deployment-stopped-2118990",
    "timestamp": "2025-08-25T21:14:22Z"
  },
  {
    "title": "Donald Trump says he wants to meet with Kim Jong Un again",
    "description": "Donald Trump says he'd like to meet Kim Jong Un this year, after South Korea's president asks for help securing peace with the nuclear-armed North.",
    "link": "https://www.abc.net.au/news/2025-08-26/donald-trump-lee-jae-myung-white-house-meeting-kim-jong-un/105696960",
    "timestamp": "2025-08-25T21:13:46Z"
  },
  {
    "title": "Mexican drug lord faces life in prison after pleading guilty in US court",
    "description": "The Trump administration’s top justice official Pam Bondi hailed a “landmark victory” Monday as Sinaloa drug cartel cofounder Ismael “El Mayo” Zambada changed his plea to guilty, meaning he faces life imprisonment and losing $15 billion. Zambada, 77, cofounde…",
    "link": "https://www.digitaljournal.com/world/mexican-drug-lord-faces-life-in-prison-after-pleading-guilty-in-us-court/article",
    "timestamp": "2025-08-25T21:12:20Z"
  },
  {
    "title": "Mexican Drug Lord Faces Life In Prison After Pleading Guilty In US Court",
    "description": "The Trump administration's top justice official Pam Bondi hailed a \"landmark victory\" Monday as Sinaloa drug cartel cofounder Ismael \"El Mayo\" Zambada changed his plea to guilty, meaning he faces life imprisonment and losing $15 billion.",
    "link": "https://www.ibtimes.com/mexican-drug-lord-faces-life-prison-after-pleading-guilty-us-court-3781639",
    "timestamp": "2025-08-25T21:12:16Z"
  },
  {
    "title": "France Summons US Envoy Over Antisemitism Allegations",
    "description": "Charles Kushner, the US ambassador to France, sent his deputy to receive a dressing-down after he sparked the French government’s ire with an editorial that accused President Emmanuel Macron of not doing enough to fight antisemitism.",
    "link": "https://financialpost.com/pmn/business-pmn/france-summons-us-envoy-over-antisemitism-allegations",
    "timestamp": "2025-08-25T21:11:40Z"
  },
  {
    "title": "“Chasing relevance”: Maron sounds off on “desperate” Maher",
    "description": "The trailblazing comedian and podcaster said that Maher is \"struggling to stay in the conversation.\"",
    "link": "https://www.salon.com/2025/08/25/chasing-relevance-maron-sounds-off-on-desperate-maher/",
    "timestamp": "2025-08-25T21:11:23Z"
  },
  {
    "title": "France summons US ambassador over letter about antisemitism",
    "description": "France's foreign ministry officials met on Aug. 25 with a representative of U.S. ambassador Charles Kushner after the American diplomat was summoned over his letter to French President Emmanuel Macron alleging the country did not do enough to combat antisemit…",
    "link": "https://www.hurriyetdailynews.com/france-summons-us-ambassador-kushner-over-letter-about-antisemitism-212892",
    "timestamp": "2025-08-25T21:11:00Z"
  },
  {
    "title": "Trump allies get a stark threat from Dem gov: ‘Justice will find you’",
    "description": "Illinois Gov. J.B. Pritzker (D) issued a stark warning to those who are aiding President Donald Trump in the weaponization of the U.S. government against his perceived foes and states that didn't support him in the 2024 election. Speaking at a news conference…",
    "link": "https://www.rawstory.com/pritzker-trump/",
    "timestamp": "2025-08-25T21:10:46Z"
  },
  {
    "title": "Trump says he holds 'incredible cards' that could 'destroy China' but won't play them yet (Amanda Macias/Fox News)",
    "description": "Amanda Macias / Fox News:\nTrump says he holds ‘incredible cards’ that could ‘destroy China’ but won't play them yet  —  Trump said he spoke to Chinese President Xi Jinping recently and added that he was considering a trip to Beijing  —  President Donald Trump…",
    "link": "https://www.memeorandum.com/250825/p113",
    "timestamp": "2025-08-25T21:10:07Z"
  },
  {
    "title": "Congressman Seeks Murder Charges for Fentanyl Traffickers",
    "description": "THE CENTER SQUARE—Fentanyl dealers would face tough new criminal penalties under a proposal filed by a Republican New York congressman that calls for charging those... Read More\nThe post Congressman Seeks Murder Charges for Fentanyl Traffickers appeared first…",
    "link": "https://www.dailysignal.com/2025/08/25/congressman-seeks-murder-charges-fentanyl-traffickers/",
    "timestamp": "2025-08-25T21:07:41Z"
  },
  {
    "title": "One Of ‘The View’s First Guests Back From Summer Break Will Be Must-Watch TV",
    "description": "Supreme Court Associate Justice Sonia Sotomayor will be one of the first guest to appear on \"The View\" when the program returns from their hiatus in September.",
    "link": "https://dailycaller.com/2025/08/25/the-view-sonia-sotomayor/",
    "timestamp": "2025-08-25T21:07:24Z"
  },
  {
    "title": "STEPHEN MOORE: Europe Is Dying – Are We Next?",
    "description": "Many countries are literally running out of people. This alarming chart is a terrifying glimpse into the future of a new dark age of the western world.",
    "link": "https://dailycaller.com/2025/08/25/opinion-europe-is-dying-are-we-next-stephen-moore/",
    "timestamp": "2025-08-25T21:06:20Z"
  },
  {
    "title": "Analyst revises American Eagle Outfitters stock price target ahead of earnings",
    "description": "Well, that didn't last long.\nEarlier this month, shares of American Eagle Outfitters (AEO) soared after President Donald Trump stepped into the controversy involving Sydney Sweeney's ad campaign for the apparel and accessories retailer.\nDon't miss the mov…",
    "link": "https://biztoc.com/x/625d2a95bbac00d4",
    "timestamp": "2025-08-25T21:05:03Z"
  },
  {
    "title": "Trump Says Putin’s Dislike of Zelenskiy Holding Up Meeting",
    "description": "US President Donald Trump said he spoke to Vladimir Putin in recent days and that he believed the Russian president’s dislike of Ukraine’s Volodymyr Zelenskiy is holding up a meeting between the two leaders.\n“He doesn’t like him,” Trump told reporters Monday …",
    "link": "https://biztoc.com/x/4d01c5da9623a875",
    "timestamp": "2025-08-25T21:05:02Z"
  },
  {
    "title": "Maryland Governor Fires Back After Trump Claims He Called Him ‘The Greatest President’",
    "description": "Democrat Wes Moore took to social media to put the record straight.",
    "link": "https://www.huffpost.com/entry/trump-wes-moore-army-navy-conversation_n_68aca29ae4b0495eaddfe121",
    "timestamp": "2025-08-25T21:05:00Z"
  },
  {
    "title": "Stephen Miller Makes Unhinged Claims That DC Residents Are ‘Wearing Their Watches Again’ Because of Trump",
    "description": "White House deputy chief of staff Stephen Miller made a series of outlandish claims Monday during an Oval Office presser discussing President Donald Trump's recent initiatives intended to crack down on crime in Washington, D.C.\nThe post Stephen Miller Makes U…",
    "link": "https://www.mediaite.com/crime/stephen-miller-makes-unhinged-claims-that-dc-residents-are-wearing-their-watches-again-because-of-trump/",
    "timestamp": "2025-08-25T21:03:18Z"
  },
  {
    "title": "'How will I pay workers?': Indian factories hit hard by Trump's 50% tariffs",
    "description": "BBC correspondents visit export hubs across India to assess how steep US tariffs are impacting business owners.",
    "link": "https://www.bbc.com/news/articles/c98lr56mznjo",
    "timestamp": "2025-08-25T21:03:03Z"
  },
  {
    "title": "Trump Finally Admits the Truth About His Takeover of Blue Cities",
    "description": "President Donald Trump is so obsessed with punishing Democrats that he’s pretending red states don’t have a crime problem.While speaking to reporters Monday, the president balked when asked whether he would consider sending National Guard troops to Republican…",
    "link": "https://newrepublic.com/post/199557/trump-federal-takeover-crime-violence-blue-cities-chicago",
    "timestamp": "2025-08-25T21:01:39Z"
  },
  {
    "title": "How Trump is elevating potential 2028 Democrats: From the Politics Desk",
    "description": "From the mobilization of federal troops to the nationwide redistricting battle, some of Trump’s recent actions are inadvertently providing Democratic presidential hopefuls a prime platform to confront him head-on.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-elevating-potential-2028-democrats-politics-desk-rcna227066",
    "timestamp": "2025-08-25T21:00:00Z"
  },
  {
    "title": "Every Known US President Confirmed to Exist in the MCU (Including the Red Hulk)",
    "description": "Throughout the entire history of the Marvel Cinematic Universe, there have been 23 confirmed Presidents of the United States. Many of these have been based on real-world versions of POTUS, including the very first United States president, George Washington, t…",
    "link": "http://comicbook.com/movies/news/mcu-known-united-states-presidents-red-hulk-thaddeus-ross-ritson-ellis/",
    "timestamp": "2025-08-25T21:00:00Z"
  },
  {
    "title": "India Tilts Toward BRICS as Pakistan Stays Close to Washington",
    "description": "U.S. President Donald Trump is taking India to task, and we are a long way from what then-President Barack Obama called a \"defining partnership of the 21st century.\" But India’s neighbor, and enemy, and America’s frenemy, escaped Trump’s ire. Why? Despite a s…",
    "link": "https://oilprice.com/Geopolitics/Asia/India-Tilts-Toward-BRICS-as-Pakistan-Stays-Close-to-Washington.html",
    "timestamp": "2025-08-25T21:00:00Z"
  },
  {
    "title": "Marc Maron Takes Aim at Netflix, Bill Maher, Dave Chappelle: ‘Fascism Is Good for Business’",
    "description": "On Pod Save America, Maron explains why he severed ties with Bill Maher and finds the consistent platforming of controversial comedians on platforms like Netflix to be considerably dangerous",
    "link": "http://www.rollingstone.com/culture/culture-news/marc-maron-criticizes-netflix-bill-maher-fascism-1235415178/",
    "timestamp": "2025-08-25T20:59:21Z"
  },
  {
    "title": "Trump Seen With Bruised Right Hand Again—Here’s Everything We Know About The Condition",
    "description": "The White House has blamed Trump’s bruised hands on handshaking and an aspirin regimen.",
    "link": "https://www.forbes.com/sites/saradorn/2025/08/25/trump-seen-with-bruised-right-hand-again-heres-everything-we-know-about-the-condition/",
    "timestamp": "2025-08-25T20:57:55Z"
  },
  {
    "title": "Trump administration plans to cancel approval of Maryland offshore wind project",
    "description": "In the filing, attorneys from the Department of Justice asked the court to stay a lawsuit challenging the Interior Department's approval of the Maryland...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-plans-cancel-approval-205655425.html",
    "timestamp": "2025-08-25T20:56:55Z"
  },
  {
    "title": "Gov attacks Trump's 'slipping mental faculties' and slams Chicago invasion: 'Do not come'",
    "description": "Gov. J.B. Pritzker (D-IL) spoke at a news conference on Monday afternoon, telling President Donald Trump not to come to his state and calling him out on using soldiers as political props without even having the courtesy of contacting his office ahead of time …",
    "link": "https://www.rawstory.com/trump-chicago/",
    "timestamp": "2025-08-25T20:56:18Z"
  },
  {
    "title": "Market Rally Stalls, Trump Says Intel Deal to Yield $11B | Bloomberg Businessweek Daily 8/25/2025",
    "description": "On today's episode of Bloomberg Businessweek Daily, Tim Stenovec and Norah Mulinda discuss President Donald Trump stating ...",
    "link": "https://biztoc.com/x/ca7f8ce96e5f9b41",
    "timestamp": "2025-08-25T20:55:49Z"
  },
  {
    "title": "Egypt Has Leverage Against Israel. Why Doesn’t Sisi Use It?",
    "description": "Rhetorical solidarity isn’t enough. Egypt can use its leverage to help stop Israel’s genocide in Gaza.",
    "link": "https://truthout.org/articles/egypt-has-leverage-against-israel-why-doesnt-sisi-use-it/",
    "timestamp": "2025-08-25T20:55:31Z"
  },
  {
    "title": "House committee widens Jeffrey Epstein probe with estate subpoena",
    "description": "The House Oversight Committee revealed multiple steps Monday to widen its probe into Jeffrey Epstein's case.",
    "link": "https://www.foxnews.com/politics/epstein-estate-hit-new-house-subpoena-client-list-call-logs",
    "timestamp": "2025-08-25T20:54:36Z"
  },
  {
    "title": "JB Pritzker Reacts to Donald Trump's 'Slob' Remark",
    "description": "Gov. Pritzker spoke at a press conference in response to Trump saying that Chicago will likely be the next target of his efforts.",
    "link": "https://biztoc.com/x/29921eabaeb37214",
    "timestamp": "2025-08-25T20:53:59Z"
  },
  {
    "title": "'We are watching and taking names': Illinois Gov. JB Pritzker responds to Trump's threats to Chicago",
    "description": "Illinois Governor JB Pritzker holds press conference in response to recent threats made by President Donald Trump to send the national guard to Chicago, in a similar manner that he has done so in Los Angeles and Washington D.C.",
    "link": "https://biztoc.com/x/6c0219adf32415e1",
    "timestamp": "2025-08-25T20:53:23Z"
  },
  {
    "title": "JB Pritzker Reacts to Donald Trump's 'Slob' Remark",
    "description": "Gov. Pritzker spoke at a press conference in response to Trump saying that Chicago will likely be the next target of his efforts.",
    "link": "https://www.newsweek.com/pritzker-responds-trump-slob-weight-remarks-chicago-2119024",
    "timestamp": "2025-08-25T20:47:44Z"
  },
  {
    "title": "RFK Jr.'s MAHA Strategy Blasted by Farm Group That Endorsed Him",
    "description": "\"Between April and August, the White House met with powerful lobbyists--and the influence shows,\" Angela Huffman, president of Farm Action, said last week.",
    "link": "https://www.newsweek.com/rfk-farming-agriculture-maha-food-usda-2118957",
    "timestamp": "2025-08-25T20:46:59Z"
  },
  {
    "title": "Trump Pulls From Dictator Playbook and Hangs Giant Banner of His Face",
    "description": "On the same day that Donald Trump said many Americans yearn for a dictatorship, his administration took a page from the book of dictators everywhere and unfurled a giant banner of the president’s face on the facade of the Department of Labor.The banner, which…",
    "link": "https://newrepublic.com/post/199561/trump-dictator-banner-face-labor-department",
    "timestamp": "2025-08-25T20:46:24Z"
  },
  {
    "title": "Trump Says China Convinced the World ‘Let’s All Do Magnets’",
    "description": "The president threatened a 200% tariff on China as he rambled incoherently Monday.",
    "link": "https://gizmodo.com/trump-says-china-convinced-the-world-lets-all-do-magnets-2000647747",
    "timestamp": "2025-08-25T20:45:44Z"
  }
]