[
  {
    "title": "US health system heading to ‘very dangerous place’ under vaccine sceptics",
    "description": "America’s public health system is heading to a “very dangerous place” with Health Secretary Robert F Kennedy Jr and his team of anti-vaccine advisers in charge, fired Centres for Disease Control and Prevention chief Susan Monarez has warned senators.",
    "link": "https://www.independent.ie/world-news/us-health-system-heading-to-very-dangerous-place-under-vaccine-sceptics/a1674608220.html",
    "timestamp": "2025-09-17T17:57:04Z"
  },
  {
    "title": "Ambassador Huckabee receives honorary Samaria citizenship",
    "description": "US Ambassador honored by Samaria Regional Council as Dagan highlights strategic and biblical importance of Judea and Samaria.",
    "link": "https://www.israelnationalnews.com/news/415109",
    "timestamp": "2025-09-17T17:55:40Z"
  },
  {
    "title": "American Cocaine Cheap And Pure As Ever Thanks To New Mexican Drug Lord",
    "description": "Cocaine in the U.S. market is now more affordable than ever while still maintaining high purity levels, The Wall Street Journal (WSJ) reported Tuesday.",
    "link": "https://dailycaller.com/2025/09/17/american-cocaine-cheap-pure-mexico-drug-cartels-nemesio-oseguera-cervantes/",
    "timestamp": "2025-09-17T17:54:34Z"
  },
  {
    "title": "StubHub Cofounder Nears Billionaire Status As Company IPOs Wednesday",
    "description": "After being fired from StubHub, Eric Baker bought it back at the worst possible time–February 2020. After three failed attempts to go public, he has finally has his shot.",
    "link": "https://www.forbes.com/sites/aliciapark/2025/09/17/stubhub-cofounder-eric-baker-nears-billionaire-status-as-company-ipos-wednesday/",
    "timestamp": "2025-09-17T17:53:30Z"
  },
  {
    "title": "TikTok To Be Sold To Trump’s Right Wing Billionaire Buddies And Converted Into A Propaganda Mill",
    "description": "Donald Trump has successfully used xenophobia and fake concerns about propaganda and national security to get what hes long wanted: TikTok (and its fat ad revenues) are poised to be sold off to his right wing billionaire buddies and, inevitably, slowly conver…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179326580",
    "timestamp": "2025-09-17T17:52:15Z"
  },
  {
    "title": "UCLA Places Race and Equity Director Who Celebrated Charlie Kirk Assassination on Leave",
    "description": "PICS OF TWEETS AT LINK............... Johnathan Perkins, formerly of Harvard, has also asserted Jews 'enjoy the benefits of whiteness' Johnathan Perkins (equity.ucla.edu) Collin Anderson September 15, 2025 The University of California, Los Angeles has placed …",
    "link": "https://freerepublic.com/focus/f-bloggers/4341086/posts",
    "timestamp": "2025-09-17T17:50:34Z"
  },
  {
    "title": "TikTok To Be Sold To Trump’s Right Wing Billionaire Buddies And Converted Into A Propaganda Mill",
    "description": "Donald Trump has successfully used xenophobia and fake concerns about propaganda and national security to get what he’s long wanted: TikTok (and its fat ad revenues) are poised to be sold off to his right wing billionaire buddies and, inevitably, slowly conve…",
    "link": "https://www.techdirt.com/2025/09/17/tiktok-to-be-sold-to-trumps-right-wing-billionaire-buddies-and-converted-into-a-propaganda-mill/",
    "timestamp": "2025-09-17T17:50:26Z"
  },
  {
    "title": "Donald Trump was never informant for FBI in Epstein case, says Kash Patel",
    "description": "Republican House Speaker Mike Johnson had last month claimed that Trump was an FBI informant against Epstein.",
    "link": "https://indianexpress.com/article/world/donald-trump-was-never-informant-for-fbi-in-epstein-case-says-kash-patel-10256184/",
    "timestamp": "2025-09-17T17:50:21Z"
  },
  {
    "title": "Vaccines Are at Risk, Fired CDC Director Warns Senators",
    "description": "Former CDC chief Susan Monarez testified that Secretary of Health and Human Services Robert F. Kennedy, Jr., had demanded she rubber-stamp recommendations from his remade vaccine panel",
    "link": "https://www.scientificamerican.com/article/vaccines-are-at-risk-fired-cdc-director-warns-senators/",
    "timestamp": "2025-09-17T17:50:00Z"
  },
  {
    "title": "How Zoom’s CMO Plans To Reposition The Brand",
    "description": "Also in the Forbes CMO newsletter: A TikTok deal takes shape, Kirk assassination draws viewers to conservative channels, AI may drive holiday spending increases.",
    "link": "https://www.forbes.com/sites/cmo/2025/09/17/how-zooms-cmo-plans-to-reposition-the-brand/",
    "timestamp": "2025-09-17T17:48:29Z"
  },
  {
    "title": "Donald Trump, J.D. Vance Will Speak at Charlie Kirk Memorial",
    "description": "President Donald Trump and J.D. Vance are slated to deliver speeches at Sunday's Turning Point USA memorial for Charlie Kirk, along with other notable names from the administration. Charlie's widow Erika is also set to speak at the Arizona…\n Permalink",
    "link": "https://www.tmz.com/2025/09/17/donald-trump-jd-vance-speak-charlie-kirk-memorial/",
    "timestamp": "2025-09-17T17:48:18Z"
  },
  {
    "title": "Few Mass Shooters Have Been Transgender",
    "description": "Q: Have many of the mass shooters been transgender?\nA: The number of transgender mass shooters in the U.S. varies depending on how “mass shooting” is defined, but is relatively small. The Gun Violence Archive, which uses a broader definition, lists five mass …",
    "link": "https://www.factcheck.org/2025/09/few-mass-shooters-have-been-transgender/",
    "timestamp": "2025-09-17T17:46:58Z"
  },
  {
    "title": "Todd Chrisley Gives Update on Chase Chrisley After Rehab Reveal",
    "description": "Todd Chrisley is reflecting on son Chase Chrisley receiving treatment. “I’m not going to ever walk away from one of my kids. I’m not going to walk away from Chase when he’s down, when he’s having an issue,” Todd, 56, told wife Julie Chrisley on the Wednesday,…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-chrisley-gives-update-on-chase-chrisley-after-rehab-reveal/#article",
    "timestamp": "2025-09-17T17:45:38Z"
  },
  {
    "title": "Eric Trump’s “second son” remark about Charlie Kirk was the easiest layup for jokes",
    "description": "Eric Trump tried to honor Charlie Kirk on Fox & Friends on Tuesday, but instead became the punchline. While discussing the slain Turning Point USA founder, Eric said Kirk had been like a “second son” to his father, President Donald Trump. \n\n\nThat slip played …",
    "link": "https://www.dailydot.com/viral-politics/eric-trump-second-son-charlie-kirk/",
    "timestamp": "2025-09-17T17:45:28Z"
  },
  {
    "title": "House GOP Races to Cool Dissent as Trump Tariff Anxiety Surfaces (Alicia Diaz/Bloomberg)",
    "description": "Alicia Diaz / Bloomberg:\nHouse GOP Races to Cool Dissent as Trump Tariff Anxiety Surfaces  —  Anxiety within the Republican ranks over Donald Trump's trade policies bubbled to the surface on the House floor this week when a small group of lawmakers pushed bac…",
    "link": "https://www.memeorandum.com/250917/p73",
    "timestamp": "2025-09-17T17:45:02Z"
  },
  {
    "title": "Major Health Concerns for 'Deteriorating' Donald Trump as Top Expert Suggests He Could Have Suffered 'Mini Strokes'",
    "description": "Donald Trump may not be the best example of perfect health, at least according to one doctor who thinks the president may be struggling.",
    "link": "https://radaronline.com/p/health-concerns-for-trump-suffered-mini-strokes/",
    "timestamp": "2025-09-17T17:45:00Z"
  },
  {
    "title": "‘South Park’ Pushes New Episode as Trey Parker and Matt Stone Admit: ‘We Didn’t Get It Done in Time’",
    "description": "A new episode of 'South Park' planned for Sept. 17 was pushed a week after Trey Parker and Matt Stone said they failed to finish it in time.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/south-park-delays-new-episode-1235429643/",
    "timestamp": "2025-09-17T17:43:03Z"
  },
  {
    "title": "South Park Delays New Episode, Creators Reveal Why in Statement",
    "description": "South Park‘s latest episode will not air this week, with series creator’s Trey Parker and Matt Stone officially announcing the episode will be delayed. Why is the new South Park episode delayed? In a statement from Parker and Stone (via Variety), the duo said…",
    "link": "https://www.superherohype.com/tv/628246-south-park-season-27-episode-5-release-date-delayed-new-airing-set",
    "timestamp": "2025-09-17T17:41:32Z"
  },
  {
    "title": "Obama says US faces 'political crisis' after killing of Charlie Kirk",
    "description": "The former president criticised the response to the shooting by President Trump, who has vowed to tackle \"radical leftists\".",
    "link": "https://www.bbc.com/news/articles/c9dxge2ep4xo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-17T17:40:54Z"
  },
  {
    "title": "Trump cheers court ruling, calls prosecutor “a disaster” and demands her prosecution",
    "description": "Departing for a state visit to the U.K., President Donald Trump launched a blistering attack on Georgia prosecutor Fani Willis after the state Supreme Court declined to hear her final appeal in the racketeering probe tied to his 2020 election fight. Trump hai…",
    "link": "https://www.rawstory.com/trump-2674003703/",
    "timestamp": "2025-09-17T17:38:56Z"
  },
  {
    "title": "ICYMI: Mortgage Rates Fall to Three-Year Low",
    "description": "Mortgage rates have fallen to their lowest levels in three years, making the third straight week of declines as President Donald J. Trump continues to make good on his promise to lower costs for the American people.\nFrom CNBC:\n“Mortgage rates dropped sharply …",
    "link": "https://biztoc.com/x/f44c6f17c03ff0c6",
    "timestamp": "2025-09-17T17:37:11Z"
  },
  {
    "title": "Trump said to have urged EU to use Russian frozen assets",
    "description": "United States President Donald Trump called on the European Union to tap into Russia's assets held in Belgium, The Wall Street Journal reported on Wednesday, citing diplomats.Meanwhile, the diplomats ...",
    "link": "https://biztoc.com/x/97c7809f362dae07",
    "timestamp": "2025-09-17T17:37:08Z"
  },
  {
    "title": "Kash Patel Melts Down In Congressional Hearing When Asked About Trump’s Name Being In the Epstein Files",
    "description": "“Director. Remembering your oath to tell the truth, did you ever tell Donald Trump his name is in the files?” Swalwell asked Patel\nThe post Kash Patel Melts Down In Congressional Hearing When Asked About Trump’s Name Being In the Epstein Files first appeared …",
    "link": "https://www.mediaite.com/politics/kash-patel-melts-down-in-congressional-hearing-when-asked-about-trumps-name-being-in-the-epstein-files/",
    "timestamp": "2025-09-17T17:36:57Z"
  },
  {
    "title": "Former CDC head says she was fired for refusing Kennedy's vaccine changes",
    "description": "Susan Monarez testified she had refused RFK Jr's demands to approve vaccine recommendations because they were not based on science.",
    "link": "https://www.bbc.com/news/articles/cn76dz1zxz3o",
    "timestamp": "2025-09-17T17:33:55Z"
  },
  {
    "title": "Brazil’s Bolsonaro discharged from hospital",
    "description": "His release comes a day after the convicted ex-leader was rushed to a hospital after falling ill at home.",
    "link": "https://www.aljazeera.com/news/2025/9/17/brazils-bolsonaro-discharged-from-hospital",
    "timestamp": "2025-09-17T17:33:17Z"
  },
  {
    "title": "House panel seeks Epstein documents from four banks in possible subpoena",
    "description": "Rep. Jamie Raskin (D-MD) moved to subpoena four global banking giants to investigate their dealings with convicted sex offender Jeffrey Epstein.The House Judiciary Committee will vote on Raskin's motion at the end of its oversight hearing with FBI Director Ka…",
    "link": "https://www.rawstory.com/epstein-bank-records-stub/",
    "timestamp": "2025-09-17T17:32:39Z"
  },
  {
    "title": "Fired CDC director warns of backslide in US vaccine science under RFK Jr",
    "description": "Ex-CDC Director Monarez says she was fired for refusing to approve vaccine policy changes without scientific review.",
    "link": "https://www.aljazeera.com/news/2025/9/17/fired-cdc-director-warns-of-backslide-in-us-vaccine-science-under-rfk-jr",
    "timestamp": "2025-09-17T17:32:10Z"
  },
  {
    "title": "Former CDC officials say Kennedy Jr. has made children less safe, politicized health",
    "description": "The former director who led the Centers for Disease Control and Prevention for just 29 days this summer, and a high-placed deputy, each said Thursday they are concerned preventable diseases for children will needlessly return under what they characterized as …",
    "link": "https://www.cbc.ca/news/world/monarez-cdc-testimony-kennedy-1.7635895",
    "timestamp": "2025-09-17T17:31:55Z"
  },
  {
    "title": "Putin flies in for final shots of Zapad 25, but where’s Gerasimov? | Ukraine: The Latest",
    "description": "Day 1302. Today, Donald Trump arrives in Britain for his second state visit, possibly bringing a gift to Ukraine. Putin watches the ...",
    "link": "https://biztoc.com/x/114486ec065b12cc",
    "timestamp": "2025-09-17T17:31:13Z"
  },
  {
    "title": "Manifestazione contro Donald Trump a Londra",
    "description": "epa12385191 A protester holds up a 'Baby Trump' knitted toy during a 'Stop Trump Coalition' mass demonstration against the state visit to the UK by US President Donald J Trump in London, Britain, 17 September 2025. (ANSA)",
    "link": "https://www.ansa.it/sito/photogallery/primopiano/2025/09/17/manifestazione-contro-donald-trump-a-londra_3e217ae2-ae8f-4950-a5a6-2844a8287766.html",
    "timestamp": "2025-09-17T17:31:05Z"
  },
  {
    "title": "Trump’s second state visit to the UK meets with protests and arrests By BRIAN MELLEY Associated Press",
    "description": "Thousands of people marched through London on Wednesday to protest his trip, which includes a lavish banquet hosted by King Charles III in his honor.",
    "link": "https://www.pbs.org/newshour/politics/trumps-second-state-visit-to-the-uk-meets-with-protests-and-arrests-by-brian-melley-associated-press",
    "timestamp": "2025-09-17T17:30:54Z"
  },
  {
    "title": "Kash Patel Refuses to Recuse Himself From Investigating Anyone on His ‘Enemies List’",
    "description": "Kash Patel refused to recuse himself from any investigation involving people he identified as part of the \"deep state\" in a fiery exchange with Eric Swalwell.\nThe post Kash Patel Refuses to Recuse Himself From Investigating Anyone on His ‘Enemies List’ first …",
    "link": "https://www.mediaite.com/media/tv/kash-patel-refuses-to-recuse-himself-from-investigating-anyone-on-his-enemies-list/",
    "timestamp": "2025-09-17T17:30:43Z"
  },
  {
    "title": "Ben & Jerry's co-founder quits over social activism row",
    "description": "His resignation marks the latest development in a dispute with parent company Unilever.",
    "link": "https://www.bbc.com/news/articles/c4g58xx1eero?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-17T17:30:01Z"
  },
  {
    "title": "The Biggest Threat to the Dollar Is Coming From Inside the White House",
    "description": "The dollar isn’t getting dethroned—yet—by outside rivals, but Trump may be doing their work for them.",
    "link": "http://foreignpolicy.com/2025/09/17/fed-rate-cut-powell-trump-dollar-dominance/",
    "timestamp": "2025-09-17T17:28:18Z"
  },
  {
    "title": "‘Silenced’: Ben and Jerry’s co-founder quits because he can’t have his cash and bash Trump like he wants",
    "description": "Complains corporate owners don't let him criticize White House over his leftist ideologies",
    "link": "https://www.wnd.com/2025/09/silenced-ben-jerrys-co-founder-quits-because-he/",
    "timestamp": "2025-09-17T17:28:01Z"
  },
  {
    "title": "Trump’s U.K. State Visit: All the Pomp, Protests, and Royal Drama",
    "description": "Trump’s U.K. visit: all the pomp, protests, and royal drama. Protesters greeted the president and First Lady Melania Trump by projecting Jeffrey Epstein photos on Windsor Castle. On the bright side for Trump, he got a carriage ride with King Charles.",
    "link": "http://nymag.com/intelligencer/article/trumps-uk-visit-2025-protests-royal-drama.html",
    "timestamp": "2025-09-17T17:28:00Z"
  },
  {
    "title": "Colombia Vows To Fight Drug Trade 'With Or Without' The US",
    "description": "Colombia's top military officer has told AFP that his country will fight the resurgent cocaine trade with or without American help, after Washington blacklisted Bogota for what it called flawed anti-drug efforts.",
    "link": "https://www.ibtimes.com/colombia-vows-fight-drug-trade-without-us-3783722",
    "timestamp": "2025-09-17T17:27:16Z"
  },
  {
    "title": "‘Morning Joe’ Urges Trump to Call for Unity After Charlie Kirk Assassination | Video",
    "description": "“Morning Joe” host Joe Scarborough on Wednesday tore into President Donald Trump’s verbal shrugs at the grip political violence has had on U.S. politics in recent years, urging Trump to emphasize unity over division in the wake of Charlie Kirk’s murder.",
    "link": "https://www.thewrap.com/morning-joe-scarborough-trump-unity-charlie-kirk-shooting/",
    "timestamp": "2025-09-17T17:27:09Z"
  },
  {
    "title": "EU membership a form of security guarantee, Parliament chief tells Zelenskyy",
    "description": "Europe is stepping up efforts to boost defense spending.",
    "link": "https://www.politico.eu/article/eu-membership-security-roberta-metsola-volodymyr-zelenskyy-war-in-ukraine/",
    "timestamp": "2025-09-17T17:24:47Z"
  },
  {
    "title": "Jan. 6 Cop Trashes Trump On MSNBC Over ‘Political Violence’ Amid Charlie Kirk Killing Aftermath",
    "description": "Michael Fanone tore into Trump for \"advocating political violence\" as Trump and others point fingers at \"the left\" in the aftermath of the Charlie Kirk killing.\nThe post Jan. 6 Cop Trashes Trump On MSNBC Over ‘Political Violence’ Amid Charlie Kirk Killing Aft…",
    "link": "https://www.mediaite.com/media/tv/jan-6-cop-trashes-trump-on-msnbc-over-political-violence-amid-charlie-kirk-killing-aftermath/",
    "timestamp": "2025-09-17T17:24:11Z"
  },
  {
    "title": "We Are In A CO2 Famine - CO2 Has Been Declining for 160 Million Years - Excellent Graph",
    "description": "The CO2 red line for plant death on Earth is around 150 ppm...During the last Glacial Maximum (20,000 years ago) CO2 was 180 ppm...The optimum CO2 level for plants is around 1,000 ppm...CO2 today is 422 ppm...",
    "link": "https://freerepublic.com/focus/f-news/4341074/posts",
    "timestamp": "2025-09-17T17:20:21Z"
  },
  {
    "title": "We Are In A CO2 Famine - CO2 Has Been Declining for 160 Million Years - Excellent Graph",
    "description": "The CO2 red line for plant death on Earth is around 150 ppm...During the last Glacial Maximum (20,000 years ago) CO2 was 180 ppm...The optimum CO2 level for plants is around 1,000 ppm...CO2 today is 422 ppm...",
    "link": "https://freerepublic.com/focus/f-chat/4341074/posts",
    "timestamp": "2025-09-17T17:20:21Z"
  },
  {
    "title": "Sen. Cassidy shoots down GOP colleague over her CDC conspiracy obsession",
    "description": "The chair of the Senate Health, Education, Labor, and Pensions (HELP) Committee pushed back at one of his GOP colleagues as she attempted to incorporate him into her conspiracy theory about the firing of the CDC’s Dr. Susan Monarez.Given time to question the …",
    "link": "https://www.rawstory.com/bill-cassidy-2674003576/",
    "timestamp": "2025-09-17T17:20:00Z"
  },
  {
    "title": "Top DOJ Official Says It's 'Up To The American People' To Decide If Ghislaine Maxwell Is Credible",
    "description": "The convicted sex trafficker praised Trump during a two-day interview with the Justice Department, according to a transcript.",
    "link": "https://www.huffpost.com/entry/todd-blanche-ghislaine-maxwell-credible_n_68cad54ae4b0cc3f54ab12d9",
    "timestamp": "2025-09-17T17:19:57Z"
  },
  {
    "title": "Army veteran who burned American flag near White House pleads not guilty to federal charges",
    "description": "Carey was arrested Aug. 25 after he set fire to a flag in Lafayette Park.",
    "link": "https://www.bostonherald.com/2025/09/17/army-veteran-flag-burning-plea/",
    "timestamp": "2025-09-17T17:17:42Z"
  },
  {
    "title": "Inside Trump's pomp-filled royal visit to Windsor | The Daily T",
    "description": "Donald Trump has spent the day at Windsor Castle as he undertakes the first day of his unprecedented second state visit to Britain ...",
    "link": "https://biztoc.com/x/d0fdc8cb92384c92",
    "timestamp": "2025-09-17T17:17:36Z"
  },
  {
    "title": "Eric Trump, American Bitcoin CEO on Crypto Demand and Mining",
    "description": "Eric Trump, co-founder of American Bitcoin and the son of US President Donald Trump, and Michael Ho, CEO of American Bitcoin, ...",
    "link": "https://biztoc.com/x/27f73b2e843aeea8",
    "timestamp": "2025-09-17T17:17:28Z"
  },
  {
    "title": "EU's new approach to lure India away from Russia's orbit",
    "description": "The EU has proposed better strategic ties with India to pull New Delhi closer to Europe and away from Russia. While a trade deal is currently in focus, the EU also looks to boost defense cooperation. The European Union (EU) proposed a new strategic agenda wit…",
    "link": "https://www.dw.com/en/eus-new-approach-to-lure-india-away-from-russias-orbit/a-74030565",
    "timestamp": "2025-09-17T17:17:00Z"
  },
  {
    "title": "EU's new approach to lure India away from the Russia's orbit",
    "description": "The EU has proposed better strategic ties with India to pull New Delhi closer to Europe and away from Russia. While a trade deal is currently in focus, the EU also looks to boost defense cooperation.",
    "link": "https://www.dw.com/en/eus-new-approach-to-lure-india-away-from-the-russias-orbit/a-74030565",
    "timestamp": "2025-09-17T17:17:00Z"
  },
  {
    "title": "EU's new strategy to lure India away from Russia's orbit",
    "description": "The EU has proposed better strategic ties with India to pull New Delhi closer to Europe and away from Russia. While a trade deal is currently in focus, the EU also looks to boost defense cooperation.",
    "link": "https://www.dw.com/en/eu-india-strategic-ties-trade-defense-trump-tariffs-russia-putin-graphics/a-74030565",
    "timestamp": "2025-09-17T17:17:00Z"
  },
  {
    "title": "EU's new strategy to lure India away from Russia's orbit",
    "description": "The EU has proposed better strategic ties with India to pull New Delhi closer to Europe and away from Russia. While a trade deal is currently in focus, the EU also looks to boost defense cooperation. The European Union (EU) proposed a new strategic agenda wit…",
    "link": "https://www.dw.com/en/eu-india-strategic-ties-trade-defense-trump-tariffs-russia-putin-graphics/a-74030565",
    "timestamp": "2025-09-17T17:17:00Z"
  },
  {
    "title": "Border Patrol Failed to Catch and Report Fake ID Documents: Inspectors",
    "description": "Agents often allowed immigrants with fraudulent documents into the U.S., the Office of the Inspector General found.",
    "link": "https://www.newsweek.com/border-patrol-immigrants-fake-documents-security-concerns-report-2131425",
    "timestamp": "2025-09-17T17:16:45Z"
  },
  {
    "title": "'You're the freaking FBI': Democrat slams Patel over why FBI doesn't have all Epstein docs",
    "description": "Rep. Ted Lieu (D-CA) hammered FBI Director Kash Patel when questioning him before the House Judiciary Committee on Wednesday. Lieu asked simply whether he had seen all of the images included in the investigation files around accused child trafficker Jeffrey E…",
    "link": "https://www.rawstory.com/ted-lieu-2674003316/",
    "timestamp": "2025-09-17T17:16:08Z"
  },
  {
    "title": "Thousands Protest In London Over Trump UK Visit",
    "description": "Armed with signs and shouting slogans, thousands of anti-Donald Trump protesters descended Wednesday on central London to decry the US president's unprecedented second state visit to the UK.\nLondon's Metropolitan Police estimated that there were around 5,000 …",
    "link": "https://www.ibtimes.com/thousands-protest-london-over-trump-uk-visit-3783720",
    "timestamp": "2025-09-17T17:15:15Z"
  },
  {
    "title": "Jared Kushner's Net Worth Surges as He Joins Exclusive Club With Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nJared Kushner, the son-in-law of President Donald Trump who served as a senior advisor in his first-term Cabinet, has recently joined the ranks of America's billionaire class, according to Forbes.\nThis week, t…",
    "link": "https://biztoc.com/x/8b61a14cf189df95",
    "timestamp": "2025-09-17T17:14:57Z"
  },
  {
    "title": "Pramila Jayapal Can’t Stop Screaming At Top Of Her Lungs At Kash Patel Over Epstein Answers",
    "description": "Democrat Washington Rep. Pramila Jayapal lost her temper on Wednesday while questioning FBI Director Kash Patel about meeting with victims of Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/09/17/pramila-jayapal-cant-stop-screaming-at-top-of-her-lungs-at-kash-patel-over-epstein-answers/",
    "timestamp": "2025-09-17T17:14:39Z"
  },
  {
    "title": "Jared Kushner's Net Worth Surges as He Joins Exclusive Club With Trump",
    "description": "Thanks to savvy investments and support from \"Middle Eastern backers,\" Forbes reports that President Trump's son-in-law has now become a billionaire.",
    "link": "https://www.newsweek.com/jared-kushner-joins-billionaire-club-donald-trump-2131421",
    "timestamp": "2025-09-17T17:13:42Z"
  },
  {
    "title": "Thousands protest in London over Trump UK visit",
    "description": "Armed with signs and shouting slogans, thousands of anti-Donald Trump protesters descended Wednesday on central London to decry the US president’s unprecedented second state visit to the UK. London’s Metropolitan Police estimated that there were around 5,000 …",
    "link": "https://www.digitaljournal.com/world/thousands-protest-in-london-over-trump-uk-visit/article",
    "timestamp": "2025-09-17T17:12:20Z"
  },
  {
    "title": "Fired US Health Agency Chief Testifies On Pressure To 'Replace Evidence With Ideology'",
    "description": "The ex-chief of the US disease prevention agency told senators Wednesday she was fired for refusing to approve changes to childhood vaccine schedules not backed by scientific evidence, as the Trump administration moves to dismantle longstanding healthy policy.",
    "link": "https://www.ibtimes.com/fired-us-health-agency-chief-testifies-pressure-replace-evidence-ideology-3783719",
    "timestamp": "2025-09-17T17:12:10Z"
  },
  {
    "title": "Trump’s Nemesis In 2020 Announces Campaign For Georgia Governor",
    "description": "Republican Georgia Secretary of State Brad Raffensperger announced a run for governor on Wednesday, setting up an internal party clash against a Trump-endorsed candidate in the contested primary. Raffensperger earned President Donald Trump’s ire following the…",
    "link": "https://dailycaller.com/2025/09/17/brad-raffensperger-georgia-governor-race/",
    "timestamp": "2025-09-17T17:11:38Z"
  },
  {
    "title": "New York’s Housing Crisis – A Nationwide Issue",
    "description": "Those of us fortunate enough to live anywhere but New York City may take comfort from reading the news about what is arguably NYC’s biggest campaign issue in 2025 -- the lack of affordable housing in the nation’s biggest city. “There but for the grace of God …",
    "link": "https://freerepublic.com/focus/f-news/4341071/posts",
    "timestamp": "2025-09-17T17:07:29Z"
  },
  {
    "title": "Trump, ICE target police in Chicago, other cities for recruitment in NFL ad",
    "description": "Nearly identical ads ran in other cities during the game, including Denver.",
    "link": "https://www.bostonherald.com/2025/09/17/trump-ice-police-chicago-recruitment-nfl-ad/",
    "timestamp": "2025-09-17T17:06:34Z"
  },
  {
    "title": "Trump, ICE target police in Chicago, other cities for recruitment in NFL ad",
    "description": "Nearly identical ads ran in other cities during the game, including Denver.",
    "link": "https://www.denverpost.com/2025/09/17/trump-ice-police-chicago-recruitment-nfl-ad/",
    "timestamp": "2025-09-17T17:06:34Z"
  },
  {
    "title": "Two Republican Trump Foes Announce They’re Running in 2026",
    "description": "The Georgia governor’s race just got interesting: Two Republican foes of Donald Trump, one of whom became a Democrat, are running next year.",
    "link": "http://nymag.com/intelligencer/article/two-republican-trump-foes-announce-theyre-running-in-2026.html",
    "timestamp": "2025-09-17T17:05:54Z"
  },
  {
    "title": "EU says India's Russia links jeopardise closer ties",
    "description": "BRUSSELS: The European Union’s top diplomat warned on Wednesday (Sep 17) that its push for closer ties with India could be hampered by New Delhi’s purchases of Russian oil and its involvement in mili",
    "link": "https://www.channelnewsasia.com/world/eu-says-indias-russia-links-jeopardise-closer-ties-5354736",
    "timestamp": "2025-09-17T17:05:08Z"
  },
  {
    "title": "Video of 'Religious' Student Painting Over Charlie Kirk Mural Goes Viral",
    "description": "The video had been viewed more than 5 million times on X.",
    "link": "https://www.newsweek.com/student-paining-charlie-kirk-mural-viral-2131417",
    "timestamp": "2025-09-17T17:05:00Z"
  },
  {
    "title": "The Army-Navy Game receives distinction from the National Football Foundation",
    "description": "The Army-Navy football game will be honored by the National Football Foundation at its annual awards dinner in December.",
    "link": "https://www.recordonline.com/story/sports/college/2025/09/17/national-organization-recognizes-army-navy-football-game/86202172007/",
    "timestamp": "2025-09-17T17:04:55Z"
  },
  {
    "title": "President ‘We Win, They Lose’ vs. President ‘Let’s Make a Deal’",
    "description": "On February 28, 2025, Donald Trump hosted Ukraine president Volodymyr Zelensky at the White House, where the following (abridged) exchange occurred (emphasis mine):Vice President JD Vance: The path to peace and the path to prosperity is, maybe, engaging in di…",
    "link": "https://freerepublic.com/focus/f-news/4341069/posts",
    "timestamp": "2025-09-17T17:04:05Z"
  },
  {
    "title": "The Data Driving Today’s Anticipated FOMC Interest Rate Cut",
    "description": "Could the last two years of Federal Reserve monetary policy have been built on a faulty foundation of data provided by the Bureau of Labor Statistics' NFP data?",
    "link": "https://www.forbes.com/sites/jeffgapusan/2025/09/17/the-data-driving-todays-anticipated-fomc-interest-rate-cut/",
    "timestamp": "2025-09-17T17:03:57Z"
  },
  {
    "title": "King Charles Accused of ‘Groveling’ Before Trump, as UK Protesters Focus on …",
    "description": "Reading Time: 3 minutesKing Charles is being criticized for rolling out the red carpet for Donald Trump.\nKing Charles Accused of ‘Groveling’ Before Trump, as UK Protesters Focus on … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/king-charles-accused-of-groveling-before-trump-as-uk-protesters-focus-on-epstein-issue/",
    "timestamp": "2025-09-17T17:03:49Z"
  },
  {
    "title": "The Economy Is Turning Into a Black Box",
    "description": "Sophisticated private sources could provide a fuller picture of the state of the economy. But the government is not even trying to use them.",
    "link": "https://www.theatlantic.com/economy/archive/2025/09/economic-data-crisis-bls/684238/",
    "timestamp": "2025-09-17T17:03:00Z"
  },
  {
    "title": "Healthy Returns: What to know about RFK Jr.'s five new vaccine panel members",
    "description": "Robert F. Kennedy Jr. added five new members to a key government vaccine panel, while health care inflation has taken a bigger bite out of wallets.",
    "link": "https://www.cnbc.com/2025/09/17/healthy-returns-rfk-jr-names-five-new-cdc-vaccine-committee-members.html",
    "timestamp": "2025-09-17T17:02:47Z"
  },
  {
    "title": "Poll Shows US Majority Wants Checks on Presidential Overreach",
    "description": "Amid US President Donald Trump's authoritarian policies and practices, Americans are increasingly worried that too much power is concentrated in the White House, polling published Wednesday revealed.YouGov surveyed 1,070 registered US voters on behalf of the …",
    "link": "https://www.commondreams.org/news/poll-shows-voters-want-checks-on-president",
    "timestamp": "2025-09-17T17:02:34Z"
  },
  {
    "title": "Trump ‘absolutely not’ implicated in Epstein sex trafficking investigation, says FBI Director Kash Patel",
    "description": "Patel faced the House Judiciary Committee on Wednesday, a day after the Senate Judiciary Committee hearing, which turned into a shouting match between him and Democrat Senator Adam Schiff.",
    "link": "https://indianexpress.com/article/world/trump-not-implicated-in-epstein-investigation-fbi-director-kash-patel-10256053/",
    "timestamp": "2025-09-17T17:02:27Z"
  },
  {
    "title": "Coffee Drinkers In For A Jolt As Tariff Repercussions Begin To Affect Prices",
    "description": "Your morning cup of joe just got a lot more expensive. Retail coffee prices were up almost 21% in August from the year before, according to the Bureau of...",
    "link": "https://finance.yahoo.com/news/coffee-drinkers-jolt-tariff-repercussions-170109361.html",
    "timestamp": "2025-09-17T17:01:09Z"
  },
  {
    "title": "New York May Have Overpaid $2.7 Billion On Medicaid",
    "description": "The Centers for Medicare and Medicaid Services said in 2024 that Medicaid's improper payment rate was about 5.1 percent, KFF reported.",
    "link": "https://www.newsweek.com/new-york-may-have-overpaid-2-7-billion-medicaid-2131236",
    "timestamp": "2025-09-17T17:00:41Z"
  },
  {
    "title": "House Democrat Repeatedly Whiffs on Charlie Kirk’s Name While Scolding Kash Patel",
    "description": "Rep. Jerry Nadler repeatedly referred to slain conservative activist Charlie Kirk as \"Charlie King\" during a hearing with FBI Director Kash Patel on Wednesday\nThe post House Democrat Repeatedly Whiffs on Charlie Kirk’s Name While Scolding Kash Patel first app…",
    "link": "https://www.mediaite.com/media/house-democrat-repeatedly-whiffs-on-charlie-kirks-name-while-scolding-kash-patel/",
    "timestamp": "2025-09-17T17:00:18Z"
  },
  {
    "title": "Our Children’s Trust Launches a Youth Climate Lawsuit",
    "description": "This time aimed personally at President Trump",
    "link": "https://wattsupwiththat.com/2025/09/17/our-childrens-trust-launches-a-youth-climate-lawsuit/",
    "timestamp": "2025-09-17T17:00:00Z"
  },
  {
    "title": "How Sanctions and Politics Are Blocking Uzbekistan’s Path to the Sea",
    "description": "In its quest to gain access to the sea to facilitate exports, Uzbekistan is eyeing the Iranian port at Chabahar, situated in the Gulf of Oman. But even in the exploratory phase, Tashkent is encountering significant obstacles.   Facilitating Uzbek access to Ch…",
    "link": "https://oilprice.com/Geopolitics/Asia/How-Sanctions-and-Politics-Are-Blocking-Uzbekistans-Path-to-the-Sea.html",
    "timestamp": "2025-09-17T17:00:00Z"
  },
  {
    "title": "Trump Pays Respects to Queen Elizabeth with Private Wreath Laying at Her Tomb",
    "description": "President Donald Trump laid a wreath at Queen Elizabeth's tomb on Wednesday at St. George's Chapel in a private ceremony.\nThe post Trump Pays Respects to Queen Elizabeth with Private Wreath Laying at Her Tomb appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/17/trump-pays-respects-to-queen-elizabeth-with-private-wreath-laying-at-her-tomb/",
    "timestamp": "2025-09-17T16:58:34Z"
  },
  {
    "title": "Fashion Notes: Melania Trump Visits British Royals in Striking Dior Haute Couture Suit and Hat",
    "description": "First Lady Melania Trump stepped off Marine One on Wednesday to greet the Prince and Princess of Wales in Windsor, England, donning full haute couture fit only for the world's royalty.\nThe post Fashion Notes: Melania Trump Visits British Royals in Striking Di…",
    "link": "https://www.breitbart.com/entertainment/2025/09/17/fashion-notes-melania-trump-visits-british-royals-in-striking-dior-haute-couture-suit-and-hat/",
    "timestamp": "2025-09-17T16:57:54Z"
  },
  {
    "title": "The Trump Administration’s Latest Power Grab: Your Voter Data",
    "description": "As the Trump administration vows to undertake a sweeping crackdown on liberal organizations following last week’s murder of MAGA influencer Charlie Kirk, the Justice Department on Tuesday sued two blue states, Maine and Oregon, to attempt to gain access to th…",
    "link": "https://www.motherjones.com/politics/2025/09/the-trump-administrations-latest-power-grab-your-voter-data/",
    "timestamp": "2025-09-17T16:57:49Z"
  },
  {
    "title": "Slog AM: Suspect Is Charged in Charlie Kirk’s Murder, Trans Woman Attacked at Renton Transit Center, Ann Davison Is Still Obsessed with Graffiti",
    "description": "The Stranger's morning news roundup.\n \n by Megan Seling\n \n \n \n Good Morning: Yesterday's weird heat wave is over, and today’s high is a balmy 74 degrees. \nAlleged Charlie Kirk Shooter Charged: Yesterday, prosecutors charged 22-year-old Utah resident Tyler Rob…",
    "link": "https://www.thestranger.com/slog-am/2025/09/17/80245292/slog-am-suspect-is-charged-in-charlie-kirks-murder-trans-woman-attacked-at-renton-transit-center-ann-davison-is-still-obsessed-with-graffi",
    "timestamp": "2025-09-17T16:57:00Z"
  },
  {
    "title": "Inquiries About Starting Turning Point USA Chapters Surge in Wake of Kirk’s Slaying",
    "description": "The assassination last week of prominent conservative activist Charlie Kirk is mobilizing Republicans ahead of next year’s midterm elections. Following Kirk’s slaying last week, Kirk’s... Read More\nThe post Inquiries About Starting Turning Point USA Chapters …",
    "link": "https://www.dailysignal.com/2025/09/17/charlie-kirks-assassination-is-mobilizing-republicans/",
    "timestamp": "2025-09-17T16:56:29Z"
  },
  {
    "title": "Charlie Kirk called martyr at Winnipeg vigil for slain U.S. conservative activist",
    "description": "More than 1,000 people held candles and recited prayers as they gathered at the front steps of the Manitoba Legislative Building Tuesday evening to honour the life of Charlie Kirk, calling him a martyr.",
    "link": "https://www.cbc.ca/news/canada/manitoba/charlie-kirk-vigil-winnipeg-legislative-building-1.7635875",
    "timestamp": "2025-09-17T16:56:16Z"
  },
  {
    "title": "Tennis star Taylor Townsend apologizes for comments about Chinese food",
    "description": "American says there's 'no excuse' for her comments, promises to 'be better' after backlashAmerican tennis star Taylor Townsend has apologized \"from the bottom of my heart\" for making disparaging comments about Chinese food. \"I just truly wanted to apologize. …",
    "link": "https://freerepublic.com/focus/f-chat/4341067/posts",
    "timestamp": "2025-09-17T16:56:11Z"
  },
  {
    "title": "Foreign disinformation about Charlie Kirk's killing seeks to widen US divisions",
    "description": "Russia moved to amplify online conspiracy theories about Charlie Kirk's killing just hours after it happened, seeding social media with the frightening claim that America is slipping into civil war.",
    "link": "https://richmond.com/news/nation-world/article_7c12de83-2f25-5ba5-b0f7-e3b5c299b6e8.html",
    "timestamp": "2025-09-17T16:56:00Z"
  },
  {
    "title": "Foreign disinformation about Charlie Kirk's killing seeks to widen US divisions",
    "description": "Russia moved to amplify online conspiracy theories about Charlie Kirk's killing just hours after it happened, seeding social media with the frightening claim that America is slipping into civil war.",
    "link": "https://roanoke.com/news/nation-world/article_42d2b95a-c96c-5e80-9bbe-7611e36d4bd8.html",
    "timestamp": "2025-09-17T16:56:00Z"
  },
  {
    "title": "National Academy of Sciences rebuffs Trump EPA’s effort to undo regulations fighting climate change",
    "description": "The NAS is an independent nonprofit that seeks to advise policyholders on science.",
    "link": "https://www.bostonherald.com/2025/09/17/trump-epa-climate-nas/",
    "timestamp": "2025-09-17T16:54:13Z"
  },
  {
    "title": "Republican Brad Raffensperger to run for Georgia governor after defying Trump over 2020 election",
    "description": "Raffensperger is likely to aim his appeal at Republicans who have at times been lukewarm on Trump.",
    "link": "https://www.pbs.org/newshour/politics/republican-brad-raffensperger-to-run-for-georgia-governor-after-defying-trump-over-2020-election",
    "timestamp": "2025-09-17T16:53:09Z"
  },
  {
    "title": "Stop the Pentagon’s mad September spending spree — and save us from wasting billion$",
    "description": "Defense Secretary Pete Hegseth must halt the annual spending binge that has the Pentagon throwing away billions on expenses that have nothing to do with military needs.",
    "link": "https://nypost.com/2025/09/17/opinion/stop-the-pentagons-september-spending-spree-and-save-billion/",
    "timestamp": "2025-09-17T16:52:57Z"
  },
  {
    "title": "Royal meeting with Trumps 'warm and friendly'",
    "description": "Prince William and Princess Kate held a private meeting with US President Donald Trump and First Lady Melania Trump at Windsor Castle on Wednesday, CNN's Max Foster reported, citing royal sources.Whil...",
    "link": "https://biztoc.com/x/6405392549d64d32",
    "timestamp": "2025-09-17T16:52:51Z"
  },
  {
    "title": "Trump allies reportedly poised to buy TikTok",
    "description": "What happened\nPresident Donald Trump yesterday said his administration and Beijing have a “deal on TikTok,” and he gave the social media juggernaut a fourth 90-day reprieve from a law banning it from the U.S. as long as it remains under Chinese ownership. He …",
    "link": "https://biztoc.com/x/284829bceb010fc2",
    "timestamp": "2025-09-17T16:52:35Z"
  },
  {
    "title": "Donald Trump and Melania Trump displayed a united front with matching outfits for their visit to the UK",
    "description": "Kate Middleton, Prince William, Donald Trump, and Melania Trump in Windsor, England.\nWPA Pool/Getty Images\nDonald and Melania Trump visited Windsor, England, on Wednesday to meet with the British royals.\nThey seemingly coordinated their outfits to include dar…",
    "link": "https://biztoc.com/x/98a81c67756a3ea9",
    "timestamp": "2025-09-17T16:52:29Z"
  },
  {
    "title": "Trump Troop Deployment in U.S. Climbs to 35,000 Boots on the Ground",
    "description": "A federal judge found the deployment to LA violated bedrock constitutional law, but Trump’s domestic military campaign continues.\nThe post Trump Troop Deployment in U.S. Climbs to 35,000 Boots on the Ground appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/09/17/trump-total-military-troops-deployed-cost/",
    "timestamp": "2025-09-17T16:51:13Z"
  },
  {
    "title": "Trey Parker and Matt Stone Postpone Tonight’s ‘South Park’ Episode, Claim They Couldn’t Finish It In Time",
    "description": "‘South Park’ will return one week from today following the extended delay",
    "link": "https://www.cracked.com/article_48380_trey-parker-and-matt-stone-postpone-tonights-south-park-episode-claim-they-couldnt-finish-it-in-time.html",
    "timestamp": "2025-09-17T16:51:00Z"
  },
  {
    "title": "China bans tech firms from Nvidia chip purchases: Report",
    "description": "CEO Jensen Huang is expected to discuss the developments with US President Donald Trump in London on Wednesday.",
    "link": "https://www.aljazeera.com/economy/2025/9/17/china-bans-tech-firms-from-nvidia-chip-purchases-report",
    "timestamp": "2025-09-17T16:50:13Z"
  }
]