[
  {
    "title": "A half-century of US-Russian arms control ends with the expiration of the New START nuclear pact",
    "description": "There are fears the end of the treaty could mean another nuclear arms race.",
    "link": "https://www.denverpost.com/2026/02/05/start-nuclear-pact-expires/",
    "timestamp": "2026-02-05T16:27:04Z"
  },
  {
    "title": "A half-century of US-Russian arms control ends with the expiration of the New START nuclear pact",
    "description": "There are fears the end of the treaty could mean another nuclear arms race.",
    "link": "https://www.bostonherald.com/2026/02/05/start-nuclear-pact-expires/",
    "timestamp": "2026-02-05T16:27:04Z"
  },
  {
    "title": "India rejects report on Doval-Rubio meeting",
    "description": "NEW DELHI: India on Thursday trashed a media report that said National Security Adviser Ajit Doval travelled to Washington last September to get back to negotiating a trade deal, and told US Secretary of State Marco Rubio that New Delhi wouldn’t be bullied. T…",
    "link": "https://statetimes.in/india-rejects-report-on-doval-rubio-meeting/",
    "timestamp": "2026-02-05T16:26:34Z"
  },
  {
    "title": "Vance says the Olympics are 'one of the few things' that unite Americans",
    "description": "Vice President JD Vance is leading President Donald Trump's delegation to the 2026 Winter Olympics and later stopping in Armenia and Azerbaijan in a show of support for a peace agreement brokered by the White House last year.",
    "link": "https://www.pbs.org/newshour/world/vance-says-the-olympics-are-one-of-the-few-things-that-unite-americans",
    "timestamp": "2026-02-05T16:25:21Z"
  },
  {
    "title": "Last U.S.-Russian Nuclear Pact To Expire, Ending A Half-Century Of Arms Control",
    "description": "The expiration of the New START Treaty on Thursday leaves no caps on the two largest atomic arsenals for the first time in over 50 years.",
    "link": "https://www.huffpost.com/entry/russia-new-start-nuclear-arms-treaty-expires_n_6984c0b3e4b0befe37554c81",
    "timestamp": "2026-02-05T16:25:19Z"
  },
  {
    "title": "FBI: Ohio Man Accused of Threatening to Kill 'Random' ICE Agents and President Trump",
    "description": "A man was arrested Wednesday in Trumbull County, Ohio, for allegedly posting online threats against President Donald Trump and other officials.\nThe post FBI: Ohio Man Accused of Threatening to Kill ‘Random’ ICE Agents and President Trump appeared first on Bre…",
    "link": "https://www.breitbart.com/crime/2026/02/05/fbi-ohio-man-accused-of-threatening-to-kill-random-ice-agents-and-president-trump/",
    "timestamp": "2026-02-05T16:24:56Z"
  },
  {
    "title": "Koraput administration to pay special attention to border villages to counter AP influence",
    "description": "Koraput district administration is intensifying efforts in border villages like Raipahad to counter administrative intrusions from Andhra Pradesh. Senior officials are visiting to ensure welfare scheme benefits reach residents and to resolve issues on-site. I…",
    "link": "https://timesofindia.indiatimes.com/city/bhubaneswar/koraput-administration-to-pay-spl-attention-to-border-villages-to-counter-ap-influence/articleshow/127945037.cms",
    "timestamp": "2026-02-05T16:24:53Z"
  },
  {
    "title": "Chor Machaye Shor: Caught stealing, Bengaluru auto driver sues attackers for abuse",
    "description": "Bengaluru: In a plot twist straight out of a slapstick crime drama, a thief filed a police complaint after being caught stealing electrical equipment .",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/chor-machaye-shor-caught-stealing-bengaluru-auto-driver-sues-attackers-for-abuse/articleshow/127945119.cms",
    "timestamp": "2026-02-05T16:24:51Z"
  },
  {
    "title": "Relief for Kenyan exporters as Trump signs AGOA extension into law",
    "description": "It is a sigh of relief for the country's multi-billion shilling textile and manufacturing industry as the African Growth and Opportunity Act, AGOA, gets a new lease on life.",
    "link": "https://www.citizen.digital/business/relief-for-kenyan-exporters-as-trump-signs-agoa-extension-into-law-n376973",
    "timestamp": "2026-02-05T16:24:10Z"
  },
  {
    "title": "Bitcoin's monthslong slide continues, hitting fresh 15-month low of $67,000",
    "description": "The price of bitcoin continued its monthslong slide Thursday, falling another 11% to $67,000, its lowest level in 15 months",
    "link": "https://abcnews.go.com/Business/wireStory/bitcoins-monthslong-slide-continues-hitting-fresh-15-month-129886665",
    "timestamp": "2026-02-05T16:24:06Z"
  },
  {
    "title": "Trump defends Noem at National Prayer Breakfast, rejects calls to fire DHS secretary: 'Why would I do that?'",
    "description": "President Donald Trump defends DHS Secretary Kristi Noem amid mounting criticism, claiming that the U.S. now has the \"strongest border\" in its history.",
    "link": "https://www.foxnews.com/politics/trump-defends-noem-national-prayer-breakfast-rejects-calls-fire-dhs-secretary-why-would-i-do-that",
    "timestamp": "2026-02-05T16:23:29Z"
  },
  {
    "title": "Trump Shuts Down NBC News Host Pushing Job-Loss Narrative In Segment That Didn’t Air On TV",
    "description": "Donald shut down Tom Llamas when he pushed an artificial intelligence job-loss narrative during a segment that did not air on television Wednesday.",
    "link": "https://dailycaller.com/2026/02/05/trump-shuts-down-nbc-news-host-pushing-job-loss-narrative-in-segment-that-didnt-air-on-tv/",
    "timestamp": "2026-02-05T16:22:22Z"
  },
  {
    "title": "Could Blue States Boxing Out ICE Give Democrats Upper Hand In Next Census?",
    "description": "A nationwide push by Democrat lawmakers to hamstring Immigration and Customs Enforcement could give their party a winning edge in the upcoming 2030 Census.",
    "link": "https://dailycaller.com/2026/02/05/anti-ice-states-could-help-2030-census/",
    "timestamp": "2026-02-05T16:22:00Z"
  },
  {
    "title": "GOP Senator Shoots Down Trump’s Call for National Elections Takeover",
    "description": "The senator flatly warned he did not support the idea which he said would require a constitutional amendment.\nThe post GOP Senator Shoots Down Trump’s Call for National Elections Takeover first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/gop-senator-shoots-down-trumps-call-for-national-elections-takeover/",
    "timestamp": "2026-02-05T16:21:35Z"
  },
  {
    "title": "House GOP rips 'insane' Democrat demand to 'unmask' ICE agents as DHS shutdown looms",
    "description": "Congress has until the end of Feb. 13 to produce a bipartisan plan funding DHS for the remainder of the fiscal year.",
    "link": "https://www.foxnews.com/politics/house-gop-rips-insane-democrat-demand-unmask-ice-agents-dhs-shutdown-looms",
    "timestamp": "2026-02-05T16:20:45Z"
  },
  {
    "title": "Where are all the protest songs?",
    "description": "Protest requires people to take a stand and hold firm. Pop songs are designed to appeal across demographic lines. In music, as in the rest of the world, resistance takes place closer to the ground.",
    "link": "https://www.npr.org/2026/02/05/nx-s1-5701460/where-are-the-protest-songs",
    "timestamp": "2026-02-05T16:18:22Z"
  },
  {
    "title": "Bitcoin Crashed JPMorgan Sees Long-Term Upside vs Gold | US Crypto News",
    "description": "What is the biggest crypto news today? Bitcoin dips below $68,000, but JPMorgan says falling volatility strengthens long-term case vs gold.",
    "link": "https://beincrypto.com/bitcoin-crash-jpmorgan-prediction-long-term/",
    "timestamp": "2026-02-05T16:18:10Z"
  },
  {
    "title": "JD Vance's Reaction After Donald Trump's Heated 'Smile' Moment With CNN's Kaitlan Collins Is Getting Attention Online",
    "description": "JD Vance is being called out for his response to Donald Trump‘s “smile” comment at CNN reporter Kaitlan Collins. If you don’t know what happened, CNN chief White House correspondent Kaitlan Collins was asking questions about Epstein survivors during a Q&A wit…",
    "link": "https://www.justjared.com/2026/02/05/jd-vances-reaction-after-donald-trumps-heated-smile-moment-with-cnns-kaitlan-collins-is-getting-attention-online/",
    "timestamp": "2026-02-05T16:18:01Z"
  },
  {
    "title": "Tin prices may rise a tad further on woes over Indonesian export permits, Myanmar supplies",
    "description": "Tin prices may rise due to Indonesian export permit issues and Myanmar supply uncertainties, despite recent price drops.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/tin-prices-may-rise-a-tad-further-on-woes-over-indonesian-export-permits-myanmar-supplies/article70597045.ece",
    "timestamp": "2026-02-05T16:17:57Z"
  },
  {
    "title": "US Wrangles Major Ukraine-Russia Prisoner Swap Deal",
    "description": "U.S.-led negotiations have produced a breakthrough in the Ukraine war, with Kyiv and Moscow agreeing to a major prisoner exchange even as fighting continues.",
    "link": "https://dailycaller.com/2026/02/05/us-wrangles-major-ukraine-russia-prisoner-swap-deal/",
    "timestamp": "2026-02-05T16:15:52Z"
  },
  {
    "title": "UAE plans compound for Palestinians in Israeli-held south Gaza, map shows",
    "description": "By Alexander CornwellJERUSALEM, Feb 5 (Reuters) - The United Arab Emirates has drafted plans to build a compound to house thousands of displaced Palestinians in a part of… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/uae-plans-compound-for-palestinians-in-israeli-held-south-gaza-map-shows",
    "timestamp": "2026-02-05T16:14:26Z"
  },
  {
    "title": "Somali Communities Are Building Collective Power in the Face of Trump’s Attacks",
    "description": "Minnesota’s Somali community has organized mutual aid and neighborhood patrols amid Trump’s campaign to crush them. This article was originally published by Truthout. Winter in Minnesota is notoriously harsh, lasting until mid-spring and marked by below-freez…",
    "link": "https://www.shareable.net/somali-communities-are-building-collective-power-in-the-face-of-trumps-attacks/",
    "timestamp": "2026-02-05T16:13:44Z"
  },
  {
    "title": "Panama will not be threatened by China over canal court ruling, leader says",
    "description": "Panamanian President José Raúl Mulino says he hopes a legal battle with a Hong Kong firm over Panama Canal ports does not escalate",
    "link": "https://abcnews.go.com/Business/wireStory/panama-threatened-china-canal-court-ruling-leader-129886139",
    "timestamp": "2026-02-05T16:13:43Z"
  },
  {
    "title": "A detailed account of Lindsay Lohan’s battle with substance abuse and surviving the spiral of fame",
    "description": "Once the sweetheart of Hollywood in the early 2000s, Lindsay Lohan's path to stardom was fraught with challenges, including substance struggles and public scrutiny. Her experience encapsulates the darker side of fame seen through the lens of a young star.",
    "link": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/a-detailed-account-of-lindsay-lohans-battle-with-substance-abuse-and-surviving-the-spiral-of-fame/articleshow/127934743.cms",
    "timestamp": "2026-02-05T16:13:14Z"
  },
  {
    "title": "Trump’s Iran Gamble",
    "description": "Although it is still possible that US President Donald Trump could accept a limited nuclear deal with Iran that allows him to declare victory, the more likely scenario is that he will try to repeat his recent success in Venezuela. There is just one problem: I…",
    "link": "https://www.project-syndicate.org/commentary/trump-iran-gamble-geopolitical-military-energy-economic-risks-by-ian-bremmer-2026-02",
    "timestamp": "2026-02-05T16:13:13Z"
  },
  {
    "title": "New Trump administration rule makes it easier to fire career civil servants",
    "description": "The OPM rule says that high ranking officials could be fired for 'intentionally subverting Presidential directives'.",
    "link": "https://www.aljazeera.com/economy/2026/2/5/new-trump-administration-rule-makes-it-easier-to-fire-career-civil-servants",
    "timestamp": "2026-02-05T16:13:11Z"
  },
  {
    "title": "$2,000 stimulus check update: Trump says 'I’m looking at it'",
    "description": "President Donald Trump offered a $2,000 stimulus check update during a recent \"TODAY\" interview, saying he is “looking at” sending payments.",
    "link": "https://www.statesman.com/business/economy/article/2000-stimulus-check-update-trump-21335382.php",
    "timestamp": "2026-02-05T16:11:41Z"
  },
  {
    "title": "US and Russia negotiating New START deal – Axios",
    "description": "Moscow and Washington discussed options for observing the New Start Treaty beyond its expiration date in Abu Dhabi, Axios has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632065-us-russia-negotiate-new-start/",
    "timestamp": "2026-02-05T16:11:10Z"
  },
  {
    "title": "Retaliation: Report Claims China Exiting Business in Panama After Canal Ruling Loss",
    "description": "The business outlet Bloomberg reported on Thursday that its anonymous sources affirmed that the Chinese Communist Party had ordered an end to \"projects\" in Panama following that nation's top court ruling that a deal granting outsized power to a Hong Kong corp…",
    "link": "https://www.breitbart.com/latin-america/2026/02/05/retaliation-report-claims-china-exiting-business-in-panama-after-canal-ruling-loss/",
    "timestamp": "2026-02-05T16:10:48Z"
  },
  {
    "title": "US Envoy Cuts Ties With Polish Parliament Speaker Over Trump (Maciej Martewicz/Bloomberg)",
    "description": "Maciej Martewicz / Bloomberg:\nUS Envoy Cuts Ties With Polish Parliament Speaker Over Trump  —  US Ambassador to Poland Tom Rose said he'll cease all contact with the speaker of the Polish Parliament Wlodzimierz Czarzasty due to his comments on President Donal…",
    "link": "https://www.memeorandum.com/260205/p47",
    "timestamp": "2026-02-05T16:10:00Z"
  },
  {
    "title": "Chairman of High-Powered Paul Weiss Law Firm Resigns Following Epstein Files Appearances",
    "description": "The chairman of Paul Weiss has resigned his position after his embarrassing emails with pedophile Jeffrey Epstein were revealed in the latest file dump.\nThe post Chairman of High-Powered Paul Weiss Law Firm Resigns Following Epstein Files Appearances first ap…",
    "link": "https://www.mediaite.com/media/news/chairman-of-high-powered-paul-weiss-law-firm-resigns-following-epstein-files-appearances/",
    "timestamp": "2026-02-05T16:07:17Z"
  },
  {
    "title": "Jeff Bezos Killed the Washington Post",
    "description": "The billionaire wanted the Post to die, because a vigorous, well-resourced newspaper does not help his bottom line.",
    "link": "https://slate.com/business/2026/02/jeff-bezos-washington-post-layoffs.html",
    "timestamp": "2026-02-05T16:07:12Z"
  },
  {
    "title": "The Washington Post Disaster is an Indictment of Both Publishers and Society",
    "description": "\"That a man already worth a quarter trillion dollars would make that trade is one of the most damning indictments of human nature available in public life today.\"\nThe post The Washington Post Disaster is an Indictment of Both Publishers and Society first appe…",
    "link": "https://www.mediaite.com/opinion/the-washington-post-disaster-is-an-indictment-of-both-publishers-and-society/",
    "timestamp": "2026-02-05T16:06:44Z"
  },
  {
    "title": "Xi Urges Trump Use ‘Extreme Caution’ With Taiwan",
    "description": "China’s Xi Jinping warned President Donald Trump to use “extreme caution” regarding arms sales to Taiwan, in a phone call between the two leaders.   Taiwan was one of more than half... Read More\nThe post Xi Urges Trump Use ‘Extreme Caution’ With Taiwan appear…",
    "link": "https://www.dailysignal.com/2026/02/05/xi-urges-trump-use-extreme-caution-with-taiwan/",
    "timestamp": "2026-02-05T16:05:00Z"
  },
  {
    "title": "Stephen Colbert Says ‘Melania’ Numbers Impressive ‘Until You Realize It’s Less Than 10 Percent of Budget’",
    "description": "Stephen Colbert and Jimmy Kimmel skewered the opening box-office numbers for Amazon's Melania Trump doc 'Melania' on their late-night shows.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/melania-documentary-late-night-reaction-1235511362/",
    "timestamp": "2026-02-05T16:04:14Z"
  },
  {
    "title": "Trump Says It’s His Right to Use DOJ as His Personal Law Firm",
    "description": "The president believes he has a “right” to use the Justice Department as his own personal law firm.Speaking at the 74th National Prayer Breakfast Thursday morning, Donald Trump seemed to think that criticism of his intent to abuse the executive branch was all…",
    "link": "https://newrepublic.com/post/206192/donald-trump-his-right-weaponize-department-justice",
    "timestamp": "2026-02-05T16:03:51Z"
  },
  {
    "title": "AVENGERS: DOOMSDAY Star Ian McKellen Doubles Down On Major [SPOILER]: \"I'm Sorry About That\"",
    "description": "Avengers: Doomsday star Sir Ian McKellen has doubled down on the huge spoiler he recently dropped about Magneto's role and details the experience of being on set to shoot the sequence.",
    "link": "https://comicbookmovie.com/avengers/avengers-doomsday/avengers-doomsday-star-ian-mckellen-doubles-down-on-major-spoiler-im-sorry-about-that-a226264",
    "timestamp": "2026-02-05T16:03:00Z"
  },
  {
    "title": "Tulsi Gabbard mistakenly gave up 'biggest smoking gun' against president: ex-Trump staffer",
    "description": "Former Trump official turned critic Miles Taylor Thursday said that the president's spy chief Tulsi Gabbard could have just implicated the president in the fallout over why she was at the FBI raid of an election office in Fulton County, Georgia. In his Substa…",
    "link": "https://www.rawstory.com/ex-2675099995/",
    "timestamp": "2026-02-05T16:02:54Z"
  },
  {
    "title": "Analysis-Once feted Mandelson becomes nightmare for weakened UK PM Starmer",
    "description": "By Elizabeth Piper, Andrew MacAskill and Alistair SmoutLONDON, Feb 5 (Reuters) - Prime Minister Keir Starmer’s appointment of Peter Mandelson as Britain’s ambassador to t… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/analysis-once-feted-mandelson-becomes-nightmare-for-weakened-uk-pm-starmer",
    "timestamp": "2026-02-05T16:00:51Z"
  },
  {
    "title": "Watch! Rapido delivery takes a strange turn - What the rider found inside the box",
    "description": "A Rapido delivery boy, Karan Nishad, was shocked when a customer instructed him to dispose of a sealed box in a pile of garbage. The woman confirmed the delivery was paid online and that the contents were indeed trash. The incident, captured in a viral video,…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/watch-rapido-delivery-takes-a-strange-turn-what-the-rider-found-inside-the-box/articleshow/127943792.cms",
    "timestamp": "2026-02-05T16:00:25Z"
  },
  {
    "title": "Zombified Kamala Campaign Account Suddenly Rebrands To ‘Gen Z-Led’ Content Mill After Year-Long Absence",
    "description": "Former Vice President Kamala Harris relaunched her social media accounts Thursday morning, over a year after voters rejected her at the ballot box. Harris announced in a video posted to several social media platforms early Thursday that “Kamala HQ” — the form…",
    "link": "https://dailycaller.com/2026/02/05/pro-kamala-account-rebrands-gen-z-absence/",
    "timestamp": "2026-02-05T16:00:24Z"
  },
  {
    "title": "February 4, 2026 — On the heels of last weekend's special election in Texas ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nFebruary 4, 2026  —  On the heels of last weekend's special election in Texas, President Donald J. Trump has called for his administration to take over the polls before the 2026 midterm elections.  On Saturda…",
    "link": "https://www.memeorandum.com/260205/p42",
    "timestamp": "2026-02-05T16:00:06Z"
  },
  {
    "title": "Thom Hartmann on Trump’s New Grift",
    "description": "Donald Trump has learned one big lesson from his time in business and politics. Business is risky, politics is a sure thing. As a businessman, Trump failed repeatedly. He filed for bankruptcy many times. His casinos failed; Trump Airlines failed; Trump steaks…",
    "link": "https://dianeravitch.net/2026/02/05/thom-hartmann-on-trumps-new-grift/",
    "timestamp": "2026-02-05T16:00:00Z"
  },
  {
    "title": "Letters: Why Mayor Wayne Brown’s idea of a bridge from Meola Reef is worth investigating",
    "description": "OPINION: Any new motorway needs to be taken well north before merging with SH1.",
    "link": "https://www.nzherald.co.nz/nz/letters-why-mayor-browns-idea-of-a-bridge-from-meola-reef-is-worth-investigating/premium/AAWBKFFUXFFC3OZ4BBJS5IGVXQ/",
    "timestamp": "2026-02-05T16:00:00Z"
  },
  {
    "title": "How Much Ground Has Trump Lost on Immigration in the Polls?",
    "description": "Polls show Trump’s job approval on immigration and everything else is slowly declining. Americans definitely aren’t happy with the killings in Minneapolis and support restrictions on ICE.",
    "link": "http://nymag.com/intelligencer/article/trump-immigration-polling-good-pretti.html",
    "timestamp": "2026-02-05T15:59:58Z"
  },
  {
    "title": "@KamalaHQ is relaunching as a Gen Z ‘progressive content hub’",
    "description": "Kamala Harris' social media strategy in the run-up to the 2024 presidential election was filled with Gen Z dog whistles: viral branding based on pop music, memes, camo hats that were a double entendre. It was an effective way to get attention and news coverag…",
    "link": "https://www.theverge.com/policy/874410/kamala-harris-kamalahq-headquarters-rebrand-launch",
    "timestamp": "2026-02-05T15:56:58Z"
  },
  {
    "title": "Epstein files topple law CEO, roil UK government",
    "description": "Peter Mandelson, Britain’s former ambassador to the US, is caught up in the scandal",
    "link": "https://theweek.com/world-news/epstein-files-roil-uk-government-ceo",
    "timestamp": "2026-02-05T15:55:44Z"
  },
  {
    "title": "Kristi Noem Bashes Celebrities Who Speak Out Against ICE",
    "description": "Kristi Noem Bashes Celebrities Who Speak Out Against ICElittlethings.com",
    "link": "https://littlethings.com/entertainment/kristi-noem-celebrities-ice",
    "timestamp": "2026-02-05T15:54:10Z"
  },
  {
    "title": "Erika Kirk Says Turning Point USA Super Bowl Halftime Show Will Draw ‘Larger …",
    "description": "Reading Time: 3 minutesErika Kirk believes her All-American Halftime show will draw a \"larger audience\" than Bad Bunny's performance at the Super Bowl.\nErika Kirk Says Turning Point USA Super Bowl Halftime Show Will Draw ‘Larger … was originally published on …",
    "link": "http://www.thehollywoodgossip.com/2026/02/erika-kirk-says-turning-point-usa-super-bowl-halftime-show-will-draw-larger-audience-than-bad-bunny/",
    "timestamp": "2026-02-05T15:51:36Z"
  },
  {
    "title": "Trump’s critical mineral reserve is an admission that the future is electric | TechCrunch",
    "description": "The administration's $12 billion stockpile of critical minerals is aimed at blunting China's influence. But it also revels the direction of the global economy.",
    "link": "https://techcrunch.com/2026/02/05/trumps-critical-mineral-reserve-is-an-admission-that-the-future-is-electric/",
    "timestamp": "2026-02-05T15:51:18Z"
  },
  {
    "title": "Trump refuses to 'slap back' as one GOP business giant turns on president's agenda: report",
    "description": "President Donald Trump does not hesitate to lash out at people who criticize him, even those who have supported him for years — but he has maintained an eerie silence about one person who is turning on him, CNBC's Andrew Ross Sorkin told MS NOW on Thursday: K…",
    "link": "https://www.rawstory.com/trump-2675099117/",
    "timestamp": "2026-02-05T15:50:16Z"
  },
  {
    "title": "Trump-Era Federal Layoffs Hit Black Women Hardest",
    "description": "There is a shift happening in the labor force that favors men in general, and white men in particular. And Black women—who historically have found more job security and upward mobility in federal employment—are now seeing those federal jobs slip away in recor…",
    "link": "https://msmagazine.com/2026/02/05/black-women-jobs-trump-layoffs-doge-cuts-fired/",
    "timestamp": "2026-02-05T15:49:46Z"
  },
  {
    "title": "Trump's Denunciations of the Iranian Killings Are Pure Hypocrisy",
    "description": "Juan Cole\n\n\n\nThe arbitrary arrests and killings committed by agents of Trump’s authoritarian-style rule differ only in number, not in kind, from those in Iran.\r\n\n\r\n\n\nThe post Trump's Denunciations of the Iranian Killings Are Pure Hypocrisy appeared first on T…",
    "link": "https://www.thenation.com/article/world/iran-protesters-ice-minneapolis/",
    "timestamp": "2026-02-05T15:49:03Z"
  },
  {
    "title": "Marty Baron Warns Jeff Bezos Is Shredding The Washington Post to “Ingratiate Himself With Donald Trump”",
    "description": "The former editor of the paper tells Vanity Fair that the “tremendous” newsroom brings in readers, but Trump has driven the owner and his publisher, Will Lewis, to decisions that have sent those readers “out the back door.”",
    "link": "https://www.vanityfair.com/news/story/washington-post-editor-marty-baron-jeff-bezos",
    "timestamp": "2026-02-05T15:48:55Z"
  },
  {
    "title": "Mediaite One Sheet: Trump vs. Kaitlan Collins Takes, WaPo Autopsy and Guthrie Story Enters Day 5",
    "description": "Mediaite One Sheet, Feb 5: Full autopsy of the Washington Post \"murder,\" hot takes on Trump vs Kaitlan, and Nancy Guthrie story moves to day five.\nThe post Mediaite One Sheet: Trump vs. Kaitlan Collins Takes, WaPo Autopsy and Guthrie Story Enters Day 5 first …",
    "link": "https://www.mediaite.com/media/news/mediaite-one-sheet-trump-kailtan-wapo-collapse-nancy-guthrie/",
    "timestamp": "2026-02-05T15:47:02Z"
  },
  {
    "title": "Trump Attacks Immigrants in Wild Rant at National Prayer Breakfast",
    "description": "After concluding that his administration needed a “softer touch” on immigration, President Donald Trump delivered remarks Thursday at the National Prayer Breakfast that quickly devolved into a wildly racist tirade against immigrants.“We have to get the bad on…",
    "link": "https://newrepublic.com/post/206189/donald-trump-attacks-immigrants-prayer-breakfast",
    "timestamp": "2026-02-05T15:46:54Z"
  },
  {
    "title": "GOP resists call to “nationalize voting” — but Trump’s trying it anyway",
    "description": "The president continues to deny his 2020 election loss, claiming voter fraud is why Republicans must \"take over\"",
    "link": "https://www.salon.com/2026/02/05/republicans-resist-call-to-nationalize-voting-but-trumps-trying-it-anyway/",
    "timestamp": "2026-02-05T15:45:24Z"
  },
  {
    "title": "Kamala Harris activates long-dormant campaign accounts to announce ‘Headquarters’ rebrand: ‘I’ll see you out there’",
    "description": "Former Vice President Kamala Harris announced a rebrand of her long-dormant campaign account Thursday after teasing a mystery announcement the day before. Her “KamalaHQ” account on X, which went silent after her loss to Donald Trump in the 2024 presidential e…",
    "link": "https://nypost.com/2026/02/05/us-news/kamala-harris-activates-long-dormant-campaign-accounts-to-announce-headquarters-rebrand/",
    "timestamp": "2026-02-05T15:45:05Z"
  },
  {
    "title": "Joe Budden Thinks Nicki Minaj Is Taking Checks to Support Trump",
    "description": "Joe is not here for it. Continue reading…",
    "link": "https://www.xxlmag.com/joe-budden-nicki-minaj-money-support-president-trump/",
    "timestamp": "2026-02-05T15:44:09Z"
  },
  {
    "title": "Supreme Court upholds California gerrymander",
    "description": "The emergency docket order had no dissents from the court",
    "link": "https://theweek.com/politics/supreme-court-upholds-california-gerrymander",
    "timestamp": "2026-02-05T15:43:49Z"
  },
  {
    "title": "Warning Signs for Republicans in 2026",
    "description": "Republicans are beginning to sound the alarm about the 2026 midterm elections, and not without reason. The concern was crystallized by a Texas state Senate... Read More\nThe post Warning Signs for Republicans in 2026 appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/02/05/warning-signs-for-republicans-in-2026/",
    "timestamp": "2026-02-05T15:42:35Z"
  },
  {
    "title": "Melania: an ‘ice-cold’ documentary",
    "description": "The film has played to largely empty cinemas, but it does have one fan",
    "link": "https://theweek.com/culture-life/film/melania-an-ice-cold-documentary",
    "timestamp": "2026-02-05T15:41:11Z"
  },
  {
    "title": "US cuts contact with Polish parliament speaker over Trump ‘insults’",
    "description": "WARSAW, Feb 5 (Reuters) - The U.S. ambassador in Warsaw cut off contact with Poland’s parliament speaker on Thursday, accusing him of insulting Donald Trump after he crit… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/us-cuts-contact-with-polish-parliament-speaker-over-trump-insults",
    "timestamp": "2026-02-05T15:38:21Z"
  },
  {
    "title": "This Week’s Most Popular Articles",
    "description": "Epstein Files: Kosovo Narco-terrorists helped Traffic over a Million Children for Deranged Western Elites Drago Bosnic, February 3, 2026 Who Was Behind the Downing of Malaysian Airlines MH17? The Quest for Truth and Justice. Review of the Evidence Prof Michel…",
    "link": "https://www.globalresearch.ca/this-weeks-most-popular-articles-206/5914995",
    "timestamp": "2026-02-05T15:35:35Z"
  },
  {
    "title": "We Are Witnessing the Imperial Presidency on Steroids",
    "description": "Donald Trump has accumulated an amount of power in the executive branch that would appall America's founding fathers.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-presidential-power-nixon-steroids-1235511366/",
    "timestamp": "2026-02-05T15:35:16Z"
  },
  {
    "title": "Trump Drops Whopper of a Claim When NBC Anchor Asks if He’ll Testify on Epstein Files in Blockbuster Interview",
    "description": "President Donald Trump dropped a whopper of a dodge when NBC's Tom Llamas asked him if he would testify to Congress about the Epstein Files.\nThe post Trump Drops Whopper of a Claim When NBC Anchor Asks if He’ll Testify on Epstein Files in Blockbuster Intervie…",
    "link": "https://www.mediaite.com/media/tv/trump-drops-whopper-of-a-claim-when-nbc-anchor-asks-if-hell-testify-on-epstein-files-in-blockbuster-interview/",
    "timestamp": "2026-02-05T15:32:06Z"
  },
  {
    "title": "Jimmy Kimmel Rips ‘Melania’ Box Office as ‘Very Sus’ and Roasts Audience Scores Being ‘1% Higher’ Than ‘The Godfather’: ‘I’m Sure Donald J. Corleone Had Nothing to Do With It’",
    "description": "Jimmy Kimmel won’t stop ragging on “Melania,” the Amazon MGM-backed documentary that follows Melania Trump in the 20 days leading up to her husband Donald’s second presidential inauguration. During his latest “Jimmy Kimmel Live” monologue, the late-night host…",
    "link": "https://variety.com/2026/film/news/jimmy-kimmel-melania-box-office-audience-scores-1236653382/",
    "timestamp": "2026-02-05T15:31:47Z"
  },
  {
    "title": "700 ICE agents exit Twin Cities amid legal chaos",
    "description": "More than 2,000 agents remain in the region",
    "link": "https://theweek.com/politics/700-ice-agents-exit-twin-cities",
    "timestamp": "2026-02-05T15:31:46Z"
  },
  {
    "title": "'Political albatross': CNN data guru dubs Kristi Noem serious political problem for Trump",
    "description": "Dramatic new polling results have revealed that Americans want Homeland Security Secretary Kristi Noem fired and a majority oppose ICE's actions, according to CNN's data guru Thursday. CNN chief data analyst Harry Enten described the attitude among voters tow…",
    "link": "https://www.rawstory.com/kristi-noem-donald-trump-2675099563/",
    "timestamp": "2026-02-05T15:30:25Z"
  },
  {
    "title": "How Jeff Bezos Broke The Washington Post",
    "description": "The paper of record for the nation’s capital cut a third of its staff this week. It didn’t have to be like this.",
    "link": "https://www.theatlantic.com/politics/2026/02/how-jeff-bezos-broke-washington-post/685885/",
    "timestamp": "2026-02-05T15:30:00Z"
  },
  {
    "title": "Vance's TikTok fixer to depart Trump administration for the private sector",
    "description": "Sean Cooksey, a former Federal Election Commission chair, had only planned to serve in the role of counsel to the vice president for about a year.",
    "link": "https://www.nbcnews.com/politics/jd-vance/vp-tiktok-fixer-sean-cooksey-depart-trump-admin-private-sector-bgr-rcna257336",
    "timestamp": "2026-02-05T15:30:00Z"
  },
  {
    "title": "Energy Department Moves To Fast-Track Advanced Nuclear Reactor Approvals",
    "description": "The Trump administration excludes advanced nuclear power reactors from excessive National Environmental Policy Act requirements.",
    "link": "https://reason.com/2026/02/05/energy-department-moves-to-fast-track-advanced-nuclear-reactor-approvals/",
    "timestamp": "2026-02-05T15:29:25Z"
  },
  {
    "title": "Kamala Harris Reboots ‘KamalaHQ’ as Headquarters, a ‘Progressive’ Media Hub Aimed at Gen Z Voters",
    "description": "Kamala Harris, more than a year after she was defeated by Donald Trump in the 2024 U.S. presidential election, is leveraging the digital presence she built during the campaign with a new media initiative: Headquarters, intended to “mobilize” young people agai…",
    "link": "https://variety.com/2026/digital/news/kamala-harris-kamalahq-headquarters-relaunch-1236653453/",
    "timestamp": "2026-02-05T15:28:38Z"
  },
  {
    "title": "Donald Trump criticizes DHS killings of Alex Pretti and Renée Good: ‘Should have not happened’",
    "description": "President Donald Trump said Wednesday that the fatal shootings of Alex Pretti and Renée Good by Department of Homeland Security officers in Minneapolis “should have not happened,” offering his most direct acknowledgment yet that two of the most consequential …",
    "link": "https://www.advocate.com/news/trump-critical-dhs-killings",
    "timestamp": "2026-02-05T15:28:07Z"
  },
  {
    "title": "Trump jokes why he can’t sleep on planes, sparking laughter during National Prayer Breakfast",
    "description": "President Donald Trump jokes about watching for \"missiles and enemies\" instead of sleeping on Air Force One, during his speech at the National Prayer Breakfast on Thursday.",
    "link": "https://www.foxnews.com/politics/trump-jokes-why-he-cant-sleep-planes-sparking-laughter-during-national-prayer-breakfast",
    "timestamp": "2026-02-05T15:27:17Z"
  },
  {
    "title": "Socialist mayor Mamdani backs Hochul in move that could reshape New York governor race",
    "description": "Democratic socialist NYC Mayor Zohran Mamdani endorses moderate Gov. Kathy Hochul for re-election, bridging New York's progressive-centrist divide.",
    "link": "https://www.foxnews.com/politics/socialist-mayor-backs-hochul-surprising-move-could-reshape-new-york-governor-race",
    "timestamp": "2026-02-05T15:27:04Z"
  },
  {
    "title": "Trump’s Failure of the Will",
    "description": "Donald Trump’s shock-and-awe approach to politics has often been compared to authoritarian and fascist leaders who have consolidated power through grand political spectacles. But these accounts conflate shock with genuine spectacle, which Trump is incapable o…",
    "link": "https://www.project-syndicate.org/commentary/trump-show-shock-with-no-spectacle-does-not-expand-the-base-by-j-p-singh-2026-02",
    "timestamp": "2026-02-05T15:25:47Z"
  },
  {
    "title": "Domestic surveillance fears loom over Congress debate to renew spying power",
    "description": "Lawmakers’ concerns about immigration enforcement and Fourth Amendment compliance are weighing on the reauthorization fight for Section 702 of FISA, even as the FBI privately warns against letting the foreign spying law lapse.",
    "link": "https://www.nextgov.com/cybersecurity/2026/02/domestic-surveillance-fears-loom-over-congress-debate-renew-spying-power/411214/",
    "timestamp": "2026-02-05T15:23:00Z"
  },
  {
    "title": "India may increase coal imports from Washington under bilateral trade deal",
    "description": "Washington accounted for more than 8 per cent of India’s cumulative coal imports in FY25, which industry players, analysts and government officials indicate could easily be topped up to 10 per cent",
    "link": "https://www.thehindubusinessline.com/markets/commodities/india-may-increase-coal-imports-from-washington-under-bilateral-trade-deal/article70596726.ece",
    "timestamp": "2026-02-05T15:20:00Z"
  },
  {
    "title": "Here is what industry veterans are saying as bitcoin tumbles below $70,000",
    "description": "\"This drawdown feels horrible not because of the magnitude, but because it’s unfair,\" said longtime bitcoin maxi Samson Mow.",
    "link": "https://www.coindesk.com/markets/2026/02/05/here-is-what-industry-veterans-are-saying-as-bitcoin-tumbles-below-usd70-000",
    "timestamp": "2026-02-05T15:18:23Z"
  },
  {
    "title": "Exclusive: White House Rips Soros-Backed Human Rights Watch for Attacking Trump While Opposing Peace Deals",
    "description": "The White House blasted the \"blatant hypocrisy\" of the left-wing group Human Rights Watch (HRW) — which has criticized President Donald Trump's peace deals — on Wednesday after its executive director accused the United States of being \"hostile to human rights…",
    "link": "https://www.breitbart.com/politics/2026/02/05/exclusive-white-house-rips-soros-backed-human-rights-watch-for-attacking-trump-while-opposing-peace-deals/",
    "timestamp": "2026-02-05T15:17:11Z"
  },
  {
    "title": "Celebrity coaches and video applications: Here’s what we’re learning about Trump’s ‘Patriot Games’ | CNN Politics",
    "description": "The Trump administration is planning to match teen participants with celebrity coaches for its celebratory “Patriot Games” athletic contest scheduled this fall, according to spokesperson for the non-profit group leading the federal government’s celebrations.",
    "link": "https://www.cnn.com/2026/02/05/politics/patriot-games-america-250-details",
    "timestamp": "2026-02-05T15:13:21Z"
  },
  {
    "title": "Brazil’s Lula likely to visit Washington in early March",
    "description": "SAO PAULO, Feb 5 (Reuters) - Brazilian President Luiz Inacio Lula da Silva said on Thursday he is likely to travel to Washington in the first week of March for a meeting … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/brazil-s-lula-likely-to-visit-washington-in-early-march",
    "timestamp": "2026-02-05T15:12:48Z"
  },
  {
    "title": "Michelle Obama’s documentary surges on Netflix after Melania releases in theaters",
    "description": "Former first lady’s 2020 Netflix film saw a 13,000 percent increase in viewership over the weekend",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/melania-trump-michelle-obama-netflix-documentary-b2914608.html",
    "timestamp": "2026-02-05T15:11:39Z"
  },
  {
    "title": "Voters Not Won Over By Any Candidates In Wide Open Senate Race, Poll Shows",
    "description": "A plurality of voters are still undecided on which of the three major candidates to back just over three months before the GOP primary to replace former Senate Majority Leader Mitch McConnell, according to new polling. An Emerson College Polling survey releas…",
    "link": "https://dailycaller.com/2026/02/05/kentucky-senate-race-andy-barr-daniel-cameron-nate-morris-emerson-college-poll/",
    "timestamp": "2026-02-05T15:10:24Z"
  },
  {
    "title": "Bitcoin faces a brutal irony as the Treasury refuses to save BTC from its own political success",
    "description": "Treasury Secretary Scott Bessent told Congress he has no authority to bail out Bitcoin. The exchange came during a Senate Banking Committee hearing, when Senator Brad Sherman asked whether the Treasury could intervene to support cryptocurrency prices. Bessent…",
    "link": "https://cryptoslate.com/bitcoin-faces-a-brutal-irony-as-the-treasury-refuses-to-save-the-asset-from-its-own-political-success/",
    "timestamp": "2026-02-05T15:10:01Z"
  },
  {
    "title": "Cubans rendered powerless as outages persist and tensions with US escalate",
    "description": "Residents of a small coastal Cuban town face severe hardships despite living near energy sources",
    "link": "https://abcnews.go.com/International/wireStory/cubans-rendered-powerless-outages-persist-tensions-us-escalate-129884014",
    "timestamp": "2026-02-05T15:08:26Z"
  },
  {
    "title": "Donald Trump Is Skipping the Super Bowl Over Fear He’d Be Booed: Report",
    "description": "Advisors for the president \"determined that the chances were rather high of Trump getting booed.\"\nDonald Trump Is Skipping the Super Bowl Over Fear He’d Be Booed: Report\nScoop Harrison",
    "link": "https://consequence.net/2026/02/donald-trump-skipping-super-bowl-booed/",
    "timestamp": "2026-02-05T15:07:31Z"
  },
  {
    "title": "I toured the USS Massachusetts, the 680-foot battleship that fired the last shot of World War II. Take a look inside.",
    "description": "The USS Massachusetts, known for its pivotal role in World War II, is now a museum and war memorial in Massachusetts.",
    "link": "https://www.businessinsider.com/ww2-battleship-tour-uss-massachusetts-history-2026-2",
    "timestamp": "2026-02-05T15:07:08Z"
  },
  {
    "title": "Trump Kicks Off Prayer Breakfast in WILD Fashion — Attacks Christian Conservative and Democrats",
    "description": "President Donald Trump kicked off Thursday's National Prayer Breakfast in wild fashion, targeting conservative, Christian Rep. Chip Roy (R-TX) and others.\nThe post Trump Kicks Off Prayer Breakfast in WILD Fashion — Attacks Christian Conservative and Democrats…",
    "link": "https://www.mediaite.com/media/news/trump-kicks-off-prayer-breakfast-in-wild-fashion-attacks-christian-conservative-and-democrats/",
    "timestamp": "2026-02-05T15:05:42Z"
  },
  {
    "title": "‘Bite You In The A*s’: Bill Maher, Stephen A. Smith Blast Chuck Schumer For Claiming Voter ID Bill Is Racist",
    "description": "Stephen A. Smith and Bill Maher cautioned Senate Minority Leader Chuck Schumer about labeling the Safeguard American Voter Eligibility Act racist.",
    "link": "https://dailycaller.com/2026/02/05/bill-maher-stephen-a-smith-blast-chuck-schumer-voter-id-bill-racist/",
    "timestamp": "2026-02-05T15:05:28Z"
  }
]