[
  {
    "title": "Stephen Miller's Lickspittling Metaphor For Trump-Carney Meeting Goes Hilariously Awry",
    "description": "Donald Trump’s longtime adviser meant one thing but critics joked about him meaning something completely different.",
    "link": "https://www.huffpost.com/entry/stephen-miller-praise-donald-trump-backfires_n_681b259fe4b035302f24e062",
    "timestamp": "2025-05-07T09:50:32Z"
  },
  {
    "title": "How Europe Should Deal With Trump",
    "description": "It’s time to take great-power politics seriously.",
    "link": "http://foreignpolicy.com/2025/05/07/europe-trump-us-defense-nato-china-technology/",
    "timestamp": "2025-05-07T09:48:24Z"
  },
  {
    "title": "How Europe Should Deal With Trump",
    "description": "It’s time to take great-power politics seriously.",
    "link": "http://foreignpolicy.com/2025/05/07/how-europe-should-deal-with-trump/",
    "timestamp": "2025-05-07T09:48:24Z"
  },
  {
    "title": "Israel says 24 hostages alive in Gaza after Trump's comments alarm families",
    "description": "Israel has said 24 hostages are alive in Gaza - after Donald Trump said there were 21.",
    "link": "https://news.sky.com/story/israel-says-24-hostages-alive-in-gaza-after-donald-trumps-comments-alarm-families-13363206",
    "timestamp": "2025-05-07T09:48:00Z"
  },
  {
    "title": "Biden calls Trump's pressure on Ukraine 'modern-day appeasement' in interview",
    "description": "Former President Joe Biden has said in his first interview since leaving the White House that President Donald Trump's pressure on Ukraine to give up territory to Russia amounts to “modern-day appeasement.”",
    "link": "https://abcnews.go.com/International/wireStory/biden-calls-trumps-pressure-ukraine-modern-day-appeasement-121548653",
    "timestamp": "2025-05-07T09:47:51Z"
  },
  {
    "title": "Putin critic Johann Wadephul, Germany's new foreign minister",
    "description": "Germany's new Foreign Minister Johann Wadephul is a former soldier, trained lawyer and conservative MP who has long been a strong supporter of military backing for Ukraine as it fights Russia's invasion.",
    "link": "https://www.thelocal.de/20250507/putin-critic-johann-wadephul-germanys-new-foreign-minister",
    "timestamp": "2025-05-07T09:47:16Z"
  },
  {
    "title": "Israeli strikes across Gaza kill at least 59 as Israel prepares to ramp up its offensive",
    "description": "Israeli strikes in Gaza resulted in numerous fatalities, including women and children. A school sheltering displaced Palestinians was hit, causing significant casualties. Another school in Gaza City, also serving as a shelter, faced a similar attack. Tensions…",
    "link": "https://economictimes.indiatimes.com/news/defence/israeli-strikes-across-gaza-kill-at-least-59-as-israel-prepares-to-ramp-up-its-offensive/articleshow/120961469.cms",
    "timestamp": "2025-05-07T09:46:21Z"
  },
  {
    "title": "Global key public charger markets and status, 2025",
    "description": "The number of public chargers in China, the EU, and the US is estimated to reach 5.81 million units in 2025. China and the EU continue to expand, while growth in the US slows due to Trump's policies.",
    "link": "https://www.digitimes.com/reports/item.asp?id=20250331RS401",
    "timestamp": "2025-05-07T09:46:16Z"
  },
  {
    "title": "REVEALED: The key ministers to know in Germany's new cabinet",
    "description": "Germany's new cabinet was sworn in on Tuesday. Here are the key names you need to know in everything from foreign policy to housing and digitalisation.",
    "link": "https://www.thelocal.de/20250507/revealed-the-key-ministers-to-know-in-germanys-new-cabinet",
    "timestamp": "2025-05-07T09:45:41Z"
  },
  {
    "title": "Gavin Newsom Attacks Trump Over High-Speed Rail Threat: 'Reckless'",
    "description": "A spokesperson for the California governor said Trump's rhetoric over the project could give a generational advantage to China.",
    "link": "https://www.newsweek.com/gavin-newsom-attacks-trump-over-high-speed-rail-2068937",
    "timestamp": "2025-05-07T09:44:17Z"
  },
  {
    "title": "Trump Administration Quietly Disbands Key Infection Control Committee Weeks Before Notifying Members, Halting Updates To National Health Guidelines Amid Rising Disease Threats",
    "description": "The President Donald Trump administration has shuttered a key federal advisory committee responsible for infection control standards in U.S. healthcare facilities, with the termination already in effect for over a month before members were notified, according…",
    "link": "https://biztoc.com/x/15acfb3ccda7553c",
    "timestamp": "2025-05-07T09:42:18Z"
  },
  {
    "title": "Reckoning with the assault on press freedom",
    "description": "Important steps must be taken to ensure the safety and sustainability of Canadian journalism.",
    "link": "https://www.nationalobserver.com/2025/05/06/opinion/reckoning-assault-press-freedom",
    "timestamp": "2025-05-07T09:42:13Z"
  },
  {
    "title": "Smith talks separatism while Carney visits White House",
    "description": "While Prime Minister Mark Carney met with US President Donald Trump, Alberta’s premier was making waves with talk about separatist sentiments in the province.",
    "link": "https://www.nationalobserver.com/2025/05/06/news/smith-talks-separatism-while-carney-visits-white-house",
    "timestamp": "2025-05-07T09:41:40Z"
  },
  {
    "title": "Is Trump Carrying Out His Mass Deportation Promises? The Numbers Might Surprise You.",
    "description": "The administration's extreme methods might obscure this reality.",
    "link": "https://slate.com/news-and-politics/2025/05/trump-mass-deportation-promises-numbers-statistics.html",
    "timestamp": "2025-05-07T09:40:00Z"
  },
  {
    "title": "'World Cup can be incentive for Russia to end war', says Trump",
    "description": "'World Cup can be incentive for Russia to end war', says Trump",
    "link": "https://www.bbc.com/news/videos/cy9v9530527o",
    "timestamp": "2025-05-07T09:39:05Z"
  },
  {
    "title": "Pakistan decries ‘act of war’, vows retaliation as India launches strikes",
    "description": "Pakistan Prime Minister Shehbaz Sharif’s national security team slams India’s ‘violations’ of country’s sovereignty.",
    "link": "https://www.aljazeera.com/news/2025/5/7/pakistan-decries-act-of-war-vows-retaliation-as-india-launches-strikes",
    "timestamp": "2025-05-07T09:37:09Z"
  },
  {
    "title": "Türkiye warns of 'all-out war' risk in India-Pakistan clash",
    "description": "Türkiye strongly condemned India’s missile strikes on Pakistan on May 6, warning that such actions heighten the risk of an all-out war, according to a statement from the Turkish Foreign Ministry on Tuesday.",
    "link": "https://www.hurriyetdailynews.com/turkiye-warns-of-all-out-war-risk-in-india-pakistan-clash-208899",
    "timestamp": "2025-05-07T09:36:35Z"
  },
  {
    "title": "Why Trump 2.0 is unlikely to end the “Forever War” on terrorism",
    "description": "Since 2001, the US has been involved in what some have called a “Forever War” against global terrorist groups. Rubrick Biegon looks at Donald Trump’s previous record on counterterrorism and his administration’s likely approach during his second term. He write…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/05/07/why-trump-2-0-is-unlikely-to-end-the-forever-war-on-terrorism/",
    "timestamp": "2025-05-07T09:35:11Z"
  },
  {
    "title": "Jon Voight’s plan to ‘Make Hollywood Great Again’ includes an ‘American cultural test’",
    "description": "The  actor wants to remove ‘draconian licensing terms’ and introduce tax incentives",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/jon-voight-hollywood-plan-trump-b2746279.html",
    "timestamp": "2025-05-07T09:35:10Z"
  },
  {
    "title": "US-China Trade Talks; India, Pakistan Trade Military Strikes",
    "description": "On today's podcast: 1) US Treasury Secretary Scott Bessent and US Trade Representative Jamieson Greer will travel later this week to Switzerland for trade talks with China led by Vice Premier He Lifeng, seeking to de-escalate a tariff standoff that has threat…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/us-china-trade-talks-india-pakistan-trade-military-strikes",
    "timestamp": "2025-05-07T09:33:35Z"
  },
  {
    "title": "Oil Extends Gain With US and Chinese Officials Set to Talk Trade",
    "description": "Oil pushed higher after rallying more than 3% in the previous session as the US and China agreed to start trade negotiations, raising optimism that tensions between the world’s two biggest economies may ease.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-extends-gain-with-us-and-chinese-officials-set-to-talk-trade",
    "timestamp": "2025-05-07T09:32:20Z"
  },
  {
    "title": "‘A Lot Of People Want The Job’: Trump Says He’ll Choose Waltz’s NSA Replacement In Next 6 Months",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | May 05, 2025\nPresident Donald Trump will pick Mike Waltz’s replacement as national security adviser in the next six months, he told The Daily Signal. “We have a lot of people that want the job, I can tell you…",
    "link": "https://biztoc.com/x/5d4966b575db0017",
    "timestamp": "2025-05-07T09:31:03Z"
  },
  {
    "title": "Counter-intuitive: Why Opec wants lower oil prices",
    "description": "The answer goes beyond Opec leader Saudi Arabia’s need to punish over-producers of oil like Kazakhstan and Iraq. With Trump set to visit Riyadh, the decision may have geopolitical motives too.",
    "link": "https://www.livemint.com/opinion/online-views/saudi-arabia-oil-policy-opec-news-brent-crude-prices-riyadh-oil-price-war-prince-abdulaziz-bin-salman-us-shale-iran-uae-11746536557892.html",
    "timestamp": "2025-05-07T09:30:10Z"
  },
  {
    "title": "The Arts of the Deal",
    "description": "Are NEA grant recipients the next to fall by the chainsaw?",
    "link": "https://slate.com/podcasts/what-next/2025/05/how-trump-is-attacking-the-arts",
    "timestamp": "2025-05-07T09:30:00Z"
  },
  {
    "title": "Second Fighter Jet Assigned To USS Harry S. Truman Crashes Into Sea",
    "description": "The two pilots on board were later rescued by a helicopter and suffered minor injuries in the incident, officials said. No one on the flight deck was hurt.",
    "link": "https://www.huffpost.com/entry/second-fighter-jet-uss-truman-crashes-into-sea_n_681b2468e4b0c2b15d96df08",
    "timestamp": "2025-05-07T09:28:55Z"
  },
  {
    "title": "Stop worrying, America. Just keep watching The Trump Show | CNN Business",
    "description": "On Tuesday’s episode of the Donald Trump reality TV show, the president of the United States teased “a very, very big announcement… like, as big as it gets” in the coming days.",
    "link": "https://www.cnn.com/2025/05/07/business/trump-trade-deal-reality-show-nightcap",
    "timestamp": "2025-05-07T09:27:24Z"
  },
  {
    "title": "Project 2025 was extreme. Trump’s first 100 days have been even more radical.",
    "description": "The president's environmental policies mirror the far-right blueprint — and push the boundaries of the Constitution.",
    "link": "https://www.nationalobserver.com/2025/05/06/news/project-2025-was-extreme-trumps-first-100-days-have-been-even-more-radical",
    "timestamp": "2025-05-07T09:25:37Z"
  },
  {
    "title": "Billionaire Bill Ackman Warns Harvard Endowment Faces Financial Reckoning",
    "description": "Harvard University’s endowment is heading for rough waters unless it changes course, direction and speed as the Ivy League exemplar deliberates as to whether to offload private equity holdings while battling the Trump administration over federal research fund…",
    "link": "https://www.breitbart.com/education/2025/05/07/billionaire-bill-ackman-warns-harvard-endowment-faces-financial-reckoning/",
    "timestamp": "2025-05-07T09:25:13Z"
  },
  {
    "title": "Canada’s exports to Europe surge, Trump’s tariff war sees trade with the US shrink",
    "description": "Canada's trade dynamics shifted dramatically in March 2025, with exports to the US declining amid rising tensions and new tariffs. Simultaneously, exports to other countries surged, driven by increased shipments of crude oil and gold. Political tensions escal…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/canadas-exports-to-europe-surge-trumps-tariff-war-sees-trade-with-the-us-shrink/articleshow/120960737.cms",
    "timestamp": "2025-05-07T09:24:40Z"
  },
  {
    "title": "Trump plans to announce that the US will call the Persian Gulf the Arabian Gulf, officials say",
    "description": "President Donald Trump plans to announce next week that the U.S. will refer to the Persian Gulf as the Arabian Gulf or the Gulf of Arabia. That's according to two U.S. officials who spoke to The Associated Press on Tuesday…",
    "link": "https://apnews.com/article/trump-persian-gulf-saudi-arabia-ce30874c27bc01426d93ad3c65a18844",
    "timestamp": "2025-05-07T09:24:00Z"
  },
  {
    "title": "Raja Krishnamoorthi launches bid for open Illinois Senate seat",
    "description": "Raja Krishnamoorthi has announced his bid to run for Senate, confirming speculations that he would join the field looking to win the seat left open by Dick Durbin.",
    "link": "https://abcnews.go.com/Politics/raja-krishnamoorthi-launches-bid-open-illinois-senate-seat/story?id=121530103",
    "timestamp": "2025-05-07T09:23:03Z"
  },
  {
    "title": "Joe Biden slams Trump for 'foolish' appeasement of Putin",
    "description": "Former President Joe Biden has accused the Trump administration of \"modern-day appeasement\" in its dealings with Vladimir Putin.",
    "link": "https://www.nbcnews.com/politics/joe-biden/joe-biden-slams-trump-appeasement-putin-russia-ukraine-rcna205283",
    "timestamp": "2025-05-07T09:21:07Z"
  },
  {
    "title": "Trump said to announce Persian Gulf name change",
    "description": "Two US officials told The Associated Press that President Donald Trump is expected to announce that the US will refer to the Persian Gulf as the Arabian Gulf or the Gulf of Arabia during his trip to S...",
    "link": "https://biztoc.com/x/2b70c1e498ff6439",
    "timestamp": "2025-05-07T09:20:14Z"
  },
  {
    "title": "I'm a Republican CEO. I'm adding a 'tariff tax' to my price tags so customers know why prices are rising.",
    "description": "Jared Fisher, a Republican who owns several bike shops, said he's adding a tariff line to price tags so customers know why prices are rising.",
    "link": "https://www.businessinsider.com/republican-business-owner-tariff-tax-line-item-price-tags-transparency-2025-5",
    "timestamp": "2025-05-07T09:20:02Z"
  },
  {
    "title": "'Look at his face': Mark Carney's expressions create buzz online during his meet with Trump. Here's why",
    "description": "Canadian Prime Minister Mark Carney met US President Donald Trump in the White House. The Canadian premier said he had asked Trump to stop referring to Canada as a part of the United States. Several expressions of Mark Carney's expressions from the meeting ha…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-mark-carney-meeting-white-house-canada-51st-us-state-look-at-his-face-mark-carneys-expressions-create-buzz-online-during-his-meet-with-trump-heres-why/articleshow/120960129.cms",
    "timestamp": "2025-05-07T09:15:46Z"
  },
  {
    "title": "20 attorneys general ask federal judge to reverse deep cuts to US Health and Human Services",
    "description": "Attorneys general in 19 states and Washington, D.C., are challenging cuts to the U.S. Health and Human Services agency.",
    "link": "https://www.kwqc.com/2025/05/07/20-attorneys-general-ask-federal-judge-reverse-deep-cuts-us-health-human-services/",
    "timestamp": "2025-05-07T09:15:34Z"
  },
  {
    "title": "Chinese Warship Shows Up Amid Rising US-Iran Threat of War",
    "description": "The Chinese naval port call in the United Arab Emirates comes ahead of Donald Trump's scheduled visit to the Gulf country.",
    "link": "https://www.newsweek.com/china-news-navy-ships-visit-persian-gulf-us-iran-tensions-2068922",
    "timestamp": "2025-05-07T09:12:11Z"
  },
  {
    "title": "Lawrence O'Donnell Shows Exact Moment Trump Was 'Humbled and Humiliated' On Live TV",
    "description": "The MSNBC host shows how the Canadian prime minister told off Trump \"to his face.\"",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-trump-canada-humiliated_n_681b13e6e4b0c2b15d96d5d9",
    "timestamp": "2025-05-07T09:11:08Z"
  },
  {
    "title": "Walmart Worker Disappears After ICE Agents Detain Him After 12-Hour Shift",
    "description": "Yali Molero said authorities stopped her husband after he left his 12-hour shift at a Nashville Walmart around 1 a.m. on Sunday.",
    "link": "https://www.newsweek.com/walmart-worker-ice-agents-nashville-leugim-romero-2068930",
    "timestamp": "2025-05-07T09:10:52Z"
  },
  {
    "title": "Trump says American kids will be fine with fewer dolls, but the toy industry is bracing for a 'nuclear bomb'",
    "description": "President Donald Trump's trade policies have upended the global toy industry.\nAndrew Harnik/Getty Images\nThe toy industry is poised to be hit hard by Trump's heightened levies on Chinese goods.\nChina is the world's toymaking powerhouse, making its relationshi…",
    "link": "https://biztoc.com/x/36f2d3a74198a89a",
    "timestamp": "2025-05-07T09:09:16Z"
  },
  {
    "title": "‘We Need Detention Beds’: Border Czar Homan Says Of Trump’s Plan To Reopen Alcatraz Prison",
    "description": "By Virginia Allen, The Daily Signal | May 05, 2025\nPresident Donald Trump wants to reopen Alcatraz, a long-closed former prison on a small island off the coast of San Francisco. As the Trump administration steps up its efforts to secure the border and deport …",
    "link": "https://biztoc.com/x/8674c086c18ec7ce",
    "timestamp": "2025-05-07T09:09:10Z"
  },
  {
    "title": "Un-Kemp’d: Georgia’s GOP Governor To Forgo Senate Bid",
    "description": "By George Caldwell, The Daily Signal | May 05, 2025\nGeorgia Republican Gov. Brian Kemp announced Monday that he will not run for Senate in 2026, dashing hopes that he would help flip Democrat Sen. Jon Ossoff’s seat from a state that Donald Trump won in 2024.\n…",
    "link": "https://biztoc.com/x/7f1fa176c5355965",
    "timestamp": "2025-05-07T09:09:06Z"
  },
  {
    "title": "Top U.S. Officials To Meet Chinese Delegation In Switzerland Amid Bruising Trade War",
    "description": "No country has been hit harder by Trump’s tariffs than China, the world’s biggest exporter and second largest economy.",
    "link": "https://www.huffpost.com/entry/china-us-talks-amid-trade-war_n_681b20ebe4b0529436a19841",
    "timestamp": "2025-05-07T09:06:47Z"
  },
  {
    "title": "20 attorneys general ask federal judge to reverse deep cuts to US Health and Human Services",
    "description": "Attorneys general in 19 states and Washington, D.C., are challenging cuts to the U.S. Health and Human Services agency.",
    "link": "https://www.kfvs12.com/2025/05/07/20-attorneys-general-ask-federal-judge-reverse-deep-cuts-us-health-human-services/",
    "timestamp": "2025-05-07T09:02:25Z"
  },
  {
    "title": "Trump says American kids will be fine with fewer dolls, but the toy industry is bracing for a 'nuclear bomb'",
    "description": "Experts say that Trump's tariffs could cause a shortage of toys, price hikes, and \"a very sad Christmas.\"",
    "link": "https://www.businessinsider.com/trump-tariffs-toy-industry-impact-2025-5",
    "timestamp": "2025-05-07T09:01:01Z"
  },
  {
    "title": "Fani Willis Said Her Whistleblower Posed A Violent Threat to Her Office. Audio Recordings Tell A Different Story.",
    "description": "A big problem arrived in Fulton County district attorney Fani Willis’s email inbox on the afternoon of Nov. 16, 2021.\nThe post Fani Willis Said Her Whistleblower Posed A Violent Threat to Her Office. Audio Recordings Tell A Different Story. appeared first on .",
    "link": "https://freebeacon.com/democrats/fani-willis-said-her-whistleblower-posed-a-violent-threat-to-her-office-audio-recordings-tell-a-different-story/",
    "timestamp": "2025-05-07T09:00:59Z"
  },
  {
    "title": "DEI is dead. Here's what should come next",
    "description": "DEI died a deserved death. We saw corporations and CEOs support it in lockstep. Now that it's gone, they need to learn to operate independently to find the best workers.",
    "link": "https://www.foxnews.com/opinion/dei-dead-heres-what-should-come-next",
    "timestamp": "2025-05-07T09:00:42Z"
  },
  {
    "title": "LEE CARTER: The secret sauce of Trump's success that continues to mystify his most ardent critics",
    "description": "To truly grasp Donald Trump, you need to step back—not just from the headlines but from the impulse to interpret every word, post, or proposal literally.",
    "link": "https://www.foxnews.com/opinion/lee-carter-secret-sauce-trumps-success-continues-mystify-most-ardent-critics",
    "timestamp": "2025-05-07T09:00:40Z"
  },
  {
    "title": "How Canada’s new prime minister plans to take down America and impose the Great Reset",
    "description": "Canada's new Prime Minister Mark Carney is no friend to the US. He was a trustee of the World Economic Forum and wants ESG rules and digital currency to reset global capitalism.",
    "link": "https://www.foxnews.com/opinion/how-canadas-new-prime-minister-plans-take-down-america-impose-great-reset",
    "timestamp": "2025-05-07T09:00:38Z"
  },
  {
    "title": "Jen Psaki, the ex-Biden flack who defended his mental fitness, launches expanded role at MSNBC",
    "description": "Former Biden administration press secretary Jen Psaki took over MSNBC’s 9 p.m. ET on Tuesday through Fridays as \"The Rachel Maddow Show\" returned to only airing on Mondays.",
    "link": "https://www.foxnews.com/media/jen-psaki-ex-biden-flack-who-defended-his-mental-fitness-launches-expanded-role-msnbc",
    "timestamp": "2025-05-07T09:00:31Z"
  },
  {
    "title": "Biden Torches Trump In First Interview Since Leaving Office: ‘What The Hell’s Going On Here?'",
    "description": "The former president slammed one Trump moment as \"beneath America\" and accused him of “modern day appeasement” over Russia and Ukraine.",
    "link": "https://www.huffpost.com/entry/joe-biden-donald-trump-first-interview_n_681b12e4e4b035302f24d627",
    "timestamp": "2025-05-07T09:00:23Z"
  },
  {
    "title": "'Prioritise Peace': Nations Urge Restraint In India-Pakistan Clash",
    "description": "The violence was the worst to erupt between the nuclear-armed neighbours and arch-foes in two decades.",
    "link": "https://www.ibtimes.com/prioritise-peace-nations-urge-restraint-india-pakistan-clash-3772768",
    "timestamp": "2025-05-07T09:00:19Z"
  },
  {
    "title": "Do we even need this? Lawmakers get real about REAL ID mandate starting today",
    "description": "Lawmakers on Capitol Hill spoke with Fox News Digital about how their home states implemented the final phase of REAL ID, as President Donald Trump's administration signaled there would be no deadline extensions.",
    "link": "https://www.foxnews.com/politics/do-we-even-need-this-lawmakers-get-real-about-real-id-deadline-today",
    "timestamp": "2025-05-07T09:00:10Z"
  },
  {
    "title": "Smithsonian National Museum of African Art abruptly postpones LGBTQ+ exhibit",
    "description": "The Smithsonian National Museum of African Art has postponed an exhibition of works by LGBTQ+ African Artists, which was originally scheduled to open in late May to coincide with WorldPride, being held in Washington, D.C., this year.",
    "link": "https://www.advocate.com/news/smithsonian-postpones-lgbtq-african-exhibit",
    "timestamp": "2025-05-07T09:00:03Z"
  },
  {
    "title": "College Graduates Are Feeling Pessimistic About the Job Market. Here's Why",
    "description": "Why college grads are getting the cold shoulder from employers",
    "link": "https://www.newsweek.com/2025/05/16/jobs-class-2025-college-graduates-2067359.html",
    "timestamp": "2025-05-07T09:00:02Z"
  },
  {
    "title": "Brother of American Detained in China Tells US: 'Don't Just Talk About It'",
    "description": "The families of two Americans detained in China are urging the U.S. government to secure their loved-ones' release",
    "link": "https://www.newsweek.com/2025/05/16/brother-american-detained-china-tells-us-dont-just-talk-about-it-2067316.html",
    "timestamp": "2025-05-07T09:00:02Z"
  },
  {
    "title": "Trump Policies at Odds With ‘Make America Healthy Again’ Push",
    "description": "On the surface, President Donald Trump embraced the MAHA movement with a pledge to end the nation’s high rates of chronic disease. But the broader Trump agenda may prove to be the biggest barrier this effort confronts.",
    "link": "https://kffhealthnews.org/news/article/make-america-healthy-again-maha-trump-policies-cancer-alzheimers/",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "As Republicans Eye Sweeping Medicaid Cuts, Missouri Offers a Preview",
    "description": "Congressional Republicans are looking to cut at least $880 billion from a pool of federal funding that includes Medicaid — and the program is likely to take a major hit. A previous budget crunch in Missouri offers a window into how cuts ripple through people’…",
    "link": "https://kffhealthnews.org/news/article/medicaid-expansion-state-constitutions-congress-gop-republican-cuts-missouri/",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "Federal Reserve expected to keep interest rates steady as tariffs take effect",
    "description": "The Federal Reserve was expected to leave interest rates unchanged Wednesday as it continued to assess the impact of President Donald Trump’s tariffs.",
    "link": "https://www.nbcnews.com/business/economy/federal-reserve-interest-rate-decision-may-2025-what-to-know-rcna204854",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "Trump’s “Big Beautiful Bill” Could Backfire for His Party",
    "description": "Chris Lehmann\n\n\n\nThe long-awaited budget for the administration may end up scuttling key aspects of the president’s agenda.\r\n\n\r\n\n\nThe post Trump’s “Big Beautiful Bill” Could Backfire for His Party appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=554345",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "The Fight for the Soul of Video Games",
    "description": "Lewis Gordon\n\n\n\nMarijam Did’s Everything to Play For makes a case for rebuilding the culture of gaming, which has become infected with rotten politics. \r\n\n\r\n\n\nThe post The Fight for the Soul of Video Games appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=554171",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "Rise of the Crypto Keepers",
    "description": "Jacob Silverman\n\n\n\nThe promoters of scam currency spent more money than any other group in 2024. They're now realizing a massive return on investment in Donald Trump’s White House.\r\n\n\r\n\n\nThe post Rise of the Crypto Keepers appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=553992",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "How Trump’s Tariffs Could Affect Nike and Its Workers",
    "description": "by Matthew Kish, The Oregonian/OregonLive \n \n\n \n This article was produced in partnership with The Oregonian/OregonLive. Sign up for Dispatches to get stories like this one as soon as they are published.\n\n \n\n \n \n \n\n\n\n \nIn May 2015, President Barack Obama gave…",
    "link": "https://www.propublica.org/article/nike-trump-tariffs-impact-workers-prices",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "Democrat Raja Krishnamoorthi launches Illinois Senate campaign, joining a growing field",
    "description": "Rep. Raja Krishnamoorthi is launching a campaign for U.S. Senate in Illinois, jumping into a growing Democratic primary field for a coveted seat in the solidly blue state.",
    "link": "https://www.nbcnews.com/politics/2026-election/democrat-raja-krishnamoorthi-launches-illinois-senate-campaign-rcna204834",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "Republicans search for a backup plan in crucial Georgia Senate race",
    "description": "Georgia Gov. Brian Kemp’s decision to pass on a Senate bid has top Republican officials scrambling to find a backup plan and avoid a divisive primary — or, at the very least, one divisive candidate.",
    "link": "https://www.nbcnews.com/politics/2026-election/republicans-search-backup-plan-crucial-georgia-senate-race-rcna204975",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "Poland’s Trump Conundrum—and Vice Versa",
    "description": "Warsaw needs the U.S. even more than it hates and fears Russia. The U.S. president wants more European military spending, but when allies like Warsaw become stronger, they become more independent. \nThe post Poland’s Trump Conundrum—and Vice Versa appeared fir…",
    "link": "http://washingtonmonthly.com/2025/05/07/polands-trump-conundrum-and-vice-versa/",
    "timestamp": "2025-05-07T09:00:00Z"
  },
  {
    "title": "Hugh Hewitt Reveals The Policies That Allowed The Deep State To Emerge, And How To Fight It",
    "description": "By Tyler O'Neil, The Daily Signal | May 05, 2025\nPresident Donald Trump has taken aim at the rot in the federal bureaucracy, but he will continue to face an entrenched deep state because the rules protect it, warns a radio host who once helped President Ronal…",
    "link": "https://biztoc.com/x/a712762ab90321ee",
    "timestamp": "2025-05-07T08:58:17Z"
  },
  {
    "title": "Canadian PM Mark Carney and President Donald Trump agree to disagree about Canada becoming the 51st state: ‘It won’t be for sale. Ever.’",
    "description": "U.S. President Donald Trump and Canadian Prime Minister Mark Carney faced off in the Oval Office on Tuesday and showed no signs of retreating from their gaping differences in an ongoing trade war that has shattered decades of trust between the two countries.\n…",
    "link": "https://biztoc.com/x/ac75e0a7d65d5c62",
    "timestamp": "2025-05-07T08:58:10Z"
  },
  {
    "title": "How Reality Television Warps Our Understanding of Political and Economic Realities",
    "description": "In the television industry, ratings are often the most valued currency. In political discourse, however, the sheer quantity of onlookers pales in significance. Instead, its composition holds sway. Consider the likes of news and talk programming such as Fox & …",
    "link": "https://lithub.com/how-reality-television-warps-our-understanding-of-political-and-economic-realities/",
    "timestamp": "2025-05-07T08:58:09Z"
  },
  {
    "title": "Trump Administration Plans To End Energy Star Program That Helped Americans Save $500 Billion In Energy Costs: Report",
    "description": "The Donald Trump administration is planning to terminate the Energy Star program, which certifies energy-efficient home appliances.\nLaunched in 1992, it has helped American businesses and families save more than $500 billion in energy costs and reduce emissio…",
    "link": "https://biztoc.com/x/45d31dd306b2b6df",
    "timestamp": "2025-05-07T08:58:05Z"
  },
  {
    "title": "How Trump Could Send The Perfect Message On Alcatraz",
    "description": "By Jarrett Stepman, The Daily Signal | May 05, 2025\nIt’s time to restore justice in America. That’s what President Donald Trump essentially said on social media on Sunday when he announced that he’d be reopening Alcatraz prison, which has been closed for over…",
    "link": "https://biztoc.com/x/b361f6002967639e",
    "timestamp": "2025-05-07T08:57:50Z"
  },
  {
    "title": "NSO Group must pay WhatsApp over $167M in damages for attacks on its users",
    "description": "NSO Group must pay WhatsApp over $167M in damages for a 2019 hack targeting 1,400+ users, per U.S. jury ruling after a five-year legal battle. A U.S. jury ordered NSO Group to pay WhatsApp over $167M for using Pegasus spyware to target over 1,400 people, viol…",
    "link": "https://securityaffairs.com/177543/laws-and-regulations/nso-group-must-pay-whatsapp-over-167m-in-damages-for-attacks-on-its-users.html",
    "timestamp": "2025-05-07T08:57:08Z"
  },
  {
    "title": "'So much fear': Pakistanis recount destruction of Indian air strikes",
    "description": "India launched the strikes early on Wednesday, saying it was targeting \"terrorist camps\" that served as recruitment centres. Pakistan says that was an \"act of war\".",
    "link": "https://www.abc.net.au/news/2025-05-07/pakistani-controlled-kashmir-locals-recount-indian-air-strikes/105265996",
    "timestamp": "2025-05-07T08:52:32Z"
  },
  {
    "title": "Boris Pistorius, party soldier in charge of Germany's defence",
    "description": "Germany's Defence Minister Boris Pistorius -- who has led the push to make the military \"ready for war\" so it doesn't have to fight one -- was the only cabinet member to survive the new government taking office.",
    "link": "https://www.thelocal.de/20250507/boris-pistorius-party-soldier-in-charge-of-germanys-defence",
    "timestamp": "2025-05-07T08:46:46Z"
  },
  {
    "title": "Ukraine, Russia trade aerial attacks ahead of WWII victory parade",
    "description": "Russia and Ukraine traded a barrage of drone strikes overnight on Wednesday, in attacks that killed two in Kiev and forced Moscow to shut major airports hours before a swathe of foreign leaders was to arrive.",
    "link": "https://www.hurriyetdailynews.com/ukraine-russia-trade-aerial-attacks-ahead-of-wwii-victory-parade-208898",
    "timestamp": "2025-05-07T08:46:45Z"
  },
  {
    "title": "Trump's new executive orders may hit Indian Pharma exports, reshape global drug supply chains: Report",
    "description": "The recent executive orders on pharma issued by President Donald Trump are expected to create significant challenges for Indian pharmaceutical companies, especially those operating in the U.S. generic drug market, according to a report by Nuvama Research.",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/trumps-new-executive-orders-may-hit-indian-pharma-exports-reshape-global-drug-supply-chains-report/articleshow/120959188.cms",
    "timestamp": "2025-05-07T08:45:36Z"
  },
  {
    "title": "Ex-BOJ Gov. Kuroda urges calm response to Trump tariffs",
    "description": "\"It's better not to be worked up by every little thing, but to sit down and respond,\" Kuroda said, referring to frequent changes in U.S. tariff policy.",
    "link": "https://www.japantimes.co.jp/business/2025/05/07/economy/ex-boj-governor-kuroda-us-tariffs/",
    "timestamp": "2025-05-07T08:40:00Z"
  },
  {
    "title": "BMW upbeat on riding out US tariff chaos",
    "description": "German premium carmaker BMW said Wednesday that it expected to largely ride out the impact of US tariffs over the coming year, and that it hoped to soften their impact. CEO Oliver Zipse told reporters on a call that BMW was lobbying hard for free trade and ex…",
    "link": "https://www.digitaljournal.com/world/bmw-upbeat-on-riding-out-us-tariff-chaos/article",
    "timestamp": "2025-05-07T08:37:32Z"
  },
  {
    "title": "BMW Upbeat On Riding Out US Tariff Chaos",
    "description": "German premium carmaker BMW said Wednesday that it expected to largely ride out the impact of US tariffs over the coming year, and that it hoped to soften their impact.",
    "link": "https://www.ibtimes.com/bmw-upbeat-riding-out-us-tariff-chaos-3772765",
    "timestamp": "2025-05-07T08:36:10Z"
  },
  {
    "title": "Donald Trump Suffers Double Legal Blow In Hours",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump suffered two legal setbacks on Tuesday when one federal judge in Rhode Island halted some of his cuts at federal agencies, and another in Manhattan blocked him from canceling unspent aid…",
    "link": "https://biztoc.com/x/edc89ad2955b64da",
    "timestamp": "2025-05-07T08:35:55Z"
  },
  {
    "title": "20 attorneys general ask federal judge to reverse deep cuts to US Health and Human Services",
    "description": "Attorneys general in 19 states and Washington, D.C., are challenging cuts to the U.S. Health and Human Services agency.",
    "link": "https://www.wbrc.com/2025/05/07/20-attorneys-general-ask-federal-judge-reverse-deep-cuts-us-health-human-services/",
    "timestamp": "2025-05-07T08:35:24Z"
  },
  {
    "title": "Donald Trump Suffers Double Legal Blow In Hours",
    "description": "Two federal judges blocked Trump and his administration's actions.",
    "link": "https://www.newsweek.com/donald-trump-suffers-double-legal-blow-hours-2068944",
    "timestamp": "2025-05-07T08:35:05Z"
  },
  {
    "title": "Stock-market investors aren't pricing in a likely recession this summer, former top IMF economist Ken Rogoff says",
    "description": "\"I think we'll know by the end of the summer what's going on,\" Ken Rogoff told BI.",
    "link": "https://www.businessinsider.com/recession-odds-trade-war-trump-stock-market-overvalued-ken-rogoff-2025-5",
    "timestamp": "2025-05-07T08:30:02Z"
  },
  {
    "title": "Coming this summer: Record-breaking heat and plenty of hurricanes",
    "description": "Forecasters are predicting higher temperatures across the U.S. and up to 10 hurricanes. Cutting federal programs could leave people even more vulnerable.",
    "link": "http://grist.org/extreme-heat/summer-record-breaking-heat-hurricanes-liheap/",
    "timestamp": "2025-05-07T08:30:00Z"
  },
  {
    "title": "'No more dudes in dresses': Pete Hegseth after US Supreme Court's decision on transgender military ban",
    "description": "The Trump administration can begin to enforce a ban on transgender troops serving in the military while a challenge to the policy plays out in the courts, the supreme court ruled on Tuesday. This is a significant decision that could lead to the discharge of t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-supreme-court-trump-administration-transgender-military-ban-no-more-dudes-in-dresses-pete-hegseth/articleshow/120958274.cms",
    "timestamp": "2025-05-07T08:29:46Z"
  },
  {
    "title": "'World Cup can be incentive for Russia to end war'",
    "description": "US President Donald Trump says playing at the 2026 World Cup could be an \"incentive\" for Russia to end the war in Ukraine.",
    "link": "https://www.bbc.com/sport/football/articles/cpdzd2pqgvwo",
    "timestamp": "2025-05-07T08:29:11Z"
  },
  {
    "title": "Malaysia to take prudent approach in addressing US tariff issue, says PM",
    "description": "PETALING JAYA: Malaysia will be taking a careful and prudent approach in addressing the tariff issue imposed by the United States, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/05/07/malaysia-to-take-prudent-approach-in-addressing-us-tariff-issue-says-pm",
    "timestamp": "2025-05-07T08:29:00Z"
  },
  {
    "title": "Fighter jet landing on USS Harry S. Truman aircraft carrier goes overboard, forcing pilots to eject",
    "description": "An F/A-18 fighter jet went overboard the USS Harry S. Truman in the Red Sea during a failed landing, prompting the pilots to eject with minor injuries. This incident marks another setback for the Truman, crucial in the U.S. airstrike campaign against Yemen's …",
    "link": "https://economictimes.indiatimes.com/news/defence/fighter-jet-landing-on-uss-harry-s-truman-aircraft-carrier-goes-overboard-forcing-pilots-to-eject/articleshow/120958280.cms",
    "timestamp": "2025-05-07T08:23:00Z"
  },
  {
    "title": "Ukraine, Russia Trade Aerial Attacks Ahead Of WWII Victory Parade",
    "description": "Russia and Ukraine traded a barrage of drone strikes overnight on Wednesday, in attacks that killed two in Kyiv and forced Moscow to shut major airports hours before a swathe of foreign leaders was to arrive.",
    "link": "https://www.ibtimes.com/ukraine-russia-trade-aerial-attacks-ahead-wwii-victory-parade-3772762",
    "timestamp": "2025-05-07T08:21:17Z"
  },
  {
    "title": "A ‘green backlash’ helped conservatives win in Germany. What happens now?",
    "description": "Conservatives led by Friedrich Merz remain committed to renewables, but say \"we must and we will change\" an economic policy focused on climate.",
    "link": "http://grist.org/international/germany-friedrich-merz-renewables-electricity-price/",
    "timestamp": "2025-05-07T08:15:00Z"
  },
  {
    "title": "Is CUSMA the best path out of the trade war with the U.S.?",
    "description": "Donald Trump defended the Canada-US-Mexico Free Trade agreement and seems to have opened the door to jump starting talks to end the trade war.",
    "link": "https://biztoc.com/x/a8dd556f4152bcf6",
    "timestamp": "2025-05-07T08:13:33Z"
  },
  {
    "title": "Fed to hold rates steady as pressures mount",
    "description": "The Federal Reserve is expected to keep interest rates unchanged, citing high uncertainty due to trade policies. Despite concerns over tariffs, recent data shows stable inflation and employment. Markets anticipate future rate cuts. Fed Chair Powell may face q…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-to-hold-rates-steady-as-pressures-mount/articleshow/120957698.cms",
    "timestamp": "2025-05-07T08:13:10Z"
  }
]