[
  {
    "title": "Trump ‘advises’ Takaichi not to provoke China on Taiwan",
    "description": "U.S. President Donald Trump advised Japanese Prime Minister Sanae Takaichi not to provoke China over Taiwan's sovereignty, the Wall Street Journal reported on Nov. 27, after a diplomatic spat between Tokyo and Beijing.",
    "link": "https://www.hurriyetdailynews.com/trump-advises-takaichi-not-to-provoke-china-on-taiwan-216202",
    "timestamp": "2025-11-27T10:34:46Z"
  },
  {
    "title": "Rahmanullah Lakanwal: Who is the National Guard shooting suspect and what happened in DC?",
    "description": "A 29-year-old Afghan national named Rahmanullah Lakanwal has been named in US media as the suepect of the attack",
    "link": "https://www.the-independent.com/news/world/americas/crime/rahmanullah-lakanwal-national-guard-shooting-dc-suspect-b2873488.html",
    "timestamp": "2025-11-27T10:34:42Z"
  },
  {
    "title": "This overlooked exchange hints Trump is eyeing another appalling coup",
    "description": "I just want to put up top that this story is about what it sounds like, which is fantastical and like something out of a spy thriller, and yet there’s nothing we can put past this administration. But it’s also about how The New York Times missed — or chose to…",
    "link": "https://www.rawstory.com/raw-investigates/trump-bolsonaro/",
    "timestamp": "2025-11-27T10:30:02Z"
  },
  {
    "title": "Mary Trump Spots The Tell In Uncle's Increasing Meltdowns At Women Reporters",
    "description": "Donald Trump's “misogynistic attacks against reporters in particular are increasing and that means a couple of things,\" said the president's niece",
    "link": "https://www.huffpost.com/entry/mary-trump-donald-trump-attacks-women-reporters_n_69282235e4b08a35c1aeff7b",
    "timestamp": "2025-11-27T10:28:16Z"
  },
  {
    "title": "Venezuela bans six major airlines as tensions escalate",
    "description": "The affected carriers ceased flying to Venezuela after the US warned of heightened military activity.",
    "link": "https://www.bbc.com/news/articles/cd0keyern0do",
    "timestamp": "2025-11-27T10:22:06Z"
  },
  {
    "title": "How Trump targeting these Democrats could backfire (Politico)",
    "description": "Politico:\nHow Trump targeting these Democrats could backfire … “Pete Hegseth and Donald Trump are providing Mark Kelly with the kind of visibility that almost no amount of money could buy,” said Barrett Marson, an Arizona-based Republican strategist, referrin…",
    "link": "https://www.memeorandum.com/251127/p4",
    "timestamp": "2025-11-27T10:10:02Z"
  },
  {
    "title": "This Thanksgiving, Affordability Isn’t Just About the Turkey. It’s Everyday, Every Bill, Every Choice | Opinion",
    "description": "As families gather around Thanksgiving tables, they're living a hard truth that no economist needs to explain: Everything costs more, and paychecks cover less.\nLast year, President Donald Trump and his allies swept into office promising to lower prices on \"da…",
    "link": "https://biztoc.com/x/224fc55f232b5055",
    "timestamp": "2025-11-27T10:09:08Z"
  },
  {
    "title": "Ukraine War Live Updates—Russia Praises Trump 'Realism', Putin Promises Allies New Weapons",
    "description": "Work continues in the background over Thanksgiving between the U.S., Ukraine, and Russia to bridge the gaps and reach a consensus on a peace deal that ends the ongoing war, which is set to enter its fourth winter unless an agreement is found soon. But U.S. Pr…",
    "link": "https://biztoc.com/x/3c73e5713755fe8d",
    "timestamp": "2025-11-27T10:09:07Z"
  },
  {
    "title": "Democrats bet pricey holidays spoil Trump’s economic messaging",
    "description": "As Americans fill their carts with Thanksgiving staples and Black Friday deals this week, Democrats believe it could be an inflection point in their effort to take on President Donald Trump, underscoring for voters that Trump has not fulfilled a central campa…",
    "link": "https://biztoc.com/x/167cd795733321a9",
    "timestamp": "2025-11-27T10:08:26Z"
  },
  {
    "title": "Maduro says US 'cannot defeat invincible' Venezuela amid deepening tensions",
    "description": "Venezuelan President Nicolas Maduro says the United States \"cannot defeat\" his \"invincible\" country, denouncing US military pressure and new terrorism accusations as tensions escalate across the southern Caribbean.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251126-presstv06.htm",
    "timestamp": "2025-11-27T10:06:38Z"
  },
  {
    "title": "Will 2026 Bring Financial Crisis?",
    "description": "From US President Donald Trump’s weaponization of trade to the erosion of US Treasuries’ status as safe-haven assets and breakneck investment in AI, the last year has shaken the foundations of the postwar global economy. As 2025 comes to an end, we asked PS c…",
    "link": "https://www.project-syndicate.org/onpoint/will-2026-bring-financial-crisis",
    "timestamp": "2025-11-27T10:05:06Z"
  },
  {
    "title": "Ukraine/Russia: Peace Efforts Should Put Human Impact First",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Rally in Kyiv, Ukraine in support of Ukrainian women being held in Russian detention, June 19, 2025.\n © 2025 Cover Images via AP Images\n \n \n\n\n \n(Berlin, November 27, 2025) – The People First Campaign on November 26, …",
    "link": "https://www.hrw.org/news/2025/11/27/ukraine/russia-peace-efforts-should-put-human-impact-first",
    "timestamp": "2025-11-27T10:05:00Z"
  },
  {
    "title": "All the Bad Things That Can Happen When You Generate a Sora Video",
    "description": "It's fun to mess around with cutting-edge AI. Here's why you still maybe shouldn't.",
    "link": "https://gizmodo.com/all-the-bad-things-that-can-happen-when-you-generate-a-sora-video-2000691886",
    "timestamp": "2025-11-27T10:00:47Z"
  },
  {
    "title": "Larijani: 12-day war was US-Israeli plot, Iran emerged victorious",
    "description": "Secretary of Iran's Supreme National Security Council (SNSC) Ali Larijani says the 12-day war against the Islamic republic in June was a \"plot\" hatched by the United States and Israel years ago, stressing that Iran emerged victorious while the occupying entit…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/11/iran-251126-presstv04.htm",
    "timestamp": "2025-11-27T10:00:16Z"
  },
  {
    "title": "BROOKE ROLLINS: Your Thanksgiving dinner costs less and that’s a reason to give thanks",
    "description": "Trump administration official says Thanksgiving dinner costs dropped to $55.18 under Trump, down from $64.05 during Biden presidency amid inflation.",
    "link": "https://www.foxnews.com/opinion/brooke-rollins-your-thanksgiving-dinner-costs-less-thats-reason-give-thanks",
    "timestamp": "2025-11-27T10:00:14Z"
  },
  {
    "title": "Larijani says US-Israeli plot was behind recent 12-day war against Iran",
    "description": "Ali Larijani, Secretary of Iran's Supreme National Security Council, says the recent 12-day imposed war against Iran was the result of a \"US-Israeli conspiracy\" planned years in advance.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/11/iran-251126-irna02.htm",
    "timestamp": "2025-11-27T10:00:12Z"
  },
  {
    "title": "Will Technology Save Us From a Nuclear Attack?",
    "description": "Ashley Gate, William D. Hartung\n\n\n\nSo far, the Golden Dome seems more like a marketing concept designed to enrich arms contractors and burnish Trump’s image rather than a carefully thought-out defense program.\r\n\n\r\n\n\nThe post Will Technology Save Us From a Nuc…",
    "link": "https://www.thenation.com/?post_type=article&p=578771",
    "timestamp": "2025-11-27T10:00:00Z"
  },
  {
    "title": "For Voters in Kentucky, Trump Is Losing His Luster",
    "description": "Zachary Clifton\n\n\n\nIn Martin County, the government shutdown and attacks on food stamps have exposed Donald Trump’s empty promises. To many, that makes him just another politician.\r\n\n\r\n\n\nThe post For Voters in Kentucky, Trump Is Losing His Luster appeared fir…",
    "link": "https://www.thenation.com/?post_type=article&p=578685",
    "timestamp": "2025-11-27T10:00:00Z"
  },
  {
    "title": "US-Canada Relations Have Hit Rock Bottom",
    "description": "The Trump administration’s policies have damaged the economies of both countries, says former U.S. Ambassador to Canada James Blanchard.\nThe post US-Canada Relations Have Hit Rock Bottom appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/27/us-canada-relations-rock-bottom/",
    "timestamp": "2025-11-27T10:00:00Z"
  },
  {
    "title": "Beyond America First",
    "description": "Countries in the Global South increasingly view President Trump’s “America First” foreign economic policies as both a coercive force and a catalyst for greater economic autonomy.\nThe post Beyond America First appeared first on The American Prospect.",
    "link": "http://prospect.org/2025/11/27/beyond-america-first/",
    "timestamp": "2025-11-27T10:00:00Z"
  },
  {
    "title": "Trump’s Washington Is Ghosting States and Cities",
    "description": "It’s time for state and local governments to think outside the box about how to respond. Here are some ideas that are already helping and some that could. \nThe post Trump’s Washington Is Ghosting States and Cities  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/27/trump-washington-ghosting-states-cities/",
    "timestamp": "2025-11-27T10:00:00Z"
  },
  {
    "title": "Negotiation means dialogue, not dictation; US has to abandon inflated demands: FM",
    "description": "Foreign Minister Abbas Araghchi says Iran remains open to serious negotiations with the United States, but only if Washington shifts from imposing demands to engaging in equitable and mutually beneficial dialogue.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/11/iran-251126-presstv02.htm",
    "timestamp": "2025-11-27T09:59:52Z"
  },
  {
    "title": "Chinese FM responds to whether China requested US to convey messages to Japan during China-US leaders' phone call",
    "description": "When asked whether China requested the US to convey any messages to Japan during the phone call between the two leaders given the US-Japan leaders' call took place after the China-US leaders' call, Chinese Foreign Ministry spokesperson Mao Ning said at the pr…",
    "link": "https://www.globalsecurity.org/wmd/library/news/japan/2025/japan-251126-globaltimes03.htm",
    "timestamp": "2025-11-27T09:59:17Z"
  },
  {
    "title": "World Leader Absolutely Rips Trump’s Social Media ‘Insults’",
    "description": "President Donald Trump warned South Africa that it will not be invited to next year’s G20 summit in Miami after what he perceived to be a snub against the...",
    "link": "https://www.thedailybeast.com/world-leader-lashes-regrettable-trump-post-after-g20-snub/",
    "timestamp": "2025-11-27T09:59:13Z"
  },
  {
    "title": "Trump had heated exchange with MBS over Israel normalization demand: Report",
    "description": "Donald Trump's meeting with Saudi Crown Prince Mohammed bin Salman (MBS) grew tense last week after the prince pushed back at the US president's demand that the kingdom formally normalize relations with Israel, a report says.",
    "link": "https://www.globalsecurity.org/wmd/library/news/saudi/2025/saudi-251126-presstv01.htm",
    "timestamp": "2025-11-27T09:56:56Z"
  },
  {
    "title": "White House locked down after 2 National Guards shot in central Washington; Trump warns suspect 'will pay a very steep price'",
    "description": "Two National Guard members were shot on Wednesday afternoon local time in what appeared to be a \"targeted\" attack near the White House and are in critical condition, Washington Mayor Muriel Bowser said. The gunman was also shot and is in custody, authorities …",
    "link": "https://www.globalsecurity.org/security/library/news/2025/11/sec-251127-globaltimes01.htm",
    "timestamp": "2025-11-27T09:56:26Z"
  },
  {
    "title": "2 U.S. National Guard members shot near White House, suspect in custody",
    "description": "Two U.S. National Guard members were shot near the White House on Wednesday afternoon and a suspect is in custody, according to local authorities.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/11/sec-251127-pdo01.htm",
    "timestamp": "2025-11-27T09:56:22Z"
  },
  {
    "title": "Hegseth to Order 500 Additional Guardsmen to D.C. Following Shooting of Two Soldiers",
    "description": "Secretary of War Pete Hegseth this afternoon said that President Donald J. Trump has requested he order 500 additional National Guardsmen to Washington in the wake of today's shooting of two guardsmen near the White House.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/11/sec-251126-dodnews01.htm",
    "timestamp": "2025-11-27T09:56:16Z"
  },
  {
    "title": "Kremlin: Nothing Bad in Transcripts of Alleged Ushakov-Witkoff Talk Leaked by Media",
    "description": "There is nothing terrible in the content of the transcripts of alleged conversations between Russian and US officials published in the media, Kremlin spokesman Dmitry Peskov said on Wednesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/11/ukraine-251126-sputnik02.htm",
    "timestamp": "2025-11-27T09:53:04Z"
  },
  {
    "title": "Donald Trump Jr. Accuses Witkoff's Critics of Trying to Disrupt Peace Deal In Ukraine",
    "description": "US President Donald Trump's son, Donald Trump Jr., said on Wednesday that US Special Envoy Steve Witkoff's critics are trying to derail the US-proposed peace plan on Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/11/ukraine-251126-sputnik01.htm",
    "timestamp": "2025-11-27T09:53:03Z"
  },
  {
    "title": "EU could hit X with fine before 2025 ends",
    "description": "The European Union could fine Elon Musk’s X platform for breaking its digital rules by the end of 2025 — two years into a probe that has tested the bloc’s resolve to police the online space. X was the target of the EU’s first ever investigation under a major …",
    "link": "https://www.digitaljournal.com/world/eu-could-hit-x-with-fine-before-2025-ends/article",
    "timestamp": "2025-11-27T09:52:20Z"
  },
  {
    "title": "Q2 GDP blockbuster or slow burn? India braces for Friday show",
    "description": "India Q2 GDP: India's Gross Domestic Product numbers for the second quarter are set to be released on Friday. Expectations are high for a robust growth figure, possibly surpassing the Reserve Bank of India's projection. This strong performance is anticipated …",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/q2-gdp-blockbuster-or-slow-burn-india-braces-for-friday-show/articleshow/125610638.cms",
    "timestamp": "2025-11-27T09:52:12Z"
  },
  {
    "title": "Mainland spokesperson slams Lai's $40B extra 'defense budget' to push Taiwan toward disaster; island voices accuse him of 'selling out' Taiwan",
    "description": "When asked to comment on Taiwan regional leader Lai Ching-te's recent article in The Washington Post, in which he claimed to introduce a \"historic $40 billion supplementary defense budget\" to respond to mainland's \"threat\" and that convened a meeting on the m…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251127-globaltimes02.htm",
    "timestamp": "2025-11-27T09:51:05Z"
  },
  {
    "title": "Mainland spokesperson underscores significance of Xi's remarks on Taiwan in phone call with Trump",
    "description": "Chinese President Xi Jinping's remarks during the phone call with U.S. President Donald Trump are of great guiding significance for the Chinese mainland's work related to Taiwan, a mainland spokesperson said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251126-pdo03.htm",
    "timestamp": "2025-11-27T09:50:58Z"
  },
  {
    "title": "Mainland spokesperson slams Lai's $40B 'defense budget' to push Taiwan toward disaster; island voices accuse him of 'selling out' Taiwan",
    "description": "When asked to comment on Taiwan regional leader Lai Ching-te's recent article in The Washington Post, in which he claimed to introduce a \"historic $40 billion supplementary defense budget\" to respond to mainland's \"threat\" and that convened a meeting on the m…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251126-globaltimes05.htm",
    "timestamp": "2025-11-27T09:50:46Z"
  },
  {
    "title": "KMT slams Lai's 'astronomical' US$40 billion defense proposal",
    "description": "Opposition Kuomintang (KMT) lawmakers criticized President Lai Ching-te's (賴清德) \"astronomical\" US$40 billion defense proposal as lacking detail, and questioned whether it was part of a quid pro quo with U.S. President Donald Trump to allow Lai to transit thro…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251126-cna04.htm",
    "timestamp": "2025-11-27T09:50:27Z"
  },
  {
    "title": "Lai unveils plan to budget US$40 billion to bolster Taiwan's defense",
    "description": "President Lai Ching-te (賴清德) on Wednesday proposed a NT$1.25 trillion (US$39.85 billion) special defense budget to fund the construction of a multilayered \"T-Dome\" air defense network and strengthen Taiwan's overall defense posture over the next eight years.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251126-cna03.htm",
    "timestamp": "2025-11-27T09:50:25Z"
  },
  {
    "title": "New Dawn Open Thread: We Need to Talk Like Winners",
    "description": "\"As we watch the consequences of the Trump presidency play out in real time, Democrats face a critical inflection point,\" @govandybeshear.bsky.social writes. \"We must meet this moment with urgency and focus — and with the clear and tangible vision it requires…",
    "link": "https://balloon-juice.com/2025/11/27/new-dawn-open-thread-we-need-to-talk-like-winners/",
    "timestamp": "2025-11-27T09:38:29Z"
  },
  {
    "title": "China warns internal affairs off limits after report Trump asks Takaichi to 'temper' tone",
    "description": "Beijing has warned against foreign interference in its internal affairs following reports that US President Donald Trump privately pressed Japanese Prime...",
    "link": "https://www.yahoo.com/news/articles/china-warns-internal-affairs-off-093000914.html",
    "timestamp": "2025-11-27T09:30:00Z"
  },
  {
    "title": "African nation not ‘worthy’ of membership ‘anywhere’ – Trump",
    "description": "US President Donald Trump has announced a halt to all payments and subsidies to South Africa amid escalating diplomatic tensions Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/628512-trump-south-africa-unworthy-membership-comment/",
    "timestamp": "2025-11-27T09:29:40Z"
  },
  {
    "title": "What Is Operation Allies Welcome, and How Does It Relate to the DC Shooter?",
    "description": "President Donald Trump has said everyone who arrived in the U.S. from Afghanistan under the Biden administration must be \"re-examined\" after the shooting of two National Guard members in Washington D.C.\nFederal officials have confirmed that 29-year-old Afghan…",
    "link": "https://biztoc.com/x/e1aa0e848a88d1a2",
    "timestamp": "2025-11-27T09:24:08Z"
  },
  {
    "title": "US warned Europeans about danger of dragging out Ukraine conflict – NYT",
    "description": "US Army Secretary Dan Driscoll reportedly told European diplomats that Russia’s ability to produce long-range missiles is only increasing Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628517-russian-arms-production-nyt/",
    "timestamp": "2025-11-27T09:04:42Z"
  },
  {
    "title": "Trump declares ban on South Africa from attending next G20",
    "description": "The presidency of the G20 was formally handed over by South Africa to the US this week.",
    "link": "https://www.thejournal.ie/trump-g20-south-africa-6886771-Nov2025/",
    "timestamp": "2025-11-27T09:01:23Z"
  },
  {
    "title": "The 14-month tortuous journey for Sensex from 85,000 to 86,000, how it played out",
    "description": "Experts have cautioned investors to guard against over-enthusiasm or FOMO (fear of missing out) buying, as the rally continues to be narrow.",
    "link": "https://indianexpress.com/article/explained/explained-economics/sensex-journey-86000-how-played-out-10389096/",
    "timestamp": "2025-11-27T08:55:08Z"
  },
  {
    "title": "US wants Ukraine peace deal before security guarantees – Politico",
    "description": "Washington wants Kiev to sign a peace deal before it agrees to any security guarantees, Politico reports, citing Marco Rubio Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628514-us-ukraine-deal-before-guarantees/",
    "timestamp": "2025-11-27T08:54:27Z"
  },
  {
    "title": "South Africa's Cyril Ramaphosa hits back after Donald Trump says US won't invite it for G20 summit",
    "description": "The US boycotted the G20 summit in Johannesburg over widely discredited claims of persecution of the white minority.",
    "link": "https://www.bbc.co.uk/news/articles/cq8dq47j5y8o",
    "timestamp": "2025-11-27T08:49:47Z"
  },
  {
    "title": "South Africa hits back after Trump says US won't invite it for G20 next year",
    "description": "The US boycotted the G20 summit in Johannesburg over widely discredited claims of persecution of the white minority.",
    "link": "https://www.bbc.com/news/articles/cq8dq47j5y8o",
    "timestamp": "2025-11-27T08:49:47Z"
  },
  {
    "title": "Venezuela revokes flight rights for six airlines amid escalating US tensions",
    "description": "(Reuters) -Venezuela has revoked operating rights for six major international airlines after they suspended flights to the country following a warning from the U.S. Federal Aviation Administration. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/27/venezuela-revokes-flight-rights-for-six-airlines-amid-escalating-us-tensions",
    "timestamp": "2025-11-27T08:46:00Z"
  },
  {
    "title": "Lucas: Healey, Wu aren’t joining Trump’s buddy list",
    "description": "While Mamdani faces criticism from militant Trump-hating socialists for cozying up to Trump, it was a bold move on his part. Mamdani put the policy of helping New York over the politics of hating Trump.\nOthers should follow suit.",
    "link": "https://www.bostonherald.com/2025/11/27/lucas-healey-wu-arent-joining-trumps-buddy-list/",
    "timestamp": "2025-11-27T08:42:16Z"
  },
  {
    "title": "Canada’s prime minister announces supports for lumber, steel sectors hit by U.S. tariffs",
    "description": "Canada’s prime minister announces supports for lumber, steel sectors hit by U.S. tariffs\nTORONTO (AP) — Canadian Prime Minister Mark Carney announced Wednesday new supports for the steel and lumber industries hit hard by U.S. tariffs.\nU.S. President Donald Tr…",
    "link": "https://biztoc.com/x/043b54a114f0587a",
    "timestamp": "2025-11-27T08:39:08Z"
  },
  {
    "title": "National Guard shooting suspect served alongside US army in Afghanistan: US media",
    "description": "A man suspected of shooting two National Guard soldiers near the White House was an Afghan national who had served alongside American troops in Afghanistan, US media reported Wednesday, as Washington labelled the incident an “act of terror.” Rahmanullah Lakan…",
    "link": "https://www.digitaljournal.com/world/national-guard-shooting-suspect-served-alongside-us-army-in-afghanistan-us-media/article",
    "timestamp": "2025-11-27T08:32:20Z"
  },
  {
    "title": "“Making America Great Again” by Reducing the World to Ashes?",
    "description": "In the event of a nuclear war, there will be no chances, there will be no survivors – all will be obliterated… nuclear devastation is not science fiction – it is a matter of fact. The world now stands on the brink of the final abyss. Let us all resolve to tak…",
    "link": "https://www.globalresearch.ca/making-america-great-again-by-reducing-the-world-to-ashes/5585675",
    "timestamp": "2025-11-27T08:31:38Z"
  },
  {
    "title": "India’s merchandise exports aren’t too exposed to the US—we need to watch out for services",
    "description": "In the face of Trump’s ever-shifting policies, India’s real vulnerability isn’t merchandise shipments, but service exports. We need to double down on diversifying these even as we pursue a trade deal with Washington.",
    "link": "https://www.livemint.com/opinion/online-views/india-services-exports-merchandise-exposed-us-america-washington-shipments-trade-cargo-11764156352288.html",
    "timestamp": "2025-11-27T08:30:17Z"
  },
  {
    "title": "Five Times Trump Lashed Out At Female Journalists — His New York Times Attack Is Just The Latest",
    "description": "President Donald Trump‘s response on Wednesday to a New York Times report examining signs of aging in his public schedule offered more than a rebuttal of the story. \nHis Truth Social post targeting co-author Katie Rogers became the latest entry in a growing l…",
    "link": "https://biztoc.com/x/4d981564efea9e0e",
    "timestamp": "2025-11-27T08:28:21Z"
  },
  {
    "title": "South Africa slams Trump’s G20 ban as punitive",
    "description": "South Africa denounced US President Donald Trump’s decision to bar it from the 2026 G20 summit, calling the move punitive and driven by distortions that erode global cooperation.  The two countries are at odds over a range of domestic and foreign policies — a…",
    "link": "https://www.digitaljournal.com/world/south-africa-slams-trumps-g20-ban-as-punitive/article",
    "timestamp": "2025-11-27T08:17:20Z"
  },
  {
    "title": "Japan denies Trump told Takaichi to soften China tone",
    "description": "Japanese Chief Cabinet Secretary Minoru Kihara rejected a Wall Street Journal report on Thursday claiming US President Donald Trump urged Prime Minister Sanae Takaichi to soften her tone on Taiwan dur...",
    "link": "https://biztoc.com/x/7acd69deb21c9757",
    "timestamp": "2025-11-27T08:17:15Z"
  },
  {
    "title": "Trump Says D.C. Shooting Is An Act Of Terror’—Immigration From Afghanistan Halted",
    "description": "Trump said the suspected gunman is an Afghan national who entered the U.S. in September 2021.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/11/27/trump-says-dc-shooting-is-an-act-of-terror-immigration-from-afghanistan-halted/",
    "timestamp": "2025-11-27T08:16:33Z"
  },
  {
    "title": "Trump Says He Won't Invite South Africa To 2026 G20 Summit At His Doral Golf Resort",
    "description": "“South Africa has demonstrated to the World they are not a country worthy of Membership anywhere,” Trump wrote on his Truth Social platform.",
    "link": "https://www.huffpost.com/entry/trump-g20-south-africa_n_692803b0e4b08a35c1aef147",
    "timestamp": "2025-11-27T08:06:30Z"
  },
  {
    "title": "Trump to review Afghan immigrants after Washington DC shooting",
    "description": "US President Donald Trump has called for a review of all Afghans who entered the US under the Biden administration.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/27/trump-to-review-afghan-immigrants-after-washington-dc-shooting",
    "timestamp": "2025-11-27T07:50:12Z"
  },
  {
    "title": "Trump calls for all Afghan refugees to be investigated after shooting of two National Guard members",
    "description": "President Donald Trump called for the reinvestigation of all Afghan refugees who entered under the Biden administration after the shooting of two National Guard members in Washington DC.",
    "link": "https://www.independent.ie/world-news/north-america/trump-calls-for-all-afghan-refugees-to-be-investigated-after-shooting-of-two-national-guard-members/a2029528889.html",
    "timestamp": "2025-11-27T07:38:25Z"
  },
  {
    "title": "NYT cites Trump's 'shorter days, signs of fatigue, realities of ageing'. Trump hits back",
    "description": "The US president has always used his stamina and energy as a political strength. But that image is getting harder for him to sustain. NYT analysed his schedule to find that nearly a year into his second term, Americans see Trump less than they used to, and wh…",
    "link": "https://timesofindia.indiatimes.com/toi-plus/international/nyt-cites-trumps-shorter-days-signs-of-fatigue-realities-of-ageing-trump-hits-back/articleshow/125606486.cms",
    "timestamp": "2025-11-27T07:34:31Z"
  },
  {
    "title": "China's top paper urges U.S. to rein in Japan over Taiwan",
    "description": "China urged the U.S. on Thursday to rein in Japan and prevent any &quot;actions to revive militarism&quot; in an editorial published by the newspaper of the ruling Communist Party, as a war of words with Tokyo grows over the Japanese prime minister's remarks …",
    "link": "https://japantoday.com/category/politics/china%27s-top-paper-urges-us-to-rein-in-japan-over-taiwan",
    "timestamp": "2025-11-27T07:34:22Z"
  },
  {
    "title": "Election of the Day: Saint Vincent and the Grenadines",
    "description": "Later today, the citizens of Saint Vincent and the Grenadines will elect a new House of Assembly. This legislative body has 21 members. 15 are elected in single member districts, first past the post. The remaining six are appointed by the electeds; 4 by the m…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/election-of-the-day-saint-vincent-and-the-grenadines",
    "timestamp": "2025-11-27T07:31:57Z"
  },
  {
    "title": "China’s tech giants take AI model training offshore to tap Nvidia chips",
    "description": "Alibaba and ByteDance shift development to south-east Asia to sidestep US curbs",
    "link": "https://www.irishtimes.com/business/2025/11/27/chinas-tech-giants-take-ai-model-training-offshore-to-tap-nvidia-chips/",
    "timestamp": "2025-11-27T07:24:23Z"
  },
  {
    "title": "WV National Guardsman critically injured in monstrous DC shooting by Afghan national identified as Andrew Wolfe",
    "description": "A post from Musselman High School in Inwood, West Virginia, identified one of the National Guard troops critically injured in an ambush attack on Wednesday as Andrew Wolfe. Two Guardsmen were attacked by a gunman while on patrol near the White House. Both of …",
    "link": "https://freerepublic.com/focus/f-chat/4354809/posts",
    "timestamp": "2025-11-27T07:23:18Z"
  },
  {
    "title": "Trump blames illegal immigration and Biden over National Guard shootings",
    "description": "Gunman who critically injured two guardsmen in Washington, DC, is identified as being from Afghanistan",
    "link": "https://www.irishtimes.com/world/us/2025/11/27/trump-blames-illegal-immigration-and-biden-over-national-guard-shootings/",
    "timestamp": "2025-11-27T07:15:57Z"
  },
  {
    "title": "Georgia judge dismisses Trump election interference case - DW",
    "description": "Georgia judge dismisses Trump election interference caseDW Judge Dismisses Georgia Election Interference Case Against TrumpThe New York Times Georgia prosecutor who took over 2020 election interference case drops charges against Trump and othersNBC News Judge…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180221997",
    "timestamp": "2025-11-27T07:12:16Z"
  },
  {
    "title": "National Guardsmen shot in Washington DC: What happened, who’s the suspect?",
    "description": "Trump calls it a 'terror' attack, as US officials identified an Afghan national as the suspect, announcing visa curbs.",
    "link": "https://www.aljazeera.com/news/2025/11/27/national-guardsmen-shot-in-washington-dc-what-happened-whos-the-suspect",
    "timestamp": "2025-11-27T07:05:35Z"
  },
  {
    "title": "The Afghan man who shot the National Guardsmen in Washington had cooperated with the US military before coming to the United States",
    "description": "29-year-old Ramanoallah Lakanwal arrived in the United States in 2021 and was granted asylum this year – “Biden brought him here,” Trump says, as he suspends Afghan immigration applications\nThe post The Afghan man who shot the National Guardsmen in Washington…",
    "link": "https://en.protothema.gr/2025/11/27/the-afghan-man-who-shot-the-national-guardsmen-in-washington-had-cooperated-with-the-us-military-before-coming-to-the-united-states/",
    "timestamp": "2025-11-27T07:03:47Z"
  },
  {
    "title": "Will Crypto Explode If Kevin Hassett Takes Over The Fed In 2026?",
    "description": "Kevin Hassett, head of the White House National Economic Council, has suddenly become the market’s base case for the next Fed chair – and crypto investors are already gaming out what a “Hassett Fed” would mean. According to Bloomberg-sourced reporting, Hasset…",
    "link": "http://www.newsbtc.com/news/will-crypto-explode-kevin-hassett-fed-2026/",
    "timestamp": "2025-11-27T07:00:57Z"
  },
  {
    "title": "Cristiano Ronaldo's World Cup FIFA pardon is as scandalous as it is unsurprising",
    "description": "The Portugal icon will not miss any games after his three-game ban was conveniently reduced a week after meeting Donald Trump and Gianni Infantino.",
    "link": "https://www.fourfourtwo.com/competition/cristiano-ronaldos-world-cup-fifa-pardon-is-as-scandalous-as-it-is-unsurprising",
    "timestamp": "2025-11-27T07:00:00Z"
  },
  {
    "title": "France wary of MAGA influence ahead of 2027 elections",
    "description": "US President Donald Trump’s MAGA movement is cosying up to France’s far right as part of an ideological offensive abroad since his return to office, with French authorities worried about its influence ahead of key elections. The warning comes as far-right par…",
    "link": "https://www.digitaljournal.com/world/france-wary-of-maga-influence-ahead-of-2027-elections/article",
    "timestamp": "2025-11-27T06:57:20Z"
  },
  {
    "title": "Trump says he's barring South Africa from participating in next year's G20 summit near Miami",
    "description": "President Donald Trump says he's barring South Africa from participating in the Group of 20 summit next year near Miami",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-barring-south-africa-participating-years-g20-summit-127907890",
    "timestamp": "2025-11-27T06:53:48Z"
  },
  {
    "title": "What we do and don’t know about the shooting of 2 National Guard members in DC",
    "description": "The brazen daytime shooting of two National Guard members in the nation’s capital by a man described as an Afghan national has raised multiple questions",
    "link": "https://abcnews.go.com/US/wireStory/dont-shooting-2-national-guard-members-dc-127921693",
    "timestamp": "2025-11-27T06:53:44Z"
  },
  {
    "title": "New prosecutor won’t pursue charges against Trump, Giuliani and others in Georgia election interference case - PBS",
    "description": "New prosecutor won’t pursue charges against Trump, Giuliani and others in Georgia election interference casePBS Judge Dismisses Georgia Election Interference Case Against TrumpThe New York Times Judge dismisses Trump election interference racketeering case in…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180221881",
    "timestamp": "2025-11-27T06:52:29Z"
  },
  {
    "title": "Trump says he's barring South Africa from participating in next year's G20 summit near Miami",
    "description": "President Donald Trump says he's barring South Africa from participating in the Group of 20 summit next year near Miami",
    "link": "https://abcnews.go.com/US/wireStory/trump-barring-south-africa-participating-years-g20-summit-127907889",
    "timestamp": "2025-11-27T06:37:30Z"
  },
  {
    "title": "The White House: Greenland and Denmark have scheduled meetings for next month",
    "description": "Senior officials from Greenland, Denmark, and the U.S. will gather in Nuuk in early December to talk security—and more.",
    "link": "https://politiken.dk/edition/news/art10638881/Greenland-and-Denmark-have-scheduled-meetings-for-next-month",
    "timestamp": "2025-11-27T06:37:21Z"
  },
  {
    "title": "ALAN WILSON: Trump Right To Strike Narcoterrorist Boats Before They Reach Our Shores",
    "description": "President Trump’s decision to authorize targeted strikes on drug-running vessels leaving the Venezuelan coast has drawn predictable criticism from academics and international bureaucrats.",
    "link": "https://dailycaller.com/2025/11/27/opinion-trump-is-right-to-strike-narcoterrorist-boats-before-they-reach-our-shores-alan-wilson/",
    "timestamp": "2025-11-27T06:35:38Z"
  },
  {
    "title": "Walking Dead: Obamacare gender identity mandate stalks doctors despite Trump orders, they say",
    "description": "Trump judge wrote a binding regulation out of existence in dismissing lawsuit by Florida, Catholic doctors against Section 1557 rewrite, which Trump's HHS has never pledged to repeal, 11th Circuit hears.",
    "link": "https://justthenews.com/politics-policy/health/walking-dead-obamacare-gender-identity-mandate-stalks-doctors-despite-trump",
    "timestamp": "2025-11-27T06:34:31Z"
  },
  {
    "title": "Trade Policy shifts, Ghana’s key exports regain US market competitiveness",
    "description": "The United States’ official decision to lift the 15% tariffs on cocoa and other key agricultural exports from Ghana marks a significant turnaround in trade relations. Foreign Affairs Minister Samuel Okudzeto Ablakwa announced the reversal, which took effect o…",
    "link": "https://thechronicle.com.gh/trade-policy-shifts-ghanas-key-exports-regain-us-market-competitiveness/",
    "timestamp": "2025-11-27T06:33:56Z"
  },
  {
    "title": "Trump: National Guard Shooting Suspect Afghan Who Entered US Through Biden Program",
    "description": "President Donald Trump denounced the shooting of two National Guard members as an “act of terror” in remarks Wednesday night and said the suspect was... Read More\nThe post Trump: National Guard Shooting Suspect Afghan Who Entered US Through Biden Program appe…",
    "link": "https://www.dailysignal.com/2025/11/27/trump-biden-let-in-national-guard-shooting-suspect/",
    "timestamp": "2025-11-27T06:31:24Z"
  },
  {
    "title": "The shooter who injured the two National Guard members near the White House is Afghan (video)",
    "description": "The two soldiers and the gunman are in critical condition – He had been granted asylum in 2024. The FBI and Washington authorities are investigating the motives and the origin of the weapon\nThe post The shooter who injured the two National Guard members near …",
    "link": "https://en.protothema.gr/2025/11/27/the-shooter-who-injured-the-two-national-guard-members-near-the-white-house-is-afghan-video/",
    "timestamp": "2025-11-27T06:24:17Z"
  },
  {
    "title": "Black Friday arrives with solid momentum despite tariffs, economic uncertainty",
    "description": "Black Friday kicks off the holiday shopping season amid economic uncertainty and tariffs. Retailers are absorbing costs and pulling back on hiring. Consumer confidence has dipped, but shoppers remain willing to spend, focusing on deals. Mall traffic is strong…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/black-friday-arrives-with-solid-momentum-despite-tariffs-economic-uncertainty/articleshow/125606719.cms",
    "timestamp": "2025-11-27T06:20:25Z"
  },
  {
    "title": "Black Friday arrives with solid momentum despite tariffs and economic uncertainty",
    "description": "Black Friday may no longer be the retail bacchanalia of years past, but the event still has enough enthusiasts to make it the biggest single shopping day in the U.S.",
    "link": "https://abcnews.go.com/Business/wireStory/black-friday-arrives-solid-momentum-despite-tariffs-economic-127921142",
    "timestamp": "2025-11-27T06:13:53Z"
  },
  {
    "title": "Black Friday arrives with solid momentum despite tariffs and economic uncertainty",
    "description": "Black Friday may no longer be the retail bacchanalia of years past, but the event still has enough enthusiasts to make it the biggest single shopping day in the U.S.",
    "link": "https://abcnews.go.com/US/wireStory/black-friday-arrives-solid-momentum-despite-tariffs-economic-127921141",
    "timestamp": "2025-11-27T06:13:51Z"
  },
  {
    "title": "Black Friday arrives with solid momentum despite tariffs and economic uncertainty",
    "description": "Black Friday may no longer be the retail bacchanalia of years past, but the event still has enough enthusiasts to make it the biggest single shopping day in the U.S.",
    "link": "https://www.clickondetroit.com/business/2025/11/27/black-friday-arrives-with-solid-momentum-despite-tariffs-and-economic-uncertainty/",
    "timestamp": "2025-11-27T06:10:04Z"
  },
  {
    "title": "South Africa slams Trump’s G20 ban as punitive",
    "description": "South Africa denounces President Trump’s G20 ban, calling the move punitive and based on distortions that harm global cooperation and diplomatic ties.\n\nRead More: https://punchng.com/south-africa-slams-trumps-g20-ban-as-punitive/",
    "link": "https://punchng.com/south-africa-slams-trumps-g20-ban-as-punitive/",
    "timestamp": "2025-11-27T06:04:41Z"
  },
  {
    "title": "Ireland should be EU-US bridge, says Washington’s ambassador",
    "description": "Edward Walsh says there will be major US-Ireland economic conference next autumn",
    "link": "https://www.irishtimes.com/politics/2025/11/27/ireland-should-be-eu-us-bridge-says-washingtons-ambassador/",
    "timestamp": "2025-11-27T06:00:01Z"
  },
  {
    "title": "Ambassador Edward Walsh: Ireland’s future is to be an interpreter between US and Europe",
    "description": "Ties that bind the United States and Ireland are a tremendous asset to both our nations",
    "link": "https://www.irishtimes.com/opinion/2025/11/27/ambassador-edward-walsh-irelands-future-is-to-be-an-interpreter-between-us-and-europe/",
    "timestamp": "2025-11-27T06:00:01Z"
  },
  {
    "title": "Russia REJECTS U.S.-brokered Ukraine peace plan over “unacceptable” provisions",
    "description": "Moscow dismisses proposed terms of the Ukraine peace plan, citing constitutional and strategic incompatibility with ceding annexed territories (Kherson, Zaporozhye). Public support for Russia’s military operation reinforces this stance. Five factors drive Rus…",
    "link": "https://www.naturalnews.com/2025-11-27-russia-rejects-ukraine-peace-plan-unacceptable-provisions.html",
    "timestamp": "2025-11-27T06:00:00Z"
  },
  {
    "title": "Taiwanâ\u0080\u0099s $40 billion defense surge: A last stand against Beijingâ\u0080\u0099s aggression?",
    "description": "Taiwan approves historic $40 billion defense budget to counter China’s invasion threats with AI missiles, drones, and air defense upgrades. Beijing dismisses the move as reckless, warning it will bring disaster while escalating military and economic pressure.…",
    "link": "https://www.naturalnews.com/2025-11-27-taiwan-defense-surge-stand-against-beijing-aggression.html",
    "timestamp": "2025-11-27T06:00:00Z"
  },
  {
    "title": "'UnAmerican hoax': Georgia judge dismisses Trump election interference case - France 24",
    "description": "'UnAmerican hoax': Georgia judge dismisses Trump election interference caseFrance 24 Georgia prosecutor kills the historic election interference case against Trump and alliesCNN Judge dismisses Trump election interference racketeering case in GeorgiaCNBC Judg…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180221595",
    "timestamp": "2025-11-27T05:52:32Z"
  },
  {
    "title": "Black Friday arrives with solid momentum despite tariffs and economic uncertainty",
    "description": "NEW YORK (AP) — Black Friday may no longer be the retail bacchanalia of years past, when the promise of one-time bargains caused people to leave Thanksgiving tables for malls where some customers got into fistfights over toys or TVs. But the event still has e…",
    "link": "https://financialpost.com/pmn/black-friday-arrives-with-solid-momentum-despite-tariffs-and-economic-uncertainty",
    "timestamp": "2025-11-27T05:52:16Z"
  },
  {
    "title": "Trump’s Niece Exposes Why Her Uncle Keeps Attacking Female Reporters",
    "description": "Donald Trump’s niece, Mary Trump, says one of the reasons the president seems to be increasingly lashing out at female reporters is because he is “rattled.” ...",
    "link": "https://www.thedailybeast.com/mary-trump-exposes-why-her-uncle-donald-keeps-attacking-female-reporters/",
    "timestamp": "2025-11-27T05:49:47Z"
  },
  {
    "title": "Retailers expect Black Friday shoppers to spend in s typically big way",
    "description": "Black Friday may no longer be the retail bacchanalia of years past, but the event still has enough enthusiasts to make it the biggest single shopping day in the U.S.",
    "link": "https://www.wsbtv.com/news/business/black-friday-arrives/R6LDWMWHWY2GTJX5HTYORP5YUY/",
    "timestamp": "2025-11-27T05:45:56Z"
  }
]