[
  {
    "title": "A Hammerhead Shark Falls From the Sky in the Middle of a Disc Golf Game in the U.S.",
    "description": "A Hammerhead Shark. Credit: FOX Weather via Jonathan Marlowe | The Daily Galaxy --Great Discoveries Channel On May 18, 2025, a strange and surprising event unfolded at Splinter City Disc Golf Course in Myrtle Beach, South Carolina, when a hammerhead shark sud…",
    "link": "https://freerepublic.com/focus/f-chat/4323821/posts",
    "timestamp": "2025-06-18T15:07:59Z"
  },
  {
    "title": "Narrator: He then tweeted out his \"amazing poll numbers\" showing him with the lowest approvals ever. No, seriously [Dumbass]",
    "description": "Narrator: He then tweeted out his \"amazing poll numbers\" showing him with the lowest approvals ever. No, seriously",
    "link": "https://www.fark.com/comments/13711268/Narrator-He-then-tweeted-out-his-amazing-poll-numbers-showing-him-with-lowest-approvals-ever-No-seriously",
    "timestamp": "2025-06-18T15:07:55Z"
  },
  {
    "title": "After phone call with Modi, Trump repeats claim he stopped India-Pak war",
    "description": "Donald Trump reiterated that he stopped a war between India and Pakistan. He praised Narendra Modi and mentioned a potential trade deal. Trump hosted Pakistan's Army Chief Asim Munir, acknowledging his role in de-escalation. Modi, during a call with Trump, cl…",
    "link": "https://economictimes.indiatimes.com/news/india/after-phone-call-with-modi-trump-repeats-claim-he-stopped-india-pak-war/articleshow/121935263.cms",
    "timestamp": "2025-06-18T15:06:56Z"
  },
  {
    "title": "After phone call with Modi, Trump repeats claim he stopped India-Pak war",
    "description": "Donald Trump reiterated that he stopped a war between India and Pakistan. He praised Narendra Modi and mentioned a potential trade deal. Trump hosted Pakistan's Army Chief Asim Munir, acknowledging his role in de-escalation. Modi, during a call with Trump, cl…",
    "link": "https://economictimes.indiatimes.com/news/india/after-phone-call-with-modi-trump-repeats-claim-he-stopped-india-pak-war/articleshow/121935227.cms",
    "timestamp": "2025-06-18T15:06:56Z"
  },
  {
    "title": "EXCLUSIVE: Conservative Coalition Urges Confirmation of Chair of Equal Employment Opportunity Commission",
    "description": "FIRST ON THE DAILY SIGNAL—A coalition of conservative organizations is urging the Senate to confirm the chair of an independent agency used by the Biden... Read More\nThe post EXCLUSIVE: Conservative Coalition Urges Confirmation of Chair of Equal Employment Op…",
    "link": "https://www.dailysignal.com/2025/06/18/exclusive-conservative-coalition-urges-confirmation-chair-equal-employment-opportunity-commission/",
    "timestamp": "2025-06-18T15:06:44Z"
  },
  {
    "title": "Putin T-shirts, Robots And The Taliban -- But Few Westerners At Russia's Davos",
    "description": "Russia's flagship economic forum kicked off Wednesday with stalls selling Vladimir Putin-themed merchandise and humanoid robots, but Westerners were few and far between -- despite warming ties between Moscow and Washington under Donald Trump.",
    "link": "https://www.ibtimes.com/putin-t-shirts-robots-taliban-few-westerners-russias-davos-3776095",
    "timestamp": "2025-06-18T15:06:14Z"
  },
  {
    "title": "Trump Says He May or May Not Strike Iranian Nuclear Facilities",
    "description": "WASHINGTON (Sputnik) – US President Donald Trump declined to give a clear response on Wednesday whether he will choose to target Iranian nuclear facilities and when.",
    "link": "https://sputnikglobe.com/20250618/trump-says-he-may-or-may-not-strike-iranian-nuclear-facilities-1122280856.html",
    "timestamp": "2025-06-18T15:04:58Z"
  },
  {
    "title": "Trump Contemplating Axing Tulsi Gabbard's Office, Saying She 'Doesn't Add Anything' to His Admin: Report",
    "description": "Donald Trump reportedly revealed that he has considered dissolving the Office of National Intelligence, where Tulsi Gabbard currently serves as director.",
    "link": "https://www.ibtimes.com/trump-contemplating-axing-tulsi-gabbards-office-saying-she-doesnt-add-anything-his-admin-3776094",
    "timestamp": "2025-06-18T15:04:13Z"
  },
  {
    "title": "'They can be difficult, so can you': Trump insults reporter during impromptu Q&A",
    "description": "President Donald Trump gave reporters a backhanded compliment, calling them ‘difficult’ and comparing them to Iranians during an impromptu press conference on the White House lawn Wednesday morning. “Mr. President, you've been fairly compassionate towards the…",
    "link": "https://www.rawstory.com/iran-israel-2672395502/",
    "timestamp": "2025-06-18T15:02:51Z"
  },
  {
    "title": "Elon Musk posts clean drug tests, but lab claims he flushed it out of his system — netizens call it fake",
    "description": "Elon Musk, accused of drug use in a New York Times report, posted a clean urine drug test on X, seemingly mocking the allegations. However, the test's validity is questioned as it was taken 12 days after the report, potentially allowing time to flush drugs fr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-posts-clean-drug-tests-but-lab-claims-he-flushed-it-out-of-his-system-netizens-call-it-fake/articleshow/121935086.cms",
    "timestamp": "2025-06-18T15:02:34Z"
  },
  {
    "title": "Diane Francis: This is how you turn Canada into an ‘energy superpower’",
    "description": "Joining forces with the U.S. would allow Canada to undermine OPEC, deal a swift blow to Russia and bring economic prosperity. Read more",
    "link": "https://financialpost.com/diane-francis/diane-francis-how-to-turn-canada-into-energy-superpower",
    "timestamp": "2025-06-18T15:01:29Z"
  },
  {
    "title": "ICE is Helping Predators Scam Immigrants",
    "description": "This post contains a video, which you can also view here. To support more videos like this, head to patreon.com/rebecca! Transcript: The US government has empowered a secret police force to round up people they suspect of being undocumented immigrants and dis…",
    "link": "https://skepchick.org/2025/06/ice-is-helping-predators-scam-immigrants/",
    "timestamp": "2025-06-18T15:00:41Z"
  },
  {
    "title": "Rep. Massie Joined by Dems in Resolution Opposing US Involvement in Iran",
    "description": "Rep. Thomas Massie, R-Ky., filed a House resolution Tuesday looking to block U.S. involvement in the Middle East conflict between Iran and Israel. Massie's resolution features numerous Democrat co-sponsors, including progressive legislators like Rep. Alexandr…",
    "link": "https://freerepublic.com/focus/f-chat/4323818/posts",
    "timestamp": "2025-06-18T15:00:16Z"
  },
  {
    "title": "The empire strikes out: Institutionalists failed to kill the stablecoin bill",
    "description": "Despite a relentless campaign from institutional powerbrokers like Senator Elizabeth Warren, the US Senate advanced the GENIUS Act, marking a watershed moment for stablecoin regulation and exposing the limits of establishment resistance.",
    "link": "https://cointelegraph.com/news/institutionalists-stablecoin-bill",
    "timestamp": "2025-06-18T15:00:00Z"
  },
  {
    "title": "ICE targets Chicago’s immigration court for deportations",
    "description": "ICE kidnappings at immigration court A Kyrgyzstani man stands before Judge Patrick M. McKenna at Chicago’s immigration court on June 12 when a lawyer for the U.S. Department of Homeland Security (DHS) asks that his case be dismissed. Normally, this would be w…",
    "link": "http://chicagoreader.com/news/make-it-make-sense/ice-chicago-immigration-court-alpr/",
    "timestamp": "2025-06-18T15:00:00Z"
  },
  {
    "title": "John Thompson: MAGA Republicans in Oklahoma Are Hurting the People Who Elected Them",
    "description": "John Thompson, historian and retired teacher in Oklahoma, probes the divide in the state Republican Party, which is currently in the hands of MAGA extremists. He writes: Oklahoma seems to be a case study in MAGA-ism and, now, it may be foreshadowing the chaos…",
    "link": "https://dianeravitch.net/2025/06/18/john-thompson-maga-republicans-in-oklahoma-are-hurting-the-people-who-elected-them/",
    "timestamp": "2025-06-18T15:00:00Z"
  },
  {
    "title": "Donald Trump's 'Big Beautiful Bill' Is Considerably Unpopular",
    "description": "The One Big Beautiful Bill Act is central to Trump's economic agenda and Republican hopes of reshaping federal spending.",
    "link": "https://www.newsweek.com/donald-trump-big-beautiful-bill-poll-2087286",
    "timestamp": "2025-06-18T14:59:35Z"
  },
  {
    "title": "Bitcoin eyes $105K pre-FOMC as Trump reveals Iran asked for dialogue",
    "description": "Trump offers light relief for Bitcoin price action while calling Fed Chair Jerome Powell a \"stupid person\" with interest-rate cut hopes absent.",
    "link": "https://cointelegraph.com/news/bitcoin-eyes-105k-pre-fomc-trump-reveals-iran-asked-for-dialogue",
    "timestamp": "2025-06-18T14:59:34Z"
  },
  {
    "title": "India opens bids for 5th gen stealth fighter jet, sets 2029 flight target",
    "description": "India has formally opened the race to build its first indigenous fifth-generation stealth fighter, the AMCA. In a key move to modernise the Air Force and cut foreign reliance, the government has invited Indian defence firms to bid for development. The project…",
    "link": "https://economictimes.indiatimes.com/news/defence/india-opens-bids-for-5th-gen-stealth-fighter-jet-sets-2029-flight-target/articleshow/121935094.cms",
    "timestamp": "2025-06-18T14:59:23Z"
  },
  {
    "title": "Mike Huckabee urges Trump to listen to the ‘only ONE voice that matters’",
    "description": "'God spared you in Butler, PA to be the most consequential president in a century – maybe ever'",
    "link": "https://www.wnd.com/2025/06/mike-huckabee-urges-trump-listen-only-one-voice/",
    "timestamp": "2025-06-18T14:57:52Z"
  },
  {
    "title": "What is going on in Antarctica? More snow, lower temperatures, four black sarcophagi, and strange radio signals.",
    "description": ".. Meanwhile, recent reports describe the discovery of four mysterious black sarcophagi beneath Antarctica’s. These artifacts, unearthed by an international team of scientists from the United States, Russia, China, and India, have sparked widespread intrigue …",
    "link": "https://freerepublic.com/focus/f-chat/4323817/posts",
    "timestamp": "2025-06-18T14:57:52Z"
  },
  {
    "title": "Macron Warns Regime Change in Islamist Iran Could Cause 'Chaos' Amid Concerns of Terror Attacks in Europe",
    "description": "French President Emmanuel Macron warned that regime change in Iran could lead to \"chaos\", as officials in France and Germany expressed concerns over potential Tehran-linked terror attacks in Europe amid the Middle East conflict.\nThe post Macron Warns Regime C…",
    "link": "https://www.breitbart.com/europe/2025/06/18/macron-warns-regime-change-in-islamist-iran-could-cause-chaos-amid-concerns-of-terror-attacks-in-europe/",
    "timestamp": "2025-06-18T14:57:07Z"
  },
  {
    "title": "Nuclear War A la Mode? Trump and Netanyahu Conspire to Destroy Iran. Dr. Philip Giraldi",
    "description": "One of the more interesting aspects of the expanding war between Israel and Iran is the way the media and the crowd of “experts” have avoided any discussion of the possible, or perhaps even likely, upcoming decision of Prime Minister …\nThe post Nuclear War A …",
    "link": "https://www.globalresearch.ca/nuclear-war-trump-netanyahu-conspire-destroy-iran/5891577",
    "timestamp": "2025-06-18T14:55:42Z"
  },
  {
    "title": "Trump Addresses MAGA Split Over Iran",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump downplayed any divisions within the MAGA movement over potential U.S. strikes on Iran.\nTrump said \"we're not looking for long-term war\" in remarks to reporters on Wednesday morning.\n\"I o…",
    "link": "https://biztoc.com/x/f1b53ed18ca97382",
    "timestamp": "2025-06-18T14:54:37Z"
  },
  {
    "title": "'Imported Antisemitism': How German leaders are blaming foreigners for country's woes",
    "description": "A number of Germany's federal ministers have taken to implicating foreigners in some of the country's biggest problems. Here are several examples of leaders casting shade on foreigners from the recent news.",
    "link": "https://www.thelocal.de/20250618/imported-antisemitism-how-german-leaders-are-blaming-foreigners-for-countrys-woes",
    "timestamp": "2025-06-18T14:54:31Z"
  },
  {
    "title": "On multiple fronts, Trump gives American businesses new reasons to reject his agenda",
    "description": "Those who thought Donald Trump and his White House team would offer a pro-business agenda are now learning how wrong they were.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/multiple-fronts-trump-gives-american-businesses-new-reasons-reject-age-rcna213722",
    "timestamp": "2025-06-18T14:54:18Z"
  },
  {
    "title": "Japan’s Nippon Steel closes its takeover of rival US Steel",
    "description": "Donald Trump approved the deal last week after White House was offered a golden share",
    "link": "https://biztoc.com/x/c09389f9666bc25c",
    "timestamp": "2025-06-18T14:53:54Z"
  },
  {
    "title": "If NYC Elects A Far-Left Socialist, Blame Ranked-Choice Voting",
    "description": "New York City could sleepwalk its way into electing a socialist mayor, thanks to ranked-choice voting. New York City — the city that never sleeps — may be two weeks away from sleepwalking its way into advancing an open socialist in the mayoral Democrat primar…",
    "link": "https://freerepublic.com/focus/f-news/4323816/posts",
    "timestamp": "2025-06-18T14:53:28Z"
  },
  {
    "title": "Next ‘No Kings’ protest set for July 17, called ‘Good Trouble Lives On’",
    "description": "The organizations behind the nationwide “No Kings” protests on June 14 announced another day of protests for July 17",
    "link": "https://www.shawlocal.com/news/2025/06/18/next-no-kings-protest-set-for-july-17-called-good-trouble-lives-on/",
    "timestamp": "2025-06-18T14:53:25Z"
  },
  {
    "title": "Nippon Steel finalizes $15B takeover of US Steel after sealing security agreement",
    "description": "Nippon Steel and U.S. Steel say they've finalized their “historic partnership,” a year-and-a-half after the Japanese company first proposed its deal to buy the iconic American steelmaker for nearly $15 billion",
    "link": "https://abcnews.go.com/Business/wireStory/nippon-steel-finalizes-15b-takeover-us-steel-after-122970867",
    "timestamp": "2025-06-18T14:53:03Z"
  },
  {
    "title": "US crude stockpiles slump, products build, EIA says",
    "description": "U.S. crude oil stockpiles fell sharply last week, posting their largest decline in a year, while gasoline and distillate inventories rose, the Energy...",
    "link": "https://finance.yahoo.com/news/us-crude-stockpiles-slump-products-145207312.html",
    "timestamp": "2025-06-18T14:52:07Z"
  },
  {
    "title": "Trump Addresses MAGA Split Over Iran",
    "description": "The MAGA movement is split on the U.S. joining Israeli strikes on Iran.",
    "link": "https://www.newsweek.com/trump-addresses-maga-split-over-iran-2087414",
    "timestamp": "2025-06-18T14:51:36Z"
  },
  {
    "title": "Supreme Court OKs Tennessee ban on gender-affirming care for kids, a setback for transgender rights",
    "description": "An American Civil Liberties Union lawyer says the Supreme Court decision upholding Tennessee’s ban on gender-affirming care for transgender minors is “a devastating loss for transgender people” and \"everyone who cares about the Constitution.”",
    "link": "https://www.wsbtv.com/news/supreme-court-oks/DSX7QDY2HNDPJMRVCTTR3VGPNM/",
    "timestamp": "2025-06-18T14:51:01Z"
  },
  {
    "title": "Trump weighs striking Iranian nuclear facilities: 'I may do it, I may not do it'",
    "description": "Trump is still deciding whether he will approve military strikes against Iran's nuclear facilities, noting that Iran is interested in negotiating.",
    "link": "https://www.foxnews.com/politics/trump-weighs-striking-iranian-nuclear-facilities-i-may-do-it-i-may-not-do-it",
    "timestamp": "2025-06-18T14:50:24Z"
  },
  {
    "title": "Nippon Steel finalizes deal to buy 100% of US Steel | CNN Business",
    "description": "Nippon Steel has finalized its deal to buy 100% of US Steel, the iconic steelmaker that was once the world’s most valuable company and a cornerstone of American industrial might.",
    "link": "https://www.cnn.com/2025/06/18/business/nippon-steel-finalizes-deal-to-buy-100-of-us-steel",
    "timestamp": "2025-06-18T14:49:06Z"
  },
  {
    "title": "After striking Boeing office in Ukraine, Putin now kills an American in Kyiv—Trump's silence is deafening",
    "description": "Russia launched a deadly attack on Kyiv, killing 15, including an American citizen. The overnight assault involved drones and missiles targeting residential areas. This happened hours after US president Donald Trump praised Russian president Vladimir Putin an…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-striking-boeing-office-in-ukraine-putin-now-kills-an-american-in-kyivtrumps-silence-is-deafening-donald-trump-news-russia-ukraine-war-news/articleshow/121934273.cms",
    "timestamp": "2025-06-18T14:48:50Z"
  },
  {
    "title": "Obama swipes at affluent liberals during rare public remarks, says 'all of us are going to be tested'",
    "description": "Barack Obama took aim at affluent liberals on Tuesday during remarks in Connecticut, suggesting their progressive politics would be \"tested.\"",
    "link": "https://www.foxnews.com/media/obama-swipes-affluent-liberals-during-rare-public-remarks-says-all-us-going-tested",
    "timestamp": "2025-06-18T14:48:48Z"
  },
  {
    "title": "USAID Gave Known Con Man $800M Contract To Do Kamala’s Work On ‘Root Causes Of Migration’",
    "description": "President Joe Biden’s USAID awarded an $800 million contract to a business operating out of a Virginia home even after it formally ruled that its key manager lacked “honesty or integrity” — a reference to the fact that, according to a May 12 guilty plea, he h…",
    "link": "https://freerepublic.com/focus/f-news/4323812/posts",
    "timestamp": "2025-06-18T14:48:40Z"
  },
  {
    "title": "Senate passes GENIUS stablecoin bill amid concerns over systemic risk",
    "description": "The US Senate voted to pass the GENIUS Act, a bill regulating stablecoins, but observers believe lawmakers may have ignored stability concerns in Treasury markets.",
    "link": "https://cointelegraph.com/news/senate-genius-stablecoin-bill-concerns-systemic-risk",
    "timestamp": "2025-06-18T14:47:29Z"
  },
  {
    "title": "The 1600: Trump Weighs U.S. Options",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-trump-weighs-us-options-2087362",
    "timestamp": "2025-06-18T14:46:56Z"
  },
  {
    "title": "Russia tells US not to strike Iran, warns of nuclear catastrophe",
    "description": "Russia cautions the United States against striking Iran, warning it would destabilize the Middle East. Moscow highlights the dangers of Israeli strikes on Iranian nuclear infrastructure, suggesting a potential nuclear catastrophe. Despite a strategic partners…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-tells-us-not-to-strike-iran-warns-of-nuclear-catastrophe/articleshow/121934981.cms",
    "timestamp": "2025-06-18T14:46:55Z"
  },
  {
    "title": "Nippon Steel finalizes $15B takeover of US Steel after sealing national security agreement",
    "description": "Nippon Steel and U.S. Steel say they've finalized their “historic partnership,” a year-and-a-half after the Japanese company first proposed its deal to buy the iconic American steelmaker for nearly $15 billion",
    "link": "https://abcnews.go.com/US/wireStory/nippon-steel-finalizes-15b-takeover-us-steel-after-122970865",
    "timestamp": "2025-06-18T14:46:46Z"
  },
  {
    "title": "VA Employees Asked to Report Waste as 'Five Achievements' Rule Ends",
    "description": "According to an email seen by Newsweek, staff at the VA were asked to report an example of \"fraud, waste, or abuse\" in the department.",
    "link": "https://www.newsweek.com/five-things-email-doge-veteran-affairs-trump-2087142",
    "timestamp": "2025-06-18T14:45:57Z"
  },
  {
    "title": "Trump Warns ‘Totally Defenseless’ Iran It May Be Too Late to Strike Nuke Deal as Regime ‘Gets the Hell Beaten Out of Them’",
    "description": "Flanked by construction workers from the White House lawn as he unveiled two brand-new flagpoles, the president took a strong stance toward Iran when asked if it was too late for Tehran to make a deal on its nuclear capability.\nThe post Trump Warns ‘Totally D…",
    "link": "https://www.mediaite.com/media/news/trump-warns-totally-defenseless-iran-it-may-be-too-late-to-strike-nuke-deal-as-regime-gets-the-hell-beaten-out-of-them/",
    "timestamp": "2025-06-18T14:45:50Z"
  },
  {
    "title": "Trump Calls Out ‘Too Late’ Powell for Steady Rate Policy",
    "description": "Follow live coverage and analysis of the FOMC's June interest-rate decision, economic projections, and Fed Chair Jerome Powell's speech today starting at 2 p.m. Eastern time.",
    "link": "https://www.barrons.com/livecoverage/fed-interest-rates-june-meeting-powell-today",
    "timestamp": "2025-06-18T14:45:39Z"
  },
  {
    "title": "Deal complete: U.S. Steel, Nippon Steel finalize ‘partnership’",
    "description": "The U.S. Steel Corp. and the Japanese steelmaker Nippon Steel Corp. announced that they have finalized what they are calling a “partnership.”",
    "link": "https://www.wpxi.com/news/local/deal-complete-us-steel-nippon-steel-finalize-partnership/T67VMYBBMJH2TCVVOV2CJOHKJU/",
    "timestamp": "2025-06-18T14:45:36Z"
  },
  {
    "title": "US Potential Involvement in Israel-Iran Conflict Up to Trump - Ex-Austrian Top Diplomat",
    "description": "ST. PETERSBURG (Sputnik)- Opinions vary in the US political elite on whether or not to engage in the Israel-Iran conflict, but the ultimate decision will rest with US President Donald Trump, former Austrian Foreign Minister and St. Petersburg University's G.O…",
    "link": "https://sputnikglobe.com/20250618/us-potential-involvement-in-israel-iran-conflict-up-to-trump---ex-austrian-top-diplomat-1122280692.html",
    "timestamp": "2025-06-18T14:44:30Z"
  },
  {
    "title": "Donald Trump's Chances in Upcoming 'Referendum' Get Worse",
    "description": "Polls show the Democratic candidate ahead in Virginia's governor race, a contest that is expected to be a referendum on Trump's administration and policies.",
    "link": "https://www.newsweek.com/trump-virginia-governor-race-2087304",
    "timestamp": "2025-06-18T14:44:08Z"
  },
  {
    "title": "Crude Inventories Decline By 11.5 Million Barrels; WTI Oil Dives 2.5%",
    "description": "Oil traders react to EIA data and focus on Trump’s comments on Iran.",
    "link": "https://www.fxempire.com/news/article/crude-inventories-decline-by-11-5-million-barrels-wti-oil-dives-2-5-1527049",
    "timestamp": "2025-06-18T14:43:56Z"
  },
  {
    "title": "Trump and Gabbard 'on the same page' as POTUS argues Iran was 'very close' to nuke, official says",
    "description": "President Donald Trump and his Director of National Intelligence Tulsi Gabbard are “on the same page” related to assessments of how close the Iranian regime was to obtaining a nuclear weapon, a senior Trump administration official insisted to Just the News, a…",
    "link": "https://freerepublic.com/focus/f-news/4323811/posts",
    "timestamp": "2025-06-18T14:43:37Z"
  },
  {
    "title": "Trump: I told Netanyahu keep going",
    "description": "United States President Donald Trump told reporters on Wednesday that he speaks with Israeli Prime Minister Benjamin Netanyahu \"every day\" and that he encouraged him to \"keep going\" amid ongoing Israe...",
    "link": "https://biztoc.com/x/484178ea6db67bab",
    "timestamp": "2025-06-18T14:43:09Z"
  },
  {
    "title": "S.F.’s Pink Triangle, symbol of LGBTQ+ rights and Nazi persecution, is vandalized",
    "description": "San Francisco police have arrested a man accused of defacing the famed Pink Triangle, a symbol of LGBTQ+ rights that is installed annually during Pride Month on top of the city’s landmark Twin Peaks.",
    "link": "https://freerepublic.com/focus/f-news/4323810/posts",
    "timestamp": "2025-06-18T14:43:02Z"
  },
  {
    "title": "Tucker Carlson clashes with Sen. Ted Cruz: 'You don't know anything about Iran'",
    "description": "WASHINGTON — Right-wing media personality Tucker Carlson clashed with Ted Cruz in an interview and posted a clip Tuesday night where the senator was unable to answer questions about Iran.\"How many people live in Iran, by the way?\" Carlson asked the Texas Repu…",
    "link": "https://www.nbcnews.com/politics/politics-news/tucker-carlson-clashes-sen-ted-cruz-dont-know-anything-iran-rcna213697",
    "timestamp": "2025-06-18T14:42:41Z"
  },
  {
    "title": "The whiplash of covering Summer Game Fest 2025 in LA",
    "description": "I love going to Summer Game Fest. It's a rare opportunity to connect with my colleagues and friends in person, as well as listen to developers talk about why they make their games. In some ways, this year's SGF gave me everything I love about the event. But w…",
    "link": "https://www.theverge.com/games/688568/summer-game-fest-2025-los-angeles-ice-arrests",
    "timestamp": "2025-06-18T14:42:21Z"
  },
  {
    "title": "Premier League fixtures give Burnley the ultimate test in how to park a bus",
    "description": "In today’s Football Daily: A tough return to the top flight for the Clarets",
    "link": "https://sports.yahoo.com/article/premier-league-fixtures-burnley-ultimate-143940074.html",
    "timestamp": "2025-06-18T14:39:40Z"
  },
  {
    "title": "Stephen Colbert Realizes He Wore Ominous Sweater When Trump Announced 1st Campaign: ‘I Should’ve Known’ | Video",
    "description": "The CBS host pulls up a photo from that day as proof\nThe post Stephen Colbert Realizes He Wore Ominous Sweater When Trump Announced 1st Campaign: ‘I Should’ve Known’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/stephen-colbert-the-shining-sweater-trump-campaign-announcement/",
    "timestamp": "2025-06-18T14:39:00Z"
  },
  {
    "title": "U.S. senators offer perspectives on U.S. energy policy",
    "description": "Nuclear energy dominates the discussion among lawmakers and the tech industry as a top potential power source for AI data centers, which consume large amounts of electricity.",
    "link": "https://www.techtarget.com/searchcio/news/366626045/US-senators-offer-perspevctives-on-US-energy-policy",
    "timestamp": "2025-06-18T14:39:00Z"
  },
  {
    "title": "Border Patrol announces 'phenomenal' turnaround as number of monthly migrant releases drops to zero",
    "description": "Border Patrol achieves success with zero illegal migrant releases last month, down from 62,000 in the same period last year, according to agency chief Michael Banks.",
    "link": "https://www.foxnews.com/media/border-patrol-announces-phenomenal-turnaround-number-monthly-migrant-releases-drops-zero",
    "timestamp": "2025-06-18T14:38:34Z"
  },
  {
    "title": "The 'Big Beautiful Bill' Will Require Even More Borrowing Than Previously Thought",
    "description": "For months, Republicans have argued that there's a glaring flaw in various budgetary projections showing that deficits will significantly increase if",
    "link": "https://reason.com/2025/06/18/the-big-beautiful-bill-will-require-even-more-borrowing-than-previously-thought/",
    "timestamp": "2025-06-18T14:37:56Z"
  },
  {
    "title": "Judge blocks Trump’s anti-trans passport policy",
    "description": "The Trump administration will not be allowed to refuse issuing passports with the correct gender marker to trans and non-binary people. On Tuesday (17 June), federal judge expanded a preliminary injunction blocking the US government’s attempt to deny passport…",
    "link": "https://www.thepinknews.com/2025/06/18/trans-passport-policy-donald-trump-blocked-again/",
    "timestamp": "2025-06-18T14:37:01Z"
  },
  {
    "title": "Trump ‘May’ Order Strike On Iranian Nuclear Facility: ‘Nobody Knows What I’m Going To Do’ (Live Updates)",
    "description": "In a post on his Truth Social platform, Trump had directly threatened the Iranian Supreme Leader, saying he knew \"where the so-called ‘Supreme Leader’ is hiding.\"",
    "link": "https://www.forbes.com/sites/siladityaray/2025/06/18/trump-may-order-strike-on-iranian-nuclear-facility-nobody-knows-what-im-going-to-do-live-updates/",
    "timestamp": "2025-06-18T14:37:00Z"
  },
  {
    "title": "A New Economic Order Needs a Moral Compass",
    "description": "The alternative to a failing world order is not retreat into nationalism or technocracy, but rather bold re-commitment to shared values. Though the postwar world was not perfect, the generation that created it recognized that multilateralism and effective int…",
    "link": "https://www.project-syndicate.org/commentary/restoring-values-to-global-economic-governance-by-adriana-abdenur-2025-06",
    "timestamp": "2025-06-18T14:36:38Z"
  },
  {
    "title": "Un nuevo orden económico necesita una brújula moral",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/restoring-values-to-global-economic-governance-by-adriana-abdenur-2025-06/spanish",
    "timestamp": "2025-06-18T14:36:38Z"
  },
  {
    "title": "Kyiv Attack Death Toll Climbs to 28 as Emergency Workers Pull More Bodies From Collapsed Building",
    "description": "Emergency workers pulled more bodies Wednesday from the rubble of a nine-story Kyiv apartment building demolished by a Russian missile.\nThe post Kyiv Attack Death Toll Climbs to 28 as Emergency Workers Pull More Bodies From Collapsed Building appeared first o…",
    "link": "https://www.breitbart.com/europe/2025/06/18/kyiv-attack-death-toll-climbs-to-28-as-emergency-workers-pull-more-bodies-from-collapsed-building/",
    "timestamp": "2025-06-18T14:36:38Z"
  },
  {
    "title": "Sell gold now? Citi says prices could plunge 25% as record run peters out",
    "description": "Gold is expected to sink back below US$3,000 an ounce in the coming quarters, according to Citigroup. Read more",
    "link": "https://financialpost.com/investing/citi-says-gold-prices-could-fall-25-per-cent",
    "timestamp": "2025-06-18T14:35:36Z"
  },
  {
    "title": "Trump's Yemen bombings killed nearly as many civilians as 23 previous years of US attacks, analysis shows (Dan Sabbagh/The Guardian)",
    "description": "Dan Sabbagh / The Guardian:\nTrump's Yemen bombings killed nearly as many civilians as 23 previous years of US attacks, analysis shows  —  Monitoring group says high death rate in two months indicates change in US policy that could affect Iran  —  The US bombi…",
    "link": "https://www.memeorandum.com/250618/p57",
    "timestamp": "2025-06-18T14:35:01Z"
  },
  {
    "title": "Trump Is Suddenly Raging at Tucker Carlson--and MAGA Is Deeply Rattled (Greg Sargent/New Republic)",
    "description": "Greg Sargent / New Republic:\nTrump Is Suddenly Raging at Tucker Carlson—and MAGA Is Deeply Rattled … You may have heard it said that Donald Trump won in 2024 in part by vowing to end “forever wars.”  During the campaign, Trump ripped Democrat Kamala Harris fo…",
    "link": "https://www.memeorandum.com/250618/p58",
    "timestamp": "2025-06-18T14:35:01Z"
  },
  {
    "title": "“A Truly Historic Moment”, Ripple CEO Brad Garlinghouse Opines As US Senate Passes GENIUS Stablecoin Bill",
    "description": "After months of dramatic starts and stops, the U.S. Senate successfully passed the GENIUS Act on June 17 in a 68-30 vote.",
    "link": "https://zycrypto.com/a-truly-historic-moment-ripple-ceo-brad-garlinghouse-opines-as-us-senate-passes-genius-stablecoin-bill/",
    "timestamp": "2025-06-18T14:34:40Z"
  },
  {
    "title": "5 Key Things to Know About Trump’s Rival: Gavin Newsom",
    "description": "California Governor Gavin Newsom is clashing with President Donald Trump over the deployment of military forces in Los Angeles. The potential Democratic presidential candidate in 2028, has increasingly positioned himself as a leading voice of the resistance a…",
    "link": "https://www.theroot.com/5-key-things-to-know-about-trumps-rival-gavin-newsom-2000045509",
    "timestamp": "2025-06-18T14:33:13Z"
  },
  {
    "title": "Supreme Court Upholds Tennessee Ban on Gender Affirming Care for Minors",
    "description": "Three years after the Supreme Court overturned Roe v. Wade, allowing states to ban abortion, the justices have decided to let states ban another politically controversial form of health care—this time, gender-affirming medical treatments for minors. In a majo…",
    "link": "https://www.motherjones.com/politics/2025/06/supreme-court-upholds-tennessee-ban-on-gender-affirming-care-for-minors/",
    "timestamp": "2025-06-18T14:33:09Z"
  },
  {
    "title": "Ayatollah Khamenei: Iran Will 'Resolutely Resist an Imposed Peace'",
    "description": "The \"supreme leader\" of Iran, Ayatollah Ali Khamenei, declared in comments on Wednesday that his Islamist regime would \"resolutely\" oppose peace with Israel, America, or any of Israel's allies if Iran considers the terms of peace to be \"imposed\" from abroad.\n…",
    "link": "https://www.breitbart.com/middle-east/2025/06/18/ayatollah-khamenei-iran-will-resolutely-resist-an-imposed-peace/",
    "timestamp": "2025-06-18T14:33:03Z"
  },
  {
    "title": "Trump: 'The Iranians proposed coming to the White House for talks'",
    "description": "US President says 'nobody knows what I'm going to do' when asked if he will strike Iranian nuclear facilities.",
    "link": "https://www.israelnationalnews.com/news/410246",
    "timestamp": "2025-06-18T14:33:00Z"
  },
  {
    "title": "Cuomo's lead shrinks with under one week until New York City mayoral primary: poll",
    "description": "The New York City mayoral race tightens as former Gov. Andrew Cuomo faces challenge from progressive Zorhan Mamdani, while President Donald Trump's immigration policies become central campaign issue in Democratic primary.",
    "link": "https://www.foxnews.com/politics/cuomos-lead-shrinks-under-one-week-until-new-york-city-mayoral-primary-poll",
    "timestamp": "2025-06-18T14:32:31Z"
  },
  {
    "title": "Trump does not rule out a strike on Iran: They have a lot of problems and want to negotiate",
    "description": "Maybe I will, maybe I won't, the US president said\nThe post Trump does not rule out a strike on Iran: They have a lot of problems and want to negotiate appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/06/18/trump-does-not-rule-out-a-strike-on-iran-they-have-a-lot-of-problems-and-want-to-negotiate/",
    "timestamp": "2025-06-18T14:32:22Z"
  },
  {
    "title": "On Russian sanctions, Trump’s new position has ‘TACO’ written all over it",
    "description": "President Donald Trump and Russia's President Vladimir Putin arrive to attend a joint press conference after a meeting at the Presidential Palace in Helsinki, on July 16, 2018.",
    "link": "https://biztoc.com/x/715239634f336756",
    "timestamp": "2025-06-18T14:31:43Z"
  },
  {
    "title": "Trump: I told Netanyahu to keep going",
    "description": "United States President Donald Trump told reporters on Wednesday that he speaks with Israeli Prime Minister Benjamin Netanyahu \"every day\" and that he told him to \"keep going\" amid ongoing Israeli str...",
    "link": "https://biztoc.com/x/34a2bcf4be6e2420",
    "timestamp": "2025-06-18T14:31:40Z"
  },
  {
    "title": "Trump slams 'stupid' Fed Chair Jerome Powell ahead of interest rate decision",
    "description": "President Donald Trump slammed Federal Reserve Chair Jerome Powell on Wednesday ahead of the central bank's interest rate decision, calling him \"a stupid person.\"\n\"We have a stupid person, frankly, at the Fed,\" Trump said. \"He probably won't cut.\"\nThe Fed wil…",
    "link": "https://biztoc.com/x/824d816a11699ed1",
    "timestamp": "2025-06-18T14:31:39Z"
  },
  {
    "title": "Supreme Court OKs Tennessee’s ban on gender-affirming care for minors",
    "description": "The Supreme Court has upheld Tennessee’s ban on gender-affirming care for transgender minors, a stunning setback to transgender rights.",
    "link": "https://www.newschannel5.com/news/supreme-court-oks-tennessee-ban-on-gender-affirming-care-for-minors-big-loss-for-transgender-rights",
    "timestamp": "2025-06-18T14:31:30Z"
  },
  {
    "title": "Trump Says Iran Made 'Very Late' White House Request",
    "description": "President Donald Trump is considering whether to join Israel's strikes on Iran.",
    "link": "https://biztoc.com/x/e9404623fda45f4e",
    "timestamp": "2025-06-18T14:31:25Z"
  },
  {
    "title": "'I may do it, I may not do it': Trump keeps Iran strike plans vague as Israel-Iran war escalates",
    "description": "In a tense White House address, Donald Trump left the door open for possible US strikes on Iran, saying “I may do it, I may not do it.” As Israeli jets pound Tehran and smoke rises over the capital, Trump claimed Iran wants to negotiate but warned it may be “…",
    "link": "https://economictimes.indiatimes.com/news/defence/i-may-do-it-i-may-not-do-it-trump-keeps-iran-strike-plans-vague-as-israel-iran-war-escalates/articleshow/121934714.cms",
    "timestamp": "2025-06-18T14:31:18Z"
  },
  {
    "title": "BBVA’s Crypto Call: Wealthy Investors Encouraged To Allocate Up To 7% To Bitcoin",
    "description": "Spanish bank BBVA now recommends that its affluent clients allocate 3-7% of their investment portfolios to cryptocurrencies like Bitcoin (BTC). This announcement was made by Philippe Meyer, head of digital and blockchain solutions at BBVA Switzerland. BBVA’s …",
    "link": "https://bitcoinist.com/bbvas-crypto-call-wealthy-investors-encouraged/",
    "timestamp": "2025-06-18T14:30:30Z"
  },
  {
    "title": "Pop Star Bad Bunny Smears ICE 'Motherf*ckers' in Video Depicting Puerto Rico Raids",
    "description": "Puerto Rican rapper-singer Bad Bunny smeared ICE 'Motherf*ckers' in a video after witnessing what appears to be agents detaining people on a street in Puerto Rico.\nThe post Pop Star Bad Bunny Smears ICE ‘Motherf*ckers’ in Video Depicting Puerto Rico Raids app…",
    "link": "https://www.breitbart.com/entertainment/2025/06/18/pop-star-bad-bunny-smears-ice-motherfckers-in-video-depicting-puerto-rico-raids/",
    "timestamp": "2025-06-18T14:29:51Z"
  },
  {
    "title": "US Companies Want to Interact With Russia After Dialogue Between Leaders Began - RDIF CEO",
    "description": "ST. PETERSBURG (Sputnik) - US companies show more willingness to interact with Russia after the start of the dialogue between Russian President Vladimir Putin and US President Donald Trump, Russian Direct Investment Fund (RDIF) and Russian special presidentia…",
    "link": "https://sputnikglobe.com/20250618/us-companies-want-to-interact-with-russia-after-dialogue-between-leaders-began---rdif-ceo-1122279849.html",
    "timestamp": "2025-06-18T14:29:20Z"
  },
  {
    "title": "Trump extends the TikTok deadline — again",
    "description": "The president pushed TikTok's sale for the third time — this time to September — as the White House says Trump doesn't want the app \"to go dark\"",
    "link": "https://qz.com/tiktok-ban-extended-donald-trump-us-china",
    "timestamp": "2025-06-18T14:29:06Z"
  },
  {
    "title": "Texas Instruments injects $60B into US chip manufacturing",
    "description": "The company will partner with Nvidia, Apple, Ford, SpaceX and others to spur domestic semiconductor production.",
    "link": "https://www.techtarget.com/searchdatacenter/news/366626281/Texas-Instruments-injects-60B-into-US-chip-manufacturing",
    "timestamp": "2025-06-18T14:29:00Z"
  },
  {
    "title": "‘My D*ck Is Bigger Than Your D*ck!’ Piers Morgan Guest Storms Off After Iran Debate Derails Into a Brawl About Ratings",
    "description": "Galloway stormed off interview late Tuesday after a debate on Israel’s conflict with Iran derailed and Morgan blasted him as an “Iranian regime stooge.”\nThe post ‘My D*ck Is Bigger Than Your D*ck!’ Piers Morgan Guest Storms Off After Iran Debate Derails Into …",
    "link": "https://www.mediaite.com/media/tv/my-dck-is-bigger-than-your-dck-piers-morgan-guest-storms-off-after-iran-debate-derails-into-a-brawl-about-ratings/",
    "timestamp": "2025-06-18T14:27:58Z"
  },
  {
    "title": "Supreme Court delivers major blow to transgender rights, upholding Tennessee ban on gender-affirming care for minors",
    "description": "The justices' 6-3 decision in a case from Tennessee effectively protects from legal challenges many efforts by President Donald Trump's Republican administration and state governments to roll back protections for transgender people. Another 26 states have law…",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-delivers-major-blow-to-transgender-rights-upholding-tennessee-ban-on-gender-affirming-care-for-minors",
    "timestamp": "2025-06-18T14:27:56Z"
  },
  {
    "title": "'Stupid person': Trump suggests ousting Powell and making himself head of Fed",
    "description": "President Donald Trump went on a tear against Federal Reserve chair Jerome Powell while standing in front of a group of workers waiting to put up two new flag poles outside the White House.Trump began by talking about the flag poles before veering off the rai…",
    "link": "https://www.rawstory.com/trump-powell-2672395427/",
    "timestamp": "2025-06-18T14:27:52Z"
  },
  {
    "title": "'Very late to be talking': Trump won't say if US would strike Iran",
    "description": "US President Donald Trump on Wednesday (Jun 18) declined to answer reporters' questions on whether the US was planning to strike Iran or its nuclear facilities, and said the Iranians had reached out but he feels \"it's very late to be talking\". \"There's a big …",
    "link": "https://www.channelnewsasia.com/world/israel-iran-conflict-us-trump-strike-late-talking-5189961",
    "timestamp": "2025-06-18T14:27:00Z"
  },
  {
    "title": "The Babylon Bee Would Like To Alert Trump That The Los Angeles Dodgers Have Obtained Nuclear Weapons",
    "description": "In light of the recent heightened state of affairs stemming from threats around the globe, The Babylon Bee would like to take the opportunity to alert President Donald Trump that the Los Angeles Dodgers have obtained nuclear weapons.",
    "link": "https://babylonbee.com/news/the-babylon-bee-would-like-to-alert-trump-that-the-los-angeles-dodgers-have-obtained-nuclear-weapons",
    "timestamp": "2025-06-18T14:26:44Z"
  },
  {
    "title": "Jimmy Kimmel Responds To Trump Calling French President Macron “Publicity Seeking”: “It’s Like Diddy Calling You A Bad Boyfriend”",
    "description": "Kimmel also criticized Trump's approach to helping the Middle East come to a ceasefire.",
    "link": "https://decider.com/2025/06/18/jimmy-kimmel-trump-president-macron-publicity-seeking-diddy-bad-boyfriend/",
    "timestamp": "2025-06-18T14:26:27Z"
  },
  {
    "title": "‘The US is Nazi Germany right now’: Billy Porter and Harrison David Rivers on vital new production",
    "description": "Harrison David Rivers had always hoped the play he began writing in 2015, This Bitter Earth, would end up as a history play, the sort where those staging it could look back, reflect, and marvel at how the world has changed.  “But I don’t think that’s the case…",
    "link": "https://www.thepinknews.com/2025/06/18/billy-porter-harrison-david-rivers-this-bitter-earth-interview/",
    "timestamp": "2025-06-18T14:25:15Z"
  }
]