[
  {
    "title": "Kazakhstan to join Abraham Accords as Trump pushes Mideast peace",
    "description": "Kazakhstan said Thursday it will join the Abraham Accords between Israel and mainly Muslim nations, in a largely symbolic move aimed at boosting US President Donald Trump's push for Middle East peace. But with Trump aiming to shore up his fragile Gaza ceasefi…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/kazakhstan-to-join-abraham-accords-as-trump-pushes-mideast-peace/articleshow/125147194.cms",
    "timestamp": "2025-11-07T00:52:32Z"
  },
  {
    "title": "Pelosi exits stage left: From the Politics Desk",
    "description": "Welcome to the online version of From the Politics Desk, a newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail",
    "link": "https://www.nbcnews.com/politics/politics-news/pelosi-exits-stage-left-politics-desk-rcna242493",
    "timestamp": "2025-11-07T00:52:12Z"
  },
  {
    "title": "U.S. Senate Republicans veto legislation to limit Trump's ability to attack Venezuela",
    "description": "Senate Republicans voted to reject legislation Thursday that would have put a check on U.S. President Donald Trump's ability to launch an attack against Venezuela, as Democrats pressed Congress to take a stronger role in Trump's high-stakes campaign against V…",
    "link": "https://www.cbc.ca/news/world/us-senate-vote-venezuela-war-powers-9.6970156",
    "timestamp": "2025-11-07T00:50:22Z"
  },
  {
    "title": "Donald Trump Announces Kazakhstan Joining Abraham Accords",
    "description": "President Donald Trump said Thursday that Kazakhstan will join the Abraham Accords, the first nation of his second term to do so and a “major step toward peace,\" he announced on Truth Social.\nTrump said he held a call with Israeli Prime Minister Benjamin Neta…",
    "link": "https://biztoc.com/x/bcda93fbb29f3d1b",
    "timestamp": "2025-11-07T00:47:14Z"
  },
  {
    "title": "Trump fuels health concerns with new false claim - NewsBreak",
    "description": "President Donald Trump is being called out after making a wild claim about his deal-making skills, Knewz.com can report. The peacemaker? Former President J",
    "link": "https://www.newsbreak.com/share/4333523785018-trump-fuels-health-concerns-with-new-false-claim?s=a7&amp;share_destination_id=MTY2MjUwOTE3LTE3NjI0NzYxNjg1Njc%3D&amp;pd=0BFZSPLh&amp;hl=en_US&amp;send_time=1762476168&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.44.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-11-07T00:45:42Z"
  },
  {
    "title": "Senate leaders prepare to test Democratic unity on shutdown - Roll Call",
    "description": "Senate leaders plan to take up a stopgap funding measure Friday in a bid to break a Democratic logjam and end the partial government shutdown.",
    "link": "https://rollcall.com/2025/11/06/senate-leaders-prepare-to-test-democratic-unity-on-shutdown/",
    "timestamp": "2025-11-07T00:45:30Z"
  },
  {
    "title": "Why OpenAI went into crisis PR mode Thursday | CNN Business",
    "description": "OpenAI, the world’s leader and ChatGPT parent company, went into panic mode on Thursday over what it said was a very public misstatement.",
    "link": "https://www.cnn.com/2025/11/06/tech/openai-backtracks-government-support-chip-investments",
    "timestamp": "2025-11-07T00:43:42Z"
  },
  {
    "title": "Stewart blames Trump’s “No Kings” dump for GOP election beatdown",
    "description": "The comedian argued that an AI Trump dropping excrement on protestors may have swung the elections this week.",
    "link": "https://www.salon.com/2025/11/06/stewart-blames-trumps-no-kings-dump-for-gop-election-beatdown/",
    "timestamp": "2025-11-07T00:42:27Z"
  },
  {
    "title": "Senate rejects resolution that would block Trump military action against Venezuela",
    "description": "The vote comes after at least 16 military strikes on alleged drug boats in the Caribbean, Eastern Pacific or the coastline of Latin America.",
    "link": "https://www.nbcnews.com/politics/congress/senate-rejects-resolution-block-trump-military-action-venezuela-rcna242485",
    "timestamp": "2025-11-07T00:42:22Z"
  },
  {
    "title": "Trump says more nations lining up to join Abraham Accords after Kazakhstan",
    "description": "Trump announced Kazakhstan’s plan to join the Abraham Accords as he pushes to expand Israel’s normalization with Arab nations.",
    "link": "https://www.foxnews.com/politics/trump-says-more-nations-lining-up-join-abraham-accords-after-kazakhstan",
    "timestamp": "2025-11-07T00:41:36Z"
  },
  {
    "title": "DOJ appeals judge’s order forcing the release of grand jury materials in Comey case",
    "description": "The Justice Department moved Thursday to block a federal magistrate judge’s order requiring prosecutors to immediately turn over grand jury materials in the criminal case against former FBI Director James Comey. U.S. Magistrate Judge William Fitzpatrick stunn…",
    "link": "https://freerepublic.com/focus/f-news/4351186/posts",
    "timestamp": "2025-11-07T00:41:14Z"
  },
  {
    "title": "Republican Senator Complains, ‘Our Leadership Just Ignores Me’",
    "description": "Sen. John Kennedy griped on Thursday that Senate Republican leadership ignores his ideas. \nThe post Republican Senator Complains, ‘Our Leadership Just Ignores Me’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/republican-senator-complains-our-leadership-just-ignores-me/",
    "timestamp": "2025-11-07T00:39:05Z"
  },
  {
    "title": "Stefanik expected to announce run for NY governor: Sources",
    "description": "Her announcement could come as early as Friday, sources told ABC News.",
    "link": "https://abcnews.go.com/Politics/stefanik-expected-announce-run-ny-governor-sources/story?id=127277715",
    "timestamp": "2025-11-07T00:35:09Z"
  },
  {
    "title": "DOJ Admits to Republicans That Epstein Files Are Even Worse for Trump (Ellie Quinlan Houghtaling/New Republic)",
    "description": "Ellie Quinlan Houghtaling / New Republic:\nDOJ Admits to Republicans That Epstein Files Are Even Worse for Trump … Rumors about Donald Trump's connection to Jeffrey Epstein have gripped the Republican Party.  —  A few conservative representatives with ties to …",
    "link": "https://www.memeorandum.com/251106/p147",
    "timestamp": "2025-11-07T00:35:00Z"
  },
  {
    "title": "Fact-checking Trump’s claims on mail-in voting in California",
    "description": "The president has long been a vocal critic of mail-in voting, blaming it for his 2020 election loss and often tying mail-in ballots to unproven claims of voter fraud.",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-trumps-claims-on-mail-in-voting-in-california",
    "timestamp": "2025-11-07T00:33:33Z"
  },
  {
    "title": "Man who threw sandwich at federal agent found not guilty of assault",
    "description": "Sean Charles Dunn became a symbol of resistance to Mr Trump's deployment of federal agents in the nation's capital following a viral video showing him tossing a sandwich at a Customs and Border Protection agent.",
    "link": "https://www.abc.net.au/news/2025-11-07/man-who-threw-sandwich-at-federal-agent-found-not-guilty-of-assa/105982820",
    "timestamp": "2025-11-07T00:31:21Z"
  },
  {
    "title": "Dana White Fights Back: UFC Boss Confirms FBI Investigation Over 'Fixed Fighting' Allegations After Suspicious Betting Activity on Brawler",
    "description": "UFC's head honcho spoke out on Isaac Dulgarian allegedly throwing his fight for betting purposes, saying he called the FBI after the brawl.",
    "link": "https://radaronline.com/sports-betting/dana-white-slams-ufc-fixed-fight-allegations-fbi-investigation/",
    "timestamp": "2025-11-07T00:30:25Z"
  },
  {
    "title": "Supreme Court lets Trump block transgender and nonbinary people from choosing passport sex markers (Lindsay Whitehurst/Associated Press)",
    "description": "Lindsay Whitehurst / Associated Press:\nSupreme Court lets Trump block transgender and nonbinary people from choosing passport sex markers  —  Add AP News on Google Add AP News as your preferred source to see more of our stories on Google.  Share  —  The Supre…",
    "link": "https://www.memeorandum.com/251106/p146",
    "timestamp": "2025-11-07T00:30:03Z"
  },
  {
    "title": "Republicans Refuse To Check Trump's Push For War With Venezuela",
    "description": "“The Constitutional principles haven’t changed. What has changed is Republicans’ willingness to defend those principles,\" an anti-war critic said after a Senate vote.",
    "link": "https://www.huffpost.com/entry/senate-fails-to-block-trump-from-attacking-venezuela_n_690d184fe4b027afb322dac6",
    "timestamp": "2025-11-07T00:29:34Z"
  },
  {
    "title": "Watch Live: Donald Trump Holds Dinner with Central Asian Countries' Presidents",
    "description": "President Donald Trump holds a dinner with the leaders of five central Asian countries' leaders at the White House on Thursday, November 6.\nThe post Watch Live: Donald Trump Holds Dinner with Central Asian Countries’ Presidents appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/06/watch-live-donald-trump-holds-dinner-with-central-asian-countries-presidents/",
    "timestamp": "2025-11-07T00:27:00Z"
  },
  {
    "title": "Supreme Court lets Trump block transgender and nonbinary people from choosing passport sex markers",
    "description": "The Supreme Court on Thursday allowed President Donald Trump’s administration to enforce a policy blocking transgender and nonbinary people from choosing passport sex markers that align with their gender identity. The decision is Trump’s latest win on the cou…",
    "link": "https://freerepublic.com/focus/f-news/4351179/posts",
    "timestamp": "2025-11-07T00:25:15Z"
  },
  {
    "title": "What’s the Right US Response to Mass Killings of Christians in Africa? New Report Calls for ‘Real Action.’",
    "description": "President Donald Trump is drawing attention to the persecution of Christians in Africa, which has created a moment of “leverage” and momentum for “real action,” according to a new report from The... Read More\nThe post What’s the Right US Response to Mass Kill…",
    "link": "https://www.dailysignal.com/2025/11/06/whats-right-us-response-mass-killings-christians-africa-new-report-suggests-options/",
    "timestamp": "2025-11-07T00:21:14Z"
  },
  {
    "title": "In the shadow of U.S. withdrawal, leaders urge action at COP30 UN climate summit in Brazil",
    "description": "Brazilian President Luiz Inácio Lula da Silva hopes to convince world powers to mobilize enough funds to halt the ongoing destruction of climate-stabilizing tropical rainforests in danger around the world and advance the many unmet promises laid out at previo…",
    "link": "https://www.cbc.ca/news/science/cop30-climate-brazil-amazon-9.6969984",
    "timestamp": "2025-11-07T00:20:30Z"
  },
  {
    "title": "Vote To Block Trump From Striking Narco Boats In Venezuela Fails, As Shutdown Continues",
    "description": "The Senate on Thursday voted down an effort to block President Donald Trump from conducting strikes against alleged drug smugglers off the coast of Venezuela without congressional approval. The War Powers Resolution, introduced by Democratic Virginia Sen. Tim…",
    "link": "https://freerepublic.com/focus/f-news/4351177/posts",
    "timestamp": "2025-11-07T00:20:10Z"
  },
  {
    "title": "Supreme Court revives Trump admin ban on transgender, nonbinary passport identification",
    "description": "The executive order barring self-identification had been stayed by a lower court.",
    "link": "https://www.salon.com/2025/11/06/supreme-court-revives-trump-admin-ban-on-transgender-nonbinary-passport-identification/",
    "timestamp": "2025-11-07T00:15:49Z"
  },
  {
    "title": "Japan’s Iron Lady",
    "description": "Why did it take so long for Japan to have a female prime minister? This may seem like an unfair question. After all, the United States has never elected a female president, and a woman has never presided over the Communist Party of China. Even the Netherlands…",
    "link": "https://english.khabarhub.com/2025/07/504629/",
    "timestamp": "2025-11-07T00:15:32Z"
  },
  {
    "title": "Bombshell: James Comey's Prosecutor Daughter Offered Epstein Freedom — If He Implicated Trump in Sex Crimes, Cellmate Claims",
    "description": "James Comey's daughter allegedly offered Jeffrey Epstein freedom in exchange for implicating Donald Trump, a former cellmate of his claimed.",
    "link": "https://radaronline.com/p/james-comey-daughter-jeffrey-epstein-offered-freedom-for-implicating-donald-trump/",
    "timestamp": "2025-11-07T00:15:06Z"
  },
  {
    "title": "Trump Announces Deals to Drop Prices Substantially on Ozempic, Other Major Drugs",
    "description": "President Donald Trump announced agreement on Most Favored Nations (MFN) drug pricing deals with Eli Lilly & Company and Novo Nordisk, marking the fourth and fifth major drug companies with which the administration has reached deals in recent months.\nThe post…",
    "link": "https://www.breitbart.com/politics/2025/11/06/trump-announces-deals-to-drop-prices-substantially-on-ozempic-other-major-drugs/",
    "timestamp": "2025-11-07T00:14:35Z"
  },
  {
    "title": "Are we waltzing Mat",
    "description": "We are Waltzing Matilda in a lot of areas. We have lost the sense of being stewards of all God created, forgetting that this one earth is our only home.",
    "link": "https://www.ncspin.com/are-we-waltzing-mat",
    "timestamp": "2025-11-07T00:14:02Z"
  },
  {
    "title": "Are we waltzing Matilda?",
    "description": "We are Waltzing Matilda in a lot of areas. We have lost the sense of being stewards of all God created, forgetting that this one earth is our only home.",
    "link": "https://www.ncspin.com/are-we-waltzing-matilda",
    "timestamp": "2025-11-07T00:14:00Z"
  },
  {
    "title": "In Power, Will Mamdani Be Socialist — or Sly?",
    "description": "Escape from New York is the name of a 1981 film. Now it’s also, many fear, going to be a reality with Mayor-elect Zohran Kwame Mamdani’s impending socialist makeover of NYC. Why, commentator Bill O’Reilly has predicted that his ascendancy will spark an exodus…",
    "link": "https://freerepublic.com/focus/f-news/4351176/posts",
    "timestamp": "2025-11-07T00:13:54Z"
  },
  {
    "title": "Elon Musk Poised To Become World’s First Trillionaire After Shareholder Vote",
    "description": "Tesla shareholders voted Thursday to approve an enormous compensation package that could make Elon Musk the world’s first trillionaire.",
    "link": "https://dailycaller.com/2025/11/06/elon-musk-first-trillionaire-shareholder-meeting-tesla/",
    "timestamp": "2025-11-07T00:10:03Z"
  },
  {
    "title": "Trump lawyer may have inadvertently revealed grand jury info: legal expert",
    "description": "A lawyer and ally of President Donald Trump may have revealed secret grand jury information while speaking to a far-right commentator, according to one legal expert. Mike Davis, who founded the Trump-focused Article III Project, bragged that his \"good friend\"…",
    "link": "https://www.rawstory.com/florida-grand-jury/",
    "timestamp": "2025-11-07T00:09:07Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures falter in bid to recover from tech-led sell-off",
    "description": "Markets are muted after a steep sell-off in stocks with Musk's $1T pay package and layoffs in focus.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-falter-in-bid-to-recover-from-tech-led-sell-off-000747991.html",
    "timestamp": "2025-11-07T00:07:47Z"
  },
  {
    "title": "Stock market today: Nasdaq, S&P 500, Dow falter in bid to recover from tech-led sell-off",
    "description": "Markets fell after a steep sell-off in stocks with Musk's $1T pay package and layoffs in focus.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-nasdaq-sp-500-dow-falter-in-bid-to-recover-from-tech-led-sell-off-000747762.html",
    "timestamp": "2025-11-07T00:07:47Z"
  },
  {
    "title": "Stock market today: Nasdaq, S&P 500, Dow sink as another tech sell-off has stocks on track for brutal week",
    "description": "Markets fell after a steep sell-off in stocks with Musk's $1T pay package and layoffs in focus.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-nasdaq-sp-500-dow-sink-as-another-tech-sell-off-has-stocks-on-track-for-brutal-week-000747395.html",
    "timestamp": "2025-11-07T00:07:47Z"
  },
  {
    "title": "Ozempic for all — Trump the deal-maker aims to make America slim again",
    "description": "GLP-1 drugs make it easier to lose weight, and to avoid associated serious health problems — and President Trump's latest deal will bring down their high costs. It's a win-win-win.",
    "link": "https://nypost.com/2025/11/06/opinion/ozempic-for-all-trump-the-deal-maker-aims-to-make-america-slim-again/",
    "timestamp": "2025-11-07T00:07:11Z"
  },
  {
    "title": "Senate GOP Kills Bill That Would Block Trump Boat Bombings and War on Venezuela",
    "description": "Senate Republicans on Thursday rejected a bipartisan war powers resolution aimed at stopping the Trump administration from continuing its bombing of alleged drug boats or attacking Venezuela without lawmakers' assent, as required by law.US senators voted 51-4…",
    "link": "https://www.commondreams.org/news/senate-gop-kills-bill-that-would-block-trump-boat-bombings-and-war-on-venezuela",
    "timestamp": "2025-11-07T00:06:41Z"
  },
  {
    "title": "As Americans Live Paycheck to Paycheck, Tesla Shareholders Approve Musk's $1 Trillion Package",
    "description": "Elon Musk is the world's richest person, with an estimated net worth of nearly $500 billion, but the Tesla CEO could become the world's first trillionaire, thanks to a controversial pay package approved Thursday by the electric vehicle company's shareholders.…",
    "link": "https://www.commondreams.org/news/elon-musk-1-trillion",
    "timestamp": "2025-11-07T00:06:08Z"
  },
  {
    "title": "Concerns across Europe that Ireland's military shortfalls could put major summit at risk",
    "description": "Security concerns are being raised as Ireland prepares to take on the rotating presidency of the EU next summer.",
    "link": "https://www.thejournal.ie/eu-presidency-6865198-Nov2025/",
    "timestamp": "2025-11-07T00:05:43Z"
  },
  {
    "title": "Trump confirms Kazakhstan will join Abraham Accords: First of many in my second term",
    "description": "US President Donald Trump confirmed on Thursday that Kazakhstan would be joining the Abraham Accords.\"I just held a great call between Prime Minister Benjamin Netanyahu, of Israel, and President Kassym-Jomart Tokayev, of Kazakhstan. Kazakhstan is the first Co…",
    "link": "https://www.israelnationalnews.com/flashes/669994",
    "timestamp": "2025-11-07T00:05:42Z"
  },
  {
    "title": "Trump’s Ozempic Deal Has a Major Flaw",
    "description": "Obesity drugs are still too expensive.",
    "link": "https://www.theatlantic.com/health/2025/11/trump-glp1-deal-wegovy-zepbound/684851/",
    "timestamp": "2025-11-07T00:05:00Z"
  },
  {
    "title": "U.S. deal could cut costs for popular weight-loss drugs. What’s that mean for Canada?",
    "description": "A new deal with major drugmakers, unveiled by U.S. President Donald Trump on Thursday, aims to expand coverage and cut prices for popular weight-loss drugs south of the border. So how much could Trump’s announcement really cut costs? And will Canadians also b…",
    "link": "https://www.cbc.ca/news/health/ozempic-trumprx-cheaper-insurance-9.6970197",
    "timestamp": "2025-11-07T00:04:09Z"
  },
  {
    "title": "'Landslide': Vance's Half-Brother Caught Up In Election Bloodbath",
    "description": "Cory Bowman, JD Vance's half-brother, lost in a landslide for Cincinnati mayor to Democrat Aftab Pureval during the election bloodbath. Pureval curb-stomped Bowman on election day, winning reelection with more than 78% of the vote, while Bowman received 22%. …",
    "link": "https://crooksandliars.com/2025/11/landslide-vances-half-brother-caught",
    "timestamp": "2025-11-07T00:02:40Z"
  },
  {
    "title": "Bonfire of our legalities",
    "description": "The next 13 months will be a test of the committment to a progressive democracy.",
    "link": "https://www.ncspin.com/bonfire-of-our-legalities",
    "timestamp": "2025-11-07T00:02:00Z"
  },
  {
    "title": "Crypto Leaders React to Mamdani’s Win: Will New York’s Blockchain Adoption Come to a Halt?",
    "description": "The election of Zohran Mamdani as mayor of New York City sent ripples through the cryptocurrency and blockchain communities, raising questions about the future of the city’s digital-asset ecosystem. Related Reading: Ripple CEO Drops Truth Bomb On XRP Vs. RLUS…",
    "link": "https://bitcoinist.com/crypto-leaders-react-to-mamdanis-win-will-new-yorks/",
    "timestamp": "2025-11-07T00:00:27Z"
  },
  {
    "title": "Ex-LSU Head Coach Brian Kelly Says His Time There Fell Short of Expectations",
    "description": "Brian Kelly shared a statement with fans on Thursday, more than a week after he was fired by LSU in the fourth season of a 10-year contract.",
    "link": "https://www.foxsports.com/stories/college-football/ex-lsu-head-coach-brian-kelly-says-his-time-fell-short-expectations",
    "timestamp": "2025-11-07T00:00:13Z"
  },
  {
    "title": "Victor Davis Hanson: Trump Scared China Into Playing ‘Nice’ With The US Again",
    "description": "Hoover Institution fellow Victor Davis Hanson says for months, Americans were told that the US was embroiled in a losing “trade war” with China, preventing the two world powers from striking any sort of deal. However, in the face of this supposed adversity, C…",
    "link": "https://www.hoover.org/research/victor-davis-hanson-trump-scared-china-playing-nice-us-again",
    "timestamp": "2025-11-07T00:00:00Z"
  },
  {
    "title": "NOVA Determines Virginia’s Democrat Sweep",
    "description": "Virginia Democrats swept the statewide elections Tuesday night–thanks to Northern Virginia voters who accounted for 88% of Governor-elect Abigail Spanberger’s victory margin.  Democrat Ghazala Hashmi... Read More\nThe post NOVA Determines Virginia’s Democrat S…",
    "link": "https://www.dailysignal.com/2025/11/06/nova-determines-virginias-democrat-sweep/",
    "timestamp": "2025-11-07T00:00:00Z"
  },
  {
    "title": "Pressure to publish is rising as research time shrinks, finds survey of scientists",
    "description": "Researchers feel that pressures to publish are increasing, but the time and resources available to do research are decreasing, according to a survey by Elsevier.",
    "link": "https://www.nature.com/articles/d41586-025-03623-2",
    "timestamp": "2025-11-07T00:00:00Z"
  },
  {
    "title": "International PhD student numbers in US hold steady — for now",
    "description": "Trend flies in face of Trump-administration policies, but could yet see a rapid decrease, especially in science fields.",
    "link": "https://www.nature.com/articles/d41586-025-03653-w",
    "timestamp": "2025-11-07T00:00:00Z"
  },
  {
    "title": "Supreme Court Allows Trump to Enforce Requiring Biological Sex on Passports",
    "description": "The Supreme Court on Thursday allowed the Trump administration to enforce a policy restricting sex designations on passports to \"male\" and \"female\" based on the sex an individual was at birth. \nThe post Supreme Court Allows Trump to Enforce Requiring Biologic…",
    "link": "https://www.breitbart.com/politics/2025/11/06/supreme-court-allows-trump-to-enforce-requiring-biological-sex-on-passports/",
    "timestamp": "2025-11-06T23:58:23Z"
  },
  {
    "title": "Trump administration set to appeal judge's ruling on SNAP benefits",
    "description": "The Trump administration has indicated it will appeal a federal judge’s ruling that it must act by Friday to help \"hungry\" recipients.",
    "link": "https://www.msnbc.com/msnbc/news/trump-administration-set-appeal-strict-ruling-snap-benefits-rcna242463",
    "timestamp": "2025-11-06T23:55:47Z"
  },
  {
    "title": "America Begins Clapping Back at Donald Trump",
    "description": "Susan B. Glasser writes that, in a week of political exits, we have a reminder that Trump’s time is coming soon, too.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/america-begins-clapping-back-at-donald-trump",
    "timestamp": "2025-11-06T23:52:41Z"
  },
  {
    "title": "Google’s biased AI accused me of rape — shut down its rampant lies",
    "description": "Google’s Gemma large language fabricated an elaborate criminal allegation against me — and it’s not the first time the company’s products have smeared and targeted conservatives.…",
    "link": "https://nypost.com/2025/11/06/opinion/us-senator-marsha-blackburn-googles-biased-ai-accused-me-of-rape-shut-down-its-rampant-lies/",
    "timestamp": "2025-11-06T23:49:44Z"
  },
  {
    "title": "Dems plot to 'take advantage' as Trump at his 'most volatile' point of shutdown: report",
    "description": "Democrats sense blood in the water in the shutdown standoff following their blowout election wins across the country this week — and are debating among themselves how best to press their upper hand, according to a new report.The core issue of the shutdown con…",
    "link": "https://www.rawstory.com/democrats-trump-2674273272/",
    "timestamp": "2025-11-06T23:48:28Z"
  },
  {
    "title": "Video: Trump Oval Office Announcement Cut Short After Man Suffers Medical Emergency",
    "description": "The White House also made sure to squash any nasty rumors or hearsay to emerge from this harrowing incident.",
    "link": "https://www.westernjournal.com/video-trump-oval-office-announcement-cut-short-man-suffers-medical-emergency/",
    "timestamp": "2025-11-06T23:46:13Z"
  },
  {
    "title": "White House removes Trump-themed Knicks logo post aimed at Mamdani following team's complaint: report",
    "description": "The White House deleted its post featuring an altered Knicks logo reading, 'Trump Is Your President,' after a complaint by the team.",
    "link": "https://www.foxnews.com/sports/white-house-removes-trump-themed-knicks-logo-post-aimed-mamdani-following-teams-complaint-report",
    "timestamp": "2025-11-06T23:43:43Z"
  },
  {
    "title": "Ukraine in ‘Positive’ Talks with US on Missiles, Ambassador Says",
    "description": "Ukraine Ambassador Olha Stefanishyna said her country is engaged in “positive” talks about buying Tomahawk missiles and other long-range weaponry, even after President Donald Trump signaled he didn’t want to send them to the country.",
    "link": "https://financialpost.com/pmn/business-pmn/ukraine-in-positive-talks-with-us-on-missiles-ambassador-says",
    "timestamp": "2025-11-06T23:41:26Z"
  },
  {
    "title": "Senate sinks measure to block military action against Venezuela (Politico)",
    "description": "Politico:\nSenate sinks measure to block military action against Venezuela  —  The Senate on Thursday rejected legislation that would have required approval from Congress before President Donald Trump could take military action against Venezuela, despite bipar…",
    "link": "https://www.memeorandum.com/251106/p135",
    "timestamp": "2025-11-06T23:40:02Z"
  },
  {
    "title": "Ukraine in ‘positive’ talks with US on missiles, ambassador says, Bloomberg News reports",
    "description": "(Reuters) -Ukraine is engaged in \"positive\" talks about buying Tomahawk missiles and other long-range weaponry with the United States, Ukraine's ambassador to the U.S., Olha Stefanishyna, told Bloomberg News on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/07/ukraine-in-positive-talks-with-us-on-missiles-ambassador-says-bloomberg-news-reports",
    "timestamp": "2025-11-06T23:40:00Z"
  },
  {
    "title": "Elon Musk secures record $1 trillion Tesla pay package, largest ever for a CEO",
    "description": "The pay package -- crafted to ensure Musk's continued service to Tesla as the company pursues breakthrough technology on artificial intelligence and robotics -- won more than 75 percent support from shareholders",
    "link": "https://www.livemint.com/companies/news/elon-musk-secures-record-1-trillion-tesla-pay-package-largest-ever-for-a-ceo-11762471824513.html",
    "timestamp": "2025-11-06T23:38:37Z"
  },
  {
    "title": "Chile presidential hopeful vows to expel ‘criminal’ migrants to El Salvador",
    "description": "Chilean far-right presidential candidate Johannes Kaiser defended the use of lethal force against criminals Thursday in an AFP interview, and said he would deport migrants with criminal records to El Salvador’s brutal anti-gang prison. Kaiser, 49, has tapped …",
    "link": "https://www.digitaljournal.com/world/chile-presidential-hopeful-vows-to-expel-criminal-migrants-to-el-salvador/article",
    "timestamp": "2025-11-06T23:37:20Z"
  },
  {
    "title": "Newsom: I hate politicians who lie (except for Joe Biden)",
    "description": "Ex-prez 'lied about the man who was involved in the fatal vehicle crash that killed his first wife'",
    "link": "https://www.wnd.com/2025/11/newsom-i-hate-politicians-who-lie-except-joe/",
    "timestamp": "2025-11-06T23:37:07Z"
  },
  {
    "title": "EXCLUSIVE: Why Republicans Dominated In This New York Suburb As The Rest Of The Country Went Blue",
    "description": "Republicans had a big night in a large, suburban county bordering New York City — while the party suffered crushing defeats in other parts of the United States. Republican Nassau County Executive Bruce Blakeman, who had the endorsement of President Donald Tru…",
    "link": "https://dailycaller.com/2025/11/06/nassau-county-bruce-blakeman-elections-republican-party/",
    "timestamp": "2025-11-06T23:37:05Z"
  },
  {
    "title": "Economy Shows Promising Trends as Trump Prioritizes ‘Typical Hardworking Family’",
    "description": "Even as Senate Democrats continue to prevent the end of the federal government shutdown, there are promising signs in the economy under President Donald Trump.... Read More\nThe post Economy Shows Promising Trends as Trump Prioritizes ‘Typical Hardworking Fami…",
    "link": "https://www.dailysignal.com/2025/11/06/economy-shows-promising-trends-as-trump-prioritizes-typical-hardworking-family/",
    "timestamp": "2025-11-06T23:35:00Z"
  },
  {
    "title": "‘Kayleigh, Come On’: Fox’s Tarlov Calls Out Co-Host for Claiming Trump ‘Was Genuinely Concerned’ When Joking About Pelosi Hammer Attack",
    "description": "Jessica Tarlov expressed disbelief at co-host Kayleigh McEnany, who insisted that a coarse joke President Donald Trump made about the hammer attack on Speaker Emerita Nancy Pelosi's husband was actually a show of genuine concern.\nThe post ‘Kayleigh, Come On’:…",
    "link": "https://www.mediaite.com/media/tv/kayleigh-come-on-foxs-tarlov-calls-out-co-host-for-claiming-trump-was-genuinely-concerned-when-joking-about-pelosi-hammer-attack/",
    "timestamp": "2025-11-06T23:33:33Z"
  },
  {
    "title": "Democratic giant, trailblazer and Trump foe Nancy Pelosi to retire",
    "description": "Nancy Pelosi, a towering figure in U.S. politics and the first woman to serve as House speaker, announced Thursday that she would step down after the next election.",
    "link": "https://www.japantimes.co.jp/news/2025/11/07/world/politics/nancy-pelosi-retire/",
    "timestamp": "2025-11-06T23:32:00Z"
  },
  {
    "title": "The Election of Mamdani: What It Means – And What It Doesn’t Mean",
    "description": "To the Democratic Socialists of America and their fellow travelers, The Moment has arrived. With the victory of Zohran Mamdani in New York City’s mayoral election Tuesday night, the DSA has another attractive face to add to its advocates nationwide, someone t…",
    "link": "https://www.shtfplan.com/headline-news/the-election-of-mamdani-what-it-means-and-what-it-doesnt-mean",
    "timestamp": "2025-11-06T23:30:41Z"
  },
  {
    "title": "Vote To Block Trump From Striking Narco Boats In Venezuela Fails, As Shutdown Continues",
    "description": "The Senate on Thursday voted down an effort to block President Donald Trump from conducting strikes against alleged drug smugglers off the coast of Venezuela without congressional approval. The War Powers Resolution, introduced by Democratic Virginia Sen. Tim…",
    "link": "https://dailycaller.com/2025/11/06/senate-vote-trump-narco-boats-venezuela-fails-shutdown/",
    "timestamp": "2025-11-06T23:30:24Z"
  },
  {
    "title": "Voters Repudiate Trump Administration in Resounding Fashion",
    "description": "The party that’s having the most fun is the one that’s winning.",
    "link": "https://slate.com/podcasts/political-gabfest/2025/11/politics-voters-repudiate-trump-democrats-regain-confidence-with-wins",
    "timestamp": "2025-11-06T23:30:00Z"
  },
  {
    "title": "Experts warn explosive nuclear testing would trigger escalation",
    "description": "Washington DC (UPI) Nov 6, 2025 \n\n\n President Donald Trump's calls to ramp up nuclear weapons testing last week have put nuclear watchdogs and world leaders on alert while experts say the United States has little to gain. \n In a post on Truth Social on Oct. 2…",
    "link": "https://www.spacewar.com/reports/Experts_warn_explosive_nuclear_testing_would_trigger_escalation_999.html",
    "timestamp": "2025-11-06T23:27:31Z"
  },
  {
    "title": "Survey Shows Large Majority of Grassroots Democrats Back Primary Challenges for Top Dems",
    "description": "Democrats’ sweeping victories in elections across the country this week may not be buying goodwill for party leadership among grassroots Democratic activists.Progressive organizing group Our Revolution on Thursday released a survey over more than 3,500 voters…",
    "link": "https://www.rawstory.com/democrats-2674273448/",
    "timestamp": "2025-11-06T23:27:24Z"
  },
  {
    "title": "Why Congress Is So Mad at the Pentagon",
    "description": "Lawmakers—including Republicans—are frustrated over a lack of communication.",
    "link": "http://foreignpolicy.com/2025/11/06/congress-pentagon-hearings-colby-dahmer-velez-green/",
    "timestamp": "2025-11-06T23:27:24Z"
  },
  {
    "title": "Newsom to attend UN climate summit in Brazil as Trump skips",
    "description": "Gov. Gavin Newsom (D-CA) is gearing up to attend the 30th annual United Nations Climate Change Conference in Brazil next week, while no member of the Trump administration plans to show up. Newsom is looking to expand his international status after California …",
    "link": "https://freerepublic.com/focus/f-news/4351166/posts",
    "timestamp": "2025-11-06T23:25:58Z"
  },
  {
    "title": "Supreme Court hands Trump victory on transgender passport policy change",
    "description": "The Supreme Court ruled 6-3 to temporarily allow the State Department to require people to state their biological sex on new or renewed passports in a victory for the Trump administration.",
    "link": "https://www.foxnews.com/politics/supreme-court-hands-trump-major-win-transgender-passport-policy-change",
    "timestamp": "2025-11-06T23:24:32Z"
  },
  {
    "title": "Fox News remains silent amid firestorm over Tucker Carlson and Nick Fuentes",
    "description": "Fox News has avoided mentioning the controversy of Tucker Carlson interviewing the Holocaust-denying Nick Fuentes, according to a review Media Matters conducted.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/fox-news-nick-fuentes-tucker-carlson-rcna242194",
    "timestamp": "2025-11-06T23:24:10Z"
  },
  {
    "title": "Man collapses behind Donald Trump during White House announcement",
    "description": "<p>O﻿fficial rushed to help the ailing pharmaceutical executive as the US president looked on. </p>",
    "link": "https://www.9news.com.au/world/main-faints-next-to-donald-trump-in-white-house/2fa93cec-ef39-4cf2-951e-eafde0b7170c",
    "timestamp": "2025-11-06T23:24:04Z"
  },
  {
    "title": "Explaining Democrats’ Request to Restore Foreign Aid",
    "description": "Q: Did Democrats request funding for “climate resilience” in Honduras, “civic engagement” in Zimbabwe, and “LGBTQI+ democracy grants” in the Balkans, to end the government shutdown?\nA: A Democratic proposal would restore almost $5 billion in unused funding fo…",
    "link": "https://www.factcheck.org/2025/11/explaining-democrats-request-to-restore-foreign-aid/",
    "timestamp": "2025-11-06T23:23:20Z"
  },
  {
    "title": "‘I Truly Believe They’re a Mess’: Jon Stewart Fears Democrats Will ‘Squander’ Recent Wins",
    "description": "Comedian Jon Stewart wasn't completely convinced of Democrats' dominance in the recent elections, and, asked guests Chris Hayes and David Plouffe, \"How will they squander it?\"\nThe post ‘I Truly Believe They’re a Mess’: Jon Stewart Fears Democrats Will ‘Squand…",
    "link": "https://www.mediaite.com/media/news/i-truly-believe-theyre-a-mess-jon-stewart-fears-democrats-will-squander-recent-wins/",
    "timestamp": "2025-11-06T23:20:37Z"
  },
  {
    "title": "Trump Scared China Into Playing ‘Nice’ With the US Again",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Trump Scared China Into Playing ‘Nice’ With the US Again appeared first…",
    "link": "https://www.dailysignal.com/2025/11/06/trump-scared-china-into-playing-nice-with-the-us-again/",
    "timestamp": "2025-11-06T23:20:36Z"
  },
  {
    "title": "Senate readies war powers vote to oppose Trump’s Venezuela threats",
    "description": "It’s unclear whether the measure will pass after administration officials tried to reassure Republicans who signaled they may support the effort.The Senate will vote Thursday on a bipartisan measure to block President Donald Trump from attacking Venezuelan te…",
    "link": "https://freerepublic.com/focus/f-news/4351164/posts",
    "timestamp": "2025-11-06T23:18:54Z"
  },
  {
    "title": "What happened Tuesday?",
    "description": "We don’t want to live in an authoritarian regime run by a demented game show host who is losing his grip on reality more and more each day. Our votes matter too, not just MAGA’s.",
    "link": "https://www.ncspin.com/what-happened-tuesday",
    "timestamp": "2025-11-06T23:16:58Z"
  },
  {
    "title": "Why Dick Cheney's death feels like a loyalty test for MAGA Republicans",
    "description": "Former Vice President Dick Cheney had a complicated relationship with the Republican Party over the past 10 years. Will Trump partisans come to his funeral?",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/dick-cheney-funeral-litmus-test-trump-loyal-rcna242265",
    "timestamp": "2025-11-06T23:16:25Z"
  },
  {
    "title": "Senate shutdown vote possible Friday",
    "description": "The shutdown stalemate has made history, but there are signs the ice is melting.",
    "link": "https://www.bostonherald.com/2025/11/06/senate-shutdown-vote-possible-friday/",
    "timestamp": "2025-11-06T23:16:21Z"
  },
  {
    "title": "Trump Reacts to Pelosi Retirement: 'A Great Thing for America'",
    "description": "President Donald Trump celebrated the news of former House Speaker Nancy Pelosi's (D-CA) upcoming retirement, calling the nearing end to her long political career a \"great thing for America.\"\nThe post Trump Reacts to Pelosi Retirement: ‘A Great Thing for Amer…",
    "link": "https://www.breitbart.com/politics/2025/11/06/trump-reacts-to-pelosi-retirement-a-great-thing-for-america/",
    "timestamp": "2025-11-06T23:16:00Z"
  },
  {
    "title": "Rand Paul Warns of “Warmongers,” but MAGA Rejects Venezuela War Powers Bill",
    "description": "It was potentially the last chance for Paul, Tim Kaine, and Adam Schiff to block U.S. military action in Venezuela with a war powers resolution.\nThe post Rand Paul Warns of “Warmongers,” but MAGA Rejects Venezuela War Powers Bill appeared first on The Interce…",
    "link": "https://theintercept.com/2025/11/06/venezuela-war-powers-maga-rand-paul/",
    "timestamp": "2025-11-06T23:14:11Z"
  },
  {
    "title": "Trump unveils deals to lower prices of weight loss drugs",
    "description": "Weight loss drug brands Ozempic, Wegovy and Mounjaro have risen sharply in popularity in the US, but they are still considered unaffordable. US President Donald Trump held a press conference on Thursday to announce a groundbreaking deal with pharmaceutical gi…",
    "link": "https://www.dw.com/en/trump-unveils-deals-to-lower-prices-of-weight-loss-drugs/a-74651046",
    "timestamp": "2025-11-06T23:12:00Z"
  },
  {
    "title": "How long will the US government shutdown last?",
    "description": "The federal government shutdown is now the longest in US history.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/11/6/how-long-will-the-us-government-shutdown-last",
    "timestamp": "2025-11-06T23:09:21Z"
  },
  {
    "title": "Judge orders Trump to fully fund SNAP benefits by Friday | Honolulu Star-Advertiser",
    "description": "A federal judge today ordered President Donald Trump’s administration to fully fund food aid for 42 million low-income Americans in November by Friday, blocking its plan to only provide reduced benefits during the government shutdown.",
    "link": "https://www.staradvertiser.com/2025/11/06/breaking-news/judge-orders-trump-to-fully-fund-snap-benefits-by-friday/",
    "timestamp": "2025-11-06T23:08:22Z"
  },
  {
    "title": "President Trump pardons former TN House Speaker Glen Casada, chief of staff, after corruption convictions",
    "description": "President Donald Trump has pardoned the disgraced former Speaker of the Tennessee House Glen Casada and his co-conspirators after their corruption convictions and sentencing.",
    "link": "https://www.wsmv.com/2025/11/06/president-trump-pardons-former-tn-house-speaker-glen-casada-chief-staff-after-corruption-convictions/",
    "timestamp": "2025-11-06T23:08:16Z"
  },
  {
    "title": "Can the Australian left replicate Zohran Mamdani’s success?",
    "description": "Getting inspiration is one thing, but could Mamdani's campaign playbook translate to Australian politics?\nThe post Can the Australian left replicate Zohran Mamdani’s success? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/11/07/crikey-podcast-australian-left-zohran-mamdani/",
    "timestamp": "2025-11-06T23:07:28Z"
  },
  {
    "title": "30 years of climate talks: Progress, pitfalls and a planet in peril",
    "description": "As leaders gather for the U.N. climate summit in Brazil this week, the data charting progress in the fight against global warming tells a sobering story.",
    "link": "https://www.japantimes.co.jp/environment/2025/11/07/climate-change/cop30-planet-peril/",
    "timestamp": "2025-11-06T23:07:00Z"
  },
  {
    "title": "UNSC votes to drop sanctions on Syria’s al-Sharaa ahead of Washington visit",
    "description": "Fourteen members of the UN Security Council voted in favour of the US-drafted resolution. China abstained.",
    "link": "https://www.aljazeera.com/news/2025/11/6/unsc-votes-to-drop-sanctions-on-syrias-al-sharaa-ahead-of-washington-visit",
    "timestamp": "2025-11-06T23:06:46Z"
  },
  {
    "title": "Judge orders Trump administration to improve conditions at Chicago-area immigration site",
    "description": "A judge has ordered federal officials to improve conditions for detainees at one of the Chicago-area detention centers being used by Trump’s administration as it wages a mass incarceration and deportation agenda that has swept up undocumented immigrants and A…",
    "link": "https://www.msnbc.com/top-stories/latest/broadview-chicago-immigration-detention-ice-trump-rcna242451",
    "timestamp": "2025-11-06T23:05:06Z"
  },
  {
    "title": "Kazakhstan, which already recognises Israel, to join ‘Abraham Accords’",
    "description": "The Central Asian country, which established formal ties with Israel in 1992, says being part of the deals is 'natural'.",
    "link": "https://www.aljazeera.com/news/2025/11/6/kazakhstan-which-already-recognises-israel-to-join-abraham-accords",
    "timestamp": "2025-11-06T23:04:11Z"
  },
  {
    "title": "Carney: NYC Mayoral Race Reveals White-Collar Workers' 'Precarious Economic Situation'",
    "description": "Wednesday on Glenn Greenwald's podcast \"System Update,\" Breitbart News economics editor John Carney said New York City Mayor-elect Zohran Mamdani's victory shows white collar workers are in a \"precarious economic situation\" that should not be ignored by the r…",
    "link": "https://www.breitbart.com/clips/2025/11/06/carney-nyc-mayoral-race-reveals-white-collar-workers-precarious-economic-situation/",
    "timestamp": "2025-11-06T23:01:13Z"
  }
]