[
  {
    "title": "Conservative Journalist Mocked For Asking The Cringiest Possible Trump Question",
    "description": "Cara Castronuova was ridiculed after claiming with a straight face that the president \"actually looks healthier than ever before.\"",
    "link": "https://www.huffpost.com/entry/cara-castronuova-mocked-trump-fitness-plan_n_67f9734de4b0c859a8c0b6c5",
    "timestamp": "2025-04-11T21:41:02Z"
  },
  {
    "title": "The CEO In The Middle Of An Epic Battle With Danone—And Her Own Family. Plus: Navigate Tariff-Fueled Anxiety",
    "description": "Welcome to this week’s ForbesWomen newsletter, which every Thursday brings news about the world’s top female entrepreneurs, leaders and investors straight to your inbox.",
    "link": "https://www.forbes.com/sites/maggiemcgrath/2025/04/11/the-ceo-in-the-middle-of-an-epic-battle-with-danone-and-her-own-family-plus-navigate-tariff-fueled-anxiety/",
    "timestamp": "2025-04-11T21:37:33Z"
  },
  {
    "title": "White House To Scrap Federal Climate Research Office As Part Of ‘Woke Ideology’ Cleanse",
    "description": "President Donald Trump's administration is gearing up to effectively cut the Office of Oceanic and Atmospheric Research, according to multiple reports.",
    "link": "https://dailycaller.com/2025/04/11/white-house-scrap-another-federal-climate-research-office/",
    "timestamp": "2025-04-11T21:36:31Z"
  },
  {
    "title": "A Ruling Against Mahmoud Khalil Highlights Marco Rubio's Vast Power To Deport People for Their Opinions",
    "description": "An immigration judge's decision reinforces the constitutional argument against the law that the secretary of state is invoking.",
    "link": "https://reason.com/2025/04/11/a-ruling-against-mahmoud-khalil-highlights-marco-rubios-broad-power-to-deport-people-for-their-opinions/",
    "timestamp": "2025-04-11T21:36:11Z"
  },
  {
    "title": "Federal health cuts are taking away from the poor, Lamont advisor says",
    "description": "As the state continues to fight the Trump administration over public health funding, officials here in Connecticut are worried about the impacts of the…",
    "link": "https://www.nbcconnecticut.com/news/local/federal-health-cuts-taking-away-from-poor-lamont-advisor-says/3542260/",
    "timestamp": "2025-04-11T21:36:04Z"
  },
  {
    "title": "Elon Musk's Favorability Sinks to New Low, Polling Average Shows",
    "description": "According to the latest data from newsletter Silver Bulletin, a project by polling expert Nate Silver, 53.5 percent of Americans now view Musk unfavorably.",
    "link": "https://www.newsweek.com/elon-musks-favorability-sinks-new-low-polling-average-shows-2058871",
    "timestamp": "2025-04-11T21:35:08Z"
  },
  {
    "title": "Trump Border Czar Insists ‘We Made The Right Decision’ On Deporting and Imprisoning Migrant The Supreme Court Ordered Returned",
    "description": "\"Supreme Court says we'll facilitate, we'll facilitate. However we've got to remember he's an El Salvadoran national in custody of the El Salvadorian gov't.\"\nThe post Trump Border Czar Insists ‘We Made The Right Decision’ On Deporting and Imprisoning Migrant …",
    "link": "https://www.mediaite.com/tv/trump-border-czar-insists-we-made-the-right-decision-on-deporting-and-imprisoning-migrant-the-supreme-court-ordered-returned/",
    "timestamp": "2025-04-11T21:34:38Z"
  },
  {
    "title": "Butler County Resident Charged with Making Threats to Assault and Murder President Donald J. Trump",
    "description": "Shawn Monper, 32, a resident of Butler, Pennsylvania, has been charged by federal criminal complaint with making threats to assault and murder President Donald J. Trump, other United States officials, and U.S. Immigration and Customs Enforcement (ICE) agents,…",
    "link": "https://freerepublic.com/focus/f-news/4310463/posts",
    "timestamp": "2025-04-11T21:33:05Z"
  },
  {
    "title": "Meta adds Stripe CEO Patrick Collison and Dina Powell McCormick to its board | TechCrunch",
    "description": "Banking executive and former presidential advisor Dina Powell McCormick and Stripe co-founder and CEO Patrick Collison are joining the board of Meta,",
    "link": "https://techcrunch.com/2025/04/11/meta-adds-stripe-ceo-patrick-collison-and-dina-powell-mccormick-to-its-board/",
    "timestamp": "2025-04-11T21:33:01Z"
  },
  {
    "title": "US Senate bill threatens crypto, AI data centers with fees — Report",
    "description": "Draft legislation in the US Senate threatens to hit data centers serving blockchain networks and artificial intelligence models with fees if they exceed federal emissions targets, according to an April 11 Bloomberg report. Led by Senate Democrats Sheldon Whit…",
    "link": "https://cointelegraph.com/news/us-bill-threatens-crypto-ai-data-centers-fees-report",
    "timestamp": "2025-04-11T21:32:16Z"
  },
  {
    "title": "Neither Trump Nor The A.P. Controls Our Words",
    "description": "The Associated Press’s legal victory highlights the limited power presidents and the press have over the creative destruction and spontaneous order of our language.",
    "link": "https://reason.com/2025/04/12/neither-trump-nor-the-a-p-controls-our-words/",
    "timestamp": "2025-04-11T21:31:18Z"
  },
  {
    "title": "U.S. extradites key suspected conspirator behind 2008 Mumbai terror attacks to India",
    "description": "The extradition comes after the issue was raised during talks in Washington between the U.S. President Donald Trump and Indian Prime Minister Narendra Modi in February.",
    "link": "https://biztoc.com/x/5c8ba5298d019415",
    "timestamp": "2025-04-11T21:30:46Z"
  },
  {
    "title": "Antitrust Chiefs Counter Proposed Cuts as Tech Cases Advance",
    "description": "Antitrust enforcers are pushing back against the impact of a broad, Justice Department-wide restructuring plan that would interfere with key White House priorities including enforcement in the tech sector, according to a senior official.",
    "link": "https://www.livemint.com/companies/news/antitrust-chiefs-counter-proposed-cuts-as-tech-cases-advance-11744407027968.html",
    "timestamp": "2025-04-11T21:30:27Z"
  },
  {
    "title": "Trump's tariffs collide with a key campaign promise: From the Politics Desk",
    "description": "One of President Donald Trump’s central campaign promises focused on bringing down high prices and providing relief to voters who were struggling to make ends meet.",
    "link": "https://www.nbcnews.com/politics/politics-news/trumps-tariffs-collide-key-campaign-promise-politics-desk-rcna200943",
    "timestamp": "2025-04-11T21:30:00Z"
  },
  {
    "title": "Trump's Financial Shakedown: Top Banker Claims America Facing 'Considerable Turbulences' and 'Trade Wars' as Citizens Await Unpredictable President's Next Tariffs Move",
    "description": "JPMorgan Chase CEO Jamie Dimon is calling out Donald Trump's tariff-obsessed decisions, claiming the damage has already been done to America.",
    "link": "https://radaronline.com/p/trump-top-banker-jamie-dimon-turbulence-trade-wars-tariffs-stock-markets/",
    "timestamp": "2025-04-11T21:30:00Z"
  },
  {
    "title": "MSNBC host warns 'wish-casting' Trump just 'overplayed his hand'",
    "description": "MSNBC host Stephanie Ruhle said she thinks the markets have been topsy-turvy all week because, in the past, the underlying economy was \"a disaster.\" What's happening now, however, is \"completely self-made.\" Speaking to Nicolle Wallace on Friday, Ruhle said, \"…",
    "link": "https://www.rawstory.com/trump-tariffs-2671753772/",
    "timestamp": "2025-04-11T21:29:24Z"
  },
  {
    "title": "Federal, provincial tariff relief should include municipalities, Ontario big city mayors say",
    "description": "Mayors of Ontario’s big cities are calling on the federal and provincial governments to include them in any stimulus packages they launch to offset the impacts of U.S. tariffs because they say the money could be used for infrastructure projects.",
    "link": "https://www.cbc.ca/news/canada/toronto/big-city-mayors-ontario-stimulus-funding-1.7508372",
    "timestamp": "2025-04-11T21:28:47Z"
  },
  {
    "title": "Dow jumps 600 points Friday, capping one of the most volatile weeks on Wall Street ever",
    "description": "Stocks climbed Friday as Wall Street wrapped up a historically wild week.",
    "link": "https://www.nbcnews.com/business/markets/dow-jumps-600-points-friday-capping-one-volatile-weeks-wall-street-eve-rcna200956",
    "timestamp": "2025-04-11T21:27:09Z"
  },
  {
    "title": "Another Day, Another Alleged Would-Be Trump Assassin Charged",
    "description": "Shawn Monper, 32, of Butler, Pennsylvania, faces federal charges of making threats to assault and murder President Trump, Musk, and others.",
    "link": "https://thefederalist.com/2025/04/11/another-day-another-alleged-would-be-trump-assassin-charged/",
    "timestamp": "2025-04-11T21:27:09Z"
  },
  {
    "title": "U.S. extradites key suspected conspirator behind 2008 Mumbai terror attacks to India",
    "description": "The extradition comes after the issue was raised during talks in Washington between the U.S. President Donald Trump and Indian Prime Minister Narendra Modi in February.",
    "link": "https://www.pbs.org/newshour/world/u-s-extradites-key-suspected-conspirator-behind-2008-mumbai-terror-attacks-to-india",
    "timestamp": "2025-04-11T21:24:59Z"
  },
  {
    "title": "China Expands Campus Military Recruitment amid High Youth Unemployment & U.S. Trade War",
    "description": "The Communist Party of China is apparently planning to contain outrage and disenchantment among the nation's youth by commanding colleges to \"ramp up\" military recruitment on campuses, the state-run Global Times reported on Thursday, funneling frustrated youn…",
    "link": "https://www.breitbart.com/asia/2025/04/11/china-expands-campus-military-recruitment-amid-high-youth-unemployment-u-s-trade-war/",
    "timestamp": "2025-04-11T21:24:29Z"
  },
  {
    "title": "Fantasy Donald Trump, protector of the working class, is harder to kill than Rasputin",
    "description": "When I read stuff like this I always having a sneaking suspicion that the person is doing some sort of bit: But I guess not, or if it is we’re at Andy Kaufman-like levels of commitment to it: Donald Trump doesn’t have any economic plan besides funneling as mu…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/fantasy-donald-trump-protector-of-the-working-class-is-harder-to-kill-than-rasputin",
    "timestamp": "2025-04-11T21:22:35Z"
  },
  {
    "title": "Trump is waiting for Xi to call. The Chinese see it differently",
    "description": "In private discussions hours before China announced new retaliatory tariffs, the Trump administration warned Chinese officials against such a move, according to a source familiar with the discussions. The Chinese were also told – once again – that Chinese Pre…",
    "link": "https://freerepublic.com/focus/f-news/4310462/posts",
    "timestamp": "2025-04-11T21:21:10Z"
  },
  {
    "title": "DOJ fires longtime spokesman who worked on Trump investigations",
    "description": "Robert Mueller and Jack Smith investigated Trump for the DOJ on questions of obstruction of justice, election interference and retention of classified records.",
    "link": "https://www.cnbc.com/2025/04/11/doj-fires-spokesman-special-counsels-trump.html",
    "timestamp": "2025-04-11T21:20:57Z"
  },
  {
    "title": "NIH Reinstates $38 Million Research Grant at the U",
    "description": "On March 29, the National Institute of Health reinstated the University of Utah’s Clinical and Translational Science Award. It was terminated last month because its grant proposal featured keywords that are at odds with President Donald Trump’s anti-diversity…",
    "link": "https://dailyutahchronicle.com/2025/04/11/nih-reinstates-38-million-research-grant-at-the-u/",
    "timestamp": "2025-04-11T21:20:50Z"
  },
  {
    "title": "Trump legal tracker: Supreme Court jumps in on deportations and mass firings",
    "description": "The Supreme Court intervened this week in a number of cases involving President Donald Trump's efforts to dramatically transform the government, maintaining legal guardrails for deportations while also allowing the administration to continue with mass firings…",
    "link": "https://biztoc.com/x/62fe8c18eba44d08",
    "timestamp": "2025-04-11T21:19:43Z"
  },
  {
    "title": "Trump’s New Tariffs Would Raise Half His Earlier Version, TPC Finds",
    "description": "TPC found Trump’s latest plan would raise about $1.7 trillion for the 10 years from 2026 through 2035, plus an additional $125 billion for the remainder of 2025.",
    "link": "https://www.forbes.com/sites/howardgleckman/2025/04/11/trumps-new-tariffs-would-raise-half-his-earlier-version-tpc-finds/",
    "timestamp": "2025-04-11T21:15:41Z"
  },
  {
    "title": "Look In the Mirror, Sport: Paul Krugman Accuses Trump Of ‘Junk Economics’",
    "description": "It seems impossible for former New York Times columnist Paul Krugman to stay out of the limelight and make himself look even more ridiculous.",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/04/11/look-mirror-sport-paul-krugman-accuses-trump-junk",
    "timestamp": "2025-04-11T21:14:37Z"
  },
  {
    "title": "Tucker Carlson: ‘Of Course’ Trump Is Willing to Negotiate With China on Tariffs",
    "description": "President Donald Trump is using tariffs to apply heavy pressure on China on trade, but he remains open to negotiations with Beijing, Tucker Carlson says.... Read More\nThe post Tucker Carlson: ‘Of Course’ Trump Is Willing to Negotiate With China on Tariffs app…",
    "link": "https://www.dailysignal.com/2025/04/11/tucker-carlson-course-trump-is-willing-negotiate-china-tariffs/",
    "timestamp": "2025-04-11T21:14:13Z"
  },
  {
    "title": "The Trump Administration Is Jeopardizing the AI Boom",
    "description": "A disaster for American innovation",
    "link": "https://www.theatlantic.com/technology/archive/2025/04/trump-jeopardizing-ai-boom/682404/",
    "timestamp": "2025-04-11T21:12:19Z"
  },
  {
    "title": "US, Ukraine hold tense talks as mineral deal remains elusive, source says",
    "description": "WASHINGTON (Reuters) - U.S. and Ukrainian officials met on Friday on a U.S. proposal to gain access to Ukraine's mineral wealth, a source with knowledge of the matter said, adding that prospects for a breakthrough were scant given the meeting's \"antagonistic\"…",
    "link": "https://www.thestar.com.my/news/world/2025/04/12/us-ukraine-hold-tense-talks-as-mineral-deal-remains-elusive-source-says",
    "timestamp": "2025-04-11T21:12:00Z"
  },
  {
    "title": "Trump reaches deals with 5 law firms, allowing them to avoid prospect of punishing executive orders",
    "description": "President Donald Trump announced deals Friday with five law firms that will allow them to avoid the prospect of a punishing executive order and require them to together provide hundreds of millions of dollars' worth of free legal services for causes his admin…",
    "link": "https://japantoday.com/category/world/trump-reaches-deals-with-5-law-firms-allowing-them-to-avoid-prospect-of-punishing-executive-orders",
    "timestamp": "2025-04-11T21:11:56Z"
  },
  {
    "title": "Potential impact of Trump's trade war on jobs and inflation sends U.S. consumer sentiment plunging",
    "description": "U.S. consumer sentiment plunged in April, the fourth consecutive month of declines, in a seemingly sharp rebuke of President Donald Trump's trade wars that have fueled anxiety over possible job losses and rising inflation.  The preliminary reading of the Univ…",
    "link": "https://japantoday.com/category/business/potential-impact-of-trump%27s-trade-war-on-jobs-and-inflation-sends-us-consumer-sentiment-plunging",
    "timestamp": "2025-04-11T21:11:36Z"
  },
  {
    "title": "Ishiba to discuss wages with labor union chief on Monday",
    "description": "Prime Minister Shigeru Ishiba is scheduled to hold talks with the head of Japan's biggest labor union umbrella group on Monday, as he has pledged to take measures to achieve wage hikes at smaller companies and in regional areas. The planned face-to-face meeti…",
    "link": "https://japantoday.com/category/business/japan-pm-ishiba-to-talk-with-labor-union-chief-monday-over-wages",
    "timestamp": "2025-04-11T21:11:10Z"
  },
  {
    "title": "Trump envoy meets Putin in Russia as Trump fumes over stalled Ukraine peace talks",
    "description": "As President Donald Trump demands an immediate ceasefire in Ukraine, his envoy Steve Witkoff met with Russian President Vladimir Putin on Friday, seeking to revive stalled peace talks.",
    "link": "https://www.foxnews.com/politics/trump-envoy-meets-putin-russia-trump-fumes-stalled-ukraine-peace-talks",
    "timestamp": "2025-04-11T21:10:47Z"
  },
  {
    "title": "Kremlin reveals content of Putin’s talks with Trump envoy",
    "description": "Russian President Vladimir Putin has held a marathon meeting with visiting US special envoy Steve Witkoff Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615638-putin-witkoff-talks-russia/",
    "timestamp": "2025-04-11T21:10:21Z"
  },
  {
    "title": "Florida universities to deputize campus police for immigration enforcement",
    "description": "The police departments of at least three public universities in Florida are seeking agreements with the federal government to carry out immigration enforcement on campus",
    "link": "https://abcnews.go.com/US/wireStory/florida-universities-deputize-campus-police-immigration-enforcement-120731002",
    "timestamp": "2025-04-11T21:10:01Z"
  },
  {
    "title": "Trump envoy's embrace of Russian demands worries Republicans, U.S. allies (Reuters)",
    "description": "Reuters:\nTrump envoy's embrace of Russian demands worries Republicans, U.S. allies  —  Less than 48 hours after dining with a negotiator sent by Russian President Vladimir Putin in Washington last week, Steve Witkoff, the U.S. special envoy leading talks with…",
    "link": "https://www.memeorandum.com/250411/p129",
    "timestamp": "2025-04-11T21:10:00Z"
  },
  {
    "title": "Trump wants Congress to end changing of clocks and keep the country on daylight saving time",
    "description": "President Donald Trump on Friday urged Congress to “push hard for more Daylight at the end of a day” in his latest dig at the semiannual changing of clocks.  Trump, in a post on his Truth Social media network, said it would be “Very popular and, most importan…",
    "link": "https://japantoday.com/category/world/trump-wants-congress-to-end-the-changing-of-clocks-and-keep-the-country-on-daylight-saving-time",
    "timestamp": "2025-04-11T21:08:33Z"
  },
  {
    "title": "Facebook Is Just Craigslist Now",
    "description": "The social-media giant has manifested its final form: not digital connector, but digital bazaar.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/04/facebook-marketplace-craiglist-buy-sell/682420/",
    "timestamp": "2025-04-11T21:08:00Z"
  },
  {
    "title": "Trump legal tracker: Supreme Court jumps in on deportations and mass firings",
    "description": "The Supreme Court intervened this week in a number of cases involving President Donald Trump's efforts to dramatically transform the government, maintaining legal guardrails for deportations while also allowing the administration to continue with mass firings…",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-legal-tracker-supreme-court-jumps-deportations-mass-firings-rcna200639",
    "timestamp": "2025-04-11T21:07:54Z"
  },
  {
    "title": "After 4 Years Of Claiming US Elections Are ‘Most Secure Ever,’ Leftists Again Accuse Trump Of Stealing Them",
    "description": "Democrats are claiming Trump could rig the next election, after years of smearing election integrity advocates as 'election deniers.'",
    "link": "https://thefederalist.com/2025/04/11/after-4-years-of-claiming-us-elections-are-most-secure-ever-leftists-again-accuse-trump-of-stealing-them/",
    "timestamp": "2025-04-11T21:07:27Z"
  },
  {
    "title": "Head of U.S. Space Force base in Greenland fired after Vance visit",
    "description": "The commander of a U.S. Space Force base in Greenland has been fired after she sent a base-wide email breaking with official messaging following Vice President JD Vance’s visit to the Danish territory that President Donald Trump is seeking to annex. In a stat…",
    "link": "https://japantoday.com/category/world/head-of-us-space-force-base-in-greenland-is-fired-after-vance-visit",
    "timestamp": "2025-04-11T21:07:00Z"
  },
  {
    "title": "Pennsylvania man charged over threats to kill Trump, immigration agents",
    "description": "WASHINGTON (Reuters) - A Pennsylvania man has been charged with making threats online to murder President Donald Trump and immigration agents, the U.S. Justice Department said on Friday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/12/pennsylvania-man-charged-over-threats-to-kill-trump-immigration-agents",
    "timestamp": "2025-04-11T21:07:00Z"
  },
  {
    "title": "Judge rebukes Trump administration; demands to know status of illegally deported man",
    "description": "A U.S. federal judge said on Friday it was &quot;extremely troubling&quot; that the Trump administration failed to comply with her court order to provide details on the status of a Maryland resident it illegally deported to El Salvador. U.S. District Judge Pa…",
    "link": "https://japantoday.com/category/world/judge-rebukes-trump-administration-demands-to-know-status-of-illegally-deported-man",
    "timestamp": "2025-04-11T21:06:38Z"
  },
  {
    "title": "Chuck Todd Attempts To Explain Why He Believes There Was No ‘Cover -Up’ Of Biden’s Fading Health",
    "description": "Chuck Todd offered an explanation for why he believes former President Joe Biden's White House did not intentionally conceal his decline.",
    "link": "https://dailycaller.com/2025/04/11/chuck-todd-attempts-explain-why-he-believes-there-was-no-cover-up-of-biden/",
    "timestamp": "2025-04-11T21:06:25Z"
  },
  {
    "title": "U.S. envoy Witkoff meets Putin as Trump tells Moscow to 'get moving' on Ukraine",
    "description": "U.S. President Donald Trump's special envoy Steve Witkoff held talks with President Vladimir Putin on Friday in St. Petersburg about the search for a peace deal on Ukraine as Trump told Russia to &quot;get moving&quot;. Putin was shown on state TV greeting Wi…",
    "link": "https://japantoday.com/category/world/us-envoy-witkoff-meets-putin-as-trump-tells-moscow-to-%27get-moving%27-on-ukraine",
    "timestamp": "2025-04-11T21:06:22Z"
  },
  {
    "title": "Trump -- oldest elected U.S. president -- undergoes physical",
    "description": "Donald Trump had his first annual medical checkup Friday since returning to power, putting focus on the fitness of the 78-year-old who is the oldest U.S. president ever elected and has been accused of dodging questions about his health. Republican Trump has r…",
    "link": "https://japantoday.com/category/world/trump-oldest-elected-us-president-undergoes-physical",
    "timestamp": "2025-04-11T21:06:12Z"
  },
  {
    "title": "China strikes back at Trump tariff hike; U.S. stands its ground",
    "description": "Beijing increased its tariffs on U.S. imports to 125% on Friday, hitting back against President Donald Trump's decision to hike duties on Chinese goods and raising the stakes in a trade war that threatens to upend global supply chains. U.S. markets churned as…",
    "link": "https://japantoday.com/category/world/china-strikes-back-at-trump-tariff-hike-us-stands-its-ground1",
    "timestamp": "2025-04-11T21:06:04Z"
  },
  {
    "title": "SEC, Binance Ask Judge to Extend Pause in Ongoing Case",
    "description": "The parties previously asked a judge to pause the case for 60 days.",
    "link": "https://www.coindesk.com/policy/2025/04/11/sec-binance-ask-judge-to-extend-pause-in-ongoing-case",
    "timestamp": "2025-04-11T21:05:03Z"
  },
  {
    "title": "Azealia Banks Wants Taylor Swift to Hit Back at Kanye Over His Wild Claims: 'Get His Ass'",
    "description": "Ye recently claimed that Justin Bieber and Harry Styles had a threesome with Taylor Swift.",
    "link": "https://www.complex.com/music/a/backwoodsaltar/azealia-banks-taylor-swift-hit-back-kanye-wild-claims",
    "timestamp": "2025-04-11T21:04:20Z"
  },
  {
    "title": "LIVE: Markets react as traders digest latest Trump tariff-related fallout",
    "description": "Watch live coverage of U.S. markets as tariff fears remain at the forefront of investors' minds after President Donald Trump ...",
    "link": "https://biztoc.com/x/f790f69684da1b74",
    "timestamp": "2025-04-11T21:03:39Z"
  },
  {
    "title": "Unless we spike military spending — and FAST — the next major war could be catastrophic",
    "description": "It is President Donald Trump's wont to declare national emergencies, whether a given situation warrants it or not, but the state of our defenses is a true crisis.",
    "link": "https://nypost.com/2025/04/11/opinion/unless-we-spike-military-spending-and-fast-the-next-major-war-could-be-catastrophic/",
    "timestamp": "2025-04-11T21:03:12Z"
  },
  {
    "title": "Canada, US to start trade talks in May: Carney",
    "description": "Canada and the United States will start talks on a new trade deal in early May, Prime Minister Mark Carney said Friday, warning President Donald Trump’s trade war was already hitting Canada’s labor market.  Carney made the comments in Ottawa after pausing his…",
    "link": "https://www.digitaljournal.com/world/canada-us-to-start-trade-talks-in-may-carney/article",
    "timestamp": "2025-04-11T21:02:33Z"
  },
  {
    "title": "Asset flight challenges US safe haven status",
    "description": "The US has long been considered a financial safe haven. The sell-off of the dollar, stocks and Treasury bonds in a spree sparked by panic at President Donald Trump’s trade war is starting to raise questions about if that’s still true. – What happened this wee…",
    "link": "https://www.digitaljournal.com/world/asset-flight-challenges-us-safe-haven-status/article",
    "timestamp": "2025-04-11T21:02:32Z"
  },
  {
    "title": "Europeans sidelined in U.S.-Iran nuclear talks despite holding key card",
    "description": "Washington's decision not to coordinate with European nations about its negotiations with Iran on Saturday will reduce its leverage and make U.S. and Israeli military action against Tehran ultimately more likely, analysts and diplomats said. The United States…",
    "link": "https://japantoday.com/category/features/opinions/analysis-europeans-sidelined-in-us-iran-nuclear-talks-despite-holding-key-card1",
    "timestamp": "2025-04-11T21:02:27Z"
  },
  {
    "title": "Washington, DC, faces budget crisis after House leaves $1.1 billion hole in city coffers",
    "description": "When the House of Representatives adjourned for a two-week recess, it left D",
    "link": "https://abcnews.go.com/Politics/wireStory/washington-dc-faces-budget-crisis-after-house-leaves-120729949",
    "timestamp": "2025-04-11T21:02:25Z"
  },
  {
    "title": "Immigration Judge Rules That Mahmoud Khalil May Be Deported",
    "description": "Judge Jamee Comans has ruled that the Trump administration may deport Mahmoud Khalil, the Palestinian activist whom the government targeted for helping lead Columbia’s Gaza-solidarity student protests last year.",
    "link": "http://www.thecut.com/article/mahmoud-khalil-update-judge-rules-he-may-be-deported.html",
    "timestamp": "2025-04-11T21:02:03Z"
  },
  {
    "title": "Democrats Call For SEC Insider Trading Probe Into Possible Trump Market Manipulation",
    "description": "The senators pointed to Trump’s back-and-forth policy changes creating “significant market turmoil,” amounting to trillions of dollars of lost value.",
    "link": "https://www.huffpost.com/entry/democrats-call-for-sec-trump-insider-trading-probe_n_67f96595e4b05c9df5d39fdb",
    "timestamp": "2025-04-11T21:01:31Z"
  },
  {
    "title": "U.S. Stocks Jump And The Bond Market Swings To Cap Wall Street’s Chaotic And Historic Week",
    "description": "The S&P 500 rallied 1.8%, after veering repeatedly between gains and losses, to cap a chaotic and historic week full of monstrous swings.",
    "link": "https://www.huffpost.com/entry/us-stocks-finance-wall-street-trade-war_n_67f981b7e4b060848e3e7765",
    "timestamp": "2025-04-11T21:01:23Z"
  },
  {
    "title": "Social Security Administration Reportedly Switching All Communications To X",
    "description": "The agency has basically just stopped putting out press releases.",
    "link": "https://www.huffpost.com/entry/social-security-administration-x-press-releases_n_67f9770ae4b0c859a8c0b840",
    "timestamp": "2025-04-11T21:01:00Z"
  },
  {
    "title": "Asset Flight Challenges US Safe Haven Status",
    "description": "The US has long been considered a financial safe haven. This week, the volatility spread to the US Treasury market, long considered by global investors to be a refuge.",
    "link": "https://www.ibtimes.com/asset-flight-challenges-us-safe-haven-status-3769791",
    "timestamp": "2025-04-11T21:00:24Z"
  },
  {
    "title": "Trump's danger to US Jewry: Living under autocracy never ends well for Jews",
    "description": "We must not let Trump’s policy of cracking down on far-Left antisemitism lull us into silence while his administration normalizes far-Right extremism and imperils our democracy.",
    "link": "https://www.jpost.com/opinion/article-849532",
    "timestamp": "2025-04-11T21:00:23Z"
  },
  {
    "title": "Apple Loop: iPhone 17 Pro’s Tariff Shock, Surprise iOS Update, BBC Fights Apple News",
    "description": "This week’s Apple headlines; the impact of US tariffs on the iPhone, a surprise iOS update, BBC attacks Apple News, Instagram finally arrives on the iPad, and more...",
    "link": "https://www.forbes.com/sites/ewanspence/2025/04/11/apple-news-headlines-iphone-17-pro-tariffs-iphone-16e-bbc-ipad-instagram/",
    "timestamp": "2025-04-11T21:00:17Z"
  },
  {
    "title": "TMTG Form S-3 Registration Statement Becomes Effective",
    "description": "SARASOTA, Fla., April 11, 2025 (GLOBE NEWSWIRE) --  Trump Media and Technology Group Corp. (Nasdaq, NYSE Texas: DJT) (\"TMTG\" or the \"Company\"), operator of the social media platform Truth Social, the streaming platform Truth+, and the FinTech brand Truth.Fi, …",
    "link": "https://www.globenewswire.com/news-release/2025/04/11/3060357/0/en/TMTG-Form-S-3-Registration-Statement-Becomes-Effective.html",
    "timestamp": "2025-04-11T21:00:00Z"
  },
  {
    "title": "Daines, Downing, Zinke, Sheehy defend Trump's tariff strategy despite volatile markets",
    "description": "Montana's four members of the U.S. Congress have remained steadfast in their defense of President Trump's trade strategy, despite economic volatility.",
    "link": "https://missoulian.com/news/local/business/article_55ab60c3-ebef-485e-82cd-bc0bf64c7300.html",
    "timestamp": "2025-04-11T21:00:00Z"
  },
  {
    "title": "Saudi Arabia expects new agreement between Iran, US to 'restrain Tehran more'",
    "description": "Saudi Arabia expects any new nuclear agreement to restrain Iran much more than the Obama-era JCPOA had.",
    "link": "https://www.jpost.com/middle-east/article-849882",
    "timestamp": "2025-04-11T20:58:07Z"
  },
  {
    "title": "BEST WEEK EVER: Trump Frees Hot Ballerina After Winning Trade War, Making Showers Great Again (PHOTOS) (Andrew Stiles/The Washington Free Beacon)",
    "description": "Andrew Stiles / The Washington Free Beacon:\nBEST WEEK EVER: Trump Frees Hot Ballerina After Winning Trade War, Making Showers Great Again (PHOTOS)  —  Ksenia Karelina, unjustly imprisoned in Russia on Biden's watch, is heading home to the land of the free  — …",
    "link": "https://www.memeorandum.com/250411/p127",
    "timestamp": "2025-04-11T20:55:01Z"
  },
  {
    "title": "General Motors to shut down Ingersoll EV plant, putting 500 jobs at risk",
    "description": "General Motors will begin laying off hundreds of workers at its CAMI assembly plant in Ingersoll, Ont., starting Monday — a major economic hit to the town of 14,000.",
    "link": "https://www.nationalobserver.com/2025/04/11/news/general-motors-shut-down-ingersoll-ev-plant-putting-500-jobs-risk",
    "timestamp": "2025-04-11T20:53:29Z"
  },
  {
    "title": "Carney says General Motors' Ingersoll EV plant shutdown 'deeply painful news'",
    "description": "General Motors will begin laying off hundreds of workers at its CAMI assembly plant in Ingersoll, Ont., starting Monday — a major economic hit to the town of 14,000.",
    "link": "https://www.nationalobserver.com/2025/04/11/news/carney-general-motors-ingersoll-ev-plant-shutdown",
    "timestamp": "2025-04-11T20:53:29Z"
  },
  {
    "title": "Mangione Lawyer Asks Court to Bar DOJ From Seeking Death Penalty",
    "description": "Luigi Mangione’s lawyer sought a court order barring federal prosecutors from seeking the death penalty against him for allegedly murdering UnitedHealth Group Inc. executive Brian Thompson, saying US Attorney General Pam Bondi was seeking execution as a “poli…",
    "link": "https://www.livemint.com/companies/news/mangione-lawyer-asks-court-to-bar-doj-from-seeking-death-penalty-11744404709917.html",
    "timestamp": "2025-04-11T20:51:49Z"
  },
  {
    "title": "US ambassador to Ukraine stepping down",
    "description": "A State Department spokesperson has confirmed previous media reports that Bridget Brink is leaving after three years in post Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615637-us-ambassador-ukraine-stepping-down/",
    "timestamp": "2025-04-11T20:51:44Z"
  },
  {
    "title": "Trump Promises a New $1 Trillion Pentagon Budget",
    "description": "The Trump administration is set to raise the Pentagon’s budget despite promises to cut government spending drastically. The question now is: where will this money come from and will it be utilized effectively?\nThe post Trump Promises a New $1 Trillion Pentago…",
    "link": "https://nationalinterest.org/blog/buzz/trump-promises-a-new-1-trillion-pentagon-budget",
    "timestamp": "2025-04-11T20:51:30Z"
  },
  {
    "title": "Freak sell-off of ‘safe haven’ US bonds raises fear that confidence in America is fading",
    "description": "This could be bad news for consumers in need of a loan.",
    "link": "https://www.bostonherald.com/2025/04/11/us-bond-market/",
    "timestamp": "2025-04-11T20:50:13Z"
  },
  {
    "title": "Freak sell-off of ‘safe haven’ US bonds raises fear that confidence in America is fading",
    "description": "This could be bad news for consumers in need of a loan.",
    "link": "https://www.denverpost.com/2025/04/11/us-bond-market/",
    "timestamp": "2025-04-11T20:50:13Z"
  },
  {
    "title": "Rana’s extradition a big breakthrough, will reveal real plot of 26/11 attacks: Ajit Pawar",
    "description": "PUNE, April 11: Maharashtra Deputy Chief Minister Ajit Pawar on Friday termed Tahawwur Hussain Rana’s extradition a major breakthrough and said it would help unravel the crucial details of the conspiracy behind the 26/11 Mumbai terror attacks. The 64-year-old…",
    "link": "https://thehillstimes.in/national/ranas-extradition-a-big-breakthrough-will-reveal-real-plot-of-26-11-attacks-ajit-pawar",
    "timestamp": "2025-04-11T20:50:00Z"
  },
  {
    "title": "James Carville lashes out at ‘idiot’ moderates who voted for Trump and now regret it",
    "description": "The Democratic strategist claimed moderate Trump voters who are now surprised by president's policies cast a 'stupid vote.'",
    "link": "https://nypost.com/2025/04/11/media/james-carville-lashes-out-at-moderates-who-voted-for-trump/",
    "timestamp": "2025-04-11T20:49:07Z"
  },
  {
    "title": "Yes, Education Secretary Linda McMahon said 'A1' in response about AI",
    "description": "U.S. Secretary of Education Linda McMahon twice referred to artificial intelligence — AI — as \"A1.\"",
    "link": "https://www.snopes.com//fact-check/ai-education-linda-mcmahon/",
    "timestamp": "2025-04-11T20:48:00Z"
  },
  {
    "title": "Beijing Again Raises Tariffs on U.S., Calls Trade Actions a ‘Joke’",
    "description": "Beijing calls U.S. trade actions a “joke” and warns Washington about self-isolation.",
    "link": "http://foreignpolicy.com/2025/04/11/china-tariffs-125-percent-trump-trade-war-escalation/",
    "timestamp": "2025-04-11T20:47:52Z"
  },
  {
    "title": "Musk Mocked After 'Top Secret' Cabinet Meeting Notes Go Viral: 'They Wrote That to Make Him Feel Included'",
    "description": "Social media users are mocking billionaire Trump ally Elon Musk after a photo of his notepad during a cabinet meeting began making rounds online, with the words \"Top Secret!!\" scrawled onto it in blue ink.",
    "link": "https://www.ibtimes.com/musk-mocked-after-top-secret-cabinet-meeting-notes-go-viral-they-wrote-that-make-him-feel-3769788",
    "timestamp": "2025-04-11T20:47:33Z"
  },
  {
    "title": "‘Ludicrous’: Piers Morgan Quarrels With Panelist Accusing Him Of Wanting To ‘Eradicate Trans People’ Over Sports Issue",
    "description": "Piers Morgan duked it out with pro-transgender activist Stassia Underwood as she accused him of wanting to \"eradicate trans people.\"",
    "link": "https://dailycaller.com/2025/04/11/piers-morgan-eradicate-trans-people-womens-sports/",
    "timestamp": "2025-04-11T20:47:00Z"
  },
  {
    "title": "China Retaliates With a 125 Percent Tariff on U.S. Goods",
    "description": "Beijing calls U.S. trade actions a “joke” and warns Washington about self-isolation.",
    "link": "http://foreignpolicy.com/2025/04/11/china-tariffs-125-percent-trump-trade-war-escalation-eu-vietnam/",
    "timestamp": "2025-04-11T20:46:47Z"
  },
  {
    "title": "Illegal aliens, fentanyl, cartels, and now U.S. fights Mexico over water",
    "description": "Southern neighbor in seriously violation of 1944 treaty, prompting consideration of tariffs and sanctions",
    "link": "https://www.wnd.com/2025/04/illegal-aliens-fentanyl-cartels-and-now-u-s-fights-mexico-over-water/",
    "timestamp": "2025-04-11T20:45:58Z"
  },
  {
    "title": "NYC Champagne Bar to Manage Trump Tariffs With Smaller Pours",
    "description": "The flutes might soon be a little less full at one New York City champagne bar, thanks to sweeping US tariffs on European imports that include French wine and champagne.",
    "link": "https://www.livemint.com/companies/news/nyc-champagne-bar-to-manage-trump-tariffs-with-smaller-pours-11744404341383.html",
    "timestamp": "2025-04-11T20:45:40Z"
  },
  {
    "title": "Alina Habba is investigating New Jersey’s top Democratic officials",
    "description": "Just weeks into her appointment as interim U.S. Attorney for New Jersey, Alina Habba said she has launched an investigation into the state’s top Democratic officials for not cooperating with federal officials on immigration enforcement.",
    "link": "https://www.msnbc.com/top-stories/latest/alina-habba-new-jersey-phil-murphy-matthew-platkin-immigration-rcna200902",
    "timestamp": "2025-04-11T20:44:50Z"
  },
  {
    "title": "Here’s where $10 million donation to DeSantis’ Hope Florida effort went",
    "description": "The money to the Hope Florida Foundation went to two organizations that later gave to a political committee, records show.",
    "link": "https://www.tampabay.com/news/florida-politics/2025/04/11/desantis-charity-hope-florida-casey-uthmeier-legislature/",
    "timestamp": "2025-04-11T20:44:46Z"
  },
  {
    "title": "Immigration judge rules student activist Mahmoud Khalil can be deported from US",
    "description": "Mr Khalil is not accused of breaking any laws.",
    "link": "https://uk.news.yahoo.com/immigration-judge-rules-detained-student-202858839.html",
    "timestamp": "2025-04-11T20:41:03Z"
  },
  {
    "title": "Marjorie Taylor Greene Wants Lawmakers To Get Physical Exams Like Trump",
    "description": "Greene says that she thinks lawmakers' alcohol use and medications should be made public for voters to see.",
    "link": "https://www.newsweek.com/marjorie-taylor-greene-wants-lawmakers-get-physical-exams-like-trump-2058865",
    "timestamp": "2025-04-11T20:40:52Z"
  },
  {
    "title": "7 Things to Know About Gen. ‘Razin’ Caine, Trump’s New Chairman of Joint Chiefs",
    "description": "The Senate confirmed President Donald Trump’s pick for chairman of the joint chiefs early Friday. Trump’s nominee, retured Air Force Lt. Gen. Dan “Razin” Caine,... Read More\nThe post 7 Things to Know About Gen. ‘Razin’ Caine, Trump’s New Chairman of Joint Chi…",
    "link": "https://www.dailysignal.com/2025/04/11/7-things-to-know-about-gen-razin-caine-trumps-new-chairman-of-joint-chiefs/",
    "timestamp": "2025-04-11T20:39:03Z"
  },
  {
    "title": "National Democrats Raising Money to Keep Virginia Legislature Blue in November",
    "description": "What price would you put on a constitutional amendment allowing abortion right up to the moment a baby is about to be born?  What about... Read More\nThe post National Democrats Raising Money to Keep Virginia Legislature Blue in November appeared first on The …",
    "link": "https://www.dailysignal.com/2025/04/11/national-democrats-raising-money-keep-virginia-legislature-blue-november/",
    "timestamp": "2025-04-11T20:38:49Z"
  }
]