[
  {
    "title": "Trump’s First Campaign Stop For 2026 Will Be With Lindsey Graham",
    "description": "President Donald Trump's first campaign stop for the 2026 midterms will be with Republican South Carolina Sen. Lindsey Graham.",
    "link": "https://dailycaller.com/2025/10/20/donald-trump-lindsey-graham-midterms-2026-campaign-golf-fundraiser/",
    "timestamp": "2025-10-20T18:13:02Z"
  },
  {
    "title": "Watch Mamdani’s Fave Imam Call U.S. “Filthy”, Tout “Jihad” and Call for Takeover of U.S. (VIDEO)",
    "description": "\"Politics is a weapon in the cause of Islam\"Zohran Mamdani’s decision to visit the Al-Taqwa Mosque, which used to be under NYPD surveillance, and then embraced its imam, Imam Siraj Wahhaj, an unindicted co-conspirator in the WTC bombing, ends any debate about…",
    "link": "https://freerepublic.com/focus/f-news/4347541/posts",
    "timestamp": "2025-10-20T18:12:40Z"
  },
  {
    "title": "Trump Signs Rare Earths Deal with Australian PM Anthony Albanese During White House Meeting",
    "description": "WASHINGTON – President Donald Trump and Australian Prime Minister Anthony Albanese signed a rare earths and critical minerals deal Monday at the White House during Trump's latest bilateral meeting with yet another world leader.\nThe post Trump Signs Rare Earth…",
    "link": "https://www.breitbart.com/politics/2025/10/20/trump-signs-rare-earths-deal-with-australian-pm-anthony-albanese-during-white-house-meeting/",
    "timestamp": "2025-10-20T18:12:23Z"
  },
  {
    "title": "Millions turn out for anti-Trump ‘No Kings’ rallies",
    "description": "What happened\nMillions of Americans turned out Saturday at more than 2,500 “No Kings” rallies across the U.S. to protest what participants called President Donald Trump’s increasingly authoritarian governance. Organizers estimated that nearly 7 million people…",
    "link": "https://biztoc.com/x/dc190f62c4b7e495",
    "timestamp": "2025-10-20T18:09:33Z"
  },
  {
    "title": "US, Australia seal billion-dollar defense, energy deals",
    "description": "The White House revealed on Monday details on new billion-dollar deals between President Donald Trump and Australian Prime Minister Anthony Albanese, aimed at strengthening cooperation in defense, ene...",
    "link": "https://biztoc.com/x/1362eaeb27b025aa",
    "timestamp": "2025-10-20T18:09:30Z"
  },
  {
    "title": "Capitol agenda: Troop pay fight tests the GOP (Mia McCarthy/Politico)",
    "description": "Mia McCarthy / Politico:\nCapitol agenda: Troop pay fight tests the GOP  —  Tensions over troop pay are taking center stage as the shutdown heads into Week 4.  A number of Republican lawmakers are uneasy with President Donald Trump once again sidestepping the …",
    "link": "https://www.memeorandum.com/251020/p72",
    "timestamp": "2025-10-20T18:05:01Z"
  },
  {
    "title": "Disney+, Hulu Churn Rates Spiked Around Jimmy Kimmel Suspension, Antenna Says; Firm Also Gauges Fox One & ESPN Progress",
    "description": "Last month’s suspension of Jimmy Kimmel Live! coincided with a doubling of subscriber churn rates on Disney+ and Hulu, according to the latest streaming report from Antenna. Churn, the industry term for the number of subscribers canceling their service in a g…",
    "link": "http://deadline.com/2025/10/disney-hulu-subscriber-churn-jimmy-kimmel-fox-one-espn-1236592294/",
    "timestamp": "2025-10-20T18:04:24Z"
  },
  {
    "title": "White House: Gavin Newsom Closed Highway During JD Vance's Trip to U.S. Marine Corps Event — 'Petty Little Man'",
    "description": "California Gov. Gavin Newsom (D) unnecessarily shut down a highway over Vice President JD Vance's appearance at the U.S. Marine Corps 250th anniversary celebration at Camp Pendleton on Saturday, according to the White House.\nThe post White House: Gavin Newsom…",
    "link": "https://www.breitbart.com/politics/2025/10/20/white-house-gavin-newsom-closed-highway-during-jd-vances-trip-to-u-s-marine-corps-petty-little-man/",
    "timestamp": "2025-10-20T18:02:46Z"
  },
  {
    "title": "Interesting – Damning Email Surfaces Showing Mary McCord Sending FBI Information on Her Surveillance of Oathkeepers Group Following 2020 Election Result",
    "description": "Obviously, readers here are well aware of our research files on former DOJ-NSD head, Mary McCord, and her various tentacles of operations against Donald Trump before and after the 2016 election.To enhance this ongoing effort, Twitter user “pepesgrandma” share…",
    "link": "https://freerepublic.com/focus/f-bloggers/4347536/posts",
    "timestamp": "2025-10-20T18:02:34Z"
  },
  {
    "title": "Interesting – Damning Email Surfaces Showing Mary McCord Sending FBI Information on Her Surveillance of Oathkeepers Group Following 2020 Election Result",
    "description": "Obviously, readers here are well aware of our research files on former DOJ-NSD head, Mary McCord, and her various tentacles of operations against Donald Trump before and after the 2016 election.To enhance this ongoing effort, Twitter user “pepesgrandma” share…",
    "link": "https://freerepublic.com/focus/f-news/4347536/posts",
    "timestamp": "2025-10-20T18:02:34Z"
  },
  {
    "title": "‘400 Years Old’: Trump Scolds Cameraman Over Priceless White House Decor",
    "description": "President Donald Trump openly scolded a cameraman on Monday who accidentally hit a 400-year-old mirror with his camera.",
    "link": "https://dailycaller.com/2025/10/20/trump-scolds-cameraman-white-house-mirror/",
    "timestamp": "2025-10-20T18:02:28Z"
  },
  {
    "title": "Lavrov and Rubio will soon have telephone contact",
    "description": "In the coming days, the preparations for Donald Trump's new summit with Vladimir Putin will be discussed\nThe post Lavrov and Rubio will soon have telephone contact appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/20/lavrov-and-rubio-will-soon-have-telephone-contact/",
    "timestamp": "2025-10-20T18:02:00Z"
  },
  {
    "title": "Price predictions 10/20: SPX, DXY, BTC, ETH, BNB, XRP, SOL, DOGE, ADA, HYPE",
    "description": "Bitcoin staged a rebound rally to $111,705 as the market recovers from last the recent catastrophic sell-off, but data suggests sellers will continue to take profit at each breakout top.",
    "link": "https://cointelegraph.com/news/price-predictions-10-20-spx-dxy-btc-eth-bnb-xrp-sol-doge-ada-hype",
    "timestamp": "2025-10-20T18:00:55Z"
  },
  {
    "title": "EU’s top diplomat unhappy over Putin-Trump peace summit",
    "description": "Kaja Kallas has cited an ICC arrest warrant for the Russian president ahead of upcoming talks with his US counterpart Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626724-eu-kallas-putin-hungary-visit-not-nice/",
    "timestamp": "2025-10-20T18:00:07Z"
  },
  {
    "title": "Ghislaine Maxwell's New 'Cushy' Prison Helping Keep Former Madam's Life Behind Bars a Secret... as Jeffrey Epstein's Ex Attempts to Escape 20-Year Sentence",
    "description": "Ghislaine Maxwell's life behind bars is being kept out of the news, as the prison is said to be doing all it can to make sure no information leaks.",
    "link": "https://radaronline.com/p/ghislaine-maxwell-new-cushy-prison-helping-life-behind-bars-secret-for-trump/",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "Centralized Exchanges Are Still Criminals’ Favorite Crypto Money Laundering Tool",
    "description": "Focusing regulatory energy on mixers while letting exchanges remain the primary fiat gateways for illicit funds is like locking the windows while leaving the front door wide open, argues Dr. Jan Philipp Fritsche, managing director of Oak Security.",
    "link": "https://www.coindesk.com/opinion/2025/10/20/centralized-exchanges-are-still-criminals-favorite-crypto-money-laundering-tool",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "Seven Million Turn Out for “No Kings” Protests Nationwide. Next Up Massive Disruptions Backed by Unions.",
    "description": "People from across the country marched. Now what?",
    "link": "https://inthesetimes.com/article/no-kings-march-union-organizing-trump-democrats-ice",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "Ghislane Maxwell's New 'Cushy' Prison Helping Keep Former Madam's Life Behind Bars a Secret... as Jeffrey Epstein's Ex Attempts to Escape 20-Year Sentence",
    "description": "Ghislaine Maxwell's life behind bars is being kept out of the news, as the prison is said to be doing all it can to make sure no information leaks.",
    "link": "https://radaronline.com/p/ghislane-maxwell-new-cushy-prison-helping-keep-former-madams-life-behind-bars-a-secret-all-for-trump/",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "“I’m back!!!”: Fresh out of prison, George Santos makes a speedy Cameo comeback",
    "description": "Former New York Rep. George Santos wasted no time jumping back into the spotlight by reopening his Cameo account, and people have a lot to say about it. \n\n\nLess than 24 hours after President Donald Trump commuted his 87-month prison sentence, the 37-year-old …",
    "link": "https://www.dailydot.com/viral-politics/george-santos-returns-cameo/",
    "timestamp": "2025-10-20T18:00:00Z"
  },
  {
    "title": "Charlamagne Lashes Out at MSNBC for Accusing Him of Pushing ‘MAGA Messaging’ in Tense Exchange With Nicolle Wallace",
    "description": "Charlamagne tha God slammed MSNBC for abusing him of pushing \"MAGA messaging\" during a conversation on anchor Nicolle Wallace's podcast.\nThe post Charlamagne Lashes Out at MSNBC for Accusing Him of Pushing ‘MAGA Messaging’ in Tense Exchange With Nicolle Walla…",
    "link": "https://www.mediaite.com/media/podcasts/charlamagne-lashes-out-at-msnbc-for-accusing-him-of-pushing-maga-messaging-in-tense-exchange-with-nicolle-wallace/",
    "timestamp": "2025-10-20T17:59:09Z"
  },
  {
    "title": "In Purple Hudson Valley District, No Kings Turnout Doubles",
    "description": "Joan Walsh\n\n\n\nBrewster’s rally drew more than 4,000 people for a rousing refutation of Donald Trump. Should the district’s GOP House Representative Mike Lawler, up for reelection in November, worry?\r\n\n\r\n\n\nThe post In Purple Hudson Valley District, No Kings Tu…",
    "link": "https://www.thenation.com/article/politics/no-kings-brewster-mike-lawler/",
    "timestamp": "2025-10-20T17:58:32Z"
  },
  {
    "title": "Why Gaza’s “eternal” ceasefire is holding—for now",
    "description": "Why Gaza’s “eternal” ceasefire is holding—for now\nJD Vance and Jared Kushner arrive to do some Bibisitting\nETERNITY IS NOT what it used to be. When Donald Trump visited the Middle East on October 13th to sign the Gaza ceasefire, he spoke of “peace for all ete…",
    "link": "https://biztoc.com/x/48d4c73825e8d249",
    "timestamp": "2025-10-20T17:58:29Z"
  },
  {
    "title": "85% of Americans Don’t Want Trump to be King",
    "description": "Huge crowds of protesters hit the streets across the United States on Saturday under the motto “No Kings”, decrying U.S. President Donald Trump’s policies. Demonstrations were seen in cities such as New York, Washington, D.C., Atlanta, Chicago and Los Angeles…",
    "link": "https://biztoc.com/x/8fa6f81cbedb1a99",
    "timestamp": "2025-10-20T17:58:28Z"
  },
  {
    "title": "Trump Says Hamas Violated Truce With Israel in Gaza",
    "description": "Israel said it has resumed a truce with Hamas in Gaza after heavy fighting over the weekend, with the sides accusing each other of breaching a deal brokered by US President Donald Trump.\nWhite House mediators Steve Witkoff and Jared Kushner arrived in Israel …",
    "link": "https://biztoc.com/x/a362ee0e16f35ae7",
    "timestamp": "2025-10-20T17:58:27Z"
  },
  {
    "title": "Crypto's Half-finished Legislative Agenda Teeters as CEOs Set Meeting With Democrats",
    "description": "Some of the top digital assets execs are heading to a meeting this week with U.S. Senate Democrats to see about getting the market structure bill moving.",
    "link": "https://www.coindesk.com/policy/2025/10/20/crypto-s-half-finished-legislative-agenda-teeters-as-ceos-set-meeting-with-democrats",
    "timestamp": "2025-10-20T17:57:47Z"
  },
  {
    "title": "No Kings rally has lost even this sympathetic critic of President Donald Trump (Opinion)",
    "description": "But now that the signs are propped against the garage wall and social media feeds feature more dog videos and advertisements than protest pics, it’s worth asking: what did the “No Kings” protest accomplish? Was the message heard by anyone other than those mak…",
    "link": "https://www.denverpost.com/2025/10/20/no-kings-rally-colorado-donald-trump-opinion/",
    "timestamp": "2025-10-20T17:55:39Z"
  },
  {
    "title": "Trump Endorses Combat Vet to Unseat “RINO” Thomas Massie",
    "description": "TrumpTruthOnXEd Gallrein and Donald Trump President Donald Trump thinks he has found his man to oust Congressman Thomas Massie (R-Ky.) in next year’s primary contest. On Friday, the president called Massie a “RINO” and announced he was backing a combat vetera…",
    "link": "https://freerepublic.com/focus/f-news/4347534/posts",
    "timestamp": "2025-10-20T17:55:37Z"
  },
  {
    "title": "Catholic bishops criticize Trump’s IVF expansion: Every life is ‘sacred and loved by God’",
    "description": "null / Credit: Rohane Hamilton/Shutterstock\n\nWashington, D.C. Newsroom, Oct 20, 2025 / 13:53 pm (CNA).\nU.S. Catholic bishops are criticizing President Donald Trump’s effort to expand access to in vitro fertilization (IVF) — a fertility treatment contrary to C…",
    "link": "https://www.catholicnewsagency.com/news/267273/catholic-bishops-criticize-trumps-ivf-expansion-every-life-is-sacred-and-loved-by-god",
    "timestamp": "2025-10-20T17:53:00Z"
  },
  {
    "title": "Trump Live Updates: Australia Prime Minister Meeting, Colombia Tariff Threats and More - The New York Times",
    "description": "Trump Live Updates: Australia Prime Minister Meeting, Colombia Tariff Threats and MoreThe New York Times Trump administration: Shutdown hits 20-day mark as Australia’s PM visits White HouseCNN Trump has awkward exchange with Australian ambassador during bilat…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179836900",
    "timestamp": "2025-10-20T17:52:54Z"
  },
  {
    "title": "Karoline Leavitt Shares Screenshot Of Texts With HuffPost... Somehow Thinking It Helps Her Case",
    "description": "The press secretary still didn't answer the question we asked her, either.",
    "link": "https://www.huffpost.com/entry/trump-leavitt-your-mom_n_68f66989e4b0dbac45901c81",
    "timestamp": "2025-10-20T17:52:25Z"
  },
  {
    "title": "Nvidia still needs Taiwan even as TSMC ramps Blackwell production in Arizona",
    "description": "AI arms dealer relies on Taiwanese advanced packaging plants for top-specced GPUs\nUS manufacturing of Nvidia GPUs is underway and CEO Jensen Huang is celebrating the first Blackwell wafer to come out of TSMC's Arizona chip factory. However, to be part of a co…",
    "link": "https://www.theregister.com/2025/10/20/nvidia_arizona_blackwell/",
    "timestamp": "2025-10-20T17:51:14Z"
  },
  {
    "title": "GOP bill targets United Nations' global carbon 'tax scheme'",
    "description": "A new House Republican bill would prohibit U.S. funding to United Nations agencies that attempt to levy taxes amid the debate over the International Maritime Organization.",
    "link": "https://www.foxnews.com/politics/gop-bill-targets-united-nations-global-carbon-tax-scheme",
    "timestamp": "2025-10-20T17:50:25Z"
  },
  {
    "title": "ASRA NOMANI: The $2.1 billion machine behind 'spontaneous' anti-Trump protests",
    "description": "Early Tuesday evening, as National Guard troops faced off against protesters and rioters on the streets of Los Angeles, powerful teachers’ union president Randi Weingarten hosted a virtual town hall with Democratic Kentucky Gov. Andy Beshear.and two leading p…",
    "link": "https://freerepublic.com/focus/f-chat/4347532/posts",
    "timestamp": "2025-10-20T17:49:33Z"
  },
  {
    "title": "U.S. and Australia sign critical minerals agreement with $8.5 billion project pipeline",
    "description": "President Donald Trump and Australian Prime Minister Anthony Albanese on Monday signed an agreement on critical minerals that includes plans for projects worth a total of up to $8.5 billion.\n\"There will be $1 billion contributed from Australia and the United …",
    "link": "https://biztoc.com/x/3f5bd4fa46675a5f",
    "timestamp": "2025-10-20T17:47:31Z"
  },
  {
    "title": "Brent Crude Falls To Lowest In Five Months - What Led To The Decline",
    "description": "Brent crude oil futures plummeted to a five-month low, falling below $62 per barrel, as concerns over a global oil supply glut and weakening demand gains traction. In the last five months, the commodity has seen a sharp drop of over 7%, and is currently tradi…",
    "link": "https://www.ndtvprofit.com/markets/brent-crude-falls-to-lowest-in-five-months-what-led-to-the-decline",
    "timestamp": "2025-10-20T17:45:08Z"
  },
  {
    "title": "Kenny Loggins His ‘Danger Zone’ Taken Out Of Trump’s Controversial AI Video",
    "description": "Loggins joins Cher, Céline Dion, Beyoncé and others in protesting the use of his music by the Trump administration.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2025/10/20/kenny-loggins-his-danger-zone-taken-out-of-trumps-controversial-ai-video/",
    "timestamp": "2025-10-20T17:43:43Z"
  },
  {
    "title": "US, Australia sign rare earth, mineral agreement as China tightens supply",
    "description": "US President Donald Trump said the deal had been negotiated over the last four to five months.",
    "link": "https://www.aljazeera.com/economy/2025/10/20/us-australia-sign-rare-earth-mineral-agreement-as-china-tightens-supply",
    "timestamp": "2025-10-20T17:40:33Z"
  },
  {
    "title": "Hey Hey Ho Ho -– The UN has Got to Go!",
    "description": "President Donald Trump’s blunt assessment of the United Nations in his Sept. 23 address wasn’t just another form of political theater.It served as a reality check for an institution that has long sacrificed its purpose and mission for pretenses and spectacle,…",
    "link": "https://freerepublic.com/focus/f-news/4347528/posts",
    "timestamp": "2025-10-20T17:40:01Z"
  },
  {
    "title": "Trump Completes Renovations To White House Throne Room",
    "description": "WASHINGTON, D.C. — Trump administration officials announced on Monday that renovations on the White House Throne Room have been completed. According to sources, the new throne room had undergone extensive remodeling to reflect President Donald Trump's increas…",
    "link": "https://freerepublic.com/focus/f-bloggers/4347526/posts",
    "timestamp": "2025-10-20T17:37:51Z"
  },
  {
    "title": "‘Walking Middle Finger’: George Santos Victim Denounces Trump Over Fraudster’s Commutation",
    "description": "A veteran who accused George Santos of stealing thousands of dollars meant for his dying dog ripped President Trump for letting him out of prison: \"travesty\"\nThe post ‘Walking Middle Finger’: George Santos Victim Denounces Trump Over Fraudster’s Commutation f…",
    "link": "https://www.mediaite.com/politics/walking-middle-finger-george-santos-victim-denounces-trump-over-fraudsters-commutation/",
    "timestamp": "2025-10-20T17:36:52Z"
  },
  {
    "title": "'You have your answer': GOP accused of major revelation with 'damning' No Kings response",
    "description": "The Republican response to this weekend's massive No Kings demonstrations showed they're ready to crown President Donald Trump as absolute ruler, an analyst wrote Monday.The president dismissed the protests, which drew an estimated 7 million people at 2,600 e…",
    "link": "https://www.rawstory.com/republican-response-to-no-kings/",
    "timestamp": "2025-10-20T17:36:07Z"
  },
  {
    "title": "Ultraconservative Sanae Takaichi set to become Japan’s first female prime minister",
    "description": "Sanae Takaichi is on track to become Japan’s first female prime minister, after her governing party secured a crucial coalition partner.",
    "link": "https://www.pbs.org/newshour/world/ultraconservative-sanae-takaichi-set-to-become-japans-first-female-prime-minister",
    "timestamp": "2025-10-20T17:34:59Z"
  },
  {
    "title": "Millions turn out for anti-Trump ‘No Kings’ rallies",
    "description": "An estimated 7 million people participated, 2 million more than at the first ‘No Kings’ protest in June",
    "link": "https://theweek.com/politics/no-kings-protests-trump",
    "timestamp": "2025-10-20T17:34:45Z"
  },
  {
    "title": "Trump calls for Ukraine war to halt with Russia in control of occupied territory: \"Leave it the way it is\" - CBS News",
    "description": "Trump calls for Ukraine war to halt with Russia in control of occupied territory: \"Leave it the way it is\"CBS News Trump calls for Ukraine to be carved up with Russia after tense meeting with ZelenskyyCNBC How Trump-Zelensky meeting turned acrimonious over de…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179836790",
    "timestamp": "2025-10-20T17:33:23Z"
  },
  {
    "title": "Airlines Keep Flying As Congress Keeps Fighting",
    "description": "During the last shutdown, major airline stocks actually rose nearly 15%, outperforming the market. Southwest Airlines was the top performer, soaring close to 20%.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/10/20/airlines-keep-flying-as-congress-keeps-fighting/",
    "timestamp": "2025-10-20T17:32:34Z"
  },
  {
    "title": "Utah County is paying more for attorneys for Tyler Robinson, accused in Charlie Kirk killing, than in other death penalty cases",
    "description": "Utah County officials say the increased attention and public scrutiny of the death penalty case against Tyler Robinson, the 22-year-old accused of fatally shooting conservative activist Charlie Kirk, contributed to their decision to pay more for Robinson’s de…",
    "link": "https://freerepublic.com/focus/f-news/4347525/posts",
    "timestamp": "2025-10-20T17:31:48Z"
  },
  {
    "title": "Trump goes all-out against Colombia’s Petro after claims drug strike killed fisherman: What we know",
    "description": "President Donald Trump threatens Colombia with tariffs after President Petro challenges U.S. Caribbean strikes targeting alleged narco-terrorists, escalating tensions.",
    "link": "https://www.foxnews.com/politics/trump-goes-all-out-against-colombias-petro-after-claims-drug-strike-killed-fisherman-what-we-know",
    "timestamp": "2025-10-20T17:29:33Z"
  },
  {
    "title": "Coffee gains as Brazilian stocks in exchange warehouses shrink",
    "description": "Arabica coffee futures jumped as Brazilian stocks in exchange-monitored warehouses fell to the lowest level in five years. Find out more now",
    "link": "https://financialpost.com/commodities/coffee-gains-brazilian-stocks-shrink",
    "timestamp": "2025-10-20T17:28:31Z"
  },
  {
    "title": "Prince Andrew Facing Total Royal BAN from Prince William: Banned from Coronation & …",
    "description": "Reading Time: 4 minutesAccording to a new report, Prince William is working to further excise Prince Andrew from the royal family -- not stopping at his titles.\nPrince Andrew Facing Total Royal BAN from Prince William: Banned from Coronation & … was originall…",
    "link": "http://www.thehollywoodgossip.com/2025/10/prince-andrew-banned-by-prince-william/",
    "timestamp": "2025-10-20T17:27:27Z"
  },
  {
    "title": "Who the Hell Heisted the Louvre?",
    "description": "A group of unidentified thieves who stole eight pieces of the French crown jewels has authorities rethinking their entire security protocol.",
    "link": "http://www.thecut.com/article/who-is-behind-louvre-heist.html",
    "timestamp": "2025-10-20T17:27:15Z"
  },
  {
    "title": "Former Sears boss says CEOs won’t challenge Trump’s tariffs out of ‘cowardice’—but the holidays are fast approaching, and ‘the party is over’",
    "description": "Mark Cohen expects many shelves at retailers will be empty this holiday season.",
    "link": "https://fortune.com/2025/10/20/tariffs-ceo-cowardice-holiday-shopping-inflation-trump-tariffs-sears-mark-cohen/",
    "timestamp": "2025-10-20T17:26:03Z"
  },
  {
    "title": "Karoline Leavitt goes scorched earth on HuffPost reporter, says stop texting 'bulls---' questions",
    "description": "The youngest press secretary in history, Karoline Leavitt, sparked controversy with her response to HuffPost reporter S.V. Dáte's questions about Trump.",
    "link": "https://www.foxnews.com/media/karoline-leavitt-goes-scorched-earth-huffpost-reporter-says-stop-texting-bulls-questions",
    "timestamp": "2025-10-20T17:25:42Z"
  },
  {
    "title": "Sustaining The Unsustainable",
    "description": "Sustaining The Unsustainable\n \nBy Rabobank\nThe Dow Jones, NASDAQ and S&P500 closed around half a percentage point higher on Friday following comments by Donald Trump to Fox News that elevated tariffs on China are not “sustainable”. Markets seem to be interpre…",
    "link": "https://biztoc.com/x/0501568f6f1986ea",
    "timestamp": "2025-10-20T17:25:04Z"
  },
  {
    "title": "GOP senator of poverty-stricken state walloped with $8M IRS tax lien: report",
    "description": "The junior U.S. senator representing a state with one of the highest rates of childhood poverty in the country has been slapped with an $8 million IRS tax lien, Politico reported Monday.Sen. Jim Justice (R-WV), the former governor who assumed former Sen. Joe …",
    "link": "https://www.rawstory.com/jim-justice-2674215471/",
    "timestamp": "2025-10-20T17:24:13Z"
  },
  {
    "title": "As GOP Shutdown Drags On, Poll Shows Most US Voters Concerned About Rising Healthcare Premiums",
    "description": "Twenty days into the federal government shutdown, polling released Monday by Data for Progress and Groundwork Collaborative shows that US voters are concerned about rising healthcare premiums and want Democrats in Congress to keep fighting for a fix.The GOP h…",
    "link": "https://www.commondreams.org/news/health-insurance-premiums-rise",
    "timestamp": "2025-10-20T17:21:17Z"
  },
  {
    "title": "U.S. and Australia sign critical minerals agreement with $8.5 billion project pipeline",
    "description": "The projects include rare earths processing, Australian Prime Minister Anthony Albanese said at the White House during a meeting with President Donald Trump.",
    "link": "https://www.cnbc.com/2025/10/20/trump-australia-albanese-minerals-rare-earths-china.html",
    "timestamp": "2025-10-20T17:20:29Z"
  },
  {
    "title": "Top White House Economics Advisor Predicts Government Shutdown Will End This Week, Warns of 'Stronger Measures'",
    "description": "National Economic Council Director Kevin Hassett predicted Monday that the ongoing government shutdown is \"likely to end sometime this week\" but warned the Trump administration may impose \"stronger measures\" if the funding impasse continues.\nThe post Top Whit…",
    "link": "https://www.breitbart.com/economy/2025/10/20/top-white-house-economics-advisor-predicts-government-shutdown-will-end-this-week-warns-of-stronger-measures/",
    "timestamp": "2025-10-20T17:20:03Z"
  },
  {
    "title": "Trump touts deal with Australia on rare earths ahead of Xi meeting (Washington Post)",
    "description": "Washington Post:\nTrump touts deal with Australia on rare earths ahead of Xi meeting  —  The White House has criticized China's efforts to limit access to materials and minerals needed for manufacturing.  —  Just now  —  President Donald Trump and Australian P…",
    "link": "https://www.memeorandum.com/251020/p65",
    "timestamp": "2025-10-20T17:20:01Z"
  },
  {
    "title": "Trump accelerates tensions with Venezuela — and risks a longer, messier crisis",
    "description": "In less than 48 hours on Wednesday and Thursday, three developments reshaped the U.S. posture towards Venezuelan President Nicolás Maduro.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-venezuela-maduro-us-military-drugs-rcna238084",
    "timestamp": "2025-10-20T17:20:00Z"
  },
  {
    "title": "Democrats Express Fear of Far Left as Shutdown Rages",
    "description": "In newly reported remarks, some Democrat insiders are blaming the far Left for the failure of Senate Democrats to vote to end the federal government... Read More\nThe post Democrats Express Fear of Far Left as Shutdown Rages appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/20/democrats-express-fear-far-left-shutdown-rages/",
    "timestamp": "2025-10-20T17:19:25Z"
  },
  {
    "title": "Trump Suddenly Changes His Tune on Ukraine After Disaster Meeting",
    "description": "President Donald Trump flailed Monday while walking back his support for Ukraine.During a press conference, Trump was asked about a comment he made last month suggesting that Ukraine could “win” the war against Russia and claim all of the territory seized by …",
    "link": "https://newrepublic.com/post/202013/donald-trump-changes-ukraine-russia-disaster-meeting",
    "timestamp": "2025-10-20T17:17:57Z"
  },
  {
    "title": "GOP opens door to new ‘culture of corruption’ allegations in sequel to scandalous Bush era",
    "description": "\"Culture of corruption\" allegations dogged the GOP the last time a Republican president was in his second term. In 2025, conditions appear ripe for a sequel.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gop-opens-door-new-culture-corruption-allegations-sequel-scandalous-bu-rcna238673",
    "timestamp": "2025-10-20T17:16:17Z"
  },
  {
    "title": "Colombia recalls US ambassador after Trump calls its leader 'illegal drug leader,' threatens military action",
    "description": "Foreign Minister Rosa Yolanda Villavicencio Mapy announced Colombia's ambassador recall amid rising tensions following Trump's accusations against President Gustavo Petro Urrego.",
    "link": "https://www.foxnews.com/politics/colombia-recalls-us-ambassador-after-trump-calls-leader-illegal-drug-leader-threatens-military-action",
    "timestamp": "2025-10-20T17:15:21Z"
  },
  {
    "title": "Trump Says Australia Will Get Submarines As PM Visits",
    "description": "US President Donald Trump said Australia would get coveted nuclear-powered attack submarines and signed a deal on rare earth minerals with Prime Minister Anthony Albanese at the White House on Monday.",
    "link": "https://www.ibtimes.com/trump-says-australia-will-get-submarines-pm-visits-3787679",
    "timestamp": "2025-10-20T17:15:11Z"
  },
  {
    "title": "Coming Soon to the Supreme Court: Are Tariffs Taxes?",
    "description": "The correct answer is: Yes, even when they are also regulations. Whether the Court agrees could determine the future of presidential power.",
    "link": "https://reason.com/2025/10/20/coming-soon-to-the-supreme-court-are-tariffs-taxes/",
    "timestamp": "2025-10-20T17:14:17Z"
  },
  {
    "title": "Star Fox host Laura Ingraham is now in business with the president's son (Matt Gertz/Media Matters for America)",
    "description": "Matt Gertz / Media Matters for America:\nStar Fox host Laura Ingraham is now in business with the president's son  —  Fox News star Laura Ingraham spent years railing against the purported corruption caused by the business interests of President Joe Biden's so…",
    "link": "https://www.memeorandum.com/251020/p63",
    "timestamp": "2025-10-20T17:10:00Z"
  },
  {
    "title": "We Found Antifa At A 'No Kings' Rally",
    "description": "Mike Johnson was right. This is terrifying and has no place at peaceful, nationwide protests against Trump's authoritarianism.",
    "link": "https://www.huffpost.com/entry/antifa-no-kings-protest-mike-johnson_n_68f14c07e4b061265b2c2ac1",
    "timestamp": "2025-10-20T17:06:50Z"
  },
  {
    "title": "Trump Singles Out ‘Nasty Guy’ Aussie Reporter During Presser With PM",
    "description": "An Australian reporter was caught off guard Monday as President Donald Trump called him a \"nasty guy\" while he tried to bark out a question during a Q&A session with Aussie Prime Minister Anthony Albanese\nThe post Trump Singles Out ‘Nasty Guy’ Aussie Reporter…",
    "link": "https://www.mediaite.com/media/news/trump-singles-out-nasty-guy-aussie-reporter-during-presser-with-pm/",
    "timestamp": "2025-10-20T17:06:42Z"
  },
  {
    "title": "Why many transgender Americans are preparing to flee the country",
    "description": "When President Donald Trump first took office in 2017, it wasn’t self-evident that the transgender community, in particular, had anything to fear. Prior to his presidency, Trump had said largely positive, or at least tolerant, things about LGBTQ+ people. He s…",
    "link": "https://www.vox.com/today-explained-newsletter/465248/trump-trans-rights-today-explained-sosin",
    "timestamp": "2025-10-20T17:05:21Z"
  },
  {
    "title": "Bulgaria willing to offer air corridor for Putin to meet Trump in Budapest",
    "description": "“How is it proposed to hold the meeting if one of the participants cannot get to it?” Foreign Minister Georg Georgiev said on Monday",
    "link": "https://www.euractiv.com/news/bulgaria-willing-to-offer-air-corridor-for-putin-to-meet-trump-in-budapest/",
    "timestamp": "2025-10-20T17:04:29Z"
  },
  {
    "title": "Trump says Hamas will be 'eradicated' if they breach Gaza deal",
    "description": "In a decisive statement, President Donald Trump has provided Hamas with an opportunity to maintain the fragile truce with Israel. He cautioned that any failure to adhere to the agreement could lead to their total eradication. Trump emphasized that the United …",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-hamas-will-be-eradicated-if-they-breach-gaza-deal/articleshow/124708240.cms",
    "timestamp": "2025-10-20T17:03:46Z"
  },
  {
    "title": "Trump Admits Gaza Peace Deal Is Crumbling as He Warns of More Violence",
    "description": "“Peace in the Middle East” may be almost over.Even Donald Trump recognized the fragility of the ceasefire arrangement between Israel and Palestine Monday, mentioning during a meeting with Australian Prime Minister Anthony Albanese that his administration was …",
    "link": "https://newrepublic.com/post/202012/donald-trump-gaza-peace-deal-violence",
    "timestamp": "2025-10-20T17:03:13Z"
  },
  {
    "title": "Zelenskyy Shouts Down Trump; Will Not Surrender To Russia",
    "description": "The Financial Times reports that Donald Trump and Volodymyr Zelenskyy got into a huge shouting match on Friday, when Trump tried to force the Ukraine president to accept Russia's deal or else \"they will be destroyed.\"\nSince he took office, Donald Trump has be…",
    "link": "https://crooksandliars.com/2025/10/zelenskyy-shouts-down-trump-and-will-not",
    "timestamp": "2025-10-20T17:03:09Z"
  },
  {
    "title": "Karoline Leavitt Defends 'Your Mom' Response To Reporter's Serious Question",
    "description": "White House Press Secretary Karoline Leavitt defended answering a reporter's serious question about why President Donald Trump chose Budapest to meet with Russian President Vladimir Putin by saying, \"Your mom did.\"\n\n\nIn a Monday post to X, Leavitt confirmed t…",
    "link": "https://crooksandliars.com/2025/10/karoline-leavitt-defends-your-mom-response",
    "timestamp": "2025-10-20T17:03:08Z"
  },
  {
    "title": "Coming Soon to the Supreme Court: Are Tariffs Taxes?",
    "description": "President Donald Trump has used the International Emergency Economic Powers Act (IEEPA) to levy duties on $2.2 trillion worth of imports. Next month, the Supreme Court will hear arguments about whether those tariffs are constitutional.\nThe Constitution unambi…",
    "link": "https://biztoc.com/x/9fefc8095544a2b7",
    "timestamp": "2025-10-20T17:02:23Z"
  },
  {
    "title": "Duffy Suggests NASA Could Ditch Musk’s SpaceX For Moon Landing: ‘Way Behind Schedule’",
    "description": "Artemis III project predicted to launch US Astronauts to the surface of the moon in mid 2027.",
    "link": "https://www.forbes.com/sites/kirkogunrinde/2025/10/20/duffy-suggests-nasa-could-ditch-musks-spacex-for-moon-landing-way-behind-schedule/",
    "timestamp": "2025-10-20T17:02:22Z"
  },
  {
    "title": "Cardi Calls Out Trump Administration For SNAP Delays: ‘Mind You, Thanksgiving Is Next Month!’",
    "description": "Cardi B took to X Spaces on Oct. 18 to call out Donald Trump and his administration as the federal government shutdown continues. With funding for the Supplemental Nutrition Assistance Program (SNAP), formerly known as the food stamp program, expected to run …",
    "link": "https://bossip.com/3996073/cardi-b-calls-out-trump-administration-snap-delays/",
    "timestamp": "2025-10-20T17:02:12Z"
  },
  {
    "title": "EU pushes back on Trump’s demand Ukraine cede territory to Putin",
    "description": "Top diplomat Kaja Kallas said EU countries should stand behind the principle of territorial integrity for Ukraine.",
    "link": "https://www.politico.eu/article/eu-kaja-kallas-pushes-back-on-donald-trump-demand-ukraine-cede-territory-to-russia-vladimir-putin/",
    "timestamp": "2025-10-20T17:01:56Z"
  },
  {
    "title": "Kenny Loggins Exploring Legal Options to Stop Trump Using 'Danger Zone'",
    "description": "Kenny Loggins is super pissed Donald Trump ripped his classic \"Danger Zone\" for a recent controversial video ... and the iconic singer is ready to take action. Here's the deal ... Trump used the 'Top Gun' classic in an A.I. video in which DT pilots…\n Permalink",
    "link": "https://www.tmz.com/2025/10/20/kenny-loggins-wants-trump-stop-using-song-danger-zone/",
    "timestamp": "2025-10-20T17:01:42Z"
  },
  {
    "title": "Response to President Trump's Unauthorized Use of \"Danger Zone\" (Kenny Loggins)",
    "description": "Kenny Loggins:\nResponse to President Trump's Unauthorized Use of “Danger Zone”  —  Late Saturday, Oct. 18, President Donald Trump posted an AI-generated video on his Truth Social account that portrayed him dumping brown sludge on a crowd of protesters while w…",
    "link": "https://www.memeorandum.com/251020/p60",
    "timestamp": "2025-10-20T17:00:31Z"
  },
  {
    "title": "Trump Signs Critical Minerals Agreement With Australia",
    "description": "With China trying to control the rare earths and critical minerals market, Australia hopes to become \"a viable alternative\" for countries.\nThe post Trump Signs Critical Minerals Agreement With Australia first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/trump-signs-critical-minerals-agreement-with-australia/",
    "timestamp": "2025-10-20T17:00:01Z"
  },
  {
    "title": "Italian PM Giorgia Meloni marks three years in power as support for her far-right party grows",
    "description": "Her Brothers of Italy party now polls above the 26% that won her power.",
    "link": "https://www.nzherald.co.nz/world/giorgia-meloni-marks-three-years-in-power-as-support-for-far-right-party-grows/K4PBSHJ245DCZHENMXKMA3KSZY/",
    "timestamp": "2025-10-20T17:00:01Z"
  },
  {
    "title": "US and Australia sign critical-minerals agreement as way to counter China",
    "description": "US President Donald Trump and Australian Prime Minister Anthony Albanese signed a critical-minerals deal at the White House on Monday as the US eyes the continent's rich rare-earth resources when China is imposing tougher rules on exporting its own critical m…",
    "link": "https://www.independent.ie/world-news/north-america/us-and-australia-sign-critical-minerals-agreement-as-way-to-counter-china/a198881796.html",
    "timestamp": "2025-10-20T16:59:58Z"
  },
  {
    "title": "Trump Completes Renovations To White House Throne Room",
    "description": "WASHINGTON, D.C. — Trump administration officials announced on Monday that renovations on the White House Throne Room have been completed.",
    "link": "https://babylonbee.com/news/trump-completes-renovations-to-white-house-throne-room",
    "timestamp": "2025-10-20T16:59:13Z"
  },
  {
    "title": "‘Ay Yay Yay!’ Trump Stops Presser to Scold a Cameraman Who Hit a ‘400-Year-Old’ Mirror",
    "description": "President Donald Trump was briefly distracted during a press conference Monday when he noticed a cameraman bump into an antique mirror.\nThe post ‘Ay Yay Yay!’ Trump Stops Presser to Scold a Cameraman Who Hit a ‘400-Year-Old’ Mirror first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/ay-yay-yay-trump-stops-presser-to-scold-a-cameraman-who-hit-a-400-year-old-mirror/",
    "timestamp": "2025-10-20T16:58:26Z"
  },
  {
    "title": "Justice Jackson Says \"Blacks Are Disabled\" [semi-satire]",
    "description": "Supreme Court Justice Ketanji Brown Jackson cited the Americans with Disabilities Act (ADA) to support her contention that \"gerrymandering congressional districts to ensure that there are more majority Black districts is constitutional. Mental ability statist…",
    "link": "https://freerepublic.com/focus/f-bloggers/4347519/posts",
    "timestamp": "2025-10-20T16:57:25Z"
  },
  {
    "title": "The No Kings Protests Proved That Seeing and Naming the Problem Is Not Enough",
    "description": "In March 2023, anticipating his indictment, Donald Trump stood before a Conservative Political Action Conference audience and delivered what seemed like two speeches at once. \"I am your warrior, I am your justice,\" he declared. \"And for those who have been wr…",
    "link": "https://www.commondreams.org/opinion/no-kings-awareness",
    "timestamp": "2025-10-20T16:55:03Z"
  },
  {
    "title": "Trump fan arrested for pointing gun at No Kings protesters: 'Very ignorant move' (Travis Gettys/Raw Story)",
    "description": "Travis Gettys / Raw Story:\nTrump fan arrested for pointing gun at No Kings protesters: ‘Very ignorant move’  —  A fan of President Donald Trump was arrested and charged with waving a gun at demonstrators at a No Kings protest in South Carolina.  —  Mary Moria…",
    "link": "https://www.memeorandum.com/251020/p59",
    "timestamp": "2025-10-20T16:55:00Z"
  },
  {
    "title": "US to expedite nuclear-powered subs to Australia that will sit near China’s doorstep",
    "description": "President Donald Trump said he wants to accelerate nuclear submarine deliveries to Australia under the AUKUS agreement during White House meeting.",
    "link": "https://www.foxnews.com/politics/us-expedite-nuclear-powered-subs-australia-sit-near-chinas-doorstep",
    "timestamp": "2025-10-20T16:53:46Z"
  },
  {
    "title": "Trump Angered to Learn Australian Ambassador Criticized Him: ‘I Don’t Like You Either’",
    "description": "President Donald Trump took questions from reporters at the White House on Monday while meeting with Australian Prime Minister Anthony Albanese.\nThe post Trump Angered to Learn Australian Ambassador Criticized Him: ‘I Don’t Like You Either’ first appeared on …",
    "link": "https://www.mediaite.com/media/tv/trump-angered-to-learn-australian-ambassador-criticized-him-i-dont-like-you-either/",
    "timestamp": "2025-10-20T16:53:00Z"
  },
  {
    "title": "DOJ seeks removal of Comey's defense lawyer, citing conflict of interest",
    "description": "Prosecutors signaled they might seek the dismissal of James Comey's lead defense attorney — though he is just one of several big names defending the former FBI director.",
    "link": "https://www.foxnews.com/politics/doj-seeks-removal-comeys-defense-lawyer-citing-conflict-interest",
    "timestamp": "2025-10-20T16:52:35Z"
  },
  {
    "title": "The world economy shrugs off both the trade war and AI fears",
    "description": "The world economy shrugs off both the trade war and AI fears\nCan anything bring it down?\nSIX MONTHS ago, as President Donald Trump announced a trade war of unprecedented aggression, businesses and investors braced for a slump. Movements in financial markets p…",
    "link": "https://biztoc.com/x/0440f79472392500",
    "timestamp": "2025-10-20T16:51:35Z"
  },
  {
    "title": "Donald Trump Says Ukraine Can 'Still Win' War With Russia",
    "description": "Trump also said he had urged Russia to stop attacking Ukrainian civilians.",
    "link": "https://biztoc.com/x/faeed482e5784d6a",
    "timestamp": "2025-10-20T16:51:25Z"
  }
]