[
  {
    "title": "School Choice Is A Point Of Contention In Race To Fill U.S. House Seat",
    "description": "In race to fill congressional vacancy, a Republican who voted against education savings accounts in the statehouse now postures as a champion of school choice.",
    "link": "https://www.forbes.com/sites/patrickgleason/2025/09/19/school-choice-is-a-point-of-contention-in-race-to-fill-us-house-seat/",
    "timestamp": "2025-09-19T16:49:38Z"
  },
  {
    "title": "Charlie Kirk's Wife Erika Kirk Unanimously Elected CEO and Chair of Turning Point USA",
    "description": "Erika Kirk is unanimously elected CEO and Chair of Turning Point USA after Charlie Kirk's tragic death.",
    "link": "https://www.ibtimes.com/charlie-kirks-wife-erika-kirk-unanimously-elected-ceo-chair-turning-point-usa-3783920",
    "timestamp": "2025-09-19T16:49:10Z"
  },
  {
    "title": "Trump Denies Planning Regime Change in Venezuela Amid U.S. Military Buildup",
    "description": "Meanwhile, Venezuelan President Nicolás Maduro declared Monday that his country's relationship with the United States is \"completely broken,\" accusing Washington of waging military and political aggression",
    "link": "https://www.ibtimes.com/trump-denies-planning-regime-change-venezuela-amid-us-military-buildup-3783917",
    "timestamp": "2025-09-19T16:48:41Z"
  },
  {
    "title": "Venezuela Advances Cooperation Pact With Russia While Denouncing 'Imperialist Policies' of U.S.",
    "description": "The measure outlines a \"multipolar order based on sovereignty and equality of states\" and calls for high-level political dialogue between Caracas and Moscow",
    "link": "https://www.ibtimes.com/venezuela-advances-cooperation-pact-russia-while-denouncing-imperialist-policies-us-3783916",
    "timestamp": "2025-09-19T16:48:25Z"
  },
  {
    "title": "Was Trump’s UK Visit All Just a Gaudy Photo Op?",
    "description": "While protesters took to the streets of London, the president surrounded himself with British yes men",
    "link": "https://www.esquire.com/news-politics/politics/a67963185/trump-uk-visit-protests-flattery/",
    "timestamp": "2025-09-19T16:48:00Z"
  },
  {
    "title": "Trump’s moves against the media mirror approaches by authoritarian leaders to silence dissent",
    "description": "Trump has waged an aggressive campaign against the media unlike any in modern U.S. history.",
    "link": "https://www.denverpost.com/2025/09/19/trump-authoritarian-leaders/",
    "timestamp": "2025-09-19T16:47:51Z"
  },
  {
    "title": "Trump’s moves against the media mirror approaches by authoritarian leaders to silence dissent",
    "description": "Trump has waged an aggressive campaign against the media unlike any in modern U.S. history.",
    "link": "https://www.bostonherald.com/2025/09/19/trump-authoritarian-leaders/",
    "timestamp": "2025-09-19T16:47:51Z"
  },
  {
    "title": "Bill O’Reilly Says He Tried to Warn Jimmy Kimmel Last Year That He Was Being ‘Consumed’ by Hatred for Trump | Video",
    "description": "\"I'm not happy Jimmy Kimmel got fired, and I know a lot of people are, including the president,\" the conservative news commentator says\nThe post Bill O’Reilly Says He Tried to Warn Jimmy Kimmel Last Year That He Was Being ‘Consumed’ by Hatred for Trump | Vide…",
    "link": "https://www.thewrap.com/bill-oreilly-tried-to-warn-jimmy-kimmel-suspension-trump-hatred/",
    "timestamp": "2025-09-19T16:44:00Z"
  },
  {
    "title": "Stocks Up Slightly as Trump-Xi Call Concludes",
    "description": "Updated 24 min ago\nStocks Up Slightly as Trump-Xi Call Concludes\nThe stock market was grinding higher again after President Donald Trump posted about his call with his Chinese counterpart Xi Jinping.\nThe Dow was up 100 points, or 0.2%, Friday after briefly tu…",
    "link": "https://biztoc.com/x/48f023034fd92676",
    "timestamp": "2025-09-19T16:43:34Z"
  },
  {
    "title": "EU to finalise probes into tech platforms soon: Digital chief Henna Virkkunen",
    "description": "Several online platforms, including Chinese retailers AliExpress and Temu and social media giants Facebook, Instagram, X and TikTok, are being probed under the European Union's landmark Digital Services Act (DSA).",
    "link": "https://economictimes.indiatimes.com/tech/technology/eu-to-finalise-probes-into-tech-platforms-soon-digital-chief-henna-virkkunen/articleshow/124002453.cms",
    "timestamp": "2025-09-19T16:41:24Z"
  },
  {
    "title": "Judge Tosses Out Donald Trump’s Lawsuit Against The New York Times: “Improper and Impermissible”",
    "description": "A federal judge tossed out Donald Trump’s $15 billion lawsuit against The New York Times, declaring that the 85-page complaint was “improper and impermissible.” The federal judge, Steven Merryday, will allow Trump’s lawyers to file a new complaint within 28 d…",
    "link": "http://deadline.com/2025/09/trump-new-york-times-lawsuit-dismissed-1236549446/",
    "timestamp": "2025-09-19T16:40:47Z"
  },
  {
    "title": "Trump's FCC chief may have broken federal statute with 'authoritarian' move against Kimmel",
    "description": "A former Federal Communications Commission chairman suggested that President Donald Trump's choice for that role may have broken a specific federal statute in addition to violating the First Amendment.FCC Chairman Brendan Carr told a right-wing podcaster Wedn…",
    "link": "https://www.rawstory.com/brendan-carr-fcc-2674010355/",
    "timestamp": "2025-09-19T16:40:20Z"
  },
  {
    "title": "Judge tosses out Trump's $15 billion lawsuit against New York Times for being too long",
    "description": "A federal judge in Florida has, for the moment, dismissed President Donald Trump's lawsuit against The New York Times due to how it was written.",
    "link": "https://www.foxnews.com/media/judge-tosses-out-trumps-15-billion-lawsuit-against-new-york-times-being-too-long",
    "timestamp": "2025-09-19T16:40:12Z"
  },
  {
    "title": "Harris stops biting her tongue in ‘107 Days,’ her book about last year’s campaign against Trump",
    "description": "The book, set for release Tuesday, reveals her frustrations and mistakes during the campaign.",
    "link": "https://www.bostonherald.com/2025/09/19/harris-book/",
    "timestamp": "2025-09-19T16:39:32Z"
  },
  {
    "title": "Senate Reportedly Moves To Clear Trump’s Nominee Backlog With 108 Confirmations In October",
    "description": "Senate Majority Leader John Thune filed a resolution to confirm 108 nominees, clearing the backlog of ambassadors, U.S. attorneys and assistant secretaries.",
    "link": "https://dailycaller.com/2025/09/19/senate-john-thune-clear-trump-108-nominee-confirmations-october/",
    "timestamp": "2025-09-19T16:39:14Z"
  },
  {
    "title": "Judge tosses Trump's $15B suit against New York Times, Penguin Random House",
    "description": "A judge has tossed President Trump's $15 billion defamation lawsuit against The New York Times and Penguin Random House, and gave Trump's lawyers 28 days to refile.",
    "link": "https://abcnews.go.com/US/judge-tosses-trumps-15b-defamation-suit-new-york/story?id=125739539",
    "timestamp": "2025-09-19T16:38:49Z"
  },
  {
    "title": "Trump Says Late Night Shows Are 'Not Allowed' to Be Mean to Him",
    "description": "Barf Bag: The party of free speech, everyone!",
    "link": "https://www.jezebel.com/trump-says-late-night-shows-are-not-allowed-to-be-mean-to-him",
    "timestamp": "2025-09-19T16:38:45Z"
  },
  {
    "title": "Purple Haired Dem Spends Over A Minute Shrieking At Republicans Over Healthcare",
    "description": "Democratic Connecticut Rep. Rosa DeLauro spent over one minute shouting at her Republican colleagues over a CR bill that she claimed will take away healthcare.",
    "link": "https://dailycaller.com/2025/09/19/purple-haired-dem-yells-at-republicans-over-healthcare/",
    "timestamp": "2025-09-19T16:38:24Z"
  },
  {
    "title": "Judge strikes down Trump's $15bn lawsuit against the New York Times",
    "description": "A US federal judge took issue with the contents of Trump's lawsuit against the newspaper and gave him 28 days to amend it.",
    "link": "https://www.bbc.com/news/articles/c62n7025wdgo",
    "timestamp": "2025-09-19T16:38:16Z"
  },
  {
    "title": "Despite Rift With U.S., Can Colombia Revolutionize Global Drug Policy?",
    "description": "The world’s top cocaine producer takes the lead on reforming international drug policy.",
    "link": "http://foreignpolicy.com/2025/09/19/colombia-drug-policy-cocaine-united-nations-us-trump-decertification/",
    "timestamp": "2025-09-19T16:38:14Z"
  },
  {
    "title": "West Africans deported by US to Ghana sue over detention",
    "description": "A group of west Africans deported from the United States have sued the government of Ghana, alleging they were sent to the country despite having deportation protection orders from US immigration authorities. The lawsuit, filed Wednesday in a Ghanaian court o…",
    "link": "https://www.digitaljournal.com/world/west-africans-deported-by-us-to-ghana-sue-over-detention/article",
    "timestamp": "2025-09-19T16:37:20Z"
  },
  {
    "title": "Bolsonaro’s Conviction Was Decided by the Only Woman on the Brazilian Supreme Court",
    "description": "Nicole Froio\n\n\n\nMinister Cármen Lúcia Antunes Rocha cast the deciding vote, defying extreme right misogyny and sending a strong message to Bolsonaro ally US President Donald Trump.\r\n\n\r\n\n\nThe post Bolsonaro’s Conviction Was Decided by the Only Woman on the Bra…",
    "link": "https://www.thenation.com/article/world/bolsonaro-conviction-brazil-supreme-court/",
    "timestamp": "2025-09-19T16:37:14Z"
  },
  {
    "title": "Willie Nelson and Neil Young highlight 40th Farm Aid concert",
    "description": "Willie Nelson and Neil Young highlight 40th Farm Aid concerttwincities.com",
    "link": "https://www.twincities.com/2025/09/19/farm-aid/",
    "timestamp": "2025-09-19T16:36:46Z"
  },
  {
    "title": "Trump Admin Gives China ‘Free Pass’ on Russian LNG, Democratic Senators Say",
    "description": "Democratic U.S. senators urged Trump officials on Friday to resume targeted sanctions on Russian energy supplies, saying the administration is allowing China to buy shipments of Russia's liquefied natural gas which helps support the war on Ukraine.",
    "link": "https://gcaptain.com/trump-admin-gives-china-free-pass-on-russian-lng-democratic-senators-say/",
    "timestamp": "2025-09-19T16:36:08Z"
  },
  {
    "title": "Trump's $15 billion suit against NY Times struck as 'improper,' judge allows refiling",
    "description": null,
    "link": "https://www.cnbc.com/2025/09/19/trump-new-york-times-lawsuit-merryday.html",
    "timestamp": "2025-09-19T16:34:43Z"
  },
  {
    "title": "Declining health: What Biden chief of staff revealed to House panel on Jill and Hunter",
    "description": "First lady asked aide to make sure Joe got more rest and not be overscheduled",
    "link": "https://www.wnd.com/2025/09/declining-health-what-biden-chief-staff-revealed-house/",
    "timestamp": "2025-09-19T16:33:44Z"
  },
  {
    "title": "Judge Strikes Down Trump Libel Lawsuit Against NYT: ‘A Complaint Is Not a Megaphone for Public Relations’",
    "description": "Florida federal judge gives Trump 28 days to amend the complaint\nThe post Judge Strikes Down Trump Libel Lawsuit Against NYT: ‘A Complaint Is Not a Megaphone for Public Relations’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/judge-strikes-trump-lawsuit-new-york-times/",
    "timestamp": "2025-09-19T16:33:02Z"
  },
  {
    "title": "Slog AM: Trump is Doing Victory Laps Over Jimmy Kimmel, 11 Democratic Officials Were Arrested at an ICE Facility, Travis Decker's Remains Might Have Been Found",
    "description": "by Marcus Harrison Green\n \n \n \n Donald Trump is doing victory laps over Jimmy Kimmel’s suspension this week, using it as yet another excuse to threaten TV broadcasters who dare “hit Trump.” From Air Force One, he basically said: nice FCC license you got there…",
    "link": "https://www.thestranger.com/slog-am/2025/09/19/80248272/slog-am-trump-is-doing-victory-laps-over-jimmy-kimmel-11-democratic-officials-were-arrested-at-an-ice-facility-travis-deckers-remains-migh",
    "timestamp": "2025-09-19T16:32:00Z"
  },
  {
    "title": "Donald Trump Makes Emergency Supreme Court Request Over Passports",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Trump administration on Friday asked the Supreme Court to block a lower court ruling that lets transgender and nonbinary people choose the gender marker on their passports.\nThe order permits applicants to …",
    "link": "https://biztoc.com/x/23c2d278fb0fbd36",
    "timestamp": "2025-09-19T16:31:52Z"
  },
  {
    "title": "NATO Ambassador Takes Trump’s Love for Putin to Wild Extreme",
    "description": "The Trump administration’s messaging on Russia’s recent incursions is loud and clear: It’s just not a big deal.Speaking with Fox Business Friday, America’s NATO Ambassador Matthew Whitaker claimed that Russia’s threat was “a little overstated” and that the su…",
    "link": "https://newrepublic.com/post/200702/donald-trump-nato-ambassador-putin-russia-threat-overstated",
    "timestamp": "2025-09-19T16:31:20Z"
  },
  {
    "title": "Jasmine Crockett Verbally Sends Kash Patel To Valhalla During Congressional Meeting, X Loved It",
    "description": "You can always count on Texas Rep. Jasmine Crockett to bring the energy when necessary. During a recent congressional hearing with the current highly unqualified FBI Director, Kash Patel, testifying, Crockett let her disdain for the podcaster be known.",
    "link": "https://hiphopwired.com/2841650/jasmine-crockett-kash-patel-congressional-hearing-reactions/",
    "timestamp": "2025-09-19T16:31:20Z"
  },
  {
    "title": "Who qualifies for 'no tax on tips' and what counts as a tip? Here are the new rules",
    "description": "The Treasury Department is moving closer to implementing President Trump's \"no tax on tips\" promise",
    "link": "https://www.wftv.com/news/who-qualifies-no-tax/DLUK5GUBWNBIVJLY3LLEOZWGKM/",
    "timestamp": "2025-09-19T16:31:07Z"
  },
  {
    "title": "Judge rejects Trump’s New York Times lawsuit for not being ‘short, plain, direct’ | CNN Business",
    "description": "In a ruling dripping with derision, a federal judge has rejected President Trump’s defamation lawsuit against the Times. Trump has a month to refile.",
    "link": "https://www.cnn.com/2025/09/19/media/trump-new-york-times-lawsuit-dismissed-merryday",
    "timestamp": "2025-09-19T16:30:40Z"
  },
  {
    "title": "Judge rejects Trump’s case against The New York Times, tells lawyers to rewrite it",
    "description": "Like a teacher telling a student to redo his homework, a federal court told Donald Trump’s lawyers to file a less ridiculous case against the New York Times.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/judge-rejects-trump-new-york-times-case-rcna232429",
    "timestamp": "2025-09-19T16:30:40Z"
  },
  {
    "title": "Donald Trump Makes Emergency Supreme Court Request Over Passports",
    "description": "The Trump admin asked the Supreme Court to block a ruling expanding options for how people identify themselves on U.S. passports.",
    "link": "https://www.newsweek.com/supreme-court-transgender-nonbinary-passport-donald-trump-administration-2132637",
    "timestamp": "2025-09-19T16:29:54Z"
  },
  {
    "title": "Trump's NYT Lawsuit Dismissed by Republican-Appointed Judge",
    "description": "Judge Merryday, appointed by George H.W. Bush, said Trump's filing violated rules requiring a clear and concise explanation for relief.",
    "link": "https://www.newsweek.com/donald-trump-nyt-lawsuit-dismissed-new-york-times-2132655",
    "timestamp": "2025-09-19T16:29:51Z"
  },
  {
    "title": "Trump’s security under scrutiny as Secret Service braces for Kirk memorial",
    "description": "President Donald Trump's security faces heightened scrutiny after Charlie Kirk's assassination, with Secret Service operating at the highest protection measures.",
    "link": "https://www.foxnews.com/politics/trumps-security-under-scrutiny-secret-service-braces-kirk-memorial",
    "timestamp": "2025-09-19T16:29:21Z"
  },
  {
    "title": "Trump Firing Top Prosecutor for Failing to Invent Fake Crimes by Foes",
    "description": "President Donald Trump is set to fire a top federal prosecutor for committing a serious dereliction of duty, ABC News reports. What exactly is this prosecutor’s offense, you ask? Did he fail to follow Justice Department protocol? Blow an easy prosecution? Bot…",
    "link": "https://newrepublic.com/article/200697/trump-firing-prosecutor-tish-james",
    "timestamp": "2025-09-19T16:29:10Z"
  },
  {
    "title": "“Fabulous”: Fashion Experts Reveal The Hidden Messages In Melania Trump’s State Visit Looks",
    "description": "\"Never seen her so happy and relaxed.\"",
    "link": "https://www.boredpanda.com/hidden-messages-melania-trump-outfits-state-visit/",
    "timestamp": "2025-09-19T16:28:56Z"
  },
  {
    "title": "Willie Nelson and Neil Young highlight 40th Farm Aid concert",
    "description": "This year’s concert comes at a worrying time for American farmers.",
    "link": "https://www.bostonherald.com/2025/09/19/farm-aid/",
    "timestamp": "2025-09-19T16:28:44Z"
  },
  {
    "title": "US Shuts Down ‘Performative’ Gaza Ceasefire At UN It Says ‘Legitimizes’ Hamas Narratives",
    "description": "The U.S. vetoed a resolution in the United Nations calling for a ceasefire between Hamas and Israel, calling the move \"performative\" and sympathetic to Hamas narratives",
    "link": "https://dailycaller.com/2025/09/19/us-shuts-down-performative-gaza-ceasefire-at-un-it-says-legitimizes-hamas-narratives/",
    "timestamp": "2025-09-19T16:27:08Z"
  },
  {
    "title": "West Africans Deported By US To Ghana Sue Over Detention",
    "description": "A group of west Africans deported from the United States have sued the government of Ghana, alleging they were sent to the country despite having deportation protection orders from US immigration authorities.",
    "link": "https://www.ibtimes.com/west-africans-deported-us-ghana-sue-over-detention-3783954",
    "timestamp": "2025-09-19T16:27:05Z"
  },
  {
    "title": "Kill-The-Homeless Kilmeade Lectures Kimmel On 'Accountability'",
    "description": "Fox's Brian Kilmeade had the audacity to lecture Jimmy Kimmel about \"accountability\" while shilling for Trump and his Gestapo FCC Chair Brendan Carr over Kimmel's suspension.\nHere's Kilmeade's lie-filled screed while filling in for Laura Ingraham this Thursda…",
    "link": "https://crooksandliars.com/2025/09/kill-homeless-kilmeade-lectures-kimmel",
    "timestamp": "2025-09-19T16:26:27Z"
  },
  {
    "title": "Rudy Giuliani Celebrates Starbucks Update On Right-Wing Charlie Kirk Cup Trend",
    "description": "Conservatives online are sharing images of Starbucks cups with a drink Charlie Kirk said he drank \"like nine\" times a day.",
    "link": "https://www.huffpost.com/entry/rudy-giuliani-charlie-kirk-starbucks-mint-majesty-tea_n_68cd66a7e4b01c2e8cb5f202",
    "timestamp": "2025-09-19T16:26:08Z"
  },
  {
    "title": "God of Chaos asteroid Apophis approaches Earth. Will it pose threat to planet or flyby? These spacecrafts witness object, see its size",
    "description": "God of Chaos asteroid Apophis will pass Earth on April 13, 2029, in a safe flyby. Three missions—ESA’s Ramses, JAXA’s DESTINY+, and NASA’s OSIRIS-APEX—will study the asteroid’s structure, orbit, and surface changes.",
    "link": "https://economictimes.indiatimes.com/news/international/us/god-of-chaos-asteroid-apophis-approaches-earth-will-it-pose-threat-to-planet-or-flyby-april-2029-space-probes-these-spacecrafts-witness-object-size-esa-ramses-jaxa-destiny-nasa-osiris-apex-near-earth-objects/articleshow/124002074.cms",
    "timestamp": "2025-09-19T16:25:31Z"
  },
  {
    "title": "Princess Kate ‘had to suck it up’ even though she was ‘mortified’ by Donald Trump",
    "description": "Unsurprisingly, the Princess of Wales is getting a lot of credit for her “work” during the Trump state visit. Usually, Kate is treated as a non-entity incapable of any kind of soft diplomacy. Or she’s treated as mere window-dressing, a pretty princess who sho…",
    "link": "https://www.celebitchy.com/941344/princess_kate_had_to_suck_it_up_even_though_she_was_mortified_by_donald_trump/",
    "timestamp": "2025-09-19T16:25:20Z"
  },
  {
    "title": "Nvidia Wants in on the Robotaxi Race",
    "description": "Nvidia is exploring $500 million investment in Wayve Technologies, a London-based AI startup.",
    "link": "https://gizmodo.com/nvidia-funds-robotaxis-self-driving-cars-wayze-2000661414",
    "timestamp": "2025-09-19T16:25:10Z"
  },
  {
    "title": "US judge strikes Trump's lawsuit against New York Times over its content",
    "description": "A federal judge dismissed Donald Trump's $15 billion defamation lawsuit against The New York Times, citing a violation of federal procedural rules. Judge Steven Merryday criticized Trump's complaint for lacking a concise statement of deserving relief and usin…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-judge-strikes-trumps-lawsuit-against-new-york-times-over-its-content/articleshow/124002213.cms",
    "timestamp": "2025-09-19T16:24:18Z"
  },
  {
    "title": "SEC to advance Trump pitch for fewer corporate earnings reports",
    "description": "SEC chief Paul Atkins signaled that business executives and investors will have the final word on earnings schedules",
    "link": "https://qz.com/sec-semiannual-earnings-report-trump",
    "timestamp": "2025-09-19T16:24:12Z"
  },
  {
    "title": "Paramount’s Plans for CBS News, Bari Weiss Would Create Odd Coupling",
    "description": "What stands at the center of a modern journalism organization in 2025: hot takes or hot news? Paramount seems poised to choose one over the other when it comes to CBS News. The company has been in talks with Bari Weiss, founder of the successful online outlet…",
    "link": "https://variety.com/2025/tv/news/paramount-plans-cbs-news-bari-weiss-odd-couple-1236524404/",
    "timestamp": "2025-09-19T16:22:03Z"
  },
  {
    "title": "Late Night Rallies Behind Jimmy Kimmel: “Tonight, We Are All Jimmy Kimmel”",
    "description": "In the wake of Kimmel's indefinite suspension from ABC, late night hosts like Stephen Colbert, Jon Stewart, and Seth Meyers took to their programs to show support for Kimmel and lament the latest attack on free speech.",
    "link": "https://www.vanityfair.com/hollywood/story/late-night-rallies-behind-jimmy-kimmel",
    "timestamp": "2025-09-19T16:21:29Z"
  },
  {
    "title": "Mad Men GPT: AI creative studios are drawing investors and consumer eyeballs",
    "description": "The News\nThe Dor Brothers became popular with AI-generated music videos of Kamala Harris flipping the bird and President Donald Trump puffing a cigar over a burning American flag.\nNow, they find themselves in one of the hottest sectors of the US economy, brin…",
    "link": "https://biztoc.com/x/e83d34368cf1e18d",
    "timestamp": "2025-09-19T16:21:29Z"
  },
  {
    "title": "Google to Skip Full Ad Split in Reply to €3 Billion EU Fine",
    "description": "Google will meet the European Union’s deadline to propose changes to its advertising technology business after a near-€3 billion ($3.5 billion) fine — but won’t include the full breakup the EU and industry rivals have previously pushed for.",
    "link": "https://www.livemint.com/companies/news/google-to-skip-full-ad-split-in-reply-to-3-billion-eu-fine-11758298882456.html",
    "timestamp": "2025-09-19T16:21:21Z"
  },
  {
    "title": "Independence Of Central Banks Tested By Trump Attacks On US Fed",
    "description": "For months, US President Donald Trump has been piling pressure on the Federal Reserve over delayed cuts to interest rates, casting the institution's independence into doubt.",
    "link": "https://www.ibtimes.com/independence-central-banks-tested-trump-attacks-us-fed-3783951",
    "timestamp": "2025-09-19T16:21:15Z"
  },
  {
    "title": "Putin's succession plan: These are the people who could be Russia's next leaders",
    "description": "Putin succession plan: Vladimir Putin wants Ukraine war veterans in Russian politics. He believes they have proven their loyalty. These veterans will be future leaders. Around 1.5 million Russians have fought in the war. Many veterans face trauma upon returni…",
    "link": "https://economictimes.indiatimes.com/news/international/us/putins-succession-plan-these-are-the-people-who-could-be-russias-next-leaders/articleshow/124001655.cms",
    "timestamp": "2025-09-19T16:20:23Z"
  },
  {
    "title": "CNN: Princess Kate ‘has become incredibly confident in her duties’ away from cameras",
    "description": "Here are more photos of Melania Trump and the Princess of Wales’s Scout event in Windsor on Thursday. While I’m not a fan of either woman, even a hater like me can acknowledge that the event went “well.” There were no major gaffes, the photos were mostly good…",
    "link": "https://www.celebitchy.com/941311/cnn_princess_kate_has_become_incredibly_confident_in_her_duties_away_from_cameras/",
    "timestamp": "2025-09-19T16:20:04Z"
  },
  {
    "title": "Thousands In Deep Blue State Show Up Anyway At Event Kirk Was Slated To Headline",
    "description": "'Continue the legacy of debate that Charlie endorsed'",
    "link": "https://dailycaller.com/2025/09/19/thousands-in-deep-blue-state-show-up-anyway-at-event-kirk-was-slated-to-headline/",
    "timestamp": "2025-09-19T16:19:46Z"
  },
  {
    "title": "Some Republicans start rejecting the First Amendment’s free speech protections",
    "description": "One Senate Republican said she used to believe the First Amendment \"should always be sort of the ultimate right.” But now, \"I don’t feel that way anymore.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-start-rejecting-first-amendments-free-speech-protections-rcna232426",
    "timestamp": "2025-09-19T16:18:21Z"
  },
  {
    "title": "White House in process of crafting quantum executive action",
    "description": "The Trump administration has been quietly working on developing a series of new policy items for quantum technology.",
    "link": "https://www.nextgov.com/emerging-tech/2025/09/white-house-process-crafting-quantum-executive-action/408231/",
    "timestamp": "2025-09-19T16:18:00Z"
  },
  {
    "title": "Independence of central banks tested by Trump attacks on US Fed",
    "description": "For months, US President Donald Trump has been piling pressure on the Federal Reserve over delayed cuts to interest rates, casting the institution’s independence into doubt. Trump’s recent attacks have caused quite a stir as central bank independence is consi…",
    "link": "https://www.digitaljournal.com/world/independence-of-central-banks-tested-by-trump-attacks-on-us-fed/article",
    "timestamp": "2025-09-19T16:17:32Z"
  },
  {
    "title": "ABC Rightly Had Enough of Jimmy Kimmel’s ‘Comedy’",
    "description": "ABC stunned the media world on Wednesday by announcing they were suspending “Jimmy Kimmel Live!” indefinitely after several ABC station groups withdrew their support for... Read More\nThe post ABC Rightly Had Enough of Jimmy Kimmel’s ‘Comedy’ appeared first on…",
    "link": "https://www.dailysignal.com/2025/09/19/abc-rightly-had-enough-of-jimmy-kimmels-comedy/",
    "timestamp": "2025-09-19T16:17:30Z"
  },
  {
    "title": "Report: Kimmel was dropped because he was going to ‘double down’ on Charlie Kirk assassination claims",
    "description": "Generated outrage by falsely saying alleged shooter, a leftist radicalized by gender ideology, was really part of 'MAGA'",
    "link": "https://www.wnd.com/2025/09/report-kimmel-was-dropped-because-he-was-going/",
    "timestamp": "2025-09-19T16:16:34Z"
  },
  {
    "title": "The Daily Mail sent reporters to Montecito to stalk the Sussexes during Trump’s visit",
    "description": "Yesterday, we talked about the Duchess of Sussex’s quiet September. Meghan and her As Ever team have only posted a few Instagram pics this month, and there have been no big announcements. Meghan was very quiet while Prince Harry was in the UK and Ukraine, but…",
    "link": "https://www.celebitchy.com/941268/the_daily_mail_sent_reporters_to_montecito_to_stalk_the_sussexes_during_trumps_visit/",
    "timestamp": "2025-09-19T16:15:00Z"
  },
  {
    "title": "Estonia says 3 Russian fighter jets entered its airspace in ‘brazen’ incursion",
    "description": "It comes just over a week after NATO planes downed Russian drones over Poland.",
    "link": "https://www.bostonherald.com/2025/09/19/russia-ukraine-war-estonian-incursion/",
    "timestamp": "2025-09-19T16:13:48Z"
  },
  {
    "title": "Miran says he doesn't see tariffs causing inflation, putting him in minority on Fed committee",
    "description": "Federal Reserve Governor Stephen Miran spoke on CNBC's \"Money Movers\" on Friday.",
    "link": "https://www.cnbc.com/2025/09/19/miran-says-he-doesnt-see-tariffs-causing-inflation-putting-him-in-minority-on-fed-committee.html",
    "timestamp": "2025-09-19T16:12:21Z"
  },
  {
    "title": "Trump administration seeks Supreme Court intervention on passport gender ID options",
    "description": "The Trump administration asked the Supreme Court to halt a judge’s order allowing transgender and nonbinary people to choose the sex marker on their passports.",
    "link": "https://turnto10.com/news/nation-world/trump-administration-seeks-supreme-court-intervention-on-passport-gender-id-options-transgender-nonbinary-sex-birth-certificate-lgbtq-identification-president-donald-trump",
    "timestamp": "2025-09-19T16:12:14Z"
  },
  {
    "title": "AOC Chances of Winning in 2028 as Report Says She's Weighing Run",
    "description": "Progressive firebrand Alexandria Ocasio-Cortez has been floated as a potential Senate hopeful or even a White House contender.",
    "link": "https://www.newsweek.com/aoc-chances-winning-2028-2132622",
    "timestamp": "2025-09-19T16:10:21Z"
  },
  {
    "title": "Xi Happy on TikTok, But Keen to Avoid Restrictive Trade Moves",
    "description": "US President Donald Trump spoke with his Chinese counterpart Xi Jinping by phone, Chinese state media and a US official said late on Friday (Asia time).\nTrump was keen to finalise a framework agreement by trade officials of both countries in Madrid early this…",
    "link": "https://biztoc.com/x/848896c92acb9817",
    "timestamp": "2025-09-19T16:09:50Z"
  },
  {
    "title": "Pro-Trump Brian Glenn Cuts Off Maggie Haberman’s Brutal Grilling On Jailing Protesters In Air Force One Scrum",
    "description": "Trump used a phone-a-friend when Maggie Haberman was grilling him about trying to imprison protesters who yelled at him, tagging in Brian Glenn as he cut in.\nThe post Pro-Trump Brian Glenn Cuts Off Maggie Haberman’s Brutal Grilling On Jailing Protesters In Ai…",
    "link": "https://www.mediaite.com/media/news/pro-trump-brian-glenn-cuts-off-maggie-habermans-brutal-grilling-on-jailing-protesters-in-air-force-one-scrum/",
    "timestamp": "2025-09-19T16:09:45Z"
  },
  {
    "title": "Charlie Kirk day to be observed on October 14: Why America will celebrate the right-wing activist on this day",
    "description": "The US Senate passed a resolution to create a 'National Day of Remembrance for Charlie Kirk' on October 14, his birthday. Kirk, a conservative activist and ally of Donald Trump, was assassinated on September 10 in Utah. Republicans are rallying around Kirk's …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-charlie-kirk-day-to-be-observed-on-october-14-why-america-will-celebrate-the-right-wing-activist-on-this-day/articleshow/124001981.cms",
    "timestamp": "2025-09-19T16:08:42Z"
  },
  {
    "title": "Why Pulling an FCC License Doesn’t Mean What Trump Thinks It Means",
    "description": "Over the first eight months of this President's administration, especially over the last few weeks, there have been a number of threats by both the President and the FCC Commissioner Brendan Carr to yank the FCC licenses of certain networks...\nRead more...",
    "link": "https://www.pajiba.com/tv_reviews/why-pulling-an-fcc-license-doesnt-mean-what-trump-thinks-it-means.php",
    "timestamp": "2025-09-19T16:08:18Z"
  },
  {
    "title": "New Fed governor says was not told how to vote by Trump",
    "description": "Donald Trump’s pick to join the US Federal Reserve said Friday that he did not speak to the president about how to vote on interest rates ahead of the central bank’s meeting this week. In an interview with CNBC, Stephen Miran said that “the president called m…",
    "link": "https://www.digitaljournal.com/world/new-fed-governor-says-was-not-told-how-to-vote-by-trump/article",
    "timestamp": "2025-09-19T16:07:32Z"
  },
  {
    "title": "New Fed Governor Says Was Not Told How To Vote By Trump",
    "description": "Donald Trump's pick to join the US Federal Reserve said Friday that he did not speak to the president about how to vote on interest rates ahead of the central bank's meeting this week.",
    "link": "https://www.ibtimes.com/new-fed-governor-says-was-not-told-how-vote-trump-3783946",
    "timestamp": "2025-09-19T16:06:20Z"
  },
  {
    "title": "King Charles is ‘thrilled’ about the Trump visit & ‘very pleased with the global optics’",
    "description": "It’s interesting reading the differences between the British coverage and American coverage of the Trumps’ state visit to the UK. The British political media is mostly happy that it’s over and they seem unsettled by how the Windsors ingratiated themselves so …",
    "link": "https://www.celebitchy.com/941323/king_charles_is_thrilled_about_the_trump_visit_very_pleased_with_the_global_optics/",
    "timestamp": "2025-09-19T16:05:33Z"
  },
  {
    "title": "Trump Says China Gave ‘Approval’ For TikTok Deal",
    "description": "A deal is expected to include a controlling stake for billionaire Larry Ellison and Marc Andreessen’s capital venture firm.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/09/19/trump-says-china-gave-approval-for-tiktok-deal/",
    "timestamp": "2025-09-19T16:03:38Z"
  },
  {
    "title": "BREAKING: Trump Asks Supreme Court to Block Passport Gender Choice",
    "description": "Trump asked the Supreme Court to intervene in a passport ruling that lets transgender and nonbinary citizens select their gender identity.\nThe post BREAKING: Trump Asks Supreme Court to Block Passport Gender Choice first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/breaking-trump-asks-supreme-court-to-block-passport-gender-choice/",
    "timestamp": "2025-09-19T16:03:29Z"
  },
  {
    "title": "What is Antifa, the leftist movement Trump says he’s labeling ‘major terrorist organization’?",
    "description": "What is Antifa, the leftist movement Trump says he’s labeling ‘major terrorist organization’?wmur.com",
    "link": "https://www.wmur.com/article/what-is-antifa-terrorist-organization-plan/67962028",
    "timestamp": "2025-09-19T16:00:40Z"
  },
  {
    "title": "What is Antifa, the leftist movement Trump says he’s labeling ‘major terrorist organization’?",
    "description": "What is Antifa, the leftist movement Trump says he’s labeling ‘major terrorist organization’?wtae.com",
    "link": "https://www.wtae.com/article/what-is-antifa-terrorist-organization-plan/67962028",
    "timestamp": "2025-09-19T16:00:37Z"
  },
  {
    "title": "What is Antifa, the leftist movement Trump says he’s labeling ‘major terrorist organization’?",
    "description": "What is Antifa, the leftist movement Trump says he’s labeling ‘major terrorist organization’?wmtw.com",
    "link": "https://www.wmtw.com/article/what-is-antifa-terrorist-organization-plan/67962028",
    "timestamp": "2025-09-19T16:00:36Z"
  },
  {
    "title": "Donald Trump Says Charlie Kirk 'Might Now' Believe in Hate Speech",
    "description": "In an eyebrow-raising turn in an interview with Fox News Thursday, Donald Trump claimed Charlie Kirk might not be against the idea of \"hate speech\" following his murder. Check out the clip ... Martha MacCallum notes the late conservative activist…\n Permalink",
    "link": "https://www.tmz.com/2025/09/19/donald-trump-says-charlie-kirk-might-believe-in-hate-speech/",
    "timestamp": "2025-09-19T16:00:28Z"
  },
  {
    "title": "Jimmy Kimmel and the strongman’s fear of comedians",
    "description": "ABC's latest sacrifice to Trump comes straight out of a playbook followed by other authoritarian governments.",
    "link": "https://www.salon.com/2025/09/19/jimmy-kimmel-and-the-strongmans-fear-of-comedians/",
    "timestamp": "2025-09-19T16:00:13Z"
  },
  {
    "title": "CNN staffers panic ahead of possible Ellison acquisition...",
    "description": "CNN staffers are bracing for the Ellison family’s looming bid for Warner Bros. Discovery—a takeover that could merge the network with CBS News, hand Bari Weiss editorial power, and radically reshape its future.",
    "link": "https://www.status.news/p/cnn-david-ellison-paramount-warner-bros",
    "timestamp": "2025-09-19T16:00:04Z"
  },
  {
    "title": "NFL DOMINATES TV... | 13 of top 15 shows since season kick-off...",
    "description": "Each NFL game shown on TV or on streaming platforms has averaged 20.7 million viewers this season, the most through two weeks of a new campaign in league history",
    "link": "https://www.themirror.com/sport/american-football/nfl-viewership-record-chiefs-eagles-1398214",
    "timestamp": "2025-09-19T16:00:04Z"
  },
  {
    "title": "'Couple thousand in the bank'...",
    "description": "LeBron James, who is widely regarded as one of the greatest NBA players of all time, made a bombshell claim about his net worth during an interview",
    "link": "https://www.themirror.com/sport/basketball/lebron-james-net-worth-nba-1399960",
    "timestamp": "2025-09-19T16:00:04Z"
  },
  {
    "title": "Why Trump wants the U.S. to 'get back' the Bagram Airfield from the Taliban",
    "description": "President Donald Trump has said he hopes to see Bagram Airfield in Afghanistan returned to U.S. control, suggesting a renewed American presence in the country now again ruled by the Taliban.",
    "link": "https://www.nbcnews.com/world/afghanistan/trump-bagram-air-base-taliban-afghanistan-china-rcna232352",
    "timestamp": "2025-09-19T16:00:00Z"
  },
  {
    "title": "Charlie Kirk Project 2025 explained: How will it impact marriages, family planning in U.S.?",
    "description": "Charlie Kirk's message to young men stood out from those broadcast by other influential podcasters and social media personalities speaking to their demographic.",
    "link": "https://economictimes.indiatimes.com/news/international/us/charlie-kirk-project-2025-explained-how-will-it-impact-marriages-family-planning-in-u-s-/articleshow/124001904.cms",
    "timestamp": "2025-09-19T15:59:59Z"
  },
  {
    "title": "Oh Good, a Huge Trump Statue Went Up in D.C",
    "description": "Things lately have felt pretty weird, politically speaking, huh? Here’s something that will certainly not help: There’s a giant golden Donald Trump statue in front of our nation’s Capitol. But don’t worry, it wasn’t put there by a power-hungry president whose…",
    "link": "https://biztoc.com/x/83addf296def01a2",
    "timestamp": "2025-09-19T15:58:44Z"
  },
  {
    "title": "Trump Threatens Licenses of TV Stations That Criticize Him",
    "description": "President Donald Trump said US broadcast networks should face scrutiny over their licenses if they’re too critical of him, in what amounts to his furthest-reaching threat to media freedoms.\n“When you have a network and you have evening shows, and all they do …",
    "link": "https://biztoc.com/x/f20ebaff99e12426",
    "timestamp": "2025-09-19T15:58:35Z"
  },
  {
    "title": "Trump To Fire U.S. Atty Who Failed To Find Charges Against Letitia James",
    "description": "Orange Julius is expected to fire the U.S. attorney for the Eastern District of Virginia after his office was unable to find incriminating evidence of mortgage fraud against New York Attorney General Letitia James, according to sources. Well, that won't stop …",
    "link": "https://crooksandliars.com/2025/09/trump-fire-us-attorney-who-cant-find",
    "timestamp": "2025-09-19T15:58:32Z"
  },
  {
    "title": "US stock market today hits record after $15 trillion rally as Trump signals US-China trade deal: Dow, S&P 500, Nasdaq rise and Russell 2000 shines",
    "description": "US stock markets edged higher on Friday, with the Dow Jones Industrial Average, S&P 500, and Nasdaq extending their recent record-setting streaks. Investors focused on a high-profile call between President Donald Trump and Chinese President Xi Jinping, amid f…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-hits-record-after-15-trillion-rally-as-trump-signals-us-china-trade-deal-dow-sp-500-nasdaq-rise-and-russell-2000-shines/articleshow/124001583.cms",
    "timestamp": "2025-09-19T15:58:17Z"
  },
  {
    "title": "Assistant AG Gail Slater: MAGA Antitrust Enforcement Will Ensure Open Flow of Information, Bias-Free AI",
    "description": "Assistant Attorney General Gail Slater said during a speech on Thursday that America First Antitrust can be used to ensure free information flows in American democracy and that artificial intelligence (AI) remains free of viewpoint bias.\nThe post Assistant AG…",
    "link": "https://www.breitbart.com/politics/2025/09/19/assistant-ag-gail-slater-maga-antitrust-enforcement-will-ensure-open-flow-of-information-bias-free-ai/",
    "timestamp": "2025-09-19T15:57:15Z"
  },
  {
    "title": "Trump asks Supreme Court to halt order letting transgender people choose passport sex markers",
    "description": "The court order allows transgender or nonbinary people to request a male, female or “X.”",
    "link": "https://www.denverpost.com/2025/09/19/trump-supreme-court-transgender-passports/",
    "timestamp": "2025-09-19T15:56:55Z"
  },
  {
    "title": "Trump asks Supreme Court to halt order letting transgender people choose passport sex markers",
    "description": "The court order allows transgender or nonbinary people to request a male, female or “X.”",
    "link": "https://www.bostonherald.com/2025/09/19/trump-supreme-court-transgender-passports/",
    "timestamp": "2025-09-19T15:56:55Z"
  },
  {
    "title": "Dutch TV Host Pitches Trump-Inspired Twist on Old Disney Films in Wake of Jimmy Kimmel Suspension: ‘Hakuna MAGA-Ta!’",
    "description": "Dutch comedian and TV host Arjen Lubach has some ideas to pitch Disney in the wake of Jimmy Kimmel's ABC suspension — from far beyond the FCC's reach.\nThe post Dutch TV Host Pitches Trump-Inspired Twist on Old Disney Films in Wake of Jimmy Kimmel Suspension: …",
    "link": "https://www.mediaite.com/media/tv/dutch-tv-host-pitches-trump-inspired-twist-on-old-disney-films-in-wake-of-jimmy-kimmel-suspension-hakuna-maga-ta/",
    "timestamp": "2025-09-19T15:54:41Z"
  },
  {
    "title": "How Teachers Can Use AI to Create Assignments Students Actually Want to Do",
    "description": "And maybe you'll even have fun grading them.",
    "link": "https://www.cnet.com/tech/services-and-software/how-teachers-can-use-ai-to-create-assignments-students-actually-want-to-do/",
    "timestamp": "2025-09-19T15:54:03Z"
  },
  {
    "title": "I’m a Primary Care Doctor. My Patients Are Scared to Show Up Due to ICE.",
    "description": "How am I supposed to adequately care for patients who are being constantly terrorized by immigration police?",
    "link": "https://truthout.org/articles/im-a-primary-care-doctor-my-patients-are-scared-to-show-up-due-to-ice/",
    "timestamp": "2025-09-19T15:53:39Z"
  },
  {
    "title": "Behind closed doors, a majority of CEOs admit they won’t boost U.S. investment as tariffs hurt their businesses",
    "description": "During a gathering of top CEOs organized by the Yale School of Management, 62% said they don't plan to invest more in U.S. manufacturing and infrastructure.",
    "link": "https://fortune.com/2025/09/19/ceo-us-investment-manufacturing-infrastructure-trump-tariffs-immigration-crackdown/",
    "timestamp": "2025-09-19T15:53:37Z"
  }
]