[
  {
    "title": "Remember When Colbert Said Paying High Prices Under Biden Was Moral? We Do",
    "description": "Lame duck comedian Stephen Colbert went on a tirade against President Donald Trump’s tariffs and heralded the supposedly impending doom of skyrocketing prices, and ended up beclowning himself in the process.",
    "link": "https://newsbusters.org/blogs/business/joseph-vazquez/2025/08/09/remember-when-stephen-colbert-had-no-problem-paying-high",
    "timestamp": "2025-08-10T05:53:41Z"
  },
  {
    "title": "After busy first 100 days, Germany's Friedrich Merz faces discord at home",
    "description": "German Chancellor Friedrich Merz has driven sweeping changes in security, economic and migration policy during his first 100 days in office, but faces widening cracks in his uneasy coalition. German voters have not yet fallen in love with Merz either.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/after-busy-first-100-days-germanys-friedrich-merz-faces-discord-at-home/articleshow/123214489.cms",
    "timestamp": "2025-08-10T05:48:15Z"
  },
  {
    "title": "\"Palestine\" - a force multiplying hazard to Israel",
    "description": "A “Two-State Solution” would enlarge not “only” the jihadi terror threat to Israel (both conventional and unconventional), but also prospects for a catastrophic regional war. Opinion.",
    "link": "https://www.israelnationalnews.com/news/413013",
    "timestamp": "2025-08-10T05:34:50Z"
  },
  {
    "title": "China wants US to relax AI chip-export controls for trade deal",
    "description": "Successive US administrations have curbed exports of advanced chips to China, looking to stymie Beijing's AI and defence development",
    "link": "https://www.thehindubusinessline.com/news/world/china-wants-us-to-relax-ai-chip-export-controls-for-trade-deal/article69915927.ece",
    "timestamp": "2025-08-10T05:25:48Z"
  },
  {
    "title": "In a Trump-Putin summit, Ukraine fears losing say over its future",
    "description": "Donald Trump and Vladimir Putin are set to meet in Alaska. This meeting excludes Ukraine. It sparks worries about possible land concessions. Volodymyr Zelenskyy warns against deals made without Ukraine's involvement. Concerns arise over Trump's approach to Pu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/in-a-trump-putin-summit-ukraine-fears-losing-say-over-its-future/articleshow/123214327.cms",
    "timestamp": "2025-08-10T05:23:45Z"
  },
  {
    "title": "China wants US to relax AI chip-export controls for trade deal: FT reports",
    "description": "HBM chips, which help perform data-intensive AI tasks quickly, are closely watched by investors due to their use alongside AI graphic processors.",
    "link": "https://www.cnbc.com/2025/08/10/china-wants-us-to-relax-ai-chip-export-controls-for-trade-deal-ft-reports.html",
    "timestamp": "2025-08-10T05:15:52Z"
  },
  {
    "title": "Tesla’s $30bn message to Musk: never mind performance, just don’t leave",
    "description": "Will an extra wad persuade the world’s richest and arguably most distracted man to become, well, less distracted?",
    "link": "https://www.irishtimes.com/your-money/2025/08/10/teslas-30bn-message-to-musk-never-mind-performance-just-dont-leave/",
    "timestamp": "2025-08-10T05:15:00Z"
  },
  {
    "title": "Nextrush Unplugged Weekend*Protests In Israel Amid Gaza Conflict*'In The Beginning...\"*The J In Donald J Trump?*Flashback Tammy Bruce Update*Defamation And Enslavement Of Ammon Bundy*Turning The Table*",
    "description": "Newsdump Alerts: On Saturday night hundreds of Orthodox Jews protesting outside an Israeli military prison... In Israel Saturday night mass demonstrations against 'eternal war mongers'. Calls for soldiers to refuse orders... Hundreds arrested in London for vi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4333704/posts",
    "timestamp": "2025-08-10T05:14:23Z"
  },
  {
    "title": "Emma Thompson says Donald Trump 'stalked' her to pursue a 'nice divorcee' - The Mirror US",
    "description": "Emma Thompson says Donald Trump 'stalked' her to pursue a 'nice divorcee'The Mirror US Emma Thompson Says Donald Trump Asked Her Out on a DateVariety Emma Thompson Talks About Donald Trump's 1990s Dinner Invite, Evoking Sliding Doors PossibilitiesVanity Fair …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178630602",
    "timestamp": "2025-08-10T05:14:17Z"
  },
  {
    "title": "Trump’s pharma rant puts Government in difficult position",
    "description": "Threat of additional pharma tariffs just a week after 15% rates was agreed risk undermining support for EU trade deal",
    "link": "https://www.irishtimes.com/business/2025/08/10/trumps-pharma-rant-puts-government-in-difficult-position/",
    "timestamp": "2025-08-10T05:10:00Z"
  },
  {
    "title": "Russia and Ukraine hold fast to their demands ahead of a planned Putin-Trump summit",
    "description": "The threats, pressure and ultimatums have come and gone, but Russian President Vladimir Putin has maintained Moscow’s uncompromising demands in Ukraine, raising fears he could use a planned summit with U.S. President Donald Trump to coerce Kyiv into ac...",
    "link": "https://abcnews.go.com/US/wireStory/russia-ukraine-hold-fast-demands-ahead-planned-putin-124518902",
    "timestamp": "2025-08-10T05:02:15Z"
  },
  {
    "title": "Zelenskyy says no to peace deal without Ukraine’s participation",
    "description": "Kyiv, Aug 10: Ukrainian President Volodymyr Zelenskyy on Saturday dismissed suggestions that Kyiv could cede territory to end the war […]\nThe post Zelenskyy says no to peace deal without Ukraine’s participation appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/10/zelenskyy-says-no-to-peace-deal-without-ukraines-participation/",
    "timestamp": "2025-08-10T05:00:00Z"
  },
  {
    "title": "The rise and fall of Cairo, Illinois: from Huckleberry Finn’s dream destination to a town of just 1,700 people",
    "description": "The future was supposed to be bright for this fascinating place at the confluence of two mythic American rivers. It didn’t quite pan out that way",
    "link": "https://www.irishtimes.com/life-style/people/2025/08/09/the-fall-of-cairo-illinois-from-huckleberry-finns-dream-destination-to-a-town-of-just-1700-people/",
    "timestamp": "2025-08-10T05:00:00Z"
  },
  {
    "title": "Worldview: Trump seems determined to square the circle of making anti-science work, no matter what the cost",
    "description": "Firing of Bureau of Labor Statistics chief could fatally undermine trust in an organisation crucial to transparency of US markets",
    "link": "https://www.irishtimes.com/opinion/2025/08/10/trump-seems-determined-to-square-the-circle-of-making-anti-science-work-no-matter-what-the-cost/",
    "timestamp": "2025-08-10T04:55:00Z"
  },
  {
    "title": "George Will Reveals His Jaw-Dropping Take on NYC's Zohran Mamdani to Bill Maher: \"I want him to win\"",
    "description": "Once upon a time, George Will was a conservative. I'm not sure what he is anymore after his TDS drove him to vote for Joe Biden. Even if he didn't want to vote for Donald Trump, voting for Biden seems like a denial of everything he was before. It's certainly …",
    "link": "https://freerepublic.com/focus/f-news/4333702/posts",
    "timestamp": "2025-08-10T04:52:47Z"
  },
  {
    "title": "Volodymyr Zelensky vows Ukraine will not cede territory in effort to end Russian invasion",
    "description": "Ukrainian president Volodymyr ­Zelensky has said Kyiv won’t cede territory to bring an end to war, as European and American ­security advisers met in the UK in advance of a key US-Russia summit.",
    "link": "https://www.independent.ie/world-news/europe/volodymyr-zelensky-vows-ukraine-will-not-cede-territory-in-effort-to-end-russian-invasion/a981871411.html",
    "timestamp": "2025-08-10T04:30:00Z"
  },
  {
    "title": "The Sunday Independent’s View: Zelensky should be at the table for Ukraine peace talks",
    "description": "The horror unfolding in Gaza has inevitably driven other conflicts from the world’s sight. Ukraine, now into the fourth year of a brutal full-scale Russian invasion, is paying the steepest price.",
    "link": "https://www.independent.ie/opinion/editorial/the-sunday-independents-view-zelensky-should-be-at-the-table-for-ukraine-peace-talks/a2135666779.html",
    "timestamp": "2025-08-10T04:30:00Z"
  },
  {
    "title": "Donald Trump asked out this Oscar-winning actress the same day she ended her marriage",
    "description": "Emma Thompson revealed that Donald Trump called her after her divorce. He invited her to stay at his properties and have dinner. This happened while she was filming 'Primary Colors'. Trump had just divorced Marla Maples then. Thompson was finalizing her divor…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-asked-out-this-oscar-winning-actress-the-same-day-she-ended-her-marriage/articleshow/123213897.cms",
    "timestamp": "2025-08-10T04:23:58Z"
  },
  {
    "title": "Elon Musk's Favorability Rating Among Americans Has Tanked Since January",
    "description": "Elon Musk finished dead last in favorability in a recent Gallup poll asking Americans to assess 14 world figures.\nWhat Happened: Musk’s approval ratings have taken a nosedive following his contentious tenure at the White House and the ensuing fallout with Pre…",
    "link": "https://biztoc.com/x/4a817d506f418458",
    "timestamp": "2025-08-10T04:23:27Z"
  },
  {
    "title": "Europe allies say Ukraine peace talks must include Kyiv",
    "description": "Agreements without Kyiv will be \"dead decisions\", Zelensky insists, as the White House says Trump is open to the Ukrainian president joining peace talks on Friday.",
    "link": "https://www.bbc.com/news/articles/c0e9py7e28xo",
    "timestamp": "2025-08-10T04:20:34Z"
  },
  {
    "title": "China wants US to relax chip-export controls as part of trade deal, FT reports",
    "description": "China wants the United States to ease export controls on chips critical for artificial intelligence as part of a trade deal before a possible summit between ...",
    "link": "https://finance.yahoo.com/news/china-wants-us-relax-chip-041557426.html",
    "timestamp": "2025-08-10T04:15:57Z"
  },
  {
    "title": "China wants US to relax chip-export controls as part of trade deal: report",
    "description": "China wants the United States to ease export controls on a critical component for artificial intelligence chips as part of a trade deal ahead of a possible summit between U.S. President Donald Trump and Chinese President Xi Jinping, as per reports",
    "link": "https://economictimes.indiatimes.com/news/international/business/china-wants-us-to-relax-chip-export-controls-as-part-of-trade-deal-report/articleshow/123213826.cms",
    "timestamp": "2025-08-10T04:14:15Z"
  },
  {
    "title": "Israel Secretly Recruited Iranian Dissidents to Attack Their Country From Within",
    "description": "By Yossi Melman and Dan Raviv for ProPublica | - ( ProPublica ) - In the early morning hours of June 13, a commando team led by a young Iranian, S.T., settled into position on the outskirts of Tehran. The target was an anti-aircraft battery, part of the umbre…",
    "link": "https://www.juancole.com/2025/08/secretly-recruited-dissidents.html",
    "timestamp": "2025-08-10T04:06:12Z"
  },
  {
    "title": "Romance and Heartache in Washington, DC",
    "description": "A neglected film captures the cozy charms of a city better known for crime and political machinations.\nThe post Romance and Heartache in Washington, DC appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/romance-and-heartache-in-washington-dc/",
    "timestamp": "2025-08-10T04:03:00Z"
  },
  {
    "title": "The FBI covered for Tim Walz and China",
    "description": "Throughout the 2024 campaign, I often wrote about the deep connections to the Chinese Communist Party--CCP-- of Minnesota Governor Tim Walz. In April of 2025 I wrote Tim Walz: helping China colonize Minnesota? That article was about a long estab...",
    "link": "https://www.americanthinker.com/blog/2025/08/the_fbi_covered_for_tim_walz_and_china.html",
    "timestamp": "2025-08-10T04:00:00Z"
  },
  {
    "title": "Understanding the sheer scale of the Democrat effort to destroy Trump via debanking",
    "description": "In the West, we keep our money in banks, not under mattresses or wall safes. Banks are safe and convenient, and they pay us interest on the money we store with them, because they then lend that money out and make a profit by charging interest to borr...",
    "link": "https://www.americanthinker.com/blog/2025/08/understanding_the_sheer_scale_of_the_democrat_effort_to_destroy_trump_via_debanking.html",
    "timestamp": "2025-08-10T04:00:00Z"
  },
  {
    "title": "In his California redistricting scheme, Gavin Newsom may be in for a surprise",
    "description": "California's governor, Gavin Newsom, fancies himself the white knight in the Texas redistricting melodrama, having just the answer to Texas's plan to redistrict in a way that would create five presumably safe new seats for congressional Repub...",
    "link": "https://www.americanthinker.com/blog/2025/08/in_his_california_redistricting_scheme_gavin_newsom_may_be_in_for_a_surprise.html",
    "timestamp": "2025-08-10T04:00:00Z"
  },
  {
    "title": "How Comey Became Obama’s Gatekeeper in the Russian Collusion Hoax",
    "description": "Photo Credit:official governmement portrait of james comey with an american flag\n \n FBI.govIn the summer of 2016, James Comey positioned himself at the center of a coordinated effort by the Obama administration to control the Russia narrative, bypassing norma…",
    "link": "https://www.americanthinker.com/articles/2025/08/how_comey_became_obama_s_gatekeeper_in_the_russian_collusion_hoax.html",
    "timestamp": "2025-08-10T04:00:00Z"
  },
  {
    "title": "Zelensky rejects Trump's \"territory swap\" idea, vows no concessions to Russia",
    "description": "The Ukrainian leader accused Russian President Vladimir Putin of seeking to exchange a \"pause in war\" for the \"legalization of occupation of our land\"",
    "link": "https://www.thehindubusinessline.com/news/world/zelensky-rejects-trumps-territory-swap-idea-vows-no-concessions-to-russia/article69915829.ece",
    "timestamp": "2025-08-10T03:56:39Z"
  },
  {
    "title": "Europe stresses Ukraine support ahead of Trump-Putin summit",
    "description": "The path to peace in Ukraine “cannot be decided without Ukraine”, European leaders have said, as US President Donald Trump prepares to meet Russian President Vladimir Putin for talks on Friday. In a joint statement, Prime Minister Sir Keir Starmer, with the l…",
    "link": "https://freerepublic.com/focus/f-news/4333698/posts",
    "timestamp": "2025-08-10T03:54:37Z"
  },
  {
    "title": "Kristi Noem Reacts to 'South Park' Episode Portrayal of Her, Calls It 'Lazy to Constantly Make Fun of Women' For Looks",
    "description": "Kristi Noem is speaking out about how she was recently portrayed on South Park! The 53-year-old Secretary of Homeland Security was a main focus on the Comedy Central animated series’ latest episode and she revealed she has yet to actually watch the episode. H…",
    "link": "https://www.justjared.com/2025/08/09/kristi-noem-reacts-to-south-park-episode-portrayal-of-her-calls-it-lazy-to-constantly-make-fun-of-women-for-looks/",
    "timestamp": "2025-08-10T03:50:46Z"
  },
  {
    "title": "‘No second partition’: Zelensky rejects land swaps ahead of Trump-Putin Alaska summit",
    "description": "Ukrainian President Volodymyr Zelensky has firmly rejected any proposal that would trade territory for peace, days before US President Donald Trump meets Russian President Vladimir Putin in Alaska. Zelensky accused Putin of trying to “legalise the occupation”…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/no-second-partition-zelensky-rejects-land-swaps-ahead-of-trump-putin-alaska-summit/articleshow/123213650.cms",
    "timestamp": "2025-08-10T03:48:02Z"
  },
  {
    "title": "Zelenskiy Rejects Ceding Land As European Leaders Back Ukraine",
    "description": "President Volodymyr Zelenskiy said Kyiv won’t cede territory to end the war with Russia as European leaders pledged their continued support for Ukraine’s sovereignty.  “We remain committed to the principle that international borders must not be changed by for…",
    "link": "https://www.ndtvprofit.com/world/zelenskiy-rejects-ceding-land-as-european-leaders-back-ukraine",
    "timestamp": "2025-08-10T03:46:37Z"
  },
  {
    "title": "Eleven more malnutrition deaths reported in Gaza amid rising conflict",
    "description": "GAZA: The Hamas-run health ministry in Gaza has reported 11 additional deaths caused by malnutrition, bringing the total number of such fatalities to 212, including 98 children. Over the past 24 hours, Israeli military actions have resulted in at least 38 dea…",
    "link": "https://english.khabarhub.com/2025/10/490060/",
    "timestamp": "2025-08-10T03:45:28Z"
  },
  {
    "title": "Republicans revive ‘they/them’ attack ads on Kamala Harris for 2026 midterm elections",
    "description": "In 2024, Donald Trump’s campaign used the slogan to ridicule then–Vice President Kamala Harris for previously backing policies that provided gender-transition-related healthcare to detained immigrants.",
    "link": "https://indianexpress.com/article/world/republicans-they-them-attack-ads-kamala-harris-2026-midterms-10180450/",
    "timestamp": "2025-08-10T03:44:48Z"
  },
  {
    "title": "White House considering inviting Zelenskiy to Alaska, NBC News reports",
    "description": "The White House is considering inviting Ukrainian President Volodymyr Zelenskiy to Alaska, where President Donald Trump is scheduled to meet Russian President Vladimir Putin on August 15, NBC News reported on Saturday. The report cited a senior U.S. official …",
    "link": "https://freerepublic.com/focus/f-news/4333697/posts",
    "timestamp": "2025-08-10T03:41:38Z"
  },
  {
    "title": "Trump open to Alaska summit with Putin and Zelenskiy: White House",
    "description": "US President Donald Trump is weighing the possibility of hosting Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy for a summit in Alaska next week. While a bilateral meeting with Putin on 15 August is confirmed, the inclusion of Ze…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-open-to-alaska-summit-with-putin-and-zelenskiy-white-house/articleshow/123213517.cms",
    "timestamp": "2025-08-10T03:26:14Z"
  },
  {
    "title": "Confederate statues in DC area to be restored and replaced",
    "description": "One statue was pulled down with ropes and chains on Juneteenth in 2020 as part of mass protests following the death of George Floyd at the hands of Minneapolis police.",
    "link": "https://www.ketv.com/article/confederate-statues-in-dc-area-to-be-restored/65645547",
    "timestamp": "2025-08-10T03:21:31Z"
  },
  {
    "title": "Confederate statues in DC area to be restored and replaced",
    "description": "One statue was pulled down with ropes and chains on Juneteenth in 2020 as part of mass protests following the death of George Floyd at the hands of Minneapolis police.",
    "link": "https://www.wgal.com/article/confederate-statues-in-dc-area-to-be-restored/65645547",
    "timestamp": "2025-08-10T03:21:30Z"
  },
  {
    "title": "AI isn't the only culprit: GCCs in the spotlight in India's IT layoff story",
    "description": "Vishal Sikka's early bet on global capability centers (GCCs) is now a reality as more companies insource tech operations in India. This shift challenges Indian IT giants, facing talent and business losses. While offering GCC-as-a-service, they navigate AI cha…",
    "link": "https://economictimes.indiatimes.com/jobs/hr-policies-trends/ai-isnt-the-only-culprit-gccs-in-the-spotlight-in-indias-it-layoff-story/articleshow/123213190.cms",
    "timestamp": "2025-08-10T03:19:07Z"
  },
  {
    "title": "As it happened: Trump hosts Azerbaijan and Armenia leaders at White House to sign peace deal - Reuters",
    "description": "As it happened: Trump hosts Azerbaijan and Armenia leaders at White House to sign peace dealReuters Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace dealReuters President Trump Brokers Another Historic Peace DealThe White House (.go…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178629988",
    "timestamp": "2025-08-10T03:12:19Z"
  },
  {
    "title": "Armenians Caught Between Hope And Distrust After Accord With Azerbaijan",
    "description": "The streets were almost deserted in Yerevan Saturday because of the summer heat, but at shaded parks and fountains, Armenians struggled to make sense of what the accord signed a day earlier in Washington means for them.",
    "link": "https://www.ibtimes.com/armenians-caught-between-hope-distrust-after-accord-azerbaijan-3780590",
    "timestamp": "2025-08-10T03:03:15Z"
  },
  {
    "title": "Trump, Putin to meet in Alaska next Friday",
    "description": "Kathmandu, August 10: US President Donald Trump and Russian President Vladimir Putin will meet in Alaska next Friday to discuss […]\nThe post Trump, Putin to meet in Alaska next Friday appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/10/trump-putin-to-meet-in-alaska-next-friday/",
    "timestamp": "2025-08-10T03:00:25Z"
  },
  {
    "title": "Defense to take top billing at U.S.-South Korea summit as Trump eyes alliance reset",
    "description": "With China looming large, security ties will take center stage at the first summit between U.S. President Donald Trump and South Korean leader Lee Jae Myung.",
    "link": "https://www.japantimes.co.jp/news/2025/08/10/asia-pacific/politics/south-korea-us-trump-lee-summit-preview/",
    "timestamp": "2025-08-10T03:00:00Z"
  },
  {
    "title": "CDC shooter believed COVID vaccine made him suicidal, his father tells police",
    "description": "A Georgia man, Patrick Joseph White, opened fire at the CDC headquarters, killing a police officer, David Rose. White's father reported his son was fixated on the COVID-19 vaccine, believing it caused depression and suicidal thoughts. The shooting prompted a …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/cdc-shooter-believed-covid-vaccine-made-him-suicidal-his-father-tells-police/articleshow/123213331.cms",
    "timestamp": "2025-08-10T02:47:14Z"
  },
  {
    "title": "White House hasn’t ruled out Zelensky being in Alaska during Trump-Putin meeting on Friday - CNN",
    "description": "White House hasn’t ruled out Zelensky being in Alaska during Trump-Putin meeting on FridayCNN White House is considering inviting Zelenskyy to AlaskaNBC News Putin Tells U.S. He’ll Halt War in Exchange for Eastern Ukraine - WSJThe Wall Street Journal Instead …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178629776",
    "timestamp": "2025-08-10T02:33:21Z"
  },
  {
    "title": "Trump seems to confirm 2025 timing for Fannie, Freddie IPO",
    "description": "On Saturday, President Donald Trump seemed to acknowledge reporting by The Wall Street Journal on Friday that he plans to IPO Fannie Mae and Freddie Mac by the end of this year. Trump posted an AI image on Truth Social of him at the New York Stock Exchange wi…",
    "link": "https://biztoc.com/x/1b0e01e2cf732232",
    "timestamp": "2025-08-10T02:31:32Z"
  },
  {
    "title": "11 Years After Invasion, Thousands of Yazidi Women and Kids Are Still Missing",
    "description": "As global attention shifts and international aid disappears, many survivors of the ISIS assault feel forgotten.",
    "link": "https://therealnews.com/the-search-for-the-missing-yazidi",
    "timestamp": "2025-08-10T02:19:13Z"
  },
  {
    "title": "Joint leaders’ statement on Peace for Ukraine",
    "description": "We welcome President Trump’s work to stop the killing in Ukraine, end the Russian Federation’s war of aggression, and achieve just and lasting peace and security for Ukraine. We are convinced that only an approach that combines active diplomacy, support to Uk…",
    "link": "https://freerepublic.com/focus/f-chat/4333687/posts",
    "timestamp": "2025-08-10T02:18:13Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,263",
    "description": "Here are the key events on day 1,263 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/8/10/russia-ukraine-war-list-of-key-events-day-1263",
    "timestamp": "2025-08-10T02:14:45Z"
  },
  {
    "title": "White House hasn’t ruled out Zelensky being in Alaska during Trump-Putin meeting on Friday | CNN Politics",
    "description": "A diplomatic scramble unfolded Saturday after President Donald Trump announced he would meet his Russian counterpart, Vladimir Putin, next week in Alaska, as European leaders rushed to understand the terms of the meeting and ensure Ukraine was not being left …",
    "link": "https://www.cnn.com/2025/08/09/politics/white-house-zelensky-trump-putin-meeting",
    "timestamp": "2025-08-10T02:13:27Z"
  },
  {
    "title": "Trump endorses Lindsey Graham for 2026 Senate race during surprise call",
    "description": "Donald Trump surprised Senator Lindsey Graham with a phone call during a public gathering, offering his \"full endorsement\" for Graham's 2026 re-election bid in South Carolina. Graham, seeking a fifth term, expressed gratitude and pledged to continue deliverin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-endorses-lindsey-graham-for-2026-senate-race-during-surprise-call/articleshow/123213161.cms",
    "timestamp": "2025-08-10T02:07:47Z"
  },
  {
    "title": "Indian envoy discusses energy security with US Senator Lindsey Graham amid tensions over Russian oil imports",
    "description": "India's Ambassador Vinay Mohan Kwatra discussed energy security with US Senator Lindsey Graham, highlighting growing energy trade. This followed Graham's call for India to use its influence with Russia to help end the Ukraine war, amidst rising trade tensions…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indian-envoy-discusses-energy-security-with-us-senator-lindsey-graham-amid-tensions-over-russian-oil-imports/articleshow/123213154.cms",
    "timestamp": "2025-08-10T02:05:55Z"
  },
  {
    "title": "White House crypto adviser Bo Hines announces departure",
    "description": "Bo Hines, head of Trump’s Council of Advisers on Digital Assets, is leaving for the private sector after leading efforts to shape US crypto policy. He championed the GENIUS Act, establishing rules for stablecoins.",
    "link": "https://economictimes.indiatimes.com/tech/technology/white-house-crypto-adviser-bo-hines-announces-departure/articleshow/123213125.cms",
    "timestamp": "2025-08-10T02:00:27Z"
  },
  {
    "title": "Did Trump's mom once call him an 'idiot' who would be 'disaster' in politics?",
    "description": "Many internet users shared a fake image of a newspaper clipping featuring the quote.",
    "link": "https://www.snopes.com//news/2025/08/10/trump-mom-disaster-idiot/",
    "timestamp": "2025-08-10T02:00:00Z"
  },
  {
    "title": "Inside Track: Wheeling in Circles",
    "description": "At the start of 2025 we were led to believe that we were Donald Trump’s special friend and that India would probably be the first to conclude a trade tariff agreement with the US. Now we are not just back of the queue, but could be blackballed!",
    "link": "https://indianexpress.com/article/opinion/columns/inside-track-wheeling-in-circles-10180309/",
    "timestamp": "2025-08-10T01:54:18Z"
  },
  {
    "title": "Americans, Canadians meet at International Peace Garden for 'handshake across the border'",
    "description": "While tensions remain high between Ottawa and the White House, more than a hundred Canadians and Americans came together on Saturday to shake hands and reconnect as neighbours and friends.",
    "link": "https://www.cbc.ca/news/canada/manitoba/america-canada-border-1.7605346",
    "timestamp": "2025-08-10T01:53:17Z"
  },
  {
    "title": "John Leguizamo Weighs In on Former 'Superman' Star Dean Cain Joining ICE",
    "description": "John Leguizamo condemned former Lois & Clark: The New Adventures of Superman star Dean Cain for volunteering to join the United States’ Immigration and Customs Enforcement (I.C.E.) department. “What kind of loser volunteers to be an ICE officer?” the Encanto …",
    "link": "https://www.usmagazine.com/celebrity-news/news/john-leguizamo-slams-dean-cain-for-volunteering-with-ice/#article",
    "timestamp": "2025-08-10T01:48:39Z"
  },
  {
    "title": "Trump taps Tammy Bruce for senior UN post",
    "description": "President Trump nominates State Department spokesperson Tammy Bruce as US Deputy Representative to the UN. A longtime TV commentator and author, Bruce is set to bring her media and political experience to the role, pending Senate confirmation.",
    "link": "https://www.israelnationalnews.com/news/413004",
    "timestamp": "2025-08-10T01:46:04Z"
  },
  {
    "title": "European leaders urge more 'pressure' on Russia ahead of Trump-Putin summit",
    "description": "European leaders are pressing for increased pressure on Russia following the announcement of a Trump-Putin summit aimed at resolving the Ukraine conflict. Concerns are rising that any agreement might involve Ukraine ceding territory, a prospect President Zele…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/european-leaders-urge-more-pressure-on-russia-ahead-of-trump-putin-summit/articleshow/123213066.cms",
    "timestamp": "2025-08-10T01:42:55Z"
  },
  {
    "title": "‘I’m Actually Surprised It Didn’t Happen Sooner’",
    "description": "CDC staffers saw the violence coming.",
    "link": "https://www.theatlantic.com/health/archive/2025/08/cdc-shooting-trump-kennedy/683814/",
    "timestamp": "2025-08-10T01:42:25Z"
  },
  {
    "title": "Late Parasite actor Lee Sun Kyun’s wife, Jeon Hye Jin shares rare update on life after comeback",
    "description": "Nearly two years after Lee Sun Kyun’s death, wife Jeon Hye Jin returns to the spotlight, surprising fans at a birthday event in Seoul following her acting comeback earlier this year.",
    "link": "https://indianexpress.com/article/entertainment/korean/late-parasite-actor-lee-sun-kyuns-wife-jeon-hye-jin-shares-rare-update-on-life-after-comeback-10180389/",
    "timestamp": "2025-08-10T01:42:01Z"
  },
  {
    "title": "Scenic road trips across the US for breathtaking views and memorable adventures",
    "description": "These scenic road trips across America offer volcanoes, national parks, oceans, lakes, historic towns, and wildlife views, all perfect alternatives to summer air travel. From the Florida Keys to Wyoming’s Wind River loop, these eight routes deliver natural va…",
    "link": "https://economictimes.indiatimes.com/news/international/us/scenic-road-trips-across-the-us-for-breathtaking-views-and-memorable-adventures/articleshow/123212976.cms",
    "timestamp": "2025-08-10T01:38:02Z"
  },
  {
    "title": "Intel CEO responds after Trump calls for his resignation",
    "description": "Intel CEO responds after Trump calls for his resignation\nIntel CEO Lip-Bu Tan says he’s “always operated within the highest legal and ethical standards” after President Donald Trump said he should resign.\nOn Thursday Trump said on Truth Social platform that, …",
    "link": "https://biztoc.com/x/da5571a4ab216f1d",
    "timestamp": "2025-08-10T01:36:05Z"
  },
  {
    "title": "Instead of sanctions, Donald Trump announces a summit with Russia - The Economist",
    "description": "Instead of sanctions, Donald Trump announces a summit with RussiaThe Economist Trump-Putin summit in Alaska resembles a slow defeat for UkraineCNN White House is considering inviting Zelenskyy to AlaskaNBC News Putin Tells U.S. He’ll Halt War in Exchange for …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178629412",
    "timestamp": "2025-08-10T01:35:23Z"
  },
  {
    "title": "Trump's tech shift opens the way for India to do a UPI on AI",
    "description": "The US has shifted its AI strategy towards rapid innovation, prioritizing economic and geopolitical dominance over ethical concerns. This move, driven by Executive Orders, sparks debate about potential societal risks and regulatory gaps. As the US accelerates…",
    "link": "https://economictimes.indiatimes.com/industry/banking/finance/banking/trumps-tech-shift-opens-the-way-for-india-to-do-a-upi-on-ai/articleshow/123212968.cms",
    "timestamp": "2025-08-10T01:32:26Z"
  },
  {
    "title": "Inside the enormous Biden effort to ‘debank’ Trump after Jan. 6",
    "description": "The scale of the effort to “debank” Donald Trump because of pressure from Biden administration regulators went far beyond JPMorgan and Bank of America, The Post has learned.",
    "link": "https://nypost.com/2025/08/09/business/gasparino-inside-the-enormous-biden-effort-to-debank-trump-after-jan-6/",
    "timestamp": "2025-08-10T01:30:18Z"
  },
  {
    "title": "Kristi Noem's DHS Delaying Millions In Already Approved Recovery Funds For N.C.",
    "description": "Then candidate Donald Trump wrongly blasted President Joe Biden over the recovery efforts in North Carolina after Hurricane Helene hit. Trump propagated misinformation on his Truth Social account and even flew down here for a shameless photo-op. Unsurprisingl…",
    "link": "https://crooksandliars.com/2025/08/kristi-noems-dhs-delaying-millions-already",
    "timestamp": "2025-08-10T01:30:01Z"
  },
  {
    "title": "'He never left Gaza in his mind': Israeli soldier died by suicide after being ordered to return",
    "description": "Eliran's mother told Sky News her son returned from Gaza a changed man and she fears there will be many more suicides among Israeli soldiers.",
    "link": "https://news.sky.com/story/he-never-left-gaza-in-his-mind-israeli-soldier-died-by-suicide-after-being-ordered-to-return-13409097",
    "timestamp": "2025-08-10T01:27:00Z"
  },
  {
    "title": "U.S. and Japan working to announce tariffs won’t stack",
    "description": "The United States is working to finalize an announcement that would end the stacking of universal tariffs on Japanese goods.",
    "link": "https://www.japantimes.co.jp/business/2025/08/10/economy/japan-us-to-announce-revised-tariff-deal/",
    "timestamp": "2025-08-10T01:26:00Z"
  },
  {
    "title": "White House considers inviting Zelenskyy to high-stakes Trump-Putin summit",
    "description": "The White House is considering inviting Ukrainian President Volodymyr Zelenskyy to Alaska, where President Donald Trump is scheduled to meet with Russian leader Vladimir Putin next week, according to a senior U.S. official and three people briefed on the inte…",
    "link": "https://biztoc.com/x/061545e3948c695b",
    "timestamp": "2025-08-10T01:13:27Z"
  },
  {
    "title": "Thousands rally in Tel Aviv against Netanyahu’s new Gaza plan",
    "description": "A day earlier, Israeli officials had decided to seize Gaza City, expanding military operations in the devastated Palestinian territory.",
    "link": "https://www.japantimes.co.jp/news/2025/08/10/world/tel-aviv-protest-netanyahu/",
    "timestamp": "2025-08-10T01:13:00Z"
  },
  {
    "title": "How Canadian wildfire smoke is jeopardizing health across North America",
    "description": "Canadian provinces have evacuated towns and struggled to contain the second-worst wildfire season in 30 years.",
    "link": "https://www.japantimes.co.jp/environment/2025/08/10/north-america-wildfires-health-impact/",
    "timestamp": "2025-08-10T01:06:00Z"
  },
  {
    "title": "Trilateral U.S., U.K. and Ukrainian meeting weighs possible peace",
    "description": "U.K. Foreign Secretary David Lammy and U.S. Vice President JD Vance met with Ukrainian officials to discuss ending the war started by Russia three years ago.",
    "link": "https://www.upi.com/Top_News/World-News/2025/08/09/uk-vance-lammy-ukraine-meeting/1721754786409/",
    "timestamp": "2025-08-10T01:04:21Z"
  },
  {
    "title": "Trump accuses Pelosi of having 'INSIDER INFORMATION'",
    "description": "United States President Donald Trump accused Speaker of the US House of Representatives Nancy Pelosi of having \"inside information\" and calling her a \"disgusting degenerate.\"In a post on Truth Social,...",
    "link": "https://biztoc.com/x/6f81ea8fcee3d36e",
    "timestamp": "2025-08-10T01:02:30Z"
  },
  {
    "title": "CDC shooter believed COVID vaccine made him suicidal, his father tells police",
    "description": "A law enforcement official tells The Associated Press that a Georgia man who opened fire Friday on the U.S. Centers for Disease Control and Prevention headquarters in Atlanta had blamed the COVID-19 vaccine for making him depressed and suicidal",
    "link": "https://abcnews.go.com/Technology/wireStory/cdc-shooter-believed-covid-vaccine-made-suicidal-father-124514352",
    "timestamp": "2025-08-10T01:02:24Z"
  },
  {
    "title": "Trump, Putin agree to meet in Alaska; Zelensky might, too",
    "description": "President Donald Trump and Russian President Vladimir Putin agreed to meet Friday in Alaska and might invite Ukrainian President Volodymyr Zelensky, too.",
    "link": "https://www.upi.com/Top_News/World-News/2025/08/09/Trump-Putin-agreed-meet-in-Alaska/3391754744708/",
    "timestamp": "2025-08-10T01:01:27Z"
  },
  {
    "title": "Jimmy Kimmel Blames ‘Repulsive’ Liberal Activists For Trump’s Return to Power (VIDEO)",
    "description": "Late-night comedian Jimmy Kimmel has blamed “repulsive” liberal activists for enabling President Donald Trump’s return to power.\nThe post Jimmy Kimmel Blames ‘Repulsive’ Liberal Activists For Trump’s Return to Power (VIDEO) appeared first on The Gateway Pundi…",
    "link": "https://www.thegatewaypundit.com/2025/08/jimmy-kimmel-blames-repulsive-liberal-activists-trumps-return/",
    "timestamp": "2025-08-10T01:00:45Z"
  },
  {
    "title": "\"People importing from Russia are objecting to us for importing from Russia,\" says Venkaiah Naidu on US tariffs",
    "description": "Former Vice President Venkaiah Naidu criticized the United States' objections to India's oil imports from Russia, asserting that India will prioritize its national interests in making such decisions. He emphasized that India will not yield to external pressur…",
    "link": "https://economictimes.indiatimes.com/news/india/people-importing-from-russia-are-objecting-to-us-for-importing-from-russia-says-venkaiah-naidu-on-us-tariffs/articleshow/123212854.cms",
    "timestamp": "2025-08-10T00:55:02Z"
  },
  {
    "title": "Emma Thompson Says Donald Trump Asked Her on a Date the Same Day She Got Divorced: 'I Thought It Was a Joke' - AOL.com",
    "description": "Emma Thompson Says Donald Trump Asked Her on a Date the Same Day She Got Divorced: 'I Thought It Was a Joke'AOL.com View Full Coverage on Google News ...",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178629154",
    "timestamp": "2025-08-10T00:52:29Z"
  },
  {
    "title": "Whitmer Told Trump In Private That Michigan Auto Jobs Depend On A Tariff Change Of Course",
    "description": "Michigan's governor met privately with President Donald Trump to urge him to change course on tariffs that are having a big impact on automakers in her state.",
    "link": "https://www.huffpost.com/entry/trump-whitmer-tariffs_n_6897eafce4b05bc4a489f1a7",
    "timestamp": "2025-08-10T00:51:11Z"
  },
  {
    "title": "Trump Accuses Pelosis of Insider Trading After Beating 'Every Hedge Fund' in 2024",
    "description": "President Donald Trump accused former House Speaker Nancy Pelosi (D-CA) and her husband, Paul, of insider trading after they \"beat every Hedge Fund in 2024.\"\nThe post Trump Accuses Pelosis of Insider Trading After Beating ‘Every Hedge Fund’ in 2024 appeared f…",
    "link": "https://www.breitbart.com/politics/2025/08/09/trump-accuses-pelosis-of-insider-trading-after-beating-every-hedge-fund-in-2024/",
    "timestamp": "2025-08-10T00:49:39Z"
  },
  {
    "title": "How Kentucky bourbon went from boom to bust",
    "description": "Tariffs, oversupply and teetotaling Gen-Zs have all contributed to the downfall of one of America's most iconic liquors.",
    "link": "https://www.bbc.com/news/articles/ckglnk6yxlko",
    "timestamp": "2025-08-10T00:41:44Z"
  },
  {
    "title": "How Kentucky bourbon went from boom to bust",
    "description": "Tariffs, oversupply and teetotaling Gen-Zs have all contributed to the downfall of one of America's most iconic liquors.",
    "link": "https://www.bbc.co.uk/news/articles/ckglnk6yxlko",
    "timestamp": "2025-08-10T00:41:44Z"
  },
  {
    "title": "EU leaders urge more 'pressure' on Russia ahead of talks",
    "description": "European leaders welcomed US President Donald Trump's plans to meet with Russian President Vladimir Putin on ending the war in Ukraine, while stressing the need to keep pressure on Russia and protect Ukrainian and European security interests.",
    "link": "https://www.rte.ie/news/world/2025/0810/1527721-ukraine-russia/",
    "timestamp": "2025-08-10T00:38:57Z"
  },
  {
    "title": "Marlow: The Lawfare Investigations Have Begun; Here’s Who the DOJ Should Investigate Next",
    "description": "Over the past year, I have investigated all of the six major cases against Donald Trump that played out simultaneously between his two administrations for my book \"Breaking the Law.\" Each one of them involves obvious improprieties that necessitate investigati…",
    "link": "https://www.breitbart.com/politics/2025/08/09/marlow-the-lawfare-investigations-have-begun-heres-who-the-doj-should-investigate-next/",
    "timestamp": "2025-08-10T00:36:19Z"
  },
  {
    "title": "Iran Won’t Allow Trump-Backed Azerbaijan Corridor, Top Aide Says - Bloomberg.com",
    "description": "Iran Won’t Allow Trump-Backed Azerbaijan Corridor, Top Aide SaysBloomberg.com President Trump Brokers Another Historic Peace DealThe White House (.gov) Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace dealReuters Donald Trump broker…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178629052",
    "timestamp": "2025-08-10T00:35:12Z"
  },
  {
    "title": "Zelenskyy rejects formally ceding Ukrainian territory, says Kyiv must be part of any negotiations",
    "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy on Saturday rejected the idea that his country would give up land to end the war with<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/zelenskyy-rejects-formally-ceding-ukrainian-territory-sa…",
    "link": "https://whdh.com/news/zelenskyy-rejects-formally-ceding-ukrainian-territory-says-kyiv-must-be-part-of-any-negotiations/",
    "timestamp": "2025-08-10T00:34:53Z"
  },
  {
    "title": "Zelenskyy rejects ceding land as European leaders back Ukraine",
    "description": "Zelenskyy’s comments were his first response to news of a planned meeting between U.S. President Donald Trump and Russian President Vladimir Putin.",
    "link": "https://www.japantimes.co.jp/news/2025/08/10/world/zelenskyy-ukraine-territory/",
    "timestamp": "2025-08-10T00:31:00Z"
  },
  {
    "title": "Crude awakening for Nayara as geopolitics sounds alarm; symbol of Indo-Russian ties hit hard by West penalty",
    "description": "Nayara Energy, once a symbol of India-Russia cooperation, faces significant challenges due to sanctions and global disruptions following the Ukraine invasion. These hurdles impact its exports, finances, and expansion plans, forcing a shift towards domestic ma…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/crude-awakening-for-nayara-as-geopolitics-sounds-alarm-symbol-of-indo-russian-ties-hit-hard-by-west-penalty/articleshow/123209305.cms",
    "timestamp": "2025-08-10T00:30:00Z"
  },
  {
    "title": "A top Federal Reserve official says dour jobs data backs the case for 3 rate cuts",
    "description": "A top official at the Federal Reserve is saying that this month’s stunning, weaker-than-expected report on the U.S. job market is strengthening her belief that interest rates should be lower.",
    "link": "https://www.wishtv.com/news/business/a-top-federal-reserve-official-says-dour-jobs-data-backs-the-case-for-3-rate-cuts/",
    "timestamp": "2025-08-10T00:00:53Z"
  },
  {
    "title": "Articles On: Europe, Tariffs, Profits, Slowdown, Growth Forecasts, Trade Deal, Vietnam, Ceconomy, Car Sales, Baby Subsidy, India, and more",
    "description": "This section highlights articles and reports on the harmful impacts of the commercial and economic policies employed by the Chinese Communist Party.",
    "link": "https://www.hoover.org/research/articles-europe-tariffs-profits-slowdown-growth-forecasts-trade-deal-vietnam-ceconomy-car",
    "timestamp": "2025-08-10T00:00:00Z"
  },
  {
    "title": "Commercial fishing in a vast Pacific nature area is halted after a judge blocks a Trump order",
    "description": "Commercial fishing that recently resumed in a vast protected area of the Pacific Ocean must halt once again after a judge in Hawaii sided with environmentalists challenging a Trump administration rollback of federal ocean protections.",
    "link": "https://www.wsls.com/business/2025/08/09/commercial-fishing-in-a-vast-pacific-nature-area-is-halted-after-a-judge-blocks-a-trump-order/",
    "timestamp": "2025-08-09T23:57:02Z"
  },
  {
    "title": "White House crypto adviser Bo Hines announces departure",
    "description": "WASHINGTON :Bo Hines, who headed Republican President Donald Trump's Council of Advisers on Digital Assets, said on Saturday he was leaving his current role and returning to the private sector.Late last month, a cryptocurrency working group led by Hines and i…",
    "link": "https://www.channelnewsasia.com/business/white-house-crypto-adviser-bo-hines-announces-departure-5287071",
    "timestamp": "2025-08-09T23:56:26Z"
  },
  {
    "title": "CDC shooter believed COVID vaccine made him suicidal, his father tells police",
    "description": "A law enforcement official tells The Associated Press that a Georgia man who opened fire Friday on the U.S. Centers for Disease Control and Prevention headquarters in Atlanta had blamed the COVID-19 vaccine for making him depressed and suicidal",
    "link": "https://www.wsbtv.com/news/cdc-shooter-believed/74BH53SLFNGZPM5WZKMKRH5EFI/",
    "timestamp": "2025-08-09T23:56:00Z"
  },
  {
    "title": "Tammy Bruce nominated as US deputy representative to the United Nations",
    "description": "President Donald Trump has nominated State Department spokesperson Tammy Bruce to serve as the US deputy representative to the United Nations. Bruce, a former Fox News contributor and onetime Democrat turned conservative commentator, will require Senate confi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tammy-bruce-nominated-as-us-deputy-representative-to-the-united-nations/articleshow/123212145.cms",
    "timestamp": "2025-08-09T23:55:38Z"
  },
  {
    "title": "Wayne Gretzky’s silence on Donald Trump’s anti-Canada rhetoric still sparks debate years later",
    "description": "Wayne Gretzky, once a Canadian icon, faced public backlash in the mid-2020s due to his perceived silence during a politically sensitive period between Canada and the United States. His friendship with Donald Trump and attendance at Trump's events, combined wi…",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/wayne-gretzkys-silence-on-donald-trumps-anti-canada-rhetoric-still-sparks-debate-years-later/articleshow/123211690.cms",
    "timestamp": "2025-08-09T23:53:56Z"
  },
  {
    "title": "Trump's 100% tariff hint stirs concerns despite South Korea's MFN status",
    "description": "US President Donald Trump recently announced tariffs as high as 100% on certain semiconductor products. Although South Korea holds a commitment to \"most favored-nation\" (MFN) treatment, this move could still impact major players like Samsung Electronics and S…",
    "link": "https://www.digitimes.com/news/a20250808PD223/donald-trump-tariffs-south-korea-semiconductors-fab-investment-chips.html",
    "timestamp": "2025-08-09T23:53:49Z"
  },
  {
    "title": "Report: IRS Commissioner Billy Long Ousted After Clash Over Using Illegal Aliens' Data",
    "description": "Internal Revenue Service (IRS) Commissioner Billy Long was removed from his position hours after the IRS and the White House clashed over the usage of taxpayer information to find thousands of illegal aliens in the United States, according to a recent report\n…",
    "link": "https://www.breitbart.com/politics/2025/08/09/report-irs-commissioner-billy-long-ousted-after-clash-over-using-illegal-aliens-data/",
    "timestamp": "2025-08-09T23:47:48Z"
  }
]