[
  {
    "title": "Trump backed down over Greenland because he heard UK’s concerns, says Lammy",
    "description": "The deputy PM says the US President rowed back on threats after UK stood up for Denmark's sovereignty.",
    "link": "https://www.bbc.com/news/articles/cm244zlnmkvo",
    "timestamp": "2026-01-23T05:59:34Z"
  },
  {
    "title": "US officially exits World Health Organization, accusing agency of straying 'from its core mission'",
    "description": "It comes exactly one year after President Donald Trump signed an executive order to begin the process of withdrawal.",
    "link": "https://www.kake.com/news/us-officially-exits-world-health-organization-accusing-agency-of-straying-from-its-core-mission/article_4688799d-0539-4c7b-90a3-794e66f8c869.html",
    "timestamp": "2026-01-23T05:57:53Z"
  },
  {
    "title": "Dallas Baptist University evacuated amid threats ahead of speech by Trump's HUD chief Scott Turner",
    "description": "Updated at 3:20 p.m. ET, Jan. 22, 2026: Dallas Baptist University posted an update explaining that \"the Dallas Police Department and the FBI worked alongside our DBU Police Department to investigate the matter, and we can now issue an all-clear.\" According to…",
    "link": "https://freerepublic.com/focus/f-news/4363521/posts",
    "timestamp": "2026-01-23T05:56:59Z"
  },
  {
    "title": "US, Ukraine, Russia to hold security talks in UAE",
    "description": "US, Ukrainian, and Russian officials will hold crucial Ukraine security talks in the UAE to discuss a US-drafted plan aimed at ending the ongoing conflict.\n\nRead More: https://punchng.com/us-ukraine-russia-to-hold-security-talks-in-uae/",
    "link": "https://punchng.com/us-ukraine-russia-to-hold-security-talks-in-uae/",
    "timestamp": "2026-01-23T05:51:20Z"
  },
  {
    "title": "Canada doesn’t live because of US, PM Carney hits back at Trump",
    "description": "Canadian PM Mark Carney refutes Donald Trump’s claim that ‘Canada lives because of the US,’ highlighting growing tensions in Canada US relations.\n\nRead More: https://punchng.com/canada-doesnt-live-because-of-us-pm-carney-hits-back-at-trump/",
    "link": "https://punchng.com/canada-doesnt-live-because-of-us-pm-carney-hits-back-at-trump/",
    "timestamp": "2026-01-23T05:51:20Z"
  },
  {
    "title": "Asian shares, US futures gain as Japan keeps its key interest rate unchanged",
    "description": "Asian shares and U.S. futures are higher after U.S. stocks rose, regaining more of their losses for the week",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-us-futures-gain-japan-key-interest-129481308",
    "timestamp": "2026-01-23T05:49:52Z"
  },
  {
    "title": "Why is South Africa upset about Iran joining BRICS naval drills?",
    "description": "South Africa's government is facing backlash from the US and from within its own administration for hosting Iran's navy.",
    "link": "https://www.aljazeera.com/news/2026/1/23/why-is-south-africa-upset-about-iran-joining-brics-naval-drills",
    "timestamp": "2026-01-23T05:49:21Z"
  },
  {
    "title": "Stephen Colbert Takes Aim at Trump’s Billion-Dollar Board of Peace Entry Fee: ‘Seems a Little Steep’ | Video",
    "description": "\"After all, CBS got to [obey Trump] for just $16 million,\" the late night host adds\nThe post Stephen Colbert Takes Aim at Trump’s Billion-Dollar Board of Peace Entry Fee: ‘Seems a Little Steep’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/stephen-colbert-trump-peace-board-cbs-joke/",
    "timestamp": "2026-01-23T05:47:31Z"
  },
  {
    "title": "Iran warns 'finger on trigger' as Trump says Tehran wants talks",
    "description": "The commander of Iran's Revolutionary Guards warned Washington Thursday that the force had its \"finger on the trigger\" in the wake of mass protests, as U.S. President Donald Trump said Tehran still appeared interested in talks.",
    "link": "https://www.hurriyetdailynews.com/iran-warns-finger-on-trigger-as-trump-says-tehran-wants-talks-218144",
    "timestamp": "2026-01-23T05:46:06Z"
  },
  {
    "title": "Greenland Remaining With Denmark Not Raised During Trump Talks, NATO Chief Says",
    "description": "NATO Secretary-General Mark Rutte said on Jan. 21 that the issue of Greenland remaining part of Denmark did not come up during his meeting with U.S. President Donald Trump.Rutte, in an interview with Fox News, was asked about Greenland’s sovereignty under a p…",
    "link": "https://freerepublic.com/focus/f-news/4363519/posts",
    "timestamp": "2026-01-23T05:46:01Z"
  },
  {
    "title": "Top 5 moments from Jack Smith's testimony on Capitol Hill",
    "description": "Jack Smith testifies before House Judiciary Committee, facing Republican criticism over Trump prosecutions while defending his cases as apolitical.",
    "link": "https://www.foxnews.com/politics/top-5-moments-from-jack-smiths-testimony-capitol-hill",
    "timestamp": "2026-01-23T05:44:36Z"
  },
  {
    "title": "Russia, Ukraine and US to hold trilateral talks in Abu Dhabi",
    "description": "The meeting between the three countries comes as both Ukraine and Russia say no peace deal can be reached until territorial issues are resolved.",
    "link": "https://www.bbc.co.uk/news/articles/cx20011w4zzo",
    "timestamp": "2026-01-23T05:44:21Z"
  },
  {
    "title": "Trump warns “massive fleet” is heading towards Iran",
    "description": "America is closely watching Iran. A large US fleet is moving towards the Gulf region. President Trump warned of severe consequences if Iran attacks. Iran's Foreign Minister stated they will retaliate strongly if attacked. This situation follows recent interna…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-warns-massive-fleet-is-heading-towards-iran/articleshow/127238228.cms",
    "timestamp": "2026-01-23T05:42:15Z"
  },
  {
    "title": "Senior US defence official Colby to visit South Korea and Japan next week, Yonhap says",
    "description": "SEOUL, Jan 23 (Reuters) - U.S. Under Secretary of Defense for policy Elbridge Colby will visit South Korea from Sunday to Tuesday and discuss military alliance issues bef… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/23/senior-us-defence-official-colby-to-visit-south-korea-and-japan-next-week-yonhap-says",
    "timestamp": "2026-01-23T05:40:59Z"
  },
  {
    "title": "Trump’s tariffs do bite — When he actually imposes them",
    "description": "The withdrawal this week of a proposed charge on European nations over Greenland is the latest example of how Trump sometimes wields the tariff weapon without firing it; And the number of unrealised threats is stacking up",
    "link": "https://www.bloomberg.com/news/articles/2026-01-22/trump-s-tariffs-do-bite-when-he-actually-imposes-them",
    "timestamp": "2026-01-23T05:39:04Z"
  },
  {
    "title": "How US president Donald Trump is unravelling the global economic order",
    "description": "The US is no longer predictable nor bound by any fundamental principles of action",
    "link": "https://www.irishtimes.com/business/economy/2026/01/23/trump-is-erasing-the-global-economic-order/",
    "timestamp": "2026-01-23T05:39:00Z"
  },
  {
    "title": "Silver ETFs rally up to 17% in dramatic reversal, but will $100 barrier throw bulls out of the game?",
    "description": "Silver’s sharp rally has boosted Indian silver ETFs, led by a 17% jump in Tata Silver ETF, as global prices near the key $100 level. Gold and silver hit record highs amid geopolitical tensions, a weaker dollar and expectations of Fed rate cuts.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-etfs-rally-up-to-17-in-dramatic-reversal-but-will-100-barrier-throw-bulls-out-of-the-game/articleshow/127238052.cms",
    "timestamp": "2026-01-23T05:38:25Z"
  },
  {
    "title": "Feet dragging, division and obstruction: What Israel really wants for Gaza",
    "description": "Israeli strategy for Gaza caught between settlements and security zones, as it continues to kill Palestinians.",
    "link": "https://www.aljazeera.com/news/2026/1/23/feet-dragging-division-and-obstruction-what-israel-really-wants-for-gaza",
    "timestamp": "2026-01-23T05:37:33Z"
  },
  {
    "title": "TikTok establishes joint venture to end US ban threat",
    "description": "TikTok announced Thursday it has established a majority American-owned joint venture to operate its US business, allowing the company to avoid a ban over its Chinese ownership.",
    "link": "https://www.hurriyetdailynews.com/tiktok-establishes-joint-venture-to-end-us-ban-threat-218142",
    "timestamp": "2026-01-23T05:36:51Z"
  },
  {
    "title": "Trump rescinds Canada's invitation to join his 'Board of Peace'",
    "description": "President Trump revoked Canada's Prime Minister Mark Carney's invitation to his \"Board of Peace\" following Carney's public criticism of \"America First\" policies and authoritarianism. This move escalates tensions between the US and Canada, impacting trade rela…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-rescinds-canadas-invitation-to-join-his-board-of-peace/articleshow/127237662.cms",
    "timestamp": "2026-01-23T05:34:17Z"
  },
  {
    "title": "US, Ukrainian and Russian negotiators to meet in UAE for security talks",
    "description": "Ukrainian, U.S. and Russian officials will hold security talks in the United Arab Emirates on Friday, the Kremlin said, following a meeting of top U.S. negotiators with President Vladimir Putin in Moscow on a U.S.-drafted plan to end the Ukraine war.",
    "link": "https://www.hurriyetdailynews.com/us-ukrainian-and-russian-negotiators-to-meet-in-uae-for-security-talks-218141",
    "timestamp": "2026-01-23T05:33:57Z"
  },
  {
    "title": "Trump’s mortgage bond plan shows limited impact as market risks cloud housing outlook",
    "description": "President Trump’s mortgage bond plan is offering only marginal relief, with Reuters noting limited impact on mortgage rates and persistent affordability pressures. Analysts say structural supply shortages—not financing—are the main constraint on the U.S. hous…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/trumps-mortgage-bond-plan-shows-limited-impact-as-market-risks-cloud-housing-outlook/articleshow/127237397.cms",
    "timestamp": "2026-01-23T05:33:20Z"
  },
  {
    "title": "‘Donald Trump was looking for ways to stay in power after Biden loss’",
    "description": "Former US special counsel Jack Smith, who unsuccessfully prosecuted president Donald Trump, told a House of Representatives panel yesterday that Mr Trump was “looking for ways to stay in power” following his defeat in the 2020 election as he confronted Republ…",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-was-looking-for-ways-to-stay-in-power-after-biden-loss/a175120315.html",
    "timestamp": "2026-01-23T05:30:00Z"
  },
  {
    "title": "Theodore R Johnson: How Donald Trump’s chokehold on control thins democracy in passive America",
    "description": "Since the new year began, the federal government of America has already searched a journalist’s home, captured Venezuelan president Nicolas Maduro in a military strike, threatened to seize Greenland and violate Nato commitments, and opened a criminal investig…",
    "link": "https://www.independent.ie/opinion/comment/theodore-r-johnson-how-donald-trumps-chokehold-on-control-thins-democracy-in-passive-america/a1524008614.html",
    "timestamp": "2026-01-23T05:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Trump’s volatility has left Europe with one choice – lead or be led",
    "description": "Trust is the foundational principle on which relationships are built, but it is also known to be one of the easiest things to lose and hardest to recover. After the rupture in transatlantic ties, the emergency meeting of EU leaders to assess the damage was a …",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-trumps-volatility-has-left-europe-with-one-choice-lead-or-be-led/a574499727.html",
    "timestamp": "2026-01-23T05:30:00Z"
  },
  {
    "title": "Mary Regan: Davos was a wake-up call for EU leaders on transatlantic change",
    "description": "EU leaders gathered in Brussels for what was supposed to be an opportunity to forge a united front against Donald Trump’s threats to impose tariffs on countries that stood in the way of his Greenland ambitions.",
    "link": "https://www.independent.ie/opinion/analysis/mary-regan-davos-was-a-wake-up-call-for-eu-leaders-on-transatlantic-change/a891086296.html",
    "timestamp": "2026-01-23T05:30:00Z"
  },
  {
    "title": "Jared Kushner announces plans for Dubai-style ‘New Gaza’ development",
    "description": "The United States announced plans yesterday for a “New Gaza”, rebuilt from scratch to include residential towers, data centres and seaside resorts, part of Donald Trump’s push to advance an Israel-Hamas ceasefire shaken by repeated violations.",
    "link": "https://www.independent.ie/world-news/jared-kushner-announces-plans-for-dubai-style-new-gaza-development/a1978446153.html",
    "timestamp": "2026-01-23T05:30:00Z"
  },
  {
    "title": "U.S. quits WHO, ending decades-long global health role",
    "description": "America has officially exited the World Health Organization. This move triggers a significant budget crisis for the WHO, leading to staff reductions. The US stated its decision reflects management failures during the COVID-19 pandemic. The country plans to wo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/u-s-quits-who-ending-decades-long-global-health-role/articleshow/127236651.cms",
    "timestamp": "2026-01-23T05:24:57Z"
  },
  {
    "title": "Turkey Hosts a Secret Meeting of the Muslim Brotherhood.",
    "description": "Mostly unnoticed in the recent flurry of world events, from the people’s uprising in the streets of Iran to the lightning fast seizure and extradition of Venezuelan dictator, Nicolas Maduro, by the United States (U.S.) in a 2-3 January 2026 overnight raid, wa…",
    "link": "https://freerepublic.com/focus/f-bloggers/4363515/posts",
    "timestamp": "2026-01-23T05:22:02Z"
  },
  {
    "title": "Why Central Bank Independence Matters: Global lessons as Trump targets Fed Governor",
    "description": "Central bank independence is crucial for economic stability, as it helps control inflation and maintain confidence. Research shows that political interference in monetary policy often leads to higher inflation, currency weakness and slower growth.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-central-bank-independence-matters-global-lessons-as-trump-targets-fed-governor/articleshow/127236440.cms",
    "timestamp": "2026-01-23T05:19:51Z"
  },
  {
    "title": "Russia, Ukraine and US to hold trilateral talks in Abu Dhabi",
    "description": "The meeting between the three countries comes as both Ukraine and Russia warn no peace deal can be reached until territorial issues are resolved.",
    "link": "https://www.bbc.com/news/articles/cx20011w4zzo",
    "timestamp": "2026-01-23T05:19:03Z"
  },
  {
    "title": "Kushner's vision for rebuilding Gaza faces major obstacles",
    "description": "Jared Kushner envisions a rebuilt Gaza with high-rises, a coastline that attracts tourists and a bustling port",
    "link": "https://abcnews.go.com/International/wireStory/kushners-vision-rebuilding-gaza-faces-major-obstacles-129481169",
    "timestamp": "2026-01-23T05:18:22Z"
  },
  {
    "title": "TikTok closes deal to split US app from global business. Here's what to know",
    "description": "The app was due to be banned in the US a year ago if its Chinese owner hadn't sold its business in America.",
    "link": "https://www.bbc.com/news/articles/c3edd1l328lo",
    "timestamp": "2026-01-23T05:17:48Z"
  },
  {
    "title": "Philadelphia sues after slavery exhibits were taken down from President's House site",
    "description": "The city of Philadelphia on Thursday sued the Department of the Interior and the acting director of the National Park Service over reports that slavery exhibits were being dismantled in the city’s historic district",
    "link": "https://www.nbcnews.com/news/us-news/philadelphia-sues-slavery-exhibits-taken-presidents-house-site-rcna255535",
    "timestamp": "2026-01-23T05:16:59Z"
  },
  {
    "title": "Matt Cooper defends Ozempic users: ‘I was one of the very early adopters’",
    "description": "Radio: Last Word host shares his experiences to good effect, but on Drivetime the new hosts have yet to click",
    "link": "https://www.irishtimes.com/culture/tv-radio/2026/01/23/matt-cooper-defends-ozempic-users-i-was-one-of-the-very-early-adopters/",
    "timestamp": "2026-01-23T05:16:00Z"
  },
  {
    "title": "FII selling, weak rupee and oil prices drag Indian markets, but long-term story intact: Mark Mobius",
    "description": "Mark Mobius says India’s recent market correction is driven by FII outflows, weak rupee, higher oil prices and global uncertainty, not a broken growth story. He expects earnings-led FII return, reforms and infrastructure push in the Budget, stays bullish on I…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/fii-selling-weak-rupee-and-oil-prices-drag-indian-markets-but-long-term-story-intact-mark-mobius/articleshow/127235207.cms",
    "timestamp": "2026-01-23T05:10:10Z"
  },
  {
    "title": "In the case of the Federal Reserve, Supreme Court appears to carve out a murky exception",
    "description": "The Supreme Court for the past year has repeatedly allowed President Donald Trump to fire heads of independent agencies, but it appears to be drawing a line with the Federal Reserve",
    "link": "https://abcnews.go.com/Business/wireStory/case-federal-reserve-supreme-court-appears-carve-murky-129480088",
    "timestamp": "2026-01-23T05:09:46Z"
  },
  {
    "title": "Trump Revokes Canada’s Invitation To Join ‘Board of Peace’: ‘Dear Prime Minister…’",
    "description": "President Donald Trump uninvited Canada to join his \"Board of Peace\" on Thursday night, telling Prime Minister Mark Carney that the invitation had been withdrawn.\nThe post Trump Revokes Canada’s Invitation To Join ‘Board of Peace’: ‘Dear Prime Minister…’ firs…",
    "link": "https://www.mediaite.com/politics/trump/trump-revokes-canadas-invitation-to-join-board-of-peace-dear-prime-minister/",
    "timestamp": "2026-01-23T05:07:08Z"
  },
  {
    "title": "US completes withdrawal from WHO",
    "description": "The United States has officially withdrawn from the World Health Organisation, citing its mishandling of the COVID-19 pandemic and failure to reform.\n\nRead More: https://punchng.com/us-completes-withdrawal-from-who/",
    "link": "https://punchng.com/us-completes-withdrawal-from-who/",
    "timestamp": "2026-01-23T05:06:39Z"
  },
  {
    "title": "Hunger, death, devastation: No respite in Tigray a year after US aid cuts",
    "description": "In Ethiopia, once largest recipient of USAID funds in sub-Saharan Africa, many left with 'little humanitarian support'.",
    "link": "https://www.aljazeera.com/features/2026/1/23/hunger-death-devastation-no-respite-in-tigray-a-year-after-us-aid-cuts",
    "timestamp": "2026-01-23T05:06:35Z"
  },
  {
    "title": "Iran protest death toll reportedly reaches 5,000 as Trump warns of US Armada",
    "description": "Reports from activist groups indicate that the Iranian government's suppression of protests has resulted in more than 5,000 deaths. This alarming rise in casualties coincides with the country's most extended internet blackout, as tensions escalate with the ap…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-protest-death-toll-reportedly-reaches-5000-as-trump-warns-of-us-armada/articleshow/127234790.cms",
    "timestamp": "2026-01-23T05:05:07Z"
  },
  {
    "title": "Venezuela, the Revival of Regime Change and the Decline of Empire",
    "description": "The U.S. has since intercepted oil tankers as far away as North Atlantic Ocean",
    "link": "https://www.juancole.com/2026/01/venezuela-revival-decline.html",
    "timestamp": "2026-01-23T05:04:59Z"
  },
  {
    "title": "France’s navy intercepts an oil tanker in the Mediterranean sailing from Russia",
    "description": "PARIS (AP) — France’s navy, working with intelligence provided by the United Kingdom, on Thursday intercepted an oil tanker in the Mediterranean Sea that traveled from Russia, in a mission targeting the sanctioned Russian shadow fleet, officials said. French …",
    "link": "https://freerepublic.com/focus/f-chat/4363514/posts",
    "timestamp": "2026-01-23T05:02:53Z"
  },
  {
    "title": "Trump withdraws 'Board of Peace' invitation to Carney in widening rift with Canada",
    "description": "Trump said he has withdrawn the invitation to Canada to join the new Board of Peace, days after Carney's Davos speech warning against economic coercion by the superpowers.",
    "link": "https://www.cnbc.com/2026/01/23/trump-withdraws-board-of-peace-invitation-to-carney-in-widening-rift-with-canada.html",
    "timestamp": "2026-01-23T05:02:04Z"
  },
  {
    "title": "US officially leaves World Health Organization, triggering global health concerns - Radio47",
    "description": "The United States has completed its formal withdrawal from the World Health Organization (WHO), effective January 22, 2026, marking the end of nearly 78",
    "link": "https://www.radio47.fm/health/us-officially-leaves-world-health-organization-triggering-global-health-concerns-19353/",
    "timestamp": "2026-01-23T05:01:32Z"
  },
  {
    "title": "Japan's Takaichi dissolves parliament after only 3 months in office, setting up snap election",
    "description": "Japan’s Prime Minister Sanae Takaichi has dissolved the lower house of Parliament, paving the way for a Feb. 8 snap election",
    "link": "https://abcnews.go.com/International/wireStory/japans-takaichi-dissolves-parliament-after-3-months-office-129479401",
    "timestamp": "2026-01-23T05:01:26Z"
  },
  {
    "title": "Trump welcomes TikTok deal, thanks Xi for approving it",
    "description": "US President Donald Trump welcomed TikTok's new majority American-owned joint venture and thanked Chinese President Xi Jinping for approving the deal.",
    "link": "https://www.rte.ie/news/us/2026/0123/1554636-tiktok-us-deal/",
    "timestamp": "2026-01-23T05:00:41Z"
  },
  {
    "title": "TikTok seals deal for new joint venture to avoid US ban",
    "description": "US President Donald Trump welcomed TikTok's new majority American-owned joint venture and thanked Chinese President Xi Jinping for approving the deal.",
    "link": "https://www.rte.ie/news/business/2026/0123/1554636-tiktok-us-deal/",
    "timestamp": "2026-01-23T05:00:41Z"
  },
  {
    "title": "Americans are carrying the bulk of the tariff burden designed to boost domestic US economy",
    "description": "The reality of trying to make United States manufacturing great again is a far cry from the vision of Donald Trump and his team",
    "link": "https://www.irishtimes.com/business/2026/01/23/americans-are-carrying-the-bulk-of-the-tariff-burden-designed-to-boost-domestic-us-economy/",
    "timestamp": "2026-01-23T05:00:00Z"
  },
  {
    "title": "Billet. Jonathan, Trump, nous et les abysses",
    "description": "Comment va Jonathan ?",
    "link": "https://www.ledauphine.com/politique/2026/01/23/jonathan-nous-et-les-abysses",
    "timestamp": "2026-01-23T04:59:00Z"
  },
  {
    "title": "US completes WHO withdrawal, ending 75 years of membership",
    "description": "The US has completed its withdrawal from the WHO, with Trump and HHS citing COVID‑19 failures and China’s influence.",
    "link": "https://www.israelnationalnews.com/news/421353",
    "timestamp": "2026-01-23T04:55:16Z"
  },
  {
    "title": "Trump disinvites Canada from his ‘peace board’",
    "description": "US President Donald Trump has disinvited Canadian Prime Minister Mark Carney from his ‘Board of Peace’ Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631386-trump-board-peace-disinvites-carney/",
    "timestamp": "2026-01-23T04:54:25Z"
  },
  {
    "title": "Super Bowl LX movie trailers: Six blockbuster previews you can't miss",
    "description": "Super Bowl LX is set to take over the global spotlight on Sunday, February 8, at Levi&apos;s Stadium in Santa Clara, California, the home of the San Francisco 49ers. \n\nThe game its",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/01/23/6972f99f22601d05068b45ec.html",
    "timestamp": "2026-01-23T04:47:23Z"
  },
  {
    "title": "JD Vance Asked For Help Finding 'A Sex Offender' And You Already Know What Happened Next",
    "description": "The vice president's call for help was quickly answered.",
    "link": "https://www.huffpost.com/entry/jd-vance-sex-offender-question_n_6972ea30e4b0a02ab3a0b406",
    "timestamp": "2026-01-23T04:46:15Z"
  },
  {
    "title": "Rupee rises 17 paise to 91.41 against US dollar in early trade",
    "description": "The Indian Rupee saw a gain of 17 paise against the US Dollar today. This rise was driven by improved investor sentiment following a de-escalation of trade war fears. The Dollar corrected, allowing emerging market currencies like the Rupee to recover. However…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-rises-17-paise-to-91-41-against-us-dollar-in-early-trade/articleshow/127233560.cms",
    "timestamp": "2026-01-23T04:44:51Z"
  },
  {
    "title": "China and Vietnam remain key manufacturing hubs even as US tariffs reshape Taiwanese investment",
    "description": "Despite the impact of US tariffs under President Donald Trump, Taiwanese companies continue to view China and Vietnam as vital manufacturing and investment destinations due to their cost advantages and integrated supply chains. While investment in China has d…",
    "link": "https://www.digitimes.com/news/a20260123PD208/taiwan-manufacturing-exports-investment-china-vietnam.html",
    "timestamp": "2026-01-23T04:41:58Z"
  },
  {
    "title": "Trump's MAGA movement ramps up attacks on 'progressive white women'",
    "description": "Progressive white women have been persistent punching bags of President Donald Trump's MAGA movement, but attacks targeting the demographic group have become particularly vicious in recent weeks. The death of Renee Good, a 37-year-old American woman killed by…",
    "link": "https://japantoday.com/category/world/trump%27s-maga-movement-ramps-up-attacks-on-%27progressive-white-women%27",
    "timestamp": "2026-01-23T04:39:57Z"
  },
  {
    "title": "\"I am so happy to have helped in saving TikTok!:\" Donald Trump",
    "description": "Trump stated, noting that the application \"will now be owned by a group of Great American Patriots and Investors, the Biggest in the World, and will be an important Voice”",
    "link": "https://www.thehindubusinessline.com/news/world/i-am-so-happy-to-have-helped-in-saving-tiktok-donald-trump/article70540925.ece",
    "timestamp": "2026-01-23T04:34:58Z"
  },
  {
    "title": "TikTok finalizes deal to form new American entity",
    "description": "TikTok has finalized a deal to create a new American entity, avoiding the looming threat of a ban in the United States that has been in discussion for years.",
    "link": "https://www.npr.org/2026/01/22/nx-s1-5685456/tiktok-finalizes-deal-to-form-new-american-entity",
    "timestamp": "2026-01-23T04:34:07Z"
  },
  {
    "title": "Japan's Takaichi dissolves parliament after only 3 months in office, setting up snap election",
    "description": "Japanese Prime Minister Sanae Takaichi dissolved parliament on Friday ahead of a snap election on February 8, counting on her cabinet's high poll numbers to steer her otherwise unpopular ruling party to victory. The speaker of parliament on Friday read out a …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/japan-pm-sanae-takaichi-dissolves-parliament-for-snap-election/articleshow/127232549.cms",
    "timestamp": "2026-01-23T04:33:00Z"
  },
  {
    "title": "Susan Rice: Board of Peace Is Trump's 'Attempt to Play King of the World'",
    "description": "Monday on CNN’s “The Source,” former White House adviser Susan Rice said the Board of Peace was President Donald Trump’s attempt to play king of the world. Host Kaitlan Collins said, “As the former United Nations ambassador, I wonder what you make\nThe post Su…",
    "link": "https://www.breitbart.com/clips/2026/01/22/susan-rice-board-of-peace-is-trumps-attempt-to-play-king-of-the-world/",
    "timestamp": "2026-01-23T04:32:18Z"
  },
  {
    "title": "Takaichi dissolves Diet after only 3 months in office, setting up snap election",
    "description": "Prime Minister Sanae Takaichi dissolved the lower house of the Diet on Friday, paving the way for a Feb 8 snap election. The move is an attempt to capitalize on her popularity to help governing party regain ground after major losses in recent years, but will …",
    "link": "https://japantoday.com/category/politics/Takaichi-dissolves-Diet-after-only-3-months-in-office-setting-up-snap-election",
    "timestamp": "2026-01-23T04:31:33Z"
  },
  {
    "title": "‘Two Weeks’ Trump Strikes Again, Reveals Alleged Timeline for Greenland Details",
    "description": "President Donald Trump said on Thursday that details for his \"concept of a deal\" regarding Greenland will be released in \"two weeks.\"\nThe post ‘Two Weeks’ Trump Strikes Again, Reveals Alleged Timeline for Greenland Details first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/two-weeks-trump-strikes-again-reveals-alleged-timeline-for-greenland-details/",
    "timestamp": "2026-01-23T04:29:24Z"
  },
  {
    "title": "India’s sales of treasuries deepen pivot away from dollar assets",
    "description": "For Mumbai and others, the lessons come after the US froze Russia’s foreign exchange reserves following its February 2022 invasion of Ukraine. India’s continued buying of Russian oil since became a point of contention with US President Donald Trump, contribut…",
    "link": "https://economictimes.indiatimes.com/markets/forex/indias-sales-of-treasuries-deepen-pivot-away-from-dollar-assets/articleshow/127231823.cms",
    "timestamp": "2026-01-23T04:28:08Z"
  },
  {
    "title": "Indonesia wants peace over chaos: Prabowo says at WEF Davos 2026",
    "description": "President Prabowo Subianto, speaking at the World Economic Forum (WEF) 2026 in Davos, Switzerland, on Thursday, affirmed that Indonesia firmly chooses the ...",
    "link": "https://en.antaranews.com/news/401246/indonesia-wants-peace-over-chaos-prabowo-says-at-wef-davos-2026",
    "timestamp": "2026-01-23T04:28:05Z"
  },
  {
    "title": "TikTok US joint venture formally established to comply with regulatory requirements",
    "description": "TikTok USDS Joint Venture LLC has been officially established to meet the requirements of the Executive Order signed by US President Donald Trump on September 25, 2025. The move aims to ensure that more than 200 million US users and 7.5 million businesses can…",
    "link": "https://www.digitimes.com/news/a20260123VL206/tiktok-usa-joint-venture-oracle-algorithm-software.html",
    "timestamp": "2026-01-23T04:27:09Z"
  },
  {
    "title": "Author reveals the bond that binds Trump and Pete Hegseth",
    "description": "President Donald Trump and his Defense Secretary, Pete Hegseth, appear to have a special bond, and one author who has written about Trump for several decades revealed why that is during a new interview. Hegseth has seemed like a unicorn in the Trump world bec…",
    "link": "https://www.rawstory.com/trump-hegseth-2675007369/",
    "timestamp": "2026-01-23T04:26:02Z"
  },
  {
    "title": "Rupee rises 17 paise to 91.41 against US dollar in early trade",
    "description": "At the interbank foreign exchange, the rupee opened at 91.45 then gained ground to trade at 91.41 against the greenback, up 17 paise from its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-rises-17-paise-to-9141-against-us-dollar-in-early-trade/article70540960.ece",
    "timestamp": "2026-01-23T04:24:26Z"
  },
  {
    "title": "Trump's MAGA movement ramps up attacks on 'progressive white women'",
    "description": "Conservative voices are intensifying attacks on progressive white women. Figures like Erick Erickson and Vincent Oshana are criticizing them harshly. This trend coincides with a broader right-wing push against modern feminism and a renewed emphasis on traditi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-maga-movement-ramps-up-attacks-on-progressive-white-women/articleshow/127231409.cms",
    "timestamp": "2026-01-23T04:20:46Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.ksbw.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:18:19Z"
  },
  {
    "title": "Trump revokes Canada's invitation to join Board of Peace",
    "description": "US President Donald Trump withdrew an invitation for Canada to join his 'Board of Peace' initiative aimed at resolving global conflicts.",
    "link": "https://www.rte.ie/news/world/2026/0123/1554635-trump-carney-board-of-peace/",
    "timestamp": "2026-01-23T04:17:44Z"
  },
  {
    "title": "Prabowo boosts economic diplomacy at Indonesia's Davos pavilion",
    "description": "President Prabowo Subianto visited the Indonesian Pavilion on the sidelines of the World Economic Forum (WEF) Annual Meeting 2026 in Davos, Switzerland, on ...",
    "link": "https://en.antaranews.com/news/401242/prabowo-boosts-economic-diplomacy-at-indonesias-davos-pavilion",
    "timestamp": "2026-01-23T04:13:29Z"
  },
  {
    "title": "EU open to Trump’s Peace Board - if limited to Gaza",
    "description": "EU foreign policy chief Kaja Kallas says Europe could work with Trump’s new Peace Board if it is limited to Gaza.",
    "link": "https://www.israelnationalnews.com/news/421351",
    "timestamp": "2026-01-23T04:12:21Z"
  },
  {
    "title": "I was in Helmand with UK troops. Draft dodging Trump's words are a gut punch to those killed",
    "description": "After the damage done by the American president in Davos - and make no mistake, it was significant, with alliances further ruptured - he has now managed to amplify it with comments that are as disrespectful as they are false.",
    "link": "https://news.sky.com/story/i-was-in-helmand-with-uk-troops-draft-dodging-trumps-words-are-a-gut-punch-to-those-killed-13497851",
    "timestamp": "2026-01-23T04:12:00Z"
  },
  {
    "title": "White House Says 'Memes Will Continue' After Allegedly Altering Woman's Arrest Photo",
    "description": "The White House came under scrutiny for sharing a modified arrest image on X, as the administration pushes tougher limits on manipulated media.",
    "link": "https://decrypt.co/355599/white-house-memes-continue-allegedly-altering-womans-photo",
    "timestamp": "2026-01-23T04:09:38Z"
  },
  {
    "title": "Daily Briefing: Should India join the Board of Peace?",
    "description": "Also in today's edition: Decoding Trump’s playbook; a killing in Manipur; the last queen of Darbhanga; and more",
    "link": "https://indianexpress.com/article/live-news/top-news-today-briefing-10489976/",
    "timestamp": "2026-01-23T04:09:24Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wisn.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:08:13Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.koat.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:08:11Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wmur.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:08:05Z"
  },
  {
    "title": "US Officially Exits World Health Organization",
    "description": "The Trump administration cuts funding, recalls U.S. officials from the WHO.",
    "link": "https://www.theepochtimes.com/us/us-officially-exits-world-health-organization-5975202",
    "timestamp": "2026-01-23T04:08:03Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wcvb.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:08:02Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wdsu.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:07:52Z"
  },
  {
    "title": "TikTok clinches deal for new US joint venture to avoid American ban",
    "description": "The deal is a milestone for the social media firm after years of battles that began in August 2020 when President Donald Trump unsuccessfully tried to ban the app over national security concerns",
    "link": "https://www.thehindubusinessline.com/info-tech/social-media/tiktok-clinches-deal-for-new-us-joint-venture-to-avoid-american-ban/article70540907.ece",
    "timestamp": "2026-01-23T04:07:51Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.kcra.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:07:51Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wtae.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:07:50Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wmtw.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:07:48Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wgal.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:07:46Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.ketv.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:07:46Z"
  },
  {
    "title": "Trump Muses About Asking NATO to Help Protect US Southern Border",
    "description": "President Donald Trump openly mused about invoking NATO’s collective defense obligation to place allied troops along the US-Mexico border, a suggestion that, even if not meant seriously, represents another volley of rhetoric aimed squarely at European allies.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-muses-about-asking-nato-to-help-protect-us-southern-border",
    "timestamp": "2026-01-23T04:06:57Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wyff4.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:06:18Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "The U.S. has finalized its withdrawal from the World Health Organization",
    "link": "https://www.wlky.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:05:59Z"
  },
  {
    "title": "US has finalized its withdrawal from World Health Organization",
    "description": "US has finalized its withdrawal from World Health Organizationwbaltv.com",
    "link": "https://www.wbaltv.com/article/us-finalizes-withdrawal-world-health-organization/70098544",
    "timestamp": "2026-01-23T04:05:55Z"
  }
]