[
  {
    "title": "Trump trade wars disrupt business, economy shrinks",
    "description": "The economy was slowed by a surge in imports as companies in the United States tried to bring in foreign goods before President Trump imposed massive tariffs.",
    "link": "https://www.nwitimes.com/news/nation-world/business/economy/article_e936bab6-4d26-5122-a7c7-656ffe496c9c.html",
    "timestamp": "2025-04-30T14:48:55Z"
  },
  {
    "title": "'Fight the billionaire takeover': Trump golf course targeted by protesters",
    "description": "The pro-environment group Greenpeace has targeted President Donald Trump's golf course south of Glasgow, Scotland. Trump Turnberry dealt with protesters on Wednesday morning from the sandy beach, a few hundred yards from the green. Protesters used rakes to cr…",
    "link": "https://www.rawstory.com/trump-turnberry-greenpeace-2671872498/",
    "timestamp": "2025-04-30T14:48:35Z"
  },
  {
    "title": "Trump-Amazon spat: What happened and how much US consumers import online",
    "description": "The White House criticised Amazon after a report said it planned to inform customers how much tariffs will cost them.",
    "link": "https://www.aljazeera.com/news/2025/4/30/trump-amazon-spat-what-happened-and-how-much-us-consumers-import-online",
    "timestamp": "2025-04-30T14:48:18Z"
  },
  {
    "title": "Apple iPhone Production is about to increase significantly in India due to new plants from Tata Electronics and Foxconn",
    "description": "On April 25, Patently Apple posted a report titled “Apple aims to source all US iPhones from India in pivot away from China.\" While some reports have poured doubt on that claim, a new report today clarifies increased production for iPhones in India",
    "link": "https://www.patentlyapple.com/2025/04/apple-iphone-production-is-about-to-increase-significantly-in-india-due-to-new-plants-from-tata-electronics-and-foxconn.html",
    "timestamp": "2025-04-30T14:48:18Z"
  },
  {
    "title": "‘They have to pay a price’: Trump unleashes scathing attack on ‘unlawful’ deceivers as CBS News and ’60 Minutes’ appear to cave",
    "description": "'It is vital to hold these Liars and Fraudsters accountable!'",
    "link": "https://www.wnd.com/2025/04/they-have-to-pay-a-price-trump-unleashes-scathing-attack-on-unlawful-news-deceivers-as-cbs-and-60-minutes-appear-to-cave/",
    "timestamp": "2025-04-30T14:48:15Z"
  },
  {
    "title": "Trump admits he based deporation of Kilmar Abrego Garcia on picture that isn’t real",
    "description": "President Donald Trump appears convinced that a photoshopped image showing \"MS-13\" on the knuckles of Kilmar Abrego Garcia, who was deported to El Salvador in March, is real.\n\n\nDuring an interview aired on Tuesday with ABC News' Terry Moran, Trump referenced …",
    "link": "https://www.dailydot.com/debug/trump-kilmar-abrego-garcia-tattoo/",
    "timestamp": "2025-04-30T14:47:49Z"
  },
  {
    "title": "Vietnam celebrates 50 years since war’s end with focus on peace and unity",
    "description": "Vietnam has celebrated the end of the war with the United States and the formation of its modern nation 50 years ago with a military parade and a focus on a future of peace.",
    "link": "https://www.pbs.org/newshour/world/vietnam-celebrates-50-years-since-wars-end-with-focus-on-peace-and-unity",
    "timestamp": "2025-04-30T14:47:41Z"
  },
  {
    "title": "Trump says diversity initiatives undermine merit. Decades of research show this is flawed",
    "description": "US President Donald Trump declared earlier this year he would forge a \"color blind and merit-based society.\"",
    "link": "https://phys.org/news/2025-04-trump-diversity-undermine-merit-decades.html",
    "timestamp": "2025-04-30T14:47:04Z"
  },
  {
    "title": "US economy shrinks by unexpected 0.3%",
    "description": "US growth has dipped by an unforeseen 0.3% in the first three months of Donald Trump's presidency, according to initial data. Stocks fell in reaction to the news.",
    "link": "https://www.dw.com/en/us-economy-shrinks-by-unexpected-03/a-72399375",
    "timestamp": "2025-04-30T14:47:00Z"
  },
  {
    "title": "US Senate Commerce panel votes to advance NASA, FCC nominees",
    "description": "WASHINGTON :The U.S. Senate Commerce Committee voted on Wednesday to advance President Donald Trump's nominees to head NASA and to serve as commissioner on the Federal Communications Commission.Trump's pick to head the space agency, entrepreneur Jared Isaacma…",
    "link": "https://www.channelnewsasia.com/business/us-senate-commerce-panel-votes-advance-nasa-fcc-nominees-5100481",
    "timestamp": "2025-04-30T14:45:20Z"
  },
  {
    "title": "Trump says he could seek El Salvadoran man's return with phone call",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump says he could help return an El Salvadoran man mistakenly deported from Maryland but would not despite court-ordered action, in contrast to his administration's arguments that only El Salvador can act. Read f…",
    "link": "https://www.thestar.com.my/news/world/2025/04/30/trump-says-he-could-seek-el-salvadoran-man039s-return-with-phone-call",
    "timestamp": "2025-04-30T14:45:00Z"
  },
  {
    "title": "Vermont Judge Orders Release Of A Palestinian Man Arrested At His U.S. Citizenship Interview",
    "description": "Mohsen Mahdawi’s lawyers say he was detained in retaliation for his speech advocating for Palestinian human rights.",
    "link": "https://www.huffpost.com/entry/vermont-judge-orders-release-palestinian-man-arrested-citizenship-interview_n_68123604e4b0f2831ff14de1",
    "timestamp": "2025-04-30T14:44:14Z"
  },
  {
    "title": "Vermont judge orders release of a Palestinian man from detention",
    "description": "A judge on Wednesday released a Palestinian man who led protests against the war in Gaza as a student at Columbia University and was arrested by immigration officials during an interview about finalizing his U.S. citizenship.",
    "link": "https://www.wcax.com/2025/04/30/vermont-judge-orders-release-palestinian-man-detention/",
    "timestamp": "2025-04-30T14:44:03Z"
  },
  {
    "title": "Trump Gives Jeff Bezos Some Sugar: 'He's A Good Guy'",
    "description": "Jeff Bezos, the founder of Amazon caved to Donald Trump's complaints and Amazon told the Washington Post that they have not considered listing import charges on Amazon's main site because of the higher cost from Trump's tariffs.\nAmazon customers not following…",
    "link": "https://crooksandliars.com/2025/04/trump-gives-jeff-bezos-some-sugar-hes-good",
    "timestamp": "2025-04-30T14:43:54Z"
  },
  {
    "title": "Trump Tariffs Are About To Ruin Christmas",
    "description": "Normally, the production of Christmas goods would be well under way by now. But thanks to Trump’s tariffs, orders are being frozen, shortages and higher prices are probably on the way and some businesses are preparing to go under altogether, The New York Time…",
    "link": "https://crooksandliars.com/2025/04/trump-tariffs-are-about-ruin-christmas",
    "timestamp": "2025-04-30T14:43:48Z"
  },
  {
    "title": "GE HealthCare beats on earnings, slashes full year outlook due to tariffs",
    "description": "GE HealthCare beats on earnings, slashes full year outlook due to tariffs",
    "link": "https://www.cnbc.com/2025/04/30/ge-healthcare-earnings-tariffs.html",
    "timestamp": "2025-04-30T14:43:07Z"
  },
  {
    "title": "Johann Wadephul to become Germany's new Foreign Minister",
    "description": "CDU politician Johann Wadephul is set to head the Federal Foreign Office. Some difficult tasks await him. With Johann Wadephul, the center-right Christian Democratic Union (CDU) will once again field the German foreign minister. It will be the first time in a…",
    "link": "https://www.dw.com/en/johann-wadephul-to-become-germanys-new-foreign-minister/a-72400806",
    "timestamp": "2025-04-30T14:43:00Z"
  },
  {
    "title": "Apollo’s Zito Warns Trade War Risks Eroding US Dominance in Capital Markets",
    "description": "The US is risking potential erosion of its longtime dominance in capital markets amid President Donald Trump’s global trade war, warned John Zito, co-president of Apollo Global Management Inc.’s asset-management arm.",
    "link": "https://financialpost.com/pmn/business-pmn/apollos-zito-warns-trade-war-risks-eroding-us-dominance-in-capital-markets",
    "timestamp": "2025-04-30T14:42:26Z"
  },
  {
    "title": "Ukraine Reportedly Set To Sign Key Deal With U.S. In Hopes It Will Help End The War",
    "description": "Ukraine is reportedly set to sign a mineral resources deal with the U.S. in hopes it will help end the war",
    "link": "https://www.ibtimes.com/ukraine-reportedly-set-sign-key-deal-us-hopes-it-will-help-end-war-3771996",
    "timestamp": "2025-04-30T14:41:38Z"
  },
  {
    "title": "America’s Economic Tailwinds Will Override Trump and His Tariffs",
    "description": "Following the shock and awe of Donald Trump's return to the White House, it is now clear that his most destructive economic policies will be contained by market, institutional, and structural forces. Moreover, underlying trends should position the United Stat…",
    "link": "https://www.project-syndicate.org/commentary/markets-fed-technology-will-offset-trump-tariffs-by-nouriel-roubini-2025-04",
    "timestamp": "2025-04-30T14:40:59Z"
  },
  {
    "title": "Los vientos de cola de la economía estadounidense superarán a Trump y sus aranceles",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/markets-fed-technology-will-offset-trump-tariffs-by-nouriel-roubini-2025-04/spanish",
    "timestamp": "2025-04-30T14:40:59Z"
  },
  {
    "title": "Fact check: Trump touts his accomplishments at 100 days, but at times falls short on the facts",
    "description": "This article is part of The Globe’s initiative to cover disinformation and misinformation. E-mail us to share tips or feedback at disinfodesk@globeandmail.com.\nIn a visit Tuesday to Warren, Mich., U.S. President Donald Trump celebrated his first 100 days back…",
    "link": "https://biztoc.com/x/1c946af86cdd0618",
    "timestamp": "2025-04-30T14:40:34Z"
  },
  {
    "title": "Ukrainians Charged With Illegally Voting In US Presidential Election",
    "description": "Federal prosecutors have charged two Ukrainians with illegally voting in a presidential election, the latest case of non-citizens participating in elections.",
    "link": "https://dailycaller.com/2025/04/30/ukrainians-voted-illegally-us-presidential-election/",
    "timestamp": "2025-04-30T14:40:23Z"
  },
  {
    "title": "Donald Trump's Admission 'Proof of a Violation' in Deportations—Lawyer",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has said he has the power to bring Kilmar Abrego Garcia back to the United States but is refusing to exert his authority to return him.\nIn an interview with ABC's Terry Moran that aired …",
    "link": "https://biztoc.com/x/6ec97c2d99c66aed",
    "timestamp": "2025-04-30T14:40:17Z"
  },
  {
    "title": "Trump Says He Could Help Man Who Was Mistakenly Deported, But Will Not",
    "description": "US President Donald Trump says he could help return an El Salvadoran man mistakenly deported from Maryland, but would not despite court-ordered action, in contrast to his administration&#039;s arguments that only El Salvador can act.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-he-could-help-el-salvadoran-man-who-was-mistakenly-deported-but-wouldnt-8297224",
    "timestamp": "2025-04-30T14:39:51Z"
  },
  {
    "title": "Dollar General is one of the best stock performers of Trump's first 100 days",
    "description": "Analysts say a market rotation to defensive stocks and Dollar General's lower exposure to China tariffs have boosted the stock.",
    "link": "https://www.cnbc.com/2025/04/30/dollar-general-stock-trump-100-days.html",
    "timestamp": "2025-04-30T14:39:49Z"
  },
  {
    "title": "Bitcoin price recovers, Ethereum RWA value up 20%: April in charts",
    "description": "April 2025 witnessed crypto markets rocked by more tariffs at the direction of US President Donald Trump — controversial policies that could have influenced the outcome of Canada’s elections on April 28. On April 2, Trump levied “discounted reciprocal tariffs…",
    "link": "https://cointelegraph.com/news/bitcoin-price-recovers-ethereum-rwa-value-up-april-2025",
    "timestamp": "2025-04-30T14:37:03Z"
  },
  {
    "title": "Everyone wants a piece of Luigi Mangione. Who will get to try him first?",
    "description": "Pennsylvania prosecutors tell BI they want to try Mangione on gun and forgery charges. First, though, a battle looms over who tries him first in NY.",
    "link": "https://www.businessinsider.com/everyone-wants-luigi-mangione-first-trial-2025-4",
    "timestamp": "2025-04-30T14:36:31Z"
  },
  {
    "title": "China draws up list of U.S.-made goods exempt from 125% tariffs, sources say",
    "description": "China has created a list of U.S.-made products that would be exempted from its 125 per cent tariffs and is quietly notifying companies about the policy, two people familiar with the matter said.",
    "link": "https://www.cbc.ca/news/business/china-tariff-whitelist-1.7522535",
    "timestamp": "2025-04-30T14:36:28Z"
  },
  {
    "title": "Watch: 'Tolerant' Kennedy Savages Dems with Harsh Bit of Truth",
    "description": "On Tuesday, Sen. John Kennedy spoke to Sean Hannity about Democrats in the Senate - as usual he didn't mince his words.",
    "link": "https://www.westernjournal.com/watch-tolerant-kennedy-savages-dems-harsh-bit-truth-honestly-rather/",
    "timestamp": "2025-04-30T14:35:20Z"
  },
  {
    "title": "Trump Refuses to Fold a Losing Hand (Jennifer Rubin/The Contrarian)",
    "description": "Jennifer Rubin / The Contrarian:\nTrump Refuses to Fold a Losing Hand  —  Doubling down with a pair of deuces is not a winning strategy  —  Donald Trump's dozens of losses in court, including multiple defeats in his lawless quest to deport people without due p…",
    "link": "https://www.memeorandum.com/250430/p57",
    "timestamp": "2025-04-30T14:35:01Z"
  },
  {
    "title": "100 Days: Inflation Falls To Zero Even as Income and Spending Grow",
    "description": "100 days into the Trump administration, inflation has come down to zero.\nThe post 100 Days: Inflation Falls To Zero Even as Income and Spending Grow appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/04/30/inflation-falls-to-zero-even-as-income-and-spending-grows/",
    "timestamp": "2025-04-30T14:34:05Z"
  },
  {
    "title": "US inflation cools, consumer step up spending, as Americans brace for tariff impact",
    "description": "An inflation gauge cooled last month in a sign that prices were steadily easing ahead of tariffs.",
    "link": "https://www.denverpost.com/2025/04/30/us-consumer-spending-inflation-tariffs/",
    "timestamp": "2025-04-30T14:33:33Z"
  },
  {
    "title": "US inflation cools and Americans step up spending as they brace for tariff impact",
    "description": "An inflation gauge cooled last month in a sign that prices were steadily easing ahead of tariffs.",
    "link": "https://www.bostonherald.com/2025/04/30/us-consumer-spending-inflation-tariffs/",
    "timestamp": "2025-04-30T14:33:33Z"
  },
  {
    "title": "Mexico Avoids Recession Despite Tariff Uncertainty",
    "description": "Mexico's economy returned to growth in the first quarter of 2025, avoiding a recession despite deep uncertainty over US President Donald Trump's sweeping tariffs, official data showed Wednesday.",
    "link": "https://www.ibtimes.com/mexico-avoids-recession-despite-tariff-uncertainty-3771994",
    "timestamp": "2025-04-30T14:33:19Z"
  },
  {
    "title": "Michigan's governor gambles on Trump - and her chances at a presidential run",
    "description": "Gretchen Whitmer's awkward hug with Trump highlights the tricky politics of working with his administration.",
    "link": "https://www.bbc.com/news/articles/c20zj55vxmno",
    "timestamp": "2025-04-30T14:32:35Z"
  },
  {
    "title": "Banks Must Adopt Crypto or 'Be Extinct in 10 Years,' Eric Trump Says",
    "description": "The son of U.S. President Donald Trump said the current financial system is broken and blockchain technology is the fix.",
    "link": "https://www.coindesk.com/business/2025/04/30/banks-must-adopt-crypto-or-be-extinct-in-10-years-eric-trump-says",
    "timestamp": "2025-04-30T14:32:34Z"
  },
  {
    "title": "Why is Donald Trump considering legal action against New York Times?",
    "description": "Donald Trump is thinking about suing the New York Times. This is over how they reported his lawsuit against Paramount. The Paramount case involves a CBS interview with Kamala Harris. Trump claims it was edited unfairly. He believes the New York Times' reporti…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/why-is-donald-trump-considering-legal-action-against-new-york-times/articleshow/120769403.cms",
    "timestamp": "2025-04-30T14:31:31Z"
  },
  {
    "title": "'Literal Fascism': MAGA Rally Crowd Goes Wild as Trump Airs Migrant Arrest Propaganda",
    "description": "U.S. President Donald Trump used a campaign-style rally in Michigan late Tuesday to display a propaganda video glorifying the deportation and offshore imprisonment of migrants without due process, a presentation that drew enthusiastic cheers and \"USA\" chants …",
    "link": "https://www.commondreams.org/news/trump-deportations-fascism",
    "timestamp": "2025-04-30T14:31:05Z"
  },
  {
    "title": "As Trump trade wars disrupt businesses, U.S. economy shrinks 0.3 percent in first quarter",
    "description": "The January-March expansion was the slowest in almost three years and was down from 2.4 percent in the last three months of 2024.",
    "link": "https://www.pbs.org/newshour/politics/as-trump-trade-wars-disrupt-businesses-u-s-economy-shrinks-0-3-percent-in-first-quarter",
    "timestamp": "2025-04-30T14:31:01Z"
  },
  {
    "title": "'Line of B.S.': CNN expert claims 'there are no good signs' for Trump's popularity",
    "description": "As President Trump celebrates his first 100 days in office, national polls are showing Americans might not be happy about it because Trump's approval ratings are on the decline. CNN's chief data analyst Harry Enten broke down the numbers, claiming those who a…",
    "link": "https://www.rawstory.com/trump-popularity-no-positive-signs/",
    "timestamp": "2025-04-30T14:30:42Z"
  },
  {
    "title": "Donald Trump's Admission 'Proof of a Violation' in Deportations—Lawyer",
    "description": "Experts say Trump's acknowledgment that he has the power to return Kilmar Abrego Garcia could have significant legal consequences.",
    "link": "https://www.newsweek.com/donald-trump-admission-proof-violation-deportations-lawyer-2066137",
    "timestamp": "2025-04-30T14:30:10Z"
  },
  {
    "title": "Trump, Who Owes His Freedom to Due Process, Is Destroying It for Everyone Else (Asawin Suebsaeng/Rolling Stone)",
    "description": "Asawin Suebsaeng / Rolling Stone:\nTrump, Who Owes His Freedom to Due Process, Is Destroying It for Everyone Else  —  The president owes his freedom to due process.  Now, he's shredding this foundational American right for the rest of us  —  Donald Trump owes …",
    "link": "https://www.memeorandum.com/250430/p55",
    "timestamp": "2025-04-30T14:30:00Z"
  },
  {
    "title": "U.S. economy shrinks 0.3% in first quarter as Trump trade wars disrupt businesses (Associated Press)",
    "description": "Associated Press:\nU.S. economy shrinks 0.3% in first quarter as Trump trade wars disrupt businesses  —  The U.S. economy shrank at a 0.3% annual pace from January through March, the first drop in three years, as President Donald Trump's trade wars disrupted b…",
    "link": "https://www.memeorandum.com/250430/p54",
    "timestamp": "2025-04-30T14:30:00Z"
  },
  {
    "title": "The Education of a Teamster Rebel: Antonio Rosario",
    "description": "The winner of our Labor Organizer of the Year Award brings the tough love of a 30-year Teamster to the Amazon organizing effort.",
    "link": "https://inthesetimes.com/article/antonio-rosario-labor-organizer-of-the-year-amazon",
    "timestamp": "2025-04-30T14:30:00Z"
  },
  {
    "title": "Trump celebrates first 100 days; Pacers advance in NBA playoffs | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_af704c1c-dcf6-5711-b915-db0b8f99e3c1.html",
    "timestamp": "2025-04-30T14:30:00Z"
  },
  {
    "title": "Trump celebrates first 100 days; Pacers advance in NBA playoffs | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_12da200f-1107-51ed-a411-455ab1f74d30.html",
    "timestamp": "2025-04-30T14:30:00Z"
  },
  {
    "title": "On his 101st day in office, Trump blames Biden for the stock market",
    "description": "President Donald Trump is looking to shift some economic blame to former President Joe Biden.\nGetty Images\nPresident Trump is looking to former President Biden as the source of any downturn in the markets.\n\"This is Biden's Stock Market, not Trump's. I didn't …",
    "link": "https://biztoc.com/x/77fd38df4895b7ae",
    "timestamp": "2025-04-30T14:29:37Z"
  },
  {
    "title": "How much deterioration in the world’s largest economy could be traced to Trump’s policies? ‘All of it,’ one economist says",
    "description": "American businesses are cancelling orders from China, postponing expansion plans and hunkering down to see what trade policy surprises President Donald Trump plans to spring on them next.\nThe president’s massive and unpredictable taxes on imports seem likely …",
    "link": "https://biztoc.com/x/5b4db8e693faf2a0",
    "timestamp": "2025-04-30T14:29:34Z"
  },
  {
    "title": "Mexico avoids recession despite tariff uncertainty",
    "description": "Mexico’s economy returned to growth in the first quarter of 2025, avoiding a recession despite deep uncertainty over US President Donald Trump’s sweeping tariffs, official data showed Wednesday. Gross domestic product (GDP) grew 0.2 percent from the fourth qu…",
    "link": "https://www.digitaljournal.com/world/mexico-avoids-recession-despite-tariff-uncertainty/article",
    "timestamp": "2025-04-30T14:27:32Z"
  },
  {
    "title": "Ford CEO Jim Farley: Employee pricing will continue as new auto tariffs loom | CNN Business",
    "description": "Ford CEO Jim Farley announced Wednesday on CNN that the automaker is extending its “employee pricing” offer to car buyers for another month, through July 4, to encourage sales to consumers nervous about rising prices because of new tariffs on imported cars an…",
    "link": "https://www.cnn.com/2025/04/30/business/ford-ceo-tariffs/index.html",
    "timestamp": "2025-04-30T14:26:49Z"
  },
  {
    "title": "Did Trump's tariffs hurt US economy in first quarter? Here's what the GDP report card says",
    "description": "The U.S. economy contracted in the first quarter as President Donald Trump's economic agenda took effect, according to new data released on Wednesday. It is the weakest GDP print since the same period in 2002. The slowdown comes amid growing concerns that Tru…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-economy-shrinks-0-3-percent-did-trumps-tariffs-hurt-us-economy-in-first-quarter-heres-what-the-gdp-report-card-says-us-recession/articleshow/120769057.cms",
    "timestamp": "2025-04-30T14:26:35Z"
  },
  {
    "title": "On his 101st day in office, Trump blames Biden for the stock market",
    "description": "President Trump is defending his economic policies while urging Americans to \"be patient\" amid the tumult of markets and overall economy.",
    "link": "https://www.businessinsider.com/trump-blames-biden-stock-market-tariffs-recession-100-days-2025-4",
    "timestamp": "2025-04-30T14:26:13Z"
  },
  {
    "title": "New Trump Tower Announced for Middle East City Skyline",
    "description": "The project was launched ahead of an expected visit by the U.S. President to the region.",
    "link": "https://www.newsweek.com/new-trump-tower-announced-middle-east-city-skyline-2066154",
    "timestamp": "2025-04-30T14:25:41Z"
  },
  {
    "title": "Inflation Cools in March, but Don't Expect Interest Rates to Budge",
    "description": "Uncertainty about the economy and looming tariffs may be spurring spending.",
    "link": "https://www.cnet.com/personal-finance/banking/inflation-cools-in-march-but-dont-expect-interest-rates-to-budge/",
    "timestamp": "2025-04-30T14:25:00Z"
  },
  {
    "title": "Trump Predicts China Would 'Eat' Tariffs, Lessening US Impact (Hadriana Lowenkron/Bloomberg)",
    "description": "Hadriana Lowenkron / Bloomberg:\nTrump Predicts China Would ‘Eat’ Tariffs, Lessening US Impact  —  President Donald Trump said China deserved the steep tariffs he imposed on their exports and predicted Beijing could find a way to reduce their impact on America…",
    "link": "https://www.memeorandum.com/250430/p51",
    "timestamp": "2025-04-30T14:25:00Z"
  },
  {
    "title": "Rachel Maddow: ‘I Think 100 Days In, That Donald Trump Is Losing’",
    "description": "“We should expect that there are going to be some things ahead that are markedly more horrible than even what they have done already.”",
    "link": "https://www.forbes.com/sites/markjoyella/2025/04/30/rachel-maddow-i-think-100-days-in-that-donald-trump-is-losing/",
    "timestamp": "2025-04-30T14:24:26Z"
  },
  {
    "title": "Trump Has Insane Excuse for Why Economy Is So Terrible",
    "description": "Donald Trump’s economy has not been doing well, but you’d never think that if you got your news from the president.\r\nOn Wednesday, Trump once again blamed the market’s poor performance on the last guy in office, claiming on Truth Social that the country was s…",
    "link": "https://newrepublic.com/post/194598/donald-trump-excuse-economy-terrible-joe-biden",
    "timestamp": "2025-04-30T14:24:00Z"
  },
  {
    "title": "‘THIS IS INSANE’: Critics Lose It Over Trump Insisting Photoshopped ‘MS-13’ Tattoo Is Real",
    "description": "Trump sparked an odd debate this week after he falsely insisted in an interview that deported migrant Kilmar Abrego Garcia had \"MS-13\" tattooed on his hand.\nThe post ‘THIS IS INSANE’: Critics Lose It Over Trump Insisting Photoshopped ‘MS-13’ Tattoo Is Real fi…",
    "link": "https://www.mediaite.com/media/this-is-insane-critics-lose-it-over-trump-insisting-photoshopped-ms-13-tattoo-is-real/",
    "timestamp": "2025-04-30T14:23:12Z"
  },
  {
    "title": "Among global MF schemes China-focused funds shine",
    "description": "Amid the growing trade war, Chinese stock market was boosted by increased fund flow from foreign investors, who took advantage of the cheap valuations of high-tech Chinese companies.",
    "link": "https://www.thehindubusinessline.com/markets/among-global-mf-schemes-china-focused-funds-shine/article69510382.ece",
    "timestamp": "2025-04-30T14:22:33Z"
  },
  {
    "title": "President Trump holds cabinet meeting to mark first 100 days: Watch live",
    "description": "President Donald Trump is set to meet with members of his cabinet at 11 a.m. EST to discuss the first 100 days of his second term. Highlights of Trump’s first 100 days include his efforts to stem the border crisis, make the government more efficient, renegoti…",
    "link": "https://nypost.com/video/president-trump-holds-cabinet-meeting-to-mark-first-100-days-watch-live/",
    "timestamp": "2025-04-30T14:22:31Z"
  },
  {
    "title": "Guatemala gearing up to export avocados to US despite tariffs and delays",
    "description": "Six months after the United States gave a green light to import avocados from Guatemala, the Central American country has yet to send any of the fruit north, but expectations are running high",
    "link": "https://abcnews.go.com/International/wireStory/guatemala-gearing-export-avocados-us-despite-tariffs-delays-121317806",
    "timestamp": "2025-04-30T14:22:22Z"
  },
  {
    "title": "Trump Says He Doesn’t Feel Like Returning Abrego Garcia",
    "description": "In a tense interview with ABC News, Trump agreed that he could order Abrego Garcia’s return to the U.S. from El Salvador, but he doesn’t want to.",
    "link": "http://nymag.com/intelligencer/article/trump-says-he-doesnt-feel-like-returning-abrego-garcia.html",
    "timestamp": "2025-04-30T14:21:26Z"
  },
  {
    "title": "Donald Trump, You're No Franklin Roosevelt (Jamelle Bouie/New York Times)",
    "description": "Jamelle Bouie / New York Times:\nDonald Trump, You're No Franklin Roosevelt  —  There is no question that Donald Trump's ambition in the first 100 days of his return to the Oval Office was to set a new standard for presidential accomplishment.  To rival, even …",
    "link": "https://www.memeorandum.com/250430/p49",
    "timestamp": "2025-04-30T14:20:00Z"
  },
  {
    "title": "EXCLUSIVE: Conservative PAC raked in donations from Hindus—then trashed them after the checks cleared",
    "description": "Last October, President Donald Trump sent a tweet that caused a flutter of excitement in the small but influential Hindu-American community. \n\n\n“I strongly condemn the barbaric violence against Hindus, Christians, and other minorities who are getting attacked…",
    "link": "https://www.dailydot.com/debug/conservative-pac-hindu-donors/",
    "timestamp": "2025-04-30T14:19:02Z"
  },
  {
    "title": "Caution surrounds planned DRC-Rwanda peace agreement",
    "description": "Kinshasa and Kigali say they want to present a plan to end the ongoing crisis by May 2. But past ceasefires have often been broken, and analysts say the US-brokered MoU is driven by self-interest from Washington.",
    "link": "https://www.dw.com/en/caution-surrounds-planned-drc-rwanda-peace-agreement/a-72395252",
    "timestamp": "2025-04-30T14:19:00Z"
  },
  {
    "title": "Doubts arise about planned DRC-Rwanda peace agreement",
    "description": "Kinshasa and Kigali say they want to present a plan to end the ongoing crisis by May 2. But past ceasefires have often been broken and analysts say the US-brokered plan is driven by Washington's own self interest.",
    "link": "https://www.dw.com/en/doubts-arise-about-planned-drc-rwanda-peace-agreement/a-72395252",
    "timestamp": "2025-04-30T14:19:00Z"
  },
  {
    "title": "What Trump Said About Russia, Ukraine, Israel in First 100 Days",
    "description": "Tariffs, trade wars and 100 dizzying days of Donald Trump. Here's what the US president has said about the Russia-Ukraine war and the crisis in the Middle East during his first 100 days in office. \nRead more:…",
    "link": "https://biztoc.com/x/16fdc7a760f39eb0",
    "timestamp": "2025-04-30T14:18:46Z"
  },
  {
    "title": "‘I’m not the one making this decision’: President Bystander strikes again",
    "description": "President Donald Trump is interviewed by Anchor and Senior National Correspondent Terry Moran as Trump marks his first 100 days in office, in the Oval Office, on April 29, 2025.",
    "link": "https://biztoc.com/x/a13f945ea0bdc478",
    "timestamp": "2025-04-30T14:18:45Z"
  },
  {
    "title": "AOC leaves door open for 2028 presidential bid as campaign buzz soars",
    "description": "Rep. Alexandria Ocasio-Cortez did not rule out 2028 presidential aspirations when asked about the viral video that had pundits guessing if she was soft-launching her campaign.",
    "link": "https://nypost.com/2025/04/30/us-news/aoc-leaves-door-open-for-2028-presidential-bid-as-campaign-buzz-soars/",
    "timestamp": "2025-04-30T14:18:42Z"
  },
  {
    "title": "US Treasury dealers recommend ending federal debt ceiling",
    "description": "WASHINGTON (Reuters) -The U.S. Treasury's primary dealers say they would prefer to end the federal debt ceiling, as it likely increases debt service costs...",
    "link": "https://finance.yahoo.com/news/us-treasury-dealers-recommend-ending-141842581.html",
    "timestamp": "2025-04-30T14:18:42Z"
  },
  {
    "title": "‘I Am Sorry’: Harvard Promises To Address Antisemitism After Rejecting Trump Admin’s Demands",
    "description": "Harvard University President Alan Garber promised to address antisemitism after internal investigations revealed a hostile campus climate.",
    "link": "https://dailycaller.com/2025/04/30/i-am-sorry-harvard-promises-to-address-antisemitism-after-rejecting-trump-admins-demands/",
    "timestamp": "2025-04-30T14:17:36Z"
  },
  {
    "title": "Microsoft president urges fast ‘resolution’ of transatlantic trade tensions",
    "description": "Microsoft President Brad Smith called Wednesday for a swift resolution of trade tensions between the United States and Europe, during an interview with AFP in Brussels. Transatlantic ties are at their lowest since US President Donald Trump returned to the Whi…",
    "link": "https://www.digitaljournal.com/world/microsoft-president-urges-fast-resolution-of-transatlantic-trade-tensions/article",
    "timestamp": "2025-04-30T14:17:20Z"
  },
  {
    "title": "US inflation cools, consumer step up spending, as Americans brace for tariff impact",
    "description": "WASHINGTON (AP) — A closely watched inflation gauge cooled last month in a sign that prices were steadily easing before most of President Donald Trump’s tariffs were implemented. At the same time, consumers accelerated their spending, potentially in an effort…",
    "link": "https://financialpost.com/pmn/us-inflation-cools-consumer-step-up-spending-as-americans-brace-for-tariff-impact",
    "timestamp": "2025-04-30T14:16:50Z"
  },
  {
    "title": "Here It Is: Trump Administration’s 100 Day Achievements and Promises Kept",
    "description": "President Donald J. Trump’s first 100 days back in the Oval Office have drawn heavy criticism from Democrats and foreign governments—particularly those that no longer benefit from massive trade imbalances, free military protection, and one-sided tariffs and t…",
    "link": "https://www.thegatewaypundit.com/2025/04/trump-administration-100-day-achievements-promises-kept/",
    "timestamp": "2025-04-30T14:15:25Z"
  },
  {
    "title": "Microsoft President Urges Fast 'Resolution' Of Transatlantic Trade Tensions",
    "description": "Microsoft President Brad Smith called Wednesday for a swift resolution of trade tensions between the United States and Europe, during an interview with AFP in Brussels.",
    "link": "https://www.ibtimes.com/microsoft-president-urges-fast-resolution-transatlantic-trade-tensions-3771985",
    "timestamp": "2025-04-30T14:15:23Z"
  },
  {
    "title": "Here's what experts say about selling gold jewelry for cash",
    "description": "Gold prices hit record highs this month, signaling it may be a good time for consumers to sell jewelry and other physical gold. Here's what to know.",
    "link": "https://www.cnbc.com/2025/04/30/time-to-sell-gold-what-to-know-about-trading-jewelry-for-cash.html",
    "timestamp": "2025-04-30T14:15:10Z"
  },
  {
    "title": "Springfield, Ohio Residents Debate Trump’s First 100 Days | WSJ",
    "description": "President Donald Trump thrust the small city of Springfield, Ohio, into the center of the immigration conversation during the 2024 ...",
    "link": "https://biztoc.com/x/d158a2d3d45922d5",
    "timestamp": "2025-04-30T14:14:14Z"
  },
  {
    "title": "'This has NOTHING TO DO WITH TARIFFS': Trump washes hands of responsibility for US economy drop",
    "description": "Trump took no responsibility for the state of the economy and insisted that “this is Biden’s Stock Market, not Trump’s”.",
    "link": "https://www.thejournal.ie/donald-trump-economy-drop-tariffs-6691927-Apr2025/",
    "timestamp": "2025-04-30T14:12:59Z"
  },
  {
    "title": "Trump says ‘be patient’ as US economy shrinks",
    "description": "WASHINGTON - US President Donald Trump has urged Americans to be patient in the face of an unexpected first-quarter economic contraction, claiming his tariffs will eventually lead to a boom in the US economy.",
    "link": "https://www.bangkokpost.com/business/general/3014981/trump-says-be-patient-as-us-economy-shrinks",
    "timestamp": "2025-04-30T14:12:00Z"
  },
  {
    "title": "U.S. Economy Shrank In Trump's First 100 Days",
    "description": "The president blamed Joe Biden for a decline in gross domestic product partly caused by tariffs.",
    "link": "https://www.huffpost.com/entry/trump-gpd-recession-first-quarter_n_681224b9e4b064707614958d",
    "timestamp": "2025-04-30T14:11:59Z"
  },
  {
    "title": "US-Ukraine resource deal imminent – Bloomberg",
    "description": "The back-and-forth around the agreement has dragged on for months, with the US pushing to recoup its costs for supporting Kiev Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616559-us-ukraine-resource-deal-imminent/",
    "timestamp": "2025-04-30T14:11:49Z"
  },
  {
    "title": "Single Mom Waitress Left 'Shaking' by Enormous Tip",
    "description": "The restaurant's owner described the tip as \"life-changing.\"",
    "link": "https://www.newsweek.com/virginia-waitress-single-mom-huge-tip-2066079",
    "timestamp": "2025-04-30T14:10:37Z"
  },
  {
    "title": "Trump border pick accused of 'cover-up' over death of man beaten by US agents (Chris Stein/The Guardian)",
    "description": "Chris Stein / The Guardian:\nTrump border pick accused of ‘cover-up’ over death of man beaten by US agents  —  Former top official calls for Rodney Scott to be blocked from CBP role over handling of investigation into Anastasio Hernández Rojas's death  —  Rodn…",
    "link": "https://www.memeorandum.com/250430/p47",
    "timestamp": "2025-04-30T14:10:01Z"
  },
  {
    "title": "'They have to pay a price': Trump goes after New York Times for purported 'unlawful acts'",
    "description": "President Donald Trump issued a wall of text threatening criminal and civil penalties to media companies for how they covered last year's presidential election.The president posted a 316-word rant Wednesday morning on Truth Social alleging that Paramount, the…",
    "link": "https://www.rawstory.com/paramount-trump-lawsuit-nyt/",
    "timestamp": "2025-04-30T14:09:09Z"
  },
  {
    "title": "Ivan Timofeev: This late Soviet leader’s legacy is a warning to Trump",
    "description": "Unlike Mikhail Gorbachev, Trump has no illusions about being liked. That’s what makes his disruption more effective – and more volatile. Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616547-ivan-timofeev-trump-gorbachev/",
    "timestamp": "2025-04-30T14:08:08Z"
  },
  {
    "title": "Trump's Crypto Sherpa Bo Hines Says Crypto Legislation on Target for Quick Completion",
    "description": "Strategists for two U.S. bills meant to create an oversight regime for crypto are setting out plans this week to pass legislation in the summer, Bo Hines, the White House official at the center of those efforts, told CoinDesk.\nHines, who President Donald Trum…",
    "link": "https://biztoc.com/x/4627098574b26bda",
    "timestamp": "2025-04-30T14:07:50Z"
  },
  {
    "title": "Guatemala gearing up to export avocados to US despite tariffs and delays",
    "description": "SAN MIGUEL DUENAS, Guatemala (AP) — Standing outside a massive new avocado packing plant recently and with the U.S. ambassador in attendance, Guatemala President Bernardo Arevalo connected the high-demand fruit with rural development and said the facility sig…",
    "link": "https://financialpost.com/pmn/guatemala-gearing-up-to-export-avocados-to-us-despite-tariffs-and-delays",
    "timestamp": "2025-04-30T14:07:45Z"
  },
  {
    "title": "U.S. economy shrinks 0.3%, the first drop in three years",
    "description": "The \n \n \n \n \n \n U.S. economy\n \n \n \n \n \n shrank at a 0.3 per cent annual pace from January through March, first drop in three years. It was slowed by a surge in imports as companies in the United States tried to bring in foreign goods before President \n \n \n \n …",
    "link": "https://biztoc.com/x/3b547fc6bd793e88",
    "timestamp": "2025-04-30T14:07:30Z"
  },
  {
    "title": "German growth better than expected but tariff turmoil looms",
    "description": "Germany's struggling economy grew faster than expected at the start of the year, data showed Wednesday, in a boost for the incoming government of conservative Friedrich Merz even as US tariffs threaten to derail the nascent recovery.",
    "link": "https://www.thelocal.de/20250430/german-growth-better-than-expected-but-tariff-turmoil-looms",
    "timestamp": "2025-04-30T14:06:22Z"
  },
  {
    "title": "Crypto and FinTech Execs: UK Needs to Be More Welcoming to Industry",
    "description": "Cryptocurrency and FinTech executives say Great Britain has become an unwelcoming place for their businesses. That’s according to a report Wednesday (April 30) by CNBC, citing interviews with industry leaders who say the United Kingdom risks losing companies …",
    "link": "https://www.pymnts.com/news/regulation/2025/crypto-and-fintech-execs-uk-needs-to-be-more-welcoming-to-industry/",
    "timestamp": "2025-04-30T14:06:18Z"
  },
  {
    "title": "Ukraine and US set to sign new minerals deal today",
    "description": "U.S. President Donald Trump has previously described such a pact as reimbursement for billions in American aid sent to help Kyiv against Russia's full-scale invasion.",
    "link": "https://www.politico.eu/article/ukraine-us-agree-new-minerals-deal/",
    "timestamp": "2025-04-30T14:05:19Z"
  },
  {
    "title": "Key Inflation Measure Slowed To Multiyear Low In March—But Tariff Bump On The Horizon",
    "description": "The Federal Reserve’s favored inflation yardstick has been above its 2% target for 49 consecutive months.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/30/inflation-slowed-to-multiyear-low-in-march-but-tariff-bump-on-the-horizon/",
    "timestamp": "2025-04-30T14:04:37Z"
  },
  {
    "title": "Is the race for clean energy losing momentum?",
    "description": "The US is pivoting back to fossil fuels, China is ramping up renewables, while Europe is trying to catch up.",
    "link": "https://www.aljazeera.com/program/counting-the-cost/2025/4/30/is-the-race-for-clean-energy-losing-momentum",
    "timestamp": "2025-04-30T14:04:09Z"
  },
  {
    "title": "Trump Refuses to Answer One Telling Question on Pete Hegseth",
    "description": "Donald Trump isn’t giving a clear answer regarding Secretary of Defense Pete Hegseth’s future. \r\nOn Tuesday, Trump sat for an interview with ABC News’s Terry Moran, who asked the president if he had “100 percent confidence in Pete Hegseth.” \r\nTrump’s reply di…",
    "link": "https://newrepublic.com/post/194596/trump-pete-hegseth-future",
    "timestamp": "2025-04-30T14:04:05Z"
  }
]