[
  {
    "title": "The Leopard Has Come For A Small Town Kansas Mayor & Its Residents",
    "description": "I suppose we might all be tiring of the whole “the leopard you voted for eventually comes to eat your face” cliche at this point, but when the allegory fits you have to use it. And in this case, it fits so well that it would be comical if not for just how hea…",
    "link": "https://www.techdirt.com/2025/12/02/the-leopard-has-come-for-a-small-town-kansas-mayor-its-residents/",
    "timestamp": "2025-12-03T04:16:04Z"
  },
  {
    "title": "Scott Jennings Blasts Democrats for Projecting Joe Biden’s Health Issues Onto Trump",
    "description": "‘Journalists’ and their fellow Democrats continue pushing the false narrative that there is something medically wrong with President Donald Trump....",
    "link": "https://twitchy.com/warren-squire/2025/12/02/scott-jennings-on-trumps-deteriorating-health-fake-narrative-cnn-n2422372",
    "timestamp": "2025-12-03T04:13:59Z"
  },
  {
    "title": "US cancels citizenship ceremonies for migrants from travel ban countries",
    "description": "It is the latest part of the Trump administration's renewed immigration crackdown in the wake of a deadly DC shooting.",
    "link": "https://www.bbc.com/news/articles/cvg1q27l533o",
    "timestamp": "2025-12-03T04:10:34Z"
  },
  {
    "title": "Venezuela denounces US-ordered ‘forced sale’ of oil company Citgo",
    "description": "A Delaware judge has ordered the sale to settle debts, as Venezuela says US military buildup is targeting its oil.",
    "link": "https://www.aljazeera.com/news/2025/12/3/venezuela-denounces-us-ordered-forced-sale-of-oil-company-citgo",
    "timestamp": "2025-12-03T04:09:20Z"
  },
  {
    "title": "Senator Reads DOD Law of War Manual On CNN To Show the Trump Administration Committed a ‘War Crime’",
    "description": "Sen. Angus King brought the Department of Defense's Law of War Manual on CNN to explain why the military carried out an illegal order when it killed survivors of a shipwreck.\nThe post Senator Reads DOD Law of War Manual On CNN To Show the Trump Administration…",
    "link": "https://www.mediaite.com/media/tv/senator-reads-dod-law-of-war-manual-on-cnn-to-show-the-trump-administration-committed-a-war-crime/",
    "timestamp": "2025-12-03T04:08:54Z"
  },
  {
    "title": "Texas Tech restricts teaching of race and gender, faculty could be disciplined for violating rule",
    "description": "Texas Tech enacts new classroom restrictions on race and gender topics, with faculty potentially facing discipline for violating the policy.",
    "link": "https://www.foxnews.com/us/texas-tech-restricts-teaching-race-gender-faculty-could-disciplined-violating-rule",
    "timestamp": "2025-12-03T04:07:20Z"
  },
  {
    "title": "Trump says he doesn't want Somalis in the U.S., urges them to go back to their homeland and fix it",
    "description": "President Trump says he doesn't want Somali immigrants in the U.S., saying residents of the war-ravaged eastern African country are too reliant on U.S. social safety net and add little to the U.S.",
    "link": "https://www.npr.org/2025/12/02/nx-s1-5629305/trump-says-he-doesnt-want-somalis-in-the-u-s-urges-them-to-go-back-to-their-homeland-and-fix-it",
    "timestamp": "2025-12-03T04:05:44Z"
  },
  {
    "title": "ICE ordering fleet of 20 armoured vehicles from Brampton, Ont., firm",
    "description": "U.S. Immigration and Customs Enforcement earmarked millions of dollars for a bulk order for 20 armoured vehicles from Canadian defence manufacturer Roshel that are built to resist bullets and bomb blasts.",
    "link": "https://www.cbc.ca/news/canada/toronto/ice-ordering-vehicles-brampton-roshel-9.7001107",
    "timestamp": "2025-12-03T04:03:51Z"
  },
  {
    "title": "Trump, 79, Issues Bonkers Bid to Prosecute His Enemies",
    "description": "Trump, 79, Issues Bonkers Bid to Prosecute His Enemiesthedailybeast.com",
    "link": "https://www.thedailybeast.com/trump-79-issues-bonkers-bid-to-prosecute-his-enemies/",
    "timestamp": "2025-12-03T04:01:54Z"
  },
  {
    "title": "Donald Trump and the Alt-Right",
    "description": "For years Donald Trump had no more committed a MAGA supporter than Rep. Margaret Taylor Greene of Georgia. As a private citizen, she had been fervently loyal to Trump during all the troubles and setbacks of his first term. Greene was then elected to Congress …",
    "link": "https://www.lewrockwell.com/2025/12/ron-unz/donald-trump-and-the-alt-right/",
    "timestamp": "2025-12-03T04:01:00Z"
  },
  {
    "title": "Trump praises Matt Van Epps' Tennessee election win",
    "description": "United States President Donald Trump congratulated Republican Matt Van Epps for winning in the Tennessee special congressional election, calling it \"another great night for the Republican Party.\"\"Cong...",
    "link": "https://biztoc.com/x/9f8e4b6efb7453f9",
    "timestamp": "2025-12-03T03:59:15Z"
  },
  {
    "title": "Trump Declares All Biden 'Autopen' Documents Void",
    "description": "US President Donald Trump said that all the documents and orders signed by the autopen instead of former President Joe Biden are hereby null and void.",
    "link": "https://sputnikglobe.com/20251203/trump-declares-all-biden-autopen-documents-void-1123217802.html",
    "timestamp": "2025-12-03T03:58:00Z"
  },
  {
    "title": "Critics Quash Trump Cabinet Secretary's Joy Following Her 'Cruel' Comments",
    "description": "Social media users likened Brooke Rollins' remarks to a line straight out of \"Hunger Games.\"",
    "link": "https://www.huffpost.com/entry/brooke-rollins-biden-trump-roll-back-food-stamps-snap_n_692f9ae4e4b0cee443817c05",
    "timestamp": "2025-12-03T03:56:52Z"
  },
  {
    "title": "Republican Triumphs in Tennessee Special House Election",
    "description": "Republican Matt Van Epps triumphed in Tuesday’s House special election in Tennessee, stifling talk of a possible Democrat upset in a reliably red district. As... Read More\nThe post Republican Triumphs in Tennessee Special House Election appeared first on The …",
    "link": "https://www.dailysignal.com/2025/12/02/republican-triumphs-in-tennessee-special-house-election/",
    "timestamp": "2025-12-03T03:54:38Z"
  },
  {
    "title": "Progressive gains strike fear into Democratic party leaders",
    "description": "Recent political developments have greatly encouraged progressives in the US and struck fear into the hearts of the Democratic party leadership. That leadership is pro-corporate, pro-war, and reflexively pro-Israel, not willing to say anything critical even a…",
    "link": "https://freethoughtblogs.com/singham/2025/12/02/progressive-gains-strike-fear-into-democratic-party-leaders/",
    "timestamp": "2025-12-03T03:52:10Z"
  },
  {
    "title": "Trump administration pauses immigration applications from nationals of 19 countries",
    "description": "The move affects submissions by people from Afghanistan, Iran, Libya, Somalia, Sudan, Yemen and other countries with travel bans or restrictions imposed by Trump this year.",
    "link": "https://www.nbcnews.com/politics/immigration/trump-administration-pauses-immigration-applications-19-countries-rcna247106",
    "timestamp": "2025-12-03T03:50:32Z"
  },
  {
    "title": "Michael Goodwin: How NY followed Biden’s, Dems’ charge in harboring illegal immigrant criminals",
    "description": "For decades, Congress and a parade of presidents couldn’t agree on how to secure the southern border and what to do with the millions of illegal immigrants already here.",
    "link": "https://nypost.com/2025/12/02/opinion/michael-goodwin-how-ny-followed-bidens-dems-charge-in-harboring-illegal-immigrant-criminals/",
    "timestamp": "2025-12-03T03:48:40Z"
  },
  {
    "title": "Colombia’s Petro invites Trump to cocaine lab demolition amid attack threat",
    "description": "Colombian president chides Trump, saying 18,400 cocaine laboratories have been destroyed 'without missiles' fired.",
    "link": "https://www.aljazeera.com/news/2025/12/3/colombias-petro-invites-trump-to-cocaine-lab-demolition-amid-attack-threat",
    "timestamp": "2025-12-03T03:47:49Z"
  },
  {
    "title": "What Trump’s autopen tirades are really about",
    "description": "Trump’s attacks on the autopen are back.\nWith a health care deadline looming and polls showing increasing frustration with congressional inaction on kitchen-table issues such as affordability, last week, President Donald Trump announced on social media that h…",
    "link": "https://biztoc.com/x/c36fd81315850ccc",
    "timestamp": "2025-12-03T03:47:42Z"
  },
  {
    "title": "Trump administration pauses all immigration applications from 19 non-European countries",
    "description": "The Trump administration on Tuesday said it paused all immigration applications, including green  card and U.S. citizenship processing, filed by immigrants from 19 non-European countries, citing concerns over national security and public safety.",
    "link": "https://www.cbc.ca/news/world/trump-immigration-pause-somalia-9.7001078",
    "timestamp": "2025-12-03T03:40:24Z"
  },
  {
    "title": "Pope Leo Confronts Trump: Don't Invade Venezuela — and No \"Solo Deal\" in Ukraine (Christopher Hale/Letters from Leo)",
    "description": "Christopher Hale / Letters from Leo:\nPope Leo Confronts Trump: Don't Invade Venezuela — and No “Solo Deal” in Ukraine  —  Leo delivered twin admonitions aimed at Donald Trump's foreign policy gambits — urging dialogue instead of a military ouster in Venezuela…",
    "link": "https://www.memeorandum.com/251202/p172",
    "timestamp": "2025-12-03T03:40:00Z"
  },
  {
    "title": "Justice Department expands legal action against states that have refused its demands for voter data",
    "description": "The U.S. Justice Department is suing six more states in its ongoing campaign to obtain voter data and other election information",
    "link": "https://abcnews.go.com/Politics/wireStory/justice-department-expands-legal-action-states-refused-demands-128058354",
    "timestamp": "2025-12-03T03:33:40Z"
  },
  {
    "title": "War for Ukraine Day 1,377: Witkoff’s & Jared’s Moscow Junket",
    "description": "Extra very special envoy Steve Witkoff and still not a real boy Jared went to Moscow today to sell Ukraine out in exchange for more money in their own bank accounts. It didn’t really go well. Ushakov: No compromises have been reached so far, and a meeting bet…",
    "link": "https://balloon-juice.com/2025/12/02/war-for-ukraine-day-1377-witkoffs-jareds-moscow-junket/",
    "timestamp": "2025-12-03T03:33:00Z"
  },
  {
    "title": "Trump’s ratings recover a little after slump; Australian Labor retains large poll leads",
    "description": "The US president’s net approval has recovered slightly from the November low.",
    "link": "https://theconversation.com/trumps-ratings-recover-a-little-after-slump-australian-labor-retains-large-poll-leads-270567",
    "timestamp": "2025-12-03T03:31:42Z"
  },
  {
    "title": "Tennessee Special Election Is Another Ominous Sign for GOP",
    "description": "Though she didn’t win, left-bent candidate Aftyn Behn ran well ahead of recent Democratic candidates in a deep-red district in Tennessee. It’s another strong sign of a midterm breeze against Trump and Republicans.",
    "link": "http://nymag.com/intelligencer/article/tennessee-special-election-result-aftyn-behn-van-epps-midterms-republicans.html",
    "timestamp": "2025-12-03T03:29:50Z"
  },
  {
    "title": "Trump deserves credit for 'very dangerous' peace deals like India-Pakistan: US Secretary of State Rubio",
    "description": "US Secretary of State Marco Rubio lauded President Trump's foreign policy, citing his role in brokering peace deals, including \"very dangerous ones like India and Pakistan.\" Trump himself claimed credit for ending eight wars and resolving numerous global conf…",
    "link": "https://economictimes.indiatimes.com/news/india/trump-deserves-credit-for-very-dangerous-peace-deals-like-india-pakistan-us-secretary-of-state-rubio/articleshow/125732598.cms",
    "timestamp": "2025-12-03T03:29:22Z"
  },
  {
    "title": "Exclusive — Dr. Oz Urges 69 Million Seniors to Act in Last Week of Medicare Enrollment: 'It’s Yours, You Own It'",
    "description": "As the final stretch of Medicare’s open enrollment period begins, Centers for Medicare & Medicaid Services (CMS) Administrator Dr. Mehmet Oz is requesting America’s seniors to take immediate action to avoid missing out on potentially significant healthcare sa…",
    "link": "https://www.breitbart.com/politics/2025/12/02/exclusive-dr-oz-urges-seniors-act-final-week-medicare-enrollment/",
    "timestamp": "2025-12-03T03:25:17Z"
  },
  {
    "title": "Colombian family files first known formal complaint over deadly US strike in Caribbean | CNN",
    "description": "The family of a Colombian man believed to have been killed in a US strike in the Caribbean has filed what’s believed to be the first complaint against such attacks with the Inter-American Commission on Human Rights (IACHR).",
    "link": "https://www.cnn.com/2025/12/02/americas/colombia-caribbean-boat-strike-iachr-complaint-intl-latam",
    "timestamp": "2025-12-03T03:23:53Z"
  },
  {
    "title": "Michael and Susan Dell donate nearly $10b to 'Trump accounts'",
    "description": "Tech billionaires Michael and Susan Dell have pledged $US6.25 billion ($9.5 billion) to new investment accounts for children, known as \"Trump accounts\". Here's how the donation will work.",
    "link": "https://www.abc.net.au/news/2025-12-03/michael-susan-dell-donate-billions-for-trump-accounts/106096100",
    "timestamp": "2025-12-03T03:23:53Z"
  },
  {
    "title": "Filipino crew of sunk cargo ship to be released by Houthis",
    "description": "Philippines says nine Filipino crew members of the Eternity C, sunk by Houthis in July, will be released. The men will be transferred from Sanaa to Oman before returning home.",
    "link": "https://www.israelnationalnews.com/news/418729",
    "timestamp": "2025-12-03T03:23:15Z"
  },
  {
    "title": "Hakeem Jeffries: 'Donald Trump's Whole Life Is a Scam'",
    "description": "Tuesday on MS NOW's \"All In,\" House Minority Leader Hakeem Jeffries (D-NY) called President Donald Trump's whole life \"a scam.\"\nThe post Hakeem Jeffries: ‘Donald Trump’s Whole Life Is a Scam’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/12/02/hakeem-jeffries-donald-trumps-whole-life-is-a-scam/",
    "timestamp": "2025-12-03T03:21:13Z"
  },
  {
    "title": "'Not Moved Away from Peace' — Ushakov After 5-Hour US-Russia Talks",
    "description": "Russian President Vladimir Putin and US special envoy Steve Witkoff have not discussed specific formulations, but the essence of the documents proposed by the United States on the Ukrainian peace settlement issue, Russian presidential aide Yury Ushaov said.",
    "link": "https://sputnikglobe.com/20251203/not-moved-away-from-peace--ushakov-after-5-hour-us-russia-talks-1123217479.html",
    "timestamp": "2025-12-03T03:18:51Z"
  },
  {
    "title": "Trump signs bill mandating reviews of Taiwan engagement limits",
    "description": "TOKYO -- U.S. President Donald Trump has signed a bill that cements regular State Department reviews of Washington's engagement with Taiwan, during which officials are instructed to look for ways to ease limits.\nMove could lead to looser U.S. State Department…",
    "link": "https://biztoc.com/x/e1cd294dec9ced0a",
    "timestamp": "2025-12-03T03:14:00Z"
  },
  {
    "title": "Republican Matt Van Epps wins House special election in Tennessee",
    "description": "Van Epps has won a nationally watched special election in Tennessee for a seat in the U.S. House, maintaining his party’s grip on the district with help from President Donald Trump.",
    "link": "https://biztoc.com/x/cf43759d4f065b40",
    "timestamp": "2025-12-03T03:13:44Z"
  },
  {
    "title": "Trump-backed Republican Matt Van Epps wins US House special election in Tennessee",
    "description": "Republican Matt Van Epps has won a special election in Tennessee for a seat in the U.S. House. Van Epps was backed by President Donald Trump. He defeated Democratic state Rep. Aftyn Behn to keep the 7th Congressional District in…",
    "link": "https://apnews.com/article/tennessee-special-election-congress-van-epps-behn-246e101692e3dd002d43a4cdb467164b",
    "timestamp": "2025-12-03T03:12:34Z"
  },
  {
    "title": "Trump says he doesn't want Somalis in US as ICE plans Minnesota operation",
    "description": "The president says the US will \"go the wrong way if we keep taking in garbage into our country\".",
    "link": "https://www.bbc.com/news/articles/c208x9v68w3o",
    "timestamp": "2025-12-03T03:08:59Z"
  },
  {
    "title": "Trump Says 'Potential Fed Chair' Attends Business Leaders' Meeting- Who Was It?",
    "description": "Tensions between Donald Trump and Federal Reserve Chair Jerome Powell continue to simmer as the US president drops fresh hints about who might lead the central bank once Powell’s term expires in May next year.",
    "link": "https://www.ndtvprofit.com/global-economics/trump-says-potential-fed-chair-attends-business-leaders-meeting-who-was-it",
    "timestamp": "2025-12-03T03:06:38Z"
  },
  {
    "title": "US-Russia talks on Ukraine were 'constructive' but work remains, Putin adviser says",
    "description": "High-level talks between Russia and the U.S. on ending the Ukraine war are described as constructive, though significant hurdles remain, particularly regarding territorial disputes. While some U.S. proposals are deemed acceptable, others face Russian criticis…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-russia-talks-on-ukraine-were-constructive-but-work-remains-putin-adviser-says/articleshow/125732263.cms",
    "timestamp": "2025-12-03T03:05:04Z"
  },
  {
    "title": "South Korea's Lee says on martial law anniversary perpetrators must face justice",
    "description": "SEOUL, Dec 3 (Reuters) - South Korean President Lee Jae Myung said on Wednesday there was still work to be done to address the fallout of the failed martial law bid by his predecessor a year ago, and the country needed to ensure the perpetrators were brought …",
    "link": "https://www.thestar.com.my/news/world/2025/12/03/south-korea039s-lee-says-on-martial-law-anniversary-perpetrators-must-face-justice",
    "timestamp": "2025-12-03T03:02:00Z"
  },
  {
    "title": "More Americans Say Political Rhetoric Has Gone Too Far",
    "description": "Larger majorities than in 2011 say Republicans (69%) and Democrats (60%) go too far in using inflammatory language to criticize their opponents.",
    "link": "https://news.gallup.com/poll/699077/americans-say-political-rhetoric-gone-far.aspx",
    "timestamp": "2025-12-03T03:00:00Z"
  },
  {
    "title": "The Embarrassments of Ideology",
    "description": "“It’s not personal, Sonny. It’s strictly business.”—Michael Corleone, The Godfather Pay-to-play schemes. Protection rackets. Extortion. Corruption. Self-enrichment. Graft. Grift. Brutality. Roaming bands of thugs smashing car windows and terrorizing communiti…",
    "link": "https://www.activistpost.com/the-embarrassments-of-ideology/",
    "timestamp": "2025-12-03T02:59:00Z"
  },
  {
    "title": "Republicans Hold On To House Seat In Tennessee",
    "description": "Matt Van Epps won the special election Tuesday for Tennessee’s 7th Congressional District, securing 52.4% votes over Aftyn Behn, who received 46.5%.",
    "link": "https://dailycaller.com/2025/12/02/republicans-hold-on-to-house-seat-in-tennessee/",
    "timestamp": "2025-12-03T02:56:57Z"
  },
  {
    "title": "As lead changes in knife-edge Honduran election, will Trump fail to get his way?",
    "description": "Former vice-president Salvador Nasralla has a small lead over his rival, the conservative former mayor of Tegucigalpa, Nasry Asfura.",
    "link": "https://www.bbc.com/news/articles/c9895x3039ro",
    "timestamp": "2025-12-03T02:56:42Z"
  },
  {
    "title": "Republican Matt Van Epps wins House special election in Tennessee",
    "description": "Van Epps has won a nationally watched special election in Tennessee for a seat in the U.S. House, maintaining his party’s grip on the district with help from President Donald Trump.",
    "link": "https://www.pbs.org/newshour/politics/republican-matt-van-epps-wins-house-special-election-in-tennessee",
    "timestamp": "2025-12-03T02:56:24Z"
  },
  {
    "title": "‘Another great night for the Republican Party!’ Trump congratulates Matt Van Epps for winning Tennessee congressional race",
    "description": "'The Radical Left Democrats threw everything at him, including Millions of Dollars'",
    "link": "https://www.wnd.com/2025/12/another-great-night-republican-party-trump-congratulates-matt/",
    "timestamp": "2025-12-03T02:54:38Z"
  },
  {
    "title": "Republican Matt Van Epps projected winner in Tennessee special election",
    "description": "Republican Matt Van Epps is the projected winner of the closely watched special election for Tennessee's U.S. House seat, according to the Associated Press.",
    "link": "https://abcnews.go.com/Politics/republican-matt-van-epps-projected-winner-closely-watched/story?id=128057088",
    "timestamp": "2025-12-03T02:52:41Z"
  },
  {
    "title": "US defence chief says he did not see survivors before follow-up boat strike",
    "description": "US Secretary of Defense Peter Hegseth defends controversial second strike on alleged drug boat in the Caribbean Sea.",
    "link": "https://www.aljazeera.com/news/2025/12/3/us-defence-chief-says-he-did-not-see-survivors-before-follow-up-boat-strike",
    "timestamp": "2025-12-03T02:52:21Z"
  },
  {
    "title": "Poll: Paxton Leads, Hunt Rises, Cornyn Drops to Third in Texas Republican Senate Primary",
    "description": "A survey of likely Republican primary voters in Texas shows U.S. Sen. John Cornyn trailing both of his major challengers ahead of the 2026 GOP Senate primary, with the longtime incumbent now polling in third place.\nThe post Poll: Paxton Leads, Hunt Rises, Cor…",
    "link": "https://www.breitbart.com/politics/2025/12/02/poll-paxton-leads-hunt-rises-cornyn-drops-third-texas-republican-senate-primary/",
    "timestamp": "2025-12-03T02:52:13Z"
  },
  {
    "title": "US pauses all immigration applications from 19 non-European countries",
    "description": "The Trump administration on Tuesday (Dec 2) said it paused all immigration applications, including green card and US citizenship processing, filed by immigrants from 19 non-European countries, citing concerns",
    "link": "https://www.channelnewsasia.com/world/us-immigration-applications-pauses-19-non-european-countries-5529521",
    "timestamp": "2025-12-03T02:52:00Z"
  },
  {
    "title": "Trump calls Somalis 'garbage'; tells them to go 'back to where they came from'",
    "description": "President Donald Trump expressed his desire to halt Somali immigration to the United States. He stated that Somalis are too reliant on social safety nets and contribute little to the nation. Trump's comments follow recent actions by his administration regardi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-calls-somalis-garbage-tells-them-to-go-back-to-where-they-came-from/articleshow/125731957.cms",
    "timestamp": "2025-12-03T02:47:03Z"
  },
  {
    "title": "Republican Matt Van Epps Wins Special Election for Tennessee's Seventh Congressional District",
    "description": "Matt Van Epps, the Republican candidate for Congress in Tennessee's 7th Congressional District, defeated his Democrat opponent, Aftyn Behn, in a special election on Tuesday night.\nThe post Republican Matt Van Epps Wins Special Election for Tennessee’s Seventh…",
    "link": "https://www.breitbart.com/politics/2025/12/02/republican-matt-van-epps-wins-special-election-for-tennessees-seventh-congressional-district3156852/",
    "timestamp": "2025-12-03T02:46:08Z"
  },
  {
    "title": "Video: Trump 'sleeping' during cabinet meeting? After years of mocking 'sleepy Joe', viral clip explodes online. White House responds",
    "description": "California Governor Gavin Newsom released a video showing President Donald Trump appearing to doze during a cabinet meeting. The footage quickly went viral online. This incident draws parallels to Trump's own past criticisms of Joe Biden for alleged sleepines…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/video-trump-sleeping-during-cabinet-meeting-after-years-of-mocking-sleepy-joe-viral-clip-explodes-online-white-house-responds/articleshow/125731678.cms",
    "timestamp": "2025-12-03T02:42:19Z"
  },
  {
    "title": "Marco Rubio Has One Of Greatest College Football Playoff Takes Of All Time",
    "description": "Secretary of State Marco Rubio set aside his personal team loyalties and seized his speaking slot to advocate for Miami's spot in the College Football Playoff.",
    "link": "https://dailycaller.com/2025/12/02/marco-rubio-college-football-playoff-miami-hurricanes/",
    "timestamp": "2025-12-03T02:41:32Z"
  },
  {
    "title": "Republicans Narrowly Hang On In Tennessee Special Election",
    "description": "Matt Van Epps defeated Democrat Aftyn Behn in a closer-than-expected race.",
    "link": "https://www.huffpost.com/entry/republicans-narrowly-hang-on-tennessee-special-election_n_692f1fb3e4b02d38edf02ab5",
    "timestamp": "2025-12-03T02:41:15Z"
  },
  {
    "title": "Trump administration threatens to withhold food assistance from 21 states",
    "description": "The threat comes as the federal government seeks to enforce a demand that states turn over data about SNAP recipients.",
    "link": "https://www.aljazeera.com/news/2025/12/3/trump-administration-threatens-to-withhold-food-assistance-from-21-states",
    "timestamp": "2025-12-03T02:41:02Z"
  },
  {
    "title": "Donald Trump Reacts to Tennessee Special Election Results",
    "description": "Matt Van Epps was backed by more than $1 million from MAGA Inc.",
    "link": "https://biztoc.com/x/ea5ea9340f88181f",
    "timestamp": "2025-12-03T02:39:49Z"
  },
  {
    "title": "Stocks Struggle for Momentum Ahead of US Eco Data: Markets Wrap",
    "description": "Asian stocks traded within tight ranges early Wednesday, mirroring similar moves on Wall Street as investors treaded cautiously ahead of a slew of US economic data.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-struggle-for-momentum-ahead-of-us-eco-data-markets-wrap",
    "timestamp": "2025-12-03T02:39:39Z"
  },
  {
    "title": "LIVE RESULTS: Special Election in TN-07! UPDATE: DDHQ Calls Election for Van Epps",
    "description": "It's all over but the shouting. And the voting. Tonight, we find out whether Democrats caught Republicans napping in a special election for a congressional district that Donald Trump won by 22 points a year ago. Or did a late Trump intervention manage to save…",
    "link": "https://freerepublic.com/focus/f-bloggers/4355697/posts",
    "timestamp": "2025-12-03T02:38:12Z"
  },
  {
    "title": "Trump-backed Republican keeps crucial congressional seat in GOP hands with special election victory",
    "description": "Republican Matt Van Epps defeats Democrat Aftyn Behn in Tennessee's 7th district special election, keeping GOP seat in red district Trump won by 22 points.",
    "link": "https://www.foxnews.com/politics/republicans-keep-crucial-congressional-seat-gop-hands-special-election-victory",
    "timestamp": "2025-12-03T02:38:05Z"
  },
  {
    "title": "Trump pauses immigration applications from 19 countries over security concerns",
    "description": "The Trump administration pauses immigration applications from 19 countries, citing security concerns after a deadly attack in Washington. The move halts green cards and citizenship processing, with cases set for re-review.",
    "link": "https://www.israelnationalnews.com/news/418727",
    "timestamp": "2025-12-03T02:37:08Z"
  },
  {
    "title": "Amid 'war on drugs', Trump frees right-wing leader jailed for trafficking",
    "description": "Donald Trump says his country is at war with \"narco-terrorists\". But he is freeing the former president of Honduras, who was jailed in the US for overseeing one of the world's worst drug conspiracies.",
    "link": "https://www.abc.net.au/news/2025-12-03/donald-trump-pardons-former-honduran-president-drug-trafficking/106095618",
    "timestamp": "2025-12-03T02:36:02Z"
  },
  {
    "title": "US pauses all immigration applications from 19 non-European countries",
    "description": "Dec 2 (Reuters) - The Trump administration on Tuesday said it paused all immigration applications, including green card and U.S. citizenship processing, filed by immigrants from 19 non-European countries, citing concerns over national security and public safe…",
    "link": "https://www.thestar.com.my/news/world/2025/12/03/us-pauses-all-immigration-applications-from-19-non-european-countries",
    "timestamp": "2025-12-03T02:34:00Z"
  },
  {
    "title": "Winner projected in hotly contested Tennessee special election",
    "description": "Republican Matt Van Epps has been projected as the winner in a highly anticipated special election for Tennessee's 7th Congressional District.This race, which has been watched for months, was initially not expected to be competitive, with President Donald Tru…",
    "link": "https://www.rawstory.com/tennessee-election-2674364270/",
    "timestamp": "2025-12-03T02:30:58Z"
  },
  {
    "title": "Trump-Backed Republican Wins Special Election—But Just Barely",
    "description": "Republican Matt Van Epps narrowly beat Democrat Aftyn Behn in a special election Tuesday night to represent Tennessee 7th congressional district. Van Epps was leading Behn 53.5 percent to 45.5 percent, with 75 percent of votes counted, when NBC News declared …",
    "link": "https://newrepublic.com/post/203880/republican-van-epps-wins-tennessee-house-election",
    "timestamp": "2025-12-03T02:28:39Z"
  },
  {
    "title": "GOP Strategist Spots How Trump Could Have Hurt Republicans In Tennessee",
    "description": "Doug Heye said the president didn't do the one thing he loves to do ahead of the Tennessee special election.",
    "link": "https://www.huffpost.com/entry/gop-strategist-doug-heye-trump-tennessee-special-election_n_692f7849e4b02cf3b1750f83",
    "timestamp": "2025-12-03T02:23:53Z"
  },
  {
    "title": "Republican Matt Van Epps holds deep-red House district in Tennessee special election",
    "description": "Republican Matt Van Epps has won a hotly contested special election for a deep-red congressional seat in Tennessee, NBC News projects, seeing off a Democratic challenge for the longtime GOP district",
    "link": "https://www.nbcnews.com/politics/elections/republican-matt-van-epps-house-district-tennessee-special-election-rcna246846",
    "timestamp": "2025-12-03T02:21:30Z"
  },
  {
    "title": "Trump says National Guard will soon go to New Orleans",
    "description": "U.S. President Donald Trump said Tuesday that National Guard troops will soon head to New Orleans, bringing another federal surge to the city that is already awaiting a separate immigration crackdown expected to begin this week.",
    "link": "https://www.cbc.ca/news/world/trump-new-orleans-national-guard-deployment-9.7000947",
    "timestamp": "2025-12-03T02:19:03Z"
  },
  {
    "title": "'Abuse of legal process': Rep Jamie Raskin blasts Trump DOJ's retribution campaign",
    "description": "Rep. Jamie Raskin, Ranking Member of the House Judiciary Committee, reacts to Donald Trump's Justice Department ...",
    "link": "https://biztoc.com/x/dc52e597b313dd99",
    "timestamp": "2025-12-03T02:14:09Z"
  },
  {
    "title": "‘Democrats Are So Butthurt’: Scott Jennings Tells CNN Why Narrative About Trump’s Health Is Bogus",
    "description": "Scott Jennings pushed back Tuesday night against growing Democratic insinuations about President Donald Trump’s health, saying the entire storyline is bogus.",
    "link": "https://dailycaller.com/2025/12/02/democrats-butthurt-scott-jennings-why-narrative-trump-health-bogus/",
    "timestamp": "2025-12-03T02:13:42Z"
  },
  {
    "title": "US pauses all immigration applications from 19 non-European countries",
    "description": "The list of countries targeted include Afghanistan, Burma, Chad, the Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen",
    "link": "https://www.thehindubusinessline.com/news/world/us-pauses-all-immigration-applications-from-19-non-european-countries/article70351919.ece",
    "timestamp": "2025-12-03T02:11:23Z"
  },
  {
    "title": "Sabrina Carpenter condemns ‘evil’ use of her music in White House video",
    "description": "US pop singer Sabrina Carpenter on Tuesday disavowed the use of one of her songs in a video shared by the White House on social media, describing the clip depicting immigration enforcement raids as “evil and disgusting.” The video, posted Monday, features Car…",
    "link": "https://www.digitaljournal.com/world/sabrina-carpenter-condemns-evil-use-of-her-music-in-white-house-video/article",
    "timestamp": "2025-12-03T02:02:20Z"
  },
  {
    "title": "France’s Macron visits China with Ukraine on the agenda",
    "description": "French President Emmanuel Macron is due in Beijing on Wednesday, where he is expected to put pressure on his Chinese counterpart Xi Jinping to help secure a ceasefire in Ukraine and discuss trade relations. Macron, on fourth state visit to China since taking …",
    "link": "https://www.digitaljournal.com/world/frances-macron-visits-china-with-ukraine-on-the-agenda/article",
    "timestamp": "2025-12-03T02:02:20Z"
  },
  {
    "title": "Sabrina Carpenter condemns ‘evil’ use of her music in White House video",
    "description": "US pop singer Sabrina Carpenter disavowed the use of one of her songs in a video shared by the White House on social media.\nThe post Sabrina Carpenter condemns ‘evil’ use of her music in White House video appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/entertainment/sabrina-carpenter-condemns-evil-use-of-her-music-in-white-house-video/article",
    "timestamp": "2025-12-03T02:02:20Z"
  },
  {
    "title": "Trump may have put admin 'in a box' with recent comments: CNN analyst",
    "description": "President Donald Trump may have put his administration \"in a box\" over the strikes against alleged drug boats in international waters, according to one CNN analyst. The administration has conducted more than 20 strikes against alleged drug dealers and killed …",
    "link": "https://www.rawstory.com/trump-2674364493/",
    "timestamp": "2025-12-03T02:00:59Z"
  },
  {
    "title": "Cocaine, Bribes And Murder: Inside The Accusations Against The Drug Lord Trump Just Pardoned",
    "description": "Honduran President Juan Orlando Hernández was sentenced to 45 years in prison last year for a bribery scheme prosecutors say allowed 400 tons of cocaine into the U.S.",
    "link": "https://www.huffpost.com/entry/honduras-president-hernandez-crimes_n_692f277de4b017c8f3fa7f68",
    "timestamp": "2025-12-03T02:00:47Z"
  },
  {
    "title": "Dollar takes a breather ahead of Fed",
    "description": "The US dollar is steady as other currencies gain ground. Investors anticipate US interest rate cuts by 2026, which could weaken the dollar. Bitcoin has seen a sharp rise, boosting investor risk appetite. The euro is trading higher, while the Japanese yen, ste…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-takes-a-breather-ahead-of-fed/articleshow/125731424.cms",
    "timestamp": "2025-12-03T01:58:49Z"
  },
  {
    "title": "Gold flat as investors await US data for rate-cut signals",
    "description": "Gold prices remained stable on Wednesday, recovering slightly after a previous day's decline. Investors are closely watching upcoming U.S. economic data, including employment figures and inflation gauges, for indications of potential Federal Reserve interest …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-flat-as-investors-await-us-data-for-rate-cut-signals/articleshow/125731393.cms",
    "timestamp": "2025-12-03T01:55:57Z"
  },
  {
    "title": "US judge blocks Trump from cutting Medicaid funding for Planned Parenthood in 22 states (Nate Raymond/Reuters)",
    "description": "Nate Raymond / Reuters:\nUS judge blocks Trump from cutting Medicaid funding for Planned Parenthood in 22 states  —  A federal judge on Tuesday blocked U.S. President Donald Trump's administration from enforcing in 22 states a provision of the Republican's sig…",
    "link": "https://www.memeorandum.com/251202/p161",
    "timestamp": "2025-12-03T01:55:02Z"
  },
  {
    "title": "Trump used a slur against Tim Walz. Many on the right didn’t mind",
    "description": "Much has been made of the fact that after President Donald Trump posted a social media screed about immigrants in which he called Minnesota Gov. Tim Walz “seriously retarded,” a Republican state senator in Indiana, Mike Bohacek, said he was offended by the pr…",
    "link": "https://biztoc.com/x/05ebb54bf9caf94c",
    "timestamp": "2025-12-03T01:54:24Z"
  },
  {
    "title": "Schumer Torches Trump For Pardoning Ex-Honduras President: Shameful And Dangerous",
    "description": "\"You can’t have it both ways,\" the Senate Minority Leader said.",
    "link": "https://www.huffpost.com/entry/schumer-trump-juan-orlando-hernandez-pardon_n_692f7e86e4b02cf3b17519af",
    "timestamp": "2025-12-03T01:52:01Z"
  },
  {
    "title": "CNBC Daily Open: A year-end rally is still on every trader's wishlist",
    "description": "Bitcoin and tech names rallied Tuesday stateside, giving stocks a recovery from the losses in the previous session.",
    "link": "https://www.cnbc.com/2025/12/03/cnbc-daily-open-a-year-end-rally-is-still-on-every-traders-wishlist.html",
    "timestamp": "2025-12-03T01:51:22Z"
  },
  {
    "title": "Tennessee 7th Congressional District (27% Reporting)",
    "description": "Tennessee 7th Congressional District (27% Reporting)  Matt Van Epps (R) - 24,046 (57.2%) ￼ Aftyn Behn (D) - 17,330 (41.2%)",
    "link": "https://freerepublic.com/focus/f-chat/4355691/posts",
    "timestamp": "2025-12-03T01:42:29Z"
  },
  {
    "title": "Minnesota officials defend Somali community against Trump's attacks (Brad Brooks/Reuters)",
    "description": "Brad Brooks / Reuters:\nMinnesota officials defend Somali community against Trump's attacks  —  Officials in Minneapolis on Tuesday said they were not aware of imminent federal immigration raids targeting the area's Somali community, which has come under blist…",
    "link": "https://www.memeorandum.com/251202/p159",
    "timestamp": "2025-12-03T01:40:01Z"
  },
  {
    "title": "Trump hint sends Kevin Hassett Fed chair odds soaring in markets",
    "description": "Trump hasn’t confirmed who he will have replace Fed Chair Jerome Powell with next year, but two recent hints, taken together, point to his crypto-friendly adviser.",
    "link": "https://cointelegraph.com/news/trump-hints-kevin-hassett-next-fed-chair",
    "timestamp": "2025-12-03T01:38:37Z"
  },
  {
    "title": "‘Of No Further Force Or Effect’: Trump Puts Anyone Pardoned By Biden’s Autopen On Notice",
    "description": "President Donald Trump announced actions by former President Joe Biden involving the use of an autopen “null, void, and of no further force or effect.”",
    "link": "https://dailycaller.com/2025/12/02/of-no-further-force-or-effect-trump-puts-anyone-pardoned-by-bidens-autopen-on-notice/",
    "timestamp": "2025-12-03T01:38:29Z"
  },
  {
    "title": "Share Market Highlights: Sensex, Nifty end flat; rupee hits record closing low",
    "description": "Sensex, Nifty updates on 3 December 2025: India’s benchmark indices extended losses for the fourth straight session on Wednesday, weighed down by delays in the US trade deal and a record-low rupee. Sensex closed at 85,106.81, slipping 31.46 points or 0.04%, a…",
    "link": "https://www.thehindubusinessline.com/markets/stock-market-highlights-3-december-2025/article70350013.ece",
    "timestamp": "2025-12-03T01:34:16Z"
  },
  {
    "title": "Trump To Expand Travel Ban As US Tightens Curbs After Shooting",
    "description": "The Trump administration is expected to expand its travel ban to include around 30 countries, a bid to more aggressively curtail migration to the US following last week’s shooting of two National Guard members in Washington.",
    "link": "https://www.ndtvprofit.com/world/trump-to-expand-travel-ban-as-us-tightens-curbs-after-shooting",
    "timestamp": "2025-12-03T01:34:09Z"
  },
  {
    "title": "Football world braces for 2026 World Cup draw with Trump presiding",
    "description": "The draw for the 2026 World Cup -- the biggest edition of football's global showpiece ever held -- takes place in Washington on Friday with US President Donald Trump expected to feature prominently in proceedings.Infantino's close relationship with Trump is w…",
    "link": "https://sports.yahoo.com/articles/football-world-braces-2026-world-013138243.html",
    "timestamp": "2025-12-03T01:31:38Z"
  },
  {
    "title": "The Last Criminal Case Against Trump Has Been Dropped (David A. Graham/The Atlantic)",
    "description": "David A. Graham / The Atlantic:\nThe Last Criminal Case Against Trump Has Been Dropped  —  The U.S. justice and political systems have shown that they can't hold the president and his allies to account for trying to steal the 2020 election.  —  Even today, nea…",
    "link": "https://www.memeorandum.com/251202/p155",
    "timestamp": "2025-12-03T01:30:01Z"
  },
  {
    "title": "Nigeria names former military chief as new defense minister",
    "description": "The nomination of former top general Christopher Musa marks a shakeup of Nigeria's defense department amid a security emergency. Key points\n\n\nPresident Tinubu has nominated former military chief Christopher Musa as the new defense minister\nMusa was sacked as …",
    "link": "https://www.dw.com/en/nigeria-names-former-military-chief-as-new-defense-minister/a-74992569",
    "timestamp": "2025-12-03T01:30:00Z"
  },
  {
    "title": "Tennessee House Special Election Results 2025",
    "description": "Former GOP Rep. Mark Green’s resignation in July triggered a special election for Tennessee’s 7th Congressional District, a longtime Republican seat that President Donald Trump carried by 22 points in the 2024 election. Still, millions of dollars from both pa…",
    "link": "https://freerepublic.com/focus/f-news/4355689/posts",
    "timestamp": "2025-12-03T01:29:01Z"
  },
  {
    "title": "Mark Kelly Reveals ‘Graphic’ and ‘Violent’ Threats He’s Received Since Trump Lashed Out at Him",
    "description": "Mark Kelly said he's received \"graphic\" and \"violent\" threats since President Donald Trump called for him and other Democrats to be arrested and put on trial.\nThe post Mark Kelly Reveals ‘Graphic’ and ‘Violent’ Threats He’s Received Since Trump Lashed Out at …",
    "link": "https://www.mediaite.com/media/tv/mark-kelly-reveals-graphic-and-violent-threats-hes-received-since-trump-lashed-out-at-him/",
    "timestamp": "2025-12-03T01:28:05Z"
  },
  {
    "title": "Honduran ex-president leaves US prison after Trump pardons drug crimes",
    "description": "A former Honduran president convicted of helping to smuggle 400 tons of cocaine into the United States has left prison after being pardoned by President Donald Trump, his wife said Tuesday. Juan Orlando Hernandez was released from a West Virginia prison on Mo…",
    "link": "https://www.digitaljournal.com/world/honduran-ex-president-leaves-us-prison-after-trump-pardons-drug-crimes/article",
    "timestamp": "2025-12-03T01:22:20Z"
  },
  {
    "title": "Trump Says US Land Strikes Against Drug Cartels Likely",
    "description": "US President Donald Trump told reporters that the US military would strike targets on land, including Venezuela and other countries, in efforts to combat drug trafficking.\n\"Anybody that is doing that and selling it into our country is subject to attack,\" Trum…",
    "link": "https://biztoc.com/x/1d4230828bc166aa",
    "timestamp": "2025-12-03T01:20:29Z"
  },
  {
    "title": "Trump and Lula hold phone call to discuss US tariffs on Brazil, sanctions",
    "description": "US president has warmed to Brazil's left-wing leader since imposing 50 percent tariffs on the South American country.",
    "link": "https://www.aljazeera.com/news/2025/12/3/trump-and-lula-hold-phone-call-to-discuss-us-tariffs-on-brazil-sanctions",
    "timestamp": "2025-12-03T01:20:09Z"
  },
  {
    "title": "Trump appears to doze off in another meeting (Washington Post)",
    "description": "Washington Post:\nTrump appears to doze off in another meeting  —  It was the second time in a month Trump has appeared to struggle to stay awake as his advisers have spoken to cameras about the administration's initiatives.  —  Just now … President Donald Tru…",
    "link": "https://www.memeorandum.com/251202/p154",
    "timestamp": "2025-12-03T01:20:00Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,378",
    "description": "These are the key developments from day 1,378 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/12/3/russia-ukraine-war-list-of-key-events-day-1378",
    "timestamp": "2025-12-03T01:18:36Z"
  },
  {
    "title": "C Raja Mohan writes | With Putin in Delhi, an opportunity: With old BFF Russia, go beyond defence",
    "description": "The difficult negotiations over Ukraine open the door to a potential restructuring of relations among the US, Europe, and Russia. But Delhi must first correct the distortion in its Russia policy",
    "link": "https://indianexpress.com/article/opinion/columns/c-raja-mohan-writes-with-putin-in-delhi-an-opportunity-with-old-bff-russia-go-beyond-defence-10398902/",
    "timestamp": "2025-12-03T01:16:35Z"
  }
]