[
  {
    "title": "Investor Bill Ackman: China Isolated After Trump Tariff Reversal Move",
    "description": "Billionaire investor Bill Ackman said on Thursday China was now isolated and other U.S. trading partners were lining up to make deals following President Donald Trump's stunning reversal of his tariff decision.Trump said on Wednesday he would temporarily lowe…",
    "link": "https://freerepublic.com/focus/f-news/4310213/posts",
    "timestamp": "2025-04-10T17:59:14Z"
  },
  {
    "title": "‘This Is Life or Death’: American Mom-and-Pop Businesses Could Still Collapse as China Tariffs Climb; Want 90-Day Pause to ‘Save Christmas’",
    "description": "Many small businesses are still threatened by the trade war facing the United States, even though President Donald Trump suspended most tariffs for 90 days. The escalating tariffs on China have halted imports — and manufacturing — for many American companies,…",
    "link": "https://freerepublic.com/focus/f-news/4310212/posts",
    "timestamp": "2025-04-10T17:59:06Z"
  },
  {
    "title": "Trump Pick Bails After Her ‘Disgust’ Over Jan. 6 Resurfaces",
    "description": "A memo purportedly showing the Trump nominee expressing outrage over how the country hit “rock bottom” on Jan. 6, 2021, only surfaced days ago.",
    "link": "https://www.huffpost.com/entry/trump-pick-to-lead-interior-agency-bails-after-jan-6-criticism-surfaces_n_67f7f856e4b09493c8d87add",
    "timestamp": "2025-04-10T17:58:51Z"
  },
  {
    "title": "American victims of terrorism could soon sue international orgs if Cruz's bill passes",
    "description": "Senator Ted Cruz, R-Texas, is putting forward a new version of legislation he introduced in 2024 that would allow American victims of terrorism to sue international organizations.",
    "link": "https://www.foxnews.com/politics/american-victims-terrorism-could-soon-sue-international-orgs-cruzs-bill-passes",
    "timestamp": "2025-04-10T17:58:45Z"
  },
  {
    "title": "'Meet us halfway': dragon blinks as tariffs on Beijing touch 145%",
    "description": "China urges the U.S. to meet it halfway amidst escalating trade tensions, as Trump's tariffs on Chinese imports reach 145%. Beijing warns of the tariffs' severe impact on the global economy while expressing openness to dialogue. China is also reaching out to …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/meet-us-halfway-dragon-blinks-as-tariffs-on-beijing-touch-145/articleshow/120173074.cms",
    "timestamp": "2025-04-10T17:58:34Z"
  },
  {
    "title": "Top Republicans on Tariffs: Then vs. Now",
    "description": "Some Republicans have changed their tune on tariffs, while others continue opposing the economic policy.",
    "link": "https://www.newsweek.com/republicans-donald-trump-tariffs-then-now-2058169",
    "timestamp": "2025-04-10T17:58:20Z"
  },
  {
    "title": "Finding a little courage",
    "description": "When one branch suppresses and coerces the other two branches, our democracy is in trouble, and this is not good trouble!",
    "link": "https://www.ncspin.com/finding-a-little-courage",
    "timestamp": "2025-04-10T17:58:17Z"
  },
  {
    "title": "EXCLUSIVE: MAGA World Fires Up New One-Stop Shop Consulting Firm",
    "description": "Several long-time Trump loyalists created a new all-around consulting firm to help propel GOP candidates to political victory in the upcoming election cycle.",
    "link": "https://dailycaller.com/2025/04/10/maga-trump-american-made-media-company-consulting-mail-campaign-white-house/",
    "timestamp": "2025-04-10T17:58:13Z"
  },
  {
    "title": "‘She Was So Bad’: Mark Halperin And Sean Spicer Team Up To Cast Doubt On Gretchen Whitmer’s Presidential Prospects",
    "description": "Mark Halperin and Sean Spicer cast doubt on Democratic Michigan Gov. Gretchen Whitmer's 2028 presidential prospects after her Wednesday public appearances.",
    "link": "https://dailycaller.com/2025/04/10/she-was-so-bad-mark-halperin-and-sean-spicer-team-up-to-cast-doubt-on-gretchen-whitmers-presidential-prospects/",
    "timestamp": "2025-04-10T17:57:10Z"
  },
  {
    "title": "As TikTok Shop’s fate remains in balance, social commerce gains traction",
    "description": "The social media app with its popular e-commerce feature is in a state of suspense after a ban was once again delayed. Here’s a look at what this means for retail and how experts feel brands should respond.",
    "link": "https://www.retaildive.com/news/as-tiktok-shops-fate-remains-in-balance-social-commerce-gains-traction/745048/",
    "timestamp": "2025-04-10T17:57:00Z"
  },
  {
    "title": "This is just the beginning: Amazon boss Andy Jassy warns Trump’s tariffs could hit every American wallet harder than ever expected",
    "description": "Amazon CEO Andy Jassy warned customers to anticipate higher prices due to tariffs imposed during Donald Trump's presidency. With 70% of Amazon's goods originating from China, the company expects third-party sellers to pass increased costs onto consumers. Some…",
    "link": "https://economictimes.indiatimes.com/news/international/us/this-is-just-the-beginning-amazon-boss-andy-jassy-warns-trumps-tariffs-could-hit-every-american-wallet-harder-than-ever-expected/articleshow/120171458.cms",
    "timestamp": "2025-04-10T17:56:03Z"
  },
  {
    "title": "Andrew Jackson was no protectionist",
    "description": "We would be better off if Trump would follow Andrew Jackson's lead.",
    "link": "https://www.ncspin.com/andrew-jackson-was-no-protectionist",
    "timestamp": "2025-04-10T17:55:55Z"
  },
  {
    "title": "Trump: China Manipulating Currency to Offset Tariffs",
    "description": "President Donald Trump on Tuesday accused China of manipulating its currency to offset the impact of U.S. tariffs.\"You got to hand it to them. They're manipulating their currency today as an offset against the tariffs,\" Trump said at an event at the National …",
    "link": "https://freerepublic.com/focus/f-news/4310211/posts",
    "timestamp": "2025-04-10T17:55:39Z"
  },
  {
    "title": "Trump Loses Bid to End 'Central Park Five' Defamation Lawsuit (Zoe Tillman/Bloomberg)",
    "description": "Zoe Tillman / Bloomberg:\nTrump Loses Bid to End ‘Central Park Five’ Defamation Lawsuit  —  A federal judge denied President Donald Trump's request to dismiss a lawsuit over comments he made last year about five men who were wrongly convicted in the 1989 jogge…",
    "link": "https://www.memeorandum.com/250410/p89",
    "timestamp": "2025-04-10T17:55:01Z"
  },
  {
    "title": "Adam Schiff Says Trump Should Face Insider Trading Inquiry Amid Tariff Actions",
    "description": "“Who in the administration knew about Trump's latest tariff flip flop ahead of time?” Schiff asked.",
    "link": "https://truthout.org/articles/adam-schiff-says-trump-should-face-insider-trading-inquiry-amid-tariff-actions/",
    "timestamp": "2025-04-10T17:55:00Z"
  },
  {
    "title": "Legal Status of Over 50 Students Revoked at Texas Universities As Trump Crackdown Escalates",
    "description": "Over 50 international students from Texas universities have seen their legal status revoked",
    "link": "https://www.ibtimes.com/legal-status-over-50-students-revoked-texas-universities-trump-crackdown-escalates-3769617",
    "timestamp": "2025-04-10T17:54:39Z"
  },
  {
    "title": "Former U.K. spy chief has advice for Trump: Go slow on Ukraine, if you want the Nobel",
    "description": "Former MI6 chief Sir Richard Dearlove says that if President Donald Trump wants a Nobel Peace Prize he should hold off negotiating a Russia-Ukraine ceasefire.",
    "link": "https://www.nbcnews.com/news/world/ukraine-russia-ceasefire-deal-trump-nobel-prize-richard-dearlove-rcna200568",
    "timestamp": "2025-04-10T17:54:01Z"
  },
  {
    "title": "Rubio says direct US-Iran talks to take place Saturday",
    "description": "WASHINGTON (Reuters) - U.S. Secretary of State Marco Rubio said on Thursday the United States will hold direct talks with Iran on Saturday to discuss Iran's nuclear program. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/11/rubio-says-direct-us-iran-talks-to-take-place-saturday",
    "timestamp": "2025-04-10T17:54:00Z"
  },
  {
    "title": "President orders investigation of ‘Anonymous’ secrets leaker",
    "description": "Deep Stater boasted during Trump's 1st term of undermining duly elected leader",
    "link": "https://www.wnd.com/2025/04/president-orders-investigation-of-anonymous-secrets-leaker/",
    "timestamp": "2025-04-10T17:52:37Z"
  },
  {
    "title": "'He should be in a padded room playing with his own drool': The View hosts bash Trump",
    "description": "\"The View\" began Thursday with one co-host gesticulating wildly to express the chaos seen from the White House for the past few weeks. \"Things have been happening like this,\" said Whoopi Goldberg, discussing the twist in President Donald Trump's trade war. Sh…",
    "link": "https://www.rawstory.com/trump-tariffs-2671741588/",
    "timestamp": "2025-04-10T17:52:25Z"
  },
  {
    "title": "US is 'close to getting hostages in Gaza back,' Trump says",
    "description": "US President Donald Trump told reporters on Thursday that his administration was \"dealing with Israel and Hama",
    "link": "https://www.jpost.com/breaking-news/article-849754",
    "timestamp": "2025-04-10T17:52:21Z"
  },
  {
    "title": "Tennis legend Martina Navratilova asks Dems what they're 'willing to give up for men who identify as trans'",
    "description": "Tennis legend Martina Navratilova posed a question to Democrats over the issue of transgender inclusion in girls' and women's sports over the last few years.",
    "link": "https://www.foxnews.com/sports/tennis-legend-martina-navratilova-asks-dems-what-theyre-willing-give-up-men-who-identify-trans",
    "timestamp": "2025-04-10T17:52:18Z"
  },
  {
    "title": "Joby Aviation, Inc. (JOBY): Among Stocks Insiders Sold in April After Trump’s Tariff Rollout",
    "description": "We recently published a list of 10 Stocks Insiders Sold in April After Trump’s Tariff Rollout. In this article, we are going to take a look at where Joby...",
    "link": "https://finance.yahoo.com/news/joby-aviation-inc-joby-among-175130727.html",
    "timestamp": "2025-04-10T17:51:30Z"
  },
  {
    "title": "Under Trump, Egg Prices Smash Record for Third Straight Month",
    "description": "For the third straight month, U.S retail egg prices have hit a record high, despite falling wholesale prices, no bird flu outbreaks, and President Donald Trump's campaign promises—and recent misleading claims.\n\nOn Thursday, the U.S. Bureau of Labor Statistics…",
    "link": "https://www.commondreams.org/news/record-egg-prices",
    "timestamp": "2025-04-10T17:50:58Z"
  },
  {
    "title": "Fed's Goolsbee: Rate cuts still possible if economy gets back on track",
    "description": "Interest rate cuts remain possible at some point, but uncertainty related to huge changes in U.S. trade policy make it hard to know how the economy will fare...",
    "link": "https://finance.yahoo.com/news/feds-goolsbee-rate-cuts-still-175043772.html",
    "timestamp": "2025-04-10T17:50:43Z"
  },
  {
    "title": "‘Bobby, How Do You Feel About That?’ Trump Asks RFK Jr. to Weigh in on ‘Very Personal’ Release of His Father’s Assassination Files",
    "description": "Donald Trump asked HHS Secretary Robert F. Kennedy Jr. to weigh in on the release of government files pertaining to the assassination of his father.\nThe post ‘Bobby, How Do You Feel About That?’ Trump Asks RFK Jr. to Weigh in on ‘Very Personal’ Release of His…",
    "link": "https://www.mediaite.com/trump/bobby-how-do-you-feel-about-that-trump-asks-rfk-jr-to-weigh-in-on-very-personal-release-of-his-fathers-assassination-files/",
    "timestamp": "2025-04-10T17:49:42Z"
  },
  {
    "title": "Congress Is Still Trying to Wrest Back Trade Authority From Trump",
    "description": "But it will likely take far more economic damage to reverse decades of trade delegation.",
    "link": "http://foreignpolicy.com/2025/04/10/congress-trade-trump-tariffs-economics/",
    "timestamp": "2025-04-10T17:49:27Z"
  },
  {
    "title": "Wall Street loses more than half of Wednesday's historic surge as US-China trade tensions escalate",
    "description": "U.S. stocks are surrendering a chunk of their historic gains from the day before as President Donald Trump’s trade war continues to confuse and threaten the economy, even if its temperature has cooled a bit.",
    "link": "https://www.clickondetroit.com/business/2025/04/10/japans-benchmark-nikkei-225-shoots-up-in-early-trading-gaining-more-than-2000-points/",
    "timestamp": "2025-04-10T17:48:54Z"
  },
  {
    "title": "Donald Trump bends to the power of the markets",
    "description": "But trade war with China and tariffs on most US imports still risk great harm",
    "link": "https://biztoc.com/x/716a9cd72ef09c54",
    "timestamp": "2025-04-10T17:48:40Z"
  },
  {
    "title": "The Trump Administration Is Turning Science Against Itself",
    "description": "In addition to firing researchers and pulling funds, the Trump administration is also inverting science.",
    "link": "https://www.wired.com/story/trump-administration-science/",
    "timestamp": "2025-04-10T17:48:37Z"
  },
  {
    "title": "Rimini Street, Inc. (RMNI): Among Stocks Insiders Sold in April After Trump’s Tariff Rollout",
    "description": "We recently published a list of 10 Stocks Insiders Sold in April After Trump’s Tariff Rollout. In this article, we are going to take a look at where Rimini...",
    "link": "https://finance.yahoo.com/news/rimini-street-inc-rmni-among-174836218.html",
    "timestamp": "2025-04-10T17:48:36Z"
  },
  {
    "title": "Former Air Force Secretary: If You Are Not Alarmed by Gen. Timothy Haugh's Removal, You Should Be | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nYou may have missed it amid a flurry of news about President Donald Trump's disastrous \"Liberation Day,\" which sent stock markets into a tailspin and sparked fears of a recession. But late last week, Trump mad…",
    "link": "https://biztoc.com/x/e46326622657da3c",
    "timestamp": "2025-04-10T17:48:34Z"
  },
  {
    "title": "EU to announce verdict in Apple & Meta antitrust cases in coming weeks",
    "description": "The European Union (EU) is all set to announce verdicts in the antitrust cases against Apple and Meta in the coming weeks.",
    "link": "https://www.androidheadlines.com/2025/04/eu-announce-verdict-apple-meta-antitrust-cases.html",
    "timestamp": "2025-04-10T17:48:03Z"
  },
  {
    "title": "Trump ends Biden-era water regulations to ‘make America’s showers great again’",
    "description": "Trump has signed an executive order directing the Secretary of Energy to rescind a \"complicated\" rule that limited water output in households appliances.",
    "link": "https://www.foxnews.com/politics/trump-ends-biden-era-water-regulations-make-americas-showers-great-again",
    "timestamp": "2025-04-10T17:47:43Z"
  },
  {
    "title": "China reaches out to other nations as Trump layers on tariffs",
    "description": "China is reaching out to other nations as the U.S. layers on tariffs, in what appears to be an attempt by Beijing to form a united front to compel Washington to retreat.",
    "link": "https://www.pbs.org/newshour/world/china-reaches-out-to-other-nations-as-trump-layers-on-tariffs",
    "timestamp": "2025-04-10T17:47:08Z"
  },
  {
    "title": "Trump praises Dem Gov. Gretchen Whitmer after slamming her last year: 'Very good person'",
    "description": "President Donald Trump praised Michigan Gov. Gretchen Whitmer this week after slamming her last year as a \"terrible governor.\"",
    "link": "https://www.foxnews.com/politics/trump-praises-dem-gov-gretchen-whitmer-after-slamming-her-last-year-very-good-person",
    "timestamp": "2025-04-10T17:46:50Z"
  },
  {
    "title": "LA County homeless spending under the microscope of newly appointed US attorney",
    "description": "Newly appointed U.S. Attorney Bill Essayli has launched a federal task force to investigate billions in unaccounted homeless funds in Los Angeles County.",
    "link": "https://www.foxnews.com/us/la-county-homeless-spending-under-microscope-newly-appointed-us-attorney",
    "timestamp": "2025-04-10T17:46:28Z"
  },
  {
    "title": "Former Air Force Secretary: If You Are Not Alarmed by Gen. Timothy Haugh's Removal, You Should Be | Opinion",
    "description": "The move to install leadership loyal to President Donald Trump personally at NSA and CYBERCOM is one more disturbing part of the Trump administration's pattern of abuse of power, coercion, and disregard for the rule of law.",
    "link": "https://www.newsweek.com/former-air-force-secretary-if-you-are-not-alarmed-gen-timothy-haughs-removal-you-should-2058170",
    "timestamp": "2025-04-10T17:46:05Z"
  },
  {
    "title": "Apple has few incentives to start making iPhones in US, despite Trump's trade war with China",
    "description": "Despite Trump's tariffs aiming to push Apple to manufacture iPhones in the U.S., experts say it's unlikely due to high costs, complex supply chains, and labor challenges. Shifting production could triple iPhone prices, hurt sales, and isn’t feasible before at…",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-has-few-incentives-to-start-making-iphones-in-us-despite-trumps-trade-war-with-china/articleshow/120172618.cms",
    "timestamp": "2025-04-10T17:44:16Z"
  },
  {
    "title": "Inside Trump’s decision to pause most tariffs — and turn up heat on China — to lock in better trade deals for US",
    "description": "The idea of scaling back eye-watering \"reciprocal\" tariffs rattled around President Trump's head for several days after the April 2 \"Liberation Day\" announcement.",
    "link": "https://nypost.com/2025/04/10/us-news/how-trump-decided-to-pause-most-tariffs-and-turn-up-heat-on-china/",
    "timestamp": "2025-04-10T17:44:11Z"
  },
  {
    "title": "How To Defend Democracy with Color Revolutions",
    "description": "Translating demoralization agent Norm Eisen's doublespeak in \"Democracy Playbook 2025\" - why did Chief Justice John Roberts spend a week living with him? Comrades: Norm Eisen is orchestrating color revolutions in plain sight. In January, he published \"Democra…",
    "link": "https://freerepublic.com/focus/f-chat/4310209/posts",
    "timestamp": "2025-04-10T17:43:45Z"
  },
  {
    "title": "nCino, Inc. (NCNO): Among Stocks Insiders Sold in April After Trump’s Tariff Rollout",
    "description": "We recently published a list of 10 Stocks Insiders Sold in April After Trump’s Tariff Rollout. In this article, we are going to take a look at where nCino...",
    "link": "https://finance.yahoo.com/news/ncino-inc-ncno-among-stocks-174319615.html",
    "timestamp": "2025-04-10T17:43:19Z"
  },
  {
    "title": "House passes bill targeting noncitizen voting - already illegal in federal elections - in Trump-aligned push | CNN Politics",
    "description": "The House passed a Republican-led bill Thursday to require documentary proof of US citizenship to register to vote in federal elections, despite the fact that it is already illegal for noncitizens to vote in federal elections.",
    "link": "https://www.cnn.com/2025/04/10/politics/save-act-noncitizen-voting-bill-house/index.html",
    "timestamp": "2025-04-10T17:42:52Z"
  },
  {
    "title": "'Republicans have put themselves in a bind' with budget plan: MSNBC's Ryan Noble​s",
    "description": "MSNBC's Ryan Nobles on Thursday said that congressional Republicans have made things more difficult for themselves as they move to try to pass President Donald Trump's budget package.After Republicans in the House of Representatives successfully passed a blue…",
    "link": "https://www.rawstory.com/republicans-budget-2671742196/",
    "timestamp": "2025-04-10T17:42:01Z"
  },
  {
    "title": "Mid-America Apartment Communities (MAA): Among Stocks Insiders Sold in April After Trump’s Tariff Rollout",
    "description": "We recently published a list of 10 Stocks Insiders Sold in April After Trump’s Tariff Rollout. In this article, we are going to take a look at where Mid...",
    "link": "https://finance.yahoo.com/news/mid-america-apartment-communities-maa-174108372.html",
    "timestamp": "2025-04-10T17:41:08Z"
  },
  {
    "title": "The House passed a requirement to prove US citizenship to vote. This is how it could affect voting",
    "description": "The SAVE Act now heads to the Senate.",
    "link": "https://www.denverpost.com/2025/04/10/congress-elections-save-act/",
    "timestamp": "2025-04-10T17:40:56Z"
  },
  {
    "title": "The House passed a requirement to prove US citizenship to vote. This is how it could affect voting",
    "description": "The SAVE Act now heads to the Senate.",
    "link": "https://www.bostonherald.com/2025/04/10/congress-elections-save-act/",
    "timestamp": "2025-04-10T17:40:56Z"
  },
  {
    "title": "Trump’s tariffs ‘pause’ could help Nintendo ship more Switch 2s",
    "description": "President Donald Trump’s “90-day pause” on high tariffs for many countries could be good news for Nintendo. The shift marks an opportunity for the company to ship more Switch 2 units from Vietnam to the US. And customs data reported on by Bloomberg suggests t…",
    "link": "https://www.theverge.com/news/646693/trump-tariffs-pause-nintendo-switch-2",
    "timestamp": "2025-04-10T17:39:25Z"
  },
  {
    "title": "Billionaires dream of building utopian techno-city in Greenland",
    "description": "The 'freedom city' is the latest effort to create stateless cities with minimal corporate regulation.\nThe post Billionaires dream of building utopian techno-city in Greenland appeared first on Popular Science.",
    "link": "https://www.popsci.com/technology/billionaire-freedom-city-greenland/",
    "timestamp": "2025-04-10T17:38:39Z"
  },
  {
    "title": "Israel fears 'real danger' Trump may strike mediocre nuke deal with Iran",
    "description": "Top Israeli sources warned the Post that Trump may circumscribe the IDF’s current unique opportunity to strike the Islamic Republic's nuclear program.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-849751",
    "timestamp": "2025-04-10T17:37:33Z"
  },
  {
    "title": "Donald Trump Acknowledges 'Transition Problems' As Tariffs Roil Wall Street",
    "description": "As Trump and the cabinet met, U.S. stocks tumbled again Thursday, giving back a significant portion of the historic gains.",
    "link": "https://biztoc.com/x/9426ded72b311bcc",
    "timestamp": "2025-04-10T17:37:02Z"
  },
  {
    "title": "Trump Congratulates House for Passing Budget Resolution, Paving Way for $1.5T in Spending Cuts",
    "description": "President Donald Trump congratulated the House Republicans for passing a budget resolution Thursday, which moves his agenda forward.",
    "link": "https://www.westernjournal.com/trump-congratulates-house-passing-budget-resolution-paving-way-1-5t-spending-cuts/",
    "timestamp": "2025-04-10T17:35:33Z"
  },
  {
    "title": "Trump’s World Liberty Financial Denies Selling Off Ethereum Stash",
    "description": "On-chain data suggested earlier this week that a wallet “closely tied” to the project began selling off millions in ETH at the peak of tariff-related market panic.",
    "link": "https://decrypt.co/314367/trump-world-liberty-financial-denies-selling-ethereum",
    "timestamp": "2025-04-10T17:35:24Z"
  },
  {
    "title": "Florida brings charges against a man jailed on federal counts of trying to assassinate Trump",
    "description": "Florida's attorney general says his office will bring terrorism and attempted murder counts against a man already jailed on federal charges of attempting to assassinate then-presidential candidate Donald Trump while he was golfing last fall",
    "link": "https://www.wftv.com/news/politics/florida-brings/XSFFPP3PLBC7FF3VG3X2H3OBNM/",
    "timestamp": "2025-04-10T17:35:12Z"
  },
  {
    "title": "Pete Hegseth reviews plans for space-based 'Golden Dome' US defense system",
    "description": "President Donald Trump's plans for the space-based \"Golden Dome\" missile defense system to defend the United States has been sent to Defense Secretary Pete Hegseth's desk for review. Trump has previously spoken about making a missile defense system similar to…",
    "link": "https://freerepublic.com/focus/f-news/4310205/posts",
    "timestamp": "2025-04-10T17:35:03Z"
  },
  {
    "title": "The TV Show Host Who's Now In Charge Of Medicare Wants To Replace Doctors With AI",
    "description": "Who among us hasn't indulged in the daytime TV schlock of personalities like Dr. Phil, Jerry Springer, or Judge Judy. Sure it's mildly exploitative, sure it's chock full of scammy product placement, but hey, it's not like these guys are in charge of federal p…",
    "link": "https://futurism.com/dr-oz-medicare-ai",
    "timestamp": "2025-04-10T17:33:23Z"
  },
  {
    "title": "Trump nominee for public lands post withdraws after her criticism of Jan. 6 Capitol attack surfaces",
    "description": "BILLINGS, Mont. (AP) — President Donald Trump’s nominee to oversee an agency that manages a quarter-billion acres of public land has withdrawn her nomination following revelations that she criticized the Republican president in 2021 for inciting the Jan. 6 at…",
    "link": "https://financialpost.com/pmn/trump-nominee-for-public-lands-post-withdraws-after-her-criticism-of-jan-6-capitol-attack-surfaces",
    "timestamp": "2025-04-10T17:32:37Z"
  },
  {
    "title": "Tariffs, trade war inflation impact to be 'pretty ugly' by summer, economists say",
    "description": "Tariffs will take a few months to filter through to consumer prices, economists said.",
    "link": "https://www.cnbc.com/2025/04/10/tariffs-trade-war-inflation-impact-to-be-pretty-ugly-by-summer.html",
    "timestamp": "2025-04-10T17:32:13Z"
  },
  {
    "title": "Amazon CEO Andy Jassy Sees Tariffs Raising Prices For Consumers As Media Stocks, Markets Fall",
    "description": "Amazon chief executive Andrew Jassy says “I’m guessing sellers will pass that cost on” as President Donald Trump raises the price to import good into the U.S. He made the comments on CNBC as media stocks and jittery markets reversed Tuesday’s gains with a big…",
    "link": "http://deadline.com/2025/04/amazon-ceo-andy-jassy-tariffs-raise-prices-consumers-media-stocks-1236365587/",
    "timestamp": "2025-04-10T17:31:16Z"
  },
  {
    "title": "US suspends additional 26 pc tariff on India till July 9: White House",
    "description": "NEW DELHI: The US has announced the suspension of additional tariffs on India for 90 days until July 9 this year, according to the White House executive orders. On April 2, US President Donald Trump slapped universal duties on about 60 countries exporting goo…",
    "link": "https://statetimes.in/us-suspends-additional-26-pc-tariff-on-india-till-july-9-white-house/",
    "timestamp": "2025-04-10T17:31:00Z"
  },
  {
    "title": "Lessons Trump could learn from the last Soviet leader",
    "description": "Trying to salvage and empower an empire in decline, only to end up hastening its demise – we’ve seen that somewhere before Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615548-trump-tariffs-gorbachev-common/",
    "timestamp": "2025-04-10T17:30:58Z"
  },
  {
    "title": "WATCH: Biden Dozed Near Pool During Debate Prep, Author Says",
    "description": "Former president Joe Biden fell asleep poolside during a prep session ahead of his disastrous June debate with Donald Trump, according to the author of a new book on the 2024 election.\nThe post WATCH: Biden Dozed Near Pool During Debate Prep, Author Says appe…",
    "link": "https://freebeacon.com/latest-news/watch-biden-dozed-near-pool-during-debate-prep-author-says/",
    "timestamp": "2025-04-10T17:30:54Z"
  },
  {
    "title": "Small business angst is rising amid Trump's tariffs and spending cuts (Katherine Hapgood/Politico)",
    "description": "Katherine Hapgood / Politico:\nSmall business angst is rising amid Trump's tariffs and spending cuts  —  Uncertainty is growing on Main Street as tariffs roil the economy and the Trump administration moves to cut small business programs.  —  President Donald T…",
    "link": "https://www.memeorandum.com/250410/p83",
    "timestamp": "2025-04-10T17:30:00Z"
  },
  {
    "title": "Trump 'Insider Trading' Scandal: How The Don Is Facing Stock Market Manipulation Accusations After Declaring It Was 'A Great Time to Buy' Following Tariff Trade War U-Turn",
    "description": "Donald Trump is now being accused of manipulating the stock market, after he encouraged people to buy some amid the tariffs increase – before changing his mind.",
    "link": "https://radaronline.com/p/trump-insider-trading-stock-market-manipulation-tariff-trade-war/",
    "timestamp": "2025-04-10T17:30:00Z"
  },
  {
    "title": "Meme after meme: China targets Donald Trump and his advisers with AI war to counter tariffs; here are some causing a sensation",
    "description": "Trump tariffs spark China meme war as Beijing fires back with hilarious, AI-style videos mocking Trump, Elon Musk, and JD Vance over rising tariffs. From factory worker memes to inflated MAGA hat prices, China is using viral content to hit back at America’s t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/meme-after-meme-china-targets-donald-trump-and-his-advisers-with-ai-war-to-counter-tariffs-here-are-some-causing-a-sensation/articleshow/120171743.cms",
    "timestamp": "2025-04-10T17:29:37Z"
  },
  {
    "title": "Biden official's criticism of Trump so strong that it 'led to an additional sell-off': CNN",
    "description": "Former treasury secretary Janet Yellen denounced president Donald Trump's tariffs and identified the reason she believes that he backed down from most of them.The president's sweeping, so-called reciprocal tariffs went into effect Wednesday against global tra…",
    "link": "https://www.rawstory.com/janet-yellen-china-tariffs/",
    "timestamp": "2025-04-10T17:29:18Z"
  },
  {
    "title": "Could Trump strike a nuclear deal with Tehran?",
    "description": "Government officials are growing more concerned that the US president will strike a deal with Iran without considering Israeli interests.",
    "link": "https://www.jpost.com/israel-news/article-849748",
    "timestamp": "2025-04-10T17:28:53Z"
  },
  {
    "title": "How Top Performing Companies Handle Tech Investment",
    "description": "Also in the Forbes CIO newsletter: Introducing the AI 50, tariffs undermine AI infrastructure, Adobe’s AI agents presented to empower creativity.",
    "link": "https://www.forbes.com/sites/cio/2025/04/10/how-top-performing-companies-handle-tech-investment/",
    "timestamp": "2025-04-10T17:28:47Z"
  },
  {
    "title": "Does the ‘Emergency Legislation’ allow Donald Trump to impose tariffs and can US Supreme Court reverse it? Here’s what legal experts say",
    "description": "Amid growing criticism, Trump announced a temporary halt on most tariffs, keeping a 10% baseline rate while proceeding with the 125% tariff on Chinese imports.",
    "link": "https://economictimes.indiatimes.com/news/international/us/does-the-emergency-legislation-allow-donald-trump-to-impose-tariffs-and-can-us-supreme-court-reverse-it-heres-what-legal-experts-say/articleshow/120171855.cms",
    "timestamp": "2025-04-10T17:26:40Z"
  },
  {
    "title": "Florida Business Sues Donald Trump Over Tariffs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA Florida stationary company is suing president Trump for his China tariffs.\nWhy It Matters\nTrump has imposed 125 percent tariffs on Chinese goods, and on March 10, China retaliated with 84 percent tariffs on …",
    "link": "https://biztoc.com/x/f882f02e796d9cfb",
    "timestamp": "2025-04-10T17:26:39Z"
  },
  {
    "title": "The Brief – Give the world what it so craves, Eurobonds",
    "description": "Now is the time to show the world that Europe can be trusted.",
    "link": "https://www.euractiv.com/section/politics/opinion/the-brief-give-the-world-what-it-so-craves-eurobonds/",
    "timestamp": "2025-04-10T17:26:38Z"
  },
  {
    "title": "Danger in Trump’s Mind",
    "description": "On 7 April, a Mondoweiss headline ran as: “Trump announces surprise Iran talks during Netanyahu meeting.”\nUnited States president Donald Trump had met with Israeli prime minister Benjamin Netanyahu to discuss “Gaza, tariffs, and the alleged nuclear threat of …",
    "link": "https://www.globalresearch.ca/danger-trump-mind/5884105",
    "timestamp": "2025-04-10T17:26:21Z"
  },
  {
    "title": "Donald Trump Acknowledges 'Transition Problems' As Tariffs Roil Wall Street",
    "description": "As Trump and the cabinet met, U.S. stocks tumbled again Thursday, giving back a significant portion of the historic gains.",
    "link": "https://www.newsweek.com/donald-trump-acknowledges-transition-problems-tariffs-roil-wall-street-2058163",
    "timestamp": "2025-04-10T17:26:08Z"
  },
  {
    "title": "BEST WEEK EVER: Trump Frees Hottest US Hostage After Winning Trade War, Making Showers Great Again (PHOTOS)",
    "description": "President Donald Trump is having one of the best weeks of his presidency. The stock market surged on Wednesday after Trump declared victory against unfair trade practices. He also ended the Obama-Biden \"war on water pressure\" and \"make America's showers great…",
    "link": "https://freebeacon.com/politics/best-week-ever-trump-frees-hottest-us-hostage-after-winning-trade-war-making-showers-great-again-photos/",
    "timestamp": "2025-04-10T17:25:52Z"
  },
  {
    "title": "Florida Business Sues Donald Trump Over Tariffs",
    "description": "The company, which makes stylized planners and notebooks, says the Trump tariffs will cost it hundreds of thousands of dollars a year",
    "link": "https://www.newsweek.com/president-donald-trump-china-tariffs-florida-company-lawsuit-imports-2058109",
    "timestamp": "2025-04-10T17:24:33Z"
  },
  {
    "title": "Justice Department restored Mel Gibson's gun rights? Here's what we know",
    "description": "The actor lost his right to own a firearm following a 2011 battery conviction.",
    "link": "https://www.snopes.com//news/2025/04/10/mel-gibson-gun-rights-justice-department/",
    "timestamp": "2025-04-10T17:24:00Z"
  },
  {
    "title": "Video shows 4 captive Ukrainian troops killed by men identified as Russian forces",
    "description": "Ukrainian prosecutors and U.N. officials say killings of Ukrainian POWs have surged.",
    "link": "https://www.bostonherald.com/2025/04/10/russia-ukraine-pow-killings/",
    "timestamp": "2025-04-10T17:23:27Z"
  },
  {
    "title": "Fact-checking Trump’s previous claim he wasn’t looking at pausing tariffs",
    "description": "For two days, Trump and the White House denied that he was considering changing his tariff plan, before doing just that on April 9.",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-trumps-previous-claim-he-wasnt-looking-at-pausing-tariffs",
    "timestamp": "2025-04-10T17:22:37Z"
  },
  {
    "title": "Usha Vance Is Apparently Loving Her New Role, Kennedy Center Boos and All",
    "description": "In her first interview since becoming second lady, Vance tells the Free Press that despite life being “lonely” and “very strange,” her political experience has been “almost uniformly positive.”",
    "link": "https://www.vanityfair.com/style/story/usha-vance-second-lady-free-press-interview",
    "timestamp": "2025-04-10T17:22:17Z"
  },
  {
    "title": "1st LD-Writethru: EU, UAE to start free trade talks: EU chief",
    "description": "BRUSSELS, April 10 (Xinhua) -- The European Union (EU) and the United Arab Emirates (UAE) have agreed to kick off free trade negotiations, European Commission President Ursula von der Leyen said on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/11/1st-ld-writethru-eu-uae-to-start-free-trade-talks-eu-chief",
    "timestamp": "2025-04-10T17:22:00Z"
  },
  {
    "title": "US efforts to secure release of American-Israeli hostage from Hamas fall short",
    "description": "Officials from the Trump administration met with Hamas representatives, going against the US policy of not engaging directly with the terrorist organization.",
    "link": "https://www.jpost.com/international/article-849706",
    "timestamp": "2025-04-10T17:21:36Z"
  },
  {
    "title": "Ottawa said to plan meeting with U.S. banks after Trump complaints",
    "description": "The Canadian government has invited representatives from United States banks including JPMorgan Chase & Co. for a meeting, according to people with knowledge of the matter, after U.S. President Donald Trump complained that American banks have trouble doing bu…",
    "link": "https://financialpost.com/pmn/business-pmn/canadian-officials-said-to-plan-meeting-with-us-banks-after-trump-complaints",
    "timestamp": "2025-04-10T17:20:37Z"
  },
  {
    "title": "Ottawa said to plan meeting with U.S. banks after Trump complaints",
    "description": "Ottawa has invited representatives from U.S. banks for a meeting after Donald Trump's complaints about doing business in Canada. Read more.",
    "link": "https://financialpost.com/pmn/business-pmn/ottawa-meeting-us-banks-donald-trump-complaints",
    "timestamp": "2025-04-10T17:20:37Z"
  },
  {
    "title": "The Wall Street Journal Twists the Knife After Trump Tariff Retreat: ‘The Biggest Threat to the World Economy’",
    "description": "The Wall Street Journal slammed President Donald Trump's trade policy in a scathing editorial celebrating his partial retreat on Wednesday.\nThe post The Wall Street Journal Twists the Knife After Trump Tariff Retreat: ‘The Biggest Threat to the World Economy’…",
    "link": "https://www.mediaite.com/news/the-wall-street-journal-twists-the-knife-after-trump-tariff-retreat-the-biggest-threat-to-the-world-economy/",
    "timestamp": "2025-04-10T17:19:54Z"
  },
  {
    "title": "Nvidia Stock Could Fall If 125% China Tariff Drives Price Increases",
    "description": "One thing contributing to the drop is the 2024 election which brought Donald Trump back to the Oval Office. Trump's 125% tariff on China could raise Nvidia's prices.",
    "link": "https://www.forbes.com/sites/petercohan/2025/04/10/nvidia-stock-could-fall-if-125-china-tariff-drives-price-increases/",
    "timestamp": "2025-04-10T17:18:29Z"
  },
  {
    "title": "Trump tariff hike brings added China rate for many goods to 145%",
    "description": "WASHINGTON: US President Donald Trump's steep tariff hike targeting Chinese goods, which took effect Thursday (Apr 10), brings Washington's addi",
    "link": "https://www.channelnewsasia.com/world/trump-tariff-hike-brings-added-china-rate-many-goods-145-5057991",
    "timestamp": "2025-04-10T17:18:20Z"
  },
  {
    "title": "Sticker Mule scrubs pro-Trump posts from Instagram",
    "description": "Sticker Mule, an online sticker merchandising firm that blew up in the public eye with a blast email to its entire customer base following an assassination attempt on President Donald Trump, appears to have cleared its Instagram account of any political suppo…",
    "link": "https://www.dailydot.com/debug/sticker-mule-trump-instagram/",
    "timestamp": "2025-04-10T17:18:10Z"
  },
  {
    "title": "European stocks rally closes off highs as selling resumes on Wall Street",
    "description": "Relief sees markets ‘mechanically rebound’ across continent",
    "link": "https://www.irishtimes.com/business/2025/04/10/european-stocks-rally-closes-off-highs-as-selling-resumes-on-wall-street/",
    "timestamp": "2025-04-10T17:17:20Z"
  },
  {
    "title": "Florida brings charges against a man jailed on federal counts of trying to assassinate Trump",
    "description": "Ryan Routh is facing additional state terrorism and attempted murder charges.",
    "link": "https://www.bostonherald.com/2025/04/10/trump-shooting-attempt-florida/",
    "timestamp": "2025-04-10T17:16:44Z"
  },
  {
    "title": "Trump is running the U.S. economy like a mad king",
    "description": "Chris Hayes explains how Trump's erratic tariff policy is undermining faith in the U.S. economy and says he's behaving like a mad king.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-tariffs-economy-mad-king-bonds-rcna200616",
    "timestamp": "2025-04-10T17:16:42Z"
  },
  {
    "title": "Trump's immigration policy is weighing on beer sales, Constellation Brands CEO says",
    "description": "President Donald Trump’s tariffs aren’t the only presidential policy that is weighing on Constellation Brands.",
    "link": "https://www.nbcnews.com/business/consumer/trumps-immigration-policy-weighing-beer-sales-constellation-brands-ceo-rcna200672",
    "timestamp": "2025-04-10T17:16:28Z"
  },
  {
    "title": "Why House Democrats are sticking with their long-shot anti-tariff strategy",
    "description": "The News\nHouse Democrats are encountering a new obstacle as they try to drive a wedge within the GOP on tariffs: Their potential Republican allies aren’t moving in their direction.\nEven before President Donald Trump paused many of his tariffs on Wednesday, hi…",
    "link": "https://biztoc.com/x/aed4f19559beb1d7",
    "timestamp": "2025-04-10T17:15:26Z"
  },
  {
    "title": "Whatever Donald Trump does next, this chaos will soon be shaping ordinary lives for the worse | Gaby Hinsliff",
    "description": "There is now little prospect of the growth Labour promised. With Reform nipping at his heels, Starmer must offer protection to the British people\nIf it’s brown, lie down. If it’s black, fight back. If it’s white, say goodnight.\nThe rhyme we learned hiking as …",
    "link": "https://biztoc.com/x/2fb7d2d47b05f6eb",
    "timestamp": "2025-04-10T17:15:13Z"
  }
]