[
  {
    "title": "FBI Targeted Conservative Orgs In Trump Election Interference Probe — Including Turning Point USA",
    "description": "The investigation behind Jack Smith's election interference case against Trump targeted dozens of other conservative groups, including TPUSA, docs show.",
    "link": "https://dailycaller.com/2025/09/16/fbi-targeted-conservative-orgs-tpusa-documents-show/",
    "timestamp": "2025-09-16T18:20:15Z"
  },
  {
    "title": "BREAKING: Charlie Kirk’s Accused Assassin Will Face the Death Penalty",
    "description": "Tyler Robinson was officially charged with the killing of Charlie Kirk and will face the death penalty, authorities announced in a press conference in Provo, Utah Tuesday afternoon.\nThe post BREAKING: Charlie Kirk’s Accused Assassin Will Face the Death Penalt…",
    "link": "https://www.mediaite.com/crime/breaking-charlie-kirks-assassin-will-face-the-death-penalty/",
    "timestamp": "2025-09-16T18:20:14Z"
  },
  {
    "title": "FBI Director Kash Patel Sends Senator Cory Booker into a Screaming Meltdown",
    "description": "HOLY CRAP! Kash Patel just absolutely DESTROYED Cory Booker KASH: “Your rant of false information does NOT bring this country together. It is MY TIME to address your falsehoods. You are an EMBARRASSMENT to this country.” BOOKER: *melts down* You don’t tell me…",
    "link": "https://freerepublic.com/focus/f-bloggers/4340878/posts",
    "timestamp": "2025-09-16T18:19:28Z"
  },
  {
    "title": "Trump Threatens ABC Reporter Over Hate Speech Question | Watch Video",
    "description": "US President Donald Trump threatened reporter Jonathan Karl, chief Washington Correspondent for ABC News on Tuesday, over a question on hate speech. Karl asked Trump a question regarding Attorney General Pam Bondi's statements classifying anyone who applauded…",
    "link": "https://www.ndtvprofit.com/world/trump-threatens-abc-reporter-over-hate-speech-question-watch-video",
    "timestamp": "2025-09-16T18:19:13Z"
  },
  {
    "title": "Trump promises 'midterm convention' as GOP poll numbers sink",
    "description": "President Donald Trump promised an off-year Republican National Convention event as his poll numbers and those of Congress continue to fall. Trump, who is flying to the United Kingdom for a state visit, posted on Truth Social, \"The Republicans are going to do…",
    "link": "https://www.rawstory.com/republican-convention-2026/",
    "timestamp": "2025-09-16T18:19:03Z"
  },
  {
    "title": "Suspect in Charlie Kirk killing charged with aggravated murder and weapon and obstruction offenses",
    "description": "Tyler Robinson was charged with aggravated murder for the assassination of conservative activist Charlie Kirk at Utah Valley University. Robinson potentially faces the death penalty if convicted. He is also charged with felony discharge of a firearm and obstr…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/suspect-in-charlie-kirk-killing-charged-with-aggravated-murder-and-weapon-and-obstruction-offenses/articleshow/123928354.cms",
    "timestamp": "2025-09-16T18:18:45Z"
  },
  {
    "title": "Republican pushes Patel for faster release of Epstein files",
    "description": "Louisiana Republican Sen. John Kennedy pressed FBI Director Kash Patel on Tuesday to continue the release of files in the Jeffrey Epstein case, specifically information about who other than Epstein, if anyone, was on the receiving end of girls and women being…",
    "link": "https://freerepublic.com/focus/f-chat/4340877/posts",
    "timestamp": "2025-09-16T18:17:49Z"
  },
  {
    "title": "Charlie Kirk's Own Words on Hate Speech Used Against Pam Bondi",
    "description": "\"We will absolutely target you, go after you, if you are targeting anyone with hate speech,\" Attorney General Pam Bondi said.",
    "link": "https://www.newsweek.com/charlie-kirks-own-words-hate-speech-used-against-pam-bondi-2130647",
    "timestamp": "2025-09-16T18:17:30Z"
  },
  {
    "title": "Trump Is Firing Federal Workers Over Beliefs He Doesn't Like",
    "description": "Mahri Stáinnak remembers the day they got the phone call that would change everything. Stáinnak was eating dinner with their family when a human resources representative called to tell Stáinnak that they were being put on administrative leave after more than …",
    "link": "https://www.aclu.org/news/free-speech/trump-is-firing-federal-workers-over-beliefs-he-doesnt-like",
    "timestamp": "2025-09-16T18:15:47Z"
  },
  {
    "title": "Trump tariffs give India a 1991-like chance to reinvent trade strategy",
    "description": "Trump's tariffs presented India with an opportunity to overhaul its trade management. India is diversifying trade relationships, strengthening ties with countries like China and Russia, and exploring new markets.",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/trump-tariffs-give-india-a-1991-like-chance-to-reinvent-trade-strategy/articleshow/123928298.cms",
    "timestamp": "2025-09-16T18:15:47Z"
  },
  {
    "title": "Modi Receives Trump's Call For Birthday Wishes, Reaffirms Commitment To Stronger India–US Ties",
    "description": "Prime Minister Narendra Modi on Tuesday expressed gratitude to US President Donald Trump for his warm birthday greetings on the occasion of his 75th birthday. He further added that India supports his initiatives towards a peaceful resolution of the Ukraine co…",
    "link": "https://www.ndtvprofit.com/nation/pm-modi-receives-trumps-call-for-birthday-wishes-reaffirms-commitment-to-stronger-indiaus-ties",
    "timestamp": "2025-09-16T18:15:18Z"
  },
  {
    "title": "Hawaii Health Officials Push For Federal Marijuana Rescheduling As Trump Weighs Reform - Marijuana Moment",
    "description": "Hawaii health officials are affirming their support for federal marijuana rescheduling—a policy change that the Trump administration is actively considering. At the same time, a state lawmaker who sponsored a cannabis legalization bill in the most recent sess…",
    "link": "https://www.marijuanamoment.net/hawaii-health-officials-push-for-federal-marijuana-rescheduling-as-trump-weighs-reform/",
    "timestamp": "2025-09-16T18:14:54Z"
  },
  {
    "title": "Republicans unveil a bill to fund the government through Nov. 21. Democrats call it partisan",
    "description": "The bill would generally fund agencies at current levels, with a few exceptions.",
    "link": "https://www.bostonherald.com/2025/09/16/congress-budget-bill/",
    "timestamp": "2025-09-16T18:14:21Z"
  },
  {
    "title": "CNN Star Says Charlie Kirk Would Oppose Firing People Who Mocked Shooting",
    "description": "CNN commentator S.E. Cupp said that efforts to punish those who mocked Charlie Kirk after his killing are \"the opposite of what Charlie Kirk would have wanted.\"\nThe post CNN Star Says Charlie Kirk Would Oppose Firing People Who Mocked Shooting first appeared …",
    "link": "https://www.mediaite.com/media/tv/cnn-star-says-charlie-kirk-would-oppose-firing-people-who-mocked-shooting/",
    "timestamp": "2025-09-16T18:14:15Z"
  },
  {
    "title": "US slaps new sanctions on individuals and firms that help Iran sell its oil",
    "description": "The latest US Treasury Department move comes as part of an effort to make it tougher for Iran to sell oil abroad.",
    "link": "https://www.aljazeera.com/news/2025/9/16/us-slaps-new-sanctions-on-individuals-and-firms-that-help-iran-sell-its-oil",
    "timestamp": "2025-09-16T18:13:58Z"
  },
  {
    "title": "New Fortress Energy Gets Boost on Revived Puerto Rico LNG Deal",
    "description": "Billionaire Wes Edens’ New Fortress Energy Inc. has finalized a seven-year deal worth $4 billion to supply liquefied natural gas to Puerto Rico, the governor confirmed on Tuesday, giving the financially-strained company a shot in the arm.",
    "link": "https://financialpost.com/pmn/business-pmn/new-fortress-energy-gets-boost-on-revived-puerto-rico-lng-deal",
    "timestamp": "2025-09-16T18:13:31Z"
  },
  {
    "title": "Trump: Republicans will hold Midterm Convention",
    "description": "United States President Donald Trump announced on Tuesday that the Republicans plan to hold a \"Midterm Convention\" to present \"the great things we have done since the Presidential Election of 2024.\"\"S...",
    "link": "https://biztoc.com/x/02a53f61c3b98998",
    "timestamp": "2025-09-16T18:12:34Z"
  },
  {
    "title": "Netanyahu: Trump invited me to WH after UNGA",
    "description": "Israeli Prime Minister Benjamin Netanyahu announced during a press conference on Tuesday that US President Donald Trump invited him to a White House meeting after the premier's scheduled speech at the...",
    "link": "https://biztoc.com/x/24fa4522e6f61bef",
    "timestamp": "2025-09-16T18:12:10Z"
  },
  {
    "title": "Denmark leads military exercise in Greenland amid wariness toward Russia and tensions with U.S.",
    "description": "Denmark is leading a military exercise with hundreds of troops from several European NATO members in Greenland.",
    "link": "https://www.pbs.org/newshour/world/denmark-leads-military-exercise-in-greenland-amid-wariness-toward-russia-and-tensions-with-u-s",
    "timestamp": "2025-09-16T18:11:31Z"
  },
  {
    "title": "India Supports US Initiatives Aimed at Peaceful Settlement of Conflict in Ukraine - Modi",
    "description": "MOSCOW (Sputnik) - India supports US initiatives aimed at the peaceful settlement of the conflict in Ukraine, Indian Prime Minister Narendra Modi said on Tuesday.",
    "link": "https://sputnikglobe.com/20250916/india-supports-us-initiatives-aimed-at-peaceful-settlement-of-conflict-in-ukraine---modi-1122798189.html",
    "timestamp": "2025-09-16T18:11:06Z"
  },
  {
    "title": "Charlie Kirk understood the value of a good conspiracy theory. In death, he became one.",
    "description": "Within hours of the shooting of MAGA activist Charlie Kirk, conspiracy theories spread online. Steve Bannon, Candice Owens and Alex Jones all joined in.",
    "link": "https://www.msnbc.com/msnbc/news/charlie-kirk-not-dead-conspiracy-theories-online-suspect-rcna231698",
    "timestamp": "2025-09-16T18:11:06Z"
  },
  {
    "title": "‘You’re Setting Up a Trap!’ Kash Patel Spars With Adam Schiff Over January 6 Questions",
    "description": "FBI Director Kash Patel verbally grappled with Sen. Adam Schiff (D-CA) over whether the feds fired any agents for their involvement in the Jan. 6 Capitol Riot\nThe post ‘You’re Setting Up a Trap!’ Kash Patel Spars With Adam Schiff Over January 6 Questions firs…",
    "link": "https://www.mediaite.com/media/youre-setting-up-a-trap-kash-patel-spars-with-adam-schiff-over-january-6-questions/",
    "timestamp": "2025-09-16T18:10:55Z"
  },
  {
    "title": "Trump's U.K. visit may be haunted by Epstein questions",
    "description": "The shadow of Jeffrey Epstein looms over President Donald Trump’s high-stakes trip to the United Kingdom, as ties to the late convicted sex offender continue to damage political and business leaders around the world",
    "link": "https://www.msnbc.com/news/news-analysis/trump-uk-prime-minister-starmer-epstein-project-47-rcna231357",
    "timestamp": "2025-09-16T18:10:29Z"
  },
  {
    "title": "Arnold Schwarzenegger Mourns Charlie Kirk: 'A Great Communicator' Assassinated for Having a Different Opinion",
    "description": "Former California Gov. Arnold Schwarzenegger (R) reacted to the assassination of conservative commentator and Turning Point USA founder Charlie Kirk, pointing out that a \"human life is gone.\"\nThe post Arnold Schwarzenegger Mourns Charlie Kirk: ‘A Great Commun…",
    "link": "https://www.breitbart.com/entertainment/2025/09/16/arnold-schwarzenegger-mourns-charlie-kirk-a-great-communicator-assassinated-for-having-a-different-opinion/",
    "timestamp": "2025-09-16T18:10:05Z"
  },
  {
    "title": "Nancy Mace Targets Ilhan Omar to Crack Down on Charlie Kirk Speech in Congress",
    "description": "The censure attempt comes as waves of people face professional reprisal over their speech in the wake of Charlie Kirk’s killing.\nThe post Nancy Mace Targets Ilhan Omar to Crack Down on Charlie Kirk Speech in Congress appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/09/16/ilhan-omar-nancy-mace-censure-charlie-kirk/",
    "timestamp": "2025-09-16T18:08:24Z"
  },
  {
    "title": "Republicans unveil a bill to fund the government through Nov. 21. Democrats call it partisan",
    "description": "WASHINGTON (AP) — House Republicans unveiled Tuesday a stopgap spending bill that would keep federal agencies funded through Nov. 21, daring Democrats to block it knowing that the fallout would likely be a partial government shutdown that would begin Oct. 1, …",
    "link": "https://financialpost.com/pmn/republicans-unveil-a-bill-to-fund-the-government-through-nov-21-democrats-call-it-partisan",
    "timestamp": "2025-09-16T18:08:17Z"
  },
  {
    "title": "TikTok’s U.S. App May Still Use ByteDance’s Algorithm",
    "description": "Framework deal between U.S and China may let TikTok still use ByteDance’s algorithm under license while shifting U.S operations toward American control.\nThe post TikTok’s U.S. App May Still Use ByteDance’s Algorithm first appeared on iPhone in Canada.",
    "link": "https://www.iphoneincanada.ca/2025/09/16/tiktok-us-app-to-use-chinas-algorithm/",
    "timestamp": "2025-09-16T18:07:55Z"
  },
  {
    "title": "JD Vance To Leave Politics To Host 'Lord Of The Rings' Fan Podcast",
    "description": "WASHINGTON, D.C. — Following a successful outing as guest host of The Charlie Kirk Show, Vice President JD Vance has decided to leave politics behind and start his very own fan podcast about J.R.R. Tolkien's The Lord of the Rings.",
    "link": "https://babylonbee.com/news/jd-vance-to-leave-politics-to-host-lord-of-the-rings-fan-podcast",
    "timestamp": "2025-09-16T18:06:41Z"
  },
  {
    "title": "Extortionate amount Donald Trump’s security for state visit to the UK is costing",
    "description": "Donald Trump's second state visit to the UK is going to rack up quite the security cost",
    "link": "https://www.ladbible.com/news/uk-news/donald-trump-security-uk-cost-022966-20250916",
    "timestamp": "2025-09-16T18:06:11Z"
  },
  {
    "title": "The 3 Biggest Types of Charlie Kirk Conspiracy Theories Flooding the Internet",
    "description": "It doesn't help that the FBI Director has long promoted various conspiracy theories online.",
    "link": "https://gizmodo.com/the-3-biggest-types-of-charlie-kirk-conspiracy-theories-flooding-the-internet-2000659074",
    "timestamp": "2025-09-16T18:05:59Z"
  },
  {
    "title": "Trump warns ‘big trouble’ if Hamas uses Israeli captives as human shields",
    "description": "When asked about Israel’s ground invasion of Gaza City, US President Donald Trump warned of ‘big trouble’ for Hamas.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/9/16/trump-warns-big-trouble-if-hamas-uses-israeli-captives-as-human-shields",
    "timestamp": "2025-09-16T18:05:35Z"
  },
  {
    "title": "Trump Asked If He Has Confidence in Kash Patel: ‘Pam Bondi Has Done an Unbelievable Job’",
    "description": "“Well, first of all, I think that Pam Bondi has done an unbelievable job, and everybody agrees with that,” Trump replied.\nThe post Trump Asked If He Has Confidence in Kash Patel: ‘Pam Bondi Has Done an Unbelievable Job’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-asked-if-he-has-confidence-in-kash-patel-pam-bondi-has-done-an-unbelievable-job/",
    "timestamp": "2025-09-16T18:05:06Z"
  },
  {
    "title": "Patel lashes out at Schiff, calling him ‘political buffoon at best’",
    "description": "FBI Director Kash Patel launched into a heated takedown of Sen. Adam Schiff (D-Calif.) at a Tuesday hearing, lobbing multiple insults at a lawmaker who is...",
    "link": "https://thehill.com/homenews/senate/5506238-kash-patel-adam-schiff-fbi-hearing/",
    "timestamp": "2025-09-16T18:05:04Z"
  },
  {
    "title": "UN inquiry finds Israel is committing genocide, calls for arms embargo",
    "description": "A UN commission of inquiry concluded that Israel has committed four of the five genocidal acts defined under the 1948 Genocide Convention, and has such called on governments worldwide to stop sending weapons to Israel.",
    "link": "https://mondoweiss.net/2025/09/un-inquiry-finds-israel-is-committing-genocide-calls-for-arms-embargo/",
    "timestamp": "2025-09-16T18:05:00Z"
  },
  {
    "title": "US President Trump dials PM Modi, greets him on birthday",
    "description": "NEW DELHI: US President Donald Trump on Tuesday dialled Prime Minister Narendra Modi and greeted him on his 75th birthday, in a significant gesture seen as part of Washington’s efforts to reset ties with New Delhi. In a social media post, Modi said like Trump…",
    "link": "https://statetimes.in/us-president-trump-dials-pm-modi-greets-him-on-birthday/",
    "timestamp": "2025-09-16T18:04:49Z"
  },
  {
    "title": "Pam Bondi Is Clueless About the First Amendment",
    "description": "The U.S. attorney general’s vow to crack down on “hate speech” after Charlie Kirk’s assassination was so clearly unlawful that even conservatives called her out.",
    "link": "http://nymag.com/intelligencer/article/pam-bondi-hate-speech-first-amendment.html",
    "timestamp": "2025-09-16T18:04:35Z"
  },
  {
    "title": "Republicans unveil a bill to fund the government through Nov. 21. Democrats call it partisan",
    "description": "House Republicans unveiled Tuesday a stopgap spending bill that would keep federal agencies funded through Nov. 21, daring Democrats to block it knowing that...",
    "link": "https://www.yahoo.com/news/articles/republicans-unveil-bill-fund-government-180155307.html",
    "timestamp": "2025-09-16T18:01:55Z"
  },
  {
    "title": "J.D. Vance Says 26 Percent of Young Liberals Justify Political Violence. Here's What the Data Really Say",
    "description": "The assassination of Charlie Kirk has elicited egregious reactions across social media. On the left, some have reacted to his murder by calling Kirk a Nazi and likening him to Adolf Hitler. Others callously mocked Kirk and celebrated his assassination. Meanwh…",
    "link": "https://biztoc.com/x/3ed3c6aba1959bcf",
    "timestamp": "2025-09-16T18:01:20Z"
  },
  {
    "title": "What to know about the U.S. deal with China to keep TikTok in operation",
    "description": "TikTok users in the U.S. may get a reprieve from the threat of a shutdown after the Trump administration announced it has reached a framework deal with China for the ownership of popular social video platform.",
    "link": "https://www.pbs.org/newshour/nation/what-to-know-about-the-u-s-deal-with-china-to-keep-tiktok-in-operation",
    "timestamp": "2025-09-16T18:01:00Z"
  },
  {
    "title": "Bill Barr transcript flies in face of Democrat claims on Epstein-Trump connection",
    "description": "Former Attorney General Bill Barr told House Oversight he never saw evidence linking President Donald Trump to Jeffrey Epstein, according to a newly released transcript.",
    "link": "https://www.foxnews.com/politics/bill-barr-transcript-flies-face-democrat-claims-epstein-trump-connection",
    "timestamp": "2025-09-16T18:00:40Z"
  },
  {
    "title": "PM Modi thanks Trump for birthday wishes, assures to deepen India-US ties",
    "description": "The two leaders have frequently highlighted their personal rapport, with both stressing closer cooperation between New Delhi and Washington.",
    "link": "https://indianexpress.com/article/india/pm-modi-thanks-trump-for-birthday-wishes-assures-to-deepen-india-us-ties-10254035/",
    "timestamp": "2025-09-16T18:00:36Z"
  },
  {
    "title": "The right wing is creating a society of snitches",
    "description": "The post was up on Natalie's private Facebook page for 20 minutes - a crude joke about Charlie Kirk's death. When her husband suggested the comment was a bit much, she deleted it. The next day, Natalie received the first email telling her to kill herself. It …",
    "link": "https://www.theverge.com/policy/778972/right-wing-harassment-firings-charlie-kirk",
    "timestamp": "2025-09-16T18:00:35Z"
  },
  {
    "title": "IEA Says More Oil And Gas Investment May Be Needed",
    "description": "New oil and gas projects may be necessary to maintain current production levels, the IEA said Tuesday, as it is in a public feud with the Trump administration over its forecasts for lower demand.",
    "link": "https://www.ibtimes.com/iea-says-more-oil-gas-investment-may-needed-3783543",
    "timestamp": "2025-09-16T18:00:23Z"
  },
  {
    "title": "Trump Flies to London For Historic Second State Visit, Will Be Feted by Royals and Protested by Left",
    "description": "U.S. President Donald Trump is flying into the United Kingdom to arrive late Tuesday evening for a unprecedented second state visit.\nThe post Trump Flies to London For Historic Second State Visit, Will Be Fêted by Royals and Protested by Left appeared first o…",
    "link": "https://www.breitbart.com/europe/2025/09/16/trump-flies-to-london-for-historic-second-state-visit-will-be-feted-by-royals-and-protested-by-left/",
    "timestamp": "2025-09-16T17:59:32Z"
  },
  {
    "title": "Trump Drug Ad Crackdown: FDA Warns Novo Nordisk, Eli Lilly, Hims",
    "description": "Letters from the FDA targeted over 100 companies, saying multiple drug firms are pushing “false or misleading” claims about their products.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/09/16/trump-drug-ad-crackdown-fda-warns-novo-nordisk-eli-lilly-hims/",
    "timestamp": "2025-09-16T17:58:50Z"
  },
  {
    "title": "Jeanine Pirro Embarrassed Again In Court — And Gets Scolded By Judge",
    "description": "The judge offered a rebuke of Jeanine Pirro’s office: “The way this is supposed to work is the U.S. Attorney’s Office does its due diligence.”",
    "link": "https://www.huffpost.com/entry/felony-case-dismissed-against-dc-man-accused-of-spitting-at-national-guard_n_68c98998e4b056d71f62b7b4",
    "timestamp": "2025-09-16T17:58:24Z"
  },
  {
    "title": "Cozy friendships: New Russiagate docs expose media-government collusion",
    "description": "Reporters 'scored a series of Pulitzer Prize-winning scoops in 2017 by repeating false and inflammatory leaks during President Trump's first term'",
    "link": "https://www.wnd.com/2025/09/cozy-friendships-new-russiagate-docs-expose-media-government/",
    "timestamp": "2025-09-16T17:57:51Z"
  },
  {
    "title": "The \"liberal groups\" pretense of a petty, malicious, vengeful, ignorant sociopath",
    "description": "Here we go, Trump's \"Broad Crackdown on Liberal Groups,\" as The NY Times debuted it, a depraved, mendacity-infused inescapability as preordained as Adolf's persecutions and Uncle Joe's purges, though in a way, the Soviet goon was less corrupt than Donald. At …",
    "link": "https://www.pmcarpenter.com/post/the-liberal-groups-pretense-of-a-petty-malicious-vengeful-ignorant-sociopath",
    "timestamp": "2025-09-16T17:56:25Z"
  },
  {
    "title": "FBI chief Kash Patel rejects criticism over Charlie Kirk assassination probe",
    "description": "Kash Patel faced scrutiny from senators regarding his leadership as FBI director, particularly concerning the Charlie Kirk shooting investigation and handling of Epstein files. Allies of Trump questioned Patel's actions, while Patel defended his tenure, citin…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/fbi-chief-kash-patel-rejects-criticism-over-charlie-kirk-assassination-probe/articleshow/123927926.cms",
    "timestamp": "2025-09-16T17:56:23Z"
  },
  {
    "title": "Ilhan Omar Slams Latest Trump Attack on Venezuelan Boat as 'Egregious Violation'",
    "description": "US Congresswoman Ilhan Omar on Tuesday condemned the Trump administration's attack the previous day on a second boat allegedly transporting drugs off the coast of Venezuela as blatantly illegal, highlighting her introduction last week of a war powers resoluti…",
    "link": "https://www.commondreams.org/news/ilhan-omar-condemns-trump-boat-attack",
    "timestamp": "2025-09-16T17:54:08Z"
  },
  {
    "title": "Social media has us in its grip and won’t let go. The Charlie Kirk killing is a case study",
    "description": "Social media has become the town square for increasingly strident debate.",
    "link": "https://www.bostonherald.com/2025/09/16/charlie-kirk-shot-social-media-grip/",
    "timestamp": "2025-09-16T17:54:01Z"
  },
  {
    "title": "Social media has us in its grip and won’t let go. The Charlie Kirk killing is a case study",
    "description": "Social media has become the town square for increasingly strident debate.",
    "link": "https://www.denverpost.com/2025/09/16/charlie-kirk-shot-social-media-grip/",
    "timestamp": "2025-09-16T17:54:01Z"
  },
  {
    "title": "US FBI chief calls for 'al Qaeda' treatment for traffickers, after second strike",
    "description": "WASHINGTON (Reuters) -Drug trafficking organizations must be treated the way foreign terrorist organizations were treated after the Sept. 11, 2001, attacks, FBI Director Kash Patel said on Tuesday, pledging that the campaign against them will be a years-long …",
    "link": "https://www.thestar.com.my/news/world/2025/09/17/us-fbi-chief-calls-for-039al-qaeda039-treatment-for-traffickers-after-second-strike",
    "timestamp": "2025-09-16T17:54:00Z"
  },
  {
    "title": "PM Modi thanks Trump for birthday wishes, reaffirms India-US ties",
    "description": "US President Donald Trump called PM Modi ahead of his 75th birthday, reaffirming stronger India-US ties and gaining Modi’s support on Ukraine peace efforts.",
    "link": "https://www.thehindubusinessline.com/news/pm-modi-thanks-trump-for-birthday-wishes-reaffirms-india-us-ties/article70058533.ece",
    "timestamp": "2025-09-16T17:52:51Z"
  },
  {
    "title": "House GOP leaders unveil plan to fund the government until Nov. 21",
    "description": "House Speaker Mike Johnson said a Friday vote is expected in the House on the the legislation, which would keep the government funded until Nov. 21 and...",
    "link": "https://www.cbsnews.com/news/government-funding-plan-house-republicans/?ftag=YHF4eb9d17",
    "timestamp": "2025-09-16T17:52:49Z"
  },
  {
    "title": "ROOKE: Republicans Are Wasting Their Small Window Of Opportunity",
    "description": "American voters have been extremely patient with Republicans, but in the wake of Charlie Kirk's assassination, the time for speeches and bloviating is over.",
    "link": "https://dailycaller.com/2025/09/16/rooke-republicans-house-senate-trump-bondi-charlie-kirk-nominations-spending-bill-cr/",
    "timestamp": "2025-09-16T17:52:48Z"
  },
  {
    "title": "Trump Supports Designating Antifa A Terrorist Organization",
    "description": "Trump Supports Designating Antifa A Terrorist Organization\n \nAuthored by Jack Phillips via The Epoch Times,\nPresident Donald Trump on Monday said that he would support designating the antifa movement a terrorist organization in the wake of conservative commen…",
    "link": "https://biztoc.com/x/daf32b4e1fca0d51",
    "timestamp": "2025-09-16T17:49:53Z"
  },
  {
    "title": "DOJ Is Now Investigating University Professors For Wrongthink",
    "description": "There’s no slippery slope here. The bigoted fiends have already claimed the bottom of the hill for themselves and now they’re bringing in the earth-moving equipment in hopes of creating an ideological Mariana’s Trench. Thanks to Trump’s resurgence, no one in …",
    "link": "https://www.techdirt.com/2025/09/16/doj-is-now-investigating-university-professors-for-wrongthink/",
    "timestamp": "2025-09-16T17:49:16Z"
  },
  {
    "title": "Shoppers increased retail spending by 0.6% in August, even as tariffs led to price hikes and hurt jobs",
    "description": "Shoppers increased their spending at a better-than-expected pace in August from July, helped by back-to-school shopping, even as President Donald Trump’s tariffs are starting to hurt the job market and lead to price increases.",
    "link": "https://www.pbs.org/newshour/economy/shoppers-increased-retail-spending-by-0-6-in-august-even-as-tariffs-led-to-price-hikes-and-hurt-jobs",
    "timestamp": "2025-09-16T17:47:59Z"
  },
  {
    "title": "‘One of the worst’: Trump sues N.Y. Times for being ‘mouthpiece’ for Democrats, helping Harris’ campaign",
    "description": "President, coming off victories over ABC, CBS, charges defamation, libel in legal case",
    "link": "https://www.wnd.com/2025/09/one-worst-trump-sues-n-y-times-being/",
    "timestamp": "2025-09-16T17:46:51Z"
  },
  {
    "title": "'Trump Is Making Your Life More Expensive': Tariff Chaos Engulfs US Economy",
    "description": "US consumers are increasingly feeling the impact of President Donald Trump's tariffs, and the head of the Congressional Budget Office said on Monday that they are fueling inflation.During an appearance on CNBC, Congressional Budget Office (CBO) director Phill…",
    "link": "https://www.commondreams.org/news/trump-tariffs-inflation-2673999248",
    "timestamp": "2025-09-16T17:45:35Z"
  },
  {
    "title": "Trump's mental health questioned after he claims 300 million people died last year - NewsBreak",
    "description": "Donald Trump made the bizarre claim during a press conference on Sunday, and it's unclear where he got the number from, as the US population is only 340 mi",
    "link": "https://www.newsbreak.com/share/4235031023953-trump-s-mental-health-questioned-after-he-claims-300-million-people-died-last-year?s=a2&amp;share_destination_id=MTQ5MjI4MzY3LTE3NTgwNDIzNzkwOTE%3D&amp;pd=0A69799W&amp;hl=en_US&amp;send_time=1758042379&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.42.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control",
    "timestamp": "2025-09-16T17:44:00Z"
  },
  {
    "title": "Trump's mental health questioned after he claims 300 million people died last year - NewsBreak",
    "description": "Donald Trump made the bizarre claim during a press conference on Sunday, and it's unclear where he got the number from, as the US population is only 340 mi",
    "link": "https://www.newsbreak.com/share/4235031023953-trump-s-mental-health-questioned-after-he-claims-300-million-people-died-last-year?s=a2&amp;share_destination_id=MTQ5MjI4MzY3LTE3NTgwNDIzODk1MDk%3D&amp;pd=0A69799W&amp;hl=en_US&amp;send_time=1758042389&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.42.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control",
    "timestamp": "2025-09-16T17:43:32Z"
  },
  {
    "title": "Cory Booker erupts at Kash Patel, predicts he's 'not long' for his job",
    "description": "Sen. Cory Booker, D-N.J., and FBI Director Kash Patel clashed during a Senate Judiciary Committee hearing on Tuesday.",
    "link": "https://www.foxnews.com/politics/cory-booker-erupts-patel-predicts-hes-not-long-his-job",
    "timestamp": "2025-09-16T17:41:51Z"
  },
  {
    "title": "New US-China TikTok agreement similar to terms agreed this spring, sources say",
    "description": "The deal in April would have spun off TikTok's US operations into a new company based in the US and majority-owned and operated by US investors. The terms earlier this year had been approved by existing investors, new investors, ByteDance and the US governmen…",
    "link": "https://economictimes.indiatimes.com/tech/technology/new-us-china-tiktok-agreement-similar-to-terms-agreed-this-spring-sources-say/articleshow/123927591.cms",
    "timestamp": "2025-09-16T17:41:28Z"
  },
  {
    "title": "WATCH: Sen. Booker tells Patel ‘you’re not going to be around long’ as FBI director",
    "description": "Sen. Cory Booker, D-N.J., said Kash Patel’s actions so far as FBI director have “made our country weaker and less safe.”",
    "link": "https://www.pbs.org/newshour/politics/watch-sen-booker-tells-patel-youre-not-going-to-be-around-long-as-fbi-director",
    "timestamp": "2025-09-16T17:39:59Z"
  },
  {
    "title": "Why is Trump backtracking on the Hyundai immigration raid?",
    "description": "Backlash threatens investment in US manufacturing",
    "link": "https://theweek.com/politics/reason-trump-backtracking-hyundai-raid-south-korea-georgia",
    "timestamp": "2025-09-16T17:39:26Z"
  },
  {
    "title": "Senate Democrats raise concerns over Pentagon plan to use military lawyers as immigration judges",
    "description": "They worry it will violate a ban on using service members for law enforcement.",
    "link": "https://www.denverpost.com/2025/09/16/pentagon-immigration-democrats/",
    "timestamp": "2025-09-16T17:38:32Z"
  },
  {
    "title": "Senate Democrats raise concerns over Pentagon plan to use military lawyers as immigration judges",
    "description": "They worry it will violate a ban on using service members for law enforcement.",
    "link": "https://www.bostonherald.com/2025/09/16/pentagon-immigration-democrats/",
    "timestamp": "2025-09-16T17:38:32Z"
  },
  {
    "title": "Sticks and stones may break our bones — but these Trump words can really hurt us",
    "description": "Every president and most members of Congress have known for the past two centuries that having the ability to wield the power of government is a serious responsibility that carries with it real obligations for self-control.The reason is simple and obvious, al…",
    "link": "https://www.rawstory.com/raw-investigates/2673995431/",
    "timestamp": "2025-09-16T17:36:57Z"
  },
  {
    "title": "Oscar-winner Robert Redford dies, aged 89",
    "description": "Hollywood legend and Sundance founder",
    "link": "https://www.nzherald.co.nz/entertainment/hollywood-legend-and-sundance-founder-robert-redford-dies-aged-89/SEE6EYUPSJBO5ELC7P6F5XKKRY/",
    "timestamp": "2025-09-16T17:35:58Z"
  },
  {
    "title": "India Refused Third-Party Mediation In Truce Talks, Pakistan Foreign Minister Admits",
    "description": "Pakistan's Foreign Minister Ishaq Dar publicly stated that India never agreed to any third-party involvement in talks or ceasefire negotiations involving military action that was undertaken in Operation Sindoor and the ensuing days post the Pahalgam attack on…",
    "link": "https://www.ndtvprofit.com/nation/india-refused-third-party-mediation-in-truce-talks-pakistan-foreign-minister-admits",
    "timestamp": "2025-09-16T17:35:23Z"
  },
  {
    "title": "Senate Democrats raise concerns over Pentagon plan to use military lawyers as immigration judges",
    "description": "A group of Democratic senators say they are deeply concerned that a Pentagon plan to allow military lawyers to work as temporary immigration judges will violate a ban on using service members for law enforcement and affect the military justice system",
    "link": "https://abcnews.go.com/US/wireStory/senate-democrats-raise-concerns-pentagon-plan-military-lawyers-125632079",
    "timestamp": "2025-09-16T17:34:19Z"
  },
  {
    "title": "Trump calls PM Modi on eve of 75th birthday as India-US trade talks accelerate",
    "description": "Narendra Modi thanked Donald Trump for birthday wishes. The leaders spoke on the phone. Modi reaffirmed commitment to strengthening India-US ties. He also expressed support for Trump's efforts to resolve the Ukraine conflict. Modi conveyed this message on X. …",
    "link": "https://economictimes.indiatimes.com/news/india/trump-calls-pm-modi-on-eve-of-75th-birthday-as-india-us-trade-talks-accelerate/articleshow/123927402.cms",
    "timestamp": "2025-09-16T17:34:06Z"
  },
  {
    "title": "Tyler Robinson Charges To Be Announced After Charlie Kirk Shooting: Live Updates",
    "description": "Tyler Robinson expected to face aggravated murder and firearm charges today in Utah County court, officials confirm. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/tyler-robinson-charges-charlie-kirk-assassination-live-updates-2130750",
    "timestamp": "2025-09-16T17:33:51Z"
  },
  {
    "title": "Tim Walz Is Running Again Hoping You Forgot It All",
    "description": "Tim Walz’s record is nothing to run on, but he wants four more years.\nThe post Tim Walz Is Running Again Hoping You Forgot It All first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/tim-walz-is-running-again-hoping-you-forgot-it-all/",
    "timestamp": "2025-09-16T17:33:23Z"
  },
  {
    "title": "House Republicans release bill to keep government funded through Nov. 21",
    "description": "House Republicans released a bill Tuesday to keep the government funded through Nov. 21 and avoid a government shutdown on Oct. 1.",
    "link": "https://www.nbcnews.com/politics/congress/house-republicans-release-bill-government-funded-shutdown-rcna231699",
    "timestamp": "2025-09-16T17:32:56Z"
  },
  {
    "title": "Trump Attacks ABC Reporter After Question About Free Speech",
    "description": "\"Maybe they'll have to go after you,\" the president threatened.",
    "link": "https://www.huffpost.com/entry/trump-abc-reporter-hate-speech-free-speech_n_68c98777e4b04bfe9a7025a3",
    "timestamp": "2025-09-16T17:32:39Z"
  },
  {
    "title": "FBI director shouts at Democrat senators during oversight hearing",
    "description": "The FBI director has shouted at Democratic senators during a hearing, taking questions on the assassination of Charlie Kirk, Jeffrey Epstein and the firing of agents.",
    "link": "https://news.sky.com/story/fbi-director-kash-patel-shouts-at-democrat-senators-over-charlie-kirk-and-jeffrey-epstein-during-oversight-hearing-13432299",
    "timestamp": "2025-09-16T17:32:00Z"
  },
  {
    "title": "Alexandria pastor condemns Charlie Kirk as an 'unapologetic racist' during Sunday sermon",
    "description": "Alexandria pastor Rev. Dr. Howard-John Wesley criticized honoring Charlie Kirk with half-staff flags, calling the assassinated conservative activist a divisive racist.",
    "link": "https://www.foxnews.com/media/alexandria-pastor-condemns-charlie-kirk-unapologetic-racist-during-sunday-sermon",
    "timestamp": "2025-09-16T17:30:42Z"
  },
  {
    "title": "Two Men’s Bodies Found Hanging From Trees on the Same Day",
    "description": "Two communities are reeling after two men, one Black, one white, were found dead hanging from trees in Mississippi just hours apart from one another. Demartravion “Trey” Reed, a 21-year-old Black student, was found Monday morning on his campus of Delta State …",
    "link": "https://newrepublic.com/post/200528/two-men-found-hanging-trees-same-day-trey-reed-cory-zukatis",
    "timestamp": "2025-09-16T17:30:28Z"
  },
  {
    "title": "Why a New York state judge dismissed terrorism charges against Luigi Mangione",
    "description": "Justice Gregory Carro deemed two terrorism-related murder charges in Brian Thompson’s killing as legally insufficient but approved a remaining, straightforward murder charge.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/luigi-mangione-terrorism-charges-dismissed-murder-new-york-rcna231643",
    "timestamp": "2025-09-16T17:29:14Z"
  },
  {
    "title": "Another Military Strike on a Speedboat Confirms Trump's Policy of Murdering Suspected Drug Smugglers",
    "description": "After President Donald Trump ordered a drone strike that killed 11 alleged drug smugglers on a speedboat in the Caribbean Sea on September 2, Secretary of State Marco Rubio said the attack signaled a new approach to drug law enforcement. \"Instead of interdict…",
    "link": "https://biztoc.com/x/384553531a8b09a8",
    "timestamp": "2025-09-16T17:27:40Z"
  },
  {
    "title": "BofA sees ‘path to a 5% mortgage rate’ if the Fed pulls off these 2 things",
    "description": "Bank of America’s mortgage-backed securities (MBS) research team tackled the question of when U.S. mortgage rates could come down. President Donald Trump has been pressuring the Federal Reserve for much of 2025 to cut interest rates, even as Fed chair Jerome …",
    "link": "https://biztoc.com/x/aff401484e1f6fdf",
    "timestamp": "2025-09-16T17:27:36Z"
  },
  {
    "title": "WATCH: ‘Decency requires you don’t speak ill of the dead’",
    "description": "Brit Hume says left's reaction to Kirk murder will backfire",
    "link": "https://www.wnd.com/2025/09/watch-decency-requires-you-dont-speak-ill-dead/",
    "timestamp": "2025-09-16T17:27:23Z"
  },
  {
    "title": "Colombia halts US arms purchases in row over drug fight delisting",
    "description": "Colombia on Tuesday halted arms purchases from the United States, its biggest military partner, after Washington decertified the South American country as an anti-drugs ally for failing to halt cocaine trafficking. On Monday, President Donald Trump denounced …",
    "link": "https://www.digitaljournal.com/world/colombia-halts-us-arms-purchases-in-row-over-drug-fight-delisting/article",
    "timestamp": "2025-09-16T17:27:20Z"
  },
  {
    "title": "Colombia Halts US Arms Purchases In Row Over Drug Fight Delisting",
    "description": "Colombia on Tuesday halted arms purchases from the United States, its biggest military partner, after Washington decertified the South American country as an anti-drugs ally for failing to halt cocaine trafficking.",
    "link": "https://www.ibtimes.com/colombia-halts-us-arms-purchases-row-over-drug-fight-delisting-3783540",
    "timestamp": "2025-09-16T17:27:20Z"
  },
  {
    "title": "Charlie Kirk’s Death Sparks Global Outcry as Zahid F Sarder Saddi Calls It a ‘Global Tragedy’",
    "description": "WASHINGTON, Sept. 16, 2025 (GLOBE NEWSWIRE) -- World leaders, former U.S. presidents, and political figures across party lines condemned the killing of conservative activist Charlie Kirk, who was shot and killed while speaking at a Utah university event this …",
    "link": "https://www.globenewswire.com/news-release/2025/09/16/3151147/0/en/Charlie-Kirk-s-Death-Sparks-Global-Outcry-as-Zahid-F-Sarder-Saddi-Calls-It-a-Global-Tragedy.html",
    "timestamp": "2025-09-16T17:27:00Z"
  },
  {
    "title": "J.D. Vance Says 26 Percent of Young Liberals Justify Political Violence. Here's What the Data Really Say.",
    "description": "Vance cherry-picks data from a YouGov poll to paint an inordinately bleak picture of the state of American political discourse.",
    "link": "https://reason.com/2025/09/16/j-d-vance-says-26-percent-of-young-liberals-justify-political-violence-heres-what-the-data-really-say/",
    "timestamp": "2025-09-16T17:26:10Z"
  },
  {
    "title": "Davey has no regrets over Welsh Lib Dem leader rebuke",
    "description": "Sir Ed Davey says it is  \"good\" that Welsh Liberal Democrat leader Jane Dodds had apologised.",
    "link": "https://www.bbc.com/news/articles/c3rvpzy7gpqo",
    "timestamp": "2025-09-16T17:24:12Z"
  },
  {
    "title": "Another Military Strike on a Speedboat Confirms Trump's Policy of Murdering Suspected Drug Smugglers",
    "description": "The president's new approach to drug law enforcement represents a stark departure from military norms and criminal justice principles.",
    "link": "https://reason.com/2025/09/16/another-military-strike-on-a-speedboat-confirms-trumps-policy-of-murdering-suspected-drug-smugglers/",
    "timestamp": "2025-09-16T17:22:28Z"
  },
  {
    "title": "Donald Trump’s Health Questioned By Docs After Dozing Off At U.S. Open",
    "description": "Donald Trump might have some bigger health issues, top doctors claim in a new interview.",
    "link": "https://okmagazine.com/p/donald-trump-health-concern-dozing-off-us-open-top-docs-weigh-in/",
    "timestamp": "2025-09-16T17:22:24Z"
  },
  {
    "title": "Knives Out for 'Keystone Kash' Patel as His FBI Leadership Comes 'Under Fire' From Top Trump Officials — and It’s Revealed A.G. Pam Bondi 'Can't Stand Him'",
    "description": "Kash Patel has come 'under fire' from the top President Donald Trump officials as it is revealed A.G. Pam Bondi 'can't stand him.'",
    "link": "https://radaronline.com/p/kash-patel-fbi-leadership-under-fire-trump-officials-pam-bondi-cant-stand-him/",
    "timestamp": "2025-09-16T17:21:32Z"
  },
  {
    "title": "Watch: 'I'm not afraid of you!' - Cory Booker clashes with Kash Patel",
    "description": "The senator from New Jersey crticised Patel during a hearing over what he claims have been repeated missteps as FBI director.",
    "link": "https://www.bbc.com/news/videos/cx2xed8yv00o",
    "timestamp": "2025-09-16T17:20:57Z"
  },
  {
    "title": "Trump proposes ending quarterly earnings reports",
    "description": "What happened\nPresident Donald Trump yesterday called for the U.S. to end its 55-year-old practice of requiring publicly traded companies to post quarterly earnings reports. He suggested that the Securities and Exchange Commission mandate six-month corporate …",
    "link": "https://biztoc.com/x/a955fbb6723eb96d",
    "timestamp": "2025-09-16T17:16:46Z"
  },
  {
    "title": "White House joins GOP speech policing, citing Kirk",
    "description": "What happened\nPresident Donald Trump and other top White House officials yesterday said they would join a broader Republican push to punish people who cheered or downplayed Charlie Kirk’s murder and target left-leaning groups and nonprofits they alleged suppo…",
    "link": "https://biztoc.com/x/18755acf4de067f3",
    "timestamp": "2025-09-16T17:16:42Z"
  },
  {
    "title": "Bondi opens provocative door, vows to target those she believes have pushed ‘hate speech’",
    "description": "It was a problem when Attorney General Pam Bondi suggested she'd pursue \"hate speech\" prosecutions. A day later, Donald Trump made that problem vastly worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/bondi-opens-provocative-door-vows-target-believes-pushed-hate-speech-rcna231682",
    "timestamp": "2025-09-16T17:16:20Z"
  },
  {
    "title": "President Donald Trump and Melania land in UK for second state visit - follow live",
    "description": "The US president and First Lady Melania Trump will join King Charles at Windsor Castle for two days of events.",
    "link": "https://www.bbc.co.uk/news/live/cx2q200d2vnt",
    "timestamp": "2025-09-16T17:15:26Z"
  }
]