[
  {
    "title": "Stocks Plummet as Wall Street's Euphoria Fades",
    "description": "US stocks surrendered a chunk of their historic gains from the day before on Thursday as President Trump's trade war continues to threaten the economy. The S&P 500 fell 188.85 points, or 3.5%, to 5,268.05, slicing into Wednesday's surge of 9.5%. The Dow Jones…",
    "link": "https://www.newser.com/story/367011/stocks-plummet-as-wall-streets-euphoria-fades.html",
    "timestamp": "2025-04-10T20:39:50Z"
  },
  {
    "title": "Florida charges Ryan Routh, who allegedly tried to assassinate Trump",
    "description": "A man already jailed on federal charges of attempting to assassinate then-candidate Donald Trump will face additional state charges, Florida’s attorney general said.",
    "link": "https://www.nbcnews.com/news/us-news/florida-charges-ryan-routh-allegedly-tried-assassinate-trump-rcna200708",
    "timestamp": "2025-04-10T20:39:49Z"
  },
  {
    "title": "‘I’ve Had It With Getting Screwed!’ Kevin O’Leary Urges Trump to Ramp Up Trade War With China Even Further",
    "description": "Shark Tank star Kevin O'Leary on Thursday urged President Donald Trump to stop with the gradual tariff increases on China and just jump to 400%.\nThe post ‘I’ve Had It With Getting Screwed!’ Kevin O’Leary Urges Trump to Ramp Up Trade War With China Even Furthe…",
    "link": "https://www.mediaite.com/tv/ive-had-it-with-getting-screwed-kevin-oleary-urges-trump-to-ramp-up-trade-war-with-china-even-further/",
    "timestamp": "2025-04-10T20:38:48Z"
  },
  {
    "title": "Law Firm Behind $787 Million Fox News Defamation Victory Vows to Fight Trump’s ‘Unconstitutional’ Punishment",
    "description": "“Anyone who knows Susman Godfrey knows we believe in the rule of law, and we take seriously our duty to uphold it.\"\nThe post Law Firm Behind $787 Million Fox News Defamation Victory Vows to Fight Trump’s ‘Unconstitutional’ Punishment first appeared on Mediait…",
    "link": "https://www.mediaite.com/politics/law-firm-behind-787-million-fox-news-defamation-victory-vows-to-fight-trumps-unconstitutional-punishment/",
    "timestamp": "2025-04-10T20:38:19Z"
  },
  {
    "title": "Cybersecurity industry falls silent as Trump turns ire on SentinelOne",
    "description": "WASHINGTON :The cybersecurity industry has gone mostly quiet after President Donald Trump took action against one of its prominent members.Trump on Wednesday ordered the cancellation of security clearances of SentinelOne executives and employees, part of a ca…",
    "link": "https://www.channelnewsasia.com/business/cybersecurity-industry-falls-silent-trump-turns-ire-sentinelone-5058391",
    "timestamp": "2025-04-10T20:37:50Z"
  },
  {
    "title": "Palin Brings New York Times to Court for Defamation Trial 2.0",
    "description": "Former Republican vice presidential candidate and Alaska governor Sarah Palin will have a second chance to try the New York Times for defamation when the parties meet in a New York courtroom on Monday.\nThe post Palin Brings New York Times to Court for Defamat…",
    "link": "https://www.breitbart.com/the-media/2025/04/10/palin-brings-new-york-times-to-court-for-defamation-trial-2-0/",
    "timestamp": "2025-04-10T20:37:05Z"
  },
  {
    "title": "Amazon tells employees to soften tariff pain for vendors—but there's a catch",
    "description": "Amazon offers price concessions to select vendors to offset Chinese tariff impacts, aiming to retain vendors amidst rising costs.",
    "link": "https://www.businessinsider.com/amazon-offers-price-concessions-vendors-tariff-hikes-2025-4",
    "timestamp": "2025-04-10T20:37:03Z"
  },
  {
    "title": "US judge blocks Trump from revoking thousands of migrants' legal status",
    "description": "BOSTON (Reuters) - A federal judge blocked President Donald Trump's administration on Thursday from revoking the temporary legal status of hundreds of thousands of Cubans, Haitians, Nicaraguans and Venezuelans in the United States. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/11/us-judge-blocks-trump-from-revoking-thousands-of-migrants039-legal-status",
    "timestamp": "2025-04-10T20:36:00Z"
  },
  {
    "title": "Trump says there may be ‘transition problems’ with tariffs before being a ‘beautiful thing’",
    "description": "\"There'll be a transition cost and transition problems, but in the end, it's going to be, it's going to be a beautiful thing,\" Trump told reporters during a cabinet meeting.",
    "link": "https://nypost.com/2025/04/10/us-news/trump-says-there-may-be-transition-problems-with-tariffs-before-being-a-beautiful-thing/",
    "timestamp": "2025-04-10T20:35:30Z"
  },
  {
    "title": "How the Basis Trade Unwind Could Affect Bitcoin and Crypto",
    "description": "The Federal Reserve intervened when this crowded trade unwound during the coronavirus pandemic.",
    "link": "https://decrypt.co/314401/how-the-basis-trade-unwind-could-affect-bitcoin-and-crypto",
    "timestamp": "2025-04-10T20:35:11Z"
  },
  {
    "title": "Pierce County businesses uneasy amid 90-day tariff pause as Trump eyes next trade moves",
    "description": "A 90-day pause on reciprocal tariffs gives little comfort to business leaders throughout Pierce County, and many question what President Donald Trump's next tra",
    "link": "https://komonews.com/news/local/pierce-county-businesses-uneasy-amid-90-day-tariff-pause-as-trump-eyes-next-trade-moves-musk-trade-import-export-china-mexico-car-sales-repair-mileage-replacement-tires-economy-expensive-costs-washington-pnw-debt-loan-electronics-iphone-apple-computer",
    "timestamp": "2025-04-10T20:34:33Z"
  },
  {
    "title": "Trump’s idea to use drones strikes in Mexico could make cartel violence worse",
    "description": "NBC News reported that the White House, the Defense Department and the intelligence community were discussing possible drone strikes on cartel infrastructure.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-drone-strikes-mexico-cartels-fentanyl-rcna200673",
    "timestamp": "2025-04-10T20:34:29Z"
  },
  {
    "title": "US Court Blocks Trump From Revoking Thousands Of Migrants' Legal Status",
    "description": "A federal judge blocked President Donald Trump&#039;s administration on Thursday from revoking the temporary legal status of hundreds of thousands of Cubans, Haitians, Nicaraguans and Venezuelans in the United States.",
    "link": "https://www.ndtv.com/world-news/us-judge-blocks-trump-from-revoking-thousands-of-migrants-legal-status-8136011",
    "timestamp": "2025-04-10T20:34:08Z"
  },
  {
    "title": "Senate Republicans Introduce Bill to Eliminate Department of Education",
    "description": "Senate Republicans on Wednesday formally introduced a bill that would eliminate the Department of Education, in line with President Donald Trump's executive order mandating the dismantling of the agency. \nThe post Senate Republicans Introduce Bill to Eliminat…",
    "link": "https://www.breitbart.com/politics/2025/04/10/senate-republicans-introduce-bill-to-eliminate-department-of-education/",
    "timestamp": "2025-04-10T20:33:41Z"
  },
  {
    "title": "Democrats question whether Trump and his allies engaged in insider trading on tariffs",
    "description": "Congressional Democrats are questioning whether President Donald Trump and his allies may have improperly acted on his suggestion Wednesday that it was a “great time to buy” stocks shortly before announcing he was cutting back on some of his new tariffs — a m…",
    "link": "https://www.nbcnews.com/politics/congress/democrats-question-whether-trump-allies-engaged-insider-trading-tariff-rcna200663",
    "timestamp": "2025-04-10T20:31:54Z"
  },
  {
    "title": "Trump Orders Investigations of Former Federal Officials, Says 'Anonymous' Author 'Guilty of Treason'",
    "description": "President Donald Trump ordered the Department of Justice (DOJ) to investigate two former officials from his first administration who openly betrayed him, saying he thinks one of them is \"guilty of treason.\"\nThe post Trump Orders Investigations of Former Feder…",
    "link": "https://www.breitbart.com/politics/2025/04/10/trump-orders-investigations-former-administration-officials/",
    "timestamp": "2025-04-10T20:30:28Z"
  },
  {
    "title": "Billionaires, allies, media personalities. These are the people Trump picked for top roles",
    "description": "Here's a look at some of the people Trump picked for top roles in his second administration — and what they have in common.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_d9c20562-316e-5eb7-af8c-93db813de469.html",
    "timestamp": "2025-04-10T20:30:00Z"
  },
  {
    "title": "Billionaires, allies, media personalities. These are the people Trump picked for top roles",
    "description": "Here's a look at some of the people Trump picked for top roles in his second administration — and what they have in common.",
    "link": "https://roanoke.com/news/nation-world/business/economy/article_d6770a27-d3a9-5886-a6e8-822dc0ee3029.html",
    "timestamp": "2025-04-10T20:30:00Z"
  },
  {
    "title": "Thailand lags in the global trade war",
    "description": "<p>Thailand is fast isolating itself from the international community and falling behind in the emerging geoeconomic warfare to the detriment of its economy and people. The elected government of Prime Minister Paetongtarn Shinawatra is ironically coming up wi…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3000727/thailand-lags-in-the-global-trade-war",
    "timestamp": "2025-04-10T20:30:00Z"
  },
  {
    "title": "Catholic Relief Services, bishops urge House to reinstate some international aid funds",
    "description": "null / Credit: lazyllama/Shutterstock\n\nWashington, D.C. Newsroom, Apr 10, 2025 / 16:30 pm (CNA).\nThe U.S. Conference of Catholic Bishops (USCCB) and Catholic Relief Services (CRS) are urging lawmakers in the House of Representatives to approve tens of billion…",
    "link": "https://www.catholicnewsagency.com/news/263297/catholic-relief-services-bishops-urge-house-to-reinstate-some-international-aid-funds",
    "timestamp": "2025-04-10T20:30:00Z"
  },
  {
    "title": "As US retreats, will it be China's world or Europe's?",
    "description": "<p>'Today we're in one era, and tomorrow we'll be in a different era,\" President Donald Trump loudly proclaimed from the White House Rose Garden as he hiked US tariffs to their highest level since 1909. \"No one's done anything quite like this!\"</p>",
    "link": "https://www.bangkokpost.com/opinion/opinion/3000947/as-us-retreats-will-it-be-chinas-world-or-europes-",
    "timestamp": "2025-04-10T20:30:00Z"
  },
  {
    "title": "US must change course with Myanmar",
    "description": "<p>Myanmar needs help. After more than four years of brutal civil war, the country has been hit by a 7.7-magnitude earthquake, the strongest it has suffered since 1946. The resulting humanitarian crisis is dire, and continues to escalate, but despite an extra…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3000642/us-must-change-course-with-myanmar",
    "timestamp": "2025-04-10T20:30:00Z"
  },
  {
    "title": "America Avenue vs. Terry Fox Avenue: Ontario city considers changing street name",
    "description": "The proposal was initiated in February 2025 and is partly motivated by ongoing tensions between Canada and the United States",
    "link": "https://nationalpost.com/news/canada/america-avenue-vs-terry-fox-avenue-ontario-city-considers-changing-street-name",
    "timestamp": "2025-04-10T20:29:45Z"
  },
  {
    "title": "Market Whiplash: Media Stocks Slump Again Following Brief Rebound on Trump’s Tariffs Pause",
    "description": "Following one day of respite, the U.S. stock market returned to its downward spiral Thursday amid ongoing concerns tied to President Donald Trump’s proposed tariffs. At market close, the tech-stock-heavy Nasdaq Composite index was down 4.31%, the S&P 500 fell…",
    "link": "https://variety.com/2025/tv/news/trump-tariffs-stocks-down-1236366080/",
    "timestamp": "2025-04-10T20:29:26Z"
  },
  {
    "title": "ChatGPT’s new Barbie doll renderings were the new AI craze—until MTG hopped on",
    "description": "Rep. Marjorie Taylor Greene (R-Ga.) shared a video of herself as a Barbie doll to social media, jumping on a popular new artificial intelligence (AI) trend.\n\n\nGreene is the latest to join the bandwagon, as social media users transform themselves into plastic …",
    "link": "https://www.dailydot.com/debug/ai-barbie-dolls-marjorie-taylor-greene/",
    "timestamp": "2025-04-10T20:29:17Z"
  },
  {
    "title": "RFK Jr. says HHS will determine the cause of autism by September",
    "description": "RFK Jr. says HHS will determine the cause of autism by Septembernews4jax.com",
    "link": "https://www.news4jax.com/news/politics/2025/04/10/rfk-jr-says-hhs-will-determine-the-cause-of-autism-by-september/",
    "timestamp": "2025-04-10T20:28:43Z"
  },
  {
    "title": "'Blood oath': Mike Johnson told GOP to fire him as speaker if he failed to pass MAGA bill",
    "description": "House Speaker Mike Johnson (R-LA) privately told House GOP lawmakers to remove him from the speakership if he can't get President Donald Trump's \"big, beautiful bill\" passed, Politico reported on Thursday.This pledge followed general discontent from Republica…",
    "link": "https://www.rawstory.com/mike-johnson-2671742693/",
    "timestamp": "2025-04-10T20:28:04Z"
  },
  {
    "title": "Administration pauses new miner safety measures amid pledge to reinvigorate coal",
    "description": "Safety advocates are bemoaning the delay of new safety standards to protect coal miners from deadly dust exposure.",
    "link": "https://abcnews.go.com/US/trump-administration-pauses-new-miner-safety-measures-amid/story?id=120685399",
    "timestamp": "2025-04-10T20:27:48Z"
  },
  {
    "title": "Donald Trump Laughs Off China Reducing U.S. Movies Amid Tariff Drama: ‘I Think I’ve Heard Worse Things’",
    "description": "Donald Trump is laughing off China’s decision to reduce the number of U.S. movies it allows to play in the country. The China Film Administration confirmed the reduction on April 10 after reports surfaced a day earlier. Hours later, Trump was asked at a press…",
    "link": "https://variety.com/2025/film/news/donald-trump-laughs-china-hollywood-movies-1236366364/",
    "timestamp": "2025-04-10T20:26:57Z"
  },
  {
    "title": "Breaking Down the ‘Insider Trading’ Accusations Leveled at Trump After Tariffs U-Turn",
    "description": "Senator Adam Schiff wants Trump to be investigated over potential insider trading and stock market manipulation after his tariffs pause.",
    "link": "https://time.com/7276515/explaining-insider-trading-accusations-leveled-at-trump-tariffs-pause/",
    "timestamp": "2025-04-10T20:26:45Z"
  },
  {
    "title": "US budget deficit grows to $1.3 trillion, the second highest six-month level on record",
    "description": "US budget deficit grows to $1.3 trillion, the second highest six-month level on recordclickondetroit.com",
    "link": "https://www.clickondetroit.com/news/politics/2025/04/10/us-budget-deficit-grows-to-13-trillion-the-second-highest-six-month-level-on-record/",
    "timestamp": "2025-04-10T20:26:28Z"
  },
  {
    "title": "Peter Navarro Reportedly Benched in Trump Trade Team Re-Shuffle",
    "description": "Peter Navarro, senior counselor for trade and manufacturing to President Donald Trump, has been benched on Trump's trade team.\nThe post Peter Navarro Reportedly Benched in Trump Trade Team Re-Shuffle first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/peter-navarro-reportedly-benched-in-trump-trade-team-re-shuffle/",
    "timestamp": "2025-04-10T20:23:53Z"
  },
  {
    "title": "Trump's tariff tug of war",
    "description": "After days of market turmoil, President Trump walked back some tariffs on some countries, but kept a near universal 10 percent tariff in place and increased tariffs on goods from China. What's behind the president's decision, and will markets continue to stom…",
    "link": "https://www.npr.org/2025/04/10/1243870153/podcast-tariff-changes",
    "timestamp": "2025-04-10T20:23:32Z"
  },
  {
    "title": "Trump Tariff Policy Could Crush China's Slave-Linked Temu, Shein Shopping Apps",
    "description": "President Donald Trump's policies increasing duties and tariffs on products imported from China announced on Wednesday could pose an existential threat to low-quality, cheap goods Chinese shopping sites such as Shein and Temu, experts warned.\nThe post Trump T…",
    "link": "https://www.breitbart.com/economy/2025/04/10/trump-tariff-policy-could-crush-chinas-slave-linked-temu-shein-shopping-apps/",
    "timestamp": "2025-04-10T20:23:11Z"
  },
  {
    "title": "Why mortgage rates aren't falling—despite the tariff pause",
    "description": "Mortgage rates might not be heading lower anytime soon — even with President Donald Trump pausing tariffs. A sharp sell-off in government bonds is a big reason why.\nYields on 10-year Treasury bonds — which tend to push mortgage rates higher when they rise — h…",
    "link": "https://biztoc.com/x/9635e72ddb5c7640",
    "timestamp": "2025-04-10T20:23:11Z"
  },
  {
    "title": "Senator Warren Calls On Congress to Stand Up to Trump",
    "description": "President Donald Trump said he wasn’t considering a pause on his plan to implement sweeping additional tariffs on dozens of countries despite outreach from trading partners eager to avoid the levies, while still signaling he could be open to some negotiations…",
    "link": "https://biztoc.com/x/c34747ae8b838e58",
    "timestamp": "2025-04-10T20:23:07Z"
  },
  {
    "title": "Trump's 'instincts' could exempt Apple & others from tariffs",
    "description": "US President Donald Trump said he might consider tariff exemptions for companies like Apple based on his \"instincts.\"",
    "link": "https://www.androidheadlines.com/2025/04/trumps-instincts-exempt-apple-others-tariffs-china.html",
    "timestamp": "2025-04-10T20:22:40Z"
  },
  {
    "title": "Trump Was Right to Fire Vice Admiral Shoshana Chatfield",
    "description": "The time for double standards is over. An apolitical military must be apolitical—and focused on the task of winning wars.\nThe post Trump Was Right to Fire Vice Admiral Shoshana Chatfield appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/trump-was-right-to-fire-vice-admiral-shoshana-chatfield",
    "timestamp": "2025-04-10T20:21:38Z"
  },
  {
    "title": "Donald Trump Now A 'Supervillain' In Canadian Comic, Elon Musk His Sidekick",
    "description": "The world has heard of Donald Trump the businessman, then came Donald Trump the President, but amid growing resentment in Canada, the US President emerged in a new avatar - a supervillain.",
    "link": "https://www.ndtv.com/world-news/donald-trump-now-a-supervillian-in-canadian-comic-elon-musk-as-his-sidekick-8135965",
    "timestamp": "2025-04-10T20:21:21Z"
  },
  {
    "title": "NYPD searches for scooter-riding suspect who left brick with swastika on Tesla Cybertruck in Jewish community",
    "description": "The NYPD is searching for a scooter-riding woman who left trash and a brick with swastika on a Tesla Cybertruck in a Brooklyn Jewish community.",
    "link": "https://www.foxnews.com/us/nypd-searches-scooter-riding-suspect-left-brick-swastika-tesla-cybertruck-jewish-community",
    "timestamp": "2025-04-10T20:21:14Z"
  },
  {
    "title": "If You Love Donald Trump, Wear His Head On Your Lapel. Or A Golden Trump Pinhead",
    "description": "Here today, gone to Mao.",
    "link": "https://www.wonkette.com/p/if-you-love-donald-trump-wear-his",
    "timestamp": "2025-04-10T20:20:49Z"
  },
  {
    "title": "US budget deficit grows to $1.3 trillion, the second highest six-month level on record",
    "description": "The U.S. budget deficit has grown to more than $1.3 trillion in the first half of the fiscal year. The Treasury Department says it's the second highest six-month deficit on record. The deficit for October through March spans the administrations of President J…",
    "link": "https://www.seattlepi.com/news/politics/article/us-budget-deficit-grows-to-1-3-trillion-the-20269635.php",
    "timestamp": "2025-04-10T20:20:43Z"
  },
  {
    "title": "Tesla shares retreat following sharpest rally since 2013",
    "description": "After soaring 23% on Wednesday due to President Trump's pause on most new tariffs, Tesla shares dropped on Thursday along with the broader market.",
    "link": "https://www.cnbc.com/2025/04/10/tesla-shares-retreat-following-sharpest-rally-since-2013.html",
    "timestamp": "2025-04-10T20:20:22Z"
  },
  {
    "title": "Bitcoin Wavers as ‘Confusing Environment’ on Wall Street Sets In",
    "description": "The leading cryptocurrency couldn’t hold above the $80,000 mark on Thursday.",
    "link": "https://decrypt.co/314405/bitcoin-wavers-confusing-environment-on-wall-street-sets-in",
    "timestamp": "2025-04-10T20:20:12Z"
  },
  {
    "title": "Trade shake-up: Bessent leads on trade as Lutnick plays 'bad cop' — and Navarro is sidelined (Politico)",
    "description": "Politico:\nTrade shake-up: Bessent leads on trade as Lutnick plays ‘bad cop’ — and Navarro is sidelined  —  The Treasury secretary has emerged as a soothing presence and a voice of reason amid this week's tariff fracas.  —  President Donald Trump this week upe…",
    "link": "https://www.memeorandum.com/250410/p120",
    "timestamp": "2025-04-10T20:20:01Z"
  },
  {
    "title": "The Netflix Show That Changed Television Is Back. I Still Can’t Get Over Who Made It.",
    "description": "He's a household name of a very different sort in Britain.",
    "link": "https://slate.com/culture/2025/04/netflix-tv-show-black-mirror-streaming-charlie-brooker.html",
    "timestamp": "2025-04-10T20:19:34Z"
  },
  {
    "title": "RFK Jr. Promises To Identify Cause Of Autism By September — What To Know About His Claim",
    "description": "President Donald Trump baselessly suggested in a presidential cabinet meeting the rise could be from vaccines.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/04/10/rfk-jr-promises-to-identify-cause-of-autism-by-september---what-to-know-about-his-claim/",
    "timestamp": "2025-04-10T20:18:48Z"
  },
  {
    "title": "EU could tax big tech if Trump trade talks fail, Von der Leyen tells FT",
    "description": "The EU is prepared to deploy its most powerful trade measures and may impose levies on U.S. digital companies if negotiations with U.S. President Donald Trump fail, EU President Ursula von der Leyen told the Financial Times on Thursday.The EU would seek a com…",
    "link": "https://www.channelnewsasia.com/business/eu-could-tax-big-tech-if-trump-trade-talks-fail-von-der-leyen-tells-ft-5058346",
    "timestamp": "2025-04-10T20:17:18Z"
  },
  {
    "title": "What Israel can learn about Trump's Iran strategy after his last-minute tariff U-turn",
    "description": "The U.S. president announced tariffs only to renege three days later. Trump can change his mind just as fast about his talks over Tehran's nuclear project",
    "link": "https://www.haaretz.com/israel-news/haaretz-today/2025-04-10/ty-article/.highlight/what-israel-can-learn-about-trumps-iran-strategy-after-his-last-minute-tariff-u-turn/00000196-2051-dc5b-af96-69f590140002",
    "timestamp": "2025-04-10T20:17:00Z"
  },
  {
    "title": "Democrat Senator Asked To Cough Up Evidence Trump Committed ‘Insider Trading’ – He Admits There Are No Receipts Yet",
    "description": "Democratic Sen. Richard Blumenthal of Connecticut admitted Thursday there was no evidence President Donald Trump committed insider trading.",
    "link": "https://dailycaller.com/2025/04/10/democrat-senator-cough-up-evidence-trump-committed-insider-trading/",
    "timestamp": "2025-04-10T20:15:49Z"
  },
  {
    "title": "Ether Is Exponentially Overvalued, According to Samson Mow — Here’s Why",
    "description": "Bitcoin OG and Jan3 CEO Samson Mow is once again targeting Ethereum (ETH), the industry’s second-largest crypto by market value.",
    "link": "https://zycrypto.com/ether-is-exponentially-overvalued-according-to-samson-mow-heres-why/",
    "timestamp": "2025-04-10T20:15:28Z"
  },
  {
    "title": "Bitcoin falls below $80,000 as the rally subsides",
    "description": "Winning the White House was supposed to transform the crypto sector, but for much of this year, it hasn’t paid off for holders of leading cryptocurrencies.Read more...",
    "link": "https://qz.com/bitcoin-below-80-000-ether-xrp-down-1851775702",
    "timestamp": "2025-04-10T20:15:00Z"
  },
  {
    "title": "Vladimir Guerrero Jr.'s record deal pushes MLB further towards first billion-dollar contract",
    "description": "Major League Baseball&apos;s financial ceiling continues to rise, sharply. \n\nOver the past two offseasons, a series of jaw-dropping contracts have reset the standard for what elite",
    "link": "https://www.marca.com/en/mlb/toronto-blue-jays/2025/04/10/67f820dce2704e0d0b8b4582.html",
    "timestamp": "2025-04-10T20:14:28Z"
  },
  {
    "title": "Trump must face defamation lawsuit from Central Park Five defendants - Reuters",
    "description": "Trump must face defamation lawsuit from Central Park Five defendantsReuters Trump must face Central Park 5 defamation suit, judge rulesThe Hill Judge rules Trump can’t get rid of Central Park Five defamation lawsuitMSNBC News President Trump loses bid to end …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176996413",
    "timestamp": "2025-04-10T20:13:19Z"
  },
  {
    "title": "Hudson River helicopter crash: Siemens executive Agustín Escobar and family among dead",
    "description": "A family’s afternoon sightseeing excursion above the misty shoreline of Manhattan ended in tragedy Thursday after the helicopter carrying them crashed off the New Jersey shoreline, killing them and the pilot.",
    "link": "https://www.cnn.com/2025/04/10/us/hudson-river-helicopter-crash/index.html",
    "timestamp": "2025-04-10T20:13:00Z"
  },
  {
    "title": "Argentina’s Shale Patch a Sure Thing Even at $45 Oil, YPF Says",
    "description": "Falling oil prices won’t derail Argentina’s burgeoning shale boom unless they plunge below $45 a barrel, said the chief executive of the country’s top driller, state-run YPF SA.",
    "link": "https://financialpost.com/pmn/business-pmn/argentinas-shale-patch-a-sure-thing-even-at-45-oil-ypf-says",
    "timestamp": "2025-04-10T20:12:42Z"
  },
  {
    "title": "Greek PM Mitsotakis wants zero-tariff EU-US trade deal in 90 days",
    "description": "“There will only be losers, if we don't manage to resolve this”, Mitsotakis told a conference crowd.",
    "link": "https://www.euractiv.com/section/politics/news/greek-pm-mitsotakis-wants-zero-tariff-eu-us-trade-deal-in-90-days/",
    "timestamp": "2025-04-10T20:12:37Z"
  },
  {
    "title": "What advisors are telling their clients after the latest bond market sell-off",
    "description": "As investors digest the latest bond market sell-off, advisors have tips about portfolio allocation amid continued market volatility.",
    "link": "https://www.cnbc.com/2025/04/10/bond-market-sell-off.html",
    "timestamp": "2025-04-10T20:12:23Z"
  },
  {
    "title": "'Nobody’s ever heard of it. It’s gonna be a record': Donald Trump is claiming victory for the stock market’s rebound",
    "description": "‘Nobody’s ever heard of it. It’s gonna be a record’: Donald Trump is claiming victory for the stock market’s rebound\nPresident Donald Trump has commented on the stock market's performance after he paused his controversial tariff hikes\nAnna Moneymaker - Getty …",
    "link": "https://biztoc.com/x/634bf5a30c52bdb2",
    "timestamp": "2025-04-10T20:12:19Z"
  },
  {
    "title": "Donald Trump Backpedaling on Tariffs Shows Weakness—Economist",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's changing tariffs policy reveals a weakness in the U.S. economy regarding its bond market, according to economist Timothy Ash of the Chatham House think tank.\nWhy It Matters\nOn Wednesda…",
    "link": "https://biztoc.com/x/c5a9ed1225b1e9c0",
    "timestamp": "2025-04-10T20:12:14Z"
  },
  {
    "title": "Abusive bully: Sacked diplomat Phil Goff blasts Donald Trump again",
    "description": "Goff described the US President as an abusive bully before a packed lecture hall.",
    "link": "https://www.nzherald.co.nz/nz/politics/abusive-bully-sacked-diplomat-phil-goff-blasts-donald-trump-again/GGQINIIQOVBIHIK2JXP4EXATHI/",
    "timestamp": "2025-04-10T20:11:22Z"
  },
  {
    "title": "Apple has few incentives to start making iPhones in U.S., despite Trump's trade war with China",
    "description": "President Donald Trump’s administration has been predicting its barrage of tariffs targeting China will push Apple into manufacturing the iPhone in the U",
    "link": "https://www.wsbtv.com/news/apple-has-few/ATOR34RYNRG2BNQX26JY6LKZEU/",
    "timestamp": "2025-04-10T20:10:50Z"
  },
  {
    "title": "15 Examples of Regretful MAGA Folks Who Messed Around and Found Out After Voting for Trump",
    "description": "There is a new trend of voters who chose President Donald Trump on the ballot speaking out against their vote and voicing their regrets now that they’ve had a few months to experience his presidency.Read more...",
    "link": "https://www.theroot.com/15-examples-of-regretful-maga-folks-who-messed-around-a-1851775715",
    "timestamp": "2025-04-10T20:10:00Z"
  },
  {
    "title": "RFK Jr. says HHS will determine the cause of autism by September",
    "description": "RFK Jr. says HHS will determine the cause of autism by Septemberclickorlando.com",
    "link": "https://www.clickorlando.com/news/politics/2025/04/10/rfk-jr-says-hhs-will-determine-the-cause-of-autism-by-september/",
    "timestamp": "2025-04-10T20:09:12Z"
  },
  {
    "title": "RFK Jr. says HHS will determine the cause of autism by September",
    "description": "RFK Jr. says HHS will determine the cause of autism by Septemberclickondetroit.com",
    "link": "https://www.clickondetroit.com/news/politics/2025/04/10/rfk-jr-says-hhs-will-determine-the-cause-of-autism-by-september/",
    "timestamp": "2025-04-10T20:09:05Z"
  },
  {
    "title": "RFK Jr. Whines About Focus on Child Measles Deaths on His Watch",
    "description": "The secretary of health thinks he’s done an “amazing job” battling the deadly outbreak.",
    "link": "https://www.thedailybeast.com/rfk-jr-whines-about-focus-on-child-measles-deaths-on-his-watch/",
    "timestamp": "2025-04-10T20:07:50Z"
  },
  {
    "title": "Oil Tumbles as Tariff Jitters Return",
    "description": "Oil prices dropped sharply as US tariff hikes and OPEC+ output shifts raised fears of a global glut.",
    "link": "https://www.rigzone.com/news/wire/oil_tumbles_as_tariff_jitters_return-10-apr-2025-180205-article/",
    "timestamp": "2025-04-10T20:07:37Z"
  },
  {
    "title": "Independent Analyses Contradict Navarro’s $6 Trillion-Plus Tariff Revenue Estimate",
    "description": "Before President Donald Trump paused some new tariffs that he unveiled on April 2, several economic groups estimated that tariffs he has announced this year could raise between roughly $2 trillion and more than $4 billion in federal revenue over a 10-year per…",
    "link": "https://www.factcheck.org/2025/04/independent-analyses-contradict-navarros-6-trillion-plus-tariff-revenue-estimate/",
    "timestamp": "2025-04-10T20:07:19Z"
  },
  {
    "title": "Trump Says He’ll Work With Farmers To Not Immediately Deport Key Laborers",
    "description": "President Donald Trump told reporters during a Thursday cabinet meeting that he would work with American farmers to not deport their key migrant workers. “We’re also gonna work with farmers that if they have strong recommendations for their farms for certain …",
    "link": "https://dailycaller.com/2025/04/10/donald-trump-farmers-deport-key-laborers-ice-cbp-illegal-migrants/",
    "timestamp": "2025-04-10T20:06:49Z"
  },
  {
    "title": "Why did Trump pause the tariffs? Look to the bond market.",
    "description": "President Trump had brushed off the stock market's plunge, but turmoil in the bond market got his administration's attention.",
    "link": "https://www.cbsnews.com/news/trump-tariff-pause-bond-market-bond-yield-treasury-bill/",
    "timestamp": "2025-04-10T20:06:49Z"
  },
  {
    "title": "Florida Charges Second Failed Trump Assassin Suspect with Attempted Murder, Terrorism",
    "description": "Ryan Wesley Routh, the second wannabe assassin of President Donald Trump during the 2024 election season, has been charged with attempted murder and terrorism by the state of Florida.\nThe post Florida Charges Second Failed Trump Assassin Suspect with Attempte…",
    "link": "https://www.breitbart.com/pre-viral/2025/04/10/florida-charges-second-failed-trump-assassin-suspect-attempted-murder-terrorism/",
    "timestamp": "2025-04-10T20:06:13Z"
  },
  {
    "title": "DOGE Cuts Watchdogs Investigating Self-Driving Teslas: Report",
    "description": "Elon Musk and his Department of Government Efficiency (DOGE) made cuts to transportation safety regulators in February.",
    "link": "https://www.newsweek.com/doge-cuts-watchdogs-investigating-self-driving-teslas-2058241",
    "timestamp": "2025-04-10T20:05:10Z"
  },
  {
    "title": "Donald Trump Backpedaling on Tariffs Shows Weakness—Economist",
    "description": "An economist said China and the rest of the world can now see Trump's \"soft underbelly.\"",
    "link": "https://www.newsweek.com/trump-tariffs-policy-china-bond-markets-economists-2057949",
    "timestamp": "2025-04-10T20:03:48Z"
  },
  {
    "title": "Will Trump Extend Tariff Pause? ‘We’ll Have To See What Happens,’ He Says",
    "description": "Trump also said “it’s possible” he would offer exemptions for some countries and companies.",
    "link": "https://www.forbes.com/sites/saradorn/2025/04/10/will-trump-extend-tariff-pause-well-have-to-see-what-happens-he-says/",
    "timestamp": "2025-04-10T20:03:26Z"
  },
  {
    "title": "Republican bill requiring voters’ proof of citizenship passes US House, slammed for making it harder for women to vote",
    "description": "Married women would need multiple documents to prove their citizenship if they have changed their name. “This legislation would immediately disenfranchise the 69 million women who have changed their names after marriage or divorce.\"",
    "link": "https://www.mlive.com/news/2025/04/republican-bill-requiring-voters-proof-of-citizenship-passes-us-house-slammed-for-making-it-harder-for-women-to-vote.html",
    "timestamp": "2025-04-10T20:03:24Z"
  },
  {
    "title": "Black Americans Throw Support Behind Massive Migrant Detention Facility that Democrats Seek to Shut Down",
    "description": "An organization representing black Americans is throwing its support behind the reopening of a massive migrant detention facility in Newark, New Jersey. Meanwhile, Democrats are using the courts to try to get the facility shut down. \nThe post Black Americans …",
    "link": "https://www.breitbart.com/politics/2025/04/10/black-americans-throw-support-behind-massive-migrant-detention-facility-that-democrats-seek-to-shut-down/",
    "timestamp": "2025-04-10T20:03:20Z"
  },
  {
    "title": "We’ll Know Causes of Surge in Autism by September, RFK Jr. Vows",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. made a bold claim at a Cabinet meeting Thursday with President Donald Trump, promising that his... Read More\nThe post We’ll Know Causes of Surge in Autism by September, RFK Jr. Vows appeared first on T…",
    "link": "https://www.dailysignal.com/2025/04/10/well-know-causes-surge-autism-by-september-rfk-jr-vows/",
    "timestamp": "2025-04-10T20:03:02Z"
  },
  {
    "title": "Howard Lutnick: Countries Are Making Offers They Never ‘Would Have Come With’ Before Trump Tariffs",
    "description": "Commerce Secretary Howard Lutnick said during Thursday’s Cabinet meeting that countries are approaching the United States with offers they never previously would have because of President Donald Trump’s “Liberation Day” tariffs. Lutnick was the second cabinet…",
    "link": "https://freerepublic.com/focus/f-news/4310247/posts",
    "timestamp": "2025-04-10T20:01:32Z"
  },
  {
    "title": "AAPL crumble: stock hit again, as White House clarifies 145% China tariff rate",
    "description": "After a brief respite on Wednesday, Apple's stock restarted its downward trajectory triggered by President Trump's accelerating tariff battle with China.Apple's shares have had a bad time since the tariff war began.On Wednesday, Apple ended the day at $198.85…",
    "link": "https://appleinsider.com/articles/25/04/10/aapl-crumble-stock-hit-again-as-white-house-clarifies-145-china-tariff-rate",
    "timestamp": "2025-04-10T20:01:10Z"
  },
  {
    "title": "A Republican-backed bill would upend voter registration. Here are 8 things to know",
    "description": "A Republican-backed bill would upend how Americans register to vote.",
    "link": "https://www.npr.org/2025/04/10/g-s1-59519/save-act-voter-registration",
    "timestamp": "2025-04-10T20:00:53Z"
  },
  {
    "title": "Plurality of voters feel wary of CEOs' support for Trump, while a similar share say media is too critical",
    "description": "Last month’s national NBC News poll found a near-majority of voters see CEOs of large corporations as being too supportive of President Donald Trump, while about the same share of voters also said they think the news media is too critical of the president.",
    "link": "https://www.nbcnews.com/politics/trump-administration/plurality-voters-feel-wary-ceos-support-trump-similar-share-say-media-rcna200575",
    "timestamp": "2025-04-10T20:00:50Z"
  },
  {
    "title": "ICE Deletes Post About Stopping 'Illegal Ideas' From Crossing Border",
    "description": "The agency acknowledged it made a mistake with the wording.",
    "link": "https://www.newsweek.com/ice-illegal-ideas-border-security-social-media-post-2058217",
    "timestamp": "2025-04-10T20:00:45Z"
  },
  {
    "title": "Trump directs agencies to quietly repeal regulations — without public notice (Hassan Ali Kanu/Politico)",
    "description": "Hassan Ali Kanu / Politico:\nTrump directs agencies to quietly repeal regulations — without public notice  —  The memo appears to rely on a misinterpretation of a recent Supreme Court ruling.  —  President Donald Trump has instructed federal agencies and their…",
    "link": "https://www.memeorandum.com/250410/p116",
    "timestamp": "2025-04-10T20:00:36Z"
  },
  {
    "title": "Ethereum Price Dump: Is Donald Trump’s World Liberty Finance Behind The Crash To $1,400?",
    "description": "The Ethereum price crash to $1,400 has shaken the crypto market, amplifying already volatile conditions. This dramatic price drop comes after a major ETH sell-off by US President Donald Trump’s World Liberty Finance, suggesting that the recent dump may have b…",
    "link": "http://www.newsbtc.com/news/ethereum/ethereum-price-crash-to-1400/",
    "timestamp": "2025-04-10T20:00:08Z"
  },
  {
    "title": "Visas revoked for 7 international students at Virginia Tech, 3 at VCU, 10 at GMU",
    "description": "Virginia Tech officials said they were seeking an explanation of the immigration actions.",
    "link": "https://roanoke.com/news/local/education/higher-education/virginia-tech/article_faf2c133-909c-4d89-a6fa-31fc802ce20b.html",
    "timestamp": "2025-04-10T20:00:00Z"
  },
  {
    "title": "Democrats Call Out Gretchen Whitmer For White House Visit",
    "description": "The Michigan governor said she understands Trump's motivation behind the tariffs.",
    "link": "https://www.huffpost.com/entry/democrats-call-out-gretchen-whitmer-for-white-house-visit_n_67f7d777e4b0c6da0010f3a4",
    "timestamp": "2025-04-10T19:58:14Z"
  },
  {
    "title": "ICE Pledges to Stop Illegal ‘Ideas’ From Entering U.S. — Then Deletes the Post",
    "description": "The telling social media missive comes as the Trump administration continues to target immigrants and residents for removal based off of their political beliefs",
    "link": "http://www.rollingstone.com/politics/politics-news/ice-pledges-stop-illegal-ideas-1235314913/",
    "timestamp": "2025-04-10T19:57:49Z"
  },
  {
    "title": "The Retribution Is Here",
    "description": "As Donald Trump once told his supporters: “I am your retribution.” Now he’s making good on that promise. In a stunning escalation, Trump signed two executive orders that direct the federal government to investigate and",
    "link": "https://politicalwire.com/2025/04/10/the-retribution-is-here/",
    "timestamp": "2025-04-10T19:57:13Z"
  },
  {
    "title": "Donald Trump Can’t Stop, Won’t Stop, Retaliating Against Anyone Who Resisted His Lies About the 2020 Election",
    "description": "In a series of executive orders signed Wednesday, the president made his displeasure with his perceived enemies known. His latest targets include the New York law firm that defended Dominion Voting Systems.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-cant-stop-wont-stop-retaliating-against-anyone-who-resisted-his-lies-about-the-2020-election",
    "timestamp": "2025-04-10T19:56:18Z"
  },
  {
    "title": "Bank of England Delays $779 Million Bond Sale After Tariff Turmoil",
    "description": "England’s central bank has postponed a bond sale following an uptick in tariff-related market pressure. As Bloomberg News reported Thursday (April 10), the Bank of England (BOE) had planned to sell the long-dated bonds under its quantitative tightening progra…",
    "link": "https://www.pymnts.com/news/banking/2025/bank-of-england-delays-779-million-bond-sale-after-tariff-turmoil/",
    "timestamp": "2025-04-10T19:55:44Z"
  },
  {
    "title": "Trump and team downplay continued market turmoil as 'transition cost'",
    "description": "President Trump and his top officials brushed off continued turmoil from his tariff approach as \"transition problems\" as uncertainty remains about what's next.",
    "link": "https://abcnews.go.com/Politics/trump-team-downplay-continued-market-turmoil-transition-cost/story?id=120677607",
    "timestamp": "2025-04-10T19:55:18Z"
  },
  {
    "title": "Jon Stewart Flummoxed By Trump’s Tariff Flip-Flop: He’s ‘Killing the Hostage and Then Asking for Ransom’",
    "description": "Jon Stewart scratched his head over President Donald Trump's \"killing the hostage and then asking for ransom\" policies, including his imposed tariffs.\nThe post Jon Stewart Flummoxed By Trump’s Tariff Flip-Flop: He’s ‘Killing the Hostage and Then Asking for Ra…",
    "link": "https://www.mediaite.com/podcasts/jon-stewart-flummoxed-by-trumps-tariff-flip-flop-hes-killing-the-hostage-and-then-asking-for-ransom/",
    "timestamp": "2025-04-10T19:53:16Z"
  },
  {
    "title": "Trump’s Trade War May Still Tank The Economy",
    "description": "The U.S. still has higher import taxes than the ones that deepened and locked in the Great Depression, even after Trump's partial backtrack on Wednesday",
    "link": "https://www.huffpost.com/entry/trump-trade-war-still-dangerous_n_67f7fe81e4b09493c8d8827a",
    "timestamp": "2025-04-10T19:52:58Z"
  }
]