[
  {
    "title": "Lessons from the fashion industry: Why some DEI efforts fail to resonate with consumers",
    "description": "While some fashion and beauty companies have held firm to their DEI commitments, others have reneged on their promise to reflect on and represent consumer diversity.",
    "link": "https://theconversation.com/lessons-from-the-fashion-industry-why-some-dei-efforts-fail-to-resonate-with-consumers-255091",
    "timestamp": "2025-05-05T13:49:13Z"
  },
  {
    "title": "'Unmistakable vibe of corruption': MSNBC panelist accuses Trump of 'market manipulation'",
    "description": "A panelist on MSNBC's \"Morning Joe\" called out the possibility that President Donald Trump and his high-ranking officials were engaged in \"market manipulation\" with his trade war.The president has rattled global markets with his on-again, off-again tariffs ag…",
    "link": "https://www.rawstory.com/donald-trump-insider-trading-2671893170/",
    "timestamp": "2025-05-05T13:48:19Z"
  },
  {
    "title": "Stocks slide as Warren Buffett bows out",
    "description": "Stockssank Monday morning as investors digested the twin shocks of Warren Buffett’s retirement announcement and the cautious tone in Berkshire Hathaway’s...",
    "link": "https://finance.yahoo.com/news/stocks-slides-warren-buffett-bows-123318953.html",
    "timestamp": "2025-05-05T13:46:00Z"
  },
  {
    "title": "Tara Palmeri Calls Out Piers Morgan for Platforming ‘Conspiracy Theories’ That Virginia Guiffre ‘Was Killed’ by Jeffrey Epstein’s ‘Powerful Friends’: ‘Shame On You!’",
    "description": "Journalist Tara Palmeri called out Piers Morgan for what she argued was exploitation of Jeffrey Epstein accuser Virginia Giuffre’s death — accusing the British broadcaster of giving airtime to “conspiracy theories” from Guiffre’s father that his daughter may …",
    "link": "https://www.mediaite.com/news/tara-palmeri-calls-out-piers-morgan-for-platforming-conspiracy-theories-that-virginia-guiffre-was-killed-by-jeffrey-epsteins-powerful-friends-shame-on-you/",
    "timestamp": "2025-05-05T13:45:59Z"
  },
  {
    "title": "Inside Melania Trump's 'eye-watering' multi-million dollar deal with Amazon that has sparked Hollywood 'meltdown'",
    "description": "Amazon Prime Video will release a documentary about Melania Trump. Amazon reportedly paid $40 million to license the film. But more than the unbelievable Amazon prime payday is the director of the documentary Bret Ratner who has been accused of sexual assault…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-inside-melania-trumps-mysterious-multi-million-dollar-deal-with-amazon-that-has-sparked-hollywood-meltdown-jeff-bezos/articleshow/120902955.cms",
    "timestamp": "2025-05-05T13:45:37Z"
  },
  {
    "title": "Trump says he’ll reopen, expand Alcatraz prison for nation’s ‘most ruthless and violent’ offenders",
    "description": "The prison was closed in 1963 due to crumbling infrastructure and the high costs of repairing and supplying the island facility, because everything from fuel to food had to be brought by boat.",
    "link": "https://www.pbs.org/newshour/nation/trump-says-hell-reopen-expand-alcatraz-prison-for-nations-most-ruthless-and-violent-offenders",
    "timestamp": "2025-05-05T13:45:14Z"
  },
  {
    "title": "Ackman Slams Harvard for Failures, Calls for Pritzker Exit (Janet Lorin/Bloomberg)",
    "description": "Janet Lorin / Bloomberg:\nAckman Slams Harvard for Failures, Calls for Pritzker Exit  —  Bill Ackman rattled off a list of concerns over how his alma mater Harvard University has handled the conflict with President Donald Trump, arguing it needs a change in bo…",
    "link": "https://www.memeorandum.com/250505/p36",
    "timestamp": "2025-05-05T13:45:01Z"
  },
  {
    "title": "Iran FM Araghchi in Pakistan to discuss US nuclear talks",
    "description": "The visit comes on the heels of a recent terrorist attack in Pahalgam in India’s Kashmir region, which has enflamed tensions between India and Pakistan.",
    "link": "https://www.jpost.com/middle-east/article-852729",
    "timestamp": "2025-05-05T13:44:11Z"
  },
  {
    "title": "Trump's War on Foreign Films",
    "description": "Foreign films fucked: Another week, another round of tariffs! Yesterday, President Donald Trump said he would be imposing 100 percent tariffs on all foreign films. \"WE WANT MOVIES MADE IN AMERICA, AGAIN!\" declared Trump, who called foreign films a \"national s…",
    "link": "https://biztoc.com/x/ed24153c8cd751a7",
    "timestamp": "2025-05-05T13:44:04Z"
  },
  {
    "title": "Trump says foreign-made films are a ‘national security threat’, wants them hit with a 100% tariff",
    "description": "President Donald Trump is opening a new salvo in his tariff war, targeting films made outside the U.S.In a post Sunday night on his Truth Social platform, Trump said he has authorized the Department of Commerce and the Office of the U.S. Trade Representative …",
    "link": "https://biztoc.com/x/c5f6546a7d1b52ae",
    "timestamp": "2025-05-05T13:44:01Z"
  },
  {
    "title": "Many Catholic leaders weren’t amused by Trump’s ‘joke’ about becoming pope",
    "description": "When Donald Trump isn't using faith as a sword against his perceived political foes, he’s using it as a punch line to an unnecessary joke.",
    "link": "https://biztoc.com/x/7c0368eaed88fad4",
    "timestamp": "2025-05-05T13:43:58Z"
  },
  {
    "title": "Hardline candidate wins first round of Romanian presidential elections",
    "description": "The News\nAn anti-immigration hardliner who wants to halt military aid to Ukraine won the first round of Romania’s presidential election.\nIn a resounding defeat for Romania’s pro-European governing coalition, George Simion, a firm supporter of US President Don…",
    "link": "https://biztoc.com/x/c82d6a9a8f5d89d7",
    "timestamp": "2025-05-05T13:43:58Z"
  },
  {
    "title": "Trump set to raise millions from crypto and memecoin this month",
    "description": "President Donald Trump has two crypto-focused dinners on the calendar this month — one aimed at deep-pocketed political donors, the other at meme coin millionaires. Both are poised to help him rake in millions.\nThe first event, a $1.5 million-per-plate fundra…",
    "link": "https://biztoc.com/x/49ad19e8fefb16d4",
    "timestamp": "2025-05-05T13:43:47Z"
  },
  {
    "title": "When Carney meets Trump: Here’s what to expect from Tuesday’s high stakes White House encounter",
    "description": "Prime Minister Mark Carney and U.S. President Donald Trump are meeting for the first time this week. Here's what to expect.",
    "link": "https://financialpost.com/news/economy/carney-trump-expect-tuesday-white-house-encounter",
    "timestamp": "2025-05-05T13:43:40Z"
  },
  {
    "title": "Maine 1, Trump 0 – Governor celebrates after winning legal battle over trans athletes",
    "description": "Maine “took on Trump and won” in a legal battle over trans athletes, Democratic governor Janet Mills has said.  In February, during a meeting of the governors at the White House, President Donald Trump threatened to withhold federal funds from the state of Ma…",
    "link": "https://www.thepinknews.com/2025/05/05/trump-vs-maine-governor/",
    "timestamp": "2025-05-05T13:41:35Z"
  },
  {
    "title": "Donald Trump calls for reopening of Alcatraz prison",
    "description": "US President Donald Trump says he is directing his government to reopen and expand Alcatraz, the notorious former prison on a California island.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-calls-for-reopening-of-alcatraz-prison/a669469289.html",
    "timestamp": "2025-05-05T13:41:29Z"
  },
  {
    "title": "Top Doctor Behind Defense Department’s Vaccine Mandate Who Tossed Thousands of Men and Women from US Military For Not Taking Jab – Sues to Get Her Job Back",
    "description": "Former senior defense official Dr. Terry Adirim, who was behind the unconstitutional military vaccine mandate, was reportedly fired from her position in February 2025 shortly after President Trump took office. Dr. Terry Adirim, a senior CIA official and forme…",
    "link": "https://freerepublic.com/focus/f-news/4315114/posts",
    "timestamp": "2025-05-05T13:40:45Z"
  },
  {
    "title": "Trump tariffs: 100% levies on films made abroad",
    "description": "Trump describes foreign production as a “national security threat,” though there is confusion over the precise nature of the tariffs.",
    "link": "https://www.thefader.com/2025/05/05/trump-tariffs-movies-produced-foreign-lands",
    "timestamp": "2025-05-05T13:40:16Z"
  },
  {
    "title": "‘Rotten Newspaper! You Hear Me?!’ Trump Absolutely Loses It on a Wall Street Journal Reporter Who Asked About Putin Talks",
    "description": "President Donald Trump lashed out at a Wall Street Journal reporter who was asking about his talks with Russia's Vladimir Putin.\nThe post ‘Rotten Newspaper! You Hear Me?!’ Trump Absolutely Loses It on a Wall Street Journal Reporter Who Asked About Putin Talks…",
    "link": "https://www.mediaite.com/news/rotten-newspaper-you-hear-me-trump-absolutely-loses-it-on-a-wall-street-journal-reporter-who-asked-about-putin-talks/",
    "timestamp": "2025-05-05T13:40:11Z"
  },
  {
    "title": "US stocks open lower after Trump's fresh tariffs; Fed meet on tap",
    "description": "Wall Street's main indexes opened lower on Monday after President Donald Trump rekindled worries about the ramifications of a global trade war by introducing new tariffs, while focus remained on the Fed's monetary policy decision later this week.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-after-trumps-fresh-tariffs-fed-meet-on-tap/articleshow/120902943.cms",
    "timestamp": "2025-05-05T13:39:07Z"
  },
  {
    "title": "It's not always easy to find gender-inclusive health care in B-N",
    "description": "Providers and patients say finding gender inclusive health care in B-N could be easier — and there could be more of it.",
    "link": "https://www.wglt.org/local-news/2025-05-05/providers-and-patients-say-b-n-could-do-more-to-help-trandgender-and-nonbinary-community-members-nag",
    "timestamp": "2025-05-05T13:38:54Z"
  },
  {
    "title": "Trump to postpone ‘TikTok ban’ because of ‘sweet spot’ for social media-obsessed Gen Z",
    "description": "President Donald Trump vowed to extend the deadline for the \"TikTok ban\" until a deal is struck to sell the Chinese-owned social media app to a U.S. owner, saying in an interview on Sunday that he has a \"warm spot\" in his heart for it.",
    "link": "https://nypost.com/2025/05/05/tech/trump-to-postpone-tiktok-ban-because-of-sweet-spot-for-social-media-obsessed-gen-z/",
    "timestamp": "2025-05-05T13:38:37Z"
  },
  {
    "title": "Netflix Suffers $20 Billion Loss As Trump Wields 100% Movie Tariffs",
    "description": "The streaming service had previously been hailed by Wall Street as a “predictable” stock amid Trump’s unpredictable tariffs.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/05/05/netflix-suffers-20-billion-loss-as-trump-wields-100-movie-tariffs/",
    "timestamp": "2025-05-05T13:37:43Z"
  },
  {
    "title": "Who is Stephen Miller? The immigration hardliner who could be Donald Trump's next National Security Adviser",
    "description": "Stephen Miller could soon become Trump’s new National Security Adviser after the firing of Mike Waltz in the wake of the “Signalgate” scandal. Known for his hardline immigration stance, Miller is now being considered for one of the top security roles in the U…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-stephen-miller-the-immigration-hardliner-who-could-be-donald-trumps-next-national-security-adviser/articleshow/120900986.cms",
    "timestamp": "2025-05-05T13:37:02Z"
  },
  {
    "title": "WATCH: White House says it has ‘no timeline’ for releasing Epstein files",
    "description": "Anna Paulina Luna: 'We are pushing for maximum transparency. But again, we do not hold declassification authority'",
    "link": "https://www.wnd.com/2025/05/watch-white-house-says-it-has-no-timeline-for-releasing-epstein-files/",
    "timestamp": "2025-05-05T13:36:52Z"
  },
  {
    "title": "In battle against transgender rights, Trump targets HUD’s housing policies",
    "description": "The Trump administration has both halted enforcement of the Equal Access Rule and proposed unspecified revisions to the policy.",
    "link": "https://www.bostonherald.com/2025/05/05/trump-hud-fair-housing-lgbtq/",
    "timestamp": "2025-05-05T13:34:10Z"
  },
  {
    "title": "The cognitive fitness and in touch with the working American candidate",
    "description": "Say what you will about Donald Trump, you can’t deny he’s a devoted family man: Trump on strollers: \"All costs are down. Everything is down other than the thing you carry the babies around in.\" [image or embed] — Aaron Rupar (@atrupar.com) May 4, 2025 at 5:48…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/the-cognitive-fitness-and-in-touch-with-the-working-american-candidate",
    "timestamp": "2025-05-05T13:34:00Z"
  },
  {
    "title": "France, EU Lure US Researchers With Nearly $567 Million Incentives Amid Trump's Academic Funding Cuts",
    "description": "In response to the academic funding cuts in the U.S. under President Donald Trump, France and the EU are preparing to roll out incentives to attract U.S.-based researchers to Europe.\nWhat Happened: French President Emmanuel Macron and European Commission Pres…",
    "link": "https://biztoc.com/x/167f9a53640d48e8",
    "timestamp": "2025-05-05T13:33:24Z"
  },
  {
    "title": "Trump says ’highly unlikely’ U.S. ever uses military force to annex Canada",
    "description": "OTTAWA — \n \n \n \n \n \n U.S. President Donald Trump\n \n \n \n \n \n says it is “highly unlikely” the United States would ever use military force to annex Canada, though he maintains he will continue to push to make Canada the 51st state. \n \n \n \n \n \n \n \n \n \n \n \n \n In …",
    "link": "https://biztoc.com/x/8c65b47cd3a20209",
    "timestamp": "2025-05-05T13:33:23Z"
  },
  {
    "title": "‘Deeply Offensive’: Karl Rove Condemns Trump Sharing an Image of Himself as Pope During Fox News Hit",
    "description": "GOP strategist Karl Rove condemned President Donald Trump during a Sunday night appearance on Fox News with host Trey Gowdy, calling it \"deeply offensive.\"\nThe post ‘Deeply Offensive’: Karl Rove Condemns Trump Sharing an Image of Himself as Pope During Fox Ne…",
    "link": "https://www.mediaite.com/tv/deeply-offensive-karl-rove-condemns-trump-sharing-an-image-of-himself-as-pope-during-fox-news-hit/",
    "timestamp": "2025-05-05T13:33:21Z"
  },
  {
    "title": "Jake Tapper and Alex Thompson Did Challenge Biden’s Mental Acuity. The Footage Proves It",
    "description": "Jake Tapper and Alex Thompson expressed genuine concern about what many saw as the declining mental acuity of former President Biden during his term in office.\nThe post Jake Tapper and Alex Thompson Did Challenge Biden’s Mental Acuity. The Footage Proves It f…",
    "link": "https://www.mediaite.com/tv/jake-tapper-and-alex-thompson-did-challenge-bidens-mental-acuity-the-footage-proves-it/",
    "timestamp": "2025-05-05T13:33:21Z"
  },
  {
    "title": "German coalition deal signed on eve of Merz govt launch",
    "description": "The conservatives of Germany’s designated chancellor Friedrich Merz and the centre-left Social Democrats formally signed their coalition contract on Monday, on the eve of launching their new government. Merz, 69, is on Tuesday set to be sworn in as the new le…",
    "link": "https://www.digitaljournal.com/world/german-coalition-deal-signed-on-eve-of-merz-govt-launch/article",
    "timestamp": "2025-05-05T13:33:16Z"
  },
  {
    "title": "France, EU take aim at Trump’s assault on science, seek to lure US researchers",
    "description": "French President Emmanuel Macron and European Commission head Ursula von der Leyen took aim at Donald Trump’s policies on science on Monday, as the European Union seeks to encourage disgruntled US researchers to relocate to Europe. Von der Leyen told a confer…",
    "link": "https://www.digitaljournal.com/world/france-eu-take-aim-at-trumps-assault-on-science-seek-to-lure-us-researchers/article",
    "timestamp": "2025-05-05T13:33:16Z"
  },
  {
    "title": "Conservative School Boards Face Election Defeats in Trump Heartland",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nConservative school board candidates saw a string of defeats in parts of Texas where voters had backed President Donald Trump in November.\nWhy It Matters\nIn recent years, school boards, usually nonpartisan, ha…",
    "link": "https://biztoc.com/x/2dd9a3ed779fa03f",
    "timestamp": "2025-05-05T13:33:11Z"
  },
  {
    "title": "U.S. Plans Heavy Tariffs On Foreign Films",
    "description": "President Donald Trump announced plans to impose a 100% tariff on all foreign-made films, citing what he called a “very fast death” of the American movie industry. In a Truth Social post, Trump claimed that foreign governments are offering aggressive incentiv…",
    "link": "https://biztoc.com/x/5eb3c194e98921e3",
    "timestamp": "2025-05-05T13:33:06Z"
  },
  {
    "title": "Trump Leans Toward Extending TikTok Deadline If No Deal Is Reached",
    "description": "President Donald Trump said he has a “little warm spot” for TikTok.",
    "link": "https://www.adweek.com/media/trump-leans-toward-extending-tiktok-deadline-if-no-deal-is-reached/",
    "timestamp": "2025-05-05T13:32:45Z"
  },
  {
    "title": "Only the US Congress Can End the Economic Uncertainty",
    "description": "It is delusional to think that the Trump administration will devise a viable, let alone sensible, trade policy before its 90-day pause on “reciprocal” tariffs ends. Before prices spike and the economy starts shrinking, legislators and business leaders must re…",
    "link": "https://www.project-syndicate.org/commentary/trump-tariff-uncertainty-volatility-will-continue-unless-congress-intervenes-by-william-r-rhodes-and-stuart-p-m-mackintosh-2025-05",
    "timestamp": "2025-05-05T13:32:29Z"
  },
  {
    "title": "Trump threatens a 100% tariff on foreign-made films, saying the movie industry in the US is dying",
    "description": "The White House says no final decisions have been made on President Donald Trump's call for tariffs targeting films made outside the United States.",
    "link": "https://www.local10.com/business/2025/05/05/trump-threatens-100-tariff-on-foreign-made-films/",
    "timestamp": "2025-05-05T13:32:24Z"
  },
  {
    "title": "Europe drives to attract scientists after Trump freezes US funding",
    "description": "At the “Choose Europe for Science” event in Paris, French President Emmanuel Macron offered researchers grants and new policy plans if they move to Europe.",
    "link": "https://www.nbcnews.com/science/innovation/europe-drives-attract-scientists-trump-freezes-us-funding-rcna204803",
    "timestamp": "2025-05-05T13:31:58Z"
  },
  {
    "title": "Why Trump's push to reopen Alcatraz as a working prison is such a misguided idea",
    "description": "When looking for evidence of Trump’s lack of seriousness on matters of public policy, look no further than his plan to reopen Alcatraz to actual prisoners.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/reopening-alcatraz-working-prison-misguided-idea-rcna204796",
    "timestamp": "2025-05-05T13:30:25Z"
  },
  {
    "title": "Trump says he'll call CEOs like Jeff Bezos if he has disagreement, calls him 'very nice guy'",
    "description": "President Donald Trump defended his tariff policy in an interview with NBC News on Sunday, saying that he would reach out to CEOs like Jeff Bezos if he has disagreements.",
    "link": "https://www.foxnews.com/media/trump-says-call-ceos-jeff-bezos-disagreement-calls-very-nice-guy",
    "timestamp": "2025-05-05T13:30:21Z"
  },
  {
    "title": "Senator Rips GENIUS Act, Alleges Trump Cashing In On USD1 Coin",
    "description": "United States Sen. Elizabeth Warren is urging Congress to reject the GENIUS Act, a bill that would potentially pave the way for what she terms “crypto corruption.” Related Reading: Crypto Founder Warns: Skipping XRP Could Be The Real Risk The bill – the Guidi…",
    "link": "https://bitcoinist.com/senator-rips-genius-act-alleges-trump-cashing-in-on-usd1-coin/",
    "timestamp": "2025-05-05T13:30:03Z"
  },
  {
    "title": "EU Set to Propose Banning Russian Gas Imports by End of 2027",
    "description": "The European Union is set to propose measures to ban Russian gas imports by the end of 2027.",
    "link": "https://www.rigzone.com/news/wire/eu_set_to_propose_banning_russian_gas_imports_by_end_of_2027-05-may-2025-180429-article/",
    "timestamp": "2025-05-05T13:30:00Z"
  },
  {
    "title": "7 Big Winners Under The GOP Student Loan Forgiveness And Repayment Plan",
    "description": "The GOP’s student loan plan would reshape student loan forgiveness and repayment. Here are 7 groups, from taxpayers to doctors, who could benefit most if it becomes law.",
    "link": "https://www.forbes.com/sites/shaharziv/2025/05/05/7-big-winners-under-the-gop-student-loan-forgiveness-and-repayment-plan/",
    "timestamp": "2025-05-05T13:30:00Z"
  },
  {
    "title": "Foreign Government Threatens to Use $1 Trillion in US Treasury Holdings as Leverage in Trade Negotiations",
    "description": "Foreign Government Threatens to Use $1 Trillion in US Treasury Holdings as Leverage in Trade Negotiationswesternjournal.com",
    "link": "https://www.westernjournal.com/foreign-government-threatens-use-1-trillion-us-treasury-holdings-leverage-trade-negotiations/",
    "timestamp": "2025-05-05T13:29:36Z"
  },
  {
    "title": "Trump set to raise millions from crypto and memecoin this month",
    "description": null,
    "link": "https://www.cnbc.com/2025/05/05/trump-crypto-memecoin.html",
    "timestamp": "2025-05-05T13:29:06Z"
  },
  {
    "title": "Trump Tells Hate Leader And J6 Seditionist 'I Love You Guys' At Mar-A-Lago: Report",
    "description": "The president chatted with the former extremist group boss as he was dining at Trump's country club.",
    "link": "https://www.huffpost.com/entry/donald-trump-enrique-tarrio-proud-boys-mar-a-lago_n_6818a2f6e4b064ed9fd4de80",
    "timestamp": "2025-05-05T13:28:28Z"
  },
  {
    "title": "The Future of Sanctuary",
    "description": "Sanctuary activists face new challenges under Trump’s second term—but their work has always entailed great personal risk.",
    "link": "https://www.dissentmagazine.org/article/the-future-of-sanctuary/",
    "timestamp": "2025-05-05T13:27:51Z"
  },
  {
    "title": "How Unions Can Protect Immigrants",
    "description": "An Interview With Faye Guenther, president of UFCW Local 3000.",
    "link": "https://www.dissentmagazine.org/article/how-unions-can-protect-immigrants/",
    "timestamp": "2025-05-05T13:27:48Z"
  },
  {
    "title": "Netflix, other media stocks tumble on Trump's pledge to hit foreign films with 100% tariff",
    "description": "Trump said he would instruct the Commerce Department to implement a 100% foreign film tariff to fix Hollywood's \"very fast death.\"",
    "link": "https://www.businessinsider.com/trump-tariffs-netflix-disney-paramount-stock-price-nflx-fox-wbd-2025-5",
    "timestamp": "2025-05-05T13:26:50Z"
  },
  {
    "title": "Federal Reserve likely to defy Trump, keep rates unchanged this week",
    "description": "WASHINGTON (AP) — The Federal Reserve will likely keep its key short-term interest rate unchanged on Wednesday, despite weeks of harsh criticism and demands from President Donald Trump that the Fed reduce borrowing costs. After causing a sharp drop in financi…",
    "link": "https://financialpost.com/pmn/federal-reserve-likely-to-defy-trump-keep-rates-unchanged-this-week-2",
    "timestamp": "2025-05-05T13:25:30Z"
  },
  {
    "title": "Trump says Mexican president is afraid of cartels after she rejected his offer to send US troops to Mexico (Fox News)",
    "description": "Fox News:\nTrump says Mexican president is afraid of cartels after she rejected his offer to send US troops to Mexico  —  President Donald Trump said Sunday that Mexican President Claudia Sheinbaum rejected his offer to send U.S. troops to Mexico to help fight…",
    "link": "https://www.memeorandum.com/250505/p32",
    "timestamp": "2025-05-05T13:25:00Z"
  },
  {
    "title": "Trump's War on Foreign Films",
    "description": "Plus: Alcatraz reopening, Bukele corruption scandal, assisted suicide, and more...",
    "link": "https://reason.com/2025/05/05/trumps-war-on-foreign-films/",
    "timestamp": "2025-05-05T13:24:53Z"
  },
  {
    "title": "Cold play: Toy industry faces ‘devastating’ impact from tariffs",
    "description": "Around 96% of American toy companies are small- and medium-sized businesses. Nearly half of them could shutter due to U.S. tariff policies.",
    "link": "https://www.retaildive.com/news/toy-retail-industry-small-businesses-face-devastating-china-tariff-impact/746045/",
    "timestamp": "2025-05-05T13:24:00Z"
  },
  {
    "title": "Experts see hopeful signs as Prime Minister Mark Carney prepares to talk trade with Trump",
    "description": "Experts see hopeful signs as Mark Carney prepares to talk trade with Trump",
    "link": "https://www.nationalobserver.com/2025/05/05/news/experts-see-hopeful-signs-prime-minister-mark-carney-prepares-talk-trade-trump",
    "timestamp": "2025-05-05T13:23:43Z"
  },
  {
    "title": "Conservative School Boards Face Election Defeats in Trump Heartland",
    "description": "In school board races on May 3, conservative-backed candidates suffered losses.",
    "link": "https://www.newsweek.com/school-board-election-defeats-trump-2067993",
    "timestamp": "2025-05-05T13:23:23Z"
  },
  {
    "title": "Israel Approves Plans To Take All Of Gaza And Remain There Indefinitely",
    "description": "Israel approved plans to capture the entire Gaza Strip and remain there indefinitely. The army is calling tens of thousands of reserve soldiers to implement the plan",
    "link": "https://www.ibtimes.com/israel-approves-plans-take-all-gaza-remain-there-indefinitely-3772496",
    "timestamp": "2025-05-05T13:23:02Z"
  },
  {
    "title": "'Pay attention to reality': Red state MAGA voter begs Trump to dial back key policy",
    "description": "Not all of President Donald Trump's supporters are sticking by him.As the president's tariffs undermine the economy and put the public's life savings at risk, a number of ultra-wealthy business tycoons who backed him have turned on him. But some of the rank-a…",
    "link": "https://www.rawstory.com/maga-voter-economy/",
    "timestamp": "2025-05-05T13:22:27Z"
  },
  {
    "title": "US foreign policy driven by resource competition – former South African envoy",
    "description": "Ebrahim Rasool has criticized the “scramble for critical minerals” and said it drives global conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/616803-us-competing-critical-minerals-former-south-african-ambassador/",
    "timestamp": "2025-05-05T13:22:03Z"
  },
  {
    "title": "Trump threatens a 100% tariff on foreign-made films, saying the movie industry in the US is dying",
    "description": "Trump threatens a 100% tariff on foreign-made films, saying the movie industry in the US is dying\nPresident Donald Trump is opening a new salvo in his tariff war, targeting films made outside the United States\nNEW YORK -- NEW YORK (AP) — President Donald Trum…",
    "link": "https://biztoc.com/x/490c8f5d3fa0e76a",
    "timestamp": "2025-05-05T13:21:53Z"
  },
  {
    "title": "CNN’s Donie O’Sullivan pushes back on ‘annoying’ liberals who criticize ‘humanizing’ Trump supporters",
    "description": "CNN correspondent Donie O’Sullivan is pushing back against progressive critics who rip journalists for “platforming” and “humanizing” supporters of Donald Trump and believers in conspiracy theories. O’Sullivan said complaints from the left about humanizing su…",
    "link": "https://nypost.com/2025/05/05/media/cnns-donie-osullivan-responds-to-annoying-liberal-critics/",
    "timestamp": "2025-05-05T13:21:14Z"
  },
  {
    "title": "The clock is ticking down to zero, and Trump needs a trade deal — badly",
    "description": "President Donald Trump, the dealmaker-in-chief, has said for weeks that at least one trade deal is imminent with one of the dozens of countries in active...",
    "link": "https://www.cnn.com/2025/05/05/business/trade-war-deal-trump",
    "timestamp": "2025-05-05T13:20:30Z"
  },
  {
    "title": "In a trade-war whirlwind, shoemaker Skechers is sold for $9 billion to become a private company",
    "description": "The shoe company Skechers is being acquired for $9 billion and taken private by the investment firm by 3G Capital, the companies said Monday.",
    "link": "https://www.ksat.com/business/2025/05/05/in-a-tariff-whirlwind-shoemaker-skechers-to-be-acquired-for-9-billion-and-taken-private/",
    "timestamp": "2025-05-05T13:20:16Z"
  },
  {
    "title": "Michael Werner to Open Second Gallery in New York, US Government Finally Invites Proposals for Venice, Sotheby’s to Sell Bhudda Jewels: Morning Links for May 5, 2025",
    "description": "The gallery will launch with a two-part Sanya Katarovsky show.",
    "link": "https://www.artnews.com/art-news/news/michael-werner-to-open-second-gallery-in-new-york-us-government-finally-invites-artist-proposals-for-venice-biennale-sothebys-to-sell-bhudda-jewels-morning-links-for-may-5-2025-1234740589/",
    "timestamp": "2025-05-05T13:19:08Z"
  },
  {
    "title": "Trump says 'highly unlikely' US. would ever use military force to annex Canada",
    "description": "US President Donald Trump says it is \"highly unlikely\" the United States would ever use military force to annex Canada, though he maintains he will continue to push to make Canada the 51st state.",
    "link": "https://www.nationalobserver.com/2025/05/05/news/trump-says-highly-unlikely-us-would-ever-use-military-force-annex-canada",
    "timestamp": "2025-05-05T13:18:19Z"
  },
  {
    "title": "Five things we learned from Sweden's party leader debate",
    "description": "Swedish public broadcaster SVT held its first party leader debate of the year on May 4th. What were the key takeaways?",
    "link": "https://www.thelocal.se/20250505/five-things-we-learned-from-swedens-party-leader-debate",
    "timestamp": "2025-05-05T13:17:24Z"
  },
  {
    "title": "Global Economy Already Feeling Drag from Trump Tariffs",
    "description": "\"President Donald Trump's tariffs are increasingly clogging up the wheels of a world economy which for decades were greased by predictable and relatively free trade,\" Reuters reports. \"Big-name multinationals right down to niche e-commerce players",
    "link": "https://politicalwire.com/2025/05/05/global-economy-already-feeling-drag-from-trump-tariffs/",
    "timestamp": "2025-05-05T13:17:09Z"
  },
  {
    "title": "White House Says It Has “No Timeline” for Releasing Epstein Files (VIDEO)",
    "description": "The White House admitted it has “no specific timeline” for releasing the remaining Jeffrey Epstein files. It can be recalled that last month, President Donald Trump was asked point-blank about the long-awaited release of documents tied to Jeffrey Epstein duri…",
    "link": "https://www.thegatewaypundit.com/2025/05/white-house-says-it-has-no-timeline-releasing/",
    "timestamp": "2025-05-05T13:15:24Z"
  },
  {
    "title": "ICE Joins DeSantis in Touting Record Number of Arrests of Illegal Immigrants",
    "description": "MIRAMAR, Fla. (AP) — A record 1,120 people accused of being in the U.S. illegally were arrested in less than a week during sweep orchestrated by federal, state and local authorities in Florida, an operation officials credited on Thursday to …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/05/05/822489.htm",
    "timestamp": "2025-05-05T13:11:22Z"
  },
  {
    "title": "Trump is swiftly undoing transgender protections in HUD’s housing policies",
    "description": "The Trump administration is swiftly remaking housing policy as the U.S. Department of Housing and Urban Development retreats from long-established fair-housing protections for transgender people",
    "link": "https://abcnews.go.com/Business/wireStory/trump-swiftly-undoing-transgender-protections-huds-housing-policies-121467760",
    "timestamp": "2025-05-05T13:10:52Z"
  },
  {
    "title": "Federal Reserve likely to defy Trump, keep rates unchanged this week",
    "description": "By CHRISTOPHER RUGABER, Associated Press Economics Writer\nWASHINGTON (AP) — The Federal Reserve will likely keep its key short-term interest rate unchanged on Wednesday, despite weeks of harsh criticism and demands from President Donald Trump that the Fed red…",
    "link": "https://biztoc.com/x/68ac1791d89068d3",
    "timestamp": "2025-05-05T13:10:33Z"
  },
  {
    "title": "Trump says ’highly unlikely’ U.S. ever uses military force to annex Canada",
    "description": "U.S. President Donald Trump says it is \"highly unlikely\" the United States would ever use military force to annex Canada. Read more.",
    "link": "https://financialpost.com/news/economy/trump-us-military-annex-canada",
    "timestamp": "2025-05-05T13:10:16Z"
  },
  {
    "title": "Trump Signals Retreat on China Tariffs",
    "description": "Despite boasting about his deal-making prowess, Donald Trump is flailing in his latest economic standoff with China. After unilaterally ratcheting up tariffs with no coherent strategy, Trump now seems eager to retreat — and he’s",
    "link": "https://politicalwire.com/2025/05/05/trump-signals-retreat-on-china-tariffs/",
    "timestamp": "2025-05-05T13:10:08Z"
  },
  {
    "title": "Trump orders restoration of Alcatraz prison to lock up 'dregs of society'",
    "description": "President Donald Trump wants to restore an iconic maximum-security prison for his proposed golden age — an institution in the San Francisco Bay he regards as a \"symbol of law and order.\"\n\nTrump announced Sunday evening that he would direct the Bureau of Priso…",
    "link": "https://www.theblaze.com/news/trump-orders-restoration-of-alcatraz-prison-to-lock-up-dregs-of-society",
    "timestamp": "2025-05-05T13:09:55Z"
  },
  {
    "title": "Trump is swiftly undoing transgender protections in HUD’s housing policies",
    "description": "The Trump administration is swiftly remaking housing policy as the U.S. Department of Housing and Urban Development retreats from long-established fair...",
    "link": "https://www.yahoo.com/news/trump-swiftly-undoing-transgender-protections-130823895.html",
    "timestamp": "2025-05-05T13:08:23Z"
  },
  {
    "title": "AfD sues German spy agency, Putin and US weigh in",
    "description": "A far-right party in Germany has filed a lawsuit challenging a spy agency's decision to classify it as an extremist organisation.",
    "link": "https://www.abc.net.au/news/2025-05-05/afd-sues-german-spy-agency-putin-and-us-weigh-in/105256484",
    "timestamp": "2025-05-05T13:08:04Z"
  },
  {
    "title": "'Serious as a heart attack': GOP opposition threatens 'big beautiful' budget bill",
    "description": "President Donald Trump’s “big, beautiful bill” is facing an uphill battle from Republican members of Congress, according to a Washington Post report\r\n. The list of “redlines” or “no-go's” from GOP members is growing and includes Medicaid, the state and local …",
    "link": "https://www.rawstory.com/tax-cuts-in-house-budget-bill/",
    "timestamp": "2025-05-05T13:07:43Z"
  },
  {
    "title": "‘You have to be kidding’: Trump delivers brutal reaction to this ‘low IQ’ Democrat as possible leader",
    "description": "'They're in total disarray'",
    "link": "https://www.wnd.com/2025/05/you-have-to-be-kidding-trump-delivers-brutal-reaction-to-this-low-iq-democrat-as-possible-leader/",
    "timestamp": "2025-05-05T13:06:27Z"
  },
  {
    "title": "Fox News Legal Analyst Pours Cold Water on Trump’s Big Plan to Reopen Alcatraz",
    "description": "Fox News legal analyst Gregg Jarrett doesn’t expect Alcatraz to be open for business anytime soon, after President Donald Trump ordered the iconic prison to resume operations. During Fox & Friends segment discussing the move Monday morning, the question of wh…",
    "link": "https://www.mediaite.com/news/fox-news-legal-analyst-pours-cold-water-on-trumps-big-plan-to-reopen-alcatraz/",
    "timestamp": "2025-05-05T13:06:20Z"
  },
  {
    "title": "African state in talks to host migrants deported from US",
    "description": "Rwanda’s foreign minister has confirmed that the country is in discussions with the Trump administration to receive deportees Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/616799-rwanda-us-discussing-deportee-settlement-deal/",
    "timestamp": "2025-05-05T13:05:03Z"
  },
  {
    "title": "Federal Reserve likely to defy Trump, keep rates unchanged this week",
    "description": "The Federal Reserve will likely keep its key short-term interest rate unchanged on Wednesday.",
    "link": "https://www.bostonherald.com/2025/05/05/federal-reserve-interest-rates-decision/",
    "timestamp": "2025-05-05T13:02:39Z"
  },
  {
    "title": "Trump threatens a 100% tariff on foreign-made films, saying the movie industry in the US is dying",
    "description": "President Donald Trump is opening a new salvo in his tariff war, targeting films made outside the United States",
    "link": "https://abcnews.go.com/Business/wireStory/trump-threatens-100-tariff-foreign-made-films-movie-121458722",
    "timestamp": "2025-05-05T13:02:24Z"
  },
  {
    "title": "Thousands gather in London to mark the 80th anniversary of the end of WWII in Europe",
    "description": "Thousands of people lined the roads around London as British and allied troops paraded to mark the 80th anniversary of the end of World War II in Europe.",
    "link": "https://www.nbcnews.com/world/europe/world-war-ii-victory-in-europe-day-london-uk-netherlands-ukraine-rcna204792",
    "timestamp": "2025-05-05T13:02:17Z"
  },
  {
    "title": "Gov. Kathy Hochul dismisses Rep. Elise Stefanik’s potential run for NY governor: ‘Bring it on’",
    "description": "Gov. Kathy Hochul on Monday dismissed Republican Rep. Elise Stefanik’s possible 2026 gubernatorial run, boldly declaring: “Bring it on.” The Democratic governor was adamant she wasn’t worried about potentially facing off against the lawmaker — a day after Ste…",
    "link": "https://nypost.com/2025/05/05/us-news/hochul-dismisses-elise-stefaniks-potential-ny-governor-run/",
    "timestamp": "2025-05-05T13:02:10Z"
  },
  {
    "title": "EXCLUSIVE: Cornyn bringing bill to enshrine Trump EO renaming refuge after Jocelyn Nungaray into law",
    "description": "Sen. John Cornyn wants to enshrine into the law the renaming of a national wildlife refuge after Jocelyn Nungaray so it can't be changed by future administrations.",
    "link": "https://www.foxnews.com/politics/exclusive-cornyn-bringing-bill-enshrine-trump-eo-renaming-refuge-after-jocelyn-nungaray-law",
    "timestamp": "2025-05-05T13:00:55Z"
  },
  {
    "title": "Trump Wants to ‘Rebuild, and Open Alcatraz!’",
    "description": "\"The reopening of ALCATRAZ will serve as a symbol of Law, Order, and JUSTICE. We will, MAKE AMERICA GREAT AGAIN!\"\nThe post Trump Wants to ‘Rebuild, and Open Alcatraz!’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-wants-to-rebuild-and-open-alcatraz/",
    "timestamp": "2025-05-05T13:00:53Z"
  },
  {
    "title": "Australia and New Zealand, popular filming locations for Hollywood movies in recent years, pledge support for their film industries after Trump proposed tariffs (Reuters)",
    "description": "Reuters:\nAustralia and New Zealand, popular filming locations for Hollywood movies in recent years, pledge support for their film industries after Trump proposed tariffs  —  Australia and New Zealand vowed to advocate for their film industries on Monday after…",
    "link": "https://mediagazer.com/250505/p4",
    "timestamp": "2025-05-05T13:00:35Z"
  },
  {
    "title": "In Congress Just a Month, Lawmaker Wants Rest of America to Look More Like Florida",
    "description": "Rep. Randy Fine was sworn into office a month ago Friday, but he already has an idea of what Republicans need to do while they... Read More\nThe post In Congress Just a Month, Lawmaker Wants Rest of America to Look More Like Florida appeared first on The Daily…",
    "link": "https://www.dailysignal.com/2025/05/05/congress-just-month-lawmaker-wants-rest-america-look-more-like-florida/",
    "timestamp": "2025-05-05T13:00:00Z"
  },
  {
    "title": "Tax Court Ruling Could Impact AI Software Tax Reporting",
    "description": "Tax reporting and compliance could be negatively impacted by Tax Court ruling potentially exposing AI software use to large penalties.",
    "link": "https://www.forbes.com/sites/joshuasmeltzer/2025/05/05/tax-court-ruling-could-impact-ai-software-tax-reporting/",
    "timestamp": "2025-05-05T13:00:00Z"
  },
  {
    "title": "Here are the top 10 things we're watching in the stock market Monday",
    "description": "Wall Street was heading for a lower open after the S&P 500 on Friday logged its ninth positive session in a row.",
    "link": "https://www.cnbc.com/2025/05/05/here-are-the-top-10-things-were-watching-in-the-stock-market-monday.html",
    "timestamp": "2025-05-05T12:58:36Z"
  },
  {
    "title": "Trump’s Gutting of US Climate Report Prompts Science Groups to Step Up",
    "description": "After the administration dismissed authors of the sixth National Climate Assessment, two science organizations said they’ll offer a platform for the research.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-gutting-of-us-climate-report-prompts-science-groups-to-step-up",
    "timestamp": "2025-05-05T12:56:50Z"
  },
  {
    "title": "Pressure Grows as Houthis Withstand US Campaign",
    "description": "The U.S. has secured support from a Western ally, but key regional partners remain unwilling to commit militarily.",
    "link": "https://www.newsweek.com/pressure-houthis-withstand-us-military-campaign-2067987",
    "timestamp": "2025-05-05T12:56:37Z"
  },
  {
    "title": "The Spygate Top 20: A Hall of Shame - How many crimes were committed without a single person held to account?",
    "description": "The \"Crossfire Hurricane\" investigation represents one of the most concerning abuses of power in modern American history. What began as opposition research funded by political opponents evolved into a full-scale intelligence and law enforcement operation targ…",
    "link": "https://freerepublic.com/focus/f-chat/4315106/posts",
    "timestamp": "2025-05-05T12:55:32Z"
  },
  {
    "title": "Australia's reelected Prime Minister Albanese set to visit Indonesia, Malaysia and Canada",
    "description": "Australian Prime Minister Anthony Albanese, fresh off his reelection victory, on Monday announced that he plans to embark on diplomatic visits to Indonesia, Malaysia, and Canada in the coming weeks. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/05/australia039s-reelected-prime-minister-albanese-set-to-visit-indonesia-malaysia-and-canada",
    "timestamp": "2025-05-05T12:55:00Z"
  },
  {
    "title": "How Trump could make Americans permanently poorer (Eric Levitz/Vox)",
    "description": "Eric Levitz / Vox:\nHow Trump could make Americans permanently poorer  —  The immediate costs of President Donald Trump's trade war are fairly clear.  Prices for imported goods are rising while economic growth is slowing.  Manufacturers are slashing orders, sm…",
    "link": "https://www.memeorandum.com/250505/p27",
    "timestamp": "2025-05-05T12:55:00Z"
  },
  {
    "title": "Trump says trade deals 'could very well be' announced this week (Washington Post)",
    "description": "Washington Post:\nTrump says trade deals ‘could very well be’ announced this week  —  President Donald Trump told reporters Sunday that deals with some trading partners “could very well be” announced this week, raising the prospect of an easing of the “Liberat…",
    "link": "https://www.memeorandum.com/250505/p26",
    "timestamp": "2025-05-05T12:55:00Z"
  },
  {
    "title": "Feds Charge White Supremacist Over 2019 Arson at Tennessee School",
    "description": "NASHVILLE, Tenn. (AP) — A suspect whom authorities have linked to white supremacist movements has been arrested in the March 2019 fire that destroyed an office at a storied Tennessee social justice center. Regan Prater was arrested last Thursday and …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/05/05/822481.htm",
    "timestamp": "2025-05-05T12:54:07Z"
  }
]