[
  {
    "title": "How Newsom’s Retaliation Against Texas Redistricting Could Backfire",
    "description": "Gavin Newsom’s retaliation against Texas redistricting could backfire. The California governor is pitching his plan to thwart Trump’s Texas power grab as a huge blow to the president. But it could end his own career on a very sour note.",
    "link": "http://nymag.com/intelligencer/article/newsom-california-redistricting-texas-backfire.html",
    "timestamp": "2025-08-14T19:35:25Z"
  },
  {
    "title": "Trump ramps up his campaign for the Nobel Prize, hoping to cement a legacy as a 'peacemaker'",
    "description": "President Donald Trump has campaigned for a Nobel Peace Prize, pitching himself as a \"peacemaker\" as he heads into a meeting with Russian President Vladimir Putin about the Ukraine war.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-ramps-campaign-nobel-peace-prize-ahead-putin-meeting-rcna224554",
    "timestamp": "2025-08-14T19:35:12Z"
  },
  {
    "title": "After DC shock, Trump plots military-style crime crackdowns in 5 more US cities - is yours on the list?",
    "description": "Donald Trump initiated a crime crackdown in Washington, DC. He called it the first step to restore order in American cities. Five more urban areas are in his sight. He mentioned Los Angeles, Baltimore, Oakland, New York, and Chicago. Democratic leaders critic…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-dc-shock-trump-plots-military-style-crime-crackdowns-in-5-more-us-cities-is-yours-on-the-list/articleshow/123312364.cms",
    "timestamp": "2025-08-14T19:34:57Z"
  },
  {
    "title": "Shaheen: Putin Will Not Stop Until We Provide Additional Weapons to Ukraine",
    "description": "Thursday on CNN \"News Central,\" Sen. Jeanne Shaheen (D-NH) said Russian President Vladimir Putin would not stop fighting in Ukraine until the United States provided \"additional weapons.\"\nThe post Shaheen: Putin Will Not Stop Until We Provide Additional Weapon…",
    "link": "https://www.breitbart.com/clips/2025/08/14/shaheen-putin-will-not-stop-until-we-provide-additional-weapons-to-ukraine/",
    "timestamp": "2025-08-14T19:34:02Z"
  },
  {
    "title": "The Subway sandwich case highlights the Trump admin’s criminal justice priorities",
    "description": "Former Fox News host and current top Washington prosecutor Jeanine Pirro published a video Wednesday, accompanied by: “Assault a law enforcement officer, and you’ll be prosecuted.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/man-throws-subway-sandwich-charges-trump-dc-crime-rcna224975",
    "timestamp": "2025-08-14T19:33:51Z"
  },
  {
    "title": "Tara Reade: Without Zelensky, peace has a chance",
    "description": "The Ukrainian leader has become a liability to the West – which is why peace will be decided between Trump and Putin Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622887-putin-trump-zelensky-alaska/",
    "timestamp": "2025-08-14T19:33:23Z"
  },
  {
    "title": "MAGA ‘Biggest Loser’ Star Has A Meltdown Defending White People During CNN Slavery Talk",
    "description": "“Every single thing is like, oh, no, no, no, this is all because ‘white people bad’ and that's just not the truth,” Jillian Michaels told anchor Abby Phillip.",
    "link": "https://www.huffpost.com/entry/jillian-michaels-white-slavery-trump-history_n_689e18e1e4b048e97f076b2a",
    "timestamp": "2025-08-14T19:32:50Z"
  },
  {
    "title": "Trump Touts Administration’s Protection of Social Security on Program's 90th Anniversary",
    "description": "President Donald Trump on Thursday celebrated the 90th anniversary of the Social Security program by signing a proclamation and touting how his administration is protecting seniors for generations to come.\nThe post Trump Touts Administration’s Protection of S…",
    "link": "https://www.breitbart.com/politics/2025/08/14/trump-touts-administrations-protection-of-social-security-on-programs-90th-anniversary/",
    "timestamp": "2025-08-14T19:32:34Z"
  },
  {
    "title": "Could Vladimir Putin Be Arrested in Alaska?",
    "description": "As the Russian president heads to US soil for a high-stakes summit, one question looms on social media: Could he theoretically be arrested upon arrival?",
    "link": "https://www.newsweek.com/could-vladimir-putin-arrested-alaska-2113727",
    "timestamp": "2025-08-14T19:31:07Z"
  },
  {
    "title": "Here's What Happened Today: Thursday",
    "description": "Here’s your round-up of what made the headlines today.",
    "link": "https://www.thejournal.ie/evening-fix-news-headlines-thursday-7-6790829-Aug2025/",
    "timestamp": "2025-08-14T19:30:43Z"
  },
  {
    "title": "DOJ official fired after alleged sandwich assault on federal agent",
    "description": "A man charged with a felony for hurling a sandwich at a federal law-enforcement official in the nation's capital has been fired from his job at the Justice Department.",
    "link": "https://www.wgal.com/article/doj-official-sandwich-assault-firing/65781629",
    "timestamp": "2025-08-14T19:30:38Z"
  },
  {
    "title": "DOJ official fired after alleged sandwich assault on federal agent",
    "description": "A man charged with a felony for hurling a sandwich at a federal law-enforcement official in the nation's capital has been fired from his job at the Justice Department.",
    "link": "https://www.kcra.com/article/doj-official-sandwich-assault-firing/65781629",
    "timestamp": "2025-08-14T19:29:27Z"
  },
  {
    "title": "California moving forward with partisan redistricting effort to counter Texas’ move",
    "description": "LOS ANGELES (AP) — California Gov. Gavin Newsom stood with other prominent Democratic leaders Thursday to announce that the state will move forward with a partisan plan to redraw congressional maps in an effort to help his party win five more U.S. House seats…",
    "link": "https://freerepublic.com/focus/f-news/4334622/posts",
    "timestamp": "2025-08-14T19:28:05Z"
  },
  {
    "title": "Baltimore mayor suggests Trump’s targeting “Black-led cities” for obviously racist reasons",
    "description": "\"We cannot overstate the racial undertones here,” Baltimore Mayor Brandon Scott said Thursday",
    "link": "https://www.salon.com/2025/08/14/baltimore-mayor-suggests-trumps-targeting-black-led-cities-for-obviously-racist-reasons/",
    "timestamp": "2025-08-14T19:27:51Z"
  },
  {
    "title": "CNN Reporter Admits Trump’s DC Crime Crackdown Is Cleaning Up Loitering At Union Station",
    "description": "President Donald Trump’s crackdown on crime in the District of Columbia has had an effect at Union Station, a CNN reporter admitted Thursday.",
    "link": "https://dailycaller.com/2025/08/14/cnn-reporter-admits-trumps-dc-crime-crackdown-cleaning-up-loitering-union-station/",
    "timestamp": "2025-08-14T19:27:50Z"
  },
  {
    "title": "1.6M illegal immigrants have left the US in less than 200 days under Trump admin | Fox News Video",
    "description": "Department of Homeland Security Secretary Kristi Noem discusses President Donald Trump’s immigration policy, the Border Patrol agents at California Governor Gavin Newsom’s event and more ‘America Reports.’",
    "link": "https://www.foxnews.com/video/6376928858112",
    "timestamp": "2025-08-14T19:27:44Z"
  },
  {
    "title": "Pope calls for peaceful resolutions to Gaza and Ukraine wars ahead of Trump-Putin meeting",
    "description": "Before the Angelus on July 13, 2025, Pope Leo XIV celebrated a Mass for local Catholics, religious leaders, and civil authorities at the 17th-century Pontifical Parish of St. Thomas of Villanova in Castel Gandolfo’s main square. / Credit: Vatican Media\n\nACI P…",
    "link": "https://www.catholicnewsagency.com/news/265947/pope-leo-calls-for-peaceful-resolutions-to-gaza-and-ukraine-wars-as-trump-putin-meeting-approaches",
    "timestamp": "2025-08-14T19:27:00Z"
  },
  {
    "title": "A vibe check on the job market",
    "description": "It’s not just you — we feel the bad vibes in the job market too. On the show today, we’ll unpack how what we’re hearing from those on the job hunt compares to what the data shows about a labor market slump. And, President Donald Trump says he wants to allow r…",
    "link": "https://www.marketplace.org/episode/2025/08/14/a-vibe-check-on-the-job-market",
    "timestamp": "2025-08-14T19:26:23Z"
  },
  {
    "title": "Does Melania Trump's $1B Lawsuit Threat Against Hunter Biden Have Merit?",
    "description": "Legal analysts weighed in on how Melania Trump's lawsuit threats may play out.",
    "link": "https://www.newsweek.com/melania-trump-lawsuit-threat-hunter-biden-legal-analysts-2113708",
    "timestamp": "2025-08-14T19:25:52Z"
  },
  {
    "title": "As federal activity takes root in DC, police chief orders more cooperation with immigration agents",
    "description": "WASHINGTON (AP) — The Washington, D.C., police chief ordered more cooperation between her officers and federal immigration officials as President Donald Trump’s law enforcement takeover of the nation’s capital took root Thursday. National Guard troops watched…",
    "link": "https://freerepublic.com/focus/f-news/4334621/posts",
    "timestamp": "2025-08-14T19:25:35Z"
  },
  {
    "title": "Newsom Declares ‘Liberation Day’ in Full-Scale Redistricting Push After Trump Ignores His Ultimatum: “Donald Trump Is About to Have a Very Bad Day”",
    "description": "California’s far-left Governor Gavin Newsom has once again proven he’s more interested in political theater than governing, launching what he’s calling “Liberation Day” on Thursday in a desperate bid to intimidate President Donald Trump and Republican-led sta…",
    "link": "https://freerepublic.com/focus/f-bloggers/4334620/posts",
    "timestamp": "2025-08-14T19:24:38Z"
  },
  {
    "title": "U.S. Capitol police chief: The fascist takeover benefits us all. Dude, blink twice if you need help [Facepalm]",
    "description": "U.S. Capitol police chief: The fascist takeover benefits us all. Dude, blink twice if you need help",
    "link": "https://www.fark.com/comments/13777246/US-Capitol-police-chief-The-fascist-takeover-benefits-us-all-Dude-blink-twice-if-you-need-help",
    "timestamp": "2025-08-14T19:24:34Z"
  },
  {
    "title": "90 Years of Social Security: A Time for Celebration and Action",
    "description": "Social Security turns 90 years old this week! President Franklin D. Roosevelt signed the program into law on August 14, 1935, as insurance against what he called the “hazards and vicissitudes” of life. For a federal program to endure for 90 years and maintain…",
    "link": "https://www.commondreams.org/opinion/social-security-90-years",
    "timestamp": "2025-08-14T19:22:26Z"
  },
  {
    "title": "ICE encourages Lancaster County DA's office to apply for detective training",
    "description": "The Lancaster County District Attorney’s Office plans to provide Immigration and Customs Enforcement training for one of its detectives, joining several county agencies that have already applied.",
    "link": "https://lancasteronline.com/news/local/ice-encourages-lancaster-county-das-office-to-apply-for-detective-training/article_269dccdc-f376-4cfa-ab8a-c53d479d5a81.html",
    "timestamp": "2025-08-14T19:22:00Z"
  },
  {
    "title": "Kern County Defies Newsom’s State Order, Complies With Trump On Transgender Athletes",
    "description": "The board adopted a resolution related to Title IX banning transgender athletes from participating in women's sports.",
    "link": "https://dailycaller.com/2025/08/14/school-california-bans-transgender-girls-sports-kern-county/",
    "timestamp": "2025-08-14T19:21:54Z"
  },
  {
    "title": "Trump Warns Putin of 'Severe Consequences' If No Ceasefire",
    "description": "Donald Trump warned he would impose “very severe consequences” if Vladimir Putin didn’t agree to a ceasefire agreement, following a call with European leaders ahead of his meeting with the Russian president. But Tass reported that the two will hold a joint pr…",
    "link": "https://biztoc.com/x/6ef6b6964f15065f",
    "timestamp": "2025-08-14T19:20:39Z"
  },
  {
    "title": "Supreme Court issues ruling on emergency relief to Big Tech over Mississippi social media law",
    "description": "A view of the US Supreme Court on July 1, 2024, in Washington, DC. Donald Trump on Monday hailed a \"big win\" for democracy after the US Supreme Court ruled that presidents have presumptive immunity for official acts -- a decision set to delay his trial for co…",
    "link": "https://biztoc.com/x/da056cc110e59827",
    "timestamp": "2025-08-14T19:20:27Z"
  },
  {
    "title": "Prosecutors seek death penalty against Zizian member charged with murdering Vermont border agent",
    "description": "The announcement is the latest example of the Trump administration’s push for more federal executions.",
    "link": "https://www.bostonherald.com/2025/08/14/zizian-death-penalty/",
    "timestamp": "2025-08-14T19:20:24Z"
  },
  {
    "title": "Putin and Trump are meeting, but peace may be more than a conversation away",
    "description": "For all the talk of a ceasefire in Ukraine, a chasm remains between what Kyiv and Moscow believe is fair, as the US president prepares to host his Russian counterpart.",
    "link": "https://www.abc.net.au/news/2025-08-15/donald-trump-vladimir-putin-alaska-meeting-analysis/105650190",
    "timestamp": "2025-08-14T19:17:46Z"
  },
  {
    "title": "Mamdani rivals defiant against dropping out despite facing long odds in NYC mayor battle",
    "description": "NYC mayoral race features Zohran Mamdani leading polls against Andrew Cuomo, Curtis Sliwa, and Eric Adams as candidates debate dropping out strategy.",
    "link": "https://www.foxnews.com/politics/mamdani-rivals-defiant-against-dropping-out-despite-facing-long-odds-nyc-mayor-battle",
    "timestamp": "2025-08-14T19:16:05Z"
  },
  {
    "title": "South Carolina Governor Candidate Unleashes In Arrest Video, Calling Himself Superman",
    "description": "The lawyer also threatened to kick his opponent's teeth in.",
    "link": "https://www.huffpost.com/entry/south-carolina-governor-candidate-unleashes-in-arrest-video-calling-himself-superman_n_689df9b0e4b0ba345d6661c1",
    "timestamp": "2025-08-14T19:14:04Z"
  },
  {
    "title": "Inside the Biden Administration's Gamble to Freeze China’s AI Future",
    "description": "What really motivated the US government to ban Nvidia from selling powerful computer chips to China?",
    "link": "https://www.wired.com/story/chips-china-artificial-intelligence-controls/",
    "timestamp": "2025-08-14T19:13:18Z"
  },
  {
    "title": "Lawyers in Brazil submit final statement for Bolsonaro in coup trial",
    "description": "Former president denies involvement in alleged effort to overturn his loss in the 2022 election.",
    "link": "https://www.aljazeera.com/news/2025/8/14/lawyers-in-brazil-submit-final-statement-for-bolsonaro-in-coup-trial",
    "timestamp": "2025-08-14T19:12:43Z"
  },
  {
    "title": "Justin Sun, Billionaire Buyer of Maurizio Cattelan’s ‘Comedian,’ Sues Bloomberg News",
    "description": "The lawsuit said Justin Sun will suffer \"significant and irreparable harm\" if Bloomberg News publishes details of his cryptocurrency assets.",
    "link": "https://www.artnews.com/art-news/news/justin-sun-maurizio-cattelan-comedian-bloomberg-news-lawsuit-1234749376/",
    "timestamp": "2025-08-14T19:12:11Z"
  },
  {
    "title": "Trump Promises DC Police Will Be Held To Account For Providing ‘Phony Crime Stats’",
    "description": "President Donald Trump promised on Thursday that the MPD will be held accountable for providing \"phony\" crime statistics in Washington, D.C.",
    "link": "https://dailycaller.com/2025/08/14/trump-dc-police-phony-crime-stats/",
    "timestamp": "2025-08-14T19:10:55Z"
  },
  {
    "title": "Trump Administration Plans To Tax More American Companies on Overseas Sales",
    "description": "On Monday, President Donald Trump granted American chipmakers Nvidia and Advanced Micro Devices (AMD) export licenses for their scaled-down graphics processing units (GPUs) in exchange for 15 percent of the companies' revenue from Chinese sales. The truly unp…",
    "link": "https://biztoc.com/x/81728357e96d96de",
    "timestamp": "2025-08-14T19:09:28Z"
  },
  {
    "title": "Wholesale prices raise another red flag for U.S. economy and inflation",
    "description": "Less than two weeks after U.S. President Donald Trump fired the head of the Bureau of Labor Statistics over the release of weak jobs numbers, the department delivered another batch of troubling economic data for the Trump administration’s agenda: accelerating…",
    "link": "https://biztoc.com/x/468e3c4599e03365",
    "timestamp": "2025-08-14T19:09:08Z"
  },
  {
    "title": "Federal agents conduct immigration raid in downtown LA",
    "description": "Border Patrol agents show up outside an event where California Gov. Newsom was speaking in Los Angeles.",
    "link": "https://www.nbclosangeles.com/news/local/border-patrol-downtown-la-immigration-raid/3764275/",
    "timestamp": "2025-08-14T19:08:00Z"
  },
  {
    "title": "Pam Bondi Warns California Will Lose Federal Funding Unless Sanctuary Policies Are Ended",
    "description": "Attorney General Pam Bondi warned that California will lose federal funding unless Gov. Gavin Newsom (D-CA) ends the state's sanctuary city policies.\nThe post Pam Bondi Warns California Will Lose Federal Funding Unless Sanctuary Policies Are Ended appeared fi…",
    "link": "https://www.breitbart.com/politics/2025/08/14/pam-bondi-warns-california-will-lose-federal-funding-unless-sanctuary-policies-are-ended/",
    "timestamp": "2025-08-14T19:07:55Z"
  },
  {
    "title": "Putin praises Trump’s ‘sincere efforts’ to end war on Ukraine",
    "description": "Russian President Vladimir Putin praised US President Donald Trump's “sincere efforts” to end the war on Ukraine.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/8/14/putin-praises-trumps-sincere-efforts-to-end-war-on-ukraine",
    "timestamp": "2025-08-14T19:07:17Z"
  },
  {
    "title": "In full: Trump makes remarks from the White House ahead of meetings with Putin in Alaska",
    "description": "U.S. President Donald Trump makes remarks one day ahead of his meeting with Russian President Vladimir Putin in Alaska.",
    "link": "https://biztoc.com/x/645badf7c903b380",
    "timestamp": "2025-08-14T19:06:17Z"
  },
  {
    "title": "Trump's 15% China cut may not worry Nvidia much",
    "description": "A look at balance-sheet math goes a long way to explaining why. In the first quarter, Nvidia said it sold $5.5 billion in products to China, roughly 13% of its total. The chips exposed to the Trump tax accounted for about 80% of that, or just under $5 billion.",
    "link": "https://economictimes.indiatimes.com/news/international/business/trumps-15-china-cut-may-not-worry-nvidia-much/articleshow/123312307.cms",
    "timestamp": "2025-08-14T19:05:55Z"
  },
  {
    "title": "Taylor Swift Nearly Doubles Trump’s Podcast Ratings",
    "description": "Taylor Swift’s New Heights podcast appearance crashed its YouTube live stream last night.",
    "link": "https://gizmodo.com/taylor-swift-nearly-doubles-trumps-podcast-ratings-record-2000643224",
    "timestamp": "2025-08-14T19:05:16Z"
  },
  {
    "title": "Princeton Plans New Budget Cuts as Pressure From Trump Builds",
    "description": "Princeton University is implementing a new round of cost cuts, citing pressure from the Trump administration’s funding reductions in higher education as well as economic concerns.",
    "link": "https://financialpost.com/pmn/business-pmn/princeton-plans-new-budget-cuts-as-pressure-from-trump-builds",
    "timestamp": "2025-08-14T19:05:13Z"
  },
  {
    "title": "Potential Fed chair pick David Zervos of Jefferies backs aggressive interest rate cuts",
    "description": "The Jefferies strategist told CNBC that central bankers shouldn't be daunted by the PPI showing inflation pressures hotter than expected.",
    "link": "https://www.cnbc.com/2025/08/14/potential-fed-chair-pick-david-zervos-of-jefferies-backs-aggressive-interest-rate-cuts.html",
    "timestamp": "2025-08-14T19:04:00Z"
  },
  {
    "title": "Social Security’s ‘go-broke date’ keep creeping up—it’s lost a full year since the last accounting",
    "description": "In 2034, Social Security will only be able to pay 81% of benefits, at the current pace.",
    "link": "https://fortune.com/2025/08/14/when-will-social-security-go-broke-2034/",
    "timestamp": "2025-08-14T19:03:09Z"
  },
  {
    "title": "Trump says Elizabeth Warren has 'got to take a drug test'",
    "description": "President Trump attacks Elizabeth Warren as a \"liar and a mean person\" while defending his Social Security record at 90th anniversary celebration.",
    "link": "https://www.foxnews.com/politics/trump-says-elizabeth-warren-has-got-take-drug-test",
    "timestamp": "2025-08-14T19:01:43Z"
  },
  {
    "title": "How Trump’s ‘Unique Solution’ For Armenia And Azerbaijan Likely Prevented A Full-Scale War",
    "description": "'If it were not for the Trump administration, Azerbaijan would have attacked, and we would have had severe instability in the region.'When President Donald Trump sat between the leaders of Armenia and Azerbaijan last week, few people realized the significance…",
    "link": "https://freerepublic.com/focus/f-news/4334617/posts",
    "timestamp": "2025-08-14T19:01:15Z"
  },
  {
    "title": "‘Shut It Down!’: Obama DAG’s 2016 Email to FBI Agents Investigating the Clinton Foundation",
    "description": "\"The declassified timeline revealed that as early as February 2016, the Justice Department 'indicated they would not be supportive of an FBI investigation.'\"\nThe post ‘Shut It Down!’: Obama DAG’s 2016 Email to FBI Agents Investigating the Clinton Foundation f…",
    "link": "https://legalinsurrection.com/2025/08/shut-it-down-obama-dags-2016-email-to-fbi-agents-investigating-the-clinton-foundation/",
    "timestamp": "2025-08-14T19:00:40Z"
  },
  {
    "title": "A DOGE AI Tool Called SweetREX Is Coming to Slash US Government Regulation",
    "description": "Named for its developer, an undergrad who took leave from UChicago to become a DOGE affiliate, a new AI tool automates the review of federal regulations and flags rules it thinks can be eliminated.",
    "link": "https://www.wired.com/story/sweetrex-deregulation-ai-us-government-regulation-doge/",
    "timestamp": "2025-08-14T19:00:15Z"
  },
  {
    "title": "MAGA Frat Guys and Bitter Incels Agree: Sorority Girls Are Objects",
    "description": "It's August, which means the weather's hot, everyone in D.C. is on vacation, and people on X are having meltdowns about sorority recruitment TikTok videos.",
    "link": "https://reason.com/2025/08/14/maga-frat-guys-and-bitter-incels-agree-sorority-girls-are-objects/",
    "timestamp": "2025-08-14T18:59:18Z"
  },
  {
    "title": "Trump Says May Consider Cutting US Troops in Europe as Part of Ukraine Deal",
    "description": "WASHINGTON (Sputnik) - The meeting with Russian President Vladimir Putin in Alaska will be a \"good meeting\", but a potential second one that will include Volodymyr Zelensky will be more important, US President Donald Trump said on Thursday.",
    "link": "https://sputnikglobe.com/20250814/trump-says-may-consider-cutting-us-troops-in-europe-as-part-of-ukraine-deal-1122613862.html",
    "timestamp": "2025-08-14T18:58:47Z"
  },
  {
    "title": "US efforts to stop Ukraine war energetic and sincere: Vladimir Putin",
    "description": "Putin's comments signalled that Russia will raise the issue of nuclear arms control as part of a wide-ranging discussion on security when he sits down with Trump in Anchorage for the first Russia-US summit since June 2021.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-efforts-to-stop-ukraine-war-energetic-and-sincere-vladimir-putin/articleshow/123312216.cms",
    "timestamp": "2025-08-14T18:58:20Z"
  },
  {
    "title": "White House Labor pick could be derailed by bombshell revelation",
    "description": "Earlier this month, about six months into his administration, President Donald Trump made the unprecedented move of firing the U.S. Bureau of Labor Statistics commissioner Erika McEntarfer. \nThe firing followed the release of a July jobs report that featured …",
    "link": "https://biztoc.com/x/0c17f0c3a380987c",
    "timestamp": "2025-08-14T18:57:59Z"
  },
  {
    "title": "Trump Administration Plans To Tax More American Companies on Overseas Sales",
    "description": "The president's revenue-sharing agreement on chip sales to China may pass legal muster, paving the way for effective export tariffs.",
    "link": "https://reason.com/2025/08/14/trump-administration-plans-to-tax-more-american-companies-on-overseas-sales/",
    "timestamp": "2025-08-14T18:57:10Z"
  },
  {
    "title": "“Maddening”: Smithsonian Employees Warn Trump’s Plan Will Cause Chaos",
    "description": "The Trump administration’s heavy-handed revision of U.S. history has put fear into Smithsonian employees, eliciting comparisons among staffers to 1930s Germany. Workers at the government-created museums are censoring historical content that they believe could…",
    "link": "https://newrepublic.com/post/199134/donald-trump-museums-smithsonian-employees",
    "timestamp": "2025-08-14T18:56:28Z"
  },
  {
    "title": "Mayor Adams calls for forced treatment for drug and alcohol addiction in NY",
    "description": "The initiative is part of a broader campaign push by Adams to target \"quality of life\" issues. [ more › ]",
    "link": "https://gothamist.com/news/mayor-adams-calls-for-forced-treatment-for-drug-and-alcohol-addiction-in-ny",
    "timestamp": "2025-08-14T18:56:00Z"
  },
  {
    "title": "Trump Brags About How He Can Handle Putin—With One Major Catch",
    "description": "Donald Trump was caught once again moving the goal posts for Russian President Vladimir Putin ahead of their summit in Alaska Friday. During an interview on Fox News Radio Thursday, Trump bragged that his “relationship” with Putin had been the deciding factor…",
    "link": "https://newrepublic.com/post/199131/donald-trump-vladimir-putin-major-catch-ukraine",
    "timestamp": "2025-08-14T18:55:57Z"
  },
  {
    "title": "Texas Democrats signal they are ready to end redistricting standoff and return to state | CNN Politics",
    "description": "Texas House Democratic lawmakers signaled on Thursday they are preparing to end their standoff over redistricting and return to the state.",
    "link": "https://www.cnn.com/2025/08/14/politics/texas-redistricting-democrats-return",
    "timestamp": "2025-08-14T18:55:43Z"
  },
  {
    "title": "Mexican Drug Lords Come to America: What Happens Now?",
    "description": "Big cartel fish handed over to US signals Trump is serious about cleaning up the American drug crisis.In a deal struck by President Donald Trump and Mexican President Claudia Sheinbaum, the Department of Justice announced Aug. 12 that 26 Mexican drug lords we…",
    "link": "https://freerepublic.com/focus/f-news/4334615/posts",
    "timestamp": "2025-08-14T18:53:24Z"
  },
  {
    "title": "UN protests Israeli minister's proposal of settlement to 'bury' idea of Palestinian state",
    "description": "Israeli far-right Finance Minister Bezalel Smotrich announced that work would start on a long-delayed settlement that would divide the West Bank and cut it off from East Jerusalem.",
    "link": "https://www.cbc.ca/news/world/smotrich-israeli-minister-settlement-plan-west-bank-jerusalem-1.7609013",
    "timestamp": "2025-08-14T18:53:07Z"
  },
  {
    "title": "Why Alaska is ideal for hosting the Putin-Trump summit",
    "description": "Alaska was once a Russian colony until it was sold to the US in the mid-18th century. Here's why it's the perfect place to hold the upcoming Putin-Trump talks on Ukraine. US President Donald Trump is going out of his way to accommodate his Russian counterpart…",
    "link": "https://www.dw.com/en/why-alaska-is-ideal-for-hosting-the-putin-trump-summit/a-73642606",
    "timestamp": "2025-08-14T18:53:00Z"
  },
  {
    "title": "Why Alaska was chosen to host the Putin-Trump summit",
    "description": "Alaska was once a Russian colony until it was sold to the US in the mid-19th century. Here's why it's the perfect place to hold the upcoming Putin-Trump talks on Ukraine.",
    "link": "https://www.dw.com/en/why-alaska-was-chosen-to-host-the-putin-trump-summit/a-73642606",
    "timestamp": "2025-08-14T18:53:00Z"
  },
  {
    "title": "Above water: CNN reports Americans ‘vastly prefer’ Trump’s handling of crime over predecessor",
    "description": "Harry Enten: 'It was one of Biden's worst issues, granted, pretty much every issue was one of Biden’s worst issues'",
    "link": "https://www.wnd.com/2025/08/above-water-cnn-reports-americans-vastly-prefer-trumps/",
    "timestamp": "2025-08-14T18:52:27Z"
  },
  {
    "title": "Military, CIA and 'anti-government extremist' links behind Gaza aid agency",
    "description": "A security contractor held a senior role in what a US legal service says is an \"anti-government extremist group\" linked to the hard right. Now he works on an Israel- and US-backed humanitarian aid project in Gaza.",
    "link": "https://www.abc.net.au/news/2025-08-15/soldiers-spies-antigovernment-extremist-links-to-gaza-aid-agency/105602518",
    "timestamp": "2025-08-14T18:51:20Z"
  },
  {
    "title": "Accused of acting like a 'dictator,' Trump offers an unsettling response (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nAccused of acting like a ‘dictator,’ Trump offers an unsettling response  —  Reflecting on critics who've called him a “dictator,” the president didn't say the accusations were wrong — just that they're irrelevant.  —  At a White House ev…",
    "link": "https://www.memeorandum.com/250814/p83",
    "timestamp": "2025-08-14T18:50:00Z"
  },
  {
    "title": "Trade talks with US going on: Commerce Secretary",
    "description": "India and the US are actively pursuing a bilateral trade agreement. The next round of talks depends on the US-Russia meeting. A 25% tariff on Indian goods is in effect. India will discuss rupee trade with Russia. Trade with China is growing. India is expediti…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trade-talks-with-us-going-on-commerce-secretary/articleshow/123312058.cms",
    "timestamp": "2025-08-14T18:49:17Z"
  },
  {
    "title": "Trump Rips Up Environmental Rules Protecting Wildlife From Destructive Rocket Launches",
    "description": "Their friendship may be over, but president Donald Trump just handed Elon Musk and his company SpaceX a major boon. On Wednesday, Trump signed an executive order to accelerate space launches by effectively deregulating the industry. As part of this push, the …",
    "link": "https://futurism.com/trump-rules-wildlife-rocket-launches",
    "timestamp": "2025-08-14T18:48:14Z"
  },
  {
    "title": "DOJ Staffer Who Threw Sandwich at D.C. Cop Fired, Charged With Felony Assault",
    "description": "Meanwhile, the man who yelled \"kill 'em\" at rioters attacking police on Jan. 6 remains a \"valued member of the Justice Department\"",
    "link": "http://www.rollingstone.com/politics/politics-news/doj-employee-threw-sandwich-dc-cop-charged-assault-1235407854/",
    "timestamp": "2025-08-14T18:47:28Z"
  },
  {
    "title": "Fox Host Straight-Up Tells Trump ‘I Know You’re A Big Athlete’ In New Interview: ‘You Not Only Watch Sports — You PLAY Sports!’",
    "description": "Fox News host Brian Kilmeade told President Donald Trump \"I know you're a big athlete\" in an aside during a new interview pegged to Trump's upcoming summit.\nThe post Fox Host Straight-Up Tells Trump ‘I Know You’re A Big Athlete’ In New Interview: ‘You Not Onl…",
    "link": "https://www.mediaite.com/media/news/fox-host-straight-up-tells-trump-i-know-youre-a-big-athlete-in-new-interview-you-not-only-watch-sports-you-play-sports/",
    "timestamp": "2025-08-14T18:47:23Z"
  },
  {
    "title": "Trump Signs Order Easing 'Restrictive' Space Industry Rules",
    "description": "Trump Signs Order Easing 'Restrictive' Space Industry Rules\n \nAuthored by Melanie Sun via The Epoch Times,\nPresident Donald Trump signed an executive order on Aug. 13 to ease regulations for the commercial space industry and enhance “American greatness in spa…",
    "link": "https://biztoc.com/x/388ab9fb23c9fc18",
    "timestamp": "2025-08-14T18:47:10Z"
  },
  {
    "title": "Idea of Palestinian state buried, there's nothing to recognise: Israel minister",
    "description": "The announcement comes as many countries said they would recognise a Palestinian state in September. \"This reality finally buries the idea of a Palestinian state, because there is nothing to recognise and no one to recognise,\" said Finance Minister Bezalel Sm…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/idea-of-palestinian-state-buried-theres-nothing-to-recognise-israel-minister/articleshow/123312004.cms",
    "timestamp": "2025-08-14T18:46:05Z"
  },
  {
    "title": "Republicans press Kehoe to launch redistricting effort to help Trump",
    "description": "President Donald Trump wants states to redraw congressional maps to ensure Republicans stay in control of the U.S. House",
    "link": "https://www.stltoday.com/news/local/government-politics/article_8fb0a2df-ea19-423c-a32b-93ab78a07e01.html",
    "timestamp": "2025-08-14T18:45:00Z"
  },
  {
    "title": "Bitcoin Poised For Sharpest Daily Drop In Months After Latest Record-Breaking Rally—Here’s Why",
    "description": "The world’s largest cryptocurrency appeared to be hit by poor inflation data and cooled government interest.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/08/14/bitcoin-poised-for-sharpest-daily-drop-in-months-after-latest-record-breaking-rally-heres-why/",
    "timestamp": "2025-08-14T18:43:07Z"
  },
  {
    "title": "D.C. Residents Protest Authorities Cracking Down on Crime as 'Fascists'",
    "description": "Washington, DC residents on Wednesday heckled federal law enforcement officers' presence in the capital city as President Donald Trump seeks to crack down on crime.\nThe post D.C. Residents Protest Authorities Cracking Down on Crime as ‘Fascists’ appeared firs…",
    "link": "https://www.breitbart.com/politics/2025/08/14/d-c-residents-protest-authorities-cracking-down-on-crime-as-fascists/",
    "timestamp": "2025-08-14T18:42:17Z"
  },
  {
    "title": "ICE detains another NYC public school student: 'We've been fearing this all summer'",
    "description": "Mamadou Mouctar Diallo, 20, is seen in a photo at a rally near City Hall in Manhattan on Aug. 14, 2025.\n \n\nMamadou Mouctar Diallo, a 20-year-old at a Brooklyn high school, was taken into custody at his immigration hearing. [ more › ]",
    "link": "https://gothamist.com/news/ice-detains-another-nyc-public-school-student-city-officials-say",
    "timestamp": "2025-08-14T18:42:00Z"
  },
  {
    "title": "DC police announce major action on immigration enforcement after Trump's crime crackdown",
    "description": "DC police chief authorizes sharing information with immigration agencies during traffic stops but prohibits arrests based solely on federal immigration warrants.",
    "link": "https://www.foxnews.com/politics/dc-police-announce-major-action-immigration-enforcement-after-trumps-crime-crackdown",
    "timestamp": "2025-08-14T18:41:45Z"
  },
  {
    "title": "Steep tariffs on India for buying oil got Russia to bargaining table: Trump",
    "description": "\"Everything has an impact,\" Trump said on Fox Radio's Brian Kilmeade Show when asked if the move influenced Putin's decision to meet him. Secondary tariffs against India \"essentially took them out of buying oil from Russia... Certainly, when you lose your sec…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/steep-tariffs-on-india-for-buying-oil-got-russia-to-bargaining-table-trump/articleshow/123311803.cms",
    "timestamp": "2025-08-14T18:38:44Z"
  },
  {
    "title": "Jeanine Wino Pirro Clowned For Celebrating About Man Charged With A Felony For Chucking His Subway Sandwich At A Border Agent",
    "description": "A man was charged with felony assault after chucking his Subway sandwich at a federal officer, and current US Attorney for DC, Jeanine Pirro, thinks it's hilarious.",
    "link": "https://hiphopwired.com/playlist/jeanine-pirro-celebrates-subway-sandwich-thrower-arrest-reactions/",
    "timestamp": "2025-08-14T18:37:19Z"
  },
  {
    "title": "India says de-dollarisation not on it's agenda as Brazil plans BRICS meet",
    "description": "Brazilian President Lula da Silva will host a virtual BRICS summit to discuss responses to Donald Trump's tariffs. This follows Trump's threat of 100% tariffs on BRICS nations pursuing a shared currency. India, a BRICS member, remains in contact with other me…",
    "link": "https://economictimes.indiatimes.com/news/india/india-says-de-dollarisation-not-on-its-agenda-as-brazil-plans-brics-meet/articleshow/123311729.cms",
    "timestamp": "2025-08-14T18:36:43Z"
  },
  {
    "title": "Trump: 'I'd like to see Israel letting journalists into Gaza to cover the war'",
    "description": "Real time news brief - Trump: 'I'd like to see Israel letting journalists into Gaza to cover the war' - Israel National News flashes around the clock are waiting for you on the site",
    "link": "https://www.israelnationalnews.com/flashes/664300",
    "timestamp": "2025-08-14T18:35:30Z"
  },
  {
    "title": "Laura Loomer's Attack On RFK Jr.: The Latest MAGA Feud, Explained",
    "description": "“Rabid Trump haters continue to be hired in the Trump administration,” Loomer tweeted recently.",
    "link": "https://www.forbes.com/sites/saradorn/2025/08/14/laura-loomers-attack-on-rfk-jr-the-latest-maga-feud-explained/",
    "timestamp": "2025-08-14T18:34:38Z"
  },
  {
    "title": "Taiwan Semiconductor Stocks: Analyzing TSM Vs. TSMY For Your Investment Strategy",
    "description": "Looking at Taiwan Semiconductor? Analyze TSM vs. TSMY to understand the difference between growth potential and high-yield income to make a smart investment..",
    "link": "https://www.forbes.com/sites/investor-hub/article/taiwan-semiconductor-stocks-tsm-vs-tsmy/",
    "timestamp": "2025-08-14T18:32:39Z"
  },
  {
    "title": "‘The View’ Host Ana Navarro Tells Gloria Gaynor to Reject Trump’s Kennedy Center Honor: He Has ‘Attacked the Rights of Women, People of",
    "description": "‘The View’ Host Ana Navarro Tells Gloria Gaynor to Reject Trump’s Kennedy Center Honor: He Has ‘Attacked the Rights of Women, People of Color and LGBTQ’variety.com How Sly Stallone and Gloria Gaynor explain Trump and his presidencyCNN KISS Members Who Once Re…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178676160",
    "timestamp": "2025-08-14T18:32:05Z"
  },
  {
    "title": "‘No F***ing Way!’ Chuck Schumer Loses It On Podcaster Over Trump Query",
    "description": "Chuck Schumer lost it when a Gen Z podcaster served up a hypothetical question about Donald Trump's takeover of Washington, D.C.'s police force.\nThe post ‘No F***ing Way!’ Chuck Schumer Loses It On Podcaster Over Trump Query first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/no-fing-way-chuck-schumer-loses-it-on-podcaster-over-trump-query/",
    "timestamp": "2025-08-14T18:30:40Z"
  },
  {
    "title": "U.S. producer prices surge in July as Trump tariffs push costs higher",
    "description": "U.S. wholesale inflation surged unexpectedly last month as President Donald Trump’s sweeping taxes on imports are pushing costs higher.",
    "link": "https://www.news4jax.com/business/2025/08/14/us-producer-prices-surge-in-july-as-trump-tariffs-push-costs-higher/",
    "timestamp": "2025-08-14T18:30:32Z"
  },
  {
    "title": "Bitpanda launches in UK, sets two-year growth target",
    "description": "Bitpanda has launched in the UK, offering over 600 crypto assets, B2B services, and an Arsenal FC partnership. The move comes as slow UK regulation leaves new entrants competing with entrenched rivals.",
    "link": "https://cointelegraph.com/news/bitpanda-launches-uk-crypto-assets-partnership",
    "timestamp": "2025-08-14T18:30:06Z"
  },
  {
    "title": "Here’s the Real Guy Who Got to Hang Out with Jesus and Randy Marsh in the ‘South Park’ Premiere",
    "description": "By\n JM McNab\n Published: August 14th, 2025",
    "link": "https://www.cracked.com/article_47874_heres-the-real-guy-who-got-to-hang-out-with-jesus-and-randy-marsh-in-the-south-park-premiere.html",
    "timestamp": "2025-08-14T18:30:00Z"
  },
  {
    "title": "End the Zen! Politico Senior Editor Irked by DC Mayor NOT Trashing Trump Enough",
    "description": "Politico senior editor Michael Schaffer seems quite irked over Washington, D.C. mayor Muriel Bowser not publicly lambasting President Donald Trump after he ordered the federal takeover of the district's police department to combat the city's crime problem.Sch…",
    "link": "https://freerepublic.com/focus/f-bloggers/4334609/posts",
    "timestamp": "2025-08-14T18:29:24Z"
  },
  {
    "title": "End the Zen! Politico Senior Editor Irked by DC Mayor NOT Trashing Trump Enough",
    "description": "Politico senior editor Michael Schaffer seems quite irked over Washington, D.C. mayor Muriel Bowser not publicly lambasting President Donald Trump after he ordered the federal takeover of the district's police department to combat the city's crime problem.Sch…",
    "link": "https://freerepublic.com/focus/f-news/4334609/posts",
    "timestamp": "2025-08-14T18:29:24Z"
  },
  {
    "title": "Trump says Putin ready to make deal on Ukraine, US hopes to include Zelenskyy",
    "description": "\"The second meeting is going to be very, very, very important. This meeting sets up like a chess game. This (first) meeting sets up a second meeting, but there is a 25 percent chance that this meeting will not be a successful meeting,\" Trump said.",
    "link": "https://www.channelnewsasia.com/world/trump-says-putin-ready-make-deal-ukraine-us-hopes-include-zelenskyy-5295231",
    "timestamp": "2025-08-14T18:28:16Z"
  },
  {
    "title": "Trump’s Tariffs: Why Retail Could Look To China",
    "description": "Deep dive into 2025’s shifting U.S. tariffs, from ‘Liberation Day’ to China and India moves, with inflation impacts, court challenges, and holiday retail risks.",
    "link": "https://www.forbes.com/sites/briandelp/2025/08/14/trumps-tariffs-why-retail-could-look-to-china/",
    "timestamp": "2025-08-14T18:27:53Z"
  },
  {
    "title": "Fox Panel Erupts After Democrat Brings Up January 6 in Heated DC Crime Debate",
    "description": "The panel of Fox News' Outnumbered got into it when a guest Democrat brought up January 6 in a debate about crime in Washington, D.C.\nThe post Fox Panel Erupts After Democrat Brings Up January 6 in Heated DC Crime Debate first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/fox-panel-erupts-after-democrat-brings-up-january-6-in-heated-dc-crime-debate/",
    "timestamp": "2025-08-14T18:27:10Z"
  },
  {
    "title": "Highway to peace – or to the next war?",
    "description": "A 43-kilometer stretch through Syunik is set to connect two parts of Azerbaijan. It also might connect a chain of geopolitical fault lines. Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622893-highway-to-peace-or-to-war/",
    "timestamp": "2025-08-14T18:26:59Z"
  }
]