[
  {
    "title": "Lawyers for Comey seek grand jury transcript, bringing fresh challenge to a case pushed by Trump",
    "description": "Lawyers for former FBI Director James Comey want to review a transcript and audio recording of grand jury proceedings in his criminal case, citing what they ...",
    "link": "https://www.yahoo.com/news/articles/lawyers-comey-seek-grand-jury-224943115.html",
    "timestamp": "2025-10-30T22:49:43Z"
  },
  {
    "title": "Trump Says Nvidia Chip Talks With Xi Didn’t Cover Blackwell",
    "description": "US President Donald Trump said he didn’t discuss approving sales of Nvidia Corp.’s Blackwell chips to China with his counterpart Xi Jinping, dampening speculation that Washington will allow exports of the powerful AI accelerators to the world’s largest semico…",
    "link": "https://biztoc.com/x/3e5a793224d71875",
    "timestamp": "2025-10-30T22:49:13Z"
  },
  {
    "title": "Commentary: Trump–Xi talks cool tempers, not conflicts, in chips and rare earths",
    "description": "On 30 October 2025, Donald Trump and Xi Jinping met in Busan, South Korea, in a summit that could redefine the global trade and technology order. It marked their first meeting since Trump's return to the White House and their second in six years, a long-await…",
    "link": "https://www.digitimes.com/news/a20251030PD220/donald-trump-xi-jingping-rare-earth-taiwan-technology-2025.html",
    "timestamp": "2025-10-30T22:46:26Z"
  },
  {
    "title": "Ohio panel unveils proposed US House map that could help Republicans win more seats",
    "description": "Ohio's Republican-led redistricting commission has unveiled a new U.S. House map that could give Republicans a chance to win two more seats in next year's elections",
    "link": "https://abcnews.go.com/Politics/wireStory/ohio-panel-unveils-proposed-us-house-map-republicans-127037805",
    "timestamp": "2025-10-30T22:45:34Z"
  },
  {
    "title": "Senators leave town as the shutdown pain reaches ‘point of absurdity’",
    "description": "For the first time since the shutdown began, senators began expressing some optimism this week that a solution might be around the corner. But it won't come this week.",
    "link": "https://www.msnbc.com/msnbc/news/senators-leave-town-shutdown-pain-rcna240949",
    "timestamp": "2025-10-30T22:43:59Z"
  },
  {
    "title": "Why does Trump want the National Guard doing crowd control?",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The Pentagon is moving to create new National Guard “q…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/466792/trump-national-guard-quick-reaction-forces-crowd-control",
    "timestamp": "2025-10-30T22:40:09Z"
  },
  {
    "title": "Trump Takes Credit for Nobel Prize Awarded for Research Done in the 1980s",
    "description": "President Donald Trump took credit for winning the Nobel Prize in Physics, which was awarded this month to three scientists.\nThe post Trump Takes Credit for Nobel Prize Awarded for Research Done in the 1980s first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/trump-takes-credit-for-nobel-prize-awarded-for-research-done-in-the-1980s/",
    "timestamp": "2025-10-30T22:39:18Z"
  },
  {
    "title": "US delay on China export restriction could defang it, former US officials say",
    "description": "(Reuters) -Washington's decision to delay a rule on export restrictions for Chinese companies, announced by China after Thursday's summit meeting with U...",
    "link": "https://www.yahoo.com/news/articles/us-delay-china-export-restriction-223804258.html",
    "timestamp": "2025-10-30T22:38:04Z"
  },
  {
    "title": "Kamala Harris Says Biden Is 'All About Himself': Ex-VP Reveals Call That Left Her 'Disappointed'",
    "description": "Kamala Harris says Joe Biden was 'all about himself' in a 'deeply disappointing' call moments before her Trump debate, she told The Diary of a CEO.",
    "link": "https://www.ibtimes.com/kamala-harris-says-biden-all-about-himself-ex-vp-reveals-call-that-left-her-disappointed-3788992",
    "timestamp": "2025-10-30T22:36:25Z"
  },
  {
    "title": "What Time Does The ‘South Park' Halloween Episode Begin? How To Watch",
    "description": "Trey Parker and Matt Stone’s “South Park” surprisingly skipped its normal time slot this week and pushed its new episode to Halloween night. What time does the episode begin on cable and streaming?",
    "link": "https://www.forbes.com/sites/timlammers/2025/10/30/what-time-does-the-south-park-halloween-episode-begin-how-to-watch/",
    "timestamp": "2025-10-30T22:35:00Z"
  },
  {
    "title": "4 Likely Next Steps From Congressional Probe of Jack Smith and ‘Arctic Frost’",
    "description": "As revelations about former special counsel Jack Smith’s investigation into the Jan. 6, 2021, U.S. Capitol protest come to light, an investigation of the investigator... Read More\nThe post 4 Likely Next Steps From Congressional Probe of Jack Smith and ‘Arctic…",
    "link": "https://www.dailysignal.com/2025/10/30/4-likely-next-steps-congressional-probe-jack-smith-arctic-frost/",
    "timestamp": "2025-10-30T22:34:49Z"
  },
  {
    "title": "Platner Mobilizes Mainers to Fight Billionaire-Funded Attack on Absentee Voting",
    "description": "Graham Platner isn't on the ballot until next year, but while campaigning across Maine for the June Democratic primary, the US Senate candidate is rallying opposition to Question 1, which state voters are set to decide on in Tuesday's election. If approved, t…",
    "link": "https://www.commondreams.org/news/maine-question-1",
    "timestamp": "2025-10-30T22:34:15Z"
  },
  {
    "title": "Candace Owens Roasts FBI Director Kash Patel For 'Lack' of Transparency: 'Would Die From Shame'",
    "description": "Candace Owens attacks FBI Director Kash Patel over the Charlie Kirk murder investigation, revealing she would have gone 'torched earth' at his memorial.",
    "link": "https://www.ibtimes.com/candace-owens-roasts-fbi-director-kash-patel-lack-transparency-would-die-shame-3789011",
    "timestamp": "2025-10-30T22:32:37Z"
  },
  {
    "title": "DeSantis Orders Florida Universities to End H-1B Visa Hiring, Sparking National Debate on Immigration",
    "description": "Florida Governor Ron DeSantis orders state universities to end H-1B visa hiring, affecting nearly 400 foreign workers. The controversial move aligns with Trump administration immigration reforms and sparks debate over specialty occupation visas in higher educ…",
    "link": "https://www.ibtimes.com/desantis-orders-florida-universities-end-h-1b-visa-hiring-sparking-national-debate-immigration-3789016",
    "timestamp": "2025-10-30T22:31:41Z"
  },
  {
    "title": "Apple claims 'tremendous' global uptake of latest iPhones",
    "description": "Apple's thinnest iPhone, the Air, plus the latest 17 models helped boost sales in September.",
    "link": "https://www.bbc.com/news/articles/cz6n98exv9zo",
    "timestamp": "2025-10-30T22:31:22Z"
  },
  {
    "title": "U.S. Has Now Killed Over 60 People In Strikes Against Alleged Drug Vessels",
    "description": "The U.S. has now killed more than 60 people in its different strikes against alleged drug vessels in the eastern Pacific and the Caribbean",
    "link": "https://www.ibtimes.com/us-has-now-killed-over-60-people-strikes-against-alleged-drug-vessels-3789026",
    "timestamp": "2025-10-30T22:30:14Z"
  },
  {
    "title": "Trump Orders Immediate Resumption of U.S. Nuclear Weapons Testing",
    "description": "In a move that signals a dramatic shift in global security policy, President Donald Trump has ordered the Pentagon to immediately resume testing nuclear weapons, ending a 33-year moratorium. The announcement came just minutes before a high-stakes meeting with…",
    "link": "https://www.shtfplan.com/headline-news/trump-orders-immediate-resumption-of-u-s-nuclear-weapons-testing",
    "timestamp": "2025-10-30T22:30:08Z"
  },
  {
    "title": "Republicans think they’ve uncovered a story that’s ‘bigger than Watergate’ (again)",
    "description": "You’ve heard of the boy who cried “wolf”? Over the last decade or so, Republicans have become the party that cried “Watergate.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-think-ve-uncovered-story-s-bigger-watergate-rcna240927",
    "timestamp": "2025-10-30T22:28:55Z"
  },
  {
    "title": "Republicans admit Dems wrongly snubbed from Trump’s secret Venezuela briefing: senator",
    "description": "WASHINGTON — The Trump administration snubbed Senate Democrats this week with a secret GOP-only Venezuela briefing on Wednesday in what a lawmaker is calling \"an effort to hide the facts from the American people.\" Democrats are now calling on Republicans to c…",
    "link": "https://www.rawstory.com/raw-investigates/venezuela-2674252064/",
    "timestamp": "2025-10-30T22:27:03Z"
  },
  {
    "title": "Testing US nuclear arsenal is important to national security, Vance says",
    "description": "WASHINGTON (Reuters) -Testing the U.S. nuclear arsenal is important to ensuring national security, Vice President JD Vance said on Thursday after President Donald Trump ordered the U.S. military to resume testing nuclear weapons after a gap of 33 years. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/10/31/testing-us-nuclear-arsenal-is-important-to-national-security-vance-says",
    "timestamp": "2025-10-30T22:26:00Z"
  },
  {
    "title": "Rand Paul Again Slams Trump Over Strikes Against Alleged Drug Boats: 'Unchecked Powers Are Dangerous'",
    "description": "Republican Sen. Rand Paul again slammed President Donald Trump over the administration's escalating military campaign in the Caribbean and Eastern Pacific.",
    "link": "https://www.ibtimes.com/rand-paul-again-slams-trump-over-strikes-against-alleged-drug-boats-unchecked-powers-are-3788988",
    "timestamp": "2025-10-30T22:24:58Z"
  },
  {
    "title": "President Xi Jinping Meets with U.S. President Donald J. Trump in Busan",
    "description": "On October 30, 2025 local time, President Xi Jinping had a meeting with U.S. President Donald J. Trump in Busan.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/10/china-251030-prc-mofa01.htm",
    "timestamp": "2025-10-30T22:23:35Z"
  },
  {
    "title": "Xi says ready to work with Trump to build solid foundation for bilateral ties",
    "description": "Chinese President Xi Jinping said here Thursday that he is ready to continue working with U.S. President Donald Trump to build a solid foundation for bilateral ties, and create a sound atmosphere for the development of both countries.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/10/china-251030-prc-mnd01.htm",
    "timestamp": "2025-10-30T22:23:35Z"
  },
  {
    "title": "World News in Brief: Ukraine energy targeted, nuclear proliferation warning, rights violations in Nicaragua",
    "description": "Russian armed forces conducted another large-scale combined attack across Ukraine in the early hours of Thursday, reportedly targeting critical energy infrastructure, said the UN Human Rights Monitoring Mission for Ukraine.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251030-unnews04.htm",
    "timestamp": "2025-10-30T22:23:35Z"
  },
  {
    "title": "Romanian Foreign Minister Says NATO Members To Fill Void Left By Departing US Forces",
    "description": "Other NATO members will provide troops to fill the void created by the departure of US soldiers from Romania, the country's Foreign Minister Oana Toiu told RFE/RL, leaving the alliance with a \"stronger\" presence.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251030-rferl01.htm",
    "timestamp": "2025-10-30T22:23:35Z"
  },
  {
    "title": "Trump Strikes A Trade Truce With Xi, But Superpower Competition Is Here To Stay",
    "description": "US President Donald Trump has struck a truce in the trade war with China, telling reporters after his high-stakes meeting with Chinese leader Xi Jinping in South Korea that he expects to sign a bilateral deal with Beijing \"pretty soon.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/10/china-251030-rferl02.htm",
    "timestamp": "2025-10-30T22:23:35Z"
  },
  {
    "title": "Comey cites ‘potential misconduct’ in attempt to obtain details of grand jury proceedings",
    "description": "The former FBI director had already filed motions to dismiss his case that raise significant issues of vindictive prosecution and the legality of the appointment of Lindsey Halligan, the prosecutor who secured his indictment.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/james-comey-grand-jury-motion-lindsey-halligan-trump-rcna240838",
    "timestamp": "2025-10-30T22:23:17Z"
  },
  {
    "title": "Hegseth orders the military to detail dozens of attorneys to the Justice Department, AP learns",
    "description": "Defense Secretary Pete Hegseth has ordered the military to provide dozens of lawyers to the Justice Department for temporary assignments in Memphis and near the U.S.-Mexico border that could run through next fall",
    "link": "https://abcnews.go.com/Politics/wireStory/hegseth-orders-military-detail-dozens-attorneys-justice-department-127039598",
    "timestamp": "2025-10-30T22:21:50Z"
  },
  {
    "title": "Rahul Gandhi: PM lacks courage to take on Trump over ceasefire claim",
    "description": "“Modi was supposed to visit the US... but he is not going because he is scared of Trump,” alleged Gandhi. “If the PM has the courage, let him say that Trump did not stop Operation Sindoor.”",
    "link": "https://indianexpress.com/article/india/rahul-gandhi-pm-lacks-courage-to-take-on-trump-over-ceasefire-claim-10336916/",
    "timestamp": "2025-10-30T22:21:35Z"
  },
  {
    "title": "Ex-FBI chief Comey argues 2020 testimony can't sustain false statements case",
    "description": "By Andrew Goudsward WASHINGTON (Reuters) -Former FBI Director James Comey on Thursday expanded his legal challenge to a Trump administration criminal case...",
    "link": "https://www.yahoo.com/news/articles/ex-fbi-chief-comey-argues-222025906.html",
    "timestamp": "2025-10-30T22:20:25Z"
  },
  {
    "title": "Trump’s new online prediction market plans to take bets on politics",
    "description": "On Tuesday, Donald Trump's media company, Trump Media and Technology Group, announced in a press release that it is launching an online prediction market, or betting platform, via Truth Social.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-truth-social-online-betting-prediction-market-rcna240908",
    "timestamp": "2025-10-30T22:19:03Z"
  },
  {
    "title": "Fox News Poll: Sherrill leads Ciattarelli in New Jersey governor's race (Dana Blanton/Fox News)",
    "description": "Dana Blanton / Fox News:\nFox News Poll: Sherrill leads Ciattarelli in New Jersey governor's race  —  President Donald Trump isn't on the ballot this year, but New Jersey voters are sending him a message.  More are negative toward Trump than positive by 11 per…",
    "link": "https://www.memeorandum.com/251030/p120",
    "timestamp": "2025-10-30T22:15:03Z"
  },
  {
    "title": "Xbox Hardware Sales Continue To Nosedive",
    "description": "Given recent news about the state of the Xbox Series S and X consoles, it shouldn't come as a surprise that Xbox's hardware sales continue to nosedive.",
    "link": "https://hiphopwired.com/2889004/xbox-hardware-sales-nosedive-year-over-year-details/",
    "timestamp": "2025-10-30T22:11:34Z"
  },
  {
    "title": "Hegseth orders the military to detail dozens of attorneys to the Justice Department, AP learns",
    "description": "The temporary assignments in Memphis and near the U.S.-Mexico border could run through next fall.",
    "link": "https://www.denverpost.com/2025/10/30/pentagon-attorneys/",
    "timestamp": "2025-10-30T22:11:34Z"
  },
  {
    "title": "Hegseth orders the military to detail dozens of attorneys to the Justice Department, AP learns",
    "description": "The temporary assignments in Memphis and near the U.S.-Mexico border could run through next fall.",
    "link": "https://www.bostonherald.com/2025/10/30/pentagon-attorneys/",
    "timestamp": "2025-10-30T22:11:34Z"
  },
  {
    "title": "Judge nixes Justice Department subpoena of telehealth trans health care provider",
    "description": "A federal judge has quashed the Department of Justice’s subpoena for the records of QueerDoc, a telehealth service that prescribes medications and offers consulting for gender-affirming care in 10 states.",
    "link": "https://www.advocate.com/news/judge-nixes-doj-subpoena-queerdoc",
    "timestamp": "2025-10-30T22:08:06Z"
  },
  {
    "title": "Hegseth orders the military to detail dozens of attorneys to the Justice Department, AP learns",
    "description": "Defense Secretary Pete Hegseth has ordered the military to provide dozens of lawyers to the Justice Department for temporary assignments in Memphis and near ...",
    "link": "https://www.yahoo.com/news/articles/hegseth-orders-military-detail-dozens-220613093.html",
    "timestamp": "2025-10-30T22:06:13Z"
  },
  {
    "title": "Kamala Harris Gets Candid About Her Joe Rogan Regrets",
    "description": "“Pride is not associated with it,” she said.",
    "link": "https://www.huffpost.com/entry/kamala-harris-gets-candid-about-her-joe-rogan-regrets_n_6903c5b8e4b0b48d8a1bad8e",
    "timestamp": "2025-10-30T22:05:12Z"
  },
  {
    "title": "Myriad Moves: Bitcoin Odds Flip Bearish as Traders Expect Longest US Gov Shutdown in History",
    "description": "Top markets on Myriad this week include predictions on Bitcoin's next move, the U.S. government shutdown, and more.",
    "link": "https://decrypt.co/346857/myriad-moves-bitcoin-odds-flip-bearish-traders-expect-longest-us-gov-shutdown",
    "timestamp": "2025-10-30T22:03:48Z"
  },
  {
    "title": "California girls' volleyball players speak out on refusing to play in playoff game against trans athlete",
    "description": "Trans athlete AB Hernandez's volleyball season ended amid controversy involving President Donald Trump, California Gov. Gavin Newsom and multiple team forfeits.",
    "link": "https://www.foxnews.com/sports/california-girls-volleyball-players-speak-out-refusing-play-playoff-game-against-trans-athlete",
    "timestamp": "2025-10-30T22:01:00Z"
  },
  {
    "title": "Fox News Poll: Sherrill leads Ciattarelli in New Jersey governor’s race",
    "description": "Mikie Sherrill leads Jack Ciattarelli 52-45% in New Jersey governor race as Trump opposition drives Democratic turnout, new Fox News poll shows.",
    "link": "https://www.foxnews.com/politics/fox-news-poll-sherrill-leads-ciattarelli-new-jersey-governors-race",
    "timestamp": "2025-10-30T22:00:04Z"
  },
  {
    "title": "Fox News Poll: Mamdani’s lead narrows in New York City mayoral race",
    "description": "NYC mayor race poll shows Zohran Mamdani's lead over Curtis Sliwa and Andrew Cuomo narrowing to 16 points, down from 24 points in October polling data.",
    "link": "https://www.foxnews.com/politics/fox-news-poll-mamdanis-lead-narrows-new-york-city-mayoral-race",
    "timestamp": "2025-10-30T22:00:00Z"
  },
  {
    "title": "Commentary: Nvidia’s US$5 trillion valuation redefines what Big Tech means",
    "description": "There was a time when Nvidia was a company responsible for making video games look better. Those carefree days are over, says Dave Lee of Bloomberg Opinion.",
    "link": "https://www.channelnewsasia.com/commentary/nvidia-5-trillion-valuation-big-tech-chips-ai-5434566",
    "timestamp": "2025-10-30T21:58:00Z"
  },
  {
    "title": "New Jersey early vote reveals a Jack Ciattarelli surge — and an Election Night toss-up",
    "description": "Democrat Mikie Sherill holds what looks like a strong early-vote lead — but she's actually underperforming, as Jack Ciattarelli taps into GOP enthusiasm.",
    "link": "https://nypost.com/2025/10/30/opinion/new-jersey-early-vote-reveals-a-jack-ciattarelli-surge-and-a-toss-up-race/",
    "timestamp": "2025-10-30T21:57:23Z"
  },
  {
    "title": "ICE sent into frenzy to return longtime Trump golf employee mistakenly deported to Mexico",
    "description": "A longtime former employee at one of President Donald Trump's golf clubs was mistakenly deported to Mexico, The New York Times reported — sending U.S. Immigration and Customs Enforcement into a mad scramble to correct the error and bring him home.\"Alejandro J…",
    "link": "https://www.rawstory.com/trump-ice-2674252097/",
    "timestamp": "2025-10-30T21:57:04Z"
  },
  {
    "title": "ChatGPT Bill de Blasio Is a Sign of Things to Come",
    "description": "The de Blasio \"impersonator\" was profiled in 2020. But he didn't have AI back then.",
    "link": "https://gizmodo.com/chatgpt-bill-de-blasio-is-a-sign-of-things-to-come-2000679477",
    "timestamp": "2025-10-30T21:55:00Z"
  },
  {
    "title": "Watch Live: Donald and Melania Trump Hold White House Halloween Celebration",
    "description": "President Donald Trump and First Lady Melania Trump welcome trick-or-treaters to the White House for a Halloween celebration on Thursday, October 30.\nThe post Watch Live: Donald and Melania Trump Hold White House Halloween Celebration appeared first on Breitb…",
    "link": "https://www.breitbart.com/politics/2025/10/30/watch-live-donald-and-melania-trump-hold-white-house-halloween-celebration/",
    "timestamp": "2025-10-30T21:54:54Z"
  },
  {
    "title": "Pete Hegseth wasn't named 'CEO of War' after saying 'secretary is a lady job'",
    "description": "In October 2025, the U.S. Department of Defense said its boss, Secretary Pete Hegseth, would go by the title of \"CEO of War\" because Hegseth thought \"secretary is a lady job.\"",
    "link": "https://www.snopes.com//fact-check/hegseth-ceo-of-war/",
    "timestamp": "2025-10-30T21:54:00Z"
  },
  {
    "title": "Trump-Xi talks buy time not trust over trade dispute",
    "description": "Thursday's high-stakes encounter between US President Donald Trump and his Chinese counterpart Xi Jinpingwas meant to help resolve months of global tariff tensions and smooth trade between the world's two largest economies.\nWhile Trump gave the \"amazing\" talk…",
    "link": "https://biztoc.com/x/ed231826d9beed8d",
    "timestamp": "2025-10-30T21:53:58Z"
  },
  {
    "title": "Palantir communications chief calls the company's political shift 'concerning'",
    "description": "Palantir Head of Global Communications Lisa Gordon's comments come as CEO Alex Karp aligns himself further with the Trump administration.",
    "link": "https://www.cnbc.com/2025/10/30/palantir-trump-karp-politics.html",
    "timestamp": "2025-10-30T21:53:32Z"
  },
  {
    "title": "Nvidia Stock Falls After Trump Says Blackwell Chips Were Not Discussed",
    "description": "Trump Halts Nvidia's China Chip Dreams -- $5 Trillion AI Rally Hits Pause",
    "link": "https://finance.yahoo.com/news/nvidia-stock-falls-trump-says-215235049.html",
    "timestamp": "2025-10-30T21:52:35Z"
  },
  {
    "title": "What to know about Russia's nuclear-capable weapons testing",
    "description": "Questions have arisen after Russian President Vladimir Putin said his country tested two nuclear-capable weapons this week.",
    "link": "https://abcnews.go.com/International/recent-russian-nuclear-capable-weapons-testing/story?id=127024334",
    "timestamp": "2025-10-30T21:49:57Z"
  },
  {
    "title": "Kamala Harris Curses Out Trump Amid SNAP Funding Crisis",
    "description": "\"Are you f**king kidding me?\" the former vice president asked comedian Jon Stewart during the Thursday episode of his podcast.",
    "link": "https://www.huffpost.com/entry/kamala-harris-trump-ballroom-food-benefits_n_6903b634e4b0b48d8a1b9793",
    "timestamp": "2025-10-30T21:48:08Z"
  },
  {
    "title": "Karnataka high court calls for revamping CooperativeSocieties Act to meet modern needs",
    "description": "Bengaluru: The Dharwad bench of the Karnataka high court has recommended an overhaul of the Karnataka Cooperative Societies Act, 1959 and its rules, w.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/karnataka-high-court-calls-for-revamping-cooperativesocieties-act-to-meet-modern-needs/articleshow/124966601.cms",
    "timestamp": "2025-10-30T21:46:47Z"
  },
  {
    "title": "Rachel Zegler Just Can’t Stop Talking About ‘Celebrated’ ‘Snow White’",
    "description": "One would think that after having the biggest failure of your career, you would want to run and hide from it. However, live-action Snow White (2025) star Rachel Zegler just can’t stop talking about what some consider the worst film of the year. In a recent in…",
    "link": "https://insidethemagic.net/2025/10/rachel-zegler-keeps-talking-about-snow-white-failure-rl1/",
    "timestamp": "2025-10-30T21:46:09Z"
  },
  {
    "title": "Vignettes from the Age of Trump",
    "description": "Preserved for the contemplation of future historians, if any: On November 12, 2005, Vanessa Kay Trump, nee Pergolizzi, later Haydon] married Donald Trump Jr. The wedding was held at the Mar-a-Lago club in Florida; the service was officiated by Trump Jr.’s aun…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/vignettes-from-the-age-of-trump",
    "timestamp": "2025-10-30T21:45:41Z"
  },
  {
    "title": "Speaker Johnson Silent After GOP Senators Urge House Hearings, Impeachment Over Arctic Frost",
    "description": "House Speaker Mike Johnson is noticeably silent on whether there will be House hearings and impeachment proceedings following bombshell revelations in the Arctic Frost scandal. Senate Republicans revealed Wednesday that the DOJ and FBI under then-President Jo…",
    "link": "https://freerepublic.com/focus/f-news/4349690/posts",
    "timestamp": "2025-10-30T21:44:16Z"
  },
  {
    "title": "Chilling NYT Cover Goes Viral After Trump Confirms Its Worst Fears",
    "description": "A prophetic cover from The New York Times’ opinion section has gone viral on the anniversary of its original publication. The year-old page came from a...",
    "link": "https://www.thedailybeast.com/chilling-new-york-times-cover-goes-viral-after-trump-confirms-its-worst-fears/",
    "timestamp": "2025-10-30T21:43:30Z"
  },
  {
    "title": "Karnataka allows RSS march on Mallikarjun Kharge turf",
    "description": "India News: YADGIR/BENGALURU: Days after Karnataka HC stayed state govt order restricting public gatherings of more than 10 people, Yadgir district administration.",
    "link": "https://timesofindia.indiatimes.com/india/karnataka-allows-rss-march-on-mallikarjun-kharge-turf/articleshow/124971714.cms",
    "timestamp": "2025-10-30T21:43:17Z"
  },
  {
    "title": "'The house is on fire!' Ex-FBI agent slams silent DOJ leaders for cowardice",
    "description": "A panel on MSNBC shamed a few former officials who refused to speak out publicly against President Donald Trump. National security analyst Michael Feinberg, a fired FBI agent who was pushed out for his friendship with Peter Strzok, spoke to host Nicolle Walla…",
    "link": "https://www.rawstory.com/christopher-wray-2674252061/",
    "timestamp": "2025-10-30T21:43:03Z"
  },
  {
    "title": "Spiraling effects of federal government shutdown leave lawmakers grasping for ways to end it",
    "description": "WASHINGTON — Certain senators know it. House Speaker Mike Johnson knows it. And with President Donald Trump back in Washington from his overseas trip, perhaps the White House knows it, too.\nFor many, it’s time for the government shutdown to come to an end.\nFr…",
    "link": "https://biztoc.com/x/c16df363fd5da9ca",
    "timestamp": "2025-10-30T21:42:55Z"
  },
  {
    "title": "Trump Shrinks Refugee Inflow to 7,500 for 2026, Includes White South Africans",
    "description": "President Donald Trump is shrinking the inflow of refugees down to 7,500 refugees in 2026, which will help ordinary Americans earn higher wages from employers and also afford better housing.\nThe post Trump Shrinks Refugee Inflow to 7,500 for 2026, Includes Wh…",
    "link": "https://www.breitbart.com/immigration/2025/10/30/trump-shrinks-refugee-inflow-to-7500-for-2026-includes-white-south-africans/",
    "timestamp": "2025-10-30T21:41:54Z"
  },
  {
    "title": "Trump announces dramatic drop in US refugee intake, with most coming from one country",
    "description": "The new figure is a dramatic reduction from last year's 125,000, set by former president Joe Biden and half the 15,000 total for 2021, reportedly the previous lowest.",
    "link": "https://news.sky.com/story/donald-trump-announces-dramatic-drop-in-us-refugee-intake-with-most-of-them-white-south-africans-13460936",
    "timestamp": "2025-10-30T21:40:00Z"
  },
  {
    "title": "Trump Orders Nuclear Weapons Testing To Be Carried Out By The Guys From Dude Perfect",
    "description": "https://babylonbee.com/news/trump-orders-nuclear-weapons-testing-to-be-carried-out-by-the-guys-from-dude-perfect U.S. — For the first time since 1992, the United States planned to resume nuclear weapons testing. President Donald Trump ordered the Pentagon to …",
    "link": "https://freerepublic.com/focus/f-chat/4349689/posts",
    "timestamp": "2025-10-30T21:39:28Z"
  },
  {
    "title": "Could air traffic controllers delaying senators’ flights end the shutdown?",
    "description": "On Thursday, air traffic controllers in Washington, D.C., caused flight delays for senators. In 2019, air traffic controllers solved the shutdown. Could it happen again?",
    "link": "https://www.msnbc.com/msnbc/news/air-traffic-controllers-delaying-senators-flights-shutdown-rcna240946",
    "timestamp": "2025-10-30T21:37:10Z"
  },
  {
    "title": "Takaichi, Lee vow to improve ties in face of global uncertainty",
    "description": "South Korean President Lee Jae Myung and Japan’s new Prime Minister Sanae Takaichi met in their first summit Thursday, pledging to strengthen ties that have been frequently strained by their bitter wartime history. Their meeting in South Korea came after both…",
    "link": "https://japantoday.com/category/politics/takaichi-lee-vow-to-improve-ties-in-face-of-global-uncertainty",
    "timestamp": "2025-10-30T21:36:56Z"
  },
  {
    "title": "Democrats, allied groups pour millions into Pennsylvania Supreme Court race to counter GOP campaign",
    "description": "Democrats and their allied groups are pouring in more money, cutting a fresh television ad with Gov. Josh Shapiro and sending in the national party chairman in the final week of campaigning for a Pennsylvania Supreme Court election, possible signs of concern …",
    "link": "https://japantoday.com/category/world/democrats-allied-groups-pour-millions-into-pennsylvania-supreme-court-race-to-counter-gop-campaign",
    "timestamp": "2025-10-30T21:36:24Z"
  },
  {
    "title": "Democrats excluded from briefing on U.S. military strikes off South America, senator says",
    "description": "President Donald Trump's administration held a Republicans-only briefing about U.S. strikes on alleged drug vessels near Venezuela, in what one senior Democrat on Thursday called a dangerous trend of increasing partisanship in national security. &quot;This is…",
    "link": "https://japantoday.com/category/world/democrats-excluded-from-briefing-on-us-military-strikes-off-south-america-senator-says1",
    "timestamp": "2025-10-30T21:35:51Z"
  },
  {
    "title": "US Justice Department places prosecutors on leave for January 6 reference",
    "description": "The prosecutors reportedly called the Trump supporters who participated in the January 6 attack a 'mob of rioters'.",
    "link": "https://www.aljazeera.com/news/2025/10/30/us-justice-department-places-prosecutors-on-leave-for-january-6-reference",
    "timestamp": "2025-10-30T21:35:49Z"
  },
  {
    "title": "Trump stirs tensions with surprise nuclear test order",
    "description": "U.S. President Donald Trump landed back in Washington Thursday after a surprise directive to begin nuclear weapons testing that raised the specter of renewed superpower tensions. The announcement on social media was issued just before Trump -- who boasts freq…",
    "link": "https://japantoday.com/category/world/trump-stirs-tensions-with-surprise-order-to-test-nuclear-weapons",
    "timestamp": "2025-10-30T21:35:28Z"
  },
  {
    "title": "Youth stabs friend to death in Bengaluru for revealing gold chain theft to his mom",
    "description": "Bengaluru: A 19-year-old engineering student was allegedly murdered by his friend after he informed the accused's mother that her son had stolen her m.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/youth-stabs-friend-to-death-in-bengaluru-for-revealing-gold-chain-theft-to-his-mom/articleshow/124966730.cms",
    "timestamp": "2025-10-30T21:35:23Z"
  },
  {
    "title": "4 Republicans back Senate resolution to undo Trump's tariffs around the globe",
    "description": "The Senate passed a resolution Thursday that would undo many of President Donald Trump's tariffs around the globe, the latest note of displeasure at his trade tactics in Washington that came just as the president celebrated his negotiations with China as a su…",
    "link": "https://japantoday.com/category/world/4-republicans-back-senate-resolution-to-undo-trump%27s-tariffs-around-the-globe",
    "timestamp": "2025-10-30T21:35:22Z"
  },
  {
    "title": "U.S. to limit refugees to record low 7,500, mostly white South Africans",
    "description": "The Trump administration announced plans on Thursday to drastically cut back the number of refugees to be accepted annually by the United States to a record low and give priority to white South Africans. Under the new policy, the United States would welcome 7…",
    "link": "https://japantoday.com/category/world/us-to-limit-refugees-to-record-low-7-500-mostly-white-south-africans",
    "timestamp": "2025-10-30T21:35:12Z"
  },
  {
    "title": "Trump and Xi agree to a one-year trade truce — but key details remain unclear - Politico",
    "description": "Trump and Xi agree to a one-year trade truce — but key details remain unclearPolitico Trump’s big concession to Xi is loaded with red flagsCNN FirstFT: Donald Trump and Xi Jinping react to US-China trade truceFinancial Times Trump and Xi Ease Off the Trade Wa…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179918052",
    "timestamp": "2025-10-30T21:32:51Z"
  },
  {
    "title": "Shutdown puts national security at risk – FBI",
    "description": "The FBI has had its probes slowed down due to the lack of funds for operational needs linked to the shutdown, Reuters has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627169-shutdown-national-security-risk-fbi/",
    "timestamp": "2025-10-30T21:31:48Z"
  },
  {
    "title": "What shutdown? Trump isn't canceling travel, golf or his ballroom even with the government shuttered",
    "description": "President Donald Trump isn't curtailing travel. He's not avoiding golf or making do with a skeleton staff in the West Wing. Even hamburgers served at the White House aren't from McDonalds, this time.  In shutdowns past — including during Trump's first term — …",
    "link": "https://japantoday.com/category/features/opinions/what-shutdown-trump-isn%27t-canceling-travel-golf-or-his-ballroom-even-with-the-government-shuttered",
    "timestamp": "2025-10-30T21:30:50Z"
  },
  {
    "title": "US judge praises prosecutors who were suspended after referring to January 6 'mob'",
    "description": "By Andrew Goudsward WASHINGTON (Reuters) -A judge on Thursday lauded two federal prosecutors who were suspended after referring to supporters of President...",
    "link": "https://www.yahoo.com/news/articles/us-judge-praises-prosecutors-were-213034697.html",
    "timestamp": "2025-10-30T21:30:34Z"
  },
  {
    "title": "The week in whoppers: Chuck Schumer fibs about White House ballroom, JB Pritzker denies his own Hitler comparisons and more",
    "description": "Senate Majority Leader Chuck Schumer shared a misleading quote that claims President Trump was only focusing on the construction of the new White House ballroom.",
    "link": "https://nypost.com/2025/10/30/opinion/the-week-in-whoppers-chuck-schumer-fibs-about-white-house-ballroom-jb-pritzker-denies-his-own-hitler-comparisons-and-more/",
    "timestamp": "2025-10-30T21:30:15Z"
  },
  {
    "title": "House Democrats Send Letter to Trump at ‘What Remains of 1600 Pennsylvania Ave’ Demanding Stop to ‘Reckless Vanity Project’",
    "description": "A group of sixty House Democrats led by Rep. Jamie Raskin (D-MD) sent a letter to President Donald Trump Thursday -- addressed to \"What Remains of 1600 Pennsylvania Ave.\"\nThe post House Democrats Send Letter to Trump at ‘What Remains of 1600 Pennsylvania Ave’…",
    "link": "https://www.mediaite.com/politics/trump/house-democrats-send-letter-to-trump-at-what-remains-of-1600-pennsylvania-ave-demanding-stop-to-reckless-vanity-project/",
    "timestamp": "2025-10-30T21:27:56Z"
  },
  {
    "title": "'It's a mistake': Trump under fire in Congress after nuclear 'gift' to adversaries",
    "description": "WASHINGTON — Democrats on the Hill bashed President Donald Trump's idea to perform underground tests of American nuclear weapons on Thursday, arguing that it would be a \"gift\" to foreign adversaries. On Wednesday, Trump posted on Truth Social that he wanted A…",
    "link": "https://www.rawstory.com/raw-investigates/trump-nuclear-2674251949/",
    "timestamp": "2025-10-30T21:27:03Z"
  },
  {
    "title": "Ukraine Looms Big over Trump-Xi Meeting as Chinese Dictator Offers to Buy U.S. Oil",
    "description": "President Donald Trump told reporters on Air Force One on Thursday that he and Chinese dictator Xi Jinping agreed to “work together” to end the war in Ukraine during their “amazing meeting” in South Korea.\nThe post Ukraine Looms Big over Trump-Xi Meeting as C…",
    "link": "https://www.breitbart.com/asia/2025/10/30/ukraine-looms-big-over-trump-xi-meeting-as-chinese-dictator-offers-to-buy-u-s-oil/",
    "timestamp": "2025-10-30T21:26:58Z"
  },
  {
    "title": "4 Republicans back Senate resolution to undo Trump's tariffs",
    "description": "The Senate has passed a resolution that would undo many of President Donald Trump’s tariffs around the globe. It's the latest note of displeasure at Trump's trade tactics in Washington. The resolution passed on a 51-47 vote, with four Republicans joining all …",
    "link": "https://apnews.com/article/congress-trump-tariffs-china-525d652549af2fbe2931fa57aeaa32e6",
    "timestamp": "2025-10-30T21:26:07Z"
  },
  {
    "title": "Influential Cuban dissident says his fight against government will continue off the island",
    "description": "José Daniel Ferrer, a key Cuban dissident leader, has been exiled from Cuba and urges the opposition to challenge the government from abroad",
    "link": "https://abcnews.go.com/International/wireStory/influential-cuban-dissident-fight-government-continue-off-island-127037026",
    "timestamp": "2025-10-30T21:25:56Z"
  },
  {
    "title": "Does Trump's nuclear testing raise the stakes - or are we already in an arms race?",
    "description": "Experts tell the BBC a US resumption of nuclear weapons testing would be a radical shift and spark a nuclear arms race.",
    "link": "https://www.bbc.com/news/articles/czxn00l00r6o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-30T21:25:16Z"
  },
  {
    "title": "DYdX planning US market entry by 2026: Report",
    "description": "DYdX President Eddie Zhang reportedly said the decentralized exchange would offer spot trading for cryptocurrencies as part of its move into the US later this year.",
    "link": "https://cointelegraph.com/news/dydx-planning-us-market-entry-by-2026-report",
    "timestamp": "2025-10-30T21:23:31Z"
  },
  {
    "title": "The Trump-Xi Meeting Left Many Things Unresolved",
    "description": "LIVE\nThe Trump-Xi Meeting Left Many Things Unresolved\nFollow the latest news from Washington, D.C\nLast Updated:\nOct. 30, 2025 at 1:22 PM ET\nKey Events\nPinned Post\nThe U.S.-China game of chicken is on pause for now after President Donald Trump and Chinese Xi J…",
    "link": "https://biztoc.com/x/0678b898350288a9",
    "timestamp": "2025-10-30T21:20:49Z"
  },
  {
    "title": "What we can — and can't — learn from next week's elections: From the Politics Desk",
    "description": "What we can and can't learn from next week's elections in Virginia, New Jersey and New York City.",
    "link": "https://www.nbcnews.com/politics/politics-news/2025-election-lessons-politics-desk-rcna240957",
    "timestamp": "2025-10-30T21:20:26Z"
  },
  {
    "title": "TPUSA table flipper arrested for alleged Trump threats ignored FBI warning about violent posts: affidavit",
    "description": "Teaching assistant charged with threatening Trump after FBI warned him about violent social media posts following viral campus incident at university, an affidavit says.",
    "link": "https://www.foxnews.com/us/tpusa-table-flipper-arrested-alleged-trump-threats-ignored-fbi-warning-about-violent-posts-affidavit",
    "timestamp": "2025-10-30T21:20:07Z"
  },
  {
    "title": "‘What Happens In Nevada’: Democrats Can’t Stop Ranting About Trump’s Nuclear Weapons Move While Shutdown Rages",
    "description": "As the government shutdown surges toward becoming the longest in U.S. history, Senate Democrats are condemning President Donald Trump’s Wednesday evening declaration that his administration will resume nuclear weapons testing. Trump posted on Truth Social on …",
    "link": "https://dailycaller.com/2025/10/30/democrats-trump-nuclear-testing-jacky-rosen-mark-kelly-richard-blumenthal/",
    "timestamp": "2025-10-30T21:19:47Z"
  },
  {
    "title": "James Comey Files Motion To Dismiss Charges Based On Ambiguity, Sloppiness",
    "description": "The former FBI director argued that questioning from Sen. Ted Cruz was ambiguous, and that he was truthful in his responses.",
    "link": "https://www.huffpost.com/entry/james-comey-files-motion-to-dismiss-charges-based-on-ambiguity-sloppiness_n_6903d378e4b0b48d8a1bc10e",
    "timestamp": "2025-10-30T21:18:12Z"
  },
  {
    "title": "Critics Slam Stephen Miller’s Wife For On-Air Threat To Have Anti-Israel Pundit Deported",
    "description": "Katie Miller on Wednesday threatened fellow \"Piers Morgan Uncensored\" guest Cenk Uygur, \"You better check your citizenship application.\"",
    "link": "https://www.huffpost.com/entry/katie-miller-cenk-uygur-antisemitism-accusations-citizenship-threat_n_69039f07e4b0b48d8a1b7794",
    "timestamp": "2025-10-30T21:18:06Z"
  },
  {
    "title": "Trump and Xi Reach a Trade Truce",
    "description": "Beijing appears to be the bigger winner, leveraging Washington’s reliance on China to lower steep U.S. duties.",
    "link": "http://foreignpolicy.com/2025/10/30/trump-xi-trade-framework-deal-truce-china-tariffs-rare-earths-soybeans/",
    "timestamp": "2025-10-30T21:17:22Z"
  },
  {
    "title": "Rep. Jasmine Crockett fact checked on CNN after repeating false Trump ballroom claim",
    "description": "The congresswoman repeated the debunked claim that President Trump’s top priority during the government shutdown is the $300 million White House ballroom.",
    "link": "https://nypost.com/2025/10/30/media/rep-jasmine-crockett-fact-checked-on-cnn-after-repeating-false-trump-ballroom-claim/",
    "timestamp": "2025-10-30T21:16:59Z"
  }
]