[
  {
    "title": "Princess Charlotte’s Curtsy Mistake Resurfaces After Camilla’s ‘Cold’ Gesture To Kate Goes Viral",
    "description": "“You can tell Charlotte doesn't even like her”",
    "link": "https://www.boredpanda.com/queen-camilla-princess-charlotte-curtsy-mistake-resurfaces-after-kate-middleton-incident-windsor/",
    "timestamp": "2025-09-22T19:26:30Z"
  },
  {
    "title": "Putin says Russia is willing to abide by nuclear arms deal with the U.S. for 1 year after it expires",
    "description": "Russian President Vladimir Putin on Monday emphasized the importance of maintaining the status quo to avoid a strategic arms race.",
    "link": "https://www.pbs.org/newshour/world/putin-says-russia-is-willing-to-abide-by-nuclear-arms-deal-with-the-u-s-for-1-year-after-it-expires",
    "timestamp": "2025-09-22T19:26:22Z"
  },
  {
    "title": "ROOKE: Trump And Elon’s Greeting Feels Like Way More Than A Handshake",
    "description": "Donald Trump and Elon Musk were pictured together for the first time since their fallout, signaling something bigger might be happening.",
    "link": "https://dailycaller.com/2025/09/22/rooke-trump-elon-handshake-2026-midterms-gop-charlie-kirk-memorial/",
    "timestamp": "2025-09-22T19:23:22Z"
  },
  {
    "title": "Miran Says Trump Never Asked to Pursue a Specific Policy",
    "description": "Federal Reserve Governor Stephen Miran says President Donald Trump has never asked him to set policy in a specific way ...",
    "link": "https://biztoc.com/x/6195dab04b6f2d3d",
    "timestamp": "2025-09-22T19:23:00Z"
  },
  {
    "title": "Only an Idiot Would Think We Need Anti-Abortion Democrats",
    "description": "It's beyond time to stop listening to Ezra Klein.",
    "link": "https://www.jezebel.com/only-an-idiot-would-think-we-need-anti-abortion-democrats",
    "timestamp": "2025-09-22T19:22:35Z"
  },
  {
    "title": "Trump’s H1-B visa price hike is good for Canada",
    "description": "Jonah Prousky is a freelance writer and PhD student at MIT\nOn Friday, U.S. President Donald Trump signed an executive action to attach a US$100,000 annual fee to H-1B visas. These three-year work visas are beloved by the tech industry. They were relatively ch…",
    "link": "https://biztoc.com/x/d52d55a51846024e",
    "timestamp": "2025-09-22T19:22:10Z"
  },
  {
    "title": "Feud Over: Trump And Musk Reunite \"For Charlie\" At Kirk Memorial",
    "description": "Feud Over: Trump And Musk Reunite \"For Charlie\" At Kirk Memorial\n \nElon Musk and President Donald Trump were spotted Sunday afternoon at State Farm Stadium in Glendale, Arizona, for Charlie Kirk's memorial service. It was their first public appearance togethe…",
    "link": "https://biztoc.com/x/7b30be6afe67d3a9",
    "timestamp": "2025-09-22T19:22:08Z"
  },
  {
    "title": "Judge Hands Trump Admin Bad News Over Offshore Wind Crackdown",
    "description": "A federal Reagan-appointed judge blocked the Trump administration's move to block a massive offshore wind farm off the coast of Rhode Island and Connecticut.",
    "link": "https://dailycaller.com/2025/09/22/judge-hands-trump-admin-bad-news-over-offshore-wind-crackdown/",
    "timestamp": "2025-09-22T19:22:02Z"
  },
  {
    "title": "CNN Anchor Confronts Jasmine Crockett On Rhetoric",
    "description": "CNN's Dana Bash confronted Democratic Texas Rep. Jasmine Crockett on Sunday with old clips of her attacking President Donald Trump.",
    "link": "https://dailycaller.com/2025/09/22/cnn-jasmine-crockett-trump-hitler-charlie-kirk/",
    "timestamp": "2025-09-22T19:21:56Z"
  },
  {
    "title": "Supreme Court will weigh expanding Trump’s power to shape agencies by overturning 90-year-old ruling",
    "description": "The justices have allowed the president to carry out some high-profile firings while lawsuits play out.",
    "link": "https://www.denverpost.com/2025/09/22/trump-ftc-arguments/",
    "timestamp": "2025-09-22T19:21:05Z"
  },
  {
    "title": "Supreme Court will weigh expanding Trump’s power to shape agencies by overturning 90-year-old ruling",
    "description": "The justices have allowed the president to carry out some high-profile firings while lawsuits play out.",
    "link": "https://www.bostonherald.com/2025/09/22/trump-ftc-arguments/",
    "timestamp": "2025-09-22T19:21:05Z"
  },
  {
    "title": "President Trump Joins Nation in Celebrating Charlie Kirk’s Enduring Legacy",
    "description": "President Trump Joins Nation in Celebrating Charlie Kirk’s Enduring Legacy The following is from the Trump team. Yesterday, President Donald J. Trump, Vice President JD Vance, and numerous Administration officials gathered with tens of thousands of American P…",
    "link": "https://joehoft.com/president-trump-joins-nation-in-celebrating-charlie-kirks-enduring-legacy/",
    "timestamp": "2025-09-22T19:20:15Z"
  },
  {
    "title": "DA in ABC station shooting eyes Jimmy Kimmel suspension, Trump book and Epstein note",
    "description": "The shooting at ABC's Sacramento affiliate occurred after the Disney subsidiary ABC suspended Jimmy Kimmel for comments about the killing of Charlie Kirk.",
    "link": "https://www.cnbc.com/2025/09/22/jimmy-kimmel-abc-sacramento-shooting-epstein-kirk.html",
    "timestamp": "2025-09-22T19:19:53Z"
  },
  {
    "title": "Health Secretary Robert F. Kennedy Jr. to make an announcement regarding cause of autism",
    "description": "A White House announcement about autism is expected Monday afternoon after President Donald Trump’s weekend comment that “I think we found an answer” to the developmental disorder.",
    "link": "https://www.winknews.com/news/national/president-trump-to-make-an-announcement-regarding-cause-of-autism/article_cf5f7a7b-03a1-40c6-808c-37b4558bd2e9.html",
    "timestamp": "2025-09-22T19:19:16Z"
  },
  {
    "title": "400 Celebs Protest Jimmy Kimmel Suspension — But Stop Short Of Disney Boycott",
    "description": "\"We know this moment is bigger than us and our industry,\" the letter coordinated by the ACLU read.",
    "link": "https://www.huffpost.com/entry/celebrities-letter-protest-jimmy-kimmel-suspension_n_68d17c7fe4b05ba1eeaabfa1",
    "timestamp": "2025-09-22T19:18:46Z"
  },
  {
    "title": "Supreme Court will consider expanding Trump’s firing power",
    "description": "The Supreme Court will consider expanding President Donald Trump’s power to shape independent agencies by overturning a nearly century-old decision limiting when presidents can fire board members. The high court agreed Monday to quickly hear arguments in a ca…",
    "link": "https://apnews.com/article/trump-fire-ftc-commissioner-supreme-court-2149d7c3802b3ddea6e157d3a0afd292",
    "timestamp": "2025-09-22T19:18:31Z"
  },
  {
    "title": "Charlie Kirk Made a Cameo in New Kanye West Documentary Before His Death",
    "description": "The new Kanye West documentary In Whose Name? features a surprising cameo from the late Charlie Kirk. In one scene of the movie, which was filmed over the course of six years, West, now 48, sits down with Kirk and conservative commentator Candace Owens for a …",
    "link": "https://www.usmagazine.com/celebrity-news/news/charlie-kirk-made-a-cameo-in-new-kanye-west-doc-before-his-death/#article",
    "timestamp": "2025-09-22T19:18:31Z"
  },
  {
    "title": "Supreme Court will weigh expanding Trump’s power to shape agencies by overturning 90-year-old ruling",
    "description": "The Supreme Court said Monday it will consider expanding President Donald Trump's power to shape independent agencies by overturning a nearly century-old...",
    "link": "https://www.yahoo.com/news/articles/supreme-court-weigh-expanding-trump-191830255.html",
    "timestamp": "2025-09-22T19:18:30Z"
  },
  {
    "title": "Nvidia to invest billions in OpenAI as AI race heats up",
    "description": "The company will also provide chips for OpenAI’s data centres.",
    "link": "https://www.aljazeera.com/economy/2025/9/22/nvidia-to-invest-billions-in-openai-as-ai-race-heats-up",
    "timestamp": "2025-09-22T19:18:21Z"
  },
  {
    "title": "Grindr users in Phoenix logged problems the day of Charlie Kirk’s memorial",
    "description": "Thousands gathered at State Farm Stadium in Glendale, Arizona, for a memorial service for Charlie Kirk on Sunday, Sept. 21. Many attendees wore \"I am Charlie Kirk\" shirts, MAGA hats, and carried American flags. \n\n\nThe event featured his widow, Erika Kirk, rec…",
    "link": "https://www.dailydot.com/viral-politics/charlie-kirk-memorial-grindr/",
    "timestamp": "2025-09-22T19:17:49Z"
  },
  {
    "title": "WH: Trump to Sign Order Labeling Antifa Terror Group",
    "description": "White House Press Secretary Karoline Leavitt said Monday that President Donald Trump intends to sign an executive order later that day to designate antifa as a domestic terrorist organization, citing a pattern of violent acts linked to the far-left movement. …",
    "link": "https://freerepublic.com/focus/f-news/4342078/posts",
    "timestamp": "2025-09-22T19:17:32Z"
  },
  {
    "title": "Trump to meet Zelensky on Sept. 23 in New York, White House confirms",
    "description": "U.S. President Donald Trump and President Volodymyr Zelensky are scheduled to meet face-to-face on Sept. 23 in New York, White House Press Secretary Karoline Leavitt announced during a press briefing. The meeting will take place on the sidelines of the 80th U…",
    "link": "https://freerepublic.com/focus/f-chat/4342077/posts",
    "timestamp": "2025-09-22T19:17:22Z"
  },
  {
    "title": "Tylenol-maker Kenvue’s stock has lost a quarter of its value in 6 months as momentum grows for autism link despite repeated denials",
    "description": "A pending announcement from the Trump administration linking pain relief drug acetaminophen with autism has stirred investor anxiety in the drug’s primary producer. The share price of Kenvue, the parent company of Tylenol, is down more than 5% on Monday follo…",
    "link": "https://biztoc.com/x/e99a4c8f2e3d8be0",
    "timestamp": "2025-09-22T19:11:06Z"
  },
  {
    "title": "Netflix boss, top Dem donor Reed Hastings praises Trump’s $100K fee for H1-B visas: ‘Great solution’",
    "description": "“I've worked on H1-B politics for 30 years. Trump's $100k per year tax is a great solution,” Hastings wrote in a post on X to his nearly 150,000 followers.",
    "link": "https://nypost.com/2025/09/22/business/netflix-boss-top-dem-donor-reed-hastings-praises-trumps-100k-fee-for-h1-b-visas-great-solution/",
    "timestamp": "2025-09-22T19:10:35Z"
  },
  {
    "title": "White House denies border tsar Tom Homan accepted $50,000 bribe",
    "description": "The White House says FBI agents under the last administration had tried to \"entrap\" Homan.",
    "link": "https://www.bbc.com/news/articles/cd637242e3go",
    "timestamp": "2025-09-22T19:10:23Z"
  },
  {
    "title": "Fox Biz reporter rips Trump’s TikTok deal as a “ticking time bomb”",
    "description": "Fox Business correspondent Charles Gasparino, usually a defender of Donald Trump’s deal-making, blasted the president’s TikTok agreement as a “ticking time bomb.” In a column, Gasparino argued that Trump’s proposed framework with China’s Xi Jinping shows none…",
    "link": "https://www.rawstory.com/tiktok-2674017843/",
    "timestamp": "2025-09-22T19:09:43Z"
  },
  {
    "title": "Safety of Tylenol in pregnancy still backed by Canadian medical groups",
    "description": "As the Trump administration is widely expected to make a disputed link between autism and the use of Tylenol in pregnancy, Canadian doctors say 'acetaminophen remains a safe and appropriate first-line option for managing fever and pain during pregnancy when m…",
    "link": "https://www.cbc.ca/news/health/autism-acetaminophen-pregnancy-1.7640063",
    "timestamp": "2025-09-22T19:09:36Z"
  },
  {
    "title": "Nvidia CEO Jensen Huang, OpenAI CEO Sam Altman support Trump's $100,000 H-1B visa fee increase",
    "description": "Nvidia CEO Jensen Huang and OpenAI CEO Sam Altman endorsed President Donald Trump's decision to raise H-1B visa fees to $100,000. The tech executives made their comments while announcing Nvidia's $100 billion investment in OpenAI for AI data center developmen…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nvidia-ceo-jensen-huang-openai-ceo-sam-altman-support-trumps-100000-h-1b-visa-fee-increase/articleshow/124056114.cms",
    "timestamp": "2025-09-22T19:09:08Z"
  },
  {
    "title": "Oracle to Create TikTok Algorithm in US ‘From the Ground Up’",
    "description": "Oracle is reportedly being tapped to recreate and secure the United States version of TikTok’s algorithm. The move is part of a deal that would see the Chinese-owned video-sharing platform sold to a group of U.S. investors, Bloomberg reported Monday (Sept. 22…",
    "link": "http://www.pymnts.com/mobile-applications/2025/oracle-create-tiktok-algorithm-united-states-from-the-ground-up/",
    "timestamp": "2025-09-22T19:08:53Z"
  },
  {
    "title": "Top stars call Jimmy Kimmel suspension 'dark moment' for free speech",
    "description": "Jennifer Aniston, Meryl Streep and Robert DeNiro are among more than 400 celebrities who signed a letter defending the comedian.",
    "link": "https://www.bbc.com/news/articles/c62le8q959yo",
    "timestamp": "2025-09-22T19:08:15Z"
  },
  {
    "title": "White House denies Homan received $50k from undercover FBI agents",
    "description": "The White House denied reports that border czar Tom Homan accepted $50,000 in cash last year from undercover FBI agents.",
    "link": "https://www.cnbc.com/2025/09/22/tom-homan-fbi-trump-cash-justice-department.html",
    "timestamp": "2025-09-22T19:07:34Z"
  },
  {
    "title": "White House says Tom Homan did ‘nothing wrong’ following reports he accepted a bag of cash | CNN Politics",
    "description": "White House press secretary Karoline Leavitt offered a forceful defense of border czar Tom Homan in the wake of reports that he accepted a bag of cash from undercover FBI agents, insisting on Monday that he “did absolutely nothing wrong.”",
    "link": "https://www.cnn.com/2025/09/22/politics/tom-homan-white-house-investigation-reports",
    "timestamp": "2025-09-22T19:07:09Z"
  },
  {
    "title": "Democrat Appears To Ignore Facts To Blame Trump For Rural Constituents Losing Health Services",
    "description": "Democratic Georgia Sen. Jon Ossoff’s claim that recent GOP Medicaid reforms are responsible for a rural Georgia hospital reducing services",
    "link": "https://ijr.com/democrat-appears-to-ignore-facts-to-blame-trump-for-rural-constituents-losing-health-services/",
    "timestamp": "2025-09-22T19:06:58Z"
  },
  {
    "title": "Man charged with shining laser pointer at Marine One with Trump aboard",
    "description": "The Secret Service has arrested a man on a charge that he shined a laser pointer at Marine One while President Donald Trump was aboard the helicopter",
    "link": "https://www.wftv.com/news/politics/man-charged-with/KR2EZT347NG3JMNCFMEXPGUERA/",
    "timestamp": "2025-09-22T19:06:53Z"
  },
  {
    "title": "Albanese and Trump meeting unlikely, White House suggests",
    "description": "The US president's itinerary for his 24-hour visit to New York makes no mention of Anthony Albanese, all but confirming a one-on-one will not be happening.",
    "link": "https://www.abc.net.au/news/2025-09-23/meeting-unlikely-between-albanese-and-trump/105804978",
    "timestamp": "2025-09-22T19:06:50Z"
  },
  {
    "title": "Trump's Fed appointee pushes for far lower interest rates",
    "description": "In his first major speech at the Economic Club of New York, Miran endorsed a benchmark interest rate that ranged between 2% and 2.5%",
    "link": "https://qz.com/miran-interest-rate-speech-fed-trump",
    "timestamp": "2025-09-22T19:04:47Z"
  },
  {
    "title": "Whoopi Goldberg and her 'The View' co-hosts finally broke their silence on Jimmy Kimmel's suspension",
    "description": "\"The View\" addressed \"Jimmy Kimmel Live!\" getting yanked by ABC after two episodes of noticeable silence. The two shows share a network.",
    "link": "https://www.businessinsider.com/the-view-jimmy-kimmel-suspension-reaction-free-speech-2025-9",
    "timestamp": "2025-09-22T19:02:50Z"
  },
  {
    "title": "'I'm Here Because of H-1B': Elon Musk's Past Defence of Visa System Resurfaces After Fee Hike",
    "description": "Amid a controversial new visa fee that has caused chaos in the tech industry, a past defence of the H-1B programme by Elon Musk has come to light.",
    "link": "https://www.ibtimes.com/im-here-because-h-1b-elon-musks-past-defence-visa-system-resurfaces-after-fee-hike-3784170",
    "timestamp": "2025-09-22T19:01:25Z"
  },
  {
    "title": "Oracle will manage TikTok's algorithm for US users under Trump administration deal",
    "description": "Oracle will manage TikTok's algorithm for US users under Trump administration deal6abc.com",
    "link": "https://6abc.com/post/oracle-will-manage-tiktoks-algorithm-us-users-trump-administration-deal/17866333/",
    "timestamp": "2025-09-22T19:01:14Z"
  },
  {
    "title": "Accused Trump Shooter Ryan Routh Plans To Convince Jury Of His \"Gentleness\" and \"Humanity\"",
    "description": "Man accused of planning to assissinate Trump plans to convince jury of his \"gentleness\" and \"humanity\" as part of his defense strategy.",
    "link": "https://www.ibtimes.com/accused-trump-shooter-ryan-routh-plans-convince-jury-his-gentleness-humanity-3784169",
    "timestamp": "2025-09-22T19:00:58Z"
  },
  {
    "title": "Dominican Republic Claims Boat Hit by U.S. Navy had Over a Ton of Cocaine",
    "description": "The Dominican Republic and U.S. Navy managed \"to recover 13 bales containing the 377 packages, wrapped in adhesive tape and with different logos.\"\nThe post Dominican Republic Claims Boat Hit by U.S. Navy had Over a Ton of Cocaine first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/09/dominican-republic-claims-boat-hit-by-u-s-navy-had-over-a-ton-of-cocaine/",
    "timestamp": "2025-09-22T19:00:53Z"
  },
  {
    "title": "'My boss made me do it': DOJ vets fear following Trump's orders will land them in court",
    "description": "NBC News reporter Ken Dilanian reported Monday that those left in the Justice Department have been worried about President Donald Trump's revenge campaign since the beginning. Now there's real panic as he calls on them to be more aggressive in investigating h…",
    "link": "https://www.rawstory.com/trump-revenge-retribution-doj-2674016667/",
    "timestamp": "2025-09-22T19:00:41Z"
  },
  {
    "title": "Teachers and Unions Fight Back as UC Campuses Prepare to Fuel Trump’s Witch Hunt",
    "description": "A coalition of University of California faculty, students, staff, and labor unions are suing the Trump administration.",
    "link": "https://truthout.org/articles/teachers-and-unions-fight-back-as-uc-campuses-prepare-to-fuel-trumps-witch-hunt/",
    "timestamp": "2025-09-22T19:00:20Z"
  },
  {
    "title": "Here's What Happened Today: Monday",
    "description": "Here’s your round-up of what made the headlines today.",
    "link": "https://www.thejournal.ie/news-fix-monday-2209-6823575-Sep2025/",
    "timestamp": "2025-09-22T19:00:08Z"
  },
  {
    "title": "How MAGA Mourned Charlie Kirk",
    "description": "From the daily newsletter: a report from the memorial in Arizona, where a martyr was being made.",
    "link": "https://www.newyorker.com/newsletter/the-daily/how-maga-mourned-charlie-kirk",
    "timestamp": "2025-09-22T19:00:00Z"
  },
  {
    "title": "Judge lifts Trump’s halt of nearly complete offshore wind energy project",
    "description": "A federal judge ruled Monday that a nearly complete offshore wind project halted by the administration can resume, dealing President Donald Trump a setback in his ongoing effort to restrict the U.S. offshore wind industry.",
    "link": "https://biztoc.com/x/56d9c87bc48c6f0e",
    "timestamp": "2025-09-22T18:59:27Z"
  },
  {
    "title": "Bruce Pearl is retiring from Auburn basketball. Is a Senate run in his future?",
    "description": "University of Auburn basketball coach Bruce Pearl's retirement announcement reignites speculation that he's eyeing a U.S. Senate seat in Alabama.",
    "link": "https://www.usatoday.com/story/sports/ncaaf/2025/09/22/auburn-coach-bruce-pearl-retires-senate-run-alabama/86296264007/",
    "timestamp": "2025-09-22T18:59:10Z"
  },
  {
    "title": "Tylenol-maker Kenvue’s stock has lost a quarter of its value in 6 months as momentum grows for autism link despite repeated denials",
    "description": "Kenvue rebuked claims of a connection between autism and acetaminophen and said it is “deeply concerned with the health risk this poses for expecting mothers.”",
    "link": "https://fortune.com/2025/09/22/tylenol-maker-kenvue-stock-trump-autism-link/",
    "timestamp": "2025-09-22T18:58:55Z"
  },
  {
    "title": "US envoy to UN vows to 'defend every inch of NATO territory'",
    "description": "Washington's new envoy to the United Nations vowed Monday to \"defend every inch of NATO territory\" as he addressed an emergency meeting over an incursion by Russian fighter jets into Estonia's air space.",
    "link": "https://www.hurriyetdailynews.com/us-envoy-to-un-vows-to-defend-every-inch-of-nato-territory-213896",
    "timestamp": "2025-09-22T18:58:07Z"
  },
  {
    "title": "WH blocks US Steel factory stop: Commerce Department intervened to reverse proposal to stop processing steel at Illinois plant",
    "description": "The White House said Monday that it intervened under the terms of a three-month-old national security agreement with Japan-based Nippon Steel to block a decision to stop processing raw steel at U.S. Steel's Granite City Works plant in Illinois.",
    "link": "https://www.bostonherald.com/2025/09/22/wh-blocks-us-steel-factory-stop-commerce-department-intervened-to-reverse-proposal-to-stop-processing-steel-at-illinois-plant/",
    "timestamp": "2025-09-22T18:57:31Z"
  },
  {
    "title": "Democrat Appears To Ignore Facts To Blame Trump For Rural Constituents Losing Health Services",
    "description": "Democratic Georgia Sen. Jon Ossoff’s claim that recent GOP Medicaid reforms are responsible for a rural Georgia hospital reducing services appears to ignore key facts. St. Mary’s Healthcare System announced on Sept. 11 that it would be discontinuing labor and…",
    "link": "https://dailycaller.com/2025/09/22/jon-ossoff-big-beautiful-bill-rural-hospital/",
    "timestamp": "2025-09-22T18:57:13Z"
  },
  {
    "title": "DOJ Charges Man for Aiming Laser Pointer at Marine One with Trump On Board",
    "description": "Jacob Winkler has been charged for aiming laser at Marine One with Trump aboard during a White House departure.",
    "link": "https://www.newsweek.com/donald-trump-marine-one-laser-doj-jacob-winkler-2133911",
    "timestamp": "2025-09-22T18:57:02Z"
  },
  {
    "title": "Donald Trump & Elon Musk: Reconciling After Charlie Kirk Memorial Despite Bitter Feud?",
    "description": "Reading Time: 3 minutesAre Donald Trump and Elon Musk back on good terms?\nDonald Trump & Elon Musk: Reconciling After Charlie Kirk Memorial Despite Bitter Feud? was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/donald-trump-elon-musk-reunion/",
    "timestamp": "2025-09-22T18:56:54Z"
  },
  {
    "title": "Rural health clinics are closing after Trump’s ‘One Big Beautiful Bill,’ raising the legislation’s political risks",
    "description": "Exactly two months after President Donald Trump signed his policy megabill in a July 4 celebration at the White House, a Virginia health care company blamed the law for the",
    "link": "https://www.wxow.com/news/national/rural-health-clinics-are-closing-after-trump-s-one-big-beautiful-bill-raising-the-legislation/article_cd941db3-1c99-5492-99ca-19d4ac84043f.html",
    "timestamp": "2025-09-22T18:55:20Z"
  },
  {
    "title": "Trump's Latest DOJ Saturday Night Massacre Still Ongoing, Probably Will Last Forever",
    "description": "In which Trump quit/fires his own appointee for not locking up Letitia James.",
    "link": "https://www.wonkette.com/p/trumps-latest-doj-saturday-night",
    "timestamp": "2025-09-22T18:55:18Z"
  },
  {
    "title": "3586 - Border Czar Bribes; Stripping Citizenship w/ Amanda Frost",
    "description": "It's Fun Day Monday on the Majority Report On today's show: The Trump administration is hinting at a link between Acetaminophen and autism. Border Czar Tom Homan was investigated for receiving $50,000 in cash back in 2024 for a promise of employment in the Tr…",
    "link": "https://majorityfm.libsyn.com/3586-border-czar-bribes-stripping-citizenship-w-amanda-frost",
    "timestamp": "2025-09-22T18:55:00Z"
  },
  {
    "title": "This Statistic Is An Alarm Bell For The Economy",
    "description": "Nearly 2 million Americans have been unemployed six months or longer.",
    "link": "https://www.huffpost.com/entry/long-term-unemployment-trump-interest-rates_n_68d19179e4b03c190c2181f3",
    "timestamp": "2025-09-22T18:54:06Z"
  },
  {
    "title": "Expert calls on Trump to agree to Putin’s New Start offer – RIA",
    "description": "Moscow’s decision to continue abiding by the New Start nuclear treaty could prevent a costly arms race, a US-based NGO head has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625081-expert-trump-agree-putin-start/",
    "timestamp": "2025-09-22T18:53:01Z"
  },
  {
    "title": "The View FINALLY Delves Into Jimmy Kimmel Controversy; What Took So Long?!?",
    "description": "Reading Time: 3 minutesThe View panelists have an opinion on Jimmy Kimmel getting yanked off the air by ABC. It just took them a little bit to express it.\nThe View FINALLY Delves Into Jimmy Kimmel Controversy; What Took So Long?!? was originally published on …",
    "link": "http://www.thehollywoodgossip.com/2025/09/the-view-finally-delves-into-jimmy-kimmel-controversy-what-took-so-long/",
    "timestamp": "2025-09-22T18:52:58Z"
  },
  {
    "title": "Fox’s Andy McCarthy Urges Congress to Investigate Tom Homan Bribery Scandal",
    "description": "Fox News contributor and conservative legal analyst Andy McCarthy urged Congress to investigate Trump Border Czar Tom Homan.\nThe post Fox’s Andy McCarthy Urges Congress to Investigate Tom Homan Bribery Scandal first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/foxs-andy-mccarthy-urges-congress-to-investigate-tom-homan-bribery-scandal/",
    "timestamp": "2025-09-22T18:52:39Z"
  },
  {
    "title": "Jimmy Kimmel suspension might have been factor in shooting at Sacramento ABC affiliate, DA says",
    "description": "The alleged gunman who opened fire on an ABC affiliate in Sacramento last week might have been motivated in part by that network's suspension of late-night host Jimmy Kimmel, authorities said Monday",
    "link": "https://www.nbcnews.com/news/us-news/jimmy-kimmel-suspension-might-factor-shooting-sacramento-abc-affiliate-rcna233010",
    "timestamp": "2025-09-22T18:52:12Z"
  },
  {
    "title": "No one’s laughing at Trump at the UN this year",
    "description": "The president will likely tout his peacemaking efforts, but much of the world sees him as a disruptor.",
    "link": "https://www.politico.com/news/2025/09/22/no-ones-laughing-at-trump-at-the-un-this-year-00574999",
    "timestamp": "2025-09-22T18:51:43Z"
  },
  {
    "title": "Judge lifts Trump’s halt of nearly complete offshore wind energy project",
    "description": "A federal judge ruled Monday that a nearly complete offshore wind project halted by the administration can resume, dealing President Donald Trump a setback in his ongoing effort to restrict the U.S. offshore wind industry.",
    "link": "https://www.pbs.org/newshour/nation/judge-lifts-trumps-halt-of-nearly-complete-offshore-wind-energy-project",
    "timestamp": "2025-09-22T18:51:38Z"
  },
  {
    "title": "Man charged with shining laser pointer at Marine One with Trump aboard",
    "description": "A man accused of shining a laser pointer at Marine One with President Donald Trump aboard the helicopter has been arrested on a federal criminal charge...",
    "link": "https://www.yahoo.com/news/articles/man-charged-shining-laser-pointer-185123234.html",
    "timestamp": "2025-09-22T18:51:23Z"
  },
  {
    "title": "New US Fed Governor Says Rates Should Be Around 'Mid-2%'",
    "description": "The US Fed governor newly appointed by President Donald Trump argued Monday for significantly lower interest rates, signaling that concerns over inflation may be overblown.",
    "link": "https://www.ibtimes.com/new-us-fed-governor-says-rates-should-around-mid-2-3784165",
    "timestamp": "2025-09-22T18:51:07Z"
  },
  {
    "title": "‘What Are You Doing?!’ CNN’s Enten Warns Democrats Are In Trouble Ahead of the Midterms",
    "description": "CNN's data guru Harry Enten warned Democrats on Monday that they're in definite trouble with American voters ahead of the  2026 midterms.\nThe post ‘What Are You Doing?!’ CNN’s Enten Warns Democrats Are In Trouble Ahead of the Midterms first appeared on Mediai…",
    "link": "https://www.mediaite.com/politics/what-are-you-doing-cnns-enten-warns-democrats-are-in-trouble-ahead-of-the-midterms/",
    "timestamp": "2025-09-22T18:49:03Z"
  },
  {
    "title": "Stephen A. Smith's Harsh 7 Words Won't Help Kamala Harris Sell Her Book",
    "description": "The ESPN \"First Take\" star just gutted the former Democratic nominee with a diss.",
    "link": "https://www.huffpost.com/entry/stephen-a-smith-kamala-harris-book_n_68d17cf7e4b05ba1eeaabff2",
    "timestamp": "2025-09-22T18:48:57Z"
  },
  {
    "title": "Data expert gives Disney startling lesson on the effect of bowing to Trump",
    "description": "A veteran data journalist is offering a lesson to those in positions of power about why they keep losing when they bow to President Donald Trump.Writing on Monday, G. Elliott Morris explained on his \"Strength in Numbers\" Substack that powerful people mistaken…",
    "link": "https://www.rawstory.com/abc-disney/",
    "timestamp": "2025-09-22T18:48:46Z"
  },
  {
    "title": "What does Trump designating antifa a terror organization let him do?",
    "description": "President Donald Trump’s crackdown on domestic dissent is accelerating following the assassination of Charlie Kirk. The president said on Thursday that he will designate antifa as a “major terrorist organization.” What does that mean, exactly?\nThe White House…",
    "link": "https://biztoc.com/x/c71f8d2670910aab",
    "timestamp": "2025-09-22T18:48:19Z"
  },
  {
    "title": "Mary Robinson: 'President Trump is the only one who can put real pressure on Netanyahu'",
    "description": "‘Frankly, I’m not sleeping as well at night, because it’s really hard to absorb,’ said the former president.",
    "link": "https://www.thejournal.ie/mary-robinson-trump-israel-6823850-Sep2025/",
    "timestamp": "2025-09-22T18:48:17Z"
  },
  {
    "title": "New US Fed governor says rates should be around ‘mid-2%’",
    "description": "The US Fed governor newly appointed by President Donald Trump argued Monday for significantly lower interest rates, signaling that concerns over inflation may be overblown. “I believe the appropriate Fed funds rate is in the mid-two percent area, almost two p…",
    "link": "https://www.digitaljournal.com/business/new-us-fed-governor-says-rates-should-be-around-mid-2/article",
    "timestamp": "2025-09-22T18:47:34Z"
  },
  {
    "title": "US mulls economic lifeline for ally Argentina",
    "description": "The US Treasury said Monday it stood ready to “do what is needed” to support Argentina’s economy, as President Javier Milei battles to calm jittery financial markets. Self-declared “anarcho-capitalist” Milei, a close ally of President Donald Trump, has been f…",
    "link": "https://www.digitaljournal.com/world/us-mulls-economic-lifeline-for-ally-argentina/article",
    "timestamp": "2025-09-22T18:47:34Z"
  },
  {
    "title": "US, UK joint task force to explore crypto regulatory collaboration",
    "description": "A US-UK joint task force, chaired by officials from the two countries' treasury departments, will report within 180 days on issues related to digital asset regulations.",
    "link": "https://cointelegraph.com/news/us-uk-digital-asset-task-force-regulation",
    "timestamp": "2025-09-22T18:47:30Z"
  },
  {
    "title": "Report: New proposal includes hostage release, US guarantees",
    "description": "A new proposal for a Gaza truce includes the release of Israeli hostages, US-backed guarantees for a two-month ceasefire, and humanitarian aid, but neither side has responded yet.",
    "link": "https://www.israelnationalnews.com/news/415347",
    "timestamp": "2025-09-22T18:47:14Z"
  },
  {
    "title": "How TikTok's deal to stay in the US will work, according to the White House",
    "description": "TikTok US is set to sell to an investor consortium that will retrain its algorithm and keep Americans connected to users in other parts of the world.",
    "link": "https://www.businessinsider.com/details-us-tiktok-sale-will-work-white-house-2025-9",
    "timestamp": "2025-09-22T18:46:01Z"
  },
  {
    "title": "Working-Class Americans Are Hurting—And Traditional Statistics Aren't Showing How Much",
    "description": "With the rising cost of groceries, housing, healthcare, and other essentials a central issue facing communities across the United States due to the Republican agenda, one expert believes that commonly cited economic statistics aren’t capturing the depth of wo…",
    "link": "https://www.commondreams.org/news/inflation-groceries-electricity-healthcare",
    "timestamp": "2025-09-22T18:45:40Z"
  },
  {
    "title": "US Treasury Department Considering ‘All Options’ to Stabilize Argentine Economy",
    "description": "Treasury Secretary Scott Bessent said Monday (Sept. 22) that the Treasury Department will do what it can to support Argentina and that, “All options for stabilization are on the table.” Argentina is struggling to overhaul its economy and has faced greater fin…",
    "link": "http://www.pymnts.com/news/international/2025/us-treasury-department-considering-all-options-to-stabilize-argentine-economy/",
    "timestamp": "2025-09-22T18:45:35Z"
  },
  {
    "title": "Maddow Blog | Team Trump’s handling of the Tom Homan bribery probe part of an indefensible pattern",
    "description": "As the federal investigation into White House border czar Tom Homan disappears, Team Trump's record on corruption allegations goes from awful to ridiculous.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trumps-handling-tom-homan-bribery-probe-part-indefensible-pattern-rcna232998",
    "timestamp": "2025-09-22T18:45:19Z"
  },
  {
    "title": "Trump says he will award Presidential Medal of Freedom to Ben Carson",
    "description": "President Donald Trump has announced he will award Ben Carson the Presidential Medal of Freedom.",
    "link": "https://www.wcvb.com/article/trump-ben-carson-presidential-medal-of-freedom/67982913",
    "timestamp": "2025-09-22T18:44:59Z"
  },
  {
    "title": "Trump aide takes over as US attorney in Virginia to replace prosecutor fired for not charging political opponent",
    "description": "Lindsey Halligan, a White House aide and a fierce ally of President Donald Trump, has taken over as the top federal prosecutor in Virginia’s eastern district, according to a person familiar with the change.",
    "link": "https://www.cnn.com/2025/09/22/politics/lindsey-halligan-us-attorney-eastern-virginia-trump-james-comey",
    "timestamp": "2025-09-22T18:44:00Z"
  },
  {
    "title": "Trump to sign executive order approving TikTok deal",
    "description": "'This is a problem that the Biden administration failed to solve, could not solve'",
    "link": "https://www.wnd.com/2025/09/trump-sign-executive-order-approving-tiktok-deal/",
    "timestamp": "2025-09-22T18:43:46Z"
  },
  {
    "title": "$100B trade volume between Türkiye, US 'our common goal': Erdoğan",
    "description": "The $100 billion trade volume target between Türkiye and the U.S. \"continues to be our common goal,\" said President Recep Tayyip Erdoğan on Sept 22.",
    "link": "https://www.hurriyetdailynews.com/-100b-trade-volume-between-turkiye-us-our-common-goal-erdogan-213895",
    "timestamp": "2025-09-22T18:39:00Z"
  },
  {
    "title": "EPA reorganization sparks fears of ‘political interference’",
    "description": "EPA reorganization sparks fears of ‘political interference’\n“Today is day one of the new EPA,” Administrator Lee Zeldin said. Union officials say the revamp is meant to intimidate scientists and undermine science.\nEPA Administrator Lee Zeldin listens as Presi…",
    "link": "https://biztoc.com/x/1a9d51fcfc86e021",
    "timestamp": "2025-09-22T18:37:31Z"
  },
  {
    "title": "Biggest Things That Happened at Riot Fest 2025 in Chicago",
    "description": "New albums, surprise reunions and John Stamos made for a memorable Riot Fest in Chicago this year. Continue reading…",
    "link": "https://loudwire.com/big-things-riot-fest-2025/",
    "timestamp": "2025-09-22T18:36:16Z"
  },
  {
    "title": "Karoline Leavitt Gives Trump’s Border Czar a $50,000 Pass",
    "description": "Did the White House just gift $50,000 in stolen bribes to President Donald Trump’s border czar Tom Homan?A reporter asked White House press secretary Karoline Leavitt Monday if Trump had asked the Department of Justice to close a bribery investigation into Ho…",
    "link": "https://newrepublic.com/post/200757/karoline-leavitt-donald-trump-border-czar-tom-homan",
    "timestamp": "2025-09-22T18:35:38Z"
  },
  {
    "title": "CNN Reporter Cut Off When Asking What Happens If Pam Bondi Can’t Indict Trump’s Enemies",
    "description": "White House Press Secretary Karoline Leavitt cut off a CNN report during a line of question about New York Attorney General Letitia James.\nThe post CNN Reporter Cut Off When Asking What Happens If Pam Bondi Can’t Indict Trump’s Enemies first appeared on Media…",
    "link": "https://www.mediaite.com/politics/cnn-reporter-cut-off-when-asking-what-happens-if-pam-bondi-cant-indict-trumps-enemies/",
    "timestamp": "2025-09-22T18:35:05Z"
  },
  {
    "title": "Syrian president says US Congress must act to cement sanctions removal",
    "description": "Syrian President Ahmad al-Sharaa said on Sept. 22 that the fall of the Bashar al-Assad regime has ushered in “a new historic phase for the region,” stressing that Syria today has “converging interests with the West and the United States.”",
    "link": "https://www.hurriyetdailynews.com/syrian-president-says-us-congress-must-act-to-cement-sanctions-removal-213894",
    "timestamp": "2025-09-22T18:33:57Z"
  },
  {
    "title": "Ted Cruz Likens FCC Chairman Brendan Carr to Mafia Boss After Jimmy Kimmel Canceled",
    "description": "Sen. Ted Cruz (R-TX) took to his podcast, Verdict with Ted Cruz, to attack Federal Communications Commission (FCC) Chairman Brendan Carr, accusing him of \"dangerous as hell\" mafia-like tactics that pushed for the removal of Jimmy Kimmel's show.\nThe post Ted C…",
    "link": "https://www.breitbart.com/politics/2025/09/22/ted-cruz-likens-fcc-chairman-brendan-carr-to-mafia-boss-after-jimmy-kimmel-canceled/",
    "timestamp": "2025-09-22T18:33:52Z"
  },
  {
    "title": "Irth Capital taps former US ambassador to Qatar as president and partner",
    "description": "A three-decade veteran in foreign policy and diplomacy, Davis served as the U.S. envoy to Qatar, which Washington considers a strong ally in the Gulf, from...",
    "link": "https://ca.finance.yahoo.com/news/irth-capital-taps-former-us-183256585.html",
    "timestamp": "2025-09-22T18:32:56Z"
  },
  {
    "title": "RFK Jr.’s promise to discover what causes autism within six months is fulfilled",
    "description": "While on Air Force One, in remarks captured on video by AP, Trump said: “But you think if you think of it, let’s say 15 years ago and 1 in 10,000 that were born with autism and now it’s making it 1 in 12, 1 in 10 boys, one in 10 or 12, two different […]\nThe p…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/rfk-jr-s-promise-to-discover-what-causes-autism-within-six-months-is-fulfilled",
    "timestamp": "2025-09-22T18:32:54Z"
  },
  {
    "title": "‘Totally unacceptable’: India rages over Trump’s $100,000 fee on H-1B visas",
    "description": "Government official demands protections for his country's 'tech population and skilled workers'",
    "link": "https://www.wnd.com/2025/09/totally-unacceptable-india-rages-trumps-100000-fee-h/",
    "timestamp": "2025-09-22T18:32:43Z"
  },
  {
    "title": "Trump's Platinum Card Gives Tax Break on Non-US Income to Foreigners",
    "description": "The Trump administration has announced two new visas, including the Gold Card program, for foreigners.",
    "link": "https://www.newsweek.com/trump-platinum-card-gold-card-2133682",
    "timestamp": "2025-09-22T18:32:36Z"
  },
  {
    "title": "Trump tells Charlie Kirk memorial: ‘I hate my opponents, don’t want best for them’",
    "description": "At Charlie Kirk’s memorial service in Glendale, Arizona, President Donald Trump praised the slain conservative activist for uniting the MAGA movement and for his approach to debate—but also drew a sharp contrast between them. Trump told mourners he disagreed …",
    "link": "https://www.rawstory.com/trump-tells-charlie-kirk-memorial-i-hate-my-opponents-dont-want-best-for-them/",
    "timestamp": "2025-09-22T18:31:49Z"
  }
]