[
  {
    "title": "Britain’s defenses too reliant on Trump’s America, MPs warn",
    "description": "The cross-party Defence Committee says Europe will be \"left vulnerable\" if the U.S. backs away.",
    "link": "https://www.politico.eu/article/britain-defense-too-reliant-donald-trump-america-mps-warn/",
    "timestamp": "2025-11-19T10:50:46Z"
  },
  {
    "title": "Fox News Favored Over BBC News By Much Of British Public, Says UK Culture Minister",
    "description": "Much of the British public would “rather have Fox News on BBC One than BBC News,” according to the new UK minister responsible for TV and film. Ian Murray delivered the doom-laden proclamation at the British Screen Forum (BSF) as his governing Labour party fa…",
    "link": "http://deadline.com/2025/11/fox-news-favored-bbc-news-british-public-ian-murray-1236622310/",
    "timestamp": "2025-11-19T10:49:33Z"
  },
  {
    "title": "South Africa's U.S.-Boycotted G20 Summit to Begin with 'DEI and Climate Change' Themes",
    "description": "The government of South Africa will host for the first time the G20 Summit over the weekend with the United States, the group's most powerful member, notably absent.\nThe post South Africa’s U.S.-Boycotted G20 Summit to Begin with ‘DEI and Climate Change’ Them…",
    "link": "https://www.breitbart.com/africa/2025/11/19/south-africas-u-s-boycotted-g20-summit-to-begin-with-dei-and-climate-change-themes/",
    "timestamp": "2025-11-19T10:47:24Z"
  },
  {
    "title": "I Went to See the Future of the Democratic Party. I Found Something Far More Entertaining.",
    "description": "The Pod Save America bros’ convention started with a message of Democratic unity. Then things got messy.",
    "link": "https://slate.com/news-and-politics/2025/11/pod-save-america-democratic-party-future.html",
    "timestamp": "2025-11-19T10:45:00Z"
  },
  {
    "title": "A TV Hail Mary: How the Epstein PSA Aired on Monday Night Football",
    "description": "The Epstein PSA achieved the nearly impossible task of getting in the game with around a day's notice.",
    "link": "https://www.adweek.com/convergent-tv/monday-night-football-epstein-survivors-psa-ad/",
    "timestamp": "2025-11-19T10:37:17Z"
  },
  {
    "title": "Tuggar, ex-Canadian lawmaker clash over Nigerian Christian genocide allegations",
    "description": "Nigeria’s Foreign Minister, Yusuf Tuggar, clashes with a former Canadian lawmaker on Piers Morgan’s show, fiercely denying claims of Christian genocide in\n Read More",
    "link": "https://punchng.com/tuggar-ex-canadian-lawmaker-clash-over-nigerian-christian-genocide-allegations/",
    "timestamp": "2025-11-19T10:36:56Z"
  },
  {
    "title": "How CEOs can stay clear-eyed during the stock market’s AI selloff",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/11/19/ai-stocks-market-selloff-ceos-stay-clear-eyed/",
    "timestamp": "2025-11-19T10:36:10Z"
  },
  {
    "title": "Epstein files: Who is Clay Higgins, US congressman who voted no on release?",
    "description": "The House approved the measure by an overwhelming margin of 427, including 216 Republicans, with only one dissent vote.",
    "link": "https://www.aljazeera.com/news/2025/11/19/epstein-files-who-is-clay-higgins-us-congressman-who-voted-no-on-release",
    "timestamp": "2025-11-19T10:35:45Z"
  },
  {
    "title": "From a celebrity engagement to a trip to space: The Beano review of 2025",
    "description": "Beanofy Unwrapped is a special eight-page pull-out in this week’s Beano",
    "link": "https://www.the-independent.com/arts-entertainment/books/news/beano-review-2025-comic-trump-taylor-swift-b2868076.html",
    "timestamp": "2025-11-19T10:35:37Z"
  },
  {
    "title": "Does the Jeff Bezos and Lauren Sánchez Met Gala sponsorship spell doom for fashion’s biggest night?",
    "description": "As the Amazon billionaire and his wife are announced as the financial backers for the biggest event on the A-list social calendar, Ellie Muir looks into what their involvement means for the institution and the couple's inroads into cultural domination",
    "link": "https://www.the-independent.com/life-style/bezos-met-gala-2026-theme-jeff-lauren-sanchez-sponsor-b2867896.html",
    "timestamp": "2025-11-19T10:35:03Z"
  },
  {
    "title": "EU to present tariff exemption wishlist to top Trump envoys",
    "description": "Brussels will put forward request to U.S. officials to exempt goods like medical devices and alcohol from President Donald Trump’s tariffs.",
    "link": "https://www.politico.eu/article/eu-to-present-tariff-exemption-wishlist-to-top-trump-envoys/",
    "timestamp": "2025-11-19T10:31:59Z"
  },
  {
    "title": "Rupee settles with 2 paise gain at 88.58 against US dollar",
    "description": "Forex traders said a strong American currency and outflow of foreign capital prevented a sharp gain in the rupee even as investors were concerned about the progress on the proposed India-US trade deal.",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-settles-with-2-paise-gain-at-8858-against-us-dollar/article70298471.ece",
    "timestamp": "2025-11-19T10:31:34Z"
  },
  {
    "title": "Tesla Diner Chef and Co-Operator Quits to Open a Jewish Deli",
    "description": "Chef Eric Greenspan says the project requires \"sharpness of focus and attention.\"",
    "link": "https://gizmodo.com/tesla-diner-chef-and-co-operator-quits-to-open-a-jewish-deli-2000687365",
    "timestamp": "2025-11-19T10:30:00Z"
  },
  {
    "title": "All you need to know about 2026 World Cup",
    "description": "England and Scotland have secured their place at the 2026 World Cup and this is all you need to know about next summer's tournament.",
    "link": "https://www.bbc.com/sport/football/articles/clyd77mz8z1o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-11-19T10:26:18Z"
  },
  {
    "title": "US and UK revolt forces Basel to rethink brutal crypto capital rules for banks",
    "description": "Basel’s toughest crypto rules are under review as the US, UK, and the EU diverge, with booming stablecoin adoption forcing a rethink of 1,250% capital charges, the group’s chair told the FT.",
    "link": "https://cointelegraph.com/news/basel-crypto-rules-rethink-stablecoin-growth-global-banks",
    "timestamp": "2025-11-19T10:16:14Z"
  },
  {
    "title": "Comey seeks to have indictment dismissed due to vindictive prosecution",
    "description": "Lawyers for former FBI Director James Comey are expected to argue before a judge Wednesday that his case should be dismissed on the grounds of vindictive prosecution.",
    "link": "https://abcnews.go.com/US/comey-seeks-indictment-dismissed-due-vindictive-prosecution/story?id=127643726",
    "timestamp": "2025-11-19T10:13:16Z"
  },
  {
    "title": "Is This the End of the MAGA Movement? Newsweek Contributors Debate",
    "description": "Are we witnessing the end of the MAGA movement by President Donald Trump loyalists due to issues like the release of the Jeffrey Epstein files, Trump's treatment of Representative Marjorie Taylor Greene and higher costs of living in favor of an \"America First…",
    "link": "https://biztoc.com/x/7d7193faeb112149",
    "timestamp": "2025-11-19T10:11:41Z"
  },
  {
    "title": "Elon Musk Makes A Very Public Return To Trump’s Fold",
    "description": "The tech executive attended a White House dinner Tuesday in a sign of a detente.",
    "link": "https://www.huffpost.com/entry/elon-musk-trump-white-house-dinner_n_691d57a1e4b06f2a60ca89d1",
    "timestamp": "2025-11-19T10:11:24Z"
  },
  {
    "title": "Senate expected to send Epstein files bill to Trump",
    "description": "The Senate is expected to receive the House-passed version of the Jeffrey Epstein files and pass it along to President Donald Trump Wednesday morning.",
    "link": "https://abcnews.go.com/Politics/senate-expected-send-epstein-files-bill-trump/story?id=127652257",
    "timestamp": "2025-11-19T10:10:26Z"
  },
  {
    "title": "Fox News Host Delivers Harsh Truth On How Much Trump Economic Plan ‘Sucks'",
    "description": "\"Here’s the reality...\" said \"The Five\" co-host Harold Ford Jr.",
    "link": "https://www.huffpost.com/entry/fox-news-host-donald-trump-reality_n_691d8429e4b0b763ab8cb42d",
    "timestamp": "2025-11-19T10:09:38Z"
  },
  {
    "title": "Which teams are in the FIFA World Cup 2026, and who can still qualify?",
    "description": "Al Jazeera’s breakdown of the qualified teams, playoffs and shock omissions from the FIFA World Cup in North America.",
    "link": "https://www.aljazeera.com/sports/2025/11/19/which-teams-are-in-the-fifa-world-cup-2026-and-who-can-still-qualify",
    "timestamp": "2025-11-19T10:07:28Z"
  },
  {
    "title": "Gaza: After Security Council breakthrough, agencies highlight youngsters' plight",
    "description": "As UN Secretary-General António Guterres hailed Monday's Security Council resolution paving the way for a consolidated ceasefire via a temporary International Stabilization Force in Gaza, UN aid teams warned that many Palestinian children in the enclave are i…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251118-unnews02.htm",
    "timestamp": "2025-11-19T10:06:21Z"
  },
  {
    "title": "Trump says it would be 'OK' to launch strikes in Mexico against drug cartels",
    "description": "US President Donald Trump has suggested the possibility of initiating military strikes in Mexico, marking what would be a significant escalation in his administration's purported efforts to combat drug cartels.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251118-presstv07.htm",
    "timestamp": "2025-11-19T10:05:28Z"
  },
  {
    "title": "Israel asks ICC to dismiss genocide case prosecutor, revoke arrest warrants",
    "description": "Israel has formally appealed to the International Criminal Court (ICC), demanding the removal of the chief prosecutor from the Gaza genocide case, and the nullification of arrest warrants issued for Israeli prime minister Benjamin Netanyahu and former ministe…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251118-presstv05.htm",
    "timestamp": "2025-11-19T10:04:52Z"
  },
  {
    "title": "The G20 Summit and the unravelling of US–South Africa relations",
    "description": "From refugee visas and ambassador expulsions to tariffs and trade wars, 2025 has seen more than its fair share of political turbulence between Washington and Pretoria. This will culminate in the predicted absence of the US from the G20 in South Africa. Scott …",
    "link": "https://blogs.lse.ac.uk/africaatlse/2025/11/19/the-g20-summit-and-the-unravelling-of-us-south-africa-relations/",
    "timestamp": "2025-11-19T10:03:10Z"
  },
  {
    "title": "Trump 'Not Ruling Out' Putting US Boots on the Ground in Venezuela",
    "description": "US President Donald Trump said on Monday that he is not ruling out putting US troops on the ground in Venezuela as tensions between the countries continue to escalate.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251118-sputnik05.htm",
    "timestamp": "2025-11-19T10:01:12Z"
  },
  {
    "title": "Trump: 'Would I Launch Strikes on Mexico to Stop Drugs? It's Okay With Me'",
    "description": "US President Donald Trump said on Monday that he would be \"okay\" with launching strikes on Mexico to stop drugs from coming into the United States.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251118-sputnik04.htm",
    "timestamp": "2025-11-19T10:01:05Z"
  },
  {
    "title": "Trump: 'I Would Be Proud' to 'Knock Out Cocaine Factories' in Colombia",
    "description": "US President Donald Trump said on Monday that he would be \"proud\" to strike what he called \"cocaine factories\" in Colombia.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251118-sputnik03.htm",
    "timestamp": "2025-11-19T10:00:56Z"
  },
  {
    "title": "Antifa violence exposes UC Berkeley’s hypocrisy on free speech and tolerance",
    "description": "DOJ opens civil rights investigation into Antifa violence at UC Berkeley after mob attacked Turning Point USA event, leaving attendees injured and property damaged.",
    "link": "https://www.foxnews.com/opinion/antifa-violence-exposes-uc-berkeleys-hypocrisy-free-speech-tolerance",
    "timestamp": "2025-11-19T10:00:53Z"
  },
  {
    "title": "The Day Republicans Beat Trump",
    "description": "Ben Jacobs reports that for years Donald Trump dominated his party, even celebrating when Republicans who opposed him lost. On Tuesday, it was Republicans who beat him over the Epstein files.",
    "link": "http://nymag.com/intelligencer/article/republicans-beat-trump-on-the-epstein-files.html",
    "timestamp": "2025-11-19T10:00:42Z"
  },
  {
    "title": "Crypto Traders See Bullish Tailwind: Hassett Jumps In Fed Chair Odds",
    "description": "Donald Trump has pushed the Federal Reserve back into the center of the crypto macro narrative, telling reporters he “already” knows who should succeed Jerome Powell and triggering a sharp repricing in real-money prediction markets in favor of Kevin Hassett. …",
    "link": "http://www.newsbtc.com/news/crypto-bullish-tailwind-hassett-fed-chair-odds/",
    "timestamp": "2025-11-19T10:00:32Z"
  },
  {
    "title": "Biden’s green energy fiasco, not Trump's reforms, is jacking up your electric bill",
    "description": "California has the nation's second-highest electricity prices after 127% increases since 2010, despite Governor Gavin Newsom's claims about clean energy success.",
    "link": "https://www.foxnews.com/opinion/bidens-green-energy-fiasco-not-trumps-reforms-jacking-up-your-electric-bill",
    "timestamp": "2025-11-19T10:00:27Z"
  },
  {
    "title": "Poll: Voters favor Democrats by double digits if midterms were today",
    "description": "Independent voters in the latest PBS News/NPR/Marist poll said they would select a Democrat over a Republican by a 2-to-1 margin.",
    "link": "https://www.pbs.org/newshour/politics/poll-voters-favor-democrats-by-double-digits-if-midterms-were-today",
    "timestamp": "2025-11-19T10:00:17Z"
  },
  {
    "title": "U.S. crypto bill back on track! – Senate vote expected ‘early next year’",
    "description": "Will the new timeline help advance the crypto market structure bill to the finish line?",
    "link": "https://ambcrypto.com/u-s-crypto-bill-back-on-track-senate-vote-expected-early-next-year/",
    "timestamp": "2025-11-19T10:00:03Z"
  },
  {
    "title": "Why Trump’s White Refugee Gambit Could Backfire",
    "description": "The president is shutting the door to millions seeking refugee status—but reportedly seeking preferences for white South Africans, English speakers, and Europeans who oppose migration. He may be in for a surprise.  \nThe post Why Trump’s White Refugee Gambit C…",
    "link": "http://washingtonmonthly.com/2025/11/19/trump-white-refugee-gambit-will-backfire/",
    "timestamp": "2025-11-19T10:00:00Z"
  },
  {
    "title": "DHS official justifies immigration enforcement with St. Augustine’s ‘City of God’",
    "description": "A man seeking asylum from Colombia is detained by federal agents as he attends his court hearing in immigration court at the Jacob K. Javitz Federal Building on Oct. 27, 2025, in New York City. / Credit: Michael M. Santiago/Getty Images\n\nWashington, D.C. News…",
    "link": "https://www.catholicnewsagency.com/news/267915/top-dhs-official-justifies-immigration-enforcement-with-st-augustine-s-city-of-god",
    "timestamp": "2025-11-19T10:00:00Z"
  },
  {
    "title": "Trump’s Anti-Green Agenda Could Lead to 1.3 Million More Climate Deaths. The Poorest Countries Will Be Impacted Most.",
    "description": "Most of the people expected to suffer these temperature-related deaths live in poor countries in Africa and South Asia that are least prepared to cope with the increasing heat from climate change.",
    "link": "http://www.propublica.org/article/trump-climate-rollbacks-heat-deaths",
    "timestamp": "2025-11-19T10:00:00Z"
  },
  {
    "title": "A Small Texas Think Tank Cultivated Covid Dissidents. Now They’re Running US Health Policy.",
    "description": "Fueled by covid backlash, a libertarian author created the Brownstone Institute in 2021. In recent months, people with ties to the group have catapulted to the highest levels of U.S. government, exercising significant authority over access to vaccines and sci…",
    "link": "https://kffhealthnews.org/news/article/brownstone-institute-vaccines-acip-cdc-jeffrey-tucker-bhattacharya-kulldorff/",
    "timestamp": "2025-11-19T10:00:00Z"
  },
  {
    "title": "DHS official justifies immigration enforcement, cites St. Augustine’s ‘City of God’",
    "description": "A man seeking asylum from Colombia is detained by federal agents as he attends his court hearing in immigration court at the Jacob K. Javitz Federal Building on Oct. 27, 2025, in New York City. / Credit: Michael M. Santiago/Getty Images\n\nWashington, D.C. News…",
    "link": "https://www.catholicnewsagency.com/news/267915/dhs-official-justifies-immigration-enforcement-cites-st-augustines-city-of-god",
    "timestamp": "2025-11-19T10:00:00Z"
  },
  {
    "title": "The Trump Administration Is Quietly Preparing to Bring Back School Segregation",
    "description": "It starts with vouchers and the destruction of the Office for Civil Rights.\nThe post The Trump Administration Is Quietly Preparing to Bring Back School Segregation appeared first on The American Prospect.",
    "link": "http://prospect.org/2025/11/19/trump-administration-quietly-preparing-to-bring-back-school-segregation/",
    "timestamp": "2025-11-19T10:00:00Z"
  },
  {
    "title": "What Does Lina Khan’s Trust-Busting Mean for New York City?",
    "description": "Katrina vanden Heuvel\n\n\n\nUnder-scrutinized monopolies—like the fire truck oligopoly—hinder municipal functions.\r\n\n\r\n\n\nThe post What Does Lina Khan’s Trust-Busting Mean for New York City? appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=577707",
    "timestamp": "2025-11-19T10:00:00Z"
  },
  {
    "title": "'Despicable': Critics Rip Trump Over 'Beyond Sickening' Oval Office Moment",
    "description": "The president had a shocking response to a question about a murdered journalist.",
    "link": "https://www.huffpost.com/entry/trump-khashoggi-critics_n_691d83fce4b06f2a60caa0ad",
    "timestamp": "2025-11-19T09:57:57Z"
  },
  {
    "title": "Trump defends Saudi crown prince over Khashoggi's murder; suggests victim deserved the fate",
    "description": "US President Donald Trump has touched off renewed criticism after downplaying the 2018 murder of renowned and outspoken Saudi journalist Jamal Khashoggi while hosting the kingdom's Crown Prince Mohammed bin Salman in the Oval Office.",
    "link": "https://www.globalsecurity.org/wmd/library/news/saudi/2025/saudi-251118-presstv02.htm",
    "timestamp": "2025-11-19T09:55:58Z"
  },
  {
    "title": "Senators warn Trump-linked crypto firm may pose national security threat",
    "description": "Democratic senators are urging a probe into WLFI over alleged token sales to North Korea- and Russia-linked wallets, while researchers say some claims stem from false positives.",
    "link": "https://cointelegraph.com/news/senators-trump-linked-wlfi-national-security-threat",
    "timestamp": "2025-11-19T09:54:30Z"
  },
  {
    "title": "US sells $700m NASAMS missile system to Taiwan",
    "description": "The Pentagon approves NASAMS deal as the US reiterates its 'rock-solid' commitment to Taipei's security.",
    "link": "https://www.aljazeera.com/news/2025/11/19/us-sells-700m-nasams-missile-system-to-taiwan",
    "timestamp": "2025-11-19T09:54:06Z"
  },
  {
    "title": "The Paris Agreement is working. Just ask Big Oil",
    "description": "The louder the lobbying, the clearer the fear. Ten years on, the Paris Agreement has reshaped energy politics, and the pushback from the fossil fuel sector is real. In the decade since the historic Paris climate accord was signed, fossil fuel companies have b…",
    "link": "https://www.dw.com/en/whos-afraid-of-the-big-bad-paris-agreement-the-fossil-fuel-industry/a-74569315",
    "timestamp": "2025-11-19T09:53:00Z"
  },
  {
    "title": "Jimmy Kimmel Details Donald Trump’s Ongoing Meltdown Over the Epstein Files",
    "description": "Jimmy Kimmel described Donald Trump's ongoing meltdown over the release of the Jeffrey Epstein files on 'Jimmy Kimmel Live.'",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jimmy-kimmel-donald-trump-epstein-files-meltdown-1235467842/",
    "timestamp": "2025-11-19T09:51:29Z"
  },
  {
    "title": "Trump Says Iran Wants Nuclear Deal 'Badly'",
    "description": "President Donald Trump has signaled a possible reopening of U.S.-Iran diplomacy, saying that Tehran wants to make a deal \"very badly” and adding: “I am totally open to it.\"\nSpeaking Tuesday at the White House alongside Saudi Crown Prince Mohammed bin Salman, …",
    "link": "https://biztoc.com/x/276093ddd2416897",
    "timestamp": "2025-11-19T09:48:38Z"
  },
  {
    "title": "Obsessed with gold: A $12M toilet and Trump's Oval Office",
    "description": "While Donald Trump seems to have a special obsession with gold, he certainly isn't the first. A look at gold's timeless value and symbolic power, and how it can sometimes just be a little too much.",
    "link": "https://www.dw.com/en/obsessed-with-gold-a-12m-toilet-and-trumps-oval-office/a-74723261",
    "timestamp": "2025-11-19T09:43:00Z"
  },
  {
    "title": "Iran releases Marshall Islands-flagged tanker and crew",
    "description": "Iran has released a Marshall Islands-flagged tanker with all 21 crew members aboard",
    "link": "https://abcnews.go.com/International/wireStory/iran-releases-marshall-islands-flagged-tanker-crew-127658882",
    "timestamp": "2025-11-19T09:41:20Z"
  },
  {
    "title": "Donald Trump Warns China Will Easily 'Catch Us' In AI Race If Washington Doesn't Stop State-By-State Regulation: 'We Must Have…'",
    "description": "On Tuesday, President Donald Trump warned that China could \"easily catch\" the U.S. in the global artificial intelligence race unless the country adopts a unified federal approach to AI regulation.\nTrump Calls For Single Federal AI Standard\nIn a post on Truth …",
    "link": "https://biztoc.com/x/f6990c5f054f4ff8",
    "timestamp": "2025-11-19T09:37:38Z"
  },
  {
    "title": "Can Mamdani supercharge New York’s clean energy revolution?",
    "description": "New York mayor-elect Zohran Mamdani promised power to the people. Clean energy advocates want him to take that literally.",
    "link": "https://grist.org/energy/can-mamdani-supercharge-new-yorks-clean-energy-revolution/",
    "timestamp": "2025-11-19T09:30:00Z"
  },
  {
    "title": "Cooperation not threats: Nigeria wants US alliance to curb violent attacks",
    "description": "Refuting US claims of 'Christian genocide', Nigeria's information minister says Abuja seeks stronger US security ties.",
    "link": "https://www.aljazeera.com/features/2025/11/19/cooperation-not-threats-nigeria-wants-us-alliance-to-curb-violent-attacks",
    "timestamp": "2025-11-19T09:19:48Z"
  },
  {
    "title": "Trump says Saudi prince 'knew nothing' about journalist's murder, despite evidence to the contrary",
    "description": "Elon Musk and Cristiano Ronaldo, who plays in Saudi Arabia, were among the guests at the lavish dinner honouring the Saudi royal.",
    "link": "https://www.thejournal.ie/trump-says-saudi-prince-knew-nothing-about-journalists-murder-6879255-Nov2025/",
    "timestamp": "2025-11-19T09:12:01Z"
  },
  {
    "title": "What to know about the F-35 fighter jet that Trump is selling to Saudi Arabia",
    "description": "President Donald Trump says he has agreed to sell the nation's most advanced fighter jet to Saudi Arabia despite concerns that China could gain access to the plane's vaunted American technology.",
    "link": "https://www.npr.org/2025/11/19/g-s1-98354/the-f-35-fighter-jet-trump-selling-saudi-arabia",
    "timestamp": "2025-11-19T09:11:42Z"
  },
  {
    "title": "Top of the BoP and Other Trump Fantasies From the Battlefields of Ukraine and Gaza to the Shores of Pakistan and Venezuela – This Is How The US Is Retreating",
    "description": "As Helmer said by e-mail, \"The Trump formula is retreat=negotiations plus covert operations.\"",
    "link": "https://www.nakedcapitalism.com/2025/11/top-of-the-bop-and-other-trump-fantasies-from-the-battlefields-of-ukraine-and-gaza-to-the-shores-of-pakistan-and-venezuela-this-is-how-the-us-is-retreating.html",
    "timestamp": "2025-11-19T09:05:33Z"
  },
  {
    "title": "Will Donald Trump Veto Epstein Files Bill? Mike Johnson Raises Possibility",
    "description": "House Speaker Mike Johnson has raised the possibility that President Donald Trump could veto a bill requiring the Justice Department to release of files on the convicted sex offender Jeffrey Epstein.\nThe Epstein Files Transparency Act will head to Trump's des…",
    "link": "https://biztoc.com/x/c52e1d472ed09578",
    "timestamp": "2025-11-19T09:04:03Z"
  },
  {
    "title": "Trump’s Warm Welcome Gives Saudi Prince ‘Lopsided’ Rewards",
    "description": "US President Donald Trump gave Saudi Arabia’s crown prince a lavish reception in Washington, offering a defense agreement that includes cutting-edge warplanes and absolving him of the murder of a newspaper columnist in 2018.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-warm-welcome-gives-saudi-prince-lopsided-rewards",
    "timestamp": "2025-11-19T09:03:23Z"
  },
  {
    "title": "Sharp disagreements over economy threaten Federal Reserve interest rate cut",
    "description": "What was once seen as a near-certain cut in interest rates next month now looks more like a coin flip as Federal Reserve officials sharply disagree over the economy’s health and whether stubborn inflation or weak hiring represent a bigger threat",
    "link": "https://www.wsbtv.com/news/business/sharp-disagreements/H6TDZFTJJ4YLFFA4JJC7QBSAO4/",
    "timestamp": "2025-11-19T09:01:25Z"
  },
  {
    "title": "How Trump could still keep Epstein files secret, despite House and Senate votes",
    "description": "Despite an overwhelming vote in the U.S. House of Representatives to pass the Epstein Files Transparency Act, lawmakers believe U.S. President Donald Trump could skirt the bill's intent and avoid disclosing material about the notorious sex trafficker's activi…",
    "link": "https://www.cbc.ca/news/world/trump-epstein-files-public-disclosure-investigation-9.6983924",
    "timestamp": "2025-11-19T09:00:00Z"
  },
  {
    "title": "Who is Clay Higgins? Louisiana congressman casts sole “no” vote in overwhelming 427‑1 House approval of Epstein files",
    "description": "Louisiana Congressman Clay Higgins stood alone in opposing a bill to release Jeffrey Epstein investigation files. He voiced worries about exposing innocent people. The bill passed Congress despite his objections. Higgins, known for his strong stance, has a hi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-clay-higgins-louisiana-congressman-casts-sole-no-vote-in-overwhelming-4271-house-approval-of-epstein-files/articleshow/125432360.cms",
    "timestamp": "2025-11-19T08:58:26Z"
  },
  {
    "title": "Trump Will Sign Epstein Bill, White House Says",
    "description": "11 min ago\nTrump Will Sign Epstein Bill, White House Says\nThe White House confirmed President Donald Trump intends to sign the disclosure bill that passed in Congress on Tuesday. Both the House and Senate agreed to support a measure that would require the Dep…",
    "link": "https://biztoc.com/x/83921a94cc13d7c2",
    "timestamp": "2025-11-19T08:53:20Z"
  },
  {
    "title": "Government News Today: Epstein Files Bill Heads to Trump's Desk; Saudi Investments",
    "description": "LIVE\nEpstein Files Bill Heads to Trump's Desk, Saudi Investments Welcomed\nFollow the latest news and analysis from Washington\nLast Updated:\nNov. 19, 2025 at 3:43 AM ET\nKey Events\nLatest Updates\nThe White House confirmed President Donald Trump intends to sign …",
    "link": "https://biztoc.com/x/e9dd3b3a034c11ec",
    "timestamp": "2025-11-19T08:53:11Z"
  },
  {
    "title": "Moore: Want lower prices? Move to a red state",
    "description": "In states where Democrats rule, inflation tends to spiral out of control. In terms of cost of living, blue states are lots more expensive, and red states are more affordable.",
    "link": "https://www.bostonherald.com/2025/11/19/moore-want-lower-prices-move-to-a-red-state/",
    "timestamp": "2025-11-19T08:44:14Z"
  },
  {
    "title": "EU to ease AI, privacy rules as critics warn of caving to Big Tech, Trump",
    "description": "STOCKHOLM/BRUSSELS :Europe is set to streamline its AI and privacy laws on Wednesday to simplify the EU's tougher rules in a move critics say will appease Big Tech and U.S. President Donald Trump.The European Commission's plans include allowing tech firms to …",
    "link": "https://www.channelnewsasia.com/business/eu-ease-ai-privacy-rules-critics-warn-caving-big-tech-trump-5476821",
    "timestamp": "2025-11-19T08:41:27Z"
  },
  {
    "title": "Why is bitcoin plunging? What we know about latest price drop",
    "description": "The value of bitcoin has fallen sharply since reaching record heights last month, briefly falling below $90,000 on Tuesday compared with above $126,000 at the start of October.",
    "link": "https://www.citizen.digital/business/why-is-bitcoin-plunging-what-we-know-about-latest-price-drop-n373269",
    "timestamp": "2025-11-19T08:41:11Z"
  },
  {
    "title": "Stephen Colbert Trolls Trump With An Epstein Riddle For The Ages",
    "description": "The \"Late Show\" host mocked the president over his flip-flop on the release of the Epstein files.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-epstein-riddle_n_691d6898e4b073def3eee9e4",
    "timestamp": "2025-11-19T08:40:26Z"
  },
  {
    "title": "Ex-Prosecutor Shows How Women Can Flip Trump’s ‘Quiet, Piggy’ Slur Right Back At Him",
    "description": "Joyce Vance suggested turning a \"glamorous, sassy\" icon into a symbol against the president.",
    "link": "https://www.huffpost.com/entry/joyce-vance-donald-trump-reporter-insult_n_691d76bae4b0b763ab8cab7a",
    "timestamp": "2025-11-19T08:36:26Z"
  },
  {
    "title": "I’m a Celeb 2025 live: Ruby Wax tells all on diastrous Donald Trump meeting",
    "description": "Tuesday night’s episode also saw Aitch take on the latest Bushtucker trial",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/im-a-celeb-2025-live-updates-ruby-wax-b2867971.html",
    "timestamp": "2025-11-19T08:32:44Z"
  },
  {
    "title": "Jon Stewart claims he knows why Trump-Epstein emails are real",
    "description": "Late-night host says president has been deflecting too much",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/donald-trump-jon-stewart-epstein-files-b2867977.html",
    "timestamp": "2025-11-19T08:27:20Z"
  },
  {
    "title": "'Ballroom bribery': Democrats hit Trump with bill for White House renovation",
    "description": "Democrats are hoping to introduce a bill that would bring transparency to Donald Trump's White House renovation project. The \"Stop Ballroom Bribery Act\" has been sponsored by Senator Elizabeth Warren and Robert Garcia, the latter from the House Oversight Comm…",
    "link": "https://www.rawstory.com/trump-white-house-ballroom-renovation-concerns/",
    "timestamp": "2025-11-19T08:20:17Z"
  },
  {
    "title": "The guest list for White House dinner for the Saudi Crown Prince included nearly 50 executives",
    "description": "White House dinner with the Saudi royal family on Tuesday.\nBRENDAN SMIALOWSKI/AFP via Getty Images\nPresident Donald Trump hosted a White House dinner for the Crown Prince of Saudi Arabia on Tuesday.\nThe dinner was attended by nearly 50 American CEOs and execu…",
    "link": "https://biztoc.com/x/c17d3493e90ef42d",
    "timestamp": "2025-11-19T08:19:34Z"
  },
  {
    "title": "US secretly drafting new Ukraine peace plan with Russian input – Axios",
    "description": "The US has prepared a new 28-point peace proposal to end the Ukraine conflict on terms that Russia reportedly finds reasonable Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627979-us-peace-plan-axios/",
    "timestamp": "2025-11-19T08:13:44Z"
  },
  {
    "title": "The guest list for White House dinner for the Saudi Crown Prince included nearly 50 executives",
    "description": "Nvidia CEO Jensen Huang and Salesforce CEO Marc Benioff were on the guest list.",
    "link": "https://www.businessinsider.com/white-house-dinner-saudi-prince-business-execs-ceos-musk-su-2025-11",
    "timestamp": "2025-11-19T08:11:17Z"
  },
  {
    "title": "US non-tariff measures drive Taiwanese firms to accelerate investment pivot",
    "description": "The US is intensifying its use of four key non-tariff measures—anti-dumping duties, balancing taxes, antitrust actions, and forced labor bans—creating mounting compliance and operational challenges for Taiwanese manufacturers. These tools have become central …",
    "link": "https://www.digitimes.com/news/a20251118PD233/investment-taiwan-labor-antitrust-2025.html",
    "timestamp": "2025-11-19T08:10:25Z"
  },
  {
    "title": "US Announces Multibillion-Dollar Nuclear Deal With Trump Ally",
    "description": "The deal was confirmed as U.S. President Donald Trump hosted Saudi Crown Prince Mohammed bin Salman at the White House.",
    "link": "https://biztoc.com/x/6cc22443ba5f7a98",
    "timestamp": "2025-11-19T08:08:28Z"
  },
  {
    "title": "Five things to know as Africa hosts its first G20 summit",
    "description": "Leaders of the world’s largest economies meet in Johannesburg for the first G20 summit in Africa. Learn about the priorities, a US boycott, and more.\n Read More",
    "link": "https://punchng.com/five-things-to-know-as-africa-hosts-its-first-g20-summit/",
    "timestamp": "2025-11-19T08:06:06Z"
  },
  {
    "title": "Harvard launches probe into Larry Summers' ties with Epstein, university newspaper reports",
    "description": "Harvard University is investigating former Treasury Secretary Larry Summers' deep connections with convicted sex offender Jeffrey Epstein. New documents reveal a long-standing, close relationship. Summers will step back from public duties. The university's pr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/harvard-launches-probe-into-larry-summers-ties-with-epstein-university-newspaper-reports/articleshow/125431269.cms",
    "timestamp": "2025-11-19T08:04:36Z"
  },
  {
    "title": "5 Higher Ed Names in the Epstein Files",
    "description": "5 Higher Ed Names in the Epstein Files\n\n \n\n\n \nEmma Whitford\n\nWed, 11/19/2025 - 03:00 AM\n\nBoth houses of Congress voted overwhelmingly Tuesday to release the rest of the trove of documents related to Epstein. Here are some of the key higher ed people mentioned…",
    "link": "https://www.insidehighered.com/news/governance/executive-leadership/2025/11/19/5-higher-ed-names-epstein-files",
    "timestamp": "2025-11-19T08:00:00Z"
  },
  {
    "title": " World Cup glory, Militao, Trump-CR7... 5️⃣ stories to kick off your day",
    "description": "The day of Tuesday, November 19, 2025, concludes with a cascade of World Cup qualifications, ranging from the fulfillment of duty by the powerhouses to the realization of historic dreams in small nati...",
    "link": "https://onefootball.com/en/news/world-cup-glory-militao-trump-cr7-5-stories-to-kick-off-your-day-41970962",
    "timestamp": "2025-11-19T07:59:00Z"
  },
  {
    "title": "Elon Musk Back At White House For Trump's Dinner With Saudi Crown Prince In First Visit Since Public Feud",
    "description": "Tesla Inc. (NASDAQ:TSLA) CEO Elon Musk made a high-profile return to the White House on Tuesday, joining a dinner hosted by President Donald Trump in honor of Saudi Crown Prince Mohammed bin Salman, marking his first public appearance there since a widely pub…",
    "link": "https://biztoc.com/x/56b3b2d33ef11dc3",
    "timestamp": "2025-11-19T07:57:26Z"
  },
  {
    "title": "Asian shares retreat in cautious trading ahead of Nvidia's profit report",
    "description": "Asian shares have retreated in cautious trading Wednesday ahead of an earnings report from Nvidia that is seen as a bellwether for the recent craze for artificial intelligence technology.  Japan's benchmark Nikkei 225 slipped 0.3% to finish at 48,537.70.  Hon…",
    "link": "https://japantoday.com/category/business/asian-shares-retreat-in-cautious-trading-ahead-of-nvidia%27s-profit-report",
    "timestamp": "2025-11-19T07:55:10Z"
  },
  {
    "title": "'Piggy' - Trump hits out at reporter over Epstein files",
    "description": "US President Donald Trump ripped into a reporter from the US network ABC News, just days after calling another woman journalist \"piggy\" after she asked a question related to the convicted sexual offender Jeffrey Epstein.",
    "link": "https://www.rte.ie/news/world/2025/1119/1544710-trump-reporters/",
    "timestamp": "2025-11-19T07:53:49Z"
  },
  {
    "title": "'Piggy' - Trump hits out at reporter over Epstein files",
    "description": "US President Donald Trump ripped into a reporter from the US network ABC News, just days after calling another woman journalist \"piggy\" after she asked a question related to the convicted sexual offender Jeffrey Epstein.",
    "link": "https://www.rte.ie/news/world/2025/1119/1544710-trump-piggy/",
    "timestamp": "2025-11-19T07:53:49Z"
  },
  {
    "title": "Senior Analyst: Bin Salman does not want a Palestinian state",
    "description": "Senior Arab affairs commentator Zvi Yehezkeli explained why, in his view, US President Donald Trump's announcement of intent to sell F-35 jets to Saudi Arabia is troubling - but not highly worrying.",
    "link": "https://www.israelnationalnews.com/news/418019",
    "timestamp": "2025-11-19T07:53:21Z"
  },
  {
    "title": "Musk, Ronaldo And Tim Cook Among High Profile Guests At Trump’s Dinner For Saudi Leader (Photos)",
    "description": "Musk and several other high-profile tech moguls, business executives, and top soccer figures attended Trump’s White House Dinner for Crown Prince Mohammed bin Salman.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/11/19/musk-ronaldo-and-tim-cook-among-high-profile-guests-at-trumps-dinner-for-saudi-leader-photos/",
    "timestamp": "2025-11-19T07:52:56Z"
  },
  {
    "title": "Meet Clay Higgins, The Only House Member To Vote Against Releasing Epstein Files",
    "description": "The fervent Donald Trump supporter and member of the ultra-conservative House Freedom Caucus stood alone in opposition.",
    "link": "https://www.huffpost.com/entry/clay-higgins-only-republican-epstein-vote_n_691d6ffce4b06f2a60ca94fc",
    "timestamp": "2025-11-19T07:52:11Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Yates faces media committee, a new cross-border college, and a snow-ice warning.",
    "link": "https://www.thejournal.ie/the-8-at-8-wednesday-55-6879207-Nov2025/",
    "timestamp": "2025-11-19T07:48:24Z"
  },
  {
    "title": "Nigeria faults US for exclusion from Nicki Minaj’s UN event",
    "description": "Nigeria expresses concern after being excluded from a US-hosted UN event discussing alleged Christian persecution, straining Nigeria-US relations.\n Read More",
    "link": "https://punchng.com/nigeria-faults-us-for-exclusion-from-nicki-minajs-un-event/",
    "timestamp": "2025-11-19T07:46:26Z"
  }
]