[
  {
    "title": "Trump Hints at Potential Auto Tariffs to Be Imposed on April 2",
    "description": "The president originally threatened to impose the tariffs earlier this month but postponed the action until March 12.",
    "link": "https://www.ibtimes.com/trump-hints-potential-auto-tariffs-imposed-april-2-3763866",
    "timestamp": "2025-02-15T12:20:13Z"
  },
  {
    "title": "Urgent CDC influenza and bird flu data missing as outbreaks escalate",
    "description": "Sonya Stokes, an emergency room physician in the San Francisco Bay Area, braces herself for a daily deluge of patients sick with coughs, soreness, fevers, vomiting, and other flu-like symptoms.\nShe’s desperate for information, but the Centers for Disease Cont…",
    "link": "https://www.rawstory.com/urgent-cdc-influenza-and-bird-flu-data-missing-as-outbreaks-escalate/",
    "timestamp": "2025-02-15T12:20:04Z"
  },
  {
    "title": "‘Buckle Up’—Global Bitcoin ‘Race’ Suddenly Begins As Price Braces For ‘Important’ Trump Update",
    "description": "A global bitcoin adoption “race” has begun as Trump’s crypto czar David Sacks teases an \"important\" announcement...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/02/15/buckle-up-global-bitcoin-race-suddenly-begins-as-price-braces-for-important-trump-update/",
    "timestamp": "2025-02-15T12:15:25Z"
  },
  {
    "title": "Trump sends defense stocks crashing",
    "description": "Military-related share prices slumped after the US president said he may cut defense spending in half Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612780-trump-defense-stocks-crashing/",
    "timestamp": "2025-02-15T12:14:35Z"
  },
  {
    "title": "Planned Parenthood appears to scrub Instagram as fears of DOGE cuts loom",
    "description": "Planned Parenthood seemed to scrub all content from its Instagram shortly after HHS Secretary RFK Jr.'s swearing in without an explanation. Some believe the organization fears DOGE cuts.",
    "link": "https://www.foxnews.com/politics/planned-parenthood-appears-scrub-instagram-fears-doge-cuts-loom",
    "timestamp": "2025-02-15T12:14:01Z"
  },
  {
    "title": "This data reporter sounds the alarm, says one major factor could soon cause Donald Trump's approval rating to plunge; here's what it is and why the President must take note",
    "description": "CNN data reporter Harry Enten warned that inflation could threaten the Trump administration, similar to its impact on Biden's presidency. Voters are concerned about rising prices and the economy, with two-thirds believing that Trump isn't focusing enough on t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/this-data-reporter-sounds-the-alarm-says-one-major-factor-could-soon-cause-donald-trumps-approval-rating-to-plunge-heres-what-it-is-and-why-the-president-must-take-note/articleshow/118275935.cms",
    "timestamp": "2025-02-15T12:13:32Z"
  },
  {
    "title": "Trump executive order would defund schools that require Covid vaccines",
    "description": "Amid fears of what U.S. President Donald Trump's second term will mean for global health and public education, the Republican on Friday signed an executive order to defund schools that require Covid-19 vaccination for students.Trump's order bars federal fundi…",
    "link": "https://www.rawstory.com/trump-executive-order-would-defund-schools-that-require-covid-vaccines/",
    "timestamp": "2025-02-15T12:11:02Z"
  },
  {
    "title": "The Adams Quid Pro Quo Is Unlike Anything Since Watergate",
    "description": "Former U.S. Attorney Joyce Vance says this week’s drama is shocking in a different, possibly more disturbing way than the Nixon scandal.",
    "link": "http://nymag.com/intelligencer/article/the-echoes-of-watergate-in-the-adams-quid-pro-quo.html",
    "timestamp": "2025-02-15T12:09:00Z"
  },
  {
    "title": "How Trump 2.0 Fired Federal Workers Over Teams Meet, Gave 30 Minutes To Leave",
    "description": "The large-scale layoff strategy is led by Elon Musk&#039;s &quot;department of government efficiency,&quot; which aims to cut costs by downsizing the federal government.",
    "link": "https://www.ndtv.com/world-news/how-donald-trump-2-0-fired-federal-workers-over-teams-meet-gave-30-minutes-to-leave-7717515",
    "timestamp": "2025-02-15T12:08:02Z"
  },
  {
    "title": "Hey, Congress: Make government great again — by turning Trump’s reforms into law",
    "description": "President Trump’s Department of Government Efficiency is accomplishing in weeks what conservatives have been talking about for decades. Already, DOGE has cut close to $1 billion in waste per day, dismantled the left-wing slush fund known formerly as USAID and…",
    "link": "https://freerepublic.com/focus/f-chat/4297780/posts",
    "timestamp": "2025-02-15T12:07:50Z"
  },
  {
    "title": "‘This Was Inevitable’ — Ripple CEO Takes Victory Lap As SEC Formally Acknowledges Spot XRP ETF Filings",
    "description": "The U.S. SEC has acknowledged and is also set to review more crypto ETF proposals, this time, it’s for Ripple’s controversial crypto, XRP.",
    "link": "https://zycrypto.com/this-was-inevitable-ripple-ceo-takes-victory-lap-as-sec-formally-acknowledges-spot-xrp-etf-filings/",
    "timestamp": "2025-02-15T12:07:19Z"
  },
  {
    "title": "Trump Justice Department Moves to Complete 'Openly Corrupt Legal Bailout' of Eric Adams",
    "description": "U.S. President Donald Trump's Justice Department formally moved Friday night to drop charges against Democratic New York City Mayor Eric Adams after at least seven federal prosecutors resigned, refusing to carry out what's been described as an \"openly corrupt…",
    "link": "https://www.commondreams.org/news/trump-justice-department-eric-adams",
    "timestamp": "2025-02-15T12:05:41Z"
  },
  {
    "title": "Donald Trump’s F-35 pitch to India: Will it be a $2 trillion problem in disguise?",
    "description": "The F-35 fighter jet, the most advanced yet costly weapon in the US arsenal, faces rising costs, performance issues, and reliability concerns, as highlighted in a US Government Accountability Office (GAO) report. Despite plans to expand the fleet, availabilit…",
    "link": "https://economictimes.indiatimes.com/news/defence/donald-trumps-f-35-pitch-to-india-will-it-be-a-2-trillion-problem-in-disguise/articleshow/118276238.cms",
    "timestamp": "2025-02-15T12:03:27Z"
  },
  {
    "title": "How Americans say they really feel about deporting immigrants",
    "description": "President Donald Trump’s signature promise during his campaign was to carry out the “largest deportation” operation in U.S. history, targeting all migrants “who violated the law coming into this country.”\nSince anyone living in the U.S. without legal permissi…",
    "link": "https://www.rawstory.com/how-americans-say-they-really-feel-about-deporting-immigrants/",
    "timestamp": "2025-02-15T12:03:02Z"
  },
  {
    "title": "Musk's 'MAGA mommy': Ashley St Clair started as a right-wing talk show guest... but is now living the high life in a $15k-a-month luxury apartment",
    "description": "Before she was Elon Musk's fourth baby momma, Ashley St Clair was one of many influencers riding Donald Trump's wave to the White House. The 26-year-old announced on Twitter on Friday night she had a five-month-old child with the 'First Buddy' after months of…",
    "link": "https://freerepublic.com/focus/f-chat/4297778/posts",
    "timestamp": "2025-02-15T12:02:24Z"
  },
  {
    "title": "Trump's Greenland Gambit Is A Masterclass In Statecraft",
    "description": "Trump's Greenland Gambit Is A Masterclass In Statecraft\n \nAuthored by Ryan P. Burke via RealClearDefense,\nDonald Trump is serious about boxing China out of the Arctic. A month before assuming the U.S. presidency for the second time, Trump notched another geop…",
    "link": "https://biztoc.com/x/be6562c62cc4bf05",
    "timestamp": "2025-02-15T12:02:13Z"
  },
  {
    "title": "How Canada Got Hooked on the U.S. Economy",
    "description": "Canada is incredibly reliant on access to U.S. markets. It didn't have to be this way, writes Stephen Maher.",
    "link": "https://time.com/7225251/canada-dependent-us-economy-tariffs-trump/",
    "timestamp": "2025-02-15T12:00:18Z"
  },
  {
    "title": "New Sen. Jim Justice 'absolutely' shocked by Democrats' response to Elon Musk's DOGE revelations",
    "description": "Sen. Jim Justice, R-W.Va., reacts to Democratic opposition to DOGE and Elon Musk’s government spending cuts on ‘The Faulkner Focus.’",
    "link": "https://www.foxnews.com/media/new-sen-jim-justice-absolutely-shocked-democrats-response-elon-musks-doge-revelations",
    "timestamp": "2025-02-15T12:00:09Z"
  },
  {
    "title": "America Opens the Door to Its Adversaries",
    "description": "U.S. foes will find plenty of opportunities in the chaos engulfing Washington.",
    "link": "https://www.theatlantic.com/international/archive/2025/02/intelligence-agencies-weakened/681711/",
    "timestamp": "2025-02-15T12:00:00Z"
  },
  {
    "title": "A Brief History of Efforts to End the Department of Education",
    "description": "President Donald Trump is attempting to dismantle the Department of Education. But his efforts are history repeating itself.",
    "link": "https://time.com/7225339/history-efforts-end-department-of-education/",
    "timestamp": "2025-02-15T12:00:00Z"
  },
  {
    "title": "The 22 Most Controversial Saturday Night Live Moments",
    "description": "The most controversial moments in SNL history",
    "link": "https://time.com/7225399/snl-most-controversial-moments/",
    "timestamp": "2025-02-15T12:00:00Z"
  },
  {
    "title": "Trump's drive to reshape government threaten bird flu response",
    "description": "As avian flu drives egg prices to record levels and increasingly poses a risk to humans, moves by the White House to cut spending and restrict communications have hobbled public health officials’ response.",
    "link": "https://www.nbcnews.com/politics/white-house/trumps-drive-reshape-government-threaten-bird-flu-response-rcna192133",
    "timestamp": "2025-02-15T12:00:00Z"
  },
  {
    "title": "Latino Republicans walk tightrope between supporting Trump and advocating for immigrants",
    "description": "Florida Republicans sent letters to Trump officials over worries of deportations for some immigrants but not opposing the policies, “which in Washington is equivalent to a wink and a nod,” one strategist said.",
    "link": "https://www.nbcnews.com/news/latino/trump-immigrants-republicans-latino-voter-concerns-deportation-rcna192029",
    "timestamp": "2025-02-15T12:00:00Z"
  },
  {
    "title": "Hamas Releases Three Israeli Hostages After 498 Days’ Captivity as Hostages-For-Terrorists Deal Continues",
    "description": "Israel to free 369 convicted Palestinian terrorists in exchange for these hostages. \nThe post Hamas Releases Three Israeli Hostages After 498 Days’ Captivity as Hostages-For-Terrorists Deal Continues first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/hamas-releases-three-israeli-hostages-after-498-days-captivity-as-hostages-for-terrorists-deal-continues/",
    "timestamp": "2025-02-15T11:58:15Z"
  },
  {
    "title": "US Justice Department asks court to dismiss charges against NYC mayor",
    "description": "NEW YORK — The U.S. Justice Department asked a court Friday to dismiss corruption charges against New York City Mayor Eric Adams, with a top official from Washington intervening after federal prosecutors in Manhattan rebuffed his demands to drop the case and …",
    "link": "https://www.voanews.com/a/us-justice-department-asks-court-to-dismiss-charges-against-nyc-mayor/7976083.html",
    "timestamp": "2025-02-15T11:58:04Z"
  },
  {
    "title": "UK 'must do more' to share Europe security burden - ministers",
    "description": "The foreign and defence secretaries say not enough has been done in the past to confront Russian aggression.",
    "link": "https://www.bbc.com/news/articles/cgq0x30kkldo",
    "timestamp": "2025-02-15T11:57:53Z"
  },
  {
    "title": "Links 2/15/2025",
    "description": "Our tantilizing daily e-mail: curcumin antibiotic? China food worries? Sikh disputes, Sudan deals w/ Russia and India, Vance slames EU values, more hostage releases, attack on Chernobyl, suit v. Musk power initial win, CFPB shutdown halted, White House freeze…",
    "link": "https://www.nakedcapitalism.com/2025/02/links-2-15-2025.html",
    "timestamp": "2025-02-15T11:56:42Z"
  },
  {
    "title": "Hamas Frees Three Hostages, Israel Releases Hundreds of Prisoners as Cease-Fire Holds",
    "description": "In exchange, Israeli forces began releasing hundreds of prisoners.",
    "link": "https://time.com/7225585/hamas-frees-three-hostages-israel-releases-hundreds-of-prisoners-cease-fire/",
    "timestamp": "2025-02-15T11:49:31Z"
  },
  {
    "title": "'My wife fears sex, I fear death' - impacts of the USAID freeze",
    "description": "Life for Mike Elvis Tusubira, a motorcycle taxi rider with HIV in Uganda, has been turned upside down since US President Donald Trump halted foreign aid last month. Not only does the 35-year-old fear for his own survival as he takes life-saving anti-retrovira…",
    "link": "https://freerepublic.com/focus/f-news/4297775/posts",
    "timestamp": "2025-02-15T11:49:27Z"
  },
  {
    "title": "CII welcomes the outcomes of Modi’s US visit, eyes stronger trade and tech ties",
    "description": "Prime Minister Narendra Modi’s US visit was hailed as a significant milestone by the Confederation of Indian Industry, enhancing collaboration in trade, defence, and technology. The visit promoted strategic partnerships in AI, semiconductors, energy, and more…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/cii-welcomes-the-outcomes-of-modis-us-visit-eyes-stronger-trade-and-tech-ties/articleshow/118276122.cms",
    "timestamp": "2025-02-15T11:46:40Z"
  },
  {
    "title": "Trump Enacts Mass Firings at Group That Maintains Nuclear Bombs",
    "description": "As Donald Trump and Elon Musk continue their government dismantling project unabated, workers at an agency that manages the United States' nuclear stockpile are feeling the burn. In an interview with NPR, an employee with that agency, the National Nuclear Sec…",
    "link": "https://futurism.com/trump-mass-firings-nuclear-bombs",
    "timestamp": "2025-02-15T11:45:05Z"
  },
  {
    "title": "Zelenskiy calls on Europe to create its own armed forces to ensure security",
    "description": "Zelenskiy tells Munich Security Conference Ukraine will not accept peace deal made behind its back",
    "link": "https://www.irishtimes.com/world/europe/2025/02/15/zelenskiy-calls-on-europe-to-create-its-own-armed-forces-to-ensure-security/",
    "timestamp": "2025-02-15T11:44:22Z"
  },
  {
    "title": "First lady fashion in review",
    "description": "Melania Trump and Donald Trump on Inauguration Day 2025.\nScott Olson/Getty Images\nThis post originally appeared in the BI Today newsletter.\nYou can sign up for Business Insider's daily newsletter here.\nHappy love week! Move over, Stanley — there's a new covet…",
    "link": "https://biztoc.com/x/8c64e301d04143ac",
    "timestamp": "2025-02-15T11:41:57Z"
  },
  {
    "title": "Army Chief lauds '10-year plan' for India-US defence deals, says will boost defence production",
    "description": "Army Chief General Upendra Dwivedi commended India-US defence deals, highlighting their benefits for India's defence production and self-reliance. Following PM Modi's US visit, a new 10-year defence framework aims to strengthen ties. Plans include joint produ…",
    "link": "https://economictimes.indiatimes.com/news/defence/army-chief-lauds-10-year-plan-for-india-us-defence-deals-says-will-boost-defence-production/articleshow/118276009.cms",
    "timestamp": "2025-02-15T11:39:23Z"
  },
  {
    "title": "US deportations: How many travel agents booked for human trafficking, Congress' Bajwa asks Punjab CM Mann",
    "description": "Punjab Congress leader Partap Singh Bajwa criticized the Bhagwant Mann government for failing to curb human trafficking in the state. He questioned how many travel agents were booked under the Punjab Prevention of Human Smuggling Act 2012 in the last three ye…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/us-deportations-how-many-travel-agents-booked-for-human-trafficking-congress-bajwa-asks-punjab-cm-mann/articleshow/118275946.cms",
    "timestamp": "2025-02-15T11:36:56Z"
  },
  {
    "title": "First lady fashion in review",
    "description": "In this Saturday edition of BI Today, we're celebrating Presidents' Day weekend in style.",
    "link": "https://www.businessinsider.com/bi-today-first-lady-fashion-2025-2",
    "timestamp": "2025-02-15T11:36:01Z"
  },
  {
    "title": "EEOC seeks to drop a gender discrimination case, signaling a big shift in civil rights enforcement",
    "description": "The federal agency that enforces workplace anti-discrimination laws has moved to dismiss its own lawsuit on behalf of a worker allegedly fired for his sexual orientation and gender identity, arguing that the case now conflicts with President Donald Trump’s re…",
    "link": "https://www.seattlepi.com/news/politics/article/eeoc-seeks-to-drop-a-gender-discrimination-case-20169079.php",
    "timestamp": "2025-02-15T11:32:39Z"
  },
  {
    "title": "Graham: Ukraine should automatically join NATO if Russia invades again",
    "description": "Republican senator says US should continue to send weapons to Ukraine.",
    "link": "https://www.politico.eu/article/graham-ukraine-should-automatically-join-nato-if-russia-invades-again/",
    "timestamp": "2025-02-15T11:31:20Z"
  },
  {
    "title": "Ignore Musk’s And Trump’s Wild Claims. Here’s How Federal Officials Really Get Rich.",
    "description": "As Forbes has tracked for years, there are plenty of perfectly legal ways for senior government officials to become quite rich despite their government salaries.",
    "link": "https://www.forbes.com/sites/kylemullins/2025/02/15/ignore-musks-and-trumps-wild-claims-heres-how-federal-officials-really-get-rich/",
    "timestamp": "2025-02-15T11:30:00Z"
  },
  {
    "title": "Zelenskyy calls for European army",
    "description": "\"We cannot rule out that America might say no to Europe on issues that might threaten it,\" the Ukrainian leader said.",
    "link": "https://www.euractiv.com/section/politics/news/zelenskyy-calls-for-european-army/",
    "timestamp": "2025-02-15T11:24:06Z"
  },
  {
    "title": "Trump offered them a buyout. Here's why they took it",
    "description": "(Reuters) - Some of the 75,000 U.S. federal workers who the Office of Personnel Management says accepted a resignation buyout offer were ready to retire anyway. Others were motivated by looming federal workforce cuts or an order to return to the office. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/02/15/trump-offered-them-a-buyout-here039s-why-they-took-it",
    "timestamp": "2025-02-15T11:22:00Z"
  },
  {
    "title": "Putin Will Use Donald Trump As 'Prop In His Own Performance'—Zelensky",
    "description": "Volodymyr Zelensky has said that Vladimir Putin intends to exploit Donald Trump as a \"prop\" for his own geopolitical ambitions.\nThe Ukrainian president made the comment during his speech at the Munich Security Conference on Saturday, in which he said he was n…",
    "link": "https://biztoc.com/x/7d0550866a5e64ea",
    "timestamp": "2025-02-15T11:21:10Z"
  },
  {
    "title": "Legislative immunity is a privilege in most states. A speeding ticket could change that in Arizona",
    "description": "The majority of state constitutions shield lawmakers from arrests, lawsuits and low-level infractions like traffic tickets during legislative sessions",
    "link": "https://abcnews.go.com/US/wireStory/legislative-immunity-privilege-states-speeding-ticket-change-arizona-118853979",
    "timestamp": "2025-02-15T11:19:38Z"
  },
  {
    "title": "Donald Trump offered US federal workers a buyout. Here's why they took it",
    "description": "Amid workforce cuts and an order to return to the office, some of 75,000 federal workers accepted resignation buyouts. They were motivated by retirement plans, potential layoffs, and personal logistics. The Trump administration had offered payments for volunt…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-offered-us-federal-workers-a-buyout-heres-why-they-took-it/articleshow/118275588.cms",
    "timestamp": "2025-02-15T11:19:28Z"
  },
  {
    "title": "Without Europe a Russia-Ukraine peace deal wouldn't work, EU foreign policy chief says",
    "description": "If Europe is left out of peace talks between Russia and Ukraine, a deal wouldn't work, EU foreign policy chief Kaja Kallas told CNBC at the Munich Security Conference on Saturday.",
    "link": "https://www.cnbc.com/2025/02/15/without-europe-russia-ukraine-peace-deal-wouldnt-work-kallas.html",
    "timestamp": "2025-02-15T11:15:45Z"
  },
  {
    "title": "Volodymyr Zelensky calls for creation of 'army of Europe' to face Russian threats",
    "description": "It comes as Donald Trump's envoy says Europe will not be involved in peace talks to end the war.",
    "link": "https://www.bbc.co.uk/news/articles/cvgl27x74wpo",
    "timestamp": "2025-02-15T11:15:40Z"
  },
  {
    "title": "Zelensky calls for creation of an 'army of Europe'",
    "description": "The Ukrainian president suggests Europe can no longer rely on the US to come to its defence.",
    "link": "https://www.bbc.com/news/articles/cvgl27x74wpo",
    "timestamp": "2025-02-15T11:15:40Z"
  },
  {
    "title": "Trump tariffs send a scare among American businesses",
    "description": "US President Donald Trump's tariffs and other policies have created uncertainty for American businesses, resulting in a steep decline in mergers and acquisitions. Business leaders from various sectors have voiced concerns over increased costs, chaos, and pote…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-tariffs-send-a-scare-among-american-businesses/articleshow/118275470.cms",
    "timestamp": "2025-02-15T11:13:37Z"
  },
  {
    "title": "Trump tariffs send a scare among American businesses",
    "description": "US President Donald Trump's tariffs and other policies have created uncertainty for American businesses, resulting in a steep decline in mergers and acquisitions. Business leaders from various sectors have voiced concerns over increased costs, chaos, and pote…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-tariffs-send-a-scare-among-american-businesses/articleshow/118275388.cms",
    "timestamp": "2025-02-15T11:13:34Z"
  },
  {
    "title": "Zelensky warns the days of America’s guaranteed support for Europe are over | CNN",
    "description": "Ukraine’s President Volodymyr Zelensky has warned the days of guaranteed US support for Europe are over, as he urged the continent to band together to create a united army and foreign policy.",
    "link": "https://www.cnn.com/2025/02/15/europe/zelensky-trump-putin-ukraine-russia-peace-talks-intl/index.html",
    "timestamp": "2025-02-15T11:13:30Z"
  },
  {
    "title": "Just what can stop the all-powerful Donald Trump? The stock market, our last hope",
    "description": "John Rapley is a contributing columnist for The Globe and Mail. He is an author and academic whose books include Why Empires Fall and Twilight of the Money Gods.\nDonald Trump’s “flood the zone” strategy looks politically ingenious. The man repeatedly knocks h…",
    "link": "https://biztoc.com/x/95d888666cf60326",
    "timestamp": "2025-02-15T11:11:58Z"
  },
  {
    "title": "Putin Will Use Donald Trump As 'Prop In His Own Performance'—Zelensky",
    "description": "The Ukrainian president was addressing the Munich Security Conference.",
    "link": "https://www.newsweek.com/putin-use-donald-trump-prop-zelensky-munich-security-conference-speech-2031704",
    "timestamp": "2025-02-15T11:11:55Z"
  },
  {
    "title": "\"No Decisions\" On Ukraine Without Kyiv, Europe: Zelensky Amid Talks To End War",
    "description": "Ukrainian President Volodymyr Zelensky on Saturday insisted that no decisions should be taken on ending Russia&#039;s war without Kyiv and Europe as the United States pushes to open talks with Moscow.",
    "link": "https://www.ndtv.com/world-news/no-decisions-on-ukraine-without-kyiv-europe-zelensky-amid-talks-to-end-war-7717161",
    "timestamp": "2025-02-15T11:11:46Z"
  },
  {
    "title": "As Trump shakes Justice Department, deeply conservative prosecutors head for exits",
    "description": "President Trump's administration faces rising tensions as Danielle Sassoon, a prominent conservative federal prosecutor, resigns over a directive to drop charges against NYC Mayor Eric Adams. This move highlights the clash between Trump's drive for control an…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/as-trump-shakes-justice-department-deeply-conservative-prosecutors-head-for-exits/articleshow/118275309.cms",
    "timestamp": "2025-02-15T11:07:26Z"
  },
  {
    "title": "Zelenskyy says it's time for creation of 'armed forces of Europe'",
    "description": "“The old days are over when America supported Europe just because it always had,\" Ukrainian President Zelenskyy said.",
    "link": "https://www.wcvb.com/article/ukraine-zelenskyy-creation-armed-forces-europe-germany/63804716",
    "timestamp": "2025-02-15T11:06:20Z"
  },
  {
    "title": "US Defense Secretary Hegseth's Europe debut irks allies, wins Trump's nod",
    "description": "WASHINGTON (Reuters) - U.S. Defense Secretary Pete Hegseth's attention-grabbing overseas debut may have irritated some key Republicans and alienated allies in Europe, where his statements on Ukraine and NATO went down like a lead balloon. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/15/us-defense-secretary-hegseth039s-europe-debut-irks-allies-wins-trump039s-nod",
    "timestamp": "2025-02-15T11:06:00Z"
  },
  {
    "title": "Hamas sends cruel message to mother of Israeli hostage, gives coin to freed American dad Sagui Dekel-Chen whose baby was born when he was in captivity",
    "description": "Dekel-Chen, a dual Israel-US citizen was gifted a gold coin in the wake of his daughter Shachar Mazal's birth last year, Israel War Room reported.",
    "link": "https://nypost.com/2025/02/15/world-news/hamas-taunts-israel-hostages-sagui-dekel-chen-and-matan-zanguaker-with-gifts/",
    "timestamp": "2025-02-15T11:05:37Z"
  },
  {
    "title": "Democrats Have a Plan to Counter Trump at the State Level",
    "description": "At a time when Republicans control all levers of power in Washington and national Democrats are struggling to respond to Donald Trump’s increasingly extreme agenda, Democrats at the state legislative level are targeting ten states in an effort to resist Trump…",
    "link": "https://www.motherjones.com/politics/2025/02/democrats-have-a-plan-to-counter-trump-at-the-state-level/",
    "timestamp": "2025-02-15T11:05:00Z"
  },
  {
    "title": "EEOC seeks to drop a gender discrimination case, signaling a big shift in civil rights enforcement",
    "description": "The federal agency that enforces workplace anti-discrimination laws has moved to dismiss its own lawsuit on behalf of a worker allegedly fired for his sexual orientation and gender identity, arguing that the case now conflicts with President Donald Tru...",
    "link": "https://abcnews.go.com/US/wireStory/eeoc-seeks-drop-gender-discrimination-case-signaling-big-118853798",
    "timestamp": "2025-02-15T11:02:39Z"
  },
  {
    "title": "White South Africans gather in support of Trump and his claims that they are victims of racism",
    "description": "Some white South Africans have showed support for President Donald Trump and gathered at the U.S. Embassy in Pretoria to claim they are victims of racism by their own government",
    "link": "https://abcnews.go.com/International/wireStory/white-south-africans-gather-support-trump-claims-victims-118853706",
    "timestamp": "2025-02-15T11:02:25Z"
  },
  {
    "title": "Department of Education warns that public schools must remove DEI policies or lose federal funding",
    "description": "The Department of Education is warning state education departments that they could lose federal funding unless they remove diversity, equity and inclusion policies.",
    "link": "https://www.foxnews.com/politics/department-education-warns-public-schools-must-remove-dei-policies-lose-federal-funding",
    "timestamp": "2025-02-15T11:01:48Z"
  },
  {
    "title": "Did Elon Musk's Son Tell Trump To 'Shush Your Mouth'? Unpacking The Claims",
    "description": "Many users across multiple platforms claimed he said, &quot;I want you to shush your mouth.&quot; Several such posts received millions of views.",
    "link": "https://www.ndtv.com/offbeat/did-elon-musks-4-year-old-son-tell-trump-to-shush-your-mouth-unpacking-the-claims-7717095",
    "timestamp": "2025-02-15T11:00:56Z"
  },
  {
    "title": "'Saturday Night Live’s' complicated political legacy",
    "description": "As Saturday Night Live celebrates its 50th anniversary, a closer look at its history shows it's far less partisan than its reputation.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/saturday-night-live-snl-politics-liberal-conservative-rcna191908",
    "timestamp": "2025-02-15T11:00:41Z"
  },
  {
    "title": "'A flag of the future': Our prime ministers have been the Maple Leaf's biggest hype men",
    "description": "Brian Mulroney lobbied for it as a student. Stephen Harper polled neighbours as a 5-year-old. It was a dream come true for Lester Pearson.",
    "link": "https://nationalpost.com/news/canada/prime-ministers-on-canadian-flag",
    "timestamp": "2025-02-15T11:00:39Z"
  },
  {
    "title": "Colorado ranchers want Trump's help fighting back against urban interference in rural communities",
    "description": "As some Colorado ranchers appeal to President Donald Trump for help stopping wolf reintroduction, another group hopes to send the matter back to the voters.",
    "link": "https://www.foxnews.com/media/colorado-ranchers-want-trumps-help-fighting-back-urban-interference-rural-communities",
    "timestamp": "2025-02-15T11:00:16Z"
  },
  {
    "title": "Brandon University students, instructors take a stand against DEI pushback in U.S.",
    "description": "President Donald Trump signed a series of sweeping executive orders that effectively dismantle federal diversity, equity and inclusion programs in the United States, leading some students and instructors at Brandon University to fear anti-DEI policies could s…",
    "link": "https://www.cbc.ca/news/canada/manitoba/brandon-university-equity-diversity-inclusion-1.7460137",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "Trump-Musk Scandal at USAID Takes Unnerving Turn With Vile Leaked Memo",
    "description": "Shockingly, it turns out that empowering the richest human being on the planet to maliciously and gratuitously heap additional misery on that planet’s most poor, hungry, and desperate people might—just might—pose a niggling political problem to President Dona…",
    "link": "https://newrepublic.com/article/191578/trump-musk-scandal-usaid-leaked-memo",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "‘The Gulf of America’ Is the Wrong Fight to Pick",
    "description": "The more that politicians mess around with place names, the more important it is to respond according to consistent principles.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/02/trump-gulf-renaming-order/681704/",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "Republican lawmakers show hypocrisy as they fight budget cuts",
    "description": "Republicans have railed against government spending, but now that it is hitting their districts,, they're changing their tune.",
    "link": "https://www.msnbc.com/inside-with-jen-psaki/republican-lawmakers-show-hypocrisy-fight-budget-cuts-rcna192306",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "Trump-Musk Scandal at USAID Takes Unnerving Turn With Vile Leaked Memo - NewsBreak",
    "description": "Shockingly, it turns out that empowering the richest human being on the planet to maliciously and gratuitously heap additional misery on that planet’s mos",
    "link": "https://www.newsbreak.com/share/3814291863413-trump-musk-scandal-at-usaid-takes-unnerving-turn-with-vile-leaked-memo?_f=app_share&pd=0I2bKdEg&lang=en_US&send_time=1739648861&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.4.0.27%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v7%2Cns_foryou_rank_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v6%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v9&s=i2",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "2 days in D.C. and a 'poor-taste joke': Get up to speed on the Ontario election",
    "description": "We've made it past the halfway point of our first winter election season in 142 years (no really, you can look it up). It was a busy week on the campaign trail, so here's a look back on a few of the biggest story lines.",
    "link": "https://www.cbc.ca/news/canada/toronto/ontario-election-week-2-roundup-1.7459226",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "These Trump administration Catholics are at odds with Pope Francis over immigration",
    "description": "Francis’ letter to U.S. bishops about Trump's immigration policies was also a pointed critique of JD Vance’s erroneous exposition on medieval theology.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/pope-francis-jd-vance-immigration-tom-homan-rcna192291",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "Trump's purge of the government is continuing in a new form",
    "description": "Trump and Musk's mass firing of probationary workers follow an unsuccessful attempt to spur adequate quitting through their \"deferred resignation\" gambit.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-mass-firing-federal-workers-resign-quit-rcna192226",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "US Aims to Cut Iranian Oil Flows by Over 90 Pct",
    "description": "'We are committed to bringing the Iranians to going back to the 100,000 barrels-a-day of oil exports'.",
    "link": "https://www.rigzone.com/news/wire/us_aims_to_cut_iranian_oil_flows_by_over_90_pct-15-feb-2025-179635-article/",
    "timestamp": "2025-02-15T11:00:00Z"
  },
  {
    "title": "Trump officials fired nuclear staff not realizing they oversee the country’s weapons stockpile, sources say - NewsBreak",
    "description": "Trump officials fired nuclear staff not realizing they oversee the country’s weapons stockpile, sources say - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3812750076041-trump-officials-fired-nuclear-staff-not-realizing-they-oversee-the-country-s-weapons-stockpile-sources-say?s=a2&amp;share_destination_id=Mjk0MDUwNDM1LTE3Mzk2MTY5NDk5OTI%3D&amp;pd=0JtnwxjT&amp;hl=en_US&amp;send_time=1739616949&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v7%2Cns_push_exp_rt_bucketv12-v6%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_rank_exp_25q1-v3",
    "timestamp": "2025-02-15T10:56:32Z"
  },
  {
    "title": "The West has been in denial about censorship for far too long",
    "description": "It is time for Western societies to stop lecturing others and open their eyes to their own realities of repression.",
    "link": "https://www.aljazeera.com/opinions/2025/2/15/the-west-has-been-in-denial-about-censorship-for-far-too-long",
    "timestamp": "2025-02-15T10:55:34Z"
  },
  {
    "title": "Hamas releases three more hostages from Gaza hell",
    "description": "Iair Horn, 46, Sagui Dekel Chen, 36; and Alexander Troufanov, 29, spent 498 days in captivity in Gaza",
    "link": "https://www.jewishnews.co.uk/hamas-releases-three-more-hostages-from-gaza-hell/",
    "timestamp": "2025-02-15T10:50:08Z"
  },
  {
    "title": "The Most Stunning Detail of the Eric Adams–Trump Corruption Scandal So Far",
    "description": "DOJ prosecutors are sending scorching resignation letters.",
    "link": "https://slate.com/news-and-politics/2025/02/trump-eric-adams-doj-new-york-bondi-fox-friends.html",
    "timestamp": "2025-02-15T10:50:00Z"
  },
  {
    "title": "Zelenskiy: Ukraine won't accept deals reached behind our backs",
    "description": "President Volodymyr Zelenskiy asserted on Saturday that Ukraine will not accept peace deals struck without its involvement. Emphasizing the need for Europe to fortify its security, Zelenskiy urged Europe to form its own armed forces, warning against potential…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskiy-ukraine-wont-accept-deals-reached-behind-our-backs/articleshow/118274896.cms",
    "timestamp": "2025-02-15T10:49:40Z"
  },
  {
    "title": "Even if they knock out Eric Adams, the far left has no chance of winning the mayoralty",
    "description": "New York lefties are howling for Mayor Eric Adams’ blood, insisting he sold his soul to President Donald Trump to avoid federal prosecution; it’s a great way to distract from progressives’ own lack of answers to the city’s problem. AOC, state Senate No. 2 Mik…",
    "link": "https://freerepublic.com/focus/f-chat/4297768/posts",
    "timestamp": "2025-02-15T10:47:11Z"
  },
  {
    "title": "Musk and space travel skewered in S. Korean director Bong's latest",
    "description": "Interplanetary space travel and the vanities of tech billionaires like Elon Musk are the subject of acclaimed South Korean director Bong Joon Ho's satirical new film \"Mickey 17\" which will be shown at the Berlin film festival on Saturday. \"It's about someone …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/musk-and-space-travel-skewered-in-s-korean-director-bongs-latest/articleshow/118274724.cms",
    "timestamp": "2025-02-15T10:42:28Z"
  },
  {
    "title": "Israel-Hamas ceasefire: 3 hostages set free in exchange for hundreds of Palestinians",
    "description": "What we know Freed hostages Sagui Dekel-Chen, Sasha Alexander Troufanov and Iair Horn have crossed into Israeli territory after Hamas transferred them to Red Cross custody in Khan Younis in the Gaza Strip More than 300 Palestinian prisoners and detainees were…",
    "link": "https://freerepublic.com/focus/f-news/4297767/posts",
    "timestamp": "2025-02-15T10:42:22Z"
  },
  {
    "title": "German Chancellor Hits Back After Vance Attacks Europe's Free Speech Stance",
    "description": "German Chancellor Olaf Scholz delivered a strong rebuke on Saturday to US Vice President JD Vance&#039;s attack on Europe&#039;s stance toward hate speech and the far right, saying it was not right for others to tell Germany, and Europe, what to do.",
    "link": "https://www.ndtv.com/world-news/german-chancellor-olaf-scholz-hits-back-after-us-vice-president-jd-vance-attacks-europes-free-speech-stance-7716950",
    "timestamp": "2025-02-15T10:40:11Z"
  },
  {
    "title": "US-India ties growing, welcome decision to extradite Rana, say ex-diplomats on PM's visit",
    "description": "Prime Minister Modi's visit to the US was termed a big success, strengthening ties between the two countries. Key outcomes include discussions with President Trump, plans for military cooperation and technology partnerships, and the extradition of Mumbai terr…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-india-ties-growing-welcome-decision-to-extradite-rana-say-ex-diplomats-on-pms-visit/articleshow/118274672.cms",
    "timestamp": "2025-02-15T10:40:04Z"
  },
  {
    "title": "White South Africans gather in support of Trump and his claims that they are victims of racism - NewsBreak",
    "description": "PRETORIA, South Africa (AP) — Some white South Africans showed support for President Donald Trump on Saturday and gathered at the U.S. Embassy in Pretoria",
    "link": "https://www.newsbreak.com/share/3814268174074-white-south-africans-gather-in-support-of-trump-and-his-claims-that-they-are-victims-of-racism?_f=app_share&pd=07xNZQW8&lang=en_US&send_time=1739635376&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v1%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v3%2Cns_foryou_model_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-control&s=i2",
    "timestamp": "2025-02-15T10:39:12Z"
  },
  {
    "title": "White South Africans gather in support of Trump and his claims that they are victims of racism - NewsBreak",
    "description": "PRETORIA, South Africa (AP) — Some white South Africans showed support for President Donald Trump on Saturday and gathered at the U.S. Embassy in Pretoria",
    "link": "https://www.newsbreak.com/share/3814268174074-white-south-africans-gather-in-support-of-trump-and-his-claims-that-they-are-victims-of-racism?s=a2&share_destination_id=MzA5NjMyMDMxLTE3Mzk2NTgzMzQ4NzQ%3D&pd=0KxBR1mu&hl=en_US&send_time=1739658334&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.47.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v7%2Cns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v4%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v2",
    "timestamp": "2025-02-15T10:39:12Z"
  },
  {
    "title": "White South Africans gather in support of Trump and his claims that they are victims of racism - NewsBreak",
    "description": "PRETORIA, South Africa (AP) — Some white South Africans showed support for President Donald Trump on Saturday and gathered at the U.S. Embassy in Pretoria",
    "link": "https://www.newsbreak.com/share/3814268174074-white-south-africans-gather-in-support-of-trump-and-his-claims-that-they-are-victims-of-racism?_f=app_share&pd=04ikhBu4&lang=en_US&send_time=1739635335&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.4.0.27%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_recall_exp_25q1-v5%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_model_exp_25q1-control&s=i2",
    "timestamp": "2025-02-15T10:39:12Z"
  }
]