[
  {
    "title": "Prices for food could go up in a week if tariffs go into effect",
    "description": "Tariffs are going to increase prices. That much we know for sure.\nIn fact, some prices are already up because of the additional tariff on Chinese goods levied in February by President Donald Trump. Import taxes targeting Canadian and Mexican products also wen…",
    "link": "https://biztoc.com/x/e9811534e86e6533",
    "timestamp": "2025-04-09T21:48:31Z"
  },
  {
    "title": "Fact Focus: Trump misrepresents facts about coal as he signs executive orders to boost its use",
    "description": "His claim that coal is cheap to use for power is false.",
    "link": "https://www.bostonherald.com/2025/04/09/trump-coal-fact-check/",
    "timestamp": "2025-04-09T21:48:30Z"
  },
  {
    "title": "Analyst sends eye-popping message on Palantir stock amid latest tariff",
    "description": "The stock market rebounded as the recent tariff war showed signs of easing.\nOn April 9, President Donald Trump unveiled a 90-day pause for the \"reciprocal\" tariffs he imposed earlier on several countries, except for China. \nIn response to Beijing’s 84% retali…",
    "link": "https://biztoc.com/x/ea3ca48cd1e3caec",
    "timestamp": "2025-04-09T21:48:29Z"
  },
  {
    "title": "Trump’s Tariffs Are Already Blowing Up in His Face in One Big Way",
    "description": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\nUpdate, Wednesday, April 9, at 2:10 p.m.: President Donald Trump announced on Truth Social this afternoon that, for a 90-day period, h…",
    "link": "https://biztoc.com/x/5bd3d7aa08433e8a",
    "timestamp": "2025-04-09T21:48:07Z"
  },
  {
    "title": "Israeli military seizing 'large areas' of Gaza as 23 Palestinians killed by Israeli strikes",
    "description": "Israeli defence minister Israel Katz confirmed that the military is seeking to make Palestinians “more isolated”.",
    "link": "https://www.thejournal.ie/israeli-military-seizing-large-areas-of-gaza-6673908-Apr2025/",
    "timestamp": "2025-04-09T21:45:42Z"
  },
  {
    "title": "Amazon to launch first batch of satellites rivaling Musk",
    "description": "U.S. retail giant Amazon is preparing to launch Wednesday its first full batch of Project Kuiper satellites, marking a crucial milestone in the battle with Elon Musk's Starlink to provide high-speed internet. The 27 satellites will be launched from Cape Canav…",
    "link": "https://japantoday.com/category/tech/amazon-to-launch-first-batch-of-satellites-rivaling-musk",
    "timestamp": "2025-04-09T21:44:34Z"
  },
  {
    "title": "U.S. takes aim at Zuckerberg's social media kingdom",
    "description": "Barring any eleventh-hour intervention, social media juggernaut Meta will stand trial next week facing serious U.S. government allegations that it abused its market power to acquire Instagram and WhatsApp before they could become competitors. By moving forwar…",
    "link": "https://japantoday.com/category/tech/us-takes-aim-at-zuckerberg%27s-social-media-kingdom",
    "timestamp": "2025-04-09T21:44:17Z"
  },
  {
    "title": "China seeks to 'tariff-proof' economy as trade war with U.S. deepens",
    "description": "China is trying to tariff-proof its economy by boosting consumption and investing in key industries, but analysts say it remains critically vulnerable to the economic storm triggered by Donald Trump's 104 percent levies on its goods. Beijing has vowed to &quo…",
    "link": "https://japantoday.com/category/business/china-seeks-to-%27tariff-proof%27-economy-as-trade-war-with-us-deepens",
    "timestamp": "2025-04-09T21:43:38Z"
  },
  {
    "title": "Inside the NATO base near Russia's border that's the eyes and ears of Europe's defence",
    "description": "Along the thin strip of beach and woodland known as the Vistula Spit which marks the northernmost demarcation between Poland and the Russian exclave of Kaliningrad, there is not much in the way of a border.",
    "link": "https://news.sky.com/story/inside-a-nato-base-in-poland-as-residents-bordering-russia-say-scare-tactic-is-needed-13345509",
    "timestamp": "2025-04-09T21:42:00Z"
  },
  {
    "title": "Billionaires turn on Trump after tariffs shake stock market",
    "description": "Billionaires who once supported President Donald Trump are now reversing course after Trump's tariff announcement shook the stock market.",
    "link": "https://www.businessinsider.com/billionaires-turn-on-trump-after-tariffs-shake-stock-market-2025-4",
    "timestamp": "2025-04-09T21:41:23Z"
  },
  {
    "title": "Suspected U.S. strikes in Yemen kill at least 10 people, Houthi rebels say",
    "description": "Suspected U.S. airstrikes that pounded the area around Yemen's Red Sea port city of Hodeida have killed at least 10 people, the Iran-backed Houthi rebels said Wednesday.  The strikes Tuesday night hit around Hodeida's al-Hawak district, the rebels said, and w…",
    "link": "https://japantoday.com/category/world/suspected-us-strikes-in-yemen-kill-at-least-10-people-houthi-rebels-say",
    "timestamp": "2025-04-09T21:41:00Z"
  },
  {
    "title": "Germany's Merz unveils coalition deal to spur growth, tackle migration",
    "description": "German conservatives under Friedrich Merz clinched a coalition deal with the center-left Social Democrats (SPD) on Wednesday, aiming to revive growth in Europe's largest economy just as a global trade war threatens recession. The deal caps weeks of haggling b…",
    "link": "https://japantoday.com/category/world/germany%27s-merz-unveils-coalition-deal-to-spur-growth-tackle-migration1",
    "timestamp": "2025-04-09T21:40:44Z"
  },
  {
    "title": "U.S. issues new sanctions on Iran as Trump seeks talks",
    "description": "The United States issued fresh sanctions targeting Iran on Wednesday, the Treasury Department said, two days after President Donald Trump announced the U.S. planned direct talks with Tehran over its nuclear program. The U.S. Treasury Department in a statement…",
    "link": "https://japantoday.com/category/world/us-issues-new-sanctions-on-iran-as-trump-seeks-talks3",
    "timestamp": "2025-04-09T21:40:35Z"
  },
  {
    "title": "US Postal Service seeks to hike cost of a first-class stamp to 78 cents",
    "description": "The Postal Service contends the price hike is necessary to achieve financial stability.",
    "link": "https://www.denverpost.com/2025/04/09/postal-rate-increase/",
    "timestamp": "2025-04-09T21:40:34Z"
  },
  {
    "title": "US Postal Service seeks to hike cost of a first-class stamp to 78 cents",
    "description": "The Postal Service contends the price hike is necessary to achieve financial stability.",
    "link": "https://www.bostonherald.com/2025/04/09/postal-rate-increase/",
    "timestamp": "2025-04-09T21:40:34Z"
  },
  {
    "title": "Israeli strike on Gaza apartment building kills at least 23",
    "description": "Israeli aircraft struck a residential block in war-ravaged northern Gaza on Wednesday, killing at least 23 people, health officials said, as the renewed fighting in the devastated Palestinian enclave showed no signs of letting up. The Al-Ahly hospital said at…",
    "link": "https://japantoday.com/category/world/israeli-strike-on-gaza-apartment-building-kills-at-least-23-officials-say",
    "timestamp": "2025-04-09T21:40:21Z"
  },
  {
    "title": "Zelenskyy says Russia dragging Beijing into war by recruiting Chinese fighters",
    "description": "Ukraine President Volodymyr Zelenskyy on Wednesday said Russia was &quot;dragging&quot; China into the war in Ukraine, as he accused Beijing of knowing that dozens of its citizens were being recruited by Moscow's army to fight. Zelenskyy -- whose war leadersh…",
    "link": "https://japantoday.com/category/world/beijing-rejects-ukraine-claim-%27many%27-chinese-fighting-for-russia",
    "timestamp": "2025-04-09T21:40:09Z"
  },
  {
    "title": "Appeals court clears way for Trump administration to fire thousands of probationary workers",
    "description": "A federal appeals court cleared the way Wednesday for President Donald Trump's administration to fire thousands of probationary workers, halting a judge’s order requiring them to be reinstated in a legal win for Trump's effort to downsize the federal workforc…",
    "link": "https://japantoday.com/category/world/appeals-court-clears-the-way-for-the-trump-administration-to-fire-thousands-of-probationary-workers",
    "timestamp": "2025-04-09T21:39:54Z"
  },
  {
    "title": "'Witch hunt': The global right-wing populist rallying cry threatening democracy",
    "description": "This is a global movement – a slow-burning insurrection that seeks to replace the checks and balances of liberal democracy with elected autocracy.",
    "link": "https://www.jpost.com/opinion/article-849474",
    "timestamp": "2025-04-09T21:39:45Z"
  },
  {
    "title": "Judges to bar U.S. from using Alien Enemies Act to deport some Venezuelans held in Texas and New York",
    "description": "Judges in Texas and New York on Wednesday said they would temporarily bar the U.S. government from deporting Venezuelans jailed in parts of those two states while their lawyers challenge the Trump administration’s use of a rarely-invoked law letting president…",
    "link": "https://japantoday.com/category/world/judges-to-bar-us-from-using-alien-enemies-act-to-deport-some-venezuelans-held-in-texas-and-new-york",
    "timestamp": "2025-04-09T21:39:31Z"
  },
  {
    "title": "Trump Trade Chief Roasted As News Breaks About Tariffs Pause In Middle Of Hearing",
    "description": "Democratic Rep. Steven Horsford ripped Jamieson Greer, the U.S. trade representative, as news of the reversal broke.",
    "link": "https://www.huffpost.com/entry/tartiffs-pause-jamieson-greer-steven-horsford_n_67f6c307e4b01be203958e6d",
    "timestamp": "2025-04-09T21:39:30Z"
  },
  {
    "title": "U.S. to screen social media of immigrants, visa applicants",
    "description": "The U.S. government said on Wednesday it will begin screening the social media of immigrants and visa applicants for what it called antisemitic activity, leading to swift condemnations from rights advocates, including some Jewish ones, who raised free speech …",
    "link": "https://japantoday.com/category/world/us-to-screen-social-media-of-immigrants-rights-advocates-raise-concerns",
    "timestamp": "2025-04-09T21:39:11Z"
  },
  {
    "title": "Social Security Halts Change Days Before Scheduled Start: What to Know",
    "description": "The change, set to take place days from now, would have forced many beneficiaries to use online portals or travel in person.",
    "link": "https://www.newsweek.com/social-security-halts-change-days-before-scheduled-start-what-know-2057674",
    "timestamp": "2025-04-09T21:39:08Z"
  },
  {
    "title": "Kennedy Center’s Interim Director Personally Insults Musician Inquiring About Canceled Shows",
    "description": "Yasmin Williams emailed Richard Grenell about recent changes, only to be called \"intolerant\" and \"vapid.\"\nKennedy Center’s Interim Director Personally Insults Musician Inquiring About Canceled Shows\nEddie Fu",
    "link": "https://consequence.net/2025/04/kennedy-center-interim-director-insults-musician/",
    "timestamp": "2025-04-09T21:37:52Z"
  },
  {
    "title": "Bank Shares Are Up Today: What You Need To Know",
    "description": "Bank shares such as Ameris Bancorp inc. (NYSE:ABCB) and BancFirst Corp (NASDAQ:BANF) are trading higher on Wednesday in response to a surprise announcement from President Donald Trump to temporarily pause certain tariffs.\nWhat To Know: The broad-based rally f…",
    "link": "https://biztoc.com/x/ff3b6f012a3e2666",
    "timestamp": "2025-04-09T21:37:21Z"
  },
  {
    "title": "Trump escalates feud with low water pressure by signing executive order targeting 'weak and worthless' shower heads",
    "description": "President Donald Trump has been a prolific signer of executive orders in his second term.\nAnna Moneymaker/Getty Images\nTrump on Wednesday signed an executive order reversing a federal rule pertaining to water pressure.\nTrump in the past has taken issue with w…",
    "link": "https://biztoc.com/x/f06acc7cbed6e302",
    "timestamp": "2025-04-09T21:37:17Z"
  },
  {
    "title": "US Steel Stock Tumbles As Trump Says 'We Don't Want To See It Go To Japan'",
    "description": "United States Steel Corp (NYSE:X) shares are getting crushed in Wednesday’s after-hours session after President Donald Trump suggested he doesn’t want to see the company get acquired by Nippon Steel.\nWhat Happened: In a press conference from the Oval Office l…",
    "link": "https://biztoc.com/x/593564a6d351ab6c",
    "timestamp": "2025-04-09T21:37:15Z"
  },
  {
    "title": "The questionable assumption fueling the stock market rally",
    "description": "President Donald Trump gestures while speaking during an executive order signing event in the Oval Office on March 31, 2025. | Andrew Harnik/Getty Images\nPresident Donald Trump beat a partial — and possibly temporary — retreat from the most radical version of…",
    "link": "https://biztoc.com/x/c9f38995d0cb70a0",
    "timestamp": "2025-04-09T21:37:09Z"
  },
  {
    "title": "Exporters fear Trump's trade war will push key markets into recession",
    "description": "A \"riskier and more unpredictable\" global trade landscape is concerning Australian exporters, but it could present opportunities as well.",
    "link": "https://www.abc.net.au/news/2025-04-10/australian-exporters-trump-tariff-recession-fears/105150320",
    "timestamp": "2025-04-09T21:37:02Z"
  },
  {
    "title": "U.S. stocks surge after Trump pauses many of his tariffs",
    "description": "NEW YORK, April 9 (Xinhua) -- U.S. stocks skyrocketed on Wednesday after the U.S. President Donald Trump announced a pause on certain \"reciprocal\" tariffs, triggering a powerful rebound in a market that had been under intense pressure over the past week. Read…",
    "link": "https://www.thestar.com.my/news/world/2025/04/10/us-stocks-surge-after-trump-pauses-many-of-his-tariffs",
    "timestamp": "2025-04-09T21:37:00Z"
  },
  {
    "title": "Trump backs off tariffs on most nations for 90 days, but raises tax on Chinese imports to 125%",
    "description": "Facing a global market meltdown, President Donald Trump on Wednesday abruptly backed off his tariffs on most nations for 90 days even as he further jacked up the tax rate on Chinese imports to 125%. It was seemingly an attempt to narrow what had been an unpre…",
    "link": "https://japantoday.com/category/world/trump-pauses-tariffs-on-most-nations-for-90-days-raises-taxes-on-chinese-imports",
    "timestamp": "2025-04-09T21:35:57Z"
  },
  {
    "title": "YouTube Star MrBeast Whines that Trump's Tariffs Are 'Nail in the Coffin' of Small Business",
    "description": "YouTube star MrBeast attacked President Donald Trump's new tariffs, claiming they are impacting his line of \"Feastables\" chocolate bars and claims they \"could really be a nail in the coffin\" for small businesses.\nThe post YouTube Star MrBeast Whines that Trum…",
    "link": "https://www.breitbart.com/tech/2025/04/09/youtube-star-mrbeast-whines-that-trumps-tariffs-are-nail-in-the-coffin-of-small-business/",
    "timestamp": "2025-04-09T21:35:56Z"
  },
  {
    "title": "Watch: Why US markets skyrocketed after Trump tariffs pause",
    "description": "The S&P 500 index soared 9.5% in the biggest one-day rally since 2008, following days of turmoil sparked by the tariffs.",
    "link": "https://www.bbc.com/news/videos/cvgnnw15z83o",
    "timestamp": "2025-04-09T21:35:55Z"
  },
  {
    "title": "Breitbart Business Digest: Trump Outmaneuvers Markets, Allies, and China in One Day",
    "description": "What looked like the start of a global financial panic turned into a show of strength from the White House and a stunning rally on Wall Street.\nThe post Breitbart Business Digest: Trump Outmaneuvers Markets, Allies, and China in One Day appeared first on Brei…",
    "link": "https://www.breitbart.com/economy/2025/04/09/breitbart-business-digest-trump-outmaneuvers-markets-allies-and-china-in-one-day/",
    "timestamp": "2025-04-09T21:35:28Z"
  },
  {
    "title": "Next up for markets: A crisis of confidence in the dollar",
    "description": "LONDON, April 4 (Reuters) - In times of market panic investors tend to rush to the safety of the dollar, but when stocks swooned in response to U.S. tariffs this week, they ran away from it. Investors say it's a sign that the greenback’s global standing may b…",
    "link": "https://freerepublic.com/focus/f-news/4310030/posts",
    "timestamp": "2025-04-09T21:34:51Z"
  },
  {
    "title": "Trump Revived the Law Used to Intern Japanese Americans, and SCOTUS Let Him",
    "description": "This week the Supreme Court left the door open for Trump to continue invoking the Alien Enemies Act to deport people.",
    "link": "https://truthout.org/articles/trump-revived-the-law-used-to-intern-japanese-americans-and-scotus-let-him/",
    "timestamp": "2025-04-09T21:33:10Z"
  },
  {
    "title": "Military Action Against Iran \"Absolutely\" Possible If...: Trump",
    "description": "US President Donald Trump said military action against Iran was &quot;absolutely&quot; possible if talks failed to produce a deal, adding that there was &quot;not much time&quot; to reach an agreement on its nuclear program.",
    "link": "https://www.ndtv.com/world-news/military-action-against-iran-absolutely-possible-if-talks-fail-donald-trump-8128468",
    "timestamp": "2025-04-09T21:31:28Z"
  },
  {
    "title": "This Long-Neglected Rule Could Be Judicial Insurrection’s Achilles Heel",
    "description": "What if I told you that when federal district judges issue injunctions blocking President Donald Trump’s policies in a judicial insurrection, they were the ones... Read More\nThe post This Long-Neglected Rule Could Be Judicial Insurrection’s Achilles Heel appe…",
    "link": "https://www.dailysignal.com/2025/04/09/this-long-neglected-rule-could-be-judicial-insurrections-achilles-heel/",
    "timestamp": "2025-04-09T21:31:16Z"
  },
  {
    "title": "‘Declaration Of Victory’: Senate Republicans Cheer Trump’s Tariff ‘Pause’",
    "description": "Senate Republicans are cheering President Donald Trump's announcement of a pause on certain tariffs to most countries that did not issue retaliatory tariffs.",
    "link": "https://dailycaller.com/2025/04/09/declaration-of-victory-senate-republicans-cheer-trumps-tariff-pause/",
    "timestamp": "2025-04-09T21:31:14Z"
  },
  {
    "title": "Trump administration appeals court decision ordering AP journalists back into White House events",
    "description": "The Trump administration says it will appeal a federal court decision that ordered it to readmit Associated Press journalists to White House events on First Amendment grounds.",
    "link": "https://www.news4jax.com/news/national/2025/04/09/trump-administration-appeals-court-decision-ordering-ap-journalists-back-into-white-house-events/",
    "timestamp": "2025-04-09T21:30:47Z"
  },
  {
    "title": "Trump: ‘Stupid’ predecessors allowed trade fiasco to develop",
    "description": "President blames tariff issue with China on 'the people sitting behind this desk'",
    "link": "https://www.wnd.com/2025/04/trump-stupid-predecessors-allowed-trade-fiasco-to-develop/",
    "timestamp": "2025-04-09T21:30:44Z"
  },
  {
    "title": "P.E.I. artist quits post after vet college asks him to remove politically charged painting",
    "description": "Christopher Griffin, the now former artist-in-residence at the Atlantic Veterinary College in Charlottetown, says administrators were trying to censor one of his paintings after complaints from American profs.",
    "link": "https://www.cbc.ca/news/canada/prince-edward-island/pei-avc-artist-in-residence-quits-controversial-painting-1.7506019",
    "timestamp": "2025-04-09T21:30:38Z"
  },
  {
    "title": "India engaged with US to seal trade pact: Jaishankar",
    "description": "NEW DELHI, April 9: The impact of US President Donald Trump’s reciprocal tariffs is not yet known and New Delhi’s strategy to deal with the situation is to firm up a bilateral trade pact with Washington by fall of this year, External Affairs Minister S Jaisha…",
    "link": "https://thehillstimes.in/national/india-engaged-with-us-to-seal-trade-pact-jaishankar",
    "timestamp": "2025-04-09T21:30:00Z"
  },
  {
    "title": "Corona Brewer Issues Downbeat Outlook Factoring in New Tariffs",
    "description": "Constellation Brands Inc. issued downbeat guidance for the year as new US tariffs and muted demand weigh on the beer, wine and spirits maker.",
    "link": "https://financialpost.com/pmn/business-pmn/corona-brewer-issues-downbeat-outlook-factoring-in-new-tariffs",
    "timestamp": "2025-04-09T21:29:48Z"
  },
  {
    "title": "“This Hotel Is a Detention Center” : An Account from the Front Lines of the Fight against Deportations in 1999 France",
    "description": "An account from the front lines of the fight against deportations in France in 1999.",
    "link": "https://crimethinc.com/2025/04/09/this-hotel-is-a-detention-center-an-account-from-the-front-lines-of-the-fight-against-deportations-in-1999-france",
    "timestamp": "2025-04-09T21:29:28Z"
  },
  {
    "title": "AAVE soars 13% as buyback proposal passes among tokenholders",
    "description": "Aave’s tokenholders approved a governance proposal to start buying back the decentralized finance (DeFi) protocol’s governance token, AAVE, as part of a broader tokenomics overhaul, Aave said on April 9. The proposal — which was approved by more than 99% of A…",
    "link": "https://cointelegraph.com/news/aave-buyback-proposal-passes-among-holders",
    "timestamp": "2025-04-09T21:27:40Z"
  },
  {
    "title": "Trump escalates feud with low water pressure by signing executive order targeting 'weak and worthless' shower heads",
    "description": "President Trump signed an executive order reversing an Obama and Biden-era rule on water pressure that he has long criticized.",
    "link": "https://www.businessinsider.com/trump-water-pressure-executive-order-showerheads-hair-2025-4",
    "timestamp": "2025-04-09T21:27:11Z"
  },
  {
    "title": "Sen. Jim Banks Delivers Maiden Speech Touting Trump's America First Trade Policies: We Cannot Pass the American Dream to Next Generation If We Let China 'Dominate Us'",
    "description": "Sen. Jim Banks said that we as a nation cannot pass on the American Dream if we let China dominate our country.\nThe post Sen. Jim Banks Delivers Maiden Speech Touting Trump’s America First Trade Policies: We Cannot Pass the American Dream to Next Generation I…",
    "link": "https://www.breitbart.com/politics/2025/04/09/sen-jim-banks-delivers-maiden-speech-touting-trumps-america-first-trade-policies-we-cannot-pass-american-dream-next-generation-if-we-let-china-dominate-us/",
    "timestamp": "2025-04-09T21:26:45Z"
  },
  {
    "title": "US Postal Service seeks to hike cost of a first-class stamp to 78 cents",
    "description": "The U.S. Postal Service is seeking a rate increase this summer that includes hiking the cost of a first-class stamp from 73 cents to 78 cents.",
    "link": "https://www.clickorlando.com/business/2025/04/09/us-postal-service-seeks-to-hike-cost-of-a-first-class-stamp-to-78-cents/",
    "timestamp": "2025-04-09T21:26:43Z"
  },
  {
    "title": "US Postal Service seeks to hike cost of a first-class stamp to 78 cents",
    "description": "The U.S. Postal Service is seeking a rate increase this summer that includes hiking the cost of a first-class stamp from 73 cents to 78 cents.",
    "link": "https://www.clickondetroit.com/business/2025/04/09/us-postal-service-seeks-to-hike-cost-of-a-first-class-stamp-to-78-cents/",
    "timestamp": "2025-04-09T21:26:36Z"
  },
  {
    "title": "How major US stock indexes fared Wednesday, 4/9/2025",
    "description": "How major US stock indexes fared Wednesday, 4/9/2025\nStocks surged to one of their biggest gains since World War II after President Donald Trump backed off his tariffs on most nations for 90 days even as he further jacked up the tax rate on Chinese imports\nSt…",
    "link": "https://biztoc.com/x/3e68547380e26271",
    "timestamp": "2025-04-09T21:26:32Z"
  },
  {
    "title": "Machinery Stocks Are Up Today: What's Going On?",
    "description": "Machinery shares such as Arcosa Inc. (NYSE:ACA) and Valmont Industries Inc. (NYSE:VMI) are trading higher Wednesday on news that President Donald Trump would pause tariffs for most U.S. trading partners. \nWhat To Know: The gains followed a surprise announceme…",
    "link": "https://biztoc.com/x/2b018f3fc5eb7542",
    "timestamp": "2025-04-09T21:26:23Z"
  },
  {
    "title": "Pharma Industry Faces Jitters As Trump Hints At Historic Tariffs, BofA Outlines Probable Timeline",
    "description": "U.S. President Donald Trump, on Tuesday, disclosed plans for a \"major tariff\" on foreign pharmaceuticals.\n\"We're going to be announcing very shortly a major tariff on pharmaceuticals… when they hear that they will leave China, they will leave other places bec…",
    "link": "https://biztoc.com/x/48cebade5fc4d070",
    "timestamp": "2025-04-09T21:26:19Z"
  },
  {
    "title": "'Strategy All Along': President Donald Trump Pauses Most Tariffs for 90 Days — Except One. Here's What We Know",
    "description": "'Strategy All Along': President Donald Trump Pauses Most Tariffs for 90 Days — Except One. Here's What We Know. On Truth Social, Trump wrote that over 75 trading partners did not retaliate to the tariffs.\nA week after announcing that the U.S. would be impleme…",
    "link": "https://biztoc.com/x/9844e9a503f6e32f",
    "timestamp": "2025-04-09T21:26:16Z"
  },
  {
    "title": "US Stock Indexes Skyrocket Following Trump’s Tariff Pause",
    "description": "The Dow soared by nearly 3,000 points, while the Nasdaq went up by 12.1 percent.",
    "link": "https://www.theepochtimes.com/business/us-stock-indexes-skyrocket-following-trumps-tariff-pause-5839376",
    "timestamp": "2025-04-09T21:26:10Z"
  },
  {
    "title": "The Latest: S&P 500 soars 9.5% to one of its biggest gains since WWII after Trump limits tariffs",
    "description": "Stocks surged to one of their biggest gains since World War II after President Donald Trump paused his tariffs against most other nations, as investors had desperately hoped he would",
    "link": "https://biztoc.com/x/dea9ff5dce6b6a02",
    "timestamp": "2025-04-09T21:26:08Z"
  },
  {
    "title": "Some bold predictions for Donald Trump’s world trade war",
    "description": "Victor Cui is a professor of entrepreneurship, innovation and global strategy and the Conrad Research Excellence Chair at the University of Waterloo’s Conrad School of Entrepreneurship and Business\nU.S. President Donald Trump has launched an unprecedented tar…",
    "link": "https://biztoc.com/x/8a9d749b4ce92723",
    "timestamp": "2025-04-09T21:26:07Z"
  },
  {
    "title": "The real losers from Trump’s stock crash, explained in 2 charts",
    "description": "The US stock market has lost trillions of dollars in value in the days since President Donald Trump announced major tariffs on American imports. On Tuesday afternoon, the S&P 500 was down more than 11 percent since Trump’s announcement of the tariffs. Global …",
    "link": "https://biztoc.com/x/7c9f0c73ff9ad8b1",
    "timestamp": "2025-04-09T21:26:05Z"
  },
  {
    "title": "Trump Media Stock Soars Hours After President Says It's A 'Great Time To Buy': What You Need To Know",
    "description": "Trump Media & Technology Group Corp (NASDAQ:DJT) shares soared in afternoon trading Wednesday alongside the broader market after President Donald Trump announced a 90-day pause on reciprocal tariffs. Trump Media shares have carried that momentum into the afte…",
    "link": "https://biztoc.com/x/74ccb86872bb66fa",
    "timestamp": "2025-04-09T21:25:54Z"
  },
  {
    "title": "You'll Die Inside When You Hear How Trump's Education Secretary Pronounces \"AI\"",
    "description": "It sure seems like president Donald Trump's secretary of education Linda McMahon needs a primer on artificial intelligence. During an education summit organized by Silicon Valley venture capitalists, the 76-year-old Trump appointee and former WWE professional…",
    "link": "https://futurism.com/trump-education-secretary-ai",
    "timestamp": "2025-04-09T21:25:45Z"
  },
  {
    "title": "Donald Trump tells investors to 'buy' hours before tariff pause",
    "description": "Donald Trump tells investors to 'buy' hours before tariff pausernz.co.nz",
    "link": "https://www.rnz.co.nz/news/business/557722/donald-trump-tells-investors-to-buy-hours-before-tariff-pause",
    "timestamp": "2025-04-09T21:25:41Z"
  },
  {
    "title": "The questionable assumption fueling the stock market rally",
    "description": "President Donald Trump beat a partial — and possibly temporary — retreat from the most radical version of his trade agenda Wednesday.  One week ago, he vowed to impose massive new tariffs on virtually all imports from nearly all countries. Although rates vari…",
    "link": "https://www.vox.com/politics/407890/trump-tariffs-pause-stock-market-rally",
    "timestamp": "2025-04-09T21:25:25Z"
  },
  {
    "title": "Rep. James Comer Becomes Latest Republican To Declare Complete Fealty To Trump",
    "description": "The Kentucky Republican declared \"what we've got to do is what President Trump wants\" during an interview on Newsmax Wednesday.",
    "link": "https://www.huffpost.com/entry/james-comer-what-weve-got-to-do-is-what-president-trump-wants_n_67f6b7dfe4b01be20395871f",
    "timestamp": "2025-04-09T21:25:14Z"
  },
  {
    "title": "Republicans trying to change rules to avoid House vote on Trump tariffs (David Smith/The Guardian)",
    "description": "David Smith / The Guardian:\nRepublicans trying to change rules to avoid House vote on Trump tariffs  —  Proposed procedural change would shield Republican representatives from having to vote on chaotic trade policy  —  Republicans are quietly pushing a proced…",
    "link": "https://www.memeorandum.com/250409/p136",
    "timestamp": "2025-04-09T21:25:13Z"
  },
  {
    "title": "Cote d'Ivoire to explore new markets following U.S. tariffs",
    "description": "ABIDJAN, April 9 (Xinhua) -- Cote d'Ivoire will explore new markets following the imposition by the U.S. government of new tariffs on its products exported to the United States, said government spokesperson Amadou Coulibaly on Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/10/cote-d039ivoire-to-explore-new-markets-following-us-tariffs",
    "timestamp": "2025-04-09T21:25:00Z"
  },
  {
    "title": "Trump Upends Weeks of Trade Policy",
    "description": "The about-face appeared to surprise senior White House advisors but rallied global stock markets.",
    "link": "http://foreignpolicy.com/2025/04/09/trump-reciprocal-tariffs-pause-90-days-china-125-percent/",
    "timestamp": "2025-04-09T21:24:44Z"
  },
  {
    "title": "Trump Abruptly Pauses Reciprocal Tariffs for 90 Days—Except on China",
    "description": "The about-face appeared to surprise senior White House advisors but rallied global stock markets.",
    "link": "http://foreignpolicy.com/2025/04/09/trump-reciprocal-tariffs-pause-90-days-china-125-percent-bessent-greer/",
    "timestamp": "2025-04-09T21:24:39Z"
  },
  {
    "title": "The Supreme Court Doesn’t Need Facts",
    "description": "The justices exhibit a disturbing willingness to ignore the human costs of Trump’s actions, preferring instead to remain within the more comfortable zone of high-minded legal theory.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/trump-deportations-scotus-ruling/682377/",
    "timestamp": "2025-04-09T21:24:20Z"
  },
  {
    "title": "Markets soar as Trump pauses some tariffs",
    "description": "In a dramatic change of policy, Donald Trump has paused higher tariffs on goods entering the United States from every country except China. In a post on social media, the President said levies would be lowered to ten percent, but taxes on Chinese imports woul…",
    "link": "https://www.bbc.co.uk/programmes/w172zss05prdpnb",
    "timestamp": "2025-04-09T21:24:00Z"
  },
  {
    "title": "Trump's Car Tariffs Could Drive Slovakia Into Russia's Arms",
    "description": "By imposing massive tariffs on foreign-made cars, Trump is punishing key allies, tanking Slovakia’s economy, and undermining U.S. influence in Eastern Europe.",
    "link": "https://reason.com/2025/04/10/trumps-car-tariffs-could-drive-slovakia-into-russias-arms/",
    "timestamp": "2025-04-09T21:23:16Z"
  },
  {
    "title": "Former Hunter Biden Business Partner Says President’s Son Leveraged Family Name",
    "description": "Devon Archer, a former business partner of Hunter Biden, said in a new interview what he told Congress last year: Hunter’s business role when they... Read More\nThe post Former Hunter Biden Business Partner Says President’s Son Leveraged Family Name appeared f…",
    "link": "https://www.dailysignal.com/2025/04/09/former-hunter-biden-business-partner-says-presidents-son-leveraged-family-name/",
    "timestamp": "2025-04-09T21:22:02Z"
  },
  {
    "title": "Up next for Trump’s war on Mexican drug cartels? Maybe drone strikes!",
    "description": "Sources report unannounced operations being considered in concert with President Sheinbaum",
    "link": "https://www.wnd.com/2025/04/up-next-for-trumps-war-on-mexican-drug-cartels-maybe-drone-strikes/",
    "timestamp": "2025-04-09T21:21:39Z"
  },
  {
    "title": "Bitcoin price soars to $83.5K — Have pro BTC traders turned bullish?",
    "description": "US equities and crypto markets shifted dramatically on April 9 after  US President Donald Trump announced a 90-day pause on his reciprocal tariffs, except for China. Bitcoin (BTC) price responded by surging by 5% in less than an hour, reclaiming the $83,000 l…",
    "link": "https://cointelegraph.com/news/bitcoin-price-soars-to-83-5-k-have-pro-btc-traders-turned-bullish",
    "timestamp": "2025-04-09T21:20:38Z"
  },
  {
    "title": "Trump administration prepares to send more deported migrants to notorious El Salvador prison | CNN Politics",
    "description": "The Trump administration is preparing to send more immigrants with criminal records to El Salvador’s notorious mega prison on the heels of a Supreme Court order allowing the use for now of a sweeping wartime authority for deportations, according to two US off…",
    "link": "https://www.cnn.com/2025/04/09/politics/deportees-el-salvador-prison-trump/index.html",
    "timestamp": "2025-04-09T21:20:35Z"
  },
  {
    "title": "Saudi top diplomat in US to prepare for Trump visit",
    "description": "Saudi Arabia’s top diplomat held talks in Washington on Wednesday as he lays the groundwork for a visit by US President Donald Trump, which would be the first foreign trip of his second term. Foreign Minister Prince Faisal bin Farhan met at the State Departme…",
    "link": "https://www.digitaljournal.com/world/saudi-top-diplomat-in-us-to-prepare-for-trump-visit/article",
    "timestamp": "2025-04-09T21:20:32Z"
  },
  {
    "title": "Trump: Israel 'Leader' Of Iran Strike If Tehran Doesn't Give Up Nuclear Weapons Program",
    "description": "President Donald Trump said Wednesday that Israel would be the “leader” of a potential military strike against Iran if Tehran doesn’t give up its nuclear weapons program.",
    "link": "https://www.huffpost.com/entry/us-trump-iran_n_67f6e3a8e4b01487145284f3",
    "timestamp": "2025-04-09T21:20:25Z"
  },
  {
    "title": "SEC approves options on spot Ether ETFs",
    "description": "The United States Securities and Exchange Commission (SEC) has approved options trading for multiple spot Ether exchange-traded funds (ETFs), a move that may broaden the investment appeal of Ether among institutional traders. The SEC issued the approval on Ap…",
    "link": "https://cointelegraph.com/news/sec-approves-options-spot-ether-etfs",
    "timestamp": "2025-04-09T21:19:08Z"
  },
  {
    "title": "Fetterman Joins GOP in Voting to Confirm Mike Huckabee as Ambassador to Israel",
    "description": "Huckabee once said that he believes there’s “really no such thing as a Palestinian.”…",
    "link": "https://truthout.org/articles/fetterman-joins-gop-in-voting-to-confirm-mike-huckabee-as-ambassador-to-israel/",
    "timestamp": "2025-04-09T21:18:55Z"
  },
  {
    "title": "The U.S. and China are copying each other, giving rise to memes and mockery",
    "description": "President Donald Trump wants to bring back American manufacturing in ways that would reshape the United States economy to look more like China’s.",
    "link": "https://www.nbcnews.com/news/world/us-china-are-copying-giving-rise-memes-mockery-rcna200193",
    "timestamp": "2025-04-09T21:18:39Z"
  },
  {
    "title": "'How can people believe you?' Trump pressed on credibility after major walkback",
    "description": "President Donald Trump was forced to try to explain to reporters on Wednesday why he suddenly offered a 90-day partial reprieve from his \"reciprocal tariffs\" for every country except China — and how he could be trusted to keep his word in diplomatic and econo…",
    "link": "https://www.rawstory.com/trump-tariff-walkback/",
    "timestamp": "2025-04-09T21:18:25Z"
  },
  {
    "title": "Trump Serves Up Word Salad While Bragging About Wasting CA Irrigation Water",
    "description": "This vile excuse for a human being was still politicizing the California wildfires during a speech following him signing more executive orders, this time aimed at protecting the coal industry. As we discussed here, those fires took our own John Amato's home e…",
    "link": "https://crooksandliars.com/2025/04/trump-serves-word-salad-while-bragging",
    "timestamp": "2025-04-09T21:18:11Z"
  },
  {
    "title": "Starlink Is Caught in the Middle of Trump’s Trade War",
    "description": "Elon Musk’s satellite internet company has already lost hundreds of millions in contracts with Canada, while other countries move forward despite tariffs.",
    "link": "https://www.cnet.com/home/internet/starlink-is-caught-in-the-middle-of-trumps-trade-war/",
    "timestamp": "2025-04-09T21:18:00Z"
  },
  {
    "title": "The cult abdicates to its leader",
    "description": "No checks, no balances: Republican leaders in the House are moving to short-circuit an attempt to force a vote on President Donald Trump’s new global tariffs, repeating a maneuver they used earlier this year to block attempts to overturn narrower levies targe…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/the-cult-abdicates-to-its-leader",
    "timestamp": "2025-04-09T21:17:58Z"
  },
  {
    "title": "FBI Director Kash Patel was removed as acting ATF director, US officials confirm",
    "description": "FBI Director Kash Patel was removed from his role as acting director of the Bureau of Alcohol, Tobacco, Firearms and Explosives and replaced by Army Secretary Daniel Driscoll, US officials confirmed",
    "link": "https://nypost.com/2025/04/09/us-news/kash-patel-removed-as-acting-atf-director-us-officials/",
    "timestamp": "2025-04-09T21:17:27Z"
  },
  {
    "title": "Karoline Leavitt Completely Whiffs Defending Absurd Premise Based on Incomplete Quote",
    "description": "Maggie Haberman used an incomplete quote at a briefing — drawing a delusional and absurd response from White House Press Secretary Karoline Leavitt.\nThe post Karoline Leavitt Completely Whiffs Defending Absurd Premise Based on Incomplete Quote first appeared …",
    "link": "https://www.mediaite.com/opinion/karoline-leavitt-completely-whiffs-defending-absurd-premise-based-on-incomplete-quote/",
    "timestamp": "2025-04-09T21:17:05Z"
  },
  {
    "title": "Karoline Leavitt Completely Whiffs Defending Absurd Premise Based on Incomplete Quote",
    "description": "Maggie Haberman used an incomplete quote at a briefing — drawing a delusional and absurd response from White House Press Secretary Karoline Leavitt.\nThe post Karoline Leavitt Completely Whiffs Defending Absurd Premise Based on Incomplete Quote first appeared …",
    "link": "https://www.mediaite.com/opinion/maggie-haberman-got-trump-chiefs-quote-wrong-at-briefing-but-karoline-leavitt-completely-whiffed-on-answer/",
    "timestamp": "2025-04-09T21:17:05Z"
  },
  {
    "title": "State Dept. gives El Salvador a massive upgrade as it disappears U.S. immigrants",
    "description": "The Trump administration wants Americans to feel safe traveling to El Salvador, even as the Salvadoran regime imprisons hundreds of immigrants who were hastily flown there from the U.S. in chains.",
    "link": "https://www.msnbc.com/top-stories/latest/el-salvador-travel-advisory-united-states-rcna200483",
    "timestamp": "2025-04-09T21:16:53Z"
  },
  {
    "title": "'Maximum Pressure': Trump Unleashes Fresh Sanctions on Iranian Nuclear Program",
    "description": "The Trump administration unleashed another round of sanctions on Iranian entities fueling the country’s illicit nuclear weapons program, ratcheting up pressure on the hardline regime ahead of major diplomatic talks this weekend. The Wednesday sanctions primar…",
    "link": "https://freebeacon.com/national-security/maximum-pressure-trump-unleashes-fresh-sanctions-on-iranian-nuclear-program/",
    "timestamp": "2025-04-09T21:15:52Z"
  },
  {
    "title": "Oil, Gas Stocks Jump After Trump Pauses Tariffs For U.S. Allies, Isolates China",
    "description": "Oil and gas stocks such as APA Corporation (NASDAQ:APA), BP PLC (NYSE:BP) and Exxon Mobil Inc. (NYSE:XOM) are trading higher Wednesday after President Donald Trump announced a 90-day pause on reciprocal tariffs for countries that have not retaliated against U…",
    "link": "https://biztoc.com/x/386daefc8a227c87",
    "timestamp": "2025-04-09T21:15:29Z"
  },
  {
    "title": "Chip Stocks Surge As Trump Pauses Tariffs For US Allies, Targets China With 125% Duties",
    "description": "Semiconductor stocks such as Arm Holdings (NASDAQ:ARM), NVIDIA inc. (NASDAQ:NVDA) and Broadcom Inc. (NASDAQ:AVGO) are trading higher Wednesday after President Donald Trump announced a 90-day pause on new tariffs for countries that have not retaliated against …",
    "link": "https://biztoc.com/x/2c699ae75980d6c0",
    "timestamp": "2025-04-09T21:15:21Z"
  }
]