[
  {
    "title": "Trump Reportedly Told a Jewish Donor ‘My People Are Starting to Hate Israel’",
    "description": "President Donald Trump’s MAGA movement has become increasingly critical of Israel in recent months, a trend noted by the president himself in recent days\nThe post Trump Reportedly Told a Jewish Donor ‘My People Are Starting to Hate Israel’ first appeared on M…",
    "link": "https://www.mediaite.com/media/news/trump-reportedly-told-a-jewish-donor-my-people-are-starting-to-hate-israel/",
    "timestamp": "2025-07-31T15:25:04Z"
  },
  {
    "title": "Trump’s tariff surprise triggers implosion of copper markets",
    "description": "The global copper market is reeling from its biggest shock yet in a year of policy surprises and violent price swings. Read more.",
    "link": "https://financialpost.com/commodities/mining/trump-tariff-implosion-copper-trade",
    "timestamp": "2025-07-31T15:24:50Z"
  },
  {
    "title": "Trump Won’t Take Away Tesla’s Subsidies. Does That Make TSLA Stock a Safe Buy Here?",
    "description": "Despite Trump’s reassurance that he won’t strip Tesla of its subsidies, his tax bill has already hurt the company, raising questions about whether TSLA stock...",
    "link": "https://www.barchart.com/story/news/33784061/trump-wont-take-away-teslas-subsidies-does-that-make-tsla-stock-a-safe-buy-here",
    "timestamp": "2025-07-31T15:24:10Z"
  },
  {
    "title": "Irish whiskey exporters may be forced to look at other markets if 15% tariff rate applies",
    "description": "Irish Whiskey Association issues warning as EU confirms no carve out for spirits",
    "link": "https://www.irishtimes.com/business/2025/07/31/irish-whiskey-exporters-may-be-forced-to-look-at-other-markets-if-15-tariff-rate-applies/",
    "timestamp": "2025-07-31T15:23:49Z"
  },
  {
    "title": "Diddy’s Legal Team Motions To Request A New Trial",
    "description": "Sean 'Diddy' Combs filed a motion Wednesday challenging the Mann Act convictions and asking the court to set aside the jury's verdict or grant a new trial.",
    "link": "https://dailycaller.com/2025/07/31/sean-diddy-combs-legal-filing-court-verdict-new-trial-prostitution-sex-trafficking-racketeering/",
    "timestamp": "2025-07-31T15:23:38Z"
  },
  {
    "title": "Nancy Pelosi Brushes Off Trump Insider Trading Accusation",
    "description": "Legislation introduced by Sen. Josh Hawley to ban members of Congress from buying stocks passed a key Senate committee this week.",
    "link": "https://www.newsweek.com/nancy-pelosi-trump-insider-trading-accusation-ridiculous-2106950",
    "timestamp": "2025-07-31T15:22:09Z"
  },
  {
    "title": "Donald Trump Has Beaten Big Law Into Submission",
    "description": "Donald Trump’s efforts to chill legal challenges against his agenda appear to have worked, as Big Law has reached a new low to spare themselves from the president’s wrath. Reuters reported on Thursday that, after striking deals with the Trump administration, …",
    "link": "https://newrepublic.com/post/198655/donald-trump-big-law",
    "timestamp": "2025-07-31T15:21:08Z"
  },
  {
    "title": "Trump announces 90-day negotiating period with Mexico as 25% tariff rates stay in place",
    "description": "Trump said autos would face a 25% tariff.",
    "link": "https://www.bostonherald.com/2025/07/31/trump-tariffs-mexico/",
    "timestamp": "2025-07-31T15:20:57Z"
  },
  {
    "title": "Trump signs order imposing new tariffs on a number of trading partners that go into effect in 7 days",
    "description": "Trump has agreed to a 90-day negotiation period with Mexico, keeping a 25% tariff in place.",
    "link": "https://www.denverpost.com/2025/07/31/trump-tariffs-mexico/",
    "timestamp": "2025-07-31T15:20:57Z"
  },
  {
    "title": "Why South Park Struck a Nerve",
    "description": "The show’s creators once said they had nothing more to say about the president. What changed their minds?",
    "link": "https://www.theatlantic.com/culture/archive/2025/07/south-park-trump-episode-paramount-satire/683722/",
    "timestamp": "2025-07-31T15:20:36Z"
  },
  {
    "title": "Here's How Much Traders Expect Apple Stock To Move After Earnings Today",
    "description": "Apple is scheduled to report quarterly earnings after the closing bell Thursday, with traders anticipating a sizable move from the iPhone maker's stock.",
    "link": "https://www.investopedia.com/here-is-how-much-traders-expect-apple-stock-to-move-after-earnings-today-11781405",
    "timestamp": "2025-07-31T15:20:30Z"
  },
  {
    "title": "Trump set to revive the Presidential Fitness Test while hosting professional athletes at White House (CNN)",
    "description": "CNN:\nTrump set to revive the Presidential Fitness Test while hosting professional athletes at White House  —  President Donald Trump will be joined by professional athletes on Thursday to sign an executive order that will expand on his council on sports, fitn…",
    "link": "https://www.memeorandum.com/250731/p53",
    "timestamp": "2025-07-31T15:20:00Z"
  },
  {
    "title": "Trump extends Mexico's 25% tariffs for 90 days as talks continue",
    "description": "President Donald Trump said he would not raise U.S. tariffs on Mexican goods beyond their current levels for 90 days.",
    "link": "https://www.cnbc.com/2025/07/31/trump-tariffs-mexico-extension.html",
    "timestamp": "2025-07-31T15:19:15Z"
  },
  {
    "title": "President Trump Is Downsizing The Internal Revenue Service",
    "description": "Next tax season is likely to be difficult for taxpayers, tax professionals, and for the Internal Revenue Service due to recent cuts to IRS staffing and their budget.",
    "link": "https://www.forbes.com/sites/mikesylvester/2025/07/31/president-trump-is-downsizing-the-internal-revenue-service/",
    "timestamp": "2025-07-31T15:18:34Z"
  },
  {
    "title": "Trump postpones higher Mexico tariff for 90 days, while 25% tariff rates stay in place",
    "description": "President Trump announced on Truth Social that the planned tariff hike on Mexican goods would be postponed. Following discussions with President Claudia Sheinbaum, the existing 25 percent tariff on goods not covered by the North American trade pact will remai…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-postpones-higher-mexico-tariff-for-90-days/articleshow/123024193.cms",
    "timestamp": "2025-07-31T15:18:33Z"
  },
  {
    "title": "White House crypto report a mixed bag for Bitcoin advocates",
    "description": "The White House’s crypto report did not provide updates to the March 6 executive order establishing a Bitcoin reserve.",
    "link": "https://cointelegraph.com/news/white-house-crypto-report-bitcoin-reserve",
    "timestamp": "2025-07-31T15:17:55Z"
  },
  {
    "title": "Senate GOP eyes rules revolt as Dems stonewall Trump nominees",
    "description": "Senate Republicans mull shortening debate time or packaging together nominees to speed up the confirmation process, but Senate Democrats warn that they too could take advantage of any precedent changes.",
    "link": "https://www.foxnews.com/politics/senate-gop-considers-confirmation-rules-shake-up-dems-stonewall-trump-nominees",
    "timestamp": "2025-07-31T15:17:47Z"
  },
  {
    "title": "Senate GOP eyes rules revolt as Dems stonewall Trump nominees",
    "description": "Senate Republicans mull shortening debate time or packaging together nominees to speed up the confirmation process, but Senate Democrats warn that they too could take advantage of any precedent changes.",
    "link": "https://www.foxnews.com/politics/senate-gop-eyes-rules-revolt-dems-stonewall-trump-nominees",
    "timestamp": "2025-07-31T15:17:47Z"
  },
  {
    "title": "Trump: Deal with Mexico extended for 90 days",
    "description": "United States President Donald Trump announced in a post on Truth Social on Thursday that he decided to extend the trade agreement with Mexico for 90 days.He revealed that he held a \"successful\" phone...",
    "link": "https://biztoc.com/x/a044e780433a394e",
    "timestamp": "2025-07-31T15:16:45Z"
  },
  {
    "title": "US: Ukraine conflict must end by August 8",
    "description": "Acting United States Alternate Representative to the United Nations John Kelley remarked on Thursday that President Donald Trump \"made it clear\" that Russia must end its military campaign in Ukraine b...",
    "link": "https://biztoc.com/x/58de2b9311ddb74a",
    "timestamp": "2025-07-31T15:16:15Z"
  },
  {
    "title": "India Pauses Russian Crude Oil Purchases",
    "description": "Indian state refiners have temporarily ceased purchasing Russian crude oil this week, primarily due to concerns over potential secondary tariffs threatened by U.S. President Donald Trump and reduced discounts on Russian oil. This decision by state-controlled …",
    "link": "https://freerepublic.com/focus/f-chat/4331839/posts",
    "timestamp": "2025-07-31T15:15:55Z"
  },
  {
    "title": "India refuses to play 'dead economy'. Will Trump back off?",
    "description": "In response to U.S. tariffs and disparaging remarks, India has asserted its stance on trade negotiations. Commerce Minister Piyush Goyal emphasized India's commitment to protecting its stakeholders and refusing deals under pressure. India seeks trade partners…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-refuses-to-play-dead-economy-will-trump-back-off/articleshow/123024151.cms",
    "timestamp": "2025-07-31T15:15:42Z"
  },
  {
    "title": "Mamdani Wants $30 Minimum Wage in New York, But California Shows This Will Kill Thousands of Jobs",
    "description": "New York City mayoral candidate Zohran Mamdani wants a $30 minimum wage in New York by 2030, but California’s experience shows this flawed policy will... Read More\nThe post Mamdani Wants $30 Minimum Wage in New York, But California Shows This Will Kill Thousa…",
    "link": "https://www.dailysignal.com/2025/07/31/mamdani-wants-30-minimum-wage-in-new-york-but-california-shows-this-will-kill-thousands-of-jobs/",
    "timestamp": "2025-07-31T15:15:00Z"
  },
  {
    "title": "Trump Admin Warns DACA Recipients To Self-Deport",
    "description": "\"Illegal aliens who claim to be recipients of [DACA] are not automatically protected from deportations,\" Tricia McLaughlin said.",
    "link": "https://www.newsweek.com/trump-admin-daca-recipients-self-deport-2106991",
    "timestamp": "2025-07-31T15:14:35Z"
  },
  {
    "title": "The Social Network Sequel Is App-ening",
    "description": "Aaron Sorkin’s plot to write and direct a sequel to ‘The Social Network’ thickens. Everything we know about the rumored cast and story line.",
    "link": "http://www.vulture.com/article/social-network-2-cast-trailer-release-date.html",
    "timestamp": "2025-07-31T15:13:30Z"
  },
  {
    "title": "Trump plans to revive the Presidential Fitness Test for American schoolchildren",
    "description": "President Donald Trump plans to reestablish the Presidential Fitness Test for American schoolchildren",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-plans-revive-presidential-fitness-test-american-schoolchildren-124247410",
    "timestamp": "2025-07-31T15:13:16Z"
  },
  {
    "title": "Trump’s tariff threat: India says national interests will be secured",
    "description": "India responds to Trump's tariff threats, asserting steps to secure national interest while negotiating trade agreement with US.",
    "link": "https://www.thehindubusinessline.com/economy/trumps-tariff-threat-india-says-national-interests-will-be-secured/article69879233.ece",
    "timestamp": "2025-07-31T15:12:15Z"
  },
  {
    "title": "Trump Slaps Sanctions on Palestinian Authority; Blocks Officials from Traveling to UN for 'Palestinian State'",
    "description": "President Donald Trump's administration slapped sanctions on the Palestinian Authority and the Palestine Liberation Organization (PLO) for seeking statehood outside of a formal agreement with Israel, per U.S. law.\nThe post Trump Slaps Sanctions on Palestinian…",
    "link": "https://www.breitbart.com/middle-east/2025/07/31/trump-slaps-sanctions-on-palestinian-authority-blocks-officials-from-traveling-to-un-for-palestinian-state/",
    "timestamp": "2025-07-31T15:11:59Z"
  },
  {
    "title": "Hulk Hogan died of heart attack while facing other health issues: officials",
    "description": "Hulk Hogan faced several health issues and died last week of a heart attack, the the Pinellas County Forensic Science Center told Page Six.",
    "link": "https://www.foxnews.com/sports/hulk-hogan-died-heart-attack-while-facing-other-health-issues-officials",
    "timestamp": "2025-07-31T15:11:41Z"
  },
  {
    "title": "CNN’s Donie O’Sullivan Calls Out Ultra-MAGA Brian Glenn for Not Asking Trump About Epstein",
    "description": "CNN correspondent Donie O’Sullivan called out MAGA White House Correspondent Brian Glenn for not using his access to ask Trump about Jeffrey Epstein.\nThe post CNN’s Donie O’Sullivan Calls Out Ultra-MAGA Brian Glenn for Not Asking Trump About Epstein first app…",
    "link": "https://www.mediaite.com/media/news/cnns-donie-osullivan-calls-out-ultra-maga-brian-glenn-for-not-asking-trump-about-epstein/",
    "timestamp": "2025-07-31T15:10:39Z"
  },
  {
    "title": "Fox News’ Mark Levin shrugs off starvation in Gaza because malnourished Palestinian baby has pre-existing health issues - NewsBreak",
    "description": "Fox News host Mark Levin suggested that the widespread famine gripping Gaza is being grossly exaggerated, specifically referencing a New York Times story a",
    "link": "https://www.newsbreak.com/share/4146057652936-fox-news-mark-levin-shrugs-off-starvation-in-gaza-because-malnourished-palestinian-baby-has-pre-existing-health-issues?_f=app_share&amp;pd=09TzEAAl&amp;lang=en_US&amp;send_time=1753974572&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.30.0.28%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q3-v3%2Cns_foryou_recall_exp_25q3-v1%2Cns_foryou_model_exp_25q3-v8%2Cns_foryou_rank_exp_25q2-v3&amp;s=i2",
    "timestamp": "2025-07-31T15:10:09Z"
  },
  {
    "title": "‘RIP Democracy:’ Left-Wing Protesters Drop Coffin On Wisconsin GOP Rep’s Doorstep",
    "description": "A group of left-wing protestors left a coffin at the home of Republican Wisconsin Rep. Bryan Steil last week, the congressman confirmed Wednesday. The protesters, wearing black and carrying a cardboard coffin, orchestrated a mock funeral procession in front o…",
    "link": "https://dailycaller.com/2025/07/31/protesters-drop-coffin-republican-wisconsin-rep-bryan-steil/",
    "timestamp": "2025-07-31T15:08:34Z"
  },
  {
    "title": "Trump Bullies Hawley Into Submission on Stock Trading Ban",
    "description": "Senator Josh Hawley, author of a bill to ban stock trading by the president and vice-president, said he will do ’whatever it would take’ to make Donald Trump happy with the legislation.",
    "link": "http://nymag.com/intelligencer/article/trump-bullies-hawley-into-submission-on-stock-trading-ban.html",
    "timestamp": "2025-07-31T15:08:26Z"
  },
  {
    "title": "Trump plans to revive the Presidential Fitness Test for American schoolchildren",
    "description": "President Donald Trump plans to reestablish the Presidential Fitness Test for American schoolchildren.",
    "link": "https://www.clickondetroit.com/news/politics/2025/07/31/trump-plans-to-revive-the-presidential-fitness-test-for-american-schoolchildren/",
    "timestamp": "2025-07-31T15:08:15Z"
  },
  {
    "title": "EPA All Whoops Hahaha Global Warming What? Also F*ck You.",
    "description": "That was a *different* Supreme Court that told the EPA to hurry up and regulate greenhouse gases.",
    "link": "https://www.wonkette.com/p/epa-all-whoops-hahaha-global-warming",
    "timestamp": "2025-07-31T15:07:14Z"
  },
  {
    "title": "Trump's EPA to roll back cornerstone of climate action",
    "description": "The US Environmental Protection Agency under President Donald Trump is pushing to reverse a 2009 landmark declaration that deemed CO2 and other greenhouse gases harmful to people's health. What's at stake?",
    "link": "https://www.dw.com/en/lee-zeldin-to-end-endangerment-finding-vital-to-clean-air-act-and-us-environment-protection/a-73485787",
    "timestamp": "2025-07-31T15:06:00Z"
  },
  {
    "title": "Lula's approval rises amid tariff dispute with Trump, poll shows",
    "description": "SAO PAULO (Reuters) -Approval for Brazilian President Luiz Inacio Lula da Silva exceeded disapproval for the first time in nine months, a poll showed on Thursday, against a backdrop of a growing dispute with Washington. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/31/lula039s-approval-rises-amid-tariff-dispute-with-trump-poll-shows",
    "timestamp": "2025-07-31T15:06:00Z"
  },
  {
    "title": "Harris to hold talks with NI Executive on US trade deals",
    "description": "Tánaiste and Minister for Foreign Affairs and Trade Simon Harris is to hold talks with the leaders of the Northern Ireland Executive this evening on the trade deals with the US.",
    "link": "https://www.rte.ie/news/business/2025/0731/1526383-eu-trade-talks/",
    "timestamp": "2025-07-31T15:05:56Z"
  },
  {
    "title": "Harris to hold talks with NI Executive on US trade deals",
    "description": "Tánaiste and Minister for Foreign Affairs and Trade Simon Harris is to hold talks with the leaders of the Northern Ireland Executive this evening on the trade deals with the US.",
    "link": "https://www.rte.ie/news/2025/0731/1526383-eu-trade-talks/",
    "timestamp": "2025-07-31T15:05:56Z"
  },
  {
    "title": "European Union assumes its faces 15% tariffs in the US from Friday. But a key text still isn't ready",
    "description": "The European Commission says it presumes the United States will impose a 15% tariff on most EU exports from Friday. That's not certain because as of Thursday the two sides had yet to complete a key document clarifying how the agreement will operate. U.S. Pres…",
    "link": "https://www.seattlepi.com/news/world/article/european-union-assumes-its-faces-15-tariffs-in-20796026.php",
    "timestamp": "2025-07-31T15:05:35Z"
  },
  {
    "title": "Federal Court To Hear Case Against Trump’s ‘Liberation Day’ Tariffs",
    "description": "On the eve of President Donald Trump’s August 1 tariff deadline, a federal appeals court is set to hear arguments from U.S. businesses challenging the legality of his sweeping import taxes. The plaintiffs argue that Trump bypassed Congress when he launched th…",
    "link": "https://biztoc.com/x/f595d945fb368919",
    "timestamp": "2025-07-31T15:05:15Z"
  },
  {
    "title": "Trump Rages At Fed Chair Powell In Blistering Truth Social Post",
    "description": "President Donald Trump lashed out at Federal Reserve Chairman Jerome Powell on Thursday, just one day after the central bank voted 9–2 to hold interest rates steady. \nIn a fiery post on Truth Social, Trump wrote: “Jerome ‘Too Late’ Powell has done it again!!!…",
    "link": "https://biztoc.com/x/ef8603952c07ce9c",
    "timestamp": "2025-07-31T15:05:08Z"
  },
  {
    "title": "Talk of statehood won't feed the people of Gaza",
    "description": "In a move that seems to have caught Donald Trump and Benjamin Netanyahu by surprise, Sir Keir Starmer has sent a clear message to Israel: end the war in Gaza or the UK will recognise Palestine.",
    "link": "https://news.sky.com/story/talk-of-statehood-wont-feed-the-people-of-gaza-13404717",
    "timestamp": "2025-07-31T15:05:00Z"
  },
  {
    "title": "Trump officials spend huge amounts for private parties where 'nobody spits in your face'",
    "description": "Officials and allies of President Donald Trump are dropping hundreds of thousands of dollars to party in private, The Washington Times reported\r\n — all in an effort to avoid “very public confrontations.”“The appeal is having a place where nobody spits in your…",
    "link": "https://www.rawstory.com/trump-cabinet-2673795785/",
    "timestamp": "2025-07-31T15:04:06Z"
  },
  {
    "title": "ICE entices new recruits by promising a $50,000 signing bonus",
    "description": "ICE is hiring thousands with big bonuses. Here's what you need to know.",
    "link": "https://www.wtae.com/article/ice-recruitment-mass-deportations-bonuses/65563787",
    "timestamp": "2025-07-31T15:03:33Z"
  },
  {
    "title": "ICE entices new recruits by promising a $50,000 signing bonus",
    "description": "ICE is hiring thousands with big bonuses. Here's what you need to know.",
    "link": "https://www.wmur.com/article/ice-recruitment-mass-deportations-bonuses/65563787",
    "timestamp": "2025-07-31T15:03:32Z"
  },
  {
    "title": "European Union assumes its faces 15% tariffs in the US from Friday. But a key text still isn't ready",
    "description": "The European Commission says it presumes the United States will impose a 15% tariff on most EU exports from Friday",
    "link": "https://abcnews.go.com/Business/wireStory/european-union-assumes-faces-15-tariffs-us-friday-124247408",
    "timestamp": "2025-07-31T15:02:49Z"
  },
  {
    "title": "Trump envoy arrives in Israel for talks, 58 killed in Gaza seeking aid",
    "description": "Donald Trump's Middle East envoy Steve Witkoff has met Israeli PM Benjamin Netanyahu as international pressure mounts on Israel.",
    "link": "https://www.abc.net.au/news/2025-08-01/trump-s-middle-east-envoy-steve-witkoff-in-israel/105599136",
    "timestamp": "2025-07-31T15:02:11Z"
  },
  {
    "title": "Trump administration to launch private health tracking system to improve records access",
    "description": "Trump administration to launch private health tracking system to improve records accessfirstalert4.com",
    "link": "https://www.firstalert4.com/2025/07/31/trump-administration-launch-private-health-tracking-system-improve-records-access/",
    "timestamp": "2025-07-31T15:02:07Z"
  },
  {
    "title": "Trump Strengthens Corporate Power While Weakening Labor and Public Services",
    "description": "US President Donald Trump returned to the White House in January 2025. Since reclaiming office, he has taken a sharper turn toward economic nationalism, rallying his base with a message of strength and sovereignty. His administration, aggressive and unapologe…",
    "link": "https://www.fairobserver.com/economics/trump-strengthens-corporate-power-while-weakening-labor-and-public-services/",
    "timestamp": "2025-07-31T15:02:05Z"
  },
  {
    "title": "VP Kamala Harris Joins Stephen Colbert for Tonight's \"The Late Show\"",
    "description": "Former Vice President Kamala Harris is returning to the pop culture scene in a very big way. In the past twenty-four hours, VP Harris has shut down speculation that she was considering a run for Governor of California and announced a new book, Simon & Schuste…",
    "link": "https://bleedingcool.com/tv/vp-kamala-harris-joins-stephen-colbert-for-tonights-the-late-show/",
    "timestamp": "2025-07-31T15:02:04Z"
  },
  {
    "title": "Kamala Harris Announces 'Behind-the Scenes' Book on Failed 2024 Campaign",
    "description": "Simon & Schuster described Harris' \"107 Days\" as \"a page-turning account\" filled with \"surprising and revealing insights.\"",
    "link": "https://www.newsweek.com/kamala-harris-memoir-107-days-presidential-campaign-2107051",
    "timestamp": "2025-07-31T15:01:56Z"
  },
  {
    "title": "Congressional Dems Sue After Being Turned Away from ICE Facilities",
    "description": "Over and over again, Democratic members of Congress have attempted to enter Immigration and Customs Enforcement facilities to investigate the conditions inside—and again and again they have been turned away, even though federal law guarantees them access to I…",
    "link": "https://www.motherjones.com/politics/2025/07/congress-immigration-customs-enforcement-facilities-oversight-lawsuit/",
    "timestamp": "2025-07-31T15:01:36Z"
  },
  {
    "title": "Trump administration to launch private health tracking system to improve records access",
    "description": "Trump administration to launch private health tracking system to improve records accesswilx.com",
    "link": "https://www.wilx.com/2025/07/31/trump-administration-launch-private-health-tracking-system-improve-records-access/",
    "timestamp": "2025-07-31T15:00:35Z"
  },
  {
    "title": "India Pauses Russian Crude Oil Purchases",
    "description": "The state refiners in India have not purchased any crude from Russia this week after U.S. President Donald Trump threatened secondary tariffs on the buyers of Russian oil and as discounts of Moscow’s crudes narrowed to alternatives, industry sources with know…",
    "link": "https://oilprice.com/Energy/Crude-Oil/India-Pauses-Russian-Crude-Oil-Purchases.html",
    "timestamp": "2025-07-31T15:00:00Z"
  },
  {
    "title": "CNN’s Harry Enten Says Texas Redistricting Could Make ‘Huge Difference’ For GOP In Midterms",
    "description": "CNN chief data analyst Harry Enten said on Thursday that the recent Texas redistricting effort could lead to Republicans retaining control of the House of Representatives in the 2026 midterm elections. President Donald Trump told reporters on July 15 that he …",
    "link": "https://dailycaller.com/2025/07/31/cnns-harry-enten-says-texas-redistricting-could-make-huge-difference-for-gop-in-midterms/",
    "timestamp": "2025-07-31T14:59:31Z"
  },
  {
    "title": "Why Oil Traders Are Facing Fading Volatility Thanks to Trump Tariffs",
    "description": "The oil market is flatlining.",
    "link": "https://financialpost.com/pmn/business-pmn/why-oil-traders-are-facing-fading-volatility-thanks-to-trump-tariffs",
    "timestamp": "2025-07-31T14:59:29Z"
  },
  {
    "title": "Trump administration to launch private health tracking system to improve records access",
    "description": "Trump administration to launch private health tracking system to improve records accesswabi.tv",
    "link": "https://www.wabi.tv/2025/07/31/trump-administration-launch-private-health-tracking-system-improve-records-access/",
    "timestamp": "2025-07-31T14:59:25Z"
  },
  {
    "title": "DOJ Charging More Than 50 Alleged Anti-ICE Rioters In California, Prosecutor Says",
    "description": "The DOJ has dramatically ramped up prosecutions stemming from anti-deportation riots in central California, a local federal prosecutor said Wednesday.",
    "link": "https://dailycaller.com/2025/07/31/doj-charging-50-alleged-anti-ice-rioters-california/",
    "timestamp": "2025-07-31T14:58:51Z"
  },
  {
    "title": "European Union assumes its faces 15% tariffs in the US from Friday. But a key text still isn’t ready",
    "description": "BRUSSELS (AP) — The European Union is working on the assumption that the United States will impose a 15% tariff on most EU exports from Friday, even though the two sides have yet to complete a key document clarifying how the agreement will operate. Last weeke…",
    "link": "https://financialpost.com/pmn/european-union-assumes-its-faces-15-tariffs-in-the-us-from-friday-but-a-key-text-still-isnt-ready",
    "timestamp": "2025-07-31T14:58:25Z"
  },
  {
    "title": "Final Results",
    "description": "FORESIGHT TECHNOLOGY VCT PLCLEI: 21380013CXOR8N6OD97731 July 2025  Final results31 March 2025  Foresight Technology VCT plc, managed by Foresight Group......",
    "link": "https://www.globenewswire.com/news-release/2025/07/31/3125168/0/en/Final-Results.html",
    "timestamp": "2025-07-31T14:58:00Z"
  },
  {
    "title": "The Latest: US inflation ticked higher last month, as Trump’s latest tariff deadline nears",
    "description": "A key U.S. inflation gauge rose last month, in a sign that President Donald Trump’s broad-based tariffs are starting to lift prices for many goods. Prices rose 2.6% in June compared with a year ago, the Commerce Department said on Thursday, up from an annual …",
    "link": "https://financialpost.com/pmn/the-latest-us-inflation-ticked-higher-last-month-as-trumps-latest-tariff-deadline-nears",
    "timestamp": "2025-07-31T14:56:54Z"
  },
  {
    "title": "Hulk Hogan Died From Heart Attack, Medical Examiner Says",
    "description": "Hulk Hogan's official cause of death has been revealed ... and it was a heart attack. Records from the Pinellas County Forensic Science Center show the 71-year-old Hall of Famer died from acute myocardial infarction, according to the NY Post. The…\n Permalink",
    "link": "https://www.tmz.com/2025/07/31/hulk-hogan-died-heart-attack/",
    "timestamp": "2025-07-31T14:56:11Z"
  },
  {
    "title": "European Union assumes its faces 15% tariffs in the US from Friday. But a key text still isn't ready",
    "description": "The European Union is working on the assumption that the United States will impose a 15% tariff on most EU exports from Friday, even though the two sides...",
    "link": "https://finance.yahoo.com/news/european-union-assumes-faces-15-145514441.html",
    "timestamp": "2025-07-31T14:55:14Z"
  },
  {
    "title": "Opposition slams Trump’s 25% tariff; seeks PM’s response in Parliament",
    "description": "Opposition parties condemned Trump’s new tariffs on India as “unreasonable” and criticised PM Modi’s silence. Rahul Gandhi endorsed Trump’s ‘dead economy’ jibe.",
    "link": "https://www.thehindubusinessline.com/news/national/opposition-slams-trumps-25-tariff-seeks-pms-response-in-parliament/article69878718.ece",
    "timestamp": "2025-07-31T14:54:32Z"
  },
  {
    "title": "Russian missile and drone attack hits Ukrainian capital Kyiv, killing 9 people and wounding 124",
    "description": "Russia fired 309 Shahed and decoy drones, and eight Iskander-K cruise missiles overnight, the Ukrainian air force said.",
    "link": "https://www.bostonherald.com/2025/07/31/russia-drone-missile-attack-kyiv/",
    "timestamp": "2025-07-31T14:54:12Z"
  },
  {
    "title": "Trump has a new plan to supercharge crypto markets",
    "description": "New recommendations from a White House group could boost crypto. Proposals aim to establish clearer rules around trading and oversight of the market.",
    "link": "https://www.businessinsider.com/crypto-white-house-policy-bitcoin-btc-genius-act-trump-2025-7",
    "timestamp": "2025-07-31T14:52:23Z"
  },
  {
    "title": "Trump congratulates Ivy League school after $50M deal to restore federal funding: 'Woke is officially DEAD'",
    "description": "Brown University agrees to shell out $50 million to state workforce development organizations as part of agreement with the U.S. government",
    "link": "https://www.foxnews.com/politics/trump-congratulates-ivy-league-school-after-50m-deal-restore-federal-funding-woke-officially-dead",
    "timestamp": "2025-07-31T14:51:33Z"
  },
  {
    "title": "Estonian defense chief reveals failure of Pentagon meeting",
    "description": "The US did not guarantee a continued troop presence in the Baltic states, according to Hanno Pevkur Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622334-estonia-failed-pentagon-meeting/",
    "timestamp": "2025-07-31T14:50:57Z"
  },
  {
    "title": "Inflation Spikes More Than Expected in Every Indicator That Matters",
    "description": "On the 2024 campaign trail, President Trump promised to “end inflation” and increase affordability, while touting economic proposals widely considered to be at odds with that promise. In April, he dubiously declared victory, saying, “We already solved inflati…",
    "link": "https://newrepublic.com/post/198654/inflation-increase-trump-economy",
    "timestamp": "2025-07-31T14:50:19Z"
  },
  {
    "title": "Trump wants deal to end Russia's war in Ukraine by Aug. 8, US tells UN",
    "description": "UNITED NATIONS (Reuters) -U.S. President Donald Trump has made clear that he wants a deal to end Russia’s war in Ukraine by August 8, the United States told ...",
    "link": "https://www.yahoo.com/news/articles/trump-wants-deal-end-russias-144941287.html",
    "timestamp": "2025-07-31T14:49:41Z"
  },
  {
    "title": "Robinhood outgrows meme frenzy era as retail trading matures",
    "description": "Robinhood's earnings highlight how the app once at the center of the meme-stock mania has evolved into a broader platform to keep retail investors engaged even during market turbulence.The trading platform reported a surge in volumes across equities, options …",
    "link": "https://www.channelnewsasia.com/business/robinhood-outgrows-meme-frenzy-era-retail-trading-matures-5270411",
    "timestamp": "2025-07-31T14:49:28Z"
  },
  {
    "title": "Robinhood outgrows meme frenzy era as retail trading matures",
    "description": "(Reuters) -Robinhood's earnings highlight how the app once at the center of the meme-stock mania has evolved into a broader platform to keep retail investors...",
    "link": "https://finance.yahoo.com/news/robinhood-outgrows-meme-frenzy-era-144928439.html",
    "timestamp": "2025-07-31T14:49:28Z"
  },
  {
    "title": "Trump: Hamas surrender, hostage release is ‘fastest way’ to end Gaza war",
    "description": "President Donald Trump called on Hamas to surrender and release the remaining hostages, saying it would be the \"fastest way\" to end the suffering in Gaza.",
    "link": "https://www.foxnews.com/world/trump-hamas-surrender-hostage-release-fastest-way-end-gaza-war",
    "timestamp": "2025-07-31T14:49:15Z"
  },
  {
    "title": "‘Not how science is supposed to work’: Trump admin. accused of pushing faulty research",
    "description": "The Trump administration was recently accused of releasing a report with misrepresented research. Now, it's happened again, this time on the climate crisis.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/not-science-supposed-work-trump-admin-accused-pushing-faulty-research-rcna222212",
    "timestamp": "2025-07-31T14:47:33Z"
  },
  {
    "title": "Remember Trump's promise to bring down drug prices to impossible levels, to the point where the companies would pay you to take them? Well, starting tomorrow the opposite is going to start happening [Dumbass]",
    "description": "Remember Trump's promise to bring down drug prices to impossible levels, to the point where the companies would pay you to take them? Well, starting tomorrow the opposite is going to start happening",
    "link": "https://www.fark.com/comments/13760626/Remember-Trumps-promise-to-bring-down-drug-prices-to-impossible-levels-to-point-where-companies-would-pay-you-to-take-them-Well-starting-tomorrow-opposite-is-going-to-start-happening",
    "timestamp": "2025-07-31T14:45:45Z"
  },
  {
    "title": "Wife of Marine Corps veteran released from ICE custody after advocacy from GOP Senator’s office",
    "description": "A Marine Corps veteran’s wife has been released from U.S. Immigration and Customs Enforcement detention following advocacy from Sen. John Kennedy, a Louisiana Republican who backs President Donald Trump’s hardline immigration crackdown. Until this week, Mexic…",
    "link": "https://freerepublic.com/focus/f-news/4331833/posts",
    "timestamp": "2025-07-31T14:43:18Z"
  },
  {
    "title": "Small Countries Are Seeking Asylum in Europe",
    "description": "It’s a tough time for the world’s more vulnerable nations—except in the EU’s embrace.",
    "link": "http://foreignpolicy.com/2025/07/31/europe-eu-iceland-switzerland-norway-asylum/",
    "timestamp": "2025-07-31T14:43:16Z"
  },
  {
    "title": "Warren Buffett sounds blunt warning on trade war",
    "description": "Ever since President Donald Trump took office, Americans have grappled with economic uncertainty. \nFor one thing, inflation has been stubbornly elevated, keeping prices high. \nRelated: Warren Buffett has harsh words for stock market investors\nAmericans may ha…",
    "link": "https://biztoc.com/x/c7e7b8b02cc2746f",
    "timestamp": "2025-07-31T14:42:49Z"
  },
  {
    "title": "Trump's tariff on India to do little to upset iPhone manufacturing plans",
    "description": "President Donald Trump's 25% tariffs on Indian goods will do little to slow the role of the Asian country as a key hub for manufacturing iPhones, even when it means more expensive smartphones for U.S. consumers, analysts and industry executives said. Apple ha…",
    "link": "https://freerepublic.com/focus/f-news/4331832/posts",
    "timestamp": "2025-07-31T14:42:03Z"
  },
  {
    "title": "We Now Have Kamala’s Official Excuse For Her 2024 Trainwreck",
    "description": "We now have Kamala Harris's official excuse for her 2024 trainwreck of a campaign.",
    "link": "https://dailycaller.com/2025/07/31/kamala-harris-campaign-book-107-days-election-excuses-donald-trump/",
    "timestamp": "2025-07-31T14:42:00Z"
  },
  {
    "title": "Trump seeks to use Canada’s recognition of Palestinian state as leverage in trade talks",
    "description": "Trump's threat posted early Thursday on his social media network is the latest way he's sought to use his trade war to coerce countries on unrelated issues and a swing from the ambivalence he has expressed about other countries making such a move.",
    "link": "https://www.pbs.org/newshour/politics/trump-seeks-to-use-canadas-recognition-of-palestinian-state-as-leverage-in-trade-talks",
    "timestamp": "2025-07-31T14:41:31Z"
  },
  {
    "title": "Trump lowers expectations of trade deal with Canada as tariff deadline looms",
    "description": "WASHINGTON — U.S. President Donald Trump has dampened expectations of a deal with Canada materializing at the last minute as his tariff deadline looms. In a post on social media early Thursday morning, the president said it will be very hard to make a deal wi…",
    "link": "https://financialpost.com/pmn/trump-lowers-expectations-of-trade-deal-with-canada-as-tariff-deadline-looms",
    "timestamp": "2025-07-31T14:41:31Z"
  },
  {
    "title": "Trump lowers expectations of deal with Canada, gives Mexico 90-day extension",
    "description": "Donald Trump dampened expectations of a deal with Canada materializing at the last minute as his tariff deadline looms. Find out more.",
    "link": "https://financialpost.com/news/trump-lowers-expectations-trade-deal-canada-tariff-deadline-looms",
    "timestamp": "2025-07-31T14:41:31Z"
  },
  {
    "title": "Trump hits Brazil with 50% tariffs and sanctions judge in Bolsonaro case",
    "description": "Donald Trump has stepped up his diplomatic assault on the government of Brazil's left- wing president, Luis Inacio Lula da Silva. He's signed an executive order which brings total tariffs on Brazilian goods to fifty percent. At the same time, the US Treasury …",
    "link": "https://www.bbc.co.uk/programmes/w172zss5zzsy41y",
    "timestamp": "2025-07-31T14:41:00Z"
  },
  {
    "title": "Boeing likely to see more orders as Trump pursues global deals: BofA",
    "description": "Investing.com -- Boeing is poised to benefit from renewed global trade activity under President Donald Trump, according to Bank of America, which reiterated ...",
    "link": "https://finance.yahoo.com/news/boeing-likely-see-more-orders-144005376.html",
    "timestamp": "2025-07-31T14:40:05Z"
  },
  {
    "title": "Two decades of momentum in India-US ties hits road bump",
    "description": "Strategic affairs experts express concern over escalating tensions in India-US relations due to President Trump's tariffs, perceived favoritism towards Pakistan, and pressure on India's ties with Russia. These actions mark a shift from the previously strong b…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/two-decades-of-momentum-in-india-us-ties-hits-road-bump/articleshow/123023725.cms",
    "timestamp": "2025-07-31T14:39:45Z"
  },
  {
    "title": "Pakistan, US Sign Trade Deal To Drill Oil, Boost Market Ties",
    "description": "The US sealed a trade deal with Pakistan as their officials wrapped up talks in Washington, agreeing to develop oil reserves.\n\nThe pact involves a reduction of the so-called reciprocal tariffs, especially on Pakistani exports, according to a statement by Paki…",
    "link": "https://www.ndtvprofit.com/global-economics/pakistan-us-sign-trade-deal-to-drill-oil-boost-market-ties",
    "timestamp": "2025-07-31T14:39:09Z"
  },
  {
    "title": "Jeffrey Epstein's Former Lawyer Slams Food Vendor Refusing Him Service",
    "description": "Alan Dershowitz claims a food vendor refused to serve him for political reasons.",
    "link": "https://www.newsweek.com/alan-dershowitz-epstein-lawyer-sue-food-vendor-2106839",
    "timestamp": "2025-07-31T14:38:57Z"
  },
  {
    "title": "The Bank of Trump",
    "description": "Even if US President Donald Trump doesn’t make good on his threat to fire Federal Reserve Chair Jerome Powell, he will choose Powell’s successor next year, and the nominee is likely to be one who will agree to the sharp interest-rate cuts that Trump craves. W…",
    "link": "https://www.project-syndicate.org/onpoint/the-bank-of-trump",
    "timestamp": "2025-07-31T14:38:22Z"
  },
  {
    "title": "MSNBC Panelist Says Kamala Harris Backed Away From Governor Run Because Democrat Base Doesn’t Want Her",
    "description": "MSNBC panelist Mara Gay said on Thursday that former Vice President Kamala Harris refrained from a gubernatorial run at the behest of the Democratic base.",
    "link": "https://dailycaller.com/2025/07/31/msnbc-mara-gay-kamala-harris-backed-out-of-governor-run-because-democrats-dont-want-her/",
    "timestamp": "2025-07-31T14:38:02Z"
  },
  {
    "title": "The Big Picture",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/the-bank-of-trump-doc-2025-07",
    "timestamp": "2025-07-31T14:37:55Z"
  },
  {
    "title": "Trump To Revive LBJ's 1966 \"Presidential Fitness Test\" - Joe.My.God.",
    "description": "CNN reports: President Donald Trump will be joined by professional athletes on Thursday to sign an executive order that will expand on his council on sports, fitness and nutrition, including by revivi",
    "link": "https://www.joemygod.com/2025/07/trump-to-revive-lbjs-1966-presidential-fitness-test/",
    "timestamp": "2025-07-31T14:37:03Z"
  },
  {
    "title": "End Of $800 Duty-Free Rule Sends Shockwaves Through US Small Businesses",
    "description": "As the calendar turns to August, the impact of Trump's renewed tariff offensive is just beginning to ripple through the U.S. economy.",
    "link": "https://www.ibtimes.com/end-800-duty-free-rule-sends-shockwaves-through-us-small-businesses-3779927",
    "timestamp": "2025-07-31T14:35:16Z"
  },
  {
    "title": "The Loomer administration",
    "description": "It is not great, to me, that an influencer who is nutty even by elite MAGA standards effectively controls personnel at the White House: Back in April, Donald Trump fired a trio of National Security Council officials after meeting with far-right activist Laura…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/the-loomer-administration",
    "timestamp": "2025-07-31T14:33:00Z"
  },
  {
    "title": "US applications for jobless benefits inch up for the first time in 7 weeks, but layoffs remain low",
    "description": "Jobless claims saw a slight increase last week, yet remain at historically low levels, signaling a resilient labor market despite economic uncertainties. While employers continue to retain staff, concerns linger over President Trump's trade policies and their…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-applications-for-jobless-benefits-inch-up-for-the-first-time-in-7-weeks-but-layoffs-remain-low/articleshow/123023609.cms",
    "timestamp": "2025-07-31T14:32:12Z"
  }
]