[
  {
    "title": "South Africa Says Israel 'Acts With Impunity' In Gaza As U.N. Court Hearing Kicks Off",
    "description": "The U.N.'s top court is hearing arguments about whether Israel has violated international law by blocking starving Palestinians from receiving aid.",
    "link": "https://www.huffpost.com/entry/south-africa-israel-impunity-gaza-icj-hearings_n_68113cdbe4b048ed1524442b",
    "timestamp": "2025-04-29T22:29:36Z"
  },
  {
    "title": "'Don't like it': Republican 'concerned' as GOP blocks probe into embattled Trump official",
    "description": "House Speaker Mike Johnson (R-LA) told reporters Tuesday that he would not allow a vote on whether there should be a probe into Defense Secretary Pete Hegseth's mounting Signal scandals. In a vote that same day, Republicans approved a rule that would block De…",
    "link": "https://www.rawstory.com/pete-hegseth-2671865587/",
    "timestamp": "2025-04-29T22:28:58Z"
  },
  {
    "title": "Trump is losing his war on democracy",
    "description": "In the first 100 days of Donald Trump’s second term, his administration has proven exceptionally good at breaking things. The Department of Government Efficiency’s total demolition of USAID, Robert F. Kennedy Jr.’s depopulation of America’s public health agen…",
    "link": "https://www.vox.com/politics/410966/trump-democracy-100-days-losing",
    "timestamp": "2025-04-29T22:28:29Z"
  },
  {
    "title": "Trump diplomats to Turkey, UK confirmed as Houston Rockets owner awaits late Senate vote",
    "description": "On Tuesday, Tom Barrack, Tilman Fertitta and Warren Stephens three of President Trump's top ambassador nominees, faced their Senate confirmation votes.",
    "link": "https://www.foxnews.com/politics/houston-rockets-owner-among-trio-trump-ambassador-nominees-confirmed-senate",
    "timestamp": "2025-04-29T22:27:03Z"
  },
  {
    "title": "New Polling Shows How Many People Hate Trump’s First 100 Days. What About the Next Thousand?",
    "description": "The president’s chaos “is bringing a whole host of folks who weren’t necessarily with us three months ago into this chorus of resistance,” the DNC chair tells VF. The question for Democrats now is how to keep the chorus singing.",
    "link": "https://www.vanityfair.com/news/story/new-polling-shows-how-many-people-hate-trumps-first-100-days",
    "timestamp": "2025-04-29T22:26:35Z"
  },
  {
    "title": "Rep. Anna Paulina Luna plans to put DOGE actions into law",
    "description": "Savings from Trump's efficiency agenda could become permanent",
    "link": "https://www.wnd.com/2025/04/rep-anna-paulina-luna-plans-to-put-doge-actions-into-law/",
    "timestamp": "2025-04-29T22:26:34Z"
  },
  {
    "title": "‘We Are Just Getting Started’: Trump Analyzes His First 100 Days",
    "description": "President Donald Trump declared it the “most successful 100 days” in American history. “They all want to come back to Michigan and build cars again. You... Read More\nThe post ‘We Are Just Getting Started’: Trump Analyzes His First 100 Days appeared first on T…",
    "link": "https://www.dailysignal.com/2025/04/29/we-are-just-getting-started-trump-analyzes-his-first-100-days/",
    "timestamp": "2025-04-29T22:26:31Z"
  },
  {
    "title": "Michelle Obama Admits That Trump Still 'Keeps Her Up' at Night: 'Frightens Me'",
    "description": "Former first lady Michelle Obama said Monday that President Donald Trump's immigration policies \"keep her up at night.\"",
    "link": "https://www.westernjournal.com/michelle-obama-admits-trump-still-keeps-night-frightens/",
    "timestamp": "2025-04-29T22:23:58Z"
  },
  {
    "title": "Trump: We're just getting started",
    "description": "United States President Donald Trump told his supporters that his administration was \"just getting started,\" as he took the stage in Michigan for his rally marking 100 days as president.\n&q...",
    "link": "https://biztoc.com/x/d22987c506eb99f2",
    "timestamp": "2025-04-29T22:21:36Z"
  },
  {
    "title": "Trump mocks new impeachment talk at rally",
    "description": "United States President Donald Trump held a rally in Warren, Michigan, to mark his first 100 days in office. He criticized Democratic efforts to impeach him, mocking Michigan Representative John James...",
    "link": "https://biztoc.com/x/9bfaa0431df1222b",
    "timestamp": "2025-04-29T22:21:27Z"
  },
  {
    "title": "Bessent says US will weigh China's failure on 'phase one' trade deal from first term in negotiations",
    "description": "Treasury Secretary Scott Bessent said Tuesday the Trump administration will take into account China's lack of compliance with a trade deal from the president's first term when it finalizes a new trade deal.\nBessent was interviewed on FOX Business Network's \"K…",
    "link": "https://biztoc.com/x/ea666c843e3f1931",
    "timestamp": "2025-04-29T22:21:21Z"
  },
  {
    "title": "Amazon denies tariff price display plan after White House calls it ‘hostile act’",
    "description": "Amazon clarified that only its Haul division, which targets low-cost shoppers, briefly considered showing tariff-related price breakdowns on select Chinese imports before shelving the idea",
    "link": "https://www.thehindubusinessline.com/news/amazon-denies-tariff-price-display-plan-after-white-house-calls-it-hostile-act/article69506950.ece",
    "timestamp": "2025-04-29T22:16:30Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Stocks closed higher on Tuesday, propelled by investors' hopes for a trade deal.",
    "link": "https://www.cnbc.com/2025/04/29/stock-market-today-live-updates.html",
    "timestamp": "2025-04-29T22:16:11Z"
  },
  {
    "title": "New Poll Says Over Half of REPUBLICANS Want Democratic Officials to Push Hard Against Trump’s Policies",
    "description": "A new Pew Research Center poll elicited interesting responses when asking what Americans thought about Democratic elected officials battling against President Donald Trump's policies. It's expected that Democrats would want that, but a surprising number of Re…",
    "link": "https://www.mediaite.com/trump/new-poll-says-over-half-of-republicans-want-democratic-officials-to-push-hard-against-trumps-policies/",
    "timestamp": "2025-04-29T22:15:13Z"
  },
  {
    "title": "Elizabeth Warren Marks 100 Days Of Trump By Reading Aloud 100 Reports Of His Corruption (Jennifer Bendery/HuffPost)",
    "description": "Jennifer Bendery / HuffPost:\nElizabeth Warren Marks 100 Days Of Trump By Reading Aloud 100 Reports Of His Corruption  —  The Massachusetts senator plans to read into the congressional record dozens of cases of Trump using the presidency to benefit himself per…",
    "link": "https://www.memeorandum.com/250429/p136",
    "timestamp": "2025-04-29T22:15:01Z"
  },
  {
    "title": "The hidden danger in Trump’s trade war",
    "description": "When it comes to the escalating trade war with China, the most obvious historical analogy for the US launching an all-out economic assault on a rising military power in East Asia is not an encouraging one.  Starting in 1940, the US, alarmed by Imperial Japan’…",
    "link": "https://www.vox.com/world-politics/410931/trump-tariff-war-cold-war",
    "timestamp": "2025-04-29T22:14:58Z"
  },
  {
    "title": "As U.S. foreign aid drops, United Nations agencies that provide aid worldwide slash jobs or cut costs",
    "description": "Officials are pointing to funding reductions mainly from the United States and warning that vital relief programs will be severely affected as a result.",
    "link": "https://www.pbs.org/newshour/world/as-u-s-foreign-aid-drops-united-nations-agencies-that-provide-aid-worldwide-slash-jobs-or-cut-costs",
    "timestamp": "2025-04-29T22:14:06Z"
  },
  {
    "title": "James Carville outlines 'winning message' for Democrats, stands by Trump-Hitler comparisons",
    "description": "Strategist James Carville explains how Democrats can win back support from voters and stands by his comments equating President Donald Trump to Hitler on 'The Will Cain Show.'",
    "link": "https://www.foxnews.com/media/james-carville-outlines-winning-message-democrats-stands-trump-hitler-comparisons",
    "timestamp": "2025-04-29T22:13:24Z"
  },
  {
    "title": "White House Announces Number of Illegal Immigrant Registrations",
    "description": "The Alien Registration Requirement calls for all undocumented immigrants to notify the government of their presence.",
    "link": "https://www.newsweek.com/alien-registration-requirement-trump-administration-update-2065873",
    "timestamp": "2025-04-29T22:13:23Z"
  },
  {
    "title": "Doug Emhoff lashes out after Trump removes him from Holocaust Memorial Council",
    "description": "Former Second Gentleman Doug Emhoff lashed out at the Trump administration, accusing it of politicizing the Holocaust and dishonoring the memory of six million murdered Jews after he was removed from the United States Holocaust Memorial Council.",
    "link": "https://www.foxnews.com/politics/doug-emhoff-lashes-out-after-trump-removes-him-from-holocaust-memorial-council",
    "timestamp": "2025-04-29T22:13:14Z"
  },
  {
    "title": "Donald Trump Somehow Made the Eagles’ White House Visit About Taylor Swift - Rolling Stone",
    "description": "Donald Trump Somehow Made the Eagles’ White House Visit About Taylor SwiftRolling Stone Jalen Hurts misses Eagles’ White House celebrations while Trump backs the ‘tush push’CNN Super Bowl champion CJ Gardner-Johnson explains decision to skip Eagles White Hous…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177211425",
    "timestamp": "2025-04-29T22:12:09Z"
  },
  {
    "title": "Banned form of torture back in the spotlight — this time, as a TikTok challenge: ‘I nearly died’",
    "description": "Waterboarding is a form of torture that causes a person to feel as though they are drowning, nearly causing suffocation — it's banned by international law.",
    "link": "https://nypost.com/2025/04/29/lifestyle/waterboarding-is-back-revived-as-a-dangerous-tiktok-trend/",
    "timestamp": "2025-04-29T22:10:42Z"
  },
  {
    "title": "Trump pushes back against economic anxieties in ABC interview, says China 'probably will eat those tariffs' (Lucien Bruggeman/ABC News)",
    "description": "Lucien Bruggeman / ABC News:\nTrump pushes back against economic anxieties in ABC interview, says China ‘probably will eat those tariffs’  —  Trump discussed a wide range of topics with ABC News' Terry Moran.  —  ABC News Exclusive: President Donald J. Trump s…",
    "link": "https://www.memeorandum.com/250429/p131",
    "timestamp": "2025-04-29T22:10:01Z"
  },
  {
    "title": "Alexandria Beats Earning Estimates but Reports Quarterly Net Lost",
    "description": "Alexandria Real Estate Equities exceeded earnings expectations in the first quarter and is projecting future growth for its life sciences portfolio despite economic uncertainties under the Trump administration.   The Pasadena, Calif.-based real estate investm…",
    "link": "http://commercialobserver.com/2025/04/alexandria-earnings-life-science-nih-trump/",
    "timestamp": "2025-04-29T22:09:52Z"
  },
  {
    "title": "The people versus Meghan Markle? Backlash over latest podcast interview sparks controversy",
    "description": "In an attempt to redefine her public image and reconnect with audiences, Meghan Markle recently took a vulnerable step forward on her podcast, &quot;Confessions of a Female Founder",
    "link": "https://www.marca.com/en/lifestyle/uk-news/2025/04/30/68114dc9268e3eed288b457f.html",
    "timestamp": "2025-04-29T22:09:42Z"
  },
  {
    "title": "Trump administration tells Congress it plans to label Haitian gangs as foreign terror organizations",
    "description": "The State Department had similarly labeled eight Latin American crime organizations.",
    "link": "https://www.bostonherald.com/2025/04/29/trump-haitian-gangs/",
    "timestamp": "2025-04-29T22:09:14Z"
  },
  {
    "title": "Trump eases auto tariffs burden as Lutnick touts one done foreign trade deal",
    "description": "WASHINGTON/DETROIT (Reuters) -U.S. President Donald Trump signed an order to soften the blow of his auto tariffs on Tuesday with a mix of credits and relief from other levies on materials, and his trade team touted its first deal with a foreign trading partne…",
    "link": "https://www.thestar.com.my/news/world/2025/04/30/trump-eases-auto-tariffs-burden-as-lutnick-touts-one-done-foreign-trade-deal",
    "timestamp": "2025-04-29T22:08:00Z"
  },
  {
    "title": "'We want to trade': Vietnam's future caught between the US and China again",
    "description": "The South East Asian country is on a path to prosperity, 50 years after the end of the Vietnam War.",
    "link": "https://www.bbc.com/news/articles/cjewggl0yqeo",
    "timestamp": "2025-04-29T22:07:34Z"
  },
  {
    "title": "Trump congratulates Canada's Carney as they agree to meet in 'near future'",
    "description": "US President Donald Trump and Prime Minister Mark Carney spoke after Canada's general election.",
    "link": "https://www.bbc.com/news/articles/cwy6lg3p7ero",
    "timestamp": "2025-04-29T22:05:32Z"
  },
  {
    "title": "Trump rolls back reporting rules for self-driving car crashes in gift to Musk",
    "description": "The Transportation Department has announced that it’s rescinding a rule that required automakers to report crash data on self-driving cars, in a move that Elon Musk has been pushing for.",
    "link": "https://www.msnbc.com/top-stories/latest/elon-musk-tesla-self-driving-car-crashes-reporting-rule-transportation-rcna203583",
    "timestamp": "2025-04-29T22:05:21Z"
  },
  {
    "title": "Trump's tariffs loom over the economy as shipments from China fall",
    "description": "American businesses are cancelling orders from China, postponing expansion plans and hunkering down to see what trade policy surprises President Donald Trump plans to spring on them next.",
    "link": "https://www.news4jax.com/news/politics/2025/04/29/trumps-tariffs-loom-over-the-economy-as-shipments-from-china-fall/",
    "timestamp": "2025-04-29T22:04:08Z"
  },
  {
    "title": "Trump's tariffs loom over the economy as shipments from China fall",
    "description": "American businesses are cancelling orders from China, postponing expansion plans and hunkering down to see what trade policy surprises President Donald Trump plans to spring on them next.",
    "link": "https://www.ksat.com/news/politics/2025/04/29/trumps-tariffs-loom-over-the-economy-as-shipments-from-china-fall/",
    "timestamp": "2025-04-29T22:04:08Z"
  },
  {
    "title": "Judge orders Trump administration to restore $12 million for pro-democracy Radio Free Europe",
    "description": "The judge found that the administration could not unilaterally revoke funding approved by by Congress.",
    "link": "https://www.bostonherald.com/2025/04/29/radio-free-europe/",
    "timestamp": "2025-04-29T22:04:02Z"
  },
  {
    "title": "Watch Live: Donald Trump Holds Rally Celebrating First 100 Days",
    "description": "President Donald Trump holds a rally in Macomb County, Michigan, celebrating the first 100 days of his second term on Tuesday, April 29.\nThe post Watch Live: Donald Trump Holds Rally Celebrating First 100 Days appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/29/watch-live-donald-trump-holds-rally-celebrating-first-100-days/",
    "timestamp": "2025-04-29T22:03:26Z"
  },
  {
    "title": "Trump changes tune on Amazon after phone call with owner Jeff Bezos",
    "description": "The online giant Amazon briefly faced the full wrath of US President Donald Trump over reported plans to show its customers just how much Trump's tariffs...",
    "link": "https://www.yahoo.com/news/trump-changes-tune-amazon-phone-220237713.html",
    "timestamp": "2025-04-29T22:02:37Z"
  },
  {
    "title": "Former Mumford and Sons musician asks White House if Brits punished over free speech can seek asylum in US",
    "description": "Former Mumford & Sons musician asked the White House if the Trump administration would give \"political asylum\" to UK citizens who are being prosecuted for their speech.",
    "link": "https://www.foxnews.com/media/former-mumford-sons-musician-asks-white-house-brits-punished-over-free-speech-can-seek-asylum-us",
    "timestamp": "2025-04-29T22:00:06Z"
  },
  {
    "title": "Commentary: Trump's second presidency - 100 days down, another 1,361 to go",
    "description": "With a chaotic start to Donald Trump’s second term, the United States has shown its interests are unlikely to overlap with Southeast Asia’s, says Kevin Chen from the S Rajaratnam School of International Studies.",
    "link": "https://www.channelnewsasia.com/commentary/donald-trump-100-days-office-southeast-asia-5096766",
    "timestamp": "2025-04-29T22:00:00Z"
  },
  {
    "title": "Why cutting red tape is so difficult – Richard Prebble",
    "description": "OPINION: The preschool review is a template but it is too little and takes too long.",
    "link": "https://www.nzherald.co.nz/business/economy/why-cutting-red-tape-is-so-difficult-richard-prebble/PGWTTGGQRBDZ5GWQYAWWLARE5Y/",
    "timestamp": "2025-04-29T22:00:00Z"
  },
  {
    "title": "“In case of emergency, break open a book.”",
    "description": "From the daily newsletter: looking for sense and solace in Trump 2.0. Plus: the bureaucratic nightmare of being trans right now; and “The Great Gatsby” turns one hundred.",
    "link": "https://www.newyorker.com/newsletter/the-daily/in-case-of-emergency-break-open-a-book",
    "timestamp": "2025-04-29T22:00:00Z"
  },
  {
    "title": "U.N. refugee agency to close four offices in Mexico amid funding crunch",
    "description": "MEXICO CITY (Reuters) -The U.N. refugee agency in Mexico has closed four offices in the country and laid off 190 people due to the \"serious funding crisis\" facing the agency, the head of UNHCR in Mexico said on Tuesday, after U.S. President Donald Trump slash…",
    "link": "https://www.thestar.com.my/news/world/2025/04/30/un-refugee-agency-to-close-four-offices-in-mexico-amid-funding-crunch",
    "timestamp": "2025-04-29T22:00:00Z"
  },
  {
    "title": "Trump SIDELINES ‘Fake News Thugs’ David Muir and George Stephanopoulos For Primetime Sit-Down Interview",
    "description": "Donald Trump did not wanted to be interviewed by David Muir or George Stephanopoulos for his prime-time interview, following his rough past with the anchors.",
    "link": "https://radaronline.com/p/trump-david-muir-george-stephanopoulos-primetime-interview-fake/",
    "timestamp": "2025-04-29T22:00:00Z"
  },
  {
    "title": "Trump eases auto tariffs with new credits amid investor concerns",
    "description": "The move, timed with a trip to Michigan and days before a 25% tariff on auto parts was set to take effect, aims to calm market and industry anxieties",
    "link": "https://www.thehindubusinessline.com/news/world/trump-eases-auto-tariffs-with-new-credits-amid-investor-concerns/article69506941.ece",
    "timestamp": "2025-04-29T21:58:39Z"
  },
  {
    "title": "California sent investigators to ICE facilities. They found more detainees, and health care gaps",
    "description": "A California law empowers state investigators to check on conditions at ICE detention centers. A new report raises concerns about health care inside them.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/04/29/california-sent-investigators-to-ice-facilities-they-found-more-detainees-and-health-care-gaps",
    "timestamp": "2025-04-29T21:57:26Z"
  },
  {
    "title": "Trump’s first 100 days have been felt across Massachusetts",
    "description": "Here are some of the actions taken by President Trump or his administration during these first few months that directly affect Massachusetts.",
    "link": "https://www.bostonherald.com/2025/04/29/trumps-first-100-days-have-been-felt-across-massachusetts/",
    "timestamp": "2025-04-29T21:56:22Z"
  },
  {
    "title": "Milwaukee County Judge Dugan defense, conservative joins legal team",
    "description": "The legal defense team for Milwaukee County Judge Dugan now includes an attorney who President Trump once considered for a U.S. Supreme Court seat.",
    "link": "https://www.fox6now.com/news/milwaukee-judge-dugan-arrest-legal-team",
    "timestamp": "2025-04-29T21:56:10Z"
  },
  {
    "title": "Trump fires Kamala Harris’ husband Doug Emhoff from Holocaust Museum board",
    "description": "Emhoff, the husband of former Vice President Kamala Harris, was among several Biden administration appointments to the board removed by President Trump.",
    "link": "https://nypost.com/2025/04/29/us-news/trump-fires-kamala-harris-husband-doug-emhoff-from-holocaust-museum-board/",
    "timestamp": "2025-04-29T21:55:08Z"
  },
  {
    "title": "Trump fires Doug Emhoff and other Biden appointees from Holocaust Museum board",
    "description": "President Donald Trump has fired former second gentleman Doug Emhoff from the board that oversees the Holocaust Museum.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-doug-emhoff-holocaust-museum-rcna203607",
    "timestamp": "2025-04-29T21:53:40Z"
  },
  {
    "title": "'Failure is not an option': Conservatives warn tariff chaos could doom GOP in 2026",
    "description": "President Donald Trump is gambling the Republican majorities on a risky move that has many conservatives nervous outside the administration.The president promised Americans on his first day back in office that he would quickly bring down prices and stabilize …",
    "link": "https://www.rawstory.com/trump-republican-congressional-majority/",
    "timestamp": "2025-04-29T21:53:04Z"
  },
  {
    "title": "Rachel Maddow Calls Trump’s 170-Mile U.S. Border-Mexico Military Base a ‘Big Red Flag’ of ‘Authoritarian Takeover’ | Video",
    "description": "\"When you've got U.S. troops searching and arresting people and doing 'crowd control' on U.S. soil, you're kind of there,\" the MSNBC anchor states\nThe post Rachel Maddow Calls Trump’s 170-Mile U.S. Border-Mexico Military Base a ‘Big Red Flag’ of ‘Authoritaria…",
    "link": "https://www.thewrap.com/rachel-maddow-us-mexico-border-military-base-msnbc/",
    "timestamp": "2025-04-29T21:52:43Z"
  },
  {
    "title": "Fox News Politics: 100 Days of Court-ing Conflict",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-100-days-court-ing-conflict",
    "timestamp": "2025-04-29T21:52:39Z"
  },
  {
    "title": "‘Flagrant violations’: Pam Bondi asked to investigate state for violating 2nd Amendment",
    "description": "New plan is 'a deliberate attempt to disarm law-abiding' citizens",
    "link": "https://www.wnd.com/2025/04/flagrant-violations-pam-bondi-asked-to-investigate-state-for-violating-2nd-amendment/",
    "timestamp": "2025-04-29T21:52:18Z"
  },
  {
    "title": "Trump boots climate scientists from climate science report",
    "description": "Welcome to The Logoff: The Trump administration dismissed hundreds of scientists this week who were working on a major report on climate change, part of an effort to obscure a scientific reality that’s at odds with the administration’s agenda. What’s the repo…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/411048/trump-national-climate-assessment-scientists",
    "timestamp": "2025-04-29T21:51:56Z"
  },
  {
    "title": "Gadgets Are Getting More Expensive, But Not Even Amazon Wants to Say ‘Tariffs’",
    "description": "Amazon won't show you tariff-inflated prices, but you should assume going forward that most tech costs more.",
    "link": "https://gizmodo.com/gadgets-are-getting-more-expensive-but-not-even-amazon-wants-to-say-tariffs-2000596083",
    "timestamp": "2025-04-29T21:50:05Z"
  },
  {
    "title": "State cuts impact Johnson County Health Department services",
    "description": "Johnson County health department director postpones new services due to state lawmakers cutting tens of millions of dollars in funding.",
    "link": "https://www.wishtv.com/news/politics/health-department-cuts-indiana/",
    "timestamp": "2025-04-29T21:49:29Z"
  },
  {
    "title": "US threatens to quit Russia-Ukraine effort unless 'concrete proposals'",
    "description": "Secretary of State Marco Rubio warned Tuesday that the United States would end mediation unless Russia and Ukraine put forward \"concrete proposals,\" as US...",
    "link": "https://www.yahoo.com/news/us-threatens-quit-russia-ukraine-203420920.html",
    "timestamp": "2025-04-29T21:48:14Z"
  },
  {
    "title": "Amazon not planning to break out tariff costs online as White House attacks potential move",
    "description": "Amazon says it's not planning to display added tariff costs next to product prices on its site — despite a report that sparked speculation the e-commerce giant would soon show the new import charges, and the White House's fiery comments denouncing the purport…",
    "link": "https://japantoday.com/category/business/amazon-is-not-planning-to-break-out-tariff-costs-online-as-white-house-attacks-potential-move",
    "timestamp": "2025-04-29T21:47:48Z"
  },
  {
    "title": "Adidas warns U.S. tariffs to push up prices",
    "description": "German sportswear giant adidas on Tuesday warned that U.S. President Donald Trump's tariffs will increase prices for its products in the United States, and the hardline trade policies could dent its ongoing recovery. The firm makes a large chunk of its goods …",
    "link": "https://japantoday.com/category/business/adidas-warns-us-tariffs-to-push-up-prices",
    "timestamp": "2025-04-29T21:47:04Z"
  },
  {
    "title": "Kellogg calls Russia’s three-day ceasefire proposal ‘absurd’",
    "description": "Retired Lt. Gen. Keith Kellogg, President Trump’s special envoy to Ukraine, called the Russian proposal for a three-day ceasefire next week “absurd” and said the U.S. wants a more lasting peace deal in Ukraine. “A three-day ceasefire is absurd. What the presi…",
    "link": "https://freerepublic.com/focus/f-chat/4314059/posts",
    "timestamp": "2025-04-29T21:46:58Z"
  },
  {
    "title": "Trump eases auto tariffs burden as Lutnick touts one done foreign trade deal",
    "description": "U.S. President Donald Trump signed an order to soften the blow of his auto tariffs on Tuesday with a mix of credits and relief from other levies on materials, and his trade team touted its first deal with a foreign trading partner, developments that eased inv…",
    "link": "https://japantoday.com/category/business/trump-eases-auto-tariffs-burden-as-lutnick-touts-one-done-foreign-trade-deal",
    "timestamp": "2025-04-29T21:46:48Z"
  },
  {
    "title": "Vulnerable House Dem ripped for 'flip flopping' on key Trump policy supported by union she backs",
    "description": "The NRCC is slamming vulnerable Dem. Rep. Marcy Kaptur over her past praise of tariffs and accusing her of changing her tune on the issue due to \"Trump derangement syndrome.\"",
    "link": "https://www.foxnews.com/politics/vulnerable-house-dem-ripped-flip-flopping-key-trump-policy-supported-by-union-she-backs",
    "timestamp": "2025-04-29T21:46:39Z"
  },
  {
    "title": "Trump’s Ranting Can’t Change His Polling Numbers",
    "description": "The president is eager to shoot the messenger. But his real problem is the numbers themselves.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/04/trump-polling-numbers-ranting/682646/",
    "timestamp": "2025-04-29T21:46:00Z"
  },
  {
    "title": "Republicans Consider Change to Medicaid: What We Know",
    "description": "The GOP proposal, part of a broader effort to fund President Trump's domestic agenda, would impose per capita caps on Medicaid.",
    "link": "https://www.newsweek.com/republicans-consider-change-medicaid-2065866",
    "timestamp": "2025-04-29T21:45:39Z"
  },
  {
    "title": "Whitmer greets Trump at Selflridge, President says ‘she’s done a very good job'",
    "description": "Michigan Governor Gretchen Whitmer and President Donald Trump set aside differences to announces new fighter jets at Selfridge Air National Guard Base.",
    "link": "https://www.fox2detroit.com/news/whitmer-greets-trump-selflridge-president-says-shes-done-very-good-job",
    "timestamp": "2025-04-29T21:45:36Z"
  },
  {
    "title": "The Canadian economy goes “elbows up”",
    "description": "After declaring victory in yesterday’s Canadian election, Prime Minister Mark Carney said the “old relationship” with the United States is over. Over the past few months, President Donald Trump’s on-and-off tariffs and repeated annexation threats have caused …",
    "link": "https://www.marketplace.org/episode/2025/04/29/the-canadian-economy-goes-elbows-up",
    "timestamp": "2025-04-29T21:45:00Z"
  },
  {
    "title": "Japan, Philippines to start talks on 2 defense pacts in the face of China's growing aggression",
    "description": "Japanese Prime Minister Shigeru Ishiba said Tuesday that his country and the Philippines would start talks on two proposed defense pacts to further boost their security alliance and would continue to fight aggression in disputed Asian waters in an obvious reb…",
    "link": "https://japantoday.com/category/politics/Japan-and-Philippines-to-start-talks-on-2-defense-pacts-in-face-of-China%27s-growing-aggression",
    "timestamp": "2025-04-29T21:43:56Z"
  },
  {
    "title": "Trump Should Not Give Israel a Pass on Gaza Blockade",
    "description": "By doing so, he makes Palestinian suffering U.S. policy.",
    "link": "http://foreignpolicy.com/2025/04/29/trump-israel-gaza-blockade-proposal-humanitarian-aid/",
    "timestamp": "2025-04-29T21:43:35Z"
  },
  {
    "title": "Disgraced ex-Rep. George Santos wants Trump pardon, claims he was politically targeted over being a ‘gay Republican’ in Dem district",
    "description": "Disgraced ex-Rep. George Santos wants a pardon from President Trump -- days after he was handed a seven-year sentence behind bars.",
    "link": "https://nypost.com/2025/04/29/us-news/disgraced-ex-rep-george-santos-wants-trump-pardon-after-wire-fraud-id-theft-charges/",
    "timestamp": "2025-04-29T21:43:12Z"
  },
  {
    "title": "Hegseth boasts about ending 'woke' program on women and security that Trump had signed into law",
    "description": "U.S. Defense Secretary Pete Hegseth boasted on social media Tuesday that he had dismantled a program supporting women on security teams — and may not have realized the program he tried to break was not a Biden-era initiative but instead a celebrated program s…",
    "link": "https://japantoday.com/category/world/hegseth-boasts-about-ending-%27woke%27-program-on-women-and-security-that-trump-had-signed-into-law",
    "timestamp": "2025-04-29T21:43:04Z"
  },
  {
    "title": "Take It Down Act, addressing nonconsensual deepfakes and 'revenge porn,' passes",
    "description": "Congress has overwhelmingly approved bipartisan legislation to enact stricter penalties for the distribution of non-consensual intimate imagery, sometimes called “revenge porn.” Known as the Take It Down Act, the bill is now headed to President Donald Trump’s…",
    "link": "https://japantoday.com/category/world/take-it-down-act-addressing-nonconsensual-deepfakes-and-%27revenge-porn-%27-passes.-what-is-it",
    "timestamp": "2025-04-29T21:42:42Z"
  },
  {
    "title": "AmeriCorps cuts prompt two dozen states to sue Trump administration",
    "description": "About two dozen states have sued the Trump administration over the dismantling of AmeriCorps",
    "link": "https://abcnews.go.com/US/wireStory/americorps-cuts-prompt-dozen-states-sue-trump-administration-121291050",
    "timestamp": "2025-04-29T21:42:27Z"
  },
  {
    "title": "India gives army 'operational freedom' to respond to Kashmir attack",
    "description": "Indian Prime Minister Narendra Modi has given the military &quot;operational freedom&quot; to respond to a deadly attack in Kashmir that New Delhi has blamed on arch-rival Pakistan, a senior government source told AFP Tuesday. A week after the deadliest attac…",
    "link": "https://japantoday.com/category/world/pakistan-says-it-shot-down-indian-drone-along-kashmir-border",
    "timestamp": "2025-04-29T21:42:19Z"
  },
  {
    "title": "Saquon Barkley Scoffs At Criticism Over His Golf Outing With Trump — But He's Missing 1 Point",
    "description": "The Eagles star faced backlash for his time with the president. One expert explains why his response missed the mark.",
    "link": "https://www.huffpost.com/entry/saquon-barkley-donald-trump-golf-criticism_n_6810fc51e4b0b1eab34a71a6",
    "timestamp": "2025-04-29T21:42:15Z"
  },
  {
    "title": "Trump fires Doug Emhoff, other Biden appointees from U.S. Holocaust Memorial Council",
    "description": "Jewish Democrats 'condemn Donald Trump for once again using Jewish Americans for his political agenda'",
    "link": "https://www.haaretz.com/us-news/2025-04-30/ty-article/trump-fires-doug-emhoff-other-biden-appointees-from-u-s-holocaust-memorial-council/00000196-8369-d22a-a3de-b37d82810000",
    "timestamp": "2025-04-29T21:42:14Z"
  },
  {
    "title": "The signs Prince William is being groomed now to be the next King of England: ‘Up there with the big boys’",
    "description": "\"He's got a lot on his plate ... and I feel very anxious for him — he has small children and all the things he has to do as the Prince of Wales,\" said royal insider Hugo Vickers of Prince William.",
    "link": "https://pagesix.com/2025/04/29/royal-family/prince-william-is-being-groomed-as-the-next-king-of-england/",
    "timestamp": "2025-04-29T21:42:14Z"
  },
  {
    "title": "BRICS members blast rise of 'trade protectionism'",
    "description": "China, Brazil and other members of the BRICS grouping on Tuesday slammed the &quot;resurgence of trade protectionism&quot; at a meeting in Rio de Janeiro dominated by U.S. President Donald Trump's tariffs blitz. Chinese Foreign Minister Wang Yi and his Russia…",
    "link": "https://japantoday.com/category/world/brics-members-blast-rise-of-%27trade-protectionism%27",
    "timestamp": "2025-04-29T21:42:04Z"
  },
  {
    "title": "Nearly half of Israelis back Iran strike without US support",
    "description": "Among Jewish Israelis, 52% support a strike compared to 34.5% who oppose it. In contrast, 76% of Arab Israelis oppose military action against Iran, with just 9% in support.",
    "link": "https://www.jpost.com/israel-news/article-852033",
    "timestamp": "2025-04-29T21:42:03Z"
  },
  {
    "title": "Trump Media's Truth Social Considers Launching Crypto Token, Wallet",
    "description": "Truth Social, the social network of President Trump's Trump Media & Technology Group, is considering launching a crypto token.",
    "link": "https://decrypt.co/316956/trump-media-truth-social-crypto-token-wallet",
    "timestamp": "2025-04-29T21:41:50Z"
  },
  {
    "title": "Ukraine says Russia hits civilians again as Kyiv derides Putin's 3-day truce offer",
    "description": "Russia struck civilian areas of Ukraine with drones in another deadly nighttime attack, officials said Tuesday, as Kyiv officials dismissed Russian President Vladimir Putin’s declaration of a unilateral 72-hour ceasefire next week as an attempt “to deceive th…",
    "link": "https://japantoday.com/category/world/ukraine-says-russia-hits-civilians-again-as-kyiv-derides-putin%27s-3-day-truce-offer",
    "timestamp": "2025-04-29T21:41:38Z"
  },
  {
    "title": "Multiple challenges await Canada's Carney",
    "description": "Canadian Prime Minister Mark Carney celebrated election victory on Tuesday, but he admits &quot;daunting&quot; challenges await, including handling Donald Trump and reshaping the economy. &quot;There is going to be a very short honeymoon,&quot; Marci Surkes, …",
    "link": "https://japantoday.com/category/world/multiple-challenges-await-canada%27s-carney",
    "timestamp": "2025-04-29T21:41:23Z"
  },
  {
    "title": "US stocks rally as Trump tempers auto tariffs",
    "description": "NEW YORK: Wall Street stocks rose Tuesday (Apr 29) as markets digested mixed earnings while applauding a move by President Donald Trump to ease tariffs on automakers. T",
    "link": "https://www.channelnewsasia.com/business/us-stocks-rally-trump-tempers-auto-tariffs-5098316",
    "timestamp": "2025-04-29T21:41:00Z"
  },
  {
    "title": "Visas restored for VCU students who had lost their status",
    "description": "The government had revoked visas of more than 1,200 international students at colleges throughout the country, including at the UVa and Virginia Tech.",
    "link": "https://richmond.com/news/local/education/higher-education/article_67e3168c-9558-498b-8e69-433d8b19c995.html",
    "timestamp": "2025-04-29T21:41:00Z"
  },
  {
    "title": "'Rubber meets the road': Project 2025 architect warns 'boiling point' coming in Trump 2.0",
    "description": "Tuesday marks President Donald Trump's first 100 days in office, and one organizer for \"Project 2025\" knows what he needs going forward. NBC News described it as \"undoing liberal gains dating back to Franklin D. Roosevelt.\"But the man who led the effort to pr…",
    "link": "https://www.rawstory.com/project-2025-2671865306/",
    "timestamp": "2025-04-29T21:40:55Z"
  },
  {
    "title": "Stablecoin, crypto market structure legislation slated for approval by August – Bo Hines",
    "description": "President Donald Trump’s administration aims to finalize stablecoin and crypto market structure legislation before the August 2025 congressional recess, according to Bo Hines, executive director of the President’s Council of Advisors on Digital Assets.  In a …",
    "link": "https://cryptoslate.com/stablecoin-crypto-market-structure-legislation-slated-for-approval-by-august-bo-hines/",
    "timestamp": "2025-04-29T21:40:13Z"
  },
  {
    "title": "Trump's Truth Social Mulls Launching Token for Subscriptions in Latest Crypto Push",
    "description": "The company also plans to forge ahead with its ETFs, which will include cryptocurrencies.",
    "link": "https://www.coindesk.com/business/2025/04/29/trump-s-truth-social-mulls-launching-token-for-subscriptions-in-further-crypto-push",
    "timestamp": "2025-04-29T21:39:38Z"
  },
  {
    "title": "Nasdaq Seeks SEC Nod To List 21Shares’ Proposed Spot Dogecoin ETF",
    "description": "Nasdaq submitted a 19b-4 filing with the U.S. SEC to approve the listing of a spot Dogecoin exchange-traded fund (ETF) managed by 21Shares.",
    "link": "https://zycrypto.com/nasdaq-seeks-sec-nod-to-list-21shares-proposed-spot-dogecoin-etf/",
    "timestamp": "2025-04-29T21:39:26Z"
  },
  {
    "title": "I Can Get Behind Any System By Which a Pathetic Goon like Pierre Poilievre Can Lose Twice in One Night",
    "description": "Meanwhile, the liberal leader, Mark Carney, the next prime minister of Canada, is leaving his every word unminced. He considers his win a victory over an opponent besides Poilievre.",
    "link": "https://www.esquire.com/news-politics/politics/a64625173/canada-parliamentary-elections-poilievre-loss/",
    "timestamp": "2025-04-29T21:39:00Z"
  },
  {
    "title": "Donald Trump Removes Doug Emhoff And Other Joe Biden Appointees From U.S. Holocaust Museum’s Board",
    "description": "Donald Trump has acted once again to remove his predecessor Joe Biden’s appointees from various commissions, this time ousting former Second Gentleman Doug Emhoff and other Democrats from the board that oversees the U.S. Holocaust Memorial Museum. Emhoff, who…",
    "link": "http://deadline.com/2025/04/trump-holocaust-museum-doug-emhoff-1236380394/",
    "timestamp": "2025-04-29T21:38:49Z"
  },
  {
    "title": "Dem senators rip GOP's 'Silence of the Lambs' as Trump marks 100th day",
    "description": "Democratic United States senators Amy Klobuchar, Cory Booker and Chuck Schumer slammed President Donald Trump on his 100th day in office.",
    "link": "https://www.foxnews.com/politics/dem-senators-rip-gops-silence-lambs-trump-marks-100th-day",
    "timestamp": "2025-04-29T21:38:02Z"
  },
  {
    "title": "Trump Jokes About His 'No. 1 Choice' For Pope, And People Pray He's Really Kidding",
    "description": "\"God help us,\" one person wrote on social media.",
    "link": "https://www.huffpost.com/entry/trump-jokes-about-his-number-one-choice-for-pope_n_68112810e4b0ba6ce6d4d692",
    "timestamp": "2025-04-29T21:37:00Z"
  },
  {
    "title": "Carney and Trump to meet in person in 'near future' during call Tuesday: PMO",
    "description": "The Canadian readout of the call said that Trump congratulated newly-elected Carney, and that both leaders agreed to work together as independent nations.",
    "link": "https://nationalpost.com/news/politics/mark-carney-donald-trump-call",
    "timestamp": "2025-04-29T21:36:44Z"
  },
  {
    "title": "‘DISGUSTING’: Legal Immigrant Descended From Holocaust Survivor Slams Democrat Comparing Trump’s Deportations to Hitler",
    "description": "A Republican Colorado state representative who came to the U.S. legally and is descended from a Holocaust survivor slammed his Democrat colleague for comparing President... Read More\nThe post ‘DISGUSTING’: Legal Immigrant Descended From Holocaust Survivor Sla…",
    "link": "https://www.dailysignal.com/2025/04/29/disgusting-legal-immigrant-descended-holocaust-survivors-slams-democrat-comparing-trumps-deportations-hitler/",
    "timestamp": "2025-04-29T21:35:08Z"
  },
  {
    "title": "D.L. Hughley Slams Saquon Barkley, Other Eagles for Visiting White House",
    "description": "D.L. Hughley says any Black person who visits President Donald Trump in the White House doesn't understand or care about Black issues ... specifically tearing into Saquon Barkley for going with the Eagles to the president's residence. The comedian…\n Permalink",
    "link": "https://www.tmz.com/2025/04/29/dl-hughley-slams-saquon-barkley-eagles-visiting-white-house/",
    "timestamp": "2025-04-29T21:35:04Z"
  },
  {
    "title": "Trump Pick to Run DEA Could Challenge America’s Already Tense Relations With Mexico",
    "description": "by Tim Golden \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nIn the spring of 2019, as a new Mexican government shut down most of its cooperat…",
    "link": "https://www.propublica.org/article/trump-dea-nominee-terry-cole-mexico-drug-cartels",
    "timestamp": "2025-04-29T21:35:00Z"
  },
  {
    "title": "MAGA supporters get the shock of their lives realizing that Trump's tariffs are bad for them, too",
    "description": "It’s finally time for the “find out” part of FAFO.",
    "link": "https://www.pride.com/politics/maga-angry-at-trump-tariffs",
    "timestamp": "2025-04-29T21:34:42Z"
  },
  {
    "title": "‘Bloodbath’: Woke lawyers in DOJ ‘self-deporting’ when told to do their job",
    "description": "'En masse, dozens and now over 100 attorneys decided they'd rather not'",
    "link": "https://www.wnd.com/2025/04/bloodbath-woke-lawyers-in-doj-self-deporting-when-told-to-do-their-job/",
    "timestamp": "2025-04-29T21:34:07Z"
  },
  {
    "title": "Amazon Won’t Display Tariff Costs Next to Product Prices",
    "description": "Amazon said Tuesday it would not be displaying the cost of tariffs right next to products’ total prices on any of the company’s websites, contrary... Read More\nThe post Amazon Won’t Display Tariff Costs Next to Product Prices appeared first on The Daily Signa…",
    "link": "https://www.dailysignal.com/2025/04/29/amazon-declines-show-tariff-impact-goods/",
    "timestamp": "2025-04-29T21:34:00Z"
  },
  {
    "title": "‘Stop Hyperventilating’: Fox News’ Will Cain Confronts James Carville Over Comparing Trump To Hitler",
    "description": "Fox News host Will Cain confronted Democratic strategist James Carville on Tuesday over likening President Donald Trump to Adolf Hitler.",
    "link": "https://dailycaller.com/2025/04/29/fox-news-will-cain-confronts-james-carville-comparing-trump-hitler/",
    "timestamp": "2025-04-29T21:33:57Z"
  }
]