[
  {
    "title": "Donald Trump Hit by Legal Blow Over Deportation Error: 'Horror'",
    "description": "A Guatemalan man, identified as O.C.G., was deported to Mexico despite fears over his safety following violent attacks.",
    "link": "https://www.newsweek.com/donald-trump-hit-legal-blow-over-deportation-error-horror-2076687",
    "timestamp": "2025-05-24T11:30:46Z"
  },
  {
    "title": "‘Just The Beginning’—Bitcoin Suddenly Braced For A Huge Week After Crypto Price Boom",
    "description": "The bitcoin price is headed into what will likely be a huge week...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/05/24/just-the-beginning-bitcoin-suddenly-braced-for-a-huge-week-after-crypto-price-boom/",
    "timestamp": "2025-05-24T11:30:31Z"
  },
  {
    "title": "Trump wants Android phones made in the USA, but it’s never happening",
    "description": "Trump is using tariffs to strong-arm smartphone companies into making phones in the USA. However, this is likely never going to happen.",
    "link": "https://www.androidauthority.com/trump-android-phones-made-in-usa-3560960/",
    "timestamp": "2025-05-24T11:30:18Z"
  },
  {
    "title": "The ‘Study’ Driving the FDA’s Abortion-Pill Agenda",
    "description": "RFK Jr.’s affection for junk science has struck again.",
    "link": "https://www.theatlantic.com/health/archive/2025/05/mifepristone-abortion-rfk-fda/682939/",
    "timestamp": "2025-05-24T11:30:00Z"
  },
  {
    "title": "Trump's $600 million war chest: How he plans to wield his power in midterms and beyond",
    "description": "Trump is keeping an aggressive fundraising schedule with the ultimate goal of raising $1 billion. It’s an unprecedented sum in modern politics, particularly for a lame-duck president.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_a2ce687a-8376-534b-9f31-e6bae937c490.html",
    "timestamp": "2025-05-24T11:30:00Z"
  },
  {
    "title": "Trump's $600 million war chest: How he plans to wield his power in midterms and beyond",
    "description": "Trump is keeping an aggressive fundraising schedule with the ultimate goal of raising $1 billion. It’s an unprecedented sum in modern politics, particularly for a lame-duck president.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_8f4245c4-3fc4-507e-a5ff-86ad847ee4b6.html",
    "timestamp": "2025-05-24T11:30:00Z"
  },
  {
    "title": "Trump's tariff threat risks a trade war with Europe years in the making",
    "description": "The E.U. has pushed back against President Trump’s latest threat to impose a 50% import tariff on all E.U. goods, warning trade must be built on “respect.\"",
    "link": "https://www.nbcnews.com/world/europe/trumps-tariff-threat-risks-trade-war-europe-years-making-rcna208873",
    "timestamp": "2025-05-24T11:29:15Z"
  },
  {
    "title": "Karoline Leavitt Answers If Trump Is ‘Satisfied’ With Bongino’s Assassination Attempt Explanation",
    "description": "By Daily Caller Staff, Daily Caller News Foundation | May 22, 2025\nWhite House Press Secretary Karoline Leavitt appeared to sidestep a question Wednesday on whether President Donald Trump was “satisfied” with the FBI Deputy Director Dan Bongino’s explanation …",
    "link": "https://biztoc.com/x/50cd638b050f9251",
    "timestamp": "2025-05-24T11:28:00Z"
  },
  {
    "title": "Nvidia CEO calls Trump re-industrialisation policies 'visionary'",
    "description": "Nvidia CEO Jensen Huang praised Donald Trump's tech policies as Nvidia partnered with Swedish firms, including Ericsson and AstraZeneca, to develop AI infrastructure. Huang welcomed relaxed AI chip export rules and supported re-industrialisation efforts, thou…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-ceo-calls-trump-re-industrialisation-policies-visionary/articleshow/121379978.cms",
    "timestamp": "2025-05-24T11:22:48Z"
  },
  {
    "title": "Hillary Clinton Calls on Liberals to Ruin Memorial Day Gatherings by Bashing Trump to “Friends, Neighbors, Cookout Attendees”",
    "description": "Rather than honoring the military men and women who gave their lives defending their fellow Americans’ right to live in freedom, two-time failed Democratic Party presidential candidate Hillary Clinton is calling on her supporters to bash President Donald Trum…",
    "link": "https://freerepublic.com/focus/f-news/4318828/posts",
    "timestamp": "2025-05-24T11:20:57Z"
  },
  {
    "title": "Trump’s latest Wall Street showdown pushes investor scepticism to the brink",
    "description": "US president’s One Big Beautiful Bill Act has rattled the bond market and will invariably have global consequences\nDonald Trump calls his tax and spending plans “big, beautiful,” and a once-in-a generation opportunity to bolster the prosperity of the US econo…",
    "link": "https://biztoc.com/x/62894b93ef714031",
    "timestamp": "2025-05-24T11:17:07Z"
  },
  {
    "title": "Russia launches one of biggest drone attacks on Kyiv since start of Ukraine war",
    "description": "Volodymyr Zelenskiy says it was a ‘difficult night for all of Ukraine’ as he calls for more sanctions on Moscow to help achieve a ceasefire",
    "link": "https://www.irishtimes.com/world/europe/2025/05/24/russia-launches-one-of-biggest-drone-attacks-on-kyiv-since-start-of-ukraine-war/",
    "timestamp": "2025-05-24T11:16:51Z"
  },
  {
    "title": "US EPA wants to erase greenhouse gas limits on power plants: Report",
    "description": "The US Environmental Protection Agency has drafted a plan to eliminate all limits on greenhouse gases from coal and gas-fired power plants in the United States, the New York Times reported on Saturday (May 24), citing internal agency documents. The EPA argued…",
    "link": "https://www.channelnewsasia.com/sustainability/us-environmental-protection-agency-erase-greenhouse-gas-limits-power-plant-nyt-5151071",
    "timestamp": "2025-05-24T11:12:42Z"
  },
  {
    "title": "FIIs withdraw Rs 11,591 crore from domestic markets this week. May purchases narrow to Rs 13,835 crore",
    "description": "FIIs bought ₹13,835 crore in Indian equities this May despite weekly sell-offs worth ₹11,591 crore. While short-term global headwinds persist, India’s growth outlook keeps long-term FPI sentiment positive, especially if earnings align with market valuations.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-withdraw-rs-11591-crore-from-domestic-markets-this-week-may-purchases-narrow-to-rs-13835-crore/articleshow/121379811.cms",
    "timestamp": "2025-05-24T11:12:07Z"
  },
  {
    "title": "US Treasury Secretary Scott Bessent warns of 'detox period.' 3 ways to shockproof your portfolio.",
    "description": "Here is what you can expect and how to prepare for economic turbulence.",
    "link": "https://finance.yahoo.com/news/us-treasury-secretary-scott-bessent-111100257.html",
    "timestamp": "2025-05-24T11:11:00Z"
  },
  {
    "title": "The Left Needs a New Globalization Vision to Counter the Far-Right Surge",
    "description": "The left is in shambles everywhere while hard-right and far-right parties are riding high in polls across the world. I contend that globalization is at the heart of these developments, and thus it is critical that the left comes to terms with what has gone wr…",
    "link": "https://www.commondreams.org/opinion/left-needs-new-globalization-vision",
    "timestamp": "2025-05-24T11:03:03Z"
  },
  {
    "title": "Colleges are canceling affinity graduations due to anti-DEI policies. Here is how students are preserving the traditions | CNN",
    "description": "Universities across the country have canceled and withdrawn support for affinity graduations due to threats from President Donald Trump if they do not end diversity, equity, and inclusion practices.",
    "link": "https://www.cnn.com/2025/05/24/us/affinity-graduation-college-dei-trump",
    "timestamp": "2025-05-24T11:00:50Z"
  },
  {
    "title": "Why Trump Is So Obsessed With White South Africans",
    "description": "It's the latest extension of grievances he's been touting for years.",
    "link": "https://www.huffpost.com/entry/trump-white-south-africans-refugees-immigration-racism-double-standard_n_6830ebe2e4b0b6e012c81112",
    "timestamp": "2025-05-24T11:00:26Z"
  },
  {
    "title": "The Critical Sign That Trump’s ‘Big, Beautiful Bill’ Might Be An Economic Disaster",
    "description": "Experts say Trump’s plan favors the rich and could stall economic growth.",
    "link": "https://www.huffpost.com/entry/bond-markets-trump-big-beautiful-bill_n_6830c86fe4b0ca4a5f56876d",
    "timestamp": "2025-05-24T11:00:26Z"
  },
  {
    "title": "Awash in Anti-Semitism. Plus, Israeli Embassy Terrorist Promoted Far-Left Jewish “Peace” Group.",
    "description": "Morally adrift: The terror attack outside Washington’s Jewish museum isn’t just another senseless act of violence—it’s a symptom of a society that has lost its moral bearings, writes the Hudson Institute’s Mike Watson.\nThe post Awash in Anti-Semitism. Plus, I…",
    "link": "https://freebeacon.com/newsletters/awash-in-anti-semitism-plus-israeli-embassy-terrorist-promoted-far-left-jewish-peace-group/",
    "timestamp": "2025-05-24T11:00:08Z"
  },
  {
    "title": "We talked to 2 retail investors who dumped stocks in response to Trump uncertainty. They told us why they have no regrets.",
    "description": "Angelo Sibilio and Matt White told Business Insider why they increased their cash holdings and aren't planning to jump back in the market soon.",
    "link": "https://www.businessinsider.com/retail-investors-not-buying-the-dip-stock-market-trade-war-2025-5",
    "timestamp": "2025-05-24T11:00:02Z"
  },
  {
    "title": "Maine Poised to Become First State to Withdraw From Popular Vote Compact",
    "description": "Just last year, Maine—one of only two states that apportions its Electoral College votes—opted to join the National Popular Vote Interstate Compact.  But the New... Read More\nThe post Maine Poised to Become First State to Withdraw From Popular Vote Compact ap…",
    "link": "https://www.dailysignal.com/2025/05/24/maine-poised-become-first-state-withdraw-from-popular-vote-compact/",
    "timestamp": "2025-05-24T11:00:00Z"
  },
  {
    "title": "Target's red flag, Walmart vs. Trump, and Elon Musk vs. Bill Gates: Business news roundup",
    "description": "High-income U.S. consumers are pulling back. Mortgage applications are down, Walmart (WMT) is reporting grocery gains from monied households suddenly keen for deals on eggs and bananas. And now Target joins a growing list of beloved brands waving the red flag…",
    "link": "https://qz.com/target-walmart-prices-trump-tariff-elon-musk-bill-gates-1851782191",
    "timestamp": "2025-05-24T11:00:00Z"
  },
  {
    "title": "Trump Addresses a Military He’s Remaking in His Image",
    "description": "The president returns to West Point having transformed his relationship with the armed forces.",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/trump-speech-west-point/682936/",
    "timestamp": "2025-05-24T11:00:00Z"
  },
  {
    "title": "Police investigate after Melania Trump statue stolen from Slovenian hometown",
    "description": "Only the lifesize statue’s feet were left behind as the thieves sawed off the majority of the sculpture, according to Slovenian media.",
    "link": "https://www.jpost.com/international/article-854599",
    "timestamp": "2025-05-24T10:56:37Z"
  },
  {
    "title": "Links 5/24/2025",
    "description": "Our feisty daily links: hawk traffic strategy, Trump threatens 50% EU + 25% Apple tariffs, excess deaths mystery, China missiles, Golden Dome boondoggle, Harvard wins temporary stay v. Trump, moar Ukraine war delusion, blackmaill by AI, CBP to track exits, mo…",
    "link": "https://www.nakedcapitalism.com/2025/05/links-5-24-2025.html",
    "timestamp": "2025-05-24T10:55:57Z"
  },
  {
    "title": "Donald Trump May Have Broken Federal Law at Meme Coin Dinner: Attorney",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's recent dinner with backers of a meme coin project is under legal scrutiny, with an attorney suggesting the president may have violated federal law.\nTrump hosted more than 200 top inves…",
    "link": "https://biztoc.com/x/37cd0b022f395f96",
    "timestamp": "2025-05-24T10:54:52Z"
  },
  {
    "title": "Made in India iPhones for US to Be Cheaper, Even With Tariffs: Report",
    "description": "Manufacturing iPhones in India remains significantly more cost-effective than in the US, even with a potential 25 percent tariff, according to a report from the Global Trade Research Initiative (GTRI). US President Donald Trump recently threatened to impose a…",
    "link": "https://www.gadgets360.com/mobiles/news/made-in-india-iphones-cheaper-even-with-donald-trumps-25-percent-tariff-gtri-report-8496442",
    "timestamp": "2025-05-24T10:48:17Z"
  },
  {
    "title": "Donald Trump May Have Broken Federal Law at Meme Coin Dinner: Attorney",
    "description": "Trump hosted more than 200 top investors in his personal $TRUMP meme coin, which launched in January 2025 and is currently valued at more than $3 billion.",
    "link": "https://www.newsweek.com/donald-trump-meme-coin-federal-law-2076682",
    "timestamp": "2025-05-24T10:45:40Z"
  },
  {
    "title": "'Tip creep' is pushing some customers to leave smaller tips, and driving others to avoid businesses that ask for them",
    "description": "Customers are seeing 'tip creep' as requests for tips pop up in more places, a Morning Consult survey found.",
    "link": "https://www.businessinsider.com/tipping-culture-customers-cut-back-survey-says-2025-5",
    "timestamp": "2025-05-24T10:43:01Z"
  },
  {
    "title": "Trump Is Right to Target Colleges. He’s Doing It the Completely Wrong Way.",
    "description": "The credibility of elite universities has fallen far, and not without reason. For decades, admissions offices singled out Asian-American applicants for unfairly high admissions standards while pretending to care about fairness and “equity.” Academic journals,…",
    "link": "https://www.fairobserver.com/politics/trump-is-right-to-target-colleges-hes-doing-it-the-completely-wrong-way/",
    "timestamp": "2025-05-24T10:40:42Z"
  },
  {
    "title": "Leader of Qakbot cybercrime network indicted in U.S. crackdown",
    "description": "The U.S. indicted Russian Rustam Gallyamov for leading the Qakbot botnet, which infected 700K+ devices and was used in ransomware attacks. The U.S. authorities have indicted Russian national Rustam Gallyamov, the leader of the Qakbot operation, which infected…",
    "link": "https://securityaffairs.com/178232/uncategorized/leader-of-qakbot-cybercrime-network-indicted-in-u-s-crackdown.html",
    "timestamp": "2025-05-24T10:39:54Z"
  },
  {
    "title": "Elon Musk Is $170 Billion Richer Since Endorsing Trump",
    "description": "As Musk winds down at DOGE, he returns to a business empire flush with opportunities and fewer investigations—but new reputational challenges.",
    "link": "https://www.forbes.com/sites/johnhyatt/2025/05/24/elon-musk-is-170-billion-richer-since-endorsing-trump/",
    "timestamp": "2025-05-24T10:30:00Z"
  },
  {
    "title": "What Is the No Tax on Tips Act? Impacts for You as Senate Passes Bill",
    "description": "A sizable tax break could be coming for tipped income, but the economic knock-on effects could be damaging.",
    "link": "https://www.cnet.com/personal-finance/taxes/what-is-the-no-tax-on-tips-act-impacts-for-you-as-senate-passes-bill/",
    "timestamp": "2025-05-24T10:30:00Z"
  },
  {
    "title": "Trumps wants to create manufacturing jobs. His tech allies invest in robots to do the work.",
    "description": "Trumps wants to create manufacturing jobs. His tech allies invest in robots to do the work.go.com",
    "link": "https://abcnews.go.com/Business/trumps-create-manufacturing-jobs-tech-allies-invest-robots/story?id=121869903",
    "timestamp": "2025-05-24T10:26:16Z"
  },
  {
    "title": "Michael Hudson: The Secret Deal That Started a Global Economic War",
    "description": "Micheal Hudson explains how Trump's tariffs are yet another device to force countries to accept poilcies that benefit the US.",
    "link": "https://www.nakedcapitalism.com/2025/05/michael-hudson-the-secret-deal-that-started-a-global-economic-war.html",
    "timestamp": "2025-05-24T10:22:11Z"
  },
  {
    "title": "‘It’s unsafe’: why Trump’s ‘gold card’ visa is failing to lure wealthy Chinese",
    "description": "Chinese investors are unfazed by the visa's US$5 million price tag, but have concerns about taxes, crime and the policy's legality Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/24/its-unsafe-why-trumps-gold-card-visa-is-failing-to-lure-wealthy-chinese",
    "timestamp": "2025-05-24T10:20:00Z"
  },
  {
    "title": "Who Is Karoline Leavitt’s Husband? Everything You Need To Know About Nicholas Riccio",
    "description": "Who is Karoline Leavitt's husband? Get the facts on Nicholas Riccio, including his marriage to White House Press Secretary Karoline Leavitt in January 2025.",
    "link": "https://www.boredpanda.com/who-is-karoline-leavitts-husband/",
    "timestamp": "2025-05-24T10:14:02Z"
  },
  {
    "title": "Donald Trump Suffers Triple Legal Blow Within Hours",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Trump administration suffered three legal defeats within hours on Friday as opposition to its policies continues to be channeled through the courts.\nIn Washington, D.C., a federal judge rejected the admini…",
    "link": "https://biztoc.com/x/aa41a73da7baf419",
    "timestamp": "2025-05-24T10:10:30Z"
  },
  {
    "title": "American Bishops' War With Trump Admin Is Heating Up",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe U.S. Conference of Catholic Bishops (USCCB) seems to be battling with President Donald Trump's administration over some of its policies.\nLast week, the USCCB, the official assembly of the Catholic Church i…",
    "link": "https://biztoc.com/x/e191c4e2ede568e4",
    "timestamp": "2025-05-24T10:10:15Z"
  },
  {
    "title": "Donald Trump Suffers Triple Legal Blow Within Hours",
    "description": "The courts have emerged as one of the main constraints on Trump administration policy.",
    "link": "https://www.newsweek.com/donald-trump-suffers-triple-legal-defeat-hours-2076684",
    "timestamp": "2025-05-24T10:07:15Z"
  },
  {
    "title": "Trump to address West Point graduates following DEI crackdown",
    "description": "President Donald Trump is slated to speak before this year's West Point graduates amid the administration's controversial crackdown on DEI initiatives.",
    "link": "https://abcnews.go.com/Politics/trump-address-west-point-graduates-dei-crackdown/story?id=122116685",
    "timestamp": "2025-05-24T10:06:08Z"
  },
  {
    "title": "Israel is facing unprecedented pressure from allies over its war on Gaza. Can they force it to change its ways?",
    "description": "After 19 months of pounding Gaza, Israel is now under growing pressure from unlikely quarters – some of its closest Western allies.",
    "link": "https://www.cnn.com/2025/05/24/middleeast/israel-pressure-from-allies-war-gaza-intl-cmd",
    "timestamp": "2025-05-24T10:00:52Z"
  },
  {
    "title": "2028 Voters Won’t Care About the Biden ‘Cover-Up’",
    "description": "Swing voters won’t care about Joe Biden ‘cover-up’ allegations in future elections. The scandal may linger, but if Biden’s health is still a major issue in 2028, then Democrats will have done a terrible job of giving voters more to chew on.",
    "link": "http://nymag.com/intelligencer/article/2028-voters-wont-care-about-the-biden-cover-up.html",
    "timestamp": "2025-05-24T10:00:30Z"
  },
  {
    "title": "American Bishops' War With Trump Admin Is Heating Up",
    "description": "The U.S. Conference of Catholic Bishops has criticized U.S. Customs and Border Protection.",
    "link": "https://www.newsweek.com/american-bishops-catholic-church-customs-border-protection-2075739",
    "timestamp": "2025-05-24T10:00:02Z"
  },
  {
    "title": "GOP Budget Would Make It Even Harder to Hold Trump Administration in Contempt",
    "description": "One Senate Democrat called it “a slap in the face to the concept of separation of powers.”\nThe post GOP Budget Would Make It Even Harder to Hold Trump Administration in Contempt appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/24/republican-budget-contempt-of-court-trump/",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "Joe Biden Is the Least of Democrats’ Problems",
    "description": "Well, folks, the Democratic Party really went through it this week. Last weekend, it was disclosed that former President Joe Biden was diagnosed with a particularly aggressive form of prostate cancer that had metastasized to his bones. Coming smack-dab in the…",
    "link": "https://newrepublic.com/post/195644/biden-democrats-litmus-test-2028",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "Tariffs Explained: I Have Everything You Need to Know as Trump Spars With Apple, Walmart",
    "description": "Price increases are becoming the norm amid Trump's tariff policies, even as the president clashes with companies like Apple and Walmart.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-i-have-everything-you-need-to-know-as-trump-spars-with-apple-walmart/",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "Republicans’ pro-pollution agenda exposes the fraudulent MAHA movement",
    "description": "As Republicans peddle propaganda about their purported desire to “Make America Healthy Again,” they’re pursuing a literally toxic agenda, one that’s rolling back anti-pollution measures and putting Americans at risk.",
    "link": "https://www.msnbc.com/top-stories/latest/maha-forever-chemicals-pollution-epa-republicans-health-rcna208764",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "How Kim Kardashian’s Robbery Trial Came and Went",
    "description": "When the star was robbed at gunpoint, in 2016, the incident announced her graduation into something greater than a glorified Instagram influencer. Now her courtroom testimony is just another cog in her family’s media machinations.",
    "link": "https://www.newyorker.com/news/the-lede/how-kim-kardashians-robbery-trial-came-and-went",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "Andor Has a Message for the Left: Act Now",
    "description": "The Star Wars series shows a rebel movement struggling to be born, but has a clear lesson for fighting rising fascism.\nThe post Andor Has a Message for the Left: Act Now appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/24/andor-has-a-message-for-the-left-act-now/",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "Is “Thunderbolts*” Marvel’s Attempt to Salvage the Superhero Genre?",
    "description": "The film succeeds in part by flipping the franchise’s standard script: the main characters aren’t embarrassed because they’re superheroes; they’re embarrassed because they’re not.",
    "link": "https://www.newyorker.com/culture/critics-notebook/is-thunderbolts-marvels-attempt-to-salvage-the-superhero-genre",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "Hegseth Announces Pay Raise for Army Paratroopers",
    "description": "FORT BRAGG, N.C. — Defense Secretary Pete Hegseth announced a pay raise for Army paratroopers today during remarks to current and former members of the 82nd Airborne Division at Fort Bragg, North Carolina. Hegseth made the announcement during the 82nd’s All A…",
    "link": "https://soldiersystems.net/2025/05/24/hegseth-announces-pay-raise-for-army-paratroopers/",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "The Meaning of Germany’s Dramatic Rearmament",
    "description": "Chancellor Friedrich Merz is about to make history with his vow to create the 'strongest conventional army in Europe,' writes Ian Bremmer.",
    "link": "https://time.com/7288382/germany-merz-dramatic-rearmament/",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "Norfolk floodwall delayed 4 years as costs rise, city considers alignment changes",
    "description": "Norfolk’s downtown floodwall project will take an additional four years to finish, Army Corps of Engineers officials told Norfolk City Council last week.",
    "link": "https://www.pilotonline.com/2025/05/21/norfolk-floodwall-delayed/",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "If Donald Trump wants his speech at West Point to be memorable, here’s what he should say",
    "description": "President Donald Trump will deliver the commencement address to the class of 2025 at the United States Military Academy at West Point.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-west-point-2025-commencement-address-rcna208607",
    "timestamp": "2025-05-24T10:00:00Z"
  },
  {
    "title": "Decades On, SSRIs Remain Mired in Mystery and Debate",
    "description": "Experts worry MAHA could wage a war on SSRIs. But some researchers have long questioned the drugs’ efficacy.",
    "link": "https://www.nakedcapitalism.com/2025/05/decades-on-ssris-remain-mired-in-mystery-and-debate.html",
    "timestamp": "2025-05-24T09:58:09Z"
  },
  {
    "title": "India-EU FTA: Goyal meets European counterpart for second time in a month",
    "description": "The deliberations assume significance as India and the 27-nation European Union are looking at concluding the talks for an early harvest trade agreement by July",
    "link": "https://www.thehindubusinessline.com/economy/india-eu-fta-goyal-meets-european-counterpart-for-second-time-in-a-month/article69613768.ece",
    "timestamp": "2025-05-24T09:55:04Z"
  },
  {
    "title": "Doctor claims Biden may have only 'six months to live' after cancer diagnosis and alleged health cover-up",
    "description": "Doctor claims Biden may have only 'six months to live' after cancer diagnosis and alleged health cover-upmeaww.com",
    "link": "https://news.meaww.com/doctor-claims-biden-may-have-only-six-months-to-live-after-cancer-diagnosis-and-alleged-health-cover-up",
    "timestamp": "2025-05-24T09:53:15Z"
  },
  {
    "title": "Trump’s use of presidential seal at memecoin event raises legal questions",
    "description": "President Donald Trump is facing scrutiny after speaking at a private event for top investors in his $TRUMP memecoin while standing behind a lectern emblazoned with the official presidential seal — a move that may violate federal law.The event took place Thur…",
    "link": "https://cointelegraph.com/news/trump-presidential-seal-memecoin-dinner-legal-review",
    "timestamp": "2025-05-24T09:48:19Z"
  },
  {
    "title": "Cannes prepares to award the Palme d'Or, with Neon positioned to add to an unprecedented streak",
    "description": "Cannes prepares to award the Palme d'Or, with Neon positioned to add to an unprecedented streakclickondetroit.com",
    "link": "https://www.clickondetroit.com/entertainment/2025/05/24/cannes-prepares-to-award-the-palme-dor-with-neon-positioned-to-add-to-an-unprecedented-streak/",
    "timestamp": "2025-05-24T09:43:57Z"
  },
  {
    "title": "US judge blocks Trump administration from revoking Harvard enrolment of foreign students",
    "description": "A US judge on Friday has temporarily blocked the Trump administration from revoking Harvard University's ability to enroll foreign students Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/24/us-judge-blocks-trump-administration-from-revoking-harvard-enrolment-of-foreign-students",
    "timestamp": "2025-05-24T09:41:00Z"
  },
  {
    "title": "Trump administration begins to lift Syria sanctions in place for decades",
    "description": "A handout picture provided by the Saudi Royal Palace shows US President Donald Trump shakes hands with Syria's interim president Ahmed al-Sharaa in Riyadh on May 14, 2025.",
    "link": "https://biztoc.com/x/065ca4ff7e4c0843",
    "timestamp": "2025-05-24T09:37:19Z"
  },
  {
    "title": "'This is the reason': Citing China activity, Trump administration bars Harvard from enrolling foreign students",
    "description": "Almost 6,800 enrollees expected to be affected as Homeland Security chief also accuses university of fostering antisemitism Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/24/039this-is-the-reason039-citing-china-activity-trump-administration-bars-harvard-from-enrolling-foreign-students",
    "timestamp": "2025-05-24T09:31:00Z"
  },
  {
    "title": "Trump administration begins to lift Syria sanctions in place for decades",
    "description": "The Trump administration issued orders Friday that it said would effectively lift sanctions on Syria to help the country rebuild after a devastating civil war.",
    "link": "https://www.nbcnews.com/world/syria/syria-sanctions-trump-administration-lifting-begin-rcna208875",
    "timestamp": "2025-05-24T09:22:27Z"
  },
  {
    "title": "Trump signs orders to revive US leadership in Nuclear Power",
    "description": "The effort is a bid to meet a coming surge in electricity demand and help the US reclaim its edge in nuclear energy",
    "link": "https://www.bloomberg.com/news/articles/2025-05-23/trump-signs-orders-to-revive-us-leadership-in-nuclear-power",
    "timestamp": "2025-05-24T09:17:59Z"
  },
  {
    "title": "Why Texas is tapping into the ‘modern phenomenon’ of crypto",
    "description": "With bitcoin soaring to new records, an array of influential Texans are working to transform the Lone Star State into a global crypto capital.",
    "link": "https://www.dallasnews.com/business/2025/05/24/why-texas-is-tapping-into-the-modern-phenomenon-of-crypto/",
    "timestamp": "2025-05-24T09:08:02Z"
  },
  {
    "title": "Lucas: ‘Golden Dome’ idea out of this world",
    "description": "Trump said, “Once fully constructed, Golden Dome will be capable of intercepting missiles even if they are launched from the other side of the world, and even if they are launched from space, and we will have the best system ever built.”",
    "link": "https://www.bostonherald.com/2025/05/24/lucas-golden-dome-idea-out-of-this-world/",
    "timestamp": "2025-05-24T09:07:46Z"
  },
  {
    "title": "Hong Kong To Open Universities To More Foreign Students After US Ban",
    "description": "Hong Kong University of Science and Technology invited international students enrolled at Harvard to continue their studies at HKUST.",
    "link": "https://www.ndtv.com/world-news/hong-kong-to-open-universities-to-more-foreign-students-after-us-ban-8495789",
    "timestamp": "2025-05-24T09:06:28Z"
  },
  {
    "title": "Trump’s Reckless Policies Keep Interest Rates High",
    "description": "Higher interest rates follow from President Donald Trump’s economic policies. Economic uncertainty, global tariffs and tax-cut fueled deficits are the main culprits.",
    "link": "https://www.forbes.com/sites/christianweller/2025/05/24/trumps-reckless-policies-keep-interest-rates-high/",
    "timestamp": "2025-05-24T09:03:00Z"
  },
  {
    "title": "Boise State Public Radio chief fears service cuts if Trump funding ban succeeds",
    "description": "Boise State Public Radio relies on federal funding from the Corporation for Public Broadcasting to carry out its mission, general manager Tom Michael told Fox News Digital.",
    "link": "https://www.foxnews.com/media/boise-state-public-radio-chief-speaks-out-feared-service-cuts-trump-funding-ban-succeeds",
    "timestamp": "2025-05-24T09:00:28Z"
  },
  {
    "title": "Joe Rogan Ripped Over Bad Habit on Podcast",
    "description": "Some listeners said they couldn't finish the latest episode of Rogan's podcast because of his loud chewing.",
    "link": "https://www.newsweek.com/joe-rogan-chewing-loudly-podcast-2076337",
    "timestamp": "2025-05-24T09:00:02Z"
  },
  {
    "title": "Inside the 30-hour sprint to pass Trump's One Big Beautiful Bill Act — and Louisiana's role",
    "description": "WASHINGTON — U.S. Rep. Troy Carter, D-New Orleans arrived at 2:30 a.m. Wednesday to procure a seat.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/the-30-hour-sprint-to-pass-one-big-beautiful-bill-act/article_529ff421-1ee2-5349-8850-0d6862f8c385.html",
    "timestamp": "2025-05-24T09:00:00Z"
  },
  {
    "title": "When Elena Kagan is This Angry, You Know Something Has Gone Badly.",
    "description": "But they don’t seem to realize the consequences.",
    "link": "https://slate.com/podcasts/amicus/2025/05/scotus-hands-trump-more-victories",
    "timestamp": "2025-05-24T09:00:00Z"
  },
  {
    "title": "Democratic credibility tanks to ‘catastrophic’ level with Biden health cover-up - NewsBreak",
    "description": "Revelations about former President Joe Biden’s mental and physical decline in office have set off a credibility crisis in the Democratic Party that may tak",
    "link": "https://www.newsbreak.com/share/4020383660406-democratic-credibility-tanks-to-catastrophic-level-with-biden-health-cover-up?_f=app_share&amp;pd=05aATx17&amp;lang=en_US&amp;send_time=1748076787&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.20.1.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v1%2Cns_foryou_recall_exp_25q2-v5%2Cns_foryou_blend_exp_25q2-v4%2Cns_local_strategy_25q1_exp-v4%2Cns_foryou_rank_exp_25q2-v9&amp;s=i2",
    "timestamp": "2025-05-24T08:54:26Z"
  },
  {
    "title": "Democratic credibility tanks to ‘catastrophic’ level with Biden health cover-up - NewsBreak",
    "description": "Revelations about former President Joe Biden’s mental and physical decline in office have set off a credibility crisis in the Democratic Party that may tak",
    "link": "https://www.newsbreak.com/share/4020383660406-democratic-credibility-tanks-to-catastrophic-level-with-biden-health-cover-up?_f=app_share&amp;pd=05aATx17&amp;lang=en_US&amp;send_time=1748076778&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.20.1.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v4%2Cns_foryou_model_exp_25q2_v2-v1%2Cns_foryou_rank_exp_25q2-v9%2Cns_foryou_recall_exp_25q2-v5%2Cns_local_strategy_25q1_exp-v4&amp;s=i2",
    "timestamp": "2025-05-24T08:53:27Z"
  },
  {
    "title": "Russia strikes Kyiv after first stage of major prisoner swap",
    "description": "Kyiv, Ukraine (AFP) May 24, 2025\n\n\n A massive Russian drone and missile attack on Kyiv Saturday wounded at least 15 people, just as Russia and Ukraine were in the middle of a major prisoner swap. \n\nUkraine's air force said Russia launched 14 ballistic missile…",
    "link": "https://www.spacewar.com/reports/Russia_strikes_Kyiv_after_first_stage_of_major_prisoner_swap_999.html",
    "timestamp": "2025-05-24T08:51:14Z"
  },
  {
    "title": "After two setbacks, SpaceX could try to launch massive Starship next week",
    "description": "Washington (AFP) May 23, 2025\n\n SpaceX said Friday it will make another launch attempt next week of the massive Starship rocket - key to CEO Elon Musk's long-term vision of colonizing Mars - after two consecutive in-flight explosions earlier this year. \n\n\"The…",
    "link": "https://www.spacedaily.com/reports/After_two_setbacks_SpaceX_could_try_to_launch_massive_Starship_next_week_999.html",
    "timestamp": "2025-05-24T08:51:14Z"
  },
  {
    "title": "S.Africa moves to ease black empowerment law under Starlink pressure",
    "description": "Johannesburg (AFP) May 23, 2025\n\n\n South Africa's government is moving towards easing its black ownership laws in the telecoms sector - a policy change that would smooth the way for Elon Musk's Starlink to enter the local market. \n\nThe directive came days aft…",
    "link": "https://www.africadaily.net/reports/SAfrica_moves_to_ease_black_empowerment_law_under_Starlink_pressure_999.html",
    "timestamp": "2025-05-24T08:51:14Z"
  },
  {
    "title": "Latest round of US-Iran nuclear talks ends in Rome",
    "description": "Rome (AFP) May 23, 2025\n\n\n Iran's foreign minister described nuclear talks with the United States as \"complicated\", following the conclusion of a fifth round of discussions in Rome on Friday. \n\nThe talks, which began in April, are the highest-level contact be…",
    "link": "https://www.spacewar.com/reports/Latest_round_of_US-Iran_nuclear_talks_ends_in_Rome_999.html",
    "timestamp": "2025-05-24T08:51:14Z"
  },
  {
    "title": "'Professional' fifth round of Iran nuclear talks end without conclusion",
    "description": "Iranian and U.S. delegations wrapped up a fifth round of nuclear talks in Rome on Friday and signs of some limited progress emerged.",
    "link": "https://www.nbcnews.com/world/iran/professional-fifth-iran-nuclear-talks-end-conclusion-trump-oman-israel-rcna208874",
    "timestamp": "2025-05-24T08:41:39Z"
  },
  {
    "title": "EU wants to work on trade deal with US based on 'respect', not threats",
    "description": "US President Donald Trump dramatically upped the stakes in the months-long transatlantic standoff yesterday.",
    "link": "https://www.thejournal.ie/eu-wants-to-work-on-trade-deal-with-us-based-on-respect-not-threats-6713725-May2025/",
    "timestamp": "2025-05-24T08:39:44Z"
  },
  {
    "title": "TSMC warns US tariffs could derail USD 165 billion Arizona investment",
    "description": "The company's USD 165 billion investment aims to build advanced semiconductor fabrication facilities in the state, but TSMC warned that tariffs could reduce demand for chips and jeopardize the project's success.",
    "link": "https://www.livemint.com/companies/news/tsmc-warns-us-tariffs-could-derail-usd-165-billion-arizona-investment-11748075967200.html",
    "timestamp": "2025-05-24T08:39:26Z"
  },
  {
    "title": "US lifting of sanctions on Syria signals fresh start for diplomatic ties",
    "description": "The Treasury Department's OFAC said that it \"issued Syria to provide immediate sanctions relief for Syria in line with the President’s announcement for the cessation of all sanctions.\"",
    "link": "https://www.jpost.com/middle-east/article-855251",
    "timestamp": "2025-05-24T08:32:42Z"
  },
  {
    "title": "President Trump Endorses Nippon-U.S. Steel Merger, Promises Economic Boost",
    "description": "U.S. President Donald Trump approved the merger of United States Steel Corporation (NYSE:X) and Nippon Steel on May 23, following the blocking of the...",
    "link": "https://finance.yahoo.com/news/president-trump-endorses-nippon-u-083059845.html",
    "timestamp": "2025-05-24T08:30:59Z"
  },
  {
    "title": "Ukraine says 15 people hurt in 'massive' Russian attack on capital",
    "description": "The Kyiv city military administration and the police reported damage in six districts of the Ukrainian capital, and a total so far of 15 people wounded.",
    "link": "https://www.cnbc.com/2025/05/24/ukraine-says-15-people-hurt-in-massive-russian-attack-on-capital.html",
    "timestamp": "2025-05-24T08:19:39Z"
  },
  {
    "title": "Russia preparing peace document draft",
    "description": "MOSCOW: Russian Foreign Minister Sergey Lavrov revealed that Moscow is preparing a draft peace document outlining its conditions for a long-term agreement with Ukraine, to be presented once the ongoing prisoner exchange is completed. In a statement published …",
    "link": "https://english.khabarhub.com/2025/24/470159/",
    "timestamp": "2025-05-24T08:15:48Z"
  },
  {
    "title": "Bengal CM Mamata Banerjee to skip NITI Aayog meeting in Delhi",
    "description": "West Bengal Chief Minister Mamata Banerjee will not attend the NITI Aayog meeting in New Delhi on Saturday, according to state secretariat sources, though the reason for her absence remains undisclosed. Prime Minister Narendra Modi will chair the meeting, foc…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/bengal-cm-mamata-banerjee-to-skip-niti-aayog-meeting-in-delhi/articleshow/121377532.cms",
    "timestamp": "2025-05-24T08:11:33Z"
  },
  {
    "title": "Lamar Odom brings protests to Trump's cryptocurrency dinner, audience boos",
    "description": "Lamar Odom's attendance at Donald Trump's cryptocurrency dinner in Sterling, Virginia, sparked controversy and protests. Odom, a crypto enthusiast, faced jeers for supporting Trump's $TRUMP meme coin. The event, criticized for offering privileged access in ex…",
    "link": "https://economictimes.indiatimes.com/news/international/us/lamar-odom-brings-protests-to-trumps-cryptocurrency-dinner-audience-boos/articleshow/121377378.cms",
    "timestamp": "2025-05-24T08:04:57Z"
  },
  {
    "title": "Azerbaijan has become one of Israel's most trusted partners, envoy tells 'Post'",
    "description": "Ambassador to Azerbaijan George Deek discusses how Azerbaijan became one of Israel’s most trusted and reliable partners as the two countries navigate a historic growth in relations.",
    "link": "https://www.jpost.com/middle-east/article-855024",
    "timestamp": "2025-05-24T08:03:14Z"
  },
  {
    "title": "5 editorial cartoons about the Russia-Ukraine peace talks",
    "description": "These political cartoons include a stand-in for Vladimir Putin and phone calls with Donald Trump.",
    "link": "https://theweek.com/cartoons/editorial-cartoons-russia-ukraine-peace-talks",
    "timestamp": "2025-05-24T08:03:00Z"
  },
  {
    "title": "How Much Will the iPhone 17 Cost?",
    "description": "Tariffs could hike the price of the new iPhone, but other factors play a role, too. What to look for as the release day approaches.",
    "link": "https://www.cnet.com/tech/mobile/how-much-will-the-iphone-17-cost/",
    "timestamp": "2025-05-24T08:02:02Z"
  },
  {
    "title": "Uncertainty lingers after Iran-US talks in Rome: Tehran in 'wait and see' mode",
    "description": "Over the last month and a half, there have been ups and downs in the nuclear talks that often feels like a roller coaster ride.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-855250",
    "timestamp": "2025-05-24T08:00:13Z"
  },
  {
    "title": "'It’s all about symbolism': The tight-lipped Royal Family is sending a message with its trip to Canada",
    "description": "The King and Queen are sending a clear message in support of Canadian sovereignty, royal watchers say",
    "link": "https://nationalpost.com/news/canada/the-tight-lipped-royal-family-is-sending-a-message-with-its-trip-to-canada",
    "timestamp": "2025-05-24T08:00:08Z"
  },
  {
    "title": "Why Dual Citizenship Is The New American Dream",
    "description": "A growing number of Americans are looking at dual citizenship as a \"fire escape plan\" amidst increasing uncertainty and deepening political division in the U.S.",
    "link": "https://www.newsweek.com/why-dual-citizenship-new-american-dream-2075272",
    "timestamp": "2025-05-24T08:00:02Z"
  },
  {
    "title": "The King's visit is a response to Trump's 51st state threats. Will it help?",
    "description": "King Charles III will soon land in Ottawa to deliver the throne speech that kicks off a new session of Parliament. It’s widely understood the King’s visit is meant to push back on U.S. President Donald Trump’s 51st state threats — but not everyone is convince…",
    "link": "https://www.cbc.ca/news/politics/king-charles-visit-trump-1.7542388",
    "timestamp": "2025-05-24T08:00:00Z"
  },
  {
    "title": "Is Moose Jaw the next vacation hotspot? How Canadian tourism might benefit from Canada-U.S. rift",
    "description": "With fewer Canadians heading to the U.S., local tourism operators are hoping for a good summer. And the smaller cities and towns could see the greatest benefit.",
    "link": "https://www.cbc.ca/radio/costofliving/canada-us-domestic-tourism-1.7540055",
    "timestamp": "2025-05-24T08:00:00Z"
  },
  {
    "title": "Canada PM's Daughter And Belgian Princess Entangled In Harvard-Trump Row",
    "description": "Another high-profile student caught between the crosshairs is Princess Elisabeth of Belgium. She is the heir to the Belgian throne and has just completed her first year in a two-year masters program in public policy at the Harvard Kennedy School.",
    "link": "https://www.ndtv.com/world-news/mark-carneys-daughter-and-belgian-princess-entangled-in-harvard-trump-row-8495348",
    "timestamp": "2025-05-24T07:59:21Z"
  }
]