[
  {
    "title": "Trump hosts India's leader, inks US defense and energy sales",
    "description": "President Donald Trump hosted India's leader Thursday at the White House, where the two leaders signed a stack of energy and defense deals, including a path for India to acquire the coveted F-35 stealth fighter.",
    "link": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-250213-voa01.htm",
    "timestamp": "2025-02-14T08:32:28Z"
  },
  {
    "title": "The 51st State That Never Was: Why the United States Didn’t Annex Canada",
    "description": "Why didn’t the United States annex Canada during earlier historical periods? In short, because it didn’t want to. President Donald Trump has drawn widespread criticism (dating back to before his first term) for seeing U.S. foreign policy in ways that reflect …",
    "link": "https://warontherocks.com/2025/02/the-51st-state-that-never-was-why-the-united-states-didnt-annex-canada/",
    "timestamp": "2025-02-14T08:30:23Z"
  },
  {
    "title": "Experts Unveil Altcoin ETF Approval Odds: Litecoin Tops The List, Followed By Dogecoin",
    "description": "Bloomberg exchange-traded fund (ETF) analysts James Seyffart and Eric Balchunas have evaluated the prospects for the altcoin ETF applications submitted by major asset managers these last months.  Their analysis reveals a growing optimism regarding the regulat…",
    "link": "https://bitcoinist.com/experts-unveil-altcoin-etf-approval-odds/",
    "timestamp": "2025-02-14T08:30:09Z"
  },
  {
    "title": "Zelenskiy expected to meet Vance in Munich as security conference begins",
    "description": "MUNICH (Reuters) -Ukrainian President Volodymyr Zelenskiy is expected to meet U.S. Vice President JD Vance in Munich on Friday after Donald Trump startled U.S. allies by calling Vladimir Putin and announcing the start of talks to end the war in Ukraine. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/02/14/zelenskiy-expected-to-meet-vance-in-munich-as-security-conference-begins",
    "timestamp": "2025-02-14T08:30:00Z"
  },
  {
    "title": "Donald Trump Keeps Teasing a Third Term. Here’s What to Know",
    "description": "Here’s how Trump could potentially seek a third term—and what legal experts say.",
    "link": "https://time.com/7222820/trump-third-term-president-explainer-pathways-constitution-courts-legal-experts/",
    "timestamp": "2025-02-14T08:30:00Z"
  },
  {
    "title": "US deports 119 migrants from a variety of nations to Panama",
    "description": "The president said it was the first of three planned flights that were expected to total about 360 people. “It’s not something massive,” he said.",
    "link": "https://nypost.com/2025/02/14/world-news/us-deports-119-migrants-from-several-countries-to-panama/",
    "timestamp": "2025-02-14T08:28:17Z"
  },
  {
    "title": "Most Asian stocks rise as US tariff delays give breathing space",
    "description": "Asian markets mostly rose Friday in line with a rally on Wall Street as traders were buoyed by news that US President Donald Trump's latest reciprocal...",
    "link": "https://finance.yahoo.com/news/most-asian-stocks-rise-us-025222064.html",
    "timestamp": "2025-02-14T08:25:50Z"
  },
  {
    "title": "Malaysia remains consistent in Palestinian issue, says Anwar",
    "description": "PUCHONG: Prime Minister Datuk Seri Anwar Ibrahim on Friday reiterated that the Malaysian government remains consistent and will continue to be vocal and firm in defending Palestinian rights. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/02/14/malaysia-remains-consistent-in-palestinian-issue-says-anwar",
    "timestamp": "2025-02-14T08:25:00Z"
  },
  {
    "title": "Drone attack damages Chernobyl nuclear site, Ukraine and UN agency say",
    "description": "Explosions have been heard and a fire ignited after an unmanned drone hit the roof of Chernobyl's radiation containment shell in Ukraine, according to the International Atomic Energy Agency.",
    "link": "https://www.abc.net.au/news/2025-02-14/drone-attack-damages-chernobyl-site-ukraine-iaea-say/104939746",
    "timestamp": "2025-02-14T08:23:22Z"
  },
  {
    "title": "Shein IPO plans hit by Trump’s low-cost parcels crackdown",
    "description": "Fast fashion group was targeting London listing in first half of 2025",
    "link": "https://www.irishtimes.com/business/2025/02/14/shein-ipo-plans-hit-by-trumps-low-cost-parcels-crackdown/",
    "timestamp": "2025-02-14T08:22:31Z"
  },
  {
    "title": "점진적 보편관세, 강달러와 채권학살",
    "description": "South America, Africa and southern Asia face the greatest shock if President Donald Trump makes good on his pledge for reciprocal tariffs, according to Bloomberg Economics https://t.co/Aeyzu1M1u8— Bloomberg Economics (@economics) February 10, 2025 Why oil and…",
    "link": "https://ryueyes11.tistory.com/511484",
    "timestamp": "2025-02-14T08:22:08Z"
  },
  {
    "title": "Analysis: Why U.S.-Russia Talks On Ukraine War Are A Concern For Kyiv",
    "description": "In the space of a few hours on February 12, U.S. President Donald Trump took his first major public steps toward keeping his promise to end the war in Ukraine, phoning Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy days ahead of …",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-rferl03.htm",
    "timestamp": "2025-02-14T08:19:34Z"
  },
  {
    "title": "High Stakes For Ukraine As World Leaders To Meet For Munich Security Conference",
    "description": "All eyes will be on southern Germany this weekend as world leaders assemble at the Hotel Bayerischer Hof for the three-day Munich Security Conference.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-rferl02.htm",
    "timestamp": "2025-02-14T08:19:32Z"
  },
  {
    "title": "No Deals Without Us, Zelenskyy Says In Response To Trump-Putin Call On Ukraine",
    "description": "Ukrainian President Volodymyr Zelenskyy has reacted sharply to U.S. President Donald Trump's agreement with Russian President Vladimir Putin to begin negotiations to end the war with Ukraine, saying he won't accept any deals made without Ukraine's involvement.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-rferl01.htm",
    "timestamp": "2025-02-14T08:19:31Z"
  },
  {
    "title": "Trump announces first meeting with Putin to take place 'in Saudi Arabia'",
    "description": "US President Donald Trump has announced that his first face-to-face meeting with his Russian counterpart Vladimir Putin during the former's second tenure, would take place in Saudi Arabia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-presstv02.htm",
    "timestamp": "2025-02-14T08:19:30Z"
  },
  {
    "title": "European leaders warn US against Ukraine deal with Russia 'behind our backs'",
    "description": "European leaders have reacted with alarm after US President Donald Trump announced the commencement of Ukraine peace negotiations with his Russian counterpart Vladimir Putin, warning against any deal made without their involvement.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-presstv01.htm",
    "timestamp": "2025-02-14T08:19:28Z"
  },
  {
    "title": "U.S. president says he has talked to Russia's Putin, Ukraine's Zelensky",
    "description": "U.S. President Donald Trump says he has talked to Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky, and that negotiations would soon begin to end the war in Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-irna01.htm",
    "timestamp": "2025-02-14T08:19:08Z"
  },
  {
    "title": "Sara and Ben get engaged on 'Love Is Blind' despite clashing over politics — here's what we know about whether they're still together",
    "description": "Ben and Sara are one couple who make it out of the pods in season eight of \"Love Is Blind.\" Here's what we know about their relationship today.",
    "link": "https://www.businessinsider.com/are-sara-ben-still-together-love-is-blind-season-8-2025-2",
    "timestamp": "2025-02-14T08:19:02Z"
  },
  {
    "title": "Ukraine, US weigh critical minerals agreement",
    "description": "Ukraine and the United States are considering a crucial minerals deal at this week's Munich Security Conference, according to officials from the two countries.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-voa03.htm",
    "timestamp": "2025-02-14T08:18:48Z"
  },
  {
    "title": "EU foreign policy chief: Any Ukraine deal behind our backs will not work",
    "description": "The European Union's top diplomat said Thursday any peace deal struck between the United States and Russia without Ukraine or the EU will fail, responding to U.S. President Donald Trump's indication he soon would be holding talks with Russian President Vladim…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-voa02.htm",
    "timestamp": "2025-02-14T08:18:44Z"
  },
  {
    "title": "Zelenskyy rejects bilateral US-Russia pact to end Moscow's war against Ukraine",
    "description": "Ukrainian President Volodymyr Zelenskyy said Thursday that his country would not accept any agreement on its fate decided bilaterally by Russia and the United States on how to end Moscow's three-year war on Ukraine without Kyiv's involvement.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250213-voa01.htm",
    "timestamp": "2025-02-14T08:18:41Z"
  },
  {
    "title": "UK waiting to see if Trump follows through with tariffs plan",
    "description": "A waiting game on tariffs is beginning to play out between the UK and the United States on tariffs, amid warnings that Donald Trump's latest strategy could hit the UK especially hard.",
    "link": "https://news.sky.com/story/uk-waiting-to-see-if-trump-follows-through-with-tariffs-plan-13309057",
    "timestamp": "2025-02-14T08:12:00Z"
  },
  {
    "title": "Modi snubbed on tariffs as Trump pushes 'reciprocal' trade",
    "description": "Modi left Washington without a tariff exemption as Trump reinforced reciprocal duties, amid talks on trade, defence, and immigration — plus an awkward Trump moment with an Indian reporter.",
    "link": "https://www.abc.net.au/news/2025-02-14/trump-rejects-modi-tariff-plea/104939468",
    "timestamp": "2025-02-14T08:09:48Z"
  },
  {
    "title": "Wall Street Journal Predicts Which Donald Trump Pick Will Be First To Go, And Why",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_232f4939-74bb-413a-b141-9a4f84e584e7",
    "timestamp": "2025-02-14T08:09:09Z"
  },
  {
    "title": "AOC shares tips on how illegal immigrants can evade ICE: ‘Do not open your door’",
    "description": "Rep. Alexandria Ocasio-Cortez’s office hosted a webinar on Wednesday explaining the tactics Immigration and Customs Enforcement (ICE) authorities have been using in New York to arrest illegal immigrants in an apparent effort to help them avoid deportation. Th…",
    "link": "https://freerepublic.com/focus/f-chat/4297512/posts",
    "timestamp": "2025-02-14T08:05:43Z"
  },
  {
    "title": "Chernobyl reactor shield hit by Russian drone, Ukraine says",
    "description": "There has been no increase in radiation levels at the plant, Ukraine's president says.",
    "link": "https://www.bbc.co.uk/news/articles/cwyjvkggdnqo",
    "timestamp": "2025-02-14T08:05:16Z"
  },
  {
    "title": "POLITICO China Watcher – Trump and Modi talk China",
    "description": "Decoding transatlantic relations with Beijing. By PHELIM KINE Send tips here | X @PhelimKine | Bluesky @phelimkine.bsky.social | Subscribe for free | View in your browser Hi, China Watchers.  …",
    "link": "https://www.politico.eu/newsletter/china-watcher/trump-and-modi-talk-china/",
    "timestamp": "2025-02-14T08:05:00Z"
  },
  {
    "title": "Trump Proposes Talks With Xi And Putin On Cutting Nuclear Stockpiles",
    "description": "President Donald Trump said he would like to hold nuclear arms control talks with Russia and China after conflicts in the Middle East and Ukraine are resolved.",
    "link": "https://www.globalsecurity.org/wmd/library/news/usa/2025/usa-250214-rferl01.htm",
    "timestamp": "2025-02-14T08:04:57Z"
  },
  {
    "title": "Open Letter II: President Levin, There Are Now 160 Million Reasons Why You Shouldn’t Have Censored We Want Them Infected Doctors",
    "description": "$160 million is a lot of money, especially when you consider its not just money. It's lost dreams, careers, and discoveries.\nThe post Open Letter II: President Levin, There Are Now 160 Million Reasons Why You Shouldn’t Have Censored We Want Them Infected Doct…",
    "link": "https://sciencebasedmedicine.org/openletter2/",
    "timestamp": "2025-02-14T08:04:00Z"
  },
  {
    "title": "Trump floats idea of U.S., Russia and China halving defense spending",
    "description": "Trump’s proposal highlights how willing he is to upend standard foreign-policy craft and foster closer ties with two U.S. adversaries.",
    "link": "https://www.japantimes.co.jp/news/2025/02/14/world/politics/trump-china-russia-defense/",
    "timestamp": "2025-02-14T08:04:00Z"
  },
  {
    "title": "Five key takeaways from Modi-Trump talks",
    "description": "Modi and Trump rekindle ties amid a global trade war, balancing tariffs, trade deals and strategic interests.",
    "link": "https://www.bbc.com/news/articles/c23ndleveymo",
    "timestamp": "2025-02-14T08:03:42Z"
  },
  {
    "title": "Jimmy Kimmel Hits Trump With 'Honestly Amazing' Reminder",
    "description": "The late night host isn't impressed by the president's deal-making powers.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-russia_n_67aecd51e4b0513a8d768bdb",
    "timestamp": "2025-02-14T08:01:32Z"
  },
  {
    "title": "Taiwan pledges to communicate and invest more in the US after Trump tariff threats",
    "description": "Taiwan President Lai Ching-te said Friday he would communicate more with the U.S. over President Donald Trump’s concerns over the chip industry and invest more in the U.S, hours after Trump ordered reciprocal tariffs on trade partners.\nTrump said on Thursday …",
    "link": "https://biztoc.com/x/8a703224c0ce5b40",
    "timestamp": "2025-02-14T08:01:17Z"
  },
  {
    "title": "Pope Francis Has United the World—Against Himself",
    "description": "The pope's remarks on immigration, Gaza and Ukraine have attracted considerable scrutiny in the final years of his papacy.",
    "link": "https://www.newsweek.com/pope-francis-united-world-against-himself-2030649",
    "timestamp": "2025-02-14T08:00:01Z"
  },
  {
    "title": "Putin Won",
    "description": "Trump's talks to end the war in Ukraine appear to meet the Russian president's goals.",
    "link": "https://www.newsweek.com/putin-russia-trump-winning-2030475",
    "timestamp": "2025-02-14T08:00:01Z"
  },
  {
    "title": "Campuses Quiet as Higher Ed Navigates Trump’s Orders",
    "description": "Campuses Quiet as Higher Ed Navigates Trump’s Orders\n\n \n\n\n \nJohanna Alonso\n\nFri, 02/14/2025 - 03:00 AM\n\nStudents are holding few protests against the president’s executive orders, though some organizers are trying to make their voices heard. What accounts for…",
    "link": "https://www.insidehighered.com/news/students/free-speech/2025/02/14/few-students-protest-trumps-executive-orders-campus",
    "timestamp": "2025-02-14T08:00:00Z"
  },
  {
    "title": "ACE Adopts a Fighting Stance",
    "description": "ACE Adopts a Fighting Stance\n\n \n\n\n \nJosh Moody\n\nFri, 02/14/2025 - 03:00 AM\n\nAt ACE’s annual conference, higher education leaders noted that they want to find common ground with Trump—but they’re also willing to fight back as he takes aim at the sector.\n \n Byl…",
    "link": "https://www.insidehighered.com/news/government/politics-elections/2025/02/14/ace-strikes-fighting-stance-annual-conference",
    "timestamp": "2025-02-14T08:00:00Z"
  },
  {
    "title": "Prepared for Spiritual Warfare",
    "description": "Prepared for Spiritual Warfare\n\n \n\n\n \nmclemee@gmail.com\n\nFri, 02/14/2025 - 03:00 AM\n\nScott McLemee considers the continuing cultural resonance of Will Arbery’s Heroes of the Fourth Turning.\n \n Byline(s)\n \n Scott McLemee\n \n \nPrepared for Spiritual Warfare\n\n \n\n…",
    "link": "https://www.insidehighered.com/opinion/views/intellectual-affairs/2025/02/14/essay-play-heroes-fourth-turning-opinion",
    "timestamp": "2025-02-14T08:00:00Z"
  },
  {
    "title": "Trump to impose retaliatory tariffs on Canada, France over digital services taxes",
    "description": "WASHINGTON, Feb. 14 (Xinhua) -- As U.S. President Donald Trump signed an executive order for recipro",
    "link": "http://en.people.cn/n3/2025/0214/c90000-20277037.html",
    "timestamp": "2025-02-14T07:59:42Z"
  },
  {
    "title": "The Wire China – DOGE’s Latest Target is Seen as a Gift to the CCP",
    "description": "The National Endowment for Democracy has long been a thorn in the CCP's side. On Tuesday, its funding was frozen.",
    "link": "https://www.thewirechina.com/2025/02/12/doges-latest-target-is-seen-as-a-gift-to-the-ccp/",
    "timestamp": "2025-02-14T07:59:05Z"
  },
  {
    "title": "The 8 at 8: Friday",
    "description": "Taoiseach and Tánaiste travel to Munich, Trump signals more tariffs, and Government to charter deportation flights.",
    "link": "https://www.thejournal.ie/8-at-8-257-6622669-Feb2025/",
    "timestamp": "2025-02-14T07:58:53Z"
  },
  {
    "title": "China rights monitors suspend work and lay off staff amid U.S. aid freeze",
    "description": "The groups are key to documenting a yearslong crackdown by President Xi Jinping on minorities, rights defenders and lawyers.",
    "link": "https://www.japantimes.co.jp/news/2025/02/14/asia-pacific/china-rights-monitors-freeze/",
    "timestamp": "2025-02-14T07:58:00Z"
  },
  {
    "title": "White House blocks Associated Press reporter from Modi news conference over Gulf of Mexico row",
    "description": "The White House had no immediate comment about Thursday’s additional actions.",
    "link": "https://www.thejournal.ie/white-house-blocks-associated-press-reporter-from-modi-news-conference-over-gulf-of-mexico-row-6622675-Feb2025/",
    "timestamp": "2025-02-14T07:55:01Z"
  },
  {
    "title": "US approves extradition of 2008 Mumbai attack suspect to India",
    "description": "The United States has approved the extradition of a suspect linked to the 2008 Mumbai terrorist attacks, in which over 160 people were killed. President Donald Trump made the announcement on Thursday during a joint press conference with Indian Prime Minister …",
    "link": "https://punchng.com/us-approves-extradition-of-2008-mumbai-attack-suspect-to-india/",
    "timestamp": "2025-02-14T07:54:53Z"
  },
  {
    "title": "TikTok returns to Apple, Google app stores",
    "description": "TikTok has returned to Apple and Google app stores nearly a month after a new security law forced its removal, AFP journalists confirmed on Thursday. The Chinese-owned social media platform faces being banned in the United States over national security concer…",
    "link": "https://punchng.com/tiktok-returns-to-apple-google-app-stores/",
    "timestamp": "2025-02-14T07:54:53Z"
  },
  {
    "title": "No peace over the heads of Ukrainians and Europeans, says German foreign minister",
    "description": "BERLIN (Reuters) - There must be no peace in Ukraine over the heads of Ukrainians and Europeans, German Foreign Minister Annalena Baerbock said on Friday at the start of the Munich Security Conference. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/14/no-peace-over-the-heads-of-ukrainians-and-europeans-says-german-foreign-minister",
    "timestamp": "2025-02-14T07:54:00Z"
  },
  {
    "title": "China rights monitors suspend work, lay off staff after U.S. aid freeze",
    "description": "Dozens of non-government groups monitoring dissent, human and labour rights in China have laid off staff after being forced to suspend work following a freez...",
    "link": "https://www.aol.com/news/china-rights-monitors-suspend-lay-075335124.html",
    "timestamp": "2025-02-14T07:53:35Z"
  },
  {
    "title": "President Trump Demands Fair, Reciprocal Trade - The White House",
    "description": "President Trump Demands Fair, Reciprocal TradeThe White House Trump orders up a plan for more tariffs, even as inflation heats upCNN What is Donald Trump’s ‘reciprocal’ tariff plan?Financial Times White House Targets Canada’s Digital Tax in Reciprocal Tariff …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176241009",
    "timestamp": "2025-02-14T07:52:54Z"
  },
  {
    "title": "Taiwan pledges chip talks with US, more investment to mollify Trump - Reuters",
    "description": "Taiwan pledges chip talks with US, more investment to mollify TrumpReuters Taiwan pledges to communicate and invest more in the US after Trump tariff threatsABC News Taiwan pledges to boost US investment after Donald Trump’s tariff threatFinancial Times Taiwa…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176241003",
    "timestamp": "2025-02-14T07:52:23Z"
  },
  {
    "title": "TikTok returns to Apple and Google app stores in the US",
    "description": "TikTok has returned to the app stores of Apple and Google in the U.S., after President Donald Trump delayed the enforcement of a TikTok ban.",
    "link": "https://www.clickondetroit.com/business/2025/02/14/tiktok-returns-to-apple-and-google-app-stores-in-the-us/",
    "timestamp": "2025-02-14T07:49:46Z"
  },
  {
    "title": "Thousands fired in US government as Trump, Musk purge federal workers",
    "description": "Trump and Tesla CEO Musk's overhaul of the federal government appeared to be widening as Musk aides arrived for the first time at the federal tax-collecting agency, the Internal Revenue Service, and US embassies were told to prepare for staff cuts.",
    "link": "https://nypost.com/2025/02/14/us-news/trump-musk-fire-thousands-us-government-workers-in-federal-purge/",
    "timestamp": "2025-02-14T07:48:37Z"
  },
  {
    "title": "Friday's papers: PM Orpo on Trump call, trapped wives and scammy Valentines",
    "description": "US President Trump's call to Vladimir Putin was a major topic of discussion during Finnish Parliament's question hour on Thursday evening.",
    "link": "https://yle.fi/a/74-20143692",
    "timestamp": "2025-02-14T07:46:40Z"
  },
  {
    "title": "Vance blasts ‘Russian meddling’ excuse",
    "description": "US Vice President J.D. Vance has accused EU political parties of ignoring public sentiment and resorting to censorship while blaming Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612691-vance-russian-meddling-eu/",
    "timestamp": "2025-02-14T07:46:09Z"
  },
  {
    "title": "TikTok Returns on Apple, Google US App Stores as President Trump Delays Ban",
    "description": "US President Donald Trump has delayed a ban on TikTok. Owing to the development, the app has returned to the US app stores of Apple and Google. Although TikTok resumed service after Trump's assurances, Google and Apple kept the app removed from their US app s…",
    "link": "https://www.gadgets360.com/apps/news/tiktok-returns-apple-google-us-app-stores-donald-trump-delay-ban-7708362",
    "timestamp": "2025-02-14T07:43:18Z"
  },
  {
    "title": "US targets diversity, equity, inclusion at United Nations",
    "description": "UNITED NATIONS/BEIRUT: The United States has warned United Nations organisations UNICEF and UN Women against any focus on diversity, equity, inclusion and gender ideology as a UN food official sought to avoid Washington's ire by advising some staff to tone do…",
    "link": "https://www.channelnewsasia.com/world/united-nations-dei-diversity-equity-inclusion-trump-4938236",
    "timestamp": "2025-02-14T07:41:04Z"
  },
  {
    "title": "Hamas expected to name 3 Israeli hostages for release this weekend",
    "description": "The militant group Hamas is expected to release the names of three hostages it will exchange for Palestinian prisoners this weekend, after it expressed its commitment to a ceasefire with Israel.\n\n\nThe next release of hostages was cast in doubt after Hamas acc…",
    "link": "https://www.voanews.com/a/hamas-expected-to-name-3-israeli-hostages-for-release-this-weekend/7974759.html",
    "timestamp": "2025-02-14T07:39:16Z"
  },
  {
    "title": "US attorneys general sue to challenge Elon Musk and DOGE’s authority",
    "description": "A new lawsuit challenges Trump ally's government agency, saying it was unlawfully given 'virtually unchecked power'.",
    "link": "https://www.aljazeera.com/news/2025/2/14/us-attorneys-general-sue-to-challenge-elon-musk-and-doges-authority",
    "timestamp": "2025-02-14T07:37:46Z"
  },
  {
    "title": "Valve removed the game PirateFi from the Steam video game platform because contained a malware",
    "description": "Valve removed a game from Steam because it contained malware, the company also warned affected users to reformat their operating systems. Valve removed the game PirateFi from the Steam video game platform because it contained a Windows malicious code to steal…",
    "link": "https://securityaffairs.com/174205/malware/valve-removed-a-game-from-steam.html",
    "timestamp": "2025-02-14T07:35:54Z"
  },
  {
    "title": "Inside living hell prison where Trump's sending illegal immigrant gangs: It's filled with terrorists, there's a minefield outside... and some are 'tortured' 83 times a month",
    "description": "Handcuffed and dressed in jail-issue tracksuits, a small batch of prisoners wait in line to be marched on to a transport plane and flown off to a new home that holds a uniquely notorious place in the annals of US justice. The ten prisoners, all members of Tre…",
    "link": "https://freerepublic.com/focus/f-chat/4297507/posts",
    "timestamp": "2025-02-14T07:35:13Z"
  },
  {
    "title": "Takeaways from Modi, Trump meeting: Cooperation on trade and defense — plus some mutual praise",
    "description": "Indian Prime Minister Narendra Modi and the United States President Donald Trump have spoken about easing tariffs and resolving trade concerns between the two countries, while also shoring up defense ties",
    "link": "https://abcnews.go.com/International/wireStory/takeaways-modi-trump-meeting-cooperation-trade-defense-mutual-118815280",
    "timestamp": "2025-02-14T07:34:24Z"
  },
  {
    "title": "Taiwan pledges to communicate and invest more in the US after Trump tariff threats",
    "description": "Taiwan President Lai Ching-te says he will communicate more with the U.S. over President Donald Trump’s concerns over the chip industry and invest more in the U.S. Trump said Thursday that Taiwan had taken away the U.S. chip business and he wanted it b...",
    "link": "https://abcnews.go.com/International/wireStory/taiwan-pledges-communicate-invest-us-after-trump-tariff-118815189",
    "timestamp": "2025-02-14T07:33:49Z"
  },
  {
    "title": "Japan in contact with U.S. over tariffs; says it will respond appropriately",
    "description": "Japan has been in contact with the United States over President Donald Trump's plan to impose reciprocal tariffs and will respond &quot;appropriately&quot; after examining their impact, the top government spokesman said Friday. Chief Cabinet Secretary Yoshima…",
    "link": "https://japantoday.com/category/politics/japan-in-contact-with-u.s.-over-tariffs-to-respond-appropriately",
    "timestamp": "2025-02-14T07:33:30Z"
  },
  {
    "title": "DOGE Approved to Transfer Labor Dept Data Using PuTTY",
    "description": "NBC is reporting that Elon Musk’s Department of Government Efficiency has received approval from the Labor Department to use software that could allow it to transfer vast amounts of data out of Labor’s systems, according to records seen by NBC News and interv…",
    "link": "https://slashdot.org/submission/17333241/doge-approved-to-transfer-labor-dept-data-using-putty",
    "timestamp": "2025-02-14T07:33:08Z"
  },
  {
    "title": "Hamas expected to name Israeli hostages it will free this weekend",
    "description": "Hamas was expected Friday to name three hostages it will release this weekend as part of a planned exchange for Palestinian prisoners, local media said, after days of uncertainty in which Israel threatened to scrap a nearly month-old Gaza ceasefire deal.",
    "link": "https://www.hurriyetdailynews.com/hamas-expected-to-name-israeli-hostages-it-will-free-this-weekend-205817",
    "timestamp": "2025-02-14T07:33:00Z"
  },
  {
    "title": "How US tariffs could reshape India's export landscape? Radhika Rao explains",
    "description": "​If you take the baseline of first term of President Trump, the action usually starts low, there is a lot of study going on but eventually they do put tariffs in place.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/how-us-tariffs-could-reshape-indias-export-landscape-radhika-rao-explains/articleshow/118238995.cms",
    "timestamp": "2025-02-14T07:30:52Z"
  },
  {
    "title": "CNBC Daily Open: PPI and tariffs cloud markets, but investors choose to see silver lining",
    "description": "Humans are forward-looking. That can lead to preparation but also anxiety. On Thursday, optimism and relief won over fears and worries, rallying stocks.",
    "link": "https://www.cnbc.com/2025/02/14/cnbc-daily-open-silver-lining-in-markets-amid-hot-ppi-and-tariffs.html",
    "timestamp": "2025-02-14T07:30:01Z"
  },
  {
    "title": "TikTok Returns to Apple and Google App Stores in the U.S. After Trump Delayed Ban",
    "description": "The app is available again for download from Apple’s and Google’s app stores after it was removed following a U.S. ban on Jan. 18.",
    "link": "https://time.com/7222811/tiktok-app-store-apple-google-us-ban-trump/",
    "timestamp": "2025-02-14T07:30:00Z"
  },
  {
    "title": "X Employee Shares Mom's Text On Valentine's Day. Elon Musk Reacts",
    "description": "As the world celebrates Valentine&#039;s Day, an employee of social media platform X has shared a message from her mother for none other than Elon Musk. The message? Elon Musk is her &quot;hero&quot;.",
    "link": "https://www.ndtv.com/offbeat/x-employee-shares-moms-text-on-valentines-day-elon-musk-reacts-7708235",
    "timestamp": "2025-02-14T07:29:28Z"
  },
  {
    "title": "Trump may have done Indians a big favor as they are talking about trade again",
    "description": "Modi-Trump Meeting: The US-India trade relationship takes a forward leap as President Trump and Prime Minister Modi agreed to negotiate a trade agreement by fall. This development revitalizes market access discussions across Indo-Pacific nations, likely endin…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-may-have-done-indians-a-big-favor-as-they-are-talking-about-trade-again/articleshow/118238657.cms",
    "timestamp": "2025-02-14T07:27:33Z"
  },
  {
    "title": "Trump may have done Indians a big favor as they are talking about trade again",
    "description": "Modi-Trump Meeting: The US-India trade relationship takes a forward leap as President Trump and Prime Minister Modi agreed to negotiate a trade agreement by fall. This development revitalizes market access discussions across Indo-Pacific nations, likely endin…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-may-have-done-indians-a-big-favor-as-they-are-talking-about-trade-again/articleshow/118239244.cms",
    "timestamp": "2025-02-14T07:27:33Z"
  },
  {
    "title": "Taiwan’s Lai vows to lift military funding after Trump complaint",
    "description": "Lai said Taiwan would boost expenditure to 3% of GDP, though he didn’t indicate when that would start.",
    "link": "https://www.japantimes.co.jp/news/2025/02/14/asia-pacific/politics/taiwan-lai-military-funding-trump/",
    "timestamp": "2025-02-14T07:26:00Z"
  },
  {
    "title": "'Because They Serve The Public, Not Billionaires': Dems Blast Trump's Probationary Federal Workforce Cuts",
    "description": "President Trump's massive workforce layoffs have started and probationary workers were the hardest-hit in the first wave of reductions – some Democratic lawmakers are against the initiative.",
    "link": "https://www.ibtimes.com/because-they-serve-public-not-billionaires-dems-blast-trumps-probationary-federal-workforce-3763696",
    "timestamp": "2025-02-14T07:25:05Z"
  },
  {
    "title": "No other county has right to dictate future of Palestinians, says Anwar",
    "description": "PUCHONG: No other country has the right to dictate the future of Palestinians, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/02/14/no-other-county-has-right-to-dictate-future-of-palestinians-says-anwar",
    "timestamp": "2025-02-14T07:23:00Z"
  },
  {
    "title": "US escalating trade wars with sweeping reciprocal tariffs",
    "description": "U.S. President Donald Trump has inked plans for sweeping \"reciprocal tariffs\" that could hit both allies and competitors, in a dramatic escalation of an international trade war that economists warn could fuel inflation at home.",
    "link": "https://www.hurriyetdailynews.com/us-escalating-trade-wars-with-sweeping-reciprocal-tariffs-205814",
    "timestamp": "2025-02-14T07:21:15Z"
  },
  {
    "title": "Too quiet on set? Hollywood pushes for more LA productions post wildfires",
    "description": "January's wildfires have exacerbated the decline of Hollywood's once booming film and television industry.",
    "link": "https://www.bbc.com/news/articles/c8d9z68grn3o",
    "timestamp": "2025-02-14T07:20:41Z"
  },
  {
    "title": "Why is Donald Trump discontinuing the penny?",
    "description": "The one cent coin costs more to produce than its value and is nearly obsolete in retail. But it has its supporters.",
    "link": "https://www.aljazeera.com/news/2025/2/14/why-is-donald-trump-discontinuing-the-penny",
    "timestamp": "2025-02-14T07:20:19Z"
  },
  {
    "title": "Xi to chair symposium attended by Jack Ma and other Chinese business leaders, sources say",
    "description": "Xi rarely chairs symposiums about the private sector, and the event underscores the numerous challenges currently facing China.",
    "link": "https://www.japantimes.co.jp/business/2025/02/14/economy/xi-symposium-jack-ma-china-business/",
    "timestamp": "2025-02-14T07:20:00Z"
  },
  {
    "title": "Türkiye-US trade, investment talks may gather pace: Özyeğin",
    "description": "With Donald Trump back in office now, talks that would help increase trade and investment between Türkiye and the United States are expected to gather pace, says Murat Özyeğin, head of the Türkiye-U.S. Business Council (TAİK).",
    "link": "https://www.hurriyetdailynews.com/turkiye-us-trade-investment-talks-may-gather-pace-ozyegin-205812",
    "timestamp": "2025-02-14T07:16:26Z"
  },
  {
    "title": "Oil Prices Set to Reverse Losing Streak",
    "description": "Crude oil prices were on course to end the week with a gain, snapping a three-week string of losses as Trump signaled reciprocal tariffs for U.S. trade partners will not come into effect until at least April. At the time of writing, Brent crude was trading at…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Set-to-Reverse-Losing-Streak.html",
    "timestamp": "2025-02-14T07:15:09Z"
  },
  {
    "title": "Nippon Steel wants 100% of U.S. Steel, not a minority stake, report says",
    "description": "Last week, the deal appeared effectively dead after a meeting between Prime Minister Shigeru Ishiba and U.S. President Donald Trump.",
    "link": "https://biztoc.com/x/193a2caf914092af",
    "timestamp": "2025-02-14T07:12:12Z"
  },
  {
    "title": "Claudia Sheinbaum Says Mexican Government May Sue Google Over 'Gulf Of Mexico' Name Change",
    "description": "Mexican President Claudia Sheinbaum said Thursday that her government may file a civil lawsuit against Alphabet Inc.'s GOOG GOOGL Google for labeling the Gulf of Mexico as the “Gulf of America” on its maps, following a controversial decree by U.S. President D…",
    "link": "https://biztoc.com/x/18c8ef744b659f08",
    "timestamp": "2025-02-14T07:11:21Z"
  },
  {
    "title": "Taiwan pledges to communicate and invest more in the US after Trump tariff threats",
    "description": "TAIPEI, Taiwan (AP) — Taiwan President Lai Ching-te said Friday he would communicate more with the U.S. over President Donald Trump’s concerns over the chip industry and invest more in the U.S, hours after Trump ordered reciprocal tariffs on trade partners. T…",
    "link": "https://financialpost.com/pmn/taiwan-pledges-to-communicate-and-invest-more-in-the-us-after-trump-tariff-threats",
    "timestamp": "2025-02-14T07:11:16Z"
  },
  {
    "title": "Nippon Steel wants 100% of U.S. Steel, not a minority stake, report says",
    "description": "Last week, the deal appeared effectively dead after a meeting between Prime Minister Shigeru Ishiba and U.S. President Donald Trump.",
    "link": "https://www.japantimes.co.jp/business/2025/02/14/companies/nippon-steel-report/",
    "timestamp": "2025-02-14T07:11:00Z"
  },
  {
    "title": "TikTok returns to Apple App Store and Google Play in US",
    "description": "Chinese social media platform again available for download in US as Donald Trump continues to mull its future there amid security concerns\nTikTok returned to the US app stores of Apple and Google on Thursday as President Donald Trump delayed a ban on the Chin…",
    "link": "https://biztoc.com/x/962947bebdbef0b8",
    "timestamp": "2025-02-14T07:10:50Z"
  },
  {
    "title": "Plane Carrying US' Marco Rubio To Germany Turns Back Over 'Mechanical' Issue",
    "description": "US Secretary of State Marco Rubio was forced to turn back Thursday on his second trip abroad due to a mechanical issue with his airplane.",
    "link": "https://www.ndtv.com/world-news/plane-carrying-us-marco-rubio-to-germany-turns-back-over-mechanical-issue-7708130",
    "timestamp": "2025-02-14T07:10:11Z"
  },
  {
    "title": "How the cost of eggs, gas and more is changing under President Trump",
    "description": "While President Donald Trump has been in office less than a month, the costs of some consumer goods and services are trending up.\nAt nearly $5 a dozen, the price of eggs just surpassed record highs, and while quite moderate in comparison, bread, electricity, …",
    "link": "https://biztoc.com/x/f5d94642a75084b6",
    "timestamp": "2025-02-14T07:09:59Z"
  },
  {
    "title": "My Word: The haunted eyes of hostages in Gaza",
    "description": "Without a concerted international effort to back Israel, the “day after” will be another October 7. And the day after that will be 9/11 all over again.",
    "link": "https://www.jpost.com/opinion/article-842133",
    "timestamp": "2025-02-14T07:06:39Z"
  },
  {
    "title": "The dismantling of a malevolent empire",
    "description": "USAID is only one outpost of a corrupted humanitarian establishment. “Human rights” have been turned into the anvil upon which justice and conscience are being smashed. Opinion.",
    "link": "https://www.israelnationalnews.com/news/403919",
    "timestamp": "2025-02-14T07:03:50Z"
  },
  {
    "title": "There’s good news (for now) if you’re a TikTok user in the US",
    "description": "TikTok received a reprieve from President Donald Trump, and there's more good news for the platform in the US.",
    "link": "https://www.androidauthority.com/tiktok-back-on-play-store-app-store-3526289/",
    "timestamp": "2025-02-14T07:03:29Z"
  },
  {
    "title": "Elon Musk's Power in Trump's Government Is Challenged In Court",
    "description": "Elon Musk is facing the most direct legal challenge over the role he&#039;s assumed in the US government, with Democratic state officials and federal employees claiming that President Donald Trump has unconstitutionally delegated vast powers to him.",
    "link": "https://www.ndtv.com/world-news/elon-musks-power-in-trumps-government-is-challenged-in-court-7708101",
    "timestamp": "2025-02-14T07:02:35Z"
  },
  {
    "title": "Ukraine: US VP Vance threatens sanctions, military action to push Putin into deal",
    "description": "Donald Trump tells US officials to begin talks on ending nearly three-year-long conflict",
    "link": "https://www.irishtimes.com/world/europe/2025/02/14/ukraine-russia-trump-latest/",
    "timestamp": "2025-02-14T07:02:14Z"
  },
  {
    "title": "American AI freedom still under threat from Biden’s leftover directives",
    "description": "Vice President Vance was just in Europe defending American AI freedom. But back home in America, Biden's leftover directives are still putting our tech plans under threat.",
    "link": "https://www.foxnews.com/opinion/american-ai-freedom-still-under-threat-from-bidens-leftover-directives",
    "timestamp": "2025-02-14T07:00:19Z"
  },
  {
    "title": "TikTok returns to Android and Apple app stores in the US",
    "description": "TikTok returns to Apple and Google app stores in the US\nTikTok is again available on the US app stores of Apple and Google, after President Donald Trump postponed enforcement of a ban of the Chinese-owned social media platform until 5 April.\nThe popular app, …",
    "link": "https://biztoc.com/x/b29e09168edb5769",
    "timestamp": "2025-02-14T07:00:02Z"
  },
  {
    "title": "India To Be Hit Hard By Trump's Reciprocal Tariffs. Here's Why",
    "description": "The impact of these tariffs is expected to be far-reaching, with India&#039;s food products, vegetables, textiles, and clothing sectors likely to be hit the hardest.",
    "link": "https://www.ndtv.com/world-news/india-to-be-hit-hard-by-donald-trumps-reciprocal-tariffs-heres-why-7708057",
    "timestamp": "2025-02-14T06:58:52Z"
  },
  {
    "title": "\"Lies Are Pushed\": Reporter Barred Again From Trump's 'Gulf Of America' Event",
    "description": "The Associated Press said its reporter was barred from a White House event for the third day straight, in a mushrooming row over its refusal to call the Gulf of Mexico the &quot;Gulf of America.&quot;",
    "link": "https://www.ndtv.com/world-news/lies-are-pushed-reporter-barred-again-from-trumps-gulf-of-america-event-7708053",
    "timestamp": "2025-02-14T06:58:08Z"
  },
  {
    "title": "Migration, MEGA, Greatest Trade Route: Takeaways From PM Modi-Trump Presser",
    "description": "Prime Minister Narendra Modi and US President Donald Trump addressed a press conference on the last day of the former&#039;s two-day visit, issuing announcements pertaining to trade, immigration, defence, technology and crime.",
    "link": "https://www.ndtv.com/world-news/migration-mega-greatest-trade-route-takeaways-from-pm-modi-trump-presser-7708051",
    "timestamp": "2025-02-14T06:57:25Z"
  }
]