[
  {
    "title": "BRICS must end dollar’s dominance – Lula",
    "description": "BRICS is committed to cutting its reliance on the dollar despite the US president’s tariff threats, Brazil’s Lula da Silva has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613429-brics-lula-dollar-trump/",
    "timestamp": "2025-02-28T09:54:27Z"
  },
  {
    "title": "Trump appoints Paul Dabbar, Hung Cao to positions within administration",
    "description": "President Donald Trump appointed Hung Cao to under secretary of the Navy and Paul Dabbar to deputy secretary of commerce late Thursday.",
    "link": "https://www.foxnews.com/politics/trump-appoints-hung-cao-paul-dabbar-positions-within-administration",
    "timestamp": "2025-02-28T09:53:05Z"
  },
  {
    "title": "European shares drop on Trump's plan to implement tariffs",
    "description": "European shares extended declines on Friday, as market sentiment was dented after U.S. President Donald Trump said his proposed tariffs on Mexican and Canadian goods would take effect next week.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-drop-on-trumps-plan-to-implement-tariffs/articleshow/118625847.cms",
    "timestamp": "2025-02-28T09:48:07Z"
  },
  {
    "title": "China vows countermeasures against US new tariffs",
    "description": "China, on Friday, vowed to take “all necessary countermeasures” after US President, Donald Trump, said he would impose an additional 10 percent tariff on Chinese imports — a decision Beijing warned would “seriously impact dialogue”. Trump’s latest move will c…",
    "link": "https://punchng.com/china-vows-countermeasures-against-us-new-tariffs/",
    "timestamp": "2025-02-28T09:46:56Z"
  },
  {
    "title": "America’s avocado obsession is destroying Mexico’s forests. Is there a fix?",
    "description": "With deforestation rising and violence a constant threat, a bold initiative is using satellites to ensure U.S. supermarkets sell ethical, eco-friendly avocados.",
    "link": "http://grist.org/food-and-agriculture/americas-avocado-obsession-is-destroying-mexicos-forests-is-there-a-fix/",
    "timestamp": "2025-02-28T09:45:00Z"
  },
  {
    "title": "Global stocks slide as tariff threats add to big tech jitters",
    "description": "Equities fall after Trump’s latest trade threats and a Wall Street sell-off led by Nvidia",
    "link": "https://www.irishtimes.com/business/markets/2025/02/28/global-stocks-slide-as-tariff-threats-add-to-big-tech-jitters/",
    "timestamp": "2025-02-28T09:42:39Z"
  },
  {
    "title": "Quiz of The Week: 22 - 28 February",
    "description": "Have you been paying attention to The Week's news?",
    "link": "https://theweek.com/puzzles/quiz-of-the-week-22-28-february",
    "timestamp": "2025-02-28T09:39:16Z"
  },
  {
    "title": "Trump says $5m ’gold card’ immigration visas will ’sell like crazy’",
    "description": "President Donald Trump has unveiled plans for selling a \"gold card\" visa for $5m (£3.9m) that will offer wealthy buyers permanent residency in the US and a path to citizenship. At the first cabinet meeting of his current term, Trump told reporters t...",
    "link": "https://www.hospitalitynet.org/external/4126068.html",
    "timestamp": "2025-02-28T09:35:52Z"
  },
  {
    "title": "Global splinters evident at G20 finance ministers meeting",
    "description": "The Group of 20 major economies has been instrumental in coordinating the response to crises like the COVID pandemic. But top officials from the U.S. and several other member states skipped the G20 finance ministers' meeting in South Africa this week, raising…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250227-voa05.htm",
    "timestamp": "2025-02-28T09:35:05Z"
  },
  {
    "title": "The Opacity of Hope",
    "description": "The United States underwent a profound political transformation after the terrorist attacks of September 11, 2001, with fear becoming the primary force shaping national discourse. Barack Obama’s presidency was seen as a chance to reverse this trend, but his v…",
    "link": "https://www.project-syndicate.org/onpoint/how-failure-of-obama-hope-paved-the-way-for-trump-by-jonathan-levy-2025-02",
    "timestamp": "2025-02-28T09:34:16Z"
  },
  {
    "title": "Alec Baldwin's wife, Hilaria, stormed after comedian after star threatened to snap his neck: 'Down for him'",
    "description": "Comedian Jason Scoop recalls Alec Baldwin's wife, Hilaria, running to the actor's defense.",
    "link": "https://www.foxnews.com/entertainment/alec-baldwins-wife-hilaria-stormed-after-comedian-after-star-threatened-snap-his-neck-down-him",
    "timestamp": "2025-02-28T09:30:36Z"
  },
  {
    "title": "Grieg Seafood pausing construction on Marystown expansion project",
    "description": "Grieg Seafood Canada says it's putting a pause on completing a large-scale salmon farming facility in the Newfoundland and Labrador community of Marystown. That decision is largely driven by the inability to find a financing partner and the looming threat of …",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/grieg-post-smolt-delay-1.7470314",
    "timestamp": "2025-02-28T09:30:00Z"
  },
  {
    "title": "NATO Secretary General call with President Trump",
    "description": "NATO Secretary General Mark Rutte spoke with Donald Trump, President of the United States, today. He thanked the President for his commitment to a strong NATO Alliance and a lasting peace in Ukraine.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250227-nato01.htm",
    "timestamp": "2025-02-28T09:26:33Z"
  },
  {
    "title": "EU will 'do the same' if US implements tariff hikes: French finance minister",
    "description": "French Finance Minister Eric Lombard has said the European Union will retaliate with tit-for-tat measures if the United States imposes tariffs on European products.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250227-presstv04.htm",
    "timestamp": "2025-02-28T09:24:08Z"
  },
  {
    "title": "Trump planning sweeping cuts to State Department – Politico",
    "description": "Donald Trump plans to shrink the State Department, cutting diplomats and embassies to focus on transactional policies, Politico has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613428-trump-cuts-state-department/",
    "timestamp": "2025-02-28T09:23:34Z"
  },
  {
    "title": "Starmer visits US amid intensifying diplomatic game in transatlantic alliance",
    "description": "Europe is ramping up diplomatic efforts to secure continued US support for Ukraine, with British Prime Minister Keir Starmer set to meet US President Donald Trump in Washington on Thursday, closely following French President Emmanuel Macron's visit. However, …",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250227-globaltimes02.htm",
    "timestamp": "2025-02-28T09:22:53Z"
  },
  {
    "title": "India is copying China playbook for a wide global footprint",
    "description": "India is forming a consortium of state-owned companies to develop and operate ports overseas, responding to China's global maritime influence. This initiative aims to bolster India's strategic and trade positioning by enhancing its global shipping network, su…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-is-copying-china-playbook-for-a-wide-global-footprint/articleshow/118624972.cms",
    "timestamp": "2025-02-28T09:22:44Z"
  },
  {
    "title": "India is copying China playbook for a wide global footprint",
    "description": "India is forming a consortium of state-owned companies to develop and operate ports overseas, responding to China's global maritime influence. This initiative aims to bolster India's strategic and trade positioning by enhancing its global shipping network, su…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-is-copying-china-playbook-for-a-wide-global-footprint/articleshow/118625104.cms",
    "timestamp": "2025-02-28T09:22:44Z"
  },
  {
    "title": "Who is Jeffrey Epstein? From a physics teacher to disgraced financer and sex offender",
    "description": "The US department of justice (DOJ) has released a trove of government documents related to Jeffrey Epstein, the disgraced financier and convicted sex offender. Jeffrey Epstein had close ties with powerful elites, celebrities and politicians. Jeffrey Epstein w…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-jeffrey-epstein-files-released-who-is-jeffrey-epstein-from-a-physics-teacher-to-disgraced-financer-and-sex-offender/articleshow/118624960.cms",
    "timestamp": "2025-02-28T09:22:11Z"
  },
  {
    "title": "Pezeshkian: Iran will hold talks but won't give in to 'bullies'",
    "description": "President Masoud Pezeshkian says Iran will hold negotiations, but will not give in to \"bullies\", while reiterating that the Islamic Republic seeks peace and tranquility in the West Asia region.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250227-irna01.htm",
    "timestamp": "2025-02-28T09:21:23Z"
  },
  {
    "title": "Trump wanted to cancel Zelensky meeting – French media",
    "description": "Emmanuel Macron persuaded Donald Trump not to cancel his meeting with Vladimir Zelensky, a French diplomatic source has told BFMTV Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613423-trump-zelensky-meeting-macron/",
    "timestamp": "2025-02-28T09:18:09Z"
  },
  {
    "title": "Rubio accuses China of 'reverse' Opium War via fentanyl",
    "description": "U.S. Secretary of State Marco Rubio on Wednesday suggested Beijing may be \"deliberately\" flooding America with the synthetic opioid fentanyl, in a \"reverse\" form of the mid-1800s Opium Wars that enfeebled China's international standing.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/02/china-250227-rfa04.htm",
    "timestamp": "2025-02-28T09:17:38Z"
  },
  {
    "title": "Hungary's Orban Announces Fresh Pro-Family Financial Incentives and Tax Breaks for Parents",
    "description": "Hungarian Prime Minister Viktor Orbán has once again put pro-family policies at the heart of his government's agenda, announcing new tax breaks and other financial incentives to help young couples afford to raise the next generation of children.\nThe post Hung…",
    "link": "https://www.breitbart.com/europe/2025/02/28/hungarys-orban-announces-fresh-pro-family-financial-incentives-and-tax-breaks-for-parents/",
    "timestamp": "2025-02-28T09:15:00Z"
  },
  {
    "title": "As tariffs expand, focus also on workarounds for Chinese goods",
    "description": "As U.S. President Donald Trump moves forward with an expanding net of tariffs, including an additional 10% for Chinese imports starting next week, industry insiders and experts say closing existing loopholes and workarounds that companies use to avoid trade t…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/02/china-250227-voa04.htm",
    "timestamp": "2025-02-28T09:13:04Z"
  },
  {
    "title": "At meeting with Trump, Zelenskyy will seek security assurances against Russia",
    "description": "Ukrainian President Volodymyr Zelenskyy is meeting with President Donald Trump in Washington on Friday",
    "link": "https://abcnews.go.com/US/wireStory/meeting-trump-zelenskyy-seek-security-assurances-future-russian-119280316",
    "timestamp": "2025-02-28T09:12:08Z"
  },
  {
    "title": "Authoritarianism Expert Unmasks Trump’s 'Diabolical' Move That Broke Republicans",
    "description": "Ruth Ben-Ghiat talked about \"the genius of what he did, seen from a diabolical authoritarian perspective.\"",
    "link": "https://www.huffpost.com/entry/ruth-ben-ghiat-donald-trump-genius-move_n_67c172ece4b01834869f3d4b",
    "timestamp": "2025-02-28T09:12:08Z"
  },
  {
    "title": "US, Russian diplomats meet to discuss embassy operations",
    "description": "U.S. and Russian diplomats met Thursday in Istanbul, looking for ways to smooth their embassy relationships in Moscow and Washington after frequent expulsion of each other's diplomats and three years of American opposition to Moscow's war on Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/02/russia-250227-voa01.htm",
    "timestamp": "2025-02-28T09:09:22Z"
  },
  {
    "title": "Putin 'Hopes' Meeting Between U.S., Russian Officials Helps Thaw Relations",
    "description": "Diplomats from Russia and the United States have ended their talks on resolving disputes over their respective diplomatic missions in Washington and Moscow that Russian President Vladimir Putin said \"inspire certain hopes.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/02/russia-250227-rferl01.htm",
    "timestamp": "2025-02-28T09:09:15Z"
  },
  {
    "title": "Russia's Putin says first contacts with U.S. inspire hope",
    "description": "President Vladimir Putin has expressed optimism about contacts between Russia and the United States as diplomats from the two countries met in Turkiye for talks on restoring diplomatic presence.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/02/russia-250227-irna01.htm",
    "timestamp": "2025-02-28T09:09:10Z"
  },
  {
    "title": "Internal documents reveal how Elon Musk's xAI trains Grok to be the anti-woke chatbot",
    "description": "Elon Musk has said Grok would favor truth over \"political correctness.\" Internal documents reveal how the company is working toward Musk's goal.",
    "link": "https://www.businessinsider.com/xai-grok-training-bias-woke-idealogy-2025-02",
    "timestamp": "2025-02-28T09:09:02Z"
  },
  {
    "title": "UK’s Starmer, NATO, EU leaders, Ukraine’s future",
    "description": "UK Prime Minister Keir Starmer’s office said he has invited more than a dozen European and EU leaders to a Sunday summit to “drive forward” action on Ukraine and security. Starmer will chair a morning call with Baltic nations ahead of the main summit, it said…",
    "link": "https://punchng.com/uks-starmer-nato-eu-leaders-to-discuss-ukraines-future/",
    "timestamp": "2025-02-28T09:08:34Z"
  },
  {
    "title": "Trump declines to commit to Taiwan's defense if China invades",
    "description": "United States President Donald Trump on Wednesday again refused to make clear his stance on protecting Taiwan from a takeover by China during his presidency.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250227-cna05.htm",
    "timestamp": "2025-02-28T09:07:49Z"
  },
  {
    "title": "China's Ministry of National Defense warns DPP authorities: We will come and get you, sooner or later",
    "description": "China's Ministry of National Defense (MND) sent out a stern warning on Thursday to the Democratic Progressive Party (DPP) authorities in the island of Taiwan saying that \"we will come and get you, sooner or later.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250227-globaltimes01.htm",
    "timestamp": "2025-02-28T09:07:47Z"
  },
  {
    "title": "US still opposes 'forced, coercive' changes to Taiwan's status, Rubio says",
    "description": "U.S. Secretary of State Marco Rubio on Wednesday reaffirmed Washington's opposition to attempts to alter Taiwan's status through force or coercion.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250227-voa01.htm",
    "timestamp": "2025-02-28T09:07:42Z"
  },
  {
    "title": "Panama, Costa Rica turning into a 'black hole' for deportees from US, observers warn",
    "description": "Officials in Costa Rica and Panama are confiscating migrants’ passports and cellphones, denying them access to legal services and moving them between remote outposts as they wrestle with the logistics of a suddenly reversed migration flow",
    "link": "https://abcnews.go.com/International/wireStory/panama-costa-rica-turning-black-hole-migrants-deportees-119281219",
    "timestamp": "2025-02-28T09:06:35Z"
  },
  {
    "title": "One map shows where Americans are paying the highest electricity bills",
    "description": "Here's why Hawaii, Connecticut, and Alabama residents paid the highest utility bills in 2024.",
    "link": "https://www.businessinsider.com/average-utility-bills-state-electricity-costs-inflation-gas-prices-2025-2",
    "timestamp": "2025-02-28T09:06:02Z"
  },
  {
    "title": "Trump says Ukraine can \"forget about\" joining NATO",
    "description": "U.S. President Donald Trump said Wednesday Ukraine could \"forget about\" joining the North Atlantic Treaty Organization (NATO), and he would try to get Ukraine as much land as possible from Russia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250227-pdo01.htm",
    "timestamp": "2025-02-28T09:05:44Z"
  },
  {
    "title": "Trump says Ukraine can 'forget about NATO' ahead of meeting with Zelensky",
    "description": "US President Donald Trump says Ukraine can \"forget about\" joining the North Atlantic Treaty Organization (NATO), dealing a blow to the European country's long-running aspiration that was supported by former President Joe Biden.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250227-presstv01.htm",
    "timestamp": "2025-02-28T09:05:41Z"
  },
  {
    "title": "4 Things To Know About Trump, Ukraine, And Warp-Speed Diplomacy",
    "description": "Global news is in overdrive, with each day bringing breaking news on U.S. President Donald Trump, the Ukraine war, NATO, Russia, and a dizzying whirl of diplomatic moves.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250227-rferl01.htm",
    "timestamp": "2025-02-28T09:05:15Z"
  },
  {
    "title": "Starmer Tells Trump U.K. Ready To 'Put Boots On Ground,' Doesn't Get Backstop Commitment",
    "description": "British Prime Minister Keir Starmer sought to demonstrate strong U.S.-U.K. ties during a White House meeting with President Donald Trump amid growing fault lines in the transatlantic relationship over Ukraine and trade.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250227-rferl02.htm",
    "timestamp": "2025-02-28T09:05:13Z"
  },
  {
    "title": "Analysis: Inside The Ukraine-U.S. Minerals Deal (It's Not What You Might Think)",
    "description": "Think the deal announced between Kyiv and Washington regarding Ukraine's valuable rare minerals is a big deal?",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250228-rferl01.htm",
    "timestamp": "2025-02-28T09:04:38Z"
  },
  {
    "title": "Experts: Europe could not replace US as guarantor of Ukraine's security",
    "description": "Friedrich Merz, who is set to become Germany's chancellor after his Christian Democratic Union party won the country's Feb. 23 parliamentary elections, has said that Europe may have to establish an \"independent\" defense capability because the U.S. has become …",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250227-voa02.htm",
    "timestamp": "2025-02-28T09:04:28Z"
  },
  {
    "title": "British PM Starmer seeks to project unity with Trump despite differences on Ukraine",
    "description": "British Prime Minister Keir Starmer said he and President Donald Trump discussed achieving an agreement to end the war between Ukraine and Russia that would involve Kyiv and be backed by European peacekeeping forces.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250227-voa01.htm",
    "timestamp": "2025-02-28T09:04:23Z"
  },
  {
    "title": "The Hunger Games: Films featuring an evil president who’s still preferable to Trump",
    "description": "THE idea of a blatantly evil or insane US President is usually restricted to fiction, but not anymore. Here are some crazed film presidents who could learn a lot from Donald.",
    "link": "https://www.thedailymash.co.uk/news/arts-entertainment/the-hunger-games-films-featuring-an-evil-president-whos-still-preferable-to-trump-20250228255173",
    "timestamp": "2025-02-28T09:00:36Z"
  },
  {
    "title": "Blue state's 'gross mismanagement' cost $1.6B for illegal immigrant healthcare: audit",
    "description": "An audit requested by GOP lawmakers shows Illinois Gov. Pritzker’s administration grossly underestimated the $1.6 billion price tag for state health programs for illegal immigrants.",
    "link": "https://www.foxnews.com/politics/blue-state-govs-gross-mismanagement-cost-taxpayers-1-6b-illegal-immigrant-healthcare-audit",
    "timestamp": "2025-02-28T09:00:23Z"
  },
  {
    "title": "Pipelines seem more popular amid Trump's threats. But does it make sense to build new ones?",
    "description": "Political tensions have opened up space to talk more favourably about new pipelines in Canada. But does building new oil infrastructure make sense as the world transitions to clean energy?",
    "link": "https://www.cbc.ca/news/science/pipeline-popular-clean-energy-transition-1.7470684",
    "timestamp": "2025-02-28T09:00:00Z"
  },
  {
    "title": "Oscars 2025: Who's likely to win, who should win — and how to sound smart at your Oscars party",
    "description": "CBC takes a look at some of the top categories at this year's Academy Awards to present you with projected winners, outside chances and some quick tidbits you can drop amongst your cinephile friends to sound like you’ve been watching along all season.",
    "link": "https://www.cbc.ca/news/entertainment/academy-award-predictions-2025-1.7470352",
    "timestamp": "2025-02-28T09:00:00Z"
  },
  {
    "title": "How Doug Ford and his PCs won their 3rd straight Ontario election",
    "description": "Doug Ford and his Progressive Conservatives’ thumping victory in Thursday’s Ontario election came as the result of a campaign that focused ruthlessly on the one issue capturing the minds of Canadians right now, a leader who worked relentlessly to make the mos…",
    "link": "https://www.cbc.ca/news/canada/toronto/ontario-election-doug-ford-path-to-victory-analysis-1.7468713",
    "timestamp": "2025-02-28T09:00:00Z"
  },
  {
    "title": "From old grievances to new allies: Trump's history with tariffs",
    "description": "U.S. President Donald Trump's aggressive views on trade and tariffs are in keeping with ideas he has expressed since the 1980s and now are buttressed by a cadre of allies and supporters who share his view.",
    "link": "https://www.cbc.ca/news/canada/trump-tariff-history-1.7469877",
    "timestamp": "2025-02-28T09:00:00Z"
  },
  {
    "title": "India and EU to try and conclude FTA in 2025: EU President",
    "description": "‘This modern version of great power competition is an opportunity for Europe and India to reimagine their partnership’ says Von der Leyen",
    "link": "https://www.thehindubusinessline.com/economy/india-and-eu-to-try-and-conclude-fta-in-2025-eu-president/article69274091.ece",
    "timestamp": "2025-02-28T08:58:53Z"
  },
  {
    "title": "Florida ups the stakes for crimes by immigrants in the US illegally",
    "description": "New laws in Florida mandate stiffer criminal penalties for immigrants in the U.S. illegally than for everyone else",
    "link": "https://abcnews.go.com/US/wireStory/florida-ups-stakes-crimes-immigrants-us-illegally-119281221",
    "timestamp": "2025-02-28T08:58:43Z"
  },
  {
    "title": "Are egg producers inflating prices during the bird flu outbreak to boost profits?",
    "description": "Egg producers blame the ongoing bird flu outbreak for driving prices up to record highs",
    "link": "https://abcnews.go.com/Business/wireStory/egg-producers-inflating-prices-bird-flu-outbreak-boost-119282331",
    "timestamp": "2025-02-28T08:55:21Z"
  },
  {
    "title": "James Cameron Calls Donald Trump’s Re-Election ‘Horrifying’",
    "description": "“America doesn’t stand for anything if it doesn’t stand for what it has historically stood for,\" the filmmaker said in a new interview",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/james-cameron-donald-trump-reelection-horrifying-1235283082/",
    "timestamp": "2025-02-28T08:54:53Z"
  },
  {
    "title": "European Commission chief says India, EU agree to conclude a free trade agreement",
    "description": "European Commission President Ursula von der Leyen says the EU and India have agreed to push to get a long pending free trade agreement done this year",
    "link": "https://abcnews.go.com/Business/wireStory/european-commission-chief-india-eu-agreed-conclude-free-119282732",
    "timestamp": "2025-02-28T08:53:56Z"
  },
  {
    "title": "Trump to hit Canada, Mexico, China with new tariffs",
    "description": "U.S. President Donald Trump said Thursday that he would impose 25% tariffs on imported goods from Canada and Mexico next week as he originally planned, contending the two neighboring countries are still not doing enough to curb the flow of drugs into the Unit…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250227-voa04.htm",
    "timestamp": "2025-02-28T08:53:34Z"
  },
  {
    "title": "European countries vow retaliation against Trump's tariff threat",
    "description": "Transatlantic trade tensions have escalated following U.S. President Donald Trump's announcement of a 25 percent tariff on European imports, with European countries warning that Europe will react \"firmly and immediately\" against unjustified barriers.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250228-pdo01.htm",
    "timestamp": "2025-02-28T08:53:34Z"
  },
  {
    "title": "AT&T, Verizon hack investigation expands to military espionage claims",
    "description": "As you know, a US Army soldier has pleaded guilty to illegally obtaining and selling phone records from AT&T and Verizon. Known online as Kiberphant0m, the communications specialist was arrested near a Texas army base in December.",
    "link": "https://www.phonearena.com/news/us-soldier-linked-to-att-hack-accused-of-espionage_id168067",
    "timestamp": "2025-02-28T08:52:48Z"
  },
  {
    "title": "China vows to retaliate as necessary after Trump threatens another 10% tariff hike",
    "description": "China's statement on Friday appeared to strike a stronger tone than its response after Washington slapped the initial 10% duties earlier this month.",
    "link": "https://www.cnbc.com/2025/02/28/china-vows-to-retaliate-as-necessary-after-trump-threatens-tariffs.html",
    "timestamp": "2025-02-28T08:48:52Z"
  },
  {
    "title": "Trump, Zelenskiy expected to sign minerals deal at White House meeting",
    "description": "Kyiv attempts to regain US support to fight off the Russian invasion as Washington reverses its punitive policy towards Moscow.",
    "link": "https://www.irishtimes.com/world/europe/2025/02/28/trump-zelenskiy-expected-to-sign-minerals-deal-at-white-house-meeting/",
    "timestamp": "2025-02-28T08:48:33Z"
  },
  {
    "title": "US government releases declassified Jeffrey Epstein files",
    "description": "U.S. Attorney General Pam Bondi on Thursday released a set of files related to disgraced financier Jeffrey Epstein, who was accused of sex trafficking and other serious offenses but committed suicide before his trial in 2019.",
    "link": "https://www.hurriyetdailynews.com/us-government-releases-declassified-jeffrey-epstein-files-206363",
    "timestamp": "2025-02-28T08:47:54Z"
  },
  {
    "title": "'Still Time To Delete This': Critics Clown Jim Jordan-Backed Account's 'Unbelievable' Post",
    "description": "Social media users slammed the House Judiciary GOP account for using \"a decade old meme\" in a post on the \"EPSTEIN FILES.\"",
    "link": "https://www.huffpost.com/entry/jim-jordan-house-judiciary-gop-rickroll-post-epstein-files_n_67c15bd8e4b01834869f2569",
    "timestamp": "2025-02-28T08:45:15Z"
  },
  {
    "title": "What to Know About the Tate Brothers’ Charges and the Reactions to Their Return to America",
    "description": "Here’s what to know about the split reactions among conservatives to the repatriation of influencers Andrew and Tristan Tate—and the trafficking charges they face abroad.",
    "link": "https://time.com/7262710/andrew-tate-tristan-manosphere-repatriation-us-trump-conservatives-reactions-explainer/",
    "timestamp": "2025-02-28T08:45:00Z"
  },
  {
    "title": "What Ukrainian opinion polls say about Volodymyr Zelenskyy",
    "description": "While the US and Russia label Ukraine's President Volodymyr Zelenskyy as illegitimate and unpopular, opinion polls show he's recently seen a bump in popularity. Ukraine's Volodymyr Zelenskyy was quick to correct US President Donald Trump's recent false claim …",
    "link": "https://www.dw.com/en/what-ukrainian-opinion-polls-say-about-volodymyr-zelenskyy/a-71774172",
    "timestamp": "2025-02-28T08:41:00Z"
  },
  {
    "title": "US, Russia discuss stabilizing embassy operations in Istanbul talks",
    "description": "Russian and U.S. diplomats met in Istanbul on Thursday to discuss normalizing the operation of their respective embassies after years expelling each others' diplomats.",
    "link": "https://www.hurriyetdailynews.com/us-russia-discuss-stabilizing-embassy-operations-in-istanbul-talks-206362",
    "timestamp": "2025-02-28T08:39:52Z"
  },
  {
    "title": "Free trade deal with India could come this year - EU Commission chief",
    "description": "The two sides discussed ways to further strengthen the Indo-EU strategic partnership.",
    "link": "https://www.bbc.com/news/articles/c0eggy1104po",
    "timestamp": "2025-02-28T08:38:02Z"
  },
  {
    "title": "No new bombshells in US Justice Department’s Jeffrey Epstein files release",
    "description": "The lack of new information drew criticism even from some conservatives.",
    "link": "https://www.thejournal.ie/no-new-bombshells-in-us-justice-departments-jeffrey-epstein-files-release-6635673-Feb2025/",
    "timestamp": "2025-02-28T08:36:21Z"
  },
  {
    "title": "Trump signals U.S. and U.K. could reach 'real trade deal' without tariffs",
    "description": "U.S. President Donald Trump signaled the U.K. could broker a \"real trade deal\" and escape tariffs.",
    "link": "https://www.cnbc.com/2025/02/28/trump-signals-us-uk-could-reach-real-trade-deal-without-tariffs.html",
    "timestamp": "2025-02-28T08:34:16Z"
  },
  {
    "title": "As Trump breaks ranks with Europe, are Asia-Pacific allies next?",
    "description": "The Trump administration's focus on the price, not value, of alliances could affect security pledges and risks to Taiwan, experts say.",
    "link": "https://www.cnbc.com/2025/02/28/as-trump-breaks-ranks-with-europe-are-asia-pacific-allies-next.html",
    "timestamp": "2025-02-28T08:32:37Z"
  },
  {
    "title": "Stock market today: Asian shares skid, hit by Trump tariff hikes and doubts about AI",
    "description": "Asian shares are sharply lower, with benchmarks in Japan, Hong Kong and South Korea tumbling more than 2% after a broad retreat on Wall Street",
    "link": "https://abcnews.go.com/Business/wireStory/stock-market-today-asian-shares-skid-hit-trump-119279567",
    "timestamp": "2025-02-28T08:30:14Z"
  },
  {
    "title": "Mihir Sharma: Musk’s plans for India reveal cracks in Trump’s political coalition",
    "description": "US President Donald Trump’s electoral base expects him to put America and Americans first. But some of his acolytes, like disruptor-in-chief Elon Musk, have their own ideas about what’s best for tech businesses like his own.",
    "link": "https://www.livemint.com/opinion/online-views/mihir-sharma-elon-musk-india-tesla-tariffs-donald-trump-evs-electric-vehicles-big-tech-maga-narendra-modi-doge-spacex-11740719768260.html",
    "timestamp": "2025-02-28T08:30:12Z"
  },
  {
    "title": "Taoiseach receives official White House invite for St Patrick’s Day",
    "description": "Taoiseach Micheál Martin has been invited for a meeting with US President Donald Trump at the White House to mark St Patrick’s Day.",
    "link": "https://www.independent.ie/irish-news/politics/taoiseach-receives-official-white-house-invite-for-st-patricks-day/a1553658915.html",
    "timestamp": "2025-02-28T08:29:29Z"
  },
  {
    "title": "‘Gaslighting’ Trump Tries To Bury A Comment, Critics Dig It Right Back Up",
    "description": "The president's previous words came back to haunt him.",
    "link": "https://www.huffpost.com/entry/donald-trump-brazen-denial-slammed_n_67c16aefe4b00bae0887d4f9",
    "timestamp": "2025-02-28T08:22:40Z"
  },
  {
    "title": "Crypto Price Today: Bitcoin Slips Below $80,000 Amid Macroeconomic Uncertainty, Market Remains Sluggish",
    "description": "The overall crypto market valuation fell by 5.40 percent in the last 24 hours. Bitcoin and Ether, both registered losses on the price chart on Friday, February 28. Majority altcoins including Dogecoin, Shiba Inu, Solana, and Cardano among others saw losses.",
    "link": "https://www.gadgets360.com/cryptocurrency/news/bitcoin-price-usd-80000-dogecoin-solana-memecoins-losses-market-slowdown-7814518",
    "timestamp": "2025-02-28T08:20:22Z"
  },
  {
    "title": "How Keir Starmer buttered up Donald Trump",
    "description": "Inside the months of quiet, grinding preparation that went into the British prime minister's all-smiles first trip to the Trump White House — and why it could all still unravel.",
    "link": "https://www.politico.eu/article/how-keir-starmer-buttered-up-donald-trump/",
    "timestamp": "2025-02-28T08:19:35Z"
  },
  {
    "title": "Stock market crash: TCS, 9 other Nifty stocks hit 52-week lows as global jitters, domestic headwinds deepen sell-off",
    "description": "A sharp decline in IT and financial stocks, coupled with renewed global trade war concerns and sustained foreign investor outflows, dragged the benchmark indices down by over 1%. The Nifty 50 tumbled 1.2% to 22,271.40, while the BSE Sensex sank over 1,000 poi…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-crash-tcs-9-other-nifty-stocks-hit-52-week-lows-as-global-jitters-domestic-headwinds-deepen-sell-off/articleshow/118623122.cms",
    "timestamp": "2025-02-28T08:13:11Z"
  },
  {
    "title": "Taoiseach accepts invitation to visit White House for annual St Patrick's Day meeting",
    "description": "Micheál Martin will meet US President Donald Trump in the Oval Office on 12 March.",
    "link": "https://www.thejournal.ie/taoiseach-accepts-invitation-white-house-st-patricks-day-6635654-Feb2025/",
    "timestamp": "2025-02-28T08:13:08Z"
  },
  {
    "title": "Epstein Files Release Sparks Rage, Disappointment: 'Nothing Juicy'",
    "description": "AG Pam Bondi has released the first phase of the \"Epstein Files,\" but they were nothing more than heavily-redacted lists and a blacked-out masseuse list as well as information that appears to have been previously released.",
    "link": "https://www.ibtimes.com/epstein-files-release-sparks-rage-disappointment-nothing-juicy-3765003",
    "timestamp": "2025-02-28T08:10:19Z"
  },
  {
    "title": "Progressive Conservative party wins Ontario election, CBC reports",
    "description": "TORONTO — Ontario's Progressive Conservative Party swept to victory and clinched a rare third consecutive majority, according to a Canadian Broadcasting Corporation projection, following a campaign dominated by U.S. President Donald Trump.\n\n\nPC Party leader D…",
    "link": "https://www.voanews.com/a/progressive-conservative-party-wins-ontario-election-cbc-reports/7991261.html",
    "timestamp": "2025-02-28T08:07:27Z"
  },
  {
    "title": "Taoiseach invited to White House by Trump to mark St Patrick’s Day",
    "description": "US president congratulated Micheál Martin on his recent appointment as invitation issued for March 12th",
    "link": "https://www.irishtimes.com/politics/2025/02/28/taoiseach-invited-to-white-house-by-trump-to-mark-st-patricks-day/",
    "timestamp": "2025-02-28T08:06:21Z"
  },
  {
    "title": "NHS 'not up for grabs' in US-UK trade deal",
    "description": "This NHS is \"not up for grabs\" in trade negotiations with the US and the \"hard yards are still ahead\", Wes Streeting has said.",
    "link": "https://news.sky.com/story/nhs-not-up-for-grabs-in-us-uk-trade-deal-says-wes-streeting-13318482",
    "timestamp": "2025-02-28T08:04:00Z"
  },
  {
    "title": "A revolutionary's revolution",
    "description": "Jailed Kurdish militant leader calls for end to conflict with Turkey [ungated] - \"Turkey's jailed militant leader Abdullah Ocalan called on his Kurdistan Workers Party (PKK) to disarm and disband on Thursday, a move that could end its 40-year conflict with An…",
    "link": "https://www.metafilter.com/207839/A-revolutionarys-revolution",
    "timestamp": "2025-02-28T08:00:29Z"
  },
  {
    "title": "USAID Cuts Hit University Research, Including Respected Soybean Labs",
    "description": "USAID Cuts Hit University Research, Including Respected Soybean Labs\n\n \n\n\n \nJohanna Alonso\n\nFri, 02/28/2025 - 03:00 AM\n\nAnnually, the foreign aid agency awards universities about $350 million in grants to research solutions to global crises. Researchers warn …",
    "link": "https://www.insidehighered.com/news/government/science-research-policy/2025/02/28/how-cuts-us-aid-agency-hinder-university",
    "timestamp": "2025-02-28T08:00:00Z"
  },
  {
    "title": "As American anti-DEI dystopia comes for the UK, we marketers need to hold space",
    "description": "SheSays’s London’s Ruby Norman-Curran urges the ad industry to hold fast; years of industry DEI efforts could be threatened with a walkback. In January Donald Trump signed an executive order that undid years of diversity, equity, and inclusion (DEI) work. The…",
    "link": "https://www.thedrum.com/opinion/2025/02/28/american-anti-dei-dystopia-comes-the-uk-we-marketers-need-hold-space",
    "timestamp": "2025-02-28T08:00:00Z"
  },
  {
    "title": "As Colleges Face Funding Threat, Accreditors Offer Flexibility",
    "description": "As Colleges Face Funding Threat, Accreditors Offer Flexibility\n\n \n\n\n \nJosh Moody\n\nFri, 02/28/2025 - 03:00 AM\n\nAccreditors are relaxing enforcement of DEI standards as colleges grasp for answers on what unclear Trump administration directives targeting DEI mea…",
    "link": "https://www.insidehighered.com/news/governance/accreditation/2025/02/28/accreditors-offer-flexibility-dei-standards",
    "timestamp": "2025-02-28T08:00:00Z"
  },
  {
    "title": "King Charles’ Letter To Trump Has Critics Royally Riled Up",
    "description": "The monarch faced backlash over his message to the president.",
    "link": "https://www.huffpost.com/entry/king-charles-donald-trump-backlash_n_67c160a2e4b01834869f2815",
    "timestamp": "2025-02-28T07:59:10Z"
  },
  {
    "title": "China-linked threat actors stole 10% of Belgian State Security Service (VSSE)’s staff emails",
    "description": "Belgian authorities are investigating Chinese hackers for breaching its State Security Service (VSSE), stealing 10% of emails from 2021 to May 2023. The Belgian federal prosecutor’s office is probing a possible security breach on its State Security Service (V…",
    "link": "https://securityaffairs.com/174743/intelligence/china-linked-threat-actors-stole-10-of-belgian-state-security-service-vsse-emails.html",
    "timestamp": "2025-02-28T07:54:40Z"
  },
  {
    "title": "MSNBC Host Reveals 1 Trick World Leaders Keep Using To 'Humiliate' Trump In Public",
    "description": "Lawrence O'Donnell called the move the \"humiliation touch,\" and showed how it's been deployed twice in the past week.",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-trump-humiliation-touch_n_67c159d3e4b01834869f22bf",
    "timestamp": "2025-02-28T07:53:27Z"
  },
  {
    "title": "CNBC Daily Open: Nvidia slumps and Trump confirms tariffs",
    "description": "Nvidia shares plummeted 8.5%, weighing down the Nasdaq Composite, just as Trump reaffirmed that tariffs would go ahead.",
    "link": "https://www.cnbc.com/2025/02/28/cnbc-daily-open-nvidia-slumps-and-trump-confirms-tariffs.html",
    "timestamp": "2025-02-28T07:43:04Z"
  },
  {
    "title": "EU eyeing India defence and security partnership: Von der Leyen",
    "description": "NEW DELHI: The European Union is exploring a security and defence partnership with India, EU chief Ursula von der Leyen said on Friday (Feb 28) before meeting with Prime Minister Narendra Modi in New Delhi. Von der Leyen arrived in India on Thursday for a two…",
    "link": "https://www.channelnewsasia.com/asia/eu-eyeing-india-defence-security-partnership-von-der-leyen-4967086",
    "timestamp": "2025-02-28T07:42:57Z"
  },
  {
    "title": "Trump threatens 25% tariffs on EU, claims bloc was formed to ‘screw’ US",
    "description": "United States President Donald Trump has said he will impose a 25 percent tariff on imports from the European Union, claiming that the bloc was created to “screw” his country. Speaking at the first meeting of his cabinet on Wednesday, Trump said a decision on…",
    "link": "https://thechronicle.com.gh/trump-threatens-25-tariffs-on-eu-claims-bloc-was-formed-to-screw-us/",
    "timestamp": "2025-02-28T07:39:24Z"
  }
]