[
  {
    "title": "A look at the top buyers of Russian oil as Trump pressures China and India to stop buying it",
    "description": "China, India and Turkey are the largest buyers of Russian oil.",
    "link": "https://www.bostonherald.com/2025/08/05/russia-oil-buyers/",
    "timestamp": "2025-08-05T17:09:06Z"
  },
  {
    "title": "Don Jr.'s Alleged Ex Has Scathing Reaction To Barron Trump Wedding Prediction",
    "description": "The Fox News host creepily suggested Barron Trump and Sydney Sweeney could “create the greatest political dynasty in American history.”",
    "link": "https://www.huffpost.com/entry/aubrey-oday-shade-jesse-watters-sydney-sweeney-barron-trump-wedding-prediction_n_68921e1fe4b07e7958a0bc0b",
    "timestamp": "2025-08-05T17:06:49Z"
  },
  {
    "title": "Trump Takes Back Old Position At McDonald's To Boost Weak Jobs Report",
    "description": "FEASTERVILLE, PA — President Donald Trump returned to the McDonald's in Pennsylvania, where he previously worked, to boost the country's lackluster employment rate after the release of less-than-optimal July jobs numbers.",
    "link": "https://babylonbee.com/news/trump-takes-back-old-position-at-mcdonalds-to-boost-weak-jobs-report",
    "timestamp": "2025-08-05T17:06:16Z"
  },
  {
    "title": "Kamala Harris says she’s not running for office again because the system is ‘broken’",
    "description": "The former vice president's admission elicited gasps from The Late Show audience.",
    "link": "https://fortune.com/2025/08/05/kamala-harris-not-running-for-office-because-the-system-is-broken/",
    "timestamp": "2025-08-05T17:06:06Z"
  },
  {
    "title": "Former Trump advisor criticizes Trump’s timing on ousting America’s data czar: ‘Like firing the referee’",
    "description": "After a historic downward revision to jobs numbers, Trump fired the head of the BLS. But critics on both sides say the move won’t fix deeper problems with jobs data.",
    "link": "https://fortune.com/2025/08/05/former-trump-advisor-stephen-moore-criticizes-erika-mcentarfer-ousting-timing-bureau-labor-statistics/",
    "timestamp": "2025-08-05T17:05:28Z"
  },
  {
    "title": "Rwanda agrees to take in up to 250 migrants deported from the US | CNN",
    "description": "Rwanda has reached a deal with the Trump administration to take in migrants deported from the United States, becoming the third African nation to do so, amid complaints that governments on the continent are being pressured by the White House to receive them.",
    "link": "https://www.cnn.com/2025/08/05/africa/us-rwanda-migrants-deal-intl",
    "timestamp": "2025-08-05T17:03:28Z"
  },
  {
    "title": "MSNBC’s Rachel Maddow Drops The Big ‘D’ Word On Trump In Alarming Authoritarianism Rant",
    "description": "MSNBC host Rachel Maddow dropped a big \"D\"-word on Trump as she told viewers that \"we have crossed a line\" and are now living in a \"consolidating dictatorship.\"\nThe post MSNBC’s Rachel Maddow Drops The Big ‘D’ Word On Trump In Alarming Authoritarianism Rant f…",
    "link": "https://www.mediaite.com/media/tv/msnbcs-rachel-maddow-drops-the-big-d-word-on-trump-in-alarming-authoritarianism-rant/",
    "timestamp": "2025-08-05T17:03:27Z"
  },
  {
    "title": "Trump Forces Murdoch, 94, to Give Him Regular Health Updates",
    "description": "The president said he’d delay his demand for an expedited deposition of Murdoch—under one condition.",
    "link": "https://www.thedailybeast.com/trump-forces-murdoch-94-to-give-him-regular-health-updates/",
    "timestamp": "2025-08-05T17:03:02Z"
  },
  {
    "title": "A $715 billion tax cut turns into a $4.5 trillion sales job",
    "description": "GOP lawmakers used a controversial accounting tactic to minimize the cost of tax cuts in their megabill. Now they're telling voters the cuts were the biggest...",
    "link": "https://www.politico.com/news/2025/08/05/a-715-billion-tax-cut-turns-into-a-4-5-trillion-sales-job-00488462",
    "timestamp": "2025-08-05T17:02:46Z"
  },
  {
    "title": "Hacks creator reveals to Senator Elizabeth Warren the ‘most tragic’ part of Colbert show cancellation",
    "description": "Senator Warren shared her concerns for the future of ‘independent media’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/elizabeth-warren-paul-downs-colbert-cancellation-b2802322.html",
    "timestamp": "2025-08-05T17:01:56Z"
  },
  {
    "title": "Jasmine Crockett Salutes “Aggressive” Texas Dems’ Strategy",
    "description": "Texas lawmaker Jasmine Crockett applauded fellow Democrats for leaving the state, thwarting GOP redistricting plans to give Republicans more seats in the House of Representatives.",
    "link": "https://hiphopwired.com/2796111/jasmine-crocket-salutes-aggressive-texas-dems-strategy/",
    "timestamp": "2025-08-05T17:01:42Z"
  },
  {
    "title": "Fear built the nuclear bomb – only trust can ensure it is never used again",
    "description": "If the nuclear bomb was born out of fear, then ensuring it is never used again requires replacing fear with trust.",
    "link": "https://theconversation.com/fear-built-the-nuclear-bomb-only-trust-can-ensure-it-is-never-used-again-262637",
    "timestamp": "2025-08-05T17:00:51Z"
  },
  {
    "title": "The hubris arc: how visionary politicians turn into authoritarians",
    "description": "As visionary capacity increases, so does myopia.",
    "link": "https://theconversation.com/the-hubris-arc-how-visionary-politicians-turn-into-authoritarians-262562",
    "timestamp": "2025-08-05T17:00:47Z"
  },
  {
    "title": "Fivio Foreign Released From Jail After Terroristic Threats Conviction",
    "description": "He originally faced up to 20 years behind bars.\nThe post Fivio Foreign Released From Jail After Terroristic Threats Conviction appeared first on HipHopDX.",
    "link": "http://hiphopdx.com/news/fivio-foreign-released-from-jail-terroristic-threats-conviction/",
    "timestamp": "2025-08-05T17:00:36Z"
  },
  {
    "title": "POLL: MUSK NOW MOST UNPOPULAR PUBLIC FIGURE IN USA...",
    "description": "Elon Musk’s image has tanked so badly that he is now the public figure that Americans dislike the most, according",
    "link": "https://dnyuz.com/2025/08/05/elon-musk-is-officially-the-most-unpopular-public-figure-in-america/",
    "timestamp": "2025-08-05T17:00:03Z"
  },
  {
    "title": "9 held in federal custody after protesting...",
    "description": "Capital & Main has documented nine Americans who have been held in federal custody after observing or protesting immigration raids.",
    "link": "https://prospect.org/justice/2025-08-05-border-patrol-ice-arresting-us-citizens-los-angeles/",
    "timestamp": "2025-08-05T17:00:03Z"
  },
  {
    "title": "HIS PERSONAL DOCTOR DEAD AT 73...",
    "description": "Dr. Harold Bornstein, President Donald Trump’s former personal physician, has died at the age of 73.",
    "link": "https://www.cnn.com/2021/01/14/politics/harold-bornstein-donald-trump",
    "timestamp": "2025-08-05T17:00:03Z"
  },
  {
    "title": "Divided and dormant Democrats | US politics with Anoosh Chakelian",
    "description": "The dormant Democrat party must find a way to revive itself if it is to have any hope of challenging the Maga movement, Donald Trump, and his eventual successor. The party is split on whether Trump is simply an aberration to endure, or whether he represents t…",
    "link": "https://shows.acast.com/newstatesman/episodes/divided-and-dormant-democrats-us-politics-with-anoosh-chakel",
    "timestamp": "2025-08-05T16:59:48Z"
  },
  {
    "title": "A major private student-loan company is prepping for a 'significant expansion' due to Trump's repayment changes. Here's what it means for borrowers",
    "description": "During the 2024 presidential election, the economy was a key advantage for Donald Trump.\nAndrew Harnik/Getty Images\nTrump's spending bill eliminated the SAVE plan and placed new caps on graduate borrowing.\nPrivate lenders said the changes could bring more fed…",
    "link": "https://biztoc.com/x/e97c5744d21f06f7",
    "timestamp": "2025-08-05T16:56:12Z"
  },
  {
    "title": "Coinbase shares slide Tuesday, as crypto play takes double-digit fall from July record",
    "description": "Shares of the cryptocurrency trading platform have collapsed since notching a record on July 18.",
    "link": "https://www.cnbc.com/2025/08/05/coinbase-shares-slide-tuesday-as-crypto-play-takes-double-digit-fall-from-july-record.html",
    "timestamp": "2025-08-05T16:55:57Z"
  },
  {
    "title": "Trump rules out Bessent for Fed chair",
    "description": "President Trump is considering candidates to fill Adriana Kugler's vacant Fed seat, potentially someone to succeed Jerome Powell as Fed Chair. Trump expressed interest in Kevin Hassett and Kevin Warsh, while Scott Bessent withdrew due to his Treasury position…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-rules-out-bessent-for-fed-chair/articleshow/123123729.cms",
    "timestamp": "2025-08-05T16:55:17Z"
  },
  {
    "title": "Bank of America CEO Denies Alleged Debanking Trend, Says Regulators Need To Provide More Clarity To Avoid ‘Second-Guessing’",
    "description": "Bank of America’s chief executive says his institution isn’t debanking political rivals, it’s just being choked by regulators. In a speech in January, US President Donald Trump accused BofA of not doing business with conservatives. Said Trump, “Many conservat…",
    "link": "https://dailyhodl.com/2025/08/05/bank-of-america-ceo-denies-alleged-debanking-trend-says-regulators-need-to-provide-more-clarity-to-avoid-second-guessing/",
    "timestamp": "2025-08-05T16:55:11Z"
  },
  {
    "title": "US to initially impose 'small tariff' on pharma imports, Trump says",
    "description": "WASHINGTON: President Donald Trump said on Tuesday (Aug 5) that the United States would initially impose a \"small tariff\" on pharmaceutical imports before raising it to 150 per cent within",
    "link": "https://www.channelnewsasia.com/world/us-initially-impose-small-tariff-pharma-imports-trump-says-5278751",
    "timestamp": "2025-08-05T16:54:00Z"
  },
  {
    "title": "In rejecting the jobs report, Trump follows his own playbook of discrediting unfavorable data",
    "description": "During his presidency, Donald Trump faced criticism for discrediting or concealing data that reflected poorly on his administration, including economic figures, election results, and climate change reports. Critics argue that these actions undermine trust in …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/in-rejecting-the-jobs-report-trump-follows-his-own-playbook-of-discrediting-unfavorable-data/articleshow/123123659.cms",
    "timestamp": "2025-08-05T16:52:12Z"
  },
  {
    "title": "Trump Took a Little Walk on the White House Roof",
    "description": "Donald Trump appeared before reporters from the roof of the White House on Tuesday, where he shouted incomprehensible answers to questions such as ‘Why are you up there?’",
    "link": "http://www.thecut.com/article/donald-trump-roof-white-house.html",
    "timestamp": "2025-08-05T16:52:07Z"
  },
  {
    "title": "America’s Golden Dome",
    "description": "The United States is preparing to launch the Golden Dome project, a large-scale missile defense system to actively shield the nation against all threats by space, land, and sea. Inspired by Israel’s Iron Dome system and Reagan’s historic Strategic Defense Ini…",
    "link": "https://freerepublic.com/focus/f-chat/4332819/posts",
    "timestamp": "2025-08-05T16:52:06Z"
  },
  {
    "title": "Woody Allen Compares Jeffrey Epstein to Dracula in Years-Old Letter",
    "description": "Woody Allen compared late pal Jeffrey Epstein to Count Dracula in a wild letter the filmmaker allegedly wrote to the notorious pedophile for his 63rd birthday. The letter -- published Tuesday by the New York Times -- is both shocking and…",
    "link": "https://www.tmz.com/2025/08/05/woody-allen-compares-jeffrey-epstein-to-dracula/",
    "timestamp": "2025-08-05T16:51:13Z"
  },
  {
    "title": "President Trump Reinstates Fitness Test for Kids",
    "description": "President Donald Trump has reinstated the Presidential Fitness Test in U.S. schools. The move is part of the president’s effort to “restore health and fitness... Read More\nThe post President Trump Reinstates Fitness Test for Kids appeared first on The Daily S…",
    "link": "https://www.dailysignal.com/2025/08/05/president-trump-reinstates-fitness-test-for-kids/",
    "timestamp": "2025-08-05T16:51:13Z"
  },
  {
    "title": "Pfizer shares rise 3% after upping profit forecast for 2025",
    "description": "Staving off headwinds from Ibrance generic competition, Pfizer’s Q2 earnings surpassed analyst estimates.",
    "link": "https://www.pharmaceutical-technology.com/news/pfizer-shares-rise-3-after-upping-profit-forecast-for-2025/",
    "timestamp": "2025-08-05T16:50:38Z"
  },
  {
    "title": "Russia Weighs Ukraine Air-Truce Offer to Trump Without Ending War",
    "description": "The Kremlin is weighing options for a concession to US President Donald Trump that could include an air truce with Ukraine to try to head off the threat of secondary sanctions, even as Russia remains determined to continue its war.",
    "link": "https://financialpost.com/pmn/business-pmn/russia-weighs-ukraine-air-truce-offer-to-trump-without-ending-war",
    "timestamp": "2025-08-05T16:49:22Z"
  },
  {
    "title": "CNN’s Elie Honig Says Possible Release Of Ghislaine Maxwell’s Testimony Would Be ‘Almost Unheard Of’ From DOJ",
    "description": "CNN's Elie Honig said on Tuesday that the potential release of Ghislaine Maxwell's testimony with the Department of Justice (DOJ) would be \"almost unheard of.\"",
    "link": "https://dailycaller.com/2025/08/05/cnn-elie-honig-ghislaine-maxwells-testimony-doj/",
    "timestamp": "2025-08-05T16:48:05Z"
  },
  {
    "title": "Donald Trump Photographed on Roof of White House, He Explains Why While Walking Around Top of West Wing",
    "description": "Donald Trump was photographed walking on the roof of the White House. The 79-year-old was caught by photographers, along with a small group of individuals, on the the roof of the West Wing of the famed building on Tuesday (August 5) in Washington, DC. Reporte…",
    "link": "https://www.justjared.com/2025/08/05/donald-trump-photographed-on-roof-of-white-house-he-explains-why-while-walking-around-top-of-west-wing/",
    "timestamp": "2025-08-05T16:47:25Z"
  },
  {
    "title": "NATO to coordinate regular and large-scale arm deliveries to Ukraine. Most will be bought in the US",
    "description": "NATO says the weapons “packages will be prepared rapidly and issued on a regular basis.”",
    "link": "https://www.bostonherald.com/2025/08/05/nato-ukraine-arms-deliveries/",
    "timestamp": "2025-08-05T16:47:22Z"
  },
  {
    "title": "Nebraska Republican is shouted down by a hostile crowd at a town hall on Trump’s tax cuts",
    "description": "Republican congressman Mike Flood has gotten an earful in Lincoln.",
    "link": "https://www.bostonherald.com/2025/08/05/congress-town-hall-nebraska-flood/",
    "timestamp": "2025-08-05T16:46:40Z"
  },
  {
    "title": "Report: Trump Admin. Has Audio Recording of Interview With Ghislaine Maxwell and is Considering Releasing the Transcript",
    "description": "The Trump Administration may be about to turn over a new leaf when it comes to transparency regarding the ongoing Epstein uproar. As The Gateway Pundit reported, Epstein’s partner-in-crime Ghislaine Maxwell was interviewed by the Department of Justice last mo…",
    "link": "https://freerepublic.com/focus/f-news/4332816/posts",
    "timestamp": "2025-08-05T16:45:15Z"
  },
  {
    "title": "Rupert Murdoch promises to give Trump 'regularly scheduled' health updates while staving off deposition",
    "description": "Donald Trump is suing Rupert Murdoch over a Wall Street Journal article about the president's past relationship with Jeffrey Epstein.\nREUTERS/Ken Cedeno; REUTERS/Elizabeth Frantz\n94-year-old Rupert Murdoch has promised to provide Donald Trump with health upda…",
    "link": "https://biztoc.com/x/ea2338a3385fcfcd",
    "timestamp": "2025-08-05T16:44:41Z"
  },
  {
    "title": "Republican Congressmen Make Moves to Block Trump-Backed Redistricting",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nGOP Representatives Kevin Kiley of California and Mike Lawler of New York have come out against efforts to draw new congressional maps before the 2026 midterm, which was started after President Donald Trump ur…",
    "link": "https://biztoc.com/x/76730508a4f2a19c",
    "timestamp": "2025-08-05T16:44:37Z"
  },
  {
    "title": "India rejects Trump threat over Russian oil",
    "description": "What happened\nPresident Donald Trump Monday said he would \"substantially\" raise tariffs on India for \"buying massive amounts of Russian oil\" and \"selling it on the open market for big profits,\" elaborating on his threat last week to impose a penalty on top of…",
    "link": "https://biztoc.com/x/bf9c512981c478f3",
    "timestamp": "2025-08-05T16:44:20Z"
  },
  {
    "title": "Rachel Maddow Warns the US Isn’t Headed for Dictatorship: ‘We Are There’ | Video",
    "description": "\"We're beyond waiting and seeing now,\" the MSNBC anchor warns\nThe post Rachel Maddow Warns the US Isn’t Headed for Dictatorship: ‘We Are There’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/rachel-maddow-warns-dictatorship-under-trump-msnbc/",
    "timestamp": "2025-08-05T16:44:07Z"
  },
  {
    "title": "'South Park' to Take on ICE in Second Episode of Season 27",
    "description": "'South Park' is set to take on ICE in the second episode of season 27, the episode description, photo and teaser confirm.",
    "link": "http://www.billboard.com/culture/tv-film/south-park-ice-season-27-second-episode-teaser-photo-1236036907/",
    "timestamp": "2025-08-05T16:43:28Z"
  },
  {
    "title": "Trump's politically motivated sanctions against Brazil strain relations among old allies",
    "description": "U.S. President Donald Trump has made clear who his new Latin America priority is: former Brazilian President Jair Bolsonaro, a personal and political ally.  ...",
    "link": "https://www.yahoo.com/news/articles/trumps-politically-motivated-sanctions-against-164121310.html",
    "timestamp": "2025-08-05T16:41:21Z"
  },
  {
    "title": "Trump accuses banks of discriminating against his supporters",
    "description": "The White House is said to be preparing an order calling for regulators to review US financial institutions.",
    "link": "https://www.aljazeera.com/economy/2025/8/5/trump-accuses-banks-of-discriminating-against-his-supporters",
    "timestamp": "2025-08-05T16:40:38Z"
  },
  {
    "title": "Official jobs numbers show it's a bad time to be looking for work—unless you're in this field",
    "description": "The few jobs the U.S. economy is creating are concentrated in this sector.",
    "link": "https://www.cnbc.com/2025/08/05/official-jobs-numbers-show-its-a-bad-time-to-be-looking-for-workunless-youre-in-this-field.html",
    "timestamp": "2025-08-05T16:39:39Z"
  },
  {
    "title": "The world nearly beat polio. But fake records, an imperfect vaccine and missteps aided its comeback",
    "description": "For the past decade, Sughra Ayaz has traveled door to door in southeastern Pakistan, pleading with parents to allow children to be vaccinated against polio...",
    "link": "https://www.cnn.com/2025/08/05/health/polio-eradication-missteps",
    "timestamp": "2025-08-05T16:39:38Z"
  },
  {
    "title": "Donald Zieben-Hood Arrested For Murder In Stabbing Death Of Fitness Influencer Husband Jacob Zieben-Hood + Trump On 3rd-Term Speculation + The Ass As Art + MORE! — 12-PACK",
    "description": "Donald Zieben-Hood Arrested For Murder In Stabbing Death Of Fitness Influencer Husband Jacob Zieben-Hood + Trump On 3rd-Term Speculation + The Ass As Art + MORE! — 12-PACK",
    "link": "https://www.boyculture.com/boy_culture/2025/08/jacob-donald-zieben-hood-stabbing-gay-shirtless-muslces-trump-jane-morgan.html",
    "timestamp": "2025-08-05T16:39:35Z"
  },
  {
    "title": "Ex-GOP leader calls party 'epitome of heartless' as he jumps ship to join Dems",
    "description": "Former Georgia Lt. Governor Geoff Duncan, a Republican, announced in an editorial that he's officially leaving the GOP — and he's implying that President Donald Trump is the straw that broke the camel's back. Duncan has been a Republican since entering public…",
    "link": "https://www.rawstory.com/geoff-duncan-2673860370/",
    "timestamp": "2025-08-05T16:38:02Z"
  },
  {
    "title": "Trump EPA says it will defend tough lead pipe rule from Biden, but details to come",
    "description": "Lead is a neurotoxin that can reduce IQ levels in children.",
    "link": "https://www.bostonherald.com/2025/08/05/trump-lead-pipes/",
    "timestamp": "2025-08-05T16:37:15Z"
  },
  {
    "title": "The Trump Administration's Move To Halt Wind and Solar Development on Federal Lands Reverses a Biden Priority",
    "description": "Reducing the government’s ownership of federal lands is the best way to protect against this energy policy whiplash.",
    "link": "https://reason.com/2025/08/05/the-trump-administrations-move-to-halt-wind-and-solar-development-on-federal-lands-reverses-a-biden-priority/",
    "timestamp": "2025-08-05T16:37:10Z"
  },
  {
    "title": "Republican Congressmen Make Moves to Block Trump-Backed Redistricting",
    "description": "A California and a New York Republican are introducing bills to prevent gerrymandering.",
    "link": "https://www.newsweek.com/republican-congressman-make-move-block-trump-backed-redistricting-2109239",
    "timestamp": "2025-08-05T16:36:15Z"
  },
  {
    "title": "The “Warrior Ethos” According To Trump: A Field Guide To Being Scared Of Everything",
    "description": "The Trump administration wants you to know they’re very, very tough. So tough, in fact, that they’re launching a comprehensive purge of the Naval Academy to eliminate “corrosive DEI programs” and restore what they call the “warrior ethos.” Because nothing say…",
    "link": "https://www.techdirt.com/2025/08/05/the-warrior-ethos-according-to-trump-a-field-guide-to-being-scared-of-everything/",
    "timestamp": "2025-08-05T16:36:00Z"
  },
  {
    "title": "Rupert Murdoch promises to give Trump 'regularly scheduled' health updates while staving off deposition",
    "description": "The deal between Rupert Murdoch and Donald Trump came in a lawsuit the president filed over an article about his relationship with Jeffrey Epstein.",
    "link": "https://www.businessinsider.com/rupert-murdoch-trump-health-updates-no-deposition-discovery-2025-8",
    "timestamp": "2025-08-05T16:35:55Z"
  },
  {
    "title": "'We're Going for the Full Conquest': Netanyahu War Cabinet Confirms Full Takeover of Gaza",
    "description": "One human rights expert warned Tuesday that Israel appears to be \"opting for a risky and dangerous\" ongoing strategy in Gaza after Israeli Prime Minister Benjamin Netanyahu confirmed earlier reports that his Cabinet is moving forward with plans to fully occup…",
    "link": "https://www.commondreams.org/news/trump-netanyahu-gaza-plan",
    "timestamp": "2025-08-05T16:35:48Z"
  },
  {
    "title": "Trump Says He 'Probably' Won't Run For President Again",
    "description": "The President has fueled speculation in the past that he would violate the Constitution and attempt to run for a third term.",
    "link": "https://time.com/7307562/trump-third-term-constitution/",
    "timestamp": "2025-08-05T16:35:25Z"
  },
  {
    "title": "Russia issues missile warning to West ahead of US deadline for Ukraine ceasefire",
    "description": "US envoys expected in Moscow and Kyiv ahead of Friday deadline",
    "link": "https://www.irishtimes.com/world/europe/2025/08/05/russia-issues-missile-warning-to-west-ahead-of-us-deadline-for-ukraine-ceasefire/",
    "timestamp": "2025-08-05T16:35:05Z"
  },
  {
    "title": "Bill and Hillary Clinton subpoenaed in Epstein case bombshell — what could they be forced to reveal?",
    "description": "The House Oversight Committee subpoenas Bill and Hillary Clinton and top DOJ officials in the Jeffrey Epstein sex trafficking probe. The DOJ must release all Epstein files by August 19, 2025. Ghislaine Maxwell’s deposition is delayed, while the DOJ may publis…",
    "link": "https://economictimes.indiatimes.com/news/international/us/bill-and-hillary-clinton-subpoenaed-in-epstein-case-bombshell-what-could-they-be-forced-to-reveal/articleshow/123123081.cms",
    "timestamp": "2025-08-05T16:34:57Z"
  },
  {
    "title": "Trump suggests undocumented farm workers are ‘naturally’ designed for field work",
    "description": "As Donald Trump suggests that immigrants are “naturally” designed for farm work, his preoccupation with immigrants and genetics seems to be getting worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-undocumented-farm-workers-naturally-farms-rcna223147",
    "timestamp": "2025-08-05T16:34:50Z"
  },
  {
    "title": "The Olympics Is the Last Thing LA Needs as It Deals With Fires and ICE",
    "description": "When the International Olympic Committee announced in September 2017 that Los Angeles would host the 2028 Summer Olympics, then-Mayor Eric Garcetti predicted, “The Olympics will spur a bold vision for our city.” Eight years later, enthusiasm in the City of An…",
    "link": "https://www.commondreams.org/opinion/la-doesn-t-need-olympics",
    "timestamp": "2025-08-05T16:34:48Z"
  },
  {
    "title": "AstraZeneca’s CFO On The Company’s Bet To Increase Its U.S. Business",
    "description": "Today’s Forbes CFO newsletter focuses on Aradhana Sarin’s journey from treating patients to becoming what she calls a transformational leader at the pharmaceutical giant.",
    "link": "https://www.forbes.com/sites/cfo/2025/08/05/astrazenecas-cfo-on-the-companys-bet-to-increase-its-us-business/",
    "timestamp": "2025-08-05T16:34:41Z"
  },
  {
    "title": "Ball State Professor: Trump firing of Bureau of Labor Statistics head is a 'tragedy'",
    "description": "Economist Michael Hicks criticizes Trump's firing of Bureau of Labor Statistics head, warns of potential consequences for investors and interest rates.",
    "link": "https://www.wishtv.com/news/business/ball-state-professor-trump-firing-of-bureau-of-labor-statistics-head-is-a-tragedy/",
    "timestamp": "2025-08-05T16:34:33Z"
  },
  {
    "title": "India rejects Trump threat over Russian oil",
    "description": "The president said he would raise tariffs on India for buying and selling Russian oil",
    "link": "https://theweek.com/politics/india-us-trump-tariffs-russia-oil-ukraine-war",
    "timestamp": "2025-08-05T16:32:28Z"
  },
  {
    "title": "DACA Recipient Dad in US Since Age 10 Hoping for Green Card Detained by ICE",
    "description": "The man, who legally came to the U.S. as a child, faces deportation, according to his wife.",
    "link": "https://www.newsweek.com/daca-recipient-detained-ice-green-card-2109141",
    "timestamp": "2025-08-05T16:31:33Z"
  },
  {
    "title": "Rupert Murdoch to disclose health issues in Trump’s WSJ lawsuit",
    "description": "President Trump has dropped his demand that Rupert Murdoch immediately testify in the president’s libel lawsuit over a Jeffrey Epstein story in the Wall Street Journal, but the 94-year-old media mogul has agreed to provide his health information.Trump initial…",
    "link": "https://freerepublic.com/focus/f-news/4332815/posts",
    "timestamp": "2025-08-05T16:31:17Z"
  },
  {
    "title": "Trump orders NASA to kill 2 satellites that can function for many more years - the reason will shock all",
    "description": "Trump NASA satellite shutdown: The White House has directed NASA to shut down two carbon-tracking satellites. These satellites monitor carbon dioxide levels. The satellites provide crucial data for understanding climate change. Scientists, farmers, and energy…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-shocking-order-to-terminate-vital-carbon-emission-satellitestrump-orders-nasa-to-kill-2-satellites-that-can-function-for-many-more-years-the-reason-will-shock-all-science-news-nasa-news/articleshow/123122943.cms",
    "timestamp": "2025-08-05T16:31:07Z"
  },
  {
    "title": "Most Americans are stressed about grocery prices, despite Trump’s weird falsehoods",
    "description": "It’s absurd for Donald Trump to tell people he’s reduced the cost of groceries and gasoline: Only so many people can be gaslit about their own wallets.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/americans-are-stressed-grocery-prices-trumps-weird-falsehoods-rcna223140",
    "timestamp": "2025-08-05T16:30:55Z"
  },
  {
    "title": "13-Year-Old From ‘Online Cult’ Arrested With Terrorism Manuals, Child Porn: Police",
    "description": "Florida police arrested a 13-year-old on Friday who is charged with possessing child pornography and beastiality material after he joined an “online cult” that allegedly targets minors for abuse, according to a local sheriff. The unnamed suspect was charged w…",
    "link": "https://freerepublic.com/focus/f-bloggers/4332814/posts",
    "timestamp": "2025-08-05T16:30:50Z"
  },
  {
    "title": "Illinois Gov. JB Pritzker rallies with Texas Democrats, calls Trump a ‘cheater’",
    "description": "Texas and national Democratic leaders and a potential 2028 presidential contender says 'everything is on the table' in gerrymandering spat.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/05/texas-gop-trump-pritzker-redistricting-cheating-democracy/85523447007/",
    "timestamp": "2025-08-05T16:30:37Z"
  },
  {
    "title": "In rejecting the jobs report, Trump follows his own playbook of discrediting unfavorable data",
    "description": "In rejecting the jobs report, Trump follows his own playbook of discrediting unfavorable datanews4jax.com",
    "link": "https://www.news4jax.com/news/politics/2025/08/05/in-rejecting-the-jobs-report-trump-follows-his-own-playbook-of-discrediting-unfavorable-data/",
    "timestamp": "2025-08-05T16:30:35Z"
  },
  {
    "title": "Kentucky governor praises FEMA under Trump, says its a 'credit to his administration'",
    "description": "Gov. Andy Beshear offered some praise of President Trump's FEMA on Tuesday during a podcast interview, but expressed concern that Trump wanted to \"unwind\" the agency.",
    "link": "https://www.foxnews.com/media/kentucky-governor-praises-fema-under-trump-says-credit-his-administration",
    "timestamp": "2025-08-05T16:30:19Z"
  },
  {
    "title": "Inside Epstein’s lavish Manhattan townhouse: A stuffed tiger, a Lolita first edition and a photo with Trump",
    "description": "Disgraced financier’s New York mansion close to Central Park contained peculiar interior decoration, including a sculpture of a bride clinging to a rope suspended above its stairwell",
    "link": "https://www.the-independent.com/news/world/americas/crime/jeffrey-epstein-manhattan-house-interior-b2802203.html",
    "timestamp": "2025-08-05T16:30:00Z"
  },
  {
    "title": "President Trump hits back at Jasmine Crockett, calls her ‘a very low IQ person’",
    "description": "Trump responds to Jasmine Crockett's profane comments by questioning her intelligence on CNBC, after she called him a 'piece of s---.'",
    "link": "https://www.foxnews.com/media/president-trump-hits-back-jasmine-crockett-calls-her-a-very-low-iq-person",
    "timestamp": "2025-08-05T16:29:51Z"
  },
  {
    "title": "‘South Park’ Will Target Trump Administration Again In New Episode As Series Heads To Paramount+",
    "description": "The White House called “South Park” a “fourth-rate” show “desperate” for attention after it skewered President Donald Trump in its season 27 premiere episode.",
    "link": "https://www.forbes.com/sites/conormurray/2025/08/05/south-park-will-target-trump-administration-again-in-new-episode-as-series-heads-to-paramount/",
    "timestamp": "2025-08-05T16:29:45Z"
  },
  {
    "title": "‘If They’re Going to Cheat, We’re Not Going to Play’",
    "description": "Texas Democrats explain why they upped the stakes to fight Trump’s power grab for the midterms next year.",
    "link": "http://nymag.com/intelligencer/article/inside-democrats-plan-to-stop-trump-by-fleeing-texas.html",
    "timestamp": "2025-08-05T16:29:38Z"
  },
  {
    "title": "‘He Likes His Daughter’: Texas Lawmaker Calls Trump a ‘Pedophile’ In Wild Interview With Don Lemon",
    "description": "Texas State Representative Jolanda Jones (D) went off on President Donald Trump on Tuesday, calling him a “pedophile” and accusing him of “liking” his own daughter. Jones joined Don Lemon on The Don Lemon Show on YouTube to discuss Republican redistricting ef…",
    "link": "https://www.mediaite.com/media/podcasts/he-likes-his-daughter-texas-lawmaker-calls-trump-a-pedophile-in-wild-interview-with-don-lemon/",
    "timestamp": "2025-08-05T16:28:42Z"
  },
  {
    "title": "Brazil Puts Jair Bolsonaro Under House Arrest After Massive Anti-Government Protest",
    "description": "Police placed conservative former President Jair Bolsonaro under house arrest on Monday night by order of Supreme Federal Tribunal (STF) Justice Alexandre de Moraes for allegedly breaking the restrictions imposed on him after Bolsonaro’s sons published footag…",
    "link": "https://www.breitbart.com/latin-america/2025/08/05/brazil-puts-jair-bolsonaro-under-house-arrest-after-massive-anti-government-protest/",
    "timestamp": "2025-08-05T16:28:28Z"
  },
  {
    "title": "Clintons subpoenaed in congressional Epstein investigation",
    "description": "Former top officials from the justice department during the Obama, Trump and Biden administrations were sent subpoenas",
    "link": "https://www.bbc.com/news/articles/c79l38vl3lwo",
    "timestamp": "2025-08-05T16:27:15Z"
  },
  {
    "title": "Inside Laura Loomer’s rise: ‘Obsessive’ research, Oval Office visits",
    "description": "Laura Loomer has leveraged a personality that friends label “obsessive” and an extreme loyalty to Trump to emerge as a powerful figure in the president’s orbit.Laura Loomer’s application for a White House press pass has gone unanswered for months. The jobs sh…",
    "link": "https://freerepublic.com/focus/f-news/4332811/posts",
    "timestamp": "2025-08-05T16:26:34Z"
  },
  {
    "title": "Review of World Affairs",
    "description": "By Shashi P.B.B. Malla Trump moves nuclear submarines after Russian ex-president’s provocative comments US President Donald Trump said he has […]\nThe post Review of World Affairs appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/05/review-of-world-affairs-60/",
    "timestamp": "2025-08-05T16:26:00Z"
  },
  {
    "title": "From ingredient costs to sagging demand, tariffs further pinch company earnings",
    "description": "(Reuters) -Companies across the corporate spectrum revealed more pain from the cost of U.S. President Donald Trump's tariff war, with bellwethers Caterpillar...",
    "link": "https://finance.yahoo.com/news/ingredient-costs-sagging-demand-tariffs-162541064.html",
    "timestamp": "2025-08-05T16:25:41Z"
  },
  {
    "title": "Most Voters Want Accountability For Russiagate, New Rasmussen Poll Shows",
    "description": "More than two-thirds of U.S. voters say officials behind Russiagate should be held accountable, according to a new Rasmussen poll.",
    "link": "https://dailycaller.com/2025/08/05/russiagate-kash-patel-fbi-rasmussen-poll-accountability-durham-annex/",
    "timestamp": "2025-08-05T16:25:12Z"
  },
  {
    "title": "Donald Trump says he will raise tariff of India 'substantially' in next 24 hours",
    "description": "President Trump, accusing India of supporting Russia's war through oil purchases, threatens to increase tariffs on Indian exports significantly. Despite India's defiance and claims of prior US encouragement, Trump expresses dissatisfaction with the trade rela…",
    "link": "https://timesofindia.indiatimes.com/world/us/donald-trump-says-he-will-raise-tariff-of-india-substantially-in-next-24-hours/articleshow/123123188.cms",
    "timestamp": "2025-08-05T16:23:46Z"
  },
  {
    "title": "Americans Hate Only One Person More Than Benjamin Netanyahu: Poll",
    "description": "A new Gallup poll reveals what Americans think about select U.S. and global “newsmakers.”",
    "link": "https://newrepublic.com/post/198823/americans-hate-one-person-more-benjamin-netanyahu-gallup-poll",
    "timestamp": "2025-08-05T16:23:35Z"
  },
  {
    "title": "Rwanda agrees to accept ‘third-party’ migrant deportations from the US",
    "description": "As many as 250 migrants may be deported to Rwanda under the plan, as part of Donald Trump's mass deportation campaign.",
    "link": "https://www.aljazeera.com/news/2025/8/5/rwanda-agrees-to-accept-third-party-migrant-deportations-from-the-us",
    "timestamp": "2025-08-05T16:22:50Z"
  },
  {
    "title": "How Trump is reshaping government data",
    "description": "Meteorological data collected by some weather balloons has been halted.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-reshaping-government-data-rcna222900",
    "timestamp": "2025-08-05T16:22:39Z"
  },
  {
    "title": "Trump targets big banks that deny accounts to conservatives",
    "description": "President Donald Trump said he’s preparing an executive order to crack down on banks using political or other non-financial reasons for denying customers accounts.\nHe told CNBC this morning that his JPMorgan Chase account was closed despite holding “hundreds …",
    "link": "https://biztoc.com/x/4ab135de4fa51bee",
    "timestamp": "2025-08-05T16:22:38Z"
  },
  {
    "title": "NY's Hochul vows response to Texas gerrymander",
    "description": "What happened\nNew York Gov. Kathy Hochul (D) Monday announced plans to \"fight fire with fire\" in the mid-cycle redistricting battle unleashed by Texas Republicans and President Donald Trump.\nFlanked by Texas Democratic lawmakers who fled their state to block …",
    "link": "https://biztoc.com/x/093749c52f4efe19",
    "timestamp": "2025-08-05T16:22:02Z"
  },
  {
    "title": "Court Upholds Texas Voter ID Law Which Dems Had Fled The State To Protest",
    "description": "The 5th Circuit Court of Appeals ruled Monday to uphold Texas’ voter ID requirement for mail-in ballots, a decision which President Donald Trump praised as “great news.” A brief opinion from Trump-appointed Circuit Judge James Ho, stated that “mail-in ballots…",
    "link": "https://dailycaller.com/2025/08/05/texas-court-appeals-voter-id-law-democrats/",
    "timestamp": "2025-08-05T16:20:51Z"
  },
  {
    "title": "Moving Forward: International Tax After The OBBBA",
    "description": "In this episode of Tax Notes Talk, Alan Cole of the Tax Foundation discusses the international tax provisions in the One Big Beautiful Bill Act and what may be next for negotiations on a global tax framework.",
    "link": "https://www.forbes.com/sites/taxnotes/2025/08/05/moving-forward-international-tax-after-the-obbba/",
    "timestamp": "2025-08-05T16:19:19Z"
  },
  {
    "title": "Diesel Pump Prices Are Surging in Potential Boost to Inflation",
    "description": "US diesel prices at the pump have surged to the highest in almost a year as retail markets catch up with tightness in global supplies of the widely used fuel, threatening to boost inflation.",
    "link": "https://financialpost.com/pmn/business-pmn/diesel-pump-prices-are-surging-in-potential-boost-to-inflation",
    "timestamp": "2025-08-05T16:18:56Z"
  },
  {
    "title": "Trump to lead task force for 2028 Olympic Games in Los Angeles",
    "description": "President Donald Trump is establishing a task force on the 2028 Olympic Games being held in Los Angeles, and will sign an executive order on Tuesday to make it official, the White House said.",
    "link": "https://www.cbc.ca/sports/olympics/donald-trump-task-force-los-angeles-olympics-2028-1.7601464",
    "timestamp": "2025-08-05T16:17:10Z"
  },
  {
    "title": "'We are entitled to 5 more seats': Trump weighs in on Texas redistricting fight",
    "description": "Gov. Greg Abbott directed the Texas Department of Public Safety to “locate\" and \"arrest\" Democrats who fled the state. President Donald Trump is standing firm in his support for Texas Republicans pushing a congressional redistricting plan, despite a dramatic …",
    "link": "https://freerepublic.com/focus/f-news/4332807/posts",
    "timestamp": "2025-08-05T16:15:51Z"
  },
  {
    "title": "This is what 'really got under Trump's skin' with jobs report: White House insiders",
    "description": "President Donald Trump is still reeling over last week’s ‘awful\r\n’ jobs report according to an anonymous White House official, who told CNN’s Alayna Treene Tuesday what specifically “set him off” regarding the report.Published last Friday, the figures from th…",
    "link": "https://www.rawstory.com/jobs/",
    "timestamp": "2025-08-05T16:15:49Z"
  },
  {
    "title": "President Trump to Issue Anti-Debanking Executive Order",
    "description": "President Donald Trump is set to issue an executive order that would pressure banks not to discriminate against conservatives and crypto companies.\nThe post President Trump to Issue Anti-Debanking Executive Order appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/05/president-trump-to-issue-anti-debanking-executive-order/",
    "timestamp": "2025-08-05T16:14:33Z"
  },
  {
    "title": "Trump Holds Call With Zelenskiy as Truce Deadline to Putin Looms",
    "description": "Ukrainian President Volodymyr Zelenskiy said he had a “productive” phone call with Donald Trump as Russia ramped up its attacks, despite a deadline set by the US leader for Moscow to end its full-scale invasion.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-holds-call-with-zelenskiy-as-truce-deadline-to-putin-looms",
    "timestamp": "2025-08-05T16:14:33Z"
  },
  {
    "title": "WATCH: U.S. government proposes easing some restrictions on drones traveling long distances",
    "description": "The federal government had already approved 657 waivers to allow companies to do this, but the waiver process made it difficult.",
    "link": "https://www.pbs.org/newshour/politics/watch-u-s-government-proposes-easing-some-restrictions-on-drones-traveling-long-distances",
    "timestamp": "2025-08-05T16:13:53Z"
  },
  {
    "title": "NY's Hochul vows response to Texas gerrymander",
    "description": "Gov. Kathy Hochul has promised to play ball with redistricting that favors the Democrats",
    "link": "https://theweek.com/politics/new-york-texas-house-redistricting-hochul-democrats",
    "timestamp": "2025-08-05T16:13:43Z"
  },
  {
    "title": "OpenAI, Anthropic approved for federal AI vendor list",
    "description": "OpenAI's ChatGPT, Google's Gemini and Anthropic's Claude have been added to a list of approved AI vendors, the US government's central purchasing arm said on Tuesday, as the Trump administration aims to boost AI's use by federal agencies.",
    "link": "https://www.rte.ie/news/business/2025/0805/1527056-openai-anthropic-approved-for-federal-ai-vendor-list/",
    "timestamp": "2025-08-05T16:12:36Z"
  },
  {
    "title": "Bill & Hillary Clinton Subpoenaed by Congressional Committee in Epstein Probe",
    "description": "Bill and Hillary Clinton -- and nearly a dozen other former feds and politicians -- have been subpoenaed for depositions by a Congressional committee ... all in connection to Jeffrey Epstein. Rep. James Comer, Chair of the House Oversight…",
    "link": "https://www.tmz.com/2025/08/05/bill-hillary-clinton-subpoenas-congressional-committee-jeffrey-epstein/",
    "timestamp": "2025-08-05T16:12:23Z"
  }
]