[
  {
    "title": "US ends case against doctor over Covid vaccine scheme",
    "description": "US Attorney General Pam Bondi has said she had ordered charges to be dropped against a doctor accused of destroying Covid-19 jabs and issuing fake vaccination certificates.",
    "link": "https://www.rte.ie/news/us/2025/0713/1523269-us-covid-trial/",
    "timestamp": "2025-07-13T08:54:12Z"
  },
  {
    "title": "Trump announces 30% tariffs against EU, Mexico to begin Aug. 1, rattling major US trading partners",
    "description": "BRIDGEWATER, N.J. (AP) — President Donald Trump on Saturday announced he’s levying tariffs of 30% against the European Union and Mexico starting Aug. 1, a move that could cause massive upheaval between the United States and two of its biggest trade partners. …",
    "link": "https://whnt.com/business/ap-business/ap-trump-announces-30-tariffs-against-eu-mexico-to-begin-august-1/",
    "timestamp": "2025-07-13T08:53:30Z"
  },
  {
    "title": "Farm worker dies after 'chaotic' US immigration raid in California",
    "description": "A chaotic raid on the legal cannabis farm saw around 200 workers apprehended.",
    "link": "https://www.thejournal.ie/ice-raid-farm-6761757-Jul2025/",
    "timestamp": "2025-07-13T08:49:46Z"
  },
  {
    "title": "Kushner takes office as Amb. to France |'Fighting antisemitism at the heart of my mission'",
    "description": "Charles Kushner begins diplomatic post in Paris with pledge to combat antisemitism, visits Holocaust memorial and US military cemetery in first official engagements.",
    "link": "https://www.israelnationalnews.com/news/411570",
    "timestamp": "2025-07-13T08:48:49Z"
  },
  {
    "title": "Impact of US tariffs varies across European Union",
    "description": "European countries are not all equally exposed to the US market and so will not suffer the same consequences should President Donald Trump go ahead with his threats to impose 30-percent tariffs on the European Union.",
    "link": "https://www.thelocal.com/20250713/impact-of-us-tariffs-varies-across-european-union",
    "timestamp": "2025-07-13T08:32:59Z"
  },
  {
    "title": "5 political cartoons about the Texas floods",
    "description": "Artists take on DOGE funding cuts, Donald Trump and natural disasters.",
    "link": "https://theweek.com/cartoons/cartoons-texas-floods-funding-cuts",
    "timestamp": "2025-07-13T08:06:00Z"
  },
  {
    "title": "Thomas Matthew Crooks: 5 Unanswered Questions About Would-Be Trump Assassin",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn July 13 last year, President Donald Trump—then a presidential candidate—was shot as he spoke to supporters at a campaign rally in Butler, Pennsylvania.\nMoments after a bullet grazed his ear, he defiantly ra…",
    "link": "https://biztoc.com/x/c089610faa11aaf0",
    "timestamp": "2025-07-13T08:03:09Z"
  },
  {
    "title": "Thomas Matthew Crooks: 5 Unanswered Questions About Would-Be Trump Assassin",
    "description": "The 20-year-old was shot dead by Secret Service after opening fire at a rally in Butler, Pennsylvania, on July 13, 2024.",
    "link": "https://www.newsweek.com/thomas-matthew-crooks-5-unanswered-questions-about-would-trump-assassin-2097161",
    "timestamp": "2025-07-13T08:00:01Z"
  },
  {
    "title": "Cisco chief Chuck Robbins believes affirmative action gives them better business",
    "description": "For Chuck Robbins, the chairman of Cisco, supports building teams of people who look at problems differently so that he gets two creative solutions.",
    "link": "https://www.livemint.com/companies/news/cisco-chief-chuck-robbins-diversity-inclusivity-donald-trump-dei-policies-us-tech-gaints-11752301546295.html",
    "timestamp": "2025-07-13T07:51:09Z"
  },
  {
    "title": "Rosie O’Donnell fires back after Trump says he may strip her of US citizenship in latest tiff of decadeslong feud",
    "description": "President Trump raged Saturday that he’s giving “serious consideration” to taking away comedian Rosie O’Donnell’s US citizenship – but the actress fired back with a flurry of posts ripping him and picturing him with Jeffrey Epstein. The social media sparring …",
    "link": "https://freerepublic.com/focus/f-chat/4328412/posts",
    "timestamp": "2025-07-13T07:50:39Z"
  },
  {
    "title": "Antoni: Trump’s economy soars instead of crashing",
    "description": "Many so-called experts predicted that President Donald Trump’s economic agenda would usher in an inflationary Armageddon. Yet the economy is thoroughly beating expectations, with consumers’ expectations becoming increasingly optimistic.",
    "link": "https://www.bostonherald.com/2025/07/13/antoni-trumps-economy-soars-instead-of-crashing/",
    "timestamp": "2025-07-13T07:49:15Z"
  },
  {
    "title": "Trump calls for MAGA base to end 'Epstein Files' obsession",
    "description": "WASHINGTON: President Donald Trump urged his political base on Saturday (Jul 12) to stop attacking his administration over files related to notorious sex offender Jeffrey Epstein, a case that has become an obsession for conspiracy theorists. Trump's Departmen…",
    "link": "https://www.channelnewsasia.com/world/us-donald-trump-jeffrey-epstein-files-maga-base-5235771",
    "timestamp": "2025-07-13T07:48:27Z"
  },
  {
    "title": "Vietnam Urges US Business Group to Help in Tariff Talks: Media",
    "description": "Vietnamese Prime Minister Pham Minh Chinh called on a US business group to continue supporting his country’s attempt to secure a final tariff agreement with the Trump administration after the two countries basically reached a consensus on the deal’s framework…",
    "link": "https://www.livemint.com/companies/news/vietnam-urges-us-business-group-to-help-in-tariff-talks-media-11752392639575.html",
    "timestamp": "2025-07-13T07:43:59Z"
  },
  {
    "title": "JPMorgan Tells Fintechs to Pay Up for Customer Data Access",
    "description": "JPMorgan Chase & Co. has told financial-technology companies that it will start charging fees amounting to hundreds of millions of dollars for access to their customers’ bank account information – a move that threatens to upend the industry’s business models.",
    "link": "https://www.livemint.com/companies/news/jpmorgan-tells-fintechs-to-pay-up-for-customer-data-access-11752392640040.html",
    "timestamp": "2025-07-13T07:43:59Z"
  },
  {
    "title": "California farmworker dies after falling from greenhouse roof during chaotic ICE raid | CNN",
    "description": "A farmworker who fell from a greenhouse roof during a chaotic ICE raid this week at a California cannabis facility died Saturday of his injuries.",
    "link": "https://www.cnn.com/2025/07/13/us/farmworker-dies-california-immigration-raids-hnk",
    "timestamp": "2025-07-13T07:28:08Z"
  },
  {
    "title": "EU urged to respond firmly as Trump's tariff threat sparks outrage",
    "description": "U.S. President Donald Trump's surprise announcement of sweeping 30 percent tariffs on European Union (EU) exports on Saturday has provoked a fierce backlash across the bloc, with officials and industry leaders demanding a strong and united response amid conti…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250712-globaltimes01.htm",
    "timestamp": "2025-07-13T07:18:27Z"
  },
  {
    "title": "Trump eyeing new aid package for Ukraine – CBS",
    "description": "Continued US military assistance will not contribute to a peaceful settlement of the conflict, Moscow has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621403-trump-eyeing-new-aid-package-ukraine/",
    "timestamp": "2025-07-13T07:16:23Z"
  },
  {
    "title": "Iran says it would resume nuclear talks with US if guaranteed no further attacks",
    "description": "Iran’s foreign minister said Saturday that his country would accept a resumption of nuclear talks with the US if there were assurances of no more attacks against it, state media reported.",
    "link": "https://nypost.com/2025/07/13/world-news/iran-would-resume-us-nuclear-talks-with-guarantee-of-no-further-attacks/",
    "timestamp": "2025-07-13T07:13:28Z"
  },
  {
    "title": "As Trump's America 'becomes weaker,' Canada vows to become stronger by diversifying trade partners",
    "description": "Canada has vowed to further strengthen itself by pursuing a diverse trade policy as opposed to the United States protectionist economic approach that has seen President Donald Trump unleash a deluge of tariffs on various countries, including Washington's own …",
    "link": "https://www.globalsecurity.org/wmd/library/news/canada/2025/canada-250712-presstv01.htm",
    "timestamp": "2025-07-13T07:09:35Z"
  },
  {
    "title": "Taiwan-U.S. tariff talks enter 'crucial moment': Taiwan official",
    "description": "Talks between Taipei and Washington over \"reciprocal tariffs\" imposed by U.S. President Donald Trump are entering a \"crucial moment,\" Taiwan's Vice Premier Cheng Li-chiun (鄭麗君) said Saturday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250712-cna03.htm",
    "timestamp": "2025-07-13T07:08:10Z"
  },
  {
    "title": "2025 SkS Weekly Climate Change & Global Warming News Roundup #28",
    "description": "A listing of 29 news and opinion articles we found interesting and shared on social media during the past week: Sun, July 6, 2025 thru Sat, July 12, 2025.\nStories we promoted this week, by category:\nClimate Change Impacts (6 articles)\n<ul>\n<li>DeBriefed 4 Jul…",
    "link": "https://skepticalscience.com/2025-SkS-Weekly-News-Roundup_28.html",
    "timestamp": "2025-07-13T07:05:10Z"
  },
  {
    "title": "Russia Launches More Deadly Attacks On Ukraine, Courts North Korea's Kim",
    "description": "Russia hammered Ukrainian cities with a new barrage of drone, missile, bomb, and artillery attacks, killing at least nine people and wounding dozens of others, Ukrainian officials said on July 12.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250712-rferl03.htm",
    "timestamp": "2025-07-13T07:02:09Z"
  },
  {
    "title": "The 8 at 8: Sunday",
    "description": "Trump returns to tariff talk, plastic netting on the way out and more warm weather.",
    "link": "https://www.thejournal.ie/8-at-8-sunday-the-journal-6761737-Jul2025/",
    "timestamp": "2025-07-13T07:00:00Z"
  },
  {
    "title": "Macron expresses ‘very strong disapproval’ of Trump’s tariff threat as EU leaders react",
    "description": "French president Emmanuel Macron expresses ‘very strong disapproval’",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/live/2025/07/12/us/trump-news/trumps-percent-tariff-threat-provokes-anger-and-frustration-in-europe",
    "timestamp": "2025-07-13T06:54:43Z"
  },
  {
    "title": "PSG, Chelsea set for Club World Cup final showdown",
    "description": "The curtain comes down on the first edition of FIFA’s expanded Club World Cup when reigning European champions Paris Saint-Germain, face Chelsea in Sunday’s final at the MetLife Stadium, with Donald Trump among those set to be in attendance. It is the kind of…",
    "link": "https://punchng.com/psg-chelsea-set-for-club-world-cup-final-showdown/",
    "timestamp": "2025-07-13T06:52:42Z"
  },
  {
    "title": "Trump to attend FIFA Club World Cup final",
    "description": "Donald Trump will on Sunday showcase his unexpected attachment to a sport in which “America First” remains a dream, for now. The US president is attending the final of the newly expanded FIFA Club World Cup in his latest use of the beautiful game as a soft po…",
    "link": "https://punchng.com/trump-to-attend-fifa-fifa-club-world-cup-final/",
    "timestamp": "2025-07-13T06:42:18Z"
  },
  {
    "title": "Trump has flagged 200 per cent tariffs on Australian pharmaceuticals. What do we produce here, and what’s at risk?",
    "description": "Trump has flagged 200 per cent tariffs on Australian pharmaceuticals. What do we produce here, and what’s at risk?7news.com.au",
    "link": "https://7news.com.au/news/trump-has-flagged-200-per-cent-tariffs-on-australian-pharmaceuticals-what-do-we-produce-here-and-whats-at-risk-c-19339451",
    "timestamp": "2025-07-13T06:18:27Z"
  },
  {
    "title": "Global week ahead: Trade tensions cloud earnings and the G20 heads south",
    "description": "The G20 meetings in South Africa next week come at an interesting time for the country.",
    "link": "https://www.cnbc.com/2025/07/13/global-week-ahead-trade-tensions-cloud-earnings-and-the-g20-heads-south.html",
    "timestamp": "2025-07-13T06:15:42Z"
  },
  {
    "title": "George Gibney's time in US drawing rapidly to a close",
    "description": "Given the choice of spending months in a US jail fighting extradition or returning to Ireland for trial, George Gibney chose the latter, writes Sean Whelan.",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0713/1523211-george-gibney/",
    "timestamp": "2025-07-13T06:00:13Z"
  },
  {
    "title": "Trump administration revokes Clinton-era rule that gives undocumented immigrants access to federal education funds",
    "description": "The U.S. Department of Education has revoked a Clinton-era policy that allowed undocumented immigrants to access federally funded career, technical and adult education programs. The change aligns with the 1996 Personal Responsibility and Work Opportunity Reco…",
    "link": "https://www.naturalnews.com/2025-07-13-ed-revokes-federal-education-funds-for-illegals.html",
    "timestamp": "2025-07-13T06:00:00Z"
  },
  {
    "title": "California DEFIES Trump administration order to ban transgender athletes from girls’ sports",
    "description": "The California Department of Education has rejected a U.S. Department of Education order requiring it to ban transgender athletes from competing in girls’ and women’s sports, defying the findings of a federal civil rights investigation. The Trump administrati…",
    "link": "https://www.naturalnews.com/2025-07-13-california-defies-trump-order-ban-transgender-athletes.html",
    "timestamp": "2025-07-13T06:00:00Z"
  },
  {
    "title": "Trump administration launches aggressive plan to shield U.S. farmland from foreign influence",
    "description": "A sweeping, multi-agency initiative was announced to safeguard American farmland, food systems and agricultural research from foreign adversaries, with a strong focus on countering Chinese influence. The National Farm Security Action Plan outlines aggressive …",
    "link": "https://www.naturalnews.com/2025-07-13-usda-launches-national-farm-security-action-plan.html",
    "timestamp": "2025-07-13T06:00:00Z"
  },
  {
    "title": "U.S. removes Syriaâ\u0080\u0099s former al-Qaeda affiliate HTS from terror list",
    "description": "The U.S. State Department removed Hay’at Tahrir al-Sham (HTS), formerly affiliated with al-Qaeda, from its Foreign Terrorist Organizations list, citing its reported dissolution and Syria’s renewed anti-terrorism stance. President Donald Trump signed an execut…",
    "link": "https://www.naturalnews.com/2025-07-13-us-removes-hts-from-its-terror-list.html",
    "timestamp": "2025-07-13T06:00:00Z"
  },
  {
    "title": "Trump’s 50% tariff on COPPER sends prices of the metal soaring",
    "description": "Copper prices hit historic highs after U.S. President Donald Trump announced a 50 percent tariff on imports, causing a 17 percent spike in futures before a slight retreat. The move aims to boost domestic production but risks disrupting global trade and raisin…",
    "link": "https://www.naturalnews.com/2025-07-13-trump-copper-tariff-sends-metal-prices-soaring.html",
    "timestamp": "2025-07-13T06:00:00Z"
  },
  {
    "title": "US aid cuts halt HIV vaccine research in South Africa, with global impact",
    "description": "South Africa has played a historic, global role in scientific research, from COVID-19 vaccines to HIV",
    "link": "https://abcnews.go.com/International/wireStory/us-aid-cuts-halt-hiv-vaccine-research-south-123712917",
    "timestamp": "2025-07-13T05:58:16Z"
  },
  {
    "title": "Six killed in massive Russian drone, missile attack across Ukraine",
    "description": "Russia fired more than 620 drones and long-range missiles overnight, killing at least six people in the latest wave of strikes, Ukraine said Saturday, adding that it was close to an agreement to receive more Patriot air-defense systems.",
    "link": "https://www.hurriyetdailynews.com/six-killed-in-massive-russian-drone-missile-attack-across-ukraine-211397",
    "timestamp": "2025-07-13T05:56:02Z"
  },
  {
    "title": "Vietnam got an early trade deal with Donald Trump. Was it worth it?",
    "description": "Vietnam got an early trade deal with Donald Trump. Was it worth it?\nThen $75 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial.\nDiscover all the plans currently available in your country",
    "link": "https://biztoc.com/x/2a5f2c7d74a4bd52",
    "timestamp": "2025-07-13T05:50:21Z"
  },
  {
    "title": "Odisha to copyright Jagannath temple rituals to protect traditional expressions: Puri's titular king",
    "description": "The Odisha government is seeking copyright protection for Lord Jagannath temple rituals. This move follows concerns about unauthorized ritual performances. ISKCON faced criticism for deviating from traditional dates. Objections arose regarding the Digha templ…",
    "link": "https://economictimes.indiatimes.com/news/india/odisha-to-copyright-jagannath-temple-rituals-to-protect-traditional-expressions-puris-titular-king/articleshow/122415347.cms",
    "timestamp": "2025-07-13T05:45:45Z"
  },
  {
    "title": "'It was unforgettable': Trump reflects on Butler assassination attempt",
    "description": "US President Donald Trump has reflected on his near-assassination after he was shot at a rally in Butler, Pennsylvania, on July 13, 2024.",
    "link": "https://www.abc.net.au/news/2025-07-13/donald-trump-reflects-on-assassination-attempt-one-year-on/105526454",
    "timestamp": "2025-07-13T05:21:22Z"
  },
  {
    "title": "Elon Breaks Silence on Trump’s Epstein File Demand to MAGA",
    "description": "Elon Musk has added his voice to the chorus of conservatives calling on President Donald Trump to release the Epstein files “as promised,” hours after the...",
    "link": "https://www.thedailybeast.com/elon-musk-breaks-silence-on-donald-trumps-epstein-file-demand/",
    "timestamp": "2025-07-13T05:18:27Z"
  },
  {
    "title": "Trump has declared war on the Hispanic community",
    "description": "One of the noteworthy features of the 2024 election was the deep inroads that Trump made into the traditionally Democratic voters in the Hispanic community. The [Rio Grande] Valley, a longtime Democratic stronghold, has in recent years been used as evidence o…",
    "link": "https://freethoughtblogs.com/singham/2025/07/13/trump-has-declared-war-on-the-hispanic-community/",
    "timestamp": "2025-07-13T05:18:09Z"
  },
  {
    "title": "New tax break for auto loans could save some buyers thousands of dollars. But will it boost sales?",
    "description": "The new tax law signed by President Donald Trump creates a federal tax deduction for interest on auto loans",
    "link": "https://abcnews.go.com/US/wireStory/new-tax-break-auto-loans-save-buyers-thousands-123712732",
    "timestamp": "2025-07-13T05:10:14Z"
  },
  {
    "title": "Trump the football fan: US president to attend FIFA club final",
    "description": "Donald Trump will on Sunday showcase his unexpected attachment to a sport in which \"America First\" remains a dream, for now.Trump has made it clear he sees both tournaments, as well as the 2028 Los Angeles Olympics, as showpieces for what he calls the \"Golden…",
    "link": "https://sports.yahoo.com/article/trump-football-fan-us-president-050655875.html",
    "timestamp": "2025-07-13T05:06:55Z"
  },
  {
    "title": "Trump Admin To Kill Another Massive Green Boondoggle, Hawley Says",
    "description": "“We will not allow a private corporation to trample property rights and mislead regulators for a bait and switch that serves out-of-state interests instead of Missourians,” Bailey said in the July 2 press release.",
    "link": "https://wattsupwiththat.com/2025/07/12/trump-admin-to-kill-another-massive-green-boondoggle-hawley-says/",
    "timestamp": "2025-07-13T05:00:00Z"
  },
  {
    "title": "Overheard: Joe Duffy goes from public service broadcaster to private detective",
    "description": "Plus: The great Eileen Dunne; Ireland’s biggest stud retires; and Roderic O’Gorman won’t stand for the Phoenix Park being trampled on",
    "link": "https://www.irishtimes.com/ireland/2025/07/13/overheard-joe-duffy-goes-from-public-service-broadcaster-to-private-detective/",
    "timestamp": "2025-07-13T05:00:00Z"
  },
  {
    "title": "Allowed inside, lawmakers split on conditions for detainees in ‘Alligator Alcatraz’",
    "description": "Democratic lawmakers condemned Florida’s new Everglades immigration detention center after visiting Saturday, describing it as crowded, unsanitary and bug-infested.",
    "link": "https://www.nbcnews.com/politics/immigration/allowed-lawmakers-split-conditions-alligator-alcatraz-rcna218498",
    "timestamp": "2025-07-13T04:59:42Z"
  },
  {
    "title": "10 Non-Tax Policies In Trump's Megabill That Will Affect Americans",
    "description": "The One Big Beautiful Bill Act is notable for implementing significant changes to the U.S. tax code, including making 2017’s individual income tax brackets permanent.But there are non-tax-related items in the bill that will impact the lives of everyday Americ…",
    "link": "https://freerepublic.com/focus/f-news/4328407/posts",
    "timestamp": "2025-07-13T04:53:19Z"
  },
  {
    "title": "After the storm on July 10, eyes now on July 15 — the next high alert!",
    "description": "Indian markets fell 1.2% amid global jitters and profit booking. July 10 marked a trend reversal as forecasted, with key support and resistance levels holding accurately. The upcoming July 15 is flagged as a High Alert Day. Traders are advised to follow time …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-the-storm-on-july-10-eyes-now-on-july-15-the-next-high-alert/articleshow/122414812.cms",
    "timestamp": "2025-07-13T04:52:37Z"
  },
  {
    "title": "Trump defends embattled AG Pam Bondi, says 'nobody cares about' Jeffrey Epstein",
    "description": "President Donald Trump on Saturday defended Attorney General Pam Bondi as doing a \"fantastic job\" after she came under fire from some Trump supporters over the Department of Justice’s handling of the Jeffrey Epstein files. \"What's going on with my ‘boys’ and,…",
    "link": "https://freerepublic.com/focus/f-news/4328406/posts",
    "timestamp": "2025-07-13T04:48:57Z"
  },
  {
    "title": "US aid cuts halt HIV vaccine research in South Africa, with global impact",
    "description": "The news devastated the researchers, who live and work in a region where more people live with HIV than anywhere else in the world",
    "link": "https://www.thehindubusinessline.com/news/world/us-aid-cuts-halt-hiv-vaccine-research-in-south-africa-with-global-impact/article69806659.ece",
    "timestamp": "2025-07-13T04:48:57Z"
  },
  {
    "title": "Read the Base, Trump: Voters Want Epstein Accountability",
    "description": "One of Donald Trump’s popular campaign promises was to work on releasing the Jeffrey Epstein files, so we could see how many people still in power were clients of the infamous child trafficker. In a new mystifying message, Trump not only supported his attorne…",
    "link": "https://freerepublic.com/focus/f-news/4328405/posts",
    "timestamp": "2025-07-13T04:48:01Z"
  },
  {
    "title": "Ukraine, US to begin new round of military talks as arms shipments restart",
    "description": "In an address on Friday, Zelenskyy emphasised the restoration of military aid shipments and the upcoming military-level discussions with the US, noting that the Assistant to the US President and Special Presidential Envoy for Ukraine, General Keith Kellogg, w…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-us-to-begin-new-round-of-military-talks-as-arms-shipments-restart/articleshow/122414801.cms",
    "timestamp": "2025-07-13T04:47:35Z"
  },
  {
    "title": "Another economist warns about intergenerational wealth in Australia",
    "description": "Older generations will transfer trillions of dollars in wealth to younger generations in coming decades, but how will it be managed?",
    "link": "https://www.abc.net.au/news/2025-07-13/economist-warns-about-intergenerational-wealth-in-australia/105517036",
    "timestamp": "2025-07-13T04:43:45Z"
  },
  {
    "title": "Trump Slaps 30% Tariffs on EU and Mexico Starting August 1, Sparking Trade Tensions",
    "description": "President Trump has announced sweeping 30% tariffs on goods from the European Union and Mexico, set to take effect August 1, raising concerns among key U.S. trading partners.",
    "link": "https://thedailybread.com/business/trump-slaps-30-tariffs-on-eu-and-mexico-starting-august-1-sparking-trade-tensions",
    "timestamp": "2025-07-13T04:42:59Z"
  },
  {
    "title": "‘One More Foot!’ Walker’s Heel Hook Magic Earns Him $50K",
    "description": "Official UFC Nashville post-fight bonus winners last night (Sat., July 12, 2025) LIVE on ESPN/ESPN+ from inside Bridgestone Arena in Nashville, Tennessee.",
    "link": "https://www.mmamania.com/2025/7/13/24466382/official-post-fight-bonus-winners-ufc-nashville-results-espn-lewis-teixeira-walker",
    "timestamp": "2025-07-13T04:40:28Z"
  },
  {
    "title": "Market Resilience Challenged by Trump’s Weekend Tariff Salvo",
    "description": "Financial markets, which have shown increasing insensitivity to tariff threats from the US, will face a test at the Monday open after President Donald Trump declared a 30% rate for the European Union and Mexico effective Aug. 1.",
    "link": "https://financialpost.com/pmn/business-pmn/market-resilience-challenged-by-trumps-weekend-tariff-salvo",
    "timestamp": "2025-07-13T04:31:20Z"
  },
  {
    "title": "Indicted Crypto Founder Seeks Pardon From US President Trump",
    "description": "According to the latest report, Anatoly Legkodymov, co-founder of crypto platform Bitzlato, has officially requested a pardon from United States President Donald Trump. Legkodymov, a Russian national, was arrested and charged with operating an unlicensed mone…",
    "link": "https://bitcoinist.com/indicted-crypto-founder-seeks-pardon-from-us/",
    "timestamp": "2025-07-13T04:30:16Z"
  },
  {
    "title": "Barry O’Halloran: Donald Trump may finally see Vladimir Putin for what he is —Don Corleone with nukes",
    "description": "Competing for the ­geopolitical affections of the world’s most powerful man must be ­exhausting at the best of times.",
    "link": "https://www.independent.ie/opinion/barry-ohalloran-donald-trump-may-finally-see-vladimir-putin-for-what-he-is-don-corleone-with-nukes/a920406637.html",
    "timestamp": "2025-07-13T04:30:00Z"
  },
  {
    "title": "The Sunday Independent’s View: Donald Trump only knows how to make threats, not deals",
    "description": "For a man who prides himself on having written a bestselling book called The Art of the Deal, Donald Trump has notably few deals to boast about since moving back into the White House last January.",
    "link": "https://www.independent.ie/opinion/editorial/the-sunday-independents-view-donald-trump-only-knows-how-to-make-threats-not-deals/a207137756.html",
    "timestamp": "2025-07-13T04:30:00Z"
  },
  {
    "title": "US aid cuts halt HIV vaccine research in South Africa, with global impact",
    "description": "South Africa has played a historic, global role in scientific research, from COVID-19 vaccines to HIV. Now that's under threat after the Trump administration cut hundreds of millions of dollars in funding for the country as part of the dismantling of foreign …",
    "link": "https://www.seattlepi.com/news/world/article/us-aid-cuts-halt-hiv-vaccine-research-in-south-20767806.php",
    "timestamp": "2025-07-13T04:25:27Z"
  },
  {
    "title": "Derrick Lewis demolishes Tallison Teixeira in just 35 seconds to win UFC Nashville main event",
    "description": "Derrick Lewis just turned back another young contender trying to build a name off him after he unleashed hell on Tallison Teixeira in the UFC Nashville main event.",
    "link": "https://www.mmafighting.com/2025/7/13/24466702/derrick-lewis-demolishes-tallison-teixeira-in-just-35-seconds-to-win-ufc-nashville-main-event",
    "timestamp": "2025-07-13T04:23:13Z"
  },
  {
    "title": "Highlights! Lewis Scores KO, Moons The Crowd, And Gets A Call From Trump",
    "description": "Watch UFC Nashville video highlights: Derrick Lewis vs. Tallison Teixeira last night (Sat., July 12, 2025) LIVE on ESPN/ESPN+ from inside Bridgestone Arena in Nashville, Tennessee.",
    "link": "https://www.mmamania.com/2025/7/13/24466378/full-fight-video-highlights-ufc-nashville-results-espn-lewis-knockout-teixeira-trump-knockout-moon",
    "timestamp": "2025-07-13T04:19:17Z"
  },
  {
    "title": "Millions will die by 2029 if US funding for HIV programs isn't replaced, UN warns",
    "description": "The UN says the withdrawal of US funding for the global HIV fight could lead to more than 4 million AIDS-related deaths and over 6 million additional HIV infections by 2029 if not replaced.",
    "link": "https://www.abc.net.au/news/2025-07-13/millions-will-die-hiv-programs-us-funding-un-warns/105079144",
    "timestamp": "2025-07-13T04:18:06Z"
  },
  {
    "title": "Trump backs crypto, Pakistan embraces it. How long must India wait?",
    "description": "Pakistan embraces crypto for strategic gains, including potential US favor, while India grapples with regulatory uncertainty and security concerns. Other nations like Bhutan leverage crypto for economic diversification. The US faces scrutiny over stablecoin r…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/trump-backs-crypto-pakistan-embraces-it-how-long-must-india-wait/articleshow/122414337.cms",
    "timestamp": "2025-07-13T04:15:30Z"
  },
  {
    "title": "Trump backs crypto, Pakistan embraces it. How long must India wait?",
    "description": "Pakistan embraces crypto for strategic gains, including potential US favor, while India grapples with regulatory uncertainty and security concerns. Other nations like Bhutan leverage crypto for economic diversification. The US faces scrutiny over stablecoin r…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/trump-backs-crypto-pakistan-embraces-it-how-long-must-india-wait/articleshow/122414337.cms",
    "timestamp": "2025-07-13T04:15:30Z"
  },
  {
    "title": "Trump backs crypto, Pakistan embraces it. How long must India wait?",
    "description": "Pakistan embraces crypto for strategic gains, including potential US favor, while India grapples with regulatory uncertainty and security concerns. Other nations like Bhutan leverage crypto for economic diversification. The US faces scrutiny over stablecoin r…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/trump-backs-crypto-pakistan-embraces-it-how-long-must-india-wait/articleshow/122416562.cms",
    "timestamp": "2025-07-13T04:15:30Z"
  },
  {
    "title": "Conflict of interest: Binance wrote code for Donald Trump's crypto token before founder Changpeng Zhao sought pardon",
    "description": "Binance reportedly assisted the Trump family's World Liberty Financial in launching its stablecoin USD1, by writing code and promoting it. This came before Binance founder Changpeng Zhao, sought a presidential pardon in a money laundering case.&nbsp;",
    "link": "https://www.livemint.com/companies/news/conflict-of-interest-binance-wrote-code-for-donald-trumps-crypto-token-before-founder-changpeng-zhao-sought-pardon-11752371185038.html",
    "timestamp": "2025-07-13T04:07:42Z"
  },
  {
    "title": "US aid cuts halt HIV vaccine research in South Africa, with global impact",
    "description": "South Africa faces setbacks in HIV research. The United States withdrew funding, impacting trials. Researchers are devastated as crucial projects halt. Layoffs occur, affecting scientists and health workers. The cuts impact data collection and patient care. O…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-aid-cuts-halt-hiv-vaccine-research-in-south-africa-with-global-impact/articleshow/122414482.cms",
    "timestamp": "2025-07-13T04:07:35Z"
  },
  {
    "title": "Israel confines most Palestinians in Gaza to just 21 sq mi., Kills 112 in One Day",
    "description": "( IMEMC ) - On Saturday, Day 645 of the ongoing genocide in Gaza, and Day 114 since Israel violated the mediated ceasefire agreement on March 18, Israeli missiles and shells have killed at least 112 Palestinians, including 34 while awaiting humanitarian aid, …",
    "link": "https://www.juancole.com/2025/07/israel-confines-palestinians.html",
    "timestamp": "2025-07-13T04:06:50Z"
  },
  {
    "title": "Mamdani or Madman?",
    "description": "When Hollywood celebrities rejoice for a socialist Democrat New York City mayoral candidate and you have Rep. Alexandria Ocasio-Cortez (D-NY) and House Democrat Leader Hakeem Jeffries (D-NY) praising the victory with Ilhan Omar proclaiming “Alh...",
    "link": "https://www.americanthinker.com/articles/2025/07/mamdani_or_madman.html",
    "timestamp": "2025-07-13T04:00:00Z"
  },
  {
    "title": "Donald Trump’s exemplary bravery",
    "description": "It seemed like an uneventful Sunday morning in the city of Bengaluru, India, where I was temporarily based.\r\n\r\nI woke up at 8 A.M. and turned on my phone, expecting nothing unusual.  I logged on to X and glanced through the very first ...",
    "link": "https://www.americanthinker.com/blog/2025/07/donald_trump_s_exemplary_bravery.html",
    "timestamp": "2025-07-13T04:00:00Z"
  },
  {
    "title": "The Civil War wasn't enough: Democrats call for blood",
    "description": "In 2020 the “defund the police” movement had some initial success in reducing the number of police officers in blue cities. Because most of the budget of any police agency is manpower, reductions in funding inevitably reduce the number of...",
    "link": "https://www.americanthinker.com/blog/2025/07/the_civil_war_wasn_t_enough_democrats_call_for_blood.html",
    "timestamp": "2025-07-13T04:00:00Z"
  },
  {
    "title": "DNC Chair Ken Martin lies about lying",
    "description": "Ken Martin is the Chairman of the Democrat National Committee (DNC). He's the primary fundraiser and spokesman for America’s Democrats. Zohran Mamdani is the Democrat Party’s candidate to be the next Mayor of New York City. Mamda...",
    "link": "https://www.americanthinker.com/blog/2025/07/dnc_chair_ken_martin_lies_about_lying.html",
    "timestamp": "2025-07-13T04:00:00Z"
  },
  {
    "title": "Bring back the Redskins",
    "description": "If you grew up invested in the Redskins-Cowboys rivalry, then it’s hard to feel passion whenever Washington comes to Dallas or we go there these days.  With all due respect to whoever the Commanders are named after, I am still calling them...",
    "link": "https://www.americanthinker.com/blog/2025/07/bring_back_the_redskins.html",
    "timestamp": "2025-07-13T04:00:00Z"
  },
  {
    "title": "Musk calls on Trump to release Epstein files",
    "description": "Billionaire entrepreneur Elon Musk called on United States President Donald Trump to release the Epstein files.In a post on X, Musk wrote that Trump \"said 'Epstein' half a dozen times while telling ev...",
    "link": "https://biztoc.com/x/04cf0245284dd04c",
    "timestamp": "2025-07-13T03:59:22Z"
  },
  {
    "title": "Vietnam Urges US Business Group To Help In Tariff Talks: Media",
    "description": "Vietnamese Prime Minister Pham Minh Chinh called on a US business group to continue supporting his country’s attempt to secure a final tariff agreement with the Trump administration after the two countries basically reached a consensus on the deal’s framework…",
    "link": "https://www.ndtvprofit.com/global-economics/vietnam-urges-us-business-group-to-help-in-tariff-talks-media",
    "timestamp": "2025-07-13T03:58:21Z"
  },
  {
    "title": "Farm Worker Dies After US Immigration Raid In California",
    "description": "A farm worker has died after being injured during a raid by US immigration agents on a legal cannabis farm in California, his family said on Saturday.",
    "link": "https://www.ibtimes.com/farm-worker-dies-after-us-immigration-raid-california-3778338",
    "timestamp": "2025-07-13T03:57:17Z"
  },
  {
    "title": "New tax break for auto loans could save some buyers thousands of dollars. But will it boost sales?",
    "description": "New tax break for auto loans could save some buyers thousands of dollars. But will it boost sales?clickondetroit.com",
    "link": "https://www.clickondetroit.com/business/2025/07/13/new-tax-break-for-auto-loans-could-save-some-buyers-thousands-of-dollars-but-will-it-boost-sales/",
    "timestamp": "2025-07-13T03:56:22Z"
  },
  {
    "title": "New tax break for auto loans could save some buyers thousands of dollars. But will it boost sales?",
    "description": "New tax break for auto loans could save some buyers thousands of dollars. But will it boost sales?click2houston.com",
    "link": "https://www.click2houston.com/business/2025/07/13/new-tax-break-for-auto-loans-could-save-some-buyers-thousands-of-dollars-but-will-it-boost-sales/",
    "timestamp": "2025-07-13T03:56:13Z"
  },
  {
    "title": "New tax break for auto loans could save some buyers thousands of dollars. But will it boost sales?",
    "description": "Millions of people receive a federal tax deduction for the interest they pay on home loans. Under President Donald Trump’s new tax-cut law, many people for the first time also could claim a tax deduction for interest on their vehicle loans. The new tax break …",
    "link": "https://financialpost.com/pmn/new-tax-break-for-auto-loans-could-save-some-buyers-thousands-of-dollars-but-will-it-boost-sales",
    "timestamp": "2025-07-13T03:52:30Z"
  },
  {
    "title": "Bitcoin retail interest ‘almost nowhere to be found’ as BTC taps highs",
    "description": "Bitcoin’s surge to all-time highs has barely moved the needle in Google search interest compared to the spike seen after Donald Trump won the US presidential election in November.",
    "link": "https://cointelegraph.com/news/bitcoin-retail-interest-lacking-google-search-btc-all-time-highs",
    "timestamp": "2025-07-13T03:42:47Z"
  },
  {
    "title": "Furor Over Epstein Files Sparks Clash Between Bondi And Bongino At The Justice Department",
    "description": "The fallout from the Jeffrey Epstein files flap is cascading.",
    "link": "https://www.huffpost.com/entry/justice-department-jeffrey-epstein-furor_n_68732a40e4b07a168b47cc3e",
    "timestamp": "2025-07-13T03:41:11Z"
  },
  {
    "title": "Mexico Sure It Will Strike Deal With US To Skirt Tariffs",
    "description": "Mexico is projecting confidence that it will fend off a new set of 30% tariffs that President Donald Trump threatened Saturday to impose next month, with talks already underway to avert the worst.",
    "link": "https://www.ndtvprofit.com/global-economics/mexico-sure-it-will-strike-deal-with-us-to-skirt-tariffs",
    "timestamp": "2025-07-13T03:30:11Z"
  },
  {
    "title": "AI helped save the chip industry. What happens if it turns out to be a bust?",
    "description": "Some signs suggest that AI growth is stalling, or at least slowing down.",
    "link": "https://fortune.com/asia/2025/07/12/what-happens-if-ai-boom-fizzles-out-semiconductors-chips-rakesh-kumar/",
    "timestamp": "2025-07-13T03:30:00Z"
  },
  {
    "title": "Why top Trump officials are fighting over an Epstein document they say does not exist",
    "description": "A disagreement between US government officials over the decision to withhold records from the Jeffrey Epstein sex trafficking investigation spilled into the open this week. Here's how it unfolded.",
    "link": "https://www.abc.net.au/news/2025-07-13/trump-administration-epstein-list-bondi-bongino/105525136",
    "timestamp": "2025-07-13T03:25:14Z"
  },
  {
    "title": "Trump announces 30% tariffs on EU and Mexico starting August",
    "description": "WASHINGTON DC: President Donald Trump has declared that the United States will impose a 30% tariff on imports from the European Union and Mexico beginning August 1. He also warned that if either trading partner retaliates with their own tariffs, the US would …",
    "link": "https://english.khabarhub.com/2025/13/485251/",
    "timestamp": "2025-07-13T03:15:35Z"
  },
  {
    "title": "Rosie O’Donnell Net Worth: How much is the American comedian worth, whose citizenship Trump is threatening to revoke?",
    "description": "Donald Trump threatened to revoke Rosie O'Donnell's citizenship after she criticized his administration's environmental policies in a TikTok video. O'Donnell, now residing in Ireland, has amassed an $80 million net worth through diverse ventures, including te…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/rosie-odonnell-net-worth-how-much-is-the-american-comedian-worth-whose-citizenship-trump-is-threatening-to-revoke/articleshow/122414102.cms",
    "timestamp": "2025-07-13T03:15:23Z"
  },
  {
    "title": "Trump faces a revolt from his MAGA base over the Epstein files (NBC News)",
    "description": "NBC News:\nTrump faces a revolt from his MAGA base over the Epstein files  —  The Epstein files — and calls for Attorney General Pam Bondi to be fired — dominated a conservative conference in Tampa this weekend.  —  TAMPA, Fla. — On the weekend President Donal…",
    "link": "https://www.memeorandum.com/250712/p64",
    "timestamp": "2025-07-13T03:15:01Z"
  },
  {
    "title": "Trump threatens to strip Rosie O'Donnell's U.S. citizenship as he says she's a 'threat to humanity'",
    "description": "Trump and O'Donnell's 18-year feud intensifies as the president suggests stripping the comedian's citizenship after her Ireland move, sparking pointed social media responses.",
    "link": "https://www.foxnews.com/entertainment/trump-threatens-strip-rosie-odonnells-u-s-citizenship-he-says-shes-threat-humanity",
    "timestamp": "2025-07-13T03:09:41Z"
  },
  {
    "title": "A year after Trump's near-assassination, friends and allies see some signs of a changed man",
    "description": "One year after a near-assassination attempt, Donald Trump reflects on the event's impact. Friends and aides note he is more appreciative and believes he was saved by God to save the country. Trump commemorates the event with memorabilia and sees it as a sign …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-year-after-trumps-near-assassination-friends-and-allies-see-some-signs-of-a-changed-man/articleshow/122414097.cms",
    "timestamp": "2025-07-13T03:06:41Z"
  },
  {
    "title": "Flashback: East Detroit pastor hypes Trump’s ‘millimeter miracle’",
    "description": "While Lorenzo Sewell was in high school, his dad got incarcerated and his brother got murdered in East Detroit. “I was mentored by murderers. I was a student of the street,” said the former drug abuser, drug dealer and gang leader. But Lorenzo found God in Pa…",
    "link": "https://freerepublic.com/focus/f-religion/4328389/posts",
    "timestamp": "2025-07-13T03:03:32Z"
  },
  {
    "title": "Trump says he’s considering ‘taking away’ Rosie O’Donnell’s US citizenship",
    "description": "President Donald Trump says he is considering revoking actress and comedian Rosie O’Donnell’s U.S. citizenship.",
    "link": "https://www.news4jax.com/news/politics/2025/07/12/trump-says-hes-considering-taking-away-rosie-odonnells-us-citizenship/",
    "timestamp": "2025-07-13T03:00:42Z"
  },
  {
    "title": "Haim Ramon opposes Witkoff outline: The worst of all worlds",
    "description": "Former Justice Minister urges Netanyahu to demand the release of all hostages in exchange for ending the war.",
    "link": "https://www.israelnationalnews.com/news/411557",
    "timestamp": "2025-07-13T02:58:30Z"
  },
  {
    "title": "Columbia and Donald Trump near a deal",
    "description": "Columbia University and the Trump administration are close to a deal regarding allegations of anti-Jewish harassment. Columbia may pay hundreds of millions to settle the matter, potentially restoring some of the $400 million in federal research funding that w…",
    "link": "https://timesofindia.indiatimes.com/world/us/columbia-and-donald-trump-near-a-deal/articleshow/122413985.cms",
    "timestamp": "2025-07-13T02:54:53Z"
  },
  {
    "title": "Donald Trump announces 30% tariffs on EU, Mexico",
    "description": "President Trump announced 30% tariffs on the EU and Mexico starting August 1, citing trade deficits and border security concerns. He claims these tariffs will revive the US economy, despite acknowledging Mexico's help with migration. The EU vows to safeguard …",
    "link": "https://timesofindia.indiatimes.com/world/us/donald-trump-announces-30-tariffs-on-eu-mexico/articleshow/122413946.cms",
    "timestamp": "2025-07-13T02:50:08Z"
  },
  {
    "title": "California farmworker dies after chaotic federal immigration raid, family says",
    "description": "Jaime Alanis Garcia, a cannabis farmworker who was critically injured during a chaotic immigration raid by federal authorities in Southern California, died Saturday, according to his family.",
    "link": "https://www.nbcnews.com/news/us-news/california-farmworker-dies-immigration-raid-rcna218467",
    "timestamp": "2025-07-13T02:41:16Z"
  }
]