[
  {
    "title": "After Election Day losses, Trump and MAGA will strike back hard",
    "description": "Far from being a lame duck, Trump and MAGA will only escalate their attacks on democracy",
    "link": "https://www.salon.com/2025/11/12/after-election-day-losses-trump-and-maga-will-strike-back-hard/",
    "timestamp": "2025-11-12T11:45:13Z"
  },
  {
    "title": "Vladimir Putin To Visit India On Dec. 5, Russian Forum Host Says",
    "description": "Russian President Vladimir Putin will make a visit to India in December as the two countries continue to strengthen ties despite the Kremlin’s war on Ukraine.",
    "link": "https://www.ndtvprofit.com/nation/vladimir-putin-to-visit-india-on-dec-5-russian-forum-host-says",
    "timestamp": "2025-11-12T11:42:44Z"
  },
  {
    "title": "Colombia suspends intelligence sharing with US",
    "description": "Colombian President Gustavo Petro has ordered Colombian public security forces to suspend intelligence sharing with US intelligence agencies until the US stops attacking boats in the Caribbean.",
    "link": "https://www.rte.ie/news/world/2025/1112/1543520-colombia-us/",
    "timestamp": "2025-11-12T11:41:34Z"
  },
  {
    "title": "Trump writes to Israel's president to pardon Netanyahu from corruption charges",
    "description": "Donald Trump has taken the extraordinary step of writing to Israel's President Isaac Herzog, calling on him to pardon Benjamin Netanyahu of long-standing corruption charges.",
    "link": "https://www.abc.net.au/news/2025-11-12/donald-trump-letter-israel-president-pardon-benjamin-netanyahu/106003278",
    "timestamp": "2025-11-12T11:39:58Z"
  },
  {
    "title": "'America is in crisis': JFK's grandson launches campaign plan to tackle Trump",
    "description": "JFK's grandson, Jack Schlossberg, has launched a campaign bid to tackle Donald Trump. The only grandson of late president John F. Kennedy launched his bid for a New York City congressional seat and warned that America \"is in crisis\" under the Republican Party…",
    "link": "https://www.rawstory.com/jack-schlossberg-trump-bid/",
    "timestamp": "2025-11-12T11:38:31Z"
  },
  {
    "title": "Scott Jennings Defends Trump’s Disastrous Fox News Interview, Insists Importing Workers ‘Makes America Stronger’",
    "description": "CNN senior political commentator Scott Jennings defended President Donald Trump's disastrous interview with Fox News on Tuesday.\nThe post Scott Jennings Defends Trump’s Disastrous Fox News Interview, Insists Importing Workers ‘Makes America Stronger’ first ap…",
    "link": "https://www.mediaite.com/media/tv/scott-jennings-defends-trumps-disastrous-fox-news-interview-insists-importing-workers-makes-america-stronger/",
    "timestamp": "2025-11-12T11:37:52Z"
  },
  {
    "title": "Morning Bid: Tech turbulence and data deluge due",
    "description": "and global markets today , Editor-At-Large, Finance and Markets Markets have already effectively priced in the U. government's reopening on Monday, with...",
    "link": "https://finance.yahoo.com/news/morning-bid-tech-turbulence-data-113405832.html",
    "timestamp": "2025-11-12T11:34:05Z"
  },
  {
    "title": "UNC halts 10-year decline",
    "description": "Energy Minister Dr Roodal Moonilal says the UNC Government has halted the decade-long decline in oil and gas output and is now recording steady growth, with plans to transform Trinidad",
    "link": "https://trinidadexpress.com/business/local/unc-halts-10-year-decline/article_f6312e95-eff0-4b0c-8617-a2a26ad2bd10.html",
    "timestamp": "2025-11-12T11:33:01Z"
  },
  {
    "title": "Penny wise? U.S. retailers need a better plan as one-cent coin begins phase out",
    "description": "In February, President Trump directed the U.S. Mint to cease making pennies.\n- The one-cent coin costs four times more than its face value to produce.\n- Businesses report phasing out the penny is problematic due to a lack of planning.\nPresident Donald Trump’s…",
    "link": "https://biztoc.com/x/fc8a6ef533017131",
    "timestamp": "2025-11-12T11:31:54Z"
  },
  {
    "title": "Donald Trump Sends Pardon Letter to Israeli President",
    "description": "U.S. President Donald Trump sent a letter to Israeli President Isaac Herzog asking that he pardon Prime Minister Benjamin Netanyahu.\n\"While I absolutely respect the independence of the Israeli Justice System, and its requirements, I believe that this 'case' a…",
    "link": "https://biztoc.com/x/655288934f970429",
    "timestamp": "2025-11-12T11:31:24Z"
  },
  {
    "title": "The Supreme Court just might save Trump from himself",
    "description": "The Supreme Court heard oral arguments on November 5 about the legality of President Donald Trump’s tariffs. | Mandel Ngan/AFP via Getty Images \nKey takeaways\nThe Supreme Court might soon overturn most of Trump’s tariffs.\nIf those tariffs ceased to exist, pri…",
    "link": "https://biztoc.com/x/8c2282160bf337c1",
    "timestamp": "2025-11-12T11:31:17Z"
  },
  {
    "title": "From functional expert to business leader: How IIM Indore's Executive Programme in Business Management rewrites career trajectories",
    "description": "IIM Indore's Executive Programme in Business Management helps mid-career professionals transition to leadership roles through a 10-month curriculum covering marketing, finance, operations, and strategic management. Features live online classes, campus immersi…",
    "link": "https://timesofindia.indiatimes.com/education/from-functional-expert-to-business-leader-how-iim-indores-executive-programme-in-business-management-rewrites-career-trajectories/articleshow/125272275.cms",
    "timestamp": "2025-11-12T11:29:27Z"
  },
  {
    "title": "Man who considered World Naked Bike Ride cyclist a \"pervert\", punched him off bike and attacked police officers spared prison sentence",
    "description": "A police officer also needed their ear glued back together following the assault. Lee Turnage was given a suspended sentence due to his \"previous good character\"",
    "link": "https://road.cc/content/news/motorcyclist-punched-world-naked-bike-rider-avoids-jail-316805",
    "timestamp": "2025-11-12T11:27:49Z"
  },
  {
    "title": "Olympic champion Noah Lyles reveals how his passion for this Japanese special earned him hotel upgrades",
    "description": "Reigning world champion sprinter Noah Lyles revealed his passion for anime and the Yu-Gi-Oh! card game has led to unexpected hotel upgrades. Lyles, known for his charisma, shared that pulling out a 'Blue-Eyes White Dragon' card has sometimes garnered more att…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/olympic-champion-noah-lyles-reveals-how-his-passion-for-this-japanese-special-earned-him-hotel-upgrades/articleshow/125273268.cms",
    "timestamp": "2025-11-12T11:27:22Z"
  },
  {
    "title": "Dana White labeled \"small\" as Alex Pereira's UFC White House callout for Jon Jones falls flat",
    "description": "Alex Pereira's call out of Jon Jones for a White House fight has excited fans, but UFC CEO Dana White remains hesitant, citing trust issues with Jones. Chael Sonnen criticized White's stance, calling it personal rather than professional and highlighting the c…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/dana-white-labeled-small-as-alex-pereiras-ufc-white-house-callout-for-jon-jones-falls-flat/articleshow/125273316.cms",
    "timestamp": "2025-11-12T11:26:59Z"
  },
  {
    "title": "US House to vote on deal to end longest government shutdown in history",
    "description": "WASHINGTON (Reuters) -The House of Representatives will try to end the longest government shutdown in U.S. history on Wednesday, with a vote on a stopgap funding package to restart disrupted food assistance, pay hundreds of thousands of federal workers and re…",
    "link": "https://www.thestar.com.my/news/world/2025/11/12/us-house-to-vote-on-deal-to-end-longest-government-shutdown-in-history",
    "timestamp": "2025-11-12T11:20:00Z"
  },
  {
    "title": "Jack Schlossberg succeeded in ‘trolling for a cause.’ Now, he’s running for Congress",
    "description": "Jack Schlossberg announced on Wednesday he isn running for the House seat of retiring Rep. Jerrold Nadler. He's bringing his very online brand into real life.",
    "link": "https://www.msnbc.com/msnbc/news/jack-schlossberg-running-congress-house-nadler-kennedy-rcna243329",
    "timestamp": "2025-11-12T11:19:39Z"
  },
  {
    "title": "US stock futures advance as investors cheer possible end to federal shutdown",
    "description": "Wall Street futures ticked higher on Wednesday as investors cheered a possible end to the longest U.S. government shutdown, while an upbeat earnings outlook from Advanced Micro Devices revived optimism around AI.AMD climbed 4.6 per cent in premarket trading a…",
    "link": "https://www.channelnewsasia.com/business/us-stock-futures-advance-investors-cheer-possible-end-federal-shutdown-5462541",
    "timestamp": "2025-11-12T11:19:06Z"
  },
  {
    "title": "'Next part of this battle': Trump biographer says Pam Bondi in hot seat over Epstein files",
    "description": "Speaker Mike Johnson (R-LA) is about to move a monstrous problem President Donald Trump is facing from the back burner to the \"front burner,\" according to two analysts, and Pam Bondi may be in the hot seat next.Lawmakers on the Hill are debating a legislative…",
    "link": "https://www.rawstory.com/mike-johnson-2674287003/",
    "timestamp": "2025-11-12T11:15:42Z"
  },
  {
    "title": "UPSSSC Draftsman and Cartographer admit card 2025 released at upsssc.gov.in: Check direct link to download hall ticket here",
    "description": "The UPSSSC has released admit cards for the Draftsman and Cartographer examination 2025. Candidates who paid the fee can download their hall tickets. The main exam is on November 16, 2025, in Lucknow. This recruitment aims to fill 283 vacancies for Draftsman …",
    "link": "https://timesofindia.indiatimes.com/education/news/upsssc-draftsman-and-cartographer-admit-card-2025-released-at-upsssc-gov-in-check-direct-link-to-download-hall-ticket-here/articleshow/125272835.cms",
    "timestamp": "2025-11-12T11:13:38Z"
  },
  {
    "title": "Glasgow 2026 takes bold stand as Commonwealth Games welcome transgender athletes amid Olympic ban talks",
    "description": "Glasgow will host the Commonwealth Games next year without a blanket ban on transgender athletes. Each sport will decide its own rules, allowing transgender athletes to compete based on federation policies. This approach differs from the International Olympic…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/glasgow-2026-takes-bold-stand-as-commonwealth-games-welcome-transgender-athletes-amid-olympic-ban-talks/articleshow/125272929.cms",
    "timestamp": "2025-11-12T11:11:56Z"
  },
  {
    "title": "Fearful of Trump's raids, some Hispanic shoppers turn to safety of online buying",
    "description": "NEW YORK/NEWARK :In Newark's heavily Latino Ironbound district, Rosa Ludena works the register of the electronics shop she's owned since 2003. A wall of phone cases appears on display behind her, but few shoppers are around to buy them. Traffic has slowed, an…",
    "link": "https://www.channelnewsasia.com/business/fearful-trumps-raids-some-hispanic-shoppers-turn-safety-online-buying-5462521",
    "timestamp": "2025-11-12T11:11:49Z"
  },
  {
    "title": "Trump claims 'obligation' to sue BBC",
    "description": "U.S. President Donald Trump said he had an \"obligation\" to sue the BBC over a misleading speech edit, stopping short of announcing legal action in a Fox News interview aired on Nov. 11.",
    "link": "https://www.hurriyetdailynews.com/trump-claims-obligation-to-sue-bbc-215647",
    "timestamp": "2025-11-12T11:11:07Z"
  },
  {
    "title": "US House set for crunch vote on ending historic government shutdown",
    "description": "Republicans sound confident the bill will pass, despite their narrow majority. Democrats vow to oppose it.",
    "link": "https://www.bbc.com/news/articles/cr437q69422o",
    "timestamp": "2025-11-12T11:10:39Z"
  },
  {
    "title": "Trump Facing Biden-Level Backlash: ‘This Is His Economy Now’",
    "description": "As President Donald Trump tries to reclaim the political narrative on inflation and affordability, new polling shows voters are increasingly viewing him the way they once viewed his predecessor: as the person responsible for an economy that feels more expensi…",
    "link": "https://biztoc.com/x/c85bdf922f76f697",
    "timestamp": "2025-11-12T11:09:43Z"
  },
  {
    "title": "Herzog receives Trump's letter on Netanyahu matter",
    "description": "Israeli President Isaac Herzog's office announced on Wednesday that he has received a letter from United States leader Donald Trump in which he officially asked him to pardon Prime Minister Benjamin N...",
    "link": "https://biztoc.com/x/589d50ffd0233e23",
    "timestamp": "2025-11-12T11:09:02Z"
  },
  {
    "title": "Fast Fashion Could Face Levy In Bid To Stop Cheap Product Dumping",
    "description": "As Chinese retailers shift their focus towards Europe following a U.S. duty clampdown, French politicians are ready to act fast and slap an environmental levy on imports.",
    "link": "https://www.forbes.com/sites/markfaithfull/2025/11/12/fast-fashion-could-face-levy-in-bid-to-stop-cheap-product-dumping/",
    "timestamp": "2025-11-12T11:08:27Z"
  },
  {
    "title": "Terence Corcoran: Beware calls for a ‘balanced’ trade deal with the U.S.",
    "description": "Terence Corcoran: For anti-free-trade economist Oren Cass, balanced trade effectively means managed trade, with the U.S. as manager-in-chief",
    "link": "https://financialpost.com/opinion/terence-corcoran-balanced-trade-deal-us",
    "timestamp": "2025-11-12T11:00:56Z"
  },
  {
    "title": "Trump's signature tariffs hang on key question about Congress' power before Supreme Court",
    "description": "The Supreme Court weighs separation of powers issues as Donald Trump defends his use of emergency law to bypass Congress on global tariffs.",
    "link": "https://www.foxnews.com/politics/trumps-signature-tariffs-hang-key-question-about-congress-power-before-supreme-court",
    "timestamp": "2025-11-12T11:00:51Z"
  },
  {
    "title": "Investors Now See Some Companies as Safer Bets Than Governments",
    "description": "In corporate boardrooms since the pandemic era, executives have dealt with the rise in interest rates by keeping budgets lean and reducing overall...",
    "link": "https://finance.yahoo.com/news/investors-now-see-companies-safer-110012648.html",
    "timestamp": "2025-11-12T11:00:12Z"
  },
  {
    "title": "How the Trump administration seeks to ‘weaponize’ the White House website to troll Democrats and amplify its message",
    "description": "While the second Trump administration’s social media strategy has long embraced memes and videos mocking Democrats, former White House officials are raising concerns about the irreverent approach bleeding over to a website previously geared toward historical …",
    "link": "https://www.cnn.com/2025/11/12/politics/white-house-website-trump",
    "timestamp": "2025-11-12T11:00:02Z"
  },
  {
    "title": "Chuck Schumer doesn’t deserve this heat",
    "description": "The Senate bill to end the shutdown and fund SNAP but not extend Obamacare ACA subsidies had eight Democrats vote for it but not Chuck Schumer of New York",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/senate-shutdown-deal-chuck-schumer-rcna243015",
    "timestamp": "2025-11-12T11:00:00Z"
  },
  {
    "title": "Jeanine Pirro tells ‘Pod Force One’ that Trump DOJ’s Russiagate investigations aren’t about ‘retribution’",
    "description": "\"When it involves criminal activity, there's got to be a response. You can't just look away,\" Pirro told The Post's Miranda Devine.",
    "link": "https://nypost.com/2025/11/12/us-news/jeanine-pirro-tells-pod-force-one-that-trump-dojs-russiagate-investigations-arent-about-retribution/",
    "timestamp": "2025-11-12T11:00:00Z"
  },
  {
    "title": "Florida is suing Planned Parenthood for racketeering. It’s part of a bigger plan",
    "description": "Florida Attorney General James Uthmeier accuses Planned Parenthood of “misrepresenting the safety” of abortion pills and claims its activities are “racketeering.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/florida-planned-parenthood-racketeering-lawsuit-abortion-rcna243242",
    "timestamp": "2025-11-12T11:00:00Z"
  },
  {
    "title": "Episode Six: Airborne Imperialism",
    "description": "A U.S.-led program killed a young missionary and her daughter in Peru after mistaking their plane for drug smugglers in 2001. Trump’s Venezuela boat strikes have made their deaths newly and urgently relevant.\nThe post Episode Six: Airborne Imperialism appeare…",
    "link": "https://theintercept.com/2025/11/12/collateral-damage-episode-six-airborne-imperalism/",
    "timestamp": "2025-11-12T11:00:00Z"
  },
  {
    "title": "Caroline Kennedy ‘doesn’t want’ son Jack Schlossberg running for Congress: sources",
    "description": "“Caroline has pleaded with Jack not to run,\" an insider revealed of Kennedy and Schlossberg.",
    "link": "https://nypost.com/2025/11/12/us-news/caroline-kennedy-doesnt-want-son-in-politics-sources/",
    "timestamp": "2025-11-12T11:00:00Z"
  },
  {
    "title": "Donald Trump says he has ‘obligation’ to sue BBC over speech edit",
    "description": "US president sets Friday deadline for corporation to respond to billion-dollar legal threat\nTrump to sue BBC – latest updates\nDonald Trump has said he feels he has “an obligation” to sue the BBC over its editing of one of his speeches, as a deadline looms for…",
    "link": "https://biztoc.com/x/d49b449be314b8dc",
    "timestamp": "2025-11-12T10:58:08Z"
  },
  {
    "title": "Blue Ant Rights drops controversial BBC Trump documentary",
    "description": "The BBC documentary at the centre of the political and potentially legal storm between the UK pubcaster and president Donald Trump has been dropped by its distributor, Canada’s Blue Ant Rights. P...",
    "link": "https://www.c21media.net/news/blue-ant-rights-drops-controversial-bbc-trump-documentary/",
    "timestamp": "2025-11-12T10:55:17Z"
  },
  {
    "title": "Cambodia, Thailand trade accusations of fresh border clashes",
    "description": "Cambodia and Thailand traded accusations of fresh clashes along their border on Wednesday, after Bangkok said it was pausing the implementation of a US-backed peace deal. Five days of hostilities erupted between Thailand and Cambodia this summer, killing 43 p…",
    "link": "https://www.digitaljournal.com/world/cambodia-thailand-trade-accusations-of-fresh-border-clashes/article",
    "timestamp": "2025-11-12T10:52:22Z"
  },
  {
    "title": "Trump says he has 'obligation' to sue BBC over speech edit",
    "description": "US President Donald Trump has said he has an \"obligation\" to sue the BBC over the way a section of his speech was edited in a Panorama documentary. Speaking to Fox News, he said his 6 January 2021 speech had been \"butchered\" and the way it was presented had \"…",
    "link": "https://freerepublic.com/focus/f-news/4352069/posts",
    "timestamp": "2025-11-12T10:52:05Z"
  },
  {
    "title": "Donald Trump’s grand daughter Kai Trump reveals rare pep talk from Tiger Woods before stepping onto LPGA stage",
    "description": "Donald Trump's granddaughter, Kai Trump, is set to make her LPGA debut at The ANNIKA tournament in Florida, having received a sponsor exemption. She's drawing inspiration from golfing legend Tiger Woods, who advised her to \"go out there and have fun.\" Kai, a …",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/donald-trumps-grand-daughter-kai-trump-reveals-rare-pep-talk-from-tiger-woods-before-stepping-onto-lpga-stage/articleshow/125272578.cms",
    "timestamp": "2025-11-12T10:51:15Z"
  },
  {
    "title": "Trump Writes To Herzog: Pardon Netanyahu, his attention cannot be diverted",
    "description": "President Herzog received a signed letter from President Trump urging him to consider pardoning Netanyahu. Herzog clarified that a pardon request requires a formal procedure in accordance with the rules.",
    "link": "https://www.israelnationalnews.com/news/417679",
    "timestamp": "2025-11-12T10:48:00Z"
  },
  {
    "title": "Trust us, not America, China tells Asia",
    "description": "Trust us, not America, China tells Asia\nCompared with Donald Trump, Xi Jinping looks like a more reliable trade partner\nBy Aaron Connelly, Asia diplomatic editor & Singapore bureau chief, The Economist\nIn late 2026, Xi Jinping will host a grand gala dinner fo…",
    "link": "https://biztoc.com/x/1993c7415b2be9e8",
    "timestamp": "2025-11-12T10:47:52Z"
  },
  {
    "title": "America’s Supreme Court will continue to bless Donald Trump’s agenda",
    "description": "America’s Supreme Court will continue to bless Donald Trump’s agenda\nBut not on absolutely everything\nBy Steven Mazie, Supreme Court correspondent, The Economist\nEARLY IN HIS second term, Donald Trump has profited from his previous appointments of Justices Am…",
    "link": "https://biztoc.com/x/e500669245577622",
    "timestamp": "2025-11-12T10:47:42Z"
  },
  {
    "title": "Donald Trump might challenge election results in 2026, say two leading lawyers",
    "description": "Donald Trump might challenge election results in 2026, say two leading lawyers\nJack Goldsmith and Bob Bauer highlight the potential risks\nBy Jack Goldsmith and Bob Bauer, government lawyers under George W. Bush and Barack Obama\nON November 3rd 2026 Americans …",
    "link": "https://biztoc.com/x/4ece2a0357c5fc27",
    "timestamp": "2025-11-12T10:47:41Z"
  },
  {
    "title": "Nayib Bukele consolidates his dictatorship in El Salvador",
    "description": "Nayib Bukele consolidates his dictatorship in El Salvador\nWith the help of Donald Trump\nBy Sarah Birke, Bureau chief for Mexico, Central America and the Caribbean, The Economist\nIn 2026 Nayib Bukele will consolidate his dictatorship. Still only in his early 4…",
    "link": "https://biztoc.com/x/07555cdab13e9385",
    "timestamp": "2025-11-12T10:47:38Z"
  },
  {
    "title": "America is going through a big economic experiment",
    "description": "America is going through a big economic experiment\nIn 2026, results will start to come in thick and fast\nBy Archie Hall, US economics editor, The Economist\nScientists like to run experiments carefully, isolating variables one at a time. Donald Trump operates …",
    "link": "https://biztoc.com/x/fd7935f960afa424",
    "timestamp": "2025-11-12T10:47:18Z"
  },
  {
    "title": "What’s next for the Democrats?",
    "description": "What’s next for the Democrats?\nSuccess in the midterms will not solve their problems\nBy Kennett Werner, Washington correspondent, The Economist\nAs donald trump has taken hold of presidential power with both hands and begun testing the law from all angles, Ame…",
    "link": "https://biztoc.com/x/a209a04aa85896e9",
    "timestamp": "2025-11-12T10:47:14Z"
  },
  {
    "title": "Donald Trump counts the wins of unpredictability. The losses will come",
    "description": "Donald Trump counts the wins of unpredictability. The losses will come\nAmerica will need allies when a crisis strikes. What then?\nBy Anton La Guardia, Diplomatic editor, The Economist\nDONALD TRUMP’S dealings with the world in 2026 will be predictably unpredic…",
    "link": "https://biztoc.com/x/403319825aed6a1e",
    "timestamp": "2025-11-12T10:47:11Z"
  },
  {
    "title": "Trump Says He Has ‘Obligation’ To Sue BBC As He Sets Deadline",
    "description": "President Donald Trump has threatened to sue the British Broadcasting Corporation (BBC) for $1 billion, alleging that a Panorama documentary broadcast by the network \"defrauded the public\" by editing a 2021 speech he delivered before the attack on the U.S. Ca…",
    "link": "https://biztoc.com/x/9a04715d1101dd20",
    "timestamp": "2025-11-12T10:47:05Z"
  },
  {
    "title": "Trump Says He Has ‘Obligation’ To Sue BBC As He Sets Deadline",
    "description": "President Donald Trump has threatened to sue the British Broadcasting Corporation (BBC) for $1 billion, alleging that a Panorama documentary broadcast by the network \"defrauded the public\" by editing a 2021 speech he delivered before the attack on the U.S. Ca…",
    "link": "https://biztoc.com/x/9a04715d1101dd20",
    "timestamp": "2025-11-12T10:47:05Z"
  },
  {
    "title": "Trump Admin Expands Oil & Gas Drilling In Gulf Of America, Eyes Alaska Next",
    "description": "Trump Admin Expands Oil & Gas Drilling In Gulf Of America, Eyes Alaska Next\n \nThe Department of the Interior announced on Nov. 7 two major steps to expand offshore oil and gas leasing under President Donald Trump’s One Big Beautiful Bill Act, unveiling plans …",
    "link": "https://biztoc.com/x/81b80878ab19ef64",
    "timestamp": "2025-11-12T10:46:52Z"
  },
  {
    "title": "US yet to cut tariffs on Korean imports to 15%",
    "description": "The two countries agreed a broad-based trade deal in October.",
    "link": "https://www.just-auto.com/news/us-yet-to-cut-tariffs-on-korean-imports-to-15/",
    "timestamp": "2025-11-12T10:33:16Z"
  },
  {
    "title": "Editorial: Far from a dynamic duo on Boston Council",
    "description": "Boston City Councilors will soon be paid $125,000 a year; they should start earning it.",
    "link": "https://www.bostonherald.com/2025/11/12/editorial-far-from-a-dynamic-duo-on-boston-council/",
    "timestamp": "2025-11-12T10:31:31Z"
  },
  {
    "title": "Seven reasons Dems should drop this failed leader — now",
    "description": "If the Democrats want the best possible chance of winning the midterms, Chuck Schumer needs to step aside now. Even when the Senate Minority Leader does the right thing, as he did in standing up for Obamacare subsidies during the shutdown, he does it badly. A…",
    "link": "https://www.rawstory.com/raw-investigates/chuck-schumer-2674284983/",
    "timestamp": "2025-11-12T10:30:01Z"
  },
  {
    "title": "How Trump Has Exploited Pardons and Clemency to Reward Allies and Supporters",
    "description": "The president’s second term has brought a flood of clemency for allies and donors — as well as felons, like him, who were convicted of financial wrongdoing.",
    "link": "http://www.propublica.org/article/trump-pardons-clemency-george-santos-ed-martin",
    "timestamp": "2025-11-12T10:30:00Z"
  },
  {
    "title": "Rupee depreciates 16 paise to close at 88.66 against US dollar",
    "description": "The rupee depreciated 16 paise to close at 88.66 (provisional) against the US dollar on Wednesday, weighed down by the strength of the American currency in the overseas market and elevated crude oil prices.",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-depreciates-16-paise-to-close-at-8866-against-us-dollar/article70270737.ece",
    "timestamp": "2025-11-12T10:29:50Z"
  },
  {
    "title": "Donald Trump says he has 'obligation' to sue BBC in Fox News interview – video",
    "description": "Donald Trump said he has an 'obligation' to sue the BBC for misrepresenting his comments before the January 6 attacks on the US Capitol in 2021. The US president reiterated his threat of launching a $1bn legal action during an interview on Fox News, saying th…",
    "link": "https://biztoc.com/x/deca2be2e42f206d",
    "timestamp": "2025-11-12T10:24:27Z"
  },
  {
    "title": "Government funding deal would reverse some of Trump's mass federal workers firings",
    "description": "During the shutdown, he fired more than 4,000 federal workers across the government.",
    "link": "https://abcnews.go.com/Politics/government-funding-deal-reverse-trumps-mass-federal-worker/story?id=127426908",
    "timestamp": "2025-11-12T10:17:17Z"
  },
  {
    "title": "House set to vote on ending government shutdown",
    "description": "The House will be in session on Wednesday for the first time in 54 days, with all eyes on a vote to end the longest government shutdown in U.S. history.",
    "link": "https://abcnews.go.com/Politics/house-set-vote-ending-government-shutdown/story?id=127421219",
    "timestamp": "2025-11-12T10:14:04Z"
  },
  {
    "title": "Donald Trump Says He Has an ‘Obligation’ to Sue the BBC for $1 Billion: ‘They Defrauded the Public and They’ve Admitted It’",
    "description": "Donald Trump has said he plans to go ahead with his lawsuit against the BBC after it emerged they doctored footage of his Jan. 6 Capitol speech. Asked by Fox News’ Laura Ingraham on “The Ingraham Angle” whether he planned to sue, Trump responded: “Well, I gue…",
    "link": "https://variety.com/2025/politics/global/donald-trump-sue-the-bbc-1-billion-defrauded-the-public-1236577804/",
    "timestamp": "2025-11-12T10:07:37Z"
  },
  {
    "title": "Would Trump’s $1bn lawsuit against the BBC hold up in court?",
    "description": "The US president would find it difficult to prove defamation if he sues in the US, where free speech is safeguarded.",
    "link": "https://www.aljazeera.com/news/2025/11/12/would-trumps-1bn-lawsuit-against-the-bbc-hold-up-in-court",
    "timestamp": "2025-11-12T10:05:05Z"
  },
  {
    "title": "What Annika Sorenstam said after watching Kai Trump play at LPGA debut in Pelican Golf Club",
    "description": "Donald Trump's granddaughter, 18-year-old Kai Trump, is making her LPGA debut at The Annika tournament in Florida. LPGA legend Annika Sorenstam praised Kai's game and maturity, noting her ability to handle pressure. Sorenstam urged everyone to support the you…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/what-annika-sorenstam-said-after-watching-kai-trump-play-at-lpga-debut-in-pelican-golf-club/articleshow/125271374.cms",
    "timestamp": "2025-11-12T10:03:09Z"
  },
  {
    "title": "Inside the backroom negotiations that led to the shutdown deal",
    "description": "Democrats involved in the negotiations to reopen government told MSNBC they were never quite comfortable with the shutdown strategy.",
    "link": "https://www.msnbc.com/msnbc/news/democrats-backroom-negotiations-shutdown-rcna243352",
    "timestamp": "2025-11-12T10:00:40Z"
  },
  {
    "title": "Gen Z loves both Trump and Mamdani for the same reason",
    "description": "Gen Z voters propelled both Donald Trump and New York City mayor-elect Zohran Mamdani to victory despite their opposing policies, united by promises to disrupt the system.",
    "link": "https://www.foxnews.com/opinion/gen-z-loves-both-trump-mamdani-same-reason",
    "timestamp": "2025-11-12T10:00:09Z"
  },
  {
    "title": "The Campaign to Free Jimmy Lai",
    "description": "Liam Scott\n\n\n\nHow a globe-trotting attorney is trying to win the release of the famed Hong Kong publisher.\r\n\n\r\n\n\nThe post The Campaign to Free Jimmy Lai appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/the-campaign-to-free-jimmy-lai/",
    "timestamp": "2025-11-12T10:00:02Z"
  },
  {
    "title": "Trump’s 50-year mortgage just introduces a new kind of debt",
    "description": "Trump administration explores 50-year mortgages to tackle housing crisis, but the real problem is supply shortage and government red tape driving up costs.",
    "link": "https://www.foxnews.com/opinion/trumps-50-year-mortgage-just-introduces-new-kind-debt",
    "timestamp": "2025-11-12T10:00:01Z"
  },
  {
    "title": "Homeland Security Tightens Rule on Anti-ICE Activities",
    "description": "The rule, which went into effect this month, prohibits a wide range of activities, and activists fear the Trump administration will use the regulation to cover up misconduct by immigration officials.\nThe post Homeland Security Tightens Rule on Anti-ICE Activi…",
    "link": "http://prospect.org/2025/11/12/homeland-security-tightens-rule-on-anti-ice-activities/",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "Democrats cling to silver linings amid criticism they caved to Trump",
    "description": "Democrats shut down the federal government to secure a key demand: extending health care subsidies for millions of Americans.",
    "link": "https://www.nbcnews.com/politics/congress/democrats-wins-shutdown-fight-health-care-obamacare-subsidies-trump-rcna243211",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "On day 43 of the shutdown, a vote in the House could bring the impasse to an end",
    "description": "A vote in the House expected on Wednesday could end what is now the longest shutdown on record. Democrats are decrying the plan, saying it fails to address expiring health care subsidies.",
    "link": "https://www.npr.org/2025/11/12/nx-s1-5606078/government-shutdown-house-vote",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "“Riots Raging”: The Misleading Story Fox News Told About Portland Before Trump Sent Troops",
    "description": "After reviewing coverage from the network and hours of social media videos that preceded Trump’s decision, ProPublica found that Fox’s portrayal of “Portland rioters” routinely instigating violence was misleading.",
    "link": "http://www.propublica.org/article/portland-protests-national-guard-fox-news-coverage",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "What the Air You Breathe May Be Doing to Your Brain",
    "description": "Studies increasingly find links between higher concentrations of certain pollutants and the prevalence of dementia.",
    "link": "https://kffhealthnews.org/news/article/dementia-alzheimers-air-pollution-pm2-5-particulate-matter-pennsylvania/",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "Former Democratic Rep. Elaine Luria launches bid for her old seat in Virginia",
    "description": "Former Rep. Elaine Luria, D-Va., a member of the Jan. 6 committee who lost re-election in 2022, is launching a bid for her old congressional seat.",
    "link": "https://www.nbcnews.com/politics/2026-election/former-democratic-rep-elaine-luria-launches-bid-old-seat-virginia-rcna243193",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "Readers Take Congress to Task and Offer Their Own Health Policy Fixes",
    "description": "KFF Health News gives readers a chance to comment on a recent batch of stories.",
    "link": "https://kffhealthnews.org/news/article/reader-letters-november-2025-shutdown-affordable-health-care/",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "The Magical Thinking Behind Graham Platner’s Rise",
    "description": "How fetishizing the working-class does it—and all Americans—a disservice.\nThe post The Magical Thinking Behind Graham Platner’s Rise appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/12/the-magical-thinking-behind-graham-platners-rise/",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "Make California a G7 Member",
    "description": "The Golden State is poised to join vital international organizations as the Trump administration retreats from them. \nThe post Make California a G7 Member  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/12/make-california-a-g7-member/",
    "timestamp": "2025-11-12T10:00:00Z"
  },
  {
    "title": "Producer Behind BBC’s Donald Trump Film Was Kept In Dark About Editing Error",
    "description": "The production company attached to the controversial Donald Trump Panorama only found out that it was about to cause one of the biggest crises to befall the BBC this decade when they read about it in the papers last week, Deadline understands. October Films, …",
    "link": "http://deadline.com/2025/11/bbc-donald-trump-saga-october-films-kept-in-dark-1236613974/",
    "timestamp": "2025-11-12T09:55:40Z"
  },
  {
    "title": "UK cuts funding to AIDS, tuberculosis and malaria project by £150m",
    "description": "The UK has historically been one of the biggest donors to the Geneva-based Global Fund - its £850m pledge for 2026 to 2028 represents a 15% drop in funding.",
    "link": "https://news.sky.com/story/uk-cuts-funding-to-aids-tuberculosis-and-malaria-project-by-150m-13468997",
    "timestamp": "2025-11-12T09:55:00Z"
  },
  {
    "title": "Trump Reveals His 'Greatest Strength,' And His Critics Have Some Notes",
    "description": "The president talked about what he sees as his best skill during a Fox News interview.",
    "link": "https://www.huffpost.com/entry/trump-greatest-strength_n_69144df2e4b09f6fd8c43669",
    "timestamp": "2025-11-12T09:54:45Z"
  },
  {
    "title": "The Epstein files fight is finally coming to the House floor",
    "description": "The monthslong bipartisan effort to sidestep Speaker Mike Johnson and force the release of all Justice Department files on the late sex trafficker Jeffrey Epstein is kicking into high gear this week, setting up a December floor battle that President Donald Tr…",
    "link": "https://biztoc.com/x/079fb3bcba6456bc",
    "timestamp": "2025-11-12T09:51:11Z"
  },
  {
    "title": "US futures mostly up as government reopening nears",
    "description": "Major United States stock indexes traded mostly higher in premarket on Wednesday as investors welcomed signs of progress after US President Donald Trump expressed confidence that a deal to reopen the ...",
    "link": "https://biztoc.com/x/a67f8323e36e2236",
    "timestamp": "2025-11-12T09:50:59Z"
  },
  {
    "title": "Newsom Flies 5,000+ Miles to Lash Trump for 'Dumb' U.S. Climate Policy",
    "description": "California Gov. Gavin Newsom (D) dedicated much of his Tuesday participation at the COP30 climate doomer summit lashing out at President Donald Trump over his \"dumb\" rejection of climate change alarmism. \nThe post Newsom Flies 5,000+ Miles to Lash Trump for ‘…",
    "link": "https://www.breitbart.com/environment/2025/11/12/newsom-flies-5000-miles-to-lash-trump-for-dumb-u-s-climate-policy/",
    "timestamp": "2025-11-12T09:47:52Z"
  },
  {
    "title": "Al-Aqsa Flood operation shattered illusion of 'Greater Israel': Hamas leader",
    "description": "Senior Hamas leader Osama Hamdan said that Operation al-Aqsa Flood will remain a historic milestone for the Palestinian nation, as it shattered the illusion of a so-called \"Greater Israel\" project.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251111-presstv02.htm",
    "timestamp": "2025-11-12T09:47:08Z"
  },
  {
    "title": "USS Gerald Ford Moves to SOUTHCOM to Join US' Growing Buildup in Region - Fleet",
    "description": "US aircraft carrier USS Gerald Ford has been moved from the Mediterranean to join the US Southern Command (SOUTHCOM) amid tensions around drug trafficking in the Caribbean, the SOUTHCOM said on Tuesday.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251111-sputnik01.htm",
    "timestamp": "2025-11-12T09:44:21Z"
  },
  {
    "title": "US futures up as government reopening nears",
    "description": "Major United States stock indexes traded mostly higher in premarket on Wednesday as investors welcomed signs of progress after US President Donald Trump expressed confidence that a deal to reopen the ...",
    "link": "https://biztoc.com/x/c3239501b51709e7",
    "timestamp": "2025-11-12T09:40:17Z"
  },
  {
    "title": "UK cuts intelligence sharing with US Caribbean boat strikes, calling them 'illegal': Report",
    "description": "The UK has suspended sharing of maritime intelligence with the US over concerns that Washington is using British-provided information to carry out deadly and unlawful military strikes on, what the White House insists are, drug-trafficking boats in the Caribbe…",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-251111-presstv01.htm",
    "timestamp": "2025-11-12T09:36:24Z"
  }
]