[
  {
    "title": "Elon Musk is no longer the world's richest person, new ranking says",
    "description": "Oracle co-founder Larry Ellison took the title of world's richest person from Elon Musk after stock in the software giant shot up on Wednesday.",
    "link": "https://www.cbsnews.com/news/elon-musk-larry-ellison-richest-person-bloomberg/",
    "timestamp": "2025-09-10T18:32:52Z"
  },
  {
    "title": "Donald Trump responds after Russia fired drones into Poland’s airspace in major escalation",
    "description": "Donald Trump issued a simple but chilling statement as tensions with Russia escalate",
    "link": "https://www.ladbible.com/news/politics/donald-trump-putin-response-poland-drones-811951-20250910",
    "timestamp": "2025-09-10T18:31:45Z"
  },
  {
    "title": "Why Is “The Washington Post” Whitewashing Epstein’s Stomach-Churning Birthday Book?",
    "description": "Chris Lehmann\n\n\n\nIn their social circle, Trump and Epstein were so identified as predators that the pair trafficking young women would be instantly recognized as fodder for a joke.\r\n\n\r\n\n\nThe post Why Is “The Washington Post” Whitewashing Epstein’s Stomach-Chu…",
    "link": "https://www.thenation.com/article/politics/epstein-birthday-book-trump-washington-post/",
    "timestamp": "2025-09-10T18:31:16Z"
  },
  {
    "title": "Kash Patel Made Politically-Motivated Firings He Knew Were ‘Likely Illegal’ — 3 Former Top FBI Officials Allege in Bombshell Lawsuit",
    "description": "Three fired top FBI officials are claiming that FBI Director Kash Patel carried out politicized firings at the behest of President Donald Trump.\nThe post Kash Patel Made Politically-Motivated Firings He Knew Were ‘Likely Illegal’ — 3 Former Top FBI Officials …",
    "link": "https://www.mediaite.com/media/news/kash-patel-made-politically-motivated-firings-he-knew-were-likely-illegal-3-former-top-fbi-officials-allege-in-bombshell-lawsuit/",
    "timestamp": "2025-09-10T18:30:55Z"
  },
  {
    "title": "World Champion Swimmer Ends Olympic Career To Compete In Races that Allow Steroids",
    "description": "The athlete said the Donald Trump Jr.-financed Enhanced Games will serve his ambition “to be the fastest man on the planet.”",
    "link": "https://www.huffpost.com/entry/ben-proud-enhanced-games-steroids_n_68c19ce1e4b057cde4386ebb",
    "timestamp": "2025-09-10T18:29:39Z"
  },
  {
    "title": "Kash Patel Acknowledged Firing FBI Officials For Trump Was Unlawful—But Did It Anyway, Lawsuit Claims",
    "description": "“The FBI tried to put the President in jail and he hasn’t forgotten it,” Kash Patel allegedly said, claiming he’d be fired if he didn’t terminate officials who investigated Trump.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/09/10/kash-patel-acknowledged-firing-fbi-officials-for-trump-was-unlawful-but-did-it-anyway-lawsuit-claims/",
    "timestamp": "2025-09-10T18:28:54Z"
  },
  {
    "title": "Boston Mayor Michelle Wu takes victory lap after trouncing Josh Kraft in preliminary",
    "description": "Boston Mayor Michelle Wu took a victory lap after trouncing Josh Kraft by 48 points in the preliminary election, saying her sweep of every ward was indicative of voters feeling the city is moving in the right direction.",
    "link": "https://www.bostonherald.com/2025/09/10/boston-mayor-michelle-wu-takes-victory-lap-after-trouncing-josh-kraft-in-preliminary/",
    "timestamp": "2025-09-10T18:28:10Z"
  },
  {
    "title": "DeSantis’ court victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida",
    "description": "Florida may be forced to choose between forgoing federal reimbursement for the detention center or accepting the money and facing an environmental review that would risk shutting down the facility.",
    "link": "https://www.pbs.org/newshour/nation/desantis-court-victory-on-alligator-alcatraz-sets-up-a-funding-dilemma-for-florida",
    "timestamp": "2025-09-10T18:27:20Z"
  },
  {
    "title": "Trump Media Rolls Out ETFs That Could Benefit From The President’s Policies",
    "description": "The Truth Social-branded ETFs target sectors like defense, energy and real estate—industries shaped by decisions made in the White House.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/09/10/trump-media-etfs-truth-social-president/",
    "timestamp": "2025-09-10T18:27:03Z"
  },
  {
    "title": "Well done, India, for this entete-a-tete",
    "description": "Amidst escalating tensions and Trump's aggressive tactics, India has maintained a composed and dignified stance in its diplomatic relations with the US. Despite facing threats and bullying, India's government, led by Prime Minister Modi, has responded with co…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/well-done-india-for-this-entete-a-tete/articleshow/123815226.cms",
    "timestamp": "2025-09-10T18:25:35Z"
  },
  {
    "title": "NASA Rover Finds Mars Rocks That May Signal Ancient Life",
    "description": "NASA’s Perseverance rover on Mars stumbled upon rocks last year that scientists think may show signs that Mars once hosted microbial life. In a new paper published in Nature, researchers offer explanations for a group of Martian rocks that Perseverance uncove…",
    "link": "https://www.ndtvprofit.com/science/space-nasa-rover-finds-mars-rocks-that-may-signal-ancient-life",
    "timestamp": "2025-09-10T18:24:10Z"
  },
  {
    "title": "Understanding Israel’s attack on Qatar, and what it means for the region",
    "description": "Israel has sent a message that its impunity extends even to attacks on states that have close relations with Washington. They need only cry “HAMAS” and any act is acceptable.",
    "link": "https://mondoweiss.net/2025/09/understanding-israels-attack-on-qatar-and-what-it-means-for-the-region/",
    "timestamp": "2025-09-10T18:22:44Z"
  },
  {
    "title": "RFK Jr. Announces Major Changes for Drug Ads on TV",
    "description": "HHS and the FDA announced a major reform that requires drug companies to include full safety warnings in direct-to-consumer ads.",
    "link": "https://www.newsweek.com/rfk-jr-announces-major-changes-drug-ads-tv-2127850",
    "timestamp": "2025-09-10T18:21:05Z"
  },
  {
    "title": "What Kyla Scanlon Is Listening To",
    "description": "Popular economist Kyla Scanlon tells us about her podcast habits, which include ‘Philosophize This!’, ‘If Books Could Kill’, and more.",
    "link": "http://www.vulture.com/article/what-kyla-scanlon-is-listening-to.html",
    "timestamp": "2025-09-10T18:20:20Z"
  },
  {
    "title": "Ramaswamy endorses Winsome Earle-Sears for Virginia governor, rally planned next week in swing suburb",
    "description": "Vivek Ramaswamy will endorse Virginia Lt. Gov. Winsome Earle-Sears for governor at a September 19 rally in Chesterfield as she faces a close race against Abigail Spanberger.",
    "link": "https://www.foxnews.com/politics/vivek-ramaswamy-endorses-winsome-earle-sears-virginia-governor-rally-planned-next-week-swing-suburb",
    "timestamp": "2025-09-10T18:18:42Z"
  },
  {
    "title": "'Dream Hire': CBS News Eyes Conservative Firebrand Megyn Kelly as the New Face of the Network After $8Billion Takeover",
    "description": "The network is in the middle of major changes to its business structure after parent company Paramount's merger with Skydance media.",
    "link": "https://radaronline.com/p/cbs-news-conservative-megyn-kelly-network-8billion-takeover/",
    "timestamp": "2025-09-10T18:17:43Z"
  },
  {
    "title": "The Protocol: SwissBorg’s SOL Earn Wallet Exploited for $41.5M",
    "description": "Also: Ledger CTO Warns of NPM Exploit, Backpack EU opens, and Polygon PoS Chain Reports Finality Lag",
    "link": "https://www.coindesk.com/tech/2025/09/10/the-protocol-swissborg-s-sol-earn-wallet-exploited-for-usd41-5m",
    "timestamp": "2025-09-10T18:16:59Z"
  },
  {
    "title": "Democratic Strategist Admits ‘Super Progressive’ Staffers Actually Love Trump’s DC Crackdown: ‘Man, It’s Been Great!’",
    "description": "Dan Turrentine admitted that many progressive staffers who live in D.C. are privately supportive of Donald Trump's crackdown on crime in the nation's capital.\nThe post Democratic Strategist Admits ‘Super Progressive’ Staffers Actually Love Trump’s DC Crackdow…",
    "link": "https://www.mediaite.com/media/news/democratic-strategist-admits-super-progressive-staffers-actually-love-trumps-dc-crackdown-man-its-been-great/",
    "timestamp": "2025-09-10T18:15:55Z"
  },
  {
    "title": "'So many lies': Schumer ambushes GOP with surprise Epstein files amendment",
    "description": "Senate Minority Leader Chuck Schumer, D-N.Y., plans to force Republicans to vote on releasing \"Epstein files\" through an amendment to the annual defense authorization bill.",
    "link": "https://www.foxnews.com/politics/so-many-lies-schumer-ambushes-gop-surprise-epstein-files-amendment",
    "timestamp": "2025-09-10T18:15:49Z"
  },
  {
    "title": "Two Republicans join Dems to save Schumer's surprise push to force release of Epstein files",
    "description": "Sens. Josh Hawley, R-Mo., and Rand Paul, R-Ky., joined every Senate Democrat to stop a move to kill Senate Minority Leader Chuck Schumer's attempt to force the release of the \"Epstein files.\"",
    "link": "https://www.foxnews.com/politics/two-republicans-join-dems-schumers-surprise-push-force-release-epstein-files",
    "timestamp": "2025-09-10T18:15:49Z"
  },
  {
    "title": "U.S. Lawmakers Demand Trump Respond To Russia: Trump Posts Cryptic ‘Here We Go!’ After Poland Downs Drones",
    "description": "Multiple Republicans have called on the Trump administration to respond to Russia for firing drones into Polish airspace.",
    "link": "https://www.forbes.com/sites/saradorn/2025/09/10/us-lawmakers-demand-trump-respond-to-russia-trump-posts-cryptic-here-we-go-after-poland-downs-drones/",
    "timestamp": "2025-09-10T18:13:11Z"
  },
  {
    "title": "Who else appears in Jeffrey Epstein’s 50th birthday book?",
    "description": "The messages were compiled in 2003 and include greetings from Epstein's relatives, business executives and scientists.",
    "link": "https://www.pbs.org/newshour/nation/who-else-appears-in-jeffrey-epsteins-50th-birthday-book",
    "timestamp": "2025-09-10T18:12:59Z"
  },
  {
    "title": "Who Is the Richest Man in the World? Top Billionaires Ranked",
    "description": "Elon Musk's net worth once exceeded $400 billion following a surge in SpaceX's valuation in December 2024, but that changed. Here's a look at the world's richest people today, most of whom are men.",
    "link": "https://hollywoodlife.com/feature/who-is-the-worlds-richest-man-5353938/",
    "timestamp": "2025-09-10T18:12:39Z"
  },
  {
    "title": "Meeting the deportation quotas drags in ordinary people",
    "description": "That Trump is struggling to have his ICE goons meet the quota for detaining and deporting people (reportedly the target is about 3,000 people per day) is clear from the fact that they are now doing so for the most minor of offenses. An Irish grandmother who h…",
    "link": "https://freethoughtblogs.com/singham/2025/09/10/meeting-the-deportation-quotas-drags-in-ordinary-people/",
    "timestamp": "2025-09-10T18:12:27Z"
  },
  {
    "title": "Americans flood ICE with 141,000 job applications in Trump admin recruitment push",
    "description": "Trump administration's ICE recruitment drive yields 141,000 applications and 18,000 job offers, offering major perks including student loan forgiveness and retirement benefits.",
    "link": "https://www.foxnews.com/politics/americans-flood-ice-141000-job-applications-trump-admin-recruitment-push",
    "timestamp": "2025-09-10T18:11:41Z"
  },
  {
    "title": "Kavanaugh Flaunts the Fourth Amendment and Blesses Trump's Racial Profiling",
    "description": "The Supreme Court justice’s stance on immigration enforcement is undermined by the facts of the case before him.",
    "link": "https://reason.com/2025/09/11/kavanaugh-flaunts-the-fourth-amendment-and-blesses-trumps-racial-profiling/",
    "timestamp": "2025-09-10T18:10:09Z"
  },
  {
    "title": "The US government is 'looking at' the connection between videogames and gun violence, because what else could it possibly be",
    "description": "Robert F. Kennedy Jr., the secretary of health and human services, said there are \"many things\" that could explain the American problem with gun violence, but guns aren't one of them.",
    "link": "https://www.pcgamer.com/games/the-us-government-is-looking-at-the-connection-between-videogames-and-gun-violence-because-what-else-could-it-possibly-be/",
    "timestamp": "2025-09-10T18:09:47Z"
  },
  {
    "title": "Trump’s signature under new scrutiny thanks to the Epstein case",
    "description": "Donald Trump's signature is under scrutiny in a distinctly unpresidential matter. A House committee released Jeffrey Epstein's 50th birthday album, which includes two documents purportedly signed by Trump.",
    "link": "https://biztoc.com/x/5f31431b1b1af192",
    "timestamp": "2025-09-10T18:07:47Z"
  },
  {
    "title": "Nolte: Kamala Admits ‘Months of Growing Panic’ at White House over Biden’s Decline",
    "description": "Kamala Harris has admitted that she knew Joe Biden was not fit to run for reelection but said nothing, which amounts to covering it up.\nThe post Nolte: Kamala Admits ‘Months of Growing Panic’ at White House over Biden’s Decline appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/10/nolte-kamala-admits-months-growing-panic-white-house-over-bidens-decline/",
    "timestamp": "2025-09-10T18:07:17Z"
  },
  {
    "title": "Supreme Court said ICE can stop you based on race, accent, job and location. What we know.",
    "description": "A group of Latino California residents and related organizations sued the government, saying they were being subject to illegal stops.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/10/immigration-enforcement-stops-race-language-job/86048527007/",
    "timestamp": "2025-09-10T18:07:04Z"
  },
  {
    "title": "IAA: Why VW and other carmakers are changing their EV designs",
    "description": "Electric cars are supposed to be the future. So why are German carmakers now taking a page from past designs? Steven Beardsly reports from the IAA Mobility show in Munich. When Volkswagen chief designer Andreas Mindt looks at the electric ID.Polo, he sees a f…",
    "link": "https://www.dw.com/en/iaa-why-vw-and-other-carmakers-are-changing-their-ev-designs/a-73953751",
    "timestamp": "2025-09-10T18:06:00Z"
  },
  {
    "title": "Ways CMOs Can Use AI And Technology To Target Their Message",
    "description": "Also in the Forbes CMO newsletter: Measuring effectiveness matters, Nike asks why, Cracker Barrel stops renovations, Trump orders more transparency in drug ads.",
    "link": "https://www.forbes.com/sites/cmo/2025/09/10/ways-cmos-can-use-ai-and-technology-to-target-their-message/",
    "timestamp": "2025-09-10T18:05:37Z"
  },
  {
    "title": "Texas A&M professor fired after video shows classroom confrontation over gender identity coursework",
    "description": "A professor at Texas A&M University was fired and others were removed from their positions after a video surfaced in which a student confronted the...",
    "link": "https://www.yahoo.com/news/articles/texas-m-professor-fired-video-180403231.html",
    "timestamp": "2025-09-10T18:04:03Z"
  },
  {
    "title": "‘Delete this after you read it’: Fauci told colleagues to destroy federal records, then denied it under oath",
    "description": "Rand Paul: 'The coverup began while the virus was barely on America's radar'",
    "link": "https://www.wnd.com/2025/09/delete-this-after-you-read-it-fauci-told/",
    "timestamp": "2025-09-10T18:03:09Z"
  },
  {
    "title": "Trump’s tariffs could push nearly 1 million Americans into poverty, report finds | CNN Business",
    "description": "President Donald Trump’s sweeping tariff regime is already reshaping global trade and spiking government customs revenue. But these historic import taxes could also push more Americans into poverty, according to new research.",
    "link": "https://www.cnn.com/2025/09/10/business/trump-trade-prices-poverty-report",
    "timestamp": "2025-09-10T18:02:20Z"
  },
  {
    "title": "Schumer says GOP plan to avert shutdown \"not good enough to get our votes\"",
    "description": "Republicans and Democrats are still far apart on how to avert a government shutdown just three weeks before funding runs out.",
    "link": "https://www.cbsnews.com/news/chuck-schumer-gop-plan-to-avert-shutdown-2025/",
    "timestamp": "2025-09-10T18:01:53Z"
  },
  {
    "title": "India is in \"active dialogue\" with the US on trade deal: Piyush Goyal",
    "description": "India is actively engaged in trade negotiations with the US, aiming for a mutually beneficial agreement, according to Commerce Minister Piyush Goyal. Discussions are also underway with New Zealand and the European Union, with a trade pact with Oman expected s…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-is-in-active-dialogue-with-the-us-on-trade-deal-piyush-goyal/articleshow/123814690.cms",
    "timestamp": "2025-09-10T18:01:19Z"
  },
  {
    "title": "Exclusive: NIH Pledges Not to Renew 17 Grants for Research Using Aborted Human Fetal Tissue",
    "description": "The National Institutes of Health (NIH) said it will not renew more than a dozen grants for research involving human fetal tissue after Breitbart News reported on a government watchdog investigation about the taxpayer-funded experiments.\nThe post Exclusive: N…",
    "link": "https://www.breitbart.com/politics/2025/09/10/exclusive-nih-pledges-not-to-renew-17-grants-for-research-using-aborted-human-fetal-tissue/",
    "timestamp": "2025-09-10T18:00:55Z"
  },
  {
    "title": "Analysis-EU-US policy divide on Russian oil sales to India to hit October trade",
    "description": "LONDON/BRUSSELS/NEW DELHI (Reuters) -The growing policy divide between the United States and the European Union on Russian oil exports to India is likely to ...",
    "link": "https://finance.yahoo.com/news/analysis-eu-us-policy-divide-180037348.html",
    "timestamp": "2025-09-10T18:00:37Z"
  },
  {
    "title": "Trump Appeals Judge’s Decision to Keep Fed Governor Lisa Cook in Her Job",
    "description": "President Donald Trump's legal team has filed an appeal of a judge's ruling tha keeps Federal Reserve Governor Lisa Cook in her position after the commander in chief fired her last month.\nThe post Trump Appeals Judge’s Decision to Keep Fed Governor Lisa Cook …",
    "link": "https://www.mediaite.com/media/news/trump-appeals-judges-decision-to-keep-fed-governor-lisa-cook-in-her-job/",
    "timestamp": "2025-09-10T18:00:13Z"
  },
  {
    "title": "Fox News Has Big New Role For Peter Doocy",
    "description": "Fox News announced on Wednesday that Fox News White House correspondent Peter Doocy will co-anchor a new weekend program every other Sunday.",
    "link": "https://dailycaller.com/2025/09/10/fox-news-peter-doocy-sunday-show/",
    "timestamp": "2025-09-10T18:00:08Z"
  },
  {
    "title": "3 Crises Facing the Labor Movement",
    "description": "The slogan \"Organize or Die\" has become uncomfortably relevant.",
    "link": "https://inthesetimes.com/article/labor-unions-strikes-trump-nlrb-crisis",
    "timestamp": "2025-09-10T18:00:00Z"
  },
  {
    "title": "Exciting new research shows ways to defuse the \"green backlash\"",
    "description": "There is growing opposition to environmental policies around the world, but could researchers have found a way around this, asks Graham Lawton",
    "link": "https://www.newscientist.com/article/mg26735600-100-exciting-new-research-shows-ways-to-defuse-the-green-backlash/",
    "timestamp": "2025-09-10T18:00:00Z"
  },
  {
    "title": "Poland says it shot down Russian drones in its airspace",
    "description": "Poland shot down Russian drones with the help of its NATO allies’ military aircraft, it said Wednesday, marking a notable escalation in the tension between Russia and NATO countries since Russia’s war on Ukraine began in 2022",
    "link": "https://www.msnbc.com/top-stories/latest/poland-russian-drones-shot-down-airspace-rcna230354",
    "timestamp": "2025-09-10T17:59:44Z"
  },
  {
    "title": "Rubio spoke Wednesday with China’s Wang Yi, State Department says",
    "description": "WASHINGTON: US Secretary of State Marco Rubio spoke on Wednesday (Sep 10) with Chinese Foreign Minister Wang Yi on global and regional issues, in a follow-up to the meeting th",
    "link": "https://www.channelnewsasia.com/asia/rubio-spoke-wednesday-chinas-wang-yi-state-department-says-5342721",
    "timestamp": "2025-09-10T17:59:19Z"
  },
  {
    "title": "Hegseth tells China in first call that US is not seeking conflict",
    "description": "WASHINGTON: United States Defence Secretary Pete Hegseth held his first conversation with his Chinese counterpart and stressed that the US does not seek conflict with China, but will protect its vital interests in the Asia-Pacific region, the Pentagon said on…",
    "link": "https://www.channelnewsasia.com/world/hegseth-us-defence-china-first-call-not-seeking-conflict-5342721",
    "timestamp": "2025-09-10T17:59:00Z"
  },
  {
    "title": "Princeton researcher Elizabeth Tsurkov freed in Iraq",
    "description": "Princeton researcher Elizabeth Tsurkov, who was kidnapped by Iranian-backed militia Kataib Hezbollah in March 2023 and holds Israeli and Russian citizenship, was freed in Iraq on September 9, according to President Donald Trump. The Iraqi Prime Minister’s Off…",
    "link": "https://www.longwarjournal.org/archives/2025/09/princeton-researcher-elizabeth-tsurkov-freed-in-iraq.php",
    "timestamp": "2025-09-10T17:58:52Z"
  },
  {
    "title": "3 fired FBI officials sue Patel, saying he bowed to Trump administration's 'campaign of retribution'",
    "description": "Three fired FBI officials have sued to get their jobs back, calling their terminations part of a “campaign of retribution” carried out by a director who caved to political pressure from the Trump administration",
    "link": "https://abcnews.go.com/US/wireStory/3-fired-fbi-officials-sue-patel-bowed-trump-125447573",
    "timestamp": "2025-09-10T17:58:27Z"
  },
  {
    "title": "Mexico to raise tariffs on cars from China to 50% in major overhaul",
    "description": "Mexico said on Wednesday it will raise tariffs on automobiles from China and other Asian countries to 50%, in a broad overhaul of import levies the...",
    "link": "https://ca.finance.yahoo.com/news/mexico-raise-tariffs-cars-china-175658467.html",
    "timestamp": "2025-09-10T17:56:58Z"
  },
  {
    "title": "Trump’s signature under new scrutiny thanks to the Epstein case",
    "description": "Donald Trump's signature is under scrutiny in a distinctly unpresidential matter. A House committee released Jeffrey Epstein's 50th birthday album, which includes two documents purportedly signed by Trump.",
    "link": "https://www.pbs.org/newshour/politics/trumps-signature-under-new-scrutiny-thanks-to-the-epstein-case",
    "timestamp": "2025-09-10T17:56:57Z"
  },
  {
    "title": "NC Republicans lay into Dems over Charlotte murder, crime policies: 'She died because of our complacency'",
    "description": "North Carolina Republicans blamed Democrats' policies for the murder of Ukrainian refugee Iryna Zarutska in Charlotte, calling for justice system reforms.",
    "link": "https://www.foxnews.com/politics/nc-republicans-lay-dems-over-charlotte-murder-crime-policies-she-died-because-our-complacency",
    "timestamp": "2025-09-10T17:56:57Z"
  },
  {
    "title": "Barron Trump not headed back to New York this fall, reports say. What we know",
    "description": "Barron Trump appears to be missing from NYU's New York campus this fall. Reports say he is doing a semester elsewhere. Here is what we know.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/10/barron-trump-nyu/86072683007/",
    "timestamp": "2025-09-10T17:55:20Z"
  },
  {
    "title": "‘You’re Lap Dogs to the President!’ House Committee Devolves Into Chaos Over Trump Sending Troops to Fight Crime",
    "description": "A committee meeting spiraled into chaos Wednesday when a House Democrat called the Republicans in attendance \"lap dogs\" to President Donald Trump.\nThe post ‘You’re Lap Dogs to the President!’ House Committee Devolves Into Chaos Over Trump Sending Troops to Fi…",
    "link": "https://www.mediaite.com/politics/youre-lap-dogs-to-the-president-house-committee-devolves-into-chaos-over-trump-sending-troops-to-fight-crime/",
    "timestamp": "2025-09-10T17:53:54Z"
  },
  {
    "title": "Fox News announces revamped weekend lineup highlighting ‘commitment to delivering incomparable coverage’",
    "description": "Fox News will debut a new weekend programming lineup beginning Saturday, Sept. 20, FOX News Media President & Editor-in-Chief Jay Wallace announced.",
    "link": "https://www.foxnews.com/media/fox-news-channel-announces-revamped-weekend-lineup",
    "timestamp": "2025-09-10T17:53:16Z"
  },
  {
    "title": "Jimmy Kimmel says he’s not defending democracy. But he’s standing up for fellow Emmy nominee Colbert",
    "description": "“I don’t really feel like I’m defending democracy.”",
    "link": "https://www.bostonherald.com/2025/09/10/emmys-jimmy-kimmel/",
    "timestamp": "2025-09-10T17:52:23Z"
  },
  {
    "title": "MSNBC’s Jen Psaki Roasts Republicans Swallowing Trump’s ‘Ludicrous’ Epstein Denial",
    "description": "Jen Psaki roasted Republicans who cosigned Trump's \"ludicrous\" denial he wrote the newly-released birthday letter to deceased sex criminal Jeffrey Epstein.\nThe post MSNBC’s Jen Psaki Roasts Republicans Swallowing Trump’s ‘Ludicrous’ Epstein Denial first appea…",
    "link": "https://www.mediaite.com/media/news/msnbcs-jen-psaki-roasts-republicans-swallowing-trumps-ludicrous-epstein-denial/",
    "timestamp": "2025-09-10T17:49:57Z"
  },
  {
    "title": "Kamala Harris Is Still In Complete Denial",
    "description": "Harris wrote in her new book that there was no \"conspiracy\" to hide Biden's age, and insisted that the he was still sharp in his final days in the White House.",
    "link": "https://dailycaller.com/2025/09/10/kamala-harris-white-house-joe-biden-age-coverup-debate/",
    "timestamp": "2025-09-10T17:49:51Z"
  },
  {
    "title": "The Nobel with a knobbly history",
    "description": "The Nobel Peace Prize faces scrutiny. Donald Trump's pursuit and past winners like Henry Kissinger raise questions. Barack Obama's early award also sparks debate. Figures like Mother Teresa and Nelson Mandela are recipients. Vladimir Putin is not a winner yet…",
    "link": "https://economictimes.indiatimes.com/opinion/just-in-jest/the-nobel-with-a-knobbly-history/articleshow/123814478.cms",
    "timestamp": "2025-09-10T17:49:47Z"
  },
  {
    "title": "Trump responds after NATO forces shoot down Russian drones in Polish airspace",
    "description": "Poland said there 19 Russian drones entered its airspace early on Wednesday. After the drones were shot down with NATO assistance, leaders across Europe...",
    "link": "https://www.deseret.com/u-s-world/2025/09/10/russian-drones-shot-down-over-poland/",
    "timestamp": "2025-09-10T17:49:19Z"
  },
  {
    "title": "Former FBI Officials Allege Trump Ordered Kash Patel To Fire Them In New Lawsuit (Alison Durkee/Associated Press)",
    "description": "Alison Durkee / Associated Press:\nFormer FBI Officials Allege Trump Ordered Kash Patel To Fire Them In New Lawsuit  —  Topline  —  Former high-ranking FBI officials sued the bureau and director Kash Patel on Wednesday, alleging they were unlawfully terminated…",
    "link": "https://www.memeorandum.com/250910/p86",
    "timestamp": "2025-09-10T17:45:01Z"
  },
  {
    "title": "Watch | ‘Hitler of our time’: Trump jeered by protesters as he dines at restaurant near White House",
    "description": "Secret Service agents then escorted the protesters, who waved Palestinian flags, out of the restaurant as other diners booed or chanted “U-S-A! U-S-A!”",
    "link": "https://indianexpress.com/article/world/hitler-of-our-time-trump-jeered-by-protesters-as-he-dines-at-restaurant-near-white-house-10242519/",
    "timestamp": "2025-09-10T17:44:41Z"
  },
  {
    "title": "Alleged Attempted Trump Assassin Complains He Doesn’t Have Enough Black People On Jury",
    "description": "FORT PIERCE, Fla. — Ryan Routh, the man on trial for allegedly attempting to assassinate President Donald Trump, accused federal prosecutors on Wednesday of making a “racist” choice during jury selection. Twelve jurors and four alternates were picked before b…",
    "link": "https://dailycaller.com/2025/09/10/alleged-attempted-trump-assassin-complains-he-doesnt-have-enough-black-people-on-jury/",
    "timestamp": "2025-09-10T17:44:00Z"
  },
  {
    "title": "Dems dig in as GOP prepares to go nuclear in Trump nominee race",
    "description": "Senate Majority Leader John Thune, R-S.D., teed up 48 nominees as part of a first batch of President Donald Trump's picks for the impending nuclear vote.",
    "link": "https://www.foxnews.com/politics/dems-dig-gop-prepares-go-nuclear-trump-nominee-race",
    "timestamp": "2025-09-10T17:43:41Z"
  },
  {
    "title": "'We will depose Trump': President may have to explain 'ugly history with Epstein' in court",
    "description": "Donald Trump is threatening a conservative critic, but the president might see the tables get turned on him.Ex-GOP strategist Rick Wilson on Wednesday published an article on Substack called, \"Trump Is Threatening to Sue Me. Again,\" in which the conservative …",
    "link": "https://www.rawstory.com/rick-wilson-will-depose-trump/",
    "timestamp": "2025-09-10T17:43:30Z"
  },
  {
    "title": "Over 40% of arrests in Trump’s DC law enforcement surge relate to immigration, AP analysis finds",
    "description": "Trump has portrayed the operation as focused on crime.",
    "link": "https://www.bostonherald.com/2025/09/10/trump-dc-immigration-arrests/",
    "timestamp": "2025-09-10T17:42:28Z"
  },
  {
    "title": "Harris: Biden 2024 decision shouldn't have been \"left to an individual's ego\"",
    "description": "Former Vice President Kamala Harris' book, \"107 Days,\" will detail her sprint of a race for the presidency.",
    "link": "https://www.cbsnews.com/news/kamala-harris-joe-biden-2024-election-decision-book-excerpt/",
    "timestamp": "2025-09-10T17:38:30Z"
  },
  {
    "title": "Russian drones unite fractured Poland’s leadership — for now",
    "description": "Poland's normal political warfare went still after warplanes shot down Russian drones.",
    "link": "https://www.politico.eu/article/russia-drone-poland-leadership-karol-nawrocki-donald-tusk-foreign-policy-defense/",
    "timestamp": "2025-09-10T17:36:51Z"
  },
  {
    "title": "Trump meets with hostage's families and captivity survivors",
    "description": "President Trump reiterated his commitment to releasing all the hostages and reassured the families that his administration is working very hard and that they will get them out.",
    "link": "https://www.israelnationalnews.com/news/414725",
    "timestamp": "2025-09-10T17:36:49Z"
  },
  {
    "title": "Musk loses crown as world's richest to software giant Larry Ellison in new Bloomberg ranking",
    "description": "Oracle co-founder Larry Ellison wrested the title of the world’s richest man from longtime holder Elon Musk early Wednesday as stock in his software giant rocketed more than a third in a stunning few minutes of trading. That is according to wealth tracker Blo…",
    "link": "https://apnews.com/article/richest-billionaires-musk-ellison-oracle-tesla-bloomberg-forbes-e90a3cab2a0b256923ca55814893f9fe",
    "timestamp": "2025-09-10T17:36:24Z"
  },
  {
    "title": "Fired FBI officials sue Patel, claiming he bowed to Trump’s ‘campaign of retribution’",
    "description": "Three fired FBI officials have sued to get their jobs back, calling their terminations part of a “campaign of retribution” carried out by a director who caved to political pressure from the Trump administration.",
    "link": "https://www.pbs.org/newshour/politics/fired-fbi-officials-sue-patel-claiming-he-bowed-to-trumps-campaign-of-retribution",
    "timestamp": "2025-09-10T17:35:52Z"
  },
  {
    "title": "Sen. Chuck Schumer to force Senate vote compelling DOJ to release Epstein files",
    "description": "In a surprise move, Senate Minority Leader Chuck Schumer, D-N.Y., on Wednesday moved to force a floor vote to compel the Justice Department to release all of its records related to the Jeffrey Epstein case.",
    "link": "https://www.nbcnews.com/politics/congress/schumer-epstein-senate-vote-rcna230389",
    "timestamp": "2025-09-10T17:35:16Z"
  },
  {
    "title": "WATCH: Senate committee approves Stephen Miran’s nomination for Federal Reserve governor",
    "description": "The White House has pushed for an expedited Senate approval of Miran, who was nominated by President Donald Trump to replace former Fed governor Adriana Kugler.",
    "link": "https://biztoc.com/x/b830c855d20cc691",
    "timestamp": "2025-09-10T17:34:25Z"
  },
  {
    "title": "NATO scrambles jets to shoot down Russian drones in Poland, raising fears of war spillover",
    "description": "Russian drones entered Poland, a NATO member. This raised concerns about war spreading. NATO responded by deploying fighter jets. Poland recorded multiple airspace violations. Some drones came from Belarus. NATO held urgent discussions. European leaders expre…",
    "link": "https://economictimes.indiatimes.com/news/defence/nato-scrambles-jets-to-shoot-down-russian-drones-in-poland-raising-fears-of-war-spillover/articleshow/123814112.cms",
    "timestamp": "2025-09-10T17:31:16Z"
  },
  {
    "title": "Japan's JERA inks LNG offtake from Alaska's $44 billion export project",
    "description": "Energy developer Glenfarne will supply Japan’s biggest power generator, JERA, with one million metric tons of LNG annually for 20 years, an advance for the $44 billion Alaska LNG project that has attracted doubts because of its high costs.Glenfarne is targeti…",
    "link": "https://www.channelnewsasia.com/business/japans-jera-inks-lng-offtake-alaskas-44-billion-export-project-5342901",
    "timestamp": "2025-09-10T17:30:43Z"
  },
  {
    "title": "Trump Criticizes Israel’s Attack On Qatar",
    "description": "United States President Donald Trump has criticized Israel's attack on a Hamas compound in Qatar. Trump said Israel's decision was \"unilateral\" and had nothing to do with the U.S.",
    "link": "https://www.shtfplan.com/headline-news/trump-criticizes-israels-attack-on-qatar",
    "timestamp": "2025-09-10T17:30:04Z"
  },
  {
    "title": "Bitcoin-Heavy Balance Sheets Are Risky Bet for Treasurers and CFOs",
    "description": "Back in 2021, PYMNTS Intelligence examined cryptocurrency as corporates mulled how the digital holdings might transform their operations. More than half of multinational enterprises were already using at least one type of crypto for nascent payment purposes a…",
    "link": "http://www.pymnts.com/cryptocurrency/2025/bitcoin-heavy-balance-sheets-are-risky-bet-treasurers-cfos/",
    "timestamp": "2025-09-10T17:30:01Z"
  },
  {
    "title": "White House wants to undo Washington D.C. spending cap inadvertently passed by Congress",
    "description": "The budget fix seems to be coming as President Trump has made nice with D.C. Mayor Bowser after she signed an order to continue cooperation with federal law ...",
    "link": "https://www.deseret.com/politics/2025/09/10/white-house-wants-to-fix-dc-budget-mistake/",
    "timestamp": "2025-09-10T17:28:17Z"
  },
  {
    "title": "Trump responds to Russian drone incursion over Poland: ‘Here we go!’",
    "description": "President Trump has put out a cryptic response to news overnight that Russian drones have been shot down over Polish territory.",
    "link": "https://nypost.com/2025/09/10/us-news/trump-responds-to-russian-drone-incursion-over-poland-here-we-go/",
    "timestamp": "2025-09-10T17:28:11Z"
  },
  {
    "title": "Kilmar Abrego Garcia wants asylum. The US wants to deport him. What to know",
    "description": "Either path could mean a long journey through the legal system.",
    "link": "https://www.bostonherald.com/2025/09/10/deportation-error-what-to-know/",
    "timestamp": "2025-09-10T17:28:01Z"
  },
  {
    "title": "Michigan dismissal highlights the challenges in prosecuting cases against Trump’s 2020 fake electors",
    "description": "A legal expert noted the cases involve unprecedented acts the legal system has never dealt with.",
    "link": "https://www.bostonherald.com/2025/09/10/trump-fake-electors/",
    "timestamp": "2025-09-10T17:27:56Z"
  },
  {
    "title": "NASA blocks Chinese citizens with US visas from working on space programs",
    "description": "Amidst escalating tensions and a renewed space race with China, NASA has restricted access for Chinese nationals with US visas to its facilities, data systems, and meetings. This move aims to safeguard the agency's work and ensure American leadership in space…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/nasa-blocks-chinese-citizens-with-us-visas-from-working-on-space-programs/articleshow/123813980.cms",
    "timestamp": "2025-09-10T17:27:27Z"
  },
  {
    "title": "Trump Calls for 'Quick' Death Penalty for Murderer of Iryna Zarutska: 'There Can Be No Other Option'",
    "description": "President Trump says the killer of a Ukrainian woman should get a “'Quick' (there is no doubt!) Trial, and only awarded THE DEATH PENALTY\"",
    "link": "https://www.westernjournal.com/trump-calls-quick-death-penalty-murderer-iryna-zarutska-can-no-option/",
    "timestamp": "2025-09-10T17:27:26Z"
  },
  {
    "title": "Federal judge shocked after an arrested DC man seemed to disappear in the system",
    "description": "A magistrate judge in Washington, D.C., was compelled to order the U.S. Marshal Service and D.C. Bureau of Prisons to defend themselves in court after they appeared to have lost a defendant in the system. Reuters court reporter Brad Heath uncovered a seemingl…",
    "link": "https://www.rawstory.com/dc-courts-dc-man-disappeared/",
    "timestamp": "2025-09-10T17:26:44Z"
  },
  {
    "title": "US watchdog launches review into official data collection",
    "description": "The move follows White House criticism of the Bueau of Labor Statistics.",
    "link": "https://www.bbc.com/news/articles/cq5jgz75le7o",
    "timestamp": "2025-09-10T17:24:53Z"
  },
  {
    "title": "Southern Sleeping Giant Awakens, Spelling Doom For Democrats",
    "description": "The South, once a sleeping giant that lived in the shadows of places like New York City, is ushering in an era of politics that may trouble Democrats for years.",
    "link": "https://dailycaller.com/2025/09/10/the-south-economy-building-boom-electoral-college-blue-states-democrats-losing-message/",
    "timestamp": "2025-09-10T17:23:33Z"
  },
  {
    "title": "'Here We Go!': Trump On Russian Drones Violating NATO Ally's Airspace",
    "description": "Following an unprecedented violation of Polish airspace by Russian drones, President Donald Trump has issued his first public reaction, signaling a significant escalation in the ongoing war between Russia and Ukraine.",
    "link": "https://www.ndtvprofit.com/world/here-we-go-trump-on-russian-drones-violating-nato-allys-airspace",
    "timestamp": "2025-09-10T17:23:32Z"
  },
  {
    "title": "Martian rocks offer clues that might indicate ancient life",
    "description": "Colorful, speckled rocks found on the surface of Mars have offered among the most encouraging evidence yet of ancient life on our neighboring planet, scientists at NASA announced Wednesday. The Perseverance Mars rover collected the “Sapphire Canyon” rock samp…",
    "link": "https://www.digitaljournal.com/world/martian-rocks-offer-clues-that-might-indicate-ancient-life/article",
    "timestamp": "2025-09-10T17:22:20Z"
  },
  {
    "title": "US Senator Cruz proposes AI 'sandbox' to ease regulations on tech companies",
    "description": "Cruz leads the Senate Commerce Committee, which is scheduled to hold a subcommittee hearing on Wednesday about ways Congress can lower regulatory hurdles for the tech industry to give US companies a boost in competing with China.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-senator-cruz-proposes-ai-sandbox-to-ease-regulations-on-tech-companies/articleshow/123813875.cms",
    "timestamp": "2025-09-10T17:22:03Z"
  },
  {
    "title": "Kennedys at war as RFK Jr’s sister and nephew call for him to resign as health secretary - NewsBreak",
    "description": "Robert F. Kennedy Jr. ’s sister and nephew have urged the Health and Human Services secretary to resign, denouncing his anti-vaxxer views and the “decimati",
    "link": "https://www.newsbreak.com/share/4220441986230-kennedys-at-war-as-rfk-jr-s-sister-and-nephew-call-for-him-to-resign-as-health-secretary?s=a2&amp;share_destination_id=MjU2MDAwNTI0LTE3NTc1MjQ4MTY2OTI%3D&amp;pd=0HK9QiTg&amp;hl=en_US&amp;send_time=1757524816&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.33.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control",
    "timestamp": "2025-09-10T17:22:00Z"
  },
  {
    "title": "Trump calls out Russia for 'violating' Poland's airspace with drones",
    "description": "Polish and NATO forces shot down a number of drones overnight after it identified numerous violations.",
    "link": "https://www.thejournal.ie/trump-russia-poland-airspace-drones-6813286-Sep2025/",
    "timestamp": "2025-09-10T17:21:30Z"
  },
  {
    "title": "Martian Rocks Offer Clues That Might Indicate Ancient Life",
    "description": "Colorful, speckled rocks found on the surface of Mars have offered among the most encouraging evidence yet of ancient life on our neighboring planet, scientists at NASA announced Wednesday.",
    "link": "https://www.ibtimes.com/martian-rocks-offer-clues-that-might-indicate-ancient-life-3783033",
    "timestamp": "2025-09-10T17:21:05Z"
  }
]