[
  {
    "title": "Harvard Won Its Money Back, but Will It Actually Get It? - The New York Times",
    "description": "Harvard Won Its Money Back, but Will It Actually Get It?The New York Times Judge in Harvard case calls Justice Gorsuch’s comments ‘unhelpful and unnecessary’MSNBC News Harvard scientists laud federal court ruling in war with Trump administrationThe Boston Glo…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179010884",
    "timestamp": "2025-09-04T22:53:12Z"
  },
  {
    "title": "US obliteration of Caribbean boat was a clear violation of international ‘right to life’ laws – no matter who was on board",
    "description": "An expert in international law explains that the Trump administration’s justification for deadly strike doesn’t hold water.",
    "link": "https://theconversation.com/us-obliteration-of-caribbean-boat-was-a-clear-violation-of-international-right-to-life-laws-no-matter-who-was-on-board-264568",
    "timestamp": "2025-09-04T22:51:14Z"
  },
  {
    "title": "Trump’s DC crime operation ‘puts safety of families first’ as arrests surge past 1,800: FBI director",
    "description": "Trump's \"Make DC Safe Again\" operation reports over 1,800 arrests and dozens of weapons recently seized while facing legal challenge over National Guard deployment in Washington.",
    "link": "https://www.foxnews.com/politics/trumps-dc-crime-operation-puts-safety-families-first-arrests-surge-past-1800-fbi-director",
    "timestamp": "2025-09-04T22:50:18Z"
  },
  {
    "title": "Thursday, September 4. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,289.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/09/04/thursday-september-4-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-09-04T22:47:36Z"
  },
  {
    "title": "Newsom: Trump Troop ‘Stunt’ Cost Taxpayers Nearly $120 Million",
    "description": "The California governor called President Donald Trump’s costly deployment of troops to Los Angeles “waste, fraud and abuse.”",
    "link": "https://www.kqed.org/news/12054700/newsom-trump-troop-stunt-cost-taxpayers-nearly-120-million",
    "timestamp": "2025-09-04T22:47:26Z"
  },
  {
    "title": "School changing ‘Thunderbirds’ to ‘T-Birds’ to comply with NY ban on Native American team names",
    "description": "A suburban New York school district has agreed to change its “Thunderbirds” nickname to simply the “T-Birds” in order to comply with the state’s mandate to retire all Native American sports names and mascots",
    "link": "https://abcnews.go.com/US/wireStory/school-changing-thunderbirds-birds-comply-ny-ban-native-125273579",
    "timestamp": "2025-09-04T22:46:26Z"
  },
  {
    "title": "Trump signs executive order implementing U.S.-Japan trade agreement",
    "description": "WASHINGTON, Sept. 4 (Xinhua) -- U.S. President Donald Trump signed an executive order on Thursday implementing the U.S.-Japan trade agreement, the White House said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/05/trump-signs-executive-order-implementing-us-japan-trade-agreement",
    "timestamp": "2025-09-04T22:46:00Z"
  },
  {
    "title": "Mamdani dares Trump to public debate",
    "description": "New York City mayoral frontrunner Zohran Mamdani challenged United States President Donald Trump to a public debate in an interview with the New York Post.\n\"Let's cut out the middle man,&rdq...",
    "link": "https://biztoc.com/x/b87ca06ee1f86df6",
    "timestamp": "2025-09-04T22:44:31Z"
  },
  {
    "title": "'Cruelty': US Appeals Court Blocks Order to Shut Down Alligator Alcatraz",
    "description": "Two judges appointed to the US Court of Appeals for the 11th Circuit by President Donald Trump issued a Thursday decision that allows a newly established but already notorious immigrant detention center in Florida, dubbed Alligator Alcatraz, to stay open.Frie…",
    "link": "https://www.commondreams.org/news/florida-alligator-alcatraz",
    "timestamp": "2025-09-04T22:43:26Z"
  },
  {
    "title": "'Sparse': Steve Bannon's speech raises eyebrows — for the turnout",
    "description": "Longtime President Donald Trump ally and far-right strategist Steve Bannon gave a fiery speech at this year's National Conservatism Conference in Washington, D.C. — but he did so to a crowd of mostly empty seats.\"Sparse turnout for Steve Bannon at his just-co…",
    "link": "https://www.rawstory.com/bannon-2673962061/",
    "timestamp": "2025-09-04T22:43:19Z"
  },
  {
    "title": "US files lawsuit against California utility over Los Angeles wildfires",
    "description": "The Department of Justice alleges that negligence by Southern California Edison sparked deadly Eaton Fire in January.",
    "link": "https://www.aljazeera.com/news/2025/9/4/us-files-lawsuit-against-california-utility-over-los-angeles-wildfires",
    "timestamp": "2025-09-04T22:42:55Z"
  },
  {
    "title": "Analysis: BOE supplies over 40M OLED panels for iPhone, testing supply chain management",
    "description": "For Apple CEO Tim Cook, returning to the White House in early August 2025 and announcing a US$600 billion investment plan over the next four years was a strategic move that pleased President Donald Trump. Trump responded by stating that any production or fact…",
    "link": "https://www.digitimes.com/news/a20250901PD227/apple-iphone-boe-oled-panel-supply-chain.html",
    "timestamp": "2025-09-04T22:39:21Z"
  },
  {
    "title": "Trump signs order to lower US tariffs on Japan autos to 15%",
    "description": "The lower tariffs on autos are set to take effect seven days after publication of the order.",
    "link": "https://www.channelnewsasia.com/world/trump-tariffs-japan-autos-cars-5333491",
    "timestamp": "2025-09-04T22:39:00Z"
  },
  {
    "title": "Kraken Acquires Breakout to Enable Leveraged Bitcoin Trading With Funded Accounts",
    "description": "The exchange bought the proprietary trading platform for an undisclosed amount.",
    "link": "https://decrypt.co/338169/kraken-acquires-breakout-leveraged-bitcoin-trading-funded",
    "timestamp": "2025-09-04T22:37:59Z"
  },
  {
    "title": "Trump-backed plan to redraw Missouri congressional districts draws opposition at first hearing",
    "description": "Some rural residents said they didn't want to be combined with Kansas City.",
    "link": "https://www.bostonherald.com/2025/09/04/election-2026-redistricting-missouri/",
    "timestamp": "2025-09-04T22:36:39Z"
  },
  {
    "title": "Trump's lawyers just inadvertently admitted that his tariffs are illegal (Ian Millhiser/Vox)",
    "description": "Ian Millhiser / Vox:\nTrump's lawyers just inadvertently admitted that his tariffs are illegal  —  Oops. … The Trump administration formally asked the Supreme Court on Wednesday evening to decide whether President Donald Trump's ever-shifting tariff policy is …",
    "link": "https://www.memeorandum.com/250904/p120",
    "timestamp": "2025-09-04T22:35:00Z"
  },
  {
    "title": "Sydney Sweeney Won’t Address American Eagle Controversy During Promo for New Movie",
    "description": "Sydney Sweeney says she will not discuss American Eagle ad controversy during promo for 'Christy' at the Toronto International Film Festival.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/sydney-sweeney-american-eagle-ad-controversy-christy-promo-1235421873/",
    "timestamp": "2025-09-04T22:34:13Z"
  },
  {
    "title": "Trump to sign executive order renaming Pentagon the Department of War | CNN Politics",
    "description": "President Donald Trump is expected to sign an executive order on Friday that will rename the Defense Department to the Department of War, a White House official tells CNN.",
    "link": "https://www.cnn.com/2025/09/04/politics/department-of-war-trump-executive-order",
    "timestamp": "2025-09-04T22:33:33Z"
  },
  {
    "title": "Can Trump send National Guard troops to Chicago?",
    "description": "Trump has said \"we're going in\", when asked about sending National Guard troops to Chicago, but does he have the power to do this?",
    "link": "https://www.bbc.com/news/videos/c8rvxzkjrr0o",
    "timestamp": "2025-09-04T22:32:51Z"
  },
  {
    "title": "Ayotte says $500M in federal funds available for rural health care in NH",
    "description": "A plan is being made to boost rural hospitals and health care in New Hampshire in the wake of major cuts to Medicaid in the federal budget.",
    "link": "https://www.wmur.com/article/ayotte-rural-health-care-new-hampshire-9425/65986205",
    "timestamp": "2025-09-04T22:31:59Z"
  },
  {
    "title": "Mounjaro: Less than half of England has NHS access to jab months after roll-out, distressing patients and GPs",
    "description": "Less than half of England has access to tirzepatide (Mounjaro) through general practices, despite the NHS roll-out of the weight-loss jab having officially started over two months ago, The BMJ can disclose.\n\nJust 18 of 42 commissioning bodies across the count…",
    "link": "https://www.bmj.com/content/390/bmj.r1855",
    "timestamp": "2025-09-04T22:30:53Z"
  },
  {
    "title": "After unexpected resignation, former Roanoke US Attorney Gilbert has new job",
    "description": "Todd Gilbert was hired this week as senior assistant commonwealth's attorney for Page County.",
    "link": "https://roanoke.com/news/local/government-politics/article_f2f9d3aa-80de-44e6-a00d-c5304fb762f1.html",
    "timestamp": "2025-09-04T22:30:00Z"
  },
  {
    "title": "If Trump wants to shift the mayor’s race, he needs to get more creative",
    "description": "Kudos to John Catsimatidis for his careful account of his last call with President Donald Trump.",
    "link": "https://nypost.com/2025/09/04/opinion/if-trump-wants-to-shift-the-mayors-race-he-needs-to-get-more-creative/",
    "timestamp": "2025-09-04T22:29:59Z"
  },
  {
    "title": "Trump’s promised immigration crackdown in Chicago could last about six weeks, suburban official says",
    "description": "Chicago is among the latest targets for President Donald Trump’s expanded federal intervention.",
    "link": "https://www.bostonherald.com/2025/09/04/trump-chicago-immigration-crackdown/",
    "timestamp": "2025-09-04T22:29:34Z"
  },
  {
    "title": "‘Safe’ drug dens got $2M in Biden’s budget — now make them HELP NYC’s addicts",
    "description": "Now we know why Harlem's \"safe injection\" sites could be confident they wouldn't face a federal crackdown for aiding illegal drug use: Biden was actually helping to finance them.",
    "link": "https://nypost.com/2025/09/04/opinion/safe-drug-dens-got-2m-in-bidens-budget-to-not-fight-addiction/",
    "timestamp": "2025-09-04T22:29:08Z"
  },
  {
    "title": "Biden underwent recent surgery to remove skin cancer lesions",
    "description": "Former U.S. president Joe Biden recently underwent surgery to remove skin cancer lesions, a spokesperson said Thursday.",
    "link": "https://www.cbc.ca/news/world/biden-surgery-skin-cancer-lesions-1.7625685",
    "timestamp": "2025-09-04T22:28:53Z"
  },
  {
    "title": "Amid tension, Kavanaugh tells judges to ‘keep doing what you’re doing’ | CNN Politics",
    "description": "Justice Brett Kavanaugh appeared eager Thursday to squelch growing tension within the federal judiciary, praising a meeting of judges for their work on the “front lines of American justice” and defending the high court’s opaque emergency decisions as a produc…",
    "link": "https://www.cnn.com/2025/09/04/politics/brett-kavanaugh-judges",
    "timestamp": "2025-09-04T22:28:30Z"
  },
  {
    "title": "Carrie Underwood struggling to run her farm because migrant workers are scared to come to work?",
    "description": "The rumor circulated in part to mock the country singer's perceived support of U.S. President Donald Trump.",
    "link": "https://www.snopes.com//news/2025/09/04/carrie-underwood-farm-migrants/",
    "timestamp": "2025-09-04T22:28:00Z"
  },
  {
    "title": "Trump's Fed pick says he will keep White House job",
    "description": "Democrats say the arrangement indicates Stephen Miran would be Trump's \"puppet\" at the central bank.",
    "link": "https://www.bbc.com/news/articles/c5yq3z2xd01o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-04T22:27:54Z"
  },
  {
    "title": "Trump administration agrees to restore health websites and data",
    "description": "Federal officials have agreed to restore health- and science-related webpages and data following a lawsuit settlement with doctors' groups and other organizations.",
    "link": "https://www.wmtv15news.com/2025/09/04/trump-administration-agrees-restore-health-websites-data/",
    "timestamp": "2025-09-04T22:25:47Z"
  },
  {
    "title": "‘Deranged obsession’: Newsom hit with lawsuit over ‘retaliatory’ California redistricting push",
    "description": "A Texas congressman is suing California Democratic Gov. Gavin Newsom over a “retaliatory and unconstitutional\" redistricting bill he signed in August.",
    "link": "https://www.foxnews.com/politics/deranged-obsession-newsom-hit-lawsuit-over-retaliatory-california-redistricting-push",
    "timestamp": "2025-09-04T22:24:46Z"
  },
  {
    "title": "National Guard’s DC Stay Extended To November As City Sues Trump Over Deployment",
    "description": "The National Guard will have been deployed in the U.S. capital for three and a half months by the time the extension expires.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/09/04/national-guards-dc-stay-extended-to-november-as-city-sues-trump-over-deployment/",
    "timestamp": "2025-09-04T22:21:56Z"
  },
  {
    "title": "'Was this legal?' Military analyst warns Trump may have committed 'extrajudicial killing'",
    "description": "A military analyst on Thursday slammed President Donald Trump's decision to bomb an alleged drug boat off the coast of Venezuela. Lt. Gen. Mark Hertling, who led Army troops in Afghanistan in 2007 and 2008, joined The Bulwark's Tim Miller on a new episode of …",
    "link": "https://www.rawstory.com/trump-2673962194/",
    "timestamp": "2025-09-04T22:21:26Z"
  },
  {
    "title": "Zohran Mamdani challenges President Trump to debate in New York City",
    "description": "Democrat Zohran Mamdani challenged President Trump to a debate in NYC after Andrew Cuomo called for a series of debates in the mayor's race.",
    "link": "https://www.cbsnews.com/newyork/news/mamdani-trump-debate-cuomo-nyc-mayors-race/",
    "timestamp": "2025-09-04T22:19:03Z"
  },
  {
    "title": "The proxy war that will redefine public health in America",
    "description": "The US health secretary has been told children are now dying from measles for the first time in 20 years after he rolled back vaccine recommendations - a row that has taken centre stage in a wider battle over public health in the US.",
    "link": "https://news.sky.com/story/the-proxy-war-that-will-redefine-public-health-in-america-13425255",
    "timestamp": "2025-09-04T22:19:00Z"
  },
  {
    "title": "Justice Department sues Boston over its sanctuary city policies: ‘Michelle Wu has repeatedly chosen to shield these criminals’",
    "description": "Justice Department sues Boston over its sanctuary city policies: 'Michelle Wu has repeatedly chosen to shield these criminals'",
    "link": "https://www.bostonherald.com/2025/09/04/justice-department-sues-boston-over-its-sanctuary-city-policies-michelle-wu-has-repeatedly-chosen-to-shield-these-criminals/",
    "timestamp": "2025-09-04T22:17:42Z"
  },
  {
    "title": "WATCH: Noem, Bondi discuss plans for ICE detention facility in notorious Louisiana prison",
    "description": "Federal authorities purposefully chose a notorious Louisiana prison to hold immigration detainees as a way to encourage people in the U.S. illegally to self-deport, Department of Homeland Security Secretary Kristi Noem said Wednesday.",
    "link": "https://www.pbs.org/newshour/politics/watch-noem-bondi-discuss-plans-for-ice-detention-facility-in-notorious-louisiana-prison",
    "timestamp": "2025-09-04T22:14:45Z"
  },
  {
    "title": "Dem senator compares American founding principle to Iran’s theocracy: ‘Extremely troubling'",
    "description": "Sen. Tim Kaine, D-Va., found Trump nominee Riley Barnes' sentiment that rights come from the Creator, rather than government, \"extremely troubling\" during a Senate confirmation hearing.",
    "link": "https://www.foxnews.com/politics/dem-senator-compares-american-founding-principle-irans-theocracy-extremely-troubling",
    "timestamp": "2025-09-04T22:13:29Z"
  },
  {
    "title": "Trump signs order to lower US tariffs on Japan autos to 15%",
    "description": "US President Donald Trump signed an order Thursday to lower tariffs on Japanese autos, as Washington moves to implement its trade pact negotiated with Tokyo. Japanese autos will face a 15-percent tariff instead of the current 27.5 percent, while the level for…",
    "link": "https://www.digitaljournal.com/world/trump-signs-order-to-lower-us-tariffs-on-japan-autos-to-15/article",
    "timestamp": "2025-09-04T22:12:34Z"
  },
  {
    "title": "Trump Signs Order To Lower US Tariffs On Japan Autos To 15%",
    "description": "US President Donald Trump signed an order Thursday to lower tariffs on Japanese autos, as Washington moves to implement its trade pact negotiated with Tokyo.",
    "link": "https://www.ibtimes.com/trump-signs-order-lower-us-tariffs-japan-autos-15-3782526",
    "timestamp": "2025-09-04T22:12:07Z"
  },
  {
    "title": "China’s stablecoin bind: why US dollar tokens matter – and how Beijing may respond",
    "description": "Once a niche corner of the cryptocurrency world, stablecoins have surged into the global spotlight this year, prompting analysts and industry insiders to declare that the digital asset’s time has come.\nIn July, US President Donald Trump signed the GENIUS Act …",
    "link": "https://biztoc.com/x/779ffc4df0e0df8b",
    "timestamp": "2025-09-04T22:10:55Z"
  },
  {
    "title": "What happens when Trump combines the war on drugs with the war on terror",
    "description": "With this week’s unprecedented deadly military strike on an alleged Venezuelan drug boat in the Caribbean, it’s clear that the US plans to use tactics employed against terrorist groups against Latin American criminal organizations — up to and including threat…",
    "link": "https://www.vox.com/world-politics/460375/boat-strike-tren-de-aragua-venezuela",
    "timestamp": "2025-09-04T22:10:30Z"
  },
  {
    "title": "Student Loan Update: Warning Issued About Key Forgiveness Program Changes",
    "description": "\"These are folks who are already struggling, who are trying to cope with the stress that comes with living with a disability,\" a student loan attorney said.",
    "link": "https://www.newsweek.com/student-loan-forgiveness-mcmahon-education-disability-2124778",
    "timestamp": "2025-09-04T22:08:42Z"
  },
  {
    "title": "How Many Court Cases Can Trump Lose in a Single Week?",
    "description": "Susan B. Glasser on whether President Donald Trump’s disruptive policy initiatives may prevail despite a series of judicial setbacks.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/how-many-court-cases-can-trump-lose-in-a-single-week",
    "timestamp": "2025-09-04T22:07:46Z"
  },
  {
    "title": "Former GMA Dove Award Winner Holds Beachside “Wedding” with Homosexual Partner",
    "description": "Back in the 90s, few voices rang louder in evangelical youth groups than Ray Boltz. Choirs sang his ballads, even parents wept at his lyrics, and GMA Dove Awards were stacked on his shelf. His song, \"Thank You,\" captured the imagination of a generation. \"The …",
    "link": "https://freerepublic.com/focus/f-religion/4338680/posts",
    "timestamp": "2025-09-04T22:07:03Z"
  },
  {
    "title": "Ex-Bush adviser warns Supreme Court could hand Trump monarchical powers",
    "description": "Former speechwriter to President George W. Bush, David Frum, said that if the U.S. Supreme Court hands power to President Donald Trump to wage his trade war, then they're effectively killing the Constitution. Speaking to MSNBC's Nicolle Wallace on Thursday, F…",
    "link": "https://www.rawstory.com/trump-tariffs-supreme-court/",
    "timestamp": "2025-09-04T22:06:42Z"
  },
  {
    "title": "Wyoming stablecoin to launch on Hedera, still not available to purchase",
    "description": "The Wyoming Stable Token Commission approved a proposal to designate Hedera as one of the blockchains for its FRNT stablecoin.",
    "link": "https://cointelegraph.com/news/wyoming-stablecoin-hedera-blockchain",
    "timestamp": "2025-09-04T22:06:35Z"
  },
  {
    "title": "Rep. Yassamin Ansari Had to Google ‘Constituent,’ Defends Using Tax Dollars for Illegals",
    "description": "Rep. Yassamin Ansari (D-AZ) defended her use of the word “constituent” to describe illegal aliens after googling it.\nThe post Rep. Yassamin Ansari Had to Google ‘Constituent,’ Defends Using Tax Dollars for Illegals appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/04/rep-yassamin-ansari-had-to-google-constituent-defends-using-tax-dollars-illegals/",
    "timestamp": "2025-09-04T22:06:01Z"
  },
  {
    "title": "US considers banning Iranians from shopping at Costco during UN meeting",
    "description": "The proposals would be another step in the Trump administration’s crackdown on visas.",
    "link": "https://www.bostonherald.com/2025/09/04/iranians-costco-shopping-ban/",
    "timestamp": "2025-09-04T22:05:15Z"
  },
  {
    "title": "Biden Promised You Airlines Would Pay For Delays—Trump’s DOT Just Shut It Down",
    "description": "The Biden administration planned to require airlines to pay passengers for flight delays - a U.S. equivalent to Europe's \"EU261\" as a shorthand. The Trump administration just killed that effort.\nContinue reading Biden Promised You Airlines Would Pay For Delay…",
    "link": "https://viewfromthewing.com/biden-promised-you-airlines-would-pay-for-delays-trumps-dot-just-shut-it-down/",
    "timestamp": "2025-09-04T22:04:42Z"
  },
  {
    "title": "Sydney Sweeney Shuts Down American Eagle Questions Ahead Of TIFF",
    "description": "After becoming the controversial face of American Eagle, Sydney Sweeney hopes a trip north of the border will take some heat off her. The 2x Emmy nominee, whose boxing biopic Christy premieres Friday at the 50th Toronto International Film Festival, recently s…",
    "link": "http://deadline.com/2025/09/sydney-sweeney-shuts-down-american-eagle-questions-tiff-1236508303/",
    "timestamp": "2025-09-04T22:04:17Z"
  },
  {
    "title": "Republicans defend new congressional maps as residents push back",
    "description": "As part of a special session called by Gov. Mike Kehoe, a committee on redistricting heard more than five hours of testimony on plans to split Kansas City’s 5th district.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_c0331adf-5dba-4a23-9c30-936bbf73126f.html",
    "timestamp": "2025-09-04T22:03:00Z"
  },
  {
    "title": "JUST IN: Trump Admin Extends National Guard’s Deployment on DC Streets Through November 30 – General Leland Blanchard: “Our Mission is Not Complete” (VIDEO)",
    "description": "The Army plans to extend the Washington, DC National Guard’s deployment in DC through November 30 amid a lawsuit from the DC Attorney General to end the deployment, officials say.  Brigadier General Leland D.\nThe post JUST IN: Trump Admin Extends National Gua…",
    "link": "https://www.thegatewaypundit.com/2025/09/just-trump-admin-extends-national-guards-deployment-dc/",
    "timestamp": "2025-09-04T22:00:12Z"
  },
  {
    "title": "Appeals court panel stops order to wind down operations at 'Alligator Alcatraz’",
    "description": "ORLANDO, Fla. — A federal appeals court panel on Thursday put on hold a lower court judge’s order to end operations indefinitely at the immigration detention ce",
    "link": "https://weartv.com/news/local/appeals-court-panel-stops-order-to-wind-down-operations-at-alligator-alcatraz-in-evergla",
    "timestamp": "2025-09-04T21:58:26Z"
  },
  {
    "title": "The Sound of Silence After Minneapolis: America’s Masculinity Blind Spot",
    "description": "A trans shooter in Minneapolis does not change the pattern: Most mass murderers are cisgender men. Change begins with acknowledging that truth. And then acting on it.\nMen, let’s answer the call. Let’s urge Minnesota Gov. Tim Walz and Attorney General Keith El…",
    "link": "https://msmagazine.com/2025/09/04/minneapolis-shooter-gender-men-masculinity-trans/",
    "timestamp": "2025-09-04T21:57:54Z"
  },
  {
    "title": "JD Vance Drops 'S-Bomb' In Furious Post Over RFK Jr. 'Gotcha' Questions",
    "description": "The vice president didn't seem to like the bipartisan beatdown of the Health and Human Services secretary.",
    "link": "https://www.huffpost.com/entry/jd-vance-outraged-over-senates-gotcha-questions-to-rfk-jr_n_68b9e2b2e4b041ed82bdece9",
    "timestamp": "2025-09-04T21:56:48Z"
  },
  {
    "title": "The Losses Keep Piling Up For Trump Ally Jeanine Pirro",
    "description": "The prosecution of Trump's D.C. crime crackdown is not going well for the former Fox News personality.",
    "link": "https://www.huffpost.com/entry/jeanine-pirro-dc-crime-crackdown-prosecution_n_68b9fea4e4b0e20f601b521a",
    "timestamp": "2025-09-04T21:56:27Z"
  },
  {
    "title": "Live: Albanese and Trump share 'warm relationship': Rishworth",
    "description": "Employment Minister Amanda Rishworth says the prime minister's overnight call with the US president shows the pair share a \"warm relationship\". Follow live.",
    "link": "https://www.abc.net.au/news/2025-09-05/federal-politics-live-sept-5/105736120",
    "timestamp": "2025-09-04T21:54:04Z"
  },
  {
    "title": "Trump to rename Pentagon, restoring historic ‘Department of War’ in latest military move",
    "description": "President Donald Trump announces plan to rename the Department of Defense back to Department of War, reverting to the agency's former title as part of Pentagon reforms.",
    "link": "https://www.foxnews.com/politics/trump-rename-pentagon-restoring-historic-department-war-latest-military-move",
    "timestamp": "2025-09-04T21:53:37Z"
  },
  {
    "title": "Appeals court panel stops order to wind down ‘Alligator Alcatraz’ operations in Florida",
    "description": "A federal appeals court panel on Thursday put on hold a lower court judge’s order to end operations indefinitely at the immigration detention center in the Florida Everglades dubbed “Alligator Alcatraz.”",
    "link": "https://www.pbs.org/newshour/politics/appeals-court-panel-stops-order-to-wind-down-alligator-alcatraz-operations-in-florida",
    "timestamp": "2025-09-04T21:53:06Z"
  },
  {
    "title": "RFK Jr.'s day on Capitol Hill exposes GOP fault lines: From the Politics Desk",
    "description": "Health Secretary Robert F. Kennedy Jr.’s Senate hearing exposed GOP fault lines on vaccines in the Trump era.",
    "link": "https://www.nbcnews.com/politics/politics-news/rfk-jr-hearing-exposes-gop-fault-lines-vaccines-politics-desk-rcna229194",
    "timestamp": "2025-09-04T21:52:06Z"
  },
  {
    "title": "Why the Trump-Modi split is such a disaster",
    "description": "When it comes to bromances, President Donald Trump typically runs hot and cold. Remember Elon Musk? Vladimir Putin? First they’re besties, then they’re trading barbs. The latest example? Indian Prime Minister Narendra Modi. During Trump’s first term, Modi joi…",
    "link": "https://www.vox.com/today-explained-podcast/460343/trump-modi-pakistan-china-nobel-peace-prize",
    "timestamp": "2025-09-04T21:50:22Z"
  },
  {
    "title": "Trump’s New War on ‘Narcoterrorists’",
    "description": "The U.S. military adds bombing alleged drug traffickers to its ever-growing list of duties.",
    "link": "http://foreignpolicy.com/2025/09/04/trump-venezuela-drug-boat-strike-us-military-narcoterrorism/",
    "timestamp": "2025-09-04T21:49:57Z"
  },
  {
    "title": "Social Security Update: Trump Admin Responds to Warning About Changes",
    "description": "Since Trump took office, the SSA has touted its improved wait times for beneficiaries, following several technology updates.",
    "link": "https://www.newsweek.com/social-security-update-trump-admin-responds-warning-changes-2124823",
    "timestamp": "2025-09-04T21:45:18Z"
  },
  {
    "title": "Missouri Begins GOP Gerrymander to Help Trump Rig 2026 Election (Jen Rice/Democracy Docket)",
    "description": "Jen Rice / Democracy Docket:\nMissouri Begins GOP Gerrymander to Help Trump Rig 2026 Election  —  Republicans' national effort to rig the 2026 election and win a GOP majority in Congress landed at a Missouri House committee hearing Thursday as the state became…",
    "link": "https://www.memeorandum.com/250904/p116",
    "timestamp": "2025-09-04T21:45:01Z"
  },
  {
    "title": "Trump signs order implementing U.S.-Japan trade deal; auto tariffs reduced to 15%",
    "description": "President Donald Trump signed an executive order on Thursday formally implementing a trade deal his administration struck with Japan in July. The executive order, released by the White House, said the United States will reduce its tariff on car imports from J…",
    "link": "https://japantoday.com/category/politics/urgent-trump-signs-order-formally-implementing-u.s.-japan-trade-deal",
    "timestamp": "2025-09-04T21:44:14Z"
  },
  {
    "title": "Bondi says human smuggling is 'getting people killed' across US as she announces crackdown",
    "description": "Pam Bondi warns that deadly smuggling networks led by cartels are killing families as she expands federal task force operations nationwide.",
    "link": "https://www.foxnews.com/politics/bondi-says-human-smuggling-getting-people-killed-us-she-announces-crackdown",
    "timestamp": "2025-09-04T21:41:17Z"
  },
  {
    "title": "Rubio: U.S. Adding Two Gangs To Terror List in ‘War’ Against ‘These Vicious Animals’",
    "description": "The U.S. has added two more foreign gangs to the Foreign Terrorist Organization (FTO) list, the State Department announced Thursday.",
    "link": "https://dailycaller.com/2025/09/04/rubio-u-s-adding-two-gangs-to-terror-list-in-war-against-these-vicious-animals/",
    "timestamp": "2025-09-04T21:41:14Z"
  },
  {
    "title": "Trump Tried to Fire Fed Reserve Gov Lisa Cook. Now His DOJ Is Investigating Her.",
    "description": "The Department of Justice has opened mortgage fraud investigations into Cook and other Trump adversaries.",
    "link": "https://truthout.org/articles/trump-tried-to-fire-fed-reserve-gov-lisa-cook-now-his-doj-is-investigating-her/",
    "timestamp": "2025-09-04T21:40:15Z"
  },
  {
    "title": "Implementing The United States-Japan Agreement (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nImplementing The United States-Japan Agreement  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers …",
    "link": "https://www.memeorandum.com/250904/p114",
    "timestamp": "2025-09-04T21:40:01Z"
  },
  {
    "title": "Trump-Illinois Staredown Intensifies As State Denies Voter Data Request",
    "description": "Illinois state officials told the Department of Justice they won’t be turning over voter data, despite the Trump administration’s request. In a letter to DOJ... Read More\nThe post Trump-Illinois Staredown Intensifies As State Denies Voter Data Request appeare…",
    "link": "https://www.dailysignal.com/2025/09/04/trump-illinois-staredown-intensifies-as-state-denies-voter-data-request/",
    "timestamp": "2025-09-04T21:40:00Z"
  },
  {
    "title": "The week in whoppers: Bill de Blasio spins Zohran Mamdani’s free-bus plan, JB Pritzker calls Chicago murders ‘no emergency’ and more",
    "description": "Former NYC Mayor Bill de Blasio said on Tuesday that free buses will work \"because if people are given a quality alternative they can afford, they'll use it.\"",
    "link": "https://nypost.com/2025/09/04/opinion/the-week-in-whoppers-bill-de-blasio-spins-zohran-mamdanis-free-bus-plan-jb-pritzker-calls-chicago-murders-no-emergency-and-more/",
    "timestamp": "2025-09-04T21:39:43Z"
  },
  {
    "title": "Trump Urges European Countries to End Russian Oil Purchases",
    "description": "President Donald Trump joined European leaders on a call Thursday and encouraged them to halt purchases of Russian oil that are in turn helping to fund the war in Ukraine and to economically pressure China for helping to subsidize Russia's campaign.\nThe post …",
    "link": "https://www.breitbart.com/politics/2025/09/04/trump-urges-european-countries-to-end-russian-oil-purchases/",
    "timestamp": "2025-09-04T21:38:30Z"
  },
  {
    "title": "U.S. trade gap widest in 4 months as imports surged ahead of tariffs",
    "description": "The U.S. trade deficit expanded more than expected in July to its widest in four months, government data showed Thursday, on a surge in imports before a fresh wave of President Donald Trump's tariffs kicked in. The overall U.S. trade deficit jumped 32.5 perce…",
    "link": "https://japantoday.com/category/business/us-trade-gap-widens-more-than-expected-on-goods-imports-surge",
    "timestamp": "2025-09-04T21:37:54Z"
  },
  {
    "title": "Donald Trump Seals a Tariff Deal with Japan",
    "description": "The order says Japan has agreed to invest $550 billion in the United States in projects that will be selected by the U.S. government.",
    "link": "https://biztoc.com/x/7ddaccb6e3383bbb",
    "timestamp": "2025-09-04T21:37:46Z"
  },
  {
    "title": "Trump's deadly strike on a boat from Venezuela was an act of war",
    "description": "President Donald Trump said the U.S. military blew up a vessel in the Caribbean, killing 11 people. The administration said the boat had departed from Venezuela.",
    "link": "https://biztoc.com/x/09e82ea11c1c58cc",
    "timestamp": "2025-09-04T21:37:42Z"
  },
  {
    "title": "Live updates: DOJ probes mortgage fraud claims against Federal Reserve governor, AP source says",
    "description": "Live updates: DOJ probes mortgage fraud claims against Federal Reserve governor, AP source says\nFollow the latest news on President Donald Trump and his administration | Sept. 4, 2025\nThe Justice Department has issued subpoenas as part of an investigation int…",
    "link": "https://biztoc.com/x/98b3c07183eeb988",
    "timestamp": "2025-09-04T21:37:39Z"
  },
  {
    "title": "Western allies pledge troops to Ukraine; NZ’s role unclear",
    "description": "Any troop commitment to Ukraine would require Cabinet approval, Judith Collins says.",
    "link": "https://www.nzherald.co.nz/nz/politics/western-allies-pledge-troops-to-ukraine-nzs-role-unclear/DF5TNIFU3ZBRLC63KLUSIDZVHY/",
    "timestamp": "2025-09-04T21:37:25Z"
  },
  {
    "title": "Northwestern University president resigns after Trump funding cuts",
    "description": "CHICAGO: The president of Northwestern University, a prestigious school in suburban Chicago, announced on Thursday (Sep 4) that he would resign as the institution deals with budget issues stemming from cuts in federal funding by the Trump administration.Presi…",
    "link": "https://www.channelnewsasia.com/world/northwestern-university-president-resigns-after-trump-funding-cuts-5333356",
    "timestamp": "2025-09-04T21:35:33Z"
  },
  {
    "title": "Judge upbraids prosecutors for handling of DC crime cases, saying they have 'no credibility left'",
    "description": "A federal magistrate judge on Thursday angrily accused top Justice Department prosecutors of trampling on the civil rights of people arrested during President Donald Trump's law-enforcement surge in the nation's capital. Judge Zia Faruqui, a former federal pr…",
    "link": "https://japantoday.com/category/world/judge-upbraids-prosecutors-for-handling-of-dc-surge-cases-saying-they-have-%27no-credibility-left%27",
    "timestamp": "2025-09-04T21:34:35Z"
  },
  {
    "title": "Trump's promised immigration crackdown in Chicago could last about six weeks, suburban official says",
    "description": "The Trump administration has informed local officials that its promised immigration enforcement surge in Chicago will operate seven days a week for about six weeks, according to the mayor of a suburb that houses an immigration processing center. Mayor Katrina…",
    "link": "https://japantoday.com/category/world/trump%27s-promised-immigration-crackdown-in-chicago-could-last-about-six-weeks-suburban-official-says",
    "timestamp": "2025-09-04T21:34:29Z"
  },
  {
    "title": "Immigrant pleads guilty to being in US illegally after judge allegedly helped him evade agents",
    "description": "An immigrant who was arrested after a Milwaukee judge allegedly helped him evade federal agents has pleaded guilty to being in the U.S. illegally",
    "link": "https://abcnews.go.com/US/wireStory/immigrant-pleads-guilty-us-illegally-after-judge-allegedly-125272237",
    "timestamp": "2025-09-04T21:34:26Z"
  },
  {
    "title": "Appeals court panel stops order to wind down operations at Everglades immigrant detention center",
    "description": "In a 2-1 vote, the order was stayed pending the outcome of an appeal.",
    "link": "https://www.bostonherald.com/2025/09/04/everglades-detention-center/",
    "timestamp": "2025-09-04T21:34:19Z"
  },
  {
    "title": "Mayor Eric Adams met with Trump special envoy Steve Witkoff to talk possible admin gig",
    "description": "Mayor Eric Adams met with President Trump’s special envoy to the Middle East, Steve Witkoff, in Florida earlier this week — amid talks about a potential role for Hizzoner in the administration, The Post has learned.",
    "link": "https://nypost.com/2025/09/04/us-news/mayor-eric-adams-met-with-trump-special-envoy-steve-witkoff-to-talk-possible-admin-gig/",
    "timestamp": "2025-09-04T21:34:15Z"
  },
  {
    "title": "Kennedy tries to defend COVID-19 vaccine stance in raucous Senate hearing",
    "description": "U.S. Health Secretary Robert F Kennedy Jr, facing pointed bipartisan questioning at a rancorous three-hour Senate committee hearing on Thursday, tried to defend his efforts to pull back COVID-19 vaccine recommendations and explain the turmoil he has created a…",
    "link": "https://japantoday.com/category/world/kennedy-to-appear-before-senate-committee-amid-cdc-turmoil",
    "timestamp": "2025-09-04T21:33:53Z"
  },
  {
    "title": "26 nations pledge to give Ukraine postwar security guarantees, Macron says",
    "description": "BTwenty-six nations have pledged to provide postwar security guarantees to Ukraine, which will include an international force on land and sea and in the air, French President Emmanuel Macron said after a summit meeting of Kyiv's allies on Thursday. Macron sai…",
    "link": "https://japantoday.com/category/world/26-nations-vow-to-give-ukraine-postwar-security-guarantees-macron-says1",
    "timestamp": "2025-09-04T21:33:41Z"
  },
  {
    "title": "Trump says U.S. would be on 'brink of economic catastrophe' unless justices rule his tariffs are legal",
    "description": "President Donald Trump is seeking a swift and definitive decision on tariffs from the Supreme Court that he helped shape, saying the country would be on “the brink of economic catastrophe” without the import taxes he has imposed on U.S. rivals and allies alik…",
    "link": "https://japantoday.com/category/world/trump-says-us-would-be-on-%27brink-of-economic-catastrophe%27-unless-justices-rule-his-tariffs-are-legal",
    "timestamp": "2025-09-04T21:33:25Z"
  },
  {
    "title": "Powerful pro-Trump committee goes after Irish subsidiary of US pharma giant UnitedHealth",
    "description": "The US Congress’s Committee on Oversight and Government Reform has ramped up an investigation into what it claims are “opaque business practices and relationships” at an Irish subsidiary of UnitedHealth Group.",
    "link": "https://www.independent.ie/business/irish/powerful-pro-trump-committee-goes-after-irish-subsidiary-of-us-pharma-giant-unitedhealth/a453979685.html",
    "timestamp": "2025-09-04T21:32:59Z"
  },
  {
    "title": "Live updates: DOJ probes mortgage fraud claims against Federal Reserve governor, AP source says - AP News",
    "description": "Live updates: DOJ probes mortgage fraud claims against Federal Reserve governor, AP source saysAP News Exclusive | DOJ Opens Criminal Investigation Into Fed’s Cook, Issues SubpoenasThe Wall Street Journal Trump Live Updates: Lisa Cook Investigation, Fed Board…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179010084",
    "timestamp": "2025-09-04T21:32:49Z"
  },
  {
    "title": "A Different RFK Jr. Just Appeared Before Congress",
    "description": "America’s health secretary has moved into attack mode.",
    "link": "https://www.theatlantic.com/health/archive/2025/09/senators-finally-seem-realize-who-they-made-health-secretary/684111/",
    "timestamp": "2025-09-04T21:32:17Z"
  },
  {
    "title": "EXCLUSIVE: GOP Lawmakers Back VA Push To Revoke Biden-Era Healthcare Rule",
    "description": "Republican lawmakers are set to submit a letter to the Department of Veteran’s Affairs in support of rescinding a Biden-era rule, the Daily Caller has learned.",
    "link": "https://dailycaller.com/2025/09/04/trump-biden-veterans-affairs-abortion-rule-federal-law-gop-congress/",
    "timestamp": "2025-09-04T21:30:53Z"
  },
  {
    "title": "Trump’s Caribbean Strike Polarizes Region",
    "description": "Venezuela’s frayed ties with old allies have left it isolated in responding to U.S. force.",
    "link": "http://foreignpolicy.com/2025/09/04/trump-venezuela-strike-tren-aragua-mexico-brazil-colombia/",
    "timestamp": "2025-09-04T21:30:03Z"
  },
  {
    "title": "Missouri poised to make it harder for citizens to change constitution",
    "description": "The measure could be voted on in the full House early next week",
    "link": "https://www.stltoday.com/news/local/government-politics/article_5c67c92b-1f61-4059-a187-e9eadd0017b5.html",
    "timestamp": "2025-09-04T21:30:00Z"
  },
  {
    "title": "'Alligator Alcatraz' immigration centre can stay open, appeals court rules",
    "description": "Florida Governor Ron DeSantis welcomes the ruling and declares the Everglades site \"open for business\".",
    "link": "https://www.bbc.com/news/articles/crl5ry3rgzro?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-04T21:29:59Z"
  },
  {
    "title": "Blaming AI a popular strategy for politicians seeking to dodge responsibility for something embarrassing",
    "description": "Artificial intelligence, apparently, is the new “fake news.&quot; Blaming AI is an increasingly popular strategy for politicians seeking to dodge responsibility for something embarrassing — among others. AI isn't a person, after all. It can't leak or file sui…",
    "link": "https://japantoday.com/category/features/opinions/the-president-blamed-ai-and-embraced-doing-so.-is-it-becoming-the-new-%27fake-news%27",
    "timestamp": "2025-09-04T21:29:49Z"
  }
]