[
  {
    "title": "Wow. Gen. Jack Keane on Fox Business today...",
    "description": "Gen. Keane said, \" i would be stunned if one of Trump's principle advisors like Rubio., talking to Lavrof, hasn't said, \" if your boss doesn't make serious concessions and agree to a peace agreement., I can tell you for a fact that Donald Trump is going to cr…",
    "link": "https://freerepublic.com/focus/f-chat/4335239/posts",
    "timestamp": "2025-08-18T15:56:41Z"
  },
  {
    "title": "Conservative network Newsmax agrees to pay $67M in defamation case over 2020 election claims",
    "description": "The conservative network Newsmax has agreed to pay $67 million to settle a lawsuit accusing it of defaming a voting equipment company by spreading lies about President Donald Trump’s 2020 election loss.",
    "link": "https://www.clickondetroit.com/news/politics/2025/08/18/newsmax-agrees-to-pay-67m-settlement-in-defamation-case-over-2020-election-claims/",
    "timestamp": "2025-08-18T15:56:34Z"
  },
  {
    "title": "Ten Ukrainian civilians killed in Russian strikes as Zelenskiy prepares to meet Trump",
    "description": "Drone and missile attacks condemned as attempt to ‘humiliate diplomatic efforts’ before talks with US and European leaders",
    "link": "https://www.irishtimes.com/world/europe/2025/08/18/ten-ukrainian-civilians-killed-in-russian-strikes-as-zelenskiy-prepares-to-meet-trump/",
    "timestamp": "2025-08-18T15:55:13Z"
  },
  {
    "title": "Former Marine accused in ICE ambush linked to far-left training group: reports",
    "description": "Former Marine Benjamin Song charged with terrorism after training leftist activists in combat skills before July 4 ICE facility attack near Fort Worth",
    "link": "https://www.foxnews.com/politics/former-marine-accused-ice-ambush-linked-far-left-training-group-reports",
    "timestamp": "2025-08-18T15:53:53Z"
  },
  {
    "title": "The Ukraine War Was Always Going To End This Way",
    "description": "President Donald Trump’s meeting with Russian President Vladimir Putin in Alaska on Friday didn’t yield the ceasefire deal Trump was hoping for, but there was apparently enough progress made that Ukrainian President Volodymyr Zelensky and top European leaders…",
    "link": "https://freerepublic.com/focus/f-news/4335238/posts",
    "timestamp": "2025-08-18T15:52:53Z"
  },
  {
    "title": "Palestinians leave Gaza City fearing Israeli offensive as others stay put, call for ceasefire",
    "description": "Fearing an imminent Israeli ground offensive, thousands of Palestinians have left their homes in eastern parts of Gaza City, now under constant bombardment, for points to the west and south in the shattered territory.",
    "link": "https://www.cbc.ca/news/world/gaza-city-palestinians-leave-israeli-offensive-1.7611490",
    "timestamp": "2025-08-18T15:52:15Z"
  },
  {
    "title": "DC protests as Trump deployment ramps up",
    "description": "What happened\nProtesters in Washington, D.C., pushed back over the weekend against President Donald Trump's growing federal military and law enforcement deployment in the capital.\nThe Republican governors of West Virginia, South Carolina and Ohio are sending …",
    "link": "https://biztoc.com/x/882819ad9ba38e07",
    "timestamp": "2025-08-18T15:52:08Z"
  },
  {
    "title": "Trump releases new rules to limit a major student-loan forgiveness program for public servants",
    "description": "President Donald Trump's administration unveiled new rules to limit Public Service Loan Forgiveness.\nBrendan SMIALOWSKI / AFP via Getty Images\nTrump's administration released its proposed rules to limit Public Service Loan Forgiveness.\nThe administration said…",
    "link": "https://biztoc.com/x/0c5f611c7e47071d",
    "timestamp": "2025-08-18T15:52:02Z"
  },
  {
    "title": "Why Didn't Trump Tell Putin He Could End The War Now?",
    "description": "In response to President Zelensky and European leaders arriving in Washington for Tuesday's meeting, Donald Trump excoriated the Ukraine leader by claiming he could end the war now if he wants. \nTrump's Truth Social post is telling Zelensky to surrender, now.…",
    "link": "https://crooksandliars.com/2025/08/why-didnt-trump-tell-putin-he-could-end",
    "timestamp": "2025-08-18T15:51:00Z"
  },
  {
    "title": "Iran’s president visits Armenia for talks on US-backed Azerbaijan corridor",
    "description": "Iran rejects TRIPP, says the presence of American companies in the region would be 'worrying'.",
    "link": "https://www.aljazeera.com/news/2025/8/18/irans-president-visits-armenia-for-talks-on-us-backed-azerbaijan-corridor",
    "timestamp": "2025-08-18T15:50:48Z"
  },
  {
    "title": "Who Zelensky Is Bringing to Washington—and Why",
    "description": "Several European leaders will accompany the Ukrainian president as he makes his case to Trump.",
    "link": "http://foreignpolicy.com/2025/08/18/zelensky-trump-washington-meeting-eu-leaders-rutte-stubb-macron-starmer/",
    "timestamp": "2025-08-18T15:50:13Z"
  },
  {
    "title": "Breaking down uninsured numbers under Trump's spending law",
    "description": "The newly signed One Big Beautiful Bill Act will increase the uninsured rate in the U.S., especially as the law prompts changes to Medicaid and Health Insurance Marketplace policy.",
    "link": "https://www.techtarget.com/healthcarepayers/news/366629225/Breaking-down-uninsured-numbers-under-Trumps-spending-law",
    "timestamp": "2025-08-18T15:50:00Z"
  },
  {
    "title": "The Real Trade Emergency—Why the Business Community Must Lead Again | Opinion",
    "description": "Trade has always been about more than market access. It's about building bridges, deepening alliances, and strengthening the backbone of democracy through shared prosperity. In the absence of business leadership, policy risks becoming reactive and politicized.",
    "link": "https://www.newsweek.com/real-trade-emergencywhy-business-community-must-lead-again-opinion-2115138",
    "timestamp": "2025-08-18T15:49:04Z"
  },
  {
    "title": "Trump eyes yet another power grab, takes aim at voting machines and mail-in ballots",
    "description": "Donald Trump's sweeping executive order on elections lost in the courts, but he's still taking aim at voting machines and mail-in ballots.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-eyes-yet-another-power-grab-takes-aim-voting-machines-mail-ballo-rcna225602",
    "timestamp": "2025-08-18T15:48:40Z"
  },
  {
    "title": "Newsmax agrees to pay $67M settlement in defamation case over 2020 election claims",
    "description": "It comes after Fox News paid $787.5 million to settle a similar lawsuit in 2023.",
    "link": "https://www.bostonherald.com/2025/08/18/newsmax-defamation-settlement/",
    "timestamp": "2025-08-18T15:48:36Z"
  },
  {
    "title": "'Troubled to appalled': Senior ex-GOP officials sound off about Pam Bondi",
    "description": "A number of former Justice Department officials serving under Republican administrations are privately “troubled to appalled” with what they described as Attorney General Pam Bondi’s “ferociously sycophantic” tenure leading the DOJ, The New Yorker reported\r\n …",
    "link": "https://www.rawstory.com/pam-bondi-2673897573/",
    "timestamp": "2025-08-18T15:47:49Z"
  },
  {
    "title": "The 5 at 5: Monday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-monday-171-6793268-Aug2025/",
    "timestamp": "2025-08-18T15:46:02Z"
  },
  {
    "title": "How Disastrous Was the Trump-Putin Meeting?",
    "description": "The Europeans are coming to Washington in an attempt to salvage Ukraine’s position.",
    "link": "http://foreignpolicy.com/2025/08/18/trump-putin-summit-alaska-russia-ukraine-how-disastrous/",
    "timestamp": "2025-08-18T15:45:29Z"
  },
  {
    "title": "Hamas Accepts New Gaza Truce Plan: Hamas Official",
    "description": "Hamas has accepted a new ceasefire proposal for Gaza without requesting amendments, a source from the group told AFP Monday, after a fresh diplomatic push to end more than 22 months of war.",
    "link": "https://www.ibtimes.com/hamas-accepts-new-gaza-truce-plan-hamas-official-3781133",
    "timestamp": "2025-08-18T15:45:19Z"
  },
  {
    "title": "Hamas Accepts New Gaza Truce Plan: Hamas Official",
    "description": "Hamas has accepted a new ceasefire proposal for Gaza without requesting amendments, a source from the group told AFP Monday, after a fresh diplomatic push to end more than 22 months of war.",
    "link": "https://www.ibtimes.com.au/hamas-accepts-new-gaza-truce-plan-hamas-official-1860165",
    "timestamp": "2025-08-18T15:45:11Z"
  },
  {
    "title": "JFK's Grandson Dons Blonde Wig to Mock Melania Trump",
    "description": "Jack Schlossberg read aloud the letter Melania Trump recently wrote to Vladimir Putin, and quipped \"This makes no sense.\"",
    "link": "https://www.newsweek.com/jack-schlossberg-melania-trump-vladimir-putin-letter-2115030",
    "timestamp": "2025-08-18T15:45:09Z"
  },
  {
    "title": "Trump’s DOJ Pushed To Merge ATF With DEA — Gun Owners Revolted",
    "description": "The Department of Justice (DOJ) proposed to merge the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) with the Drug Enforcement Administration (DEA).",
    "link": "https://dailycaller.com/2025/08/18/trump-doj-department-justice-pam-bondi-atf-dea-merger-firearms-guns-drugs-second-amendment/",
    "timestamp": "2025-08-18T15:43:52Z"
  },
  {
    "title": "Trump: Gaza hostages will return only after Hamas is 'confronted and destroyed'",
    "description": "Trump said the return of hostages depends on confronting Hamas and warned, 'The sooner this takes place, the better the chances of success.' Families of 50 hostages urged him to act swiftly, warning, 'Every day this war continues puts the living hostages at i…",
    "link": "https://www.haaretz.com/us-news/2025-08-18/ty-article/.premium/trump-gaza-hostages-will-return-only-after-hamas-is-confronted-and-destroyed/00000198-bd6a-d1e9-abf9-ff7e82730000",
    "timestamp": "2025-08-18T15:43:39Z"
  },
  {
    "title": "Security Guarantees for Ukraine Do Not Require Deployment of US Troops – US NATO Envoy",
    "description": "WASHINGTON (Sputnik) – Potential security guarantees for Ukraine may not require the deployment of US troops and are expected to be primarily focused on a command-and-control role, US Ambassador to NATO Matthew Whitaker stated on Monday.",
    "link": "https://sputnikglobe.com/20250818/security-guarantees-for-ukraine-do-not-require-deployment-of-us-troops--us-nato-envoy-1122646040.html",
    "timestamp": "2025-08-18T15:43:31Z"
  },
  {
    "title": "Trump releases new rules to limit a major student-loan forgiveness program for public servants",
    "description": "Trump's proposal to narrow eligibility for Public Service Loan Forgiveness is now open for public comment.",
    "link": "https://www.businessinsider.com/trump-limits-pslf-student-loan-forgiveness-block-delay-debt-relief-2025-8",
    "timestamp": "2025-08-18T15:43:18Z"
  },
  {
    "title": "WaPo is very concerned that more mothers are staying home to raise children",
    "description": "The Washington Post is not a serious newspaper: Washington Post If more mothers stay home to care for their children ... Who's going to stay at the office and take care of the corporate profits?! You can feel the visceral terror this strikes in the heart of t…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335235/posts",
    "timestamp": "2025-08-18T15:42:20Z"
  },
  {
    "title": "Experts claim Trump's team were left 'shocked' and 'frightened' after Putin meeting in Alaska",
    "description": "Putin's reported message to Trump's team during Alaska meeting left them 'spooked' and 'ashen-faced' according to experts",
    "link": "https://www.ladbible.com/news/world-news/putin-trump-message-alaska-politics-russia-ukraine-391184-20250818",
    "timestamp": "2025-08-18T15:41:56Z"
  },
  {
    "title": "Zelenskyy says Russia deserves no reward for war ahead of key Trump meeting",
    "description": "European leaders have joined Ukraine's president in Washington for key talks with Donald Trump that could shape the future of the war in Ukraine and any possible peace deal.",
    "link": "https://www.abc.net.au/news/2025-08-19/zelenskyy-europe-leaders-meeting-donald-trump-at-white-house/105669348",
    "timestamp": "2025-08-18T15:41:53Z"
  },
  {
    "title": "Nolte – Death Blow: Humiliated MSNBC Forced to Rebrand as MS NOW",
    "description": "Nolte: Far-left MSNBC has officially split with NBC News and will now call itself MS NOW.\nThe post Nolte – Death Blow: Humiliated MSNBC Forced to Rebrand as MS NOW appeared first on Breitbart.",
    "link": "https://www.breitbart.com/the-media/2025/08/18/nolte-death-blow-humiliated-msnbc-forced-rebrand-ms-now/",
    "timestamp": "2025-08-18T15:41:51Z"
  },
  {
    "title": "Europe closes mostly lower with Ukraine talks in limelight",
    "description": "Major European stock indexes ended Monday's trading session mostly in the red territory ahead of high-stakes talks between US President Donald Trump, his Ukrainian colleague Volodymyr Zelensky, and Eu...",
    "link": "https://biztoc.com/x/4337740cc081bb4b",
    "timestamp": "2025-08-18T15:40:31Z"
  },
  {
    "title": "Ukraine, European leaders to meet Trump after Putin talks",
    "description": "What happened\nEuropean and NATO leaders said Sunday they would accompany Ukrainian President Volodymyr Zelenskyy to the White House as he meets with President Donald Trump today following Trump's talks with Russian President Vladimir Putin on Friday. Trump we…",
    "link": "https://biztoc.com/x/b70e8cc2f31bc8da",
    "timestamp": "2025-08-18T15:40:21Z"
  },
  {
    "title": "Here’s Trump’s schedule with Zelensky on Monday",
    "description": "-snip- 12 p.m. European leaders are expected to be at the White House by noon EDT at the South Portico, with television crew and photographers allowed to document the arrival. 1 p.m. – 1:15 p.m. Zelensky and Trump are set to greet each other an hour after the…",
    "link": "https://freerepublic.com/focus/f-chat/4335234/posts",
    "timestamp": "2025-08-18T15:40:18Z"
  },
  {
    "title": "1 arrested after over 100 bikes seen riding on Boston highways, tunnels",
    "description": "A group of over 100 bicycles, dirt bikes and motorized scooters were seen riding on and through highways and tunnels in Boston Saturday afternoon, police said. Massachusetts State Police received a report that a group of bikes was riding into the O'Neill Tunn…",
    "link": "https://freerepublic.com/focus/f-news/4335233/posts",
    "timestamp": "2025-08-18T15:40:11Z"
  },
  {
    "title": "DC protests as Trump deployment ramps up",
    "description": "Trump's 'crusade against crime' is targeting immigrants and the homeless",
    "link": "https://theweek.com/politics/trump-washington-dc-takeover-protests",
    "timestamp": "2025-08-18T15:39:23Z"
  },
  {
    "title": "House Oversight Chair says Justice Department to start providing Epstein-related records on Friday | CNN Politics",
    "description": "House Oversight Committee Chair James Comer said in a statement on Monday that the Justice Department will start turning over records related to Jeffrey Epstein on Friday.",
    "link": "https://www.cnn.com/2025/08/18/politics/barr-house-oversight-epstein",
    "timestamp": "2025-08-18T15:38:51Z"
  },
  {
    "title": "Live: Volodymyr Zelenskyy set to arrive at the White House ahead of peace talks",
    "description": "US President Donald Trump is set to meet Ukrainian President Volodymyr Zelenskyy at the White House ahead of talks about ending Russia's war. Later in the day, a group of European leaders will join the discussion. Follow live.",
    "link": "https://www.abc.net.au/news/2025-08-19/donald-trump-volodymyr-zelenskyy-meeting-in-washington-dc-/105669530",
    "timestamp": "2025-08-18T15:38:32Z"
  },
  {
    "title": "Live: Trump says Putin will accept 'security guarantees' on Ukraine",
    "description": "Donald Trump says Russia will accept \"security guarantees\" for Ukraine after a White House meeting with Ukraine's President Volodymyr Zelenskyy and major European leaders. Follow live.",
    "link": "https://www.abc.net.au/news/2025-08-19/donald-trump-volodymyr-zelenskyy-meeting-in-washington-dc/105669530",
    "timestamp": "2025-08-18T15:38:32Z"
  },
  {
    "title": "Trump administration denies federal funding to Virginia schools that treat trans students with dignity",
    "description": "The Department of Education followed through on a threat to suspend financial support to five districts that allow students to use bathrooms and locker rooms aligned with their gender identity.",
    "link": "https://www.advocate.com/politics/trump-virginia-schools-transgender-dignity",
    "timestamp": "2025-08-18T15:37:15Z"
  },
  {
    "title": "Trump Admin Just Raised The Bar For Anyone Hoping To Become An American",
    "description": "USCIS plans to more heavily scrutinize foreign nationals applying for American citizenship as it continues to tighten enforcement standards across the board.",
    "link": "https://dailycaller.com/2025/08/18/trump-admin-raises-bar-on-citizeship-apps/",
    "timestamp": "2025-08-18T15:37:08Z"
  },
  {
    "title": "Ukraine Says It Made Fresh Attack on Russian Oil Pipeline System",
    "description": "Ukraine said it carried out a fresh attack on Russia’s Druzhba oil pipeline system on Monday and halted a conduit that’s important for crude supply to parts of central Europe.",
    "link": "https://financialpost.com/pmn/business-pmn/ukraine-says-it-made-fresh-attack-on-russian-oil-pipeline-system",
    "timestamp": "2025-08-18T15:35:50Z"
  },
  {
    "title": "Putin briefs Modi on Alaska summit",
    "description": "The Russian president called the Indian prime minister to discuss his meeting with Donald Trump in Alaska Read Full Article at RT.com",
    "link": "https://www.rt.com/india/623201-putin-brief-modi-alaska-summit/",
    "timestamp": "2025-08-18T15:34:21Z"
  },
  {
    "title": "Trump announces he'll helm movement to eliminate mail-in voting and voting machines: 'FIGHT LIKE HELL'",
    "description": "President Donald Trump announced that he will \"lead a movement to\" eliminate mail-in voting and voting machines, saying he would sign an executive order.",
    "link": "https://www.foxnews.com/politics/trump-announces-hell-helm-movement-eliminate-mail-in-voting-voting-machines-fight-like-hell",
    "timestamp": "2025-08-18T15:34:00Z"
  },
  {
    "title": "Trump's flood of Truth Social rants dismissed as 'morning nonsense' by fact checker",
    "description": "President Donald Trump began his Monday with a series of short rants on Truth Social ahead of a scheduled White House meeting with European leaders. CNN fact-checker Daniel Dale responded by highlighting some of the most egregious falsehoods they contained.Th…",
    "link": "https://www.rawstory.com/vote-by-mail/",
    "timestamp": "2025-08-18T15:33:46Z"
  },
  {
    "title": "European leaders rush to US to help Ukraine avoid 'capitulation'",
    "description": "The heads of state hope to stop Trump from threatening long-term European security, writes James Landale.",
    "link": "https://www.bbc.com/news/articles/c9d0v8ljw3no",
    "timestamp": "2025-08-18T15:31:36Z"
  },
  {
    "title": "Expert Claims Putin’s Mention of This 1 Issue To Trump Is Clearly A ‘Manipulation’ Tactic",
    "description": "The Russian dictator and the U.S. president sat down for bilateral talks in Alaska last week.",
    "link": "https://www.huffpost.com/entry/putin-expert-manipulation-tactic-trump-talks_n_68a330c4e4b0858c76431e96",
    "timestamp": "2025-08-18T15:31:13Z"
  },
  {
    "title": "Gavin Newsom trolls JD Vance with new nickname in Trump-style post - here's what it is",
    "description": "California Governor Gavin Newsom criticises Donald Trump and JD Vance. Newsom uses social media to attack Vance. He calls him \"Just Dance Vance\". This is over Republican plans to redraw state boundaries. Newsom opposes what he calls a \"Trump takeover\". He thr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gavin-newsom-trolls-jd-vance-with-new-nickname-in-trump-style-post-heres-what-it-is/articleshow/123367903.cms",
    "timestamp": "2025-08-18T15:31:08Z"
  },
  {
    "title": "MSNBC will change its name to MS NOW as part of split from NBC",
    "description": "The network runs second in cable news ratings to Fox News Channel with personalities like Rachel Maddow, Nicole Wallace and Ari Melber.",
    "link": "https://www.pbs.org/newshour/nation/msnbc-will-change-its-name-to-ms-now-as-part-of-split-from-nbc",
    "timestamp": "2025-08-18T15:31:04Z"
  },
  {
    "title": "Ukraine, European leaders to meet Trump after Putin talks",
    "description": "Trump meets with Ukrainian President Volodymyr Zelenskyy today following talks with Russian President Vladimir Putin last week",
    "link": "https://theweek.com/politics/europe-trump-zelensky-putin",
    "timestamp": "2025-08-18T15:29:36Z"
  },
  {
    "title": "Europe Ramps Up Defense Procurement for Ukraine",
    "description": "Zelensky’s disastrous last White House meeting, which saw him publicly berated by President Donald Trump and Vice President JD Vance, served as a wake-up call for many European leaders, as it made clear that Ukraine and subsequently Europe as a whole could no…",
    "link": "https://biztoc.com/x/97c04082a7b52642",
    "timestamp": "2025-08-18T15:29:22Z"
  },
  {
    "title": "Putin dials Modi on his talks with Trump in Alaska",
    "description": "US raises pitch against India’s purchase of Russian oil while Modi says there will be more exchanges with Putin",
    "link": "https://www.thehindubusinessline.com/economy/putin-dials-modi-on-his-talks-with-trump-in-alaska/article69948427.ece",
    "timestamp": "2025-08-18T15:28:37Z"
  },
  {
    "title": "Putin dials Modi on his talks with Trump in Alaska",
    "description": "US raises pitch against India’s purchase of Russian oil while Modi says there will be more exchanges with Putin",
    "link": "https://www.thehindubusinessline.com/news/world/putin-dials-modi-on-his-talks-with-trump-in-alaska/article69948427.ece",
    "timestamp": "2025-08-18T15:28:37Z"
  },
  {
    "title": "Trumpy News Channel Finally Pays Up for Crazy 2020 Lies",
    "description": "Pro-Donald Trump outlet Newsmax has agreed to pay Dominion Voting Systems $67 million to settle the voting machine company’s defamation lawsuit against it...",
    "link": "https://www.thedailybeast.com/trumpy-news-channel-newsmax-finally-pays-up-for-crazy-2020-lies/",
    "timestamp": "2025-08-18T15:28:30Z"
  },
  {
    "title": "Chris Pratt wishes RFK Jr., Trump admin success, advises against being 'mired in hatred' for the president",
    "description": "Chris Pratt told Bill Maher on Monday that he hopes RFK Jr. and the Trump administration are successful and warned against being \"mired in hatred\" for the president.",
    "link": "https://www.foxnews.com/media/chris-pratt-wishes-rfk-jr-trump-admin-success-slams-being-mired-hatred-president",
    "timestamp": "2025-08-18T15:28:12Z"
  },
  {
    "title": "Zelensky: Ukraine ready to work productively for peace",
    "description": "Ukrainian President Volodymyr Zelensky said on Monday that Ukraine is prepared to work productively in order to end the war between Kiev and Moscow. \"When peace is discussed for one country in Europe, it means peace for all of Europe. We are ready to continue…",
    "link": "https://freerepublic.com/focus/f-chat/4335231/posts",
    "timestamp": "2025-08-18T15:27:30Z"
  },
  {
    "title": "Bioethanol plant begins shut-down process",
    "description": "Hull-based Vivergo says all staff will have left and the site will be ready for demolition by the end of the year.",
    "link": "https://www.bbc.com/news/articles/c3v3ey0n71xo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-18T15:26:15Z"
  },
  {
    "title": "How a $30 million crypto pardon scheme failed even before it got to Trump",
    "description": "Matt Argall and Brock Pierce allegedly devised a plan to secure a presidential pardon for Roger Ver, aiming for a $30 million payout. They touted connections to Trump insiders, promising to influence the White House. Ver, facing tax evasion charges, sought cl…",
    "link": "https://economictimes.indiatimes.com/news/international/business/how-a-30-million-crypto-pardon-scheme-failed-even-before-it-got-to-trump/articleshow/123367749.cms",
    "timestamp": "2025-08-18T15:26:15Z"
  },
  {
    "title": "Russia pounds Ukraine, kills more civilians before White House meeting",
    "description": "Ukraine's President Zelenskyy says attacks on civilians are 'demonstrative and cynical' before high-stakes talks.",
    "link": "https://www.aljazeera.com/news/2025/8/18/russia-pounds-ukraine-kills-more-civilians-before-white-house-meeting",
    "timestamp": "2025-08-18T15:25:07Z"
  },
  {
    "title": "Fox & Friends Hosts Crack Up After Brian Kilmeade’s ’69’ Flub During James Comey Segment",
    "description": "A Fox & Friends discussion briefly went off the rails Monday morning when co-host Brian Kilmeade mistakenly blurted out the number 69,\nThe post Fox & Friends Hosts Crack Up After Brian Kilmeade’s ’69’ Flub During James Comey Segment first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/fox-friends-hosts-crack-up-after-brian-kilmeades-69-flub-during-james-comey-segment/",
    "timestamp": "2025-08-18T15:23:38Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
    "description": "Indian markets closed higher on Monday as easing concerns over Russian oil supplies and optimism about GST reforms lifted sentiment. Sensex gained 676 points, while Nifty rose 246 points, with autos leading sectoral strength.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/123367997.cms",
    "timestamp": "2025-08-18T15:22:38Z"
  },
  {
    "title": "Runaway Texas Dems Officially Throw In The Towel, Return Home To Face Redistricting Vote",
    "description": "After a two-week standoff, Texas Democrats who fled the state to block Republicans’ redistricting plan have finally returned to Austin.",
    "link": "https://dailycaller.com/2025/08/18/runaway-texas-dems-officially-throw-in-the-towel-return-home-to-face-redistricting-vote/",
    "timestamp": "2025-08-18T15:21:06Z"
  },
  {
    "title": "The D Brief: European leaders visit Trump; Summit reax; Armed troops to patrol DC; DOD’s battery plans; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/08/the-d-brief-august-18-2025/407505/",
    "timestamp": "2025-08-18T15:20:48Z"
  },
  {
    "title": "Trump Freaks Out Over Reports He Massively Fumbled Putin Meeting",
    "description": "Donald Trump is furious that the media won’t report on the incredible concessions he’s wrested from Russian President Vladimir Putin—oh wait, there are none. “I am totally convinced that if Russia raised their hands and said, ‘We give up, we concede, we surre…",
    "link": "https://newrepublic.com/post/199205/donald-trump-freaks-reports-putin-meeting",
    "timestamp": "2025-08-18T15:20:07Z"
  },
  {
    "title": "Transgender runner Evie Parts is suing the NCAA and Swarthmore College for their \"intolerant\" expulsion",
    "description": "Long-distance runner Evie Parts sued the NCAA and Swarthmore College for expelling her from the team in an &quot;intolerant&quot; manner. The athlete claims she was illegally kicke",
    "link": "https://www.marca.com/en/more-sports/2025/08/18/68a33e1f268e3e5d3e8b45cb.html",
    "timestamp": "2025-08-18T15:19:23Z"
  },
  {
    "title": "30-Year-Veteran With Three Deployments Launches GOP Bid For Governor In Key Swing State",
    "description": "Republican Pennsylvania State Treasurer Stacy Garrity on Monday launched a campaign to torpedo Democratic Pennsylvania Gov. Josh Shapiro’s reelection bid. Garrity, a two-term state treasurer who served for 30 years in the Army Reserve, released a video on soc…",
    "link": "https://dailycaller.com/2025/08/18/stacy-garrity-pennsylvania-governor-josh-shapiro/",
    "timestamp": "2025-08-18T15:19:18Z"
  },
  {
    "title": "Factbox-What does Ukraine's constitution say about territorial changes?",
    "description": "KYIV (Reuters) -Territorial questions are certain to be a key area of focus when Ukrainian President Volodymyr Zelenskiy and European leaders meet U.S. President Donald Trump for talks on Monday to map out a possible peace deal to end Russia's war in Ukraine.…",
    "link": "https://www.thestar.com.my/news/world/2025/08/18/factbox-what-does-ukraine039s-constitution-say-about-territorial-changes",
    "timestamp": "2025-08-18T15:19:00Z"
  },
  {
    "title": "Armchair investors cautioned on risks of playing Trump tariff market",
    "description": "Amidst the turbulence of stock markets reacting to US President Donald Trump's tariff policies, Dan Buckley, chief analyst at DayTrading.com, has issued a warning to inexperienced online investors about the dangers of attempting to exploit these fluctuations.…",
    "link": "https://biztoc.com/x/52720eac5543d235",
    "timestamp": "2025-08-18T15:18:46Z"
  },
  {
    "title": "EU calls emergency leaders’ summit to follow crunch Trump talks",
    "description": "Europe's top brass will convene on Tuesday after potentially seismic discussions on Russia and Ukraine in Washington on Monday night.",
    "link": "https://www.politico.eu/article/eu-emergency-leaders-summit-antonio-costa-donald-trump-war-in-ukraine-russia/",
    "timestamp": "2025-08-18T15:18:30Z"
  },
  {
    "title": "Hamas agrees to new Gaza ceasefire proposal, source in group says",
    "description": "The proposal from regional mediators would see Israeli hostages released in two batches during a 60-day truce, according to a Palestinian official.",
    "link": "https://www.bbc.co.uk/news/articles/ckgjye15zdlo",
    "timestamp": "2025-08-18T15:18:04Z"
  },
  {
    "title": "Tariff Revenue May Be Hard To Quit, But We’ve Done It Before",
    "description": "Joseph Thorndike overviews 125 years of tariff history throughout which politicians have abandoned productive taxes and tariffs that seemed unfair, unwise, or unpopular.",
    "link": "https://www.forbes.com/sites/taxnotes/2025/08/18/tariff-revenue-may-be-hard-to-quit-but-weve-done-it-before/",
    "timestamp": "2025-08-18T15:16:58Z"
  },
  {
    "title": "Texas Democrats end redistricting walkout after California Democrats move forward with plans to redraw their map",
    "description": "Democratic leaders say they will return for a second special legislative session after seeing California Democratic leaders proceed with plans to redraw their own U.S. House maps to neutralize Republican gains in Texas.",
    "link": "https://www.pbs.org/newshour/politics/texas-democrats-end-redistricting-walkout-after-california-democrats-move-forward-with-plans-to-redraw-their-map",
    "timestamp": "2025-08-18T15:15:23Z"
  },
  {
    "title": "HONESTY FOR 2026 ELECTIONS: How Trump Vows to Reform Voting",
    "description": "President Donald Trump promised another executive order to “bring honesty” to the 2026 midterm elections, when the Republican congressional majority is on the line. It’s... Read More\nThe post HONESTY FOR 2026 ELECTIONS: How Trump Vows to Reform Voting appeare…",
    "link": "https://www.dailysignal.com/2025/08/18/honesty-2026-elections-trump-vows-reform-voting/",
    "timestamp": "2025-08-18T15:15:07Z"
  },
  {
    "title": "Newsmax walloped with $67M settlement for Dominion voting machine 'lies'",
    "description": "Newsmax is on the hook for $67 million for spouting egregious lies about the 2020 presidential election.The right-wing cable network agreed to pay Dominion Voting Systems $27 million this month and another $40 million in the next two years to settle a defamat…",
    "link": "https://www.rawstory.com/newsmax-defamation/",
    "timestamp": "2025-08-18T15:14:58Z"
  },
  {
    "title": "She screams, cries and loses her wig.....and her freedom",
    "description": "BREAKING - Tatiana Martinez, an illegal residing in LA who built a career on social media by doxxing ICE agents and directing her followers to harass them and disrupt their arrests, has now been arrested herself. VIDEO: https://x.com/i/status/1956678880477036…",
    "link": "https://freerepublic.com/focus/f-chat/4335230/posts",
    "timestamp": "2025-08-18T15:14:40Z"
  },
  {
    "title": "Why Donald Trump Thinks Everything Is A National Security Threat",
    "description": "Trump keeps invoking national security to enact his policies — and it's all a ploy to get more power.",
    "link": "https://www.huffpost.com/entry/donald-trump-national-security_n_68a32e22e4b0b028bc35d20c",
    "timestamp": "2025-08-18T15:12:46Z"
  },
  {
    "title": "Factbox-What does Ukraine's constitution say about territorial changes?",
    "description": "KYIV (Reuters) -Territorial questions are certain to be a key area of focus when Ukrainian President Volodymyr Zelenskiy and European leaders meet U.S...",
    "link": "https://ca.news.yahoo.com/factbox-does-ukraines-constitution-territorial-151057690.html",
    "timestamp": "2025-08-18T15:10:57Z"
  },
  {
    "title": "Ukraine's regions occupied by Russia: What you need to know",
    "description": "Diplomatic efforts are underway to settle the war, focusing on five Ukrainian regions occupied by Russia. Russia demands full control of Donetsk and Lugansk in exchange for freezing the southern front in Kherson and Zaporizhzhia, a proposal the US leader is i…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraines-regions-occupied-by-russia-what-you-need-to-know/articleshow/123367862.cms",
    "timestamp": "2025-08-18T15:10:49Z"
  },
  {
    "title": "Rachel Maddow says MSNBC won’t get NBC news ‘leftovers’ anymore under MS NOW: My Source News Opinion World rebrand. ‘It’s gonna be better’",
    "description": "In a recent episode of Pivot, Maddow said “we can apply our own instincts, our own queries, our own priorities, to getting stuff that we need from reporters and correspondents.”",
    "link": "https://fortune.com/2025/08/18/rachel-maddow-msnbc-nbc-ms-now-leftovers/",
    "timestamp": "2025-08-18T15:10:06Z"
  },
  {
    "title": "Iran Issues New War Warning: 'Any Moment'",
    "description": "Iran signals ongoing war readiness with the U.S. and Israel, even as its leadership offers differing assessments.",
    "link": "https://www.newsweek.com/iran-military-official-war-israel-any-moment-2114974",
    "timestamp": "2025-08-18T15:09:36Z"
  },
  {
    "title": "Column: With EUDR and Beyond, the Information Gap Must Be Narrowed",
    "description": "Coffee is about sharing with people — sharing moments, friendships and stories.  I’d like to share the story of a sustainability project in which information was shared among more than...",
    "link": "https://dailycoffeenews.com/2025/08/18/column-with-eudr-and-beyond-the-information-gap-must-be-narrowed/",
    "timestamp": "2025-08-18T15:09:30Z"
  },
  {
    "title": "Trump vows to target mail-in ballots ahead of 2026 midterm election",
    "description": "Donald Trump has pledged to issue an executive order to end mail-in ballots and voting machines before the 2026 midterm elections, a move expected to face legal challenges from states. Trump, who continues to falsely claim victory in the 2020 election, has lo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-vows-to-target-mail-in-ballots-ahead-of-2026-midterm-election/articleshow/123367842.cms",
    "timestamp": "2025-08-18T15:09:15Z"
  },
  {
    "title": "Cable’s MSNBC will change its name later this year as part of corporate divorce from NBC",
    "description": "MSNBC has been building a separate news division from NBC News.",
    "link": "https://www.bostonherald.com/2025/08/18/msnbc-name-change/",
    "timestamp": "2025-08-18T15:09:05Z"
  },
  {
    "title": "Cable’s MSNBC will change its name later this year as part of corporate divorce from NBC",
    "description": "MSNBC has been building a separate news division from NBC News.",
    "link": "https://www.denverpost.com/2025/08/18/msnbc-name-change/",
    "timestamp": "2025-08-18T15:09:05Z"
  },
  {
    "title": "Republicans Plan to Make You Crazy & Throw You in an Asylum",
    "description": "This post contains a video, which you can also view here. To support more videos like this, head to patreon.com/rebecca! Transcript: More than ten years ago, I was the target of a massive hate campaign that started online and moved into the “real world” to th…",
    "link": "https://skepchick.org/2025/08/republicans-plan-to-make-you-crazy-throw-you-in-an-asylum/",
    "timestamp": "2025-08-18T15:08:49Z"
  },
  {
    "title": "White House Reportedly Asks If Zelenskyy Would Wear A Suit For Meeting",
    "description": "The White House reportedly asked Ukrainian President Volodymyr Zelenskyy to wear a suit for his meeting with President Donald Trump",
    "link": "https://dailycaller.com/2025/08/18/white-house-reportedly-asks-if-zelenskyy-would-wear-a-suit-for-meeting/",
    "timestamp": "2025-08-18T15:08:12Z"
  },
  {
    "title": "Jill On Money: Should you buy risky assets in your 401(k)?",
    "description": "Potential changes could be coming to your workplace retirement plan.\nPresident Donald Trump signed an executive order that would pave the way for riskier assets to be included in 401(k) plans. The order asks the Labor Department (DOL), which oversees workplac…",
    "link": "https://biztoc.com/x/0b6783727e4a4d69",
    "timestamp": "2025-08-18T15:07:04Z"
  },
  {
    "title": "Armchair investors cautioned on risks of playing Trump tariff market",
    "description": "Despite the allure of quick profits, Dan Buckley of DayTrading.com called for a cautious approach when trading based on tariff-induced volatility.",
    "link": "https://www.internationalaccountingbulletin.com/news/armchair-investors-cautioned-on-risks/",
    "timestamp": "2025-08-18T15:05:57Z"
  },
  {
    "title": "Trump Wants Cop Violence in Your Feed (The Bulwark)",
    "description": "The Bulwark:\nTrump Wants Cop Violence in Your Feed  —  Plus: How much of the damage of the Alaska summit can Zelensky and the Europeans undo?  —  Volodymyr Zelensky and a host of European leaders have been arriving in D.C. for a series of meetings with Donald…",
    "link": "https://www.memeorandum.com/250818/p49",
    "timestamp": "2025-08-18T15:05:00Z"
  },
  {
    "title": "El Cajon police and state AG’s Office at odds over sharing of surveillance data",
    "description": "California Attorney General Rob Bonta sent a letter to the El Cajon police chief questioning whether the department was violating a state sanctuary law by sharing data from license plate reader systems. The chief insists the sharing is legal.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/08/18/el-cajon-police-and-state-ags-office-at-odds-over-sharing-of-surveillance-data",
    "timestamp": "2025-08-18T15:04:37Z"
  },
  {
    "title": "Tariff uncertainty threatens $490B in US manufacturing investment, report warns",
    "description": "The Joint Economic Committee Minority finds that if economic uncertainty in the U.S. continues as it has over recent months, it could reduce manufacturing investment growth by an average of 13% per year, amounting to approximately $490 billion by 2029.",
    "link": "https://www.foxnews.com/politics/tariff-uncertainty-threatens-490b-us-manufacturing-investment-report-warns",
    "timestamp": "2025-08-18T15:04:21Z"
  },
  {
    "title": "Cable's MSNBC will change its name later this year as part of corporate divorce from NBC",
    "description": "The television network MSNBC will change its name later this year as part of its corporate divorce from NBC",
    "link": "https://www.wftv.com/news/cables-msnbc-will/52LFUGO6GRE63KGXS7S45P3UUM/",
    "timestamp": "2025-08-18T15:04:06Z"
  },
  {
    "title": "EXCLUSIVE: Americans Who Endured Biden’s Vax Discrimination Finally Getting Justice, Trump Official Says",
    "description": "Few federal lawsuits were filed during the Biden era over religious discrimination charges related to COVID-19 vaccine mandates. Now, that's changing.",
    "link": "https://dailycaller.com/2025/08/18/exclusive-americans-discriminated-against-biden-vaccine-mandate-eeoc-official-andrea-lucas/",
    "timestamp": "2025-08-18T15:04:00Z"
  },
  {
    "title": "Newsmax Settles With Dominion Voting Systems—Owes $67 Million For Claiming 2020 Election Fraud",
    "description": "The multimillion-dollar settlement came as President Donald Trump continued to make false claims about voting machine fraud.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/08/18/newsmax-settles-with-dominion-voting-systems-owes-67-million-for-claiming-2020-election-fraud/",
    "timestamp": "2025-08-18T15:03:05Z"
  },
  {
    "title": "Bioethanol plant begins shut-down process",
    "description": "Hull-based Vivergo says all staff will have left and the site will be ready for demolition by the end of the year.",
    "link": "https://www.bbc.com/news/articles/c3v3ey0n71xo",
    "timestamp": "2025-08-18T15:02:48Z"
  },
  {
    "title": "Commonalities In The Disputes Over Data Access And Interchange Fees",
    "description": "The debates over banks’ ability to charge third parties for access to consumer bank data and the regulation of credit card interchange fees share key features.",
    "link": "https://www.forbes.com/sites/patrickgleason/2025/08/18/commonalities-in-the-disputes-over-data-access-and-interchange-fees/",
    "timestamp": "2025-08-18T15:02:06Z"
  },
  {
    "title": "Trump Wants to End Mail-In Ballots and ‘Highly Inaccurate’ Voting Machines",
    "description": "Trump isn't wrong. We've seen too many instances of problems with mail-in ballots and machines.\nThe post Trump Wants to End Mail-In Ballots and ‘Highly Inaccurate’ Voting Machines first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/trump-wants-to-end-mail-in-ballots-and-highly-inaccurate-voting-machines/",
    "timestamp": "2025-08-18T15:00:12Z"
  },
  {
    "title": "Donald Trump: Unionbuster",
    "description": "Sean O’Brien’s bet on Donald Trump has sure paid off for the labor movement! Make no mistake. The Trump administration’s anti-union behavior is not just about federal employees. Donald Trump is not just a boss abusing and degrading his own workers. He’s the p…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/donald-trump-unionbuster",
    "timestamp": "2025-08-18T15:00:00Z"
  },
  {
    "title": "Zelensky to Meet Trump as Europe Rallies Behind Ukraine’s Security Demands",
    "description": "Ukrainian President Volodymyr Zelenskyy, bolstered by the presence of key European allies, is set to meet President Donald Trump in a session that could help decide his embattled nation's future, even as Trump appeared to shift the burden to Zelenskyy to end …",
    "link": "https://oilprice.com/Geopolitics/Europe/Zelensky-to-Meet-Trump-as-Europe-Rallies-Behind-Ukraines-Security-Demands.html",
    "timestamp": "2025-08-18T15:00:00Z"
  }
]