[
  {
    "title": "Department of Homeland Security on track to shut down with lawmakers leaving Washington and an unresolved ICE fight",
    "description": "A bitterly divided Washington is headed for its third government funding lapse of President Donald Trump’s second term — this time, a partial shutdown of the Department of Homeland Security over the issue of federal immigration enforcement.",
    "link": "https://www.cnn.com/2026/02/12/politics/dhs-shutdown-ice-congress",
    "timestamp": "2026-02-12T20:57:01Z"
  },
  {
    "title": "Top Trump antitrust official leaves post following disputes over big mergers",
    "description": "The top antitrust official in the Trump administration is leaving her post amid tension about greenlighting big mergers in recent months",
    "link": "https://abcnews.com/Business/wireStory/top-trump-antitrust-official-leaves-post-disputes-big-130115866",
    "timestamp": "2026-02-12T20:56:07Z"
  },
  {
    "title": "Trump met with David Ellison days before saying he's 'not involved' in Paramount's Netflix battle (Brian Stelter/CNN)",
    "description": "Brian Stelter / CNN:\nTrump met with David Ellison days before saying he's ‘not involved’ in Paramount's Netflix battle  —  Donald Trump Media Corporate news Tech news … Paramount CEO David Ellison returned to the White House last week to meet privately with P…",
    "link": "https://www.memeorandum.com/260212/p94",
    "timestamp": "2026-02-12T20:55:01Z"
  },
  {
    "title": "Sources: Paramount CEO David Ellison met with Trump last week for two conversations; Trump has said he will stay out of Netflix-Paramount competition for WBD (Brian Stelter/CNN)",
    "description": "Brian Stelter / CNN:\nSources: Paramount CEO David Ellison met with Trump last week for two conversations; Trump has said he will stay out of Netflix-Paramount competition for WBD  —  Donald Trump Media Corporate news Tech news … Paramount CEO David Ellison re…",
    "link": "https://mediagazer.com/260212/p19",
    "timestamp": "2026-02-12T20:55:00Z"
  },
  {
    "title": "The EU Lacks Market Competitiveness—and Its Leaders Know",
    "description": "But European officials remain divided on how best to address U.S. unpredictability and Chinese competition.",
    "link": "http://foreignpolicy.com/2026/02/12/european-union-market-trade-us-china-competition-macron-merz-meloni/",
    "timestamp": "2026-02-12T20:53:32Z"
  },
  {
    "title": "The “German Christians” and Apostasy",
    "description": "During the 1930s in Germany some German Protestants declared themselves “German Christians” and openly supported the Nazi Party and Hitler. They declared them a new revelation from God and more than implied that Hitler was a savior, at least of the German peo…",
    "link": "https://www.patheos.com/blogs/rogereolson/2026/02/the-german-christians-and-apostasy/",
    "timestamp": "2026-02-12T20:52:52Z"
  },
  {
    "title": "Elon Confirms Mars Voyage Delayed Again After 'Diablo II' Update",
    "description": "AUSTIN, TX — Humanity's voyage to Mars suffered a significant delay following an admission by SpaceX CEO Elon Musk that he just learned of a new update to Diablo II: Resurrected, and he would be quite busy playing that for the next few years.",
    "link": "https://babylonbee.com/news/elon-confirms-mars-voyage-delayed-again-after-diablo-ii-update",
    "timestamp": "2026-02-12T20:52:07Z"
  },
  {
    "title": "Jeffrey Epstein’s Relationship With High Society",
    "description": "Why the elites kept calling even after the sex crimes conviction.",
    "link": "http://foreignpolicy.com/2026/02/12/epstein-files-tooze-trump-clinton/",
    "timestamp": "2026-02-12T20:51:45Z"
  },
  {
    "title": "‘IT’S F*CKED UP!’ Alex Jones Turns on Trump Over Epstein Cover-Up ‘Death Spiral’",
    "description": "Alex Jones has spent the week warning President Donald Trump that his administration's handling of the Jeffrey Epstein is morally and politically indefensible.\nThe post ‘IT’S F*CKED UP!’ Alex Jones Turns on Trump Over Epstein Cover-Up ‘Death Spiral’ first app…",
    "link": "https://www.mediaite.com/media/news/its-fcked-up-alex-jones-turns-on-trump-over-epstein-cover-up-death-spiral/",
    "timestamp": "2026-02-12T20:49:16Z"
  },
  {
    "title": "EPA ends credits for automatic start-stop vehicle ignition, a feature Zeldin says ‘everyone hates’",
    "description": "The technology automatically shuts down a vehicle’s engine when a driver comes to a complete stop.",
    "link": "https://www.bostonherald.com/2026/02/12/epa-automatic-start-stop-vehicle-ignition/",
    "timestamp": "2026-02-12T20:48:58Z"
  },
  {
    "title": "Factbox-A timeline of Trump’s Minnesota immigration crackdown",
    "description": "By Julia HarteFeb 12 (Reuters) - White House border czar Tom Homan announced on Thursday that U.S. President Donald Trump had agreed to end an immigration-enforcement sur… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/12/factbox-a-timeline-of-trump-s-minnesota-immigration-crackdown",
    "timestamp": "2026-02-12T20:47:31Z"
  },
  {
    "title": "Trump nominates a hospitality executive to lead the National Park Service",
    "description": "President Donald Trump has nominated for director of the National Park Service an executive from a hospitality company that has extensive contracts with the agency he would lead",
    "link": "https://abcnews.com/Politics/wireStory/trump-nominates-hospitality-executive-lead-national-park-service-130115317",
    "timestamp": "2026-02-12T20:45:51Z"
  },
  {
    "title": "Judge Quotes Bob Dylan in Scathing Rebuke of Hegseth’s Bid to Punish Senator",
    "description": "A federal judge rebuked Pete Hegseth's bid to punish Sen. Mark Kelly over a video reminding service members they don't have to follow illegal orders.",
    "link": "http://www.rollingstone.com/politics/politics-news/judge-quotes-bob-dylan-rebuke-hegseth-mark-kelly-1235515514/",
    "timestamp": "2026-02-12T20:45:40Z"
  },
  {
    "title": "Obama Whines On Internet After Watching Trump Kill His Climate Legacy",
    "description": "Former President Obama responded after the Trump administration announced the repeal of his landmark climate regulation known as the Endangerment Finding.",
    "link": "https://dailycaller.com/2026/02/12/obama-whines-internet-trump-kill-climate-legacy/",
    "timestamp": "2026-02-12T20:42:41Z"
  },
  {
    "title": "EPA eliminates credits to automakers for automatic start-stop ignition in vehicles",
    "description": "The Environmental Protection Agency says it is ending credits to automakers who install automatic start-stop ignition systems in their vehicles. The devices are intended to reduce emissions but EPA Administrator Lee Zeldin said “everyone hates\" them. It marks…",
    "link": "https://apnews.com/article/climate-zeldin-automakers-vehicles-consumers-dca74900298e45485987b87c36ac7ef2",
    "timestamp": "2026-02-12T20:42:13Z"
  },
  {
    "title": "EPA eliminates credits to automakers for automatic start-stop ignition in vehicles",
    "description": "The Environmental Protection Agency says it is ending credits to automakers who install automatic start-stop ignition systems in their vehicles",
    "link": "https://www.wpxi.com/news/business/epa-ends-credits/H6MB4CQQLQ7UPFMI7P7AF74UGA/",
    "timestamp": "2026-02-12T20:42:12Z"
  },
  {
    "title": "Apple is the new target for nonsense harassment by Trump’s regulators (but your news org could be next)",
    "description": "On Wednesday afternoon, Donald Trump’s head of the Federal Trade Commission, Andrew Ferguson, sent a ludicrous letter to Apple CEO Tim Cook, threatening to bring the hammer of the federal government down on the tech giant because he doesn’t like its morning e…",
    "link": "https://www.niemanlab.org/2026/02/apple-is-the-new-target-for-nonsense-harassment-by-trumps-regulators-but-your-news-org-could-be-next/",
    "timestamp": "2026-02-12T20:40:24Z"
  },
  {
    "title": "Trump nominates a hospitality executive to lead the National Park Service",
    "description": "The nomination of Scott Socha follows widespread firings within the Park Service.",
    "link": "https://www.bostonherald.com/2026/02/12/national-park-service-director/",
    "timestamp": "2026-02-12T20:38:02Z"
  },
  {
    "title": "Trump nominates a hospitality executive to lead the National Park Service",
    "description": "The nomination of Scott Socha follows widespread firings within the Park Service.",
    "link": "https://www.denverpost.com/2026/02/12/national-park-service-director/",
    "timestamp": "2026-02-12T20:38:02Z"
  },
  {
    "title": "The U.S. Has a Massive Advantage Over the Country I Live In. Trump Is Determined to Squander It.",
    "description": "Some countries have to choose between development and the environment. We don't.",
    "link": "https://slate.com/news-and-politics/2026/02/trump-climate-change-clean-air.html",
    "timestamp": "2026-02-12T20:37:30Z"
  },
  {
    "title": "Judge blocks Trump administration from moving former death row inmates to Colorado’s ‘Supermax’ prison",
    "description": "A federal judge has temporarily blocked the Trump administration from transferring 20 inmates with commuted death sentences to the nation’s highest security federal prison, warning that officials cannot employ a “sham” process for deciding where to incarcerat…",
    "link": "https://www.denverpost.com/2026/02/12/supermax-prison-colorado-inmate-transfer/",
    "timestamp": "2026-02-12T20:37:03Z"
  },
  {
    "title": "Trump criticizes Herzog over Netanyahu pardon, comments on Iran and October 7 attack",
    "description": "Herzog says he will decide on a Netanyahu pardon only after due process, despite Trump’s comments on Iran and the October 7 massacre.",
    "link": "https://www.israelnationalnews.com/news/422353",
    "timestamp": "2026-02-12T20:36:00Z"
  },
  {
    "title": "The Occupying Army Retreats",
    "description": "The announcement of ICE’s withdrawal from Minnesota, like that of the British from Boston 250 years ago, marks a victory for people power.\nThe post The Occupying Army Retreats        appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/12/occupying-army-retreats-ice-minneapolis/",
    "timestamp": "2026-02-12T20:32:05Z"
  },
  {
    "title": "Pam Bondi Admits DOJ Has a Secret Domestic Terrorist List",
    "description": "After the DOJ dodged questions for months, Bondi acknowledged in a House Judiciary Committee hearing that she had a list of targets under NPSM-7.\nThe post Pam Bondi Admits DOJ Has a Secret Domestic Terrorist List appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/02/12/pam-bondi-domestic-terror-list-nspm-7/",
    "timestamp": "2026-02-12T20:30:25Z"
  },
  {
    "title": "Health Secretary Robert F. Kennedy admits he snorted cocaine off toilet seats",
    "description": "The admission came during the Health Secretary's appearance on comedian Theo Von's podcast.",
    "link": "https://www.mlive.com/news/2026/02/trumps-health-secretary-admits-he-used-to-snort-cocaine-off-toilet-seats.html",
    "timestamp": "2026-02-12T20:27:28Z"
  },
  {
    "title": "Analysis: The reasons behind Trump’s ‘preference’ for negotiations with Iran",
    "description": "It’s hard to know whether the three-hour meeting, which went much longer than planned, was filled with consensus. Yet with Netanyahu and Trump, public appearances may be intentional projections designed to camouflage future intentions.",
    "link": "https://www.israelnationalnews.com/news/422351",
    "timestamp": "2026-02-12T20:25:13Z"
  },
  {
    "title": "House speaker condemns Trump Justice Department’s monitoring of lawmaker’s Epstein documents review | CNN Politics",
    "description": "Attorney General Pam Bondi obtained Democratic Rep. Pramila Jayapal’s search history of the unredacted Jeffrey Epstein files and even President Donald Trump’s most powerful ally in Congress has a problem with it.",
    "link": "https://www.cnn.com/2026/02/12/politics/doj-monitoring-lawmaker-epstein-files-searches",
    "timestamp": "2026-02-12T20:21:16Z"
  },
  {
    "title": "Puerto Rico governor signs law to recognize fetus as human being",
    "description": "Puerto Rico’s governor has signed a bill that amends a law to recognize a fetus as a human being",
    "link": "https://abcnews.com/Health/wireStory/puerto-rico-governor-signs-law-recognize-fetus-human-130112776",
    "timestamp": "2026-02-12T20:21:09Z"
  },
  {
    "title": "Judge reads death threats during hearing on Trump decision to end legal protections for Haitians",
    "description": "Roughly 350,000 Haitians are legally living and working in the U.S. under the country’s TPS designation.",
    "link": "https://www.bostonherald.com/2026/02/12/immigration-haiti-tps-hearing/",
    "timestamp": "2026-02-12T20:20:43Z"
  },
  {
    "title": "Federal Judge in Florida Denies BBC’s Motion for Stay, Schedules Trial of Trump’s Defamation Lawsuit Against Broadcaster for February 2027",
    "description": "The ‘Beeb’ still hopes to toss the case out with a ‘motion to dismiss’.\nThe post Federal Judge in Florida Denies BBC’s Motion for Stay, Schedules Trial of Trump’s Defamation Lawsuit Against Broadcaster for February 2027 appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/federal-judge-florida-denies-bbcs-motion-stay-schedules/",
    "timestamp": "2026-02-12T20:20:04Z"
  },
  {
    "title": "Savannah Guthrie Declares She'll 'Never Give Up' in Heartbreaking Video Tribute After Mom Nancy's Shocking Disappearance",
    "description": "Savannah Guthrie shared a video to her Instagram of her mom, Nancy Guthrie, and declared she'll 'never give up' the search for her.",
    "link": "https://radaronline.com/p/savannah-guthrie-instagram-tribute-missing-mom-nancy-never-give-up-search/",
    "timestamp": "2026-02-12T20:18:55Z"
  },
  {
    "title": "WATCH: Schumer speaks after Democrats vote against DHS funding bill, making shutdown likely",
    "description": "A shutdown for the Department of Homeland Security appeared certain Thursday as lawmakers in the House and Senate were set to leave Washington for a 10-day break and negotiations with the White House over Democrats' demands for new restrictions had stalled.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-schumer-speaks-after-democrats-vote-against-dhs-funding-bill-making-shutdown-likely",
    "timestamp": "2026-02-12T20:17:04Z"
  },
  {
    "title": "Trump Plays Risky Political Game on Tariffs Ahead of Midterms",
    "description": "President Donald Trump did himself no favors Wednesday night when he used public calls for retribution to strong-arm most House Republicans into backing his tariff agenda despite widespread voter discontent over the cost of living.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-plays-risky-political-game-on-tariffs-ahead-of-midterms",
    "timestamp": "2026-02-12T20:16:48Z"
  },
  {
    "title": "Mike Whatley: The rodeo clown Roy & his gang WANT",
    "description": "Michael Whatley will be remembered as 2026's Mark Robinson.",
    "link": "https://www.ncspin.com/mike-whatley-the-rodeo-clown-roy-his-gang-want",
    "timestamp": "2026-02-12T20:15:57Z"
  },
  {
    "title": "‘What a Surprise’: Sanders Undeterred by Bezos-Owned Washington Post's Dismissal of AI Data Center Pause",
    "description": "The Washington Post editorial board went to the trouble of marking what it called \"Bernie Sanders' worst idea yet\" on Wednesday, but the progressive US senator shrugged at the label and didn't appear likely to end his push for a moratorium on the construction…",
    "link": "https://www.commondreams.org/news/bernie-sanders-ai",
    "timestamp": "2026-02-12T20:15:15Z"
  },
  {
    "title": "Just enough information voters",
    "description": "When an election is both as close and as catastrophic in its effects as 2024, there’s a lot of counterfactuals to analyze — what mistakes did the Harris campaign make, how did the media coverage affect the campaign, should Biden have dropped out earlier. etc.…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/just-enough-information-voters",
    "timestamp": "2026-02-12T20:12:53Z"
  },
  {
    "title": "After Public Backlash, Tom Homan Says Feds Will End Immigration Enforcement Surge in Minnesota",
    "description": "Homan says the administration isn't backing down from mass deportations, but the reality is that its tactics hit a brick wall of popular resistance in Minnesota.",
    "link": "https://reason.com/2026/02/12/after-public-backlash-tom-homan-says-feds-will-end-immigration-enforcement-surge-in-minneapoliso/",
    "timestamp": "2026-02-12T20:12:42Z"
  },
  {
    "title": "US readying another aircraft carrier for Middle East deployment: Trump",
    "description": "Despite nuclear diplomacy with Iran, US president suggests Washington will send more military assets to the region.",
    "link": "https://www.aljazeera.com/news/2026/2/12/us-readying-another-aircraft-carrier-for-middle-east-deployment-trump",
    "timestamp": "2026-02-12T20:11:44Z"
  },
  {
    "title": "European nations are now being judged on military credibility - and the UK is falling short",
    "description": "A US defence official told NATO that it is not just about how much money a country spends but what the cash is spent on and whether input translates to credible military output.",
    "link": "https://news.sky.com/story/european-nations-are-now-being-judged-not-just-on-how-much-they-spend-but-on-military-credibility-and-the-uk-is-falling-short-13506872",
    "timestamp": "2026-02-12T20:09:00Z"
  },
  {
    "title": "MAGA Reporter Asks Trump If Netanyahu Bears Responsibility For October 7th Attack",
    "description": "A MAGA reporter thanked Donald Trump for getting the Israeli hostages released before asking if Bibi Netanyahu bears responsibility for Oct. 7.\nThe post MAGA Reporter Asks Trump If Netanyahu Bears Responsibility For October 7th Attack first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/maga-reporter-asks-trump-if-netanyahu-bears-responsibility-for-october-7th-attack/",
    "timestamp": "2026-02-12T20:05:33Z"
  },
  {
    "title": "Black Men Endured Sexual Exploitation Under Slavery. Their Story Is Rarely Told.",
    "description": "Historian Thomas A. Foster discusses his new book Rethinking Rufus: Sexual Violations of Enslaved Men.",
    "link": "https://truthout.org/articles/black-men-endured-sexual-exploitation-under-slavery-their-story-is-rarely-told/",
    "timestamp": "2026-02-12T20:02:42Z"
  },
  {
    "title": "IDF Turns to Iranians, Seeks Cooperation in a Rare Message After Trump-Netanyahu Meeting",
    "description": "\"We ask the patriotic people of Iran...\"\nThe post IDF Turns to Iranians, Seeks Cooperation in a Rare Message After Trump-Netanyahu Meeting first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/02/idf-turns-to-iranians-seeks-cooperation-in-a-rare-message-after-trump-netanyahu-meeting/",
    "timestamp": "2026-02-12T20:00:59Z"
  },
  {
    "title": "‘The Voice Of Hind Rajab’ Star & Danny Dyer Cast In Channel 4 Drama About Iranian Embassy Siege",
    "description": "An unlikely acting combo are set to combine in Channel 4 drama The Siege. Danny Dyer and The Voice of Hind Rajab star Motaz Malhees are leading the show about the 1980 Iranian embassy siege in London alongside David Morrissey. The adaptation of Ben Macintyre’…",
    "link": "http://deadline.com/2026/02/channel-4-siege-drama-danny-dyer-motaz-malhees-david-morrissey-1236717210/",
    "timestamp": "2026-02-12T20:00:00Z"
  },
  {
    "title": "Media climate coverage flummoxed by winter’s ups and downs",
    "description": "The author criticizes WRAL for distorting change in the climate while virtually ignoring what the President said.",
    "link": "https://www.ncspin.com/media-climate-coverage-flummoxed-by-winters-ups-and-downs",
    "timestamp": "2026-02-12T19:59:35Z"
  },
  {
    "title": "As Epstein Files Turn Into Partisan Circus, Institutional Power Protects Its Own",
    "description": "Even though Jeffrey Epstein is gone, the machinery that facilitated his crimes remains largely untouched.",
    "link": "https://nolanhigdon.substack.com/p/the-epstein-class",
    "timestamp": "2026-02-12T19:59:28Z"
  },
  {
    "title": "How EPA 'endangerment finding' repeal could impact your wallet",
    "description": "The Trump administration dismantled a key defense in the U.S. fight against climate change. Experts say that may have far-reaching impacts on people's finances.",
    "link": "https://www.cnbc.com/2026/02/12/epa-endangerment-finding-repeal.html",
    "timestamp": "2026-02-12T19:59:21Z"
  },
  {
    "title": "‘Protected speech’: Judge prevents War Department from punishing Mark Kelly for ‘seditious’ comments",
    "description": "Hegseth has proposed review of senator's retirement rank and pay",
    "link": "https://www.wnd.com/2026/02/protected-speech-judge-prevents-war-department-punishing-mark/",
    "timestamp": "2026-02-12T19:58:38Z"
  },
  {
    "title": "Hillary Clinton Takes ICE to German Security Conference Rocked by JD Vance",
    "description": "Failed U.S. Presidential candidate Hillary Clinton was apparently downgraded on Thursday as she travelled to the Munich Security Conference.\nThe post Hillary Clinton Takes ICE to German Security Conference Rocked by JD Vance appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/02/12/hillary-clinton-takes-ice-to-german-security-conference-rocked-by-jd-vance/",
    "timestamp": "2026-02-12T19:58:29Z"
  },
  {
    "title": "As Cuba faces a fuel shortage, this N.L. woman worries for the friends she made on vacation",
    "description": "Cuba is facing fuel and food shortages, and the Canadian government advises against travelling to the Caribbean island unless it's absolutely necessary.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/cuba-nl-travel-9.7086988",
    "timestamp": "2026-02-12T19:57:42Z"
  },
  {
    "title": "Trump Announces ‘Largest Deregulatory Action In American History’",
    "description": "The Trump administration rescinded a cornerstone climate regulation on Thursday,",
    "link": "https://dailycaller.com/2026/02/12/trump-largest-deregulation-american-history-lee-zeldin-epa-endangerment-finding-greenhouse-gas/",
    "timestamp": "2026-02-12T19:56:59Z"
  },
  {
    "title": "The January CPI inflation report is due out Friday morning. Here's what it's expected to show",
    "description": "Investors got some good news this week on the state of the labor market, and more may be on the way Friday on inflation.",
    "link": "https://www.cnbc.com/2026/02/12/the-january-cpi-inflation-report-is-due-out-friday-morning-heres-what-its-expected-to-show.html",
    "timestamp": "2026-02-12T19:55:30Z"
  },
  {
    "title": "Pentagon pushing AI companies to expand on classified networks",
    "description": "Without many standard safeguards.",
    "link": "https://www.itnews.com.au/news/pentagon-pushing-ai-companies-to-expand-on-classified-networks-623589?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Software+feed",
    "timestamp": "2026-02-12T19:55:23Z"
  },
  {
    "title": "Pentagon pushing AI companies to expand on classified networks",
    "description": "Without many standard safeguards.",
    "link": "https://www.itnews.com.au/news/pentagon-pushing-ai-companies-to-expand-on-classified-networks-623589?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+",
    "timestamp": "2026-02-12T19:55:16Z"
  },
  {
    "title": "Bondi Spying On Congressional Epstein Searches Should Be A Major Scandal",
    "description": "Yesterday, Attorney General Pam Bondi appeared before the House Judiciary Committee. Among the more notable exchanges was when Rep. Pramila Jayapal asked some of Jeffrey Epstein’s victims who were in the audience to stand up and indicate whether Bondi’s DOJ h…",
    "link": "https://www.techdirt.com/2026/02/12/bondi-spying-on-congressional-epstein-searches-should-be-a-major-scandal/",
    "timestamp": "2026-02-12T19:55:00Z"
  },
  {
    "title": "Pentagon pushing AI companies to expand on classified networks",
    "description": "Without many standard safeguards.",
    "link": "https://www.itnews.com.au/news/pentagon-pushing-ai-companies-to-expand-on-classified-networks-623589?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Technology+feed",
    "timestamp": "2026-02-12T19:53:40Z"
  },
  {
    "title": "Trump Pleads Ignorance on Lutnick’s Family Outing to Epstein Island: ‘Haven’t Spoken To Him About It’",
    "description": "President Donald Trump told reporters on Thursday that he was not aware that Howard Lutnick visited a private island owned by Jeffrey Epstein.\nThe post Trump Pleads Ignorance on Lutnick’s Family Outing to Epstein Island: ‘Haven’t Spoken To Him About It’ first…",
    "link": "https://www.mediaite.com/media/tv/trump-pleads-ignorance-on-lutnicks-family-outing-to-epstein-island-havent-spoken-to-him-about-it/",
    "timestamp": "2026-02-12T19:53:36Z"
  },
  {
    "title": "Charlie Woods commits to FSU. When does Tiger's son graduate high school?",
    "description": "Charlie Woods, son of Tiger and Elin Nordegren, attends Benjamin School in Florida. So does Kai Trump, whose mom Vanessa is dating golf's GOAT.",
    "link": "https://www.palmbeachpost.com/story/sports/college/golf/2026/02/12/tiger-woods-son-charlie-school-florida-kai-trump-vanessa-graduation/88627220007/",
    "timestamp": "2026-02-12T19:52:51Z"
  },
  {
    "title": "Is Apple News Biased? FTC Warns Tim Cook Over Deceptive Content Curation",
    "description": "U.S. Federal Trade Commission Chairman Andrew N. Ferguson has issued a stern warning to Apple CEO Tim Cook, suggesting the company’s news curation might be breaking federal law. The letter follows reports alleging that Apple News systematically boosts left-le…",
    "link": "https://www.iphoneincanada.ca/2026/02/12/is-apple-news-biased-ftc-warns-tim-cook-over-deceptive-content-curation/",
    "timestamp": "2026-02-12T19:52:01Z"
  },
  {
    "title": "Pentagon pushing AI companies to expand on classified networks",
    "description": "Without many standard safeguards.",
    "link": "https://www.itnews.com.au/news/pentagon-pushing-ai-companies-to-expand-on-classified-networks-623589?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+News+feed",
    "timestamp": "2026-02-12T19:51:53Z"
  },
  {
    "title": "Judge Blasts Hegseth Over Effort to 'Shrink the First Amendment Liberties' of Sen. Mark Kelly",
    "description": "A federal judge delivered a scathing ruling against Defense Secretary Pete Hegseth's effort to punish a Democratic US senator for warning members of the military against following unlawful orders.US District Judge Richard Leon on Thursday granted a preliminar…",
    "link": "https://www.commondreams.org/news/mark-kelly-hegseth-ruling",
    "timestamp": "2026-02-12T19:51:43Z"
  },
  {
    "title": "Trump says Netanyahu should be pardoned for corruption",
    "description": "WASHINGTON, Feb 12 (Reuters) - U.S. President Donald Trump said on Thursday Israeli Prime Minister Benjamin Netanyahu should receive a pardon for corruption charges, sayi… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/12/trump-says-netanyahu-should-be-pardoned-for-corruption",
    "timestamp": "2026-02-12T19:51:32Z"
  },
  {
    "title": "What the EPA's flip on climate change means for automakers",
    "description": "Automakers have long criticized emissions regulations they consider too restrictive. Some auto industry analysts say backing off EVs will isolate America.",
    "link": "https://www.cnbc.com/2026/02/12/epa-climate-change-automakers.html",
    "timestamp": "2026-02-12T19:51:00Z"
  },
  {
    "title": "Misgendering Incident Involving A Trans Olympian Triggers Heated Debate After NBC Deletes Footage",
    "description": "NBC removed Winter Olympic footage after commentators misgendered trans skier Elis Lundholm, igniting heated debate over inclusion in sports.",
    "link": "https://www.boredpanda.com/nbc-misgenders-trans-olympian-and-triggers-heated-debate/",
    "timestamp": "2026-02-12T19:50:47Z"
  },
  {
    "title": "What the Health? From KFF Health News: New Flu Vax? FDA Says No Thanks",
    "description": "It’s been a busy week at the FDA, with a political appointee overruling agency scientists to reject an application for a new flu vaccine. Meanwhile, anti-abortion Republicans on Capitol Hill complain the agency is dragging its feet on reviewing the abortion p…",
    "link": "https://kffhealthnews.org/news/podcast/what-the-health-433-fda-flu-vaccine-rejected-moderna-abortion-pill-february-12-2026/",
    "timestamp": "2026-02-12T19:50:00Z"
  },
  {
    "title": "One year after DOGE cuts, former federal workers find new roles",
    "description": "Nonprofit Work for America is helping to place former federal workers in new roles in state and local government, after the largest reduction in the federal workforce in history.",
    "link": "https://www.cnbc.com/2026/02/12/after-doge-cuts-federal-workers-new-roles.html",
    "timestamp": "2026-02-12T19:49:28Z"
  },
  {
    "title": "Trump's EPA revokes scientific finding that underpinned US fight against climate change",
    "description": "The EPA also said it will propose a two-year delay to a Biden-era rule restricting greenhouse gas emissions by cars and light trucks.",
    "link": "https://www.boston.com/news/environment/2026/02/12/trumps-epa-revokes-scientific-finding-that-underpinned-us-fight-against-climate-change/",
    "timestamp": "2026-02-12T19:47:31Z"
  },
  {
    "title": "The ATF Created a Backdoor Gun Registry. Lawmakers Want an Explanation.",
    "description": "Members of Congress want answers about a gun registry database that could threaten the liberty and privacy of firearms owners.",
    "link": "https://reason.com/2026/02/13/the-atf-created-a-backdoor-gun-registry-lawmakers-want-an-explanation/",
    "timestamp": "2026-02-12T19:46:22Z"
  },
  {
    "title": "British Indians have continually helped British economy prosper since WWII: Report",
    "description": "UK News: LONDON: A white paper published by the Aston India Centre has shown how Indian migrants to the UK have repeatedly helped transform the British economy.",
    "link": "https://timesofindia.indiatimes.com/world/uk/british-indians-have-continually-helped-british-economy-prosper-since-wwii-report/articleshow/128273774.cms",
    "timestamp": "2026-02-12T19:45:26Z"
  },
  {
    "title": "Daughter-in-law, mother-in-law duo to helm Agarwada panchayat",
    "description": "Mapusa: Agarwada-Chopdem panchayat has ushered in a new leadership chapter with a daughter-in-law and mother-in-law duo taking the top two posts of th.",
    "link": "https://timesofindia.indiatimes.com/city/goa/daughter-in-law-mother-in-law-duo-to-helm-agarwada-panchayat/articleshow/128274379.cms",
    "timestamp": "2026-02-12T19:45:09Z"
  },
  {
    "title": "Trump nominates White House lawyer to trade court that could decide details of any tariff refunds (Ari Hawkins/Politico)",
    "description": "Ari Hawkins / Politico:\nTrump nominates White House lawyer to trade court that could decide details of any tariff refunds … President Donald Trump on Thursday tapped one of his White House lawyers to fill a vacancy on the U.S. Court of International Trade, a …",
    "link": "https://www.memeorandum.com/260212/p79",
    "timestamp": "2026-02-12T19:45:01Z"
  },
  {
    "title": "Trump State Department nominee says he won't stop posting on social media (Gregory Svirnovskiy/Politico)",
    "description": "Gregory Svirnovskiy / Politico:\nTrump State Department nominee says he won't stop posting on social media  —  President Donald Trump's nominee for a high-ranking State Department post told the Senate Foreign Relations Committee on Thursday he will not stop ma…",
    "link": "https://www.memeorandum.com/260212/p78",
    "timestamp": "2026-02-12T19:45:01Z"
  },
  {
    "title": "Trump dismantles legal basis for US climate rules",
    "description": "US President Donald Trump has revoked the 2009 “endangerment finding” that forms the legal basis for US greenhouse gas regulations, a move expected to face immediate court challenges.",
    "link": "https://www.channelnewsasia.com/world/trump-us-climate-greenhouse-gas-environment-agency-scientific-findings-5927656",
    "timestamp": "2026-02-12T19:45:00Z"
  },
  {
    "title": "Will weather delay Daytona 500? How often has rain held up the 'Great American Race'",
    "description": "Tennessee fans know the Daytona 500 is more than just a race — and anything can happen. Here's the weather forecast in Daytona.",
    "link": "https://www.tennessean.com/story/sports/nascar/2026/02/12/daytona-500-weather-forecast-rain-delay-florida/88640892007/",
    "timestamp": "2026-02-12T19:44:39Z"
  },
  {
    "title": "What we know about fatal shooting of Lucy Harrison after 'big argument' with dad about Trump",
    "description": "Harrison died after her father's gun went off in his hands. A Texas grand jury declined to indict him in connection with the shooting in 2025.",
    "link": "https://www.snopes.com//news/2026/02/12/dad-shoots-daughter-texas-lucy-harrison/",
    "timestamp": "2026-02-12T19:44:00Z"
  },
  {
    "title": "The Pam Bondi Hearing Sh*tshow Was a Perfect Display of a Broken Government",
    "description": "Pam Bondi's hearing was the latest and best proof that the government is broken. Not in the dramatic, smash-the-glass sense, but in the way that matters more\nThe post The Pam Bondi Hearing Sh*tshow Was a Perfect Display of a Broken Government first appeared o…",
    "link": "https://www.mediaite.com/opinion/the-pam-bondi-hearing-shtshow-was-a-perfect-display-of-a-broken-government/",
    "timestamp": "2026-02-12T19:43:42Z"
  },
  {
    "title": "Crypto PAC Fairshake seeks to force resistant Texas Democrat Al Green from U.S. House",
    "description": "The super PAC is devoting $1.5 million to get Representative Al Green, a Democrat critical of the crypto industry, defeated by a primary challenger.",
    "link": "https://www.coindesk.com/policy/2026/02/12/crypto-pac-fairshake-seeks-to-force-resistant-texas-democrat-al-green-from-u-s-house",
    "timestamp": "2026-02-12T19:43:26Z"
  },
  {
    "title": "Firefighters must be fit, says CM at launch of new Valpoi building",
    "description": "Valpoi: Physical fitness is essential for firefighters to perform their duties effectively, said chief minister Pramod Sawant after inaugurating a new.",
    "link": "https://timesofindia.indiatimes.com/city/goa/firefighters-must-be-fit-says-cm-at-launch-of-new-valpoi-building/articleshow/128274325.cms",
    "timestamp": "2026-02-12T19:43:22Z"
  },
  {
    "title": "Dhavali pipeline rupture affects water supply to parts of Ponda",
    "description": "Ponda: With the rupture to the main distribution pipeline at Dhavali, water supply to Kavlem, Ramnathi, Bandora villages and parts of Ponda town, incl.",
    "link": "https://timesofindia.indiatimes.com/city/goa/dhavali-pipeline-rupture-affects-water-supply-to-parts-of-ponda/articleshow/128274307.cms",
    "timestamp": "2026-02-12T19:43:10Z"
  },
  {
    "title": "Kushavati holds first forest rights meet",
    "description": "Margao: The newly constituted district-level committee of Kushavati district convened its first meeting on Wednesday to review Forest Rights Act, 2006.",
    "link": "https://timesofindia.indiatimes.com/city/goa/kushavati-holds-first-forest-rights-meet/articleshow/128274282.cms",
    "timestamp": "2026-02-12T19:43:03Z"
  },
  {
    "title": "HC junks plea on AGMUT rules for appointing officers in the IPS cadre",
    "description": "Panaji: The Bombay high court dismissed a petition by citizen Sudip Tamankar, seeking directions to authorities to implement the Arunachal Pradesh-Goa.",
    "link": "https://timesofindia.indiatimes.com/city/goa/hc-junks-plea-on-agmut-rules-for-appointing-officers-in-the-ips-cadre/articleshow/128274232.cms",
    "timestamp": "2026-02-12T19:42:58Z"
  },
  {
    "title": "Mauvin accuses GMR of pressurising Navy to take over Dabolim airport",
    "description": "Vasco: Transport minister Mauvin Godinho on Thursday accused the airport operator GMR of pressurising and “lobbying” the Indian Navy to take over Dabo.",
    "link": "https://timesofindia.indiatimes.com/city/goa/mauvin-accuses-gmr-of-pressurising-navy-to-take-over-dabolim-airport/articleshow/128274204.cms",
    "timestamp": "2026-02-12T19:42:49Z"
  },
  {
    "title": "Two cheated of Rs 4.1 lakh after downloading APK files",
    "description": "Vasco: Two persons from Vasco fell victim to online frauds after downloading Android package kit (APK) files and transferring Rs 4.1 lakh to unidentif.",
    "link": "https://timesofindia.indiatimes.com/city/goa/two-cheated-of-rs-4-1-lakh-after-downloading-apk-files/articleshow/128274304.cms",
    "timestamp": "2026-02-12T19:41:02Z"
  },
  {
    "title": "Trump revokes basis of US climate regulation, ends vehicle emission standards",
    "description": "By Valerie VolcoviciWASHINGTON, Feb 12 (Reuters) - The administration of President Donald Trump on Thursday announced the repeal of a scientific finding that greenhouse g… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/12/trump-revokes-basis-of-us-climate-regulation-ends-vehicle-emission-standards",
    "timestamp": "2026-02-12T19:40:43Z"
  },
  {
    "title": "Cabinet may clear infra projects over 40k crore, including Rs 19k crore tunnel through Brahmaputra in poll-bound Assam",
    "description": "India News: NEW DELHI: Cabinet is likely to approve over half a dozen infrastructure projects on Friday worth over Rs 40,000 crore, including nearly Rs 19,000 cro.",
    "link": "https://timesofindia.indiatimes.com/india/cabinet-may-clear-infra-projects-over-40k-crore-including-rs-19k-crore-tunnel-through-brahmaputra-in-poll-bound-assam/articleshow/128274098.cms",
    "timestamp": "2026-02-12T19:39:52Z"
  },
  {
    "title": "Epstein’s Ghost Haunts Trump’s White House",
    "description": "Tara Palmeri: “Donald Trump thought he’d cut ties with Jeffrey Epstein years ago. But the deceased financier’s shadow lurks across an administration struggling to outrun its own history.”",
    "link": "https://politicalwire.com/2026/02/12/epsteins-ghost-haunts-trumps-white-house/",
    "timestamp": "2026-02-12T19:39:34Z"
  },
  {
    "title": "BABBLES: Will Nepal Rise Again?",
    "description": "By Babbler   The continued rise in the trade deficit, the widening gap between imports and exports, increasing foreign […]\nThe post BABBLES: Will Nepal Rise Again? appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2026/02/13/babbles-will-nepal-rise-again/",
    "timestamp": "2026-02-12T19:39:00Z"
  },
  {
    "title": "Cash laundering proceedings against land grab accused begin",
    "description": "Panaji: The Enforcement Directorate (ED), Panaji zonal office, has said that the prime accused in the Goa land grab cases, Mohammed Suhail, was produc.",
    "link": "https://timesofindia.indiatimes.com/city/goa/cash-laundering-proceedings-against-land-grab-accused-begin/articleshow/128274236.cms",
    "timestamp": "2026-02-12T19:38:52Z"
  },
  {
    "title": "What repealing the ‘endangerment finding’ means for public health",
    "description": "The EPA has scrapped a rule stating that climate change harms human health. Here’s what that could mean",
    "link": "https://www.scientificamerican.com/article/what-repealing-the-endangerment-finding-means-for-public-health/",
    "timestamp": "2026-02-12T19:38:00Z"
  },
  {
    "title": "Imposter says he is GSPCB official, cheats club of Rs 14L",
    "description": "Panaji: Anjuna police have registered an FIR against Suraj Pendse for posing as an official of the Goa State Pollution Control Board (GSPCB) and cheat.",
    "link": "https://timesofindia.indiatimes.com/city/goa/imposter-says-he-is-gspcb-official-cheats-club-of-rs-14l/articleshow/128274203.cms",
    "timestamp": "2026-02-12T19:37:15Z"
  },
  {
    "title": "Trump Defends Obama Ape Video When Confronted in White House Presser: ‘Very Strong Piece’",
    "description": "\"That was a video on, as you know, voter fraud, and a fairly long video, and they had a little piece that had to do with 'The Lion King.'\"\nThe post Trump Defends Obama Ape Video When Confronted in White House Presser: ‘Very Strong Piece’ first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/trump-defends-obama-ape-video-when-confronted-in-white-house-presser-very-strong-piece/",
    "timestamp": "2026-02-12T19:36:23Z"
  },
  {
    "title": "Verem temple burgled, at least 30k missing from donation boxes",
    "description": "Calangute: The Shree Shantadurga temple, along the busy Candolim road at Ambekhan Vaddo, Verem, was broken into by four unidentified thieves in the ea.",
    "link": "https://timesofindia.indiatimes.com/city/goa/verem-temple-burgled-at-least-30k-missing-from-donation-boxes/articleshow/128274144.cms",
    "timestamp": "2026-02-12T19:35:58Z"
  },
  {
    "title": "In one swoop, Trump kills US greenhouse gas regulations",
    "description": "The Trump administration just eliminated the landmark finding that has underpinned federal regulations on planet-heating pollution since 2009. For nearly the past two decades, the \"endangerment finding\" has allowed the Environmental Protection Agency (EPA) to…",
    "link": "https://www.theverge.com/science/877371/trump-carbon-pollution-endangerment-finding-repeal-climate-change",
    "timestamp": "2026-02-12T19:35:41Z"
  }
]