[
  {
    "title": "Supreme Court grants unusually quick hearing on whether Trump has power to impose sweeping tariffs",
    "description": "The tariffs will remain in place in the lead-up to arguments set for November, a lightning-fast timetable by the Supreme Court's typical standards.",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-grants-unusually-quick-hearing-on-whether-trump-has-power-to-impose-sweeping-tariffs",
    "timestamp": "2025-09-09T21:24:14Z"
  },
  {
    "title": "No New World Order Here",
    "description": "China’s military parade was just another display of a long-standing relationship.",
    "link": "http://foreignpolicy.com/2025/09/09/china-military-parade-russia-north-korea-xi-putin-kim/",
    "timestamp": "2025-09-09T21:21:23Z"
  },
  {
    "title": "Disturbing views of Kamala Harris' voters on having children revealed: 'Extinction event'",
    "description": "New polling released by NBC has revealed some eye-opening statistics about the gender and political divides of Generation Z. While ranking over a dozen options of scenarios on their importance to an individual's definition of personal success, male Donald Tru…",
    "link": "https://freerepublic.com/focus/f-chat/4339430/posts",
    "timestamp": "2025-09-09T21:18:07Z"
  },
  {
    "title": "As Incriminating Evidence Mounts, Trump Calls Epstein 'A Dead Issue'",
    "description": "Mr. President, this one is very much alive.",
    "link": "https://www.huffpost.com/entry/trump-epstein-dead-issue_n_68c07fa0e4b059d8ed360fea",
    "timestamp": "2025-09-09T21:17:30Z"
  },
  {
    "title": "Michigan judge tosses case against 15 accused fake electors",
    "description": "A Michigan judge has dismissed the criminal cases against 15 people accused of acting falsely as electors for President Donald Trump in the 2020 election.",
    "link": "https://www.cbsnews.com/detroit/news/michigan-judge-tosses-case-accused-fake-electors-trump-2020/",
    "timestamp": "2025-09-09T21:16:57Z"
  },
  {
    "title": "Trump faces 'real problems' as data shows US 'might be due' for recession: NYT journalist",
    "description": "CNN contributor and New York Times podcast host Lulu Garcia-Navarro warned on Tuesday that President Donald Trump is taking a \"double-edged\" sword to the economy, as evidenced by the latest job numbers. The Department of Labor published data on Tuesday that r…",
    "link": "https://www.rawstory.com/trump-economy-2673976723/",
    "timestamp": "2025-09-09T21:16:25Z"
  },
  {
    "title": "Trump Releases Powerful Video on Iryna Zarutska Murder: 'We Have to Be Vicious, Just Like They Are'",
    "description": "Trump Releases Powerful Video on Iryna Zarutska Murder: 'We Have to Be Vicious, Just Like They Are'westernjournal.com",
    "link": "https://www.westernjournal.com/trump-releases-powerful-video-iryna-zarutska-murder-vicious-just-like/",
    "timestamp": "2025-09-09T21:15:41Z"
  },
  {
    "title": "Chief justice keeps Trump funding freeze in place for now",
    "description": "Chief Justice John Roberts acted on the Trump administration's emergency appeal to the Supreme Court in a case involving billions of dollars in congressionally approved aid.",
    "link": "https://www.pbs.org/newshour/politics/chief-justice-keeps-trump-funding-freeze-in-place-for-now",
    "timestamp": "2025-09-09T21:15:08Z"
  },
  {
    "title": "Trump’s new judge pick: True constitutionalist or hidden Democrat?",
    "description": "President Donald Trump's nomination of Assistant U.S. Attorney Rebecca Taibleson for the Seventh Circuit Court of Appeals has prompted questions about the extent of her alignment with the administration's conservative values, particularly in light of her and …",
    "link": "https://www.theblaze.com/news/trumps-new-judge-pick-true-constitutionalist-or-hidden-democrat",
    "timestamp": "2025-09-09T21:15:00Z"
  },
  {
    "title": "JPMorgan CEO Jamie Dimon warns US economy is ‘weakening’ after jobs revision",
    "description": "The head of the nation's largest bank said the \"big revision\" pointed to stuttering US growth.",
    "link": "https://nypost.com/2025/09/09/business/jpmorgan-ceo-jamie-dimon-warns-us-economy-is-weakening-after-jobs-revision/",
    "timestamp": "2025-09-09T21:14:16Z"
  },
  {
    "title": "After Israel’s strike on Doha, is Moscow the last mediator?",
    "description": "A Russian expert explains how Moscow and Beijing can help solve the unresolvable war between Israel and Hamas  Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624381-after-israels-strike-on-doha/",
    "timestamp": "2025-09-09T21:13:39Z"
  },
  {
    "title": "Todd Chrisley Explains Why He’s Not Trying To Fix The Rift Between His Kids Savannah And Chase",
    "description": "The head of the Chrisley family has spoken.",
    "link": "https://www.cinemablend.com/television/todd-chrisley-explains-why-not-fixing-rift-between-savannah-chase",
    "timestamp": "2025-09-09T21:12:05Z"
  },
  {
    "title": "7NEWS live updates: Body found in national park",
    "description": "Follow along as we bring you all of the latest news on crime, traffic and weather.",
    "link": "https://7news.com.au/news/7news-live-updates-body-found-in-national-park-vigil-held-for-victims-of-cobblebank-stabbing-c-19967921",
    "timestamp": "2025-09-09T21:12:00Z"
  },
  {
    "title": "White House reiterates denial Trump authored Epstein letter",
    "description": "WASHINGTON: The White House continued to deny on Tuesday (Sep 9) that President Donald Trump had authored a lewd birthday letter to disgraced financier Jeffrey Epstein, after the alleged note was pub",
    "link": "https://www.channelnewsasia.com/world/white-house-reiterates-denial-trump-authored-epstein-letter-5340866",
    "timestamp": "2025-09-09T21:11:30Z"
  },
  {
    "title": "MAGA Congressman Explains Trump’s Signature in Epstein Birthday Book by Floating Autopen Conspiracy",
    "description": "What's the deal with that freaky letter?",
    "link": "https://gizmodo.com/maga-congressman-trump-signature-epstein-birthday-book-autopen-conspiracy-2000656258",
    "timestamp": "2025-09-09T21:10:58Z"
  },
  {
    "title": "RFK Jr.’s Report Unveils Plan to Make America’s Children Healthy Again",
    "description": "DAILY CALLER NEWS FOUNDATION—President Donald Trump’s top health officials unveiled a sweeping Make America Healthy Again agenda in a new 20-page report Tuesday. The report identifies... Read More\nThe post RFK Jr.’s Report Unveils Plan to Make America’s Child…",
    "link": "https://www.dailysignal.com/2025/09/09/trump-admin-unveils-plan-make-americas-children-healthy-again/",
    "timestamp": "2025-09-09T21:10:00Z"
  },
  {
    "title": "Leavitt Cites Funniest “Handwriting Experts” on Trump Signature",
    "description": "As the White House flailingly denies the authenticity of Donald Trump’s lewd 2003 birthday note to his then-friend Jeffrey Epstein, Press Secretary Karoline Leavitt is, apparently, just creating evidence out of whole cloth.Since the letter was released Monday…",
    "link": "https://newrepublic.com/post/200223/leavitt-handwriting-experts-trump-signature-epstein-letter",
    "timestamp": "2025-09-09T21:09:47Z"
  },
  {
    "title": "Supreme Court to quickly consider if President Donald Trump has power to impose sweeping tariffs",
    "description": "The Supreme Court is granting an unusually quick hearing on whether President Donald Trump has the power under federal law to impose sweeping tariffs.",
    "link": "https://www.clickorlando.com/news/politics/2025/09/09/supreme-court-to-quickly-consider-if-president-donald-trump-has-power-to-impose-sweeping-tariffs/",
    "timestamp": "2025-09-09T21:08:24Z"
  },
  {
    "title": "Trump calls release of suggestive note to sex offender Jeffrey Epstein a ‘dead issue’",
    "description": "US president has repeatedly dismissed Epstein files as a ‘Democrat hoax’",
    "link": "https://www.irishtimes.com/world/us/2025/09/09/trump-calls-release-of-suggestive-note-to-sex-offender-jeffrey-epstein-a-dead-issue/",
    "timestamp": "2025-09-09T21:07:17Z"
  },
  {
    "title": "Supreme Court to Review Trump Tariffs on Fast-Track Schedule",
    "description": "The US Supreme Court said it will decide whether the bulk of President Donald Trump’s tariffs are legal, agreeing to quickly review a challenge to his signature economic policy in a case with worldwide financial and political implications.",
    "link": "https://financialpost.com/pmn/business-pmn/supreme-court-to-review-trump-tariffs-on-fast-track-schedule",
    "timestamp": "2025-09-09T21:06:38Z"
  },
  {
    "title": "Trump Announces New Nationwide Rules for Prayer in Public Schools",
    "description": "resident Donald Trump announced on Monday at an event at the Museum of the Bible in Washington, D.C., that the Department of Education will soon be issuing new guidance regarding prayer in public schools. Speaking at the second hearing of the Religious Libert…",
    "link": "https://freerepublic.com/focus/f-news/4339428/posts",
    "timestamp": "2025-09-09T21:06:32Z"
  },
  {
    "title": "'He's a nut': Republicans turn on Trump attack dog who got 'too big for his britches'",
    "description": "Republican lawmakers are reportedly fed up with housing official Bill Pulte and view him as \"a nut,\" Politico reports.The Trump administration's Federal Housing Finance Agency director is now at the center of President Donald Trump's heated campaign against t…",
    "link": "https://www.rawstory.com/trump-2673976667/",
    "timestamp": "2025-09-09T21:06:03Z"
  },
  {
    "title": "Israel attacks Qatar, provoking international condemnation",
    "description": "Hamas says Israeli attacks on Qatar's capital of Doha 'failed to assassinate' any of its members, and Anthony Albanese heads to the Solomon Islands for climate talks.\nThe post Israel attacks Qatar, provoking international condemnation appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/09/10/israel-strike-doha-qatar-anthony-albanese-pacific-islands-forum/",
    "timestamp": "2025-09-09T21:05:11Z"
  },
  {
    "title": "Trump directed top aide to warn Qatar that Israel attack was coming, White House says (Reuters)",
    "description": "Reuters:\nTrump directed top aide to warn Qatar that Israel attack was coming, White House says  —  U.S. President Donald Trump feels “very badly” about Israel's strike on Hamas targets in Qatar and directed a top aide, Steve Witkoff, to warn Qatar the attack …",
    "link": "https://www.memeorandum.com/250909/p124",
    "timestamp": "2025-09-09T21:05:00Z"
  },
  {
    "title": "Ronda Rousey spurns Trump’s White House UFC event",
    "description": "Retired MMA fighter and UFC champion previously endorsed Democratic socialist Bernie Sanders during the 2016 presidential race",
    "link": "https://www.the-independent.com/sport/ronda-rousey-trump-white-house-ufc-fight-b2823329.html",
    "timestamp": "2025-09-09T21:04:47Z"
  },
  {
    "title": "Democrats Zero In On Key Demand For Keeping Government Open",
    "description": "Senate Democrats have leverage to try to roll back some of Trump’s policies and attacks on the rule of law. It's not clear yet if they plan to use it.",
    "link": "https://www.huffpost.com/entry/democrats-shutdown-trump_n_68c0847ce4b057cde437a25e",
    "timestamp": "2025-09-09T21:04:39Z"
  },
  {
    "title": "In the West Point drama, Trump recasts Tom Hanks from war film icon to ‘woke’ MAGA avatar",
    "description": "President Donald Trump celebrated a West Point alumni group's decision to cancel an awards ceremony that would have honored actor Tom Hanks.",
    "link": "https://biztoc.com/x/47aed98b438ee962",
    "timestamp": "2025-09-09T21:04:05Z"
  },
  {
    "title": "Trump said to have asked EU to hit China, India with 100% tariffs",
    "description": "United States President Donald Trump has asked the European Union to slap China and India with 100% tariffs, in order to put the heat on Russia to end its war in Ukraine, the Financial Times reported,...",
    "link": "https://biztoc.com/x/21650864b7b55133",
    "timestamp": "2025-09-09T21:04:05Z"
  },
  {
    "title": "Former reality TV star joins Trump administration official to blast Newsom, Bass over wildfire response",
    "description": "Former \"Hills\" cast member Spencer Pratt supports a Republican congressional investigation into California wildfire response and rebuilding delays.",
    "link": "https://www.foxnews.com/media/former-reality-tv-star-joins-trump-admin-official-blast-newsom-bass-over-wildfire-response",
    "timestamp": "2025-09-09T21:04:05Z"
  },
  {
    "title": "Supreme Court to quickly consider if President Donald Trump has power to impose sweeping tariffs",
    "description": "WASHINGTON — The Supreme Court on Tuesday granted an unusually quick hearing on whether President Donald Trump has the power to impose sweeping tariffs under federal law.\nThe justices will hear arguments in November, lightning fast by the typical standards of…",
    "link": "https://biztoc.com/x/837d6237bcfc5293",
    "timestamp": "2025-09-09T21:04:04Z"
  },
  {
    "title": "Gasoline's hit to Americans' wallets expected to hit a 20-year low",
    "description": "Spending on gasoline will average less than 2 percent of drivers' disposable income this year, the Energy Information Administration predicted in a bit of welcome economic news for President Donald Trump.",
    "link": "https://biztoc.com/x/09205a31a7b42729",
    "timestamp": "2025-09-09T21:03:49Z"
  },
  {
    "title": "Trump's Approval Rating With Millennials Is Surging: Polls",
    "description": "The volatile nature of approval polls can paint a picture of the political landscape heading into 2026 midterm elections.",
    "link": "https://www.newsweek.com/trumps-approval-rating-millennials-surging-polls-2127252",
    "timestamp": "2025-09-09T21:03:18Z"
  },
  {
    "title": "Democrat D.A. pushed racial equity as crime spiked before horrific slaughter of Iryna Zarutska",
    "description": "'When people talk about me being reformed minded, I take that as a compliment'",
    "link": "https://www.wnd.com/2025/09/democrat-d-pushed-racial-equity-as-crime-spiked/",
    "timestamp": "2025-09-09T21:02:48Z"
  },
  {
    "title": "EXCLUSIVE: Left-Wing Activists Gripe As Kennedy Center Promotes Employees Who Are Actually Doing Their Jobs",
    "description": "Richard Grenell promoted over a dozen high performing Kennedy Center staff, and the left immediately began whining about the new leadership.",
    "link": "https://dailycaller.com/2025/09/09/kennedy-center-internal-promotions-high-performers-richard-grenell-performing-arts-political-activists/",
    "timestamp": "2025-09-09T21:01:52Z"
  },
  {
    "title": "Supreme Court Once Again Bends To Trump’s Will",
    "description": "Is the Supreme Court about to bless Trump’s trade war with the world?",
    "link": "https://www.huffpost.com/entry/supreme-court-trump-tariff-war_n_68c03971e4b04bc9f025b613",
    "timestamp": "2025-09-09T21:01:31Z"
  },
  {
    "title": "Michigan Judge Dismisses Charges Against ‘Fake Electors’ for Trump",
    "description": "\"This is a fraud case, and we have to prove intent. And I don't believe there's evidence sufficient to prove intent.\"\nThe post Michigan Judge Dismisses Charges Against ‘Fake Electors’ for Trump first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/michigan-judge-dismisses-charges-against-fake-electors-for-trump/",
    "timestamp": "2025-09-09T21:00:39Z"
  },
  {
    "title": "Supreme Court to quickly consider if President Donald Trump has power to impose sweeping tariffs (Lindsay Whitehurst/Associated Press)",
    "description": "Lindsay Whitehurst / Associated Press:\nSupreme Court to quickly consider if President Donald Trump has power to impose sweeping tariffs  —  The Supreme Court on Tuesday granted an unusually quick hearing on whether President Donald Trump has the power to impo…",
    "link": "https://www.memeorandum.com/250909/p123",
    "timestamp": "2025-09-09T21:00:31Z"
  },
  {
    "title": "Trump grovels to Qatar after admitting he was powerless to stop Israel's attack",
    "description": "President Donald Trump revealed that the U.S. military discovered Israel's plan to strike Hamas officials in Qatar after it was \"too late to stop the attack.\"In a Tuesday post on Truth Social, Trump suggested he had no control over Israeli Prime Minister Benj…",
    "link": "https://www.rawstory.com/trump-qatar-israel/",
    "timestamp": "2025-09-09T21:00:03Z"
  },
  {
    "title": "Is Susan Collins toast?",
    "description": "She has a track record of massive overperformance, but is facing her toughest environment yet.",
    "link": "https://www.natesilver.net/p/is-susan-collins-toast",
    "timestamp": "2025-09-09T21:00:02Z"
  },
  {
    "title": "Supreme Court to quickly weigh President Donald Trump's power to impose sweeping tariffs",
    "description": "The small businesses and states that challenged the tariffs in court also agreed to the accelerated timetable.",
    "link": "https://roanoke.com/news/nation-world/business/article_d1a76a88-a9a0-5b6e-a6e1-7d183a023c09.html",
    "timestamp": "2025-09-09T21:00:00Z"
  },
  {
    "title": "Elon Musk pushes for Conor McGregor to 'save Ireland' as country's president",
    "description": "Elon Musk backed UFC fighter Conor McGregor’s bid for Irish president after officials tried to block his independent run through nomination rules.",
    "link": "https://www.foxnews.com/sports/elon-musk-pushes-conor-mcgregor-save-ireland-countrys-president",
    "timestamp": "2025-09-09T20:59:38Z"
  },
  {
    "title": "Supreme Court Agrees To Quickly Review Trump’s Tariffs",
    "description": "The Supreme Court agreed Tuesday to quickly decide questions surrounding President Donald Trump's tariffs.",
    "link": "https://dailycaller.com/2025/09/09/supreme-court-agrees-to-quickly-review-trumps-tarriffs/",
    "timestamp": "2025-09-09T20:57:31Z"
  },
  {
    "title": "LeBron James writes op-ed in People’s Daily, mouthpiece newspaper of Communist Party, as NBA aims to rebuild in China",
    "description": "LeBron's op-ed comes as leaders in China and the U.S. seek options to avert a potential trade showdown between the world's two biggest economies. U.S. President Donald Trump has threatened to impose steep tariffs on China, which has said it would respond with…",
    "link": "https://indianexpress.com/article/sports/basketball/lebron-james-op-ed-peoples-daily-mouthpiece-china-nba-10240595/",
    "timestamp": "2025-09-09T20:57:23Z"
  },
  {
    "title": "WATCH: Kennedy says NIH is studying possible causes of U.S. gun violence",
    "description": "PBS News’ Lisa Desjardins asked the health secretary if there was any discussion of mental health and firearms, and looking at the health of children in relation to firearms, when working toward this new report.",
    "link": "https://www.pbs.org/newshour/health/watch-kennedy-says-nih-is-studying-possible-causes-of-u-s-gun-violence",
    "timestamp": "2025-09-09T20:57:03Z"
  },
  {
    "title": "Supreme Court to decide if Trump's global tariffs are legal",
    "description": "It will amount to the biggest test of his presidential authority and his signature economic policy.",
    "link": "https://www.bbc.com/news/articles/cd07exzr418o",
    "timestamp": "2025-09-09T20:56:48Z"
  },
  {
    "title": "Progressives Urge U.S. Arms Embargo After Israel Bombs Qatar",
    "description": "Israel's bombing of Qatar interrupted ceasefire negotiations in a war made possible by U.S. support.\nThe post Progressives Urge U.S. Arms Embargo After Israel Bombs Qatar appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/09/09/israel-qatar-doha-bombing-gaza-ceasefire/",
    "timestamp": "2025-09-09T20:55:10Z"
  },
  {
    "title": "Trump says Israeli-Russian hostage held by Iraqi militia freed",
    "description": "United States President Donald Trump announced that Elizabeth Tsurkov, an Israeli-Russian graduate student at Princeton University who was kidnapped in Baghdad in 2023, has been released.\n\"I am ...",
    "link": "https://biztoc.com/x/f0d961488a2b9ac5",
    "timestamp": "2025-09-09T20:53:01Z"
  },
  {
    "title": "Trump says Princeton student Elizabeth Tsurkov freed after being held by Hezbollah for 2 years",
    "description": "President Donald Trump announces Princeton student Elizabeth Tsurkov has been released by Hezbollah and is now safe at the American Embassy in Iraq.",
    "link": "https://www.foxnews.com/politics/trump-says-princeton-student-elizabeth-tsurkov-freed-after-being-held-hezbollah-2-years",
    "timestamp": "2025-09-09T20:52:41Z"
  },
  {
    "title": "Cuomo taps veteran Democratic strategist as new campaign manager in final sprint to Election Day",
    "description": "Former Gov. Andrew Cuomo has appointed Greg Goldner as his new campaign manager as the latest polling showed Zohran Mamdani has the lead in the New York City's mayoral race.",
    "link": "https://www.foxnews.com/politics/cuomo-taps-veteran-democratic-strategist-new-campaign-manager-final-sprint-election-day",
    "timestamp": "2025-09-09T20:52:29Z"
  },
  {
    "title": "Real drawing in Epstein 'birthday book' appears to show him giving candy to children",
    "description": "In September 2025, social media posts authentically showed a drawing from Jeffrey Epstein's 50th-birthday album that appeared to depicted scenes of him handing candy and balloons to children and receiving a massage from multiple women.",
    "link": "https://www.snopes.com//fact-check/epstein-birthday-book-drawing/",
    "timestamp": "2025-09-09T20:52:00Z"
  },
  {
    "title": "John Fetterman Shares Bizarre Winnie the Pooh Meme After Israel Attack",
    "description": "Pennsylvania Senator John Fetterman had a gross and callow response to Israel’s attack on Qatar’s capital city.Israel struck Hamas’s political leadership in Doha, Qatar, on Tuesday, as they gathered to discuss a U.S. ceasefire proposal, killing six people.Qat…",
    "link": "https://newrepublic.com/post/200221/john-fetterman-bizarre-winnie-pooh-israel-attack",
    "timestamp": "2025-09-09T20:51:34Z"
  },
  {
    "title": "Supreme Court will hear Trump tariffs case on fast track",
    "description": "A federal appeals court recently ruled that many of President Donald Trump's wide-ranging tariffs in imports from most countries are illegal.",
    "link": "https://www.cnbc.com/2025/09/09/trump-tariffs-trade-supreme-court-.html",
    "timestamp": "2025-09-09T20:50:53Z"
  },
  {
    "title": "Supreme Court agrees to take up Trump case with massive economic implications",
    "description": "The U.S. Supreme Court will take up an appeal of lower court decisions that President Donald Trump's tariffs were illegal, deciding once and for all whether the president has the power to unilaterally declare new taxes on foreign goods on an emergency basis.A…",
    "link": "https://www.rawstory.com/supreme-court-tariffs-2673976701/",
    "timestamp": "2025-09-09T20:50:53Z"
  },
  {
    "title": "Supreme Court Will Decide Fate Of Trump’s Tariffs—Here’s What Happens If They’re Overturned",
    "description": "If the Supreme Court lets a lower court’s decision stand, and tariffs are ruled unlawful, companies—and consumers—could start asking that the money they paid be returned.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/09/09/trumps-catastrophic-worry-what-happens-if-the-supreme-court-rules-against-his-tariffs/",
    "timestamp": "2025-09-09T20:49:53Z"
  },
  {
    "title": "Supreme Court to weigh in on Trump’s emergency tariff powers after prez unleashed sweeping levies",
    "description": "The case involves two sets of import taxes, both of which Trump justified by declaring a national emergency",
    "link": "https://nypost.com/2025/09/09/us-news/supreme-court-to-consider-if-trump-has-power-to-impose-sweeping-tariffs/",
    "timestamp": "2025-09-09T20:49:43Z"
  },
  {
    "title": "Leon Black and Leslie Wexner Contributions to Jeffrey Epstein Birthday Book Released By US Congressional Committee",
    "description": "The letters were part of a birthday book for the convicted sex offender, including one from President Trump, released by the House Oversight Committee",
    "link": "https://www.artnews.com/art-news/news/leon-black-leslie-wexner-jeffrey-epstein-birthday-letters-1234751222/",
    "timestamp": "2025-09-09T20:49:39Z"
  },
  {
    "title": "Xi Jinping Asks the World to Choose ‘War or Peace’. Which Direction Is China Headed?",
    "description": "Analysis - The optics could not have been more stark as Chinese leader Xi Jinping arrived at a massive military parade in Beijing flanked by Russian President Vladimir Putin and North Korean leader Kim Jong Un - with some two dozen other leaders including fro…",
    "link": "https://freerepublic.com/focus/f-news/4339424/posts",
    "timestamp": "2025-09-09T20:48:11Z"
  },
  {
    "title": "Supreme Court to quickly consider if President Donald Trump has power to impose sweeping tariffs",
    "description": "The Supreme Court is granting an unusually quick hearing on whether President Donald Trump has the power under federal law to impose sweeping tariffs.",
    "link": "https://www.clickondetroit.com/news/politics/2025/09/09/supreme-court-to-quickly-consider-if-president-donald-trump-has-power-to-impose-sweeping-tariffs/",
    "timestamp": "2025-09-09T20:47:14Z"
  },
  {
    "title": "Supreme Court Shares Update on Major Trump Administration Case",
    "description": "Small businesses and states challenging the tariffs say Trump illegally invoked emergency powers to levy import taxes on goods.",
    "link": "https://www.newsweek.com/supreme-court-donald-trump-tariffs-update-ruling-case-2127269",
    "timestamp": "2025-09-09T20:44:03Z"
  },
  {
    "title": "Super Fake: Fake Numbers From Fake Bureaucrats Caused People To Believe In Fake Economic Prosperity That Never Existed",
    "description": "How do 911,000 jobs suddenly disappear into thin air?  Can someone explain that to me?  Throughout 2024, I wrote extensively about how all of the reliable numbers showed that economic conditions in the United States were deteriorating.  But those that were sk…",
    "link": "http://theeconomiccollapseblog.com/super-fake-fake-numbers-from-fake-bureaucrats-caused-people-to-believe-in-fake-economic-prosperity-that-never-existed/",
    "timestamp": "2025-09-09T20:43:11Z"
  },
  {
    "title": "Israeli-Russian graduate student kidnapped in Iraq has been released, Trump and family say",
    "description": "Elizabeth Tsurkov was freed following more than 900 days in captivity.",
    "link": "https://www.bostonherald.com/2025/09/09/elizabeth-tsurkov-released/",
    "timestamp": "2025-09-09T20:43:00Z"
  },
  {
    "title": "Cracker Barrel Suspends Restaurant Remodels, Reaffirms Americana Style Customers Love",
    "description": "After pledging to restore its “Old Timer” logo, Cracker Barrel announced Tuesday it will suspend its restaurant remodel program in response to customer concerns over modernization plans.\nThe post Cracker Barrel Suspends Restaurant Remodels, Reaffirms American…",
    "link": "https://www.breitbart.com/politics/2025/09/09/cracker-barrel-suspends-restaurant-remodels-reaffirms-americana-style-customers-love/",
    "timestamp": "2025-09-09T20:42:50Z"
  },
  {
    "title": "US Supreme Court paves way for Trump to cut $4bn in foreign aid",
    "description": "Emergency stay granted by court one day after government requests it be allowed to ignore lower court order.",
    "link": "https://www.aljazeera.com/news/2025/9/9/us-supreme-court-paves-way-for-trump-to-cut-4bn-in-foreign-aid",
    "timestamp": "2025-09-09T20:42:16Z"
  },
  {
    "title": "Supreme Court will hear Trump tariffs case on fast track",
    "description": "A federal appeals court recently ruled that many of President Donald Trump's wide-ranging tariffs in imports from most countries are illegal.",
    "link": "https://biztoc.com/x/878ea31e6f34c204",
    "timestamp": "2025-09-09T20:41:37Z"
  },
  {
    "title": "Donald Trump Gets Third Supreme Court Win This Week",
    "description": "The justices issued an administrative stay that allows more time to review the Trump request to withhold about $4 billion in aid.",
    "link": "https://biztoc.com/x/7e0d6e8c5578d417",
    "timestamp": "2025-09-09T20:41:21Z"
  },
  {
    "title": "As AI Reigns, Students' Math and Reading Scores Just Hit an All-Time Low",
    "description": "The US Education Department, which is set to be dismantled under president Donald Trump, has released the math and reading test scores of American high-school seniors — and they're an absolute disaster. As the Wall Street Journal reports, the scores have hit …",
    "link": "https://futurism.com/ai-students-math-reading-scores-all-time-low",
    "timestamp": "2025-09-09T20:41:07Z"
  },
  {
    "title": "Trump announces: Israeli-Russian researcher Elizabeth Tsurkov freed from captivity",
    "description": "US President announces the release of Elizabeth Tsurkov, held by Kata’ib Hezbollah in Iraq since 2023. She is now safe at the US Embassy.",
    "link": "https://www.israelnationalnews.com/news/414668",
    "timestamp": "2025-09-09T20:41:00Z"
  },
  {
    "title": "2026 FIFA World Cup Tickets Go On Sale Sept. 10. Here’s How To Buy",
    "description": "While hospitaly packages for the 2026 FIFA World Cup have been on sale in some form since May, the process for the general public will begin on Wednesday.",
    "link": "https://www.forbes.com/sites/ianquillen/2025/09/09/want-to-buy-2026-fifa-world-cup-tickets-the-process-starts-sept-10/",
    "timestamp": "2025-09-09T20:40:09Z"
  },
  {
    "title": "US-El Salvador Prison Agreement Included Anti-DEI, Asylum Terms (Zoe Tillman/Bloomberg)",
    "description": "Zoe Tillman / Bloomberg:\nUS-El Salvador Prison Agreement Included Anti-DEI, Asylum Terms  —  The Trump administration offered $4.7 million to El Salvador to imprison deported Venezuelan migrants earlier this year, but restricted the money from being used in w…",
    "link": "https://www.memeorandum.com/250909/p116",
    "timestamp": "2025-09-09T20:40:00Z"
  },
  {
    "title": "FinCEN Director Cites ‘Urgent Need to Modernize’ AML Amid New Threats",
    "description": "Anti-money laundering (AML) and countering the financing of terrorism (CFT) need streamlining and modernizing as financial institutions face new threats from cyber criminals and illicit financial networks tied to everything from drug cartels to shadow banking…",
    "link": "http://www.pymnts.com/aml/2025/fincen-director-cites-urgent-need-modernize-aml-amid-new-threats/",
    "timestamp": "2025-09-09T20:39:35Z"
  },
  {
    "title": "In the West Point drama, Trump recasts Tom Hanks from war film icon to ‘woke’ MAGA avatar",
    "description": "President Donald Trump celebrated a West Point alumni group's decision to cancel an awards ceremony that would have honored actor Tom Hanks.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/tom-hanks-west-point-trump-truth-social-post-rcna230098",
    "timestamp": "2025-09-09T20:38:42Z"
  },
  {
    "title": "Monday Evening Open Thread: Eyes on the Prize, Everyone",
    "description": "Whenever you see Republicans offering messaging advice to Democrats you know the Repubs are losing. [image or embed] — Dana Houle (@danahoule.bsky.social) September 9, 2025 at 11:50 AM === The police in Illinois work closely with the ATF to get guns off our s…",
    "link": "https://balloon-juice.com/2025/09/09/monday-evening-open-thread-eyes-on-the-prize-everyone/",
    "timestamp": "2025-09-09T20:38:39Z"
  },
  {
    "title": "Mary Trump: “Definitely” president’s signature on alleged Epstein letter",
    "description": "Mary Trump said the signature \"definitely\" belonged to the president.",
    "link": "https://www.salon.com/2025/09/09/mary-trump-definitely-presidents-signature-on-alleged-epstein-letter/",
    "timestamp": "2025-09-09T20:38:11Z"
  },
  {
    "title": "Supreme Court agrees to consider Trump tariffs appeal on expedited basis",
    "description": "The Supreme Court agreed on Tuesday to hear the Trump administration’s tariffs appeal on an expedited basis, in a case with vast implications for the economy and presidential power, setting a fast briefing schedule with a hearing to come in November",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-trump-tariffs-appeal-expedited-rcna229105",
    "timestamp": "2025-09-09T20:37:45Z"
  },
  {
    "title": "‘Real 2+2=5 Stuff Here’: Karoline Leavitt Brutally Roasted For Trump-Epstein Letter Denial",
    "description": "“Guys. it's his signature. we don't need to pretend like it's up for debate,” noted veteran journalist Sam Stein.\nThe post ‘Real 2+2=5 Stuff Here’: Karoline Leavitt Brutally Roasted For Trump-Epstein Letter Denial first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/real-225-stuff-here-karoline-leavitt-brutally-roasted-for-trump-epstein-letter-denial/",
    "timestamp": "2025-09-09T20:37:37Z"
  },
  {
    "title": "Supreme Court Greenlights Trump Admin Withholding Billions In Foreign Aid For Now",
    "description": "The Supreme Court temporarily allowed President Donald Trump to withhold $4 billion in foreign aid funds. U.S. District Judge Amir Ali, a Biden appointee, ordered the administration to pay out billions of dollars in foreign aid on Wednesday. In a brief order,…",
    "link": "https://dailycaller.com/2025/09/09/supreme-court-greenlights-trump-admin-withholding-billions-in-foreign-aid-for-now/",
    "timestamp": "2025-09-09T20:37:04Z"
  },
  {
    "title": "Supreme Court agrees to consider whether some of Trump's tariffs are legal",
    "description": "The Supreme Court on Tuesday agreed to quickly decide a high-stakes showdown over President Donald Trump's tariffs on imports from foreign nations.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-agrees-consider-whether-trumps-tariffs-are-legal-rcna229069",
    "timestamp": "2025-09-09T20:36:17Z"
  },
  {
    "title": "Supreme Court to decide fate of Trump's worldwide tariffs",
    "description": "President Trump is relying on the tariffs to raise revenue, spur manufacturing and exert political pressure on other countries.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/09/supreme-court-trump-tariffs/86038769007/",
    "timestamp": "2025-09-09T20:35:51Z"
  },
  {
    "title": "Supreme Court to quickly consider if President Donald Trump has power to impose sweeping tariffs",
    "description": "The justices will hear arguments in November.",
    "link": "https://www.denverpost.com/2025/09/09/supreme-court-trump-tariffs-arguments/",
    "timestamp": "2025-09-09T20:35:17Z"
  },
  {
    "title": "Supreme Court to quickly consider if President Donald Trump has power to impose sweeping tariffs",
    "description": "The justices will hear arguments in November.",
    "link": "https://www.bostonherald.com/2025/09/09/supreme-court-trump-tariffs-arguments/",
    "timestamp": "2025-09-09T20:35:17Z"
  },
  {
    "title": "U.S. Students Just Scored Their Lowest Marks in History",
    "description": "The latest results from the Nation's Report Card offers little reason for optimism.",
    "link": "https://gizmodo.com/u-s-students-just-scored-their-lowest-marks-in-history-2000656206",
    "timestamp": "2025-09-09T20:35:07Z"
  },
  {
    "title": "‘Godfather of AI’ warns tech will bring massive unemployment: ‘A few people much richer and most people poorer’",
    "description": "Geoffrey Hinton said many scientists agree that AI will become superintelligent, or able to outperform humans, in five to 20 years.",
    "link": "https://nypost.com/2025/09/09/business/godfather-of-ai-warns-tech-will-bring-massive-unemployment/",
    "timestamp": "2025-09-09T20:34:08Z"
  },
  {
    "title": "Supreme Court to consider if Trump has power to impose broad tariffs",
    "description": "The Supreme Court is granting an unusually quick hearing on whether President Donald Trump has the power under federal law to impose sweeping tariffs. The justices agreed Tuesday to hear the case in November, lightning fast by the usual standards of the natio…",
    "link": "https://apnews.com/article/trump-tariffs-supreme-court-d1d0dd6ddd83e2c1df1598e468b839f5",
    "timestamp": "2025-09-09T20:33:19Z"
  },
  {
    "title": "Supreme Court stays judge order requiring Trump to spend foreign aid",
    "description": "The Supreme Court on Tuesday paused a court order requiring President Donald Trump to distribute roughly $4 billion in foreign aid that he has tried to cancel through a \"pocket rescission,\" Reuters reported. The order follows a lower court determining that Tr…",
    "link": "https://freerepublic.com/focus/f-news/4339422/posts",
    "timestamp": "2025-09-09T20:33:03Z"
  },
  {
    "title": "Supreme Court to hear arguments over Trump’s ‘Liberation Day’ tariffs | CNN Politics",
    "description": "Supreme Court to hear arguments over Trump’s ‘Liberation Day’ tariffs | CNN Politicscnn.com",
    "link": "https://www.cnn.com/2025/09/09/politics/tariffs-supreme-court",
    "timestamp": "2025-09-09T20:32:23Z"
  },
  {
    "title": "Trump: Decision to strike Qatar was made by Netanyahu, not me",
    "description": "In a post on Truth Social, Trump clarifies that Israel’s strike on Hamas in Qatar was Netanyahu’s decision, not his, calls for peace and vows no future attacks on Qatari soil.",
    "link": "https://www.israelnationalnews.com/news/414667",
    "timestamp": "2025-09-09T20:32:00Z"
  },
  {
    "title": "Xi Jinping Seizes Reins of Anti-American BRICS in Virtual Summit, Refocusing Aimless Bloc Against Trump",
    "description": "Genocidal Chinese dictator Xi Jinping commanded the members of BRICS, a security and trade bloc designed to undermine the United States, on Monday to \"jointly defend multilateralism\" during a virtual “summit.”\nThe post Xi Jinping Seizes Reins of Anti-American…",
    "link": "https://www.breitbart.com/asia/2025/09/09/xi-jinping-seizes-reins-of-anti-american-brics-in-virtual-summit-refocusing-aimless-bloc-against-trump/",
    "timestamp": "2025-09-09T20:31:46Z"
  },
  {
    "title": "Suspect In Stabbing Of Ukrainian Refugee Faces Federal Charge—As Trump Puts Attack In Culture War Spotlight",
    "description": "President Donald Trump and other Republicans have blamed Zarutska’s death on Democratic policies in North Carolina.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/09/09/suspect-in-stabbing-of-ukrainian-refugee-faces-federal-charge-as-trump-puts-attack-in-culture-war-spotlight/",
    "timestamp": "2025-09-09T20:31:37Z"
  },
  {
    "title": "No wonder there is fear of a population crisis — young men and women are wildly out of sync",
    "description": "Party lines are dividing Gen Z on an issues that weren't even political for their parents and grandparents: kids and marriage.",
    "link": "https://nypost.com/2025/09/09/opinion/no-wonder-there-is-fear-of-a-population-crisis-young-men-and-women-are-wildly-out-of-sync/",
    "timestamp": "2025-09-09T20:31:28Z"
  }
]