[
  {
    "title": "Christian worship event in deep blue city faces fierce backlash from LGBTQ leaders",
    "description": "Christian worship leader Sean Feucht is holding a rally in Seattle despite LGBTQ activists urging city officials to revoke his permit. Counter-protests are planned.",
    "link": "https://www.foxnews.com/media/christian-worship-event-deep-blue-city-faces-fierce-backlash-from-lgbtq-leaders",
    "timestamp": "2025-08-30T13:00:10Z"
  },
  {
    "title": "FO° Podcast: The Story of Millions of Syrian Refugees and Why They Can Never Return Home",
    "description": "Fair Observer Founder, CEO & Editor-in-Chief Atul Singh and foreign affairs analyst William McChesney discuss why millions of Syrian refugees remain unwilling or unable to return home. The conversation explores the history of Syria’s war, the collapse of the …",
    "link": "https://www.fairobserver.com/world-news/middle-east-news/fo-podcast-the-story-of-millions-of-syrian-refugees-and-why-they-can-never-return-home/",
    "timestamp": "2025-08-30T13:00:10Z"
  },
  {
    "title": "Up 60% in a Year, How Much Farther Can Coinbase Stock Go?",
    "description": "After a 60% surge over the past 12 months, does Coinbase have more room to run?",
    "link": "https://www.barchart.com/story/news/34502991/up-60-in-a-year-how-much-farther-can-coinbase-stock-go",
    "timestamp": "2025-08-30T13:00:02Z"
  },
  {
    "title": "It Was Meant to Solve the Housing Crisis. Trump Is Using It to Create an Enemies List.",
    "description": "Thanks to Donald, the most dangerous file in Washington is … your mortgage application?",
    "link": "https://slate.com/news-and-politics/2025/08/trump-fed-lisa-cook-mortgages-enemies-list-history.html",
    "timestamp": "2025-08-30T13:00:00Z"
  },
  {
    "title": "Stephen Miler called Democratic Party a 'domestic, extremist organization'",
    "description": "On Aug. 25, 2025, U.S. President Donald Trump's Deputy Chief of Staff for Policy Stephen Miller called the Democratic Party a \"domestic, extremist organization\" on Fox News.",
    "link": "https://www.snopes.com//fact-check/stephen-miller-democrats-extremist/",
    "timestamp": "2025-08-30T13:00:00Z"
  },
  {
    "title": "Here's what it really means for Trump to get control of the Federal Reserve board",
    "description": "Since taking office in January, Trump has placed the Fed directly in the crosshairs of executive power.",
    "link": "https://www.cnbc.com/2025/08/30/heres-what-it-really-means-for-trump-to-get-control-of-the-federal-reserve-board.html",
    "timestamp": "2025-08-30T12:54:03Z"
  },
  {
    "title": "‘Racist as hell’: Trump’s cabinet is almost all white, and he keeps firing Black officials",
    "description": "President’s targeting of Fed governor Lisa Cook highlights his efforts to remove diverse voices from government\nA day after Donald Trump announced that he was firing Lisa Cook, the first Black woman to serve on the board of governors of the Federal Reserve, t…",
    "link": "https://biztoc.com/x/302b0c311c2be457",
    "timestamp": "2025-08-30T12:53:41Z"
  },
  {
    "title": "Egypt's GDP Grows 4.5% in 2024-25",
    "description": "Egypt's real gross domestic product grew by 4.5% in the 2024-25 financial year, up from 2.4% the previous year, Finance Minister Ahmed Kouchouk said on Saturday, boosted by reforms tied to IMF financing and increased manufacturing activity. The Arab world's m…",
    "link": "https://english.aawsat.com/business/5180808-egypts-gdp-grows-45-2024-25",
    "timestamp": "2025-08-30T12:50:24Z"
  },
  {
    "title": "Prof. Schlevogt’s Compass No. 23: The art of political tragicomedy – Zelensky’s playbook",
    "description": "European leaders on war footing flocked to the White House to plea for protection. Ukraine’s president brought self-parody to center stage. Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623709-political-tragicomedy-zelensky-playbook/",
    "timestamp": "2025-08-30T12:50:20Z"
  },
  {
    "title": "Trump is Dead Trend: Here's viral memes on X as Donald Trump health rumours and The Simpsons predictions spread",
    "description": "Trump is Dead memes have gone viral on X with more than 56,900 posts. The trend links Donald Trump’s health rumours, JD Vance’s remarks, and The Simpsons predictions, fuelling speculation despite White House statements.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-is-dead-memes-donald-trump-health-rumours-jd-vance-the-simpsons-prediction-social-media-trend/articleshow/123602437.cms",
    "timestamp": "2025-08-30T12:48:52Z"
  },
  {
    "title": "Maggie Haberman Says Bombshell Ruling ‘Big Blow’ To Trump Agenda",
    "description": "Maggie Haberman told CNN anchor Jake Tapper that the bombshell tariff ruling is a \"big blow\" to President Donald Trump and his agenda.\nThe post Maggie Haberman Says Bombshell Ruling ‘Big Blow’ To Trump Agenda first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/maggie-haberman-says-bombshell-ruling-big-blow-to-trump-agenda/",
    "timestamp": "2025-08-30T12:47:23Z"
  },
  {
    "title": "What to know Kilmar Abrego Garcia's asylum claim. Experts say it's a smart but risky legal move",
    "description": "Legal experts say Kilmar Abrego Garcia’s request for asylum in the United States is a smart but risky legal strategy",
    "link": "https://abcnews.go.com/Politics/wireStory/kilmar-abrego-garcias-asylum-claim-experts-smart-risky-125120247",
    "timestamp": "2025-08-30T12:46:31Z"
  },
  {
    "title": "Massive Shakeup: 'Saturday Night Live' Sheds Performers, Writers After 50th Season; Fans Revolt",
    "description": "Fans are becoming increasingly angry as long-running NBC late night comedy show 'Saturday Night Live' continues to fire castmembers.",
    "link": "https://www.breitbart.com/entertainment/2025/08/30/massive-shakeup-saturday-night-live-sheds-performers-writers-after-50th-season-fans-revolt-just-cancel-snl/",
    "timestamp": "2025-08-30T12:46:24Z"
  },
  {
    "title": "If the US president dies, who takes power — and why Trump death rumours are surging now?",
    "description": "Donald Trump death rumours are going viral on social media, sparking confusion and urgent questions about what happens if a US president dies in office. While the rumours remain unverified, the real story lies in America’s clear succession plan.",
    "link": "https://economictimes.indiatimes.com/news/international/us/if-the-us-president-dies-who-takes-power-and-why-trump-death-rumours-are-surging-now/articleshow/123602588.cms",
    "timestamp": "2025-08-30T12:45:09Z"
  },
  {
    "title": "Trump’s New Substance Use Policy Would Have Made My Own Recovery Impossible",
    "description": "Last month, US President Donald Trump signed Executive Order 14321\r\n—“Ending Crime and Disorder on America’s Streets.” By criminalizing homelessness, addiction, and mental health crises, the order strips federal support from lifesaving public health solutions…",
    "link": "https://www.commondreams.org/opinion/trump-substance-abuse-eo",
    "timestamp": "2025-08-30T12:43:02Z"
  },
  {
    "title": "Where Is Donald Trump? When He Was Last Seen in Public & Why There's Rumors About His Health",
    "description": "Donald Trump has not made a public appearance since Tuesday (August 26), and rumors are circulating about his whereabouts amid a slew of heath issues and social media trending topics like “Trump Is Dead” and “Where Is Trump.” Last month, the 79-year-old POTUS…",
    "link": "https://www.justjared.com/2025/08/30/where-is-donald-trump-when-he-was-last-seen-in-public-why-theres-rumors-about-his-health/",
    "timestamp": "2025-08-30T12:40:13Z"
  },
  {
    "title": "Moscow says it hit residences, infrastructure in Ukraine, as Kyiv reports striking Russian refineries",
    "description": "As Russia and Ukraine traded attacks in the war that began in February 2022, Volodymyr Zelenskyy noted the deadline U.S. President Donald Trump gave for deciding on new measures against Russia if Vladimir Putin fails to commit to a meeting with the Ukrainian …",
    "link": "https://www.cbc.ca/news/world/ukraine-russia-kyiv-attacks-1.7621980",
    "timestamp": "2025-08-30T12:35:21Z"
  },
  {
    "title": "Letitia James Celebrates Tariff Victory Over Trump: 'Never Stop Fighting'",
    "description": "A federal appeals court ruled on Friday that most of Trump's tariffs were imposed unlawfully, upholding an earlier decision by the Court of International Trade.",
    "link": "https://www.newsweek.com/letitia-james-donald-trump-tariffs-2122057",
    "timestamp": "2025-08-30T12:33:15Z"
  },
  {
    "title": "Trump Tariffs Could Spike Car Insurance Rates by 280% — Here’s Why",
    "description": "Tariffs have dominated the headlines since President Donald Trump returned to office in January 2025. One area where many Americans have monitored tariff impact is with automobiles. It’s understandable, as cars are a major purchase for most. One unfortunate s…",
    "link": "https://biztoc.com/x/13bb447e980385f3",
    "timestamp": "2025-08-30T12:31:41Z"
  },
  {
    "title": "No Summer Vacation: President Trump Skipped Traditional August Break to Work on World Peace and Solving the Nation’s Problems, Will Remain at the White House for Labor Day Weekend",
    "description": "President Donald Trump is scheduled to remain at the White House this Labor Day Weekend, like he has for the entire month of August in a break from presidential tradition of extended vacations while Congress is out for its August recess and the nation’s capit…",
    "link": "https://www.thegatewaypundit.com/?p=1445351",
    "timestamp": "2025-08-30T12:30:03Z"
  },
  {
    "title": "Javier Milei’s “Carnal Relations” With Donlad Trump And The US",
    "description": "Argentina's Javier Milei has fully embraced its geopolitical allignment with Trump and the US.",
    "link": "https://www.forbes.com/sites/afontevecchia/2025/08/30/javier-mileis-carnal-relations-with-donlad-trump-and-the-us/",
    "timestamp": "2025-08-30T12:30:00Z"
  },
  {
    "title": "‘America First’ handing China big boost on the world stage: ‘I don’t think Trump is aware'",
    "description": "President Donald Trump’s so-called “America First Priorities\r\n” are in some cases being welcomed with open arms by Chinese officials, who have said that the United States’ growing isolation and provocative trade policy is helping China “increase its global in…",
    "link": "https://www.rawstory.com/china-2673942858/",
    "timestamp": "2025-08-30T12:27:39Z"
  },
  {
    "title": "Is Xi Jinping the World’s Number One Autocrat?",
    "description": "American historian Anne Applebaum coined the term “Autocracy, Inc.” to describe government leaders around the world who function like an agglomeration of like-minded people. They are not united by ideology but by a ruthless, single-minded determination to mai…",
    "link": "https://www.fairobserver.com/politics/is-xi-jinping-the-worlds-number-one-autocrat/",
    "timestamp": "2025-08-30T12:23:10Z"
  },
  {
    "title": "‘Where is Trump?’ Panic grows online as health rumors spiral out of control",
    "description": "Rumors claiming Donald Trump is dead spread rapidly online this weekend, flooding X and TikTok with speculation. The viral trend left millions confused, but no credible evidence backs the claims. Here’s how the rumor started, why it spread so quickly, and wha…",
    "link": "https://economictimes.indiatimes.com/news/international/us/where-is-trump-panic-grows-online-as-health-rumors-spiral-out-of-control/articleshow/123602138.cms",
    "timestamp": "2025-08-30T12:20:31Z"
  },
  {
    "title": "Appeals Court Says Trump's Tariff Push Overstepped His Powers",
    "description": "A federal appeals court on Friday ruled President Donald Trump illegally used the International Emergency Economic Powers Act to implement most of his tariffs this year, writing “the power to impose tariffs is vested exclusively in the legislative branch by t…",
    "link": "https://biztoc.com/x/3185bbcce67a0b0f",
    "timestamp": "2025-08-30T12:19:56Z"
  },
  {
    "title": "Trump Tariffs Could Spike Car Insurance Rates by 280% — Here’s Why",
    "description": "Trump’s 2025 auto tariffs are driving car and repair costs up, causing auto insurance rates to rise 280% faster -- averaging $2,759/year, according to...",
    "link": "https://finance.yahoo.com/news/trump-tariffs-could-spike-car-121621944.html",
    "timestamp": "2025-08-30T12:16:21Z"
  },
  {
    "title": "Fight in the Mexican Senate: Noroña (Morena) and Moreno (PRI) clash during session after debate on U.S. military intervention.",
    "description": "This is a Gateway Hispanic article.\nThe post Fight in the Mexican Senate: Noroña (Morena) and Moreno (PRI) clash during session after debate on U.S. military intervention. appeared first on The Gateway Pundit.",
    "link": "https://gatewayhispanic.com/2025/08/fists-senate-scandal-mexico-fight-between-fernandez-norona/",
    "timestamp": "2025-08-30T12:15:00Z"
  },
  {
    "title": "What to know Kilmar Abrego Garcia's asylum claim. Experts say it's a smart but risky legal move",
    "description": "Kilmar Abrego Garcia ’s request for asylum in the United States is a prudent legal strategy, experts say, because it gives his lawyers better options for...",
    "link": "https://www.yahoo.com/news/articles/know-kilmar-abrego-garcias-asylum-121307896.html",
    "timestamp": "2025-08-30T12:13:07Z"
  },
  {
    "title": "Trump’s Tariffs Are Basically All Illegal, Federal Appeals Court Rules",
    "description": "A federal appeals court on Friday invalidated vast portions of President Donald Trump’s sweeping tariffs, ruling that the president lacked the authority to invoke an emergency law to unleash tariffs on nearly all goods from nearly every country importing to t…",
    "link": "https://www.motherjones.com/politics/2025/08/trumps-tariffs-are-basically-all-illegal-federal-appeals-court-rules/",
    "timestamp": "2025-08-30T12:13:00Z"
  },
  {
    "title": "Tasteless trolls trend 'Trump is dead' amid health concerns",
    "description": "Social media buzzed with rumors of US President Donald Trump's death after a 72-hour absence from public view, fueled by health concerns and trending hashtags. Despite the White House attributing his symptoms to chronic venous insufficiency and minor soft tis…",
    "link": "https://timesofindia.indiatimes.com/world/us/tasteless-trolls-trend-trump-is-dead-amid-health-concerns/articleshow/123602177.cms",
    "timestamp": "2025-08-30T12:09:22Z"
  },
  {
    "title": "Trump Giving Ukraine Capability to Strike Deeper Into Russia: NATO Ambassador",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Donald Trump administration is giving the Ukrainian military \"deeper strike capabilities\" allowing it to hit targets farther into Russia, according to Matt Whitaker, the U.S. ambassador to NATO.\nNewsweek c…",
    "link": "https://biztoc.com/x/2ada449ccebe7403",
    "timestamp": "2025-08-30T12:09:12Z"
  },
  {
    "title": "Trump Giving Ukraine Capability to Strike Deeper Into Russia: NATO Ambassador",
    "description": "Russian President Vladimir Putin has made no concessions as part of ceasefire negotiations.",
    "link": "https://www.newsweek.com/trump-giving-ukraine-capability-strike-deeper-russia-nato-ambassador-2122053",
    "timestamp": "2025-08-30T12:05:11Z"
  },
  {
    "title": "Look What Donald Trump Has Done To The Oval Office",
    "description": "Trump has taken an unusually personal interest in redecorating the iconic seat of the American presidency.",
    "link": "https://www.huffpost.com/entry/donald-trump-oval-office-gold-gilding_n_68910956e4b06ab33893e975",
    "timestamp": "2025-08-30T12:00:20Z"
  },
  {
    "title": "They Spent Years Covering L.A.'s Taco Scene. When ICE Raids Began, They Were Ready.",
    "description": "\"It's very personal to me,\" Memo Torres told HuffPost. \"L.A. is home. So you attack my home, you’re attacking my people.\"",
    "link": "https://www.huffpost.com/entry/la-taco-memo-torres-ice-raids_n_68b0e909e4b068b1ec8b2a74",
    "timestamp": "2025-08-30T12:00:20Z"
  },
  {
    "title": "Fetterman defends Trump's 'tasteful' $200M White House ballroom makeover amid Dem criticism",
    "description": "President Donald Trump is planning a $200 million White House ballroom renovation funded by private donors, sparking a debate about the architectural changes to the building.",
    "link": "https://www.foxnews.com/politics/fetterman-defends-trumps-tasteful-200m-white-house-ballroom-makeover-amid-dem-criticism",
    "timestamp": "2025-08-30T12:00:03Z"
  },
  {
    "title": "Misfits Boxing 22 predictions",
    "description": "Darren Till and Luke Rockhold are ready to go. Perhaps too much so. This Saturday, Till and Rockhold face off in an eight-round boxing match for the Misfits bridgerweight title (205 pounds), in the main event of Misfits 22. The bout is Rockhold’s Misfits and …",
    "link": "https://www.mmafighting.com/boxing-news/401307/misfits-boxing-22-predictions",
    "timestamp": "2025-08-30T12:00:00Z"
  },
  {
    "title": "NASA employees fear worsening conditions as new Trump executive order eliminates their right to unionize",
    "description": "A new executive order signed by President Donald Trump removes NASA employees from federal labor-management protections, under the justification of national security.",
    "link": "https://www.space.com/space-exploration/nasa-employees-fear-worsening-conditions-as-new-trump-executive-order-eliminates-their-right-to-unionize",
    "timestamp": "2025-08-30T12:00:00Z"
  },
  {
    "title": "Trump’s Order Against Flag-Burning Will Backfire",
    "description": "The president hates flag-burning, but he just made it harder to prosecute.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/08/flag-burning-trump-executive-order/684058/",
    "timestamp": "2025-08-30T12:00:00Z"
  },
  {
    "title": "Could Trump and RFK Jr. Ban the Covid Vaccine?",
    "description": "Rolling Stone talks to experts about what current Covid vaccine restrictions and a possible ban could mean for public health, whether you should rush out to get a jab, and more",
    "link": "http://www.rollingstone.com/culture/culture-features/trump-rfk-covid-vaccine-restrictions-ban-1235417622/",
    "timestamp": "2025-08-30T12:00:00Z"
  },
  {
    "title": "Trump Revokes Secret Service Protection for Kamala Harris",
    "description": "President Donald Trump has revoked former Vice President Kamala Harris’ Secret Service protection just ahead of her book tour across the United States. Typically, vice presidents only receive six months of Secret Service protection after leaving office, but b…",
    "link": "https://www.today.com/video/trump-revokes-kamala-harris-secret-service-protection-246187077909",
    "timestamp": "2025-08-30T11:59:28Z"
  },
  {
    "title": "A walk through a Smithsonian museum reveals American genius and cruelty as Trump presses for change",
    "description": "The Smithsonian's National Museum of American History in Washington explores the complexity of America's past",
    "link": "https://abcnews.go.com/US/wireStory/walk-smithsonian-museum-reveals-american-genius-cruelty-trump-125120152",
    "timestamp": "2025-08-30T11:58:26Z"
  },
  {
    "title": "All about Trump’s proposed rule that affects Indian students in US",
    "description": "The Trump administration has proposed limiting the duration of stay for international students in the US",
    "link": "https://indianexpress.com/article/explained/explained-global/trumps-rule-indian-students-10220539/",
    "timestamp": "2025-08-30T11:57:45Z"
  },
  {
    "title": "AOC blasts JD Vance with gross fundraising email, slams vice president as ‘full of sh*t’",
    "description": "During the appearance at Mid-City Steel in LaCrosse, which sits in the northwest corner of the state on the border with Minnesota, the vice president recalled a chat with President Trump - then name checked The Squad member.",
    "link": "https://nypost.com/2025/08/30/us-news/aoc-blasts-jd-vance-with-gross-fundraising-email-slams-vice-president-as-full-of-sht/",
    "timestamp": "2025-08-30T11:57:16Z"
  },
  {
    "title": "Appeals Court Says Trump's Tariff Push Overstepped His Powers",
    "description": "A federal appeals court on Friday ruled President Donald Trump illegally used the International Emergency Economic Powers Act to implement most of his tariffs this year, writing “the power to impose tariffs is vested exclusively in the legislative branch by t…",
    "link": "https://www.today.com/video/trump-s-tariff-push-overstepped-his-powers-appeals-court-says-246189125803",
    "timestamp": "2025-08-30T11:53:52Z"
  },
  {
    "title": "What happens next after Trump tariffs ruled illegal?",
    "description": "A US appeals court has ruled that most of Trump’s tariffs are illegal - so what happens now?",
    "link": "https://www.bbc.com/news/articles/cy983g8jr5do",
    "timestamp": "2025-08-30T11:52:10Z"
  },
  {
    "title": "Trump Orders Smacked Down In Blistering Ruling On Tariffs",
    "description": "Trump's signature trade policy was smacked down by an appeals court in a blistering decision ruling most of his sweeping tariffs to be unconstitutional.\nThe post Trump Orders Smacked Down In Blistering Ruling On Tariffs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-orders-smacked-down-in-blistering-ruling-on-tariffs/",
    "timestamp": "2025-08-30T11:51:16Z"
  },
  {
    "title": "What Does the 7.8% GDP Growth Rate Reflect About the Indian Economy?",
    "description": "The Indian economy's impressive GDP growth of 7.8% in Q1 FY26 has drawn acclaim from economists, showcasing its strong fundamentals. This substantial growth reflects the impact of effective governance and structural reforms, paving the way for future economic…",
    "link": "https://www.nationpress.com/business/indias-economy-grows-by-78percent",
    "timestamp": "2025-08-30T11:49:40Z"
  },
  {
    "title": "Donald Trump Has A Secret Weapon In His War On The Fed",
    "description": "Donald Trump has been ramping up his war of words against the Federal Reserve this year, attacking Fed chair Jerome Powell as economists warn of a looming dollar disaster...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/30/donald-trump-has-a-secret-weapon-in-his-war-on-the-fed/",
    "timestamp": "2025-08-30T11:48:47Z"
  },
  {
    "title": "Ajay Bagga says GST tax cuts could spark market rebound, boost demand",
    "description": "Ajay Bagga expects Indian markets may have bottomed out, citing minimal Q1 downgrades and signs of recovery. He sees the upcoming GST Council meeting and potential consumption tax cuts as critical catalysts for growth.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ajay-bagga-says-gst-tax-cuts-could-spark-market-rebound-boost-demand/articleshow/123601953.cms",
    "timestamp": "2025-08-30T11:46:33Z"
  },
  {
    "title": "Did Trump's niece drop shocking clues and made chilling health revelation? What you need to know",
    "description": "Trump has been spotted with bruising on his right hand and swollen ankles on several occasions last year. President's niece Mary Trump had raised alarms about his cognitive health and suggested he may be battling a specific type of dementia. Rumours surroundi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-dead-rumours-did-trumps-niece-drop-shocking-clues-and-made-chilling-health-revelation-what-you-need-to-know/articleshow/123601862.cms",
    "timestamp": "2025-08-30T11:45:41Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to CaturSaturday, August 30, 2025: only two more dasy to go until we’re into September.  It’s the Sabbath for Jewish cats, who employ non-Jewish cats (שבת גוי קעץ) to do their work, and also  National Toasted Marshmallow Day. I like mine burnt black, …",
    "link": "https://whyevolutionistrue.com/2025/08/30/saturday-hili-dialogue-547/",
    "timestamp": "2025-08-30T11:45:03Z"
  },
  {
    "title": "Trump trade advisor’s ‘racist’ attack on Modi over India-Russia oil trade",
    "description": "Washington, Aug 30 : Donald Trump’s trade adviser Peter Navarro escalated his attacks on India with a racially tinged thread on X, […]\nThe post Trump trade advisor’s ‘racist’ attack on Modi over India-Russia oil trade appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/30/trump-trade-advisors-racist-attack-on-modi-over-india-russia-oil-trade/",
    "timestamp": "2025-08-30T11:45:00Z"
  },
  {
    "title": "The White House wants government stakes in more companies. The nuclear energy industry could be next.",
    "description": "Nuclear energy could be the next industry the Trump administration targets for equity stakes.",
    "link": "https://finance.yahoo.com/news/the-white-house-wants-government-stakes-in-more-companies-the-nuclear-energy-industry-could-be-next-114249585.html",
    "timestamp": "2025-08-30T11:42:49Z"
  },
  {
    "title": "A walk through a Smithsonian museum reveals American genius and cruelty as Trump presses for change",
    "description": "In an afternoon's walk through ground zero of Americana — the Smithsonian's National Museum of American History — objects around every corner invite one...",
    "link": "https://www.yahoo.com/news/articles/walk-smithsonian-museum-reveals-american-114239041.html",
    "timestamp": "2025-08-30T11:42:39Z"
  },
  {
    "title": "Germany's Merz faces trouble over 'autumn of reform'",
    "description": "Friedrich Merz has decided that the autumn must be the season for tackling Germany's urgent domestic problems, but that means conflict with his center-left coalition partners. Chancellor Friedrich Merz's \"autumn of reform\" could turn into a season of coalitio…",
    "link": "https://www.dw.com/en/germanys-merz-faces-trouble-over-autumn-of-reform/a-73807000",
    "timestamp": "2025-08-30T11:41:00Z"
  },
  {
    "title": "Look How Chickensh*t Vance Avoided Protesters In Wisconsin",
    "description": "Republicans are learning that their policies and this president's authoritarian moves aren't popular with the American people. Republicans are being blasted in town halls, and as one friend suggested to me, they should do town halls in a dunk tank. And now th…",
    "link": "https://crooksandliars.com/2025/08/look-how-chickensht-vance-avoided",
    "timestamp": "2025-08-30T11:32:35Z"
  },
  {
    "title": "White House insiders 'fuming' over concerns about Donald Trump's health - NewsBreak",
    "description": "White House insiders are reportedly fuming over the focus on Donald Trump's health as fears it's catching up with him grow",
    "link": "https://www.newsbreak.com/share/4203881073146-white-house-insiders-fuming-over-concerns-about-donald-trump-s-health?s=a2&amp;share_destination_id=MjA4MTUxNTItMTc1NjU1MzM0NjAzMg%3D%3D&amp;pd=01PKyGbu&amp;hl=en_US&amp;send_time=1756553346&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.34.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_android_comment_share_v3-v3",
    "timestamp": "2025-08-30T11:30:50Z"
  },
  {
    "title": "What polling shows about Trump's pivot from immigration to crime",
    "description": "He took over the Washington, D.C., police and deployed the National Guard despite that violent crime is down in the city and across the U.S.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_1d045477-0219-58e9-b008-506883ac95bc.html",
    "timestamp": "2025-08-30T11:30:00Z"
  },
  {
    "title": "White House insiders 'fuming' over concerns about Donald Trump's health - NewsBreak",
    "description": "White House insiders are reportedly fuming over the focus on Donald Trump's health as fears it's catching up with him grow",
    "link": "https://www.newsbreak.com/share/4203881073146-white-house-insiders-fuming-over-concerns-about-donald-trump-s-health?_f=app_share&amp;pd=0LVzypOH&amp;lang=en_US&amp;send_time=1756553209&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.34.1.10%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_ios_comment_share_v2-control&amp;s=i2",
    "timestamp": "2025-08-30T11:27:34Z"
  },
  {
    "title": "Will Democrats Have the Courage to Blame Trump for Hurricane Deaths?",
    "description": "The United States dodged a bullet when Hurricane Erin veered away from its coastline. Put differently, we were lucky enough to survive another round in the game of Russian roulette that President Donald Trump is playing with our lives. But the next hurricane …",
    "link": "https://www.commondreams.org/opinion/hurricane-deaths-blamed-on-trump",
    "timestamp": "2025-08-30T11:18:02Z"
  },
  {
    "title": "Trump administration tells states to remove references to ‘gender ideology’ from sex ed materials",
    "description": "President Donald Trump’s administration this week told 40 states to eliminate parts of lessons that focus on LGBTQ+ issues from federally funded sexual education materials or that they will lose funding. The move is the latest in a line of efforts since Trump…",
    "link": "https://freerepublic.com/focus/f-news/4337599/posts",
    "timestamp": "2025-08-30T11:12:01Z"
  },
  {
    "title": "Analysis-'MAHA' calls for limits on food ads to kids likely to face industry opposition",
    "description": "(Reuters) -A White House call to curtail the marketing of unhealthy food to children would be vulnerable to industry lobbying that killed previous government efforts, nutrition and public health experts said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/30/analysis-039maha039-calls-for-limits-on-food-ads-to-kids-likely-to-face-industry-opposition",
    "timestamp": "2025-08-30T11:12:00Z"
  },
  {
    "title": "Peter Schiff issued a dire warning on Trump’s trade deficit stance. Here’s why and how to protect yourself",
    "description": "\"What does Donald Trump think would happen?\"",
    "link": "https://finance.yahoo.com/news/peter-schiff-issued-dire-warning-111100449.html",
    "timestamp": "2025-08-30T11:11:00Z"
  },
  {
    "title": "Trump EO Aims to Make Federal Buildings 'Beautiful Again' By Respecting Our 'Heritage'",
    "description": "President Donald Trump announced his latest effort to make “federal architecture beautiful again\" through a new executive action.",
    "link": "https://www.westernjournal.com/trump-eo-aims-make-federal-buildings-beautiful-respecting-heritage/",
    "timestamp": "2025-08-30T11:09:12Z"
  },
  {
    "title": "France and Germany reject Trump's threats on EU tech legislation",
    "description": "Trump on Monday threatened to slap additional tariffs on all countries with digital taxes, legislation or regulations, saying they were designed to harm or discriminate against American technology, in an escalation of his criticism of EU rules on digital serv…",
    "link": "https://economictimes.indiatimes.com/tech/technology/france-and-germany-reject-trumps-threats-on-eu-tech-legislation/articleshow/123601341.cms",
    "timestamp": "2025-08-30T11:02:54Z"
  },
  {
    "title": "Trump dead rumours: When White House offered head-scratching excuse for President's new bruise amid health concerns",
    "description": "X has been buzzing with a bizarre phrase: “Trump is dead.” The chatter traces back to Vice President JD Vance’s interview with USA Today on August 27 where he claimed he is ready to be the next US President if a tragedy happens. The hashtag comes at a time wh…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-dead-rumours-when-white-house-offered-head-scratching-excuse-for-presidents-new-bruise-amid-health-concerns/articleshow/123601254.cms",
    "timestamp": "2025-08-30T11:01:05Z"
  },
  {
    "title": "Poli Sci Experts Predict What Exactly Gavin Newsom's Mockery Of Trump Could Achieve",
    "description": "The California governor is utilizing a particular strategy in his relentless attacks on Trump, and professors of political science have thoughts.",
    "link": "https://www.huffpost.com/entry/poli-sci-experts-predict-how-gavin-newsoms-brutal-mockery-of-trump-and-maga-will-resonate-goog_n_68af1662e4b0c24bc53d0529",
    "timestamp": "2025-08-30T11:00:17Z"
  },
  {
    "title": "Handwriting Analysts Have Seen Trump's Giant Signature — And They Have Thoughts",
    "description": "The way your letters slant or curve and the direction of your pen strokes can reveal a lot about your personality, according to graphologists.",
    "link": "https://www.huffpost.com/entry/donald-trumps-striking-signature-has-people-wondering-if-theres-a-meaning-behind-it-handwriting-analysts-weigh-in-goog_n_68af192fe4b0d635adb31531",
    "timestamp": "2025-08-30T11:00:17Z"
  },
  {
    "title": "Why Team Trump Wants to Deport Abrego Garcia",
    "description": "WASHINGTON—Some 13 years ago, Kilmar Abrego Garcia, then 16, crossed the U.S.-Mexico border illegally. The Salvadoran citizen did not have a run-in with the law... Read More\nThe post Why Team Trump Wants to Deport Abrego Garcia appeared first on The Daily Sig…",
    "link": "https://www.dailysignal.com/2025/08/30/why-team-trump-wants-to-deport-abrego-garcia/",
    "timestamp": "2025-08-30T11:00:00Z"
  },
  {
    "title": "The Republican Who Isn’t Afraid to Hear From His Constituents",
    "description": "A lawmaker from Missouri bucked his party and held 15 public events this week. Here’s what he heard.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/mark-alford-missouri-town-hall/684048/",
    "timestamp": "2025-08-30T11:00:00Z"
  },
  {
    "title": "Links 8/30/2025",
    "description": "Our vivid daily links: Solar wave? Trump approval tanks, ChatGPT reports to police, US bars Palestian diplomats, Japan-China gas field row, India tariff hit, Israel plans Lebanon invasion, US drug chains halt Covid vaccines, rat population rise, more Lisa Coo…",
    "link": "https://www.nakedcapitalism.com/2025/08/links-8-30-2025.html",
    "timestamp": "2025-08-30T10:55:24Z"
  },
  {
    "title": "What happens to Trump’s tariffs now that a federal appeals court has knocked them down?",
    "description": "President Donald Trump has audaciously claimed virtually unlimited power to bypass Congress and impose sweeping taxes on foreign products",
    "link": "https://www.wftv.com/news/what-happens-trumps/CH4DTXYJMRDG7NDUP5I6GIDISE/",
    "timestamp": "2025-08-30T10:53:19Z"
  },
  {
    "title": "Russia strikes across Ukraine as peace prospects flounder",
    "description": "Russia launched “massive” strikes across Ukraine overnight, rescue services said on Saturday, a new blow to peace efforts that drew a fresh appeal from President Volodymyr Zelensky for US and European help. Despite a recent flurry of international efforts to …",
    "link": "https://www.digitaljournal.com/world/russia-strikes-across-ukraine-as-peace-prospects-flounder/article",
    "timestamp": "2025-08-30T10:52:20Z"
  },
  {
    "title": "Russia Strikes Across Ukraine As Peace Prospects Flounder",
    "description": "Russia launched \"massive\" strikes across Ukraine overnight, rescue services said on Saturday, a new blow to peace efforts that drew a fresh appeal from President Volodymyr Zelensky for US and European help.",
    "link": "https://www.ibtimes.com/russia-strikes-across-ukraine-peace-prospects-flounder-3781995",
    "timestamp": "2025-08-30T10:51:16Z"
  },
  {
    "title": "Donald Trump is conservatism’s realization — not its betrayal",
    "description": "He gave the GOP permission to be themselves, says historian Allan Lichtman",
    "link": "https://www.salon.com/2025/08/30/donald-trump-is-conservatisms-realization-not-its-betrayal/",
    "timestamp": "2025-08-30T10:45:06Z"
  },
  {
    "title": "Brazil launching data center incentives next month to woo big tech, sources say",
    "description": "US President Donald Trump has tied the tariff to the trial of Brazilian former President Jair Bolsonaro, as well as complaints about regulation of US tech companies, including alleged censorship of social media platforms.",
    "link": "https://economictimes.indiatimes.com/tech/technology/brazil-launching-data-center-incentives-next-month-to-woo-big-tech-sources-say/articleshow/123601062.cms",
    "timestamp": "2025-08-30T10:44:40Z"
  },
  {
    "title": "Trump Facing 'Self-Inflicted Disaster,' Nobel Prize-Winning Economist Says",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is facing a \"self-inflicted disaster\" on the economy, a Nobel Prize-winning economist has said.\nA federal appeals court ruled on Friday that most of Trump's tariffs were imposed unlawful…",
    "link": "https://biztoc.com/x/7602c668a9387049",
    "timestamp": "2025-08-30T10:39:36Z"
  },
  {
    "title": "Trump Facing 'Self-Inflicted Disaster,' Nobel Prize-Winning Economist Says",
    "description": "A federal appeals court ruled on Friday that most of President Trump's tariffs were illegal.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-ruling-economy-2122045",
    "timestamp": "2025-08-30T10:31:55Z"
  },
  {
    "title": "Gun violence is an epidemic — and GOP transphobia won’t cure it",
    "description": "Fearmongering and scapegoating do nothing for community safety",
    "link": "https://www.salon.com/2025/08/30/gun-violence-is-an-epidemic-and-gop-transphobia-wont-cure-it/",
    "timestamp": "2025-08-30T10:30:25Z"
  },
  {
    "title": "New $250 \"visa integrity fee\" for non-visa waiver nations like India to deepen US travel slump",
    "description": "New $250 visa fee for U.S. travelers from non-visa waiver countries like Mexico, India, China raises total cost to $442.",
    "link": "https://www.thehindubusinessline.com/news/world/new-250-visa-integrity-fee-for-non-visa-waiver-nations-like-india-to-deepen-us-travel-slump/article69992747.ece",
    "timestamp": "2025-08-30T10:29:04Z"
  },
  {
    "title": "Most of President Donald Trump’s tariffs are not legal, US court rules",
    "description": "The US president has made tariffs a pillar of America’s foreign policy in his second term.",
    "link": "https://7news.com.au/news/most-of-president-donald-trumps-tariffs-are-not-legal-us-court-rules-c-19853986",
    "timestamp": "2025-08-30T10:27:53Z"
  },
  {
    "title": "Past elections echo in governor's race as Labor Day push begins",
    "description": "Lt. Gov. Winsome Earle-Sears is emulating aspects of Gov. Glenn Youngkin's 2021 campaign while Abigail Spanberger's bears similarities to Ralph Northam's 2017 strategy.",
    "link": "https://richmond.com/news/state-regional/government-politics/elections/article_4e76f30f-1fc6-43df-b215-da66945a8cea.html",
    "timestamp": "2025-08-30T10:15:00Z"
  },
  {
    "title": "What's behind the baseless rumours that US President Donald Trump 'is dead'?",
    "description": "Donald Trump has been out of the public eye for a few days, and the internet has lost its mind over it.",
    "link": "https://www.thejournal.ie/is-donald-trump-dead-6803484-Aug2025/",
    "timestamp": "2025-08-30T10:12:19Z"
  },
  {
    "title": "Federal Judge Blocks Kari Lake from Firing VOA President, Ensures Taxpayers Keep Paying Him Six Figures to Do Nothing",
    "description": "Federal Judge Blocks Kari Lake from Firing VOA President, Ensures Taxpayers Keep Paying Him Six Figures to Do Nothingwesternjournal.com",
    "link": "https://www.westernjournal.com/federal-judge-blocks-kari-lake-firing-voa-president-ensures-taxpayers-keep-paying-six-figures-nothing/",
    "timestamp": "2025-08-30T10:04:23Z"
  },
  {
    "title": "Will Venezuela Be the First Target of Trump's New MAGA Monroe Doctrine?",
    "description": "Trump \"believes that if you are powerful, you should use your power,\" a former senior U.S. official told Newsweek.",
    "link": "https://www.newsweek.com/will-venezuela-first-target-trumps-new-maga-monroe-doctrine-2121883",
    "timestamp": "2025-08-30T10:00:01Z"
  },
  {
    "title": "Trump’s immigration crackdown sweeps up 2 firefighters battling a wildfire in Washington state",
    "description": "Chris Hayes blasts the Trump administration for directing immigration agents to arrest firefighters battling Washington's Bear Gulch fire.",
    "link": "https://www.msnbc.com/top-stories/latest/ice-agents-firefighters-washington-bear-gulch-fire-rcna228075",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "One group of Democrats knows how to run — and win — Trump’s crime debate",
    "description": "President Donald Trump’s recent focus on urban crime presents a classic dilemma for Democrats: Push back, or acquiesce to a power grab?",
    "link": "https://www.msnbc.com/news/news-analysis/trump-crime-democratic-mayors-chicago-baltimore-rcna227746",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "JB Pritzker Just Set Himself Apart From All Other Democrats",
    "description": "As Donald Trump’s goon-squad occupation of the nation’s capital wends its way into its third week, the president is already eyeing the next Democratic stronghold he’d like to strangle with his bruised hands in the name of “fighting crime.” Among the municipal…",
    "link": "https://newrepublic.com/post/199800/jb-pritzker-trump-opposition-2028",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "The DOJ Is a Snake Pit—and It’s Only Getting Worse",
    "description": "Trump critics are being targeted by his cronies. No one is safe.",
    "link": "https://www.esquire.com/news-politics/politics/a65937305/doj-edward-martin-joni-ernst-trump/",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "Why the world must reject Israel's reason for attacking Gaza's Nasser Hospital",
    "description": "Israel struck Nasser Hospital in Gaza killing 22 people, including five journalists. Video shows Israel struck the hospital in four deadly successive strikes.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/israel-gaza-al-nasser-hospital-attack-dehumanizes-palestinians-rcna228014",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "Kamala Harris’ security protection revoked – media",
    "description": "Before leaving office, then-US President Joe Biden extended the former VP’s protection by a full year beyond the six months required by law Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623701-harris-security-protection-revoked/",
    "timestamp": "2025-08-30T09:53:01Z"
  },
  {
    "title": "US Supreme Court to rule on validity of Trump tariffs, in force till Oct 14",
    "description": "The 7-4 decision upholds an earlier ruling striking down Trump’s tariff strategy, but the duties will remain in force until October 14, allowing the administration time to appeal",
    "link": "https://www.thehindubusinessline.com/news/world/us-supreme-court-to-rule-on-validity-of-trump-tariffs-in-force-till-oct-14/article69992667.ece",
    "timestamp": "2025-08-30T09:45:57Z"
  },
  {
    "title": "People Are Actually Standing Up to Trump??",
    "description": "This week, we bring you some things to feel hopeful about (actually!).",
    "link": "https://slate.com/news-and-politics/2025/08/trump-news-lisa-cook-jb-pritzker-national-guard-rfk-jr-democrats-2026-midterms.html",
    "timestamp": "2025-08-30T09:45:00Z"
  }
]