[
  {
    "title": "Jimmy Kimmel Imagines the Pitch for Trump’s Cell Phone: ‘No 5G Mind Control Here’ | Video",
    "description": "The ABC host looks at recent news involving the current president\nThe post Jimmy Kimmel Imagines the Pitch for Trump’s Cell Phone: ‘No 5G Mind Control Here’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-trump-cell-phone-monologue/",
    "timestamp": "2025-06-18T04:59:40Z"
  },
  {
    "title": "Israel-Iran conflict: Israeli strikes killed 585 people in Iran, human rights group says",
    "description": "Israeli airstrikes hit Tehran, causing casualties and prompting residents to flee. A human rights group reports hundreds dead in Iran. Tensions escalate as Iran and the US trade threats. Donald Trump demands Iran's surrender. Iran vows retaliation for the att…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israeli-strikes-killed-585-people-in-iran-human-rights-group-says/articleshow/121923210.cms",
    "timestamp": "2025-06-18T04:55:32Z"
  },
  {
    "title": "Modi to Trump: India will not accept mediation",
    "description": "Indian Prime Minister Narendra Modi told United States President Donald Trump in their latest telephone call that his country will never accept a third-party mediation in its conflict with Pakistan, t...",
    "link": "https://biztoc.com/x/7df4a5fb4760a0ab",
    "timestamp": "2025-06-18T04:54:17Z"
  },
  {
    "title": "Crude oil futures rise as Israel-Iran conflict enters sixth day",
    "description": "Crude oil futures traded higher on Wednesday morning as the Israel-Iran conflict entered its sixth day. This raised concerns about potential disruptions to global oil supplies.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-as-israel-iran-conflict-enters-sixth-day/article69707504.ece",
    "timestamp": "2025-06-18T04:53:05Z"
  },
  {
    "title": "Indian diplomacy being shattered; PM Modi is ' totally silent': Congress",
    "description": "The Congress party criticized the Modi government following reports of Pakistan Army Chief Gen Asim Munir's lunch with US President Trump, alleging a failure in Indian diplomacy. Jairam Ramesh highlighted Trump's claims of brokering a ceasefire between India …",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/indian-diplomacy-being-shattered-pm-modi-is-totally-silent-congress/articleshow/121923151.cms",
    "timestamp": "2025-06-18T04:53:03Z"
  },
  {
    "title": "Mayor Johnson warns Trump against deploying federal troops for immigration crackdown in Chicago",
    "description": "Chicago Mayor Brandon Johnson voiced concerns Monday about potential federal troop deployment to his city as part of former President Donald Trump’s immigration crackdown.",
    "link": "https://nypost.com/2025/06/18/us-news/mayor-brandon-johnson-warns-trump-against-deploying-federal-troops-for-immigration-crackdown-in-chicago/",
    "timestamp": "2025-06-18T04:52:22Z"
  },
  {
    "title": "Japan records trade deficit as exports suffer from Trump's tariffs",
    "description": "Japan's exports fell in May as shipments of autos to the U.S. dropped nearly 25% from a year earlier due to higher tariffs imposed by President Donald Trump....",
    "link": "https://finance.yahoo.com/news/japan-records-trade-deficit-exports-044943332.html",
    "timestamp": "2025-06-18T04:49:43Z"
  },
  {
    "title": "Dominant Chinese makers of bitcoin mining machines set up US production to beat tariffs",
    "description": "Bitmain, Canaan and MicroBT build over 90% of global mining rigs - essentially computers dedicated to number-crunching that produces bitcoin. Establishing US bases could shield them from tariffs but risks stoking security concerns the US has with China in are…",
    "link": "https://economictimes.indiatimes.com/tech/technology/dominant-chinese-makers-of-bitcoin-mining-machines-set-up-us-production-to-beat-tariffs/articleshow/121922946.cms",
    "timestamp": "2025-06-18T04:45:46Z"
  },
  {
    "title": "Steven Crowchild, Canada’s indigenous leader calls US President Trump ‘just another person’, says ‘ I stood taller than him’ at G7",
    "description": "During the G7 summit in Calgary, Tsuut’ina First Nation council member Steven Crowchild met world leaders. Despite his anger over policies, Crowchild decided to stay. He advocated for Indigenous rights and environmental protection. He spoke in his traditional…",
    "link": "https://economictimes.indiatimes.com/news/international/us/steven-crowchild-canadas-indigenous-leader-calls-us-president-trump-just-another-person-says-i-stood-taller-than-him-at-g7/articleshow/121922703.cms",
    "timestamp": "2025-06-18T04:38:06Z"
  },
  {
    "title": "Stocks rise despite Middle East tensions as auto sector leads gains",
    "description": "Sensex opened at 81,314.62 and is currently trading at 81,761.49, up 178.19 points or 0.22% and Nifty opened at 24,788.35 and has risen to 24,922.50, gaining 69.10 points or 0.28%",
    "link": "https://www.thehindubusinessline.com/markets/stocks-rise-despite-middle-east-tensions-as-auto-sector-leads-gains/article69707455.ece",
    "timestamp": "2025-06-18T04:37:34Z"
  },
  {
    "title": "Inside the clashes between Trump and Gabbard (Politico)",
    "description": "Politico:\nInside the clashes between Trump and Gabbard  —  The director of national intelligence has rankled Trump with her statements about nuclear war, and the president has suggested she's off message.  —  As President Donald Trump privately mulled joining…",
    "link": "https://www.memeorandum.com/250618/p2",
    "timestamp": "2025-06-18T04:35:00Z"
  },
  {
    "title": "Iran-Israel conflict raises alarm in Pakistan amid fears over own security",
    "description": "Pakistan navigates tense diplomacy amid Israel-Iran conflict, fearing secessionist and strategic fallout.",
    "link": "https://www.aljazeera.com/news/2025/6/18/iran-israel-conflict-raises-alarm-in-pakistan-amid-fears-over-own-security",
    "timestamp": "2025-06-18T04:31:14Z"
  },
  {
    "title": "Man charged with killing prominent lawmaker could face a rarity for Minnesota: the death penalty",
    "description": "The man charged with killing a prominent Minnesota lawmaker and wounding another could face the death penalty, something that is a rarity for Minnesota but could become more common under the Trump administration",
    "link": "https://abcnews.go.com/US/wireStory/man-charged-killing-prominent-lawmaker-face-rarity-minnesota-122956755",
    "timestamp": "2025-06-18T04:30:22Z"
  },
  {
    "title": "Hegseth faces more grilling from Congress as Iran-Israel conflict escalates",
    "description": "Defense Secretary Pete Hegseth is returning to Capitol Hill for the last in a series of hearings before lawmakers",
    "link": "https://abcnews.go.com/US/wireStory/hegseth-faces-grilling-congress-iran-israel-conflict-escalates-122956394",
    "timestamp": "2025-06-18T04:22:20Z"
  },
  {
    "title": "Tucker Tells Bannon Israel-Iran Conflict Could ‘End Trump’s Presidency’ and ‘American Empire’",
    "description": "Tucker Carlson warned Monday that U.S. involvement in the escalating Israel-Iran conflict could bring down President Donald Trump and mark the collapse of America’s global influence. In an appearance on Steve Bannon’s WarRoom, Carlson argued a full-scale war …",
    "link": "https://freerepublic.com/focus/f-chat/4323732/posts",
    "timestamp": "2025-06-18T04:20:17Z"
  },
  {
    "title": "A Bit About the Upcoming War",
    "description": "It has been apparent for some time that, like most true cowards, Donald Trump wants to see a bunch of young men go blow eachother to horrible bits for him. I am reminded of an account of Heinrich Himmler who, apparently, wanted to see some actual Jews slaught…",
    "link": "https://freethoughtblogs.com/stderr/2025/06/18/a-bit-about-the-upcoming-war/",
    "timestamp": "2025-06-18T04:19:52Z"
  },
  {
    "title": "Khamenei: The battle begins – Scenarios Trump is weighing for U.S. involvement in the war – Iran launches dozens of ballistic missiles, Israel bombs sector of Tehran (updated)",
    "description": "Live updates \nThe post Khamenei: The battle begins – Scenarios Trump is weighing for U.S. involvement in the war – Iran launches dozens of ballistic missiles, Israel bombs sector of Tehran (updated) appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/06/18/trump-rushes-back-to-washington-amid-escalating-crisis-warns-iranians-to-evacuate-tehran-immediately-explosions-reported-in-the-iranian-capital/",
    "timestamp": "2025-06-18T04:18:00Z"
  },
  {
    "title": "India will not accept third-party mediation of relations with Pakistan, Modi tells Trump",
    "description": "NEW DELHI (Reuters) -India Prime Minister Narendra Modi told U.S. President Donald Trump that India would never accept third-party mediation in its conflict with Pakistan, India's Foreign Secretary Vikram Misri said on Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/18/india-will-not-accept-third-party-mediation-of-relations-with-pakistan-modi-tells-trump",
    "timestamp": "2025-06-18T04:18:00Z"
  },
  {
    "title": "Fed Faces Tough Backdrop Amid War and Weak Data",
    "description": "Hostilities in the Middle East have intensified, with the Israel-Iran conflict entering its sixth day. Investor anxiety is growing over the possibility of direct U.S. military involvement. President Donald Trump has called for Iran’s unconditional surrender, …",
    "link": "https://m.economictimes.com/markets/stocks/news/fed-faces-tough-backdrop-amid-war-and-weak-data/rising-geopolitical-tensions-shake-markets/slideshow/121922424.cms",
    "timestamp": "2025-06-18T04:16:59Z"
  },
  {
    "title": "Chinese firms slam von der Leyen’s hawkish anti-Beijing turn",
    "description": "EU firms based in China, however, echoed the European Commission president’s criticisms of Beijing’s protectionist policies.",
    "link": "https://www.euractiv.com/section/politics/news/chinese-firms-slam-von-der-leyens-hawkish-anti-beijing-turn/",
    "timestamp": "2025-06-18T04:15:43Z"
  },
  {
    "title": "Air Campaigns don’t Win Wars on their Own: Why Israel will largely Fail in Iran",
    "description": "Ann Arbor (Informed Comment) - Israel's militarily useless, entirely unprovoked and wholly illegal air war on Iran differs significantly from its previous wars in the region, which involved ground invasions with armor and infantry. Israel defeated Egypt in 19…",
    "link": "https://www.juancole.com/2025/06/campaigns-israel-largely.html",
    "timestamp": "2025-06-18T04:15:35Z"
  },
  {
    "title": "Israel, Iran exchange strikes as Trump demands unconditional surrender",
    "description": "Tel Aviv, June 18: Israel has carried out airstrikes across Iran while Tehran fired back, marking the sixth consecutive day […]\nThe post Israel, Iran exchange strikes as Trump demands unconditional surrender appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/06/18/israel-iran-exchange-strikes-as-trump-demands-unconditional-surrender/",
    "timestamp": "2025-06-18T04:15:00Z"
  },
  {
    "title": "Economists cut Singapore’s 2025 growth forecast to 1.7% on geopolitical tensions, global slowdown",
    "description": "The economists in the MAS survey also see growth stuck at 1.7 per cent in 2026. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/economists-cut-singapores-2025-growth-forecast-to-1-7-on-geopolitical-tensions-global-slowdown",
    "timestamp": "2025-06-18T04:14:24Z"
  },
  {
    "title": "Promise Kept: Trump Blocked Every Border Migrant in May",
    "description": "Border Patrol agents did not release any illegal migrants into the United States during the month of May, a decrease from the more than 60,000 who were released into the U.S. the year before, according to a report.\nThe post Promise Kept: Trump Blocked Every B…",
    "link": "https://www.breitbart.com/politics/2025/06/17/promise-kept-trump-blocked-every-border-migrant-may/",
    "timestamp": "2025-06-18T04:14:08Z"
  },
  {
    "title": "Biden-appointed judge blocks Trump's move to only allow two genders on US passports",
    "description": "Biden-appointed U.S. Judge Julia Kobick issued a ruling Tuesday to temporarily block the Trump administration’s move to only allow two genders, male and female, on U.S. passports.",
    "link": "https://www.foxnews.com/politics/biden-appointed-judge-blocks-trumps-move-only-allow-two-genders-us-passports",
    "timestamp": "2025-06-18T04:13:43Z"
  },
  {
    "title": "India will not accept third-party mediation of relations with Pakistan, Modi tells Trump",
    "description": "India Prime Minister Narendra Modi told U.S. President Donald Trump that India would never accept third-party mediation in its conflict with Pakistan...",
    "link": "https://www.yahoo.com/news/india-not-accept-third-party-041222435.html",
    "timestamp": "2025-06-18T04:12:22Z"
  },
  {
    "title": "Trump’s crucial dilemma for US involvement in the Iran-Israel conflict: The “silence” and the leaks",
    "description": "The American President is oriented towards a military response, despite his election rhetoric against wars, while Paris is keeping its distance and London is taking a wait-and-see attitude\nThe post Trump’s crucial dilemma for US involvement in the Iran-Israel…",
    "link": "https://en.protothema.gr/2025/06/18/trumps-crucial-dilemma-for-us-involvement-in-the-iran-israel-conflict-the-silence-and-the-leaks/",
    "timestamp": "2025-06-18T04:11:36Z"
  },
  {
    "title": "PM Modi makes it clear to Trump: US played no role in India-Pakistan ceasefire",
    "description": "Modi-Trump talks: Prime Minister Narendra Modi refuted Donald Trump's claims of third-party involvement in India-Pakistan ceasefire talks during a phone call. Modi clarified that no discussions on a trade deal or US mediation occurred during Operation Sindoor…",
    "link": "https://economictimes.indiatimes.com/news/defence/narendra-modi-trump-phone-call-pm-modi-makes-it-clear-to-trump-us-played-no-role-in-india-pakistan-ceasefire-no-talks-on-india-us-trade-deal/articleshow/121922239.cms",
    "timestamp": "2025-06-18T04:11:24Z"
  },
  {
    "title": "Inside the Clashes Between Trump and Tulsi Gabbard",
    "description": "“As President Donald Trump privately mulled joining Israel’s campaign against Iran this month, one member of his Cabinet sent what he viewed as an audacious attempt to steer him in the opposite direction,” Politico reports.",
    "link": "https://politicalwire.com/2025/06/18/inside-the-clashes-between-trump-and-tulsi-gabbard/",
    "timestamp": "2025-06-18T04:10:09Z"
  },
  {
    "title": "Oil prices spike, US stocks fall on Israel-Iran crisis",
    "description": "Oil prices have spiked amid fears that the Israel-Iran crisis could spiral into a broader conflict involving the United States.\nBrent North Sea Crude and West Texas Intermediate – the two most popular oil benchmarks – rose 4.4 percent and 4.3, respectively, o…",
    "link": "https://biztoc.com/x/f838151573bce755",
    "timestamp": "2025-06-18T04:09:34Z"
  },
  {
    "title": "Inside the clashes between Trump and Gabbard\nThe director of national intelligence has rankled Trump with her statements about nuclear war, and the president has suggested she’s off message.",
    "description": "As President Donald Trump privately mulled joining Israel’s campaign against Iran this month, one member of his Cabinet sent what he viewed as an audacious attempt to steer him in the opposite direction. At 5:30 a.m. on June 10, Director of National Intellige…",
    "link": "https://freerepublic.com/focus/f-chat/4323729/posts",
    "timestamp": "2025-06-18T04:08:58Z"
  },
  {
    "title": "PM Modi declines Trump's invitation to meet in the US due to pre-existing schedule, says Foreign secretary Vikram Misri",
    "description": "Prime Minister Modi and President Trump engaged in a 35-minute phone call, where Trump invited Modi to the US during his Canada visit, which Modi declined due to prior commitments. Modi briefed Trump on Operation Sindoor, clarifying that trade was not discuss…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-declines-trumps-invitation-to-meet-in-the-us-due-to-pre-existing-schedule-foreign-secretary-vikram-misri/articleshow/121922157.cms",
    "timestamp": "2025-06-18T04:07:56Z"
  },
  {
    "title": "Can Trump Manage an Unbelievably Small War?",
    "description": "Few wars start with the intention of regime change.\nThe post Can Trump Manage an Unbelievably Small War? appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/can-trump-manage-an-unbelievably-small-war/",
    "timestamp": "2025-06-18T04:05:00Z"
  },
  {
    "title": "Israel-Iran War: History shows you cannot assassinate your way to Peace",
    "description": "By Matt Fitzpatrick, Flinders University (The Conversation) - In the late 1960s, the prevailing opinion among Israeli Shin Bet intelligence officers was that the key to defeating the Palestinian Liberation Organisation was to assassinate its then-leader Yasse…",
    "link": "https://www.juancole.com/2025/06/history-cannot-assassinate.html",
    "timestamp": "2025-06-18T04:04:13Z"
  },
  {
    "title": "Tokyo Gas expects no direct impact on LNG buying from Iran-Israel conflict",
    "description": "TOKYO :Japan's biggest city-gas supplier, Tokyo Gas, sees no direct impact on its liquefied natural gas (LNG) procurement from the Iran-Israel conflict, a company executive said on Wednesday.\"Since we don't import LNG from Qatar or UAE, our LNG procurement is…",
    "link": "https://www.channelnewsasia.com/business/tokyo-gas-expects-no-direct-impact-lng-buying-iran-israel-conflict-5188786",
    "timestamp": "2025-06-18T04:03:15Z"
  },
  {
    "title": "America First – We Hardly Knew Ye",
    "description": "The Donald called Fed Chairman Powell a “numbskull” last week and deservedly so. But to paraphrase an old adage, when the cap fits said numbskulls tend to wear it themselves. Surely, that’s where we are this morning upon Israel’s reprehensible attack on Iran’…",
    "link": "https://www.lewrockwell.com/2025/06/david-stockman/america-first-we-hardly-knew-ye/",
    "timestamp": "2025-06-18T04:01:00Z"
  },
  {
    "title": "Israel – Iran: the Confrontation",
    "description": "The confrontation between Israel and Iran does not at all correspond to the image presented by the media. Its roots lie in a period before the Islamic Republic and has nothing to do with the construction of a nuclear bomb. Its outbreak today is intended to co…",
    "link": "https://www.lewrockwell.com/2025/06/thierry-meyssan/israel-iran-the-confrontation/",
    "timestamp": "2025-06-18T04:01:00Z"
  },
  {
    "title": "Digiday Podcast at Cannes: From center stage to closed doors, inside X’s quiet Cannes strategy",
    "description": "Once a Cannes hotspot, Twitter Beach is no more. In this episode, we explore X’s quiet retreat from the Croisette—and why no one’s talking about the TikTok ban either.",
    "link": "http://digiday.com/marketing/digiday-podcast-at-cannes-from-center-stage-to-closed-doors-inside-xs-quiet-cannes-strategy/",
    "timestamp": "2025-06-18T04:01:00Z"
  },
  {
    "title": "'Daily Show' Roasts The 'F**k' Out Of Trump's 'Fantastic' Response To Israel-Iran War",
    "description": "'Daily Show' Roasts The 'F**k' Out Of Trump's 'Fantastic' Response To Israel-Iran Warhuffpost.com",
    "link": "https://www.huffpost.com/entry/daily-show-jordan-klepper-trump-vance-iran-israel-war_n_68521f9fe4b0ed75e6747c2d",
    "timestamp": "2025-06-18T04:00:49Z"
  },
  {
    "title": "Will Trump Curtail the Immigration Crackdown on Behalf of Business?",
    "description": "For its entire tenure, the Biden administration purposefully and maliciously left the border unguarded, which allowed millions of illegal aliens, including violent individuals, drug smugglers, human traffickers, and potential terrorists to ...",
    "link": "https://www.americanthinker.com/articles/2025/06/will_trump_curtial_the_immigration_crackdown_on_behalf_of_business.html",
    "timestamp": "2025-06-18T04:00:00Z"
  },
  {
    "title": "Roseanne Barr Really is America",
    "description": "Politics is hilarious. Most politicians are no more than court jesters, performing for the audience shamelessly and with zero self-awareness.\r\n\r\nWho could ever forget AOC pretending to weep at the gates of an illegal alien detention center? Or Nancy ...",
    "link": "https://www.americanthinker.com/articles/2025/06/roseanne_barr_really_em_is_em_america.html",
    "timestamp": "2025-06-18T04:00:00Z"
  },
  {
    "title": "Pat Buchanan, a hero who deserves Trump’s Medal of Freedom",
    "description": "Pat Buchanan took no prisoners.\r\n\r\nThe now-retired columnist and former presidential candidate, who is still among us, had an aim to defend America's superiority. And if his political nemeses got their feelings hurt during his...",
    "link": "https://www.americanthinker.com/blog/2025/06/pat_buchanan_a_hero_who_deserves_trump_s_medal_of_freedom.html",
    "timestamp": "2025-06-18T04:00:00Z"
  },
  {
    "title": "Will We Finally See a Persian Renaissance?",
    "description": "Back in 2007 I received a mysterious call at the New York Sun from a man who said he was referred to me from someone at the New York Times. He said he needed to meet with me on an issue too important to speak about on the phone.\r\n\r\nThe Times reporter...",
    "link": "https://www.americanthinker.com/articles/2025/06/will_we_finally_see_a_persian_renaissance.html",
    "timestamp": "2025-06-18T04:00:00Z"
  },
  {
    "title": "MA governor on-track to spend more than $1 billion in FY2025 on ‘emergency shelter’ program that largely serves illegal migrants",
    "description": "To be honest, I for one am completely underwhelmed by the “largest deportation operation in American history.” Wake me up when we start deporting more illegals than Obummer and Crooked Joe, but, here’s a tip for ICE: Start at the sh...",
    "link": "https://www.americanthinker.com/blog/2025/06/ma_governor_on_track_to_spend_more_than_1_billion_in_fy2025_on_emergency_shelter_program_that_largely_serves_illegal_migrants.html",
    "timestamp": "2025-06-18T04:00:00Z"
  },
  {
    "title": "Strong commodity prices boost Kiwi dollar, US currency under pressure",
    "description": "Concerns about the US dollar have seen other currencies gain, including the NZ dollar.",
    "link": "https://www.nzherald.co.nz/business/markets/currency/strong-commodity-prices-boost-kiwi-dollar-us-currency-under-pressure/YQB5AI6PPNHDBHVJTCLF56G57Q/",
    "timestamp": "2025-06-18T03:59:50Z"
  },
  {
    "title": "Spanish-language journalist who documents immigration raids detained for ICE after protest arrest",
    "description": "A Spanish-language journalist known for documenting immigration raids could face deportation proceedings after police arrested him on charges of obstructing officers and unlawful assembly as he covered a weekend protest outside Atlanta",
    "link": "https://abcnews.go.com/US/wireStory/spanish-language-journalist-documents-immigration-raids-detained-ice-122944707",
    "timestamp": "2025-06-18T03:58:15Z"
  },
  {
    "title": "Trump grants TikTok 90-day lifeline amidst sale negotiations",
    "description": "President Trump issues a 90-day extension for TikTok to find a non-Chinese buyer, marking the app's third reprieve from a looming ban based on national security concerns.",
    "link": "https://www.israelnationalnews.com/news/410212",
    "timestamp": "2025-06-18T03:55:17Z"
  },
  {
    "title": "Joe Biden crashes Amazon’s ‘Reacher’ set in Philadelphia during police chase scene",
    "description": "Former President Biden visited the set with his wife Jill and his son Hunter.",
    "link": "https://nypost.com/2025/06/17/media/joe-biden-crashes-amazons-reacher-set-during-police-chase-scene/",
    "timestamp": "2025-06-18T03:47:54Z"
  },
  {
    "title": "How has US shifted military jets and ships in Middle East?",
    "description": "America is moving military aircraft and warships to the Middle East. This is to shield Israel from potential Iranian attacks. President Trump has warned Tehran to de-escalate. The US military is also ensuring the safety of its troops and bases in the region. …",
    "link": "https://economictimes.indiatimes.com/news/defence/how-has-us-shifted-military-jets-and-ships-in-middle-east/articleshow/121921980.cms",
    "timestamp": "2025-06-18T03:47:35Z"
  },
  {
    "title": "'Incensed' Trump clashes with spy chief who posted 'cryptic' warning",
    "description": "President Donald Trump is reportedly frustrated with his director of national intelligence, Tulsi Gabbard, after she posted a “cryptic” video warning about the threat of nuclear war – a message that appeared to be at odds with the MAGA administration’s positi…",
    "link": "https://www.rawstory.com/tulsi-gabbard-2672388902/",
    "timestamp": "2025-06-18T03:46:08Z"
  },
  {
    "title": "Trump Reportedly Became ‘Incensed’ at Tulsi Gabbard Over ‘Unauthorized Video’ in Which She Slammed ‘Warmongers’",
    "description": "By most accounts, President Donald Trump has largely sidelined Director of National Intelligence Tulsi Gabbard. On Tuesday night, Politico dropped a report explaining why.\nThe post Trump Reportedly Became ‘Incensed’ at Tulsi Gabbard Over ‘Unauthorized Video’ …",
    "link": "https://www.mediaite.com/politics/trump-reportedly-became-incensed-at-tulsi-gabbard-over-unauthorized-video-in-which-she-slammed-warmongers/",
    "timestamp": "2025-06-18T03:40:57Z"
  },
  {
    "title": "Trump's Advisers Disagree on Possible US Strikes on Iran - Reports",
    "description": "There is no full agreement among US President Donald Trump's closest advisers on possible ​​US participation in the Israeli operation against Iran and its nuclear facilities, the CBS News broadcaster reported on Tuesday.",
    "link": "https://sputnikglobe.com/20250618/trumps-advisers-disagree-on-possible-us-strikes-on-iran---reports-1122276004.html",
    "timestamp": "2025-06-18T03:39:00Z"
  },
  {
    "title": "IAF conducts overnight strikes in Tehran",
    "description": "IDF announces that the IAF is conducting strikes in Tehran. According to reports in Iran, Israel targeted Imam Hussein University, which is linked to the Revolutionary Guards. Earlier, Iran fired 25 missiles in two salvos.",
    "link": "https://www.israelnationalnews.com/news/410211",
    "timestamp": "2025-06-18T03:35:07Z"
  },
  {
    "title": "Tucker Carlson Tears Into Ted Cruz In The Most Gloriously Awkward Interview You'll See",
    "description": "The right-wing media personality got into a shouting match with the Republican senator from Texas.",
    "link": "https://www.huffpost.com/entry/tucker-carlson-ted-cruz_n_68521bdde4b038d013e2b23f",
    "timestamp": "2025-06-18T03:32:19Z"
  },
  {
    "title": "Iran says hypersonic missiles fired at Israel as Trump demands 'unconditional surrender'",
    "description": "Iran claimed early Wednesday to have fired hypersonic missiles at Israel in the latest round of overnight strikes between the archfoes, hours after Donald Trump demanded the Islamic republic's \"unconditional surrender\". Back in Washington on Tuesday, Trump de…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-says-hypersonic-missiles-fired-at-israel-as-trump-demands-unconditional-surrender/articleshow/121921751.cms",
    "timestamp": "2025-06-18T03:29:49Z"
  },
  {
    "title": "Did not have any proof of Iran's effort to move into a nuclear weapon: IAEA Chief",
    "description": "Amid escalating tensions between Iran and Israel, the IAEA Director-General stated they lack proof of Iran pursuing nuclear weapons. This contrasts with reports citing Israeli intelligence suggesting Iran's advanced nuclear weapon design experiments. The US S…",
    "link": "https://economictimes.indiatimes.com/news/defence/did-not-have-any-proof-of-irans-effort-to-move-into-a-nuclear-weapon-iaea-chief/articleshow/121921748.cms",
    "timestamp": "2025-06-18T03:29:35Z"
  },
  {
    "title": "Macron: Violent regime change in Iran would be a mistake",
    "description": "French President says he opposes violent regime change in Iran, warning it would lead to chaos and regional destabilization. His remarks come amidst fears of potential US involvement in Israel's military campaign against Iran.",
    "link": "https://www.israelnationalnews.com/news/410210",
    "timestamp": "2025-06-18T03:24:12Z"
  },
  {
    "title": "Japan's auto exports to US drop after tariffs",
    "description": "TOKYO: Japanese auto exports to the United States fell almost a quarter in May, data showed on Wednesday (Jun 18), as worries over Donald Trump's tariffs continue to grow with no deal yet made between Tokyo and Washington. Roughly 8 per cent of jobs are tied …",
    "link": "https://www.channelnewsasia.com/east-asia/japan-auto-exports-us-donald-trump-tariffs-5188726",
    "timestamp": "2025-06-18T03:23:00Z"
  },
  {
    "title": "Pharma scrips fall on Trump tariff threat",
    "description": "India Business News: Pharmaceutical stocks in India fell sharply following US President Donald Trump’s announcement of potential tariffs on the sector. Key companies like Granules India and Lupin faced significant losses as concerns over revenue impact surfac…",
    "link": "https://timesofindia.indiatimes.com/business/india-business/pharma-scrips-fall-on-trump-tariff-threat/articleshow/121921627.cms",
    "timestamp": "2025-06-18T03:21:27Z"
  },
  {
    "title": "Long India narrative continues but global investors turning impatient: Taimur Baig, DBS Bank",
    "description": "Taimur Baig from DBS Bank discusses the global economy. He says the oil market can handle Middle East tensions. Oil prices are below historical highs. Investors are optimistic about India's growth. They want faster economic progress. The US and UK may sign tr…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/long-india-narrative-continues-but-global-investors-turning-impatient-taimur-baig-dbs-bank/articleshow/121911373.cms",
    "timestamp": "2025-06-18T03:21:00Z"
  },
  {
    "title": "NYC Comptroller Lander: Trump Ratcheting Up Conflict to Turn U.S. into 'Police State'",
    "description": "New York City Comptroller and mayoral candidate Brad Lander said Tuesday on MSNBC's \"All In\" his arrest by Immigration and Customs Enforcement (ICE) agents in Manhattan was part of an attempt by President Donald Trump to turn the United States into a \"police …",
    "link": "https://www.breitbart.com/clips/2025/06/17/nyc-comptroller-lander-trump-ratcheting-up-conflict-to-turn-u-s-into-police-state/",
    "timestamp": "2025-06-18T03:16:54Z"
  },
  {
    "title": "US Senate passes stablecoin bill in milestone for crypto industry",
    "description": "Stablecoins, a type of cryptocurrency designed to maintain a constant value, usually a 1:1 dollar peg, are commonly used by crypto traders to move funds between tokens. Their use has grown rapidly in recent years, and proponents say that they could be used to…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-senate-passes-stablecoin-bill-in-milestone-for-crypto-industry/articleshow/121921606.cms",
    "timestamp": "2025-06-18T03:15:29Z"
  },
  {
    "title": "Trump Demands Iran's 'Unconditional Surrender' — Stock Futures Remain Steady, Defense Shares Trade Higher In After-Hours Trading",
    "description": "U.S. stock futures remain unfazed by President Donald Trump’s calls for an “Unconditional Surrender” by Iran on Tuesday night, as tensions continued to flare in the Middle East.\nStarting with the S&P 500 Futures, which trades at 6,045.00, up 0.11%, followed b…",
    "link": "https://biztoc.com/x/22e59f0391f1519d",
    "timestamp": "2025-06-18T03:14:24Z"
  },
  {
    "title": "How woke doomed Dems on the border",
    "description": "The Biden-era explosion in illegal immigration was a direct consequence of Peak Woke: Democrats, overly responsive to fringe activists, advocated for loosening immigration restrictions to avoid cancel-culture mobs and countersignal Donald Trump. Now, amid Tru…",
    "link": "https://biztoc.com/x/2118a4b68ce99f1f",
    "timestamp": "2025-06-18T03:14:12Z"
  },
  {
    "title": "Oil prices spike, US stocks fall on Israel-Iran crisis",
    "description": "Crude oil prices jump more than 4 percent amid fears the US may join Israel's offensive against Iran.",
    "link": "https://www.aljazeera.com/economy/2025/6/18/oil-prices-spike-us-stocks-fall-on-israel-iran-crisis",
    "timestamp": "2025-06-18T03:10:44Z"
  },
  {
    "title": "Israel launches intensive airstrikes targeting Iranian capital",
    "description": "Intense Israeli airstrikes targeted Iran's capital early Wednesday after it issued a warning about a new area it could target, a day after U.S. President Donald Trump warned Tehran's residents to evacuate and demanded that the country surrender without condit…",
    "link": "https://www.cbc.ca/news/world/intensive-israel-strikes-tehran-1.7564119",
    "timestamp": "2025-06-18T03:01:02Z"
  },
  {
    "title": "Nezza says she doesn't regret National Anthem in Spanish at Dodger Stadium",
    "description": "After Nezza sang the National Anthem in Spanish at Dodger Stadium on Saturday, the singer said she'd do it again, \"a million times.\"",
    "link": "https://www.foxla.com/news/nezza-says-she-doesnt-regret-national-anthem-spanish-dodger-stadium",
    "timestamp": "2025-06-18T03:00:39Z"
  },
  {
    "title": "Oil Stabilises After Surge, Stocks Drop As Mideast Crisis Fuels Jitters",
    "description": "Oil prices stabilised Wednesday after surging the previous day on fears of a US intervention in the Israel-Iran conflict sparked by Donald Trump calling for Tehran's \"unconditional surrender\".",
    "link": "https://www.ibtimes.com/oil-stabilises-after-surge-stocks-drop-mideast-crisis-fuels-jitters-3776050",
    "timestamp": "2025-06-18T03:00:24Z"
  },
  {
    "title": "Tucker Carlson Confronts Ted Cruz on Iran: 'You Don't Know Anything'",
    "description": "Tucker Carlson grilled Ted Cruz about Iran, telling the Texas Republican at one point that he doesn't \"know anything\" about the country.",
    "link": "https://www.newsweek.com/tucker-carlson-ted-cruz-iran-israel-trump-maga-2087084",
    "timestamp": "2025-06-18T02:58:03Z"
  },
  {
    "title": "Oil stabilises after surge, stocks drop as Mideast crisis fuels jitters",
    "description": "Oil prices stabilised Wednesday after surging the previous day on fears of a US intervention in the Israel-Iran conflict sparked by Donald Trump calling for Tehran’s “unconditional surrender”. Iran and Israel exchanged missiles for a sixth day, with the US pr…",
    "link": "https://www.digitaljournal.com/world/oil-stabilises-after-surge-stocks-drop-as-mideast-crisis-fuels-jitters/article",
    "timestamp": "2025-06-18T02:57:32Z"
  },
  {
    "title": "US Fed set to hold rates steady as it guards against inflation",
    "description": "The US central bank is expected to hold interest rates steady Wednesday after its key policy meeting, as officials gauge the impact of tariffs on inflation — and despite President Donald Trump’s calls for rate cuts. The Federal Reserve has kept the benchmark …",
    "link": "https://www.digitaljournal.com/world/us-fed-set-to-hold-rates-steady-as-it-guards-against-inflation/article",
    "timestamp": "2025-06-18T02:57:32Z"
  },
  {
    "title": "Hugh Hewitt Says Striking One Or More Parts Of Iran ‘Will Secure’ Trump’s ‘Place In History As A Peacemaker’",
    "description": "Hugh Hewitt said he believes if President Donald Trump were to destroy Iran's nuclear program then he would \"secure his place in history as a peacemaker.\"",
    "link": "https://dailycaller.com/2025/06/17/hugh-hewitt-iran-israel-war-donald-trump-nuclear-program/",
    "timestamp": "2025-06-18T02:55:56Z"
  },
  {
    "title": "Dear Democrats: I Won't Let You Exhaust Me With Your Diaper-Filling Tantrums",
    "description": "It's pretty safe to say that the Democratic Party's response to all things Trump since 2016 has made the party irredeemable. Conservatives of a certain age (\"Present\") have long talked about the kinds of Democrats we used to know. There was a wistfulness ther…",
    "link": "https://freerepublic.com/focus/f-news/4323723/posts",
    "timestamp": "2025-06-18T02:54:58Z"
  },
  {
    "title": "Clay Travis Rips Ilhan Omar: ‘Why Doesn’t She Go Back to Somalia?’",
    "description": "Clay Travis suggested that Rep. Ilhan Omar should \"go back to Somalia\" after the congresswoman said the United States was becoming \"one of the worst countries.\"\nThe post Clay Travis Rips Ilhan Omar: ‘Why Doesn’t She Go Back to Somalia?’ first appeared on Medi…",
    "link": "https://www.mediaite.com/media/tv/clay-travis-rips-ilhan-omar-why-doesnt-she-go-back-to-somalia/",
    "timestamp": "2025-06-18T02:52:37Z"
  },
  {
    "title": "US Military Action On Iran? Odds Rise On Crypto Betting Site Polymarket As Trump Demands 'Unconditional Surrender'",
    "description": "Cryptocurrency bettors on Polymarket were growing confident that the U.S. would take military action against Iran as President Donald Trump demanded \"unconditional surrender.\"\nWhat happened: The odds for the betting contract titled \"US military action against…",
    "link": "https://biztoc.com/x/97edf2d62ae07b50",
    "timestamp": "2025-06-18T02:51:34Z"
  },
  {
    "title": "The Death Of Privacy And The Radical Reshaping Of A Political System",
    "description": "Elon Musk's name will go down in history, not as the man who got us into space, but the man to helped to reshape the U.S. government into a surveillance state.",
    "link": "https://www.forbes.com/sites/hessiejones/2025/06/17/the-death-of-privacy-and-the-radical-reshaping-of-a-political-system/",
    "timestamp": "2025-06-18T02:50:00Z"
  },
  {
    "title": "Signs to police 'negative' history went up at Manzanar. Historians are nervous. (Olivia Hebert/SFGATE)",
    "description": "Olivia Hebert / SFGATE:\nSigns to police ‘negative’ history went up at Manzanar.  Historians are nervous.  —  On the orders of the Donald Trump administration, National Park Service employees hung two highly controversial signs this week at Manzanar National H…",
    "link": "https://www.memeorandum.com/250617/p178",
    "timestamp": "2025-06-18T02:50:00Z"
  },
  {
    "title": "NYT's Maggie Haberman 'struck' as Trump contradicts his own spy chief",
    "description": "New York Times reporter Maggie Haberman said she was “struck” by how President Donald Trump not only dismissed his own intelligence chief’s analysis on Iran’s nuclear activity – but also leaned entirely on his personal opinion.Appearing on The Source with Kai…",
    "link": "https://www.rawstory.com/trump-iran-2672388692/",
    "timestamp": "2025-06-18T02:48:54Z"
  },
  {
    "title": "Kremlin urges diplomacy: Israeli strikes on Iran 'unacceptable'",
    "description": "Russia's Foreign Ministry denounces Israeli attacks on Iran's nuclear sites as \"illegal\" and a threat to global security, urging diplomacy to resolve the nuclear dispute.",
    "link": "https://www.israelnationalnews.com/news/410209",
    "timestamp": "2025-06-18T02:47:21Z"
  },
  {
    "title": "Incredulous Tucker Carlson Has Shouting Match With Ted Cruz Over Basic Iran Facts: ‘You’re Calling for the Overthrow’ | Video",
    "description": "The former Fox News host argues with the Texas Senator over military action against Iran\nThe post Incredulous Tucker Carlson Has Shouting Match With Ted Cruz Over Basic Iran Facts: ‘You’re Calling for the Overthrow’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/tucker-carlson-argues-with-ted-cruz-about-iran/",
    "timestamp": "2025-06-18T02:46:12Z"
  },
  {
    "title": "Texas Defunds Border Wall Construction After Spending More Than $3 Billion to Build 65 Mile",
    "description": "The Texas Legislature cancelled the state’s program to build its own border wall as the legislative session came to a close, having spent more than $3 billion to build only about 65 miles of scattered segments. In December 2021, Texas Gov. Greg Abbott (R) ann…",
    "link": "https://freerepublic.com/focus/f-chat/4323719/posts",
    "timestamp": "2025-06-18T02:43:38Z"
  },
  {
    "title": "US Senate approves GENIUS Act to regulate stablecoins; bill moves to house",
    "description": "US Senate passed the “GENIUS Act” (68-30) to create a regulatory framework for stablecoins. The bill requires stablecoins to be backed by liquid assets and issuers to disclose reserves monthly. This is a major milestone for the crypto industry, which has long…",
    "link": "https://coinjournal.net/news/us-senate-approves-genius-act-to-regulate-stablecoins-bill-moves-to-house/",
    "timestamp": "2025-06-18T02:42:54Z"
  },
  {
    "title": "Iran cannot have a nuclear weapon: US State Department describes Trump as transparent, clear leader",
    "description": "Addressing a press briefing, US State Department Spokesperson Tammy Bruce said that President Donald Trump's commitment to preventing Iran from acquiring nuclear capabilities is a policy consistent since taking office.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-cannot-have-a-nuclear-weapon-us-state-department-describes-trump-as-transparent-clear-leader/articleshow/121921057.cms",
    "timestamp": "2025-06-18T02:42:40Z"
  },
  {
    "title": "Cruz: We Can Destroy Nuke Facility Israel Has Challenge With, It's in Our Interests to Do So",
    "description": "On Tuesday’s broadcast of the Fox News Channel’s “Hannity,” Sen. Ted Cruz (R-TX) stated that American bunker-buster bombs can take out the Fordow Iran nuclear facility, which is the only location where Israel has “a technological challenge” and “it is\nThe pos…",
    "link": "https://www.breitbart.com/clips/2025/06/17/cruz-we-can-destroy-nuke-facility-israel-has-challenge-with-its-in-our-interests-to-do-so/",
    "timestamp": "2025-06-18T02:41:07Z"
  },
  {
    "title": "Tucker Carlson grills Ted Cruz on Iran, highlighting conservative rift",
    "description": "The contentious interview is drawing more attention to the divide between conservatives on military action in the country.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/17/tucker-carlson-ted-cruz-iran-donald-trump-regime/84252622007/",
    "timestamp": "2025-06-18T02:41:04Z"
  },
  {
    "title": "Trump \"Reamed Out\" Pete Hegseth for Disastrous Military Parade (Ellie Quinlan Houghtaling/New Republic)",
    "description": "Ellie Quinlan Houghtaling / New Republic:\nTrump “Reamed Out” Pete Hegseth for Disastrous Military Parade … Donald Trump was not impressed by his multimillion-dollar military parade.  —  The president reportedly “reamed” out Defense Secretary Pete Hegseth over…",
    "link": "https://www.memeorandum.com/250617/p177",
    "timestamp": "2025-06-18T02:40:01Z"
  },
  {
    "title": "Head of world’s largest bureaucracy literally cannot manage a military parade",
    "description": "Putting an alcoholic B-tier Fox News host in charge of the Pentagon seemed like a great idea, but the results appear to be disappointing to the president: Donald Trump was not impressed by his multimillion-dollar military parade. The president reportedly “rea…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/head-of-worlds-largest-bureaucracy-literally-cannot-manage-a-military-parade",
    "timestamp": "2025-06-18T02:36:50Z"
  },
  {
    "title": "Elon Musk's X sues New York to block social media hate speech law",
    "description": "New York Attorney General Letitia James, a Democrat who enforces the state's laws, is the named defendant in X's lawsuit. Her office did not immediately respond to requests for comment. Musk, the world's richest person and recently a close adviser to Republic…",
    "link": "https://economictimes.indiatimes.com/tech/technology/elon-musks-x-sues-new-york-to-block-social-media-hate-speech-law/articleshow/121920895.cms",
    "timestamp": "2025-06-18T02:34:07Z"
  },
  {
    "title": "South African President Ramaphosa Fails to Meet Trump at G7 in Canada",
    "description": "South African President Cyril Ramaphosa traveled to Kananaskis, Alberta, Canada, for the G7 Summit, in the hopes of meeting President Donald Trump, but failed to do so before Trump returned to the United States.\nThe post South African President Ramaphosa Fail…",
    "link": "https://www.breitbart.com/africa/2025/06/17/south-african-president-ramaphosa-fails-to-meet-trump-at-g7-canada/",
    "timestamp": "2025-06-18T02:31:51Z"
  },
  {
    "title": "Mark Cuban Criticizes Bluesky, Gets Welcome Back On X By CEO Yaccarino: 'Welcome Home To The True Global Town Square'",
    "description": "Billionaire Mark Cuban has been one of the largest proponents of social media platform Bluesky, which has grown its user base as an alternative to X. Cuban's...",
    "link": "https://finance.yahoo.com/news/mark-cuban-criticizes-bluesky-gets-023133214.html",
    "timestamp": "2025-06-18T02:31:33Z"
  },
  {
    "title": "ICE arrests New York mayoral candidate for alleged assault",
    "description": "Brad Lander's arrest for the alleged assault of a federal officer is the latest confrontation between US ICE agents and Democratic politicians.",
    "link": "https://www.abc.net.au/news/2025-06-18/ice-arrests-nyc-comptroller-brad-lander-at-court-hearing/105430922",
    "timestamp": "2025-06-18T02:29:06Z"
  },
  {
    "title": "Ilhan Omar claims US turning into one of ‘worst countries’ in the world",
    "description": "The 'Squad' member said America was being destroyed by Trump.",
    "link": "https://nypost.com/2025/06/17/media/ilhan-omar-claims-us-turning-into-one-of-worst-countries-in-the-world/",
    "timestamp": "2025-06-18T02:26:14Z"
  }
]