[
  {
    "title": "Donald Trump Promised to Bring Peace to Middle East. Here's How It's Going",
    "description": "Israeli strikes on Gaza and U.S. attacks on Houthis in Yemen have added to regional instability.",
    "link": "https://www.newsweek.com/israel-trump-middle-east-peace-iran-2046510",
    "timestamp": "2025-03-18T18:13:10Z"
  },
  {
    "title": "A dreaded stagflation scenario is increasingly likely — but Trump's tariffs may be more bark than bite",
    "description": "Stocks are down due to fears about slower economic growth and higher prices. However, UBS is still upbeat due to coming clarity about Trump's tariffs.",
    "link": "https://www.businessinsider.com/stock-market-outlook-economy-stagflation-risk-trump-tariff-investing-ubs-2025-3",
    "timestamp": "2025-03-18T18:12:36Z"
  },
  {
    "title": "More Than 1,000 People Could be Fired as EPA Targets Scientific Research Team",
    "description": "More than 1,000 people could be fired as the EPA targets scientists whose work is vital to protecting human health and the environment.",
    "link": "https://time.com/7269209/epa-targets-scientific-research-office-layoffs/",
    "timestamp": "2025-03-18T18:12:01Z"
  },
  {
    "title": "Alex Marlow Exposes Anti-Trump Leftist Activist Judge Who Blocked Gang Member Deportations",
    "description": "The federal judge who moved to block President Trump's deportations of suspected Tren de Aragua (TdA) gang members is an Obama-appointed left-wing activist judge, Breitbart Editor-in-Chief Alex Marlow revealed on The Alex Marlow Show podcast.\nThe post Alex Ma…",
    "link": "https://www.breitbart.com/law-and-order/2025/03/18/alex-marlow-exposes-anti-trump-leftist-activist-judge-who-blocked-gang-member-deportations/",
    "timestamp": "2025-03-18T18:11:46Z"
  },
  {
    "title": "Top US Supreme Court justice rebukes Trump's call to impeach judge",
    "description": "Chief Justice John Roberts issued a rare statement after Trump called for a judge that halted his deportations to be impeached.",
    "link": "https://www.bbc.com/news/articles/c8j0vwpkwkxo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-03-18T18:11:31Z"
  },
  {
    "title": "Cadillac expects one of every three vehicle sales to be EVs in 2025",
    "description": "SAN FRANCISCO — Cadillac expects roughly one of every three vehicles it sells in the U.S. this year to be all-electric models, as the automaker continues to expand its EV lineup despite industrywide slower-than-expected adoption of the vehicles.",
    "link": "https://www.nbcnews.com/business/autos/cadillac-expects-one-every-three-vehicle-sales-evs-2025-rcna196930",
    "timestamp": "2025-03-18T18:11:30Z"
  },
  {
    "title": "Chief Justice John Roberts’ shot across Trump’s bow wasn’t his first",
    "description": "After Trump called for a judge's impeachment, John Roberts expressed his disagreement with the Republican. It was not, however, the first time.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/john-roberts-trump-impeachment-rulings-supreme-court-rcna196944",
    "timestamp": "2025-03-18T18:11:28Z"
  },
  {
    "title": "\"Leaders Spoke Broadly About...\": What White House Said On Trump-Putin Call",
    "description": "During an over two-hour call, US President Donald Trump and his Russian counterpart Vladimir Putin agreed that the war in Ukraine &quot;needs to end with a lasting peace&quot;, the White House said on Tuesday.",
    "link": "https://www.ndtv.com/world-news/leaders-spoke-broadly-about-what-white-house-said-on-trump-putin-call-7954775",
    "timestamp": "2025-03-18T18:10:36Z"
  },
  {
    "title": "How Congress could — but probably won't — impeach a federal judge",
    "description": "The attacks on the judiciary by Donald Trump and his allies have increased in recent days, with calls to impeach a judge who ruled against the president on deportations.",
    "link": "https://www.nbcnews.com/politics/congress/can-congress-impeach-federal-judge-why-it-wont-happen-rcna196937",
    "timestamp": "2025-03-18T18:10:35Z"
  },
  {
    "title": "UCI president David Lappartient vows to stand up to Donald Trump in pitch for top Olympic job",
    "description": "Making his move for International Olympic Committee presidency, Lappartient pledged to make Trump \"respect\" IOC autonomy on issues such as trans athletes and promised decisions would not be made \"from an ideological angle\"",
    "link": "https://road.cc/content/news/uci-president-david-lappartient-stand-trump-313097",
    "timestamp": "2025-03-18T18:10:31Z"
  },
  {
    "title": "Kremlin releases Putin-Trump phone call summary",
    "description": "Putin and Trump addressed key issues, including a proposed 30-day ceasefire, a prisoner exchange, and maritime security Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614436-kremlin-text-phone-trump/",
    "timestamp": "2025-03-18T18:09:46Z"
  },
  {
    "title": "Trump admin moves to fire hundreds of government scientists",
    "description": "The Trump administration is planning significant staff reductions at the EPA, targeting over 1,500 scientists in its research arm. This move aligns with President Trump's aim to reduce government spending and relax environmental regulations. The proposal has …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-admin-moves-to-fire-hundreds-of-government-scientists/articleshow/119174272.cms",
    "timestamp": "2025-03-18T18:09:40Z"
  },
  {
    "title": "Chuck Schumer and Hakeem Jeffries seek to defuse tensions after shutdown clash",
    "description": "The Democratic leaders in the Senate and House sought to strike a unified message on potential GOP cuts to Medicaid, even as they defended their government funding strategies.",
    "link": "https://www.nbcnews.com/politics/congress/schumer-jeffries-defuse-tensions-shutdown-clash-trump-agenda-rcna196918",
    "timestamp": "2025-03-18T18:09:33Z"
  },
  {
    "title": "Ascent for freedom: The man who climbed Big Ben",
    "description": "Day’s courage reflects the acute desperation that so many feel as we question how the leaders of the so-called free world can continue so shamelessly to gaslight us into silence.",
    "link": "https://electronicintifada.net/content/ascent-freedom-man-who-climbed-big-ben/50503",
    "timestamp": "2025-03-18T18:08:29Z"
  },
  {
    "title": "'Tesla Takedown' protest movement grows as Trump threatens criminal charges",
    "description": "Nationwide demonstrations at Elon Musk's car dealerships have earned the attention — and ire — of the White House.",
    "link": "https://theweek.com/politics/tesla-takedown-protests-musk-trump-dealership",
    "timestamp": "2025-03-18T18:08:09Z"
  },
  {
    "title": "Trump Calls for Impeachment of Judge Who Blocked Deportations, Drawing Rebuke from Justice Roberts",
    "description": "President Donald Trump's call for impeachment of the judge who moved to block the deportations of illegal aliens suspected of being in the Venezuelan gang Tren de Aragua has drawn criticism from U.S. Supreme Court Chief Justice John Roberts.  \nThe post Trump …",
    "link": "https://www.breitbart.com/politics/2025/03/18/trump-calls-for-impeachment-judge-who-blocked-deportations-drawing-rebuke-justice-roberts/",
    "timestamp": "2025-03-18T18:06:01Z"
  },
  {
    "title": "Kremlin: Putin ordered a “freeze” on strikes on Ukraine’s energy facilities",
    "description": "Putin and Trump agreed on the exchange of 175 prisoners of war between Moscow and Kyiv - Expert teams are being created for the resolution of conflicts in Ukraine - Initiative for maritime security in the Black Sea - Developments in the Middle East also on th…",
    "link": "https://en.protothema.gr/2025/03/18/kremlin-putin-ordered-a-freeze-on-strikes-on-ukraines-energy-facilities/",
    "timestamp": "2025-03-18T18:05:07Z"
  },
  {
    "title": "White House says Trump, Putin are to seek limited ceasefire on energy, infrastructure in Ukraine war",
    "description": "The White House said negotiations would “begin immediately.” It was not immediately clear whether Ukraine is on board with the phased ceasefire plan.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_0ada293e-e328-5f5a-bc1c-c1b59ff43cd4.html",
    "timestamp": "2025-03-18T18:05:00Z"
  },
  {
    "title": "Some Americans Have Already Been Caught in Trump’s Immigration Dragnet. More Will Be.",
    "description": "by Nicole Foy \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nAbout a week after President Donald Trump took office, Jonathan Guerrero was sitt…",
    "link": "https://www.propublica.org/article/more-americans-will-be-caught-up-trump-immigration-raids",
    "timestamp": "2025-03-18T18:05:00Z"
  },
  {
    "title": "Trump administration set to release JFK assassination files with no redactions",
    "description": "President Donald Trump says files related to the 1963 assassination of President John F. Kennedy will be released without any redactions, making good on a promise he made during his campaign.",
    "link": "https://biztoc.com/x/8167e6e01c443549",
    "timestamp": "2025-03-18T18:03:46Z"
  },
  {
    "title": "Wall Street should have known better than to trust Donald Trump",
    "description": "Trump has been in office two months and stocks and consumer confidence in the economy are falling while fears of inflation and the risk of a recession are rising.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-wall-street-economy-stock-market-rcna196759",
    "timestamp": "2025-03-18T18:03:43Z"
  },
  {
    "title": "China's State Media Celebrates VOA Collapse—'Dirty Rag'",
    "description": "Chinese state media has reacted with glee as President Donald Trump dismantles Voice of America (VOA).\nWhy It Matters\nPresident Donald Trump signed an executive order Sunday to close down U.S. Agency for Global Media (USAGM), which oversees VOA, Radio Free As…",
    "link": "https://biztoc.com/x/799ed655bf0c866c",
    "timestamp": "2025-03-18T18:03:37Z"
  },
  {
    "title": "Trump and Putin may have a deal, but it's a long way from ending the Ukraine war",
    "description": "Trump and Putin agreed to limit attacks on energy and infrastructure, a step on the hard road to ending the war that Russia began.",
    "link": "https://www.businessinsider.com/trump-and-putin-may-have-a-deal-but-its-a-long-way-ukraine-wars-end-2025-3",
    "timestamp": "2025-03-18T18:03:37Z"
  },
  {
    "title": "Trump, Putin agree to seek limited ceasefire in step to ending Ukraine war, White House says",
    "description": "The White House says President Donald Trump and Russian President Vladimir Putin have agreed to seek a limited ceasefire against energy and infrastructure targets in the Russia-Ukraine war.",
    "link": "https://biztoc.com/x/8110290d2ed19094",
    "timestamp": "2025-03-18T18:03:31Z"
  },
  {
    "title": "Trump and Putin Agree To Seek Limited Ceasefire in Ukraine",
    "description": "The White House said Tuesday the U.S. and Russia would seek a partial ceasefire against energy and infrastructure targets in Ukraine.",
    "link": "https://time.com/7269195/trump-putin-limited-ceasefire-ukraine/",
    "timestamp": "2025-03-18T18:03:13Z"
  },
  {
    "title": "Musk conflict complaints appear moot with Trump in charge - Roll Call",
    "description": "Complaints about Elon Musk’s potential conflicts of interest won't go before independent watchdog agencies.",
    "link": "https://rollcall.com/2025/03/18/musk-conflict-complaints-appear-moot-with-trump-in-charge/",
    "timestamp": "2025-03-18T18:02:45Z"
  },
  {
    "title": "FTC Removes Posts Critical of Amazon, Microsoft, and AI Companies",
    "description": "Business-guidance content published during the Biden administration has been removed from the Federal Trade Commission website.",
    "link": "https://www.wired.com/story/federal-trade-commission-removed-blogs-critical-of-ai-amazon-microsoft/",
    "timestamp": "2025-03-18T18:02:32Z"
  },
  {
    "title": "'Inappropriate' Response: Top Court Chief Amid Trump's Call For Impeachment",
    "description": "Donald Trump&#039;s rumbling conflict with the judiciary burst into open confrontation on Tuesday as Supreme Court Justice John Roberts issued a rare public rebuke of the US president over his call for the impeachment of a federal court judge.",
    "link": "https://www.ndtv.com/world-news/inappropriate-response-supreme-court-chief-amid-us-president-donald-trump-call-for-judge-impeachment-7954730",
    "timestamp": "2025-03-18T18:01:51Z"
  },
  {
    "title": "Argentina: despite the scandals, Milei’s politics are here to stay",
    "description": "Argentina’s libertarian president is going through a tough moment, but his politics is here to stay.",
    "link": "https://theconversation.com/argentina-despite-the-scandals-mileis-politics-are-here-to-stay-250183",
    "timestamp": "2025-03-18T18:01:44Z"
  },
  {
    "title": "\"Prisoner Exchange Will Be...\": Kremlin's Full Statement On Trump-Putin Call",
    "description": "US President Donald Trump and his Russian counterpart Vladimir Putin spoke for over two hours during a phone call, discussing ways to end the ongoing war in Ukraine and ways to establish &quot;lasting peace&quot;.",
    "link": "https://www.ndtv.com/world-news/prisoner-exchange-will-be-kremlins-full-statement-on-trump-putin-call-7954727",
    "timestamp": "2025-03-18T18:01:03Z"
  },
  {
    "title": "Trump administration set to release JFK assassination files with no redactions",
    "description": "President Donald Trump says files related to the 1963 assassination of President John F. Kennedy will be released without any redactions, making good on a promise he made during his campaign.",
    "link": "https://www.pbs.org/newshour/nation/trump-administration-set-to-release-jfk-assassination-files-with-no-redactions",
    "timestamp": "2025-03-18T17:59:52Z"
  },
  {
    "title": "China, Hong Kong threaten to thwart sale of Panama Canal ports to America's BlackRock",
    "description": "Chinese and Hong Kong authorities are scrutinizing a deal for BlackRock to acquire two ports on the Panama Canal, as the United States seeks to reclaim the Panama Canal.",
    "link": "https://www.foxnews.com/politics/china-hong-kong-threaten-thwart-sale-panama-canal-ports-americas-blackrock",
    "timestamp": "2025-03-18T17:59:51Z"
  },
  {
    "title": "The Constitutional Crisis Under Donald Trump Has Taken A Dangerous Turn",
    "description": "The judge said the administration couldn't send Venezuelan migrants to El Salvador, but the administration claims his oral orders weren't \"enforceable.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-alien-enemies-act-defy-court-orders_n_67d9a657e4b0e54dd7235bb3",
    "timestamp": "2025-03-18T17:59:19Z"
  },
  {
    "title": "Putin Agrees to Energy Infrastructure Ceasefire",
    "description": "\"President Vladimir Putin committed in a phone call with Donald Trump to limit Russian attacks on Ukrainian energy assets but declined to agree to a broader 30-day ceasefire as the US had sought,\" Bloomberg reports.",
    "link": "https://politicalwire.com/2025/03/18/putin-agrees-to-energy-infrastructure-ceasefire/",
    "timestamp": "2025-03-18T17:59:05Z"
  },
  {
    "title": "EPA plans to eliminate scientific research team, could fire more than 1,000 employees",
    "description": "The Environmental Protection Agency plans to eliminate its scientific research team and could fire more than 1,000 scientists and other employees who help provide the scientific foundation for rules safeguarding human health and the environment",
    "link": "https://abcnews.go.com/US/wireStory/epa-plans-eliminate-scientific-research-team-fire-1000-119920334",
    "timestamp": "2025-03-18T17:58:28Z"
  },
  {
    "title": "China's State Media Celebrates VOA Collapse—'Dirty Rag'",
    "description": "\"Whenever your adversary applauds you, stop and reassess,\" Hudson Institute analyst Michael Sobolik told Newsweek.",
    "link": "https://www.newsweek.com/china-state-media-celebrates-us-collapse-voa-2046386",
    "timestamp": "2025-03-18T17:58:28Z"
  },
  {
    "title": "Putin Agrees to Limit Ukraine Attacks But Won’t Commit to Truce",
    "description": "President Vladimir Putin committed in a phone call with Donald Trump to limit Russian attacks on Ukrainian energy assets but declined to agree to a broader 30-day ceasefire as the US had sought.",
    "link": "https://financialpost.com/pmn/business-pmn/putin-agrees-to-limit-ukraine-attacks-but-wont-commit-to-truce",
    "timestamp": "2025-03-18T17:56:55Z"
  },
  {
    "title": "Newsom asks for nearly another $3B for state health program overwhelmed by illegal immigrants - NewsBreak",
    "description": "The Newsom administration is asking more money from California lawmakers to patch the state's bloated healthcare budget amid costs from illegal immigrants.",
    "link": "https://www.newsbreak.com/news/3861340468398-newsom-asks-for-nearly-another-3b-for-state-health-program-overwhelmed-by-illegal-immigrants?noAds=1&amp;_f=app_share&amp;s=i2",
    "timestamp": "2025-03-18T17:56:26Z"
  },
  {
    "title": "White House releases key details of phone call between Donald Trump and Vladimir Putin",
    "description": "The White House has released key details of a phone call between Donald Trump and Vladimir Putin",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-vladimir-putin-phone-call-011201-20250318",
    "timestamp": "2025-03-18T17:55:57Z"
  },
  {
    "title": "US building on strong security partnership with India: Tulsi Gabbard",
    "description": "US Director of National Intelligence Tulsi Gabbard emphasised reinforcing the strong security partnership with India, focusing on cyber security, emerging technology, and AI. She met with Indian counterparts in New Delhi, discussing shared security concerns a…",
    "link": "https://economictimes.indiatimes.com/news/india/us-building-on-strong-security-partnership-with-india-tulsi-gabbard/articleshow/119173790.cms",
    "timestamp": "2025-03-18T17:55:41Z"
  },
  {
    "title": "JUST IN: White House Says Putin And Trump Agreed to Partial Ceasefire In Ukraine",
    "description": "\"We are learning some significant details from that telephone call this morning, which spanned nearly two hours between Donald Trump and Vladimir Putin.\"\nThe post JUST IN: White House Says Putin And Trump Agreed to Partial Ceasefire In Ukraine first appeared …",
    "link": "https://www.mediaite.com/news/just-in-white-house-says-putin-and-trump-agreed-to-partial-ceasefire-in-ukraine/",
    "timestamp": "2025-03-18T17:55:20Z"
  },
  {
    "title": "Denmark leading way in ‘Boycott America’ movement in Europe: ‘Danish Viking blood is boiling’",
    "description": "Ivan Hansen, a retired Danish police officer, loaded up his basket at the supermarket, carefully checking each product to avoid buying anything made in the United States. No more Coca-Cola, no more California Zinfandel wine or almonds. The 67-year-old said it…",
    "link": "https://nypost.com/2025/03/18/business/denmark-leading-way-in-boycott-america-movement-in-europe/",
    "timestamp": "2025-03-18T17:54:37Z"
  },
  {
    "title": "EPA plans to eliminate scientific research team, could fire more than 1,000 employees",
    "description": "As many as 1,155 chemists, biologists, toxicologists and other scientists could be laid off.",
    "link": "https://www.bostonherald.com/2025/03/18/trump-epa-layoffs/",
    "timestamp": "2025-03-18T17:53:37Z"
  },
  {
    "title": "EPA plans to eliminate scientific research team, could fire more than 1,000 employees",
    "description": "As many as 1,155 chemists, biologists, toxicologists and other scientists could be laid off.",
    "link": "https://www.denverpost.com/2025/03/18/trump-epa-layoffs/",
    "timestamp": "2025-03-18T17:53:37Z"
  },
  {
    "title": "Trump, Putin agree to seek limited ceasefire in step to ending Ukraine war, White House says",
    "description": "The White House says President Donald Trump and Russian President Vladimir Putin have agreed to seek a limited ceasefire against energy and infrastructure targets in the Russia-Ukraine war.",
    "link": "https://www.pbs.org/newshour/world/trump-putin-agree-to-seek-limited-ceasefire-in-step-to-ending-ukraine-war-white-house-says",
    "timestamp": "2025-03-18T17:53:24Z"
  },
  {
    "title": "Trump, Putin agree to seek limited ceasefire in step to ending Ukraine war, White House says - NewsBreak",
    "description": "WASHINGTON (AP) — President Donald Trump and Russian President Vladimir Putin agreed during a lengthy call Tuesday to seek a limited ceasefire against ener",
    "link": "https://www.newsbreak.com/news/3861488199698-trump-putin-agree-to-seek-limited-ceasefire-in-step-to-ending-ukraine-war-white-house-says?noAds=1&_f=app_share&s=a2&share_destination_id=Mjg0MjI3ODEyLTE3NDIzMjE5ODk4OTY%3D",
    "timestamp": "2025-03-18T17:53:00Z"
  },
  {
    "title": "Scott Bessent: ‘I can’t guarantee’ America will avoid a recession",
    "description": "Is a recession brewing in the US? The answer to that question will vary depending on whom you ask in the Trump administration — and when.\nWall Street plunged last week after President Donald Trump said he was not ruling out a recession and that Americans shou…",
    "link": "https://biztoc.com/x/df6d9ec805aac19b",
    "timestamp": "2025-03-18T17:52:55Z"
  },
  {
    "title": "As Stranded Astronauts Return, SpaceX's Victory Is Boeing's Embarrassment",
    "description": "When Butch Wilmore and Suni Williams splash down off the coast of Florida Tuesday evening, the biggest winner in their nine-month ordeal will be none other than Elon Musk.",
    "link": "https://www.newsweek.com/butch-wilmore-suni-williams-astronauts-return-spacex-boeing-elon-musk-2046587",
    "timestamp": "2025-03-18T17:52:30Z"
  },
  {
    "title": "Putin agrees to partial ceasefire, demands foreign countries stop arming Ukraine",
    "description": "Russian President Vladimir Putin has rejected an immediate ceasefire in his country's war in Ukraine, but has agreed to stop attacks on energy infrastructure while negotiations for a permanent truce take place, the White House and Kremlin say.",
    "link": "https://www.abc.net.au/news/2025-03-19/donald-trump-and-vladimir-putin-second-phone-call/105068904",
    "timestamp": "2025-03-18T17:52:07Z"
  },
  {
    "title": "Angst pervades a pair of Republican town halls — one in Trump country, the other in a swing state",
    "description": "In two congressional districts and vastly different political environments, two Republicans in the U.S. House were met with far different reactions at public meetings they held late last week. Against the suggestion of their leader, House Speaker Mike Johnson…",
    "link": "https://freerepublic.com/focus/f-news/4305124/posts",
    "timestamp": "2025-03-18T17:52:04Z"
  },
  {
    "title": "Poch: USMNT can be world's best in 5 or 10 years",
    "description": "Mauricio Pochettino has said the U.S. men's national team can be the best in the world within \"five or 10 years\" due to the growth and investment in soccer in the country.",
    "link": "https://www.espn.com/soccer/story/_/id/44304285/mauricio-pochettino-usa-men-worlds-best-soccer-team-5-10-years",
    "timestamp": "2025-03-18T17:50:42Z"
  },
  {
    "title": "EU debates ways to keep Radio Free Europe afloat after Trump orders staff cuts at US-funded media",
    "description": "The European Union is debating ways to keep Radio Free Europe afloat after the Trump administration stopped grants to the pro-democracy media outlet over the weekend",
    "link": "https://abcnews.go.com/Business/wireStory/eu-debates-ways-radio-free-europe-afloat-after-119920326",
    "timestamp": "2025-03-18T17:50:26Z"
  },
  {
    "title": "Court convicts thief who stole golden toilet from English palace",
    "description": "A thief who swiped a golden toilet from an English palace has been convicted along with an accomplice who helped cash in on the spoils of the 18-carat work of art valued at more than $6 million",
    "link": "https://abcnews.go.com/International/wireStory/court-convicts-thief-stole-golden-toilet-english-palace-119919868",
    "timestamp": "2025-03-18T17:50:14Z"
  },
  {
    "title": "Chief Justice Rebukes Trump Over Calls to Impeach Judges Who Rule Against Him",
    "description": "The chief justice of the U.S. Supreme Court issued a rare statement on Tuesday rebuking calls from President Donald Trump and \nmembers of his orbit for the impeachment of federal judges who have ruled against the administration as it tramples the law to advan…",
    "link": "https://www.commondreams.org/news/john-roberts-rebukes-trump",
    "timestamp": "2025-03-18T17:50:11Z"
  },
  {
    "title": "Tesla Resale Prices Are Plummeting",
    "description": "Data from industry tracking sites shows that the cost of a used Tesla is declining faster than other car brands.",
    "link": "https://www.newsweek.com/tesla-resale-price-going-down-2046464",
    "timestamp": "2025-03-18T17:49:45Z"
  },
  {
    "title": "Putin agrees to Trump proposal to stop hitting Ukrainian energy targets for 30 days",
    "description": "MOSCOW (Reuters) - Russian President Vladimir Putin agreed on Tuesday to a proposal by U.S. President Donald Trump for Russia and Ukraine to stop hitting each other's energy infrastructure for 30 days and gave a corresponding order to the Russian military, th…",
    "link": "https://www.thestar.com.my/news/world/2025/03/19/putin-agrees-to-trump-proposal-to-stop-hitting-ukrainian-energy-targets-for-30-days",
    "timestamp": "2025-03-18T17:49:00Z"
  },
  {
    "title": "Egg Prices Cratering from Biden Highs as Trump Fulfills Another Promise",
    "description": "Less than two months into the Trump administration, wholesale egg prices are tumbling by almost 50 percent.",
    "link": "https://www.westernjournal.com/egg-prices-cratering-biden-highs-trump-fulfills-another-promise/",
    "timestamp": "2025-03-18T17:48:33Z"
  },
  {
    "title": "Why did Netanyahu end the Gaza ceasefire?",
    "description": "The wave of Israeli strikes that killed hundreds of Palestinians across the Gaza Strip early Tuesday was the culmination of Prime Minister Benjamin Netanyahu’s efforts to get out of the ceasefire with Hamas that he agreed to in January.",
    "link": "https://www.pbs.org/newshour/world/why-did-netanyahu-end-the-gaza-ceasefire",
    "timestamp": "2025-03-18T17:48:29Z"
  },
  {
    "title": "EU debates ways to keep Radio Free Europe afloat after Trump orders staff cuts at US-funded media",
    "description": "BRUSSELS (AP) — European Union government ministers on Tuesday debated ways to keep Radio Free Europe afloat after the Trump administration stopped grants to the pro-democracy media outlet over the weekend. Radio Free Europe/Radio Liberty started broadcasting…",
    "link": "https://financialpost.com/pmn/eu-debates-ways-to-keep-radio-free-europe-afloat-after-trump-orders-staff-cuts-at-us-funded-media",
    "timestamp": "2025-03-18T17:48:19Z"
  },
  {
    "title": "U.S. Supreme Court's chief justice speaks out after Trump calls for judge to be impeached",
    "description": "U.S. Chief Justice John Roberts responded on Tuesday to President Donald Trump's attacks on a federal judge presiding over a deportation battle, rejecting the idea that impeachment is the answer for a disagreement with the jurist's rulings.",
    "link": "https://www.cbc.ca/news/world/scotus-roberts-trump-judges-1.7486671",
    "timestamp": "2025-03-18T17:45:24Z"
  },
  {
    "title": "Trump’s defunding of VOA praised by Chinese state media",
    "description": "Pro-China critics are rejoicing at the shutdown of the federally funded broadcast news service, Voice of America (VOA).  \n\n\nOn Friday, President Donald Trump signed an executive order that promised voters would be “no longer on the hook for radical propaganda…",
    "link": "https://www.dailydot.com/debug/trump-defunds-voa-chinese-state-media-praises/",
    "timestamp": "2025-03-18T17:45:12Z"
  },
  {
    "title": "Mortgage fraud? Investigative report suggests Letitia James lied to get favorable real estate terms",
    "description": "'When powerful people cheat to get better loans, it comes at the expense of honest and hardworking people'",
    "link": "https://www.wnd.com/2025/03/mortgage-fraud-investigative-report-suggests-letitia-james-lied-to-get-favorable-real-estate-terms/",
    "timestamp": "2025-03-18T17:44:47Z"
  },
  {
    "title": "CNN’s Abby Phillip Challenges Scott Jennings Over Claim Deported Migrants ‘Are Violent People’: ‘How Do We Know?’",
    "description": "Abby Phillip challenged Scott Jennings when he said that deported migrants on a flight to Venezuela \"are violent people,\" asking for evidence of the claim.\nThe post CNN’s Abby Phillip Challenges Scott Jennings Over Claim Deported Migrants ‘Are Violent People’…",
    "link": "https://www.mediaite.com/news/cnns-abby-phillip-challenges-scott-jennings-over-claim-deported-migrants-are-violent-people-how-do-we-know/",
    "timestamp": "2025-03-18T17:43:25Z"
  },
  {
    "title": "New urgency over Arctic defence can’t come soon enough for major gold miner",
    "description": "Canadian miner Agnico Eagle sees opportunity to benefit from Canada's new urgency to invest in the Arctic amid Trump's threats. Read more",
    "link": "https://financialpost.com/commodities/mining/gold-miner-canada-invest-arctic-gains-traction",
    "timestamp": "2025-03-18T17:43:24Z"
  },
  {
    "title": "US Voters Sour on Trump Economic Agenda 'Of, By, and For Billionaires'",
    "description": "Multiple public opinion surveys published in recent days reveal widespread voter disenchantment with U.S. President Donald Trump's economic stewardship amid ever-rising consumer prices, the specter of a recession sparked by what many see as a deliberate attem…",
    "link": "https://www.commondreams.org/news/trump-economy",
    "timestamp": "2025-03-18T17:41:36Z"
  },
  {
    "title": "Trump, Putin to start Ukraine peace talks with energy ceasefire",
    "description": "United States President Donald Trump and his Russian counterpart Vladimir Putin agreed on Tuesday that the Ukrainian peace talks should start with \"an energy and infrastructure ceasefire.\"More to come...",
    "link": "https://biztoc.com/x/242b981e917c9fe9",
    "timestamp": "2025-03-18T17:41:29Z"
  },
  {
    "title": "Can judges be impeached for their rulings? Chief Justice John Roberts says no amid Trump’s call for removal",
    "description": "Chief Justice John Roberts firmly rejected calls to impeach judges over rulings, emphasizing judicial independence. His statement comes after Donald Trump demanded the removal of Judge James E. Boasberg for blocking Venezuelan deportations. Roberts reminded t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/can-judges-be-impeached-for-their-rulings-chief-justice-john-roberts-says-no-amid-trumps-call-for-removal/articleshow/119173009.cms",
    "timestamp": "2025-03-18T17:40:56Z"
  },
  {
    "title": "Trump Social Security Head Says He's 'Made Some Mistakes'",
    "description": "Acting Social Security commissioner Leland Dudek acknowledged turmoil in the agency amid planned changes to telephone service.",
    "link": "https://www.huffpost.com/entry/social-security-leland-dudek-mistakes_n_67d9925ee4b034e52523cd43",
    "timestamp": "2025-03-18T17:40:55Z"
  },
  {
    "title": "Judge Floats Contempt Charges in 'Interesting' Interaction with Trump's DOJ",
    "description": "The Trump administration is using an 18th-century law to deport people without judicial oversight.",
    "link": "https://www.newsweek.com/president-donald-trump-deportation-venezuala-2046459",
    "timestamp": "2025-03-18T17:40:07Z"
  },
  {
    "title": "Kremlin reveals Putin-Trump phone call details",
    "description": "The Russian president has supported Donald Trump’s proposal to halt strikes on energy infrastructure for 30 days, according to the statement Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614385-kremlin-confirms-trump-putin-call/",
    "timestamp": "2025-03-18T17:39:25Z"
  },
  {
    "title": "During Trump Call, Putin's \"Key Condition\" To Prevent Ukraine War Escalation",
    "description": "Russian President Vladimir Putin on Tuesday agreed to pause strikes on Ukraine, following a nearly two-hour conversation with US President Donald Trump over the phone, the Kremlin said in a statement.",
    "link": "https://www.ndtv.com/world-news/putin-agreed-to-pause-strikes-on-ukraines-energy-targets-for-30-days-during-call-with-trump-says-kremlin-7954593",
    "timestamp": "2025-03-18T17:38:53Z"
  },
  {
    "title": "Trump Admin Defends Not Turning Around Plane Full Of Venezuelan Gang Members",
    "description": "Homan slams federal judge ordered Trump to reroute flight of immigrants as five passengers had not yet been cleared for deportation.",
    "link": "https://dailycaller.com/2025/03/18/tom-homan-trump-deport-plane-criminal-illegal-tren-de-aragua-venezuela/",
    "timestamp": "2025-03-18T17:38:36Z"
  },
  {
    "title": "Newsom asks for nearly another $3B for state health program overwhelmed by illegal immigrants - NewsBreak",
    "description": "The Newsom administration is asking more money from California lawmakers to patch the state's bloated healthcare budget amid costs from illegal immigrants.",
    "link": "https://www.newsbreak.com/share/3861340468398-newsom-asks-for-nearly-another-3b-for-state-health-program-overwhelmed-by-illegal-immigrants?s=a2&amp;share_destination_id=ODI2MzE0OTUtMTc0MjMxOTQyMTUxNg%3D%3D&amp;pd=05aiE3dn&amp;hl=en_US&amp;send_time=1742319421&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.11.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v7%2Cns_local_strategy_25q1_exp-v2%2Cns_foryou_rank_exp_25q1-v5",
    "timestamp": "2025-03-18T17:37:47Z"
  },
  {
    "title": "German parliament approves Merz’s spending boost",
    "description": "The legislation still has to go to the upper house of the parliament for approval.",
    "link": "https://www.aljazeera.com/news/2025/3/18/german-parliament-approves-merzs-spending-boost",
    "timestamp": "2025-03-18T17:37:22Z"
  },
  {
    "title": "Map Shows People in 5 States Told to 'Stay Indoors'",
    "description": "National Weather Service meteorologists warned that high winds could bring down trees and power lines.",
    "link": "https://www.newsweek.com/map-shows-people-five-states-told-stay-indoors-high-winds-storm-2046466",
    "timestamp": "2025-03-18T17:36:19Z"
  },
  {
    "title": "Semisonic Slam White House for 'Closing Time' Deportation Video",
    "description": "\"The song is about joy and possibilities and hope, and they have missed the point entirely.\" Continue reading…",
    "link": "https://loudwire.com/semisonic-closing-time-white-house-video/",
    "timestamp": "2025-03-18T17:35:14Z"
  },
  {
    "title": "Chief justice pushes back against calls to impeach judges who rule against Trump (Lawrence Hurley/NBC News)",
    "description": "Lawrence Hurley / NBC News:\nChief justice pushes back against calls to impeach judges who rule against Trump  —  Chief Justice John Roberts issued a statement following President Donald Trump's call for a judge to be impeached for ruling against the administr…",
    "link": "https://www.memeorandum.com/250318/p80",
    "timestamp": "2025-03-18T17:35:00Z"
  },
  {
    "title": "MRE stands against dismantling Voice of America (MRE/Military Reporters and Editors)",
    "description": "MRE / Military Reporters and Editors:\nMRE stands against dismantling Voice of America  —  Military Reporters & Editors calls for the protection of the First Amendment and freedom of the press  —  President Donald Trump has signed an executive order dismantlin…",
    "link": "https://www.memeorandum.com/250318/p81",
    "timestamp": "2025-03-18T17:35:00Z"
  },
  {
    "title": "‘He Was Trolling Me’: Chuck Schumer Skewers Trump on The View, Says Dems ‘Are Fighting Them Very Hard’",
    "description": "Senate Minority Leader Chuck Schumer (D-NY) told the co-hosts of The View Tuesday morning that President Donald Trump was trolling him when he offered congratulations for the longtime senator’s role in averting the government shutdown. Schumer, promoting his …",
    "link": "https://freerepublic.com/focus/f-news/4305120/posts",
    "timestamp": "2025-03-18T17:34:34Z"
  },
  {
    "title": "France to reopen fourth nuclear air base as Europe rushes to rearm",
    "description": "Emmanuel Macron announces site near Germany will be modernized to host nukes amid fears Donald Trump will desert the continent.",
    "link": "https://www.politico.eu/article/france-will-reopen-fourth-nuclear-air-base/",
    "timestamp": "2025-03-18T17:34:21Z"
  },
  {
    "title": "Putin agrees to pause strikes on Ukraine energy targets for 30 days after talks with Trump, Kremlin says",
    "description": "Russian President Vladimir Putin agreed to a 30-day pause in strikes on Ukraine’s energy infrastructure after a proposal from U.S. President Donald Trump. Both leaders emphasized that any resolution must consider Russia’s security interests and prevent foreig…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/putin-agrees-to-pause-strikes-on-ukraine-energy-targets-for-30-days-after-talks-with-trump-kremlin-says/articleshow/119173090.cms",
    "timestamp": "2025-03-18T17:33:58Z"
  },
  {
    "title": "DOGE Stimulus Check Update: Payments Sent Out Might Not Be $5,000",
    "description": "The creator of the \"Doge Dividend\" has acknowledged that the $5,000 figure is not guaranteed and could fluctuate based on savings.",
    "link": "https://www.newsweek.com/doge-stimulus-checks-payments-james-fishback-2046512",
    "timestamp": "2025-03-18T17:33:18Z"
  },
  {
    "title": "Lasting Peace, And A Condition: What Both Sides Said On Trump-Putin Call",
    "description": "During an over two-hour call, US President Donald Trump and his Russian counterpart Vladimir Putin agreed that the war in Ukraine &quot;needs to end with a lasting peace&quot;, the White House said on Tuesday.",
    "link": "https://www.ndtv.com/world-news/trump-putin-agreed-ukraine-war-needs-to-end-with-a-lasting-peace-white-house-7954563",
    "timestamp": "2025-03-18T17:33:04Z"
  },
  {
    "title": "Putin demands halt to US military and intelligence support for Ukraine in talks with Donald Trump",
    "description": "Russian President Vladimir Putin has told US President Donald Trump that halting military and intelligence support to Ukraine is essential for ending hostilities. In a phone conversation, Putin outlined conditions for a ceasefire, including stopping Ukraine's…",
    "link": "https://economictimes.indiatimes.com/news/defence/putin-demands-halt-to-us-military-and-intelligence-support-for-ukraine-in-talks-with-donald-trump/articleshow/119173040.cms",
    "timestamp": "2025-03-18T17:32:39Z"
  },
  {
    "title": "‘Total trash’: AP retracts story with false claim about Tulsi Gabbard",
    "description": "'This is why no one trusts the maliciously incompetent and purposefully bias media. If this isn't a clear example of pushing a solely political narrative, then nothing is'",
    "link": "https://www.wnd.com/2025/03/total-trash-ap-retracts-story-with-false-claim-about-tulsi-gabbard/",
    "timestamp": "2025-03-18T17:31:56Z"
  },
  {
    "title": "Fact-checking Trump’s claim that Biden pardons are ‘void’ because he used an autopen",
    "description": "Legal scholars say that the Constitution doesn’t require a pardon’s direct human signing, and subsequent judicial decisions and legal memoranda support an autopen’s use for similar purposes.",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-trumps-claim-that-biden-pardons-are-void-because-he-used-an-autopen",
    "timestamp": "2025-03-18T17:29:54Z"
  },
  {
    "title": "How Much of Your Tax Dollars Bankrolled the Deep State Union Efforts to Block Trump’s Reforms Before He Entered Office?",
    "description": "Your hard-earned tax dollars don’t just fund the salaries of federal bureaucrats, they also support public-sector unions who negotiate sweetheart deals between the bureaucrats and... Read More\nThe post How Much of Your Tax Dollars Bankrolled the Deep State Un…",
    "link": "https://www.dailysignal.com/2025/03/18/how-much-your-tax-dollars-bankrolled-deep-state-union-efforts-block-trumps-reforms-before-he-entered-office/",
    "timestamp": "2025-03-18T17:29:50Z"
  },
  {
    "title": "Denmark Boycotts US Goods Over Greenland Threats",
    "description": "The boycott reflects deep-seated resentment among Danes over what they perceive as aggressive U.S. policies under Donald Trump.",
    "link": "https://biztoc.com/x/36f42b229c1c2a8d",
    "timestamp": "2025-03-18T17:29:38Z"
  },
  {
    "title": "Biden’s ‘Inflation Reduction Act’ Will Cost Up to $2 Trillion by 2035, Study Estimates",
    "description": "The Biden-Harris administration’s so-called Inflation Reduction Act will cost up to between $936 billion and $1.97 trillion over the next 10 years, according to a new study from... Read More\nThe post Biden’s ‘Inflation Reduction Act’ Will Cost Up to $2 Trilli…",
    "link": "https://www.dailysignal.com/2025/03/18/bidens-inflation-reduction-act-will-cost-up-2-trillion-2035-study-shows/",
    "timestamp": "2025-03-18T17:28:00Z"
  },
  {
    "title": "‘Sacrifice’ captives: Israel divided over end of ceasefire in Gaza",
    "description": "Far-right joy over renewed bombing of Gaza, but captives' families fear for their loved ones.",
    "link": "https://www.aljazeera.com/news/2025/3/18/sacrifice-captives-israel-divided-over-end-of-ceasefire-in-gaza",
    "timestamp": "2025-03-18T17:26:57Z"
  },
  {
    "title": "Anti-Tesla protests funded by big time California Dem donor – whose ex-husband is close pal of Elon Musk",
    "description": "Karla Jurvetson, a Democratic mega donor and ex-wife of an Elon Musk confidant and investor, gave more than $500,000 to group organizing anti-Tesla demonstrations",
    "link": "https://nypost.com/2025/03/18/us-news/ex-wife-of-tesla-spacex-investor-fueling-anti-elon-musk-protests/",
    "timestamp": "2025-03-18T17:26:24Z"
  }
]