[
  {
    "title": "GMU President Keeps Job Amid Tensions",
    "description": "GMU President Keeps Job Amid Tensions\n\n \n\n\n \nJosh Moody\n\nFri, 08/01/2025 - 01:47 PM\n\nFaculty members feared George Mason’s board would fire its president Friday in the face of ongoing federal investigations they deem politically motivated. The board gave him …",
    "link": "https://www.insidehighered.com/news/governance/executive-leadership/2025/08/01/gmu-president-keeps-job-amid-tensions",
    "timestamp": "2025-08-01T17:47:19Z"
  },
  {
    "title": "'I don’t care about Direct File': IRS chief says agency plans to end free filing program",
    "description": "Internal Revenue Service Commissioner Bill Long said the agency will end its Direct File program after a limited pilot and one full filing season. President Donald Trump’s massive spending and policy bill includes funding to research and “replace any direct e…",
    "link": "https://freerepublic.com/focus/f-news/4332087/posts",
    "timestamp": "2025-08-01T17:44:27Z"
  },
  {
    "title": "Red Coin, Blue Coin: The New Politics of Exposure",
    "description": "Bitcoin is politically neutral. But bitcoin treasury vehicles aren’t. Are we buying the coin, or the campaign?",
    "link": "https://www.coindesk.com/opinion/2025/08/01/red-coin-blue-coin-the-new-politics-of-exposure",
    "timestamp": "2025-08-01T17:43:49Z"
  },
  {
    "title": "Trump orders nuclear submarines moved to positions near Russia",
    "description": "U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in regions near Russia in response to threats from former Russian President Dmitry Medvedev.",
    "link": "https://www.cbc.ca/news/world/trump-nuclear-submarines-russia-positions-1.7599792",
    "timestamp": "2025-08-01T17:43:32Z"
  },
  {
    "title": "Trump Orders Nuclear Submarines Moved Near Russia",
    "description": "Donald Trump and former Russian President Dmitry Medvedev have traded taunts in recent days.",
    "link": "https://www.huffpost.com/entry/trump-orders-nuclear-submarines-moved-near-russia_n_688cfac8e4b09319f81648c2",
    "timestamp": "2025-08-01T17:43:29Z"
  },
  {
    "title": "Trump eyes bringing Azerbaijan, Central Asian nations into Abraham Accords, sources say",
    "description": "WASHINGTON (Reuters) -President Donald Trump's administration is actively discussing with Azerbaijan the possibility of bringing that nation and some Central...",
    "link": "https://www.yahoo.com/news/articles/trump-eyes-bringing-azerbaijan-central-174324231.html",
    "timestamp": "2025-08-01T17:43:24Z"
  },
  {
    "title": "Trump deploys two nuclear submarines near Russia after 'inflammatory statements’ from Medvedev",
    "description": "President Donald Trump said he ordered two nuclear submarines near Russia after what he called \"foolish and inflammatory\" statements from a former Russian president. DW has more. A social media war of words between US President Donald Trump and Dmitry Medvede…",
    "link": "https://www.dw.com/en/trump-deploys-two-nuclear-submarines-near-russia-after-inflammatory-statements-from-medvedev/live-73492046",
    "timestamp": "2025-08-01T17:43:00Z"
  },
  {
    "title": "Ukraine updates: Trump deploys nuclear subs near Russia",
    "description": "President Donald Trump said he ordered two nuclear submarines near Russia after what he called \"foolish and inflammatory\" statements from a former Russian president. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-trump-deploys-nuclear-subs-near-russia/live-73492046",
    "timestamp": "2025-08-01T17:43:00Z"
  },
  {
    "title": "Lesotho's textile factories face closures despite US tariff cut",
    "description": "Lesotho's U.S. export tariff has been reduced from a threatened 50% to 15%, but its textile industry still faces challenges",
    "link": "https://abcnews.go.com/Business/wireStory/lesothos-textile-factories-face-closures-despite-us-tariff-124285701",
    "timestamp": "2025-08-01T17:42:44Z"
  },
  {
    "title": "Hong Kong firm appeals for legal protection of investors as its Panama Ports contract faces lawsuits",
    "description": "A subsidiary of a Hong Kong conglomerate entangled in U.S.-China tensions has appealed for legal protection for businesses in Panama after the company’s contract over its Panama Canal port assets has been faced with lawsuits",
    "link": "https://abcnews.go.com/Business/wireStory/hong-kong-firm-appeals-legal-protection-investors-panama-124283948",
    "timestamp": "2025-08-01T17:42:31Z"
  },
  {
    "title": "What consumers can expect from import taxes as the US sets new tariff rates",
    "description": "American businesses and consumers are finding the contours of President Donald Trump’s foreign trade agenda taking shape",
    "link": "https://abcnews.go.com/Business/wireStory/consumers-expect-import-taxes-us-sets-new-tariff-124281215",
    "timestamp": "2025-08-01T17:42:28Z"
  },
  {
    "title": "Comedy Central Lampoons Right Wing Freak Out Over 'Jeans' Ad",
    "description": "The MAGA cult had a meltdown over some tweets that criticized Sydney Sweeney's new jean (gene) ads and The Daily Show's Desi Lydic rightly mocked their cringe-worthy responses and faux outrage.\nLydic is awesome as a TDS host, and this is one of her best skits…",
    "link": "https://crooksandliars.com/2025/08/right-wing-freak-out-over-sydney-sweeney",
    "timestamp": "2025-08-01T17:42:10Z"
  },
  {
    "title": "Ghislaine Maxwell Quietly Transferred To Nicer Prison In Texas",
    "description": "Ghislaine Maxwell, Jeffrey Epstein’s long-time accomplice, has been transferred from a minimum security federal prison in Florida to a prison camp in Bryan, Texas. \nThis could not look more like an attempt to keep Maxwell from spilling any tea about Donald Tr…",
    "link": "https://crooksandliars.com/2025/08/ghislaine-maxwell-quietly-transferred",
    "timestamp": "2025-08-01T17:42:10Z"
  },
  {
    "title": "How Trump's high tariffs against Brazil could backfire",
    "description": "Brazil will pay as much as 50% tariffs on goods exported to the United States. But experts say the tariffs, along with sanctions on a Brazilian judge, indicate this isn't about economics but about Trump's politics. The newly announced tariffs by the US govern…",
    "link": "https://www.dw.com/en/how-trumps-high-tariffs-against-brazil-could-backfire/a-73500652",
    "timestamp": "2025-08-01T17:42:00Z"
  },
  {
    "title": "People Are Rolling Their Eyes Into Oblivion After Hearing Karoline Leavitt's Latest Claim About Trump",
    "description": "\"We are North Korea now,\" one user said.",
    "link": "https://www.buzzfeed.com/edmazza/karoline-leavitt-trump-nobel",
    "timestamp": "2025-08-01T17:41:21Z"
  },
  {
    "title": "Nancy Mace's Chances of Winning South Carolina Governor's Race—Polls",
    "description": "\"It's obviously going to make the race very fractious, very interesting with the potential to have a lot of unflattering portraits,\" a pollster told Newsweek.",
    "link": "https://www.newsweek.com/nancy-mace-south-carolina-governor-election-polls-2107700",
    "timestamp": "2025-08-01T17:41:20Z"
  },
  {
    "title": "The EPA Just Issued Its Most Damaging Climate Change Move Ever",
    "description": "The Environmental Protection Agency proposed this week to withdraw its 2009 finding that greenhouse gases “endanger public health or welfare.”",
    "link": "https://slate.com/news-and-politics/2025/08/epa-climate-change-greenhouse-gases-pollutant-scary.html",
    "timestamp": "2025-08-01T17:40:37Z"
  },
  {
    "title": "US to deploy two nuclear submarines in response to 'highly provocative' comments from Russia",
    "description": "On Monday, Medvedev harshly criticised Trump’s threat of new sanctions against Russia over the continuing invasion of Ukraine.",
    "link": "https://www.thejournal.ie/us-deploys-nuclear-submarines-russia-6780764-Aug2025/",
    "timestamp": "2025-08-01T17:40:35Z"
  },
  {
    "title": "States sue Trump regarding hospital gender-affirming care for youth",
    "description": "Lawsuit accuses Trump administration of unlawful actions targeting gender-affirming care for minors",
    "link": "https://www.wbaltv.com/article/democratic-lawsuit-trump-gender-affirming-care/65576692",
    "timestamp": "2025-08-01T17:40:33Z"
  },
  {
    "title": "Stephen Colbert’s Kamala Harris Interview Brought Together Two Beleaguered Symbols of Embattled Institutions",
    "description": "To announce that she would not be running for any public office — including governor of California, a race she had already declined to enter in a written statement — Kamala Harris chose a fitting venue. The former Vice President gave her first major televised…",
    "link": "https://variety.com/2025/tv/opinion/kamala-harris-stephen-colbert-column-1236476807/",
    "timestamp": "2025-08-01T17:40:00Z"
  },
  {
    "title": "Lesotho’s textile factories face closures despite US tariff cut",
    "description": "MASERU, Lesotho. (AP) — The southern African nation of Lesotho has had its U.S. export tariff reduced from a threatened 50% to 15% but its crucial textile industry still faces massive factory closures, officials said on Friday. Despite a reduction announced b…",
    "link": "https://financialpost.com/pmn/lesothos-textile-factories-face-closures-despite-us-tariff-cut",
    "timestamp": "2025-08-01T17:39:36Z"
  },
  {
    "title": "Schumer: Trump, you saw chaos, you reap chaos",
    "description": "United States Senate Minority Leader Chuck Schumer reacted on Friday to the latest much lower-than-expected rise in nonfarm payrolls by claiming that President Donald Trump \"saw[s] chaos\" and \"reap[s]...",
    "link": "https://biztoc.com/x/9458fc8ec86727e4",
    "timestamp": "2025-08-01T17:38:59Z"
  },
  {
    "title": "Trump says he’s ordered nuclear submarines re-positioned after Russian official’s ‘highly provocative’ remarks",
    "description": "President Donald Trump said Friday he has ordered two nuclear submarines to be strategically positioned in response to what he said were aggressive remarks...",
    "link": "https://www.cnn.com/2025/08/01/politics/nuclear-submaries-russia-trump-medvedev",
    "timestamp": "2025-08-01T17:38:12Z"
  },
  {
    "title": "Trump Orders Nuclear Submarines Moved Near Russia Amid Rising Tensions",
    "description": "WASHINGTON: US President Donald Trump said on Friday (Aug 1) he had ordered two nuclear submarines to be repositioned near Russian waters in response to recent threats from former Russian President Dmitry M",
    "link": "https://www.channelnewsasia.com/world/trump-orders-nuclear-submarines-moved-near-russia-amid-rising-tensions-5272881",
    "timestamp": "2025-08-01T17:36:00Z"
  },
  {
    "title": "Trump moves nuclear submarines after statements by former Russian president",
    "description": "WASHINGTON: US President Donald Trump said on Friday (Aug 1) he had ordered two nuclear submarines to be repositioned to the \"appropriate regions\" in response to recent threats from former Russian President",
    "link": "https://www.channelnewsasia.com/world/trump-moves-nuclear-submarines-after-statements-former-russian-president-5272881",
    "timestamp": "2025-08-01T17:36:00Z"
  },
  {
    "title": "Trump Is Now Running the Worst Economy Since His Last Term in Office",
    "description": "The last time America’s job numbers were this bad—besides the pandemic—was during the Great Recession.Revisions to the last three months of job reports have moved the three-month growth average to 35,000, a lag that hasn’t emerged since 2010, and which some e…",
    "link": "https://newrepublic.com/post/198723/trump-now-running-worst-economy-since-last-term-office",
    "timestamp": "2025-08-01T17:35:51Z"
  },
  {
    "title": "Corporation For Public Broadcasting To Shut Down After Losing Federal Funds",
    "description": "CPB acknowledged the \"difficult reality\" of winding down its operations after losing federal funding from the Trump administration.",
    "link": "https://www.newsweek.com/trump-administration-rescissions-funding-corporation-public-broadcasting-2107736",
    "timestamp": "2025-08-01T17:35:41Z"
  },
  {
    "title": "Trump says he moved two nuclear submarines after Russia's Medvedev warns U.S.",
    "description": "Dmitry Medvedev said President Trump is \"playing the ultimatum game with Russia\" in pressuring for an end to the war on Ukraine.",
    "link": "https://www.cnbc.com/2025/08/01/trump-russia-nuclear-submarines.html",
    "timestamp": "2025-08-01T17:35:25Z"
  },
  {
    "title": "Trump orders nuclear submarines moved near Russia (Ryan Patrick Jones/Reuters)",
    "description": "Ryan Patrick Jones / Reuters:\nTrump orders nuclear submarines moved near Russia  —  U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in regions near Russia in response to threats from former Russian President D…",
    "link": "https://www.memeorandum.com/250801/p74",
    "timestamp": "2025-08-01T17:35:00Z"
  },
  {
    "title": "Trump moves nuclear submarines after ex-Russian president's comments",
    "description": "US President Donald Trump says two nuclear submarines are being deployed in the \"appropriate regions\".",
    "link": "https://www.bbc.co.uk/news/articles/c93dgr2dd53o",
    "timestamp": "2025-08-01T17:34:44Z"
  },
  {
    "title": "Trump moves nuclear submarines after ex-Russian president's comments",
    "description": "US President Donald Trump says two nuclear submarines are being deployed in the \"appropriate regions\".",
    "link": "https://www.bbc.com/news/articles/c93dgr2dd53o",
    "timestamp": "2025-08-01T17:34:44Z"
  },
  {
    "title": "USA orders nuke subs moved near Russia...",
    "description": "PRESIDENT Donald Trump has ordered that two nuclear submarines be positioned near Russia following stern threats from Vladimir Putin’s comrade. The move by the commander-in-chief comes after …",
    "link": "https://www.the-sun.com/news/14892918/donald-trump-nuclear-submarines-russia/",
    "timestamp": "2025-08-01T17:34:37Z"
  },
  {
    "title": "Trump orders nuclear submarines moved near Russia",
    "description": "(Reuters) -U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in regions near Russia in response to threats from former Russian President Dmitry Medvedev. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/02/trump-orders-nuclear-submarines-moved-near-russia",
    "timestamp": "2025-08-01T17:33:00Z"
  },
  {
    "title": "US deploying nuclear subs in regions near Russia - Trump",
    "description": "US President Donald Trump has ordered that two nuclear submarines be positioned in regions near Russia in response to comments by a senior Russian official.",
    "link": "https://www.rte.ie/news/us/2025/0801/1526593-us-russia/",
    "timestamp": "2025-08-01T17:32:07Z"
  },
  {
    "title": "Trump To Build Yugest, Tackiest Ballroom At White House Like You Wouldn't Believe",
    "description": "Fulfilling his lifelong dream of making everything look worse.",
    "link": "https://www.wonkette.com/p/trump-to-build-yugest-tackiest-ballroom",
    "timestamp": "2025-08-01T17:31:24Z"
  },
  {
    "title": "Report: Trump's Sanctions on Rogue Brazilian Judge Splitting Nation's Supreme Court",
    "description": "A report claimed that U.S. sanctions on Alexandre de Moraes have caused a visible rift at Brazil's Supreme Federal Tribunal (STF).\nThe post Report: Trump’s Sanctions on Rogue Brazilian Judge Splitting Nation’s Supreme Court appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2025/08/01/report-trumps-sanctions-rogue-brazilian-judge-splitting-nations-supreme-court/",
    "timestamp": "2025-08-01T17:30:54Z"
  },
  {
    "title": "Trump moves nuclear submarines in response to Russia's 'highly provocative' statement",
    "description": "Trump moves nuclear submarines in response to Russia's 'highly provocative' statementgo.com",
    "link": "https://abcnews.go.com/Politics/trump-moves-nuclear-submarines-response-russias-highly-provocative/story?id=124284200",
    "timestamp": "2025-08-01T17:30:52Z"
  },
  {
    "title": "How does fentanyl get into the US?",
    "description": "President Trump has blamed China for its opioid crisis and imposed sweeping tariffs.",
    "link": "https://www.bbc.com/news/articles/cvg93nn1e6go?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-01T17:30:35Z"
  },
  {
    "title": "Russiagate Hoax Linked To George Soros?",
    "description": "George Soros’ Open Society Foundation was involved in the Hillary Clinton campaign's 2016 efforts to falsely accuse Donald Trump of having ties to Russia, according to a newly declassified US document.",
    "link": "https://www.shtfplan.com/headline-news/russiagate-hoax-linked-to-george-soros",
    "timestamp": "2025-08-01T17:30:00Z"
  },
  {
    "title": "Trump’s name reportedly redacted from Epstein files — here’s what the FBI doesn’t want you to see",
    "description": "Donald Trump's name redacted from Epstein files: Insiders revealed that the FBI redacted Donald Trump's name from Jeffrey Epstein files. Instructions were given to flag any mention of Trump. FOIA officers justified redactions with privacy rules. Trump's name …",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-name-redacted-from-epstein-files-fbi-epstein-documents-2025-trumps-name-reportedly-redacted-from-epstein-files-heres-what-the-fbi-doesnt-want-you-to-see/articleshow/123047923.cms",
    "timestamp": "2025-08-01T17:29:37Z"
  },
  {
    "title": "Trump Announces $200M White House Ballroom — And the Internet Is Breaking His Balls",
    "description": "The Trump administration has unveiled its plans for a brand-new, $200 million ballroom at the White House, and the internet is having a ball.\nThe post Trump Announces $200M White House Ballroom — And the Internet Is Breaking His Balls first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/trump-announces-200m-white-house-ballroom-and-the-internet-is-breaking-his-balls/",
    "timestamp": "2025-08-01T17:29:02Z"
  },
  {
    "title": "No trade deal with U.S. better than a bad one: Canadian business groups",
    "description": "Canadian business groups anxiously watching trade negotiations with the U.S. don’t want the country to rush into a deal but say the uncertainty is weighing on their members. After U.S. President Donald Trump applied 35 per cent tariffs to many Canadian goods …",
    "link": "https://financialpost.com/pmn/no-trade-deal-with-u-s-better-than-a-bad-one-canadian-business-groups-2",
    "timestamp": "2025-08-01T17:28:44Z"
  },
  {
    "title": "Trump orders nuclear submarines to position near Russia",
    "description": "Investing.com -- U.S. President Donald Trump announced Friday that he has ordered two nuclear submarines to be positioned in strategic regions near Russia in...",
    "link": "https://www.yahoo.com/news/articles/trump-orders-nuclear-submarines-position-172823181.html",
    "timestamp": "2025-08-01T17:28:23Z"
  },
  {
    "title": "Far-Right Influencers Relish Elizabeth Warren’s Minor Fall On The Senate Floor",
    "description": "The senator's fall was met with harsh and nasty reactions from the right, with some calling on the 76-year-old lawmaker to retire.",
    "link": "https://www.huffpost.com/entry/maga-elizabeth-warren-fall-senate_n_688cdbd7e4b08a266e7dd77b",
    "timestamp": "2025-08-01T17:28:01Z"
  },
  {
    "title": "Kyiv mourns after deadliest attack in a year kills 31 people in Ukraine, including 5 children",
    "description": "Kyiv is observing a day of mourning after a Russian drone and missile attack.",
    "link": "https://www.bostonherald.com/2025/08/01/russia-ukraine-war-kyiv/",
    "timestamp": "2025-08-01T17:27:55Z"
  },
  {
    "title": "Presidential Fitness Test to return through Trump executive order - NewsBreak",
    "description": "Presidential Fitness Test to return through Trump executive order - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4148954590373-presidential-fitness-test-to-return-through-trump-executive-order?s=a2&amp;share_destination_id=NDI4MDc4Ni0xNzU0MDY5MTQ2NTg3&amp;pd=00Hxcwdi&amp;hl=en_US&amp;send_time=1754069146&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.31.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q3-control%2Cns_foryou_recall_exp_25q3-v3%2Cns_foryou_blend_exp_25q3-v9%2Cns_foryou_model_exp_25q3-v7",
    "timestamp": "2025-08-01T17:26:33Z"
  },
  {
    "title": "Corporation for Public Broadcasting Shutting Down",
    "description": "The recently signed tax cut and budget bill took back $1.1 billion in previously approved funds.",
    "link": "http://www.hollywoodreporter.com/business/business-news/corporation-for-public-broadcasting-shutting-down-1236335890/",
    "timestamp": "2025-08-01T17:26:19Z"
  },
  {
    "title": "H-1B Visas Under Scrutiny as Big Tech Accelerates Layoffs",
    "description": "Employers continue to apply for H-1B visas even as they lay off thousands of existing workers.",
    "link": "https://www.newsweek.com/h1b-visa-immigrants-tech-jobs-impact-college-grads-2106392",
    "timestamp": "2025-08-01T17:26:09Z"
  },
  {
    "title": "Trump Orders Nuclear Submarines To ‘Appropriate Regions’ In Response To Russian President’s Statements",
    "description": "Trump ordered nuclear submarines to be \"positioned in the appropriate regions\" in response to \"provocative statements\" from Russian President Dmitry Medvedev",
    "link": "https://dailycaller.com/2025/08/01/trump-orders-nuclear-submarines-appropriate-regions-response-russian-president/",
    "timestamp": "2025-08-01T17:25:50Z"
  },
  {
    "title": "Trump orders nuclear submarines moved near Russia",
    "description": "Aug 1 (Reuters) - U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in regions near Russia in response to threats from former Russian President Dmitry Medvedev. \"I have ordered two Nuclear Submarines to be posit…",
    "link": "https://freerepublic.com/focus/f-news/4332085/posts",
    "timestamp": "2025-08-01T17:25:08Z"
  },
  {
    "title": "Donald Trump Moves Nuclear Subs in Response to Russian Official's Remarks",
    "description": "President Donald Trump said Friday that he had ordered two nuclear submarines in the \"appropriate regions\" in response to recent statements made by Demitry Medvedev, the deputy chairman of the security council of the Russian Federation. Medvedev said Thursday…",
    "link": "https://freerepublic.com/focus/f-chat/4332084/posts",
    "timestamp": "2025-08-01T17:25:07Z"
  },
  {
    "title": "Tariff Rebate Checks: Family of Four Could Get $2,400 From Trump Admin",
    "description": "Senator Josh Hawley introduced a bill to provide direct payments to millions of Americans using tariff revenue.",
    "link": "https://www.newsweek.com/tariff-rebate-check-stimulus-trump-hawley-2107707",
    "timestamp": "2025-08-01T17:24:12Z"
  },
  {
    "title": "Affordable housing, higher wages, mental health care are needed, not threats of institutionalization",
    "description": "Affordable housing, higher wages, mental health care are needed, not threats of institutionalizationbangordailynews.com",
    "link": "http://www.bangordailynews.com/2025/08/01/opinion/editorials/affordable-housing-higher-wages-mental-health-care-needed-not-threats-institutionalization-joam40zk0w/",
    "timestamp": "2025-08-01T17:24:01Z"
  },
  {
    "title": "Carvana Touches New High on Q2 Earnings Boosted by Auto Tariffs",
    "description": "We recently published 10 Stocks Crushing With Whopping Double-Digit Gains. Carvana Co. (NYSE:CVNA) is one of the best-performing stocks on Thursday. Carvana ...",
    "link": "https://finance.yahoo.com/news/carvana-touches-high-q2-earnings-172319037.html",
    "timestamp": "2025-08-01T17:23:19Z"
  },
  {
    "title": "Trump administration weighs fate of $9M stockpile of contraceptives feared earmarked for destruction",
    "description": "Campaigners are fighting to prevent the destruction of the supplies.",
    "link": "https://www.bostonherald.com/2025/08/01/trump-contraceptives-destruction/",
    "timestamp": "2025-08-01T17:22:21Z"
  },
  {
    "title": "Trump administration weighs fate of $9M stockpile of contraceptives feared earmarked for destruction",
    "description": "Campaigners are fighting to prevent the destruction of the supplies.",
    "link": "https://www.denverpost.com/2025/08/01/trump-contraceptives-destruction/",
    "timestamp": "2025-08-01T17:22:21Z"
  },
  {
    "title": "Based on the highly provocative statements of the Former President of Russia, Dmitry Medvedev...",
    "description": "Based on the highly provocative statements of the Former President of Russia, Dmitry Medvedev, who is now the Deputy Chairman of the Security Council of the Russian Federation, I have ordered two Nuclear Submarines to be positioned in the appropriate regions,…",
    "link": "https://freerepublic.com/focus/f-chat/4332083/posts",
    "timestamp": "2025-08-01T17:21:27Z"
  },
  {
    "title": "Donald Trump Orders Positioning Of Nuclear Submarines Near Russia",
    "description": "The decision was taken based on the \"highly provocative statements\" of the former President of Russia, Dmitry Medvedev, Trump said.",
    "link": "https://www.ndtvprofit.com/world/donald-trump-orders-positioning-of-nuclear-submarines-near-russia",
    "timestamp": "2025-08-01T17:21:04Z"
  },
  {
    "title": "Federal Judge Delivers Scathing Rebuke to Trump’s Deportation Regime",
    "description": "A federal judge offered a scathing rebuke of Donald Trump’s massive deportation scheme, while blocking the government’s attempts to remove immigrants who entered the country on parole. U.S. District Court Judge Jia Cobb said the Department of Homeland Securit…",
    "link": "https://newrepublic.com/post/198720/federal-judge-scathing-rebuke-trump-deportation-immigration",
    "timestamp": "2025-08-01T17:20:51Z"
  },
  {
    "title": "Trans darts star speaks out after World Darts Federation changes gender policy",
    "description": "Transgender darts champion Noa-Lynn van Leuven is speaking out after the sport’s international governing body released a new gender-eligibility policy that prohibits trans women from female competitions.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/dutch-trans-darts-star-speaks-gender-policy-noa-lynn-van-leuven-rcna222459",
    "timestamp": "2025-08-01T17:19:25Z"
  },
  {
    "title": "No formal discussions held yet: Govt on US F-35 jets query in LS",
    "description": "Following a meeting between Prime Minister Modi and President Trump in February, the US will review its policy on releasing fifth-generation fighter jets like the F-35 and undersea systems to India, though no formal discussions have occurred yet. India convey…",
    "link": "https://economictimes.indiatimes.com/news/defence/no-formal-discussions-held-yet-govt-on-us-f-35-jets-query-in-ls/articleshow/123048319.cms",
    "timestamp": "2025-08-01T17:18:58Z"
  },
  {
    "title": "Trump says US deploying nuclear submarines in response to 'provocative' Russian comments",
    "description": "President Trump announced the deployment of two nuclear submarines following what he deemed \"highly provocative\" comments made by former Russian President Dmitry Medvedev. Trump conveyed his decision via Truth Social, emphasizing the importance of words and t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-deploying-nuclear-submarines-in-response-to-provocative-russian-comments/articleshow/123048264.cms",
    "timestamp": "2025-08-01T17:17:06Z"
  },
  {
    "title": "Trump Slams Switzerland With 39% Tariff Rate",
    "description": "Donald Trump will impose a 39% tariff on imports from Switzerland, one of the steepest levies globally which threaten to leave the country’s key exports reeling.\nThe outcome — detailed in an executive order Thursday — is higher than the 31% tariff rate Trump …",
    "link": "https://biztoc.com/x/3d32fbbeaca29045",
    "timestamp": "2025-08-01T17:17:04Z"
  },
  {
    "title": "Donald Trump Moves Nuclear Subs in Response to Russian Official's Remarks",
    "description": "Dmitry Medvedev recently taunted President Donald Trump for shifting positions on the Russia-Ukraine war, likening it to a seesaw.",
    "link": "https://biztoc.com/x/cac017fc0f8d2f97",
    "timestamp": "2025-08-01T17:16:45Z"
  },
  {
    "title": "Tariffs raise the cost of Dominion's wind farm by $500 million",
    "description": "President Donald Trump’s tariffs setting taxes on imported goods will boost Dominion Energy’s offshore wind project by more than $500 million – with half of that to be passed on to the company’s ratepayers.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_e99c0031-4dbe-4792-8ad6-d269707b9c68.html",
    "timestamp": "2025-08-01T17:15:00Z"
  },
  {
    "title": "Susquehanna Regional police show interest in helping ICE",
    "description": "Susquehanna Regional Police Department is the latest law enforcement agency in Lancaster County to ask to be considered for immigration oversight on behalf of U.S. Immigration and Customs Enforcement.",
    "link": "https://lancasteronline.com/news/local/susquehanna-regional-police-show-interest-in-helping-ice/article_f17535af-fc65-4b4f-9bf0-092f8a67d8f5.html",
    "timestamp": "2025-08-01T17:15:00Z"
  },
  {
    "title": "Donald Trump Moves Nuclear Subs in Response to Russian Official's Remarks",
    "description": "Dmitry Medvedev recently taunted President Donald Trump for shifting positions on the Russia-Ukraine war, likening it to a seesaw.",
    "link": "https://www.newsweek.com/trump-nuclear-submarines-russia-comments-response-2107715",
    "timestamp": "2025-08-01T17:14:12Z"
  },
  {
    "title": "U.S. envoy Steve Witkoff and Ambassador Mike Huckabee visit Gaza aid distribution site as humanitarian crisis worsens - CBS News",
    "description": "U.S. envoy Steve Witkoff and Ambassador Mike Huckabee visit Gaza aid distribution site as humanitarian crisis worsensCBS News Trump officials visit controversial aid site in GazaCNN Trump envoys visit Gaza aid sites after hundreds of Palestinians killed seeki…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178535712",
    "timestamp": "2025-08-01T17:12:56Z"
  },
  {
    "title": "Trump is reviving the presidential fitness test. Did it work before? - The Washington Post",
    "description": "Trump is reviving the presidential fitness test. Did it work before?The Washington Post Trump revives the Presidential Fitness Test, a rite of passage for schoolchildren for decadesAP News Donald Trump Inviting Sex Offender into White House Raises EyebrowsNew…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178535708",
    "timestamp": "2025-08-01T17:12:45Z"
  },
  {
    "title": "Democrats Run Away From ‘Green New Deal’ After Peddling Radical Plan For Years",
    "description": "Democrats are dropping the \"Green New Deal\" mantra despite their unbridled support for the far-left legislation just a few years ago, according to Axios.",
    "link": "https://dailycaller.com/2025/08/01/democrats-run-away-green-new-deal-after-peddling-radical-plan-years/",
    "timestamp": "2025-08-01T17:11:51Z"
  },
  {
    "title": "Presidential Fitness Test to return through Trump executive order - NewsBreak",
    "description": "Presidential Fitness Test to return through Trump executive order - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4148954590373-presidential-fitness-test-to-return-through-trump-executive-order?s=a2&amp;share_destination_id=MzI1ODc5OTE5LTE3NTQwNjgwMDcxMDk%3D&amp;pd=0M3MFjrf&amp;hl=en_US&amp;send_time=1754068007&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v4%2Cns_foryou_rank_exp_25q3-v8%2Cns_foryou_blend_exp_25q3-v9%2Cns_foryou_model_exp_25q3-v8",
    "timestamp": "2025-08-01T17:11:50Z"
  },
  {
    "title": "Charlamagne Tha God Pours Cold Water on Kamala Harris’ Hopes for 2028: ‘Democrats Suck So Bad’",
    "description": "Podcaster and radio host Charlamagne Tha God is warning former Vice President Kamal Harris that another run for president would just be a waste of time for her. The popular left-wing podcaster has been very dour on the Democrats for\nThe post Charlamagne Tha G…",
    "link": "https://www.breitbart.com/entertainment/2025/08/01/charlamagne-tha-god-pours-cold-water-on-kamala-harris-hopes-for-2028-democrats-suck-so-bad/",
    "timestamp": "2025-08-01T17:10:24Z"
  },
  {
    "title": "Trump repositions 2 nuclear submarines after 'highly provocative' Russian comments",
    "description": "President Donald Trump announced Friday that he has \"ordered two Nuclear Submarines to be positioned in the appropriate regions\" following \"highly provocative statements\" made by former Russian President Dmitry Medvedev.",
    "link": "https://www.foxnews.com/politics/trump-repositions-2-nuclear-submarines-after-highly-provocative-russian-comments",
    "timestamp": "2025-08-01T17:09:30Z"
  },
  {
    "title": "VP Speaks: Kamala Harris On The ‘Stephen Colbert Show’ Talks Trump Bootlicking, Not Running For Governor & Biden",
    "description": "Vice President Kamala Harris interview on The Late Show with Stephen Colbert\nThe post VP Speaks: Kamala Harris On The ‘Stephen Colbert Show’ Talks Trump Bootlicking, Not Running For Governor & Biden appeared first on Bossip.",
    "link": "https://bossip.com/3665156/kamala-harris-interview-on-the-late-show-with-stephen-colbert/",
    "timestamp": "2025-08-01T17:08:19Z"
  },
  {
    "title": "Canada trade team could quit DC talks after Trump tariffs, says Carney adviser",
    "description": "OTTAWA (Reuters) -The Canadian team working on a trade deal with the United States could walk away from talks in the wake of a U.S. decision to impose a 35% ...",
    "link": "https://ca.finance.yahoo.com/news/canada-trade-team-could-quit-170819236.html",
    "timestamp": "2025-08-01T17:08:19Z"
  },
  {
    "title": "Corporation for Public Broadcasting to Shut Down After Trump-GOP Defunding",
    "description": "The organization that has been funding public media in the United States for more than half a century said on Friday that it is shutting down its operations.In a press release, the Corporation for Public Broadcasting (CPB) said that \"it will begin an orderly …",
    "link": "https://www.commondreams.org/news/corporation-for-public-broadcasting-shuts-down",
    "timestamp": "2025-08-01T17:07:00Z"
  },
  {
    "title": "Federal judges detail rise in threats, ‘pizza doxings,’ as Trump ramps up criticism",
    "description": "In 2020, a disgruntled litigant posing as a deliveryman opened fire at the New Jersey home of District Judge Esther Salas, killing her 20-year-old son Daniel Anderl. Five years later, as President Donald Trump steps up hiscriticism of federal judges who have …",
    "link": "https://freerepublic.com/focus/f-news/4332080/posts",
    "timestamp": "2025-08-01T17:06:56Z"
  },
  {
    "title": "What consumers can expect from import taxes as the U.S. sets new tariff rates",
    "description": "Tariffs are a tax, and U.S. consumers are likely to foot at least part of that bill.",
    "link": "https://www.pbs.org/newshour/economy/what-consumers-can-expect-from-import-taxes-as-the-u-s-sets-new-tariff-rates",
    "timestamp": "2025-08-01T17:06:52Z"
  },
  {
    "title": "JUST IN: Trump Orders U.S. Nuclear Subs Deployed After Medvedev’s Threatening Rhetoric",
    "description": "President Trump directed two U.S. nuclear submarines to deploy in response to Russian official Dmitry Medvedev's warning that U.S. cities could be targeted.\nThe post JUST IN: Trump Orders U.S. Nuclear Subs Deployed After Medvedev’s Threatening Rhetoric first …",
    "link": "https://www.mediaite.com/media/news/just-in-trump-orders-u-s-nuclear-subs-deployed-after-medvedevs-threatening-rhetoric/",
    "timestamp": "2025-08-01T17:06:31Z"
  },
  {
    "title": "Fed Chief Powell Announces He Won’t Cut Interest Rates",
    "description": "By George Caldwell, The Daily Signal | July 30, 2025\nFederal Reserve Chairman Jerome Powell announced Wednesday that the Fed will not be cutting interest rates for the time being, shortly after receiving a quarterly report on the U.S. economy.\nPresident Donal…",
    "link": "https://biztoc.com/x/40bd1fb8689de6d7",
    "timestamp": "2025-08-01T17:06:05Z"
  },
  {
    "title": "Finally, the Authorities Say It: Obama Outed For His Role In ‘Treasonous’ Trump ‘Coup’",
    "description": "By Al Perrotta, The Daily Signal | July 30, 2025\n“This treasonous conspiracy was directed by President [Barack] Obama.” That was Director of National Intelligence Tulsi Gabbard last week talking about the Trump-Russia collusion black op against President Dona…",
    "link": "https://biztoc.com/x/2699d0550107932d",
    "timestamp": "2025-08-01T17:06:02Z"
  },
  {
    "title": "Trump deploys nuclear submarines over Medvedev's remarks",
    "description": "United States President Donald Trump announced on Friday that he ordered the deployment of two nuclear submarines in response to recent comments made by Russian Security Council Deputy Chairman Dmitry...",
    "link": "https://biztoc.com/x/a9e95ff77fc61ae7",
    "timestamp": "2025-08-01T17:06:02Z"
  },
  {
    "title": "What Role Did Soros Group Play in Helping Clinton Campaign Push Russia Hoax? Declassified Docs Shed Light on That.",
    "description": "An executive with the George Soros-aligned Open Society Foundations appears to have coordinated with a staffer from the 2016 Hillary Clinton presidential campaign to promote... Read More\nThe post What Role Did Soros Group Play in Helping Clinton Campaign Push…",
    "link": "https://www.dailysignal.com/2025/08/01/what-role-did-soros-group-play-helping-clinton-campaign-push-russia-narrative-declassified-docs-shed-light/",
    "timestamp": "2025-08-01T17:05:43Z"
  },
  {
    "title": "Mark Halperin Teases Biden Team Has Embarrassing Info To Drop On Kamala Harris",
    "description": "Mark Halperin reported that former President Joe Biden's team has unflattering information ready to release if former Vice President Kamala Harris turns on him.",
    "link": "https://dailycaller.com/2025/08/01/mark-halperin-teases-biden-team-has-embarrassing-info-to-drop-on-kamala-harris/",
    "timestamp": "2025-08-01T17:05:20Z"
  },
  {
    "title": "Ghislaine Maxwell Moved to Minimum Security Texas Prison Following Meeting With Trump Deputy Attorney General",
    "description": "Ghislaine Maxwell was moved to a minimum security women's prison in Texas following her meetings with Deputy Attorney General Todd Blanche.\nThe post Ghislaine Maxwell Moved to Minimum Security Texas Prison Following Meeting With Trump Deputy Attorney General …",
    "link": "https://www.mediaite.com/media/news/ghislaine-maxwell-moved-to-minimum-security-texas-prison-following-meeting-with-trump-deputy-attorney-general/",
    "timestamp": "2025-08-01T17:04:53Z"
  },
  {
    "title": "‘That F*cking Guy’: Bill Burr Unleashes On Ben Shapiro For Calling Him ‘Woke’",
    "description": "Bill Burr laced into conservative commentator Ben Shapiro for saying he had become a \"woke\" comedian.",
    "link": "https://dailycaller.com/2025/08/01/bill-burr-slams-ben-shapiro-woke-comedy-cnn-fox/",
    "timestamp": "2025-08-01T17:03:42Z"
  },
  {
    "title": "Swiss stunned by US tariff hike, seek negotiated solution",
    "description": "SummaryUS announces 39% tariff on imports from Switzerland Swiss manufacturers say tens of thousands of jobs at risk Talks to continue ahead of August 7 introduction RUETLI, Switzerland, Aug 1 (Reuters) - Swiss manufacturers warned on Friday that tens of thou…",
    "link": "https://freerepublic.com/focus/f-news/4332078/posts",
    "timestamp": "2025-08-01T17:03:28Z"
  },
  {
    "title": "New Details Emerge About FBI Finding Trump’s Name in Epstein Files",
    "description": "The FBI went through the Epstein files and redacted Donald Trump’s name, according to the “FOIA Files” newsletter by reporter Jason Leopold, published in Bloomberg Friday.It was previously reported (in a July letter to the Justice Department from Dick Durbin,…",
    "link": "https://newrepublic.com/post/198719/fbi-trump-name-redact-epstein-files",
    "timestamp": "2025-08-01T17:02:12Z"
  },
  {
    "title": "Trump’s Tariffs Kick Off at a Really Bad Time",
    "description": "The president’s promise to make everyone rich feels as empty as the hundreds of thousands of new jobs we now know didn’t exist.",
    "link": "http://nymag.com/intelligencer/article/trumps-tariffs-kick-off-stocks-nosedive.html",
    "timestamp": "2025-08-01T17:01:06Z"
  },
  {
    "title": "Hong Kong firm appeals for legal protection of investors as its Panama Ports contract faces lawsuits",
    "description": "HONG KONG (AP) — A subsidiary of a Hong Kong conglomerate entangled in U.S.-China tensions appealed on Friday for legal protection for businesses in the Central American country after the company’s contract over its Panama Canal port assets has been faced wit…",
    "link": "https://financialpost.com/pmn/hong-kong-firm-appeals-for-legal-protection-of-investors-as-its-panama-ports-contract-faces-lawsuits",
    "timestamp": "2025-08-01T17:01:04Z"
  },
  {
    "title": "Trump slaps 50% tariffs on Brazilian imports over Bolsonaro trial",
    "description": "US President Donald Trump on July 30 announced he would increase tariffs on Brazilian imports from 10 to 50 percent citing the trial of former Brazilian President Jair Bolsonaro for his alleged coup attempt following his loss in the 2022 Brazilian presidentia…",
    "link": "https://freerepublic.com/focus/f-news/4332077/posts",
    "timestamp": "2025-08-01T17:01:04Z"
  },
  {
    "title": "Trump’s US Strategic Bitcoin Reserve Still In Play, Director Reveals",
    "description": "According to a top White House official, the Donald Trump administration is pressing ahead with its plan to establish a US Strategic Bitcoin Reserve. Despite its brief mention in a recent digital assets policy report, the initiative remains firmly in play and…",
    "link": "https://bitcoinist.com/strategic-bitcoin-reserve-in-play/",
    "timestamp": "2025-08-01T17:00:17Z"
  },
  {
    "title": "Trump's America First biodiesel policy could cost US companies, consumers, trade groups warn",
    "description": "NEW YORK (Reuters) -The Trump administration's push to discourage the use of foreign feedstocks in domestic biodiesel could lead to higher energy prices for ...",
    "link": "https://ca.finance.yahoo.com/news/trumps-america-first-biodiesel-policy-170007962.html",
    "timestamp": "2025-08-01T17:00:07Z"
  },
  {
    "title": "“Genuinely scary”: Smithsonian accused of “rewriting history” after quietly removing Trump from impeachment exhibit",
    "description": "The Smithsonian has erased President Donald Trump’s two impeachments from its American History Museum display, and critics are calling it \"Orwellian.\"\n\n\nEarlier this summer, visitors to the Smithsonian’s National Museum of American History noticed a subtle bu…",
    "link": "https://www.dailydot.com/viral-politics/trump-smithsonian-impeachment/",
    "timestamp": "2025-08-01T17:00:00Z"
  },
  {
    "title": "Nintendo Switch Consoles’ Price Changing in US",
    "description": "Nintendo announced on August 1, 2025 that the price of various original Switch consoles and other merchandise from the company will go up, resulting in increased cost changes in the US. There are no statements like this on the company’s Japanese or European s…",
    "link": "https://www.siliconera.com/nintendo-switch-consoles-price-changing-in-us/",
    "timestamp": "2025-08-01T17:00:00Z"
  },
  {
    "title": "Can’t Keep Up With Tariffs? Here’s Your Cheat Sheet",
    "description": "Delayed U.S. tariffs will take effect Aug. 7, increasing rates on dozens of trade partners. President Trump says there will be no more extensions.",
    "link": "https://www.nerdwallet.com/article/finance/tariff-cheat-sheet#article",
    "timestamp": "2025-08-01T16:59:33Z"
  }
]