[
  {
    "title": "Tariffs, explained: How they work and why they matter",
    "description": "What are tariffs? \r\nTariffs are taxes placed on imported goods by a government or a supranational union. Occasionally, tariffs can be applied to exports as well. They generate government revenue and serve as a trade regulation tool, often to shield domestic i…",
    "link": "https://cointelegraph.com/explained/tariffs-explained-how-they-work-and-why-they-matter",
    "timestamp": "2025-04-19T07:55:00Z"
  },
  {
    "title": "Trump claims ‘it’s my job’ to root out ‘killers and thugs’ flooding into US",
    "description": "President Donald Trump attacked his predecessor on Truth Social on Wednesday for forcing him to take drastic measures to deal with “millions and millions of criminals” illegally in this country. Trump affirmed that he would shoo these criminals away, as it wa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-claims-its-my-job-to-root-out-killers-and-thugs-flooding-into-us/articleshow/120427544.cms",
    "timestamp": "2025-04-19T07:46:52Z"
  },
  {
    "title": "US supreme court blocks new deportations of Venezuelans under 18th century wartime law",
    "description": "Lawyers get temporary order to stop Trump administration using 1798 Act to send alleged gang members to El Salvador",
    "link": "https://www.irishtimes.com/world/us/2025/04/19/us-supreme-court-blocks-new-deportations-of-venezuelans-under-18th-century-wartime-law/",
    "timestamp": "2025-04-19T07:46:31Z"
  },
  {
    "title": "Federal Judges Are Ringing the Alarm Over Stephen Miller’s Illegal Deportation Scheme",
    "description": "Stephen Miller isn’t actually a lawyer, he just plays one on TV.",
    "link": "https://slate.com/podcasts/amicus/2025/04/the-white-houses-story-about-kilmar-abrego-garcia-is-changing-by-the-second",
    "timestamp": "2025-04-19T07:45:00Z"
  },
  {
    "title": "Analysis: Trump promised a solution in 100 days in Ukraine, but he can’t make it – The two scenarios behind the American “we’re leaving”",
    "description": "What does the threat of Washington's withdrawal mean - What options does Donald Trump have and what will be the impact on Russia & Europe - The unpredictable factors\nThe post Analysis: Trump promised a solution in 100 days in Ukraine, but he can’t make it – T…",
    "link": "https://en.protothema.gr/2025/04/19/analysis-trump-promised-a-solution-in-100-days-in-ukraine-but-he-cant-make-it-the-two-scenarios-behind-the-american-were-leaving/",
    "timestamp": "2025-04-19T07:44:53Z"
  },
  {
    "title": "Tensions rise as Israel prepares potential attack on Iran’s nuclear facilities",
    "description": "Israel considers limited strike on Iran's nuclear facilities despite U.S. reluctance, aiming to set back nuclear program temporarily.",
    "link": "https://www.thehindubusinessline.com/news/world/tensions-rise-as-israel-prepares-potential-attack-on-irans-nuclear-facilities/article69467559.ece",
    "timestamp": "2025-04-19T07:44:46Z"
  },
  {
    "title": "US Supreme Court orders temporary halt to deportations under antique law",
    "description": "Block on removal of migrants sets up possibility of another challenge by Trump administration to power of the courts.",
    "link": "https://www.aljazeera.com/news/2025/4/19/us-supreme-court-orders-temporary-halt-to-deportations-under-antique-law",
    "timestamp": "2025-04-19T07:42:55Z"
  },
  {
    "title": "US Supreme Court halts deportation of Venezuelans in immigration custody",
    "description": "Lawyers for the American Civil Liberties Union had filed urgent requests in multiple courts, after reports some men had already been loaded onto buses and were told they were to be deported.",
    "link": "https://www.abc.net.au/news/2025-04-19/us-supreme-court-halts-deportation-of-venezuelans-in-immigration/105193682",
    "timestamp": "2025-04-19T07:40:34Z"
  },
  {
    "title": "'Fixed it for you': White House 'corrects' NYT headline over wrongly deported man, netizens call it 'disgusting'",
    "description": "The White House on Friday openly mocked US Senator Chris Van Hollen, for meeting Kilmar Abrego Garcia, the El Salvadoran man mistakenly deported and being held in a prison in El Salvador. It went a step ahead and 'corrected' the NYT headline about Hollen's me…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/fixed-it-for-you-white-house-corrects-nyt-headline-over-wrongly-deported-man-netizens-call-it-disgusting/articleshow/120427410.cms",
    "timestamp": "2025-04-19T07:40:04Z"
  },
  {
    "title": "Donald Trump's 'Demand' Letter To Harvard Was Sent By \"Mistake\": Report",
    "description": "A top official from the Donald Trump administration told Harvard University that a controversial letter sent to the institution last week was issued without proper authorisation.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-demand-letter-to-harvard-was-sent-by-mistake-report-8202057",
    "timestamp": "2025-04-19T07:38:59Z"
  },
  {
    "title": "US Supreme Court Pauses Deportation Of Venezuelans From Texas",
    "description": "The US Supreme Court on Saturday paused the Trump administration's deportation of alleged Venezuelan gang members under an 18th-century law.",
    "link": "https://www.ibtimes.com/us-supreme-court-pauses-deportation-venezuelans-texas-3770641",
    "timestamp": "2025-04-19T07:36:16Z"
  },
  {
    "title": "US Supreme Court pauses deportation of Venezuelans from Texas",
    "description": "The US Supreme Court on Saturday paused the Trump administration’s deportation of alleged Venezuelan gang members under an 18th-century law. US President Donald Trump invoked the 1798 Alien Enemies Act (AEA) last month to begin rounding up Venezuelan migrants…",
    "link": "https://www.digitaljournal.com/world/us-supreme-court-pauses-deportation-of-venezuelans-from-texas/article",
    "timestamp": "2025-04-19T07:33:14Z"
  },
  {
    "title": "Israeli attacks kill at least 50 across Gaza as heavy strikes hit north, south",
    "description": "Dozens of Palestinians, including women and children, have lost their lives in new Israeli strikes on Gaza, as the regime's genocidal war continues unabated across the besieged Gaza Strip.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250418-presstv03.htm",
    "timestamp": "2025-04-19T07:28:29Z"
  },
  {
    "title": "Supreme Court Blocks Donald Trump Deportations Under Alien Enemies Act",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Supreme Court has instructed the Trump administration not to deport a number of Venezuelan men in custody using a 1798 law.\nThe justices said: \"The Government is directed not to remove any member of the pu…",
    "link": "https://biztoc.com/x/668777c94e126ded",
    "timestamp": "2025-04-19T07:25:44Z"
  },
  {
    "title": "US Air Strikes Targeting Yemeni Oil Port; Houthis Say Attack Killed 20 People",
    "description": "The US military said it destroyed a key Yemeni fuel port held by Houthi rebels, who said the air strikes also killed 20 people and wounded 50 others.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250418-rferl01.htm",
    "timestamp": "2025-04-19T07:25:17Z"
  },
  {
    "title": "Bill Maher says AOC shouldn’t be Democratic nominee in 2028 despite recent hype",
    "description": "“Real Time” host Bill Maher is not rallying behind Rep. Alexandria Ocasio-Cortez, D-NY, as the Democratic nominee in 2028. Maher began the panel discussion Friday by pointing to how the prominent “Squad” member and Sen. Bernie Sanders, I-Vt., have been gettin…",
    "link": "https://nypost.com/2025/04/19/media/bill-maher-says-aoc-shouldnt-be-democratic-nominee-in-2028/",
    "timestamp": "2025-04-19T07:25:06Z"
  },
  {
    "title": "250 years after America’s revolution, a nation divides over its legacy",
    "description": "While President Trump pushes for grand celebrations ahead of July 4, 2026, historians urge a more nuanced view that includes the perspectives of women, enslaved people, and Indigenous communities",
    "link": "https://www.thehindubusinessline.com/news/variety/250-years-after-americas-revolution-a-nation-divides-over-its-legacy/article69467533.ece",
    "timestamp": "2025-04-19T07:25:00Z"
  },
  {
    "title": "US airstrikes on Yemen's Ras Isa oil port kill 74 people",
    "description": "The US military has struck the western Yemeni oil port of Ras Isa, leaving dozens of workers and paramedics dead, and dozens more injured.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250418-presstv07.htm",
    "timestamp": "2025-04-19T07:24:42Z"
  },
  {
    "title": "Supreme Court Blocks Donald Trump Deportations Under Alien Enemies Act",
    "description": "Justices Clarence Thomas and Samuel Alito dissented from the decision.",
    "link": "https://www.newsweek.com/supreme-court-blocks-donald-trump-deportations-alien-enemies-act-2061693",
    "timestamp": "2025-04-19T07:24:00Z"
  },
  {
    "title": "Agreement within reach if US makes no unreasonable, unrealistic demands: Iran FM",
    "description": "Iranian Foreign Minister Abbas Araghchi says an agreement with the United States is possible as long as Washington does not put forward \"unrealistic\" demands.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250418-presstv03.htm",
    "timestamp": "2025-04-19T07:19:56Z"
  },
  {
    "title": "Will the US yield to Iran on nuclear talks?",
    "description": "From Israel’s vantage point, the objective is clear: Prevent Iran from developing nuclear weapons and halt its military entrenchment in Syria and Lebanon.",
    "link": "https://www.jpost.com/opinion/article-850511",
    "timestamp": "2025-04-19T07:18:57Z"
  },
  {
    "title": "FM: Iran to 'judge' how to proceed after Saturday talks in Rome",
    "description": "Iran's Foreign Minister Abbas Araghchi says Tehran will assess and decide on the path ahead of negotiations based on the approach of the United States in the second stage of indirect talks that is set to be held in Rome, Italy.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250418-presstv06.htm",
    "timestamp": "2025-04-19T07:18:54Z"
  },
  {
    "title": "Iranian Foreign Minister Calls For Russian Support In Nuclear Talks",
    "description": "Iran's foreign minister has called for Russia to play a role in high-stakes negotiations over the fate of Tehran's nuclear programs, as he cast doubt on US intentions ahead a new round of talks.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250418-rferl01.htm",
    "timestamp": "2025-04-19T07:18:52Z"
  },
  {
    "title": "UN sees U.S.-Iran nuclear talks as \"good sign\": spokesman",
    "description": "The United Nations views the second round of negotiations between the United States and Iran this weekend as \"a good sign,\" and hopes it will yield positive results, a UN spokesman said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250418-pdo01.htm",
    "timestamp": "2025-04-19T07:18:34Z"
  },
  {
    "title": "What You Need To Know Before The Next Round Of US-Iran Talks",
    "description": "Iranian and US negotiators will hold a second round of indirect talks on April 19, a week after concluding discussions that both sides described as \"constructive\" and \"positive.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250419-rferl01.htm",
    "timestamp": "2025-04-19T07:17:43Z"
  },
  {
    "title": "Threats of Strikes on Iran's Nuclear Facilities Are 'Unacceptable' - IAEA Chief",
    "description": "International Atomic Energy Agency (IAEA) Director General Rafael Grossi called threats of strikes on Iran's nuclear facilities \"unacceptable.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250418-sputnik01.htm",
    "timestamp": "2025-04-19T07:17:38Z"
  },
  {
    "title": "China slams US plans to charge port fees on Chinese-built vessels, vows to defend interests",
    "description": "China's Foreign Ministry slammed US plans to charge port fees on Chinese-built vessels on Friday, urging the US side to respect facts and multilateral rules, immediately stop its wrongdoings and warned that China will take necessary measures to defend its law…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250418-globaltimes01.htm",
    "timestamp": "2025-04-19T07:15:14Z"
  },
  {
    "title": "Trump says tariff deal with China likely within 3-4 weeks",
    "description": "U.S. President Donald Trump said that Washington and Beijing were in talks on tariffs, expressing confidence that the world's two largest economies would reach a deal over the next three to four weeks.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250418-rfa01.htm",
    "timestamp": "2025-04-19T07:14:17Z"
  },
  {
    "title": "Trade war with US triggers wave of factory 'holidays' in China's export hubs",
    "description": "As the U.S.-China trade war heats up, businesses in major export hubs in southeastern China are announcing factory \"holidays\" - halting production and slashing employee wages and work hours - while turning to social commerce platforms to sell stockpiled goods…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250418-rfa02.htm",
    "timestamp": "2025-04-19T07:14:08Z"
  },
  {
    "title": "Inside Trump’s immigration crackdown: The role of AI and surveillance",
    "description": "Technologies like facial recognition, robotic patrols, and social media tracking are being used by DHS and ICE, with critics warning of data inaccuracies and privacy violations",
    "link": "https://www.thehindubusinessline.com/news/world/inside-trumps-immigration-crackdown-the-role-of-ai-and-surveillance/article69467508.ece",
    "timestamp": "2025-04-19T07:12:53Z"
  },
  {
    "title": "Maintain stability to ensure country’s resilience, competitiveness, says Anwar",
    "description": "KUCHING: Prime Minister Datuk Seri Anwar Ibrahim said that Malaysians must prioritise maintaining the country's stability to effectively face global challenges, ensuring the nation's resilience and competitiveness. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/19/maintain-stability-to-ensure-countrys-resilience-competitiveness-says-anwar",
    "timestamp": "2025-04-19T07:12:00Z"
  },
  {
    "title": "Australian PM pledges to stand up for national interests against Trump on trade",
    "description": "Australian Prime Minister Anthony Albanese has said that he would stand up for national interests in response to U.S. tariffs during the second leaders' debate of the election campaign.",
    "link": "https://www.globalsecurity.org/wmd/library/news/australia/2025/australia-250418-pdo01.htm",
    "timestamp": "2025-04-19T07:09:50Z"
  },
  {
    "title": "Millard: Natural gas easing carbon emissions: Study",
    "description": "Studies dating back more than a decade have shown similar results. In the past, advocates concerned about global warming embraced natural gas.",
    "link": "https://www.bostonherald.com/2025/04/19/millard-natural-gas-easing-carbon-emissions-study/",
    "timestamp": "2025-04-19T07:04:25Z"
  },
  {
    "title": "China rejects groundless accusations, political manipulation over Zelensky's claim of arming Russia",
    "description": "In response to an inquiry about a Reuters report that Ukrainian President Volodymyr Zelensky claimed that China was supplying weapons and gunpowder to Russia, the first time he has openly accused Beijing of direct military assistance for Moscow, the Chinese F…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250418-globaltimes01.htm",
    "timestamp": "2025-04-19T07:03:43Z"
  },
  {
    "title": "Rubio Signals Impatience In Ukraine Talks; Says US 'Ready To Move On'",
    "description": "The United States' top diplomat signaled impatience with European officials as two days of talks to find a resolution to the Ukraine conflict wrapped up.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250418-rferl03.htm",
    "timestamp": "2025-04-19T07:03:22Z"
  },
  {
    "title": "Vance in Rome: God, tarrifs, and Ukraine",
    "description": "US Vice President JD Vance, a Catholic convert, spent Easter weekend in Rome, meeting with Giorgia Meloni and Cardinal Pietro Parolin, the Vatican’s second-highest official.",
    "link": "https://www.euractiv.com/section/politics/news/vance-in-rome-god-tarrifs-and-ukraine/",
    "timestamp": "2025-04-19T07:01:25Z"
  },
  {
    "title": "Bitcoin Ready To Reclaim $90,000? BTC’s ‘Next Big Move’ Could Come Next Week",
    "description": "Amid the market volatility, Bitcoin (BTC) has been unable to reclaim the $85,000-$86,000 zone despite its weekly performance. However, some analysts suggest that a breakout from the key resistance level might be around the corner. Related Reading: On-Chain Ex…",
    "link": "http://www.newsbtc.com/bitcoin-news/bitcoin-ready-to-reclaim-90000-btcs-next-big-move-could-come-next-week/",
    "timestamp": "2025-04-19T07:00:41Z"
  },
  {
    "title": "FactCheck: Studies of millions of children show there is no connection between autism and vaccines",
    "description": "“Is there a person in the world with autism,” McGregor asked, “who was not vaccinated whatsoever?” (spoiler: there is)",
    "link": "https://www.thejournal.ie/factcheck-factfind-conor-mcgregor-asked-if-there-was-a-single-autistic-person-who-had-not-been-vaccinated-6679707-Apr2025/",
    "timestamp": "2025-04-19T07:00:32Z"
  },
  {
    "title": "Should You Buy a New iPhone This Weekend Before They Get More Expensive?",
    "description": "Prices are likely to go up, even if the exact amount is unclear. But experts warn against panic-buying if it puts you in debt.",
    "link": "https://www.cnet.com/personal-finance/taxes/should-you-buy-a-new-iphone-this-weekend-before-they-get-more-expensive/",
    "timestamp": "2025-04-19T07:00:00Z"
  },
  {
    "title": "Judge pauses Trump administration's plans for mass layoffs at Consumer Financial Protection Bureau",
    "description": "President Donald Trump’s attempt to fire nearly everyone at the Consumer Financial Protection Bureau has been paused by a federal judge, who says she's “deeply concerned” about the plan",
    "link": "https://www.wpxi.com/news/judge-pauses-trump/4WUMANYMJ5FKDMTISR7OBEHXOU/",
    "timestamp": "2025-04-19T06:54:56Z"
  },
  {
    "title": "Are we heading for a US recession? All your key questions answered",
    "description": "The US economy faces risk of a potential recession and this has raised global economic stability concerns. Trade war with China has weakened business confidence. Economists predict a possible recession within a year. The US recession can reduce import demand.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/are-we-heading-for-a-us-recession-all-your-key-questions-answered/articleshow/120426870.cms",
    "timestamp": "2025-04-19T06:54:10Z"
  },
  {
    "title": "Supreme Court blocks new deportations of Venezuelans in Texas under 18th-century wartime law",
    "description": "The Supreme Court on Saturday blocked, for now, the deportations of any Venezuelans held in northern Texas under an 18th-century wartime law. In a brief order, the court directed the Trump administration not to remove Venezuelans held in the Bluebonnet Detent…",
    "link": "https://freerepublic.com/focus/f-news/4311929/posts",
    "timestamp": "2025-04-19T06:53:27Z"
  },
  {
    "title": "US Supreme Court temporarily halts deportations of Venezuelan migrants under wartime law",
    "description": "(Reuters) -The U.S. Supreme Court early on Saturday paused President Donald Trump's administration from deporting Venezuelan men in immigration custody after their lawyers said they were at imminent risk of removal without the judicial review previously manda…",
    "link": "https://www.thestar.com.my/news/world/2025/04/19/us-supreme-court-temporarily-halts-deportations-of-venezuelan-migrants-under-wartime-law",
    "timestamp": "2025-04-19T06:46:00Z"
  },
  {
    "title": "US Supreme Court halts deportation of Venezuelans under wartime law",
    "description": "The Trump administration has been deporting accused gang members to a notorious El Salvador jail.",
    "link": "https://www.bbc.com/news/articles/czd3rdjn81lo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-19T06:45:22Z"
  },
  {
    "title": "US Supreme Court halts deportation of Venezuelans under wartime law",
    "description": "The Trump administration has been deporting accused gang members to a notorious El Salvador jail.",
    "link": "https://www.bbc.com/news/articles/czd3rdjn81lo",
    "timestamp": "2025-04-19T06:45:18Z"
  },
  {
    "title": "80 killed in deadliest US attack on Yemen in more than a year",
    "description": "Rescuers were still searching for bodies at the fuel terminal on the Red Sea, suggesting the number of dead could rise.",
    "link": "https://www.thejournal.ie/80-killed-in-deadliest-us-attack-on-yemen-houthis-say-6682387-Apr2025/",
    "timestamp": "2025-04-19T06:43:43Z"
  },
  {
    "title": "GOP push to make Trump’s 2017 tax cuts permanent, say going back would be a ‘dramatic’ change for many",
    "description": "With tax season officially over, Congressional Republicans are now pushing to make President Donald Trump's 2017 tax cuts permanent before they expire later this year.",
    "link": "https://www.foxnews.com/politics/gop-push-make-trumps-2017-tax-cuts-permanent-say-going-back-would-dramatic-change-many",
    "timestamp": "2025-04-19T06:42:24Z"
  },
  {
    "title": "BREAKING: Supreme Court Blocks Trump’s Use of Alien Enemies Act to Deport Illegals — Justices Thomas and Alito Dissent in Fiery Rebuke",
    "description": "In a significant ruling, the Supreme Court halts Trump's deportation efforts under the Alien Enemies Act, with dissenting opinions from Justices Thomas and Alito. This pivotal decision reshapes the legal landscape of immigration policy.\nThe post BREAKING: Sup…",
    "link": "https://www.thegatewaypundit.com/2025/04/breaking-supreme-court-blocks-trumps-use-alien-enemies/",
    "timestamp": "2025-04-19T06:35:23Z"
  },
  {
    "title": "Google loses online ad monopoly case. But it’s just one of many antitrust battles against big tech",
    "description": "Hearings in the Meta case commenced earlier this week in Washington DC as Zuckerberg failed to settle the case for $450 million.",
    "link": "https://www.thehindubusinessline.com/info-tech/google-loses-online-ad-monopoly-case-but-its-just-one-of-many-antitrust-battles-against-big-tech/article69467430.ece",
    "timestamp": "2025-04-19T06:30:12Z"
  },
  {
    "title": "Supreme Court blocks, for now, new deportations under Alien Enemies Act",
    "description": "The Supreme Court has blocked, for now, the deportations of any Venezuelans held in northern Texas under an 18th century wartime law",
    "link": "https://abcnews.go.com/US/wireStory/aclu-claims-administration-restarting-deportations-18th-century-wartime-120957485",
    "timestamp": "2025-04-19T06:29:37Z"
  },
  {
    "title": "Joe Rogan ditches vice that haunted Donald Trump as he announces major lifestyle change",
    "description": "Joe Rogan recently revealed he has decided to make a huge change to his lifestyle by giving up alcohol - a move which follows in the footsteps of Donald Trump. The president has famously steered clear of booze after witnessing first-hand dangers of alcohol th…",
    "link": "https://freerepublic.com/focus/f-chat/4311928/posts",
    "timestamp": "2025-04-19T06:29:21Z"
  },
  {
    "title": "Supreme Court blocks new deportations of Venezuelans in Texas under 18th-century wartime law",
    "description": "In a brief order, the court directed the Trump administration not to remove Venezuelans held in the Bluebonnet Detention Center “until further order of this court.”",
    "link": "https://nypost.com/2025/04/19/us-news/supreme-court-blocks-new-deportations-of-of-venezuelans-under-18th-century-wartime-law-alien-enemies-act/",
    "timestamp": "2025-04-19T06:28:28Z"
  },
  {
    "title": "Iran-U.S. talks continue as Israel weighs Iran strike without Trump support, sources say",
    "description": "U.S. and Iranian negotiators are in Rome for a second round of preliminary nuclear talks on Saturday. The New York Times reported on Wednesday that Trump told Netanyahu Washington wanted to prioritize diplomatic talks with Tehran",
    "link": "https://www.haaretz.com/israel-news/2025-04-19/ty-article/iran-u-s-talks-continue-as-israel-weighs-iran-strike-without-trump-support-sources-say/00000196-4c9e-dd47-ad9f-cedfd9d70000",
    "timestamp": "2025-04-19T06:27:16Z"
  },
  {
    "title": "Iran, US to hold second round of high-stakes nuclear talks in Rome",
    "description": "The United States and Iran are set to resume high-stakes talks Saturday on Tehran's nuclear programme, a week after an initial round of discussions that both sides described as \"constructive\".",
    "link": "https://www.hurriyetdailynews.com/iran-us-to-hold-second-round-of-high-stakes-nuclear-talks-in-rome-208240",
    "timestamp": "2025-04-19T06:26:22Z"
  },
  {
    "title": "250 years after America went to war for independence, divided nation battles over its legacy",
    "description": "As the 250th anniversary of the American Revolution begins, the nation grapples with its complex legacy. The initial conflict at Lexington and Concord, though shrouded in mystery, ignited a fight for self-governance. While colonists initially sought reconcili…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/250-years-after-america-went-to-war-for-independence-divided-nation-battles-over-its-legacy/articleshow/120426514.cms",
    "timestamp": "2025-04-19T06:25:34Z"
  },
  {
    "title": "Merz's coalition deal: a 'betrayal' of Germany?",
    "description": "With liberalism, freedom and democracy under threat globally, it's a time for 'giants' – but this is a 'coalition of the timid'",
    "link": "https://theweek.com/politics/merzs-coalition-deal-a-betrayal-of-germany",
    "timestamp": "2025-04-19T06:23:00Z"
  },
  {
    "title": "The White House officially confirms that COVID came from a lab and accuses Fauci of a deliberate cover-up",
    "description": "The five arguments - The first cases of the disease occurred in Wuhan, China\nThe post The White House officially confirms that COVID came from a lab and accuses Fauci of a deliberate cover-up appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/04/19/the-white-house-officially-confirms-that-covid-came-from-a-lab-and-accuses-fauci-of-a-deliberate-cover-up/",
    "timestamp": "2025-04-19T06:22:58Z"
  },
  {
    "title": "Trump warns US could ditch Ukraine talks if there's no progress soon",
    "description": "Trump has been pressing both sides for a truce, but has failed to extract any major concessions from the Kremlin.",
    "link": "https://www.thejournal.ie/trump-warns-us-could-ditch-ukraine-talks-if-no-progress-6682381-Apr2025/",
    "timestamp": "2025-04-19T06:16:45Z"
  },
  {
    "title": "Supreme Court blocks, for now, new deportations under 18th century wartime law",
    "description": "The Supreme Court on Saturday blocked, for now, the deportations of any Venezuelans held in northern Texas under an 18th century wartime law. In a brief order, the court directed the Trump administration not to remove Venezuelans held in the Bluebonnet Detent…",
    "link": "https://japantoday.com/category/world/Supreme-Court-blocks-for-now-new-deportations-under-18th-century-wartime-law",
    "timestamp": "2025-04-19T06:15:20Z"
  },
  {
    "title": "Anti-Trump protests in US today: Where are people holding rallies and what is ‘Day of action’?",
    "description": "A series of nationwide protests against President Donald Trump and his policies are set to take place on April 19 in all 50 U.S. states, while other protests will take place in upcoming days. The protests are being organised by 50501 movement and they believe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/anti-trump-protests-in-us-today-where-are-people-holding-rallies-and-what-is-day-of-action/articleshow/120426269.cms",
    "timestamp": "2025-04-19T06:15:03Z"
  },
  {
    "title": "US Supreme Court Pauses Deportation Of Venezuelan Migrants Under Aliens Law",
    "description": "Donald Trump began rounding up Venezuelan migrants accused of belonging to the Tren de Aragua gang before expelling them to a maximum security prison in El Salvador.",
    "link": "https://www.ndtv.com/world-news/us-supreme-court-pauses-deportation-of-venezuelan-migrants-under-aliens-law-8201572",
    "timestamp": "2025-04-19T06:11:50Z"
  },
  {
    "title": "Google loses online ad monopoly case. But it's just one of many antitrust battles against big tech",
    "description": "Big Tech firms including Google, Meta, Apple, and Amazon are facing major antitrust lawsuits in the US. Accused of monopolistic practices, these cases could lead to breakups or strict restrictions. Collectively, these cases represent a substantial regulatory …",
    "link": "https://economictimes.indiatimes.com/tech/technology/google-loses-online-ad-monopoly-case-but-its-just-one-of-many-antitrust-battles-against-big-tech/articleshow/120426297.cms",
    "timestamp": "2025-04-19T06:11:17Z"
  },
  {
    "title": "US to bring down forces in Syria to less than 1,000 in coming months: Pentagon",
    "description": "The Pentagon announced Friday that it is consolidating U.S. forces in Syria under the Combined Joint Task Force – Operation Inherent Resolve, reducing troop numbers to less than 1,000 in the coming months.",
    "link": "https://www.hurriyetdailynews.com/us-to-bring-down-forces-in-syria-to-less-than-1-000-in-coming-months-pentagon-208238",
    "timestamp": "2025-04-19T06:10:32Z"
  },
  {
    "title": "The silence between von der Leyen and Trump looms large over trade talks",
    "description": "Despite the European Commission holding exclusive competence on trade policy, Donald Trump has not spoken with its president, Ursula von der Leyen, since he returned to the White House.",
    "link": "https://biztoc.com/x/7f383597e154bc79",
    "timestamp": "2025-04-19T06:09:03Z"
  },
  {
    "title": "Ford Halts Exports Of Sports Cars, Other Models To China Amid Tariff War",
    "description": "The US auto giant reportedly halted Michigan-made shipments of the F-150 Raptor, Mustang and Bronco sport utility vehicles.",
    "link": "https://www.ndtv.com/world-news/ford-halts-exports-of-sports-cars-other-models-to-china-amid-tariff-war-8201519",
    "timestamp": "2025-04-19T06:03:32Z"
  },
  {
    "title": "Trump administration proposes over $40 billion budget cut for federal health agencies",
    "description": "The Trump administration plans to slash nearly one-third of HHS funding ($40 billion), targeting agencies like the CDC (44% cut) and NIH (42% cut), while consolidating programs into a new Administration for a Healthy America (AHA). NIH faces mass closures, wi…",
    "link": "https://www.naturalnews.com/2025-04-19-trump-administration-over-40b-budget-cuts-health-agencies.html",
    "timestamp": "2025-04-19T06:00:00Z"
  },
  {
    "title": "Trump chooses negotiation table over Israeli airstrikes in key Iran policy decision",
    "description": "Trump rejects Netanyahu’s push for a U.S.-backed military strike on Iran, opting for diplomacy instead. Israeli plans included commando raids and airstrikes on Iran’s nuclear sites, requiring American support. U.S. officials warned an attack could trigger a w…",
    "link": "https://www.naturalnews.com/2025-04-19-trump-chooses-negotiation-over-israeli-airstrikes-iran.html",
    "timestamp": "2025-04-19T06:00:00Z"
  },
  {
    "title": "Transatlantic trade war could have consequences for how we all use the internet",
    "description": "Tech bros who backed Trump are being hit by buyer’s remorse – but it may already be too late",
    "link": "https://www.irishtimes.com/opinion/2025/04/19/transatlantic-trade-war-could-have-consequences-for-how-we-all-use-the-internet/",
    "timestamp": "2025-04-19T06:00:00Z"
  },
  {
    "title": "Meet Romulus and Remus, first of their kind for 10,000 years. Sort of",
    "description": "The spurious idea of 'de-extinction' offers us the illusion of undoing one of the great catastrophes of our own era",
    "link": "https://www.irishtimes.com/opinion/2025/04/19/meet-romulus-and-remus-first-of-their-kind-for-10000-years-sort-of/",
    "timestamp": "2025-04-19T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s bold trade overhaul reaches a crossroads with Italy, as â\u0080\u009cfair dealsâ\u0080\u009d promise sparks global attention",
    "description": "President Trump emphasizes his “fair trade” agenda, using tariffs as leverage in negotiations with Japan, the EU and Mexico, aiming to reduce U.S. trade deficits and rebalance relationships. The U.S. has imposed (but temporarily suspended) high tariffs (24% o…",
    "link": "https://www.naturalnews.com/2025-04-19-trumps-trade-overhaul-reaches-crossroads-with-italy.html",
    "timestamp": "2025-04-19T06:00:00Z"
  },
  {
    "title": "Starmer, Trump discuss trade, security over phone",
    "description": "LONDON, April 18 (Xinhua) -- British Prime Minister Keir Starmer reaffirmed his commitment to free a",
    "link": "http://en.people.cn/n3/2025/0419/c90000-20304565.html",
    "timestamp": "2025-04-19T05:58:52Z"
  },
  {
    "title": "US: Letter to Harvard reportedly sent by mistake",
    "description": "The letter sent to Harvard University on April 11 by the administration of United States President Donald Trump was reportedly \"unauthorized,\" according to the New York Times, citing two people famili...",
    "link": "https://biztoc.com/x/2b64fd180de23316",
    "timestamp": "2025-04-19T05:57:58Z"
  },
  {
    "title": "Iran, US To Hold Second Round Of High-stakes Nuclear Talks In Rome",
    "description": "The United States and Iran are set to resume high-stakes talks Saturday on Tehran's nuclear programme, a week after an initial round of discussions that both sides described as \"constructive\".",
    "link": "https://www.ibtimes.com.au/iran-us-hold-second-round-high-stakes-nuclear-talks-rome-1858028",
    "timestamp": "2025-04-19T05:57:12Z"
  },
  {
    "title": "Volkswagen floats making Audis in US to swerve Trump tariffs",
    "description": "Volkswagen could relocate some production of its high-end Audi line to dodge US tariffs on automobiles ordered by President Donald Trump, the German carmaker's CEO said in an interview released Friday.",
    "link": "https://www.thelocal.de/20250419/volkswagen-floats-making-audis-in-us-to-swerve-trump-tariffs",
    "timestamp": "2025-04-19T05:50:59Z"
  },
  {
    "title": "Trump firing Powell would be a ‘very bad precedent to set’ — Pompliano",
    "description": "Crypto entrepreneur Anthony Pompliano says that US President Donald Trump shouldn’t follow through on his recent threat to fire the head of the US Federal Reserve, saying it would set a dangerous precedent — especially considering the true motive behind it.“I…",
    "link": "https://cointelegraph.com/news/united-states-donald-trump-jerome-powell-consequences-firing-federal-reserve",
    "timestamp": "2025-04-19T05:50:28Z"
  },
  {
    "title": "America is a nation of believers. We need God. We want God. And with His help, we will make our nation stronger...” –President Donald J. Trump [Easter message]",
    "description": "https://x.com/WhiteHouse/status/1913390910697513009Apr 18, 2025",
    "link": "https://freerepublic.com/focus/f-chat/4311926/posts",
    "timestamp": "2025-04-19T05:50:15Z"
  },
  {
    "title": "Appeals court halts Judge Boasberg’s contempt proceedings against Trump officials in deportation flights case",
    "description": "In a 2-1 ruling, a panel of judges on the US Court of Appeals for the DC Circuit “administratively stayed” Boasberg’s April 16 order “pending further order of the court.”",
    "link": "https://nypost.com/2025/04/19/us-news/trump-deportation-administration-contempt-proceedings-from-judge-james-boasberg-halted-by-appeals-court/",
    "timestamp": "2025-04-19T05:48:52Z"
  },
  {
    "title": "Supreme Court blocks, for now, new deportations under 18th century wartime law",
    "description": "In a brief order, the court directed the Trump administration not to remove Venezuelans held in the Bluebonnet Detention Center \"until further order of this court.\"",
    "link": "https://www.npr.org/2025/04/19/g-s1-61385/supreme-court-block-deportations",
    "timestamp": "2025-04-19T05:48:31Z"
  },
  {
    "title": "Israel still eyeing a limited attack on Iran's nuclear facilities",
    "description": "Israel has not ruled out an attack on Iran's nuclear facilities in the coming months despite President Donald Trump telling Israeli Prime Minister Benjamin Netanyahu that the U.S. was for now unwilling to support such a move, according to an Israeli official …",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/israel-limited-iran-strike/",
    "timestamp": "2025-04-19T05:48:00Z"
  },
  {
    "title": "Iran, US to hold second round of high-stakes nuclear talks in Rome",
    "description": "ROME - The United States and Iran are set to resume high-stakes talks Saturday on Tehran's nuclear programme, a week after an initial round of discussions that both sides described as \"constructive\".",
    "link": "https://www.bangkokpost.com/world/3006384/iran-us-to-hold-second-round-of-high-stakes-nuclear-talks-in-rome",
    "timestamp": "2025-04-19T05:45:00Z"
  },
  {
    "title": "Trump Memecoin ‘unlock’ raises risk of further slide by once-hot token",
    "description": "Trump memecoins are set for a major unlock. This event could significantly impact the crypto market. Earlier, the token's value surged and then crashed. Now, more coins will be available. Experts are unsure if this will cause another price drop. The Trump fam…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/trump-memecoin-unlock-raises-risk-of-further-slide-by-once-hot-token/articleshow/120425364.cms",
    "timestamp": "2025-04-19T05:41:26Z"
  },
  {
    "title": "US Supreme Court halts deportations under 18th century wartime law",
    "description": "This emergency intervention came after the ACLU raised alarms that Immigration and Customs Enforcement was preparing to remove detainees from the Bluebonnet Detention Centre without due process",
    "link": "https://www.thehindubusinessline.com/news/world/us-supreme-court-halts-deportations-under-18th-century-wartime-law/article69467389.ece",
    "timestamp": "2025-04-19T05:33:52Z"
  },
  {
    "title": "Joe Rogan gave up drinking alcohol for this one simple reason",
    "description": "Joe Rogan has joined the growing tribe of teetotalers.",
    "link": "https://nypost.com/2025/04/19/health/joe-rogan-gave-up-alcohol-because-drinking-isnt-healthy/",
    "timestamp": "2025-04-19T05:33:31Z"
  },
  {
    "title": "US Supreme Court blocks, for now, new deportations under 18th century wartime law",
    "description": "The Supreme Court intervened to halt the deportation of Venezuelans from a detention center in northern Texas. This action followed an appeal by the American Civil Liberties Union. The ACLU argued that the Trump administration was improperly using the Alien E…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-supreme-court-blocks-for-now-new-deportations-under-18th-century-wartime-law/articleshow/120425072.cms",
    "timestamp": "2025-04-19T05:30:50Z"
  },
  {
    "title": "Iran, US set for second round of nuclear talks in Rome",
    "description": "Iran and US prepare for nuclear talks in Rome, with high stakes and potential for historic agreement.",
    "link": "https://www.thehindubusinessline.com/news/world/iran-us-set-for-second-round-of-nuclear-talks-in-rome/article69467369.ece",
    "timestamp": "2025-04-19T05:19:56Z"
  },
  {
    "title": "Trump ousts IRS chief just days after appointing him amid feud between Elon Musk and Scott Bessent",
    "description": "President Donald Trump has replaced the acting IRS commissioner Gary Shapley just days after he appointed him amid the ongoing feud between US Treasury Secretary Scott Bessent and his tech billionaire ally Elon Musk. \"Trust must be brought back to the IRS, an…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-ousts-irs-chief-just-days-after-appointing-him-amid-feud-between-elon-musk-and-trump-official/articleshow/120424689.cms",
    "timestamp": "2025-04-19T05:19:32Z"
  },
  {
    "title": "Trump's Feud With Harvard Risks Critical Research Into Lou Gehrig's Disease",
    "description": "David Walt&#039;s project is one of many that&#039;s getting caught in the middle of what&#039;s poised to become a protracted political and legal fight over the government&#039;s ability to dictate conditions to the nation&#039;s private universities.",
    "link": "https://www.ndtv.com/world-news/trumps-feud-with-harvard-risks-critical-research-into-lou-gehrigs-disease-8201276",
    "timestamp": "2025-04-19T05:15:28Z"
  },
  {
    "title": "Romania's presidential election redo is a high-stakes test of its democracy following annulled vote",
    "description": "Romania is gearing up to hold a presidential election redo next month, a high-stakes test for the European Union member’s democracy after last year’s annulled vote triggered the country’s deepest political crisis since 1989",
    "link": "https://abcnews.go.com/International/wireStory/romanias-presidential-election-redo-high-stakes-test-democracy-120969846",
    "timestamp": "2025-04-19T05:13:46Z"
  },
  {
    "title": "Israel still eyeing a limited attack on Iran's nuclear facilities",
    "description": "From Israel's perspective, this may be a good moment for a strike against Iran's nuclear facilities.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-850661",
    "timestamp": "2025-04-19T05:07:57Z"
  },
  {
    "title": "Donald Trump vs Mr Market",
    "description": "As the US president’s rollercoaster tariff policy creates global financial chaos, Tim Harford asks: is he in a fight he can’t win?",
    "link": "https://biztoc.com/x/4be8d5cde1955a1a",
    "timestamp": "2025-04-19T05:02:51Z"
  },
  {
    "title": "Could Trump’s tariffs give a green light for corporate profiteering?",
    "description": "Expectations of inflation, and recent waves of price rises, could be self-fulfilling and fuel ‘greedflation’ – and it may not only apply to US consumers",
    "link": "https://www.yahoo.com/news/could-trump-tariffs-green-light-050030665.html",
    "timestamp": "2025-04-19T05:00:30Z"
  },
  {
    "title": "Soviet reactors for silicon dreams: Bulgaria snubs Ukraine in bid for AI future",
    "description": "\"I want to speak with President Trump, Elon Musk, Microsoft, Bill Gates. If they’re interested and we can make this happen,\" Borissov said on Wednesday.",
    "link": "https://www.euractiv.com/section/politics/news/soviet-reactors-for-silicon-dreams-bulgaria-snubs-ukraine-in-bid-for-ai-future/",
    "timestamp": "2025-04-19T05:00:25Z"
  },
  {
    "title": "For Ireland, the choice between the US and China is easy",
    "description": "The US president’s tariffs echo the Great Game of old, presenting knotty problems for Europe",
    "link": "https://www.irishtimes.com/opinion/2025/04/19/david-mcwilliams-for-ireland-the-choice-between-the-us-and-china-is-easy/",
    "timestamp": "2025-04-19T05:00:00Z"
  },
  {
    "title": "Miriam Lord’s Easter awards: Best Varadkar tribute act, Jemser balance respected and outstanding Dáil dust-up",
    "description": "From the Burke family to Mattie McGrath and Michael Lowry, here are the winners of Miriam Lord's Easter awards",
    "link": "https://www.irishtimes.com/politics/oireachtas/2025/04/19/miriam-lords-easter-awards-best-varadkar-tribute-act-jemser-balance-respected-and-outstanding-dail-dust-up/",
    "timestamp": "2025-04-19T05:00:00Z"
  },
  {
    "title": "Supreme Court blocks, for now, deportations of Venezuelans held in northern Texas under an 18th century wartime law",
    "description": "Supreme Court blocks, for now, deportations of Venezuelans held in northern Texas under an 18th century wartime law",
    "link": "https://www.bostonherald.com/2025/04/19/supreme-court-blocks-for-now-deportations-of-venezuelans-held-in-northern-texas-under-an-18th-century-wartime-law/",
    "timestamp": "2025-04-19T04:58:06Z"
  },
  {
    "title": "Dr Oz's Granddaughter Faints During His Swearing-In Ceremony At Oval Office",
    "description": "White House aides sprung into action, shooing away reporters and photographers, who were covering the White House swearing-in ceremony of Mehmet Oz as Administrator of the Centers for Medicare and Medicaid Services (CMS).",
    "link": "https://www.ndtv.com/world-news/dr-ozs-granddaughter-faints-during-his-swearing-in-ceremony-at-oval-office-everybody-out-8201140",
    "timestamp": "2025-04-19T04:49:31Z"
  },
  {
    "title": "On new website, White House declares lab leak as 'true origins' of Covid amid tariff war with China",
    "description": "The White House’s newly revamped Covid-19 website has placed the controversial lab-leak theory at the forefront of its discussion on the origins of the virus. The website criticizes Joe Biden and Dr Anthony Fauci and has also called out masks and social dista…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/on-new-website-white-house-declares-lab-leak-as-true-origins-of-covid-amid-tariff-war-with-china/articleshow/120423658.cms",
    "timestamp": "2025-04-19T04:46:22Z"
  },
  {
    "title": "Bill Maher says AOC shouldn't be Democratic nominee in 2028 despite recent hype",
    "description": "HBO's Bill Maher cautioned Democrats from backing Rep. Alexandria Ocasio-Cortez as their party's nominee in 2028 as the\"Squad\" member has been holding rallies around the country.",
    "link": "https://www.foxnews.com/media/bill-maher-says-aoc-shouldnt-democratic-nominee-2028-despite-recent-hype",
    "timestamp": "2025-04-19T04:42:08Z"
  }
]