[
  {
    "title": "Will a US-China trade agreement work? Don’t count on it",
    "description": "Past experience and current reality should reduce optimism over a prospective trade deal between the world’s two largest national economies. Also, even if prohibitively steep import tariffs go, the ‘bullwhip effect’ on supply chains will play out.",
    "link": "https://www.livemint.com/opinion/online-views/us-china-trade-war-trump-tariffs-global-supply-disruption-phase-one-agreement-economic-volatility-manufacturing-delays-11747129002522.html",
    "timestamp": "2025-05-14T06:30:03Z"
  },
  {
    "title": "Biden Failed to Recognize Clooney at Fundraiser: Book",
    "description": "Another bombshell is out from the upcoming book about Joe Biden by two reporters: They say the then-president attended a Hollywood fundraiser in June 2024 and didn't recognize George Clooney, a co-host of the event, despite the fact that he and the actor are …",
    "link": "https://www.newser.com/story/368662/biden-failed-to-recognize-clooney-at-fundraiser-book.html",
    "timestamp": "2025-05-14T06:30:00Z"
  },
  {
    "title": "Indonesia, France prepare for President Macron's Jakarta visit",
    "description": "Indonesian Cabinet Secretary Teddy Indra Wijaya hosted French Ambassador to Indonesia Fabien Penone at his office on Tuesday (May 13) to coordinate French ...",
    "link": "https://en.antaranews.com/news/355037/indonesia-france-prepare-for-president-macrons-jakarta-visit",
    "timestamp": "2025-05-14T06:27:24Z"
  },
  {
    "title": "Trump envoy reveals NATO troop deployment plans for Ukraine",
    "description": "NATO troops could be deployed west of the Dnieper River after a potential conflict settlement, Keith Kellogg has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617483-nato-europe-troops-ukraine/",
    "timestamp": "2025-05-14T06:27:16Z"
  },
  {
    "title": "Brazil's Lula Tells Putin: 'Go to Istanbul and Negotiate, Dammit'",
    "description": "Russia and Brazil are economic partners through the BRICS group.",
    "link": "https://www.newsweek.com/brazil-lula-putin-zelensky-istanbul-talks-2071914",
    "timestamp": "2025-05-14T06:26:47Z"
  },
  {
    "title": "‘How do you sleep at night?’: Trump’s unscripted question to Saudi Crown Prince raises eyebrows — Here's the context",
    "description": "During a Saudi Arabia visit, former U.S. President Donald Trump surprised attendees by asking Crown Prince Mohammed bin Salman how he sleeps at night, later clarifying it as praise for MBS's resilience and transformation of Saudi Arabia. Trump lauded the king…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-do-you-sleep-at-night-trumps-unscripted-question-to-saudi-crown-prince-raises-eyebrows-heres-the-context/articleshow/121155634.cms",
    "timestamp": "2025-05-14T06:26:16Z"
  },
  {
    "title": "AMERICA PRAYER VIGIL (5/14, 2025) *PRAYER*",
    "description": "Join with fellow FREEPERS to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Agri-Business; End to Sex Slavery; Healthcare, Education, Churches, and the Media.Forum threads labeled [Prayer] are closed to debate of any kind.",
    "link": "https://freerepublic.com/focus/f-religion/4316875/posts",
    "timestamp": "2025-05-14T06:25:45Z"
  },
  {
    "title": "Zelensky insists he will be waiting for Vladimir Putin in Ankara on Thursday for talks",
    "description": "Ukrainian President Volodymyr Zelensky said he will be waiting for his Russian counterpart, Vladimir Putin, in the Turkish capital this week to conduct face-to-face talks about the more than 3-year war, amid heavy pressure from the US and European leaders to …",
    "link": "https://www.independent.ie/world-news/zelensky-insists-he-will-be-waiting-for-vladimir-putin-in-ankara-on-thursday-for-talks/a642068006.html",
    "timestamp": "2025-05-14T06:22:55Z"
  },
  {
    "title": "Trump-era tariffs linked to plastic rise, UK firms at risk",
    "description": "UK businesses are being urged to review packaging strategies as global supply chain shifts, driven in part by US tariffs, boost plastic use.",
    "link": "https://www.packaging-gateway.com/news/trump-era-tariffs-linked-to-plastic-rise-uk-firms-at-risk/",
    "timestamp": "2025-05-14T06:22:06Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Wednesday",
    "description": "Greens urge review of gun laws for members of 'extremist' AfD, Union calls for end of 'firewall' against the Left Party, long waits for financial aid put care recipients in dire straits, and more news from Germany on Wednesday.",
    "link": "https://www.thelocal.de/20250514/today-in-germany-a-roundup-of-the-latest-news-on-wednesday-70",
    "timestamp": "2025-05-14T06:20:56Z"
  },
  {
    "title": "How Qatar Bought America (The Free Press)",
    "description": "The Free Press:\nHow Qatar Bought America  —  The tiny Gulf nation has spent almost $100 billion to establish its influence in Congress, universities, newsrooms, think tanks, and corporations.  What does it want in return?  —  On Wednesday, Donald Trump will t…",
    "link": "https://www.memeorandum.com/250514/p5",
    "timestamp": "2025-05-14T06:20:02Z"
  },
  {
    "title": "China, US slash sweeping tariffs in trade war climbdown",
    "description": "The United States and China slashed sweeping tariffs on each others' goods for 90 days on Wednesday, after a temporary ceasefire in a brutal trade war that roiled global markets and international supply chains.",
    "link": "https://www.hurriyetdailynews.com/china-us-slash-sweeping-tariffs-in-trade-war-climbdown-209160",
    "timestamp": "2025-05-14T06:16:45Z"
  },
  {
    "title": "British banking analyst sentenced to a decade in Saudi prison, apparently over a tweet",
    "description": "DUBAI, United Arab Emirates (AP) — A British Bank of America analyst has been sentenced to a decade in a Saudi Arabian prison apparently over a since-deleted social media post, according to his lawyer. The family of Ahmed al-Doush believes the charges against…",
    "link": "https://financialpost.com/pmn/british-banking-analyst-sentenced-to-a-decade-in-saudi-prison-apparently-over-a-tweet",
    "timestamp": "2025-05-14T06:16:31Z"
  },
  {
    "title": "Stephen Colbert Says Trump’s Saudi Arabia Trip Means ‘I Got Another Birthday President’ | Video",
    "description": "\"The Late Show\" host celebrates his birthday\nThe post Stephen Colbert Says Trump’s Saudi Arabia Trip Means ‘I Got Another Birthday President’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/stephen-colbert-birthday-trump-saudi-arabia-trip-monologue-pope/",
    "timestamp": "2025-05-14T06:07:25Z"
  },
  {
    "title": "Robert De Niro attends Cannes 2025 with 35 years younger girlfriend Tiffany Chen",
    "description": "Cannes 2025: Robert De Niro attended the 78th edition of the prestigious film festival with his girlfriend Tiffany Chen. The actor, 81, and Chen, 45, have been together since 2015.De Niro was awarded an honorary Palme D’Or by Leonardo Di Caprio at the Cannes …",
    "link": "https://economictimes.indiatimes.com/news/entertainment/robert-de-niro-attends-cannes-2025-with-35-years-younger-girlfriend-tiffany-chen/articleshow/121155099.cms",
    "timestamp": "2025-05-14T06:07:24Z"
  },
  {
    "title": "Israel kills 51 Palestinians in Gaza as countries reject new aid plan",
    "description": "Israeli forces have killed 51 Palestinians in recent attacks on the Gaza Strip, including women and children, the Palestinian news agency WAFA said Wednesday, as most U.N. Security Council members expressed their rejection Tuesday of Israel's reported aid del…",
    "link": "https://www.hurriyetdailynews.com/israel-kills-51-palestinians-in-gaza-as-countries-reject-new-aid-plan-209159",
    "timestamp": "2025-05-14T06:03:48Z"
  },
  {
    "title": "NATO hatches deal on higher spending to keep Trump happy",
    "description": "NATO foreign ministers meeting in Antalya from Wednesday will look to forge a compromise deal on ramping up defence spending as allies scramble to satisfy US President Donald Trump’s demand to agree to five percent of GDP at a summit next month. The two-day g…",
    "link": "https://www.digitaljournal.com/world/nato-hatches-deal-on-higher-spending-to-keep-trump-happy/article",
    "timestamp": "2025-05-14T06:03:16Z"
  },
  {
    "title": "CDC disbands advisory committee responsible for controlling infections in hospitals",
    "description": "The CDC has dissolved the Healthcare Infection Control Practices Advisory Committee (HICPAC), which shaped infection control guidelines for hospitals, raising concerns about weakened defenses against emerging pathogens. Healthcare professionals warn the move …",
    "link": "https://www.naturalnews.com/2025-05-14-cdc-disbands-committee-responsible-infection-control-hospitals.html",
    "timestamp": "2025-05-14T06:00:00Z"
  },
  {
    "title": "Land of the Free? Fewer Americans Agree",
    "description": "Americans' satisfaction with their freedom has fallen since 2021, especially among women, placing the U.S. below the global median.",
    "link": "https://news.gallup.com/poll/660440/land-free-fewer-americans-agree.aspx",
    "timestamp": "2025-05-14T06:00:00Z"
  },
  {
    "title": "Trump lifts Syria sanctions in major policy shift, paving way for reconstruction",
    "description": "President Trump announced the lifting of all U.S. sanctions on Syria to revive its economy and normalize relations after years of isolation, a move influenced by Saudi Arabia and Turkey. Trump framed the decision as a chance for Syria to rebuild, calling it “…",
    "link": "https://www.naturalnews.com/2025-05-14-trump-lifts-syria-sanctions-policy-shift-reconstruction.html",
    "timestamp": "2025-05-14T06:00:00Z"
  },
  {
    "title": "American manufacturing surges as Carrier pledges $1 billion investment, joining Apple and Toyota in reshoring wave",
    "description": "Carrier Global Corporation announces a $1 billion investment in U.S. manufacturing, creating 4,000 high-skilled jobs and expanding facilities for heat pumps, battery systems, and data center cooling. The investment includes Carrier’s TechVantage initiative, w…",
    "link": "https://www.naturalnews.com/2025-05-14-manufacturing-carrier-investment-jobs-reshoring.html",
    "timestamp": "2025-05-14T06:00:00Z"
  },
  {
    "title": "A new dawn for Syria: Trump lifts sanctions, brokers historic peace with Israel in bold Middle East reset",
    "description": "For over a decade, Syria has been a battleground of war, sanctions, and geopolitical chess—until now. In a stunning reversal of U.S. policy, President Donald J. Trump has announced the lifting of crippling sanctions on Syria, offering Damascus a “fresh start”…",
    "link": "https://www.naturalnews.com/2025-05-14-trump-lifts-sanctions-brokers-historic-peace-with-israel.html",
    "timestamp": "2025-05-14T06:00:00Z"
  },
  {
    "title": "Trump administration cuts debt growth by 92% in early fiscal overhaul",
    "description": "Trump’s administration reduced the annual growth of publicly held debt by 92% compared to Biden’s final months, with debt increasing just $37.2 billion from January 20 to May 5 vs. $478.4 billion in 2024. DOGE, led by Elon Musk, achieved $150 billion in savin…",
    "link": "https://www.naturalnews.com/2025-05-14-trump-administration-cuts-debt-growth-92-percent.html",
    "timestamp": "2025-05-14T06:00:00Z"
  },
  {
    "title": "Trump secures historic $600 billion Saudi investment, expects 2 million U.S. jobs",
    "description": "President Trump secured a historic $600 billion investment deal with Saudi Arabia, the largest-ever Saudi commitment to the U.S. economy, expected to create up to two million American jobs. The agreement spans defense, energy, technology, and infrastructure, …",
    "link": "https://www.naturalnews.com/2025-05-14-trump-secures-saudi-investment-jobs.html",
    "timestamp": "2025-05-14T06:00:00Z"
  },
  {
    "title": "U.S. warns of missile threats that it says can be stopped by 'Golden Dome'",
    "description": "China may within a decade possess scores of orbiting missiles with nuclear payloads capable of quickly reaching the U.S., the Defense Intelligence Agency has said.",
    "link": "https://www.japantimes.co.jp/news/2025/05/14/world/us-missile-threats-golden-dome/",
    "timestamp": "2025-05-14T05:59:00Z"
  },
  {
    "title": "Senators Urge Treasury to Rethink Tax on Unrealized Crypto Gains",
    "description": "The Senators said the tax rule would leave U.S. firms at a disadvantage to foreign competitors and urged Treasury to “act swiftly.”",
    "link": "https://decrypt.co/319622/senators-urge-treasury-rethink-tax-unrealized-crypto-gains",
    "timestamp": "2025-05-14T05:58:07Z"
  },
  {
    "title": "Cruise unleashes 'Mission: Impossible' juggernaut at Cannes",
    "description": "CANNES (FRANCE) &mdash; Tom Cruise's \" Mission: Impossible - The Final Reckoning \" powers into the Cannes film festival for its premiere on Wednesday on a steamroller of hype.",
    "link": "https://www.bangkokpost.com/life/arts-and-entertainment/3025422/cruise-unleashes-mission-impossible-juggernaut-at-cannes",
    "timestamp": "2025-05-14T05:56:00Z"
  },
  {
    "title": "Convinced India, Pak to restore peace: President Trump parrots claim 5th time",
    "description": "Indian government sources in New Delhi have been maintaining that the Director Generals of Military Operations (DGMOs) of India and Pakistan reached an understanding to stop all firings and military actions on land, air and sea, with immediate effect. They sa…",
    "link": "https://www.thehindubusinessline.com/news/convinced-india-pak-to-restore-peace-president-trump-parrots-claim-5th-time/article69574143.ece",
    "timestamp": "2025-05-14T05:52:18Z"
  },
  {
    "title": "What did India and Pakistan gain – and lose – in their military standoff?",
    "description": "As the archrivals halt hostilities after four days of fighting, analysts discuss if either gained an upper hand.",
    "link": "https://www.aljazeera.com/news/2025/5/14/what-did-india-and-pakistan-gain-and-lose-in-their-military-standoff",
    "timestamp": "2025-05-14T05:51:25Z"
  },
  {
    "title": "US aid freeze leaves TB survivors in India high and dry",
    "description": "Funding freeze leaves India’s frontline health activists jobless — and millions at risk.",
    "link": "https://www.thehindubusinessline.com/news/us-aid-freeze-leaves-tb-survivors-in-india-high-and-dry/article69573986.ece",
    "timestamp": "2025-05-14T05:50:44Z"
  },
  {
    "title": "NATO is sketching out a plan to meet Trump's call for 5% of GDP on defense",
    "description": "Negotiators are making progress ahead of a NATO summit in The Hague in June on a path to hitting the spending goal by 2032.",
    "link": "https://www.japantimes.co.jp/news/2025/05/14/world/politics/nato-plan-trump-5-gdp-defense/",
    "timestamp": "2025-05-14T05:50:00Z"
  },
  {
    "title": "NATO is sketching out a plan to meet Trump's call for 5% of GDP on defense",
    "description": "Negotiators are making progress ahead of a NATO summit in The Hague in June on a path to hitting the spending goal by 2032.",
    "link": "https://www.japantimes.co.jp/news/2025/05/14/world/politics/nato-plan-trump-gdp-defense-spending/",
    "timestamp": "2025-05-14T05:50:00Z"
  },
  {
    "title": "\"Boeing 747 Is Being Given To US Air Force, Not To Me\": Trump On Qatar Jet",
    "description": "President Donald Trump said a luxury jet being offered by the government of Qatar would be used as a temporary Air Force One, indicating an intention to accept a gift that has sparked ethical and security concerns in Washington.",
    "link": "https://www.ndtv.com/world-news/donald-trump-on-qatar-jet-boeing-747-is-being-given-to-us-air-force-not-to-me-8409707",
    "timestamp": "2025-05-14T05:47:22Z"
  },
  {
    "title": "Labor Department Admits Hundreds of Thousands of Biden Jobs Were Fake",
    "description": "",
    "link": "https://townhall.com/columnists/ej-antoni/2025/05/12/labor-department-admits-hundreds-of-thousands-of-biden-jobs-were-fake-n2656813",
    "timestamp": "2025-05-14T05:47:01Z"
  },
  {
    "title": "NATO Hatches Deal On Higher Spending To Keep Trump Happy",
    "description": "NATO foreign ministers meeting in Antalya from Wednesday will look to forge a compromise deal on ramping up defence spending as allies scramble to satisfy US President Donald Trump's demand to agree to five percent of GDP at a summit next month.",
    "link": "https://www.ibtimes.com/nato-hatches-deal-higher-spending-keep-trump-happy-3773464",
    "timestamp": "2025-05-14T05:42:21Z"
  },
  {
    "title": "Trump’s policy shift, lower yields, and dollar weakness could revive emerging markets: Anurag Singh",
    "description": "Ansid Capital's Anurag Singh suggests emerging markets, particularly China and India, could benefit from a potential drop in US 10-year yields. He believes that if yields fall below 4%, money will flow from the US into emerging markets. Singh also expresses s…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/trumps-policy-shift-lower-yields-and-dollar-weakness-could-revive-emerging-markets-anurag-singh/articleshow/121154526.cms",
    "timestamp": "2025-05-14T05:41:53Z"
  },
  {
    "title": "Tesla To Start Importing Chinese Components For Cybercab Production In USA",
    "description": "The truce announced on Monday saw the U.S. and China agree to roll back the bulk of tariffs and other countermeasures.",
    "link": "https://www.ndtv.com/auto/tesla-to-start-importing-chinese-components-for-semi-cybercab-production-in-usa-8409473",
    "timestamp": "2025-05-14T05:40:56Z"
  },
  {
    "title": "Tariff tensions ease, giving Fed and markets breathing space",
    "description": "A de-escalation in the U.S.-China trade war and softer-than-expected inflation data have brought relief to markets. The recent deal between the two nations has reduced the most severe tariffs imposed since early April. Alongside this, new inflation data sugge…",
    "link": "https://m.economictimes.com/markets/stocks/news/tariff-tensions-ease-giving-fed-and-markets-breathing-space/key-developments/slideshow/121154780.cms",
    "timestamp": "2025-05-14T05:40:27Z"
  },
  {
    "title": "Mr. President, don't forget your greatest ally: Israel!",
    "description": "To put it briefly, Israelis need to know that they’re not being left behind. American Christians who love Israel need to hear that their president still walks with them in solidarity. Conservatives need to know that “America First” never meant “Israel Last.” …",
    "link": "https://www.israelnationalnews.com/news/408328",
    "timestamp": "2025-05-14T05:39:23Z"
  },
  {
    "title": "State Department approves sale of $1.4B worth of helicopters, F-16 parts to UAE ahead of Trump's visit",
    "description": "The State Department said it approved a potential sale of more than $1.4 billion in helicopters and F-16 parts to the UAE ahead of President Donald Trump’s visit to the country.",
    "link": "https://www.foxnews.com/world/state-department-approves-sale-1-4b-worth-helicopters-f-16-parts-uae-ahead-trumps-visit",
    "timestamp": "2025-05-14T05:38:43Z"
  },
  {
    "title": "\"Yes, brave Sir Donald turned about / And gallantly, he chickened out / Bravely taking to his feet / He beat a very brave retreat / Bravest of the brave, Sir Donald\" [Fail]",
    "description": "\"Yes, brave Sir Donald turned about / And gallantly, he chickened out / Bravely taking to his feet / He beat a very brave retreat / Bravest of the brave, Sir Donald\"",
    "link": "https://www.fark.com/comments/13669032/Yes-brave-Sir-Donald-turned-about-And-gallantly-he-chickened-out-Bravely-taking-to-his-feet-He-beat-a-very-brave-retreat-Bravest-of-brave-Sir-Donald",
    "timestamp": "2025-05-14T05:33:29Z"
  },
  {
    "title": "Zelensky urges Trump to make Putin meeting happen in Istanbul",
    "description": "Ukraine's President Volodymyr Zelensky on Tuesday urged U.S. counterpart Donald Trump to help secure a meeting with Vladimir Putin in Türkiye on Thursday, while accusing the Russian leader of not seriously wanting to end the war.",
    "link": "https://www.hurriyetdailynews.com/zelensky-urges-trump-to-make-putin-meeting-happen-in-istanbul-209158",
    "timestamp": "2025-05-14T05:30:47Z"
  },
  {
    "title": "Fortress, Kimmeridge Open Abu Dhabi Outposts to Hunt for Deals",
    "description": "Fortress Investment Group and energy-focused private equity firm Kimmeridge are opening Abu Dhabi offices, aiming to make deals and boost assets by leaning on their ties to sovereign wealth fund Mubadala Investment Co.",
    "link": "https://financialpost.com/pmn/business-pmn/fortress-kimmeridge-open-abu-dhabi-outposts-to-hunt-for-deals",
    "timestamp": "2025-05-14T05:30:47Z"
  },
  {
    "title": "Cruise Unleashes 'Mission: Impossible' Juggernaut At Cannes",
    "description": "Tom Cruise's \"Mission: Impossible - The Final Reckoning\" powers into the Cannes film festival for its premiere on Wednesday on a steamroller of hype.",
    "link": "https://www.ibtimes.com/cruise-unleashes-mission-impossible-juggernaut-cannes-3773463",
    "timestamp": "2025-05-14T05:30:22Z"
  },
  {
    "title": "Pete Rose’s Hall of Fame hopes resurrected after death as MLB ban scrapped",
    "description": "Pete Rose, MLB’s all-time hits leader banned for gambling, has had his lifetime suspension lifted posthumously, making him eligible for the Baseball Hall of Fame. The decision has sparked outrage from critics who say it undermines the sport’s integrity and se…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/pete-roses-hall-of-fame-hopes-resurrected-after-death-as-mlb-ban-scrapped/articleshow/121154269.cms",
    "timestamp": "2025-05-14T05:29:23Z"
  },
  {
    "title": "Trump to meet Syrian president in Saudi Arabia before heading to Qatar",
    "description": "US president makes surprise announcement the US would lift all sanctions on the Syrian government",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/14/donald-trump-gulf-region-tour-saudi-arabia/",
    "timestamp": "2025-05-14T05:28:12Z"
  },
  {
    "title": "White South Africans refugees arrive as refugees in the US, but do they really need protection?",
    "description": "While US President Trump seeks to limit immigration, he made an exception for white South Africans. According to observers, they are not persecuted and there is no threat of land theft either. Why are they welcome?",
    "link": "https://www.dw.com/en/white-south-africans-refugees-arrive-as-refugees-in-the-us-but-do-they-really-need-protection/a-72533041",
    "timestamp": "2025-05-14T05:27:00Z"
  },
  {
    "title": "'Ameriki papa ne war rukwa di kya': Congress takes swipe at govt over Trump's remarks",
    "description": "After Donald Trump claimed he brokered the recent India-Pakistan ceasefire using trade incentives, Congress questioned whether Prime Minister Modi and Foreign Minister Jaishankar compromised India’s security under U.S. pressure. Congress leaders criticized Tr…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/ameriki-papa-ne-war-rukwa-di-kya-congress-takes-swipe-at-govt-over-trumps-remarks/articleshow/121154217.cms",
    "timestamp": "2025-05-14T05:25:04Z"
  },
  {
    "title": "Missile from Yemen intercepted over Israel, sirens sound across Jerusalem region",
    "description": "Houthi missile intercepted intercepted by Arrow and THAAD systems, minor injuries were reported as civilians rushed to shelters.",
    "link": "https://www.israelnationalnews.com/news/408327",
    "timestamp": "2025-05-14T05:22:41Z"
  },
  {
    "title": "Ukraine’s Sergei Loznitsa on Cannes Competitor ‘Two Prosecutors’ and Budding Trump-Putin Alliance: Totalitarian Threat ‘Looming on the Horizon’",
    "description": "Ukrainian director Sergei Loznitsa returns to the Cannes Film Festival with the gripping Soviet period drama “Two Prosecutors,” marking the first time in nearly a decade that the celebrated filmmaker will compete for the Palme d’Or. The film world premieres i…",
    "link": "https://variety.com/2025/film/global/sergei-loznitsa-cannes-two-prosecutors-trump-putin-1236395458/",
    "timestamp": "2025-05-14T05:20:00Z"
  },
  {
    "title": "Tesla to resume shipping Chinese parts for Cybercab, Semi production in the US, source says",
    "description": "Following a tariff truce between the U.S. and China, Tesla plans to ship components from China to the U.S. for Cybercab and Semi truck production, starting this month. This move reverses a previous suspension caused by increased U.S. tariffs, potentially disr…",
    "link": "https://economictimes.indiatimes.com/news/international/business/tesla-to-resume-shipping-chinese-parts-for-cybercab-semi-production-in-the-us-source-says/articleshow/121154016.cms",
    "timestamp": "2025-05-14T05:17:05Z"
  },
  {
    "title": "For Trump and Saudi Arabia, securing an Iran nuclear deal comes before Gaza",
    "description": "While Israel and its long war in Gaza have become a burden in the U.S. president's eyes, Saudi Arabia is a strategic asset that promises the U.S. president economic and diplomatic gains",
    "link": "https://www.haaretz.com/middle-east-news/2025-05-14/ty-article/.premium/for-trump-and-saudi-arabia-securing-an-iran-nuclear-deal-comes-before-gaza/00000196-c9a2-df59-abde-ebaaad6a0000",
    "timestamp": "2025-05-14T05:17:00Z"
  },
  {
    "title": "Syria says US lifting of sanctions 'pivotal turning point'",
    "description": "Syria on Tuesday welcomed U.S. President Donald Trump's decision to lift sanctions the country, calling it a \"pivotal turning point\", as celebrations broke out in Damascus.",
    "link": "https://www.hurriyetdailynews.com/syria-says-us-lifting-of-sanctions-pivotal-turning-point-209156",
    "timestamp": "2025-05-14T05:16:01Z"
  },
  {
    "title": "U.S. egg prices fall for the first time in months but remain near record highs",
    "description": "The average price for a dozen Grade A eggs declined to $5.12 last month after reaching a record $6.23 in March. It was the first month-to-month drop in egg prices since October 2024.",
    "link": "https://www.npr.org/2025/05/14/nx-s1-5397827/egg-prices-drop-inflation-bird-flu",
    "timestamp": "2025-05-14T05:14:26Z"
  },
  {
    "title": "Business Today: Tax cuts at risk amid tariff fallout, pharmaceuticals warning and can you afford to get sick?",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/05/14/tax-cuts-at-risk-amid-tariff-fallout/",
    "timestamp": "2025-05-14T05:13:25Z"
  },
  {
    "title": "What to know about possible Russia-Ukraine peace talks in Turkey",
    "description": "The talks took place in the warring capitals of Moscow and Kyiv, from Washington and Riyadh, Saudi Arabia, to countries across Europe",
    "link": "https://abcnews.go.com/International/wireStory/russia-ukraine-peace-talks-turkey-121782063",
    "timestamp": "2025-05-14T05:10:20Z"
  },
  {
    "title": "Iran to hold nuclear talks with UK, France, Germany in Istanbul",
    "description": "Iran will hold nuclear talks with the U.K., France and Germany, collectively known as the E3, in Istanbul, Türkiye on May 16, a report said Tuesday.",
    "link": "https://www.hurriyetdailynews.com/iran-to-hold-nuclear-talks-with-uk-france-germany-in-istanbul-209155",
    "timestamp": "2025-05-14T05:08:04Z"
  },
  {
    "title": "Trump continues to defend Qatar gifting US $400M jet: 'We should have the most impressive plane'",
    "description": "President Trump continued to defend his decision to accept a $400 million luxury Boeing jet from Qatar to temporarily use as Air Force One. \"Why wouldn't I accept the gift?\" he asked.",
    "link": "https://www.foxnews.com/politics/trump-continues-defend-qatar-gifting-us-400m-jet-we-should-have-most-impressive-plane",
    "timestamp": "2025-05-14T05:07:57Z"
  },
  {
    "title": "House works into the night as Republicans push ahead on Trump's big bill",
    "description": "Tax breaks tallying more than $5 trillion",
    "link": "https://abcnews.go.com/Politics/wireStory/house-works-night-republicans-push-ahead-trumps-big-121762434",
    "timestamp": "2025-05-14T05:02:19Z"
  },
  {
    "title": "Trump’s “love attack” on Riyadh, the slap on Israel and the 600 billion dollars",
    "description": "The US President's announcement that the US supports the plan for a new Syria confirmed the deepening rift with Netanyahu - The praise for bin Salman and the stern warning to Iran\nThe post Trump’s “love attack” on Riyadh, the slap on Israel and the 600 billio…",
    "link": "https://en.protothema.gr/2025/05/14/trumps-love-attack-on-riyadh-the-slap-on-israel-and-the-600-billion-dollars/",
    "timestamp": "2025-05-14T05:02:00Z"
  },
  {
    "title": "Pakistani reporter accuses PM Modi of blocking peace deal, US official avoids reply",
    "description": "During a press briefing, a US official skillfully sidestepped a Pakistani reporter's attempt to implicate Prime Minister Modi in hindering peace talks with India. The US State Department emphasised its focus on maintaining the ceasefire between the two nation…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/pakistani-reporter-accuses-pm-modi-of-blocking-peace-deal-us-official-avoids-reply/articleshow/121153644.cms",
    "timestamp": "2025-05-14T05:01:07Z"
  },
  {
    "title": "Deaf President Now!: Documentary sheds light on ‘forgotten’ history of deaf civil rights movement",
    "description": "Thirty-seven years after protests at Gallaudet University, an innovative new film thrusts hearing audiences into the deaf experience",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/deaf-president-now-movie-apple-tv-b2750793.html",
    "timestamp": "2025-05-14T05:00:35Z"
  },
  {
    "title": "Military axis of Russia, China and North Korea will test what the West stands for",
    "description": "Issue of migration – especially economic migration disguised as asylum-seeking – is a growing issue for the political viability of the EU",
    "link": "https://www.irishtimes.com/opinion/2025/05/14/military-axis-of-russia-china-and-north-korea-will-test-what-the-west-stands-for/",
    "timestamp": "2025-05-14T05:00:01Z"
  },
  {
    "title": "White South Africans Enter the U.S. as Refugees",
    "description": "As Trump welcomes the first batch of refugees to the U.S., rights groups are pushing back.",
    "link": "http://foreignpolicy.com/2025/05/14/white-south-africans-us-refugees-trump/",
    "timestamp": "2025-05-14T05:00:01Z"
  },
  {
    "title": "Convinced them to have peace and make trade deals: Trump on US role in India-Pak understanding",
    "description": "In a Fox News interview, Donald Trump claimed to have brokered peace between India and Pakistan, advocating for trade deals over nuclear weapons. He asserted his administration's role in halting a potential nuclear conflict.",
    "link": "https://economictimes.indiatimes.com/news/india/convinced-them-to-have-peace-and-make-trade-deals-trump-on-us-role-in-india-pak-understanding/articleshow/121153632.cms",
    "timestamp": "2025-05-14T04:57:10Z"
  },
  {
    "title": "What is the ‘glass cliff’ phenomenon – and why do women often find themselves on the precipice?",
    "description": "Being on the cliff is a dangerous position: there is a high chance of falling – or being pushed off.",
    "link": "https://theconversation.com/what-is-the-glass-cliff-phenomenon-and-why-do-women-often-find-themselves-on-the-precipice-256072",
    "timestamp": "2025-05-14T04:56:48Z"
  },
  {
    "title": "Brazil's Lula says to push Putin to negotiate with Zelensky in Istanbul",
    "description": "Brazil's president said Wednesday he will press Vladimir Putin in person to attend negotiations with Ukraine's Volodymyr Zelensky in Turkey, adding to calls on the Russian leader to enter talks and end Moscow's invasion. The Kremlin has not yet specified whet…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/brazils-lula-says-to-push-putin-to-negotiate-with-zelensky-in-istanbul/articleshow/121153605.cms",
    "timestamp": "2025-05-14T04:55:48Z"
  },
  {
    "title": "China Surrounded Xi’s Aide With Seasoned Experts to Seal US Deal - Bloomberg",
    "description": "China Surrounded Xi’s Aide With Seasoned Experts to Seal US DealBloomberg What the U.S.-China Tariff Rollback Means for the American EconomyWSJ Dow soars around 1,000 points higher after Trump team and China dramatically lower tariffsCNN Fact Sheet: President…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177495985",
    "timestamp": "2025-05-14T04:54:44Z"
  },
  {
    "title": "Virginia GOP embraced a diverse ticket in this year's elections. Then things got complicated",
    "description": "In a party that laments diversity, equity and inclusion programs, Virginia Republicans have put forth one of the most diverse statewide tickets in their history",
    "link": "https://abcnews.go.com/Politics/wireStory/virginia-gop-embraced-diverse-ticket-years-elections-things-121782434",
    "timestamp": "2025-05-14T04:54:29Z"
  },
  {
    "title": "A still-unfolding diplomatic road seeking peace in Ukraine has had many twists and turns",
    "description": "Last weekend saw a flurry of diplomatic activity surrounding the war in Ukraine",
    "link": "https://abcnews.go.com/International/wireStory/unfolding-diplomatic-road-seeking-peace-ukraine-twists-turns-121782250",
    "timestamp": "2025-05-14T04:54:27Z"
  },
  {
    "title": "Crude oil futures decline as industry data shows rise in US inventories",
    "description": "Crude oil futures drop as US inventories rise; market awaits official data, while commodities like aluminium, guargum, and turmeric fluctuate.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-decline-as-industry-data-shows-rise-in-us-inventories/article69574001.ece",
    "timestamp": "2025-05-14T04:54:03Z"
  },
  {
    "title": "Robert De Niro attacks ‘philistine president’ Trump at Cannes Film Festival for targeting art",
    "description": "‘We can’t just sit back and watch. We have to act, and we have to act now – not with violence, but with great passion and determination,’ said the actor",
    "link": "https://www.the-independent.com/life-style/robert-de-niro-cannes-donald-trump-art-b2750542.html",
    "timestamp": "2025-05-14T04:52:49Z"
  },
  {
    "title": "'Daily Show' Roasts Trump Over This 'A**hole' Move On Middle East Trip",
    "description": "Jordan Klepper spotted exactly why the president regretted not taking a \"caffeine shot\" while visiting Saudi Arabia.",
    "link": "https://www.huffpost.com/entry/daily-show-jordan-klepper-trump-falling-asleep-saudi-arabia_n_6823e7d5e4b023f4744ea4c6",
    "timestamp": "2025-05-14T04:49:53Z"
  },
  {
    "title": "Why Khamenei Is Betting on Trump",
    "description": "The calculus behind Iran’s stunning reversal on a new nuclear deal.",
    "link": "http://foreignpolicy.com/2025/05/14/khamenei-trump-nuclear-deal-iran-reversal/",
    "timestamp": "2025-05-14T04:48:03Z"
  },
  {
    "title": "NATO Is Sketching Out Plan to Meet Trump Call for 5% of GDP on Defense",
    "description": "NATO allies have started cobbling together an agreement to significantly boost defense spending in a way that may assuage US President Donald Trump’s demand to spend 5% of economic output on the military.",
    "link": "https://financialpost.com/pmn/business-pmn/nato-is-sketching-out-plan-to-meet-trump-call-for-5-of-gdp-on-defense",
    "timestamp": "2025-05-14T04:45:06Z"
  },
  {
    "title": "Buck Sexton Tells Megyn Kelly What Surprise He Thinks Would Have Happened If Biden Refused To Debate Trump",
    "description": "Buck Sexton told Megyn Kelly he believes Biden would have gotten through to Election Day if his campaign had refused to debate President Donald Trump.",
    "link": "https://dailycaller.com/2025/05/14/buck-sexton-tells-megyn-kelly-what-surprise-he-thinks-would-have-happened-if-biden-refused-to-debate-trump/",
    "timestamp": "2025-05-14T04:43:37Z"
  },
  {
    "title": "3 Myths About Tariffs",
    "description": "Last month, President Donald Trump proudly announced, \"Liberation Day!…The day American industry was reborn!\" \nReborn because of his tariffs, which he called, \"the most beautiful word in the dictionary.\" \nThis is just wrong. \nThe first time he was president, …",
    "link": "https://biztoc.com/x/fb6ef4cae14224e2",
    "timestamp": "2025-05-14T04:41:29Z"
  },
  {
    "title": "Trump expected to meet Syrian leader after announcing he will lift sanctions",
    "description": "The US president has agreed to \"say hello\" to Syria's interim leader during his tour of the Middle East, the White House says.",
    "link": "https://www.bbc.com/news/articles/cdr506d0l2po?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-14T04:40:20Z"
  },
  {
    "title": "Trump to overhaul AI chip curbs reviled by Nvidia and US allies",
    "description": "Trump administration revamps semiconductor export regulations, replacing Biden-era approach, drawing objections from US allies and tech companies.",
    "link": "https://www.bloomberg.com/news/articles/2025-05-13/trump-to-rewrite-ai-chip-curbs-reviled-by-nvidia-and-us-allies",
    "timestamp": "2025-05-14T04:39:16Z"
  },
  {
    "title": "\"Can't Put A Price On Creativity, But Can Tariff It\": De Niro Slams Trump",
    "description": "Hollywood icon Robert De Niro lambasted &quot;philistine&quot; U.S. President Donald Trump on Tuesday and his proposed film tariff at the Cannes Film Festival&#039;s opening ceremony, where he used his lifetime achievement award speech to call for protests.",
    "link": "https://www.ndtv.com/world-news/robert-de-niro-slams-donald-trump-cant-put-a-price-on-creativity-but-can-tariff-it-8407583",
    "timestamp": "2025-05-14T04:30:31Z"
  },
  {
    "title": "A pregnant Cuban emigre worries about her baby's citizenship as Supreme Court weighs a Trump order",
    "description": "Two babies born to immigrant mothers at the same time in the same American hospital",
    "link": "https://abcnews.go.com/Politics/wireStory/pregnant-cuban-emigre-worries-babys-citizenship-supreme-court-121781592",
    "timestamp": "2025-05-14T04:29:01Z"
  },
  {
    "title": "‘Rusty’ Biden napped during debate prep while advisers hoped he’d be ‘game-day performer’: book",
    "description": "resident Joe Biden struggled in practice debates ahead of his disastrous showing against Donald Trump last year — leaving his advisers with little option but to cross their fingers and hope he would be a “game-day performer,” a new book about the collapse of …",
    "link": "https://freerepublic.com/focus/f-chat/4316867/posts",
    "timestamp": "2025-05-14T04:24:57Z"
  },
  {
    "title": "How India and Pakistan pulled back from the brink with US-brokered ceasefire",
    "description": "The international intervention anchored by Rubio paved the way to a cessation of hostilities formalized in a mid-afternoon phone call between the Directors General of Military Operations (DGMO) of India and Pakistan. The two spoke again on Monday",
    "link": "https://www.thehindubusinessline.com/news/how-india-and-pakistan-pulled-back-from-the-brink-with-us-brokered-ceasefire/article69573931.ece",
    "timestamp": "2025-05-14T04:23:31Z"
  },
  {
    "title": "Robert De Niro slams Donald Trump's foreign movie tariffs at Cannes, says 'art is a threat to the autocrats'",
    "description": "The Cannes Film Festival commenced with glamour. However, Robert De Niro's strong words against Donald Trump grabbed attention. He criticized Trump's proposed tariffs on foreign films. De Niro called it an attack on artistic freedom.",
    "link": "https://economictimes.indiatimes.com/magazines/panache/robert-de-niro-slams-donald-trumps-foreign-movie-tariffs-at-cannes-says-art-is-a-threat-to-the-autocrats/articleshow/121152770.cms",
    "timestamp": "2025-05-14T04:22:24Z"
  },
  {
    "title": "Persian Gulf 'has been, is and will remain' unchanged: Army official",
    "description": "Deputy Chief of the Iranian Army for Coordination Rear Admiral Habibollah Sayyari has stressed that the Persian Gulf \"has been, is, and will remain\" unchanged in the future.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250513-irna01.htm",
    "timestamp": "2025-05-14T04:17:19Z"
  },
  {
    "title": "Palantir CEO Alex Karp praises Saudi engineers and takes a swipe at Europe, saying it has 'given up' on AI",
    "description": "Palantir CEO Alex Karp praises Saudi engineers at Riyadh forum and criticizes Europe's slow adoption of AI.",
    "link": "https://www.businessinsider.com/palantir-ceo-takes-swipe-at-europe-given-up-on-ai-2025-5",
    "timestamp": "2025-05-14T04:17:01Z"
  },
  {
    "title": "Removing Syria Sanctions is a Win for the People, Whatever Trump’s Motives",
    "description": "Ann Arbor (Informed Comment) - Syrians are rejoicing at the announcement on Tuesday by President Donald J. Trump that he will lift U.S. economic sanctions on Syria, at the advice of Saudi Crown Prince Mohammad Bin Salman and Turkish President Tayyip Erdogan, …",
    "link": "https://www.juancole.com/2025/05/removing-sanctions-whatever.html",
    "timestamp": "2025-05-14T04:15:16Z"
  },
  {
    "title": "Newark problems and recent crashes put focus on air traffic controller shortage and aging equipment",
    "description": "The recent chronic delays and cancellations at New Jersey’s largest airport have highlighted the shortage of air traffic controllers and the aging equipment they use, which President Donald Trump's administration wants to replace",
    "link": "https://abcnews.go.com/Business/wireStory/newark-problems-recent-crashes-put-focus-air-traffic-121782054",
    "timestamp": "2025-05-14T04:14:32Z"
  },
  {
    "title": "Syria's president is still a listed terrorist and Trump wants to meet him. Here's why",
    "description": "Syrian President Ahmed al-Sharaa remains a listed terrorist according to the US government, but Donald Trump is determined to restore \"normal relations\" with the Syrian government.",
    "link": "https://www.abc.net.au/news/2025-05-14/united-states-sanctions-on-syria-lifted/105289658",
    "timestamp": "2025-05-14T04:14:03Z"
  },
  {
    "title": "Canadians 'weren't impressed' by second UK state visit for Trump, Mark Carney tells Sky News",
    "description": "Canadians \"weren't impressed\" by the decision of the UK government to offer Donald Trump an unprecedented second state visit to the UK, the country's prime minister has told Sky News",
    "link": "https://news.sky.com/story/canadians-werent-impressed-by-second-uk-state-visit-for-trump-mark-carney-says-13367469",
    "timestamp": "2025-05-14T04:14:00Z"
  },
  {
    "title": "Trump expected to meet Syrian leader after announcing he will lift sanctions",
    "description": "The US president has agreed to \"say hello\" to Syria's interim leader during his tour of the Middle East, the White House says.",
    "link": "https://www.bbc.com/news/articles/cdr506d0l2po",
    "timestamp": "2025-05-14T04:10:53Z"
  }
]