[
  {
    "title": "Veterans Demand Congress Pull Troops from American Cities",
    "description": "Troops do not belong on our streets.\nThat’s what more than 40 of my brothers and sisters in arms will tell Congress today. The ACLU, Common Defense, and the Chamberlain Network join these veterans on Capitol Hill, where they’re urging all our elected represen…",
    "link": "https://www.aclu.org/news/national-security/veterans-demand-congress-pull-troops-from-american-cities",
    "timestamp": "2025-11-18T21:25:26Z"
  },
  {
    "title": "'Things happen' - Trump defends Saudi crown prince over Khashoggi killing",
    "description": "The US president's claims that the crown prince \"knew nothing\" contradict the CIA's own assessment.",
    "link": "https://www.bbc.com/news/articles/cn0gdkwp2p9o",
    "timestamp": "2025-11-18T21:24:57Z"
  },
  {
    "title": "‘This Is It’: Kara Swisher Makes Bold Prediction Epstein Files End Trump’s Presidency Early",
    "description": "\"There's a photo like what happened to [Prince] Andrew, I think it's game over, and then we have President f*cking JD Vance.\"\nThe post ‘This Is It’: Kara Swisher Makes Bold Prediction Epstein Files End Trump’s Presidency Early first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/this-is-it-kara-swisher-makes-bold-prediction-epstein-files-end-trumps-presidency-early/",
    "timestamp": "2025-11-18T21:23:00Z"
  },
  {
    "title": "Sharp disagreements over economy threaten Federal Reserve interest rate cut",
    "description": "What was once seen as a near-certain cut in interest rates next month now looks more like a coin flip as Federal Reserve officials sharply disagree over the ...",
    "link": "https://finance.yahoo.com/news/sharp-disagreements-over-economy-threaten-212217466.html",
    "timestamp": "2025-11-18T21:22:17Z"
  },
  {
    "title": "Thomas Massie a Little ‘Suspicious’ of Trump Reversal on Epstein Files",
    "description": "Republican U.S. Congressman Thomas Massie of Kentucky said he is a \"little bit suspicious\" of President Donald Trump after his reversal in stance on releasing files connected to sex offender Jeffrey Epstein. ... \"Well, he got tired of us winning,\" Massie resp…",
    "link": "https://freerepublic.com/focus/f-chat/4353253/posts",
    "timestamp": "2025-11-18T21:22:03Z"
  },
  {
    "title": "Nicki Minaj Speaks At United Nations Panel, Praises Donald Trump For Slamming ‘Extremism’ Toward Christians In Nigeria",
    "description": "The rapper made an unexpected appearance at the United Nations Headquarters on Tuesday, Nov. 18, calling attention to “extremism” toward Christians in Nigeria.\nThe post Nicki Minaj Speaks At United Nations Panel, Praises Donald Trump For Slamming ‘Extremism’ …",
    "link": "https://bossip.com/4067323/nicki-minaj-united-nations-speech/",
    "timestamp": "2025-11-18T21:21:25Z"
  },
  {
    "title": "Bidding begins at $10 million. How much will this solid gold toilet sell for?",
    "description": "Owned by an unnamed collector, it's one of two such toilets that Cattelan created in 2016.",
    "link": "https://www.the-independent.com/arts-entertainment/art/gold-toilet-art-maurizio-cattelan-sotheby-b2867747.html",
    "timestamp": "2025-11-18T21:20:37Z"
  },
  {
    "title": "'Whistleblower' who provided House Democrats with Ghislaine Maxwell documents speaks out",
    "description": "A “whistleblower” who came forward to House Democrats alleging convicted sex offender Ghislaine Maxwell received preferential treatment at a federal prison camp in Texas says she was not motivated by politics",
    "link": "https://www.nbcnews.com/news/us-news/whistleblower-provided-house-democrats-ghislaine-maxwell-documents-spe-rcna244418",
    "timestamp": "2025-11-18T21:20:36Z"
  },
  {
    "title": "House Votes To Release Trump Files We Mean Epstein Files",
    "description": "In which the coverup moves on to a new phase.",
    "link": "https://www.wonkette.com/p/house-votes-to-release-trump-files",
    "timestamp": "2025-11-18T21:20:24Z"
  },
  {
    "title": "Portugal boss Martínez shares honest take on Cristiano Ronaldo’s White House visit ahead of 2026 World Cup",
    "description": "With Cristiano Ronaldo attending to the White House on Tuesday with the 2026 World Cup on the horizon, Portugal head coach Roberto Martínez shared his honest opinion on the star's visit.\n Cristiano Ronaldo is expected to visit the White House on Tuesday, Nove…",
    "link": "https://worldsoccertalk.com/news/portugal-boss-martinez-shares-honest-take-on-cristiano-ronaldos-white-house-visit-ahead-of-2026-world-cup/",
    "timestamp": "2025-11-18T21:19:34Z"
  },
  {
    "title": "Trump and his lapdogs are pushing a thinly-veiled lie — but Democrats can exploit it",
    "description": "Donald Trump claimed last week on social media that “Our economy is BOOMING, and Costs are coming way down,” and that “grocery prices are way down.Rubbish.How do I know he’s lying? Official government statistics haven’t been issued during the shutdown — presu…",
    "link": "https://www.rawstory.com/trump-economy-2674305160/",
    "timestamp": "2025-11-18T21:19:17Z"
  },
  {
    "title": "Palestinians in Gaza reject UN Security Council approval of Trump’s plan: It’s a ‘new occupation’",
    "description": "On Monday, the UN Security Council voted to endorse the Trump administration’s “International Stabilization Force” in Gaza. Palestinians in Gaza say it is just a new face of the same Israeli occupation.",
    "link": "https://mondoweiss.net/2025/11/palestinians-in-gaza-reject-un-security-council-approval-of-trumps-plan-its-a-new-occupation/",
    "timestamp": "2025-11-18T21:17:39Z"
  },
  {
    "title": "Red State GOP Gives Trump the Middle Finger on Gerrymandering",
    "description": "Indiana’s Senate has decided not to meet until January, signaling that redistricting will not be on the state’s legislative agenda this year.The decision is in direct defiance of an order issued earlier this year by Donald Trump, who met privately with Indian…",
    "link": "https://newrepublic.com/post/203367/donald-trump-indiana-gerrymandering-special-session",
    "timestamp": "2025-11-18T21:17:32Z"
  },
  {
    "title": "Trump Admin To Turn On Three Mile Island Reactor (Not That One)",
    "description": "DOE announced Tuesday that it will grant Constellation Energy around $1 billion to help restart one of the reactors at Three Mile Island in Pennsylvania.",
    "link": "https://dailycaller.com/2025/11/18/trump-admin-three-mile-island-nuclear-department-of-energy-doe/",
    "timestamp": "2025-11-18T21:17:29Z"
  },
  {
    "title": "MS NOW BREAKS IT: Why Trump pulled a 180 on releasing Epstein files",
    "description": "President Donald Trump reversed course Sunday night and told House Republicans to vote for releasing the Jeffrey Epstein files ...",
    "link": "https://biztoc.com/x/09232871b2aeffc1",
    "timestamp": "2025-11-18T21:16:11Z"
  },
  {
    "title": "Marjorie Taylor Greene says Epstein files has 'ripped MAGA apart'",
    "description": "Rep. Marjorie Taylor Greene (R-GA), the once staunch ally of President Donald Trump who has since fallen out with the president, ...",
    "link": "https://biztoc.com/x/e86f053a1a957c00",
    "timestamp": "2025-11-18T21:16:09Z"
  },
  {
    "title": "Exclusive: Crypto exchange Kraken raises $200 million from Ken Griffin’s Citadel to notch $20 billion valuation",
    "description": "Once skittish about digital assets, Citadel has warmed towards the crypto business in 2025.",
    "link": "https://fortune.com/2025/11/18/kraken-citadel-securities-ken-griffin-800-million-fundraise/",
    "timestamp": "2025-11-18T21:16:04Z"
  },
  {
    "title": "Trump administration backs Three Mile Island nuclear restart with $1 billion loan to Constellation",
    "description": "The first advance to Constellation Energy is expected in the first quarter, said Greg Beard, senior advisor to the Energy Department's Loan Programs Office.",
    "link": "https://www.cnbc.com/2025/11/18/trump-nuclear-three-mile-island-crane-loan-constellation-ceg.html",
    "timestamp": "2025-11-18T21:15:30Z"
  },
  {
    "title": "Trump Attacks Another Female Reporter After 'Piggy' Rant (Farrah Tomazin/The Daily Beast)",
    "description": "Farrah Tomazin / The Daily Beast:\nTrump Attacks Another Female Reporter After ‘Piggy’ Rant  —  HISSY FIT  —  The president lashed out at the ABC reporter over questions about the Epstein files and his family businesses.  —  Donald Trump has launched a furious…",
    "link": "https://www.memeorandum.com/251118/p109",
    "timestamp": "2025-11-18T21:15:00Z"
  },
  {
    "title": "This Is the Best Joke About Trump and 'Bubba' from Late Night",
    "description": "From the rich text of Jeffrey Epstein’s thousands of emails, there was one detail that really popped out",
    "link": "https://www.cracked.com/article_49180_this-is-the-best-joke-about-trump-and-bubba-from-late-night.html",
    "timestamp": "2025-11-18T21:15:00Z"
  },
  {
    "title": "'Get it done!' Trump orders rush on $2K handouts in attack on 'rip off' health companies - NewsBreak",
    "description": "President Donald Trump issued a demand Tuesday that Congress quickly approve his proposal to send checks directly to Americans as an alternative to extendi",
    "link": "https://www.newsbreak.com/share/4354121893654-get-it-done-trump-orders-rush-on-2k-handouts-in-attack-on-rip-off-health-companies?s=a2&amp;share_destination_id=MjY2NjIyMjQxLTE3NjM1MDAwNjE1NDE%3D&amp;pd=0I2icjxb&amp;hl=en_US&amp;send_time=1763500061&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.46.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-11-18T21:12:17Z"
  },
  {
    "title": "Mike Johnson’s Gamble on Releasing Epstein Files Blows Up in His Face",
    "description": "If House Speaker Mike Johnson thought his buddy Senate Majority Leader John Thune would help hold up a measure to release the government’s files on Jeffrey Epstein, he was sorely mistaken.The House voted 427-1 in favor of the Epstein Files Transparency Act (H…",
    "link": "https://newrepublic.com/post/203365/mike-johnson-epstein-files-senate-blows-up",
    "timestamp": "2025-11-18T21:10:25Z"
  },
  {
    "title": "Late-night host hits back at Trump's call for his firing, says it 'doesn't make me special'",
    "description": "Seth Meyers responded to President Donald Trump's weekend attack calling for his firing, joking that being criticized by the president \"doesn't make me special\" during Monday's show.",
    "link": "https://www.foxnews.com/media/late-night-host-hits-back-trumps-call-his-firing-says-doesnt-make-me-special",
    "timestamp": "2025-11-18T21:09:51Z"
  },
  {
    "title": "WATCH LIVE: Senate meets after House passes bill to force release of the Epstein files",
    "description": "President Donald Trump has bowed to the growing momentum behind the bill and even said he will sign it if it also passes the Senate.",
    "link": "https://biztoc.com/x/8be2175ff84467e0",
    "timestamp": "2025-11-18T21:09:45Z"
  },
  {
    "title": "US court blocks new Texas congressional map while state officials appeal",
    "description": "The majority on a federal court in El Paso, Texas, found that the new map used race to redraw congressional districts.",
    "link": "https://www.aljazeera.com/news/2025/11/18/us-court-blocks-new-texas-congressional-map-while-state-officials-appeal",
    "timestamp": "2025-11-18T21:09:20Z"
  },
  {
    "title": "White House government shutdown clock kept ticking, days after impasse ended",
    "description": "White House government shutdown clock kept ticking, days after impasse endedgo.com",
    "link": "https://abcnews.go.com/US/white-house-government-shutdown-clock-ticking-days-after/story?id=127637264",
    "timestamp": "2025-11-18T21:08:32Z"
  },
  {
    "title": "Only US Lawmaker at COP30 Tells Nations to Stand Up to Trump",
    "description": "Senator Sheldon Whitehouse, the only representative of the US federal government showing up at this year’s United Nations climate summit, has a simple message for the almost 200 countries gathered in Brazil: When you’re facing President Donald Trump’s ire, do…",
    "link": "https://financialpost.com/pmn/business-pmn/only-us-lawmaker-at-cop30-tells-nations-to-stand-up-to-trump",
    "timestamp": "2025-11-18T21:07:58Z"
  },
  {
    "title": "Trump Pushing for Healthcare Reform Bigger than Congress 'Has the Appetite For'",
    "description": "White House deputy chief of staff James Blair said Tuesday that President Donald Trump would love to push for healthcare reform \"bigger\" than Congress has the appetite for, signaling they may soon put forward a healthcare bill.\nThe post Trump Pushing for Heal…",
    "link": "https://www.breitbart.com/politics/2025/11/18/trump-pushing-for-health-care-reform-bigger-than-congress-has-appetite-for/",
    "timestamp": "2025-11-18T21:07:25Z"
  },
  {
    "title": "Trump says Saudi Arabia to get F-35 jets under arrangement similar to Israel",
    "description": "WASHINGTON: US President Donald Trump said on Tuesday (Nov 18) that the United States would sell advanced F-35 stealth fight",
    "link": "https://www.channelnewsasia.com/world/trump-says-saudi-arabia-get-f-35-jets-under-arrangement-similar-israel-5475726",
    "timestamp": "2025-11-18T21:07:01Z"
  },
  {
    "title": "Trump-Backed Congressional Maps in Texas Struck Down as Racial Gerrymander",
    "description": "The Trump administration “explicitly directed the Legislature to redistrict on race,” the court recognized.",
    "link": "https://truthout.org/articles/trump-backed-congressional-maps-in-texas-struck-down-as-racial-gerrymander/",
    "timestamp": "2025-11-18T21:06:54Z"
  },
  {
    "title": "Seth Meyers Claps Back After Trump Slams Him Again Over the Same Late-Night Episode",
    "description": "Seth Meyers knows he is currently sitting in President Donald Trump‘s crosshairs. The late-night host talked about being on his “s–t list” during his Monday night (November 17) episode. Keep reading to find out more… Trump shared a post about Seth over the we…",
    "link": "https://www.justjared.com/2025/11/18/seth-meyers-claps-back-after-trump-slams-him-again-over-the-same-late-night-episode/",
    "timestamp": "2025-11-18T21:06:45Z"
  },
  {
    "title": "Trump Meets Business Partner In the Oval Office",
    "description": "Donald Trump has never been particularly critical of the Saudis, despite a human rights record that has brought harsh condemnations from his predecessors. Unlike previous presidents and even many in his own party, Trump has generally struck a conciliatory, or…",
    "link": "https://www.motherjones.com/politics/2025/11/trump-meets-business-partner-in-the-oval-office/",
    "timestamp": "2025-11-18T21:05:28Z"
  },
  {
    "title": "‘Bombshell’: Democrat lawfare insider says Obama team refused to allow prosecution of Hillary Clinton",
    "description": "It was the DOJ that prevented counts over her 'gross negligence' in email scandal",
    "link": "https://www.wnd.com/2025/11/bombshell-democrat-lawfare-insider-says-obama-team-refused/",
    "timestamp": "2025-11-18T21:05:00Z"
  },
  {
    "title": "WATCH LIVE: Senate meets after House passes bill to force release of the Epstein files",
    "description": "President Donald Trump has bowed to the growing momentum behind the bill and even said he will sign it if it also passes the Senate.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-meets-after-house-passes-bill-to-force-release-of-the-epstein-files",
    "timestamp": "2025-11-18T21:03:10Z"
  },
  {
    "title": "Is Israel encouraging Palestinians to leave Gaza via 'voluntary emigration?'",
    "description": "The organization Al-Majd Europe says it's helping Palestinians emigrate to third countries. But it has been accused of helping facilitate \"forcible transfer\" from Gaza. DW spoke to a representative of the organization.",
    "link": "https://www.dw.com/en/is-israel-encouraging-palestinians-to-leave-gaza-via-voluntary-emigration/a-74795234",
    "timestamp": "2025-11-18T21:03:00Z"
  },
  {
    "title": "WATCH: Trump says he has nothing to do with family business in Saudi Arabia",
    "description": "During a meeting with Saudi Crown Prince Mohammed bin Salman, President Donald Trump denied any involvement in his family's business dealings in Saudi Arabia.",
    "link": "https://abcnews.go.com/Politics/video/trump-family-business-saudi-arabia-127645872",
    "timestamp": "2025-11-18T21:02:32Z"
  },
  {
    "title": "Rep. Eric Swalwell Mocks House Speaker With Blunt Trump Reference",
    "description": "Speaker Mike Johnson's sudden decision to support a House vote on releasing the Jeffrey Epstein files didn't go unnoticed by at least one of his colleagues.",
    "link": "https://www.huffpost.com/entry/eric-swalwell-mocks-mike-johnson-epstein-files-vote_n_691cbd3ee4b073def3ee8611",
    "timestamp": "2025-11-18T21:02:05Z"
  },
  {
    "title": "The 3 layers of the Jeffrey Epstein scandal",
    "description": "Anticipation is rising for the potential release of the “Epstein files.”  The House of Representatives overwhelmingly voted to approve the release of Justice Department case files related to the accused sex trafficker Tuesday, something even President Donald …",
    "link": "https://www.vox.com/politics/469394/jeffrey-epstein-files-scandal-explained-trump-giuffre",
    "timestamp": "2025-11-18T21:01:43Z"
  },
  {
    "title": "House Overwhelmingly Votes to Release Epstein Files",
    "description": "Only one person voted no.\nThe post House Overwhelmingly Votes to Release Epstein Files first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/house-overwhelmingly-votes-to-release-epstein-files/",
    "timestamp": "2025-11-18T21:00:14Z"
  },
  {
    "title": "EXCLUSIVE: The One Reason Donald Trump is Set for 'Total Defeat' in His $5Billion 'Defamation' Case Over Capitol Riot Speech Edit",
    "description": "Donald Trump is suing the BBC for billions, but his case may crash and burn for this reason.",
    "link": "https://radaronline.com/p/trump-total-defeat-defamation-case-bbc-edit/",
    "timestamp": "2025-11-18T21:00:00Z"
  },
  {
    "title": "Mexico rejects Trump’s offer of military strikes against cartels — again",
    "description": "'It’s not going to happen,' Mexico’s President Claudia Sheinbaum said.",
    "link": "https://www.denverpost.com/2025/11/18/mexico-us-cartel-strikes/",
    "timestamp": "2025-11-18T20:59:32Z"
  },
  {
    "title": "Mexico rejects Trump’s offer of military strikes against cartels — again",
    "description": "'It’s not going to happen,' Mexico’s President Claudia Sheinbaum said.",
    "link": "https://www.bostonherald.com/2025/11/18/mexico-us-cartel-strikes/",
    "timestamp": "2025-11-18T20:59:32Z"
  },
  {
    "title": "Trump-Appointed Judge Blocks Trump’s Texas Gerrymander",
    "description": "In a bombshell decision on Tuesday, a federal court in Texas blocked a new congressional map that was created after President Donald Trump demanded that the state redraw district lines to hand Republicans five new seats. “Substantial evidence shows that Texas…",
    "link": "https://www.motherjones.com/politics/2025/11/texas-gerrymander-blocked/",
    "timestamp": "2025-11-18T20:58:54Z"
  },
  {
    "title": "US House passes bill demanding release of Jeffrey Epstein files with 427-1 vote, Trump reverses stance",
    "description": "The US House of Representatives has voted overwhelmingly to make public all records from the Jeffrey Epstein investigation. This move follows a significant shift in President Donald Trump's stance. The House Oversight Committee received new documents, adding …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-house-passes-bill-demanding-release-of-jeffrey-epstein-files-with-427-1-vote-trump-reverses-stance/articleshow/125421378.cms",
    "timestamp": "2025-11-18T20:58:39Z"
  },
  {
    "title": "Here’s the Epstein bill’s possible path in the Senate | CNN Politics",
    "description": "Months after it was first introduced, a bill directing the Department of Justice to publicly release all its Jeffrey Epstein-related files passed the House on Tuesday.",
    "link": "https://www.cnn.com/2025/11/18/politics/what-happens-next-epstein-bill",
    "timestamp": "2025-11-18T20:58:25Z"
  },
  {
    "title": "'Principled no!' GOP rep defiant after becoming lone vote against releasing Epstein files",
    "description": "The House voted on an overwhelming bipartisan basis to compel the release of the Jeffrey Epstein sex trafficking case files — and in the end, even most heavily pro-Trump lawmakers backed the bill, as President Donald Trump, who spent months trying to keep a l…",
    "link": "https://www.rawstory.com/clay-higgins-2674306759/",
    "timestamp": "2025-11-18T20:57:51Z"
  },
  {
    "title": "Cristiano Ronaldo to visit White House on same day as Saudi crown prince",
    "description": "The Portuguese player is being paid handsomely to be part of the gulf state's modernisation plan.",
    "link": "https://www.bbc.com/news/articles/c993e74pxd7o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-11-18T20:57:38Z"
  },
  {
    "title": "Cristiano Ronaldo to visit White House on same day as Saudi crown prince",
    "description": "The Portuguese player is being paid handsomely to be part of the gulf state's modernisation plan.",
    "link": "https://www.bbc.com/news/articles/c993e74pxd7o",
    "timestamp": "2025-11-18T20:57:34Z"
  },
  {
    "title": "Trump threatens ABC News in Oval Office meltdown",
    "description": "An infuriated Donald Trump threatened a US network’s broadcast license Tuesday after its reporter asked questions about his family’s business and the Jeffrey Epstein scandal at a high-profile White House event. ABC News reporter Mary Bruce posed the questions…",
    "link": "https://www.digitaljournal.com/world/trump-threatens-abc-news-in-oval-office-meltdown/article",
    "timestamp": "2025-11-18T20:57:20Z"
  },
  {
    "title": "Trump threatens ABC News in Oval Office meltdown",
    "description": "An infuriated Donald Trump threatened a US network’s broadcast license Tuesday after its reporter asked questions about his family’s business and the Jeffrey Epstein scandal at a high-profile White House event. ABC News reporter Mary Bruce posed the questions…",
    "link": "https://www.digitaljournal.com/life/trump-threatens-abc-news-in-oval-office-meltdown/article",
    "timestamp": "2025-11-18T20:57:20Z"
  },
  {
    "title": "US House of Representatives votes to release Epstein files after Trump U-turn",
    "description": "The Republican-controlled US House of Representatives voted almost unanimously today to force the release of justice department files on the late convicted sex offender Jeffrey Epstein, an outcome US president Donald Trump had fought for months before ending …",
    "link": "https://www.independent.ie/world-news/north-america/us-house-of-representatives-votes-to-release-epstein-files-after-trump-u-turn/a611076404.html",
    "timestamp": "2025-11-18T20:57:19Z"
  },
  {
    "title": "Gustav Klimt painting sells for $236M US, smashing modern art record",
    "description": "A Gustav Klimt painting that helped save the life of its Jewish subject during the Holocaust sold Tuesday for $236.4 million US —a record for a modern art piece, and for Sotheby's auction house.",
    "link": "https://www.cbc.ca/news/world/cattelan-america-toilet-klimt-painting-sothebys-auction-9.6983561",
    "timestamp": "2025-11-18T20:57:13Z"
  },
  {
    "title": "A solid gold toilet called 'America' and reportedly worth millions, is up for auction",
    "description": "Art collectors have a chance Tuesday to buy one of the world's most lucrative latrines: a solid gold, fully functional toilet. The piece, by provocative Italian artist Maurizio Cattelan, goes up for auction Tuesday evening at Sotheby's in New York.",
    "link": "https://www.cbc.ca/news/world/maurizio-cattelan-america-toilet-sculpture-auction-9.6983561",
    "timestamp": "2025-11-18T20:57:13Z"
  },
  {
    "title": "War in Venezuela, Brought to You By the Same People Who Lied Us Into Iraq",
    "description": "Washington is making big claims to make the case for U.S. intervention. We’ve heard all these arguments before.\nThe post War in Venezuela, Brought to You By the Same People Who Lied Us Into Iraq appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/11/18/venezuela-iraq-war-new-york-times/",
    "timestamp": "2025-11-18T20:57:10Z"
  },
  {
    "title": "Trump’s Justice Department may have accidentally handed Democrats five House seats",
    "description": "In a decision that could potentially reshape the 2026 midterm elections and cement the Democratic Party’s future control of the US House, a federal court just struck down the gerrymandered Texas maps that President Donald Trump pressured that state to enact. …",
    "link": "https://www.vox.com/politics/469426/texas-gerrymander-struck-down-race-supreme-court",
    "timestamp": "2025-11-18T20:55:55Z"
  },
  {
    "title": "Immigration operations to ramp up in New York City, Trump's border czar says",
    "description": "WASHINGTON (Reuters) -White House border czar Tom Homan said on Tuesday he plans to ramp up federal immigration enforcement efforts in New York City, a month after U.S. Immigration and Customs Enforcement agents carried out a high-profile raid targeting Manha…",
    "link": "https://www.thestar.com.my/news/world/2025/11/19/immigration-operations-to-ramp-up-in-new-york-city-trump039s-border-czar-says",
    "timestamp": "2025-11-18T20:55:00Z"
  },
  {
    "title": "Country Music Star Performs For Trump At Mar-A-Lago, Sending Internet Into A Frenzy",
    "description": "Keith Urban performed Chappell Roan's \"Pink Pony Club\" at a Mar-a-Lago party Saturday attended by President Donald Trump and the internet is ablaze.",
    "link": "https://dailycaller.com/2025/11/18/keith-urban-performs-chappell-roan-lgbt-anthem-mar-a-lago-trump/",
    "timestamp": "2025-11-18T20:54:59Z"
  },
  {
    "title": "Trump Asked About Slain Columnist Jamal Khashoggi in Conference with Saudi Crown Prince: 'Things Happen'",
    "description": "President Donald Trump said \"things happen\" during a bilateral press conference with Saudi Crown Prince Mohammed bin Salman when asked about the 2018 killing of Washington Post columnist Jamal Khashoggi.\nThe post Trump Asked About Slain Columnist Jamal Khasho…",
    "link": "https://www.breitbart.com/politics/2025/11/18/trump-asked-about-slain-columnist-jamal-khashoggi-in-conference-with-saudi-crown-prince-things-happen/",
    "timestamp": "2025-11-18T20:54:53Z"
  },
  {
    "title": "Pope Leo says Trump administration 'extremely disrespectful' to migrants",
    "description": "ROME (Reuters) -Pope Leo renewed his criticism of U.S. President Donald Trump's hard-line anti-immigration policies on Tuesday, saying foreigners living in the United States were being treated by the administration in a manner that was \"extremely disrespectfu…",
    "link": "https://www.thestar.com.my/news/world/2025/11/19/pope-leo-says-trump-administration-039extremely-disrespectful039-to-migrants",
    "timestamp": "2025-11-18T20:54:00Z"
  },
  {
    "title": "Federal Judges Rule Congressional District Lines Drawn by Texas Republicans are Discriminatory",
    "description": "A three-judge panel in El Paso today blocked a redistricting map demanded by President Trump and supported by Texas Republicans, ruling it unconstitutional because it discriminates along racial lines.Adrian Shelley, Texas director of Public Citizen, issued th…",
    "link": "https://www.commondreams.org/newswire/federal-judges-rule-congressional-district-lines-drawn-by-texas-republicans-are-discriminatory",
    "timestamp": "2025-11-18T20:52:47Z"
  },
  {
    "title": "Democrats Move to Block Trump’s “Wildly Disproportionate” Boat Strike Operation",
    "description": "The operation is “reminiscent of preparations for war,” lawmakers said.",
    "link": "https://truthout.org/articles/democrats-move-to-block-trumps-wildly-disproportionate-boat-strike-operation/",
    "timestamp": "2025-11-18T20:48:59Z"
  },
  {
    "title": "Did Trump call a reporter 'piggy' on Air Force One?",
    "description": "During a press gaggle on Air Force One, U.S. President Donald Trump said \"Quiet, piggy!\" to a reporter asking about the release of the Jeffrey Epstein files.",
    "link": "https://www.snopes.com//fact-check/trump-called-reporter-piggy/",
    "timestamp": "2025-11-18T20:48:00Z"
  },
  {
    "title": "Mike Johnson Was Pressed On Trump’s Attacks On MTG — And He Offered A Telling Response",
    "description": "The president and Greene’s once-solid relationship appeared to sour after she pushed for the release of the Epstein files.",
    "link": "https://www.huffpost.com/entry/mike-johnson-marjorie-taylor-greene-trump-attacks_n_691c9d3be4b0b8c5ce7351ad",
    "timestamp": "2025-11-18T20:47:40Z"
  },
  {
    "title": "Senate may pass Epstein bill Tuesday",
    "description": "Senate Majority Leader John Thune said he expects the Senate will pass the bill to release DOJ files on the late sex offender Jeffrey Epstein as soon as Tuesday, a move that would send it to President Donald Trump for his signature. \nThune told reporters the …",
    "link": "https://biztoc.com/x/52a0dc39b4b32576",
    "timestamp": "2025-11-18T20:47:24Z"
  },
  {
    "title": "Nicolle Wallace on Trump’s Epstein files reversal: ‘Following his party, not leading it’",
    "description": "After months of pushing for the Epstein files to remain sealed, Donald Trump reversed course this week and told House Republicans to vote in favor of releasing the documents. On Monday’s “Deadline: White House,” Nicolle Wallace argued that Trump’s switch-up s…",
    "link": "https://biztoc.com/x/1133b69a8be07aa5",
    "timestamp": "2025-11-18T20:47:12Z"
  },
  {
    "title": "Nicki Minaj Thanks Trump in U.N. Speech But Stresses She's Not Taking Sides",
    "description": "Nicki Minaj became the first female rapper to address the United Nations on Tuesday and gave credit where it was due ... to President Donald Trump for setting the stage!!! The occasion was a bipartisan one ... however, the 'Pinkprint' megastar took…\n Permalink",
    "link": "https://www.tmz.com/2025/11/18/nicki-minaj-thanks-donald-trump-united-nations-speech/",
    "timestamp": "2025-11-18T20:44:49Z"
  },
  {
    "title": "Trump’s BBC Lawsuit Seeks to Bully International Newsrooms Into Servility",
    "description": "MAGA’s vision of journalism isn’t even remotely compatible with democracy.",
    "link": "https://truthout.org/articles/trumps-bbc-lawsuit-seeks-to-bully-international-newsrooms-into-servility/",
    "timestamp": "2025-11-18T20:44:27Z"
  },
  {
    "title": "Trump Called A Reporter ‘Piggy’ — And The Backlash Is Intense",
    "description": "Trump Called A Reporter ‘Piggy’ — And The Backlash Is Intenselittlethings.com",
    "link": "https://littlethings.com/entertainment/trump-called-reporter-piggy",
    "timestamp": "2025-11-18T20:44:09Z"
  },
  {
    "title": "US judges halt Texas redistricting map, order return to 2021 districts",
    "description": "A US court blocked Texas’ new voting map after finding signs of racial gerrymandering. The ruling says Texas must return to its older map for the next election. This decision also affects other states making their own political maps. The case has become a maj…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-judges-halt-texas-redistricting-map-order-return-to-2021-districts/articleshow/125421292.cms",
    "timestamp": "2025-11-18T20:44:05Z"
  },
  {
    "title": "CPC Deputy Chair Omar Statement on Vote to Release Epstein Files",
    "description": "Congressional Progressive Caucus Deputy Chair Rep. Ilhan Omar (MN-05) issued the following statement after the House vote to release the Epstein Files. “Today, my Progressive Caucus colleagues and I unanimously voted to release the Epstein Files. The American…",
    "link": "https://www.commondreams.org/newswire/cpc-deputy-chair-omar-statement-on-vote-to-release-epstein-files",
    "timestamp": "2025-11-18T20:43:22Z"
  },
  {
    "title": "‘You’re a terrible person and a terrible reporter’: Watch Trump eviscerate ABC News White House correspondent",
    "description": "'Your crappy company is one of the perpetrators. I think the license should be taken away from ABC because your news is so fake and it's so wrong'",
    "link": "https://www.wnd.com/2025/11/youre-terrible-person-terrible-reporter-watch-trump-eviscerate/",
    "timestamp": "2025-11-18T20:43:05Z"
  },
  {
    "title": "The Irish Times view on the departure of Paschal Donohoe: Coalition loses one of its anchors",
    "description": "Minister has been central to economic and financial policy and has played an important political role",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/11/18/the-irish-times-view-on-the-departure-of-paschal-donohoe-coalition-loses-one-of-its-anchors/",
    "timestamp": "2025-11-18T20:43:00Z"
  },
  {
    "title": "Pardoned Capitol rioter tried to bribe child sex victim with promise of Jan. 6 payout, officials say",
    "description": "A man pardoned by President Donald Trump for storming the Capitol was arrested on child molestation charges, according to Florida officials, who said he tried to use an anticipated Jan. 6 payout to silence the victim.",
    "link": "https://www.nbcnews.com/news/us-news/pardoned-capitol-rioter-tried-bribe-child-sex-victim-promise-jan-6-pay-rcna244627",
    "timestamp": "2025-11-18T20:42:01Z"
  },
  {
    "title": "'Quiet, Piggy': Trump Blasts Reporter Over Question on Epstein Files",
    "description": "Lucey attempted to ask about Epstein’s email in which he alleged that Trump knew about his sex trafficking operation and knew the victims.",
    "link": "https://www.westernjournal.com/quiet-piggy-trump-blasts-reporter-question-epstein-files/",
    "timestamp": "2025-11-18T20:40:37Z"
  },
  {
    "title": "Democrats Explicitly Tell Spy Agencies, Military To Disobey Trump (IJR)",
    "description": "IJR:\nDemocrats Explicitly Tell Spy Agencies, Military To Disobey Trump  —  Democratic Michigan Sen. Elissa Slotkin posted a video to social media Tuesday morning in which she and five of her congressional colleagues called for the military and the intelligenc…",
    "link": "https://www.memeorandum.com/251118/p104",
    "timestamp": "2025-11-18T20:40:01Z"
  },
  {
    "title": "Saab offering 10,000 jobs, Joly says, as Canada's F-35 review drags on",
    "description": "Industry Minister Mélanie Joly pitted two giant defence companies against one another on Tuesday for the future of Canada's fighter fleet, saying the $27-billion contract to buy 88 U.S.-made F-35 jets doesn’t deliver enough jobs for workers in this country — …",
    "link": "https://www.cbc.ca/news/politics/saab-lockheed-martin-air-force-9.6983557",
    "timestamp": "2025-11-18T20:39:53Z"
  },
  {
    "title": "‘The F*ck Are They Doing?!’ Joe Rogan Goes Off On Trump’s DHS Using Guest Theo Von In Propaganda Clip",
    "description": "Joe Rogan went off on President Donald Trump's Department of Homeland Security over them using his friend and fellow comedian's video without permission.\nThe post ‘The F*ck Are They Doing?!’ Joe Rogan Goes Off On Trump’s DHS Using Guest Theo Von In Propaganda…",
    "link": "https://www.mediaite.com/media/podcasts/the-fck-are-they-doing-joe-rogan-goes-off-on-trumps-dhs-using-guest-theo-von-in-propaganda-clip/",
    "timestamp": "2025-11-18T20:39:09Z"
  },
  {
    "title": "Final resting place set for the historic SS United States to become an artificial reef off Florida",
    "description": "A historic ocean liner will become the world’s largest artificial reef after it’s sunk off Florida’s Gulf Coast early next year.Okaloosa County officials announced Tuesday that they expect to sink the SS United States in early 2026 about 22 nautical miles (41…",
    "link": "https://freerepublic.com/focus/f-news/4353247/posts",
    "timestamp": "2025-11-18T20:37:54Z"
  },
  {
    "title": "Gavin Newsom Roasts ‘Piggy’ Trump in Flurry of AI-Generated Memes After President Lashes Out at Female Journalist",
    "description": "Sharing a photo of the president and Jeffrey Epstein to his X account, the California governor simply wrote: \"Piggies\"\nThe post Gavin Newsom Roasts ‘Piggy’ Trump in Flurry of AI-Generated Memes After President Lashes Out at Female Journalist appeared first on…",
    "link": "https://www.thewrap.com/gavin-newsom-donald-trump-piggy-bloomberg-reporter/",
    "timestamp": "2025-11-18T20:37:38Z"
  },
  {
    "title": "Pope Leo XIV on Nigeria: ‘Christians and Muslims have been slaughtered’",
    "description": "Over 200 Christians were murdered by Islamist militants in Nigeria on June, 13, 2025. / Credit: Red Confidential/Shutterstock\n\nCastel Gandolfo, Italy, Nov 18, 2025 / 15:36 pm (CNA).\nBoth Christians and Muslims have been slaughtered in Nigeria, where there is …",
    "link": "https://www.catholicnewsagency.com/news/267903/pope-leo-xiv-on-nigeria-christians-and-muslims-have-been-slaughtered",
    "timestamp": "2025-11-18T20:36:00Z"
  },
  {
    "title": "Lopsided House vote on Epstein Files Transparency Act is the first step, not the last",
    "description": "The question wasn’t whether the Epstein Files Transparency Act would pass the House. After proponents secured 218 signatures last week on a discharge petition, and after Donald Trump gave Republican members the green light to support the measure, there were n…",
    "link": "https://biztoc.com/x/ef202aa5a772a420",
    "timestamp": "2025-11-18T20:35:46Z"
  },
  {
    "title": "US House votes to force release of Epstein files",
    "description": "The US House of Representatives has voted to make the Justice Department publish the remaining documents in the Epstein case Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627971-epstein-files-release-vote/",
    "timestamp": "2025-11-18T20:34:48Z"
  },
  {
    "title": "CNN Digs Up Ex-Fox News Star’s Past Attacks On Muslims And The UN Ahead of Confirmation Hearing",
    "description": "A report from CNN revealed that State Dept. spokesperson Tammy Bruce pushed \"anti-Muslim and conspiratorial claims\" on a blog in the wake of the9 /11 attacks.\nThe post CNN Digs Up Ex-Fox News Star’s Past Attacks On Muslims And The UN Ahead of Confirmation Hea…",
    "link": "https://www.mediaite.com/politics/cnn-digs-up-ex-fox-news-stars-past-attacks-on-muslims-and-the-un-ahead-of-confirmation-hearing/",
    "timestamp": "2025-11-18T20:33:35Z"
  },
  {
    "title": "Lydia Ko playing in LPGA tour championship for the first time as a Hall of Famer | D'Angelo",
    "description": "Lydia Ko was \"over the moon\" after winning Olympic gold medal in Paris, but it made earning a spot in LPGA Hall of Fame almost an afterthought.",
    "link": "https://www.palmbeachpost.com/story/sports/2025/11/18/lydia-ko-cme-tour-championship-lpga-hall-of-fame/87334314007/",
    "timestamp": "2025-11-18T20:32:05Z"
  },
  {
    "title": "Nicki Minaj Has Officially Gone MAGA",
    "description": "During a speech at the U.N. on Christian persecution in Nigeria, Nicki Minaj praised Donald Trump for his ‘leadership on the global stage.’",
    "link": "http://www.thecut.com/article/why-was-nicki-minaj-at-the-u-n-trump-maga-pivot-explained.html",
    "timestamp": "2025-11-18T20:31:17Z"
  },
  {
    "title": "Hillary Clinton Slams Trump's 'Personal Law Firm' DOJ, Says Explosive New Report Reveals A Crisis 'Worse Than Watergate'",
    "description": "Former Secretary of State Hillary Clinton escalated her criticism of President Donald Trump on Monday, pointing to a new report describing internal turmoil at the Justice Department that she says shows a level of political interference unparalleled in modern …",
    "link": "https://freerepublic.com/focus/f-chat/4353244/posts",
    "timestamp": "2025-11-18T20:31:15Z"
  },
  {
    "title": "Democrat Who ‘Colluded’ With Jeffrey Epstein To Face House Censure",
    "description": "A group of conservative lawmakers is introducing a resolution that would remove Democratic non-voting delegate Stacey Plaskett from the House Intelligence Committee, citing resurfaced messages she exchanged with the late convicted sex predator Jeffrey Epstein…",
    "link": "https://dailycaller.com/2025/11/18/stacey-plaskett-jeffrey-epstein-house-freedom-caucus-censure/",
    "timestamp": "2025-11-18T20:30:58Z"
  },
  {
    "title": "Court settlement calls for NPR to get $36M in government funds to operate US public radio system",
    "description": "National Public Radio will receive approximately $36 million in government funding to operate the nation’s public radio interconnection system under the terms of a court settlement",
    "link": "https://abcnews.go.com/Entertainment/wireStory/court-settlement-calls-npr-36m-government-funds-operate-127645443",
    "timestamp": "2025-11-18T20:29:46Z"
  },
  {
    "title": "Trump turns up heat on fellow Republicans in push to redraw congressional maps ahead of midterms",
    "description": "High-stakes redistricting battle unfolds as Trump pressures Indiana lawmakers to redraw congressional maps ahead of 2026 midterms for House control.",
    "link": "https://www.foxnews.com/politics/trump-turns-up-heat-fellow-republicans-push-redraw-congressional-maps-ahead-midterms",
    "timestamp": "2025-11-18T20:29:19Z"
  },
  {
    "title": "Trump Openly Supports Strikes Against Drug Cartels in Mexico and Colombia, Signaling a Larger Intervention in the Western Hemisphere (VIDEOS)",
    "description": "Trump is willing to do whatever is necessary to keep drugs from flowing into the US. Mexico and Colombia have been added to Trump’s naughty list. US President Donald J. Trump made statements yesterday (17) to the effect that he supports military strikes on ca…",
    "link": "https://freerepublic.com/focus/f-news/4353243/posts",
    "timestamp": "2025-11-18T20:28:30Z"
  },
  {
    "title": "Former Washington Post Editor Calls Trump’s Jamal Khashoggi Comments ‘A Disgrace’ | Exclusive",
    "description": "Martin Baron, who was the Post’s top editor when the columnist was killed in 2018, tells TheWrap: “Just when you think Trump has gone as low as possible, he goes still lower”\nThe post Former Washington Post Editor Calls Trump’s Jamal Khashoggi Comments ‘A Dis…",
    "link": "https://www.thewrap.com/exclusive-donald-trumps-jamal-khashoggi-comments-a-disgrace-says-former-washington-post-editor/",
    "timestamp": "2025-11-18T20:27:26Z"
  },
  {
    "title": "House Votes to Release Epstein Files in New Setback for Trump (Bloomberg)",
    "description": "Bloomberg:\nHouse Votes to Release Epstein Files in New Setback for Trump  —  Donald Trump's firm control of Washington showed signs of weakening Tuesday as nearly all House Republicans voted to compel the Justice Department to release its files on sex traffic…",
    "link": "https://www.memeorandum.com/251118/p96",
    "timestamp": "2025-11-18T20:25:00Z"
  },
  {
    "title": "Trump says he will sell F-35 jets to Saudi Arabia",
    "description": "What happened\nPresident Donald Trump Monday said the U.S. was going to sell stealth F-35 fighter jets to Saudi Arabia, one of several deals he plans to cement with Saudi Crown Prince Mohammed bin Salman at the White House this week. The de facto Saudi ruler i…",
    "link": "https://biztoc.com/x/82291c8634dc59dc",
    "timestamp": "2025-11-18T20:24:45Z"
  },
  {
    "title": "Mexico’s President Responds After Trump Says He’s 'OK' With Cartel Strikes",
    "description": "Mexico’s president on Tuesday flatly rejected the idea of allowing U.S. military strikes against drug cartels on Mexican soil, a day after President Donald Trump said he was “OK” with authorizing such operations to stop drugs from entering the United States.\n…",
    "link": "https://biztoc.com/x/b056abddd3543946",
    "timestamp": "2025-11-18T20:24:33Z"
  }
]