[
  {
    "title": "Netherlands will undertake huge security operation during Nato summit",
    "description": "Largest logistical operation ever mounted by the country during peacetime will have significant input from Germany, the UK, France, Italy and Spain",
    "link": "https://www.irishtimes.com/world/europe/2025/05/09/netherlands-will-undertake-huge-security-operation-during-nato-summit/",
    "timestamp": "2025-05-09T15:09:14Z"
  },
  {
    "title": "Watch: Trump misspeaks and calls toy firm Mattel a country",
    "description": "The US president says tariffs are \"the most misunderstood thing\" in business and threatens more action.",
    "link": "https://www.bbc.co.uk/news/videos/cn4q950zxgqo",
    "timestamp": "2025-05-09T15:08:05Z"
  },
  {
    "title": "The 2024 Sir Paul Curran award for academic journalism goes to Paul Whiteley",
    "description": "Professor Paul Whiteley, University of Essex, is the winner of the 2024 Sir Paul Curran award, which we recognised at a reception celebrating our authors’ work.",
    "link": "https://theconversation.com/the-2024-sir-paul-curran-award-for-academic-journalism-goes-to-paul-whiteley-256376",
    "timestamp": "2025-05-09T15:07:13Z"
  },
  {
    "title": "Trump says the rich 'probably' shouldn't get a tax hike, but he'd be 'OK' with it",
    "description": "Trump argued that if his party raised taxes on the wealthy, Democrats would use it against them.",
    "link": "https://www.businessinsider.com/donald-trump-tax-increase-wealthy-perot-2025-5",
    "timestamp": "2025-05-09T15:06:40Z"
  },
  {
    "title": "Bill Maher Is Bragging About Being the President’s Puppet",
    "description": "There's an idea that gets passed around a lot that you should be able to make friends with people with different political views. That's fair, and there have been times when good has come from it. However, it's important to...\nRead more...",
    "link": "https://www.pajiba.com/news/bill-maher-is-bragging-about-being-the-presidents-puppet.php",
    "timestamp": "2025-05-09T15:06:38Z"
  },
  {
    "title": "EXCLUSIVE: Steve Hilton Has A Message For Those Who Think It’s ‘Impossible’ To Save California",
    "description": "After over a decade of one-party rule, Republican gubernatorial candidate Steve Hilton told the DCNF why voters should fight to fix California — not flee it.",
    "link": "https://dailycaller.com/2025/05/09/exclusive-steve-hilton-message-california-republican-governor-candidate/",
    "timestamp": "2025-05-09T15:05:31Z"
  },
  {
    "title": "Trump signals he may lower tariffs on China",
    "description": "President Donald Trump has floated cutting tariffs on China from 145% to 80% ahead of a weekend meeting among top U.S. and Chinese trade officials as he looks to deescalate the trade war between the world's two largest economies.",
    "link": "https://www.pbs.org/newshour/economy/trump-signals-he-may-lower-tariffs-on-china",
    "timestamp": "2025-05-09T15:05:24Z"
  },
  {
    "title": "United CEO weighs in on Newark Airport chaos",
    "description": "Almost two weeks of chaos at Newark Liberty International Airport (EWR) has revealed a “broken system,” United Airlines (UAL) CEO Scott Kirby said in a Fox News op-ed. Read more...",
    "link": "https://qz.com/newark-airport-united-ceo-scott-kirby-faa-sean-duffy-1851779906",
    "timestamp": "2025-05-09T15:05:00Z"
  },
  {
    "title": "Vucic and Fico are heroes – Kremlin",
    "description": "The Serbian and Slovak leaders came to Moscow despite “frenzied” EU pressure, Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617193-vucic-fico-heroes-kremlin/",
    "timestamp": "2025-05-09T15:04:48Z"
  },
  {
    "title": "India Offers To Narrow ‘Tariff Gap’ To 4 percent Post Vance Meeting",
    "description": "India has proposed slashing its average tariff gap with the U.S. to below 4% from nearly 13% in exchange for exemption from current and future tariff hikes under President Donald Trump, two Indian officials said. The offer, part of a sweeping trade proposal, …",
    "link": "https://biztoc.com/x/8e9bf5529c5c4413",
    "timestamp": "2025-05-09T15:04:38Z"
  },
  {
    "title": "WATCH LIVE: White House briefing may address China tariffs and trade talks",
    "description": "President Donald Trump on Friday floated cutting tariffs on China to 80 percent ahead of a weekend meeting as he looks to de-escalate the trade war.",
    "link": "https://biztoc.com/x/bcd31fd9a963a38b",
    "timestamp": "2025-05-09T15:04:28Z"
  },
  {
    "title": "‘Very Aggravating’: Ex-Obama Aide Rages At Joe Biden For Believing He Would’ve Beaten Trump",
    "description": "Dan Pfeiffer said Friday he was angry about former President Joe Biden's renewed claim that he would have defeated President Donald Trump in the 2024 election.",
    "link": "https://dailycaller.com/2025/05/09/ex-obama-aide-rages-joe-biden/",
    "timestamp": "2025-05-09T15:02:24Z"
  },
  {
    "title": "A 'Despicable Me' pick for the national security advisor and more May 9 political cartoons",
    "description": "Some of the best political cartoons of the day on Donald Trump, freedom of the press, and the new Pope.",
    "link": "https://theweek.com/cartoons/todays-political-cartoons-may-9-2025",
    "timestamp": "2025-05-09T15:02:20Z"
  },
  {
    "title": "Denmark leader says \"you cannot spy against an ally\"",
    "description": "The Denmark prime minister's comments come a day after the top American diplomat in the country was summoned for an explanation of reports of U.S. intelligence gathering in Greenland.",
    "link": "https://www.cbsnews.com/news/denmark-greenland-cannot-spy-against-ally-intelligence-gathering/",
    "timestamp": "2025-05-09T15:01:45Z"
  },
  {
    "title": "Trump Worried Marjorie Taylor Greene Would Lose Senate Race: Report",
    "description": "President Donald Trump reportedly \"doesn't love\" Rep. Marjorie Taylor Greene's chances of winning a Senate seat for the GOP.\nThe post Trump Worried Marjorie Taylor Greene Would Lose Senate Race: Report first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/trump-worried-marjorie-taylor-greene-would-lose-senate-race-report/",
    "timestamp": "2025-05-09T15:01:31Z"
  },
  {
    "title": "Trump says he is naming Fox News host and former judge Jeanine Pirro as top federal prosecutor in DC",
    "description": "Trump says he is naming Fox News host and former judge Jeanine Pirro as top federal prosecutor in DCkctv5.com",
    "link": "https://www.kctv5.com/2025/05/09/trump-says-he-is-naming-fox-news-host-former-judge-jeanine-pirro-top-federal-prosecutor-dc/",
    "timestamp": "2025-05-09T15:01:18Z"
  },
  {
    "title": "Jared Kushner quietly advising Trump administration ahead of Middle East trip | CNN Politics",
    "description": "The president’s son-in-law is involved in discussions with Arab nations, including Saudi Arabia, about signing agreements that would normalize diplomatic relations with Israel, sources said.",
    "link": "https://www.cnn.com/2025/05/09/politics/jared-kushner-trump-middle-east-trip",
    "timestamp": "2025-05-09T15:00:50Z"
  },
  {
    "title": "Trump pushes tax hikes for wealthy as 'big, beautiful bill' deadline looms",
    "description": "As House Republicans work to pass President Donald Trump's \"big, beautiful bill\" before their Memorial Day deadline, conflicts arise after Trump proposes a tax hike for the wealthy.",
    "link": "https://www.foxnews.com/politics/trump-pushes-tax-hikes-wealthy-big-beautiful-bill-deadline-looms",
    "timestamp": "2025-05-09T15:00:46Z"
  },
  {
    "title": "Medicaid Cuts Divide California House Members as Budget Deadline Looms",
    "description": "Partisan divides shape Congressional stances on Medicaid cuts, leaving swing-district members in politically perilous positions.",
    "link": "https://www.kqed.org/news/12039465/medicaid-cuts-divide-california-house-members-as-budget-deadline-looms",
    "timestamp": "2025-05-09T15:00:32Z"
  },
  {
    "title": "Billionaire Cliff Asness: Can Technology Outrun 'Stupider and Stupider' Government?",
    "description": "Co-founder of AQR Capital Management, Cliff Asness, discusses the decline of market efficiency, the dangers of populist economics, and his libertarian outlook on capitalism.",
    "link": "https://reason.com/podcast/2025/05/09/billionaire-cliff-asness-can-technology-outrun-stupider-and-stupider-government/",
    "timestamp": "2025-05-09T15:00:17Z"
  },
  {
    "title": "'Leadership void': FBI insiders alarmed by Kash Patel's failure to live up to his workload",
    "description": "FBI director Kash Patel has reportedly cut back on daily briefings and stopped holding a weekly teleconference with other high-ranking law enforcement officials, raising concerns that he's not taking his job seriously enough.NBC News advanced reporting from e…",
    "link": "https://www.rawstory.com/kash-patel-fbi-director-2671924124/",
    "timestamp": "2025-05-09T14:58:11Z"
  },
  {
    "title": "Trump Is Wrong. Cheap Goods Are Awesome.",
    "description": "The right number of dolls? As many as your kid wants.",
    "link": "https://reason.com/2025/05/09/trump-is-wrong-cheap-goods-are-awesome/",
    "timestamp": "2025-05-09T14:58:02Z"
  },
  {
    "title": "Warning: Newsom's War on Oil Refineries Could Push Gas past $6 Per Gallon -- Or $9 -- in California",
    "description": "California Governor Gavin Newsom's hostility to the oil industry could lead to the closure of local refineries -- which, in turn, could push gas prices past $6 per gallon, or even $9 per gallon, a local analyst has warned.\nThe post Warning: Newsom’s War on Oi…",
    "link": "https://www.breitbart.com/politics/2025/05/09/warning-newsoms-war-on-oil-refineries-could-push-gas-past-6-per-gallon-or-9-california/",
    "timestamp": "2025-05-09T14:56:51Z"
  },
  {
    "title": "Canada unemployment rate jumps to 6.9% in April as Trump tariffs bite",
    "description": "The Bank of Canada has warned that growth would take a major hit in coming months.",
    "link": "https://www.sabcnews.com/sabcnews/canada-unemployment-rate-jumps-to-6-9-in-april-as-trump-tariffs-bite/",
    "timestamp": "2025-05-09T14:56:34Z"
  },
  {
    "title": "DOGE Could Speed Up Layoffs: Report",
    "description": "DOGE-backed software may fast-track federal layoffs as automation expands despite Elon Musk's reduced role and rising legal scrutiny.",
    "link": "https://www.newsweek.com/doge-cuts-update-speed-layoffs-autorif-2070062",
    "timestamp": "2025-05-09T14:56:02Z"
  },
  {
    "title": "Democrat Entertains 2028 Presidential Campaign With F-Bomb: ‘F*cking of Course’",
    "description": "Senator Ruben Gallego (D-AZ) dropped an f-bomb when asked about whether he's ever dreamed of moving into the White House by NBC News.\nThe post Democrat Entertains 2028 Presidential Campaign With F-Bomb: ‘F*cking of Course’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/democrat-entertains-2028-presidential-campaign-with-f-bomb-fcking-of-course/",
    "timestamp": "2025-05-09T14:55:21Z"
  },
  {
    "title": "Psaki bombs: MSNBC’s newest primetime program sheds 53% of viewers from key demo in second episode",
    "description": "MSNBC’s Jen Psaki bombed on Wednesday night as the second episode of her new primetime program shed a staggering 53% of its demo viewers compared to the first episode one day prior.",
    "link": "https://www.foxnews.com/media/psaki-bombs-msnbc-newest-primetime-program-sheds-53-viewers-key-demo-second-episode",
    "timestamp": "2025-05-09T14:55:16Z"
  },
  {
    "title": "Pope Leo 'Not Happy' With Trump's Immigration Policies—Brother",
    "description": "\"I know he's not happy with what's going on with immigration,\" a brother of the new pope said. \"I know that for a fact.\"",
    "link": "https://www.newsweek.com/pope-leo-immigration-policies-brother-2070146",
    "timestamp": "2025-05-09T14:54:10Z"
  },
  {
    "title": "Kamala Harris 2028? Hard Pass.",
    "description": "Kamala Harris has emerged from her den, apparently refreshed. Last week, she delivered a winsome keynote at a benefit gala in San Francisco, then made a surprise appearance at the Met Gala, the party of the year for New York City high society, and this week h…",
    "link": "https://newrepublic.com/article/195065/kamala-harris-2028-president-hard-pass",
    "timestamp": "2025-05-09T14:53:59Z"
  },
  {
    "title": "Enbridge CEO 'completely enthused' by conversation around energy in Canada, U.S.",
    "description": "The chief executive of pipeline builder Enbridge Inc. says he's encouraged by how governments in both Canada and the United States are recognizing the need to build oil and gas projects more quickly.",
    "link": "https://www.cbc.ca/news/canada/calgary/enbridge-ceo-completely-enthused-by-conversation-around-energy-in-canada-u-s-1.7531002",
    "timestamp": "2025-05-09T14:53:59Z"
  },
  {
    "title": "Nvidia, Apple Face Bigger Risks From China Trade Talks Than Any Boost From UK Deal, Analyst Says",
    "description": "President Donald Trump is expected to announce a framework trade agreement with the UK, according to The New York Times—marking the first concrete development in a series of proposed deals floated in recent weeks.\nHowever, Wedbush analyst Daniel Ives said the…",
    "link": "https://biztoc.com/x/e822b5d369522a59",
    "timestamp": "2025-05-09T14:53:49Z"
  },
  {
    "title": "Donald Trump Launches Bid To Overhaul USPS",
    "description": "Trump is set to nominate FedEx board member David Steiner as the next USPS postmaster general.",
    "link": "https://biztoc.com/x/d0a68d1596c7f08c",
    "timestamp": "2025-05-09T14:53:19Z"
  },
  {
    "title": "Make Vatican Great Again",
    "description": "Make Vatican Great Again refers to a series of memes and catchphrase inspired by the \"Make America Great Again (\"MAGA\":https://knowyourmeme.com/memes/make-",
    "link": "https://knowyourmeme.com/memes/make-vatican-great-again",
    "timestamp": "2025-05-09T14:53:13Z"
  },
  {
    "title": "WATCH LIVE: White House briefing may address China tariffs and trade talks",
    "description": "President Donald Trump on Friday floated cutting tariffs on China to 80 percent ahead of a weekend meeting as he looks to de-escalate the trade war.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-briefing-may-address-china-tariffs-and-trade-talks",
    "timestamp": "2025-05-09T14:52:58Z"
  },
  {
    "title": "How Trump Could Reset With Russia",
    "description": "A U.S.-Russia alignment would let Vladimir Putin declare victory over Europe.",
    "link": "http://foreignpolicy.com/2025/05/09/trump-putin-us-russia-reset-nato-eu-europe-ukraine-war/",
    "timestamp": "2025-05-09T14:52:54Z"
  },
  {
    "title": "Trump floats raising taxes on the rich to pay for his sweeping tax and spending cuts package | CNN Politics",
    "description": "President Donald Trump said he’s open to hiking taxes on wealthy Americans to help pay for Republicans’ sweeping tax and spending cuts package, but the idea remains hotly contested among GOP lawmakers on Capitol Hill.",
    "link": "https://www.cnn.com/2025/05/09/politics/trump-tax-wealthy-house-republicans",
    "timestamp": "2025-05-09T14:51:58Z"
  },
  {
    "title": "CNN’s Harry Enten Sets Fire To Trump ‘Gulf Of America’ Rebranding: ‘Has Gone Horribly!’",
    "description": "Harry Enten hammered Trump’s effort to rebrand the Gulf of Mexico to \"The Gulf of America\" by ticking through brutal stats on the campaign's effectiveness.\nThe post CNN’s Harry Enten Sets Fire To Trump ‘Gulf Of America’ Rebranding: ‘Has Gone Horribly!’ first …",
    "link": "https://www.mediaite.com/news/cnns-harry-enten-sets-fire-to-trump-gulf-of-america-rebranding-has-gone-horribly/",
    "timestamp": "2025-05-09T14:50:38Z"
  },
  {
    "title": "Manufactured Rage, Broken Minds",
    "description": "Through relentless narrative distortion, mass formation tactics, and AI-driven censorship, Democratic-aligned propaganda has destabilized the mental health of millions of young liberal women-especially those radicalized in academia and conditioned to see Dona…",
    "link": "https://freerepublic.com/focus/f-chat/4315931/posts",
    "timestamp": "2025-05-09T14:50:18Z"
  },
  {
    "title": "On trade imports, Trump’s weird new rhetoric gives away the game",
    "description": "The more Donald Trump convinces himself that all imports are bad imports, the less likely he is to abandon his failing trade policy.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trade-imports-trumps-weird-new-rhetoric-gives-away-game-rcna205822",
    "timestamp": "2025-05-09T14:49:58Z"
  },
  {
    "title": "Vance says India-Pakistan conflict ‘none of our business’ as Trump offers US help",
    "description": "Vice President JD Vance said the United States cannot tell India or Pakistan to lay down their arms in a renewed conflict, saying it is \"fundamentally none of our business.\"",
    "link": "https://www.foxnews.com/politics/vance-says-india-pakistan-conflict-none-our-business-trump-offers-us-help",
    "timestamp": "2025-05-09T14:48:36Z"
  },
  {
    "title": "$1 Trillion Bull Storm Projected for Dogecoin, XRP, Solana, Cardano, Shiba Inu as Traders Lock-In New Highs",
    "description": "Projections for a $1 DOGE price resurface with holders drawing lines with leading altcoins ahead of the next cycle.",
    "link": "https://zycrypto.com/1-trillion-bull-storm-projected-for-dogecoin-xrp-solana-cardano-shiba-inu-as-traders-lock-in-new-highs/",
    "timestamp": "2025-05-09T14:48:26Z"
  },
  {
    "title": "Brazil's Lula slams Trump tariffs in meeting with Putin",
    "description": "Brazilian President Luiz Inacio Lula da Silva on Friday slammed U.S. President Donald Trump's trade policies and sweeping tariffs, saying they harm multilateralism as he met with his Russian counterpart Vladimir Putin in Moscow. -snip- \"The latest decisions b…",
    "link": "https://freerepublic.com/focus/f-chat/4315930/posts",
    "timestamp": "2025-05-09T14:47:26Z"
  },
  {
    "title": "German asylum border controls ‘legally sound’, new chancellor says",
    "description": "Defence challenge an ‘exceptional’ circumstance where Germany may support EU members taking on common debt – Merz",
    "link": "https://www.irishtimes.com/world/europe/2025/05/09/merz-eu-leyen-border-debt/",
    "timestamp": "2025-05-09T14:47:11Z"
  },
  {
    "title": "Trump Says Republicans Should ‘Probably Not’ Tax the Rich",
    "description": "President Donald Trump has floated a tax increase on Americans making upwards of $2.5 million, but now says Republicans should \"probably not\" do it.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-republicans-probably-not-tax-rich-1235335449/",
    "timestamp": "2025-05-09T14:46:32Z"
  },
  {
    "title": "Trump Says He’s ‘OK’ With Raising Taxes On Wealthy",
    "description": "Trump made the statement Friday amid reports he told congressional Republicans to increase taxes on top earners to pay for other tax cuts he’s proposed.",
    "link": "https://www.forbes.com/sites/saradorn/2025/05/09/trump-says-hes-ok-with-raising-taxes-on-wealthy/",
    "timestamp": "2025-05-09T14:46:13Z"
  },
  {
    "title": "US Postal Service reports $3.3 billion quarterly net loss",
    "description": "The U.S. Postal Service on Friday reported a net loss of $3.3 billion for the three months ending March 31 as the money-losing agency continues to hike stamp...",
    "link": "https://finance.yahoo.com/news/us-postal-reports-3-3-144538407.html",
    "timestamp": "2025-05-09T14:45:38Z"
  },
  {
    "title": "Trump’s pope? Here’s what Leo XIV’s election says about US power",
    "description": "With views spanning the political spectrum, the new pontiff may frustrate culture warriors on both sides of the Atlantic Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617197-leo-xivs-election-us-power/",
    "timestamp": "2025-05-09T14:45:17Z"
  },
  {
    "title": "AI will help make 'life-or-death' calls in rammed UK asylum system",
    "description": "The governing Labour party has pledged to hire more asylum caseworkers and set up a new returns and enforcement unit to fast-track removals for applicants who have no right to stay. At the end of 2024, the government had 90,686 asylum cases awaiting an initia…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-will-help-make-life-or-death-calls-in-rammed-uk-asylum-system/articleshow/121034957.cms",
    "timestamp": "2025-05-09T14:45:09Z"
  },
  {
    "title": "Trump fires Librarian of Congress Carla Hayden (Sophia Nguyen/Washington Post)",
    "description": "Sophia Nguyen / Washington Post:\nTrump fires Librarian of Congress Carla Hayden  —  Hayden, who was appointed by President Barack Obama in 2016, was the first woman and the first African American to hold the position.  —  President Donald Trump on Thursday fi…",
    "link": "https://www.memeorandum.com/250509/p50",
    "timestamp": "2025-05-09T14:45:00Z"
  },
  {
    "title": "Tiger Woods suits up for White House visit as Vanessa Trump romance heats up",
    "description": "The professional golfer confirmed in March that he is dating Vanessa, who is the ex-wife of President Trump's son Donald Trump Jr.",
    "link": "https://pagesix.com/2025/05/09/entertainment/tiger-woods-suits-up-for-white-house-visit-amid-vanessa-trump-romance/",
    "timestamp": "2025-05-09T14:44:46Z"
  },
  {
    "title": "Tiger Woods resurfaces at White House amid recovery, TGL expansion, and high-profile romance",
    "description": "Tiger Woods has stayed largely out of the spotlight since his last PGA Tour appearance at the 2024 Hero World Challenge, where he competed before undergoing another back surgery.",
    "link": "https://www.marca.com/en/golf/2025/05/09/681e0aab22601d9b228b4598.html",
    "timestamp": "2025-05-09T14:44:19Z"
  },
  {
    "title": "Jimmy Kimmel Jokes We’re Living In A “Historic” Era In The U.S.: “We Have An American Pope And A Russian President”",
    "description": "\"Isn't it incredible?\" Kimmel said on the show.",
    "link": "https://decider.com/2025/05/09/jimmy-kimmel-historic-era-american-pope-russian-president/",
    "timestamp": "2025-05-09T14:44:18Z"
  },
  {
    "title": "'Too aggressive': Trump-whispering Wall Street CEO has some criticisms for the president",
    "description": "JPMorgan CEO Jamie Dimon “cautioned the White House [tariff] policy has created too much uncertainty, but has also offered a more balanced outlook on some of the benefits Oval Office policy could provide,” according to a report from Fortune\r\n.The friend of Pr…",
    "link": "https://www.rawstory.com/jamie-dimon-trump-2671924274/",
    "timestamp": "2025-05-09T14:44:04Z"
  },
  {
    "title": "'Learn some geography': Trump brutally trolled after making 'glaring error' in message to new Pope",
    "description": "President Trump on Thursday congratulated Cardinal Robert Francis Prevost after he was elected as the new pope, making him the first American to serve as the head of the Catholic Church. “Congratulations to Cardinal Robert Francis Prevost, who was just named …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-cardinal-robert-francis-prevost-learn-some-geography-trump-brutally-trolled-after-making-glaring-error-in-message-to-new-pope/articleshow/121034813.cms",
    "timestamp": "2025-05-09T14:43:47Z"
  },
  {
    "title": "Donald Trump Launches Bid To Overhaul USPS",
    "description": "Trump is set to nominate FedEx board member David Steiner as the next USPS postmaster general.",
    "link": "https://www.newsweek.com/donald-trump-overhaul-usps-postmaster-general-2070084",
    "timestamp": "2025-05-09T14:43:30Z"
  },
  {
    "title": "Israeli concern over reported Trump shift on Saudi nuclear talks",
    "description": "Riyadh normalising relations with Israel had been US precondition for progressing civilian nuclear programme discussions",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/09/israeli-concern-over-reported-trump-shift-on-saudi-nuclear-talks/",
    "timestamp": "2025-05-09T14:43:23Z"
  },
  {
    "title": "Trump heads to the Middle East with oil, trade and nuclear ambitions on the table",
    "description": "DUBAI, United Arab Emirates — U.S. President Donald Trump will touch down in the Persian Gulf region – or as he may soon be calling it, the Arabian Gulf – on May 13, for an official trip with stops in Saudi Arabia, Qatar and the United Arab Emirates.\nThe stak…",
    "link": "https://biztoc.com/x/00ccd6eb93ef7666",
    "timestamp": "2025-05-09T14:41:55Z"
  },
  {
    "title": "Trump’s Supposed U.K. Trade Deal Gets Trashed by Surprising Person",
    "description": "Not even people on Donald Trump’s side think that his trade negotiations with the United Kingdom have gone well.\r\nConservative radio show host and far-right influencer Erick Erickson blasted the Trump administration’s deal with one its longest and strongest i…",
    "link": "https://newrepublic.com/post/195064/donald-trump-uk-trade-deal-trashed-surprising-person",
    "timestamp": "2025-05-09T14:41:43Z"
  },
  {
    "title": "Trump Missing His Chance To Make History in Moscow",
    "description": "Edward Lozansky, who sent this dispatch to Consortium News ahead of the 80th anniversary commemoration of the end of World War II in Moscow on Friday, unexpectedly passed away on April 30. It is reprinted with permission. Europeans have sunk so low that the E…",
    "link": "https://www.antiwar.com/blog/2025/05/09/trump-missing-his-chance-to-make-history-in-moscow/",
    "timestamp": "2025-05-09T14:40:46Z"
  },
  {
    "title": "Indonesia Looks to Buy More U.S. Fuel to Avoid Steep Tariffs",
    "description": "Indonesia plans to slash its fuel imports from Singapore and source more refined products from the United States as the country looks to negotiate lower tariffs with the U.S. Indonesia was slapped with one of the highest tariffs - 32% - in the “liberation day…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Indonesia-Looks-to-Buy-More-US-Fuel-to-Avoid-Steep-Tariffs.html",
    "timestamp": "2025-05-09T14:40:00Z"
  },
  {
    "title": "A month into the trade war, China's exports to the US have already plummeted over 20%",
    "description": "China's exports to the US have plunged. Apollo's top economist said recently that the US could see empty shelves and a tariff-fueled recession by summer.",
    "link": "https://www.businessinsider.com/china-us-exports-trump-trade-war-tariffs-inflation-inventory-2025-5",
    "timestamp": "2025-05-09T14:39:57Z"
  },
  {
    "title": "Dem in Trump district race scrubs social media of posts praising progressives: 'Scam artist'",
    "description": "A Democratic House candidate running in a pro-Trump district has deleted several social media posts that praise progressive politicians and criticize President Donald Trump.",
    "link": "https://www.foxnews.com/politics/dem-trump-district-race-scrubs-social-media-posts-praising-progressives-scam-artist",
    "timestamp": "2025-05-09T14:39:21Z"
  },
  {
    "title": "VICTOR DAVIS HANSON: Would The Left Finally Explain The Inexplicable?",
    "description": "Somewhere between 10 and 12 million illegal aliens were invited into the United States by the Biden administration.",
    "link": "https://dailycaller.com/2025/05/09/victor-davis-hanson-left-inexplicable-biden/",
    "timestamp": "2025-05-09T14:38:42Z"
  },
  {
    "title": "Fox News’ Camryn Kinsey Faints Live On-Air While Slamming Biden’s ‘The View’ Interview",
    "description": "Fox News viewers suffered a scary moment on Thursday night as a commentator fainted live on-air during an interview segment. Camryn Kinsey, a former staffer for President Donald Trump who is now a political commentator, fainted during Thursday night’s live ep…",
    "link": "https://variety.com/2025/tv/news/fox-news-camryn-kinsey-faints-biden-1236392173/",
    "timestamp": "2025-05-09T14:37:42Z"
  },
  {
    "title": "Editor Daily Rundown: Trump Announces New Interim US Attorney For DC After GOP Senator Blocks Nomination",
    "description": "ED MARTYRED ... AFTER TILLIS KILLS BID, TRUMP YANKS US ATTORNEY NOMINATION FOR CONSERVATIVE STALWART ... Trump Reveals Fate Of Ed Martin After Key GOP Senator Drops Support (VIDEO)\n\nPresident Donald Trump revealed Thursday that he plans to pull Ed Martin’s no…",
    "link": "https://dailycaller.com/2025/05/09/trump-us-attorney-dc-jeanine-pirro-ed-martin-thom-tillis/",
    "timestamp": "2025-05-09T14:36:08Z"
  },
  {
    "title": "First Afrikaner Refugees Due to Arrive in U.S.; Charter Flight Possible",
    "description": "The first Afrikaner refugees are set to arrive in the U.S. on Monday under President Donald Trump's policy of granting them asylum due to racial discrimination and threats of expropriation by the South African government.\nThe post First Afrikaner Refugees Due…",
    "link": "https://www.breitbart.com/immigration/2025/05/09/first-afrikaner-refugees-due-to-arrive-in-u-s-charter-flight-possible/",
    "timestamp": "2025-05-09T14:35:53Z"
  },
  {
    "title": "Trump heads to the Middle East with oil, trade and nuclear ambitions on the table",
    "description": "Trump's agenda will likely include Israel-Gaza ceasefire talks, oil, trade, investment deals, and potential announcements on chip exports and nuclear energy.",
    "link": "https://www.cnbc.com/2025/05/09/trump-heads-to-middle-east-with-oil-arms-nuclear-ambitions-in-focus.html",
    "timestamp": "2025-05-09T14:35:03Z"
  },
  {
    "title": "The Transgender Man At The Center Of Trump’s Military Ban Has A Lot To Say",
    "description": "“I was serving without an issue. Why are they trying to make an issue where none existed previously?” Nicolas Talbott said.",
    "link": "https://www.huffpost.com/entry/he-serves-his-country-in-the-military-now-trump-is-trying-to-kick-him-out-the-transgender-man-at-the-center-of-a-major-military-ban-case-speaks-out_n_681d0fdee4b007ccedaf8a8e",
    "timestamp": "2025-05-09T14:33:48Z"
  },
  {
    "title": "Will Trump’s tariff war keep gold glowing? (Prakash Bhudia)",
    "description": "Just when investors thought they could catch a breather after the Fed’s latest move, Donald Trump de...",
    "link": "https://www.finextra.com/blogposting/28437/will-trumps-tariff-war-keep-gold-glowing",
    "timestamp": "2025-05-09T14:33:39Z"
  },
  {
    "title": "Trump says he wants to change name of Veterans Day: Here's what he wants to call it",
    "description": "Here's why President Trump is pushing to rename Veterans Day, a federal holiday recognized each year on Nov. 11.",
    "link": "https://www.milforddailynews.com/story/news/2025/05/09/trump-wants-to-rename-veterans-day-victory-day-for-world-war-i/83532999007/",
    "timestamp": "2025-05-09T14:32:57Z"
  },
  {
    "title": "Jeanine Pirro’s Net Worth: How Much Money She Has Now",
    "description": "Jeanine Pirro has built an impressive net worth through her legal career, media appearances, and book deals. Find out more about her financial standing here.",
    "link": "https://hollywoodlife.com/feature/jeanine-pirro-net-worth-5416463/",
    "timestamp": "2025-05-09T14:32:53Z"
  },
  {
    "title": "Both Xi and Trump Want the Other to Call Them First",
    "description": "A conflict over face is tangling up the trade war’s resolution.",
    "link": "http://foreignpolicy.com/2025/05/09/china-us-trade-war-tariffs-trump-xi/",
    "timestamp": "2025-05-09T14:32:43Z"
  },
  {
    "title": "'Trump already lost': Ex-GOP insider says new pope poised to 'make president look small'",
    "description": "An American pope who values right over wrong has appeared on the world stage just when he's needed most, according to a former Republican strategist.Steve Schmidt, who worked on Republican political campaigns for George W. Bush, wrote on his Substack that Pop…",
    "link": "https://www.rawstory.com/trump-pope-2671924137/",
    "timestamp": "2025-05-09T14:32:41Z"
  },
  {
    "title": "Joe Biden knifed his VP Kamala Biden on live television over her election loss to Donald Trump; here's what he said",
    "description": "Joe Biden election loss comments on The View have stirred controversy after he said he wasn’t surprised Kamala Harris lost to Donald Trump in 2024. Biden claimed he would’ve won if he stayed in the race and subtly distanced himself from Harris’ campaign decis…",
    "link": "https://economictimes.indiatimes.com/news/international/us/joe-biden-knifed-his-vp-kamala-biden-on-live-television-over-her-election-loss-to-donald-trump-heres-what-he-said/articleshow/121032523.cms",
    "timestamp": "2025-05-09T14:31:25Z"
  },
  {
    "title": "Trump Attacks MSNBC Coverage as ‘Major Campaign Violation’ Minutes After Morning Joe Says He’s ‘Backed Into a Corner’",
    "description": "Trump insisted that MSNBC's coverage \"should be considered a Major Campaign Violation,\" just minutes after a Morning Joe segment ridiculed his tariff policy.\nThe post Trump Attacks MSNBC Coverage as ‘Major Campaign Violation’ Minutes After Morning Joe Says He…",
    "link": "https://www.mediaite.com/news/trump-attacks-msnbc-coverage-as-major-campaign-violation-minutes-after-morning-joe-says-hes-backed-into-a-corner/",
    "timestamp": "2025-05-09T14:31:06Z"
  },
  {
    "title": "Trump makes the first move ahead of tariff talks with China",
    "description": "On Friday, President Donald Trump floated a sweetener ahead of sending Treasury Secretary Scott Bessent to major trade talks with the Chinese.\nSaul Loeb/AFP/Getty Images\nPresident Donald Trump suggested that tariffs on Chinese goods should be slashed to 80%.\n…",
    "link": "https://biztoc.com/x/291f61e1cc3177a2",
    "timestamp": "2025-05-09T14:30:40Z"
  },
  {
    "title": "Watch: Trump misspeaks and calls toy firm Mattel a country",
    "description": "The US president says tariffs are \"the most misunderstood thing\" in business and threatens more action.",
    "link": "https://www.bbc.com/news/videos/cn4q950zxgqo",
    "timestamp": "2025-05-09T14:30:30Z"
  },
  {
    "title": "Trump Duped Into Endorsing XRP For Crypto Reserve: Here’s How",
    "description": "XRP took center stage early on Sunday, March 2, when President Donald Trump, posting to Truth Social, urged creation of a “ Strategic CryptoReserve” that would hold the token alongside Solana and Cardano—only to learn hours later that the move had quietly adv…",
    "link": "https://bitcoinist.com/trump-duped-endorsing-xrp-crypto-reserve/",
    "timestamp": "2025-05-09T14:30:30Z"
  },
  {
    "title": "Trump Aims to Cut Hospital Disaster Preparedness Program",
    "description": "The Hospital Preparedness Program helps hospitals and emergency managers save lives in wildfires, tornadoes, pandemics and other mass-casualty events. The Trump administration has proposed cutting it",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/05/09/hospitals-use-this-program-to-evacuate-in-disasters-trump-wants-to-cut-it-00336223",
    "timestamp": "2025-05-09T14:30:00Z"
  },
  {
    "title": "College Closures (And Mergers) Will Accelerate Under President Trump",
    "description": "An expected decline in international students studying in U.S. next fall will lead to 80 or more colleges closing their doors before the end of the decade.",
    "link": "https://www.forbes.com/sites/paulweinstein/2025/05/09/college-closures-and-mergers-will-accelerate-under-president-trump/",
    "timestamp": "2025-05-09T14:29:46Z"
  },
  {
    "title": "Russia has long been ready for peace with Ukraine – Lukashenko",
    "description": "It is Kiev and Washington that must decide that they want the conflict to end, the Belarusian leader has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617172-ukraine-peace-putin-lukashenko/",
    "timestamp": "2025-05-09T14:28:22Z"
  },
  {
    "title": "America's small businesses preparing for recession with Trump tariffs: CNBC|SurveyMonkey survey",
    "description": "Tariffs are not just impacting consumers and big corporations, but small businesses too, and that's leading a majority on Main Street to brace for a recession.",
    "link": "https://www.cnbc.com/2025/05/09/small-businesses-expect-recession-with-trump-tariffs-poll.html",
    "timestamp": "2025-05-09T14:28:06Z"
  },
  {
    "title": "'Hamilton' author Chernow's new book takes on icon of American letters, Mark Twain",
    "description": "Historian Ron Chernow’s latest work may surprise readers who know him best for the book which inspired the musical “Hamilton” and for his biographies of George Washington and Ulysses Grant",
    "link": "https://abcnews.go.com/Entertainment/wireStory/hamilton-author-ron-chernows-new-book-takes-icon-121639235",
    "timestamp": "2025-05-09T14:26:37Z"
  },
  {
    "title": "Rights groups sue to free Venezuelans deported from the US and held in El Salvador",
    "description": "International human rights organizations have filed a lawsuit with the Inter-American Commission on Human Rights asking that the commission order El Salvador’s government to release Venezuelans deported from the United States and held in a maximum-secu...",
    "link": "https://abcnews.go.com/International/wireStory/rights-groups-sue-free-venezuelans-deported-us-held-121638550",
    "timestamp": "2025-05-09T14:22:28Z"
  },
  {
    "title": "Watch: William Shatner Freaks Over Trump's Canadian Statehood Remarks, Says Canada Should Make U.S. a Province",
    "description": "In a visit with Fox News, \"Star Trek\" star William Shatner, a proud Canadian, ridiculed President Donald Trump's suggestion that Canada should become America's 51st state, and he even had a counter offer of his own for Trump.",
    "link": "https://www.breitbart.com/entertainment/2025/05/09/william-shatner-freaks-over-trumps-canadian-statehood-remarks-says-canada-should-make-u-s-a-province/",
    "timestamp": "2025-05-09T14:22:27Z"
  },
  {
    "title": "Escalating Anti-Homeless Policies Fall Hardest on Disabled People in the US",
    "description": "As legislative attacks on unhoused people ramp up, disabled people are on the front lines.",
    "link": "https://truthout.org/articles/escalating-anti-homeless-policies-fall-hardest-on-disabled-people-in-the-us/",
    "timestamp": "2025-05-09T14:22:16Z"
  },
  {
    "title": "Fox Business Host Breaks Down Just How ‘Big’ UK Trade Deal Could Be For American Businesses",
    "description": "Brian Brenburg told Lawrence Jones the trade deal Donald Trump announced with the United Kingdom could bring billions of dollars in exports for the U.S.",
    "link": "https://dailycaller.com/2025/05/09/fox-business-host-uk-trade-deal/",
    "timestamp": "2025-05-09T14:22:05Z"
  },
  {
    "title": "Trump makes the first move ahead of tariff talks with China",
    "description": "\"80% Tariff on China seems right! Up to Scott B,\" the president posted, seemingly leaving the ultimate decision up to his Treasury Secretary.",
    "link": "https://www.businessinsider.com/trump-china-tariff-talks-status-trade-2025-5",
    "timestamp": "2025-05-09T14:21:55Z"
  },
  {
    "title": "Barbie meets the trade war: Donald Trump warns Mattel of crushing tariffs as CEO pushes back on U.S. production demands",
    "description": "US President Donald Trump has threatened toy giant Mattel with a 100% tariff. This was in response to Mattel's refusal to shift production to the United States, citing financial infeasibility. CEO Ynon Kreiz plans to diversify production to nations like India…",
    "link": "https://economictimes.indiatimes.com/news/international/us/barbie-meets-the-trade-war-donald-trump-warns-mattel-of-crushing-tariffs-as-ceo-pushes-back-on-u-s-production-demands/articleshow/121033414.cms",
    "timestamp": "2025-05-09T14:21:54Z"
  },
  {
    "title": "Ken Griffin Says International Graduates Should Automatically Receive Visas",
    "description": "\"I do not understand our unwillingness to embrace a path to citizenship for those who come here for their education.\"",
    "link": "https://observer.com/2025/05/citadel-ken-griffin-international-students-us-visas/",
    "timestamp": "2025-05-09T14:19:56Z"
  },
  {
    "title": "Trump backs tax hike on the rich, but says GOP 'probably' shouldn't do it",
    "description": "Trump's Truth Social post shows his willingness to buck traditional Republican opposition to taxing the rich as he seeks to pass his agenda through Congress.",
    "link": "https://www.cnbc.com/2025/05/09/trump-tax-hike-rich-republicans.html",
    "timestamp": "2025-05-09T14:19:55Z"
  },
  {
    "title": "Trump Seeks Tax Hike on Wealthy Earning $2.5 Million or More",
    "description": "President Donald Trump is pushing lawmakers to increase tax rates on some of the wealthiest Americans as a way to offset other cuts in his signature economic package.\nThe president’s proposal calls for creating a new 39.6% tax bracket for individuals earning …",
    "link": "https://biztoc.com/x/9a1eff00f866a7fd",
    "timestamp": "2025-05-09T14:19:46Z"
  },
  {
    "title": "Trump fires Librarian of Congress Carla Hayden",
    "description": "President Donald Trump abruptly fired Hayden in an email late Thursday from the White House’s Presidential Personnel Office.",
    "link": "https://biztoc.com/x/a8e6db80edb89343",
    "timestamp": "2025-05-09T14:19:45Z"
  },
  {
    "title": "Jamie Dimon on Trump's tariff blitz: 'Too large, too big, and too aggressive'",
    "description": "JPMorgan Chase (JPM) CEO Jamie Dimon had some critical words for President Donald Trump’s tariffs—but he says he also understands the intent behind them.Read more...",
    "link": "https://qz.com/jamie-dimon-jpmorgan-chase-ceo-trump-tariffs-1851779909",
    "timestamp": "2025-05-09T14:19:00Z"
  },
  {
    "title": "Even Republicans slam Trump Cabinet member for refusal to say what jobs he’ll cut",
    "description": "Veterans Affairs Secretary Doug Collins was dismissive about his plan to cut 83,000 jobs, and that did not sit well with lawmakers this week.Atlanta Journal Constitution reporter Jamie Dupree says lawmakers dressed down Collins about which of the 15 percent o…",
    "link": "https://www.rawstory.com/even-republicans-are-slamming-trumps-va-secretary-for-refusing-to-say-what-jobs-hell-cut/",
    "timestamp": "2025-05-09T14:16:31Z"
  }
]