[
  {
    "title": "How Trump worked a Mideast miracle with his two-sided ‘America First’ doctrine",
    "description": "President Trump wants his tariffs to reshore manufacturing and end the fleecing of America, but he’s simultaneously using them to accomplish all manner of policy wins — including Mideast peace.",
    "link": "https://nypost.com/2025/10/13/opinion/how-trumps-america-first-doctrine-worked-a-mideast-miracle/",
    "timestamp": "2025-10-13T21:47:38Z"
  },
  {
    "title": "This is why the story of Abraham is coming up in the push for Middle East peace",
    "description": "President Donald Trump repeatedly touted the “Abraham Accords” in his Middle East trip on Monday, seeking to build on 2020 agreements that expanded the...",
    "link": "https://www.yahoo.com/news/articles/abraham-dont-surprised-biblical-figure-214208194.html",
    "timestamp": "2025-10-13T21:42:08Z"
  },
  {
    "title": "DOJ stuns CNN reporter saying 'quiet part out loud' about Trump ally",
    "description": "President Donald Trump's hand-picked prosecutor in the Eastern District of Virginia is getting a lot of pushback from career prosecutors in the office because of her efforts to prosecute the president's political foes, CNN reporter Katelyn Polantz revealed on…",
    "link": "https://www.rawstory.com/trump-doj-2674180761/",
    "timestamp": "2025-10-13T21:40:02Z"
  },
  {
    "title": "A Tale of Two Political Parties",
    "description": "In America today, our two major political parties are moving in opposite directions. For Republicans, it might be the “best of times.” Under the leadership of President Donald Trump, the GOP is feeling confident. Republicans have a strong chance to retain con…",
    "link": "https://freerepublic.com/focus/f-chat/4346174/posts",
    "timestamp": "2025-10-13T21:37:18Z"
  },
  {
    "title": "'A lifeline' - Americans fear spike in healthcare costs, making Republicans nervy",
    "description": "The cost of health insurance could double for millions of people, which could hurt Republicans.",
    "link": "https://www.bbc.com/news/articles/c0l7899352ro",
    "timestamp": "2025-10-13T21:36:52Z"
  },
  {
    "title": "World leaders meet in Egypt to discuss post-war Gaza plans amid hostage, prisoner swap",
    "description": "U.S. President Donald Trump embarked on a whirlwind trip to the Middle East on Monday to cement the end of the war between Israel and Hamas, and to reaffirm his ambitions to usher in peace between the two.",
    "link": "https://www.cbc.ca/news/world/egypt-gaza-trump-summit-9.6937028",
    "timestamp": "2025-10-13T21:33:34Z"
  },
  {
    "title": "Venezuela says US navy raided a tuna boat in the Caribbean as tensions rise",
    "description": "The fishing boat had authorization from the Ministry of Fisheries to carry out its work.",
    "link": "https://www.bostonherald.com/2025/10/13/venezuela-us-tensions/",
    "timestamp": "2025-10-13T21:33:26Z"
  },
  {
    "title": "‘Wonderful Day’: Chuck Schumer Thanks Trump For Release Of Israeli Hostages Held By Hamas",
    "description": "Chuck Schumer commended President Donald Trump on Monday for brokering the Middle East peace deal to end the Israel-Hamas war and release Israeli hostages.",
    "link": "https://dailycaller.com/2025/10/13/chuck-schumer-israeli-hostages/",
    "timestamp": "2025-10-13T21:33:08Z"
  },
  {
    "title": "GOP ‘RINOs’ Consider Attending Big Globalist Climate Shindig",
    "description": "GOP Utah Sen. John Curtis is reportedly planning to lead a delegation to the massive annual U.N. climate conference.",
    "link": "https://dailycaller.com/2025/10/13/gop-rinos-consider-attending-cop-30/",
    "timestamp": "2025-10-13T21:32:48Z"
  },
  {
    "title": "Crypto Trader Dies By Suicide In Ukraine Amid $19 Billion Market Crash",
    "description": "According to local police and multiple news reports, crypto trader Konstantin Galish — also known by the name Kostya Kudo — was discovered dead inside his Lamborghini Urus in the Obolon district of Kyiv. He was 32. Related Reading: Bitcoin Or Your Life? Israe…",
    "link": "https://bitcoinist.com/crypto-trader-dies-by-suicide-in-ukraine-amid-19-billion-market-crash/",
    "timestamp": "2025-10-13T21:30:54Z"
  },
  {
    "title": "Trump takes swipe at Hillary Clinton, blasts Obama and Biden in passionate address to Israeli parliament",
    "description": "President Donald Trump settled scores with his political foes during his passionate address to the Israeli parliament on Monday, taking a swipe at Hillary Clinton and blasting his predecessors Joe Biden and Barack Obama.",
    "link": "https://nypost.com/2025/10/13/us-news/trump-takes-swipe-at-hillary-clinton-blasts-obama-and-biden-in-knesset-speech/",
    "timestamp": "2025-10-13T21:28:24Z"
  },
  {
    "title": "Reviving US-Iran diplomacy difficult despite Trump’s ‘hand of friendship’",
    "description": "Analysts say US may be comfortable with the status quo, and many in Iran are wary of negotiations after the 12-day war.",
    "link": "https://www.aljazeera.com/news/2025/10/13/reviving-us-iran-diplomacy-difficult-despite-trumps-hand-of-friendship",
    "timestamp": "2025-10-13T21:27:25Z"
  },
  {
    "title": "Through A Biblical Lens: Don’t Expect The Present Peace Plan To Lead To ‘An Everlasting Peace In The Middle East’",
    "description": "As I write this, the people of Israel, Gaza, and the world hope that the Gaza war is finally coming to an end. Will there be more delays? Probably. Has Hamas been removed? Over time, will Hamas be reborn or will a Hamas-like entity rise to take its place? The…",
    "link": "https://freerepublic.com/focus/f-religion/4346172/posts",
    "timestamp": "2025-10-13T21:25:58Z"
  },
  {
    "title": "Eurovision organizers push back Israel decision to December",
    "description": "The Eurovision Song Contest's organizers said Monday they had put back taking a decision on Israel's participation in next year's event, given the Gaza ceasefire. The European Broadcasting Union's members were due to hold a vote next month, after a growing nu…",
    "link": "https://japantoday.com/category/entertainment/eurovision-organisers-push-back-israel-decision-to-december",
    "timestamp": "2025-10-13T21:25:30Z"
  },
  {
    "title": "Ukraine's Zelenskyy to meet with Trump at the White House on Friday",
    "description": "Ukrainian President Volodymyr Zelenskyy is expected to meet with President Donald Trump at the White House on Friday, according to an administration official, a Western official and a Ukrainian embassy spokesperson. Ukraine's ambassador to the U.S., Olga Stef…",
    "link": "https://freerepublic.com/focus/f-news/4346170/posts",
    "timestamp": "2025-10-13T21:25:06Z"
  },
  {
    "title": "A day of joy for Israel, and hope for the entire Middle East",
    "description": "The road ahead may be uncertain, but real hope for peace is truly on the table.",
    "link": "https://nypost.com/2025/10/13/opinion/a-day-of-joy-for-israel-and-hope-for-the-entire-middle-east/",
    "timestamp": "2025-10-13T21:24:45Z"
  },
  {
    "title": "Starmer and other leaders have fallen into line on Trump's Gaza plan - now it must deliver",
    "description": "This historic day in the Middle East was pure theatre for Trump from start to finish - but the task for all leaders is to help implement what he has set in train.",
    "link": "https://news.sky.com/story/starmer-and-other-leaders-have-fallen-into-line-on-trumps-gaza-plan-now-it-must-deliver-13449777",
    "timestamp": "2025-10-13T21:24:00Z"
  },
  {
    "title": "Trump Urges World Leaders to Ensure 'Lasting' Gaza Peace",
    "description": "President Donald Trump kicked off a global summit in Egypt on Gaza’s future, aimed at ensuring the US-led truce in the Middle East turns into a lasting peace.\nThe stop was Trump’s second during his whirlwind trip to the region, following a visit to Israel to …",
    "link": "https://biztoc.com/x/13abddf83e5ee40e",
    "timestamp": "2025-10-13T21:23:05Z"
  },
  {
    "title": "Why María Corina Machado Says That Trump Deserves Her Nobel Peace Prize",
    "description": "Jon Lee Anderson on María Corina Machado, the winner of the 2025 Nobel Peace Prize, and what the decision means for future relations between Venezuela and the United States.",
    "link": "https://www.newyorker.com/news/the-lede/why-maria-corina-machado-says-that-donald-trump-deserves-her-peace-prize",
    "timestamp": "2025-10-13T21:22:50Z"
  },
  {
    "title": "Brazil Supreme Court justice keeps Bolsonaro under house arrest",
    "description": "(Reuters) -Supreme Court Justice Alexandre de Moraes ruled on Monday to keep former Brazilian President Jair Bolsonaro under house arrest, according to a court document seen by Reuters. Bolsonaro has been under house arrest since August for failing to comply …",
    "link": "https://japantoday.com/category/world/brazil-supreme-court-justice-keeps-bolsonaro-under-house-arrest1",
    "timestamp": "2025-10-13T21:21:32Z"
  },
  {
    "title": "Trump calls Italian PM 'beautiful' at Gaza summit",
    "description": "U.S. President Donald Trump had some choice words for Italian Prime Minister Giorgia Meloni, the only female leader on stage at a Gaza summit in Egypt on Monday: &quot;She's beautiful.&quot; The three-times-married 79-year-old admitted that he risked being ac…",
    "link": "https://japantoday.com/category/world/trump-calls-italian-pm-%27beautiful%27-at-gaza-summit",
    "timestamp": "2025-10-13T21:21:15Z"
  },
  {
    "title": "Trump on track to meet Xi in South Korea, Bessent says",
    "description": "U.S. President Donald Trump remains on track to meet Chinese leader Xi Jinping in South Korea in late October as the two sides try to de-escalate tensions over tariff threats and export controls, U.S. Treasury Secretary Scott Bessent said on Monday. The lates…",
    "link": "https://japantoday.com/category/world/trump-on-track-to-meet-xi-in-south-korea-bessent-says2",
    "timestamp": "2025-10-13T21:20:47Z"
  },
  {
    "title": "Zelenskyy to meet Trump on Friday to talk air defense, new weapons",
    "description": "Ukrainian President Volodymyr Zelenskyy said on Monday that he would meet U.S. President Donald Trump in Washington on Friday, where the two would discuss Ukraine's air defense and long-range strike capabilities. The two leaders spoke on both Saturday and Sun…",
    "link": "https://japantoday.com/category/world/zelenskiy-to-meet-trump-on-friday-to-talk-air-defence-new-weapons1",
    "timestamp": "2025-10-13T21:20:41Z"
  },
  {
    "title": "Hamas carries out wave of Gaza killings, citing crime and security concerns",
    "description": "A greatly weakened Hamas has sought to reassert itself in Gaza since a ceasefire took hold, killing at least 33 people in a crackdown on groups that have tested its grip and appearing to get a U.S. nod to temporarily police the shattered enclave. Pummelled by…",
    "link": "https://japantoday.com/category/world/hamas-carries-out-wave-of-gaza-killings-citing-crime-and-security-concerns",
    "timestamp": "2025-10-13T21:20:17Z"
  },
  {
    "title": "Egyptian president says Trump's Mideast proposal is 'last chance' for peace in the region",
    "description": "Egyptian President Abdel Fattah El-Sissi told a summit of world leaders Monday that U.S. President Donald Trump’s Mideast proposal represents the “last chance” for peace in the region and reiterated his call for a two-state solution, saying Palestinians have …",
    "link": "https://japantoday.com/category/world/world-leaders-gathering-in-egypt-throw-their-weight-behind-the-gaza-ceasefire-deal",
    "timestamp": "2025-10-13T21:20:10Z"
  },
  {
    "title": "Trump Refuses To Let Go Of Macron During Aggressively Long Handshake At Egypt Summit",
    "description": "When the French president attempted to break away, Trump continued to hold firm.",
    "link": "https://www.huffpost.com/entry/trump-macron-handshake-peace-summit_n_68ed46c9e4b0e8380ba95d88",
    "timestamp": "2025-10-13T21:19:23Z"
  },
  {
    "title": "Trump and other leaders sign historic ceasefire deal",
    "description": "Donald Trump and other world leaders have signed an Israel- Hamas ceasefire deal at a summit on Gaza in Egypt. There have been joyous scenes in the Palestinian territories and Israel, as the two sides carried out an exchange of hostages for detainees, as part…",
    "link": "https://www.bbc.co.uk/programmes/w172zss9zy87x7s",
    "timestamp": "2025-10-13T21:16:00Z"
  },
  {
    "title": "Natalie Portman Reflects on the End of Gaza War: ‘Very Emotional Day’",
    "description": "\"The release and the swap of the prisoners and the hostages is really a momentous day,\" she adds\nThe post Natalie Portman Reflects on the End of Gaza War: ‘Very Emotional Day’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/natalie-portman-hamas-israel-cease-fire-hostage-release/",
    "timestamp": "2025-10-13T21:14:20Z"
  },
  {
    "title": "Alleged 'Trump Insider Whale' Denies Insider Trading, Opens New $340 Million Bitcoin Short",
    "description": "A whale that earned millions shorting Bitcoin and Ethereum right before Friday's crash is back at it—and denies being a Trump insider.",
    "link": "https://decrypt.co/344137/alleged-trump-insider-whale-denies-insider-trading-opens-340-million-bitcoin-short",
    "timestamp": "2025-10-13T21:13:26Z"
  },
  {
    "title": "Trump takes a victory lap as Gaza peace deal is signed: From the Politics Desk",
    "description": "If each step toward a lasting peace is successful, it will take days, months, years and perhaps decades to assess the full scope of the success of the deal to end the war in Gaza that President Donald Trump brokered, blessed and signed.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-victory-lap-gaza-peace-deal-politics-desk-rcna237409",
    "timestamp": "2025-10-13T21:11:54Z"
  },
  {
    "title": "Chuck Schumer Praises Trump For Helping to Free 'Last Living Hostages' Held by Hamas",
    "description": "Senate Minority Leader Chuck Schumer (D-NY) praised President Donald Trump and his administration for helping to make happen the release and safe return of 20 living Israeli hostages.\nThe post Chuck Schumer Praises Trump For Helping to Free ‘Last Living Hosta…",
    "link": "https://www.breitbart.com/politics/2025/10/13/chuck-schumer-praises-trump-for-helping-to-free-last-living-hostages-held-by-hamas/",
    "timestamp": "2025-10-13T21:09:30Z"
  },
  {
    "title": "Trump Strikes Again: AstraZeneca's Surprise Drug Deal Could Shake Big Pharma's Global Pricing Power",
    "description": "AstraZeneca joins Pfizer in cutting Medicaid prices as Trump pushes for a global reset in drug cost dynamics.",
    "link": "https://finance.yahoo.com/news/trump-strikes-again-astrazenecas-surprise-210726156.html",
    "timestamp": "2025-10-13T21:07:26Z"
  },
  {
    "title": "Final living Israeli hostages freed as Donald Trump pushes his Middle East peace process",
    "description": "US president applauded in Knesset over ceasefire deal, asks for pardon for Binyamin Netanyahu",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/13/final-israeli-hostages-freed-as-donald-trump-pushes-his-middle-east-peace-process/",
    "timestamp": "2025-10-13T21:07:22Z"
  },
  {
    "title": "Chicago’s Ex-Top Cop Busts Gov. Pritzker for 'Ironic' Safe Neighborhood Video",
    "description": "Former Chicago Police Superintendent Garry McCarthy criticized Illinois Democrat Governor J.B. Pritzker for his anti-Trump video.\nThe post Chicago’s Ex-Top Cop Busts Gov. Pritzker for ‘Ironic’ Safe Neighborhood Video appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/13/chicagos-ex-top-cop-busts-gov-pritzker-for-ironic-safe-neighborhood-video/",
    "timestamp": "2025-10-13T21:06:03Z"
  },
  {
    "title": "Chris Christie Accuses Trump of Using Justice Department Like a Mob Boss: ‘Executes Hits’ on Political Enemies",
    "description": "Ex-New Jersey Gov. Chris Christie accused President Trump of using the Justice Department like a mafia crime boss would — to execute \"hits\" against his enemies.\nThe post Chris Christie Accuses Trump of Using Justice Department Like a Mob Boss: ‘Executes Hits’…",
    "link": "https://www.mediaite.com/media/news/chris-christie-accuses-trump-of-using-justice-department-like-a-mob-boss-executes-hits-on-political-enemies/",
    "timestamp": "2025-10-13T21:02:59Z"
  },
  {
    "title": "Pentagon hoarding rare earths amid China export curbs – FT",
    "description": "The US military is reportedly seeking to purchase up to $1 billion worth of minerals that are vital for the production of weapons Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626389-us-hoarding-rare-earths-china-export-controls/",
    "timestamp": "2025-10-13T21:02:36Z"
  },
  {
    "title": "‘Where the hell are you?’ Pro-Palestine activists in U.S. hammered for vanishing after Trump gives them what they want with Mideast peace",
    "description": "'You stuck in your little tent in Columbia? Did your balls fall off? Probably, actually, as a prerequisite to being part of these protests'",
    "link": "https://www.wnd.com/2025/10/where-hell-are-you-pro-palestine-activists-u/",
    "timestamp": "2025-10-13T21:02:10Z"
  },
  {
    "title": "Savvy politicians know how to ‘perform’ authenticity – the Jacinda Ardern doco offers a masterclass",
    "description": "The award-winning documentary Prime Minister showcases a politician capable of blending the ordinary and extraordinary – a key to success on both the left and right.",
    "link": "https://theconversation.com/savvy-politicians-know-how-to-perform-authenticity-the-jacinda-ardern-doco-offers-a-masterclass-267091",
    "timestamp": "2025-10-13T21:00:07Z"
  },
  {
    "title": "Why Elizabeth Warren-Created Agency is Hiring Amid Government Shutdown",
    "description": "In the middle of a government shutdown, as federal employees are facing layoffs, one agency is hiring.  The Consumer Financial Protection Bureau—the brainchild of Massachusetts... Read More\nThe post Why Elizabeth Warren-Created Agency is Hiring Amid Governmen…",
    "link": "https://www.dailysignal.com/2025/10/13/why-elizabeth-warren-created-agency-is-hiring-amid-government-shutdown/",
    "timestamp": "2025-10-13T21:00:00Z"
  },
  {
    "title": "World War II Was a Noble Cause—Anything Else Is Ahistorical",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post World War II Was a Noble Cause—Anything Else Is Ahistorical appeared fi…",
    "link": "https://www.dailysignal.com/2025/10/13/world-war-ii-was-a-noble-cause-anything-else-is-ahistorical/",
    "timestamp": "2025-10-13T21:00:00Z"
  },
  {
    "title": "CNN’s Amanpour claims hostages were treated better than Gazans, then apologizes",
    "description": "CNN’s Christiane Amanpour apologizes for saying Hamas “probably” treated hostages better than Gazans. Critics condemned the remark as pro-Hamas and insensitive to victims.",
    "link": "https://www.israelnationalnews.com/news/416249",
    "timestamp": "2025-10-13T20:59:14Z"
  },
  {
    "title": "Released Israeli Hostage Eliya Cohen Says Trump Is a Hero in Israel",
    "description": "Eliya Cohen -- formerly a hostage in Gaza -- tells TMZ President Donald Trump has gained massive popularity in Israel thanks to the new peace deal ... but Prime Minister Benjamin Netanyahu? Not so much. Cohen joined us on \"TMZ Live\" Monday, saying…\n Permalink",
    "link": "https://www.tmz.com/2025/10/13/eliya-cohen-israel-hostage-gaza-trump-hero/",
    "timestamp": "2025-10-13T20:57:48Z"
  },
  {
    "title": "Nothing. Just Ivanka standing there as if she single-handedly brokered peace in the Middle East [Facepalm]",
    "description": "Nothing. Just Ivanka standing there as if she single-handedly brokered peace in the Middle East",
    "link": "https://www.fark.com/comments/13843580/Nothing-Just-Ivanka-standing-there-as-if-she-single-handedly-brokered-peace-in-Middle-East",
    "timestamp": "2025-10-13T20:57:46Z"
  },
  {
    "title": "North Carolina GOP announce plans to vote on new House map amid nationwide redistricting battle",
    "description": "The plan announced Monday comes amid an emerging mid-decade battle nationally between Republicans and Democrats seeking advantage in the way U.S. House districts are drawn in several states for the 2026 session.",
    "link": "https://www.pbs.org/newshour/politics/north-carolina-gop-announce-plans-to-vote-on-new-house-map-amid-nationwide-redistricting-battle",
    "timestamp": "2025-10-13T20:57:35Z"
  },
  {
    "title": "Five key takeaways from Donald Trump’s Gaza remarks in Middle East",
    "description": "Trump takes credit for ceasefire agreement and promotes 'a new Middle East' without addressing rights of Palestinians.",
    "link": "https://www.aljazeera.com/news/2025/10/13/five-key-takeaways-from-donald-trumps-gaza-remarks-in-middle-east",
    "timestamp": "2025-10-13T20:57:35Z"
  },
  {
    "title": "Katie Porter’s meltdown proves candidates can’t be shamed into quitting anymore",
    "description": "In the digital era, candidates have no incentive to drop out; given the ocean of information, any attention is now good attention.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/katie-porter-videos-california-governor-race-rcna236993",
    "timestamp": "2025-10-13T20:57:32Z"
  },
  {
    "title": "CNN’s Amanpour Claims Israeli Hostages ‘Treated Better’ Than Gazans, Apologizes After Backlash",
    "description": "CNN anchor Christiane Amanpour claimed that the Israeli hostages were probably 'treated better\" than most people living in Gaza.",
    "link": "https://dailycaller.com/2025/10/13/cnn-christiane-amanpour-israeli-hostages-palestinians/",
    "timestamp": "2025-10-13T20:53:27Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.10.13 WEB H264-onX",
    "description": "Season , Episode – \"\"We KNOW What's Going To Happen!\" Hostages Released as Trump Secures Gaza Peace Deal\"President Donald Trump landed in Israel today as the last 20 living Israeli hostages were finally released from two years of Hamas captivity. Relatives an…",
    "link": "https://post.rlsbb.to/piers-morgan-uncensored-2025-10-13-web-h264-onx/",
    "timestamp": "2025-10-13T20:52:18Z"
  },
  {
    "title": "Trump Jr. Goads View Host to Uphold Bet On If Trump Gets All the Hostages Freed",
    "description": "Donald Trump Jr. called Alyssa Farah Griffin's bluff Monday, reminding The View co-host of a bargain she made last December about the Israeli hostages.\nThe post Trump Jr. Goads View Host to Uphold Bet On If Trump Gets All the Hostages Freed first appeared on …",
    "link": "https://www.mediaite.com/media/news/trump-jr-goads-view-host-to-uphold-bet-on-if-trump-gets-all-the-hostages-freed/",
    "timestamp": "2025-10-13T20:47:58Z"
  },
  {
    "title": "How immigration enforcement turned sleepy Broadview into a chaotic, militarized town",
    "description": "An intensive immigration operation ordered by President Donald Trump has quickly transformed Broadview, Illinois, into the beating hot center of the resistance.",
    "link": "https://www.nbcnews.com/news/us-news/broadview-illinois-ice-protests-chicago-immigration-rcna236519",
    "timestamp": "2025-10-13T20:46:05Z"
  },
  {
    "title": "Top Dems largely quiet as Trump headlines historic peace summit in Egypt, Israeli hostages set free",
    "description": "Many top Democrats kept quiet as President Trump attended the historic “Summit for Peace” in Egypt and Hamas released the last of the 20 living Israeli hostages it held in captivity.",
    "link": "https://nypost.com/2025/10/13/us-news/top-dems-largely-quiet-as-trump-headlines-historic-peace-summit-in-egypt-israeli-hostages-set-free/",
    "timestamp": "2025-10-13T20:45:44Z"
  },
  {
    "title": "Leon Panetta Already Pushing For US Boots On Ground In Gaza",
    "description": "Leon Panetta advocated for an American military presence in Gaza mere days after President Donald Trump announced an agreement in Israel-Hamas war.",
    "link": "https://dailycaller.com/2025/10/13/leon-panetta-already-pushing-us-troops-gaza/",
    "timestamp": "2025-10-13T20:45:09Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "The World Food Programme (WFP) warned that women, children and displaced families are hardest hit by Haiti’s prolonged crisis, which is driving hunger and malnutrition. A record of 5.7 million people - 51 per cent of the population - are experiencing acute le…",
    "link": "https://press.un.org/en/2025/db251013.doc.htm",
    "timestamp": "2025-10-13T20:44:12Z"
  },
  {
    "title": "Citi Plans to Launch Crypto Custody Services in 2026: CNBC",
    "description": "Citi will offer crypto custody services in 2026, becoming the latest mainstream financial entity to delve deeper into crypto, CNBC reported.",
    "link": "https://decrypt.co/344140/citi-plans-launch-crypto-custody-services-2026-cnbc",
    "timestamp": "2025-10-13T20:42:42Z"
  },
  {
    "title": "Ceasefire Sparks Fresh Calls for Global Media Access to Gaza",
    "description": "Since a fragile ceasefire in the Gaza Strip began on Friday, press freedom advocates and critics of Israel's genocidal assault have issued new calls for international media access to the decimated Palestinian territory, including the largest Muslim civil righ…",
    "link": "https://www.commondreams.org/news/journalism-in-gaza",
    "timestamp": "2025-10-13T20:41:25Z"
  },
  {
    "title": "Celebrating a hard-won ceasefire, Trump pushes for 'lasting harmony' in the Middle East",
    "description": "A jubilant Donald Trump celebrated a hard-won ceasefire in the conflict between Israel and Hamas militants on Monday.",
    "link": "https://www.nbcnews.com/politics/donald-trump/ceasefire-trump-harmony-middle-east-rcna237241",
    "timestamp": "2025-10-13T20:39:23Z"
  },
  {
    "title": "Fact Check: Did Egypt's Sisi Skip 2016 Clinton Meeting After Seeing Trump?",
    "description": "President Donald Trump claimed Monday that Egypt's president had skipped a meeting with his 2016 rival, Clinton.",
    "link": "https://biztoc.com/x/9c00e695a1edb5aa",
    "timestamp": "2025-10-13T20:38:24Z"
  },
  {
    "title": "Trump Administration Reportedly Planning To Sell Student Loan Debts To Private Investors: What Would Happen?",
    "description": "United States President Donald Trump's administration is reportedly considering selling off student loan debts to private investors.",
    "link": "https://www.ibtimes.com/trump-administration-reportedly-planning-sell-student-loan-debts-private-investors-what-would-3786822",
    "timestamp": "2025-10-13T20:34:16Z"
  },
  {
    "title": "WATCH: Johnson responds to critics on why he won’t call House back for shutdown negotiations",
    "description": "Johnson says he “won’t negotiate” with Democrats until they hit pause on their health care demands and reopen the government.",
    "link": "https://www.pbs.org/newshour/politics/watch-johnson-responds-to-critics-on-why-he-wont-call-house-back-for-shutdown-negotiations",
    "timestamp": "2025-10-13T20:34:10Z"
  },
  {
    "title": "Bill Clinton says Trump and others 'deserve great credit' for Israel-Hamas ceasefire",
    "description": "Bill Clinton credits President Donald Trump and his administration for keeping Israel-Hamas ceasefire negotiations on track until an agreement was reached.",
    "link": "https://www.foxnews.com/politics/bill-clinton-says-trump-others-deserve-great-credit-israel-hamas-ceasefire",
    "timestamp": "2025-10-13T20:34:10Z"
  },
  {
    "title": "Trump’s Handpicked Prosecutor Outside DC Cleans Out Office In Shock Move",
    "description": "President Donald Trump's handpicked U.S. prosecutor recently removed a senior prosecutor in Virginia as she continues a radical reshaping of the office.\nThe post Trump’s Handpicked Prosecutor Outside DC Cleans Out Office In Shock Move first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/trumps-handpicked-prosecutor-outside-dc-cleans-out-office-in-shock-move/",
    "timestamp": "2025-10-13T20:32:11Z"
  },
  {
    "title": "Why ‘no tax on tips’ may have limited benefits for California workers",
    "description": "Experts doubt the effectiveness of ‘no tax on tips,’ especially for California workers who are facing cuts in other benefits.",
    "link": "https://www.kpbs.org/news/politics/2025/10/13/why-no-tax-on-tips-may-have-limited-benefits-for-california-workers",
    "timestamp": "2025-10-13T20:31:41Z"
  },
  {
    "title": "As Palestinians return to ruins, will Trump’s ceasefire hold?",
    "description": "Will the fragile ceasefire hold as US President Donald Trump arrives in the Middle East?",
    "link": "https://www.aljazeera.com/video/the-take-2/2025/10/13/at_tt_pal_ceasefirelatest_video_v3",
    "timestamp": "2025-10-13T20:30:01Z"
  },
  {
    "title": "S&P 500 Gains & Losses Today: Broadcom Stock, Chipmaker Shares Surge; Casino Stocks Fall",
    "description": "A chipmaker became the latest to enjoy a bounce after announcing an AI deal on Monday, Oct. 13, 2025, while storms in a key region weighed on casino and...",
    "link": "https://www.investopedia.com/s-and-p-500-gains-and-losses-today-broadcom-stock-chipmaker-shares-surge-casino-stocks-fall-11829038",
    "timestamp": "2025-10-13T20:29:18Z"
  },
  {
    "title": "Niece living in home at center of Letitia James' fraud indictment EXPOSED as 'fugitive'... with years-long rap sheet",
    "description": "The tenant living in the Virginia house at the center of New York Attorney General Letitia James's federal indictment is a 'fugitive' from justice, the Daily Mail can exclusively reveal. James has reportedly allowed her grandniece Nakia Thompson - along with …",
    "link": "https://freerepublic.com/focus/f-backroom/4346158/posts",
    "timestamp": "2025-10-13T20:29:01Z"
  },
  {
    "title": "Who Is Tom Homan? What to Know About the Border Czar",
    "description": "The United States has a complicated, evolving history with its borders ... and Tom Homan's been in charge of them since 2024. The \"border czar\" -- an informal term designating executive oversight of managing the country's land, air and sea borders,…\n Permalink",
    "link": "https://www.tmz.com/2025/10/13/tom-homan-border-czar/",
    "timestamp": "2025-10-13T20:28:30Z"
  },
  {
    "title": "North Carolina GOP announces plans to vote on new House map amid nationwide redistricting battle",
    "description": "North Carolina Republican legislative leaders announced plans Monday to vote next week on redrawing the state’s US House district map, with a likely aim to...",
    "link": "https://www.cnn.com/2025/10/13/politics/north-carolina-gop-redistricting",
    "timestamp": "2025-10-13T20:27:38Z"
  },
  {
    "title": "Israeli hostages and Palestinian detainees freed as Trump hails 'historic dawn' in Middle East",
    "description": "A major hostage and prisoner exchange marks a significant step towards ending two years of war in Gaza.",
    "link": "https://www.bbc.com/news/articles/c740jx07vz0o",
    "timestamp": "2025-10-13T20:26:43Z"
  },
  {
    "title": "How China’s threats to clamp down on rare earth exports could wreak havoc on US tech giants, military contractors",
    "description": "The supply chains of tech giants like Apple, car firms like Tesla and even the US military will be thrown into chaos if China follows through on threats to further choke off shipments of rare earth elements, according to experts.",
    "link": "https://nypost.com/2025/10/13/business/how-chinas-threats-to-clamp-down-on-rare-earth-exports-could-wreak-havoc-on-us-tech-giants-military-contractors/",
    "timestamp": "2025-10-13T20:26:30Z"
  },
  {
    "title": "'Phase zero' of WW3...",
    "description": "'Phase zero' of WW3...\r\n\n \n \n \n (Top headline, 4th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:ZELENSKY TO DC ON FRIDAY...\r\nTomahawks to Kyiv?\r\nKremlin warns...\r\nPoland Says It's Ready...\r\nBehind Russia battlefield drone surge? Chinese factories...",
    "link": "http://www.the-sun.com/news/15336313/putin-russia-phase-zero-war-nato-west/",
    "timestamp": "2025-10-13T20:25:36Z"
  },
  {
    "title": "Venezuela announces closure of Norway, Australia embassies",
    "description": "CARACAS/OSLO (Reuters) -Venezuela's government said on Monday it will close its embassies in Norway and Australia and open new ones in Burkina Faso and...",
    "link": "https://www.yahoo.com/news/articles/venezuela-announces-closure-norway-australia-202445734.html",
    "timestamp": "2025-10-13T20:24:45Z"
  },
  {
    "title": "Marjorie Taylor Greene says Trump's tariffs are causing problems for American manufacturers",
    "description": "The Georgia congresswoman said that manufacturers have told her that they're having problems due to Trump's tariffs.",
    "link": "https://www.businessinsider.com/marjorie-taylor-greene-trump-tariffs-cause-problems-for-manufacturers-2025-10",
    "timestamp": "2025-10-13T20:22:56Z"
  },
  {
    "title": "Crypto Expert Reveals Massive Buy Opportunity After $19.31 Billion In Liquidations",
    "description": "As cryptos undergo the biggest liquidation event in their 16-year history, pundits are pointing to fresh buying opportunities for retail and institutional investors.",
    "link": "https://zycrypto.com/crypto-expert-reveals-massive-buy-opportunity-after-19-31-billion-in-liquidations/",
    "timestamp": "2025-10-13T20:22:29Z"
  },
  {
    "title": "Watch These Bitcoin Price Levels as Cryptocurrency Rebounds From Sell-Off",
    "description": "Bitcoin has bounced back from a steep downturn on Friday but remains well below the record high it hit a week ago. Monitor these critical chart levels.",
    "link": "https://www.investopedia.com/watch-these-bitcoin-price-levels-as-cryptocurrency-rebounds-from-sell-off-11828809",
    "timestamp": "2025-10-13T20:22:18Z"
  },
  {
    "title": "Hey JD Vance! Hey JD! What Did Tom Homan Do With The FBI’s Bag Of Cash? Hey JD!",
    "description": "Just still asking questions again some more!",
    "link": "https://www.wonkette.com/p/hey-jd-vance-hey-jd-what-did-tom",
    "timestamp": "2025-10-13T20:20:24Z"
  },
  {
    "title": "'Mealy-Mouthed Lies': Johnson Decimated Over Health Care Claims",
    "description": "Speaker of the House Mike Johnson is under fire over claims he made about Obamacare allegedly failing Americans, and his desire to repeal the Affordable Care Act. Asked if he supported repealing ObamaCare, Johnson told reporters that he believed the health ca…",
    "link": "https://www.thenewcivilrightsmovement.com/2025/10/mealy-mouthed-lies-johnson-decimated-over-health-care-claims/",
    "timestamp": "2025-10-13T20:16:49Z"
  },
  {
    "title": "Hamas-Backing Russia Trashes Gaza Peace Plan: 'Skepticism Remains'",
    "description": "Russian Foreign Minister Sergey Lavrov held a press conference with Arab media on Monday in the context of President Donald Trump's successful mediating to end the war in Gaza, downplaying the significance of that monumental diplomatic event.\nThe post Hamas-B…",
    "link": "https://www.breitbart.com/middle-east/2025/10/13/hamas-backing-russia-trashes-gaza-peace-plan-skepticism-remains/",
    "timestamp": "2025-10-13T20:16:35Z"
  },
  {
    "title": "Starmer praises Trump for Gaza peace deal",
    "description": "United Kingdom Prime Minister Keir Starmer praised United States President Donald Trump for securing peace in the Gaza Strip.\"President Trump, this is your achievement. I thank you for your tireless e...",
    "link": "https://biztoc.com/x/36449f45831bc56b",
    "timestamp": "2025-10-13T20:16:28Z"
  },
  {
    "title": "WATCH: ‘At long last we have peace in the Middle East,’ Trump declares at Gaza summit",
    "description": "President Donald Trump celebrated the ceasefire between Hamas and Israel at a summit for Gaza on Monday.",
    "link": "https://biztoc.com/x/2da38dfe60b5d4cc",
    "timestamp": "2025-10-13T20:16:24Z"
  },
  {
    "title": "Trump’s Nobel peace prize campaign is the least important part of the Israel-Hamas deal",
    "description": "If the Gaza ceasefire holds, the administration deserves much credit. But the fixation on Trump getting a prize distracts from things that actually matter.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-israel-hamas-deal-nobel-peace-prize-media-rcna236988",
    "timestamp": "2025-10-13T20:15:41Z"
  },
  {
    "title": "Obama scolds Hispanic Trump supporters who worried about inflation, says nation being 'tested' under Trump",
    "description": "Former President Barack Obama scolded Hispanic male voters for supporting President Donald Trump due to concerns about inflation and said the country was being \"tested.\"",
    "link": "https://www.foxnews.com/media/obama-scolds-hispanic-trump-supporters-who-worried-about-inflation-says-nation-being-tested-under-trump",
    "timestamp": "2025-10-13T20:14:40Z"
  },
  {
    "title": "Trump hails 'tremendous day for Middle East' as leaders sign Gaza declaration",
    "description": "SHARM EL-SHEIKH, Egypt: US President Donald Trump hailed a “tremendous day for the Middle East” on Monday (Oct 13) as he and regional leaders signed a declaration to cement a ceasefire in Gaza, hours a",
    "link": "https://www.channelnewsasia.com/world/trump-hails-tremendous-day-middle-east-leaders-sign-gaza-declaration-5399551",
    "timestamp": "2025-10-13T20:14:29Z"
  },
  {
    "title": "Trump in 'Exceptional Health,' Gets a COVID Booster, His Doctor Says",
    "description": "Evaluation included high-level imaging, done in advance of Trump's upcoming trips overseasPresident Donald Trump is in \"exceptional health,\" his physician said after he underwent a checkup that included lab tests and preventive health assessments at Walter Re…",
    "link": "https://freerepublic.com/focus/f-news/4346154/posts",
    "timestamp": "2025-10-13T20:10:54Z"
  },
  {
    "title": "CNN’s Christiane Amanpour Apologizes for ‘Insensitive’ and ‘Wrong’ Comments About Israeli Hostages",
    "description": "CNN's Christiane Amanpour apologized on Monday afternoon for what she admitted were \"insensitive and wrong\" comments she made earlier that morning.\nThe post CNN’s Christiane Amanpour Apologizes for ‘Insensitive’ and ‘Wrong’ Comments About Israeli Hostages fir…",
    "link": "https://www.mediaite.com/media/news/cnns-christiane-amanpour-apologizes-for-insensitive-and-wrong-comments-about-israeli-hostages/",
    "timestamp": "2025-10-13T20:08:27Z"
  },
  {
    "title": "Donald Trump: ‘Prayers of Millions Have Finally Been Answered’ with Signing of Peace Agreement",
    "description": "President Donald Trump said Monday that Israel's and Hamas's agreement to enter the first stage of a peace deal is the answer to the prayers of millions.\nThe post Donald Trump: ‘Prayers of Millions Have Finally Been Answered’ with Signing of Peace Agreement a…",
    "link": "https://www.breitbart.com/middle-east/2025/10/13/donald-trump-prayers-millions-have-finally-been-answered-signing-peace-agreement/",
    "timestamp": "2025-10-13T20:07:51Z"
  },
  {
    "title": "North Carolina GOP announce plans to vote on new House map amid nationwide redistricting battle",
    "description": "Only one of the state’s House districts is considered a swing district and could be targeted by the GOP.",
    "link": "https://www.bostonherald.com/2025/10/13/north-carolina-redistricting/",
    "timestamp": "2025-10-13T20:07:17Z"
  },
  {
    "title": "Binance airdrops $45M in BNB to memecoin traders hit by market crash",
    "description": "Binance unveils a $45M BNB airdrop to aid memecoin traders hit by last week’s $20B liquidation event, amid backlash over outages and token depegs.",
    "link": "https://cointelegraph.com/news/binance-45m-reload-airdrop-memecoin-traders-market-volatility",
    "timestamp": "2025-10-13T20:07:05Z"
  },
  {
    "title": "Trump’s Hunt for Antifa Is Already Falling Apart",
    "description": "Antifa be warned: The Trump administration is coming for you, but first they have to speak with some podcasters.Conservative podcaster Glenn Beck insisted Monday that the FBI was turning over “every single stone” to locate members of the famously decentralize…",
    "link": "https://newrepublic.com/post/201710/donald-trump-hunt-antifa-fbi-glenn-beck",
    "timestamp": "2025-10-13T20:06:54Z"
  },
  {
    "title": "After 738 days, Israelis share mixed emotions in Hostages Square as captives return home",
    "description": "Israelis gather to watch a historic day unfold as hostages held for two years are finally set free.",
    "link": "https://www.abc.net.au/news/2025-10-14/israelis-shared-mixed-emotions-in-hostage-square/105887218",
    "timestamp": "2025-10-13T20:06:31Z"
  }
]