[
  {
    "title": "Secret Service suspends 6 agents over Trump rally shooting",
    "description": "Six United States Secret Service agents have been suspended for their roles in security failures tied to the July 2024 attempted assassination of then-presidential candidate Donald Trump in Butler, Pe...",
    "link": "https://biztoc.com/x/2c5e03724d251710",
    "timestamp": "2025-07-10T02:54:45Z"
  },
  {
    "title": "Video\nTariffs hurt bridal industry due to reliance on overseas market\n4:48",
    "description": "",
    "link": "https://biztoc.com/x/9ba4758a885a9b87",
    "timestamp": "2025-07-10T02:54:19Z"
  },
  {
    "title": "Trump taps Sean Duffy to serve as interim NASA chief",
    "description": "Former Wisconsin congressman Sean Duffy enthusiastically accepts interim administrator role: 'Let's launch.'",
    "link": "https://nypost.com/2025/07/09/us-news/trump-taps-sean-duffy-to-serve-as-interim-nasa-chief/",
    "timestamp": "2025-07-10T02:47:31Z"
  },
  {
    "title": "6 Secret Service agents suspended over conduct during attempted Trump assassination",
    "description": "Six agents were suspended by the U.S. Secret Service for failures connected to last year's attempted assassination of then-presidential candidate Donald Trump in Butler, Pennsylvania, an official told ABC News. The personnel moves were confirmed four days shy…",
    "link": "https://freerepublic.com/focus/f-news/4327834/posts",
    "timestamp": "2025-07-10T02:47:14Z"
  },
  {
    "title": "Trump 'visibly' shows 'classic sign of dementia,' expert warns as health fears grow - NewsBreak",
    "description": "As the oldest person ever inaugurated as President of the US, serious question about Donald Trump's mental ability have been raised with even people in his",
    "link": "https://www.newsbreak.com/share/4094700790185-trump-visibly-shows-classic-sign-of-dementia-expert-warns-as-health-fears-grow?_f=app_share&amp;pd=04sXyM5Z&amp;lang=en_US&amp;send_time=1752115300&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.25.0.37%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v1%2Cns_foryou_rank_exp_25q2-v5%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_model_exp_25q2_v2-v3&amp;s=i2",
    "timestamp": "2025-07-10T02:44:45Z"
  },
  {
    "title": "Trump assails ex-FBI, CIA heads amid reports of criminal probe",
    "description": "US president attacks John Brennan and James Comey amid reports two men are under investigation over Trump-Russia probe.",
    "link": "https://www.aljazeera.com/news/2025/7/10/trump-assails-ex-fbi-cia-heads-amid-reports-of-criminal-probe",
    "timestamp": "2025-07-10T02:44:10Z"
  },
  {
    "title": "Trump says 50% tariff on copper will begin Aug. 1",
    "description": "U.S. President Donald Trump said Wednesday that the 50% tariff on copper imports, which he had announced the previous day, will take effect on Aug. 1.\nThe decision was made after he received a national security assessment, Trump said in a post on Truth Social…",
    "link": "https://biztoc.com/x/75cabc8cf7300929",
    "timestamp": "2025-07-10T02:43:36Z"
  },
  {
    "title": "BRILYN HOLLYHAND: Elon, Don’t Be An Idiot: A Third Party Is A Gift To The Left",
    "description": "Let me say this as plainly as possible: Elon Musk starting a third party in 2025 would be the dumbest, most self-destructive political move since Ross Perot handed Bill Clinton the keys to the White House in the ’90s. It wouldn’t be bold. It wouldn’t be visio…",
    "link": "https://dailycaller.com/2025/07/09/opinion-elon-dont-be-an-idiot-a-third-party-is-a-gift-to-the-left-brilyn-hollyhand/",
    "timestamp": "2025-07-10T02:43:18Z"
  },
  {
    "title": "Syria’s government and Kurds still at odds over merging forces after latest talks, US envoy says",
    "description": "A U.S. envoy says that Syria’s central government and the Kurds remain at odds over plans on merging their forces after the latest round of talks",
    "link": "https://abcnews.go.com/US/wireStory/syrias-government-kurds-odds-merging-forces-after-latest-123621017",
    "timestamp": "2025-07-10T02:38:25Z"
  },
  {
    "title": "Source: Houthis Will Be Taken Out by Arab-Led Ground Force",
    "description": "A ground force led by Arab nations, possibly including a Yemenite force, will be necessary to remove the Houthis as a regional threat, according to a senior Israeli government official.\nThe post Source: Houthis Will Be Taken Out by Arab-Led Ground Force appea…",
    "link": "https://www.breitbart.com/middle-east/2025/07/09/source-houthis-will-be-taken-out-by-arab-led-ground-force/",
    "timestamp": "2025-07-10T02:34:24Z"
  },
  {
    "title": "Six Secret Service agents suspended for Trump assassination attempt at Butler rally",
    "description": "Six US Secret Service agents face suspension. This is due to security failures during an assassination attempt on Donald Trump in Pennsylvania. The incident happened during a campaign rally. A firefighter died, and two others were injured. An independent revi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/six-secret-service-agents-suspended-for-trump-assassination-attempt-at-butler-rally/articleshow/122354180.cms",
    "timestamp": "2025-07-10T02:34:12Z"
  },
  {
    "title": "These Republicans fought for green energy tax credits. Trump’s latest order could threaten them",
    "description": "WASHINGTON — A group of Senate Republicans are cautiously watching to see if a recent executive order will undo progress to temporarily preserve green energy tax credits in President Donald Trump’s massive tax package.\nTrump signed an executive order on Monda…",
    "link": "https://biztoc.com/x/fbde81b9b773bf4f",
    "timestamp": "2025-07-10T02:32:32Z"
  },
  {
    "title": "Asia trades mixed after Trump tariffs, Japanese data",
    "description": "Asia-Pacific markets traded mixed on Thursday after United States President Donald Trump instituted a 50% tariff on Brazil.Additionally, the Bank of Japan published a report, which showed that the cou...",
    "link": "https://biztoc.com/x/d958fc61cf9c1874",
    "timestamp": "2025-07-10T02:32:14Z"
  },
  {
    "title": "Trump Names Sean Duffy Interim Administrator of NASA: 'Will Be a Fantastic Leader'",
    "description": "President Donald Trump named Transportation Secretary Sean Duffy as the Interim Administrator of the National Aeronautics and Space Administration (NASA), stating that he would \"be a fantastic leader.\"\nThe post Trump Names Sean Duffy Interim Administrator of …",
    "link": "https://www.breitbart.com/politics/2025/07/09/trump-names-sean-duffy-interim-administrator-nasa/",
    "timestamp": "2025-07-10T02:29:29Z"
  },
  {
    "title": "Gaza permanent ceasefire 'questionable', says senior Israeli official",
    "description": "A senior Israeli official has issued a less-than-optimistic assessment of the permanency of any ceasefire in Gaza.",
    "link": "https://news.sky.com/story/gaza-permanent-ceasefire-questionable-says-senior-israeli-official-13394795",
    "timestamp": "2025-07-10T02:28:00Z"
  },
  {
    "title": "Gaza permanent ceasefire 'questionable' - but possible 'within weeks, not a day', says senior Israeli official",
    "description": "A senior Israeli official has issued a less-than-optimistic assessment of the permanency of any ceasefire in Gaza.",
    "link": "https://news.sky.com/story/gaza-permanent-ceasefire-questionable-but-possible-within-weeks-not-a-day-says-senior-israeli-official-13394795",
    "timestamp": "2025-07-10T02:28:00Z"
  },
  {
    "title": "Johnson Amendment defanged? Trump backs IRS on places of worship backing political leaders",
    "description": "Donald Trump has endorsed the IRS's recent decision to allow houses of worship to endorse political candidates without jeopardizing their tax-exempt status, potentially weakening the Johnson Amendment. This move, stemming from a settlement with Texas churches…",
    "link": "https://economictimes.indiatimes.com/news/international/us/johnson-amendment-defanged-trump-backs-irs-on-places-of-worship-backing-political-leaders/articleshow/122354084.cms",
    "timestamp": "2025-07-10T02:24:31Z"
  },
  {
    "title": "'Jeopardizes All Of It': Ex-Mike Pence Aide Knocks Trump Over These 'Confusing' Moves",
    "description": "Marc Short said the president's trade agenda is \"starkly different\" from that of the first administration.",
    "link": "https://www.huffpost.com/entry/pence-aide-marc-short-trump-tariffs_n_686f0275e4b045e0e37ebd84",
    "timestamp": "2025-07-10T02:22:39Z"
  },
  {
    "title": "Miranda Devine: Susie Wiles brings calm to Trump admin—helping the president rack up wins",
    "description": "Donald Trump calls her the “Ice Maiden.” But in person, the very private White House chief of staff, Susie Wiles, is warm and hospitable — as long as you don’t cross her.",
    "link": "https://nypost.com/2025/07/09/opinion/miranda-devine-susie-wiles-brings-calm-to-trump-adminhelping-the-president-rack-up-wins/",
    "timestamp": "2025-07-10T02:21:37Z"
  },
  {
    "title": "CNBC Daily Open: More tariff letters are out, but investors have their eyes on AI",
    "description": "Just this morning Singapore time, U.S. President Donald Trump said that the 50% tariff on copper imports, which he announced earlier on Tuesday, will begin on Aug. 1.\nOn Wednesday, Trump posted a fresh slate of tariff letters on goods from at least seven more…",
    "link": "https://biztoc.com/x/94c5eeb148d77141",
    "timestamp": "2025-07-10T02:21:04Z"
  },
  {
    "title": "Gold, Silver Prices Flat - Check Prices In Mumbai, Chennai, Other Cities",
    "description": "Gold and silver were trading flat on Wednesday as the safe haven demand for the metal slipped lower. US President Donald Trump imposed a fresh round of tariffs on seven countries on Wednesday, in addition to the earlier levies. Among the seven countries with …",
    "link": "https://www.ndtvprofit.com/markets/gold-silver-prices-flat-check-prices-in-mumbai-chennai-other-cities",
    "timestamp": "2025-07-10T02:19:58Z"
  },
  {
    "title": "Rubio to meet Russia's Lavrov in Kuala Lumpur, US official says",
    "description": "U.S. Secretary of State Marco Rubio is set to meet with Russian Foreign Minister Sergei Lavrov in Kuala Lumpur, amidst rising tensions as President Trump expresses frustration with Putin over the prolonged war in Ukraine. This meeting follows Trump's approval…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/rubio-to-meet-russias-lavrov-in-kuala-lumpur-us-official-says/articleshow/122354106.cms",
    "timestamp": "2025-07-10T02:17:48Z"
  },
  {
    "title": "Police: Woman Goes to Mar-a-Lago with Gun and 'Urgent Message' for Trump",
    "description": "A Florida woman has been arrested after arriving at President Donald Trump's Mar-a-Lago Club with a gun and \"an urgent message\" to deliver, according to police and local reports.\nThe post Police: Woman Goes to Mar-a-Lago with Gun and ‘Urgent Message’ for Trum…",
    "link": "https://www.breitbart.com/crime/2025/07/09/police-woman-mar-a-lago-gun-urgent-message-trump/",
    "timestamp": "2025-07-10T02:15:59Z"
  },
  {
    "title": "The Epstein Files Anticlimax Is Exposing Trump for Who He Really Is (Alex Shephard/New Republic)",
    "description": "Alex Shephard / New Republic:\nThe Epstein Files Anticlimax Is Exposing Trump for Who He Really Is … Donald Trump does not want to talk about Jeffrey Epstein.  Asked on Tuesday about his administration's refusal to release files related to the dead financier w…",
    "link": "https://www.memeorandum.com/250709/p150",
    "timestamp": "2025-07-10T02:15:00Z"
  },
  {
    "title": "Joe Biden's doctor refuses to answer Congress queries about former president’s health",
    "description": "Biden says claims he was not mentally fit at any point while in office are ‘ridiculous and false’.",
    "link": "https://7news.com.au/news/former-us-president-joe-bidens-ex-doctor-refuses-to-answer-congress-queries-c-19309264",
    "timestamp": "2025-07-10T02:12:52Z"
  },
  {
    "title": "Asia shares helped by Nvidia high as investors unfazed by Trump's tariff moves",
    "description": "SINGAPORE (Reuters) -Asian stocks rose slightly on Thursday, riding on optimism from Nvidia's brief rise to a world-record $4 trillion valuation and as...",
    "link": "https://finance.yahoo.com/news/asia-shares-helped-nvidia-high-021200609.html",
    "timestamp": "2025-07-10T02:12:00Z"
  },
  {
    "title": "Trump admin escalates Harvard battle, threatens subpoenas and accreditation loss",
    "description": "Trump administration intensifying its dispute with Harvard University, with the Department of Homeland Security set to issue subpoenas over alleged foreign student misconduct.",
    "link": "https://www.israelnationalnews.com/news/411425",
    "timestamp": "2025-07-10T02:11:19Z"
  },
  {
    "title": "Trump Sends Lula A Letter Imposing 50% Tariffs, Calls Bolsonaro Trial A 'Witch Hunt' — Brazil's President Hits Back: 'Will Not Accept Any Form Of Tutelage'",
    "description": "Tensions are flaring between the United States and Brazil following President Donald Trump’s threats of sweeping 50% tariffs on imports from the South American nation. \nWhat Happened: On Wednesday, Trump wrote a letter telling Brazilian President Luiz Inácio …",
    "link": "https://biztoc.com/x/e35bb5882780c572",
    "timestamp": "2025-07-10T02:09:54Z"
  },
  {
    "title": "Where does Trump's approval rating stand after tax bill passes? See the polls",
    "description": "Here’s what polls showed of Trump's approval rating after the president’s mega tax and spending bill was passed by Congress and signed into law.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/09/trump-approval-polls/84526896007/",
    "timestamp": "2025-07-10T02:07:57Z"
  },
  {
    "title": "Kyiv hit by new massive Russian drone attack, Ukraine officials say",
    "description": "At least two people were killed and 16 injured, with fires burning across Ukraine's capital, officials said.",
    "link": "https://www.bbc.co.uk/news/articles/cj3rvpe06rxo",
    "timestamp": "2025-07-10T02:02:27Z"
  },
  {
    "title": "CNBC Daily Open: More tariff letters are out, but investors have their eyes on AI",
    "description": "On Wednesday, Trump posted a fresh slate of letters announcing tariff on goods from at least seven more countries.",
    "link": "https://www.cnbc.com/2025/07/10/cnbc-daily-open-more-tariff-letters-but-investors-focus-on-ai-.html",
    "timestamp": "2025-07-10T02:02:13Z"
  },
  {
    "title": "Turkey’s Erdoğan bets big with high-stakes Kurdish gamble",
    "description": "As the president's traditional support wanes, he is seeking a risky deal with the Kurds to buy a political lifeline. But is there too much mutual mistrust for a deal?",
    "link": "https://www.politico.eu/article/abdullah-ocalan-pkk-recep-tayyip-erdogan-turkey-kurdistan/",
    "timestamp": "2025-07-10T02:01:00Z"
  },
  {
    "title": "American puzzle: Trump’s tariffs have resulted in an inflation paradox",
    "description": "Contrary to expectations, the US President’s tariff hikes are yet to show up in America’s cost-of-living data. Puzzling as this is, these are early days yet and trade shocks still risk setting off shudders of price instability.",
    "link": "https://www.livemint.com/opinion/online-views/trump-tariffs-inflation-slowdown-jerome-powell-federal-reserve-dollar-index-trade-war-consumer-prices-stagflation-retail-11752085948025.html",
    "timestamp": "2025-07-10T02:00:05Z"
  },
  {
    "title": "6 Secret Service agents suspended over conduct during attempted Trump assassination (Josh Margolin/ABC News)",
    "description": "Josh Margolin / ABC News:\n6 Secret Service agents suspended over conduct during attempted Trump assassination  —  The July 2024 incident left Trump's ear bloodied and a firefighter killed.  —  Former President Donald Trump is rushed offstage by Secret Service…",
    "link": "https://www.memeorandum.com/250709/p146",
    "timestamp": "2025-07-10T02:00:00Z"
  },
  {
    "title": "Trump’s BRICS warning to India adds new twist to trade deal",
    "description": "U.S. President Donald Trump said India could face an additional 10% tariff alongside other members of BRICS, which he has labeled \"anti-American.”",
    "link": "https://biztoc.com/x/32199f3b0cbee846",
    "timestamp": "2025-07-10T01:58:45Z"
  },
  {
    "title": "US issues sanctions against UN investigator probing abuses in Gaza",
    "description": "The Trump administration has announced it is issuing sanctions against an independent investigator tasked with probing human rights abuses in the Palestinian territories",
    "link": "https://abcnews.go.com/US/wireStory/us-issues-sanctions-investigator-probing-abuses-gaza-123622563",
    "timestamp": "2025-07-10T01:58:15Z"
  },
  {
    "title": "Trump Names Musk Foe Interim Head of NASA After Ditching Billionaire’s Ally for Role",
    "description": "President Donald Trump appointed Secretary of Transportation Sean Duffy the interim administrator of NASA in yet another blow to former ally Elon Musk.\nThe post Trump Names Musk Foe Interim Head of NASA After Ditching Billionaire’s Ally for Role first appeare…",
    "link": "https://www.mediaite.com/politics/trump-names-musk-foe-interim-head-of-nasa-after-ditching-billionaires-ally-for-role/",
    "timestamp": "2025-07-10T01:57:03Z"
  },
  {
    "title": "Trump’s BRICS warning to India adds new twist to trade deal",
    "description": "U.S. President Donald Trump said India could face an additional 10% tariff alongside other members of BRICS, which he has labeled \"anti-American.”",
    "link": "https://www.japantimes.co.jp/business/2025/07/10/trump-brics-india-trade-deal/",
    "timestamp": "2025-07-10T01:57:00Z"
  },
  {
    "title": "Dollar catches breath, Brazil real slides on tariff threat; bitcoin near record high",
    "description": "The U.S. dollar weakened following President Trump's tariff announcements, which primarily impacted Brazil, causing its currency to plunge. Despite this, global markets showed a preference for riskier assets, evidenced by Nvidia's valuation milestone and Bitc…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-catches-breath-brazil-real-slides-on-tariff-threat-bitcoin-near-record-high/articleshow/122353899.cms",
    "timestamp": "2025-07-10T01:53:13Z"
  },
  {
    "title": "Medicaid Work Mandates and Looming Cuts Could Weaken VI Health Systems, Officials Warn",
    "description": "Senator Ray Fonseca, chair of the Committee on Health, Hospitals, and Human Services, has voiced his...",
    "link": "https://viconsortium.com/vi-health/virgin-islands-medicaid-work-mandates-and-looming-cuts-could-weaken-vi-health-systems--officials-warn",
    "timestamp": "2025-07-10T01:52:50Z"
  },
  {
    "title": "Trump Says 50% Tariff on Copper Imports to Take Effect August 1",
    "description": "President Donald Trump said the US would begin levying a 50% tariff on copper imports from Aug. 1, confirming a move that will hurt American producers of everything from automobiles to appliances.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-50-tariff-on-copper-imports-to-take-effect-august-1",
    "timestamp": "2025-07-10T01:52:13Z"
  },
  {
    "title": "Oil falls as Trump's expanded tariffs cloud demand outlook",
    "description": "Oil prices saw a dip on Thursday. This happened because of new tariffs announced by U.S. President Donald Trump. Market watchers think these tariffs could slow down global economic growth. They also worry about demand for oil. Trump also threatened Brazil wit…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-falls-as-trumps-expanded-tariffs-cloud-demand-outlook/articleshow/122353886.cms",
    "timestamp": "2025-07-10T01:51:31Z"
  },
  {
    "title": "WSJ begs Trump to back off mass deportations: 'Economy needs them!'",
    "description": "The conservative Wall Street Journal editorial board published a dire warning on Wednesday evening that President Donald Trump's mass deportation schemes are poised to be disastrous for the economy, stripping the workforce of critical talent needed for vital …",
    "link": "https://www.rawstory.com/wsj-trump-2673043267/",
    "timestamp": "2025-07-10T01:50:01Z"
  },
  {
    "title": "After two years as X CEO, Linda Yaccarino is stepping down",
    "description": "Linda Yaccarino, the chief executive of Elon Musk’s X Corp, is leaving the company after what has been two turbulent years for the platform. Musk hired Yaccarino (pictured) the year when he bought the platform and changed the name from Twitter Inc. to X, with…",
    "link": "https://siliconangle.com/2025/07/09/two-years-x-ceo-linda-yaccarino-stepping/",
    "timestamp": "2025-07-10T01:49:45Z"
  },
  {
    "title": "Trump Sets 50% U.S. Tariffs On Copper, Brazilian Imports Starting In August",
    "description": "\"America will, once again, build a DOMINANT Copper Industry,\" Trump said in a post on his Truth Social media platform.",
    "link": "https://www.huffpost.com/entry/trump-tariffs-copper-brazil_n_686f1822e4b045e0e37ec83c",
    "timestamp": "2025-07-10T01:48:18Z"
  },
  {
    "title": "Gold edges higher as Trump tariff moves keep markets on edge",
    "description": "Gold prices saw a slight increase. This happened because of Donald Trump's tariff announcements. These announcements made markets cautious. Investors are watching trade negotiations closely. A small drop in the dollar's value also helped gold. Trump threatene…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-edges-higher-as-trump-tariff-moves-keep-markets-on-edge/articleshow/122353867.cms",
    "timestamp": "2025-07-10T01:47:47Z"
  },
  {
    "title": "Trump names Transportation Secretary Duffy as interim NASA administrator",
    "description": "U.S. President Donald Trump on Wednesday tapped Transportation Secretary Sean Duffy to serve as the interim administrator of NASA, a role that has remained vacant since Trump withdrew his initial nominee.Duffy will temporarily take over the post that has been…",
    "link": "https://www.channelnewsasia.com/business/trump-names-transportation-secretary-duffy-interim-nasa-administrator-5230526",
    "timestamp": "2025-07-10T01:47:41Z"
  },
  {
    "title": "Trump threatens 50% tariff on Brazil over Bolsonaro trial",
    "description": "President Trump announces a \"crippling\" 50% tariff on Brazilian goods, effective August 1, explicitly linking the measure to Brazil's trial of former President Jair Bolsonaro.",
    "link": "https://www.israelnationalnews.com/news/411424",
    "timestamp": "2025-07-10T01:46:10Z"
  },
  {
    "title": "Wall Street rises as Fed minutes put rate cuts in focus, Nvidia hits $4 trillion milestone",
    "description": "Wall Street witnessed a surge, propelled by tech giant Nvidia's brief $4 trillion valuation and optimism surrounding potential Federal Reserve rate cuts. Despite concerns over tariff-induced inflation, Fed minutes indicated expectations of 'temporary or modes…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-rises-as-fed-minutes-put-rate-cuts-in-focus-nvidia-hits-4-trillion-milestone/articleshow/122353846.cms",
    "timestamp": "2025-07-10T01:45:27Z"
  },
  {
    "title": "Nvidia hits $4 trillion, bitcoin soars to $112K as markets eye Trump tariffs",
    "description": "US stock indexes held gains despite growing uncertainty over President Trump’s escalating trade war, including a 50% copper tariff and threats of up to 200% on pharmaceuticals",
    "link": "https://www.thehindubusinessline.com/markets/nvidia-bitcoin-markets-trump-tariff-fed-update-2025/article69794612.ece",
    "timestamp": "2025-07-10T01:41:40Z"
  },
  {
    "title": "Trump Praises IRS Decision Allowing Churches to Make Political Endorsements",
    "description": "President Donald Trump praised the Internal Revenue Service (IRS) for its decision to allow churches to endorse political candidates, stating that he loves \"that churches can now\" make political endorsements.\nThe post Trump Praises IRS Decision Allowing Churc…",
    "link": "https://www.breitbart.com/politics/2025/07/09/trump-praises-irs-decision-allowing-churches-make-political-endorsements/",
    "timestamp": "2025-07-10T01:41:15Z"
  },
  {
    "title": "Rubio to meet Russia's Lavrov as strikes pound Kyiv",
    "description": "US Secretary of State Marco Rubio will meet with his Russian counterpart in Malaysia on Thursday, as Moscow unleashed its second major attack on Ukraine in...",
    "link": "https://www.yahoo.com/news/rubio-meet-russias-lavrov-asean-004049006.html",
    "timestamp": "2025-07-10T01:40:59Z"
  },
  {
    "title": "'RIP home renovations': Trump’s massive copper tariff buried in mockery",
    "description": "President Donald Trump agitated critics Wednesday night as he announced even more tariffs — this time on a metal of vital importance to the United States.Trump posted on his Truth Social platform that he was \"announcing a 50% TARIFF on Copper, effective Augus…",
    "link": "https://www.rawstory.com/trump-tariffs-2673043468/",
    "timestamp": "2025-07-10T01:40:05Z"
  },
  {
    "title": "Traffic on IPO exit route; Founders dig in pre-listing",
    "description": "Happy Thursday! Public debuts were the popular exits for private equity and venture capital last year. This and more in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/traffic-on-ipo-exit-route-founders-dig-in-pre-listing/articleshow/122353654.cms",
    "timestamp": "2025-07-10T01:36:39Z"
  },
  {
    "title": "Trump names Sean Duffy as interim NASA head after Isaacman withdrawal",
    "description": "Trump appointed Sean Duffy interim NASA chief on Wednesday via Truth Social, replacing Janet Petro after pulling Jared Isaacman’s nomination.",
    "link": "https://www.foxnews.com/politics/trump-taps-sean-duffy-serve-interim-nasa-chief",
    "timestamp": "2025-07-10T01:36:31Z"
  },
  {
    "title": "Investors grow restless as Tesla inches toward key shareholder meeting deadline — and risks violating Texas law",
    "description": "Tesla has yet to schedule its annual shareholder meeting in accordance to Texas law four days ahead of the deadline, and investors are restless.",
    "link": "https://www.businessinsider.com/tesla-risks-legal-trouble-texas-law-shareholder-letter-meeting-deadline-2025-7",
    "timestamp": "2025-07-10T01:34:30Z"
  },
  {
    "title": "Trump's Justice Department targets doctors, clinics who provide sex change procedures to minors",
    "description": "Attorney General Pamela Bondi announced the Justice Department has subpoenaed more than 20 doctors and clinics providing sex change treatments for minors.",
    "link": "https://www.foxnews.com/politics/trumps-justice-department-targets-doctors-clinics-over-controversial-child-sex-change-procedures",
    "timestamp": "2025-07-10T01:32:05Z"
  },
  {
    "title": "Trump sets 50% US tariffs on copper, Brazilian imports starting in August",
    "description": "WASHINGTON/BRUSSELS (Reuters) -U.S. President Donald Trump launched his global tariff assault into overdrive on Wednesday, announcing a new 50% tariff on U.S. copper imports and a 50% duty on goods from Brazil, both to start on August 1. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/10/trump-sets-50-us-tariffs-on-copper-brazilian-imports-starting-in-august",
    "timestamp": "2025-07-10T01:31:00Z"
  },
  {
    "title": "Former CIA Director John Brennan 'clueless' about why FBI would investigate him",
    "description": "Former CIA Director John Brennan told MSNBC that he had not been alerted that he was being investigated by the FBI before the news dropped on Tuesday.",
    "link": "https://www.foxnews.com/media/former-cia-director-john-brennan-clueless-about-why-fbi-would-investigate-him",
    "timestamp": "2025-07-10T01:30:54Z"
  },
  {
    "title": "Inspecting claim Hillary Clinton supplied Iran with uranium for nuclear program",
    "description": "Hillary Clinton reportedly played a critical role in U.S.-Iran nuclear talks that expanded Iran's ability to enrich uranium.",
    "link": "https://www.snopes.com//fact-check/hillary-clinton-supply-iran-uranium/",
    "timestamp": "2025-07-10T01:30:00Z"
  },
  {
    "title": "Trump announces 50% tariff on copper effective Aug 1",
    "description": "WASHINGTON: United States President Donald Trump announced on Wednesday (Jul 9) a 50 per cent tariff on copper, saying on social media that it would be effective on Aug 1 and that the decision was made after a national security assessment. \"Copper is necessar…",
    "link": "https://www.channelnewsasia.com/world/trump-tariffs-copper-trade-aug-1-5230446",
    "timestamp": "2025-07-10T01:27:19Z"
  },
  {
    "title": "Trump Announces New 50% Tariff on Copper",
    "description": "The president announced the new tariff after what he described as a \"robust national security assessment.\"",
    "link": "https://www.newsweek.com/trump-announces-new-tariffs-copper-2096997",
    "timestamp": "2025-07-10T01:27:03Z"
  },
  {
    "title": "Trump Says: Drill, Baby, Drill. The Stock Market Says: No Way",
    "description": "President Donald Trump thinks solar installations are “ugly as hell,” that “the wind is bullshit,” and that coal is “beautiful” and “clean.” He promised on the campaign trail to “drill, baby, drill.” He declared a national energy emergency the day he took off…",
    "link": "https://biztoc.com/x/225d54e2a0982095",
    "timestamp": "2025-07-10T01:25:07Z"
  },
  {
    "title": "Trump says tariffs on Brazil partially due to country’s treatment of their former President Bolsonaro",
    "description": "President Donald Trump announced that he plans to impose a 50% tariff on Brazil, citing in part the treatment of former President Jair Bolsonaro, a political ally.",
    "link": "https://biztoc.com/x/46c977d22204ec3b",
    "timestamp": "2025-07-10T01:24:56Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,232",
    "description": "Here are the key events on day 1,232 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/7/10/chk_russia-ukraine-war-list-of-key-events-day-1232",
    "timestamp": "2025-07-10T01:24:26Z"
  },
  {
    "title": "Trump names Transportation Secretary Sean Duffy as interim head of NASA | CNN Politics",
    "description": "President Donald Trump said on Wednesday he is directing Transportation Secretary Sean Duffy to be the interim NASA administrator.",
    "link": "https://www.cnn.com/2025/07/09/politics/sean-duffy-named-interim-nasa-administrator",
    "timestamp": "2025-07-10T01:22:36Z"
  },
  {
    "title": "Inside a family’s decision to self-deport from the US",
    "description": "Julio is an undocumented immigrant from Mexico. Sasha and their three children are US citizens. The family has decided to leave their life in Pittsburgh behind and go to Mexico.",
    "link": "https://www.cnn.com/2025/07/09/politics/self-deport-migrants-mexico",
    "timestamp": "2025-07-10T01:20:42Z"
  },
  {
    "title": "Copper to face 50% US tariff from August 1, says Trump",
    "description": "Trump’s post on Truth Social highlighted the material’s strategic importance, stating the US is expanding production of hypersonic weapons and other military technologies",
    "link": "https://www.thehindubusinessline.com/markets/commodities/trump-copper-tariff-2025-national-security/article69794597.ece",
    "timestamp": "2025-07-10T01:20:25Z"
  },
  {
    "title": "Bank of Korea expectedly keeps rates steady at an almost three-year low",
    "description": null,
    "link": "https://www.cnbc.com/2025/07/10/bank-of-korea-expectedly-keeps-rates-steady-at-an-almost-three-year-low.html",
    "timestamp": "2025-07-10T01:20:19Z"
  },
  {
    "title": "Tillis: Some of Trump's Advisers Are ‘Amateurs'",
    "description": "Senator Thom Tillis (R-NC) said Wednesday on CNN's \"The Lead\" that President Donald Trump's advisers were \"amateurs\" who \"act like the president when he's out of the room.\"\nThe post Tillis: Some of Trump’s Advisers Are ‘Amateurs’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/07/09/tillis-some-of-trumps-advisers-are-amateurs/",
    "timestamp": "2025-07-10T01:19:51Z"
  },
  {
    "title": "Dollar catches breath, Brazil real slides on tariff threat; bitcoin near record high",
    "description": "TOKYO :The U.S. dollar slipped further from a two-week high versus major peers on Thursday, as President Donald Trump's latest tariff salvos failed to shake markets, except in Brazil where a threatened 50 per cent levy sent the real sliding as much as 2.8 per…",
    "link": "https://www.channelnewsasia.com/business/dollar-catches-breath-brazil-real-slides-tariff-threat-bitcoin-near-record-high-5230511",
    "timestamp": "2025-07-10T01:19:30Z"
  },
  {
    "title": "Trump sets 50% copper tariff effective August 1",
    "description": "United States President Donald Trump announced a 50% tariff on copper, set to take effect on August 1. He said the decision follows a national security review and aims to strengthen industries relying...",
    "link": "https://biztoc.com/x/871108618f9cf85e",
    "timestamp": "2025-07-10T01:13:33Z"
  },
  {
    "title": "Trump's Transportation Secretary Gets Additional Job Title",
    "description": "In May, the president pulled his nomination of billionaire Jared Isaacman for the position days before his Senate vote.",
    "link": "https://www.newsweek.com/trumps-transportation-secretary-gets-additional-job-title-2097001",
    "timestamp": "2025-07-10T01:13:07Z"
  },
  {
    "title": "Trump Ignorantly Praises Liberian President's ' Good English': 'That's Beautiful'",
    "description": "English is the official language of Liberia, which was founded as an American colony in the 1800s.",
    "link": "https://www.huffpost.com/entry/donald-trump-liberian-president-english_n_686ee8b5e4b045e0e37ea32c",
    "timestamp": "2025-07-10T01:13:07Z"
  },
  {
    "title": "California has an idea to counter Trump’s megabill: Roll back environmental laws",
    "description": "Trump’s push to undermine clean energy projects is putting new focus on California's environmental laws.",
    "link": "https://www.politico.com/news/2025/07/09/california-has-an-idea-to-counter-trumps-megabill-roll-back-environmental-laws-00446120",
    "timestamp": "2025-07-10T01:09:34Z"
  },
  {
    "title": "Asian stocks waver, traders eye Japan bond auction",
    "description": "Asian stock markets showed mixed trends at the opening bell. Bitcoin remained close to its record high. Wall Street saw gains, with Nvidia reaching a $4 trillion valuation. However, Brazilian assets declined due to new tariffs imposed by President Trump. Inve…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-waver-traders-eye-japan-bond-auction/articleshow/122353668.cms",
    "timestamp": "2025-07-10T01:09:32Z"
  },
  {
    "title": "Trump says Liberian President speaks 'Such good English,' the nation's official language",
    "description": "President Donald Trump was visibly impressed by how well Liberian President Joseph Boakai spoke English, the West Africa nation's official language.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/09/liberia-official-language-trump/84525359007/",
    "timestamp": "2025-07-10T01:08:41Z"
  },
  {
    "title": "Trump tariffs goods from Brazil at 50%, citing 'witch hunt' trial against Bolsonaro",
    "description": "“This Trial should not be taking place,” Trump wrote in the letter posted on Truth Social. “It is a Witch Hunt that should end IMMEDIATELY!”President Donald Trump singled out Brazil for import taxes of 50% on Wednesday for its treatment of its former presiden…",
    "link": "https://freerepublic.com/focus/f-news/4327824/posts",
    "timestamp": "2025-07-10T01:08:21Z"
  },
  {
    "title": "If Trump wants Gaza ceasefire, he must pressure Netanyahu, experts say",
    "description": "Analysts say Trump's call for ceasefire is incomplete without using US leverage to push Israel to conclude negotiations.",
    "link": "https://www.aljazeera.com/news/2025/7/10/if-trump-wants-gaza-ceasefire-he-must-pressure-netanyahu-experts-say",
    "timestamp": "2025-07-10T01:06:39Z"
  },
  {
    "title": "Joe Biden's White House doctor refuses to answer US Congress queries related to former President’s health",
    "description": "Joe Biden’s doctor, Kevin O’Connor, has refused to answer questions related to the former US President’s health during a closed-door interview with the House Oversight Committee.",
    "link": "https://thenightly.com.au/politics/us-politics/joe-bidens-former-white-house-doctor-refuses-to-answer-us-congress-queries-c-19305904",
    "timestamp": "2025-07-10T01:06:22Z"
  },
  {
    "title": "Stock Market Highlights 10 July 2025: Sensex, Nifty settle lower amid investor caution, concern over potential US tariffs",
    "description": "Sensex, Nifty, Share Prices: Equity benchmark indices ended in negative territory as investors adopted a cautious tone before Tata Consultancy Services (TCS) Q1 earnings, weighing heavily on IT stocks. In addition, renewed concerns over potential US tariffs c…",
    "link": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-10-july-2025/article69791703.ece",
    "timestamp": "2025-07-10T01:05:13Z"
  },
  {
    "title": "Six Colorado facilities pitched for possible ICE detention expansion by private companies, records show",
    "description": "Several companies have floated at least six Colorado facilities as potential sites to expand detention for undocumented immigrants in the state, documents obtained by the ACLU show.",
    "link": "https://www.denverpost.com/2025/07/09/colorado-ice-detention-center-options-deportations-immigrants/",
    "timestamp": "2025-07-10T01:04:49Z"
  },
  {
    "title": "Trump praises Liberian president’s “good English”",
    "description": "The West African country got its start as an American colonial project official, and its language is English.",
    "link": "https://www.salon.com/2025/07/09/trump-praises-liberian-presidents-good-english/",
    "timestamp": "2025-07-10T01:03:02Z"
  },
  {
    "title": "Oil falls as Trump's expanded tariffs cloud demand outlook",
    "description": "TOKYO (Reuters) -Oil prices dropped on Thursday as the latest tariff announcements by U.S. President Donald Trump were perceived by market participants to...",
    "link": "https://finance.yahoo.com/news/oil-falls-trumps-expanded-tariffs-010114279.html",
    "timestamp": "2025-07-10T01:01:14Z"
  },
  {
    "title": "Hispanic Advisor To Oklahoma Gov. Stitt Deported To Guatemala",
    "description": "ICE Barbie will deport anyone. Literally, anyone. And a Hispanic conservative who actually advised Oklahoma Governor Stitt found that out the hard way when he was sent to Guatemala. \nCesar Reyes lived in Oklahoma for a decade. He has a wife and son and no cri…",
    "link": "https://crooksandliars.com/2025/07/hispanic-advisor-oklahoma-gov-stitt",
    "timestamp": "2025-07-10T01:00:01Z"
  },
  {
    "title": "Trump thumbs nose at Musk with 'tremendous' new NASA pick: 'Fantastic leader!'",
    "description": "President Donald Trump's new temporary head of NASA represents a \"marked win\" for a top MAGA ally — but not SpaceX CEO and former \"first buddy\" Elon Musk.Trump took to his Truth Social platform Wednesday night to announce that he is directing the \"GREAT Secre…",
    "link": "https://www.rawstory.com/trump-nasa-2673042964/",
    "timestamp": "2025-07-10T00:58:05Z"
  },
  {
    "title": "Rubio to meet Russia's Lavrov in Kuala Lumpur, US official says",
    "description": "KUALA LUMPUR (Reuters) -U.S. Secretary of State Marco Rubio will meet with Russian Foreign Minister Sergei Lavrov on the sidelines of the ASEAN foreign ministers' meeting in Kuala Lumpur on Thursday, a senior U.S. State Department official said. Read full sto…",
    "link": "https://www.thestar.com.my/news/world/2025/07/10/rubio-to-meet-russia039s-lavrov-in-kuala-lumpur-us-official-says",
    "timestamp": "2025-07-10T00:56:00Z"
  },
  {
    "title": "US president Donald Trump says 50% copper tariff to take effect August 1",
    "description": "President Donald Trump announced Wednesday that a 50 percent tariff on US imports of copper, a key metal for green energy and other technologies, will take effect on August 1. \"I am announcing a 50% TARIFF on Copper, effective August 1, 2025, after receiving …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-president-donald-trump-says-50-copper-tariff-to-take-effect-august-1/articleshow/122353524.cms",
    "timestamp": "2025-07-10T00:55:38Z"
  },
  {
    "title": "European court rejects Le Pen’s bid to suspend election ban",
    "description": "The European Court of Human Rights has refused to suspend Marine Le Pen’s ban on running for office Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621266-marine-le-pen-court-ruling/",
    "timestamp": "2025-07-10T00:54:08Z"
  },
  {
    "title": "Fears Australian pharmaceutical industry could collapse as US President Donald Trump threatens 200 per cent tariff",
    "description": "Fears Australian pharmaceutical industry could collapse as US President Donald Trump threatens 200 per cent tariff7news.com.au",
    "link": "https://7news.com.au/sunrise/fears-australian-pharmaceutical-industry-could-collapse-as-us-president-donald-trump-threatens-200-per-cent-tariffs-c-19307599",
    "timestamp": "2025-07-10T00:54:07Z"
  },
  {
    "title": "FEMA Response to Deadly Texas Floods Reportedly Delayed by Kristi Noem",
    "description": "The federal response to the deadly flooding in Texas was hampered by a Department of Homeland Security policy implemented by Secretary Kristi Noem, CNN reported on Wednesday night.\nThe post FEMA Response to Deadly Texas Floods Reportedly Delayed by Kristi Noe…",
    "link": "https://www.mediaite.com/media/news/fema-response-to-deadly-texas-floods-reportedly-delayed-by-kristi-noem/",
    "timestamp": "2025-07-10T00:51:30Z"
  },
  {
    "title": "Trump says 50% tariff on copper will begin Aug. 1",
    "description": "U.S. President Donald Trump said that the 50% tariff on copper imports, which he announced earlier on Tuesday, will begin on Aug. 1.\nTrump wrote on Truth Social that he made the decision after receiving a national security assessment.\nCopper is the third-most…",
    "link": "https://biztoc.com/x/31e07d7964585291",
    "timestamp": "2025-07-10T00:51:26Z"
  },
  {
    "title": "Trump taps Sean Duffy as interim NASA chief",
    "description": "United States President Donald Trump announced that US Secretary of Transportation Sean Duffy will serve as the interim administrator of the National Aeronautics and Space Administration (NASA).\nHe p...",
    "link": "https://biztoc.com/x/a20111d219dd9ae0",
    "timestamp": "2025-07-10T00:51:21Z"
  },
  {
    "title": "Pennsylvania man charged with beheading father says he was trying to perform a citizen’s arrest",
    "description": "The Pennsylvania man charged with fatally shooting then beheading his father and posting it on YouTube said on the stand Wednesday that the killing was “Plan B” after trying to arrest his father for what he called false statements and treason.",
    "link": "https://www.wpxi.com/news/local/pennsylvania-man-charged-with-beheading-father-says-he-was-trying-perform-citizens-arrest/QZWE6A6DO5DNLJIZZ4J6HDRA64/",
    "timestamp": "2025-07-10T00:50:58Z"
  },
  {
    "title": "‘Go A Little Bit Quicker’: Trump Tells Chatty African Leaders To Cut To The Chase",
    "description": "President Donald Trump told West African leaders to cut to the chase during a meeting Wednesday, asking them to quickly provide their names and countries.",
    "link": "https://dailycaller.com/2025/07/09/donald-trump-african-leaders-meeting/",
    "timestamp": "2025-07-10T00:48:18Z"
  },
  {
    "title": "Trump says 50% tariff on copper will begin Aug. 1",
    "description": "Trump wrote on Truth Social that he made the decision after receiving a national security assessment.",
    "link": "https://www.cnbc.com/2025/07/09/trump-says-50percent-tariff-on-copper-will-begin-aug-1.html",
    "timestamp": "2025-07-10T00:47:59Z"
  },
  {
    "title": "Trump imposes 50% tariffs on Brazil after spat with Lula",
    "description": "Donald Trump announced a 50% tariff on all imports from Brazil, citing unfair trade practices and linking the move to Brazil's treatment of Jair Bolsonaro. Lula da Silva responded by vowing reciprocal measures and disputing Trump's claims of unfair trade. The…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-imposes-50-tariffs-on-brazil-after-spat-with-lula/articleshow/122353384.cms",
    "timestamp": "2025-07-10T00:46:43Z"
  },
  {
    "title": "Trump announces 50% tariff on copper effective August 1",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump announced on Wednesday a 50% tariff on copper, saying on social media that it would be effective August 1 and that the decision was made after a national security assessment. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/10/trump-announces-50-tariff-on-copper-effective-august-1",
    "timestamp": "2025-07-10T00:46:00Z"
  }
]