[
  {
    "title": "Trump and his allies mount a pressure campaign against US elections ahead of the midterms | CNN Politics",
    "description": "A few weeks ago, Republican election officials in Colorado began receiving unsolicited calls and texts from a GOP consultant who said he was working with the Trump administration on “election integrity.”",
    "link": "https://www.cnn.com/2025/08/02/politics/trump-elections-pressure-campaign",
    "timestamp": "2025-08-02T11:50:02Z"
  },
  {
    "title": "India will continue buying Russian oil despite Trump tariff threats, government sources say",
    "description": "India will keep purchasing oil from Russia despite U.S. President Donald Trump’s threats of penalties, two Indian government sources said, not wishing to be identified due to the sensitivity of the matter.\n“These are long-term oil contracts,” one of the sourc…",
    "link": "https://biztoc.com/x/4cefa8e0be304b51",
    "timestamp": "2025-08-02T11:48:35Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to the first CaturSaturday in August: it’s Saturday, August, 2, 2025, shabbos for Jewish cats, and National Ice Cream Sandwich Day.  Here’s a rating of ice cream sandwiches, including many new brands. If you want to skip the palaver, the winners compr…",
    "link": "https://whyevolutionistrue.com/2025/08/02/saturday-hili-dialogue-543/",
    "timestamp": "2025-08-02T11:45:30Z"
  },
  {
    "title": "Trump Fires Head of Labor Statistics After Weak Jobs Report",
    "description": "President Donald Trump on Friday fired the head of the Bureau of Labor Statistics Erika McEntarfer after the release of a weaker-than-expected jobs report, accusing her without evidence of manipulating the monthly jobs numbers. It comes after the new report s…",
    "link": "https://www.today.com/video/trump-fires-head-of-bureau-of-labor-statistics-after-jobs-numbers-244247621944",
    "timestamp": "2025-08-02T11:44:27Z"
  },
  {
    "title": "$200 oil threat if India stops Russian crude buys; EU continues major imports: Sources",
    "description": "India’s Russian oil imports are keeping global crude prices from soaring to $200, say sources, as refiners continue purchases despite US pressure and Trump remarks.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/200-oil-threat-if-india-stops-russian-crude-buys-eu-continues-major-imports-sources/article69886663.ece",
    "timestamp": "2025-08-02T11:44:18Z"
  },
  {
    "title": "Trump removes official overseeing jobs data after weak employment report",
    "description": "WASHINGTON — President Donald Trump on Friday removed the head of the agency that produces the monthly jobs figures after a report showed hiring slowed in July and was much weaker in May and June than previously reported.\nTrump, in a post on his social media …",
    "link": "https://biztoc.com/x/77e0b8319e039e11",
    "timestamp": "2025-08-02T11:37:35Z"
  },
  {
    "title": "Inside India’s expulsion of Bengali Muslims",
    "description": "A state-backed drive to deport Bengali Muslims from India is being justified and cheered on by the media.",
    "link": "https://www.aljazeera.com/video/the-listening-post/2025/8/2/inside-indias-expulsion-of-bengali-muslims",
    "timestamp": "2025-08-02T11:33:50Z"
  },
  {
    "title": "Bitcoin Is Suddenly On The Brink As $300 Billion Crypto Shock Sparks Price Crash Fears",
    "description": "Bitcoin traders are scrambling to get ahead of what could be a major market crash...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/02/bitcoin-is-suddenly-on-the-brink-as-300-billion-crypto-shock-sparks-price-crash-fears/",
    "timestamp": "2025-08-02T11:30:53Z"
  },
  {
    "title": "India aghast at Donald Trump’s ‘dead’ economy jibe, 25% tariffs",
    "description": "India is facing shock and dismay after the US imposed a surprise 25% tariff, with businesses and policymakers assessing the impact. Trump's remarks on India's trade barriers and alignment with Russia have sparked criticism and concern. While India weighs its …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-aghast-at-donald-trumps-dead-economy-jibe-25-tariffs/articleshow/123061510.cms",
    "timestamp": "2025-08-02T11:27:25Z"
  },
  {
    "title": "How the courts became the biggest roadblock to Trump’s plans",
    "description": "Judges issued about 35 nationwide injunctions blocking various Trump orders before the supreme court stepped in, according to independent analysis from the Guardian\nA federal judge’s ruling last week to maintain a sweeping nationwide ban on Donald Trump’s bir…",
    "link": "https://biztoc.com/x/0d50de3f54ea8de9",
    "timestamp": "2025-08-02T11:26:38Z"
  },
  {
    "title": "Sydney Sweeney’s controversial ad campaign draws Trump's attention, he says 'advertising a very funny thing'",
    "description": "Sydney Sweeney's American Eagle ad sparked controversy, drawing criticism for promoting Western beauty standards. US President Trump weighed in, linking it to the Dylan Mulvaney ad backlash. Critics likened the Sweeney campaign's tagline, \"Sydney Sweeney Has …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-sydney-sweeneys-controversial-ad-campaign-american-eagle-draws-trumps-attention-he-says-advertising-a-very-funny-thing/articleshow/123061395.cms",
    "timestamp": "2025-08-02T11:19:47Z"
  },
  {
    "title": "Fed Governor Adriana Kugler Resigns Early in Boost for Trump: What To Know",
    "description": "Kugler's move comes amid ongoing criticism of Federal Reserve Chair Jerome Powell by President Donald Trump.",
    "link": "https://biztoc.com/x/346f17e7ffa7a831",
    "timestamp": "2025-08-02T11:15:24Z"
  },
  {
    "title": "Indian Express recipe not working",
    "description": "It hasnt been working since last few tries. Here is the error code. It would be great if someone could help.\n\n\nCode:\n---------\ncalibre, version 8.7.0 (linux, embedded-python: True)\nConversion error: Failed: Fetch news from Indian Express\n\nFetch news from Indi…",
    "link": "https://www.mobileread.com/forums/showthread.php?s=6b57b1ed11513bc4218f2c8f32fe88a6&p=4528504#post4528504",
    "timestamp": "2025-08-02T11:14:57Z"
  },
  {
    "title": "What did we learn from the Sydney Sweeney jeans drama?",
    "description": "America has been turned upside down by a single American Eagle jeans ad. A new campaign, starring Sydney Sweeney, has provoked an extended conversation about race, beauty, politics, Donald Trump and sexuality. What a mess! We asked experts to explain.",
    "link": "https://www.cnn.com/2025/08/02/entertainment/sydney-sweeney-american-eagle-ad-dunkin-drama-cec",
    "timestamp": "2025-08-02T11:12:46Z"
  },
  {
    "title": "'Terrorized' Republicans fume to Dem about 'stupid damage' done by Trump",
    "description": "WASHINGTON — A senior Democratic senator slammed President Donald Trump as trying to realize the \"wet dream of the dirtiest players in the fossil fuel industry.\"The vivid comment was made to Raw Story after Trump’s Environmental Protection Agency chief announ…",
    "link": "https://www.rawstory.com/raw-investigates/wet-dream-of-dirtiest-players-top-dem-slams-trump-epa-chief-for-axing-key-climate-rule/",
    "timestamp": "2025-08-02T11:11:15Z"
  },
  {
    "title": "Is SpaceX's Stock Price Affected by Trump's Supportive Politics over Bitcoin?",
    "description": "Los Angeles CA (SPX) Aug 01, 2025\n\nIf there are people and trends that are currently shaping the world, it would have to be the new President of the USA, Donald Trump, and his trusted advisor, billionaire inventor and entrepreneur, Elon Musk. Musk's SpaceX co…",
    "link": "https://www.spacedaily.com/reports/Is_SpaceXs_Stock_Price_Affected_by_Trumps_Supportive_Politics_over_Bitcoin_999.html",
    "timestamp": "2025-08-02T11:05:02Z"
  },
  {
    "title": "Fed Governor Adriana Kugler Resigns Early in Boost for Trump: What To Know",
    "description": "Kugler's move comes amid ongoing criticism of Federal Reserve Chair Jerome Powell by President Donald Trump.",
    "link": "https://www.newsweek.com/fed-governor-adriana-kugler-resigns-early-boost-trump-what-know-2107942",
    "timestamp": "2025-08-02T11:04:03Z"
  },
  {
    "title": "Laura Ingraham's Latest Attack On Jasmine Crockett Evokes 'Ugliest Roots Of American History'",
    "description": "\"An addiction to hate is arguably the most contagious and deadly of all human diseases,\" an expert in American studies said.",
    "link": "https://www.huffpost.com/entry/laura-ingraham-jasmine-crockett-goog_n_688bca49e4b041333e5b7df8",
    "timestamp": "2025-08-02T11:00:17Z"
  },
  {
    "title": "Erik Visits an Non-American Grave, Part 1,934",
    "description": "This is the grave of the one and only Leonard Cohen. Born in 1934 in Westmount, Quebec, Cohen grew up in an Orthodox Jewish family in Montreal. But it didn’t really stick with him, not religiously anyway though he always embraced his Jewish identity. He certa…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/erik-visits-an-non-american-grave-part-1932",
    "timestamp": "2025-08-02T11:00:00Z"
  },
  {
    "title": "6 Top Crypto Stocks To Buy Now: Top Picks For August 2025",
    "description": "Looking for the top crypto stocks in August 2025? Discover our 6 best picks to buy now and capitalize on the latest market trends in crypto.",
    "link": "https://www.forbes.com/sites/investor-hub/article/best-crypto-stocks-buy-now-august-2025/",
    "timestamp": "2025-08-02T11:00:00Z"
  },
  {
    "title": "Richmond hosted a history-making presidential debate in 1992",
    "description": "University of Richmond hosted the first town-hall style presidential debate — which was also the only debate held in Richmond to date.",
    "link": "https://richmond.com/news/archives/article_ebe1cb79-853c-43a9-8090-13d0578d6293.html",
    "timestamp": "2025-08-02T11:00:00Z"
  },
  {
    "title": "Steve Rosenberg: Russia is staying quiet on Trump's nuclear move",
    "description": "The US president said he's ordered two nuclear submarines to move closer to Russia, after a social media spat with Russia's ex-president.",
    "link": "https://www.bbc.com/news/articles/cly4kgv9238o",
    "timestamp": "2025-08-02T10:56:44Z"
  },
  {
    "title": "Ukraine Drone Strikes on Russia Leave Three Dead, Says Moscow",
    "description": "Ukrainian drone attacks overnight into Saturday killed three people, Russian officials said Saturday.\nThe post Ukraine Drone Strikes on Russia Leave Three Dead, Says Moscow appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/08/02/ukraine-drone-strikes-on-russia-leave-three-dead-says-moscow/",
    "timestamp": "2025-08-02T10:55:28Z"
  },
  {
    "title": "Whiny and Unteachable Europeans Complain About Trade Deal",
    "description": "Shock turns into outrage. Europeans feel they’ve been duped by Donald Trump. But the trade deal merely lays bare the EU’s accelerating loss of power. Anyone familiar with German politics has long known that Ursula von der Leyen, President of the European Comm…",
    "link": "https://freerepublic.com/focus/f-news/4332215/posts",
    "timestamp": "2025-08-02T10:54:58Z"
  },
  {
    "title": "Earle-Sears launches a new campaign theme with a military tone",
    "description": "Lt. Gov. Winsome Earle-Sears launches her \"Operation Defend and Deliver\" campaign message, stressing that she'll continue Gov. Glenn Youngkin's policies.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_fcd54690-4520-4d66-92cf-b30dae5cfc77.html",
    "timestamp": "2025-08-02T10:45:00Z"
  },
  {
    "title": "Malaysia gains global recognition for Asean diplomacy, says Anwar",
    "description": "KUALA LUMPUR: Malaysia's success in uniting Asean and promoting peace in the region has earned it international respect, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/08/02/malaysia-gains-global-recognition-for-asean-diplomacy-says-anwar",
    "timestamp": "2025-08-02T10:44:00Z"
  },
  {
    "title": "Trump Gives Stunning Reply When Asked About Names of Donors for $200M White House Ballroom Addition",
    "description": "Karoline Leavitt said that the ballroom will be a \"much-needed and exquisite addition\" to the White House, seating up to 650 people.",
    "link": "https://www.westernjournal.com/trump-gives-stunning-reply-asked-names-donors-200m-white-house-ballroom-addition/",
    "timestamp": "2025-08-02T10:36:52Z"
  },
  {
    "title": "Migrant crossings through long-troubled Darién Gap plummet to near zero amid Trump crackdown",
    "description": "Migrant crossings at Panama's Darien Gap has dropped from a 82,000 monthly peak under Biden to only 10 in June following Trump's deportation policies.",
    "link": "https://www.foxnews.com/world/migrant-crossings-through-panamas-treacherous-darien-gap-plummet-near-zero-amid-trump-crackdown",
    "timestamp": "2025-08-02T10:30:36Z"
  },
  {
    "title": "Florida is the laboratory for MAGA — and American autocracy",
    "description": "Journalist Robert W. Fieseler on his new book \"American Scare\" and how \"we’re all Floridians now\"",
    "link": "https://www.salon.com/2025/08/02/florida-is-the-laboratory-for-maga-and-american-autocracy/",
    "timestamp": "2025-08-02T10:30:05Z"
  },
  {
    "title": "From flag poles to a $200 million ballroom: Inside Trump’s ‘legacy project’ at the White House | CNN Politics",
    "description": "President Donald Trump held plenty of meetings at the White House this summer: with foreign delegations striking trade deals, Cabinet members plotting a government overhaul and industry executives seeking tariff relief.",
    "link": "https://www.cnn.com/2025/08/02/politics/white-house-renovations-trump-ballroom",
    "timestamp": "2025-08-02T10:26:21Z"
  },
  {
    "title": "The inside story of the Murdoch editor taking on Donald Trump",
    "description": "Since her arrival at the Wall Street Journal, British editor-in-chief Emma Tucker has shaken up not only her own newsroom but also the White House\nThe danger posed to Donald Trump was obvious. It was a story that not only drew attention to his links to a conv…",
    "link": "https://biztoc.com/x/106256ee02fb013c",
    "timestamp": "2025-08-02T10:19:45Z"
  },
  {
    "title": "Senate Democrats to Make Final Desperation Move in Bid to Block Trump's Tariffs: Report",
    "description": "A group of Senate Democrats are trying to block President Donald Trump's tariffs with one very desperate step.",
    "link": "https://www.westernjournal.com/senate-democrats-make-final-desperation-move-bid-block-trumps-tariffs-report/",
    "timestamp": "2025-08-02T10:12:38Z"
  },
  {
    "title": "Thune Presses Senate Democrats To Facilitate Confirming Trump Nominees",
    "description": "By George Caldwell, The Daily Signal | July 31, 2025\nSenate Majority Leader John Thune, facing a big backlog of unconfirmed judicial and executive branch nominees, is asking Senate Democrats to help confirm President Donald Trump’s less controversial picks in…",
    "link": "https://biztoc.com/x/072bb110a7fee944",
    "timestamp": "2025-08-02T10:09:16Z"
  },
  {
    "title": "Trump Threatens Trade Deal With Canada After Liberal Gov’t Moves To Recognize A Palestinian State",
    "description": "By Justin Choi, Daily Caller News Foundation | July 31, 2025\nPresident Donald Trump has threatened to stall trade talks with Canada late Wednesday night after Canada’s move to recognize a Palestinian state.\nLiberal Canadian Prime Minister Mark Carney announce…",
    "link": "https://biztoc.com/x/da72dd9f965ce68e",
    "timestamp": "2025-08-02T10:08:57Z"
  },
  {
    "title": "IMMIGRATION HOLD-OVER: Biden Political Appointee Still Holds Prominent DHS Position Under Trump",
    "description": "By Tyler O'Neil, The Daily Signal | July 31, 2025\nPresident Donald Trump has cracked down on illegal immigration and reversed President Joe Biden’s immigration policies, but at least one of Biden’s political appointees in the Department of Homeland Security h…",
    "link": "https://biztoc.com/x/d13f78f23a562e56",
    "timestamp": "2025-08-02T10:08:45Z"
  },
  {
    "title": "There’s A Deeper Reason For Trump Resurrecting The Presidential Fitness Test",
    "description": "By Mary Rooke, Daily Caller News Foundation | July 31, 2025\nPresident Donald Trump is re-instituting the Presidential Fitness Test. By doing so, he’ll ignite a critical movement in America, as our country stands at a cultural crossroads.\nTrump announced that …",
    "link": "https://biztoc.com/x/aa66796867dffbcf",
    "timestamp": "2025-08-02T10:08:36Z"
  },
  {
    "title": "GAMA Lauds US-EU Trade Agreement",
    "description": "Exempts Civil Aerospace Goods From Tariffs The General Aviation Manufacturers Association praised the trade agreement reached by the U.S. and the European Union that was announced on July 27 that provides for tariff-free treatment of civilian aircraft and aer…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=20A8C87A-D71E-4D07-B9FF-1F6BBC58BEFC",
    "timestamp": "2025-08-02T10:05:00Z"
  },
  {
    "title": "Fed stands pat on rates, but jobs report signals it may regret It: This week in markets",
    "description": "After nearly four months of relentless gains, Wall Street took a step back, with major indexes finishing the week lower.",
    "link": "https://www.freep.com/story/money/business/2025/08/02/jobs-report-fed-rates/85478791007/",
    "timestamp": "2025-08-02T10:04:41Z"
  },
  {
    "title": "3 people killed in Ukrainian drone strikes on Russia",
    "description": "Ukrainian drone attacks overnight into Saturday have killed three people, according to Russian officials",
    "link": "https://abcnews.go.com/International/wireStory/3-people-die-overnight-ukrainian-drone-strikes-russia-124303337",
    "timestamp": "2025-08-02T10:04:17Z"
  },
  {
    "title": "'Rage Against The Regime' protests: Over 300 US cities hosting anti-Trump demonstrations today on JD Vance's birthday. Full list",
    "description": "Across the United States, numerous cities are bracing for \"Rage Against the Regime\" protests this Saturday, organized by the 50501 movement. Triggered by concerns over threats to democracy and human rights, demonstrators will rally against the Trump administr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-rage-against-the-regime-protests-over-300-us-cities-hosting-anti-trump-demonstrations-today-on-jd-vances-birthday-50501-group-full-list/articleshow/123060369.cms",
    "timestamp": "2025-08-02T10:03:03Z"
  },
  {
    "title": "Trump’s $200m ballroom: A history of home improvements at the White House",
    "description": "The White House has announced plans to build a new ballroom, fulfilling a long-term desire of Donald Trump's.",
    "link": "https://www.aljazeera.com/news/2025/8/2/trumps-200m-ballroom-a-history-of-home-improvements-at-the-white-house",
    "timestamp": "2025-08-02T10:02:40Z"
  },
  {
    "title": "Baloney about Blue Angels, biting in the office, and more. July’s seven craziest stories",
    "description": "July's craziest news stories include Stephen Colbert show cancellation controversy, a law firm associate fired for biting colleagues, and Sydney Sweeney jeans ad sparking outrage.",
    "link": "https://www.foxnews.com/opinion/baloney-about-blue-angels-biting-office-more-julys-seven-craziest-stories",
    "timestamp": "2025-08-02T10:00:54Z"
  },
  {
    "title": "Maps Show States Where Foreign-Born Populations Are Rising Fastest",
    "description": "Analysis of Census Bureau data showed the share of foreign-born populations surging in these states.",
    "link": "https://www.newsweek.com/us-population-changes-foreign-born-immigration-states-2107717",
    "timestamp": "2025-08-02T10:00:02Z"
  },
  {
    "title": "Malaysia confronts the realities of MAGA diplomacy and Trump’s brash ambassadorial pick",
    "description": "The brash influencer has raised eyebrows in the conservative country in southeast Asia.",
    "link": "https://www.salon.com/2025/08/02/malaysia-confronts-the-realities-of-maga-diplomacy-and-trumps-brash-ambassadorial-pick_partner/",
    "timestamp": "2025-08-02T10:00:00Z"
  },
  {
    "title": "America’s Top Gas Exporter Claims Massive Tax Credit for “Alternative” Fuels",
    "description": "This story was originally published by Inside Climate News and is reproduced here as part of the Climate Desk collaboration. Liquefied natural gas vessels are fueled by their cargo—they’re built specifically to make use of the gas boiling off from their tanks…",
    "link": "https://www.motherjones.com/politics/2025/08/cheniere-energy-lng-gas-exporter-claiming-tax-credit-alternative-fuels/",
    "timestamp": "2025-08-02T10:00:00Z"
  },
  {
    "title": "'A black hole': New graduates discover a dismal job market",
    "description": "Across the economy, hiring in recent months has ground to its slowest pace since the start of the pandemic, with employers adding just 73,000 jobs in July.",
    "link": "https://www.nbcnews.com/business/economy/job-market-report-college-student-graduates-ai-trump-tariffs-rcna221693",
    "timestamp": "2025-08-02T10:00:00Z"
  },
  {
    "title": "Laura Loomer is bringing MAGA cancel culture to the White House",
    "description": "The far-right conspiracy theorist has taken credit for numerous high-level firings over what she claims is \"disloyalty\" to President Trump.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/laura-loomer-trump-maga-cancel-culture-firings-rcna222581",
    "timestamp": "2025-08-02T10:00:00Z"
  },
  {
    "title": "Why Trump's expansive tariffs might not be long for this world",
    "description": "Judges at the U.S. Court of Appeals for the Federal Circuit appeared skeptical Thursday that Trump can use this congressional statute to impose expansive tariffs.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariffs-appeals-court-challenge-rcna222193",
    "timestamp": "2025-08-02T10:00:00Z"
  },
  {
    "title": "Trump’s Domestic Use of Military Set to Get Worse, Leaked Memo Shows",
    "description": "President Donald Trump has already enmeshed the United States military in domestic law enforcement operations involving immigration to an unprecedented degree. He has authorized a major military buildup at the border. He has maximized the use of military plan…",
    "link": "https://newrepublic.com/article/198708/trump-military-anti-immigration-dhs-leaked-memo",
    "timestamp": "2025-08-02T10:00:00Z"
  },
  {
    "title": "Guess Who’s Eligible for Student Loan Forgiveness: New ICE Agents",
    "description": "Thanks to the Supreme Court and the Trump administration, student loan forgiveness is out of reach for many — unless you work for ICE.\nThe post Guess Who’s Eligible for Student Loan Forgiveness: New ICE Agents appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/08/02/student-debt-loan-forgiveness-ice-agents/",
    "timestamp": "2025-08-02T10:00:00Z"
  },
  {
    "title": "Trump Admin Teams Up With Big Tech On Private Health Tracking Program",
    "description": "By Robert McGreevy, Daily Caller News Foundation | August 01, 2025\nPresident Donald Trump’s Centers for Medicare and Medicaid Services (CMS) is partnering with tech giants and healthcare conglomerates to form a broad new online medical database, the administr…",
    "link": "https://biztoc.com/x/c7b0cac46e237fc7",
    "timestamp": "2025-08-02T09:58:03Z"
  },
  {
    "title": "Michael Hudson: From Babylon to Wall Street – How Bankers Make You Poor",
    "description": "A wide-ranging historical discussion with Michael Hudson, tracing the destructive rise the power of lenders from ancient times to today.",
    "link": "https://www.nakedcapitalism.com/2025/08/michael-hudson-from-babylon-to-wall-street-how-bankers-make-you-poor.html",
    "timestamp": "2025-08-02T09:52:07Z"
  },
  {
    "title": "Trump steps up attacks on Fed’s independence amid interest rates row",
    "description": "US president called on top Fed officials to seize control from chair Jerome Powell if he fails to cut interest rates\nDonald Trump called on top Federal Reserve officials to seize control from its chair, Jerome Powell, if he fails to cut interest rates, steppi…",
    "link": "https://biztoc.com/x/2ad29c7464fb9e85",
    "timestamp": "2025-08-02T09:46:43Z"
  },
  {
    "title": "Job seekers say it's bleak out there — and now the data agrees",
    "description": "Job seekers told Business Insider they're not surprised by the latest jobs report, and that it's felt this bad for a while.",
    "link": "https://www.businessinsider.com/job-seekers-react-july-jobs-report-2025-8",
    "timestamp": "2025-08-02T09:43:01Z"
  },
  {
    "title": "Musk claims ‘major’ US Democrats in Epstein docs",
    "description": "Even Donald Trump’s rivals would keep files related to the disgraced financier sealed, the X owner has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622404-musk-us-democrats-epstein/",
    "timestamp": "2025-08-02T09:42:16Z"
  },
  {
    "title": "German police expands use of Palantir surveillance software",
    "description": "Police and spy agencies are keen to combat criminality and terrorism with artificial intelligence. But critics say the CIA-funded Palantir surveillance software enables \"predictive policing.\"",
    "link": "https://www.dw.com/en/german-police-expands-use-of-palantir-surveillance-software/a-73497117",
    "timestamp": "2025-08-02T09:42:00Z"
  },
  {
    "title": "Good, mad and ugly: the US economy’s performance under Trump – in charts",
    "description": "Despite president’s claims of an economic boom, picture is chaotic – healthy GDP growth but weak jobs figures\nAccording to Donald Trump’s White House, the US economy is booming, inflation is dead and jobs are surging. A blizzard of economic reports has cast a…",
    "link": "https://biztoc.com/x/f43adac8339bdcf9",
    "timestamp": "2025-08-02T09:35:30Z"
  },
  {
    "title": "\"Have we become so weak?\" Congress MP Sukhdeo Bhagat on Trump's 25% tariff on India",
    "description": "Congress MP Sukhdeo Bhagat has criticised PM Modi's silence on the 25% tariff imposed by the US, questioning the government's vulnerability to US interference in strategic matters. Trump's announcement of tariffs and threats of further penalties for importing…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/have-we-become-so-weak-congress-mp-sukhdeo-bhagat-on-trumps-25-tariff-on-india/articleshow/123060012.cms",
    "timestamp": "2025-08-02T09:34:51Z"
  },
  {
    "title": "How could a change in U.S. energy policy impact the renewable sector?",
    "description": "Investing.com - August could prove to be a critical month for renewable energy companies, as the industry awaits revised guidance from the Treasury...",
    "link": "https://finance.yahoo.com/news/could-change-u-energy-policy-093009169.html",
    "timestamp": "2025-08-02T09:30:09Z"
  },
  {
    "title": "An awful Trump secret is about to come crashing into the open",
    "description": "Liberals don’t usually traffic in conspiracy theories. We think of ourselves as rational people who defer to the authority of facts. We believe we can shape perceptions of reality, but not reality itself.It’s because we are the reality-based community, howeve…",
    "link": "https://www.rawstory.com/raw-investigates/trump-epstein-2673799125/",
    "timestamp": "2025-08-02T09:30:01Z"
  },
  {
    "title": "Donald Trump Suffers Double Legal Blow Over Migrant Arrests Within Hours",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Trump administration suffered two legal defeats on Friday when the 9th U.S. Circuit Court of Appeals sustained a court imposed ban on immigration enforcement being conducted on the basis of language or occ…",
    "link": "https://biztoc.com/x/9797c2497a78ff20",
    "timestamp": "2025-08-02T09:24:43Z"
  },
  {
    "title": "Donald Trump To Get New Nobel Peace Prize Nomination",
    "description": "Sun Chanthol, Cambodia's deputy prime minister, said his country would nominate the president after clashes with Thailand ended.",
    "link": "https://biztoc.com/x/48d10a1c9e5c6f38",
    "timestamp": "2025-08-02T09:24:20Z"
  },
  {
    "title": "Private Donations to PBS & NPR Surge [semi-satire]",
    "description": "Corporation for Public Broadcasting (CPB) President and CEO Patricia Harrison informed its 100 employees of the termination of their employment following Congress' termination of federal subsidies, saying \"most of you will be off the payroll by the start of t…",
    "link": "https://freerepublic.com/focus/f-bloggers/4332213/posts",
    "timestamp": "2025-08-02T09:24:09Z"
  },
  {
    "title": "Tariff uncertainty to keep markets on edge; healthcare seen as safer bet: Rajesh Palviya",
    "description": "Rajesh Palviya highlights growing market pressure amid tariff uncertainty, with Nifty and Bank Nifty trading below key levels. He advises caution in pharma due to ongoing weakness but sees opportunity in healthcare stocks like Fortis and Medanta. Stock picks …",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/tariff-uncertainty-to-keep-markets-on-edge-healthcare-seen-as-safer-bet-rajesh-palviya/articleshow/123059840.cms",
    "timestamp": "2025-08-02T09:22:58Z"
  },
  {
    "title": "Donald Trump Suffers Double Legal Blow Over Migrant Arrests Within Hours",
    "description": "The Trump administration has said it wants to deport at least one million illegal migrants per year.",
    "link": "https://www.newsweek.com/donald-trump-suffers-double-legal-blow-over-migrant-arrests-within-hours-2107931",
    "timestamp": "2025-08-02T09:21:47Z"
  },
  {
    "title": "Swiss Tariff Deal Push Hits Roadblock in Heated Trump Call",
    "description": "Switzerland’s 11th-hour phone call with Donald Trump offered the nation a harsh reality check: A trade deal isn’t a deal unless the US president personally closes it.",
    "link": "https://www.livemint.com/companies/news/swiss-tariff-deal-push-hits-roadblock-in-heated-trump-call-11754126241638.html",
    "timestamp": "2025-08-02T09:17:21Z"
  },
  {
    "title": "Donald Trump To Get New Nobel Peace Prize Nomination",
    "description": "Sun Chanthol, Cambodia's deputy prime minister, said his country would nominate the president after clashes with Thailand ended.",
    "link": "https://www.newsweek.com/trump-nobel-peace-prize-cambodia-thailand-2107930",
    "timestamp": "2025-08-02T09:14:44Z"
  },
  {
    "title": "Ukrainian strikes kill three, Russian officials say, as Kyiv and Moscow exchange fire",
    "description": "Ukrainian reciprocal strikes follow Russian attack that killed 31 wounded and 150 earlier this week",
    "link": "https://www.irishtimes.com/world/europe/2025/08/02/ukraine-russia-war-latest-updates/",
    "timestamp": "2025-08-02T09:14:22Z"
  },
  {
    "title": "Europe’s trade deal with the US was dead on arrival – it needs to be buried. Here’s how to do it | Georg Riekeles and Varg Folkman",
    "description": "Nothing is agreed until everything is agreed. The EU should now steel itself and reject the terms imposed by Donald Trump\nUrsula von der Leyen’s Turnberry golf course deal has been rightly called a capitulation and a humiliation for Europe. Assuming such an a…",
    "link": "https://biztoc.com/x/ae6b525eb674d3b5",
    "timestamp": "2025-08-02T09:13:20Z"
  },
  {
    "title": "Ghislaine Maxwell transferred to lower-security prison as pressure mounts on Donald Trump",
    "description": "The socialite is serving a 20-year sentence for helping Jeffrey Epstein sexually abuse underage girls.",
    "link": "https://7news.com.au/news/ghislaine-maxwell-transferred-to-lower-security-prison-as-pressure-mounts-on-donald-trump-c-19551035",
    "timestamp": "2025-08-02T09:06:37Z"
  },
  {
    "title": "Top 5 stories from the Shreveport Times this week: castles in Louisiana, Jeffrey Epstein billboard",
    "description": "It has been a busy week in news for the Shreveport/Bossier area. Check out the top five stories.",
    "link": "https://www.shreveporttimes.com/story/news/local/2025/08/02/top-5-stories-from-the-shreveport-times-this-week-castles-in-louisiana-jeffrey-epstein-billboard/85473378007/",
    "timestamp": "2025-08-02T09:03:09Z"
  },
  {
    "title": "Nobel Prize Winners React to Idea of Trump Winning Economics Award",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPast winners of the Nobel Prize in economics have reacted to the suggestion that President Donald Trump's trade agenda has earned him a nomination for the prestigious award.\nDuring a Thursday appearance on Fox…",
    "link": "https://biztoc.com/x/68ee97fa32764cd3",
    "timestamp": "2025-08-02T09:02:13Z"
  },
  {
    "title": "Freed American-Israeli hostage details starvation and abuse by Hamas as families push Trump for deal",
    "description": "Former Hamas hostage Keith Siegel and hostage family members Anat Angrest and Lishay Lavi-Miran call for the release of those still held in Gaza as ceasefire talks collapse.",
    "link": "https://www.foxnews.com/media/freed-american-israeli-hostage-details-starvation-abuse-hamas-families-push-trump-action",
    "timestamp": "2025-08-02T09:00:22Z"
  },
  {
    "title": "GOP lawmakers, conservatives rejoice as Corporation for Public Broadcasting announces closure",
    "description": "Conservatives were quick to celebrate the announcement that the Corporation for Public Broadcasting would be shutting down after President Trump and Congress cut its funding.",
    "link": "https://www.foxnews.com/media/gop-lawmakers-conservatives-rejoice-corporation-public-broadcasting-announces-closure",
    "timestamp": "2025-08-02T09:00:16Z"
  },
  {
    "title": "Nobel Prize Winners React to Idea of Trump Winning Economics Award",
    "description": "White House trade adviser Peter Navarro believes President Trump's trade policies have earned him a nomination for the award.",
    "link": "https://www.newsweek.com/nobel-prize-winners-react-trump-economics-2107563",
    "timestamp": "2025-08-02T09:00:01Z"
  },
  {
    "title": "These Three Judges Might Just Restore Your Faith in the Courts",
    "description": "Reynolds Holding’s new book details how a trio of judges are trying to protect democracy.",
    "link": "https://slate.com/podcasts/amicus/2025/08/trump-judges-like-emil-bove-are-still-outliers-for-now",
    "timestamp": "2025-08-02T09:00:00Z"
  },
  {
    "title": "Stocks tumble on latest tariffs, soft jobs data - Reuters",
    "description": "Stocks tumble on latest tariffs, soft jobs dataReuters Here’s what could get more expensive from Trump’s massive tariff hikesCNN Trump's tariffs: Who are the winners and losers?NBC News Donald Trump thinks he’s winning on trade, but America will loseThe Econo…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178542616",
    "timestamp": "2025-08-02T08:54:48Z"
  },
  {
    "title": "Everything we know as Trump moves nuclear submarines following Russia 'step towards war' threat",
    "description": "Fears have been raised over Donald Trump's actions after a tweet by former Russian President Dmitry Medvedev",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-nuclear-submarine-russia-comments-269366-20250802",
    "timestamp": "2025-08-02T08:53:39Z"
  },
  {
    "title": "India refutes Trump’s claim it stopped buying Russia oil",
    "description": "New Delhi has dismissed the US leader’s allegation, saying it is “unaware” of any halt in imports Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622403-india-refutes-trumps-claim/",
    "timestamp": "2025-08-02T08:53:23Z"
  },
  {
    "title": "Sri Lanka Gets Trumpered in Global Tariff -20 PERCENT",
    "description": "In the wild world of international trade, Sri Lanka just got slapped with a 20% tariff by none other than Donald Trump—yes, he’s back, and he’s not just rearranging Washington furniture. He’s rewriting the tariff tables, and guess who made it into the \"Not Qu…",
    "link": "https://english.gossiplankanews.com/2025/08/sri-lanka-gets-trumpered-in-global.html",
    "timestamp": "2025-08-02T08:51:00Z"
  },
  {
    "title": "India will buy Russian oil despite Trump's threats, NYT reports",
    "description": "(Reuters) -Indian officials have said they would keep purchasing oil from Russia despite the threat of penalties that U.S. President Donald Trump said he would impose, the New York Times reported on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/02/india-will-buy-russian-oil-despite-trump039s-threats-nyt-reports",
    "timestamp": "2025-08-02T08:46:00Z"
  },
  {
    "title": "India will buy Russian oil despite Trump's threats, NYT reports",
    "description": "Indian officials have said they would keep purchasing oil from Russia despite the threat of penalties that U.S. President Donald Trump said he would impose, ...",
    "link": "https://www.yahoo.com/news/articles/india-buy-russian-oil-despite-084147040.html",
    "timestamp": "2025-08-02T08:41:47Z"
  },
  {
    "title": "India will continue to buy Russian oil, government sources say",
    "description": "(Reuters) -India will keep purchasing oil from Russia despite U.S. President Donald Trump's threats of penalties, two Indian government sources said, not...",
    "link": "https://finance.yahoo.com/news/india-buy-russian-oil-despite-084147315.html",
    "timestamp": "2025-08-02T08:41:47Z"
  },
  {
    "title": "Efforts set to resume to reach plastic pollution pact",
    "description": "The coming talks follow a failure to reach a deal last December on how to stop millions of tons of plastic waste from entering the environment each year.",
    "link": "https://www.japantimes.co.jp/environment/2025/08/02/sustainability/plastic-waste-treaty-talks/",
    "timestamp": "2025-08-02T08:38:00Z"
  },
  {
    "title": "Trump fires official overseeing jobs data after dismal employment report",
    "description": "President Donald Trump on Friday removed the head of the agency that produces the monthly jobs figures after a report showed hiring slowed in July and was much weaker in May and June than previously reported.",
    "link": "https://www.independent.ie/world-news/north-america/trump-fires-official-overseeing-jobs-data-after-dismal-employment-report/a873303725.html",
    "timestamp": "2025-08-02T08:25:10Z"
  },
  {
    "title": "Three die as Ukraine and Russia exchange drone attacks",
    "description": "Ukrainian drone attacks overnight killed three people, Russian officials said on Saturday.",
    "link": "https://www.independent.ie/world-news/europe/three-die-as-ukraine-and-russia-exchange-drone-attacks/a1056221185.html",
    "timestamp": "2025-08-02T08:19:25Z"
  },
  {
    "title": "Move over China: iPhones for America now mostly assembled in India, confirms Apple CEO Tim Cook",
    "description": "Apple CEO Tim Cook confirmed a significant shift in their supply chain, stating that most iPhones sold in the US are now manufactured in India. While China primarily produces for international markets, Vietnam is the main source for MacBooks, iPads, and Apple…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/move-over-china-iphones-for-america-now-mostly-assembled-in-india-confirms-apple-ceo-tim-cook/articleshow/123058485.cms",
    "timestamp": "2025-08-02T08:18:23Z"
  },
  {
    "title": "India hardens stance in US trade talks; refuses tariff cuts on farm, dairy, GM foods as Trump escalates tariff war",
    "description": "India has hardened its stance on tariff concessions for US agricultural products, dairy, and GM foods in their bilateral trade agreement. This comes as President Trump announced a 25% import duty on Indian goods starting August 7.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-hardens-stance-in-us-trade-talks-refuses-tariff-cuts-on-farm-dairy-gm-foods-as-trump-escalates-tariff-war/articleshow/123058928.cms",
    "timestamp": "2025-08-02T08:09:28Z"
  },
  {
    "title": "Lucas: No light in this Paris junket",
    "description": "Everyone should see Paris. Especially if someone else is paying for the trip.",
    "link": "https://www.bostonherald.com/2025/08/02/lucas-no-light-in-this-paris-junket/",
    "timestamp": "2025-08-02T08:01:42Z"
  },
  {
    "title": "WATCH: Dem senator agrees with GOP that Trump's making progress on trade war",
    "description": "His fellow Democrats got it wrong about President Donald Trump’s tariffs, Sen. John Fetterman, D-Pa., told Fox News Digital, adding that so far the U.S. trade war is “going well.\"",
    "link": "https://www.foxnews.com/politics/watch-dem-senator-agrees-gop-trumps-making-progress-trade-war",
    "timestamp": "2025-08-02T08:00:34Z"
  },
  {
    "title": "The Eastern Energy Partnership: Atlantic Canada's big pitch for Carney's nation-building list",
    "description": "The Atlantic provinces have some ambitious ‘nation-building’ proposals to generate and transmit more energy across Canada, under a banner called the Eastern Energy Partnership. Here's it could transform Atlantic Canada for generations to come.",
    "link": "https://www.cbc.ca/news/politics/the-eastern-energy-partnership-atlantic-canada-s-big-pitch-for-carney-s-nation-building-list-1.7599671",
    "timestamp": "2025-08-02T08:00:00Z"
  },
  {
    "title": "Cambodia to nominate Trump for Nobel Peace Prize for role in ending country’s conflict with Thailand",
    "description": "\"We acknowledge his great efforts for peace,\" Chanthol said.",
    "link": "https://nypost.com/2025/08/02/us-news/donald-trump-to-be-nominated-for-nobel-peace-prize-for-cease-fire-between-cambodia-and-thailand/",
    "timestamp": "2025-08-02T07:57:59Z"
  },
  {
    "title": "Trump fires US labor official over data and gets earlier than expected chance to reshape Fed",
    "description": "WASHINGTON/NEW YORK (Reuters) -President Donald Trump on Friday fired a top Labor Department official on the heels of a market-shocking weak scorecard of the U.S. job market, accusing her without evidence of manipulating the figures and adding to already grow…",
    "link": "https://www.thestar.com.my/news/world/2025/08/02/trump-fires-us-labor-official-over-data-and-gets-earlier-than-expected-chance-to-reshape-fed",
    "timestamp": "2025-08-02T07:52:00Z"
  },
  {
    "title": "50 Cent Gloats As Trump Nixes Pardon For “Half-Innocent” Diddy, For Now",
    "description": "Donald Trump believes Sean “Diddy” Combs is “half-innocent” out of his sex-trafficking trial, but there will be no presidential pardon right now for the much-accused Grammy winner. And, just two days after Deadline exclusively reported that Trump was “serious…",
    "link": "http://deadline.com/2025/08/trump-no-sean-combs-pardon-diddy-50-cent-1236477155/",
    "timestamp": "2025-08-02T07:48:41Z"
  },
  {
    "title": "The 9 at 9: Saturday",
    "description": "Disquiet over Connolly candidacy, major water works in the Greater Dublin Area, and Storm Floris on its way.",
    "link": "https://www.thejournal.ie/the-9-at-9-saturday-157-6781001-Aug2025/",
    "timestamp": "2025-08-02T07:47:37Z"
  }
]