[
  {
    "title": "Weekly Roundup: Trump attacks media over Epstein story",
    "description": "We review a busy week in Washington, including President Trump's response to a new report about his relationship with disgraced financier Jeffrey Epstein and calls from the White House for more partisan budgeting. Plus, what is Trump's foreign policy doctrine…",
    "link": "https://www.npr.org/2025/07/18/1255880067/weekly-roundup-trump-attacks-media-over-epstein-story",
    "timestamp": "2025-07-18T21:27:38Z"
  },
  {
    "title": "Trump sues Murdoch for libel over Jeffrey Epstein letter story",
    "description": "Trump had threatened to force Murdoch to \"testify in my lawsuit against him and his 'pile of garbage' newspaper\".",
    "link": "https://www.bbc.com/news/articles/c23g5xpggzmo",
    "timestamp": "2025-07-18T21:27:19Z"
  },
  {
    "title": "Brazil's Bolsonaro ordered to wear ankle monitor ahead of trial",
    "description": "Authorities in Brazil, worried that the former far right president is a flight risk, are imposing new restrictions on his movements. The tough surveillance moves come as President Trump continues to voice strong support for the ex-leader who is facing charges…",
    "link": "https://www.npr.org/2025/07/18/nx-s1-5472336/bolsonaro-trump-lula-coup-trial",
    "timestamp": "2025-07-18T21:27:05Z"
  },
  {
    "title": "Trump signs law to create regulatory regime for stablecoins, a huge win for crypto backers",
    "description": "U.S. President Donald Trump on Friday signed a law to create a regulatory regime for U.S.-dollar-pegged cryptocurrencies known as stablecoins, a milestone that could pave the way for the digital assets to become an everyday way to make payments and move money.",
    "link": "https://www.cbc.ca/news/world/trump-genius-act-signed-1.7588951",
    "timestamp": "2025-07-18T21:27:04Z"
  },
  {
    "title": "Laura Loomer Says Right-Wing 'Grifters' Using Trump-Epstein For Own Benefit",
    "description": "Laura Loomer name-dropped Tucker Carlson as one of the right-wing \"grifters\" who are cashing in on the chaos surrounding Donald Trump and Jeffrey Epstein.",
    "link": "https://biztoc.com/x/fc8be7bbdf914b1b",
    "timestamp": "2025-07-18T21:25:49Z"
  },
  {
    "title": "Following Epstein report, Trump files lawsuit against WSJ, Rupert Murdoch and others",
    "description": "On Thursday night, Donald Trump vowed to sue The Wall Street Journal over a Jeffrey Epstein report. The president apprantly wasn't bluffing.",
    "link": "https://biztoc.com/x/4f19285475a8cf0f",
    "timestamp": "2025-07-18T21:25:46Z"
  },
  {
    "title": "Facing Growing Outrage and Legal Action, Trump Admin Frees Chunk of Withheld Education Funds",
    "description": "Following widespread backlash and threats of legal action, the administration of U.S. President Donald Trump announced Friday that it will free up part of the $6.8 billion worth of education funding the president has withheld from states.Earlier this week, 24…",
    "link": "https://www.commondreams.org/news/trump-releases-frozen-education-funds",
    "timestamp": "2025-07-18T21:25:39Z"
  },
  {
    "title": "Laura Loomer Says Right-Wing 'Grifters' Using Trump-Epstein For Own Benefit",
    "description": "Laura Loomer name-dropped Tucker Carlson as one of the right-wing \"grifters\" who are cashing in on the chaos surrounding Donald Trump and Jeffrey Epstein.",
    "link": "https://www.newsweek.com/laura-loomer-trump-epstein-grifters-tucker-carlson-2101035",
    "timestamp": "2025-07-18T21:25:10Z"
  },
  {
    "title": "3rd Biden witness invokes Fifth Amendment during House deposition",
    "description": "Refuses to answer questions about former president's mental and physical health declines",
    "link": "https://www.wnd.com/2025/07/3rd-biden-witness-invokes-fifth-amendment-during-house/",
    "timestamp": "2025-07-18T21:24:35Z"
  },
  {
    "title": "8 Major Student Loan Changes From Trump’s Budget Bill: Next Steps for Borrowers",
    "description": "President Trump's budget reconciliation bill dramatically impacts student loans. Grad students and parent PLUS borrowers will experience more changes.",
    "link": "https://www.nerdwallet.com/article/loans/student-loans/big-beautiful-bill-student-loans#article",
    "timestamp": "2025-07-18T21:24:31Z"
  },
  {
    "title": "Trump ducks Epstein questions at Genius Act bill signing: ‘They named it after me’",
    "description": "Trump answered no reporter questions as his only scheduled public event of the day ended.",
    "link": "https://nypost.com/2025/07/18/us-news/trump-ducks-epstein-questions-at-genius-act-crypto-bill-signing-they-named-it-after-me/",
    "timestamp": "2025-07-18T21:23:56Z"
  },
  {
    "title": "Donald Trump Sues WSJ, Rupert Murdoch Over Jeffrey Epstein Birthday Letter Story",
    "description": "Donald Trump has sued Dow Jones, News Corp, Rupert Murdoch and two Wall Street Journal reporters, over an article in the paper about the president’s alleged 2003 birthday letter to Jeffrey Epstein that contained suggestive language. Trump claims the paper and…",
    "link": "https://variety.com/2025/biz/news/donald-trump-sues-wsj-rupert-murdoch-jeffrey-epstein-birthday-letter-1236464979/",
    "timestamp": "2025-07-18T21:22:30Z"
  },
  {
    "title": "Susan Collins’ Approval Rating At Record Low After Defying GOP, Trump On Multiple Key Votes",
    "description": "Republican Maine Sen. Susan Collins’ approval rating has fallen following a tense summer session where she repeatedly broke away from her party and President Donald Trump on multiple crucial votes. The results were released by Morning Consult as a part of its…",
    "link": "https://dailycaller.com/2025/07/18/susan-collins-approval-rating-big-beautiful-bill-rescissions-package/",
    "timestamp": "2025-07-18T21:22:27Z"
  },
  {
    "title": "Trump Files Suit Against Murdoch Over WSJ Epstein Story",
    "description": "Trump has filed a lawsuit against Murdoch on Friday WSJ's Epstein story.",
    "link": "https://dailycaller.com/2025/07/18/trump-files-suit-against-murdoch-over-wsj-epstein-story/",
    "timestamp": "2025-07-18T21:20:50Z"
  },
  {
    "title": "Transgender woman sues Princeton for 'humiliating' removal from track meet",
    "description": "A transgender woman has sued Princeton University claiming she was illegally removed shortly before her race in a school-hosted track meet in May due to her gender identity. An attorney for Sadie Schreiner filed the complaint in New Jersey Superior Court on T…",
    "link": "https://sports.yahoo.com/article/transgender-woman-sues-princeton-humiliating-212010510.html",
    "timestamp": "2025-07-18T21:20:10Z"
  },
  {
    "title": "Trump vows to make US 'crypto capital of the planet,' signs GENIUS Act into law (Fox News)",
    "description": "Fox News:\nTrump vows to make US ‘crypto capital of the planet,’ signs GENIUS Act into law  —  President Donald Trump signed into law the Guiding and Establishing National Innovation for U.S. Stablecoins (GENIUS) Act Friday — a landmark piece of legislation th…",
    "link": "https://www.memeorandum.com/250718/p113",
    "timestamp": "2025-07-18T21:20:00Z"
  },
  {
    "title": "The 'Trump effect' could mean an alliance shift that excludes the US",
    "description": "When Canada and Australia experienced similar election results, the impact of the Trump effect became clearer, along with its potential to shift future alliances.",
    "link": "https://www.abc.net.au/news/2025-07-19/canada-and-america-at-crossroads-due-to-trump/105546468",
    "timestamp": "2025-07-18T21:18:54Z"
  },
  {
    "title": "EXCLUSIVE: Joni Ernst Hints At List Of ‘Billion-Dollar Boondoggles’ She Wants To Bring ‘To A Squealing Halt’",
    "description": "Republican Sen. Joni Ernst of Iowa is preparing a list of targets after the Trump administration halted funding for California’s high-speed rail project.",
    "link": "https://dailycaller.com/2025/07/18/exclusive-joni-ernst-hints-billion-dollar-boondoggles-squealing-halt/",
    "timestamp": "2025-07-18T21:18:43Z"
  },
  {
    "title": "Stephen Colbert gets solidarity from fellow late-night hosts after cancellation news",
    "description": "Stephen Colbert was receiving messages of support and affection from his fellow late-night hosts after announcing that CBS was canceling his show, “The Late Show With Stephen Colbert,” next May",
    "link": "https://abcnews.go.com/Entertainment/wireStory/stephen-colbert-gets-solidarity-fellow-late-night-hosts-123870586",
    "timestamp": "2025-07-18T21:18:17Z"
  },
  {
    "title": "This Is How Elite University Presidents Will Cave to President Trump",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post This Is How Elite University Presidents Will Cave to President Trump ap…",
    "link": "https://www.dailysignal.com/2025/07/18/this-is-how-elite-university-presidents-will-cave-to-president-trump/",
    "timestamp": "2025-07-18T21:18:13Z"
  },
  {
    "title": "Trump Sues WSJ as He Continues to Crash Out Over Epstein Story",
    "description": "Donald Trump just made good on his threat to sue The Wall Street Journal for reporting on his lewd birthday note to alleged sex trafficker Jeffrey Epstein. The president filed a lawsuit in Miami court Friday against Dow Jones, News Corp, Rupert Murdoch, and t…",
    "link": "https://newrepublic.com/post/198144/donald-trump-sues-wall-street-journal-epstein",
    "timestamp": "2025-07-18T21:15:59Z"
  },
  {
    "title": "Donald Trump sues Dow Jones, News Corp, Rupert Murdoch, WSJ reporters for libel, court records show (Jonathan Stempel/Reuters)",
    "description": "Jonathan Stempel / Reuters:\nDonald Trump sues Dow Jones, News Corp, Rupert Murdoch, WSJ reporters for libel, court records show  —  U.S. President Donald Trump filed a lawsuit on Friday against Dow Jones, News Corp (NWSA.O), Rupert Murdoch and two Wall Street…",
    "link": "https://www.memeorandum.com/250718/p112",
    "timestamp": "2025-07-18T21:15:01Z"
  },
  {
    "title": "Trump files libel suit against Murdoch, WSJ reporters",
    "description": "United States President Donald Trump filed a libel lawsuit against Dow Jones, News Corp, Rupert Murdoch, as well as two Wall Street Journal reporters, according to court records.The lawsuit comes afte...",
    "link": "https://biztoc.com/x/82aa87280a2dd071",
    "timestamp": "2025-07-18T21:14:39Z"
  },
  {
    "title": "Trump sues Murdoch, Dow Jones over Wall Street Journal story on Epstein birthday letter: court records",
    "description": "President Donald Trump on Friday followed through on his threat to sue media mogul Rupert Murdoch after his Wall Street Journal published an article saying that Trump sent Jeffrey Epstein a \"bawdy\" letter for Epstein's 50th birthday, courts records show.\nCour…",
    "link": "https://biztoc.com/x/43c31c0bd8e1e8b1",
    "timestamp": "2025-07-18T21:14:36Z"
  },
  {
    "title": "Trump files lawsuit over Wall Street Journal report on Jeffrey Epstein’s birthday letters | CNN Politics",
    "description": "President Donald Trump is filing a libel lawsuit against the publisher of the Wall Street Journal and reporters who wrote a story about a collection of letters gifted to Jeffrey Epstein for his 50th birthday in 2003, including a note bearing Trump’s name and …",
    "link": "https://www.cnn.com/2025/07/18/politics/trump-wall-street-journal-jeffrey-epstein",
    "timestamp": "2025-07-18T21:14:18Z"
  },
  {
    "title": "Judge halts non-binary person's deportation to the U.S. as Trump dismantles trans rights",
    "description": "A Federal Court judge halted a non-binary American's deportation from Canada pending review. Advocates say the ruling sets \"an important precedent\" for 2SLGBTQ+ immigrants and refugees coming to Canada from, or through, the U.S.",
    "link": "https://www.cbc.ca/radio/asithappens/non-binary-deportation-ruling-1.7588820",
    "timestamp": "2025-07-18T21:14:01Z"
  },
  {
    "title": "A Congress That Votes Yes and Hopes No",
    "description": "Congressional Republicans keep wringing their hands over the White House’s legislative priorities … and then voting for them.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/congress-vote-trump-administration/683605/",
    "timestamp": "2025-07-18T21:14:00Z"
  },
  {
    "title": "Trump follows through on threat to sue Rupert Murdoch and WSJ",
    "description": "President Donald Trump has officially filed a libel lawsuit against News Corp, Dow Jones, Rupert Murdoch, the Wall Street Journal, and two reporters at the Journal, Reuters reported Friday afternoon.The news comes after the Journal reported Thursday night tha…",
    "link": "https://www.rawstory.com/trump-rupert-murdoch/",
    "timestamp": "2025-07-18T21:13:17Z"
  },
  {
    "title": "Congress passed Trump's spending cuts. What does that mean for their power of the purse?",
    "description": "A drama-filled week in DC saw Democrats accuse Republicans ceding Congress' power to Trump and a curveball involving Jeffrey Epstein.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/18/congress-trump-spending-cuts-takeaways/85272562007/",
    "timestamp": "2025-07-18T21:12:32Z"
  },
  {
    "title": "Trump Sues Wall Street Journal for Libel Over Epstein Letter Story",
    "description": "The president says he is looking forward to making Rupert Murdoch testify in court \nThe post Trump Sues Wall Street Journal for Libel Over Epstein Letter Story appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-sues-wall-street-journal-libel-epstein-story/",
    "timestamp": "2025-07-18T21:12:22Z"
  },
  {
    "title": "Following Epstein report, Trump files lawsuit against WSJ, Rupert Murdoch and others",
    "description": "On Thursday night, Donald Trump vowed to sue The Wall Street Journal over a Jeffrey Epstein report. The president apprantly wasn't bluffing.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-sues-wsj-murdoch-epstein-birthday-letter-rcna219701",
    "timestamp": "2025-07-18T21:11:51Z"
  },
  {
    "title": "Trump's attacks on Powell threaten the Fed's independence. Here's why it matters",
    "description": "President Donald Trump has opened up a new front in his attack on the Federal Reserve and its chair, Jerome Powell: He says the alledged mismanagement of a building renovation project could be grounds for firing Powell",
    "link": "https://abcnews.go.com/US/wireStory/trumps-attacks-powell-threaten-feds-independence-matters-123876570",
    "timestamp": "2025-07-18T21:10:16Z"
  },
  {
    "title": "A federal judge dismisses Trump's ~$50M 2023 lawsuit against Bob Woodward for publishing tapes from interviews for his 2020 book Rage as an audiobook (Jonathan Stempel/Reuters)",
    "description": "Jonathan Stempel / Reuters:\nA federal judge dismisses Trump's ~$50M 2023 lawsuit against Bob Woodward for publishing tapes from interviews for his 2020 book Rage as an audiobook  —  Donald Trump cannot pursue his nearly $50 million lawsuit against the journal…",
    "link": "https://mediagazer.com/250718/p14",
    "timestamp": "2025-07-18T21:10:01Z"
  },
  {
    "title": "Paramount bidder Skydance plays patriotism card in push for deal OK",
    "description": "Skydance CEO David Ellison told the FCC he wants “American storytelling” at Paramount while touting a new, “unbiased” editorial direction for CBS News.",
    "link": "https://www.nbcnews.com/business/media/david-ellison-fcc-chairman-paramount-deal-cbs-rcna219687",
    "timestamp": "2025-07-18T21:09:28Z"
  },
  {
    "title": "Venezuela frees 10 Americans in swap for deported migrants in El Salvador",
    "description": "President Donald Trump had deported nearly 200 Venezuelan men to an El Salvador prison, raising fears for their safety.",
    "link": "https://www.aljazeera.com/news/2025/7/18/venezuela-frees-10-americans-in-swap-for-deported-migrants-in-el-salvador",
    "timestamp": "2025-07-18T21:08:52Z"
  },
  {
    "title": "10 Americans are freed from Venezuela in a prisoner swap for migrants in El Salvador - NewsBreak",
    "description": "BOGOTÁ, Colombia — Venezuela has freed 10 Americans in exchange for Venezuelans whom the United States had sent to a prison in El Salvador, the U.S. and Sa",
    "link": "https://www.newsbreak.com/share/4117302137892-venezuela-frees-10-americans-as-part-of-a-prisoner-exchange-for-venezuelan-detainees?s=a2&amp;share_destination_id=MjMyMTkwMDI3LTE3NTI4NzI4NzQwNDQ%3D&amp;pd=0FiFERcW&amp;hl=en_US&amp;send_time=1752872874&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.28.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-v5%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-control",
    "timestamp": "2025-07-18T21:08:17Z"
  },
  {
    "title": "Colbert Fallout: Meyers, Fallon Respond; WGA Calls For Investigation",
    "description": "Less than 24 hours after the news hit that CBS would be ending The Late Show with Stephen Colbert in May 2026, the rumblings over the move and what it could mean on a number of levels are still a hot topic for discussions and debate. Previously, Jimmy Kimmel …",
    "link": "https://bleedingcool.com/tv/colbert-fallout-meyers-fallon-respond-wga-calls-for-investigation/",
    "timestamp": "2025-07-18T21:08:04Z"
  },
  {
    "title": "Pulitzer Prize-Winning WaPo Reporting Was Based Off ‘Blatantly False’ Intel, ODNI Report Says",
    "description": "Early Washington Post reporting alleging a plot by Vladimir Putin to install President Donald Trump in the 2016 election used \"blatantly false\" intelligence, a memo says.",
    "link": "https://dailycaller.com/2025/07/18/wapo-reporting-russian-interference-2026-based-off-blatantly-false-intel-odni-report/",
    "timestamp": "2025-07-18T21:06:34Z"
  },
  {
    "title": "Stephen Colbert’s Cancellation Is Exactly What You Think It Is",
    "description": "Paramount says it’s a business decision. There’s truthiness to that.",
    "link": "https://slate.com/technology/2025/07/stephen-colbert-late-show-canceled-paramount-skydance-merger-explained.html",
    "timestamp": "2025-07-18T21:06:34Z"
  },
  {
    "title": "Venezuela frees 10 Americans as part of a prisoner exchange for Venezuelan detainees - NewsBreak",
    "description": "Audio will be available later today. BOGOTÁ, Colombia — Venezuela has freed 10 Americans as part of a larger prisoner exchange for Venezuelan detainees rel",
    "link": "https://www.newsbreak.com/share/4117302137892-venezuela-frees-10-americans-as-part-of-a-prisoner-exchange-for-venezuelan-detainees?s=a2&amp;share_destination_id=MjIzNTc5MDctMTc1Mjg3Mjc0OTA4Nw%3D%3D&amp;pd=01VoJP8O&amp;hl=en_US&amp;send_time=1752872749&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.28.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v2%2Cns_foryou_recall_exp_25q3-v6%2Cns_foryou_rank_exp_25q2-v2%2Cns_foryou_model_exp_25q2_v2-v5",
    "timestamp": "2025-07-18T21:06:30Z"
  },
  {
    "title": "How Melania Trump maintains her figure: Diet and workout routine revealed - NewsBreak",
    "description": "How Melania Trump maintains her figure: Diet and workout routine revealed - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4117192240909-how-melania-trump-maintains-her-figure-diet-and-workout-routine-revealed?_f=app_share&amp;pd=0ACnzguF&amp;lang=en_US&amp;send_time=1752872719&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.14.1.4%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v2%2Cns_foryou_recall_exp_25q3-v2%2Cns_foryou_rank_exp_25q2-v7%2Cns_foryou_model_exp_25q2_v2-v9&amp;s=i2",
    "timestamp": "2025-07-18T21:05:49Z"
  },
  {
    "title": "Jon Stewart Addresses Possible 'Daily Show' Cancellation",
    "description": "Jon Stewart Addresses Possible 'Daily Show' Cancellationhuffpost.com",
    "link": "https://www.huffpost.com/entry/jon-stewart-addresses-possible-daily-show-cancellation_n_687a9c40e4b02a75a1fada14",
    "timestamp": "2025-07-18T21:04:58Z"
  },
  {
    "title": "Trump sues Murdoch, Dow Jones over Wall Street Journal story on Epstein birthday letter",
    "description": "President Trump is under increasing pressure to have the Justice Department release files about the late pedophile Jeffrey Epstein.",
    "link": "https://www.cnbc.com/2025/07/18/trump-sues-epstein-murdoch-wsj.html",
    "timestamp": "2025-07-18T21:04:06Z"
  },
  {
    "title": "Trump Keeps the Epstein Story Alive",
    "description": "No matter what pundits are saying, one thing is clear: Donald Trump believes the Wall Street Journal’s bombshell story from last night is a serious problem. He could have ignored it. But he was so",
    "link": "https://politicalwire.com/2025/07/18/trump-keeps-the-epstein-story-alive/",
    "timestamp": "2025-07-18T21:03:57Z"
  },
  {
    "title": "Can Trump Fire Fed Chairman Powell? Yes, He Can — And Should",
    "description": "Will President Donald Trump soon fire Federal Reserve Chairman Jerome Powell, as is now hotly rumored? And do you care? If not, maybe you should. Because at this moment, the Fed chief seems to think he has to re-fight the inflation battle he lost three years …",
    "link": "https://biztoc.com/x/ce3d67bf5db8dcc3",
    "timestamp": "2025-07-18T21:03:29Z"
  },
  {
    "title": "Coca-Cola may swap out high-fructose corn syrup with cane sugar, Trump says. Is that healthier?",
    "description": "President Donald Trump announced this week that the Coca-Cola Company has agreed to his requests for the brand to use “REAL” cane sugar in its US products instead of high-fructose corn syrup.\nThe company hasn’t confirmed the swap, but high-fructose corn syrup…",
    "link": "https://biztoc.com/x/f41c6cb928714903",
    "timestamp": "2025-07-18T21:03:28Z"
  },
  {
    "title": "Trump Signs Stablecoin Bill in Win for Crypto Industry",
    "description": "President Donald Trump signed the first federal bill to regulate stablecoins, hailing it as a “giant step to cement American dominance of global finance and crypto technology” and delivering a major victory for the digital asset industry.\n“The Genius Act crea…",
    "link": "https://biztoc.com/x/c67c7808d7d91375",
    "timestamp": "2025-07-18T21:03:19Z"
  },
  {
    "title": "Trump files a libel lawsuit against Rupert Murdoch, Dow Jones, and WSJ reporters who wrote an article saying that Trump sent Jeffrey Epstein a \"bawdy\" letter (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump files a libel lawsuit against Rupert Murdoch, Dow Jones, and WSJ reporters who wrote an article saying that Trump sent Jeffrey Epstein a “bawdy” letter  —  President Donald Trump on Friday followed through on his threat to sue media m…",
    "link": "https://mediagazer.com/250718/p13",
    "timestamp": "2025-07-18T21:02:32Z"
  },
  {
    "title": "A Scandal Sticks to Trump",
    "description": "I discussed Donald Trump’s very bad week with the great Julie Mason this afternoon. Give it a listen.",
    "link": "https://politicalwire.com/2025/07/18/a-scandal-sticks-to-trump/",
    "timestamp": "2025-07-18T21:01:20Z"
  },
  {
    "title": "Coca-Cola Reportedly Agreed to Make US Sodas with Real Cane Sugar",
    "description": "Trump announced the potential switch on social media, and it looks like high fructose corn syrup may be the next target of MAHA success.\nThe post Coca-Cola Reportedly Agreed to Make US Sodas with Real Cane Sugar first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/coca-cola-reportedly-agreed-to-make-us-sodas-with-real-cane-sugar/",
    "timestamp": "2025-07-18T21:00:33Z"
  },
  {
    "title": "Trump Sues Wall Street Journal For Defamation Over Epstein Report",
    "description": "The lawsuit sets the stage for another legal showdown initiated by Trump against the media, this time against his close ally Rupert Murdoch.",
    "link": "http://www.hollywoodreporter.com/business/business-news/trump-files-defamation-lawsuit-wall-street-journal-epstein-report-1236319238/",
    "timestamp": "2025-07-18T21:00:21Z"
  },
  {
    "title": "Taiwan will ‘not provoke confrontation’ with China, Vice President Hsiao says",
    "description": "China claims self-ruled Taiwan as its own territory and has repeatedly threatened to annex it, by force if necessary. In recent years, Beijing has ramped up its military intimidation of the island, sending jets and ships nearby almost daily.",
    "link": "https://www.pbs.org/newshour/world/taiwan-will-not-provoke-confrontation-with-china-vice-president-hsiao-says",
    "timestamp": "2025-07-18T21:00:12Z"
  },
  {
    "title": "Trump Team Sabotaged Fed Renovation as Trump Started War With Powell",
    "description": "Trump is purposely using a construction project that his own appointees are making more expensive as grounds to pick a fight and potentially fire his nemesis, Federal Reserve Chair Jerome Powell.The Fed building, opened in 1937, began undergoing plans for ren…",
    "link": "https://newrepublic.com/post/198141/trump-team-federal-reserve-renovation-jerome-powell",
    "timestamp": "2025-07-18T21:00:01Z"
  },
  {
    "title": "'Teflon wearing thin': Analyst warns 'bombast and cruelty' puts presidency in peril",
    "description": "President Donald Trump isn't deporting undocumented migrants in the mass quantities he'd like Americans to believe, according to an opinion piece by Fareed Zakaria in The Washington Post.Despite the administration's directive that ICE meet the lofty quota of …",
    "link": "https://www.rawstory.com/trump-ice-2673370808/",
    "timestamp": "2025-07-18T20:59:02Z"
  },
  {
    "title": "Hooray! Taxpayers will no longer have to pick up the tab for NPR, PBS’s lefty propaganda",
    "description": "Congress is finally defunding public broadcasting, and it's about time.",
    "link": "https://nypost.com/2025/07/18/opinion/hooray-taxpayers-will-no-longer-have-to-pay-for-npr-pbss-lefty-propaganda/",
    "timestamp": "2025-07-18T20:57:26Z"
  },
  {
    "title": "US Stocks End Little Changed With S&P 500 Notching Weekly Gain",
    "description": "US stocks closed Friday unchanged as declines in technology and energy shares offset gains elsewhere, with the S&P 500 Index notching its third winning week in the last four after consumer sentiment rose to a five-month high.",
    "link": "https://financialpost.com/pmn/business-pmn/us-stocks-end-little-changed-with-sp-500-notching-weekly-gain",
    "timestamp": "2025-07-18T20:56:19Z"
  },
  {
    "title": "'Rambling' Trump speech sparks new dementia fears as questions over health surge - NewsBreak",
    "description": "Donald Trump signed off on what has been dubbed \"Crypto Week\" in Congress, by signing a landmark bill to regulate cryptocurrency, but people noted he seeme",
    "link": "https://www.newsbreak.com/share/4117170289639-rambling-trump-speech-sparks-new-dementia-fears-as-questions-over-health-surge?s=a2&amp;share_destination_id=MTY2MjgyNjMxLTE3NTI4NzIxMzUxMzM%3D&amp;pd=0BFhhvIM&amp;hl=en_US&amp;send_time=1752872135&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.29.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v3%2Cns_foryou_recall_exp_25q3-v1%2Cns_foryou_model_exp_25q2_v2-control%2Cns_foryou_rank_exp_25q2-control",
    "timestamp": "2025-07-18T20:56:01Z"
  },
  {
    "title": "Stefanik uses viral Astronomer CEO cheating photo to slam Mamdani, Hochul",
    "description": "Rising GOP star positions herself for potential 2026 gubernatorial run as poll shows Democrats with early advantage.",
    "link": "https://nypost.com/2025/07/18/us-news/stefanik-uses-viral-ceo-cheating-photo-to-slam-mamdani-hochul/",
    "timestamp": "2025-07-18T20:55:51Z"
  },
  {
    "title": "Ether And Bitcoin Score Biggest ‘Crypto Week’ Surges As Trump Signs Stablecoin Bill",
    "description": "House Republicans promoted this week as the latest step for the U.S. to become the “crypto capital of the world.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/07/18/ether-and-bitcoin-score-biggest-crypto-week-surges-as-trump-signs-stablecoin-bill/",
    "timestamp": "2025-07-18T20:53:58Z"
  },
  {
    "title": "Will Threads Soon Surpass X? Zuckerberg Vs. Musk App War Heats Up",
    "description": "Threads, Meta’s X competitor platform, is inching closer to possibly overtaking X in daily active users on mobile devices.",
    "link": "https://www.forbes.com/sites/conormurray/2025/07/18/will-threads-soon-surpass-x-zuckerberg-vs-musk-app-war-heats-up/",
    "timestamp": "2025-07-18T20:52:20Z"
  },
  {
    "title": "Trump is beginning to implement his sweeping student-loan repayment changes",
    "description": "President Donald Trump began rolling out student-loan repayment changes from his spending bill.\nJoe Raedle via Getty Images\nThe Department of Education is beginning to roll out the student-loan repayment changes from Trump's spending bill.\nThey include change…",
    "link": "https://biztoc.com/x/53179e54e3019e27",
    "timestamp": "2025-07-18T20:52:18Z"
  },
  {
    "title": "Brazil court places restraints on Bolsonaro, citing Trump ties",
    "description": "BRASILIA: Brazil’s Supreme Court on Friday (July 18) issued search warrants and restrictions against former president Jair Bolsonaro, accusing him of seeking help from US President Dona",
    "link": "https://www.channelnewsasia.com/world/brazil-court-places-restraints-bolsonaro-citing-trump-ties-5246651",
    "timestamp": "2025-07-18T20:51:00Z"
  },
  {
    "title": "In firing Maurene Comey, Trump's Justice Department is hardly doing justice",
    "description": "It's hard not to see her departure as either punishment for being James Comey's daughter or the scapegoating of a vocal advocate for sexual abuse victims",
    "link": "https://www.msnbc.com/opinion/analysis/maurene-comey-firing-trump-epstein-rcna219447",
    "timestamp": "2025-07-18T20:49:21Z"
  },
  {
    "title": "Ishiba adopts hardline rhetoric as polls threaten his job",
    "description": "Among the many slogans used by politicians to rally support ahead of Sunday's parliamentary election, &quot;Do not underestimate us&quot; and &quot;Japanese First&quot; perhaps best capture the predicament facing Prime Minister Shigeru Ishiba. Ishiba, who hea…",
    "link": "https://japantoday.com/category/politics/focus-japan-pm-ishiba-adopts-hardline-rhetoric-as-polls-threaten-his-job",
    "timestamp": "2025-07-18T20:46:53Z"
  },
  {
    "title": "U.S. Treasury chief sure of 'good' tariff deal with Japan: Ishiba",
    "description": "Japanese Prime Minister Shigeru Ishiba on Friday quoted U.S. Treasury Secretary Scott Bessent as saying he believes the two countries can reach a &quot;good&quot; deal in the ongoing tariff negotiations. Bessent's comment came after Ishiba asked him to &quot;…",
    "link": "https://japantoday.com/category/politics/update4-u.s.-treasury-chief-sure-of-good-tariff-deal-with-japan-ishiba",
    "timestamp": "2025-07-18T20:46:37Z"
  },
  {
    "title": "Trump is beginning to implement his sweeping student-loan repayment changes",
    "description": "Trump's Department of Education is starting to implement student-loan repayment changes from the \"beautiful bill,\" including limits on debt relief.",
    "link": "https://www.businessinsider.com/beautiful-bill-trump-starts-implementing-student-loan-debt-repayment-changes-2025-7",
    "timestamp": "2025-07-18T20:46:15Z"
  },
  {
    "title": "WLFI token set to trade within eight weeks after 99.94% vote opens transfers",
    "description": "World Liberty Financial announced that its WLFI governance token will begin trading within six to eight weeks of July 18, completing a community mandate that authorized on-chain transfers and secondary market access.  According to the project’s announcement o…",
    "link": "https://cryptoslate.com/wlfi-token-set-to-trade-within-eight-weeks-after-99-94-vote-opens-transfers/",
    "timestamp": "2025-07-18T20:45:06Z"
  },
  {
    "title": "With soft power and moral clarity, ‘Agent Melania’ flexes for the defenseless",
    "description": "While diplomats debated and commentators postured, Melania Trump’s simple statement caused the leader of the free world to reflect.",
    "link": "https://nypost.com/2025/07/18/opinion/how-agent-melania-flexes-soft-power-for-the-defenseless/",
    "timestamp": "2025-07-18T20:44:47Z"
  },
  {
    "title": "EXCLUSIVE: Obnoxious Liberal Bureaucrats Hold Saddest Rally Ever, Prove That Trump Was Right To Fire Them",
    "description": "FOGGY BOTTOM—A handful of disgruntled former bureaucrats gathered outside the U.S. State Department headquarters on Friday to rally public support for \"recently fired state department employees\"—a cause no one cares about. They attempted to make the case that…",
    "link": "https://freebeacon.com/politics/exclusive-obnoxious-liberal-bureaucrats-hold-saddest-rally-ever-prove-that-trump-was-right-to-fire-them/",
    "timestamp": "2025-07-18T20:44:30Z"
  },
  {
    "title": "El Salvador to send detained Venezuelans home in swap for Americans, sources say",
    "description": "El Salvador's government will send detained Venezuelans home in exchange for Americans held in Venezuela, two U.S. government officials told Reuters on Friday, as Venezuela announced the return of seven migrant children who had been separated from their famil…",
    "link": "https://japantoday.com/category/world/el-salvador-to-send-detained-venezuelans-home-in-swap-for-americans-sources-say",
    "timestamp": "2025-07-18T20:43:57Z"
  },
  {
    "title": "Brazil court orders raids, restraints on Bolsonaro for Trump collusion",
    "description": "Brazil's Supreme Court issued search warrants and restraining orders against former President Jair Bolsonaro on Friday, banning him from contacting foreign officials over allegations he had courted the interference of U.S. President Donald Trump. Federal poli…",
    "link": "https://japantoday.com/category/world/brazil-court-orders-raids-restraints-on-bolsonaro-for-trump-collusion",
    "timestamp": "2025-07-18T20:43:48Z"
  },
  {
    "title": "U.S. judge weighs putting new block on Trump's birthright citizenship order",
    "description": "A group of Democratic-led states urged a federal judge in Boston on Friday to deal another blow to President Donald Trump's attempts to limit birthright citizenship, even though a U.S. Supreme Court decision last month made it more difficult for lower courts …",
    "link": "https://japantoday.com/category/world/us-judge-weighs-putting-new-block-on-trump%27s-birthright-citizenship-order2",
    "timestamp": "2025-07-18T20:43:28Z"
  },
  {
    "title": "Trump administration seeks release of Epstein grand jury records but not Justice Department files",
    "description": "Under intense pressure from President Donald Trump's own supporters, his administration now says it will push a court to unseal secret documents related to Jeffrey Epstein's case in an effort to put to rest for good a political crisis largely of its own makin…",
    "link": "https://japantoday.com/category/world/trump-administration-seeks-release-of-epstein-grand-jury-records-but-not-justice-department-files",
    "timestamp": "2025-07-18T20:43:01Z"
  },
  {
    "title": "Here’s Every Known Association Between Donald Trump And Jeffrey Epstein",
    "description": "Before Trump allegedly wrote Epstein a 50th birthday message, he had flown on his private jet seven times.",
    "link": "https://www.forbes.com/sites/saradorn/2025/07/18/heres-every-known-association-between-donald-trump-and-jeffrey-epstein/",
    "timestamp": "2025-07-18T20:42:26Z"
  },
  {
    "title": "Trump Signs GENIUS Bill as Private Stablecoins Corner CBDCs in Digital Dollar Race",
    "description": "It finally happened. On Friday (July 18), at a White House Ceremony, U.S. President Donald Trump signed into law the country’s first-ever piece of crypto legislation, the GENIUS Act.\n \n [contact-form-7]\n \n \nIn response to the regulatory momentum that appears …",
    "link": "https://biztoc.com/x/b0bbbd6b0d74d614",
    "timestamp": "2025-07-18T20:40:52Z"
  },
  {
    "title": "Venezuela releases 10 Americans in deal that frees deported migrants sent to El Salvador by Trump",
    "description": "El Salvador will send back some 300 Venezuelan migrants after the Trump administration agreed to pay $6 million to house them in a notorious Salvadoran prison. The",
    "link": "https://nypost.com/2025/07/18/us-news/venezuela-releases-jailed-americans-in-deal-that-also-frees-migrants-deported-to-el-salvador-by-us/",
    "timestamp": "2025-07-18T20:40:15Z"
  },
  {
    "title": "Trump Halts Clean Air Laws For Most of the Country",
    "description": "President Donald Trump signedfourseparateproclamations granting blanket exemptions to over 100 facilities, including chemical plants, coal-fired power plants, commercial sterilizers, and taconite mills, allowing them to ignore clean air standards and release …",
    "link": "https://www.commondreams.org/newswire/trump-halts-clean-air-laws-for-most-of-the-country",
    "timestamp": "2025-07-18T20:39:30Z"
  },
  {
    "title": "Florida justices uphold DeSantis’ racist gerrymander",
    "description": "Florida’s Supreme Court turned the definition of “racism” on its head, approving a redrawing of the state’s congressional districts, OK’ing a Jim Crow-style power grab by state Republicans and backed by Gov. Ron DeSantis.",
    "link": "https://www.msnbc.com/top-stories/latest/florida-gerrymander-ron-desantis-rcna219656",
    "timestamp": "2025-07-18T20:38:04Z"
  },
  {
    "title": "Trump claims Epstein files are faked, but many documents have been public for years",
    "description": "Trump alleged, without evidence, that former Biden officials doctored the files.",
    "link": "https://abcnews.go.com/US/trump-claims-epstein-files-faked-documents-public-years/story?id=123837954",
    "timestamp": "2025-07-18T20:37:43Z"
  },
  {
    "title": "Pete Hegseth Announces Dangerous Expansion of ICE’s Powers",
    "description": "Defense Secretary Pete Hegseth is now allowing ICE to use U.S. military bases to detain undocumented immigrants as part of Donald Trump’s sweeping deportation efforts. In a brief letter signed Tuesday, Hegseth approved Camp Atterbury in Indiana and Joint Base…",
    "link": "https://newrepublic.com/post/198138/pete-hegseth-expansion-ice-powers",
    "timestamp": "2025-07-18T20:37:32Z"
  },
  {
    "title": "Donald Trump's lawsuit against Bob Woodward over audiobook is dismissed",
    "description": "NEW YORK (Reuters) -Donald Trump cannot pursue his nearly $50 million lawsuit against the journalist Bob Woodward for publishing tapes from interviews for...",
    "link": "https://ca.news.yahoo.com/donald-trumps-lawsuit-against-bob-203628947.html",
    "timestamp": "2025-07-18T20:36:28Z"
  },
  {
    "title": "Senate Dem Claims Trump’s DOJ Told FBI Agents to ‘Flag’ Any Epstein Files Mentioning the President",
    "description": "Sen. Dick Durbin (D-IL) accused the Department of Justice of telling FBI agents to \"flag\" any Jeffrey Epstein files that mentioned President Donald Trump.\nThe post Senate Dem Claims Trump’s DOJ Told FBI Agents to ‘Flag’ Any Epstein Files Mentioning the Presid…",
    "link": "https://www.mediaite.com/politics/senate-dem-claims-trumps-doj-told-fbi-agents-to-flag-any-epstein-files-mentioning-the-president/",
    "timestamp": "2025-07-18T20:33:13Z"
  },
  {
    "title": "Trump says Coca-Cola is switching from high-fructose corn syrup to cane sugar. Is it better for you?",
    "description": "Trump says Coca-Cola is switching from high-fructose corn syrup to cane sugar. Is it better for you?go.com",
    "link": "https://abcnews.go.com/Health/trump-coca-cola-switching-high-fructose-corn-syrup/story?id=123827599",
    "timestamp": "2025-07-18T20:33:00Z"
  },
  {
    "title": "Trading Day: Tariff cloud reappears over sunny Wall Street",
    "description": "The S&P 500 and Nasdaq touched new highs on Friday before cooling off following a report that U.S. President Donald Trump is pushing for a minimum 15-20...",
    "link": "https://finance.yahoo.com/news/trading-day-tariff-cloud-reappears-203248227.html",
    "timestamp": "2025-07-18T20:32:48Z"
  },
  {
    "title": "El Salvador and US negotiate prisoner swap with Venezuela",
    "description": "Some 250 Venezuelans deported from the US to El Salvador will be exchanged for 10 Americans held in Caracas, according to officials.",
    "link": "https://www.bbc.com/news/articles/c4gd4ye41ymo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-18T20:32:33Z"
  },
  {
    "title": "El Salvador and US negotiate prisoner swap with Venezuela",
    "description": "Some 250 Venezuelans deported from the US to El Salvador will be exchanged for 10 Americans held in Caracas, according to officials.",
    "link": "https://www.bbc.com/news/articles/c4gd4ye41ymo",
    "timestamp": "2025-07-18T20:32:28Z"
  },
  {
    "title": "Can XRP Flip Ethereum? Crypto Expert Predicts Monster Altcoin Season Is Coming",
    "description": "With altcoin season potentially on the horizon, discussions have arisen about whether XRP can surpass Ethereum during this run. Crypto founder Arthur Hayes has made a case for ETH leading the way, while Dom Kwok, another crypto founder, believes XRP will pull…",
    "link": "https://bitcoinist.com/can-xrp-flip-ethereum/",
    "timestamp": "2025-07-18T20:30:21Z"
  },
  {
    "title": "Army veteran and US citizen arrested in California immigration raid warns others",
    "description": "He says federal agents never told him why he was arrested nor allowed him to contact a lawyer or his family during his three-day detention.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_daf64d1b-626f-574f-a28e-684f22f0e3fd.html",
    "timestamp": "2025-07-18T20:30:00Z"
  },
  {
    "title": "'Ludicrously dumb’: Right-wing outlet mocked over smear of WSJ Trump‑Epstein reporter",
    "description": "Since the bombshell Wall Street Journal story dropped last night detailing President Donald Trump's lewd birthday letter to deceased financier and sex trafficker Jeffrey Epstein, some MAGA activists are seeking to discredit the authenticity of the reporting.S…",
    "link": "https://www.rawstory.com/epstein/",
    "timestamp": "2025-07-18T20:29:56Z"
  },
  {
    "title": "US closes flat to lower amid Trump's tougher stance on EU",
    "description": "Wall Street ended flat to lower Friday as investors shrugged off fresh trade tensions and crypto legislation. According to the Financial Times, President Donald Trump is now demanding a baseline 15–20...",
    "link": "https://biztoc.com/x/608374c0fb9ccc07",
    "timestamp": "2025-07-18T20:29:46Z"
  },
  {
    "title": "Donald Trump Jr.-Backed Gun Stock Fizzles First Week on Market",
    "description": "Trump Jr. is a board member, shareholder and adviser for GrabAGun and rang the opening bell at the NYSE as the company went public.",
    "link": "https://biztoc.com/x/79d222e890c99844",
    "timestamp": "2025-07-18T20:29:44Z"
  }
]