[
  {
    "title": "Why 72% of American Jews disapprove of Trump (Jason Sattler/THE FARCE)",
    "description": "Jason Sattler / THE FARCE:\nWhy 72% of American Jews disapprove of Trump  —  American Jews continue to reject Donald Trump overwhelmingly.  —  A new poll from the Mellman Group finds: … The disapproval extends, but not as overwhelmingly, to how Trump is “handl…",
    "link": "https://www.memeorandum.com/250425/p20",
    "timestamp": "2025-04-25T12:20:01Z"
  },
  {
    "title": "‘Can You Give SNL An Exception?' Bowen Yang Made A Hilarious Argument For Why Saturday Night Live Should Be Allowed To Say 'S---' And 'F---' On Air",
    "description": "He's not wrong.",
    "link": "https://www.cinemablend.com/television/bowen-yang-made-hilarious-argument-why-saturday-night-live-should-be-allowed-swear",
    "timestamp": "2025-04-25T12:15:30Z"
  },
  {
    "title": "Institutional Players Bet an Extra $509.9M on Solana Treasury – Solaxy Might Help Solana Top Ethereum",
    "description": "Two major institutional players – SOL Strategies and DeFi Development Corp – recently injected $509.9M combined into their Solana treasury incentives. The investment strategy echoes MicroStrategy, but this time, it’s Solana ($SOL) rather than Bitcoin ($BTC). …",
    "link": "https://bitcoinist.com/institutional-players-bet-an-big-on-solana-treasury/",
    "timestamp": "2025-04-25T12:14:26Z"
  },
  {
    "title": "US futures down after Trump's tariff comments",
    "description": "United States market futures turned to losses on Friday after US President Donald Trump said he would consider it a \"total victory\" if his administration still imposed tariffs up to 50% a year from no...",
    "link": "https://biztoc.com/x/56b2dab41058ee12",
    "timestamp": "2025-04-25T12:14:12Z"
  },
  {
    "title": "Trump 'did not expect this reaction' during tariff negotiations: MSNBC financial analyst",
    "description": "Donald Trump misplayed what he thought was a winning hand when he decided to start a trade war with China .That is the opinion of MSNBC contributor and financial analyst Steve Rattner who appeared on \"Morning Joe\" on Friday to deliver bad news to American con…",
    "link": "https://www.rawstory.com/trump-2671843553/",
    "timestamp": "2025-04-25T12:12:32Z"
  },
  {
    "title": "Forbes Daily: Alphabet’s Hot Start To 2025 Despite Uncertainty",
    "description": "Today’s Forbes Daily newsletter covers China considering exemptions from steep tariff rate, companies scale back on Pride Month, Tesla's lingering problems and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/04/25/forbes-daily-alphabets-hot-start-to-2025-despite-uncertainty/",
    "timestamp": "2025-04-25T12:09:26Z"
  },
  {
    "title": "How the public's shift on immigration paved the way for Trump's crackdown",
    "description": "Since returning to the White House, President Donald Trump has launched an unprecedented campaign of immigration enforcement that has pushed the limits of executive power and clashed with federal judges trying to restrain him",
    "link": "https://abcnews.go.com/US/wireStory/publics-shift-immigration-paved-trumps-crackdown-121153900",
    "timestamp": "2025-04-25T12:07:55Z"
  },
  {
    "title": "Trump Says He’ll Wrap Up Trade Deals Soon",
    "description": "\"President Donald Trump said he expected to wrap up trade deals with U.S. partners looking for lower tariffs soon,\" Bloomberg reports. Said Trump: \"I would say, over the next three to four weeks, and we’re",
    "link": "https://politicalwire.com/2025/04/25/trump-says-hell-wrap-up-trade-deals-soon/",
    "timestamp": "2025-04-25T12:06:46Z"
  },
  {
    "title": "Transcript: Trump’s Ugly Admission about Putin Wrecks “Dealmaker” Scam",
    "description": "The following is a lightly edited transcript of the April 25 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresiden…",
    "link": "https://newrepublic.com/article/194395/transcript-trump-ugly-admission-putin-wrecks-dealmaker-scam",
    "timestamp": "2025-04-25T12:05:56Z"
  },
  {
    "title": "CNN Host Scolds Scott Jennings for Cutting In to Defend Trump: ‘I Care When You Overtalk Me’",
    "description": "CNN's Laura Coates scolded GOP analyst Scott Jennings for interrupting her to continue defending President Donald Trump over his attacks on judges.\nThe post CNN Host Scolds Scott Jennings for Cutting In to Defend Trump: ‘I Care When You Overtalk Me’ first app…",
    "link": "https://www.mediaite.com/news/cnn-host-scolds-scott-jennings-for-cutting-in-to-defend-trump-i-care-when-you-overtalk-me/",
    "timestamp": "2025-04-25T12:05:54Z"
  },
  {
    "title": "Trump’s first-term pick to run the National Science Foundation quits: ‘I have done all I can’",
    "description": "The head of the US National Science Foundation, a $9 billion agency charged with advancing discoveries across the scientific spectrum, resigned Thursday amid sweeping changes spearheaded by the current Trump administration. NSF Director Sethuraman Panchanatha…",
    "link": "https://freerepublic.com/focus/f-news/4313148/posts",
    "timestamp": "2025-04-25T12:05:32Z"
  },
  {
    "title": "Trump says 'Crimea will stay with Russia' as he seeks end to war in Ukraine",
    "description": "President Trump stated Crimea will remain with Russia, urging Ukraine to concede for peace, while accusing Zelenskyy of prolonging the war. Simultaneously, Russia continues its attacks, with a deadly drone strike in Pavlohrad. Amidst stalled peace efforts and…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-crimea-will-stay-with-russia-as-he-seeks-end-to-war-in-ukraine/articleshow/120619707.cms",
    "timestamp": "2025-04-25T12:03:33Z"
  },
  {
    "title": "Trump Pushes AI Education In Schools, Rolling Back Obama-Era Policies And Cracking Down On Foreign Funds: 'AI Seems To Be Where It's At'",
    "description": "President Donald Trump signed a distinct set of executive orders on April 23 aimed at reconfiguring U.S. education policy across K-12 and higher education. The directives include encouraging artificial intelligence education in schools, reformulating college …",
    "link": "https://biztoc.com/x/5cb2e3f7949477bc",
    "timestamp": "2025-04-25T12:03:03Z"
  },
  {
    "title": "Putin Ally Says Moscow Is ‘Ready’ For Deal With Trump To End Ukraine War",
    "description": "Sergei Lavrov appeared to defend Russia’s Thursday attack on Kyiv, which was condemned by President Donald Trump.",
    "link": "https://www.huffpost.com/entry/sergei-lavrov-says-russia-ready-for-deal-ukraine-war_n_680b653be4b042d12485b1c4",
    "timestamp": "2025-04-25T12:02:51Z"
  },
  {
    "title": "Don’t Rule Out a US-Iran Nuclear Deal Just Yet",
    "description": "Amid heightened geopolitical tensions, renewed talks between the United States and Iran may hold unexpected potential. Despite decades of hostility, Iran’s struggling economy and US President Donald Trump’s quest for a legacy-defining diplomatic achievement c…",
    "link": "https://www.project-syndicate.org/commentary/us-iran-nuclear-deal-is-possible-despite-hostility-by-richard-haass-2025-04",
    "timestamp": "2025-04-25T12:02:11Z"
  },
  {
    "title": "Trump says he is unaware of detained Turkish student case",
    "description": "U.S. President Donald Trump stated that he was \"not aware\" of the situation regarding detained Turkish Ph.D. student Rümeysa Öztürk, but said he could request the relevant authorities to release any evidence regarding the case.",
    "link": "https://www.hurriyetdailynews.com/trump-says-he-is-unaware-of-detained-turkish-student-case-208476",
    "timestamp": "2025-04-25T12:01:30Z"
  },
  {
    "title": "Trump: 'I am ready to meet with Khamenei'",
    "description": "In an interview with Time magazine, the U.S. president claims he did not prevent an attack against the nuclear facilities but noted that he is ready to meet with Khamenei.",
    "link": "https://www.israelnationalnews.com/news/407402",
    "timestamp": "2025-04-25T12:01:08Z"
  },
  {
    "title": "How Not to Fight a Trade War",
    "description": "This week, the stock market yo-yoed wildly, taking investors on a roller coaster of stunning lows and sudden highs. Rarely has investment been so gut-churning.... Read More\nThe post How Not to Fight a Trade War appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/04/25/how-fight-trade-war/",
    "timestamp": "2025-04-25T12:01:00Z"
  },
  {
    "title": "Netflix Co-CEO Reveals Why Streaming Giant Is Not In China: \"They Had No...\"",
    "description": "Netflix co-CEO Ted Sarandos said he spent years working to get a foothold in China but the entire exercise led nowhere.",
    "link": "https://www.ndtv.com/feature/netflix-co-ceo-reveals-why-streaming-giant-is-not-in-china-they-had-no-8254731",
    "timestamp": "2025-04-25T12:00:48Z"
  },
  {
    "title": "The Latin American Pope",
    "description": "How Pope Francis’s Argentine roots shaped his geopolitics.",
    "link": "http://foreignpolicy.com/2025/04/25/pope-francis-death-catholic-church-argentina-politics-diplomacy/",
    "timestamp": "2025-04-25T12:00:46Z"
  },
  {
    "title": "Federal agencies are hiring seasonal firefighters in Colorado as summer approaches",
    "description": "The one potential cut that could impact Colorado’s wildfire preparedness could come from AmeriCorps, a federal work program, which includes firefighting in its mission.",
    "link": "https://www.denverpost.com/2025/04/25/colorado-wildfire-outlook-2025-federal-firefighters/",
    "timestamp": "2025-04-25T12:00:46Z"
  },
  {
    "title": "Read the Full Transcript of Donald Trump's '100 Days' Interview With TIME (Time)",
    "description": "Time:\nRead the Full Transcript of Donald Trump's ‘100 Days’ Interview With TIME  —  President Donald Trump sat down for an interview with TIME at the White House on April 22.  —  Over the course of the interview, Trump discussed a wide range of issues, includ…",
    "link": "https://www.memeorandum.com/250425/p18",
    "timestamp": "2025-04-25T12:00:44Z"
  },
  {
    "title": "Crypto Analyst Says Dogecoin Is Repeating History – Here’s What Happened",
    "description": "The Dogecoin price has failed to revisit its all-time high of 2021 and is, in fact, trading 75% below its $0.73 ATH after a series of crashes rocked the crypto market. These crashes were spurred by US President Donald Trump declaring an all-out tariff war. In…",
    "link": "https://bitcoinist.com/dogecoin-is-repeating-history/",
    "timestamp": "2025-04-25T12:00:30Z"
  },
  {
    "title": "SPY TALK: CIA’s Ratcliffe and Russian SVR’s Naryshkin Have ‘Constructive’ Phone Talk, May Meet Soon",
    "description": "Recent communications between the CIA and Russia's SVR signal a significant shift in diplomatic relations, raising questions about future negotiations and the implications for global security. Insights into this evolving dialogue warrant attention.\nThe post S…",
    "link": "https://www.thegatewaypundit.com/2025/04/spy-talk-cias-ratcliffe-russian-svrs-naryshkin-have/",
    "timestamp": "2025-04-25T12:00:04Z"
  },
  {
    "title": "Amazon sellers raise prices after Trump's China tariff: 'It's unsustainable'",
    "description": "Amazon third-party sellers are raising prices and looking for new suppliers after President Trump lifted tariffs on goods from China.",
    "link": "https://www.cnbc.com/2025/04/25/amazon-sellers-hike-prices-of-goods-after-trumps-china-tariffs.html",
    "timestamp": "2025-04-25T12:00:01Z"
  },
  {
    "title": "The Return of Stagflation",
    "description": "Trump’s tariffs could bring back an economic nightmare I thought we had left behind in the 1970s.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/06/trump-economy-tariffs-stagflation/682572/",
    "timestamp": "2025-04-25T12:00:00Z"
  },
  {
    "title": "US, Israel seek to expand Abraham Accords",
    "description": "U.S. President Donald Trump said more countries are interested in joining the Abraham Accords, the Washington-brokered normalization initiative between Israel and several Middle Eastern nations.",
    "link": "https://www.hurriyetdailynews.com/us-israel-seek-to-expand-abraham-accords-208474",
    "timestamp": "2025-04-25T11:57:59Z"
  },
  {
    "title": "Judges block Trump on voting, immigration, sanctuary cities, DEI",
    "description": "Federal judges have issued rulings against several Trump administration actions, including voter ID requirements, sanctuary city funding cuts, deportations and anti-DEI guidance.",
    "link": "https://www.kcci.com/article/judges-block-trump-admin-efforts-on-voting-immigration-sanctuary-cities-dei/64587103",
    "timestamp": "2025-04-25T11:56:18Z"
  },
  {
    "title": "Judges block Trump on voting, immigration, sanctuary cities, DEI",
    "description": "Federal judges have issued rulings against several Trump administration actions, including voter ID requirements, sanctuary city funding cuts, deportations and anti-DEI guidance.",
    "link": "https://www.wlwt.com/article/judges-block-trump-admin-efforts-on-voting-immigration-sanctuary-cities-dei/64587103",
    "timestamp": "2025-04-25T11:56:15Z"
  },
  {
    "title": "Judges blocks Trump push to cut funding to public schools over diversity programs",
    "description": "CONCORD, N.H. (AP) — A federal judge on Thursday blocked Trump administration directives that threatened to cut federal funding for public schools with diversity, equity and inclusion<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/judges-blocks-trump…",
    "link": "https://whdh.com/news/judges-blocks-trump-push-to-cut-funding-to-public-schools-over-diversity-programs/",
    "timestamp": "2025-04-25T11:55:40Z"
  },
  {
    "title": "Bill Maher Rips Larry David's 'My Dinner with Adolf' Trump Meeting Smear: 'Insulting to Six Million Dead Jews'",
    "description": "Bill Maher has responded to fellow comedian Larry David comparing his White House dinner with President Trump to dining with Adolf Hitler, calling it an insult to millions of dead Jews.\nThe post Bill Maher Rips Larry David’s ‘My Dinner with Adolf’ Trump Meeti…",
    "link": "https://www.breitbart.com/entertainment/2025/04/25/bill-maher-responds-to-larry-david-my-dinner-with-adolf-smear-insulting-to-six-million-dead-jews/",
    "timestamp": "2025-04-25T11:54:18Z"
  },
  {
    "title": "Most Americans expect higher prices due to Trump's tariffs",
    "description": "The survey finds many people fear the country is being steered into a recession and Trump’s broad and haphazardly enforced tariffs will cause prices to rise.",
    "link": "https://journalstar.com/news/nation-world/business/economy/article_9afd0728-12c5-5291-a9d9-703bcb813db8.html",
    "timestamp": "2025-04-25T11:53:29Z"
  },
  {
    "title": "Ukraine may have to cede land to Russia – Kiev mayor",
    "description": "The move could pave the way for “temporary peace,” Vitaly Klitschko has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616270-ukraine-may-cede-territories-klitschko/",
    "timestamp": "2025-04-25T11:53:09Z"
  },
  {
    "title": "Canadians put off by Trump's bluster and border arrests are booking far fewer U.S. visits",
    "description": "Trump's attacks on Canada's economy and threats to make it the 51st state have infuriated Canadians, who are cancelling trips to the U.S. in big numbers.",
    "link": "https://www.cbc.ca/news/canada/windsor/canadians-put-off-trump-bluster-border-arrests-1.7518416",
    "timestamp": "2025-04-25T11:53:00Z"
  },
  {
    "title": "Trump: Didn't stop Israel from striking Iran's nuclear sites",
    "description": "United States President Donald Trump said in a Time magazine interview published on Friday that he didn't stop Israel from hitting Iran's nuclear sites, but did make it uncomfortable for them to do so...",
    "link": "https://biztoc.com/x/70f1a59fc3f43cee",
    "timestamp": "2025-04-25T11:52:01Z"
  },
  {
    "title": "Sea Mining Stocks Soar As Trump Signs Executive Order To Jumpstart Sector",
    "description": "U.S. President Donald Trump signed an executive order Thursday to jumpstart the U.S. deep-sea mining industry. Trump seeks to secure domestic access to critical resources through this initiative and reduce America's dependence on foreign supply chains for inc…",
    "link": "https://biztoc.com/x/bb872e9665ea6d76",
    "timestamp": "2025-04-25T11:51:55Z"
  },
  {
    "title": "Trump Ousts Official Over Ties to ‘Anonymous’ Author",
    "description": "“The White House ousted a top customs official earlier this week primarily because of his alleged connections to the author of a 2018 opinion piece critical of President Donald Trump,” the Washington Post reports. “George",
    "link": "https://politicalwire.com/2025/04/25/trump-ousts-official-over-ties-to-anonymous-author/",
    "timestamp": "2025-04-25T11:51:18Z"
  },
  {
    "title": "Trump's envoy Witkoff meets Putin in Moscow",
    "description": "MOSCOW (Reuters) -U.S. President Donald Trump's envoy Steve Witkoff met President Vladimir Putin in Moscow on Friday at what Trump has said is a key moment in diplomacy to end the war in Ukraine. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/trump039s-envoy-witkoff-meets-putin-in-moscow",
    "timestamp": "2025-04-25T11:47:00Z"
  },
  {
    "title": "Canadians put off by Trump’s bluster and border arrests are booking far fewer US visits",
    "description": "There has been a big drop foreigners visiting the U.S. since Trump took office, and Canadians are no exception.",
    "link": "https://www.denverpost.com/2025/04/25/canada-us-travel/",
    "timestamp": "2025-04-25T11:46:45Z"
  },
  {
    "title": "Canadians put off by Trump’s bluster and border arrests are booking far fewer US visits",
    "description": "There has been a big drop foreigners visiting the U.S. since Trump took office, and Canadians are no exception.",
    "link": "https://www.bostonherald.com/2025/04/25/canada-us-travel/",
    "timestamp": "2025-04-25T11:46:45Z"
  },
  {
    "title": "'Trump 2028 Hat' Merch Receives Backlash And Fuels Donald Trump's Third-Term Speculation On Social Media",
    "description": "Trump 2028 Hat refers to a viral internet controversy over U.S. President Donald Trump selling a red \"Trump 2028\" hat on his official website, suggesting a campaign for a third term as United States President. The hat was announced mid-April 2025 and spawned …",
    "link": "https://knowyourmeme.com/memes/events/trump-2028-hat",
    "timestamp": "2025-04-25T11:46:00Z"
  },
  {
    "title": "The Fed Just Quietly Primed Bitcoin And Crypto For A Huge Wall Street Price Game-Changer",
    "description": "The Federal Reserve has quietly rolled back rules that deterred Wall Street from engaging with bitcoin and crypto—just as institutional investors push up the bitcoin price...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/04/25/the-fed-just-quietly-primed-bitcoin-and-crypto-for-a-huge-wall-street-price-game-changer/",
    "timestamp": "2025-04-25T11:45:50Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to Friday, April 25, 2025, the last Friday in April, and National DNA Day, for it was this day in 1953, that the papers on the structure of the molecule were published in Nature.  Here’s the most famous one: Here’s an image of the DNA double helix tak…",
    "link": "https://whyevolutionistrue.com/2025/04/25/friday-hili-dialogue-523/",
    "timestamp": "2025-04-25T11:45:29Z"
  },
  {
    "title": "A Split in the Roganverse",
    "description": "Should the star podcaster take any responsibility for how he uses his power?",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/roganverse-split/682593/",
    "timestamp": "2025-04-25T11:45:00Z"
  },
  {
    "title": "Bitcoin has skyrocketed recently – SIX MINING provides you with stable passive income",
    "description": "London, UK, April 25, 2025 (GLOBE NEWSWIRE) -- London, UK Apr 24, 2025 (Copper) Affected by the latest trade policy of US President Donald Trump, the global market is volatile, but cryptocurrencies are rising against the trend - Bitcoin has broken through the…",
    "link": "https://www.globenewswire.com/news-release/2025/04/25/3068243/0/en/Bitcoin-has-skyrocketed-recently-SIX-MINING-provides-you-with-stable-passive-income.html",
    "timestamp": "2025-04-25T11:45:00Z"
  },
  {
    "title": "Trump envoy in Moscow for talks with Putin: LIVE UPDATES",
    "description": "Steve Witkoff’s visit to Russia aims to advance a US-proposed peace plan that faces opposition from Ukraine and its Western supporters Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616284-trump-envoy-moscow-putin/",
    "timestamp": "2025-04-25T11:44:47Z"
  },
  {
    "title": "What's With Trump Organization Selling A 'Trump 2028 Hat'? Donald Trump's White House Third Term Speculation And Its Memes Explained",
    "description": "Here's what you need to know about the Trump 2028 hat controversy and the memes about it on social media.",
    "link": "https://knowyourmeme.com/editorials/guides/whats-with-the-trump-organization-selling-a-trump-2028-hat-donald-trumps-white-house-third-term-speculation-and-its-memes-explained",
    "timestamp": "2025-04-25T11:43:05Z"
  },
  {
    "title": "Beyond Ivy League, RFK Jr.’s NIH slashed science funding across states that backed Trump | CNN",
    "description": "The National Institutes of Health’s sweeping cuts of grants that fund scientific research are inflicting pain almost universally across the U.S., including in most states that backed President Donald Trump in the 2024 election.",
    "link": "https://www.cnn.com/2025/04/25/health/nih-science-funding-states-kff-health-news/index.html",
    "timestamp": "2025-04-25T11:41:26Z"
  },
  {
    "title": "Skelton: Yes, Newsom suing Trump over tariffs was political. It was also necessary",
    "description": "Give Gov. Gavin Newsom credit.\nYou can call it grandstanding and opportunistic, but suing President Donald Trump over tariffs was smart, bold and much needed.\nSure, it was political.\nNewsom adroitly leaped ahead of other potential 2028 presidential contenders…",
    "link": "https://biztoc.com/x/e29eef2a2009ebbf",
    "timestamp": "2025-04-25T11:41:21Z"
  },
  {
    "title": "Voters Align With Trump On DEI, ‘Transgender’ Bans: I&I/TIPP Poll",
    "description": "President Donald Trump’s executive orders forbidding transgender athletes from competing against females and eliminating so-called diversity, equity, and inclusion (DEI) programs in the federal government have been met with political opposition, outrage, and …",
    "link": "https://biztoc.com/x/75b6e6a0e57691c7",
    "timestamp": "2025-04-25T11:41:17Z"
  },
  {
    "title": "'Embarrassing': Elon Musk said to have 'little to show' for his time as 'first buddy'",
    "description": "Elon Musk will be leaving Washington with little to show for his controversial time in government, according to a new analysis.The tech billionaire spent more than $288 million of his own money to get Donald Trump re-elected and was rewarded with a perch over…",
    "link": "https://www.rawstory.com/elon-musk-first-buddy-embarrassing/",
    "timestamp": "2025-04-25T11:41:03Z"
  },
  {
    "title": "Resistance Democrats embrace combative, profanity-laced 'dark woke' rebrand to combat Trump",
    "description": "Texas Rep. Jasmine Crockett exemplifies new confrontational approach as party members reject 'respectability prison' in battle against MAGA Republicans. \"Resistance\" Democrats are starting to abandon civil politics in favor of a new provocative and combative …",
    "link": "https://freerepublic.com/focus/f-chat/4313140/posts",
    "timestamp": "2025-04-25T11:41:00Z"
  },
  {
    "title": "Japan is a test case for Donald Trump's tariff deals. But talks may be tortuous",
    "description": "During trade talks, Japan presented Trump with a 'Made in China' piggy bank, highlighting the complexities of global supply chains amid trade tensions. Negotiations aim for a swift deal, but Japan is hesitant to concede on key issues like agriculture due to d…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/japan-is-a-test-case-for-donald-trumps-tariff-deals-but-talks-may-be-tortuous/articleshow/120618835.cms",
    "timestamp": "2025-04-25T11:40:48Z"
  },
  {
    "title": "Silca sells out of new electric pumps instantly, after blaming Trump tariffs for just 100 available in US",
    "description": "Brand \"tried\" making it in America but \"it's not possible for less than $500\", the Elettrico Micro and Elettrico Ultimate snapped up at $119 and $159 by fast-fingered buyers",
    "link": "https://road.cc/content/tech-news/silca-sells-out-new-electric-pump-instantly-313699",
    "timestamp": "2025-04-25T11:40:40Z"
  },
  {
    "title": "Brian Kilmeade: Vladimir Putin is ‘Embarrassing President Trump’",
    "description": "Brian Kilmeade did not hold back Friday morning when he argued why President Trump is getting embarrassed by Russian President Putin amid stalled peace talks.\nThe post Brian Kilmeade: Vladimir Putin is ‘Embarrassing President Trump’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/brian-kilmeade-vladimir-putin-is-embarrassing-president-trump/",
    "timestamp": "2025-04-25T11:39:32Z"
  },
  {
    "title": "Meta Cracks Down on Spammy Facebook Posts with Monetisation Cuts, Fake Engagement Penalties",
    "description": "Meta will be limiting the reach of spam content and preventing such accounts from monetising as they stifle authentic voices as part of the crackdown. \nThe post Meta Cracks Down on Spammy Facebook Posts with Monetisation Cuts, Fake Engagement Penalties appear…",
    "link": "https://www.medianama.com/2025/04/223-facebook-cuts-reach-fake-accounts-spam-content/",
    "timestamp": "2025-04-25T11:39:24Z"
  },
  {
    "title": "988 suicide prevention service for LGBTQ+ youth would be eliminated under leaked budget proposal | CNN",
    "description": "The Trump administration is considering eliminating the 988 Suicide Prevention and Crisis Lifeline’s specialized services for LGBTQ+ youth as a way to cut back on funding for next year’s discretionary budget for mental health, according to an internal documen…",
    "link": "https://www.cnn.com/2025/04/25/health/988-lgbtq-funding-plan/index.html",
    "timestamp": "2025-04-25T11:38:57Z"
  },
  {
    "title": "Russia tests U.S. patience as Trump rushes to clinch Ukraine peace deal in first 100 days in office",
    "description": "U.S. special envoy Steve Witkoff is expected to carry out further peace talks with Russian President Vladimir Putin on Friday.",
    "link": "https://www.cnbc.com/2025/04/25/russia-tests-us-patience-trump-rushes-to-clinch-ukraine-peace-deal.html",
    "timestamp": "2025-04-25T11:36:33Z"
  },
  {
    "title": "Democratic Party Looking for a Brand To Call Its Own",
    "description": "These days, a lot of Democrats are feeling like Will Rogers, who said on the eve of the Great Depression, \u0093I am not a member of any organized political...",
    "link": "https://www.realclearpolitics.com/articles/2025/04/25/looking_for_a_brand_to_call_its_own__the_democratic_party_152700.html",
    "timestamp": "2025-04-25T11:35:53Z"
  },
  {
    "title": "Parents of kids with cancer fear GOP budget cuts could slash Medicaid",
    "description": "Tony, an energetic 7-year-old who loves playing football and roughhousing with his brothers wasn’t all that excited when his parents took the family to see Santa in December. Instead, he was tired and lethargic. Tony has been in and out of the hospital, his b…",
    "link": "https://freerepublic.com/focus/f-news/4313138/posts",
    "timestamp": "2025-04-25T11:34:34Z"
  },
  {
    "title": "Apple aims to build most U.S.-bound iPhones in India",
    "description": "Apple Inc. is seeking to import most of the iPhones it sells in the U.S. from India by the end of next year. Read more.",
    "link": "https://financialpost.com/technology/apple-iphones-us-india-2026",
    "timestamp": "2025-04-25T11:31:05Z"
  },
  {
    "title": "‘60 Minutes’ turmoil underpins another busy week in journalism",
    "description": "The media world is still trying to sort out exactly what happened this week at one of CBS News’ most respected news properties, “60 Minutes.” Executive producer Bill Owens abruptly […]\nThe post ‘60 Minutes’ turmoil underpins another busy week in journalism ap…",
    "link": "https://www.poynter.org/commentary/2025/60-minutes-turmoil-why-bill-owns-left/",
    "timestamp": "2025-04-25T11:30:12Z"
  },
  {
    "title": "Most Americans expect higher prices as a result of Trump's tariffs, new AP-NORC poll finds",
    "description": "The survey finds many people fear the country is being steered into a recession and Trump’s broad and haphazardly enforced tariffs will cause prices to rise.",
    "link": "https://richmond.com/news/nation-world/business/economy/article_db0c9c1e-ea0f-5b0d-b2af-55bd1d8053f3.html",
    "timestamp": "2025-04-25T11:30:00Z"
  },
  {
    "title": "An Odd Pick for Surgeon General",
    "description": "Plus: Copycat reporters, roadway immigration sweeps, and a vivid report from Sudan's remaining soup kitchens.",
    "link": "https://www.cjr.org/laurels-and-darts/nesheiwat-upstate-new-york-ice-immigration-73-million-lawsuit-doge.php",
    "timestamp": "2025-04-25T11:30:00Z"
  },
  {
    "title": "Most Americans expect higher prices as a result of Trump's tariffs, new AP-NORC poll finds",
    "description": "The survey finds many people fear the country is being steered into a recession and Trump’s broad and haphazardly enforced tariffs will cause prices to rise.",
    "link": "https://roanoke.com/news/nation-world/business/economy/article_3ba91bfc-8dc4-52cf-b03d-815ced772d26.html",
    "timestamp": "2025-04-25T11:30:00Z"
  },
  {
    "title": "After Arkansas: The Future Of FEMA And Disaster Relief In America",
    "description": "What the current administration's decision to decline FEMA support to Arkansas means for the future of disaster relief in America.",
    "link": "https://www.forbes.com/sites/alexanderpuutio/2025/04/25/after-arkansas-the-future-of-fema-and-disaster-relief-in-america/",
    "timestamp": "2025-04-25T11:30:00Z"
  },
  {
    "title": "What will be buried with Pope Francis ahead of funeral tomorrow",
    "description": "Thousands of mourners have visited Pope Francis' open casket this week following his death.",
    "link": "https://www.ladbible.com/news/world-news/pope-francis-funeral-buried-with-coffin-casket-851546-20250425",
    "timestamp": "2025-04-25T11:29:55Z"
  },
  {
    "title": "Voltaire, International Newsletter N°130, by Thierry Meyssan",
    "description": "Our director of publication and editor-in-chief directed French magazines several years ago, and has won journalism awards abroad. He has regularly contributed to some fifteen major dailies and magazines around the world. Voltaire, International Newsletter is…",
    "link": "https://www.voltairenet.org/article222160.html",
    "timestamp": "2025-04-25T11:26:13Z"
  },
  {
    "title": "The American Public Must Resist Trump’s ‘Papers, Please’ Politics",
    "description": "People of a certain age will remember the old black-and-white movies, The Twilight Zone, and countless Cold War-era dramas set in Nazi Germany or the Soviet Union. In scene after chilling scene, people in uniform approach random pedestrians and bark, “Papers,…",
    "link": "https://www.commondreams.org/opinion/trump-papers-please-authoritarianism",
    "timestamp": "2025-04-25T11:26:02Z"
  },
  {
    "title": "Trump envoy arrives for talks with Putin – Kremlin",
    "description": "Steve Witkoff’s visit to Russia aims to advance a US-proposed peace plan that faces opposition from Ukraine and its Western supporters Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616263-trump-envoy-arrives-for-talks-with-putin/",
    "timestamp": "2025-04-25T11:25:33Z"
  },
  {
    "title": "Trump Eyes 50% Tariffs, Says 'Bond Market Got the Yips': Live Updates",
    "description": "Trump defends steep tariffs, calls 50% duties a \"victory\" and shrugs off market turmoil, saying the bond market \"got the yips.\" Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/donald-trump-administration-time-100-days-live-updates-2064091",
    "timestamp": "2025-04-25T11:25:30Z"
  },
  {
    "title": "Rebalancing Checks and Balances: How to Curb Executive Abuse",
    "description": "In his second term, U.S. President Donald Trump has moved aggressively to expand the authority of the executive branch, thereby upending our traditional system of checks and balances among the three branches of government. Reforming this system while he still…",
    "link": "https://www.commondreams.org/opinion/protect-checks-and-balances",
    "timestamp": "2025-04-25T11:23:03Z"
  },
  {
    "title": "Trump administration live updates: Ex-Rep. George Santos to be sentenced; Trump to attend Pope's funeral",
    "description": "Live updates and the latest news as Ex-Rep. George Santos is sentenced on felony fraud charges and President Donald Trump travels to Rome to attend Pope Francis' funeral.",
    "link": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-tariffs-china-immigration-doge-live-updates-rcna202928",
    "timestamp": "2025-04-25T11:22:46Z"
  },
  {
    "title": "Trump lashes out at Putin; China says there've been no trade talks",
    "description": "President Donald Trump is insisting there have been discussions with China on tariffs, but China is denying these claims saying Trump should not “mislead the public.” It comes as the Trump is delivering a rare rebuke of Vladimir Putin after Russia launched a …",
    "link": "https://www.today.com/video/trump-should-not-mislead-us-about-tariff-negotiations-china-says-238320709705",
    "timestamp": "2025-04-25T11:22:13Z"
  },
  {
    "title": "Trump says had call with China's Xi on tariffs: US media",
    "description": "In a recent interview with TIME Magazine, US President Donald Trump stated he discussed tariffs with China's Xi Jinping amidst an escalating trade war. Trump's levies on Chinese goods have surged to 145 percent, prompting denials of trade negotiations from Ch…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-had-call-with-chinas-xi-on-tariffs-us-media/articleshow/120618083.cms",
    "timestamp": "2025-04-25T11:22:06Z"
  },
  {
    "title": "Trump's migration stance overshadowed ties with Pope Francis",
    "description": "After Pope Francis' death, President Trump ordered flags lowered. This action contrasts with their past disagreements. Trump will attend the funeral in Rome with his wife. He praised the Pope, despite earlier clashes over immigration. Their differences began …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-migration-stance-overshadowed-ties-with-pope-francis/articleshow/120618045.cms",
    "timestamp": "2025-04-25T11:21:30Z"
  },
  {
    "title": "Trump and Zelenskyy among dignitaries converging on Rome for funeral of Pope Francis",
    "description": "U.S. President Donald Trump and Argentine President Javier Milei are among the leaders arriving Friday.",
    "link": "https://www.bostonherald.com/2025/04/25/vatican-pope-trump-zelenskyy-attendees/",
    "timestamp": "2025-04-25T11:20:54Z"
  },
  {
    "title": "Russia kills 5 people in Ukraine as US envoy Witkoff arrives in Moscow",
    "description": "Lavrov says US-proposed peace deal with Ukraine moving in the right direction, but requires adjustments.",
    "link": "https://www.aljazeera.com/news/2025/4/25/russian-drone-attack-kills-five-in-ukraine-including-child",
    "timestamp": "2025-04-25T11:20:18Z"
  },
  {
    "title": "Ukraine may have to cede land ‘temporarily’ for peace: Kiev mayor",
    "description": "Ukraine may have to cede territory in order to secure \"temporary\" peace with Russia, Kiev mayor Vitali Klitschko told the BBC in an interview published on April 24.",
    "link": "https://www.hurriyetdailynews.com/ukraine-may-have-to-cede-land-temporarily-for-peace-kiev-mayor-208470",
    "timestamp": "2025-04-25T11:18:37Z"
  },
  {
    "title": "FIRST READING: Analysts predict loonie to rally in case of Conservative win",
    "description": "Assumption is that trade war would wrap up sooner under Poilievre",
    "link": "https://nationalpost.com/opinion/analysts-predict-loonie-to-rally-in-case-of-conservative-win",
    "timestamp": "2025-04-25T11:14:35Z"
  },
  {
    "title": "US-Iran nuclear talks explained | Start Here",
    "description": "Trump, Iran and everything you need to know about the nuclear talks.",
    "link": "https://www.aljazeera.com/program/start-here/2025/4/25/us-iran-nuclear-talks-explained-start-here",
    "timestamp": "2025-04-25T11:14:02Z"
  },
  {
    "title": "Higher tariffs could keep a stockpile of unused products and fears over Medicaid funding: Morning Rundown",
    "description": "Companies warn stores could see far less stocked shelves unless Trump changes his tune on tariffs. A woman worries that potential cuts to Medicaid would threaten life-saving treatments for her son. And a polarizing NFL prospect remains on the board for the dr…",
    "link": "https://www.nbcnews.com/news/us-news/higher-tariffs-keep-stockpile-unused-products-fears-medicaid-funding-m-rcna202939",
    "timestamp": "2025-04-25T11:13:52Z"
  },
  {
    "title": "Ukraine says Russia kills 3 in another drone attack after Trump rebukes Putin",
    "description": "The strike happened one day after US President Donald Trump rebuked Russia’s leader for a deadly missile and drone attack on Kyiv.",
    "link": "https://nypost.com/2025/04/25/world-news/ukraine-says-russia-kills-3-in-another-drone-attack-after-trump-rebukes-putin/",
    "timestamp": "2025-04-25T11:13:42Z"
  },
  {
    "title": "Brandon Johnson: Tariffs Are Costing City, I Want to Raise Taxes",
    "description": "During an interview with WVON on Thursday, Chicago Mayor Brandon Johnson said “the fluctuations of the market and Trump’s tariffs” have resulted in massive losses to the city “just because of the uncertainty and the chaos.” And also stated that\nThe post Brand…",
    "link": "https://www.breitbart.com/clips/2025/04/25/brandon-johnson-tariffs-are-costing-city-i-want-to-raise-taxes/",
    "timestamp": "2025-04-25T11:11:18Z"
  },
  {
    "title": "Trump Just Pardoned One Of The Worst Fraudsters Imaginable",
    "description": "When Conover Kennard wrote about Fiore’s conviction on all seven counts of her federal fraud case (each of which could lead to 20 years in prison), we learned that Fiore spent the money donors thought would go to the memorial on “rent, plastic surgery, and he…",
    "link": "https://crooksandliars.com/2025/04/trump-just-pardoned-one-worst-fraudsters",
    "timestamp": "2025-04-25T11:10:35Z"
  },
  {
    "title": "Boeing will find it ‘relatively easy’ to find customers for China’s rejected planes, says jet leasing CEO",
    "description": "China’s refusal to accept Boeing planes has become one of the most visible flashpoints of the U.S.-China trade war. Beijing has even sent planes assembled in China back to the U.S. as it retaliates against steep tariffs imposed by President Donald Trump. \nBoe…",
    "link": "https://biztoc.com/x/e8f432744ac828a3",
    "timestamp": "2025-04-25T11:08:31Z"
  },
  {
    "title": "Trump: I didn't stop Israel from striking Iran's nuclear sites",
    "description": "United States President Donald Trump said in a Time magazine interview published on Friday that he didn't stop Israel from hitting Iran's nuclear sites, but did make it uncomfortable for them to do so...",
    "link": "https://biztoc.com/x/271e511f5098d6e5",
    "timestamp": "2025-04-25T11:08:08Z"
  },
  {
    "title": "Steve Rattner: Trump is 'desperate' to show progress on tariffs",
    "description": "China on Thursday directly contradicted President Donald Trump’s claims that Beijing and Washington are actively discussing resolutions to a trade war that threatens to upend the global economy. The Morning Joe panel discusses.",
    "link": "https://biztoc.com/x/9c24b3636bb87711",
    "timestamp": "2025-04-25T11:08:03Z"
  },
  {
    "title": "Poll slump shows Trump honeymoon period is over",
    "description": "Donald Trump’s honeymoon period is over — if it ever existed at all.",
    "link": "https://www.independent.ie/world-news/poll-slump-shows-trump-honeymoon-period-is-over/a1200445310.html",
    "timestamp": "2025-04-25T11:07:59Z"
  },
  {
    "title": "Steve Bannon Makes Bold Prediction About Karoline Leavitt’s Future",
    "description": "Steve Bannon offered the bullish prediction that White House Press Secretary Karoline Leavitt won’t be behind the podium for long and that President Donald Trump may offer her a major cabinet position. “After she’s spokesman for a year or two, I think she’s g…",
    "link": "https://www.mediaite.com/news/steve-bannon-makes-bold-prediction-about-karoline-leavitts-future/",
    "timestamp": "2025-04-25T11:06:57Z"
  },
  {
    "title": "Trump Orders Probe Into Democratic Fundraising Platform ActBlue; Bondi To Report Findings Within 180 Days",
    "description": "ActBlue said it will pursue all legal options to protect and defend itself.",
    "link": "https://www.ibtimes.com/trump-orders-probe-democratic-fundraising-platform-actblue-bondi-report-findings-within-180-days-3771357",
    "timestamp": "2025-04-25T11:05:01Z"
  },
  {
    "title": "Can Germany ditch its 1 and 2-cent coins?",
    "description": "Many countries have dropped low-denomination coins in the past. But can cash-loving Germany follow suit and stop accepting the smallest euro coins? Other European nations are showing the way.",
    "link": "https://www.dw.com/en/cash-hoarding-can-germany-ditch-its-billions-of-1-and-2-cent-coins/a-72216366",
    "timestamp": "2025-04-25T11:02:00Z"
  },
  {
    "title": "'Authoritarianism in Action': Trump Orders DOJ Probe of Democratic Donation Platform ActBlue",
    "description": "U.S. President Donald Trump on Thursday launched his latest attack on political opponents by directing the Justice Department to investigate ActBlue, a critical fundraising platform for Democrats and progressive organizations.\n\nThe order came in the form of a…",
    "link": "https://www.commondreams.org/news/donald-trump-actblue",
    "timestamp": "2025-04-25T11:01:01Z"
  }
]