[
  {
    "title": "‘I’m not a maniac’: Senator blocks hundreds of Trump nominees using tactic he once called ‘abuse of power’",
    "description": "'Their lawlessness is escalating and they are intentionally destroying the economy, and so I don't think we should make anything easy going for",
    "link": "https://www.wnd.com/2025/04/im-not-a-maniac-senator-blocks-hundreds-of-trump-nominees-using-tactic-he-once-called-abuse-of-power/",
    "timestamp": "2025-04-08T12:58:24Z"
  },
  {
    "title": "Stock markets continue to swing wildly: Should mutual fund investors worry? Experts say this",
    "description": "Wealth advisors tell investors to be patient and remain invested if their financial goals are not due for the next three years. They should also use the correction as an opportunity to invest more.",
    "link": "https://www.livemint.com/money/personal-finance/as-markets-continue-to-shock-should-mutual-fund-investors-be-a-worried-experts-say-this-nifty-sensex-indian-markets-11744110127026.html",
    "timestamp": "2025-04-08T12:58:09Z"
  },
  {
    "title": "Ackman backs Trump tariffs but urges brief delay",
    "description": "Billionaire investor Bill Ackman voiced strong support on Tuesday for United States President Donald Trump's tariff strategy but called for a short delay before implementation. In a post on X, Ackman ...",
    "link": "https://biztoc.com/x/f2381710d5b3a7e0",
    "timestamp": "2025-04-08T12:57:14Z"
  },
  {
    "title": "Why Elon Musk is breaking with Donald Trump over tariffs",
    "description": "Elon Musk and President Donald Trump in the Oval Office.\nKevin Lamarque/REUTERS\nElon Musk is no fan of Donald Trump's tariff onslaught.\nThe Tesla CEO spent recent days subtly dissing the \"reciprocal\" tariffs and warring with Trump's top trade advisor.\nTariff-…",
    "link": "https://biztoc.com/x/6fcb39b2e02794a8",
    "timestamp": "2025-04-08T12:56:49Z"
  },
  {
    "title": "Trump thinks tariffs can bring back the glory days of US manufacturing. Here’s why he’s wrong",
    "description": "The president’s actions are driven by nostalgia rather than reality.",
    "link": "https://theconversation.com/trump-thinks-tariffs-can-bring-back-the-glory-days-of-us-manufacturing-heres-why-hes-wrong-253991",
    "timestamp": "2025-04-08T12:56:02Z"
  },
  {
    "title": "JD Vance: Beijing calls US VP 'ignorant' over 'Chinese peasants' remark",
    "description": "The sharp rhetoric comes as Donald Trump's tariffs fuel trade tensions between the US and China.",
    "link": "https://www.bbc.co.uk/news/articles/c20zd4k6d36o",
    "timestamp": "2025-04-08T12:54:24Z"
  },
  {
    "title": "Elon Musk's DOGE using AI to snoop on US federal workers, sources say",
    "description": "The use of AI and Signal reinforces concerns among cybersecurity experts and government ethicists that DOGE is operating with limited transparency and that billionaire Musk or the Trump administration could use information gathered with AI to further their ow…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/elon-musks-doge-using-ai-to-snoop-on-us-federal-workers-sources-say/articleshow/120097211.cms",
    "timestamp": "2025-04-08T12:53:13Z"
  },
  {
    "title": "A Path Forward in U.S.-Iran Relations: Diplomacy Over Dominance",
    "description": "The geopolitical tensions between the United States and Iran continue to cast a long shadow over the broader Middle East and global diplomatic affairs. At the heart of this mistrust lies the unilateral withdrawal of the United States from the …\nThe post A Pat…",
    "link": "https://www.globalresearch.ca/us-iran-relations-diplomacy-over-dominance/5883833",
    "timestamp": "2025-04-08T12:52:05Z"
  },
  {
    "title": "25 Unbelievable Moments From the First Quarter of 2025",
    "description": "Photo: Gregory Shamus, Nathan Posner, Andrew Harnik (Getty Images)\r\nWe did it, Joe! We’ve officially made it through the first quarter of 2025. Although there were plenty of hiccups, we survived. But before we move forward, let’s revisit the crazy and shockin…",
    "link": "https://www.theroot.com/25-unbelievable-moments-from-the-first-quarter-of-2025-1851774391",
    "timestamp": "2025-04-08T12:51:00Z"
  },
  {
    "title": "As Donald Trump introduces reciprocal tariffs, Chinese memes on Americans working in manufacturing sector goes viral; here are some hilarious ones",
    "description": "Chinese memes trolling America are blowing up online as users across China take hilarious jabs at the U.S. over its push to revive the manufacturing sector. These viral memes, showing confused American factory workers and “Tariff Man” Trump in satirical scene…",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-donald-trump-introduces-reciprocal-tariffs-chinese-memes-on-americans-working-in-manufacturing-sector-goes-viral-here-are-some-hilarious-ones/articleshow/120095698.cms",
    "timestamp": "2025-04-08T12:50:30Z"
  },
  {
    "title": "The founder kings of Silicon Valley: Dual-class stock gives US social media company controllers nearly as much power as ByteDance has over TikTok",
    "description": "Nearly every major American social media platform is ruled by a single founder with near-total control, thanks to a relatively new corporate share structure.",
    "link": "https://theconversation.com/the-founder-kings-of-silicon-valley-dual-class-stock-gives-us-social-media-company-controllers-nearly-as-much-power-as-bytedance-has-over-tiktok-253671",
    "timestamp": "2025-04-08T12:49:15Z"
  },
  {
    "title": "Trump fires U.S. admiral at NATO as part of an intensifying military purge",
    "description": "After Vice Adm. Shoshana Chatfield was ousted, a key House Democrat said, “Yet again, our country is less safe because of President Trump’s actions.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-fires-us-admiral-nato-part-intensifying-military-purge-rcna200165",
    "timestamp": "2025-04-08T12:49:03Z"
  },
  {
    "title": "Tariffs Come for Your Jerseys, Gym Clothes, and Sports Team",
    "description": "Plus: Formula 1, Backyard Baseball, and The Great 8 vs. The Great One.",
    "link": "https://reason.com/2025/04/08/tariffs-come-for-your-jerseys-gym-clothes-and-sports-team/",
    "timestamp": "2025-04-08T12:48:33Z"
  },
  {
    "title": "The ‘courage to be’ in uncertain times − how one 20th-century philosopher defined bravery",
    "description": "German philosopher Paul Tillich’s writings about affirming oneself in the face of anxiety, repression and meaninglessness ring as true today as in the 1950s.",
    "link": "https://theconversation.com/the-courage-to-be-in-uncertain-times-how-one-20th-century-philosopher-defined-bravery-250576",
    "timestamp": "2025-04-08T12:47:41Z"
  },
  {
    "title": "Harriet Tubman Photo Restored To National Park Service Webpage Following Backlash",
    "description": "The National Park Service said the edits had not been authorized by its leadership.",
    "link": "https://www.huffpost.com/entry/harriet-tubman-photo-quote-restored_n_67f4fd2ae4b063f5d487d71d",
    "timestamp": "2025-04-08T12:47:27Z"
  },
  {
    "title": "Singapore faces tough times as US tariff move to hit growth, jobs",
    "description": "Singapore anticipates economic challenges, including potential job losses and slower growth, following the US imposition of a 10% tariff on imports. PM Lawrence Wong expressed disappointment, highlighting the impact on trade-dependent nations and the unraveli…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/singapore-faces-tough-times-as-us-tariff-move-to-hit-growth-jobs/articleshow/120097028.cms",
    "timestamp": "2025-04-08T12:47:26Z"
  },
  {
    "title": "Trump signs ‘phase one’ trade deal with China in push to stop economic conflict(Flash Back to 2020)",
    "description": "President Donald Trump signed a partial trade deal with China on Wednesday as the world’s two largest economies try to contain an economic struggle. Through the deal, the Trump administration aims to resolve some longstanding American concerns about Chinese t…",
    "link": "https://freerepublic.com/focus/f-chat/4309638/posts",
    "timestamp": "2025-04-08T12:46:27Z"
  },
  {
    "title": "Dow Jones Futures Jump 1,200 Points On Trump Tariff News; Apple, Nvidia, Tesla Rally",
    "description": "Futures for the Dow Jones Industrial Average and other major stock indexes rebounded Tuesday, as Wall Street continued to battle with the fallout of President Donald Trump's tariffs and China's subsequent retaliation. Big early winners on the stock market tod…",
    "link": "https://biztoc.com/x/c1a02debfec6a703",
    "timestamp": "2025-04-08T12:46:25Z"
  },
  {
    "title": "Notorious ‘Black Swan’ Investor Reveals His Outlook for the Economy — and It’s Grim: ‘This Is a Trap’",
    "description": "Mark Spitznagel shared his outlook for the economy and he sees a major crash headed the market's way as stocks face downward stumbles in response to tariffs.\nThe post Notorious ‘Black Swan’ Investor Reveals His Outlook for the Economy — and It’s Grim: ‘This I…",
    "link": "https://www.mediaite.com/news/notorious-black-swan-investor-reveals-his-outlook-for-the-economy-and-its-grim-this-is-a-trap/",
    "timestamp": "2025-04-08T12:46:12Z"
  },
  {
    "title": "S. Korea's Han holds his first call with Trump",
    "description": "South Korea's acting President Han Duck-soo (pictured) on Tuesday held his first phone call with his American counterpart Donald Trump, marking the first talks between the leaders of these two countri...",
    "link": "https://biztoc.com/x/28cafde0c2e75ba0",
    "timestamp": "2025-04-08T12:45:40Z"
  },
  {
    "title": "Why Elon Musk is breaking with Donald Trump over tariffs",
    "description": "The Tesla CEO has been one of Trump's most outspoken cheerleaders — but Musk is not a fan of the tariffs that have shaken global markets.",
    "link": "https://www.businessinsider.com/elon-musk-donald-trump-tariffs-opposition-tesla-china-byd-2025-4",
    "timestamp": "2025-04-08T12:45:05Z"
  },
  {
    "title": "Why Western Nations Should Care About Africa’s E-Transport Endeavors",
    "description": "Electric motorbikes are the new trend among many African countries. The movement will lead to sustainable development, modern jobs, and less reliance on fossil fuels.",
    "link": "https://www.forbes.com/sites/kensilverstein/2025/04/08/why-western-nations-should-care-about-africas-e-transport-endeavors/",
    "timestamp": "2025-04-08T12:45:00Z"
  },
  {
    "title": "Iran says US goodwill needed for nuclear deal",
    "description": "<p>TEHRAN - Iran&rsquo;s top diplomat said on Tuesday that he believed a new nuclear deal could be agreed with the United States provided Tehran&rsquo;s longtime foe shows sufficient goodwill in talks to begin in Oman on Saturday.</p>",
    "link": "https://www.bangkokpost.com/world/2998601/iran-says-us-goodwill-needed-for-nuclear-deal",
    "timestamp": "2025-04-08T12:45:00Z"
  },
  {
    "title": "The aftermath of Trump’s tariff: Boon for the US or blow to global stability?",
    "description": "In a dramatic move, US President Donald Trump imposed sweeping tariffs on global imports, excluding Canada and Mexico, sparking international condemnation. The EU faces a 20% tariff, while China confronts a steep 34% duty. Financial markets reacted turbulentl…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/the-aftermath-of-trumps-tariff-boon-for-the-us-or-blow-to-global-stability/articleshow/120096983.cms",
    "timestamp": "2025-04-08T12:43:51Z"
  },
  {
    "title": "Dow jumps 1,300 as some relief washes through financial markets on hopes for tariff negotiations",
    "description": "Stocks are rising on Wall Street as markets settled after the shocks from President Donald Trump’s tariff hikes.",
    "link": "https://www.denverpost.com/2025/04/08/wall-street-financial-markets-today/",
    "timestamp": "2025-04-08T12:43:40Z"
  },
  {
    "title": "Stephen A. Smith Says He’s ‘Leaving All Doors Open’ for Presidential Bid",
    "description": "Stephen A. Smith says that he’s not shutting down rumors that he could run for president in 2028. “Time to stop messing around. Life is great. Especially at ESPN/Disney. Hate the thought of being a politician. But sick of this mess. So I’m officially leaving …",
    "link": "https://mediatakeout.com/stephen-a-smith-says-hes-leaving-all-doors-open-for-presidential-bid/",
    "timestamp": "2025-04-08T12:42:51Z"
  },
  {
    "title": "Collaborators",
    "description": "There’s a list, and a lot of people are on it: A lawyer’s spring break trip to the Dominican Republic with his family ended on a troubling note at Detroit Metro Airport on Sunday: He was detained by federal agents, questioned about his clients, and asked to g…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/collaborators-3",
    "timestamp": "2025-04-08T12:42:22Z"
  },
  {
    "title": "Democratic US senators question Google and Microsoft's AI deals",
    "description": "The US Federal Trade Commission issued a staff report in January, before US President Donald Trump took office, on a study into partnerships between Microsoft and OpenAI, Amazon and Anthropic, and Google and Anthropic but withheld information specific to the …",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/democratic-us-senators-question-google-and-microsofts-ai-deals/articleshow/120097026.cms",
    "timestamp": "2025-04-08T12:42:21Z"
  },
  {
    "title": "Trump's tariff threats will push China to the brink of economic war? Here's how other nations will tackle this",
    "description": "Donald Trump and China clashed over tariff increases. China promised countermeasures. Other nations are planning responses to the trade war. Japan seeks tariff reconsideration. India wants a trade deal. Malaysia promotes diplomacy. Hong Kong pledges open trad…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariff-threats-will-push-china-to-the-brink-of-economic-war-heres-how-other-nations-will-tackle-this/articleshow/120097021.cms",
    "timestamp": "2025-04-08T12:41:56Z"
  },
  {
    "title": "Pro-Palestine protesters ‘shut down’ New York’s Grand Central station",
    "description": "Pro-Palestine protesters staged a demonstration at New York’s Grand Central station.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/4/8/pro-palestine-protesters-shut-down-new-yorks-grand-central-station",
    "timestamp": "2025-04-08T12:39:01Z"
  },
  {
    "title": "How Taxpayer-Funded Censorship Tools Could Manipulate What Americans See About Vaccines, Raw Milk, And More",
    "description": "The federal government incubated a host of online censorship programs, several of which are still operating under leftist groups.",
    "link": "https://thefederalist.com/2025/04/08/how-taxpayer-funded-censorship-tools-could-manipulate-what-americans-see-about-vaccines-raw-milk-and-more/",
    "timestamp": "2025-04-08T12:38:50Z"
  },
  {
    "title": "Legal status revoked for migrants who entered US using CBP One app",
    "description": "Migrants who entered the country using a Biden-era online app told to self-deport immediately",
    "link": "https://www.wmur.com/article/migrants-cbp-one-app-parole-ends/64418435",
    "timestamp": "2025-04-08T12:38:28Z"
  },
  {
    "title": "This will determine if we get a 'Trump recession or a depression': Financial Times writer",
    "description": "Financial Times columnist Edward Luce on Tuesday ridiculed President Donald Trump's billionaire backers who have expressed bewilderment at his decision to launch trade wars against nearly every nation on Earth.Pointing to comments from Trump-backing hedge-fun…",
    "link": "https://www.rawstory.com/trump-recession-2671692325/",
    "timestamp": "2025-04-08T12:38:17Z"
  },
  {
    "title": "Elon Musk once mocked China’s BYD. Now the EV giant is outselling Tesla",
    "description": "Elon Musk's Tesla is facing hard times. The stocks have tanked, sales have declined and its showrooms and dealerships have been facing massive violence in US and other parts of the world. An old video of Elon Musk mocking Chinese electric vehicle (EV) giant B…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-once-mocked-chinas-byd-now-the-ev-giant-is-outselling-tesla/articleshow/120096660.cms",
    "timestamp": "2025-04-08T12:37:05Z"
  },
  {
    "title": "‘Tariffs don’t protect, they backfire’: Former US President Ronald Reagan’s resurfaced warning echoes amid Trump’s new trade war",
    "description": "A resurfaced video of Ronald Reagan cautioning against tariffs gains traction amidst President Trump's new trade policies. Reagan warned that tariffs lead to industry complacency, trade wars, and job losses, echoing concerns about Trump's recent tariffs on im…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/tariffs-do-not-protect-they-backfire-former-republican-us-president-ronald-reagans-resurfaced-warning-echoes-amid-donald-trumps-new-trade-war/articleshow/120096012.cms",
    "timestamp": "2025-04-08T12:36:35Z"
  },
  {
    "title": "Federal judge says Trump's rhetoric 'breeds threats of violence against judges'",
    "description": "A federal judge in Seattle said the way President Donald Trump speaks has been fueling threats against other judges across the country.",
    "link": "https://www.foxnews.com/us/federal-judge-says-trumps-rhetoric-breeds-threats-violence-against-judges",
    "timestamp": "2025-04-08T12:36:25Z"
  },
  {
    "title": "Donald Trump's Strong Disapproval Rating Surges",
    "description": "Donald Trump is facing a sharp rise in disapproval ratings similar to that of November, 2018, when the Republicans lost control of the House of Representatives, according to new polling data.\nWhy It Matters\nA shift in Trump's numbers could influence support f…",
    "link": "https://biztoc.com/x/fcc147b0f04310d7",
    "timestamp": "2025-04-08T12:34:55Z"
  },
  {
    "title": "Trump says Iran and US to hold direct nuclear talks",
    "description": "The News\nUS President Donald Trump announced Washington and Tehran would hold direct nuclear talks in Oman on Saturday, warning that Iran will be “in great danger” if no accord is reached. \nDespite several rounds of indirect talks with the Biden administratio…",
    "link": "https://biztoc.com/x/2e4eabe525e906fe",
    "timestamp": "2025-04-08T12:34:35Z"
  },
  {
    "title": "A Bhutanese refugee's questions to America, Bhutan, Nepal, and the United Nations",
    "description": "In some incidents, there are many questions, but not a single answer.",
    "link": " https://en.setopati.com/social/164441 ",
    "timestamp": "2025-04-08T12:34:00Z"
  },
  {
    "title": "Donald Trump’s War on History",
    "description": "The below article first appeared in David Corn’s newsletter, Our Land. The newsletter comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture. Subscribing costs just $5 a month—but you c…",
    "link": "https://www.motherjones.com/politics/2025/04/donald-trump-war-on-history-restoring-truth-sanity-propaganda-racism/",
    "timestamp": "2025-04-08T12:33:11Z"
  },
  {
    "title": "Tim Walz Suffers Blow Over ICE Arrests in Minnesota",
    "description": "Five sheriff's offices have inked cooperation agreements with federal immigration authorities in a blow to sanctuary policies.",
    "link": "https://www.newsweek.com/tim-walz-suffers-blow-ice-minnesota-2056753",
    "timestamp": "2025-04-08T12:33:06Z"
  },
  {
    "title": "Trump’s Tariffs Are Disastrous For Elon Musk",
    "description": "From Tesla to SpaceX to xAI, Elon Musk’s sprawling global business empire will be slammed by Trump’s tariffs regime. Here’s how.",
    "link": "https://www.forbes.com/sites/johnhyatt/2025/04/08/trumps-tariffs-are-disastrous-for-elon-musk/",
    "timestamp": "2025-04-08T12:32:59Z"
  },
  {
    "title": "Iran skeptical over coming US talks, Iranian officials say",
    "description": "Iran expresses skepticism over upcoming US talks on its nuclear program, insisting on indirect negotiations and demanding concrete gestures before direct discussions.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-849352",
    "timestamp": "2025-04-08T12:31:45Z"
  },
  {
    "title": "Donald Trump's Strong Disapproval Rating Surges",
    "description": "Trump's approval rating has taken a notable hit, with disapproval numbers now mirroring levels seen during the 2018 midterm elections.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-2026-midterms-2056747",
    "timestamp": "2025-04-08T12:31:11Z"
  },
  {
    "title": "Trump-Netanyahu meeting largely unsuccessful, tariffs remain threat",
    "description": "Trump's second meeting with Netanyahu this term was, judging by politicians' reactions, not an overwhelming success for Israel's prime minister.",
    "link": "https://www.jpost.com/israel-news/article-849353",
    "timestamp": "2025-04-08T12:31:05Z"
  },
  {
    "title": "Ex-Biden Official and Economist Cited by Trump Admin to Justify Tariffs Shreds Policy in Scathing Op-Ed",
    "description": "A University of Chicago economist was stunned to learn the Donald Trump administration had used his research to justify a sweeping new tariff plan — and he’s now forcefully slamming the policy and its math. Brent Neiman, a former Treasury official under Presi…",
    "link": "https://www.mediaite.com/news/ex-biden-official-and-economist-cited-by-trump-admin-to-justify-tariffs-shreds-policy-in-scathing-op-ed/",
    "timestamp": "2025-04-08T12:31:05Z"
  },
  {
    "title": "Trump-backed World Liberty Financial proposes USD1 stablecoin airdrop",
    "description": "World Liberty Financial (WLFI), the DeFi venture partly owned by US President Donald Trump, has launched a proposal to distribute its upcoming stablecoin, USD1, to existing WLFI token holders. The initiative is intended to test the airdrop infrastructure in a…",
    "link": "https://cryptoslate.com/trump-backed-world-liberty-financial-proposes-usd1-stablecoin-airdrop/",
    "timestamp": "2025-04-08T12:30:55Z"
  },
  {
    "title": "The Reason of Rules: Uncertainty is the Growth Killer",
    "description": "Like just about every college professor, I give my students a syllabus at the beginning of the semester.  However, I write my syllabus like a contract.  It is split into sections with clauses.  The sections detail various aspects of the class (location, topic…",
    "link": "https://www.econlib.org/the-reason-of-rules-uncertainty-is-the-growth-killer/",
    "timestamp": "2025-04-08T12:30:11Z"
  },
  {
    "title": "Trump admin tells prosecutors to ease up on crypto enforcement",
    "description": "The Trump administration is pulling back its enforcement of crypto regulations, disbanding a unit dedicated to cryptocurrency enforcement",
    "link": "https://abcnews.go.com/Politics/trump-admin-tells-prosecutors-ease-crypto-enforcement/story?id=120589406",
    "timestamp": "2025-04-08T12:29:23Z"
  },
  {
    "title": "South Korea’s Military Fires Warning Shots After North Korean Troops Cross the Border",
    "description": "About 10 North Korean soldiers violated the military demarcation line, South Korean officials said.",
    "link": "https://time.com/7275680/south-korea-warning-shots-north-korean-troops-border/",
    "timestamp": "2025-04-08T12:27:54Z"
  },
  {
    "title": "Audit finds Hong Kong company breached Panama Canal ports contract",
    "description": "Report comes as US uses claims of Chinese meddling to push for control over strategic waterway.",
    "link": "https://www.aljazeera.com/news/2025/4/8/audit-finds-hong-kong-company-breached-panama-canal-ports-contract",
    "timestamp": "2025-04-08T12:26:06Z"
  },
  {
    "title": "Influencer Who Bought Trump a Rolex Has Lost Over $10M Since Tariffs Hit the Market: 'It's So Bad' (Latin Times)",
    "description": "Latin Times:\nInfluencer Who Bought Trump a Rolex Has Lost Over $10M Since Tariffs Hit the Market: 'It's So Bad'  —  “It's bad, I'm not gonna lie to you”  —  Just months after gifting President Donald Trump a gold Rolex and a custom MAGA-wrapped Tesla Cybertru…",
    "link": "https://www.memeorandum.com/250408/p28",
    "timestamp": "2025-04-08T12:25:00Z"
  },
  {
    "title": "Oil prices steady after booking steep losses on fears of full-blown trade war",
    "description": "U.S. crude oil is down about 14% and Brent has fallen around 13% since Trump announced his tariffs last Wednesday.",
    "link": "https://www.cnbc.com/2025/04/08/oil-prices-today.html",
    "timestamp": "2025-04-08T12:24:42Z"
  },
  {
    "title": "Supreme Court Not Ready to Blow Up Free Speech… Yet",
    "description": "We came a bit too close to losing one of the most important First Amendment protections in American history — but at least for now we have a tiny bit of good news. Billionaire Steve Wynn, joining a growing chorus of the wealthy and powerful who want to make i…",
    "link": "https://www.techdirt.com/2025/04/08/supreme-court-not-ready-to-blow-up-free-speech-yet/",
    "timestamp": "2025-04-08T12:23:53Z"
  },
  {
    "title": "Trump threatens additional 50% tariffs on China in new escalation",
    "description": "A global trade war touched off by U.S. President Donald Trump's sweeping tariffs escalated further on April 7, as Trump threatened to increase duties on China and the European Union proposed counter-tariffs of its own.",
    "link": "https://biztoc.com/x/aa9cf62b0928ecaf",
    "timestamp": "2025-04-08T12:23:39Z"
  },
  {
    "title": "DOGE Spying on Federal Workers for Anti-Trump, Musk Messages: Report",
    "description": "Staff with the Department of Government Efficiency (DOGE) are using AI to spy on communications sent by federal workers in at least one agency so they can detect any anti-Donald Trump or anti-Elon Musk language, according to a Reuters report.\nThe publication …",
    "link": "https://biztoc.com/x/d48ee3ab4d030ed2",
    "timestamp": "2025-04-08T12:23:27Z"
  },
  {
    "title": "US Stock Futures Soar as Dip Buyers Emerge After Selloff",
    "description": "(Bloomberg) -- US stocks rallied in premarket trading after a three-day selloff that wiped out more than $5 trillion of value in US equities. Most Read from ...",
    "link": "https://finance.yahoo.com/news/us-stock-futures-soar-dip-122149874.html",
    "timestamp": "2025-04-08T12:21:49Z"
  },
  {
    "title": "Panic Buying Hits Apple Stores As Trump's Tariff War Threatens To Hike iPhone Prices",
    "description": "Anticipation of the Trump administration's tariffs has led to a surge in iPhone purchases as consumers rush to buy devices before potential price increases.",
    "link": "https://www.ibtimes.com/panic-buying-hits-apple-stores-trumps-tariff-war-threatens-hike-iphone-prices-3769220",
    "timestamp": "2025-04-08T12:20:49Z"
  },
  {
    "title": "Walmart Boycott Runs 7 to 14 April: Here Are More Upcoming Boycott Dates for Other Brands",
    "description": "A week-long boycott of Walmart is underway (7-14 April 2025), driven by calls for the reinstatement of diversity, equity, and inclusion (DEI) policies.",
    "link": "https://www.ibtimes.com/walmart-boycott-runs-7-14-april-here-are-more-upcoming-boycott-dates-other-brands-3769217",
    "timestamp": "2025-04-08T12:20:47Z"
  },
  {
    "title": "XRP Could Hit $12.5 Before President Trump's Term Ends: Standard Chartered",
    "description": "XRP is uniquely positioned at the heart of of cross-border payments, the report said.",
    "link": "https://www.coindesk.com/markets/2025/04/08/xrp-could-hit-usd12-5-before-president-trump-s-term-ends-standard-chartered",
    "timestamp": "2025-04-08T12:20:46Z"
  },
  {
    "title": "Apple staged emergency iPhone airlift from India – media",
    "description": "The airlift to the US was done to avoid new reciprocal tariffs ushered in by the Trump administration Read Full Article at RT.com",
    "link": "https://www.rt.com/india/615390-apple-staged-emergency-iphone-airlift/",
    "timestamp": "2025-04-08T12:20:42Z"
  },
  {
    "title": "Stunned Abby Phillip Rolls Eyes At New Scott Jennings Trump Defense",
    "description": "Abby Phillip was stunned by Scott Jennings's newest defense of President Donald Trump — his idea of shipping U.S. citizens to El Salvador.\nThe post Stunned Abby Phillip Rolls Eyes At New Scott Jennings Trump Defense first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/is-that-what-youre-saying-cnns-abby-phillip-stunned-by-new-scott-jennings-trump-defense/",
    "timestamp": "2025-04-08T12:19:51Z"
  },
  {
    "title": "China condemns JD Vance’s ‘peasants’ jibe",
    "description": "Beijing hammers US vice president as lacking \"knowledge and respect\" in escalating feud.",
    "link": "https://www.politico.eu/article/china-slams-ignorant-impolite-jd-vance-over-chinese-peasants-comment/",
    "timestamp": "2025-04-08T12:19:45Z"
  },
  {
    "title": "Trump admin fires Navy admiral at NATO targeted by conservative group",
    "description": "The Trump administration has sacked a senior NATO official who was recommended by a conservative research group to be fired as part of a broader effort to purge of wokeness from the Pentagon.",
    "link": "https://www.foxnews.com/politics/trump-admin-fires-navy-admiral-nato-targeted-conservative-group",
    "timestamp": "2025-04-08T12:19:43Z"
  },
  {
    "title": "Tuesday: Hili dialogue",
    "description": "Welcome to The Cruelest Day: Tuesday, April 8, 2025, and National Empanada Day. Here’s one I bought in Santiago, Chile in 2019: It’s also Dog Farting Awareness Day (do they need a day for that?), International Romani Day, and Free Cone Day, when you can get a…",
    "link": "https://whyevolutionistrue.com/2025/04/08/tuesday-hili-dialogue-524/",
    "timestamp": "2025-04-08T12:19:25Z"
  },
  {
    "title": "Iran Says Deal Can Be Reached If US Shows Goodwill",
    "description": "Iran's top diplomat said Tuesday he believed a new nuclear deal could be agreed with the United States provided Tehran's longtime foe shows sufficient goodwill in talks to begin in Oman on Saturday.",
    "link": "https://www.ibtimes.com.au/iran-says-deal-can-reached-if-us-shows-goodwill-1857663",
    "timestamp": "2025-04-08T12:18:27Z"
  },
  {
    "title": "Iran Says Deal Can Be Reached If US Shows Goodwill",
    "description": "Iran's top diplomat said Tuesday he believed a new nuclear deal could be agreed with the United States provided Tehran's longtime foe shows sufficient goodwill in talks to begin in Oman on Saturday.",
    "link": "https://www.ibtimes.com/iran-says-deal-can-reached-if-us-shows-goodwill-3769214",
    "timestamp": "2025-04-08T12:18:06Z"
  },
  {
    "title": "Egypt Rallies Support Against Trump's Gaza Plan",
    "description": "Egypt has intensified rejection of relocating Palestinians as Trump doubled down on proposal",
    "link": "https://www.newsweek.com/egypt-rallies-support-against-trumps-gaza-plan-2056756",
    "timestamp": "2025-04-08T12:18:00Z"
  },
  {
    "title": "American Accused of Insulting Monarchy Could Face Years in Jail",
    "description": "Prominent academic Paul Chambers faces charges in Thailand that could lead to up to 15 years in jail",
    "link": "https://www.newsweek.com/american-monarchy-royals-thailand-crime-2056795",
    "timestamp": "2025-04-08T12:17:43Z"
  },
  {
    "title": "Who’s in and Who’s out at MSNBC as SpinCo Spin-Off Looms",
    "description": "The SpinCo split means that journalists that have previously worked for both networks now have to choose one.",
    "link": "https://www.adweek.com/tvnewser/msnbc-nbc-news-spinco-talent/",
    "timestamp": "2025-04-08T12:17:31Z"
  },
  {
    "title": "What will the Fed do, cut key rates? All eyes on Jerome Powell as Wall Street expects him to rescue the economy from Trump's tariffs",
    "description": "Amidst growing recession fears fueled by Trump's tariffs, Wall Street anticipates Federal Reserve intervention. JPMorgan has significantly lowered its GDP forecast, while investors are pricing in multiple rate cuts this year. However, Fed Chairman Jerome Powe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-will-the-fed-do-cut-key-rates-all-eyes-on-jerome-powell-as-wall-street-expects-him-to-rescue-the-economy-from-trumps-tariffs/articleshow/120095492.cms",
    "timestamp": "2025-04-08T12:15:07Z"
  },
  {
    "title": "DOGE Spying on Federal Workers for Anti-Trump, Musk Messages: Report",
    "description": "The monitoring is reportedly happening at the Environmental Protection Agency (EPA).",
    "link": "https://www.newsweek.com/doge-spying-ai-trump-musk-epa-2056805",
    "timestamp": "2025-04-08T12:15:04Z"
  },
  {
    "title": "\"What About the Capitalists?\": Autoworkers in U.S., Mexico Call for Solidarity, Not Divisive Tariffs",
    "description": "As workers brace for uncertainty and fallout from Trump’s tariffs, we hear from two autoworkers, one in Mexico and one in the United States. Israel Cervantes, founder of the National Independent Union for Workers in the Automotive Industry in Mexico, calls fo…",
    "link": "https://www.democracynow.org/2025/4/8/uaw_tariffs_autoworkers_union",
    "timestamp": "2025-04-08T12:15:00Z"
  },
  {
    "title": "Dutton's father suffered medical episode hours before first leaders debate",
    "description": "Peter Dutton's father suffered a medical episode just hours before the Opposition Leader faced off against Anthony Albanese in the first leaders' debate of the election campaign.",
    "link": "https://www.abc.net.au/news/2025-04-08/duttons-father-suffered-medical-episode-election-2025/105153648",
    "timestamp": "2025-04-08T12:14:38Z"
  },
  {
    "title": "Web3 active developers drop nearly 40% in one year",
    "description": "Weekly active developers in the crypto space dropped by almost 40% in one year as “narrative-led” developments took over the industry. Crypto data and analytics platform Artemis Terminal shows that on March 17, 2024, the number of active developers tagged on …",
    "link": "https://cointelegraph.com/news/web3-developer-activity-drop-nearly-40-percent-one-year",
    "timestamp": "2025-04-08T12:13:54Z"
  },
  {
    "title": "Iran’s foreign minister says he will have indirect talks with US envoy over Tehran’s nuclear program",
    "description": "The U.S. is seeking to halt Tehran’s advancing nuclear program.",
    "link": "https://www.bostonherald.com/2025/04/08/iran-us-talks-nuclear-program/",
    "timestamp": "2025-04-08T12:12:48Z"
  },
  {
    "title": "Posthaste: Americans are scrambling to stock up at Costco, Best Buy before tariffs jack up prices",
    "description": "Americans are rushing to stock up on everything from soy sauce to Lululemon Athletica Inc yoga gear before the tariffs imposed by President Donald Trump start to jack up prices on the shelves, according to media reports.\nThe day after Trump’s so-called Libera…",
    "link": "https://biztoc.com/x/746fab00f0161297",
    "timestamp": "2025-04-08T12:12:45Z"
  },
  {
    "title": "Penguins, vaccines: Can negotiations save Trump’s oddest tariff targets?",
    "description": "Barely inhabited islands, countries the US enjoys a trade surplus with, and a tariff formula that isn't about tariffs.",
    "link": "https://www.aljazeera.com/news/2025/4/8/penguins-vaccines-can-negotiations-save-trumps-oddest-tariff-targets",
    "timestamp": "2025-04-08T12:10:43Z"
  },
  {
    "title": "How Progressives Can Transform the Dems to Save Our Democracy and Renew Prosperity",
    "description": "There are two central facts about the Democratic Party that everyone must understand if our democratic republic is going to survive President Donald Trump’s authoritarian counterrevolution:\n<ol>\n<li>The Democratic Party is the only institution in our society …",
    "link": "https://www.commondreams.org/opinion/progressives-save-dems",
    "timestamp": "2025-04-08T12:10:03Z"
  },
  {
    "title": "EU to issue Apple's Digital Markets Act antitrust ruling within weeks",
    "description": "The European Union may finally decide whether Apple's App Store has breached the continent's Digital Markets Act rules, with the antitrust chief confirming a ruling could arrive within a few weeks.EU Flags with the App Store logo in the middleApple's App Stor…",
    "link": "https://appleinsider.com/articles/25/04/08/eu-to-issue-apples-digital-markets-act-antitrust-ruling-within-weeks",
    "timestamp": "2025-04-08T12:09:34Z"
  },
  {
    "title": "Supreme Court allows Trump to apply the Enemy Alien Enemy Act for immediate deportations",
    "description": "Trump praised the decision in a post on Truth Social, writing in capital letters that it was \"a great day for justice in America\"\nThe post Supreme Court allows Trump to apply the Enemy Alien Enemy Act for immediate deportations appeared first on ProtoThema En…",
    "link": "https://en.protothema.gr/2025/04/08/supreme-court-allows-trump-to-apply-the-enemy-alien-enemy-act-for-immediate-deportations/",
    "timestamp": "2025-04-08T12:09:27Z"
  },
  {
    "title": "Crypto firm Ripple to buy primer broker Hidden Road for $1.25 billion",
    "description": "Crypto startup Ripple said Tuesday that it's agreed to buy prime brokerage firm Hidden Road for $1.25 billion in the company's biggest acquisition to date.",
    "link": "https://www.cnbc.com/2025/04/08/crypto-firm-ripple-to-buy-primer-broker-hidden-road-for-1point25-billion.html",
    "timestamp": "2025-04-08T12:08:56Z"
  },
  {
    "title": "Trump fires U.S. attorney prosecuting former Fatburger CEO Andrew Wiederhorn",
    "description": "The U.S. Attorney’s Office in Los Angeles said the case against the former Fatburger CEO will proceed.",
    "link": "https://www.oregonlive.com/business/2025/04/trump-fires-us-attorney-prosecuting-onetime-portland-financier-andrew-wiederhorn.html",
    "timestamp": "2025-04-08T12:08:44Z"
  },
  {
    "title": "Forbes Daily: Markets’ Reprieve Proves To Be A Mirage Amid Tariff Saga",
    "description": "Today’s Forbes Daily newsletter covers market whiplash, Bitcoin struggles, potential new China tariffs plus medical equipment impacts, SCOTUS rules on migrants and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/04/08/forbes-daily-markets-reprieve-proves-to-be-a-mirage-amid-tariff-saga/",
    "timestamp": "2025-04-08T12:08:00Z"
  },
  {
    "title": "Crypto firm Ripple to buy prime broker Hidden Road for $1.25 billion",
    "description": "Ripple said on Tuesday it will buy multi-asset prime broker Hidden Road in a $1.25 billion deal, making it one of the largest acquisitions by the crypto company.This is the second billion-dollar-plus deal involving a crypto company this year, as digital asset…",
    "link": "https://www.channelnewsasia.com/business/crypto-firm-ripple-buy-prime-broker-hidden-road-125-billion-5052031",
    "timestamp": "2025-04-08T12:07:39Z"
  },
  {
    "title": "‘Fight to the end’: Are the US and China rushing into a trade war?",
    "description": "China seems prepared for a showdown even as other countries scramble to re-negotiate new tariffs with Washington.",
    "link": "https://www.aljazeera.com/news/2025/4/8/fight-to-the-end-are-the-us-and-china-rushing-into-a-trade-war",
    "timestamp": "2025-04-08T12:07:28Z"
  },
  {
    "title": "India and Canada Eye Resetting Relations",
    "description": "A rapprochement will not be easy or swift. Canadian public support for an FTA with India is low.",
    "link": "https://thediplomat.com/2025/04/india-and-canada-eye-resetting-relations/",
    "timestamp": "2025-04-08T12:06:00Z"
  },
  {
    "title": "Bessent Says Japan, South Korea, Taiwan May Back Alaska Energy Deal",
    "description": "Treasury Secretary Scott Bessent on Tuesday flagged a potential energy investment deal in Alaska involving key Asian economic partners, in the broader context of trade talks in the wake of President Donald Trump’s steep reciprocal tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-says-japan-south-korea-taiwan-may-back-alaska-energy-deal",
    "timestamp": "2025-04-08T12:05:52Z"
  },
  {
    "title": "Buffett's Bet On Cash Pays Off As Tariffs Wipe £400 Billion From Other Billionaires' Wealth",
    "description": "Warren Buffett's £240B ($325B) cash hoard shines as Trump's tariffs tank markets, costing the world's richest £400B ($510B) in days. Is the Oracle ready to strike?",
    "link": "https://www.ibtimes.com/buffetts-bet-cash-pays-off-tariffs-wipe-400-billion-other-billionaires-wealth-3769211",
    "timestamp": "2025-04-08T12:03:49Z"
  },
  {
    "title": "Medicare And Medicaid Officials Finalize Rule To Clarify That Medical Marijuana Isn't Covered By Federal Health Programs",
    "description": "The federal Centers for Medicare & Medicaid Services (CMS) has finalized a rule to clarify that marijuana products are not eligible for coverage under certain health plans for chronically ill patients because “they are illegal substances under Federal law.” I…",
    "link": "https://www.marijuanamoment.net/medicare-and-medicaid-officials-finalize-rule-to-clarify-that-medical-marijuana-isnt-covered-by-federal-health-programs/",
    "timestamp": "2025-04-08T12:03:30Z"
  },
  {
    "title": "Nithin Kamath sees 'crazy' retail investor moves even during disastrous market crashes",
    "description": "Retail investors have consistently supported Indian equities post-pandemic, buying during major downturns including Covid, elections, and tariff-induced falls. Their steady participation, alongside domestic institutions, has helped cushion foreign outflows am…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nithin-kamath-sees-crazy-retail-investor-moves-even-during-disastrous-market-crashes/articleshow/120096163.cms",
    "timestamp": "2025-04-08T12:02:38Z"
  },
  {
    "title": "US Steel rises for a 2nd day after Trump orders new security review Nippon Steel bid",
    "description": "US Steel rises for a 2nd day after Trump orders new security review Nippon Steel bid\nPresident Donald Trump is ordering a new review of Nippon Steel’s proposed bid to buy U.S. Steel for nearly $15 billion\nShares of U.S. Steel are rising ahead of the bell afte…",
    "link": "https://biztoc.com/x/ca551f0013900d67",
    "timestamp": "2025-04-08T12:01:27Z"
  },
  {
    "title": "What Does 'Panican' Mean? Donald Trump's New Invented Word",
    "description": "In a recent social media post, President Donald Trump appeared to coin a brand-new term — \"panican\" — leaving many scratching their heads and wondering what exactly he meant.\nTrump coined the term in a post on Truth Social on Monday, in which he pushed back o…",
    "link": "https://biztoc.com/x/0d2bdffe777791dd",
    "timestamp": "2025-04-08T12:01:18Z"
  },
  {
    "title": "New 6-figure ad touts Trump policies that have key industry 'booming': 'You voted for it'",
    "description": "A conservative energy group has launched a new ad touting President Donald Trump's energy policies as part of a seven-figure ad campaign highlighting his agenda.",
    "link": "https://www.foxnews.com/politics/new-6-figure-ad-touts-trump-policies-that-have-key-industry-booming-you-voted-for-it",
    "timestamp": "2025-04-08T12:00:57Z"
  }
]