[
  {
    "title": "US-E3 Snapback Sanctions on Iran: Diplomacy out of the Barrel of a Gun",
    "description": "Iran has voiced a strong rebuke against the recent decision made by France, Germany, and the UK to invoke the UN Security Council’s “snapback” mechanism, which seeks to reimpose sanctions on Tehran regarding its nuclear program. Iran’s Foreign Minister Abbas …",
    "link": "https://www.activistpost.com/us-e3-snapback-sanctions-on-iran-diplomacy-out-of-the-barrel-of-a-gun/",
    "timestamp": "2025-09-09T02:10:00Z"
  },
  {
    "title": "Murdoch Family Succession Ends Drama, Confirms Lachlan’s Leadership",
    "description": "Rupert Murdoch’s family has reached a long-awaited succession deal that secures the future of Fox News under Lachlan Murdoch’s control. The agreement ensures the conservative network, a key platform for President Donald Trump and his allies, will not change c…",
    "link": "https://biztoc.com/x/fa216bc3c0b92cd3",
    "timestamp": "2025-09-09T02:09:17Z"
  },
  {
    "title": "UK, Starmer facing frightful free-speech crisis ahead of Trump’s state visit",
    "description": "Elected within months of each other with thumping victories, Liberal Starmer and hardliner Trump have cut an unlikely alliance with the invitation brandished with great fanfare in the Oval Office.",
    "link": "https://nypost.com/2025/09/08/opinion/uk-starmer-facing-frightful-free-speech-crisis-ahead-of-trumps-state-visit/",
    "timestamp": "2025-09-09T02:09:06Z"
  },
  {
    "title": "Trump note to Epstein that he denies signing is released by Congress",
    "description": "House Democrats released a sexually suggestive letter purportedly signed by Donald Trump to Jeffrey Epstein, included in Epstein's 50th birthday album. Trump denies writing the letter or creating the accompanying drawing, prompting a lawsuit against The Wall …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-note-to-epstein-that-he-denies-signing-is-released-by-congress/articleshow/123776467.cms",
    "timestamp": "2025-09-09T02:08:28Z"
  },
  {
    "title": "Intel announces key executive shake-up, says products chief Holthaus will exit",
    "description": "Holthaus, who will leave after more than three decades with Intel, had held numerous senior leadership roles, including interim co-chief executive officer following the ouster of former CEO Pat Gelsinger last year. She will remain a strategic adviser over the…",
    "link": "https://economictimes.indiatimes.com/tech/technology/intel-announces-key-executive-shake-up-says-products-chief-holthaus-will-exit/articleshow/123776466.cms",
    "timestamp": "2025-09-09T02:08:12Z"
  },
  {
    "title": "US and European officials meet to discuss new sanctions on Russia",
    "description": "U.S. and European officials have met at the U.S. Treasury Department to discuss economic pressure on Russia, including new sanctions and tariffs on Russian oil",
    "link": "https://abcnews.go.com/US/wireStory/us-european-officials-meet-discuss-new-sanctions-russia-125381523",
    "timestamp": "2025-09-09T02:06:25Z"
  },
  {
    "title": "Rupert Murdoch succession agreed as son Lachlan gets control",
    "description": "Under the new agreement, three of Murdoch's children will receive cash based on equity sales and cease to have holdings in the media company. Lachlan, who shares his father's conservative ideals, will succeed Rupert. The family of media mogul Rupert Murdoch h…",
    "link": "https://www.dw.com/en/rupert-murdoch-succession-agreed-as-son-lachlan-gets-control/a-73926018",
    "timestamp": "2025-09-09T02:06:00Z"
  },
  {
    "title": "Congress releases Epstein's 'birthday book,' including alleged Trump letter",
    "description": "Democrats in the U.S. House of Representatives on Monday made public a birthday letter Donald Trump allegedly wrote to sex offender Jeffrey Epstein more than 20 years ago, though the White House quickly denied its authenticity. The letter, the existence of wh…",
    "link": "https://japantoday.com/category/world/congress-releases-epstein%27s-%27birthday-book-%27-including-alleged-trump-letter",
    "timestamp": "2025-09-09T02:05:52Z"
  },
  {
    "title": "U.S. And European Officials Meet To Discuss New Sanctions On Russia: AP Source",
    "description": "Officials with the Treasury Department, including Secretary Scott Bessent, as well as the White House, State Department and U.S. Trade Representative participated in Monday’s meetings, a person familiar told The Associated Press.",
    "link": "https://www.huffpost.com/entry/ap-us-russia-sanctions_n_68bf8a4fe4b0333d06bcfdce",
    "timestamp": "2025-09-09T02:03:35Z"
  },
  {
    "title": "OH PLEASE: Media Outlet Describes Lame Late Night Host Jimmy Kimmel as ‘At the Forefront of Defending Democracy’",
    "description": "Ratings challenged late night host Jimmy Kimmel received a creative arts Emmy award on Sunday.\nThe post OH PLEASE: Media Outlet Describes Lame Late Night Host Jimmy Kimmel as ‘At the Forefront of Defending Democracy’ appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/09/oh-please-media-outlet-describes-lame-late-night/",
    "timestamp": "2025-09-09T02:00:33Z"
  },
  {
    "title": "John Thune To Steamroll Chuck Schumer’s Blockade Of Trump Nominees Through ‘Nuclear Option’",
    "description": "By Adam Pack, Daily Caller News Foundation | September 07, 2025\nSenate Republicans are on the verge of breaking Senate Minority Leader Chuck Schumer’s stranglehold over the confirmation process, ending seven months of unprecedented obstruction that has sought…",
    "link": "https://biztoc.com/x/38d7422ad7d2a1c1",
    "timestamp": "2025-09-09T01:58:32Z"
  },
  {
    "title": "Democrats ‘Hate’ Trump More Than They ‘Love’ Their Communities, Homan Says",
    "description": "By Greg Bishop, via The Daily Signal | September 08, 2025\nTrump administration border czar Tom Homan says Democrat leaders in sanctuary states and cities hate President Donald Trump more than they care for their communities.\nHoman spoke to the State Freedom C…",
    "link": "https://biztoc.com/x/e074cdf20c22311a",
    "timestamp": "2025-09-09T01:58:20Z"
  },
  {
    "title": "White House dismisses Trump ‘birthday card’ to Epstein as bulls**t",
    "description": "The Democrats published a note allegedly signed by President Donald Trump for Jeffrey Epstein’s 50th birthday in 2003 Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624312-trump-epstein-birthday-card/",
    "timestamp": "2025-09-09T01:55:09Z"
  },
  {
    "title": "Even The Alleged Train Stabber’s Own Mother Didn’t Want Him On The Streets",
    "description": "The mother of Decarlos Brown Jr., accused of stabbing Iryna Zarutsk, told WSOC-TV that courts should have \"never let her son be out in the community.\"",
    "link": "https://dailycaller.com/2025/09/08/alleged-train-stabber-mother-decarlos-brown-jr-streets-courts-north-carolina/",
    "timestamp": "2025-09-09T01:54:04Z"
  },
  {
    "title": "Oil rises on modest OPEC+ output hike decision, Russia supply woe",
    "description": "Oil prices experienced gains on Tuesday as OPEC+ decided to increase production by a smaller amount than anticipated, adding to concerns about tighter supply due to potential new sanctions on Russia. The limited production increase and the possibility of sanc…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-rises-on-modest-opec-output-hike-decision-russia-supply-woe/articleshow/123776342.cms",
    "timestamp": "2025-09-09T01:52:15Z"
  },
  {
    "title": "Trump's Alleged Birthday Note To Epstein Released By House Panel",
    "description": "A lewd birthday letter that Donald Trump allegedly sent to Jeffrey Epstein in 2003 -- which the US president claimed did not exist -- was published Monday by a congressional panel investigating the late financier's sex crimes case.",
    "link": "https://www.ibtimes.com/trumps-alleged-birthday-note-epstein-released-house-panel-3782856",
    "timestamp": "2025-09-09T01:51:20Z"
  },
  {
    "title": "Dollar falls hits 7-week low as jobs gloom heightens Fed cut chances",
    "description": "The dollar weakened to a near seven-week low as investors anticipated revisions to U.S. jobs data, potentially indicating a weaker labor market and bolstering the case for Federal Reserve rate cuts. Economists foresee a significant downward revision in job nu…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-falls-hits-7-week-low-as-jobs-gloom-heightens-fed-cut-chances/articleshow/123776323.cms",
    "timestamp": "2025-09-09T01:50:34Z"
  },
  {
    "title": "D-Day Approaches In Bolsonaro Coup Trial",
    "description": "Brazil's Supreme Court begins voting Tuesday to convict or acquit far-right former president Jair Bolsonaro in a coup trial that has prompted mass protests by his fervent base and punitive backlash from his US ally, Donald Trump.",
    "link": "https://www.ibtimes.com/d-day-approaches-bolsonaro-coup-trial-3782854",
    "timestamp": "2025-09-09T01:48:25Z"
  },
  {
    "title": "D-Day approaches in Bolsonaro coup trial",
    "description": "Brazil’s Supreme Court begins voting Tuesday to convict or acquit far-right former president Jair Bolsonaro in a coup trial that has prompted mass protests by his fervent base and punitive backlash from his US ally, Donald Trump. Bolsonaro, 70, risks a prison…",
    "link": "https://www.digitaljournal.com/world/d-day-approaches-in-bolsonaro-coup-trial/article",
    "timestamp": "2025-09-09T01:47:20Z"
  },
  {
    "title": "CNN Data Chief Flags How Trump Is 'Swimming With The Fishes' On These Key Issues",
    "description": "Harry Enten said the president is consistently \"underwater\" on the issues, including one that helped him win a second term.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-trump-polling-underwater-key-issues_n_68bf603be4b0839443d0cb0e",
    "timestamp": "2025-09-09T01:46:40Z"
  },
  {
    "title": "D-Day approaches in Bolsonaro coup trial",
    "description": "Brazil's Supreme Court begins voting Tuesday to convict or acquit far-right former president Jair Bolsonaro in a coup trial that has prompted mass protests...",
    "link": "https://www.yahoo.com/news/articles/d-day-approaches-bolsonaro-coup-014233272.html",
    "timestamp": "2025-09-09T01:42:33Z"
  },
  {
    "title": "Intel announces key executive shake-up, says products chief Holthaus will exit",
    "description": "Intel announced significant executive changes, including the departure of products chief Michelle Johnston Holthaus, amidst CEO Lip-Bu Tan's turnaround efforts. Kevork Kechichian joins from Arm to lead the data center group, while Srinivasan Iyengar will head…",
    "link": "https://economictimes.indiatimes.com/news/international/business/intel-announces-key-executive-shake-up-says-products-chief-holthaus-will-exit/articleshow/123776257.cms",
    "timestamp": "2025-09-09T01:40:11Z"
  },
  {
    "title": "Report: Qatar PM presses Hamas to accept US ceasefire-hostage deal",
    "description": "Qatar’s PM urges Hamas to “respond positively” to a US-backed Gaza ceasefire-hostage deal during talks in Doha.",
    "link": "https://www.israelnationalnews.com/news/414612",
    "timestamp": "2025-09-09T01:39:12Z"
  },
  {
    "title": "Congress releases Epstein's 'birthday book,' including alleged Trump letter",
    "description": "WASHINGTON (Reuters) - Democrats in the U.S. House of Representatives on Monday made public a birthday letter Donald Trump allegedly wrote to sex offender Jeffrey Epstein more than 20 years ago, though the White House quickly denied its authenticity. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/09/09/congress-releases-epstein039s-039birthday-book039-including-alleged-trump-letter",
    "timestamp": "2025-09-09T01:35:00Z"
  },
  {
    "title": "Porter's pre-IPO fundraise; OpenAI scales India plans",
    "description": "Porter is about to close an extended funding round, which could be one of the largest this year. This and more in today's ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/porters-pre-ipo-fundraise-openai-scales-india-plans/articleshow/123776115.cms",
    "timestamp": "2025-09-09T01:33:30Z"
  },
  {
    "title": "Justice Barrett Weighs in on Trump Third-Term Talk",
    "description": "Amy Coney Barrett calls the 22nd Amendment's two-term limit \"true\" as the president continues floating third-term possibilities.",
    "link": "https://www.newsweek.com/amy-coney-barrett-reacts-trump-rumblings-third-term-2126712",
    "timestamp": "2025-09-09T01:32:50Z"
  },
  {
    "title": "Immigrant faithful turn to online sermons, home communion amid Trump crackdown",
    "description": "On Trump's first day in office, his administration scrapped earlier policy of designating places of worship as sensitive locations off limits to immigration enforcement.",
    "link": "https://www.japantimes.co.jp/news/2025/09/09/world/politics/immigrants-virtual-sermons-trump/",
    "timestamp": "2025-09-09T01:23:00Z"
  },
  {
    "title": "Democrats’ Pick To Lead New J6 Committee Thinks Incident Was On Par With 9/11, Pearl Harbor",
    "description": "Democratic California Rep. Eric Swalwell said on Monday that the January 6 attack on the Capitol belongs in the same category as the nation’s darkest days.",
    "link": "https://dailycaller.com/2025/09/08/eric-swalwell-j6-attack-911-pearl-harbor/",
    "timestamp": "2025-09-09T01:21:35Z"
  },
  {
    "title": "French government collapses in a confidence vote, forcing Macron to seek yet another prime minister",
    "description": "PARIS (AP) — Legislators toppled France’s government in a confidence vote on Monday, a new crisis for Europe’s second-largest economy that obliges President Emmanuel Macron to search for a fourth prime minister in 12 months. Prime Minister François Bayrou was…",
    "link": "https://freerepublic.com/focus/f-news/4339265/posts",
    "timestamp": "2025-09-09T01:20:30Z"
  },
  {
    "title": "Epstein Birthday Book Jokes About Selling 'Fully Depreciated\" Woman To Trump",
    "description": "Congress has a copy of the birthday book Jeffrey Epstein allegedly received for his 50th birthday, and they're releasing the entries ... and there's another reference to Donald Trump. One letter, obtained by TMZ, is reportedly from businessman and…\n Permalink",
    "link": "https://www.tmz.com/2025/09/08/epstein-birthday-book-trump-check-joke/",
    "timestamp": "2025-09-09T01:19:31Z"
  },
  {
    "title": "Dollar falls hits 7-week low as jobs gloom heightens Fed cut chances",
    "description": "SINGAPORE (Reuters) -The dollar sank to an almost seven-week low on Tuesday as investors braced for U.S. data revisions that could show the jobs markets in...",
    "link": "https://finance.yahoo.com/news/dollar-falls-hits-7-week-011803173.html",
    "timestamp": "2025-09-09T01:18:03Z"
  },
  {
    "title": "Top Pentagon officials visit Puerto Rico as US steps up military operations in the Caribbean",
    "description": "U.S. Defense Secretary Pete Hegseth and Gen. Dan Caine visited Puerto Rico as the U.S. increases military operations against Caribbean drug cartels. Marines have deployed for training, which Hegseth calls a real-world exercise to combat drug trafficking. Puer…",
    "link": "https://economictimes.indiatimes.com/news/defence/top-pentagon-officials-visit-puerto-rico-as-us-steps-up-military-operations-in-the-caribbean/articleshow/123776125.cms",
    "timestamp": "2025-09-09T01:17:59Z"
  },
  {
    "title": "Putin adviser claims US using stablecoins, gold to devalue its $37T debt",
    "description": "A top adviser to Russian President Vladimir Putin has accused the US of leveraging stablecoins and gold to devalue its $37 trillion debt in order to “start from scratch.”",
    "link": "https://cointelegraph.com/news/us-is-using-stablecoins-devalue-debt-putin-advisor",
    "timestamp": "2025-09-09T01:16:38Z"
  },
  {
    "title": "Trump Jr. slams ‘Ukrainian flag clowns’",
    "description": "Donald Trump Jr. has criticized social media users who display the Ukrainian flag in their online profiles Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624311-trump-ukrainian-flag-clowns/",
    "timestamp": "2025-09-09T01:09:21Z"
  },
  {
    "title": "Trump administration says it launched 'Operation Midway Blitz' in Chicago",
    "description": "The operation appeared to resemble more typical immigration enforcement rather than troop deployments the U.S. president had authorized in other Democratic-held cities.",
    "link": "https://www.japantimes.co.jp/news/2025/09/09/world/politics/trump-operation-midway-blitz-chicago/",
    "timestamp": "2025-09-09T01:09:00Z"
  },
  {
    "title": "The pride of Ethiopia - What it took to build Africa's largest hydro-electric dam",
    "description": "In a fractious nation, the dam's construction has brought people together despite controversy abroad.",
    "link": "https://www.bbc.com/news/articles/cr4qx6377qgo",
    "timestamp": "2025-09-09T01:08:37Z"
  },
  {
    "title": "'Travesty': Supreme Court justice alarms observers with remark on presidential term limits",
    "description": "Supreme Court Justice Amy Coney Barrett's comments about presidential term limits raised eyebrows on Monday night. Barrett was interviewed by Fox News anchor Bret Baier about her recently released memoir, where she gives insight into some of the Supreme Court…",
    "link": "https://www.rawstory.com/amy-coney-barrett-2673972047/",
    "timestamp": "2025-09-09T01:07:01Z"
  },
  {
    "title": "Epstein 'Birthday Book' Depicts Shocking Joke About Selling Woman To Trump",
    "description": "The photo, which features Epstein and a longtime Mar-a-Lago member, arrives on the same day of the release of a separate crude page from the book.",
    "link": "https://www.huffpost.com/entry/jeffrey-epstein-birthday-book-fully-depreciated-woman-trump_n_68bf67eae4b0333d06bcea77",
    "timestamp": "2025-09-09T01:03:13Z"
  },
  {
    "title": "Ethiopia launches massive hydropower dam against bitter Egyptian opposition",
    "description": "NAIROBI (Reuters) -Ethiopia officially inaugurates Africa's largest hydroelectric dam on Tuesday, a project that will provide energy to millions of...",
    "link": "https://www.yahoo.com/news/articles/ethiopia-launches-massive-hydropower-dam-010308869.html",
    "timestamp": "2025-09-09T01:03:08Z"
  },
  {
    "title": "Trump administration says it has launched ICE crackdown in Illinois",
    "description": "After weeks of vowing to deploy National Guard troops to fight crime in Chicago, the Trump administration said on Monday it had launched a deportation crackdown in Illinois targeting hardened criminals among immigrants in the U.S. without legal status. The U.…",
    "link": "https://japantoday.com/category/world/trump-administration-says-it-launches-ice-crackdown-in-illinois",
    "timestamp": "2025-09-09T01:00:55Z"
  },
  {
    "title": "CNN's Brian Stelter says 'pro-Trump activists' seized on Charlotte stabbing, rips 'baldly racist' comments",
    "description": "CNN's Brian Stelter called out \"pro-Trump activists\" for seizing on the murder of 23-year-old Ukrainian refugee Iryna Zarutska that has sparked a national outcry.",
    "link": "https://www.foxnews.com/media/cnns-brian-stelter-says-pro-trump-activists-seized-charlotte-stabbing-rips-baldly-racist-comments",
    "timestamp": "2025-09-09T01:00:07Z"
  },
  {
    "title": "George Conway busts Trump claim of forged signature on lewd Epstein doodle",
    "description": "The Wall Street Journal ignited a firestorm Monday by releasing images of a sexually suggestive birthday message allegedly penned by President Donald Trump to convicted sex offender Jeffrey Epstein back in 2003.The note, reportedly part of a birthday tribute …",
    "link": "https://www.rawstory.com/trump-and-epstein-2673972027/",
    "timestamp": "2025-09-09T01:00:02Z"
  },
  {
    "title": "Trump administration says it launches ICE crackdown in Illinois",
    "description": "CHICAGO: After weeks of vowing to deploy National Guard troops to fight crime in Chicago, the Trump administration said on Monday (Sep 8) it had launched a deportation crackdown in Illinois targeting harde",
    "link": "https://www.channelnewsasia.com/world/us-trump-launches-ice-immigration-raid-chicago-illinois-5339131",
    "timestamp": "2025-09-09T01:00:00Z"
  },
  {
    "title": "Labour wins 2nd term in Norway election as populist right makes gains",
    "description": "Norway's minority Labour Party government won a second term in power on Monday while the populist right achieved its best-ever result, official counts showed, in an election dominated by concerns over rising living costs and wars in Ukraine and Gaza.",
    "link": "https://www.cbc.ca/news/world/norway-election-labour-returns-to-power-1.7628576",
    "timestamp": "2025-09-09T00:59:01Z"
  },
  {
    "title": "Murdoch family settles dispute on control of media assets",
    "description": "Rupert Murdoch's children have reached a settlement in the legal dispute over control of the right-wing media mogul's companies, News Corp and Fox Corp announced Monday. The agreement resolves litigation after siblings had contested Murdoch's effort to instal…",
    "link": "https://japantoday.com/category/business/murdoch-family-settles-dispute-on-control-of-media-assets",
    "timestamp": "2025-09-09T00:58:20Z"
  },
  {
    "title": "President Donald Trump’s administration announces immigration surge to begin in Chicago - Chicago Tribune",
    "description": "President Donald Trump’s administration announces immigration surge to begin in ChicagoChicago Tribune ICE Launches Operation Midway Blitz in Honor of Katie Abraham to Target Criminal Illegal Aliens Terrorizing Americans in Sanctuary IllinoisHomeland Security…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179096304",
    "timestamp": "2025-09-09T00:53:22Z"
  },
  {
    "title": "Israel warns of 'mighty hurricane' in Gaza if Hamas does not surrender",
    "description": "The Israeli military, in a final warning, said Gaza would be destroyed if Hamas doesn't disarm and release 48 hostages seized in the 2023 attacks that triggered the war.",
    "link": "https://www.japantimes.co.jp/news/2025/09/09/world/politics/israel-hurricane-gaza-hamas/",
    "timestamp": "2025-09-09T00:53:00Z"
  },
  {
    "title": "Trump appears with Rolex CEO at U.S. Open even as 39% tariff set to pummel Swiss watch imports - CNBC",
    "description": "Trump appears with Rolex CEO at U.S. Open even as 39% tariff set to pummel Swiss watch importsCNBC Trump Is Met With Mostly Boos at U.S. Open as Security Delays a MatchThe New York Times White House says it didn't ask USTA to help censor reactions to Trump US…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179096270",
    "timestamp": "2025-09-09T00:52:10Z"
  },
  {
    "title": "How VC firm 1789 Capital grew to $1B+ in assets with Donald Trump Jr. as a partner; its recent deals include investments in xAI, Neuralink, and Perplexity",
    "description": "",
    "link": "https://biztoc.com/x/8188b5aa9604c518",
    "timestamp": "2025-09-09T00:51:27Z"
  },
  {
    "title": "Kim Jong Un oversees test of new rocket engine for ICBMs, North Korea says",
    "description": "North Korea said that leader Kim Jong Un supervised a test of a new rocket engine designed for intercontinental ballistic missiles, the latest step in his effort to build an arsenal that poses a viable threat to the continental United States",
    "link": "https://abcnews.go.com/International/wireStory/kim-jong-oversees-test-new-rocket-engine-icbms-125380185",
    "timestamp": "2025-09-09T00:49:35Z"
  },
  {
    "title": "Nikkei 225 hits record days after Japanese prime minister announces resignation",
    "description": "Stocks rose Monday, and the rally continued at the open Tuesday morning.",
    "link": "https://www.japantimes.co.jp/business/2025/09/09/markets/nikkei-record-ishiba/",
    "timestamp": "2025-09-09T00:49:00Z"
  },
  {
    "title": "Nikkei ends lower on yen strength, profit-taking after crossing 44,000",
    "description": "TOKYO : Japan's Nikkei share average ended lower on Tuesday, dragged by a stronger yen and profit-taking after the index climbed past the key 44,000 mark earlier in the session.The Nikkei 225 Index surged as much as 1.24 per cent to an unprecedented 44,185.73…",
    "link": "https://www.channelnewsasia.com/business/nikkei-ends-lower-yen-strength-profit-taking-after-crossing-44000-5339151",
    "timestamp": "2025-09-09T00:48:32Z"
  },
  {
    "title": "Oil rises on modest OPEC+ output hike decision, Russia supply woe",
    "description": "(Reuters) -Oil prices gained on Tuesday after OPEC+ decided to increase production by less than what market participants had anticipated, while concerns over...",
    "link": "https://finance.yahoo.com/news/oil-rises-modest-opec-output-004045755.html",
    "timestamp": "2025-09-09T00:40:45Z"
  },
  {
    "title": "Democrat North Carolina Governor Slammed for Calling for 'More Cops' After NC Stabbing",
    "description": "North Carolina Gov. Josh Stein (D) was criticized for calling for \"more cops\" in response to a stabbing on a train in Charlotte, North Carolina, that left a Ukrainian refugee dead.\nThe post Democrat North Carolina Governor Slammed for Calling for ‘More Cops’ …",
    "link": "https://www.breitbart.com/politics/2025/09/08/democrat-north-carolina-governor-slammed-calling-more-cops-nc-stabbing/",
    "timestamp": "2025-09-09T00:38:15Z"
  },
  {
    "title": "Poll: Gen Z's gender divide reaches beyond politics and into its views on marriage, children and success",
    "description": "The gender gap between men and women has been a durable fact of life in American politics — and nowhere is this gap larger than among the youngest cohort of American adults, Gen Z. But it’s not just politics driving the divide. The latest NBC News Decision De…",
    "link": "https://freerepublic.com/focus/f-chat/4339260/posts",
    "timestamp": "2025-09-09T00:37:48Z"
  },
  {
    "title": "Poll: Gen Z's gender divide reaches beyond politics and into its views on marriage, children and success",
    "description": "The gender gap between men and women has been a durable fact of life in American politics — and nowhere is this gap larger than among the youngest cohort of American adults, Gen Z. But it’s not just politics driving the divide. The latest NBC News Decision De…",
    "link": "https://freerepublic.com/focus/f-news/4339260/posts",
    "timestamp": "2025-09-09T00:37:48Z"
  },
  {
    "title": "Justice Barrett addresses public's 'disconnect' with court ahead of book release",
    "description": "Supreme Court Associate Justice Amy Coney Barrett explains why she wrote her new book and defines the 'disconnect' in how the public perceives the Supreme Court on 'Special Report.'",
    "link": "https://www.foxnews.com/media/justice-barrett-addresses-publics-disconnect-court-ahead-book-release",
    "timestamp": "2025-09-09T00:30:47Z"
  },
  {
    "title": "Indian AI startups run into US visa hurdle",
    "description": "Indian AI startups are increasingly relocating to the US to capitalise on the booming AI sector, but face growing immigration hurdles due to tightened visa rules under the Trump administration.",
    "link": "https://economictimes.indiatimes.com/tech/technology/indian-ai-startups-run-into-us-visa-hurdle/articleshow/123772563.cms",
    "timestamp": "2025-09-09T00:30:00Z"
  },
  {
    "title": "Paul Shaffer Is As Pessimistic About the Future of Late Night As Everyone Else",
    "description": "Shaffer is glad he got out of late night ‘while the getting was good’",
    "link": "https://www.cracked.com/article_48225_paul-shaffer-is-as-pessimistic-about-the-future-of-late-night-as-everyone-else.html",
    "timestamp": "2025-09-09T00:30:00Z"
  },
  {
    "title": "Jessica Tarlov Admits To One Major Biden Mistake",
    "description": "Democratic strategist Jessica Tarlov admitted Biden should have gone through the \"proper\" Department of Justice (DOJ) channels for his last-minute pardons.",
    "link": "https://dailycaller.com/2025/09/08/jessica-tarlov-admits-one-major-mistake-made-by-joe-biden-autopen-pardons/",
    "timestamp": "2025-09-09T00:29:47Z"
  },
  {
    "title": "Creepy Drawing in Epstein Archives Shows Sex Offender Approaching Girls With Balloons Before Being Massaged",
    "description": "A creepy drawing in a book compiled for Jeffrey Epstein's birthday showed the sex offender approaching a group of young girls with balloons.\nThe post Creepy Drawing in Epstein Archives Shows Sex Offender Approaching Girls With Balloons Before Being Massaged f…",
    "link": "https://www.mediaite.com/crime/creepy-drawing-in-epstein-archives-shows-sex-offender-approaching-girls-with-balloons-before-being-massaged/",
    "timestamp": "2025-09-09T00:26:06Z"
  },
  {
    "title": "Trump’s Kennedy Center Is Spectacularly Unpopular",
    "description": "If there’s one thing Donald Trump craves as much as power, it’s crowd size. Unfortunately for him, he’s getting none of the latter from audiences after remaking the Kennedy Center in his image. His D.C. occupation will probably make things worse. Good.\nVia Th…",
    "link": "https://crooksandliars.com/2025/09/trump-s-kennedy-center-spectacularly",
    "timestamp": "2025-09-09T00:23:15Z"
  },
  {
    "title": "Monday, September 8. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,294.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/09/08/monday-september-8-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-09-09T00:22:56Z"
  },
  {
    "title": "Hegseth, top general visit Puerto Rico amid Trump drug cartel fight",
    "description": "Defense Secretary Pete Hegseth and his top general visited Puerto Rico on Monday as the Trump administration targets drug cartels in Latin America and the...",
    "link": "https://www.upi.com/Top_News/US/2025/09/08/defense-Pete-Hegseth-Puerto-Rico-visit/2951757374056/",
    "timestamp": "2025-09-09T00:15:05Z"
  },
  {
    "title": "'Way more difficult': Legal expert warns Trump's WSJ lawsuit just collapsed",
    "description": "President Donald Trump's lawsuit against The Wall Street Journal and Rupert Murdoch for the reporting about his bawdy birthday letter to Jeffrey Epstein will be almost impossible to win now that the alleged image has been produced by House Oversight Committee…",
    "link": "https://www.rawstory.com/trump-lawsuit-2673971831/",
    "timestamp": "2025-09-09T00:15:02Z"
  },
  {
    "title": "Darren Bailey to again run for Illinois governor, source says",
    "description": "Former State Sen. Darren Bailey will again vie for the Republican nomination in Illinois’ gubernatorial election next year.",
    "link": "https://www.nbcchicago.com/news/local/chicago-politics/darren-bailey-to-seek-republican-gubernatorial-nomination-source/3821307/",
    "timestamp": "2025-09-09T00:14:43Z"
  },
  {
    "title": "Dershowitz Skeptical of Trump’s Wall Street Journal Suit: ‘I Don’t Think This Lawsuit Is Going Anywhere’",
    "description": "Alan Dershowitz doesn't think much of President Donald Trump's lawsuit against The Wall Street Journal.\nThe post Dershowitz Skeptical of Trump’s Wall Street Journal Suit: ‘I Don’t Think This Lawsuit Is Going Anywhere’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/dershowitz-skeptical-of-trumps-wall-street-journal-suit-i-dont-think-this-lawsuit-is-going-anywhere/",
    "timestamp": "2025-09-09T00:11:51Z"
  },
  {
    "title": "‘SNL’ Season 51: Premiere date, bloodbath cast shakeups and more",
    "description": "Five new faces are gearing up for their moment.",
    "link": "https://nypost.com/2025/09/08/entertainment/snl-season-51-premiere-date-bloodbath-cast-shakeups-and-more/",
    "timestamp": "2025-09-09T00:10:21Z"
  },
  {
    "title": "The Epstein Letter Is Real, and It's Bad (Jonathan Chait/The Atlantic)",
    "description": "Jonathan Chait / The Atlantic:\nThe Epstein Letter Is Real, and It's Bad  —  The president's initial strategy of denying that the document exists leaves him with few options now that it has been made public.  —  When The Wall Street Journal reported two months…",
    "link": "https://www.memeorandum.com/250908/p145",
    "timestamp": "2025-09-09T00:10:01Z"
  },
  {
    "title": "Jury Selection Begins in Trial of Trump Plot Defendant",
    "description": "Jury selection began Monday in the federal trial of Ryan Routh, who is accused of attempting to assassinate Donald Trump at a Florida golf course in September 2024—a day in court that included an apology to the pool from the defendant for the inconvenience. R…",
    "link": "https://www.newser.com/story/374857/jury-selection-begins-in-trial-of-trump-plot-defendant.html",
    "timestamp": "2025-09-09T00:10:00Z"
  },
  {
    "title": "Mumbling Zohran Mamdani serves up word salad instead of straight answers to pressing NYC issues in recent spate of interviews",
    "description": "Zohran Mamdani dodged straightforward questions on pressing issues facing the Big Apple — capping off days of politician speak that insiders argued showed the candidate's shine is wearing off.",
    "link": "https://nypost.com/2025/09/08/us-news/mumbling-zohran-mamdani-serves-up-word-salad-instead-of-straight-answers-to-pressing-nyc-issues-in-recent-spate-of-interviews/",
    "timestamp": "2025-09-09T00:09:44Z"
  },
  {
    "title": "'Resign!' Extremist MAGA ally melts down at Pam Bondi and 'DOJ full of morons'",
    "description": "A far-right activist and conspiracy theorist renewed her war on President Donald Trump's hand-picked attorney general Monday evening, melting down that a staffer remains in the Justice Department despite being married to a former voting official who hasn't pu…",
    "link": "https://www.rawstory.com/pam-bondi-2673971950/",
    "timestamp": "2025-09-09T00:05:02Z"
  },
  {
    "title": "EXCLUSIVE: Mystery Behind Donald Trump 'Dead' and 'Fake' Claims — How Prez is Being Accused of 'Doing a Putin' by 'Using AI and Body Doubles to Cover up Deadly Illnesses'",
    "description": "President Donald Trump has been accused of using AI and body doubles to \"hide illnesses\" after rumors exploded he \"was dead.\"",
    "link": "https://radaronline.com/p/donald-trump-dead-fake-ai-body-doubles-illness-coverup/",
    "timestamp": "2025-09-09T00:04:51Z"
  },
  {
    "title": "Trump says Democrats have ‘blood on their hands’ after deadly Charlotte train stabbing",
    "description": "President Trump linkws the random stabbing death of a Ukrainian refugee, Iryna Zarutska, in Charlotte to upcoming North Carolina senate race between Roy Cooper and Michael Whatley.",
    "link": "https://www.foxnews.com/politics/trump-says-democrats-have-blood-hands-after-deadly-charlotte-train-stabbing",
    "timestamp": "2025-09-09T00:02:42Z"
  },
  {
    "title": "Yasmin Williams Shares Statement on Decision to Perform at Trump-Led Kennedy Center",
    "description": "In April, the composer and guitarist posted screenshots of a heated email exchange with Kennedy Center president Richard Grenell",
    "link": "https://pitchfork.com/news/yasmin-williams-shares-statement-on-decision-to-perform-at-trump-led-kennedy-center/",
    "timestamp": "2025-09-09T00:01:15Z"
  },
  {
    "title": "“He is so Jealous”: Martina Navratilova accuses Donald Trump of snubbing Carlos Alcaraz’s US Open victory celebration",
    "description": "Carlos Alcaraz secured his second US Open title in 2025, defeating Jannik Sinner in four sets and reclaiming the world No. 1 ranking. The victory was marked by former President Trump's attendance and apparent lack of applause, drawing criticism from Martina N…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/he-is-so-jealous-martina-navratilova-accuses-donald-trump-of-snubbing-carlos-alcarazs-us-open-victory-celebration/articleshow/123775797.cms",
    "timestamp": "2025-09-09T00:00:50Z"
  },
  {
    "title": "Putin adviser accuses US of planning stablecoin scheme to eliminate $35 trillion debt",
    "description": "Russian President Vladimir Putin’s adviser, Dmitry Kobyakov, accused the US of orchestrating a crypto strategy to eliminate its $35 trillion national debt through the manipulation of stablecoins. During his speech at the Eastern Economic Forum on Sept. 6, Kob…",
    "link": "https://cryptoslate.com/putin-adviser-accuses-us-of-planning-stablecoin-scheme-to-eliminate-35-trillion-debt/",
    "timestamp": "2025-09-09T00:00:19Z"
  },
  {
    "title": "All Elements in Place for a US Decapitation Strike on Venezuela",
    "description": "President Donald Trump euphorically concluded his White House press conference on September 2 with breaking news: the US military had just blown up a small motor vessel in the middle of the Caribbean Sea. He alleged that the skiff came from Venezuela and was …",
    "link": "https://original.antiwar.com/roger_harris/2025/09/08/all-elements-in-place-for-a-us-decapitation-strike-on-venezuela/",
    "timestamp": "2025-09-09T00:00:12Z"
  },
  {
    "title": "Florida Declares Victory for Liberty and Parental Rights — Ends School Vaccine Mandates!",
    "description": "Florida has made a bold move that many will hail as a massive win for personal autonomy and parental sovereignty. On September 3, 2025, the state’s Surgeon General Dr. Joseph Ladapo, joined by Governor Ron DeSantis, unveiled a sweeping decision: Florida will …",
    "link": "https://articles.mercola.com/sites/articles/archive/2025/09/09/florida-ends-school-vaccine-mandates.aspx",
    "timestamp": "2025-09-09T00:00:00Z"
  },
  {
    "title": "The Saudi Choice And Trump’s Realism",
    "description": "Donald Trump chose to visit Saudi Arabia first in both his administrations, in May 2017 and May 2025. This choice sends a clear signal about his foreign policy vision and his priorities, and the matter deserves a close examination.",
    "link": "https://www.hoover.org/research/saudi-choice-and-trumps-realism",
    "timestamp": "2025-09-09T00:00:00Z"
  },
  {
    "title": "Why Trump Went To Riyadh And What He Achieved",
    "description": "Donald Trump made the first foreign visit of his second term to Saudi Arabia. He had sound reasons for doing so. Saudi Arabia remains an important and stable leader in an important, but very unstable part of the world. Whether you want to secure moderate oil …",
    "link": "https://www.hoover.org/research/why-trump-went-riyadh-and-what-he-achieved",
    "timestamp": "2025-09-09T00:00:00Z"
  },
  {
    "title": "The Education Exchange: Peeling Back The Curtain On The “Science” Funded By NSF",
    "description": "Heather Mac Donald, the Thomas W. Smith Fellow at the Manhattan Institute, joins Hoover Institution fellow Paul E. Peterson to discuss Mac Donald's recent article, which is critical of the changes the Trump Administration has made with the National Science Fo…",
    "link": "https://www.hoover.org/research/education-exchange-peeling-back-curtain-science-funded-nsf",
    "timestamp": "2025-09-09T00:00:00Z"
  },
  {
    "title": "Trump comments on knife murder of Ukrainian woman",
    "description": "President Donald Trump has condemned the fatal stabbing of a 23-year-old Ukrainian woman on a train in Charlotte, North Carolina Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624310-trump-ukrainian-woman-stabbing/",
    "timestamp": "2025-09-08T23:58:46Z"
  },
  {
    "title": "The American Dream Is Dying. HUD Secretary Scott Turner Aims to Revive It.",
    "description": "This is a preview of this week’s episode of “The Signal Sitdown.” Don’t miss politics editor Bradley Devlin’s interview with Housing and Urban Development Secretary... Read More\nThe post The American Dream Is Dying. HUD Secretary Scott Turner Aims to Revive I…",
    "link": "https://www.dailysignal.com/2025/09/08/the-american-dream-is-dying-hud-secretary-scott-turner-aims-to-revive-it/",
    "timestamp": "2025-09-08T23:58:33Z"
  },
  {
    "title": "Don Jr.'s $1 billion venture firm raises new concerns about Trump's conflicts of interest",
    "description": "Donald Trump Jr. at Teterboro Airport in Teterboro, N.J., en route to attend the Club World Cup final soccer match on July 13, 2025.",
    "link": "https://biztoc.com/x/0b37c9bcc3d8329c",
    "timestamp": "2025-09-08T23:55:19Z"
  },
  {
    "title": "'Ew!' Internet aghast at 'disgusting' photo of Epstein's 'inside joke' with Trump",
    "description": "The internet erupted on Monday after a photo was published showing disgraced financier Jeffrey Epstein jokingly selling a \"fully depreciated\" woman to Donald Trump for $22,500. The Wall Street Journal published the photo, which was taken at Trump's Mar-a-Lago…",
    "link": "https://www.rawstory.com/trump-epstein-2673971943/",
    "timestamp": "2025-09-08T23:55:11Z"
  },
  {
    "title": "Bill Clinton letter in Epstein 'birthday book' among new files released by House Oversight Committee",
    "description": "The House Oversight Committee has released a tranche of files related to Jeffrey Epstein on Monday evening.",
    "link": "https://www.foxnews.com/politics/bill-clinton-letter-epstein-birthday-book-among-new-files-released-house-oversight-committee",
    "timestamp": "2025-09-08T23:52:38Z"
  },
  {
    "title": "The Smug Silence Of The Supreme Court’s Rulings For Trump",
    "description": "The court’s conservatives continue to authorize Donald Trump’s law-breaking without saying a word.",
    "link": "https://www.huffpost.com/entry/supreme-court-donald-trump_n_68bf5e6ee4b0333d06bcdfd7",
    "timestamp": "2025-09-08T23:48:11Z"
  },
  {
    "title": "Intel reshuffles its executive leadership team as its former co-CEO departs",
    "description": "Intel Corp. Chief Executive Lip-Bu Tan has made sweeping changes to his executive leadership team, waving goodbye to former co-CEO Executive Michelle Johnston Holthaus and announcing a series of new appointments. The changes come as Tan intensifies his effort…",
    "link": "https://siliconangle.com/2025/09/08/intel-reshuffles-executive-leadership-team-former-co-ceo-departs/",
    "timestamp": "2025-09-08T23:45:07Z"
  },
  {
    "title": "Lawyer Who Helped Trump Try To Overturn Election Says He May Use ‘Emergency Powers’ To Take Control of Elections",
    "description": "A lawyer who helped President Donald Trump try to overturn the 2020 election claimed the president can \"exercise some emergency powers\" to wield authority over elections.\nThe post Lawyer Who Helped Trump Try To Overturn Election Says He May Use ‘Emergency Pow…",
    "link": "https://www.mediaite.com/media/tv/lawyer-who-helped-trump-try-to-overturn-election-says-he-may-use-emergency-powers-to-take-control-of-elections/",
    "timestamp": "2025-09-08T23:41:59Z"
  },
  {
    "title": "Biden’s autopen scandal is nothing short of a coup — and the culprits needs to be held accountable",
    "description": "President Joe Biden commuted the sentences of more than 4,000 federally incarcerated offenders. Only it wasn’t Biden issuing the record-shattering number of commutations — it was his autopen.",
    "link": "https://nypost.com/2025/09/08/opinion/bidens-autopen-scandal-is-nothing-short-of-a-coup-and-the-culprits-needs-to-be-held-accountable/",
    "timestamp": "2025-09-08T23:40:57Z"
  },
  {
    "title": "Mark Hamill Says He’s ‘Really Ashamed’ America Voted for Trump Twice, the 2nd Administration Is ‘On Us’",
    "description": "\"I’m in the minority in my own country,\" the \"Star Wars\" icon laments\nThe post Mark Hamill Says He’s ‘Really Ashamed’ America Voted for Trump Twice, the 2nd Administration Is ‘On Us’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/mark-hamill-trump-ashamed-wtf-with-marc-maron/",
    "timestamp": "2025-09-08T23:39:39Z"
  },
  {
    "title": "Gen Z male Trump voters want children and financial independence—women Kamala voters rank money, career at top of wish list: NBC poll",
    "description": "A recent poll has found that Gen Z men who voted for Donald Trump are likely to say that having children is the most important thing for their success while Gen Z women who voted for former Vice President Kamala Harris ranked having kids second from the botto…",
    "link": "https://freerepublic.com/focus/f-chat/4339251/posts",
    "timestamp": "2025-09-08T23:38:28Z"
  },
  {
    "title": "Don Jr.'s $1 billion venture firm raises new concerns about Trump's conflicts of interest",
    "description": "A Reuters report reveals how a venture fund which Donald Trump Jr. joined as a partner raises new conflict of interest questions.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/donald-trump-jr-1789-capital-conflict-of-interest-corrupt-rcna229903",
    "timestamp": "2025-09-08T23:37:13Z"
  },
  {
    "title": "White House Trolls Stephen Colbert And Bruce Springsteen For 1 Seriously Weird Reason",
    "description": "President Donald Trump’s social media team was really grasping at straws with their latest “diss.”",
    "link": "https://www.huffpost.com/entry/white-house-trolls-stephen-colbert-and-bruce-springsteen-for-1-seriously-weird-reason_n_68bf39a8e4b0333d06bcc8ef",
    "timestamp": "2025-09-08T23:37:00Z"
  },
  {
    "title": "Zohran Mamdani ramps up suburbanite donations on Long Island — but still trails rivals’ fundraising",
    "description": "Big Apple mayoral hopeful Zohran Mamdani has raked in nearly $200,000 from donors on Long Island since his Democratic Party primary win.",
    "link": "https://nypost.com/2025/09/08/us-news/zohran-mamdani-ramps-up-suburbanite-donations-on-long-island-but-still-trails-rivals-fundraising/",
    "timestamp": "2025-09-08T23:35:58Z"
  }
]