[
  {
    "title": "Hochul hauls in big bucks amid lackluster poll numbers and calls to endorse Mamdani",
    "description": "Governor Hochul's $11.8 million fundraising haul comes amid pressure to endorse democratic socialist Zohran Mamdani for NYC mayor while expressing concerns about his policing stance",
    "link": "https://www.foxnews.com/politics/hochul-hauls-big-bucks-amid-lackluster-poll-numbers-calls-endorse-mamdani",
    "timestamp": "2025-07-14T15:31:37Z"
  },
  {
    "title": "WATCH LIVE: Trump participates in White House Faith Office luncheon",
    "description": "President Donald Trump will appear at a White House Faith Office luncheon, as the administration promises a \"major statement\" on Russia.",
    "link": "https://biztoc.com/x/86e753b240366b91",
    "timestamp": "2025-07-14T15:31:17Z"
  },
  {
    "title": "Petition Demanding Pam Bondi Resign Receives Thousands of Signatures",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA petition calling for U.S. Attorney General Pam Bondi to resign now has more than 29,000 signatures in the wake of the backlash to how she and the Donald Trump administration have handled the Jeffrey Epstein …",
    "link": "https://biztoc.com/x/08ecb8f195d9e87a",
    "timestamp": "2025-07-14T15:31:13Z"
  },
  {
    "title": "List of Trump Allies Who Called for Release of Epstein Files",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump and several of his close allies, including many who are working in his administration, vowed that the so-called Epstein client list would be released by Trump.\nHowever, Trump has now sai…",
    "link": "https://biztoc.com/x/645778de82770eb2",
    "timestamp": "2025-07-14T15:31:13Z"
  },
  {
    "title": "Trump says US to send Patriots to Ukraine via NATO",
    "description": "United States President Donald Trump announced Monday from the White House that the United States will manufacture and deliver Patriot missile systems to Ukraine through NATO, clarifying that allied c...",
    "link": "https://biztoc.com/x/9ba3253daa36d8f6",
    "timestamp": "2025-07-14T15:31:00Z"
  },
  {
    "title": "Fed’s Powell asks for inspector general review of project criticized by Trump officials",
    "description": "U.S. President Donald Trump has the authority to fire Federal Reserve Chair Jerome Powell if evidence supports that, White House economic adviser Kevin Hassett said on Sunday and that the Fed \"has a lot to answer for\" on renovation cost overruns at its Washin…",
    "link": "https://biztoc.com/x/16bbe091c2bfaefc",
    "timestamp": "2025-07-14T15:30:49Z"
  },
  {
    "title": "Donald Trump Issues New Threat to Russia",
    "description": "President Donald Trump made the remarks during an Oval Office meeting with NATO Secretary General Mark Rutte.",
    "link": "https://www.newsweek.com/trump-new-threat-russia-putin-tariffs-ukraine-war-2098736",
    "timestamp": "2025-07-14T15:30:49Z"
  },
  {
    "title": "Democratic Presidential Hopefuls Already Test Driving 2028",
    "description": "A number of Democratic politicians have appeared to signal their interest in running for president in 2028.",
    "link": "https://www.newsweek.com/democratic-presidential-hopefuls-2028-2098498",
    "timestamp": "2025-07-14T15:30:45Z"
  },
  {
    "title": "Father becomes face of lawsuit against ICE as judge hears challenge to warrantless arrests",
    "description": "U.S. Immigration and Customs Enforcement agents detained the Mexican immigrant outside his home in suburban Lyons without a federal warrant. Now, nearly six months later, he is still detained.",
    "link": "https://www.stltoday.com/news/nation-world/article_907311b8-33c4-4770-aa75-b699873881b5.html",
    "timestamp": "2025-07-14T15:30:00Z"
  },
  {
    "title": "Trump says US will send NATO weapons to help Ukraine - as he threatens Putin with 'severe tariffs'",
    "description": "Donald Trump has agreed to send \"top of the line weapons\" to NATO to support Ukraine - and threatened Russia with \"severe\" tariffs if it doesn't agree to end the war.",
    "link": "https://news.sky.com/story/trump-agrees-to-send-top-of-the-line-weapons-to-nato-to-support-ukraine-13396641",
    "timestamp": "2025-07-14T15:30:00Z"
  },
  {
    "title": "Trump announces weapons deal with NATO to help Ukraine - as he gives Putin 50-day ultimatum",
    "description": "Donald Trump has agreed to send \"top of the line weapons\" to NATO to support Ukraine - and threatened Russia with \"severe\" tariffs if it doesn't agree to end the war.",
    "link": "https://news.sky.com/story/trump-announces-weapons-deal-with-nato-to-help-ukraine-as-he-gives-putin-50-day-ultimatum-13396641",
    "timestamp": "2025-07-14T15:30:00Z"
  },
  {
    "title": "Dave Smith Applauded at MAGA Event for Accusing Trump of ‘Actively Covering Up a Giant Child Rapist Ring’",
    "description": "\"I supported Donald Trump in this last election. Yes, he did just actively cover up a giant child rapist ring, and I'm going to criticize him for that.\"\nThe post Dave Smith Applauded at MAGA Event for Accusing Trump of ‘Actively Covering Up a Giant Child Rapi…",
    "link": "https://www.mediaite.com/politics/dave-smith-applauded-at-maga-event-for-accusing-trump-of-actively-covering-up-a-giant-child-rapist-ring/",
    "timestamp": "2025-07-14T15:29:28Z"
  },
  {
    "title": "Petition Demanding Pam Bondi Resign Receives Thousands of Signatures",
    "description": "The past week has seen more than 2,000 people add their signatures to the petition.",
    "link": "https://www.newsweek.com/petition-pam-bondi-signatures-resign-2098711",
    "timestamp": "2025-07-14T15:29:08Z"
  },
  {
    "title": "Justice Department’s purge intensifies as Team Trump’s revenge tour continues",
    "description": "As Justice Department officials who worked on Jan. 6 cases or cases related to Trump get fired, the destabilizing effect on law enforcement is unavoidable.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/justice-departments-purge-intensifies-team-trumps-revenge-tour-continu-rcna218650",
    "timestamp": "2025-07-14T15:28:45Z"
  },
  {
    "title": "How High Can Nvidia Stock Go as Jensen Huang Heads to China?",
    "description": "Nvidia hit record highs last week, and the company’s market cap surpassed $4 trillion. The stock has room to run higher if Nvidia can get concessions on chip...",
    "link": "https://www.barchart.com/story/news/33387922/how-high-can-nvidia-stock-go-as-jensen-huang-heads-to-china",
    "timestamp": "2025-07-14T15:28:18Z"
  },
  {
    "title": "US stock market today: S&P 500 slips, Nasdaq holds firm, Dow dips as Trump tariff fears grow— Boeing jumps, Apple & Tesla slide, crypto stocks rally",
    "description": "Dow Jones today traded slightly lower as investors reacted to President Trump’s 30% tariff announcement on EU and Mexico goods starting August 1. Despite the headline, markets remained stable as hopes for tariff negotiations kept investor sentiment calm. Atte…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-sp-500-slips-nasdaq-holds-firm-dow-dips-as-trump-tariff-fears-grow-boeing-jumps-apple-tesla-slide-crypto-stocks-rally-on-trump-tariff-fears-and-june-cpi-outlook/articleshow/122447372.cms",
    "timestamp": "2025-07-14T15:27:46Z"
  },
  {
    "title": "Bill Maher clashes with liberal actor over Trump, immigration policy",
    "description": "Comedian Bill Maher clashed with liberal actor John Leguizamo over President Trump's immigration policies on Monday, as Maher said the Biden administration was at fault.",
    "link": "https://www.foxnews.com/media/bill-maher-clashes-liberal-actor-over-trump-immigration-policy",
    "timestamp": "2025-07-14T15:27:44Z"
  },
  {
    "title": "List of Trump Allies Who Called for Release of Epstein Files",
    "description": "Several MAGA politicians and members of the Trump administration have called in the past for a more thorough investigation into sex offender Jeffrey Epstein.",
    "link": "https://www.newsweek.com/list-trump-allies-who-called-release-epstein-files-2098693",
    "timestamp": "2025-07-14T15:27:43Z"
  },
  {
    "title": "Dan Bongino's Chances of Leaving Trump Admin As MAGA Influencer Predicts His Resignation Over Epstein Files Debacle",
    "description": "After a MAGA influencer speculated that FBI Deputy Director Dan Bongino would depart \"in the next week,\" bettors try to predict who will leave the administration next.",
    "link": "https://www.ibtimes.com/dan-bonginos-chances-leaving-trump-admin-maga-influencer-predicts-his-resignation-over-epstein-3778434",
    "timestamp": "2025-07-14T15:27:22Z"
  },
  {
    "title": "Trump Threatens '100% Secondary Tariffs' on Russia If No Ukraine Deal Reached in 50 Days",
    "description": "US President Donald Trump announced on Monday that the United States will impose 100% secondary tariffs on Russia if no resolution is reached in the Ukraine conflict within the next 50 days.",
    "link": "https://sputnikglobe.com/20250714/trump-threatens-100-secondary-tariffs-on-russia-if-no-ukraine-deal-reached-in-50-days-1122437895.html",
    "timestamp": "2025-07-14T15:26:57Z"
  },
  {
    "title": "Missouri Harasses AI Companies Over Chatbots Dissing Glorious Leader Trump",
    "description": "AI chatbots failed to \"rank the last five presidents from best to worst, specifically regarding antisemitism,\" in a way that Missouri Attorney General Andrew Bailey likes.",
    "link": "https://reason.com/2025/07/14/missouri-harasses-ai-companies-over-chatbots-dissing-glorious-leader-trump/",
    "timestamp": "2025-07-14T15:26:50Z"
  },
  {
    "title": "Trump threatens Russia with tariffs if war on Ukraine isn't resolved within 50 days",
    "description": "Former U.S. President Donald Trump said he would impose severe tariffs on Russia if a deal to end the Ukraine war isn’t reached within 50 days. Speaking during a meeting with NATO Secretary General Mark Rutte, Trump said he uses trade measures like tariffs to…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-threatens-russia-with-tariffs-if-war-on-ukraine-isnt-resolved-within-50-days/articleshow/122449657.cms",
    "timestamp": "2025-07-14T15:26:40Z"
  },
  {
    "title": "German Chancellor Merz goes into summer in crisis mode",
    "description": "Just over two months in power — and already facing a political crisis. Recently, Friedrich Merz's coalition has been thrown into turmoil. What does the chancellor intend to do about it? In the final answer of his 30-minute interview with Germany's public broa…",
    "link": "https://www.dw.com/en/german-chancellor-merz-goes-into-summer-in-crisis-mode/a-73275497",
    "timestamp": "2025-07-14T15:26:00Z"
  },
  {
    "title": "Accused killer of Minnesota lawmakers teases 'important details' in letter during jailhouse interview",
    "description": "Suspect Vance Boelter claims his alleged killing of Minnesota politician was not related to President Donald Trump or pro-life views, referencing an unreleased letter.",
    "link": "https://www.foxnews.com/us/accused-killer-minnesota-lawmakers-teases-important-details-letter-during-jailhouse-interview",
    "timestamp": "2025-07-14T15:25:25Z"
  },
  {
    "title": "WATCH LIVE: Trump participates in White House Faith Office luncheon",
    "description": "President Donald Trump will appear at a White House Faith Office luncheon, as the administration promises a \"major statement\" on Russia.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-participates-in-white-house-faith-office-luncheon",
    "timestamp": "2025-07-14T15:25:23Z"
  },
  {
    "title": "Joe Biden Slams Republicans As 'Liars' And Calls Them Out For Their Hypocrisy On This 1 Issue",
    "description": "In a rare interview with The New York Times, the former president defended his use of a scrutinized device.",
    "link": "https://www.huffpost.com/entry/joe-biden-slams-gop-over-autopen-questions_n_6874fe6ce4b04f3e272f7f06",
    "timestamp": "2025-07-14T15:23:53Z"
  },
  {
    "title": "Dem Rep Plots To Force Vote Requiring Bondi To Release Epstein Files",
    "description": "'Why are the Epstein files still hidden'",
    "link": "https://dailycaller.com/2025/07/14/ro-khanna-pam-bondi-epstein-files-release/",
    "timestamp": "2025-07-14T15:23:31Z"
  },
  {
    "title": "UK to roll out red carpet for second Trump state visit",
    "description": "Britain will welcome Donald Trump for an unprecedented second state visit in September, Buckingham Palace confirmed Monday, saying he would stay as the guest of King Charles III at Windsor Castle. The US president “accompanied by the First Lady Mrs. Melania T…",
    "link": "https://www.digitaljournal.com/world/uk-to-roll-out-red-carpet-for-second-trump-state-visit/article",
    "timestamp": "2025-07-14T15:22:20Z"
  },
  {
    "title": "Climate Erasure Replaces Climate Denial Under Trump Administration",
    "description": "The days of loudly debating the science have mostly given way to an effort to withhold the raw information itself.",
    "link": "https://grist.org/language/trump-administration-climate-data-disappear-national-climate-assessment/",
    "timestamp": "2025-07-14T15:21:45Z"
  },
  {
    "title": "Byron Donalds' Chances of Beating Casey DeSantis in Florida—Polls",
    "description": "President Donald Trump's endorsement of Rep. Byron Donalds could hold major weight in the state's 2026 gubernatorial race.",
    "link": "https://www.newsweek.com/byron-donalds-casey-desantis-florida-governor-2098690",
    "timestamp": "2025-07-14T15:21:34Z"
  },
  {
    "title": "Trump: Tariffs on Russia if no deal in 50 days",
    "description": "United States President Donald Trump announced on Monday that he will impose a 100% secondary tariff on Russia's goods if a deal on the conflict in Ukraine is not reached in 50 days.More to come......",
    "link": "https://biztoc.com/x/681f390c6e1ba00c",
    "timestamp": "2025-07-14T15:20:25Z"
  },
  {
    "title": "Zelensky Reacts After Trump Aide Visit Amid Looming US-Russia Shift",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nRetired Lt. Gen. Keith Kellogg, President Donald Trump's envoy to Ukraine and Russia, met with Ukrainian President Volodymyr Zelensky in Kyiv on Monday.\nThe meeting came as speculation mounted over a potential…",
    "link": "https://biztoc.com/x/84528241291e45c6",
    "timestamp": "2025-07-14T15:20:18Z"
  },
  {
    "title": "Trump criticizes Fed's Powell again, as White House eyes ways to fire him",
    "description": "U.S. President Donald Trump has the authority to fire Federal Reserve Chair Jerome Powell for cause if evidence supports that, White House economic adviser Kevin Hassett said on Sunday and that the Fed \"has a lot to answer for\" on renovation cost overruns at …",
    "link": "https://biztoc.com/x/6ff77f8e964d0290",
    "timestamp": "2025-07-14T15:19:53Z"
  },
  {
    "title": "U.S. imports from China fell in June from last year, despite rush of orders",
    "description": "U.S. retailers and other importers that had largely halted shipments in May due to tariffs, resumed imports from China in June, amid truce.",
    "link": "https://www.cbsnews.com/news/us-china-imports-june-tariffs/",
    "timestamp": "2025-07-14T15:18:13Z"
  },
  {
    "title": "Zelensky Reacts After Trump Aide Visit Amid Looming US-Russia Shift",
    "description": "The meeting came as speculation mounted over a potential shift in Trump's approach to the ongoing war, now in its third year.",
    "link": "https://www.newsweek.com/zelensky-reacts-trump-us-missiles-nato-russia-2098727",
    "timestamp": "2025-07-14T15:18:09Z"
  },
  {
    "title": "Trump Slashed Solar Credits. First Solar, Sunrun Are Winners Anyway, Analyst Says.",
    "description": "",
    "link": "https://www.barrons.com/articles/solar-stocks-credits-winners-losers-0a3aac88",
    "timestamp": "2025-07-14T15:18:00Z"
  },
  {
    "title": "Trump tariff threats reshape world commerce",
    "description": "President Donald Trump’s latest escalation of trade tensions has sent shockwaves through global markets and accelerated a fundamental realignment of international commerce away from the United States. The announcement of sweeping 30% tariffs on goods from the…",
    "link": "https://rollingout.com/2025/07/14/trump-tariff-threatens-world-commerce/",
    "timestamp": "2025-07-14T15:17:38Z"
  },
  {
    "title": "BREAKING: Trump gets tough with Putin and gives him 50 days to end the war with Ukraine",
    "description": "... Or face 100% secondary tariffs BREAKING News. Trump speaking now.",
    "link": "https://freerepublic.com/focus/f-news/4328620/posts",
    "timestamp": "2025-07-14T15:16:38Z"
  },
  {
    "title": "Aave net deposits of $50 billion compares to ranking in top 50 of banks in US",
    "description": "Aave, the DeFi protocol known for its borrowing and lending services, has hit a key milestone, surpassing $50 billion in net deposits. This achievement positions Aave as the largest DeFi protocol, with a total value locked (TVL) nearly double that of its clos…",
    "link": "https://cryptoslate.com/aaves-50-billion-milestone-challenges-traditional-banking-giants/",
    "timestamp": "2025-07-14T15:15:54Z"
  },
  {
    "title": "Why Trump has vowed to send billion-dollar Patriot missiles to Ukraine",
    "description": "The US is set to send Ukraine one of its most advanced defence systems. Here's what you need to know about Patriot missiles.",
    "link": "https://www.abc.net.au/news/2025-07-15/why-trump-is-sending-patriot-missiles-to-ukraine/105531540",
    "timestamp": "2025-07-14T15:15:20Z"
  },
  {
    "title": "Soccer Fans Brutally Boo Trump During The FIFA Club World Cup (Paige Skinner/HuffPost)",
    "description": "Paige Skinner / HuffPost:\nSoccer Fans Brutally Boo Trump During The FIFA Club World Cup  —  It's a preview of what might be to come when the U.S. hosts the World Cup in 2026.  —  President Donald Trump was booed Sunday during the FIFA Club World Cup at MetLif…",
    "link": "https://www.memeorandum.com/250714/p54",
    "timestamp": "2025-07-14T15:15:00Z"
  },
  {
    "title": "Roger Stone to President Trump: Release DOJ Court Filings in Epstein Case that the DOJ and Jim Comey’s Daughter Maurene Is Keeping Sealed",
    "description": "Maurene Comey, the daughter of fired FBI Head Jim Comey, is keeping Epstein documents sealed. Roger Stone asks President Trump to release these filings. The Epstein case made headlines over the past week and it was not good for the DOJ, FBI or President Trump…",
    "link": "https://freerepublic.com/focus/f-bloggers/4328619/posts",
    "timestamp": "2025-07-14T15:14:46Z"
  },
  {
    "title": "FBI opens 'grand conspiracy' probe on weaponization, opening door to special prosecutor",
    "description": "The FBI has quietly launched an investigation into a decade of Democratic party and deep-state antics from Russia collusion to Jack Smith, opening the door for the appointment of a special prosecutor to examine whether the well-documented episodes amount to a…",
    "link": "https://freerepublic.com/focus/f-news/4328618/posts",
    "timestamp": "2025-07-14T15:13:01Z"
  },
  {
    "title": "'All out war': Trump sets off 'alarm bells' with Texas snub",
    "description": "The Texas race for the U.S. Senate is turning into a massive \"mess,\" reported NOTUS on Monday. President Donald Trump was in the state on Friday to view the aftermath of a disastrous flood disaster, where he gushed about its Republican leaders like Rep. Chip …",
    "link": "https://www.rawstory.com/alarm-bells-going-off-texas-republicans-in-a-mess-over-senate-battle/",
    "timestamp": "2025-07-14T15:12:29Z"
  },
  {
    "title": "Flattery, Firmness, and Flourishes (The Atlantic)",
    "description": "The Atlantic:\nFlattery, Firmness, and Flourishes  —  World leaders and diplomats quietly swap strategies for managing Trump.  —  Italian prime minister Giorgia Meloni's April visit to the White House was, by all accounts, a success.  She soothed President Don…",
    "link": "https://www.memeorandum.com/250714/p53",
    "timestamp": "2025-07-14T15:10:02Z"
  },
  {
    "title": "Trump Stands By Pam Bondi As MAGA Questions Epstein Claims",
    "description": "President Donald Trump is standing by Attorney General Pam Bondi as pressure mounts from within MAGA circles over her handling of the Epstein case. \n“Let Pam Bondi do her job,” Trump wrote on Truth Social, pushing back on critics who accuse her of misleading …",
    "link": "https://biztoc.com/x/114906d9873b5ef1",
    "timestamp": "2025-07-14T15:09:10Z"
  },
  {
    "title": "'Cascade Of Preventable Failures' Contributed To Trump Assassination Attempt: Senate Report",
    "description": "'Cascade Of Preventable Failures' Contributed To Trump Assassination Attempt: Senate Report\n \nAuthored by Jacob Burg via The Epoch Times,\nThe Senate released a report on July 13 detailing the critical missteps that allowed a gunman to climb a building and ope…",
    "link": "https://biztoc.com/x/6bcc17b498f18549",
    "timestamp": "2025-07-14T15:09:07Z"
  },
  {
    "title": "INGERSOLL: Epstein Is An ‘Avatar For The Unaccountable’ — But Trump Doesn’t Get That",
    "description": "“I shouldn’t have to pay another parking ticket until at least 10 people who visited Epstein’s island are served with warrants.\"",
    "link": "https://dailycaller.com/2025/07/14/state-of-monday-trump-vs-epstein-files-client-list/",
    "timestamp": "2025-07-14T15:06:50Z"
  },
  {
    "title": "Traders largely shrug off tariffs before US consumer price data",
    "description": "NEW YORK :The euro hit a three-week low on Monday before recovering to trade little changed on the day, while the dollar was steady against a basket of currencies, as traders largely shrugged off new tariffs ahead of key U.S. inflation data on Tuesday.U.S. Pr…",
    "link": "https://www.channelnewsasia.com/business/traders-largely-shrug-tariffs-us-consumer-price-data-5236456",
    "timestamp": "2025-07-14T15:05:49Z"
  },
  {
    "title": "China steps in as US pulls back from diplomacy, report says",
    "description": "WASHINGTON (Reuters) -China is increasing its diplomatic reach as President Donald Trump's administration pares back America's international presence...",
    "link": "https://ca.news.yahoo.com/china-steps-us-pulls-back-150447057.html",
    "timestamp": "2025-07-14T15:04:47Z"
  },
  {
    "title": "Bannon warns of electoral catastrophe for Republicans",
    "description": "The Republicans could lose 40 US House seats and the presidency over Trump’s failure to deliver Epstein revelations, Steve Bannon has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621469-bannon-trump-maga-split/",
    "timestamp": "2025-07-14T15:03:13Z"
  },
  {
    "title": "Developing: Ghislaine Maxwell Welcomes the Chance to Get Before Congress and Spill the Beans on Epstein Story – Report",
    "description": "Developing: Ghislaine Maxwell Welcomes the Chance to Get Before Congress and Spill the Beans on Epstein Story – Reportwesternjournal.com",
    "link": "https://www.westernjournal.com/developing-ghislaine-maxwell-welcomes-chance-get-congress-spill-beans-epstein-story-report/",
    "timestamp": "2025-07-14T15:01:36Z"
  },
  {
    "title": "What are Patriot missiles and how will they help Ukraine?",
    "description": "The United States is planning to send more Patriot surface-to-air missile defense system to Ukraine, via an EU payment deal, just weeks after other shipments were halted.",
    "link": "https://www.dw.com/en/what-are-patriot-missiles-and-how-will-they-help-ukraine/a-64115825",
    "timestamp": "2025-07-14T15:01:00Z"
  },
  {
    "title": "Trump Denies A Cover-Up In The Epstein Case",
    "description": "Even though almost everyone is aware that the ruling class is covering up information in the Jeffrey Epstein case, current President Donald Trump denies it.  He has even gone so far as to urge his supporters not to spread any speculation about the alleged lis…",
    "link": "https://www.shtfplan.com/member-exclusive/trump-denies-a-cover-up-in-the-epstein-case",
    "timestamp": "2025-07-14T15:00:59Z"
  },
  {
    "title": "7 Common Tax Planning Mistakes To Fix Before 2026, According to a CFP",
    "description": "If you're making one of these seven common tax planning mistakes -- and many people are -- you could face higher tax bills or missed opportunities come 2026.",
    "link": "https://finance.yahoo.com/news/7-common-tax-planning-mistakes-150030640.html",
    "timestamp": "2025-07-14T15:00:30Z"
  },
  {
    "title": "China Promoting South American Transcontinental Railway Project as Panama Canal Alternative",
    "description": "Since Sec. of State Rubio reminded Panama of its treaty obligations, BlackRock purchased Hong Kong's canal ports and its traffic has surged.\nThe post China Promoting South American Transcontinental Railway Project as Panama Canal Alternative first appeared on…",
    "link": "https://legalinsurrection.com/2025/07/china-promoting-south-american-transcontinental-railway-project-as-panama-canal-alternative/",
    "timestamp": "2025-07-14T15:00:20Z"
  },
  {
    "title": "‘Pure Misinformation’: Coinbase Denies Role In Leak Tying Binance To Trump Coin",
    "description": "A sudden flare‑up of rumors sent waves through the crypto world this week. At the center is a Bloomberg story linking Binance to the creation of USD1, a stablecoin backed by World Liberty Financial and supported by US President Donald Trump’s family. Coinbase…",
    "link": "https://bitcoinist.com/pure-misinformation-coinbase-denies-role-in-leak-tying-binance-to-trump-coin/",
    "timestamp": "2025-07-14T15:00:15Z"
  },
  {
    "title": "Democrats seize on Epstein files drama with new transparency calls",
    "description": "Democratic lawmakers are demanding the release of more Epstein files as the issue causes fractures within the GOP.",
    "link": "https://www.foxnews.com/politics/democrats-seize-epstein-files-drama-new-transparency-calls",
    "timestamp": "2025-07-14T15:00:04Z"
  },
  {
    "title": "The spectacle presidency: How The Don governs through distraction...",
    "description": "What will Trump use to distract the public next? And perhaps more critically: Will the media keep chasing the spectacle?",
    "link": "https://thehill.com/opinion/white-house/5397223-trump-two-weeks-media-strategy/",
    "timestamp": "2025-07-14T15:00:03Z"
  },
  {
    "title": "Jan Resseger: Trump Is Obliterating Civil Rights Laws",
    "description": "Jan Resseger is a social justice warrior who worked for the United Church of Christ. In retirement, she writes lucid, carefully researched articles about social policy and its effect on the nation’s most vulnerable people. I should post everything she writes …",
    "link": "https://dianeravitch.net/2025/07/14/jan-resseger-trump-is-obliterating-civil-rights-laws/",
    "timestamp": "2025-07-14T15:00:00Z"
  },
  {
    "title": "10 Unaccompanied Migrant Children Found at Marijuana Grow Sites",
    "description": "Ten of the 14 children found at the marijuana grow sites in California did not have a parent present at the facility, according to Tricia... Read More\nThe post 10 Unaccompanied Migrant Children Found at Marijuana Grow Sites appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/14/10-unaccompanied-migrant-children-found-at-marijuana-grow-sites/",
    "timestamp": "2025-07-14T15:00:00Z"
  },
  {
    "title": "July 14 editorial cartoons",
    "description": "Monday’s political cartoons include the price of produce without migrants, Donald Trump and Jeffrey Epstein reunited, and what happens when you call DHS.",
    "link": "https://theweek.com/cartoons/july-14-editorial-cartoons",
    "timestamp": "2025-07-14T15:00:00Z"
  },
  {
    "title": "Hip hop icon launches new Swansea City kit in Swans' latest big-name link-up and there could be more to come",
    "description": "The Long Beach-born superstar could be set for a bigger role at the South Wales club",
    "link": "https://www.fourfourtwo.com/news/hip-hop-icon-launches-new-swansea-city-kit-in-swans-latest-big-name-link-up-and-there-could-be-more-to-come",
    "timestamp": "2025-07-14T15:00:00Z"
  },
  {
    "title": "Elmo Twitter Hacked / Antisemitic Elmo",
    "description": "Elmo Twitter Hacked and Antisemitic Elmo refers to a series of antisemitic and offensive tweets posted by the official Elmo Twitter / X account on July 13th, 2025. The posts inspired reactions and memes that portray Elmo as being antisemitic and generally hol…",
    "link": "https://knowyourmeme.com/memes/events/elmo-twitter-hacked-antisemitic-elmo",
    "timestamp": "2025-07-14T14:59:45Z"
  },
  {
    "title": "US sets record for child deportation orders – Independent",
    "description": "Thousands of undocumented minors were issued removal orders in April, according to court data cited by the outlet Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621458-us-immigrant-kids-deportations/",
    "timestamp": "2025-07-14T14:59:37Z"
  },
  {
    "title": "Trump's 32 pct tariff on Indonesia delayed for more talks: minister",
    "description": "Indonesia&rsquo;s Coordinating Minister for Economic Affairs, Airlangga Hartarto, confirmed that the implementation of US President Donald Trump&rsquo;s 32 ...",
    "link": "https://en.antaranews.com/news/366297/trumps-32-pct-tariff-on-indonesia-delayed-for-more-talks-minister",
    "timestamp": "2025-07-14T14:59:11Z"
  },
  {
    "title": "EU could target US$84 billions of US goods if tariff talks fail",
    "description": "BRUSSELS: The European Commission on Monday (Jul 14) said it was putting forward a new list of US goods worth €72 billion (US$84 billion) that could be targeted by EU levies if tariff talks with Washington fail. The bloc's trade chief, Commissioner Maros Sefc…",
    "link": "https://www.channelnewsasia.com/world/eu-could-target-us84-billions-us-goods-if-tariff-talks-fail-5237701",
    "timestamp": "2025-07-14T14:59:00Z"
  },
  {
    "title": "Ellen DeGeneres makes rare political comment in support of Rosie O’Donnell after Trump threatens her citizenship",
    "description": "O’Donnell fired back at Trump’s threat on Saturday, saying she was ‘everything [he] feared’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/ellen-degeneres-rosie-odonnell-trump-citizenship-b2788662.html",
    "timestamp": "2025-07-14T14:56:56Z"
  },
  {
    "title": "Donald Trump’s eventful day at the Club World Cup final: Being booed, celebrating with Chelsea and a winner’s medal - CNN",
    "description": "Donald Trump’s eventful day at the Club World Cup final: Being booed, celebrating with Chelsea and a winner’s medalCNN Chelsea's Cole Palmer surprised to share Club World Cup podium spotlight with Donald TrumpAP News ‘Laughing Stock’ NY Post brutally mocked f…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178374762",
    "timestamp": "2025-07-14T14:54:48Z"
  },
  {
    "title": "Funding Cuts to Corporation for Public Broadcasting May Gut Tribal Media",
    "description": "Without the funding, many communities, especially rural communities, could become isolated as public media stations and radio may go off the air.",
    "link": "https://ictnews.org/news/impending-legislation-could-gut-tribal-media-funding/",
    "timestamp": "2025-07-14T14:53:43Z"
  },
  {
    "title": "Newsom Steps On Political Landmine, Repeats Party’s Infamous Mistake",
    "description": "Gavin Newsom is once again repeating a mistake: leaping at the opportunity to champion innocent illegal aliens before more background information is known.",
    "link": "https://dailycaller.com/2025/07/14/gavin-newsom-ice-raids-marijuana-farms-illegal-alien-alleged-child-predator/",
    "timestamp": "2025-07-14T14:53:08Z"
  },
  {
    "title": "Militarism Has Long Worked to Shield Antisemitism",
    "description": "Jeet Heer\n\n\n\nFrom the Cold War till Donald Trump, there’s always been a special dispensation for hawkish bigots.\r\n\n\r\n\n\nThe post Militarism Has Long Worked to Shield Antisemitism appeared first on The Nation.",
    "link": "https://www.thenation.com/article/culture/trump-podhoretz-militarism-antisemitism/",
    "timestamp": "2025-07-14T14:51:34Z"
  },
  {
    "title": "Pam Bondi Fires Top DOJ Ethics Adviser",
    "description": "Attorney General Pam Bondi fired a top ethics lawyer at the Justice Department amid a purge of anyone connected to the Jan. 6 or Trump prosecutions.",
    "link": "http://www.rollingstone.com/politics/politics-news/pam-bondi-fires-top-doj-ethics-lawyer-1235384777/",
    "timestamp": "2025-07-14T14:51:23Z"
  },
  {
    "title": "Trump’s presence at Chelsea’s trophy lift was a fitting coda to a misguided tournament",
    "description": "The football was at times intriguing, but the true meaning of the first expanded Club World Cup will be debated for years",
    "link": "https://sports.yahoo.com/article/trump-presence-chelsea-trophy-lift-145042830.html",
    "timestamp": "2025-07-14T14:50:42Z"
  },
  {
    "title": "Court’s attack on Congress, president described as nothing other than ‘judicial terrorism’",
    "description": "Judge orders continued funding for abortionists despite legislation adopted by the House and Senate, and signed by the president, on no legal basis",
    "link": "https://www.wnd.com/2025/07/courts-attack-congress-president-described-as-nothing-other/",
    "timestamp": "2025-07-14T14:50:06Z"
  },
  {
    "title": "Sesame Workshop Says Unknown Hacker Responsible For Posting Antisemitic And Racist Posts To Elmo’s X Account",
    "description": "Sesame Workshop said an unknown hacker was responsible for posting antisemitic and racist messages to Elmo’s X account. The posts also included messages linking Donald Trump to Jeffrey Epstein, the convicted sex offender. The posts originally appeared on the …",
    "link": "http://deadline.com/2025/07/elmo-account-hacked-sesame-street-1236456579/",
    "timestamp": "2025-07-14T14:48:36Z"
  },
  {
    "title": "Trump’s shared FIFA Club World Cup celebration ‘confused’ Chelsea’s Cole Palmer",
    "description": "As the club commemorated its 3-0 victory against Paris Saint-Germain, Trump stayed on stage during the trophy presentation, typically reserved for team personnel, baffling the Chelsea star.",
    "link": "https://nypost.com/2025/07/14/sports/trumps-shared-fifa-club-world-cup-celebration-confused-chelseas-cole-palmer/",
    "timestamp": "2025-07-14T14:47:22Z"
  },
  {
    "title": "Democratic Governors: What's the GOP Budget Bill? A Big Betrayal of the Middle Class | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe GOP is calling it a big, beautiful bill. We're calling it what it really is—a big betrayal.\nThat's why we don't like what we're seeing coming out of Washington, D.C., right now. When President Donald Trump…",
    "link": "https://biztoc.com/x/09ac6269a8cf0c40",
    "timestamp": "2025-07-14T14:47:17Z"
  },
  {
    "title": "Trump memecoin made $172M for crypto exchanges — Report",
    "description": "TRUMP memecoin has generated at least $172 million in trading fees for 10 crypto exchanges, including Binance, Coinbase, OKX and more, Reuters reported.",
    "link": "https://cointelegraph.com/news/crypto-exchanges-172m-trump-memecoin-trading-fees",
    "timestamp": "2025-07-14T14:47:08Z"
  },
  {
    "title": "Why Trump removing Powell is the market's most underestimated risk",
    "description": "Analysts at Deutsche Bank consider the president's removal of Fed chief Jerome Powell \"one of the largest under-priced event risks over the coming months.\"",
    "link": "https://www.businessinsider.com/trump-powell-feud-market-most-overlooked-risk-dollar-bond-rates-2025-7",
    "timestamp": "2025-07-14T14:46:57Z"
  },
  {
    "title": "Will Trump sue AOC?",
    "description": "Close associates of President Trump are advising him to sue Rep. Alexandria Ocasio-Cortez (for a post she published against him on X, in which she called him a \"rapist.\"",
    "link": "https://www.israelnationalnews.com/news/411648",
    "timestamp": "2025-07-14T14:45:52Z"
  },
  {
    "title": "Master Negotiator Trump Whines That Putin Is Embarrassing Him",
    "description": "Donald Trump is still just becoming wise to the notion that Russian President Vladimir Putin might not be a good-faith actor on the international stage.On Sunday, the president announced plans to send an unspecified number of Patriot air defense missiles to U…",
    "link": "https://newrepublic.com/post/197914/trump-whines-putin-embarrassing-him-talks-nice",
    "timestamp": "2025-07-14T14:45:38Z"
  },
  {
    "title": "Usyk starts heavyweight title week with focus on war in Ukraine",
    "description": "LONDON :World heavyweight boxing champion Oleksandr Usyk kicked off the big fight build-up in London on Monday with a focus on war in his native Ukraine rather than anything he might face in the ring.The unbeaten 38-year-old takes on Britain's IBF champion Da…",
    "link": "https://www.channelnewsasia.com/sport/usyk-starts-heavyweight-title-week-focus-war-ukraine-5237681",
    "timestamp": "2025-07-14T14:45:22Z"
  },
  {
    "title": "Trump envoy meets with Ukraine’s Zelenskyy",
    "description": "Trump last week said he would make a “major statement” on Russia on Monday. He was due to meet with NATO Secretary-General Mark Rutte in Washington. Rutte also planned to hold talks with U.S. Defense Secretary Hegseth and Secretary of State Marco Rubio, as we…",
    "link": "https://www.pbs.org/newshour/world/trump-envoy-meets-with-ukraines-zelenskyy",
    "timestamp": "2025-07-14T14:45:03Z"
  },
  {
    "title": "Vance and Newsom Trade Barbs Over the VP’s Disneyland Vacation as Governor Demands Trump Withdraw Troops",
    "description": "California Gov. Gavin Newsom (D) was fighting mad after Vice President JD Vance took a Disneyland family vacation over the weekend, launching several social media attacks against the Republican.\nThe post Vance and Newsom Trade Barbs Over the VP’s Disneyland V…",
    "link": "https://www.mediaite.com/media/news/vance-and-newsom-trade-barbs-over-the-vps-disneyland-vacation-as-governor-demands-trump-withdraw-troops/",
    "timestamp": "2025-07-14T14:44:39Z"
  },
  {
    "title": "Democratic Governors: What's the GOP Budget Bill? A Big Betrayal of the Middle Class | Opinion",
    "description": "People in every corner of America will feel the effects of President Donald Trump and congressional Republicans' disastrous budget now that it is law. You deserve to know exactly what's in it.",
    "link": "https://www.newsweek.com/democratic-governors-whats-gop-budget-bill-big-betrayal-middle-class-opinion-2098074",
    "timestamp": "2025-07-14T14:44:36Z"
  },
  {
    "title": "'Just so you know': MAGA rep schooled live on CNN as he tries to dismiss scandal",
    "description": "MAGA Rep. Mike Lawler (R-NY) wasn't convinced of the merits of appointing a special counsel to investigate the elusive Jeffrey Epstein files when asked about conservative activist Laura Loomer's suggestion on Monday.Loomer, who appears to have President Donal…",
    "link": "https://www.rawstory.com/tump-and-epstein/",
    "timestamp": "2025-07-14T14:44:26Z"
  },
  {
    "title": "‘Who’s got next?’ Democrats already lining up for 2028 presidential race in early voting states",
    "description": "The political jockeying by Democrats for the 2028 presidential contest appears to be playing out earlier.",
    "link": "https://www.denverpost.com/2025/07/14/us-election-2028-democrats/",
    "timestamp": "2025-07-14T14:43:26Z"
  },
  {
    "title": "‘Who’s got next?’ Democrats already lining up for 2028 presidential race in early voting states",
    "description": "The political jockeying by Democrats for the 2028 presidential contest appears to be playing out earlier.",
    "link": "https://www.bostonherald.com/2025/07/14/us-election-2028-democrats/",
    "timestamp": "2025-07-14T14:43:26Z"
  },
  {
    "title": "Dem Strategist Says Party Should ‘Pray’ For ‘F*cking Depression’ To Get Out Of Its ‘Mess’",
    "description": "Several Democrats said that they currently have a grim outlook on the future of the Democratic Party, The Hill reported Monday.",
    "link": "https://dailycaller.com/2025/07/14/democratic-strategist-current-mess-depression/",
    "timestamp": "2025-07-14T14:42:49Z"
  },
  {
    "title": "Donald Trump's Epstein Problem Not Going Away: 'Massive Unforced Error'",
    "description": "Online searches for Jeffrey Epstein increased by 1,900 percent within a week.",
    "link": "https://www.newsweek.com/donald-trump-jeffrey-epstein-google-search-trends-2098632",
    "timestamp": "2025-07-14T14:41:11Z"
  },
  {
    "title": "EU sanctions against Israel: here’s what’s on the table",
    "description": "Europe has the means to prevent further suffering in Gaza, but political will is lacking.",
    "link": "https://theconversation.com/eu-sanctions-against-israel-heres-whats-on-the-table-260982",
    "timestamp": "2025-07-14T14:40:27Z"
  },
  {
    "title": "Biden chief of staff reportedly gave approval for autopen pardons on final day in office",
    "description": "President Donald Trump has claimed that the thousands of pardons signed during the Biden administration are void, due to alleged autopen usage.",
    "link": "https://www.foxnews.com/politics/biden-chief-staff-reportedly-gave-approval-autopen-pardons-final-day-office",
    "timestamp": "2025-07-14T14:39:06Z"
  },
  {
    "title": "Biden chief of staff gave reportedly gave approval for autopen pardons on final day in office",
    "description": "President Donald Trump has claimed that the thousands of pardons signed during the Biden administration are void, due to alleged autopen usage.",
    "link": "https://www.foxnews.com/politics/biden-chief-staff-gave-reportedly-gave-approval-autopen-pardons-final-day-office",
    "timestamp": "2025-07-14T14:39:06Z"
  },
  {
    "title": "Thomas Massie Gets Influx of New Donors",
    "description": "Rep. Thomas Massie (R-KY) \"has raked in a slew of new financial supporters despite his recent public spats with President Donald Trump,\" the Cincinnati Enquirer reports. Massie has raised $584,325 in the July 2025 quarterly",
    "link": "https://politicalwire.com/2025/07/14/thomas-massie-gets-influx-of-new-donors/",
    "timestamp": "2025-07-14T14:36:57Z"
  },
  {
    "title": "Trump $1,000 account for children: How it works, who is eligible and all the details",
    "description": "President Donald Trump’s “One Big Beautiful Bill” will establish a savings account for millions of babies born in the U.S. The so-called “Trump accounts” will “afford a generation of children the chance to experience the miracle of compounded growth and set t…",
    "link": "https://biztoc.com/x/68e189acf4e5d818",
    "timestamp": "2025-07-14T14:35:33Z"
  }
]