[
  {
    "title": "Farmer warns ‘this is a five-alarm fire’ as time is running out ahead of harvest, and there’s still no China deal",
    "description": "“We want to work. We work the land, we harvest the land, the crop off the land. And the worst thing that we could ever want is a handout.”",
    "link": "https://fortune.com/2025/09/27/soybean-farmer-agriculture-economic-crisis-trump-trade-war-china-tariffs/",
    "timestamp": "2025-09-27T14:56:49Z"
  },
  {
    "title": "Donald Trump says he will send army to ‘war ravaged’ Portland to handle ‘domestic terrorists’",
    "description": "President Donald Trump said he will send troops to Portland, Oregon, to handle “domestic terrorists” as he expands his controversial deployments to more American cities.",
    "link": "https://www.independent.ie/world-news/donald-trump-says-he-will-send-army-to-war-ravaged-portland-to-handle-domestic-terrorists/a1285512924.html",
    "timestamp": "2025-09-27T14:56:13Z"
  },
  {
    "title": "The Post endorses Jack Ciattarelli for New Jersey governor",
    "description": "New Jersey voters sick of the blue-state blues have a shot at some relief this November, by backing Republican Jack Ciattaralli for governor.",
    "link": "https://nypost.com/2025/09/27/opinion/the-post-endorses-jack-ciatarelli-for-new-jersey-governor/",
    "timestamp": "2025-09-27T14:54:52Z"
  },
  {
    "title": "Slovakia Resists Trump's Push to Quickly Quit Russian Oil",
    "description": "Slovakia has no plans to quickly abandon Russian oil supplies, President Peter Pellegrini told US President Donald Trump during talks in New York this week. Trump has been pressing the European Union’s holdouts — Hungary and Slovakia — to end imports of Russi…",
    "link": "https://www.ndtvprofit.com/world/slovakia-resists-trumps-push-to-quickly-quit-russian-oil",
    "timestamp": "2025-09-27T14:54:47Z"
  },
  {
    "title": "James Gunn Reveals Whether He Wrote PEACEMAKER's Alternate Earth With Real-Life Politics In Mind - SPOILERS",
    "description": "With many fans making comparisons between Peacemaker season 2's parallel Earth and the current political situation in the United States, James Gunn has set the record straight on whether that was intended.",
    "link": "https://comicbookmovie.com/tv/dc/peacemaker/james-gunn-reveals-whether-he-wrote-peacemakers-alternate-earth-with-real-life-politics-in-mind---spoilers-a224015",
    "timestamp": "2025-09-27T14:54:01Z"
  },
  {
    "title": "Trump Orders Troops Deployed To 'War Ravaged' Democrat-Run City",
    "description": "President Donald Trump on Saturday announced in a post on Truth Social that he has directed his administration to deploy troops to Portland, Oregon as part of his effort to crackdown on crime in major cities across the nation.\nTrump had previously discussed p…",
    "link": "https://biztoc.com/x/1d53bf89a9712e74",
    "timestamp": "2025-09-27T14:53:07Z"
  },
  {
    "title": "Does Tylenol Cause Autism? Here’s What The Evidence Says",
    "description": "The drug cabinet of a pregnant woman today is already a minefield of anxiety. Now a potent new variable has been introduced: political theater. When the President of the United States and the Secretary of Health and Human Services suggested on September 22, 2…",
    "link": "https://www.skeptic.com/article/does-tylenol-cause-autism-heres-what-the-evidence-says/",
    "timestamp": "2025-09-27T14:51:44Z"
  },
  {
    "title": "Viral tweet claims Charlie Kirk's widow Erika Kirk looking for partner on dating App to move on. Here is truth",
    "description": "Erika Kirk made global headlines after her fiery speech following husband Charlie Kirk's demise.",
    "link": "https://economictimes.indiatimes.com/news/international/us/viral-tweet-claims-charlie-kirks-widow-erika-kirk-looking-for-partner-on-dating-app-to-move-on-here-is-truth/articleshow/124183603.cms",
    "timestamp": "2025-09-27T14:51:23Z"
  },
  {
    "title": "An Ugly American berates the United Nations — and shames the rest of us (Chauncey DeVega/Salon)",
    "description": "Chauncey DeVega / Salon:\nAn Ugly American berates the United Nations — and shames the rest of us  —  Trump's angry speech before the General Assembly was “coarse absurdist theater”  —  President Donald Trump is a master performer.  He is a symbol and characte…",
    "link": "https://www.memeorandum.com/250927/p32",
    "timestamp": "2025-09-27T14:50:00Z"
  },
  {
    "title": "Trump Says He'll Send Troops To Portland, Oregon As He Expands Military Deployments In U.S. Cities",
    "description": "He deployed the National Guard to Los Angeles over the summer and as part of his law enforcement takeover in Washington, D.C.",
    "link": "https://www.huffpost.com/entry/trump-says-hell-send-troops-to-portland-oregon-as-he-expands-military-deployments-in-us-cities_n_68d7f7cee4b0d6db559b2336",
    "timestamp": "2025-09-27T14:49:53Z"
  },
  {
    "title": "Canada Wants To Lure Tech Workers Who Won't Get US H-1B Visas",
    "description": "Canadian Prime Minister Mark Carney wants to attract employees from the technology sector who might have previously worked in the US before President Donald Trump’s new visa charges. “What is clear is that the opportunity to attract people who previously woul…",
    "link": "https://www.ndtvprofit.com/world/canada-wants-to-lure-tech-workers-who-wont-get-us-h-1b-visas",
    "timestamp": "2025-09-27T14:49:14Z"
  },
  {
    "title": "Trump Orders Troops To Portland—Authorizes ‘Full Force’",
    "description": "President Donald Trump ordered a crackdown on alleged “organized political violence,” claiming “riots” targeted ICE agents.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/09/27/trump-orders-troops-to-portland-authorizes-full-force/",
    "timestamp": "2025-09-27T14:48:12Z"
  },
  {
    "title": "Trump says he'll send troops to Portland, Oregon, to handle 'domestic terrorists'",
    "description": "President Trump announced he will send troops to Portland, Oregon, to combat \"domestic terrorists\" and protect ICE facilities, authorizing \"Full Force\" if needed. This escalation follows the assassination of Charlie Kirk and targets the \"radical left,\" mirror…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-hell-send-troops-to-portland-oregon-to-handle-domestic-terrorists/articleshow/124183583.cms",
    "timestamp": "2025-09-27T14:45:05Z"
  },
  {
    "title": "Trump: troops to Portland (my title)",
    "description": "At the request of Secretary of Homeland Security, Kristi Noem, I am directing Secretary of War, Pete Hegseth, to provide all necessary Troops to protect War ravaged Portland, and any of our ICE Facilities under siege from attack by Antifa, and other domestic …",
    "link": "https://freerepublic.com/focus/f-bloggers/4342970/posts",
    "timestamp": "2025-09-27T14:41:14Z"
  },
  {
    "title": "South Korean diplomat says nation asked Trump to play ‘peacemaker’ with North Korea",
    "description": "Trump “welcomed” the request from President Lee Jae Myung and “he expressed his willingness to be engaged with North Korea again,” Foreign Minister Cho Hyun said.",
    "link": "https://apnews.com/article/un-south-korea-us-kim-trump-north-17aa241855cb473ad037d63dbeb90306",
    "timestamp": "2025-09-27T14:38:51Z"
  },
  {
    "title": "Slovakia Resists Trump’s Push to Quickly Quit Russian Oil",
    "description": "Slovakia has no plans to quickly abandon Russian oil supplies, President Peter Pellegrini told US President Donald Trump during talks in New York this week.",
    "link": "https://financialpost.com/pmn/business-pmn/slovakia-resists-trumps-push-to-quickly-quit-russian-oil",
    "timestamp": "2025-09-27T14:37:58Z"
  },
  {
    "title": "Philadelphia DA goes into tirade about 'fascist' Trump, 'Hitler' when confronted at park in viral video",
    "description": "A viral video shows Philadelphia District Attorney Larry Krasner clashing with young GOP activist Frank Scales before launching into an anti-Trump tirade.",
    "link": "https://www.foxnews.com/politics/philadelphia-da-goes-tirade-about-fascist-trump-hitler-when-confronted-park-viral-video",
    "timestamp": "2025-09-27T14:35:24Z"
  },
  {
    "title": "James Gunn Reveals Whether He Wrote PEACEMAKER Season 2's Alternate Earth With Real-Life Politics In Mind",
    "description": "With many fans making comparisons between Peacemaker season 2's parallel Earth and the current political situation in the United States, James Gunn has set the record straight on whether that was intended.",
    "link": "https://comicbookmovie.com/tv/dc/peacemaker/james-gunn-reveals-whether-he-wrote-peacemaker-season-2s-alternate-earth-with-real-life-politics-in-mind-a224015",
    "timestamp": "2025-09-27T14:35:04Z"
  },
  {
    "title": "‘What if they’re right?’ CEOs sound alarm on jobs crisis ‘unfolding in plain sight'",
    "description": "Nearly two-dozen CEOs of major companies are sounding the alarm on what could potentially be an impending job crisis, an Axios report\r\n published Saturday found.Axios co-founder and CEO Jim VandeHei found that of the 20 CEOs they spoke to last week, every sin…",
    "link": "https://www.rawstory.com/ai-2674047444/",
    "timestamp": "2025-09-27T14:32:32Z"
  },
  {
    "title": "DOJ asks Supreme Court to rule on plan to end birthright citizenship",
    "description": "The Justice Department wants the justices to decide whether Trump's proposal seeking to reinterpret the Constitution's 14th Amendment is lawful.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/27/doj-supreme-court-trump-end-birthright-citizenship/86390461007/",
    "timestamp": "2025-09-27T14:31:11Z"
  },
  {
    "title": "What If We Took Democracy Seriously?",
    "description": "In our Fall Books issue, Osita Nwanevu reviewed Sam Tanenhaus’s doorstopper Buckley, a biography of the conservative intellectual and bon vivant remembered fondly—too fondly, Nwanevu argues—by many people appalled at the current state of argument in America. …",
    "link": "http://www.nybooks.com/online/2025/09/27/what-if-we-took-democracy-seriously-osita-nwanevu/",
    "timestamp": "2025-09-27T14:30:00Z"
  },
  {
    "title": "Trump’s Top Anti-Tylenol Expert Was Paid to Hate Tylenol, Records Show",
    "description": "\"Legitimizing bad science with dangerous policy endangers you when your decisions are based on fear, not facts.\"\nThe post Trump’s Top Anti-Tylenol Expert Was Paid to Hate Tylenol, Records Show appeared first on Futurism.",
    "link": "https://futurism.com/health-medicine/trump-top-anti-tylenol-expert-paid",
    "timestamp": "2025-09-27T14:30:00Z"
  },
  {
    "title": "This Just Happened: RFK Jr. Just Hired the Man Who Helped Build the Anti-Vax Movement...and What That Means for Public Health",
    "description": "This Just Happened: RFK Jr. Just Hired the Man Who Helped Build the Anti-Vax Movement…and What That Means for Public Health. An explosive, no-BS deep dive",
    "link": "https://www.newsbreak.com/share/4259401488205-this-just-happened-rfk-jr-just-hired-the-man-who-helped-build-the-anti-vax-movement-and-what-that-means-for-public-health?_f=app_share&amp;pd=05WApuMu&amp;lang=en_US&amp;send_time=1758983069&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.38.1.4%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3&amp;s=i2",
    "timestamp": "2025-09-27T14:27:27Z"
  },
  {
    "title": "Trump and Erika Kirk's Hug Gets Awkward When She Won't Let Go",
    "description": "Trump and Erika Kirk's Hug Gets Awkward When She Won't Let Gocafemom.com",
    "link": "https://cafemom.com/entertainment/trump-and-erika-kirks-awkward-hug-is-made-worse-when-she-wont-let-go",
    "timestamp": "2025-09-27T14:26:29Z"
  },
  {
    "title": "No, Seriously, Did Trump Get More Orange?",
    "description": "\"You'd think with all that money they could put some orange on his ears too.\"",
    "link": "https://cafemom.com/entertainment/no-seriously-did-trump-get-more-orange",
    "timestamp": "2025-09-27T14:26:29Z"
  },
  {
    "title": "Hegseth's 'chaotic decisions' are creating concerns about  US 'instability': analyst",
    "description": "Defense Secretary Pete Hegseth’s decision to gather together several hundred senior U.S. generals and admirals at the Marine base Quantico, Virginia next week is raising eyebrows at home and abroad.In a column for MSNBC, Claire McCaskill, the former Missouri …",
    "link": "https://www.rawstory.com/hegseth-meeting/",
    "timestamp": "2025-09-27T14:25:40Z"
  },
  {
    "title": "Trump Claims Many Companies Moving to US to Avoid Tariffs",
    "description": "President Donald Trump announced a fresh round of tariffs on pharmaceuticals, heavy trucks and furniture, including a 100% duty on patented drugs unless the producer is building a manufacturing plant in the US.\n“Starting October 1st, 2025, we will be imposing…",
    "link": "https://biztoc.com/x/19e049bcfaa1168e",
    "timestamp": "2025-09-27T14:21:46Z"
  },
  {
    "title": "“Deranged Leftist” Physically Assaults Trump Admin Official in Bathroom at United Nations",
    "description": "An unhinged leftist assaulted a Trump Administration official this week in a bathroom at the United Nations.\nThe post “Deranged Leftist” Physically Assaults Trump Admin Official in Bathroom at United Nations appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/09/deranged-leftist-physically-assaults-trump-admin-official-bathroom/",
    "timestamp": "2025-09-27T14:20:10Z"
  },
  {
    "title": "The real cost of Trump's $100,000 visas (Vox)",
    "description": "Vox:\nThe real cost of Trump's $100,000 visas  —  ﻿This program is likely to hurt American workers — and the whole economy. … With one declaration, President Donald Trump upended an aspect of our immigration system.  —  Last week, Trump announced that the US w…",
    "link": "https://www.memeorandum.com/250927/p27",
    "timestamp": "2025-09-27T14:20:00Z"
  },
  {
    "title": "Trump administration asks U.S. Supreme Court to uphold order aimed at ending birthright citizenship",
    "description": "U.S. President Donald Trump's administration is asking the Supreme Court to uphold his birthright citizenship order declaring that children born to parents who are in the United States illegally or temporarily are not American citizens.",
    "link": "https://www.cbc.ca/news/world/trump-supreme-court-birthright-citizenship-fight-1.7645596",
    "timestamp": "2025-09-27T14:19:43Z"
  },
  {
    "title": "'The View' co-host says Trump would win by same margins if election held today",
    "description": "\"The View\" co-hosts debated whether Donald Trump would win if an election were held today, with Alyssa Farah Griffin arguing the GOP leads on key issues.",
    "link": "https://www.foxnews.com/media/the-view-co-host-says-trump-would-win-same-margins-election-held-today",
    "timestamp": "2025-09-27T14:19:01Z"
  },
  {
    "title": "Israel kills dozens in Gaza as Netanyahu defies ceasefire pressure",
    "description": "Humanitarian charity Doctors Without Borders suspended its services in Gaza City after Israeli forces encircled its clinics.",
    "link": "https://www.politico.eu/article/israel-kills-dozens-in-gaza-as-benjamin-netanyahu-defies-ceasefire-pressure/",
    "timestamp": "2025-09-27T14:18:44Z"
  },
  {
    "title": "Jim Cramer sends harsh warning on Eric Trump-backed stock",
    "description": "Popular CNBC host Jim Cramer shares his opinion American Bitcoin and IREN stocks.",
    "link": "https://www.thestreet.com/crypto/investing/jim-cramer-sends-harsh-warning-on-eric-trump-backed-stock",
    "timestamp": "2025-09-27T14:16:49Z"
  },
  {
    "title": "Pam Bondi Claims ‘Weaponization Has Ended’ As She Lists Trump Opponents She Will Crush In Same Breath",
    "description": "Pam Bondi told Hannity \"weaponization has ended\" — in the same breath as she listed Trump opponents she intends to target for investigation.\nThe post Pam Bondi Claims ‘Weaponization Has Ended’ As She Lists Trump Opponents She Will Crush In Same Breath first a…",
    "link": "https://www.mediaite.com/media/news/pam-bondi-claims-weaponization-has-ended-as-she-lists-trump-opponents-she-will-crush-in-same-breath/",
    "timestamp": "2025-09-27T14:13:32Z"
  },
  {
    "title": "Voltaire, International Newsletter N°144",
    "description": "Our director of publication and editor-in-chief directed French magazines several years ago, and has won journalism awards abroad. He has regularly contributed to some fifteen major dailies and magazines around the world. Voltaire, International Newsletter is…",
    "link": "https://www.voltairenet.org/article222867.html",
    "timestamp": "2025-09-27T14:12:53Z"
  },
  {
    "title": "The psychological roots of “assassination culture” are a mix of ideological radicalism and feelings of powerlessness",
    "description": "The Network Contagion Research Institute (NCRI) describes itself as “a nonpartisan research institute leading the field of cybersocial science.” Back in April, Fox News described NCRI’s then-new piece as a disturbing new report that revealed that violent poli…",
    "link": "https://www.isegoria.net/2025/09/the-psychological-roots-of-assassination-culture-are-a-mix-of-ideological-radicalism-and-feelings-of-powerlessness/",
    "timestamp": "2025-09-27T14:12:11Z"
  },
  {
    "title": "Trump and his lickspittles will say anything — which makes them dangerous as hell",
    "description": "I want to pick up on a point I made yesterday, about how the president and his co-conspirators, inside and outside the regime, do not mean what they say\r\n. They do not care about the truth behind their words, only whether those words can achieve a desired out…",
    "link": "https://www.rawstory.com/raw-investigates/kristi-noem-2674039715/",
    "timestamp": "2025-09-27T14:03:04Z"
  },
  {
    "title": "Trump asks Supreme Court to uphold restrictions he wants to impose on birthright citizenship (Associated Press)",
    "description": "Associated Press:\nTrump asks Supreme Court to uphold restrictions he wants to impose on birthright citizenship  —  President Donald Trump 's administration is asking the Supreme Court to uphold his birthright citizenship order declaring that children born to …",
    "link": "https://www.memeorandum.com/250927/p20",
    "timestamp": "2025-09-27T14:00:01Z"
  },
  {
    "title": "State of Crypto: Shutdown Watch",
    "description": "A U.S. government shutdown won't be as bad for crypto as it might have been in previous years, but it will further delay already-stalled initiatives.",
    "link": "https://www.coindesk.com/news-analysis/2025/09/27/state-of-crypto-shutdown-watch",
    "timestamp": "2025-09-27T14:00:00Z"
  },
  {
    "title": "Netanyahu faces his biggest challenge yet in Washington as pressure builds to end the Gaza genocide",
    "description": "As Donald Trump touts his “21-Point Plan” to end the war in Gaza, Benjamin Netanyahu aims to convince the White House to support the ongoing genocide and possible Israeli annexation of the West Bank. Can he persuade Trump?",
    "link": "https://mondoweiss.net/2025/09/netanyahu-faces-his-biggest-challenge-yet-in-washington-as-pressure-builds-to-end-the-gaza-genocide/",
    "timestamp": "2025-09-27T14:00:00Z"
  },
  {
    "title": "Democratic Party Isolation Is Getting Worse",
    "description": "We Americans, it seems, continue to live in two separate countries. Consider two items in the news this week and the inconsistent responses they evoked.... Read More\nThe post Democratic Party Isolation Is Getting Worse appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/09/27/democratic-party-isolation-is-getting-worse/",
    "timestamp": "2025-09-27T14:00:00Z"
  },
  {
    "title": "After Kimmel: Why Right Won't Stop At Boycott Attempts",
    "description": "Don't be tricked by the Trumpian moment  — what's happening now is just the latest move in a very long and ongoing right-wing game.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/jimmy-kimmel-boycott-trump-history-christian-right-1236387103/",
    "timestamp": "2025-09-27T13:59:39Z"
  },
  {
    "title": "Anti-Trans Policy Deserves Same Scrutiny as Trump’s Tylenol Disinformation",
    "description": "As a trans journalist, I see corporate media outlets as inconsistent in their treatment of right-wing disinformation.",
    "link": "https://truthout.org/articles/anti-trans-policy-deserves-same-scrutiny-as-trumps-tylenol-disinformation/",
    "timestamp": "2025-09-27T13:55:01Z"
  },
  {
    "title": "I Am on Kirk’s “Professor Watchlist.” I Know How It Destroys Civil Debate.",
    "description": "I deeply value free speech and debate. The watchlist created by Charlie Kirk’s Turning Point USA is anathema to both.",
    "link": "https://truthout.org/articles/i-am-on-kirks-professor-watchlist-i-know-how-it-destroys-civil-debate/",
    "timestamp": "2025-09-27T13:53:40Z"
  },
  {
    "title": "How ‘terror haven’ Pakistan used India to get closer to the US",
    "description": "Islamabad has provided Donald Trump with the validation he sought, especially after New Delhi repeatedly rejected Trump’s claim of brokering a ceasefire in the recent Indo-Pak military conflict",
    "link": "https://timesofindia.indiatimes.com/toi-plus/international/how-terror-haven-pakistan-used-india-to-get-closer-to-the-us/articleshow/124182678.cms",
    "timestamp": "2025-09-27T13:51:20Z"
  },
  {
    "title": "Federal Agents Amass in Portland, Local Officials Say (Willamette Week)",
    "description": "Willamette Week:\nFederal Agents Amass in Portland, Local Officials Say  —  Portland-area officials repeated a single instruction to residents: Don't take the bait.  —  President Donald Trump has dispatched federal agents to Portland, local elected officials s…",
    "link": "https://www.memeorandum.com/250927/p19",
    "timestamp": "2025-09-27T13:50:02Z"
  },
  {
    "title": "South Korea cannot pay US$350 billion to US for tariff deal as Trump suggests, top aide says",
    "description": "SEOUL: South Korea is unable to pay US$350 billion upfront in investment in the United States as President Donald Trump suggested under a deal to cut tariffs and is seeking an alternative solution, Seoul's presidential adviser said on Saturday (Sep 27).Since …",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-us-trump-tariff-deal-pay-350-billion-5373276",
    "timestamp": "2025-09-27T13:45:41Z"
  },
  {
    "title": "Cost of AGI Delusion:Chasing Superintelligence US Falling Behind in Real AI Race",
    "description": "By chasing superintelligence, America is falling behind in the real AI race.",
    "link": "https://www.foreignaffairs.com/united-states/cost-delusion-artificial-general-intelligence",
    "timestamp": "2025-09-27T13:44:49Z"
  },
  {
    "title": "Trump asks Supreme Court to uphold restrictions he wants to impose on birthright citizenship",
    "description": "President Donald Trump’s administration is asking the Supreme Court to uphold his birthright citizenship order declaring that children born to parents who are in the United States illegally or temporarily aren't American citizens",
    "link": "https://abcnews.go.com/US/wireStory/trump-asks-supreme-court-uphold-restrictions-impose-birthright-125994925",
    "timestamp": "2025-09-27T13:42:26Z"
  },
  {
    "title": "Russia’s ex-President Dmitry Medvedev warns Trump again - ‘Bomb shelters won’t save you from nukes’",
    "description": "Dmitry Medvedev, Russia's former president, issued a stark warning to the United States. He suggested bomb shelters would not protect Americans from Russia's powerful weapons. This came after Ukrainian President Zelenskyy told Russian officials to prepare bom…",
    "link": "https://economictimes.indiatimes.com/news/international/us/russias-ex-president-dmitry-medvedev-warns-trump-again-bomb-shelters-wont-save-you-from-nukes/articleshow/124182899.cms",
    "timestamp": "2025-09-27T13:42:19Z"
  },
  {
    "title": "U.S. Revokes Visa For Colombia's President After He Urges American Soldiers To Disobey Trump",
    "description": "The department said on social media that “we will revoke Petro’s visa due to his reckless and incendiary actions.”",
    "link": "https://www.huffpost.com/entry/united-states-revokes-visa-for-colombias-president-after-he-urges-american-soldiers-to-disobey-trump_n_68d7e7e4e4b085d511c6e2d9",
    "timestamp": "2025-09-27T13:42:15Z"
  },
  {
    "title": "'The View' Panel Gets Triggered Hearing Trump Would Win 'By Bigger Margin' If the 2024 Election Were Today",
    "description": "The entire panel of \"The View\" was visibly upset after hearing one of their own explain how the 2024 election would go if held today.",
    "link": "https://www.westernjournal.com/view-co-host-triggers-panel-saying-trump-win-bigger-margin-2024-election-held-now/",
    "timestamp": "2025-09-27T13:40:44Z"
  },
  {
    "title": "Why this US government shutdown fight could be the ugliest yet, and what’s really at stake",
    "description": "US government shutdown 2025: Washington is bracing for a likely government shutdown on October 1, as both Republicans and Democrats appear prepared for the standoff. Trump's White House has even planned for \"mass firings,\" while Democrats view a shutdown as c…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-this-us-government-shutdown-fight-could-be-the-ugliest-yet-and-whats-really-at-stake/articleshow/124182607.cms",
    "timestamp": "2025-09-27T13:39:22Z"
  },
  {
    "title": "Thai And Cambodian Troops Clash In Threat To Trump-Backed Ceasefire",
    "description": "Troops from Thailand and Cambodia have engaged in the first clashes since a ceasefire between the neighbors that was backed by President Donald Trump only weeks ago.\nThai and Cambodian troops exchanged fire and launched grenades in northeastern Thailand less …",
    "link": "https://biztoc.com/x/173f757e906bdfe2",
    "timestamp": "2025-09-27T13:38:06Z"
  },
  {
    "title": "Jake Tapper Guffaws As CNN Analyst Roasts Trump For Torpedoing Comey Case With Rants",
    "description": "Jake Tapper couldn't suppress a laugh when CNN's Evan Perez roasted President Donald Trump over rants that may be torpedoing the case against Comey.\nThe post Jake Tapper Guffaws As CNN Analyst Roasts Trump For Torpedoing Comey Case With Rants first appeared o…",
    "link": "https://www.mediaite.com/media/tv/jake-tapper-guffaws-as-cnn-analyst-roasts-trump-for-torpedoing-comey-case-with-rants/",
    "timestamp": "2025-09-27T13:36:28Z"
  },
  {
    "title": "Trump’s trade battle with China puts US soybean farmers in peril",
    "description": "“This is a five-alarm fire for our industry,” said the head of the American Soybean Association trade group.",
    "link": "https://www.twincities.com/2025/09/26/trumps-trade-battle-with-china-puts-us-soybean-farmers-in-peril/",
    "timestamp": "2025-09-27T13:35:14Z"
  },
  {
    "title": "Bill Maher Warns of Trump’s “Rise of Autocracy” After James Comey Indictment",
    "description": "\"I think Trump could be in the general’s uniform by Christmas.”",
    "link": "https://decider.com/2025/09/27/bill-maher-trump-james-comey-indictment/",
    "timestamp": "2025-09-27T13:33:14Z"
  },
  {
    "title": "The resilient stock market may be keeping the economy out of a recession",
    "description": "Consumers with larger stock holdings are feeling fine, while those with smaller or no holdings are not.",
    "link": "https://www.cnbc.com/2025/09/27/wealth-effect-stock-market-recession.html",
    "timestamp": "2025-09-27T13:31:14Z"
  },
  {
    "title": "Want To Invest In a Trump Account for Your Kid? Suze Orman Would Rather See You Do This",
    "description": "President Donald Trump’s One Big Beautiful Bill set the stage for Trump accounts for kids. Every qualifying child born after Dec. 31, 2024, and before Jan. 1, 2029, is eligible for a free $1,000 Trump account.\nParents have the option to contribute up to $5,00…",
    "link": "https://biztoc.com/x/b57ef2a028afa717",
    "timestamp": "2025-09-27T13:30:15Z"
  },
  {
    "title": "This Just Happened: RFK Jr. Just Hired the Man Who Helped Build the Anti-Vax Movement...and What That Means for Public Health",
    "description": "This Just Happened: RFK Jr. Just Hired the Man Who Helped Build the Anti-Vax Movement…and What That Means for Public Health. An explosive, no-BS deep dive",
    "link": "https://www.newsbreak.com/share/4259401488205-this-just-happened-rfk-jr-just-hired-the-man-who-helped-build-the-anti-vax-movement-and-what-that-means-for-public-health?s=a2&amp;share_destination_id=MTkwNTk5MjIwLTE3NTg5Nzk3NTcwNTA%3D&amp;pd=0CtjYyMv&amp;hl=en_US&amp;send_time=1758979757&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.38.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_android_comment_share_v3-v2%2Csc_play_button_v1-v2",
    "timestamp": "2025-09-27T13:30:15Z"
  },
  {
    "title": "Trump asks Supreme Court to uphold restrictions on birthright citizenship",
    "description": "Every lower court has concluded Trump’s order likely violates the 14th Amendment, intended to ensure that Black people, including former slaves, had citizenship.",
    "link": "https://www.kcra.com/article/trump-birthright-citizenship-supreme-court-appeal/68089837",
    "timestamp": "2025-09-27T13:26:13Z"
  },
  {
    "title": "Wisconsin Republican Bill Berrien quits governor's race amid fallout over sexually explicit links (Scott Bauer/Associated Press)",
    "description": "Scott Bauer / Associated Press:\nWisconsin Republican Bill Berrien quits governor's race amid fallout over sexually explicit links  —  Wisconsin business owner Bill Berrien, a supporter of President Donald Trump, ended his Republican campaign for governor on F…",
    "link": "https://www.memeorandum.com/250927/p18",
    "timestamp": "2025-09-27T13:25:00Z"
  },
  {
    "title": "Amazon leads H-1B visa approvals in early 2025; TCS, Microsoft, Meta close behind",
    "description": "Amazon received the highest number of H-1B visa approvals in the first half of 2025, with 10,044 approvals by June 30, according to USCIS. Tech companies are the main users of the programme. TCS came second, followed by Microsoft, Meta, Apple, and Google with…",
    "link": "https://economictimes.indiatimes.com/tech/technology/amazon-leads-h-1b-visa-approvals-in-early-2025-tcs-microsoft-meta-close-behind/articleshow/124182638.cms",
    "timestamp": "2025-09-27T13:22:07Z"
  },
  {
    "title": "Nicolas Sarkozy jailing reignites debate over French political justice ahead of Le Pen appeal",
    "description": "Nicolas Sarkozy received a prison sentence for conspiracy. This ruling creates division in France regarding judges' actions on wrongdoing. It comes before Marine Le Pen's attempt to overturn her conviction. Judges increasingly enforce sentences without delay.…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/nicolas-sarkozy-jailing-reignites-debate-over-french-political-justice-ahead-of-le-pen-appeal/articleshow/124182686.cms",
    "timestamp": "2025-09-27T13:19:04Z"
  },
  {
    "title": "Albanese meets with King Charles at Balmoral",
    "description": "King Charles III has received Prime Minister Anthony Albanese in a royal audience held at Balmoral Castle in Scotland.",
    "link": "https://www.abc.net.au/news/2025-09-27/anthony-albanese-meets-king-charles-balmoral-castle/105825036",
    "timestamp": "2025-09-27T13:15:23Z"
  },
  {
    "title": "US: Colombian President's comments ‘reckless and incendiary’",
    "description": "The US says it will revoke the visa of Colombia's President Gustavo Petro, accusing him of inciting violence by encouraging American soldiers to disobey orders. When addressing a pro-Palestinian protest in New York, he suggested they should ignore the orders …",
    "link": "https://www.bbc.co.uk/programmes/w172zss8x4bbzzq",
    "timestamp": "2025-09-27T13:13:00Z"
  },
  {
    "title": "Want To Invest In a Trump Account for Your Kid? Suze Orman Would Rather See You Do This",
    "description": "Trump Accounts offer $1,000 for eligible kids, but Suze Orman urged caution. Unclear tax rules may make Roth IRAs or brokerage accounts smarter picks.",
    "link": "https://finance.yahoo.com/news/want-invest-trump-account-kid-131204202.html",
    "timestamp": "2025-09-27T13:12:04Z"
  },
  {
    "title": "This Just Happened: RFK Jr. Just Hired the Man Who Helped Build the Anti-Vax Movement...and What That Means for Public Health",
    "description": "This Just Happened: RFK Jr. Just Hired the Man Who Helped Build the Anti-Vax Movement…and What That Means for Public Health. An explosive, no-BS deep dive",
    "link": "https://www.newsbreak.com/share/4259401488205-this-just-happened-rfk-jr-just-hired-the-man-who-helped-build-the-anti-vax-movement-and-what-that-means-for-public-health?_f=app_share&amp;pd=04jUeKTH&amp;lang=en_US&amp;send_time=1758978197&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.38.1.4%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1&amp;s=i2",
    "timestamp": "2025-09-27T13:03:44Z"
  },
  {
    "title": "Trump Asks Supreme Court To Uphold Restrictions He Wants To Impose On Birthright Citizenship",
    "description": "The Justice Department's petition has been shared with lawyers for parties challenging the order, but is not yet docketed at the Supreme Court.",
    "link": "https://www.huffpost.com/entry/trump-asks-supreme-court-to-uphold-restrictions-he-wants-to-impose-on-birthright-citizenship_n_68d7df1ae4b0f354d3d23e11",
    "timestamp": "2025-09-27T13:02:29Z"
  },
  {
    "title": "Donald Trump Just Blamed Another Tragedy On The \"Radical Left,\" And The Internet Is Not Having It",
    "description": "\"I’m the president of all the people,\" Trump said.",
    "link": "https://www.buzzfeed.com/leemoran/donald-trump-right-tougher-left",
    "timestamp": "2025-09-27T13:01:03Z"
  },
  {
    "title": "Trump caps week with Ryder Cup appearance after UN speech, Zelenskyy meeting",
    "description": "President Donald Trump delivered remarks at the United Nations General Assembly this week and attended the 2025 Ryder Cup golf competition in Farmingdale, New York.",
    "link": "https://www.foxnews.com/politics/trump-caps-week-ryder-cup-appearance-after-un-speech-zelenskyy-meeting",
    "timestamp": "2025-09-27T13:00:58Z"
  },
  {
    "title": "Northwest Native Nations could lose hundreds of millions in federal funding, report says",
    "description": "A new report from Portland State University found that budget cuts under President Donald Trump’s new spending bill threaten nearly half of federal funding...",
    "link": "https://oregoncapitalchronicle.com/2025/09/27/northwest-native-nations-could-lose-hundreds-of-millions-in-federal-funding-report-says/",
    "timestamp": "2025-09-27T13:00:52Z"
  },
  {
    "title": "'One Battle After Another' Review: Leonardo DiCaprio goes for laughs in politically-charged wild ride",
    "description": "Fox News Digital reviews Paul Thomas Anderson's politically-charged action thriller \"One Battle After Another\" starring Leonardo DiCaprio and Sean Penn.",
    "link": "https://www.foxnews.com/opinion/one-battle-after-another-review-leonardo-dicaprio-goes-laughs-politically-charged-wild-ride",
    "timestamp": "2025-09-27T13:00:48Z"
  },
  {
    "title": "The art of the steal: Trump’s TikTok deal is not what it seems",
    "description": "If successful, the transaction will cement Silicon Valley's right-wing shift",
    "link": "https://www.salon.com/2025/09/27/the-art-of-the-steal-trumps-tiktok-deal-is-not-what-it-seems/",
    "timestamp": "2025-09-27T13:00:27Z"
  },
  {
    "title": "Fed Chair Choice May Be Bitcoin’s Biggest Bull Trigger, CEO Says",
    "description": "Galaxy Digital chief executive Mike Novogratz said a very dovish choice to lead the Federal Reserve could push Bitcoin into a major rally, even as he warned such a shift would carry serious costs for the US. Related Reading: Bitcoin Miner TeraWulf Targets $3 …",
    "link": "https://bitcoinist.com/fed-chair-choice-may-be-bitcoins-biggest-bull-trigger-ceo-says/",
    "timestamp": "2025-09-27T13:00:10Z"
  },
  {
    "title": "After Trump cut the National Science Foundation by 56 percent, a venerable Arctic research center closes its doors",
    "description": "The Arctic Research Consortium of the United States funded programs that aided Indigenous communities and tracked melting sea ice, among dozens of initiatives.",
    "link": "https://insideclimatenews.org/news/19092025/after-trump-cut-the-national-science-foundation-by-56-percent-a-venerable-arctic-research-center-closes-its-doors/",
    "timestamp": "2025-09-27T13:00:00Z"
  },
  {
    "title": "You’re Comparing Trump to the Wrong Fascist Dictator",
    "description": "The “Is Trump Hitler?” debate misses his sinister parallels to another 20th-century European tyrant.",
    "link": "https://slate.com/news-and-politics/2025/09/trump-hitler-comparisons-francisco-franco-fascism.html",
    "timestamp": "2025-09-27T13:00:00Z"
  },
  {
    "title": "Green Meltdown: Trump’s Second Term Breaks the Back of Climate Activism",
    "description": "President Trump called climate change the “greatest con job ever perpetrated on the world” at the UN.",
    "link": "https://wattsupwiththat.com/2025/09/27/green-meltdown-trumps-second-term-breaks-the-back-of-climate-activism/",
    "timestamp": "2025-09-27T13:00:00Z"
  },
  {
    "title": "Which was discovered first, autism or Tylenol? What to know",
    "description": "The condition that became known as autism was described before the Tylenol brand was created. Autism's history dates back further than the drug's.",
    "link": "https://www.snopes.com//fact-check/autism-older-than-tylenol/",
    "timestamp": "2025-09-27T13:00:00Z"
  },
  {
    "title": "US Stock Rally Cools as October Turbulence, Earnings Season Loom",
    "description": "President Donald Trump just reminded investors that his favorite economic policy tool remains sharpened, slapping levies on imported furniture, brand-name...",
    "link": "https://finance.yahoo.com/news/us-stock-rally-cools-october-130000253.html",
    "timestamp": "2025-09-27T13:00:00Z"
  },
  {
    "title": "‘Such ridiculous numbers’: Economists shred Trump’s ‘fuzzy math’ on big promises",
    "description": "Multiple economists laid into President Donald Trump Saturday for his “fuzzy math\r\n” cited alongside his many lofty promises or supposed achievements, including one who called Trump’s cited figures “meaningless.”Speaking with Axios in a report\r\n published Sat…",
    "link": "https://www.rawstory.com/trump-2674047308/",
    "timestamp": "2025-09-27T12:58:22Z"
  },
  {
    "title": "Ex-NFL star Charles Tillman cites Trump's immigration crackdown as reason why he quit FBI",
    "description": "Former Chicago Bears star Charles Tillman in a recent podcast interview cited President Donald Trump's immigration policies as why he quit the FBI.",
    "link": "https://www.foxnews.com/sports/ex-nfl-star-charles-tillman-cites-trumps-immigration-crackdown-reason-why-he-quit-fbi",
    "timestamp": "2025-09-27T12:53:41Z"
  },
  {
    "title": "Kamala Harris’ Alternate Reality Book Tour",
    "description": "The KHive fan club showed up in force to cheer on a defeated presidential candidate who, in their eyes, could do no wrong. NEW YORK — Many Democrats are still mired in a state of low-level depression after Kamala Harris’ devastating defeat in the 2024 electio…",
    "link": "https://freerepublic.com/focus/f-chat/4342963/posts",
    "timestamp": "2025-09-27T12:51:14Z"
  },
  {
    "title": "'Can't afford to pay': Health insurance premiums may double in largest market next week - NewsBreak",
    "description": "Americans in the largest health insurance market could see their premiums double in price virtually overnight, depending on what Congress does over the nex",
    "link": "https://www.newsbreak.com/share/4259107033350-can-t-afford-to-pay-health-insurance-premiums-may-double-in-largest-market-next-week?s=a2&amp;share_destination_id=MjkyMzc4OTkwLTE3NTg5NzczNTgxMjQ%3D&amp;pd=0Jmn8Any&amp;hl=en_US&amp;send_time=1758977358&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-09-27T12:49:51Z"
  },
  {
    "title": "Who is Lisa Monaco, Microsoft's president of global affairs Trump wants fired?",
    "description": "Donald Trump urged Microsoft to fire Lisa Monaco, its president of global affairs and a former Biden aide. He claims her access to sensitive information at Microsoft, given its government contracts, makes her a national security threat. This demand follows hi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-lisa-monaco-microsofts-president-of-global-affairs-trump-wants-fired/articleshow/124182169.cms",
    "timestamp": "2025-09-27T12:47:01Z"
  },
  {
    "title": "Linda McMahon is dismantling the Education Department — but first she’ll help make school ‘patriotic’ again | CNN Politics",
    "description": "Linda McMahon, the US education secretary, has a uniquely fateful task: President Donald Trump wants her to be the last person ever to run the agency, an entity he’s long sought to dismantle.",
    "link": "https://www.cnn.com/2025/09/27/politics/linda-mcmahon-department-of-education-patriotic-civics",
    "timestamp": "2025-09-27T12:45:53Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to CaturSaturday, September 27, 2025: shabbos for good Jewish cats as well as International Rabbit Day. Now I know that this painting (“Young Hare” by Albrecht Dürer, 1502) is a hare, not a rabbit, so don’t come after me. It’s close enough, and it’s b…",
    "link": "https://whyevolutionistrue.com/2025/09/27/saturday-hili-dialogue-551/",
    "timestamp": "2025-09-27T12:45:06Z"
  },
  {
    "title": "FBI fires agents pictured kneeling at George Floyd protest, US media reports",
    "description": "The FBI Agents Association says the terminations - not yet confirmed by the bureau - violate the agents' rights.",
    "link": "https://www.bbc.com/news/articles/cr4q5xrz9dpo",
    "timestamp": "2025-09-27T12:44:12Z"
  },
  {
    "title": "Unionbusting and the War on History",
    "description": "This story about the Chicago History Museum slashing workers hours and public services in order to unionbust suggests a lot about why our elites–whatever their political affiliation–are fundamentally pro-Trumpist and acquiesce on everything. Because they want…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/unionbusting-and-the-war-on-history",
    "timestamp": "2025-09-27T12:40:00Z"
  },
  {
    "title": "Dem Candidate Laughs At Charlie Kirk's Murder, Mocks MAGA for Mourning Him",
    "description": "A Democratic Party candidate posted a TikTok video mocking the death of Charlie Kirk and mocking his supporters.",
    "link": "https://www.westernjournal.com/dem-candidate-laughs-charlie-kirks-murder-mocks-maga-mourning/",
    "timestamp": "2025-09-27T12:39:17Z"
  },
  {
    "title": "Trump Attacks Comey In New Rant Amid ‘Malicious Prosecution’ Accusations",
    "description": "President Donald Trump attacked James Comey. in a new social media rant amid accusations such attacks strengthen Comey's case against the indictment he faces.\nThe post Trump Attacks Comey In New Rant Amid ‘Malicious Prosecution’ Accusations first appeared on …",
    "link": "https://www.mediaite.com/online/trump-attacks-comey-in-new-rant-amid-malicious-prosecution-accusations/",
    "timestamp": "2025-09-27T12:38:35Z"
  },
  {
    "title": "NexStar CEO Defends Choice to Pull ‘Jimmy Kimmel Live!’",
    "description": "On September 17, two of ABC’s largest affiliate broadcasters — NexStar Media and Sinclair Broadcasting — announced that, effective immediately, they would be pulling Jimmy Kimmel Live! off all of its stations. The decision came after Kimmel made some controve…",
    "link": "https://insidethemagic.net/2025/09/nexstar-ceo-defends-choice-to-pull-jimmy-kimmel-ks1/",
    "timestamp": "2025-09-27T12:35:00Z"
  },
  {
    "title": "DOJ Prosecutors to Launch Probes into George Soros Organization For Funding Groups Tied to Domestic Terrorism",
    "description": "The Department of Justice has reportedly directed multiple top federal prosecutors to investigate George Soros’ Open Society Foundations (OSF) over its ties to left-wing violence. Aakash Singh, a senior official in Deputy Attorney General Todd Blanche’s offic…",
    "link": "https://freerepublic.com/focus/f-chat/4342959/posts",
    "timestamp": "2025-09-27T12:31:31Z"
  },
  {
    "title": "Terrifying simulation shows how soldier survived after live grenade was lodged in his chest",
    "description": "The Russian soldier survived after having a live explosive lodged in his chest",
    "link": "https://www.ladbible.com/news/world-news/russian-soldier-live-grenade-chest-survived-operation-911092-20250927",
    "timestamp": "2025-09-27T12:27:36Z"
  },
  {
    "title": "Fani Willis subpoenaed by DOJ over travel records, report says",
    "description": "ATLANTA — Fulton County District Attorney Fani Willis has been subpoenaed by the Department of Justice for records related to her travel history, the New York Times is reporting. It remains unclear at this time the scope of the DOJ investigation into Willis, …",
    "link": "https://freerepublic.com/focus/f-news/4342958/posts",
    "timestamp": "2025-09-27T12:25:53Z"
  },
  {
    "title": "US TikTok deal includes MGX, Abu Dhabi firm with long Trump crypto ties: Report",
    "description": "An Abu Dhabi firm, MGX, invests in TikTok US operations. This company previously partnered with Donald Trump's cryptocurrency venture. MGX paid two billion dollars for stablecoins from Trump's company. This transaction generated personal profit for Trump. MGX…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-tiktok-deal-includes-mgx-abu-dhabi-firm-with-long-trump-crypto-ties-report/articleshow/124182030.cms",
    "timestamp": "2025-09-27T12:24:17Z"
  }
]