[
  {
    "title": "How the U is Celebrating Black History Month",
    "description": "February is Black History Month, and the U will be hosting several events this month to celebrate it.  This year’s theme, as determined by the founding organization of Black History Month, the Association for the Study of African American Life and History, is…",
    "link": "https://dailyutahchronicle.com/2025/02/22/how-the-u-is-celebrating-black-history-month/",
    "timestamp": "2025-02-22T17:46:51Z"
  },
  {
    "title": "Piyush Goyal says Tesla welcome to invest, manufacture in India",
    "description": "Union Minister Piyush Goyal welcomes Tesla and other global companies to invest and manufacture in India. He emphasized mutual benefits and highlighted the government's commitment to reducing pollution through electric vehicles. Addressing US-India relations,…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/piyush-goyal-says-tesla-welcome-to-invest-manufacture-in-india/articleshow/118486584.cms",
    "timestamp": "2025-02-22T17:45:51Z"
  },
  {
    "title": "James Carville Pushes Back On Trump Transgender Attacks In Hannity Interview",
    "description": "Democratic strategist James Carville pushed back on President Donald Trump's relentless attack on transgender people in an interview with Fox News this week.\nThe post James Carville Pushes Back On Trump Transgender Attacks In Hannity Interview first appeared …",
    "link": "https://www.mediaite.com/news/james-carville-pushes-back-on-trump-transgender-attacks-in-hannity-interview/",
    "timestamp": "2025-02-22T17:43:42Z"
  },
  {
    "title": "‘Apprentice’ Director Ali Abbasi Apologizes for ‘Slap on the Rear’ of Actor, Says He Dropped CAA and Management 360 | Exclusive",
    "description": "The director is up for a Spirit Award on Saturday and said he made a mistake but wanted to keep focus on the film\nThe post ‘Apprentice’ Director Ali Abbasi Apologizes for ‘Slap on the Rear’ of Actor, Says He Dropped CAA and Management 360 | Exclusive   appear…",
    "link": "https://www.thewrap.com/apprentice-director-ali-abbasi-apologizes-incident-actor/",
    "timestamp": "2025-02-22T17:43:10Z"
  },
  {
    "title": "Kennedy Center reeling from 'stunning' ticket sales collapse after Trump takeover: report",
    "description": "A decision by Donald Trump to fire everyone and wrest control of the John F. Kennedy Center for the Performing Arts on the banks of the Potomac has led to an alarming downward spiral in ticket sales and artists canceling performances in protest.After returnin…",
    "link": "https://www.rawstory.com/trump-kennedy-center/",
    "timestamp": "2025-02-22T17:38:38Z"
  },
  {
    "title": "Group Donald Trump put in charge of declassifying major secret files make promise to public",
    "description": "Donald Trump has ordered the declassification of documents which include the JFK assassination files",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-jfk-assassination-files-ufo-area-51-167442-20250222",
    "timestamp": "2025-02-22T17:36:37Z"
  },
  {
    "title": "A $33 trillion economy, now it's penniless!",
    "description": "Donald Trump has called for the discontinuation of the U.S. penny due to its high production cost outweighing its face value. This decision aims to address financial inefficiencies, following similar actions by countries like Canada and Australia.",
    "link": "https://m.economictimes.com/opinion/et-commentary/a-33-trillion-economy-now-its-penniless/articleshow/118486234.cms",
    "timestamp": "2025-02-22T17:30:53Z"
  },
  {
    "title": "Keir Starmer 'will defy Donald Trump' over Ukraine and risk huge clash",
    "description": "Sir Keir Starmer will reportedly defy Donald Trump over Ukraine ahead of meeting the US President in the White House next week. The Prime Minister is expected to announce a new package of support for Ukraine on Monday - the third anniversary of Russia’s full-…",
    "link": "https://freerepublic.com/focus/f-news/4299647/posts",
    "timestamp": "2025-02-22T17:16:41Z"
  },
  {
    "title": "Karen Bass Throws Lesbian Fire Chief Under Bus",
    "description": "Turns out it is possible for a DEI hire to get fired after all — provided another DEI beneficiary is desperate for a scapegoat. From Daily Mail: Flailing Los Angeles Mayor Karen Bass brutally fired her female fire chief Friday as she seeks to pass the buck ov…",
    "link": "https://moonbattery.com/karen-bass-throws-lesbian-fire-chief-under-bus/",
    "timestamp": "2025-02-22T17:13:24Z"
  },
  {
    "title": "‘I Didn’t Get An Invite!’ Trump Black Coalition Leader Complains On CNN — While Defending Trump Black History Month Party",
    "description": "Black Americans for Trump Coalition leader Melik Abdul told CNN anchor Abby Phillip \"I didn't get an invite\" to Trump's Black History Month reception\nThe post ‘I Didn’t Get An Invite!’ Trump Black Coalition Leader Complains On CNN — While Defending Trump Blac…",
    "link": "https://www.mediaite.com/news/i-didnt-get-an-invite-trump-black-coalition-chief-complains-on-cnn-while-defending-trump-black-history-month-party/",
    "timestamp": "2025-02-22T17:13:02Z"
  },
  {
    "title": "Is This the End of USPS?",
    "description": "President Donald Trump is taking aim at the US Postal Service.  According to a Thursday report from the Washington Post‘s Jacob Bogage, the president plans to fire the members of USPS’ board and hand the keys to the agency over to the Department of Commerce. …",
    "link": "https://www.motherjones.com/politics/2025/02/trump-dejoy-usps-post-office-privatization/",
    "timestamp": "2025-02-22T17:12:15Z"
  },
  {
    "title": "Who is calling who a Nazi?",
    "description": "The use of Nazi imagery has become so ubiquitous among Democrats that it almost precludes notice. But Illinois Gov. J.B. Pritzker’s parallels between U.S. President Donald Trump’s political agenda and the rise of Nazi Germany during his “State of the State” b…",
    "link": "https://freerepublic.com/focus/f-news/4299645/posts",
    "timestamp": "2025-02-22T17:09:22Z"
  },
  {
    "title": "GOP-led Georgia, Utah legislatures push back on election officials to leave voter data group",
    "description": "The Republican-led state legislatures of Georgia and Utah are considering legislation to leave a voter roll data group, pushing back on their respective GOP state election officials who have advocated for remaining in the coalition. A nonprofit organization c…",
    "link": "https://freerepublic.com/focus/f-news/4299644/posts",
    "timestamp": "2025-02-22T17:05:05Z"
  },
  {
    "title": "Starmer tells Zelenskyy this is 'significant moment' for European security ahead of US visit",
    "description": "Sir Keir Starmer and Volodymyr Zelenskyy said this is a \"significant moment\" for European security amid the continued fallout between the Ukrainian leader and Donald Trump.",
    "link": "https://news.sky.com/story/starmer-tells-zelenskyy-this-is-significant-moment-for-european-security-ahead-of-us-visit-13314922",
    "timestamp": "2025-02-22T17:05:00Z"
  },
  {
    "title": "Anti-Trump Protester Goes On Nazi-Themed Rant on CNN After Arrest At City Council Meeting: ‘Hitler Was Elected Too’",
    "description": "Former NFL punter Chris Kluwe doubled down after his arrest at a city council meeting where he ripped into President Donald Trump and his MAGA movement.\nThe post Anti-Trump Protester Goes On Nazi-Themed Rant on CNN After Arrest At City Council Meeting: ‘Hitle…",
    "link": "https://www.mediaite.com/tv/anti-trump-protester-goes-on-nazi-themed-rant-on-cnn-after-arrest-at-city-council-meeting-hitler-was-elected-too/",
    "timestamp": "2025-02-22T17:02:19Z"
  },
  {
    "title": "Musk Says DOGE Stimulus Checks a Possibility. Will It Actually Happen?",
    "description": "The Tesla CEO says he will \"check\" with President Donald Trump about $5,000 \"dividend\" checks, but you probably shouldn't get your hopes up.",
    "link": "https://www.cnet.com/personal-finance/musk-says-doge-stimulus-checks-a-possibility-will-it-actually-happen/",
    "timestamp": "2025-02-22T17:00:05Z"
  },
  {
    "title": "ANTI-TRUMP RANT GETS STANDING O | TORCHES 'TYRANT'",
    "description": "A town hall in a plus-thirty GOP district erupted in a standing ovation over a blistering rant calling President Trump a \"tyrant\" who \"named himself king.\"",
    "link": "https://www.mediaite.com/news/town-hall-erupts-at-blistering-anti-trump-rant-torching-tyranny-gets-standing-ovation-in-trump-district/",
    "timestamp": "2025-02-22T17:00:03Z"
  },
  {
    "title": "Is Our Five-Year Nightmare Finally Over?",
    "description": "Robert F. Kennedy, Jr.’s confirmation as the Secretary of Health and Human Services in the US is the ultimate repudiation of the Covid policy response.  The scheme of lockdown-until-vaccination was the biggest effort of government and industry on a global sca…",
    "link": "https://www.activistpost.com/covid-policy-response-wealth-transfer-and-power/",
    "timestamp": "2025-02-22T17:00:00Z"
  },
  {
    "title": "David Kirk and Mark Robinson turn from rivals to allies in navigating NZ Rugby’s new era: Gregor Paul",
    "description": "ANALYSIS: Two former All Blacks now sit on the same side of the table.",
    "link": "https://www.nzherald.co.nz/sport/rugby/david-kirk-and-mark-robinson-turn-from-rivals-to-allies-in-navigating-nzrs-new-era-gregor-paul/SBC4LH5YNRAZXMO5IBVB6A2YAY/",
    "timestamp": "2025-02-22T17:00:00Z"
  },
  {
    "title": "Christopher Luxon’s Cabinet congestion: Time to streamline the number of ministerial portfolios - Ryan Bridge",
    "description": "OPINION: Ministers can be responsible for everything and nothing all at the same time.",
    "link": "https://www.nzherald.co.nz/nz/christopher-luxons-cabinet-congestion-time-to-streamline-the-number-of-ministerial-portfolios-ryan-bridge/HGXENUWJVFESDDIAS2ECXSLTUA/",
    "timestamp": "2025-02-22T17:00:00Z"
  },
  {
    "title": "Trump administration reportedly shutting down federal EV chargers nationwide | TechCrunch",
    "description": "The General Services Administration, the agency that manages buildings owned by the federal government, is planning to shut down its entire network of",
    "link": "https://techcrunch.com/2025/02/22/trump-administration-reportedly-shutting-down-federal-ev-chargers-nationwide/",
    "timestamp": "2025-02-22T16:58:44Z"
  },
  {
    "title": "Capehart: Europe Isn't Ripping Us Off on Defense, Just Not Fairly Sharing the Burden",
    "description": "On Friday’s “PBS NewsHour,” Washington Post Associate Editor and MSNBC host Jonathan Capehart stated that it’s incorrect to claim that Europe is ripping off the United States on defense by not spending enough on their defense because they’re not “paying\nThe p…",
    "link": "https://www.breitbart.com/clips/2025/02/22/capehart-europe-isnt-ripping-us-off-on-defense-just-not-fairly-sharing-the-burden/",
    "timestamp": "2025-02-22T16:58:27Z"
  },
  {
    "title": "New Jersey Defies Trump Order, Will Allow Male Athletes to Compete in Female High School Sports",
    "description": "TRENTON, NJ – New Jersey Governor Phil Murphy and his minions are messing around with President Donald J. Trump, and soon, they could be finding out in the form of cuts to federal funding for education. Despite a recent executive order from President Trump ai…",
    "link": "https://freerepublic.com/focus/f-news/4299642/posts",
    "timestamp": "2025-02-22T16:56:35Z"
  },
  {
    "title": "Trump Ousts Leftist Joint Chiefs Of Staff Chair, Other DEI-Pushing Military Officials",
    "description": "'Under President Trump, we are putting in place new leadership that will focus our military on its core mission of deterring, fighting and winning wars.'",
    "link": "https://thefederalist.com/2025/02/22/trump-ousts-leftist-joint-chiefs-of-staff-chair-other-dei-pushing-military-officials/",
    "timestamp": "2025-02-22T16:54:55Z"
  },
  {
    "title": "A former Russian spy claims Donald Trump was recruited by the KGB in the 1980s under the nickname Krasnov",
    "description": "Everything surrounding Donald Trump seems to be straight out of a Hollywood movie. This is the case with the latest information published by a former Soviet spy named Alnur Mussaye",
    "link": "https://www.marca.com/en/lifestyle/us-news/presidential-election/2025/02/22/67b9fc6f46163f9d898b457e.html",
    "timestamp": "2025-02-22T16:48:25Z"
  },
  {
    "title": "Warren Buffett amasses more cash and sells more stock, but doesn’t explain why in annual letter",
    "description": "The mystery over Warren Buffett’s surprisingly defensive stance deepened over the weekend.",
    "link": "https://www.nbcnews.com/business/warren-buffet-berkshire-hathaway-annual-shareholder-letter-rcna193311",
    "timestamp": "2025-02-22T16:46:25Z"
  },
  {
    "title": "“It’s Sad We Have to Do This”: Academic Unions Are Rallying to Defend Science",
    "description": "On Wednesday afternoon in New York City, it hovered around 30 degrees, the sort of cold outside that makes your face sting. Despite the sub-freezing temperatures, hundreds of PhD students, post-doctoral researchers, and other scholars gathered in the West Vil…",
    "link": "https://www.motherjones.com/politics/2025/02/its-sad-we-have-to-do-this-academic-unions-are-rallying-to-defend-science/",
    "timestamp": "2025-02-22T16:39:52Z"
  },
  {
    "title": "Video: NO WAR, NO NATO. Drago Bosnic and Michel Chossudovsky",
    "description": "We are at the cross-roads of a major shift in geopolitics with the prospects of bringing to terms the war in Ukraine. Our message to the peace movement Worldwide across the land is to abolish NATO\nThe post Video: NO WAR, NO NATO. Drago Bosnic and Michel Choss…",
    "link": "https://www.globalresearch.ca/video-no-war-no-nato-drago-bosnic-and-michel-chossudovsky/5880635",
    "timestamp": "2025-02-22T16:39:20Z"
  },
  {
    "title": "CNN Anchors Roast Trump Over ’13 Biggest Lies’ Of First Month",
    "description": "John Berman and Sara Sidner roasted President Donald Trump as fact-checker Daniel Dale went over some of the \"13 biggest lies\" of his first month in office.\nThe post CNN Anchors Roast Trump Over ’13 Biggest Lies’ Of First Month first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/cnn-anchors-roast-trump-over-13-biggest-lies-of-first-month/",
    "timestamp": "2025-02-22T16:38:34Z"
  },
  {
    "title": "Jasmine Crockett Openly Sides Against USA",
    "description": "Angrily anti-Caucasian congresscritter Jasmine Crockett is so clueless, even in the light of the unfolding DOGE revelations she denies “there is a lot of waste, fraud, and abuse in the federal government.” But as Napoleon observed, in politics, stupidity is n…",
    "link": "https://moonbattery.com/jasmine-crockett-openly-sides-against-usa/",
    "timestamp": "2025-02-22T16:34:42Z"
  },
  {
    "title": "Trump ousts top military leader in latest Pentagon upheaval",
    "description": "U.S. President Donald Trump fired Air Force Gen. CQ Brown Jr. as chairman of the Joint Chiefs of Staff on Friday, sidelining a history-making fighter pilot and respected officer as the administration makes sweeping changes to the top military ranks. Brown's p…",
    "link": "https://www.cbc.ca/news/world/trump-pentagon-joint-chiefs-caine-brown-1.7466026",
    "timestamp": "2025-02-22T16:33:49Z"
  },
  {
    "title": "Georgia Congressman Helped GOP F**k Around, Now Is Finding Out",
    "description": "Things got a mite heated at a town hall in his heavily Republican district.",
    "link": "https://www.wonkette.com/p/georgia-congressman-helped-gop-fk",
    "timestamp": "2025-02-22T16:30:56Z"
  },
  {
    "title": "'Gruesome sell-out or a chance to lead': What will happen when Starmer visits Trump?",
    "description": "What could happen when Sir Keir Starmer visits the White House next Thursday?",
    "link": "https://www.bbc.com/news/articles/c3w16l6xx39o",
    "timestamp": "2025-02-22T16:29:37Z"
  },
  {
    "title": "ADAM WEISS: Corporate Media Desperately Trying To Drive Wedge Between Trump, Musk. It Won’t Work.",
    "description": "The media won't succeed in breaking up the friendship between President Donald Trump and DOGE Chairman Elon Musk.",
    "link": "https://dailycaller.com/2025/02/22/opinion-corporate-media-trump-musk-adam-weiss/",
    "timestamp": "2025-02-22T16:26:03Z"
  },
  {
    "title": "Trump Proposes New Ship Fees To Challenge China’s Maritime Might",
    "description": "By Jenny Leonard and Jennifer A. Dlouhy Feb 21, 2025 (Bloomberg) –The Trump administration is proposing fees on the use of China’s commercial ships it says could help counter the country’s...",
    "link": "https://gcaptain.com/trump-proposes-new-ship-fees-to-challenge-chinas-maritime-might/",
    "timestamp": "2025-02-22T16:25:26Z"
  },
  {
    "title": "Trump fires top US general CQ Brown in major Pentagon shake-up",
    "description": "The US president fires CQ Brown without providing a reason and also announced replacement of five top officers.",
    "link": "https://www.aljazeera.com/news/2025/2/22/trump-fires-top-us-general-cq-brown-in-major-pentagon-shake-up",
    "timestamp": "2025-02-22T16:24:11Z"
  },
  {
    "title": "CDC Layoffs Weaken Response to Public Health Emergencies",
    "description": "Trump’s CDC cuts weaken public health response, hinder disease tracking, and threaten outbreak containment efforts.",
    "link": "https://www.dcreport.org/2025/02/22/cdc-layoffs-weaken-response-to-public-health-emergencies/",
    "timestamp": "2025-02-22T16:22:46Z"
  },
  {
    "title": "Defense Secretary Pete Hegseth Fires Two Four-Stars, Top JAG Officers",
    "description": "Defense Secretary Pete Hegseth fired two four-star military leaders on Friday evening, making good on a promise to review general officers and replace any who were not aligned with his and President Donald Trump's efforts to prioritize lethality and war-fight…",
    "link": "https://www.breitbart.com/politics/2025/02/22/defense-secretary-pete-hegseth-fires-two-four-stars-top-jag-officers/",
    "timestamp": "2025-02-22T16:19:38Z"
  },
  {
    "title": "On eve of elections, Germany faces changing world situation",
    "description": "BERLIN — German politicians made a final scramble for votes Saturday on the eve of key elections in which conservatives hope to win despite the dramatic rise of the far right.\n\n\nSunday's vote comes at a time of upheaval for Europe and its biggest economy as U…",
    "link": "https://www.voanews.com/a/on-eve-of-elections-germany-faces-changing-world-situation/7984491.html",
    "timestamp": "2025-02-22T16:19:00Z"
  },
  {
    "title": "One of Biden regime’s darkest ‘Ukraine war’ secrets was just revealed…",
    "description": "...According to Jeffrey Sachs, Jake Sullivan admitted—behind closed doors—that if he had told the truth about Ukraine and NATO, the war would’ve been over before it even started. He knew it, but never said it publicly.... ...Absolutely damning—and undeniable …",
    "link": "https://freerepublic.com/focus/f-news/4299636/posts",
    "timestamp": "2025-02-22T16:15:33Z"
  },
  {
    "title": "Donald Trump WAS Recruited as a Russian Spy in 1987: Ex-KGB Officer Makes Wild Allegation… and Even Claims Prez’s Coded Alias Was 'Krasnov'",
    "description": "Former Kazakh intelligence chief Alnur Mussayev claimed Donald Trump's personal file is now managed by one of Vladimir Putin's close allies.",
    "link": "https://radaronline.com/p/donald-trump-recruited-russian-spy-1987-ex-kgb-officer-alias-krasnov/",
    "timestamp": "2025-02-22T16:15:00Z"
  },
  {
    "title": "I'll back Ukraine in talks with Trump, Starmer tells Zelensky",
    "description": "The prime minister called Ukraine's Volodymyr Zelensky for the second time in four days.",
    "link": "https://www.bbc.com/news/articles/c8rklvrnl7ro",
    "timestamp": "2025-02-22T16:13:52Z"
  },
  {
    "title": "Rubio outlines Trump’s stance on Canada as 51st state",
    "description": "Washington is ready to continue working with Ottawa but “there has to be reciprocity” in trade, the US secretary of state has stated Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613157-rubio-explains-trumps-stance-on-canada/",
    "timestamp": "2025-02-22T16:08:44Z"
  },
  {
    "title": "It Appears Democrats Have Finally Picked A Hill To Die On",
    "description": "The vast majority of Americans say they want to keep men out of women's sports.",
    "link": "https://dailycaller.com/2025/02/22/democrats-pick-hill-transgender-policies/",
    "timestamp": "2025-02-22T16:08:00Z"
  },
  {
    "title": "Musk renews attack on Zelensky over ‘murder’ of US journalist",
    "description": "The Tesla CEO lashed out at Ukraine’s leader amid worsening bilateral ties between Kiev and Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613149-musk-zelensky-lira-murder/",
    "timestamp": "2025-02-22T16:06:56Z"
  },
  {
    "title": "Despite 2024 Layoffs, Tech Jobs Expected to Take Off",
    "description": "In 2024, the technology sector saw yet more layoffs after massive cuts in 2022 and 2023. Though the pace was somewhat slower last year, more than 150,000 employees were laid off across hundreds of companies, according to Layoffs.fyi, a site started during the…",
    "link": "https://spectrum.ieee.org/tech-jobs",
    "timestamp": "2025-02-22T16:00:03Z"
  },
  {
    "title": "Putin summit preparations underway...",
    "description": null,
    "link": "https://apnews.com/article/russia-ukraine-war-trump-putin-talks-89e19bc56677064f6f9a6d6e03de7362",
    "timestamp": "2025-02-22T16:00:03Z"
  },
  {
    "title": "DOWD: Fail, Caesar!",
    "description": "“Remember, I can do whatever I want to whomever I want.” It sounds like President Trump, to the world. But",
    "link": "https://dnyuz.com/2025/02/22/fail-caesar/",
    "timestamp": "2025-02-22T16:00:03Z"
  },
  {
    "title": "The economic recovery has begun. Here’s what the new normal looks like - Liam Dann",
    "description": "History suggests only a short window before the next black swan event rattles our economy.",
    "link": "https://www.nzherald.co.nz/business/liam-dann-the-economic-recovery-has-begun-heres-what-the-new-normal-looks-like/6NYLYBKV6NBHTKF7KEELLPOBME/",
    "timestamp": "2025-02-22T16:00:00Z"
  },
  {
    "title": "Pentagon Upheaval, Hamas Releases More Hostages, NY State Prisons",
    "description": "President Donald Trump fires the Chairman of the Joint Chiefs of Staff, plus the Defense Department is set to lose more than 5 thousand personnel. Hamas releases 6 more living hostages as part of its ceasefire agreement with Israel. Corrections officers in NY…",
    "link": "https://www.npr.org/2025/02/22/1233127306/pentagon-upheaval-hamas-releases-more-hostages-ny-state-prisons",
    "timestamp": "2025-02-22T15:58:33Z"
  },
  {
    "title": "I experienced Russian corruption firsthand — and Trump is importing KGB thuggery",
    "description": "Before I became a trial lawyer, I was corporate. Studying legal systems abroad morphed into drafting foreign license agreements, and in the late 90s, I negotiated across the table from Russian oligarchs. These were men who, through connections with the recent…",
    "link": "https://www.rawstory.com/raw-investigates/trump-kgb/",
    "timestamp": "2025-02-22T15:55:42Z"
  },
  {
    "title": "Why Trump Is So Threatening to Permanent Bureaucracy",
    "description": "<p>During an interview with Fox News's Sean Hannity, President Donald Trump and DOGE czar Elon Musk seemed to contemplate the existence of what used to be called the</p>",
    "link": "https://www.realclearpolitics.com/2025/02/22/why_trump_is_so_threatening_to_permanent_bureaucracy_641481.html",
    "timestamp": "2025-02-22T15:53:08Z"
  },
  {
    "title": "Gov. Janet Mills Refused To Be Bullied By Trump",
    "description": "Nothing warms my democracy-loving heart more than a government official standing up to Donald Trump. Even more so when it’s a woman whose spunk gets under his thin skin.\nHere’s Gov. Janet Mills sounding not one itsy-bit intimidated by President P***y Grabber’…",
    "link": "https://crooksandliars.com/2025/02/gov-janet-mills-refused-be-bullied-trump",
    "timestamp": "2025-02-22T15:50:59Z"
  },
  {
    "title": "Best of Archive Series – 7 Words Americans Should Stop Using Until Further Investigation",
    "description": "Americans repeat certain words with mindless ease without once regarding their definitions, their real meanings or their connotative meanings. Their use or perhaps their misuse is a good reflection of the health of our culture or the lack of it. Without inclu…",
    "link": "https://freerepublic.com/focus/f-chat/4299632/posts",
    "timestamp": "2025-02-22T15:42:16Z"
  },
  {
    "title": "New Social Security Chief Was Being Investigated",
    "description": "“Leaders of the Social Security Administration had just opened an investigation into a career employee they believed was improperly sharing information with Elon Musk’s cost-cutting team when President Donald Trump elevated the employee this week",
    "link": "https://politicalwire.com/2025/02/22/new-social-security-chief-was-being-investigated/",
    "timestamp": "2025-02-22T15:40:08Z"
  },
  {
    "title": "Second US-Russia meeting in next 2 weeks, Russian media reports",
    "description": "\"A dialogue on strategic stability and arms control is possible\" at the expected meeting, Russia's Deputy Foreign Minister Sergei Ryabkov was quoted as saying by RIA news agency.",
    "link": "https://www.politico.eu/article/second-us-russia-meeting-2-weeks-sergei-ryabkov/",
    "timestamp": "2025-02-22T15:35:17Z"
  },
  {
    "title": "Canadian Prime Minister Justin Trudeau sends pointed message after Canada beats USA in 4 Nations Face-Off",
    "description": "Following Canada's 3-2 overtime win over Team USA in the 4 Nations Face-Off championship, Canadian Prime Minister Justin Trudeau posted a celebratory message on social media. It was also a clear reference to the rising political tensions between the two count…",
    "link": "https://freerepublic.com/focus/f-chat/4299631/posts",
    "timestamp": "2025-02-22T15:32:36Z"
  },
  {
    "title": "San Francisco AIDS Foundation Leads Lawsuit in Response to Trump Executive Orders",
    "description": "President Donald Trump has rolled out dozens of executive orders, including three targeting transgender people, HIV funding and DEI initiatives.",
    "link": "https://www.kqed.org/news/12028124/san-francisco-aids-foundation-leads-lawsuit-in-response-to-trump-executive-orders",
    "timestamp": "2025-02-22T15:30:26Z"
  },
  {
    "title": "Exclusive – ‘President of Peace’: Elise Stefanik to Tout Trump’s Case for Nobel Peace Prize, Call for 'Global DOGE' at CPAC",
    "description": "Rep. Elise Stefanik (R-NY) will champion President Donald Trump's historic first month in office and call for a global DOGE in her keynote address Saturday at CPAC, Breitbart News has learned exclusively.\nThe post Exclusive – ‘President of Peace’: Elise Stefa…",
    "link": "https://www.breitbart.com/politics/2025/02/22/exclusive-president-peace-elise-stefanik-to-tout-trumps-case-nobel-peace-prize-call-for-global-doge-cpac/",
    "timestamp": "2025-02-22T15:30:16Z"
  },
  {
    "title": "JOSH HAMMER: Judicial ‘Resistance’ To Trump Setting Itself Up For Epic Smackdown",
    "description": "America has long been suffering from a crisis of civics. Put simply, many Americans are woefully ignorant about the structure and features of their government.",
    "link": "https://dailycaller.com/2025/02/22/opinion-judicial-resistance-trump-smackdown-josh-hammer/",
    "timestamp": "2025-02-22T15:29:07Z"
  },
  {
    "title": "Ousted Kennedy Center President Defends Drag Queen Performances Following Trump Criticism",
    "description": "The recently-fired head of the Kennedy Center has defended the federally-funded institution's decision to put on drag queen performances -- including shows aimed at minors.\nThe post Ousted Kennedy Center President Defends Drag Queen Performances Following Tru…",
    "link": "https://www.breitbart.com/entertainment/2025/02/22/ousted-kennedy-center-president-defends-drag-queen-performances-following-trump-criticism/",
    "timestamp": "2025-02-22T15:28:12Z"
  },
  {
    "title": "Illegal Immigrant Turned Mayor Wants Trump & Musk Dead—But Feels ‘Threatened",
    "description": "This is Robert Garcia. He was born in Peru and came to the US as an illegal immigrant. He was the Mayor of Long Beach CA from 2014-2022 and he has a big mouth. Donald Trump's actions with Elon Musk have gotten Garcia's pants in a twist and he made an overt th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4299630/posts",
    "timestamp": "2025-02-22T15:27:56Z"
  },
  {
    "title": "Warren Buffett advises Donald Trump to ‘spend wisely’ in Berkshire Hathaway's annual letter to shareholders: 10 Points",
    "description": "Warren Buffett celebrated the successes of Berkshire Hathaway's companies in his annual letter to shareholders while offering some advice to US President Donald Trump.",
    "link": "https://www.livemint.com/companies/news/warren-buffett-advises-donald-trump-to-spend-wisely-in-berkshire-hathaways-annual-letter-to-shareholders-10-points-11740237670411.html",
    "timestamp": "2025-02-22T15:27:45Z"
  },
  {
    "title": "'It's a fraud': CNN host bluntly calls out conservative CEO proposing a 'DOGE dividend'",
    "description": "Normally mild-mannered CNN host Michael Smeroconish shut down an investment firm CEO on Saturday morning who has been pitching what he calls a \"DOGE dividend\" where government savings would be refunded to taxpayers.Simply put, the CNN host dismissed the propo…",
    "link": "https://www.rawstory.com/doge-divident-fishback/",
    "timestamp": "2025-02-22T15:17:50Z"
  },
  {
    "title": "Experts Reveal The Real Face of DEI, Elon Musk Says Black ‘60 Minutes’ Journalist Deserves ‘Long Prison Sentence’ Over Kamala Harris Interview, Rep. Jasmine Crockett Provides Disturbing Tea On Elon Musk’s DOGE and More Political News",
    "description": "Photo: Getty Images (Getty Images), Chip Somodevilla (Getty Images), Getty Images (Getty Images), LeanIn.org\r\nElon Musk Says Black ‘60 Minutes’ Journalist Deserves ‘Long Prison Sentence’ Over Kamala Harris InterviewPhoto: Getty Images (Getty Images)\r\nElon Mus…",
    "link": "https://www.theroot.com/weekend-politics-roundup-february-22-2025-1851765870",
    "timestamp": "2025-02-22T15:15:00Z"
  },
  {
    "title": "Trump fires another salvo over 'funding' to India; Congress asks PM to refute allegations by 'friend'",
    "description": "US President Trump falsely claimed the Biden administration allocated USD 21 million for voter turnout in India, leading to condemnation from the Congress party. They urged Prime Minister Modi to counter the claim and demanded a detailed report on funds recei…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/trump-fires-another-salvo-over-funding-to-india-congress-asks-pm-to-refute-allegations-by-friend/articleshow/118483602.cms",
    "timestamp": "2025-02-22T15:07:16Z"
  },
  {
    "title": "Philippines removed from ‘dirty money’ list",
    "description": "<p>The Philippine government has welcomed the country&rsquo;s removal from a global watchdog&rsquo;s dirty-money list, which could spur remittances and foreign investments in one of Asia&rsquo;s fastest-growing economies.</p>",
    "link": "https://www.bangkokpost.com/business/general/2966053/philippines-removed-from-dirty-money-list",
    "timestamp": "2025-02-22T15:05:00Z"
  },
  {
    "title": "Diddy Asks Trump For PARDON … In Exchange For ‘Loyalty’!",
    "description": "Sean “Diddy” Combs’ legal team is pulling out all the stops to get his charges dismissed—even reaching out to members of Donald Trump’s administration for assistance. According to reports, Diddy’s lawyers are hoping to convince Trump that their client was bei…",
    "link": "https://mediatakeout.com/diddy-asks-trump-for-pardon-in-exchange-for-loyalty/",
    "timestamp": "2025-02-22T15:04:40Z"
  },
  {
    "title": "Are Trump’s Actions ‘Unprecedented’? Here’s What Seven Historians Say",
    "description": "Trump's second administration is 'unprecedented' to some, but historians find parallels in ancient Rome, Nazi Germany, and Latin American dictatorship.",
    "link": "http://www.rollingstone.com/culture/culture-features/trump-musk-unprecidented-history-1235272825/",
    "timestamp": "2025-02-22T15:00:00Z"
  },
  {
    "title": "The Policies of European Elites End in Tears",
    "description": "If you follow these things closely, you may have seen a clip of the chairman of the Munich Security Conference breaking down in tears, unable... Read More\nThe post The Policies of European Elites End in Tears appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/02/22/the-policies-of-european-elites-end-in-tears/",
    "timestamp": "2025-02-22T15:00:00Z"
  },
  {
    "title": "Federal Judge Blocks Trump Ban on DEI",
    "description": "One of Trump’s signature policies has been his crusade against diversity, equity, and inclusion programs and activities. His Cabinet members have pledged to purge DEI from the government, and the government has put universities and corporations on notice that…",
    "link": "https://dianeravitch.net/2025/02/22/federal-judge-blocks-trump-ban-on-dei/",
    "timestamp": "2025-02-22T15:00:00Z"
  },
  {
    "title": "Warren Buffett amasses more cash and sells more stock, but doesn't explain why in annual letter",
    "description": "\"The great majority of your money remains in equities,\" Buffett wrote in his highly-anticipated annual letter. \"That preference won't change.\"",
    "link": "https://www.cnbc.com/2025/02/22/warren-buffett-amasses-more-cash-and-sells-more-stock-but-doesnt-explain-why-in-annual-letter.html",
    "timestamp": "2025-02-22T14:57:26Z"
  },
  {
    "title": "US supermarket giant sued over DEI",
    "description": "Florida has filed a lawsuit against Target, claiming the company misled investors by promoting diversity, equity and inclusion initiatives Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613152-florida-target-lawsuit-dei/",
    "timestamp": "2025-02-22T14:55:22Z"
  },
  {
    "title": "Trump’s Aggression Against Canada Is Boosting Liberal Party’s Election Chances",
    "description": "Annexation is implausible because Canadians know just how much the US has shredded its own social safety net.",
    "link": "https://truthout.org/articles/trumps-aggression-against-canada-is-boosting-liberal-partys-election-chances/",
    "timestamp": "2025-02-22T14:54:59Z"
  },
  {
    "title": "What Trump’s Purge Could Mean for the Military",
    "description": "Panelists discuss the president’s firing of the chairman of the Joint Chiefs of Staff, General C. Q. Brown.",
    "link": "https://www.theatlantic.com/national/archive/2025/02/trump-military-purge-washington-week/681805/",
    "timestamp": "2025-02-22T14:51:59Z"
  },
  {
    "title": "Wisconsin culture war ignites over bill using 'inseminated person' instead of 'mother'",
    "description": "Wisconsin Gov. Tony Evers is taking heat for introducing a bill with several changes to gendered language, including using the term \"inseminated person\" instead of \"mother.\"",
    "link": "https://www.foxnews.com/politics/wisconsin-democratic-governor-proposes-replacing-mother-inseminated-person-state-law",
    "timestamp": "2025-02-22T14:50:39Z"
  },
  {
    "title": "‘A lot of problems’ for Kiev without minerals deal – Trump",
    "description": "The US president first demanded access to Ukraine’s rare earths earlier this month, but Vladimir Zelensky reportedly refused to sign a deal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613150-trump-threatens-ukraine-problems-minerals-deal/",
    "timestamp": "2025-02-22T14:37:23Z"
  },
  {
    "title": "Trump Moves With Light Speed And Brute Force In Shaking The Core Of What America Has Been",
    "description": "Trump’s core supporters are thrilled with what they see. Those who don't like him watch in horror.",
    "link": "https://www.huffpost.com/entry/bc-us-trump-reshaping-america_n_67b9df87e4b062564f96abb7",
    "timestamp": "2025-02-22T14:37:09Z"
  },
  {
    "title": "Laughing MSNBC hosts ridicule GOP lawmakers getting humiliated at town halls",
    "description": "The hosts of MSNBC's \"The Weekend\" dissolved in laughter on Saturday after watching clips that have gone viral showing Republican lawmakers being raked over the coals by voters at town halls over Donald Trump and Elon Musk.\n\nIn the past few days, GOP lawmaker…",
    "link": "https://www.rawstory.com/gop-town-halls-elon/",
    "timestamp": "2025-02-22T14:35:08Z"
  },
  {
    "title": "OpenSea Says SEC Will End Investigation Into Ethereum NFT Marketplace",
    "description": "OpenSea CEO Devin Finzer said late Friday that the SEC is ending its investigation, as the regulator shifts course under President Trump.",
    "link": "https://decrypt.co/307352/opensea-sec-end-investigation-nft-marketplace",
    "timestamp": "2025-02-22T14:33:57Z"
  },
  {
    "title": "Senator and Teamsters President Who Nearly Fought On Senate Floor Tell Fox Trump Made Them ‘Break Bread’: ‘Truly Built a Friendship’",
    "description": "Markwayne Mullin and Sean O'Brien opened up about how Trump inspired their surprising \"friendship\" after the two nearly came to blows on the Senate floor.\nThe post Senator and Teamsters President Who Nearly Fought On Senate Floor Tell Fox Trump Made Them ‘Bre…",
    "link": "https://www.mediaite.com/tv/senator-and-teamsters-president-who-nearly-fought-on-senate-floor-tell-fox-trump-made-them-break-bread-truly-built-a-friendship/",
    "timestamp": "2025-02-22T14:31:02Z"
  },
  {
    "title": "France’s agriculture show, an outlet for angry farmers",
    "description": "France’s annual Agriculture Show has become a hotbed of protest by farmers, exasperated by low produce prices, heavy regulations and global competition, against the government they say doesn’t care for them enough. One of the world’s largest agriculture fairs…",
    "link": "https://www.digitaljournal.com/world/frances-agriculture-show-an-outlet-for-angry-farmers/article",
    "timestamp": "2025-02-22T14:30:34Z"
  },
  {
    "title": "Cartels Are Business as Usual Despite Trump’s Terror Designations",
    "description": "Trump’s administration is building up its presence on the Mexico border, apparently prepping a “soft invasion.” Cartels are still fighting local battles",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-mexico-terror-invasion-drones-cartels-business-usual-1235275910/",
    "timestamp": "2025-02-22T14:30:00Z"
  },
  {
    "title": "Elon Musk wants to audit the Fed. Is that a good idea? | CNN Business",
    "description": "Elon Musk is fixated on auditing the Federal Reserve, America’s central bank.",
    "link": "https://www.cnn.com/2025/02/22/business/musk-audit-federal-reserve/index.html",
    "timestamp": "2025-02-22T14:24:31Z"
  },
  {
    "title": "Trump threatens to launch tariff attack on EU tech regulation",
    "description": "White House: ''Regulations that dictate how American companies interact with consumers in the European Union, like the Digital Markets Act and the Digital Services Act, will face scrutiny from the Administration.''",
    "link": "https://www.euractiv.com/section/tech/news/trump-threatens-to-launch-tariff-attack-on-eu-tech-regulation/",
    "timestamp": "2025-02-22T14:19:21Z"
  },
  {
    "title": "Resisting Trump and Musk’s Cultural Revolution",
    "description": "The aging leader wanted to shake up his country, so he launched a second revolution with the help of a cadre of young people. Drunk with power, the leader targeted his enemies, remade his political party, and turned his own government into a self-destructing …",
    "link": "https://fpif.org/the-trump-musk-cultural-revolution/",
    "timestamp": "2025-02-22T14:18:04Z"
  },
  {
    "title": "Trump urges Musk to be more aggressive in bid to shrink US government",
    "description": "WASHINGTON — U.S. President Donald Trump on Saturday urged billionaire Elon Musk to be more aggressive in his efforts to shrink the federal government despite the uproar over layoffs and deep spending cuts.\n\n\n\"Elon is doing a great job, but I would like to se…",
    "link": "https://www.voanews.com/a/trump-urges-musk-to-be-more-aggressive-in-bid-to-shrink-us-government/7984399.html",
    "timestamp": "2025-02-22T14:16:03Z"
  }
]