[
  {
    "title": "FedEx says it'll refund tariffs to customers if it gets money back from the Trump administration",
    "description": "FedEx said it would give any tariff refunds it secures from the Trump administration to customers who paid the duties.",
    "link": "https://www.businessinsider.com/fedex-says-it-will-pass-along-tariff-refunds-to-customers-2026-2",
    "timestamp": "2026-02-27T15:33:17Z"
  },
  {
    "title": "BREAKING: All Signs Indicate “War Is Coming to Iran”",
    "description": "Everything is being readied for war with Iran.  The time is near.  Yesterday, the talks with Iran fell apart.  Iran’s terrorist regime would not give an inch.  They thought they … Read more\nThe post BREAKING: All Signs Indicate “War Is Coming to Iran” appeare…",
    "link": "https://joehoft.com/breaking-all-signs-indicate-war-is-coming-iran/",
    "timestamp": "2026-02-27T15:30:59Z"
  },
  {
    "title": "Texas Primaries Reach Boiling Point With Help of Vicious Attack Ads",
    "description": "New attack ads from candidates in the race for Texas’ Senate seat, along with recent polling, have brought the race to a boiling point. Republican... Read More\nThe post Texas Primaries Reach Boiling Point With Help of Vicious Attack Ads appeared first on The …",
    "link": "https://www.dailysignal.com/2026/02/27/texas-primaries-reach-boiling-point-with-help-of-vicious-attack-ads/",
    "timestamp": "2026-02-27T15:30:41Z"
  },
  {
    "title": "UK withdraws staff from Iran over threat of US airstrikes",
    "description": "The British Foreign Office has \"temporarily\" withdrawn its staff from Iran amid the threat of US strikes against the country.",
    "link": "https://www.independent.ie/world-news/middle-east/uk-withdraws-staff-from-iran-over-threat-of-us-airstrikes/a1605604610.html",
    "timestamp": "2026-02-27T15:24:12Z"
  },
  {
    "title": "AIPAC faces test of its power in Illinois primary as Democrats debate future of Israel relationship",
    "description": "The aggressive spending comes after AIPAC put $2 million into a recent Democratic primary for a special election in New Jersey, an effort that's widely considered to have backfired.",
    "link": "https://www.pbs.org/newshour/politics/aipac-faces-test-of-its-power-in-illinois-primary-as-democrats-debate-future-of-israel-relationship",
    "timestamp": "2026-02-27T15:22:53Z"
  },
  {
    "title": "It Can Now Be Plainly Said: Trump Is Planning a November Coup d’État",
    "description": "Back in 2024, Kamala Harris and the Democrats struggled to convince voters that a second Donald Trump term would constitute a serious threat to democracy. We can debate the effectiveness of her, and their, rhetoric. But on a certain level, it was a hard argum…",
    "link": "https://newrepublic.com/post/207138/trump-coup-detat-midterm-elections",
    "timestamp": "2026-02-27T15:22:53Z"
  },
  {
    "title": "26 Storylines for 2026 INDYCAR Season: From Will Power's New Ride to D.C. race",
    "description": "From a new race in D.C. to Will Power's new ride to Alex Palou's dominance, keep an eye on these 26 storylines throughout the 2026 INDYCAR season.",
    "link": "https://www.foxsports.com/stories/motor/26-storylines-2026-indycar-season",
    "timestamp": "2026-02-27T15:22:47Z"
  },
  {
    "title": "WATCH LIVE: Rep. Comer speaks ahead of Bill Clinton deposition on Jeffrey Epstein",
    "description": "Former President Bill Clinton is testifying Friday before members of Congress investigating convicted sex offender Jeffrey Epstein, answering for his connections to the disgraced financier from more than two decades ago.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-rep-comer-speaks-ahead-of-bill-clinton-deposition-on-jeffrey-epstein",
    "timestamp": "2026-02-27T15:21:52Z"
  },
  {
    "title": "What Hillary Clinton said about Ghislaine Maxwell in her testimony",
    "description": "Hillary Clinton testified before the House Oversight Committee regarding her connections to Jeffrey Epstein, stating Ghislaine Maxwell attended Chelsea Clinton's 2010 wedding as a guest of another individual. Clinton reiterated her lack of knowledge about Eps…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-hillary-clinton-said-about-ghislaine-maxwell-in-her-testimony/articleshow/128856927.cms",
    "timestamp": "2026-02-27T15:21:26Z"
  },
  {
    "title": "Targeting disabled people, West Bank annexation, and what next for WFP? The Cheat Sheet",
    "description": "A weekly read to keep you in the loop on humanitarian issues.",
    "link": "https://www.thenewhumanitarian.org/news/2026/02/27/targeting-disabled-people-west-bank-annexation-what-next-wfp-cheat-sheet",
    "timestamp": "2026-02-27T15:19:08Z"
  },
  {
    "title": "Mamdani and Trump Raise Sunnyside Yards Housing Plan From the Grave",
    "description": "A project to build housing above the Sunnyside rail yards in Queens may be back from the dead after a surprise meeting between New York Mayor Zohran Mamdani and President Donald Trump. The strange bedfellows met Thursday at the White House where they discusse…",
    "link": "http://commercialobserver.com/2026/02/zohran-mamdani-donald-trump-sunnyside-yards/",
    "timestamp": "2026-02-27T15:17:17Z"
  },
  {
    "title": "Gold Rises on Chinese Trading With US-Iran Tensions in Focus",
    "description": "Gold and silver rose as the Shanghai Futures Exchange’s night session began, with a US military build-up in the Middle East keeping markets on edge.",
    "link": "https://financialpost.com/pmn/business-pmn/gold-rises-on-chinese-trading-with-us-iran-tensions-in-focus",
    "timestamp": "2026-02-27T15:17:16Z"
  },
  {
    "title": "Polish presidential aide questions France's role in any Europe nuclear plan, backs US",
    "description": "WARSAW, ⁠Feb 27 (Reuters) - Poland is sceptical of France's role in a potential European nuclear-deterrence plan and sees ⁠only the United States as a credible nuclear partner for now, the president's top security ‌adviser said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/27/polish-presidential-aide-questions-france039s-role-in-any-europe-nuclear-plan-backs-us",
    "timestamp": "2026-02-27T15:13:00Z"
  },
  {
    "title": "Vance Says 'No Chance' US Will Get Involved in Years-Long War in Middle East Over Iran",
    "description": "WASHINGTON (Sputnik) - Vice President JD Vance has ruled out that the United States will become entangled in a years-long armed conflict in the Middle East if President Donald Trump opts for strikes on Iran.",
    "link": "https://sputnikglobe.com/20260227/vance-says-no-chance-us-will-get-involved-in-years-long-war-in-middle-east-over-iran-1123705642.html",
    "timestamp": "2026-02-27T15:12:27Z"
  },
  {
    "title": "British Lessons About American Decline",
    "description": "Rather than indulging in anti-immigration culture wars and tarring Britain as a case study in \"civilizational erasure,\" Donald Trump and his followers’ would do well to examine how Britain struggled with the loss of its own global preeminence. No other countr…",
    "link": "https://www.project-syndicate.org/commentary/british-lessons-as-american-decline-accelerates-under-trump-by-harold-james-2026-02",
    "timestamp": "2026-02-27T15:11:06Z"
  },
  {
    "title": "Why Is the Oil Price Rising Today?",
    "description": "Rigzone talks to several analysts.",
    "link": "https://www.rigzone.com/news/why_is_the_oil_price_rising_today-27-feb-2026-183093-article/",
    "timestamp": "2026-02-27T15:10:01Z"
  },
  {
    "title": "Crypto taxes updated, BTC stuck below $70K: Month in charts",
    "description": "Crypto ATMs worldwide are returning to 2022 levels as some operators add ID requirements, Bitcoin meanwhile tested the $70,000 mark in February.",
    "link": "https://cointelegraph.com/news/crypto-taxes-btc-stuck-70k-month-in-charts",
    "timestamp": "2026-02-27T15:09:22Z"
  },
  {
    "title": "Why are Trump-related Epstein files missing? #politics",
    "description": "What is known and what still isn’t The Justice Department has acknowledged that some records tied to the Jeffrey Epstein files, including material that references President Donald Trump, were not included among documents released to the public. Reporting from…",
    "link": "https://alltoc.com/politics/why-are-trump-related-epstein-files-missing",
    "timestamp": "2026-02-27T15:07:26Z"
  },
  {
    "title": "Don't fall for alleged image of Trump and Epstein getting feet washed by girl",
    "description": "An image showing a young woman or girl giving a shirtless Donald Trump and Jeffrey Epstein a foot wash is authentic and appeared in the U.S. Department of Justice's release of files pertaining to Epstein.",
    "link": "https://www.snopes.com//fact-check/trump-epstein-feet-washed/",
    "timestamp": "2026-02-27T15:06:00Z"
  },
  {
    "title": "States Can Block the Paramount-Warner Deal",
    "description": "But thanks to some clever maneuvering, they are already running out of time.\nThe post States Can Block the Paramount-Warner Deal appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/27/states-can-block-paramount-warner-deal/",
    "timestamp": "2026-02-27T15:02:11Z"
  },
  {
    "title": "North Jersey Republicans support ICE detention centers. Just not in their town.",
    "description": "Roxbury Republicans say they’re fighting to prevent an immigrant detention center in the town. They also say they’re in favor of deportations and aggressive ICE actions. [ more › ]",
    "link": "https://gothamist.com/news/north-jersey-republicans-support-ice-detention-centers-just-not-in-their-town",
    "timestamp": "2026-02-27T15:01:04Z"
  },
  {
    "title": "Trump’s DOJ Still Refusing To Disclose Gov’t Payments To Twitter During Peak Censorship",
    "description": "President Donald Trump's Justice Department is continuing to keep details of reported FBI payments to Twitter under wraps.",
    "link": "https://dailycaller.com/2026/02/27/trump-doj-fbi-twitter-payments/",
    "timestamp": "2026-02-27T15:00:30Z"
  },
  {
    "title": "This week on \"Sunday Morning\" (March 1)",
    "description": "A look at the features for this week's broadcast of the Emmy-winning program, hosted by Jane Pauley.",
    "link": "https://www.cbsnews.com/news/this-week-on-sunday-morning-march-1-2026/",
    "timestamp": "2026-02-27T15:00:18Z"
  },
  {
    "title": "China Warns Taiwan Of “Annihilation” If ATACMS Are Deployed",
    "description": "China has warned Taiwan that it will be annihilated if the United States supplies ATACMS (Army Tactical Missile System) is deployed for use. Beijing warned Taiwan specifically against using HIMARS (High Mobility Artillery Rocket System) launchers armed with A…",
    "link": "https://www.activistpost.com/china-warns-taiwan-of-annihilation-if-atacms-are-deployed/",
    "timestamp": "2026-02-27T15:00:00Z"
  },
  {
    "title": "Zelenskyy Pushes for Trilateral Summit With U.S. and Russia in Abu Dhabi",
    "description": "President Volodymyr Zelenskyy said that Kyiv is counting on a future trilateral meeting with the United States and Russia to take place in early March after Ukrainian and US negotiating teams wrapped up the latest round of peace talks in Switzerland. Zelensky…",
    "link": "https://oilprice.com/Energy/Energy-General/Zelenskyy-Pushes-for-Trilateral-Summit-With-US-and-Russia-in-Abu-Dhabi.html",
    "timestamp": "2026-02-27T15:00:00Z"
  },
  {
    "title": "Greg Olear: Trump’s Name Appears in the Epstein Files 1 Million Times. This is What It Looks Like.",
    "description": "Greg Olear is an author who has one of the best blogs on the Internet. In this post, he illustrates what one million mentions of Donald Trump’s name actually looks like. Olear writes: Replace every word in Anna Karenina, The Decameron, Ulysses, and Moby-Dick …",
    "link": "https://dianeravitch.net/2026/02/27/greg-olear-trumps-name-appears-in-the-epstein-files-1-million-times-this-is-what-it-looks-like/",
    "timestamp": "2026-02-27T15:00:00Z"
  },
  {
    "title": "Inflation fears have returned, and stocks are getting hammered",
    "description": "January wholesale inflation data surpassed estimates, hitting stocks as traders fret over the path of interest rate cuts.",
    "link": "https://www.businessinsider.com/stock-market-today-inflation-ppi-wall-street-economy-wholesale-prices-2026-2",
    "timestamp": "2026-02-27T14:58:27Z"
  },
  {
    "title": "Tom Suozzi Says He Didn’t Pay Attention To Epstein Story Because It Wasn’t ‘Big Issue’",
    "description": "Tom Suozzi said that he did not closely follow the story of Jeffrey Epstein under Joe Biden's administration because it was not a significant issue for him.",
    "link": "https://dailycaller.com/2026/02/27/tom-suozzi-says-he-didnt-pay-attention-to-epstein-story-because-it-wasnt-big-issue/",
    "timestamp": "2026-02-27T14:55:59Z"
  },
  {
    "title": "US allows non-emergency staff to leave Israel as Trump threatens Iran strikes",
    "description": "US President Donald Trump has repeatedly threatened to strike Iran while his army builds up its forces in the region.",
    "link": "https://www.thejournal.ie/us-allows-non-emergency-staff-to-leave-israel-as-trump-threatens-iran-strikes-6969749-Feb2026/",
    "timestamp": "2026-02-27T14:55:37Z"
  },
  {
    "title": "CNN Isn’t About to Go MAGA. But It Does Need Fresh Ideas",
    "description": "Trump’s pressure is real. CNN isn’t becoming Fox overnight. The bigger question is whether the network can reinvent itself without losing its core.\nThe post CNN Isn’t About to Go MAGA. But It Does Need Fresh Ideas first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/cnn-isnt-about-to-go-maga-but-it-does-need-fresh-ideas/",
    "timestamp": "2026-02-27T14:53:21Z"
  },
  {
    "title": "Israel’s top court allows aid groups to keep working in Gaza as Israeli strikes kill 4 there",
    "description": "Such strikes have repeatedly disrupted the U.S.-negotiated truce since it took effect on Oct. 10.",
    "link": "https://www.bostonherald.com/2026/02/27/israel-court-aid-groups-gaza/",
    "timestamp": "2026-02-27T14:51:16Z"
  },
  {
    "title": "UBS downgrades the U.S. stock market. Here's what has the investment bank worried",
    "description": "UBS downgraded U.S. equities to benchmark in a fully invested global equity portfolio, saying factors that powered years of outperformance are starting to fade.",
    "link": "https://www.cnbc.com/2026/02/27/ubs-downgrades-the-us-stock-market-heres-what-has-the-investment-bank-worried.html",
    "timestamp": "2026-02-27T14:46:48Z"
  },
  {
    "title": "Keith Olbermann turns on ex-ESPN colleague Linda Cohn over Auston Matthews Olympics take",
    "description": "The ex-ESPN host took aim at his former colleague amid the fallout from Team USA's gold medal victory lap after the Olympics.",
    "link": "https://nypost.com/2026/02/27/sports/keith-olbermann-goes-after-linda-cohn-over-her-auston-matthews-take/",
    "timestamp": "2026-02-27T14:39:30Z"
  },
  {
    "title": "Trump angering MAHA with glyphosate order gives Democrats an opening",
    "description": "Democrats once counted many of the health-conscious followers of Robert F. Kennedy Jr. among their own ranks.",
    "link": "https://www.cnbc.com/2026/02/27/trump-maha-glyphosate-order-democrats-rfk-jr.html",
    "timestamp": "2026-02-27T14:38:09Z"
  },
  {
    "title": "Paramount Faces Regulatory Hurdle After Winning Warner Bros Battle",
    "description": "Paramount's merger with Warner Bros would unite two major Hollywood studios, two streaming platforms and two news operations.",
    "link": "https://www.huffpost.com/entry/paramount-skydance-wins-warner-bros_n_69a1aaaae4b0302539935a98",
    "timestamp": "2026-02-27T14:37:11Z"
  },
  {
    "title": "Rep. Garcia: Trump's DOJ Continues 'To Lead A White House Cover-up' On Epstein Files",
    "description": "Rep. Robert Garcia (D-CA), the Ranking Member of the House Committee on Oversight and Accountability, held a press conference on Thursday, where he pummeled Trump's Department of Justice for continuing to lead a White House cover-up of the Epstein files.\nSo f…",
    "link": "https://crooksandliars.com/2026/02/rep-garcia-trumps-doj-continues-lead-white",
    "timestamp": "2026-02-27T14:34:26Z"
  },
  {
    "title": "Megan Rapinoe Gets Mega-Triggered Over Team USA Throwing Back Beers With Kash Patel",
    "description": "Megan Rapinoe said that the men's hockey team had \"allowed themselves to be co-opted by a clown\" when they invited FBI director Kash Patel into the locker room.",
    "link": "https://dailycaller.com/2026/02/27/megan-rapinoe-team-usa-hockey-gold-celebration-beers-kash-patel/",
    "timestamp": "2026-02-27T14:33:50Z"
  },
  {
    "title": "What’s CNN’s Future Under Paramount Skydance?",
    "description": "CNN staffers are reportedly apprehensive following the news that they will be part of Paramount Skydance.",
    "link": "https://www.adweek.com/tvnewser/whats-cnns-future-under-paramount-skydance/",
    "timestamp": "2026-02-27T14:33:33Z"
  },
  {
    "title": "Target to stop selling cereals with certified synthetic colors by end of May",
    "description": "Target will stop selling its entire assortment of cereal with certified synthetic colors by the end of May",
    "link": "https://abcnews.com/Business/wireStory/target-stop-selling-cereals-certified-synthetic-colors-end-130562029",
    "timestamp": "2026-02-27T14:33:31Z"
  },
  {
    "title": "The Supreme Court Tariffs Ruling and Commercial Real Estate Investment: It’s Muddled",
    "description": "In the run of news headlines that have already seemed to define 2026, the Supreme Court’s 6-3 decision on U.S. trade announced Friday morning, Feb. 20., might be viewed as one of the more substantial ones.  In a somewhat surprising move, considering its clear…",
    "link": "http://commercialobserver.com/2026/02/trump-supreme-court-tariffs-commercial-real-estate-investment-strategy/",
    "timestamp": "2026-02-27T14:33:14Z"
  },
  {
    "title": "Iran Seen Conducting Regular Activity at Bombed Enrichment Sites",
    "description": "United Nations atomic inspectors report seeing Iran conducting regular activity at bombed uranium-enrichment sites, potentially complicating ongoing negotiations with Washington over the Islamic Republic’s nuclear ambitions.",
    "link": "https://financialpost.com/pmn/business-pmn/iran-seen-conducting-regular-activity-at-bombed-enrichment-sites",
    "timestamp": "2026-02-27T14:31:50Z"
  },
  {
    "title": "Trump’s Economy Is Hurting Americans — and Setting Us Up for Long-Term Collapse",
    "description": "Trump boasts of a booming economy. He’s dead wrong. A year into Trump 2.0, the affordability crisis is worse than ever.",
    "link": "https://truthout.org/articles/trumps-economy-is-hurting-americans-and-setting-us-up-for-long-term-collapse/",
    "timestamp": "2026-02-27T14:31:16Z"
  },
  {
    "title": "Heroic ICE Agents Save Four-Year-Old Boy From Drowning In Minnesota Pool",
    "description": "Two heroic off-duty Immigration and Customs Enforcement (ICE) officers patrolling in Minnesota saved the life of a four-year-old boy who drowned after falling into a hotel pool. The young boy’s panicked mother approached the off-duty officers last Friday as t…",
    "link": "https://freerepublic.com/focus/f-news/4368526/posts",
    "timestamp": "2026-02-27T14:30:51Z"
  },
  {
    "title": "Hillary Clinton Knows Nothing",
    "description": "Plus: AI layoffs, Paramount wins Warner Bros., and the Trump-Mamdani bromance.",
    "link": "https://reason.com/2026/02/27/hillary-clinton-knows-nothing/",
    "timestamp": "2026-02-27T14:29:53Z"
  },
  {
    "title": "U.S. Israeli Embassy Urges Staff To Evacuate Amid Threat Of Iran Attack",
    "description": "The U.S. has built up military forces near Iran in the past several weeks as Trump weighs an attack.",
    "link": "https://www.forbes.com/sites/saradorn/2026/02/27/us-israeli-embassy-urges-staff-to-evacuate-amid-threat-of-iran-attack/",
    "timestamp": "2026-02-27T14:29:30Z"
  },
  {
    "title": "The Daily Chase: Canadian economy shrank to end 2025",
    "description": "The Daily Chase: Canadian economy shrank to end 2025bnnbloomberg.ca",
    "link": "https://www.bnnbloomberg.ca/business/economics/2026/02/27/the-daily-chase-canadian-economy-shrank-to-end-2025/",
    "timestamp": "2026-02-27T14:26:10Z"
  },
  {
    "title": "Netflix bows out: Paramount Skydance secures Warner Bros. Discovery in $111 billion deal, eyes CNN overhaul",
    "description": "Netflix has withdrawn from its bid to acquire Warner Bros. Discovery, clearing the path for Paramount Skydance to take control of the media…\nThe post Netflix bows out: Paramount Skydance secures Warner Bros. Discovery in $111 billion deal, eyes CNN overhaul a…",
    "link": "https://macdailynews.com/2026/02/27/netflix-bows-out-paramount-skydance-secures-warner-bros-discovery-in-111-billion-deal-eyes-cnn-overhaul/",
    "timestamp": "2026-02-27T14:25:07Z"
  },
  {
    "title": "CNN poll on Trump SOTU bodes poorly for Democrats",
    "description": "Democrats desperate to take the wind out of President Donald Trump's sails and torpedo his State of the Union address Tuesday with heckles, boycotts, and low-energy critiques may be upset to learn that the Americans who tuned in were overwhelmingly receptive …",
    "link": "https://freerepublic.com/focus/f-bloggers/4368524/posts",
    "timestamp": "2026-02-27T14:23:13Z"
  },
  {
    "title": "CNN poll on Trump SOTU bodes poorly for Democrats",
    "description": "Democrats desperate to take the wind out of President Donald Trump's sails and torpedo his State of the Union address Tuesday with heckles, boycotts, and low-energy critiques may be upset to learn that the Americans who tuned in were overwhelmingly receptive …",
    "link": "https://freerepublic.com/focus/f-news/4368524/posts",
    "timestamp": "2026-02-27T14:23:13Z"
  },
  {
    "title": "Oil prices rise 3% as US and Iran extend talks into next week",
    "description": "Oil ​prices rose about 3% on Friday as traders remained on alert for potential supply disruptions after the United States and Iran extended nuclear talks.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/oil-prices-rise-3-as-us-and-iran-extend-talks-into-next-week/articleshow/128854744.cms",
    "timestamp": "2026-02-27T14:21:50Z"
  },
  {
    "title": "Trump Took on Federal Unions. Now States Must Act.",
    "description": "Tuesday night, President Donald Trump delivered his first State of the Union address of his second term. He touted his accomplishments: securing the border, negotiating... Read More\nThe post Trump Took on Federal Unions. Now States Must Act. appeared first on…",
    "link": "https://www.dailysignal.com/2026/02/27/trump-took-on-federal-unions-now-states-must-act/",
    "timestamp": "2026-02-27T14:21:05Z"
  },
  {
    "title": "Is Europe a Possessed Continent?",
    "description": "Europe finds itself submerged in a deepening crisis, financial, social and political. The media struggle in their attempts to describe it, but their failure to do so contributes to the confusion and aggravates its effects. The result appears in the astonishin…",
    "link": "https://www.fairobserver.com/politics/is-europe-a-possessed-continent/",
    "timestamp": "2026-02-27T14:20:41Z"
  },
  {
    "title": "Dems Silent After New Revelations About Jack Smith’s Spying Ops On Political Enemies",
    "description": "‘I hope they put Jack Smith behind bars for this!’ said Mark Davis, one of many conservative victims of the special counsel and ‘Arctic Frost’. The people who cheered on Jack Smith’s corrupt investigations into Donald Trump and his allies are suddenly silent …",
    "link": "https://freerepublic.com/focus/f-chat/4368523/posts",
    "timestamp": "2026-02-27T14:19:59Z"
  },
  {
    "title": "US urges its citizens to leave Israel immediately amid strike threat on Iran",
    "description": "Warning comes as talks over the future of Iran’s nuclear programme ended inconclusively",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/27/us-urges-its-citizens-to-leave-israel-immediately-amid-strike-threat-on-iran/",
    "timestamp": "2026-02-27T14:16:35Z"
  },
  {
    "title": "U.S. women’s hockey team dumps Trump, sets a date to celebrate gold medal with Flavor Flav in Las Vegas",
    "description": "The rapper reposted a note on X from sports media brand The GIST, announcing he’s hosting a “She Got Game” in partnership with the outlet and MGM Resorts.",
    "link": "https://fortune.com/2026/02/27/u-s-womens-hockey-team-gold-medal-trump-flavor-flav-las-vegas/",
    "timestamp": "2026-02-27T14:16:09Z"
  },
  {
    "title": "Foreign Affairs Finally Writes that ‘Ukraine Is Losing the War’ – Globalist Magazine Says Kiev Must Give Up on Donetsk Territory for Peace",
    "description": "The Globalists seem to have thrown in the towel.\nThe post Foreign Affairs Finally Writes that ‘Ukraine Is Losing the War’ – Globalist Magazine Says Kiev Must Give Up on Donetsk Territory for Peace appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/foreign-affairs-finally-writes-that-ukraine-is-losing/",
    "timestamp": "2026-02-27T14:15:17Z"
  },
  {
    "title": "Top guns: These Canadian aces train fighter pilots worldwide – and business is booming",
    "description": "Trio of former combat pilots built one of Canada’s most successful defence companies and are training foreign militaries in an increasingly dangerous world",
    "link": "https://www.theglobeandmail.com/business/rob-magazine/article-rob-magazine-top-aces-cover/",
    "timestamp": "2026-02-27T14:15:10Z"
  },
  {
    "title": "Trump Media in talks to spin off Truth Social from DJT into independent stock",
    "description": "Trump Media said it was considering separating Truth Social into a separate, publicly traded company.",
    "link": "https://www.cnbc.com/2026/02/27/truth-social-spin-off-trump-media-djt.html",
    "timestamp": "2026-02-27T14:12:45Z"
  },
  {
    "title": "Anthropic faces lose-lose scenario in Pentagon conflict as deadline for policy change looms",
    "description": "Anthropic has just hours to decide whether it will accede to the Defense Department's demands that it be able to use the company's models how it sees fit.",
    "link": "https://www.cnbc.com/2026/02/27/anthropic-pentagon-ai-policy-war-spying.html",
    "timestamp": "2026-02-27T14:06:16Z"
  },
  {
    "title": "David Ellison Wins. It Doesn't Yet Make Him a Winner.",
    "description": "Defying the odds with money isn't nearly as difficult as defying the odds with movies.",
    "link": "http://www.hollywoodreporter.com/business/business-news/david-ellison-wins-netflix-warner-bros-1236517313/",
    "timestamp": "2026-02-27T14:05:25Z"
  },
  {
    "title": "Trump Slammed After Posting AI Video Featuring US Hockey Player Insulting Another Country: 'That's Not Who I Am'",
    "description": "Donald Trump incited controversy with another AI-generated video after previously resharing a racist video that depicted the Obamas as apes. Shortly before the 79-year-old president delivered his State of the Union address with Team USA’s men’s hockey team in…",
    "link": "https://www.justjared.com/2026/02/27/trump-slammed-after-posting-ai-video-featuring-us-hockey-player-insulting-another-country-thats-not-who-i-am/",
    "timestamp": "2026-02-27T14:03:43Z"
  },
  {
    "title": "Friday, February 27, 2026",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/friday-february-27-2026/",
    "timestamp": "2026-02-27T14:00:16Z"
  },
  {
    "title": "Supreme Court blocks Trump tariffs—but hands him a smarter path forward",
    "description": "Donald Trump faces Supreme Court setback on tariff authority in Learning Services ruling, but strategic use of remaining trade powers could help America.",
    "link": "https://www.foxnews.com/opinion/supreme-court-blocks-trump-tariffs-but-hands-him-smarter-path-forward",
    "timestamp": "2026-02-27T14:00:13Z"
  },
  {
    "title": "Did poet Amanda Gorman 'confront' Trump in TV debate?",
    "description": "Gorman's alleged takedown of Trump mirrored other, similar false stories about celebrities reportedly confronting the president on TV.",
    "link": "https://www.snopes.com//fact-check/trump-amanda-gorman-tv-debate/",
    "timestamp": "2026-02-27T14:00:00Z"
  },
  {
    "title": "Timothy Snyder: Apocalypse Now, a Satire",
    "description": "Timothy Snyder left his endowed professorship at Yale University and is now ensconced at the University of Toronto, where he holds the inaugural Chair in Modern European History at the Munk School of Global Affairs and Public Policy. Snyder is known for his m…",
    "link": "https://dianeravitch.net/2026/02/27/timothy-snyder-apocalypse-now/",
    "timestamp": "2026-02-27T14:00:00Z"
  },
  {
    "title": "​No legal shield prevents Melania Trump from testifying in Epstein probe: expert",
    "description": "Testimony from Bill and Hillary Clinton as part of the congressional probe into the Jeffrey Epstein case opens the door for the current president and first lady to talk about their own ties to the late sex offender.Hillary Clinton told lawmakers Thursday that…",
    "link": "https://www.rawstory.com/melania-trump-epstein-no-shield/",
    "timestamp": "2026-02-27T13:56:05Z"
  },
  {
    "title": "Fox’s Brian Kilmeade Attacks ‘Embarrassment’ Republican Congressman: ‘He’s Got a Problem With the President’",
    "description": "Fox host Brian Kilmeade blasted Republican Congressman Thomas Massie as an \"embarrassment\" during a segment about the Jeffrey Epstein investigation on Friday, saying the lawmaker has \"got a problem with the president.\nThe post Fox’s Brian Kilmeade Attacks ‘Em…",
    "link": "https://www.mediaite.com/media/tv/foxs-brian-kilmeade-attacks-embarrassment-republican-congressman-hes-got-a-problem-with-the-president/",
    "timestamp": "2026-02-27T13:52:33Z"
  },
  {
    "title": "Ras Baraka Dresses Down MAGA Pundit Over Trump’s SOTU",
    "description": "On Wednesday (Feb. 25), Newark, New Jersey, Mayor Ras Baraka appeared on the most recent episode of Piers Morgan Uncensored as part of a panel discussing the State of the Union address given by President Donald Trump the night before. He wound up in a heated …",
    "link": "https://hiphopwired.com/3046975/ras-baraka-dresses-down-maga-pundit-over-trumps-sotu/",
    "timestamp": "2026-02-27T13:51:57Z"
  },
  {
    "title": "US moves to legally control tanker and 2M barrels of oil seized off Venezuela's coast in December",
    "description": "The Justice Department has filed a complaint to legally take ownership of a sanctioned tanker and nearly 2 million barrels of petroleum seized off the coast of Venezuela in December",
    "link": "https://abcnews.com/US/wireStory/us-moves-legally-control-tanker-2m-barrels-oil-130559083",
    "timestamp": "2026-02-27T13:49:44Z"
  },
  {
    "title": "A new Gallup poll shows how Americans’ sympathies have shifted in the Israeli-Palestinian conflict",
    "description": "The numbers reflect how support for Israel has become deeply contentious in the U.S.",
    "link": "https://www.denverpost.com/2026/02/27/israel-palestine-poll/",
    "timestamp": "2026-02-27T13:48:31Z"
  },
  {
    "title": "A new Gallup poll shows how Americans’ sympathies have shifted in the Israeli-Palestinian conflict",
    "description": "The numbers reflect how support for Israel has become deeply contentious in the U.S.",
    "link": "https://www.bostonherald.com/2026/02/27/israel-palestine-poll/",
    "timestamp": "2026-02-27T13:48:31Z"
  },
  {
    "title": "American hockey star who plays in Canada’s capital rips White House for sharing AI-doctored TikTok video",
    "description": "Brady Tkachuk criticized the fabricated audio. “I’m not in control of any of those accounts. … I know that those words would never come out of my mouth.”",
    "link": "https://fortune.com/2026/02/27/brady-tkachuk-doctored-ai-tiktok-video-canadian-slur-white-house/",
    "timestamp": "2026-02-27T13:48:14Z"
  },
  {
    "title": "FedEx says it will return to customers any refunds it gets back from Trump's illegal tariffs",
    "description": "Delivery company FedEx said in a statement on Thursday that it will return any tariff refund it might get to shippers and customers who paid them",
    "link": "https://www.nbcnews.com/business/business-news/fedex-says-will-return-customers-refunds-gets-back-trumps-illegal-tari-rcna260941",
    "timestamp": "2026-02-27T13:47:06Z"
  },
  {
    "title": "Trump Unleashes on “Extremely Low IQ” Robert De Niro After Emotional Speech!",
    "description": "President Donald Trump ignited fresh controversy this week with a series of fiery social media posts aimed at both political opponents and longtime celebrity critics. In a message shared on February 25, the president criticized Reps. Ilhan Omar and Rashida Tl…",
    "link": "https://mediatakeout.com/trump-unleashes-on-extremely-low-iq-robert-de-niro-after-emotional-speech/",
    "timestamp": "2026-02-27T13:46:00Z"
  },
  {
    "title": "Las inestables negociaciones de Trump",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/trump-tactics-cannot-produce-lasting-settlements-in-ukraine-or-iran-by-ana-palacio-2026-02/spanish",
    "timestamp": "2026-02-27T13:45:41Z"
  },
  {
    "title": "Trump’s Shaky Bargains",
    "description": "Positional bargaining might work for real-estate transactions, but it is woefully ill-suited to complex diplomatic challenges. Negotiations like those over the Ukraine war and Iran’s nuclear ambitions should aim not to settle the terms of a one-off exchange, …",
    "link": "https://www.project-syndicate.org/commentary/trump-tactics-cannot-produce-lasting-settlements-in-ukraine-or-iran-by-ana-palacio-2026-02",
    "timestamp": "2026-02-27T13:45:41Z"
  },
  {
    "title": "'Uhh…' Dem lawmaker puts Fox Business host on the spot over ICE killings",
    "description": "Rep. Ro Khanna (D-CA) put Fox Business’ Maria Bartiromo on the spot Friday over the killing of Alex Pretti last month by federal immigration officers, a killing that Bartiromo attempted to defend before being reminded of the concept of proportionality.Bartiro…",
    "link": "https://www.rawstory.com/ice-2675350147/",
    "timestamp": "2026-02-27T13:45:00Z"
  },
  {
    "title": "MAGA Activists Pushing Trump to ‘Declare National Emergency’ on Elections With ‘National Security’ Order",
    "description": "Trump has reportedly previewed a 17-page executive order draft that would see him declare a national emergency and put in place new restrictions on voting.\nThe post MAGA Activists Pushing Trump to ‘Declare National Emergency’ on Elections With ‘National Secur…",
    "link": "https://www.mediaite.com/media/news/maga-activists-pushing-trump-to-declare-national-emergency-on-elections-with-national-security-order/",
    "timestamp": "2026-02-27T13:42:28Z"
  },
  {
    "title": "‘I do not recall ever encountering Mr. Epstein’: Hillary Clinton claims ignorance",
    "description": "“Like every decent person,\" Hillary Clinton added in her opening statement, “I have been horrified by what we have learned about their crimes.”",
    "link": "https://fortune.com/2026/02/27/i-do-not-recall-ever-encountering-mr-epstein-hillary-clinton-claims-ignorance/",
    "timestamp": "2026-02-27T13:42:26Z"
  },
  {
    "title": "New Trump-backed retirement plan promises up to $1,000 match — here’s who may benefit",
    "description": "About 56 million Americans lack access to a workplace retirement plan in 2026. The Trump 401(k) plan aims to change that fast. President Donald Trump proposed a $1,000 federal retirement match for eligible workers. The plan targets low- and middle-income empl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/new-trump-backed-retirement-plan-promises-up-to-1000-match-heres-who-may-benefit/articleshow/128850056.cms",
    "timestamp": "2026-02-27T13:40:50Z"
  },
  {
    "title": "Paramount set to own Warner Brothers after \"superior\" bid over Netflix agreement",
    "description": "Paramount Skydance upped the ante with a bid valued at $111 billion in order to buy 100% of Warner Bros. Discovery. This is significantly higher than the initial $82.7 billion agreement between Netflix and WBD announced in December last year. Netflix refused …",
    "link": "https://www.notebookcheck.net/Paramount-set-to-own-Warner-Brothers-after-superior-bid-over-Netflix-agreement.1236521.0.html",
    "timestamp": "2026-02-27T13:36:00Z"
  },
  {
    "title": "Biden’s FBI Secretly Obtained Kash Patel And Susie Wiles’ Phone Records, But NYT Says It’s Cool",
    "description": "When Special Counsel Jack Smith was investigating Donald Trump and people in his orbit, he ended up surveilling then-private-citizen Kash Patel and Trump Chief of Staff Susie Wiles during 2022 and 2003.",
    "link": "https://www.shtfplan.com/headline-news/bidens-fbi-secretly-obtained-kash-patel-and-susie-wiles-phone-records-but-nyt-says-its-cool",
    "timestamp": "2026-02-27T13:30:52Z"
  },
  {
    "title": "ICE Abducts Then Releases Columbia Student After Mamdani Intervenes & Calls to Dismiss More Cases",
    "description": "Federal agents detained a Columbia University student early Thursday after Department of Homeland Security officers allegedly gained access to a university-owned residence by presenting a fake missing person poster of a 5-year-old. As news broke of the studen…",
    "link": "https://www.democracynow.org/2026/2/27/columbia_student",
    "timestamp": "2026-02-27T13:30:38Z"
  },
  {
    "title": "Exclusive analysis: we looked at the 400 western firms still in Russia. Their paltry size strips Putin’s bluff bare naked",
    "description": "Russia's \"paper bear\" economy fools Trump.",
    "link": "https://fortune.com/2026/02/27/exclusive-analysis-russian-economy-paper-bear-trump-putin-zelensky-talks-sonnenfeld-yale/",
    "timestamp": "2026-02-27T13:30:00Z"
  },
  {
    "title": "Nattie Says This WWE Champion Entertains Her But Is Also A Narcissist",
    "description": "Nattie admitted on \"Busted Open Radio\" that she's entertained by one WWE Champion, but there is a \"level of narcissism\" with the character.",
    "link": "https://www.wrestlinginc.com/2108342/wwe-nattie-becky-lynch-entertains-narcissist/",
    "timestamp": "2026-02-27T13:30:00Z"
  },
  {
    "title": "It's Time for the Media to Press Trump on Allegations of Abusing a Minor (Bill Scher/Washington Monthly)",
    "description": "Bill Scher / Washington Monthly:\nIt's Time for the Media to Press Trump on Allegations of Abusing a Minor  —  Never miss an article!  —  I was skeptical that the Jeffrey Epstein files would implicate President Donald Trump in illegal sexual abuse of a minor. …",
    "link": "https://www.memeorandum.com/260227/p27",
    "timestamp": "2026-02-27T13:30:00Z"
  },
  {
    "title": "Democrats should be ashamed of their immigration policies (Washington Examiner)",
    "description": "Washington Examiner:\nDemocrats should be ashamed of their immigration policies  —  It wasn't just a made-for-TV moment, it was engineered to go viral on social media.  Congressional Democrats insolently sitting on their hands after President Donald Trump aske…",
    "link": "https://www.memeorandum.com/260227/p29",
    "timestamp": "2026-02-27T13:30:00Z"
  },
  {
    "title": "Bill Clinton Faces Grilling From Lawmakers Over Epstein Ties",
    "description": "The former president's closed-door deposition comes a day after Hillary Clinton sat with lawmakers.",
    "link": "https://www.huffpost.com/entry/epstein-congress-bill-clinton_n_69a19918e4b022e3a5582690",
    "timestamp": "2026-02-27T13:28:20Z"
  },
  {
    "title": "Bill Clinton to finally face Epstein questions from Congress—behind closed doors, at home in Chappaqua",
    "description": "The closed-door deposition will mark the first time a former president has been compelled to testify to Congress.",
    "link": "https://fortune.com/2026/02/27/bill-clinton-jeffrey-epstein-first-deposition-to-congress-by-former-president/",
    "timestamp": "2026-02-27T13:26:34Z"
  },
  {
    "title": "Re-balancing India-US trade deal possible amid changed circumstances: Goyal",
    "description": "Piyush Goyal suggests potential re-balancing of the India-US trade deal as India evaluates opportunities amid changing circumstances.",
    "link": "https://www.thehindubusinessline.com/economy/re-balancing-india-us-trade-deal-possible-amid-changed-circumstances-goyal/article70684342.ece",
    "timestamp": "2026-02-27T13:24:15Z"
  }
]