[
  {
    "title": "US Fed Makes First Rate Cut Of 2025 Over Employment Risks",
    "description": "The US Federal Reserve on Wednesday lowered interest rates for the first time this year, flagging slower job gains and risks to employment as policymakers face heightened pressure under President Donald Trump.",
    "link": "https://www.ibtimes.com.au/us-fed-makes-first-rate-cut-2025-over-employment-risks-1860537",
    "timestamp": "2025-09-17T19:51:15Z"
  },
  {
    "title": "Patel fails to recognize the name of Charleston church shooter at House Judiciary hearing",
    "description": "FBI Director Kash Patel sat through another grueling congressional hearing on Wednesday, where he forgot about one of the more notable mass shootings and hate crimes in recent American history.",
    "link": "https://www.msnbc.com/top-stories/latest/kash-patel-dylann-roof-charleston-church-shooter-rcna231957",
    "timestamp": "2025-09-17T19:51:00Z"
  },
  {
    "title": "Trump's Threat to Let TikTok 'Go Dark' Pushed the US Deal Forward",
    "description": "President Trump’s willingness to let TikTok \"go dark\" was reportedly the key factor in securing a deal for the app’s U.S. operations.",
    "link": "https://www.androidheadlines.com/2025/09/trump-let-tiktok-us-go-dark-strategy-pushed-deal-forward.html",
    "timestamp": "2025-09-17T19:50:05Z"
  },
  {
    "title": "Trump Administration Unveils New US Citizenship Test. Could You Pass It?",
    "description": "These are some of the new questions that will be asked of those seeking naturalization.",
    "link": "https://www.newsweek.com/us-citizenship-naturalization-test-update-trump-administration-2131441",
    "timestamp": "2025-09-17T19:49:03Z"
  },
  {
    "title": "Kash Patel Roped Into Promising to Investigate Epstein Estate for Forgery Over Trump Birthday Note",
    "description": "FBI Director Kash Patel was baited into committing to investigating the Jeffrey Epstein estate for allegedly forging President Donald Trump's signature.\nThe post Kash Patel Roped Into Promising to Investigate Epstein Estate for Forgery Over Trump Birthday Not…",
    "link": "https://www.mediaite.com/politics/kash-patel-roped-into-promising-to-investigate-epstein-estate-for-forgery-over-trump-birthday-note/",
    "timestamp": "2025-09-17T19:48:41Z"
  },
  {
    "title": "Trump official hits Disney with threat over comedian's remarks: 'Easy way or hard way?'",
    "description": "FCC Chairman Brendan Carr issued a stern threat Wednesday over comedian Jimmy Kimmel's remarks that Charlie Kirk’s assassin was a MAGA conservative. \"This is a very, very serious issue right now for Disney,\" Carr said in an interview with conservative podcast…",
    "link": "https://www.rawstory.com/fcc-2674004111/",
    "timestamp": "2025-09-17T19:45:32Z"
  },
  {
    "title": "Canada to launch CUSMA consultations after U.S. ambassador says bigger deal not in the cards",
    "description": "Canada is expected to announce it's launching formal consultations on the CUSMA trade pact within the next week, after the Trump administration kicked off its own review.",
    "link": "https://www.cbc.ca/news/politics/canada-launch-consultations-north-american-trade-agreement-1.7636356",
    "timestamp": "2025-09-17T19:45:00Z"
  },
  {
    "title": "Trump hails 'highest honour of my life' at state banquet - as King references trade, Ukraine and environment",
    "description": "Donald Trump said being the first US president to enjoy a second British state visit was \"one of the highest honours of my life\", as he wined and dined with royalty at Windsor Castle.",
    "link": "https://news.sky.com/story/king-references-trade-ukraine-and-environmentalism-beside-trump-during-state-banquet-speech-13433022",
    "timestamp": "2025-09-17T19:43:00Z"
  },
  {
    "title": "Charlie Sheen Compares Charlie Kirk's Death to JFK's Assassination",
    "description": "Charlie Sheen compared the death of controversial conservative commentator Charlie Kirk to the 1963 assassination of President John F. Kennedy. “I think, for this generation, that’s their JFK moment,” Sheen, 60, predicted during an appearance on Piers Morgan …",
    "link": "https://www.usmagazine.com/celebrity-news/news/charlie-sheen-compares-charlie-kirks-death-to-jfks-assassination/#article",
    "timestamp": "2025-09-17T19:41:32Z"
  },
  {
    "title": "JD Vance Makes Crass Joke About (Potentially Illegal) Boat Strikes",
    "description": "The Trump administration is taking its recent assault on alleged drug boats from Venezuela very seriously—not.Recalling a recent conversation he had with War Department Secretary Pete Hegseth about the unprovoked air strikes in the Caribbean, Vice President J…",
    "link": "https://newrepublic.com/post/200594/jd-vance-joke-venezuela-boat-strikes-drugs",
    "timestamp": "2025-09-17T19:40:54Z"
  },
  {
    "title": "Kate Middleton stuns in glittering tiara moment for Trump's state visit at Windsor Castle",
    "description": "Kate Middleton wore a stunning tiara at a state banquet welcoming President Donald Trump and first lady Melania Trump during their official U.K. visit on Wednesday.",
    "link": "https://www.foxnews.com/entertainment/kate-middleton-stuns-glittering-tiara-moment-trump-state-visit-windsor-castle",
    "timestamp": "2025-09-17T19:40:41Z"
  },
  {
    "title": "Glenn Beck Chokes Up While Guest Hosting Charlie Kirk’s Show: ‘Surpassed Rush Limbaugh by Miles’",
    "description": "Glenn Beck emotionally gifted Rush Limbaugh's gold microphone to slain friend Charlie Kirk on Wednesday while guest hosting The Charlie Kirk Show\nThe post Glenn Beck Chokes Up While Guest Hosting Charlie Kirk’s Show: ‘Surpassed Rush Limbaugh by Miles’ first a…",
    "link": "https://www.mediaite.com/media/glenn-beck-chokes-up-while-guest-hosting-charlie-kirks-show-surpassed-rush-limbaugh-by-miles/",
    "timestamp": "2025-09-17T19:40:37Z"
  },
  {
    "title": "CNN Host Has Timely Reminder For Right-Wing Guests On Reactions To Charlie Kirk Killing",
    "description": "MAGA figures have accused \"the left\" of celebrating the death of Charlie Kirk, citing online posts criticizing the conservative personality.",
    "link": "https://www.huffpost.com/entry/abby-phillip-charlie-kirk-internet-reaction_n_68cadf0be4b0dcef14c47b8e",
    "timestamp": "2025-09-17T19:40:22Z"
  },
  {
    "title": "Fired CDC chief Susan Monarez warns senators that RFK Jr. is endangering public health",
    "description": "Fired Centers for Disease Control and Prevention chief Susan Monarez is warning senators America’s public health system is headed to a “dangerous place” under Health Secretary Robert F.",
    "link": "https://www.clickondetroit.com/health/2025/09/17/former-cdc-chief-susan-monarez-set-to-testify-rfk-jr-fired-her-over-vaccine-science/",
    "timestamp": "2025-09-17T19:39:47Z"
  },
  {
    "title": "Elizabeth Warren says there's a hidden reason why Trump wants to end companies' quarterly earnings requirement",
    "description": "\"It undermines transparency,\" Sen. Elizabeth Warren said of Trump's proposal. \"That is the whole point here.\"",
    "link": "https://www.businessinsider.com/elizabeth-warren-trump-sec-quarterly-earnings-2025-9",
    "timestamp": "2025-09-17T19:39:43Z"
  },
  {
    "title": "Queen Camilla appears to shoo Kate Middleton away from Melania Trump in awkward moment during state visit",
    "description": "The Princess of Wales got the message loud and clear.",
    "link": "https://nypost.com/2025/09/17/entertainment/queen-camilla-ushers-kate-middleton-away-from-melanie-trump-during-state-visit/",
    "timestamp": "2025-09-17T19:39:36Z"
  },
  {
    "title": "Kate Middleton is glowing in gold lace at UK state banquet with Trump",
    "description": "The Princess of Wales' full-length, hand-embroidered gold Chantilly lace evening coat shimmered with every flash of the camera.",
    "link": "https://pagesix.com/2025/09/17/style/princess-catherine-wore-tk-for-uk-state-dinner/",
    "timestamp": "2025-09-17T19:39:07Z"
  },
  {
    "title": "Kate Middleton is glowing in gold lace at UK state banquet with Trump",
    "description": "The Princess of Wales' full-length, hand-embroidered gold Chantilly lace evening coat shimmered with every flash of the camera.",
    "link": "https://pagesix.com/2025/09/17/style/princess-catherine-wears-phillipa-lepley-lace-for-uk-state-dinner/",
    "timestamp": "2025-09-17T19:39:07Z"
  },
  {
    "title": "Probe Reveals Nearly 3,000 Gaza Aid-Seekers Killed by Israeli Forces",
    "description": "An investigation published Wednesday revealed that Israeli forces have killed nearly 3,000 Palestinian aid-seekers and wounded almost 20,000 others over 23 months of Israel's US-backed genocidal annihilation of Gaza.The New Humanitarian's open-source investig…",
    "link": "https://www.commondreams.org/news/gaza-aid-seekers-killed-by-israel",
    "timestamp": "2025-09-17T19:38:20Z"
  },
  {
    "title": "Open Thread: Gawd Bless the Dropkick Murphys",
    "description": "Stevie Chick, in the Guardian — “‘This country’s gonna fall on its face. There’s nobody coming to save us’: Boston punks Dropkick Murphys take on Maga”: Backstage at the Rock la Cauze festival in Victoriaville, Canada, where Boston punk-rock institution Dropk…",
    "link": "https://balloon-juice.com/2025/09/17/open-thread-gawd-bless-the-dropkick-murphys/",
    "timestamp": "2025-09-17T19:38:16Z"
  },
  {
    "title": "Fed cuts rates by 25 bps as job market weakens, signals two more reductions in 2025",
    "description": "Fed cuts rates to 4.1%, its first since December, citing weak jobs. Powell signals more cuts as inflation stays high and Trump ramps up pressure on the Fed.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/fed-cuts-rates-by-25-bps-as-job-market-weakens-signals-two-more-reductions-in-2025/article70063035.ece",
    "timestamp": "2025-09-17T19:37:00Z"
  },
  {
    "title": "House Republicans Move to Strip Ilhan Omar of Committee Seats After Kirk Comments",
    "description": "U.S. House Republicans are moving to strip “Squad” Rep. Ilhan Omar (D-MN) from her committee assignments in response to incendiary comments she made about the murder of Charlie Kirk. Omar caused outrage last week after she declared Republicans are “full of s*…",
    "link": "https://freerepublic.com/focus/f-bloggers/4341111/posts",
    "timestamp": "2025-09-17T19:35:50Z"
  },
  {
    "title": "House Republicans Move to Strip Ilhan Omar of Committee Seats After Kirk Comments",
    "description": "U.S. House Republicans are moving to strip “Squad” Rep. Ilhan Omar (D-MN) from her committee assignments in response to incendiary comments she made about the murder of Charlie Kirk. Omar caused outrage last week after she declared Republicans are “full of s*…",
    "link": "https://freerepublic.com/focus/f-news/4341111/posts",
    "timestamp": "2025-09-17T19:35:50Z"
  },
  {
    "title": "Mike Alfred on contrarian investing, bitcoin mining, AI, and IREN",
    "description": "Mike Alfred joined the latest Mining Pod to discuss IREN, AI, neoclouds, bitcoin miners, and more.",
    "link": "https://blockspace.media/insight/mike-alfred-on-contrarian-investing-bitcoin-mining-ai-and-iren/",
    "timestamp": "2025-09-17T19:34:43Z"
  },
  {
    "title": "Trump arrives in UK for unprecedented second state visit",
    "description": "LONDON: US President Donald Trump arrived in Britain on Tuesday (Sep 16) for an unprecedented second state visit, with the UK government rolling out a royal red carpet welcome in hopes of deepening ties with the m",
    "link": "https://www.channelnewsasia.com/world/trump-arrives-in-uk-unprecedented-second-state-visit-5354921",
    "timestamp": "2025-09-17T19:34:18Z"
  },
  {
    "title": "Over 100 cyber professionals call for quick Kirsten Davies confirmation as DOD CIO",
    "description": "Davies was nominated in May and is scheduled to testify on Thursday.",
    "link": "https://www.nextgov.com/people/2025/09/over-100-cyber-professionals-call-quick-kirsten-davies-confirmation-dod-cio/408181/",
    "timestamp": "2025-09-17T19:34:00Z"
  },
  {
    "title": "UK King hosts Donald Trump at Windsor for historic state visit",
    "description": "US News: LONDON: US President Donald Trump and his wife Melania received the largest ceremonial welcome ever seen for a state visit in living memory on Wednesd.",
    "link": "https://timesofindia.indiatimes.com/world/us/uk-king-hosts-donald-trump-at-windsor-for-historic-state-visit/articleshow/123954966.cms",
    "timestamp": "2025-09-17T19:33:08Z"
  },
  {
    "title": "Turning Point USA expands its merchandise collection with items commemorating Charlie Kirk",
    "description": "Turning Point USA releases 11 new commemorative items ahead of Charlie Kirk's memorial service at State Farm Stadium in Arizona over the weekend.",
    "link": "https://www.foxnews.com/politics/turning-point-usa-expands-its-merchandise-collection-items-commemorating-charlie-kirk",
    "timestamp": "2025-09-17T19:30:56Z"
  },
  {
    "title": "Crypto execs met with US lawmakers to discuss Bitcoin reserve, market structure bills",
    "description": "US Republican lawmakers in the House of Representatives and Senate attended three roundtable discussions on crypto policy and laws with industry leaders this week.",
    "link": "https://cointelegraph.com/news/crypto-execs-bitcoin-reserve-market-structure-roundtable",
    "timestamp": "2025-09-17T19:30:33Z"
  },
  {
    "title": "Trump rips into ABC reporter after being asked about Pam Bondi's 'hate speech' remarks",
    "description": "President Donald Trump lashed out at ABC's Jonathan Karl on Tuesday over questions about Attorney General Pam Bondi's controversial comments on targeting hate speech.",
    "link": "https://www.foxnews.com/media/trump-slams-abc-news-jon-karl-after-he-questions-him-pam-bondis-hate-speech-comments",
    "timestamp": "2025-09-17T19:30:30Z"
  },
  {
    "title": "The Preventable Return of Deadly Diseases",
    "description": "The historian Kyle Harper on the history of plagues, the rise of anti-vaccination politics, and why measles is back in America",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/09/david-frum-show-kyle-harper-vaccines-infectious-diseases/684242/",
    "timestamp": "2025-09-17T19:30:00Z"
  },
  {
    "title": "Social media has us in its grip and won't let go. Charlie Kirk's killing is a case study",
    "description": "Videos of Kirk's assassination overwhelmed sites like X, TikTok and YouTube; in the aftermath, platforms became virtual battlegrounds.",
    "link": "https://richmond.com/life-entertainment/nation-world/technology/article_4a4ef5e4-9b7b-594c-a789-83f3699c16fb.html",
    "timestamp": "2025-09-17T19:30:00Z"
  },
  {
    "title": "The Irish Times view on Trump’s UK visit: a veneer of transatlantic unity",
    "description": "Efforts to present a united front may falter, depending on how far Trump is willing to push his own agenda",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/09/17/the-irish-times-view-on-trumps-uk-visit-a-veneer-of-transatlantic-unity/",
    "timestamp": "2025-09-17T19:30:00Z"
  },
  {
    "title": "Josh Hawley wants ICE agents to train at Ft. Leonard Wood",
    "description": "U.S. Sen. Josh Hawley also said he believes having the National Guard patrol St. Louis would be welcomed by many city residents.",
    "link": "https://www.stltoday.com/news/local/column/joe-holleman/article_dbd4bde8-85b0-4aae-b2a3-a82774b43305.html",
    "timestamp": "2025-09-17T19:30:00Z"
  },
  {
    "title": "Is Trump Ceding Leadership on Ukraine to Europe?",
    "description": "Divisions over Ukraine will resurface Thursday when President Donald Trump meets with UK Prime Minister Keir Starmer at the end of his state visit to Britain.",
    "link": "https://biztoc.com/x/93c0753eeda480a8",
    "timestamp": "2025-09-17T19:29:26Z"
  },
  {
    "title": "Bessent Made Contradictory Mortgage Pledges Like Lisa Cook",
    "description": "US Treasury Secretary Scott Bessent once agreed to occupy two different houses as his “principal residence” at the same time, mortgage documents show — the same kind of contradictory pledges that President Donald Trump has been using to try to oust Federal Re…",
    "link": "https://biztoc.com/x/9ed17c4212bbe078",
    "timestamp": "2025-09-17T19:29:00Z"
  },
  {
    "title": "Trump administration reportedly issues absurd demands to UCLA",
    "description": "President Donald Trump’s administration appears to be demanding full capitulation to a bevy of far-right demands as part of a proposed settlement with the University of California, Los Angeles over claims involving antisemitism and civil rights.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-ucla-settlement-antisemitism-columbia-berkeley-rcna231950",
    "timestamp": "2025-09-17T19:27:20Z"
  },
  {
    "title": "LISTEN: Spirit Airline Pilots Rebuked by Air Traffic Controller for Flying Too Close to Air Force One: ‘Get Off the iPad!’",
    "description": "‘Pay attention!’, Spirit Airline pilots are told. The crew of a passenger jet was reprimanded for taking a flight course too close to Air Force One and for taking too long to adjust direction. The incident occurred over Long Island, and President Donald J. Tr…",
    "link": "https://freerepublic.com/focus/f-chat/4341108/posts",
    "timestamp": "2025-09-17T19:25:59Z"
  },
  {
    "title": "Is Trump Ceding Leadership on Ukraine to Europe?",
    "description": "Divisions over Ukraine will resurface Thursday when President Donald Trump meets with UK Prime Minister Keir Starmer at the end of his state visit to Britain.",
    "link": "https://www.newsweek.com/trump-ceding-leadership-ukraine-europe-2131493",
    "timestamp": "2025-09-17T19:24:42Z"
  },
  {
    "title": "Kash Patel Recites ABCs To Avoid Answering Epstein Files Question",
    "description": "The FBI director took great pains to avoid answering a direct question about Donald Trump's connection to the Jeffrey Epstein files on Wednesday.",
    "link": "https://www.huffpost.com/entry/kash-patel-recites-abcs-to-avoid-epstein-files-question_n_68caea74e4b09bac8c7ec3f5",
    "timestamp": "2025-09-17T19:21:29Z"
  },
  {
    "title": "Tariffs Pushing Up Prices, But Wider Impact Unclear, Says Fed Chair Powell",
    "description": "The tariffs imposed by US President Donald Trump on most trading partners are pushing up the prices, but their wider impact is still unclear, according to US Federal Reserve Chair Jerome Powell. Powell's remarks came in a press briefing, following the Federal…",
    "link": "https://www.ndtvprofit.com/global-economics/tariffs-pushing-up-prices-but-wider-impact-unclear-says-powell-after-fed-ratecut",
    "timestamp": "2025-09-17T19:20:06Z"
  },
  {
    "title": "Federal Reserve cuts key rate by quarter-point and signals two more cuts this year",
    "description": "The Federal Reserve cut its key interest rate by a quarter-point Wednesday and projected it would do so twice more this year as concern grows at the central bank about the health of the nation’s labor market",
    "link": "https://www.wsbtv.com/news/federal-reserve-cuts/MXWEKVMJANBYDKSS4R4TCYXTJI/",
    "timestamp": "2025-09-17T19:19:32Z"
  },
  {
    "title": "Obama Implies Trump to Blame for Charlie Kirk Assassination: ‘Extreme Views Were Not in My White House”",
    "description": "Former President Barack Obama implied Tuesday that President Donald Trump was to blame for Charlie Kirk’s assassination, because of “extreme” personnel and policies that aroused violent opposition. Obama was interviewed onstage by Steve Scully at the Jefferso…",
    "link": "https://freerepublic.com/focus/f-news/4341107/posts",
    "timestamp": "2025-09-17T19:18:52Z"
  },
  {
    "title": "Obama Implies Trump to Blame for Charlie Kirk Assassination: ‘Extreme Views Were Not in My White House",
    "description": "Former President Barack Obama implied Tuesday that President Donald Trump was to blame for Charlie Kirk’s assassination, because of “extreme” personnel and policies that aroused violent opposition. Obama was interviewed onstage by Steve Scully at the Jefferso…",
    "link": "https://freerepublic.com/focus/f-backroom/4341107/posts",
    "timestamp": "2025-09-17T19:18:52Z"
  },
  {
    "title": "Starmer-Trump talks could be landmark moment - and join pantheon of UK-US summits",
    "description": "Sir Keir Starmer is set to meet Donald Trump today for what could be a monumental moment. But what does history tell us about past meetings, and what can the PM learn?",
    "link": "https://news.sky.com/story/starmer-trump-talks-could-be-landmark-moment-and-join-pantheon-of-uk-us-summits-13433006",
    "timestamp": "2025-09-17T19:18:00Z"
  },
  {
    "title": "Arizona highway could honor Charlie Kirk after assassination rocks conservative movement",
    "description": "State Route 202 in Arizona could be renamed to honor Charlie Kirk after his assassination at Utah Valley University, with legislation planned for the next session.",
    "link": "https://www.foxnews.com/politics/arizona-highway-could-honor-charlie-kirk-after-assassination-rocks-conservative-movement",
    "timestamp": "2025-09-17T19:16:01Z"
  },
  {
    "title": "PM turns 75, lauds rise of New India as world leaders",
    "description": "STATE TIMES NEWS NEW DELHI: Prime Minister Narendra Modi turned 75 on Wednesday with a host of prominent personalities, including world leaders, lauding his leadership, while the ruling BJP organised welfare initiatives under the fortnight-long “Sewa Pakhwada…",
    "link": "https://statetimes.in/pm-turns-75-lauds-rise-of-new-india-as-world-leaders/",
    "timestamp": "2025-09-17T19:15:43Z"
  },
  {
    "title": "Operation against terrorists not suspended due to intervention of anyone: Rajnath",
    "description": "STATE TIMES NEWS Hyderabad: Defence Minister Rajnath Singh on Wednesday virtually rejected US President Donald Trump’s claims of intervening to stop the Indo-Pak conflict following Operation Sindoor, saying the action against terrorists was not suspended due …",
    "link": "https://statetimes.in/operation-against-terrorists-not-suspended-due-to-intervention-of-anyone-rajnath/",
    "timestamp": "2025-09-17T19:14:06Z"
  },
  {
    "title": "World’s Sorest Winner: Trump Demands $15 Billion From NY Times For Not Fluffing His Ego Enough",
    "description": "Even by Donald Trumps standards for frivolous defamation lawsuits, this one is impressively stupid. On Monday, the president filed yet another lawsuit against the NY Times—this time seeking $15 billion over a book that claims hes not quite as successful a bus…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179328640",
    "timestamp": "2025-09-17T19:12:04Z"
  },
  {
    "title": "GOP’s Emmer Hails DC Anti-Crime Bills Passed by House, Urges Support for Trump’s Larger Crackdown",
    "description": "House Majority Whip Tom Emmer, the third-ranking Republican in the House, is calling on Congress to back President Donald Trump’s Washington, D.C., public safety crackdown... Read More\nThe post GOP’s Emmer Hails DC Anti-Crime Bills Passed by House, Urges Supp…",
    "link": "https://www.dailysignal.com/2025/09/17/whip-emmer-calls-congress-back-trumps-dc-crackdown/",
    "timestamp": "2025-09-17T19:10:48Z"
  },
  {
    "title": "Fed delivers the first interest rate cut of Trump’s second term",
    "description": "The Federal Reserve on Wednesday lowered interest rates for the first time since December to support America's faltering labor market.",
    "link": "https://www.abc12.com/news/business/fed-delivers-the-first-interest-rate-cut-of-trump-s-second-term/article_cd41237b-1204-5cea-b68a-a04613698b0b.html",
    "timestamp": "2025-09-17T19:10:42Z"
  },
  {
    "title": "Ron Paul on High Crimes on the High Seas",
    "description": "On today’s Ron Paul Liberty Report: President Trump is bragging about blowing up a third boat in international waters near Venezuela, claiming they are loaded with US-bound drugs and are commandeered by “narco-terrorists.” His own Drug Enforcement Administrat…",
    "link": "https://www.antiwar.com/blog/2025/09/17/ron-paul-on-high-crimes-on-the-high-seas/",
    "timestamp": "2025-09-17T19:10:20Z"
  },
  {
    "title": "Trump basks in the pageantry at Windsor Castle during second UK state visit",
    "description": "President Donald Trump relished the glow of a British royal spectacle Wednesday, greeted at Windsor Castle on his state visit by King Charles III, military honor guards and mounted troops.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_6eab8804-75e6-509c-9aa9-7dec26b683fd.html",
    "timestamp": "2025-09-17T19:10:00Z"
  },
  {
    "title": "JUST IN: Trump FCC Chair Threatens ABC With Punishment Over Jimmy Kimmel’s Charlie Kirk Comments",
    "description": "FCC Chair Brendan Carr threatened Jimmy Kimmel over his \"concerted effort to lie to the American people\" by claiming Charlie Kirk's killer was a Trump supporter\nThe post JUST IN: Trump FCC Chair Threatens ABC With Punishment Over Jimmy Kimmel’s Charlie Kirk C…",
    "link": "https://www.mediaite.com/media/news/just-in-trump-fcc-chair-threatens-abc-with-punishment-over-jimmy-kimmels-charlie-kirk-comments/",
    "timestamp": "2025-09-17T19:09:38Z"
  },
  {
    "title": "JD Vance Says He Would Not Be VP If It Weren’t For Charlie Kirk",
    "description": "Vice President J.D. Vance honored Turning Point USA founder Charlie Kirk's legacy by saying that he would not be vice president without his activism.",
    "link": "https://dailycaller.com/2025/09/17/jd-vance-charlie-kirk-turning-point-usa/",
    "timestamp": "2025-09-17T19:08:15Z"
  },
  {
    "title": "Japan’s exports to U.S. fall for fifth-straight month, plummeting 13.8% in August",
    "description": "Auto exports were especially hit by President Donald Trump’s tariffs.",
    "link": "https://fortune.com/2025/09/17/japan-exports-to-us-fall-fifth-straight-month-august-plummet-auto-tariffs/",
    "timestamp": "2025-09-17T19:08:12Z"
  },
  {
    "title": "China's Tech Stocks Just Went Parabolic -- And Wall Street Is Watching",
    "description": "A seven-week AI-fueled rally, jaw-dropping capex, and Trump-Xi talks are reigniting investor frenzy in China tech",
    "link": "https://finance.yahoo.com/news/chinas-tech-stocks-just-went-190800652.html",
    "timestamp": "2025-09-17T19:08:00Z"
  },
  {
    "title": "‘South Park’ Has Always Been Made and Released Unusually, but Missing a Deadline Is Bizarre Even for Them",
    "description": "\"This one's on us,\" Matt Stone and Trey Parker said, the latest twist in a strange semi-weekly release schedule on Comedy Central.",
    "link": "https://www.indiewire.com/news/analysis/south-park-missing-deadline-bizarre-analysis-1235151792/",
    "timestamp": "2025-09-17T19:07:57Z"
  },
  {
    "title": "'Squad' member, Nancy Mace clash on social media: 'You belong in rehab'",
    "description": "Rep. Nancy Mace told Rep. Ilhan Omar that 'maybe Somalia can take you back' amid censure resolution over Omar's remarks about Charlie Kirk's assassination.",
    "link": "https://www.foxnews.com/politics/squad-member-nancy-mace-clash-social-media-you-belong-rehab",
    "timestamp": "2025-09-17T19:06:52Z"
  },
  {
    "title": "Federal Reserve cuts US interest rates for first time since December",
    "description": "Central bank moves to set rates at range between 4 and 4.25% but decision unlikely to satisfy Donald Trump\nThe US Federal Reserve cut interest rates on Wednesday, its first rate cut since December, as the central bank moved to stabilize a wobbling labor marke…",
    "link": "https://biztoc.com/x/2fc0ad665e70c7d8",
    "timestamp": "2025-09-17T19:06:45Z"
  },
  {
    "title": "World’s Sorest Winner: Trump Demands $15 Billion From NY Times For Not Fluffing His Ego Enough",
    "description": "Even by Donald Trump’s standards for frivolous defamation lawsuits, this one is impressively stupid. On Monday, the president filed yet another lawsuit against the NY Times—this time seeking $15 billion over a book that claims he’s not quite as successful a b…",
    "link": "https://www.techdirt.com/2025/09/17/worlds-sorest-winner-trump-demands-15-billion-from-ny-times-for-not-fluffing-his-ego-enough/",
    "timestamp": "2025-09-17T19:05:29Z"
  },
  {
    "title": "Israeli Minister Smotrich Calls Gaza “Real Estate Bonanza” Amid Talks With US",
    "description": "“We paid a lot of money for the war, so we need to decide how to divide the percentages of the land,” said Smotrich.",
    "link": "https://truthout.org/articles/israeli-minister-smotrich-calls-gaza-real-estate-bonanza-amid-talks-with-us/",
    "timestamp": "2025-09-17T19:05:09Z"
  },
  {
    "title": "Here's What Happened Today: Wednesday",
    "description": "Daniel Aruebose remembered by his foster sister as remains discovered, man charged with 2010 murder in Limerick, and Trump arrives in the UK.",
    "link": "https://www.thejournal.ie/news-fix-17-09-25-6819644-Sep2025/",
    "timestamp": "2025-09-17T19:05:01Z"
  },
  {
    "title": "Is hate speech still protected speech?",
    "description": "Pam Bondi's threat to target hate speech raises concerns",
    "link": "https://theweek.com/politics/hate-speech-protected-speech-bondi-trump-administration",
    "timestamp": "2025-09-17T19:04:47Z"
  },
  {
    "title": "Las Vegas casinos threatened for honoring Charlie Kirk; 26-year-old faces charges",
    "description": "A man is accused of threatening employees at a Las Vegas casino and hotel company, including its CEO, after it honored slain conservative activist Charlie...",
    "link": "https://www.8newsnow.com/investigators/las-vegas-casinos-threatened-for-honoring-charlie-kirk-26-year-old-faces-charges/",
    "timestamp": "2025-09-17T19:03:36Z"
  },
  {
    "title": "Wall Street Sees Muted Response To Fed Decision",
    "description": "A widely anticipated Federal Reserve rate cut elicited a muted reaction across Wall Street, with stocks and bonds fluctuating after policymakers largely validated expectations for gradual easing.\nThe policy pivot took place as officials try to backstop labor-…",
    "link": "https://www.ndtvprofit.com/markets/stocks-bonds-rise-as-fed-signals-more-cuts-markets-wrap",
    "timestamp": "2025-09-17T19:02:01Z"
  },
  {
    "title": "Venezuela Claims Evidence of Drug Trafficking a 'Hollywood' Lie in Five-Page Rant",
    "description": "Venezuela's socialist regime released a five-page statement on Tuesday rejecting President Donald Trump's determination designating Venezuela and other countries as failing to cooperate in efforts to fight drug trafficking.\nThe post Venezuela Claims Evidence …",
    "link": "https://www.breitbart.com/latin-america/2025/09/17/venezuela-claims-evidence-of-drug-trafficking-a-hollywood-lie-in-five-page-rant/",
    "timestamp": "2025-09-17T19:01:40Z"
  },
  {
    "title": "Coffee Drinkers In For A Jolt As Tariff Repercussions Begin To Affect Prices",
    "description": "",
    "link": "https://www.benzinga.com/personal-finance/management/25/09/47721406/coffee-drinkers-in-for-a-jolt-as-tariff-repercussions-begin-to-affect-prices",
    "timestamp": "2025-09-17T19:01:09Z"
  },
  {
    "title": "Jimmy Fallon Zings Trump In England With A Jolly Good Epstein Jab",
    "description": "The “Tonight Show” host continued to poke fun at the president over the unresolved scandal.",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-prince-andrew-donald-trump-jeffrey-epstein_n_68caecaae4b04c3d8db2ee26",
    "timestamp": "2025-09-17T19:01:02Z"
  },
  {
    "title": "How the British royal family is lavishing Trump with dazzling pomp and circumstance on his historic state visit",
    "description": "From a 1,300-soldier-strong military ceremony — complete with a time-honored 41 gun salute — to a glittering white-tie banquet,  the country is working to court America's president as a host of international crises simmer.",
    "link": "https://nypost.com/2025/09/17/world-news/how-the-british-royal-family-is-buttering-up-trump-with-dazzling-pomp-and-circumstance-on-his-historic-state-visit/",
    "timestamp": "2025-09-17T19:00:50Z"
  },
  {
    "title": "‘Bullsh*t’: Kash Patel Erupts At Eric Swalwell During Heated Hearing Exchange",
    "description": "Kash Patel erupted at Eric Swalwell on Wednesday while facing questions on deceased pedophile Jeffrey Epstein and alleged weaponization of government.",
    "link": "https://dailycaller.com/2025/09/17/bullsht-kash-patel-erupts-eric-swalwell-during-heated-hearing-exchange/",
    "timestamp": "2025-09-17T19:00:22Z"
  },
  {
    "title": "Denmark Held One of Largest Ever Military Exercises in Greenland. USA Was Left Out...",
    "description": "The military exercise comes amid security concerns over Russia's Arctic influence, and amid claims to the island by Donald Trump",
    "link": "https://time.com/7318044/trump-denmark-greenland-military-exercise-nato/",
    "timestamp": "2025-09-17T19:00:03Z"
  },
  {
    "title": "Top Republican Calls Out GOP Colleague For Wild Claim: Show Us Docs Or ‘Retract’ Questions",
    "description": "\"How does it happen, if it is true, that one senator has access to an alleged tape recording of a meeting? Nobody else has it, including the chairman.\"\nThe post Top Republican Calls Out GOP Colleague For Wild Claim: Show Us Docs Or ‘Retract’ Questions first a…",
    "link": "https://www.mediaite.com/politics/top-republican-calls-out-gop-colleague-for-wild-claim-show-us-docs-or-retract-questions/",
    "timestamp": "2025-09-17T18:55:05Z"
  },
  {
    "title": "Obama says the US is at ‘an inflection point’ after Kirk’s killing and Trump has divided the country",
    "description": "Former President Barack Obama says the U.S. is at an \"inflection point\" after conservative activist Charlie Kirk's assassination",
    "link": "https://abcnews.go.com/US/wireStory/obama-us-inflection-point-after-kirks-killing-trump-125670157",
    "timestamp": "2025-09-17T18:54:27Z"
  },
  {
    "title": "End Quarterly Earnings Forecasts But Not Quarterly Reporting",
    "description": "By halving SEC reporting, Trump claims to reduce burdens. In reality, the move risks hiding financial risks and curbing investor transparency.",
    "link": "https://www.forbes.com/sites/michaelposner/2025/09/17/end-quarterly-earnings-forecasts-but-not-quarterly-reporting/",
    "timestamp": "2025-09-17T18:53:00Z"
  },
  {
    "title": "Trump's mental health questioned after he claims 300 million people died last year - NewsBreak",
    "description": "Donald Trump made the bizarre claim during a press conference on Sunday, and it's unclear where he got the number from, as the US population is only 340 mi",
    "link": "https://www.newsbreak.com/share/4235031023953-trump-s-mental-health-questioned-after-he-claims-300-million-people-died-last-year?s=a2&amp;share_destination_id=MjQ4MjY4MjU0LTE3NTgxMzMwNzQ5NDI%3D&amp;pd=0GnhugZj&amp;hl=en_US&amp;send_time=1758133074&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.34.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control%2Csc_android_comment_share_v3-v2",
    "timestamp": "2025-09-17T18:50:41Z"
  },
  {
    "title": "Trump's mental health questioned after he claims 300 million people died last year - NewsBreak",
    "description": "Donald Trump made the bizarre claim during a press conference on Sunday, and it's unclear where he got the number from, as the US population is only 340 mi",
    "link": "https://www.newsbreak.com/share/4235031023953-news?pd=0LrZW9uq&amp;lang=en_US&amp;s=i2&amp;_f=app_share&amp;send_time=1758133004&amp;gen_by=ios",
    "timestamp": "2025-09-17T18:49:59Z"
  },
  {
    "title": "James Comer Invites Tech CEOs to Testify on Radicalization of Online Forums",
    "description": "House Oversight Committee Chairman James Comer (R-KY) on Wednesday invited tech CEOs to testify about potential radicalization of online forums.\nThe post James Comer Invites Tech CEOs to Testify on Radicalization of Online Forums appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/17/james-comer-invites-tech-ceos-to-testify-on-radicalization-of-online-forums/",
    "timestamp": "2025-09-17T18:49:24Z"
  },
  {
    "title": "Manchin Urges Democrats to End Their Quest for 'Raw Political Power'",
    "description": "Wednesday on Fox Business Network's \"Mornings with Maria,\" former Sen. Joe Manchin (I-WV) reiterated his call from his memoir for Democrats to end their quest for so-called \"raw political power.\"\nThe post Manchin Urges Democrats to End Their Quest for ‘Raw Po…",
    "link": "https://www.breitbart.com/clips/2025/09/17/manchin-urges-democrats-to-end-their-quest-for-raw-political-power/",
    "timestamp": "2025-09-17T18:48:39Z"
  },
  {
    "title": "Disney Pressured To Fire Jimmy Kimmel After Charlie Kirk Remarks",
    "description": "Disney is facing mounting pressure to take action against late-night host Jimmy Kimmel after his controversial comments about Charlie Kirk’s assassination. What began as a monologue on Jimmy Kimmel Live! has turned into a political and cultural flashpoint, wi…",
    "link": "https://insidethemagic.net/2025/09/disney-pressured-to-fire-jimmy-kimmel-after-charlie-kirk-remarks-ab1/",
    "timestamp": "2025-09-17T18:47:12Z"
  },
  {
    "title": "Bitcoin is up around 100% over the past year, but is it worth adding to your retirement account? What experts say",
    "description": "Financial pros are warming up to the idea of investing in digital assets in retirement accounts. They just recommend setting up a few guardrails first.",
    "link": "https://www.cnbc.com/2025/09/17/what-experts-say-about-adding-crypto-to-retirement-savings-accounts.html",
    "timestamp": "2025-09-17T18:47:00Z"
  },
  {
    "title": "Tianjin RIC huddle a wakeup call for US",
    "description": "The informal Russia-India-China (RIC) huddle in Tianjin during the SCO summit, led by PM Narendra Modi, is seen as a catalyst in easing Indo-US tensions, prompting President Trump to soften tariff threats and revive trade talks.",
    "link": "https://economictimes.indiatimes.com/news/india/tianjin-ric-huddle-a-wakeup-call-for-us/articleshow/123954060.cms",
    "timestamp": "2025-09-17T18:46:36Z"
  },
  {
    "title": "Man in custody admits to covering for real Kirk shooter – police",
    "description": "George Zinn has admitted to falsely claiming to be the shooter to allow the actual one to flee, the authorities have said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624827-another-suspect-arrested-charlie-kirk-assassination/",
    "timestamp": "2025-09-17T18:46:16Z"
  },
  {
    "title": "Australia's 2035 climate target will strike a middle path. Will it be enough?",
    "description": "Australia's next major climate commitment will be above the ambitions of New Zealand and Canada, but below the United Kingdom, as the government strikes a middle path in pursuit of both an \"ambitious\" but \"achievable\" 2035 target.",
    "link": "https://www.abc.net.au/news/2025-09-18/2035-climate-emissions-target-middle-path/105782220",
    "timestamp": "2025-09-17T18:45:37Z"
  },
  {
    "title": "DOJ no longer highlighting flawed study insinuating right-wing violence is on the rise",
    "description": "As President Donald Trump explained in the wake of the political assassination of Charlie Kirk last week, many of the loudest voices in politics and media have consistently appealed to the rising danger of \"far-right extremism.\" Some, including the president,…",
    "link": "https://www.theblaze.com/news/doj-no-longer-highlighting-flawed-study-insinuating-right-wing-violence-is-on-the-rise",
    "timestamp": "2025-09-17T18:45:00Z"
  },
  {
    "title": "Flashback: Donald Trump's U.K. Visit Resurfaces Embarrassing Moment When Prez 'Roasted' Late Queen",
    "description": "Donald Trump's second state U.K. visit unearthed ex-President George W. Bush's gaffe while welcoming the late Queen Elizabeth to D.C. in 2007.",
    "link": "https://radaronline.com/p/donald-trump-uk-king-charles-queen-elizabeth-ii-roasted-george-w-bush/",
    "timestamp": "2025-09-17T18:45:00Z"
  },
  {
    "title": "Things Are Getting Incredibly Heated On Capitol Hill After Charlie Kirk's Murder",
    "description": "The House could vote on dueling censure resolutions Wednesday evening.",
    "link": "https://www.huffpost.com/entry/nancy-mace-ilhan-omar-censure-resolution_n_68cae489e4b0dc3c956bffe7",
    "timestamp": "2025-09-17T18:43:29Z"
  },
  {
    "title": "Doctors for Brazil's Bolsonaro say early-stage cancer detected in his skin lesions",
    "description": "Doctors for former President Jair Bolsonaro say they have detected early-stage cancer in skin lesions removed over the weekend from the 70-year-old politician following his conviction last week on attempted coup charges",
    "link": "https://abcnews.go.com/International/wireStory/doctors-brazils-bolsonaro-early-stage-cancer-detected-skin-125677218",
    "timestamp": "2025-09-17T18:42:50Z"
  },
  {
    "title": "Right-wing extremist violence is more frequent and more deadly than left-wing violence − what the data shows",
    "description": "Donald Trump and top administration officials confidently assert that left-wing political violence is a huge problem in the US. They’re wrong, say researchers who study extremism.",
    "link": "https://theconversation.com/right-wing-extremist-violence-is-more-frequent-and-more-deadly-than-left-wing-violence-what-the-data-shows-265367",
    "timestamp": "2025-09-17T18:42:15Z"
  },
  {
    "title": "House Dem gets Patel to agree to probe 'forged' Trump doodle to Epstein",
    "description": "Rep. Jared Moskowitz (D-FL) got FBI Director Kash Patel to agree to investigate who created the image and comments attributed to President Donald Trump in the birthday book for accused child trafficker Jeffrey Epstein. Questioning Patel before the House Judic…",
    "link": "https://www.rawstory.com/trump-epstein-birthday-book/",
    "timestamp": "2025-09-17T18:41:03Z"
  },
  {
    "title": "Trump’s TikTok Deal Could Still Leave Americans Hooked On Chinese Propaganda Drip",
    "description": "President Trump extended TikTok’s sell-or-ban deadline to Dec. 16 on Tuesday while touting a framework that would keep the app tethered to a Chinese algorithm.",
    "link": "https://dailycaller.com/2025/09/17/donald-trump-tiktok-deal-us-acquisition-chinese-algorithm-propaganda-bytedance/",
    "timestamp": "2025-09-17T18:41:03Z"
  },
  {
    "title": "Can FBI Release Full Epstein Files? Why Kash Patel’s Claims Are Misleading",
    "description": "The FBI director suggested court orders are keeping documents hidden—but even the judge who issued one of those rulings said the Trump administration should release files itself.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/09/17/can-fbi-release-full-epstein-files-why-kash-patels-claims-are-misleading/",
    "timestamp": "2025-09-17T18:39:56Z"
  },
  {
    "title": "Trump’s deputy AG eyes federal investigations into ‘organized’ Trump protesters",
    "description": "Donald Trump asked for an investigation into protesters who heckled him at a restaurant. His deputy attorney general, Todd Blanche, is amenable to the request.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-deputy-ag-eyes-federal-investigations-organized-trump-protester-rcna231873",
    "timestamp": "2025-09-17T18:39:47Z"
  },
  {
    "title": "Tesla under investigation after parents say faulty door handles trapped their kids in the back",
    "description": "The NHTSA said the probe is focused on 2021 Tesla Model Ys after receiving nine reports of door handles not working possibly due to low battery voltage.",
    "link": "https://fortune.com/2025/09/17/tesla-elon-musk-investigation-tech-auto-car-handle-traps-kids-parents-driving-model-y-cybertruck-billionaire-electric-vehicle-law/",
    "timestamp": "2025-09-17T18:39:00Z"
  },
  {
    "title": "Patel spars with House Democrats on allegations he's involved in Epstein 'cover-up': 'Categorically false'",
    "description": "FBI Director Kash Patel ripped House Democrats for suggesting the bureau could legally release more information on the Jeffrey Epstein case.",
    "link": "https://www.foxnews.com/politics/patel-spars-house-democrats-allegations-hes-involved-epstein-cover-up-categorically-false",
    "timestamp": "2025-09-17T18:38:51Z"
  },
  {
    "title": "Army veteran who burned U.S. flag near White House pleads not guilty to federal charges",
    "description": "An Army veteran who set fire to an American flag near the White House to protest President Donald Trump’s recent executive order on flag burning has pleaded not guilty to federal criminal charges.",
    "link": "https://www.pbs.org/newshour/politics/army-veteran-who-burned-u-s-flag-near-white-house-pleads-not-guilty-to-federal-charges",
    "timestamp": "2025-09-17T18:38:36Z"
  }
]