[
  {
    "title": "Can Arabs stop Trump’s Gaza displacement proposal?",
    "description": "Some Arab leaders have met to discuss an alternative plan for the Strip devastated by 15 months of Israeli war.",
    "link": "https://www.aljazeera.com/program/inside-story/2025/2/22/can-arabs-stop-trumps-gaza-displacement-proposal",
    "timestamp": "2025-02-22T19:17:47Z"
  },
  {
    "title": "Trump Moves with Light Speed and Brute Force",
    "description": "“President Donald Trump is moving with light speed and brute force to break the existing order and reshape America at home and abroad. He likes the ring of calling himself king,” the AP reports. “No",
    "link": "https://politicalwire.com/2025/02/22/trump-moves-with-light-speed-and-brute-force/",
    "timestamp": "2025-02-22T19:15:08Z"
  },
  {
    "title": "Mark Cuban: Democrats Are Too Inept to Exploit Trump’s Chaos",
    "description": "“I learned the Democrats can’t sell worth shit,\" Mark Cuban said at a conference of anti-Trump Republicans.",
    "link": "https://time.com/7260685/mark-cuban-democrats-trump/",
    "timestamp": "2025-02-22T19:14:48Z"
  },
  {
    "title": "Trump’s UN Ambassador Elise Stefanik Calls for a Global DOGE",
    "description": "Editor’s note: Following are the lightly edited remarks of Rep. Elise Stefanik at the Conservative Political Action Conference in Oxon Hill, Maryland, on Feb. 22.... Read More\nThe post Trump’s UN Ambassador Elise Stefanik Calls for a Global DOGE appeared firs…",
    "link": "https://www.dailysignal.com/2025/02/22/trumps-un-ambassador-elise-stefanik-calls-for-a-global-doge/",
    "timestamp": "2025-02-22T19:13:17Z"
  },
  {
    "title": "Billboard Promoting Alberta As 51st State Sparks Angry Backlash",
    "description": "A recent Reddit post sparked widespread angry responses on social media. It also had the phone lines to the Alberta town flooded with even more irate calls and e-mails demanding that the offensive billboard be taken down. As the mayor later explained, althoug…",
    "link": "https://crooksandliars.com/2025/02/billboard-promoting-alberta-51st-state",
    "timestamp": "2025-02-22T19:13:08Z"
  },
  {
    "title": "Rachel Maddow: Trump's Honeymoon Polls Are Shockingly Bad",
    "description": "MSNBC's Rachel Maddow looked at the recent polling data from Gallup and other pollsters and found Donald Trump's low showing this early in his honeymoon is shocking.\nAll those MAGAts and Republicans claiming Trump has a mandate with Americans are just lying.\n…",
    "link": "https://crooksandliars.com/2025/02/rachel-maddow-trumps-honeymoon-polls-are",
    "timestamp": "2025-02-22T19:12:36Z"
  },
  {
    "title": "2/22/25 National Security and Korean News and Commentary",
    "description": "Access National Security News HERE. Access Korean News HERE. National Security News Content: 1. Trump Fires Top Pentagon Officers in Sweeping Overhaul 2. Dan Caine, Trump’s Joint Chiefs Pick, Had Unusual Path to Top Ranks 3. White House and Ukraine Close In o…",
    "link": "https://smallwarsjournal.com/2025/02/22/2-22-25-national-security-and-korean-news-and-commentary/",
    "timestamp": "2025-02-22T19:08:53Z"
  },
  {
    "title": "MSNBC’s Symone Sanders-Townsend Blasts Trump’s Pentagon Purge: ‘Was CQ Brown Fired Because He Was Black?’",
    "description": "MSNBC host Symone Sanders-Townsend slammed President Donald Trump over his decision to fire former Chairman of the Joints Chiefs of Staff General CQ Brown.\nThe post MSNBC’s Symone Sanders-Townsend Blasts Trump’s Pentagon Purge: ‘Was CQ Brown Fired Because He …",
    "link": "https://www.mediaite.com/tv/msnbcs-symone-sanders-townsend-blasts-trumps-pentagon-purge-was-cq-brown-fired-because-he-was-black/",
    "timestamp": "2025-02-22T19:05:42Z"
  },
  {
    "title": "In speech, Orbán hails Trump victory and declares Brussels his key adversary",
    "description": "''2025 is the year of victory for Hungary'', Orbán declared.",
    "link": "https://www.euractiv.com/section/politics/news/in-speech-orban-hails-trump-victory-and-declares-brussels-his-key-adversary/",
    "timestamp": "2025-02-22T19:04:55Z"
  },
  {
    "title": "As migrant arrests plunge and deportation numbers go haywire, Donald Trump demotes ICE Director Caleb Vitello",
    "description": "ICE Director Caleb Vitello has been demoted as the Trump administration pushes for stricter immigration enforcement. Vitello, a 23-year ICE veteran, was reassigned after President Donald Trump expressed frustration over the slow pace of migrant arrests and de…",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-migrant-arrests-plunge-and-deportation-numbers-go-haywire-donald-trump-demotes-ice-director-caleb-vitello/articleshow/118486993.cms",
    "timestamp": "2025-02-22T19:03:00Z"
  },
  {
    "title": "Jim Chalmers heads to US to make tariffs case",
    "description": "The visit coincides with a major push by Australian superannuation funds to build their case for increased investment opportunities in the US, starting with a \"super showcase\" in Washington DC and New York.",
    "link": "https://www.abc.net.au/news/2025-02-23/australian-super-funds-make-direct-pitch-to-trump-administration/104969894",
    "timestamp": "2025-02-22T19:01:32Z"
  },
  {
    "title": "Trump says he may take control of the U.S. Postal Service. Here’s what to know",
    "description": "In recent years, as it’s sometimes struggled to stay afloat, the Postal Service has fought calls from Trump and others that it be privatized.",
    "link": "https://www.denverpost.com/2025/02/22/us-postal-service-trump-commerce-department/",
    "timestamp": "2025-02-22T19:00:27Z"
  },
  {
    "title": "Fuentes Dubs Bannon's CPAC Salute 'Excessive'...",
    "description": "‘The Manson Family had a more coherent ideology than MAGA. And the liberal criticism that American ‘fascism’ is merely a personality cult around Trump seems justified,’ notorious white supremacist Richard Spencer said on Friday",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/nick-fuentes-steve-bannon-cpac-salute-b2702639.html",
    "timestamp": "2025-02-22T19:00:06Z"
  },
  {
    "title": "Lizzy Caplan Says Joining Robert De Niro in Netflix’s ‘Zero Day’ Was ‘As Close to a No Brainer as You Can Get’",
    "description": "The actress tells TheWrap her character has \"minor shades\" of Alexandria Ocasio-Cortez and some former presidents' daughters\nThe post Lizzy Caplan Says Joining Robert De Niro in Netflix’s ‘Zero Day’ Was ‘As Close to a No Brainer as You Can Get’ appeared first…",
    "link": "https://www.thewrap.com/lizzy-caplan-netflix-zero-day-interview/",
    "timestamp": "2025-02-22T19:00:00Z"
  },
  {
    "title": "As Trump and Musk slash spending, this agency has been singled out",
    "description": "As Elon Musk and the DOGE get to work, there is concern that their slash-and-burn approach will have unwanted consequences: just ask Megan, a USAID employee who got one of the billionaire's dreaded emails.",
    "link": "https://www.abc.net.au/news/2025-02-23/donald-tump-and-elon-musk-doge-cuts-target-usaid/104963936",
    "timestamp": "2025-02-22T18:49:01Z"
  },
  {
    "title": "‘The Apprentice’ Director Ali Abbasi Responds to Claims of Inappropriate Conduct",
    "description": "Abbasi was recently accused of groping an unnamed A-list actor at a Golden Globes after-party, a fact that he says does not correlate with him separating from his U.S. representation.",
    "link": "https://www.indiewire.com/news/general-news/ali-abbasi-inappropriate-conduct-claims-1235097928/",
    "timestamp": "2025-02-22T18:47:53Z"
  },
  {
    "title": "Polls: Trump, Musk Must Eat Worms, As Mandated By Beloved Playground Ditty",
    "description": "Look, the law is the law.",
    "link": "https://www.wonkette.com/p/polls-trump-musk-must-eat-worms-as",
    "timestamp": "2025-02-22T18:45:54Z"
  },
  {
    "title": "New FBI Director Kash Patel plans to move up to 1,500 workers out of Washington, AP source says",
    "description": "New FBI Director Kash Patel plans to relocate up to 1,500 employees to field offices and a large bureau facility in Alabama. Patel aims to reduce the FBI's footprint in Washington and focus on combating violent crime while emphasizing traditional crime-fighti…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/new-fbi-director-kash-patel-plans-to-move-up-to-1500-workers-out-of-washington-ap-source-says/articleshow/118487941.cms",
    "timestamp": "2025-02-22T18:42:53Z"
  },
  {
    "title": "German Election Crossroads: Continuity Globalism or Shift to Right on Ballot as Voters Set to Select Next Government in Berlin",
    "description": "The leftist 'traffic light' coalition government in Berlin collapsed just hours after Donald Trump's victory in November, sparking snap elections in Germany that will likely define the shape of European politics in the years to come.\nThe post German Election …",
    "link": "https://www.breitbart.com/europe/2025/02/22/german-election-crossroads-continuity-globalism-or-shift-to-right-on-ballot-as-voters-set-to-select-next-government-in-berlin/",
    "timestamp": "2025-02-22T18:40:07Z"
  },
  {
    "title": "‘Donald Trump You’ve Been Caught Red-Handed!’ Jim Acosta Stunned By Revelations In AP Lawsuit",
    "description": "Jim Acosta was stunned by an account of a meeting that was revealed in a new lawsuit by the AP, exclaiming that it meant Trump was \"caught red-handed.\"\nThe post ‘Donald Trump You’ve Been Caught Red-Handed!’ Jim Acosta Stunned By Revelations In AP Lawsuit firs…",
    "link": "https://www.mediaite.com/news/youre-caught-red-handed-donald-trump-jim-acosta-stunned-by-revelations-in-ap-lawsuit/",
    "timestamp": "2025-02-22T18:39:50Z"
  },
  {
    "title": "Is Elon Musk’s DOGE leadership driving US toward recession and hiring freezes? Here’s what top economist says",
    "description": "With uncertainty mounting and economic warning signs flashing, experts and policymakers will be closely watching the next few months to gauge the true impact of Musk’s cost-cutting measure.",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-elon-musks-doge-leadership-driving-us-toward-recession-and-hiring-freezes-heres-what-top-economist-says/articleshow/118487671.cms",
    "timestamp": "2025-02-22T18:37:47Z"
  },
  {
    "title": "It's just not Tesla; global electric wheels take turn on to Indian roads",
    "description": "Global EV manufacturers, including BYD and Tesla, are shifting focus to India, anticipating growth in its nascent electric vehicle market. They are adopting a premium strategy with high-end models priced between ₹25-55 lakh, aiming to capture market share ami…",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-news/global-electric-wheels-take-turn-on-to-indian-roads/articleshow/118487625.cms",
    "timestamp": "2025-02-22T18:34:49Z"
  },
  {
    "title": "European leaders back Ukraine as Trump reaches out to Russia",
    "description": "Spanish Prime Minister Pedro Sanchez said peace in Ukraine could not be \"imposed.\" Greece's Kyriakos Mitsotakis insisted that there can be no deal to end the war without Ukraine's involvement.",
    "link": "https://www.dw.com/en/european-leaders-back-ukraine-as-trump-reaches-out-to-russia/a-71714959",
    "timestamp": "2025-02-22T18:34:00Z"
  },
  {
    "title": "California asks US government for billions in fire relief funds",
    "description": "Governor Gavin Newsom said the requested funds will help in immediate and long-term recovery work.",
    "link": "https://www.bbc.com/news/articles/ce8mdrvnmkno",
    "timestamp": "2025-02-22T18:28:54Z"
  },
  {
    "title": "Have Ivanka and Jared Kushner dumped Donald Trump? Report says the couple has refused to sign memo saying the president was not antisemitic",
    "description": "Ivanka Trump and Jared Kushner are said to have distanced themselves from Donald Trump, turning down his call to publicly come to his defense against antisemitism claims after the 2023 Hamas attacks on Israel. This pivotal moment is exposed in Michael Wolff's…",
    "link": "https://economictimes.indiatimes.com/news/international/us/have-ivanka-and-jared-kushner-dumped-donald-trump-report-says-the-couple-has-refused-to-sign-memo-saying-the-president-was-not-antisemitic/articleshow/118485996.cms",
    "timestamp": "2025-02-22T18:25:58Z"
  },
  {
    "title": "GOLDSTEIN: Hiking carbon taxes during tariff war is economic madness",
    "description": "Increasing Canada's national carbon tax on April 1, when we may be in a full-scale tariff war with the U.S. by then, is economic insanity.",
    "link": "https://torontosun.com/opinion/columnists/goldstein-hiking-carbon-taxes-during-tariff-war-is-economic-madness",
    "timestamp": "2025-02-22T18:20:29Z"
  },
  {
    "title": "Abby Phillip And Bomani Jones Roasts Trump Black History Month Bash: ‘Really Gets Off On’ Idea ‘Black People Like Him’",
    "description": "Abby Phillip and podcaster Bomani Jones roasted President Donald Trump's Black History Month reception even as his administration wages war on DEI.\nThe post Abby Phillip And Bomani Jones Roasts Trump Black History Month Bash: ‘Really Gets Off On’ Idea ‘Black …",
    "link": "https://www.mediaite.com/news/abby-phillip-and-bomani-jones-roasts-trump-black-history-month-bash-really-gets-off-on-idea-black-people-like-him/",
    "timestamp": "2025-02-22T18:14:44Z"
  },
  {
    "title": "Was Donald Trump a Russian spy in 1987? Bizarre allegations by ex-KGB officer will surprise you",
    "description": "A former KGB officer claims Donald Trump was recruited as a Russian spy in 1987, codenamed 'Krasnov'. Trump allegedly became an asset during a visit to the Soviet Union, with the KGB targeting influential Western figures. Ex-White House officials have also ex…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/was-donald-trump-a-russian-spy-in-1987-bizarre-allegations-by-ex-kgb-officer-will-surprise-you/articleshow/118487146.cms",
    "timestamp": "2025-02-22T18:13:28Z"
  },
  {
    "title": "Trump fires top general who supported Black Lives Matter",
    "description": "Since taking office last month, the US president has reversed numerous diversity, equity, and inclusion (DEI) programs in federal agencies Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613161-trump-fires-pro-blm-general/",
    "timestamp": "2025-02-22T18:05:27Z"
  },
  {
    "title": "Headstrong Francis Put the Church Above His Health, Observers Say...",
    "description": "In the days after the Vatican announced on Feb. 6 that Pope Francis had bronchitis and would be restricting his",
    "link": "https://dnyuz.com/2025/02/22/headstrong-francis-put-the-church-above-his-health-vatican-observers-say/",
    "timestamp": "2025-02-22T18:00:03Z"
  },
  {
    "title": "UK to Partner with Big Tech on Nuclear Powered Data Centers",
    "description": "As the U.K. undergoes a massive energy transformation under the Labour government, there are high hopes for developing widescale clean energy projects, including nuclear power. As well as ambitious plans to deploy vast amounts of renewable energy, such as win…",
    "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/UK-to-Partner-with-Big-Tech-on-Nuclear-Powered-Data-Centers.html",
    "timestamp": "2025-02-22T18:00:00Z"
  },
  {
    "title": "Mark Cuban Declares He Learned Dems ‘Can’t Sell Worth S**t’ After Being More Involved In Presidential Election",
    "description": "Mark Cuban declared at an event that the biggest lesson he learned by being more involved in the presidential race was that \"Democrats can't sell worth shit.\"\nThe post Mark Cuban Declares He Learned Dems ‘Can’t Sell Worth S**t’ After Being More Involved In Pr…",
    "link": "https://www.mediaite.com/politics/mark-cuban-declares-he-learned-dems-cant-sell-worth-st-after-being-more-involved-in-presidential-election/",
    "timestamp": "2025-02-22T17:58:50Z"
  },
  {
    "title": "Trump's EEOC Chief Threatens Civil Rights Lawsuits Amid H-1B Hiring",
    "description": "Companies that prefer migrants and visa workers over Americans may face federal investigations and lawsuits, the new EEOC chair said.\nThe post Trump’s EEOC Chief Threatens Civil Rights Lawsuits Amid H-1B Hiring appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/02/22/trumps-eeoc-director-threatens-lawsuits-amid-h-1b-hiring/",
    "timestamp": "2025-02-22T17:57:38Z"
  },
  {
    "title": "Elon Musk Faces Legal Claims From Ashley St. Clair Over Paternity, Custody of Infant Child",
    "description": "The conservative influencer has filed two petitions in Manhattan Court against the Tesla founder, saying he has only met the baby he allegedly fathered three times.",
    "link": "https://www.vanityfair.com/style/story/elon-musk-ashley-st-clair-baby-lawsuit-custody-paternity",
    "timestamp": "2025-02-22T17:52:54Z"
  },
  {
    "title": "Governor of Maine confronts Trump over trans athlete ban",
    "description": "During a meeting of the governors at the White House, President Donald Trump threatened to withhold federal funds from the state of Maine after Democratic governor Janet Mills suggested she would not comply with the executive order of transgender athletes. Th…",
    "link": "https://www.thepinknews.com/2025/02/22/governor-of-maine-confronts-trump-over-trans-athlete-ban/",
    "timestamp": "2025-02-22T17:52:17Z"
  },
  {
    "title": "Trans activist suggests gender-neutral Olympics",
    "description": "Trans activist Blossom Brown suggested Thursday that the Olympics should \"absolutely\" be gender-neutral during an appearance on \"Piers Morgan Uncensored.\"",
    "link": "https://www.foxnews.com/sports/trans-activist-suggests-combining-olympics-paralympics-creating-gender-neutral-competition",
    "timestamp": "2025-02-22T17:51:41Z"
  },
  {
    "title": "Who will win Germany’s high-stakes election? Will AfD, the far-right party backed by Elon Musk and JD Vance, take power?",
    "description": "Germany’s 2025 election is set to reshape the nation’s future as economic struggles, political instability, and the rise of the far-right AfD dominate the debate. With Elon Musk and JD Vance among its U.S. supporters, AfD’s growing influence is alarming many.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-will-win-germanys-high-stakes-election-will-afd-the-far-right-party-backed-by-elon-musk-and-jd-vance-take-power/articleshow/118485097.cms",
    "timestamp": "2025-02-22T17:51:18Z"
  },
  {
    "title": "Ali Abbasi Gives His Side Of Golden Globes Afterparty Grope & Parting With U.S. Reps; Calls It A Playful ‘Slap On The Rear’ Of An Actor He Considered A Friend",
    "description": "Ali Abbasi, the director of the Donald Trump film The Apprentice who exited his US reps CAA and Entertainment 360 in the aftermath of an ugly incident that took place at a Golden Globes afterparty, has issued a statement explaining himself. Deadline broke new…",
    "link": "http://deadline.com/2025/02/ali-abbasi-exlains-golden-globes-afterparty-incident-parting-with-u-s-reps-1236298177/",
    "timestamp": "2025-02-22T17:49:40Z"
  },
  {
    "title": "Supreme Court maintains pause on Trump bid to immediately fire watchdog agency head",
    "description": "The Supreme Court, which has a 6-3 conservative majority, weighs in on a case involving the new Trump administration for the first time.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-maintains-pause-trump-bid-immediately-fire-watchdog-agen-rcna192643",
    "timestamp": "2025-02-22T17:48:07Z"
  },
  {
    "title": "How the U is Celebrating Black History Month",
    "description": "February is Black History Month, and the U will be hosting several events this month to celebrate it.  This year’s theme, as determined by the founding organization of Black History Month, the Association for the Study of African American Life and History, is…",
    "link": "https://dailyutahchronicle.com/2025/02/22/how-the-u-is-celebrating-black-history-month/",
    "timestamp": "2025-02-22T17:46:51Z"
  },
  {
    "title": "Piyush Goyal says Tesla welcome to invest, manufacture in India",
    "description": "Union Minister Piyush Goyal welcomes Tesla and other global companies to invest and manufacture in India. He emphasized mutual benefits and highlighted the government's commitment to reducing pollution through electric vehicles. Addressing US-India relations,…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/piyush-goyal-says-tesla-welcome-to-invest-manufacture-in-india/articleshow/118486584.cms",
    "timestamp": "2025-02-22T17:45:51Z"
  },
  {
    "title": "James Carville Pushes Back On Trump Transgender Attacks In Hannity Interview",
    "description": "Democratic strategist James Carville pushed back on President Donald Trump's relentless attack on transgender people in an interview with Fox News this week.\nThe post James Carville Pushes Back On Trump Transgender Attacks In Hannity Interview first appeared …",
    "link": "https://www.mediaite.com/news/james-carville-pushes-back-on-trump-transgender-attacks-in-hannity-interview/",
    "timestamp": "2025-02-22T17:43:42Z"
  },
  {
    "title": "‘Apprentice’ Director Ali Abbasi Apologizes for ‘Slap on the Rear’ of Actor, Says He Dropped CAA and Management 360 | Exclusive",
    "description": "The director is up for a Spirit Award on Saturday and said he made a mistake but wanted to keep focus on the film\nThe post ‘Apprentice’ Director Ali Abbasi Apologizes for ‘Slap on the Rear’ of Actor, Says He Dropped CAA and Management 360 | Exclusive   appear…",
    "link": "https://www.thewrap.com/apprentice-director-ali-abbasi-apologizes-incident-actor/",
    "timestamp": "2025-02-22T17:43:10Z"
  },
  {
    "title": "Kennedy Center reeling from 'stunning' ticket sales collapse after Trump takeover: report",
    "description": "A decision by Donald Trump to fire everyone and wrest control of the John F. Kennedy Center for the Performing Arts on the banks of the Potomac has led to an alarming downward spiral in ticket sales and artists canceling performances in protest.After returnin…",
    "link": "https://www.rawstory.com/trump-kennedy-center/",
    "timestamp": "2025-02-22T17:38:38Z"
  },
  {
    "title": "Group Donald Trump put in charge of declassifying major secret files make promise to public",
    "description": "Donald Trump has ordered the declassification of documents which include the JFK assassination files",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-jfk-assassination-files-ufo-area-51-167442-20250222",
    "timestamp": "2025-02-22T17:36:37Z"
  },
  {
    "title": "A $33 trillion economy, now it's penniless!",
    "description": "Donald Trump has called for the discontinuation of the U.S. penny due to its high production cost outweighing its face value. This decision aims to address financial inefficiencies, following similar actions by countries like Canada and Australia.",
    "link": "https://m.economictimes.com/opinion/et-commentary/a-33-trillion-economy-now-its-penniless/articleshow/118486234.cms",
    "timestamp": "2025-02-22T17:30:53Z"
  },
  {
    "title": "Keir Starmer 'will defy Donald Trump' over Ukraine and risk huge clash",
    "description": "Sir Keir Starmer will reportedly defy Donald Trump over Ukraine ahead of meeting the US President in the White House next week. The Prime Minister is expected to announce a new package of support for Ukraine on Monday - the third anniversary of Russia’s full-…",
    "link": "https://freerepublic.com/focus/f-news/4299647/posts",
    "timestamp": "2025-02-22T17:16:41Z"
  },
  {
    "title": "Karen Bass Throws Lesbian Fire Chief Under Bus",
    "description": "Turns out it is possible for a DEI hire to get fired after all — provided another DEI beneficiary is desperate for a scapegoat. From Daily Mail: Flailing Los Angeles Mayor Karen Bass brutally fired her female fire chief Friday as she seeks to pass the buck ov…",
    "link": "https://moonbattery.com/karen-bass-throws-lesbian-fire-chief-under-bus/",
    "timestamp": "2025-02-22T17:13:24Z"
  },
  {
    "title": "‘I Didn’t Get An Invite!’ Trump Black Coalition Leader Complains On CNN — While Defending Trump Black History Month Party",
    "description": "Black Americans for Trump Coalition leader Melik Abdul told CNN anchor Abby Phillip \"I didn't get an invite\" to Trump's Black History Month reception\nThe post ‘I Didn’t Get An Invite!’ Trump Black Coalition Leader Complains On CNN — While Defending Trump Blac…",
    "link": "https://www.mediaite.com/news/i-didnt-get-an-invite-trump-black-coalition-chief-complains-on-cnn-while-defending-trump-black-history-month-party/",
    "timestamp": "2025-02-22T17:13:02Z"
  },
  {
    "title": "Is This the End of USPS?",
    "description": "President Donald Trump is taking aim at the US Postal Service.  According to a Thursday report from the Washington Post‘s Jacob Bogage, the president plans to fire the members of USPS’ board and hand the keys to the agency over to the Department of Commerce. …",
    "link": "https://www.motherjones.com/politics/2025/02/trump-dejoy-usps-post-office-privatization/",
    "timestamp": "2025-02-22T17:12:15Z"
  },
  {
    "title": "Who is calling who a Nazi?",
    "description": "The use of Nazi imagery has become so ubiquitous among Democrats that it almost precludes notice. But Illinois Gov. J.B. Pritzker’s parallels between U.S. President Donald Trump’s political agenda and the rise of Nazi Germany during his “State of the State” b…",
    "link": "https://freerepublic.com/focus/f-news/4299645/posts",
    "timestamp": "2025-02-22T17:09:22Z"
  },
  {
    "title": "GOP-led Georgia, Utah legislatures push back on election officials to leave voter data group",
    "description": "The Republican-led state legislatures of Georgia and Utah are considering legislation to leave a voter roll data group, pushing back on their respective GOP state election officials who have advocated for remaining in the coalition. A nonprofit organization c…",
    "link": "https://freerepublic.com/focus/f-news/4299644/posts",
    "timestamp": "2025-02-22T17:05:05Z"
  },
  {
    "title": "Starmer tells Zelenskyy this is 'significant moment' for European security ahead of US visit",
    "description": "Sir Keir Starmer and Volodymyr Zelenskyy said this is a \"significant moment\" for European security amid the continued fallout between the Ukrainian leader and Donald Trump.",
    "link": "https://news.sky.com/story/starmer-tells-zelenskyy-this-is-significant-moment-for-european-security-ahead-of-us-visit-13314922",
    "timestamp": "2025-02-22T17:05:00Z"
  },
  {
    "title": "Anti-Trump Protester Goes On Nazi-Themed Rant on CNN After Arrest At City Council Meeting: ‘Hitler Was Elected Too’",
    "description": "Former NFL punter Chris Kluwe doubled down after his arrest at a city council meeting where he ripped into President Donald Trump and his MAGA movement.\nThe post Anti-Trump Protester Goes On Nazi-Themed Rant on CNN After Arrest At City Council Meeting: ‘Hitle…",
    "link": "https://www.mediaite.com/tv/anti-trump-protester-goes-on-nazi-themed-rant-on-cnn-after-arrest-at-city-council-meeting-hitler-was-elected-too/",
    "timestamp": "2025-02-22T17:02:19Z"
  },
  {
    "title": "Musk Says DOGE Stimulus Checks a Possibility. Will It Actually Happen?",
    "description": "The Tesla CEO says he will \"check\" with President Donald Trump about $5,000 \"dividend\" checks, but you probably shouldn't get your hopes up.",
    "link": "https://www.cnet.com/personal-finance/musk-says-doge-stimulus-checks-a-possibility-will-it-actually-happen/",
    "timestamp": "2025-02-22T17:00:05Z"
  },
  {
    "title": "ANTI-TRUMP RANT GETS STANDING O | TORCHES 'TYRANT'",
    "description": "A town hall in a plus-thirty GOP district erupted in a standing ovation over a blistering rant calling President Trump a \"tyrant\" who \"named himself king.\"",
    "link": "https://www.mediaite.com/news/town-hall-erupts-at-blistering-anti-trump-rant-torching-tyranny-gets-standing-ovation-in-trump-district/",
    "timestamp": "2025-02-22T17:00:03Z"
  },
  {
    "title": "Is Our Five-Year Nightmare Finally Over?",
    "description": "Robert F. Kennedy, Jr.’s confirmation as the Secretary of Health and Human Services in the US is the ultimate repudiation of the Covid policy response.  The scheme of lockdown-until-vaccination was the biggest effort of government and industry on a global sca…",
    "link": "https://www.activistpost.com/covid-policy-response-wealth-transfer-and-power/",
    "timestamp": "2025-02-22T17:00:00Z"
  },
  {
    "title": "David Kirk and Mark Robinson turn from rivals to allies in navigating NZ Rugby’s new era: Gregor Paul",
    "description": "ANALYSIS: Two former All Blacks now sit on the same side of the table.",
    "link": "https://www.nzherald.co.nz/sport/rugby/david-kirk-and-mark-robinson-turn-from-rivals-to-allies-in-navigating-nzrs-new-era-gregor-paul/SBC4LH5YNRAZXMO5IBVB6A2YAY/",
    "timestamp": "2025-02-22T17:00:00Z"
  },
  {
    "title": "Christopher Luxon’s Cabinet congestion: Time to streamline the number of ministerial portfolios - Ryan Bridge",
    "description": "OPINION: Ministers can be responsible for everything and nothing all at the same time.",
    "link": "https://www.nzherald.co.nz/nz/christopher-luxons-cabinet-congestion-time-to-streamline-the-number-of-ministerial-portfolios-ryan-bridge/HGXENUWJVFESDDIAS2ECXSLTUA/",
    "timestamp": "2025-02-22T17:00:00Z"
  },
  {
    "title": "Trump administration reportedly shutting down federal EV chargers nationwide | TechCrunch",
    "description": "The General Services Administration, the agency that manages buildings owned by the federal government, is planning to shut down its entire network of",
    "link": "https://techcrunch.com/2025/02/22/trump-administration-reportedly-shutting-down-federal-ev-chargers-nationwide/",
    "timestamp": "2025-02-22T16:58:44Z"
  },
  {
    "title": "Capehart: Europe Isn't Ripping Us Off on Defense, Just Not Fairly Sharing the Burden",
    "description": "On Friday’s “PBS NewsHour,” Washington Post Associate Editor and MSNBC host Jonathan Capehart stated that it’s incorrect to claim that Europe is ripping off the United States on defense by not spending enough on their defense because they’re not “paying\nThe p…",
    "link": "https://www.breitbart.com/clips/2025/02/22/capehart-europe-isnt-ripping-us-off-on-defense-just-not-fairly-sharing-the-burden/",
    "timestamp": "2025-02-22T16:58:27Z"
  },
  {
    "title": "New Jersey Defies Trump Order, Will Allow Male Athletes to Compete in Female High School Sports",
    "description": "TRENTON, NJ – New Jersey Governor Phil Murphy and his minions are messing around with President Donald J. Trump, and soon, they could be finding out in the form of cuts to federal funding for education. Despite a recent executive order from President Trump ai…",
    "link": "https://freerepublic.com/focus/f-news/4299642/posts",
    "timestamp": "2025-02-22T16:56:35Z"
  },
  {
    "title": "Trump Ousts Leftist Joint Chiefs Of Staff Chair, Other DEI-Pushing Military Officials",
    "description": "'Under President Trump, we are putting in place new leadership that will focus our military on its core mission of deterring, fighting and winning wars.'",
    "link": "https://thefederalist.com/2025/02/22/trump-ousts-leftist-joint-chiefs-of-staff-chair-other-dei-pushing-military-officials/",
    "timestamp": "2025-02-22T16:54:55Z"
  },
  {
    "title": "A former Russian spy claims Donald Trump was recruited by the KGB in the 1980s under the nickname Krasnov",
    "description": "Everything surrounding Donald Trump seems to be straight out of a Hollywood movie. This is the case with the latest information published by a former Soviet spy named Alnur Mussaye",
    "link": "https://www.marca.com/en/lifestyle/us-news/presidential-election/2025/02/22/67b9fc6f46163f9d898b457e.html",
    "timestamp": "2025-02-22T16:48:25Z"
  },
  {
    "title": "Warren Buffett amasses more cash and sells more stock, but doesn’t explain why in annual letter",
    "description": "The mystery over Warren Buffett’s surprisingly defensive stance deepened over the weekend.",
    "link": "https://www.nbcnews.com/business/warren-buffet-berkshire-hathaway-annual-shareholder-letter-rcna193311",
    "timestamp": "2025-02-22T16:46:25Z"
  },
  {
    "title": "“It’s Sad We Have to Do This”: Academic Unions Are Rallying to Defend Science",
    "description": "On Wednesday afternoon in New York City, it hovered around 30 degrees, the sort of cold outside that makes your face sting. Despite the sub-freezing temperatures, hundreds of PhD students, post-doctoral researchers, and other scholars gathered in the West Vil…",
    "link": "https://www.motherjones.com/politics/2025/02/its-sad-we-have-to-do-this-academic-unions-are-rallying-to-defend-science/",
    "timestamp": "2025-02-22T16:39:52Z"
  },
  {
    "title": "Video: NO WAR, NO NATO. Drago Bosnic and Michel Chossudovsky",
    "description": "We are at the cross-roads of a major shift in geopolitics with the prospects of bringing to terms the war in Ukraine. Our message to the peace movement Worldwide across the land is to abolish NATO\nThe post Video: NO WAR, NO NATO. Drago Bosnic and Michel Choss…",
    "link": "https://www.globalresearch.ca/video-no-war-no-nato-drago-bosnic-and-michel-chossudovsky/5880635",
    "timestamp": "2025-02-22T16:39:20Z"
  },
  {
    "title": "CNN Anchors Roast Trump Over ’13 Biggest Lies’ Of First Month",
    "description": "John Berman and Sara Sidner roasted President Donald Trump as fact-checker Daniel Dale went over some of the \"13 biggest lies\" of his first month in office.\nThe post CNN Anchors Roast Trump Over ’13 Biggest Lies’ Of First Month first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/cnn-anchors-roast-trump-over-13-biggest-lies-of-first-month/",
    "timestamp": "2025-02-22T16:38:34Z"
  },
  {
    "title": "Jasmine Crockett Openly Sides Against USA",
    "description": "Angrily anti-Caucasian congresscritter Jasmine Crockett is so clueless, even in the light of the unfolding DOGE revelations she denies “there is a lot of waste, fraud, and abuse in the federal government.” But as Napoleon observed, in politics, stupidity is n…",
    "link": "https://moonbattery.com/jasmine-crockett-openly-sides-against-usa/",
    "timestamp": "2025-02-22T16:34:42Z"
  },
  {
    "title": "Trump ousts top military leader in latest Pentagon upheaval",
    "description": "U.S. President Donald Trump fired Air Force Gen. CQ Brown Jr. as chairman of the Joint Chiefs of Staff on Friday, sidelining a history-making fighter pilot and respected officer as the administration makes sweeping changes to the top military ranks. Brown's p…",
    "link": "https://www.cbc.ca/news/world/trump-pentagon-joint-chiefs-caine-brown-1.7466026",
    "timestamp": "2025-02-22T16:33:49Z"
  },
  {
    "title": "Georgia Congressman Helped GOP F**k Around, Now Is Finding Out",
    "description": "Things got a mite heated at a town hall in his heavily Republican district.",
    "link": "https://www.wonkette.com/p/georgia-congressman-helped-gop-fk",
    "timestamp": "2025-02-22T16:30:56Z"
  },
  {
    "title": "'Gruesome sell-out or a chance to lead': What will happen when Starmer visits Trump?",
    "description": "What could happen when Sir Keir Starmer visits the White House next Thursday?",
    "link": "https://www.bbc.com/news/articles/c3w16l6xx39o",
    "timestamp": "2025-02-22T16:29:37Z"
  },
  {
    "title": "ADAM WEISS: Corporate Media Desperately Trying To Drive Wedge Between Trump, Musk. It Won’t Work.",
    "description": "The media won't succeed in breaking up the friendship between President Donald Trump and DOGE Chairman Elon Musk.",
    "link": "https://dailycaller.com/2025/02/22/opinion-corporate-media-trump-musk-adam-weiss/",
    "timestamp": "2025-02-22T16:26:03Z"
  },
  {
    "title": "Trump Proposes New Ship Fees To Challenge China’s Maritime Might",
    "description": "By Jenny Leonard and Jennifer A. Dlouhy Feb 21, 2025 (Bloomberg) –The Trump administration is proposing fees on the use of China’s commercial ships it says could help counter the country’s...",
    "link": "https://gcaptain.com/trump-proposes-new-ship-fees-to-challenge-chinas-maritime-might/",
    "timestamp": "2025-02-22T16:25:26Z"
  },
  {
    "title": "Trump fires top US general CQ Brown in major Pentagon shake-up",
    "description": "The US president fires CQ Brown without providing a reason and also announced replacement of five top officers.",
    "link": "https://www.aljazeera.com/news/2025/2/22/trump-fires-top-us-general-cq-brown-in-major-pentagon-shake-up",
    "timestamp": "2025-02-22T16:24:11Z"
  },
  {
    "title": "CDC Layoffs Weaken Response to Public Health Emergencies",
    "description": "Trump’s CDC cuts weaken public health response, hinder disease tracking, and threaten outbreak containment efforts.",
    "link": "https://www.dcreport.org/2025/02/22/cdc-layoffs-weaken-response-to-public-health-emergencies/",
    "timestamp": "2025-02-22T16:22:46Z"
  },
  {
    "title": "Defense Secretary Pete Hegseth Fires Two Four-Stars, Top JAG Officers",
    "description": "Defense Secretary Pete Hegseth fired two four-star military leaders on Friday evening, making good on a promise to review general officers and replace any who were not aligned with his and President Donald Trump's efforts to prioritize lethality and war-fight…",
    "link": "https://www.breitbart.com/politics/2025/02/22/defense-secretary-pete-hegseth-fires-two-four-stars-top-jag-officers/",
    "timestamp": "2025-02-22T16:19:38Z"
  },
  {
    "title": "On eve of elections, Germany faces changing world situation",
    "description": "BERLIN — German politicians made a final scramble for votes Saturday on the eve of key elections in which conservatives hope to win despite the dramatic rise of the far right.\n\n\nSunday's vote comes at a time of upheaval for Europe and its biggest economy as U…",
    "link": "https://www.voanews.com/a/on-eve-of-elections-germany-faces-changing-world-situation/7984491.html",
    "timestamp": "2025-02-22T16:19:00Z"
  },
  {
    "title": "One of Biden regime’s darkest ‘Ukraine war’ secrets was just revealed…",
    "description": "...According to Jeffrey Sachs, Jake Sullivan admitted—behind closed doors—that if he had told the truth about Ukraine and NATO, the war would’ve been over before it even started. He knew it, but never said it publicly.... ...Absolutely damning—and undeniable …",
    "link": "https://freerepublic.com/focus/f-news/4299636/posts",
    "timestamp": "2025-02-22T16:15:33Z"
  },
  {
    "title": "Donald Trump WAS Recruited as a Russian Spy in 1987: Ex-KGB Officer Makes Wild Allegation… and Even Claims Prez’s Coded Alias Was 'Krasnov'",
    "description": "Former Kazakh intelligence chief Alnur Mussayev claimed Donald Trump's personal file is now managed by one of Vladimir Putin's close allies.",
    "link": "https://radaronline.com/p/donald-trump-recruited-russian-spy-1987-ex-kgb-officer-alias-krasnov/",
    "timestamp": "2025-02-22T16:15:00Z"
  },
  {
    "title": "I'll back Ukraine in talks with Trump, Starmer tells Zelensky",
    "description": "The prime minister called Ukraine's Volodymyr Zelensky for the second time in four days.",
    "link": "https://www.bbc.com/news/articles/c8rklvrnl7ro",
    "timestamp": "2025-02-22T16:13:52Z"
  },
  {
    "title": "Rubio outlines Trump’s stance on Canada as 51st state",
    "description": "Washington is ready to continue working with Ottawa but “there has to be reciprocity” in trade, the US secretary of state has stated Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613157-rubio-explains-trumps-stance-on-canada/",
    "timestamp": "2025-02-22T16:08:44Z"
  },
  {
    "title": "It Appears Democrats Have Finally Picked A Hill To Die On",
    "description": "The vast majority of Americans say they want to keep men out of women's sports.",
    "link": "https://dailycaller.com/2025/02/22/democrats-pick-hill-transgender-policies/",
    "timestamp": "2025-02-22T16:08:00Z"
  },
  {
    "title": "Musk renews attack on Zelensky over ‘murder’ of US journalist",
    "description": "The Tesla CEO lashed out at Ukraine’s leader amid worsening bilateral ties between Kiev and Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613149-musk-zelensky-lira-murder/",
    "timestamp": "2025-02-22T16:06:56Z"
  },
  {
    "title": "Despite 2024 Layoffs, Tech Jobs Expected to Take Off",
    "description": "In 2024, the technology sector saw yet more layoffs after massive cuts in 2022 and 2023. Though the pace was somewhat slower last year, more than 150,000 employees were laid off across hundreds of companies, according to Layoffs.fyi, a site started during the…",
    "link": "https://spectrum.ieee.org/tech-jobs",
    "timestamp": "2025-02-22T16:00:03Z"
  },
  {
    "title": "Putin summit preparations underway...",
    "description": null,
    "link": "https://apnews.com/article/russia-ukraine-war-trump-putin-talks-89e19bc56677064f6f9a6d6e03de7362",
    "timestamp": "2025-02-22T16:00:03Z"
  },
  {
    "title": "DOWD: Fail, Caesar!",
    "description": "“Remember, I can do whatever I want to whomever I want.” It sounds like President Trump, to the world. But",
    "link": "https://dnyuz.com/2025/02/22/fail-caesar/",
    "timestamp": "2025-02-22T16:00:03Z"
  },
  {
    "title": "The economic recovery has begun. Here’s what the new normal looks like - Liam Dann",
    "description": "History suggests only a short window before the next black swan event rattles our economy.",
    "link": "https://www.nzherald.co.nz/business/liam-dann-the-economic-recovery-has-begun-heres-what-the-new-normal-looks-like/6NYLYBKV6NBHTKF7KEELLPOBME/",
    "timestamp": "2025-02-22T16:00:00Z"
  },
  {
    "title": "Pentagon Upheaval, Hamas Releases More Hostages, NY State Prisons",
    "description": "President Donald Trump fires the Chairman of the Joint Chiefs of Staff, plus the Defense Department is set to lose more than 5 thousand personnel. Hamas releases 6 more living hostages as part of its ceasefire agreement with Israel. Corrections officers in NY…",
    "link": "https://www.npr.org/2025/02/22/1233127306/pentagon-upheaval-hamas-releases-more-hostages-ny-state-prisons",
    "timestamp": "2025-02-22T15:58:33Z"
  },
  {
    "title": "I experienced Russian corruption firsthand — and Trump is importing KGB thuggery",
    "description": "Before I became a trial lawyer, I was corporate. Studying legal systems abroad morphed into drafting foreign license agreements, and in the late 90s, I negotiated across the table from Russian oligarchs. These were men who, through connections with the recent…",
    "link": "https://www.rawstory.com/raw-investigates/trump-kgb/",
    "timestamp": "2025-02-22T15:55:42Z"
  },
  {
    "title": "Why Trump Is So Threatening to Permanent Bureaucracy",
    "description": "<p>During an interview with Fox News's Sean Hannity, President Donald Trump and DOGE czar Elon Musk seemed to contemplate the existence of what used to be called the</p>",
    "link": "https://www.realclearpolitics.com/2025/02/22/why_trump_is_so_threatening_to_permanent_bureaucracy_641481.html",
    "timestamp": "2025-02-22T15:53:08Z"
  },
  {
    "title": "Gov. Janet Mills Refused To Be Bullied By Trump",
    "description": "Nothing warms my democracy-loving heart more than a government official standing up to Donald Trump. Even more so when it’s a woman whose spunk gets under his thin skin.\nHere’s Gov. Janet Mills sounding not one itsy-bit intimidated by President P***y Grabber’…",
    "link": "https://crooksandliars.com/2025/02/gov-janet-mills-refused-be-bullied-trump",
    "timestamp": "2025-02-22T15:50:59Z"
  },
  {
    "title": "Best of Archive Series – 7 Words Americans Should Stop Using Until Further Investigation",
    "description": "Americans repeat certain words with mindless ease without once regarding their definitions, their real meanings or their connotative meanings. Their use or perhaps their misuse is a good reflection of the health of our culture or the lack of it. Without inclu…",
    "link": "https://freerepublic.com/focus/f-chat/4299632/posts",
    "timestamp": "2025-02-22T15:42:16Z"
  }
]