[
  {
    "title": "Exclusive-China considering yuan-backed stablecoins to boost global currency usage, sources say",
    "description": "China's cabinet – will review and possibly approve a roadmap later this month for the greater usage of the currency globally, including catching up with a...",
    "link": "https://finance.yahoo.com/news/exclusive-china-considering-yuan-backed-115355632.html",
    "timestamp": "2025-08-20T11:53:55Z"
  },
  {
    "title": "'Concerning line' in new Trump policy flagged by former White House official",
    "description": "A former high-ranking White House official flagged a \"concerning line\" in President Donald Trump's expanded test for U.S. citizenship.The U.S. Citizenship and Immigration Services announced that officers will be required to give more than a \"cursory\" review f…",
    "link": "https://www.rawstory.com/trump-immigration-standards-concerning-line/",
    "timestamp": "2025-08-20T11:53:31Z"
  },
  {
    "title": "Todd and Julie Chrisley Break Their Silence on Nic Kerdiles’ Death",
    "description": "Todd and Julie Chrisley broke their silence on the death of daughter Savannah Chrisley’s ex-fiancé, Nic Kerdiles. “So a lot of the questions were, ‘Why have you not talked about Nic on the podcast yet?’ Well, that’s very simple, because it is still very fresh…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-and-julie-chrisley-break-their-silence-on-nic-kerdiles-death/#article",
    "timestamp": "2025-08-20T11:50:30Z"
  },
  {
    "title": "Elon Musk Throws in Towel on Launching Third Party — Instead Tries to Cozy Up to JD Vance: WSJ",
    "description": "Musk is reportedly \"pumping the brakes\" on launching a new political party and is instead cozying up to the man he views as potential heir to the MAGA throne.\nThe post Elon Musk Throws in Towel on Launching Third Party — Instead Tries to Cozy Up to JD Vance: …",
    "link": "https://www.mediaite.com/media/news/elon-musk-throws-in-towel-on-launching-third-party-instead-tries-to-cozy-up-to-jd-vance-wsj/",
    "timestamp": "2025-08-20T11:50:30Z"
  },
  {
    "title": "NATO chiefs to discuss Ukraine security guarantees",
    "description": "NATO military chiefs discussed Ukraine's security guarantees. US and European military leaders talked about peace deal options. Donald Trump met Volodymyr Zelensky and European leaders after meeting Vladimir Putin. Russia claimed advances in Donetsk. Russian …",
    "link": "https://economictimes.indiatimes.com/news/defence/nato-chiefs-to-discuss-ukraine-security-guarantees/articleshow/123409814.cms",
    "timestamp": "2025-08-20T11:49:57Z"
  },
  {
    "title": "Ranger fired for hanging transgender flag in Yosemite and park visitors may face prosecution",
    "description": "Yosemite National Park officials and the U.S. Justice Department are investigating other Yosemite visitors and workers who violated restrictions on demonstrations.",
    "link": "https://www.denverpost.com/2025/08/20/yosemite-park-ranger-transgender-flag/",
    "timestamp": "2025-08-20T11:49:07Z"
  },
  {
    "title": "Ranger fired for hanging transgender flag in Yosemite and park visitors may face prosecution",
    "description": "Yosemite National Park officials and the U.S. Justice Department are investigating other Yosemite visitors and workers who violated restrictions on demonstrations.",
    "link": "https://www.bostonherald.com/2025/08/20/yosemite-park-ranger-transgender-flag/",
    "timestamp": "2025-08-20T11:49:07Z"
  },
  {
    "title": "Wednesday: Hili dialogue",
    "description": "Welcome to a Hump Day (“День горба”) in Ukrainian; it’s Wednesday, August 20, 2025, and National Bacon Lovers Day. All of us carnivores love the stuff, but I limit my consumption when I’m not traveling on a ship that serves bacon and eggs.  Here’s a video tel…",
    "link": "https://whyevolutionistrue.com/2025/08/20/wednesday-hili-dialogue-544/",
    "timestamp": "2025-08-20T11:45:55Z"
  },
  {
    "title": "Drudge Report Resurfaces 12-Year-Old Trump Tweet: Will Putin ‘Become My New Best Friend?’",
    "description": "The Drudge Report resurrected a 12-year-old tweet by President Trump asking whether Vladimir Putin 'will become my new best friend' as the commander in chief works to secure a peace agreement between Russia and Ukraine.\nThe post Drudge Report Resurfaces 12-Ye…",
    "link": "https://www.mediaite.com/media/news/drudge-report-resurfaces-12-year-old-trump-tweet-will-putin-become-my-new-best-friend/",
    "timestamp": "2025-08-20T11:43:50Z"
  },
  {
    "title": "Is Ukraine closer to peace after Trump’s meetings with Zelenskyy, Putin?",
    "description": "Analysts say as the US and Europe avoid direct military contact with Russia, a ceasefire is yet elusive.",
    "link": "https://www.aljazeera.com/news/2025/8/20/is-ukraine-closer-to-peace-after-trumps-meetings-with-zelenskyy-putin",
    "timestamp": "2025-08-20T11:38:13Z"
  },
  {
    "title": "Debunked: Asylum seekers are not exempt from income tax for a year after they are allowed to work",
    "description": "The claim was shared in a recruitment video featuring a man wearing a MÉGA cap.",
    "link": "https://www.thejournal.ie/debunked-ipas-asylum-seekers-refugees-have-to-pay-tax-in-ireland-6794005-Aug2025/",
    "timestamp": "2025-08-20T11:37:17Z"
  },
  {
    "title": "Forbes Daily: Home Depot Warns Of Price Changes Amid Tariff Pressure",
    "description": "Today’s Forbes Daily covers the fallout over Elon Musk's self-driving claims, a dose of reality on Wall Street, weight loss drug player takes a hit and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/08/20/forbes-daily-home-depot-warns-of-price-changes-amid-tariff-pressure/",
    "timestamp": "2025-08-20T11:36:19Z"
  },
  {
    "title": "8/20/25 ☀️ AM: ... Nowhere in the country are those divisions more pronounced ... (Punchbowl News)",
    "description": "Punchbowl News:\n8/20/25 ☀️ AM: … Nowhere in the country are those divisions more pronounced than in the party's messiest Senate primary in a must-win state for Democrats in 2026.  —  The open Senate seat in Michigan, a state President Donald Trump won in 2024…",
    "link": "https://www.memeorandum.com/250820/p10",
    "timestamp": "2025-08-20T11:35:00Z"
  },
  {
    "title": "Russia says security discussions without Moscow are 'road to nowhere'",
    "description": "MOSCOW (Reuters) -Russia said on Wednesday that attempts to resolve security issues relating to Ukraine without the participation of Moscow was a \"road to nowhere\". Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/20/russia-says-security-discussions-without-moscow-are-039road-to-nowhere039",
    "timestamp": "2025-08-20T11:34:00Z"
  },
  {
    "title": "Home Depot Is Raising Prices",
    "description": "The home improvement retailer said it would be implementing \"modest\" price increases for imported goods due to \"higher\" tariffs.",
    "link": "https://www.newsweek.com/home-depot-raising-prices-trump-tariffs-2116136",
    "timestamp": "2025-08-20T11:32:54Z"
  },
  {
    "title": "Yosemite National Park ranger reportedly fired after draping massive trans pride flag across El Capitan",
    "description": "A trans park ranger was fired from Yosemite National Park last week after hanging a massive transgender pride flag in protest of the Trump administration.",
    "link": "https://www.foxnews.com/media/yosemite-national-park-ranger-reportedly-fired-after-draping-massive-trans-pride-flag-across-el-capitan",
    "timestamp": "2025-08-20T11:30:22Z"
  },
  {
    "title": "Buzz kill: Trump’s tariffs put India’s honey trade in a sticky spot",
    "description": "It is highly unlikely that Donald Trump is aware of the existence of the honey-collecting beekeepers roving Haryana’s mustard fields, the apple orchards in Kashmir, Himachal and Uttaranchal, and beyond. But he plays an oversized influence on their lives today…",
    "link": "https://www.livemint.com/industry/trump-tariffs-threaten-india-honey-exports-beekeeping-industry-fssai-honey-standards-mustard-honey-dabur-honey-11755681191560.html",
    "timestamp": "2025-08-20T11:30:14Z"
  },
  {
    "title": "Russia says security discussions without Moscow are 'road to nowhere'",
    "description": "MOSCOW (Reuters) -Russia said on Wednesday that attempts to resolve security issues relating to Ukraine without the participation of Moscow was a \"road to...",
    "link": "https://www.yahoo.com/news/articles/russia-says-security-discussions-without-112951918.html",
    "timestamp": "2025-08-20T11:29:51Z"
  },
  {
    "title": "Trump Says Putin to Meet Zelenskyy, Kremlin Plays Down Prospect",
    "description": "Just hours after President Donald Trump's summit with President Volodymyr Zelenskyy, Russia launched a new wave of fiery attacks across Ukraine. It comes as Trump says Putin has agreed to meet with Zelenskyy but the Kremlin is playing down the prospect. NBC’s…",
    "link": "https://www.today.com/video/russia-strikes-ukraine-hours-after-trump-s-summit-with-zelenskyy-245338693745",
    "timestamp": "2025-08-20T11:27:31Z"
  },
  {
    "title": "Oracle Rides Major Deals With OpenAI, Nvidia to Turn Around Cloud Business",
    "description": "Oracle Corp.’s Larry Ellison used to scoff at the idea of cloud computing, saying in 2008 that it was “complete gibberish.”",
    "link": "https://financialpost.com/pmn/business-pmn/oracle-rides-major-deals-with-openai-nvidia-to-turn-around-cloud-business",
    "timestamp": "2025-08-20T11:27:09Z"
  },
  {
    "title": "Pirro Bragged About Helping Trump While On Fox IN WRITING",
    "description": "Jeanine Pirro, then a weekend host on Fox News, told the chairman of the Republican National Committee in a September 2020 text message that she was determined to aid President Donald Trump and the Republican Party, despite the network prohibiting on-air pers…",
    "link": "https://crooksandliars.com/2025/08/pirro-bragged-about-helping-trump-while",
    "timestamp": "2025-08-20T11:27:03Z"
  },
  {
    "title": "Chris Coons’ Crocodile Tears Over Judicial Nominations Are Pure Hypocrisy",
    "description": "The complaints from Sen. Chris Coons, D-Del., should be dismissed as out of hand because he ignored such complaints under President Biden.",
    "link": "https://thefederalist.com/2025/08/20/chris-coons-crocodile-tears-over-judicial-nominations-are-pure-hypocrisy/",
    "timestamp": "2025-08-20T11:25:33Z"
  },
  {
    "title": "Trump's War on Clean Energy Could Be His Downfall... If the Dems Exploit It",
    "description": "The next two elections should be decided on the great questions of democracy versus authoritarianism, openness versus racism, science versus ignorance. But my guess is that electric bills may play at least as large a role. And that should be a good thing for …",
    "link": "https://billmckibben.substack.com/p/trump-is-shockingly-dumb-about-electric",
    "timestamp": "2025-08-20T11:24:03Z"
  },
  {
    "title": "Jussie Smollett says he felt ‘emasculated’ by public’s reaction to alleged hate crime",
    "description": "Netflix’s new documentary ‘The Truth About Jussie Smollett?’ airs Friday",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jussie-smollett-scandal-netflix-documentary-b2810962.html",
    "timestamp": "2025-08-20T11:21:52Z"
  },
  {
    "title": "First domino in national redistricting fight likely to fall; Texas GOP poised to vote",
    "description": "Texas' Republican-led legislature is expected to approve new congressional maps that add five new House seats that the GOP could win",
    "link": "https://abcnews.go.com/US/wireStory/domino-national-redistricting-fight-fall-texas-gop-poised-124802369",
    "timestamp": "2025-08-20T11:15:02Z"
  },
  {
    "title": "NATO chiefs to discuss Ukraine security guarantees",
    "description": "NATO military chiefs were set Wednesday to discuss the details of eventual security guarantees for Ukraine, pushing ahead the flurry of global diplomacy aiming to broker an end to Russia's war.",
    "link": "https://www.hurriyetdailynews.com/nato-chiefs-to-discuss-ukraine-security-guarantees-212723",
    "timestamp": "2025-08-20T11:14:24Z"
  },
  {
    "title": "A hurdle in Ukraine peace talks planning and heat wave to hit the Southwest: Morning Rundown",
    "description": "Some doubts and one big question have emerged in Donald Trump’s push for Ukraine peace talks.",
    "link": "https://www.nbcnews.com/news/us-news/-ukraine-peace-talks-heat-wave-southwest-morning-rundown-rcna225998",
    "timestamp": "2025-08-20T11:14:05Z"
  },
  {
    "title": "India's State-Run Refiners Ramp Up Russian Oil Buying Despite US Criticism",
    "description": "India’s state-run refiners have returned to buying Russian oil after a brief pause, despite the South Asian nation facing higher tariffs for the trade and a volley of criticism from Trump officials. Processors including Indian Oil Corp. and Bharat Petroleum C…",
    "link": "https://www.ndtvprofit.com/economy-finance/indias-state-run-refiners-ramp-up-russian-oil-buying-despite-us-criticism",
    "timestamp": "2025-08-20T11:12:26Z"
  },
  {
    "title": "Corporate America is silent as Trump abandons free-market principles | CNN Business",
    "description": "Not long ago, American conservative orthodoxy held that when it comes to doing business, the government that governs least governs best.",
    "link": "https://www.cnn.com/2025/08/20/business/companies-trump-free-market",
    "timestamp": "2025-08-20T11:10:46Z"
  },
  {
    "title": "NATO defense chiefs hold a virtual meeting on security guarantees for Ukraine",
    "description": "NATO defense chiefs are holding a virtual meeting to discuss security guarantees for Ukraine as part of efforts to end Russia's war on its neighbor",
    "link": "https://abcnews.go.com/International/wireStory/nato-defense-chiefs-hold-virtual-meeting-security-guarantees-124801460",
    "timestamp": "2025-08-20T11:10:17Z"
  },
  {
    "title": "Andrew Lownie removed the Melania Trump-Jeffrey Epstein sections from his book",
    "description": "Embed from Getty Images Author/journalist Michael Wolff has written extensively about Donald Trump, Melania, Jeffrey Epstein and the ties that bind. Wolff recently reiterated his belief/knowledge of Melania’s involvement in Epstein’s circle in the 1990s, and …",
    "link": "https://www.celebitchy.com/936919/andrew_lownie_removed_the_melania_trump-jeffrey_epstein_sections_from_his_book/",
    "timestamp": "2025-08-20T11:06:17Z"
  },
  {
    "title": "Intel rescue will depend on Trump as investor — and pitchman",
    "description": "The US government is considering taking a stake in Intel to bolster domestic chip production, even as analysts question whether funding alone can revive the company. Securing customer commitments for Intel's foundry business remains a key challenge. SoftBank'…",
    "link": "https://economictimes.indiatimes.com/tech/technology/intel-rescue-will-depend-on-trump-as-investor-and-pitchman/articleshow/123408764.cms",
    "timestamp": "2025-08-20T11:01:34Z"
  },
  {
    "title": "Florida tragedy shows why Trump’s trucking license crackdown is needed",
    "description": "Deadly Florida truck accident exposes broken CDL licensing system as President Trump and Transportation Secretary Duffy push for stricter driver requirements.",
    "link": "https://www.foxnews.com/opinion/florida-tragedy-shows-why-trumps-trucking-license-crackdown-is-needed",
    "timestamp": "2025-08-20T11:00:33Z"
  },
  {
    "title": "Federal Reserve Governor Calls For Regulators To Embrace Crypto",
    "description": "Federal Reserve (Fed) Governor Michelle Bowman is urging US regulators to abandon their “overly cautious mind-set” regarding cryptocurrencies, blockchain technology, and artificial intelligence (AI).  Speaking at the Wyoming Blockchain Symposium, Bowman empha…",
    "link": "https://bitcoinist.com/fed-governor-calls-for-regulators-to-embrace-crypto/",
    "timestamp": "2025-08-20T11:00:23Z"
  },
  {
    "title": "Trump world insiders worried they could be sitting on a 'ticking time bomb': report",
    "description": "There are growing fears within Trump world that the economic path Donald Trump is taking the country down is poised to go south now that the impact of his tariffs is starting to take effect.According to a report from Wired’s Jake Lahut, the tariffs combined w…",
    "link": "https://www.rawstory.com/trump-time-bomb-lahut/",
    "timestamp": "2025-08-20T11:00:05Z"
  },
  {
    "title": "Trump's afterlife fear sparks fresh health concerns... | 'I'm not doing well'...",
    "description": "Donald Trump has sparked fresh health fears after admitting he's worried he won't get into heaven, with social media users speculating that \"he knows he's dying\"",
    "link": "https://www.themirror.com/news/us-news/donald-trump-heaven-fears-health-1339753",
    "timestamp": "2025-08-20T11:00:03Z"
  },
  {
    "title": "'The View' co-host Ana Navarro rips Melania Trump's Putin letter as 'so hypocritical you can't believe it'",
    "description": "Ana Navarro of \"The View\" claimed first lady Melania Trump was a hypocrite for writing a “peace letter\" to Russian President Vladimir Putin while ignoring her husband.",
    "link": "https://www.foxnews.com/media/the-view-co-host-ana-navarro-rips-melania-trumps-putin-letter-so-hypocritical-you-cant-believe-it",
    "timestamp": "2025-08-20T11:00:03Z"
  },
  {
    "title": "China Is the Big Winner of the Trump-Putin Summit | Opinion",
    "description": "It was clear that the Anchorage summit was a disappointment for the American side.",
    "link": "https://www.newsweek.com/china-big-winner-trump-putin-summit-opinion-2116005",
    "timestamp": "2025-08-20T11:00:02Z"
  },
  {
    "title": "New Report Says American Consumers Are Ready To Embrace Chinese EVs",
    "description": "A new report by Dave Cantin Group says U.S. consumers are ready to buy Chinese-made electric vehicles because they're more affordable",
    "link": "https://www.forbes.com/sites/billkoenig/2025/08/20/new-report-says-american-consumers-are-ready-to-embrace-chinese-evs/",
    "timestamp": "2025-08-20T11:00:00Z"
  },
  {
    "title": "How many wars has President Trump ended?",
    "description": "US President Donald Trump claims to have ended seven wars - is that true?",
    "link": "https://www.bbc.co.uk/news/articles/c5y3599gx4qo",
    "timestamp": "2025-08-20T10:59:33Z"
  },
  {
    "title": "“We owe it to Ukrainians”: Stephen A. Smith defends Donald Trump and points to Joe Biden Obama and Bill Clinton for Russia Ukraine conflict",
    "description": "Stephen A. Smith, on his podcast, defended Donald Trump, asserting he didn't initiate the Russia-Ukraine war. Smith argued that Joe Biden, as president during the full-scale conflict, bears responsibility. He further contended that decisions by Barack Obama, …",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/we-owe-it-to-ukrainians-stephen-a-smith-defends-donald-trump-and-points-to-joe-biden-obama-and-bill-clinton-for-russia-ukraine-conflict/articleshow/123408554.cms",
    "timestamp": "2025-08-20T10:57:40Z"
  },
  {
    "title": "Why oil price smile could leave traders in tears",
    "description": "A peculiar \"smile\" has emerged in the oil futures market, with backwardation defying expectations of a significant supply glut through 2026. Despite forecasts from major agencies predicting oversupply, the forward curve indicates a tightening market, potentia…",
    "link": "https://economictimes.indiatimes.com/news/international/business/why-oil-price-smile-could-leave-traders-in-tears/articleshow/123408596.cms",
    "timestamp": "2025-08-20T10:56:02Z"
  },
  {
    "title": "Links 8/20/2025",
    "description": "Our riveting daily links: radioactive Walmart shrimp, pandemic preparedness worries, China bees thrive as US' die, England drought, Trump hearts Netanyahu, EU smackdown re Russia...or Plan B? opposition to license plate scans, US new housing starts crash, gen…",
    "link": "https://www.nakedcapitalism.com/2025/08/links-8-20-2025.html",
    "timestamp": "2025-08-20T10:55:46Z"
  },
  {
    "title": "European military stocks fall on Ukraine peace talks progress",
    "description": "Defense companies were thriving as Western nations armed Kiev and boosted their own industries citing an alleged threat from Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/business/623308-european-military-stocks-dive-ukraine/",
    "timestamp": "2025-08-20T10:55:09Z"
  },
  {
    "title": "Why 'Chelsea's trophy' is in the US president's office",
    "description": "Why is a Club World Cup trophy in US President Donald Trump's Oval Office in Washington? BBC Sport takes a look.",
    "link": "https://www.bbc.com/sport/football/articles/cp3e20kk0l2o",
    "timestamp": "2025-08-20T10:54:28Z"
  },
  {
    "title": "Elon Musk reportedly eyeing JD Vance for 2028 as he hits the brakes on plans for a new political party",
    "description": "Elon Musk is reportedly putting the brakes on launching his new political party in order to maintain ties with prominent Republicans -- especially Vice President JD Vance, who the billionaire is eyeing to back in 2028.",
    "link": "https://nypost.com/2025/08/20/us-news/elon-musk-pledges-to-start-new-political-party/",
    "timestamp": "2025-08-20T10:50:04Z"
  },
  {
    "title": "Donald Tusk trashes Budapest as possible Ukraine talks venue",
    "description": "\"Maybe I’m superstitious, but this time I would try to find another place,” says Polish PM as he recalls 1994 memorandum.",
    "link": "https://www.politico.eu/article/polish-pm-donald-tusk-criticizes-budapest-possible-ukraine-talks-venue-putin-zelenskyy/",
    "timestamp": "2025-08-20T10:49:44Z"
  },
  {
    "title": "Kamala Harris Praises Texas Democrat Who Defied GOP Order: A Hero 'Of This Moment'",
    "description": "Nicole Collier spent two nights inside the Texas Capitol after she was barred from leaving the building over her refusal to agree to 24-hour police surveillance.",
    "link": "https://www.huffpost.com/entry/kamala-harris-praises-nicole-collier-texas_n_68a58efce4b021f222364833",
    "timestamp": "2025-08-20T10:48:51Z"
  },
  {
    "title": "Elizabeth Warren Says Elon Musk's SpaceX Is Paying Less Tax Than You But Getting 'Billions' From The Government: Trump And GOP 'Rigged' The Tax Code",
    "description": "Sen. Elizabeth Warren (D-Mass.) has accused Elon Musk's SpaceX of benefiting from billions in U.S. government contracts while paying little to no federal...",
    "link": "https://finance.yahoo.com/news/elizabeth-warren-says-elon-musks-104613445.html",
    "timestamp": "2025-08-20T10:46:13Z"
  },
  {
    "title": "Melania’s “Dear Putin” letter is about MAGA sexism, not peace",
    "description": "Even a deadly war can't get in the way of pushing cartoonishly retro gender roles",
    "link": "https://www.salon.com/2025/08/20/melanias-dear-putin-letter-is-about-maga-sexism-not-peace/",
    "timestamp": "2025-08-20T10:45:27Z"
  },
  {
    "title": "Anthony Scaramucci 'Cautiously' Predicts Bitcoin At $180K by End of 2025",
    "description": "The SkyBridge Capital boss predicts major institutional investment will continue, with the likes of JPMorgan mainly backing Bitcoin ETFs.",
    "link": "https://decrypt.co/335977/anthony-scaramucci-cautiously-predicts-bitcoin-at-180k-by-end-of-2025",
    "timestamp": "2025-08-20T10:45:15Z"
  },
  {
    "title": "Trump rules out sending US troops to defend Ukraine",
    "description": "WASHINGTON: Former US President Donald Trump assured on Tuesday that he would not send American troops to protect Ukraine from Russia, despite having left the possibility open a day earlier. In a television interview, Trump described Ukraine’s hopes of joinin…",
    "link": "https://english.khabarhub.com/2025/20/491872/",
    "timestamp": "2025-08-20T10:45:01Z"
  },
  {
    "title": "'Washed up has-been loser!' White House erupts at famed rocker for criticizing Trump decor",
    "description": "The White House clapped back at the White Stripes front man Jack White after the famed rocker criticized President Donald Trump’s Oval Office makeover\r\n on Tuesday, calling the Grammy Award-winning musician a “washed up” and “has-been loser.”Long a vocal crit…",
    "link": "https://www.rawstory.com/white-stripes-trump-white-house/",
    "timestamp": "2025-08-20T10:44:24Z"
  },
  {
    "title": "CNN Data Shows Gavin Newsom’s Strategy Against Trump Is ‘Absolutely’ Paying Off",
    "description": "CNN Chief Data Analyst Harry Enten showed off numbers which suggest California Gov. Gavin Newsom's strategy against President Donald Trump is paying off.\nThe post CNN Data Shows Gavin Newsom’s Strategy Against Trump Is ‘Absolutely’ Paying Off first appeared o…",
    "link": "https://www.mediaite.com/media/tv/cnn-data-shows-gavin-newsoms-strategy-against-trump-is-absolutely-paying-off/",
    "timestamp": "2025-08-20T10:43:28Z"
  },
  {
    "title": "A Stock-Market Crash Foretold",
    "description": "On the eve of World War I, when it was already apparent that the geopolitical order was crumbling, the stock market remained buoyant. There is every reason to believe that the US stock market's current sky-high valuations, despite obvious geopolitical and eco…",
    "link": "https://www.project-syndicate.org/commentary/trump-economic-policy-could-lead-to-us-stock-market-crash-by-desmond-lachman-2025-08",
    "timestamp": "2025-08-20T10:43:06Z"
  },
  {
    "title": "Gold Edges Up as Traders Await Powell Speech for Fed Rate Clues",
    "description": "Bullion traded above $3,320 an ounce as markets await clues from Powell’s annual address in Jackson Hole, Wyoming, on Friday.  Swaps are pricing in a high...",
    "link": "https://finance.yahoo.com/news/gold-holds-fall-ahead-powell-003832036.html",
    "timestamp": "2025-08-20T10:37:29Z"
  },
  {
    "title": "'Embarrassing for them': MAGA called out after Newsom 'exposes their humiliating behavior'",
    "description": "A progressive analyst fired back at President Donald Trump's supporters, who are calling on a prominent Democratic lawmaker to shape up his online behavior. For the last several days, California Gov. Gavin Newsom has been trolling Trump online by imitating hi…",
    "link": "https://www.rawstory.com/trump-2673902803/",
    "timestamp": "2025-08-20T10:36:48Z"
  },
  {
    "title": "The US government wants a 10% stake in Intel in return for that CHIPS act cash",
    "description": "A 'piece of the action' for the taxpayer...",
    "link": "https://www.pcgamer.com/hardware/processors/the-us-government-wants-a-10-percent-stake-in-intel-in-return-for-that-chips-act-cash/",
    "timestamp": "2025-08-20T10:35:12Z"
  },
  {
    "title": "Ukraine: NATO defense chiefs to talk security guarantees",
    "description": "As the possibility of direct talks between Ukraine's Volodymyr Zelenskyy and Russian President Vladimir Putin rises, European defense leaders are discussing potential security guarantees for Kyiv. DW has more.",
    "link": "https://www.dw.com/en/ukraine-nato-defense-chiefs-to-talk-security-guarantees/live-73700979",
    "timestamp": "2025-08-20T10:33:00Z"
  },
  {
    "title": "Ukraine: NATO defense chiefs talk security guarantees",
    "description": "As the possibility of direct talks between Ukraine's Volodymyr Zelenskyy and Russia's Vladimir Putin rises, European defense leaders discussed security guarantees and confirmed their support for Kyiv. DW has more. NATO military leaders held a video conference…",
    "link": "https://www.dw.com/en/ukraine-nato-defense-chiefs-talk-security-guarantees/live-73700979",
    "timestamp": "2025-08-20T10:33:00Z"
  },
  {
    "title": "NATO defense chiefs hold a virtual meeting on security guarantees for Ukraine",
    "description": "Italian Admiral Giuseppe Cavo Dragone, chair of NATO’s Military Committee, said that 32 defense chiefs from across the alliance would hold a video conference as a US-led diplomatic push seeks to end the fighting.",
    "link": "https://indianexpress.com/article/world/nato-defense-chiefs-meeting-on-security-guarantees-for-ukraine-10200654/",
    "timestamp": "2025-08-20T10:32:47Z"
  },
  {
    "title": "Captain Kingdom & Captain France in The Daily LITG, 20th August, 2025",
    "description": "Captain Kingdom And Captain France was the most-read stories on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past six years. Founded sixteen years ago and steeped in a histo…",
    "link": "https://bleedingcool.com/comics/captain-kingdom-captain-france-in-the-daily-litg-20th-august-2025/",
    "timestamp": "2025-08-20T10:31:03Z"
  },
  {
    "title": "Veterans fear Trump creating conditions for another Kent State",
    "description": "War veterans worry escalating violence could be \"politically advantageous\" for Trump.",
    "link": "https://www.salon.com/2025/08/20/veterans-fear-trump-creating-conditions-for-another-kent-state/",
    "timestamp": "2025-08-20T10:30:22Z"
  },
  {
    "title": "US Navy’s sea drone program to challenge China is hitting setbacks",
    "description": "Recent U.S. Navy tests of autonomous drone boats faced setbacks, including collisions and software glitches, raising concerns about the Pentagon's push for a fully autonomous naval fleet. These incidents, involving vessels from Saronic and BlackSea Technologi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-navys-sea-drone-program-to-challenge-china-is-hitting-setbacks/articleshow/123407959.cms",
    "timestamp": "2025-08-20T10:26:57Z"
  },
  {
    "title": "Nancy Mace introduces ludicrous ‘Trans Mice Act’ after false Trump claims",
    "description": "Firebrand MAGA Republican Nancy Mace has introduced the TRANS MICE Act after US president Donald Trump falsely claimed the Biden administration spent millions of dollars to “make mice transgender”. Mace, a representative from South Carolina who has made a nam…",
    "link": "https://www.thepinknews.com/2025/08/20/nancy-mace-introduces-ludicrous-trans-mice-act-after-false-trump-claims/",
    "timestamp": "2025-08-20T10:19:31Z"
  },
  {
    "title": "White House Spox Totally Loses It Over Rock Star's Trump Takedown",
    "description": "Steven Cheung lashed out after Donald Trump's Oval Office decor was described as \"vulgar.\"",
    "link": "https://www.huffpost.com/entry/white-house-melts-down-jack-white_n_68a58c69e4b0a58e15423bea",
    "timestamp": "2025-08-20T10:18:55Z"
  },
  {
    "title": "US Fed minutes could show whether Waller and Bowman had company in favoring rate cuts soon",
    "description": "The Federal Reserve's recent decision to hold interest rates steady sparked debate, with some officials advocating for cuts to protect the job market. Disappointing job creation figures and downward revisions to previous months' data fueled concerns. However,…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-fed-minutes-could-show-whether-waller-and-bowman-had-company-in-favoring-rate-cuts-soon/articleshow/123407751.cms",
    "timestamp": "2025-08-20T10:18:27Z"
  },
  {
    "title": "Market Wrap: Sensex rises 213 points, Nifty tops 25,000 in 5-day winning run ahead of US Fed symposium",
    "description": "Indian benchmark indices Sensex and Nifty extended their winning streak to a fifth session Wednesday, lifted by IT shares, as investors looked ahead to the Federal Reserve’s Jackson Hole symposium later this week.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-rises-213-points-nifty-tops-25000-in-5-day-winning-run-ahead-of-us-fed-symposium/articleshow/123407589.cms",
    "timestamp": "2025-08-20T10:17:44Z"
  },
  {
    "title": "Iran Says New Missiles Ready for War",
    "description": "Iranian defense minister warns that country's more advanced missiles are ready to strike—if Israel launches another attack.",
    "link": "https://www.newsweek.com/iran-new-missiles-ready-war-israel-2116106",
    "timestamp": "2025-08-20T10:17:41Z"
  },
  {
    "title": "Trump Orders Kristi Noem to Paint ‘the Entire Southern Border Wall Black’ to Make It ‘Even Harder’ For People to Climb in Scorching Heat",
    "description": "Secretary of Homeland Secretary Kristi Noem announced that President Donald Trump had ordered her to paint \"the entire southern border wall black.\"\nThe post Trump Orders Kristi Noem to Paint ‘the Entire Southern Border Wall Black’ to Make It ‘Even Harder’ For…",
    "link": "https://www.mediaite.com/media/news/trump-orders-kristi-noem-to-paint-the-entire-southern-border-wall-black-to-make-it-even-harder-for-people-to-climb-in-scorching-heat/",
    "timestamp": "2025-08-20T10:16:52Z"
  },
  {
    "title": "Texas Republicans set to approve Trump-backed new congressional map after lengthy fight",
    "description": "(Reuters) -Texas Republicans on Wednesday will take up a new state congressional map intended to flip five Democratic-held U.S. House seats in next year's midterm elections, after dozens of Democratic lawmakers ended a two-week walkout that had temporarily bl…",
    "link": "https://www.thestar.com.my/news/world/2025/08/20/texas-republicans-set-to-approve-trump-backed-new-congressional-map-after-lengthy-fight",
    "timestamp": "2025-08-20T10:16:00Z"
  },
  {
    "title": "Prof G says tariff ‘nonsense’ gives away auto industry dominance to other countries — is Trump’s protectionism failing?",
    "description": "He is not alone in sounding the alarm.",
    "link": "https://finance.yahoo.com/news/prof-g-says-tariff-nonsense-101500408.html",
    "timestamp": "2025-08-20T10:15:00Z"
  },
  {
    "title": "'Absolutely horrible': GOP's new attack slammed by Dem robbed of seat",
    "description": "With Texas Republicans convening a special legislative session this week to create five new Republican congressional seats and Democratic states such as California poised to retaliate, the redistricting battle is entering a phase of open political warfare.Wil…",
    "link": "https://www.rawstory.com/raw-investigates/texas-redistricting-2673901422/",
    "timestamp": "2025-08-20T10:12:58Z"
  },
  {
    "title": "$63 billion in tax relief for America's seniors? Here's when the new changes in Social Security will begin",
    "description": "President Trump's 'One Big Beautiful Bill,' enacted on July 4th, introduces a $6,000 tax deduction for seniors aged 65 and older, potentially exempting 88% from Social Security taxes. While offering immediate relief to middle and upper-middle-class retirees, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-63-billion-in-tax-relief-for-americas-seniors-heres-when-the-new-changes-in-social-security-will-begin/articleshow/123407559.cms",
    "timestamp": "2025-08-20T10:12:35Z"
  },
  {
    "title": "US stock futures lower as investors await more earnings, hint of Fed rate cut",
    "description": "Before the opening bell, Minnesota-based retailer Target and home improvement company Lowe's are slated to report quarterly results.",
    "link": "https://www.usatoday.com/story/money/markets/2025/08/20/us-stocks-wednesday-retailer-earnings-rates/85734078007/",
    "timestamp": "2025-08-20T10:12:19Z"
  },
  {
    "title": "Swatch ad that sparked backlash puts focus on risky campaigns amid diversity rollbacks",
    "description": "(Reuters) -In an era of short attention spans and a White House that has declared war on diversity programs, companies are embracing edgier marketing.  Swiss...",
    "link": "https://uk.finance.yahoo.com/news/swatch-ad-sparked-backlash-puts-100959146.html",
    "timestamp": "2025-08-20T10:09:59Z"
  },
  {
    "title": "US Soybean Farmers Warn Trump: Without A China Trade Deal, America Risks Losing Billions As Beijing Turns To Brazil",
    "description": "U.S. soybean farmers have urged President Donald Trump to secure a trade deal with China that includes substantial soybean purchases, warning of severe long-term economic consequences if the U.S. crop continues to be shunned.\nASA urges Trump to secure China s…",
    "link": "https://biztoc.com/x/c7248e07e778064e",
    "timestamp": "2025-08-20T10:09:06Z"
  },
  {
    "title": "For Putin, 'Security Guarantees' on Ukraine Mean Something Different",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nRussia, Ukraine and European powers have all emerged from meetings with President Donald Trump in support of establishing security guarantees as part of a broader agreement to put an end to the bloody war betw…",
    "link": "https://biztoc.com/x/54142ba9eacf0e75",
    "timestamp": "2025-08-20T10:08:50Z"
  },
  {
    "title": "Exclusive-The US Navy is building a drone fleet to take on China. It's not going well",
    "description": "NEW YORK (Reuters) -During a U.S. naval test off the California coast last month, which was designed to showcase the Pentagon’s top autonomous drone boats...",
    "link": "https://finance.yahoo.com/news/exclusive-us-navy-building-drone-100530064.html",
    "timestamp": "2025-08-20T10:05:30Z"
  },
  {
    "title": "Netanyahu a ‘war hero’ – Trump",
    "description": "The praise comes as the Israeli prime minister faces severe criticism over starvation and continued hostilities in Gaza Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623318-netanyahu-war-hero-trump/",
    "timestamp": "2025-08-20T10:02:11Z"
  },
  {
    "title": "Can India and the U.S. Repair Their Relationship?",
    "description": "Trump’s 50 percent tariffs don’t need to burn the bridge.",
    "link": "http://foreignpolicy.com/2025/08/20/india-us-relationship-tariffs/",
    "timestamp": "2025-08-20T10:00:47Z"
  },
  {
    "title": "California Democrats Release Plan to Redraw Congressional Maps",
    "description": "If the legislature approves these maps, voters will have the final say in a special election this November.",
    "link": "https://www.kqed.org/news/12052802/12052802",
    "timestamp": "2025-08-20T10:00:33Z"
  },
  {
    "title": "Stefanik booed offstage as protesters chant 'traitor' during upstate New York memorial event",
    "description": "Potential Republican gubernatorial candidate Rep. Elise Stefanik was disrupted by protesters at a memorial event in her home district in upstate New York.",
    "link": "https://www.foxnews.com/politics/stefanik-booed-offstage-protesters-chant-traitor-during-upstate-new-york-memorial-event",
    "timestamp": "2025-08-20T10:00:20Z"
  },
  {
    "title": "Alaska summit provides a glimpse into what peace looks like to Putin and Trump",
    "description": "Trump and Putin's vision for the future is likely to be tough for Ukraine to accept.",
    "link": "https://www.salon.com/2025/08/20/alaska-summit-provides-a-glimpse-into-what-peace-looks-like-to-putin-and-trump_partner/",
    "timestamp": "2025-08-20T10:00:08Z"
  },
  {
    "title": "Nikki Haley: Trump Needs To Rebuild U.S.-India Relationship | Opinion",
    "description": "To achieve the Trump administration's foreign policy goals—outcompeting China—few objectives are more critical than getting U.S.-India relations back on track.",
    "link": "https://www.newsweek.com/nikki-haley-trump-needs-rebuild-us-india-relationship-opinion-2114995",
    "timestamp": "2025-08-20T10:00:01Z"
  },
  {
    "title": "For Putin, 'Security Guarantees' on Ukraine Mean Something Different",
    "description": "Putin seeks \"a multilateral system of commitments that includes not only the West but also Russia itself,\" one expert told Newsweek.",
    "link": "https://www.newsweek.com/putin-security-guarantees-ukraine-mean-something-different-2116016",
    "timestamp": "2025-08-20T10:00:01Z"
  },
  {
    "title": "RFK Jr. Vowed to Find the Environmental Causes of Autism. Then He Shut Down Research Trying to Do Just That.",
    "description": "by Sharon Lerner \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nErin McCanlies was listening to the radio one morning in April when she heard …",
    "link": "https://www.propublica.org/article/rfk-jr-autism-environment-research-funding",
    "timestamp": "2025-08-20T10:00:00Z"
  },
  {
    "title": "The Trump administration’s worrisome new focus on this group’s ‘good moral character’",
    "description": "A policy memo from the United States Citizenship and Immigration Services calls for more emphasis on applicants’ “good moral character.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-uscis-citizenship-moral-character-rcna225846",
    "timestamp": "2025-08-20T10:00:00Z"
  },
  {
    "title": "Trump’s Antitrust Policy Is Fascist Too",
    "description": "The dominant business news story remains President Donald Trump’s push to revive fascist corporatism (the business press is too polite to call it that) by regulating the economy out of his back pocket, with the latest news that Trump wants to use CHIPS and Sc…",
    "link": "https://newrepublic.com/article/199296/trump-antitrust-policy-self-enrichment",
    "timestamp": "2025-08-20T10:00:00Z"
  },
  {
    "title": "Meet The Ex-NASA Engineer Training Robots To Make Pre-Roll Joints",
    "description": "Nohtal Partansky’s Sorting Robotics equipment is used by some of the biggest names in the cannabis industry, from Stiiizy to Tilray. Now he’s gearing up for when Big Tobacco is ready to roll.",
    "link": "https://www.forbes.com/sites/willyakowicz/2025/08/20/meet-the-ex-nasa-engineer-training-robots-to-make-pre-roll-joints/",
    "timestamp": "2025-08-20T10:00:00Z"
  },
  {
    "title": "Trump’s Takeover of D.C. Is Not a Distraction. It’s the Whole Point.",
    "description": "The military\nparade in June was just practice, it turns out. For more than a week, the\nnation has watched federal officers and even camouflaged\ntroops patrolling the streets of Washington, D.C., causing increasing amounts\nof violence\nand mayhem. Videos of age…",
    "link": "https://newrepublic.com/article/199298/trump-federal-takeover-dc-authoritarianism-not-crime",
    "timestamp": "2025-08-20T10:00:00Z"
  },
  {
    "title": "The Bipartisan Roots of Trump’s Cruel Crackdown on the Homeless",
    "description": "Under President Donald Trump’s guidance, federal authorities have stepped up their attacks on homeless Americans this past week, with a move to clear encampments in Washington a centerpiece of the multi-agency crackdown underway in the nation’s capital. Last …",
    "link": "https://newrepublic.com/article/199137/trump-escalating-bipartisan-attack-homeless",
    "timestamp": "2025-08-20T10:00:00Z"
  },
  {
    "title": "Stephen A Smith praises Trump for handling of Russia-Ukraine negotiations",
    "description": "ESPN's Stephen A. Smith praised Trump for Russia-Ukraine negotiations, as one of the few prominent figures on the left to praise Trump.",
    "link": "https://www.foxnews.com/sports/stephen-a-smith-praises-trump-handling-russia-ukraine-negotiations",
    "timestamp": "2025-08-20T09:58:51Z"
  }
]