[
  {
    "title": "Donald Trump was told by US Justice Department that he is in the Epstein files, Wall Street Journal reports",
    "description": "US Attorney General Pam Bondi told President Donald Trump in May that his name appeared in investigative files related to convicted sex offender Jeffrey Epstein, the Wall Street Journal reported on Wednesday.",
    "link": "https://www.independent.ie/world-news/donald-trump-was-told-by-us-justice-department-that-he-is-in-the-epstein-files-wall-street-journal-reports/a104072159.html",
    "timestamp": "2025-07-24T06:21:43Z"
  },
  {
    "title": "Charles Michel asks: ‘Where’s the EU’s China policy?’",
    "description": "In today’s edition of The Capitals, read about a Ukrainian MP hitting back at Brussels' corruption warnings, a scoop on the Commission reviving the equality law, and ambassadors landing in Greenland.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-charles-michel-asks-wheres-the-eus-china-policy/",
    "timestamp": "2025-07-24T06:20:50Z"
  },
  {
    "title": "Indonesia-US trade deal limits data transfer scope",
    "description": "The Presidential Communication Office (PCO) clarified that the personal data transfer arrangement in the Indonesia-United States trade deal will be restricted ...",
    "link": "https://en.antaranews.com/news/368549/indonesia-us-trade-deal-limits-data-transfer-scope",
    "timestamp": "2025-07-24T06:20:24Z"
  },
  {
    "title": "Tesla's finance chief says Americans should buy its cars now — Trump's Big Beautiful Bill could affect later deliveries",
    "description": "Tesla's chief financial officer, Vaibhav Taneja, said that President Donald Trump's tax bill could affect the availability of its cars.",
    "link": "https://www.businessinsider.com/tesla-americans-buy-cars-now-cfo-trump-tax-ev-credit-2025-7",
    "timestamp": "2025-07-24T06:19:35Z"
  },
  {
    "title": "Toy makers nix batteries and other materials to save costs amid tariff war",
    "description": "The duties imposed by U.S. President Donald Trump are particularly painful for companies like Hasbro and Mattel, as 80% of toys sold in the U.S. come from China.",
    "link": "https://www.japantimes.co.jp/business/2025/07/24/markets/toy-batteries-tariff-war/",
    "timestamp": "2025-07-24T06:18:00Z"
  },
  {
    "title": "Tesla likely faces 'a few rough quarters', Musk says",
    "description": "Tesla chief executive Elon Musk said that US government cuts in support for electric vehicle makers could lead to a \"few rough quarters\" for the company before a wave of revenue from self-driving software and services begins late next year.",
    "link": "https://www.rte.ie/news/business/2025/0724/1525080-tesla-quarterly-results/",
    "timestamp": "2025-07-24T06:07:57Z"
  },
  {
    "title": "Australia’s US beef ban has been lifted. Why has this changed?",
    "description": "What’s behind the move to start allowing US beef imports, and what does it mean for Australian consumers?",
    "link": "https://www.smh.com.au/business/consumer-affairs/will-lifting-the-us-beef-ban-put-more-foreign-meat-on-menus-20250724-p5mhh5.html",
    "timestamp": "2025-07-24T06:07:38Z"
  },
  {
    "title": "Elon Musk wants more control of Tesla so activist investors can’t boot him—but not so much the board can’t fire him if he goes ‘crazy’",
    "description": "Tesla CEO Elon Musk held his first call with analysts since announcing last quarter he would step back from the Department of Government Efficiency, which was a precursor to his epic fallout with President Donald Trump. The electric vehicle manufacturer repor…",
    "link": "https://biztoc.com/x/c88e3a31019d100f",
    "timestamp": "2025-07-24T06:06:26Z"
  },
  {
    "title": "European leaders press demands on trade at scaled-back summit in Beijing",
    "description": "European leaders have called for a more balanced relationship with China during a summit with President Xi Jinping in Beijing",
    "link": "https://abcnews.go.com/Business/wireStory/european-leaders-press-demands-trade-scaled-back-summit-124020582",
    "timestamp": "2025-07-24T06:06:17Z"
  },
  {
    "title": "Solana block capacity is up 20% and there’s a proposal for it to go even higher",
    "description": "Solana has increased its block capacity by 20%, enabling more transactions per block, another proposal aims to raise the limits even higher by year’s end.",
    "link": "https://cointelegraph.com/news/solana-block-capacity-increase-2025-upgrade-plans",
    "timestamp": "2025-07-24T06:06:12Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Thursday",
    "description": "The German team loses to Spain in the Women's Euro semifinal, the Chancellor meets the French President to discuss trade and security, a swan disrupts railway traffic in Rhineland-Palatinate and more news on Thursday, July 24th.",
    "link": "https://www.thelocal.de/20250724/today-in-germany-a-roundup-of-the-latest-news-on-thursday-80",
    "timestamp": "2025-07-24T06:04:44Z"
  },
  {
    "title": "Pedro Pascal vows never to go clean-shaven again after his ‘appalling’ Wonder Woman 1984 appearance",
    "description": "Actor played villain Maxwell Lord in the DC Comics movie",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/pedro-pascal-clean-shaven-wonder-woman-1984-fantastic-four-b2795006.html",
    "timestamp": "2025-07-24T06:03:52Z"
  },
  {
    "title": "Trump announces ‘massive’ trade deal with Japan",
    "description": "United States President Donald Trump has announced that he has struck a “massive” trade deal with Japan following months of fraught negotiations. Under the agreement announced on Tuesday, the US will impose a 15 percent tariff on Japanese exports and Japan wi…",
    "link": "https://thechronicle.com.gh/trump-announces-massive-trade-deal-with-japan/",
    "timestamp": "2025-07-24T06:01:49Z"
  },
  {
    "title": "Strait of Hormuz: How 30 miles could quadruple oil and gas prices",
    "description": "The Persian Gulf’s chokepoint handles 20 percent of global oil — $600B worth annually. A single blocked tanker could cut 40 percent of shipments, launching gas prices to $12+ per gallon. Saudi Arabia ramped output by 950,000 barrels daily in June amid rising …",
    "link": "https://www.naturalnews.com/2025-07-24-30-miles-could-quadruple-oil-gas-cost.html",
    "timestamp": "2025-07-24T06:00:00Z"
  },
  {
    "title": "Iran will not end its nuclear program and WWIII has only accelerated, despite the government’s insistence that everyone is crazy for suggesting so",
    "description": "In a bold challenge to the United States and Israel, Iran’s newly elected president, Masoud Pezeshkian, has declared that his country will never abandon its nuclear ambitions, despite escalating threats of military action from Western powers. In an incendiary…",
    "link": "https://www.naturalnews.com/2025-07-24-iran-will-not-end-its-nuclear-program-and-wwiii-has-only-accelerated.html",
    "timestamp": "2025-07-24T06:00:00Z"
  },
  {
    "title": "AstraZeneca’s $50B U.S. expansion signals shift in pharma manufacturing amid tariff threat",
    "description": "AstraZeneca is investing $50 billion in U.S. operations by 2030, including its largest-ever manufacturing plant in Virginia specializing in respiratory, cardiovascular and metabolic treatments using AI and advanced techniques. The project will create hundreds…",
    "link": "https://www.naturalnews.com/2025-07-24-astrazeneca-us-expansion-signals-shift-pharma-manufacturing.html",
    "timestamp": "2025-07-24T06:00:00Z"
  },
  {
    "title": "Trump secures sweeping trade deals with Japan, Indonesia and the Philippines",
    "description": "President Donald Trump unveiled significant trade deals with Japan, Indonesia and the Philippines on July 22, aiming to boost American exports, create jobs and rebalance trade relationships ahead of the Aug.1 tariff deadline. The agreement with Japan includes…",
    "link": "https://www.naturalnews.com/2025-07-24-trump-secures-trade-deals-japan-indonesia-philippines.html",
    "timestamp": "2025-07-24T06:00:00Z"
  },
  {
    "title": "U.S. Olympic and Paralympic Committee BANS transgenders from women’s sports, in compliance with President Trump’s order",
    "description": "The U.S. Olympic and Paralympic Committee (USOPC) updated its Athlete Safety Policy to prohibit transgender women from competing in women’s sports, citing compliance with President Donald Trump’s February executive order. The executive order threatens federal…",
    "link": "https://www.naturalnews.com/2025-07-24-usopc-bans-transgender-athletes-from-womens-sports.html",
    "timestamp": "2025-07-24T06:00:00Z"
  },
  {
    "title": "Attention goes offshore as New Zealand sharemarket steady - Market close",
    "description": "NZX CEO Mark Peterson will resign in April 2026 after the annual meeting.",
    "link": "https://www.nzherald.co.nz/business/markets/shares/attention-goes-offshore-as-new-zealand-sharemarket-steady-market-close/EK2CJM4AUVHZTCQMBAGWKG5J44/",
    "timestamp": "2025-07-24T05:59:57Z"
  },
  {
    "title": "No ‘woke AI’ in Washington, Trump says as he launches American AI action plan",
    "description": "Trump has vowed to push back against \"woke\" AI models and to turn the U.S. into an \"AI export powerhouse,\" signing three AI-focused executive orders Wednesday.",
    "link": "https://www.cnbc.com/2025/07/24/no-woke-ai-in-washington-says-trump-as-he-launches-ai-action-plan.html",
    "timestamp": "2025-07-24T05:55:52Z"
  },
  {
    "title": "Vietnam to buy two Lockheed Martin helicopters, sources say, as US trade talks carry on",
    "description": "HANOI (Reuters) -Vietnam's police ministry has agreed to buy two Lockheed Martin helicopters, according to three people with knowledge of the talks, in what ...",
    "link": "https://www.yahoo.com/news/articles/vietnam-buy-two-lockheed-martin-055133328.html",
    "timestamp": "2025-07-24T05:51:33Z"
  },
  {
    "title": "Australia lifts curbs on US beef that angered Trump",
    "description": "Canberra says restrictions will be lifted following a 'rigorous science and risk-based assessment.'",
    "link": "https://www.aljazeera.com/news/2025/7/24/australia-lifts-curbs-on-us-beef-that-angered-trump",
    "timestamp": "2025-07-24T05:49:08Z"
  },
  {
    "title": "PayPal to create 100 jobs with AI fraud centre",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/07/24/paypal-to-create-100-jobs-with-ai-fraud-centre/",
    "timestamp": "2025-07-24T05:48:20Z"
  },
  {
    "title": "Stephen Colbert Jokes ‘I always said’ Elon Musk Is ‘a Good Guy Who’s Right About Everything’ After Latest Trump-Epstein Report | Video",
    "description": "It is a great idea to name a baby 420 Kleep-Klorp 69,\" the \"Late Show\" host adds, sarcastically\nThe post Stephen Colbert Jokes ‘I always said’ Elon Musk Is ‘a Good Guy Who’s Right About Everything’ After Latest Trump-Epstein Report | Video appeared first on T…",
    "link": "https://www.thewrap.com/stephen-colbert-elon-musk-donald-trump-jeffrey-epstein/",
    "timestamp": "2025-07-24T05:47:58Z"
  },
  {
    "title": "Trump was told he is in Epstein files, WSJ reports",
    "description": "US Attorney General Pam Bondi told President Donald Trump in May that his name appeared in investigative files related to convicted sex offender Jeffrey Epstein, the Wall Street Journal has reported.",
    "link": "https://www.rte.ie/news/us/2025/0724/1525074-donald-trump-us/",
    "timestamp": "2025-07-24T05:39:52Z"
  },
  {
    "title": "Trump's trip to Scotland highlights complex relationship with his mother's homeland",
    "description": "U.S. President Donald Trump is visiting Scotland this week, returning to the country where is mother was born and raised",
    "link": "https://abcnews.go.com/International/wireStory/trumps-trip-scotland-highlights-complex-relationship-mothers-homeland-124023618",
    "timestamp": "2025-07-24T05:37:53Z"
  },
  {
    "title": "World’s largest olive oil producer warns U.S. consumers of a double whammy from Trump tariffs",
    "description": "Spain's Deoleo, the world's largest olive oil producer, says U.S. President Donald Trump's threat to impose 30% tariffs on imports from the European Union could translate into higher prices for U.S. consumers — as well as limited access to a superfood staple.…",
    "link": "https://biztoc.com/x/80780f541bf1235a",
    "timestamp": "2025-07-24T05:33:16Z"
  },
  {
    "title": "Australia to reduce US beef import restrictions denounced by Trump as a ban",
    "description": "Australia plans to ease restrictions on U.S. beef imports",
    "link": "https://abcnews.go.com/International/wireStory/australia-reduce-us-beef-import-restrictions-denounced-trump-124023813",
    "timestamp": "2025-07-24T05:32:36Z"
  },
  {
    "title": "Ceasefire ultimate goal in Russia-Ukraine talks: FM",
    "description": "Foreign Minister Hakan Fidan said Wednesday that the ultimate goal of Russia-Ukraine talks is a ceasefire that will pave the way for peace.",
    "link": "https://www.hurriyetdailynews.com/ceasefire-ultimate-goal-in-russia-ukraine-talks-fm-211798",
    "timestamp": "2025-07-24T05:25:11Z"
  },
  {
    "title": "Iran Navy blocks US destroyer USS Fitzgerald near territorial waters: What happened?",
    "description": "Iran Navy Destroyer: A direct encounter between Iran and the US unfolded on Wednesday when an Iranian military helicopter confronted the USS Fitzgerald near the Gulf of Oman. Iran claims the US vessel approached its territorial waters and was warned to leave.…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-navy-destroyer-iran-navy-blocks-us-destroyer-uss-fitzgerald-near-territorial-waters-what-happened/articleshow/122872499.cms",
    "timestamp": "2025-07-24T05:22:38Z"
  },
  {
    "title": "Deutsche Bank posts quarterly profit beat amid uptick at its investment bank",
    "description": "European banks overall are facing the challenge of navigating a lower interest rate environment.",
    "link": "https://www.cnbc.com/2025/07/24/deutsche-bank-dbk-q2-earnings-2025.html",
    "timestamp": "2025-07-24T05:22:35Z"
  },
  {
    "title": "Tariff Talks Between South Korea, US Postponed",
    "description": "High-level talks between South Korea and the United States scheduled for Friday have been postponed at the request of the American side due to sudden changes in the schedule of US Treasury Secretary Scott Bessent, the Yonhap news agency reported on Thursday, …",
    "link": "https://sputnikglobe.com/20250724/tariff-talks-between-south-korea-us-postponed-1122480143.html",
    "timestamp": "2025-07-24T05:18:09Z"
  },
  {
    "title": "Canada’s antisemitism envoy steps down early, citing exhaustion and rising hate crimes",
    "description": "Deborah Lyons, Canada’s antisemitism envoy, resigns abruptly: ‘It was hard to get people to speak up.’",
    "link": "https://www.israelnationalnews.com/news/412168",
    "timestamp": "2025-07-24T05:15:13Z"
  },
  {
    "title": "Australia to reduce US beef import restrictions denounced by Trump as a ban",
    "description": "MELBOURNE, Australia (AP) _ Australia will reduce restrictions on U.S. beef imports after U.S. President Donald Trump criticized what he described as an Australian ban on the meat, Agriculture Minister Julie Collins said. Collins said Thursday that relaxing t…",
    "link": "https://financialpost.com/pmn/australia-to-reduce-us-beef-import-restrictions-denounced-by-trump-as-a-ban",
    "timestamp": "2025-07-24T05:13:34Z"
  },
  {
    "title": "EU heading towards 15% tariff deal with US, EU diplomats say",
    "description": "BRUSSELS (Reuters) -The European Union is heading towards a trade deal with Washington that would result in a broad 15% tariff on EU goods imported into the U.S., avoiding a harsher 30% levy slated to be implemented from August 1, two EU diplomats said on Wed…",
    "link": "https://freerepublic.com/focus/f-news/4330439/posts",
    "timestamp": "2025-07-24T05:12:32Z"
  },
  {
    "title": "World’s largest olive oil producer warns U.S. consumers of a double whammy from Trump tariffs",
    "description": "The European Union is the leading producer, consumer and exporter of olive oil.",
    "link": "https://www.cnbc.com/2025/07/24/olive-oil-deoleo-warns-consumers-of-double-whammy-from-trump-tariffs.html",
    "timestamp": "2025-07-24T05:12:12Z"
  },
  {
    "title": "EU-China summit – who’s attending and what’s on the agenda?",
    "description": "The summit, being hosted in China on Thursday, marks 50 years of diplomatic ties between Brussels and Beijing.",
    "link": "https://www.aljazeera.com/news/2025/7/24/eu-china-summit-who-is-attending-and-whats-on-the-agenda",
    "timestamp": "2025-07-24T05:07:08Z"
  },
  {
    "title": "Iran Acknowledges That US Airstrikes 'Destroyed' Nuclear Facilities",
    "description": "Iran’s foreign minister confirmed this week that U.S. airstrikes left the country’s nuclear facilities “destroyed” but said Iran would continue to enrich uranium. This comes about a month after three facilities were targeted.A satellite image taken the day af…",
    "link": "https://freerepublic.com/focus/f-news/4330438/posts",
    "timestamp": "2025-07-24T05:06:32Z"
  },
  {
    "title": "Indian firm shipped explosives to Russia despite US warnings",
    "description": "An Indian firm shipped explosives worth $1.4 million to Russia in December. The compound, HMX, has military applications. Promsintez, a Russian company, received part of the shipment. Ukraine claims Promsintez has military ties. The US has warned against supp…",
    "link": "https://economictimes.indiatimes.com/news/defence/indian-firm-shipped-explosives-to-russia-despite-us-warnings/articleshow/122872770.cms",
    "timestamp": "2025-07-24T05:06:26Z"
  },
  {
    "title": "South Korea seeks to leverage Trump's focus on shipbuilding in tariff talks",
    "description": "SEOUL (Reuters) -South Korea and the United States have been discussing a shipbuilding tie-up that could include investments to modernise U.S. shipyards and ...",
    "link": "https://www.yahoo.com/news/articles/south-korea-seeks-leverage-trumps-050449900.html",
    "timestamp": "2025-07-24T05:04:49Z"
  },
  {
    "title": "Columbia Will Pay $220 Million To Settle Trump Administration Dispute—President Calls It ‘Historic Agreement’",
    "description": "Columbia University said the deal will help preserve Columbia’s autonomy on hiring, admissions and academic matters.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/07/24/columbia-will-pay-220-million-to-settle-trump-administration-dispute-president-calls-it-historic-agreement/",
    "timestamp": "2025-07-24T05:03:46Z"
  },
  {
    "title": "Labor Department Proposes Over 60 Rule Changes in Push to Deregulate Workplaces",
    "description": "The U.S. Department of Labor is aiming to rewrite or repeal more than 60 “obsolete” workplace regulations, ranging from minimum wage requirements for home health care workers and people with disabilities to standards governing exposure to harmful substances. …",
    "link": "https://www.insurancejournal.com/news/national/2025/07/24/832976.htm",
    "timestamp": "2025-07-24T05:00:44Z"
  },
  {
    "title": "Steeper Road for Zero-Emissions Vehicles",
    "description": "The road to adoption of Zero Emissions Vehicles (ZEVs) is growing steeper. For over two decades, states used incentives and mandates to try to force a transition from gasoline vehicles to ZEVs. But softening market demand, shifting federal policies, and poor …",
    "link": "https://wattsupwiththat.com/2025/07/23/steeper-road-for-zero-emissions-vehicles/",
    "timestamp": "2025-07-24T05:00:00Z"
  },
  {
    "title": "Can Europe break free of American tech supremacy?",
    "description": "Europe’s dependence on US groups for digital infrastructure is causing growing concern among executives and policymakers",
    "link": "https://www.irishtimes.com/business/2025/07/24/can-europe-break-free-of-american-tech-supremacy/",
    "timestamp": "2025-07-24T04:58:00Z"
  },
  {
    "title": "Appeals court upholds block against Trump's effort to end birthright citizenship",
    "description": "The ruling keeps a block on the Trump administration from denying citizenship to children born to people who are in the United States illegally or temporarily.",
    "link": "https://www.npr.org/2025/07/24/nx-s1-5478384/birthright-citizenship-appeals-court-blocks-trump",
    "timestamp": "2025-07-24T04:57:19Z"
  },
  {
    "title": "Gabbard's claims of an anti-Trump conspiracy are not supported by declassified documents",
    "description": "Director of National Intelligence Tulsi Gabbard this month declassified material that she claimed proved a “treasonous conspiracy” by the Obama administration in 2016 to politicize U.S. intelligence in service of casting doubt on the legitimacy of Dona...",
    "link": "https://abcnews.go.com/Politics/wireStory/gabbards-claims-anti-trump-conspiracy-supported-declassified-documents-124023434",
    "timestamp": "2025-07-24T04:54:25Z"
  },
  {
    "title": "Dropkick Murphys exit Punk in the Park festival over founder's Trump campaign donations",
    "description": "Dropkick Murphys announced Wednesday they will no longer be performing at any more Punk in the Park shows after learning the festival’s organizer donated to the Trump campaign.",
    "link": "https://www.nbcnews.com/pop-culture/music/dropkick-murphys-exit-punk-park-festival-founders-trump-campaign-donat-rcna220729",
    "timestamp": "2025-07-24T04:52:25Z"
  },
  {
    "title": "Nvidia supplier SK Hynix to boost spending on AI chips, after record Q2",
    "description": "SK Hynix reported a record quarterly profit driven by strong AI chip demand and customer stockpiling amid potential U.S. tariffs. The company plans to increase capital expenditure, primarily for HBM production, to meet growing demand and maintain its competit…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-supplier-sk-hynix-to-boost-spending-on-ai-chips-after-record-q2/articleshow/122872494.cms",
    "timestamp": "2025-07-24T04:49:40Z"
  },
  {
    "title": "‘South Park’ Season Premiere Rips Paramount’s Trump Settlement With Fake PSA: ‘His Penis Is Teeny Tiny’ | Video",
    "description": "The roasting comes right after Trey Parker and Matt Stone's $1.5 billion global streaming deal with Paramount \nThe post ‘South Park’ Season Premiere Rips Paramount’s Trump Settlement With Fake PSA: ‘His Penis Is Teeny Tiny’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/south-park-season-premiere-roasts-trump-and-paramount/",
    "timestamp": "2025-07-24T04:49:15Z"
  },
  {
    "title": "Australia says US beef will soon be welcome here again. It’s unlikely we’ll buy much of it",
    "description": "Has Australia’s beef industry been sold out for the benefit of a trade deal with the United States? Or is this just a poorly timed announcement?",
    "link": "https://theconversation.com/australia-says-us-beef-will-soon-be-welcome-here-again-its-unlikely-well-buy-much-of-it-261836",
    "timestamp": "2025-07-24T04:49:01Z"
  },
  {
    "title": "Trump Signs New Executive Orders To Fast-Track AI Dominance: 'We Will Be Unstoppable As A Nation'",
    "description": "On Wednesday, President Donald Trump signed a trio of executive orders aimed at accelerating U.S. dominance in artificial intelligence by streamlining data center construction, promoting American AI exports and banning ideologically biased AI from federal con…",
    "link": "https://biztoc.com/x/b1903952bed8e369",
    "timestamp": "2025-07-24T04:48:57Z"
  },
  {
    "title": "Department of Education Deals Blow to Efforts By Woke Universities When It Comes to Non-Citizens",
    "description": "Department of Education Secretary Linda McMahon announced an investigation into several universities that have been accused of giving scholarships to non-citizens.In a statement posted on X on Wednesday, President Donald Trump’s Education Secretary wrote that…",
    "link": "https://freerepublic.com/focus/f-news/4330435/posts",
    "timestamp": "2025-07-24T04:48:48Z"
  },
  {
    "title": "Lok Sabha to hold discussion on Operation Sindoor from July 28: Sources",
    "description": "The Lok Sabha will hold a 16-hour discussion on Operation Sindoor, starting July 28, with Prime Minister Modi participating after his foreign visit. Defence Minister Rajnath Singh will also respond to the deliberations. Rahul Gandhi criticized Modi's silence …",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/lok-sabha-to-hold-discussion-on-operation-sindoor-from-july-28-sources/articleshow/122872426.cms",
    "timestamp": "2025-07-24T04:46:54Z"
  },
  {
    "title": "Texas AG claimed three homes as primary residence. Democrats are being probed for similar issue",
    "description": "Texas Attorney General Ken Paxton and his wife, Angela, are longtime owners of a $1.5 million home in a Dallas suburb",
    "link": "https://abcnews.go.com/Business/wireStory/texas-ag-claimed-homes-primary-residence-democrats-probed-124022890",
    "timestamp": "2025-07-24T04:46:20Z"
  },
  {
    "title": "Texas AG claimed three homes as primary residence. Democrats are being probed for similar issue",
    "description": "Texas Attorney General Ken Paxton and his wife, Angela, are longtime owners of a $1.5 million home in a Dallas suburb",
    "link": "https://abcnews.go.com/Politics/wireStory/texas-ag-claimed-homes-primary-residence-democrats-probed-124022889",
    "timestamp": "2025-07-24T04:46:19Z"
  },
  {
    "title": "Japan’s top global pension fund keeps strategy amid volatility",
    "description": "As it seeks to ride out the turmoil, Japan’s largest pension fund aims to enhance portfolio rebalancing with futures and analyze correlations between different assets.",
    "link": "https://www.japantimes.co.jp/business/2025/07/24/economy/japan-pension-fund-strategy/",
    "timestamp": "2025-07-24T04:38:00Z"
  },
  {
    "title": "Morning Bid: Trade deals bring happy days again",
    "description": "A look at the day ahead in European and global markets from Rocky Swift You get a trade deal! You get a trade deal! Everybody gets a trade deal!",
    "link": "https://finance.yahoo.com/news/morning-bid-trade-deals-bring-043557728.html",
    "timestamp": "2025-07-24T04:35:57Z"
  },
  {
    "title": "‘South Park’ creators secure $1.5 billion streaming deal with Paramount, skewer Trump in Season 27 premiere",
    "description": "South Park creators, Trey Parker and Matt Stone, have inked a monumental $1.5 billion deal with Paramount Global, securing exclusive streaming rights for the series on Paramount+. The agreement includes all past seasons and 50 new episodes over five years. Se…",
    "link": "https://economictimes.indiatimes.com/news/international/us/south-park-creators-secure-1-5-billion-streaming-deal-with-paramount-skewer-trump-in-season-27-premiere/articleshow/122871983.cms",
    "timestamp": "2025-07-24T04:32:12Z"
  },
  {
    "title": "Letters: Oral healthcare needs to be promoted and made affordable and accessible",
    "description": "Eilish O’Regan’s article (‘Tens of thousands of children finishing primary school without dental checks due to lack of HSE dentists’, Independent.ie, July 21) made for sober reading.",
    "link": "https://www.independent.ie/opinion/letters/letters-oral-healthcare-needs-to-be-promoted-and-made-affordable-and-accessible/a1951375268.html",
    "timestamp": "2025-07-24T04:30:00Z"
  },
  {
    "title": "Donald Trump’s Doonbeg links an Irish Open candidate",
    "description": "West Clare could become the epicentre of world golf next September with talks ongoing to stage the Amgen Irish Open at Donald Trump-owned Doonbeg –  just a week after Lahinch hosts the 51st Walker Cup.",
    "link": "https://www.independent.ie/sport/golf/donald-trumps-doonbeg-links-an-irish-open-candidate/a481794926.html",
    "timestamp": "2025-07-24T04:30:00Z"
  },
  {
    "title": "Ukraine and Russia agree to new prisoner swap during brief talks",
    "description": "Ukraine brought home a new group of prisoners of war from Russia yesterday, president Volodymyr Zelensky said, saying it brought to more than 1,000 the number of returning soldiers as agreed at talks in Turkey.",
    "link": "https://www.independent.ie/world-news/europe/ukraine-and-russia-agree-to-new-prisoner-swap-during-brief-talks/a284753516.html",
    "timestamp": "2025-07-24T04:30:00Z"
  },
  {
    "title": "Donald Trump’s tariff threat means mortgage holders must wait for a further ECB cut in interest rates",
    "description": "The uncertainty caused by US tax and tariff policies means European Central Bank (ECB) governors are not expected to cut rates again when they meet today.",
    "link": "https://www.independent.ie/business/money/donald-trumps-tariff-threat-means-mortgage-holders-must-wait-for-a-further-ecb-cut-in-interest-rates/a70379019.html",
    "timestamp": "2025-07-24T04:30:00Z"
  },
  {
    "title": "Which ASX 200 stock offers 'material upside' amid continuing uncertainty over US tariffs?",
    "description": "Blackwattle Investment has identified one ASX 200 large-cap stock that is thriving on the uncertainty. \nThe post Which ASX 200 stock offers 'material upside' amid continuing uncertainty over US tariffs? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/07/24/which-asx-200-stock-offers-material-upside-amid-continuing-uncertainty-over-us-tariffs/",
    "timestamp": "2025-07-24T04:30:00Z"
  },
  {
    "title": "Days of US tech companies building factories in China, hiring workers in India 'over': Trump",
    "description": "President Trump has criticised American tech companies for their global manufacturing and hiring practices, particularly in China and India. He asserted that these companies have benefited from American freedoms while prioritizing overseas operations, leading…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/days-of-us-tech-companies-building-factories-in-china-hiring-workers-in-india-over-trump/articleshow/122871960.cms",
    "timestamp": "2025-07-24T04:23:03Z"
  },
  {
    "title": "Why are data nerds racing to save US government statistics?",
    "description": "The data nerds are fighting back",
    "link": "https://abcnews.go.com/Politics/wireStory/data-nerds-racing-save-us-government-statistics-124023165",
    "timestamp": "2025-07-24T04:22:36Z"
  },
  {
    "title": "Tulsi Gabbard's claims of an anti-Trump conspiracy are not supported by declassified documents",
    "description": "Tulsi Gabbard, Director of National Intelligence, declassified documents alleging an Obama administration conspiracy to delegitimize Donald Trump's 2016 victory. Gabbard claims the intelligence community falsely asserted Russian interference favored Trump. Ho…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tulsi-gabbards-claims-of-an-anti-trump-conspiracy-are-not-supported-by-declassified-documents/articleshow/122871928.cms",
    "timestamp": "2025-07-24T04:21:34Z"
  },
  {
    "title": "Gregg Jarrett Explains Why Obama Should Be ‘Thanking’ Trump",
    "description": "Jarrett said Obama should be \"thanking\" President Donald Trump for bringing presidential immunity to the Supreme Court.",
    "link": "https://dailycaller.com/2025/07/24/gregg-jarrett-barack-obama-thanking-donald-trump-criminal-referral-presidential-immunity/",
    "timestamp": "2025-07-24T04:16:23Z"
  },
  {
    "title": "How a Chinese border town keeps Russia's economy afloat",
    "description": "Manzhouli, the main border crossing between China and Russia, shows growing economic ties. China is Russia's biggest buyer of oil, timber, and coal. Trade has increased significantly since the Ukraine invasion. China provides drones and components to Russia. …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/how-a-chinese-border-town-keeps-russias-economy-afloat/articleshow/122871836.cms",
    "timestamp": "2025-07-24T04:15:13Z"
  },
  {
    "title": "Data experts race to preserve US government statistics amid quiet purges",
    "description": "Following unprecedented data alterations and disappearances from U.S. government websites, a coalition of statisticians and computer scientists are working to preserve and share crucial data sets. These experts aim to ensure data availability for future polic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/data-experts-race-to-preserve-us-government-statistics-amid-quiet-purges/articleshow/122871826.cms",
    "timestamp": "2025-07-24T04:14:27Z"
  },
  {
    "title": "South Park moves to Paramount+ after bidding war",
    "description": "In recent days, Paramount and its CBS network have faced criticism over the cancellation of The Late Show.",
    "link": "https://www.bbc.com/news/articles/cr4wgywwg0qo",
    "timestamp": "2025-07-24T04:14:14Z"
  },
  {
    "title": "Who really is Candace Owens? shocking lawsuit by French President Macron reveals secrets about her net worth, career, and personal life!",
    "description": "In a surprising twist, American commentator Candace Owens has found herself at the center of a legal storm. French President Emmanuel Macron and his wife, Brigitte Macron, have taken her to court for defamation. The couple alleges that Owens made unfounded cl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-really-is-candace-owens-shocking-lawsuit-by-french-president-macron-reveals-secrets-about-her-net-worth-career-and-personal-life/articleshow/122871725.cms",
    "timestamp": "2025-07-24T04:10:21Z"
  },
  {
    "title": "What’s Behind Donald Trump’s Latest Health Diagnosis—And Is the White House Downplaying It?",
    "description": "Donald Trump has been diagnosed with chronic venous insufficiency after public concerns over leg swelling. The condition is treatable, but scrutiny over the former president’s health continues to grow.",
    "link": "https://www.inquisitr.com/whats-behind-donald-trumps-latest-health-diagnosis-and-is-the-white-house-downplaying-it",
    "timestamp": "2025-07-24T04:05:23Z"
  },
  {
    "title": "Trump Bans ‘Woke AI’ From Federal Contracts in New Executive Order",
    "description": "The order requires \"ideological neutrality\" and bans DEI-aligned large language models from government contracts.",
    "link": "https://decrypt.co/331524/trump-bans-woke-ai-federal-contracts-executive-order",
    "timestamp": "2025-07-24T04:02:54Z"
  },
  {
    "title": "Columbia University to pay $200m to settle anti-Semitism claims",
    "description": "Settlement marks victory in US President Donald Trump's efforts to exert greater control over third-level education.",
    "link": "https://www.aljazeera.com/news/2025/7/24/columbia-university-to-pay-200m-to-settle-anti-semitism-claims",
    "timestamp": "2025-07-24T04:01:55Z"
  },
  {
    "title": "Texas AG claimed three homes as primary residence. Democrats are being probed for similar issue",
    "description": "Texas Attorney General Ken Paxton and his wife, Angela, are longtime owners of a $1.5 million house in a gated community outside Dallas.  The problem...",
    "link": "https://www.yahoo.com/news/articles/texas-ag-claimed-three-homes-040150518.html",
    "timestamp": "2025-07-24T04:01:50Z"
  },
  {
    "title": "Media Briefing: New AI-focused roles signal an evolution of AI strategy at news publishers",
    "description": "New promotions to AI-focused roles at The Washington Post and Forbes signal a turning point in how publishers view and operationalize AI.",
    "link": "http://digiday.com/media/media-briefing-new-ai-focused-roles-signal-an-evolution-of-ai-strategy-at-news-publishers/",
    "timestamp": "2025-07-24T04:01:00Z"
  },
  {
    "title": "Batman vs The Joker: Democrats Will Double Down On Chaos To Save Their Party",
    "description": "Whenever I think of the behavior of the Democratic Party and the political left in general I can’t help but think of the philosophy of Batman’s nefarious arch-nemesis, The Joker. And yes, I’m saying that to understand leftists all you really need to do is rea…",
    "link": "https://www.lewrockwell.com/2025/07/brandon-smith/batman-vs-the-joker-democrats-will-double-down-on-chaos-to-save-their-party/",
    "timestamp": "2025-07-24T04:01:00Z"
  },
  {
    "title": "The Untouchables: The Sexual Predators Within America’s Power Elite",
    "description": "“Now by coming in and being part of the cover-up, the Trump administration has become part of it. I mean, it’s just you cannot see it any other way.”—Alex Jones, InfoWars Once again, the American police state is choosing to protect predators, not victims. Jef…",
    "link": "https://www.lewrockwell.com/2025/07/no_author/the-untouchables-the-sexual-predators-within-americas-power-elite/",
    "timestamp": "2025-07-24T04:01:00Z"
  },
  {
    "title": "‘South Park’ Drops Its First Deep-Fake PSA About How Small Trump’s Dick Is",
    "description": "‘South Park’ opens Season 27 with copious jokes about Trump’s commander-in-briefs",
    "link": "https://www.cracked.com/article_47537_south-park-drops-its-first-deep-fake-psa-about-how-small-trumps-dick-is.html",
    "timestamp": "2025-07-24T04:01:00Z"
  },
  {
    "title": "Trump’s Epstein nightmare worsens amid new revelations and a GOP revolt",
    "description": "The Jeffrey Epstein morass surrounding President Donald Trump is deepening amid growing defiance by some Republicans and despite the administration’s most inflammatory attempt yet at distraction.",
    "link": "https://www.cnn.com/2025/07/24/politics/trumps-epstein-nightmare-worsens-amid-new-revelations-and-a-gop-revolt",
    "timestamp": "2025-07-24T04:00:42Z"
  },
  {
    "title": "Jeffrey Epstein Asked About Himself, Trump And Underage Girls In Resurfaced Video",
    "description": "The convicted sex offender was asked about his \"personal relationship\" with the future president in this 2010 deposition video.",
    "link": "https://www.huffpost.com/entry/epstein-trump-2010-video_n_6881a223e4b0da6f149597f8",
    "timestamp": "2025-07-24T04:00:12Z"
  },
  {
    "title": "Emer McLysaght: Rosie O’Donnell for president, or at least let’s give her the freedom of Doonbeg",
    "description": "Donald Trump’s hatred for O’Donnell is one of the few things he remains constant on. Imagine her sailing into the Oval Office on St Patrick’s Day",
    "link": "https://www.irishtimes.com/life-style/people/2025/07/24/emer-mclysaght-rosie-odonnell-for-president-or-at-least-the-freedom-of-doonbeg/",
    "timestamp": "2025-07-24T04:00:00Z"
  },
  {
    "title": "Obama’s Self-Incriminating Defense",
    "description": "For two decades, Barack Obama has demonstrated, through words and deeds, that his deference is toward no one other than himself.  This is a man who behaves as if he were ordained to deliver America from the faults of the forty-two presidents tha...",
    "link": "https://www.americanthinker.com/articles/2025/07/obama_s_self_incriminating_defense.html",
    "timestamp": "2025-07-24T04:00:00Z"
  },
  {
    "title": "Russia-gate in the real world",
    "description": "DNI Tulsi Gabbard recently released an “explosive” top-secret document on the Russia-gate scandal that appears to show that Russia never really had much of any dirt on Donald Trump, but instead the Russians had it on Hillary Clinton &mdas...",
    "link": "https://www.americanthinker.com/blog/2025/07/russia_gate_in_the_real_world.html",
    "timestamp": "2025-07-24T04:00:00Z"
  },
  {
    "title": "Firms expect impact from sweeping US regulatory changes",
    "description": "An overwhelming majority of Irish financial services organisations expect the sweeping regulatory changes emanating from the US to have an impact on Irish firms.",
    "link": "https://www.rte.ie/news/business/2025/0724/1525017-firms-expect-impact-from-sweeping-us-regulatory-changes/",
    "timestamp": "2025-07-24T04:00:00Z"
  },
  {
    "title": "The Enemy Within: The Billion Dollar Chinese Grow House Industry",
    "description": "It’s a billion-dollar industry, illegal and controlled by Chinese mafia networks in quiet rural and suburban neighborhoods across America. If that weren’t concerning enough, it also involves drugs, money laundering, illegal immigration, s...",
    "link": "https://www.americanthinker.com/articles/2025/07/the_enemy_within_the_billion_dollar_chinese_grow_house_industry.html",
    "timestamp": "2025-07-24T04:00:00Z"
  },
  {
    "title": "The Russia Hoax if honest media figures had asked the right question",
    "description": "We all know that after Trump defeated Hillary for the Presidency in 2016, our Justice Department alleged that Trump colluded with Vladimir Putin and Russia to rig, if not outright steal, the 2016 election.\r\n\r\nWe all asked a key question at that time:...",
    "link": "https://www.americanthinker.com/blog/2025/07/the_russia_hoax_if_honest_media_figures_had_asked_the_right_question.html",
    "timestamp": "2025-07-24T04:00:00Z"
  },
  {
    "title": "Dealing with China",
    "description": "Throughout the Cold War until the present, China has been an economic and military threat to free people everywhere. Its Communist government has sentenced its people to death, starvation, and indeterminate captivity. China has never been trustw...",
    "link": "https://www.americanthinker.com/blog/2025/07/dealing_with_china.html",
    "timestamp": "2025-07-24T04:00:00Z"
  },
  {
    "title": "‘They all must be held accountable’",
    "description": "Tulsi Gabbard, Director of National Security, was recently interviewed by Maria Bartiromo on Fox News. The conversation concerned the conspiracy surrounding the Russian collusion hoax, alleged to have been perpetrated by the Obama administration and ...",
    "link": "https://www.americanthinker.com/articles/2025/07/they_all_must_be_held_accountable.html",
    "timestamp": "2025-07-24T04:00:00Z"
  },
  {
    "title": "Germany’s police commissioner attempts to purge conservatives from the force",
    "description": "Germany’s Bundestag police commissioner, Uli Grötsch, is trying his best to rid his police force of members of the conservative Alternative for Germany (AfD) party. Grötsch, himself a member of the left-leaning Social Democratic Party...",
    "link": "https://www.americanthinker.com/blog/2025/07/germany_s_police_commissioner_attempts_to_purge_conservatives_from_the_force.html",
    "timestamp": "2025-07-24T04:00:00Z"
  }
]