[
  {
    "title": "Watchdog Files Bar Complaint Against New York AG James",
    "description": "New York Attorney General Letitia James—already facing a federal criminal referral—now faces a potential state probe regarding her reporting of properties she owns in Virginia.... Read More\nThe post Watchdog Files Bar Complaint Against New York AG James appea…",
    "link": "https://www.dailysignal.com/2025/04/30/watchdog-files-bar-complaint-against-new-york-james/",
    "timestamp": "2025-04-30T21:38:55Z"
  },
  {
    "title": "Ahead of International Workers Day, USDA Touts Anti-Immigration Efforts on Farms",
    "description": "April 30, 2025 – As May Day approaches, and with the Trump administration reaching its 100-day mark, Agriculture Secretary Brooke Rollins issued two statements in the past week touting the USDA’s efforts to curb undocumented immigration—moves that have had a …",
    "link": "https://civileats.com/2025/04/30/ahead-of-international-workers-day-usda-touts-anti-immigration-efforts-on-farms/",
    "timestamp": "2025-04-30T21:38:43Z"
  },
  {
    "title": "David Hogg faces challenge to DNC role as party tensions escalate",
    "description": "A Native American attorney is challenging David Hogg's vice chair position at the Democratic National Committee (DNC) amid intra-party tensions ignited by the 25-year-old activist.",
    "link": "https://www.foxnews.com/politics/david-hogg-faces-challenge-dnc-role-party-tensions-escalate",
    "timestamp": "2025-04-30T21:38:35Z"
  },
  {
    "title": "Texas Agriculture Commissioner Sid Miller thanks Donald Trump for dismissing criminal charges. And the millions of dollars he gave the Trump campaign didn't hurt either [Dumbass]",
    "description": "Texas Agriculture Commissioner Sid Miller thanks Donald Trump for dismissing criminal charges. And the millions of dollars he gave the Trump campaign didn't hurt either",
    "link": "https://www.fark.com/comments/13653454/Texas-Agriculture-Commissioner-Sid-Miller-thanks-Donald-Trump-for-dismissing-criminal-charges-And-millions-of-dollars-he-gave-Trump-campaign-didnt-hurt-either",
    "timestamp": "2025-04-30T21:38:31Z"
  },
  {
    "title": "Nvidia CEO praises Trump's policies",
    "description": "Nvidia Chief Executive Officer Jensen Huang thanked United States President Donald Trump for his \"progressive, growth and industry-oriented policy.\"\nMore to come......",
    "link": "https://biztoc.com/x/3648b66458e5cb6c",
    "timestamp": "2025-04-30T21:37:35Z"
  },
  {
    "title": "U.S. economy shrinks 0.3% in first quarter as Trump trade wars disrupt businesses",
    "description": "U.S. economy shrinks 0.3% in first quarter as Trump trade wars disrupt businesseslocal10.com",
    "link": "https://www.local10.com/business/2025/04/30/us-economy-shrinks-03-in-first-quarter-as-trump-trade-wars-disrupt-business/",
    "timestamp": "2025-04-30T21:35:37Z"
  },
  {
    "title": "The Senate is voting on whether to block Trump’s global tariffs amid economic turmoil",
    "description": "It's a potentially tough vote for some Republicans who have expressed concerns but are wary of crossing the president.",
    "link": "https://www.bostonherald.com/2025/04/30/senate-tariffs/",
    "timestamp": "2025-04-30T21:34:14Z"
  },
  {
    "title": "Trump At Rally With Empty Seats: AOC And Bernie's Crowds Are Smaller Than Mine",
    "description": "Donald celebrated his disastrous and chaotic 100th day in office by holding a rally in Michigan, where he aired his grievances about Democrats and \"communist judges.\" And, of course, he repeated his 2020 election lie. Donald said, \"Nothing will stop me.\"\nThe …",
    "link": "https://crooksandliars.com/2025/04/trump-rally-empty-seats-our-crowds-are",
    "timestamp": "2025-04-30T21:33:51Z"
  },
  {
    "title": "Lying Trump Confronted Over Holding Up Photoshopped Image Of Deported Man's Tattoos",
    "description": "Trump was none too happy with ABC's Terry Moran for daring to point out that he held up a photoshopped image of the supposed MS-13 tattoos on Kilmar Abrego Garcia's knuckles.\nTrump Argues With ABC’s Terry Moran About Photoshopped Image: ‘He Had MS-13 On His K…",
    "link": "https://crooksandliars.com/2025/04/lying-trump-confronted-over-holding",
    "timestamp": "2025-04-30T21:33:44Z"
  },
  {
    "title": "Trump administration cuts $1 billion in school mental health grants, citing conflict of priorities",
    "description": "The Trump administration is moving to cancel $1 billion in school mental health grants, saying they reflect the priorities of the previous administration. Grant recipients were notified Tuesday that the funding will not be continued after this year. A gun vio…",
    "link": "https://japantoday.com/category/world/trump-administration-cuts-1-billion-in-school-mental-health-grants-citing-conflict-of-priorities",
    "timestamp": "2025-04-30T21:33:41Z"
  },
  {
    "title": "UK military launches airstrikes with U.S. targeting Yemen's Houthi rebels",
    "description": "The British military launched airstrikes with the United States targeting Yemen's Houthi rebels, officials said early Wednesday, their first attack in Washington's new intense campaign targeting the Iran-backed group. The United Kingdom offered a detailed exp…",
    "link": "https://japantoday.com/category/world/uk-military-launches-airstrikes-with-us-targeting-yemen%27s-houthi-rebels",
    "timestamp": "2025-04-30T21:33:20Z"
  },
  {
    "title": "Local elections this week are key test for Britain's Trump ally Nigel Farage",
    "description": "Tucking into tea and cake in the spring sunshine, Nigel Farage glows with anticipation and big ambitions. The man who helped drag Britain out of the European Union wants to displace the Conservatives as country’s main party on the right, challenge left-of-cen…",
    "link": "https://japantoday.com/category/world/local-elections-this-week-are-a-key-test-for-britain%27s-trump-ally-nigel-farage",
    "timestamp": "2025-04-30T21:33:08Z"
  },
  {
    "title": "Bo Nickal explains viral fight week weigh-in video, ‘biggest cut’ of UFC career",
    "description": "Bo Nickal says he is in the middle of his biggest career weight cut for a fight in his career. The wrestling standout turned MMA prodigy returns to the octagon this Saturday to face former ONE...",
    "link": "https://www.mmafighting.com/2025/4/30/24421204/bo-nickal-explains-viral-fight-week-weigh-in-video-biggest-cut-of-ufc-career",
    "timestamp": "2025-04-30T21:32:40Z"
  },
  {
    "title": "Palestinian student released on bail as he challenges deportation from U.S.",
    "description": "Columbia University student Mohsen Mahdawi was released from U.S. immigration custody on Wednesday, after a judge ruled he should be free on bail to challenge the Trump administration's efforts to deport him over his participation in pro-Palestinian protests.…",
    "link": "https://japantoday.com/category/world/palestinian-student-released-on-bail-as-he-challenges-deportation-from-us7",
    "timestamp": "2025-04-30T21:32:32Z"
  },
  {
    "title": "Meta Exec Apologizes After Conservative Influencer Robby Starbuck Files Multimillion Dollar Defamation Suit",
    "description": "Meta's chief of global affairs, Joel Kaplan, issued an apology to conservative activist Robby Starbuck after he announced a multimillion dollar lawsuit.",
    "link": "https://dailycaller.com/2025/04/30/meta-exec-apologizes-robby-starbuck-multimillion-dollar-defamation-suit-artificial-intelligence-facebook/",
    "timestamp": "2025-04-30T21:32:23Z"
  },
  {
    "title": "Ukraine says it’s ready to sign rare minerals deal sought by U.S.",
    "description": "Ukraine is ready to sign an agreement that would give the U.S. access to its valuable rare minerals in the hopes of ensuring continued American support for Kyiv in its grinding war with Russia, senior Ukrainian officials said Wednesday. Ukraine's economy mini…",
    "link": "https://japantoday.com/category/world/ukraine-says-it%E2%80%99s-poised-to-sign-a-key-mineral-resources-deal-with-the-us-on-wednesday",
    "timestamp": "2025-04-30T21:32:13Z"
  },
  {
    "title": "Poll: Moderates Shift Towards Trump on Immigration Policy",
    "description": "Swing-voting moderates are rallying to President Donald Trump as Democrats continue their desperate opposition to the enforcement of the nation’s popular immigration laws.“The voters in the middle that we need to win on immigration are being turned off by the…",
    "link": "https://freerepublic.com/focus/f-news/4314273/posts",
    "timestamp": "2025-04-30T21:32:11Z"
  },
  {
    "title": "Trump says U.S. kids may get '2 dolls instead of 30,' but China will suffer more in a trade war",
    "description": "U.S. President Donald Trump on Wednesday acknowledged that his tariffs could result in fewer and costlier products in the United States, saying American kids might &quot;have two dolls instead of 30 dolls,&quot; but he insisted China will suffer more from his…",
    "link": "https://japantoday.com/category/world/weak-gdp-report-tied-to-tariffs-has-trump-trying-to-blame-biden-on-the-state-of-the-economy",
    "timestamp": "2025-04-30T21:32:07Z"
  },
  {
    "title": "Trump Compared To Infamous Xmas Villain After Ominous Prediction",
    "description": "The comparison wasn't meant to be a compliment, by the way.",
    "link": "https://www.huffpost.com/entry/trump-toy-shortage-grinch-comparisons_n_6812760de4b014e5d48bcb2f",
    "timestamp": "2025-04-30T21:31:41Z"
  },
  {
    "title": "Maine teacher makes threats against Trump, members of his administration on social media",
    "description": "The Secret Service confirmed it is aware of the threatening Facebook posts made by a teacher at Waterville Senior High School, one of which states: \"I believe Trump and every sycophant he has surrounded himself with ... needs to die.\"",
    "link": "https://www.wmtw.com/article/waterville-maine-teacher-trump-threats-facebook/64638229",
    "timestamp": "2025-04-30T21:31:27Z"
  },
  {
    "title": "The Senate is voting on whether to block Trump’s global tariffs amid economic turmoil",
    "description": "WASHINGTON (AP) — Senate Democrats are forcing a vote Wednesday evening on whether to block global tariffs announced by Donald Trump earlier this month, a potentially tough vote for some Republicans who have expressed concerns about the policy but are wary of…",
    "link": "https://financialpost.com/pmn/the-senate-is-voting-on-whether-to-block-trumps-global-tariffs-amid-economic-turmoil",
    "timestamp": "2025-04-30T21:30:57Z"
  },
  {
    "title": "Philly Judge Faces Ethics Issue Over Wife's Cheesesteak Shop",
    "description": "Judge Scott DiClaudio accused of using his status as a judge to promote the business.",
    "link": "https://www.huffpost.com/entry/philly-judge-scott-diclaudio-faces-ethics-issue-over-wifes-cheesesteak-shop_n_681294c4e4b04cfa6e2b45ce",
    "timestamp": "2025-04-30T21:29:42Z"
  },
  {
    "title": "What can we learn from the first 100 days of Trump’s second term?",
    "description": "Impact of US president's policies and actions felt globally.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/4/30/what-can-we-learn-from-the-first-100-days-of-trumps-second-term",
    "timestamp": "2025-04-30T21:28:27Z"
  },
  {
    "title": "A look at Trump's first 100 (are we missing a zero?) days in office",
    "description": "United States President \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n marked his first 100 days in office on Tuesday, a symbolic milestone observed in the U.S. to gauge a president’s early headway on fulfilling their campaign promises. Here, the Financial Post looks at…",
    "link": "https://biztoc.com/x/c7840014b336812c",
    "timestamp": "2025-04-30T21:26:42Z"
  },
  {
    "title": "Republican Tears Into Rand Paul Over Breaking With Trump on Tariffs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nRandy Fine, Republican U.S. representative from Florida, ripped into GOP Senator Rand Paul of Kentucky over the senator's efforts to block President Donald Trump from wielding \"emergency\" powers on tariffs.\nNe…",
    "link": "https://biztoc.com/x/15f9a8073e33ba04",
    "timestamp": "2025-04-30T21:26:26Z"
  },
  {
    "title": "Trump's new automotive tariff exemption benefits one company: Tesla",
    "description": "President Donald Trump's tariffs have already had a huge impact on the U.S. economy — so much so that the Trump administration appears to be backing off a bit on some tariffs.\nAs President Trump celebrated the 100th day of his second term, Commerce Secretary …",
    "link": "https://biztoc.com/x/52c904ae742b3876",
    "timestamp": "2025-04-30T21:26:19Z"
  },
  {
    "title": "Trump just put US retailers in an impossible situation",
    "description": "President Donald Trump's sharp criticism of Amazon might hamstring retailers across the US.\nKevin Dietsch/Getty Images\nRetail experts told BI that the White House's sharp rebuke of Amazon could affect retailers nationwide.\nThe response likely halted any plans…",
    "link": "https://biztoc.com/x/067ab3d807d71053",
    "timestamp": "2025-04-30T21:26:12Z"
  },
  {
    "title": "Republican Tears Into Rand Paul Over Breaking With Trump on Tariffs",
    "description": "Paul cosponsored a bill against Trump's tariffs, hoping to block the president from wielding \"emergency\" powers.",
    "link": "https://www.newsweek.com/republican-tears-rand-paul-over-breaking-trump-tariffs-2066440",
    "timestamp": "2025-04-30T21:26:01Z"
  },
  {
    "title": "Meghan McCain Sums Up Lindsey Graham’s Latest Ploy To Suck Up To Trump With 4 Scathing Words",
    "description": "The South Carolina senator was once incredibly close with the McCain family, with the former “The View” co-host previously referring to him as her “uncle.”",
    "link": "https://www.huffpost.com/entry/meghan-mccain-slams-lindsey-graham-pope_n_68123d69e4b0bb54fe2b62d1",
    "timestamp": "2025-04-30T21:25:56Z"
  },
  {
    "title": "Equinor Says it Could Lose Billions on Trump’s Offshore Wind Clampdown",
    "description": "Equinor stands to lose billions of dollars on its massive wind power project offshore the state of New York unless U.S. President Donald Trump's administration reverses a decision to halt the construction, the Norwegian group said on Wednesday.",
    "link": "https://gcaptain.com/equinor-says-it-could-lose-billions-on-trumps-offshore-wind-clampdown/",
    "timestamp": "2025-04-30T21:25:36Z"
  },
  {
    "title": "The 'F-word': Schumer says Trump's first 100 days can be distilled to single utterance",
    "description": "On Day 101 of the Trump administration, U.S. Sen. Charles Schumer of New York and other Democratic senators railed against President Trump.",
    "link": "https://www.foxnews.com/politics/f-word-schumer-says-trumps-100-days-can-distilled-single-utterance",
    "timestamp": "2025-04-30T21:23:22Z"
  },
  {
    "title": "John Bolton on why Trump 2.0 is going nowhere, fast",
    "description": "To kick off his second term, President Donald Trump sought revenge on President Joe Biden, elite law firms, elite universities, and even some of his former staffers — including John Bolton.  Bolton has worked in every Republican presidential administration si…",
    "link": "https://www.vox.com/today-explained-podcast/411225/john-bolton-trump-fascism-government-chaos",
    "timestamp": "2025-04-30T21:23:11Z"
  },
  {
    "title": "A look at Trump's first 100 (are we missing a zero?) days in office",
    "description": "Here's Donald Trump's progress on campaign promises and his effect on key economic issues in his first 100 days in office. Find out more.",
    "link": "https://financialpost.com/news/economy/donald-trump-first-100-days-office",
    "timestamp": "2025-04-30T21:22:43Z"
  },
  {
    "title": "How the Vietnam and Gaza Wars Shattered Young Illusions About US Leaders",
    "description": "Eight years before the U.S.-backed regime in South Vietnam collapsed, I stood with high school friends at Manhattan’s Penn Station on the night of April 15, 1967, waiting for a train back to Washington after attending the era’s largest anti-war protest so far…",
    "link": "https://www.commondreams.org/opinion/vietnam-and-gaza-wars",
    "timestamp": "2025-04-30T21:20:48Z"
  },
  {
    "title": "Following Massive Surge in First Quarter USA Purchases, Chinese Manufacturing Output Now Drops in Second Quarter",
    "description": "This next story is a natural outcome in the flow of goods. Remember, the Bureau of Economic Analysis (BEA) of the first quarter is a hindsight review. Meaning the information released today was based on activity in January, February and March 2025.U.S. compan…",
    "link": "https://freerepublic.com/focus/f-bloggers/4314271/posts",
    "timestamp": "2025-04-30T21:20:25Z"
  },
  {
    "title": "Following Massive Surge in First Quarter USA Purchases, Chinese Manufacturing Output Now Drops in Second Quarter",
    "description": "This next story is a natural outcome in the flow of goods. Remember, the Bureau of Economic Analysis (BEA) of the first quarter is a hindsight review. Meaning the information released today was based on activity in January, February and March 2025.U.S. compan…",
    "link": "https://freerepublic.com/focus/f-news/4314271/posts",
    "timestamp": "2025-04-30T21:20:25Z"
  },
  {
    "title": "Johnson meets with Stefanik after ambassador blowup (Meredith Lee Hill/Politico)",
    "description": "Meredith Lee Hill / Politico:\nJohnson meets with Stefanik after ambassador blowup  —  Rep. Elise Stefanik and Speaker Mike Johnson met Wednesday afternoon after tensions between the two boiled over this week.  The relationship between the two senior Republica…",
    "link": "https://www.memeorandum.com/250430/p127",
    "timestamp": "2025-04-30T21:20:02Z"
  },
  {
    "title": "What Do the Postal Police Do? Latest Agency Drafted Into Mass Deportations",
    "description": "The United States Postal Inspection Service has partnered with the Department of Homeland Security on immigration enforcement.",
    "link": "https://www.newsweek.com/usps-police-immigration-enforcement-deportation-dhs-2066437",
    "timestamp": "2025-04-30T21:18:36Z"
  },
  {
    "title": "North Carolina is pursuing its own restrictions amid Trump's pushback against DEI",
    "description": "The North Carolina House advanced its own restrictions on diversity, equity and inclusion practices for state agencies",
    "link": "https://abcnews.go.com/Politics/wireStory/north-carolina-pursuing-restrictions-amid-trumps-pushback-dei-121335903",
    "timestamp": "2025-04-30T21:18:10Z"
  },
  {
    "title": "Trump Seemingly Confirms Prices Will Rise for Consumers While Suggesting Shoppers Should Buy Less",
    "description": "President Trump acknowledged the price of goods will rise but suggested Americans offset the impact by buying less.",
    "link": "https://www.ibtimes.com/trump-seemingly-confirms-prices-will-rise-consumers-while-suggesting-shoppers-should-buy-less-3772048",
    "timestamp": "2025-04-30T21:18:08Z"
  },
  {
    "title": "'Take them out': Secret Service probes teacher over threats to MAGA fans and Trump cronies",
    "description": "The U.S. Secret Service is investigating a high school English teacher who called on them to \"take out every single person who supports\" President Donald Trump, according to the Bangor Daily News.JoAnna St. Germain, of Waterville, Maine, posted to Facebook th…",
    "link": "https://www.rawstory.com/trump-assassination-2671874004/",
    "timestamp": "2025-04-30T21:16:09Z"
  },
  {
    "title": "RFK Jr. Claims Biden's HHS 'Became a Collaborator in Child Trafficking'",
    "description": "Health and Human Services (HHS) Secretary Robert F. Kennedy Jr. claimed that HHS under former President Joe Biden's administration had been a \"collaborator in child trafficking,\" sex, and slavery.\nThe post RFK Jr. Claims Biden’s HHS ‘Became a Collaborator in …",
    "link": "https://www.breitbart.com/politics/2025/04/30/rfk-jr-claims-bidens-hhs-became-a-collaborator-in-child-trafficking/",
    "timestamp": "2025-04-30T21:15:55Z"
  },
  {
    "title": "Trump says his admin brought investment worth $8 trillion",
    "description": "United States President Donald Trump claimed again that his administration brought in investment worth $8 trillion and took the chance to bash his predecessor's administration during his \"Inv...",
    "link": "https://biztoc.com/x/ab68db0a0a55d038",
    "timestamp": "2025-04-30T21:15:48Z"
  },
  {
    "title": "What Trump Said About Tariffs in First 100 Days",
    "description": "Tariffs, trade wars and 100 dizzying days of Donald Trump. Here's what the US president has said about tariffs during his first 100 days in office. \nRead more: https://www.bloomberg.com/news/features/2025-04-27/trump-s-quick-tempo-in-tariff-trade-war-set-scen…",
    "link": "https://biztoc.com/x/a43be46c75928318",
    "timestamp": "2025-04-30T21:15:31Z"
  },
  {
    "title": "Stablecoins on track for $2T market cap by 2028 — US Treasury",
    "description": "US Dollar-pegged stablecoins are on track to reach an aggregate market capitalization of approximately $2 trillion by 2028, according to the United States Department of the Treasury’s Q1 2025 report. Stablecoins’ cumulative market cap currently stands at roug…",
    "link": "https://cointelegraph.com/news/stablecoins-on-track-for-2-t-market-cap-by-2028-us-treasury",
    "timestamp": "2025-04-30T21:15:00Z"
  },
  {
    "title": "Trump tries to evade blame as he feels economic pressure: From the Politics Desk",
    "description": "Amid a series of negative economic indicators 100 days in, Trump is seeking to reframe some of his campaign pledges and shift the blame to his predecessor.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-tries-evade-blame-feels-economic-pressure-politics-desk-rcna203940",
    "timestamp": "2025-04-30T21:15:00Z"
  },
  {
    "title": "Yes, Lindsey Graham said he supports Trump's bid for the papacy — as a joke",
    "description": "U.S. Sen. Lindsey Graham, a Republican from South Carolina, said on X he was happy President Donald Trump was considering becoming pope.",
    "link": "https://www.snopes.com//fact-check/lindsey-graham-trump-pope/",
    "timestamp": "2025-04-30T21:15:00Z"
  },
  {
    "title": "Van Hollen: El Salvador Vice President Says US Paying to Imprison Abrego Garcia",
    "description": "Trump admitted in an interview on Tuesday that he could get the Maryland father back with a single phone call.",
    "link": "https://truthout.org/articles/van-hollen-el-salvador-vice-president-says-us-paying-to-imprison-abrego-garcia/",
    "timestamp": "2025-04-30T21:14:53Z"
  },
  {
    "title": "‘Unjustified Burdens’: Senate Passes Resolution to Repeal Biden-Era Appliance Rule",
    "description": "DAILY CALLER NEWS FOUNDATION—The Senate passed a joint resolution to repeal a Department of Energy appliance standard on Wednesday by a margin of 52-46, further... Read More\nThe post ‘Unjustified Burdens’: Senate Passes Resolution to Repeal Biden-Era Applianc…",
    "link": "https://www.dailysignal.com/2025/04/30/unjustified-burdens-senate-passes-resolution-to-repeal-biden-era-appliance-rule/",
    "timestamp": "2025-04-30T21:14:43Z"
  },
  {
    "title": "Ex-Fox News Host Eric Bolling Asks If Trump Will Punish Fox Over Its Polling: ‘As Detrimental As What CBS Is Doing’",
    "description": "\"The president's spoken quite strongly about it and I know he's made some phone calls to express his displeasure with it as well,” Leavitt concluded.\nThe post Ex-Fox News Host Eric Bolling Asks If Trump Will Punish Fox Over Its Polling: ‘As Detrimental As Wha…",
    "link": "https://www.mediaite.com/politics/ex-fox-news-host-eric-bolling-asks-if-trump-will-punish-fox-over-its-polling-as-detrimental-as-what-cbs-is-doing/",
    "timestamp": "2025-04-30T21:13:31Z"
  },
  {
    "title": "Trump just put US retailers in an impossible situation",
    "description": "Trump's sharp rebuke of Amazon could have broader implications for US retailers, complicating how they handle tariff-related price increases.",
    "link": "https://www.businessinsider.com/trump-retailers-amazon-bezos-price-rise-2025-4",
    "timestamp": "2025-04-30T21:13:12Z"
  },
  {
    "title": "Education Department opens investigation into Chicago Public Schools",
    "description": "The U.S. Education Department is investigating Chicago Public Schools to determine if a program aimed at boosting Black student achievement violates federal law.",
    "link": "https://www.nbcnews.com/news/us-news/education-department-opens-investigation-chicago-public-schools-rcna203761",
    "timestamp": "2025-04-30T21:12:00Z"
  },
  {
    "title": "Neil Young targets Tesla and Musk in fiery new anthem",
    "description": "Neil Young's new song calls on legacy U.S. automakers to step up and challenge Tesla’s dominance in the electric vehicle space.",
    "link": "https://www.washingtonexaminer.com/news/entertainment/3396920/neil-young-song-elon-musk-tesla-electric-vehicles-politics/",
    "timestamp": "2025-04-30T21:11:45Z"
  },
  {
    "title": "US-Ukraine minerals deal: what is known so far",
    "description": "Washington and Kiev are on the verge of signing a major mineral resources deal, with its details still not officially published Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616580-us-ukraine-minerals-deal-know/",
    "timestamp": "2025-04-30T21:11:32Z"
  },
  {
    "title": "Trump Admits Tariffs Could Create Shortages, Hike Prices",
    "description": "\"Maybe the children will have two dolls instead of 30 dolls,\" Trump said Wednesday. \"And maybe the two dolls will cost a couple bucks more than they would normally.”",
    "link": "https://reason.com/2025/04/30/trump-admits-tariffs-could-create-shortages-hike-prices/",
    "timestamp": "2025-04-30T21:10:55Z"
  },
  {
    "title": "US and Ukraine inch towards critical minerals deal",
    "description": "Ukraine's deputy leader is heading to Washington to sign an agreement the White House has been pushing for.",
    "link": "https://www.bbc.com/news/articles/c5ypw7pn9q3o",
    "timestamp": "2025-04-30T21:10:24Z"
  },
  {
    "title": "Sam’s Club: Inside Altman’s AI World, Featuring Elon Musk, Donald Trump, and Peter Thiel",
    "description": "Wall Street Journal reporter Keach Hagey joins the editors in unpacking the billionaire tech mogul’s political views and ambitions, his brief ouster from OpenAI, and whether he’ll manage to come out on top of the AI arms race.",
    "link": "https://www.vanityfair.com/news/story/inside-altmans-ai-world-featuring-elon-musk-donald-trump-and-peter-thiel",
    "timestamp": "2025-04-30T21:09:59Z"
  },
  {
    "title": "‘Bumbling f***ing idiot’: Experts concerned Witkoff not capable of handling Hamas, Iran - report",
    "description": "Some fear that handling both Hamas and Iran will be too much for Steve Witkoff.",
    "link": "https://www.jpost.com/middle-east/article-852204",
    "timestamp": "2025-04-30T21:07:24Z"
  },
  {
    "title": "GOP In ‘Strong Position’ To Keep The House, NRCC Poll Maintains",
    "description": "The NRCC's new poll maintains the Republicans are in a \"strong position to defend and grow the House majority\" in the 2026 midterms.",
    "link": "https://dailycaller.com/2025/04/30/nrcc-poll-shows-gop-house-momentum-midterms/",
    "timestamp": "2025-04-30T21:07:17Z"
  },
  {
    "title": "With 600 million users, X’s Linda Yaccarino doubles down on dismissing journalism",
    "description": "Linda Yaccarino continues to cast X as the anti-media media company — a disruptive alternative to what she and Elon Musk believe is the dusty, broke fourth estate.\nIt’s a contentious claim, especially in an era when President Donald Trump is once again at war…",
    "link": "https://biztoc.com/x/562d87d254f7f350",
    "timestamp": "2025-04-30T21:04:46Z"
  },
  {
    "title": "Johnson meets with Stefanik after ambassador blowup",
    "description": "Rep. Elise Stefanik and Speaker Mike Johnson met Wednesday afternoon after tensions between the two boiled over this week. \nThe relationship between the two senior Republicans has deteriorated after President Donald Trump pulled Stefanik’s nomination to be am…",
    "link": "https://biztoc.com/x/6c246d651cd163f5",
    "timestamp": "2025-04-30T21:04:44Z"
  },
  {
    "title": "Donald Trump Ally Plans to Put New Sanctions on Russia",
    "description": "Graham said the list of backers is evenly split between Republicans and Democrats and includes Senate Majority Leader John Thune.",
    "link": "https://biztoc.com/x/21232d7d10c3c03b",
    "timestamp": "2025-04-30T21:04:40Z"
  },
  {
    "title": "Starting May 28, United Airlines Flight Attendants Can Only Wear The American Flag on Their Uniforms",
    "description": "Suddenly United Airlines is banning customer-facing employees from wearing any pin other than an American flag pin. They are currently allowed a choice of 18 approved pins on their uniform.\nContinue reading Starting May 28, United Airlines Flight Attendants C…",
    "link": "https://viewfromthewing.com/starting-may-28-united-airlines-flight-attendants-can-only-wear-the-american-flag-on-their-uniforms/",
    "timestamp": "2025-04-30T21:04:37Z"
  },
  {
    "title": "Bill Belichick Defends 24-Year-Old Girlfriend After Awkward Interview",
    "description": "The football coach accused CBS of presenting a \"false narrative\" about his girlfriend.",
    "link": "https://www.huffpost.com/entry/bill-belichick-girlfriend-interview_n_68127a2be4b014e5d48bce57",
    "timestamp": "2025-04-30T21:03:55Z"
  },
  {
    "title": "12 Changes Trump Would Make As Pope",
    "description": "Speculation over who will be the next occupant of the Holy See has gone wild, with President Trump the latest to throw his name into the ring. Here are twelve changes Trump is promising to make if he is named the next Pope:",
    "link": "https://babylonbee.com/news/12-changes-trump-would-make-as-pope",
    "timestamp": "2025-04-30T21:03:35Z"
  },
  {
    "title": "'I had a weak moment': Trump nominee grilled over 'classic rape threat' at Senate hearing",
    "description": "Sen. Ron Wyden questioned Rodney Scott, President Donald Trump's nominee for commissioner of Customs and Border Protection, over an alleged \"rape threat\" he made to a government employee.During a Senate Finance Committee hearing on Wednesday, Wyden noted that…",
    "link": "https://www.rawstory.com/rodney-scott/",
    "timestamp": "2025-04-30T21:03:03Z"
  },
  {
    "title": "Meta quarterly profit climbs despite big cloud spending",
    "description": "Tech giant Meta reported quarterly profits well above expectations Wednesday, brushing aside market worries that its heavy investments in cloud computing and artificial intelligence would hamper growth. The company reported a $16.6 billion profit in the first…",
    "link": "https://www.digitaljournal.com/world/meta-quarterly-profit-climbs-despite-big-cloud-spending/article",
    "timestamp": "2025-04-30T21:02:49Z"
  },
  {
    "title": "Meta quarterly profit climbs despite big cloud spending",
    "description": "Tech giant Meta reported quarterly profits well above expectations Wednesday, brushing aside market worries that its heavy investments in cloud computing and artificial intelligence would hamper growth. The company reported a $16.6 billion profit in the first…",
    "link": "https://www.digitaljournal.com/business/meta-quarterly-profit-climbs-despite-big-cloud-spending/article",
    "timestamp": "2025-04-30T21:02:49Z"
  },
  {
    "title": "Trump claims he 'could' have Kilmar Abrego Garcia returned to the U.S. His administration has said otherwise.",
    "description": "President Donald Trump said in an interview with ABC News on Tuesday that he \"could\" have Kilmar Abrego Garcia returned to the U.S. with one phone call, even though the administration has argued in court that the government has no ability to get him back.",
    "link": "https://www.nbcnews.com/politics/justice-department/trump-claims-kilmar-abrego-garcia-returned-us-administration-said-othe-rcna203734",
    "timestamp": "2025-04-30T21:02:48Z"
  },
  {
    "title": "Trump Adviser Says Latest Bad Economic Data Is Actually Good ‘When You Strip Out’ Negative Effects of Tariffs: ‘It’s Working Beautifully’",
    "description": "White House trade adviser Peter Navarro spun some putrid economic data on Wednesday by saying the numbers would actually be better if President Donald Trump's tariffs were discounted.\nThe post Trump Adviser Says Latest Bad Economic Data Is Actually Good ‘When…",
    "link": "https://www.mediaite.com/tv/trump-adviser-says-latest-bad-economic-data-is-actually-good-when-you-strip-out-negative-effects-of-tariffs-its-working-beautifully/",
    "timestamp": "2025-04-30T21:02:48Z"
  },
  {
    "title": "BOJ to keep rates steady, cut growth forecasts",
    "description": "TOKYO :The Bank of Japan is likely to keep interest rates steady and cut its growth forecasts on Thursday, as uncertainty surrounding U.S. tariffs clouds the outlook for the world's fourth-largest economy.But the central bank is likely to project inflation to…",
    "link": "https://www.channelnewsasia.com/business/boj-keep-rates-steady-cut-growth-forecasts-5101131",
    "timestamp": "2025-04-30T21:02:30Z"
  },
  {
    "title": "Federal election outcome could shape the future of manufacturing",
    "description": "With Australia's local supply chains in sharp focus in the lead-up to the federal election, industry figures are calling for more ambitious action to help manufacturing thrive in an uncertain world.",
    "link": "https://www.abc.net.au/news/2025-05-01/can-australian-manufacturing-return-federal-election-outcome/105224434",
    "timestamp": "2025-04-30T21:01:21Z"
  },
  {
    "title": "Democrats Vow to Fight Trump, But Don’t Say How",
    "description": "In remarks about President Donald Trump’s first 100 days in office, Senate Minority Leader Chuck Schumer and his House counterpart, Minority Leader Hakeem Jeffries, predictably... Read More\nThe post Democrats Vow to Fight Trump, But Don’t Say How appeared fir…",
    "link": "https://www.dailysignal.com/2025/04/30/democrats-vow-fight-trump-but-dont-say-how/",
    "timestamp": "2025-04-30T21:01:17Z"
  },
  {
    "title": "With 600 million users, X’s Linda Yaccarino doubles down on dismissing journalism",
    "description": "Yaccarino brought user stats and Gen Z spin to Possible but left advertisers waiting for answers on brand safety and courtroom threats.",
    "link": "http://digiday.com/marketing/with-600-million-users-xs-linda-yaccarino-doubles-down-on-dismissing-journalism/",
    "timestamp": "2025-04-30T21:01:06Z"
  },
  {
    "title": "White House mocks 'fake news' report claiming Trump mixed up Michigan congressmen at rally",
    "description": "The White House disputed a NewsNation report that said President Trump had mistakenly accused a Michigan Republican of launching an impeachment effort against him.",
    "link": "https://www.foxnews.com/media/white-house-mocks-fake-news-report-claiming-trump-mixed-up-michigan-congressmen-rally",
    "timestamp": "2025-04-30T21:00:33Z"
  },
  {
    "title": "Meta Quarterly Profit Climbs Despite Big Cloud Spending",
    "description": "Tech giant Meta reported quarterly profits well above expectations Wednesday, brushing aside market worries that its heavy investments in cloud computing and artificial intelligence would hamper growth.",
    "link": "https://www.ibtimes.com/meta-quarterly-profit-climbs-despite-big-cloud-spending-3772045",
    "timestamp": "2025-04-30T21:00:28Z"
  },
  {
    "title": "Brits’ distaste for hormone-fed beef is ‘unscientific,’ says Canadian ambassador",
    "description": "High Commissioner Ralph Goodale also said the 245 percent tariffs U.K. cheesemakers face in Canada is due to a “Brexit screw up.”",
    "link": "https://www.politico.eu/article/brits-canadian-ambassador-north-america-tariffs/",
    "timestamp": "2025-04-30T21:00:00Z"
  },
  {
    "title": "Claim: Trump Tariffs to Blame for the UK Economic Slump (Not Climate Policy)",
    "description": "Nothing to do with Mad Miliband's green energy policies.",
    "link": "https://wattsupwiththat.com/2025/04/30/claim-trump-tariffs-to-blame-for-the-uk-economic-slump-not-climate-policy/",
    "timestamp": "2025-04-30T21:00:00Z"
  },
  {
    "title": "Elise Stefanik Bitterly Blames Speaker Johnson for Her Cabinet Nomination Crumbling: Report",
    "description": "It was widely reported that Rep. Elise Stefanik (R-NY) was enthusiastic about serving as the U.S. Ambassador to the United Nations, so when President Donald Trump pulled her nomination, it makes sense that she would be disappointed. But a new article by Annie…",
    "link": "https://www.mediaite.com/politics/elise-stefanik-bitterly-blames-speaker-johnson-for-her-cabinet-nomination-crumbling-report/",
    "timestamp": "2025-04-30T20:59:39Z"
  },
  {
    "title": "A former Trump official backs World Heritage status for the vast Okefenokee Swamp",
    "description": "Okefenokee National Wildlife Refuge is being touted by Sonny Perdue.",
    "link": "https://www.bostonherald.com/2025/04/30/world-heritage-okefenokee-swamp/",
    "timestamp": "2025-04-30T20:59:34Z"
  },
  {
    "title": "Watch Live: Donald Trump Gives Speech on Investing in America",
    "description": "President Donald Trump delivers a speech on investing in America on Wednesday, April 30.\nThe post Watch Live: Donald Trump Gives Speech on Investing in America appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/04/30/watch-live-donald-trump-gives-speech-on-investing-in-america/",
    "timestamp": "2025-04-30T20:58:34Z"
  },
  {
    "title": "Donald Trump Ally Plans to Put New Sanctions on Russia",
    "description": "Graham said the list of backers is evenly split between Republicans and Democrats and includes Senate Majority Leader John Thune.",
    "link": "https://www.newsweek.com/donald-trump-ally-plans-put-new-sanctions-russia-2066448",
    "timestamp": "2025-04-30T20:58:34Z"
  },
  {
    "title": "15 Unbelievable Things That Happened Since Trump Became President",
    "description": "Photo: Kevin Dietsch (Getty Images)\r\nIt seems like ever since President Donald Trump got back into office, the whole world’s been turned upside down. From legislation getting rid of the Department of Education to deporting U.S. born citizens without due proce…",
    "link": "https://www.theroot.com/15-unbelievable-things-that-happened-since-trump-became-1851778531",
    "timestamp": "2025-04-30T20:56:00Z"
  },
  {
    "title": "U.S. Economy Contracts, Fueling Recession Fears",
    "description": "The world’s biggest economy has shrunk for the first time in three years, according to official figures.",
    "link": "http://foreignpolicy.com/2025/04/30/us-economy-gdp-trump-tariffs-recession-trade-war/",
    "timestamp": "2025-04-30T20:55:20Z"
  },
  {
    "title": "Gun Owners Group Calls for Inquiry Into Firearms Industry’s Secret Sharing of Customer Data",
    "description": "Gun Owners for Safety called the secret program that spanned nearly two decades “underhanded.”",
    "link": "https://gizmodo.com/gun-owners-group-calls-for-inquiry-into-firearms-industrys-secret-sharing-of-customer-data-2000596678",
    "timestamp": "2025-04-30T20:55:19Z"
  },
  {
    "title": "The rising tension between India and Pakistan, briefly explained",
    "description": "India and Pakistan seem headed for a military conflict in the wake of India’s worst terrorist attack in years. The question is what form that clash will take and just how far the confrontation between the two nuclear-armed neighbors could escalate.  The lates…",
    "link": "https://www.vox.com/world-politics/411219/india-pakistan-kashmir-terrorist-attack-war",
    "timestamp": "2025-04-30T20:55:16Z"
  },
  {
    "title": "America gave Trump another chance. He's blowing it. (Philip Bump/Washington Post)",
    "description": "Philip Bump / Washington Post:\nAmerica gave Trump another chance.  He's blowing it.  —  For a brief moment after the election, Trump's favorability numbers went up.  So much for that.  —  There are few moments when President Donald Trump's disregard for reali…",
    "link": "https://www.memeorandum.com/250430/p122",
    "timestamp": "2025-04-30T20:55:00Z"
  },
  {
    "title": "Trump Admits Tariffs Could Create Shortages, Hike Prices",
    "description": "When President Donald Trump ordered the implementation of his so-called \"Liberation Day\" tariffs on April 2, he proclaimed that it was \"now our turn to prosper.\" \nExactly four weeks later, Trump delivered a very different message to the American people: You'l…",
    "link": "https://biztoc.com/x/f814486ced41aba1",
    "timestamp": "2025-04-30T20:53:51Z"
  },
  {
    "title": "Trump praises Musk as chief disruptor eyes exit",
    "description": "WASHINGTON: US President Donald Trump on Wednesday (Apr 30) said Tesla boss Elon Musk could stay working for the White House as long as he wanted, but understood the tycoon wanted to get back to his businesses. Musk last month said he would step back from his…",
    "link": "https://www.channelnewsasia.com/world/trump-praises-musk-chief-disruptor-eyes-exit-5101101",
    "timestamp": "2025-04-30T20:53:26Z"
  },
  {
    "title": "Family ‘Traumatized’ After ICE’s Mistaken Early Morning Raid Of Oklahoma Home",
    "description": "“We’re citizens,\" the woman said she repeatedly told the armed men after they broke into her family's home last week.",
    "link": "https://www.huffpost.com/entry/oklahoma-home-mistakenly-searched-ice-raid_n_68125e25e4b0232e1516f895",
    "timestamp": "2025-04-30T20:52:28Z"
  },
  {
    "title": "2 Ukrainian Nationals Hit With Federal Charges After Illegally Voting In 2024 Presidential Election",
    "description": "Two Ukrainian women in South Florida on temporary visas were hit with federal charges after being accused of illegally voting in the last 2024 U.S. presidential election, according to the Department of Justice (DOJ). Svitlana Demydenko, 53, and her daughter, …",
    "link": "https://freerepublic.com/focus/f-news/4314259/posts",
    "timestamp": "2025-04-30T20:52:13Z"
  },
  {
    "title": "Live: ASX set to slip after volatile day on Wall Street as US economy shrinks",
    "description": "The local share market is set to drop on Thursday after a volatile day on Wall Street, as the US economy contracts as Trump's tariffs bite. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2025-05-01/asx-markets-business-live-news-1-may/105236948",
    "timestamp": "2025-04-30T20:50:03Z"
  },
  {
    "title": "EXCLUSIVE: Mom's fight with school over teen daughter's gender transition gets boost from parents group",
    "description": "Parental rights group American Parents Coalition is filing a brief in support of a lawsuit against a Florida middle school that secretly socially transitioned a 13-year-old girl.",
    "link": "https://www.foxnews.com/politics/exclusive-moms-fight-school-over-teen-daughters-gender-transition-gets-boost-from-parents-group",
    "timestamp": "2025-04-30T20:49:49Z"
  },
  {
    "title": "Kamala Harris steps back into limelight as Trump celebrates his first 100 days",
    "description": "Former Vice President Kamala Harris, who has stayed largely out of the political limelight since leaving office, is set to deliver remarks on Wednesday in San Francisco.",
    "link": "https://abcnews.go.com/Politics/kamala-harris-steps-back-limelight-trump-celebrates-100/story?id=121323724",
    "timestamp": "2025-04-30T20:48:06Z"
  },
  {
    "title": "Italy Shows How Amazon Can Be Forced to Bargain: Shutting Down Its Distribution",
    "description": "Amazon is huge and powerful, but Italian workers have shown it can be forced to negotiate. Could US workers do the same?",
    "link": "https://truthout.org/articles/italy-shows-how-amazon-can-be-forced-to-bargain-shutting-down-its-distribution/",
    "timestamp": "2025-04-30T20:47:22Z"
  }
]