[
  {
    "title": "Markets open lower as Trump’s tariff threats trigger global uncertainty",
    "description": "Markets cautious as Sensex and Nifty fall on renewed U.S.-China trade tensions, with sectoral movers and technical indicators analyzed.",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/markets-open-lower-as-trumps-tariff-threats-trigger-global-uncertainty/article70157303.ece",
    "timestamp": "2025-10-13T04:38:53Z"
  },
  {
    "title": "Asian shares skid after Wall Street tumbles to its worst day since April as China trade woes worsen",
    "description": "Asian shares tumbled on Monday as escalating trade tensions with China shattered a monthslong calm on Wall Street.  U.S. stocks skidded on Friday after...",
    "link": "https://finance.yahoo.com/news/asian-shares-skid-wall-street-043707654.html",
    "timestamp": "2025-10-13T04:37:07Z"
  },
  {
    "title": "Trump says may warn Putin Ukraine could get Tomahawks",
    "description": "Washington (AFP) Oct 12, 2025\n\n US President Donald Trump said Sunday he may warn Russian counterpart Vladimir Putin that Ukraine could get Tomahawk cruise missiles if Moscow does not end its invasion. \n\nTrump has been mulling potential supplies of the long-r…",
    "link": "https://www.spacewar.com/reports/Trump_says_may_warn_Putin_Ukraine_could_get_Tomahawks_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Putin says Trump 'doing a lot' to resolve crises",
    "description": "Moscow (AFP) Oct 10, 2025\n\n\n Russian President Vladimir Putin said on Friday that his US counterpart was \"doing a lot\" to resolve world \"crises\" but that it was not for him to decide whether Donald Trump should receive the Nobel prize. \n\nSince returning to th…",
    "link": "https://www.spacewar.com/reports/Putin_says_Trump_doing_a_lot_to_resolve_crises_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "North Korea shows off 'most powerful' missile at military parade",
    "description": "Seoul (AFP) Oct 11, 2025\n\n\n North Korea showed off its \"most powerful\" intercontinental ballistic missile at a military parade attended by top officials from Russia and China, Pyongyang's state media reported Saturday. \n\nThe event to mark 80 years under the r…",
    "link": "https://www.spacewar.com/reports/North_Korea_shows_off_most_powerful_missile_at_military_parade_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Trump issues order to pay military as US shutdown drags on",
    "description": "Washington (AFP) Oct 11, 2025\n\n\n President Donald Trump said Saturday he had issued an order for the military to be paid next week despite the ongoing government shutdown during which many civil servants are working without salaries. \n\nTrump said he had order…",
    "link": "https://www.spacewar.com/reports/Trump_issues_order_to_pay_military_as_US_shutdown_drags_on_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Trump says US 'wants to help China, not hurt it'",
    "description": "Washington (AFP) Oct 12, 2025\n\n President Donald Trump said Sunday the United States wants to help China, not hurt it, striking a conciliatory tone days after threatening an additional 100 percent tariff on the world's second-largest economy. \n\nTrump's statem…",
    "link": "https://www.spacewar.com/reports/Trump_says_US_wants_to_help_China_not_hurt_it_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "US announces deal for Qatar air force facility in Idaho",
    "description": "Washington (AFP) Oct 11, 2025\n\n\n US Defense Secretary Pete Hegseth announced Friday that Qatar will be allowed to build an air force facility at Mountain Home Air Base in Idaho that will house F-15 fighter jets and pilots. \n\nThe announcement comes soon after …",
    "link": "https://www.spacedaily.com/reports/US_announces_deal_for_Qatar_air_force_facility_in_Idaho_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Nobel Peace Prize winner Machado dedicates award to Trump",
    "description": "Caracas (AFP) Oct 10, 2025\n\n Venezuelan opposition leader Maria Corina Machado dedicated her Nobel Peace Prize on Friday to the people of Venezuela - and US President Donald Trump, for his \"decisive support\" for her country's pro-democracy movement. \n\n\"I dedi…",
    "link": "https://www.spacewar.com/reports/Nobel_Peace_Prize_winner_Machado_dedicates_award_to_Trump_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "North Korea reports holding 'grand' military parade",
    "description": "Seoul (AFP) Oct 10, 2025\n\n\n North Korea held a \"grand military parade\" to mark 80 years under the ruling Workers' Party, showing off some of its most advanced weapons to a bevy of high-level foreign guests, state media reported Saturday. \n\nThe event came as l…",
    "link": "https://www.spacewar.com/reports/North_Korea_reports_holding_grand_military_parade_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "UK, France, Germany aim to restart Iran nuclear talks",
    "description": "London (AFP) Oct 10, 2025\n\n\n Britain, France and Germany will seek to restart stalled nuclear talks with Iran and the United States, the three European countries said in a joint statement on Friday. \n\nTheir announcement came nearly two weeks after UN sanction…",
    "link": "https://www.spacewar.com/reports/UK_France_Germany_aim_to_restart_Iran_nuclear_talks_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Spain says 'committed to NATO' after Trump expulsion threat",
    "description": "Madrid (AFP) Oct 10, 2025\n\n\n Spain hit back at Donald Trump on Friday after the US President suggested expelling the country from NATO for failing to meet his ramped-up defence spending target. \n\nIn June, the 32-nation military alliance agreed to massively bo…",
    "link": "https://www.spacewar.com/reports/Spain_says_committed_to_NATO_after_Trump_expulsion_threat_999.html",
    "timestamp": "2025-10-13T04:36:41Z"
  },
  {
    "title": "Middle East: Israel awaits release of hostages held in Gaza",
    "description": "All living hostages held by Hamas are expected to be released in exchange for Palestinian prisoners. Meanwhile, US President Donald Trump is heading to the region to for a peace summit in Egypt. Follow DW.",
    "link": "https://www.dw.com/en/middle-east-israel-awaits-release-of-hostages-held-in-gaza/live-74326286",
    "timestamp": "2025-10-13T04:34:00Z"
  },
  {
    "title": "First group of Israeli hostages released",
    "description": "All living hostages held by Hamas are expected to be released in exchange for Palestinian prisoners. Meanwhile, US President Donald Trump is heading to the region to for a peace summit in Egypt. Follow DW. Israeli media report seven hostages have been handed …",
    "link": "https://www.dw.com/en/first-group-of-israeli-hostages-released/live-74326286",
    "timestamp": "2025-10-13T04:34:00Z"
  },
  {
    "title": "Big questions surround 3rd-quarter earnings",
    "description": "Donald Trump has said he thinks quarterly earnings are a waste of time. There hasn't been a huge groundswell of support to releasing corporate earnings, say, twice a year.\nSo the ritual of companies releasing earnings reports and holding earnings call is stil…",
    "link": "https://biztoc.com/x/079feec9b3d304ed",
    "timestamp": "2025-10-13T04:32:45Z"
  },
  {
    "title": "WRAPUP 2-Trump To Be Lauded In Israel As Long-held Hostages Return Home",
    "description": "Israel and Hamas were locked in tense, albeit indirect, negotiations over the list of Palestinian prisoners to be freed.",
    "link": "https://www.huffpost.com/entry/trump-israel-hostages-return-speech_n_68ec7fa5e4b096c4c84fb04f",
    "timestamp": "2025-10-13T04:31:12Z"
  },
  {
    "title": "India’s beauty maestro Dr. Shagun Gupta takes center stage at Permanent Makeup (PMU) Tokyo Summit 2025",
    "description": "Dr. Shagun Gupta, a leading Indian beauty expert, will co-organize and be the chief guest at the PMU Tokyo Summit 2025. This prestigious event, held from November 1st to 3rd, 2025, will bring together global influencers in permanent beauty and aesthetic techn…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/indias-beauty-maestro-dr-shagun-gupta-takes-center-stage-at-permanent-makeup-pmu-tokyo-summit-2025/articleshow/124517396.cms",
    "timestamp": "2025-10-13T04:30:05Z"
  },
  {
    "title": "Nidal Al-Mughrabi: Why Hamas decided to trust Donald Trump and release the hostages",
    "description": "Hamas has called Donald Trump a racist, a “recipe for chaos” and a man with an absurd vision for Gaza.",
    "link": "https://www.independent.ie/opinion/analysis/nidal-al-mughrabi-why-hamas-decided-to-trust-donald-trump-and-release-the-hostages/a100881421.html",
    "timestamp": "2025-10-13T04:30:00Z"
  },
  {
    "title": "Sikh man with tumour held by US immigration denied medical care - family",
    "description": "Paramjit Singh, an Indian passport holder, has lived in the US on a green card since 1994.",
    "link": "https://www.bbc.com/news/articles/cm2z7gkd87lo",
    "timestamp": "2025-10-13T04:28:37Z"
  },
  {
    "title": "China Trade Beats Forecasts In September As Tariff Fears Rise",
    "description": "China's trade grew faster than expected last month, official data showed Monday, though fresh fears are rising of a major escalation in the tariff war between Beijing and Washington.",
    "link": "https://www.ibtimes.com/china-trade-beats-forecasts-september-tariff-fears-rise-3786671",
    "timestamp": "2025-10-13T04:27:09Z"
  },
  {
    "title": "China's rare earth exports fall sharply in September",
    "description": "China, the world's largest exporter of rare earths, sold 4,000.3 tonnes of rare earths in September, down 30.9% from August",
    "link": "https://www.thehindubusinessline.com/news/world/chinas-rare-earth-exports-fall-sharply-in-september/article70157296.ece",
    "timestamp": "2025-10-13T04:25:54Z"
  },
  {
    "title": "Philippines says China rammed their ship in South China Sea",
    "description": "The Philippines accused a Chinese ship of deliberately colliding with a Philippine vessel near Thitu Island in the disputed South China Sea, also using water cannons. China, however, blamed the Philippines, stating its vessels illegally entered the waters and…",
    "link": "https://timesofindia.indiatimes.com/world/china/philippines-says-china-rammed-their-ship-in-south-china-sea/articleshow/124517057.cms",
    "timestamp": "2025-10-13T04:23:31Z"
  },
  {
    "title": "China trade beats forecasts in September as tariff fears rise",
    "description": "China’s trade grew faster than expected last month, official data showed Monday, though fresh fears are rising of a major escalation in the tariff war between Beijing and Washington. The world’s second-largest economy has in recent years been mired in a persi…",
    "link": "https://www.digitaljournal.com/world/china-trade-beats-forecasts-in-september-as-tariff-fears-rise/article",
    "timestamp": "2025-10-13T04:22:32Z"
  },
  {
    "title": "Asian TT: Hong Kong make short work of Indian men",
    "description": "The Indian men's table tennis team was eliminated from the Asian Championships after a 0-3 quarterfinal loss to Hong Kong. Despite moments of brilliance, the Indian players struggled under pressure, failing to capitalize on crucial points. Head coach Massimo …",
    "link": "https://timesofindia.indiatimes.com/sports/more-sports/others/asian-tt-hong-kong-make-short-work-of-indian-men/articleshow/124517295.cms",
    "timestamp": "2025-10-13T04:21:55Z"
  },
  {
    "title": "Donald Trump Makes Admission About His Chances Of Heaven",
    "description": "Fox News' Peter Doocy asked the president about his afterlife prospects.",
    "link": "https://www.huffpost.com/entry/donald-trump-heaven_n_68ec794ae4b04c87b806c335",
    "timestamp": "2025-10-13T04:21:45Z"
  },
  {
    "title": "Taiwan sees no significant impact on chip sector from China rare earths curbs",
    "description": "Taiwan is home to the world's largest contract chipmaker TSMC, the producer of the vast majority of advanced chips that are a key component of artificial intelligence applications.",
    "link": "https://indianexpress.com/article/technology/tech-news-technology/taiwan-sees-no-significant-impact-on-chip-sector-from-china-rare-earths-curbs-10303621/",
    "timestamp": "2025-10-13T04:20:01Z"
  },
  {
    "title": "MP shocker: Youth made to wash feet, drink water as 'punishment' over AI-generated image; 6 booked",
    "description": "In Damoh, Madhya Pradesh, a young man faced public humiliation at a village panchayat for an AI-generated meme. He was allegedly forced to wash and drink water from the feet of another man as punishment. The incident, captured on video and widely shared, has …",
    "link": "https://timesofindia.indiatimes.com/city/bhopal/mp-shocker-youth-made-to-wash-feet-drink-water-as-punishment-over-ai-generated-image-6-booked/articleshow/124516854.cms",
    "timestamp": "2025-10-13T04:18:50Z"
  },
  {
    "title": "China's exports, imports top forecasts amid backdrop of fresh trade tensions",
    "description": "China's export growth accelerates, diversifying markets beyond U.S., amid trade war tensions with Trump administration.",
    "link": "https://www.thehindubusinessline.com/news/world/chinas-exports-imports-top-forecasts-amid-backdrop-of-fresh-trade-tensions/article70157273.ece",
    "timestamp": "2025-10-13T04:18:46Z"
  },
  {
    "title": "China's rare earth export ban broadens; US vows strong retaliation",
    "description": "China, on October 9, announced a major expansion of its rare earth export controls, escalating tensions with the US and drawing sharp criticism from President Donald Trump. In response, Trump vowed to impose 100% tariffs on Chinese goods starting on November …",
    "link": "https://www.digitimes.com/news/a20251013PD217/china-rare-earth-materials-exports-usa-taiwan.html",
    "timestamp": "2025-10-13T04:18:35Z"
  },
  {
    "title": "Jasmine Crockett Launches Investigation Into Alleged Cover Up Of Trump’s Failing Health: ‘The American People Deserve the Truth’ - NewsBreak",
    "description": "Congresswoman Jasmine Crockett (TX-30) has formally demanded answers from the White House regarding President Donald J. Trump’s health, citing what she cal",
    "link": "https://www.newsbreak.com/share/4286932363008-jasmine-crockett-launches-investigation-into-alleged-cover-up-of-trump-s-failing-health-the-american-people-deserve-the-truth?s=a2&amp;share_destination_id=MzUwNDAwOTQyLTE3NjAzMjg5NzQ3MDI%3D&amp;pd=0NiFI6Ya&amp;hl=en_US&amp;send_time=1760328974&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.3%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-13T04:18:11Z"
  },
  {
    "title": "Release of hostages to begin at 8 a.m., says Hamas, Herzog awards Trump medal of honor (10pm Pacific/ 1am Eastern) -- Live Updates",
    "description": "Hamas tells Red Cross that release of hostages will begin at 8:00 a.m. (10pm Pacific/ 1am Eastern). The report also mentioned that a technical meeting was held last night between Hamas and the Red Cross team to arrange the handover. Herzog to give Trump presi…",
    "link": "https://freerepublic.com/focus/f-news/4346028/posts",
    "timestamp": "2025-10-13T04:14:02Z"
  },
  {
    "title": "China’s exports to US drop in September, while rise in global shipments hits a 6-month high",
    "description": "HONG KONG (AP) — China’s exports to the United States fell 27% in September from the year before, even though growth in its global exports hit a six-month high. Customs figures released Monday showed that China’s worldwide exports were 8.3% higher than a year…",
    "link": "https://financialpost.com/pmn/chinas-exports-to-us-drop-in-september-while-rise-in-global-shipments-hits-a-6-month-high",
    "timestamp": "2025-10-13T04:12:50Z"
  },
  {
    "title": "China’s Export Growth Hits Six-Month High as Trade War Escalates - Bloomberg.com",
    "description": "China’s Export Growth Hits Six-Month High as Trade War EscalatesBloomberg.com China September exports beat expectations, imports rise at fastest pace since April 2024CNBC China exports accelerate as Xi Jinping and Donald Trump raise stakes in trade warFinanci…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179767220",
    "timestamp": "2025-10-13T04:12:25Z"
  },
  {
    "title": "Sensex falls over 400 pts, Nifty slips below 25,200 as global trade tensions flare",
    "description": "Indian benchmark indices Sensex and Nifty opened lower Monday, impacted by financial and oil & gas sector declines. Renewed global trade tensions, fueled by U.S. President Trump's actions against Beijing and China's rare earth export restrictions, rattled inv…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-400-pts-nifty-slips-below-25200-as-global-trade-tensions-flare/articleshow/124517045.cms",
    "timestamp": "2025-10-13T04:06:43Z"
  },
  {
    "title": "World leaders throw their weight behind the Gaza ceasefire deal",
    "description": "The U.S. and Egyptian presidents are chairing a gathering of world leaders dubbed “the Summit for Peace” to support ending the two-year war in Gaza after a...",
    "link": "https://www.yahoo.com/news/articles/world-leaders-throw-weight-behind-040631173.html",
    "timestamp": "2025-10-13T04:06:31Z"
  },
  {
    "title": "Is Donald Trump Intent Upon Imposing Martial Law in America?",
    "description": "History In 1936, the Nazi dictatorship in Germany organized SiPo, or Sicherheitspolizei. The move merged the Gestapo (Geheime Staatspolizei) and the Kriminalpolizei (Kripo, the criminal police). SiPo targeted political opposition to the Nazis, primarily commu…",
    "link": "https://www.lewrockwell.com/2025/10/no_author/is-donald-trump-intent-upon-imposing-martial-law-in-america/",
    "timestamp": "2025-10-13T04:01:00Z"
  },
  {
    "title": "Can Marijuana Legalization Help Keep Republican Majorities in Congress?",
    "description": "Eight years ago this month I commented that “I would not be surprised to see the US government legalize marijuana within the next five years.” That conclusion came upon my consideration of the then 64 percent nationwide support for legalization among American…",
    "link": "https://www.lewrockwell.com/2025/10/no_author/can-marijuana-legalization-help-keep-republican-majorities-in-congress/",
    "timestamp": "2025-10-13T04:01:00Z"
  },
  {
    "title": "Donald Trump, 79, Skewered for Embarrassing Geographical Flub",
    "description": "Donald Trump has made an awkward Middle East geographical blunder as he heads to Israel for the release of hostages from Gaza. Trump, 79, was talking to...",
    "link": "https://www.thedailybeast.com/donald-trump-79-skewered-for-embarrassing-geographical-flub/",
    "timestamp": "2025-10-13T04:00:33Z"
  },
  {
    "title": "Let's make Columbus Day great again",
    "description": "You can say Happy Columbus Day again. Delighted to see that because Columbus is totally misunderstood. Furthermore, much of this Columbus Derangement Syndrome is not really about what the guy did in 1492.\r\n\r\nThis is another attack on our culture, our...",
    "link": "https://www.americanthinker.com/blog/2025/10/let_s_make_columbus_day_great_again.html",
    "timestamp": "2025-10-13T04:00:00Z"
  },
  {
    "title": "The new Gazan Board of Peace: Can it work?",
    "description": "When I first heard this news about the Board of Peace in Gaza, I felt some trepidation: Does Donald Trump need one more project to lead, given all that he’s doing in the U.S.? But the fact is, Trump is probably the best person to head this Boar...",
    "link": "https://www.americanthinker.com/blog/2025/10/the_new_gazan_board_of_peace_can_it_work.html",
    "timestamp": "2025-10-13T04:00:00Z"
  },
  {
    "title": "From Oslo To Obsolescence: The Death Of The Nobel Peace Prize",
    "description": "The Nobel Peace Prize is dead—and it died of cowardice.\r\n\r\nThey gave Barack Obama a Nobel Peace Prize for hope.\r\n\r\nDonald Trump earned a ten for results—and got no prize.\r\n\r\nThat single fact reveals more about the moral and institutional ...",
    "link": "https://www.americanthinker.com/articles/2025/10/from_oslo_to_obsolescence_the_death_of_the_nobel_peace_prize.html",
    "timestamp": "2025-10-13T04:00:00Z"
  },
  {
    "title": "MAHA movement appeals to USDA’s Secretary Brooke Rollins to support small farms",
    "description": "Various organizations supporting the MAHA movement have written a letter to USDA’s Secretary Brooke Rollins, imploring her to adopt policies that support organic and regenerative farming to restore soil and food quality and boost struggling sma...",
    "link": "https://www.americanthinker.com/blog/2025/10/maha_movement_appeals_to_usda_s_secretary_brooke_rollins_to_support_small_farms.html",
    "timestamp": "2025-10-13T04:00:00Z"
  },
  {
    "title": "China's exports to US fall 27% in September, while global shipments jump",
    "description": "China has reported its exports to the United States fell 27% in September from the year before, even though growth in its global exports hit a six-month high. Customs figures released Monday showed that China's worldwide exports were 8.3% higher than a year e…",
    "link": "https://apnews.com/article/china-trade-trump-tariffs-exports-4d65b77167ed9193244942923f0eef8d",
    "timestamp": "2025-10-13T03:57:20Z"
  },
  {
    "title": "China's exports to US drop in September, while rise in global shipments hits a 6-month high",
    "description": "China's exports to the United States fell 27% in September from the year before, even though growth in its global exports hit a six-month high.  Customs...",
    "link": "https://www.yahoo.com/news/articles/chinas-exports-us-drop-september-035719679.html",
    "timestamp": "2025-10-13T03:57:19Z"
  },
  {
    "title": "Trump, oldest elected US president, in 'excellent' health: doctor - NewsBreak",
    "description": "Donald Trump is in \"excellent overall health,\" his physician said Friday after the 79-year-old -- the oldest elected president in US history -- underwent h",
    "link": "https://www.newsbreak.com/share/4284129155719-trump-oldest-elected-us-president-in-excellent-health-doctor?s=a2&amp;share_destination_id=MjUzMjk1NzM0LTE3NjAzMjc3ODU0MjU%3D&amp;pd=0H8nn4uG&amp;hl=en_US&amp;send_time=1760327785&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-13T03:56:52Z"
  },
  {
    "title": "Iran Boycotts Gaza Peace Summit",
    "description": "Iranian Foreign Minister Abbas Araghchi announced that neither President Pezeshkian nor he will attend the Sharm El-Sheikh summit, despite Egypt’s invitation.",
    "link": "https://sputnikglobe.com/20251013/iran-boycotts-gaza-peace-summit-1122948839.html",
    "timestamp": "2025-10-13T03:56:00Z"
  },
  {
    "title": "Chinese Economic Coercion, Rare Earth Minerals, and Tariffs: Decouple Now or Never",
    "description": "On Friday, President Trump made two posts on Truth Social in response to China’s announcement of stringent export controls on rare earth elements (REE) and related processing equipment. In the first post, he appeared to threaten to cancel his meeting with Xi …",
    "link": "https://freerepublic.com/focus/f-news/4346025/posts",
    "timestamp": "2025-10-13T03:55:24Z"
  },
  {
    "title": "Israel and Hamas to begin hostage-prisoner exchange: Live Updates",
    "description": "Hostage exchange between Hamas and Israel is set to begin under US-brokered deal amid Gaza ceasefire Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626240-israel-hamas-hostage-release/",
    "timestamp": "2025-10-13T03:54:06Z"
  },
  {
    "title": "Trump says he ended eight wars, links Russia-Ukraine conflict to his peace efforts",
    "description": "Trump says it was an ‘honour’ to have played a role in saving lives through his peace initiatives, adding that his actions were not driven by personal recognition or awards",
    "link": "https://www.thehindubusinessline.com/news/world/trump-says-he-ended-eight-wars-links-russia-ukraine-to-his-peacemaking/article70157217.ece",
    "timestamp": "2025-10-13T03:53:24Z"
  },
  {
    "title": "GM’s Rare-Earth Gamble Pays Off as China Tightens Magnet Exports - The Wall Street Journal",
    "description": "GM’s Rare-Earth Gamble Pays Off as China Tightens Magnet ExportsThe Wall Street Journal Cars to Fighter Jets: China’s New Export Curbs May Level a Heavy Blow WorldwideThe New York Times Trump wanted a trade deal. Xi opened a new front instead.Politico China '…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179767122",
    "timestamp": "2025-10-13T03:52:58Z"
  },
  {
    "title": "The second phase of the Gaza deal is the main challenge",
    "description": "The second phase could create a \"bottleneck\" leading to resumption of war - Maj. Gen. (ret.) Yaakov Amidror.",
    "link": "https://www.israelnationalnews.com/news/416208",
    "timestamp": "2025-10-13T03:52:00Z"
  },
  {
    "title": "US Market Crash: China's yuan edges up, recovers losses as strong midpoint rate eases US-China trade tensions after Trump tariff announcement",
    "description": "The Chinese Yuan saw a recovery against the dollar on Monday, October 13, 2025. This move helped ease the impact of renewed trade tensions between the US and China. Earlier, US President Donald Trump's tariff threats had caused a significant drop in US stock …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-market-crash-chinas-yuan-edges-up-recovers-losses-as-strong-midpoint-rate-eases-us-china-trade-tensions-after-trump-tariff-announcement/articleshow/124516837.cms",
    "timestamp": "2025-10-13T03:50:28Z"
  },
  {
    "title": "China's exports, imports top forecasts amid backdrop of fresh trade tensions",
    "description": "China’s export growth accelerated in September, rising 8.3% year-on-year, the fastest since March, as manufacturers tapped markets beyond the U.S. amid an ongoing trade war. Imports also surged 7.4%, marking the strongest pace since April 2024.",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-exports-imports-top-forecasts-amid-backdrop-of-fresh-trade-tensions/articleshow/124516775.cms",
    "timestamp": "2025-10-13T03:46:36Z"
  },
  {
    "title": "Google says Australian law on teen social media use 'extremely difficult' to enforce",
    "description": "Google has stated that Australia's new law banning social media for under-16s will be difficult to enforce and won't improve child safety online. The tech giant argues that the focus should be on safety tools and parental controls, not restricting access. Aus…",
    "link": "https://economictimes.indiatimes.com/tech/technology/google-says-australian-law-on-teen-social-media-use-extremely-difficult-to-enforce/articleshow/124516752.cms",
    "timestamp": "2025-10-13T03:44:19Z"
  },
  {
    "title": "Crypto derivatives funding rates drop to 3-year lows: A bullish sign?",
    "description": "Crypto derivatives funding rates have fallen to levels last seen in the 2022 bear market, as billions in leveraged positions were liquidated.",
    "link": "https://cointelegraph.com/news/derivatives-funding-rates-hit-bear-market-low-amid-historic-liquidations",
    "timestamp": "2025-10-13T03:44:11Z"
  },
  {
    "title": "Trump says he may send Tomahawk missiles to Ukraine",
    "description": "Ukraine wants long-range missiles to hit back at Russia - and Donald Trump says he may send Tomahawks.",
    "link": "https://www.bbc.com/news/articles/c93xpqgzkv0o",
    "timestamp": "2025-10-13T03:40:00Z"
  },
  {
    "title": "Israel Prepares To Welcome The Last Living Hostages From Gaza As A Ceasefire Holds",
    "description": "Israelis are preparing to welcome home the imminent return of the last living hostages from devastated Gaza and mourn the dead ones.",
    "link": "https://www.huffpost.com/entry/israel-mideast-wars-gaza-welcome-hostages_n_68ec73f8e4b04c87b806c1d0",
    "timestamp": "2025-10-13T03:39:04Z"
  },
  {
    "title": "Asian markets fall and gold soars as US-China trade tensions rise",
    "description": "Donald Trump strikes more conciliatory tone after threatening Beijing with 100% tariffs",
    "link": "https://biztoc.com/x/5251205d2709ce7c",
    "timestamp": "2025-10-13T03:37:12Z"
  },
  {
    "title": "2nd Test: 'Tricky afternoon' for India's bowlers",
    "description": "India's decision to enforce the follow-on on a slow Kotla pitch is being questioned after the West Indies batters showed resilience. Assistant coach Ryan ten Doeschate highlighted the challenges of bowling on the unresponsive surface, emphasizing the need for…",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/india-vs-west-indies/2nd-test-tricky-afternoon-for-indias-bowlers/articleshow/124516573.cms",
    "timestamp": "2025-10-13T03:32:05Z"
  },
  {
    "title": "Israel-Gaza ceasefire: Hostages, prisoners, aid, and Trump visit explained",
    "description": "Preparations are underway for the release of 48 hostages and around 2,000 Palestinian prisoners, including militants and civilians, while humanitarian aid is being ramped up to rebuild the war-torn Gaza.",
    "link": "https://www.thehindubusinessline.com/news/world/israel-gaza-ceasefire-hostages-prisoners-aid-and-trump-visit-explained/article70157205.ece",
    "timestamp": "2025-10-13T03:32:03Z"
  },
  {
    "title": "Google says Australian law on teen social media use 'extremely difficult' to enforce",
    "description": "Alphabet-owned Google on Monday said it would be &quot;extremely difficult&quot; for Australia to enforce a law prohibiting people younger than 16 from using social media, warning that the government's initiative would not make children safer online. Governme…",
    "link": "https://japantoday.com/category/tech/google-says-australian-law-on-teen-social-media-use-%27extremely-difficult%27-to-enforce",
    "timestamp": "2025-10-13T03:31:43Z"
  },
  {
    "title": "China's rare earth exports fall sharply in September",
    "description": "China's rare earth exports saw a sharp decline in September. This drop follows the implementation of new export controls. The decrease marks the lowest export level since February. These actions could affect trade relations with the United States. Further det…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/chinas-rare-earth-exports-fall-sharply-in-september/articleshow/124516615.cms",
    "timestamp": "2025-10-13T03:30:48Z"
  },
  {
    "title": "Rare praise: Hillary Clinton commends Trump for Gaza peace deal",
    "description": "Former Secretary of State Hillary Clinton praises Trump’s Gaza peace deal, calling it “a path forward.”",
    "link": "https://www.israelnationalnews.com/news/416199",
    "timestamp": "2025-10-13T03:26:32Z"
  },
  {
    "title": "Gauahar Khan mourns the demise of Oscar-winning actress Diane Keaton; says, “I loved her so much”",
    "description": "Hollywood mourns the loss of Oscar-winning actress Diane Keaton, who passed away on October 11, 2025, at 79. Her death, confirmed by official reports, has sent shockwaves through fans and the industry. Tributes highlight her iconic roles in films like 'Annie …",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/gauahar-khan-mourns-the-demise-of-oscar-winning-actress-diane-keaton-says-i-loved-her-so-much/articleshow/124516548.cms",
    "timestamp": "2025-10-13T03:26:30Z"
  },
  {
    "title": "China's September exports and imports surpass expectations",
    "description": "BEIJING () -China's export growth picked up pace in September, buoyed by manufacturers finding buyers in markets beyond the U. as a tariff deal with...",
    "link": "https://finance.yahoo.com/news/chinas-september-exports-imports-surpass-032329073.html",
    "timestamp": "2025-10-13T03:23:29Z"
  },
  {
    "title": "Trump’s ‘shock and awe’ foreign policy achieved a breakthrough in Gaza – but is it sustainable?",
    "description": "Trump’s foreign policy approach is fast-paced and intensely personal. The true test of its success won’t be Gaza, but geostrategic conflicts with China and Russia.",
    "link": "https://theconversation.com/trumps-shock-and-awe-foreign-policy-achieved-a-breakthrough-in-gaza-but-is-it-sustainable-267316",
    "timestamp": "2025-10-13T03:23:21Z"
  },
  {
    "title": "Schools are closed in these states from today: Here’s why",
    "description": "Schools in Karnataka, Rajasthan, Uttar Pradesh, and Bihar are observing holiday breaks this October. Karnataka schools remain closed for caste survey work, while Rajasthan and Uttar Pradesh have Diwali holidays. Bihar observes holidays for Diwali and Chhath P…",
    "link": "https://timesofindia.indiatimes.com/education/news/schools-are-closed-in-these-states-from-today-heres-why/articleshow/124516356.cms",
    "timestamp": "2025-10-13T03:22:34Z"
  },
  {
    "title": "\"Terrible\": Tee Higgins' mom fires back as Joe Flacco struggles in Bengals vs Packers debut",
    "description": "Joe Flacco's debut with the Bengals saw a 27-18 loss to the Packers, marked by his two touchdown passes but also struggles under pressure and a weak run game. Tee Higgins' mother voiced frustration over the offensive line's performance. The team faces urgent …",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/terrible-tee-higgins-mom-fires-back-as-joe-flacco-struggles-in-bengals-vs-packers-debut/articleshow/124516409.cms",
    "timestamp": "2025-10-13T03:22:15Z"
  },
  {
    "title": "How Trump bullied Netanyahu | Planet America",
    "description": "The peace deal between Hamas and Israel would not have been possible without Donald Trump bullying Benjamin Netanyahu ...",
    "link": "https://biztoc.com/x/de01e9265d04b11a",
    "timestamp": "2025-10-13T03:21:33Z"
  },
  {
    "title": "Naked bike riders demonstrate against federal troops in Portland protest",
    "description": "Protesters are pedaling through Portland's streets wearing nothing or close to it to rally against the Trump administration",
    "link": "https://abcnews.go.com/Politics/wireStory/naked-bike-riders-demonstrate-federal-troops-quintessentially-portland-126459644",
    "timestamp": "2025-10-13T03:18:49Z"
  },
  {
    "title": "Trump Believes Putin Will Settle Ukrainian Conflict",
    "description": "US President Donald Trump stated that he was confident that Russian President Vladimir Putin would settle the conflict in Ukraine.",
    "link": "https://sputnikglobe.com/20251013/trump-believes-putin-will-settle-ukrainian-conflict-1122948589.html",
    "timestamp": "2025-10-13T03:18:00Z"
  },
  {
    "title": "IND vs WI, 2nd Test: Campbell, Hope defy India on Kotla roadblock",
    "description": "The Feroz Shah Kotla pitch proved predictably slow and low, stifling India's bowlers and enabling unexpected West Indies batting resistance. Despite India enforcing the follow-on, the pitch's nature allowed John Campbell and Shai Hope to build a significant p…",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/india-vs-west-indies/ind-vs-wi-2nd-test-campbell-hope-defy-india-on-kotla-roadblock/articleshow/124516406.cms",
    "timestamp": "2025-10-13T03:17:28Z"
  },
  {
    "title": "Trump Says He May Warn Putin US to Mull Tomahawks for Ukraine (Josh Wingrove/Bloomberg)",
    "description": "Josh Wingrove / Bloomberg:\nTrump Says He May Warn Putin US to Mull Tomahawks for Ukraine  —  President Donald Trump said he'd consider arming Ukraine with long-range Tomahawk missiles that would allow strikes deeper into Russia, but said he may first talk to …",
    "link": "https://www.memeorandum.com/251012/p57",
    "timestamp": "2025-10-13T03:15:00Z"
  },
  {
    "title": "Hillary Clinton heaps rare praise on President Trump for handling of Israel-Hamas peace deal: 'I really commend' (Alex Oliveira/New York Post)",
    "description": "Alex Oliveira / New York Post:\nHillary Clinton heaps rare praise on President Trump for handling of Israel-Hamas peace deal: ‘I really commend’  —  Hillary Clinton heaped some rare praise on her former arch-enemy Donald Trump for his handling of the Gaza peac…",
    "link": "https://www.memeorandum.com/251012/p56",
    "timestamp": "2025-10-13T03:15:00Z"
  },
  {
    "title": "Trekking hills, phones on trees, welfare on hold: e-KYC mandate for Ladki Bahin aid cuts off tribal women amid Maharashtra’s digital divide",
    "description": "Tribal women in Maharashtra's Nandurbar district face immense challenges accessing government aid, trekking miles to find weak mobile signals for e-KYC verification for the Ladki Bahin Yojana. Despite the state mandating digital processes, patchy networks and…",
    "link": "https://timesofindia.indiatimes.com/city/nashik/trekking-hills-phones-on-trees-welfare-on-hold-e-kyc-mandate-for-ladki-bahin-aid-cuts-off-tribal-women-amid-maharashtras-digital-divide/articleshow/124515986.cms",
    "timestamp": "2025-10-13T03:13:26Z"
  },
  {
    "title": "As Donald Trump heads to Gaza ‘peace summit’ in Egypt who is going – and who isn’t? - The Guardian",
    "description": "As Donald Trump heads to Gaza ‘peace summit’ in Egypt who is going – and who isn’t?The Guardian Palestinian president to attend Egypt summit on ending war in GazaBBC Transcript: Badr Abdelatty on \"Face the Nation with Margaret Brennan,\" Oct. 12, 2025CBS News …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179766914",
    "timestamp": "2025-10-13T03:13:14Z"
  },
  {
    "title": "“A huge honor”—Jayson Tatum gets emotional as he drops two new Jordan Tatum 4 colorways",
    "description": "Jayson Tatum became emotional while launching his fourth signature shoe, the Jordan Tatum 4s, available October 10, 2025. He shared nostalgic childhood memories at Foot Locker, feeling honored to inspire the next generation. Tatum highlighted the St. Louis an…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/a-huge-honorjayson-tatum-gets-emotional-as-he-drops-two-new-jordan-tatum-4-colorways/articleshow/124516218.cms",
    "timestamp": "2025-10-13T03:09:03Z"
  },
  {
    "title": "IIT JAM registration deadline extended till October 20: Check how to apply and required documents",
    "description": "IIT Bombay has extended the registration deadline for the Joint Admission Test for Masters JAM 2026. Candidates can now apply until October 20, 2025. The JAM 2026 exam is scheduled for February 15, 2026. This exam offers admission to MSc and MS programs acros…",
    "link": "https://timesofindia.indiatimes.com/education/news/iit-jam-registration-deadline-extended-till-october-20-check-how-to-apply-and-required-documents/articleshow/124516251.cms",
    "timestamp": "2025-10-13T03:07:03Z"
  },
  {
    "title": "Hamas to release hostages in Gaza conflict milestone",
    "description": "Move in exchange for freeing of Palestinian prisoners comes as Donald Trump set to arrive in the region",
    "link": "https://biztoc.com/x/56c11bf3740239b2",
    "timestamp": "2025-10-13T03:03:50Z"
  },
  {
    "title": "Herzog to award Trump with Israel’s highest civilian honor",
    "description": "President Herzog to inform President Trump of his decision to award him the “Israeli Presidential Medal of Honor” in recognition of his efforts to bring the hostages home.",
    "link": "https://www.israelnationalnews.com/news/416197",
    "timestamp": "2025-10-13T03:00:06Z"
  },
  {
    "title": "SNL Cold Open: Tina Fey Does Kristi Noem",
    "description": "Former Saturday Night Live stalwarts Amy Poehler and Tina Fey dropped into the cold open last night to mock the odious AG Pam Bondi and DHS Secretary Kristi Noem, foremost known as Ice Barbie during a faux Senate hearing. \nBondi's actual appearance before the…",
    "link": "https://crooksandliars.com/2025/10/tina-fey-does-kristi-noem",
    "timestamp": "2025-10-13T03:00:01Z"
  },
  {
    "title": "'I am good at solving wars': Trump eyes Afghanistan-Pakistan conflict as Israel-Gaza war 'is over'",
    "description": "Following the brokered Gaza ceasefire, President Trump announced his intention to mediate the Pakistan-Afghanistan border conflict. He claimed to have resolved eight global disputes, including those between India and Pakistan, and listed other alleged success…",
    "link": "https://economictimes.indiatimes.com/news/defence/i-am-good-at-solving-wars-trump-eyes-afghanistan-pakistan-conflict-as-israel-gaza-war-is-over/articleshow/124515997.cms",
    "timestamp": "2025-10-13T02:58:32Z"
  },
  {
    "title": "Asian Equity Markets Drop After Trump Reignites Tariff Row",
    "description": "Asian markets sank Monday after US President Donald Trump reignited his trade war with China by threatening last week to impose 100 percent tariffs on goods from the country.",
    "link": "https://www.ibtimes.com/asian-equity-markets-drop-after-trump-reignites-tariff-row-3786665",
    "timestamp": "2025-10-13T02:57:11Z"
  },
  {
    "title": "History as flattery is a dangerous thing",
    "description": "Eric Metaxas's failed dream of hosting a late night talk show and what that has to do with the legacy of Silas Soule.",
    "link": "https://www.patheos.com/blogs/slacktivist/2025/10/12/history-as-flattery-is-a-dangerous-thing/",
    "timestamp": "2025-10-13T02:52:44Z"
  },
  {
    "title": "Asian equity markets drop after Trump reignites tariff row",
    "description": "Asian markets sank Monday after US President Donald Trump reignited his trade war with China by threatening last week to impose 100 percent tariffs on goods from the country. However, the losses were tempered slightly by a more conciliatory tone on Sunday whe…",
    "link": "https://www.digitaljournal.com/business/asian-equity-markets-drop-after-trump-reignites-tariff-row/article",
    "timestamp": "2025-10-13T02:52:32Z"
  },
  {
    "title": "Bernie Sanders Flips Mike Johnson's 'Hate America Rally' Lie On Its Head",
    "description": "Sanders told off the House speaker for calling an upcoming pro-democracy protest a gathering for Marxists and \"the Antifa crowd.\"",
    "link": "https://www.huffpost.com/entry/bernie-sanders-calls-out-mike-johnson-hate-america-rally-lies_n_68ec13e2e4b0116aa07cc913",
    "timestamp": "2025-10-13T02:49:16Z"
  },
  {
    "title": "Global volatility, Trump’s tariff threat, domestic Q2 results to shape market mood",
    "description": "Indian markets may open flat amid Trump’s China tariff threat. Focus shifts to Q2 results, CPI data, and strong IPO demand for Tata Capital, LG India.",
    "link": "https://www.thehindubusinessline.com/markets/global-volatility-trumps-tariff-threat-domestic-q2-results-to-shape-market-mood/article70157160.ece",
    "timestamp": "2025-10-13T02:43:09Z"
  },
  {
    "title": "White House reportedly mulling pardon for Binance founder CZ",
    "description": "New York Post columnist Charles Gasparino said talks in the White House to pardon Binance co-founder Changpeng Zhao is \"heating up.\"",
    "link": "https://cointelegraph.com/news/trump-white-house-mulls-cz-pardon-binance",
    "timestamp": "2025-10-13T02:42:48Z"
  },
  {
    "title": "Michael Dell Says 'Thank You for Your Attention To This Matter' As Trump Tries to Address China Trade Rift Over Rare Earths",
    "description": "On Sunday, Dell Technologies Inc. (NYSE:DELL) CEO Michael Dell reacted to President Donald Trump's comments on U.S.–China tensions, thanking him for addressing the ongoing trade and rare earth dispute that has rattled global markets.\nMichael Dell Backs Trump'…",
    "link": "https://biztoc.com/x/b0b1bb584a1fd37d",
    "timestamp": "2025-10-13T02:41:39Z"
  },
  {
    "title": "Vance Doesn’t Rule Out Trump's Use Of Insurrection Act",
    "description": "Vice President J.D. Vance's comments come as the president himself previously floated this possibility.",
    "link": "https://www.huffpost.com/entry/vance-trump-insurrection-act-national-guard_n_68ec286ce4b0116aa07cc94b",
    "timestamp": "2025-10-13T02:35:12Z"
  },
  {
    "title": "Trump warns Russia he may send Ukraine long-range Tomahawks if Moscow doesn’t settle war soon",
    "description": "President Donald Trump on Sunday warned Russia that he may send Ukraine long-range Tomahawk missiles if Moscow doesn’t settle its war there soon — suggesting that he could be ready to increase the pressure on Vladimir Putin’s government using a key weapons sy…",
    "link": "https://www.wpxi.com/news/local/trump-warns-russia-he-may-send-ukraine-long-range-tomahawks-if-moscow-doesnt-settle-war-soon/TD4Y26JDONBFZJHDK2H27LSXTU/",
    "timestamp": "2025-10-13T02:30:57Z"
  },
  {
    "title": "Bitcoin, Ethereum, XRP, Dogecoin Rebound After Trump Says US 'Wants To Help' China: Analyst Sees No Bear Market Signal Yet",
    "description": "Leading cryptocurrencies rallied alongside stock futures Sunday overnight after President Donald Trump hinted at possible de-escalation of trade tensions between the U.S. and China.\nCryptocurrency\nGains +/-\nPrice (Recorded at 9:35 p.m. ET)\nBitcoin (CRYPTO: BT…",
    "link": "https://biztoc.com/x/c104e639794062e6",
    "timestamp": "2025-10-13T02:30:27Z"
  },
  {
    "title": "Xi’s red line on Trump’s export curbs threatens to upend truce",
    "description": "The renewed brinkmanship between China and the U.S. revives fears of a deeper rupture in global trade that could push the two economies toward partial decoupling.",
    "link": "https://www.japantimes.co.jp/business/2025/10/13/xi-trump-export-curbs-truce/",
    "timestamp": "2025-10-13T02:28:00Z"
  },
  {
    "title": "Zelenskyy: Trump’s Gaza peace deal offers hope for Ukraine",
    "description": "Ukrainian President praises Trump’s Gaza ceasefire and urges similar pressure on Putin.",
    "link": "https://www.israelnationalnews.com/news/416195",
    "timestamp": "2025-10-13T02:22:18Z"
  },
  {
    "title": "Trump may approve Tomahawks for Ukraine if Russia continues war",
    "description": "WASHINGTON: US President Donald Trump said on Sunday (Oct 12) he may offer long-range Tomahawk missiles that could be used by Kyiv if Russian President Vladimir Putin does not end the war in Ukraine.Trump told reporters aboard Air Force One as he flew to Isra…",
    "link": "https://www.channelnewsasia.com/world/trump-ukraine-russia-war-approve-tomahawks-missiles-5397596",
    "timestamp": "2025-10-13T02:20:00Z"
  }
]