[
  {
    "title": "Gaza: US Forces Can Be Liable for Assisting Israeli War Crimes (HRW)",
    "description": "Human Rights Watch - (Washington, DC) – US military personnel could face legal liability for assisting Israeli forces who commit war crimes in Gaza, Human Rights Watch said today.  Direct participation by US forces in military operations in Gaza since October…",
    "link": "https://www.juancole.com/2025/08/forces-assisting-israeli.html",
    "timestamp": "2025-08-28T04:06:02Z"
  },
  {
    "title": "White House fires US health agency head after she refused to quit",
    "description": "The Trump administration confirmed Wednesday it was firing the head of the top US public health agency after she refused to step down during a stand-off with vaccine skeptic Health Secretary Robert F. Kennedy Jr.",
    "link": "https://www.enca.com/news/white-house-fires-us-health-agency-head-after-she-refused-quit",
    "timestamp": "2025-08-28T04:05:28Z"
  },
  {
    "title": "Trump administration to take control of Washington's Union Station",
    "description": "The Transportation Department, under President Trump, plans to reclaim management of Washington's Union Station, citing concerns about its condition and aiming to improve its management and attract new revenue. This decision follows Trump's increased federal …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-to-take-control-of-washingtons-union-station/articleshow/123555552.cms",
    "timestamp": "2025-08-28T04:04:56Z"
  },
  {
    "title": "Trump Should Stay Out of South Korean Politics",
    "description": "The White House meeting with President Lee Jae Myung on Monday went better than many feared.\nThe post Trump Should Stay Out of South Korean Politics appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-should-stay-out-of-south-korean-politics/",
    "timestamp": "2025-08-28T04:03:00Z"
  },
  {
    "title": "Why stock market is down today? Key factors behind the 600-point Sensex crash, Nifty below 24,550",
    "description": "Indian equities experienced a sharp decline on Thursday, triggered by the implementation of 25% US tariffs on Indian imports. The Sensex and Nifty opened significantly lower, with banks facing the most substantial selling pressure. Weak global cues and contin…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-down-today-key-factors-behind-the-650-point-sensex-crash-nifty-below-24550/articleshow/123555258.cms",
    "timestamp": "2025-08-28T04:01:42Z"
  },
  {
    "title": "US disease control chief fired in clash over Covid vaccines",
    "description": "Susan Monarez has accused Health Secretary Robert F. Kennedy Jr. of “weaponizing public health” in a dispute over vaccine policy Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623611-cdc-chief-covid-vaccines/",
    "timestamp": "2025-08-28T04:01:37Z"
  },
  {
    "title": "World Liberty Financial (WLFI): Expert’s Price Prediction Ahead Of Sept. 1 Launch",
    "description": "World Liberty Financial, a decentralized finance (DeFi) platform with backing from President Donald Trump and his family, is poised to launch its native token, WLFI, on September 1.  Expert Predicts $1 Price Target As WLFI prepares to launch, the token will b…",
    "link": "http://www.newsbtc.com/news/world-liberty-financial-wlfi-experts-price-prediction-ahead-of-sept-1-launch/",
    "timestamp": "2025-08-28T04:00:49Z"
  },
  {
    "title": "Mamdani does a Dukakis; Riley Gaines helps",
    "description": "I’ve seldom seen a better example of a rhetorical question—one to which the answer is so obvious no response is necessary—than this:\r\n\r\n\r\n\r\nGraphic: X Post\r\n\r\nNo. No there isn’t, with perhaps one exception, thanks to a woman.&...",
    "link": "https://www.americanthinker.com/blog/2025/08/mamdani_does_a_dukakis_riley_gaines_helps.html",
    "timestamp": "2025-08-28T04:00:00Z"
  },
  {
    "title": "Christians slaughtered in Minneapolis … you know the rest",
    "description": "Evil defeated tolerance again yesterday, in George Floyd’s Minneapolis.\r\n\r\nJust days after the Democratic National Committee held its “Summer Camp” in the Minneapple, with a speaker remarking that most Americans don’t care abo...",
    "link": "https://www.americanthinker.com/blog/2025/08/christians_slaughtered_in_minneapolis_you_know_the_rest.html",
    "timestamp": "2025-08-28T04:00:00Z"
  },
  {
    "title": "Who believes what Democrats are saying anymore?",
    "description": "Jamie Raskin (D-Md.) commented recently on President Trump’s ongoing crime crackdowns.  He said, “He’s trying to militarize the society and intimidate his political opponents.  The whole idea of picking cities ba...",
    "link": "https://www.americanthinker.com/blog/2025/08/who_believes_what_democrats_are_saying_anymore.html",
    "timestamp": "2025-08-28T04:00:00Z"
  },
  {
    "title": "Chicago woman: living in TDS wonderland",
    "description": "There’s a venerable saying: “a conservative is a liberal who has been mugged.”\r\n\r\nThat pithy aphorism expresses what most would think a common-sense, universal truth, namely that people can choose to believe pretty much anything unt...",
    "link": "https://www.americanthinker.com/blog/2025/08/chicago_woman_living_in_tds_wonderland.html",
    "timestamp": "2025-08-28T04:00:00Z"
  },
  {
    "title": "Americans Widely Pessimistic About Ukraine-Russia Peace Deal",
    "description": "By 67% to 31%, Americans are more pessimistic than optimistic that an agreement between Ukraine and Russia can be reached to end the war.",
    "link": "https://news.gallup.com/poll/694496/americans-widely-pessimistic-ukraine-russia-peace-deal.aspx",
    "timestamp": "2025-08-28T04:00:00Z"
  },
  {
    "title": "Israel: The canary in the West’s coal mine",
    "description": "As Hamas nears defeat, the world seems determined to stop Israel — yet the stakes go far beyond Gaza.  The West is ignoring the warning signs: Israel’s survival is a test for the survival of Western civilization.\r\n\r\nEven Preside...",
    "link": "https://www.americanthinker.com/blog/2025/08/israel_the_canary_in_the_west_s_coal_mine.html",
    "timestamp": "2025-08-28T04:00:00Z"
  },
  {
    "title": "Final arguments in publisher Jimmy Lai's national security trial conclude in Hong Kong",
    "description": "The final arguments have concluded in the national security trial of Hong Kong pro-democracy newspaper founder Jimmy Lai",
    "link": "https://abcnews.go.com/International/wireStory/final-arguments-publisher-jimmy-lais-national-security-trial-125047966",
    "timestamp": "2025-08-28T03:58:24Z"
  },
  {
    "title": "North Korean leader Kim Jong Un will attend a military parade in Beijing next week",
    "description": "North Korean leader Kim Jong Un will make a rare trip abroad next week to attend a military parade in the Chinese capital, North Korean and Chinese state media said Thursday",
    "link": "https://abcnews.go.com/International/wireStory/north-korean-leader-kim-jong-attend-military-parade-125046981",
    "timestamp": "2025-08-28T03:58:14Z"
  },
  {
    "title": "Gavin Newsom Reveals What World Leaders Really Say About Trump Behind His Back",
    "description": "The California governor has been getting under the president's skin in recent weeks.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-trump-world-leaders_n_68afc0cce4b0d087ed3ea699",
    "timestamp": "2025-08-28T03:57:43Z"
  },
  {
    "title": "Donald Trump wants Europe to stop regulating Big Tech. Will it bend?",
    "description": "Despite a new trade deal, tensions persist between President Trump and the EU over tech regulation. Trump criticised European digital laws as discriminatory against US firms, threatening tariffs and sanctions. The EU defended its rules as universal, but faces…",
    "link": "https://economictimes.indiatimes.com/tech/technology/donald-trump-wants-europe-to-stop-regulating-big-tech-will-it-bend/articleshow/123555437.cms",
    "timestamp": "2025-08-28T03:55:07Z"
  },
  {
    "title": "EU system returns from August break to a full in-tray",
    "description": "Europe letter: Key decisions to be taken on Mercosur deal, union budget and logjammed financial reforms",
    "link": "https://www.irishtimes.com/world/europe/2025/08/28/eu-system-returns-from-august-break-to-a-full-in-tray/",
    "timestamp": "2025-08-28T03:51:00Z"
  },
  {
    "title": "Trump fires CDC head after one month on the job. Her lawyers say she ‘refused to rubber-stamp unscientific, reckless directives’",
    "description": "The director of the nation’s top public health agency has been fired after less than one month in the job, and several top agency leaders have resigned.\nSusan Monarez isn’t “aligned with” President Donald Trump’s agenda and refused to resign, so the White Hou…",
    "link": "https://biztoc.com/x/45ff52ceff5f60a5",
    "timestamp": "2025-08-28T03:49:12Z"
  },
  {
    "title": "CIA Russia specialist reportedly ousted after Alaska summit",
    "description": "United States President Donald Trump and Director of National Intelligence Tulsi Gabbard removed one of the Central Intelligence Agency's (CIA) top Russia experts days after she helped prepare Tru...",
    "link": "https://biztoc.com/x/0db28c408620e4dc",
    "timestamp": "2025-08-28T03:49:10Z"
  },
  {
    "title": "Ukraine updates: 'Massive' Russian strike on Kyiv",
    "description": "Russia launched a \"massive\" night-time attack on the Ukrainian capital on Thursday morning, killing at least three people and wounding 12 more. Explosions were also heard in Sumy, Dnieper and Zaporizhzhia. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-massive-russian-strike-on-kyiv/live-73789764",
    "timestamp": "2025-08-28T03:49:00Z"
  },
  {
    "title": "Al Sharpton to lead pro-DEI march through Wall Street on anniversary of the 1963 March on Washington",
    "description": "The Rev. Al Sharpton will lead a protest march on Wall Street to urge corporate America to resist the Trump administration’s campaign to roll back diversity,...",
    "link": "https://www.yahoo.com/news/articles/al-sharpton-lead-pro-dei-034625925.html",
    "timestamp": "2025-08-28T03:46:25Z"
  },
  {
    "title": "Trump spoke for the 'go woke, go broke' crowd. Did Cracker Barrel listen?",
    "description": "Trump intervened in the Cracker Barrel logo controversy, flexing his influence over big business and handing a win to the \"go woke, go broke\" crowd.",
    "link": "https://www.usatoday.com/story/money/2025/08/27/trump-win-cracker-barrel-logo-controversy/85856637007/",
    "timestamp": "2025-08-28T03:46:11Z"
  },
  {
    "title": "ABC News, CNN Downplay Alleged Minneapolis Shooter's Trump, Catholic Hatred",
    "description": "Segments on ABC News and CNN appeared to downplay the alleged Minneapolis shooter's hatred of President Donald Trump and Catholicism on Tuesday after two children were killed while attending Mass.\nThe post ABC News, CNN Downplay Alleged Minneapolis Shooter’s …",
    "link": "https://www.breitbart.com/politics/2025/08/27/abc-news-cnn-downplay-minneapolis-shooters-trump-catholic-hatred/",
    "timestamp": "2025-08-28T03:46:07Z"
  },
  {
    "title": "Donald Trump Looks Terrible. Why Won't the Press Ask Him What's Wrong? (Brian Lowry/The Wrap)",
    "description": "Brian Lowry / The Wrap:\nDonald Trump Looks Terrible.  Why Won't the Press Ask Him What's Wrong?  —  Donald Trump looks lousy.  He has unexplained bruises on his hands.  His ankles are swollen.  He's walking oddly.  He keeps mixing up names, or using the wrong…",
    "link": "https://www.memeorandum.com/250827/p165",
    "timestamp": "2025-08-28T03:45:01Z"
  },
  {
    "title": "Firefighters Arrested in ‘Border Patrol Operation’ While Fighting Massive Fire",
    "description": "Two firefighters in Washington state were arrested on Wednesday while combating the largest wildfire in the state.\nThe post Firefighters Arrested in ‘Border Patrol Operation’ While Fighting Massive Fire first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/firefighters-arrested-in-border-patrol-operation-while-fighting-massive-fire/",
    "timestamp": "2025-08-28T03:42:19Z"
  },
  {
    "title": "Child among three killed in overnight attack on Kyiv",
    "description": "More than 20 districts were targeted in the bombardment which involved missiles, officials say.",
    "link": "https://www.bbc.com/news/articles/cvg3y7m2gz0o",
    "timestamp": "2025-08-28T03:39:22Z"
  },
  {
    "title": "Trump administration moves to tighten duration of visas for students and media",
    "description": "The latest move would create new hurdles for international students, exchange workers and foreign journalists who would have to apply to extend their stay in the US rather than maintain a more flexible legal status",
    "link": "https://www.thehindubusinessline.com/news/world/trump-administration-moves-to-tighten-duration-of-visas-for-students-and-media/article69983143.ece",
    "timestamp": "2025-08-28T03:38:17Z"
  },
  {
    "title": "Trump fires CDC head after one month on the job. Her lawyers say she ‘refused to rubber-stamp unscientific, reckless directives’",
    "description": "Susan Monarez's departure coincided with the resignations this week of at least four top CDC officials.",
    "link": "https://fortune.com/2025/08/27/trump-fires-cdc-head-susan-monarez-vaccines/",
    "timestamp": "2025-08-28T03:37:25Z"
  },
  {
    "title": "Trump and RFK Jr. to Ban COVID-19 Vaccine 'Within Months'",
    "description": "The Daily Beast has this worrying article: \nThe Trump administration will move to pull the COVID vaccine off the U.S. market “within months,” one of Robert F. Kennedy Jr.’s closest associates has told the Daily Beast.\n \nDr. Aseem Malhotra, a British cardiolog…",
    "link": "https://slashdot.org/submission/17339590/trump-and-rfk-jr-to-ban-covid-19-vaccine-within-months",
    "timestamp": "2025-08-28T03:36:51Z"
  },
  {
    "title": "Guard not needed in Chicago, Pritzker tells AP during tour of city to counter Trump's crime claims (Sophia Tareen/Associated Press)",
    "description": "Sophia Tareen / Associated Press:\nGuard not needed in Chicago, Pritzker tells AP during tour of city to counter Trump's crime claims  —  Illinois Gov. JB Pritzker is doubling down on his message to President Donald Trump that the nation's third-largest city d…",
    "link": "https://www.memeorandum.com/250827/p164",
    "timestamp": "2025-08-28T03:35:00Z"
  },
  {
    "title": "Top Hong Kong officials drop out of Bitcoin conference after advice to avoid Eric Trump",
    "description": "The withdrawal of officials highlights potential geopolitical tensions affecting international crypto collaborations and conference dynamics.\nThe post Top Hong Kong officials drop out of Bitcoin conference after advice to avoid Eric Trump appeared first on Cr…",
    "link": "https://cryptobriefing.com/hong-kong-bitcoin-conference/",
    "timestamp": "2025-08-28T03:28:58Z"
  },
  {
    "title": "‘Kill Donald Trump’ scribbled on weapons: What we know about Minneapolis school shooter",
    "description": "According to the Minneapolis Police Chief, Robin Westman was armed with a rifle, shotgun and pistol, and fired dozens of rounds through church windows where children were seated for Mass.",
    "link": "https://indianexpress.com/article/world/minneapolis-school-shooter-profile-scribbled-kill-donald-trump-10215550/",
    "timestamp": "2025-08-28T03:25:48Z"
  },
  {
    "title": "Lawyer chides Trump prosecutor after 'consequential' court loss: 'Not so fast, Jeanine!'",
    "description": "A former federal prosecutor chided one of President Donald Trump's lawyers on Wednesday after she suffered a series of defeats in court. Glenn Kirschner, who served as an assistant U.S. attorney in Washington, D.C., joined progressive YouTuber Brian Tyler Coh…",
    "link": "https://www.rawstory.com/glenn-kirschner/",
    "timestamp": "2025-08-28T03:25:44Z"
  },
  {
    "title": "Gavin Newsom Blames Republicans for Minneapolis Catholic School Shooting: 'This Is Sick'",
    "description": "Democrat California Gov. Gavin Newsom immediately politicized the mass shooting at a Catholic school in Minneapolis on Wednesday by blaming Republicans.\nThe post Gavin Newsom Blames Republicans for Minneapolis Catholic School Shooting: ‘This Is Sick’ appeared…",
    "link": "https://www.breitbart.com/politics/2025/08/27/gavin-newsom-blames-republicans-minneapolis-catholic-school-shooting/",
    "timestamp": "2025-08-28T03:24:29Z"
  },
  {
    "title": "Chris Hayes Slams Trump’s Use of National Guard to Pick Up Trash: ‘Bizarre on Many Levels’ | Video",
    "description": "The soldiers are doing the work that was previously ascribed to National Parks employees — many of whom were fired by DOGE\nThe post Chris Hayes Slams Trump’s Use of National Guard to Pick Up Trash: ‘Bizarre on Many Levels’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/chris-hayes-slams-trumps-use-of-national-guard-to-pick-up-trash-bizarre-on-many-levels-video/",
    "timestamp": "2025-08-28T03:23:17Z"
  },
  {
    "title": "Senator Calls For RFK Jr.'s Firing After CDC Director's Ousting",
    "description": "The dispute over Monarez's employment status unfolded on Wednesday evening, after the HHS posted that she was \"no longer director.\"",
    "link": "https://www.newsweek.com/senator-calls-rfk-jr-firing-after-cdc-director-ousting-2120551",
    "timestamp": "2025-08-28T03:21:24Z"
  },
  {
    "title": "India seen among Asia’s fastest growing economies as Trump’s tariff meets PM Modi’s GST power move",
    "description": "Despite facing headwinds from increased US tariffs, India's economic growth is projected to remain strong, averaging above 6% through the decade. This resilience is attributed to robust domestic consumption, Prime Minister Narendra Modi's recently proposed GS…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/india-gdp-growth-gst-rate-cuts-india-seen-staying-among-asias-fastest-growing-economy-as-trumps-tariff-meets-pm-modis-goods-and-services-power-move-fitch-bmi-says/articleshow/123554764.cms",
    "timestamp": "2025-08-28T03:21:15Z"
  },
  {
    "title": "Mexico suspends postal shipments to the US over latest tariff confusion",
    "description": "Mexico says its postal service is suspending package shipments to the United States, following similar steps taken by countries from the European Union and elsewhere.",
    "link": "https://www.ksat.com/business/2025/08/27/mexico-suspends-postal-shipments-to-the-us-over-latest-tariff-confusion/",
    "timestamp": "2025-08-28T03:20:25Z"
  },
  {
    "title": "Melania Trump Reacts to Fatal Minnesota Annunciation School Shooting",
    "description": "The attack struck at a place of worship and learning, intensifying national debate over school safety.",
    "link": "https://www.newsweek.com/melania-trump-reacts-minnesota-annunciation-school-shooting-2120559",
    "timestamp": "2025-08-28T03:19:05Z"
  },
  {
    "title": "Mexico suspends postal shipments to the US over latest tariff confusion",
    "description": "Mexico says its postal service is suspending package shipments to the United States, following similar steps taken by countries from the European Union and elsewhere",
    "link": "https://abcnews.go.com/Business/wireStory/mexico-suspends-postal-shipments-us-latest-tariff-confusion-125041842",
    "timestamp": "2025-08-28T03:18:17Z"
  },
  {
    "title": "Mexico suspends postal shipments to the US over latest tariff confusion",
    "description": "Mexico says its postal service is suspending package shipments to the United States, following similar steps taken by countries from the European Union and elsewhere",
    "link": "https://abcnews.go.com/International/wireStory/mexico-suspends-postal-shipments-us-latest-tariff-confusion-125041841",
    "timestamp": "2025-08-28T03:18:17Z"
  },
  {
    "title": "Elon Musk's DOGE copied entire Social Security database to an insecure cloud system, whistleblower says",
    "description": "The Social Security Administration's Chief Data Officer is blowing the whistle on President Donald Trump and Elon Musk's Department of Government Efficiency, better known as DOGE.\nAccording to the Government Accountability Project, which is representing whist…",
    "link": "https://biztoc.com/x/3ee996e6b019a545",
    "timestamp": "2025-08-28T03:15:29Z"
  },
  {
    "title": "Minneapolis Mayor Slams Anti-Trans Hate After School Shooting",
    "description": "Minneapolis Mayor Jacob Frey excoriated transphobes for tying a mass shooting to their hateful ideology. At a press conference Wednesday about the Annunciation Catholic School shooting Wednesday, Minneapolis Mayor Jacob Frey called out groups and individuals …",
    "link": "https://freerepublic.com/focus/f-news/4337181/posts",
    "timestamp": "2025-08-28T03:12:02Z"
  },
  {
    "title": "How rare earth shortages are stalling India’s burgeoning EV sector",
    "description": "China introduced restrictions on its rare earth exports in April, two days after Trump announced retaliatory tariffs.",
    "link": "https://www.aljazeera.com/economy/2025/8/28/how-rare-earth-shortages-are-stalling-indias-burgeoning-ev-sector",
    "timestamp": "2025-08-28T03:10:19Z"
  },
  {
    "title": "Denmark summons US envoy over claims of interference in Greenland",
    "description": "The top U.S. diplomat in Denmark has been summoned by the government after a report that people connected to President Donald Trump have been carrying out covert influence operations in Greenland",
    "link": "https://abcnews.go.com/US/wireStory/denmark-summons-us-envoy-claims-interference-greenland-125012614",
    "timestamp": "2025-08-28T03:10:15Z"
  },
  {
    "title": "Trump stamps ‘dictator chic’ on Washington",
    "description": "From a gold-plated White House to a grandiose revamp for the capital Washington, Donald Trump is trying to leave an architectural mark like no American president has attempted for decades. “I’m good at building things,” the former property magnate said earlie…",
    "link": "https://www.digitaljournal.com/world/trump-stamps-dictator-chic-on-washington/article",
    "timestamp": "2025-08-28T03:07:20Z"
  },
  {
    "title": "DNC Meeting Featured Painfully Cringe ‘Fight Song’ For Democrats to Sing",
    "description": "Attendees at a Democratic National Committee meeting in Minneapolis this week were reportedly encouraged to sing a Democrat \"fight song.\"\nThe post DNC Meeting Featured Painfully Cringe ‘Fight Song’ For Democrats to Sing first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/dnc-meeting-featured-painfully-cringe-fight-song-for-democrats-to-sing/",
    "timestamp": "2025-08-28T03:06:14Z"
  },
  {
    "title": "Trump Announces ‘Comprehensive Crime Bill’",
    "description": "By George Caldwell, The Daily Signal | August 27, 2025\nPresident Donald Trump announced work on a “Comprehensive Crime Bill” shortly after midnight Wednesday morning, as polls show the popularity of tough-on-crime policy.\n“Speaker Mike Johnson, and Leader Joh…",
    "link": "https://biztoc.com/x/3fd2e8237470c610",
    "timestamp": "2025-08-28T03:04:04Z"
  },
  {
    "title": "One America News Set for Full YouTube Return With Pay-TV Carriage Agreement",
    "description": "The right-wing One America News had been deplatformed – by nearly everyone – after spreading Donald Trump's 2020 election-fraud claims\nThe post One America News Set for Full YouTube Return With Pay-TV Carriage Agreement appeared first on TheWrap.",
    "link": "https://www.thewrap.com/one-america-news-youtube-return-pay-tv-carriage-agreement/",
    "timestamp": "2025-08-28T03:03:45Z"
  },
  {
    "title": "Ukraine says nighttime attack by Russia on Kyiv leaves at least 3 dead, 12 injured",
    "description": "Ukraine's capital, Kyiv, came under a mass nighttime Russian attack, officials said early Thursday, with at least three dead, including a child, 12 injured and damage to buildings in several districts.",
    "link": "https://www.cbc.ca/news/world/kyiv-ukraine-capital-russian-attack-1.7619702",
    "timestamp": "2025-08-28T03:03:12Z"
  },
  {
    "title": "Labor Union Approval Relatively Steady at 68% in U.S.",
    "description": "Public approval of labor unions remains historically strong at 68%, marking the fifth consecutive year with nearly 70% support.",
    "link": "https://news.gallup.com/poll/694472/labor-union-approval-relatively-steady.aspx",
    "timestamp": "2025-08-28T03:00:00Z"
  },
  {
    "title": "Putin, Xi, and Kim set to unite at major military parade",
    "description": "China, Russia, and North Korea are close allies. Beijing has long been Pyongyang's biggest aid and trading partner, while Kim Jong Un has been providing Vladimir Putin with troops for his war in Ukraine.",
    "link": "https://news.sky.com/story/putin-xi-and-kim-set-to-unite-at-major-military-parade-13419723",
    "timestamp": "2025-08-28T02:55:00Z"
  },
  {
    "title": "Israel ups pressure on Gaza City as Trump talks post-war plan",
    "description": "GAZA CITY: The Israeli military pressed operations around Gaza City on Wednesday (Aug 28) as US President Donald Trump hosted a meeting on post-war plans for the shattered Palestinian territory. Israel is under mounting pressure both at home and abroad to end…",
    "link": "https://www.channelnewsasia.com/world/israel-ups-pressure-gaza-city-trump-talks-post-war-plan-5318166",
    "timestamp": "2025-08-28T02:52:00Z"
  },
  {
    "title": "EU and UK summon Russian diplomats after Kyiv attacks",
    "description": "The European Union and the UK have summed top Russian diplomats after a massive attack on the Ukrainian capital in which 15 people were killed and the EU's diplomatic mission and British council buildings were damaged.",
    "link": "https://www.rte.ie/news/ukraine/2025/0828/1530538-ukraine-russia/",
    "timestamp": "2025-08-28T02:49:39Z"
  },
  {
    "title": "Kim Jong Un and Putin top Xi’s guest list for China’s huge military parade | CNN",
    "description": "Russian President Vladimir Putin and North Korean leader Kim Jong Un will be among more than two dozen foreign leaders to attend China’s massive military parade next week, the Chinese Foreign Ministry announced Thursday.",
    "link": "https://www.cnn.com/2025/08/27/china/china-military-parade-putin-kim-intl-hnk",
    "timestamp": "2025-08-28T02:47:03Z"
  },
  {
    "title": "North Korea's Kim Jong Un to attend China military parade",
    "description": "The parade will mark the 80th anniversary of China's war against Japan and the end of World War Two.",
    "link": "https://www.bbc.com/news/articles/c17njr88ge4o",
    "timestamp": "2025-08-28T02:45:31Z"
  },
  {
    "title": "Americans needed to see Zelensky’s White House ‘blowup’ – Vance",
    "description": "The US vice president believes the “blowup” shed light on Washington’s frustration with Kiev and was “useful” for the American people to see Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623610-vance-zelensky-white-house-useful/",
    "timestamp": "2025-08-28T02:41:39Z"
  },
  {
    "title": "John Bolton Inquiry Eyes Emails Obtained by Foreign Government - The New York Times",
    "description": "John Bolton Inquiry Eyes Emails Obtained by Foreign GovernmentThe New York Times The Natural End Point of Trump’s FalsehoodsThe Atlantic Why defending John Bolton matters in the age of TrumpAl Jazeera Bolton may be in hot water as FBI investigation expands be…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178900762",
    "timestamp": "2025-08-28T02:35:13Z"
  },
  {
    "title": "Getting (throwing) a sandwich indicted",
    "description": "The grand jury system in D.C. continues to resist: You could get a grand jury to indict a ham sandwich, the saying goes, but, in Washington, a federal grand jury just declined to indict a man for throwing a salami sub. The grand jury did not return an indictm…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/getting-throwing-a-sandwich-indicted",
    "timestamp": "2025-08-28T02:33:29Z"
  },
  {
    "title": "North Korea's Kim Jong Un to attend China military parade",
    "description": "The parade will mark the 80th anniversary of China's war against Japan and the end of World War Two.",
    "link": "https://www.bbc.co.uk/news/articles/c17njr88ge4o",
    "timestamp": "2025-08-28T02:32:55Z"
  },
  {
    "title": "Fmr FBI Profiler Tells Feds What Physical Clues They Need To Determine What Made MN Shooter ‘Do What He Did Today’",
    "description": "Fmr FBI profiler advised investigators to review the toxicology report of the trans-identifying male who opened fire in MN to help determine his motive.",
    "link": "https://dailycaller.com/2025/08/27/fmr-fbi-profiler-feds-toxicology-report-mass-shooter-minneapolis-catholic-church/",
    "timestamp": "2025-08-28T02:31:18Z"
  },
  {
    "title": "\"Indian intransigence\" about opening its markets to American products, says US Economic Council Director as 50% tariff kicks in",
    "description": "US National Economic Council Director Kevin Hassett cited India's reluctance to open its markets to American products, describing the India-US relationship as \"complicated.\" This follows Washington's imposition of 50 per cent tariffs on Indian goods. Hassett …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indian-intransigence-about-opening-its-markets-to-american-products-says-us-economic-council-director-as-50-tariff-kicks-in/articleshow/123554353.cms",
    "timestamp": "2025-08-28T02:28:58Z"
  },
  {
    "title": "Pakistan seeks US loan to develop mega copper mine with Canadian partner",
    "description": "With World Bank, ADB on board, Pakistan now turns to US for Reko Diq mine funding",
    "link": "https://indianexpress.com/article/business/pakistan-seeks-us-loan-to-develop-mega-copper-mine-with-canadian-partner-10215527/",
    "timestamp": "2025-08-28T02:27:52Z"
  },
  {
    "title": "North Korea's Kim Jong Un to attend China military parade",
    "description": "The so-called \"Victory Day\" parade will mark the 80th anniversary of China's war against Japan and the end of World War Two.  Russia's President Vladimir...",
    "link": "https://www.bbc.com/news/articles/c17njr88ge4o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-28T02:25:48Z"
  },
  {
    "title": "Showdown at CDC as director refuses to resign, amid pressure from HHS",
    "description": "\"When CDC Director Susan Monarez refused to rubber-stamp unscientific, reckless directives and fire dedicated health experts, she chose protecting the public over serving a political agenda. For that, she has been targeted,\" Zaid and Lowell said in the statem…",
    "link": "https://abc30.com/post/cdc-director-susan-monarez-is-less-month-job-other-agency-leaders-resign/17667183/",
    "timestamp": "2025-08-28T02:21:47Z"
  },
  {
    "title": "Illegal Crossings Are Down, So What Happens Now at the Border?",
    "description": "EL PASO, Texas—Interim Chief for the El Paso Sector Walter Slosar has served in the Border Patrol under six different presidential administrations. Today, the border... Read More\nThe post Illegal Crossings Are Down, So What Happens Now at the Border? appeared…",
    "link": "https://www.dailysignal.com/2025/08/27/illegal-crossings-are-down-so-what-happens-now-border/",
    "timestamp": "2025-08-28T02:19:37Z"
  },
  {
    "title": "The Right to Be Left Alone",
    "description": "What if the federal government captures in real time the contents of every telephone call, email and text message and all the fiber-optic data generated by every person and entity in the United States 24/7? What if this mass surveillance was never authorized …",
    "link": "https://www.activistpost.com/the-right-to-be-left-alone/",
    "timestamp": "2025-08-28T02:09:00Z"
  },
  {
    "title": "The Democratic Party’s Identity Crisis",
    "description": "On The Political Scene Podcast: Donald Trump’s unpopularity hasn’t translated into strength among the Democratic Party. Why are key blocs of voters drifting away?",
    "link": "https://www.newyorker.com/podcast/political-scene/the-democratic-partys-identity-crisis",
    "timestamp": "2025-08-28T02:05:30Z"
  },
  {
    "title": "Hungary Slams Ukraine’s EU Ambitions: 'Coup de Grace for Europe' – Reports",
    "description": "BUDAPEST (Sputnik) - Hungary will never support Ukraine's accelerated accession to the EU, Hungarian Foreign Minister Peter Szijjarto said amid media reports that Washington has allegedly convinced Budapest to change its position on Ukraine's European integra…",
    "link": "https://sputnikglobe.com/20250828/hungary-slams-ukraines-eu-ambitions-coup-de-grace-for-europe--reports-1122679505.html",
    "timestamp": "2025-08-28T02:02:54Z"
  },
  {
    "title": "RFK Jr. Says He Can Diagnose Kids With Health Issues Just By Looking at Them: ‘You Can Tell From Their Faces’",
    "description": "Secretary of Health Robert F. Kennedy Jr. claimed he could diagnose children with health issues just by looking at their faces and body movements.\nThe post RFK Jr. Says He Can Diagnose Kids With Health Issues Just By Looking at Them: ‘You Can Tell From Their …",
    "link": "https://www.mediaite.com/politics/rfk-jr-says-he-can-diagnose-kids-with-health-issues-just-by-looking-at-them-you-can-tell-from-their-faces/",
    "timestamp": "2025-08-28T02:00:26Z"
  },
  {
    "title": "Russian missiles pound Ukraine, damage EU and British offices",
    "description": "KYIV (Reuters) -Russia pounded Ukraine with deadly missiles and drone strikes early on Thursday in a sweeping attack that President Volodymyr Zelenskiy said ...",
    "link": "https://uk.news.yahoo.com/one-dead-mass-night-time-015951361.html",
    "timestamp": "2025-08-28T01:59:51Z"
  },
  {
    "title": "Trump salutes Sgt. Michael Verardo, wounded Afghanistan veteran who inspired Independence Fund’s trackchairs",
    "description": "Retired Sgt. Michael Verardo, gravely wounded in Afghanistan, died at 36 as President Trump honored his sacrifice and legacy inspiring veterans’ Track Chair program.",
    "link": "https://www.foxnews.com/us/trump-salutes-sgt-michael-verardo-wounded-afghanistan-veteran-inspired-independence-funds-trackchairs",
    "timestamp": "2025-08-28T01:58:18Z"
  },
  {
    "title": "Asia markets waver, Nvidia drops after earnings beat",
    "description": "SINGAPORE (Reuters) -Asian stocks wobbled on Thursday as blowout earnings from artificial intelligence bellwether Nvidia were offset by worries over the...",
    "link": "https://finance.yahoo.com/news/asia-markets-waver-nvidia-drops-015710793.html",
    "timestamp": "2025-08-28T01:57:10Z"
  },
  {
    "title": "US Futures, Nvidia Drop After Chipmaker's Outlook: Markets Wrap",
    "description": "US equity-index futures fell and Nvidia Corp. retreated in extended hours after the chipmaker’s sales outlook missed lofty expectations, weighing on sentiment around the world’s most valuable listed company.",
    "link": "https://www.ndtvprofit.com/markets/global-stock-market-news-august-28-dow-jones-nikkei-hang-sang-s-and-p-500-nasdaq",
    "timestamp": "2025-08-28T01:56:14Z"
  },
  {
    "title": "Chip giant Nvidia’s sales rise 56% in boost for AI boom",
    "description": "US chipmaker reports revenue of $46.74bn for second quarter, defying fears that AI may be overhyped.",
    "link": "https://www.aljazeera.com/economy/2025/8/28/chip-giant-nvidias-sales-rise-56-in-boost-for-ai-boom",
    "timestamp": "2025-08-28T01:55:07Z"
  },
  {
    "title": "CNBC Daily Open: Are investors missing the Nvidia forest for the AI tree?",
    "description": "The astronomical growth that this company saw in 2023 and 2024 will inevitably slow, but that does not mean that the company is falling on bad times.",
    "link": "https://www.cnbc.com/2025/08/28/cnbc-daily-open-are-investors-missing-the-nvidia-forest-for-the-ai-tree-.html",
    "timestamp": "2025-08-28T01:54:14Z"
  },
  {
    "title": "Gavin Newsom: 'I don't think Donald Trump wants another election' - Politico",
    "description": "Gavin Newsom: 'I don't think Donald Trump wants another election'Politico Newsom is right: Democrats must win the gerrymandering arms raceThe Hill ‘No-holds-barred fight’: California’s governor takes off his gloves to punch back at TrumpThe Guardian Transcrip…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178900512",
    "timestamp": "2025-08-28T01:52:59Z"
  },
  {
    "title": "Trump Stamps 'Dictator Chic' On Washington",
    "description": "From a gold-plated White House to a grandiose revamp for the capital Washington, Donald Trump is trying to leave an architectural mark like no American president has attempted for decades.",
    "link": "https://www.ibtimes.com.au/trump-stamps-dictator-chic-washington-1860271",
    "timestamp": "2025-08-28T01:51:06Z"
  },
  {
    "title": "Trump Stamps 'Dictator Chic' On Washington",
    "description": "From a gold-plated White House to a grandiose revamp for the capital Washington, Donald Trump is trying to leave an architectural mark like no American president has attempted for decades.",
    "link": "https://www.ibtimes.com/trump-stamps-dictator-chic-washington-3781812",
    "timestamp": "2025-08-28T01:51:06Z"
  },
  {
    "title": "‘Why Adopt The Policy Of The Losers?’ Steve Moore Says Copying Europe’s Industrial Policy Is ‘A Terrible Idea’",
    "description": "Steve Moore warned on Fox Business Wednesday that adopting national industrial policy would saddle the United States.",
    "link": "https://dailycaller.com/2025/08/27/steve-moore-europe-industrial-policy-terrible-idea/",
    "timestamp": "2025-08-28T01:50:23Z"
  },
  {
    "title": "India can get 25% off its tariffs if New Delhi stops buying Russian oil, says Trump's trade adviser Peter Navarro",
    "description": "White House trade adviser Peter Navarro has branded the Ukraine conflict “Modi’s war,” claiming India’s discounted oil purchases from Russia bankroll Moscow’s invasion and raise costs for American taxpayers. His remarks came as US tariffs on Indian goods doub…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-can-get-25-off-its-tariffs-if-new-delhi-stops-buying-russian-oil-says-white-house-trade-adviser-peter-navarro/articleshow/123553716.cms",
    "timestamp": "2025-08-28T01:48:39Z"
  },
  {
    "title": "For Trump DOJ, DEI Is The New Jim Crow. Businesses Should Take Note.",
    "description": "The Civil Rights Division of the DOJ is actively prosecuting DEI as racial discrimination based recent SCOTUS opinions. The legal risk of DEI in business is increasing",
    "link": "https://www.forbes.com/sites/jonmcgowan/2025/08/27/for-trump-doj-dei-is-the-new-jim-crow-businesses-should-take-note/",
    "timestamp": "2025-08-28T01:47:43Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,281",
    "description": "Here are the key events on day 1,281 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/8/28/russia-ukraine-war-list-of-key-events-day-1281",
    "timestamp": "2025-08-28T01:45:02Z"
  },
  {
    "title": "Trump’s tariffs, a wake-up call",
    "description": "A trade deal is just the first step. India’s regulatory structures need an upgrade",
    "link": "https://indianexpress.com/article/opinion/columns/trumps-tariff-wake-up-call-10215285/",
    "timestamp": "2025-08-28T01:43:54Z"
  },
  {
    "title": "Australia’s small business shipments are caught in the US-China trade war crossfire",
    "description": "The battle over parcel shipments is a microcosm of the larger strategic competition between the US and China.",
    "link": "https://theconversation.com/australias-small-business-shipments-are-caught-in-the-us-china-trade-war-crossfire-263943",
    "timestamp": "2025-08-28T01:37:40Z"
  },
  {
    "title": "AI giant Nvidia beats earnings expectations but shares fall",
    "description": "AI powerhouse Nvidia reported quarterly earnings Wednesday that beat expectations, but shares slipped amid concerns about an AI chip spending bubble and the company's stalled business in China. - Fortune in play - The earnings report comes amid market worries…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ai-giant-nvidia-beats-earnings-expectations-but-shares-fall/articleshow/123553789.cms",
    "timestamp": "2025-08-28T01:36:49Z"
  },
  {
    "title": "Trump’s tariffs are a violation – and a lesson for India",
    "description": "US tariffs violate its commitments under WTO. India must diversify its exports, markets for them",
    "link": "https://indianexpress.com/article/opinion/columns/trumps-tariffs-violation-lesson-india-10215256/",
    "timestamp": "2025-08-28T01:36:36Z"
  },
  {
    "title": "Breaking down rumor Trump only has 6 to 8 months to live",
    "description": "A TikTok user pointed to several “worsening\" symptoms and claimed they were signs that Trump had congestive heart failure and chronic kidney disease.",
    "link": "https://www.snopes.com//news/2025/08/28/trump-6-to-8-months-to-live/",
    "timestamp": "2025-08-28T01:30:00Z"
  },
  {
    "title": "Breaking down rumor Trump only has 6 to 8 months to live",
    "description": "A TikTok user pointed to several “worsening\" symptoms and claimed they were signs that Trump had congestive heart failure and chronic kidney disease.",
    "link": "https://www.snopes.com/news/2025/08/28/trump-6-to-8-months-to-live/",
    "timestamp": "2025-08-28T01:30:00Z"
  },
  {
    "title": "Conservatives Seize On Minneapolis Shooting To Push Anti-Trans Messages",
    "description": "The statements come as Republicans have advanced a torrent of policies undermining trans rights.",
    "link": "https://www.huffpost.com/entry/minneapolis-shooting-annunciation-catholic-church_n_68afa38ee4b0d087ed3e8a29",
    "timestamp": "2025-08-28T01:28:39Z"
  },
  {
    "title": "US Health Department Moves To Oust CDC Director After Vaccine Confrontation",
    "description": "The Trump Administration moved to oust US Centers for Disease Control and Prevention Director Susan Monarez just weeks into her tenure, and several senior leaders have resigned, as disputes with Health and Human Services Secretary Robert F. Kennedy Jr. over v…",
    "link": "https://www.ndtvprofit.com/world/hhs-moves-to-oust-cdc-director-after-vaccine-confrontation",
    "timestamp": "2025-08-28T01:21:12Z"
  },
  {
    "title": "HP cites strong demand for AI PCs as it beats expectations on revenue, but investors aren’t impressed",
    "description": "HP Inc.’s stock was trading lower in extended trading, after initially rising in the wake of its third quarter financial results. The company surpassed analyst’s expectations on earnings and revenue and said it’s seeing solid demand for its new generation of …",
    "link": "https://siliconangle.com/2025/08/27/hp-cites-strong-demand-ai-pcs-beats-expectations-revenue-investors-arent-impressed/",
    "timestamp": "2025-08-28T01:18:39Z"
  },
  {
    "title": "Republicans 'puzzled' by Trump's sudden push for major crime bill: 'In the dark'",
    "description": "When Congress comes back to Washington, D.C., after the Labor Day holiday, President Donald Trump is hoping they'll take up a \"comprehensive\" new bill focused on addressing crime. But some Republicans aren't sure what he's talking about.That's according to a …",
    "link": "https://www.rawstory.com/trump-crimes-2673936194/",
    "timestamp": "2025-08-28T01:16:29Z"
  }
]