[
  {
    "title": "‘Probably came to US illegally’: Who is Ilhan Omar, US representative targeted by Trump amid immigration crackdown?",
    "description": "Omar was born in Somalia and fled the country’s civil war at age eight, spending four years in a Kenyan refugee camp before arriving in the US in 1995.",
    "link": "https://indianexpress.com/article/world/who-is-ilhan-omar-us-representative-whom-trump-attacked-amid-immigration-crackdown-10391790/",
    "timestamp": "2025-11-28T16:41:35Z"
  },
  {
    "title": "Alabama Senator Tommy Tuberville Wants a Ban on All Islamic Immigrants",
    "description": "Sen. Tommy Tuberville wants to deport potentially dangerous “Islamists” following the shooting of 2 National Guard members in Washington this week.\nThe post Alabama Senator Tommy Tuberville Wants a Ban on All Islamic Immigrants appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/11/28/alabama-senator-tommy-tuberville-wants-ban-all-islamic-immigrants/",
    "timestamp": "2025-11-28T16:41:08Z"
  },
  {
    "title": "Trump: U.S. May 'Almost Completely' Scrap Income Tax Due to Tariff Revenue",
    "description": "President Donald Trump late Thursday said that the United States may \"almost completely\" eliminate the income tax due to the rising tariff revenue.\nThe post Trump: U.S. May ‘Almost Completely’ Scrap Income Tax Due to Tariff Revenue appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/28/trump-u-s-may-almost-completely-scrap-income-tax-due-to-tariff-revenue/",
    "timestamp": "2025-11-28T16:40:57Z"
  },
  {
    "title": "Could Trump run for a third term?",
    "description": "Donald Trump has repeatedly flirted with the idea that he could run for a third term in 2028. “There are methods which you could do it,” the president said in an interview with NBC News earlier in the year. He declined to elaborate further, but last month, du…",
    "link": "https://biztoc.com/x/11b656d9e53e6a18",
    "timestamp": "2025-11-28T16:35:51Z"
  },
  {
    "title": "Trump Admin To Re-Examine Green Card Holders From 'Countries Of Concern'",
    "description": "The Trump administration has said it will conduct a “rigorous” re-examination of all Green Cards issued to immigrants from “every country of concern” in the wake of the shooting of two National Guard service members by an Afghan national.",
    "link": "https://www.ndtvprofit.com/world/trump-admin-to-re-examine-green-card-holders-from-countries-of-concern",
    "timestamp": "2025-11-28T16:35:19Z"
  },
  {
    "title": "Trump Vows to End Third World Migration After Fatal National Guard Shooting",
    "description": "DAILY CALLER NEWS FOUNDATION—President Donald Trump announced late Thursday his administration will “permanently pause” migration from all “Third World Countries,” after two National Guardsmen were... Read More\nThe post Trump Vows to End Third World Migration…",
    "link": "https://www.dailysignal.com/2025/11/28/trump-vows-to-end-third-world-migration-after-fatal-national-guard-shooting/",
    "timestamp": "2025-11-28T16:33:33Z"
  },
  {
    "title": "‘Give Me A F***ing Break’: Donald Trump Jr Slams the WSJ Over Op-Ed Defending Afghan Immigrants",
    "description": "Donald Trump Jr. had strong words for the editorial board at The Wall Street Journal on Friday after the paper published an op-ed defending Afghan refugees.\nThe post ‘Give Me A F***ing Break’: Donald Trump Jr Slams the WSJ Over Op-Ed Defending Afghan Immigran…",
    "link": "https://www.mediaite.com/media/news/give-me-a-fing-break-donald-trump-jr-slams-the-wsj-over-op-ed-defending-afghan-immigrants/",
    "timestamp": "2025-11-28T16:33:23Z"
  },
  {
    "title": "If The President Says It, Then It Is News",
    "description": "I would accept that more if news outlets published his more obviously batshit stuff without qualification or attempt to explain, along with the more plausible-sounding stuff.PALM BEACH, Florida, Nov 27 (Reuters) - U.S. President Donald Trump said on Thursday …",
    "link": "https://www.eschatonblog.com/2025/11/if-president-says-it-then-it-is-news.html",
    "timestamp": "2025-11-28T16:30:00Z"
  },
  {
    "title": "Suspect in Washington, DC, shooting charged with murder after soldier dies",
    "description": "US attorney files new charge against Rahmanullah Lakanwal after National Guard member Sarah Beckstrom dies from wounds.",
    "link": "https://www.aljazeera.com/news/2025/11/28/suspect-in-washington-dc-shooting-charged-with-murder-after-soldier-dies",
    "timestamp": "2025-11-28T16:29:56Z"
  },
  {
    "title": "European leaders scoff at Orbán’s latest Putin love-in",
    "description": "EU leaders say they don't expect the Hungarian prime minister's trip to Moscow to bring peace to Ukraine.",
    "link": "https://www.politico.eu/article/european-leaders-scoff-hungary-orban-latest-russia-putin-love-in/",
    "timestamp": "2025-11-28T16:25:03Z"
  },
  {
    "title": "India growth beats all estimates as factories defy Trump tariffs",
    "description": "India’s economy grew at the fastest pace in six quarters, underscoring its resilience even as US President Donald Trump’s steep tariffs cloud the outlook.\nGross domestic product rose 8.2% in the three months through September from a year earlier, the Statisti…",
    "link": "https://biztoc.com/x/e5d72c3450737e55",
    "timestamp": "2025-11-28T16:24:28Z"
  },
  {
    "title": "Maduro brandishes sword at rally as he rails against 'imperialist aggression' amid rising tensions with US",
    "description": "Nicolas Maduro brandishes sword at rally, warning of 'imperialist aggression' as President Donald Trump discusses potential for land attacks against narco-terrorists.",
    "link": "https://www.foxnews.com/world/maduro-brandishes-sword-rally-he-rails-against-imperialist-aggression-amid-rising-tensions-us",
    "timestamp": "2025-11-28T16:24:25Z"
  },
  {
    "title": "Trump’s Second Term Dispels Any Notion of CEOs Saving Us From Climate Crisis",
    "description": "Corporate actors have shed any pretense of climate action and now openly back Trump’s doubling down on fossil fuels.",
    "link": "https://truthout.org/articles/trumps-second-term-dispels-any-notion-of-ceos-saving-us-from-climate-crisis/",
    "timestamp": "2025-11-28T16:23:31Z"
  },
  {
    "title": "Has ‘The View’ Been Canceled?",
    "description": "The ladies of The View are enjoying their Thanksgiving break.",
    "link": "https://decider.com/2025/11/28/the-view-canceled-2/",
    "timestamp": "2025-11-28T16:20:07Z"
  },
  {
    "title": "Could Trump run for a third term?",
    "description": "Constitutional amendment limits US presidents to two terms, but Trump diehards claim there is a loophole",
    "link": "https://theweek.com/politics/could-trump-run-for-a-third-term",
    "timestamp": "2025-11-28T16:16:13Z"
  },
  {
    "title": "Donald Trump Keeps Insulting Female Reporters",
    "description": "“Are you a stupid person?” “quiet, piggy” and “terrible reporter” are all words that President Donald Trump has directed toward female journalists in recent weeks, in instances that have raised questions over the treatment of women in the field.\nDr. Amy Tatum…",
    "link": "https://biztoc.com/x/4dc91ac651e96280",
    "timestamp": "2025-11-28T16:13:34Z"
  },
  {
    "title": "Melania Trump Launches Production Company Muse Films",
    "description": "Her new documentary, Melania, opens in theaters on January 30th, 2026.\nMelania Trump Launches Production Company Muse Films\nScoop Harrison",
    "link": "https://consequence.net/2025/11/melania-trump-production-company-muse-films/",
    "timestamp": "2025-11-28T16:12:45Z"
  },
  {
    "title": "'Squad' member mourns 'empty' Thanksgiving seats due to 'loved ones abducted & deported,' 'mass incarceration'",
    "description": "Democratic Rep. Ayanna Pressley indicated on Thanksgiving that some dinner tables would have an empty chair due to people being \"abducted & deported from their families.\"",
    "link": "https://www.foxnews.com/politics/squad-member-mourns-empty-thanksgiving-seats-due-loved-ones-abducted-deported-mass-incarceration",
    "timestamp": "2025-11-28T16:09:43Z"
  },
  {
    "title": "Trump to End All Migration from Third World Countries, Reverse Biden’s Autopen Admissions",
    "description": "President Donald Trump has unveiled plans to permanently halt migration from Third World nations and roll back millions of Biden‑era admissions — including those he blasted as illegally authorized through ‘Sleepy Joe’s Autopen.’\nThe post Trump to End All Migr…",
    "link": "https://www.breitbart.com/border/2025/11/28/trump-to-end-all-migration-from-third-world-countries-reverse-bidens-autopen-admissions/",
    "timestamp": "2025-11-28T16:09:32Z"
  },
  {
    "title": "'Shameful': Experts condemn Stephen Miller's xenophobic hysterics after DC shooting",
    "description": "White House adviser Stephen Miller faced backlash from experts after he responded to the shooting of two National Guard members in Washington, D.C. by suggesting that immigrants could never assimilate into American culture.After an Afghan national was named a…",
    "link": "https://www.rawstory.com/stephen-miller-nationa-guard-shooting/",
    "timestamp": "2025-11-28T16:09:12Z"
  },
  {
    "title": "India growth beats all estimates as factories defy Trump tariffs",
    "description": "India's Prime Minister Narendra Modi called the GDP number \"very encouraging.\"",
    "link": "https://fortune.com/2025/11/28/india-gdp-growth-beats-all-estimates-manufacturing-trump-tariffs/",
    "timestamp": "2025-11-28T16:07:04Z"
  },
  {
    "title": "Jeanine Pirro Bristles At Criticism Of Trump's National Guard Deployment After Fatal Shooting",
    "description": "The U.S. attorney for the District of Columbia announced the suspect in a National Guard member's death would be charged with first-degree murder.",
    "link": "https://www.huffpost.com/entry/jeanine-pirro-reject-criticism-of-trump-troop-deployment_n_6929b1ade4b0bf7d7e2c6b10",
    "timestamp": "2025-11-28T16:06:24Z"
  },
  {
    "title": "Trump's Wild Tantrum: The Don, 79, Uses Shocking Slur in Late-Night Anti-Immigration Rant... as Dementia Concerns Surround The Prez",
    "description": "Donald Trump slammed Tim Walz with a shocking slur in a late-night Thanksgiving rant.",
    "link": "https://radaronline.com/p/donald-trump-thanksgiving-anti-immigration-rant-slur/",
    "timestamp": "2025-11-28T16:04:02Z"
  },
  {
    "title": "‘It Will Leave People Furious’: Marjorie Taylor Greene Issues Warning to Trump About His New Immigration Policy",
    "description": "Rep. Marjorie Taylor Greene issued a warning to President Donald Trump about his announcement of an immigration pause “from all Third World Countries.” \nThe post ‘It Will Leave People Furious’: Marjorie Taylor Greene Issues Warning to Trump About His New Immi…",
    "link": "https://www.mediaite.com/media/news/it-will-leave-people-furious-marjorie-taylor-greene-issues-warning-to-trump-about-his-new-immigration-policy/",
    "timestamp": "2025-11-28T16:03:47Z"
  },
  {
    "title": "'Tensions': Conservative says these two top Trump officials are headed for 'public clash'",
    "description": "The U.S. editor of British conservative weekly The Spectator says that Vice President JD Vance and Secretary of State Marco Rubio may be headed for a very public clash in the wake of the \"imbroglio of the Ukraine peace deal.\"President Donald Trump's administr…",
    "link": "https://www.rawstory.com/alternet-posts/trump-2674353546/",
    "timestamp": "2025-11-28T16:00:19Z"
  },
  {
    "title": "Lane Kiffin rumors explained: Is he leaving for another job after this Egg Bowl?",
    "description": "Is today Lane Kiffin’s final Egg Bowl? Looking at the case for Florida, LSU, and Ole Miss plus predictions",
    "link": "https://www.sbnation.com/college-football/1092132/lane-kiffin-rumors-explained-egg-bowl",
    "timestamp": "2025-11-28T16:00:00Z"
  },
  {
    "title": "Fani Willis’ Case Against Trump Is Officially Over",
    "description": "DAILY CALLER NEWS FOUNDATION—Fulton County District Attorney Fani Willis’ case against President Donald Trump has officially come to an end. Judge Scott McAfee agreed to dismiss the racketeering case... Read More\nThe post Fani Willis’ Case Against Trump Is Of…",
    "link": "https://www.dailysignal.com/2025/11/28/fani-willis-case-against-trump-is-officially-over/",
    "timestamp": "2025-11-28T16:00:00Z"
  },
  {
    "title": "Letters: I was only 12 but I remember the Erebus disaster",
    "description": "OPINION: Readers have written in with their memories of the Air NZ Antarctic crash.",
    "link": "https://www.nzherald.co.nz/nz/letters-i-was-only-12-but-i-remember-the-erebus-disaster/premium/BVLIDV2XY5HLFIWL3OEZQ7GP6E/",
    "timestamp": "2025-11-28T16:00:00Z"
  },
  {
    "title": "Tim Walz Fires Back at Trump’s Thanksgiving Immigration Screed: ‘Release the MRI Results’",
    "description": "The president lashed out at the Minnesota governor with a slur in a holiday rant about America getting “carved up, murdered, beaten, mugged and laughed at”\nThe post Tim Walz Fires Back at Trump’s Thanksgiving Immigration Screed: ‘Release the MRI Results’ appe…",
    "link": "https://www.thewrap.com/trump-tim-walz-thanksgiving-ilhan-omar-response/",
    "timestamp": "2025-11-28T15:57:11Z"
  },
  {
    "title": "Trump Argues For Putin Appeasement For Peace",
    "description": "Trump continues to negotiate with Ukraine for Vladimir Putin in the press, claiming if Russia stops murdering Ukrainians and doesn't take over any more land that's a concession.\nTrump takes his MAGA supporters as dupes, but not the rest of us. \n\nREPORTER: Wha…",
    "link": "https://crooksandliars.com/2025/11/trump-says-russian-concessions-peace-deal",
    "timestamp": "2025-11-28T15:56:12Z"
  },
  {
    "title": "He Couldn't Even Pretend To Be A President On Thanksgiving",
    "description": "Narcissists ruin holidays and special events because the attention isn't on them. Every single time. Donald J. Trump checks all the points of being a malignant narcissist, and he keeps confirming that, as he did in his late-night Thanksgiving message that's l…",
    "link": "https://crooksandliars.com/2025/11/he-couldnt-even-pretend-be-president",
    "timestamp": "2025-11-28T15:56:12Z"
  },
  {
    "title": "Ghislaine Maxwell Trumps Trump On Pardon",
    "description": "Ghislaine Maxwell has Trump right where she wants him. If she doesn't get a pardon, she will take the Fifth if called to testify to Congress, and will not certify under oath, she didn't witness Trump having sex with underage girls. \nTrump's critics can then a…",
    "link": "https://crooksandliars.com/2025/11/ghislaine-maxwell-trumps-trump-pardon",
    "timestamp": "2025-11-28T15:56:12Z"
  },
  {
    "title": "Blow to Zelenskiy as chief of staff resigns amid corruption investigation",
    "description": "Development may further weaken Zelenskiy at a pivotal moment for Ukraine",
    "link": "https://www.irishtimes.com/world/europe/2025/11/28/blow-to-zelenskiy-as-chief-of-staff-resigns-amid-corruption-probe/",
    "timestamp": "2025-11-28T15:56:04Z"
  },
  {
    "title": "After airstrikes, Donald Trump says US land action against Venezuelan drug networks coming ‘soon’",
    "description": "The comments come as the administration continues weighing military action against Venezuela under what it calls counter-narcotics operations.",
    "link": "https://indianexpress.com/article/world/after-airstrikes-donald-trump-says-us-land-action-against-venezuelan-drug-networks-coming-soon-10391834/",
    "timestamp": "2025-11-28T15:55:47Z"
  },
  {
    "title": "Can Dutch universities do without Microsoft?",
    "description": "Can Dutch higher education part ways with Microsoft? The sector is trying to break free, and alternatives are being explored here and there. At the same time, more and more tasks are being completed by Microsoft tools.",
    "link": "https://dub.uu.nl/en/news/can-dutch-universities-do-without-microsoft",
    "timestamp": "2025-11-28T15:53:39Z"
  },
  {
    "title": "Ukraine is running out of men, money and time",
    "description": "Survival now depends on rebuilding the country’s political and military foundations.",
    "link": "https://www.aljazeera.com/opinions/2025/11/28/ukraine-is-running-out-of-men-money-and-time",
    "timestamp": "2025-11-28T15:53:17Z"
  },
  {
    "title": "Trump Makes His Mar-a-Lago Neighbors’ Lives a Living Hell With His New Perk",
    "description": "Donald Trump’s neighbors are fuming over a new no-fly zone over the president’s Mar-a-Lago estate that has indefinitely re-routed noisy planes above their...",
    "link": "https://www.thedailybeast.com/trump-makes-his-mar-a-lago-neighbors-lives-a-living-hell-with-his-new-perk/",
    "timestamp": "2025-11-28T15:50:38Z"
  },
  {
    "title": "Tim Miller Pitches Wild Idea for Denaturalization Process: ‘Send a Signal That the While House Will Not Play Favorites’",
    "description": "The Bulwark’s Tim Miller suggested that the Trump administration should denaturalize First Lady Melania Trump on\nThe post Tim Miller Pitches Wild Idea for Denaturalization Process: ‘Send a Signal That the While House Will Not Play Favorites’ first appeared on…",
    "link": "https://www.mediaite.com/media/news/tim-miller-pitches-wild-idea-for-denaturalization-process-send-a-signal-that-the-while-house-will-not-play-favorites/",
    "timestamp": "2025-11-28T15:46:57Z"
  },
  {
    "title": "'We will ruin your lives': Analyst says Trump's floundering MAGA regime 'wreaking havoc'",
    "description": "An analyst Friday said that President Donald Trump's floundering MAGA regime and \"cast of characters\" is \"wreaking havoc\" on Americans' lives.Salon's Brian Karem described how Trump has spent more time on the golf course than caring about the declining econom…",
    "link": "https://www.rawstory.com/we-will-ruin-your-lives-analyst-says-trump-s-floundering-maga-regime-wreaking-havoc/",
    "timestamp": "2025-11-28T15:45:45Z"
  },
  {
    "title": "U.S. Citizenship and Immigration Services to 'Reexamine' Every Green Card from Countries of Concern",
    "description": "There will be a \"rigorous reexamination\" of every Green Card for every alien hailing from countries of concern, U.S. Citizenship and Immigration Services (USCIS) Director Joseph Edlow announced.\nThe post U.S. Citizenship and Immigration Services to ‘Reexamine…",
    "link": "https://www.breitbart.com/politics/2025/11/28/u-s-citizenship-and-immigration-services-to-reexamine-every-green-card-from-countries-of-concern/",
    "timestamp": "2025-11-28T15:44:25Z"
  },
  {
    "title": "U.S. retailers are about to see if shoppers are willing to spend on Black Friday",
    "description": "The annual sales event still brings more shoppers into stores than any day of the year and still rules as the U.S. retail industry's unofficial start of the holiday shopping season.",
    "link": "https://www.pbs.org/newshour/economy/u-s-retailers-are-about-to-see-if-shoppers-are-willing-to-spend-on-black-friday",
    "timestamp": "2025-11-28T15:40:13Z"
  },
  {
    "title": "Trump demands ‘reverse migration’ in push for sweeping crackdown",
    "description": "President \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n called for “\n \n \n \n \n \n \n \n \n \n reverse migration\n \n \n \n \n \n \n \n \n \n ” in the United States as he outlined a further \n \n \n \n \n \n \n \n \n \n crackdown on immigration\n \n \n \n \n \n \n \n \n \n following the sh…",
    "link": "https://biztoc.com/x/792ae65a3caa2d35",
    "timestamp": "2025-11-28T15:39:53Z"
  },
  {
    "title": "Kyrsten Sinema's New Job Ensures She'll Remain the Most Annoying Person in the Room",
    "description": "Barf Bag: The former Senator is a psychedelics lobbyist now, and has jetted to Mexico and Aspen to talk up hallucinogenic ibogaine.",
    "link": "https://www.jezebel.com/kyrsten-sinemas-new-job-ensures-shell-remain-the-most-annoying-person-in-the-room",
    "timestamp": "2025-11-28T15:38:19Z"
  },
  {
    "title": "Doctor Lays Out ‘Concerning’ Case About Trump’s Health, From ‘Incoherent’ Rambling to ‘He’s Confused a Lot’",
    "description": "A doctor has outlined several points of concern about President Trump's cognitive decline, days after an eye-opening report in the New York Times about the commander in chief's health.\nThe post Doctor Lays Out ‘Concerning’ Case About Trump’s Health, From ‘Inc…",
    "link": "https://www.mediaite.com/media/podcasts/doctor-lays-out-concerning-case-about-trumps-health-from-incoherent-rambling-to-hes-confused-a-lot/",
    "timestamp": "2025-11-28T15:37:48Z"
  },
  {
    "title": "Trump Says Military Will Stop Alleged Venezuelan Drug Smugglers By Land ‘Very Soon’",
    "description": "President Donald Trump suggested the military will expand its campaign against alleged Venezuelan drug traffickers “very soon,” during remarks to U.S. service members on Thursday. Though the military’s anti-drug trafficking strikes have been limited to the Ca…",
    "link": "https://dailycaller.com/2025/11/28/trump-venezuela-drug-smugglers-land/",
    "timestamp": "2025-11-28T15:32:42Z"
  },
  {
    "title": "Melania Trump unveils new movie coming in January and next business venture",
    "description": "Melania Trump announced Friday that she had created her own production company, Muse Films, ahead of the release by Amazon of a documentary on the first lady.",
    "link": "https://nypost.com/2025/11/28/us-news/melania-trump-unveils-new-movie-coming-in-january-and-next-business-venture/",
    "timestamp": "2025-11-28T15:31:28Z"
  },
  {
    "title": "Trump says he wants to ‘permanently pause’ migration to the U.S. from poorer countries",
    "description": "President Donald Trump’s threat to stop immigration would be a serious blow to a nation that has long defined itself as welcoming immigrants.",
    "link": "https://biztoc.com/x/e1730fd45bea5004",
    "timestamp": "2025-11-28T15:28:44Z"
  },
  {
    "title": "Suspect in shooting of National Guard members now facing a first-degree murder charge",
    "description": "Jeanine Pirro announced upgraded charges against a man accused of shooting two National Guard members.",
    "link": "https://www.bostonherald.com/2025/11/28/national-guard-shooting-suspect-charge/",
    "timestamp": "2025-11-28T15:26:49Z"
  },
  {
    "title": "Suspect in shooting of National Guard members now facing a first-degree murder charge",
    "description": "Jeanine Pirro announced upgraded charges against a man accused of shooting two National Guard members.",
    "link": "https://www.denverpost.com/2025/11/28/national-guard-shooting-suspect-charge/",
    "timestamp": "2025-11-28T15:26:49Z"
  },
  {
    "title": "Trump says he wants to ‘permanently pause’ migration to the U.S. from poorer countries",
    "description": "President Donald Trump’s threat to stop immigration would be a serious blow to a nation that has long defined itself as welcoming immigrants.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-he-wants-to-permanently-pause-migration-to-the-u-s-from-poorer-countries",
    "timestamp": "2025-11-28T15:25:58Z"
  },
  {
    "title": "Russia Receiving Proposals Being Agreed On in Discussion of US Plan for Ukraine - Kremlin",
    "description": "MOSCOW (Sputnik) - Russia is receiving the proposals that are being agreed upon as part of the discussion of the US settlement plan for Ukraine, Kremlin spokesman Dmitry Peskov said on Friday.",
    "link": "https://sputnikglobe.com/20251128/russia-receiving-proposals-being-agreed-on-in-discussion-of-us-plan-for-ukraine---kremlin-1123195344.html",
    "timestamp": "2025-11-28T15:25:19Z"
  },
  {
    "title": "Bitcoin, Ether, Solana, XRP treasury shares slide amid crypto market turmoil - key takeaways for traders",
    "description": "Bitcoin BTC USD treasury shares: Companies holding digital assets like Bitcoin are facing pressure as the crypto market experiences volatility. Recent price drops have caused their shares to trade below the value of the digital assets they possess. This trend…",
    "link": "https://economictimes.indiatimes.com/news/international/us/bitcoin-ether-solana-xrp-treasury-shares-slide-amid-crypto-market-turmoil-key-takeaways-for-traders/articleshow/125640939.cms",
    "timestamp": "2025-11-28T15:24:17Z"
  },
  {
    "title": "National Guard shooting suspect has charges upgraded as second victim fights for life – Live",
    "description": "Rahmanullah Lakanwal facing further charges after Sarah Beckstrom, 20, died from ‘mortal wound’ sustained in Wednesday’s attack. Fellow Guard Andrew Wolfe, 24, is still in a criticial condition in hospital",
    "link": "https://www.the-independent.com/news/world/americas/crime/dc-national-guard-shot-latest-updates-b2874461.html",
    "timestamp": "2025-11-28T15:21:46Z"
  },
  {
    "title": "Trump demands ‘reverse migration’ in push for sweeping crackdown",
    "description": "President Donald Trump called for “reverse migration” in the U.S. as he outlined a further crackdown on immigration. Read more here",
    "link": "https://financialpost.com/news/economy/trump-demands-reverse-migration",
    "timestamp": "2025-11-28T15:21:46Z"
  },
  {
    "title": "Rick Reilly says Donald Trump hasn’t won any of the 38 “legitimate” club championships he touted on a Thanksgiving troop call.",
    "description": "A golf author has mocked President Donald Trump’s latest claim that he’s won 38 golf titles, saying he hasn’t actually won any and likening him to a toddler ...",
    "link": "https://www.thedailybeast.com/golf-author-rick-reilly-takes-a-swing-at-toddler-donald-trumps-new-brag/",
    "timestamp": "2025-11-28T15:21:43Z"
  },
  {
    "title": "RSF military push for Kordofan leaves Sudan at risk of partition",
    "description": "RSF already has control of western Sudan in war with Sudan's army, leaving country facing potential split.",
    "link": "https://www.aljazeera.com/features/2025/11/28/rsf-military-push-for-kordofan-leaves-sudan-at-risk-of-partition",
    "timestamp": "2025-11-28T15:21:38Z"
  },
  {
    "title": "We've seen this movie before — what happens next is never good",
    "description": "Earlier this week, the number one most-read story in the Financial Times was headlined, “Nvidia shares fall on signs Google gaining upper hand in AI.” It turns out that Google’s AI software/product is doing about as well as its competitors but isn’t using Nvi…",
    "link": "https://www.rawstory.com/raw-investigates/we-ve-seen-this-movie-before-and-what-happens-next-isn-t-good/",
    "timestamp": "2025-11-28T15:21:29Z"
  },
  {
    "title": "UFC 324 announced as first live event on Paramount+ for January 2026",
    "description": "UFC 324, the first Ultimate Fighting Championship card on Paramount+, is set for Jan. 24.",
    "link": "https://www.usatoday.com/story/sports/ufc/2025/11/28/ufc-324-announcement-paramount-plus-january-2026/87506854007/",
    "timestamp": "2025-11-28T15:19:38Z"
  },
  {
    "title": "With the penny going away, what should you do with the ones in your coin jar?",
    "description": "Are your old pennies worth millions? Experts say you shouldn't bank on it.",
    "link": "https://www.usatoday.com/story/money/2025/11/28/with-the-penny-going-away-how-to-know-if-you-have-one-thats-valuable/87506467007/",
    "timestamp": "2025-11-28T15:15:49Z"
  },
  {
    "title": "Trump Vows To End Third World Migration After Deadly National Guard Shooting",
    "description": "Trump announced he will “permanently pause” migration from all “Third World Countries,” following the murder of a National Guardsman by an Afghan nationa.",
    "link": "https://dailycaller.com/2025/11/28/trump-vows-to-end-third-world-migration-after-deadly-national-guard-shooting/",
    "timestamp": "2025-11-28T15:15:12Z"
  },
  {
    "title": "Nifty's Record High, Q2 GDP Boost, Trump Vows Migration Pause, And More",
    "description": "The week ending November 28 was characterised by a mix of domestic economic triumphs and global policy shifts. On the domestic front, the benchmark Nifty 50 index finally shattered a 14-month ceiling, hitting a fresh all-time high. Compounding the positive se…",
    "link": "https://www.ndtvprofit.com/markets/niftys-record-high-q2-gdp-boost-trump-vows-migration-pause-and-more-the-week-that-was",
    "timestamp": "2025-11-28T15:14:13Z"
  },
  {
    "title": "DC National Guard shooting suspect to be charged with first-degree murder, Pirro says",
    "description": "Jeanine Pirro announced the suspect's charges would be upgraded to first-degree murder following the death of one of the guardsmen.",
    "link": "https://abcnews.go.com/US/charges-dc-national-guard-shooting-suspect-upgraded-murder/story?id=127943482",
    "timestamp": "2025-11-28T15:13:04Z"
  },
  {
    "title": "'What he's done breaks my heart': Trump injects 'instability and fear' into holiday season",
    "description": "Americans are anxious about spending for the holiday season as prices rise for everyday items and specialty goods in the first year of President Donald Trump's second term in office.The Guardian spoke to readers across the U.S. who said higher costs for neces…",
    "link": "https://www.rawstory.com/donald-trump-holiday-shopping-heart/",
    "timestamp": "2025-11-28T15:06:45Z"
  },
  {
    "title": "Trump says he wants to ‘permanently pause migration’ from poor countries: ‘Only reverse migration can fully cure this situation’",
    "description": "WEST PALM BEACH, Fla. (AP) — President Donald Trump says he wants to “permanently pause migration” from poorer nations and is promising to seek to expel millions of immigrants from the United States by revoking their legal status. He is blaming immigrants for…",
    "link": "https://biztoc.com/x/267435b15340175f",
    "timestamp": "2025-11-28T15:06:32Z"
  },
  {
    "title": "Trump says he'll 'permanently pause' migration from some countries after DC shooting",
    "description": "In a post on his social media platform late Thursday, President Donald Trump said he will \"permanently pause migration\" from some countries following the D.C. shooting.",
    "link": "https://abcnews.go.com/Politics/trump-permanently-pause-migration-countries-after-national-guard/story?id=127942078",
    "timestamp": "2025-11-28T15:01:47Z"
  },
  {
    "title": "This Is The Most Inappropriate Joke On ‘South Park’ So Far This Year",
    "description": "By\n Keegan Kelly\n Published: November 28th, 2025",
    "link": "https://www.cracked.com/article_49238_this-is-the-most-inappropriate-joke-on-south-park-so-far-this-year.html",
    "timestamp": "2025-11-28T15:01:00Z"
  },
  {
    "title": "Report: DC National Guard Shooting Suspect Had No Beds in Home, Often Played Call of Duty",
    "description": "There were no beds in the home of the the Washington, DC, National Guard shooting suspect, whom often played video games such as Call of Duty, according to recent reports.\nThe post Report: DC National Guard Shooting Suspect Had No Beds in Home, Often Played C…",
    "link": "https://www.breitbart.com/politics/2025/11/28/report-dc-national-guard-shooting-suspect-had-no-beds-in-home-often-played-call-of-duty/",
    "timestamp": "2025-11-28T15:00:54Z"
  },
  {
    "title": "Trump Promises to ‘Permanently Pause Migration From All Third World Countries’",
    "description": "\"This refugee burden is the leading cause of social dysfunction in America, something that did not exist after World War II (Failed schools, high crime, urban decay, overcrowded hospitals, housing shortages, and large deficits, etc.).\"\nThe post Trump Promises…",
    "link": "https://legalinsurrection.com/2025/11/trump-promises-to-permanently-pause-migration-from-all-third-world-countries/",
    "timestamp": "2025-11-28T15:00:44Z"
  },
  {
    "title": "Trump 'is set to recognise Russian control over Crimea and other occupied Ukrainian territories in bid to secure deal with Putin to end war'",
    "description": "In an interview with The Atlantic, Andriy Yermak, President Zelensky's chief of staff, who helped negotiate the updated proposal, reiterated that position: 'Not a single sane person today would sign a document to give up territory. 'As long as Zelensky is pre…",
    "link": "https://freerepublic.com/focus/f-news/4354977/posts",
    "timestamp": "2025-11-28T15:00:07Z"
  },
  {
    "title": "Trump says he wants to ‘permanently pause migration’ from poor countries: ‘Only reverse migration can fully cure this situation’",
    "description": "Donald Trump spent part of his Thanksgiving holiday railing against immigrants on social media.",
    "link": "https://fortune.com/2025/11/28/trump-permanently-pause-migration-from-poor-countries-thanksgiving-message/",
    "timestamp": "2025-11-28T14:58:58Z"
  },
  {
    "title": "Danish Government Sets Up ‘Night Watch’ to Monitor Trump",
    "description": "Officials within the Danish government have set up a special “night watch” within its foreign ministry purely dedicated to monitoring President Donald Trump.\nThe post Danish Government Sets Up ‘Night Watch’ to Monitor Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/danish-government-sets-up-night-watch-to-monitor-trump/",
    "timestamp": "2025-11-28T14:55:13Z"
  },
  {
    "title": "IRS releases guidance for Trump's 'no tax on tips' and overtime deductions: What to know",
    "description": "The IRS released its guidance for the \"no tax on tips\" and \"no tax on overtime\" provisions of the One Big Beautiful Bill Act (OBBBA), for workers who can claim the deductions for the 2025 tax year.\nPresident Donald Trump signed the OBBBA into law in July afte…",
    "link": "https://biztoc.com/x/63b192df790d60f3",
    "timestamp": "2025-11-28T14:55:07Z"
  },
  {
    "title": "How Trump made his Justice Department a tool for retribution (Vox)",
    "description": "Vox:\nHow Trump made his Justice Department a tool for retribution  —  Thousands of DOJ attorneys have left since Trump took office.  Here's where that leaves the department. … President Donald Trump has been trying to use the Department of Justice as his pers…",
    "link": "https://www.memeorandum.com/251128/p20",
    "timestamp": "2025-11-28T14:55:00Z"
  },
  {
    "title": "Black Friday faces its ultimate test as desperate retailers and low consumer confidence collide in a high-stakes holiday standoff",
    "description": "\"Consumers feel on edge,\" says Mastercard chief economist Michelle Meyer.",
    "link": "https://fortune.com/2025/11/28/black-friday-ultimate-test-desperate-retailers-low-consumer-confidence-collide/",
    "timestamp": "2025-11-28T14:54:04Z"
  },
  {
    "title": "Miss Universe owners in Mexico, Thailand hit with fraud, trafficking claims",
    "description": "The Miss Universe beauty pageant was hit by fresh scandal days after it ended, with the owners accused of trafficking and fraud. Read here",
    "link": "https://financialpost.com/news/miss-universe-owners-fraud-trafficking-claims",
    "timestamp": "2025-11-28T14:53:42Z"
  },
  {
    "title": "‘His Best Tweet of All Time’: MAGA Celebrates Trump’s ‘Seriously Retarded’ Immigration Pause Post",
    "description": "MAGA is rallying around President Donald Trump's barnburner of a post announcing an immigration pause \"from all Third World Countries.\"\nThe post ‘His Best Tweet of All Time’: MAGA Celebrates Trump’s ‘Seriously Retarded’ Immigration Pause Post first appeared o…",
    "link": "https://www.mediaite.com/media/news/his-best-tweet-of-all-time-maga-celebrates-trumps-seriously-retarded-immigration-pause-post/",
    "timestamp": "2025-11-28T14:53:33Z"
  },
  {
    "title": "Donald Trump, 79, Turns National Guard Death News Into Selfish Rant - The Daily Beast",
    "description": "Donald Trump, 79, Turns National Guard Death News Into Selfish RantThe Daily Beast Father of fallen National Guard member calls her death a 'horrible tragedy' in heartbreaking postFox News Pres. Trump Calls Service Members on ThanskgivingC-SPAN Trump in Palm …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180231431",
    "timestamp": "2025-11-28T14:53:19Z"
  },
  {
    "title": "Trump Calls CBS News Correspondent ‘Stupid Person’ in 4th Attack on Female Reporters in 2 Weeks",
    "description": "President Donald Trump attacked yet another female reporter on Thursday after she asked him about the vetting of the suspect in a Washington, D.C., shooting that killed a National Guardsman, calling her a “stupid person” for citing U.S. officials.",
    "link": "https://www.thewrap.com/trump-attack-cbs-news-nancy-cordes-female-journalist/",
    "timestamp": "2025-11-28T14:48:51Z"
  },
  {
    "title": "'Like a feral child': Trump biographer spills about president's odd junk food choices",
    "description": "A food tester in the White House is purportedly unnecessary for Donald Trump, with his own political biographer believing the president's diet doesn't require one. Michael Wolff suggested the president's love for fast food means precautions on his prepared me…",
    "link": "https://www.rawstory.com/donald-trump-diet-wolff/",
    "timestamp": "2025-11-28T14:48:29Z"
  },
  {
    "title": "Despicable: Al Sharpton Blames Trump for National Guard Murder Perpetrated By Biden Immigrant",
    "description": "During a segment on “Deadline: White House,” Sharpton said that the guardsmen were placed “in harm’s way” because of Trump’s policies.",
    "link": "https://www.westernjournal.com/despicable-al-sharpton-blames-trump-national-guard-murder-perpetrated-biden-immigrant/",
    "timestamp": "2025-11-28T14:42:40Z"
  },
  {
    "title": "Jeanine Pirro Slams Left for ‘Fueling Division’ Over National Guard Deployment: ‘It Outrages Me!’",
    "description": "Pirro explained that she’d upgraded the charges against the suspected shooter who killed a National Guard member to first-degree murder.\nThe post Jeanine Pirro Slams Left for ‘Fueling Division’ Over National Guard Deployment: ‘It Outrages Me!’ first appeared …",
    "link": "https://www.mediaite.com/media/tv/jeanine-pirro-slams-left-for-fueling-division-over-national-guard-deployment-it-outrages-me/",
    "timestamp": "2025-11-28T14:41:03Z"
  },
  {
    "title": "Trump says Biden 'doesn’t want to show up' to golf match, takes jab at former president's game",
    "description": "President Donald Trump continued to poke fun at former President Joe Biden’s golf game during a Thanksgiving call with military members. One of the petty officers on the call with Trump at the White House asked the 47th president what his \"true golf handicap\"…",
    "link": "https://freerepublic.com/focus/f-chat/4354975/posts",
    "timestamp": "2025-11-28T14:40:39Z"
  },
  {
    "title": "Students in 11 professional fields could borrow up to $200,000 under new federal loan rules",
    "description": "The Trump administration plans to introduce new federal student loan limits from July 2026, capping graduate borrowing at $20,500 annually and professional programmes at $50,000 per year. Graduate PLUS loans will be eliminated. While officials aim to curb deb…",
    "link": "https://timesofindia.indiatimes.com/education/news/students-in-11-professional-fields-could-borrow-up-to-200000-under-new-federal-loan-rules/articleshow/125640402.cms",
    "timestamp": "2025-11-28T14:37:10Z"
  },
  {
    "title": "Trump calls reporter a ‘stupid person’ during tense exchange about National Guardsmen murder suspect",
    "description": "President Donald Trump clashed with a CBS reporter over vetting of Afghan refugees after a D.C. shooting that killed National Guard member Sarah Beckstrom.",
    "link": "https://www.foxnews.com/media/trump-calls-reporter-stupid-person-during-tense-exchange-national-guardsmen-murder-suspect",
    "timestamp": "2025-11-28T14:36:44Z"
  },
  {
    "title": "Trump announces sweeping immigration shutdown",
    "description": "President Donald Trump declared Thursday night that he will permanently pause migration to the United States from all third world countries, claiming the move would allow the American system to fully recover from policies that eroded gains and living conditio…",
    "link": "https://rollingout.com/2025/11/28/trump-sweeping-immigration-shutdown/",
    "timestamp": "2025-11-28T14:32:29Z"
  },
  {
    "title": "Trump: Suspend 'Third World' Migration After Troop Dies",
    "description": "President Donald Trump said on Thursday he would suspend migration from what he called \"third world countries,\" a day after an Afghan national allegedly shot two National Guard soldiers in Washington, killing one. Trump said earlier that Sarah Beckstrom, a 20…",
    "link": "https://freerepublic.com/focus/f-bloggers/4354973/posts",
    "timestamp": "2025-11-28T14:28:25Z"
  },
  {
    "title": "Ukraine Desperately Seeks New Sources of Military Aid as Losses Rise and Support Drops",
    "description": "Faced with serious losses on the front and dwindling support from traditional Western allies, Ukraine is intensively searching for new sources of military assistance to maintain the combat capability of its forces and continue war operations. However, sources…",
    "link": "https://www.globalresearch.ca/ukraine-desperately-seeks-new-sources-military-aid/5907210",
    "timestamp": "2025-11-28T14:24:32Z"
  },
  {
    "title": "Childhood Friend of Accused National Guard Shooter Says Suspect Suffered From Mental Health Issues After Work in Afghanistan",
    "description": "A childhood friend of Rahmanullah Lakanwal, the man suspected of shooting two National Guard troops — one fatally — in Washington, D.C., on Wednesday, said the Afghan national struggled with his mental health and was disturbed by his previous work in the mili…",
    "link": "https://www.mediaite.com/media/news/childhood-friend-of-accused-national-guard-shooter-says-suspect-suffered-from-mental-health-issues-after-work-in-afghanistan/",
    "timestamp": "2025-11-28T14:23:02Z"
  },
  {
    "title": "Ukraine anticorruption investigators search home of Zelenskyy’s top aide",
    "description": "Ukrainian president's chief of staff Andriy Yermak confirms search, saying he has offered 'full cooperation'.",
    "link": "https://www.aljazeera.com/news/2025/11/28/ukraine-anticorruption-investigators-search-home-of-zelenskyys-top-aide",
    "timestamp": "2025-11-28T14:20:40Z"
  },
  {
    "title": "Trump Promises a Common Sense End to Third World Migration to U.S. After National Guard Shooting",
    "description": "\"Even as we have progressed technologically, Immigration Policy has eroded those gains and living conditions for many,\" Trump said.",
    "link": "https://www.westernjournal.com/trump-promises-end-third-world-migration-national-guard-shooting/",
    "timestamp": "2025-11-28T14:20:03Z"
  },
  {
    "title": "Hungary's Orban defies EU partners and meets Putin again in Moscow",
    "description": "Russia's leader praised what he called Orban's \"balanced position on the situation in Ukraine\".",
    "link": "https://www.bbc.com/news/articles/c058lny3pdqo",
    "timestamp": "2025-11-28T14:16:51Z"
  },
  {
    "title": "The Fall of Zelensky's Regime and Those of His Allies, by Thierry Meyssan",
    "description": "The US-Russian peace plan for Ukraine certainly puts an end to a conflict. But, above all, it paves the way for a rewriting of history. No, the Russian military operation was not an \"illegal, unprovoked, and unjustified military aggression,\" but rather an app…",
    "link": "https://www.voltairenet.org/article223267.html",
    "timestamp": "2025-11-28T14:16:10Z"
  }
]