[
  {
    "title": "'Wait wait wait': Fox News shocks experts with medical report on 'elderly' Trump's bruises",
    "description": "Fox News shocked political observers on Saturday with a report in which the conservative network noted \"elderly\" Donald Trump's apparent hand bruising.Conservative commentator Elisha Krauss over the weekend addressed the prominent bruising, saying on Fox, \"Th…",
    "link": "https://www.rawstory.com/trump-fox-news-bruising-hands/",
    "timestamp": "2025-12-13T20:37:37Z"
  },
  {
    "title": "Trump Recounts Story Involving Wife of Congressman Who Was Shot, Says 'I Know Many Wives Who Would Not Even Be Crying'",
    "description": "Last week at the White House Congressional Ball, President Donald Trump brought up the 2017 shooting incident involving then-House Majority Leader Steve Scalise, lauding his bravery and the emotional fortitude of his wife, Jennifer Scalise.\nWhat Happened: Tru…",
    "link": "https://biztoc.com/x/070e11aa26ab9191",
    "timestamp": "2025-12-13T20:37:21Z"
  },
  {
    "title": "Trump’s DOJ Wants to Charge Alleged Kirk Killer With Bizarre Crime",
    "description": "President Donald Trump’s Department of Justice is trying to come up with a way to charge Charlie Kirk’s alleged shooter with a federal crime. One surprising solution? Declare Kirk’s murder an anti-Christian hate crime.Tyler Robinson, the suspect, is already f…",
    "link": "https://newrepublic.com/post/204381/trump-doj-charlie-kirk-robinson-hate-crime",
    "timestamp": "2025-12-13T20:33:18Z"
  },
  {
    "title": "Tom Homan Begs Democratic Politicians to ‘Please Stop’ Demonizing ICE Agents: ‘I Don’t Wanna Bury Anybody Else’",
    "description": "White House Border Czar Tom Homan is \"begging\" Democratic politicians to stop criticizing ICE and Border Patrol agents, saying their job is already hard enough\nThe post Tom Homan Begs Democratic Politicians to ‘Please Stop’ Demonizing ICE Agents: ‘I Don’t Wan…",
    "link": "https://www.mediaite.com/politics/trump/tom-homan-begs-democratic-politicians-to-please-stop-demonizing-ice-agents-i-dont-wanna-bury-anybody-else/",
    "timestamp": "2025-12-13T20:32:52Z"
  },
  {
    "title": "Donald Trump Promises 'Serious Retaliation' In Response To ISIS Attack Killing Three Americans In Syria",
    "description": "President Donald Trump vowed “very serious retaliation” In the wake of an ISIS attack in Syria that claimed the lives of two U.S. military personnel and one American civilian.\nWhat Happened: The assault, attributed to the Islamic State group by the U.S., occu…",
    "link": "https://biztoc.com/x/9bb2d97cc1ab58d5",
    "timestamp": "2025-12-13T20:26:24Z"
  },
  {
    "title": "Trump again threatens to primary Indiana Republicans who spurned his redistricting push",
    "description": "President Donald Trump once again threatened to bring electoral repercussions for Indiana Senate Republicans who rejected his push for gerrymandered district maps.\n“Republicans in the Indiana State Senate, who voted against a Majority in the U.S. House of Rep…",
    "link": "https://biztoc.com/x/60260a6679f5a8fc",
    "timestamp": "2025-12-13T20:26:23Z"
  },
  {
    "title": "Trump returns to Army-Navy showdown as Syria ambush kills 2 US soldiers, interpreter",
    "description": "President Donald Trump returned to the Army-Navy game in Baltimore as the rivals compete for the Commander-in-Chief’s Trophy once again.",
    "link": "https://www.foxnews.com/sports/trump-returns-army-navy-showdown",
    "timestamp": "2025-12-13T20:02:27Z"
  },
  {
    "title": "Trump vows 'very serious retaliation' against ISIS after deadly Syria ambush kills US soldiers",
    "description": "President Donald Trump vows 'very serious retaliation' after ISIS gunman kills two U.S. Army soldiers and interpreter in Syria ambush, leaving three other soldiers wounded.",
    "link": "https://www.foxnews.com/politics/trump-vows-very-serious-retaliation-against-isis-after-deadly-syria-ambush-kills-us-soldiers",
    "timestamp": "2025-12-13T20:01:18Z"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-13-12-25-6903059-Dec2025/",
    "timestamp": "2025-12-13T20:00:31Z"
  },
  {
    "title": "Rep. Al Green of Texas Loses in His Latest Attempt to Impeach Trump",
    "description": "\"Twenty-three Democrats joined Republicans in pushing the impeachment aside.\"\nThe post Rep. Al Green of Texas Loses in His Latest Attempt to Impeach Trump first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/12/rep-al-green-of-texas-loses-in-his-latest-attempt-to-impeach-trump/",
    "timestamp": "2025-12-13T20:00:09Z"
  },
  {
    "title": "Corporate-Bond Investors Party as Hangover Looms: Credit Weekly",
    "description": "US high-grade spreads touched 0.76 percentage point earlier this week, their tightest levels since October and close to their highest valuation in decades.  ...",
    "link": "https://finance.yahoo.com/news/corporate-bond-investors-party-hangover-200000112.html",
    "timestamp": "2025-12-13T20:00:00Z"
  },
  {
    "title": "Don’t go wobbly on China, Mr. President",
    "description": "'Beijing's posture and actions are consistent with those aimed at an adversary in a long, grinding cold war'",
    "link": "https://www.wnd.com/2025/12/dont-go-wobbly-china-mr-president/",
    "timestamp": "2025-12-13T19:55:37Z"
  },
  {
    "title": "‘You’re Seeing the Sausage Being Made’ Cheryl Hines and Pete Hegseth’s Wife Dish to Fox News About Being Married to Trump Cabinet Members",
    "description": "Cheryl Hines and 7 other wives of Trump cabinet members dished to Fox News about what their first year has been like\nThe post ‘You’re Seeing the Sausage Being Made’ Cheryl Hines and Pete Hegseth’s Wife Dish to Fox News About Being Married to Trump Cabinet Mem…",
    "link": "https://www.mediaite.com/media/youre-seeing-the-sausage-being-made-cheryl-hines-and-pete-hegseths-wife-dish-to-fox-news-about-being-married-to-trump-cabinet-members/",
    "timestamp": "2025-12-13T19:53:19Z"
  },
  {
    "title": "Israel Ordered Assassination of Hamas Leader in Gaza Strike, Netanyahu Says",
    "description": "The strike presents another speed bump for the fragile peace deal between Israel and Hamas brokered by President Donald Trump.",
    "link": "https://biztoc.com/x/ca2239953ea07405",
    "timestamp": "2025-12-13T19:53:14Z"
  },
  {
    "title": "Frozen Russian Assets And The Moment Of Truth For The World Order",
    "description": "The use of frozen Russian assets for security for Europe to help fund Ukraine's defence in the war has been achieved by an EU decision. Now what?",
    "link": "https://www.forbes.com/sites/andyjsemotiuk/2025/12/13/frozen-russian-assets-and-the-moment-of-truth-for-the-world-order/",
    "timestamp": "2025-12-13T19:50:41Z"
  },
  {
    "title": "The Day After: Trump Advisors and Venezuela Opposition Leaders Plan for Maduro’s Departure",
    "description": "In the 1980s, the U.S. negotiated the exile of world leaders like Haiti’s Jean-Claude \"Baby Doc\" Duvalier to France and Ferdinand Marcos from the Philippines to Hawaii.Now, President Donald Trump wants Venezuelan President Nicolas Maduro out of power. Maduro’…",
    "link": "https://freerepublic.com/focus/f-news/4357244/posts",
    "timestamp": "2025-12-13T19:43:51Z"
  },
  {
    "title": "Trump Says 'We Will Retaliate' After Americans Killed, Wounded in Syria",
    "description": "This is a developing story… Please check back for updates… Despite publicly seeking a Nobel Peace Prize, President Donald Trump on Saturday told reporters that \"we will retaliate\" after US Central Command announced that a solo Islamic State gunman killed thre…",
    "link": "https://www.commondreams.org/news/americans-in-syria",
    "timestamp": "2025-12-13T19:43:26Z"
  },
  {
    "title": "M23 marches on in east DR Congo as US vows action against Rwanda",
    "description": "The M23 pressed onwards in the eastern Democratic Republic of Congo on Saturday, even as Washington vowed action over its Rwandan backers’ violation of a US-brokered peace deal. Top US diplomat Marco Rubio said Saturday that Rwanda had clearly breached the ag…",
    "link": "https://www.digitaljournal.com/world/m23-marches-on-in-east-dr-congo-as-us-vows-action-against-rwanda/article",
    "timestamp": "2025-12-13T19:43:24Z"
  },
  {
    "title": "‘He’ll be lucky to have a bookmobile’: Biden presidential library fundraising is a dribble",
    "description": "Foundation told the IRS it anticipates taking in only $11.3 million by the end of 2027",
    "link": "https://www.wnd.com/2025/12/hell-be-lucky-have-bookmobile-biden-presidential-library/",
    "timestamp": "2025-12-13T19:40:29Z"
  },
  {
    "title": "Exclusive — Jason Miller Details 'Massive Accomplishments' of President Donald Trump",
    "description": "President Donald Trump has secured \"massive accomplishments\" over the course of the year, Jason Miller, senior advisor to the president, said during an appearance on Breitbart News Daily.\nThe post Exclusive — Jason Miller Details ‘Massive Accomplishments’ of …",
    "link": "https://www.breitbart.com/radio/2025/12/13/exclusive-jason-miller-details-massive-accomplishments-of-president-donald-trump/",
    "timestamp": "2025-12-13T19:37:05Z"
  },
  {
    "title": "President Trump responds to ‘terrible’ ambush that killed 3 US troops in Syria: ‘We will retaliate’",
    "description": "President Trump vowed to respond Saturday after an attack on US and coalition forces killed three US service members in Palmyra, Syria.",
    "link": "https://nypost.com/2025/12/13/us-news/president-trump-responds-to-terrible-ambush-that-killed-3-us-troops-in-syria-we-will-retaliate/",
    "timestamp": "2025-12-13T19:32:58Z"
  },
  {
    "title": "Los Angeles Mayor Karen Bass officially launches reelection campaign",
    "description": "The Democrat is facing challenges from at least three candidates, including former LAUSD Superintendent Austin Beutner.",
    "link": "https://www.cbsnews.com/losangeles/news/los-angeles-mayor-karen-bass-reelection-campaign/",
    "timestamp": "2025-12-13T19:32:27Z"
  },
  {
    "title": "Like Washington state communities, Seahawks preparing for wet weather",
    "description": "We at Seahawks Wire aim to help you look forward to Sunday’s game, but our hearts are with every community affected by the state's floods this week.",
    "link": "https://seahawkswire.usatoday.com/story/sports/nfl/seahawks/2025/12/13/macdonald-shouts-out-seahawks-grounds-crew-amidst-extreme-rain/87748264007/",
    "timestamp": "2025-12-13T19:30:38Z"
  },
  {
    "title": "Two US soldiers and an interpreter killed in suspected Islamic State attack in Syria",
    "description": "Donald Trump warns of ‘very serious retaliation’",
    "link": "https://www.irishtimes.com/world/middle-east/2025/12/13/two-us-soldiers-and-an-interpreter-killed-in-suspected-islamic-state-attack-in-syria/",
    "timestamp": "2025-12-13T19:29:26Z"
  },
  {
    "title": "Jared Kushner is backing a 'hostile takeover' of US infrastructure: analysis",
    "description": "Salon reporter Sophia Tesfaye says “the speed and scale of Jared Kushner’s re-emergence can’t be overstated,” and neither can his corruption.“In the first year of Donald Trump’s second presidency, his son-in-law is casually consolidating economic and politica…",
    "link": "https://www.rawstory.com/alternet-posts/jared-kushner-saudis/",
    "timestamp": "2025-12-13T19:21:16Z"
  },
  {
    "title": "Thailand Fact-Checks Trump on Bogus Ceasefire Claim",
    "description": "It’s not the first time, and it won’t be the last—President Donald Trump was a little too eager to claim he had ended an international conflict.On Friday, the U.S. president said that the countries of Thailand and Cambodia, which have been involved in clashes…",
    "link": "https://newrepublic.com/post/204380/thailand-fact-checks-trump-bogus-ceasefire-claim",
    "timestamp": "2025-12-13T19:21:13Z"
  },
  {
    "title": "Greene Says Trump's Refusal To Acknowledge Economic Woes Could Cost GOP House Majority",
    "description": "Rep. Marjorie Taylor Greene (R-Ga.) has issued a warning to President Donald Trump following their public disagreement.\nWhat Happened: Greene voiced her concerns about the potential negative impact of Trump’s attacks on her, stemming from their differing view…",
    "link": "https://biztoc.com/x/1d5993ddabcfa193",
    "timestamp": "2025-12-13T19:19:49Z"
  },
  {
    "title": "Trump Lashes Out in First Statement on ISIS Killing of Two American Soldiers in Syria: ‘Serious Retaliation!’",
    "description": "President Donald Trump lashed out on Truth Social over news of the death of three Americans in a \"lone ISIS attack\" on Saturday.\nThe post Trump Lashes Out in First Statement on ISIS Killing of Two American Soldiers in Syria: ‘Serious Retaliation!’ first appea…",
    "link": "https://www.mediaite.com/media/news/trump-lashes-out-in-first-statement-on-isis-killing-of-two-american-soldiers-in-syria-serious-retaliation/",
    "timestamp": "2025-12-13T19:19:35Z"
  },
  {
    "title": "MAGA fans demand Trump address rising costs as 'the biggest thing'",
    "description": "The top priorities of MAGA adherents attending President Donald Trump’s Pennsylvania rally were roughly in tune with those of the rest of American voters: Inflation.Conservative media company Right Side Broadcasting Network, known for their live stream covera…",
    "link": "https://www.rawstory.com/alternet-posts/trump-inflation-maga-rift/",
    "timestamp": "2025-12-13T19:18:25Z"
  },
  {
    "title": "People Really Think JD Vance Will Leave Usha Vance for Erika Kirk",
    "description": "One man on social media shared his evidence for why he thinks JD Vance will leave his wife for Erika Kirk before 2028.",
    "link": "https://cafemom.com/entertainment/jd-vance-rmor-leave-usha-vance-for-erika-kirk",
    "timestamp": "2025-12-13T19:14:33Z"
  },
  {
    "title": "‘There will be serious retaliation!’ Trump issues grave threat after attack in Syria",
    "description": "President Donald Trump issued a grave threat that there will be “serious retaliation” following the killing of two U.S. soldiers and one American civilian in Syria on Saturday, and the injury of several more.“We mourn the loss of three Great American Patriots…",
    "link": "https://www.rawstory.com/trump-2674397542/",
    "timestamp": "2025-12-13T19:09:58Z"
  },
  {
    "title": "Biden Legacy Imperiled As Presidential Library Project Reportedly Plagued By Anemic Fundraising",
    "description": "Efforts to enshrine former President Biden's time in office with a library have been imperiled by lackluster fundraising, according to The New York Times.",
    "link": "https://dailycaller.com/2025/12/13/joe-biden-legacy-imperiled-presidential-library-fundraising/",
    "timestamp": "2025-12-13T19:08:01Z"
  },
  {
    "title": "CNN’s Jake Tapper Finally Calls BS on White House Over Trump’s Health",
    "description": "Jake Tapper said the White House is “not telling us” the truth about Trump after a frazzled Karoline Leavitt finally responded to the Daily Beast’s queries.",
    "link": "https://www.thedailybeast.com/cnns-jake-tapper-finally-calls-bs-on-white-house-over-trumps-health/",
    "timestamp": "2025-12-13T19:07:42Z"
  },
  {
    "title": "The nuclear fuel and sub deal Trump struck with South Korea",
    "description": "President wants Seoul to invest in facilities in the United States",
    "link": "https://www.wnd.com/2025/12/nuclear-fuel-sub-deal-trump-struck-south-korea/",
    "timestamp": "2025-12-13T19:05:41Z"
  },
  {
    "title": "A Mighty Wind: Judge Blows Down Trump's Dumb Executive Order Against Wind Energy",
    "description": "Gone with the breeze, it is.",
    "link": "https://www.wonkette.com/p/a-mighty-wind-judge-blows-down-trumps",
    "timestamp": "2025-12-13T19:01:17Z"
  },
  {
    "title": "Opinion: Banning under-16s from social media is a half-measure. We should ban toxic algorithms",
    "description": "Australia is trying to ban teens from social media, but that only scratches the surface as a solution to the problems tech companies are causing us, writes Killian Mangan.",
    "link": "https://www.thejournal.ie/readme/opinion-social-media-ban-australia-go-further-recommender-systems-algorithm-6901718-Dec2025/",
    "timestamp": "2025-12-13T19:00:42Z"
  },
  {
    "title": "Scott Jennings Explodes Over Newly Released Epstein Photos: ‘They Want It To Be About Trump’",
    "description": "“This is not a story about Trump and Epstein. This is a story about Epstein, but they want it to be about Trump,\" Jennings said about Democrats.",
    "link": "https://www.huffpost.com/entry/scott-jennings-cnn-trump-epstein-photos-democrats_n_693da4f0e4b07bcd2545961e",
    "timestamp": "2025-12-13T19:00:24Z"
  },
  {
    "title": "California Man Always Buys Annual Pass To National Parks. Then They Make A Change This Year That Makes Him Reconsider: ‘I’d Pay More To NOT Have That Version’",
    "description": "This year, some changes have been made to the United States’ National Parks pass. For context, the “America the Beautiful” pass is a card that allows one to visit the many lands owned by the U.S. government. This includes entrance fees and standard day-use fe…",
    "link": "https://brobible.com/culture/article/national-parks-new-pass/",
    "timestamp": "2025-12-13T19:00:14Z"
  },
  {
    "title": "Trump says US 'will retaliate' after three Americans killed in Syrian 'Islamic State attack'",
    "description": "Donald Trump has said the US \"will retaliate\" after three Americans were killed in a suspected Islamic State attack in Syria.",
    "link": "https://news.sky.com/story/trump-says-us-will-retaliate-after-three-americans-killed-in-syrian-islamic-state-attack-13483086",
    "timestamp": "2025-12-13T19:00:00Z"
  },
  {
    "title": "17 Trump Truth Social posts we've debunked",
    "description": "Social media users often make up posts to satirize the president's real posts and views.",
    "link": "https://www.snopes.com/collections/fake-trump-posts-collection/",
    "timestamp": "2025-12-13T19:00:00Z"
  },
  {
    "title": "US engaging in ‘extreme rightwing tropes’ reminiscent of 1930s, British MPs warn",
    "description": "The US is engaging in “extreme rightwing tropes” with echoes of the 1930s and threatening “chilling” interference in European democracies, British MPs warned ministers on Thursday. The House of Commons rounded on Donald Trump’s national security strategy, whi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4357237/posts",
    "timestamp": "2025-12-13T18:58:55Z"
  },
  {
    "title": "Trump Fans On Freezing Line Gush Before Rally: ‘He Took a Bullet For Us!’",
    "description": "Trump fans standing in a freezing line gushed about President Donald Trump hours before a rally, one emotionally declaring \"He took a bullet for us!\"\nThe post Trump Fans On Freezing Line Gush Before Rally: ‘He Took a Bullet For Us!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-fans-on-freezing-line-gush-before-rally-he-took-a-bullet-for-us/",
    "timestamp": "2025-12-13T18:58:47Z"
  },
  {
    "title": "Why Rescheduling Cannabis Is a Very Bad Idea",
    "description": "As of Friday, President Donald Trump is considering signing an executive order which would reclassify cannabis (marijuana) from Schedule I of the Controlled Substances Act... Read More\nThe post Why Rescheduling Cannabis Is a Very Bad Idea appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/12/13/why-rescheduling-cannabis-is-a-very-bad-idea/",
    "timestamp": "2025-12-13T18:49:43Z"
  },
  {
    "title": "Trump Worried Reports Of Venezuelan Oil Tanker Seizure Have Ruined The Surprise Of Melania’s Christmas Gift",
    "description": "WASHINGTON, D.C. — President Donald Trump expressed concern that his wife, Melania, may now be aware of what he got her for Christmas after news reports surfaced that the U.S. military had seized a Venezuelan oil tanker this week. When the story broke, Trump …",
    "link": "https://freerepublic.com/focus/f-chat/4357234/posts",
    "timestamp": "2025-12-13T18:49:29Z"
  },
  {
    "title": "Trump Brags About Being Called ‘Greatest President in History’ — By Famously Pro-Trump Author",
    "description": "President Donald Trump posted to Truth Social Saturday to humble-brag about kudos he received from a famously pro-Trump author.\nThe post Trump Brags About Being Called ‘Greatest President in History’ — By Famously Pro-Trump Author first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-brags-about-being-called-greatest-president-in-history-by-famously-pro-trump-author/",
    "timestamp": "2025-12-13T18:46:03Z"
  },
  {
    "title": "The humanitarian front against Israel",
    "description": "Mass murder has been branded as conscience to mess with people’s minds. Regarding UNRWA, a U.S. State Department official called it a “corrupt organization with a proven track record of aiding and abetting terrorists.” Not so the UK. Opinion.",
    "link": "https://www.israelnationalnews.com/news/419241",
    "timestamp": "2025-12-13T18:38:51Z"
  },
  {
    "title": "Netanyahu's corruption trial has became a struggle for Israel itself",
    "description": "Israeli Prime Minister Benjamin Netanyahu's backers view his corruption trial as a witch hunt — but his detractors argue it is the system finally catching up to a ruthless political operative who is prepared to do anything to hold on to power.",
    "link": "https://www.abc.net.au/news/2025-12-14/israel-pm-benjamin-netanyahu-corruption-trial-and-deep-state/106124242",
    "timestamp": "2025-12-13T18:37:53Z"
  },
  {
    "title": "This ship spent months in 'shadow', then US forces swooped in",
    "description": "Tensions between the US and Venezuela are soaring after American forces seized an oil tanker in the Caribbean Sea. So why is US President Donald Trump targeting so-called \"shadow fleets\"?",
    "link": "https://www.abc.net.au/news/2025-12-14/what-are-shadow-fleets/106137346",
    "timestamp": "2025-12-13T18:37:06Z"
  },
  {
    "title": "Jim Acosta Rips Media For Ignoring Trump Rally Rant: ‘That’s Naked Racism!’",
    "description": "Jim Acosta ripped the media's focus on President Donald Trump going \"off message\" at his rally instead of his \"nakedly racist\" rant about African nations.\nThe post Jim Acosta Rips Media For Ignoring Trump Rally Rant: ‘That’s Naked Racism!’ first appeared on M…",
    "link": "https://www.mediaite.com/media/news/jim-acosta-rips-media-for-ignoring-trump-rally-rant-thats-naked-racism/",
    "timestamp": "2025-12-13T18:36:19Z"
  },
  {
    "title": "Chicago radio host rips Cubs player for Turning Point event attendance, likens it to 'Nazi-adjacent pep rally'",
    "description": "Matt Shaw’s upcoming appearance at Turning Point USA’s America Fest sparked renewed criticism after his decision to attend Charlie Kirk’s funeral.",
    "link": "https://www.foxnews.com/sports/chicago-radio-host-rips-cubs-player-turning-point-event-attendance-nazi-adjacent-pep-rally",
    "timestamp": "2025-12-13T18:35:43Z"
  },
  {
    "title": "Appeals Court Rules President Trump Can Defund Planned Parenthood",
    "description": "A federal appeals court on Friday upheld a key provision of President Donald Trump’s signature domestic policy bill, allowing the administration to defund the Planned Parenthood abortion business. The One Big Beautiful Bill that Trump signed this summer withh…",
    "link": "https://freerepublic.com/focus/f-news/4357232/posts",
    "timestamp": "2025-12-13T18:30:00Z"
  },
  {
    "title": "Trump Claims 'High Household Bills' Problem Is a Hoax Amid Melania's $5k Velvet Blazer",
    "description": "Melania Trump's $5,000 Dolce & Gabbana suit at the Congressional Ball highlights the First Lady's luxury fashion disconnect from the US affordability crisis.",
    "link": "https://www.ibtimes.com/trump-claims-high-household-bills-problem-hoax-amid-melanias-5k-velvet-blazer-3792578",
    "timestamp": "2025-12-13T18:28:45Z"
  },
  {
    "title": "2 U.S. service members, 1 civilian killed in ambush in Syria, Central Command says",
    "description": "Two U.S. service members and one American civilian were killed and three other people wounded in an ambush on Saturday by a lone member of the Islamic State group in central Syria, the the U.S. military’s Central Command said.",
    "link": "https://www.pbs.org/newshour/world/2-u-s-service-members-1-civilian-killed-in-ambush-in-syria-central-command-says",
    "timestamp": "2025-12-13T18:25:15Z"
  },
  {
    "title": "'I Need You Right Now, Pedophiles': Trump Campaign Email Sent to Epstein After His Death, Records Claim",
    "description": "Donald Trump's 2020 campaign sent emails to Jeffrey Epstein's active account using an appalling salutation, deepening the shock of the pair's long, troubled association.",
    "link": "https://www.ibtimes.com/i-need-you-right-now-pedophiles-trump-campaign-email-sent-epstein-after-his-death-records-3792575",
    "timestamp": "2025-12-13T18:25:09Z"
  },
  {
    "title": "Two US troops killed in Syria, Trump vows 'retaliation'",
    "description": "US Central Command said two service members and a civilian were ambushed by a lone \"Islamic State\" gunman in central Syria. It is the first deadly incident involving US forces since Bashar Assad was ousted last year.",
    "link": "https://www.dw.com/en/two-us-troops-killed-in-syria-trump-vows-retaliation/a-75147344",
    "timestamp": "2025-12-13T18:24:00Z"
  },
  {
    "title": "2 dead in Russia following drone attack as millions in Ukraine lose power",
    "description": "Russia launched overnight drone and missile strikes on five Ukrainian regions.",
    "link": "https://nypost.com/2025/12/13/world-news/2-dead-in-russia-following-drone-attack-as-millions-in-ukraine-lose-power/",
    "timestamp": "2025-12-13T18:22:37Z"
  },
  {
    "title": "Is Trump Sundowning? Official Raises Eyebrows With Revelation of President's 4-Hour Sleep Routine",
    "description": "Trump's reported four-hour sleep routine and on-camera fatigue have reignited debates over his health and fitness for office, prompting official pushback and intense public scrutiny.",
    "link": "https://www.ibtimes.com/trump-sundowning-official-raises-eyebrows-revelation-presidents-4-hour-sleep-routine-3792567",
    "timestamp": "2025-12-13T18:21:37Z"
  },
  {
    "title": "Trump Obsesses Over Young Press Secretary Karoline Leavitt's 'Machine Gun Lips' at Rally, Critics Call It 'Creepy'",
    "description": "Trump sparked online backlash after repeatedly praising White House press secretary Karoline Leavitt's lips, calling them 'like a little machine gun' during rallies and press events.",
    "link": "https://www.ibtimes.com/trump-obsesses-over-young-press-secretary-karoline-leavitts-machine-gun-lips-rally-critics-3792563",
    "timestamp": "2025-12-13T18:21:02Z"
  },
  {
    "title": "'Remarkable': Plurality of Republicans now believe Trump had knowledge of Epstein's crimes",
    "description": "As President Donald Trump continues to be plagued by his past ties with Jeffrey Epstein, a new poll has found that a plurality of Republican voters now believe that Trump was aware of the disgraced financier’s crimes before they were made public, CNN reported…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2674397498/",
    "timestamp": "2025-12-13T18:19:13Z"
  },
  {
    "title": "Human rights: Congressional panel urges action on ‘transnational repression’ by Beijing",
    "description": "Theme of annual report: 'China breaks its promises, Americans pay the price'",
    "link": "https://www.wnd.com/2025/12/human-rights-congressional-panel-urges-action-transnational-repression/",
    "timestamp": "2025-12-13T18:17:54Z"
  },
  {
    "title": "NEW POLL: Trump Gets Destroyed 6-to-1 On Pardons — Including Whopping 2-to-1 With Trump Voters",
    "description": "Trump's latest pardon got brutal marks in a new poll that showed almost seven to one disapproval of one pardon — with twice as many Trump voters opposing it\nThe post NEW POLL: Trump Gets Destroyed 6-to-1 On Pardons — Including Whopping 2-to-1 With Trump Voter…",
    "link": "https://www.mediaite.com/media/news/new-poll-trump-gets-destroyed-6-to-1-on-pardons-including-whopping-2-to-1-with-trump-voters/",
    "timestamp": "2025-12-13T18:10:57Z"
  },
  {
    "title": "I Watched 12 Hours of Nick Fuentes",
    "description": "The white-supremacist influencer is laying the groundwork to go even bigger.",
    "link": "https://www.theatlantic.com/technology/2025/12/nick-fuentes-livestream/685247/",
    "timestamp": "2025-12-13T18:06:00Z"
  },
  {
    "title": "Trump Sounds Alarm on Russia-Ukraine Conflict: 'Things Like This End Up in Third World Wars'",
    "description": "President Donald Trump has issued a warning about the potential for the ongoing conflict between Russia and Ukraine to escalate into a global war.\nWhat Happened: On Thursday, Trump expressed his concerns about the intensifying situation in the Russia-Ukraine …",
    "link": "https://biztoc.com/x/57425616e13d0c56",
    "timestamp": "2025-12-13T18:01:47Z"
  },
  {
    "title": "Radio 4 presenter claims he was forced to quit over political views",
    "description": "He has described it as ‘the saddest day of my professional life’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/robin-ince-bbc-infinite-monkey-cage-b2883994.html",
    "timestamp": "2025-12-13T18:00:04Z"
  },
  {
    "title": "Trump Admin Leaves Data About Trans People Out of Prison Sexual Violence Reports",
    "description": "This comes just days after a DOJ memo revealed plans to dismantle prison rape protections for trans and intersex people.",
    "link": "https://prismreports.org/2025/12/11/doj-sexual-victimization-prison-jail-trans/",
    "timestamp": "2025-12-13T17:56:44Z"
  },
  {
    "title": "2 U.S. service members and one American civilian killed in Islamic State ambush in Syria, Central Command says",
    "description": "The attack on U.S. troops in Syria is the first to inflict casualties since the fall of President Bashar Assad a year ago.",
    "link": "https://fortune.com/2025/12/13/us-troop-casualties-american-civilian-islamic-state-ambush-attack-syria-central-command/",
    "timestamp": "2025-12-13T17:56:30Z"
  },
  {
    "title": "U.S. lifts sanctions on Belarusian potash: U.S. special envoy",
    "description": "MINSK, Dec. 13 (Xinhua) -- The United States has decided to lift sanctions previously imposed on the Belarusian potash industry, U.S. special envoy for Belarus John Coale said here on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/14/us-lifts-sanctions-on-belarusian-potash-us-special-envoy",
    "timestamp": "2025-12-13T17:54:00Z"
  },
  {
    "title": "What Kind Of Caesar Will Trump Be?",
    "description": "What Kind Of Caesar Will Trump Be?\n \nAuthored by Vince Coyner via American Thinker,\nIt’s not often that life gives nations real second chances when it comes to the big things, but in America’s case, it did. My only hope is that we don’t squander it...or to be…",
    "link": "https://biztoc.com/x/f90bd86fa5b3d75a",
    "timestamp": "2025-12-13T17:50:43Z"
  },
  {
    "title": "Pro-Trump Host Bitterly Complains Live At Rally Trump Staff Kicked Him Off Press Area: ‘Was I Telling It Like It Is Too Much?’",
    "description": "A pro-Trump host complained that Trump staffers forced him to vacate the press pen at Trump's rally this week, wondering if he was being too honest for them.\nThe post Pro-Trump Host Bitterly Complains Live At Rally Trump Staff Kicked Him Off Press Area: ‘Was …",
    "link": "https://www.mediaite.com/media/news/pro-trump-host-at-rally-bitterly-complains-they-kicked-him-off-press-riser-was-i-telling-it-like-it-is-too-much/",
    "timestamp": "2025-12-13T17:46:25Z"
  },
  {
    "title": "‘Republicans have big problems’: Conservative commentators panic after election blowouts",
    "description": "Democrats’ decisive election victory\r\n this week in a mayoral race in Florida has left conservatives scrambling\r\n as the GOP continues to suffer unprecedented losses in the lead up to next year’s midterms, and on Saturday, two conservative commentators warned…",
    "link": "https://www.rawstory.com/midterm-2674397459/",
    "timestamp": "2025-12-13T17:41:21Z"
  },
  {
    "title": "Trump Cabinet wives reveal rare glimpse into president’s ‘one big team’ approach",
    "description": "Trump Cabinet wives reveal behind-the-scenes insights about administration life, describing fast decisions and team bonds in candid interview.",
    "link": "https://www.foxnews.com/media/cabinet-wives-reveal-trump-administration-feels-like-one-big-team-incredible-leader",
    "timestamp": "2025-12-13T17:41:03Z"
  },
  {
    "title": "Trump Admin Secures Release Of 123 Political Prisoners, Including American Citizens, From Belarus",
    "description": "Belarus freed 123 political prisoners after the U.S. agreed to lift some trade sanctions on the Russian proxy state, The New York Times reported.",
    "link": "https://dailycaller.com/2025/12/13/donald-trump-administration-eases-trade-sanctions-belarus-release-123-political-prisoners-american-citizens/",
    "timestamp": "2025-12-13T17:39:07Z"
  },
  {
    "title": "Ted Cruz: If Rep. Ilhan Omar Married Her Brother, She Broke State and Federal Laws",
    "description": "Sen. Ted Cruz (R-TX) weighed in on President Donald Trump’s resurrection of the claim that Squad member Rep. Ilhan Omar (D-MN) married her brother by presenting a trio of state and federal laws she would have violated if the allegation proved accurate.\nThe po…",
    "link": "https://www.breitbart.com/politics/2025/12/13/ted-cruz-if-rep-ilhan-omar-married-her-brother-she-broke-state-federal-laws/",
    "timestamp": "2025-12-13T17:37:52Z"
  },
  {
    "title": "‘End of history’? The revenge of nuclear deterrence",
    "description": "Disarmament agenda collapsed 'because the world changed. Russia, China, and North Korea never embraced abolition'",
    "link": "https://www.wnd.com/2025/12/end-history-revenge-nuclear-deterrence/",
    "timestamp": "2025-12-13T17:36:04Z"
  },
  {
    "title": "ICE Barbie Kristi Noem Spirals Under Intense White House Pressure",
    "description": "Kristi Noem is scrambling to shift blame to her subordinates for not meeting deportation quotas as the Department of Homeland Security descends into an atmosphere of chaos and finger-pointing, according to a new report.Noem and her right-hand man (and alleged…",
    "link": "https://newrepublic.com/post/204377/ice-kristi-noem-dhs-deportations-chaos",
    "timestamp": "2025-12-13T17:34:59Z"
  },
  {
    "title": "Pressure mounts on Rep Ilhan Omar as Ted Cruz warns she faces jail and deportation if 'incest' marriage is true",
    "description": "Senator Ted Cruz has weighed in on Representative Ilhan Omar and issued her with a warning after allegations have swirled that the progressive congresswoman married her brother so he could become an American citizen. Cruz shared an article on X, accusing Omar…",
    "link": "https://freerepublic.com/focus/f-chat/4357225/posts",
    "timestamp": "2025-12-13T17:33:46Z"
  },
  {
    "title": "Belarus releases 123 prisoners after Trump envoy’s visit",
    "description": "The US is expected to lift sanctions on Belarus’ fertilizer sector in return for the mass pardon Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629417-belarus-us-prisoner-release/",
    "timestamp": "2025-12-13T17:32:59Z"
  },
  {
    "title": "Two US Army Soldiers and One Interpreter Killed By ‘Lone ISIS Gunman’ in Syria Ambush, Pentagon Says",
    "description": "The U.S. State Department announced Saturday that two U.S. Army soldiers and an interpreter were gunned down by a \"lone ISIS gunman\" in Syria.\nThe post Two US Army Soldiers and One Interpreter Killed By ‘Lone ISIS Gunman’ in Syria Ambush, Pentagon Says first …",
    "link": "https://www.mediaite.com/media/news/two-us-army-soldiers-and-one-interpreter-killed-by-lone-isis-gunman-in-syria-ambush-pentagon-says/",
    "timestamp": "2025-12-13T17:32:49Z"
  },
  {
    "title": "If He Builds It, Tear It Down — The foremost task occupying the attention ... (Hamilton Nolan/How Things Work)",
    "description": "Hamilton Nolan / How Things Work:\nIf He Builds It, Tear It Down  —  The foremost task occupying the attention of United States President Donald J. Trump is the construction of an enormous ballroom.  Like Trump himself, the project is tacky, grandiose to the p…",
    "link": "https://www.memeorandum.com/251213/p38",
    "timestamp": "2025-12-13T17:30:03Z"
  },
  {
    "title": "Trump rips NIL ‘disaster’ in Oval Office, warns it’s killing college sports",
    "description": "President Donald Trump called NIL a \"disaster\" for college sports and Olympics during an Oval Office event, warning programs can't sustain massive player salaries.",
    "link": "https://www.outkick.com/sports/president-trump-shreds-state-nil",
    "timestamp": "2025-12-13T17:29:32Z"
  },
  {
    "title": "Trump Ally Accused of Using Biden Era Dem ‘Talking Points’ To Defend Trump on CNN Panel",
    "description": "Jared Moskowitz accused Stephen Moore, a former economic advisor to Trump, of using \"DNC talking points\" to defend the president during a CNN panel.\nThe post Trump Ally Accused of Using Biden Era Dem ‘Talking Points’ To Defend Trump on CNN Panel first appeare…",
    "link": "https://www.mediaite.com/media/tv/trump-ally-accused-of-using-biden-era-dem-talking-points-to-defend-trump-on-cnn-panel/",
    "timestamp": "2025-12-13T17:19:29Z"
  },
  {
    "title": "Israel Allies Foundation Honors Trump with Lifetime Achievement Award: ‘Israel Has Never Had a Better Friend’",
    "description": "President Donald Trump declared that “Israel has never had a better friend in the White House” as the Israel Allies Foundation (IAF) honored him last week at its annual Chairman’s Gala in Washington, D.C., recognizing what the organization described as his hi…",
    "link": "https://www.breitbart.com/politics/2025/12/13/israel-allies-foundation-honors-trump-with-lifetime-achievement-award-israel-has-never-had-a-better-friend/",
    "timestamp": "2025-12-13T17:15:55Z"
  },
  {
    "title": "Americans may see 'very large refunds' of up to $2,000, officials say",
    "description": "Treasury Secretary Scott Bessent said this week the refunds stem from tax changes that took effect after many workers had set their tax withholding levels.",
    "link": "https://www.statesman.com/business/economy/article/my-tax-refund-irs-2026-status-21240697.php",
    "timestamp": "2025-12-13T17:14:16Z"
  },
  {
    "title": "Fighting rages on Thai-Cambodian border despite Trump's ceasefire claim",
    "description": "Fighting raged Saturday morning along the border of Thailand and Cambodia, even after U.S. President Donald Trump, acting as a mediator, declared that he had won agreement from both countries for a new ceasefire.",
    "link": "https://www.cbc.ca/news/world/thailand-cambodia-border-fighting-continues-9.7014953",
    "timestamp": "2025-12-13T17:12:34Z"
  },
  {
    "title": "Belarus frees protest leader Kolesnikova, Nobel winner Bialiatski",
    "description": "Belarusian street protest leader Maria Kolesnikova and Nobel Prize winner Ales Bialiatski walked free on Saturday with 121 other political prisoners released in an unprecedented US-brokered deal. Belarusian President Alexander Lukashenko has locked up thousan…",
    "link": "https://www.digitaljournal.com/world/belarus-frees-protest-leader-kolesnikova-nobel-winner-bialiatski/article",
    "timestamp": "2025-12-13T17:12:20Z"
  },
  {
    "title": "Federal judge orders FEMA to restore billions in canceled disaster mitigation funding",
    "description": "A federal judge in Massachusetts on Thursday ordered the Trump administration to restore billions of dollars in canceled FEMA disaster mitigation funding, siding with 22 states and the District of Columbia that sued over the canceled grants this summer. Presi…",
    "link": "https://freerepublic.com/focus/f-news/4357223/posts",
    "timestamp": "2025-12-13T17:08:25Z"
  },
  {
    "title": "House GOP unveils health care measure that does not extend ACA subsidies",
    "description": "House Republicans unveiled Friday a narrow health care package to address rising costs, but the plan does not extend the expiring enhanced Affordable Care Act subsidies.",
    "link": "https://abcnews.go.com/Politics/house-republicans-unveil-health-care-package-extend-aca/story?id=128363919",
    "timestamp": "2025-12-13T17:06:34Z"
  },
  {
    "title": "Two U.S. Service Members And One American Civilian Killed In Ambush In Syria",
    "description": "The attack on U.S. troops in Iraq is the first to inflict casualties since the fall of Syrian President Bashar Assad a year ago.",
    "link": "https://www.huffpost.com/entry/two-us-service-members-and-american-civilian-killed-in-ambush-in-syria_n_693d9bb6e4b0d58462bec4da",
    "timestamp": "2025-12-13T17:05:15Z"
  },
  {
    "title": "Elections impossible under Zelensky’s ‘terrorist regime’ – Ukrainian MP",
    "description": "Elections in Ukraine are only possible after the “capitulation” of Vladimir Zelensky’s “terrorist regime,” Artyom Dmitruk has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629415-ukrainian-mp-election-impossible/",
    "timestamp": "2025-12-13T17:04:47Z"
  },
  {
    "title": "Some Native Americans draw shocked response over contract to design immigration detention centers",
    "description": "The Prairie Band Potawatomi Nation that was uprooted from the Great Lakes region in the 1830s is facing widespread outrage over plans to profit from another forced removal",
    "link": "https://abcnews.go.com/US/wireStory/native-americans-draw-shocked-response-contract-design-immigration-128374248",
    "timestamp": "2025-12-13T17:01:32Z"
  },
  {
    "title": "DAVID MARCUS: Meet the Five Families of the Democratic Party",
    "description": "Democratic Party politics explained through organized crime metaphor, featuring Nancy Pelosi, Kamala Harris, Tim Walz, and other key political figures.",
    "link": "https://www.foxnews.com/opinion/david-marcus-meet-five-families-democratic-party",
    "timestamp": "2025-12-13T16:50:06Z"
  },
  {
    "title": "James Carville says Democrats must realize youth are not a static voting bloc",
    "description": "Veteran strategist James Carville says young voters are more fluid than expected, with recent focus groups showing disillusionment with both political parties.",
    "link": "https://www.foxnews.com/media/james-carville-says-democrats-must-realize-youth-not-static-voting-bloc",
    "timestamp": "2025-12-13T16:44:03Z"
  },
  {
    "title": "Working Americans could get very large refunds up to $2,000 — here’s how to claim yours",
    "description": "Working Americans could get very large refunds up to $2,000: Millions may see $1,000–$2,000 per household in early 2026 due to new tax law changes. Experts say check your withholding, file early, and plan how to use this rare cash boost to pay debt, save, or …",
    "link": "https://economictimes.indiatimes.com/news/international/us/working-americans-could-get-very-large-refunds-up-to-2000-heres-how-to-claim-yours/articleshow/125949742.cms",
    "timestamp": "2025-12-13T16:43:04Z"
  }
]