[
  {
    "title": "Trump, Zelensky and the ‘Russian Wish List’ Peace Deal | Perspective",
    "description": "President Donald Trump spent Saturday night at the Kennedy Center Honors in Washington, having complained to reporters outside that Ukrainian President Volodymyr Zelensky hadn’t even read the latest U.S. peace proposal to end the Russia-Ukraine war. The image…",
    "link": "https://biztoc.com/x/3e4ecf9b14fe48b1",
    "timestamp": "2025-12-08T16:46:18Z"
  },
  {
    "title": "Trump says Zelenskyy ‘hasn’t read’ a U.S.-authored proposal to end Russia-Ukraine war",
    "description": "In an exchange with reporters on Sunday, Trump suggested the Ukrainian leader is holding up the talks from moving forward.",
    "link": "https://www.pbs.org/newshour/world/trump-says-zelenskyy-hasnt-read-a-u-s-authored-proposal-to-end-russia-ukraine-war",
    "timestamp": "2025-12-08T16:44:57Z"
  },
  {
    "title": "“Things Are F*cked”: Is ICE Barbie on Her Way Out After Wrecking DHS?",
    "description": "There could be a major switch-up at the Department of Homeland Security “really soon.”In a drastic turn of events, Donald Trump is reportedly considering replacing DHS Secretary Kristi Noem with outbound Virginia Governor Glenn Youngkin. That could make Noem …",
    "link": "https://newrepublic.com/post/204116/donald-trump-kristi-noem-fired-homeland-security",
    "timestamp": "2025-12-08T16:42:53Z"
  },
  {
    "title": "Sylvester Stallone Steps Out with Cane at Kennedy Center Honors",
    "description": "Actor Sylvester Stallone, 79, walked the red carpet with a cane for the first time, as he attended the Kennedy Center Honors on Sunday.\n The “Tulsa King” star, one of this year’s honorees, used a black cane with a gold handle as he posed in a tuxedo alongside…",
    "link": "https://extratv.com/2025/12/08/sylvester-stallone-steps-out-with-cane-at-kennedy-center-honors/",
    "timestamp": "2025-12-08T16:42:28Z"
  },
  {
    "title": "Trump’s New Corollary",
    "description": "The President’s invocation of the Monroe Doctrine is rhetorically satisfying but carries real risks.",
    "link": "http://foreignpolicy.com/2025/12/08/monroe-doctrine-trump-corollary-national-security-strategy-venezuala/",
    "timestamp": "2025-12-08T16:42:06Z"
  },
  {
    "title": "Iraq investigation concludes drones struck Khor Mor gas field, Kurdistan Region requests air defenses",
    "description": "An Iraqi government investigation into the November 26 attack on the Khor Mor gas field in the Kurdistan Region concluded on December 3 that two drones carried out the attack. The committee investigating the incident has recommended establishing an integrated…",
    "link": "https://www.longwarjournal.org/archives/2025/12/iraq-investigation-concludes-drones-struck-khor-mor-gas-field-kurdistan-region-requests-air-defenses.php",
    "timestamp": "2025-12-08T16:42:05Z"
  },
  {
    "title": "The European Union moves ahead with toughening its migration system",
    "description": "Human rights groups said these rules would mean more misery and not less migration.",
    "link": "https://www.bostonherald.com/2025/12/08/eu-immigration/",
    "timestamp": "2025-12-08T16:41:49Z"
  },
  {
    "title": "'Chance this backfires': GOP nervous as Trump goes full speed on redistricting gambit",
    "description": "Months ago, when President Donald Trump urged Texas to redraw its congressional maps in a manner that — he said — would hand Republicans an additional five seats in the U.S. House of Representatives, he launched what has become a sweeping mid-decade redistric…",
    "link": "https://www.rawstory.com/alternet-posts/gop-redistricting/",
    "timestamp": "2025-12-08T16:40:00Z"
  },
  {
    "title": "David Ellison Net Worth: How Much Money the Paramount CEO Has",
    "description": "David's decisions as Paramount Skydance's CEO are under a microscope. Find out his net worth here.",
    "link": "https://hollywoodlife.com/feature/david-ellison-net-worth-5492023/",
    "timestamp": "2025-12-08T16:39:44Z"
  },
  {
    "title": "Trump Says Marjorie Taylor Greene 'Not America First or MAGA'",
    "description": "President Donald Trump on Monday reacted to Rep. Marjorie Taylor Greene's (R-GA) interview on 60 Minutes, asserting that the lawmaker is \"not AMERICA FIRST or MAGA.\"\nThe post Trump Says Marjorie Taylor Greene ‘Not America First or MAGA’ appeared first on Brei…",
    "link": "https://www.breitbart.com/politics/2025/12/08/trump-says-marjorie-taylor-greene-not-america-first-maga/",
    "timestamp": "2025-12-08T16:39:22Z"
  },
  {
    "title": "White House Inexplicably Restarts Fight With Pop Princess In Latest ICE Promo",
    "description": "Donald Trump and his acolytes just gave the \"Espresso\" singer another jolt of their \"inhumane\" agenda.",
    "link": "https://www.huffpost.com/entry/sabrina-carpenter-white-house_n_6936d7cde4b0020dff811564",
    "timestamp": "2025-12-08T16:38:27Z"
  },
  {
    "title": "David Ellison Still Wants Daddy to Buy Warner Bros.",
    "description": "David Ellison’s Paramount is making a hostile bid to buy Warner Bros. after Netflix already confirmed it’s buying the studio and streamer.",
    "link": "http://www.vulture.com/article/paramount-bid-warner-bros-netflix-ellison.html",
    "timestamp": "2025-12-08T16:37:47Z"
  },
  {
    "title": "“Kicking a—“: Fans turn on beloved 1990s sitcom star after his high praise for Trump",
    "description": "“One of the greatest presidents we’ve ever had.”",
    "link": "https://www.silive.com/politics/2025/12/kicking-a-fans-turn-on-beloved-1990s-sitcom-star-after-his-high-praise-for-trump.html",
    "timestamp": "2025-12-08T16:36:04Z"
  },
  {
    "title": "DC police chief resigns amid Trump pressure and crime data manipulation probe",
    "description": "Washington, D.C., police chief Pamela Smith is resigning her position after just two and a half years on the job, she announced Monday. Smith has faced intense pressure from President Donald Trump's administration, which took over the Metropolitan Police Depa…",
    "link": "https://freerepublic.com/focus/f-chat/4356480/posts",
    "timestamp": "2025-12-08T16:36:03Z"
  },
  {
    "title": "Moscow cheers Trump’s new ‘America First’ strategy",
    "description": "The president’s national security strategy seeks ‘strategic stability’ with Russia",
    "link": "https://theweek.com/politics/trump-security-strategy-europe-russia-america-first",
    "timestamp": "2025-12-08T16:35:29Z"
  },
  {
    "title": "Trump To Launch $12 Billion Farm Aid Plan As Sector Faces Strain",
    "description": "President Donald Trump is set to unveil a $12 billion farm aid package on Monday, according to a White House official. The plan sends $11 billion in one-time payments to crop farmers through the Farmer Bridge Assistance program, with the remaining funds direc…",
    "link": "https://biztoc.com/x/5c35f43e18a21314",
    "timestamp": "2025-12-08T16:34:55Z"
  },
  {
    "title": "Venezuela: Eye on the Prize?",
    "description": "Venezuelan opposition figure María Corina Machado, according to to Nobel Institute director Kristian Berg Harpviken, will travel to Oslo to collect her Nobel Peace Prize on December 10. As news goes, Machado’s alleged trip pings three different stories. First…",
    "link": "https://www.antiwar.com/blog/2025/12/08/venezuela-eye-on-the-prize/",
    "timestamp": "2025-12-08T16:34:12Z"
  },
  {
    "title": "Paramount Bid for Warner Bros Fueled by Billions in Foreign Money and Jared Kushner’s Private Equity Firm",
    "description": "Paramount's $108 billion bid for WB Discovery includes billions of dollars in funding from Middle East investors and Jared Kushner's private equity firm\nThe post Paramount Bid for Warner Bros Fueled by Billions in Foreign Money and Jared Kushner’s Private Equ…",
    "link": "https://www.mediaite.com/media/paramount-bid-for-warner-bros-fueled-by-billions-in-foreign-money-and-jared-kushners-private-equity-firm/",
    "timestamp": "2025-12-08T16:32:40Z"
  },
  {
    "title": "‘The Daily Show’ Host Jordan Klepper Tells ‘Morning Joe’ He’s Not Seeing Trump Earn His ‘President of Peace’ Title | Video",
    "description": "\"You see what's happening at these cabinet meetings, you see what's happening with FIFA. What you're watching is people capitulating,\" the Comedy Central star says\nThe post ‘The Daily Show’ Host Jordan Klepper Tells ‘Morning Joe’ He’s Not Seeing Trump Earn Hi…",
    "link": "https://www.thewrap.com/morning-joe-daily-show-jordan-klepper-trump-peace-prize/",
    "timestamp": "2025-12-08T16:31:25Z"
  },
  {
    "title": "GOP 'obliterated' by California move — with candidates left 'fighting for scraps': report",
    "description": "Crawling from the wreckage of the successful California redistricting vote that will likely make Golden State GOP representation in Washington, DC, almost extinct, Politico’s Jeremy White reported Monday that party leaders in the state are desperately looking…",
    "link": "https://www.rawstory.com/calironia-gop-newsom/",
    "timestamp": "2025-12-08T16:30:37Z"
  },
  {
    "title": "Trump critic Jasmine Crockett poised for Senate run in deep-red Texas",
    "description": "Rep. Jasmine Crockett is expected to launch Texas Senate campaign Monday as the filing deadline looms. The Democratic primary was shaken by Colin Allred dropping out.",
    "link": "https://www.foxnews.com/politics/decision-day-trump-critic-jasmine-crockett-senate-run-house-re-election",
    "timestamp": "2025-12-08T16:30:31Z"
  },
  {
    "title": "India’s Fuel Demand Jumped to Six-Month High in November",
    "description": "Total fuel demand in India, the world’s third-biggest crude oil importer, surged in November to the highest level in six months as construction and agriculture activity picked up after the end of the monsoon season.  India consumed 21.27 million tons of fuels…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Indias-Fuel-Demand-Jumped-to-Six-Month-High-in-November.html",
    "timestamp": "2025-12-08T16:30:00Z"
  },
  {
    "title": "Trump to announce $12 billion tariff relief for farmers (Mariana Alfaro/Washington Post)",
    "description": "Mariana Alfaro / Washington Post:\nTrump to announce $12 billion tariff relief for farmers  —  Farmers — particularly those who produce soybeans — have felt the impact of the president's tariff policies.  —  Just now … President Donald Trump on Monday plans to…",
    "link": "https://www.memeorandum.com/251208/p57",
    "timestamp": "2025-12-08T16:30:00Z"
  },
  {
    "title": "The Supreme Court weighs Trump’s bid to fire independent agency board members",
    "description": "Trump lawyers are calling for the unanimous 1935 decision in Humphrey’s Executor to be overturned.",
    "link": "https://www.bostonherald.com/2025/12/08/supreme-court-executive-power/",
    "timestamp": "2025-12-08T16:28:24Z"
  },
  {
    "title": "FBI to be under harsh new microscope as Stefanik scores victory in annual defense bill",
    "description": "A Republican measure in the annual defense bill would force the FBI to disclose investigations of federal candidates within 15 days, boosting transparency in elections.",
    "link": "https://www.foxnews.com/politics/fbi-under-harsh-new-microscope-stefanik-scores-victory-annual-defense-bill",
    "timestamp": "2025-12-08T16:27:39Z"
  },
  {
    "title": "Donald Trump-Themed Christmas Tree Targeted by Vandals",
    "description": "A Christmas tree decorated with images of President Donald Trump was vandalized at a cultural center in Nevada, according to a local report.\nDouglas County Republican Women had decorated the tree with several Trump-themed ornaments, many of which were removed…",
    "link": "https://biztoc.com/x/b76203dd44cddf9e",
    "timestamp": "2025-12-08T16:24:01Z"
  },
  {
    "title": "How a round of golf led to one of Trump’s most bizarre pardons",
    "description": "Donald Trump has a knack for issuing pardons for politicians who’ve been accused or convicted of corruption charges, but the broader pattern isn’t limited to those who’ve been elected to public office. Last week, for example, the president also pardoned Timot…",
    "link": "https://biztoc.com/x/2e1e9216c887d7ae",
    "timestamp": "2025-12-08T16:23:40Z"
  },
  {
    "title": "Jim Caviezel to give Jair Bolsonaro the Jesus treatment",
    "description": "Since 2007, Jezebel has been the Internet's most treasured source for everything celebrities, sex, and politics...with teeth.",
    "link": "https://www.jezebel.com/jim-caviezel",
    "timestamp": "2025-12-08T16:21:43Z"
  },
  {
    "title": "Jim Caviezel to give Jair Bolsonaro the Jesus treatment",
    "description": "Since 2007, Jezebel has been the Internet's most treasured source for everything celebrities, sex, and politics...with teeth.",
    "link": "https://www.jezebel.com/jim-caviezel-bolsonaro-biopic",
    "timestamp": "2025-12-08T16:21:43Z"
  },
  {
    "title": "Trump Is Guilty of Mortgage Fraud, According to Trump",
    "description": "Donald Trump claimed multiple primary residences on mortgages in the 1990s, something his administration has alleged is fraud when targeting the president’s enemies.",
    "link": "http://nymag.com/intelligencer/article/trump-is-guilty-of-mortgage-fraud-according-to-trump.html",
    "timestamp": "2025-12-08T16:20:49Z"
  },
  {
    "title": "After Trump Vow to Intervene, Kushner Linked to Paramount's Hostile Bid for Warner Bros.",
    "description": "Paramount Skydance on Monday launched a hostile bid to take over Warner Bros. Discovery shortly after US President Donald Trump publicly expressed skepticism of Netflix's proposed deal to acquire parts of the media company—and pledged to intervene in the fede…",
    "link": "https://www.commondreams.org/news/trump-paramount-netflix",
    "timestamp": "2025-12-08T16:20:08Z"
  },
  {
    "title": "Trump Not Pushing Back Against Those Claiming Hegseth Is Not Fit To Be Defense Secretary: Report",
    "description": "President Donald Trump is growing tired of the scandals surrounding Defense Secretary Pete Hegseth and not pushing back against those saying he's not up for the job, according to a new report.",
    "link": "https://www.ibtimes.com/trump-not-pushing-back-against-those-claiming-hegseth-not-fit-defense-secretary-report-3792110",
    "timestamp": "2025-12-08T16:19:54Z"
  },
  {
    "title": "European allies back Zelensky after Trump criticism",
    "description": "Ukraine's European allies put on a show of support for President Volodymyr Zelensky Monday as they expressed scepticism about parts of the U.S. proposal to end the war with Russia.",
    "link": "https://www.hurriyetdailynews.com/european-allies-back-zelensky-after-trump-criticism-216593",
    "timestamp": "2025-12-08T16:18:28Z"
  },
  {
    "title": "China Brushes Off Trump Tariffs With Jaw-Dropping $1 Trillion Surplus",
    "description": "China appeared largely unfazed by the Trump administration’s tariff regime, posting a record annual trade surplus of more than $1 trillion as of November.",
    "link": "https://dailycaller.com/2025/12/08/china-brushes-off-trump-tariffs-with-jaw-dropping-1-trillion-surplus/",
    "timestamp": "2025-12-08T16:18:21Z"
  },
  {
    "title": "‘ICE is legally allowed to lie to you’: NYC Mayor-elect Zohran Mamdani releases video urging resistance to immigration raids",
    "description": "\"If you’re being detained, you may always ask, ‘Am I free to go?’ repeatedly until they answer you,” said Zohran Mamdani, who will be sworn in as mayor on Jan 1.",
    "link": "https://fortune.com/2025/12/08/zohran-mamdani-tells-immigrants-ice-can-lie-resist-immigration-raids/",
    "timestamp": "2025-12-08T16:17:46Z"
  },
  {
    "title": "Kansas and Missouri ACA marketplace users can’t afford potential increases, poll shows",
    "description": "If the end-of-year expiration date is not extended, enhanced ACA marketplace participants will see premiums rise anywhere between $300 and $1000. Six in 10 of the respondents to a KFF poll said a $300 increase would put an unsustainable strain on their budget.",
    "link": "https://www.kcur.org/health/2025-12-08/kansas-and-missouri-aca-marketplace-users-cant-afford-potential-increases-poll-shows",
    "timestamp": "2025-12-08T16:17:16Z"
  },
  {
    "title": "Finland as a Leader in European Security",
    "description": "Following Russia’s invasion of Ukraine in 2022, Finland and Sweden swiftly applied for NATO membership. Shortly after, both countries were admitted into the alliance, and Finland and Sweden have since... Read More\nThe post Finland as a Leader in European Secu…",
    "link": "https://www.dailysignal.com/2025/12/08/finland-as-a-leader-in-european-security/",
    "timestamp": "2025-12-08T16:17:00Z"
  },
  {
    "title": "State Department reportedly orders visa denials tied to speech censorship as Trump team slams Europe",
    "description": "Trump administration reportedly orders visa denials for applicants involved in U.S. speech censorship, targeting H-1B workers in tech and social media sectors.",
    "link": "https://www.foxnews.com/world/state-department-reportedly-orders-visa-denials-tied-speech-censorship-trump-team-slams-europe",
    "timestamp": "2025-12-08T16:16:14Z"
  },
  {
    "title": "Kiss Reunites to Accept Kennedy Center Honor From Trump",
    "description": "The surviving members of Kiss reunited as honorees at the Donald Trump–hosted Kennedy Center Honors. The president acknowledged that not all of the night’s attendees were his fans, but said, ‘We don’t care if they like Trump. We want bigness.’",
    "link": "http://www.vulture.com/article/kennedy-center-honors-2025-trump-kiss.html",
    "timestamp": "2025-12-08T16:16:14Z"
  },
  {
    "title": "Republicans 'terrified' to step out of line with Trump, Greene says in candid interview",
    "description": "Rep. Marjorie Taylor Greene said Sunday during an interview that Republicans are \"terrified\" of stepping out of line with President Trump and have mocked him in private.",
    "link": "https://www.foxnews.com/media/republicans-terrified-step-out-line-trump-greene-says-candid-interview",
    "timestamp": "2025-12-08T16:12:48Z"
  },
  {
    "title": "NY Times: Biden Ignored His Advisors' Warnings His Border Policy Would Bring 'Chaos.'",
    "description": "Advisers for Joe Biden warned the former president in 2020 that his immigration plans could lead to “chaos” at the U.S. border, would overwhelm the system and might hand Donald Trump a second term – but he ignored them, according to a report in Sunday’s New Y…",
    "link": "https://www.breitbart.com/politics/2025/12/08/31601757ny-times-biden-ignored-his-advisors-warnings-his-border-policy-would-bring-chaos/",
    "timestamp": "2025-12-08T16:11:40Z"
  },
  {
    "title": "World Cup to include mid-half hydration breaks",
    "description": "The 2026 World Cup will include hydration breaks during every half of competition, effectively splitting matches into four quarters, FIFA announced.",
    "link": "https://www.upi.com/Sports_News/Soccer/2025/12/08/world-cup-2026-hydration-breaks/6741765207661/",
    "timestamp": "2025-12-08T16:11:31Z"
  },
  {
    "title": "Trump says he’ll sign executive order blocking state AI regulations, despite safety fears | CNN Business",
    "description": "President Donald Trump confirmed on Monday he plans to sign an executive order preempting artificial intelligence regulations at the state level with his more hands-off federal policy.",
    "link": "https://www.cnn.com/2025/12/08/tech/trump-eo-blocking-ai-state-laws",
    "timestamp": "2025-12-08T16:11:04Z"
  },
  {
    "title": "Trump says Netflix, Warner Bros. deal 'could be a problem'; he'll be involved in approving (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nTrump says Netflix, Warner Bros. deal ‘could be a problem’; he'll be involved in approving … President Donald Trump expressed skepticism on Sunday night about Netflix's proposed acquisition of parts of Warner Bros. Discovery, saying t…",
    "link": "https://www.memeorandum.com/251208/p55",
    "timestamp": "2025-12-08T16:10:02Z"
  },
  {
    "title": "'ONE RULE': Trump says he'll sign an executive order blocking state AI laws despite bipartisan pushback | TechCrunch",
    "description": "“I will be doing a ONE RULE Executive Order this week,” Trump posted on social media. “You can’t expect a company to get 50 Approvals every time they want to do something.”",
    "link": "https://techcrunch.com/2025/12/08/one-rule-trump-says-hell-sign-an-executive-order-blocking-state-ai-laws-despite-bipartisan-pushback/",
    "timestamp": "2025-12-08T16:08:58Z"
  },
  {
    "title": "What the US national security strategy tells us about how Trump views the world",
    "description": "The Trump administration is highly critical of Europe in its national security strategy, while barely mentioning the threats posed by rival great powers.",
    "link": "https://theconversation.com/what-the-us-national-security-strategy-tells-us-about-how-trump-views-the-world-271438",
    "timestamp": "2025-12-08T16:08:34Z"
  },
  {
    "title": "New Poll Reveals Clear Democratic Favorite in 2028 White House Race",
    "description": "One potential candidate emerged as the early Democratic favorite for the 2028 White House race, according to a survey that shows young voters turning on Trump.\nThe post New Poll Reveals Clear Democratic Favorite in 2028 White House Race first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/new-poll-reveals-clear-democratic-favorite-in-2028-white-house-race/",
    "timestamp": "2025-12-08T16:06:13Z"
  },
  {
    "title": "Israel's PM says second phase of Gaza peace plan is close",
    "description": "Benjamin Netanyahu expects to move to the second phase \"very shortly\", as a Hamas official suggests it is ready to consider \"freezing or storing\" its weapons.",
    "link": "https://www.bbc.com/news/articles/c0r90gkzkezo",
    "timestamp": "2025-12-08T16:05:47Z"
  },
  {
    "title": "Joy Reid Calls Founding Fathers ‘Leeches,’ ‘Killers’ In Resurfaced Rant",
    "description": "A rant about the Founding Fathers from former MSNBC host Joy Reid, accusing them of genocide against “indigenous people” resurfaced on social media Sunday.",
    "link": "https://dailycaller.com/2025/12/08/joy-reid-calls-founding-fathers-leeches-killers-in-resurfaced-rant/",
    "timestamp": "2025-12-08T16:05:14Z"
  },
  {
    "title": "‘Just give it time’: Watch Democrat in Congress claim Trump will soon be murdering Americans",
    "description": "'This is what happens when a soft, feeble Democrat has no argument left'",
    "link": "https://www.wnd.com/2025/12/just-give-it-time-watch-democrat-congress-claim/",
    "timestamp": "2025-12-08T16:05:08Z"
  },
  {
    "title": "Nvidia CEO Jensen Huang says people need to find success in traditional factory jobs again: ‘Every successful person doesn’t need to have a PhD’",
    "description": "The cofounder of the $4.53 trillion AI chip giant says Americans should return to factory work—for their own prosperity and the country’s. Howard Lutnick claims technician roles can start at $90,000, no college degree required.",
    "link": "https://fortune.com/2025/12/08/nvidia-ceo-jensen-huang-people-find-success-traditional-factory-jobs-every-successful-person-doesnt-need-phd-career-advic/",
    "timestamp": "2025-12-08T16:04:59Z"
  },
  {
    "title": "The D Brief: Higher spending on the way?; Anti-boat effort’s lopsided costs; Security-strategy reax; Navy’s next frigate program; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/12/the-d-brief-december-08-2025/409998/",
    "timestamp": "2025-12-08T16:04:54Z"
  },
  {
    "title": "Democrat Senate Nominee Drops Out of Race Same Day Jasmine Crockett Is Expected to Announce Whether She's Running",
    "description": "The Democrat Party's 2024 Senate nominee in Texas, former Rep. Colin Allred, has formally dropped his bid for Senate on the same day that Rep. Jasmine Crockett (D-TX) is expected to announce if she will run for the seat.\nThe post Democrat Senate Nominee Drops…",
    "link": "https://www.breitbart.com/politics/2025/12/08/democrat-senate-nominee-drops-out-of-race-same-day-jasmine-crockett-is-expected-to-announce-whether-shes-running/",
    "timestamp": "2025-12-08T16:04:25Z"
  },
  {
    "title": "Paramount Launches $108 Billion Bid to Steal Warner from Netflix",
    "description": "Paramount launched a $108B hostile bid for Warner Bros Discovery, challenging Netflix’s deal for HBO and DC assets with a superior offer.",
    "link": "https://www.androidheadlines.com/2025/12/paramount-launches-hostile-108-billion-bid-warner-netflix.html",
    "timestamp": "2025-12-08T16:03:13Z"
  },
  {
    "title": "What Democrats can take from Zohran Mamdani's outreach efforts for 2026",
    "description": "A strong field operation — which includes volunteers knocking on doors and talking to voters in their homes — can tip the scales in a close election.",
    "link": "https://www.nbcnews.com/politics/elections/democrats-zohran-mamdani-outreach-efforts-rcna246862",
    "timestamp": "2025-12-08T16:02:58Z"
  },
  {
    "title": "DC Police Chief Who Trump Tried To Oust During Takeover Finally Calls It Quits",
    "description": "Pamela Smith, the chief of the Washington D.C. Metropolitan Police Department (MPD), is leaving the police department after two years in her role, Democratic Mayor Muriel Bowser announced Monday morning. “Chief Smith drastically drove down violent crime, drov…",
    "link": "https://dailycaller.com/2025/12/08/pamela-smith-washington-dc-mpd-trump-crime-takeover/",
    "timestamp": "2025-12-08T16:01:27Z"
  },
  {
    "title": "Senate Democrats push Obamacare subsidy vote 'designed to fail' as Republicans call plan unserious",
    "description": "Republicans eye health savings accounts as alternative to Democrats' Obamacare subsidy extension while Senate remains deadlocked on solution.",
    "link": "https://www.foxnews.com/politics/senate-democrats-push-obamacare-subsidy-vote-designed-fail-republicans-call-plan-unserious",
    "timestamp": "2025-12-08T16:00:36Z"
  },
  {
    "title": "Ceasefire Violated: Thailand Struck Cambodia After Border Clashes",
    "description": "Thailand attacked Cambodia with air strikes today, after clashes broke out along the border on Sunday. The two countries are accusing each other of violating a United States-brokered ceasefire agreement. Is another war brewing?",
    "link": "https://www.shtfplan.com/war/ceasefire-violated-thailand-struck-cambodia-after-border-clashes",
    "timestamp": "2025-12-08T16:00:31Z"
  },
  {
    "title": "Zelensky: U.S. Talks 'Constructive,' Suggests Europe Is the Obstacle for Ukraine Peace Deal",
    "description": "Ukrainian President Volodymyr Zelensky said negotiations with the United States to end Russia's invasion of his country were \"constructive.\"\nThe post Zelensky: U.S. Talks ‘Constructive,’ Suggests Europe Is the Obstacle for Ukraine Peace Deal appeared first on…",
    "link": "https://www.breitbart.com/europe/2025/12/08/zelensky-u-s-talks-constructive-suggests-europe-is-obstacle-ukraine-peace-deal/",
    "timestamp": "2025-12-08T16:00:26Z"
  },
  {
    "title": "Heather Cox Richardson on Pearl Harbor and Its Message for Today",
    "description": "Yesterday, December 7, was the 84th anniversary of Pearl Harbor Day. President Franklin D. Roosevelt said it was a day that will live in infamy. After the passage of so much time, Heather Cox Richardson sees that Pearl Harbor shines a light on our current pol…",
    "link": "https://dianeravitch.net/2025/12/08/heather-cox-richardson-on-pearl-harbor-and-its-message-for-today/",
    "timestamp": "2025-12-08T16:00:00Z"
  },
  {
    "title": "Barron Trump’s 12:30 AM faith conversation sparks buzz, pastor reveals",
    "description": "Pastor Stuart Knechtle recently revealed the details of a late-night phone conversation with Barron Trump, asserting that the president’s son is “very close to putting his faith in Christ.” Knechtle said Barron responded strongly to a discussion in regard to …",
    "link": "https://economictimes.indiatimes.com/news/international/us/barron-trumps-1230-am-faith-conversation-sparks-buzz-pastor-reveals/articleshow/125838679.cms",
    "timestamp": "2025-12-08T15:59:15Z"
  },
  {
    "title": "Marjorie Taylor Greene Claims Trump Sent an 'Extremely Unkind' Message After She Received 'Death Threats' Following Nasty Fallout With Prez",
    "description": "Marjorie Taylor Greene detailed Donald Trump's response to death threats her son received, noting it was 'unkind.'",
    "link": "https://radaronline.com/p/marjorie-taylor-greene-donald-trump-death-threats-unkind-message-revealed/",
    "timestamp": "2025-12-08T15:57:36Z"
  },
  {
    "title": "Starmer holds crisis talks with Zelenskyy in search for 'decent peace for Ukraine'",
    "description": "The prime minister and the Ukrainian president were joined by French leader Emmanuel Macron and German chancellor Friedrich Merz to discuss ways to reach a lasting peace in Ukraine.",
    "link": "https://news.sky.com/story/starmer-holds-crisis-talks-with-zelenskyy-in-search-for-decent-peace-for-ukraine-13481054",
    "timestamp": "2025-12-08T15:57:00Z"
  },
  {
    "title": "ARTnews 2025 Awards Announced, Trump Kennedy Center Seizure Capped by Honors Event, and More: Morning Links for December 8, 2025",
    "description": "The six winners for the ARTnews Awards 2025 were chosen by a jury of five US-based curators and two ARTnews senior editors.",
    "link": "https://www.artnews.com/art-news/news/artnews-awards-2025-trump-kennedy-center-morning-links-1234765627/",
    "timestamp": "2025-12-08T15:55:41Z"
  },
  {
    "title": "UK’s Starmer unveils TikTok account despite ban",
    "description": "UK Prime Minister Keir Starmer launches a new TikTok account to connect with younger voters, despite the app being banned on government devices.\n\nRead More: https://punchng.com/uks-starmer-unveils-tiktok-account-despite-ban/",
    "link": "https://punchng.com/uks-starmer-unveils-tiktok-account-despite-ban/",
    "timestamp": "2025-12-08T15:55:17Z"
  },
  {
    "title": "Paramount Skydance Fires Off Hostile $108.4 Billion Bid For Warner Bros. Discovery as Netflix Deal Looms",
    "description": "The Warner Bros. Discovery saga just took another wild turn. While Netflix appeared to be cruising toward a massive acquisition of the storied studio, Paramount Skydance has stepped in with a staggering hostile bid of its own. Entertainment fans have been wat…",
    "link": "https://geektyrant.com/news/paramount-skydance-fires-off-hostile-1084-billion-bid-for-warner-bros-discovery-as-netflix-deal-looms",
    "timestamp": "2025-12-08T15:55:00Z"
  },
  {
    "title": "Warner Bros. investors are getting a big boost from the bidding war between Paramount and Netflix",
    "description": "Paramount launched a bid to acquire Warner Bros. Discovery on Monday, days after Netflix said it would buy the media giant in a $72 billion deal.",
    "link": "https://www.businessinsider.com/paramount-netflix-warner-bros-wbd-stock-price-merger-hostile-takeover-2025-12",
    "timestamp": "2025-12-08T15:54:49Z"
  },
  {
    "title": "US Core Security Interests – The Trump Corollary",
    "description": "America’s new National Security Strategy (NSS) marks an ideological and substantive shift in U.S. foreign policy.\nThe post US Core Security Interests – The Trump Corollary appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/us-core-security-interests-trump-corollary/5908262",
    "timestamp": "2025-12-08T15:54:45Z"
  },
  {
    "title": "'Frustrations run deep' as Republicans' Hegseth pleas get ignored by Trump: conservative",
    "description": "Republicans hoping to get questions answered by Defense Secretary Pete Hegseth are getting impatient with his stonewalling and are finding Donald Trump’s White House to also be unresponsive, conservative journalist David Drucker reported Monday.Appearing on M…",
    "link": "https://www.rawstory.com/trump-hegseth-gop/",
    "timestamp": "2025-12-08T15:54:30Z"
  },
  {
    "title": "‘You’re Not Really Blaming It on Whitey, Are You?!’ Bill Maher and Ana Kasparian Brawl Over Islam’s Affect on Middle East",
    "description": "Bill Maher was incredulous when he challenged commentator Ana Kasparian to name a Muslim Middle Eastern city she would rather live in than Tel Aviv\nThe post ‘You’re Not Really Blaming It on Whitey, Are You?!’ Bill Maher and Ana Kasparian Brawl Over Islam’s Af…",
    "link": "https://www.mediaite.com/media/youre-not-really-blaming-it-on-whitey-are-you-bill-maher-and-ana-kasparian-brawl-over-islams-affect-on-middle-east/",
    "timestamp": "2025-12-08T15:53:56Z"
  },
  {
    "title": "‘I’ll Be Involved’: Trump Weighs In On Netflix-Warner Bros. Deal",
    "description": "Donald Trump confirmed he met with Netflix co-CEO Ted Sarandos and will be involved in the Warner Bros. Discovery acquisition.",
    "link": "https://dailycaller.com/2025/12/08/trump-netflix-warner-bros-discovery-ted-sarandos-paramount/",
    "timestamp": "2025-12-08T15:53:11Z"
  },
  {
    "title": "Paramount makes a $108 billion hostile takeover bid for Warner Bros. Discovery",
    "description": "Paramount has been none too pleased about Netflix striking an $82.7 billion deal to buy much of Warner Bros. Discovery (WBD). Now, Paramount is making a hostile takeover bid for WBD. It's making its pitch directly to WBD shareholders with an all-cash offer of…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180331533",
    "timestamp": "2025-12-08T15:52:14Z"
  },
  {
    "title": "China trade surplus tops $1 trillion for first time on non-US growth",
    "description": "Chinese exports overall grew 5.9% year-on-year in November, customs data on Monday showed, a reversal from October's 1.1% contraction, and beating a 3.8% forecast in a Reuters poll.",
    "link": "https://economictimes.indiatimes.com/news/international/business/china-trade-surplus-tops-1-trillion-for-first-time-on-non-us-growth/articleshow/125839292.cms",
    "timestamp": "2025-12-08T15:49:16Z"
  },
  {
    "title": "‘Sort of blackmail’: Billions in rural health funding hinge on states passing Trump-backed policies - NewsBreak",
    "description": "Democrats and health advocates described the strategy as highly unusual, and some fear it could be wielded to favor political allies.",
    "link": "https://www.newsbreak.com/news/4385673783630-sort-of-blackmail-billions-in-rural-health-funding-hinge-on-states-passing-trump-backed-policies?noAds=1&amp;_f=app_share&amp;s=a2&amp;share_destination_id=Mjg0MjI3ODEyLTE3NjUyMDg4MTg3NjM%3D",
    "timestamp": "2025-12-08T15:47:35Z"
  },
  {
    "title": "55 more Iranians deported from U.S., Iran says",
    "description": "The U.S. government has not acknowledged the deportation flight.",
    "link": "https://www.pbs.org/newshour/politics/55-more-iranians-deported-from-u-s-iran-says",
    "timestamp": "2025-12-08T15:47:34Z"
  },
  {
    "title": "Trump to unveil US$12 billion in long-awaited farm aid",
    "description": "The Trump administration on Monday plans to unveil a long-awaited farm aid package, according to a White House official. Read more.",
    "link": "https://financialpost.com/commodities/agriculture/trump-unveil-long-awaited-farm-aid-program",
    "timestamp": "2025-12-08T15:47:09Z"
  },
  {
    "title": "Trump Bashes Charlotte Democrats After Second Stabbing on Train",
    "description": "An illegal alien from Honduras is reported to have stabbed a man on a light rail train in Charlotte, North Carolina. Suspect Oscar Gerardo Solorzano-Garcia is in... Read More\nThe post Trump Bashes Charlotte Democrats After Second Stabbing on Train   appeared …",
    "link": "https://www.dailysignal.com/2025/12/08/trump-bashes-charlotte-democrats-after-second-stabbing-on-train/",
    "timestamp": "2025-12-08T15:46:42Z"
  },
  {
    "title": "Paramount launches hostile takeover bid of Warner Bros Discovery, says $108.4 billion offer is ‘superior’ to Netflix deal",
    "description": "Paramount Global — backed by Skydance Corporation — unveiled a hostile all-cash tender offer to acquire Warner Bros. Discovery (WBD) in full…\nThe post Paramount launches hostile takeover bid of Warner Bros Discovery, says $108.4 billion offer is ‘superior’ to…",
    "link": "https://macdailynews.com/2025/12/08/paramount-launches-hostile-takeover-bid-of-warner-bros-discovery-says-108-4-billion-offer-is-superior-to-netflix-deal/",
    "timestamp": "2025-12-08T15:46:32Z"
  },
  {
    "title": "MTG: What Republicans say behind Trump’s back “would shock people”",
    "description": "Republicans talk \"differently\" about Trump behind the scenes, Greene told \"60 Minutes.\"",
    "link": "https://www.salon.com/2025/12/08/mtg-what-republicans-say-behind-trumps-back-would-shock-people/",
    "timestamp": "2025-12-08T15:45:48Z"
  },
  {
    "title": "With Subsidies In Limbo, Obamacare New Sign-Ups Lag Last Year’s Pace",
    "description": "New sign-ups for in individual coverage under the Affordable Care Act, also known as Obamacare, lags last year’s pace.",
    "link": "https://www.forbes.com/sites/brucejapsen/2025/12/08/with-subsidies-in-limbo-obamacare-new-sign-ups-lag-last-years-pace/",
    "timestamp": "2025-12-08T15:42:34Z"
  },
  {
    "title": "Kayleigh McEnany Fires Back At Ilhan Omar For Comparing Criticism Of Somalis To Nazi Rhetoric",
    "description": "Kayleigh McEnany scoffed at Democratic Minnesota Rep. Ilhan Omar's suggestion that calling on Somalis to assimilate is Nazi rhetoric.",
    "link": "https://dailycaller.com/2025/12/08/kayleigh-mcenany-ilhan-omar-nazis-somalis/",
    "timestamp": "2025-12-08T15:40:59Z"
  },
  {
    "title": "Donald Trump Rails At Paramount Leadership, 60 Minutes",
    "description": "The posts on Truth Social come just as Paramount hopes to gain traction with its hostile offer for Warner Bros. Discovery.",
    "link": "http://www.hollywoodreporter.com/business/business-news/donald-trump-rails-against-paramount-leadership-after-marjorie-taylor-greene-60-minutes-segment-1236444740/",
    "timestamp": "2025-12-08T15:40:33Z"
  },
  {
    "title": "EU leader warns of US interference in Europe’s affairs as Russia praises Trump’s security vision",
    "description": "BRUSSELS (AP) — A top European Union official on Monday warned the United States against interfering in Europe’s affairs and said only European citizens can decide which parties should govern them. European Council President Antonio Costa’s remarks came in re…",
    "link": "https://financialpost.com/pmn/eu-leader-warns-of-us-interference-in-europes-affairs-as-russia-praises-trumps-security-vision",
    "timestamp": "2025-12-08T15:39:30Z"
  },
  {
    "title": "No nervous system interference there at all, thank you very much",
    "description": "Remember this guy? A local chiropractor put up signs all around town touting “The Cancer Cure” (but taking care not to promise one, since he’s only a chiropractor). Those signs suddenly disappeared shortly after I complained, but it’s typical of these fringe …",
    "link": "https://freethoughtblogs.com/pharyngula/2025/12/08/no-nervous-system-interference-there-at-all-thank-you-very-much/",
    "timestamp": "2025-12-08T15:39:25Z"
  },
  {
    "title": "Trump is proposing a $12B aid package for farmers hit hard by his trade war with China",
    "description": "WASHINGTON (AP) — President Donald Trump is planning a $12 billion farm aid package, according to a White House official — a boost to farmers who have struggled to sell their crops while getting hit by rising costs after the president raised tariffs on China …",
    "link": "https://financialpost.com/pmn/trump-is-proposing-a-12b-aid-package-for-farmers-hit-hard-by-his-trade-war-with-china",
    "timestamp": "2025-12-08T15:39:19Z"
  },
  {
    "title": "Paramount Launches Hostile Bid for Warner Bros. Discovery Despite Netflix Deal",
    "description": "Paramount is launching a hostile bid to acquire Warner Bros.",
    "link": "https://www.today.com/popculture/news/paramount-bid-warner-bros-netflix-deal-rcna248018",
    "timestamp": "2025-12-08T15:38:18Z"
  },
  {
    "title": "SNL Cold Open Skewers Pete Hegseth",
    "description": "The SNL Cold Open this Saturday had everything - WWE style opening, a manic and unhinged Pete Hegseth AND a Dozy Donald Trump.\nColin Jost nails Hegseth perfectly, mimicking his facial expressions, fake deep voice, aggressive posture and the all too typical MA…",
    "link": "https://crooksandliars.com/2025/12/snl-cold-open-skewers-pete-hegseth",
    "timestamp": "2025-12-08T15:37:44Z"
  },
  {
    "title": "MTG: Republicans Laughed Behind Trump's Back",
    "description": "Marjorie Taylor Greene continued her feud with Donald Trump by telling CBS' 60 Minutes, many of her Republican colleagues make fun of Trump behind his back, but then kissed his ass after he won.\nThis is a short segment from the larger interview that hasn't ai…",
    "link": "https://crooksandliars.com/2025/12/mtg-republicans-laughed-behind-trumps-back",
    "timestamp": "2025-12-08T15:37:44Z"
  },
  {
    "title": "The Somali immigrant challenge",
    "description": "This past weekend, Michael Dorgan of Fox News devoted an episode to Minnesota's \"Little Mogadishu,\"America's largest Somali community. The rapidly expanding Muslim population in Minneapolis has become a focus of intense national debate over immigration and we…",
    "link": "https://freerepublic.com/focus/f-news/4356474/posts",
    "timestamp": "2025-12-08T15:36:20Z"
  },
  {
    "title": "Trump to Sign Executive Order Preventing States From Regulating AI",
    "description": "President Donald Trump said Monday (Dec. 8) that he will sign an executive order giving the federal government exclusive jurisdiction over artificial intelligence. “There must be only One Rulebook if we are going to continue to lead in AI,” he wrote in a post…",
    "link": "https://www.pymnts.com/artificial-intelligence-2/2025/trump-to-sign-executive-order-preventing-states-from-regulating-ai/",
    "timestamp": "2025-12-08T15:35:45Z"
  },
  {
    "title": "Sen. Cotton says he has no objection to releasing video of strike that killed two survivors",
    "description": "Cotton he is splitting with Democrats over whether military personnel acted lawfully in carrying out a second strike to kill the two survivors.",
    "link": "https://www.pbs.org/newshour/politics/sen-cotton-says-he-has-no-objection-to-releasing-video-of-strike-that-killed-two-survivors",
    "timestamp": "2025-12-08T15:34:25Z"
  },
  {
    "title": "Africa expert comments on US-brokered peace deal",
    "description": "Despite a peace deal, sustainable stability in eastern DR Congo has yet to be achieved, Andrey Maslov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/629169-drc-rwanda-us-peace-deal/",
    "timestamp": "2025-12-08T15:33:05Z"
  },
  {
    "title": "Trump says to sign order blocking AI regulation by states",
    "description": "President Donald Trump said Monday he will attempt to strip states of the right to regulate the surging AI industry, arguing centralized rulemaking is vital to maintain US dominance. “There must be only One Rulebook if we are going to continue to lead in AI,”…",
    "link": "https://www.digitaljournal.com/business/trump-says-to-sign-order-blocking-ai-regulation-by-states/article",
    "timestamp": "2025-12-08T15:32:34Z"
  }
]