[
  {
    "title": "Lady Gaga joins Bad Bunny in Super Bowl half-time show",
    "description": "Bad Bunny was joined by pop icon Lady Gaga for a star-studded Super Bowl half-time show, performed almost entirely in Spanish and carrying a message of unity.",
    "link": "https://www.rte.ie/entertainment/2026/0209/1557431-lady-gaga-joins-bad-bunny-in-super-bowl-half-time-show/",
    "timestamp": "2026-02-09T07:38:56Z"
  },
  {
    "title": "Trump congratulates Takaichi on 'landslide victory' in election",
    "description": "U.S. President Donald Trump on Sunday congratulated Japanese Prime Minister Sanae Takaichi on her party's &quot;landslide victory&quot; in a general election and said it was his honor to endorse her days earlier. Trump wrote on social media that it was Takaic…",
    "link": "https://japantoday.com/category/politics/update3-trump-congratulates-japan%27s-takaichi-on-landslide-victory-in-election",
    "timestamp": "2026-02-09T07:37:15Z"
  },
  {
    "title": "Trump's T1 Smartphone Is Back With New Specs, But With Higher Price, Suspicious Manufacturing Claims",
    "description": "Former President Donald Trump's T1 phone resurfaces with upgraded specs, a bigger screen, a higher price, and a surprising shift in where it's made.",
    "link": "https://www.ibtimes.com.au/trumps-t1-smartphone-back-new-specs-higher-price-suspicious-manufacturing-claims-1861479",
    "timestamp": "2026-02-09T07:32:12Z"
  },
  {
    "title": "Trump describes Super Bowl halftime show celebrating unity as 'affront to Greatness of America'",
    "description": "Puerto Rican superstar Bad Bunny emphasised unity over division in his electric halftime show.",
    "link": "https://www.thejournal.ie/trump-describes-super-bowl-halftime-show-as-affront-to-the-greatness-of-america-6951190-Feb2026/",
    "timestamp": "2026-02-09T07:28:29Z"
  },
  {
    "title": "Seattle Seahawks soar to dominant Super Bowl win over New England Patriots",
    "description": "New England Patriots cannot step out of the shadow of the Tom Brady era.",
    "link": "https://www.the42.ie/seahawks-win-superbowl-new-england-patriots-6951170-Feb2026/",
    "timestamp": "2026-02-09T07:28:24Z"
  },
  {
    "title": "In the Arctic, the major climate threat of black carbon is overshadowed by geopolitical tensions",
    "description": "A coalition of nations and environmental groups is lobbying the International Maritime Organization to create regulations around black carbon, or soot, that spews from ships and blankets parts of glaciers and snow",
    "link": "https://abcnews.go.com/International/wireStory/arctic-major-climate-threat-black-carbon-overshadowed-geopolitical-129984087",
    "timestamp": "2026-02-09T07:25:37Z"
  },
  {
    "title": "The consequences of Takaichi's victory for Australia and the Asia-Pacific",
    "description": "A stomping victory by the ruling coalition government of Japanese Prime Minister Sanae Takaichi has opened the way for a major geo-strategic realignment in the Asia-Pacific region, with big implications for Australia.",
    "link": "https://www.abc.net.au/news/2026-02-09/japanese-pm-sanae-takaichi-s-election-victory/106323082",
    "timestamp": "2026-02-09T07:24:29Z"
  },
  {
    "title": "WATCH: Bad Bunny brings Puerto Rico celebration to Super Bowl stage",
    "description": "Bad Bunny celebrated Puerto Rican culture with a star-studded lineup of Lady Gaga, Ricky Martin, and Cardi B.",
    "link": "https://www.ewn.co.za/2026/02/09/watch-bad-bunny-brings-puerto-rico-celebration-to-super-bowl-stage",
    "timestamp": "2026-02-09T07:17:05Z"
  },
  {
    "title": "Jimmy Lai, Hong Kong pro-democracy figure, jailed for 20 years for national security offences",
    "description": "Critics say jail term represents how  dissent is being fiercely suppressed",
    "link": "https://www.irishtimes.com/world/asia-pacific/2026/02/09/jimmy-lai-hong-kong-pro-democracy-figure-sentenced-to-20-years-in-prison-for-national-security-offences/",
    "timestamp": "2026-02-09T07:17:00Z"
  },
  {
    "title": "Bad Bunny joined by Lady Gaga in star-studded Super Bowl half-time show",
    "description": "Bad Bunny was joined by pop icon Lady Gaga for a star-studded Super Bowl half-time show, performed almost entirely in Spanish and carrying a message of unity.",
    "link": "https://www.independent.ie/style/celebrity/celebrity-news/bad-bunny-joined-by-lady-gaga-in-star-studded-super-bowl-half-time-show/a1143131746.html",
    "timestamp": "2026-02-09T07:10:22Z"
  },
  {
    "title": "Bad Bunny’s Super Bowl performance angers Trump",
    "description": "Bad Bunny’s Spanish-language Super Bowl performance, a celebration of unity and Puerto Rican culture, drew the scorn of former President Donald Trump.\n\nRead More: https://punchng.com/bad-bunnys-super-bowl-performance-angers-trump/",
    "link": "https://punchng.com/bad-bunnys-super-bowl-performance-angers-trump/",
    "timestamp": "2026-02-09T07:08:45Z"
  },
  {
    "title": "Indian refiners skip Russian oil purchases – Reuters",
    "description": "State-run refiners including Indian Oil Corporation and Bharat Petroleum are reportedly not accepting offers for Russian oil from March Read Full Article at RT.com",
    "link": "https://www.rt.com/india/632190-indian-refiners-skip-russian-oil/",
    "timestamp": "2026-02-09T07:07:17Z"
  },
  {
    "title": "Ghislaine Maxwell to be questioned by US Congress behind closed doors today",
    "description": "Jeffrey Epstein’s accomplice will appear via video link from prison.",
    "link": "https://www.thejournal.ie/ghislaine-maxwell-2-6951183-Feb2026/",
    "timestamp": "2026-02-09T07:02:57Z"
  },
  {
    "title": "Roaming Charges: If You’re Not a Scumbag, You’re a Nobody",
    "description": "If the ranks of ICE had been filled by a draft, we wouldn't be seeing this kind of mass brutality. Normal human beings would recoil from committing daily acts of violence against defenseless people and would question the psychological health of those giving t…",
    "link": "https://www.counterpunch.org/2026/02/09/roaming-charges-127/",
    "timestamp": "2026-02-09T06:59:02Z"
  },
  {
    "title": "Migrants languish in US detention centres amid dire conditions, long waits",
    "description": "Felipe Hernandez Espinosa spent 45 days at \" Alligator Alcatraz,\" an immigration holding centre in Florida where detainees have reported worms in their food, toilets that don't flush and overflowing sewage. Mosquitoes and other insects are everywhere.\nFor the…",
    "link": "https://www.business-standard.com/world-news/migrants-languish-in-us-detention-centres-amid-dire-conditions-long-waits-126020900286_1.html",
    "timestamp": "2026-02-09T06:52:28Z"
  },
  {
    "title": "‘He intends to subvert the elections’: The pressure grows on Donald Trump",
    "description": "As criticism of the US president increases, so do warnings about how he could react, especially when it comes to November’s midterms",
    "link": "https://www.irishtimes.com/world/us/2026/02/09/he-intends-to-subvert-the-elections-the-pressure-grows-on-donald-trump/",
    "timestamp": "2026-02-09T06:52:15Z"
  },
  {
    "title": "Cuba halting airline refueling for month amid energy crisis",
    "description": "Cuba has warned airlines it is suspending jet fuel supplies for a month because of an energy crisis prompted by the U.S. attack on Venezuela, an official at a European carrier said.",
    "link": "https://www.hurriyetdailynews.com/cuba-halting-airline-refueling-for-month-amid-energy-crisis-218739",
    "timestamp": "2026-02-09T06:48:41Z"
  },
  {
    "title": "Japanese PM looks to translate election gains into a new conservative shift",
    "description": "Japanese Prime Minister Sanae Takaichi’s governing party has secured a two-thirds supermajority in a parliamentary election",
    "link": "https://abcnews.go.com/International/wireStory/japanese-prime-minister-takaichi-translate-election-gains-new-129983284",
    "timestamp": "2026-02-09T06:48:41Z"
  },
  {
    "title": "Kid Rock’s Alternative Super Bowl Show By Turning Point USA Sparks Backlash Online",
    "description": "“You can give your life to Jesus,” Kid Rock sang during what was branded as a patriotic All-American Halftime Show, organized by MAGA heavyweights.",
    "link": "https://www.boredpanda.com/turning-point-usa-kid-rock-alternative-super-bowl-show-sparks-backlash/",
    "timestamp": "2026-02-09T06:44:38Z"
  },
  {
    "title": "Logan and Jake Paul had vastly different feelings about Bad Bunny’s Super Bowl 2026 halftime show",
    "description": "The Paul brothers didn’t see eye-to-eye on Bad Bunny’s Super Bowl 2026 halftime show.",
    "link": "https://nypost.com/2026/02/09/sports/logan-jake-paul-differ-on-bad-bunnys-super-bowl-2026-halftime-show/",
    "timestamp": "2026-02-09T06:41:55Z"
  },
  {
    "title": "'Whiny Loser': Critics Mock Trump's Super-Triggered Meltdown Over Bad Bunny",
    "description": "The president had some very strong feelings about a performance that many people loved.",
    "link": "https://www.huffpost.com/entry/trump-bad-bunny-reaction_n_69895aaee4b0959e2d927684",
    "timestamp": "2026-02-09T06:41:55Z"
  },
  {
    "title": "Team USA's first openly queer female figure skater quits social media after anti-Trump comments sparked 'scary threats'",
    "description": "Team USA figure skater Amber Glenn has revealed she is taking a break from social media after receiving a 'scary amount of hate' for condemning Donald Trump over his treatment of the LGBTQ+ community. Glenn, who is the first openly-queer woman to compete for …",
    "link": "https://freerepublic.com/focus/f-chat/4366063/posts",
    "timestamp": "2026-02-09T06:37:28Z"
  },
  {
    "title": "Homebuying headaches and more DAA trouble for the minister",
    "description": "Business Digest: The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2026/02/09/homebuying-headaches-and-more-daa-trouble-for-the-minister/",
    "timestamp": "2026-02-09T06:32:55Z"
  },
  {
    "title": "Donald Trump calls for immediate NFL rule change after what he saw in Super Bowl 60",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_f14db78b-9cd5-4040-9756-1e7f59420733",
    "timestamp": "2026-02-09T06:30:00Z"
  },
  {
    "title": "Jimmy Lai Sentenced in Hong Kong National Security Trial",
    "description": "Jimmy Lai, the pro-democracy former Hong Kong media tycoon and a fierce critic of Beijing, was sentenced to 20 years in prison in the longest punishment given so far under a China-imposed national security law that has virtually silenced the city's dissent, t…",
    "link": "https://www.newser.com/story/383358/jimmy-lai-sentenced-in-hong-kong-national-security-trial.html",
    "timestamp": "2026-02-09T06:30:00Z"
  },
  {
    "title": "Leading China critic Jimmy Lai sentenced to 20 years in jail after Hong Kong security trial",
    "description": "Hong Kong's most vocal China critic, media tycoon Jimmy Lai, was sentenced on Monday to 20 years in jail, ending the city's biggest national security case which drew international concern about the city's freedoms and autonomy.",
    "link": "https://www.independent.ie/world-news/asia-pacific/leading-china-critic-jimmy-lai-sentenced-to-20-years-in-jail-after-hong-kong-security-trial/a534079286.html",
    "timestamp": "2026-02-09T06:29:50Z"
  },
  {
    "title": "Japan PM Takaichi eyes defence, immigration reforms after landslide win",
    "description": "Japanese Prime Minister Sanae Takaichi's gamble that her personal popularity would lead to big election gains for her struggling party paid off hugely.\nOn Monday, she began the process of translating that new power, made manifest in a two-thirds supermajority…",
    "link": "https://www.business-standard.com/world-news/japan-pm-takaichi-eyes-defence-immigration-reforms-after-landslide-win-126020900295_1.html",
    "timestamp": "2026-02-09T06:25:24Z"
  },
  {
    "title": "Japan’s Takaichi vows to deliver on tax cuts after LDP’s ‘historic’ win",
    "description": "LDP looks set to secure 316 seats in Japan's 500-member house, marking its best result since its founding in 1955.",
    "link": "https://www.aljazeera.com/news/2026/2/9/japans-takaichi-vows-to-deliver-on-tax-cuts-after-ldps-historic-win",
    "timestamp": "2026-02-09T06:23:12Z"
  },
  {
    "title": "A landslide in Japan",
    "description": "Win will help Sanae Takaichi to implement her controversial plans for tax cuts and increased defence spending",
    "link": "https://www.irishtimes.com/world/2026/02/09/japanese-prime-ministers-gamble-pays-off-with-snap-election-victory/",
    "timestamp": "2026-02-09T06:12:24Z"
  },
  {
    "title": "US Appeals Court Rejects Challenge to Trump’s Efforts to Ban DEI",
    "description": "A federal appeals court on Friday rejected a challenge to a move by President Donald Trump’s administration to ban diversity, equity and inclusion programs at federal agencies and businesses with government contracts. A three-judge panel of the Richmond, Virg…",
    "link": "https://www.insurancejournal.com/news/national/2026/02/09/857319.htm",
    "timestamp": "2026-02-09T06:06:58Z"
  },
  {
    "title": "You Watched the Bad Bunny Super Bowl Show. I Watched the “All-American” One. Oh My God.",
    "description": "It was absolutely brutal.",
    "link": "https://slate.com/culture/2026/02/super-bowl-2026-halftime-bad-bunny-show.html",
    "timestamp": "2026-02-09T06:05:46Z"
  },
  {
    "title": "I Watched the “All-American” Super Bowl Halftime Show. It Was Even More Embarrassing Than You Imagined.",
    "description": "It was absolutely brutal.",
    "link": "https://slate.com/culture/2026/02/super-bowl-2026-half-time-bad-bunny-show.html",
    "timestamp": "2026-02-09T06:05:46Z"
  },
  {
    "title": "High Irish house prices driven by bidding wars, and why tattoos could affect the immune system",
    "description": "Early Edition with Aideen Finnegan",
    "link": "https://www.irishtimes.com/podcasts/early-edition/high-irish-house-prices-driven-by-bidding-wars-and-why-tattoos-could-affect-the-immune-system/",
    "timestamp": "2026-02-09T06:05:00Z"
  },
  {
    "title": "Trump said Bad Bunny's Super Bowl performance made 'no sense,' but his iconography spoke volumes",
    "description": "Bad Bunny celebrated Puerto Rico at the 2026 Super Bowl, where he became the first Spanish-speaking solo artist to headline the halftime show. Trump hated it.",
    "link": "https://www.businessinsider.com/bad-bunny-super-bowl-halftime-show-review-puerto-rico-spanish-2026-2",
    "timestamp": "2026-02-09T06:03:52Z"
  },
  {
    "title": "Trump Demands $1 Billion From Harvard as Prolonged Standoff Appears to Deepen",
    "description": "President Donald Trump is demanding a $1 billion payment from Harvard University to end his prolonged standoff with the Ivy League campus, doubling the amount he sought previously as both sides appear to move further from reaching a deal. The …",
    "link": "https://www.insurancejournal.com/news/east/2026/02/09/857321.htm",
    "timestamp": "2026-02-09T06:00:48Z"
  },
  {
    "title": "Shannon Airport used for refuelling Ice deportation flights 10 times in past year",
    "description": "The controversial agency chartered small private aircraft for the removal operations",
    "link": "https://www.irishtimes.com/ireland/2026/02/09/shannon-airport-used-for-refuelling-ice-deportation-flights-10-times-in-past-year/",
    "timestamp": "2026-02-09T06:00:00Z"
  },
  {
    "title": "The Unfeeling Calculus of Superintelligence: Why AI Doesn’t Hate You, You’re Just Resource Competition",
    "description": "Introduction: The Ant Hill of Humanity We are told to fear a vengeful, Skynet-style artificial intelligence, a malicious digital god that despises humanity and seeks our destruction out of spite. This is a comforting narrative because it implies a familiar, a…",
    "link": "https://www.naturalnews.com/2026-02-09-the-unfeeling-calculus-of-superintelligence-resource-competition.html",
    "timestamp": "2026-02-09T06:00:00Z"
  },
  {
    "title": "White House denies plans for ICE polling place presence but leaves door open",
    "description": "The Trump administration clarified it has no current plans to station ICE agents at polling locations during the midterm elections. Press Secretary Karoline Leavitt dismissed speculation as a “silly hypothetical” but did not rule out federal presence entirely…",
    "link": "https://www.naturalnews.com/2026-02-09-white-house-denies-ice-polling-place-presence.html",
    "timestamp": "2026-02-09T06:00:00Z"
  },
  {
    "title": "Apparel industry lauds India-US interim trade agreement, call it \"father of all deals\"",
    "description": "He highlighted that the deal is a significant moment for the Apparel sector, which has faced challenges over the past six months due to 25% US tariffs causing turmoil among exporters.",
    "link": "https://www.thehindubusinessline.com/economy/apparel-industry-lauds-india-us-interim-trade-agreement-call-it-father-of-all-deals/article70609738.ece",
    "timestamp": "2026-02-09T05:59:44Z"
  },
  {
    "title": "Trump calls Olympic skier a ‘real loser’",
    "description": "US President Donald Trump has said Olympic skier Hunter Hess is a “real loser” over comments Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632186-trump-calls-olympic-skier-real/",
    "timestamp": "2026-02-09T05:56:39Z"
  },
  {
    "title": "‘Very Hard To Root For Someone Like This’: President Trump Blasts ‘Real Loser’ Hunter Hess For Anti-American Nonsense",
    "description": "When it comes to the drama surrounding Team USA freestyle skier Hunter Hess, President Donald Trump is letting it all out, and quite frankly, I don't blame him.",
    "link": "https://dailycaller.com/2026/02/09/president-donald-trump-hunter-hess-olympics/",
    "timestamp": "2026-02-09T05:56:07Z"
  },
  {
    "title": "Hong Kong sentences pro-democracy mogul Jimmy Lai to 20 years in jail",
    "description": "A Hong Kong court sentenced pro-democracy media mogul Jimmy Lai to 20 years in prison on Monday for national security crimes, a punishment rights groups condemned as \"effectively a death sentence\" and a symbol of the city's shrivelling press freedoms.",
    "link": "https://www.hurriyetdailynews.com/hong-kong-sentences-pro-democracy-mogul-jimmy-lai-to-20-years-in-jail-218734",
    "timestamp": "2026-02-09T05:55:00Z"
  },
  {
    "title": "Japan PM Takaichi basks in historic election triumph",
    "description": "Japan's Prime Minister Sanae Takaichi savoured an election landslide Monday, with her ruling party projected to have won a two-thirds majority in the powerful lower house for the first time in its history.",
    "link": "https://www.hurriyetdailynews.com/japan-pm-takaichi-basks-in-historic-election-triumph-218733",
    "timestamp": "2026-02-09T05:51:12Z"
  },
  {
    "title": "Donald Trump could deflect Maga criticism of AI for the loss of jobs in US towards Ireland",
    "description": "If the AI sector collapses, Trump might try to blame over-regulation in Europe",
    "link": "https://www.irishtimes.com/business/2026/02/09/donald-trump-could-deflect-maga-criticism-of-ai-for-the-loss-of-jobs-in-us-towards-ireland/",
    "timestamp": "2026-02-09T05:51:00Z"
  },
  {
    "title": "Iran defies US threats to insist on right to enrich uranium",
    "description": "Iranian Foreign Minister Abbas Araghchi on Sunday ruled out Tehran ever giving up uranium enrichment in its negotiations with Washington, insisting it will not be intimidated by the threat of war with the United States.",
    "link": "https://www.hurriyetdailynews.com/iran-defies-us-threats-to-insist-on-right-to-enrich-uranium-218732",
    "timestamp": "2026-02-09T05:47:29Z"
  },
  {
    "title": "The Bad Bunny Super Bowl Was a Needed Respite From Trump",
    "description": "President Trump didn’t attend the Super Bowl this year. And Will Leitch writes that at Levi’s Stadium, the whole production — highlighted by Bad Bunny’s halftime show — felt packed with stuff Trump would hate,",
    "link": "http://nymag.com/intelligencer/article/bad-bunny-super-bowl-trump-patriots-seahawks.html",
    "timestamp": "2026-02-09T05:45:26Z"
  },
  {
    "title": "US lawmakers to question Ghislaine Maxwell over Epstein ties",
    "description": "Ghislaine Maxwell is set for a closed-door deposition by the US Congress regarding her ties to Jeffrey Epstein but is expected to plead the Fifth.\n\nRead More: https://punchng.com/us-lawmakers-to-question-ghislaine-maxwell-over-epstein-ties/",
    "link": "https://punchng.com/us-lawmakers-to-question-ghislaine-maxwell-over-epstein-ties/",
    "timestamp": "2026-02-09T05:44:52Z"
  },
  {
    "title": "Akhilesh Yadav slams India-US trade deal; says ‘Make in India’ abandoned",
    "description": "Samajwadi Party chief Akhilesh Yadav criticizes the new US-India trade deal. He claims India's market is being handed to America, undermining the 'Make in India' initiative. Yadav questions the government's priorities, highlighting imports of animal feed desp…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/akhilesh-yadav-slams-india-us-trade-deal-says-make-in-india-abandoned/articleshow/128099190.cms",
    "timestamp": "2026-02-09T05:43:48Z"
  },
  {
    "title": "Bad Bunny's Super Bowl 2026 Show Was a Joyful Act of Resilience—and Resistance",
    "description": "It was one of the most feverishly-anticipated, instantly-controversial halftime shows in history. You didn’t need to know Spanish to grasp the message: Puerto Rico is America; fiesta is a form of protest; joy is a kind of rebellion.",
    "link": "https://www.vanityfair.com/culture/story/bad-bunny-super-bowl-halftime-2026",
    "timestamp": "2026-02-09T05:42:55Z"
  },
  {
    "title": "'Take the vaccine, please,' a top US health official says in an appeal as measles cases rise",
    "description": "A leading U.S. health official on Sunday urged people to get inoculated against the measles at a time of outbreaks across several states and as the United St...",
    "link": "https://www.aol.com/articles/vaccine-please-top-us-health-200554805.html",
    "timestamp": "2026-02-09T05:40:37Z"
  },
  {
    "title": "Hole in government approach: Congress' dig over ministers' remarks on Russian oil",
    "description": "The Congress party has criticized the government's handling of the Russian oil issue and the India-US trade deal. Party leader Jairam Ramesh stated there is a 'hole in government' approach. This comes as India plans to buy US energy products and aircraft over…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/hole-in-government-approach-congress-dig-over-ministers-remarks-on-russian-oil/articleshow/128099252.cms",
    "timestamp": "2026-02-09T05:37:31Z"
  },
  {
    "title": "North Carolina Republicans to question Charlotte leaders on crime after train stabbings",
    "description": "North Carolina Republican legislators are set to question Charlotte-area leaders about crime-fighting tactics and spending",
    "link": "https://abcnews.go.com/Politics/wireStory/north-carolina-republicans-question-charlotte-leaders-crime-after-129982912",
    "timestamp": "2026-02-09T05:33:32Z"
  },
  {
    "title": "US-Russia nuclear pact expires: What is New START treaty and why it matters",
    "description": "The New Strategic Arms Reduction Treaty, commonly known as New START, was the last major nuclear arms control agreement between the United States and Russia",
    "link": "https://www.business-standard.com/world-news/us-russia-nuclear-pact-expires-start-new-treaty-why-it-matters-126020900278_1.html",
    "timestamp": "2026-02-09T05:32:34Z"
  },
  {
    "title": "Bad Bunny’s Super Bowl halftime show delivers a party with a message of love",
    "description": "While the reason to tune in to the Super Bowl on Sunday night was ostensibly to watch the Seattle Seahawks and New England Patriots duke it out for the NFL championship, the buzz leading up to the broadcast was all about the music. In September, it was announ…",
    "link": "https://triblive.com/sports/nfl/bad-bunnys-super-bowl-halftime-show-delivers-a-party-with-a-message-of-love/",
    "timestamp": "2026-02-09T05:32:18Z"
  },
  {
    "title": "Maeve McTaggart: Will Micheál Martin lead Fianna Fáil into the next election? He has to navigate Trump, by-elections and an EU presidency first",
    "description": "Taoiseach Micheál Martin is facing some tough decisions, not least about his approach to US president Donald Trump in the Oval Office next month.",
    "link": "https://www.independent.ie/opinion/analysis/maeve-mctaggart-will-micheal-martin-lead-fianna-fail-into-the-next-election-he-has-to-navigate-trump-by-elections-and-an-eu-presidency-first/a1933474912.html",
    "timestamp": "2026-02-09T05:30:00Z"
  },
  {
    "title": "Migrants languish in US detention centers amid dire conditions and prolonged waits",
    "description": "Prolonged detention has become more common in President Donald Trump’s second term, at least partly because a new policy generally prohibits immigration judges from releasing detainees while their deportation cases wind through backlogged courts",
    "link": "https://abcnews.go.com/US/wireStory/migrants-languish-us-detention-centers-amid-dire-conditions-129983010",
    "timestamp": "2026-02-09T05:25:35Z"
  },
  {
    "title": "Cuba halts airline refuelling as US punishment takes toll",
    "description": "Airlines flying long haul from Cuba must now add extra refuelling stops.",
    "link": "https://www.nzherald.co.nz/business/companies/airlines/cuba-halts-airline-refuelling-as-us-punishment-takes-toll/47IUG74XANDPDLEE3F3JHYNY5E/",
    "timestamp": "2026-02-09T05:23:58Z"
  },
  {
    "title": "Hong Kong’s legal clampdown on Jimmy Lai, tycoon and China critic",
    "description": "By Jessie Pang and James PomfretHONG KONG, Feb 9 (Reuters) - Hong Kong’s High Court on Monday sentenced media tycoon and China critic Jimmy Lai to 20 years in jail for tw… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/09/hong-kong-s-legal-clampdown-on-jimmy-lai-tycoon-and-china-critic",
    "timestamp": "2026-02-09T05:22:45Z"
  },
  {
    "title": "Bad Bunny sends a harsh message to Drake Maye after his disastrous performance at Super Bowl LX",
    "description": "It was clear that the Seattle Seahawks were the favorites to take Super Bowl LX, and there were no surprises. From start to finish, they dominated the New England Patriots. By the",
    "link": "https://www.marca.com/en/nfl/new-england-patriots/2026/02/09/69896dfcca4741ed468b45e7.html",
    "timestamp": "2026-02-09T05:22:25Z"
  },
  {
    "title": "Bad Bunny’s Super Bowl Performance Wasn’t What Conservatives Feared. It Was Something Else Entirely.",
    "description": "The Puerto Rican superstar’s halftime show was pure joy.",
    "link": "https://slate.com/culture/2026/02/super-bowl-2026-bad-bunny-halftime-show-lady-gaga-liam-ricky-martin-trump.html",
    "timestamp": "2026-02-09T05:21:42Z"
  },
  {
    "title": "US Stocks Today | Fed to take its time on trimming bond holdings, Bessent says",
    "description": "The U.S. Federal Reserve is unlikely to quickly shrink its balance sheet, even if Kevin Warsh — a critic of bond-buying programmes — takes a leadership role, Treasury Secretary Scott Bessent said. Major decisions could take up to a year, and the Fed is expect…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-stocks-today-fed-to-take-its-time-on-trimming-bond-holdings-bessent-says/articleshow/128098300.cms",
    "timestamp": "2026-02-09T05:09:11Z"
  },
  {
    "title": "The Undeniable Fun of Bad Bunny’s Super Bowl Halftime Show",
    "description": "Bad Bunny’s critics said his Super Bowl halftime show would be divisive. They were totally wrong.",
    "link": "https://www.theatlantic.com/culture/2026/02/bad-bunny-super-bowl-halftime-show/685929/",
    "timestamp": "2026-02-09T05:07:34Z"
  },
  {
    "title": "Our Enduring Nuclear Nightmare: The End of New START",
    "description": "It’s the height of naivety to believe that a global system built on the supposed security of nuclear weapons can endure indefinitely",
    "link": "https://www.juancole.com/2026/02/enduring-nuclear-nightmare.html",
    "timestamp": "2026-02-09T05:04:45Z"
  },
  {
    "title": "Japan's prime minister secures historic election victory",
    "description": "Japanese Prime Minister Sanae Takaichi's coalition has swept to a historic election win, paving the way for promised tax cuts that have spooked financial markets and ⁠military spending aimed at countering China.",
    "link": "https://www.rte.ie/news/asia/2026/0209/1557425-japan-election-victory/",
    "timestamp": "2026-02-09T05:02:10Z"
  },
  {
    "title": "Japan's prime minister secures historic election victory",
    "description": "Japanese Prime Minister Sanae Takaichi's coalition has swept to a historic election win, paving the way for promised tax cuts that have spooked financial markets, and ⁠military spending aimed at countering China.",
    "link": "https://www.rte.ie/news/asia/2026/0209/1557425-japan-election/",
    "timestamp": "2026-02-09T05:02:10Z"
  },
  {
    "title": "Crude oil prices decline as US-Iran talks ease supply concerns",
    "description": "At 9.58 am on Monday, April Brent oil futures were at $67.36, down by 1.01%, and March crude oil futures on WTI (West Texas Intermediate) were at $62.93, down by 0.98%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-prices-decline-as-us-iran-talks-ease-supply-concerns/article70609633.ece",
    "timestamp": "2026-02-09T04:46:36Z"
  },
  {
    "title": "Prime Minister Christopher Luxon says New Zealand is ‘going to need support’, ‘capital investment’ for critical mineral sector as talks with US continue",
    "description": "NZ will require capital \"from domestic purposes and overseas purposes to do that\".",
    "link": "https://www.nzherald.co.nz/nz/politics/prime-minister-christopher-luxon-says-new-zealand-is-going-to-need-support-capital-investment-for-critical-mineral-sector-as-talks-with-us-continue/premium/IZKZO5VJZJBQTM5A2URW4HBS6A/",
    "timestamp": "2026-02-09T04:43:26Z"
  },
  {
    "title": "Donald Trump criticises Bad Bunny's Super Bowl halftime show as \"slap in the face to our country\"",
    "description": "In a scathing post on Truth Social, Donald Trump criticizes Bad Bunny's Super Bowl halftime show, calling it a 'slap in the face' to America and an affront to national greatness. Explore his controversial remarks on music, choreography, and media praise.",
    "link": "https://timesofindia.indiatimes.com/entertainment/english/music/news/donald-trump-criticises-bad-bunnys-super-bowl-halftime-show-as-slap-in-the-face-to-our-country/articleshow/128096293.cms",
    "timestamp": "2026-02-09T04:42:16Z"
  },
  {
    "title": "‘Slap in the face’: Trump on Bad Bunny’s Super Bowl LX halftime show as Seahawks crush Patriots",
    "description": "The Super Bowl’s half-time show will also be talked about for years, thanks to a half-time performance from Bad Bunny that was criticised by US President Donald Trump and featured a real wedding.",
    "link": "https://indianexpress.com/article/sports/sport-others/slap-in-the-face-trump-on-bad-bunnys-super-bowl-lx-halftime-show-as-seahawks-crush-patriots-10521838/",
    "timestamp": "2026-02-09T04:41:19Z"
  },
  {
    "title": "The Triumph Of Bad Bunny’s Unapologetically Boricua Halftime Show",
    "description": "The Puerto Rican artist’s history-making Super Bowl performance was a reclamation and a reminder that after more than 500 years of colonization, seguimos aquí.",
    "link": "http://www.thecut.com/article/bad-bunny-super-bowl-halftime-puerto-rico-meaning-references.html",
    "timestamp": "2026-02-09T04:37:56Z"
  },
  {
    "title": "Bad Bunny's Super Bowl half-time show features surprise guests",
    "description": "Global superstar Bad Bunny performs at the Super Bowl LX, sharing the stage with surprise guests Lady Gaga and Ricky Martin, while a couple weds on stage.",
    "link": "https://www.abc.net.au/news/2026-02-09/bad-bunny-super-bowl-half-time-show-lady-gaga-ricky-martin/106321192",
    "timestamp": "2026-02-09T04:36:54Z"
  },
  {
    "title": "NSA detected foreign intelligence phone call about a person close to Trump",
    "description": "Whistleblower says that Tulsi Gabbard blocked agency from sharing report and delivered it to White House chief of staff Last spring, the National Security Agency (NSA) flagged an unusual phone call between two members of foreign intelligence, who discussed a …",
    "link": "https://freerepublic.com/focus/f-news/4366052/posts",
    "timestamp": "2026-02-09T04:36:48Z"
  },
  {
    "title": "The Best Thing About the Super Bowl Halftime Show Was Trump’s Response to It",
    "description": "President Donald Trump didn't hold back when he took to Truth Social Sunday night to slam what just might go...",
    "link": "https://pjmedia.com/matt-margolis/2026/02/08/the-best-thing-about-the-super-bowl-half-time-show-was-trumps-response-to-it-n4949278",
    "timestamp": "2026-02-09T04:34:14Z"
  },
  {
    "title": "Cuba warns airlines of fuel shortage as Nicaragua ends easy entry",
    "description": "The communist government warned international airlines they can no longer refuel at its main airport in Havana for the next month after Donald Trump threatened tariffs on any nation that supplies Cuba",
    "link": "https://www.business-standard.com/world-news/cuba-warns-airlines-of-fuel-shortage-as-nicaragua-ends-easy-entry-126020900206_1.html",
    "timestamp": "2026-02-09T04:34:10Z"
  },
  {
    "title": "Bessent suggests Warsh nomination hearings alongside Powell probe",
    "description": "US Treasury Secretary Scott Bessent has suggested a start to Kevin Warsh’s Fed chair confirmation hearings despite the DOJ probe into Jerome Powell.",
    "link": "https://cointelegraph.com/news/bessent-suggests-warsh-nomination-hearings-alongside-powell-probe",
    "timestamp": "2026-02-09T04:33:37Z"
  },
  {
    "title": "Hong Kong ex-media tycoon Jimmy Lai sentenced to 20 years in prison in national security case",
    "description": "Jimmy Lai, the pro-democracy former Hong Kong media tycoon and a fierce critic of Beijing, was sentenced to 20 years in prison in one of the most prominent cases under a China-imposed national security law that has virtually silenced the city’s dissent. Three…",
    "link": "https://japantoday.com/category/world/hong-kong-media-mogul-jimmy-lai-faces-sentencing-in-landmark-national-security-case",
    "timestamp": "2026-02-09T04:30:04Z"
  },
  {
    "title": "Kacey Musgraves Disses Kid Rock as She Praises Bad Bunny Super Bowl 2026 Halftime Show",
    "description": "Kacey Musgraves is reacting to the two Halftime Shows. While Bad Bunny headlined the Halftime Show at the 2026 Super Bowl on Sunday (February 8), Kid Rock was one of the performers at Turning Point USA All American Halftime Show, which aired at the same time …",
    "link": "https://www.justjared.com/2026/02/08/kacey-musgraves-disses-kid-rock-as-she-praises-bad-bunny-super-bowl-2026-halftime-show/",
    "timestamp": "2026-02-09T04:29:22Z"
  },
  {
    "title": "US Olympians speaking up about politics at home face online backlash — including from Trump",
    "description": "The U.S. Olympic Committee said it is working to address the abusive messages directed at the athletes.U.S. President Donald Trump on Sunday said that it is hard to cheer for American Olympians who are speaking out against administration policies, calling one…",
    "link": "https://freerepublic.com/focus/f-chat/4366051/posts",
    "timestamp": "2026-02-09T04:23:22Z"
  },
  {
    "title": "Indices trade firm in early trade; breadth strong",
    "description": "Barring FMCG index the lone laggard, all the sectoral indices on the NSE were traded in green.",
    "link": "https://www.business-standard.com/markets/capital-market-news/indices-trade-firm-in-early-trade-breadth-strong-126020900193_1.html",
    "timestamp": "2026-02-09T04:21:40Z"
  },
  {
    "title": "“So He Did Watch?”: Bad Bunny’s Super Bowl 2026 Halftime Show Sparks Trump’s Fury",
    "description": "Donald Trump ignited a political firestorm after labeling Bad Bunny’s Super Bowl performance the \"worst ever.\"",
    "link": "https://www.boredpanda.com/bad-bunnys-super-bowl-halftime-show-ignites-trumps-fury/",
    "timestamp": "2026-02-09T04:20:54Z"
  },
  {
    "title": "Bad Bunny’s All-American Super Bowl Halftime Show",
    "description": "Kelefa Sanneh reviews performances at the 2026 game, featuring Lady Gaga, Ricky Martin, Cardi B, and Pedro Pascal, and at the Turning Point USA show, featuring Kid Rock.",
    "link": "https://www.newyorker.com/culture/the-lede/2026-super-bowl-halftime-show-bad-bunny",
    "timestamp": "2026-02-09T04:19:54Z"
  },
  {
    "title": "The Super Bowl Ads Last Year Welcomed Donald Trump’s Return. What a Difference a Year Makes.",
    "description": "Regrettably, I must support the Dunkin' commercial.",
    "link": "https://slate.com/business/2026/02/super-bowl-2026-commercial-ads-video-halftime.html",
    "timestamp": "2026-02-09T04:13:20Z"
  },
  {
    "title": "Japan’s Takaichi may struggle to soothe voters and markets",
    "description": "Japanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi’s election triumph, but experts warned that the country’s first woman leader could struggle to keep both voters and markets happy. In its best result since its founding in 1955,…",
    "link": "https://www.digitaljournal.com/world/japans-takaichi-may-struggle-to-soothe-voters-and-markets/article",
    "timestamp": "2026-02-09T04:12:32Z"
  },
  {
    "title": "Iran Sentences Nobel Peace Prize Laureate To More Than 7 Years In Prison",
    "description": "Narges Mohammadi was arrested in December at a ceremony honoring Khosrow Alikordi, a 46-year-old Iranian lawyer and human rights advocate.",
    "link": "https://www.huffpost.com/entry/iran-narges-mohammadi-prison-sentence_n_69895b39e4b02d49a7780c7a",
    "timestamp": "2026-02-09T04:09:23Z"
  },
  {
    "title": "Elmo Getting Trolled by MAGA Over Bad Bunny/SBLX Love (Seriously)",
    "description": "We have a feeling that Bad Bunny could give a rat's ass what Donald Trump thought about his performance during the Super Bowl LX Apple Music Halftime Show – especially when you have the support of Elmo from Sesame Street. \"That Bunny was AMAZING. Elmo thinks …",
    "link": "https://bleedingcool.com/tv/elmo-getting-trolled-by-maga-over-bad-bunny-sblx-love-seriously/",
    "timestamp": "2026-02-09T04:08:09Z"
  },
  {
    "title": "Review: Bad Bunny brought Puerto Rico's history and culture to a revolutionary Super Bowl show",
    "description": "Bad Bunny delivered a historic performance at the Levi’s Stadium in Santa Clara, California, for the 2026 Super Bowl halftime show that brought Puerto Rican culture and history to the fore",
    "link": "https://abcnews.go.com/Entertainment/wireStory/review-bad-bunny-brought-puerto-ricos-history-culture-129979091",
    "timestamp": "2026-02-09T03:57:42Z"
  },
  {
    "title": "Super Bowl LX\nBad Bunny's Super Bowl halftime show ignites Trump's fury, divides viewers",
    "description": "The Super Bowl LX halftime show featuring Latin trap artist Bad Bunny was the subject of immense criticism from Americans on Sunday night. President Donald Trump called it \"one of the worst ever.\" The Super Bowl Halftime Show is absolutely terrible, one of th…",
    "link": "https://freerepublic.com/focus/f-chat/4366049/posts",
    "timestamp": "2026-02-09T03:56:48Z"
  },
  {
    "title": "Japan's 'Iron Lady' Sanae Takaichi achieves a historic election victory",
    "description": "Japanese Prime Minister Sanae Takaichi's coalition government achieved a historic victory in Sunday's general election, a result that will pave the way for increased military spending against China and the implementation of tax cut promises that have rattled …",
    "link": "https://english.gossiplankanews.com/2026/02/japans-iron-lady-sanae-takaichi.html",
    "timestamp": "2026-02-09T03:55:22Z"
  },
  {
    "title": "Stephen Miller: The aide driving Donald Trump's most controversial policies - BBC",
    "description": "Stephen Miller: The aide driving Donald Trump's most controversial policiesBBC 'Trump's psyche': The aide driving president's most controversial policiesBBC Stephen Miller’s uses ‘gory’ images to persuade Trump in messages to presidentThe Independent How Step…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180759136",
    "timestamp": "2026-02-09T03:53:13Z"
  },
  {
    "title": "Is Netanyahu's trip to Washington a game of persuasion or an attempt at coordination?",
    "description": "Several high-level Israeli visits to the U.S. may indicate close operational and intelligence coordination between countries, but it seems the U.S. will not carry out an attack on Iran before it has exhausted diplomatic options. So how much does Israel really…",
    "link": "https://www.haaretz.com/israel-news/israel-security/2026-02-09/ty-article/.premium/is-netanyahus-trip-to-washington-a-game-of-persuasion-or-coordination/0000019c-3e99-dfa4-a5bc-3edba53e0000",
    "timestamp": "2026-02-09T03:50:42Z"
  },
  {
    "title": "Bad Bunny makes history at Super Bowl with Spanish performance - as Trump blasts it 'absolutely terrible'",
    "description": "The rapper performed on a heavily Puerto Rican-inspired stage set up at Levi's Stadium in California - with Trump saying 'nobody understands a word this guy is saying'.",
    "link": "https://news.sky.com/story/bad-bunny-makes-history-at-super-bowl-with-spanish-performance-as-trump-blasts-it-absolutely-terrible-13505139",
    "timestamp": "2026-02-09T03:48:00Z"
  },
  {
    "title": "Hamas leader Mashaal rejects Trump disarmament plan",
    "description": "Senior Hamas leader Khaled Mashaal rejects President Trump’s call for Hamas to disarm, vowing to defeat Israel and defending Hamas’s October 7 massacre.",
    "link": "https://www.israelnationalnews.com/news/422141",
    "timestamp": "2026-02-09T03:47:32Z"
  },
  {
    "title": "Trump criticizes Olympic skier who said representing the U.S. 'brings up mixed emotions'",
    "description": "President Donald Trump called U.S.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-criticizes-olympic-skier-hunter-hess-rcna258083",
    "timestamp": "2026-02-09T03:43:18Z"
  },
  {
    "title": "Trump Calls Bad Bunny’s Halftime Performance an “Affront to the Greatness of America”",
    "description": "Trump previously said he planned to watch Kid Rock's \"All-American Halftime Show.\"\nTrump Calls Bad Bunny’s Halftime Performance an “Affront to the Greatness of America”\nScoop Harrison",
    "link": "https://consequence.net/2026/02/trump-bad-bunny-super-bowl/",
    "timestamp": "2026-02-09T03:42:03Z"
  },
  {
    "title": "The Race Is On: Artemis, China and Musk Turn the Moon Into the Next Strategic High Ground",
    "description": "New York NY (SPX) Feb 09, 2026\n\nWhen Artemis II finally lights its engines and arcs away from Cape Canaveral, it will do more than send four astronauts on a ten-day loop around the Moon. It will fire the starting gun on a race that Washington and Beijing stil…",
    "link": "https://www.spacedaily.com/reports/The_Race_Is_On_Artemis_China_and_Musk_Turn_the_Moon_Into_the_Next_Strategic_High_Ground_999.html",
    "timestamp": "2026-02-09T03:39:35Z"
  }
]