[
  {
    "title": "US SOUTHCOM Chief Visited Venezuela",
    "description": "Gen. Francis Donovan, head of US Southern Command, visited Venezuela alongside diplomatic envoy Laura Dogu and Pentagon official Joseph Humire for direct talks with interim authorities.",
    "link": "https://sputnikglobe.com/20260219/us-southcom-chief-visited-venezuela-1123655909.html",
    "timestamp": "2026-02-19T03:57:00Z"
  },
  {
    "title": "Republican Gov Hits Back At Trump Official Trying to Limit State’s Rights: I’ll ‘Beat You In Court’",
    "description": "“Let me be clear, I will use every resource within my disposal as governor of the sovereign state of Utah, and under the Constitution of the United States to beat you in court”\nThe post Republican Gov Hits Back At Trump Official Trying to Limit State’s Rights…",
    "link": "https://www.mediaite.com/media/news/republican-gov-hits-back-at-trump-official-trying-to-limit-states-rights-ill-beat-you-in-court/",
    "timestamp": "2026-02-19T03:54:15Z"
  },
  {
    "title": "Sierra Club, Partners Sue EPA Over Illegal Repeal of Climate Protections",
    "description": "Washington, DC — A broad coalition of health and environmental groups sued the Environmental Protection Agency today over its illegal determination that it is not responsible for protecting us from climate pollution and its elimination of rules to cut the tai…",
    "link": "https://cleantechnica.com/2026/02/18/sierra-club-partners-sue-epa-over-illegal-repeal-of-climate-protections/",
    "timestamp": "2026-02-19T03:50:08Z"
  },
  {
    "title": "Here’s the Proof Trump Knows He’s Doomed: Rothkopf",
    "description": "Donald Trump is trying to chip away at the integrity of the voting process ahead of the November midterms because he knows Republicans will not fare well...",
    "link": "https://www.thedailybeast.com/heres-the-proof-trump-knows-hes-doomed-rothkopf/",
    "timestamp": "2026-02-19T03:42:57Z"
  },
  {
    "title": "Where the US is building up military force near Iran",
    "description": "The U.S. military has significantly bolstered its forces near Iran, deploying two aircraft carrier strike groups and numerous warships. This buildup, including advanced fighter jets and drones, raises questions about President Trump's potential military objec…",
    "link": "https://economictimes.indiatimes.com/news/defence/where-the-us-is-building-up-military-force-near-iran/articleshow/128537447.cms",
    "timestamp": "2026-02-19T03:39:32Z"
  },
  {
    "title": "Expert reveals the Trump FCC crusader's airtime battles could backfire spectacularly",
    "description": "A media expert revealed on Wednesday that President Donald Trump's leader at the Federal Communications Commission may have created a situation that will backfire spectacularly. Throughout the second Trump administration, FCC Commissioner Brendan Carr has sou…",
    "link": "https://www.rawstory.com/brendan-carr-2675282650/",
    "timestamp": "2026-02-19T03:36:37Z"
  },
  {
    "title": "Ron DeSantis shrugs off Andy Beshear’s late-night jab: ‘I wear it as a badge of honor.’",
    "description": "During an interview on “The Daily Show,” host Jon Stewart asked Beshear which governor he believed was the worst. “Who’s the one where, like, you guys are at the governor’s conference and the elevator opens, and he’s about to walk in, and you just go – or she…",
    "link": "https://freerepublic.com/focus/f-news/4367416/posts",
    "timestamp": "2026-02-19T03:36:00Z"
  },
  {
    "title": "Gov. Beshear announces release of book 'Go and Do Likewise'",
    "description": "LEXINGTON, Ky. (WKYT) - Gov. Andy Beshear announced the release of his book, “Go and Do Likewise” on Wednesday, Feb. 18. The book is set to go on sale September 22, with pre-orders currently available. In his book, Beshear will share how his faith has informe…",
    "link": "https://freerepublic.com/focus/f-news/4367413/posts",
    "timestamp": "2026-02-19T03:22:53Z"
  },
  {
    "title": "Van Hollen: 'Suppressing the Vote', Which Trump Is Trying to Do, Motivates People to Vote",
    "description": "On Wednesday’s broadcast of MS NOW’s “All In,” Sen. Chris Van Hollen (D-MD) stated that “one thing that definitely motivates people to go out and vote is when they know that people like Donald Trump are trying to stop them\nThe post Van Hollen: ‘Suppressing th…",
    "link": "https://www.breitbart.com/clips/2026/02/18/van-hollen-suppressing-the-vote-which-trump-is-trying-to-do-motivates-people-to-vote/",
    "timestamp": "2026-02-19T03:22:02Z"
  },
  {
    "title": "Newsmax Guest Wants to ‘Start Vetting’ Olympians For Their Political Views",
    "description": "Newsmax host Carl Higbie spoke to Evita Duffy-Alfonso on Wednesday night in a segment ridiculing Olympic figure skater Amber Glenn for speaking out against President Donald Trump and then failing to medal at the Olympics. “Figure skater named Amber Glenn, nev…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b7c05195-838f-46bb-9c68-d26ee4ba31eb",
    "timestamp": "2026-02-19T03:20:08Z"
  },
  {
    "title": "Newsmax Guest Wants to ‘Start Vetting’ Olympians For Their Political Views",
    "description": "Newsmax host Carl Higbie spoke to Evita Duffy-Alfonso on Wednesday night in a segment ridiculing Olympic figure skater Amber Glenn for speaking out against President Donald Trump and then failing to medal at the Olympics. “Figure skater named Amber Glenn, nev…",
    "link": "https://www.mediaite.com/media/tv/newsmax-guest-wants-to-start-vetting-olympians-for-their-political-views/",
    "timestamp": "2026-02-19T03:20:08Z"
  },
  {
    "title": "Trump Slams UK Over Diego Garcia Lease Deal, Says Base Needed in Event of Iran Attack",
    "description": "US President Donald Trump on Wednesday sharply criticized the UK over a lease deal concerning Diego Garcia island, the site of a major US military base, saying it may be needed to counter a \"potential attack\" by Iran if nuclear talks collapse.",
    "link": "https://sputnikglobe.com/20260219/trump-slams-uk-over-diego-garcia-lease-deal-says-base-needed-in-event-of-iran-attack-1123655456.html",
    "timestamp": "2026-02-19T03:16:00Z"
  },
  {
    "title": "The clock’s running out for globetrotting Newsom",
    "description": "Gavin Newsom has been criticized for his recent rhetoric at the Munich Security Conference. But it’s his neglect at home that is the real problem.",
    "link": "https://nypost.com/2026/02/18/opinion/the-clocks-running-out-for-globetrotting-newsom/",
    "timestamp": "2026-02-19T03:15:48Z"
  },
  {
    "title": "Obama and Susan Rice Reportedly 'Broke Down and Cried' After Trump's 2016 Win",
    "description": "A new report claims former President Barack Obama and his then-national security advisor, Susan Rice, were so distraught after Donald Trump won the 2016 election that they both cried. The claim was posted on X Tuesday by RealClearInvestigations senior reporte…",
    "link": "https://freerepublic.com/focus/f-news/4367410/posts",
    "timestamp": "2026-02-19T03:13:16Z"
  },
  {
    "title": "Deporting Censorship: U.S. Targets U.K. Government Ally",
    "description": "As ICE sweeps in Minneapolis have drawn wide attention, a little-noticed immigration case playing out in a New York federal court has significant implications for America's relationship with Bri",
    "link": "https://www.realclearinvestigations.com/articles/2026/02/18/deporting_censorship_us_targets_key_ally_of_british_government_over_free_speech_1165667.html",
    "timestamp": "2026-02-19T03:02:21Z"
  },
  {
    "title": "FCC chair Brendan Carr sets the record straight on Stephen Colbert censorship claims",
    "description": "FCC chair Brendan Carr hits back at Stephen Colbert's censorship claims surrounding an interview with a Texas U.S. Senate candidate not airing due to equal-time rule concerns.",
    "link": "https://www.foxnews.com/media/fcc-chair-brendan-carr-sets-record-straight-stephen-colbert-censorship-claims",
    "timestamp": "2026-02-19T03:00:03Z"
  },
  {
    "title": "Epstein Files: UN Says Acts Are \"Crimes Against Humanity\"",
    "description": "The United Nations has entered the Epstein files chat, as reported by Aaron Parnas. Experts hired by the UN said the crimes committed by Jeffrey Epstein and friends made up a “global criminal enterprise” that met the legal standards of crimes against humanity…",
    "link": "https://crooksandliars.com/2026/02/epstein-files-contain-acts-are-crimes",
    "timestamp": "2026-02-19T03:00:02Z"
  },
  {
    "title": "'Today, 96% of the world's nuclear weapons are held by states with authoritarian leaders' (Joseph Cirincione/Le Monde)",
    "description": "Joseph Cirincione / Le Monde:\n'Today, 96% of the world's nuclear weapons are held by states with authoritarian leaders' … For the first time in over half a century, the two largest nuclear arsenals in the world are operating without limits or inspections.  La…",
    "link": "https://www.memeorandum.com/260218/p137",
    "timestamp": "2026-02-19T03:00:01Z"
  },
  {
    "title": "Bitcoin To Top $500,000 By 2029? Entrepreneur Makes Bold Call",
    "description": "Bitcoin sits on edge again, trading below the critical $68,000 level after a volatile stretch that erased around 28% from its price in about a month. Prices are swinging hard, and that swing has pushed smart-money talk and wild bets into the same room. Relate…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-to-top-500000-by-2029-entrepreneur-makes-bold-call/",
    "timestamp": "2026-02-19T03:00:01Z"
  },
  {
    "title": "LONGITUDE recap: Bitcoin’s 2-step quantum plan, US crypto policy",
    "description": "Crypto industry executives struck an optimistic tone about the industry’s outlook for 2026, despite ongoing market volatility, during the latest LONGITUDE event in Hong Kong.",
    "link": "https://cointelegraph.com/news/cointelegraph-longitude-us-clarity-act-quantum-computing-bitcoin",
    "timestamp": "2026-02-19T02:56:03Z"
  },
  {
    "title": "The 'Enigma': Why JD Vance Befuddles the World (Nahal Toosi/Politico)",
    "description": "Nahal Toosi / Politico:\nThe ‘Enigma’: Why JD Vance Befuddles the World … If you want to make a foreign official roll their eyes in exasperation, ask them about President Donald Trump.  If you want to make them freeze like a deer in headlights, ask them about …",
    "link": "https://www.memeorandum.com/260218/p136",
    "timestamp": "2026-02-19T02:50:02Z"
  },
  {
    "title": "Prabowo meets US business leaders ahead of trade deal signing",
    "description": "President Prabowo Subianto began his official agenda in Washington, D.C., on Wednesday local time by meeting with the United States Chamber of Commerce ...",
    "link": "https://en.antaranews.com/news/405038/prabowo-meets-us-business-leaders-ahead-of-trade-deal-signing",
    "timestamp": "2026-02-19T02:47:40Z"
  },
  {
    "title": "Author of Dow 36,000 wants staffers punished for publishing banal economic facts",
    "description": "If there’s anyone who knows about embarassment: White House economic adviser Kevin Hassett on Wednesday said staffers at the New York Federal Reserve should be punished for producing research that found most of President Donald Trump’s tariffs are being paid …",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/author-of-dow-36000-wants-staffers-punished-for-publishing-banal-economic-facts",
    "timestamp": "2026-02-19T02:40:50Z"
  },
  {
    "title": "Nicki Minaj Shares AI-Generated Photos With Trump",
    "description": "Nicki Minaj decided to celebrate President’s Day on Monday (Feb. 16) and her new friendship with President Donald Trump with new photos of the two together. She posted two pictures created with artificial intelligence via her account on X, formerly Twitter, w…",
    "link": "https://hiphopwired.com/3046108/nicki-minaj-shares-ai-generated-photos-with-trump/",
    "timestamp": "2026-02-19T02:39:41Z"
  },
  {
    "title": "Venezuela’s Rodriguez, Colombia’s Petro say they will meet ‘soon’",
    "description": "Petro said he had invited Rodriguez to meet in the border city of Cucuta to discuss energy cooperation.",
    "link": "https://www.aljazeera.com/news/2026/2/19/venezuelas-rodriguez-colombias-petro-say-they-will-meet-soon",
    "timestamp": "2026-02-19T02:39:06Z"
  },
  {
    "title": "Air Force One will be painted red, white, blue as Trump hinted, US military says",
    "description": "US News: WASHINGTON: A red, white and blue colour scheme championed by President Donald Trump will become the new look for Air Force One, the US military said .",
    "link": "https://timesofindia.indiatimes.com/world/us/air-force-one-will-be-painted-red-white-blue-as-trump-hinted-us-military-says/articleshow/128535461.cms",
    "timestamp": "2026-02-19T02:36:29Z"
  },
  {
    "title": "Rubio to brief Netanyahu on Iran talks",
    "description": "Trump is weighing whether to take military action against Tehran as the administration surges military resources to the region, raising concerns that any attack could spiral into a larger conflict in the Middle East.",
    "link": "https://www.wcvb.com/article/rubio-briefs-netanyahu-iran-talks/70411763",
    "timestamp": "2026-02-19T02:35:22Z"
  },
  {
    "title": "Rubio to brief Netanyahu on Iran talks",
    "description": "Trump is weighing whether to take military action against Tehran as the administration surges military resources to the region, raising concerns that any attack could spiral into a larger conflict in the Middle East.",
    "link": "https://www.wgal.com/article/rubio-briefs-netanyahu-iran-talks/70411763",
    "timestamp": "2026-02-19T02:35:09Z"
  },
  {
    "title": "Trump's Glyphosate Order Hits Public Health Concerns",
    "description": "Trump's Glyphosate Order Hits Public Health Concernsewg.org",
    "link": "https://www.ewg.org/news-insights/news-release/2026/02/ewg-trumps-glyphosate-executive-order-big-middle-finger-every",
    "timestamp": "2026-02-19T02:34:28Z"
  },
  {
    "title": "Breaking news live updates: Trump to hold 'Board of Peace' meeting with over 20 countries with eye on Gaza and beyond",
    "description": "Breaking news live updates: US President Donald Trump on Thursday gathers allies to inaugurate the \"Board of Peace,\" his new institution focused on progress on Gaza but whose ambitions reach much further.",
    "link": "https://m.economictimes.com/news/newsblogs/breaking-news-live-updates-pm-modi-donald-trump-us-india-trade-ukraine-russia-war-rahul-gandhi-west-bengal-assam-tamil-nadu-elections-february-19-2026/liveblog/128535298.cms",
    "timestamp": "2026-02-19T02:24:55Z"
  },
  {
    "title": "People who live in Matt Jeneroux’s Edmonton Riverbend riding react to MP's floor-crossing",
    "description": "Edmontonians who live in MP Matt Jeneroux’s riding are reacting to the news he is leaving the Conservatives to join the Liberal caucus.",
    "link": "https://www.cbc.ca/news/canada/edmonton/edmonton-riverbend-jeneroux-liberals-9.7096721",
    "timestamp": "2026-02-19T02:23:02Z"
  },
  {
    "title": "Did Super Bowl champs Seahawks decline Donald Trump's invitation to the White House?",
    "description": "The confetti had barely settled after Super Bowl LX when a new storyline began circulating. There is currently no verified evidence that the Seattle Seahawks declined a White House",
    "link": "https://www.marca.com/en/nfl/seattle-seahawks/2026/02/19/69967371268e3e5d348b45de.html",
    "timestamp": "2026-02-19T02:20:53Z"
  },
  {
    "title": "Donald Trump's remarks on Taiwan arms sales with China stir unease in Taipei",
    "description": "US President Donald Trump's statement about discussing arms sales to Taiwan with Chinese President Xi Jinping has sparked worry in Taipei. Experts suggest this may breach long-standing US foreign policy. Trump's remarks could set a concerning precedent for fu…",
    "link": "https://economictimes.indiatimes.com/news/defence/donald-trumps-remarks-on-taiwan-arms-sales-with-china-stir-unease-in-taipei/articleshow/128534973.cms",
    "timestamp": "2026-02-19T02:19:22Z"
  },
  {
    "title": "JD Vance makes US allies 'freeze like a deer' for 'unnerving' reasons: report",
    "description": "Vice President JD Vance is having an \"unnerving\" impact on US allies, and some of them \"freeze like a deer in headlights\" when he's brought up in conversation, according to a report. Vance's name has been tossed around as the eventual heir to the MAGA throne …",
    "link": "https://www.rawstory.com/jd-vance-2675282575/",
    "timestamp": "2026-02-19T02:13:58Z"
  },
  {
    "title": "DAVID BLACKMON: Chris Wright Delivers Lightning-Fast Progress In Venezuela",
    "description": "ExxonMobil CEO Darren Woods made big news during President Donald Trump’s White House meeting with oil and gas industry leaders when he told the President his",
    "link": "https://dailycaller.com/2026/02/18/opinion-chris-wright-delivers-lightning-fast-progress-in-venezuela-david-blackmon/",
    "timestamp": "2026-02-19T02:10:49Z"
  },
  {
    "title": "US Energy Secretary: We will stop Iran’s nuclear march one way or the other",
    "description": "US Energy Secretary Chris Wright warns that the United States will prevent Iran from acquiring nuclear weapons \"one way or the other,\" as President Trump mulls military action.",
    "link": "https://www.israelnationalnews.com/news/422635",
    "timestamp": "2026-02-19T02:10:12Z"
  },
  {
    "title": "What's the equal time rule at the heart of the Colbert-CBS dispute?",
    "description": "The nearly century-old rule requires broadcasters to give equal opportunity to candidates who are running for the same position. Talk shows have long been exempt, but the FCC under Trump is changing that, according to experts.",
    "link": "https://www.cbc.ca/news/entertainment/colbert-talarico-equal-time-rule-9.7096439",
    "timestamp": "2026-02-19T02:10:00Z"
  },
  {
    "title": "Radio Free Asia says it resumes broadcasts to China",
    "description": "WASHINGTON: Radio Free Asia has resumed broadcasts to people in China, its CEO said on Tuesday (Feb 17), after Trump administration cuts last year largely forced the US-funded outlet to cease operations.RFA and its sister outlets, including Voice of America, …",
    "link": "https://www.channelnewsasia.com/east-asia/radio-free-asia-broadcasts-china-trump-5937111",
    "timestamp": "2026-02-19T02:09:59Z"
  },
  {
    "title": "Report: Obama, Susan Rice ‘Broke Down and Cried’ After Trump Defeated Hillary Clinton in 2016",
    "description": "Former President Barack Obama and former White House adviser Susan Rice allegedly “broke down and cried” after President Donald Trump defeated former Secretary of State Hillary Clinton in the 2016 presidential election. In a post on X, RealClearInvestigations…",
    "link": "https://freerepublic.com/focus/f-chat/4367406/posts",
    "timestamp": "2026-02-19T02:05:29Z"
  },
  {
    "title": "War declared on Trump DOJ's 'abnormal' behavior by fed-up attorneys",
    "description": "A group of criminal defense attorneys has launched a war against the Trump Department of Justice's \"abnormal behavior,\" according to a report. The lawyers banded together and created a tool called Case Tracker, a database of federal cases in which eyewitness …",
    "link": "https://www.rawstory.com/trump-2675282565/",
    "timestamp": "2026-02-19T02:03:48Z"
  },
  {
    "title": "Vietnamese airlines sign $30-billion deals for 90 Boeing jets",
    "description": "HANOI, Feb 19 : Three Vietnamese airlines signed deals with U.S. manufacturer Boeing on Thursday to buy a total of 90 aircraft, as Vietnam and the United States continue negotiations on a new trade deal. The deals were signed during a visit to the United Stat…",
    "link": "https://www.channelnewsasia.com/business/vietnamese-airlines-sign-30-billion-deals-90-boeing-jets-5939316",
    "timestamp": "2026-02-19T01:57:58Z"
  },
  {
    "title": "Oil prices dip as investors assess trajectory of US-Iran tensions",
    "description": "Oil prices saw a slight dip today after a significant rise yesterday. Investors are watching developments between the United States and Iran. Both nations have increased military presence in a key oil region. Talks are ongoing, but progress remains slow. U.S.…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-dip-as-investors-assess-trajectory-of-us-iran-tensions/articleshow/128534579.cms",
    "timestamp": "2026-02-19T01:57:12Z"
  },
  {
    "title": "Brendan Carr Confirms FCC Has Begun ‘Enforcement Proceedings’ Against ABC’s ‘The View’ Over Equal Time Issues",
    "description": "FCC chairman Brendan Carr confirmed Wednesday that the commission has started enforcement proceedings of what he asserted were violations of the equal time rule involving political candidates by ABC’s daytime mainstay “The View.” Carr appeared on Fox News’ “T…",
    "link": "https://variety.com/2026/tv/news/brendan-carr-fcc-the-view-equal-time-colbert-1236667002/",
    "timestamp": "2026-02-19T01:56:21Z"
  },
  {
    "title": "Oil prices extend gains on concerns of potential US-Iran conflict",
    "description": "TOKYO, Feb 19 : Oil prices rose in Asian trade on Thursday as the U.S. and Iran attempted to ease a standoff in talks over Tehran's nuclear programme while both sides heightened military activity in the key oil-producing region.Brent futures climbed 24 cents,…",
    "link": "https://www.channelnewsasia.com/business/oil-prices-extend-gains-concerns-potential-us-iran-conflict-5939306",
    "timestamp": "2026-02-19T01:53:24Z"
  },
  {
    "title": "Oil prices dip as investors assess trajectory of US-Iran tensions",
    "description": "TOKYO, Feb 19 : Oil prices eased in early Asia trade on Thursday, following the previous day's 4 per cent jump, as investors assessed efforts by the U.S. and Iran to resolve tensions while both sides have stepped up military activity in the key oil-producing …",
    "link": "https://www.channelnewsasia.com/business/oil-prices-dip-investors-assess-trajectory-us-iran-tensions-5939306",
    "timestamp": "2026-02-19T01:53:24Z"
  },
  {
    "title": "Advocacy groups sue Trump administration over endangerment finding’s repeal",
    "description": "The US Environmental Protection Agency rescinded the climate change finding as part of a push to slash regulation.",
    "link": "https://www.aljazeera.com/news/2026/2/19/advocacy-groups-sue-trump-administration-over-endangerment-findings-repeal",
    "timestamp": "2026-02-19T01:52:35Z"
  },
  {
    "title": "Trump DOJ attorney held in contempt for refusing to return ICE detainee's paperwork",
    "description": "A federal judge held a lawyer from President Donald Trump's Department of Justice in contempt on Wednesday for failing to return a detainee's identification paperwork after the detainee was released from immigration custody, according to a report. Judge Laura…",
    "link": "https://www.rawstory.com/trump-2675282541/",
    "timestamp": "2026-02-19T01:43:19Z"
  },
  {
    "title": "Carrie Underwood 'American Idol' boos spark firestorm, fans clash over MAGA and 'right side of history' claims",
    "description": "Carrie Underwood reveals she was booed during \"American Idol\" Hollywood Week, sparking fierce social media debate over her Trump inauguration performance.",
    "link": "https://www.foxnews.com/entertainment/carrie-underwood-american-idol-boos-spark-firestorm-fans-clash-over-maga-right-side-history-claims",
    "timestamp": "2026-02-19T01:42:05Z"
  },
  {
    "title": "Charlie Pickering on his ADHD, satire and the 'ludicrous' Trump era",
    "description": "Political satire occasionally comes at a price, but Charlie Pickering still believes the right joke at the right time can have a huge impact.",
    "link": "https://www.abc.net.au/news/2026-02-19/charlie-pickering-the-weekly-interview/106307588",
    "timestamp": "2026-02-19T01:36:52Z"
  },
  {
    "title": "Eileen Gu's interaction with reporter over winning silver instead of gold goes viral: ‘Ridiculous perspective’",
    "description": "Eileen Gu responded to a reporter's question about winning silver medals instead of gold at Milan Cortina Olympics, calling the perspective \"ridiculous\" in a viral exchange.",
    "link": "https://www.foxnews.com/sports/eileen-gus-interaction-reporter-over-winning-silver-instead-gold-goes-viral-ridiculous-perspective",
    "timestamp": "2026-02-19T01:32:41Z"
  },
  {
    "title": "US Military moves into place for possible strikes in Iran this weekend",
    "description": "U.S. forces are rapidly building up in the Middle East, presenting President Trump with the option of military action against Iran as soon as this weekend. Despite indirect talks, the U.S. continues military preparations, while Israel, also on heightened aler…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-military-moves-into-place-for-possible-strikes-in-iran-this-weekend/articleshow/128533929.cms",
    "timestamp": "2026-02-19T01:31:11Z"
  },
  {
    "title": "BABBLES: Restoration of King Mahendra’s Statue",
    "description": "By Babbler King Mahendra’s contribution to the nation cannot be ignored. During his tenure as king, he made tremendous contributions […]\nThe post BABBLES: Restoration of King Mahendra’s Statue appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2026/02/19/babbles-restoration-of-king-mahendras-statue/",
    "timestamp": "2026-02-19T01:30:19Z"
  },
  {
    "title": "Lawmakers accuse Pam Bondi of ‘mudding’ Epstein files release with names of long-dead Elvis Presley and Marilyn Monroe (also Janis Joplin, Kurt Cobain)",
    "description": "Lawmakers who pushed the Department of Justice to release the Epstein files are dissatisfied with its latest disclosure of high-profile names mentioned in the three million documents, believing the DOJ is being purposefully vague to protect those with close t…",
    "link": "https://freerepublic.com/focus/f-news/4367399/posts",
    "timestamp": "2026-02-19T01:21:19Z"
  },
  {
    "title": "Wes Moore Hits Back At Trump’s Request For Him To Ask ‘Politely’ For Help Over Potomac Spill",
    "description": "Maryland Governor Wes Moore (D) hit back at President Donald Trump for claiming that he would “fix” the sewage spill in the Potomac River only if Moore and other Democratic governors called the president and asked him “politely.” Moore spoke to CNN’s Kasie Hu…",
    "link": "https://www.mediaite.com/media/news/wes-moore-hits-back-at-trumps-request-for-him-to-ask-politely-for-help-over-potomac-spill/",
    "timestamp": "2026-02-19T01:21:18Z"
  },
  {
    "title": "US to withdraw troops from Syria as tensions mount with Iran",
    "description": "The decision came as US President Donald Trump ramps up military presence in the Middle East as tensions mount with Iran.",
    "link": "https://www.bbc.com/news/articles/c875pey8vy2o",
    "timestamp": "2026-02-19T01:14:47Z"
  },
  {
    "title": "Trump, 79, Covers Up Decaying Hand With Makeup for White House Event",
    "description": "The elderly president tried to cover up his chronic bruising with cosmetics once again.",
    "link": "https://www.thedailybeast.com/trump-79-covers-up-decaying-hand-with-makeup-for-white-house-event/",
    "timestamp": "2026-02-19T01:14:13Z"
  },
  {
    "title": "Trump basks in Black History Month praise, dodging racism claims",
    "description": "WASHINGTON, Feb 18 (Reuters) - U.S. President Donald Trump on ⁠Wednesday highlighted top Black administration officials, rejected accusations of racism and promised \"a century more\" of success for African Americans during a White House celebration ⁠marking 10…",
    "link": "https://www.thestar.com.my/news/world/2026/02/19/trump-basks-in-black-history-month-praise-dodging-racism-claims",
    "timestamp": "2026-02-19T01:13:00Z"
  },
  {
    "title": "Oregon Democrats Want to Nix Trump’s Tax Cuts From State Code",
    "description": "A bill gaining traction in the Legislature would disconnect the state from key provisions of the federal tax code, netting more than $300 million in additional revenue.\n \n by Abe Asher\n \n \n \n When Donald Trump signed H.R. 1, coined “The One Big Beautiful Bill…",
    "link": "https://www.portlandmercury.com/news/2026/02/18/48331695/oregon-democrats-want-to-nix-trumps-tax-cuts-from-state-code",
    "timestamp": "2026-02-19T01:12:00Z"
  },
  {
    "title": "Jeremy Carl Joins ‘The Signal Sitdown’ Following Tense Senate Hearing",
    "description": "The following is a preview of Daily Signal Politics Editor Bradley Devlin’s interview with Jeremy Carl, President Donald Trump’s nominee for Assistant Secretary of the Bureau... Read More\nThe post Jeremy Carl Joins ‘The Signal Sitdown’ Following Tense Senate …",
    "link": "https://www.dailysignal.com/2026/02/18/jeremy-carl-joins-the-signal-sitdown-following-tense-senate-hearing/",
    "timestamp": "2026-02-19T01:11:18Z"
  },
  {
    "title": "Review of World Affairs",
    "description": "By Shashi P.B.B. Malla Bangladesh The Bangladesh Nationalist Party has come out victorious in the country’s first election since the […]\nThe post Review of World Affairs appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2026/02/19/review-of-world-affairs-82/",
    "timestamp": "2026-02-19T01:10:12Z"
  },
  {
    "title": "Black Allies Defend Trump on Race",
    "description": "During a White House Black History Month event on Wednesday, President Trump honored the Rev. Jesse Jackson while showcasing praise from Black supporters and revisiting his record on race-related issues. The Black History Month event at the White House was he…",
    "link": "https://www.newser.com/story/383993/black-allies-defend-trump-on-race.html",
    "timestamp": "2026-02-19T01:10:00Z"
  },
  {
    "title": "The Bad Bunny Halftime Show Wasn’t the Problem. Our Reaction Might Be",
    "description": "We’re starting with the talk of the town all week, the Super Bowl halftime show featuring Bad Bunny. The Left cheered it. Fans who don’t care about politics loved it for what it was. Many on the Right booed it, offered their own alternative halftime show, and…",
    "link": "https://republica.com/internacional/the-bad-bunny-halftime-show-wasn-t-the-problem-our-reaction-might-be-20262181980",
    "timestamp": "2026-02-19T01:08:00Z"
  },
  {
    "title": "FCC’s Bad Bunny Super Bowl findings are not good for ‘unserious snowflake’ congressman",
    "description": "FCC’s Bad Bunny Super Bowl findings are not good for ‘unserious snowflake’ congressmanpennlive.com",
    "link": "https://www.pennlive.com/entertainment/2026/02/fccs-bad-bunny-super-bowl-findings-are-not-good-for-unserious-snowflake-congressman.html",
    "timestamp": "2026-02-19T01:07:53Z"
  },
  {
    "title": "US dollar: Trump has the left door open for Europe to attack",
    "description": "The president’s erratic policies have created the best chance in the 75-year history of the “European Project” to erode the dominance of the US dollar.",
    "link": "https://www.smh.com.au/business/markets/trump-has-opened-the-door-for-europe-to-attack-20260219-p5o3kd.html",
    "timestamp": "2026-02-19T01:03:13Z"
  },
  {
    "title": "Department of Education to pull back race-based criteria in federal grants",
    "description": "The U.S. Department of Education will change controversial race-based eligibility rules for federal grants following Young America's Foundation's 2024 lawsuit.",
    "link": "https://www.foxnews.com/media/department-education-pull-back-race-based-criteria-federal-grants",
    "timestamp": "2026-02-19T01:00:23Z"
  },
  {
    "title": "Democrats risk FEMA disaster funding collapse as DHS shutdown hits Day 5",
    "description": "The partial government shutdown entered its fifth day with no resolution in sight, as immigration disputes threaten FEMA's federal emergency response.",
    "link": "https://www.foxnews.com/politics/democrats-risk-fema-disaster-funding-collapse-dhs-shutdown-hits-day-5",
    "timestamp": "2026-02-19T01:00:07Z"
  },
  {
    "title": "Trump Elevates His Former Receptionist To Commissioner Of Fine Arts",
    "description": "Although there is absolutely nothing in her background to suggest she has any expertise whatsoever (\"Harris, who holds the title of deputy director of Oval Office operations, received a bachelor’s degree in political science in 2019 from the University at Alb…",
    "link": "https://crooksandliars.com/2026/02/trump-picks-his-former-receptionist",
    "timestamp": "2026-02-19T01:00:01Z"
  },
  {
    "title": "EXCLUSIVE: Inside Jesse Jackson's Two Failed Bids to Become President — Before He Paved Way for Barack Obama's Victory",
    "description": "Jesse Jackson changed Democratic rules and mobilized millions, laying the ground for Obama’s victory.",
    "link": "https://radaronline.com/p/jesse-jackson-presidential-bids-barack-obama-legacy/",
    "timestamp": "2026-02-19T01:00:00Z"
  },
  {
    "title": "US plans online portal to bypass content bans in Europe and elsewhere",
    "description": "The U.S. State Department is developing an online portal, freedom.gov, to allow users globally to access content banned by their governments, including alleged hate speech and terrorist propaganda. This initiative aims to counter censorship, though it may str…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-plans-online-portal-to-bypass-content-bans-in-europe-and-elsewhere/articleshow/128533078.cms",
    "timestamp": "2026-02-19T00:55:06Z"
  },
  {
    "title": "Did Seahawks decline White House visit? No proof that's true",
    "description": "Social media users claimed Seattle's Super Bowl champions declined an invitation, but evidence is lacking.",
    "link": "https://www.snopes.com//news/2026/02/18/seahawks-white-house-visit-2026/",
    "timestamp": "2026-02-19T00:52:00Z"
  },
  {
    "title": "Bar declared crime scene as ACT police seize 'clearly satirical' posters under new hate laws",
    "description": "Police have seized five posters on display in the window of a Canberra bar, declaring a \"crime scene\" while they investigate the artworks under new Commonwealth hate laws.",
    "link": "https://www.abc.net.au/news/2026-02-19/canberra-bar-declared-crime-scene-displaying-posters/106361644",
    "timestamp": "2026-02-19T00:50:34Z"
  },
  {
    "title": "Trump’s Economic Advisor Wants to Punish Researchers Who Found 90% of Tariffs Are Paid For By Consumers",
    "description": "Kevin Hassett, Trump’s director of the National Economic Council, claimed that researchers responsible for a study that found 90% of tariff costs were shouldered by U.S. consumers and companies should be “disciplined.” Hassett joined CNBC’s Squawk Box to disc…",
    "link": "https://www.mediaite.com/media/news/trumps-economic-advisor-wants-to-punish-researchers-who-found-90-of-tariffs-are-paid-for-by-consumers/",
    "timestamp": "2026-02-19T00:49:46Z"
  },
  {
    "title": "Cristian Roldan acknowledges Pochettino's impact on U.S. Men's Soccer",
    "description": "The U.S. men&apos;s national team is undergoing a quiet transformation under Mauricio Pochettino, and one of its key players is taking notice. Seattle Sounders star Cristian Roldan",
    "link": "https://www.marca.com/en/football/2026/02/19/6996593946163f11088b456c.html",
    "timestamp": "2026-02-19T00:44:52Z"
  },
  {
    "title": "CNN: Trump Is Imposing 'Ideology’ By Enforcing Civil Rights Law",
    "description": "On Wednesday’s CNN This Morning, host Audie Cornish and her panel managed to recast enforcement of federal civil rights law under Donald Trump as “enforcing ideology,” while a Democratic consultant insisted that DEI “was never a problem” until Trump took offi…",
    "link": "https://freerepublic.com/focus/f-news/4367397/posts",
    "timestamp": "2026-02-19T00:42:51Z"
  },
  {
    "title": "Wes Moore: White America Needs to 'Wrestle' with Trump's Actions Towards Black People",
    "description": "Wednesday on CNN's \"The Arena,\" Gov. Wes Moore (D-MD) said white America needed to \"wrestle with\" President Donald Trump's actions towards black people.\nThe post Wes Moore: White America Needs to ‘Wrestle’ with Trump’s Actions Towards Black People appeared fi…",
    "link": "https://www.breitbart.com/clips/2026/02/18/wes-moore-white-america-needs-to-wrestle-with-trumps-actions-towards-black-people/",
    "timestamp": "2026-02-19T00:42:11Z"
  },
  {
    "title": "Air Force One will be painted red, white and blue as Trump requested, U.S. military says",
    "description": "A red, white and blue color scheme championed by President Donald Trump will become the new look for Air Force One, the U.S. military said Thursday. The Air Force said a “red, white, gold and dark blue paint scheme” will be used for the updated jet that is sl…",
    "link": "https://japantoday.com/category/world/air-force-one-will-be-painted-red-white-and-blue-as-trump-has-hinted-us-military-says",
    "timestamp": "2026-02-19T00:41:38Z"
  },
  {
    "title": "Trump signs executive order to promote the production of weedkiller that's hated by MAHA",
    "description": "Secretary of Health and Human Services Robert F. Kennedy Jr.'s Make America Healthy Again movement is largely opposed to glyphosate.",
    "link": "https://www.cnbc.com/2026/02/18/trump-executive-order-weedkiller-hated-by-maha.html",
    "timestamp": "2026-02-19T00:41:26Z"
  },
  {
    "title": "Grieving D.C. Grandmother Who Lost Son to Violent Crime TORCHES Democrats in a Powerful Speech: “Get Off the Man’s Back… Let Him Do His Job!”",
    "description": "The radical left has turned our nation’s capital into a dangerous, lawless warzone but the victims of their disastrous policies are finally fighting back.\nThe post Grieving D.C. Grandmother Who Lost Son to Violent Crime TORCHES Democrats in a Powerful Speech:…",
    "link": "https://www.thegatewaypundit.com/2026/02/grieving-d-c-grandmother-who-lost-son-violent/",
    "timestamp": "2026-02-19T00:40:02Z"
  },
  {
    "title": "Trump lashes out at California governor’s green energy deal with UK",
    "description": "Donald Trump has vented his fury against a green energy deal between the British government and California’s governor, Gavin Newsom, a likely future Democratic presidential candidate. “The UK’s got enough trouble without getting involved with Gavin Newscum,” …",
    "link": "https://freerepublic.com/focus/f-news/4367394/posts",
    "timestamp": "2026-02-19T00:38:03Z"
  },
  {
    "title": "German parade floats mocking Trump are real. Here's why the caricatures were displayed",
    "description": "Images authentically show floats mocking U.S. President Donald Trump at a German parade, including a float of a pantsless Trump and a gagged Statue of Liberty.",
    "link": "https://www.snopes.com//fact-check/germany-parade-floats-trump/",
    "timestamp": "2026-02-19T00:33:00Z"
  },
  {
    "title": "Report: Obama, Susan Rice 'Broke Down and Cried' After Trump Defeated Hillary Clinton in 2016",
    "description": "Former President Barack Obama and former White House adviser Susan Rice allegedly \"broke down and cried\" after President Donald Trump defeated former Secretary of State Hillary Clinton in the 2016 presidential election.\nThe post Report: Obama, Susan Rice ‘Bro…",
    "link": "https://www.breitbart.com/politics/2026/02/18/report-obama-susan-rice-broke-down-and-cried-after-trump-defeated-hillary-clinton-in-2016/",
    "timestamp": "2026-02-19T00:31:23Z"
  },
  {
    "title": "Mass departures from DOJ are boon for law firms, legal groups",
    "description": "More than 5,000 employees have resigned, retired or been fired​ from the Justice Department in the first year of Mr. Trump's second administration.",
    "link": "https://www.cbsnews.com/news/mass-departures-justice-dept-boon-for-law-firms-legal-groups-campaigns/",
    "timestamp": "2026-02-19T00:30:08Z"
  },
  {
    "title": "Beshear to Justify Left-Wing Views in Book Focused on Faith Ahead of 2028 Presidential Race",
    "description": "Kentucky Gov. Andy Beshear (D) is planning to publish a book this fall, adding to the list of potential 2028 Democrat presidential candidates releasing memoirs that could set the stage for their campaigns. \nThe post Beshear to Justify Left-Wing Views in Book …",
    "link": "https://www.breitbart.com/politics/2026/02/18/beshear-to-justify-left-wing-views-in-book-focused-on-faith-ahead-of-2028-presidential-race/",
    "timestamp": "2026-02-19T00:29:36Z"
  },
  {
    "title": "Lashing Out at Starmer, Trump Says 'It May Be Necessary' to Use UK Bases to Attack Iran",
    "description": "President Donald Trump on Wednesday suggested that the United States could launch attacks on Iran from British territory with or without the permission of the UK government.Trump opened a characteristically rambling post on his Truth Social network by dispara…",
    "link": "https://www.commondreams.org/news/trump-starmer-diego-garcia",
    "timestamp": "2026-02-19T00:25:47Z"
  },
  {
    "title": "‘Bonkers’: Top Trump Aide Gets Annihilated Right And Left For Claiming Tariffs Aren’t ‘Regressive’",
    "description": "“Remember, they told us first that Americans wouldn't be paying these taxes. Now, they're claiming only the rich are getting hurt. And they ignore the disproportionate impact on the poor.”\nThe post ‘Bonkers’: Top Trump Aide Gets Annihilated Right And Left For…",
    "link": "https://www.mediaite.com/media/tv/bonkers-top-trump-aide-gets-annihilated-right-and-left-for-claiming-tariffs-arent-regressive/",
    "timestamp": "2026-02-19T00:15:43Z"
  },
  {
    "title": "Dubbo faces tooth decay rise without fluoride in its water",
    "description": "Dubbo faces tooth decay rise without fluoride in its waterdailyliberal.com.au",
    "link": "https://www.dailyliberal.com.au/story/9177794/dubbo-faces-tooth-decay-rise-without-fluoride-in-its-water/",
    "timestamp": "2026-02-19T00:14:31Z"
  },
  {
    "title": "Another blue state launches counterattack as Trump and GOP 'rig' Congressional elections",
    "description": "A group in Colorado has proposed a new election map that could give Democrats a 7-1 advantage in the House of Representatives, according to a Denver Post report. Colorado's current Congressional delegation includes four Democrats and four Republicans. The pro…",
    "link": "https://www.rawstory.com/redistricting-2675282392/",
    "timestamp": "2026-02-19T00:14:00Z"
  },
  {
    "title": "What is US $5,000 Apprehension Fee and who needs to pay it? New rules explained.",
    "description": "What is US $5,000 Apprehension Fee and who needs to pay it? This new rule is part of recent actions under US immigration law. The United States has started enforcing a $5,000 Apprehension Fee on illegal migrants. The rule links to updated Apprehension Fee rul…",
    "link": "https://freerepublic.com/focus/f-news/4367387/posts",
    "timestamp": "2026-02-19T00:09:09Z"
  },
  {
    "title": "Left Drags Karoline Levitt For Claiming Posts Come Straight From Trump, After Blaming Racist Video on Staffer",
    "description": "White House Press Secretary Karoline Leavitt was brutally mocked on Wednesday for claiming that President Donald Trump’s social media posts come directly from him, days after the administration blamed a staffer for posting a racist video to the president’s ac…",
    "link": "https://www.mediaite.com/media/news/left-drags-karoline-levitt-for-claiming-posts-come-straight-from-trump-after-blaming-racist-video-on-staffer/",
    "timestamp": "2026-02-19T00:08:23Z"
  },
  {
    "title": "Just two companies could be paying 40% of Irish corporation tax between them, watchdog warns",
    "description": "‘Ireland is a key part of their group structures. However, this may not always remain the case.’",
    "link": "https://www.thejournal.ie/ifac-corporation-tax-tech-and-pharma-sector-ai-warning-6960478-Feb2026/",
    "timestamp": "2026-02-19T00:05:31Z"
  },
  {
    "title": "CARLA SANDS: What To Do About Greenland",
    "description": "let’s look at the facts",
    "link": "https://dailycaller.com/2026/02/18/opinion-what-to-do-about-greenland-carla-sands/",
    "timestamp": "2026-02-19T00:01:04Z"
  },
  {
    "title": "Takaichi, reelected as Japan's leader, wants to cooperate with U.S. in rare earths development",
    "description": "Japanese Prime Minister Sanae Takaichi says she hopes to deepen her relationship with U.S. President Donald Trump.",
    "link": "https://www.pbs.org/newshour/world/takaichi-reelected-as-japans-leader-wants-to-cooperate-with-u-s-in-rare-earths-development",
    "timestamp": "2026-02-19T00:00:54Z"
  },
  {
    "title": "Democrats to Defy Leadership With Protests for Trump’s State of the Union",
    "description": "I wonder if Rep. Al Green will act like a clown again.\nThe post Democrats to Defy Leadership With Protests for Trump’s State of the Union first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/02/democrats-to-defy-leadership-with-protests-for-trumps-state-of-the-union/",
    "timestamp": "2026-02-19T00:00:07Z"
  },
  {
    "title": "Science journalism on the ropes worldwide as US aid cuts bite",
    "description": "Federal freezes to foreign assistance are affecting grants for investigative reporters everywhere — but especially in poorer countries.",
    "link": "https://www.nature.com/articles/d41586-026-00117-7",
    "timestamp": "2026-02-19T00:00:00Z"
  }
]