[
  {
    "title": "U.S. Politician Claims Americans Voted To End Foreign Wars",
    "description": "United States Representative Marjorie Taylor Greene has said that voters declared they wanted an end to foreign wars when they voted for Donald Trump. She added that to continue to fund Ukraine is a \"betrayal to the majority of Americans.\"",
    "link": "https://www.shtfplan.com/member-exclusive/u-s-politician-claims-americans-voted-to-end-foreign-wars",
    "timestamp": "2025-08-04T15:00:47Z"
  },
  {
    "title": "Trump: will 'substantially' raise tariffs on goods from India over Russian oil purchases",
    "description": "\"Because of this, I will be substantially raising the Tariff paid by India to the USA.\"  India’s trade ministry did not immediately respond to a request for ...",
    "link": "https://ca.finance.yahoo.com/news/trump-says-substantially-raise-tariffs-150042368.html",
    "timestamp": "2025-08-04T15:00:42Z"
  },
  {
    "title": "Trump-Putin Showdown Fuels Oil Price Uncertainty",
    "description": "Sentiment among oil traders has turned bullish recently despite forecasts flagging sluggish demand growth and OPEC+’s latest decision to add more barrels to its combined production. The reason for the change in sentiment was U.S. President Donald Trump’s thre…",
    "link": "https://oilprice.com/Energy/Oil-Prices/Trump-Putin-Showdown-Fuels-Oil-Price-Uncertainty.html",
    "timestamp": "2025-08-04T15:00:00Z"
  },
  {
    "title": "Texas Dems Flee Austin to Stop Redistricting",
    "description": "Texas Republicans are weighing legal consequences for Democrats who have left Austin to stymie efforts to redraw the Lonestar State’s congressional districts. Ahead of the... Read More\nThe post Texas Dems Flee Austin to Stop Redistricting appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/08/04/texas-dems-flee-austin-to-stop-redistricting/",
    "timestamp": "2025-08-04T15:00:00Z"
  },
  {
    "title": "Trump tariffs: India may extend support to vulnerable sectors worst affected",
    "description": "Indian government considers support for exporters affected by Trump's tariffs, exploring options within existing provisions, including RoDTEP and RoSCTL schemes.",
    "link": "https://www.thehindubusinessline.com/economy/trump-tariffs-india-may-extend-support-to-vulnerable-sectors-worst-affected/article69894206.ece",
    "timestamp": "2025-08-04T14:59:31Z"
  },
  {
    "title": "Trump Deletes, Reposts Unhinged Rant Praising ‘Sidney’ Sweeney for ‘HOTTEST Ad Out There’ and Bashing Taylor Swift",
    "description": "President Donald Trump weighed in on a critically important topic Monday morning: a denim ad starring the actress Sydney Sweeney.\nThe post Trump Deletes, Reposts Unhinged Rant Praising ‘Sidney’ Sweeney for ‘HOTTEST Ad Out There’ and Bashing Taylor Swift first…",
    "link": "https://www.mediaite.com/online/trump-deletes-reposts-unhinged-rant-praising-sidney-sweeney-for-hottest-ad-out-there-and-bashing-taylor-swift/",
    "timestamp": "2025-08-04T14:59:23Z"
  },
  {
    "title": "What Trump put at risk when he fired the labor statistics chief for telling the truth",
    "description": "One Democrat called Donald Trump's ouster of Erika McEntarfer’s “the stuff of fascist dictatorships.” The consequences of the abuse will linger for a long while",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-put-risk-fired-labor-statistics-chief-telling-truth-rcna222865",
    "timestamp": "2025-08-04T14:58:18Z"
  },
  {
    "title": "Republican Rep. Nancy Mace Launches Bid For South Carolina Governor",
    "description": "The congresswoman has yet to secure President Donald Trump's endorsement but has made clear she will fight for his support.",
    "link": "https://www.huffpost.com/entry/nancy-mace-launches-2026-south-carolina-gubernatorial-bid_n_68909bd4e4b0b6f38d13cd59",
    "timestamp": "2025-08-04T14:58:15Z"
  },
  {
    "title": "'On the precipice of recession': A top economist warns that not even the Fed may be able to rescue the US from a downturn",
    "description": "Mark Zandi says that the US economy is teetering at the edge of a recession as tariffs and immigration policy weigh on growth.",
    "link": "https://www.businessinsider.com/us-recession-economy-tariffs-immigration-policy-jobs-data-bls-trump-2025-8",
    "timestamp": "2025-08-04T14:57:57Z"
  },
  {
    "title": "The Crypto Crises Are Coming",
    "description": "Under its emerging legislative framework, the United States is poised to become a major hub for cryptocurrency-related activities. But in its eagerness to do the crypto industry’s bidding, Congress has exposed Americans and the world to the risk of severe eco…",
    "link": "https://www.project-syndicate.org/commentary/us-crypto-legislation-lacks-sufficient-regulatory-safeguards-by-simon-johnson-2025-08",
    "timestamp": "2025-08-04T14:57:21Z"
  },
  {
    "title": "Llegan las crisis de las criptomonedas",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/us-crypto-legislation-lacks-sufficient-regulatory-safeguards-by-simon-johnson-2025-08/spanish",
    "timestamp": "2025-08-04T14:57:21Z"
  },
  {
    "title": "President Trump Rips Charlamagne Tha God",
    "description": "Donald is hot. Continue reading…",
    "link": "https://www.xxlmag.com/president-trump-rips-charlamagne-tha-god-jeffrey-epstein-scandal/",
    "timestamp": "2025-08-04T14:56:44Z"
  },
  {
    "title": "Texas GOP targets 5 Democrat seats in bold map overhaul",
    "description": "Texas Republicans have unveiled an ambitious redistricting plan that could dramatically reshape the state’s political landscape by targeting five Democratic congressional seats across major metropolitan areas. The proposed map represents one of the most aggre…",
    "link": "https://rollingout.com/2025/08/04/texas-gop-targets-5-democrat-seats-bold/",
    "timestamp": "2025-08-04T14:56:23Z"
  },
  {
    "title": "The right-wing podcast wars just got really ugly",
    "description": "After Tucker Carlson and Candace Owens' conversation, the MAGA snake began to eat itself",
    "link": "https://www.salon.com/2025/08/04/the-right-wing-podcast-wars-just-got-really-ugly/",
    "timestamp": "2025-08-04T14:55:08Z"
  },
  {
    "title": "Thousands of Boeing workers who build fighter jets just went on strike",
    "description": "Saying “enough is enough,\" workers at three Boeing manufacturing plants went on strike overnight.",
    "link": "https://www.pbs.org/newshour/economy/thousands-of-boeing-workers-who-build-fighter-jets-just-went-on-strike",
    "timestamp": "2025-08-04T14:55:02Z"
  },
  {
    "title": "Donald Trump, IVF’s Deadbeat Dad",
    "description": "Since 2007, Jezebel has been the Internet's most treasured source for everything celebrities, sex, and politics...with teeth.",
    "link": "https://www.jezebel.com/donald-trump-ivfs-deadbeat-dad",
    "timestamp": "2025-08-04T14:54:19Z"
  },
  {
    "title": "Cornyn takes swing at James, Schiff with new LETITIA Act targeting 'crooked politicians'",
    "description": "Sen. John Cornyn's LETITIA Act targeted public officials who have committed fraud, following allegations against New York Attorney General Letitia James and Democrat Sen. Adam Schiff.",
    "link": "https://www.foxnews.com/politics/cornyn-takes-swing-james-schiff-new-letitia-act-targeting-crooked-politicians",
    "timestamp": "2025-08-04T14:50:24Z"
  },
  {
    "title": "Trump Slams Jaguar, Praises Actress Sydney Sweeney In Latest Anti-Woke Social Post",
    "description": "President Donald Trump took aim at \"woke\" marketing in a fiery Truth Social post Sunday, slamming Jaguar for a recent ad campaign and praising actress Sydney Sweeney's American Eagle spot.\n\"Sydney Sweeney, a registered Republican, has the HOTTEST ad out there…",
    "link": "https://biztoc.com/x/84ba62ab6fdc8fa8",
    "timestamp": "2025-08-04T14:50:03Z"
  },
  {
    "title": "Donald Trump Gets Good News From Most Accurate Pollster",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's net favorability rating is even among American voters, according to the latest Issues & Insights/TIPP Poll.\nThe survey found that 45 percent of voters view Trump favorably, while anoth…",
    "link": "https://biztoc.com/x/c9ffca9c986abd84",
    "timestamp": "2025-08-04T14:49:57Z"
  },
  {
    "title": "A breather from \"USA We're #Zip\" BS about BLS",
    "description": "Three very good, very generous Canadian friends conspired a while back to haul my depressed American ass out of its native rot and grace it with three weeks in their country of calm. So there, here, I sit. Lord, what a difference. It's downright heavenly. The…",
    "link": "https://www.pmcarpenter.com/post/a-breather-from-usa-we-re-zip-bs-about-bls",
    "timestamp": "2025-08-04T14:49:24Z"
  },
  {
    "title": "Putin Holds Phone Talks With Netanyahu",
    "description": "MOSCOW (Sputnik) - Russian President Vladimir Putin held a telephone conversation with Israeli Prime Minister Benjamin Netanyahu, Kremlin spokesman Dmitry Peskov said on Monday.",
    "link": "https://sputnikglobe.com/20250804/putin-holds-phone-talks-with-netanyahu-1122551302.html",
    "timestamp": "2025-08-04T14:48:46Z"
  },
  {
    "title": "Hassett Admits Donald Wants His Own People Cooking Jobs Report Data",
    "description": "White House Economic Adviser Kevin Hassett couldn't offer any evidence that the Bureau of Statistics was involved in any nefarious actions with their jobs reports and admitted Trump just wants to put his own people in.\nAfter the BLS issued the worst jobs repo…",
    "link": "https://crooksandliars.com/2025/08/hassett-admits-trump-wants-his-own-people",
    "timestamp": "2025-08-04T14:46:52Z"
  },
  {
    "title": "School Assembly Headlines for August 5: Top national, international, sports and business updates",
    "description": "Narendra Modi paid tribute to Shibu Soren. The Supreme Court criticized Rahul Gandhi's China remarks. India continued Russian oil imports. Unions and farmers announced a protest. Donald Trump planned a new labor statistics chief. Russia urged caution after Tr…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/school-assembly-headlines-for-august-5-top-national-international-sports-and-business-updates/articleshow/123098560.cms",
    "timestamp": "2025-08-04T14:46:34Z"
  },
  {
    "title": "West frustrated by Russia sanctions – WaPo",
    "description": "US President Donald Trump has recently cast doubt on the impact of restrictions, yet vowed to stay the course Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622476-west-frustrated-russia-sanctions-failure/",
    "timestamp": "2025-08-04T14:45:10Z"
  },
  {
    "title": "‘I Love Her Ad’: Trump Reacts to Sydney Sweeney’s Political Affiliation",
    "description": "President Donald Trump revealed his stance on actress Sydney Sweeney following her controversial new American Eagle jeans ad. Last week, American Eagle released a campaign... Read More\nThe post ‘I Love Her Ad’: Trump Reacts to Sydney Sweeney’s Political Affil…",
    "link": "https://www.dailysignal.com/2025/08/04/i-love-her-ad-trump-reacts-to-sydney-sweeneys-political-affiliation/",
    "timestamp": "2025-08-04T14:45:00Z"
  },
  {
    "title": "Texas Democrats Flee State To Block GOP's Illegal Gerrymandering Ploy",
    "description": "Texas Democrats have left the state in an effort to block Republicans latest attempt to steal the midterm elections by gerrymandering more House seats: Texas Democrats head to Illinois to deny Republicans a quorum on redistricting:\nIn an extraordinary move to…",
    "link": "https://crooksandliars.com/2025/08/texas-democrats-flee-state-block-gops",
    "timestamp": "2025-08-04T14:45:00Z"
  },
  {
    "title": "“The HOTTEST ad out there”: President Trump fawns over Sydney Sweeney after learning she’s a registered Republican",
    "description": "President Donald Trump is the latest conservative to praise Euphoria star Sydney Sweeney after learning that she is a registered Republican. While speaking to reporters in Allentown, Pennsylvania, on Sunday, Trump reacted to news regarding the 27-year-old act…",
    "link": "https://www.dailydot.com/viral-politics/trump-praises-sydney-sweeney-republican/",
    "timestamp": "2025-08-04T14:42:11Z"
  },
  {
    "title": "Tesla grants CEO Elon Musk $29 billion pay package",
    "description": "The new package comes just six months after a judge ordered the company to revoke his $56 billion pay package.",
    "link": "https://www.cbsnews.com/news/tesla-awards-29-billion-pay-package-to-ceo-elon-musk/",
    "timestamp": "2025-08-04T14:41:44Z"
  },
  {
    "title": "Donald Trump Gets Good News From Most Accurate Pollster",
    "description": "A new survey found that nearly half of all voters and 80 percent of Republicans have a favorable opinion of Trump, while just 13 percent view him unfavorably.",
    "link": "https://www.newsweek.com/donald-trump-good-news-pollster-2108438",
    "timestamp": "2025-08-04T14:40:39Z"
  },
  {
    "title": "Trump Is Desperately Trying to Rig Economic Data In His Favor",
    "description": "On Friday, Donald Trump fired Erika McEntarfer, the head of the Bureau of Labor\nStatistics, for the crime of doing her job. \nEarlier that day, the BLMS had released new jobs numbers that showed anemic\ngrowth in July—just 73,000 jobs were added—and revised num…",
    "link": "https://newrepublic.com/article/198743/trump-desperately-trying-rig-economic-data-favor",
    "timestamp": "2025-08-04T14:39:57Z"
  },
  {
    "title": "'They Say I Killed Epstein. I Didn’t Have Epstein Killed': Trump Rages Over Allegations He Was Involved in Billionaire Sicko's Mystery Death, Biographer Claims",
    "description": "President Donald Trump has raged over allegations he was involved in Jeffrey Epstein's death, according to a biographer.",
    "link": "https://radaronline.com/p/donald-trump-rages-allegations-involved-jeffrey-epstein-death-biographer-claims/",
    "timestamp": "2025-08-04T14:39:47Z"
  },
  {
    "title": "'Stupidity is terminal': Ridicule slams Nancy Mace minutes after governor run announcement",
    "description": "After months of speculation, Rep. Nancy Mace (R-SC) has finally made it official: she's running for Governor of South Carolina, entering a crowded field of candidates.Mace, who in her early years of Congress broke with her party and President Donald Trump on …",
    "link": "https://www.rawstory.com/nancy-mace-2673856716/",
    "timestamp": "2025-08-04T14:39:37Z"
  },
  {
    "title": "Texas Democrats Who Fled Respond to Greg Abbott's Legal Warning",
    "description": "The Democratic lawmakers left their home state in a bid to block a vote on redrawn U.S. House maps.",
    "link": "https://www.newsweek.com/texas-democrats-who-fled-response-greg-abbott-2108565",
    "timestamp": "2025-08-04T14:39:27Z"
  },
  {
    "title": "Trump's Former Labor Statistics Chief Says There's 'No Way' Jobs Numbers Were 'Rigged'",
    "description": "William Beach criticized the president for the shock firing of Erika McEntarfer, his successor at the Bureau of Labor Statistics.",
    "link": "https://www.huffpost.com/entry/trump-bureau-of-labor-statistics-william-beach_n_6890a81ce4b0b6f38d13cfcf",
    "timestamp": "2025-08-04T14:37:58Z"
  },
  {
    "title": "'Russia Only Understands Force': Ukraine Applauds Trump's Forward Deploying of Nuclear Submarines",
    "description": "Ukrainiane responded to President Trump redeploying two nuclear-powered submarines \"in the region\", saying the move had shut up loudmouths.\nThe post ‘Russia Only Understands Force’: Ukraine Applauds Trump’s Forward Deploying of Nuclear Submarines appeared fir…",
    "link": "https://www.breitbart.com/europe/2025/08/04/russia-only-understands-force-ukraine-lauds-trump-for-nuclear-subs/",
    "timestamp": "2025-08-04T14:37:02Z"
  },
  {
    "title": "EU will delay planned U.S. tariffs for six months to allow for trade talks",
    "description": null,
    "link": "https://www.cnbc.com/2025/08/04/trump-eu-trade-tariffs.html",
    "timestamp": "2025-08-04T14:36:36Z"
  },
  {
    "title": "That One Fujifilm Camera Everybody Badly Wants Now Costs Way More",
    "description": "If you want the TikTok-famous Fujifilm X100VI that takes dreamy, film-like photos, you'll need to pay even more.",
    "link": "https://gizmodo.com/that-one-fujifilm-camera-everybody-badly-wants-now-costs-way-more-2000638470",
    "timestamp": "2025-08-04T14:35:41Z"
  },
  {
    "title": "TV News Faces Creator Chaos as Anchors Chase Digital Dreams That Bring Big Bucks (or Return Little Reward)",
    "description": "When Don Lemon parted ways with CNN in 2023, he left armed with a few qualities that were bound to serve him in good stead. He was one of the most recognized anchors in the country, and he knew what it took to stand apart from the rest of the TV news pack. As…",
    "link": "https://variety.com/2025/tv/news/tv-news-faces-creator-chaos-anchors-exit-for-digital-dreams-1236477444/",
    "timestamp": "2025-08-04T14:35:00Z"
  },
  {
    "title": "Texas governor threatens to remove Democrats who left state in bid to block Trump-backed redistricting",
    "description": "Republican Texas Gov. Greg Abbott says he will begin trying to remove Democratic lawmakers from office Monday if they don't return after dozens of them left the state in a last-resort attempt to block redrawn U.S. House maps. U.S. President Donald Trump wants…",
    "link": "https://www.cbc.ca/news/world/texas-gerrymandering-walkout-1.7600877",
    "timestamp": "2025-08-04T14:33:25Z"
  },
  {
    "title": "EU to suspend US tariff countermeasures for 6 months",
    "description": "BRUSSELS: The European Union will suspend its two packages of countermeasures to US tariffs for six months following a deal with US President Donald Trump, a Commission spokesperson said on Mon",
    "link": "https://www.channelnewsasia.com/world/eu-suspend-us-tariff-countermeasures-6-months-5276306",
    "timestamp": "2025-08-04T14:32:56Z"
  },
  {
    "title": "Trump says will name new economics data official this week",
    "description": "WASHINGTON: United States President Donald Trump said on Monday (Aug 4) that he would pick an \"exceptional replacement\" to his labour statistics chief - after ordering her dismissal",
    "link": "https://www.channelnewsasia.com/world/trump-pick-labour-statistics-chief-replacement-jobs-data-erika-mcentarfer-5276336",
    "timestamp": "2025-08-04T14:32:00Z"
  },
  {
    "title": "Trump Compares ‘RIGGED’ Jobs Report to 2020 Election in Wild Rant",
    "description": "President Donald Trump has come out swinging against Democrats after firing the Bureau of Labor Statistics chief Dr. Erika McEntarfer last week for what he claims was \"RIGGED\" jobs data — and vowed to appoint an \"exceptional replacement.\"\nThe post Trump Compa…",
    "link": "https://www.mediaite.com/media/news/trump-compares-rigged-jobs-report-to-2020-election-in-wild-rant/",
    "timestamp": "2025-08-04T14:31:40Z"
  },
  {
    "title": "More Europeans are flying to Canada than ever before, aviation data shows",
    "description": "Flights between Europe and Canada are scheduled to reach a record high this month, while both sides have been turning away from traveling to the US.",
    "link": "https://www.businessinsider.com/more-europeans-flying-to-canada-instead-of-us-data-shows-2025-8",
    "timestamp": "2025-08-04T14:31:04Z"
  },
  {
    "title": "‘I Hate My Party’: Dem C-SPAN Callers Torch Democrats",
    "description": "Democratic C-SPAN callers rebuked their own party on Monday during a segment about whether they were pleased with its trajectory.",
    "link": "https://dailycaller.com/2025/08/04/dem-c-span-callers-torch-democrats/",
    "timestamp": "2025-08-04T14:29:49Z"
  },
  {
    "title": "Gary Busey Pleads Guilty to Sex Offense In Cherry Hill",
    "description": "Check phillymag.com each morning Monday through Thursday for the latest edition of Philly Today. And if you have a news tip for our hardworking Philly […]",
    "link": "https://www.phillymag.com/news/2025/08/04/gary-busey/",
    "timestamp": "2025-08-04T14:29:39Z"
  },
  {
    "title": "Trump stokes conspiracies about jobs data, as White House defends firing BLS chief",
    "description": "The comments are the latest effort by the White House to undercut economic data that does not fit within Trump's political narrative.",
    "link": "https://www.cnbc.com/2025/08/04/trump-bls-chief-firing-jobs-data-.html",
    "timestamp": "2025-08-04T14:29:35Z"
  },
  {
    "title": "Texas governor threatens to remove Democrats who left state over Trump-backed redistricting",
    "description": "The dramatic move Sunday could expose Democrats to fines and other penalties. Democrats have cast the decision to leave the state as a last-ditch effort to stop Republicans from pushing through a rare mid-decade redrawing of the congressional map.",
    "link": "https://www.pbs.org/newshour/politics/texas-governor-threatens-to-remove-democrats-who-left-state-over-trump-backed-redistricting",
    "timestamp": "2025-08-04T14:28:59Z"
  },
  {
    "title": "Pritzker Bashes Trump as Texas Democrats Flee to Illinois",
    "description": "Texas Democratic lawmakers said they left the state in an effort to temporarily block Republicans from redrawing its congressional maps — a redistricting initiative pushed by President Donald Trump to help retain GOP control of the US House of Representatives…",
    "link": "https://biztoc.com/x/18883d299bb6de70",
    "timestamp": "2025-08-04T14:27:36Z"
  },
  {
    "title": "Trump-Aligned Nancy Mace Runs For South Carolina Governor",
    "description": "Rep. Nancy Mace (R-SC) announced her campaign for South Carolina governor on Monday, officially entering the 2026 GOP primary. Mace, currently serving her third term in Congress, released a campaign video highlighting her strong support for President Donald T…",
    "link": "https://biztoc.com/x/566493c1700ac5ec",
    "timestamp": "2025-08-04T14:27:21Z"
  },
  {
    "title": "Russia warns against 'nuclear rhetoric' amid Trump row",
    "description": "The Kremlin has played down the significance of Trump repositioning US submarines in response to an inflammatory post by Dmitry Medvedev. The Kremlin on Monday urged a tamping down of nuclear rhetoric after US President Donald Trump reacted to threats leveled…",
    "link": "https://www.dw.com/en/russia-warns-against-nuclear-rhetoric-amid-trump-row/a-73523632",
    "timestamp": "2025-08-04T14:27:00Z"
  },
  {
    "title": "Fighter Jets Intercept Plane as It Infringes on Trump's Airspace",
    "description": "Fighters jets had to be sent aloft Sunday after an aircraft violated the restricted space over President Donald Trump's New Jersey golf club.",
    "link": "https://www.westernjournal.com/fighter-jets-intercept-plane-infringes-trumps-airspace/",
    "timestamp": "2025-08-04T14:26:59Z"
  },
  {
    "title": "Karl Rove Warns Trump That He’s Making the Same ‘Big Mistake’ Joe Biden Did",
    "description": "Karl Rove warned President Donald Trump that he's \"making the same mistake\" Joe Biden did and is likely to pay a political price for it.\nThe post Karl Rove Warns Trump That He’s Making the Same ‘Big Mistake’ Joe Biden Did first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/karl-rove-warns-trump-that-hes-making-the-same-big-mistake-joe-biden-did/",
    "timestamp": "2025-08-04T14:24:16Z"
  },
  {
    "title": "The ASEAN-GCC-China Summit Marks the Transformation of China’s Diplomatic and Economic Strategies",
    "description": "At the end of May, I traveled to Malaysia to attend the ASEAN-GCC-China Summit. Although the official agenda centered on multilateral economic cooperation, it quickly became clear that geopolitics — particularly China’s growing assertiveness — had begun to do…",
    "link": "https://www.fairobserver.com/economics/the-asean-gcc-china-summit-marks-the-transformation-of-chinas-diplomatic-and-economic-strategies/",
    "timestamp": "2025-08-04T14:23:21Z"
  },
  {
    "title": "CNN’s Elie Honig Says Office Of Special Counsel’s Investigation Is Not A ‘Welcome Development’ For Jack Smith",
    "description": "CNN's Elie Honig said that the investigation into whether former Special Counsel Jack Smith's engaged in illegal activity could possibly not end well for him.",
    "link": "https://dailycaller.com/2025/08/04/cnn-elie-honig-special-counsel-investigation-jack-smith/",
    "timestamp": "2025-08-04T14:21:49Z"
  },
  {
    "title": "Plastics Cause Over $1.5 Trillion in 'Health-Related Economic Losses' Per Year Globally",
    "description": "As world leaders prepared to take part in the final round of plastics treaty talks in Geneva this week, a study published in The Lancet on Sunday estimated that plastics are responsible for more than $1.5 trillion in \"health-related economic losses\" worldwide…",
    "link": "https://www.commondreams.org/news/plastic-pollution-crisis",
    "timestamp": "2025-08-04T14:20:57Z"
  },
  {
    "title": "Musk-Backed PAC Shells Out Over $1 Million To Tout Trump’s ‘Big, Beautiful’ Law",
    "description": "BAF is dishing out over $1 million to promote recent GOP accomplishments, including the president's \"One Big Beautiful Bill Act,\" Politico reported Monday.",
    "link": "https://dailycaller.com/2025/08/04/elon-musk-building-americas-future-big-beautiful-bill/",
    "timestamp": "2025-08-04T14:19:55Z"
  },
  {
    "title": "US factory orders fall sharply in June on aircraft orders drop",
    "description": "Factory orders tumbled 4.8% after an upwardly revised 8.3% increase in May, the Commerce Department's Census Bureau said on Monday.  Economists polled by...",
    "link": "https://finance.yahoo.com/news/us-factory-orders-fall-sharply-141946083.html",
    "timestamp": "2025-08-04T14:19:46Z"
  },
  {
    "title": "Banana republic? Trump puts credibility of US economic data on the line",
    "description": "Trump's firing of the head of the Bureau of Labor Statistics raises fears for the integrity of official statistics.",
    "link": "https://www.aljazeera.com/economy/2025/8/4/banana-republic-trump-puts-credibility-of-us-economic-data-on-the-line",
    "timestamp": "2025-08-04T14:19:05Z"
  },
  {
    "title": "South Africa grappling with US tariffs – president",
    "description": "South Africa’s president has said his government will scale up trade missions into new markets in the coming months Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/622473-south-africa-grappling-us-tariffs-impact/",
    "timestamp": "2025-08-04T14:17:30Z"
  },
  {
    "title": "In Desperate Bid to Get Elon Musk to Stay, Tesla Awards Him $29 Billion",
    "description": "After many months of plummeting sales and disastrous earnings, Tesla has awarded its controversial CEO a whopping $29 billion worth of its shares in a desperate bid to keep him at the firm — and not throw him out. After a Delaware judge threw out his astronom…",
    "link": "https://futurism.com/elon-musk-stay-tesla-board-29-billion",
    "timestamp": "2025-08-04T14:16:59Z"
  },
  {
    "title": "What To Ponder Before AI “Devastates” Jobs",
    "description": "AI won’t devastate jobs—but Washington might use job-loss fears to expand power, push UBI, and entrench the administrative state.",
    "link": "https://www.forbes.com/sites/waynecrews/2025/08/04/what-to-ponder-before-ai-devastates-jobs/",
    "timestamp": "2025-08-04T14:16:36Z"
  },
  {
    "title": "Putin's Russia sends direct Nuclear message to Donald Trump. What will U.S. do now?",
    "description": "Russia-USA nuclear war, if it happens, will endgame for the world. However, the row between US President Donald Trump and Russian president Dmitry Medvedev is stoking much fears.",
    "link": "https://economictimes.indiatimes.com/news/international/us/putins-russia-sends-direct-nuclear-message-to-donald-trump-what-will-u-s-do-now/articleshow/123098086.cms",
    "timestamp": "2025-08-04T14:16:32Z"
  },
  {
    "title": "How an Alleged Ponzi Scheme Left Investors and Politicians in the South Reeling",
    "description": "CEDARTOWN, Ga. (AP) — A federal receiver is on the hunt to recover $140 million lost in an alleged Ponzi scheme that benefited some Republicans in the top ranks of their party in Georgia and Alabama. He’s looking to claw …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/08/04/834442.htm",
    "timestamp": "2025-08-04T14:14:29Z"
  },
  {
    "title": "Donald Trump: ‘If Sydney Sweeney Is a Registered Republican,’ Then ‘I Think Her’ American Eagle Jeans Ad Is ‘Fantastic’ - Va",
    "description": "Donald Trump: ‘If Sydney Sweeney Is a Registered Republican,’ Then ‘I Think Her’ American Eagle Jeans Ad Is ‘Fantastic’Variety Trump praises Sydney Sweeney's ad campaign after learning she's a registered RepublicanFox News ‘It’ll be carnage’: why Sydney Sween…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178561636",
    "timestamp": "2025-08-04T14:12:32Z"
  },
  {
    "title": "August blockade by Democrats on Guilfoyle and 130 other nominees – Trump furious",
    "description": "Approval of Guilfoyle as U.S. Ambassador to Greece Delayed Until at Least Late September – Trump Lashes Out – Democrats Cite “Unqualified Nominations”\nThe post August blockade by Democrats on Guilfoyle and 130 other nominees – Trump furious appeared first on …",
    "link": "https://en.protothema.gr/2025/08/04/august-blockade-by-democrats-on-guilfoyle-and-130-other-nominees-trump-furious/",
    "timestamp": "2025-08-04T14:11:57Z"
  },
  {
    "title": "‘It’s Terrible’: Charles Payne Erupts Over ‘Antiquated’ Economic Data After Trump Cans BLS Leader",
    "description": "Charles Payne called the data from the Bureau of Labor Statistics “terrible” and “antiquated,” saying Donald Trump was right to fire the head of the agency.",
    "link": "https://dailycaller.com/2025/08/04/harles-payne-antiquated-economic-data-trump-bls-leader/",
    "timestamp": "2025-08-04T14:11:18Z"
  },
  {
    "title": "Ronald Reagan Would Have Hated Trump’s Tariffs",
    "description": "Joseph J. Thorndike contrasts Ronald Reagan’s approach to international trade with the tariff policy of the Trump administration.",
    "link": "https://www.forbes.com/sites/taxnotes/2025/08/04/ronald-reagan-would-have-hated-trumps-tariffs/",
    "timestamp": "2025-08-04T14:08:14Z"
  },
  {
    "title": "Iran Military Chief Warns of New Attacks",
    "description": "Iran says it is developing missiles and drones as the threat from Israel grows.",
    "link": "https://www.newsweek.com/iran-military-chief-warns-new-attacks-2108324",
    "timestamp": "2025-08-04T14:06:29Z"
  },
  {
    "title": "Stocks Rebound On US Rate Cut Bets",
    "description": "Most stock markets bounced on Monday on hopes of US interest rate cuts after weak jobs figures raised concerns about the world's top economy.",
    "link": "https://www.ibtimes.com/stocks-rebound-us-rate-cut-bets-3780136",
    "timestamp": "2025-08-04T14:06:11Z"
  },
  {
    "title": "Mailing It In at Morning Joe? Joe and Mika’s Summer of Absence Speaks Volumes",
    "description": "Joe and Mika have missed 2/3 of Morning Joe episodes since Memorial Day—just as MSNBC braces for a rebrand. Is this a vacation, or a calculated power flex?\nThe post Mailing It In at Morning Joe? Joe and Mika’s Summer of Absence Speaks Volumes first appeared o…",
    "link": "https://www.mediaite.com/media/news/mailing-it-in-at-morning-joe-joe-and-mikas-summer-of-absence-speaks-volumes/",
    "timestamp": "2025-08-04T14:04:58Z"
  },
  {
    "title": "‘Go to Hell’: Trump Accuses Schumer Of Extortion Tactics",
    "description": "By Olivia Pero, The Daily Signal | August 03, 2025\nPresident Donald Trump accused Senate Minority Leader Chuck Schumer, D-N.Y., of demanding over $1 billion in order to approve some of his judicial nominations in a post on his social media platform Saturday e…",
    "link": "https://biztoc.com/x/b5f5fd27bd4ed620",
    "timestamp": "2025-08-04T14:04:47Z"
  },
  {
    "title": "Trump Praises Sydney Sweeney’s Controversial Ad",
    "description": "\"Sydney Sweeney’s controversial American Eagle ad may have divided some of her fanbase, but she has a new supporter in President Donald Trump,\" The Wrap reports. \"The commander-in-chief praised the 'Americana' actress’ Great Jeans campaign",
    "link": "https://politicalwire.com/2025/08/04/trump-praises-sydney-sweeneys-controversial-ad/",
    "timestamp": "2025-08-04T14:02:13Z"
  },
  {
    "title": "All major Las Vegas Strip casinos are now unionized in historic labor victory",
    "description": "LAS VEGAS — When Susana Pacheco accepted a housekeeping job at a casino on the Las Vegas Strip 16 years ago, she believed it was a step toward stability for her and her 2-year-old daughter",
    "link": "https://www.nbcnews.com/business/business-news/major-las-vegas-strip-casinos-are-now-unionized-historic-labor-victory-rcna222871",
    "timestamp": "2025-08-04T14:01:42Z"
  },
  {
    "title": "Taxing the Rich: It’s Complicated",
    "description": "After months of debate, and substantial changes along the way, this summer Congress successfully enacted a landmark package of tax and spending cuts, a key component of Donald Trump’s legislative agenda. Trump’s “big beautiful bill” (HR 1) will reduce taxes b…",
    "link": "https://www.econlib.org/library/columns/y2025/ragusataxingtherich.html",
    "timestamp": "2025-08-04T14:01:00Z"
  },
  {
    "title": "Arizona Lawmaker Pens Letter to Trump Demanding Federal Investigation Into Voting Systems",
    "description": "An Arizona Republican is calling for the federal government to examine whether the Wild West lives on in Arizona’s elections instead of the rule of law.\nThe post Arizona Lawmaker Pens Letter to Trump Demanding Federal Investigation Into Voting Systems appeare…",
    "link": "https://www.thegatewaypundit.com/2025/08/arizona-lawmaker-pens-letter-trump-demanding-federal-investigation/",
    "timestamp": "2025-08-04T14:00:32Z"
  },
  {
    "title": "Crypto Firm Bullish Seeks to Raise Up to $629M in New York Share Sale",
    "description": "At the top end of the $28-$31 price range, the company would have a valuation of about $4.2 billion.",
    "link": "https://www.coindesk.com/business/2025/08/04/crypto-exchange-bullish-seeks-to-raise-up-to-usd629m-in-new-york-share-sale",
    "timestamp": "2025-08-04T14:00:05Z"
  },
  {
    "title": "Why Trump's ballroom is a sign of his own doom",
    "description": "U.S. President Donald Trump’s $200 million plan to construct a new golden ballroom at the White House is not just a monument to narcissism. It is statecraft by spectacle, financed by national rot. The timing is not subtle. It arrives alongside his “One Big, B…",
    "link": "https://www.rawstory.com/trump-ballroom-2673856417/",
    "timestamp": "2025-08-04T14:00:03Z"
  },
  {
    "title": "Matty Brown Talks ‘The Sand Castle’ As Migrant Drama Becomes Most Watched Arabic Language Title On Netflix In First Half Of 2025",
    "description": "The image of the lifeless body of two-year-old Kurdish-Syrian boy Alan Kurdi lying washed up on a Turkish beach shocked the world in September 2015. His death, alongside that of his mother and brother, came to symbolize the tragedy of the refugee crisis unfol…",
    "link": "http://deadline.com/2025/08/matty-brown-most-watched-arabic-drama-sand-castle-netflix-1236476410/",
    "timestamp": "2025-08-04T14:00:00Z"
  },
  {
    "title": "Trump lashes out at “low IQ,” “sleazebag” Charlamagne tha God over Epstein comments on Fox News",
    "description": "President Donald Trump recently took to his Truth Social platform to lash out at radio personality Charlamagne tha God following an interview on Fox News. Charlamagne appeared on My View with Lara Trump, the president’s daughter-in-law, on Sunday. In it, he g…",
    "link": "https://www.dailydot.com/viral-politics/trump-slams-charlamagne-tha-god/",
    "timestamp": "2025-08-04T14:00:00Z"
  },
  {
    "title": "Ukraine Hits Russian Oil Depot as Trump’s Ceasefire Deadline Looms",
    "description": "Ukrainian forces continued to hit military-linked infrastructure deep inside Russia, as Kyiv and Moscow traded strikes ahead of a deadline set by US President Donald Trump for the Kremlin to accept a peace deal with Ukraine. Russian authorities in the Black S…",
    "link": "https://oilprice.com/Energy/Energy-General/Ukraine-Hits-Russian-Oil-Depot-as-Trumps-Ceasefire-Deadline-Looms.html",
    "timestamp": "2025-08-04T14:00:00Z"
  },
  {
    "title": "China is winning the trade war Trump started (Max Boot/Washington Post)",
    "description": "Max Boot / Washington Post:\nChina is winning the trade war Trump started  —  On many fronts, Trump is inadvertently aiding China's anti-American dictatorship.  —  Just now  —  In January, President Donald Trump declared trade war on China.  It gives me no ple…",
    "link": "https://www.memeorandum.com/250804/p37",
    "timestamp": "2025-08-04T14:00:00Z"
  },
  {
    "title": "The 3 biggest problems with the new and unwarranted investigation into Jack Smith (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nThe 3 biggest problems with the new and unwarranted investigation into Jack Smith  —  For years, Team Trump treated the Hatch Act like a joke.  To target former special counsel Jack Smith, it's apparently changed its mind.  —  It's a seri…",
    "link": "https://www.memeorandum.com/250804/p36",
    "timestamp": "2025-08-04T14:00:00Z"
  },
  {
    "title": "The Cost of Building Progress",
    "description": "<ul>\n<li>Book Review of: Why Nothing Works: Who Killed Progress–and How to Bring It Back by Marc J. Dunkelman,1; and</li>\n</ul>\n<ul>\n<li>Abundance by Ezra Klein and Derek Thompson.2</li>\n</ul>\n\r\n\n\nVera Coking and the Cost of Progress\r\n\nIn 1961, Vera Coking an…",
    "link": "https://www.econlib.org/library/columns/y2025/zwolinskibuilding.html",
    "timestamp": "2025-08-04T13:59:52Z"
  },
  {
    "title": "Surprised that Soros Is Tied Up in the Trump-Russia Hoax? Don’t Be!",
    "description": "The declassified appendix to the much-anticipated report by Special Counsel John Durham has sent the internet ablaze over its documentation of Hillary Clinton's insidious scheme in 2016 to falsely tie then-candidate Donald Trump to Russia in order to boost he…",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/08/04/surprised-george-soros-somehow-tied-russia-collusion-hoax",
    "timestamp": "2025-08-04T13:59:22Z"
  },
  {
    "title": "La política que Estados Unidos necesita ahora",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/new-movement-seeks-to-revive-american-universalism-by-anne-marie-slaughter-2025-08/spanish",
    "timestamp": "2025-08-04T13:58:36Z"
  },
  {
    "title": "Charlamagne Tha God Responds To Trump, Calls Out His “Authoritarian Strategy,” But Adds, “I’m Rooting For You, But I Need You Focused”",
    "description": "Charlamagne tha God responded on Monday to Donald Trump’s attack on him, calling out the administration’s “authoritarian strategy” while reiterating that the president has failed to focus on what he promised during the campaign. The Breakfast Club co-host app…",
    "link": "http://deadline.com/2025/08/charlamagne-tha-god-trump-authoritarian-1236477658/",
    "timestamp": "2025-08-04T13:58:12Z"
  },
  {
    "title": "Charlamagne Tha God Responds To Trump, Calls Out His “Authoritarian Strategy,” But Adds, “I’m Rooting For You, But I Need You Focused”",
    "description": "Charlamagne tha God responded on Monday to Donald Trump’s attack on him, calling out the administration’s “authoritarian strategy” while reiterating that the...",
    "link": "https://deadline.com/2025/08/charlamagne-tha-god-trump-authoritarian-1236477658/",
    "timestamp": "2025-08-04T13:58:12Z"
  },
  {
    "title": "US stocks rise and recover roughly half of Friday’s wipeout",
    "description": "U.S. stocks are recovering roughly half of their sharp losses from Friday's wipeout.",
    "link": "https://www.bostonherald.com/2025/08/04/stock-market-rebound-friday-wipeout/",
    "timestamp": "2025-08-04T13:57:47Z"
  },
  {
    "title": "South Africa seeks new export markets as US tariff looms",
    "description": "While the government negotiates a mutually beneficial deal with the US, it says it is making plans to diversify its export marke",
    "link": "https://mg.co.za/business/2025-08-04-south-africa-seeks-new-export-markets-as-us-tariff-looms/",
    "timestamp": "2025-08-04T13:56:07Z"
  },
  {
    "title": "Cambodia Nominates Trump For Peace Prize, Becoming The Third Country To Do So",
    "description": "By Olivia Pero, The Daily Signal | August 03, 2025\nCambodia announced Friday it will nominate President Donald Trump for the Nobel Peace Prize after he helped bring the Cambodia-Thailand border conflict to a ceasefire agreement.\n“He should get the Nobel, not …",
    "link": "https://biztoc.com/x/22d4f48a1b125678",
    "timestamp": "2025-08-04T13:53:51Z"
  },
  {
    "title": "US tariffs put 30,000 South African jobs at risk, officials say",
    "description": "South African authorities have warned that U.S. reciprocal tariffs could put an estimated 30,000 jobs at risk",
    "link": "https://abcnews.go.com/Business/wireStory/us-tariffs-put-30000-south-african-jobs-risk-124343877",
    "timestamp": "2025-08-04T13:51:09Z"
  },
  {
    "title": "Trump and Vance Just Love Sydney Sweeney’s “Great Jeans” Ad, If She’s A Republican",
    "description": "“She's a registered Republican?” asked Trump after being asked for his thoughts. \"Oh, now I love her ad.\"",
    "link": "https://www.vanityfair.com/hollywood/story/sydney-sweeney-trump-vance-jeans",
    "timestamp": "2025-08-04T13:49:55Z"
  },
  {
    "title": "US tariffs put 30,000 South African jobs at risk, officials say",
    "description": "The U.S. plans to impose a 30% tariff on South African goods.",
    "link": "https://www.bostonherald.com/2025/08/04/us-tariffs-south-african-impact/",
    "timestamp": "2025-08-04T13:49:26Z"
  },
  {
    "title": "US tariffs put 30,000 South African jobs at risk, officials say",
    "description": "JOHANNESBURG (AP) — U.S. reciprocal tariffs have put an estimated 30,000 jobs at risk, South African authorities said Monday, four days before a 30% U.S. tariff on most imports from South Africa kicks in. South Africa was slapped with one of the highest tarif…",
    "link": "https://financialpost.com/pmn/us-tariffs-put-30000-south-african-jobs-at-risk-officials-say",
    "timestamp": "2025-08-04T13:48:46Z"
  }
]