[
  {
    "title": "NATO Launches Global Arms Race As Defense Spending Set To Explode",
    "description": "agreed to boost defense spending to 5% of GDP by 2035, with a floor of 3.5% earmarked for “core military needs.”",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/06/30/nato-launches-global-arms-race-as-defense-spending-set-to-explode/",
    "timestamp": "2025-06-30T16:51:42Z"
  },
  {
    "title": "Trump’s Iran Oil Comments Strain His ‘Maximum Pressure’ Policy",
    "description": "President Donald Trump indicated that he might be preparing to ease his “maximum pressure” campaign against Iran, potentially undercutting a central policy dating to his first term and provoking consternation among foreign policy hawks who argue that now is t…",
    "link": "https://gcaptain.com/trumps-iran-oil-comments-strain-his-maximum-pressure-policy/",
    "timestamp": "2025-06-30T16:51:14Z"
  },
  {
    "title": "Democratic groups target 'non-political spaces' in new campaign ahead of fall elections and 2026 midterms",
    "description": "WASHINGTON — Democratic groups are kicking off a new community organizing effort this summer, taking aim at Republican priorities and widening their scope to include \"non-political spaces\" like book clubs and sports forums",
    "link": "https://www.nbcnews.com/politics/elections/democratic-groups-target-non-political-spaces-new-campaign-ahead-fall-rcna215922",
    "timestamp": "2025-06-30T16:50:54Z"
  },
  {
    "title": "Supreme Court to Hear JD Vance Case",
    "description": "The case, which centers on free speech claims, involves VP Vance, who was a Senate candidate in Ohio when the lawsuit was initiated.",
    "link": "https://www.newsweek.com/supreme-court-jd-vance-campaign-finance-ohio-case-2092657",
    "timestamp": "2025-06-30T16:48:23Z"
  },
  {
    "title": "Exclusive — Rwandan Foreign Minister: Trump ‘Absolutely’ ‘Deserves the Nobel Peace Prize’ for Helping End 30-Year Conflict with Congo Peace Agreement",
    "description": "WASHINGTON — Rwanda’s Foreign Minister Olivier Nduhungirehe told Breitbart News exclusively on Saturday that U.S. President Donald Trump \"absolutely... deserves the Nobel Peace Prize” for his work to help end the bloody 30-year conflict in the agreement Trump…",
    "link": "https://www.breitbart.com/politics/2025/06/30/exclusive-rwandan-foreign-minister-trump-absolutely-deserves-the-nobel-peace-prize-for-helping-end-30-year-conflict-with-congo-peace-agreement/",
    "timestamp": "2025-06-30T16:47:36Z"
  },
  {
    "title": "A more defensive Pride: Activists say celebrations are more critical as US, conservative states rescind LGBTQ protections",
    "description": "'There’s a lot of anxiety about the rights that we have and are they going to stick around much longer?'",
    "link": "https://www.bostonherald.com/2025/06/30/pride-under-attack/",
    "timestamp": "2025-06-30T16:46:15Z"
  },
  {
    "title": "Why is Ukraine withdrawing from the Ottawa Treaty banning landmines?",
    "description": "If Russia plans to broaden the ground war, Ukraine may need deeper lines of defence. Landmines could prove critical.",
    "link": "https://www.aljazeera.com/news/2025/6/30/why-is-ukraine-withdrawing-from-the-ottawa-treaty-banning-landmines",
    "timestamp": "2025-06-30T16:45:46Z"
  },
  {
    "title": "Gaza Rescuers Say Israeli Forces Kill 48 As Ceasefire Calls Mount",
    "description": "Gaza's civil defence agency said Israeli forces killed at least 48 people on Monday, including 21 at a seafront rest area, as fresh calls grew for a ceasefire in the war-ravaged Palestinian territory.",
    "link": "https://www.ibtimes.com.au/gaza-rescuers-say-israeli-forces-kill-48-ceasefire-calls-mount-1859471",
    "timestamp": "2025-06-30T16:45:18Z"
  },
  {
    "title": "Gaza Rescuers Say Israeli Forces Kill 48 As Ceasefire Calls Mount",
    "description": "Gaza's civil defence agency said Israeli forces killed at least 48 people on Monday, including 21 at a seafront rest area, as fresh calls grew for a ceasefire in the war-ravaged Palestinian territory.",
    "link": "https://www.ibtimes.com/gaza-rescuers-say-israeli-forces-kill-48-ceasefire-calls-mount-3777263",
    "timestamp": "2025-06-30T16:45:11Z"
  },
  {
    "title": "4th of July Free America protests: Who are the organisers 50501 movement and how Americans can participate",
    "description": "Several groups plan protests across America during the Fourth of July weekend. Women's March and 50501 Movement are organizing these events. They aim to voice opposition to Donald Trump's policies. Protests will occur in all 50 states. A second day of protest…",
    "link": "https://economictimes.indiatimes.com/news/international/us/4th-of-july-free-america-protests-who-are-the-organisers-50501-movement-and-how-americans-can-participate/articleshow/122164536.cms",
    "timestamp": "2025-06-30T16:44:20Z"
  },
  {
    "title": "Supreme Court Takes Up Case That Could Change Elections as We Know It",
    "description": "The Supreme Court on Monday agreed to hear a Republican-led case that could upend campaign finance law and allow national party committees to spend even more on elections. \r\nRight now, political parties can spend an unlimited amount on a candidate individuall…",
    "link": "https://newrepublic.com/post/197425/supreme-court-republican-challenge-campaign-finance-elections",
    "timestamp": "2025-06-30T16:43:27Z"
  },
  {
    "title": "Iran Officials Mock Trump’s Ineffective Bombs, Damning New Report Says",
    "description": "Even the Iranians are surprised by how little damage Donald Trump’s bombs apparently did.\r\nAn intercepted communication between Iranian officials indicated that the nuclear facility airstrike had not achieved the level of damage touted by the Trump administra…",
    "link": "https://newrepublic.com/post/197428/iran-officials-donald-trump-bombs-damning-report",
    "timestamp": "2025-06-30T16:43:18Z"
  },
  {
    "title": "Follow The Leaders - Here Are The 50 Strongest Stocks Of 2025",
    "description": "Follow The Leaders - Here Are The 50 Strongest Stocks Of 2025. Here are the strongest stocks of 2025.",
    "link": "https://www.forbes.com/sites/adamsarhan/2025/06/30/follow-the-leadershere-are-the-50-strongest-stocks-of-2025/",
    "timestamp": "2025-06-30T16:42:48Z"
  },
  {
    "title": "Business Owner Raided by CBP Agents Says They Refused to Show a Warrant: 'I Feel Like My Rights Were Violated'",
    "description": "A California car wash owner says ICE agents refused to show him a warrant while raiding his business, leaving him feeling like his \"rights were violated.\"",
    "link": "https://www.ibtimes.com/business-owner-raided-cbp-agents-says-they-refused-show-warrant-i-feel-like-my-rights-were-3777262",
    "timestamp": "2025-06-30T16:40:14Z"
  },
  {
    "title": "Justice Department Announces Chilling Plan to Revoke Citizenship",
    "description": "Under Donald Trump, the Department of Justice is looking to ramp up denaturalization, or the revocation of citizenship, in order to fulfil its mass-deportation immigration agenda.\r\nA June 11 memo from Assistant Attorney General Brett Shumate listed “prioritiz…",
    "link": "https://newrepublic.com/post/197422/justice-department-plan-revoke-citizenship-naturalized-americans",
    "timestamp": "2025-06-30T16:39:53Z"
  },
  {
    "title": "Critics howl over 'silly little cartoon' used to sell Trump bill",
    "description": "The U.S. Senate voted 51-49 Saturday on a procedural advancement of President Donald Trump's \"big, beautiful bill.\" Trump is making a concerted effort to berate GOP senators into voting \"yes\" if the bill clears additional hurdles and advances to a full Senate…",
    "link": "https://www.rawstory.com/unhinged-trump-draws-scathing-mockery-for-using-silly-little-cartoon-to-sell/",
    "timestamp": "2025-06-30T16:37:20Z"
  },
  {
    "title": "How Trump Rebuffed D.C. Warmongers With One Surgical Strike Against Iran",
    "description": "For the first time in a generation, the United States is exclusively pursuing its vital interests, not the ambitions of its NatSec elites.President Donald Trump’s decision to bomb Iran’s nuclear facilities last week might be a historical turning point. In a s…",
    "link": "https://freerepublic.com/focus/f-news/4326107/posts",
    "timestamp": "2025-06-30T16:36:52Z"
  },
  {
    "title": "EXCLUSIVE: Freedom Caucus Chair Moves To Defang Agency Cherished By ‘Political Establishment’",
    "description": "Rep. Andy Harris introduced a bill Friday placing limits on a congressional agency's ability to block President Donald Trump's spending decisions.",
    "link": "https://dailycaller.com/2025/06/30/exclusive-andy-harris-bill-defang-government-accountability-office/",
    "timestamp": "2025-06-30T16:34:41Z"
  },
  {
    "title": "Chicago teachers' union chief says 'all children belong to the union'",
    "description": "Chicago Teachers Union (CTU) president Stacy Davis Gates recently said that “all children belong to” the union. Seriously. For real. According to the Daily Caller, Gates trashed President Trump for diminishing the power of teachers’ unions during a recent Cit…",
    "link": "https://freerepublic.com/focus/f-chat/4326106/posts",
    "timestamp": "2025-06-30T16:32:39Z"
  },
  {
    "title": "States brace for impact as Trump's big bill nears completion in Congress",
    "description": "States brace for impact as Trump's big bill nears completion in Congressnews4jax.com",
    "link": "https://www.news4jax.com/health/2025/06/30/states-brace-for-impact-as-trumps-big-bill-nears-completion-in-congress/",
    "timestamp": "2025-06-30T16:30:34Z"
  },
  {
    "title": "Trump’s threat to end trade negotiations with Canada over new tax brings results",
    "description": "Carney says decision made to 'support a resumption of negotiations toward the July 21, 2025, timeline set out at this month's G7 leaders' summit'",
    "link": "https://www.wnd.com/2025/06/trumps-threat-end-trade-negotiations-canada-new-tax/",
    "timestamp": "2025-06-30T16:30:19Z"
  },
  {
    "title": "Kristi Noem Secretly Pocketed Cash From Dark Money Group: Report (Nikki McCann Ramirez/Rolling Stone)",
    "description": "Nikki McCann Ramirez / Rolling Stone:\nKristi Noem Secretly Pocketed Cash From Dark Money Group: Report  —  The Homeland Security secretary didn't disclose $80,000 she accepted during her time as South Dakota's governor, according to ProPublica  —  Much like P…",
    "link": "https://www.memeorandum.com/250630/p78",
    "timestamp": "2025-06-30T16:30:00Z"
  },
  {
    "title": "Clean Energy Gutted in Last-Minute Rewrite of Trump’s $1.2T Senate Tax Bill",
    "description": "Senate Republicans stunned clean energy developers early Monday by inserting sweeping revisions to President Donald Trump’s $1.2-trillion “One Big, Beautiful Bill” just ahead of floor debate. The last-minute amendments slash wind and solar tax incentives, int…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Clean-Energy-Gutted-in-Last-Minute-Rewrite-of-Trumps-12T-Senate-Tax-Bill.html",
    "timestamp": "2025-06-30T16:30:00Z"
  },
  {
    "title": "CNN Data Chief Hits Trump With Some 'Terrible, Terrible, Terrible' New Numbers (Ed Mazza/HuffPost)",
    "description": "Ed Mazza / HuffPost:\nCNN Data Chief Hits Trump With Some ‘Terrible, Terrible, Terrible’ New Numbers  —  Harry Enten said the president's signature “big, beautiful bill” is not at all popular with the public.  —  CNN data chief Harry Enten said President Donal…",
    "link": "https://www.memeorandum.com/250630/p80",
    "timestamp": "2025-06-30T16:30:00Z"
  },
  {
    "title": "Canada rescinds digital services tax for the US: What is it and why did Trump want it gone?",
    "description": "The Canadian government rescinded a digital services tax that was set to take effect on Monday after President Donald Trump threatened to break off trade negotiations between the U.S. and Canada over the tax.\nCanada's government adopted its 3% digital service…",
    "link": "https://biztoc.com/x/01f1ba5255ed710e",
    "timestamp": "2025-06-30T16:28:44Z"
  },
  {
    "title": "IAEA: Iran could enrich uranium 'within months'",
    "description": "What happened\nThe chief United Nations nuclear inspector, Rafael Grossi, told CBS News Sunday that Iran could be enriching uranium again in a \"matter of months.\" President Donald Trump, meanwhile, repeated on Fox News his initial assertion that Tehran's nucle…",
    "link": "https://biztoc.com/x/42923bdd3127ef21",
    "timestamp": "2025-06-30T16:28:39Z"
  },
  {
    "title": "State Department Revokes Visas of Bob Vylan Band After 'Death to IDF' Chant",
    "description": "The State Department announced Monday that it had revoked the U.S. visas of the members of the U.K. band Bob Vylan, who had led the crowd at the televised Glastonbury festival in chants of \"Death to the IDF!\"\nThe post State Department Revokes Visas of Bob Vyl…",
    "link": "https://www.breitbart.com/entertainment/2025/06/30/state-department-revokes-visas-of-bob-vylan-band-after-death-to-idf-chant/",
    "timestamp": "2025-06-30T16:26:38Z"
  },
  {
    "title": "Trump administration eyes Fed vacancy in early 2026 to appoint Powell successor, Bessent says",
    "description": "Governor Adriana Kugler's term on the board expires on January 31, 2026, providing an option for President Donald Trump to name a governor for a full 14-year...",
    "link": "https://finance.yahoo.com/news/trump-administration-eyes-fed-vacancy-162614569.html",
    "timestamp": "2025-06-30T16:26:14Z"
  },
  {
    "title": "BRICS nations’ interest in national currency trade is not de-dollarisation: MEA official",
    "description": "BRICS nations explore trade in national currencies to reduce geopolitical risks, with India chairing the upcoming summit in Brazil.",
    "link": "https://www.thehindubusinessline.com/economy/brics-nations-interest-in-national-currency-trade-is-not-de-dollarisation-mea-official/article69756651.ece",
    "timestamp": "2025-06-30T16:26:08Z"
  },
  {
    "title": "CNN Threatened With Lawsuit by President Trump Over Iranian Strikes Reporting",
    "description": "The New York Times also received a similar letter threatening a lawsuit.",
    "link": "https://www.adweek.com/tvnewser/cnn-threatened-with-lawsuit-by-president-trump-over-iranian-strikes-reporting/",
    "timestamp": "2025-06-30T16:24:25Z"
  },
  {
    "title": "Who's calling? A reporter, and it's often President Donald Trump answering",
    "description": "For reporters, it's hardly unusual to call sources on the phone to learn details or get quotes that will enliven their stories. Sometimes people will talk, sometimes they won't. But the president of the United States? In an almost unfathomable level of access…",
    "link": "https://freerepublic.com/focus/f-news/4326104/posts",
    "timestamp": "2025-06-30T16:24:17Z"
  },
  {
    "title": "LOFTUS: Democrats Created A Monster That’s Rapidly Destroying Their Party",
    "description": "Zohran Mamdani might have been born in Uganda to Indian parents. He might be a Muslim. But he is, ultimately, the peak of white liberalism.",
    "link": "https://dailycaller.com/2025/06/30/zohran-mamdani-upper-middle-class-college-kids-new-york-city-socialism/",
    "timestamp": "2025-06-30T16:23:41Z"
  },
  {
    "title": "Trump to visit new Florida immigration detention facility",
    "description": "President Donald Trump is planning to visit a new immigration detention facility in the Florida Everglades, according to Gov. Ron DeSantis",
    "link": "https://abcnews.go.com/US/wireStory/trump-visit-new-florida-immigration-detention-facility-123343064",
    "timestamp": "2025-06-30T16:23:09Z"
  },
  {
    "title": "VIDEO: Canadians Watch \"Elbows Up\" Leader Bow to Big Daddy Trump",
    "description": "VIDEOELBOWS UP!!! Yeah, that was Mark Carney's campaign rallying cry during his campaign for Prime Minister of Canada in reaction to Donald Trump. However, the brutal reality is that Carney embarrassed Canada by going \"ELBOWS DOWN\" when he backed off from a d…",
    "link": "https://freerepublic.com/focus/f-bloggers/4326102/posts",
    "timestamp": "2025-06-30T16:21:09Z"
  },
  {
    "title": "Georgia town that solidly backed Trump could fall victim to bill's green energy cuts",
    "description": "No state may have more to lose than Georgia as Republicans in Congress look to gut federal subsidies that aid both the solar and electric vehicle industries",
    "link": "https://abcnews.go.com/US/wireStory/georgia-town-solidly-backed-trump-fall-victim-tax-123343576",
    "timestamp": "2025-06-30T16:20:22Z"
  },
  {
    "title": "President Trump’s New Official Portrait and His Inaugural Portrait: Authentic Masterpieces – Art Analysis",
    "description": "In June, 2025, The White House unveiled President Trump’s Official Portrait for his second term as president.\nThe post President Trump’s New Official Portrait and His Inaugural Portrait: Authentic Masterpieces – Art Analysis appeared first on The Gateway Pund…",
    "link": "https://www.thegatewaypundit.com/2025/06/president-trumps-new-official-portrait-his-inaugural-portrait/",
    "timestamp": "2025-06-30T16:20:21Z"
  },
  {
    "title": "A Georgia town that solidly backed Trump could fall victim to his tax bill's green energy cuts",
    "description": "No state may have more to lose than Georgia as Republicans in Congress look to gut federal subsidies that aid both the solar and electric vehicle industries. And few towns have more to lose than Cartersville, where a $5 billion electric battery plant is under…",
    "link": "https://www.seattlepi.com/news/politics/article/a-georgia-town-that-solidly-backed-trump-could-20400809.php",
    "timestamp": "2025-06-30T16:20:15Z"
  },
  {
    "title": "Whistleblower: DOJ Lawyers Told To Say ‘Fuck You’ To Courts, Ignore Immigration Court Orders",
    "description": "Quite obviously, the Trump Administration was never going to respect the law when it came to its mass deportation plans. That much became immediately clear as ICE engaged in raid after raid of neighborhoods and businesses, searching for literally any migrant,…",
    "link": "https://www.techdirt.com/2025/06/30/whistleblower-doj-lawyers-told-to-say-fuck-you-to-courts-ignore-immigration-court-orders/",
    "timestamp": "2025-06-30T16:20:04Z"
  },
  {
    "title": "Trump Fires Back at Dem Senator: 'I Am Not Offering Iran Anything, Unlike Obama'",
    "description": "President Donald Trump on Monday denied giving Iran any concessions or engaging in talks with the Islamic Republic's leaders, slamming Sen. Chris Coons (D., Del.) for suggesting that the Trump administration is offering Iran a deal with billions in incentives…",
    "link": "https://freebeacon.com/latest-news/trump-fires-back-at-dem-senator-i-am-not-offering-iran-anything-unlike-obama/",
    "timestamp": "2025-06-30T16:20:03Z"
  },
  {
    "title": "Senate pits AI regulation against state funding",
    "description": "A now-revised proposal in Trump's bill would ban states from regulating AI for 5 years. Here's what it means.",
    "link": "https://www.zdnet.com/article/senate-pits-ai-regulation-against-state-funding/",
    "timestamp": "2025-06-30T16:19:00Z"
  },
  {
    "title": "Judge dismisses lawsuit claiming Meta used Trump’s ‘Art of the Deal’ to train Llama AI",
    "description": "The lawsuit claims the tech giant behind Facebook and Instagram used more than 190,000 copyrighted books without authorization or compensation.",
    "link": "https://nypost.com/2025/06/30/business/lawsuit-accusing-meta-of-stealing-from-trumps-art-of-the-deal-dismissed/",
    "timestamp": "2025-06-30T16:18:01Z"
  },
  {
    "title": "President Donald Trump Says a TikTok Deal Is Imminent. Here's Who Could Buy the App",
    "description": "Trump appears to have found his preferred TikTok buyer (or buyers) and says he'll reveal who the \"wealthy people\" are in a couple of weeks.",
    "link": "https://biztoc.com/x/fe3e0756196b37f0",
    "timestamp": "2025-06-30T16:17:55Z"
  },
  {
    "title": "IAEA: Iran could enrich uranium 'within months'",
    "description": "The chief United Nations nuclear inspector, Rafael Grossi, says Iran could be enriching uranium again soon",
    "link": "https://theweek.com/world-news/trump-iran-nuclear-damage-un-grossi",
    "timestamp": "2025-06-30T16:17:15Z"
  },
  {
    "title": "After decades in the US, Iranians arrested in Trump’s deportation drive",
    "description": "U.S. military strikes on Iran have fueled fears that there is more to come.",
    "link": "https://www.bostonherald.com/2025/06/30/immigration-arrests-iranians/",
    "timestamp": "2025-06-30T16:14:52Z"
  },
  {
    "title": "'Kash Patel played you': Joe Rogan told he got used in recent interview",
    "description": "FBI Director and conspiracy theorist Kash Patel recently had a rapt audience in podcaster Joe Rogan when he reiterated claims that the \"Trump-Russia affair\" was all a made-up ploy by the Democrats to keep Donald Trump out of the White House. But David Corn wi…",
    "link": "https://www.rawstory.com/joe-rogan-2672501465/",
    "timestamp": "2025-06-30T16:14:17Z"
  },
  {
    "title": "Israel kills 85 Palestinians, bombing across Gaza amid new ceasefire push",
    "description": "Homes, schools, hospitals and hungry aid seekers targeted by Israel as it forces thousands out of the enclave's north.",
    "link": "https://www.aljazeera.com/news/2025/6/30/israel-kills-85-palestinians-bombing-across-gaza-amid-new-ceasefire-push",
    "timestamp": "2025-06-30T16:12:59Z"
  },
  {
    "title": "Trump to visit 'Alligator Alcatraz' for grand opening of swampy Everglades detention center for illegal aliens",
    "description": "President Trump to head to Florida for opening of 'Alligator Alcatraz' detention facility in the Everglades, supported by DeSantis but opposed by environmentalists and critics.",
    "link": "https://www.foxnews.com/politics/trump-visit-alligator-alcatraz-grand-opening-swampy-everglades-detention-center-illegal-aliens",
    "timestamp": "2025-06-30T16:12:43Z"
  },
  {
    "title": "Canadians upset Carney caved to Trump over digital services tax",
    "description": "Less than 48 hours before the country was set to come together and celebrate its sovereignty in the face of ongoing annexation threats from the White House, the federal government dropped a bombshell. Ottawa announced on Sunday evening it was rescinding the d…",
    "link": "https://freerepublic.com/focus/f-news/4326101/posts",
    "timestamp": "2025-06-30T16:11:19Z"
  },
  {
    "title": "Rosie O’Donnell Says Trump Made Her a Fat Drunk",
    "description": "To quote Dean Vernon Wormer, “Fat, drunk, and stupid is no way to go through life.” But don’t blame Rosie O’Donnell; the first two are Trump’s fault: O’Donnell said President Donald Trump’s first term took a severe toll on her mental and physical health, lead…",
    "link": "https://moonbattery.com/rosie-odonnell-says-trump-made-her-a-fat-drunk/",
    "timestamp": "2025-06-30T16:10:06Z"
  },
  {
    "title": "Julie Chrisley Says Her Health Was 'Deteriorating' in Prison",
    "description": "Julie Chrisley is speaking out about the allegedly poor conditions she faced in prison, claiming they took a physical toll on her body. “I could see my health deteriorating,” Julie, 52, said in an ABC News special that aired via Hulu on Sunday, June 29. The f…",
    "link": "https://www.usmagazine.com/celebrity-news/news/julie-chrisley-says-her-health-declined-in-prison/#article",
    "timestamp": "2025-06-30T16:09:42Z"
  },
  {
    "title": "California Governor Gavin Newsom Sues Fox News, Responds to Statement",
    "description": "Gavin Newsom is seeking $787 million from Fox News.",
    "link": "https://www.adweek.com/tvnewser/california-governor-gavin-newsom-sues-fox-news-responds-to-statement/",
    "timestamp": "2025-06-30T16:09:15Z"
  },
  {
    "title": "Democratic Senator Berates 'Selfish' Congress in Somber Video Against Trump's 'Big Beautiful Bill': 'I Want Nothing to Do With That'",
    "description": "Sen. Adam Schiff called his colleagues \"selfish\" in a somber warning against Donald Trump's sweeping legislative \"Big Beautiful Bill\" late Sunday night.",
    "link": "https://www.ibtimes.com/democratic-senator-berates-selfish-congress-somber-video-against-trumps-big-beautiful-bill-3777258",
    "timestamp": "2025-06-30T16:08:16Z"
  },
  {
    "title": "US dollar heads for worst first half in more than 50 years amid Trump tariffs",
    "description": "Currency sold off due to concerns economic policies threaten safe-haven role of US dollar-denominated assets\nThe US dollar is on track for its worst first half-year in more than 50 years, after six months in which financial markets were dominated by geopoliti…",
    "link": "https://biztoc.com/x/9a86b6b769ebabf8",
    "timestamp": "2025-06-30T16:07:24Z"
  },
  {
    "title": "Trump: Forbes Like A 'Bad Disease'",
    "description": "President Donald Trump launched a scathing attack on Forbes magazine and journalist Dan Alexander in a Truth Social post on Monday, accusing the publication of spreading falsehoods and calling it “a bad disease.” \nTrump dismissed Alexander as a “terribly unta…",
    "link": "https://biztoc.com/x/722baed36f7038cc",
    "timestamp": "2025-06-30T16:06:59Z"
  },
  {
    "title": "The Iran-Israel War Is Over. But the Arab World Is Grappling With Its Consequences",
    "description": "The region is relieved about de-escalation. But it is also alarmed about an unrestrained Israel, writes H.A. Hellyer.",
    "link": "https://time.com/7298676/iran-israel-conflict-arab-reaction/",
    "timestamp": "2025-06-30T16:03:20Z"
  },
  {
    "title": "UVA President James Ryan Resigns Amid Pressure From DOJ",
    "description": "“While there are very important principles at play here, I would at a very practical level be fighting to keep my job for one more year while knowingly and willingly sacrificing others in this community”\nThe post UVA President James Ryan Resigns Amid Pressure…",
    "link": "https://legalinsurrection.com/2025/06/uva-president-james-ryan-resigns-amid-pressure-from-doj/",
    "timestamp": "2025-06-30T16:00:22Z"
  },
  {
    "title": "Finding The Right Leader For Your Company’s AI Strategy",
    "description": "Also in the Forbes CEO newsletter: Businesses are optimistic about themselves, markets recover from tariff announcements, consumers ready to pay more for school shopping.",
    "link": "https://www.forbes.com/sites/meganpoinski/2025/06/30/finding-the-right-leader-for-your-companys-ai-strategy/",
    "timestamp": "2025-06-30T16:00:11Z"
  },
  {
    "title": "Health care, food cuts won’t only hurt Ohio’s poor, but the entire economy, study says - NewsBreak",
    "description": "President Donald Trump’s One Big Beautiful Bill Act is being sold on promises that it will save Ohioans money. But its safety-net cuts will cost Ohio and o",
    "link": "https://www.newsbreak.com/share/4081874358486-health-care-food-cuts-won-t-only-hurt-ohio-s-poor-but-the-entire-economy-study-says?s=a2&amp;share_destination_id=MjMyNTA2Njc2LTE3NTEyOTkxNDMzMzc%3D&amp;pd=0FjZbg5T&amp;hl=en_US&amp;send_time=1751299143&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v6%2Cns_foryou_recall_exp_25q3-v4%2Cns_foryou_model_exp_25q2_v2-control",
    "timestamp": "2025-06-30T15:59:33Z"
  },
  {
    "title": "Canada Day: Symbols take centre stage in debates about Canadian nationalism",
    "description": "Arguments over Canada’s national symbols, from a new flag in the 1960s to new passports two years ago, reveal how deeply some Canadians are attached to them and how they can shape nationalism.",
    "link": "https://theconversation.com/canada-day-symbols-take-centre-stage-in-debates-about-canadian-nationalism-259847",
    "timestamp": "2025-06-30T15:59:32Z"
  },
  {
    "title": "GOP Senator Declares His Own Party is 'Betraying' Americans If They Vote for Trump's 'Big, Beautiful Bill'",
    "description": "A Republican senator stated that members of his party would be \"betraying\" their constituents if they chose to vote for the \"one big, beautiful bill.\"",
    "link": "https://www.ibtimes.com/gop-senator-declares-his-own-party-betraying-americans-if-they-vote-trumps-big-beautiful-3777256",
    "timestamp": "2025-06-30T15:59:17Z"
  },
  {
    "title": "Nuclear Proliferation Cannot Be Bombed Away",
    "description": "The root cause of nuclear proliferation is a state’s sense of insecurity or aspiration to increase its power and influence. Given these strategic motives and the lessons of recent history, it is fanciful to think that the use of force and humiliation will dis…",
    "link": "https://www.project-syndicate.org/commentary/iran-nuclear-program-israel-us-ignore-lessons-of-nonproliferation-by-mohamed-elbaradei-2025-06",
    "timestamp": "2025-06-30T15:58:21Z"
  },
  {
    "title": "UK Stands by Digital Tax After Canada Bows to Trump Pressure",
    "description": "The UK is currently planning to keep its digital services tax, a person familiar with the matter said, after Canadian Prime Minister Mark Carney scrapped their own levy to restart trade talks with President Donald Trump’s administration.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-stands-by-digital-tax-after-canada-bows-to-trump-pressure",
    "timestamp": "2025-06-30T15:56:22Z"
  },
  {
    "title": "Trump pressures Israel to end Gaza conflict as he eyes Abraham Accords expansion",
    "description": "Trump urges Israel to \"make the deal in Gaza\" as envoy Ron Dermer heads to White House meetings, while Israel claims Hamas blocks return of 50 hostages held since Oct. 7.",
    "link": "https://www.foxnews.com/world/trump-pressures-israel-end-gaza-conflict-he-eyes-abraham-accords-expansion",
    "timestamp": "2025-06-30T15:55:58Z"
  },
  {
    "title": "Savannah Chrisley Makes Blunt Confession About Donald Trump Pardoning Her Parents - TV Insider",
    "description": "Savannah Chrisley Makes Blunt Confession About Donald Trump Pardoning Her ParentsTV Insider Reality TV stars Todd and Julie Chrisley discuss freedom after Trump pardonABC News - Breaking News, Latest News and Videos 'God touched President Trump's heart': Todd…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178235548",
    "timestamp": "2025-06-30T15:54:27Z"
  },
  {
    "title": "White House expects more countries will drop digital services taxes after Canada backs down",
    "description": "Kevin Hassett's comments came just over a week before the Trump administration's self-imposed deadlines when steep U.S. tariffs are set to restart.",
    "link": "https://www.cnbc.com/2025/06/30/trump-hassett-trade-digital-services-tax-canada.html",
    "timestamp": "2025-06-30T15:54:11Z"
  },
  {
    "title": "My Secret Tesla Master Plan (Part 4)",
    "description": "Tesla CEO Elon Musk has been talking about releasing his ‘Tesla Master Plan Part 4’ for over a year now. It has yet to come, and Tesla has yet to complete the goals in Parts 2 and 3. So I decided to come up with my own Tesla Master Plan. \n\n\n\n more…",
    "link": "http://electrek.co/2025/06/30/my-secret-tesla-master-plan-part-4/",
    "timestamp": "2025-06-30T15:53:35Z"
  },
  {
    "title": "New special tribunal for Ukraine will pave the way for holding Russian leaders to account for the invasion",
    "description": "But don’t expect to see Vladimir Putin facing a court any time soon.",
    "link": "https://theconversation.com/new-special-tribunal-for-ukraine-will-pave-the-way-for-holding-russian-leaders-to-account-for-the-invasion-260022",
    "timestamp": "2025-06-30T15:50:31Z"
  },
  {
    "title": "Trump’s son hints at White House run",
    "description": "One of the US president’s sons has said his family “had not profited from politics” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620802-trump-son-white-house-run/",
    "timestamp": "2025-06-30T15:49:43Z"
  },
  {
    "title": "Elon Musk Is Back at Tesla, but the Magic Might Be Gone",
    "description": "After a political detour that angered customers and tanked profits, the billionaire CEO returns to a Tesla in crisis.",
    "link": "https://gizmodo.com/elon-musk-is-back-at-tesla-but-the-magic-might-be-gone-2000622074",
    "timestamp": "2025-06-30T15:49:29Z"
  },
  {
    "title": "Report: Young Democrats Believe Activist David Hogg Is Gaining Power Outside DNC",
    "description": "Many younger Democrats reportedly believe gun control activist David Hogg's ouster from his role with the Democrat National Convention (DNC) is a positive thing for the future of a party that lacks clear leadership.\nThe post Report: Young Democrats Believe Ac…",
    "link": "https://www.breitbart.com/politics/2025/06/30/report-young-democrats-believe-activist-david-hogg-is-gaining-power-outside-dnc/",
    "timestamp": "2025-06-30T15:49:14Z"
  },
  {
    "title": "Americans weigh in on Trump's 'big, beautiful bill': polls",
    "description": "The \"big, beautiful bill\" is viewed unfavorably by most Americans, who say it is likely to hurt their families, according to the latest Fox News Poll.",
    "link": "https://www.foxnews.com/politics/americans-weigh-big-beautiful-bill-polls",
    "timestamp": "2025-06-30T15:48:36Z"
  },
  {
    "title": "‘Evil intentions’: Trump torches one ‘terribly untalented’ name in national news media",
    "description": "'Probably can't get a meaningful job in the business, has written so inaccurately about me that it is ridiculous ... continues to hang around like a bad disease'",
    "link": "https://www.wnd.com/2025/06/evil-intentions-trump-torches-one-terribly-untalented-name/",
    "timestamp": "2025-06-30T15:48:12Z"
  },
  {
    "title": "Elon Musk Reignites Budget Beef With Trump in Frantic Posting Spree",
    "description": "Elon Musk threw himself back into the federal fray over the weekend, drawing more attention to the conservative opposition to the president’s tax extension bill.\r\nDonald Trump’s “big, beautiful bill” would extend his 2017 tax cuts for millionaires and corpora…",
    "link": "https://newrepublic.com/post/197421/elon-musk-donald-trump-budget-fight",
    "timestamp": "2025-06-30T15:46:22Z"
  },
  {
    "title": "All TVA nuclear reactors at full power for first time in nearly a year | Chattanooga Times Free Press",
    "description": "All seven nuclear reactors owned and operated by the Tennessee Valley Authority, the nation's largest public power provider, were at full power Monday for the first time in nearly a year.",
    "link": "https://www.timesfreepress.com/news/2025/jun/30/all-tva-nuclear-reactors-at-full-power-for-first/",
    "timestamp": "2025-06-30T15:45:23Z"
  },
  {
    "title": "Government's new travel warning urges Americans to 'depart now'",
    "description": "A day after President Donald Trump gave the order for a series of strikes on Iranian nuclear facilities on June 22, the U.S. State Department put out a travel advisory urging \"U.S. citizens worldwide to exercise increased caution.\"\nThe war between Israel and …",
    "link": "https://biztoc.com/x/18efa627e5b52a2e",
    "timestamp": "2025-06-30T15:44:47Z"
  },
  {
    "title": "JP Morgan Rates Circle ‘Underweight,’ Sets $80 Price Target",
    "description": "The company faces headwinds ranging from lower interest rates to the adoption of a CBDC in the EU, JP Morgan analysts wrote.",
    "link": "https://decrypt.co/327799/jp-morgan-rates-circle-underweight-sets-80-target",
    "timestamp": "2025-06-30T15:44:26Z"
  },
  {
    "title": "How DOGE could amplify America's gun violence problem",
    "description": "Trump's DOGE is looking to change 47 gun regulations at the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) — it could make gun violence worse.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/doge-trump-atf-gun-control-47-rules-rcna215614",
    "timestamp": "2025-06-30T15:43:02Z"
  },
  {
    "title": "ICE Agents Arrest Mother of Two at Assisted Living Facility",
    "description": "Rosalina Luna Vargas was detained by ICE agents on Saturday morning on the morning of June 28, 2025, at around 8 AM in Pasadena.",
    "link": "https://www.newsweek.com/ice-raid-assisted-living-facility-2092620",
    "timestamp": "2025-06-30T15:42:52Z"
  },
  {
    "title": "Melania Trump's visa controversy re-surfaces in shocking twist: Why is the ‘math ain’t mathing’ in her case?",
    "description": "Congresswoman Jasmine Crockett turned her sights on US First Lady Melania Trump and her visa controversy re-surfaced again. Melania Trump gaining her US citizenship on the back of the EB-1 visa, i.e. the 'Einstein Visa' gained contentious traction during this…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-melania-trumps-visa-controversy-re-surfaces-in-shocking-twist-why-is-the-math-aint-mathing-in-her-case-einstein-visa/articleshow/122164182.cms",
    "timestamp": "2025-06-30T15:40:14Z"
  },
  {
    "title": "Gavin Newsom leads new Democratic strategy to cast doubt on Trump’s mental fitness: 'He's not all there'",
    "description": "Gavin Newsom recently appeared to launch an effort to flip the narrative Republicans had used against Joe Biden, now directing it at Donald Trump",
    "link": "https://news.meaww.com/gavin-newsom-leads-new-democratic-strategy-to-cast-doubt-on-trumps-mental-fitness-hes-not-all-there",
    "timestamp": "2025-06-30T15:40:07Z"
  },
  {
    "title": "New Orleans jail escapee who begged Trump for help captured as manhunt targets last fugitive",
    "description": "Louisiana authorities arrest Antoine Massey, the ninth fugitive from Orleans Justice Center escape where inmates removed a toilet, while killer Derrick Groves remains at large.",
    "link": "https://www.foxnews.com/us/new-orleans-jail-escapee-who-begged-trump-help-captured-manhunt-targets-last-fugitive",
    "timestamp": "2025-06-30T15:39:31Z"
  },
  {
    "title": "US and Iran step back from nuclear talks",
    "description": "Prospects for negotiations between the United States and Iran on nuclear proliferation have dimmed significantly.\n\nJust a few days ago, it seemed the two sides were ready to return to negotiations. But US President Donald Trump then said he was not speaking t…",
    "link": "https://www.bbc.co.uk/programmes/w172zss4jxjjtx9",
    "timestamp": "2025-06-30T15:39:00Z"
  },
  {
    "title": "DOE Invites Experiments for MARVEL Microreactor",
    "description": "The U.S. Department of Energy (DOE) is inviting companies to propose experiments using its Microreactor Application Research Validation and Evaluation (MARVEL) reactor, a testbed scheduled to begin operations in 2028 at Idaho National Laboratory’s TREAT facil…",
    "link": "https://spectrum.ieee.org/marvel-microreactor-department-of-energy",
    "timestamp": "2025-06-30T15:38:28Z"
  },
  {
    "title": "Jake Sherman Predicts Trump-Backed Big Beautiful Bill ‘Is Going to Pass the Senate’",
    "description": "Punchbowl News Founder Jake Sherman predicted that the GOP's \"Big Beautiful Bill\" will pass in the Senate Monday night.\nThe post Jake Sherman Predicts Trump-Backed Big Beautiful Bill ‘Is Going to Pass the Senate’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/jake-sherman-predicts-trump-backed-big-beautiful-bill-is-going-to-pass-the-senate/",
    "timestamp": "2025-06-30T15:38:00Z"
  },
  {
    "title": "Senate advances GOP bill that costs more, cuts more",
    "description": "The bill would make giant cuts to Medicaid and food stamps, leaving 11.8 million fewer people with health coverage",
    "link": "https://theweek.com/politics/senate-advances-gop-bill-medicaid-cuts",
    "timestamp": "2025-06-30T15:37:47Z"
  },
  {
    "title": "Shock rift in MAGA? Tucker Carlson and Marjorie Taylor Greene praise Zohran Mamdani as Trump fumes",
    "description": "MAGA figures Tucker Carlson and Marjorie Taylor Greene have praised Democratic socialist Zohran Mamdani for his focus on New York City's issues during the mayoral debate. They specifically praised his commitment to addressing local concerns and prioritizing t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/shock-rift-in-maga-tucker-carlson-and-marjorie-taylor-greene-praise-zohran-mamdani-as-trump-fumes-zohran-mamdani-latest-news-maga-latest-news/articleshow/122163748.cms",
    "timestamp": "2025-06-30T15:37:06Z"
  },
  {
    "title": "Todd Chrisley Compares Showering After Prison to '1st Sexual Encounter'",
    "description": "Todd Chrisley is taking pleasure in the little things after his release from prison. When recalling his first shower at his home, Chrisley, 56, quipped in the Sunday, June 29, ABC News special, “It was almost like your first sexual encounter.” Todd noted that…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-chrisley-reacts-to-first-shower-after-prison-release/#article",
    "timestamp": "2025-06-30T15:36:48Z"
  },
  {
    "title": "Home Depot Responds to Nationwide Boycott",
    "description": "The People's Union USA is organizing a monthlong boycott of the home improvement retailer.",
    "link": "https://www.newsweek.com/home-depot-boycott-response-dei-2092565",
    "timestamp": "2025-06-30T15:35:51Z"
  },
  {
    "title": "Republicans Suddenly Want to Weaken Filibuster—to Help Trump",
    "description": "Senate Republicans are dropping to new lows to sidestep the filibuster and pass Donald Trump’s behemoth budget bill. \r\nIn an effort to more painlessly pass Trump’s wildly unpopular tax and spending bill, Republicans are pushing for a creative accounting metho…",
    "link": "https://newrepublic.com/post/197419/donald-trump-budget-tax-cuts-republicans-weaken-filibuster",
    "timestamp": "2025-06-30T15:35:31Z"
  },
  {
    "title": "'Sleazebags': The Whiny Titty Baby's Diaper Is On Overload",
    "description": "One of Dan Alexander's articles on Trump for Forbes has really gotten under Donald's skin, so much that he posted a hateful rant on Truth Social, calling the journalist \"untalented\" with \"evil intentions.\"\nAlexander calculated that Trump's various crypto vent…",
    "link": "https://crooksandliars.com/2025/06/sleazebags-whiny-titty-babys-diaper",
    "timestamp": "2025-06-30T15:35:11Z"
  },
  {
    "title": "President Tariff to issue series of grammatical error-filled proclamations, beginning with \"Dear Mr. Japan\" letter [Murica]",
    "description": "President Tariff to issue series of grammatical error-filled proclamations, beginning with \"Dear Mr. Japan\" letter",
    "link": "https://www.fark.com/comments/13724322/President-Tariff-to-issue-series-of-grammatical-error-filled-proclamations-beginning-with-Dear-Mr-Japan-letter",
    "timestamp": "2025-06-30T15:35:04Z"
  },
  {
    "title": "Senate Fiscal Hawks Seek Partial Obamacare Repeal in One Big Beautiful Bill Act",
    "description": "Senate fiscal hawks are seeking a major concession in the One Big Beautiful Bill Act—a partial repeal of President Barack Obama’s Affordable Care Act. The... Read More\nThe post Senate Fiscal Hawks Seek Partial Obamacare Repeal in One Big Beautiful Bill Act ap…",
    "link": "https://www.dailysignal.com/2025/06/30/senate-fiscal-hawks-seek-partial-obamacare-repeal-in-one-big-beautiful-bill-act/",
    "timestamp": "2025-06-30T15:35:00Z"
  }
]