[
  {
    "title": "Trump warns Apple: Don’t make iPhones in India or pay 25% tariff",
    "description": "U.S. President Donald Trump has warned Apple CEO Tim Cook that iPhones sold in the U.S. must be manufactured domestically or face a tariff of at least 25%. In a post on Truth Social, Trump said he had previously informed Cook of this expectation, criticizing …",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/trump-warns-apple-dont-make-iphones-in-india-or-pay-25-tariff/articleshow/121362741.cms",
    "timestamp": "2025-05-23T11:28:49Z"
  },
  {
    "title": "Trump levels early-morning threat against Apple over iPhone production",
    "description": "Donald Trump on Friday morning leveled a threat against Apple over the production of the massive company's iPhones.Taking to his own social media site, Truth Social, Trump abruptly brought up the topic.\"I have long ago informed Tim Cook of Apple that I expect…",
    "link": "https://www.rawstory.com/trump-threat-apple-iphone-production/",
    "timestamp": "2025-05-23T11:27:21Z"
  },
  {
    "title": "Ukrainian official says major prisoner swap with Russia is underway",
    "description": "Ukraine and Russia agreed to the exchange of 1,000 prisoners from each side a week ago.",
    "link": "https://www.bostonherald.com/2025/05/23/ukraine-russia-prisoner-exchange/",
    "timestamp": "2025-05-23T11:27:14Z"
  },
  {
    "title": "The Conquest of Gaza and the Dissolving of Humanity",
    "description": "Leon Golub once related a story to a mutual friend. A Chicago artist famous for large canvases depicting crimson torture rooms in Central America, Golub had been asked what it meant to him to be a “Jewish political artist.” The painter’s quick reply was that …",
    "link": "https://tomdispatch.com/the-horrors-inflicted-for-500-years/",
    "timestamp": "2025-05-23T11:27:03Z"
  },
  {
    "title": "Dad of DC shooting suspect attended Trump’s address to Congress in March as guest of a Democratic congressman",
    "description": "Eric Rodriguez, father of double murder suspect Elias Rodriguez, attended Donald Trump’s Joint Speech to Congress at invitation of Illinois representative",
    "link": "https://www.the-independent.com/news/world/americas/crime/elias-rodriguez-dad-jesus-chuy-garcia-b2756638.html",
    "timestamp": "2025-05-23T11:26:02Z"
  },
  {
    "title": "Japanese gas tanker giant sees difficulty buying Chinese vessels",
    "description": "Washington has issued a flurry of measures since President Donald Trump took office aimed at curbing China’s maritime dominance and reviving its own flagging shipbuilding industry.",
    "link": "https://www.japantimes.co.jp/business/2025/05/23/mitsui-chinese-vessels-difficulty/",
    "timestamp": "2025-05-23T11:26:00Z"
  },
  {
    "title": "Here’s What Trump Told House Republicans Behind Closed Doors",
    "description": "By George Caldwell, The Daily Signal | May 20, 2025\nPresident Donald Trump met with the entire House Republican Conference on Tuesday and delivered a strong message—namely, that the time for negotiations on the budget reconciliation bill is over.\nA number of …",
    "link": "https://biztoc.com/x/5562305793cd71e9",
    "timestamp": "2025-05-23T11:25:43Z"
  },
  {
    "title": "Trump targets illegal migration with remittance tax plan",
    "description": "Mexico's President Claudia Sheinbaum chose a symbolic stage for shooting back at US President Donald Trump's proposal for taxing remittances, called \"remesas\" in Spanish-speaking Latin America.\nDuring the construction ceremony for the Los Cabos Regional Gener…",
    "link": "https://biztoc.com/x/ce8ec887c04a2d2f",
    "timestamp": "2025-05-23T11:25:18Z"
  },
  {
    "title": "U.S. Universities Have Blood On Their Hands In Latest Violence Against Jews",
    "description": "The training grounds of hatred and radicalism are U.S. college campuses, as we have seen time and time again in recent years.",
    "link": "https://thefederalist.com/2025/05/23/u-s-universities-have-blood-on-their-hands-in-latest-violence-against-jews/",
    "timestamp": "2025-05-23T11:24:51Z"
  },
  {
    "title": "South Korea's defence ministry says no talks held with US on troop withdrawal",
    "description": "SEOUL: South Korea's defence ministry said on Friday (May 23) that Seoul and Washington had not had discussions about the withdrawal of some US troops stationed in the country. The ministry made the comment in response to a report by the Wall Street Journal t…",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-defence-ministry-no-talks-held-us-troop-withdrawal-5149456",
    "timestamp": "2025-05-23T11:22:04Z"
  },
  {
    "title": "Banished colonel who condemned Biden’s Afghanistan withdrawal is now investigating it",
    "description": "Lt Col Stu Scheller was thrown in the brig and then drummed out of the US Marine Corps for publicly condemning the chaotic military withdrawal from Afghanistan. Almost four years later, he is part of the team investigating the Biden administration’s handling …",
    "link": "https://freerepublic.com/focus/f-news/4318654/posts",
    "timestamp": "2025-05-23T11:19:48Z"
  },
  {
    "title": "Conservative buries GOP lawmakers acting like 'a drunken sailor who just won the lottery'",
    "description": "Longtime conservative columnist Matt Lewis took a dim view of the budget deal that passed this week with a one-vote margin, lamenting it will explode the national debt to historic levels.Appearing on MSNBC's \"Morning Joe,\" the columnist and MSNBC contributor …",
    "link": "https://www.rawstory.com/gop-drunken-sailors-matt-lewis/",
    "timestamp": "2025-05-23T11:16:21Z"
  },
  {
    "title": "From Blackouts to Breakouts: Trump’s Energy Revolution",
    "description": "After four years of energy chaos, President Trump is rebuilding America’s strength by unleashing domestic production and reversing Biden’s global strategic blunders. When Donald J. Trump returned to the White House on January 20, 2025, he inherited a shattere…",
    "link": "https://freerepublic.com/focus/f-chat/4318653/posts",
    "timestamp": "2025-05-23T11:15:55Z"
  },
  {
    "title": "Aaron Taylor-Johnson signs deal with iconic James Bond watchmakers amid 007 rumours",
    "description": "Could this deal with the iconic Bond watchmaker give him the licence to kill?",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/aaron-taylor-johnson-james-bond-omega-watches-b2756587.html",
    "timestamp": "2025-05-23T11:15:07Z"
  },
  {
    "title": "As Tesla sales plummet, company begins accepting Cybertruck trade-ins – with extreme depreciation",
    "description": "Multiple signs from the last two quarters indicate that sales of Tesla vehicles are declining more sharply than ever. The company is struggling to sell the Cybertruck in particular, as its perceived value has started to plunge.Read Entire Article",
    "link": "https://www.techspot.com/news/108032-tesla-sales-plummet-company-begins-accepting-cybertruck-trade.html",
    "timestamp": "2025-05-23T11:15:00Z"
  },
  {
    "title": "SCOTUS signals Fed chair may be safe from firings",
    "description": "The News\nThe US Supreme Court signaled that President Donald Trump cannot fire Federal Reserve officials, suggesting it differs from other independent agencies.\nIn a ruling on labor board firings, SCOTUS did not block Trump’s decision to remove the officials,…",
    "link": "https://biztoc.com/x/5cbf95f8390cb486",
    "timestamp": "2025-05-23T11:14:22Z"
  },
  {
    "title": "Fact-Checking Justice Sotomayor’s Imaginary Birthright Citizenship Cases",
    "description": "By Amy Swearer via The Daily Signal | May 20, 2025\nLast week, the Supreme Court held oral arguments in Trump v. CASA, Inc., a case that stems from President Donald Trump’s January executive order on birthright citizenship.\nAt this point in the litigation, the…",
    "link": "https://biztoc.com/x/913a5c143ce8d440",
    "timestamp": "2025-05-23T11:14:18Z"
  },
  {
    "title": "Pakistan to offer mining concessions to US firms in tariff negotiations: Minister",
    "description": "Jam Kamal, Pakistan’s Commerce Minister, said the country will grant US firms access to strategic mining opportunities in Balochistan through joint ventures with local partners",
    "link": "https://www.thehindubusinessline.com/news/world/pakistan-to-offer-mining-concessions-to-us-firms-in-tariff-negotiations-minister/article69610216.ece",
    "timestamp": "2025-05-23T11:13:37Z"
  },
  {
    "title": "Trump's Harvard Visa Threat Could Wipe Out School's Sports Teams",
    "description": "The Ivy League school’s rowing, hockey, squash, soccer and golf teams could be devastated by the Trump administration’s decision.",
    "link": "https://www.huffpost.com/entry/donald-trump-harvard-visas-sports_n_683055f3e4b0e1fe96d6b19f",
    "timestamp": "2025-05-23T11:11:40Z"
  },
  {
    "title": "Trump to sign more executive orders as courts continue to halt some of his actions (Washington Post)",
    "description": "Washington Post:\nTrump to sign more executive orders as courts continue to halt some of his actions  —  President Donald Trump is scheduled to sign more executive orders Friday as courts continue to block some of his high-profile actions.  On Thursday, separa…",
    "link": "https://www.memeorandum.com/250523/p3",
    "timestamp": "2025-05-23T11:10:00Z"
  },
  {
    "title": "India to allow US firms to bid for govt contracts worth $50 billion in wider scope for foreign firms: Report",
    "description": "India and UK agreed on a free trade pact that gives British firms access to federal government contracts in select sectors - covering goods, services and construction - on a reciprocal basis.",
    "link": "https://www.livemint.com/industry/manufacturing/india-to-allow-us-firms-to-bid-for-govt-contracts-worth-50-billion-in-wider-scope-for-foreign-firms-report-11747998206591.html",
    "timestamp": "2025-05-23T11:09:05Z"
  },
  {
    "title": "US tariff clock ticking for dozens of countries",
    "description": "Halfway through US President Donald Trump&rsquo;s 90-day freeze on his so-called reciprocal  tariffs , a persistent gripe from businesses, consumers and governments facing them is severe uncertainty. The next 45 days may not provide much relief from the fog.",
    "link": "https://www.bangkokpost.com/business/general/3032897/us-tariff-clock-ticking-for-dozens-of-countries",
    "timestamp": "2025-05-23T11:09:00Z"
  },
  {
    "title": "Major Russia-Ukraine prisoner swap is underway, official says",
    "description": "Russia and Ukraine are carrying out a major prisoner swap on Friday, a senior official said, after both sides reached a deal during talks last week in Turkey.",
    "link": "https://www.foxnews.com/world/major-russia-ukraine-prisoner-swap-underway-official-says",
    "timestamp": "2025-05-23T11:06:52Z"
  },
  {
    "title": "Trump Says Major Prisoners Swap \"Completed\" Between Russia-Ukraine",
    "description": "Russia and Ukraine began a major prisoner swap on Friday that was agreed on at their first direct talks in more than three years, a Ukrainian military source said on Friday.",
    "link": "https://www.ndtv.com/world-news/could-lead-to-something-big-donald-trump-announces-major-russia-ukraine-prisoner-swap-8488522",
    "timestamp": "2025-05-23T11:03:30Z"
  },
  {
    "title": "Trump targets illegal migration with remittance tax plan",
    "description": "Washington plans a 5% tax on remittance transfers that would cover millions of foreigners living in the US. With about $160 billion sent by Latin Americans alone, their home countries would be among the hardest hit. Mexico's President Claudia Sheinbaum chose …",
    "link": "https://www.dw.com/en/trump-targets-illegal-migration-with-remittance-tax-plan/a-72637853",
    "timestamp": "2025-05-23T11:02:00Z"
  },
  {
    "title": "Terror in DC: Where We Go From Here. Plus, Suspected Israeli Embassy Shooter’s Ties to Woke Nonprofits.",
    "description": "Unheeded warnings: The shooting of two Israeli embassy staffers outside the Jewish museum in Washington, D.C., is not an isolated act—it’s the latest incident of left-wing, frequently anti-Israel radicalism that academic administrators and law enforcement off…",
    "link": "https://freebeacon.com/newsletters/terror-in-dc-where-we-go-from-here-plus-suspected-israeli-embassy-shooters-ties-to-woke-nonprofits/",
    "timestamp": "2025-05-23T11:00:51Z"
  },
  {
    "title": "Development as Domination: Settler Tourism in Western Sahara and the Commodification of Occupied Territories in Trumpist International Law",
    "description": "[Andrea Maria Pelliconi is a Lecturer in Human Rights Law & Global Justice at the University of Southampton, where she researches demographic engineering, displacement, and international law. She is currently undertaking a British Academy/Leverhulme-funded pr…",
    "link": "http://opiniojuris.org/2025/05/23/development-as-domination-settler-tourism-in-western-sahara-and-the-commodification-of-occupied-territories-in-trumpist-international-law/",
    "timestamp": "2025-05-23T11:00:36Z"
  },
  {
    "title": "Elizabeth Warren Probes Staffing Shortage And Backlog At Social Security",
    "description": "The Social Security Administration has gotten behind on claims after letting thousands of workers go in a DOGE-driven purge.",
    "link": "https://www.huffpost.com/entry/elizabeth-warren-social-security-frank-bisignano_n_682f7c6ae4b05418243cccee",
    "timestamp": "2025-05-23T11:00:30Z"
  },
  {
    "title": "‘Mind Your Dogs!’ Chris Cuomo Rages at Democrats for Turning Blind Eye to ‘Evil’ Islamists",
    "description": "Cuomo issued a stark warning to Democrats for “choosing to ignore” Islamist extremism within the U.S. while fixating on Trump as “evil.”\nThe post ‘Mind Your Dogs!’ Chris Cuomo Rages at Democrats for Turning Blind Eye to ‘Evil’ Islamists first appeared on Medi…",
    "link": "https://www.mediaite.com/media/tv/mind-your-dogs-chris-cuomo-rages-at-democrats-for-turning-blind-eye-to-evil-islamists/",
    "timestamp": "2025-05-23T11:00:27Z"
  },
  {
    "title": "EXCLUSIVE: George Clooney's Marriage 'Truly Hanging by a Thread' as His Wife Amal Faces Being Slapped With BAN From U.S. by Leftie Actor's Nemesis Donald Trump",
    "description": "George Clooney's marriage is now hangs by a thread as his wife Amal risks a possible U.S. travel ban.",
    "link": "https://radaronline.com/p/george-clooney-marriage-trouble-wife-amal-facing-us-ban/",
    "timestamp": "2025-05-23T11:00:00Z"
  },
  {
    "title": "BMC reportedly set to slash quarter of workforce, as bike brand says Trump tariff uncertainty “influenced decision to restructure”",
    "description": "The Swiss manufacturer says the latest round of job losses, reported to affect 40 employees worldwide, is necessary to “ensure sustainable competitiveness”",
    "link": "https://road.cc/content/news/bmc-set-slash-quarter-workforce-due-tariffs-314117",
    "timestamp": "2025-05-23T10:58:58Z"
  },
  {
    "title": "Trump says 'major' Ukraine-Russia prisoner swap 'just completed'",
    "description": "WASHINGTON: United States President Donald Trump on Friday (May 23) announced a \"major\" prisoner swap between Ukraine and Russia. \"A major prisoners swap was just completed between Russia and Ukraine,\" Trump wrote on his Truth Social platform. \"Congratulation…",
    "link": "https://www.channelnewsasia.com/world/ukraine-russia-prisoner-swap-trump-just-completed-5149376",
    "timestamp": "2025-05-23T10:57:39Z"
  },
  {
    "title": "How to avoid detention and deportation in the US right now",
    "description": "The Trump administration is cracking down on pro-Palestinian protest by detaining – and even deporting – vocal activists. Here’s how you can protect yourself",
    "link": "https://www.dazeddigital.com/life-culture/article/66865/1/how-to-avoid-detention-and-deportation-in-the-us-right-now?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=how-to-avoid-detention-and-deportation-in-the-us-right-now",
    "timestamp": "2025-05-23T10:54:00Z"
  },
  {
    "title": "St. Louis joins a list of places waiting for Donald Trump’s FEMA",
    "description": "Tornadoes in St. Louis and in Arkansas and Mississippi have left officials asking for more help from FEMA as Donald Trump threatens to eliminate the agency.",
    "link": "https://biztoc.com/x/5c1297f5c07d457c",
    "timestamp": "2025-05-23T10:52:14Z"
  },
  {
    "title": "Fact check: Trump's “evidence videos” do not show “genocide”",
    "description": "Fake news in the White House: the footage Trump wants to use to prove the “mass murder of white farmers in South Africa” is outdated. The white crosses on the roadside are from a demonstration in 2020.",
    "link": "https://www.dw.com/en/fact-check-trumps-evidence-videos-do-not-show-genocide/a-72642309",
    "timestamp": "2025-05-23T10:52:00Z"
  },
  {
    "title": "Transcript: Trump’s Vile New Attack on Harvard Is Already Backfiring",
    "description": "The following is a lightly edited transcript of the May 23 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresident …",
    "link": "https://newrepublic.com/article/195666/transcript-trump-vile-new-attack-harvard-already-backfiring",
    "timestamp": "2025-05-23T10:51:59Z"
  },
  {
    "title": "The new math problem Trump's megabill faces in the Senate",
    "description": "President Donald Trump with Senate Majority Leader John Thune, left and House Speaker Mike Johnson, after he spoke to the National Prayer Breakfast, at the Capitol on Feb. 6, 2025. (AP Photo/J. Scott Applewhite, File)",
    "link": "https://biztoc.com/x/72c8d7504c62316a",
    "timestamp": "2025-05-23T10:51:58Z"
  },
  {
    "title": "Golf caddie, who clicked photos with Donald Trump, faces prison term for sending sexually explicit photos to minor girl",
    "description": "Daniel Mulvey, a golf caddie, admitted to sending explicit content to a 14-year-old girl. The incident happened after a music festival in Glasgow. Mulvey contacted the girl via Snapchat. He continued even after learning her age. The family reported the matter…",
    "link": "https://economictimes.indiatimes.com/news/international/us/golf-caddie-who-clicked-photos-with-donald-trump-faces-prison-term-for-sending-sexually-explicit-photos-to-minor-girl/articleshow/121361790.cms",
    "timestamp": "2025-05-23T10:46:48Z"
  },
  {
    "title": "Trump Praises Ukraine-Russia Prisoner Swap as Start of ‘Something Big’",
    "description": "Trump praised a “major prisoner swap” that was about to take place between Russia and Ukraine had been completed, the possibly the beginning of “something big.”\nThe post Trump Praises Ukraine-Russia Prisoner Swap as Start of ‘Something Big’ first appeared on …",
    "link": "https://www.mediaite.com/media/news/trump-praises-ukraine-russia-prisoner-swap-as-start-of-something-big/",
    "timestamp": "2025-05-23T10:43:39Z"
  },
  {
    "title": "Trump supporter Zachary Levi responds to Rachel Zegler hoping MAGA fans ‘never know peace’",
    "description": "‘I am one of those people,’ Levi said",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/rachel-zegler-zachary-levi-donald-trump-shazam-election-b2756603.html",
    "timestamp": "2025-05-23T10:43:38Z"
  },
  {
    "title": "Europeans Plan Fewer Summer Trips to US in Latest Trump Backlash",
    "description": "Europeans are planning 10% fewer trips to the US as the busy summer season approaches, in the latest sign that some international travelers are avoiding America as backlash grows against President Donald Trump’s policies.",
    "link": "https://financialpost.com/pmn/business-pmn/europeans-plan-fewer-summer-trips-to-us-in-latest-trump-backlash",
    "timestamp": "2025-05-23T10:41:39Z"
  },
  {
    "title": "DOD Responds to South Korea Troops Report: 'Not True'",
    "description": "The Pentagon said it remains firmly committed to the U.S. ally.",
    "link": "https://www.newsweek.com/dod-responds-south-korea-troops-report-not-true-2076283",
    "timestamp": "2025-05-23T10:41:36Z"
  },
  {
    "title": "Trump Administration Eyes Deep-Sea Mining Near American Samoa Amid Push For Critical Minerals",
    "description": "The Donald Trump administration is making plans that could set the stage for deep-sea mining off the coast of American Samoa.\nThe move comes after an executive order from President Donald Trump aimed at quickening access to critical seabed resources in the in…",
    "link": "https://biztoc.com/x/480a2fa982af6a54",
    "timestamp": "2025-05-23T10:41:05Z"
  },
  {
    "title": "Donald Trump Attacks UK's 'Unsightly Windmills'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump took aim at the United Kingdom over energy policy, criticizing its \"costly and unsightly windmills\" and urging the country to drill more for oil in the North Sea.\n\"Our negotiated deal wi…",
    "link": "https://biztoc.com/x/9c1b4d285a71abeb",
    "timestamp": "2025-05-23T10:41:01Z"
  },
  {
    "title": "Why rich foreigners may not rush to buy Trump's $5 million 'gold card' visas",
    "description": "President Donald Trump holds his $5 million \"gold card\" visa on an Air Force One flight.\nMandel Ngan/AFP/Getty Images\nPresident Donald Trump's $5 million \"gold card\" visa aimed at the rich could face limited demand.\nOne analyst said even the wealthy may be re…",
    "link": "https://biztoc.com/x/9dd64ef60cc509a4",
    "timestamp": "2025-05-23T10:40:48Z"
  },
  {
    "title": "Why rich foreigners may not rush to buy Trump's $5 million 'gold card' visas",
    "description": "Even the wealthy may not want to pay $5 million rather than  invest that sum, said Dominic Volek of investment migration consultancy Henley & Partners.",
    "link": "https://www.businessinsider.com/trump-gold-card-visa-demand-rich-immigrants-green-card-lutnick-2025-5",
    "timestamp": "2025-05-23T10:36:14Z"
  },
  {
    "title": "House Republican tax bill favors the rich — how much they stand to gain, and why",
    "description": "A tax and spending package passed by House Republicans funnels most of its financial benefits to the rich and leaves many low earners worse off.",
    "link": "https://www.cnbc.com/2025/05/23/house-republican-big-beautiful-tax-bill-favors-the-rich.html",
    "timestamp": "2025-05-23T10:36:04Z"
  },
  {
    "title": "How Mike Johnson doused a GOP dumpster fire (Meredith Lee Hill/Politico)",
    "description": "Meredith Lee Hill / Politico:\nHow Mike Johnson doused a GOP dumpster fire  —  The speaker spent months keeping flare-ups from growing into a conflagration even Donald Trump couldn't extinguish.  —  Speaker Mike Johnson bet it all on “one big, beautiful bill.”…",
    "link": "https://www.memeorandum.com/250523/p1",
    "timestamp": "2025-05-23T10:35:10Z"
  },
  {
    "title": "Judge says Trump has power to impose tariffs, but punts lawsuit to different court (Associated Press)",
    "description": "Associated Press:\nJudge says Trump has power to impose tariffs, but punts lawsuit to different court  —  The judge cites the International Emergency Economic Powers Act of 1977.  —  President Donald Trump attends a Make America Healthy Again Commission event,…",
    "link": "https://www.memeorandum.com/250523/p2",
    "timestamp": "2025-05-23T10:35:10Z"
  },
  {
    "title": "Judge Says Tariffs Are Authorized By Emergency Powers Act In Win For Trump",
    "description": "The case arose from a challenge to tariffs that Trump imposed in an effort to stem the flow of drugs coming into the U.S.",
    "link": "https://thefederalist.com/2025/05/23/judge-says-tariffs-are-authorized-by-emergency-powers-act-in-win-for-trump/",
    "timestamp": "2025-05-23T10:35:00Z"
  },
  {
    "title": "Donald Trump Attacks UK's 'Unsightly Windmills'",
    "description": "Trump called the UK \"old fashioned\" in its approach.",
    "link": "https://www.newsweek.com/donald-trump-uk-energy-windmills-2076279",
    "timestamp": "2025-05-23T10:33:46Z"
  },
  {
    "title": "Morning Bid: Dollar keeps tumbling",
    "description": "Even though some calm returned to U.S. bond and stock markets overnight after this week's wave of fiscal policy anxiety, the dollar has continued to slide - ...",
    "link": "https://finance.yahoo.com/news/morning-bid-dollar-keeps-tumbling-103332498.html",
    "timestamp": "2025-05-23T10:33:32Z"
  },
  {
    "title": "Joe Biden's rise and fall: Political and personal tragedy with cancer diagnosis",
    "description": "MIDDLE ISRAEL: US President Joe Biden's formal departure from politics marks the end of a bygone era in US politics.",
    "link": "https://www.jpost.com/opinion/article-855126",
    "timestamp": "2025-05-23T10:33:00Z"
  },
  {
    "title": "Germany blasts US government's decision to block foreign admissions to Harvard University",
    "description": "Germany's Research Minister has weighed in on a dispute between the Trump administration and Harvard after the US government revoked the university's ability to enrol foreign students.",
    "link": "https://www.thelocal.de/20250523/germany-blasts-us-governments-decision-to-block-foreign-admissions-to-harvard-university",
    "timestamp": "2025-05-23T10:31:20Z"
  },
  {
    "title": "Trump’s ‘big beautiful bill’ includes attack on trans healthcare",
    "description": "The US House of Representatives narrowly passed a sweeping tax and spending bill – the One Big Beautiful Bill Act – that adds trillions to the national debt and cuts access to healthcare for trans people on insurance programmes. After divisive debate the One …",
    "link": "https://www.thepinknews.com/2025/05/23/big-beautiful-bill-us-house-of-representatives-trans-healthcare/",
    "timestamp": "2025-05-23T10:30:45Z"
  },
  {
    "title": "How Trump’s Sons Cashed In On Their Father’s Comeback",
    "description": "Don Jr. and Eric Trump struggled to launch new ventures during their father’s first term. Now, they’ve spotted opportunities everywhere, in licensing, hospitality, firearms, retail and—perhaps most importantly—crypto.",
    "link": "https://www.forbes.com/sites/kylemullins/2025/05/23/how-trumps-sons-cashed-in-on-their-fathers-comeback/",
    "timestamp": "2025-05-23T10:30:02Z"
  },
  {
    "title": "Trump calls Japan’s Ishiba ahead of latest tariff talks",
    "description": "U.S. President Donald Trump initiated a phone call with Japanese Prime Minister Shigeru Ishiba and discussed tariffs in general terms, just as Tokyo’s top negotiator left for the U.S. for another round of trade talks. \nTrump didn’t say anything specific about…",
    "link": "https://biztoc.com/x/1e25e1bf2cb2d239",
    "timestamp": "2025-05-23T10:29:58Z"
  },
  {
    "title": "'They always fold': Mike Johnson insider taunts hardliners after Trump 'let them have it'",
    "description": "In a post-mortem on how House Speaker Mike Johnson (R-LA) negotiated and cajoled his caucus into passing what Donald Trump has called his \"big beautiful bill,\" details are coming out from Politico on how he used Donald Trump to seal the deal with his special …",
    "link": "https://www.rawstory.com/trump-bullying-gop-2672192273/",
    "timestamp": "2025-05-23T10:29:53Z"
  },
  {
    "title": "Melania Trump Uses AI to Narrate Her New Memoir",
    "description": "The U.S. First Lady’s AI voice model was created “under her direction and supervision” by start-up ElevenLabs.",
    "link": "https://decrypt.co/321752/melania-trump-uses-ai-to-narrate-her-new-memoir",
    "timestamp": "2025-05-23T10:26:52Z"
  },
  {
    "title": "Florida woman charged after allegedly attacking 72-year-old Trump supporter wearing MAGA hat",
    "description": "Laura Garrett was arrested for battery on a person older than 65, battery on a police officer and obstructing or resisting an officer without violence.",
    "link": "https://nypost.com/2025/05/23/us-news/florida-woman-laura-garrett-charged-after-allegedly-attacking-72-year-old-trump-supporter-wearing-maga-hat/",
    "timestamp": "2025-05-23T10:26:15Z"
  },
  {
    "title": "TRUMP gala dinner attendees dump tokens before event as price falls 8% amid protests",
    "description": "US President Donald Trump hosted a highly publicized crypto dinner on May 22 for top holders of the TRUMP memecoin, attracting a mix of crypto elites and public figures from across the globe. The exclusive event, first announced in April, was reserved for the…",
    "link": "https://cryptoslate.com/trump-gala-dinner-attendees-dump-tokens-after-event-as-price-falls-8-amid-protests/",
    "timestamp": "2025-05-23T10:24:44Z"
  },
  {
    "title": "RFK Jr.’s MAHA report raises concerns about vaccines, American foods and prescription drugs",
    "description": "The much-anticipated report calls for increased scrutiny of the vaccine schedule and describes the nation’s children as overmedicated.",
    "link": "https://www.wkyt.com/2025/05/23/rfk-jrs-maha-report-raises-concerns-about-vaccines-american-foods-prescription-drugs/",
    "timestamp": "2025-05-23T10:24:22Z"
  },
  {
    "title": "Dismayed Chinese students ponder prospects after Trump Harvard ban",
    "description": "Dismayed Chinese students feared for their international futures on Friday after US President Donald Trump revoked Harvard University’s right to enrol foreign nationals. The sharp escalation in Trump’s longstanding feud with the elite Cambridge, Massachusetts…",
    "link": "https://www.digitaljournal.com/world/dismayed-chinese-students-ponder-prospects-after-trump-harvard-ban/article",
    "timestamp": "2025-05-23T10:23:23Z"
  },
  {
    "title": "With polygraphs and probes, Trump administration chases even minor leaks",
    "description": "The Trump administration intensified its crackdown on leaks, even of unclassified information, deploying lie detector tests and threatening employees with termination for refusal. This effort aimed to identify leakers and purge those deemed disloyal, while th…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/with-polygraphs-and-probes-trump-administration-chases-even-minor-leaks/articleshow/121361303.cms",
    "timestamp": "2025-05-23T10:21:27Z"
  },
  {
    "title": "Dismayed Chinese Students Ponder Prospects After Trump Harvard Ban",
    "description": "Dismayed Chinese students feared for their international futures on Friday after US President Donald Trump revoked Harvard University's right to enrol foreign nationals.",
    "link": "https://www.ibtimes.com/dismayed-chinese-students-ponder-prospects-after-trump-harvard-ban-3774344",
    "timestamp": "2025-05-23T10:21:18Z"
  },
  {
    "title": "US Debt Limit Nail-Biter Looms as Senate Ponders Trump Tax Bill",
    "description": "Chances of a close brush with a US payment default are growing as the Senate plans for time-consuming revisions to President Donald Trump’s sprawling, multi-trillion-dollar tax and spending package.",
    "link": "https://financialpost.com/pmn/business-pmn/us-debt-limit-nail-biter-looms-as-senate-ponders-trump-tax-bill",
    "timestamp": "2025-05-23T10:21:00Z"
  },
  {
    "title": "Pictures give glimpse inside Trump’s memecoin holder dinner",
    "description": "Photos from within US President Donald Trump’s secretive dinner for his top memecoin buyers show attendees were treated to a three-course meal and gift bags as protesters gathered outside the event to accuse Trump of profiting from the presidency.\nPictures po…",
    "link": "https://biztoc.com/x/3130e4c4ad108706",
    "timestamp": "2025-05-23T10:20:19Z"
  },
  {
    "title": "Trump: Deal with UK working out well for all",
    "description": "United States President Donald Trump said on Friday that the trade deal negotiated with the United Kingdom earlier this month is \"working out well for all.\" Among other provisions, the agreement dropp...",
    "link": "https://biztoc.com/x/9b214cb50910ae06",
    "timestamp": "2025-05-23T10:20:15Z"
  },
  {
    "title": "The Daily Show Turns CNN Guest’s ‘BBL’ Slip Into Trump Bill Takedown: ‘Mostly A**!’",
    "description": "The Daily Show correspondent Ronny Chieng seized on a CNN guest's unfortunate mix-up that handed the Comedy Central crew a punchline on a silver platter.\nThe post The Daily Show Turns CNN Guest’s ‘BBL’ Slip Into Trump Bill Takedown: ‘Mostly A**!’ first appear…",
    "link": "https://www.mediaite.com/media/tv/the-daily-show-turns-cnn-guests-bbl-slip-into-trump-bill-takedown-mostly-a/",
    "timestamp": "2025-05-23T10:17:22Z"
  },
  {
    "title": "Quiz of The Week: 17 – 23 May",
    "description": "Have you been paying attention to The Week's news?",
    "link": "https://theweek.com/puzzles/quiz-of-the-week-17-23-may",
    "timestamp": "2025-05-23T10:13:10Z"
  },
  {
    "title": "US Debt Concern After Tax Bill's Passage; President Trump's Harvard Fight",
    "description": "On today's podcast:  1) President Trump's tax cut bill heads to the Senate, but it may have to satisfy bond markets first. Bonds and the dollar rose, with 30-year yields falling after approaching levels last seen in 2007, as investors worried about the US's s…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/us-debt-concern-after-tax-bills-passage-president-trumps-harvard-fight",
    "timestamp": "2025-05-23T10:12:18Z"
  },
  {
    "title": "Tulsi Gabbard's right-hand man Joe Kent under scrutiny after leaked emails surface. What is the controversy?",
    "description": "US intelligence chief Tulsi Gabbard's top aide Joe Kent is currently under scanner. Joe Kent, reportedly instructed the National Intelligence Council to edit official assessments so that they aligned with Trump’s statements about Venezuelan gang activity. Gab…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-tulsi-gabbards-right-hand-man-joe-kent-under-scrutiny-after-leaked-emails-surface-pushed-alter-intelligence-report/articleshow/121360841.cms",
    "timestamp": "2025-05-23T10:10:22Z"
  },
  {
    "title": "Elite US universities face a 21% endowment tax under new spending bill",
    "description": "The move, seen as a cultural and political pushback against “woke” academic institutions, could cost top universities like Harvard, Stanford, MIT, and Yale hundreds of millions of dollars annually.",
    "link": "https://www.thehindubusinessline.com/news/education/elite-us-universities-face-a-21-endowment-tax-under-new-spending-bill/article69610006.ece",
    "timestamp": "2025-05-23T10:10:17Z"
  },
  {
    "title": "Why the Alien Enemies Act Should be Repealed",
    "description": "\"The Alien Enemies Act is one of the worst laws still in force in the United States, and it probably violates the Constitution to boot.\"",
    "link": "https://time.com/7288251/alien-enemies-act-repealed/",
    "timestamp": "2025-05-23T10:10:00Z"
  },
  {
    "title": "Donald Trump Announces 'Major Prisoners Swap'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump announced a \"major prisoners swap\" had taken place between Russia and Ukraine.\nThe two sides had agreed to exchange 1,000 prisoners each at their direct talks in Istanbul last week, the …",
    "link": "https://biztoc.com/x/abb6f09c51a96411",
    "timestamp": "2025-05-23T10:09:47Z"
  },
  {
    "title": "Chaotic Trump policies loom large over Canadian banks’ U.S. operations",
    "description": "Back in early 2017, Canadian bank CEOs were practically gushing about the prospect of Donald Trump’s first term as president of the United States.\nMr. Trump had yet to be inaugurated when the big bosses of Royal Bank of Canada, Toronto-Dominion Bank and Bank …",
    "link": "https://biztoc.com/x/7391a682da63d848",
    "timestamp": "2025-05-23T10:09:46Z"
  },
  {
    "title": "Putting America First—President Trump Is Fighting to Save Over 250,000 American Cabinet Jobs | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nIn recent days, President Donald Trump secured over $2 trillion in economic deals on his Middle East trip to grow our economy and create tens of thousands of new American jobs. Our president and his team also …",
    "link": "https://biztoc.com/x/ba771b8192fc6ccf",
    "timestamp": "2025-05-23T10:09:40Z"
  },
  {
    "title": "RFK Jr.’s MAHA report raises concerns about vaccines, American foods and prescription drugs",
    "description": "The much-anticipated report calls for increased scrutiny of the vaccine schedule and describes the nation’s children as overmedicated.",
    "link": "https://www.wfsb.com/2025/05/23/rfk-jrs-maha-report-raises-concerns-about-vaccines-american-foods-prescription-drugs/",
    "timestamp": "2025-05-23T10:06:44Z"
  },
  {
    "title": "Elon Musk's DOGE expanding his Grok AI in U.S. government, raising conflict concerns",
    "description": "Elon Musk's DOGE team is reportedly expanding the use of his AI chatbot Grok within the U.S. federal government for data analysis, raising concerns about potential conflicts of interest and the security of sensitive information. DOGE staff allegedly encourage…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musks-doge-expanding-his-grok-ai-in-u-s-government-raising-conflict-concerns/articleshow/121360936.cms",
    "timestamp": "2025-05-23T10:06:16Z"
  },
  {
    "title": "Pentagon Announces Acceptance Of B-747 From Qatar",
    "description": "Will Be Used As Air Force One By President Trump After Modification The Pentagon announced that Secretary of Defense Pete Hegseth has accepted a Boeing 747 from Qatar that will be used by President Donald Trump after the Pentagon performs upgrades to include …",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=E766B483-0AFC-4BE2-ACB0-302956B67ECA",
    "timestamp": "2025-05-23T10:05:00Z"
  },
  {
    "title": "President, SecDef Announce Golden Dome Missile Defense Plan",
    "description": "Space Force Vice Chief Gen. Guetlein To Lead Project President Donal Trump and Secretary of Defense Pete Hegseth announced the selection of an architecture and the initiation of planning to build a state-of-the-art missile defense shield it calls Project Gold…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=AD3503C8-B66A-4D2D-9C45-B63640A3510A",
    "timestamp": "2025-05-23T10:05:00Z"
  },
  {
    "title": "Trump says 'major' Ukraine-Russia prisoner swap 'just completed'",
    "description": "U.S. President Donald Trump on Friday announced a \"major\" prisoner swap between Ukraine and Russia.",
    "link": "https://www.hurriyetdailynews.com/trump-says-major-ukraine-russia-prisoner-swap-just-completed-209516",
    "timestamp": "2025-05-23T10:03:48Z"
  },
  {
    "title": "Exclusive-Musk’s DOGE expanding his Grok AI in US government, raising conflict concerns",
    "description": "Billionaire Elon Musk’s DOGE team is expanding use of his artificial intelligence chatbot Grok in the U.S. federal government to analyze data, said three people familiar with the matter, potentially violating conflict-of-interest laws and putting at risk sens…",
    "link": "https://www.channelnewsasia.com/business/exclusive-musks-doge-expanding-his-grok-ai-us-government-raising-conflict-concerns-5149301",
    "timestamp": "2025-05-23T10:02:39Z"
  },
  {
    "title": "Nvidia earnings in focus as rising US yields, debt rattle markets",
    "description": "An earnings report from semiconductor giant and artificial intelligence bellwether Nvidia takes center stage for Wall Street in the coming week, as stocks...",
    "link": "https://finance.yahoo.com/news/nvidia-earnings-focus-rising-us-100218235.html",
    "timestamp": "2025-05-23T10:02:18Z"
  },
  {
    "title": "Donald Trump Announces 'Major Prisoners Swap'",
    "description": "President Donald Trump said the swap between Russia and Ukraine could \"lead to something big\".",
    "link": "https://www.newsweek.com/trump-prisoner-swap-russia-ukraine-2076255",
    "timestamp": "2025-05-23T10:01:51Z"
  },
  {
    "title": "No sympathy for Joe Biden (or Jake Tapper)",
    "description": "Joe Biden has prostate cancer. He revealed the diagnosis this week, almost six years after promising to cure cancer if elected. (Yes, he actually said that.) The announcement came just days before the release of a new book by Jake Tapper and Alex Thompson abo…",
    "link": "https://freebeacon.com/newsletters/no-sympathy-for-joe-biden-or-jake-tapper/",
    "timestamp": "2025-05-23T10:00:55Z"
  },
  {
    "title": "Trump reverses course on Middle East tech policy, but will it be enough to counter China?",
    "description": "Trump's Middle East deals worth $2 trillion spark debate over AI chip sales to UAE and Saudi Arabia, raising concerns about China's access to U.S. technology.",
    "link": "https://www.foxnews.com/world/trump-reverses-course-middle-east-tech-policy-enough-counter-china",
    "timestamp": "2025-05-23T10:00:30Z"
  },
  {
    "title": "Trump pushes EU to cut tariffs or face extra duties",
    "description": "US negotiators to tell Brussels they expect unilateral concessions",
    "link": "https://www.irishtimes.com/business/2025/05/23/trump-pushes-eu-to-cut-tariffs-or-face-extra-duties/",
    "timestamp": "2025-05-23T10:00:21Z"
  },
  {
    "title": "Letitia James Is Caught in a War of Her Own Making",
    "description": "Tish James wrongly weaponized her office against Trump, but that doesn’t make his retaliation with the Justice Department right.",
    "link": "http://nymag.com/intelligencer/article/trump-doj-letitia-james-indictment-war.html",
    "timestamp": "2025-05-23T10:00:10Z"
  },
  {
    "title": "Night Moves",
    "description": "The latest episode of Trial Balloon is live for members. Republicans pass a massive tax bill in the dead of night. And Donald Trump holds a dinner for buyers of Trump coin. . You’ll get",
    "link": "https://politicalwire.com/2025/05/23/night-moves/",
    "timestamp": "2025-05-23T10:00:10Z"
  },
  {
    "title": "'Globalize the Intifada' and the Evils of Left-Wing Political Violence | Opinion",
    "description": "The violence must end—period.",
    "link": "https://www.newsweek.com/globalize-intifada-evils-left-wing-political-violence-opinion-2076158",
    "timestamp": "2025-05-23T10:00:02Z"
  },
  {
    "title": "Putting America First—President Trump Is Fighting to Save Over 250,000 American Cabinet Jobs | Opinion",
    "description": "Having travelled across our nation with President Trump as his chief of staff, I saw firsthand his strong desire to bring about real fair trade for American manufacturing workers in critical sectors of our economy.",
    "link": "https://www.newsweek.com/putting-america-firstpresident-trump-fighting-save-over-250000-american-cabinet-jobs-opinion-2075961",
    "timestamp": "2025-05-23T10:00:01Z"
  },
  {
    "title": "The Democrats Are Having a False Reckoning Over Joe Biden",
    "description": "If it’s caught early, before it’s had the\nchance to spread to other parts of the body, 99 percent of patients with cancer of\nthe prostate go on to live at least another five years. Once it’s metastasized,\nthe five-year survival rate drops substantially;⁠ down…",
    "link": "https://newrepublic.com/article/195379/biden-democrats-elite-failure-2028",
    "timestamp": "2025-05-23T10:00:00Z"
  },
  {
    "title": "She Exposed Government Abuse. Now She's Locked up in an El Salvador Prison.",
    "description": "From El Salvador to South Sudan, inside America’s global prison pipeline. \nThe post She Exposed Government Abuse. Now She’s Locked up in an El Salvador Prison.  appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/23/podcast-el-salvador-cecot-prison-bukele-trump-immigrants/",
    "timestamp": "2025-05-23T10:00:00Z"
  }
]