[
  {
    "title": "Trump Orders D.C. Mayor to ‘Clean Up All of the Unsightly Homeless’ in City",
    "description": "President Donald Trump announced he had ordered Washington, D.C. Mayor Muriel Bowser to \"clean up all of the unsightly homeless encampments\" in the city.\nThe post Trump Orders D.C. Mayor to ‘Clean Up All of the Unsightly Homeless’ in City first appeared on Me…",
    "link": "https://www.mediaite.com/politics/trump-orders-d-c-mayor-to-clean-up-all-of-the-unsightly-homeless-in-city/",
    "timestamp": "2025-03-06T00:44:28Z"
  },
  {
    "title": "Scientists raise concerns as the US stops sharing air quality data from embassies worldwide",
    "description": "Experts say the effort was vital to monitor global air quality and improve public health.",
    "link": "https://www.bostonherald.com/2025/03/05/trump-air-monitoring-shutdown/",
    "timestamp": "2025-03-06T00:42:51Z"
  },
  {
    "title": "Dem Rep compares reaction to Green’s outburst to 'racist yelling' from Jim Crow era",
    "description": "Rep. Simon blasted Republicans at Trumps recent address, arguing they are acting like politicians did during Segregation and bringing back visceral memories of \"Jim Crow America.\"",
    "link": "https://www.foxnews.com/media/dem-rep-compares-reaction-greens-outburst-racist-yelling-from-jim-crow-era",
    "timestamp": "2025-03-06T00:42:40Z"
  },
  {
    "title": "While Democrats heckled, Trump's biggest obstacles sat quietly",
    "description": "As Democrats heckled and Republicans cheered, four robed figures sat silently through Donald Trump's speech. They could form part of his biggest barrier.",
    "link": "https://www.abc.net.au/news/2025-03-06/donald-trump-speech-congress-supreme-court-justices-analysis/105016138",
    "timestamp": "2025-03-06T00:40:19Z"
  },
  {
    "title": "Family fears federal housing cuts could jeopardize their Missouri home",
    "description": "The Department of Housing and Urban Development helped Calvin and Symone Bentley and their 7-year-old son put a roof over their heads, but DOGE downsizing is making them nervous.",
    "link": "https://www.nbcnews.com/news/us-news/family-fears-federal-housing-cuts-jeopardize-missouri-home-rcna194977",
    "timestamp": "2025-03-06T00:36:30Z"
  },
  {
    "title": "Donald Trump sends strong message on inflation",
    "description": "On Tuesday, March 4, U.S. President Donald Trump addressed the full Congress for the first time in five years, and he had a clear opening message for not just the legislature but the entire country.\n\"Members of the United States Congress, thank you very much.…",
    "link": "https://biztoc.com/x/41df8cacc046c996",
    "timestamp": "2025-03-06T00:34:15Z"
  },
  {
    "title": "EU leaders to hold defence summit in Paris",
    "description": "Leaders are also expected to discuss how the EU can further support Kyiv after the US suspended aid to Ukraine.",
    "link": "https://www.bbc.com/news/articles/c3w14gw3wwlo",
    "timestamp": "2025-03-06T00:34:07Z"
  },
  {
    "title": "Rory McIlroy offers blunt yet pessimistic outlook on pending PGA Tour, LIV Golf deal",
    "description": "Rory McIlroy sounded rather gloom when the conversation surrounding a deal between the PGA Tour and LIV Golf arose.",
    "link": "https://www.sbnation.com/golf/2025/3/5/24378878/rory-mcilroy-pessimistic-pga-tour-liv-golf-deal",
    "timestamp": "2025-03-06T00:32:11Z"
  },
  {
    "title": "AG Secretary Says Biden Admin Racked Up $49 Billion Trade Deficit That Triggered 30% Surge In Farm Costs",
    "description": "Brooke Rollins revealed on Fox Business Wednesday that the Biden admin left a $49 billion deficit in export market.",
    "link": "https://dailycaller.com/2025/03/05/ag-secretary-brooke-rollins-biden-admin-trade-deficit/",
    "timestamp": "2025-03-06T00:31:59Z"
  },
  {
    "title": "US tariffs from April 2? India weighs trade strategy",
    "description": "US President Donald Trump has pledged to impose reciprocal tariffs on India from April 2, citing high import taxes on American goods. This move could impact India's key exports to the US, including automobile parts, electronics, and textiles. Indian officials…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-tariffs-from-april-2-india-weighs-trade-strategy/articleshow/118742857.cms",
    "timestamp": "2025-03-06T00:30:00Z"
  },
  {
    "title": "Federal judge blocks drastic funding cuts to medical research",
    "description": "A federal judge blocked the Trump administration Wednesday from drastically cutting medical research funding that many scientists say will endanger patients and cost jobs.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_ed4c3269-4941-594c-ad4d-575255597b22.html",
    "timestamp": "2025-03-06T00:30:00Z"
  },
  {
    "title": "Federal judge blocks drastic funding cuts to medical research",
    "description": "A federal judge blocked the Trump administration Wednesday from drastically cutting medical research funding that many scientists say will endanger patients and cost jobs.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_9bf9de83-830f-599d-bcdb-b91b6a0e856d.html",
    "timestamp": "2025-03-06T00:30:00Z"
  },
  {
    "title": "Trump tariffs threaten to derail Canada’s economic recovery",
    "description": "'If the tariffs are sustained indefinitely, it would almost wipe out two years' worth of economic growth,' says Craig Alexander, president of Alexander Economic Views, an independent economic research organization",
    "link": "https://www.rappler.com/business/trump-tariffs-threaten-derail-canada-economic-recovery/",
    "timestamp": "2025-03-06T00:30:00Z"
  },
  {
    "title": "Congressman Ejected from Trump Speech Remains Defiant Ahead of Censure Vote: ‘I Would Do It Again’",
    "description": "Rep. Al Green struck a defiant note on the House floor for the second day in a row, stating that he does not regret disrupting President Donald Trump's speech. \nThe post Congressman Ejected from Trump Speech Remains Defiant Ahead of Censure Vote: ‘I Would Do …",
    "link": "https://www.mediaite.com/tv/congressman-ejected-from-trump-speech-remains-defiant-ahead-of-censure-vote-i-would-do-it-again/",
    "timestamp": "2025-03-06T00:27:15Z"
  },
  {
    "title": "EU leaders to back defence surge, support Zelenskiy after US aid freeze",
    "description": "BRUSSELS (Reuters) - European leaders aim to endorse bold measures to ramp up defence spending and pledge support for Ukraine on Thursday, after Donald Trump's suspension of military aid to Kyiv fuelled concerns the continent can no longer be sure of U.S. pro…",
    "link": "https://www.thestar.com.my/news/world/2025/03/06/eu-leaders-to-back-defence-surge-support-zelenskiy-after-us-aid-freeze",
    "timestamp": "2025-03-06T00:27:00Z"
  },
  {
    "title": "Democrat Rep. Stansbury goes on profane tirade during sanctuary city hearing: 'total bulls***'",
    "description": "Democrat Rep. Melanie Stansbury of New Mexico went off in a curse-laden tirade against Republicans during a House Oversight Committee hearing on sanctuary cities, calling the hearing “utter bulls--t.\"",
    "link": "https://www.foxnews.com/politics/democrat-rep-stansbury-profane-tirade-sanctuary-city-hearing",
    "timestamp": "2025-03-06T00:25:56Z"
  },
  {
    "title": "US auto tariffs: Trump delays levies after market pressure and GOP pushback",
    "description": "When President Donald Trump declared in the House Chamber this week that executives at the nation’s top automakers were “so excited” about their prospects amid his new tariff regime, it did not entirely reflect the conversation he’d held with them earlier tha…",
    "link": "https://www.cnn.com/2025/03/05/politics/trump-auto-tariff-market-pressure/index.html",
    "timestamp": "2025-03-06T00:24:06Z"
  },
  {
    "title": "Republicans Cheer on Musk as Trump Praises Him for DOGE",
    "description": "President Donald Trump vowed to keep up his campaign of “swift and unrelenting action” in reorienting the nation’s economy, immigration and foreign policy as he delivered a unyielding address Tuesday night to Congress and the nation.\nTrump pledged to keep del…",
    "link": "https://biztoc.com/x/8fb022cbb10a1ca3",
    "timestamp": "2025-03-06T00:23:30Z"
  },
  {
    "title": "Some NYC Food Prices May Rise 25 Percent From Tariffs",
    "description": "Rising food costs in restaurants and grocery stores have already been brutal for New Yorkers, and there’s not much relief in sight with the steep tariffs that President Donald Trump has just implemented.\nTrump announced this week that the U.S. would be instat…",
    "link": "https://biztoc.com/x/4285356cb89f47f1",
    "timestamp": "2025-03-06T00:23:26Z"
  },
  {
    "title": "What Donald Trump's Said About Tom Llamas, Lester Holt's Replacement",
    "description": "Tom Llamas, set to replace Lester Holt as anchor of NBC's Nightly News this summer, was called a \"sleaze\" by former President Donald Trump during the 2016 campaign.\nWhy It Matters\nNBC News announced Wednesday that Llamas will take over as anchor of Nightly Ne…",
    "link": "https://biztoc.com/x/57e8b49d12bb5a71",
    "timestamp": "2025-03-06T00:23:17Z"
  },
  {
    "title": "'Mixed emotions': Auto union leaders frustrated as Trump offers some tariff reprieve",
    "description": "The leader of a local union representing nearly 2,000 Ford employees says he’s feeling “mixed emotions” after U.S. President Donald Trump announced a one-month tariff reprieve for the auto sector.",
    "link": "https://www.cbc.ca/news/canada/windsor/windsor-reaction-tariff-exemption-1.7475924",
    "timestamp": "2025-03-06T00:23:15Z"
  },
  {
    "title": "Dave Portnoy scolds Democrats for 'kindergarten skit' during Trump's address to Congress: 'Clown show'",
    "description": "Barstool Sports president Dave Portnoy breaks down the Democratic Party's 'theatrics' during President Donald Trump's joint address to Congress on 'The Will Cain Show.'",
    "link": "https://www.foxnews.com/media/dave-portnoy-scolds-democrats-kindergarten-skit-during-trumps-address-congress-clown-show",
    "timestamp": "2025-03-06T00:22:24Z"
  },
  {
    "title": "Trump issues ‘last warning’ to Hamas to release all hostages in Gaza, as US holds direct talks with Hamas",
    "description": "US President Donald Trump issued what he said was a “last warning” to Hamas to release all of the hostages in Gaza immediately – in a move that came just hours after the White House confirmed it was negotiating directly with the militant group.",
    "link": "https://www.cnn.com/2025/03/05/middleeast/trump-hamas-gaza-hostages-negotiation-israel-intl-latam/index.html",
    "timestamp": "2025-03-06T00:22:04Z"
  },
  {
    "title": "FEC approves N660bn federal highway contracts",
    "description": "The Federal Executive Council on Wednesday approved 13 contracts for the Ministry of Works, aimed at rehabilitating, rescoping and completing critical road infrastructure inherited from the previous administration. The Minister of Works, Dave Umahi, disclosed…",
    "link": "https://punchng.com/fec-approves-n660bn-federal-highway-contracts/",
    "timestamp": "2025-03-06T00:19:04Z"
  },
  {
    "title": "What Donald Trump's Said About Tom Llamas, Lester Holt's Replacement",
    "description": "He has been outspoken in his support for and criticism of specific outlets and journalists.",
    "link": "https://www.newsweek.com/donald-trump-tom-llamas-lester-holt-nbc-nightly-news-2040313",
    "timestamp": "2025-03-06T00:17:33Z"
  },
  {
    "title": "Trump Condemns ‘Total Disrespect’ of Democrats at Address: ‘Didn’t Even Have the Common Courtesy to Stand’",
    "description": "President Donald Trump condemned the \"total disrespect\" displayed by Democrats towards him during his joint address to Congress.\nThe post Trump Condemns ‘Total Disrespect’ of Democrats at Address: ‘Didn’t Even Have the Common Courtesy to Stand’ first appeared…",
    "link": "https://www.mediaite.com/politics/trump-condemns-total-disrespect-of-democrats-at-address-didnt-even-have-the-common-courtesy-to-stand/",
    "timestamp": "2025-03-06T00:16:54Z"
  },
  {
    "title": "Salesforce to End Diversity Hiring Targets After Trump Order",
    "description": "Salesforce Inc. is ending diversity goals in hiring after President Donald Trump signed a series of executive orders aimed at eliminating such programs across the federal government and the private sector.",
    "link": "https://www.livemint.com/companies/news/salesforce-to-end-diversity-hiring-targets-after-trump-order-11741220068370.html",
    "timestamp": "2025-03-06T00:14:28Z"
  },
  {
    "title": "‘Hamilton’ Cancels Kennedy Center Show Run In Protest Of Trump’s ‘Purge’",
    "description": "President Donald Trump was appointed as the performing arts center’s chairman last month to combat its “woke” programming.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/03/05/hamilton-cancels-kennedy-center-show-run-in-protest-of-trumps-purge/",
    "timestamp": "2025-03-06T00:14:04Z"
  },
  {
    "title": "Yes, Biden Spent Millions on Transgender Animal Experiments - The White House",
    "description": "Yes, Biden Spent Millions on Transgender Animal ExperimentsThe White House Republican, independent voters react positively to Trump declaring US 'woke no longer'Fox News Fact-checking Trump’s anti-transgender comments in his address to CongressNBC News Volley…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176625409",
    "timestamp": "2025-03-06T00:13:32Z"
  },
  {
    "title": "Court Allows Removal Of Watchdog Agency Head As Legal Battle Rages Over Trump Firing",
    "description": "The U.S. Court of Appeals for the District of Columbia sided with the Trump administration in allowing the immediate removal of Hampton Dellinger.",
    "link": "https://www.huffpost.com/entry/trump-firing-watchdog-agency_n_67c8e7e9e4b0f9da004301f6",
    "timestamp": "2025-03-06T00:12:41Z"
  },
  {
    "title": "Trump slams Dems' reaction to his speech",
    "description": "United States President Donald Trump called on Republicans to use footage from the previous night's address to Congress as a campaign strategy for the midterms. In a statement, he criticized Democ...",
    "link": "https://biztoc.com/x/58d573a531e8b029",
    "timestamp": "2025-03-06T00:12:16Z"
  },
  {
    "title": "Donald Trump’s Joint Address to Congress Draws 36.6 Million Viewers",
    "description": "President Donald Trump's joint address to Congress was seen by 36.6 million people, according to final figures from Nielsen Media Research. The address aired on Tuesday night from approximately 9:15 to 11:00 p.m. and was seen across 15 networks. Peak viewersh…",
    "link": "https://www.adweek.com/tvnewser/donald-trump-joint-address-congress-ratings/",
    "timestamp": "2025-03-06T00:10:22Z"
  },
  {
    "title": "China doubles down on AI and tech innovation as Trump ratchets up trade pressure",
    "description": "The undercurrent of China's annual parliamentary meetings this week is U.S. trade tensions — and how Chinese technology is offsetting that pressure.",
    "link": "https://www.cnbc.com/2025/03/06/china-doubles-down-on-ai-and-tech-as-trump-ratchets-up-trade-pressure.html",
    "timestamp": "2025-03-06T00:10:14Z"
  },
  {
    "title": "Cheaper petrol on the way as global oil price slumps to 3-year low",
    "description": "Slower global growth is suppressing oil prices which should flow to the local pump prices.",
    "link": "https://www.nzherald.co.nz/business/cheaper-petrol-on-the-way-as-global-oil-price-slumps-to-3-year-low/L4J3JDJ235FELHEIPUXQIB6JCU/",
    "timestamp": "2025-03-06T00:10:00Z"
  },
  {
    "title": "Servicemembers Come Home Only To Find Themselves In A New Hell — The VA’s Cold Bureaucracy",
    "description": "U.S. service members come back from fighting America's enemies overseas only to have to fight another enemy at home: the broken Department of Veterans Affairs (VA).",
    "link": "https://dailycaller.com/2025/03/05/servicemembers-bureaucracy-va-veterans-medical-care/",
    "timestamp": "2025-03-06T00:09:25Z"
  },
  {
    "title": "Consumer protection workers endure chaos and confusion amid efforts to dismantle their agency | CNN Politics",
    "description": "Chaos within the Consumer Financial Protection Bureau has come to light in a recent court filing showing emails and documents from employees inside the agency amid efforts to dismantle it, illustrating a team scrambling to make do with recent firings and conf…",
    "link": "https://www.cnn.com/2025/03/05/politics/cfpb-workers-confusion-emails-doge/index.html",
    "timestamp": "2025-03-06T00:08:09Z"
  },
  {
    "title": "Critics Ask If Trump and Musk Are 'Intentionally Crashing the Economy'",
    "description": "Are U.S. President Donald Trump, top adviser Elon Musk, and allied oligarchs deliberately trying to tank the economy in order to line their own gilded pockets?\n\nMore and more observers from \nboth sides of the political aisle are asking the question this week …",
    "link": "https://www.commondreams.org/news/trump-musk-intentionally-crashing-economy",
    "timestamp": "2025-03-06T00:07:02Z"
  },
  {
    "title": "Appeals court allows removal of watchdog agency head fired by Trump as legal battle continues",
    "description": "The U.S. Court of Appeals for the District of Columbia sided with the Trump administration in allowing the immediate removal of Hampton Dellinger as head of the Office of Special Counsel while the court battle continues. Dellinger is likely to appeal to the U…",
    "link": "https://www.pbs.org/newshour/politics/appeals-court-allows-removal-of-watchdog-agency-head-fired-by-trump-as-legal-battle-continues",
    "timestamp": "2025-03-06T00:05:52Z"
  },
  {
    "title": "Court Lets Trump Fire Watchdog Chief For Now: Here’s Where Trump And Musk Are Winning—And Losing—In Court",
    "description": "Dozens of lawsuits have been filed challenging the Trump administration’s policies.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/05/court-lets-trump-fire-watchdog-chief-for-now-heres-where-trump-and-musk-are-winning-and-losing-in-court/",
    "timestamp": "2025-03-06T00:05:31Z"
  },
  {
    "title": "State Rep. Macri Introduces a Bill to Increase Hormone Access",
    "description": "Washington lawmakers are considering a bill that would require medical insurance companies in Washington to cover up to a year’s supply of hormone replacement therapy, or HRT, at a time.\n \n by Vivian McCall\n \n \n \n Washington lawmakers are considering a bill t…",
    "link": "https://www.thestranger.com/queer/2025/03/05/79953700/state-rep-macri-introduces-a-bill-to-increase-hormone-access",
    "timestamp": "2025-03-06T00:05:00Z"
  },
  {
    "title": "Alleged Abbey Gate plotter extradited to US to face 'justice for our 13,' FBI Director Kash Patel says",
    "description": "The mastermind behind the Abbey Gate bombing that killed scores of people, including 13 U.S. service members, has been brought back to the U.S.",
    "link": "https://www.foxnews.com/us/alleged-abbey-gate-plotter-extradited-us-face-justice-our-13-fbi-director-kash-patel-says",
    "timestamp": "2025-03-06T00:04:48Z"
  },
  {
    "title": "Young father killed by illegal immigrant highlights 'betrayal' of sanctuary cities, says Republican",
    "description": "Louisiana Rep. Clay Higgins said that President Donald Trump has “ripped the curtains from the rods,\" revealing the impact of sanctuary policies across America.",
    "link": "https://www.foxnews.com/politics/young-father-killed-illegal-immigrant-highlights-betrayal-sanctuary-cities-says-republican",
    "timestamp": "2025-03-06T00:04:41Z"
  },
  {
    "title": "Trump issues 'last warning' to Hamas terrorists, demands release of hostages: 'HELL TO PAY'",
    "description": "President Donald Trump delivered a firm warning to Hamas in a Truth Social post Wednesday, urging the terrorist group to release all hostages without delay.",
    "link": "https://www.foxnews.com/politics/trump-issues-last-warning-hamas-terrorists-demands-release-hostages-hell-pay",
    "timestamp": "2025-03-06T00:04:35Z"
  },
  {
    "title": "These private companies seem eager to aid Trump's immigration crackdown",
    "description": "The Trump administration's mass deportation plan is expensive — and several companies are trying to get in on the action.",
    "link": "https://www.msnbc.com/the-reidout/reidout-blog/trump-mass-deportations-private-companies-rcna194949",
    "timestamp": "2025-03-06T00:04:34Z"
  },
  {
    "title": "Hamilton Cancels Kennedy Center Run Amid Trump Changes",
    "description": "The president of the performing arts center claimed the cancellation is because Lin-Manuel Miranda \"can't be in the same room with Republicans.\"",
    "link": "https://www.huffpost.com/entry/hamilton-kennedy-center_n_67c8d687e4b0bdda614f76cd",
    "timestamp": "2025-03-06T00:04:32Z"
  },
  {
    "title": "Cramer suggests Trump is upending the way investors evaluate stocks",
    "description": "CNBC's Jim Cramer reflected on Wednesday's uneven day of trading and suggested that President Donald Trump is changing the way investors view stocks.",
    "link": "https://www.cnbc.com/2025/03/05/cramer-suggests-trump-is-upending-the-way-investors-evaluate-stocks.html",
    "timestamp": "2025-03-06T00:04:07Z"
  },
  {
    "title": "Business Leaders Hit Capitol Hill to Defend Clean-Energy Tax Credits",
    "description": "As congressional Republicans plan deep budget cuts, some of the loudest voices in defense of tax credits for clean energy are from business leaders.",
    "link": "https://www.newsweek.com/clean-energy-tax-credits-budget-cuts-business-reactions-2040297",
    "timestamp": "2025-03-06T00:03:41Z"
  },
  {
    "title": "Trump ratchets up tariff tension with Canada’s Trudeau over border policies",
    "description": "The president has repeatedly accused Canada of allowing vast amounts of fentanyl into the US, an unsupported claim.",
    "link": "https://www.aljazeera.com/news/2025/3/6/trump-ratchets-up-tariff-tension-with-canadas-trudeau-over-border-policies",
    "timestamp": "2025-03-06T00:03:03Z"
  },
  {
    "title": "Trump Issues 'Last Warning' to Hamas to Release All Remaining Hostages Held in Gaza",
    "description": "WASHINGTON — President Donald Trump on Wednesday issued what he called a “last warning” to Hamas to release all remaining hostages held in Gaza, directing a sharply worded message after the White House confirmed that he had recently dispatched an envoy for un…",
    "link": "https://freerepublic.com/focus/f-news/4302365/posts",
    "timestamp": "2025-03-06T00:03:00Z"
  },
  {
    "title": "As a lifelong Dem, I never thought I’d see my party embarrass itself so much",
    "description": "As a lifelong Democrat, I never imagined I would watch my own party embarrass itself so thoroughly— and so publicly — as it did during Tuesday’s joint session of Congress.",
    "link": "https://nypost.com/2025/03/05/opinion/as-a-democrat-im-embarrassed-for-my-party-and-worried-for-the-nation/",
    "timestamp": "2025-03-06T00:01:44Z"
  },
  {
    "title": "Trump takes a victory lap in fiery address to Congress",
    "description": "The nation is taking stock after President Donald Trump's marathon address to Congress. It was a speech reminiscent of one of his liveliest campaign rallies, full of applause lines for Republicans. But the night also escalated into one of the nastiest partisa…",
    "link": "https://biztoc.com/x/5376b9b7a3756d49",
    "timestamp": "2025-03-06T00:01:30Z"
  },
  {
    "title": "Appeals court allows Trump administration to remove federal ethics watchdog — for now",
    "description": "The Supreme Court is likely to determine whether President Donald Trump can fire Hampton Dellinger as head of the Office of Special Counsel.",
    "link": "https://biztoc.com/x/c6dcf7441bcb7c87",
    "timestamp": "2025-03-06T00:01:16Z"
  },
  {
    "title": "Homeowners face risk of higher insurance premiums as tariffs put pressure on building material costs",
    "description": "Canadian homeowners can expect to face higher premiums when they renew their home insurance, as new U.S. tariffs add pressure on property and casualty insurers by raising the cost of building materials and appliances.\nOn Tuesday, U.S. President Donald Trump i…",
    "link": "https://biztoc.com/x/dc8a81805e46096b",
    "timestamp": "2025-03-06T00:01:08Z"
  },
  {
    "title": "Is Greenland for Sale?",
    "description": "US president Donald Trump says he wants the US to take over Greenland. Many people think it will never happen. But could it? If so, how?",
    "link": "https://www.bbc.co.uk/iplayer/episode/m0028msr/is-greenland-for-sale",
    "timestamp": "2025-03-06T00:01:00Z"
  },
  {
    "title": "Trump said federal funding will stop for colleges that allow 'illegal protests' — without specifics",
    "description": "U.S. President Donald Trump said the federal government will stop funding post-secondary institutions that allow \"illegal protests.\"",
    "link": "https://www.snopes.com//fact-check/trump-college-illegal-protests/",
    "timestamp": "2025-03-06T00:01:00Z"
  },
  {
    "title": "Trump issues ‘last warning’ to Hamas to release all remaining hostages held in Gaza",
    "description": "President Donald Trump on Wednesday issued what he called a “last warning” to Hamas to release all remaining hostages held in Gaza, directing a sharply worded message after the White House confirmed that he had recently dispatched an envoy for unprecedented d…",
    "link": "https://www.wpxi.com/news/local/trump-issues-last-warning-hamas-release-all-remaining-hostages-held-gaza/4X3VEBAS6NF2JL5VYJGCWYNI7M/",
    "timestamp": "2025-03-06T00:00:43Z"
  },
  {
    "title": "Chicago resident slams Democrats' attempts to 'racialize' immigration issues amid sanctuary city hearings",
    "description": "P-Rae Easley, a Chicago resident, says she feels Americans are at a \"disadvantage\" because of sanctuary city policies.",
    "link": "https://www.foxnews.com/media/chicago-resident-slams-democrats-attempts-racialize-immigration-issues-amid-sanctuary-city-hearings",
    "timestamp": "2025-03-06T00:00:39Z"
  },
  {
    "title": "Piers Morgan Threatens To Mute Lib Who Repeatedly Ducks His Question On Men In Women’s Sports",
    "description": "Piers threatened to mute far-left influencer after she repeatedly attempted to avoid answering the issue of biological men participating in women’s sports.",
    "link": "https://dailycaller.com/2025/03/05/piers-morgan-mute-liberal-womens-sports-donald-trump/",
    "timestamp": "2025-03-06T00:00:16Z"
  },
  {
    "title": "Trump’s inaugural crypto summit: Coinbase CEO, Chainlink Co-Founder & top execs set to attend",
    "description": "There were speculations that the summit could feature crypto strategic reserve updates.",
    "link": "https://ambcrypto.com/trumps-inaugural-crypto-summit-coinbase-ceo-chainlink-co-founder-top-execs-set-to-attend/",
    "timestamp": "2025-03-06T00:00:09Z"
  },
  {
    "title": "Trump Left No Doubt That He and Musk Are Coming for Social Security",
    "description": "Politics\n \n \n / \n March 6, 2025\n \r\n\n \nTrump Left No Doubt That He and Musk Are Coming for Social Security\r\n\n\n\nDemocrats should be shouting from the rooftops about the threat to Social Security, Medicare and Medicaid.\r\n\n\n\r\n\n \n \n John Nichols \r\n\n \n \n Share\n \n \n…",
    "link": "https://www.thenation.com/?post_type=article&p=544903",
    "timestamp": "2025-03-06T00:00:00Z"
  },
  {
    "title": "Victor Davis Hanson Predicts The Future: Trump, China, Russia, & Europe In 2030",
    "description": "Hoover Institution fellow Victor Davis Hanson conducts a thought experiment: it's 2030, how can we expect to understand the legacy of President Donald Trump; the shifting political landscape in Germany and the rest of Europe; the outcome of the Ukraine-Russia…",
    "link": "https://www.hoover.org/research/victor-davis-hanson-predicts-future-trump-china-russia-europe-2030",
    "timestamp": "2025-03-06T00:00:00Z"
  },
  {
    "title": "Lanhee Chen: Trump Sticks With His Agenda In Face Of Domestic, Global Pushback",
    "description": "Hoover Institution fellow Lanhee Chen talks about President Donald Trump’s record 100-minute State of the Union address to Congress this week.",
    "link": "https://www.hoover.org/research/lanhee-chen-trump-sticks-his-agenda-face-domestic-global-pushback",
    "timestamp": "2025-03-06T00:00:00Z"
  },
  {
    "title": "Chen: Trump Sticks With His Agenda In Face Of Domestic, Global Pushback",
    "description": "Hoover Institution fellow Lanhee Chen talks about President Donald Trump’s record 100-minute State of the Union address to Congress this week.",
    "link": "https://www.hoover.org/research/chen-trump-sticks-his-agenda-face-domestic-global-pushback",
    "timestamp": "2025-03-06T00:00:00Z"
  },
  {
    "title": "D-St reverses its 10-day losing run as worries over tariff ease",
    "description": "The 25% tariffs imposed on Canada and Mexico took effect Tuesday along with fresh levies on Chinese imports. In his address to the US Congress, President Donald Trump said that reciprocal tariffs will take effect from April 2 on countries like India, South Ko…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-st-reverses-its-10-day-losing-run-as-worries-over-tariff-ease/articleshow/118746084.cms",
    "timestamp": "2025-03-05T23:59:20Z"
  },
  {
    "title": "Second judge orders longer-term block on Trump orders on transgender youth health care - NewsBreak",
    "description": "WASHINGTON (AP) -- A second federal judge extended a block Tuesday on President Donald Trump's executive orders halting federal funding for providers of ge",
    "link": "https://www.newsbreak.com/share/3840561562868-second-judge-orders-longer-term-block-on-trump-orders-on-transgender-youth-health-care?_f=app_share&s=a2&share_destination_id=MjA1ODYyNjk2LTE3NDEyMTkxMTM2ODQ%3D&pd=0DvmI404&hl=en_US&send_time=1741219113&actBtn=floatShareButton&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2222.43.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v5%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_blend_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v7%2Cns_foryou_model_exp_25q1-v7%2Cns_foryou_recall_exp_25q1-v5",
    "timestamp": "2025-03-05T23:59:17Z"
  },
  {
    "title": "‘Made me sick’: Lawmakers clash over ‘premediated attack’ with a cane during Trump speech",
    "description": "Texas Rep. Al Green’s public showing of disapproval at President Donald Trump during his address to Congress continued to rumble on Capitol Hill Wednesday as lawmakers argued over the incident that one Republican said appeared to be a “continued, premediated …",
    "link": "https://www.rawstory.com/al-green-2671275975/",
    "timestamp": "2025-03-05T23:57:43Z"
  },
  {
    "title": "Republican Congressman's Startling Sign-Snatching Incident Seen On Camera Reveals An Awful Lot",
    "description": "Rep. Lance Gooden (R-Texas) grabbed a protest sign from the hands of Rep. Melanie Stansbury (D-N.M.) ahead of President Trump's address to Congress in the House chamber. One expert weighs in on the stunning moment.",
    "link": "https://www.huffpost.com/entry/lance-gooden-stansbury-donald-trump-speech-congress_n_67c85fdae4b0efaf8f9fcb3a",
    "timestamp": "2025-03-05T23:56:44Z"
  },
  {
    "title": "Appeals court allows removal of head of watchdog agency as legal battle rages over Trump firing",
    "description": "Hampton Dellinger sued Trump last month after he was fired.",
    "link": "https://www.bostonherald.com/2025/03/05/trump-whistleblower-agency-appeal/",
    "timestamp": "2025-03-05T23:55:57Z"
  },
  {
    "title": "Trump takes a victory lap in fiery address to Congress",
    "description": "The nation is taking stock after President Donald Trump's marathon address to Congress. It was a speech reminiscent of one of his liveliest campaign rallies, full of applause lines for Republicans. But the night also escalated into one of the nastiest partisa…",
    "link": "https://www.pbs.org/newshour/show/trump-takes-a-victory-lap-in-fiery-address-to-congress",
    "timestamp": "2025-03-05T23:55:16Z"
  },
  {
    "title": "Party-line split on reaction to Trump's address",
    "description": "U.S. Sen. Jeanne Shaheen, D-New Hampshire, called President Donald Trump's address Tuesday to Congress disappointing, saying he didn't address Americans' concerns.",
    "link": "https://www.wmur.com/article/shaheen-trump-address-leavitt-3525/64060203",
    "timestamp": "2025-03-05T23:54:09Z"
  },
  {
    "title": "World of Wonder Is Making a Documentary About The Vivienne",
    "description": "The makers of RuPaul’s Drag Race are making a documentary about late Drag Race UK winner The Vivienne. Dear Viv will premiere later this year on WOW Presents Plus.",
    "link": "http://www.vulture.com/article/dear-viv-the-vivienne-doc-release-date-details.html",
    "timestamp": "2025-03-05T23:54:00Z"
  },
  {
    "title": "Incoming CBS Boss Jeff Shell Pressuring Underlings To Settle With Trump, Trample Journalistic Freedom, And Kiss Authoritarian Ass",
    "description": "Last October,Donald Trump sued CBSclaiming (falsely) that a 60 Minutes interview of Kamala Harris had been “deceitfully edited” to her benefit (they simply shortened some of her answers for brevity, as news outlets often do). AsMike explored, the lawsuit tram…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176625335",
    "timestamp": "2025-03-05T23:52:56Z"
  },
  {
    "title": "Melania Made Some New Friends for Trump’s Speech",
    "description": "Melania Trump and Usha Vance sat with a handful of political props, seemingly invited to further Trump’s anti-trans and anti-immigration policies.",
    "link": "http://www.thecut.com/article/melania-trump-guests-congressional-speech.html",
    "timestamp": "2025-03-05T23:52:32Z"
  },
  {
    "title": "Appeals court allows removal of head of watchdog agency as legal battle rages over Trump firing",
    "description": "An appeals court has removed the head of a federal watchdog agency in the latest twist in a legal fight over Republican President Donald Trump’s authority to fire the special counsel",
    "link": "https://abcnews.go.com/US/wireStory/appeals-court-allows-removal-head-watchdog-agency-legal-119492412",
    "timestamp": "2025-03-05T23:50:30Z"
  },
  {
    "title": "Trump's Speech to Congress in 2 Minutes",
    "description": "US President Donald #Trump took the lectern Tuesday for his primetime address to #Congress beset by warning signs about the US #economy, and acknowledged to Americans there could be more discomfort ahead. Bloomberg's Tyler Kendall breaks down what you need to…",
    "link": "https://biztoc.com/x/56881bb0540dff52",
    "timestamp": "2025-03-05T23:50:05Z"
  },
  {
    "title": "Appeals Court Unanimously Allows Trump to Fire Special Counsel",
    "description": "A federal appeals court has ruled to remove the head of a government watchdog agency, marking the latest development in a legal battle over Republican President Donald Trump's authority to fire the special counsel.\nThe U.S. Court of Appeals for the District o…",
    "link": "https://biztoc.com/x/96b1cb2471fbcf52",
    "timestamp": "2025-03-05T23:50:02Z"
  },
  {
    "title": "Trump urges Hamas to release hostages in Gaza in what he calls 'last warning' (Reuters)",
    "description": "Reuters:\nTrump urges Hamas to release hostages in Gaza in what he calls ‘last warning’  —  U.S. President Donald Trump asked Hamas militants to immediately release all hostages held in Gaza in what he called his “last warning” to them while also urging the gr…",
    "link": "https://www.memeorandum.com/250305/p152",
    "timestamp": "2025-03-05T23:50:01Z"
  },
  {
    "title": "Trump delays 25% tariff on vehicle imports from Mexico, Canada (Ken Bredemeier/Voice of America)",
    "description": "Ken Bredemeier / Voice of America:\nTrump delays 25% tariff on vehicle imports from Mexico, Canada  —  U.S. President Donald Trump on Wednesday delayed a new 25% tariff on vehicle imports from Mexico and Canada for a month, amid fears that a trade war between …",
    "link": "https://www.memeorandum.com/250305/p151",
    "timestamp": "2025-03-05T23:50:01Z"
  },
  {
    "title": "The Only Immigrant Democrats Don’t Support: Elon Musk",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post The Only Immigrant Democrats Don’t Support: Elon Musk appeared first on…",
    "link": "https://www.dailysignal.com/2025/03/05/the-only-immigrant-democrats-dont-support-elon-musk/",
    "timestamp": "2025-03-05T23:48:51Z"
  },
  {
    "title": "Father of 13-year-old cancer survivor DJ Daniel — honored by Trump — calls out Rachel Maddow’s ‘bad energy’: ‘She needs to shut her mouth’",
    "description": "Daevarjaye Daniel overcomes the odds of a grim cancer diagnosis, gets embraced by police departments across the country and becomes an honorary Secret Service agent before meeting President Trump.",
    "link": "https://nypost.com/2025/03/05/us-news/father-of-13-year-old-cancer-survivor-calls-out-rachel-maddow/",
    "timestamp": "2025-03-05T23:48:30Z"
  },
  {
    "title": "Trump Issues ‘Last Warning’ For Hamas To Release Hostages Amid Surprise Negotiations With Group: ‘Hell To Pay’",
    "description": "The White House is in direct negotiations with Hamas for the return of all remaining hostages.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/03/05/trump-issues-last-warning-for-hamas-to-release-hostages-amid-surprise-negotiations-with-group-hell-to-pay/",
    "timestamp": "2025-03-05T23:48:08Z"
  },
  {
    "title": "Judge orders longer-term nationwide block on Trump orders on transgender youth health care - NewsBreak",
    "description": "WASHINGTON (AP) — A federal judge extended a nationwide block Tuesday on President Donald Trump’s executive orders halting federal funding for providers of",
    "link": "https://www.newsbreak.com/share/3840517319745-judge-orders-longer-term-nationwide-block-on-trump-orders-on-transgender-youth-health-care?_f=app_share&pd=0EyecoDN&lang=en_US&send_time=1741218405&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.9.1.7%22%2C%22languages%22%3A%22en%22%7D&sep=ns_push_exp_rt_bucketv12-v4%2Cns_local_strategy_25q1_exp-v17%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_blend_exp_25q1-v5&s=i2",
    "timestamp": "2025-03-05T23:47:45Z"
  },
  {
    "title": "Jack Daniel’s maker says Canada pulling US alcohol off shelves ‘worse than tariff’",
    "description": "Several Canadian provinces have taken US liquor off store shelves as part of retaliatory measures against President Donald Trump’s tariffs.",
    "link": "https://thewest.com.au/business/cnbc/jack-daniels-maker-says-canada-pulling-us-alcohol-off-shelves-worse-than-tariff-c-17945100",
    "timestamp": "2025-03-05T23:46:41Z"
  },
  {
    "title": "Jordon Hudson Is Getting Into Fishing Politics",
    "description": "Jordon Hudson, the 24-year-old girlfriend of former Patriots coach Bill Belichick, is wading into fisherman politics.",
    "link": "http://www.thecut.com/article/jordon-hudson-instagram-fisherman-politics.html",
    "timestamp": "2025-03-05T23:46:18Z"
  },
  {
    "title": "Appeals court allows Trump to remove head of federal watchdog agency for now",
    "description": "A federal appeals court is allowing President Donald Trump to remove the head of a government watchdog agency while a legal challenge to his firing plays out. In a brief, unsigned order issued Wednesday afternoon, the DC Circuit Court of Appeals granted a req…",
    "link": "https://freerepublic.com/focus/f-news/4302361/posts",
    "timestamp": "2025-03-05T23:45:26Z"
  },
  {
    "title": "Congress Should Repeal the FACE Act",
    "description": "When Congress enacted the Freedom of Access to Clinic Entrances Act in 1994, the advocates’ sales pitch was that it would address an alleged organized... Read More\nThe post Congress Should Repeal the FACE Act appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/05/congress-should-repeal-the-face-act/",
    "timestamp": "2025-03-05T23:45:24Z"
  },
  {
    "title": "US confirms talks with Hamas as Trump issues 'last warning' on hostage releases",
    "description": "The White House confirms that \"ongoing talks and discussions\" are being held between US and Hamas officials, as Donald Trump issues another warning to the Palestinian militant group.",
    "link": "https://www.abc.net.au/news/2025-03-06/us-confirms-talks-with-hamas/105016482",
    "timestamp": "2025-03-05T23:45:13Z"
  },
  {
    "title": "Fact-checking Trump's address to Congress (CNN)",
    "description": "CNN:\nFact-checking Trump's address to Congress  —  President Donald Trump made numerous false and misleading claims in his Tuesday speech to a joint session of Congress.  The falsehoods spanned a variety of topics, including the economy, climate, immigration …",
    "link": "https://www.memeorandum.com/250305/p145",
    "timestamp": "2025-03-05T23:45:01Z"
  },
  {
    "title": "Elissa Slotkin Didn’t Want Your Speech Advice",
    "description": "The Michigan senator tries to reset the Democratic opposition to Trump.",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/elissa-slotkin-democratic-resistance/681933/",
    "timestamp": "2025-03-05T23:43:53Z"
  },
  {
    "title": "The art of the raw deal: How Zelensky failed to learn how to deal with Trump's ego",
    "description": "US President Donald Trump gives his Ukrainain counterpart Volodymyr Zelensky an ultimatum: 'You’re either going to make a deal, or you’re out.'",
    "link": "https://www.jpost.com/opinion/article-844806",
    "timestamp": "2025-03-05T23:43:15Z"
  },
  {
    "title": "‘Wouldn’t it be amazing?’ U.S. Commerce secretary says Trump working on abolishing income tax payments to IRS",
    "description": "'He's going to do everything he can to make that happen'",
    "link": "https://www.wnd.com/2025/03/wouldnt-it-be-amazing-u-s-commerce-secretary-says-trump-working-on-abolishing-income-tax-payments-to-irs/",
    "timestamp": "2025-03-05T23:42:58Z"
  },
  {
    "title": "Appeals Court Unanimously Allows Trump to Fire Special Counsel",
    "description": "The lower court had ruled that Hampton Dellinger, head of the Office of Special Counsel, was entitled to remain in his position,",
    "link": "https://www.newsweek.com/appeals-court-unanimously-allows-trump-fire-special-counsel-2040320",
    "timestamp": "2025-03-05T23:41:51Z"
  },
  {
    "title": "Oops again. Just received a message from our new merchant services provider. They've temporarily halted credit card activity on our account until we make certain changes. [FReepathon]",
    "description": "Just received a message from our new merchant services provider. They've temporarily halted credit card activity on our account until we make certain changes. They're saying that we have too many 'card testing' attempts. This is the same thing that happened l…",
    "link": "https://freerepublic.com/focus/f-news/4302358/posts",
    "timestamp": "2025-03-05T23:41:00Z"
  },
  {
    "title": "‘Eretz Nehederet’ returns with sharp satire on Trump, Netanyahu, and Zelensky",
    "description": "After a somber break, Eretz Nehederet returns with sharp satire on Trump, Zelensky, and Netanyahu, delivering much-needed laughs to Israeli viewers.",
    "link": "https://www.jpost.com/j-spot/article-844892",
    "timestamp": "2025-03-05T23:40:48Z"
  },
  {
    "title": "Amy Coney Barrett Reaction to Donald Trump Walking By Goes Viral",
    "description": "Several social media users are commenting on Supreme Court Justice Amy Coney Barrett's reaction to President Donald Trump at his joint address to Congress on Tuesday.\nWhy It Matters\nBarrett attended the joint address with Chief Justice John Roberts and Justic…",
    "link": "https://biztoc.com/x/590bd707624d9d23",
    "timestamp": "2025-03-05T23:39:18Z"
  },
  {
    "title": "Consumers elected Trump to fix prices — his policies could do the opposite",
    "description": "Consumers elected Trump to fix prices — his policies could do the opposite\nTrump supporters named inflation as their top concern during the election. His aggressive actions on tariffs and immigration stand to make prices higher.\nFor supporters of President Do…",
    "link": "https://biztoc.com/x/501eba3b75882b79",
    "timestamp": "2025-03-05T23:39:17Z"
  },
  {
    "title": "Trump’s upcoming crypto summit is in focus. Here are catalysts that could refuel bitcoin’s rally",
    "description": "Distributed Ledger\nTrump’s upcoming crypto summit is in focus. Here are catalysts that could refuel bitcoin’s rally.\nWelcome back to Distributed Ledger. This is Frances Yue, crypto reporter at MarketWatch.\nPresident Donald Trump will host his first White Hous…",
    "link": "https://biztoc.com/x/85236f520596b189",
    "timestamp": "2025-03-05T23:39:00Z"
  },
  {
    "title": "USDA ordered to temporarily reinstate thousands of fired employees",
    "description": "The firings of over 5,000 probationary employees at the U.S. Department of Agriculture may have been unlawful, and the workers should be reinstated for at least the next 45 days, a federal civil service board ruled Wednesday.",
    "link": "https://www.nbcnews.com/politics/trump-administration/usda-ordered-temporarily-reinstate-thousands-fired-employees-rcna194992",
    "timestamp": "2025-03-05T23:38:52Z"
  }
]