[
  {
    "title": "Oil rises on modest OPEC+ output hike decision, Russia supply woe",
    "description": "(Reuters) -Oil prices gained on Tuesday after OPEC+ decided to increase production by less than what market participants had anticipated, while concerns over...",
    "link": "https://finance.yahoo.com/news/oil-rises-modest-opec-output-004045755.html",
    "timestamp": "2025-09-09T00:40:45Z"
  },
  {
    "title": "Democrat North Carolina Governor Slammed for Calling for 'More Cops' After NC Stabbing",
    "description": "North Carolina Gov. Josh Stein (D) was criticized for calling for \"more cops\" in response to a stabbing on a train in Charlotte, North Carolina, that left a Ukrainian refugee dead.\nThe post Democrat North Carolina Governor Slammed for Calling for ‘More Cops’ …",
    "link": "https://www.breitbart.com/politics/2025/09/08/democrat-north-carolina-governor-slammed-calling-more-cops-nc-stabbing/",
    "timestamp": "2025-09-09T00:38:15Z"
  },
  {
    "title": "Poll: Gen Z's gender divide reaches beyond politics and into its views on marriage, children and success",
    "description": "The gender gap between men and women has been a durable fact of life in American politics — and nowhere is this gap larger than among the youngest cohort of American adults, Gen Z. But it’s not just politics driving the divide. The latest NBC News Decision De…",
    "link": "https://freerepublic.com/focus/f-chat/4339260/posts",
    "timestamp": "2025-09-09T00:37:48Z"
  },
  {
    "title": "Poll: Gen Z's gender divide reaches beyond politics and into its views on marriage, children and success",
    "description": "The gender gap between men and women has been a durable fact of life in American politics — and nowhere is this gap larger than among the youngest cohort of American adults, Gen Z. But it’s not just politics driving the divide. The latest NBC News Decision De…",
    "link": "https://freerepublic.com/focus/f-news/4339260/posts",
    "timestamp": "2025-09-09T00:37:48Z"
  },
  {
    "title": "Justice Barrett addresses public's 'disconnect' with court ahead of book release",
    "description": "Supreme Court Associate Justice Amy Coney Barrett explains why she wrote her new book and defines the 'disconnect' in how the public perceives the Supreme Court on 'Special Report.'",
    "link": "https://www.foxnews.com/media/justice-barrett-addresses-publics-disconnect-court-ahead-book-release",
    "timestamp": "2025-09-09T00:30:47Z"
  },
  {
    "title": "Indian AI startups run into US visa hurdle",
    "description": "Indian AI startups are increasingly relocating to the US to capitalise on the booming AI sector, but face growing immigration hurdles due to tightened visa rules under the Trump administration.",
    "link": "https://economictimes.indiatimes.com/tech/technology/indian-ai-startups-run-into-us-visa-hurdle/articleshow/123772563.cms",
    "timestamp": "2025-09-09T00:30:00Z"
  },
  {
    "title": "Paul Shaffer Is As Pessimistic About the Future of Late Night As Everyone Else",
    "description": "Shaffer is glad he got out of late night ‘while the getting was good’",
    "link": "https://www.cracked.com/article_48225_paul-shaffer-is-as-pessimistic-about-the-future-of-late-night-as-everyone-else.html",
    "timestamp": "2025-09-09T00:30:00Z"
  },
  {
    "title": "Jessica Tarlov Admits To One Major Biden Mistake",
    "description": "Democratic strategist Jessica Tarlov admitted Biden should have gone through the \"proper\" Department of Justice (DOJ) channels for his last-minute pardons.",
    "link": "https://dailycaller.com/2025/09/08/jessica-tarlov-admits-one-major-mistake-made-by-joe-biden-autopen-pardons/",
    "timestamp": "2025-09-09T00:29:47Z"
  },
  {
    "title": "Creepy Drawing in Epstein Archives Shows Sex Offender Approaching Girls With Balloons Before Being Massaged",
    "description": "A creepy drawing in a book compiled for Jeffrey Epstein's birthday showed the sex offender approaching a group of young girls with balloons.\nThe post Creepy Drawing in Epstein Archives Shows Sex Offender Approaching Girls With Balloons Before Being Massaged f…",
    "link": "https://www.mediaite.com/crime/creepy-drawing-in-epstein-archives-shows-sex-offender-approaching-girls-with-balloons-before-being-massaged/",
    "timestamp": "2025-09-09T00:26:06Z"
  },
  {
    "title": "Trump’s Kennedy Center Is Spectacularly Unpopular",
    "description": "If there’s one thing Donald Trump craves as much as power, it’s crowd size. Unfortunately for him, he’s getting none of the latter from audiences after remaking the Kennedy Center in his image. His D.C. occupation will probably make things worse. Good.\nVia Th…",
    "link": "https://crooksandliars.com/2025/09/trump-s-kennedy-center-spectacularly",
    "timestamp": "2025-09-09T00:23:15Z"
  },
  {
    "title": "Monday, September 8. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,294.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/09/08/monday-september-8-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-09-09T00:22:56Z"
  },
  {
    "title": "Hegseth, top general visit Puerto Rico amid Trump drug cartel fight",
    "description": "Defense Secretary Pete Hegseth and his top general visited Puerto Rico on Monday as the Trump administration targets drug cartels in Latin America and the...",
    "link": "https://www.upi.com/Top_News/US/2025/09/08/defense-Pete-Hegseth-Puerto-Rico-visit/2951757374056/",
    "timestamp": "2025-09-09T00:15:05Z"
  },
  {
    "title": "'Way more difficult': Legal expert warns Trump's WSJ lawsuit just collapsed",
    "description": "President Donald Trump's lawsuit against The Wall Street Journal and Rupert Murdoch for the reporting about his bawdy birthday letter to Jeffrey Epstein will be almost impossible to win now that the alleged image has been produced by House Oversight Committee…",
    "link": "https://www.rawstory.com/trump-lawsuit-2673971831/",
    "timestamp": "2025-09-09T00:15:02Z"
  },
  {
    "title": "Darren Bailey to again run for Illinois governor, source says",
    "description": "Former State Sen. Darren Bailey will again vie for the Republican nomination in Illinois’ gubernatorial election next year.",
    "link": "https://www.nbcchicago.com/news/local/chicago-politics/darren-bailey-to-seek-republican-gubernatorial-nomination-source/3821307/",
    "timestamp": "2025-09-09T00:14:43Z"
  },
  {
    "title": "Dershowitz Skeptical of Trump’s Wall Street Journal Suit: ‘I Don’t Think This Lawsuit Is Going Anywhere’",
    "description": "Alan Dershowitz doesn't think much of President Donald Trump's lawsuit against The Wall Street Journal.\nThe post Dershowitz Skeptical of Trump’s Wall Street Journal Suit: ‘I Don’t Think This Lawsuit Is Going Anywhere’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/dershowitz-skeptical-of-trumps-wall-street-journal-suit-i-dont-think-this-lawsuit-is-going-anywhere/",
    "timestamp": "2025-09-09T00:11:51Z"
  },
  {
    "title": "‘SNL’ Season 51: Premiere date, bloodbath cast shakeups and more",
    "description": "Five new faces are gearing up for their moment.",
    "link": "https://nypost.com/2025/09/08/entertainment/snl-season-51-premiere-date-bloodbath-cast-shakeups-and-more/",
    "timestamp": "2025-09-09T00:10:21Z"
  },
  {
    "title": "The Epstein Letter Is Real, and It's Bad (Jonathan Chait/The Atlantic)",
    "description": "Jonathan Chait / The Atlantic:\nThe Epstein Letter Is Real, and It's Bad  —  The president's initial strategy of denying that the document exists leaves him with few options now that it has been made public.  —  When The Wall Street Journal reported two months…",
    "link": "https://www.memeorandum.com/250908/p145",
    "timestamp": "2025-09-09T00:10:01Z"
  },
  {
    "title": "Jury Selection Begins in Trial of Trump Plot Defendant",
    "description": "Jury selection began Monday in the federal trial of Ryan Routh, who is accused of attempting to assassinate Donald Trump at a Florida golf course in September 2024—a day in court that included an apology to the pool from the defendant for the inconvenience. R…",
    "link": "https://www.newser.com/story/374857/jury-selection-begins-in-trial-of-trump-plot-defendant.html",
    "timestamp": "2025-09-09T00:10:00Z"
  },
  {
    "title": "Mumbling Zohran Mamdani serves up word salad instead of straight answers to pressing NYC issues in recent spate of interviews",
    "description": "Zohran Mamdani dodged straightforward questions on pressing issues facing the Big Apple — capping off days of politician speak that insiders argued showed the candidate's shine is wearing off.",
    "link": "https://nypost.com/2025/09/08/us-news/mumbling-zohran-mamdani-serves-up-word-salad-instead-of-straight-answers-to-pressing-nyc-issues-in-recent-spate-of-interviews/",
    "timestamp": "2025-09-09T00:09:44Z"
  },
  {
    "title": "'Resign!' Extremist MAGA ally melts down at Pam Bondi and 'DOJ full of morons'",
    "description": "A far-right activist and conspiracy theorist renewed her war on President Donald Trump's hand-picked attorney general Monday evening, melting down that a staffer remains in the Justice Department despite being married to a former voting official who hasn't pu…",
    "link": "https://www.rawstory.com/pam-bondi-2673971950/",
    "timestamp": "2025-09-09T00:05:02Z"
  },
  {
    "title": "EXCLUSIVE: Mystery Behind Donald Trump 'Dead' and 'Fake' Claims — How Prez is Being Accused of 'Doing a Putin' by 'Using AI and Body Doubles to Cover up Deadly Illnesses'",
    "description": "President Donald Trump has been accused of using AI and body doubles to \"hide illnesses\" after rumors exploded he \"was dead.\"",
    "link": "https://radaronline.com/p/donald-trump-dead-fake-ai-body-doubles-illness-coverup/",
    "timestamp": "2025-09-09T00:04:51Z"
  },
  {
    "title": "Trump says Democrats have ‘blood on their hands’ after deadly Charlotte train stabbing",
    "description": "President Trump linkws the random stabbing death of a Ukrainian refugee, Iryna Zarutska, in Charlotte to upcoming North Carolina senate race between Roy Cooper and Michael Whatley.",
    "link": "https://www.foxnews.com/politics/trump-says-democrats-have-blood-hands-after-deadly-charlotte-train-stabbing",
    "timestamp": "2025-09-09T00:02:42Z"
  },
  {
    "title": "Yasmin Williams Shares Statement on Decision to Perform at Trump-Led Kennedy Center",
    "description": "In April, the composer and guitarist posted screenshots of a heated email exchange with Kennedy Center president Richard Grenell",
    "link": "https://pitchfork.com/news/yasmin-williams-shares-statement-on-decision-to-perform-at-trump-led-kennedy-center/",
    "timestamp": "2025-09-09T00:01:15Z"
  },
  {
    "title": "“He is so Jealous”: Martina Navratilova accuses Donald Trump of snubbing Carlos Alcaraz’s US Open victory celebration",
    "description": "Carlos Alcaraz secured his second US Open title in 2025, defeating Jannik Sinner in four sets and reclaiming the world No. 1 ranking. The victory was marked by former President Trump's attendance and apparent lack of applause, drawing criticism from Martina N…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/he-is-so-jealous-martina-navratilova-accuses-donald-trump-of-snubbing-carlos-alcarazs-us-open-victory-celebration/articleshow/123775797.cms",
    "timestamp": "2025-09-09T00:00:50Z"
  },
  {
    "title": "Putin adviser accuses US of planning stablecoin scheme to eliminate $35 trillion debt",
    "description": "Russian President Vladimir Putin’s adviser, Dmitry Kobyakov, accused the US of orchestrating a crypto strategy to eliminate its $35 trillion national debt through the manipulation of stablecoins. During his speech at the Eastern Economic Forum on Sept. 6, Kob…",
    "link": "https://cryptoslate.com/putin-adviser-accuses-us-of-planning-stablecoin-scheme-to-eliminate-35-trillion-debt/",
    "timestamp": "2025-09-09T00:00:19Z"
  },
  {
    "title": "All Elements in Place for a US Decapitation Strike on Venezuela",
    "description": "President Donald Trump euphorically concluded his White House press conference on September 2 with breaking news: the US military had just blown up a small motor vessel in the middle of the Caribbean Sea. He alleged that the skiff came from Venezuela and was …",
    "link": "https://original.antiwar.com/roger_harris/2025/09/08/all-elements-in-place-for-a-us-decapitation-strike-on-venezuela/",
    "timestamp": "2025-09-09T00:00:12Z"
  },
  {
    "title": "Florida Declares Victory for Liberty and Parental Rights — Ends School Vaccine Mandates!",
    "description": "Florida has made a bold move that many will hail as a massive win for personal autonomy and parental sovereignty. On September 3, 2025, the state’s Surgeon General Dr. Joseph Ladapo, joined by Governor Ron DeSantis, unveiled a sweeping decision: Florida will …",
    "link": "https://articles.mercola.com/sites/articles/archive/2025/09/09/florida-ends-school-vaccine-mandates.aspx",
    "timestamp": "2025-09-09T00:00:00Z"
  },
  {
    "title": "The Saudi Choice And Trump’s Realism",
    "description": "Donald Trump chose to visit Saudi Arabia first in both his administrations, in May 2017 and May 2025. This choice sends a clear signal about his foreign policy vision and his priorities, and the matter deserves a close examination.",
    "link": "https://www.hoover.org/research/saudi-choice-and-trumps-realism",
    "timestamp": "2025-09-09T00:00:00Z"
  },
  {
    "title": "Why Trump Went To Riyadh And What He Achieved",
    "description": "Donald Trump made the first foreign visit of his second term to Saudi Arabia. He had sound reasons for doing so. Saudi Arabia remains an important and stable leader in an important, but very unstable part of the world. Whether you want to secure moderate oil …",
    "link": "https://www.hoover.org/research/why-trump-went-riyadh-and-what-he-achieved",
    "timestamp": "2025-09-09T00:00:00Z"
  },
  {
    "title": "The Education Exchange: Peeling Back The Curtain On The “Science” Funded By NSF",
    "description": "Heather Mac Donald, the Thomas W. Smith Fellow at the Manhattan Institute, joins Hoover Institution fellow Paul E. Peterson to discuss Mac Donald's recent article, which is critical of the changes the Trump Administration has made with the National Science Fo…",
    "link": "https://www.hoover.org/research/education-exchange-peeling-back-curtain-science-funded-nsf",
    "timestamp": "2025-09-09T00:00:00Z"
  },
  {
    "title": "Trump comments on knife murder of Ukrainian woman",
    "description": "President Donald Trump has condemned the fatal stabbing of a 23-year-old Ukrainian woman on a train in Charlotte, North Carolina Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624310-trump-ukrainian-woman-stabbing/",
    "timestamp": "2025-09-08T23:58:46Z"
  },
  {
    "title": "The American Dream Is Dying. HUD Secretary Scott Turner Aims to Revive It.",
    "description": "This is a preview of this week’s episode of “The Signal Sitdown.” Don’t miss politics editor Bradley Devlin’s interview with Housing and Urban Development Secretary... Read More\nThe post The American Dream Is Dying. HUD Secretary Scott Turner Aims to Revive I…",
    "link": "https://www.dailysignal.com/2025/09/08/the-american-dream-is-dying-hud-secretary-scott-turner-aims-to-revive-it/",
    "timestamp": "2025-09-08T23:58:33Z"
  },
  {
    "title": "Don Jr.'s $1 billion venture firm raises new concerns about Trump's conflicts of interest",
    "description": "Donald Trump Jr. at Teterboro Airport in Teterboro, N.J., en route to attend the Club World Cup final soccer match on July 13, 2025.",
    "link": "https://biztoc.com/x/0b37c9bcc3d8329c",
    "timestamp": "2025-09-08T23:55:19Z"
  },
  {
    "title": "'Ew!' Internet aghast at 'disgusting' photo of Epstein's 'inside joke' with Trump",
    "description": "The internet erupted on Monday after a photo was published showing disgraced financier Jeffrey Epstein jokingly selling a \"fully depreciated\" woman to Donald Trump for $22,500. The Wall Street Journal published the photo, which was taken at Trump's Mar-a-Lago…",
    "link": "https://www.rawstory.com/trump-epstein-2673971943/",
    "timestamp": "2025-09-08T23:55:11Z"
  },
  {
    "title": "Bill Clinton letter in Epstein 'birthday book' among new files released by House Oversight Committee",
    "description": "The House Oversight Committee has released a tranche of files related to Jeffrey Epstein on Monday evening.",
    "link": "https://www.foxnews.com/politics/bill-clinton-letter-epstein-birthday-book-among-new-files-released-house-oversight-committee",
    "timestamp": "2025-09-08T23:52:38Z"
  },
  {
    "title": "The Smug Silence Of The Supreme Court’s Rulings For Trump",
    "description": "The court’s conservatives continue to authorize Donald Trump’s law-breaking without saying a word.",
    "link": "https://www.huffpost.com/entry/supreme-court-donald-trump_n_68bf5e6ee4b0333d06bcdfd7",
    "timestamp": "2025-09-08T23:48:11Z"
  },
  {
    "title": "Intel reshuffles its executive leadership team as its former co-CEO departs",
    "description": "Intel Corp. Chief Executive Lip-Bu Tan has made sweeping changes to his executive leadership team, waving goodbye to former co-CEO Executive Michelle Johnston Holthaus and announcing a series of new appointments. The changes come as Tan intensifies his effort…",
    "link": "https://siliconangle.com/2025/09/08/intel-reshuffles-executive-leadership-team-former-co-ceo-departs/",
    "timestamp": "2025-09-08T23:45:07Z"
  },
  {
    "title": "Lawyer Who Helped Trump Try To Overturn Election Says He May Use ‘Emergency Powers’ To Take Control of Elections",
    "description": "A lawyer who helped President Donald Trump try to overturn the 2020 election claimed the president can \"exercise some emergency powers\" to wield authority over elections.\nThe post Lawyer Who Helped Trump Try To Overturn Election Says He May Use ‘Emergency Pow…",
    "link": "https://www.mediaite.com/media/tv/lawyer-who-helped-trump-try-to-overturn-election-says-he-may-use-emergency-powers-to-take-control-of-elections/",
    "timestamp": "2025-09-08T23:41:59Z"
  },
  {
    "title": "Biden’s autopen scandal is nothing short of a coup — and the culprits needs to be held accountable",
    "description": "President Joe Biden commuted the sentences of more than 4,000 federally incarcerated offenders. Only it wasn’t Biden issuing the record-shattering number of commutations — it was his autopen.",
    "link": "https://nypost.com/2025/09/08/opinion/bidens-autopen-scandal-is-nothing-short-of-a-coup-and-the-culprits-needs-to-be-held-accountable/",
    "timestamp": "2025-09-08T23:40:57Z"
  },
  {
    "title": "Mark Hamill Says He’s ‘Really Ashamed’ America Voted for Trump Twice, the 2nd Administration Is ‘On Us’",
    "description": "\"I’m in the minority in my own country,\" the \"Star Wars\" icon laments\nThe post Mark Hamill Says He’s ‘Really Ashamed’ America Voted for Trump Twice, the 2nd Administration Is ‘On Us’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/mark-hamill-trump-ashamed-wtf-with-marc-maron/",
    "timestamp": "2025-09-08T23:39:39Z"
  },
  {
    "title": "Gen Z male Trump voters want children and financial independence—women Kamala voters rank money, career at top of wish list: NBC poll",
    "description": "A recent poll has found that Gen Z men who voted for Donald Trump are likely to say that having children is the most important thing for their success while Gen Z women who voted for former Vice President Kamala Harris ranked having kids second from the botto…",
    "link": "https://freerepublic.com/focus/f-chat/4339251/posts",
    "timestamp": "2025-09-08T23:38:28Z"
  },
  {
    "title": "Don Jr.'s $1 billion venture firm raises new concerns about Trump's conflicts of interest",
    "description": "A Reuters report reveals how a venture fund which Donald Trump Jr. joined as a partner raises new conflict of interest questions.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/donald-trump-jr-1789-capital-conflict-of-interest-corrupt-rcna229903",
    "timestamp": "2025-09-08T23:37:13Z"
  },
  {
    "title": "White House Trolls Stephen Colbert And Bruce Springsteen For 1 Seriously Weird Reason",
    "description": "President Donald Trump’s social media team was really grasping at straws with their latest “diss.”",
    "link": "https://www.huffpost.com/entry/white-house-trolls-stephen-colbert-and-bruce-springsteen-for-1-seriously-weird-reason_n_68bf39a8e4b0333d06bcc8ef",
    "timestamp": "2025-09-08T23:37:00Z"
  },
  {
    "title": "Zohran Mamdani ramps up suburbanite donations on Long Island — but still trails rivals’ fundraising",
    "description": "Big Apple mayoral hopeful Zohran Mamdani has raked in nearly $200,000 from donors on Long Island since his Democratic Party primary win.",
    "link": "https://nypost.com/2025/09/08/us-news/zohran-mamdani-ramps-up-suburbanite-donations-on-long-island-but-still-trails-rivals-fundraising/",
    "timestamp": "2025-09-08T23:35:58Z"
  },
  {
    "title": "Trump-backed Nippon Steel deal protects 800 US Steel jobs for now",
    "description": "US Steel will pause operations at its Granite City mill in Illinois, but 800 jobs are safe until 2027 under a Trump-backed Nippon Steel deal",
    "link": "https://www.wlwt.com/article/us-steel-granite-city-shutting-down-jobs-nippon-deal/66014691",
    "timestamp": "2025-09-08T23:35:18Z"
  },
  {
    "title": "Trump-backed Nippon Steel deal protects 800 US Steel jobs for now",
    "description": "US Steel will pause operations at its Granite City mill in Illinois, but 800 jobs are safe until 2027 under a Trump-backed Nippon Steel deal",
    "link": "https://www.wmur.com/article/us-steel-granite-city-shutting-down-jobs-nippon-deal/66014691",
    "timestamp": "2025-09-08T23:35:12Z"
  },
  {
    "title": "Who Has Called for Health Secretary Kennedy Jr. to Resign? See the List - NewsBreak",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. sparred with several senators on both sides of the aisle during a committee testimony.",
    "link": "https://www.newsbreak.com/share/4219853671755-who-has-called-for-health-secretary-kennedy-jr-to-resign-see-the-list?_f=app_share&amp;pd=00UhHWCu&amp;lang=en_US&amp;send_time=1757374305&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.36.0.14%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_ios_comment_share_v2-v1&amp;s=i2",
    "timestamp": "2025-09-08T23:33:07Z"
  },
  {
    "title": "Paul digs in against Vance as other Republicans stay quiet on Venezuela",
    "description": "The News\nCongressional Republicans are steering clear of President Donald Trump’s strike on a vessel allegedly carrying drugs off the coast of Venezuela — all of them except Rand Paul.\nThe Kentucky senator is loudly questioning the Trump administration’s deci…",
    "link": "https://biztoc.com/x/06b586e631893b38",
    "timestamp": "2025-09-08T23:32:49Z"
  },
  {
    "title": "Mar-a-Lago Member Reportedly Made Crude Gag About Epstein Selling Trump a Woman for $22,500",
    "description": "A Mar-a-Lago member reportedly joked about the late sex offender Jeffrey Epstein selling Trump a \"fully depreciated\" woman for $22,500 in 2003.\nThe post Mar-a-Lago Member Reportedly Made Crude Gag About Epstein Selling Trump a Woman for $22,500 first appeared…",
    "link": "https://www.mediaite.com/politics/mar-a-lago-member-reportedly-made-crude-gag-about-epstein-selling-trump-a-woman-for-22500/",
    "timestamp": "2025-09-08T23:22:27Z"
  },
  {
    "title": "Trump ends media censorship cooperation with EU – FT",
    "description": "The United States has withdrawn from a series of international agreements aimed at countering alleged foreign “disinformation” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624309-us-terminates-eu-censorship-agreements/",
    "timestamp": "2025-09-08T23:22:05Z"
  },
  {
    "title": "Immigrants in Southern California go on high alert after Supreme Court ruling",
    "description": "LOS ANGELES — Anger and frustration rippled through Southern California's immigrant rights community on Monday, after the U.S.",
    "link": "https://www.nbcnews.com/news/us-news/immigrants-southern-california-go-high-alert-supreme-court-ruling-rcna229920",
    "timestamp": "2025-09-08T23:20:25Z"
  },
  {
    "title": "Beacon Hill’s three most powerful Democrats slam Trump from immigration surge in Mass.",
    "description": "Top Beacon Hill Democrats criticized President Donald Trump’s administration Monday for renewing a surge of immigration arrests in Boston over the weekend, with Gov. Maura Healey calling the actions “political theater” and “attempts to distract from Trump’s f…",
    "link": "https://www.bostonherald.com/2025/09/08/beacon-hills-three-most-powerful-democrats-slam-trump-from-immigration-surge-in-mass/",
    "timestamp": "2025-09-08T23:16:41Z"
  },
  {
    "title": "Bombshell new photo shows Epstein jokingly selling ‘fully depreciated’ woman to Trump",
    "description": "Democrats on the House Oversight Committee released a photo on Monday showing disgraced financier and accused sex trafficker Jeffrey Epstein jokingly selling a \"fully depreciated\" to Trump at his Mar-a-Lago estate in Florida.The redacted photo was released af…",
    "link": "https://www.rawstory.com/trump-epstein-2673971889/",
    "timestamp": "2025-09-08T23:16:26Z"
  },
  {
    "title": "Underreported Story of Trans Offender Threatening to Victimize Girls, Shoot Schools, Raises Unsettling Terror Questions",
    "description": "What if I told you a man who identifies as a “transgender woman” threatened to victimize girls in girls’ bathrooms, shoot up schools, and bomb... Read More\nThe post Underreported Story of Trans Offender Threatening to Victimize Girls, Shoot Schools, Raises Un…",
    "link": "https://www.dailysignal.com/2025/09/08/trans-threats-victimize-girls-shoot-schools-highlight-need-combat-transgender-terrorism/",
    "timestamp": "2025-09-08T23:10:00Z"
  },
  {
    "title": "“This is not a hoax”: Epstein birthday book note allegedly from Trump shared by House Dems",
    "description": "The release comes after Trump called the drawing a \"fake thing.\"",
    "link": "https://www.salon.com/2025/09/08/this-is-not-a-hoax-epstein-birthday-book-note-allegedly-from-trump-shared-by-house-dems/",
    "timestamp": "2025-09-08T23:09:07Z"
  },
  {
    "title": "Hawaii man accused of trying to kill Trump prepares to defend himself | Honolulu Star-Advertiser",
    "description": "FORT PIERCE, Florida >> The man accused of attempting to kill President Donald Trump last year at his Florida golf course began his trial today and, facing the prospect of life in prison, opted to fire his legal team and defend himself in court.",
    "link": "https://www.staradvertiser.com/2025/09/08/breaking-news/hawaii-man-accused-of-trying-to-kill-trump-prepares-to-defend-himself/",
    "timestamp": "2025-09-08T23:08:18Z"
  },
  {
    "title": "Wisconsin flood recovery; FEMA reviews damage, disaster aid hinges on Trump",
    "description": "Federal officials are back in Wisconsin reviewing flood damage, a step that could unlock additional disaster funding for cities and counties hit by historic flooding last month.",
    "link": "https://www.fox6now.com/news/wisconsin-flood-recovery-fema-reviews-damage-disaster-aid-hinges-trump",
    "timestamp": "2025-09-08T23:08:14Z"
  },
  {
    "title": "Dems stage 100-hour sit-in to protest GOP's new election rigging scheme",
    "description": "Three Democrats in the Missouri House of Representatives spent over 100 hours in the chamber protesting Republican efforts to rig the state's congressional map for US President Donald Trump and attack ballot initiatives during a legislative special session.Re…",
    "link": "https://www.rawstory.com/missouri-election/",
    "timestamp": "2025-09-08T23:07:57Z"
  },
  {
    "title": "Donald Trump’s War of Words",
    "description": "Violent language is the mother tongue of this Trump administration.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/09/donald-trumps-war-of-words/684139/",
    "timestamp": "2025-09-08T23:06:00Z"
  },
  {
    "title": "Study: Firms say biggest compliance risk is US data rules",
    "description": "More than one in three Irish financial organisations, or 36%, say the softening of US data privacy and cybersecurity rules represents the greatest compliance risk to their business, according to a survey from the Compliance Institute.",
    "link": "https://www.rte.ie/news/ireland/2025/0909/1532492-compliance-institute-survey/",
    "timestamp": "2025-09-08T23:05:25Z"
  },
  {
    "title": "Netanyahu threatens Gaza residents as UN slams Israel over ‘mass killing’",
    "description": "Gaza City residents told to 'leave now', while UN human rights chief condemns Israel for 'war crime upon war crime'.",
    "link": "https://www.aljazeera.com/news/2025/9/8/netanyahu-threatens-gaza-residents-as-un-slams-israel-over-mass",
    "timestamp": "2025-09-08T23:04:19Z"
  },
  {
    "title": "Hakeem Jeffries Picks Eric Swalwell to Lead New J6 Committee",
    "description": "Oh, it gets better, you guys.\nThe post Hakeem Jeffries Picks Eric Swalwell to Lead New J6 Committee first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/hakeem-jeffries-picks-eric-swalwell-to-lead-new-j6-committee/",
    "timestamp": "2025-09-08T23:00:54Z"
  },
  {
    "title": "White House Denies Signature on Trump's Letter to Epstein Is Real (Amelia Benavides-Colón/NOTUS)",
    "description": "Amelia Benavides-Colón / NOTUS:\nWhite House Denies Signature on Trump's Letter to Epstein Is Real  —  The White House is denying the authenticity of a newly released letter that President Donald Trump reportedly sent to Jeffrey Epstein for his 50th birthday, …",
    "link": "https://www.memeorandum.com/250908/p139",
    "timestamp": "2025-09-08T23:00:27Z"
  },
  {
    "title": "James Altucher Speaks on What He Believes to Be Trump and Musk’s “AI Mothership” Plan",
    "description": "His presentation reveals how Trump’s policy reversal and Elon Musk’s Memphis “AI Mothership” could mark the rise of artificial superintelligence. His presentation reveals how Trump’s policy reversal and Elon Musk’s Memphis “AI Mothership” could mark the rise …",
    "link": "https://www.globenewswire.com/news-release/2025/09/08/3146536/0/en/James-Altucher-Speaks-on-What-He-Believes-to-Be-Trump-and-Musk-s-AI-Mothership-Plan.html",
    "timestamp": "2025-09-08T23:00:00Z"
  },
  {
    "title": "News Wrap: Democrats release birthday message Trump allegedly sent to Jeffrey Epstein",
    "description": "In our news wrap Monday, House Democrats released a letter that Donald Trump allegedly sent to Jeffrey Epstein for a 2003 birthday book, the Trump administration is asking the Supreme Court to keep nearly five billion dollars in foreign aid frozen and a feder…",
    "link": "https://biztoc.com/x/1876f7a7fb763bbe",
    "timestamp": "2025-09-08T22:58:48Z"
  },
  {
    "title": "America Prays — PRAYER & REDEDICATION — ONE NATION UNDER GOD — 250TH BIRTHDAY OF OUR COUNTRY (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nAmerica Prays  —  PRAYER & REDEDICATION  —  ONE NATION UNDER GOD  —  250TH BIRTHDAY OF OUR COUNTRY  —  “As we prepare to celebrate two and a half centuries of freedom, I am inviting America's great religious commun…",
    "link": "https://www.memeorandum.com/250908/p138",
    "timestamp": "2025-09-08T22:55:02Z"
  },
  {
    "title": "Congress Mulls Lifting Sanctions on Syrian Leader",
    "description": "Congress is weighing whether to lift sanctions on Syrian President Ahmed al-Sharaa, a former jihadist seeking to legitimize himself on the world stage. Rep. Josh... Read More\nThe post Congress Mulls Lifting Sanctions on Syrian Leader appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/09/08/congress-could-lift-sanctions-syrian-leader/",
    "timestamp": "2025-09-08T22:55:00Z"
  },
  {
    "title": "Late-night host Kimmel weighs in on whether his anti-Trump jokes defend 'democracy'",
    "description": "After winning an Emmy for his stint hosting \"Who Wants To Be A Millionaire,\" late-night host Jimmy Kimmel reflected on his anti-Trump comedy approach.",
    "link": "https://www.foxnews.com/media/late-night-host-kimmel-weighs-whether-anti-trump-jokes-defend-democracy",
    "timestamp": "2025-09-08T22:53:40Z"
  },
  {
    "title": "Trump’s presidency is a cash grab",
    "description": "According to Donald Trump, the 45th and 47th president is a very generous man. “I am proud to be the only President (with the possible exception of the Late, Great George Washington) to donate my Salary,” he said in a Truth Social post. “My first ‘Paycheck’ w…",
    "link": "https://www.vox.com/politics/460757/trump-crypto-presidency-profits-corruption",
    "timestamp": "2025-09-08T22:51:33Z"
  },
  {
    "title": "Murdoch Family Settles Dispute On Control Of Media Assets",
    "description": "Rupert Murdoch's children have reached a settlement in the legal dispute over control of the right-wing media mogul's companies, News Corp and Fox Corp announced Monday.",
    "link": "https://www.ibtimes.com/murdoch-family-settles-dispute-control-media-assets-3782836",
    "timestamp": "2025-09-08T22:51:07Z"
  },
  {
    "title": "News Wrap: Democrats release birthday message Trump allegedly sent to Jeffrey Epstein",
    "description": "In our news wrap Monday, House Democrats released a letter that Donald Trump allegedly sent to Jeffrey Epstein for a 2003 birthday book, the Trump administration is asking the Supreme Court to keep nearly five billion dollars in foreign aid frozen and a feder…",
    "link": "https://www.pbs.org/newshour/show/news-wrap-democrats-release-birthday-message-trump-allegedly-sent-to-jeffrey-epstein",
    "timestamp": "2025-09-08T22:50:51Z"
  },
  {
    "title": "Donald Trump Reproaches Tim Kaine for Attacking American Belief That Rights Are God-Given",
    "description": "President Donald Trump ripped Sen. Tim Kaine (D-VA) on Monday for stating last week that the concept that rights are given by a creator – a foundational American belief – is “extremely troubling.” During a Senate Foreign Relations Committee hearing last Wedne…",
    "link": "https://freerepublic.com/focus/f-news/4339242/posts",
    "timestamp": "2025-09-08T22:50:00Z"
  },
  {
    "title": "Donald Trump Reproaches Tim Kaine for Attacking American Belief That Rights Are God-Given",
    "description": "President Donald Trump ripped Sen. Tim Kaine (D-VA) on Monday for stating last week that the concept that rights are given by a creator – a foundational American belief – is “extremely troubling.” During a Senate Foreign Relations Committee hearing last Wedne…",
    "link": "https://freerepublic.com/focus/f-bloggers/4339242/posts",
    "timestamp": "2025-09-08T22:50:00Z"
  },
  {
    "title": "Attorney says detained Korean Hyundai workers had special skills for short-term jobs",
    "description": "An immigration attorney says many South Korean workers detained in a U.S. immigration raid at a Hyundai plant in Georgia were brought in for highly specialized work that Americans aren't trained to perform.",
    "link": "https://www.pbs.org/newshour/nation/attorney-says-detained-korean-hyundai-workers-had-special-skills-for-short-term-jobs",
    "timestamp": "2025-09-08T22:47:38Z"
  },
  {
    "title": "Murdoch family settles dispute on control of media assets",
    "description": "Rupert Murdoch’s children have reached a settlement in the legal dispute over control of the right-wing media mogul’s companies, News Corp and Fox Corp announced Monday. The agreement resolves litigation after siblings had contested Murdoch’s effort to instal…",
    "link": "https://www.digitaljournal.com/world/murdoch-family-settles-dispute-on-control-of-media-assets/article",
    "timestamp": "2025-09-08T22:47:33Z"
  },
  {
    "title": "US upends its role as the high-seas drug police with a military strike on Venezuelan boat",
    "description": "One professor said “extrajudicial killing” would be a better term to describe the strike.",
    "link": "https://www.bostonherald.com/2025/09/08/trump-venezuela-new-strategy/",
    "timestamp": "2025-09-08T22:45:18Z"
  },
  {
    "title": "US upends its role as the high-seas drug police with a military strike on Venezuelan boat",
    "description": "One professor said “extrajudicial killing” would be a better term to describe the strike.",
    "link": "https://www.denverpost.com/2025/09/08/trump-venezuela-new-strategy/",
    "timestamp": "2025-09-08T22:45:18Z"
  },
  {
    "title": "'Man has a little fight with the wife': Trump downplays domestic violence at Bible event (David Edwards/Raw Story)",
    "description": "David Edwards / Raw Story:\n‘Man has a little fight with the wife’: Trump downplays domestic violence at Bible event  —  President Donald Trump suggested domestic violence should not be counted as a crime because the statistics got in the way of his claims of …",
    "link": "https://www.memeorandum.com/250908/p136",
    "timestamp": "2025-09-08T22:45:00Z"
  },
  {
    "title": "‘Handwriting Analyst’ Trump’s alleged signature in Epstein birthday letter faces online forensics; here’s how X posts are picking apart every stroke",
    "description": "A purported birthday note to Jeffrey Epstein, allegedly signed by Donald Trump, has ignited controversy after House Democrats released a screenshot. The note, previously denied by Trump, features a cryptic exchange and a sketch, prompting questions about its …",
    "link": "https://economictimes.indiatimes.com/news/international/us/handwriting-analyst-trumps-alleged-signature-in-epstein-birthday-letter-faces-online-forensics-heres-how-x-posts-are-picking-apart-every-stroke/articleshow/123774036.cms",
    "timestamp": "2025-09-08T22:42:08Z"
  },
  {
    "title": "Of Course Trump Is Downplaying Domestic Violence",
    "description": "President Trump complained during a speech on Monday that he can’t claim crime has been completely eradicated in Washington, D.C., because local statistics continue to include domestic-violence cases.",
    "link": "http://www.thecut.com/article/trump-comments-on-domestic-violence-are-chilling.html",
    "timestamp": "2025-09-08T22:41:48Z"
  },
  {
    "title": "Obama Judge Who Blocked Planned Parenthood Defunding Takes Aim at Laken Riley Act",
    "description": "A Barack Obama-appointed judge delivered a blow to the Laken Riley Act, a law that passed with bipartisan support and that prioritizes the arrest of... Read More\nThe post Obama Judge Who Blocked Planned Parenthood Defunding Takes Aim at Laken Riley Act appear…",
    "link": "https://www.dailysignal.com/2025/09/08/obama-judge-who-blocked-planned-parenthood-defunding-takes-aim-laken-riley-act/",
    "timestamp": "2025-09-08T22:40:00Z"
  },
  {
    "title": "Bret Baier Asks Amy Coney Barrett if Presidential Term Limits Are ‘Cut and Dry’ After Trump Floats Running Again",
    "description": "As President Donald Trump has repeatedly suggested he will attempt to run for a third term, Fox's Bret Baier asked Justice Amy Coney Barrett about the (un)constitutionality of such a prospect. \nThe post Bret Baier Asks Amy Coney Barrett if Presidential Term L…",
    "link": "https://www.mediaite.com/media/tv/bret-baier-asks-amy-coney-barrett-if-presidential-term-limits-are-cut-and-dry-after-trump-floats-running-again/",
    "timestamp": "2025-09-08T22:39:32Z"
  },
  {
    "title": "Alleged Epstein birthday note released - and it doesn't look great for Donald Trump",
    "description": "A letter allegedly sent to sex offender Jeffrey Epstein, bearing Donald Trump's name and allegedly his signature, includes the text: \"A pal is a wonderful thing. Happy Birthday - and may every day be another wonderful secret.\"",
    "link": "https://news.sky.com/story/alleged-epstein-birthday-note-released-and-it-doesnt-look-great-for-donald-trump-13427376",
    "timestamp": "2025-09-08T22:39:00Z"
  },
  {
    "title": "Attorney says detained Korean Hyundai workers had special skills for short-term jobs",
    "description": "He said no company in the U.S. makes the machines that are used in the Georgia plant, so workers had to come from abroad to install or repair equipment.",
    "link": "https://www.politico.com/news/2025/09/08/attorney-says-detained-korean-hyundai-workers-had-special-skills-for-short-term-jobs-00551265",
    "timestamp": "2025-09-08T22:36:20Z"
  },
  {
    "title": "Trump’s Epstein letter denial just suffered another huge blow",
    "description": "Among the many weird things President Donald Trump and his administration have said and done vis-à-vis Jeffrey Epstein in recent weeks is Trump’s curious denial of writing the disgraced financier a lewd birthday letter two decades ago.",
    "link": "https://www.cnn.com/2025/09/08/politics/trump-epstein-letter-signature",
    "timestamp": "2025-09-08T22:36:08Z"
  },
  {
    "title": "Chicago launches social media campaign as Trump’s ‘Chipocalypse Now’ post stokes tensions",
    "description": "In the wake of President Donald Trump seeming to declare war on Chicago in a social media post evoking the movie “Apocalypse Now,” the city is fighting back with its own campaign advocating civic love, not war.\nOn Thursday — two days before Trump’s “Chipocaly…",
    "link": "https://biztoc.com/x/e7206def0b22659a",
    "timestamp": "2025-09-08T22:35:55Z"
  },
  {
    "title": "Oakland Officials Are Preparing for Trump’s Possible National Guard Deployment",
    "description": "Oakland Mayor Barbara Lee said on KQED’s Forum that the city is working with Alameda County and California’s attorney general on a plan.",
    "link": "https://www.kqed.org/news/12055131/oakland-officials-are-preparing-for-trumps-possible-national-guard-deployment",
    "timestamp": "2025-09-08T22:30:19Z"
  },
  {
    "title": "'Go find her': Right-wing TV host delivers chilling call to target judge",
    "description": "Right-wing media has exploded over the brazen killing of Ukrainian refugee Iryna Zarutska, who was stabbed to death on a train in Charlotte, North Carolina, by a man with over a dozen prior run-ins with the law. President Donald Trump even took to his Truth S…",
    "link": "https://www.rawstory.com/eric-bolling-2673971730/",
    "timestamp": "2025-09-08T22:28:02Z"
  },
  {
    "title": "Rupert Murdoch’s family reaches deal on who will control media empire after his death",
    "description": "Rupert Murdoch’s family has reached a deal on control of the 94-year-old mogul’s media empire after his death, ensuring no change in direction at Fox News, the most popular network for President Donald Trump and conservatives. The deal creates a trust establi…",
    "link": "https://financialpost.com/pmn/rupert-murdochs-family-reaches-deal-on-who-will-control-media-empire-after-his-death",
    "timestamp": "2025-09-08T22:27:44Z"
  },
  {
    "title": "Trump Signs Trigger Lead Bill Into Law Protecting Homebuyers",
    "description": "Soon mortgage borrowers can say goodbye to unwanted calls, texts, and emails from mortgage lenders, as new legislation is signed into law.",
    "link": "https://www.yahoo.com/lifestyle/articles/trump-signs-trigger-lead-bill-222743529.html",
    "timestamp": "2025-09-08T22:27:43Z"
  },
  {
    "title": "Trump pledges federal guidance to protect school prayer",
    "description": "null / Credit: Freedom Studio/Shutterstock\n\nWashington, D.C. Newsroom, Sep 8, 2025 / 18:26 pm (CNA).\nPresident Donald Trump announced the U.S. Department of Education will issue new federal guidelines to protect prayer at public schools.In a Sept. 8 speech to…",
    "link": "https://www.catholicnewsagency.com/news/266451/trump-pledges-federal-guidance-to-protect-school-prayer",
    "timestamp": "2025-09-08T22:26:00Z"
  },
  {
    "title": "DOJ Files Another Emergency Appeal After Court Yet Again Orders Foreign Aid Restored",
    "description": "The Department of Justice filed an emergency appeal Monday asking the Supreme Court to pause a lower court demand that the Trump administration continue funding... Read More\nThe post DOJ Files Another Emergency Appeal After Court Yet Again Orders Foreign Aid …",
    "link": "https://www.dailysignal.com/2025/09/08/doj-files-another-emergency-appeal-after-court-yet-again-orders-foreign-aid-restored/",
    "timestamp": "2025-09-08T22:25:00Z"
  }
]