[
  {
    "title": "How A New Administration Could Impact The Real Estate Industry",
    "description": "Real estate industry leaders must remain adaptable.",
    "link": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/04/17/how-a-new-administration-could-impact-the-real-estate-industry/",
    "timestamp": "2025-04-17T13:45:00Z"
  },
  {
    "title": "Trump tariffs could cost EU $1.25 trillion – study",
    "description": "Germany’s economy alone could slump by 1.6% annually by 2028, according to IW Read Full Article at RT.com",
    "link": "https://www.rt.com/business/615884-eu-us-tariffs-economic-loss/",
    "timestamp": "2025-04-17T13:44:45Z"
  },
  {
    "title": "Trump: We'll soon send education back to all states",
    "description": "United States President Donald Trump congratulated Texas legislators on Thursday for passing the universal school choice bill. The bill allows public funds to be used for education savings accounts (E...",
    "link": "https://biztoc.com/x/078c0c45f78a1332",
    "timestamp": "2025-04-17T13:43:16Z"
  },
  {
    "title": "China Calls Bluff on 245% US Tariff: 'Meaningless'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nChina has shrugged off the latest U.S. tariff hike, dismissing the Trump administration's threats as a \"meaningless tariff numbers game.\"\nNewsweek reached out to the White House by email with a request for com…",
    "link": "https://biztoc.com/x/63edd569a0ddc4db",
    "timestamp": "2025-04-17T13:43:16Z"
  },
  {
    "title": "Trump says sending education 'BACK TO ALL THE STATES', where it belongs",
    "description": "Donald Trump in a truth social post has repeated his claim that his government will be sending education \"back to the states\". President Trump has already signed an executive order dismantling the Department of Education. With his move, states heavily reliant…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-sending-education-back-to-all-the-states-where-it-belongs/articleshow/120383468.cms",
    "timestamp": "2025-04-17T13:43:12Z"
  },
  {
    "title": "China dominates solar. Trump tariffs target China. For US solar industry, that means higher costs",
    "description": "President Donald Trump's escalating trade war with China means hopeful solar buyers may have a much harder time getting systems installed in the U.S. in coming months",
    "link": "https://abcnews.go.com/Business/wireStory/china-dominates-solar-trump-tariffs-target-china-us-120905548",
    "timestamp": "2025-04-17T13:42:50Z"
  },
  {
    "title": "Neil Young Endorses Mark Carney Amid \"Canada Facing Threats to Its Very Existence\"",
    "description": "After his wife Daryl Hannah recently revealing that Neil Young's US citizenship process was repeatedly impeded by the Trump administration",
    "link": "https://exclaim.ca/music/article/neil-young-endorses-mark-carney-amid-canada-facing-threats-to-its-very-existence",
    "timestamp": "2025-04-17T13:41:25Z"
  },
  {
    "title": "China Calls Bluff on 245% US Tariff: 'Meaningless'",
    "description": "Beijing has threatened countermeasures if Washington continues to violate its \"rights and interests.\"",
    "link": "https://www.newsweek.com/china-responds-us-tariffs-245-percent-trump-trade-war-2060875",
    "timestamp": "2025-04-17T13:41:02Z"
  },
  {
    "title": "When Is Jerome Powell’s Term Up? Find Out When it Ends",
    "description": "As Trump pushes to replace Jerome Powell, learn when the Fed Chair’s term ends and what limits the President faces in removing him.",
    "link": "https://hollywoodlife.com/2025/04/17/when-does-jerome-powell-term-end/",
    "timestamp": "2025-04-17T13:38:21Z"
  },
  {
    "title": "Trump says Fed chief's 'termination cannot come fast enough'",
    "description": "WASHINGTON: US President Donald Trump said on Thursday (Apr 17) that \"termination\" of the independent head of the Federal Reserve \"cannot come fast enough\" as he lashed out at Jerome Powell's",
    "link": "https://www.channelnewsasia.com/world/trump-tariffs-federal-reserve-jerome-powell-termination-5072146",
    "timestamp": "2025-04-17T13:36:03Z"
  },
  {
    "title": "China dominates solar. Trump tariffs target China. For US solar industry, that means higher costs",
    "description": "President Donald Trump's escalating trade war with China means hopeful solar buyers may have a much harder time getting systems installed in the U.S. in coming months.",
    "link": "https://www.ksat.com/business/2025/04/17/china-dominates-solar-trump-tariffs-target-china-for-us-solar-industry-that-means-higher-costs/",
    "timestamp": "2025-04-17T13:36:00Z"
  },
  {
    "title": "After 100 days in office, it’s clear Donald Trump is going all out to govern alone",
    "description": "Donald Trump’s second presidency has been defined by his conviction to govern alone, with escalating disregard for the courts or Congress.",
    "link": "https://www.independent.ie/opinion/analysis/after-100-days-in-office-its-clear-donald-trump-is-going-all-out-to-govern-alone/a231528082.html",
    "timestamp": "2025-04-17T13:35:39Z"
  },
  {
    "title": "China urges Trump to stop threats, blackmail over trade war",
    "description": "China told Washington on Wednesday to “stop threatening and blackmailing” after US President Donald Trump stated that it was up to Beijing to come to the negotiating table to discuss ending their trade war. Trump has imposed new tariffs on both friends and fo…",
    "link": "https://punchng.com/china-urges-trump-to-stop-threats-blackmail-over-trade-war/",
    "timestamp": "2025-04-17T13:35:06Z"
  },
  {
    "title": "Trump Claims ‘We Won It 3 Times’ in New Election Lie Rant as Fox Host Laughs Along",
    "description": "Rachel Campos-Duffy laughed along as Trump claimed \"We won it 3 times\" in a new rant about his longstanding lie that he won the 2020 election.\nThe post Trump Claims ‘We Won It 3 Times’ in New Election Lie Rant as Fox Host Laughs Along first appeared on Mediai…",
    "link": "https://www.mediaite.com/news/trump-claims-we-won-it-3-times-in-new-election-lie-rant-as-fox-host-laughs-along/",
    "timestamp": "2025-04-17T13:34:42Z"
  },
  {
    "title": "CECOT Forever",
    "description": "DOJ tries to prove Abrego Garcia is part of MS-13: Attorney General Pam Bondi has decided that instead of working to facilitate the release of Kilmar",
    "link": "https://reason.com/2025/04/17/cecot-forever/",
    "timestamp": "2025-04-17T13:33:58Z"
  },
  {
    "title": "Why the GOP is nervous about Ken Paxton's Senate run",
    "description": "A MAGA-establishment battle with John Cornyn will be costly",
    "link": "https://theweek.com/politics/ken-paxton-john-cornyn-senate",
    "timestamp": "2025-04-17T13:33:49Z"
  },
  {
    "title": "AmeriCorps Members Who Respond To Disasters And Help Nonprofits Are Let Go In DOGE Cuts",
    "description": "“To have this ripped right from us at the very end, it felt insulting,\" one worker said.",
    "link": "https://www.huffpost.com/entry/trump-doge-americorps_n_68010258e4b0e7e6a3f524ab",
    "timestamp": "2025-04-17T13:33:41Z"
  },
  {
    "title": "Republicans say Democrats don't have a message. They do, and it's destructive.",
    "description": "The biggest lie of all is told by Republicans who claim Democrats have no message. In the acrimonious climate of the current political debate, the biggest lie of all is told by Republicans who claim Democrats are in disarray because they have no message to pe…",
    "link": "https://freerepublic.com/focus/f-news/4311546/posts",
    "timestamp": "2025-04-17T13:33:20Z"
  },
  {
    "title": "Nvidia CEO in Beijing as US tech curbs, trade war threaten sales",
    "description": "BEIJING: Nvidia CEO Jensen Huang arrived in Beijing on Thursday (Apr 17), state media said, days after the United States curbed sales of its H20 artificial intelligence chips to China. Nvidia this week said it expected a US$5.5 billion earnings hit this quart…",
    "link": "https://www.channelnewsasia.com/business/jensen-huang-nvidia-ceo-china-trade-war-sales-5072301",
    "timestamp": "2025-04-17T13:33:04Z"
  },
  {
    "title": "DOGE targets a community service program in its latest cost-cutting effort",
    "description": "A 30-year-old community service program has become the latest target of the Trump administration and DOGE.",
    "link": "https://www.denverpost.com/2025/04/17/trump-doge-targets-americorps/",
    "timestamp": "2025-04-17T13:32:59Z"
  },
  {
    "title": "DOGE targets a community service program in its latest cost-cutting effort",
    "description": "A 30-year-old community service program has become the latest target of the Trump administration and DOGE.",
    "link": "https://www.bostonherald.com/2025/04/17/trump-doge-targets-americorps/",
    "timestamp": "2025-04-17T13:32:59Z"
  },
  {
    "title": "Trump tells Fox Noticias he ‘would like to hear the explanation’ behind assassination attempts",
    "description": "President Donald Trump said he \"would like to hear the explanation\" behind the attempts on his life last year during a Fox Noticias interview airing Tuesday.",
    "link": "https://www.foxnews.com/media/trump-tells-fox-noticias-he-would-like-hear-explanation-behind-assassination-attempts",
    "timestamp": "2025-04-17T13:32:10Z"
  },
  {
    "title": "Trump Media Sounds Alarm to SEC Over Stock Trading: 'Suspicious Activity'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's Trump Media & Technology Group wrote to the Securities and Exchange Commission (SEC) to alert it to \"suspicious activity\" after a U.K.-based hedge fund declared a $105 million short po…",
    "link": "https://biztoc.com/x/f51465cb4e47a564",
    "timestamp": "2025-04-17T13:32:06Z"
  },
  {
    "title": "Europe's cloud customers eyeing exit from US hyperscalers",
    "description": "'It's amazing how fast the change has been' Are customers on the European side of the pond considering a move from US hyperscalers in the wake of recent events? Some of the region's vendors are reporting an uptick in inquiries as organizations mull their opti…",
    "link": "https://www.theregister.com/2025/04/17/us_hyperscaler_alternatives/",
    "timestamp": "2025-04-17T13:32:05Z"
  },
  {
    "title": "The 4 Keys to Australia’s Democracy Edge",
    "description": "Threats to democracy seen in the U.S. are a global issue, but differences in the media and political systems limit their impact in Australia — for now.",
    "link": "https://thediplomat.com/2025/04/the-4-keys-to-australias-democracy-edge/",
    "timestamp": "2025-04-17T13:32:00Z"
  },
  {
    "title": "Hermès leaves wealthy clients to pay for cost of Trump tariffs",
    "description": "The luxury company, based in France, announced that it would be hiking prices in the US to offset the impact of US President Donald Trump’s 10% tariffs against the EU.",
    "link": "https://biztoc.com/x/e6df07ce405ebe4f",
    "timestamp": "2025-04-17T13:31:35Z"
  },
  {
    "title": "Stock market today: Dow slides as UnitedHealth sinks, Nasdaq wavers as tech sell-off continues",
    "description": "US stock futures traded flat on the heels of a bruising day on Wall Street that underscored fears over the economic impact of President Trump's tariffs.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-slides-as-unitedhealth-sinks-nasdaq-wavers-as-tech-sell-off-continues-133036553.html",
    "timestamp": "2025-04-17T13:30:36Z"
  },
  {
    "title": "Hermès to raise US prices due to Trump’s tariffs",
    "description": "French luxury fashion house Hermès announced on Thursday plans to increase prices in the United States starting May 1, in response to the 10% import tariffs recently imposed by President Donald Trump, AFP reported. The company’s Chief Financial Officer, Eric …",
    "link": "https://punchng.com/hermes-to-raise-us-prices-due-to-trumps-tariffs/",
    "timestamp": "2025-04-17T13:28:58Z"
  },
  {
    "title": "Indian Official Team Likely To Visit Washington Next Week For Trade Talks",
    "description": "An Indian official team is likely to visit Washington next week to iron out differences on certain issues before formally launching negotiations for the proposed India-US bilateral trade agreement (BTA), an official said.",
    "link": "https://www.ndtv.com/india-news/indian-official-team-likely-to-visit-washington-next-week-for-trade-talks-8188769",
    "timestamp": "2025-04-17T13:28:51Z"
  },
  {
    "title": "Will OpenAI's Social Network Become Just The Latest Twitter Clone?",
    "description": "OpenAI would be far from the first to attempt to dethrone X, but it can look to why the other efforts have so far not succeeded.",
    "link": "https://www.forbes.com/sites/petersuciu/2025/04/17/will-openais-social-network-become-just-the-latest-twitter-clone/",
    "timestamp": "2025-04-17T13:28:34Z"
  },
  {
    "title": "Trump Media Sounds Alarm to SEC Over Stock Trading: 'Suspicious Activity'",
    "description": "A U.K.-based hedge fund said it had a $105 million short position in Trump Media stock.",
    "link": "https://www.newsweek.com/trump-media-sec-stock-trading-qube-short-2061041",
    "timestamp": "2025-04-17T13:28:18Z"
  },
  {
    "title": "James Carville Dumps Cold Water on AOC, Bernie Tour After Going off on Progressives: ‘When You Beat a Republican, Come Back and See Me!’",
    "description": "James Carville doesn't see the \"Fighting Oligarchy\" tour byAlexandria Ocasio-Cortez and Bernie Sanders as all that helpful to Democrats.\nThe post James Carville Dumps Cold Water on AOC, Bernie Tour After Going off on Progressives: ‘When You Beat a Republican,…",
    "link": "https://www.mediaite.com/tv/james-carville-dumps-cold-water-on-aoc-bernie-tour-after-going-off-on-progressives-when-you-beat-a-republican-come-back-and-see-me/",
    "timestamp": "2025-04-17T13:28:07Z"
  },
  {
    "title": "The complicated calculation of ending de minimis",
    "description": "While closing the duty loophole for low-value goods from China and Hong Kong may offer some benefits, the U.S. fashion industry could face challenges.",
    "link": "https://www.fashiondive.com/news/de-minimis-challenges-drawbacks-loophole-china-hong-kong/745189/",
    "timestamp": "2025-04-17T13:28:00Z"
  },
  {
    "title": "JD Vance Says Trump Immigration Policies About Numbers, Not Rights",
    "description": "JD Vance says the driving force behind the Trump administration’s immigration policy is achieving a high level of deportations.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/04/17/jd-vance-says-trump-immigration-policies-about-numbers-not-rights/",
    "timestamp": "2025-04-17T13:27:56Z"
  },
  {
    "title": "In anti-Trump protest, millions to hit streets at Washington Park, Chicago this Saturday: 10-point explainer",
    "description": "The anger against Donald Trump and Elon Musk is mounting in the United States. After the successful 'Hands Off' protest, anti-Trump groups have planned another protest. The 50501 group, which stands for \"50 protests in 50 states, 1 movement,\" is planning simu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/in-anti-trump-protest-millions-to-hit-streets-at-washington-park-chicago-this-saturday-10-point-explainer/articleshow/120383073.cms",
    "timestamp": "2025-04-17T13:27:36Z"
  },
  {
    "title": "Fed's Williams sees no looming need to change monetary policy - Fox Business",
    "description": "NEW YORK (Reuters) -Federal Reserve Bank of New York President John Williams said Thursday he sees no imminent need for a change in central bank interest...",
    "link": "https://finance.yahoo.com/news/feds-williams-sees-no-looming-132649986.html",
    "timestamp": "2025-04-17T13:26:49Z"
  },
  {
    "title": "If the stock market plummets, will you intervene? Here's why Fed's Powell gave a strong 'No'",
    "description": "Jerome Powell dismissed hopes of Fed intervention amid market turmoil, calling volatility a normal response to uncertainty. His comments triggered a market crash, with Nasdaq down 3% and Nvidia plunging 7%, as Trump renewed calls for rate cuts.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/if-the-stock-market-plummets-will-you-intervene-heres-why-feds-powell-gave-a-strong-no/articleshow/120383254.cms",
    "timestamp": "2025-04-17T13:26:19Z"
  },
  {
    "title": "'Never waste a good crisis': How Sweden wants to attract US talent fleeing Trump",
    "description": "US President Donald Trump has targeted businesses and academia since he was sworn in for a second term, cracking down on diversity programmes and effectively banning some types of research. Now, Sweden hopes to attract the American talent Trump is pushing awa…",
    "link": "https://www.thelocal.se/20250417/never-waste-a-good-crisis-how-sweden-wants-to-attract-us-talent-fleeing-trump",
    "timestamp": "2025-04-17T13:25:30Z"
  },
  {
    "title": "ECB rate cut: What does it mean for mortgage borrowers on trackers, fixed and variable rates?",
    "description": "Drop of a quarter of a percentage point will benefit some consumers more than others",
    "link": "https://www.irishtimes.com/your-money/2025/04/17/ecb-rate-cut-what-does-it-mean-for-mortgage-borrowers-on-trackers-fixed-and-variable-rates/",
    "timestamp": "2025-04-17T13:23:31Z"
  },
  {
    "title": "Indian official team likely to visit Washington next week for trade talks",
    "description": "An Indian official team is set to visit Washington next week to resolve outstanding issues before formally launching negotiations for a proposed India-US bilateral trade agreement (BTA). This visit, following a recent US team visit to India, signals growing m…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indian-official-team-likely-to-visit-washington-next-week-for-trade-talks/articleshow/120383181.cms",
    "timestamp": "2025-04-17T13:21:55Z"
  },
  {
    "title": "Is Donald Trump Ignoring Supreme Court's Abrego Garcia Order? What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA federal judge has ordered an inquiry into the Trump administration's refusal to seek the return of Kilmar Abrego Garcia, who was wrongly deported to a notorious El Salvador prison.\nU.S. District Judge Paula …",
    "link": "https://biztoc.com/x/43125fc1584749c3",
    "timestamp": "2025-04-17T13:21:00Z"
  },
  {
    "title": "Trump's Tariffs and the Renaissance of American Manufacturing | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn April 2, \"Liberation Day,\" President Donald Trump raised tariffs and effectively ended the world's post-war liberal trading order. By the time the sun had set that evening, he had imposed, with the stroke o…",
    "link": "https://biztoc.com/x/2b845b2f66f5ec4c",
    "timestamp": "2025-04-17T13:20:42Z"
  },
  {
    "title": "Trump Ramps Up Foreign Meetings: Mexico, Japan, and Now Italy",
    "description": "President Donald Trump will meet Italian Prime Minister Giorgia Meloni at the White House today, marking the first visit by a European leader since he announced reciprocal tariffs. The visit comes at a tense moment for EU-U.S. relations. \nMeloni, leader of It…",
    "link": "https://biztoc.com/x/10e79754e34dc2ca",
    "timestamp": "2025-04-17T13:20:37Z"
  },
  {
    "title": "Fast fashion e-commerce sites Temu and Shein say they're raising prices because of tariffs",
    "description": "Both of the China-founded sites say U.S. customers will see higher prices starting next week, and industry data shows they're pulling back on U.S. advertising, too.",
    "link": "https://www.cbc.ca/news/business/temu-shein-raising-prices-1.7512710",
    "timestamp": "2025-04-17T13:20:34Z"
  },
  {
    "title": "Trump pushes Powell to cut rates, renewing debate over Fed independence",
    "description": "President Donald Trump renewed his attack on Jerome Powell Thursday, declaring in a social media post that the Federal Reserve chairman's \"termination can't come fast enough.\"\nThe strongly worded message marks the latest in a series of criticisms the presiden…",
    "link": "https://biztoc.com/x/5ebaf6a54b0592ae",
    "timestamp": "2025-04-17T13:20:30Z"
  },
  {
    "title": "Trump Launches Critical Minerals Probe to Weigh New Tariffs",
    "description": "President Donald Trump has launched a probe into the need for tariffs on critical minerals, the latest action in an expanding trade war that has targeted key sectors of the global economy.\nThe order, which Trump signed on Tuesday, calls for the commerce secre…",
    "link": "https://biztoc.com/x/58b9a858ec64aff4",
    "timestamp": "2025-04-17T13:20:29Z"
  },
  {
    "title": "Trump Yet to Reach Out to Pennsylvania Governor After Arson Attack, Shapiro Says",
    "description": "Pennsylvania Governor Josh Shapiro said he has not heard from President Trump since an arsonist tried to ignite his residence, where he was sleeping with his family",
    "link": "https://www.ibtimes.com/trump-yet-reach-out-pennsylvania-governor-after-arson-attack-shapiro-says-3770478",
    "timestamp": "2025-04-17T13:20:27Z"
  },
  {
    "title": "Japan reports a $63 billion trade surplus with the US as it talks with Trump on tariffs",
    "description": "Japan recorded a trade deficit for the fiscal year that just ended but racked up a $63 billion surplus with the United States.",
    "link": "https://www.ksat.com/business/2025/04/17/japan-reports-a-63-billion-trade-surplus-with-the-us-as-it-talks-with-trump-on-tariffs/",
    "timestamp": "2025-04-17T13:20:22Z"
  },
  {
    "title": "Former state health officer Abdul El-Sayed enters Democratic US Senate race",
    "description": "Abdul El-Sayed is the second Democrat to put his name in the running in what could be one of the most watched races in the 2026 midterm elections.",
    "link": "https://www.fox17online.com/news/national-politics/america-votes/former-state-health-officer-abdul-el-sayed-enters-democratic-us-senate-race",
    "timestamp": "2025-04-17T13:19:30Z"
  },
  {
    "title": "Temu and Shein are raising their US prices next week",
    "description": "Shein and Temu are preparing to raise their prices in the US. In almost the same notice to customers, the ultra-cheap retailers warn that they will start adjusting their prices on April 25th due to changes to “global trade rules and tariffs.” President Donald…",
    "link": "https://www.theverge.com/news/650556/temu-shein-us-price-increase-tariffs",
    "timestamp": "2025-04-17T13:18:47Z"
  },
  {
    "title": "Is Donald Trump Ignoring Supreme Court's Abrego Garcia Order? What to Know",
    "description": "The Supreme Court ordered the Trump administration to \"facilitate\" his return of Abrego Garcia after he was mistakenly deported to El Salvador.",
    "link": "https://www.newsweek.com/donald-trump-ignoring-supreme-court-order-2060919",
    "timestamp": "2025-04-17T13:18:15Z"
  },
  {
    "title": "Is Trump Destroying Science or Saving It?",
    "description": "Apparently, some 75 percent of U.S. scientists are planning to emigrate to Canada and Europe “in light of President Donald Trump’s sweeping changes to federal science policy.” Is this a joke or just a bad poll? According to my omniscient AI “Copilot,” the U.S…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311542/posts",
    "timestamp": "2025-04-17T13:18:07Z"
  },
  {
    "title": "Southeast Asia walks tightrope between China and US",
    "description": "Chinese President Xi Jinping is staging a charm offensive in the region while US President Donald Trump inflicts massive tariff pain.",
    "link": "https://www.dw.com/en/southeast-asia-walks-tightrope-between-china-and-us/a-72275663",
    "timestamp": "2025-04-17T13:18:00Z"
  },
  {
    "title": "Trump's Tariffs and the Renaissance of American Manufacturing | Opinion",
    "description": "Like them or hate them, high tariff walls are necessary for the U.S. factory sector to recover.",
    "link": "https://www.newsweek.com/trumps-tariffs-renaissance-american-manufacturing-opinion-2061022",
    "timestamp": "2025-04-17T13:17:33Z"
  },
  {
    "title": "Good Friday 2025: Is it a Federal Holiday? What is closed, open in the USA",
    "description": "Good Friday 2025, observed on April 18th, holds deep religious significance for Christians, commemorating the crucifixion of Jesus Christ. While not a federal holiday in the U.S., ten states recognize it as a state holiday. Most banks, FedEx, UPS, and USPS wi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/good-friday-2025-us-here-what-open-and-closed-across-the-united-states-of-america/articleshow/120383037.cms",
    "timestamp": "2025-04-17T13:16:31Z"
  },
  {
    "title": "Gov. Newsom to cut California budget as Trump’s trade war crimps economic outlook",
    "description": "“President Trump’s unlawful tariffs are wreaking chaos on California families, businesses, and our economy — driving up prices and threatening jobs,” said Newsom.",
    "link": "https://www.mercurynews.com/2025/04/17/newsom-to-cut-california-budget-as-trumps-trade-war-crimps-economic-outlook/",
    "timestamp": "2025-04-17T13:16:15Z"
  },
  {
    "title": "Trump Melts Down Over Fed Chair’s Dark Warning About Tariffs",
    "description": "Donald Trump isn’t too happy after Federal Reserve Chair Jerome Powell said the president’s tariff policy would cause more inflation and slow growth.\r\nIn a post on Truth Social Thursday morning, Trump furiously blamed Powell for not lowering interest rates. T…",
    "link": "https://newrepublic.com/post/194096/donald-trump-federal-reserve-jerome-powell-warning-tariffs",
    "timestamp": "2025-04-17T13:15:45Z"
  },
  {
    "title": "European Central Bank cuts interest rates for the seventh time as global trade tensions escalate",
    "description": "FRANKFURT, Germany (AP) — The European Central Bank cut interest rates Thursday for the seventh time to counter worries about economic growth fueled by President Donald Trump’s tariff onslaught. The bank’s move should support economic activity in the 20 count…",
    "link": "https://financialpost.com/pmn/european-central-bank-cuts-interest-rates-for-the-seventh-time-as-global-trade-tensions-escalate",
    "timestamp": "2025-04-17T13:14:07Z"
  },
  {
    "title": "Thai PM backs Asean united front on tariffs",
    "description": "<p>Thailand is ready to support Asean&rsquo;s collective approach in negotiating with the United States over its reciprocal <strong>tariffs</strong> on imports from countries in the region, Prime Minister Paetongtarn Shinawatra said on Thursday.</p>",
    "link": "https://www.bangkokpost.com/thailand/general/3005307/thai-pm-backs-asean-united-front-on-tariffs",
    "timestamp": "2025-04-17T13:12:00Z"
  },
  {
    "title": "TRUMP EFFECT: ICE Touts Highest Worksite Arrests in Agency History",
    "description": "U.S. Immigration and Customs Enforcement agents arrested more than 1,000 illegal alien workers and have uncovered sufficient evidence of immigration employment violations to justify the proposal of $1 million during the first 100 days of President Donald Trum…",
    "link": "https://www.breitbart.com/border/2025/04/17/trump-effect-ice-touts-highest-worksite-arrests-in-agency-history/",
    "timestamp": "2025-04-17T13:10:16Z"
  },
  {
    "title": "Secret plans for Trump's 'Golden Dome' missile shield revealed",
    "description": "Elon Musk has emerged as a frontrunner in President Donald Trump's plans to build a 'Golden Dome' missile defense shield. Musk's SpaceX company is partnering with software maker Palantir and drone builder Anduril to build key parts of Golden Dome, six sources…",
    "link": "https://freerepublic.com/focus/f-news/4311538/posts",
    "timestamp": "2025-04-17T13:09:58Z"
  },
  {
    "title": "Trump says Federal Reserve Chair Powell’s ‘termination cannot come fast enough’",
    "description": "By AAMER MADHANI and JOSH BOAK, Associated Press\nWASHINGTON (AP) — President Donald Trump slammed Federal Reserve Chair Jerome Powell on Thursday, reiterating his frustration that the Fed has not aggressively cut interest rates and saying that the central ban…",
    "link": "https://biztoc.com/x/b940badd7ef5bd23",
    "timestamp": "2025-04-17T13:09:28Z"
  },
  {
    "title": "Trump says Fed chair is ‘too late’ on interest rates: ‘Powell’s termination cannot come fast enough!’",
    "description": "President Donald Trump called Federal Reserve chair Jerome Powell “wrong” for his decision to not further cut interest rates. Powell had previously said Trump’s tariff policy would lead to higher inflation and lower growth. \nPresident Donald Trump continued h…",
    "link": "https://biztoc.com/x/eea374cbce5a2dce",
    "timestamp": "2025-04-17T13:09:24Z"
  },
  {
    "title": "Node.js malvertising campaign targets crypto users",
    "description": "Microsoft warns of a malvertising campaign using Node.js to deliver info-stealing malware via fake crypto trading sites like Binance and TradingView. Microsoft has observed Node.js increasingly used in malware campaigns since October 2024, including an ongoin…",
    "link": "https://securityaffairs.com/176651/hacking/node-js-malvertising-campaign-targets-crypto-users.html",
    "timestamp": "2025-04-17T13:07:20Z"
  },
  {
    "title": "China’s Xi, seeking to build regional ties, meets Cambodian leader",
    "description": "Chinese President Xi Jinping met the Cambodian premier in Phnom Penh on Thursday on the final leg of a Southeast Asia tour in which he sought to strengthen regional trade ties. Xi arrived in the Cambodian capital after visiting Vietnam and Malaysia as Beijing…",
    "link": "https://www.digitaljournal.com/world/chinas-xi-seeking-to-build-regional-ties-meets-cambodian-leader/article",
    "timestamp": "2025-04-17T13:07:20Z"
  },
  {
    "title": "The everyday electronics that won’t survive Trump’s trade war",
    "description": "Less than six months ago, after an inappropriate amount of research, I bought a new toaster for $30. My old toaster had died, as old toasters do, and I wanted to buy one cheap enough that I wouldn’t be mad when I had to replace it. If President Donald Trump’s…",
    "link": "https://www.vox.com/technology/409105/trump-tariffs-smartphones-laptops-appliances-electronics",
    "timestamp": "2025-04-17T13:07:07Z"
  },
  {
    "title": "China's Xi, Seeking To Build Regional Ties, Meets Cambodian Leader",
    "description": "Chinese President Xi Jinping met the Cambodian premier in Phnom Penh on Thursday on the final leg of a Southeast Asia tour in which he sought to strengthen regional trade ties.",
    "link": "https://www.ibtimes.com/chinas-xi-seeking-build-regional-ties-meets-cambodian-leader-3770476",
    "timestamp": "2025-04-17T13:06:14Z"
  },
  {
    "title": "Trump HHS eliminates office that sets poverty levels tied to benefits for at least 80 million people | CNN",
    "description": "President Donald Trump’s firings at the Department of Health and Human Services included the entire office that sets federal poverty guidelines, which determine whether tens of millions of Americans are eligible for health programs such as Medicaid, food assi…",
    "link": "https://www.cnn.com/2025/04/17/health/hhs-poverty-levels-benefits-kff-health-news/index.html",
    "timestamp": "2025-04-17T13:05:38Z"
  },
  {
    "title": "Elon Musk's company the 'frontrunner' to build widely criticized Trump project: report",
    "description": "President Donald Trump's determination to build a nationwide missile shield on par with the Iron Dome in Israel may be about to become even more controversial.Reuters reports that Elon Musk's SpaceX, along with software maker Palantir and drone builder Anduri…",
    "link": "https://www.rawstory.com/trump-golden-dome-spacex-2671791023/",
    "timestamp": "2025-04-17T13:03:14Z"
  },
  {
    "title": "Can Trump Fire Powell? Find Out What the President Has Said",
    "description": "In a Truth Social post, the president said Powell's 'termination cannot come fast enough.'",
    "link": "https://hollywoodlife.com/feature/can-trump-fire-powell-5381146/",
    "timestamp": "2025-04-17T13:02:13Z"
  },
  {
    "title": "Cities are missing topic in the 2025 federal election campaign",
    "description": "There’s nothing even the least bit surprising about the fact that cities, or urban affairs more generally, have had so little play in the federal election. Yes, all three major parties talk about housing and housing affordability. Both the Conservative and th…",
    "link": "https://spacing.ca/toronto/2025/04/17/cities-are-missing-topic-in-the-2025-federal-election-campaign/",
    "timestamp": "2025-04-17T13:00:58Z"
  },
  {
    "title": "Trump says Federal Reserve Chair Powell’s ‘termination cannot come fast enough’",
    "description": "Trump slammed the Federal Reserve's Powell, reiterating his frustration the Fed has not aggressively cut interest rates",
    "link": "https://www.bostonherald.com/2025/04/17/trump-criticism-federal-reserve-powell/",
    "timestamp": "2025-04-17T13:00:37Z"
  },
  {
    "title": "California Gov. Gavin Newsom Makes Desperate Bid for Relevancy and Money",
    "description": "Newsom is suing Trump over tariffs, asking for massive loans to cover the healthcare costs for illegal aliens, and trying to woo Canadians to tour the state.\nThe post California Gov. Gavin Newsom Makes Desperate Bid for Relevancy and Money first appeared on L…",
    "link": "https://legalinsurrection.com/2025/04/california-gov-gavin-newsom-makes-desperate-bid-for-relevancy-and-money/",
    "timestamp": "2025-04-17T13:00:16Z"
  },
  {
    "title": "US health chief Kennedy targets 'environmental toxins' as cause of autism",
    "description": "Robert F. Kennedy contradicted both developing and established science on autism in his first press conference since becoming Secretary of Health and Human Services.",
    "link": "https://www.jpost.com/health-and-wellness/article-850462",
    "timestamp": "2025-04-17T13:00:10Z"
  },
  {
    "title": "Port Of L.A. To Get First Electric Tug Via Diesel Conversion",
    "description": "The Port of Los Angeles will soon have its first electric tug as electric boat company Arc Boat makes its first foray into commercial marine.",
    "link": "https://www.forbes.com/sites/edgarsten/2025/04/17/port-of-la-to-get-first-electric-tug-via-diesel-conversion/",
    "timestamp": "2025-04-17T13:00:00Z"
  },
  {
    "title": "Mississippi officials refused to air 'Sesame Street' in 1970 because of multiracial cast",
    "description": "\"Sesame Street,\" which premiered in November 1969, faced a rough road to air in the state of Mississippi. This is that story.",
    "link": "https://www.snopes.com//articles/469729/mississippi-sesame-street-multiracial-cast/",
    "timestamp": "2025-04-17T13:00:00Z"
  },
  {
    "title": "‘American Psycho’ At 25: Is This Portrait of ‘80s Era Wall Street Excess Weirdly Aspirational or a Total Horrorshow?",
    "description": "American Psycho understands that it’s too much to hope that these people will be caught or stopped.",
    "link": "https://decider.com/2025/04/17/american-psycho-at-25-is-this-portrait-of-80s-era-wall-street-excess-weirdly-aspirational-or-a-total-horrorshow/",
    "timestamp": "2025-04-17T13:00:00Z"
  },
  {
    "title": "Russian barriers to re-entry stymie prospects of Western companies' return",
    "description": "By Elena Fabrichnaya, Alexander Marrow and Gleb Stolyarov\nMOSCOW (Reuters) - Three months after U.S. President Donald Trump returned to the White House promising a swift end to the conflict in Ukraine and sparking an early flurry of excitement that Western co…",
    "link": "https://biztoc.com/x/d9e0d797d1594032",
    "timestamp": "2025-04-17T12:59:15Z"
  },
  {
    "title": "With Recession Chances Higher After Trump's Tariffs, Here Are 2 Dividend Stocks I'm Loading Up On",
    "description": "In This Article:\n\"Tariff\" has probably been the most used word in the business and investing world since U.S. President Donald Trump announced his new tariff plan on April 2.\nThe newly announced tariffs caused the stock market to plummet in the following days…",
    "link": "https://biztoc.com/x/fdae6d8b598c6bd0",
    "timestamp": "2025-04-17T12:59:10Z"
  },
  {
    "title": "Commentary: Trump fired a tariff torpedo at China — and hit Boeing right between the eyes",
    "description": "Trump fired a tariff torpedo at China — and hit Boeing right between the eyes\nWe keep hearing about all the goods that will become more expensive for Americans thanks to Donald Trump’s tariff policy, such as it is: clothing, shoes, cars, food, especially anyt…",
    "link": "https://biztoc.com/x/2f1b8417f1433062",
    "timestamp": "2025-04-17T12:58:23Z"
  },
  {
    "title": "Europe seeking ‘direct line’ with Trump – NYT",
    "description": "European officials believe that even the US president’s closest aides lack decision-making power, the report says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615891-europe-direct-line-trump/",
    "timestamp": "2025-04-17T12:57:53Z"
  },
  {
    "title": "Sanity Returns To The Appliance Aisle",
    "description": "Acting to please a constituency that prefers scarcity over abundance, Joe Biden ordered up a list of federal rules that restricted consumer choice. Given the exhaustive White House agenda that began when Donald Trump took office on Jan. 20, it would have been…",
    "link": "https://freerepublic.com/focus/f-news/4311536/posts",
    "timestamp": "2025-04-17T12:57:50Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.ketv.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:55:53Z"
  },
  {
    "title": "Europeans and Ukrainians make their case as Rubio and Witkoff visit Paris",
    "description": "High level diplomacy reflects Europe’s mounting concern over the US administration’s overtures towards Moscow",
    "link": "https://www.irishtimes.com/world/europe/2025/04/17/europeans-and-ukrainians-make-their-case-as-rubio-and-witkoff-visit-paris/",
    "timestamp": "2025-04-17T12:55:37Z"
  },
  {
    "title": "Y'all Hear What Seth Rogen Said Right To Bezos's And Zuck's Little Fascist Trump-Sucking Faces?",
    "description": "We think you should hear what Seth Rogen said right to Bezos's and Zuck's little fascist Trump-sucking faces.",
    "link": "https://www.wonkette.com/p/yall-hear-what-seth-rogen-said-right",
    "timestamp": "2025-04-17T12:55:22Z"
  },
  {
    "title": "Ex-OneRepublic bassist Tim Myers to challenge veteran Republican congressman",
    "description": "“Ken Calvert has been in Washington for 30 years,” Myers says in a video announcing his campaign. The “status quo isn’t working.”",
    "link": "https://nypost.com/2025/04/17/entertainment/ex-onerepublic-bassist-tim-myers-to-challenge-veteran-republican-congressman/",
    "timestamp": "2025-04-17T12:55:19Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.wtae.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:55:11Z"
  },
  {
    "title": "ECB Cuts Interest Rates Again as Trump Tariff Fears Threaten Recovery",
    "description": "The European Central Bank lowered interest rates for the seventh time since last June as global trade tensions threaten to derail the region’s economic recovery.",
    "link": "https://financialpost.com/pmn/business-pmn/ecb-cuts-interest-rates-again-as-trump-tariff-fears-threaten-recovery",
    "timestamp": "2025-04-17T12:54:37Z"
  },
  {
    "title": "U.S., European officials meet in Paris to discuss Ukraine war",
    "description": "A Ukrainian delegation arrived in Paris on Thursday, a development not previously announced, ahead of what Washington had described as planned talks between top U.S. officials and French counterparts toward brokering an end to the Russia-Ukraine war.",
    "link": "https://www.cbc.ca/news/world/paris-talks-ukraine-war-1.7512680",
    "timestamp": "2025-04-17T12:54:29Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.wcvb.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:54:06Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.kcra.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:54:03Z"
  },
  {
    "title": "European Central Bank cuts interest rates for the seventh time",
    "description": "The European Central Bank cut interest rates Thursday for the seventh time to counter worries about economic growth fueled by President Donald Trump’s tariff onslaught",
    "link": "https://abcnews.go.com/Business/wireStory/european-central-bank-cuts-interest-rates-seventh-time-120900937",
    "timestamp": "2025-04-17T12:52:49Z"
  },
  {
    "title": "Ukrainian drone downed 300m from Europe’s largest nuclear power plant",
    "description": "Kiev “intentionally” staged the attack amid the looming expiry of a US-mediated moratorium on strikes, the facility’s spokeswoman has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615882-zaporozhye-plant-ukrainian-attack/",
    "timestamp": "2025-04-17T12:52:20Z"
  }
]