[
  {
    "title": "Americans Rushed Out To Buy New Cars As Tariff Threat Loomed",
    "description": "A pre-tariff sales rush, GM financial surprises, and some terrible news for autonomous-style driver-assistance tech. It's all happening in The Morning Shift.",
    "link": "https://www.jalopnik.com/1825105/americans-rush-buy-new-cars-before-trump-tariffs/",
    "timestamp": "2025-04-02T13:32:45Z"
  },
  {
    "title": "A wary Europe awaits Rubio with NATO’s future on the line",
    "description": "Secretary of State Marco Rubio is traveling this week to a gathering of top diplomats. He is sure to find allies alarmed, angered and confused.",
    "link": "https://www.bostonherald.com/2025/04/02/us-nato-rubio-meeting/",
    "timestamp": "2025-04-02T13:30:14Z"
  },
  {
    "title": "Opinion - Trump has gone too far — and Americans are noticing",
    "description": "Trump's actions on immigration, executive orders, spending, tariffs and the Department of Government Efficiency have alienated many Americans, who are...",
    "link": "https://thehill.com/opinion/5227009-trump-executive-orders/",
    "timestamp": "2025-04-02T13:30:00Z"
  },
  {
    "title": "The US restricts presidents to 2 terms. Here's a look at the tradition Trump questions",
    "description": "Only one person in U.S. history defied the two-term example set by the first president, George Washington.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_7b557c13-cc96-50fd-823c-e0ebea18b148.html",
    "timestamp": "2025-04-02T13:30:00Z"
  },
  {
    "title": "Tesla just reported its worst quarterly sales in years as Elon Musk courts controversy",
    "description": "Tesla (TSLA) delivered slightly more than 336,000 electric vehicles between January and March, far below Wall Street’s already low expectationsRead more...",
    "link": "https://qz.com/tesla-q1-sales-slump-years-protests-elon-musk-evs-1851774128",
    "timestamp": "2025-04-02T13:30:00Z"
  },
  {
    "title": "Messaging apps are spying on you — Here’s how to stay safe in 2025",
    "description": "Social messaging apps tend to make major news headlines a few times per year for either their use in planning some sort of crime or, more routinely, for users’ privacy concerns over how companies like Meta — which owns WhatsApp, Instagram and Messenger — hand…",
    "link": "https://cointelegraph.com/news/messaging-apps-are-spying-on-you-here-s-how-to-stay-safe-in-2025",
    "timestamp": "2025-04-02T13:30:00Z"
  },
  {
    "title": "Sen. Ruben Gallego blocks VA nominees to protest Trump’s plans to cut the agency's workforce",
    "description": "Arizona Sen. Ruben Gallego announced Tuesday he will block the confirmation of top leaders at the Department of Veterans Affairs, raising the stakes in Democrats’ bid to get the Trump administration to back off plans to cut jobs from the sprawling agency that…",
    "link": "https://www.nbcnews.com/politics/congress/sen-ruben-gallego-blocks-va-nominees-protest-trumps-plans-cut-agencys-rcna199257",
    "timestamp": "2025-04-02T13:28:59Z"
  },
  {
    "title": "Bipartisan Group of Senators Readies New Sanctions on Russia",
    "description": "The punishments would include a 500 percent tariff on imports from countries that buy Russian oil, petroleum products, natural gas or uranium, according to a draft of the bill seen by Bloomberg News.",
    "link": "https://www.rigzone.com/news/wire/bipartisan_group_of_senators_readies_new_sanctions_on_russia-02-apr-2025-180114-article/",
    "timestamp": "2025-04-02T13:28:50Z"
  },
  {
    "title": "Elon Musk May Actually Have Screwed Himself in Wisconsin Election",
    "description": "Elon Musk came up short Tuesday when trying to buy a seat on Wisconsin’s Supreme Court—and he has no one to blame but himself.\r\nIn the state election, Judge Susan Crawford secured a whopping 55 percent of the vote, while the Musk-backed Judge Brad Schimel cap…",
    "link": "https://newrepublic.com/post/193464/elon-musk-negative-effect-wisconsin-election",
    "timestamp": "2025-04-02T13:28:36Z"
  },
  {
    "title": "Truth Social-parent re-registers shares that would allow Trump trust to sell stock",
    "description": "Trump Media & Technology Group filed papers to re-register shares that would allow President Donald Trump's trust to potentially sell $2.3 billion worth of the company's stock.Shares of Trump Media, which operates the Truth Social platform and is primarily ow…",
    "link": "https://www.channelnewsasia.com/business/truth-social-parent-re-registers-shares-would-allow-trump-trust-sell-stock-5040151",
    "timestamp": "2025-04-02T13:28:31Z"
  },
  {
    "title": "Truth Media files to allow Trump's trust to sell stock, Axios reports",
    "description": "Trump Media & Technology Group filed papers with the U.S. Securities and Exchange Commission on Wednesday that would allow President Donald Trump's trust to sell stock that could be worth $2.3 billion, Axios reported.Shares of Trump Media, which operates Trum…",
    "link": "https://www.channelnewsasia.com/business/truth-media-files-allow-trumps-trust-sell-stock-axios-reports-5040151",
    "timestamp": "2025-04-02T13:28:31Z"
  },
  {
    "title": "As Donald Trump pushes trade wars, tariffs countries, and deports immigrants, the world may boycott the FIFA World Cup and Los Angeles Olympics",
    "description": "The US, Canada, and Mexico are set to host the 2026 FIFA World Cup. However, trade wars and immigration policies under US President Trump may create challenges. These tensions raise concerns over travel difficulties and whether foreign fans will feel welcome.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-donald-trump-pushes-trade-wars-tariffs-countries-and-deports-immigrants-the-world-may-boycott-the-fifa-world-cup-and-los-angeles-olympics/articleshow/119908464.cms",
    "timestamp": "2025-04-02T13:28:10Z"
  },
  {
    "title": "US revokes Mexican band Los Alegres del Barranco’s visa over cartel-themed concert featuring images of El Chapo, El Mencho",
    "description": "Mexican group Los Alegres del Barranco have seen their US visas cancelled after displaying images of cartel chiefs Joaquín \"El Chapo\" Guzmán and Nemesio \"El Mencho\" Oseguera Cervantes on stage at a show in Guadalajara. The show, which celebrated the cartel ch…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-revokes-mexican-band-los-alegres-del-barrancos-visa-over-cartel-themed-concert-featuring-images-of-el-chapo-el-mencho/articleshow/119909444.cms",
    "timestamp": "2025-04-02T13:27:25Z"
  },
  {
    "title": "Chinese firms place $16 billion in order for new Nvidia chips, the Information reports",
    "description": "In February, Reuters first reported a surge in orders for the H20 - the most advanced AI processor legally available in China under U.S. export controls...",
    "link": "https://ca.finance.yahoo.com/news/chinese-firms-place-16-billion-132722699.html",
    "timestamp": "2025-04-02T13:27:22Z"
  },
  {
    "title": "‘A Warning to Mr. Trump’: Wall Street Journal Declares Election Results a ‘Backlash’ to the ‘Trump-Musk Governing Style’",
    "description": "The Wall Street Journal called Tuesday night's election results a \"backlash\" to the \"Trump-Musk governing style\" in a new editorial.\nThe post ‘A Warning to Mr. Trump’: Wall Street Journal Declares Election Results a ‘Backlash’ to the ‘Trump-Musk Governing Sty…",
    "link": "https://www.mediaite.com/news/a-warning-to-mr-trump-wall-street-journal-declares-election-results-a-backlash-to-the-trump-musk-governing-style/",
    "timestamp": "2025-04-02T13:26:17Z"
  },
  {
    "title": "Solana Policy Institute Launched in Washington DC; Kristin Smith Named President",
    "description": "Founded by Miller Whitehouse-Levine, the Solana Policy Institute is a non-partisan, non-profit Web3 advocacy group based in Washington, DC. In the coming months, it will host educational sessions for US policymakers, featuring key leaders from the Solana ecos…",
    "link": "https://www.gadgets360.com/cryptocurrency/news/solana-policy-institute-us-washington-dc-kristin-smith-president-miller-whitehouse-levine-ceo-8070641",
    "timestamp": "2025-04-02T13:25:41Z"
  },
  {
    "title": "Wisconsin Supreme Court Seat Elections: Here’s who won and why this victory was crucial",
    "description": "Susan Crawford won a seat on the Wisconsin Supreme Court, defeating Brad Schimel. This victory secures a liberal majority for at least three years. The election saw record-breaking spending and high voter turnout. Crawford's win was seen as a response to outs…",
    "link": "https://economictimes.indiatimes.com/news/international/us/wisconsin-supreme-court-seat-elections-heres-who-won-and-why-this-victory-was-crucial/articleshow/119909208.cms",
    "timestamp": "2025-04-02T13:25:34Z"
  },
  {
    "title": "Dishonesty and delusion",
    "description": "Earlier this week most of the Harvard Law School’s faculty signed a letter to their students, making essentially the same anodyne observations that were made by the deans of 79 law schools a few days earlier. Those observations consist of the — one would thin…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/dishonesty-and-delusion",
    "timestamp": "2025-04-02T13:25:22Z"
  },
  {
    "title": "These Cars—Chevrolet, Ford, Jeep And More—May Be More Expensive As Trump’s Auto Tariffs Take Effect Today",
    "description": "Trump reportedly warned some automakers not to raise the price of their vehicles in response to the tariffs.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/02/these-cars-chevrolet-ford-jeep-and-more-may-be-more-expensive-as-trumps-auto-tariffs-take-effect-today/",
    "timestamp": "2025-04-02T13:24:30Z"
  },
  {
    "title": "Zelenskiy Accuses Russia of 'Breaking Promises' Made to US",
    "description": "As President Donald Trump rushes toward securing a ceasefire between Russia and Ukraine, Ukraine’s President Volodymyr Zelenskiy accused Russia of of violating recent ceasefire agreements mediated by the US and called for sanctions on Moscow.\n“I believe that …",
    "link": "https://biztoc.com/x/471be82ba415dd01",
    "timestamp": "2025-04-02T13:24:13Z"
  },
  {
    "title": "Russia and Ukraine trade new accusations on breaches of energy truce",
    "description": "MOSCOW (Reuters) -Russia and Ukraine accused each other on Wednesday of launching new attacks against each other's energy facilities, in violation of a U.S.-brokered moratorium. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/02/russia-and-ukraine-trade-new-accusations-on-breaches-of-energy-truce",
    "timestamp": "2025-04-02T13:24:00Z"
  },
  {
    "title": "Why Trump’s Saudi trip matters for the Trump doctrine - analysis",
    "description": "Reports this week indicated that US President Donald Trump may visit Saudi Arabia in the coming months. This is important because it would be his first trip abroad as president. It will also be a repeat of a trip he took during his first term. During his firs…",
    "link": "https://freerepublic.com/focus/f-news/4308340/posts",
    "timestamp": "2025-04-02T13:23:21Z"
  },
  {
    "title": "The 1600: Dems to America—We're Not Dead Yet",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics editor Carlo Versano.",
    "link": "https://www.newsweek.com/1600-dems-americawere-not-dead-yet-2054218",
    "timestamp": "2025-04-02T13:22:15Z"
  },
  {
    "title": "Not Just Wisconsin: Democrats Score String of Local Victories Across US",
    "description": "The Democrats scored several key victories in local elections, unseating Republican-backed incumbents in Illinois and Wisconsin.",
    "link": "https://www.newsweek.com/democrats-election-victories-wisconsin-illinois-2054126",
    "timestamp": "2025-04-02T13:22:15Z"
  },
  {
    "title": "Tesla sales drop 13% in first quarter as Elon Musk backlash, aging models hurt demand",
    "description": "NEW YORK (AP) — Tesla sales declined in the first three months of the year, another sign that Elon Musk’s once high-flying electric car company is struggling to attract buyers. The drop of 13% is likely due to combination of factors, including its aging lineu…",
    "link": "https://financialpost.com/pmn/tesla-sales-drop-13-in-first-quarter-as-elon-musk-backlash-aging-models-hurt-demand",
    "timestamp": "2025-04-02T13:22:08Z"
  },
  {
    "title": "Nintendo Switch 2 Launches June 5",
    "description": "As part of the Nintendo Direct, Nintendo finally announced the release date and price for the Nintendo Switch 2. The system will launch on June 5. A price has not been shared as of yet during the ongoing Direct stream.A June release for the Switch 2 was previ…",
    "link": "https://www.gamespot.com/articles/nintendo-switch-2-launches-june-5/1100-6530537/",
    "timestamp": "2025-04-02T13:22:00Z"
  },
  {
    "title": "Emails Confirm Social Security Administration Canceled Maine Contracts As Political Payback",
    "description": "Acting commissioner Leland Dudek called Maine Gov. Janet Mills a “petulant child” for defying Donald Trump.",
    "link": "https://www.huffpost.com/entry/janet-mills-social-security-maine-leland-dudek_n_67ed2d99e4b0b937ab8f135c",
    "timestamp": "2025-04-02T13:21:30Z"
  },
  {
    "title": "NEW POLL: Americans Believe Trump Will Try for a Third Term by Whopping 2-to-1 Margin",
    "description": "President Donald Trump's claims that there are \"methods\" by which he could run for a third term are not being taken lightly by the electorate.\nThe post NEW POLL: Americans Believe Trump Will Try for a Third Term by Whopping 2-to-1 Margin first appeared on Med…",
    "link": "https://www.mediaite.com/news/new-poll-americans-believe-trump-will-try-for-a-third-term-by-whopping-2-to-1-margin/",
    "timestamp": "2025-04-02T13:20:51Z"
  },
  {
    "title": "Tesla reports 336,000 vehicle deliveries in first quarter, 13% drop from a year ago",
    "description": "Tesla reported a 13% year-over-year drop in first-quarter deliveries two days after the company's stock wrapped up its worst quarter since 2022.",
    "link": "https://www.cnbc.com/2025/04/02/tesla-tsla-q1-2025-vehicle-delivery-and-production-numbers.html",
    "timestamp": "2025-04-02T13:20:16Z"
  },
  {
    "title": "Democratic senator says most average Americans can’t find Greenland on map",
    "description": "Sen. Chris Coons called Trump's attempts to acquire Greenland 'insane' and 'unmoored.'",
    "link": "https://nypost.com/2025/04/02/media/democratic-senator-says-most-americans-cant-find-greenland-on-map/",
    "timestamp": "2025-04-02T13:17:03Z"
  },
  {
    "title": "Mary Lou McDonald tells Dáil that counter EU tariffs on the US are not in Ireland's interest",
    "description": "McDonald said it is crucial that there is no ‘knee jerk reaction’ from the EU.",
    "link": "https://www.thejournal.ie/mary-lou-mcdonald-trump-tariffs-eu-6665873-Apr2025/",
    "timestamp": "2025-04-02T13:16:46Z"
  },
  {
    "title": "Trump Immigration Order Could Cost Americans $3,000 Per Baby",
    "description": "Ending birthright citizenship would be chaotic and costly for many Americans due to new fees, paperwork requirements and other issues.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/04/02/trump-immigration-order-could-cost-americans-3000-per-baby/",
    "timestamp": "2025-04-02T13:16:38Z"
  },
  {
    "title": "Trump set to announce barrage of ‘reciprocal’ tariffs on what Trump has called ‘Liberation Day’",
    "description": "The new tariffs, coming on what Trump has called “Liberation Day,” are a bid to boost U.S. manufacturing and punish other countries for what he has said are years of unfair trade practices.",
    "link": "https://www.pbs.org/newshour/politics/trump-set-to-announce-barrage-of-reciprocal-tariffs-on-what-trump-has-called-liberation-day",
    "timestamp": "2025-04-02T13:14:30Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "U.S. stock futures are pointing lower as investors ready for today's tariffs announcement expected from President Donald Trump after markets close; Tesla (TSLA) is slated to report first-quarter deliveries amid a downturn for its stock; Visa (V) reportedly is…",
    "link": "https://biztoc.com/x/c3033fd4398d9768",
    "timestamp": "2025-04-02T13:13:56Z"
  },
  {
    "title": "Trump's tariff day live: What Canadians need to know",
    "description": "U.S. President Donald Trump is scheduled to unveil reciprocal tariffs today on America’s trading partners, including Canada, in what he calls “Liberation Day.”\nThe measures are meant to even things out with those who, in Trump’s eyes, have unfairly taken adva…",
    "link": "https://biztoc.com/x/674cb88c71eccddd",
    "timestamp": "2025-04-02T13:13:15Z"
  },
  {
    "title": "Iraqi Militia Warns Over U.S.-Iran War: \"Ignite the Entire Region\"",
    "description": "The warning from the powerful Iran-backed militia comes as President Donald Trump has threatened to bomb Iran",
    "link": "https://biztoc.com/x/4325b9117f61e778",
    "timestamp": "2025-04-02T13:13:13Z"
  },
  {
    "title": "Montreal unveils support measures for small businesses as Trump outlines tariff policy",
    "description": "On Wednesday afternoon, the City of Montreal announced new measures to help small and medium-sized businesses deal with Trump's tariffs. But opposition at Montreal's city hall describes them as \"recycled envelopes.\"",
    "link": "https://www.cbc.ca/news/canada/montreal/tariffs-montreal-small-medium-sized-businesses-1.7500173",
    "timestamp": "2025-04-02T13:12:25Z"
  },
  {
    "title": "Tesla deliveries are out — and they're far worse than expected",
    "description": "Elon Musk's EV maker reported just over 336,600 first-quarter deliveries, missing analyst expectations.",
    "link": "https://www.businessinsider.com/tesla-delivery-numbers-numbers-first-quarter-elon-musk-2025-4",
    "timestamp": "2025-04-02T13:11:56Z"
  },
  {
    "title": "Here’s What To Know About ‘Liberation Day’—From Announcement Time To What Trump May Target",
    "description": "“IT’S LIBERATION DAY IN AMERICA!,” Trump wrote in a 7:06 a.m. EDT post to his Truth Social site, referring to what he previously described as the “BIG ONE,” reciprocal tariffs.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/02/heres-what-to-know-about-liberation-day-from-announcement-time-to-what-trump-may-target/",
    "timestamp": "2025-04-02T13:11:18Z"
  },
  {
    "title": "After layoffs and funding problems, Head Start leaders fear what comes next",
    "description": "President Donald Trump's administration on Tuesday laid off scores of Health and Human Services employees, including many who ran the Head Start early education program. Preschool operators say they have received no communication from the Office of Head Start…",
    "link": "https://www.seattlepi.com/news/politics/article/after-layoffs-and-funding-problems-head-start-20254464.php",
    "timestamp": "2025-04-02T13:10:30Z"
  },
  {
    "title": "Canada election: Campaigns brace for Trump's sweeping 'Liberation Day' tariffs",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/canada-election-campaigns-brace-for-trumps-sweeping-liberation-day-tariffs-9.6708337",
    "timestamp": "2025-04-02T13:10:22Z"
  },
  {
    "title": "Eagles' Jeffrey Lurie explains decision to visit White House: 'Obvious choice' for a 'time-honored tradition'",
    "description": "Philadelphia did not go to the White House after its first Super Bowl win",
    "link": "https://www.cbssports.com/nfl/news/eagles-jeffrey-lurie-explains-decision-to-visit-white-house-obvious-choice-for-a-time-honored-tradition/",
    "timestamp": "2025-04-02T13:10:07Z"
  },
  {
    "title": "No Tariff Exemptions for American Farmers (David Frum/The Atlantic)",
    "description": "David Frum / The Atlantic:\nNo Tariff Exemptions for American Farmers  —  They voted for the tariffs when they voted for Trump.  —  American farmers are pleading for exemptions from President Donald Trump's tariffs.  Republican members of Congress from farm st…",
    "link": "https://www.memeorandum.com/250402/p33",
    "timestamp": "2025-04-02T13:10:00Z"
  },
  {
    "title": "Tesla sales plunge: Biggest decline in history | CNN Business",
    "description": "Tesla sales plunged 13% in the first three months of this year, as the company reported the largest drop in deliveries in its history by far, as backlash against CEO Elon Musk, and growing competition from other automakers’ electric vehicles, took a large bit…",
    "link": "https://www.cnn.com/2025/04/02/business/tesla-sales/index.html",
    "timestamp": "2025-04-02T13:09:31Z"
  },
  {
    "title": "After layoffs and funding problems, Head Start leaders fear what comes next",
    "description": "President Donald Trump's administration on Tuesday laid off scores of Health and Human Services employees, including many who ran the Head Start early education program",
    "link": "https://abcnews.go.com/US/wireStory/after-layoffs-funding-problems-head-start-leaders-fear-120408199",
    "timestamp": "2025-04-02T13:09:08Z"
  },
  {
    "title": "Tesla’s sales plummet 13 percent as Musk backlash grows",
    "description": "Amid growing fallout over Elon Musk’s involvement in the Trump administration, Tesla’s sales fell a staggering 13 percent in the first quarter of 2025 year over year.  The company said it produced a total of 362,615 vehicles in the first three months of the y…",
    "link": "https://www.theverge.com/news/641311/tesla-q1-2025-delivery-production-sales-slump-musk",
    "timestamp": "2025-04-02T13:07:06Z"
  },
  {
    "title": "Trade war should not be UK's first response to tariffs - PM",
    "description": "Sir Keir Starmer says he will rule nothing out as the government braces itself for new US tariffs.",
    "link": "https://www.bbc.com/news/articles/c4grm90119xo",
    "timestamp": "2025-04-02T13:05:48Z"
  },
  {
    "title": "Trump administration deports 100K illegal migrants since inauguration: report",
    "description": "The Trump administration has deported more than 100,000 illegal migrants in the 10 weeks since President Donald Trump returned to the White House on Jan. 20.",
    "link": "https://www.foxnews.com/us/trump-administration-deports-100k-illegal-migrants-since-inauguration-report",
    "timestamp": "2025-04-02T13:05:42Z"
  },
  {
    "title": "Tesla Reports Worst Quarterly Vehicle Deliveries Since 2022—Down 13% From Last Year",
    "description": "Down 13% from Q1 2024, this was the worst annual quarterly growth for Tesla since at least 2017.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/02/tesla-reports-worst-quarterly-vehicle-deliveries-since-2022-down-13-from-last-year/",
    "timestamp": "2025-04-02T13:04:56Z"
  },
  {
    "title": "Iraqi Militia Warns Over U.S.-Iran War: \"Ignite the Entire Region\"",
    "description": "The warning from the powerful Iran-backed militia comes as President Donald Trump has threatened to bomb Iran",
    "link": "https://www.newsweek.com/iran-nuclear-trump-bombing-iraq-2054103",
    "timestamp": "2025-04-02T13:03:44Z"
  },
  {
    "title": "Trump team has reportedly still not reached a firm decision on tariff plans and were hashing out options in Tuesday meetings",
    "description": "President Trump is set to unveil potentially the biggest hike in U.S. import duties since the Smoot-Hawley Tariff Act nearly a century ago, and reports suggest staffers are still jockeying for a chance to change his mind up until the final moment.\nPresident D…",
    "link": "https://biztoc.com/x/706f2b5e8ba79910",
    "timestamp": "2025-04-02T13:02:26Z"
  },
  {
    "title": "In first big test of Trump’s second term, voters tell GOP what it didn’t want to hear",
    "description": "After Election Day 2024, many suggested that Republicans had entered an era of electoral dominance. Six months later, it's Democrats who are celebrating.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/first-big-test-trumps-second-term-voters-tell-gop-didnt-want-hear-rcna199243",
    "timestamp": "2025-04-02T13:02:16Z"
  },
  {
    "title": "New York Real Estate’s Q1 2025: A Market In Gradual Recovery",
    "description": "For the New York real estate market, the first quarter came in like a lion and mostly just kept on roaring.",
    "link": "https://www.forbes.com/sites/fredpeters/2025/04/02/new-york-real-estates-q1-2025-a-market-in-gradual-recovery/",
    "timestamp": "2025-04-02T13:01:50Z"
  },
  {
    "title": "Judge: Qatar Tried to Bribe Israeli Officials to Downplay Egypt's Role in Negotiations",
    "description": "Several aides to Israeli Prime Minister Benjamin Netanyahu are accused of taking money from Qatar in return for portraying that regime positively and downplaying Egypt's role as a mediator in hostage talks, a judge said Tuesday.\nThe post Judge: Qatar Tried to…",
    "link": "https://www.breitbart.com/middle-east/2025/04/02/judge-qatar-tried-to-bribe-israeli-officials-to-downplay-egypts-role-in-negotiations/",
    "timestamp": "2025-04-02T13:01:48Z"
  },
  {
    "title": "Trump's tariff day live: What Canadians need to know",
    "description": "Donald Trump will reveal tariffs today. Join our live coverage for the latest 'Liberation Day' developments and how they will affect Canada",
    "link": "https://financialpost.com/news/economy/trumps-tariff-day-live-what-canadians-need-to-know",
    "timestamp": "2025-04-02T13:00:39Z"
  },
  {
    "title": "ABLECHILD: Butler Assassination Attempt Documents Locked Down in Congressman Kelly’s Office, as Case Goes Cold on Link to ‘Crooks’",
    "description": "Congressman Mike Kelly faces mounting scrutiny for withholding critical documents related to the Butler assassination attempt, raising serious questions about transparency and accountability in a case shrouded in controversy and unanswered questions.\nThe post…",
    "link": "https://www.thegatewaypundit.com/2025/04/ablechild-butler-assassination-attempt-documents-locked-down-congressman/",
    "timestamp": "2025-04-02T13:00:37Z"
  },
  {
    "title": "Lawfare Isn’t Beaten—in France or America",
    "description": "Elections are supposed to be decided at the ballot box, not in the courtroom—unless you’re French or, in this country, a liberal. What a judge... Read More\nThe post Lawfare Isn’t Beaten—in France or America appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/04/02/lawfare-isnt-beaten-in-france-or-america/",
    "timestamp": "2025-04-02T13:00:00Z"
  },
  {
    "title": "Nancy Pelosi urged Biden not to debate Trump in a 'play to his ego', book says",
    "description": "The authors of a new book about the wild 2024 election say Nancy Pelosi urged President Biden not to debate Trump in what turned out to be a historic turning point.",
    "link": "https://www.foxnews.com/media/nancy-pelosi-urged-biden-not-debate-trump-play-his-ego-book-says",
    "timestamp": "2025-04-02T12:57:11Z"
  },
  {
    "title": "Jonah Goldberg Rips Fox’s Faulkner for Telling Worried Americans to Support Tariffs Like ‘War Effort’: ‘Ridiculous Argument in Every Particular’",
    "description": "CNN conservative commentator Jonah Goldberg ripped Fox News host Harris Faulkner for comparing President Donald Trump's tariffs to a \"war effort.\"\nThe post Jonah Goldberg Rips Fox’s Faulkner for Telling Worried Americans to Support Tariffs Like ‘War Effort’: …",
    "link": "https://www.mediaite.com/politics/jonah-goldberg-rips-foxs-faulkner-for-telling-worried-americans-to-support-tariffs-like-war-effort-ridiculous-argument-in-every-particular/",
    "timestamp": "2025-04-02T12:56:53Z"
  },
  {
    "title": "Elon Is A Bigger Loser Today Than He Was Yesterday. You Did That, Wisconsin.",
    "description": "Let's do it some more, America!",
    "link": "https://www.wonkette.com/p/elon-is-a-bigger-loser-today-than",
    "timestamp": "2025-04-02T12:55:52Z"
  },
  {
    "title": "Trump is set to announce 'reciprocal' tariffs in a risky move that could reshape the economy",
    "description": "President Donald Trump has announced far-reaching new tariffs on nearly all U.S. trading partners — including a 34% tax on imports from China and 20% on the European Union, among others.",
    "link": "https://www.wsls.com/news/politics/2025/04/02/trump-is-set-to-announce-reciprocal-tariffs-in-a-risky-move-that-could-reshape-the-economy/",
    "timestamp": "2025-04-02T12:54:26Z"
  },
  {
    "title": "Gold price today: Experts predict likely gold rate following Donald Trump's 'Liberation Day' Tariffs announcement",
    "description": "Donald Trump has been promoting April 2 as \"Liberation Day\" and he is expected to introduce sweeping new tariffs on multiple countries.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-today-experts-predict-likely-gold-rate-following-donald-trumps-liberation-day-tariffs-announcement/articleshow/119908360.cms",
    "timestamp": "2025-04-02T12:54:26Z"
  },
  {
    "title": "Trump Reveals Real Reason for His Extreme Tariffs",
    "description": "Donald Trump just made the rationale for his tariff “Liberation Day” crystal clear: revenge.\r\nIn a post on Truth Social late Tuesday, the president said that the tariffs were his administration’s “fight” against Democrats’ “wild and flagrant push to not penal…",
    "link": "https://newrepublic.com/post/193462/donald-trump-real-reason-tariffs-canada",
    "timestamp": "2025-04-02T12:54:23Z"
  },
  {
    "title": "Why Trump’s Saudi trip matters for the Trump doctrine",
    "description": "Gulf countries trust the US administration under US President Donald Trump a bit more than what they saw under Biden and Obama.",
    "link": "https://www.jpost.com/american-politics/article-848573",
    "timestamp": "2025-04-02T12:53:43Z"
  },
  {
    "title": "European Stocks Fall as Trump Tariff Announcement Looms Over Markets | The Opening Trade 04/02",
    "description": "Europe's Stoxx 600 Index fell hours before President Donald Trump's tariffs announcement in the White House Rose Garden, with ...",
    "link": "https://biztoc.com/x/278606f4b024051f",
    "timestamp": "2025-04-02T12:52:27Z"
  },
  {
    "title": "Israel’s Netanyahu heads to Hungary in defiance of ICC arrest warrant",
    "description": "Prime Minister Viktor Orban has made it clear Hungary will not arrest the Israeli PM despite an international warrant.",
    "link": "https://www.aljazeera.com/news/2025/4/2/israels-netanyahu-heads-to-hungary-in-defiance-of-icc-arrest-warrant",
    "timestamp": "2025-04-02T12:51:49Z"
  },
  {
    "title": "What Exactly Is a Trade Deficit?",
    "description": "5 min ago\nWhat Exactly Is a Trade Deficit?\nPresident Donald Trump cites trade deficits as a justification for tariffs, but what does he mean?\nA trade deficit is the difference between how much Americans are buying from another country and how much the people …",
    "link": "https://biztoc.com/x/d504890470e4b2cb",
    "timestamp": "2025-04-02T12:51:19Z"
  },
  {
    "title": "Wisconsin, Florida elections get spin treatment as Dems, GOP look ahead to 2026 midterms",
    "description": "A liberal judge won big in Wisconsin's April 1 Supreme Court election while the GOP held two Florida House seats. Both parties are spinning the results ahead of the 2026 midterm cycle.",
    "link": "https://www.foxnews.com/politics/wisconsin-florida-elections-get-spin-treatment-dems-gop-look-ahead-2026-midterms",
    "timestamp": "2025-04-02T12:51:10Z"
  },
  {
    "title": "Were Wisconsin, Florida elections referendum on Trump, Musk? And what they mean for the 2026 midterms",
    "description": "Were Wisconsin, Florida elections referendum on Trump, Musk? And what they mean for the 2026 midterms",
    "link": "https://www.foxnews.com/politics/split-decisions-wisconsin-florida-what-mean-2026-midterms",
    "timestamp": "2025-04-02T12:51:10Z"
  },
  {
    "title": "Trump set to unleash 'Liberation Day' tariffs",
    "description": "WASHINGTON: United States President Donald Trump is poised to unveil sweeping new \"Liberation Day\" tariffs on Wednesday (Apr 2), but kept the world guessing until the las",
    "link": "https://www.channelnewsasia.com/world/trump-set-unleash-liberation-day-tariffs-5040071",
    "timestamp": "2025-04-02T12:51:00Z"
  },
  {
    "title": "‘Liberation day’: what is a tariff and why do they matter?",
    "description": "Donald Trump’s threats to impose widescale import levies have spooked governments, investors and analysts alike. Here’s why …\nDonald Trump has said “tariffs” is the most beautiful word in the dictionary.\nThe US president is expected to unveil his latest round…",
    "link": "https://biztoc.com/x/c99970914dc02102",
    "timestamp": "2025-04-02T12:50:50Z"
  },
  {
    "title": "Wednesday, April 2, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/wednesday-april-2-2025/",
    "timestamp": "2025-04-02T12:50:38Z"
  },
  {
    "title": "World leaders secretly talking to Putin – Vucic",
    "description": "At least two global leaders maintained behind-the-scenes contact with Putin despite the Ukraine conflict, the Serbian president says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615140-world-leaders-secretly-talking-putin/",
    "timestamp": "2025-04-02T12:49:33Z"
  },
  {
    "title": "LATEST LEAK: Mike Waltz, Aide Accused of Using Gmail For Official Government Communication – But These Same People Said Nothing When Obama, Hillary and Joe Biden Were Caught Using Gmail",
    "description": "Another day, another leak. President Trump’s National Security Advisor Mike Waltz and others in the National Security Council have used Gmail to conduct official government business according to a leak to The Washington Post. Mike Waltz is already under fire …",
    "link": "https://freerepublic.com/focus/f-bloggers/4308333/posts",
    "timestamp": "2025-04-02T12:49:32Z"
  },
  {
    "title": "New York's casino sweepstakes could put $115M in Donald Trump's pocket",
    "description": "A high-stakes race to decide who will get to build a casino in New York City might end up with one famous former resident hitting a $115 million jackpot: President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/new-yorks-casino-sweepstakes-put-115m-donald-trumps-120406881",
    "timestamp": "2025-04-02T12:48:35Z"
  },
  {
    "title": "Trump Sends Hundreds of Immigrants to Brutal Salvadoran Prison as Mass Deportations Expand",
    "description": "Since President Donald Trump took office, the U.S. has expelled hundreds of immigrants and asylum seekers to El Salvador without due process to be detained at the supermax mega-prison complex known as CECOT, with many of them accused of belonging to gangs lar…",
    "link": "https://www.democracynow.org/2025/4/2/trump_deportations_el_salvador_immigrants",
    "timestamp": "2025-04-02T12:48:02Z"
  },
  {
    "title": "On Liberation Day, if Donald Trump unleashes tariffs, here are the products Canada will use to punish America heavily",
    "description": "Three-quarters of Canadians support taxing essential resources like oil, natural gas, electricity, and potash exported to the US if President Trump implements additional tariffs. Many Canadians also back the idea of canceling the purchase of US-made F-35 figh…",
    "link": "https://economictimes.indiatimes.com/news/international/us/on-liberation-day-if-donald-trump-unleashes-tariffs-here-are-the-products-canada-will-use-to-punish-america-heavily/articleshow/119907299.cms",
    "timestamp": "2025-04-02T12:47:55Z"
  },
  {
    "title": "With its executive order targeting the Smithsonian, the Trump administration opens up a new front in the history wars",
    "description": "Most recent debates center on how much attention should be given to the history of the nation’s accomplishments over its darker chapters.",
    "link": "https://theconversation.com/with-its-executive-order-targeting-the-smithsonian-the-trump-administration-opens-up-a-new-front-in-the-history-wars-253397",
    "timestamp": "2025-04-02T12:47:53Z"
  },
  {
    "title": "US ignoring Ukraine’s energy ceasefire violations – Kremlin",
    "description": "Washington is ignoring Kiev’s violations of the US-mediated moratorium on attacks against energy infrastructure, Dmitry Peskov has said. Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615136-peskov-energy-ceasefire-violations/",
    "timestamp": "2025-04-02T12:47:35Z"
  },
  {
    "title": "Leftist Twitch steamer, U.S citizen, says CBP searched phone at Mexico border",
    "description": "A self-described “leftist shitposter” said he had his phone searched while coming back into the U.S. from Mexico on March 31. \n\n\nThe search comes as reports of Customs and Border Protection (CBP) searching travelers' phones when entering the United States inc…",
    "link": "https://www.dailydot.com/debug/leftist-twitch-streamer-phone-search-border-patrol/",
    "timestamp": "2025-04-02T12:47:19Z"
  },
  {
    "title": "Will TikTok Disappear Again? Here's What You Need to Know Just in Case",
    "description": "The app has until this Saturday to find an appropriate buyer.",
    "link": "https://www.cnet.com/tech/services-and-software/will-tiktok-disappear-again-heres-what-you-need-to-know-just-in-case/",
    "timestamp": "2025-04-02T12:45:08Z"
  },
  {
    "title": "How many US dollars does XRP transfer per day?",
    "description": "XRP (XRP), the native cryptocurrency of the XRP Ledger (XRPL), has been touted by proponents as a high-speed, low-cost solution for cross-border payments. But just how much value flows through the network on a daily basis? Let’s examine.XRP volumes have risen…",
    "link": "https://cointelegraph.com/news/how-many-us-dollars-does-xrp-transfer-per-day",
    "timestamp": "2025-04-02T12:45:00Z"
  },
  {
    "title": "Putin's investment envoy Dmitriev may visit Washington, Kremlin says",
    "description": "MOSCOW (Reuters) - A visit by Russian President Vladimir Putin's investment envoy, Kirill Dmitriev, to the United States for talks with members of Donald Trump's administration is possible, the Kremlin said on Wednesday, but declined to give any further detai…",
    "link": "https://www.thestar.com.my/news/world/2025/04/02/putin039s-investment-envoy-dmitriev-may-visit-washington-kremlin-says",
    "timestamp": "2025-04-02T12:45:00Z"
  },
  {
    "title": "'Humiliating, degrading': US health employees turned away after showing up to work, recall how they learnt of layoffs",
    "description": "The Trump administration carried out mass layoffs across the Department of Health and Human Services on Tuesday, aiming to slash around 10,000 full-time jobs. HHS employees learnt about the layoffs when their ID badges stopped working. Elon Musk’s Department …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/humiliating-degrading-us-health-employees-turned-away-after-showing-up-to-work-recall-how-they-learnt-of-layoffs/articleshow/119907887.cms",
    "timestamp": "2025-04-02T12:44:42Z"
  },
  {
    "title": "Sentiment Shift in Bitcoin as $80K Put Emerges as Most Popular Bet",
    "description": "BTC put bias is strongest since the U.S. regional banking crisis of early 2023, according to one observer.",
    "link": "https://www.coindesk.com/markets/2025/04/02/bitcoin-market-experiences-sentiment-shift-as-usd80k-put-emerges-as-most-popular-bet",
    "timestamp": "2025-04-02T12:44:01Z"
  },
  {
    "title": "Trump’s reciprocal tariffs take effect tonight: 4 ways Indian stock markets could be hit",
    "description": "Trump’s reciprocal tariffs are set to disrupt global trade, causing short-term volatility. Indian markets may see FPI outflows, rupee fluctuations, and pressure on export-driven sectors like auto, pharma, and IT. However, domestic consumption remains strong, …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-reciprocal-tariffs-take-effect-tonight-4-ways-indian-stock-markets-could-be-hit/articleshow/119908092.cms",
    "timestamp": "2025-04-02T12:42:42Z"
  },
  {
    "title": "Israeli PM Netanyahu to visit Orbán in Hungary, defying international arrest warrant",
    "description": "Israeli Prime Minister Benjamin Netanyahu is traveling to Hungary despite an International Criminal Court arrest warrant against him over the war in Gaza",
    "link": "https://abcnews.go.com/International/wireStory/israeli-leader-benjamin-netanyahu-visit-orbn-hungary-defying-120405932",
    "timestamp": "2025-04-02T12:42:39Z"
  },
  {
    "title": "Donald Trump’s ‘Liberation Day’: Which country will pay the highest price under the new tariff plans?",
    "description": "Donald Trump has announced a 25% import tax on foreign-made cars to boost the U.S. auto industry, creating potential financial trouble for German car manufacturers like Volkswagen, BMW, Mercedes, and Porsche. Germany, a major exporter to the U.S., faces signi…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/donald-trumps-liberation-day-which-country-will-pay-the-highest-price-under-the-new-tariff-plans/articleshow/119907784.cms",
    "timestamp": "2025-04-02T12:40:39Z"
  },
  {
    "title": "The self-defeating tragedy of the Trump tariffs",
    "description": "An anti-tariff demonstration in Montpelier, Vermont. | ﻿John Lazenby/UCG/Universal Images Group via Getty Images\nThe day this article goes up, April 2, has been pegged by President Donald Trump as “Liberation Day”: the day his suite of tariffs will go into ef…",
    "link": "https://biztoc.com/x/862458cf4dc1f09c",
    "timestamp": "2025-04-02T12:40:02Z"
  },
  {
    "title": "'Not a winning message': Ex-Trump aide warns tariffs will 'tank' markets and poll numbers",
    "description": "President Donald Trump's sweeping tariffs are set to snap into place Wednesday – which he calls \"Liberation Day\" – but one of his former aides warned those could sink his popularity.The president is due to announce his tariff plan in a Rose Garden address, wh…",
    "link": "https://www.rawstory.com/liberation-day-donald-trump/",
    "timestamp": "2025-04-02T12:39:57Z"
  },
  {
    "title": "Trump’s Trust Opens the Door to Tapping $2.1 Billion Media Stake",
    "description": "(Bloomberg) -- A trust overseeing Donald Trump’s $2.1 billion stake in the media company that owns Truth Social is paving the way to cash in on its...",
    "link": "https://finance.yahoo.com/news/trump-trust-opens-door-tapping-123906614.html",
    "timestamp": "2025-04-02T12:39:06Z"
  },
  {
    "title": "California Misses Out on Medicaid Millions as Newsom Blows Thru Deadline",
    "description": "California will lose millions of dollars in federal matching funds for the state's Medicaid program, Medi-Cal, after Governor Gavin Newsom's administration failed to fill out the necessary paperwork by a March 31 deadline.\nThe post California Misses Out on Me…",
    "link": "https://www.breitbart.com/politics/2025/04/02/california-misses-out-on-medicaid-millions-as-newsom-blows-thru-deadline/",
    "timestamp": "2025-04-02T12:37:55Z"
  }
]