[
  {
    "title": "Microsoft Plans to Urge Trump to Loosen up Restrictions on Chip Import",
    "description": "Microsoft is planning to request Trump to ease up the restrictions imposed on chip export by Biden. It wants at least the allies of the US, such as India, Switzerland, and Israel, to be able to freely import US chips. However, as per reports, the Trump admini…",
    "link": "https://techreport.com/news/microsoft-plans-to-urge-trump-to-loosen-up-restrictions-on-chip-import/",
    "timestamp": "2025-03-03T05:12:34Z"
  },
  {
    "title": "Kremlin praises Trump’s foreign policy shift, signals approval of US-Russia ties",
    "description": "Russia appears to back Trump’s stance on Ukraine as tensions between Kyiv and Washington grow.",
    "link": "https://www.jpost.com/international/article-844419",
    "timestamp": "2025-03-03T05:12:34Z"
  },
  {
    "title": "US Defense Chief Pauses Cyber Operations Against Russia: Reports",
    "description": "US Defense Secretary Pete Hegseth has ordered a pause on all of the country&#039;s cyber operations against Russia, including offensive actions, multiple US media reports said on Sunday.",
    "link": "https://www.ndtv.com/world-news/us-defense-chief-pauses-cyber-operations-against-russia-reports-7834745",
    "timestamp": "2025-03-03T05:09:32Z"
  },
  {
    "title": "Real Christianity vs. White “Christian” Nationalist Trump on the Treatment of the Poor",
    "description": "( Tomdispatch.com ) - “There has almost always been an outright hostility that is shown towards people of the Christian faith,” House Speaker Mike Johnson said on a podcast recently. He was talking with Tony Perkins, a former Louisiana lawmaker and president …",
    "link": "https://www.juancole.com/2025/03/christianity-christian-nationalist.html",
    "timestamp": "2025-03-03T05:06:31Z"
  },
  {
    "title": "How Trump Can Succeed Where Reagan and Gore Failed",
    "description": "Headcounts aren’t the be-all and end-all of reform.\nThe post How Trump Can Succeed Where Reagan and Gore Failed appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/how-trump-can-succeed-where-reagan-and-gore-failed/",
    "timestamp": "2025-03-03T05:05:00Z"
  },
  {
    "title": "Neil Young Plots Free Ukraine Gig Ahead of European Tour",
    "description": "Neil Young will truly be \"Rockin' in the Free World,\" announcing plans for a free Ukraine gig ahead of his European tour.",
    "link": "http://www.billboard.com/music/music-news/neil-young-plots-free-ukraine-gig-european-tour-1235913404/",
    "timestamp": "2025-03-03T05:04:34Z"
  },
  {
    "title": "The Trump Administration Said These Aid Programs Saved Lives. It Canceled Them Anyway",
    "description": "by Anna Maria Barry-Jester and Brett Murphy ( ProPublica ) - After the Trump administration moved to freeze nearly $60 billion in foreign aid in January, officials like Secretary of State Marco Rubio repeatedly assured Americans that lifesaving operations wou…",
    "link": "https://www.juancole.com/2025/03/administration-programs-canceled.html",
    "timestamp": "2025-03-03T05:04:05Z"
  },
  {
    "title": "Tougher calls ahead: Five questions for the ECB",
    "description": "The European Central Bank is set to cut rates again on Thursday, but investors haven't been this unsure in a while on what comes next.  U.S. tariff risks are...",
    "link": "https://finance.yahoo.com/news/tougher-calls-ahead-five-questions-050350051.html",
    "timestamp": "2025-03-03T05:03:50Z"
  },
  {
    "title": "Bridget Brink: A Hawkish Holdout in Trump’s State Department?",
    "description": "Personnel battles continue at Foggy Bottom, with the U.S. ambassador to Kiev drawing additional scrutiny.\nThe post Bridget Brink: A Hawkish Holdout in Trump’s State Department? appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/bridget-brink-a-hawkish-holdout-in-trumps-state-department/",
    "timestamp": "2025-03-03T05:03:00Z"
  },
  {
    "title": "China targets U.S. agricultural products over Trump tariff threat: report",
    "description": "China is preparing countermeasures against fresh U.S. import tariffs set to take effect on Tuesday, China's state-backed Global Times reported, with American agricultural exports likely in Beijing's cross hairs. U.S. President Donald Trump last week threatene…",
    "link": "https://japantoday.com/category/world/china-targets-us-agricultural-products-over-trump-tariff-threat-global-times-says",
    "timestamp": "2025-03-03T05:02:35Z"
  },
  {
    "title": "Conan O’Brien takes a dig at Donald Trump with ‘Anora’ Joke at the Oscars 2025",
    "description": "Oscars 2025: Conan O'Brien kept his Oscar monologue light, but later slipped in a sharp joke about Anora, suggesting that Americans enjoy seeing someone stand up to a Russian—an apparent dig at Donald Trump's recent meeting with Zelensky. The audience erupted…",
    "link": "https://economictimes.indiatimes.com/news/international/us/conan-obrien-takes-a-dig-at-donald-trump-with-anora-joke-at-the-oscars-2025/articleshow/118674221.cms",
    "timestamp": "2025-03-03T05:00:46Z"
  },
  {
    "title": "In the vanguard:  Eastern Europe’s military spending efforts",
    "description": "These countries, once dismissed as junior partners, are now in the vanguard of NATO, outpacing Western giants such as Germany and France in percentage terms.",
    "link": "https://www.euractiv.com/section/politics/news/in-the-vanguard-eastern-europes-spending-efforts/",
    "timestamp": "2025-03-03T05:00:43Z"
  },
  {
    "title": "The Geopolitics of Peace",
    "description": "Reprinted from Consortium News. This is an edited transcript of Professor Jeffrey Sachs’ speech in the European Parliament at an event titled “The Geopolitics of Peace,” hosted by former U.N. Assistant Secretary General and current BSW MEP Michael von der Sch…",
    "link": "https://original.antiwar.com/jeffrey_sachs/2025/03/02/the-geopolitics-of-peace/",
    "timestamp": "2025-03-03T05:00:28Z"
  },
  {
    "title": "SLOCs and Chokepoints: Panama, Greenland, Canada – and Indigenous Peoples",
    "description": "Early into his second term as US President, Donald Trump threatened to seize control of the Panama Canal, Greenland, and Canada, possibly through military force. To justify seizing the Canal, Trump lamely asserted that the US has been subjected to “unfair” tr…",
    "link": "https://original.antiwar.com/marc_sills/2025/03/02/slocs-and-chokepoints-panama-greenland-canada-and-indigenous-peoples/",
    "timestamp": "2025-03-03T05:00:17Z"
  },
  {
    "title": "Irish manufacturing activity accelerates at fastest pace in year",
    "description": "Latest increase in total new work the fastest recorded since May 2022",
    "link": "https://www.irishtimes.com/business/2025/03/03/irish-manufacturing-activity-accelerates-at-fastest-pace-in-year/",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "Fonda disproves the adage age brings wisdom",
    "description": "To the phrase “with age comes wisdom,” Irish poet and playwright Oscar Wilde is credited with adding the caveat, “but sometimes age comes alone.",
    "link": "https://www.americanthinker.com/blog/2025/03/fonda_disproves_the_adage_age_brings_wisdom.html",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "Shock, Rattle, and Awe",
    "description": "Every Republican president starts with distinct disadvantages. He inherits a largely disloyal and subversive federal bureaucracy, can expect nothing but hostile media coverage, and will be forced to battle for every inch against partisan judges who d...",
    "link": "https://www.americanthinker.com/articles/2025/03/shock_rattle_and_awe.html",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "Zelenskyy and the Future of NATO",
    "description": "Volodymyr Zelenskyy’s childish histrionics and ultimatums in the Oval Office directed at President Trump’s efforts to bring an end to the most devastating war on the continent of Europe since World War II are reflective of the European de...",
    "link": "https://www.americanthinker.com/articles/2025/03/zelenskyy_and_the_future_of_nato.html",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "Canada, Europe diss, threaten U.S.",
    "description": "I have always been fond of Canada—and Canadians. I have always had respect for the beauty and history of Europe.\r\n\r\nBut sadly, I have started losing that affinity.\r\n\r\nCanada and the E.U. have recently been treating the United States like a baby...",
    "link": "https://www.americanthinker.com/blog/2025/03/canada_europe_diss_threaten_u_s.html",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "Let’s hear it for the girls!",
    "description": "Recently, The State of Maine was in the national spotlight when a testy exchange between President Donald Trump and Maine governor Janet Mills occurred at the National Governors Association Winter conference.\r\n\r\nPresident Trump had recently signed an...",
    "link": "https://www.americanthinker.com/blog/2025/03/let_s_hear_it_for_the_girls.html",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "You foolish little Z",
    "description": "Most of us are still recovering from what we saw on TV on Friday. It's amazing just how foolish Zelensky looks every second, every minute that ticks by.\r\n\r\nMaybe he just read his own press clippings too much, as John Kass wrote:\r\n\r\n\r\nTh...",
    "link": "https://www.americanthinker.com/blog/2025/03/you_foolish_little_z.html",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "One Health: The New Godless Quasi-Religion that Ranks Humans Below Nature",
    "description": "A new, Godless, quasi-religion—One Health—is being thrust upon the world. Its apostles say it will save humanity, or rather, life itself. Allied with Marxism in its denigration of the “exploitive nature of capitalism” as is de...",
    "link": "https://www.americanthinker.com/articles/2025/03/one_health_the_new_godless_quasi_religion_that_ranks_humans_below_nature.html",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "English as our official language",
    "description": "On March 1, 2025, President Donald Trump signed an executive order declaring English the official language of the United States—a historic act that reverberates with the timbre of our nation’s founding. This is not mere policy; it is a cl...",
    "link": "https://www.americanthinker.com/blog/2025/03/english_as_our_official_language.html",
    "timestamp": "2025-03-03T05:00:00Z"
  },
  {
    "title": "트럼프 1타 강사 원 포인트 특강",
    "description": "Democrats say that House Republicans voted to enact huge cuts to Medicaid. Republicans say they did no such thing. @mattyglesias adjudicates and finds the Democrats win on substance (via @opinion) https://t.co/9dtR9Ww58e— Bloomberg Economics (@economics) Marc…",
    "link": "https://ryueyes11.tistory.com/511513",
    "timestamp": "2025-03-03T04:59:52Z"
  },
  {
    "title": "From Handshake To Meltdown, How Trump And Zelensky Meet Went Wrong",
    "description": "It all seemed to be going so well. Then things between Donald Trump and Volodymyr Zelensky went jaw-droppingly wrong, jaw-droppingly fast.",
    "link": "https://www.ndtv.com/world-news/from-handshake-to-meltdown-how-donald-trump-and-volodymyr-zelensky-meet-went-wrong-7834691",
    "timestamp": "2025-03-03T04:58:22Z"
  },
  {
    "title": "Zelensky says ‘will not be simple’ to replace him as Ukraine leader",
    "description": "Volodymyr Zelensky told British media Sunday it would not be easy to replace him as Ukraine’s president, but repeated his offer to step down in exchange for NATO membership for his war-torn country. US Republicans had suggested he may have to resign after US …",
    "link": "https://www.digitaljournal.com/world/zelensky-says-will-not-be-simple-to-replace-him-as-ukraine-leader/article",
    "timestamp": "2025-03-03T04:57:20Z"
  },
  {
    "title": "4 winners and 3 losers from a madcap Oscars",
    "description": "It won’t go down as the most exciting Oscars on record — there was no slap or envelope mix-up after all — but for this year’s Academy Awards, ending an unexpectedly cacophonous awards season with a smooth, calamity-free ceremony clocking in at under four hour…",
    "link": "https://www.vox.com/culture/402227/oscars-2025-winners-losers-anora-mikey-madison-adrien-brody",
    "timestamp": "2025-03-03T04:54:48Z"
  },
  {
    "title": "Oscars Review: Conan O’Brien and Company Find the Right Delicate Balance in a Chaotic Climate",
    "description": "Faced with a higher-than-usual degree of difficulty, the 97th Academy Awards dragged a bit but mostly stuck the landing\nThe post Oscars Review: Conan O’Brien and Company Find the Right Delicate Balance in a Chaotic Climate appeared first on TheWrap.",
    "link": "https://www.thewrap.com/oscars-review-conan-obrien-host/",
    "timestamp": "2025-03-03T04:54:14Z"
  },
  {
    "title": "Rubio says Trump would be ‘on his way to the Nobel Peace Prize’ if he were a Democrat - The Hill",
    "description": "Rubio says Trump would be ‘on his way to the Nobel Peace Prize’ if he were a DemocratThe Hill Marco Rubio blasts critics for demonizing 'peacemaker' Trump: 'It's only a bad thing when it's Donald Trump'Fox News 'This Week' Transcript 3-2-25: Secretary of Stat…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176596435",
    "timestamp": "2025-03-03T04:52:52Z"
  },
  {
    "title": "Christopher Luxon trusts Donald Trump, believes United States still ‘reliable’ after Ukraine Volodymyr Zelenskyy blow-up",
    "description": "Meanwhile, Labour's Chris Hipkins purposefully dodged a key question.",
    "link": "https://www.nzherald.co.nz/nz/politics/christopher-luxon-trusts-donald-trump-believes-united-states-still-reliable-after-ukraine-volodymyr-zelenskyy-blow-up/Z7J76GPZKFGBJDQAUQJB4BFREM/",
    "timestamp": "2025-03-03T04:52:01Z"
  },
  {
    "title": "Ukrainian church in Oklahoma reacts to meeting between President Trump and President Zelenskyy",
    "description": "Oklahoma's Ukrainian community expresses outrage over President Trump's meeting with Ukraine President Zelenskyy.",
    "link": "https://www.koco.com/article/ukrainian-church-oklahoma-meeting-trump-zelenskyy/64004791",
    "timestamp": "2025-03-03T04:49:57Z"
  },
  {
    "title": "Iranian lawmakers impeach Finance Minister as rial plummets",
    "description": "Iran’s parliament votes to remove Finance Minister Abdolnasser Hemmati from office. 182 out of 273 lawmakers support the dismissal.",
    "link": "https://www.israelnationalnews.com/news/404776",
    "timestamp": "2025-03-03T04:49:13Z"
  },
  {
    "title": "Improvement in Chinese manufacturing activity boosts crude oil prices",
    "description": "May Brent oil futures were at $73.16, up by 0.48 per cent, and April crude oil futures on WTI (West Texas Intermediate) were at $70.11, up by 0.50 per cent",
    "link": "https://www.thehindubusinessline.com/markets/commodities/improvement-in-chinese-manufacturing-activity-boosts-crude-oil-prices/article69284372.ece",
    "timestamp": "2025-03-03T04:48:47Z"
  },
  {
    "title": "Trump takes actions to increase lumber supplies and curb wood imports",
    "description": "President Donald Trump has signed a pair of actions to increase domestic lumber production",
    "link": "https://abcnews.go.com/Business/wireStory/trump-takes-actions-increase-lumber-supplies-curb-wood-119332405",
    "timestamp": "2025-03-03T04:46:30Z"
  },
  {
    "title": "Cardano Surges 57%, Whales Pile On XRP, Solana: Here's How The 3 Altcoins Reacted To Inclusion In US Crypto Reserve",
    "description": "Large-cap altcoins XRP, Solana, and Cardano topped the market gainers list Sunday after President Donald Trump confirmed their inclusion in a U.S. strategic cryptocurrency reserve.\nWhat happened: Trump announced that the Presidential Working Group is moving f…",
    "link": "https://biztoc.com/x/6031b2cb3c4602f4",
    "timestamp": "2025-03-03T04:41:16Z"
  },
  {
    "title": "Anora wins 5 Oscars including best picture, director, actress at 97th Academy Awards",
    "description": "<![CDATA[ Director Sean Baker’s tale of an erotic dancer who elopes with the son of a Russian oligarch was made for just US$6 million (S$8.09 million). ]]>",
    "link": "https://cnalifestyle.channelnewsasia.com/entertainment/anora-wins-5-oscars-including-best-picture-director-actress-97th-academy-awards-461011",
    "timestamp": "2025-03-03T04:39:59Z"
  },
  {
    "title": "Trump extends sanctions against Russia",
    "description": "President Trump extended sanctions against Russia. Virtually missing from MSM as it does not fit the \"Trump loves Putin\" narrative. EO at link.",
    "link": "https://freerepublic.com/focus/f-news/4301660/posts",
    "timestamp": "2025-03-03T04:35:08Z"
  },
  {
    "title": "Fox News: Democrats conspiring to end cursive writing so kids can't read Constitution - NewsBreak",
    "description": "Fox News hosts posited that Democrats were conspiring to end cursive writing in schools so children are unable to read the U.S. Constitution. During a Sund",
    "link": "https://www.newsbreak.com/share/3836595433681-fox-news-democrats-conspiring-to-end-cursive-writing-so-kids-can-t-read-constitution?_f=app_share&s=a2&share_destination_id=MjA5NDI0MTk2LTE3NDA5NzYyMzUxMzk%3D&pd=0EAincnu&hl=en_US&send_time=1740976235&actBtn=floatShareButton&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.8.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v5%2Cns_local_strategy_25q1_exp-v17%2Cns_foryou_blend_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-control",
    "timestamp": "2025-03-03T04:31:04Z"
  },
  {
    "title": "Trump’s Strategic Crypto Reserve And What It Means For Crypto And You",
    "description": "The US Strategic Crypto Reserve signals a dramatic shift in the government’s stance on digital assets. It's impact is far reaching for the world.",
    "link": "https://www.forbes.com/sites/digital-assets/2025/03/02/trumps-strategic-crypto-reserve-and-what-it-means-for-crypto-and-you/",
    "timestamp": "2025-03-03T04:31:02Z"
  },
  {
    "title": "Trump says US should focus more on 'migrant gangs,' less on Putin",
    "description": "United States President Donald Trump stressed that the US should prioritize tackling border issues over giving the same level of attention to Russian President Vladimir Putin.\n\"We should spend l...",
    "link": "https://biztoc.com/x/8af8055c73c4fbf2",
    "timestamp": "2025-03-03T04:30:34Z"
  },
  {
    "title": "Keep Up With Asia’s Next Wave Of Business Leaders With Forbes Asia’s February/March Issue",
    "description": "Billionaire Robert Kuok’s grandson Kuok Meng Wei, whose K2 Strategic is betting big on data centers, is among those leading a generational shift at Asia’s business empires.",
    "link": "https://www.forbes.com/sites/naazneenkarmali/2025/03/02/keep-up-with-asias-next-wave-of-business-leaders-with-forbes-asias-februarymarch-issue/",
    "timestamp": "2025-03-03T04:30:28Z"
  },
  {
    "title": "Conan O'Brien Takes Swipe At Trump's Putin Bromance Without Saying His Name",
    "description": "The Oscars host made a \"powerful\" dig at the president while remarking on Sean Baker's \"Anora.\"",
    "link": "https://www.huffpost.com/entry/conan-obrien-donald-trump-russia-anora-dig_n_67c51c80e4b0b499dce2d97c",
    "timestamp": "2025-03-03T04:29:22Z"
  },
  {
    "title": "BREAKING: Trump administration says trans service members have until March 26 to quit Air Force",
    "description": "The Trump administration has escalated its efforts to purge transgender\r\n service members from the military\r\n, urging them to voluntarily separate by March 26—or face an uncertain future.",
    "link": "https://www.advocate.com/news/trump-transgender-departure-ultimatum",
    "timestamp": "2025-03-03T04:25:02Z"
  },
  {
    "title": "Defense Secretary Pete Hegseth says the DoD's civilian federal workforce must respond to DOGE's productivity emails",
    "description": "The Defense Department initially told employees to \"pause any response\" to OPM's request for a list of their work accomplishments.",
    "link": "https://www.businessinsider.com/pete-hegseth-dod-civilian-workers-reply-doge-productivity-email-2025-3",
    "timestamp": "2025-03-03T04:18:26Z"
  },
  {
    "title": "Conan Slammed Trump With Joke Referencing Putin, And The Oscars 2025 Crowd Ate It Up",
    "description": "At Hollywood's biggest night, host Conan O'Brien wasn't afraid to offer a shocking jab at Donald Trump over Anora's resounding success.",
    "link": "https://screenrant.com/oscars-2025-conan-trump-russian-joke/",
    "timestamp": "2025-03-03T04:15:46Z"
  },
  {
    "title": "Report: Mexican Cartel Leaders in Fear After Trump Admin Designates Them as Terrorist Orgs",
    "description": "Mexican drug cartels are reportedly in fear and going into hiding as Mexican law enforcement officials have ramped up arrests and drug busts in response to the Trump administration threatening to hit the country with tariffs.\nThe post Report: Mexican Cartel L…",
    "link": "https://www.breitbart.com/politics/2025/03/02/report-drug-cartels-fear-mexican-authorities-ramp-arrests/",
    "timestamp": "2025-03-03T04:13:30Z"
  },
  {
    "title": "Trump downplays ‘worrying’ over Putin rapprochement",
    "description": "US President Donald Trump responded Sunday to criticism over his increasing closeness to Russia on Ukraine, saying the United States should worry “less” about Vladimir Putin. “We should spend less time worrying about Putin, and more time worrying about migran…",
    "link": "https://www.digitaljournal.com/world/trump-downplays-worrying-over-putin-rapprochement/article",
    "timestamp": "2025-03-03T04:12:20Z"
  },
  {
    "title": "What Kamala Harris Was Really Doing During Oscars 2025",
    "description": "Kamala Harris is kicking back on Oscars night.\nLike many Americans across the country, the former Vice President and her husband Doug Emhoff caught the 2025 Academy Awards from home.\nAs seen in a...",
    "link": "https://www.eonline.com/news/1414180/oscars-2025-no-kamala-harris-didnt-make-surprise-appearance-what-she-did-instead",
    "timestamp": "2025-03-03T04:06:28Z"
  },
  {
    "title": "Adrien Brody forces Oscars orchestra not to cut off his Best Actor speech",
    "description": "Adrien Brody forced the Oscars orchestra to stop cutting off his Best Actor speech: 'I've done this before. Thank you. It's not my first rodeo.'",
    "link": "https://ew.com/adrien-brody-wins-best-actor-forces-orchestra-not-cut-off-speech-2025-oscars-11688937",
    "timestamp": "2025-03-03T04:06:27Z"
  },
  {
    "title": "Macron urges Europe to boost defense spending to over 3 percent of GDP",
    "description": "The EU needs to find ways to massively ramp up defense spending, the French president says.",
    "link": "https://www.politico.eu/article/macron-urges-europe-to-boost-defense-spending-to-over-3-percent-of-gdp/",
    "timestamp": "2025-03-03T04:02:00Z"
  },
  {
    "title": "Trump Cards",
    "description": "This is for you poker players out there: Trump appears to be conceding far too much to Russia, but it could be part of a plan. In poker, the strong hand plays it cool at the start. The weak one bluffs, pretending to be strong. Trump could be bluffing giving a…",
    "link": "https://www.lewrockwell.com/2025/03/taki-theodoracopulos/trump-cards/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "NATO Is the Big Obstacle to Peace in Ukraine",
    "description": "During his recent campaign for president, Donald Trump repeatedly stated that he had a secret plan for settling the war in Ukraine. He suggested that he would be able to resolve the conflict within a day of so of taking office. That obviously was political hy…",
    "link": "https://www.lewrockwell.com/2025/03/jacob-hornberger/nato-is-the-big-obstacle-to-peace-in-ukraine/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "The Press Falls to Another Record Low in Public Trust",
    "description": "We have previously discussed polling showing the media at record lows in public trust. Well, the latest survey from Gallup shows that the media hit another all-time low. What is most impressive is that plummeting readers, revenues, and layoffs have done littl…",
    "link": "https://www.lewrockwell.com/2025/03/no_author/the-press-falls-to-another-record-low-in-public-trust/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "The Chance for a New World",
    "description": "For the first time in many years there is hope.  The DEI/Woke/Democrat assault on white Americans has been stopped at least for four years.  For awhile I won’t have to worry that the FBI will break down my door because some creep doesn’t like what I wrote or …",
    "link": "https://www.lewrockwell.com/2025/03/paul-craig-roberts/the-chance-for-a-new-world/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "The Guessing Game Over Trump’s Real Aims in Ukraine",
    "description": "The guessing game about President Donald Trump’s real position on peace in Ukraine continues. Some commentators, including yours truly, think that Trump has blown it by becoming too committed to Ukraine. Others believe that Trump is deceiving the public while…",
    "link": "https://www.lewrockwell.com/2025/03/no_author/the-guessing-game-over-trumps-real-aims-in-ukraine/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "Netanyahu pins his hopes on Hamas violating the cease-fire so he can resume the war",
    "description": "With Trump's backing, the Israeli prime minister is allowing himself a free reign in Gaza – and in Lebanon.  Knowing that his political survival is on the line, sacrificing the hostages and exposing IDF soldiers to life-threatening situations are a price he's…",
    "link": "https://www.haaretz.com/israel-news/2025-03-03/ty-article/.premium/netanyahu-pins-his-hopes-on-hamas-violating-the-cease-fire-so-he-can-resume-the-war/00000195-58b4-d965-a395-58b7b8960000",
    "timestamp": "2025-03-03T04:00:11Z"
  },
  {
    "title": "Oscars TV Review: Conan O’Brien Nails It In Hosting Debut On A Night Of Celebration For Cinema, L.A. & Gene Hackman",
    "description": "More than we’ve seen in a while and with a spry 81-year-old Mick Jagger in the house brimming with Bob Dylan jokes, Sunday’s Conan O’Brien-hosted 97th Oscars was a celebration of cinema and the home of Hollywood. Building on last year’s show’s long-overdue ef…",
    "link": "http://deadline.com/2025/03/oscars-2025-tv-review-1236307507/",
    "timestamp": "2025-03-03T03:58:17Z"
  },
  {
    "title": "European leaders back Zelensky in London summit after heated Trump meeting",
    "description": "Washington DC (UPI) Mar 2, 2025 \n\n\n After President Donald Trump's heated exchange with Volodymyr Zelensky at the White House last week, the Ukrainian president met with a summit of European leaders at Lancaster House in London to discuss Russia's war on his …",
    "link": "https://www.spacewar.com/reports/European_leaders_back_Zelensky_in_London_summit_after_heated_Trump_meeting_999.html",
    "timestamp": "2025-03-03T03:56:44Z"
  },
  {
    "title": "Private US company aces lunar landing on first mission",
    "description": "Washington (AFP) Mar 2, 2025\n\n\n A US company successfully landed its spacecraft on the Moon on Sunday, marking only the second private mission to achieve the milestone - and the first to do so upright. \n\nFirefly Aerospace's Blue Ghost Mission 1 touched down a…",
    "link": "https://www.moondaily.com/reports/Private_US_company_aces_lunar_landing_on_first_mission_999.html",
    "timestamp": "2025-03-03T03:56:44Z"
  },
  {
    "title": "Pentagon orders Russian cyber offensive 'stand down'",
    "description": "Washington DC (UPI) Mar 2, 2025 \n\n\n The Trump administration has ordered the United States to end offensive cyber operations targeting Russia, part of an effort to draw Russian President Vladimir Putin into talks on ending the war in Ukraine, sources said Sun…",
    "link": "https://www.spacewar.com/reports/Pentagon_orders_Russian_cyber_offensive_stand_down_999.html",
    "timestamp": "2025-03-03T03:56:44Z"
  },
  {
    "title": "Bitcoin jumps 20% as Trump reveals strategic crypto reserve",
    "description": "Trump announces bitcoin and ether will be core of new U.S. crypto reserve, sparking significant market rally.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/cryptocurrency/bitcoin-jumps-20-as-trump-reveals-strategic-crypto-reserve/article69284264.ece",
    "timestamp": "2025-03-03T03:55:38Z"
  },
  {
    "title": "Watch: Conan Says Americans 'Excited to See Somebody Finally Stand Up to a Powerful Russian' After 'Anora' Wins",
    "description": "Conan O'Brien remained largely apolitical while hosting the Oscars on Sunday night, save for his one sublte dig at President Donald Trump and Russia.\nThe post Watch: Conan Says Americans ‘Excited to See Somebody Finally Stand Up to a Powerful Russian’ After ‘…",
    "link": "https://www.breitbart.com/entertainment/2025/03/02/watch-conan-jokes-americans-excited-to-see-somebody-finally-stand-up-to-a-powerful-russian-after-anora-wins/",
    "timestamp": "2025-03-03T03:55:03Z"
  },
  {
    "title": "Ishiba says Japan won't take sides in U.S. row with Ukraine",
    "description": "The Japanese leader sought to strike a balance for Japan, the sole Asian G7 member, in its alliance with the U.S. and its longstanding support for Kyiv.",
    "link": "https://www.japantimes.co.jp/news/2025/03/03/japan/politics/ishiba-ukraine-trump-reaction/",
    "timestamp": "2025-03-03T03:53:00Z"
  },
  {
    "title": "Asian markets climb on China fiscal hopes against Trump tariffs",
    "description": "Asian markets climbed on Monday on hopes that China will announce a huge stimulus package that will help offset US President Donald Trump’s looming tariffs against Chinese goods. Investors were also watching for any last-ditch deals to ward off the levies hit…",
    "link": "https://www.digitaljournal.com/world/asian-markets-climb-on-china-fiscal-hopes-against-trump-tariffs/article",
    "timestamp": "2025-03-03T03:52:32Z"
  },
  {
    "title": "Trump sees Zelenskyy as the problem, but Ukrainians stand by him",
    "description": "The more the U.S. President and his vice president squeeze Zelenskyy, the more Ukrainians rally to their leader's side.",
    "link": "https://www.japantimes.co.jp/news/2025/03/03/world/politics/trump-zelenskyy-problem-ukrainians/",
    "timestamp": "2025-03-03T03:47:00Z"
  },
  {
    "title": "The risks of Trump tariffs encapsulated in a car key",
    "description": "Electronic car keys are assembled in Mexico, but can cross borders in North America several times before being finished.",
    "link": "https://www.japantimes.co.jp/business/2025/03/03/markets/risks-trump-tariffs-car-key/",
    "timestamp": "2025-03-03T03:47:00Z"
  },
  {
    "title": "Demonstrators gather in San Francisco to support Ukraine",
    "description": "Dozens of protesters gathered near the San Francisco ferry building Sunday afternoon expressing support for Ukraine following the disastrous Oval Office meeting last week with President Donald Trump and Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.ktvu.com/news/demonstrators-gather-san-francisco-support-ukraine",
    "timestamp": "2025-03-03T03:44:44Z"
  },
  {
    "title": "Zelenskyy says U.S.-Ukraine relationship can be salvaged",
    "description": "Ukrainian president Volodymyr Zelenskyy said Sunday that he believes he will be able to salvage his relationship with the United States.",
    "link": "https://www.nbcnews.com/politics/donald-trump/zelenskyy-us-ukraine-relationship-salvaged-rcna194438",
    "timestamp": "2025-03-03T03:37:24Z"
  },
  {
    "title": "Hero Snow Reporter Who Took on Vance Still Employed",
    "description": "Good news: at least for now, Lucy Welch remains employed by Sugarbush. From the Boston Globe (archive):\n\nIn a statement to the Glo",
    "link": "https://kottke.org/25/03/hero-snow-reporter-who-took-on-vance-still-employed",
    "timestamp": "2025-03-03T03:35:08Z"
  },
  {
    "title": "Volodymyr Zelensky speaks out after disastrous Donald Trump meeting over Ukraine’s war effort against Russia",
    "description": "Volodymyr Zelensky speaks out after disastrous Donald Trump meeting over Ukraine’s war effort against Russia7news.com.au",
    "link": "https://7news.com.au/news/conflict/zelensky-speaks-out-after-disastrous-trump-meeting-c-17904235",
    "timestamp": "2025-03-03T03:33:41Z"
  },
  {
    "title": "Trader profits $6.8M from BTC, ETH bets placed before Trump crypto reserve post",
    "description": "A trader netted $6.8 million from placing hundreds of 50x leveraged long positions on Bitcoin and Ether right before US President Donald Trump’s Crypto Strategic Reserve announcement.",
    "link": "https://cointelegraph.com/news/trader-banks-nearly-7-million-from-trumps-crypto-reserve-announcement",
    "timestamp": "2025-03-03T03:33:18Z"
  },
  {
    "title": "Trump slammed for golfing while South Carolina is burning after deluded theories - NewsBreak",
    "description": "Governor Henry McMaster declared a state of emergency to aid the ongoing response to wildfires across the state",
    "link": "https://www.newsbreak.com/share/3837068853260-trump-slammed-for-golfing-while-south-carolina-is-burning-after-deluded-theories?s=a2&amp;share_destination_id=MTc2NzUyNzkxLTE3NDA5NzIzNDYxODc%3D&amp;pd=0BxdTT3e&amp;hl=en_US&amp;send_time=1740972346&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v1%2Cns_local_strategy_25q1_exp-control",
    "timestamp": "2025-03-03T03:26:15Z"
  },
  {
    "title": "Conan O’Brien Gets In Dig At Trump With ‘Anora’ Joke: “I Guess Americans Are Excited To See Somebody Finally Stand Up To A Powerful Russian”",
    "description": "Conan O’Brien steered clear of politics in his opening monologue, but as Anora has collected a number of Oscars, he got in a quip directed at Donald Trump without naming him. “Anora is having a good night. Two wins already. I guess Americans are excited to se…",
    "link": "http://deadline.com/2025/03/oscars-2025-trump-conan-obrien-1236308273/",
    "timestamp": "2025-03-03T03:26:05Z"
  },
  {
    "title": "Why Trump’s aluminum tariffs won’t raise the price of your can of Coke",
    "description": "American consumers don’t need to fret about President Donald Trump’s tariffs on aluminum raising the price of their can of soda.\nTwo weeks ago, Trump announced a 25% tariff on all steel and aluminum imports into the United States that would go into effect Mar…",
    "link": "https://biztoc.com/x/6b4b1690b66ecee7",
    "timestamp": "2025-03-03T03:24:12Z"
  },
  {
    "title": "Canada Doesn’t Rule Out Sending Troops to Ukraine — Trudeau",
    "description": "Prime Minister told reporters in London following a meeting of Western leaders devoted to the Ukrainian conflictOTTAWA, March 2. /TASS/. Canada is considering all options to ensure Ukraine's security, including sending military personnel to the country, Prime…",
    "link": "https://freerepublic.com/focus/f-news/4301654/posts",
    "timestamp": "2025-03-03T03:22:52Z"
  },
  {
    "title": "Controversial Trump Movie ‘The Apprentice’ Fails To Win Any Oscars",
    "description": "The film, which President Donald Trump has threatened legal action against, did not win for Best Supporting Actor or Best Actor for Jeremy Strong and Sebastian Stan.",
    "link": "https://www.forbes.com/sites/tonifitzgerald/2025/03/02/controversial-trump-movie-the-apprentice-fails-to-win-any-oscars/",
    "timestamp": "2025-03-03T03:22:47Z"
  },
  {
    "title": "USAID official put on leave after warning of deaths due to Trump's aid block",
    "description": "The Trump administration announced last week that it was canceling nearly 10,000 foreign aid grants and contracts worth almost $60 billion, ending about 90% of USAID's global work.",
    "link": "https://www.japantimes.co.jp/news/2025/03/03/world/politics/usaid-official-deaths-trump-aid/",
    "timestamp": "2025-03-03T03:21:00Z"
  },
  {
    "title": "Ukraine updates: Zelenskyy says peace talks will include US",
    "description": "Just days after his tense encounter with US President Donald Trump at the White House, Volodymyr Zelenskyy has said negotiations will \"definitely\" include Washington. His comments follow a European summit in London.",
    "link": "https://www.dw.com/en/ukraine-updates-zelenskyy-says-peace-talks-will-include-us/live-71806397",
    "timestamp": "2025-03-03T03:20:00Z"
  },
  {
    "title": "Oscars spread love around to 'Anora,' 'Conclave,' 'Dune: Part Two,' 'Wicked'",
    "description": "\"Anora,” a strip-club Cinderalla story without the fairy tale ending, was crowned best picture at the 97th Academy Awards on Sunday, handing Sean Baker’s gritty, Brooklyn-set screwball farce Hollywood’s top prize",
    "link": "https://www.actionnewsjax.com/entertainment/strip-club/RRCMLJUGWZFOFGMOGIGIQSZWUQ/",
    "timestamp": "2025-03-03T03:19:43Z"
  },
  {
    "title": "Tesla’s plummeting sales risk its lucrative emissions credit earnings",
    "description": "CEO Elon Musk has angered European customers and governments, undercutting his EV brand.",
    "link": "https://www.politico.eu/article/tesla-plummeting-sales-risk-emissions-credit-earning/",
    "timestamp": "2025-03-03T03:18:00Z"
  },
  {
    "title": "Musk calls for US to withdraw from NATO - NewsBreak",
    "description": "Elon Musk called for the United States to withdraw from NATO and the United Nations. His statement came amid a flurry of posts on X criticizing Ukrainian P",
    "link": "https://www.newsbreak.com/share/3836818516472-musk-calls-for-us-to-withdraw-from-nato?s=a2&amp;share_destination_id=MTcwOTgwOTYzLTE3NDA5NzE3MDM0MDQ%3D&amp;pd=0BZPxTKu&amp;hl=en_US&amp;send_time=1740971703&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v3%2Cns_foryou_model_exp_25q1-v5%2Cns_foryou_blend_exp_25q1-v2%2Cns_local_strategy_25q1_exp-v3%2Cns_push_exp_rt_bucketv12-v4",
    "timestamp": "2025-03-03T03:15:56Z"
  },
  {
    "title": "Digging Deep: Australian Mining Magnate Gina Rinehart Speaks Her Mind",
    "description": "Gina Rinehart remade Hancock into one of Australia’s largest private companies by revenue. She wants to be remembered as a champion for the mining and agriculture industries.",
    "link": "https://www.forbes.com/sites/shivaunefield/2025/03/02/digging-deep-australian-mining-magnate-gina-rinehart-speaks-her-mind/",
    "timestamp": "2025-03-03T03:10:35Z"
  },
  {
    "title": "Ukraine’s Zelenskyy ‘ready’ for minerals deal after bust-up with Trump",
    "description": "Ukrainian leader says he will resign if Kyiv is granted membership of NATO.",
    "link": "https://www.aljazeera.com/news/2025/3/3/ukraines-zelenskyy-ready-for-minerals-deal-after-bust-up-with-trump",
    "timestamp": "2025-03-03T03:09:59Z"
  },
  {
    "title": "Largest ever CME gap has just printed in Bitcoin futures",
    "description": "A gap of more than $10,000 has opened up on CME Bitcoin futures following the massive market move over the weekend.",
    "link": "https://cointelegraph.com/news/largest-ever-cme-gap-has-just-printed-in-bitcoin-futures",
    "timestamp": "2025-03-03T03:08:15Z"
  },
  {
    "title": "How the US Can Make Myanmar a Foreign Policy Success Story",
    "description": "Supporting the country’s pro-democracy movement is both a moral imperative and a strategic necessity for Washington.",
    "link": "https://thediplomat.com/2025/03/how-the-us-can-make-myanmar-a-foreign-policy-success-story/",
    "timestamp": "2025-03-03T03:06:00Z"
  },
  {
    "title": "Should Canada become the 51st US state? Trump fans are unsure",
    "description": "The BBC asked Maga supporters if they understood why Canadians might be annoyed by Trump’s 51st state jibes.",
    "link": "https://www.bbc.com/news/videos/cvg58d7938yo",
    "timestamp": "2025-03-03T03:05:31Z"
  },
  {
    "title": "'Give Him An Ovation': Mike Johnson Warns Dems To 'Respect' Trump's Speech To Congress",
    "description": "House Speaker Mike Johnson (R-LA) warned Democrats to \"respect\" President Donald Trump when he addresses a joint session of Congress this week.\n\n\n\"Are you expecting the Democrats to put on some kind of a resistance show on Tuesday night?\" Fox News host Maria …",
    "link": "https://crooksandliars.com/2025/03/give-him-ovation-mike-johnson-warns-dems",
    "timestamp": "2025-03-03T03:00:01Z"
  },
  {
    "title": "‘The White Lotus’: Leslie Bibb Reveals That Trump Scene Was Written in 2022 and Explains Why Mike White ‘Writes Great Women’",
    "description": "SPOILER ALERT: This article contains spoilers for Season 3, Episode 3 of “The White Lotus,” now streaming on Max. For a tight-knit group of women like Kate (Leslie Bibb), Jaclyn (Michelle Monaghan) and Laurie (Carrie Coon), taking a trip to Thailand is the pe…",
    "link": "https://variety.com/2025/tv/news/white-lotus-leslie-bibb-reveals-trump-scene-written-2022-explains-mike-white-writing-great-women-1236320516/",
    "timestamp": "2025-03-03T03:00:00Z"
  },
  {
    "title": "‘No Other Land’ Directors Call Out US Foreign Policy in Palestine in Oscars Speech: ‘Can’t You See We Are Intertwined?’",
    "description": "Palestinian director Basel Adra and Israeli director Yuval Abraham decried the \"atrocious destruction\" in Gaza \nThe post ‘No Other Land’ Directors Call Out US Foreign Policy in Palestine in Oscars Speech: ‘Can’t You See We Are Intertwined?’ appeared first on …",
    "link": "https://www.thewrap.com/no-other-land-oscars-speech-palestine-gaza/",
    "timestamp": "2025-03-03T02:58:39Z"
  },
  {
    "title": "'No Other Land' directors plead for an end to Israeli-Palestinian conflict",
    "description": "Basel Adra and Yuval Abraham, two of the four directors of ‘No Other Land’, pleaded for an end to the Israeli-Palestinian conflict in their Oscars acceptance speech.",
    "link": "https://www.nbcnews.com/news/us-news/oscar-winning-no-land-directors-plead-end-israeli-palestinian-conflict-rcna194447",
    "timestamp": "2025-03-03T02:57:26Z"
  },
  {
    "title": "Zelensky says still \"ready to sign\" minerals deal with U.S.",
    "description": "LONDON, March 3 (Xinhua) -- Ukrainian President Volodymyr Zelensky said Sunday that he is still",
    "link": "http://en.people.cn/n3/2025/0303/c90000-20283585.html",
    "timestamp": "2025-03-03T02:55:14Z"
  },
  {
    "title": "Bitcoin Is Digital Gold But 'What's The Rationale For An XRP Reserve', Asks Peter Schiff: Cardano Founder Charles Hoskinson Says Trump Made The Right Decision",
    "description": "Renowned economist Peter Schiff questioned the inclusion of XRP (CRYPTO: XRP) in the cryptocurrency reserve announced by President Donald Trump on Sunday while acknowledging the rationale behind including Bitcoin (CRYPTO: BTC).\nWhat happened: Schiff stated on…",
    "link": "https://biztoc.com/x/dfec23960e809316",
    "timestamp": "2025-03-03T02:50:55Z"
  }
]