[
  {
    "title": "Kyiv mayor says Ukraine may need to cede land",
    "description": "Mayor of Kyiv Vitali Klitschko says Ukraine may need to surrender territory to Russia to achieve a temporary peace. Meanwhile, Russia's foreign minister says a deal with the US still needs work. Follow DW for more. The mayor of Kyiv has suggested that Ukraine…",
    "link": "https://www.dw.com/en/kyiv-mayor-says-ukraine-may-need-to-cede-land/live-72345018",
    "timestamp": "2025-04-25T08:47:00Z"
  },
  {
    "title": "Eurosceptic Simion hopes to ride wave of anger to victory in Romanian election",
    "description": "BUCHAREST (Reuters) - Eurosceptic George Simion will get a second shot at becoming Romania's president on May 4, hoping to ride a wave of anger stirred by the cancellation of a December election that another far-right contender looked set to win. Read full st…",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/eurosceptic-simion-hopes-to-ride-wave-of-anger-to-victory-in-romanian-election",
    "timestamp": "2025-04-25T08:44:00Z"
  },
  {
    "title": "Alcohol, anxiety, and abuse: Flight attendants say travelers are more freaked out than ever",
    "description": "Amid increasing travel chaos, flight attendants are dealing with more bad behavior. It's a troubling sign for America.",
    "link": "https://www.businessinsider.com/travel-chaos-flight-attendants-plane-passengers-freaked-out-flying-2025-4",
    "timestamp": "2025-04-25T08:31:01Z"
  },
  {
    "title": "British cardinal who will be in the conclave says picking the next pope is 'intimidating'",
    "description": "The head of the Catholic Church in England and Wales has told Sky News it's \"intimidating\" to be one of those responsible for choosing the next pope.",
    "link": "https://news.sky.com/story/cardinal-vincent-nichols-british-cardinal-who-will-be-in-the-conclave-says-picking-the-next-pope-is-intimidating-13355243",
    "timestamp": "2025-04-25T08:29:00Z"
  },
  {
    "title": "Trump to shut down agency funding developing countries: report",
    "description": "The administration of U.S. President Donald Trump announced Wednesday that it will shut down the Millennium Challenge Corporation (MCC), a foreign aid agency known for funding infrastructure projects in developing countries, according to media reports.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250424-pdo03.htm",
    "timestamp": "2025-04-25T08:24:57Z"
  },
  {
    "title": "Anwar calls for stronger Asean, global alliances amid US tariff challenges",
    "description": "IPOH: Malaysia needs to strengthen its alliances, particularly within Asean and with other international partners, to enhance domestic capacity and build public confidence in the country's ability to be self-reliant, despite facing tariffs imposed by the Unit…",
    "link": "https://www.thestar.com.my/news/nation/2025/04/25/anwar-calls-for-stronger-asean-global-alliances-amid-us-tariff-challenges",
    "timestamp": "2025-04-25T08:23:00Z"
  },
  {
    "title": "India Throws Trump A Harley-Davidson Olive Branch In Trade Talks",
    "description": "India Throws Trump A Harley-Davidson Olive Branch In Trade Talks \n \nPresident Donald Trump hinted overnight at a potential easing of the trade war with Beijing, suggesting that the current 145% tariffs on Chinese goods \"could come down substantially\"—though h…",
    "link": "https://biztoc.com/x/83916fa5d4c6939a",
    "timestamp": "2025-04-25T08:22:45Z"
  },
  {
    "title": "EU May Reduce Purchases of US Weapons, Introduce High Reciprocal Tariffs - Reports",
    "description": "The EU countries are considering the possibility of reducing purchases of American weapons and introducing tough economic restrictions against the United States as a response to the actions of the administration of US President Donald Trump, Politico reported…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250424-sputnik04.htm",
    "timestamp": "2025-04-25T08:22:40Z"
  },
  {
    "title": "My Word: The Butterfly Effect and the difference a year makes",
    "description": "The Hamas-led, Iranian-backed invasion and mega-atrocity on October 7, 2023, when 1,200 were murdered and 251 abducted to Gaza, was an event that has changed the world, not just Israel.",
    "link": "https://www.jpost.com/opinion/article-851437",
    "timestamp": "2025-04-25T08:21:39Z"
  },
  {
    "title": "Japan doubles down on stimulus to counter effects of Trump tariffs",
    "description": "The government will implement measures that build on ones announced earlier with the aim of boosting domestic spending and shoring up corporate balance sheets.",
    "link": "https://www.japantimes.co.jp/business/2025/04/25/economy/tariff-stimulus-upped/",
    "timestamp": "2025-04-25T08:21:00Z"
  },
  {
    "title": "Japan looks to increase U.S. corn imports ahead of more tariff talks",
    "description": "The idea appears to be aimed at appeasing U.S. President Donald Trump's criticisms about Japan's tariffs and could be used as leverage in next week's bilateral negotiations.",
    "link": "https://www.japantimes.co.jp/business/2025/04/25/economy/japan-american-corn/",
    "timestamp": "2025-04-25T08:15:00Z"
  },
  {
    "title": "Canadians put off by Trump’s bluster and border arrests are booking far fewer U.S. visits",
    "description": "Diana and Rick Bellamy initially planned to take a Caribbean cruise out of Houston before heading to Laurel, Mississippi, to visit the home of one of their favorite HGTV shows, “Home Town.”",
    "link": "https://www.nbcnews.com/news/us-news/canadians-put-trumps-bluster-border-arrests-are-booking-far-fewer-us-v-rcna202943",
    "timestamp": "2025-04-25T08:13:59Z"
  },
  {
    "title": "Democrats Threaten Salvadoran People to Get MS-13 Suspect Back to U.S.",
    "description": "El Salvadorans are pulling themselves out of poverty and gang wars, but Democrats want left-wing Americans to kick them in the teeth by boycotting their tourist destinations.\nThe post Democrats Threaten Salvadoran People to Get MS-13 Suspect Back to U.S. appe…",
    "link": "https://www.breitbart.com/economy/2025/04/25/democrats-threaten-salvadoran-people-to-get-ms-13-suspect-back-to-us/",
    "timestamp": "2025-04-25T08:13:51Z"
  },
  {
    "title": "Russia says it's 'ready to strike deal' as Ukraine pushes back on pressure to give up Crimea",
    "description": "Ukraine feels it is being pressured to accept terms that would cede Crimea.",
    "link": "https://www.thejournal.ie/russia-says-its-ready-to-strike-deal-as-ukraine-pushes-back-on-pressure-to-give-up-crimea-6686980-Apr2025/",
    "timestamp": "2025-04-25T08:13:14Z"
  },
  {
    "title": "Pope Francis ‘a great ally of gay community’, says Varadkar",
    "description": "Former taoiseach is working with several LGBTA-rights organisations and figuring out his next career steps, he tells Harvard audience",
    "link": "https://www.irishtimes.com/politics/2025/04/25/pope-francis-a-great-ally-of-gay-community-says-varadkar/",
    "timestamp": "2025-04-25T08:11:34Z"
  },
  {
    "title": "Pope Francis’s funeral to be less costly than his predecessors’",
    "description": "Francis cultivated a humble image, opting for a modest rather than lavish lifestyle.",
    "link": "https://www.aljazeera.com/news/2025/4/25/pope-franciss-funeral-to-be-less-costly-than-his-predecessors",
    "timestamp": "2025-04-25T08:11:18Z"
  },
  {
    "title": "Canadians put off by Trump's bluster and border arrests are booking far fewer US visits",
    "description": "Trump’s attacks on Canada’s economy and threats to make it the 51st state have infuriated Canadians, who are canceling trips to the U.S. in big numbers.",
    "link": "https://www.clickondetroit.com/news/world/2025/04/25/canadians-put-off-by-trumps-bluster-and-border-arrests-are-booking-far-fewer-us-visits/",
    "timestamp": "2025-04-25T08:11:07Z"
  },
  {
    "title": "Has Trump Moved On From Dismantling Iran's Nuclear Program?",
    "description": "High-stakes nuclear talks between the United States and Iran have already entered the technical phase after just two rounds of negotiations mediated by Oman.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250425-rferl01.htm",
    "timestamp": "2025-04-25T08:09:59Z"
  },
  {
    "title": "Iran FM says ready to visit Paris, Berlin, London for diplomacy",
    "description": "Foreign Minister Abbas Araghchi says he is \"once again\" proposing dialogue and a diplomatic path to France, Germany, and Britain on Iran's nuclear program and other shared interests.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250424-presstv02.htm",
    "timestamp": "2025-04-25T08:08:45Z"
  },
  {
    "title": "UN watchdog chief says North Korea's nuclear arsenal 'completely off the charts'",
    "description": "The head of the U.N. nuclear watchdog said on Tuesday that North Korea's nuclear weapons program has grown \"exponentially,\" and urged talks between Washington and Pyongyang.",
    "link": "https://www.globalsecurity.org/wmd/library/news/dprk/2025/dprk-250423-rfa01.htm",
    "timestamp": "2025-04-25T08:06:50Z"
  },
  {
    "title": "US should drop pressure tactics if it seeks to resolve issues via dialogue, FM says on report White House considers cutting China tariffs",
    "description": "In response to a question regarding a report by Wall Street Journal, citing White House official that the China tariffs could come down from their current level of 145% to between 50% and 65%, almost half, and media reports that President Donald Trump said \"I…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250424-globaltimes07.htm",
    "timestamp": "2025-04-25T08:04:54Z"
  },
  {
    "title": "China denies existence of tariff negotiation with US",
    "description": "China on Thursday denied the existence of any consultation or negotiations on the issue of tariffs between China and the US, let alone an agreement on the matter, when Chinese foreign ministry spokesperson responded to media questions.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250424-globaltimes02.htm",
    "timestamp": "2025-04-25T08:04:16Z"
  },
  {
    "title": "China To Lift EU Sanctions In Move To Repair Ties With Brussels",
    "description": "China and the European Parliament are in the \"final stages\" of discussions about removing sanctions on its lawmakers as part of a move to open the door for mended relations between Beijing and the bloc.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250424-rferl01.htm",
    "timestamp": "2025-04-25T08:03:59Z"
  },
  {
    "title": "How Trump victim-blaming of Zelensky is creating a path to victory for Putin",
    "description": "How can anybody have supported Donald Trump in the first place? Looking back, all the signs were there. The Capitol Hill insurgency of January 6, for one thing; the fondness for Vladimir Putin for another. The embrace of norm violation on a scale never previo…",
    "link": "https://www.independent.ie/world-news/north-america/how-trump-victim-blaming-of-zelensky-is-creating-a-path-to-victory-for-putin/a1665131397.html",
    "timestamp": "2025-04-25T08:02:26Z"
  },
  {
    "title": "Amazon and Walmart Battle for the Hybrid Shopper",
    "description": "As the digital and physical worlds of commerce continue to intertwine, Amazon and Walmart are reinventing themselves at a blistering pace. What was once a head-to-head contest for online supremacy has now evolved into a complex chess game, with both giants do…",
    "link": "https://www.pymnts.com/news/retail/2025/amazon-and-walmart-battle-for-the-hybrid-shopper/",
    "timestamp": "2025-04-25T08:01:48Z"
  },
  {
    "title": "Apple May Shift Entire iPhone Assembly For US To India By Next Year: Report",
    "description": "Apple is reportedly planning to shift the entire assembly of iPhones sold in the United States to India by as early as next year.",
    "link": "https://www.ndtv.com/india-news/apple-may-shift-entire-iphone-assembly-for-us-to-india-by-next-year-report-8252521",
    "timestamp": "2025-04-25T08:01:27Z"
  },
  {
    "title": "Trump Faces New Nuclear Crisis as India-Pakistan Tensions Soar",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs President Donald Trump grapples with wars raging in Ukraine and the Gaza Strip, another major flashpoint is simmering in South Asia, where tensions are escalating after a deadly attack along one of the most…",
    "link": "https://biztoc.com/x/99d2c9e2b6fcc9ed",
    "timestamp": "2025-04-25T08:01:24Z"
  },
  {
    "title": "FinTech IPO Index Surges 11.2% as Asian Companies and Platforms Bounce Back",
    "description": "The rising tide of a three-day rally this week helped lift virtually all boats in the FinTech IPO Index, which was up 11.2%. The snapback rally — maybe call it a relief rally — came as there were signs that tariffs levied against China might be walked back a …",
    "link": "https://www.pymnts.com/news/fintech-investments/2025/fintech-ipo-index-surges-11-2-percent-as-asian-companies-and-platforms-bounce-back/",
    "timestamp": "2025-04-25T08:00:37Z"
  },
  {
    "title": "Luigi Mangione heads to federal court as DOJ debuts death penalty 'shift': ex-federal prosecutor",
    "description": "The DOJ is seeking the death penalty for Luigi Mangione, accused of killing UnitedHealthcare CEO Brian Thompson, in a \"clear shift\" in policy, according to a former federal prosecutor.",
    "link": "https://www.foxnews.com/us/luigi-mangione-heads-federal-court-doj-debuts-death-penalty-shift-ex-federal-prosecutor",
    "timestamp": "2025-04-25T08:00:10Z"
  },
  {
    "title": "Democrat-run Los Angeles failing wildfire victims’ rebuilding plans months after Trump visit: GOP rep",
    "description": "Thousands of Pacific Palisades homeowners are waiting to rebuild after the devastating wildfires as only a handful of permits have reportedly been approved by LA Mayor Karen Bass.",
    "link": "https://www.foxnews.com/us/democrat-run-los-angeles-failing-wildfire-victims-rebuilding-plans-months-after-trump-visit-gop-rep",
    "timestamp": "2025-04-25T08:00:07Z"
  },
  {
    "title": "Map Shows What Ukraine Could Look Like Under Trump's Proposed Peace Deal",
    "description": "President Donald Trump's plan proposes that the annexed Crimean peninsula being de facto accepted as Russian.",
    "link": "https://www.newsweek.com/russia-ukraine-trump-map-2063564",
    "timestamp": "2025-04-25T08:00:03Z"
  },
  {
    "title": "Trump Faces New Nuclear Crisis as India-Pakistan Tensions Soar",
    "description": "One of India's most decorated officers told Newsweek \"de-fusing this serious South Asian crisis would garner some brownie points\" for Trump.",
    "link": "https://www.newsweek.com/trump-faces-new-nuclear-crisis-india-pakistan-tensions-soar-2063401",
    "timestamp": "2025-04-25T08:00:02Z"
  },
  {
    "title": "U.S. booze boycott becomes a much-needed boon for B.C. wineries",
    "description": "British Columbia winemakers hope Canada’s united boycott of U.S. booze could result in a banner year for the province’s wine industry. Industry experts say it could also deliver a financial blow to vineyards south of the border.",
    "link": "https://www.cbc.ca/news/business/bakx-bc-wine-us-tariffs-booze-boycott-1.7517793",
    "timestamp": "2025-04-25T08:00:00Z"
  },
  {
    "title": "Tariff fears are driving a boost in auto sales in Detroit",
    "description": "As tariffs create uncertainty in global markets, CBC News travelled to Detroit across from WIndsor, Ont., to find out how auto consumers and dealers are responding, and get their views on President Donald Trump’s goal of moving production to the U.S. People i…",
    "link": "https://www.cbc.ca/news/world/auto-sales-in-us-amid-tariffs-1.7513918",
    "timestamp": "2025-04-25T08:00:00Z"
  },
  {
    "title": "7 million Canadians voted before all party platforms were out. Do platforms still matter?",
    "description": "Before the Conservatives became the last federal party to unveil their election platform, more than seven million Canadians had already voted in advanced polling, calling into question the relevance of such documents.",
    "link": "https://www.cbc.ca/news/politics/election-platforms-do-canadians-care-1.7517338",
    "timestamp": "2025-04-25T08:00:00Z"
  },
  {
    "title": "Pipelines have become an election issue. What exactly is Ottawa's role to play?",
    "description": "If the next government wants to build new energy infrastructure, experts say that could include different strategies such as taking an ownership stake or reducing red tape. But perceptions of \"short-circuiting\" processes could cause new problems.",
    "link": "https://www.cbc.ca/news/canada/calgary/pipelines-election-1.7517840",
    "timestamp": "2025-04-25T08:00:00Z"
  },
  {
    "title": "Apple aims to build most iPhones for US in India by end of 2026",
    "description": "Apple Inc aims to import most of the iPhones it sells in the US from India by the end of next year, accelerating a shift beyond China to mitigate risks related to tariffs and geopolitical tensions. Read full story",
    "link": "https://www.thestar.com.my/tech/2025/04/25/apple-aims-to-build-most-iphones-for-us-in-india-by-end-of-2026",
    "timestamp": "2025-04-25T08:00:00Z"
  },
  {
    "title": "Ukraine hit by another night of deadly Russian strikes despite Trump’s ‘Vladimir, STOP!’ plea | CNN",
    "description": "Moscow has inflicted another round of deadly strikes on Ukraine despite US President Donald Trump’s plea for Russian President Vladimir Putin to “STOP!” attacking its neighbor.",
    "link": "https://www.cnn.com/2025/04/25/europe/russia-strikes-ukraine-trump-vladimir-intl-hnk/index.html",
    "timestamp": "2025-04-25T07:59:55Z"
  },
  {
    "title": "Bill Maher calls Larry David’s mockery of his Trump dinner ‘insulting to six million dead Jews’",
    "description": "‘I don’t need to be lectured on who Donald Trump is,’ US host said after ‘Curb Your Enthusiasm’ star compared president to Hitler",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/donald-trump-larry-david-bill-maher-b2739315.html",
    "timestamp": "2025-04-25T07:58:26Z"
  },
  {
    "title": "Trump poised to sell weapons worth $100 billion to Saudi Arabia: Report",
    "description": "The United States is set to sell Saudi Arabia arms worth well over $100 billion, according to a report.",
    "link": "https://www.globalsecurity.org/wmd/library/news/saudi/2025/saudi-250424-presstv01.htm",
    "timestamp": "2025-04-25T07:58:13Z"
  },
  {
    "title": "Age divide and economic anxieties; Poilievre's GTA push faces generational hurdles amidst Trump shadow",
    "description": "Poilievre's GTA rally reveals a generational divide, with older voters leaning towards Carney due to trade war concerns. Economic anxieties fuel support for Poilievre, but his campaign faces criticism for media restrictions and struggles to counter Carney's a…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/age-divide-and-economic-anxieties-poilievres-gta-push-faces-generational-hurdles-amidst-trump-shadow/articleshow/120612249.cms",
    "timestamp": "2025-04-25T07:58:04Z"
  },
  {
    "title": "Defense Secretary Orders Additional Remedies, More Clarity on COVID-19 Reinstatements",
    "description": "The defense secretary today signed a memorandum directing more clarity regarding the department's efforts to reinstate service members kicked out for not taking the COVID-19 vaccine, as well as additional remedies for those service members.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/04/sec-250423-dodnews01.htm",
    "timestamp": "2025-04-25T07:57:24Z"
  },
  {
    "title": "U.S. blasts China for misusing U.N. resolution at Security Council meet",
    "description": "A United States representative to the United Nations on Wednesday criticized the People's Republic of China (PRC) for \"misusing\" a 1971 U.N. resolution to exclude the Republic of China (ROC, Taiwan) from the international organization, for which Taiwan's gove…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250424-cna02.htm",
    "timestamp": "2025-04-25T07:55:30Z"
  },
  {
    "title": "'Trump 2028' Shirt Goes on Sale on Trump Store: 'Rewrite the Rules'",
    "description": "The store had already started selling \"Trump 2028\" hats as the president floats a third term.",
    "link": "https://www.newsweek.com/trump-2028-shirt-goes-sale-trump-store-rewrite-rules-2064011",
    "timestamp": "2025-04-25T07:54:23Z"
  },
  {
    "title": "Trump Rebukes Putin As Death Toll From Russian Strikes On Kyiv Hits 12",
    "description": "Rescue teams recovered two more bodies from the rubble of apartment buildings destroyed in a massive Russian missile-and-drone attack, prompting US President Donald Trump to issue a rare rebuke of Russian leader Vladimir Putin.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250424-rferl02.htm",
    "timestamp": "2025-04-25T07:54:13Z"
  },
  {
    "title": "Kyiv To Observe Day Of Mourning After Russian Strike Kills 12",
    "description": "Kyiv has declared April 25 a day of mourning for 12 people killed in a Russian missile-and-drone attack that hit the Ukrainian capital overnight, prompting US President Donald Trump to issue a rare rebuke of Russian leader Vladimir Putin.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250425-rferl02.htm",
    "timestamp": "2025-04-25T07:54:04Z"
  },
  {
    "title": "Trump on Ukraine Conflict: Next Few Days Are Crucial for Swift Resolution",
    "description": "US President Donald Trump said on Thursday that Washington is seeking a swift resolution to the Ukraine conflict and noted that \"a lot of progress\" has been made.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250424-sputnik01.htm",
    "timestamp": "2025-04-25T07:52:59Z"
  },
  {
    "title": "IAEA Director General Grossi Discusses Global Non-proliferation, Nuclear Safety Issues with Senior US Officials in Washington DC",
    "description": "IAEA Director General Rafael Mariano Grossi met high-level officials from the U.S. administration to discuss important current issues related to non-proliferation and nuclear safety worldwide, during a visit to Washington DC where he also spoke to the heads o…",
    "link": "https://www.globalsecurity.org/wmd/library/news/un/un-250424-iaea01.htm",
    "timestamp": "2025-04-25T07:52:09Z"
  },
  {
    "title": "Nomura profit beats estimates on equity trading and dealmaking",
    "description": "The result caps a record year of profits, helped by robust trading and dealmaking and a resurgence in investing by Japanese individuals.",
    "link": "https://www.japantimes.co.jp/business/2025/04/25/companies/nomura-profit-rise/",
    "timestamp": "2025-04-25T07:52:00Z"
  },
  {
    "title": "The market may be poised for a 'roaring 2020s' comeback, says a veteran analyst",
    "description": "The S&P 500 index fell as much as 12% from April 2, when Trump announced new tariffs against trade partners. It's just about 3% lower now.",
    "link": "https://markets.businessinsider.com/news/stocks/stock-market-today-sp500-roaring-rally-comeback-yardeni-trump-trade-2025-4",
    "timestamp": "2025-04-25T07:46:37Z"
  },
  {
    "title": "Japan needs clarity as an antidote to contradictory tariffs",
    "description": "With incompatible goals and an erratic timeline, Trump's tariff strategy has more holes than Swiss cheese. In response, Japan should bring a strong, coherent strategy to the table.",
    "link": "https://www.japantimes.co.jp/commentary/2025/04/25/japan/us-tariffs-contradictions-japan-response/",
    "timestamp": "2025-04-25T07:45:00Z"
  },
  {
    "title": "Videos Reveal at Least 200 Houthis Killed in U.S. Airstrikes",
    "description": "A Newsweek analysis of videos of Houthi funerals shows heavy losses among commanders as well as Houthi fighters in over one month of airstrikes",
    "link": "https://www.newsweek.com/videos-reveal-least-200-houthis-killed-us-airstrikes-2063762",
    "timestamp": "2025-04-25T07:41:41Z"
  },
  {
    "title": "Faithful flock to St. Peter's on last day to pay respects to pope",
    "description": "ROME (Reuters) - Queues of faithful filed into St. Peter's throughout the night and in the early hours of Friday, on the last day to bid farewell to Pope Francis ahead of his funeral on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/faithful-flock-to-st-peter039s-on-last-day-to-pay-respects-to-pope",
    "timestamp": "2025-04-25T07:41:00Z"
  },
  {
    "title": "Japan unveils emergency economic steps to curb impact of U.S. tariffs",
    "description": "Japan's government on Friday unveiled a package of emergency economic measures to counter the adverse effects of U.S. President Donald Trump's higher tariffs, ahead of a second round of bilateral trade negotiations expected next week. The relief package consi…",
    "link": "https://japantoday.com/category/politics/update2-japan-unveils-emergency-economic-steps-to-curb-impact-of-u.s.-tariffs",
    "timestamp": "2025-04-25T07:38:00Z"
  },
  {
    "title": "Pope Francis Links to Scalia on Due Process: The Case Made by a Skadden Litigator",
    "description": "By MIKE MAGEE  The Pope’s passing interrupted an epic battle between Trump and the rest of the civilized world over whether America remains a society “under the law.” Critical to the ruleContinue reading...",
    "link": "https://thehealthcareblog.com/blog/2025/04/25/pope-francis-links-to-scalia-on-due-process-the-case-made-by-a-skadden-litigator/",
    "timestamp": "2025-04-25T07:36:00Z"
  },
  {
    "title": "Donald Trump To Run For Third Term? 'Trump 2028' Hats, T Shirts Go On Sale",
    "description": "The sale came shortly after Donald Trump,who returned to power in January, said he was &quot;not joking&quot; about the prospect of seeking a third term.",
    "link": "https://www.ndtv.com/world-news/donald-trump-to-run-for-third-term-trump-2028-hats-t-shirts-go-on-sale-8252456",
    "timestamp": "2025-04-25T07:35:23Z"
  },
  {
    "title": "US President releases ‘Trump 2028’ hats as he could exploit loophole to seek third term",
    "description": "Donald Trump has released some new merchandise which is emblazoned with the words 'Trump 2028', amid fears he could change the Constitution to run again.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-2028-hat-merch-running-third-term-president-606826-20250425",
    "timestamp": "2025-04-25T07:28:21Z"
  },
  {
    "title": "China's weaponizing of raw materials in tariff war could cripple US EV supply chain",
    "description": "US President Donald Trump has imposed several tariffs since taking office, resulting in retaliatory actions from several countries. The response from China has garnered the most attention, especially its export restrictions on key industrial raw materials, ra…",
    "link": "https://www.digitimes.com/news/a20250424PD236/donald-trump-materials-supply-chain-war-rare-earth.html",
    "timestamp": "2025-04-25T07:26:36Z"
  },
  {
    "title": "Deleted condolence after pope's death revealed tension between Israel, Vatican",
    "description": "Following Pope Francis' death, Israel's initial restrained response, including deleting a condolence message, reflects tensions over his criticism of Israel's Gaza war conduct. While President Herzog offered condolences, Netanyahu and the Foreign Minister rem…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/deleted-condolence-after-popes-death-revealed-tension-between-israel-vatican/articleshow/120610868.cms",
    "timestamp": "2025-04-25T07:25:28Z"
  },
  {
    "title": "Gen Z Rejects Trump On Inflation, But Reports Better Finances Than Older Generations: Poll",
    "description": "About 30% of Americans under 30 say their financial situation has worsened in the past year, while 27% say it's improved. Though that improvement number may seem small, Gen Z members were more likely than older generations to report better finances in the las…",
    "link": "https://www.ibtimes.com/gen-z-rejects-trump-inflation-reports-better-finances-older-generations-poll-3771344",
    "timestamp": "2025-04-25T07:24:13Z"
  },
  {
    "title": "China Likely To Exempt Some US Goods From Tariffs As Costs Rise: Report",
    "description": "Authorities are considering removing the additional levies for medical equipment and some industrial chemicals like ethane.",
    "link": "https://www.ndtv.com/world-news/china-may-exempt-some-us-goods-from-tariffs-as-costs-rise-report-after-donald-trump-tariff-8252338",
    "timestamp": "2025-04-25T07:19:59Z"
  },
  {
    "title": "Yemen’s Houthi fighters down $200m worth of US drones in under six weeks",
    "description": "US loses drones in Yemen as rising civilian toll fuels backlash over Trump’s air campaign.",
    "link": "https://www.aljazeera.com/news/2025/4/25/houthi-fighters-down-200m-worth-of-us-drones-in-under-six-weeks",
    "timestamp": "2025-04-25T07:19:18Z"
  },
  {
    "title": "Trade tensions are giving Intel's older chips a second life",
    "description": "While Donald Trump has for now exempted chips from tariffs, a major hit to Intel could come from China's retaliatory tariffs on US imports, with chips manufactured in the US set to face levies of 85% or higher, based on the state-backed China Semiconductor In…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trade-tensions-are-giving-intels-older-chips-a-second-life/articleshow/120610477.cms",
    "timestamp": "2025-04-25T07:17:42Z"
  },
  {
    "title": "Russia, Ukraine Defy Trump Plea to Stop Attacks",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThere were reports of strikes and civilian deaths from both Russia and Ukraine on Friday morning, despite a plea from President Donald Trump to cease attacks.\nTrump had told Russian President Vladimir Putin to…",
    "link": "https://biztoc.com/x/8c0e77593324efc8",
    "timestamp": "2025-04-25T07:17:01Z"
  },
  {
    "title": "China vows in Politburo meeting to support firms, workers affected by tariffs",
    "description": "China's top policymakers pledged to support firms and workers most affected by the impact of triple-digit U.S. tariffs, the ruling Communist Party's...",
    "link": "https://www.yahoo.com/news/china-vows-politburo-meeting-support-071431688.html",
    "timestamp": "2025-04-25T07:14:31Z"
  },
  {
    "title": "Interlock ransomware gang started leaking data allegedly stolen from leading kidney dialysis firm DaVita",
    "description": "The Interlock ransomware gang claimed responsibility for the attack on the leading kidney dialysis company DaVita and leaked alleged stolen data. DaVita Inc. provides kidney dialysis services through a network of 2,675 outpatient centers in the United States,…",
    "link": "https://securityaffairs.com/176946/cyber-crime/interlock-ransomware-gang-started-leaking-data-allegedly-stolen-from-leading-kidney-dialysis-firm-davita.html",
    "timestamp": "2025-04-25T07:13:10Z"
  },
  {
    "title": "UK Retail Sales Were Soaring Before US Tariffs Rocked Confidence",
    "description": "Britain’s economy posted its strongest retail sales since 2021 in the first quarter, before consumer confidence was sent sliding by Donald Trump’s tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-retail-sales-were-soaring-before-us-tariffs-rocked-confidence",
    "timestamp": "2025-04-25T07:10:27Z"
  },
  {
    "title": "China Quietly Waives Some U.S. Tariffs, Importers Say",
    "description": "China had hit the U.S. with a 125 percent retaliatory tariff after Trump imposed a 125 percent levy on most Chinese goods.",
    "link": "https://www.newsweek.com/china-quietly-waives-some-us-tariffs-importers-say-2063989",
    "timestamp": "2025-04-25T07:07:48Z"
  },
  {
    "title": "'Trump 2028' Merchandise Hits Online Store Despite Constitutional Ban On Third Term Presidency",
    "description": "Donald Trump‘s online store has begun selling merchandise branded with “Trump 2028,” a year in which he is constitutionally prohibited from running for the U.S. presidency.\nWhat Happened: The online store is offering clothing items with “Trump 2028” prominent…",
    "link": "https://biztoc.com/x/5ac83150d7d36804",
    "timestamp": "2025-04-25T07:06:14Z"
  },
  {
    "title": "President Trump's Solana Meme Coin Plunges After Spike Over Exclusive Dinner",
    "description": "In brief\n- President Trump's official meme coin is down substantially over the last day, following a Wednesday price spike.\n- The spike was triggered by a promotion that will let top token holders attend an exclusive dinner with Trump.\nTRUMP, the official Sol…",
    "link": "https://biztoc.com/x/eca63a99d3073321",
    "timestamp": "2025-04-25T07:06:02Z"
  },
  {
    "title": "Trump: Iran Deal Talks Are 'Well on Their Way'",
    "description": "US President Donald Trump said that negotiations with Iran concerning its nuclear program are advancing \"very well.\"",
    "link": "https://biztoc.com/x/f290b4d15dd5221e",
    "timestamp": "2025-04-25T07:05:47Z"
  },
  {
    "title": "Harvard In Talks To Sell $1 Billion Of Equity Stakes Amid Feud With Trump",
    "description": "Harvard has allocated almost 40% of its $53 billion endowment to private equity, according to an annual report for the year ended in June.",
    "link": "https://www.ndtv.com/world-news/harvard-university-in-talks-to-sell-1-billion-of-private-equity-stakes-amid-feud-with-donald-trump-8252247",
    "timestamp": "2025-04-25T07:05:12Z"
  },
  {
    "title": "Trump names Russia’s ‘big concession’ on Ukraine",
    "description": "Moscow has compromised by not seizing the whole of the neighboring country, the US president has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616260-trump-names-russia-big-concession-ukraine/",
    "timestamp": "2025-04-25T07:01:06Z"
  },
  {
    "title": "Blue State Blues: California -- Rich in Wealth, Poor in Leadership",
    "description": "Newsom's celebration is actually an indictment of his own administration. There is no excuse for a state with so much money, and so much talent, to be run so poorly.\nThe post Blue State Blues: California — Rich in Wealth, Poor in Leadership appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/04/25/blue-state-blues-california-rich-in-wealth-poor-in-leadership/",
    "timestamp": "2025-04-25T07:00:40Z"
  },
  {
    "title": "White House Partners With Hillsdale for Lecture Series",
    "description": "President Donald Trump is tapping a familiar institution, Hillsdale College, to produce a video lecture series for the U.S. sestercentennial, the administration announced on social media.",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/04/25/white-house-partners-hillsdale-lecture-series",
    "timestamp": "2025-04-25T07:00:00Z"
  },
  {
    "title": "Accreditors Sound Off on Executive Order",
    "description": "Accreditors Sound Off on Executive Order\n\n \n\n\n \nJosh Moody\n\nFri, 04/25/2025 - 03:00 AM\n\nThe Trump administration aims to overhaul accreditation. Agencies say they are willing to work with the federal government on reforms, but Trump’s claims are misleading.\n …",
    "link": "https://www.insidehighered.com/news/government/politics-elections/2025/04/25/accreditors-sound-executive-order",
    "timestamp": "2025-04-25T07:00:00Z"
  },
  {
    "title": "Florida’s Own DOGE Reviews Faculty Research, Grants",
    "description": "Florida’s Own DOGE Reviews Faculty Research, Grants\n\n \n\n\n \nRyan Quinn\n\nFri, 04/25/2025 - 03:00 AM\n\nMultiple states have created entities named after the federal Department of Government Efficiency. The Sunshine State’s version is targeting colleges and univer…",
    "link": "https://www.insidehighered.com/news/faculty-issues/academic-freedom/2025/04/25/floridas-own-doge-reviewing-faculty-research-grants",
    "timestamp": "2025-04-25T07:00:00Z"
  },
  {
    "title": "Trump signs controversial order to boost deep-sea mining industry",
    "description": "The executive order will help private deep-sea mining companies to access mineral-rich nodules on the sea floor.",
    "link": "https://www.aljazeera.com/news/2025/4/25/trump-signs-controversial-order-to-boost-deep-sea-mining-industry",
    "timestamp": "2025-04-25T06:58:35Z"
  },
  {
    "title": "트럼프 관세, \"부유층보다 저소득 가구 타격 클 것\"",
    "description": "New: DOGE cut or paused around 15 $IBM contracts amounting to around $100M in backlog. https://t.co/giqKTamqEc— Brody Ford (@BrodyFord_) April 24, 2025 The crypto enthusiasts on the stock market are more enthusiastic about crypto than the crypto enthusiasts i…",
    "link": "https://ryueyes11.tistory.com/511582",
    "timestamp": "2025-04-25T06:57:29Z"
  },
  {
    "title": "China has halted rare earth exports, can Australia step up?",
    "description": "Australia has proposed to create a strategic reserve of critical minerals.",
    "link": "https://www.bbc.com/news/articles/c86je4vyg36o",
    "timestamp": "2025-04-25T06:56:30Z"
  },
  {
    "title": "High-Level U.S. Delegation Concludes Visit to Libya",
    "description": "Steven Sahiounie, journalist and political commentator On April 20-21, a high-level U.S. delegation conducted a two-day visit to Tripoli and Benghazi. A series of meetings were held between Libyan officials and the American delegation.  US President Donald Tr…",
    "link": "https://mideastdiscourse.com/2025/04/24/high-level-u-s-delegation-concludes-visit-to-libya/",
    "timestamp": "2025-04-25T06:55:55Z"
  },
  {
    "title": "Trump: Iran Deal Talks Are 'Well on Their Way'",
    "description": "US President Donald Trump said that negotiations with Iran concerning its nuclear program are advancing \"very well.\"",
    "link": "https://www.newsweek.com/donald-trump-iran-us-nuclear-talks-2063984",
    "timestamp": "2025-04-25T06:55:54Z"
  },
  {
    "title": "WHO Announces 'Significant' Layoffs Three Months After Trump Halts US Funding",
    "description": "WHO Announces 'Significant' Layoffs Three Months After Trump Halts US Funding\n \nThree months after President Donald Trump signed an executive order withdrawing the United States from the World Health Organization (WHO) - they're now suffering from a 'large sa…",
    "link": "https://biztoc.com/x/9e42bbfe46c68965",
    "timestamp": "2025-04-25T06:54:53Z"
  },
  {
    "title": "Election Diary: Dutton tops list of most distrusted, amid deepening voter cynicism about political leaders",
    "description": "And while Anzac Day brought a temporary truce in campaigning, the political leaders united to condemn neo-Nazi disruption at a dawn service  in Melbourne.",
    "link": "https://theconversation.com/election-diary-dutton-tops-list-of-most-distrusted-amid-deepening-voter-cynicism-about-political-leaders-254995",
    "timestamp": "2025-04-25T06:42:52Z"
  },
  {
    "title": "Decision Still Away On Tweaking Auto Tariffs: White House",
    "description": "The administration is examining &quot;streamlining overlap&quot; between 25 percent tariffs on imported autos and metals, as well as those imposed over illicit fentanyl, a White House official said.",
    "link": "https://www.ndtv.com/auto/decision-still-away-on-tweaking-auto-tariffs-white-house-8248088",
    "timestamp": "2025-04-25T06:42:33Z"
  },
  {
    "title": "China's top leaders pledge economic support as trade war rages",
    "description": "Amidst economic challenges and trade tensions with the US, Chinese leaders have pledged to bolster domestic consumption and oppose \"unilateral bullying\" in global trade. The Politburo, led by President Xi Jinping, emphasized stimulating economic growth throug…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/chinas-top-leaders-pledge-economic-support-as-trade-war-rages/articleshow/120608586.cms",
    "timestamp": "2025-04-25T06:38:00Z"
  },
  {
    "title": "US defense secretary's chief of staff leaving his job",
    "description": "Washington (AFP) April 24, 2025\n\n\n US Defense Secretary Pete Hegseth's chief of staff is leaving his job, a senior defense official said Thursday, in the latest shakeup to hit the upper echelons of the Pentagon's leadership. \n\n\"Joe Kasper will continue to ser…",
    "link": "https://www.spacewar.com/reports/US_defense_secretarys_chief_of_staff_leaving_his_job_999.html",
    "timestamp": "2025-04-25T06:30:51Z"
  },
  {
    "title": "'Vladimir, STOP!': Trump tells Putin after deadly Kyiv strike",
    "description": "Washington (AFP) April 24, 2025\n\n\n Donald Trump called Thursday on Vladimir Putin to halt attacks on Ukraine, in a rare rebuke of the Russian leader after Moscow fired missiles and drones at Kyiv in the deadliest attack on the capital in months. \n\nThe US pres…",
    "link": "https://www.spacewar.com/reports/Vladimir_STOP_Trump_tells_Putin_after_deadly_Kyiv_strike_999.html",
    "timestamp": "2025-04-25T06:30:51Z"
  },
  {
    "title": "US envoy to meet Iranians for third time",
    "description": "Washington (AFP) April 24, 2025\n\n\n The United States said Thursday that President Donald Trump's confidant Steve Witkoff will meet Iranian officials for the third straight week as the adversaries seek a nuclear deal. \n\nWitkoff, a businessman friend of Trump w…",
    "link": "https://www.spacewar.com/reports/US_envoy_to_meet_Iranians_for_third_time_999.html",
    "timestamp": "2025-04-25T06:30:51Z"
  },
  {
    "title": "Trump, Norwegian prime minister discuss ending Ukraine War",
    "description": "Washington DC (UPI) Apr 24, 2025 \n\n\n Norwegian Prime Minister Jonas Gahr Store, President Donald Trump and others discussed the need to end the war in Ukraine during an afternoon White House meeting on Thursday. \n \"It's a real honor to have the highly respect…",
    "link": "https://www.spacewar.com/reports/Trump_Norwegian_prime_minister_discuss_ending_Ukraine_War_999.html",
    "timestamp": "2025-04-25T06:30:51Z"
  },
  {
    "title": "Crimea, territory at heart of US-Ukraine tensions",
    "description": "Kyiv, Ukraine (AFP) April 24, 2025\n\n\n Crimea, the focus of fresh tensions between US President Donald Trump and his Ukranian counterpart Volodymyr Zelensky, was illegally annexed by Russia in 2014 in the first act of the countries' ongoing war. \n\nAccording to…",
    "link": "https://www.spacewar.com/reports/Crimea_territory_at_heart_of_US-Ukraine_tensions_999.html",
    "timestamp": "2025-04-25T06:30:51Z"
  },
  {
    "title": "EU chief says talks with UK PM could 'pave way' for defence pact",
    "description": "London (AFP) April 24, 2025\n\n\n Talks with UK Prime Minister Keir Starmer on Thursday could \"pave the way\" for a defence and security pact between Britain and the European Union, EU chief Ursula von der Leyen said as the pair met in London. \n\nWith a landmark p…",
    "link": "https://www.spacewar.com/reports/EU_chief_says_talks_with_UK_PM_could_pave_way_for_defence_pact_999.html",
    "timestamp": "2025-04-25T06:30:51Z"
  }
]