[
  {
    "title": "Syrian forces deploy in Hasakah under ceasefire agreement with SDF",
    "description": "Syrian forces move into the northeastern city, which was previously under the control of the Kurdish-led SDF.",
    "link": "https://www.aljazeera.com/news/2026/2/2/syrian-forces-deploy-in-hasakah-under-ceasefire-agreement-with-sdf",
    "timestamp": "2026-02-02T17:02:04Z"
  },
  {
    "title": "This Trump outrage will sink him with MAGA — and it's not Epstein",
    "description": "One cannot fully appreciate the level of danger President Donald Trump brings to every assumption ever made about American self-governance without acknowledging that whatever else the man may be, he has been a master at reading the room, manipulating the righ…",
    "link": "https://www.rawstory.com/raw-investigates/2675065358/",
    "timestamp": "2026-02-02T17:01:18Z"
  },
  {
    "title": "Don Lemon’s arrest turned into a MAGA misfire",
    "description": "Pam Bondi’s track record of prosecuting Trump's revenge is abysmal",
    "link": "https://www.salon.com/2026/02/02/don-lemons-arrest-turned-into-a-maga-misfire/",
    "timestamp": "2026-02-02T17:00:46Z"
  },
  {
    "title": "Brazilian influencer who defended US immigration crackdown arrested by ICE (Tom Phillips/The Guardian)",
    "description": "Tom Phillips / The Guardian:\nBrazilian influencer who defended US immigration crackdown arrested by ICE  —  Trump supporter Júnior Pena falsely claimed migrants being rounded up, including Brazilians, were ‘all crooks’  —  A rightwing Brazilian influencer who…",
    "link": "https://www.memeorandum.com/260202/p54",
    "timestamp": "2026-02-02T17:00:04Z"
  },
  {
    "title": "Christopher Nolan Says Directors Union Unlikely To Accept 5-Year Deal With AMPTP; DGA President Talks AI, Healthcare, Tax Incentives & More Ahead Of 2026 Bargaining",
    "description": "Newly elected DGA president Christopher Nolan doesn’t expect that the union will be accepting any five-year contracts with the Hollywood studios. When asked during a recent interview if the directors guild would be open to discussing extending its contracts w…",
    "link": "http://deadline.com/2026/02/christopher-nolan-interview-ai-healthcare-dga-negotiations-1236704471/",
    "timestamp": "2026-02-02T17:00:00Z"
  },
  {
    "title": "Today's news and jokes",
    "description": "Winning a jump ball is an underrated skill It’s all about timing, willingness, and hops.After Yuki Kawamura’s win tonight, here are some of the best jump ball moments from over the years! https://t.co/EyGf1Wgunk pic.twitter.com/d8cxGOoYgn\r\n— NBA (@NBA) Febr…",
    "link": "https://www.superpunch.net/2026/02/todays-news-and-jokes_0523134435.html",
    "timestamp": "2026-02-02T17:00:00Z"
  },
  {
    "title": "South African white separatists claim land acquired from Zulu king then lost to British",
    "description": "JOHANNESBURG, Feb 2 (Reuters) - A ‌white South African separatist group, emboldened by U.S. President Donald Trump's drive to take over Greenland, ‌has laid claim to land that descendants of Dutch settlers acquired from a Zulu king ‌but later lost to Britain.…",
    "link": "https://www.thestar.com.my/news/world/2026/02/03/south-african-white-separatists-claim-land-acquired-from-zulu-king-then-lost-to-british",
    "timestamp": "2026-02-02T17:00:00Z"
  },
  {
    "title": "Dan Rather: Do We Still Have a Constitution?",
    "description": "Dan Rather, the much-admired journalist who had a stellar career at CBS News, was outraged by the arrest of Don Lemon and Gloria Fort, two journalists who were arrested for doing their job in Minneapolis. Journalist Don Lemon outside the federal courthouse in…",
    "link": "https://dianeravitch.net/2026/02/02/dan-rather-do-we-still-have-a-constitutuon/",
    "timestamp": "2026-02-02T17:00:00Z"
  },
  {
    "title": "Nicki Minaj Says ‘Any Christian Who Votes Democrat Again Is a Fool’ After Minnesota Church Riot: ‘The Demons Inside of Them Are So Bothered’",
    "description": "Rap legend Nicki Minaj is blasting back at Democrats after the left-wingers at the Grammys tried to make her a target of ridicule on Sunday. She had a particular warning for Christians who might be foolish enough to vote for Democrats in future elections. \nTh…",
    "link": "https://www.breitbart.com/entertainment/2026/02/02/nicki-minaj-says-any-christian-who-votes-democrat-again-is-a-fool-after-minnesota-church-riot-the-demons-inside-of-them-are-so-bothered/",
    "timestamp": "2026-02-02T16:57:22Z"
  },
  {
    "title": "Trevor Noah Jokes About Nicki Minaj, Trump During 2026 Grammy Awards Monologue",
    "description": "Trevor Noah sparked laughs and controversy at the 2026 Grammys with biting jokes targeting Nicki Minaj and Donald Trump during his opening monologue.",
    "link": "https://www.tuko.co.ke/entertainment/celebrities/616782-trevor-noah-jokes-nicki-minaj-trump-2026-grammy-awards-monologue/",
    "timestamp": "2026-02-02T16:55:47Z"
  },
  {
    "title": "Movie Review: “Melania,” Directed by Brett Ratner",
    "description": "Lauren Collins on the documentary about Donald Trump’s First Lady, which Jeff Bezos and Amazon financed in a deal that has been described as a bribe.",
    "link": "https://www.newyorker.com/culture/critics-notebook/melania-is-a-forty-million-dollar-journey-into-the-void",
    "timestamp": "2026-02-02T16:55:07Z"
  },
  {
    "title": "Here’s How Often Trump Comes Up in Latest Epstein Files Release",
    "description": "Donald Trump was mentioned more than 38,000 times in the latest batch of Epstein files, according to a New York Times review of the Justice Department’s Friday public release of some three million pages from the sprawling investigation into child sex traffick…",
    "link": "https://newrepublic.com/post/206023/how-often-donald-trump-mentioned-epstein-files",
    "timestamp": "2026-02-02T16:52:18Z"
  },
  {
    "title": "DHS Seeks to Convert Giant Warehouses Across US Into Immigration Jails",
    "description": "A total of 23 converted warehouses could imprison up to 80,000 people, estimates suggest.",
    "link": "https://truthout.org/articles/dhs-seeks-to-convert-giant-warehouses-across-us-into-immigration-jails/",
    "timestamp": "2026-02-02T16:52:08Z"
  },
  {
    "title": "Infantino sorry for British jibe, defends Trump prize",
    "description": "FIFA president Gianni Infantino has apologised over remarks he made about British fans and defended the decision to award a peace prize to United States president Donald Trump.",
    "link": "https://www.rte.ie/sport/soccer/2026/0202/1556390-infantino-sorry-for-british-jibe-defends-trump-prize/",
    "timestamp": "2026-02-02T16:51:56Z"
  },
  {
    "title": "Treasuries Fall After Strong Factory Gauge Erodes Rate-Cut Bets",
    "description": "Treasuries fell after US manufacturing activity unexpectedly jumped, prompting traders to pare bets on Federal Reserve interest-rate cuts this year.",
    "link": "https://financialpost.com/pmn/business-pmn/treasuries-fall-after-strong-factory-gauge-erodes-rate-cut-bets",
    "timestamp": "2026-02-02T16:50:47Z"
  },
  {
    "title": "Trump Plans to Close Kennedy Center for Two Years, Beginning July 4",
    "description": "Trump said he plans to close the Kennedy Center in Washington, D.C., beginning on July 4, though it is still totally subject to Board approval.”",
    "link": "https://www.artnews.com/art-news/news/trump-announces-kennedy-center-closure-1234771748/",
    "timestamp": "2026-02-02T16:50:42Z"
  },
  {
    "title": "Speculation and a squeeze: A timeline of the roller coaster ride in gold and silver that ended in a crash",
    "description": "The speculative mania in metal markets, particularly silver, had set the stage for Friday's stunning declines.",
    "link": "https://www.businessinsider.com/gold-silver-price-crash-correction-speculation-squeeze-retail-traders-metals-2026-2",
    "timestamp": "2026-02-02T16:49:21Z"
  },
  {
    "title": "EPSTEIN FILES MEGA-DUMP: Trump Just Keeps Looking More And More Disgusting",
    "description": "Strap on your oxygen, we’re going in!",
    "link": "https://www.wonkette.com/p/epstein-files-mega-dump-trump-just",
    "timestamp": "2026-02-02T16:44:58Z"
  },
  {
    "title": "Bombshell Report on Trump’s ‘Secret Deal With UAE’s ‘Spy Sheikh’ Rocks Political World: ‘Unprecedented and Mind-Boggling’",
    "description": "“In any other time or presidency, this story. reported by @WSJ, would be an earthquake of a scandal,” observed David Axelrod\nThe post Bombshell Report on Trump’s ‘Secret Deal With UAE’s ‘Spy Sheikh’ Rocks Political World: ‘Unprecedented and Mind-Boggling’ fir…",
    "link": "https://www.mediaite.com/politics/bombshell-report-on-trumps-secret-deal-with-uaes-spy-sheikh-rocks-political-world-unprecedented-and-mind-boggling/",
    "timestamp": "2026-02-02T16:44:57Z"
  },
  {
    "title": "Dwayne \"The Rock\" Johnson's daughter harshly criticizes Donald Trump",
    "description": "Ava Raine, the WWE personality known outside the ring as Simone Garcia Johnson, stepped into the political spotlight after announcing her departure from WWE&apos;s NXT brand. The d",
    "link": "https://www.marca.com/en/wwe/2026/02/02/6980d1c346163fb42e8b45e6.html",
    "timestamp": "2026-02-02T16:42:46Z"
  },
  {
    "title": "Misconduct complaint dismissed against judge who handled El Salvador prison deportation case",
    "description": "The complaint was dismissed in December but the order only came to light now.",
    "link": "https://www.bostonherald.com/2026/02/02/boasberg-complaint/",
    "timestamp": "2026-02-02T16:40:46Z"
  },
  {
    "title": "US Natural Gas Prices on Track for Biggest Loss in 29 Years",
    "description": "US natural gas futures plunged in early trading as weather forecasts for mid-February shifted significantly warmer, putting the front-month contract on track for the largest daily loss on a percentage basis since 1996, excluding contract rollover days.",
    "link": "https://financialpost.com/pmn/business-pmn/us-natural-gas-prices-on-track-for-biggest-loss-in-29-years",
    "timestamp": "2026-02-02T16:40:27Z"
  },
  {
    "title": "France set to pass delayed 2026 budget, ending months-long saga",
    "description": "<![CDATA[ A political commentator described France's budget as a \"political success and an economic failure,\" on RTL radio. ]]>",
    "link": "https://www.channelnewsasia.com/world/france-delayed-budget-macron-lecornu-no-confidence-vote-presidential-election-5901761",
    "timestamp": "2026-02-02T16:40:00Z"
  },
  {
    "title": "Trump spoke to some FBI agents who raided Atlanta election office, NYT reports",
    "description": "Feb 2 (Reuters) - U.S. President Donald Trump spoke to some FBI agents a day after they searched an election office in Georgia’s Fulton County last week, the New York Tim… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/02/trump-spoke-to-some-fbi-agents-who-raided-atlanta-election-office-nyt-reports",
    "timestamp": "2026-02-02T16:39:47Z"
  },
  {
    "title": "Trump and Petro clash over how best to uproot Colombia’s cocaine crops",
    "description": "As Gustavo Petro prepares to face Donald Trump in Washington, Colombia’s anti-drug strategy is under intense scrutiny.",
    "link": "https://www.aljazeera.com/news/longform/2026/2/2/trump-and-petro-clash-over-how-best-to-uproot-colombias-cocaine-crops",
    "timestamp": "2026-02-02T16:39:21Z"
  },
  {
    "title": "Silver Price Predictions: Why This Analyst Thinks $150 Is Just Around the Corner",
    "description": "Citi’s $150 silver target frames the metal as a high‑beta macro barometer where Chinese buying, structural supply deficits, and safe‑haven flows justify a...",
    "link": "https://www.barchart.com/story/news/37361951/silver-price-predictions-why-this-analyst-thinks-150-is-just-around-the-corner",
    "timestamp": "2026-02-02T16:38:59Z"
  },
  {
    "title": "Why billionaire investor Thomas Kaplan isn't stressing about gold and silver's historic sell-off",
    "description": "NovaGold's chairman told Business Insider that he expects the gold price to be in the \"tens of thousands of dollars\" in time.",
    "link": "https://www.businessinsider.com/thomas-kaplan-gold-silver-price-outlook-paulson-novagold-buffett-investing-2026-2",
    "timestamp": "2026-02-02T16:38:23Z"
  },
  {
    "title": "Gianni Infantino says Fifa would have a look into allowing Russia back into international football",
    "description": "Fifa president sorry for offending British fans and defends Trump peace prize",
    "link": "https://www.irishtimes.com/sport/soccer/2026/02/02/gianni-infantino-says-fifa-would-have-a-look-into-allowing-russia-back-into-international-football/",
    "timestamp": "2026-02-02T16:38:19Z"
  },
  {
    "title": "NY prosecutors raise alarm over GENIUS Act on fraud: Report",
    "description": "Five New York officials reportedly said Tether and Circle had been incentivized to not work with law enforcement, allowing them to profit off crimes involving stablecoins.",
    "link": "https://cointelegraph.com/news/ny-prosecutors-raise-alarm-over-genius-act-fraud-report",
    "timestamp": "2026-02-02T16:37:42Z"
  },
  {
    "title": "5 Juiciest Reveals in Wild Nancy Mace Profile — Like Urging Staffer to Boost Her in ‘Hottest Women of Congress’ Reddit Forums",
    "description": "New York Magazine reported Nancy Mace would make aides go on late-night liquor runs and vote for her in \"hottest women in Congress\" Reddit forums\nThe post 5 Juiciest Reveals in Wild Nancy Mace Profile — Like Urging Staffer to Boost Her in ‘Hottest Women of Co…",
    "link": "https://www.mediaite.com/politics/5-juiciest-reveals-in-wild-nancy-mace-profile-like-urging-staffer-to-boost-her-in-hottest-women-of-congress-reddit-forums/",
    "timestamp": "2026-02-02T16:37:09Z"
  },
  {
    "title": "Top Trump envoy Steve Witkoff to meet with Benjamin Netanyahu in Israel",
    "description": "The officials said Witkoff's visit to the country was expected to begin on Tuesday.",
    "link": "https://nypost.com/2026/02/02/world-news/witkoff-to-meet-netanyahu-in-israel/",
    "timestamp": "2026-02-02T16:35:36Z"
  },
  {
    "title": "FIFA boss says Russia should be let back into international football",
    "description": "Gianni Infantino says “girls and boys from Russia\" should be able to play football in Europe.",
    "link": "https://www.politico.eu/article/fifa-boss-says-russia-should-be-allowed-compete-again-gianni-infantino/",
    "timestamp": "2026-02-02T16:35:07Z"
  },
  {
    "title": "Trump spoke with Modi on Monday, says US Ambassador Sergio Gor",
    "description": "US Ambassador to India Sergio Gor confirmed the interaction with a short message, saying, “President Trump just spoke with Prime Minister Modi. STAY TUNED.”",
    "link": "https://www.thehindubusinessline.com/news/president-trump-speaks-to-pm-modi-says-us-envoy/article70584534.ece",
    "timestamp": "2026-02-02T16:33:48Z"
  },
  {
    "title": "Planned Parenthood drops lawsuit against Trump's Medicaid cuts",
    "description": "Funding cuts have already forced 23 clinics to close since Trump’s tax bill took effect.",
    "link": "https://www.twincities.com/2026/02/02/planned-parenthood-funding-lawsuit-dropped/",
    "timestamp": "2026-02-02T16:33:23Z"
  },
  {
    "title": "Trump Says He Welcomes China, India Investment in VEN Oil",
    "description": "President Donald Trump said Saturday he welcomed investment by China and India in Venezuela's oil industry.",
    "link": "https://www.rigzone.com/news/wire/trump_says_he_welcomes_china_india_investment_in_ven_oil-02-feb-2026-182906-article/",
    "timestamp": "2026-02-02T16:33:22Z"
  },
  {
    "title": "Exclusive-Iran fears US strike may reignite protests, imperil rule, sources say",
    "description": "By Parisa HafeziDUBAI, Feb 2 (Reuters) - Iran’s leadership is increasingly worried a U.S. strike could break its grip on power by driving an already enraged public back o… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/02/exclusive-iran-fears-us-strike-may-reignite-protests-imperil-rule-sources-say",
    "timestamp": "2026-02-02T16:33:18Z"
  },
  {
    "title": "Look inside Miami's 100-year-old Biltmore Hotel, loved by US presidents and linked to mobster lore",
    "description": "The Biltmore Hotel in Miami has welcomed presidents throughout its 100-year history and was once home to the world's largest pool.",
    "link": "https://www.businessinsider.com/miami-biltmore-hotel-tour-photos-history-2026-2",
    "timestamp": "2026-02-02T16:33:04Z"
  },
  {
    "title": "Nolte: ‘Melania’ Box Office Humiliates Barack Obama's Movies",
    "description": "\"Melania\"’s weekend box office haul of $7 million represents the best opening weekend for a documentary in a decade.",
    "link": "https://www.breitbart.com/entertainment/2026/02/02/nolte-melania-box-office-humiliates-barack-obamas-movies/",
    "timestamp": "2026-02-02T16:32:07Z"
  },
  {
    "title": "Two CBP agents identified in Alex Pretti shooting",
    "description": "Two agents who fired on Pretti identified as Border Patrol agent Jesus Ochoa and CBP officer Raymundo Gutierrez.",
    "link": "https://www.salon.com/2026/02/02/two-cbp-agents-identified-in-alex-pretti-shooting-partner/",
    "timestamp": "2026-02-02T16:30:56Z"
  },
  {
    "title": "Planned Parenthood drops lawsuit against Trump administration’s Medicaid cuts",
    "description": "Funding cuts have already forced 23 clinics to close since Trump's tax bill took effect.",
    "link": "https://www.bostonherald.com/2026/02/02/planned-parenthood-funding-lawsuit-dropped/",
    "timestamp": "2026-02-02T16:29:19Z"
  },
  {
    "title": "Grammys 2026 was a nightmare to anti-DEI mob, and Trump is furious",
    "description": "Queer artists, Latinos, Spanish-language albums, hip hop titans, and young artists were the main characters at the 68th Grammy Awards — and it was truly beautiful to see it. The Grammys have been a big, beautiful celebration of the power of diversity in recen…",
    "link": "https://www.out.com/gay-tv-shows/grammys-2026-trump-bad-bunny",
    "timestamp": "2026-02-02T16:29:02Z"
  },
  {
    "title": "JFK’s Family Slams Trump’s Decision to Shut Down Kennedy Center",
    "description": "Donald Trump’s botched takeover of the Kennedy Center is drawing criticism from America’s most prominent political family. After a board of Trump loyalists voted to add Trump’s name to the Kennedy Center in December, the president announced on Sunday that the…",
    "link": "https://newrepublic.com/post/206011/jfk-family-reaction-trump-decision-shut-down-kennedy-center",
    "timestamp": "2026-02-02T16:28:01Z"
  },
  {
    "title": "Morning Joe paints 'nightmare' midterm scenario for GOP: 'They’re walking over the cliff!'",
    "description": "In the wake of the stunning election upset\r\n in Texas where a Democrat flipped a red district for the first time in nearly 50 years, MS NOW’s Joe Scarborough warned Republicans that they were in for a “nightmare” midterm election that could see the GOP lose c…",
    "link": "https://www.rawstory.com/midterm-2675069211/",
    "timestamp": "2026-02-02T16:25:44Z"
  },
  {
    "title": "Elon Musk spent another $10 million to keep the GOP in control of Congress",
    "description": "The world's richest man gave $5 million apiece to two super PACs supporting GOP House and Senate candidates, according to new FEC disclosures.",
    "link": "https://www.businessinsider.com/elon-musk-spends-10-million-gop-control-congress-2026-2",
    "timestamp": "2026-02-02T16:25:23Z"
  },
  {
    "title": "Darius Dixson Supports Kehlani for Her 'F*** ICE' Grammy Acceptance Speech",
    "description": "Darius Dixson walked into L.A. hotspot TAO as a 2-time Grammy winner for his song \"Folded\" last night ... but he told us the most important thing was his collaborator Kehlani's speech. DIXSON told us ... \"The most important artists of our time say…\n Permalink",
    "link": "https://www.tmz.com/2026/02/02/darius-dixson-supports-kehlani-ice-grammys/",
    "timestamp": "2026-02-02T16:24:46Z"
  },
  {
    "title": "Donald Trump Slams Trevor Noah, Threatens Legal Action Over Epstein Joke",
    "description": "President Trump threatened to sue Trevor Noah over what he called \"false and defamatory\" jokes the comedian made while hosting the Grammys on Sunday night.",
    "link": "https://dailycaller.com/2026/02/02/donald-trump-threatens-lawsuit-trevor-noah-grammy-awards-epstein-island/",
    "timestamp": "2026-02-02T16:24:12Z"
  },
  {
    "title": "Modi to Kevin Rudd: How Epstein files set off a storm far beyond the US",
    "description": "Latest files include emails and messages between Epstein and powerful men in India, UK, Australia and Slovakia.",
    "link": "https://www.aljazeera.com/news/2026/2/2/modi-to-kevin-rudd-how-epstein-files-set-off-a-storm-far-beyond-the-us",
    "timestamp": "2026-02-02T16:23:20Z"
  },
  {
    "title": "Trump Threatens to Sue Michael Wolff After New Batch of Epstein Emails | Video",
    "description": "President Donald Trump once again threatened to sue author and perennial foe Michael Wolff after the government released its final batch of files on Jeffrey Epstein, claiming to reporters that Epstein and Wolff were “conspiring” to harm him.",
    "link": "https://www.thewrap.com/media-platforms/journalism/donald-trump-michael-wolff-lawsuit-threat/",
    "timestamp": "2026-02-02T16:22:53Z"
  },
  {
    "title": "Govt pre-university college students in Karnataka to get free textbooks",
    "description": "Bengaluru: From the next academic year, govt pre-university students will get their textbooks for free. So far, only textbooks for classes 1-10 were g.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/govt-pre-university-college-students-in-karnataka-to-get-free-textbooks/articleshow/127866895.cms",
    "timestamp": "2026-02-02T16:22:01Z"
  },
  {
    "title": "Trump Plays Dumb About His Endorsement In Texas Election",
    "description": "Donald Trump feigned ignorance to the media over a special election in a red Texas district, he publicized and endorsed after his candidate got shellacked.\nContinuing the trend of Democrats beating Republicans, even in red districts, in elections leading up t…",
    "link": "https://crooksandliars.com/2026/02/trump-endorses-then-claims-he-had-nothing",
    "timestamp": "2026-02-02T16:18:37Z"
  },
  {
    "title": "'Wildest Party on Your Island?' Email Drop Reveals Elon Musk Seeking Vacation with Jeffrey Epstein",
    "description": "Newly released documents from the Jeffrey Epstein files show that Tesla and SpaceX CEO Elon Musk corresponded with the convicted sex offender in 2012 and 2013, discussing potential visits to Epstein's private island, with Musk asking the disgraced financier \"…",
    "link": "https://www.breitbart.com/tech/2026/02/02/wildest-party-on-your-island-email-drop-reveals-elon-musk-seeking-vacation-with-jeffrey-epstein/",
    "timestamp": "2026-02-02T16:18:32Z"
  },
  {
    "title": "WATCH LIVE: House Rules Committee considers Senate funding plan during partial shutdown",
    "description": "Under the plan approved by the Senate, DHS would be funded temporarily to Feb. 13, setting up a deadline for Congress to find consensus restricting ICE operations.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-house-rules-committee-considers-senate-funding-plan-during-partial-shutdown",
    "timestamp": "2026-02-02T16:16:02Z"
  },
  {
    "title": "Longtime Trump aide’s Mar-a-Lago wedding draws top admin officials",
    "description": "Trump aide Dan Scavino married at Mar-a-Lago with president and top officials attending the Sunday ceremony including Elon Musk and cabinet members.",
    "link": "https://www.foxnews.com/politics/longtime-trump-aides-mar-a-lago-wedding-draws-top-admin-officials",
    "timestamp": "2026-02-02T16:14:12Z"
  },
  {
    "title": "Mediaite One Sheet: Don Lemon Arrest, Epstein Files Drop, Melania Opening",
    "description": "Mediaite One Sheet, Feb 2: Don Lemon's arrest got the chattering class chattering. New Epstein files drop and Melania opening elicits a LOT of hot takes.\nThe post Mediaite One Sheet: Don Lemon Arrest, Epstein Files Drop, Melania Opening first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/mediaite-one-sheet-lemon-arrest/",
    "timestamp": "2026-02-02T16:13:43Z"
  },
  {
    "title": "Trump’s DOJ Somehow Forgets to Redact Nude Photos in Epstein Files",
    "description": "In its latest release of files relating to Jeffrey Epstein, the Department of Justice included several unredacted nude photos of young women, some of whom may have been underage when the photos were taken.The government is required by law to redact sensitive …",
    "link": "https://newrepublic.com/post/206013/justice-department-forgets-redact-nude-photos-epstein-files",
    "timestamp": "2026-02-02T16:09:30Z"
  },
  {
    "title": "Barron Trump's Safety Fears Exposed: The Don's Son, 19, 'Uncomfortable' Exiting Vehicles in Public After Assassination Attempts of Prez",
    "description": "Barron Trump's safety fears have been exposed in his mother, Melania Trump's, new film.",
    "link": "https://radaronline.com/p/barron-trump-safety-fears-donald-assassination-attemps-exposed-melania-film/",
    "timestamp": "2026-02-02T16:08:40Z"
  },
  {
    "title": "Explainer-Olympics-Can transgender athletes compete at the Milano Cortina Winter Games?",
    "description": "MILAN, Feb 2 (Reuters) - The 2026 Milano Cortina Olympics opens on ‌Friday, bringing the world's top athletes together in the biggest winter sports show on earth. The Games will be the last one to be held with the existing and fragmented regulations ‌regardin…",
    "link": "https://www.thestar.com.my/news/world/2026/02/03/explainer-olympics-can-transgender-athletes-compete-at-the-milano-cortina-winter-games",
    "timestamp": "2026-02-02T16:08:00Z"
  },
  {
    "title": "Let's Take Another Look at the Latest Epstein Files Dump",
    "description": "And all the king's horses and (almost) all the king's men all get a mention.",
    "link": "https://www.jezebel.com/lets-take-another-look-at-the-latest-epstein-files-dump",
    "timestamp": "2026-02-02T16:06:26Z"
  },
  {
    "title": "Quote of the Day by Melania Trump: 'Sometimes, in order to succeed, you must be willing to take risks and make tough decisions. You need to trust yourself...'",
    "description": "Melania Trump, known for her fashionable choices and deep thoughts, is the second lady of the United States and the wife of Donald Trump. In one of her quotes, Melania Trump says 'Sometimes, in order to succeed, you must be willing to take risks and make toug…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/quote-of-the-day-by-melania-trump-sometimes-in-order-to-succeed-you-must-be-willing-to-take-risks-and-make-tough-decisions-you-need-to-trust-yourself-/articleshow/127865997.cms",
    "timestamp": "2026-02-02T16:05:14Z"
  },
  {
    "title": "Trump Tirade Over Protests Goes Off Rails as Crushing Fox Poll Hits (New Republic)",
    "description": "New Republic:\nTrump Tirade Over Protests Goes Off Rails as Crushing Fox Poll Hits … Donald Trump appears in deep denial about how widely hated his ICE raids have become.  He let out a strange, rambling tirade to reporters about how the “silent majority” is st…",
    "link": "https://www.memeorandum.com/260202/p42",
    "timestamp": "2026-02-02T16:05:00Z"
  },
  {
    "title": "Trump Amasses $483 Million War Chest to Bolster Midterm Chances",
    "description": "President Donald Trump has said the “only thing” he worries about is losing Republican control of Congress in the November elections. The latest campaign finance filings show he’s built an unprecedented war chest to help keep that from happening.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-amasses-483-million-war-chest-to-bolster-midterm-chances",
    "timestamp": "2026-02-02T16:04:42Z"
  },
  {
    "title": "Did President Donald Trump Just Pour Cold Water on the Gold and Silver Trade With His Nomination of Kevin Warsh as Next Fed Chair?",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_3c77f268-5ad6-4dfb-844c-f292156225b6",
    "timestamp": "2026-02-02T16:04:05Z"
  },
  {
    "title": "Trump to Launch $12B Critical Mineral Stockpile",
    "description": "President Donald Trump is set to launch a strategic critical-minerals stockpile with $12 billion in seed money.",
    "link": "https://www.rigzone.com/news/wire/trump_to_launch_12b_critical_mineral_stockpile-02-feb-2026-182907-article/",
    "timestamp": "2026-02-02T16:03:52Z"
  },
  {
    "title": "Trump Claims His Tariffs Have 'Brought America Back.' Here Are 3 Things He Got Wrong.",
    "description": "The president's article in 'The Wall Street Journal' is wildly misleading.",
    "link": "https://reason.com/2026/02/02/trump-claims-his-tariffs-have-brought-america-back-here-are-3-things-he-got-wrong/",
    "timestamp": "2026-02-02T16:03:25Z"
  },
  {
    "title": "‘Stay tuned’: US Ambassador to India says Trump, PM Modi held talks",
    "description": "President Donald Trump spoke with Indian Prime Minister Narendra Modi. This comes as Trump stated India will purchase oil from Venezuela instead of Iran. Trump made these remarks while speaking to reporters. The US Ambassador to India, Sergio Gor, shared the …",
    "link": "https://economictimes.indiatimes.com/news/india/stay-tuned-us-ambassador-to-india-reveals-president-trump-pm-modi-held-talks/articleshow/127866489.cms",
    "timestamp": "2026-02-02T16:03:06Z"
  },
  {
    "title": "Trump Shares India Gate's Photo, Plans Washington's Triumphal Arch",
    "description": "Trump&#039;s post comes amid advanced plans to construct a new triumphal arch in Washington DC to mark the 250th anniversary of American independence.",
    "link": "https://www.ndtvprofit.com/world/trump-shares-india-gates-photo-plans-washingtons-triumphal-arch-ours-will-be-greatest-of-all-10933555",
    "timestamp": "2026-02-02T16:02:46Z"
  },
  {
    "title": "Damage Control: Starmer Calls For 'Prince of Darkness' Mandelson, His Ex-U.S. Ambassador, to Quit Parliament Over Epstein Emails",
    "description": "Further revelations about potentially criminal conduct of the UK's former ambassador to Washington in the Epstein emails.\nThe post Damage Control: Starmer Calls For ‘Prince of Darkness’ Mandelson, His Ex-U.S. Ambassador, to Quit Parliament Over Epstein Emails…",
    "link": "https://www.breitbart.com/europe/2026/02/02/damage-control-pm-calls-for-mandelson-to-quit-over-epstein-emails/",
    "timestamp": "2026-02-02T16:02:26Z"
  },
  {
    "title": "CNN’s Harry Enten Says Democrats Will Have Tough Time Taking Back White House",
    "description": "CNN's Harry Enten said on Sunday that Democrats may struggle to win the Electoral College in the upcoming presidential elections.",
    "link": "https://dailycaller.com/2026/02/02/cnn-harry-enten-democrats-electoral-college-blue-state-migration/",
    "timestamp": "2026-02-02T16:02:23Z"
  },
  {
    "title": "Ex-Ambassador To US Resigns Over New Epstein Claims",
    "description": "Former UK Ambassador to the U.S. Peter Mandelson announced that he has resigned from the Labour Party, amid growing scrutiny over his ties to Jeffrey Epstein.",
    "link": "https://dailycaller.com/2026/02/02/ex-ambassador-to-us-resigns-over-new-epstein-claims/",
    "timestamp": "2026-02-02T16:02:15Z"
  },
  {
    "title": "Nicki Minaj EXPOSES Trevor Noah … Says He’s Secretly DATING A MAN!!!",
    "description": "Nicki Minaj has taken to X to call out Trevor Noah, Jay-Z, Lizzo, and other celebrities following the 68th Annual Grammy Awards.",
    "link": "https://www.cheatsheet.com/news/nicki-minaj-calls-trevor-noah-jay-z-lizzo-grammys-remarks.html/#article",
    "timestamp": "2026-02-02T16:01:41Z"
  },
  {
    "title": "American Officials Backtrack Iran Threat",
    "description": "Officials in the United States have backtracked on a threat to Iran, saying that the U.S. is not actually ready to strike, after several mainstream media outlets claimed that an attack was imminent. The information on an imminent attack came from \"anonymous s…",
    "link": "https://www.shtfplan.com/member-exclusive/american-officials-backtrack-iran-threat",
    "timestamp": "2026-02-02T16:00:53Z"
  },
  {
    "title": "Jay Z’s Alleged Son Rymir Claims Trump & Nicki Minaj Will Force Jay To Take DNA TEST!!",
    "description": "Rymir Claims Nicki Minaj Is Working With Trump to Reopen Jay-Z Paternity Case — But Can That Even Happen? Last month, Jay-Z finally put an end to one of the longest-running personal legal sagas in hip-hop history. After nearly 15 years of litigation, a federa…",
    "link": "https://mediatakeout.com/jay-zs-alleged-son-rymir-claims-trump-nicki-minaj-will-force-jay-to-take-dna-test/",
    "timestamp": "2026-02-02T16:00:33Z"
  },
  {
    "title": "Markiplier’s Indie Sci-Fi Horror Movie Thrashed ‘Melania’ at the Box Office This Weekend",
    "description": "'Iron Lung', independently funded by the Youtuber, narrowly lost the box office number 1 spot to 'Send Help'.",
    "link": "https://gizmodo.com/iron-lung-box-office-markiplier-melania-amazon-2000716665",
    "timestamp": "2026-02-02T16:00:23Z"
  },
  {
    "title": "US contractor sent Gaza plan to White House that would secure 300% profits",
    "description": "Gothams LLC’s draft proposal, obtained by the Guardian, suggests seven-year trucking and logistics monopoly",
    "link": "https://www.yahoo.com/news/articles/us-contractor-sent-gaza-plan-160012519.html",
    "timestamp": "2026-02-02T16:00:12Z"
  },
  {
    "title": "Texas Democrat Taylor Rehmet flips Republican state Senate seat Trump won by 17 points",
    "description": "Trump distanced himself from the loss Sunday, after urging votes for Wambsganss a day earlier.",
    "link": "https://www.pbs.org/newshour/politics/texas-democrat-taylor-rehmet-flips-republican-state-senate-seat-trump-won-by-17-points",
    "timestamp": "2026-02-02T16:00:03Z"
  },
  {
    "title": "EXCLUSIVE: Trump Announces New Resources for Combatting Drug Abuse",
    "description": "FIRST ON THE DAILY SIGNAL—The Department of Health and Human Services announced new resources to make drug abuse treatment more affordable and accessible for families... Read More\nThe post EXCLUSIVE: Trump Announces New Resources for Combatting Drug Abuse app…",
    "link": "https://www.dailysignal.com/2026/02/02/exclusive-trump-announces-new-resources-combatting-drug-abuse/",
    "timestamp": "2026-02-02T16:00:00Z"
  },
  {
    "title": "Ukraine Prepares for New Peace Talks Amid Escalating Russian Bombardment",
    "description": "Ukrainian President Volodymyr Zelenskyy said a new round of trilateral talks with Moscow and Washington is set for February 4-5 in the United Arab Emirates, with the expected gathering coming after another round of deadly Russian air strikes on civilian sites…",
    "link": "https://oilprice.com/Geopolitics/Africa/Ukraine-Prepares-for-New-Peace-Talks-Amid-Escalating-Russian-Bombardment.html",
    "timestamp": "2026-02-02T16:00:00Z"
  },
  {
    "title": "‘DemonCrat’ Delusions: Nicki Minaj Trades GRAMMY Trophies For Timeline Tantrum, Rants About Roc Nation, Trevor Noah & Other Stars Who Attended The Ceremony Instead Of Her",
    "description": "Nicki Minaj unleashes a tweetstorm of bizarre allegations, homophobia, and conspiracy theories against Grammys attendees.\nThe post ‘DemonCrat’ Delusions: Nicki Minaj Trades GRAMMY Trophies For Timeline Tantrum, Rants About Roc Nation, Trevor Noah & Other Star…",
    "link": "https://bossip.com/4337718/nicki-minaj-rants-about-roc-nation-trevor-noah-grammys/",
    "timestamp": "2026-02-02T15:59:47Z"
  },
  {
    "title": "Documents show Biden admin interaction with Trump elector probes",
    "description": "'Jack Smith's report shows his team came into Milwaukee and interviewed dozens of people and collected evidence'",
    "link": "https://www.wnd.com/2026/02/documents-show-biden-admin-interaction-trump-elector-probes/",
    "timestamp": "2026-02-02T15:58:40Z"
  },
  {
    "title": "“She’s Not OK”: Bombshell Report Details Nancy Mace’s Downward Spiral",
    "description": "South Carolina Representative Nancy Mace used to make her staffers go on late-night booze runs, clean her house, and boost her on forums discussing the “hottest women in Congress”—and that was all before things got really bad.In a sweeping profile published M…",
    "link": "https://newrepublic.com/post/206009/republican-nancy-mace-staff-alcohol-airbnbs",
    "timestamp": "2026-02-02T15:58:23Z"
  },
  {
    "title": "Donald Trump Vows to Sue Trevor Noah for Grammys Epstein Jab",
    "description": "Reading Time: 4 minutesDonald Trump is threatening to sue Trevor Noah as revenge after an Epstein jab at the 2026 Grammy Awards.\nDonald Trump Vows to Sue Trevor Noah for Grammys Epstein Jab was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/02/donald-trump-sue-trevor-noah-grammys/",
    "timestamp": "2026-02-02T15:58:05Z"
  },
  {
    "title": "Nigeria police says 80 abducted congregants return home, Christian group disputes claim",
    "description": "MAIDUGURI, Nigeria, Feb 2 (Reuters) - At least 80 congregants earlier believed to have been abducted by gunmen from three churches in northern Nigeria last month have ret… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/02/nigeria-police-says-80-abducted-congregants-return-home-christian-group-disputes-claim",
    "timestamp": "2026-02-02T15:57:47Z"
  },
  {
    "title": "US Envoy Confirms Modi-Trump Phone Call Amid Trade Deal Stalemate",
    "description": "The telephonic conversation between the two leaders comes amid prolonged trade deal talks between the countries, which have not resulted in the pact being finalised yet.",
    "link": "https://www.ndtvprofit.com/india/us-envoy-confirms-modi-trump-phone-call-amid-trade-deal-stalemate-10933512",
    "timestamp": "2026-02-02T15:57:27Z"
  },
  {
    "title": "Democrats win House race, flip Texas Senate seat",
    "description": "Christian Menefee won the special election for an open House seat in the Houston area",
    "link": "https://theweek.com/politics/democrats-win-house-texas-senate",
    "timestamp": "2026-02-02T15:57:19Z"
  },
  {
    "title": "The Kennedy Center Embarrassed Trump, so Now He Needs to Destroy It",
    "description": "Since 2007, Jezebel has been the Internet's most treasured source for everything celebrities, sex, and politics...with teeth.",
    "link": "https://www.jezebel.com/kennedy-center-closing-2-years-renovations-trump-artist-performer-cancelations-politics-reopening",
    "timestamp": "2026-02-02T15:56:57Z"
  },
  {
    "title": "NATO under strain",
    "description": "How History, Geography, Energy, and the Middle East deepen internal divisions, and why disunity endangers liberal democracy. Opinion.",
    "link": "https://www.israelnationalnews.com/news/421849",
    "timestamp": "2026-02-02T15:56:43Z"
  },
  {
    "title": "DOJ Makes Bizarre Attempt to Redact Trump's Face in Epstein Files Photo (Martha McHardy/The Daily Beast)",
    "description": "Martha McHardy / The Daily Beast:\nDOJ Makes Bizarre Attempt to Redact Trump's Face in Epstein Files Photo  —  CENSORED  —  The newly released materials contain frequent references to Donald Trump.  —  The Justice Department is drawing fresh scrutiny after rel…",
    "link": "https://www.memeorandum.com/260202/p39",
    "timestamp": "2026-02-02T15:55:03Z"
  },
  {
    "title": "Murdoch Paper Warns Trump That Stephen Miller’s Plot Is Backfiring After Humiliating GOP Defeat",
    "description": "A newspaper owned by Rupert Murdoch delivered a sharp warning to President Donald Trump after a high-profile Republican loss. In a new editorial, The Wall...",
    "link": "https://www.thedailybeast.com/murdoch-paper-the-wall-street-journal-warns-trump-that-stephen-millers-plot-is-backfiring/",
    "timestamp": "2026-02-02T15:54:28Z"
  },
  {
    "title": "Stocks Climb on Factory Data as Gold Selloff Eases: Markets Wrap",
    "description": "Wall Street kicked off February with gains in stocks as solid factory data bolstered optimism about Corporate America while losses in gold and silver moderated after Friday’s dramatic rout. Bond yields rose alongside the dollar. The crypto world rebounded, wi…",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-climb-on-factory-data-as-gold-selloff-eases-markets-wrap",
    "timestamp": "2026-02-02T15:54:21Z"
  },
  {
    "title": "Donald Trump threatens to sue Grammys host Trevor Noah over Epstein joke",
    "description": "Comedian Trevor Noah has found himself facing the wrath of President Donald Trump after making a joke about Jeffrey Epstein at last night’s (Sunday 1 February) Grammy Awards. Noah hosted the annual music awards ceremony for the sixth and final time on Sunday …",
    "link": "https://www.thepinknews.com/2026/02/02/donald-trump-threatens-to-sue-grammys-host-trevor-noah-over-epstein-joke/",
    "timestamp": "2026-02-02T15:54:19Z"
  },
  {
    "title": "Iran evaluates nuclear diplomacy with US to dispute concerns of war",
    "description": "Tensions are running high amid a military buildup by the U.S. Navy near Iran, following a violent crackdown against anti-government demonstrations last month, the deadliest domestic unrest in Iran since its 1979 revolution.",
    "link": "https://nypost.com/2026/02/02/world-news/iran-evaluates-nuclear-diplomacy-with-us-to-dispute-war-concerns/",
    "timestamp": "2026-02-02T15:54:04Z"
  },
  {
    "title": "WHO chief says US exit allows agency reset",
    "description": "The head of the WHO stated that the US exit in 2025 has created an opportunity to forge a leaner, more focused global health agency.\n\nRead More: https://punchng.com/who-chief-says-us-exit-allows-agency-reset/",
    "link": "https://punchng.com/who-chief-says-us-exit-allows-agency-reset/",
    "timestamp": "2026-02-02T15:53:35Z"
  }
]