[
  {
    "title": "Trump warns of higher tariffs on India over Russian oil purchases",
    "description": "NEW DELHI, Jan ‌5 : The United States could raise tariffs on India if New Delhi doesn't meet Washington's demand to curb purchases of Russian oil, President Donald Trump told reporters aboard Air Force One. \"Modi is a good guy. He knew I was not happy, and it…",
    "link": "https://www.channelnewsasia.com/business/trump-warns-higher-tariffs-india-over-russian-oil-purchases-5801816",
    "timestamp": "2026-01-05T04:55:15Z"
  },
  {
    "title": "Trump Considers Attack Against Colombia, Accuses President of Producing Cocaine",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump accused Colombian President Gustavo Petro of producing cocaine and didn't rule out an attack on the country.",
    "link": "https://sputnikglobe.com/20260105/trump-considers-attack-against-colombia-accuses-president-of-producing-cocaine-1123418981.html",
    "timestamp": "2026-01-05T04:54:02Z"
  },
  {
    "title": "Kim Jong Un oversees hypersonic missile tests ahead of key party congress",
    "description": "North Korea says Kim Jong Un oversaw hypersonic missile tests as the regime boosts weapons displays ahead of a key party congress.",
    "link": "https://www.israelnationalnews.com/news/420405",
    "timestamp": "2026-01-05T04:53:08Z"
  },
  {
    "title": "Venezuela’s Rodriguez Asks US for Cooperation After Maduro Raid - Bloomberg.com",
    "description": "Venezuela’s Rodriguez Asks US for Cooperation After Maduro RaidBloomberg.com Venezuelans hunker down, apprehensive about what comes nextCNN Trump’s intervention in Venezuela: the 3 warnings for the worldThe Conversation Trump Threatens Venezuela’s New Leader …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180515949",
    "timestamp": "2026-01-05T04:53:03Z"
  },
  {
    "title": "Ukraine: Deadly Russian attack hits Kyiv, capital region",
    "description": "The overnight Russian air attack killed at least two people in Kyiv and capital region. Meanwhile, Donald Trump has said he doesn't believe Russia's claim that Ukraine attacked Putin's residence. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-2-killed-in-russian-attack-on-kyiv-capital-region/live-75387687",
    "timestamp": "2026-01-05T04:53:00Z"
  },
  {
    "title": "Trump says Cuba is ‘ready to fall’ after capture of Venezuela’s Maduro",
    "description": "President Trump says Cuba is “ready to fall\" after the U.S. operation that captured Venezuela’s Nicolás Maduro, cutting off a key economic and security lifeline to Havana.",
    "link": "https://www.foxnews.com/world/trump-says-cuba-ready-fall-after-capture-venezuelas-maduro",
    "timestamp": "2026-01-05T04:51:14Z"
  },
  {
    "title": "Bitcoin briefly hits $93,000 as crypto market extends new year rally with $260 million in liquidations",
    "description": "The rally in crypto was mirrored by a surge in commodities and Asian equities, driven by AI-led momentum and geopolitical developments.",
    "link": "https://www.coindesk.com/markets/2026/01/05/crypto-markets-continue-new-year-run-as-bitcoin-briefly-hits-usd93k-ether-rallies",
    "timestamp": "2026-01-05T04:45:31Z"
  },
  {
    "title": "How the West misjudged Russia’s dissidents and helped shape Putin’s rise as Soviet Union fell",
    "description": "Mikhail Zygar’s latest book revisits the figures who defined the USSR’s last years and the turbulent decades that followed",
    "link": "https://www.irishtimes.com/culture/books/review/2026/01/05/how-the-west-misjudged-russias-dissidents-and-helped-shape-putins-rise-as-soviet-union-fell/",
    "timestamp": "2026-01-05T04:45:00Z"
  },
  {
    "title": "Crude oil futures decline as markets analyse US action in Venezuela",
    "description": "At 9.59 am on Monday, March Brent oil futures were at $60.61, down by 0.23%, and February crude oil futures on WTI (West Texas Intermediate) were at $57.13, down by 0.33%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-decline-as-markets-analyse-us-action-in-venezuela/article70472914.ece",
    "timestamp": "2026-01-05T04:44:34Z"
  },
  {
    "title": "Venezuela's Maduro to appear in US court, Trump says further strikes possible",
    "description": "Jan 5 (Reuters) - Deposed Venezuelan President Nicolas Maduro was due to appear ‌in a U.S. court on Monday after his weekend capture by American forces, with U.S. President Donald Trump leaving open the possibility of another incursion if ‌the United States d…",
    "link": "https://www.thestar.com.my/news/world/2026/01/05/venezuela039s-maduro-to-appear-in-us-court-trump-says-further-strikes-possible",
    "timestamp": "2026-01-05T04:42:00Z"
  },
  {
    "title": "Russia scores highest Ukraine gains since first year of war",
    "description": "Kyiv, Ukraine (AFP) Jan 2, 2026\n\n Russia's battlefield gains in Ukraine last year were the highest since 2022, an AFP analysis showed, as Kyiv was set to host security advisers from allied states on Saturday despite Moscow's unrelenting strikes. \n\nUkrainian P…",
    "link": "https://www.spacewar.com/reports/Russia_scores_highest_Ukraine_gains_since_first_year_of_war_999.html",
    "timestamp": "2026-01-05T04:41:02Z"
  },
  {
    "title": "Trump warns of higher tariffs on India over Russian oil purchases",
    "description": "NEW DELHI, Jan 5 () - The United States could raise tariffs on India if New Delhi doesn't meet Washington's demand ​to curb purchases of Russian oil...",
    "link": "https://www.yahoo.com/news/articles/trump-warns-higher-tariffs-india-043546611.html",
    "timestamp": "2026-01-05T04:35:46Z"
  },
  {
    "title": "Jimmy Kimmel Pokes Fun at Future of Late Night, Donald Trump in Critics Choice Acceptance Speech - The Hollywood Reporter",
    "description": "Jimmy Kimmel Pokes Fun at Future of Late Night, Donald Trump in Critics Choice Acceptance SpeechThe Hollywood Reporter Jimmy Kimmel thanks 'Donald Jennifer Trump' for his Critics Choice winUSA Today Jimmy Kimmel thanks 'Donald Jennifer Trump' for his Critics …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180515869",
    "timestamp": "2026-01-05T04:32:35Z"
  },
  {
    "title": "Trump Says US Needs 'Total Access' to Post-Maduro Venezuela (Bloomberg)",
    "description": "Bloomberg:\nTrump Says US Needs ‘Total Access’ to Post-Maduro Venezuela  —  President Donald Trump said the US needs “total access” to Venezuela as questions mount about the country's leadership following the capture of President Nicolás Maduro.  —  “We need t…",
    "link": "https://www.memeorandum.com/260104/p72",
    "timestamp": "2026-01-05T04:30:01Z"
  },
  {
    "title": "Delcy Rodríguez becomes Venezuela's interim president after Maduro's ouster",
    "description": "Venezuela's interim President Delcy Rodríguez has taken the place of her ally President Nicolás Maduro who was captured by the United States in a nighttime military operation",
    "link": "https://abcnews.go.com/International/wireStory/delcy-rodrguez-venezuelas-interim-president-after-maduros-ouster-128897095",
    "timestamp": "2026-01-05T04:30:01Z"
  },
  {
    "title": "After Maduro, who’s next? Trump’s comments spur anxieties about his plans for Greenland and Cuba",
    "description": "“It’s so strategic right now. Greenland is covered with Russian and Chinese ships all over the place,” Trump told reporters Sunday.",
    "link": "https://apnews.com/article/trump-venezuela-greenland-cuba-571aac35e259857fd512c46f5af11e4d",
    "timestamp": "2026-01-05T04:29:58Z"
  },
  {
    "title": "Jimmy Kimmel Thanks ‘Donald Jennifer Trump’ After Winning at Critics Choice Awards 2026",
    "description": "Jimmy Kimmel singled out Donald Trump during his acceptance speech this weekend! The 58-year-old late night host picked up the award for Best Talk Show at the 2026 Critics Choice Awards on Sunday evening (January 4) at Barker Hanger in Santa Monica, Calif. Du…",
    "link": "https://www.justjared.com/2026/01/04/jimmy-kimmel-thanks-donald-jennifer-trump-after-winning-at-critics-choice-awards-2026/",
    "timestamp": "2026-01-05T04:29:18Z"
  },
  {
    "title": "Cuba says Cuban officers were killed in US operation in Venezuela",
    "description": "Cuba is a close ally of Venezuela’s government and has sent military and police forces to assist in operations for years.",
    "link": "https://www.wmur.com/article/cuba-32-officers-killed-us-operation-venezuela/69912958",
    "timestamp": "2026-01-05T04:26:02Z"
  },
  {
    "title": "Trump Says Second Venezuela Strike Possible If Government Does Not Cooperate",
    "description": "Trump's comments to reporters aboard Air Force One raised the possibility of further U.S. military interventions in Latin America.",
    "link": "https://www.huffpost.com/entry/trump-second-venezuela-strike-possible_n_695b3c31e4b09f7f2fbcffa3",
    "timestamp": "2026-01-05T04:25:29Z"
  },
  {
    "title": "Trump's New Energy Doctrine: Regime Change, Then Drill",
    "description": "Trump's New Energy Doctrine: Regime Change, Then Drill\n \nAuthored by Philip Wegmann via RealClearPolitics,\nPresident Donald Trump has embarked on his own regime-change mission. And this time the United States intends to keep the oil.\nAmerican Special Operatio…",
    "link": "https://biztoc.com/x/bed49de688e3eae6",
    "timestamp": "2026-01-05T04:23:38Z"
  },
  {
    "title": "Cuba says Cuban officers were killed in US operation in Venezuela",
    "description": "Cuba is a close ally of Venezuela’s government and has sent military and police forces to assist in operations for years.",
    "link": "https://www.wlwt.com/article/cuba-32-officers-killed-us-operation-venezuela/69912958",
    "timestamp": "2026-01-05T04:23:36Z"
  },
  {
    "title": "Geopolitical risk returns to fore as Venezuela upheaval tests investor sentiment",
    "description": "Geopolitical risk has resurfaced as a key market driver after the U.S. capture of Venezuela’s president, with investors weighing near-term uncertainty against longer-term implications for oil supply, global markets and risk assets.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/geopolitical-risk-returns-to-fore-as-venezuela-upheaval-tests-investor-sentiment/articleshow/126344297.cms",
    "timestamp": "2026-01-05T04:19:05Z"
  },
  {
    "title": "After Maduro, Who's Next? Trump Spurs Speculation About His Plans For Greenland, Cuba And Colombia",
    "description": "Trump is renewing his calls for an American takeover of the Danish territory of Greenland and is threatening Colombia with military action over its drug trade.",
    "link": "https://www.huffpost.com/entry/trump-greenland-cuba-speculation_n_695b3b14e4b09f7f2fbcfee9",
    "timestamp": "2026-01-05T04:17:34Z"
  },
  {
    "title": "Rupee slips to 90.24 against dollar amid Venezuela geopolitical tensions",
    "description": "The rupee slipped to 90.24 against the US dollar in early trade amid global geopolitical tensions, even as lower crude prices and rising forex reserves offered support.",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-slips-to-9024-against-dollar-amid-venezuela-geopolitical-tensions/article70472877.ece",
    "timestamp": "2026-01-05T04:16:38Z"
  },
  {
    "title": "OPEN LETTER TO LIBERALS, DEMOCRATS, LIBTARDS AND THE GENERAL WOKE MOB",
    "description": "I see too many f-ers in here gripping their ethically sourced oat milk latte so hard the cardboard sleeve is whimpering, staring at footage of us, actual Venezuelan human beings who have spent the last decade eating sleep for dinner, cheering for the Orange M…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360443/posts",
    "timestamp": "2026-01-05T04:14:57Z"
  },
  {
    "title": "Trump says hell come back to meet Kim Jong Un soon, downplays missile test",
    "description": "U.S. President Donald Trump cast doubt on the chances of meeting North Korean leader Kim Jong Un during his trip to the Korean Peninsula this week, but said he will “come back” to the area for a meeting soon. Speaking to reporters aboard Air Force One on his …",
    "link": "https://www.nknews.org/?p=963220",
    "timestamp": "2026-01-05T04:10:12Z"
  },
  {
    "title": "Hortman children respond after President Trump shares conspiracy theory about their parents murder",
    "description": "The video Trump shared also suggests Hortman was targeted for voting for a proposal that stripped healthcare funding for undocumented adults.",
    "link": "https://www.kare11.com/article/news/local/hortman-children-respond-after-president-trump-shares-conspiracy-theory-about-their-parents-murder-mn/89-eb9f77b0-fb11-4b04-b0fa-f73ffec6a90a",
    "timestamp": "2026-01-05T04:08:28Z"
  },
  {
    "title": "Sensex falls over 200 pts, Nifty below 26,300 as Venezuela risk tempers earnings optimism",
    "description": "Indian equities experienced volatility on Monday, with the Sensex and Nifty fluctuating as investors balanced positive corporate earnings against escalating geopolitical risks. Early gains were tempered by concerns over U.S. military actions in Venezuela, lea…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-200-pts-nifty-below-26300-as-venezuela-risk-tempers-earnings-optimism/articleshow/126344076.cms",
    "timestamp": "2026-01-05T04:06:14Z"
  },
  {
    "title": "Before toppling Maduro, the US spent decades pressuring Venezuelan leaders over its oil wealth",
    "description": "Hugo Chavez and Nicolas Maduro long resisted US attempts to influence Venezuelan politics and exert control over its oil reserves.",
    "link": "https://theconversation.com/before-toppling-maduro-the-us-spent-decades-pressuring-venezuelan-leaders-over-its-oil-wealth-272679",
    "timestamp": "2026-01-05T04:01:18Z"
  },
  {
    "title": "US markets brace for volatile start as jobs data and geopolitics take centre stage",
    "description": "US markets head into the first full trading week of 2026 facing potential volatility as investors track geopolitical developments, key economic data including jobs and inflation, and the start of the corporate earnings season.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-markets-brace-for-volatile-start-as-jobs-data-and-geopolitics-take-centre-stage/articleshow/126344087.cms",
    "timestamp": "2026-01-05T03:58:47Z"
  },
  {
    "title": "\"PM Modi knew I was not happy\": Trump warns of more tariffs if India continues Russian oil import",
    "description": "Trump's new warning to India comes amid growing scrutiny in Washington over India's energy trade with Russia, even as New Delhi has defended its oil purchases as essential for domestic energy security",
    "link": "https://www.thehindubusinessline.com/news/pm-modi-knew-i-was-not-happy-trump-warns-of-more-tariffs-if-india-continues-russian-oil-import/article70472855.ece",
    "timestamp": "2026-01-05T03:53:11Z"
  },
  {
    "title": "Trump’s intervention in Venezuela: the 3 warnings for the world",
    "description": "The Trump administration has used US domestic laws to justify capturing Venezuelan President Nicolás Maduro. It’s a clear case of US exceptionalism.",
    "link": "https://theconversation.com/trumps-intervention-in-venezuela-the-3-warnings-for-the-world-272696",
    "timestamp": "2026-01-05T03:52:02Z"
  },
  {
    "title": "Trump says Ukraine did not target Putin residence in drone attack",
    "description": "Donald Trump says US officials found no evidence Ukraine targeted Vladimir Putin’s residence in a drone attack, disputing Russian claims amid peace talks.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-says-ukraine-did-not-target-putin-residence-in-drone-attack/article70472856.ece",
    "timestamp": "2026-01-05T03:51:20Z"
  },
  {
    "title": "Cuba says 32 Cuban officers were killed in US operation in Venezuela",
    "description": "Cuba has acknowledged the deaths of 32 Cubans in the American military operation that ousted Venezuela's leader over the weekend",
    "link": "https://abcnews.go.com/International/wireStory/cuba-32-cuban-officers-killed-us-operation-venezuela-128899713",
    "timestamp": "2026-01-05T03:49:49Z"
  },
  {
    "title": "Venezuela's oil and mining sectors: large potential, weak infrastructure",
    "description": "Venezuela has the world's largest estimated oil reserves but its crude output remains at a fraction of capacity ‍due to decades of mismanagement, lack of investment and sanctions",
    "link": "https://www.thehindubusinessline.com/news/world/venezuelas-oil-and-mining-sectors-large-potential-weak-infrastructure/article70472758.ece",
    "timestamp": "2026-01-05T03:45:45Z"
  },
  {
    "title": "Slain Minnesota lawmaker's children call on Trump to remove social media video amplifying false claims about her death (Raquel Coronell Uribe/NBC News)",
    "description": "Raquel Coronell Uribe / NBC News:\nSlain Minnesota lawmaker's children call on Trump to remove social media video amplifying false claims about her death  —  Minnesota State Rep. Melissa Hortman and her husband, Mark, were killed in June.  —  The children of s…",
    "link": "https://www.memeorandum.com/260104/p66",
    "timestamp": "2026-01-05T03:40:00Z"
  },
  {
    "title": "US operation in Venezuela kills 32 Cuban officers, Havana confirms",
    "description": "Cuba says 32 of its military and police officers were killed during a US operation in Venezuela. Havana announced two days of mourning after the strike.",
    "link": "https://www.thehindubusinessline.com/news/world/us-operation-in-venezuela-kills-32-cuban-officers-havana-confirms/article70472843.ece",
    "timestamp": "2026-01-05T03:39:02Z"
  },
  {
    "title": "Gold price rises after US captures Venezuela's Maduro",
    "description": "Money moved into \"safe-haven\" assets as the operation increased concerns about geopolitical risks.",
    "link": "https://www.bbc.com/news/articles/crrnw08qvg7o",
    "timestamp": "2026-01-05T03:38:03Z"
  },
  {
    "title": "Top Business & Market Headlines Today — BL Morning Report, Jan 5, 2026",
    "description": "Stay updated with top business news, market trends, and economic insights in the BL Morning Report for Jan 5, 2026.",
    "link": "https://www.thehindubusinessline.com/multimedia/audio/top-business-amp-market-headlines-today-bl-morning-report-jan-5-2026/article70470435.ece",
    "timestamp": "2026-01-05T03:30:00Z"
  },
  {
    "title": "US-Venezuela tensions: Here’s how crude, gold, dollar are reacting on Monday morning",
    "description": "Global markets opened in 2026 on edge after a U.S. military operation led to the capture of Venezuela’s President Nicolas Maduro. The escalation has heightened geopolitical risk, triggering volatility across crude oil, precious metals, currencies and equities…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-venezuela-tensions-heres-how-crude-gold-dollar-are-reacting-on-monday-morning/articleshow/126343855.cms",
    "timestamp": "2026-01-05T03:29:31Z"
  },
  {
    "title": "'He knows': Psychologist reveals why Trump lashes out at reports about his health",
    "description": "A prominent psychologist revealed on Sunday some of the reasons why President Donald Trump rages at reports of his failing physical and mental health. Trump has recently lashed out at The Wall Street Journal and The New York Times for reporting on his health.…",
    "link": "https://www.rawstory.com/trump-2674846839/",
    "timestamp": "2026-01-05T03:28:21Z"
  },
  {
    "title": "ONGC, Reliance and other oil-linked stocks in focus after U.S. raids Venezuela",
    "description": "Oil-linked stocks including ONGC, Reliance Industries, Oil India and Indian Oil Corporation are set to be in focus after a dramatic U.S. military raid in Venezuela reshaped political control in the oil-rich nation and pushed crude prices lower, even as broker…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-reliance-and-other-oil-linked-stocks-in-focus-after-u-s-raids-venezuela/articleshow/126343701.cms",
    "timestamp": "2026-01-05T03:22:06Z"
  },
  {
    "title": "What to know about the protests shaking Iran as tensions remain high over its nuclear program",
    "description": "Widespread protests have gripped Iran, fueled by economic woes and a collapsing currency, now trading at some 1.4 million to $1. The Islamic Republic faces mounting pressure as its  Axis of Resistance  weakens and U.S. threats loom.  Decades of tense U.S.-Ira…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/what-to-know-about-the-protests-shaking-iran-as-tensions-remain-high-over-its-nuclear-program/articleshow/126343729.cms",
    "timestamp": "2026-01-05T03:20:39Z"
  },
  {
    "title": "'We’re in charge': Trump claims US control of Venezuela, says nation is 'dead' and oil barely flowing",
    "description": "US control of Venezuela: US President Donald Trump asserted American control over Venezuela following a military operation that struck near Caracas, claiming no US casualties.  Meanwhile, residents in Catia La Mar described widespread damage and fear, with ho…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/were-in-charge-trump-claims-us-control-of-venezuela-says-nation-is-dead-and-oil-barely-flowing/articleshow/126343514.cms",
    "timestamp": "2026-01-05T03:16:45Z"
  },
  {
    "title": "BSEB Bihar STET result 2025 expected today? Here is what we know",
    "description": "Bihar STET Result 2025 is expected to be declared today, January 5, by the Bihar School Examination Board. Thousands of candidates are awaiting the announcement of their scorecard, which will be available online. Qualifying this exam makes candidates eligible…",
    "link": "https://timesofindia.indiatimes.com/education/news/bseb-bihar-stet-result-2025-expected-today-here-is-what-we-know/articleshow/126343628.cms",
    "timestamp": "2026-01-05T03:14:52Z"
  },
  {
    "title": "Trump says that Ukraine didn't target Putin residence",
    "description": "U.S. national security officials have determined that Ukraine did not target a residence belonging to Russian President Vladimir Putin in a drone attack last week",
    "link": "https://www.wtae.com/article/trump-ukraine-putin-residence-drone-strike-kremlin/69912555",
    "timestamp": "2026-01-05T03:14:22Z"
  },
  {
    "title": "Cuba says 32 Cuban officers were killed in US action in Venezuela",
    "description": "An American military operation in Venezuela killed 32 Cuban officers over the weekend, the Cuban government said Sunday in the first official acknowledgement of the deaths.",
    "link": "https://www.wpxi.com/news/national/cuba-says-32-cuban-officers-were-killed-us-action-venezuela/PKFP7BFTQNGDPEUBQI56KUKV64/",
    "timestamp": "2026-01-05T03:14:02Z"
  },
  {
    "title": "Trump says he doesn't believe Ukraine struck Putin residence",
    "description": "U.S. President ‌Donald Trump said he did not believe that an alleged ⁠Ukrainian strike on President ‍Vladimir Putin's residence took ‍place ‍as claimed by ⁠Russia. &quot;I don't believe that strike happened,&quot; ​Trump told reporters on Sunday aboard Air Fo…",
    "link": "https://japantoday.com/category/world/trump-says-he-doesn%27t-believe-ukraine-struck-putin-residence",
    "timestamp": "2026-01-05T03:12:18Z"
  },
  {
    "title": "Two Colorado Hospitals Stop Sex Change Drugs for Minors, Citing HHS Crackdown",
    "description": "Two hospitals in Colorado have halted giving sex change drugs to minors, citing a crackdown from President Donald Trump's Department of Health and Human Services (HHS). \nThe post Two Colorado Hospitals Stop Sex Change Drugs for Minors, Citing HHS Crackdown ap…",
    "link": "https://www.breitbart.com/politics/2026/01/04/two-colorado-hospitals-stop-sex-change-drugs-minors-citing-hhs-crackdown/",
    "timestamp": "2026-01-05T03:12:15Z"
  },
  {
    "title": "Trump vows US 'in charge' of Venezuela as he reveals if he's spoken to Delcy Rodríguez",
    "description": "President Trump claimed the U.S. is \"in charge\" of Venezuela after Maduro's arrest, outlining plans to rebuild economy and delay elections until recovery is complete.",
    "link": "https://www.foxnews.com/politics/trump-vows-us-in-charge-venezuela-he-reveals-hes-spoken-delcy-rodriguez",
    "timestamp": "2026-01-05T03:08:04Z"
  },
  {
    "title": "Elon Musk's Starlink offers free internet access in Venezuela following U.S. airstrikes and Maduro’s arrest",
    "description": "SpaceX's Starlink is offering free broadband internet service to the people of Venezuela through Feb. 3, amid the fallout of a U.S. military operation in the country.",
    "link": "https://www.cnbc.com/2026/01/05/elon-musk-spacex-starlink-free-internet-venezuela-us-raid-maduro.html",
    "timestamp": "2026-01-05T03:05:02Z"
  },
  {
    "title": "Taiwan fortifies silicon shield with 2026 push to set global chip agenda",
    "description": "As AI server and semiconductor companies look set to close out a profitable 2025, recent Chinese military encirclement exercises and live-fire drills around Taiwan have once again highlighted the island's geopolitical tensions. US President Donald Trump has s…",
    "link": "https://www.digitimes.com/news/a20260105PD210/taiwan-ai-server-2025-moea-technology.html",
    "timestamp": "2026-01-05T03:04:41Z"
  },
  {
    "title": "Saudi Arabia accident: 4 from Kerala killed as car collides with truck; 3 children injured",
    "description": "A tragic road accident near Madinah, Saudi Arabia, claimed the lives of four members of a family from Malappuram, Kerala. Their car collided with a fodder-laden truck, resulting in the deaths of Abdul Jaleel, his wife Tasna, their son Aadil, and Jaleel's moth…",
    "link": "https://timesofindia.indiatimes.com/city/kozhikode/saudi-arabia-accident-4-from-kerala-killed-as-car-collides-with-truck-3-children-injured/articleshow/126343335.cms",
    "timestamp": "2026-01-05T03:02:37Z"
  },
  {
    "title": "Americans Predict Challenging 2026 Across 13 Dimensions",
    "description": "Americans expect a difficult 2026, expressing pessimism about most economic, political and global matters — with the stock market a notable exception.",
    "link": "https://news.gallup.com/poll/700448/americans-predict-challenging-2026-across-dimensions.aspx",
    "timestamp": "2026-01-05T03:00:00Z"
  },
  {
    "title": "Unverified FBI tip claims Trump witnessed Epstein victim's baby being killed, dumped in Lake Michigan",
    "description": "In December 2025, the U.S. Department of Justice released an FBI tip in which a complainant alleged President Donald Trump witnessed her uncle kill her newborn child and dispose of the body in Lake Michigan when she was 13 and being trafficked for sex by Jeff…",
    "link": "https://www.snopes.com//fact-check/trump-lake-michigan-baby/",
    "timestamp": "2026-01-05T03:00:00Z"
  },
  {
    "title": "Gonzalo Garcia treble helps Real Madrid thrash Betis; Atletico hopes dented",
    "description": "Madrid, second, cut Barca's lead back down to four points after the champions edged Espanyol 2-0 in a Catalan derby on Saturday. Atletico Madrid, fourth, were held 1-1 at Real Sociedad later on. Madrid's victory eased the pressure on Alonso, who scraped throu…",
    "link": "https://timesofindia.indiatimes.com/sports/football/top-stories/gonzalo-garcia-treble-helps-real-madrid-thrash-betis-atletico-hopes-dented/articleshow/126343384.cms",
    "timestamp": "2026-01-05T02:58:00Z"
  },
  {
    "title": "Slain lawmaker's children urge Trump to remove post with false claims about her death",
    "description": "The children of slain Minnesota state lawmaker Melissa Hortman are urging President Donald Trump to remove a post on Truth Social that promotes a conspiracy theory alleging the state's governor, Tim Walz, was involved in Hortman’s death",
    "link": "https://www.nbcnews.com/politics/donald-trump/slain-minnesota-lawmakers-children-call-trump-remove-social-media-vide-rcna252231",
    "timestamp": "2026-01-05T02:54:33Z"
  },
  {
    "title": "You’re Next! Trump Threatens Colombia’s ‘Sick’ President His Days Are Numbered After Maduro’s Capture",
    "description": "President Trump issued a not-so-thinly-veiled threat to Colombia's Gustavo Petro that he will be the next Latin American leader ousted by the U.S. Military.\nThe post You’re Next! Trump Threatens Colombia’s ‘Sick’ President His Days Are Numbered After Maduro’s…",
    "link": "https://www.mediaite.com/politics/youre-next-trump-threatens-colombias-sick-president-his-days-are-numbered-after-maduros-capture/",
    "timestamp": "2026-01-05T02:53:43Z"
  },
  {
    "title": "Winning: Washington Post Praises Trump Enforcing 'Justice in Venezuela'",
    "description": "The Washington Post editorial board on Saturday broke with the predictable Democrat response of condemning President Donald Trump’s capture of embattled Venezuelan leader Nicolas Maduro and his wife Celia Flores and called the military operation “a major vict…",
    "link": "https://www.breitbart.com/politics/2026/01/04/washington-post-praises-trump-enforcing-justice-venezuela/",
    "timestamp": "2026-01-05T02:51:53Z"
  },
  {
    "title": "APSC Grade 4 answer key 2025 released for General Studies: Check direct link and steps to raise objections here",
    "description": "The Assam Public Service Commission has released the provisional answer key for the Grade IV General Studies recruitment exam held on January 4. Candidates can download the PDF from the official website and raise objections until January 7 with supporting doc…",
    "link": "https://timesofindia.indiatimes.com/education/news/apsc-grade-4-answer-key-2025-released-for-general-studies-check-direct-link-and-steps-to-raise-objections-here/articleshow/126342966.cms",
    "timestamp": "2026-01-05T02:48:42Z"
  },
  {
    "title": "Former hostage negotiator says he doesn't see Maduro as 'a bloodthirsty drug dealer'",
    "description": "Roger Carstens, told CBS' \"60 Minutes\" that he doesn't consider Venezuelan dictator Nicolás Maduro a \"bloodthirsty drug dealer\" based on his experiences.",
    "link": "https://www.foxnews.com/media/former-hostage-negotiator-says-he-doesnt-see-maduro-a-bloodthirsty-drug-dealer",
    "timestamp": "2026-01-05T02:46:26Z"
  },
  {
    "title": "Cuba says 32 of its officers were killed in U.S. raid on Venezuela",
    "description": "An American military operation in Venezuela killed 32 Cuban officers over the weekend, the Cuban government said Sunday in the first official acknowledgement of the deaths.",
    "link": "https://www.cbc.ca/news/world/venezuela-us-cuba-attack-9.7033299",
    "timestamp": "2026-01-05T02:44:01Z"
  },
  {
    "title": "UP: Man stabbed to death, kin injured as lovemarriage dispute turns violent during Panchayat; 2 held",
    "description": "A love marriage dispute escalated violently in Etah, India, leading to a fatal stabbing. A panchayat called to resolve an elopement turned deadly when the woman's family allegedly attacked the groom's relatives. Sahibaa Singh, 25, was killed, and Surjeet Sing…",
    "link": "https://timesofindia.indiatimes.com/city/agra/up-man-stabbed-to-death-another-critical-as-lovemarriage-dispute-turns-violent-during-panchayat/articleshow/126336636.cms",
    "timestamp": "2026-01-05T02:43:34Z"
  },
  {
    "title": "Tech firms lead Asian markets higher, oil swings after Maduro ouster",
    "description": "Asian stocks rose Monday on the back of a fresh rally in tech firms and oil fluctuated as investors weighed the impact of the US ouster of Venezuelan leader Nicolas Maduro. While the South American leader’s removal added to geopolitical risk on global markets…",
    "link": "https://www.digitaljournal.com/world/tech-firms-lead-asian-markets-higher-oil-swings-after-maduro-ouster/article",
    "timestamp": "2026-01-05T02:42:20Z"
  },
  {
    "title": "Trump warns Venezuela: If they don’t behave, we will strike again",
    "description": "US President warns the US is ready for a second strike on Venezuela if regime figures fail to comply, hours after warning interim leader Delcy Rodríguez to “do what’s right\" or “pay a heavy price\".",
    "link": "https://www.israelnationalnews.com/news/420401",
    "timestamp": "2026-01-05T02:41:16Z"
  },
  {
    "title": "APSC CCE Mains result 2025 declared: 879 candidates selected for interview, direct link for merit list here",
    "description": "The Assam Public Service Commission has released the CCE Mains Result 2025 on its official website. A total of 879 candidates have successfully qualified for the final interview round. This marks a significant achievement for aspirants, with the interview ser…",
    "link": "https://timesofindia.indiatimes.com/education/news/apsc-cce-mains-result-2025-declared-879-candidates-selected-for-interview-direct-link-for-merit-list-here/articleshow/126343099.cms",
    "timestamp": "2026-01-05T02:40:17Z"
  },
  {
    "title": "'They are here for regressive thoughts': Shiv Sena's Shaina NC slams Aaditya Thackeray",
    "description": "Shaina NC said, \"Aaditya Thackeray inducted Rashid Mamu. Aaditya Thackeray joined Umar Khalid at the Gateway protest. They are plotting to turn Mumbai into Mamdani, but we will never let that happen. We are here for progressive politics. They are here for reg…",
    "link": "https://timesofindia.indiatimes.com/india/they-are-here-for-regressive-thoughts-shiv-senas-shaina-nc-slams-aaditya-thackeray/articleshow/126343056.cms",
    "timestamp": "2026-01-05T02:38:26Z"
  },
  {
    "title": "FIFA Peace Prize winner outlines laundry list of invadable countries",
    "description": "Donald the Dove met the press today and…um: Trump in a single gaggle on Air Force One just threatened: — a second strike against Venezuela — Cuba — Mexico — Colombia — Iran — Greenland (which in turn would be an attack on the EU and Denmark) — Aaron Rupar (@a…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/fifa-peace-prize-winner-outlines-laundry-list-of-invadable-countries",
    "timestamp": "2026-01-05T02:37:43Z"
  },
  {
    "title": "'Consider the pain': Children of slain Dem call on Trump to take down 'false' video",
    "description": "The children of a slain Democratic lawmaker called out President Donald Trump on Sunday after he shared a \"false\" video on Truth Social that they claim \"twisted\" the vote of their late mother. On Sunday, Trump posted a video on Truth Social that claimed Minne…",
    "link": "https://www.rawstory.com/democrats-2674846817/",
    "timestamp": "2026-01-05T02:37:36Z"
  },
  {
    "title": "How one jump turned Michael Jordan into a cultural phenomenon and built a billion-dollar legacy",
    "description": "The iconic \"Jumpman\" logo, synonymous with Michael Jordan, was not captured during a dunk but a ballet-inspired leap. Photographer Jacobus Rentmeester instructed Jordan to perform a \"grand jeté\" for a Life magazine shoot in 1984. This graceful pose, later ref…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/how-one-jump-turned-michael-jordan-into-a-cultural-phenomenon-and-built-a-billion-dollar-legacy/articleshow/126343010.cms",
    "timestamp": "2026-01-05T02:37:27Z"
  },
  {
    "title": "Team Trump knows it needs fast (but orderly) free elections in Venezuela",
    "description": "President Donald Trump’s remarks Saturday had led to fears of just that — a “pragmatic” approach that would see the regime that’s impoverished the country hang on in exchange for oil and (empty) promises to abandon its alliances with Iran, Hezbollah, Russian …",
    "link": "https://nypost.com/2026/01/04/opinion/team-trump-knows-it-needs-fast-but-orderly-free-elections-in-venezuela/",
    "timestamp": "2026-01-05T02:36:09Z"
  },
  {
    "title": "Cuba is left reeling in the aftermath of the Venezuela strike | CNN",
    "description": "For months as the US military prepared to strike Venezuela, many Cubans have asked a simple, if disconcerting, question: “Are we next?”",
    "link": "https://www.cnn.com/2026/01/04/americas/cuba-uncertain-future-after-venezuela-strike",
    "timestamp": "2026-01-05T02:35:00Z"
  },
  {
    "title": "Carney Stresses Venezuela’s Sovereignty After Call With Machado",
    "description": "Canadian Prime Minister Mark Carney spoke with Venezuelan opposition leader Maria Corina Machado Sunday and said his government supports “a peaceful, Venezuelan-led transition of power.”",
    "link": "https://financialpost.com/pmn/business-pmn/carney-stresses-venezuelas-sovereignty-after-call-with-machado",
    "timestamp": "2026-01-05T02:33:52Z"
  },
  {
    "title": "Trump Says US Needs ‘Total Access’ to Post-Maduro Venezuela",
    "description": "President Donald Trump said the US needs “total access” to Venezuela as questions mount about the country’s leadership following the capture of President Nicolás Maduro.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-us-needs-total-access-to-post-maduro-venezuela",
    "timestamp": "2026-01-05T02:28:42Z"
  },
  {
    "title": "Maduro's presumed successor, Venezuelan Vice President Delcy Rodriguez, is possibly in Russia: report",
    "description": "The presumed successor to Venezuelan President Nicolás Maduro is currently in Russia, a report said Saturday.Four sources familiar with the movements of Venezuelan Vice President Delcy Rodriguez confirmed her location to Reuters, although the news agency cite…",
    "link": "https://freerepublic.com/focus/f-news/4360433/posts",
    "timestamp": "2026-01-05T02:28:28Z"
  },
  {
    "title": "Who is Victoria Monét? Jaylen Brown’s viral Salsa dance partner revealed",
    "description": "NBA star Jaylen Brown's viral salsa dance with singer Victoria Monét has ignited dating rumors. The clip surfaced before Brown's 50-point game against the Clippers. Monét, a Grammy-winning songwriter, was later seen at the game, further fueling speculation. W…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/who-is-victoria-mont-jaylen-browns-viral-salsa-dance-partner-revealed/articleshow/126342967.cms",
    "timestamp": "2026-01-05T02:27:28Z"
  },
  {
    "title": "“Did I dunk it?”: Steph Curry’s almost-poster steals the spotlight Warriors’ dominant win over Jazz",
    "description": "Stephen Curry's explosive 31-point return fueled the Golden State Warriors to a 123-114 win over the Utah Jazz. A rare, high-flying finish in the third quarter sparked a debate about whether it counted as a dunk, with Curry humorously claiming it. The Warrior…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/did-i-dunk-it-steph-currys-almost-poster-steals-the-spotlight-warriors-dominant-win-over-jazz/articleshow/126342892.cms",
    "timestamp": "2026-01-05T02:24:36Z"
  },
  {
    "title": "Bombs away for Trump, self-proclaimed peace president",
    "description": "Washington, United States (AFP) Jan 3, 2026\n\n\n Donald Trump returned to office vowing to be the peace president. Nearly a year later, he is embracing war on multiple fronts. \n\nTrump on Saturday ordered large-scale military strikes in Venezuela and announced t…",
    "link": "https://www.spacewar.com/reports/Bombs_away_for_Trump_self-proclaimed_peace_president_999.html",
    "timestamp": "2026-01-05T02:24:18Z"
  },
  {
    "title": "As Trump imposes 'Donroe' Doctrine, murky message to US rivals",
    "description": "Washington, United States (AFP) Jan 3, 2026\n\n\n With a major attack to arrest Venezuela's leader, President Donald Trump is showing that the United States will impose its will in its neighborhood - and the lesson may not be lost on Russia and China. \n\nTrump de…",
    "link": "https://www.spacewar.com/reports/As_Trump_imposes_Donroe_Doctrine_murky_message_to_US_rivals_999.html",
    "timestamp": "2026-01-05T02:24:18Z"
  },
  {
    "title": "Jimmy Kimmel thanks Trump for Critics Choice Awards 2026 win",
    "description": "The comedian reflected on getting suspended by ABC in September over his remarks on the late Charlie Kirk.",
    "link": "https://pagesix.com/2026/01/04/celebrity-news/jimmy-kimmel-thanks-trump-for-critics-choice-awards-2026-win/",
    "timestamp": "2026-01-05T02:22:54Z"
  },
  {
    "title": "Trump touts action against Colombia, Iran, after Venezuela takeover",
    "description": "Can Trump unlock Venezuela’s vast oil reserves?\nInvesting.com-- U.S. President Donald Trump said on Sunday evening his administration was considering action against Colombia and Iran after Washington struck Venezuela and captured President Nicolas Maduro.\nSpe…",
    "link": "https://biztoc.com/x/a4ab623158990717",
    "timestamp": "2026-01-05T02:22:17Z"
  },
  {
    "title": "Stubb rallies behind Danish PM on Greenland",
    "description": "Finnish President Alexander Stubb voiced his \"full support\" for Denmark's Prime Minister Mette Frederiksen after she called on United States President Donald Trump to halt his threats to acquire Green...",
    "link": "https://biztoc.com/x/26afa58ae1d41191",
    "timestamp": "2026-01-05T02:22:04Z"
  },
  {
    "title": "Canada’s oil sector shouldn’t panic, stay competitive after Maduro’s seizure: experts",
    "description": "EDMONTON — Two political scientists say U.S. President Donald Trump’s interest in transforming Venezuela’s oil-rich sector hasn’t created panic or shaken up Canada’s oil industry. Heather Exner-Pirot, director of energy, natural resources and environment with…",
    "link": "https://financialpost.com/pmn/canadas-oil-sector-shouldnt-panic-stay-competitive-after-maduros-seizure-experts",
    "timestamp": "2026-01-05T02:21:28Z"
  },
  {
    "title": "Trump Warns Colombia in Threat to Other Drug-Producing Countries",
    "description": "President Donald Trump warned other drug-producing nations in the Western Hemisphere that he wouldn’t long tolerate the flow of illegal substances to the US.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-warns-colombia-in-threat-to-other-drug-producing-countries",
    "timestamp": "2026-01-05T02:18:40Z"
  },
  {
    "title": "Chelsea Handler Jokes About Kennedy Center Renaming at Critics Choice Awards",
    "description": "Chelsea Handler poked fun at the renaming of the John F. Kennedy Center for the Performing Arts during the 2026 Critics Choice Awards. “Since the current administration has no problem renaming cultural institutions, I would like to welcome everyone back to th…",
    "link": "https://www.usmagazine.com/celebrity-news/news/chelsea-handler-jokes-about-kennedy-center-renaming-at-critics-choice-awards/#article",
    "timestamp": "2026-01-05T02:18:30Z"
  },
  {
    "title": "Trump’s abduction of Maduro escalates concerns over potential war with Iran",
    "description": "Experts say US military action in Caracas 'gives momentum' for conflict with Tehran and deals another blow to diplomacy.",
    "link": "https://www.aljazeera.com/news/2026/1/5/trumps-abduction-of-maduro-escalates-concerns-over-potential-war-with-iran",
    "timestamp": "2026-01-05T02:15:20Z"
  },
  {
    "title": "Trump Contradicts Kremlin Claim That Ukraine Drone Strike Targeted Putin Residence",
    "description": "“I don’t believe that strike happened,\" Trump told reporters as he traveled back to Washington on Sunday.",
    "link": "https://www.huffpost.com/entry/trump-russia-ukraine-drone-strike_n_695b1bc6e4b0908b04a38b29",
    "timestamp": "2026-01-05T02:11:39Z"
  },
  {
    "title": "Gold rises over 1% as Maduro capture spurs safe-haven demand",
    "description": "Gold prices jumped over 1% on Monday. Other precious metals also saw significant gains. This surge followed the United States' capture of Venezuelan President Nicolas Maduro over the weekend. The incident has heightened geopolitical tensions. This has increas…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-rises-over-1-as-maduro-capture-spurs-safe-haven-demand/articleshow/126342791.cms",
    "timestamp": "2026-01-05T02:09:20Z"
  },
  {
    "title": "America’s century-long interest in Venezuelan oil",
    "description": "This must be about the oil, right? It’s a presumption that got lots of airtime this weekend, following the dramatic seizure of Venezuelan President Nicolás Maduro and his wife by US forces. The pair now face drug trafficking and narco-terrorism charges in New…",
    "link": "https://www.vox.com/today-explained-newsletter/474027/venezuela-oil-industry-trump",
    "timestamp": "2026-01-05T02:09:12Z"
  },
  {
    "title": "After Maduro, who's next? Trump's comments spur anxieties about his plans for Greenland and Cuba",
    "description": "Following a U.S. military operation in Venezuela, President Trump reiterated his desire to acquire Greenland for national security, citing Russian and Chinese presence.  Meanwhile, Secretary of State Rubio warned Cuba, stating its government is in severe trou…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/after-maduro-whos-next-trumps-comments-spur-anxieties-about-his-plans-for-greenland-and-cuba/articleshow/126342777.cms",
    "timestamp": "2026-01-05T02:07:31Z"
  },
  {
    "title": "Trump says Cuba 'ready to fall'",
    "description": "President Donald Trump said on Sunday that Cuba was “ready to fall” after US forces captured Venezuelan President Nicolas Maduro, noting that Havana would struggle without subsidized Venezuelan oil. Speaking aboard Air Force One, Trump downplayed the need for…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-cuba-ready-to-fall/articleshow/126342772.cms",
    "timestamp": "2026-01-05T02:06:48Z"
  },
  {
    "title": "Greenland next? ‘Soon’ post by Trump aide’s wife sparks storm",
    "description": "Katie Miller, wife of a top White House official, posted a map of Greenland with the U.S. flag, sparking speculation of a Trump administration annexation. While Denmark and Greenland officials expressed disapproval, some observers believe the U.S. is serious …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/greenland-next-soon-post-by-trump-aides-wife-sparks-storm/articleshow/126342768.cms",
    "timestamp": "2026-01-05T02:06:11Z"
  },
  {
    "title": "Oil trades sideways despite political turmoil in Venezuela",
    "description": "Oil prices saw a slight increase as investors assessed potential disruptions to Venezuelan shipments following U.S. President Trump's actions against President Maduro. Despite the political upheaval, initial reports indicate no damage to Venezuela's oil produ…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-trades-sideways-despite-political-turmoil-in-venezuela/articleshow/126342754.cms",
    "timestamp": "2026-01-05T02:05:08Z"
  },
  {
    "title": "Trump threatens Colombia’s Petro, says Cuba ‘looks like its ready to fall’",
    "description": "US president says a military operation focused on Colombia's government 'sounds good' to him.",
    "link": "https://www.aljazeera.com/news/2026/1/5/trump-threatens-colombias-petro-says-cuba-looks-like-its-ready-to-fall",
    "timestamp": "2026-01-05T02:04:01Z"
  }
]