[
  {
    "title": "The Geopolitical Chess Match Over Iran's Military Might",
    "description": "US President Donald Trump publicly emphasized diplomacy with Iran following his February 11 meeting with Israeli Prime Minister Benjamin Netanyahu. But experts say the deeper dispute may center not on Iran’s nuclear program, but on its expanding missile capab…",
    "link": "https://oilprice.com/Geopolitics/International/The-Geopolitical-Chess-Match-Over-Irans-Military-Might.html",
    "timestamp": "2026-02-13T17:00:00Z"
  },
  {
    "title": "Episode 490 – The 9th Annual Fake News Awards",
    "description": "Podcast: Play in new window | Download | Embed And now, from the PEOC deep under the demolished East Wing of the White House, it’s THE 9TH ANNUAL FAKE NEWS AWARDS!!! Featuring the fakest stories, the fakest journalists and the fakest factoids from the year th…",
    "link": "https://www.activistpost.com/episode-490-the-9th-annual-fake-news-awards/",
    "timestamp": "2026-02-13T17:00:00Z"
  },
  {
    "title": "Glowing Portrait of Trump’s ‘Ravenous’ Reading Habits Casts Him as Master of the Narrative",
    "description": "A new report suggests Trump doesn’t just fight the media — he uses it as a real-time power map shaping calls, hierarchy, and governance.\nThe post Glowing Portrait of Trump’s ‘Ravenous’ Reading Habits Casts Him as Master of the Narrative first appeared on Medi…",
    "link": "https://www.mediaite.com/opinion/glowing-portrait-of-trumps-ravenous-reading-habits-casts-him-as-master-of-the-narrative/",
    "timestamp": "2026-02-13T16:58:40Z"
  },
  {
    "title": "Epstein blast radius and the mainstreaming of extreme misogyny",
    "description": "Via Business Insider, here’s a list of some people who have recently suffered some sort of professional consequences for remaining BFFs with Jeffrey Epstein, long after his hobby of raping minors had become public information: Kathy Ruemmler Goldman Sachs’ to…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/epstein-blast-radius-and-the-mainstreaming-of-extreme-misogyny",
    "timestamp": "2026-02-13T16:57:29Z"
  },
  {
    "title": "Germany's chancellor urges new 'partnership' with Trump, US",
    "description": "During a speech at the Munich Security Conference, German Chancellor Friedrich Merz acknowledged a \"deep rift\" between Europe and the US under the Trump administration and called for a revival of \"trans-Atlantic trust.\" German Chancellor Friedrich Merz urged …",
    "link": "https://www.dw.com/en/germanys-chancellor-urges-new-partnership-with-trump-us/a-75959709",
    "timestamp": "2026-02-13T16:57:00Z"
  },
  {
    "title": "MSC: Germany's Merz urges new 'trans-Atlantic partnership'",
    "description": "During his speech at the Munich Security Conference, the German chancellor recognized there is a \"deep rift\" between Europe and the US under the Trump administration. He called for a revival of \"trans-Atlantic trust.\" German Chancellor Friedrich Merz urged a …",
    "link": "https://www.dw.com/en/msc-germanys-merz-urges-new-trans-atlantic-partnership/a-75959709",
    "timestamp": "2026-02-13T16:57:00Z"
  },
  {
    "title": "Democrats say Trump’s foreign deportation deals cost taxpayers millions",
    "description": "By Patricia ZengerleWASHINGTON, Feb 13 (Reuters) - U.S. President Donald Trump’s immigrant deportation agreements with foreign governments cost American taxpayers million… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/democrats-say-trump-s-foreign-deportation-deals-cost-taxpayers-millions",
    "timestamp": "2026-02-13T16:53:18Z"
  },
  {
    "title": "Anthropic taps ex-Microsoft CFO, Trump aide Liddell for board",
    "description": "Anthropic has appointed longtime executive and political operative Chris Liddell to its board of directors.",
    "link": "https://www.cnbc.com/2026/02/13/anthropic-ai-chris-liddell-microsoft-trump-board.html",
    "timestamp": "2026-02-13T16:52:50Z"
  },
  {
    "title": "Asian American Olympians respond to Trump calling Team USA athlete a 'loser'",
    "description": "Asian American athletes at the Milan Cortina Winter Olympics responded after President Donald Trump called Team USA freeski competitor Hunter Hess a “loser” in a social media post during the opening week of the Games in northern Italy. Trump’s criticism follo…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_8279a4ec-8ab2-4305-a9d4-e83d63801b23",
    "timestamp": "2026-02-13T16:52:07Z"
  },
  {
    "title": "Teachers describe immigration enforcement’s impact on classrooms in challenge of Trump policy",
    "description": "Educators around the country described rumors of immigration raids that scared away students.",
    "link": "https://www.bostonherald.com/2026/02/13/trump-education-immigration-enforcement-ice/",
    "timestamp": "2026-02-13T16:51:55Z"
  },
  {
    "title": "What Meetings Among Trump Lawyers Reveal About the FBI’s Seizure of Election Records in Georgia",
    "description": "The federal prosecutor from Missouri, who is overseeing an investigation into the 2020 vote in Georgia, had several meetings set up with top administration lawyers last fall to discuss election integrity.",
    "link": "http://www.propublica.org/article/thomas-albus-fulton-county-georgia-election-records",
    "timestamp": "2026-02-13T16:50:00Z"
  },
  {
    "title": "How Trump’s order to have the military buy coal would actually work",
    "description": "President Donald Trump says the military will start \"buying a lot of coal,\" but his executive order faces Pentagon procurement rules and congressional funding limits.",
    "link": "https://www.foxnews.com/politics/how-trumps-order-have-military-buy-coal-would-actually-work",
    "timestamp": "2026-02-13T16:43:51Z"
  },
  {
    "title": "Trump Boasts About 'Racist' Voter Fraud Video Depicting Barack and Michelle Obama as Apes — 'It's Doing Very Well'",
    "description": "Donald Trump boasted about the racist video he reposted feautring the Obamas as apes, noting 'it's doing very well.'",
    "link": "https://radaronline.com/p/donald-trump-boasts-obama-apes-racist-voter-fraud-video-doing-well/",
    "timestamp": "2026-02-13T16:43:15Z"
  },
  {
    "title": "Battle for the House runs through Virginia as court OKs high-stakes redistricting vote",
    "description": "Virginia Supreme Court greenlights April 21 referendum on redistricting, allowing Democrats to potentially create four more left-leaning House districts.",
    "link": "https://www.foxnews.com/politics/battle-house-runs-through-virginia-court-oks-high-stakes-redistricting-vote",
    "timestamp": "2026-02-13T16:42:34Z"
  },
  {
    "title": "Housing crisis remains the biggest issue in Irish politics",
    "description": "Inside Politics: Sinn Féin under fire for opposing €90bn loan to Ukraine; Taoiseach stages landmark moment in the Dáil",
    "link": "https://www.irishtimes.com/politics/2026/02/13/from-rent-reform-rows-to-short-term-lets-housing-remains-biggest-issue-in-irish-politics/",
    "timestamp": "2026-02-13T16:41:39Z"
  },
  {
    "title": "Kelsey Grammer refuses to back down from conservative values despite Hollywood pressure",
    "description": "Kelsey Grammer opens up about being a conservative Hollywood actor, revealing he's lost friends over his political views but gained others along the way.",
    "link": "https://www.foxnews.com/entertainment/kelsey-grammer-refuses-back-down-from-conservative-values-despite-hollywood-pressure",
    "timestamp": "2026-02-13T16:38:56Z"
  },
  {
    "title": "Trump’s Deputy AG Hit With Scathing Community Note Over Odd Claim About Epstein Files Redaction",
    "description": "Todd Blanche, who formerly worked as President Donald Trump’s personal lawyer, was hit with a scathing community note on X this week\nThe post Trump’s Deputy AG Hit With Scathing Community Note Over Odd Claim About Epstein Files Redaction first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/trumps-deputy-ag-hit-with-scathing-community-note-over-odd-claim-about-epstein-files-redaction/",
    "timestamp": "2026-02-13T16:38:29Z"
  },
  {
    "title": "NFL’s latest win over NFLPA might silence transparency around the league",
    "description": "The NFL secured a major win over the NFL Players Association on Friday. A couple of months after the league filed a grievance, it won it. ESPN's Adam Schefter reported on Friday that the league sent a memo to owners, announcing that they won the grievance, an…",
    "link": "https://www.thebiglead.com/nfls-latest-win-nflpa-silence-transparency-the-league/",
    "timestamp": "2026-02-13T16:37:48Z"
  },
  {
    "title": "Exclusive: Binance fires top investigators who claim to have uncovered evidence of Iranian sanctions violations",
    "description": "Internal findings by the fired investigators reviewed by Fortune pointed to over $1 billion in Tether flowing through Binance to Iran-linked wallets.",
    "link": "https://fortune.com/2026/02/13/binance-investigators-fired-iran-sanctions-potential-violations/",
    "timestamp": "2026-02-13T16:36:35Z"
  },
  {
    "title": "Colts owner Carlie Irsay-Gordon receives major international recognition for global impact",
    "description": "For years, Carlie Irsay-Gordon has played a visible role behind the scenes within the Indianapolis Colts organization, helping shape key decisions while continuing the legacy established by her father, Jim Irsay. But now, the Colts' new owner is earning recog…",
    "link": "https://www.thebiglead.com/colts-owner-carlie-irsay-gordon-receives-major-international-recognition/",
    "timestamp": "2026-02-13T16:34:06Z"
  },
  {
    "title": "Trump’s EPA kills legal basis for federal climate policy",
    "description": "The government’s authority to regulate several planet-warming pollutants has been repealed",
    "link": "https://theweek.com/politics/trump-epa-greenhouse-gases-climate-change",
    "timestamp": "2026-02-13T16:33:42Z"
  },
  {
    "title": "CNN’s Harry Enten Says Americans Believe Trump Is Handling Stock Market Better Than Past Presidents",
    "description": "CNN chief data reporter Harry Enten said that Americans have more confidence in the stock market under President Donald Trump in comparison to past presidents.",
    "link": "https://dailycaller.com/2026/02/13/cnn-harry-enten-trump-stock-market/",
    "timestamp": "2026-02-13T16:33:23Z"
  },
  {
    "title": "Kristi Noem’s Alleged Boyfriend Went on Crazed Journey to Get DHS Gun",
    "description": "Expired-special-employee Corey Lewandowski took it out on federal officials when he couldn’t get his way with a highly unusual quest.Lewandowski, who entered the ranks of the Department of Homeland Security thanks to close proximity to rumored beau Kristi Noe…",
    "link": "https://newrepublic.com/post/206567/kristi-noem-alleged-boyfriend-official-gun",
    "timestamp": "2026-02-13T16:31:07Z"
  },
  {
    "title": "Slog AM: SPD's May Day USA Fuck Up, EPA Won't Regulate Greenhouse Gases Anymore, Michigan Town Must Slaughter Park Deer",
    "description": "The Stranger's morning news roundup.\n \n by Nathalie Graham\n \n \n \n Protect and Serve? Last summer's May Day USA event, the right-wing Christian extremist event held in Cal Anderson, was a clusterfuck largely because of the Seattle Police Department's biases ag…",
    "link": "https://www.thestranger.com/slog-am/2026/02/13/80472646/slog-am-spds-may-day-usa-fuck-up-epa-wont-regulate-greenhouse-gases-anymore-michigan-town-must-slaughter-park-deer",
    "timestamp": "2026-02-13T16:27:00Z"
  },
  {
    "title": "Bigger IRS tax refund in 2026? Scott Bessent says average is up 22% – here's what experts want you to know",
    "description": "IRS tax refund 2026​: Americans might see larger tax refunds this year. Treasury Secretary Scott Bessent reports an average increase of 22 percent. This comes as the 2026 tax season opens. Official data is still awaited. Early figures can be misleading. Large…",
    "link": "https://economictimes.indiatimes.com/news/international/us/bigger-irs-tax-refund-in-2026-scott-bessent-says-average-is-up-22-heres-what-experts-want-you-to-know/articleshow/128315009.cms",
    "timestamp": "2026-02-13T16:25:15Z"
  },
  {
    "title": "Indonesia prepares up to 8,000 troops in first firm commitment to Gaza peacekeeping force",
    "description": "Officials now talk about sending 5,000 to 8,000 troops, focusing on engineering and medical units.",
    "link": "https://www.pbs.org/newshour/politics/indonesia-prepares-up-to-8000-troops-in-first-firm-commitment-to-gaza-peacekeeping-force",
    "timestamp": "2026-02-13T16:23:44Z"
  },
  {
    "title": "DOJ's Antitrust Chief Resigns Amid Accusations of Corruption Among Top Officials",
    "description": "Gail Slater resigned from her position as Assistant Attorney General of the Justice Department's Antitrust Division after butting heads with Attorney General Pam Bondi over merger enforcement.",
    "link": "https://reason.com/2026/02/13/dojs-antitrust-chief-resigns-amid-accusations-of-corruption-among-top-officials/",
    "timestamp": "2026-02-13T16:23:24Z"
  },
  {
    "title": "Bill O’Reilly Says Trump Should Target Tim Walz, Jacob Frey For Insurrection",
    "description": "Bill O’Reilly urged President Donald Trump to pursue insurrection charges Democratic Minnesota Gov. Tim Walz and Democratic Minneapolis Mayor Jacob Frey.",
    "link": "https://dailycaller.com/2026/02/13/bill-oreilly-says-trump-should-target-tim-walz-jacob-frey-for-insurrection/",
    "timestamp": "2026-02-13T16:23:17Z"
  },
  {
    "title": "Another major airline cancels all flights to the U.S.",
    "description": "Amid President Donald Trump's repeated targeting of the country with threats and insults, Canadian travel to the U.S. has remained at record low levels. This...",
    "link": "https://www.thestreet.com/travel/another-major-airline-cancels-all-flights-to-the-us",
    "timestamp": "2026-02-13T16:22:13Z"
  },
  {
    "title": "US consumers, businesses bore about 90% of Trump’s tariffs, NY Fed study finds",
    "description": "In the first eight months of 2025, some 94% of the cost of tariffs was borne by American businesses and consumers, the New York Fed study found.",
    "link": "https://nypost.com/2026/02/13/business/us-consumers-businesses-bore-about-90-of-trumps-tariffs-ny-fed-study-finds/",
    "timestamp": "2026-02-13T16:21:18Z"
  },
  {
    "title": "Trump’s EPA Chief Lee Zeldin Calls Climate Change a ‘Con Job’ Used To ‘Train Activists’ With Taxpayer Dollars",
    "description": "EPA administrator Lee Zeldin called climate change a \"con job\" meant to divert taxpayer funds to pay for the training of more environmental activists.\nThe post Trump’s EPA Chief Lee Zeldin Calls Climate Change a ‘Con Job’ Used To ‘Train Activists’ With Taxpay…",
    "link": "https://www.mediaite.com/media/news/trumps-epa-chief-lee-zeldin-calls-climate-change-a-con-job-used-to-train-activists-with-taxpayer-dollars/",
    "timestamp": "2026-02-13T16:20:41Z"
  },
  {
    "title": "Promises Made, Promises Kept: 71 Prices That Fell in January and Kept Inflation Low",
    "description": "“Starting on day one, we will end inflation and make America affordable again, to bring down the prices of all goods,\" President Trump said at an August 2024.\nAnd he did it.\nThe post Promises Made, Promises Kept: 71 Prices That Fell in January and Kept Inflat…",
    "link": "https://www.breitbart.com/economy/2026/02/13/every-price-that-fell-in-january/",
    "timestamp": "2026-02-13T16:19:17Z"
  },
  {
    "title": "Trump administration ends temporary protected status for Yemen",
    "description": "Feb ⁠13 (Reuters) - President ⁠Donald Trump's ‌administration has ended temporary protected ​status for ⁠Yemen, ⁠Secretary of Homeland ⁠Security Kristi ‌Noem ⁠said on Friday ​in ‌a statement. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/14/trump-administration-ends-temporary-protected-status-for-yemen",
    "timestamp": "2026-02-13T16:19:00Z"
  },
  {
    "title": "Russell Vought Raided USAID Budgets He Helped Gut to Pay for His Own Security",
    "description": "Security detail for President Donald Trump’s budget chief and Project 2025 architect Russell Vought is being paid for by what’s left in funding for the United States Agency for International Development, or USAID, according to documents reviewed by Reuters.  …",
    "link": "https://www.motherjones.com/politics/2026/02/the-project-2025-vought-usaid-security/",
    "timestamp": "2026-02-13T16:18:19Z"
  },
  {
    "title": "Migration Can Provide the Manpower for European Defense",
    "description": "Creating a pathway to citizenship in return for military service will help Europe stand on its own.",
    "link": "http://foreignpolicy.com/2026/02/13/europe-immigration-military-russia-ukraine-munich-population-security/",
    "timestamp": "2026-02-13T16:17:09Z"
  },
  {
    "title": "White House: Real Wages Grew by $1,400 Across Private Sector in Trump's First Year",
    "description": "Wages for private-sector workers outpaced inflation by roughly $1,400 during President Donald Trump's first year in office, according to the White House, after runaway inflation crushed Americans' buying power during the Biden administration.\nThe post White H…",
    "link": "https://www.breitbart.com/politics/2026/02/13/white-house-real-wages-grew-by-1400-in-private-sector-in-trumps-first-year/",
    "timestamp": "2026-02-13T16:17:02Z"
  },
  {
    "title": "GOP lawmakers privately admit Pam Bondi's testimony could have an unexpected consequence",
    "description": "Lawmakers — both Democrats and Republicans — have told an analyst that Attorney General Pam Bondi's contentious performance this week could ultimately backfire on President Donald Trump and the GOP. Salon's White House columnist Brian Karem revealed how Bondi…",
    "link": "https://www.rawstory.com/pam-bondi-2675266817/",
    "timestamp": "2026-02-13T16:16:16Z"
  },
  {
    "title": "February 13, 2016",
    "description": "Today is the ten year anniversary of Justice Scalia's passing. At the time, I could not have fathomed what the…",
    "link": "https://reason.com/volokh/2026/02/13/february-13-2016/",
    "timestamp": "2026-02-13T16:16:15Z"
  },
  {
    "title": "His family fled Afghanistan facing threats for supporting US troops. Now he sits in ICE custody at risk of being sent back (Haley Britzky/CNN)",
    "description": "Haley Britzky / CNN:\nHis family fled Afghanistan facing threats for supporting US troops.  Now he sits in ICE custody at risk of being sent back  —  The Middle East Asia Immigration Donald Trump  —  When Said Noor, a US Army veteran, picked up a phone call on…",
    "link": "https://www.memeorandum.com/260213/p48",
    "timestamp": "2026-02-13T16:15:01Z"
  },
  {
    "title": "Trump and Musk Amplify Long-Ago Debunked Mail-In Vote Fraud Claim",
    "description": "A social media post cited by Elon Musk to bolster his argument that mail-in voting should be curtailed, and which was subsequently amplified by President Donald Trump, makes the false and long-ago debunked claim that in the 2020 election, \"Pennsylvania sent o…",
    "link": "https://www.factcheck.org/2026/02/trump-and-musk-amplify-long-ago-debunked-mail-in-vote-fraud-claim/",
    "timestamp": "2026-02-13T16:14:47Z"
  },
  {
    "title": "Trump administration ends temporary protected status for Yemen",
    "description": "Feb 13 (Reuters) - President Donald Trump’s administration has ended temporary protected status for Yemen, Secretary of Homeland Security Kristi Noem said on Friday in a … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/trump-administration-ends-temporary-protected-status-for-yemen",
    "timestamp": "2026-02-13T16:14:13Z"
  },
  {
    "title": "Student-loan forgiveness emails are going out to a new batch of borrowers",
    "description": "Trump's Department of Education emailed a group of student-loan borrowers who reached their payment threshold under income-driven repayment plans.",
    "link": "https://www.businessinsider.com/student-loan-forgiveness-idr-debt-relief-taxes-2026-2",
    "timestamp": "2026-02-13T16:14:10Z"
  },
  {
    "title": "CNN Anchor Kaitlan Collins Praises Karoline Levitt for Sticking Up for Her During Saudi Arabia Trip — Despite Pair's Public Rivalry",
    "description": "CNN anchor Kaitlan Collins praised Karoline Leavitt for sticking up for her during a Saudi Arabia trip.",
    "link": "https://radaronline.com/p/cnn-kaitlan-collins-karoline-leavitt-praised-sticking-up-for-her/",
    "timestamp": "2026-02-13T16:13:57Z"
  },
  {
    "title": "ICE Melts in the Minneapolis Winter",
    "description": "John Nichols\n\n\n\nNow it’s time to abolish the agency and impeach Kristi Noem.\r\n\n\r\n\n\nThe post ICE Melts in the Minneapolis Winter appeared first on The Nation.",
    "link": "https://www.thenation.com/article/activism/ice-leaving-minnesota/",
    "timestamp": "2026-02-13T16:10:25Z"
  },
  {
    "title": "GOP Arizona governor candidate drops out but doesn't endorse",
    "description": "Karrin Taylor Robson dropped her Arizona GOP gubernatorial primary run, but did not issue an endorsement for another Republican candidate.",
    "link": "https://www.foxnews.com/politics/gop-arizona-governor-candidate-drops-out-doesnt-endorse",
    "timestamp": "2026-02-13T16:02:30Z"
  },
  {
    "title": "'Strategic project, symbol of constructive cooperation': Iranian envoy on Chabahar Port",
    "description": "Iran's Ambassador to India, Dr Mohammad Fathali, highlights Chabahar Port's strategic importance for regional connectivity and trade. He emphasizes Iran's desire for continued economic cooperation with India in energy, transit, trade, and technology. This com…",
    "link": "https://economictimes.indiatimes.com/news/india/strategic-project-symbol-of-constructive-cooperation-iranian-envoy-on-chabahar-port/articleshow/128314638.cms",
    "timestamp": "2026-02-13T16:00:28Z"
  },
  {
    "title": "성능과 비용을 모두 잡은 AI 저글링 중국",
    "description": "American parents will soon be eligible to open Trump Accounts for their children. Today on the Big Take: how these investment accounts work, who is eligible for free money and who stands to benefit most from the program https://t.co/OPOjFtGCDm pic.twitter.com…",
    "link": "https://ryueyes11.tistory.com/512073",
    "timestamp": "2026-02-13T16:00:25Z"
  },
  {
    "title": "Trump's White House ballroom project was allegedly scrapped. We broke down real status",
    "description": "The construction of U.S. President Donald Trump’s White House ballroom was halted by a federal judge in mid-February 2026.",
    "link": "https://www.snopes.com//fact-check/trumps-white-house-ballroom-scrapped/",
    "timestamp": "2026-02-13T16:00:00Z"
  },
  {
    "title": "Op-ed: The world economy is on the move. Too many roads lead away from Trump and to China",
    "description": "The world is moving back closer to China, and unlike during its ascension to the World Trade Organization, this time it is a move away from the United States.",
    "link": "https://www.cnbc.com/2026/02/13/us-china-trump-xi-jinping-global-economy-international-order-rupture.html",
    "timestamp": "2026-02-13T15:59:27Z"
  },
  {
    "title": "Here’s the inflation breakdown for January 2026 — in one chart",
    "description": "The consumer price index eased in January but inflation was still elevated for many consumer necessities, economists said.",
    "link": "https://www.cnbc.com/2026/02/13/heres-the-inflation-breakdown-for-january-2026-in-one-chart.html",
    "timestamp": "2026-02-13T15:59:01Z"
  },
  {
    "title": "Supreme Court Schedules Opinions on Feb. 20 as Tariff Case Looms",
    "description": "The US Supreme Court scheduled Feb. 20 as its next opinion day amid a global wait for a ruling that could invalidate most of President Donald Trump’s signature tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/supreme-court-schedules-opinions-on-feb-20-as-tariff-case-looms",
    "timestamp": "2026-02-13T15:59:00Z"
  },
  {
    "title": "Trump Sends Second Massive Aircraft Carrier to Middle East, Ramping Up Iran Threats",
    "description": "President Donald Trump further escalated his threats to attack Iran on Thursday by deploying another massive aircraft carrier to the Middle East.According to Axios, Trump decided to send the USS Gerald Ford to the region shortly after his Wednesday talk with …",
    "link": "https://www.commondreams.org/news/second-aircraft-carrier-iran",
    "timestamp": "2026-02-13T15:56:43Z"
  },
  {
    "title": "Democratic report: US spent $40M on deportations to third nations",
    "description": "The report found lump sum payments ranging between $4.7 million and $7.5 million to five countries to deport migrants to those nations",
    "link": "https://www.wmur.com/article/third-country-deportations-40m-report/70346272",
    "timestamp": "2026-02-13T15:56:01Z"
  },
  {
    "title": "Democratic report: US spent $40M on deportations to third nations",
    "description": "The report found lump sum payments ranging between $4.7 million and $7.5 million to five countries to deport migrants to those nations",
    "link": "https://www.wtae.com/article/third-country-deportations-40m-report/70346272",
    "timestamp": "2026-02-13T15:55:52Z"
  },
  {
    "title": "Democratic report: US spent $40M on deportations to third nations",
    "description": "The report found lump sum payments ranging between $4.7 million and $7.5 million to five countries to deport migrants to those nations",
    "link": "https://www.kcra.com/article/third-country-deportations-40m-report/70346272",
    "timestamp": "2026-02-13T15:55:51Z"
  },
  {
    "title": "February 12, 2026 — In a ceremony at the White House yesterday, surrounded by coal industry leaders ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nFebruary 12, 2026  —  In a ceremony at the White House yesterday, surrounded by coal industry leaders, lawmakers, and miners, President Donald J. Trump was presented with a trophy that calls him “the undisput…",
    "link": "https://www.memeorandum.com/260213/p43",
    "timestamp": "2026-02-13T15:55:00Z"
  },
  {
    "title": "President Trump pardons Hall of Famer Joe Klecko and four other former NFL players (The Athletic)",
    "description": "The Athletic:\nPresident Trump pardons Hall of Famer Joe Klecko and four other former NFL players  —  Share full article  —  President Donald Trump pardoned former NFL players Joe Klecko, Nate Newton, Jamal Lewis, Travis Henry and the late Billy Cannon on Thur…",
    "link": "https://www.memeorandum.com/260213/p42",
    "timestamp": "2026-02-13T15:55:00Z"
  },
  {
    "title": "U.S. Air Force Moving to Replenish GBU-57 Massive Ordnance Penetrator Inventory",
    "description": "U.S. Air Force acquisition documents show that Boeing is being contracted to replenish the inventory of GBU-57’s expended during Operation Midnight Hammer. The U.S. Air Force is requesting the approval to award Boeing a sole-source contract for the production…",
    "link": "https://theaviationist.com/2026/02/13/usaf-to-replenish-gbu-57-mop-inventory/",
    "timestamp": "2026-02-13T15:53:19Z"
  },
  {
    "title": "Pardon for Netanyahu ‘under review’ after Trump criticism, says Israeli president",
    "description": "Yitzhak Herzog should be ‘ashamed’, railed Trump,  for not granting clemency to Israeli PM in criminal trial",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/13/pardon-for-netanyahu-under-review-after-trump-criticism-says-israeli-president/",
    "timestamp": "2026-02-13T15:52:35Z"
  },
  {
    "title": "I’ve Witnessed Trump Weaponize Georgia Ballots for Years. Then He Stole Mine.",
    "description": "The FBI raid of Fulton County’s election hub is just one facet of a worrying pattern of election interference.",
    "link": "https://truthout.org/articles/ive-witnessed-trump-weaponize-georgia-ballots-for-years-then-he-stole-mine/",
    "timestamp": "2026-02-13T15:52:23Z"
  },
  {
    "title": "RFK Jr. exposes California hotel as fake nursing office, fraud claims ramp up: ‘Just collecting money’",
    "description": "Health and Human Services secretary Robert F. Kennedy Jr. believes fake nursing offices are raking in money as a California hotel hides their facade.",
    "link": "https://nypost.com/2026/02/13/us-news/rfk-jr-reveals-california-hotel-housed-fake-medical-offices-as-white-house-fraud-claims-mount-theyre-just-collecting-money/",
    "timestamp": "2026-02-13T15:51:49Z"
  },
  {
    "title": "Minnesota Made Trump Blink",
    "description": "Elie Mystal\n\n\n\nBut Tom Homan is a lying liar, and the work’s not done. Plus, Gallup’s sketchy new polling policy (is the analytics firm in the Trump tank?), the law for deepfakes, and more in this week’s Elie v. US.\r\n\n\r\n\n\nThe post Minnesota Made Trump Blink a…",
    "link": "https://www.thenation.com/article/politics/newsletter-minnesota-homan-ice-out/",
    "timestamp": "2026-02-13T15:50:42Z"
  },
  {
    "title": "White House Celebrates Inflation Beating Expectations in January",
    "description": "Inflation beat expectations by dropping to 2.4% in January, according to new data from the Bureau of Labor Statistics. “President Trump has defeated Joe Biden’s... Read More\nThe post White House Celebrates Inflation Beating Expectations in January appeared fi…",
    "link": "https://www.dailysignal.com/2026/02/13/white-house-celebrates-inflation-beating-expectations-in-january/",
    "timestamp": "2026-02-13T15:50:25Z"
  },
  {
    "title": "'Most Vile Scumbags on Earth': Critics Appalled by Explosive Report on Kristi Noem's Corruption",
    "description": "An explosive report published by the Wall Street Journal on Thursday shed fresh light on what critics have described as \"outrageous corruption\" by US Homeland Security Secretary Kristi Noem.Among other things, the Journal report highlighted Noem's relationshi…",
    "link": "https://www.commondreams.org/news/kristi-noem-corruption-wsj",
    "timestamp": "2026-02-13T15:49:11Z"
  },
  {
    "title": "Supply Fears Return as OPEC+ Eyes Output Expansion",
    "description": "Oil prices are once again under pressure after several OPEC+ members signaled a willingness to start hiking production again, even as inflation data provided some support. Friday, February 13, 2026OPEC+ never fails to disappoint oil bulls, this time sending r…",
    "link": "https://oilprice.com/Energy/Energy-General/Supply-Fears-Return-as-OPEC-Eyes-Output-Expansion.html",
    "timestamp": "2026-02-13T15:47:58Z"
  },
  {
    "title": "Lara Logan Examines the Media Blackout of the Islamic Regime Terrorizing and Murdering Iranians",
    "description": "Lara Logan examines the media blackout on Iran.  MEDIA BLACKOUT ON IRAN: Why Thousands of Deaths Are Going Unreported On this midweek episode of ROGUE ROUNDUP, Lara Logan and Producer/Co-Host … Read more\nThe post Lara Logan Examines the Media Blackout of the …",
    "link": "https://joehoft.com/lara-logan-examines-media-blackout-islamic-regime-terrorizing/",
    "timestamp": "2026-02-13T15:45:54Z"
  },
  {
    "title": "What’s in the Epstein files? For Tiktokers, a content gold mine",
    "description": "\"where are you? Are you ok , I loved the torture video,\" reads one email, allegedly sent by Jeffrey Epstein in 2009. The reply, from a redacted address, states: \"I am in china I will be in the US 2nd week of may.\" Her face hovering over a screenshot of the ex…",
    "link": "https://www.theverge.com/tech/878380/epstein-files-tiktok-content",
    "timestamp": "2026-02-13T15:42:34Z"
  },
  {
    "title": "WATCH LIVE: Trump honors special forces who helped capture Venezuela's Maduro",
    "description": "President Donald Trump's visit to Fort Bragg is meant to toast service members involved in his administration's dramatic ouster of Nicolás Maduro, an operation he has described as requiring bravery and advanced weapons.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-honors-special-forces-who-helped-capture-venezuelas-maduro",
    "timestamp": "2026-02-13T15:41:58Z"
  },
  {
    "title": "Donald Trump plans to roll back tariffs on metal and aluminium goods (Financial Times)",
    "description": "Financial Times:\nDonald Trump plans to roll back tariffs on metal and aluminium goods  —  Latest softening of levies comes amid persistent voter anxiety about affordability in the US  —  Donald Trump is planning to scale back some tariffs on steel and alumini…",
    "link": "https://www.memeorandum.com/260213/p40",
    "timestamp": "2026-02-13T15:40:00Z"
  },
  {
    "title": "UN Needs to Be Put on 'Diet,' Reformed Like NATO - US Envoy to UN",
    "description": "MUNICH (Sputnik) - The United Nations needs to be put on \"a diet\" and reformed like NATO, US Ambassador to the United Nations Mike Waltz said on Friday.",
    "link": "https://sputnikglobe.com/20260213/un-needs-to-be-put-on-diet-reformed-like-nato---us-envoy-to-un-1123629965.html",
    "timestamp": "2026-02-13T15:36:18Z"
  },
  {
    "title": "ICE reveals rate of criminals among deportees from US",
    "description": "Some 1.6 million illegal aliens in the US have final deportation orders, acting ICE chief Todd Lyons has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632427-us-ice-deportation-minnesota/",
    "timestamp": "2026-02-13T15:35:18Z"
  },
  {
    "title": "Alexi Lalas dispels doubts about Christian Pulisic and predicts his role in the World Cup with USMNT",
    "description": "Despite a rocky start to 2026 with AC Milan, Christian Pulisic continues to be considered the great figure of the USMNT ahead of the 2026 World Cup.\nThe American striker started th",
    "link": "https://www.marca.com/en/world-cup/2026/02/13/698f435f46163f45338b45f7.html",
    "timestamp": "2026-02-13T15:34:35Z"
  },
  {
    "title": "What Minnesota Really Thinks Of The End Of Trump’s ICE Surge",
    "description": "The mood in Minneapolis may not be what you would expect.",
    "link": "https://www.huffpost.com/entry/what-minnesota-really-thinks-of-the-end-of-the-trumps-ice-surge_n_698f2bb1e4b0e13a41762103",
    "timestamp": "2026-02-13T15:33:56Z"
  },
  {
    "title": "The Blind Spot at the Top of the World",
    "description": "Slashing Arctic climate science will limit how clearly the U.S. can understand the region.",
    "link": "https://www.theatlantic.com/science/2026/02/climate-science-arctic/685990/",
    "timestamp": "2026-02-13T15:32:39Z"
  },
  {
    "title": "Buddhist monks vs. Trump’s fake “Board of Peace”",
    "description": "Over the last year, we've seen America's \"forever war\" come home. But wandering monks remind us peace is possible",
    "link": "https://www.salon.com/2026/02/13/buddhist-monks-vs-trumps-fake-board-of-peace/",
    "timestamp": "2026-02-13T15:30:57Z"
  },
  {
    "title": "Trump Cranks Up Pressure On Iran With Second Aircraft Carrier Deployment",
    "description": "In the latest escalation of America’s pressure campaign against Iran, the Pentagon has deployed the USS Gerald R. Ford, from the Caribbean to the Middle East.",
    "link": "https://dailycaller.com/2026/02/13/trump-cranks-up-pressure-on-iran-with-second-aircraft-carrier-deployment/",
    "timestamp": "2026-02-13T15:30:01Z"
  },
  {
    "title": "Patriots’ Stefon Diggs’ December case takes new legal twist as next court date approaches",
    "description": "The offseason has barely begun, but Stefon Diggs is already dealing with something far more serious than roster moves or contract talk. The New England Patriots' wide receiver made a courtroom appearance this week in connection with an alleged December incide…",
    "link": "https://www.thebiglead.com/patriots-stefon-diggs-december-case-new-legal-twist-next-court-date-approaches/",
    "timestamp": "2026-02-13T15:29:07Z"
  },
  {
    "title": "President Donald Trump pardons late LSU football legend Billy Cannon",
    "description": "Cannon led LSU to a national championship and won the Heisman trophy, but served two and a half years in prison for a counterfeiting conviction.",
    "link": "https://www.theadvocate.com/baton_rouge/sports/lsu/donald-trump-billy-cannon-pardon-lsu-football/article_138ac40f-b39d-5ed4-b687-a36ed5a4a806.html",
    "timestamp": "2026-02-13T15:27:00Z"
  },
  {
    "title": "CNN Host Claims Biden Admin Never Lost Track Of 300,000 Kids",
    "description": "“CNN NewsNight” host Abby Phillip accused border czar Tom Homan of lying about whether the Biden administration lost track of tens of thousands of children.",
    "link": "https://dailycaller.com/2026/02/13/abby-phillip-tom-homan-biden-admin-lost-children/",
    "timestamp": "2026-02-13T15:26:45Z"
  },
  {
    "title": "Nolte: Media Actively Cover Up Obama Lawyer’s Chummy Ties to Epstein",
    "description": "In today’s episode of Democrats Sure Got It Good, meet Kathryn Ruemmler, whose looming and seedy presence in the Epstein Files might help explain why the Biden Administration refused to release them.\nThe post Nolte: Media Actively Cover Up Obama Lawyer’s Chum…",
    "link": "https://www.breitbart.com/the-media/2026/02/13/nolte-media-actively-cover-up-obama-lawyers-chummy-ties-to-epstein/",
    "timestamp": "2026-02-13T15:25:30Z"
  },
  {
    "title": "Donald Trump issues pardon to LSU football Heisman Trophy winner",
    "description": "A former LSU football legend was pardoned by US president Donald Trump earlier this week. Here are the details.",
    "link": "https://lsutigerswire.usatoday.com/story/sports/college/lsu/football/2026/02/13/lsu-football-donald-trump-billy-cannon-presidential-pardon/88659289007/",
    "timestamp": "2026-02-13T15:25:27Z"
  },
  {
    "title": "Trump Ends Greenhouse Gas Regulations For Cars",
    "description": "We're looking at the Trump administration joining the war on climate change on the side of climate change, as well as the harm it's done to EV sales in the U.S.",
    "link": "https://www.jalopnik.com/2100347/trump-ends-greenhouse-gas-regs-cars/",
    "timestamp": "2026-02-13T15:23:45Z"
  },
  {
    "title": "How the Superbowl turned into an all-American identity crisis",
    "description": "This year’s half-time show was so chock-full of liberal agenda, conservatives decided to create their own alternative Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632424-us-superbowl-identity-crisis/",
    "timestamp": "2026-02-13T15:23:39Z"
  },
  {
    "title": "TVA Now Ready to Reverse Plans on Closing Two Coal-Fired Power Plants",
    "description": "The nation’s largest public utility says it now would prefer to keep operating two coal-fired power plants it had planned to shutter, changing course before a meeting of its board, which has a majority of members picked by the coal-friendly …",
    "link": "https://www.insurancejournal.com/news/southeast/2026/02/13/858062.htm",
    "timestamp": "2026-02-13T15:21:04Z"
  },
  {
    "title": "President Trump pardons 5 former NFL players for various crimes, including Jamal Lewis, Nate Newton, Joe Klecko",
    "description": "The NFL players were pardoned for crimes including drug trafficking and perjury.",
    "link": "https://sports.yahoo.com/nfl/article/president-trump-pardons-5-former-nfl-players-for-various-crimes-including-jamal-lewis-nate-newton-joe-klecko-151950635.html",
    "timestamp": "2026-02-13T15:19:50Z"
  },
  {
    "title": "Joe Rogan hits back after being mentioned in Epstein files",
    "description": "UFC commentator Joe Rogan has claimed that he is named in the files related to Jeffrey Epstein as the disgraced financier wanted to 'meet' with him.",
    "link": "https://www.ladbible.com/news/us-news/joe-rogan-podcast-epstein-files-named-meeting-416997-20260213",
    "timestamp": "2026-02-13T15:17:01Z"
  },
  {
    "title": "“You Up???” Inside Steve Bannon and Jeffrey Epstein’s Disturbingly Close Friendship",
    "description": "The new Epstein files are a peek into the Trump consigliere’s chummy relationship with the sex offender, from late-night notes to private jet rides. Will MAGA even care?",
    "link": "https://www.vanityfair.com/news/story/steve-bannon-jeffrey-epstein-files-trump-maga",
    "timestamp": "2026-02-13T15:15:35Z"
  },
  {
    "title": "Selected Articles: Epstein Files Expose His Work as a Foreign Agent for Israel",
    "description": "Epstein Files Expose His Work as a Foreign Agent for Israel\nBy Steven Sahiounie, February 13, 2026\nAccording to the documents, Epstein was involved in an organized network that financially supported Israeli military institutions, Zionist organizations, athlet…",
    "link": "https://www.globalresearch.ca/selected-articles-epstein-work-foreign-agent-israel/5915719",
    "timestamp": "2026-02-13T15:14:04Z"
  },
  {
    "title": "Venezuela oil sales top $1 billion, funds won’t go to Qatar account anymore, Energy Secretary says",
    "description": "Democrats in Congress have questioned the transparency and legality of depositing Venezuela oil revenue in Qatar.",
    "link": "https://www.cnbc.com/2026/02/13/venezuela-oil-sales-qatar-chris-wright-trump.html",
    "timestamp": "2026-02-13T15:13:56Z"
  },
  {
    "title": "Russ Vought Helped Kill USAID—and Is Now Using the Money for Himself",
    "description": "Disgraced sexual predator Jeffrey Epstein said he had “new administration people” visiting his Little Saint James Island in 2016—just a month before President Trump’s first inauguration. In a December 2016 email to Bill Gates, Epstein told him to “come to vis…",
    "link": "https://newrepublic.com/post/206559/russ-vought-usaid-funds-security",
    "timestamp": "2026-02-13T15:13:00Z"
  },
  {
    "title": "Giants' John Harbaugh shares what Americans 'should keep in mind' as country's 250th birthday nears",
    "description": "New York Giants head coach John Harbaugh shared what American should \"keep in mind\" as the 250th anniversary of the country's founding nears.",
    "link": "https://www.foxnews.com/sports/giants-john-harbaugh-shares-what-americans-should-keep-mind-countrys-250th-birthday-nears",
    "timestamp": "2026-02-13T15:12:34Z"
  },
  {
    "title": "Teachers describe immigration enforcement's impact on classrooms",
    "description": "In a new court filing, teachers around the country describe how President Donald Trump’s immigration crackdown is emptying classrooms and frightening families",
    "link": "https://www.wsbradio.com/news/politics/teachers-describe/ECRHOY25ZU2ZTPTQKXZNB3XYXY/",
    "timestamp": "2026-02-13T15:12:32Z"
  },
  {
    "title": "Epstein Files Expose His Work as a Foreign Agent for Israel",
    "description": "Newly released files related to the late American billionaire Jeffrey Epstein reveal activities that go far beyond his well-documented sexual crimes and relationships with global political and financial elites. According to the documents, Epstein was involved…",
    "link": "https://www.globalresearch.ca/epstein-files-expose-foreign-agent-israel/5915692",
    "timestamp": "2026-02-13T15:11:06Z"
  },
  {
    "title": "Mexican humanitarian cargo docks in Havana amid energy crunch",
    "description": "Cubans are grappling with widening blackouts and tighter fuel rationing as the energy crisis deepens Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632430-cuba-energuy-crisis/",
    "timestamp": "2026-02-13T15:09:31Z"
  },
  {
    "title": "Kristi Noem enrages Trump with secret 'cabinet meetings' behind president's back",
    "description": "Kirsti Noem's secret cabinet meetings have enraged Donald Trump, who is reportedly infuriated by the Department of Homeland Security. The president had not been aware of the meetings, though it is now believed he and his advisors are aware Noem is hosting cla…",
    "link": "https://www.rawstory.com/kristi-noem-trump-2675266687/",
    "timestamp": "2026-02-13T15:08:42Z"
  }
]