[
  {
    "title": "'Oversized kennel': Alligator Alcatraz worker blows the whistle on 'inhumane' conditions",
    "description": "An Alligator Alcatraz worker is blowing the whistle on \"inhumane\" conditions at the notorious immigrant detention facility in South Florida after working there for less than a month. Speaking to NBC6, Lindsey, a corrections officer, said that she only wanted …",
    "link": "https://www.rawstory.com/ice-detention-center-whistleblower/",
    "timestamp": "2025-08-06T16:51:32Z"
  },
  {
    "title": "Apple and Trump to Announce Another $100 Billion Investment: Report",
    "description": "Apple is reportedly gearing up to spend an additional $100 billion to build more of its products in the United States—a move seen as both political and practical as pressure from the White House ramps up. According to Bloomberg, President Donald Trump is expe…",
    "link": "https://www.iphoneincanada.ca/2025/08/06/apple-and-trump-to-announce-another-100-billion-investment-report/",
    "timestamp": "2025-08-06T16:51:06Z"
  },
  {
    "title": "With only one nuclear arms pact left between the U.S. and Russia, a new arms race is possible",
    "description": "While the end of nuclear weapons agreements between the U.S. and Russia does not necessarily make nuclear war more likely, experts say it doesn't make the world safer.",
    "link": "https://www.pbs.org/newshour/politics/with-only-one-nuclear-arms-pact-left-between-the-u-s-and-russia-a-new-arms-race-is-possible",
    "timestamp": "2025-08-06T16:50:52Z"
  },
  {
    "title": "Amazon uses Lada to promote new auto service",
    "description": "A campaign image from Amazon features a Russian-made Lada never sold in the US Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622573-amazon-campaign-russian-lada/",
    "timestamp": "2025-08-06T16:50:42Z"
  },
  {
    "title": "India Responds To Trump Levying Additional 25% Tariff — 'Will Take All Actions Necessary'",
    "description": "Trump's imposition of additional tariffs is \"unfair, unjustified and unreasonable\", the Ministry of External Affairs said. Shortly after US President Donald Trump announced an additional 25% tariffs on India on Wednesday, the Indian Ministry of External Affai…",
    "link": "https://freerepublic.com/focus/f-chat/4333040/posts",
    "timestamp": "2025-08-06T16:50:17Z"
  },
  {
    "title": "OpenAI Announces Massive US Government Partnership",
    "description": "The ChatGPT maker is providing its frontier AI models to federal agencies for $1 for the next year.",
    "link": "https://www.wired.com/story/openai-is-giving-chatgpt-federal-workers/",
    "timestamp": "2025-08-06T16:48:11Z"
  },
  {
    "title": "Brazil's government requests consultations at WTO over Trump's tariffs, official says",
    "description": "A government official in Brazil says the country has requested consultations at the World Trade Organization over tariffs imposed by U.S. President Donald Trump",
    "link": "https://abcnews.go.com/International/wireStory/brazils-government-requests-consultations-wto-trumps-tariffs-official-124417267",
    "timestamp": "2025-08-06T16:46:15Z"
  },
  {
    "title": "Crockett: 'Wannabe Hitler' Trump Has a 'Problem with People of Color'",
    "description": "Tuesday on CNN’s \"The Source,\" Rep. Jasmine Crockett (D-TX) said President Donald Trump was a \"wannabe Hitler\" who has \"a problem with people of color.\"\nThe post Crockett: ‘Wannabe Hitler’ Trump Has a ‘Problem with People of Color’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/08/06/crockett-wannabe-hitler-trump-has-a-problem-with-people-of-color/",
    "timestamp": "2025-08-06T16:44:58Z"
  },
  {
    "title": "Harsh Goenka slams Trump's tariff hike on India, says 'You can tariff our exports, but not our sovereignty'",
    "description": "Industrialist Harsh Goenka condemned the U.S.'s additional 25% tariff on Indian goods over Russian oil imports, calling it an attack on sovereignty. The tariff hike raises the total duty to 50%, impacting key sectors like textiles and marine exports. India ca…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/harsh-goenka-slams-trumps-tariff-hike-on-india-says-you-can-tariff-our-exports-but-not-our-sovereignty/articleshow/123146531.cms",
    "timestamp": "2025-08-06T16:44:08Z"
  },
  {
    "title": "Apple’s $100 billion investment in American manufacturing powers Big Tech rally",
    "description": "The Nasdaq 100 rose, fueled by a robust rally in Big Tech stocks, as Apple's massive $100 billion investment in American manufacturing…\nThe post Apple’s $100 billion investment in American manufacturing powers Big Tech rally appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/08/06/apples-100-billion-investment-in-american-manufacturing-powers-big-tech-rally/",
    "timestamp": "2025-08-06T16:43:56Z"
  },
  {
    "title": "Nicolle Wallace warns that angry GOP town halls could be a harbinger for midterms",
    "description": "Nicolle Wallace urges Republicans to take the anger of constituents seriously, as voters voice their dissatisfaction with Trump's agenda at town hall events.",
    "link": "https://www.msnbc.com/top-stories/latest/republicans-angry-town-hall-midterms-rcna223375",
    "timestamp": "2025-08-06T16:43:04Z"
  },
  {
    "title": "U.S. Weighs Options for Penalizing Russia Beyond India Tariffs",
    "description": "President Donald Trump’s additional 25% tariff on India for its purchases of Russian oil could be just the first shot he aims at Moscow’s energy revenues ahead of a Friday deadline, as the US weighs options to get President Vladimir Putin to end the war again…",
    "link": "https://gcaptain.com/u-s-weighs-options-for-penalizing-russia-beyond-india-tariffs/",
    "timestamp": "2025-08-06T16:42:25Z"
  },
  {
    "title": "Pennsylvania man charged for allegedly threatening to kill Trump before he took office",
    "description": "Jacob Buckley of Pennsylvania faces charges for allegedly threatening to kill President Donald Trump before he took office in January, the DOJ said.",
    "link": "https://www.foxnews.com/politics/pennsylvania-man-charged-allegedly-threatening-kill-trump-before-he-took-office",
    "timestamp": "2025-08-06T16:41:44Z"
  },
  {
    "title": "The Christian Zionist View of Foreign Policy Is Holy War",
    "description": "Christian Zionists see Israel as the focus of US foreign policy -- a handy euphemism for US empire.",
    "link": "https://truthout.org/articles/the-christian-zionist-view-of-foreign-policy-is-holy-war/",
    "timestamp": "2025-08-06T16:41:41Z"
  },
  {
    "title": "Is owner of Trump Burger being deported? Biting into claim",
    "description": "Conflicting reports cast doubt on whether Roland Beainy, the owner/operator of Trump Burger Kemah, was actually a U.S. citizen.",
    "link": "https://www.snopes.com//news/2025/08/06/trump-burger-owner-deported/",
    "timestamp": "2025-08-06T16:41:00Z"
  },
  {
    "title": "Trump Tariffs Make India Most Heavily Taxed US Trading Partner: GTRI",
    "description": "The Global Trade Research Initiative said on Wednesday that the 50% tariffs that President Donald Trump levied on India would make it the most heavily taxed country by the US, even higher than China. Despite the fact that the US had initially planned to levy …",
    "link": "https://www.ndtvprofit.com/economy-finance/donald-trump-us-additional-tariff-on-india-trade-gtri",
    "timestamp": "2025-08-06T16:40:47Z"
  },
  {
    "title": "Source reports that Maxwell said she saw no wrongdoing by Trump",
    "description": "BREAKING: A source reports that Ghislaine Maxwell said she saw no wrongdoing by Donald Trump in a conversation with Deputy ...",
    "link": "https://biztoc.com/x/adfeb7fcdf1ad661",
    "timestamp": "2025-08-06T16:40:20Z"
  },
  {
    "title": "Apple Will Commit $100 Billion More to US Manufacturing, White House Source Says",
    "description": "Amid tariffs, Apple is expected to announce shifting more of its supply chain to domestic assembly, at a White House event.",
    "link": "https://www.cnet.com/tech/computing/apple-will-commit-100-billion-more-to-us-manufacturing-says-white-house/",
    "timestamp": "2025-08-06T16:40:00Z"
  },
  {
    "title": "Republican senator Marsha Brown just announced her bid for governor — who is she?",
    "description": "Senator Marsha Blackburn has announced her candidacy for Tennessee governor, emphasizing her alignment with Donald Trump's agenda. Blackburn aims to continue Trump's policies at the state level, citing his initial impact as president. She will face Congressma…",
    "link": "https://economictimes.indiatimes.com/news/international/us/republican-senator-marsha-brown-just-announced-her-bid-for-governor-who-is-she/articleshow/123146416.cms",
    "timestamp": "2025-08-06T16:39:19Z"
  },
  {
    "title": "Ways Marketers Can Succeed In The New AI-First World",
    "description": "Also in the Forbes CMO newsletter: Marketers’ output soars, but not their budgets; American Eagle campaign ignites eugenics controversy; Fox to debut streaming service.",
    "link": "https://www.forbes.com/sites/cmo/2025/08/06/ways-marketers-can-succeed-in-the-new-ai-first-world/",
    "timestamp": "2025-08-06T16:38:38Z"
  },
  {
    "title": "Trump hikes India tariffs to 50%",
    "description": "US President Donald Trump announced an additional 25% tariff on India over its purchase of Russian oil, ratcheting up tensions with the world’s most populous nation.\nThe new duties, set to take effect Aug. 27, will bring the total tariff rate on Indian goods …",
    "link": "https://biztoc.com/x/efdb16bee5308de2",
    "timestamp": "2025-08-06T16:37:42Z"
  },
  {
    "title": "Apple surges on a new $100 billion U.S. investment. What Cramer thinks about stock",
    "description": "Apple is ready to pony up another $100 billion to appease President Donald Trump . Jim Cramer says it was a necessary evil. Wall Street agreed, and the struggling stock rallied. The news Shares of Apple jumped nearly 6% on Wednesday after a White House offici…",
    "link": "https://biztoc.com/x/8c87a6366e6e8b73",
    "timestamp": "2025-08-06T16:37:27Z"
  },
  {
    "title": "GIFT Nifty Drops Over 90 Points After Donald Trump Levies Additional 25% Tariffs On India",
    "description": "Trump Tariff Impact: At 9:35 pm, Gift Nifty traded around 24,535.50, down nearly 95 points, a discount of 79 points from the Nifty futures’ previous close at 24,628, indicating a muted start for the Indian stock market on Aug. 7, 2025. The Indian stock market…",
    "link": "https://www.ndtvprofit.com/markets/gift-nifty-drops-over-70-points-after-donald-trump-levies-additional-25-tariffs-on-india",
    "timestamp": "2025-08-06T16:35:28Z"
  },
  {
    "title": "In Effort To Paint Sydney Sweeney As Unattractive, Libs Teach American Men She Is Republican Who Shoots Guns And Works On Classic Cars",
    "description": "I have no real desire to platform Sydney Sweeney or American Eagle's slightly raunchy ad campaign. The Bee said it well: That said, the Left just spent a solid week telling us that a generic jeans ad was NAZI PROPAGANDA. Look at a few of the headlines from ma…",
    "link": "https://freerepublic.com/focus/f-chat/4333039/posts",
    "timestamp": "2025-08-06T16:34:48Z"
  },
  {
    "title": "The Voting Rights Act is turning 60. Civil rights marchers recall a hard-won struggle",
    "description": "Wednesday marks the 60th anniversary of the landmark legislation becoming law.",
    "link": "https://www.bostonherald.com/2025/08/06/us-voting-rights-act-marchers/",
    "timestamp": "2025-08-06T16:34:37Z"
  },
  {
    "title": "Govt. Website ‘Glitch’ Removes Trump’s Least Favorite Part of Constitution",
    "description": "Trump is trying to take over the Library of Congress, but its website already deleted a part of the Constitution that Trump officials don’t like.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-least-favorite-part-constitution-deleted-1235401874/",
    "timestamp": "2025-08-06T16:34:18Z"
  },
  {
    "title": "Zelenskiy, Trump speak by phone - source",
    "description": "(Reuters) -Ukrainian President Volodymyr Zelenskiy spoke by phone with U.S. President Donald Trump on Wednesday, a source familiar with the matter told Reuters. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/07/zelenskiy-trump-speak-by-phone---source",
    "timestamp": "2025-08-06T16:33:00Z"
  },
  {
    "title": "A new Supreme Court case asks whether children still have First Amendment rights",
    "description": "Let’s give credit where it is due. The current Supreme Court has a decent record on free speech issues.  There have been some worrisome moves, such as the Court’s decision not to immediately reverse an appeals court decision that stripped activists of their r…",
    "link": "https://www.vox.com/scotus/422520/supreme-court-free-speech-children-social-media",
    "timestamp": "2025-08-06T16:32:55Z"
  },
  {
    "title": "Trump administration ends age cap for ICE positions in major recruitment drive",
    "description": "Homeland Security announced an end to age restrictions for ICE officers amid 830% surge in assaults on agents and expanded deportation operations.",
    "link": "https://www.foxnews.com/politics/trump-administration-ends-age-cap-ice-positions-major-recruitment-drive",
    "timestamp": "2025-08-06T16:31:00Z"
  },
  {
    "title": "NY Gov. Vows Retaliation If Texas ‘Rigs’ Midterms With ‘Legal Insurrection’",
    "description": "Professor Jacobson vigorously defended his blog and rejected the allegations.\nThe post NY Gov. Vows Retaliation If Texas ‘Rigs’ Midterms With ‘Legal Insurrection’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/ny-gov-vows-retaliation-if-texas-rigs-midterms-with-legal-insurrection/",
    "timestamp": "2025-08-06T16:30:53Z"
  },
  {
    "title": "What Trump’s tariffs mean for Shein and Temu shoppers",
    "description": "US President Trump is ending a duty-free loophole used by Shein and Temu, signalling major changes to online retail.",
    "link": "https://www.aljazeera.com/video/the-take-2/2025/8/6/aje-onl-aj_tt_glb_ajabarber_video_v3-060825",
    "timestamp": "2025-08-06T16:30:43Z"
  },
  {
    "title": "Indian textile exporters halt US orders amid doubled tariff impact",
    "description": "Indian textile and apparel exporters are halting US order manufacturing due to President Trump's tariff doubling to 50%, severely impacting their competitiveness against nations like Bangladesh and Vietnam. This move is expected to cause export decline, job l…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indian-textile-exporters-halt-us-orders-amid-doubled-tariff-impact/articleshow/123146465.cms",
    "timestamp": "2025-08-06T16:30:24Z"
  },
  {
    "title": "Who Has It Worse? Here's What Industry Experts Think",
    "description": "President Donald Trump slapped an additional 25% tariffs on Indian goods being exported to the United States. The additional tariffs will be effective from Aug. 27, according to the executive order, bringing up the total tariffs India has to pay to 50% Here i…",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-tariffs-on-india-who-has-it-worse-heres-what-industry-experts-think",
    "timestamp": "2025-08-06T16:30:20Z"
  },
  {
    "title": "Carney needs to keep his eye on the source code as trade playbook is rewritten",
    "description": "Jim Hinton and Alexis Conrad: Intellectual property will be the real determinant of long-term national sovereignty and wealth, not just the dollars spent on defence",
    "link": "https://financialpost.com/technology/carney-keep-eye-on-source-code-trade-playbook-rewritten",
    "timestamp": "2025-08-06T16:30:05Z"
  },
  {
    "title": "Former and current officials clash over CISA’s role in US cyber defenses at Black Hat",
    "description": "CISA’s communications chief backed the narrowing of the agency’s scope, while a former NSA leader warned that shrinking the federal cyber workforce risks weakening U.S. defenses.",
    "link": "https://www.nextgov.com/cybersecurity/2025/08/former-and-current-officials-clash-over-cisas-role-us-cyber-defenses-black-hat/407260/",
    "timestamp": "2025-08-06T16:29:00Z"
  },
  {
    "title": "Trump Hikes India Levy Over Russian Oil As Tariff Deadline Approaches",
    "description": "US President Donald Trump on Wednesday ordered steeper tariffs on Indian goods over New Delhi's continued purchase of Russian oil, opening a new front in his trade wars just hours before another wave of duties takes effect.",
    "link": "https://www.ibtimes.com/trump-hikes-india-levy-over-russian-oil-tariff-deadline-approaches-3780340",
    "timestamp": "2025-08-06T16:27:17Z"
  },
  {
    "title": "Tim Cook will be at the White House for US investment announcement",
    "description": "Apple CEO Tim Cook will be joining President Donald Trump at the White House on Wednesday afternoon to jointly announce Apple's $100 billion U.S. investment.Apple CEO Tim Cook [left] with Donald Trump [right] at a Mac Pro factoryApple is expected to be making…",
    "link": "https://appleinsider.com/articles/25/08/06/tim-cook-will-be-at-the-white-house-for-us-investment-announcement",
    "timestamp": "2025-08-06T16:27:02Z"
  },
  {
    "title": "How will Trump's 50% tariffs on India impact its economy?",
    "description": "A 50% tariff rate will be the highest levy among any U.S. trading partner, with some sectors of Indian economy more exposed than others.",
    "link": "https://www.cnbc.com/2025/08/06/how-will-trumps-50percent-tariffs-on-india-impact-its-economy.html",
    "timestamp": "2025-08-06T16:25:37Z"
  },
  {
    "title": "Michigan museum preserves Civil Rights artifacts amid federal efforts to downplay Black history",
    "description": "Museums are facing pressure to minimize artifacts that explain American history from a Black perspective.",
    "link": "https://www.bostonherald.com/2025/08/06/civil-rights-museums/",
    "timestamp": "2025-08-06T16:24:30Z"
  },
  {
    "title": "Claire’s Declares Second Bankruptcy Amid Brick-and-Mortar Shopping Drop",
    "description": "Kid-friendly accessories retailer Claire’s is declaring bankruptcy for the second time in seven years. [contact-form-7] The long-time mall staple said in a Wednesday (Aug. 6) press release that its stores will remain open as it seeks Chapter 11 bankruptcy pro…",
    "link": "http://www.pymnts.com/news/retail/2025/claires-declares-second-bankruptcy-amid-brick-and-mortar-shopping-drop/",
    "timestamp": "2025-08-06T16:23:53Z"
  },
  {
    "title": "Brazil’s government requests consultations at WTO over Trump’s tariffs, official says",
    "description": "RIO DE JANEIRO (AP) — Brazil has requested consultations at the World Trade Organization over tariffs imposed by U.S. President Donald Trump against the South American nation, a government official told The Associated Press on Wednesday. The official, who was…",
    "link": "https://financialpost.com/pmn/brazils-government-requests-consultations-at-wto-over-trumps-tariffs-official-says",
    "timestamp": "2025-08-06T16:23:32Z"
  },
  {
    "title": "Most powerful woman in the US? MAGA firebrand Laura Loomer quietly reshaping power circles, even Trump is listening",
    "description": "Laura Loomer, a far-right activist once banned from social media, has become an influential, unofficial advisor to Donald Trump. Her relentless attacks on political rivals and unwavering loyalty have earned her the president's ear. Loomer's exposés and social…",
    "link": "https://economictimes.indiatimes.com/news/international/us/most-powerful-woman-in-the-us-maga-firebrand-laura-loomer-quietly-reshaping-power-circles-even-trump-is-listening/articleshow/123145836.cms",
    "timestamp": "2025-08-06T16:23:22Z"
  },
  {
    "title": "Ghislaine Maxwell got ‘special preference’ with move to Texas Club Fed that no other inmate gets, experts say",
    "description": "Some ex-prison staffers called Maxwell’s move ‘unheard of’",
    "link": "https://www.the-independent.com/news/world/americas/crime/ghislaine-maxwell-prison-transfer-texas-b2803066.html",
    "timestamp": "2025-08-06T16:21:26Z"
  },
  {
    "title": "Trump's tariffs and the tax bill are splitting the stock market. Here's the playbook for investors, according to Morgan Stanley.",
    "description": "Trump's One Big Beautiful Bill and sweeping tariffs are creating rifts in the stock market. Here's what to invest in, according to Morgan Stanley.",
    "link": "https://www.businessinsider.com/stock-market-what-to-invest-trump-tariffs-tax-bill-playbook-2025-8",
    "timestamp": "2025-08-06T16:20:18Z"
  },
  {
    "title": "Swiss President Hopes Washington Talks Avert Surprise Tariff",
    "description": "Switzerland's president held last-gasp talks with the US secretary of state on Wednesday after she rushed to Washington to avert a surprise steep hike in tariffs -- but her chances of meeting Donald Trump were unclear.",
    "link": "https://www.ibtimes.com/swiss-president-hopes-washington-talks-avert-surprise-tariff-3780337",
    "timestamp": "2025-08-06T16:18:20Z"
  },
  {
    "title": "RFK Jr. Cancels mRNA-Vaccine Funding and the Blowback Is Swift",
    "description": "While anti-vaxxers are thrilled, experts warn that defunding mRNA development takes away our already-proven best weapon against future pandemics.",
    "link": "http://nymag.com/intelligencer/article/rfk-jr-cancels-mrna-vaccine-contracts-experts-reactions.html",
    "timestamp": "2025-08-06T16:17:55Z"
  },
  {
    "title": "Additional 25% tariff will essentially cut off most Indian exports to US, says former trade official",
    "description": "President Trump's imposition of an additional 25% tariff threatens to halt most Indian exports to the US, raising concerns from former trade officials. This escalation in the US-India trade dispute, partly due to India's purchase of Russian oil, has prompted …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/additional-25-tariff-will-essentially-cut-off-most-indian-exports-to-us-says-former-trade-official/articleshow/123146227.cms",
    "timestamp": "2025-08-06T16:16:20Z"
  },
  {
    "title": "Selective Media Indignation: Which Scandals Get Defined as a ‘Distraction,’ Which Don’t",
    "description": "There’s something funny in scandal politics when people accuse each other of pushing a “distraction.” So if Donald Trump tries to change the subject to... Read More\nThe post Selective Media Indignation: Which Scandals Get Defined as a ‘Distraction,’ Which Don…",
    "link": "https://www.dailysignal.com/2025/08/06/selective-media-indignation-which-scandals-get-defined-as-a-distraction-which-dont/",
    "timestamp": "2025-08-06T16:16:15Z"
  },
  {
    "title": "House committee subpoenas Epstein files",
    "description": "The House Oversight Committee has issued a subpoena to the Justice Department for its Jeffrey Epstein files with an Aug. 19 deadline",
    "link": "https://theweek.com/politics/epstein-files-subpoenas",
    "timestamp": "2025-08-06T16:15:52Z"
  },
  {
    "title": "NBC News Promotes Michelle Perry to Deputy Washington Bureau Chief",
    "description": "Her promotion follows a 20-year tenure within NBC, most recently as head of MSNBC's national security unit\nThe post NBC News Promotes Michelle Perry to Deputy Washington Bureau Chief appeared first on TheWrap.",
    "link": "https://www.thewrap.com/nbc-news-promotes-michelle-perry-deputy-washington-bureau-chief/",
    "timestamp": "2025-08-06T16:15:44Z"
  },
  {
    "title": "Sean Duffy, Take A Flying F*ck At THE MOOOOOON",
    "description": "Dude's afraid of the subway, but he's going to take on THE MOOOOOON?",
    "link": "https://www.wonkette.com/p/sean-duffy-take-a-flying-fck-at-the",
    "timestamp": "2025-08-06T16:15:35Z"
  },
  {
    "title": "MAKES SENSE – Devin Nunes: The Raid on Mar-a-Lago Was to Retrieve Declassified HPSCI Report That Deconstructed Obama/Brennan ICA",
    "description": "Former House Permanent Select Committee on Intelligence Chairman Devin Nunes appeared for an interview with Grant Stinchfield and walks through the timeline of the Russiagate hoax. Within the interview, Devin Nunes makes a solid argument that the FBI raid on …",
    "link": "https://freerepublic.com/focus/f-news/4333035/posts",
    "timestamp": "2025-08-06T16:15:14Z"
  },
  {
    "title": "MAKES SENSE – Devin Nunes: The Raid on Mar-a-Lago Was to Retrieve Declassified HPSCI Report That Deconstructed Obama/Brennan ICA",
    "description": "Former House Permanent Select Committee on Intelligence Chairman Devin Nunes appeared for an interview with Grant Stinchfield and walks through the timeline of the Russiagate hoax. Within the interview, Devin Nunes makes a solid argument that the FBI raid on …",
    "link": "https://freerepublic.com/focus/f-bloggers/4333035/posts",
    "timestamp": "2025-08-06T16:15:14Z"
  },
  {
    "title": "Trump Imposes 50% Tariffs on Indian Imports Over Russian Oil Purchases",
    "description": "U.S. President Donald Trump has signed an executive order enacting an additional 25% tariff on Indian goods, explicitly targeting India’s ongoing imports of Russian crude oil. This order increases the total tariff rate on Indian exports to the United States t…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Imposes-50-Tariffs-on-Indian-Imports-Over-Russian-Oil-Purchases.html",
    "timestamp": "2025-08-06T16:15:00Z"
  },
  {
    "title": "REPORT: Former Special Counsel Robert Mueller Allegedly Living In Memory Care Facility",
    "description": "Robert Mueller, the former Federal Bureau of Investigations (FBI) Director and Special Counsel, is reportedly now residing in a memory-care facility.",
    "link": "https://dailycaller.com/2025/08/06/robert-mueller-fbi-jeffrey-epstein-memory-care-russia-collusion-house-oversight/",
    "timestamp": "2025-08-06T16:14:56Z"
  },
  {
    "title": "U.S. and Russia nuclear war to start after February, 2026? Experts sound major warning",
    "description": "Nuclear rhetoric between Russia and USA has sent shockwaves through the world. People want to know will there be a war between the US and Russia.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-and-russia-nuclear-war-to-start-after-february-2026-experts-sound-major-warning/articleshow/123146120.cms",
    "timestamp": "2025-08-06T16:13:27Z"
  },
  {
    "title": "Trump says new semiconductor tariffs will be revealed as early as next week",
    "description": "U.S. President Donald Trump says new tariffs on semiconductors will be unveiled as early as next week. In an interview with CNBC, Trump said semiconductors and chips are a “separate category” from other goods and will be hit with their own levies accordingly,…",
    "link": "https://mobilesyrup.com/2025/08/06/us-donald-trump-new-semiconductor-tariffs/",
    "timestamp": "2025-08-06T16:12:50Z"
  },
  {
    "title": "Fort Stewart: Five soldiers shot on Georgia military base, suspect in custody",
    "description": "Fort Stewart: Five soldiers shot on Georgia military base, suspect in custodybbc.co.uk",
    "link": "https://www.bbc.co.uk/news/articles/c7vlngvm6d7o",
    "timestamp": "2025-08-06T16:12:34Z"
  },
  {
    "title": "Texas Democrats Evacuate After Bomb Threat At Chicago Hotel",
    "description": "\"This is what happens when Republican state leaders publicly call for us to be 'hunted down,'\" one Texas Democratic lawmaker said Wednesday.",
    "link": "https://www.huffpost.com/entry/texas-democrats-redistricting-bomb_n_689370bde4b06747ff5e1a91",
    "timestamp": "2025-08-06T16:11:29Z"
  },
  {
    "title": "India At Par With Brazil Among Countries Hit With Sharpest Trump Tariffs - Check Full List",
    "description": "United States President Donald Trump on Wednesday has imposed an additional 25% tariff on India, raising the total tariff thrust to 50%. India’s defence and energy ties with Russia might have intensified the situation.",
    "link": "https://www.ndtvprofit.com/economy-finance/india-at-par-with-brazil-among-countries-hit-with-sharpest-trump-tariffs-check-full-list",
    "timestamp": "2025-08-06T16:11:09Z"
  },
  {
    "title": "Russia’s decision to pull out of nuclear treaty makes the world more dangerous",
    "description": "The move has prompted fears of a new nuclear arms race.",
    "link": "https://theconversation.com/russias-decision-to-pull-out-of-nuclear-treaty-makes-the-world-more-dangerous-262742",
    "timestamp": "2025-08-06T16:10:56Z"
  },
  {
    "title": "OpenAI wants ChatGPT to run the US government",
    "description": "Over 2 million federal workers will now have access to leading AI model",
    "link": "https://www.the-independent.com/tech/chatgpt-us-government-openai-b2803123.html",
    "timestamp": "2025-08-06T16:10:49Z"
  },
  {
    "title": "Finn McRedmond: Humourless raging against Sydney Sweeney's jeans ad is pointless",
    "description": "Actor’s American Eagle ad is not proof that ‘woke’ is dead or that there has been a ‘vibe shift’ to the right",
    "link": "https://www.irishtimes.com/opinion/2025/08/07/humourless-raging-against-sydney-sweeneys-american-eagle-jeans-ad-is-pointless/",
    "timestamp": "2025-08-06T16:10:27Z"
  },
  {
    "title": "President Trump Threatens D.C. Takeover After DOGE Member 'Big Balls' Assaulted",
    "description": "A prominent DOGE member known for his online persona \"Big Balls\" was assaulted in Washington, DC, which prompted President Donald Trump to call for a federal takeover of the nation's capital.\nThe post President Trump Threatens D.C. Takeover After DOGE Member …",
    "link": "https://www.breitbart.com/politics/2025/08/06/trump-threatens-d-c-takeover-after-doge-member-big-balls-assaulted/",
    "timestamp": "2025-08-06T16:10:15Z"
  },
  {
    "title": "Every Celebrity in Photos from Inside Jeffrey Epstein's Townhouse",
    "description": "The New York Times published photos showing framed pictures of many powerful figures on display inside Epstein's seven-story Manhattan townhouse.",
    "link": "https://www.newsweek.com/celebrity-2109651",
    "timestamp": "2025-08-06T16:10:14Z"
  },
  {
    "title": "Trump’s 50% tariff: Could this be India’s next 1991 liberalisation moment? Anand Mahindra suggests 2 bold moves to turn it into opportunity",
    "description": "Anand Mahindra suggests India take strong steps after the US increased tariffs. He proposes radically improving ease of doing business with a single-window clearance system. Mahindra also suggests unleashing the power of tourism as a foreign exchange engine. …",
    "link": "https://economictimes.indiatimes.com/news/new-updates/trumps-50-tariff-could-this-be-indias-next-1991-liberalisation-moment-anand-mahindra-suggests-2-bold-moves-to-turn-it-into-opportunity/articleshow/123145978.cms",
    "timestamp": "2025-08-06T16:10:00Z"
  },
  {
    "title": "Fire chief suspended after he was filmed shouting 'Shut the **** up!' at girl, 10, being stretchered into ambulance",
    "description": "A Long Island police chief has been stripped of his duties after screaming at a young girl to 'shut the **** up' while she was loaded into the fire truck on a stretcher. In a TikTok video uploaded on Monday, North Babylon Fire Chief Peter Alt berated and hurl…",
    "link": "https://freerepublic.com/focus/f-chat/4333033/posts",
    "timestamp": "2025-08-06T16:08:21Z"
  },
  {
    "title": "No tariff trouble here! Shopify stock jumps 20% on blowout quarter and bullish outlook",
    "description": "Shopify's stock soared by 20% following impressive second-quarter results, exceeding expectations with adjusted earnings per share of 35 cents and revenue reaching $2.68 billion. The company's sales grew by 31% year-over-year, and it anticipates continued gro…",
    "link": "https://economictimes.indiatimes.com/news/international/us/no-tariff-trouble-here-shopify-stock-jumps-20-on-blowout-quarter-and-bullish-outlook/articleshow/123146034.cms",
    "timestamp": "2025-08-06T16:07:51Z"
  },
  {
    "title": "Homeland Security removes age limits for ICE recruits to boost hiring for Trump deportations",
    "description": "Applicants can now be as young as 18.",
    "link": "https://www.denverpost.com/2025/08/06/ice-age-limits/",
    "timestamp": "2025-08-06T16:07:35Z"
  },
  {
    "title": "Homeland Security removes age limits for ICE recruits to boost hiring for Trump deportations",
    "description": "Applicants can now be as young as 18.",
    "link": "https://www.bostonherald.com/2025/08/06/ice-age-limits/",
    "timestamp": "2025-08-06T16:07:35Z"
  },
  {
    "title": "Trump broke his promise to Latino voters. But Democrats are struggling to win them back.",
    "description": "Latinos who voted for Trump are feeling betrayed on his failure to deliver economic promises. But Democrats are not doing enough to win them back, according to polls.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-latino-voters-poll-republicans-democrats-equis-rcna222894",
    "timestamp": "2025-08-06T16:06:58Z"
  },
  {
    "title": "Trump Administration Considering Interview With Epstein Critic Joe Rogan to Quiet Controversy",
    "description": "Trump's administration are meeting discuss the best strategy for dealing with Epstein backlash, and one of the ideas being considered is a Joe Rogan interview.\nThe post Trump Administration Considering Interview With Epstein Critic Joe Rogan to Quiet Controve…",
    "link": "https://www.mediaite.com/media/news/trump-administration-considering-interview-with-epstein-critic-joe-rogan-to-quiet-controversy/",
    "timestamp": "2025-08-06T16:06:03Z"
  },
  {
    "title": "White House says Apple to invest billions in US manufacturing",
    "description": "The White House is expected to announce the new deal as early as Wednesday.",
    "link": "https://www.aljazeera.com/economy/2025/8/6/white-house-says-apple-to-invest-billions-in-us-manufacturing",
    "timestamp": "2025-08-06T16:05:55Z"
  },
  {
    "title": "Trumpworld Knows Epstein Is a Problem. But They Can't Solve It (Jake Lahut/Wired)",
    "description": "Jake Lahut / Wired:\nTrumpworld Knows Epstein Is a Problem.  But They Can't Solve It  —  Unmet expectations have pushed some of the president's allies to the brink.  “Honestly, like, fuck Trump,” a Trumpworld source who works in conservative media tells me.  —…",
    "link": "https://www.memeorandum.com/250806/p61",
    "timestamp": "2025-08-06T16:05:01Z"
  },
  {
    "title": "Democrats attempting to visit Brooklyn ICE facility reportedly ‘trapped’ after being rebuffed by agents",
    "description": "Reps. Espaillat, Velazquez and Goldman were refused access to Brooklyn MDC facility in the latest incident of lawmakers being rebuffed at federal detention centers",
    "link": "https://www.foxnews.com/politics/democrats-attempting-visit-brooklyn-ice-facility-reportedly-trapped-after-being-rebuffed-agents",
    "timestamp": "2025-08-06T16:04:46Z"
  },
  {
    "title": "Trump raises India tariff to 50% over Russian oil",
    "description": "US President Donald Trump has increased levies on Indian goods to 50% in a move New Delhi has branded ‘unfair’ and ‘unjustified’ Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622574-trump-india-tariff-russia/",
    "timestamp": "2025-08-06T16:04:27Z"
  },
  {
    "title": "Kristi Noem kills age cap for ICE — letting teenagers join the force and get guns",
    "description": "The Department of Homeland Security announced that as part of its reportedly desperate effort to recruit more agents for the United States Immigration and Customs Enforcement (ICE) it is not only eliminating the age cap, but it's lifting the age requirement f…",
    "link": "https://www.rawstory.com/trump-deportation-2673863613/",
    "timestamp": "2025-08-06T16:04:04Z"
  },
  {
    "title": "India, Once Close to Deal With US, Now Faces 50% Tariffs",
    "description": "Over the past two weeks, ties between India and the United States have descended into an exchange of rhetoric and bitterness that few could’ve seen coming.\nIndia was supposed to be one of the first countries to ink a trade deal with US President Donald Trump.…",
    "link": "https://biztoc.com/x/9a2b1b85023d17f7",
    "timestamp": "2025-08-06T16:03:56Z"
  },
  {
    "title": "Apple Will Commit $100 Billion More to US Manufacturing, Says White House Source",
    "description": "Amid tariffs, Apple is expected to announce shifting more of its supply chain to domestic assembly, at a White House event.",
    "link": "https://www.cnet.com/news/politics/apple-will-commit-100-billion-more-to-us-manufacturing-says-white-house/",
    "timestamp": "2025-08-06T16:03:00Z"
  },
  {
    "title": "Trump Slaps India With Another 25% Tariff Over Russian Oil Purchases",
    "description": "India now faces a 50% tariff.\nThe post Trump Slaps India With Another 25% Tariff Over Russian Oil Purchases first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/trump-slaps-india-with-another-25-tariff-over-russian-oil-purchases/",
    "timestamp": "2025-08-06T16:02:35Z"
  },
  {
    "title": "Jasmine Crockett Claps Back At Trump After His ‘Low IQ’ Insult: 'Not Going Anywhere'",
    "description": "The Texas Democrat pointed out the president aimed the same barb at radio host Charlamagne tha God.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-trump-low-iq_n_68935f52e4b044af87ace2ff",
    "timestamp": "2025-08-06T16:01:08Z"
  },
  {
    "title": "Trump hails progress in Russia talks, White House says secondary sanctions still planned",
    "description": "U.S. President Donald Trump on Wednesday said his special envoy Steve Witkoff had made \"great progress\" in his meeting with Russian President Vladimir Putin, as Washington continued its preparations to impose secondary sanctions on Friday.",
    "link": "https://www.independent.ie/world-news/europe/trump-hails-progress-in-russia-talks-white-house-says-secondary-sanctions-still-planned/a152211638.html",
    "timestamp": "2025-08-06T16:00:55Z"
  },
  {
    "title": "Zelensky and Trump speak by phone after US special envoy holds talks with Putin in Russia",
    "description": "Ukrainian President Volodymyr Zelensky spoke by phone with U.S. President Donald Trump on Wednesday, a source familiar with the matter told Reuters.",
    "link": "https://www.independent.ie/world-news/europe/zelensky-and-trump-speak-by-phone-after-us-special-envoy-holds-talks-with-putin-in-russia/a152211638.html",
    "timestamp": "2025-08-06T16:00:55Z"
  },
  {
    "title": "Dozens killed seeking aid in Gaza as Israel considers further military action",
    "description": "The Israeli military said it had fired warning shots when crowds approached its forces. The latest deaths came as Prime Minister Benjamin Netanyahu was expected to announced further military action — and possibly plans for Israel to fully reoccupy Gaza.",
    "link": "https://www.pbs.org/newshour/world/dozens-killed-seeking-aid-in-gaza-as-israel-considers-further-military-action",
    "timestamp": "2025-08-06T16:00:39Z"
  },
  {
    "title": "Apple is investing another $100 billion in the US, Trump set to announce (Lisa Eadicicco/CNN)",
    "description": "Lisa Eadicicco / CNN:\nApple is investing another $100 billion in the US, Trump set to announce  —  Apple is investing another $100 billion to expand its operations in the United States, President Donald Trump will announce later Wednesday, a White House offic…",
    "link": "https://www.memeorandum.com/250806/p59",
    "timestamp": "2025-08-06T16:00:31Z"
  },
  {
    "title": "The GOP’s assault on public media will hit rural America the hardest",
    "description": "As the Corporation for Public Broadcasting shuts down, here's how that could impact your local media.",
    "link": "https://www.salon.com/2025/08/06/the-gops-assault-on-public-media-will-hit-rural-america-the-hardest/",
    "timestamp": "2025-08-06T16:00:29Z"
  },
  {
    "title": "Richest women in America",
    "description": "Most \"richest people\" lists are dominated by men. To counteract that, Stacker celebrated the richest women in America, using 2025 data from Forbes.",
    "link": "https://stacker.com/stories/money/richest-women-america",
    "timestamp": "2025-08-06T16:00:00Z"
  },
  {
    "title": "Today's news and jokes",
    "description": "The casual and unexamined enslavement of droids in Star Wars always bothered me. They seem sapient.\n\nExcept now Star Wars seems downright prescient in its scif-i. Given we've got these tools that act lifelike, but everyone agrees they lack interiority or righ…",
    "link": "https://www.superpunch.net/2025/08/todays-news-and-jokes_0440538464.html",
    "timestamp": "2025-08-06T16:00:00Z"
  },
  {
    "title": "Bomb threat made to House Democrats’ hotel in Illinois",
    "description": "ST CHARLES, Ill. — Texas House Democrats in Illinois were evacuated from their hotel Wednesday morning after the hotel received a bomb threat. “This morning, a threat was made against the safety of the members of the Texas House Democratic Caucus. We are safe…",
    "link": "https://freerepublic.com/focus/f-news/4333032/posts",
    "timestamp": "2025-08-06T15:59:39Z"
  },
  {
    "title": "Pete Hegseth Orders Return of Confederate Memorial to Arlington National Cemetery",
    "description": "Defense Secretary Pete Hegseth is committed to rooting out woke, and that includes returning confederate memorials to their rightful places.\nThe post Pete Hegseth Orders Return of Confederate Memorial to Arlington National Cemetery appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/06/pete-hegseth-orders-return-of-confederate-memorial-to-arlington-national-cemetery/",
    "timestamp": "2025-08-06T15:59:13Z"
  },
  {
    "title": "O’Rourke: If We Fail in Texas, We’ll Have a Third Trump Term",
    "description": "Wednesday on CNN's \"The Situation Room,\" former Rep. Beto O’Rourke (D-TX) said that if Democrats are unable to stop the proposed redistricting in Texas, President Donald Trump would likely have a third term.\nThe post O’Rourke: If We Fail in Texas, We’ll Have …",
    "link": "https://www.breitbart.com/clips/2025/08/06/orourke-if-we-fail-in-texas-well-have-a-third-trump-term/",
    "timestamp": "2025-08-06T15:59:09Z"
  },
  {
    "title": "5 takeaways and questions from Marjorie Taylor Greene's George Santos commutation push",
    "description": "The Georgia Republican seeks a sentence reduction, not a pardon, for Santos, who previously represented New York as a Republican in the U.S. House.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/marjorie-taylor-greene-george-santos-commutation-trump-rcna223342",
    "timestamp": "2025-08-06T15:58:42Z"
  },
  {
    "title": "Poland’s new pro-Trump president brings nation into uncharted waters",
    "description": "Karol Nawrocki promises to block any attempts by the EU to ‘take away Poland’s powers’",
    "link": "https://www.irishtimes.com/world/europe/2025/08/06/polands-new-pro-trump-president-brings-nation-into-uncharted-waters/",
    "timestamp": "2025-08-06T15:57:18Z"
  },
  {
    "title": "Backlash After 'Interview' With AI Avatar Of US School Shooting Victim",
    "description": "Independent journalist Jim Acosta faced a torrent of online criticism Wednesday after he posted an \"interview\" conducted with an AI avatar of a US school shooting victim.",
    "link": "https://www.ibtimes.com/backlash-after-interview-ai-avatar-us-school-shooting-victim-3780335",
    "timestamp": "2025-08-06T15:57:12Z"
  },
  {
    "title": "Kristi Noem Cuts Age Cap For ICE Agents To Supercharge Trump Deportation Agenda",
    "description": "Department of Homeland Security (DHS) Secretary Kristi Noem announced in a Fox & Friends interview on Wednesday that Immigration and Customs Enforcement (ICE) is ending its age cap for officer applications. Noem encouraged her viewers to apply for positions w…",
    "link": "https://dailycaller.com/2025/08/06/kristi-noem-announces-end-of-age-cap-for-ice-applications/",
    "timestamp": "2025-08-06T15:56:56Z"
  }
]