[
  {
    "title": "Senate Republicans avoid clash with Trump over Fed firing",
    "description": "Key GOP senators largely shied away from criticizing President Donald Trump’s move to fire Fed Gov. Lisa Cook as they returned from their monthlong August recess on Tuesday, even as they stressed the importance of an independent central bank. \n“I believe in F…",
    "link": "https://biztoc.com/x/0b16b40423cb94cf",
    "timestamp": "2025-09-03T00:35:35Z"
  },
  {
    "title": "Donald Trump Sparks More Health Concerns as He Struggles to Breathe in New Interview - NewsBreak",
    "description": "Donald Trump Sparks More Health Concerns as He Struggles to Breathe in New Interview - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4210607157348-donald-trump-sparks-more-health-concerns-as-he-struggles-to-breathe-in-new-interview?_f=app_share&amp;pd=04jPZECv&amp;lang=en_US&amp;send_time=1756859578&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.32.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-09-03T00:33:53Z"
  },
  {
    "title": "Scott Jennings Needs Only 3 Words To Shred Tim Walz For Hoping Trump Dies",
    "description": "Scott Jennings tore into Democratic Minnesota Gov. Tim Walz on Tuesday for hoping President Donald Trump dies soon.",
    "link": "https://dailycaller.com/2025/09/02/scott-jennings-tim-walz-donald-trump-dead/",
    "timestamp": "2025-09-03T00:33:21Z"
  },
  {
    "title": "Appeals court rejects Trump’s bid to fire Biden-appointed FTC member - Politico",
    "description": "Appeals court rejects Trump’s bid to fire Biden-appointed FTC memberPolitico Appeals court blocks Trump from firing FTC commissionerAxios US appeals court reinstates FTC commissioner fired by TrumpThe Guardian US court reinstates antitrust commissioner Donald…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178985292",
    "timestamp": "2025-09-03T00:33:07Z"
  },
  {
    "title": "As Trump declares ‘we’re going in,’ Pritzker says ‘terror and cruelty is the point’",
    "description": "Naval Station Great Lakes in North Chicago will be the staging grounds for ICE, the Sun-Times reported. Pritzker said staging began at the base Monday.",
    "link": "https://pantagraph.com/news/state-regional/government-politics/article_bf5ed4f4-0c38-4808-8ab4-390ab4b1bdc8.html",
    "timestamp": "2025-09-03T00:30:00Z"
  },
  {
    "title": "US tariffs on critical tools will drive up semiconductor costs: ASML CEO",
    "description": "ASML CEO Christophe Fouquet cautioned that US tariffs on essential semiconductor manufacturing tools would inflate chip production costs. He emphasized the industry's reliance on ASML systems, even for US expansion, and highlighted the benefits of open collab…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-tariffs-on-critical-tools-will-drive-up-semiconductor-costs-asml-ceo/articleshow/123664264.cms",
    "timestamp": "2025-09-03T00:30:00Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,287",
    "description": "Here are the key events on day 1,287 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/9/3/russia-ukraine-war-list-of-key-events-day-1287",
    "timestamp": "2025-09-03T00:29:11Z"
  },
  {
    "title": "CNN gets heated as Republican bemoans DC's 'milquetoast liberals' 'You live in Virginia!'",
    "description": "A fed-up New York Times journalist yelled at a Republican strategist on CNN on Tuesday evening during a heated discussion over President Donald Trump's decision to send troops to Washington, D.C., and his threat to do the same in Chicago to address crime.Lulu…",
    "link": "https://www.rawstory.com/trump-crime-2673950847/",
    "timestamp": "2025-09-03T00:28:31Z"
  },
  {
    "title": "Robin Wright Says She Ditched the US for the UK Because It’s ‘A S–tshow’",
    "description": "\"Everything’s rush, competition and speed,\" the \"House of Cards\" actress says of America\nThe post Robin Wright Says She Ditched the US for the UK Because It’s ‘A S–tshow’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/why-robin-wright-moved-the-england/",
    "timestamp": "2025-09-03T00:26:47Z"
  },
  {
    "title": "West Point restores Confederate Gen. Robert E. Lee's portrait",
    "description": "The actions at West Point come as the Trump administration restores Confederate names and monuments that had been removed in recent years.",
    "link": "https://www.wlwt.com/article/west-point-restore-robert-e-lee-portrait/65961866",
    "timestamp": "2025-09-03T00:26:33Z"
  },
  {
    "title": "Trump warns that America could become \"a third world country\" if this happens",
    "description": "The President has earlier warned that this change could \"destroy the United States.\"",
    "link": "https://www.thestreet.com/investing/trump-warns-that-america-could-become-a-third-world-country-if-this-happens",
    "timestamp": "2025-09-03T00:22:53Z"
  },
  {
    "title": "“Harsh Measures”? – President Trump Announces Space Command Will Move From Colorado Springs to Huntsville, Alabama",
    "description": "Last month, President Donald Trump took to Truth to announce “harsh measures” in response to the persecution of former Mesa County Clerk Tina Peters, who is serving a nine-year sentence in Colorado prison for making a forensic image of voting systems in her c…",
    "link": "https://www.thegatewaypundit.com/2025/09/harsh-measures-president-trump-announces-space-command-will/",
    "timestamp": "2025-09-03T00:20:18Z"
  },
  {
    "title": "Chicago Mayor Johnson: Trump Is 'Reprehensible,' He's Trampling on Our Constitution",
    "description": "Chicago Mayor Brandon Johnson said Tuesday on MSNBC's \"The Weeknight\" that President Donald Trump was \"reprehensible\" for \"trampling on our constitution.\"\nThe post Chicago Mayor Johnson: Trump Is ‘Reprehensible,’ He’s Trampling on Our Constitution appeared fi…",
    "link": "https://www.breitbart.com/clips/2025/09/02/chicago-mayor-johnson-trump-is-reprehensible-hes-trampling-on-our-constitution/",
    "timestamp": "2025-09-03T00:17:50Z"
  },
  {
    "title": "Trump dismisses rumors he is in ill health",
    "description": "WASHINGTON (Reuters) - President Donald Trump on Tuesday dismissed reports on social media that he is in ill health, saying he was busy over the Labor Day weekend giving media interviews and visiting his Virginia golf course. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/03/trump-dismisses-rumors-he-is-in-ill-health",
    "timestamp": "2025-09-03T00:13:00Z"
  },
  {
    "title": "Trump says 11 killed in strike on alleged drug-carrying boat from Venezuela",
    "description": "The US military attack comes as the US surges military presence in the Caribbean, risking an escalation with Venezuela.",
    "link": "https://www.aljazeera.com/news/2025/9/3/trump-says-11-killed-in-strike-on-alleged-drug-carrying-boat-from-venezuela",
    "timestamp": "2025-09-03T00:11:15Z"
  },
  {
    "title": "CNN Data Chief Names The Big 'Flashing Red' Sign For GOP Ahead Of Midterms",
    "description": "Harry Enten pointed to two key races that have \"predictive power\" for next year's elections.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-virginia-new-jersey-gubernatorial-races-2026-midterms_n_68b7740ce4b03b8748b8bd83",
    "timestamp": "2025-09-03T00:09:10Z"
  },
  {
    "title": "Gold Holds After Surging to Record on Rate-Cut Bets, Debt Fears",
    "description": "Gold held a six-day rally that pushed prices to an all-time high on Tuesday, as the prospect of US interest-rate cuts boosted the metal’s appeal and traders sought safety following a selloff in equity and bond markets.",
    "link": "https://financialpost.com/pmn/business-pmn/gold-holds-after-surging-to-record-on-rate-cut-bets-debt-fears",
    "timestamp": "2025-09-03T00:08:53Z"
  },
  {
    "title": "Breaking: Epstein files released after Trump administration push",
    "description": "Following growing speculation over the president's ties to the disgraced financier, the Trump administration had called for the files to be released.",
    "link": "https://www.abc.net.au/news/2025-09-03/epstein-files-unsealed-after-trump-administration-push/105585880",
    "timestamp": "2025-09-03T00:07:59Z"
  },
  {
    "title": "Trump says he's set to order federal intervention in Chicago and Baltimore, despite local opposition",
    "description": "President Donald Trump says he will direct federal law enforcement intervention to combat crime in Chicago and Baltimore, despite staunch opposition from state and local officials in both cities",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-set-order-federal-intervention-chicago-baltimore-despite-125193659",
    "timestamp": "2025-09-03T00:06:29Z"
  },
  {
    "title": "More rebukes for prosecutors: Grand jurors refuse to indict 2 people accused of threatening Trump",
    "description": "Federal grand jurors in the nation’s capital have refused to indict two people who were charged separately with threatening to kill President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/rebukes-prosecutors-grand-jurors-refuse-indict-2-people-125191572",
    "timestamp": "2025-09-03T00:06:20Z"
  },
  {
    "title": "'The Trump Health Cover-Up': Mehdi and Jim Acosta Slam the Mainstream Media's Complicity in a Huge Scandal",
    "description": "The former MSNBC and CNN anchors discuss Trump's health issues, the prospects of a JD Vance presidency, and the latest threats to deploy the National Guard to Chicago.",
    "link": "https://zeteo.com/p/this-has-nothing-to-do-with-crime",
    "timestamp": "2025-09-03T00:01:47Z"
  },
  {
    "title": "Cory Booker Is Getting Married",
    "description": "Sen. Cory Booker (D-NJ), a former Democratic presidential candidate whose outspoken opposition to President Donald Trump has drawn national attention, is engaged, the Washington Post reports. Booker, 56, proposed to his girlfriend, Alexis Lewis, 38,",
    "link": "https://politicalwire.com/2025/09/02/cory-booker-is-getting-married/",
    "timestamp": "2025-09-03T00:01:13Z"
  },
  {
    "title": "Trump, Leavitt pile on 'nasty' CBS News host Margaret Brennan as 'stupid,' 'so bad'",
    "description": "President Donald Trump and White House press secretary Karoline Leavitt took aim at CBS News' \"Face the Nation\" moderator Margaret Brennan.",
    "link": "https://www.foxnews.com/media/trump-leavitt-pile-nasty-cbs-news-host-margaret-brennan-stupid-so-bad",
    "timestamp": "2025-09-03T00:00:24Z"
  },
  {
    "title": "The Gaza War Isn’t Over, But Israel Has Already Lost",
    "description": "The Israeli regime has lost its multi-front war in Gaza, the West Bank, Lebanon, Syria, and Yemen. Yes, really. It may not look like it, but the defeat is real and  baked into Israel’s future. Let me first make the case for Israeli “victory”: Since its 2023 i…",
    "link": "https://original.antiwar.com/thomas-knapp/2025/09/02/the-gaza-war-isnt-over-but-israel-has-already-lost/",
    "timestamp": "2025-09-03T00:00:10Z"
  },
  {
    "title": "ALIVE",
    "description": "President Donald Trump aimed to make a 'mystery' announcement, but critics online were immediately more focused on how 'rough' he looked after rumors of his untimely death trended all weekend",
    "link": "https://www.themirror.com/news/politics/breaking-donald-trump-looks-rough-1366845",
    "timestamp": "2025-09-03T00:00:03Z"
  },
  {
    "title": "Oil Steadies as Traders Weigh Geopolitical Risks, OPEC+ Policy",
    "description": "Oil steadied after closing at the highest in a month as investors weighed a host of geopolitical risks, including a potential escalation of US sanctions on Russian flows, in the run-up to an OPEC+ meeting on supply.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-steadies-as-traders-weigh-geopolitical-risks-opec-policy",
    "timestamp": "2025-09-02T23:58:28Z"
  },
  {
    "title": "Trump, who questioned his opponents' health, rebuffs rumors about his own",
    "description": "President Donald Trump is alive, rebuffing rumors about his health after he was not seen in public for a few days and amid speculation about bruises on his hand.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-rebuffs-health-speculation-golf-hand-bruise-biden-clinton-rcna228542",
    "timestamp": "2025-09-02T23:57:18Z"
  },
  {
    "title": "Pritzker’s clash with Trump offers political test for Illinois governor | CNN Politics",
    "description": "Illinois Gov. JB Pritzker has been eager to push back against President Donald Trump, and now the moment that could catapult him into the national limelight — with near-term consequences for his state and long-term implications for his political future — has …",
    "link": "https://www.cnn.com/2025/09/02/politics/illinois-governor-pritzker-trump-test",
    "timestamp": "2025-09-02T23:56:35Z"
  },
  {
    "title": "NYC mayoral candidate Jim Walden drops out and implores rivals to consolidate against Zohran Mamdani",
    "description": "Jim Walden, an independent candidate in New York City’s mayoral race, has suspended his campaign",
    "link": "https://abcnews.go.com/US/wireStory/nyc-mayoral-candidate-jim-walden-drops-implores-rivals-125198392",
    "timestamp": "2025-09-02T23:50:27Z"
  },
  {
    "title": "NYC mayoral candidate Jim Walden drops out and implores rivals to consolidate against Zohran Mamdani",
    "description": "Jim Walden, an independent candidate in New York City’s mayoral race, has suspended his campaign",
    "link": "https://abcnews.go.com/Politics/wireStory/nyc-mayoral-candidate-jim-walden-drops-implores-rivals-125198393",
    "timestamp": "2025-09-02T23:50:27Z"
  },
  {
    "title": "Pat Buchanan Belongs Among the Conservative Movement’s Greatest Heroes",
    "description": "In 1963, when President John F. Kennedy gave the Presidential Medal of Freedom its name, he said that “in a period when the national government must call upon an increasing portion of the talents and energies of its citizens, it is clearly appropriate to prov…",
    "link": "https://freerepublic.com/focus/f-news/4338286/posts",
    "timestamp": "2025-09-02T23:49:38Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.09.02 Part2 WEB H264-onX",
    "description": "Season , Episode – \"\"You're Full Of S***!\" Donald Trump RETURNS After 'Fake News' Health Claims\"Donald Trump has laughed off bizarre social media rumours claiming he had died over the weekend, telling reporters: “I didn’t hear that.” At an Oval Office press c…",
    "link": "https://post.rlsbb.cc/piers-morgan-uncensored-2025-09-02-part2-web-h264-onx/",
    "timestamp": "2025-09-02T23:44:12Z"
  },
  {
    "title": "Trump dismisses health rumours as ‘fake news’",
    "description": "US PRESIDENT Donald Trump on Tuesday dismissed social media rumours that have swirled about his health as “fake news” during press conference at the White House. Read more at The Business Times.",
    "link": "https://www.businesstimes.com.sg/international/trump-dismisses-health-rumours-fake-news",
    "timestamp": "2025-09-02T23:44:02Z"
  },
  {
    "title": "Trump Addresses Rumors of His Death, Takes Shot at Biden: Wouldn't Do Press Conferences 'For Months'",
    "description": "President Donald Trump addressed rumors about his death what were spread over the weekend, pointing out that former President Joe Biden would go \"months\" without doing news conferences.\nThe post Trump Addresses Rumors of His Death, Takes Shot at Biden: Wouldn…",
    "link": "https://www.breitbart.com/politics/2025/09/02/trump-addresses-rumors-of-his-death-takes-shot-at-biden-wouldnt-do-press-conferences-for-months/",
    "timestamp": "2025-09-02T23:43:58Z"
  },
  {
    "title": "'Pervasive problems': New Trump admin report likened to 'Soviet show trial' by experts",
    "description": "The US Department of Energy's July climate report is \"biased, full of errors, and not fit to inform policymaking,\" according to a comprehensive review released Tuesday by a group of 85 scientists who reviewed the document independently.The department's \"Clima…",
    "link": "https://www.rawstory.com/trump-energy-2673950813/",
    "timestamp": "2025-09-02T23:43:49Z"
  },
  {
    "title": "Trump dismisses health rumors as 'fake news'",
    "description": "Social media users had suggested the White House had covered up the 79-year-old's death",
    "link": "https://timesofmalta.com/article/trump-dismisses-health-rumors-fake-news.1115597",
    "timestamp": "2025-09-02T23:42:47Z"
  },
  {
    "title": "Kim And Putin Join Xi For Massive China Military Parade",
    "description": "North Korean leader Kim Jong Un and Russia's Vladimir Putin are expected to flank President Xi Jinping at a massive parade in Beijing on Wednesday morning, in a historic moment capping a week of diplomatic grandstanding against the West.",
    "link": "https://www.ibtimes.com.au/kim-putin-join-xi-massive-china-military-parade-1860353",
    "timestamp": "2025-09-02T23:42:16Z"
  },
  {
    "title": "Trump says 11 dead in strike on Venezuelan drugs boat",
    "description": "The US president posted that the US military had identified the crew as members of the Venezuelan gang Tren de Aragua, which was designated a terrorist group in February.",
    "link": "https://news.sky.com/story/trump-says-11-dead-in-strike-on-venezuelan-drugs-boat-13424033",
    "timestamp": "2025-09-02T23:42:00Z"
  },
  {
    "title": "Trump's Justice Department moves to block blue state from giving financial aid to illegals",
    "description": "United States Attorney General Pam Bondi is moving to block a recent, controversial Illinois law extending student financial aid to illegal immigrants.",
    "link": "https://www.foxnews.com/politics/doj-moves-block-blue-state-from-giving-financial-aid-illegals",
    "timestamp": "2025-09-02T23:40:44Z"
  },
  {
    "title": "[Podcast] What Smart Brands Do Differently with David Aaker",
    "description": "Branding legend David Aaker returns to JUST Branding to unpack what separates truly strategic brands from the sea of sameness in 2025.",
    "link": "https://justcreative.com/what-smart-brands-do-differently-with-david-aaker/",
    "timestamp": "2025-09-02T23:39:38Z"
  },
  {
    "title": "Trump sends big message to drug dealers, says US strikes vessel in Caribbean targeting Venezuela’s Tren de Aragua gang; video shows vessel exploding in flames",
    "description": "President Trump announced a US strike on a Venezuelan drug vessel, linked to the Tren de Aragua gang, that was targeted in international waters. Eleven people died in the operation, according to Trump. This comes after the US military increased its presence n…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-sends-big-message-to-drug-dealers-says-us-strikes-vessel-in-caribbean-targeting-venezuelas-tren-de-aragua-gang-video-shows-vessel-exploding-in-flames/articleshow/123666818.cms",
    "timestamp": "2025-09-02T23:36:48Z"
  },
  {
    "title": "U.S. military kills 11 in strike on alleged drug boat leaving Venezuela, Trump says",
    "description": "U.S. President Donald Trump said Tuesday the U.S. has carried out a military strike in the southern Caribbean against what he said was a drug-carrying vessel operated by the Tren de Aragua gang that departed from Venezuela.",
    "link": "https://www.cbc.ca/news/world/trump-venezuela-us-military-strike-on-boat-1.7623576",
    "timestamp": "2025-09-02T23:36:33Z"
  },
  {
    "title": "Mayor Muriel Bowser Directs D.C. Police to Coordinate with Federal Law Enforcement Indefinitely",
    "description": "Washington, DC, Mayor Muriel Bowser (D) issued an executive order Tuesday directing the Metropolitan Police Department (MPD) to work and cooperate with federal law enforcement officials indefinitely.\nThe post Mayor Muriel Bowser Directs D.C. Police to Coordin…",
    "link": "https://www.breitbart.com/politics/2025/09/02/mayor-muriel-bowser-directs-d-c-police-to-coordinate-with-federal-law-enforcement-indefinitely/",
    "timestamp": "2025-09-02T23:35:50Z"
  },
  {
    "title": "Trump addresses health rumours after days without public events",
    "description": "\"How did you find out over the weekend that you were dead? Did you see that?\" a reporter asked Trump.",
    "link": "https://www.1news.co.nz/2025/09/03/trump-addresses-health-rumours-after-days-without-public-events/",
    "timestamp": "2025-09-02T23:35:02Z"
  },
  {
    "title": "Here's what we know about alleged uprising at 'Alligator Alcatraz'",
    "description": "Detainees reportedly called a TV station claiming that guards beat detainees and released tear gas while a fire alarm blared and a helicopter circled.",
    "link": "https://www.snopes.com//news/2025/09/02/alleged-uprising-alligator-alcatraz/",
    "timestamp": "2025-09-02T23:35:00Z"
  },
  {
    "title": "Petrobras CEO Trump Tariffs, Oil Prices, Supply Chain",
    "description": "Petrobras Chief Executive Officer Magda Chambriard talks about the impact of President Donald Trump's tariffs on oil prices and ...",
    "link": "https://biztoc.com/x/29bf2e6469d684cf",
    "timestamp": "2025-09-02T23:32:24Z"
  },
  {
    "title": "Gerrymandering Expert Tells Dan Abrams Republicans Currently Have a ‘Four-Seat Advantage’ Against Democrats, Despite Claims of Unfair Districts",
    "description": "Professor Samuel Wang claimed Republicans currently held a \"four seat advantage\" from gerrymandering and redistricting against Democrats.\nThe post Gerrymandering Expert Tells Dan Abrams Republicans Currently Have a ‘Four-Seat Advantage’ Against Democrats, Des…",
    "link": "https://www.mediaite.com/politics/gerrymandering-expert-tells-dan-abrams-republicans-currently-have-a-four-seat-advantage-against-democrats-despite-claims-of-unfair-districts/",
    "timestamp": "2025-09-02T23:31:10Z"
  },
  {
    "title": "Hope to finalise US trade pact by November, says Piyush Goyal",
    "description": "Piyush Goyal anticipates concluding a trade agreement with the US by November. Trade talks with the European Union are progressing well. Relations with China are improving as border tensions decrease. India has already finalized trade agreements with Mauritiu…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/hope-to-finalise-us-trade-pact-by-november-says-piyush-goyal/articleshow/123663871.cms",
    "timestamp": "2025-09-02T23:30:00Z"
  },
  {
    "title": "Trump canceling elections? Democrats increasingly sound alarm bells (real MSM article)",
    "description": "When President Donald Trump sat down with Ukrainian President Volodymyr Zelensky last month, the topic was the weighty issue of ending Russia’s invasion of Ukraine. But at one point, Trump took a provocative diversion into domestic politics. Zelensky noted th…",
    "link": "https://freerepublic.com/focus/f-news/4338283/posts",
    "timestamp": "2025-09-02T23:26:50Z"
  },
  {
    "title": "Saturday Night Live Season 51 New & Returning Cast Guide",
    "description": "New faces are joining NBC's  iconic sketch comedy show, promising a fresh era for Saturday Night Live after an iconic and record-breaking 50th season.",
    "link": "https://screenrant.com/saturday-night-live-season-51-new-cast-lorne-michaels-shake-up-promise/",
    "timestamp": "2025-09-02T23:25:18Z"
  },
  {
    "title": "How to Watch ‘The Chrisleys: Back to Reality’ Online Without Cable",
    "description": "Recently dropped on Lifetime, the Chrisley family is back with an all-new reality series. Find out how to stream it online with DirecTV, Philo & Sling",
    "link": "http://www.rollingstone.com/product-recommendations/streaming/watch-the-chrisleys-back-to-reality-without-cable-online-for-free-1235420147/",
    "timestamp": "2025-09-02T23:24:33Z"
  },
  {
    "title": "Nearly 600 economists back Fed governor Cook as Trump attempts ouster",
    "description": "Signatories include Nobel laureates and former US government officials. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/nearly-600-economists-back-fed-governor-cook-as-trump-attempts-ouster",
    "timestamp": "2025-09-02T23:24:16Z"
  },
  {
    "title": "Russia expects ongoing Ukraine talks, tied to territorial changes, Lavrov says",
    "description": "(Reuters) -Moscow expects talks between Russia and Ukraine to continue but \"new territorial realities\" must be recognised and new systems of security guarantees formed, Russian Foreign Minister Sergei Lavrov said in remarks published on Wednesday. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/09/03/russia-expects-ongoing-ukraine-talks-tied-to-territorial-changes-lavrov-says",
    "timestamp": "2025-09-02T23:24:00Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.09.02 Part2 WEB H264-onX",
    "description": "Season , Episode – \"\"You're Full Of S***!\" Donald Trump RETURNS After 'Fake News' Health Claims\"Donald Trump has laughed off bizarre social media rumours claiming he had died over the weekend, telling reporters: “I didn’t hear that.” At an Oval Office press c…",
    "link": "https://post.rlsbb.ru/piers-morgan-uncensored-2025-09-02-part2-web-h264-onx/",
    "timestamp": "2025-09-02T23:21:55Z"
  },
  {
    "title": "US House Committee Releases Batch Of 'Epstein Files'",
    "description": "A US House of Representatives committee released a first batch of documents on Tuesday from the investigation into notorious sex offender Jeffrey Epstein.",
    "link": "https://www.ibtimes.com/us-house-committee-releases-batch-epstein-files-3782289",
    "timestamp": "2025-09-02T23:21:22Z"
  },
  {
    "title": "Ousted Democratic FTC commissioner can return (again) for now",
    "description": "Rebecca Kelly Slaughter, the Democratic Federal Trade Commissioner fired by President Donald Trump without cause, can at least temporarily return to work while her legal case plays out. This happened once before when Slaughter briefly returned to her office m…",
    "link": "https://www.theverge.com/news/769683/fired-democratic-ftc-commissioner-rebecca-slaughter-reinstated",
    "timestamp": "2025-09-02T23:19:51Z"
  },
  {
    "title": "What To Know About Trump’s ‘Liberation Day’ Tariffs After Appeals Setback",
    "description": "A federal appeals court has struck down President Donald Trump’s sweeping tariffs, but the president still has several hands it can play.",
    "link": "https://dailycaller.com/2025/09/02/what-to-know-about-trumps-liberation-day-tariffs-after-appeals-setback/",
    "timestamp": "2025-09-02T23:18:18Z"
  },
  {
    "title": "Trump says 11 killed in US strike on drug-carrying vessel from Venezuela",
    "description": "The Trump administration has signalled a willingness to use military force against drug cartels.",
    "link": "https://www.bbc.com/news/articles/cpwywjgynyxo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-02T23:17:55Z"
  },
  {
    "title": "Trump Posts Footage of US Missile Strike on Boat Leaving Venezuela",
    "description": "President Donald Trump said that 11 people were killed in the rare U.S. military operation in the Americas.",
    "link": "https://biztoc.com/x/5b110e063ecdbdcb",
    "timestamp": "2025-09-02T23:17:20Z"
  },
  {
    "title": "Trump Is Moving the Least Important Branch of the Military to the Perfect Place",
    "description": "It’s one of the rare times I don’t object to the president’s decision",
    "link": "https://www.esquire.com/news-politics/politics/a65963192/space-force-huntsville-alabama/",
    "timestamp": "2025-09-02T23:17:00Z"
  },
  {
    "title": "Trump addresses health rumors after days without public events",
    "description": "The 79-year-old president has been seen with bruising on his hand and swelling around his ankles.",
    "link": "https://www.wilx.com/2025/09/02/trump-addresses-health-rumors-after-days-without-public-events/",
    "timestamp": "2025-09-02T23:15:37Z"
  },
  {
    "title": "'We're going in': President Trump vows National Guard deployments as judge rules against him",
    "description": "A federal judge has ruled that President Donald Trump violated the law by deploying National Guard troops to Los Angeles during immigration protests, sparking a defense from the White House.",
    "link": "https://www.wbaltv.com/article/trump-vows-national-guard-deployments-as-judge-rules-against-him/65961891",
    "timestamp": "2025-09-02T23:14:28Z"
  },
  {
    "title": "House Committee Releases First Set Of Subpoenaed Epstein Files",
    "description": "It is not yet clear what share of the files released Tuesday contained previously unknown information.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/09/02/house-committee-releases-first-set-of-subpoenaed-epstein-files/",
    "timestamp": "2025-09-02T23:14:23Z"
  },
  {
    "title": "Senator Tuberville Predicts ‘The Next War’ Will Be ‘Started and Probably Ended From Space’",
    "description": "Sen. Tommy Tuberville predicted that \"the next war\" the U.S. is involved in will both start and end in or from space.\nThe post Senator Tuberville Predicts ‘The Next War’ Will Be ‘Started and Probably Ended From Space’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/senator-tuberville-predicts-the-next-war-will-be-started-and-probably-ended-from-space/",
    "timestamp": "2025-09-02T23:13:51Z"
  },
  {
    "title": "Trump Posts Footage of US Missile Strike on Boat Leaving Venezuela",
    "description": "President Donald Trump said that 11 people were killed in the rare U.S. military operation in the Americas.",
    "link": "https://www.newsweek.com/watch-trump-posts-footage-military-strike-venezuela-cartel-boat-2123508",
    "timestamp": "2025-09-02T23:12:09Z"
  },
  {
    "title": "'This Is Literally Biden 2': Trump Can't Shake Health Questions",
    "description": "Don’t believe the internet. Donald Trump is alive. But questions about his health aren't going away.",
    "link": "https://time.com/7314050/trump-health-speech-takeaways/",
    "timestamp": "2025-09-02T23:11:13Z"
  },
  {
    "title": "SICK: Tim Walz Publicly Roots for Trump’s Death in Shocking Video",
    "description": "Over the past several days, wild rumors about President Trump’s supposed demise swept across social media, with leftist commentators openly salivating at the thought. The frenzy had a simple spark: Trump hadn’t appeared in public for a few days, and that abse…",
    "link": "https://freerepublic.com/focus/f-news/4338278/posts",
    "timestamp": "2025-09-02T23:10:10Z"
  },
  {
    "title": "Jeffrey Epstein accusers urge Trump to release all the case files and rule out a Ghislaine Maxwell pardon",
    "description": "WASHINGTON — Six women who say they were sex trafficked by Jeffrey Epstein or convicted co-conspirator Ghislaine Maxwell shared a unified message Tuesday while imploring the federal government to release more documents related to the case and urging President…",
    "link": "https://www.nbcnews.com/politics/politics-news/jeffrey-epstein-ghislaine-maxwell-accusers-rcna227334",
    "timestamp": "2025-09-02T23:10:04Z"
  },
  {
    "title": "India grew 7.8 pc in Q1 despite challenges driven by economic self-interest: PM Modi",
    "description": "NEW DELHI, Sept 2: In a veiled rebuttal to the ‘dead economy’ jibe, Prime Minister Narendra Modi on Tuesday said the Indian economy grew 7.8 per cent in the first quarter, surpassing all expectations despite global uncertainties and challenges driven by econo…",
    "link": "https://thehillstimes.in/national/india-grew-7-8-pc-in-q1-despite-challenges-driven-by-economic-self-interest-pm-modi",
    "timestamp": "2025-09-02T23:10:00Z"
  },
  {
    "title": "The Trump Administration Gets a Serious Scolding",
    "description": "A federal judge’s scathing opinion explains why Trump’s deployment of troops to California was more than just an overreach.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/09/trump-national-guard-law-california/684084/",
    "timestamp": "2025-09-02T23:10:00Z"
  },
  {
    "title": "Donald Trump breaks silence over health rumours",
    "description": "Speculation about the 79-year-old’s condition has been rife in recent weeks.",
    "link": "https://7news.com.au/news/trump-says-ill-health-rumours-are-fake-c-19892524",
    "timestamp": "2025-09-02T23:08:28Z"
  },
  {
    "title": "Appeals Court: Zeldin, Trump Can Stop $16 Billion 'Gold Bars' to Climate Group",
    "description": "A federal appeals court ruled 2-1 on Tuesday that EPA Administrator Lee Zeldin could, in fact, withhold $16 billion in so-called “gold bars” sent from the outgoing Biden administration to favored left-wing “green” organizations.\nThe post Appeals Court: Zeldin…",
    "link": "https://www.breitbart.com/politics/2025/09/02/appeals-court-zeldin-trump-can-stop-16-billion-gold-bars-to-climate-group/",
    "timestamp": "2025-09-02T23:06:32Z"
  },
  {
    "title": "Market jitters send stocks lower ahead of jobs data",
    "description": "The stock market has enjoyed a rip-roaring run since President Donald Trump paused most reciprocal tariffs on April 9. The S&P 500 gained 30% from its low on April 8th through last week's high, while the tech-heavy Nasdaq Composite returned 42%.\nThe rally sur…",
    "link": "https://biztoc.com/x/f4c5cb8e181c2e4a",
    "timestamp": "2025-09-02T23:06:27Z"
  },
  {
    "title": "Trump addresses health rumors after days without public events",
    "description": "The 79-year-old president has been seen with bruising on his hand and swelling around his ankles.",
    "link": "https://www.wsaw.com/2025/09/02/trump-addresses-health-rumors-after-days-without-public-events/",
    "timestamp": "2025-09-02T23:05:23Z"
  },
  {
    "title": "Buoyed by AIPAC dollars, Wesley Bell pushes AIPAC lies",
    "description": "Lawmaker’s anti-genocide constituents attacked by “security” at town hall.",
    "link": "https://electronicintifada.net/blogs/michael-f-brown/buoyed-aipac-dollars-wesley-bell-pushes-aipac-lies",
    "timestamp": "2025-09-02T23:02:21Z"
  },
  {
    "title": "WLFI: The Next Cult Coin? Analyst Outlines Potential For Explosive Growth",
    "description": "The recent debut of the World Liberty Financial token (WLFI) in the cryptocurrency market has generated considerable buzz, despite facing notable price retracements within just 24 hours of trading.  Despite WLFI’s 25% price retrace in the 24-hour time frame, …",
    "link": "http://www.newsbtc.com/crypto/wlfi-the-next-cult-coin-analyst-outlines-potential-for-explosive-growth/",
    "timestamp": "2025-09-02T23:00:46Z"
  },
  {
    "title": "Colorado sheriff's deputy disciplined for helping immigration agents resigns, ending lawsuit",
    "description": "A Colorado sheriff's deputy who was disciplined for helping federal immigration agents make an arrest of a college student from Brazil has resigned...",
    "link": "https://www.yahoo.com/news/articles/colorado-sheriffs-deputy-disciplined-helping-230018862.html",
    "timestamp": "2025-09-02T23:00:18Z"
  },
  {
    "title": "King Charles Doesn’t Want Prince Harry Feud to ‘Overshadow His Legacy’",
    "description": "On August 24, members of the royal family attended a church service at Crathie Kirk near Balmoral Castle in Scotland, where they are spending the final weeks of summer. Decamping to the idyllic property nestled in the Scottish Highlands has been a royal tradi…",
    "link": "https://www.usmagazine.com/celebrity-news/news/prince-harry-and-charles-meeting-could-make-or-break-family-feud-excl/#article",
    "timestamp": "2025-09-02T23:00:07Z"
  },
  {
    "title": "U.S. Military Sinks Suspected Drug Ship in Deadly Caribbean Strike",
    "description": "\"The strike resulted in 11 terrorists killed in action. No U.S. Forces were harmed in this strike.\"\nThe post U.S. Military Sinks Suspected Drug Ship in Deadly Caribbean Strike first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/u-s-military-sinks-suspected-drug-ship-in-deadly-caribbean-strike/",
    "timestamp": "2025-09-02T23:00:03Z"
  },
  {
    "title": "Pirro tears into Pritzker after deadly weekend in Chicago: 'He should be ashamed of himself'",
    "description": "Jeanine Pirro blasted Democrats for resisting Trump’s crime crackdown, pointing to Chicago’s bloody Labor Day weekend that left dozens wounded and several dead.",
    "link": "https://www.foxnews.com/media/pirro-tears-pritzker-after-deadly-weekend-chicago-he-should-ashamed-himself",
    "timestamp": "2025-09-02T22:58:25Z"
  },
  {
    "title": "'Gibberish': Treasury sec hammered after wild claim touting Trump's 'magic taxes'",
    "description": "President Donald Trump's Treasury Secretary Scott Bessent appeared to suggest in a new interview with Lara Trump on Fox News that the massive tariffs imposed by the administration, far from shrinking the economy, will actually grow it.\"Tariffs are delivering …",
    "link": "https://www.rawstory.com/scott-bessent-2673950552/",
    "timestamp": "2025-09-02T22:58:01Z"
  },
  {
    "title": "McGovern Hammers Comer Over Epstein Files Dump – ‘97% of Which Is Already Out in Public’",
    "description": "Rep. Jim McGovern (D-MA) dismissed the release of a batch of files relating to deceased sex trafficker Jeffrey Epstein, claiming that the vast bulk of the information was already public. \nThe post McGovern Hammers Comer Over Epstein Files Dump – ‘97% of Which…",
    "link": "https://www.mediaite.com/politics/mcgovern-hammers-comer-over-epstein-files-dump-97-of-which-is-already-out-in-public/",
    "timestamp": "2025-09-02T22:56:47Z"
  },
  {
    "title": "Ether fights to hold $4.3K as corporate ETH treasury growth, DApp activity provide hope",
    "description": "Ether trades slightly above $4,300 as derivatives data reflect caution, but network growth and ETH treasury growth could change the trend.",
    "link": "https://cointelegraph.com/news/ether-fights-to-hold-dollar4-3k-as-eth-treasury-growth-dapps-activity-soar",
    "timestamp": "2025-09-02T22:54:23Z"
  },
  {
    "title": "WATCH: Speedboat Said to Be Carrying Venezuelan ‘Narcoterrorists’ in Caribbean Destroyed on Trump’s Order",
    "description": "President Donald Trump announced Tuesday that the U.S. had carried out a strike against a speedboat said to be carrying narcotics in the southern Caribbean.... Read More\nThe post WATCH: Speedboat Said to Be Carrying Venezuelan ‘Narcoterrorists’ in Caribbean D…",
    "link": "https://www.dailysignal.com/2025/09/02/watch-drug-boat-struck-goes-up-flames-trumps-command/",
    "timestamp": "2025-09-02T22:53:26Z"
  },
  {
    "title": "Former CDC employees urge Trump administration to reverse course",
    "description": "Former CDC employees and Democratic state lawmakers voiced concerns over the policy shift at the CDC under the Trump administration.",
    "link": "https://www.fox5atlanta.com/news/former-cdc-employees-urge-trump-administration-reverse-course",
    "timestamp": "2025-09-02T22:52:06Z"
  },
  {
    "title": "Trump says White House window video is AI. His team indicated it's real",
    "description": "Trump says White House window video is AI. His team indicated it's realsun-sentinel.com",
    "link": "https://www.sun-sentinel.com/2025/09/02/trump-white-house-window/",
    "timestamp": "2025-09-02T22:51:19Z"
  },
  {
    "title": "House Committee Releases Thousands Of Jeffrey Epstein Files",
    "description": "The folders contained hundreds of image files of years-old court filings related to Epstein and Ghislaine Maxwell.",
    "link": "https://www.huffpost.com/entry/house-epstein-files-released_n_68b772f0e4b0dcd0a108b13e",
    "timestamp": "2025-09-02T22:51:08Z"
  },
  {
    "title": "Jim Cramer explains how to handle Tuesday's market decline",
    "description": "CNBC's Jim Cramer unpacked Tuesday's market action.",
    "link": "https://www.cnbc.com/2025/09/02/jim-cramer-explains-how-to-handle-tuesdays-market-decline.html",
    "timestamp": "2025-09-02T22:50:18Z"
  },
  {
    "title": "Trump Orders U.S. Military Strike on Drug Boat, Killing 11 Tren de Aragua Terrorists in Warning to Traffickers",
    "description": "On direct orders from President Donald Trump, U.S. military forces launched a precision strike on a drug-laden vessel in international waters, killing 11 Tren de Aragua narcoterrorists en route to the United States. Trump declared the operation a clear warnin…",
    "link": "https://www.breitbart.com/border/2025/09/02/trump-11-tren-de-aragua-terrorists-killed-in-military-strike-on-drug-trafficking-vessel/",
    "timestamp": "2025-09-02T22:48:14Z"
  },
  {
    "title": "Trump dealt another court blow as Dem official ordered reinstated: 'That we will not do'",
    "description": "A divided appeals court in Washington, D.C., dealt the Trump administration a blow in its quest to oust a Democratic Federal Trade commissioner.Rebecca Slaughter was fired by President Donald Trump in March, alongside fellow Democratic Commissioner Alvaro Bed…",
    "link": "https://www.rawstory.com/trump-ftc-2673950688/",
    "timestamp": "2025-09-02T22:47:31Z"
  },
  {
    "title": "Trump’s Response To Video Of Items Being Thrown Out White House Window Makes It Even Weirder",
    "description": "It seems the president and his staff failed to stick to the same story.",
    "link": "https://www.huffpost.com/entry/trump-responds-video-window-white-house_n_68b73919e4b0ebb9e3c885d5",
    "timestamp": "2025-09-02T22:47:29Z"
  },
  {
    "title": "Trump Has Almost Found His Color Match",
    "description": "After a year of poor attempts to cover a recurring hand welt that’s fueled rumors about his health, the president is inching toward making his hand look normal.",
    "link": "http://www.thecut.com/article/donald-trump-bruises-cover-up.html",
    "timestamp": "2025-09-02T22:46:30Z"
  },
  {
    "title": "DC Mayor Orders Local Cooperation With Federal Crime Crackdown",
    "description": "DC Mayor Muriel Bowser issued an order continuing Trump's executive order of federal officers, which local law enforcement will cooperate with.",
    "link": "https://dailycaller.com/2025/09/02/dc-mayor-orders-local-cooperation-federal-crime-crackdown/",
    "timestamp": "2025-09-02T22:46:24Z"
  },
  {
    "title": "Trump says video showing items thrown from White House is AI after his team indicates it’s real",
    "description": "His press team seemed to confirm the veracity of the video hours earlier.",
    "link": "https://www.bostonherald.com/2025/09/02/trump-white-house-window/",
    "timestamp": "2025-09-02T22:46:19Z"
  },
  {
    "title": "White House pushes back on speculation over Trump’s health",
    "description": "President Donald Trump is back in public Tuesday to announce a new location for US Space Command headquarters — and prove that rumors of his demise have been greatly exaggerated.",
    "link": "https://www.kezi.com/news/national/white-house-pushes-back-on-speculation-over-trump-s-health/article_65499727-16d9-52a2-8d9f-0af4ac2fa5fb.html",
    "timestamp": "2025-09-02T22:46:12Z"
  },
  {
    "title": "8 killed and 50 wounded in Chicago over long weekend as Trump plans federal deployment",
    "description": "Eight people were killed and 50 others were wounded over the Labor Day weekend in dozens of shootings in Chicago",
    "link": "https://abcnews.go.com/Politics/wireStory/8-killed-50-wounded-chicago-long-weekend-trump-125189394",
    "timestamp": "2025-09-02T22:46:02Z"
  },
  {
    "title": "DeSantis Teases New Immigration Facility as Alligator Alcatraz Winds Down",
    "description": "The Trump administration was handed a legal blow after a judge ruled that Alligator Alcatraz could not accept any new detainees and banned any site expansion.",
    "link": "https://www.newsweek.com/desantis-teases-new-immigration-facility-alligator-alcatraz-winds-down-2123495",
    "timestamp": "2025-09-02T22:44:55Z"
  },
  {
    "title": "Trump Immigration Crackdown Hits Beer Sales, Modelo and Corona Beer Maker Constellation Brands Predicts",
    "description": "The maker of Modelo—America’s top-selling beer—claims that fewer dollars from Hispanic consumers have slashed beer sales amid immigration raids, compounded by the expense of President Donald Trump’s tariff hikes.\nConstellation Brands, which also distributes C…",
    "link": "https://biztoc.com/x/d207a507e3a7612b",
    "timestamp": "2025-09-02T22:43:59Z"
  }
]