[
  {
    "title": "Mark Carney has answered some questions — but many more remain",
    "description": "It would be a true surprise now if Carney somehow did not become the 14th leader in the history of the Liberal Party of Canada on March 9. But even if Carney is on the verge of winning the first political contest he ever entered, he is still an inexperienced …",
    "link": "https://www.cbc.ca/news/politics/liberal-leadership-debate-carney-gould-analysis-1.7469306",
    "timestamp": "2025-02-26T21:38:35Z"
  },
  {
    "title": "Musk’s USAID Cuts May Hand China The AI Race",
    "description": "How do you win the global AI race? If you asked Elon Musk or his supporters in the Trump administration, they’d probably talk about deregulation, or getting government out of the way, or maybe something about GPU clusters and massive power consumption. What t…",
    "link": "https://www.techdirt.com/2025/02/26/musks-usaid-cuts-may-hand-china-the-ai-race/",
    "timestamp": "2025-02-26T21:37:04Z"
  },
  {
    "title": "Republican Congresswoman Slams Trump’s Immigration Policy",
    "description": "Donald Trump’s move to end deportation protections of Venezuelan immigrants has upset one Republican member of Congress.\r\nRepresentative María Elvira Salazar told CNN Wednesday that her message to the White House was that “we have to make a differentiation be…",
    "link": "https://newrepublic.com/post/192039/republican-congresswoman-salazar-trump-immigration-tps-venezuela",
    "timestamp": "2025-02-26T21:36:47Z"
  },
  {
    "title": "EPA head urges Trump to reconsider scientific finding that underpins climate action, AP sources say",
    "description": "The 2009 finding is the legal underpinning of a host of climate regulations.",
    "link": "https://www.bostonherald.com/2025/02/26/trump-epa-climate/",
    "timestamp": "2025-02-26T21:35:50Z"
  },
  {
    "title": "This Woman, Who Is Not Elon Musk, Is Definitely, 100-Percent, For-Sure Running DOGE—Hand to God!",
    "description": "Amy Gleason has been named as the acting administrator of DOGE, adding to the confusion and uproar around the controversial cost-cutting department.",
    "link": "https://www.vanityfair.com/style/story/elon-musk-amy-gleason-marjorie-taylor-greene-running-doge",
    "timestamp": "2025-02-26T21:35:13Z"
  },
  {
    "title": "Commentary: Zelensky and Ukraine strike a crafty minerals deal with Trump",
    "description": "Donald Trump likes deals. Ukrainian President Volodmyr Zelensky seems poised to give him one that could be a lifeline for his embattled country as it fights a Russian invasion now in its fourth year.\nPresident Trump has been far more hostile toward Ukraine du…",
    "link": "https://biztoc.com/x/f03a6591c40c7ebe",
    "timestamp": "2025-02-26T21:35:03Z"
  },
  {
    "title": "Trump threatens new EU tariffs, outlines possible April 2 date for new Mexico, Canada levies",
    "description": "President Donald Trump threatened new tariffs on the European Union on Wednesday, disparaging the bloc and widening his trade conflict across the Atlantic.\n\"We have made a decision,\" Trump said during a cabinet meeting Wednesday afternoon. \"We'll be announcin…",
    "link": "https://biztoc.com/x/5bb6b90b837a361a",
    "timestamp": "2025-02-26T21:34:53Z"
  },
  {
    "title": "Trump cuts financial lifeline for Venezuela's government by ending permit to export oil to US",
    "description": "A permit issued by the United States government allowing energy giant Chevron Corp. to pump and export Venezuelan oil will be terminated this week, President Donald Trump announced Wednesday, ending what became a financial lifeline for the South American coun…",
    "link": "https://biztoc.com/x/5e3d936467122eb4",
    "timestamp": "2025-02-26T21:34:51Z"
  },
  {
    "title": "Trump announces Zelenskyy visit to sign deal on Ukraine’s minerals",
    "description": "President Donald Trump said that Ukrainian leader Volodymyr Zelenskyy will visit the White House on Friday.",
    "link": "https://biztoc.com/x/758ce4dfb87afb76",
    "timestamp": "2025-02-26T21:34:35Z"
  },
  {
    "title": "Apple says it’s fixing a speech-to-text bug that briefly replaces ‘racist’ with ‘Trump’",
    "description": "Apple said it is working on fixing a bug in its dictation feature after a viral TikTok post showed an iPhone suggest the word “Trump” when its user said the word “racist.”",
    "link": "https://www.msnbc.com/top-stories/latest/trump-racist-dictation-apple-glitch-iphone-rcna193869",
    "timestamp": "2025-02-26T21:34:33Z"
  },
  {
    "title": "Trump cuts financial lifeline for Venezuela's government by ending permit to export oil to US",
    "description": "A permit issued by the United States government allowing energy giant Chevron Corp. to pump and export Venezuelan oil will be terminated this week",
    "link": "https://abcnews.go.com/International/wireStory/trump-cuts-financial-lifeline-venezuelas-government-ending-permit-119227801",
    "timestamp": "2025-02-26T21:34:26Z"
  },
  {
    "title": "DOGE in the Dumps: Dogecoin Sheds Most of Its Post-Election Gains",
    "description": "Dogecoin surged in value following Donald Trump's November election win, but most of those gains have evaporated in recent weeks.",
    "link": "https://decrypt.co/307916/dogecoin-sheds-post-election-gains",
    "timestamp": "2025-02-26T21:33:54Z"
  },
  {
    "title": "'Trump Gaza' video shared by president originated from pro-Israel accounts that have embraced AI",
    "description": "President Donald Trump posted a bizarre AI-generated video to social media Monday evening depicting an imagined future version of Gaza with bearded belly dancers on the beach, a giant golden statue of Trump, money raining from the sky, Elon Musk eating pita a…",
    "link": "https://www.nbcnews.com/tech/internet/trump-gaza-video-shared-president-originated-israel-accounts-embraced-rcna193891",
    "timestamp": "2025-02-26T21:31:49Z"
  },
  {
    "title": "Zelensky to meet Trump in Washington to sign minerals deal",
    "description": "President Trump says the pair are poised to sign a \"very big agreement\", which Zelensky described as a \"framework\".",
    "link": "https://www.bbc.com/news/articles/cn7vg0nvzkko",
    "timestamp": "2025-02-26T21:30:20Z"
  },
  {
    "title": "Why the Trump Administration May Want Ukraine’s Minerals",
    "description": "The U.S. will have access to Ukraine's mineral wealth under a deal the two countries are expected to sign later this week.",
    "link": "https://time.com/7262115/trump-ukraine-minerals/",
    "timestamp": "2025-02-26T21:29:40Z"
  },
  {
    "title": "Trump administration rescinds move that would gut veteran health care after outcry: report",
    "description": "President Donald Trump's administration rescinded a move that could have hobbled much of the current veteran health care system, following widespread backlash and outcry, The Washington Post reported Wednesday.\"Veterans Affairs was prepared to terminate 875 c…",
    "link": "https://www.rawstory.com/trump-veterans/",
    "timestamp": "2025-02-26T21:29:12Z"
  },
  {
    "title": "Trump Revives Alien Registration Law for Illegal Migrants",
    "description": "Trump is reviving a 1940 criminal law that requires migrants to register their names and fingerprints with federal agencies.\nThe post Trump Revives Alien Registration Law for Illegal Migrants appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/02/26/trump-revives-alien-registration-law-for-illegal-migrants/",
    "timestamp": "2025-02-26T21:28:34Z"
  },
  {
    "title": "Gavin Newsom Takes Steps to Override DA, Release Erik & Lyle Menendez From Prison",
    "description": "Reading Time: 3 minutesGovernor Gavin Newsom has taken steps toward freeing the Menendez brothers.\nGavin Newsom Takes Steps to Override DA, Release Erik & Lyle Menendez From Prison was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/02/gavin-newsom-takes-steps-to-override-da-release-erik-lyle-menendez-from-prison/",
    "timestamp": "2025-02-26T21:28:26Z"
  },
  {
    "title": "Trump announces Zelenskyy visit to sign deal on Ukraine’s minerals",
    "description": "President Donald Trump said that Ukrainian leader Volodymyr Zelenskyy will visit the White House on Friday.",
    "link": "https://www.pbs.org/newshour/politics/trump-announces-zelenskyy-visit-to-sign-deal-on-ukraines-minerals",
    "timestamp": "2025-02-26T21:25:25Z"
  },
  {
    "title": "A $300 Million Lawsuit Is Threatening a Storied Activist Group. You Should Be Worried.",
    "description": "The First Amendment rights of all Americans are at stake.",
    "link": "https://slate.com/technology/2025/02/greenpeace-energy-transfer-partners-lawsuit-north-dakota-access-pipeline.html",
    "timestamp": "2025-02-26T21:24:25Z"
  },
  {
    "title": "Trump-Backed Budget Blueprint Hits a Snag With Senate Republicans",
    "description": "President Donald Trump and House Republicans gained a hard-fought victory late Tuesday when a budget blueprint was narrowly passed in the lower chamber, bringing the party one step closer to delivering on a sweeping agenda.\nBut the victory could be short-live…",
    "link": "https://biztoc.com/x/d4157277e7768618",
    "timestamp": "2025-02-26T21:23:34Z"
  },
  {
    "title": "Eli Lilly Announces Plan To Invest $27 Billion In America Amid Trump Tariff Threats",
    "description": "Eli Lilly announced that it plans to increase its manufacturing investment this year as President Trump threatens to place tariffs on pharmaceutical imports.",
    "link": "https://dailycaller.com/2025/02/26/drug-company-eli-lilly-american-investment-trump-tariffs/",
    "timestamp": "2025-02-26T21:23:20Z"
  },
  {
    "title": "He's laid the groundwork, but can Starmer seal the deal with President Trump?",
    "description": "I've been on quite a few trips now to the White House with successive prime ministers, but I can't remember one that mattered as much as this.",
    "link": "https://news.sky.com/story/hes-laid-the-groundwork-but-can-starmer-seal-the-deal-with-president-trump-13317712",
    "timestamp": "2025-02-26T21:23:00Z"
  },
  {
    "title": "HART: DOGE Doesn’t ‘Put Democracy At Risk,’ DOGE IS Democracy",
    "description": "The office of the president of the United States is the only nationally elected office and, as such, is cloaked in immense powers.",
    "link": "https://dailycaller.com/2025/02/26/hart-doge-democracy-risk-elon-musk-donald-trump/",
    "timestamp": "2025-02-26T21:22:53Z"
  },
  {
    "title": "Supreme Court Signals Backing for Straight Woman’s Bias Suit",
    "description": "The US Supreme Court signaled it will revive a job-bias lawsuit by a straight woman and make it easier in some parts of the country for members of so-called “majority groups” to get to a jury with discrimination claims. Hearing …",
    "link": "https://www.insurancejournal.com/news/national/2025/02/26/813531.htm",
    "timestamp": "2025-02-26T21:22:45Z"
  },
  {
    "title": "Eli Lilly plans $27bn in new plants as Trump threatens pharma tariffs",
    "description": "The new plants will be built in the US over the next five years and create 3,000 jobs for skilled workers.",
    "link": "https://www.aljazeera.com/economy/2025/2/26/eli-lilly-plans-27bn-in-new-plants-as-trump-threatens-pharma-tariffs",
    "timestamp": "2025-02-26T21:22:32Z"
  },
  {
    "title": "Republican Senators say House Budget won't fly with them",
    "description": "Tuesday’s big win for Speaker Mike Johnson might not last long.House Republicans spent weeks in painstaking negotiations before delivering a budget blueprint for “one big, beautiful bill.” Now Senate Republicans are preparing to tear it apart. Despite a razor…",
    "link": "https://freerepublic.com/focus/f-chat/4300721/posts",
    "timestamp": "2025-02-26T21:22:07Z"
  },
  {
    "title": "Trump Terminates Biden-era Oil Deal With Venezuela For Not Transporting Deportees ‘At Rapid Pace’",
    "description": "President Donald Trump announced that the U.S. is terminating concessions given to Venezuela for a Biden-era oil agreement.\nThe post Trump Terminates Biden-era Oil Deal With Venezuela For Not Transporting Deportees ‘At Rapid Pace’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/trump/trump-terminates-biden-era-oil-deal-with-venezuela-for-not-transporting-deportees-at-rapid-pace/",
    "timestamp": "2025-02-26T21:21:29Z"
  },
  {
    "title": "Melania vs. Ivanka: The full story of their White House feud and the first lady’s cutting nickname for her stepdaughter",
    "description": "Melania Trump and Ivanka Trump have had a long history of rivalry since Trump administration's first term. This battle intensified due to power struggles within the White House and their roles. Even after Ivanka distanced herself from politics, tensions persi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/melania-vs-ivanka-the-full-story-of-their-white-house-feud-and-the-first-ladys-cutting-nickname-for-her-stepdaughter/articleshow/118587021.cms",
    "timestamp": "2025-02-26T21:21:16Z"
  },
  {
    "title": "Trump Can Ignore Court Rulings In Extreme Cases, DOJ Nominees Tell Senate",
    "description": "Trump’s former personal attorney suggested public officials should “generally” follow court orders except in “extreme cases.”",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/26/trump-can-ignore-court-rulings-in-extreme-cases-doj-nominees-tell-senate/",
    "timestamp": "2025-02-26T21:21:02Z"
  },
  {
    "title": "WTF Is This Trump Gaza AI Video?!",
    "description": "Is this the stupidest day of the administration so far?",
    "link": "https://www.wonkette.com/p/wtf-is-this-trump-gaza-ai-video",
    "timestamp": "2025-02-26T21:20:05Z"
  },
  {
    "title": "Government Memo Outlines How Agencies Should Streamline Federal Workforce",
    "description": "Federal government agencies should focus on the “maximum elimination” of functions that are not statutorily mandated, while enabling high-quality, efficient delivery of those are that statutorily mandated, according to a memorandum issued Wednesday (Feb. 26) …",
    "link": "https://www.pymnts.com/politics/2025/government-memo-outlines-how-agencies-should-streamline-federal-workforce/",
    "timestamp": "2025-02-26T21:19:31Z"
  },
  {
    "title": "Musk and his 'humble tech support' effort get star turn at Trump's Cabinet meeting",
    "description": "Elon Musk has taken a star turn at the first Cabinet meeting of President Donald Trump’s new term",
    "link": "https://abcnews.go.com/US/wireStory/musk-humble-tech-support-effort-star-turn-trumps-119227261",
    "timestamp": "2025-02-26T21:18:25Z"
  },
  {
    "title": "US to ‘get back’ money spent on aid to Kiev – Trump",
    "description": "Washington and Kiev will sign a deal on sharing profits from Ukraine’s mineral resources on Friday, US President Donald Trump has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613364-us-get-back-money-ukraine/",
    "timestamp": "2025-02-26T21:17:35Z"
  },
  {
    "title": "From COVID-19 to financial crises, here's how major global events impact the strength of the US dollar",
    "description": "The mighty dollar is flexing its muscle in 2025. It’s trading for more yen, yuan, and pounds than in the past two years. Its value compared to foreign currencies may seem esoteric, but it matters to consumers’ wallets right now. A strong dollar touches everyt…",
    "link": "https://www.oanda.com/us-en/trade-tap-blog/analysis/fundamental/how-major-global-events-impact--strength-of-us-dollar/",
    "timestamp": "2025-02-26T21:16:42Z"
  },
  {
    "title": "From danger to nothing: NASA just downgraded the threatening Y24 asteroid to zero; here’s why",
    "description": "NASA initially estimated a 3% chance of asteroid 2024 YR4 striking Earth in 2032. Recent observations have significantly reduced the threat to almost zero. The asteroid was once considered a potential danger, large enough to cause significant damage if it hit…",
    "link": "https://economictimes.indiatimes.com/news/international/us/from-danger-to-nothing-nasa-just-downgraded-the-threatening-y24-asteroid-to-zero-heres-why/articleshow/118587089.cms",
    "timestamp": "2025-02-26T21:16:31Z"
  },
  {
    "title": "Canada, EU working on diversifying trade in face of U.S. threats",
    "description": "Canadian companies and diplomats are working with their EU colleagues to find ways to diversify trade as the U.S. threatens tariffs. Read on",
    "link": "https://financialpost.com/news/economy/canada-eu-diversifying-trade-us-threats",
    "timestamp": "2025-02-26T21:16:16Z"
  },
  {
    "title": "Donald Trump Shares AI Generated Video of Gaza Vision",
    "description": "Nothing like giving the Christian progressives fuel. Apparently it was on Truth Social, but I could not find it",
    "link": "https://freerepublic.com/focus/f-chat/4300719/posts",
    "timestamp": "2025-02-26T21:16:04Z"
  },
  {
    "title": "Another woke ‘Labor’ government is heading to its doom",
    "description": "Australian Prime Minister Anthony Albanese has spent his entire term pandering to the global elites and is about to reap what he sowed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612121-labor-woke-government-australia/",
    "timestamp": "2025-02-26T21:15:06Z"
  },
  {
    "title": "Soccer coach Jesse Marsch tells Trump to 'lay off ridiculous rhetoric' of Canada as 51st state",
    "description": "Canada soccer coach Jesse Marsch waded into politics Wednesday, telling United States President Donald Trump to \"lay off the ridiculous rhetoric about Canada being a 51st state.\"",
    "link": "https://www.cbc.ca/sports/soccer/jesse-marsch-canada-us-rhetoric-1.7469370",
    "timestamp": "2025-02-26T21:14:53Z"
  },
  {
    "title": "Bitcoin drops below $84k as markets react to tariffs",
    "description": "Bitcoin price fell to lows of $82,131, dipping to levels seen in November 2024. The BTC sell-off happens after Trump’s latest tariffs announcement, including a 25% tarriffs on the EU. Equities also dumped, with the S&P 500 seeing $500 billion wiped off. The p…",
    "link": "https://coinjournal.net/news/bitcoin-drops-below-84k-as-markets-react-to-tariffs/",
    "timestamp": "2025-02-26T21:14:19Z"
  },
  {
    "title": "Judges may be days away from jailing people in showdown with Trump administration: analyst",
    "description": "One political analyst thinks judges are close to jailing people for contempt in the ongoing court battles over government funding cuts. U.S. District Court Judge Amir H. Ali ruled on Wednesday that he would not pause his order giving President Donald Trump's …",
    "link": "https://www.rawstory.com/doge-court/",
    "timestamp": "2025-02-26T21:13:51Z"
  },
  {
    "title": "Fact check: Trump makes numerous false claims at Cabinet meeting - CNN",
    "description": "Fact check: Trump makes numerous false claims at Cabinet meetingCNN Key takeaways from Donald Trump’s first cabinet meeting with Elon MuskAl Jazeera English Trump Administration Live Updates: Musk Shares Stage With Trump at First Cabinet MeetingThe New York T…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176553277",
    "timestamp": "2025-02-26T21:13:33Z"
  },
  {
    "title": "Giving the opening prayer at President Trump’s first cabinet meeting was the honor of a lifetime.",
    "description": "Giving the opening prayer at President Trump’s first cabinet meeting was the honor of a lifetime. Thank you, @POTUS , for trusting me to lead @HUDgov and for giving me the opportunity to lift up Americans across the country.",
    "link": "https://freerepublic.com/focus/f-bloggers/4300718/posts",
    "timestamp": "2025-02-26T21:13:14Z"
  },
  {
    "title": "US lawmakers seek compromise on government funding bills",
    "description": "U.S. President Donald Trump addressed concerns Wednesday that legislation funding the federal government past a March 14 deadline would include controversial cuts to social safety net programs such as Medicaid and Social Security. \n\n\n\"We're not going to touch…",
    "link": "https://www.voanews.com/a/us-lawmakers-seek-compromise-on-government-funding-bills/7989287.html",
    "timestamp": "2025-02-26T21:12:55Z"
  },
  {
    "title": "US closes mixed with Nvidia, Trump in the limelight",
    "description": "US stock markets wrapped up Wednesday's trading session with mixed results as investors assessed the implications of President Donald Trump's trade strategies, which stirred concerns among market part...",
    "link": "https://biztoc.com/x/8ca1229461eb554e",
    "timestamp": "2025-02-26T21:12:22Z"
  },
  {
    "title": "Jasmine Crockett All But Dares House Colleagues to Say Russia Invaded Ukraine in Heated House Hearing",
    "description": "Jasmine Crockett challenged her colleagues to plainly state that Russia invaded Ukraine in light of Donald Trump's recent stance on the European conflict.\nThe post Jasmine Crockett All But Dares House Colleagues to Say Russia Invaded Ukraine in Heated House H…",
    "link": "https://www.mediaite.com/news/jasmine-crockett-all-but-dares-house-colleagues-to-say-russia-invaded-ukraine-in-heated-house-hearing/",
    "timestamp": "2025-02-26T21:12:16Z"
  },
  {
    "title": "Trump Says Ukraine's Zelenskiy Coming US to Sign Resource Deal",
    "description": "President Donald Trump said Ukraine’s President Volodymyr Zelenskiy will come to the US Friday to sign a draft agreement giving the US access to revenue from the country’s natural resources, even as the Ukrainian leader cautioned the deal wasn’t completed.\n“W…",
    "link": "https://biztoc.com/x/96662fe06b3e9b21",
    "timestamp": "2025-02-26T21:12:01Z"
  },
  {
    "title": "Trump State Dept Notches Roughly $60 Billion In ‘Savings’ After Taking Torch To Wasteful Funding, Memo Says",
    "description": "President Donald Trump's Department of State has already saved billions of taxpayer dollars slashing wasteful grants going to recipients around the world.",
    "link": "https://dailycaller.com/2025/02/26/state-dept-60-billion-saved-memo-reveals/",
    "timestamp": "2025-02-26T21:10:14Z"
  },
  {
    "title": "U.S. stocks give up morning gains to close mixed",
    "description": "U.S. stocks gave up their early gains to close mixed on Wednesday as U.S. bond yields fell again amid confusing comments from Donald Trump about tariffs on Canada and Mexico and after more lackluster economic data. Nvidia (NVDA) stock ended up 3.67% ahead of …",
    "link": "https://qz.com/us-stocks-close-lower-on-tariff-confusion-1851766674",
    "timestamp": "2025-02-26T21:10:00Z"
  },
  {
    "title": "What Is Trump's Gold Card Visa? A Look at the Controversial Route to U.S. Citizenship",
    "description": "President Donald Trump proposed Tuesday a new immigration initiative called the “gold card,” a high-priced alternative to an existing green card program aimed at attracting wealthy people and highly-skilled professionals to the U.S. Trump said the gold card w…",
    "link": "https://freerepublic.com/focus/f-news/4300717/posts",
    "timestamp": "2025-02-26T21:07:49Z"
  },
  {
    "title": "iPhone’s Dictation App Mistakenly Transcribed ‘Racist’ As ‘Trump’",
    "description": "If you’ve been wondering why your iPhone’s dictation app has been typing out \"racist\" anytime you mention “Trump,” you’re not the only one. Don't worry, it's a bug.",
    "link": "https://www.forbes.com/sites/dimitarmixmihov/2025/02/26/iphones-dictation-app-mistakenly-transcribed-racist-as-trump/",
    "timestamp": "2025-02-26T21:07:42Z"
  },
  {
    "title": "Eli Lilly plans to invest $27B to build four new US plants as tariffs loom",
    "description": "Pharmaceutical giant expects the move will create 3,000 high-skilled jobs and provide work for approximately 10,000 construction workers.",
    "link": "https://nypost.com/2025/02/26/business/eli-lilly-plans-to-invest-27b-to-build-four-new-us-plants/",
    "timestamp": "2025-02-26T21:06:01Z"
  },
  {
    "title": "DOGE: Millions of Taxpayer Dollars Were Poised to Drive ‘Social and Behavior’ Change in Uganda, Developing ‘Socially Responsible’ Behaviors in Colombia",
    "description": "Millions of taxpayer dollars were poised to be completely wasted, going toward efforts to drive “social and behavior” changes in Uganda and develop “socially responsible” behaviors in Colombia, the Department of Government Efficiency (DOGE) announced this wee…",
    "link": "https://freerepublic.com/focus/f-news/4300716/posts",
    "timestamp": "2025-02-26T21:06:00Z"
  },
  {
    "title": "Jamieson Greer confirmed as Trump’s top trade negotiator",
    "description": "Greer is a veteran of President Donald Trump's first-term economic battles with China, Mexico and Canada.",
    "link": "https://www.pbs.org/newshour/politics/jamieson-greer-confirmed-as-trumps-top-trade-negotiator",
    "timestamp": "2025-02-26T21:05:03Z"
  },
  {
    "title": "Mexican bishops call for national unity in the face of Trump’s policies toward the country",
    "description": "Mexican President Claudia Scheinbaum meets with the country’s bishops during their plenary assembly on Nov. 13, 2024. / Credit: Courtesy of the Mexican Bishops’ Conference\n\nPuebla, Mexico, Feb 26, 2025 / 16:05 pm (CNA).\nFaced with uncertainty about the impact…",
    "link": "https://www.catholicnewsagency.com/news/262453/mexican-bishops-call-for-national-unity-in-the-face-of-trumps-policies-toward-the-country",
    "timestamp": "2025-02-26T21:05:00Z"
  },
  {
    "title": "Paramount Misses Q4 Expectations, But Narrows Streaming Losses 42% to $286 Million",
    "description": "The media giant is on track to reach domestic streaming profitability in 2025 as it awaits FCC approval for its $8 billion Skydance merger \nThe post Paramount Misses Q4 Expectations, But Narrows Streaming Losses 42% to $286 Million appeared first on TheWrap.",
    "link": "https://www.thewrap.com/paramount-earnings-q4-2024/",
    "timestamp": "2025-02-26T21:04:28Z"
  },
  {
    "title": "Why the Trump administration may want Ukraine's minerals",
    "description": "A deal this week will give the United States access to Ukraine’s mineral wealth",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-administration-ukraines-minerals-119227118",
    "timestamp": "2025-02-26T21:02:37Z"
  },
  {
    "title": "Tesla's stock slide drops its market cap under $1 trillion",
    "description": "stock surged after President Donald Trump won last November’s election, based on his relationship with CEO Elon Musk. But that relationship is likely a driving factor behind the erasure of much of those gains.\nThe stock closed at $302.80 per share on Tuesday,…",
    "link": "https://biztoc.com/x/4383d938bdfa04ff",
    "timestamp": "2025-02-26T21:00:56Z"
  },
  {
    "title": "Van Jones praises Trump for 'very good' choice with new pardon czar pick",
    "description": "Former Obama advisor Van Jones, praised President Trump for appointing Alice Marie Johnson as his \"pardon czar\" to oversee pardoning incarcerated individuals.",
    "link": "https://www.foxnews.com/media/van-jones-praises-president-trump-very-good-choice-new-czar-pick",
    "timestamp": "2025-02-26T21:00:12Z"
  },
  {
    "title": "Bezos Shakes Up Washington Post Opinion Pages",
    "description": "Washington Post owner Jeff Bezos on Wednesday shared on X a memo he had sent that declared a broad reshaping of The Post’s liberal opinion... Read More\nThe post Bezos Shakes Up Washington Post Opinion Pages appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/02/26/bezos-shakes-up-washington-post-opinion-pages/",
    "timestamp": "2025-02-26T21:00:05Z"
  },
  {
    "title": "Border disputes need a smarter path",
    "description": "<p>Though I live in Washington, DC, I generally spend some time each year in Thailand. When I visited recently, I was interested in noting the renewed controversy around the MOU 44 with Cambodia concerning Koh Kut and the overlapping claims area. While there …",
    "link": "https://www.bangkokpost.com/opinion/opinion/2969155/border-disputes-need-a-smarter-path",
    "timestamp": "2025-02-26T21:00:00Z"
  },
  {
    "title": "Europe Weighs Options Beyond U.S. Amidst Global Uncertainty",
    "description": "China is looking to capitalize on a transatlantic rift between the United States and Europe that is widening as U.S. President Donald Trump looks to quickly end the war in Ukraine. But how much of an opening is there actually for Beijing? Finding Perspective:…",
    "link": "https://oilprice.com/Geopolitics/International/Europe-Weighs-Options-Beyond-US-Amidst-Global-Uncertainty.html",
    "timestamp": "2025-02-26T21:00:00Z"
  },
  {
    "title": "Trump's tariffs will hit consumers and businesses",
    "description": "<p>The opening salvos of US President Donald Trump's trade war have sent shockwaves around the world. Over the past weeks, his administration has broken with decades of free-trade orthodoxy, threatening to impose tariffs not only on strategic adversaries like…",
    "link": "https://www.bangkokpost.com/opinion/opinion/2969035/trumps-tariffs-will-hit-consumers-and-businesses",
    "timestamp": "2025-02-26T21:00:00Z"
  },
  {
    "title": "Bank of America CEO signals potential stablecoin launch",
    "description": "Bank of America (BAC) is poised to enter the stablecoin market, contingent upon the passage of favorable legislation by U.S. lawmakers, according to CEO Brian Moynihan. Speaking at the Economic Club of Washington, D.C., Moynihan stated, “If they make that leg…",
    "link": "https://qz.com/bank-of-america-ceo-signals-potential-stablecoin-launch-1851766666",
    "timestamp": "2025-02-26T21:00:00Z"
  },
  {
    "title": "How DOGE cuts are impacting federal workers",
    "description": "Proposals from DOGE, Elon Musk's entity tasked with making the federal government more \"efficient,\" have resulted in lawsuits, pushback from other federal agencies, and a lot of uncertainty for the millions of people who work for the federal government. We lo…",
    "link": "https://www.npr.org/2025/02/26/1233894772/podcast-doge-workforce",
    "timestamp": "2025-02-26T20:59:55Z"
  },
  {
    "title": "Democratic senators press Trump nominees on whether officials can ever ignore judges' orders",
    "description": "Several of President Donald Trump’s nominees for senior Justice Department positions faced questions from Senate Democrats on Wednesday about whether it would ever be lawful for a president to defy a court order, with the nominees largely suggesting they coul…",
    "link": "https://www.nbcnews.com/politics/justice-department/democratic-senators-press-trump-nominees-whether-officials-can-ignore-rcna193896",
    "timestamp": "2025-02-26T20:59:09Z"
  },
  {
    "title": "Judge Gives Government Watchdog More Time To Stay In Role After Trump Firing",
    "description": "A temporary restraining order that has stopped the Trump administration from firing a key government official will be extended.",
    "link": "https://www.huffpost.com/entry/top-federal-watchdog-doj-lawyers-firing_n_67bf7092e4b00e46454b4346",
    "timestamp": "2025-02-26T20:58:06Z"
  },
  {
    "title": "Turns Out, Trump and DOGE Haven’t Actually Saved Any Money",
    "description": "Donald Trump and Elon Musk claim they’re saving billions through the Department of Government Efficiency’s mass purge of federal bureaucracy, but government spending has actually gone up since Inauguration Day.\r\nAccording to an analysis published Wednesday by…",
    "link": "https://newrepublic.com/post/192036/donald-trump-elon-musk-doge-saved-money",
    "timestamp": "2025-02-26T20:56:46Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "In Somalia, some 3.4 million people are already experiencing crisis-levels of hunger. This figure is expected to rise to 4.4 million between April and June when below-average rains are forecast. However, the $1.42 billion humanitarian appeal is only 12 per ce…",
    "link": "https://press.un.org/en/2025/db250226.doc.htm",
    "timestamp": "2025-02-26T20:55:42Z"
  },
  {
    "title": "Here’s Who Will Win at the 2025 Oscars",
    "description": "And who should win",
    "link": "https://www.theatlantic.com/culture/archive/2025/02/oscars-2025-winners-predictions/681845/",
    "timestamp": "2025-02-26T20:55:13Z"
  },
  {
    "title": "Crude Futures Drop as Trade Uncertainty Grows",
    "description": "Oil prices hit a new low for the year as Trump's conflicting trade statements fuel market uncertainty and demand concerns.",
    "link": "https://www.rigzone.com/news/wire/crude_futures_drop_as_trade_uncertainty_grows-26-feb-2025-179754-article/",
    "timestamp": "2025-02-26T20:55:07Z"
  },
  {
    "title": "New Proposal by Republican Lawmaker Aims to Create $250 Bill Featuring President Trump",
    "description": "Representative Joe Wilson (R-SC) has announced that he’s drafting legislation to create a $250 bill featuring President Trump. Rep. Wilson wrote in a post on X, “Grateful to announce that I am drafting legislation to direct the Bureau of Engraving and Printin…",
    "link": "https://freerepublic.com/focus/f-bloggers/4300714/posts",
    "timestamp": "2025-02-26T20:55:06Z"
  },
  {
    "title": "Trump says EU tariffs announcement coming 'very soon'",
    "description": "\"The EU was formed to screw the United States,\" Trump says.",
    "link": "https://www.bbc.com/news/articles/c05ml3q2gn7o",
    "timestamp": "2025-02-26T20:54:39Z"
  },
  {
    "title": "What's next for Trump agenda after House GOP approves tax breaks and slashed spending in budget",
    "description": "Now that House Republicans have passed an ambitious budget blueprint for President Donald Trump’s agenda, its time for hard work",
    "link": "https://abcnews.go.com/US/wireStory/trump-agenda-after-house-gop-approves-tax-breaks-119226078",
    "timestamp": "2025-02-26T20:54:19Z"
  },
  {
    "title": "Key takeaways from Donald Trump’s first cabinet meeting with Elon Musk",
    "description": "Musk defended DOGE attempts to fire federal employees, while Trump said Russia would have to make concessions for peace.",
    "link": "https://www.aljazeera.com/news/2025/2/26/key-takeaways-from-donald-trumps-first-cabinet-meeting-with-elon-musk",
    "timestamp": "2025-02-26T20:53:06Z"
  },
  {
    "title": "Wisconsin bill replaces 'mother' with 'inseminated person' — but only in artificial insemination law",
    "description": "The language change seeks to ensure Wisconsin law includes married same-sex couples as possible recipients of artificial insemination.",
    "link": "https://www.snopes.com//fact-check/wisconsin-inseminated-person-mother-bill/",
    "timestamp": "2025-02-26T20:52:00Z"
  },
  {
    "title": "Why did Elon Musk take center stage at a White House Cabinet meeting?",
    "description": "The first Cabinet meeting of Donald Trump's first term was ridiculous. Elon Musk made the first Cabinet meeting of his second term worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/elon-musk-take-center-stage-white-house-cabinet-meeting-rcna193904",
    "timestamp": "2025-02-26T20:50:44Z"
  },
  {
    "title": "Trump signals more firings of military leaders (Paul McLeary/Politico)",
    "description": "Paul McLeary / Politico:\nTrump signals more firings of military leaders  —  Senior officers involved in the U.S. pullout from Afghanistan are “going to be largely gone,” he said.  —  President Donald Trump, in a continued effort to replace Pentagon officials,…",
    "link": "https://www.memeorandum.com/250226/p107",
    "timestamp": "2025-02-26T20:50:01Z"
  },
  {
    "title": "Healthcare Stocks Decline After Trump Signs Executive Order On Price Transparency",
    "description": "Shares of major healthcare companies such as The Cigna Group Inc. (NYSE:CI), Molina Healthcare Inc. (NYSE:MOH) and UnitedHealth Group Inc. (NYSE:UNH) dropped Wednesday following the signing of an executive order by President Donald Trump aimed at strengthenin…",
    "link": "https://biztoc.com/x/3bf5a55e66a63234",
    "timestamp": "2025-02-26T20:49:43Z"
  },
  {
    "title": "Fact Check: Is US Education Global Bottom, as Trump Says?",
    "description": "President Donald Trump blasted the U.S. education system in comparison to other nations",
    "link": "https://biztoc.com/x/5f865b729d0885c7",
    "timestamp": "2025-02-26T20:49:39Z"
  },
  {
    "title": "Viral Video of Don Jr. Arguing America ‘Should Have Been Sending Weapons to Russia’ Is Fake",
    "description": "A viral video of Donald Trump Jr. arguing that the United States \"should have been sending weapons to Russia\" to aid it in its war against Ukraine is fake.\nThe post Viral Video of Don Jr. Arguing America ‘Should Have Been Sending Weapons to Russia’ Is Fake fi…",
    "link": "https://www.mediaite.com/news/viral-video-of-don-jr-arguing-america-should-have-been-sending-weapons-to-russia-is-fake/",
    "timestamp": "2025-02-26T20:48:41Z"
  },
  {
    "title": "Restoring Trust in Public Health: Preventing Waste and Fraud in National Emergency Assistance",
    "description": "This is the first in an eight-article series on “Restoring Trust in Public Health: Lessons from COVID-19.” Four years of the Biden-Harris administration has left... Read More\nThe post Restoring Trust in Public Health: Preventing Waste and Fraud in National Em…",
    "link": "https://www.dailysignal.com/2025/02/26/restoring-trust-public-health-preventing-waste-fraud-national-emergency-assistance/",
    "timestamp": "2025-02-26T20:48:13Z"
  },
  {
    "title": "DAVIS: Can Eric Adams Be Trusted?",
    "description": "As the Trump Administration restores law and order to America’s immigration system, they are hoping for some help from an unlikely ally",
    "link": "https://dailycaller.com/2025/02/26/davis-eric-adams-trust-new-york-city-immigration-tom-homan/",
    "timestamp": "2025-02-26T20:47:17Z"
  },
  {
    "title": "Canadians Cancel Disney Vacations After Government Begs Them “Don’t Go”",
    "description": "Canadians are canceling their Walt Disney World Resort and Disneyland Resort vacations in droves as United States President Donald Trump promises that tariffs will go into effect on Canada and Mexico in the coming weeks. Canadian Government Warns Against Disn…",
    "link": "https://insidethemagic.net/2025/02/disney-world-canadians-canceling-vacations-thread-jc1/",
    "timestamp": "2025-02-26T20:45:41Z"
  },
  {
    "title": "Federal workers pack Arlington town hall as county braces for impacts of DOGE",
    "description": "Over 200 people packed a standing-room-only town hall yesterday (Tuesday) to discuss how federal workforce cuts are personally impacting Arlington residents. The event for federal employees and contractors came as Arlington County is considering an $11.5 mill…",
    "link": "https://www.arlnow.com/2025/02/26/federal-workers-pack-arlington-town-hall-as-county-braces-for-impacts-of-doge/",
    "timestamp": "2025-02-26T20:45:15Z"
  },
  {
    "title": "Musk stars at Trump's first cabinet meeting",
    "description": "<p>WASHINGTON - Elon Musk starred at Donald Trump's first cabinet meeting Wednesday, with the US president insisting his team was \"thrilled\" with the extraordinary power given to his billionaire advisor despite reported tensions over his sweeping government c…",
    "link": "https://www.bangkokpost.com/world/2968728/musk-stars-at-trumps-first-cabinet-meeting",
    "timestamp": "2025-02-26T20:45:00Z"
  },
  {
    "title": "Ex-Washington Post Editor Marty Baron Shreds Jeff Bezos for ‘Cravenly Yielding’ to Trump: I’m ‘Sad and Disgusted’",
    "description": "WaPo owner Jeff Bezos's move to dramatically change the direction of the Post's opinion section is drawing heavy condemnation from the paper's former editor.\nThe post Ex-Washington Post Editor Marty Baron Shreds Jeff Bezos for ‘Cravenly Yielding’ to Trump: I’…",
    "link": "https://www.mediaite.com/news/ex-washington-post-editor-marty-baron-shreds-jeff-bezos-for-cravenly-yielding-to-trump-im-sad-and-disgusted/",
    "timestamp": "2025-02-26T20:44:51Z"
  },
  {
    "title": "Donald Trump: Federal Employees Who Didn't Respond to Elon's Email 'Are on the Bubble'",
    "description": "President Donald Trump said federal employees who have failed to reply to Elon Musk's email asking them to name five things they accomplished in the past week \"are on the bubble.\"\nThe post Donald Trump: Federal Employees Who Didn’t Respond to Elon’s Email ‘Ar…",
    "link": "https://www.breitbart.com/politics/2025/02/26/donald-trump-federal-employees-who-didnt-respond-elons-email-are-on-bubble/",
    "timestamp": "2025-02-26T20:44:39Z"
  },
  {
    "title": "Donald Trump Is Turning the Press Pool Into a MAGA Echo Chamber",
    "description": "After going to war with The AP, the White House is now deciding which pool reporters cover the president, swapping out HuffPost and Reuters for Newsmax and the Blaze.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-is-turning-the-press-pool-into-a-maga-echo-chamber",
    "timestamp": "2025-02-26T20:43:25Z"
  },
  {
    "title": "Trump says to impose 25 pct tariffs on EU cars, other products",
    "description": "WASHINGTON, Feb. 26 (Xinhua) -- U.S. President Donald Trump said on Wednesday that his administration has made a decision to impose 25 percent tariffs on products from the European Union (EU), including cars. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/27/trump-says-to-impose-25-pct-tariffs-on-eu-cars-other-products",
    "timestamp": "2025-02-26T20:41:00Z"
  },
  {
    "title": "DOJ Will Crack Down on Campus Anti-Semitism, Trump Nominee for Civil Rights Division Says",
    "description": "The Department of Justice will take aggressive action against rising anti-Semitism on college campuses throughout the United States, Harmeet Dhillon said Wednesday at her confirmation hearing for assistant attorney general for the DOJ's Civil Rights Division.…",
    "link": "https://freebeacon.com/latest-news/doj-will-crack-down-on-campus-anti-semitism-trump-nominee-for-civil-rights-division-says/",
    "timestamp": "2025-02-26T20:40:12Z"
  },
  {
    "title": "White House bars AP, Reuters and other media from covering Trump cabinet meeting (James Oliphant/Reuters)",
    "description": "James Oliphant / Reuters:\nWhite House bars AP, Reuters and other media from covering Trump cabinet meeting  —  The White House on Wednesday denied reporters from Reuters and other news organizations access to President Donald Trump's first cabinet meeting in …",
    "link": "https://www.memeorandum.com/250226/p106",
    "timestamp": "2025-02-26T20:40:00Z"
  },
  {
    "title": "How a son spent a year trying to save his father from conspiracy theories",
    "description": "Zach Mack spent a year attempting to rescue his father from the depths of the conspiracy rabbit hole. Their family was forced to reckon with clashing realities, ideological divides and misinformation.",
    "link": "https://www.npr.org/2025/02/26/g-s1-50605/conspiracy-theories-politics-family-alternate-realities",
    "timestamp": "2025-02-26T20:39:26Z"
  },
  {
    "title": "Trump Appointed Judge Slams DOJ's 'Extraordinary' Views on Jan. 6 Pardons",
    "description": "Judge Dabney Friedrich called it \"extraordinary\" for the Justice Department to assert that President Donald Trump's blanket pardons for Capitol rioters also cover crimes related to illegal contraband discovered during searches conducted as part of Jan. 6 inve…",
    "link": "https://biztoc.com/x/ebc6d7b85bcb8486",
    "timestamp": "2025-02-26T20:38:47Z"
  },
  {
    "title": "Trump Has A Plan To Lower Gas Prices, Experts Discuss Potential Backlashes",
    "description": "President Donald Trump issued plans Wednesday to cut taxes for domestic oil and gas producers while allowing full expense deductions for new factory construction, aiming to boost production and lower consumer costs.\n“As long as you invest in America, build in…",
    "link": "https://biztoc.com/x/9a3d8a41e6d4ba5a",
    "timestamp": "2025-02-26T20:38:42Z"
  }
]