[
  {
    "title": "Today in Germany: A roundup of the latest news on Thursday",
    "description": "Thirteen Bundeswehr soldiers are being deployed to Greenland, the Bundestag debates citizen's allowance reform, hospitals at the border are losing nurses to Switzerland, and more news from around Germany on Thursday, January 15th.",
    "link": "https://www.thelocal.de/20260115/today-in-germany-a-roundup-of-the-latest-news-on-thursday-102",
    "timestamp": "2026-01-15T07:39:28Z"
  },
  {
    "title": "European military personnel making their way to Greenland as Trump tones down his threats",
    "description": "Trump, speaking after the meeting which he did not attend, for the first time sounded conciliatory on Greenland.",
    "link": "https://www.thejournal.ie/european-military-personnel-making-their-way-to-greenland-as-trump-tones-down-his-threats-6927237-Jan2026/",
    "timestamp": "2026-01-15T07:36:24Z"
  },
  {
    "title": "CNBC Daily Open: Greenland and Iran tensions drive investors to gold and silver",
    "description": "Global geopolitical turmoil, as well as Trump's apparent attack on the Fed, is pushing up the prices of gold and silver.",
    "link": "https://www.cnbc.com/2026/01/15/cnbc-daily-open-greenland-and-iran-tensions-drive-investors-to-gold-and-silver.html",
    "timestamp": "2026-01-15T07:32:44Z"
  },
  {
    "title": "Iran reopens airspace after temporary closure forced flights to reroute as tensions with US escalate",
    "description": "Lufthansa said on Wednesday that it would bypass Iranian and Iraqi airspace until further notice while it would only operate day flights to Tel Aviv and Amman from Wednesday until Monday next week.",
    "link": "https://nypost.com/2026/01/15/world-news/iran-reopens-airspace-after-temporary-closure-forced-flights-to-reroute-as-tensions-with-us-escalate/",
    "timestamp": "2026-01-15T07:31:58Z"
  },
  {
    "title": "UPSC Issue at a Glance | US–Venezuela Crisis: What happened, why Venezuela, and how it matters for India",
    "description": "From the capture of President Nicolas Maduro and oil geopolitics to fentanyl, great-power rivalry, and India’s strategic dilemmas, the US–Venezuela crisis is more than breaking news. This week's UPSC Issue at a Glance decodes Operation Absolute Resolve and it…",
    "link": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-us-venezuela-crisis-oil-fentanyl-operation-absolute-resolve-monroe-10474505/",
    "timestamp": "2026-01-15T07:30:55Z"
  },
  {
    "title": "Huge update on man set to be executed in Iran after Trump vowed 'very strong action'",
    "description": "The family of Erfan Soltani has been handed a positive update on his execution",
    "link": "https://www.ladbible.com/news/world-news/update-iran-protests-erfan-soltani-execution-donald-trump-494181-20260115",
    "timestamp": "2026-01-15T07:30:37Z"
  },
  {
    "title": "Suspended Michigan worker who heckled Trump gets outpouring of donations",
    "description": "Tens of thousands of dollars are raised for TJ Sabula after he reportedly calls Trump ‘pedophile protector’ during Ford plant tour",
    "link": "https://www.irishtimes.com/world/us/2026/01/15/suspended-michigan-worker-who-heckled-trump-gets-outpouring-of-donations/",
    "timestamp": "2026-01-15T07:30:22Z"
  },
  {
    "title": "US president reiterates need to acquire Greenland",
    "description": "US President Donald Trump has reiterated that the United States needs Greenland and that Denmark cannot be relied upon to protect the island, even as he said that \"something will work out\" with respect to the future governance of the Danish overseas territory.",
    "link": "https://www.rte.ie/news/world/2026/0115/1553189-greenland-us/",
    "timestamp": "2026-01-15T07:30:19Z"
  },
  {
    "title": "Iran closes airspace to commercial aircraft for hours amid tensions with US",
    "description": "{\n \"themeId\": \"lct_64772ae4d1d7dec0c5b716ac\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"69666392f7988a62111b2595\"\n}",
    "link": "https://www.independent.ie/world-news/middle-east/iran-closes-airspace-to-commercial-aircraft-for-hours-amid-tensions-with-us/a76519856.html",
    "timestamp": "2026-01-15T07:30:00Z"
  },
  {
    "title": "US sets 25% tariff on some chip sales as part of Nvidia deal",
    "description": "Agreement allows Nvidia to ship AI  processors to China",
    "link": "https://www.irishtimes.com/business/2026/01/15/us-sets-25-tariff-on-some-chip-sales-as-part-of-nvidia-deal/",
    "timestamp": "2026-01-15T07:29:38Z"
  },
  {
    "title": "As the Greenland drama unfolds, keep an eye on the mafia doctrine",
    "description": "The Greenland saga is lopsided; it was wise for Foreign Minister Lars Løkke Rasmussen to say Wednesday that he wouldn’t be another Chamberlain promising ’peace in our time’",
    "link": "https://politiken.dk/edition/news/art10691917/As-the-Greenland-drama-unfolds-keep-an-eye-on-the-mafia-doctrine",
    "timestamp": "2026-01-15T07:26:43Z"
  },
  {
    "title": "Republicans, Democrats say no to US military strike against Iran as Trump mulls action: poll",
    "description": "Democrats and Republicans are united in opposing U.S. military strikes against Iran to retaliate for the killing of protesters amid a wave of massive demonstrations against the Iranian government in recent weeks, according to a new national poll.Seventy perce…",
    "link": "https://freerepublic.com/focus/f-news/4362226/posts",
    "timestamp": "2026-01-15T07:26:03Z"
  },
  {
    "title": "'Jaw-Dropping': People Are Stunned By Ted Cruz's Ominous Trump Warning In Decade-Old Clip",
    "description": "The Texas senator, in the heat of his 2016 presidential campaign, put Trump on blast over his ability to \"keep this country safe.\"",
    "link": "https://www.huffpost.com/entry/ted-cruz-trump-nuke-denmark-2016-campaign-greenland_n_69685455e4b09fa9c7975584",
    "timestamp": "2026-01-15T07:22:52Z"
  },
  {
    "title": "Giants working to finalize deal to make John Harbaugh next head coach: reports",
    "description": "John Harbaugh reportedly nearing deal to become New York Giants head coach after extensive interview process. Former Ravens coach expected to land the job.",
    "link": "https://www.foxnews.com/sports/giants-hire-john-harbaugh-next-head-coach-reports",
    "timestamp": "2026-01-15T07:22:12Z"
  },
  {
    "title": "Iran updates: Trump holds of on strikes after assurances",
    "description": "US President Donald Trump says Iran has halted killings and executions, citing assurances he received. Tehran denies plans for hangings as tensions remain high and airspace closures disrupt flights. Follow DW for more. US President Donald Trump says he is tol…",
    "link": "https://www.dw.com/en/iran-updates-trump-holds-off-on-strikes-after-assurances/live-75511404",
    "timestamp": "2026-01-15T07:22:00Z"
  },
  {
    "title": "Gaza plan phase two: US to discuss Hamas disarmament, Israeli withdrawal",
    "description": "The second phase of the ceasefire deal includes naming a panel of Palestinian technocrats to lead post-war Gaza.",
    "link": "https://www.aljazeera.com/news/2026/1/15/gaza-plan-phase-two-us-to-discuss-hamas-disarmament-israeli-withdrawal",
    "timestamp": "2026-01-15T07:18:28Z"
  },
  {
    "title": "Stephen Colbert Taunts Trump With The 2 Words That Really Triggered Him",
    "description": "The \"Late Show\" host also had a blunt question for the president.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-pedophile-protector_n_69687af4e4b09fa9c797732f",
    "timestamp": "2026-01-15T07:17:36Z"
  },
  {
    "title": "If Iran falls, India may also have something to worry about",
    "description": "India Iran relations face renewed scrutiny as protests in Tehran threaten New Delhi’s access to Central Asia via Chabahar Port. Instability could weaken Iran as a counterweight to Pakistan and extremist groups, while giving China greater regional influence.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-iran-relations-khamenei-modi-chabahar-protests-china-pakistan-strategy/articleshow/126540598.cms",
    "timestamp": "2026-01-15T07:14:04Z"
  },
  {
    "title": "Morning Recap: AFCON heartbreak for Nigeria, US visa shock, FG–ASUU deal, other top stories",
    "description": "Get your morning recap of top Nigerian news. Read about the Super Eagles’ AFCON loss, the FG-ASUU agreement, and new US visa policies for Nigerians.\n\nRead More: https://punchng.com/morning-recap-afcon-heartbreak-for-nigeria-us-visa-shock-fg-asuu-deal-other-to…",
    "link": "https://punchng.com/morning-recap-afcon-heartbreak-for-nigeria-us-visa-shock-fg-asuu-deal-other-top-stories/",
    "timestamp": "2026-01-15T07:06:58Z"
  },
  {
    "title": "James Bond films ranked: Every 007 movie from worst to best",
    "description": "As every single Bond film is added to Netflix, Adam White and Alexandra Pollard compile the definitive ranking of every 007 outing to date",
    "link": "https://www.the-independent.com/arts-entertainment/films/features/best-james-bond-movies-ranked-netflix-007-b2899562.html",
    "timestamp": "2026-01-15T07:04:52Z"
  },
  {
    "title": "Stephen Colbert Defends Auto Worker Who Issued ‘Pedophile Protector’ Dig at Trump: ‘Props For Using Precise Language’ | Video",
    "description": "\"You've got to hand it to that auto worker for getting under Trump's skin like compound butter on a Thanksgiving turkey,\" the late night host adds\nThe post Stephen Colbert Defends Auto Worker Who Issued ‘Pedophile Protector’ Dig at Trump: ‘Props For Using Pre…",
    "link": "https://www.thewrap.com/creative-content/tv-shows/stephen-colbert-reacts-pedophile-protector-trump-dig-video/",
    "timestamp": "2026-01-15T07:04:01Z"
  },
  {
    "title": "Iran closes its airspace to commercial aircraft for hours as tensions with US remain high",
    "description": "Iran closed its airspace to commercial flights for hours without explanation as tensions remained high with the United States over Tehran’s crackdown on protests",
    "link": "https://abcnews.go.com/Business/wireStory/iran-closes-airspace-commercial-aircraft-hours-tensions-us-129227275",
    "timestamp": "2026-01-15T07:01:39Z"
  },
  {
    "title": "Asian shares mostly fall and oil drops $2 after Trump says Iran stopped killings",
    "description": "Asian shares are mostly lower after Wall Street retreated on Big Tech losses. Oil prices sank about $2 after President Donald Trump claimed that Iran had said it would stop killing protesters. However, Iran signaled it was stepping up executions. U.S. futures…",
    "link": "https://apnews.com/article/stock-markets-tech-trump-iran-10049feb11f3a6bf7b2a79f1ad997edc",
    "timestamp": "2026-01-15T07:00:51Z"
  },
  {
    "title": "U.S. Leadership Approval Drops Among NATO Allies",
    "description": "U.S. leadership approval within NATO countries fell sharply in 2025, dropping 14 percentage points to 21%.",
    "link": "https://news.gallup.com/poll/700889/u.s.-leadership-approval-drops-nato-allies.aspx",
    "timestamp": "2026-01-15T07:00:00Z"
  },
  {
    "title": "How Russia's and Ukraine's Neighbors See Them",
    "description": "On average, Russian and Ukrainian leadership receive similar approval ratings from their regional neighbors, but there are underlying divisions.",
    "link": "https://news.gallup.com/poll/700646/leadership-lens-russia-ukraine-neighbors.aspx",
    "timestamp": "2026-01-15T07:00:00Z"
  },
  {
    "title": "The Rhyme: Kent State and Renee Good",
    "description": "On May 4, 1970, following Republican President Richard Nixon’s April 1970, announcement of the expansion of the Viet Nam War into Cambodia, the Ohio National Guard opened fire on a group of Kent State students engaged in a peaceful campus protest against this…",
    "link": "https://www.counterpunch.org/2026/01/15/the-rhyme-kent-state-and-renee-good/",
    "timestamp": "2026-01-15T06:59:45Z"
  },
  {
    "title": "Trump says ‘we’ve been told killing has stopped’ in Iran",
    "description": "A day after warning of ‘serious consequences,’ Trump said he had been told the killing of protesters in Iran had stopped",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/15/trump-says-weve-been-told-killing-has-stopped-in-iran",
    "timestamp": "2026-01-15T06:57:31Z"
  },
  {
    "title": "Greenland’s value explained: Could Trump really buy the Danish island?",
    "description": "Greenland’s economy may be small, but its real value is tied to Arctic security and vast mineral reserves. Trump’s interest in it reflects US efforts to counter China’s dominance in sourcing critical raw materials. When Donald Trump once again raised the idea…",
    "link": "https://freerepublic.com/focus/f-news/4362224/posts",
    "timestamp": "2026-01-15T06:53:48Z"
  },
  {
    "title": "Trump sees Iranian crackdown easing, Tehran denies man to be executed",
    "description": "WASHINGTON/DUBAI, Jan 15 (Reuters) - U.S. President Donald Trump said he had been told that killings in Iran’s crackdown on protests were easing and that he believed ther… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/15/trump-sees-iranian-crackdown-easing-tehran-denies-man-to-be-executed",
    "timestamp": "2026-01-15T06:51:33Z"
  },
  {
    "title": "How South Korea’s Billions Will Upgrade Trump’s War Machine",
    "description": "In a flagrant disregard for international law and national sovereignty, the Trump administration invaded and kidnapped Venezuela’s President Maduro and First Lady Cilia Flores. Rather than being an isolated event, the increasing bravado of and remarks from Pr…",
    "link": "https://www.counterpunch.org/2026/01/15/how-south-koreas-billions-will-upgrade-trumps-war-machine/",
    "timestamp": "2026-01-15T06:51:16Z"
  },
  {
    "title": "Macron convenes emergency meeting to discuss Greenland, Iran",
    "description": "PARIS, Jan 15 (Reuters) - President Emmanuel Macron convened an emergency defence cabinet in Paris on Thursday to discuss U.S. President Donald’s Trump’s stated intent to… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/15/macron-convenes-emergency-meeting-to-discuss-greenland-iran",
    "timestamp": "2026-01-15T06:42:24Z"
  },
  {
    "title": "FBI searches a Washington Post reporter's home as part of investigation",
    "description": "Hannah Natanson had a phone, two laptops and a Garmin watch seized. The Justice Department says this is part of an investigation into a Pentagon contractor accused of taking home classified information.",
    "link": "https://www.npr.org/2026/01/15/g-s1-106103/fbi-search-washington-post-reporter-home",
    "timestamp": "2026-01-15T06:42:08Z"
  },
  {
    "title": "Skeptical Science New Research for Week #3 2026",
    "description": "Open access notables\n\nDeath Valley Illusion: Evidence against the 134°F World Record, Spencer et al., Bulletin of the American Meteorological Society\n\nThe world record hottest near-surface air temperature of 134°F recorded at Greenland Ranch, Death Valley, Ca…",
    "link": "https://skepticalscience.com/new_research_2026_03.html",
    "timestamp": "2026-01-15T06:41:10Z"
  },
  {
    "title": "European markets head for higher open as traders track Greenland, Iran news",
    "description": "European stocks are expected to open broadly higher Thursday as traders digest the latest geopolitical news around Greenland and Iran.",
    "link": "https://www.cnbc.com/2026/01/15/european-markets-live-updates-stoxx-600-dax-ftse-cac.html",
    "timestamp": "2026-01-15T06:36:06Z"
  },
  {
    "title": "Trump claims Iran protest killings have halted and plays down military threats",
    "description": "Tehran’s foreign minister says executions detained antigovernment  activists are ‘out of the question’",
    "link": "https://www.irishtimes.com/world/middle-east/2026/01/15/trump-claims-iran-protest-killings-have-halted-and-plays-down-military-threats/",
    "timestamp": "2026-01-15T06:34:47Z"
  },
  {
    "title": "The Indo Daily: How an Instagram ‘like’ exposed the messy Beckham family feud",
    "description": "When you hear the name “Beckham”, you think Spice Girls, sporting prestige and, in more recent years, a celebrity brand powered by the perfectly polished family picture.",
    "link": "https://www.independent.ie/podcasts/the-indo-daily/the-indo-daily-how-an-instagram-like-exposed-the-messy-beckham-family-feud/a820727177.html",
    "timestamp": "2026-01-15T06:29:08Z"
  },
  {
    "title": "Trump to host Venezuelan opposition leader sidelined by US",
    "description": "US President Donald Trump is scheduled to meet Thursday with Venezuelan opposition leader Maria Corina Machado, whose pro-democracy movement he has sidelined since toppling her country’s leader, and whose Nobel Peace Prize he openly envies. Machado’s White Ho…",
    "link": "https://www.digitaljournal.com/world/trump-to-host-venezuelan-opposition-leader-sidelined-by-us/article",
    "timestamp": "2026-01-15T06:27:20Z"
  },
  {
    "title": "Taiwan’s TSMC logs net profit jump on AI boom",
    "description": "Taiwanese chipmaking titan TSMC announced Thursday a forecast-busting net profit for the fourth quarter in a sign of sustained global demand for AI technology. TSMC is the world’s biggest contract maker of chips used in everything from Apple’s smartphones to …",
    "link": "https://www.digitaljournal.com/world/taiwans-tsmc-logs-net-profit-jump-on-ai-boom/article",
    "timestamp": "2026-01-15T06:22:32Z"
  },
  {
    "title": "US suspends immigrant visas for citizens of 75 nations, including Nepal",
    "description": "Washington, Jan 15: The US State Department on Wednesday announced the suspension of immigrant visa processing for citizens of 75 […]\nThe post US suspends immigrant visas for citizens of 75 nations, including Nepal appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2026/01/15/us-suspends-immigrant-visas-for-citizens-of-75-nations-including-nepal/",
    "timestamp": "2026-01-15T06:20:00Z"
  },
  {
    "title": "China signals reset with Canada as Carney begins Beijing visit",
    "description": "The visit follows a tentative thaw after years of strained relations marked by tariff disputes, including Chinese retaliation over Canada’s curbs on Chinese electric vehicles",
    "link": "https://www.thehindubusinessline.com/news/world/china-signals-reset-with-canada-as-carney-begins-beijing-visit/article70512269.ece",
    "timestamp": "2026-01-15T06:12:52Z"
  },
  {
    "title": "Rift at top of the Taliban: BBC reveals clash of wills behind internet shutdown",
    "description": "The Taliban leader once warned of a split: A BBC investigation reveals how attitudes to women, the internet and religion are dividing the group at the very top.",
    "link": "https://www.bbc.com/news/articles/cg7vdpy1l2vo",
    "timestamp": "2026-01-15T06:05:57Z"
  },
  {
    "title": "Trump says Iran killings stopped, Tehran says 'no plan for hanging'",
    "description": "US President Donald Trump said Wednesday he had been told the killings of protesters in Iran had been halted, but added that he would \"watch it and see\" about threatened military action.reporter in the Oval Office if US military action was now off the table, …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-iran-killings-stopped-tehran-says-no-plan-for-hanging/articleshow/126539567.cms",
    "timestamp": "2026-01-15T06:04:00Z"
  },
  {
    "title": "Gold, silver slide from record heights on profit-taking",
    "description": "Gold and silver prices drop as profit-taking and reduced geopolitical tensions lessen safe-haven demand, impacting precious metals.",
    "link": "https://www.thehindubusinessline.com/markets/gold/gold-silver-slide-from-record-heights-on-profit-taking/article70512240.ece",
    "timestamp": "2026-01-15T06:03:48Z"
  },
  {
    "title": "The united West is dead",
    "description": "European leaders should heed their voters and ensure the bloc remains a pole within its own sphere of influence — not a bystander in someone else’s.",
    "link": "https://www.politico.eu/article/the-united-west-is-dead/",
    "timestamp": "2026-01-15T06:01:00Z"
  },
  {
    "title": "Ethereum – Here’s why this White House whale foresees +60% upside to $5.4K",
    "description": "Will anlaysts' ETH bet on +$5,000 target materialize in Q1?",
    "link": "https://ambcrypto.com/ethereum-heres-why-this-white-house-whale-foresees-60-upside-to-5-4k/",
    "timestamp": "2026-01-15T06:00:48Z"
  },
  {
    "title": "Number of US citizens seeking asylum in Ireland rises fourfold",
    "description": "It is not clear if any of the 94 American applicants in 2025 were granted international protection here",
    "link": "https://www.irishtimes.com/crime-law/2026/01/15/fourfold-rise-in-number-of-us-citizens-seeking-asylum-in-ireland/",
    "timestamp": "2026-01-15T06:00:01Z"
  },
  {
    "title": "Greenland rejects U.S. annexation push as Trump warns of “big problem” for PM",
    "description": "Greenland’s Prime Minister Jens-Frederik Nielsen firmly rejected U.S. overtures to bring the autonomous Danish territory under American control, declaring Greenland’s allegiance to Denmark, NATO and the EU. Trump dismissed this stance as “a big problem.” Trum…",
    "link": "https://www.naturalnews.com/2026-01-15-greenland-rejects-us-annexation-trump-warns-big-problem.html",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "Danish FM: “Fundamental disagreement” persists between Washington and Copenhagen over Greenland",
    "description": "High-level talks between U.S., Danish and Greenlandic officials ended without resolving a “fundamental disagreement” over U.S. ambitions to acquire Greenland, leading only to the creation of a working group to explore compromises. Danish officials explicitly …",
    "link": "https://www.naturalnews.com/2026-01-15-danish-fm-fundamental-disagreement-washington-copenhagen-greenland.html",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "Florida lawmakers move to ban paper straws over PFAS concerns",
    "description": "Florida state lawmakers introduced SB 958 and HB 2195 to prohibit paper straws, citing research showing they contain PFAS (“forever chemicals”) that pose serious health risks, including cancer and immune suppression. Paper straws – once promoted as biodegrada…",
    "link": "https://www.naturalnews.com/2026-01-15-florida-moves-ban-paper-straws-pfas-concerns.html",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "Senate unanimously passes DEFIANCE Act, empowering victims of AI-generated deepfakes",
    "description": "The DEFIANCE Act, passed unanimously by the U.S. Senate, grants victims of nonconsensual deepfake pornography the right to sue creators and distributors in federal court, closing gaps in inconsistent state laws. Introduced by Sen. Dick Durbin (D-IL) and co-sp…",
    "link": "https://www.naturalnews.com/2026-01-15-senate-passes-defiance-act-empowering-victims-deepfakes.html",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "Gold dethrones Treasury bonds as largest foreign reserve asset after 30 years",
    "description": "For the first time since 1996, gold has surpassed U.S. Treasury bonds as the largest reserve asset held by foreign central banks, with holdings nearing $4 trillion compared to $3.9 trillion in Treasuries. Central banks are aggressively accumulating gold (over…",
    "link": "https://www.naturalnews.com/2026-01-15-gold-dethrones-treasury-bonds-largest-reserve-asset.html",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "Trump v China: How Oil Is Defining Great Power Politics",
    "description": "What is this new era of global politics and where it does it leave Europe?",
    "link": "https://www.bbc.co.uk/sounds/play/m002pqpq",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "Russia warns of Western-backed “color revolution” in Iran as protests turn violent",
    "description": "Russian Foreign Ministry spokeswoman Maria Zakharova accused the U.S. and Israel of orchestrating a “color revolution” in Iran, exploiting economic hardship caused by Western sanctions to destabilize Tehran’s government. Protests erupted after Iran’s currency…",
    "link": "https://www.naturalnews.com/2026-01-15-russia-warns-western-backed-color-revolution-iran.html",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "U.S. orders evacuations as Iran threatens retaliation, raising fears of imminent strike",
    "description": "The Pentagon is evacuating military families from Middle East bases. European officials warn a U.S. attack on Iran could occur within 24 hours. Iran has explicitly threatened the key Al Udeid Air Base in Qatar. The crisis is fueled by Iranian protests and U.S…",
    "link": "https://www.naturalnews.com/2026-01-15-evacuations-ordered-iran-threatens-retaliation-imminent-strike.html",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "Trump announces plan to end federal payments to states with sanctuary cities",
    "description": "President Donald Trump announced that beginning Feb. 1, the federal government will end payments to states that maintain sanctuary cities, accusing them of protecting criminals and fueling crime. Sanctuary cities generally limit cooperation with federal immig…",
    "link": "https://www.naturalnews.com/2026-01-15-trump-end-federal-payments-states-sanctuary-cities.html",
    "timestamp": "2026-01-15T06:00:00Z"
  },
  {
    "title": "Trump signals possible fast strike on Iran as U.S. military moves intensify",
    "description": "The United States appears to be preparing for possible military action against Iran, as signs of increased military activity continue to emerge in the Middle East\nThe post Trump signals possible fast strike on Iran as U.S. military moves intensify appeared fi…",
    "link": "https://en.protothema.gr/2026/01/15/trump-signals-possible-fast-strike-on-iran-as-u-s-military-moves-intensify/",
    "timestamp": "2026-01-15T05:59:58Z"
  },
  {
    "title": "Forget tariff wars: The EU and Mercosur build one of the world's biggest free-trade zones",
    "description": "Against tough odds, the European Union and four key South American countries are closer than they've been in 25 years to signing a long-delayed free trade deal",
    "link": "https://abcnews.go.com/Business/wireStory/forget-tariff-wars-eu-mercosur-build-worlds-biggest-129230984",
    "timestamp": "2026-01-15T05:57:41Z"
  },
  {
    "title": "A Piece Of What?!? Critics Mock Trump Official's Truly 'Dystopian' New Meal Deal",
    "description": "Agriculture Secretary Brooke Rollins claimed it was the result of \"over a thousand simulations.\"",
    "link": "https://www.huffpost.com/entry/brooke-rollins-chicken-broccoli-meal_n_696862cbe4b00edae2a3852a",
    "timestamp": "2026-01-15T05:57:22Z"
  },
  {
    "title": "Protesters face off with officers after another immigration shooting in Minneapolis",
    "description": "President Donald Trump has threatened to invoke the Insurrection Act and deploy troops to quell persistent protests against Immigration and Customs Enforcement officers in Minneapolis",
    "link": "https://www.wsbradio.com/news/fear-anger-spread/VJVHYDYCIE27PHQVHCEBENWOGM/",
    "timestamp": "2026-01-15T05:54:10Z"
  },
  {
    "title": "Press freedom advocates worry that raid on Washington Post journalist's home will chill reporting",
    "description": "Press freedom advocates are concerned that this week's raid on a Washington Post journalist's home will deter reporting on government actions and silence whistleblowers",
    "link": "https://abcnews.go.com/Business/wireStory/press-freedom-advocates-worry-raid-washington-post-journalists-129230706",
    "timestamp": "2026-01-15T05:49:33Z"
  },
  {
    "title": "‘I hope they show humanity’: Greenlanders fear Trump’s desire for minerals",
    "description": "US President Donald Trump says he wants to buy Greenland from Denmark and is not taking ‘no’ for an answer.",
    "link": "https://www.aljazeera.com/features/2026/1/15/i-hope-they-show-humanity-greenlanders-fear-trumps-desire-for-minerals",
    "timestamp": "2026-01-15T05:46:38Z"
  },
  {
    "title": "Even Sydney Sweeney Is Falling Victim To Transvestigation",
    "description": "Right-wing conspiracy theorists are now claiming Euphoria star Sydney Sweeney is transgender, in the latest unhinged “transvestigation” to hit the internet. “Tranvestigations” see celebrities and other high-profile figures targeted with ...\nThe post Even Sydn…",
    "link": "https://www.starobserver.com.au/news/even-sydney-sweeney-is-falling-victim-to-transvestigation/240501",
    "timestamp": "2026-01-15T05:46:12Z"
  },
  {
    "title": "Iran temporarily closes airspace to most flights amid threat of US attack",
    "description": "Airspace restrictions come amid fears that US President Donald Trump could attack Iran.",
    "link": "https://www.aljazeera.com/news/2026/1/15/iran-closes-airspace-to-most-flights-amid-threat-of-us-attack-monitors",
    "timestamp": "2026-01-15T05:46:09Z"
  },
  {
    "title": "Press freedom advocates chilled by raid on Post journalist's home",
    "description": "Press freedom advocates are concerned this week's raid on a Washington Post journalist's home will deter reporting on government actions and silence whistleblowers. If that's the case, the Trump administration could hardly have chosen a more compelling target…",
    "link": "https://apnews.com/article/reporter-raid-washington-post-press-freedom-trump-a45cda99a699d6ddfcb8475363ddc4a8",
    "timestamp": "2026-01-15T05:42:59Z"
  },
  {
    "title": "Trump set to meet Venezuelan opposition leader after cozying up to Maduro’s successor",
    "description": "President Donald Trump is set to meet at the White House with Venezuelan opposition leader María Corina Machado",
    "link": "https://abcnews.go.com/US/wireStory/trump-set-meet-venezuelan-opposition-leader-after-cozying-129230707",
    "timestamp": "2026-01-15T05:41:51Z"
  },
  {
    "title": "Pritzker Attacks DOGE As Family-Linked Hyatt Takes $180M In Taxpayer-Funded Upgrades - The Manhattan",
    "description": "This is not some recycled political attack. It is fresh information pulled straight from public records, with “conflict of interest” written all over it.",
    "link": "https://themanhattan.press/business/2026/01/15/pritzker-attacks-doge-as-family-linked-hyatt-takes-180m-in-taxpayer-funded-upgrades/",
    "timestamp": "2026-01-15T05:41:25Z"
  },
  {
    "title": "Fed Chair stays for now as Trump weighs successor amid Justice probe",
    "description": "US President Donald Trump said he has no immediate plans to remove Federal Reserve Chair Jerome Powell despite a Justice Department investigation into renovation cost overruns. The probe has intensified debate over central bank independence, drawing bipartisa…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/fed-chair-stays-for-now-as-trump-weighs-successor-amid-justice-probe/articleshow/126539173.cms",
    "timestamp": "2026-01-15T05:41:15Z"
  },
  {
    "title": "We didn't manage to change American position on Greenland: Danish FM",
    "description": "The Danish foreign minister said Wednesday that he \"didn't manage to change American position\" on Greenland during a meeting with U.S. officials at the White House.",
    "link": "https://www.hurriyetdailynews.com/we-didnt-manage-to-change-american-position-on-greenland-danish-fm-217850",
    "timestamp": "2026-01-15T05:36:41Z"
  },
  {
    "title": "Türkiye 'played a very integral role in getting to this ceasefire' in Gaza: US official",
    "description": "Türkiye “has played a very integral role in getting to this ceasefire,” a US official said Wednesday as US President Donald Trump's plan for the Gaza Strip transitions into the second phase.",
    "link": "https://www.hurriyetdailynews.com/turkiye-played-a-very-integral-role-in-getting-to-this-ceasefire-in-gaza-us-official-217849",
    "timestamp": "2026-01-15T05:33:57Z"
  },
  {
    "title": "Democrats propose state laws to limit ICE after Minneapolis shooting of Renee Good",
    "description": "Democrats across the country are proposing state law changes to rein in federal immigration officers and protect the public following the shooting death of a protester in Minneapolis and the wounding of two people in Portland, Oregon",
    "link": "https://abcnews.go.com/US/wireStory/democrats-propose-state-laws-limit-ice-after-minneapolis-129230341",
    "timestamp": "2026-01-15T05:33:57Z"
  },
  {
    "title": "European nations to send troops to Greenland as US annexation threats escalate",
    "description": "Several NATO countries are deploying small numbers of military personnel to Greenland to participate in joint exercises with Denmark as US President Donald Trump ramps up his threats to forcibly annex the Arctic island. Denmark, which is responsible for Green…",
    "link": "https://freerepublic.com/focus/f-news/4362220/posts",
    "timestamp": "2026-01-15T05:32:04Z"
  },
  {
    "title": "Germany, France to send troops to Greenland",
    "description": "Germany and France on Wednesday said they will send troops to Greenland along with other European countries, as U.S. President Donald Trump ramped up threats to conquer the Arctic island.",
    "link": "https://www.hurriyetdailynews.com/germany-france-to-send-troops-to-greenland-217848",
    "timestamp": "2026-01-15T05:31:00Z"
  },
  {
    "title": "US Suspends Visa Processing for 75 Countries Including Tanzania, Rwanda",
    "description": "The US Department of State has announced it will halt immigrant visa processing for 75 countries, including Somalia, Tanzania, Rwanda and Sudan.",
    "link": "https://nairobileo.co.ke/business/article/25137/us-suspends-visa-processing-for-75-countries-including-tanzania-rwanda",
    "timestamp": "2026-01-15T05:30:12Z"
  },
  {
    "title": "Freed prisoners tell of horrors in Maduro regime’s torture chambers",
    "description": "The prisoners will never forget the screams that rang through the corridors from the torture chambers.",
    "link": "https://https://www.telegraph.co.uk/world-news/2026/01/14/inside-venezuelas-infamous-torture-prison-helicoide-maduro/",
    "timestamp": "2026-01-15T05:30:00Z"
  },
  {
    "title": "Chris Matthews: Democrats betting on a turnaround for ‘chaotic’ Trump, with mid-term elections set to tip the balance in their favour",
    "description": "Donald Trump didn’t wait for 2026 to begin the fight for control of Congress. In December, the president showed up at a ski resort in the Poconos, and he wasn’t there for the lovely Pennsylvania mountain scenery.",
    "link": "https://www.washingtonpost.com/opinions/2026/01/13/trump-house-republicans-democrats-midterm-election-pennsylvania/",
    "timestamp": "2026-01-15T05:30:00Z"
  },
  {
    "title": "Letters: Downward trend in cards being sent at Christmas is worrying for the most isolated and lonely",
    "description": "Fewer people now write letters, so An Post has decided to increase the price of a stamp? Surely this points to more people deciding not to put pen to paper.",
    "link": "https://www.independent.ie/opinion/letters/letters-downward-trend-in-cards-being-sent-at-christmas-is-worrying-for-the-most-isolated-and-lonely/a1929798712.html",
    "timestamp": "2026-01-15T05:30:00Z"
  },
  {
    "title": "US economic activity shows broad-based stability ahead of Fed meeting",
    "description": "US economic activity showed broad-based stability in recent weeks, with most Federal Reserve districts reporting modest growth and steady employment, according to the latest Beige Book. Price pressures remained moderate, and markets expect the Fed to hold rat…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-economic-activity-shows-broad-based-stability-ahead-of-fed-meeting/articleshow/126538921.cms",
    "timestamp": "2026-01-15T05:28:30Z"
  },
  {
    "title": "Iran closes airspace to most flights amid heightened tensions",
    "description": "Iran has temporarily closed its airspace to all flights except international civil arrivals and departures that receive prior permission, according to an official aviation notice early Thursday.",
    "link": "https://www.hurriyetdailynews.com/iran-closes-airspace-to-most-flights-amid-heightened-tensions-217847",
    "timestamp": "2026-01-15T05:26:27Z"
  },
  {
    "title": "Trump says Iran killings stopped, Tehran says 'no plan for hanging'",
    "description": "U.S. President Donald Trump said Wednesday he had been told the killings of protesters in Iran had been halted, but added that he would \"watch it and see\" about threatened military action.",
    "link": "https://www.hurriyetdailynews.com/trump-says-iran-killings-stopped-tehran-says-no-plan-for-hanging-217846",
    "timestamp": "2026-01-15T05:24:40Z"
  },
  {
    "title": "Trump places a 25% tariff on high-end computing chips, and said more duties may be coming for the semiconductor industry",
    "description": "The tariff will cover hardware central to the AI boom like Nvidia's H200 processor and AMD's MI325X chips, with some exemptions.",
    "link": "https://www.businessinsider.com/trump-tariff-high-end-computing-chip-imports-nvidia-amd-2026-1",
    "timestamp": "2026-01-15T05:23:19Z"
  },
  {
    "title": "How Donald Trump's intervention is accelerating John Harbaugh's hiring",
    "description": "In the span of just a few days, the NFL coaching landscape has shifted dramatically and one voice above all has captured attention: President Donald Trump&apos;s. \n\nAfter the Balti",
    "link": "https://www.marca.com/en/nfl/new-york-giants/2026/01/15/6968741b22601d9c288b45bc.html",
    "timestamp": "2026-01-15T05:22:24Z"
  },
  {
    "title": "Danish Officials Now Betting on U.S. Cooperation Over Greenland",
    "description": "On Wednesday, after a closed-door meeting with American officials, including Secretary of State Marco Rubio and Vice President JD Vance, Danish Foreign Minister Lars Lokke Rasmussen held a press conference. His remarks sounded cautiously optimistic. Denmark w…",
    "link": "https://freerepublic.com/focus/f-news/4362219/posts",
    "timestamp": "2026-01-15T05:15:48Z"
  },
  {
    "title": "Trump's Unconstitutional Plan to Withhold all Federal Funding From Sanctuary Cities and States",
    "description": "The plan violates multiple constituitonal provisions and goes against Supreme Court precedent. If somehow allowed to stand, it would gravely imperil federalism and the separation of powers.",
    "link": "https://reason.com/volokh/2026/01/15/trumps-unconstitutional-plan-to-withhold-all-federal-funding-from-sanctuary-cities-and-states/",
    "timestamp": "2026-01-15T05:15:03Z"
  },
  {
    "title": "Asian shares are mostly lower and oil sinks $2 after Trump says Iran stopped killings",
    "description": "Asian shares are mostly lower after Wall Street retreated on Big Tech losses",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-lower-oil-sinks-2-after-trump-129229811",
    "timestamp": "2026-01-15T05:09:45Z"
  },
  {
    "title": "Israel’s assaults on Palestinian Universities and targeting the Academic Sector",
    "description": "Protesting Israel’s assaults on Palestinian universities and its targeting of students and faculty in the occupied West Bank and Gaza",
    "link": "https://www.juancole.com/2026/01/palestinian-universities-targeting.html",
    "timestamp": "2026-01-15T05:06:40Z"
  },
  {
    "title": "US federal agent shoots Venezuelan man in Minneapolis",
    "description": "A Venezuelan national ⁠pursued by US immigration agents during a \"targeted\" traffic stop in Minneapolis was shot in the leg by a federal officer, authorities said.",
    "link": "https://www.rte.ie/news/us/2026/0115/1553182-minneapolis-us/",
    "timestamp": "2026-01-15T05:06:35Z"
  },
  {
    "title": "On Foreign Policy, Trump 2.0 Is Dangerously Unrestrained",
    "description": "The president still has time to put America first.\nThe post On Foreign Policy, Trump 2.0 Is Dangerously Unrestrained  appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/on-foreign-policy-trump-2-0-is-dangerously-unrestrained/",
    "timestamp": "2026-01-15T05:05:00Z"
  },
  {
    "title": "Beyond Boiling Point: Historic Iranian Protests Continue Despite Blackouts, Repression",
    "description": "Unverified reports suggest thousands of people may have been killed, while Trump threatens the country with military intervention",
    "link": "https://www.juancole.com/2026/01/historic-blackouts-repression.html",
    "timestamp": "2026-01-15T05:04:16Z"
  },
  {
    "title": "How Letitia James found her courage only when Jews fought back",
    "description": "In New York City, synagogues require police barricades and families hide Stars of David under their coats due to violent anti-Israel protestors, but NY's attorney general acted only against Betar, the group which fought back. Opinion.",
    "link": "https://www.israelnationalnews.com/news/420939",
    "timestamp": "2026-01-15T05:01:00Z"
  },
  {
    "title": "Visa Brings Stablecoins To $1.7 Trillion Platform In BVNK Partnership",
    "description": "Visa has partnered with BVNK to bring stablecoin payments to the Visa Direct platform, expanding its digital payments infrastructure. BVNK Will Power Visa Direct’s Stablecoin Infrastructure As announced in a Wednesday press release, BVNK and Visa have formed …",
    "link": "https://bitcoinist.com/visa-stablecoins-1-7-trillion-bvnk-partnership/",
    "timestamp": "2026-01-15T05:00:37Z"
  },
  {
    "title": "Trump says Iran has 'no plan' to execute protesters",
    "description": "The US president does not rule out military action in Iran, as Tehran temporarily shuts its airspace to nearly all flights.",
    "link": "https://www.bbc.com/news/articles/c07xpndjdd8o",
    "timestamp": "2026-01-15T04:57:26Z"
  },
  {
    "title": "Stunned RFK Jr. ‘doesn’t know how Donald Trump is alive’ with ‘unhinged’ diet of McDonald’s and Coke - NewsBreak",
    "description": "THE man tasked with keeping America healthy has a blunt verdict on the president’s menu. Robert F Kennedy Jr. says he can’t figure out how Donald Trump is",
    "link": "https://www.newsbreak.com/share/4442308839381-stunned-rfk-jr-doesn-t-know-how-donald-trump-is-alive-with-unhinged-diet-of-mcdonald-s-and-coke?_f=app_share&amp;pd=00SmdxYs&amp;lang=en_US&amp;send_time=1768452824&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.1.1.6%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-15T04:56:01Z"
  },
  {
    "title": "Trump questions Reza Pahlavi’s ability to garner support in Iran",
    "description": "President Donald Trump said Iranian opposition figure Reza Pahlavi \"seems very nice\" while also expressing uncertainty as to whether he could lead Iran.",
    "link": "https://nypost.com/2026/01/14/world-news/trump-questions-reza-pahlavis-ability-to-garner-support-in-iran/",
    "timestamp": "2026-01-15T04:55:30Z"
  }
]