[
  {
    "title": "Trump: I warned Netanyahu not to attack Iran, 'it is not appropriate'",
    "description": "Trump cautioned Netanyahu against attacking Iran after a reportedly 'tense' phone call, while his envoy Witkoff hinted at an imminent Gaza cease-fire proposal he was 'feeling good about'",
    "link": "https://www.haaretz.com/us-news/2025-05-28/ty-article/.premium/trump-i-warned-netanyahu-not-to-attack-iran-it-is-not-appropriate/00000197-186a-d57f-a7d7-3eea52280000",
    "timestamp": "2025-05-28T20:18:15Z"
  },
  {
    "title": "Trump pardons Julie and Todd Chrisley, reality TV stars convicted in 2022 of fraud and tax evasion",
    "description": "It's the latest pardon for high-profile friends, supporters, donors and former staffers.",
    "link": "https://www.bostonherald.com/2025/05/28/trump-pardons-chrisleys/",
    "timestamp": "2025-05-28T20:17:20Z"
  },
  {
    "title": "Much Ado About MAHA: Fallout From New Report On Childhood Disease",
    "description": "This week’s Fresh Take newsletter also covers a new podcast from Under 30 alums Farm To People, the latest on No Tax On Tips, the future of banana farming and more.",
    "link": "https://www.forbes.com/sites/chloesorvino/2025/05/28/much-ado-about-maha-fallout-from-new-report-on-childhood-disease/",
    "timestamp": "2025-05-28T20:14:00Z"
  },
  {
    "title": "E.l.f. Beauty to acquire Hailey Bieber skincare brand Rhode in up to $1 billion deal",
    "description": "E.l.f. Beauty is acquiring Hailey Bieber's skincare brand Rhode for up to $1 billion as it looks to reach higher-income shoppers.",
    "link": "https://www.cnbc.com/2025/05/28/elf-beauty-to-acquire-hailey-bieber-brand-rhode-in-1-billion-deal.html",
    "timestamp": "2025-05-28T20:13:28Z"
  },
  {
    "title": "Trump Suggests Harvard Should Have A 15% Cap On International Students",
    "description": "President Trump ratcheted up the pressure against Harvard Wednesday, suggesting the institution should have a 15% cap on the number of foreign students it enrolls.",
    "link": "https://www.forbes.com/sites/michaeltnietzel/2025/05/28/trump-suggests-harvard-should-have-a-15-cap-on-international-students/",
    "timestamp": "2025-05-28T20:12:59Z"
  },
  {
    "title": "Trump Unloads on Reporter Who Asked if He 'Chickens Out' on Tariffs",
    "description": "Trump erupted when a reporter asked him about \"TACO trade,\" a Wall Street term that stands for \"Trump Always Chickens Out.\"",
    "link": "https://www.newsweek.com/trump-reporter-taco-trade-wall-street-tariffs-2078191",
    "timestamp": "2025-05-28T20:12:29Z"
  },
  {
    "title": "US Tightens China Chip Curbs by Targeting Design Software",
    "description": "The Trump administration is moving to restrict the sale of chip design software to China, people familiar with the matter said, as the US government evaluates a broader policy announcement on the issue.",
    "link": "https://www.livemint.com/companies/news/us-tightens-china-chip-curbs-by-targeting-design-software-11748463095660.html",
    "timestamp": "2025-05-28T20:11:35Z"
  },
  {
    "title": "Karoline Leavitt: Trump wants 'less LGBTQ graduate majors' from Harvard",
    "description": "First it was allegations of \"anti-Semitism.\" Then it was to end \"DEI\" programs. Now, the Trump Administration seemingly has a new reason to target Harvard University — \"LGBTQ graduate majors.\"",
    "link": "https://www.advocate.com/politics/karoline-leavitt-harvard-lgbtq-majors",
    "timestamp": "2025-05-28T20:11:13Z"
  },
  {
    "title": "Chloe Chrisley, 12, 'Doesn't Want to Get Her Hopes Up' for Parents' Pardon",
    "description": "Savannah Chrisley’s younger sister, Chloe Chrisley, is trying to be cautious about their parents Todd and Julie Chrisley’s recent presidential pardon. “Chloe, I think, is still in shock. She doesn’t want to get her hopes up because she feels like something ba…",
    "link": "https://www.usmagazine.com/celebrity-news/news/chloe-chrisley-doesnt-want-hopes-up-about-todd-and-julies-release/#article",
    "timestamp": "2025-05-28T20:11:11Z"
  },
  {
    "title": "トランプ氏、関税政策で「尻込み」などしない－ウォール街に反論",
    "description": "A Donald Trump 2024 campaign hat on the floor of the New York Stock Exchange. Photographer: Michael Nagle/Bloomberg トランプ米大統領は、同らの強硬な関税の脅しを結局は実行に移さないとウォール街がみているとの指摘にいら立ちを示し、これまでの度重なる姿勢軟化は貿易面で譲歩を引き出すための戦略的な動き...",
    "link": "https://www.bloomberg.co.jp/news/articles/2025-05-28/SWZF80T0AFB400",
    "timestamp": "2025-05-28T20:10:11Z"
  },
  {
    "title": "Trump nominates one of his former personal attorneys for prestigious federal appeals court seat (Hannah Rabinowitz/CNN)",
    "description": "Hannah Rabinowitz / CNN:\nTrump nominates one of his former personal attorneys for prestigious federal appeals court seat  —  President Donald Trump has nominated Emil Bove, one of his former personal attorneys and now a top Justice Department official, to be …",
    "link": "https://www.memeorandum.com/250528/p100",
    "timestamp": "2025-05-28T20:10:00Z"
  },
  {
    "title": "RFK Jr. Denigrates Privately Funded Medical Research",
    "description": "President Donald Trump's second administration has targeted government spending in various forms. One example is federal funding for medical research: Trump has cut at least $1.8 billion in funding for grants from the National Institutes of Health (NIH), acco…",
    "link": "https://biztoc.com/x/e245af6dd40b727c",
    "timestamp": "2025-05-28T20:09:38Z"
  },
  {
    "title": "Harvard ends legal battle over early photos of enslaved people, agrees to relinquish images",
    "description": "A lawyer says the images will be transferred to a South Carolina museum devoted to African American history with a woman who says she is one of the subjects' descendants.",
    "link": "https://www.pbs.org/newshour/nation/harvard-ends-legal-battle-over-early-photos-of-enslaved-people-agrees-to-relinquish-images",
    "timestamp": "2025-05-28T20:09:23Z"
  },
  {
    "title": "Trump says he will negotiate his budget bill after Musk’s criticism",
    "description": "President Donald Trump said on Wednesday that he plans to negotiate aspects of the “big, beautiful” tax bill, expressing dissatisfaction with certain provisions while being satisfied with others.\nHis comments followed billionaire Elon Musk’s criticism a day e…",
    "link": "https://biztoc.com/x/f99205101442702c",
    "timestamp": "2025-05-28T20:09:19Z"
  },
  {
    "title": "US files motion to dismiss lawsuit over Kilmar Abrego Garcia’s deportation",
    "description": "The administration argues the court lacks jurisdiction because he’s no longer in the United States.",
    "link": "https://www.bostonherald.com/2025/05/28/deportation-mistake-motion-to-dismiss/",
    "timestamp": "2025-05-28T20:09:09Z"
  },
  {
    "title": "Illegal immigrant with rap sheet arrested after allegedly threatening to assassinate Trump in handwritten letter",
    "description": "Mexican national with multiple illegal entries and prior arrests vowed to 'shoot the president in his head.'",
    "link": "https://nypost.com/2025/05/28/us-news/illegal-immigrant-arrested-after-allegedly-threatening-to-assassinate-trump-in-letter/",
    "timestamp": "2025-05-28T20:09:03Z"
  },
  {
    "title": "Dem Rep. Meeks: Trump Trying to Destroy 'Fabric of America' to Be 'King'",
    "description": "Representative Gregory Meeks (D-NY) said Wednesday on CNN's \"News Central\" that President Donald Trump was trying to destroy the \"fabric of America\" so he could be a king.\nThe post Dem Rep. Meeks: Trump Trying to Destroy ‘Fabric of America’ to Be ‘King’ appea…",
    "link": "https://www.breitbart.com/clips/2025/05/28/dem-rep-meeks-trump-trying-to-destroy-fabric-of-america-to-be-king/",
    "timestamp": "2025-05-28T20:09:01Z"
  },
  {
    "title": "Trump Loses It When Asked About ‘Chickening Out’ on Tariffs",
    "description": "President Donald Trump lashed out at a reporter after being asked about the TACO (Trump Always Chickens Out) trades and his waffling tariff policy.",
    "link": "http://www.rollingstone.com/politics/politics-news/taco-trades-trump-loses-it-tariff-waffling-1235349701/",
    "timestamp": "2025-05-28T20:08:59Z"
  },
  {
    "title": "Trump taps controversial top DOJ official for federal circuit court vacancy",
    "description": "Donald Trump announced he will tap Emil Bove, his former personal lawyer-turned-top Department of Justice official, to serve as a federal appeals court judge.",
    "link": "https://abcnews.go.com/Politics/trump-taps-controversial-top-doj-official-federal-circuit/story?id=122282435",
    "timestamp": "2025-05-28T20:08:58Z"
  },
  {
    "title": "Elon Musk Turns on Trump, Slams His Huge Bill",
    "description": "In a turn against his former number one ally, billionaire Elon Musk has heavily criticized president Donald Trump's so-called \"big, beautiful bill.\" In an interview with CBS over the weekend, Musk said that he's \"disappointed\" by the price tag of the bill, ar…",
    "link": "https://futurism.com/elon-musk-turns-on-trump-bill",
    "timestamp": "2025-05-28T20:07:21Z"
  },
  {
    "title": "Trump gets asked about Wall Street's 'TACO Trade.' He doesn't like it",
    "description": "President Donald Trump would prefer not to talk about TACO — an acronym for “Trump Always Chickens Out,” a term coined by Robert Armstrong of the Financial Times. Read more...",
    "link": "https://qz.com/trump-taco-chickens-out-tariffs-financial-times-1851782808",
    "timestamp": "2025-05-28T20:07:00Z"
  },
  {
    "title": "Pressed on his new student visa policy, Trump seems unaware of basic details",
    "description": "Asked about his administration's new student visa policy, Donald Trump seemed unsure what she was talking about. This happens with unsettling frequency.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pressed-new-student-visa-policy-trump-seems-unaware-basic-details-rcna209565",
    "timestamp": "2025-05-28T20:06:56Z"
  },
  {
    "title": "ICE Arrests Illegal Migrant Who Allegedly Threatened To Kill Trump",
    "description": "Immigration authorities arrested an illegal migrant after he allegedly sent a threatening letter declaring he would shoot President Donald Trump in the head.",
    "link": "https://dailycaller.com/2025/05/28/illegal-migrant-threatened-to-shoot-trump/",
    "timestamp": "2025-05-28T20:05:52Z"
  },
  {
    "title": "Trump says he's not 'chickening out' on trade: 'It's called negotiation'",
    "description": "President Donald Trump on Wednesday slammed allegations that he is chickening out during trade discussions, instead framing ...",
    "link": "https://biztoc.com/x/caa674f32d325aab",
    "timestamp": "2025-05-28T20:05:10Z"
  },
  {
    "title": "First Buddies No More?: Elon Musk Breaks Publicly With Trump On One Big Beautiful Bill",
    "description": "Elon Musk expressed disappointment with the \"big beautiful bill\"— policy Trump called \"arguably the most significant piece of legislation that will ever be signed.\"",
    "link": "https://www.forbes.com/sites/forbestv/2025/05/28/first-buddies-no-more-elon-musk-breaks-publicly-with-trump-on-one-big-beautiful-bill/",
    "timestamp": "2025-05-28T20:04:53Z"
  },
  {
    "title": "Trump pardons ex-Staten Island and Brooklyn GOP Rep. Michael Grimm",
    "description": "President Trump has pardoned former Staten Island and Brooklyn GOP Rep. Michael Grimm, two White House sources tell The Post.",
    "link": "https://nypost.com/2025/05/28/us-news/trump-pardons-ex-staten-island-rep-michael-grimm/",
    "timestamp": "2025-05-28T20:04:24Z"
  },
  {
    "title": "Trump Gives Lesson On Negotiation Tactics To Reporter Who Asked ‘Nasty Question’ About His Tariff Strategy",
    "description": "President Donald Trump retorted a reporter's \"nasty question\" on whether he is \"chickening out\" on tariff policy during a Wednesday event.",
    "link": "https://dailycaller.com/2025/05/28/trump-reporter-negotiation-tariffs-chicken-out/",
    "timestamp": "2025-05-28T20:04:07Z"
  },
  {
    "title": "Stumblebum’s Legacy",
    "description": "“Every time I watch The View, I become even more misogynistic.” — Laura Loomer Bad as it was, “Joe Biden,” the figment president, was merely one manifestation of a nation made mad by power-seeking demons, real-live, ill-intentioned human beings driving a runa…",
    "link": "https://www.activistpost.com/stumblebums-legacy/",
    "timestamp": "2025-05-28T20:03:00Z"
  },
  {
    "title": "Trump’s ‘Golden Dome’ system is an expensive way to make America less safe",
    "description": "President Donald Trump boasted of the inclusion of the “Golden Dome” missile defense program in the One Big Beautiful Bill Act, which the House narrowly passed.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-golden-dome-missile-defense-nuclear-rcna208521",
    "timestamp": "2025-05-28T20:02:56Z"
  },
  {
    "title": "Trump slams a new Wall Street acronym referring to his reversals on tariffs (Ali Bianco/Politico)",
    "description": "Ali Bianco / Politico:\nTrump slams a new Wall Street acronym referring to his reversals on tariffs  —  The president isn't a fan of the TACO trade.  —  Wall Street has a new shorthand about President Donald Trump — and he's not happy about it.  —  Traders hav…",
    "link": "https://www.memeorandum.com/250528/p98",
    "timestamp": "2025-05-28T20:00:30Z"
  },
  {
    "title": "Iran May Pause Enrichment for Nuke Rights, Thawed Funds",
    "description": "Iran is reportedly prepared to halt its uranium enrichment at 60% purity, which is just below weapons-grade, in what media is viewing as a potential breakthrough in indirect nuclear talks with the United States, according to a Reuters exclusive.  In exchange,…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Iran-May-Pause-Enrichment-for-Nuke-Rights-Thawed-Funds.html",
    "timestamp": "2025-05-28T20:00:00Z"
  },
  {
    "title": "5 Big Ways Trump's 'Big, Beautiful Bill' Will Especially Hurt Black Folks",
    "description": "Photo: Kayla Bartkowski (Getty Images)\r\nPresident Donald Trump has been talking about his “big, beautiful bill” for months, and now Americans are on edge to see just how his proposed plan will affect their daily lives. The federal spending bill has drawn bipa…",
    "link": "https://www.theroot.com/5-big-ways-trumps-big-beautiful-bill-will-especially-h-1851782778",
    "timestamp": "2025-05-28T20:00:00Z"
  },
  {
    "title": "US authorities arrest Mexican immigrant who allegedly threatened to shoot Trump",
    "description": "WASHINGTON (Reuters) -U.S. immigration authorities arrested a Mexican immigrant who allegedly threatened to shoot President Donald Trump, the U.S. Department of Homeland Security said on Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/29/us-authorities-arrest-mexican-immigrant-who-allegedly-threatened-to-shoot-trump",
    "timestamp": "2025-05-28T20:00:00Z"
  },
  {
    "title": "EXCLUSIVE: See How Amber Rose Has Gone From Kanye West's 'Puppet' to Her Own Woman",
    "description": "Amber Rose skyrocketed to fame after she starred in the music video in 2008, and since then, she's had a drastic transformation over the years.",
    "link": "https://okmagazine.com/p/amber-rose-transformation-photos/",
    "timestamp": "2025-05-28T20:00:00Z"
  },
  {
    "title": "Trump launches attack on knowledge, targets Harvard, public health data and media",
    "description": "Chris Hayes breaks down Trump's war on knowledge, as the administration continues to target higher education, public health data, and the news media.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-attacks-knowledge-harvard-science-media-rcna209505",
    "timestamp": "2025-05-28T19:59:21Z"
  },
  {
    "title": "Trump orders US chip designers to stop selling to China",
    "description": "Donald Trump orders US chip software suppliers to stop selling to China\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade war, follow the latest on tariffs a…",
    "link": "https://biztoc.com/x/f2b5df2913bc07c6",
    "timestamp": "2025-05-28T19:58:28Z"
  },
  {
    "title": "Trump pardons Michael Grimm, former NY congressman who pleaded guilty to tax evasion | CNN Politics",
    "description": "President Donald Trump has pardoned Michael Grimm, the former New York congressman who served seven months in prison for tax evasion in 2015, according to a White House official.",
    "link": "https://www.cnn.com/2025/05/28/politics/trump-pardon-grimm-ny-congress",
    "timestamp": "2025-05-28T19:57:01Z"
  },
  {
    "title": "Mark Carney pressed on lack of spring budget in first question period as prime minister",
    "description": "Carney insisted that his 'new government' would act immediately to grow the economy and support 'nation-building projects'",
    "link": "https://nationalpost.com/news/mark-carney-pressed-on-lack-of-spring-budget-in-first-question-period-as-prime-minister",
    "timestamp": "2025-05-28T19:56:21Z"
  },
  {
    "title": "Duffy urges Senate to pass Big Beautiful Bill's $12.5B air traffic system fix",
    "description": "Transportation Secretary Duffy said the U.S. air traffic system is antiquated and urged the Senate to pass the Big Beautiful Bill which has $12.5 billion earmarked for system upgrades.",
    "link": "https://www.foxnews.com/us/duffy-urges-senate-pass-big-beautiful-bills-12-5b-air-traffic-system-fix",
    "timestamp": "2025-05-28T19:56:14Z"
  },
  {
    "title": "Antony Starr didn't expect 'The Boys' fans to glorify Homelander",
    "description": "'The Boys' star Anthony Starr is still surprised by fans glorifying Homelander's sadistic tendencies: 'This guy is not the hero of any story.'",
    "link": "https://ew.com/the-boys-antony-starr-fans-glorifying-homelander-11742692",
    "timestamp": "2025-05-28T19:56:08Z"
  },
  {
    "title": "Trump says Harvard should cap foreign enrollment, provide student list",
    "description": "US president says Harvard must 'show us their list' of foreign students to make sure they are not 'troublemakers'.",
    "link": "https://www.aljazeera.com/news/2025/5/28/trump-says-harvard-should-cap-foreign-enrollment-provide-student-list",
    "timestamp": "2025-05-28T19:56:01Z"
  },
  {
    "title": "Trump says he will meet with Putin, Zelenskyy 'if necessary' amid negotiations to end war",
    "description": "President Donald Trump's willingness to come to the table comes just after he condemned Russia’s recent large-scale strike against Ukraine.",
    "link": "https://www.foxnews.com/politics/trump-says-he-meet-putin-zelenskyy-if-necessary-amid-negotiations-end-war",
    "timestamp": "2025-05-28T19:56:00Z"
  },
  {
    "title": "Trump gets angry at reporter over “TACO Trade” tariff question, here's what happened",
    "description": "Donald Trump got upset when a reporter asked about a Wall Street term saying he backs off from tariffs. He said it’s just part of his negotiation style and defended his trade moves with China and the EU.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-gets-angry-at-reporter-over-taco-trade-tariff-question-here-what-happened/articleshow/121473892.cms",
    "timestamp": "2025-05-28T19:55:53Z"
  },
  {
    "title": "President Trump Participates in Swearing-In Ceremony for Interim DC Attorney Jeanine Pirro – W/ Media Presser",
    "description": "President Donald Trump participates in the swearing-in ceremony for Interim USAO for the DC office, Jeanine Pirro. The media question segment begins at 8:45 of the video below and there is a lot of news within the press portion. The first question surrounds R…",
    "link": "https://freerepublic.com/focus/f-news/4319617/posts",
    "timestamp": "2025-05-28T19:55:43Z"
  },
  {
    "title": "Oil Rises Amid Sanctions Risk",
    "description": "Threats to Iran talks and OPEC+ output uncertainty fueled bullish sentiment, despite lingering oversupply concerns.",
    "link": "https://www.rigzone.com/news/wire/oil_rises_amid_sanctions_risk-28-may-2025-180672-article/",
    "timestamp": "2025-05-28T19:55:35Z"
  },
  {
    "title": "Abortion Appointments Suddenly Canceled After Missouri Court Ruling",
    "description": "The ruling upended reproductive rights in Missouri just months after voters approved an amendment to protect abortion access.",
    "link": "https://www.newsweek.com/abortion-appointments-canceled-missouri-court-ruling-2078158",
    "timestamp": "2025-05-28T19:53:44Z"
  },
  {
    "title": "The TACO trade is the new Trump trade. Here's what to know about the meme ruling the stock market. - Business Insider",
    "description": "The TACO trade is the new Trump trade. Here's what to know about the meme ruling the stock market.Business Insider Trump slams a new Wall Street acronym referring to his reversals on tariffsPolitico Trump Bristles at ‘TACO Trade’ That Bets On Him Backing Down…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177836953",
    "timestamp": "2025-05-28T19:52:56Z"
  },
  {
    "title": "Trump Says He Will Consider Pardoning Men Convicted In Kidnapping Plot Of Gov. Whitmer",
    "description": "“It looked to me like somewhat of a railroad job,” he said of the case against the men, which the DOJ’s newly appointed pardon attorney has also called \"very suspect.\"",
    "link": "https://www.huffpost.com/entry/trump-pardons-gretchen-whitmer-kidnapping_n_68374c8ae4b004530c6994c7",
    "timestamp": "2025-05-28T19:52:08Z"
  },
  {
    "title": "RFK Jr. Denigrates Privately Funded Medical Research",
    "description": "President Donald Trump's second administration has targeted government spending in various forms. One example is federal funding for medical research:",
    "link": "https://reason.com/2025/05/28/rfk-jr-denigrates-privately-funded-medical-research/",
    "timestamp": "2025-05-28T19:51:57Z"
  },
  {
    "title": "JD Vance declares ‘Operation Chokepoint 2.0’ dead, pledges crypto market clarity",
    "description": "US Vice President JD Vance on May 28 said Operation Chokepoint 2.0 is “dead,” using his address at the 2025 Bitcoin Conference in Las Vegas to declare the end of federal regulatory actions that targeted the crypto sector and the beginning of legislative suppo…",
    "link": "https://cryptoslate.com/jd-vance-declares-operation-chokepoint-2-0-dead-pledges-crypto-market-clarity/",
    "timestamp": "2025-05-28T19:51:45Z"
  },
  {
    "title": "Trump Seems to Have No Idea What’s Happening With Student Visas",
    "description": "Donald Trump doesn’t seem to be aware of his own administration’s new restrictions on student visas. \r\nWhen asked by a reporter when the U.S. would resume interviews for student visas, which were halted Tuesday, the president was clueless.  \r\n“When do you thi…",
    "link": "https://newrepublic.com/post/195820/trump-no-idea-student-visa-interviews",
    "timestamp": "2025-05-28T19:50:30Z"
  },
  {
    "title": "The Most Controversial Presidential Pardons Ever — and How They Work",
    "description": "One of the many headlines President Donald Trump made in May 2025 was his announcement that he would grant full pardons to embattled reality stars Todd Chrisley and Julie Chrisley in their fraud and tax evasion cases — though he’s far from the first president…",
    "link": "https://www.usmagazine.com/celebrity-news/news/most-controversial-presidential-pardons-ever-explained/#article",
    "timestamp": "2025-05-28T19:49:47Z"
  },
  {
    "title": "Top Dems Say Trump Admin Is Deliberately Hiding How It's Spending Taxpayer Dollars",
    "description": "Top Trump administration officials have spoken at length about alleged irresponsible government use of taxpayer dollars and a lack of transparency at federal agencies, with President Donald Trump and his billionaire ally, Elon Musk, focusing heavily during th…",
    "link": "https://www.commondreams.org/news/trump-omb-memo",
    "timestamp": "2025-05-28T19:48:16Z"
  },
  {
    "title": "'No one voted to deport moms': Pro-Trump town regrets its choice",
    "description": "A Missouri town that voted overwhelmingly for Donald Trump in the 2024 election has come to regret its choice after a beloved neighbor was detained by ICE, according to The New York Times.In the farming town of Kennett, MO, population 10,000, Times reporter J…",
    "link": "https://www.rawstory.com/trump-deportation-2672224399/",
    "timestamp": "2025-05-28T19:48:16Z"
  },
  {
    "title": "Yale Dean Emails Everyone Anti-Trump Essay: \"I Know You Share My Concern\"",
    "description": "Yale Dean Emails Everyone Anti-Trump Essay: \"I Know You Share My Concern\"\n \nAuthored by Ibrahim Garza via The College Fix,\nA Yale University dean emailed the entire Divinity School a copy of his MSNBC essay criticizing President Donald Trump, according to an …",
    "link": "https://biztoc.com/x/cb16e8d00173d3c3",
    "timestamp": "2025-05-28T19:47:21Z"
  },
  {
    "title": "US said to tell chip designers to stop business with China",
    "description": "The administration of United States President Donald Trump issued a directive to American companies that make software for designing semiconductors to stop offering their services to China, the Financ...",
    "link": "https://biztoc.com/x/e056588f5ab580cb",
    "timestamp": "2025-05-28T19:47:10Z"
  },
  {
    "title": "Trump to Fully Shutter Key News Agency as Legal Battle Rages On",
    "description": "Donald Trump is planning to kill Voice Of America and replace it with a MAGA propaganda machine.\r\nThe remaining 800 employees at the federally funded, award-winning newsroom are expecting to receive termination notices as soon as Wednesday, multiple unnamed s…",
    "link": "https://newrepublic.com/post/195818/donald-trump-fully-shutter-voice-of-america",
    "timestamp": "2025-05-28T19:46:43Z"
  },
  {
    "title": "Stellantis (STLA) Picks Antonio Filosa as CEO Amid Sales Slump and Tariff Risks",
    "description": "Stellantis faces a 14% revenue drop and uncertainty from Trump-era tariff shifts.",
    "link": "https://finance.yahoo.com/news/stellantis-stla-picks-antonio-filosa-194344861.html",
    "timestamp": "2025-05-28T19:43:44Z"
  },
  {
    "title": "Newt Gingrich Mixes it Up With Gavin Newsom On Trump’s Fake Gaza Condoms Story",
    "description": "Newt Gingrich advised Gavin Newsom to take the good with the bad after Newsom reminded him of Trump pushing a fake story about condoms being sent to Gaza.\nThe post Newt Gingrich Mixes it Up With Gavin Newsom On Trump’s Fake Gaza Condoms Story first appeared o…",
    "link": "https://www.mediaite.com/media/podcasts/newt-gingrich-mixes-it-up-with-gavin-newsom-on-trumps-fake-gaza-condoms-story/",
    "timestamp": "2025-05-28T19:43:30Z"
  },
  {
    "title": "Mexican president invited but undecided on attending G7 summit in Alberta",
    "description": "OTTAWA — Mexican President Claudia Sheinbaum said Wednesday Canada has invited her to attend the G7 leaders’ summit next month in Alberta but she hasn’t decided yet if she’ll attend. At her morning press briefing, Sheinbaum said Prime Minister Mark Carney ext…",
    "link": "https://financialpost.com/pmn/mexican-president-invited-but-undecided-on-attending-g7-summit-in-alberta",
    "timestamp": "2025-05-28T19:41:45Z"
  },
  {
    "title": "Trump Touts ‘Good Talks With Iran,’ But Not Without Skepticism",
    "description": "The U.S. is engaged in “some very good talks with Iran,” President Donald Trump told reporters in the Oval Office on Wednesday, adding: “We’ll find... Read More\nThe post Trump Touts ‘Good Talks With Iran,’ But Not Without Skepticism appeared first on The Dail…",
    "link": "https://www.dailysignal.com/2025/05/28/trump-touts-good-talks-iran-but-not-without-skepticism/",
    "timestamp": "2025-05-28T19:40:05Z"
  },
  {
    "title": "Trump to pardon Todd and Julie Chrisley, the reality TV couple convicted of fraud, tax evasion (Zoë Richards/NBC News)",
    "description": "Zoë Richards / NBC News:\nTrump to pardon Todd and Julie Chrisley, the reality TV couple convicted of fraud, tax evasion  —  The celebrity pair, known for their roles on the TV show “Chrisley Knows Best,” sought pardons from Trump in February.  —  President Do…",
    "link": "https://www.memeorandum.com/250528/p95",
    "timestamp": "2025-05-28T19:40:00Z"
  },
  {
    "title": "GOP rejects ‘millionaire tax’ pitch, advancing breaks for rich Americans",
    "description": "Legislation moving through Congress includes breaks for the upper and middle classes as the House rebuffs President Donald Trump’s suggestions.House Republicans rejected a push by some allies of President Donald Trump to include tax hikes on the rich in sweep…",
    "link": "https://freerepublic.com/focus/f-news/4319612/posts",
    "timestamp": "2025-05-28T19:38:46Z"
  },
  {
    "title": "Trump tells US chip designers to stop selling to China, FT reports",
    "description": "Electronic Design Automation groups, which include Cadence, Synopsys and Siemens EDA, were told by the Commerce Department to stop supplying their tech, the ...",
    "link": "https://finance.yahoo.com/news/trump-tells-us-chip-designers-193709146.html",
    "timestamp": "2025-05-28T19:37:09Z"
  },
  {
    "title": "A Federal Judge Lists 8 Ways That Trump Violated the Constitution by Punishing a Disfavored Law Firm",
    "description": "The president's crusade against attorneys whose work offends him, which defies the First Amendment and undermines the right to counsel, has resulted in a series of judicial rebukes.",
    "link": "https://reason.com/2025/05/28/a-federal-judge-lists-8-ways-that-trump-violated-the-constitution-by-punishing-a-disfavored-law-firm/",
    "timestamp": "2025-05-28T19:36:35Z"
  },
  {
    "title": "Trump Short-Circuits Over Wall Street's 'TACO' Slogan: 'Trump Always Chickens Out'",
    "description": "\"Don't ever say what you said,\" President Donald Trump told a reporter when asked about Wall Street's new saying. \"That’s a nasty question.\"",
    "link": "https://www.huffpost.com/entry/trump-always-chickens-out-wall-street_n_68375111e4b0bbf4d2f32fcf",
    "timestamp": "2025-05-28T19:36:26Z"
  },
  {
    "title": "Marco Rubio says the State Department won’t schedule any new visa interviews for international students as Trump’s battles with American universities intensify",
    "description": "New State Department guidance on visa applications is adding to scrutiny of international students that has intensified under President Donald Trump, who has leveraged control of foreign enrollment to press his demands with American colleges.\nIn a cable sent …",
    "link": "https://biztoc.com/x/d89b431999054279",
    "timestamp": "2025-05-28T19:35:40Z"
  },
  {
    "title": "Elon Musk has to work 40 hours a week at Tesla, top investors say",
    "description": "Show up for work and do your job — that’s what 12 large pension funds, representing $950 billion in assets, told Tesla (TSLA) CEO Elon Musk in an open letter, where they demanded he work 40 hours a week at the EV giant.Read more...",
    "link": "https://qz.com/elon-musk-tesla-investor-letter-demands-1851782779",
    "timestamp": "2025-05-28T19:35:00Z"
  },
  {
    "title": "Trump’s Crackdown Sends Corporate Diversity Jobs Plummeting, New Data Reveals",
    "description": "It’s a tough time to be a DEI practitioner in America, as new employment research produced for NPR reveals significant job losses in the sector.",
    "link": "https://dailycaller.com/2025/05/28/trump-crackdown-corporate-diversity-jobs-plummeting-new-data-dei-corporate-america/",
    "timestamp": "2025-05-28T19:34:57Z"
  },
  {
    "title": "Top Trump Admin Official Says a Big-Name Democrat 'Controlled the Autopen' During Biden Presidency",
    "description": "Top Trump Admin Official Says a Big-Name Democrat 'Controlled the Autopen' During Biden Presidencywesternjournal.com",
    "link": "https://www.westernjournal.com/top-trump-admin-official-says-big-name-democrat-controlled-autopen-biden-presidency/",
    "timestamp": "2025-05-28T19:34:32Z"
  },
  {
    "title": "Hall of Famers. A Heisman winner. An MMA fighter. Tuberville is not the only sports politician",
    "description": "Tommy Tuberville is a U.S. senator running for Alabama governor",
    "link": "https://abcnews.go.com/Politics/wireStory/hall-famers-heisman-winner-mma-fighter-tuberville-sports-122282759",
    "timestamp": "2025-05-28T19:34:28Z"
  },
  {
    "title": "FDRA Pushes Trump For Relief as Vietnam Tariff Talks Resume in June",
    "description": "Bilateral trade talks between US and Vietnam to resume early June as FDRA reminds Trump administration that footwear needs strategic tariff relief.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/us-vietnam-trade-talks-fdra-footwear-tariff-relief-1237822172/",
    "timestamp": "2025-05-28T19:32:55Z"
  },
  {
    "title": "Bruce Springsteen Is Under Attack by Trump. These Are All the Artists Supporting Him",
    "description": "From Bono to Neil Young, all the artists supporting Bruce Springsteen in his feud with Trump.",
    "link": "http://www.rollingstone.com/music/music-features/springsteen-vs-trump-all-artists-supporting-bruce-1235349389/",
    "timestamp": "2025-05-28T19:32:09Z"
  },
  {
    "title": "CNN's Jake Tapper Faces Criticism Over Demanding Trump's Health Records",
    "description": "\"How dare Jake Tapper try to lecture us on this sort of thing. He has no credibility in this discussion.\"",
    "link": "https://mrctv.org/blog/mrctvstaff/tapper-calls-trump-health-info-mrcs-bozell-calls-out-tapper-bs-siriusxm",
    "timestamp": "2025-05-28T19:30:37Z"
  },
  {
    "title": "Trump nominates former defense attorney Emil Bove for federal appeals court vacancy",
    "description": "President Donald Trump has nominated Emil Bove to serve on the U.S. Court of Appeals for the Third Circuit.",
    "link": "https://www.foxnews.com/politics/trump-nominates-former-defense-attorney-emil-bove-federal-appeals-court-vacancy",
    "timestamp": "2025-05-28T19:30:34Z"
  },
  {
    "title": "NPR CEO Refuses To Negotiate With Trump as Network Sues President Over Defunding",
    "description": "NPR will not negotiate with President Donald Trump, CEO Katherine Maher said Tuesday as the network sued Trump over his executive order stripping NPR of all federal funding.\nThe post NPR CEO Refuses To Negotiate With Trump as Network Sues President Over Defun…",
    "link": "https://freebeacon.com/latest-news/npr-ceo-refuses-to-negotiate-with-trump-as-network-sues-president-over-defunding/",
    "timestamp": "2025-05-28T19:30:28Z"
  },
  {
    "title": "Apple’s difficult 2025 is Tim Cook’s biggest test yet",
    "description": "Apple CEO Tim Cook is contending with a host of serious issues at once, ranging from antitrust fights to souring relationship with President Trump.",
    "link": "https://finance.yahoo.com/news/apples-difficult-2025-is-tim-cooks-biggest-test-yet-193007489.html",
    "timestamp": "2025-05-28T19:30:07Z"
  },
  {
    "title": "Trump Bristles at ‘TACO Trade’ That Bets on Him Backing Down",
    "description": "President Donald Trump bristled at suggestions that Wall Street believes he’s ultimately unwilling to follow through on extreme tariff threats, saying his repeated retreats are instead part of a strategy to exert trade concessions.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-bristles-at-taco-trade-that-bets-on-him-backing-down",
    "timestamp": "2025-05-28T19:28:48Z"
  },
  {
    "title": "Education secretary Linda McMahon urges universities to align with Trump administration for federal funding",
    "description": "US Education Secretary Linda McMahon suggested that universities should align with the Trump administration's goals to continue receiving federal funding. This statement follows the administration's decision to cut funding to Harvard University, citing non-co…",
    "link": "https://economictimes.indiatimes.com/news/international/us/education-secretary-linda-mcmahon-urges-universities-to-align-with-trump-administration-for-federal-funding-us-education-funding-news/articleshow/121472723.cms",
    "timestamp": "2025-05-28T19:27:30Z"
  },
  {
    "title": "GOP Lawmaker Insists 'We Need to Listen to Putin' as Trump Admin Works on Russia-Ukraine Talks",
    "description": "Rep. Mark Green urged people to listen to president Donald Trump and Vladimir Putin as tensions escalate amid the ongoing Russia-Ukraine talks.",
    "link": "https://www.ibtimes.com/gop-lawmaker-insists-we-need-listen-putin-trump-admin-works-russia-ukraine-talks-3774745",
    "timestamp": "2025-05-28T19:27:09Z"
  },
  {
    "title": "BMO reports rise in profit even as companies remain hesitant on borrowing",
    "description": "TORONTO — BMO Financial Group’s second-quarter profit rose from a year ago even as its Canadian banking and capital markets divisions saw income drop from tariff-related uncertainty. The bank on Wednesday reported a net income of $1.96 billion, up from $1.87 …",
    "link": "https://financialpost.com/pmn/bmo-reports-rise-in-profit-even-as-companies-remain-hesitant-on-borrowing-2",
    "timestamp": "2025-05-28T19:26:21Z"
  },
  {
    "title": "'Unbelievable carnage': Bono explodes over Trump's move to kill foreign aid",
    "description": "Irish singer-songwriter and U2 frontman Bono tore into President Donald Trump in an interview with Esquire over the administration's decimation of foreign aid programs.Bono, who has been involved in social and political causes around the world for decades and…",
    "link": "https://www.rawstory.com/bono-foreign-aid-aids/",
    "timestamp": "2025-05-28T19:26:10Z"
  },
  {
    "title": "Visa application pause 'will be felt in every corner' of US",
    "description": "Even a short-term pause on new student visa interview appointments could have major economic consequences and leave many uncertain about pursuing studies or careers in the United States. The US State Department has put student visa processing on hold followin…",
    "link": "https://www.dw.com/en/visa-application-pause-will-be-felt-in-every-corner-of-us/a-72702429",
    "timestamp": "2025-05-28T19:26:00Z"
  },
  {
    "title": "BigLaw firms defend pro bono deals with Trump as they handle influx of requests for legal help",
    "description": "Nine BigLaw firms defended their multimillion-dollar pro bono deals with President Donald Trump as legal and ethical in letters to lawmakers obtained by Law360 and Law.com.",
    "link": "https://www.abajournal.com/news/article/biglaw-firms-defend-pro-bono-deals-with-trump-as-they-handle-influx-of-requests-for-legal-help",
    "timestamp": "2025-05-28T19:25:00Z"
  },
  {
    "title": "Mexico-US Relations Continue to Strain Over Organized Crime",
    "description": "An out-of-context photograph became the latest rift between the administrations of Donald Trump and Mexico’s Claudia Sheinbaum\nThe post Mexico-US Relations Continue to Strain Over Organized Crime appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/mexico-us-relations-strain-organized-crime/5888516",
    "timestamp": "2025-05-28T19:24:54Z"
  },
  {
    "title": "Trump picks ambassador to Turkey to be Syria envoy",
    "description": "United States President Donald Trump on Wednesday revealed that he chose US Ambassador to Turkey Tom Barrack to serve as envoy to Syria.In a post on his social media platform Truth Social, Trump stres...",
    "link": "https://biztoc.com/x/9e366c22dd9b9eeb",
    "timestamp": "2025-05-28T19:24:36Z"
  },
  {
    "title": "A Federal Judge Lists 8 Ways That Trump Violated the Constitution by Punishing a Disfavored Law Firm",
    "description": "After President Donald Trump began penalizing major law firms that had offended him in one way or another last February, nine of them chose to surrender rather than fight. They agreed to humiliating concessions that included pro bono work, totaling nearly $1 …",
    "link": "https://biztoc.com/x/796b87866d11818c",
    "timestamp": "2025-05-28T19:24:28Z"
  },
  {
    "title": "Emil Bove: Trump nominates one of his former personal attorneys for prestigious federal appeals court seat | CNN Politics",
    "description": "President Donald Trump nominated Emil Bove, a top justice department official and the president’s own former personal attorney, to be a federal appeals court judge.",
    "link": "https://www.cnn.com/2025/05/28/politics/emil-bove-trump-nomination",
    "timestamp": "2025-05-28T19:23:32Z"
  },
  {
    "title": "Trump Is Doing The Exact Thing He Complained About On The Campaign Trail",
    "description": "The “law and order” president is using the justice system to reward his allies and punish his opponents – something he complained about on the campaign trail.",
    "link": "https://www.huffpost.com/entry/donald-trump-pardon_n_68375368e4b05a60aceac947",
    "timestamp": "2025-05-28T19:23:14Z"
  },
  {
    "title": "No Filter: Piers Morgan Sounds Off on Trump, Biden, CNN’s ‘Sneering,’ and Meghan Markle",
    "description": "\"I think a lot of journalists in mainstream news in America knew a lot more about Biden's real cognitive and physical impairment than they were saying on air or in print. And shame on them,\" the media veteran-turned-YouTube star tells TheWrap\nThe post No Filt…",
    "link": "https://www.thewrap.com/piers-morgan-uncensored-on-trump-biden-cnn-markle-prince-harry/",
    "timestamp": "2025-05-28T19:22:30Z"
  },
  {
    "title": "ICE Arrests Illegal Alien from Mexico for Alleged Threat on Trump's Life",
    "description": "An illegal alien has been taken into custody by Immigration and Customs Enforcement (ICE) after he threatened to assassinate President Trump.\nThe post ICE Arrests Illegal Alien from Mexico for Alleged Threat on Trump’s Life appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/28/ice-arrests-illegal-alien-who-threatened-to-assassinate-president-trump/",
    "timestamp": "2025-05-28T19:22:12Z"
  },
  {
    "title": "Conservative Judges To Trump: Your Law Firm Death Warrants Are Unconstitutional Garbage",
    "description": "Federal judges don’t normally punctuate their rulings with multiple exclamation points while invoking the Founding Fathers. But then again, no president before has issued executive orders targeting law firms for the clients they represent and the cases they t…",
    "link": "https://www.techdirt.com/2025/05/28/conservative-judges-to-trump-your-law-firm-death-warrants-are-unconstitutional-garbage/",
    "timestamp": "2025-05-28T19:21:17Z"
  },
  {
    "title": "Trump nominates Emil Bove to serve as federal appellate judge",
    "description": "(Reuters) -U.S. President Donald Trump said on Wednesday that he was nominating Justice Department official Emil Bove, who previously defended Trump in a...",
    "link": "https://ca.news.yahoo.com/trump-nominates-emil-bove-serve-192041293.html",
    "timestamp": "2025-05-28T19:20:41Z"
  },
  {
    "title": "Trump Signs Pardon for Todd, Julie Chrisley Ahead of Prison Release",
    "description": "President Donald Trump is making good on his word.\nAfter revealing plans to pardon Todd Chrisley and Julie Chrisley—who are serving time in prison after being found guilty of bank fraud and tax...",
    "link": "https://www.eonline.com/news/1418046/trump-signs-pardon-for-todd-chrisley-julie-chrisley",
    "timestamp": "2025-05-28T19:20:32Z"
  },
  {
    "title": "A judge refuses to toss states’ lawsuit against Elon Musk and DOGE",
    "description": "WASHINGTON (AP) — A federal judge has refused to throw out a lawsuit that accuses billionaire Elon Musk and the Department of Government Efficiency of illegally accessing government data systems, canceling government contracts and firing federal employees.U.S…",
    "link": "https://freerepublic.com/focus/f-news/4319606/posts",
    "timestamp": "2025-05-28T19:20:09Z"
  },
  {
    "title": "New policy on visas adds to mounting scrutiny of international students in the US",
    "description": "New State Department guidance on visa applications is adding to scrutiny of international students that has intensified under President Donald Trump, who has leveraged control of foreign enrollment to press his demands with American colleges",
    "link": "https://abcnews.go.com/Politics/wireStory/new-policy-visas-adds-mounting-scrutiny-international-students-122280969",
    "timestamp": "2025-05-28T19:18:28Z"
  }
]