[
  {
    "title": "Penguin Memes Take Flight After Trump Tariffs Remote Island",
    "description": "Donald Trump's tariffs have become a black and white issue on social media, where penguin memes have gone viral after he targeted an island inhabited by the flightless birds, but no people.",
    "link": "https://www.ibtimes.com/penguin-memes-take-flight-after-trump-tariffs-remote-island-3768753",
    "timestamp": "2025-04-03T21:06:22Z"
  },
  {
    "title": "South Korea Court To Decide Impeached President's Fate",
    "description": "The fate of South Korea's presidency hangs on the Constitutional Court Friday as it decides whether to uphold Yoon Suk Yeol's impeachment over a disastrous martial law declaration or to return him to power.",
    "link": "https://www.ibtimes.com/south-korea-court-decide-impeached-presidents-fate-3768750",
    "timestamp": "2025-04-03T21:06:21Z"
  },
  {
    "title": "Wake Up! The Stock Market Is Crashing, Layoffs Have Surged More Than 200 Percent, And We Are Being Warned A Depression Is Coming",
    "description": "I am trying to find the words to describe the economic carnage that we are witnessing right now.  Even before President Trump unveiled his new tariffs, the U.S. economy was rapidly heading in the wrong direction, layoffs were soaring, and stock prices were st…",
    "link": "http://theeconomiccollapseblog.com/wake-up-the-stock-market-is-crashing-layoffs-have-surged-more-than-200-percent-and-we-are-being-warned-a-depression-is-coming/",
    "timestamp": "2025-04-03T21:06:11Z"
  },
  {
    "title": "'Life comes at you fast': Pro-Trump outlet mocked as it flips on 'golden age' outlook",
    "description": "A pro-MAGA outlet with a weekday livestream on Rumble had a blunt message for its followers a day after President Donald Trump announced sweeping new tariffs that economists warned could cost consumers: “You do NOT need the new iPad.”“You do NOT need the new …",
    "link": "https://www.rawstory.com/trump-tariffs-2671671204/",
    "timestamp": "2025-04-03T21:05:43Z"
  },
  {
    "title": "Senate Republicans Failed to Protect the American People by Confirming Mehmet Oz ’s Nomination for CMS",
    "description": "Following the Senate confirmation of Mehmet Oz to be the Administrator of the Centers for Medicare and Medicaid Services (CMS), Public Citizen Co-President Robert Weissman issued the following statement:“In confirming Mehmet Oz for the position of Administrat…",
    "link": "https://www.commondreams.org/newswire/senate-republicans-failed-to-protect-the-american-people-by-confirming-mehmet-oz-s-nomination-for-cms",
    "timestamp": "2025-04-03T21:04:40Z"
  },
  {
    "title": "Potential American Recession Gets New Timeline From Analyst",
    "description": "Donald Trump implemented sweeping tariffs to U.S. trading partners on Wednesday and the backlash from analysts has been fierce.",
    "link": "https://www.newsweek.com/potential-american-recession-gets-new-timeline-analyst-2054587",
    "timestamp": "2025-04-03T21:04:10Z"
  },
  {
    "title": "Instant Reaction: Trump Tariffs Trigger Stock Market Meltdown",
    "description": "The “America First” trade is unraveling in the sweeping turmoil in global markets, with stocks acutely exposed to the US economy sinking alongside the dollar. As Wall Street’s rebellion against Donald Trump’s tariff war intensifies, traders are rushing into f…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/instant-reaction-trump-tariffs-trigger-stock-market-meltdown",
    "timestamp": "2025-04-03T21:04:02Z"
  },
  {
    "title": "'So crazy' or a 'necessary evil'? - Americans react to Trump's tariffs",
    "description": "Five Americans share their view on the sweeping import taxes the president has announced.",
    "link": "https://www.bbc.com/news/articles/c2ew79vy37vo",
    "timestamp": "2025-04-03T21:03:48Z"
  },
  {
    "title": "Trump's odd fascination with word 'groceries' shows up in tariff speech",
    "description": "U.S. Department of Agriculture&#39s \"Food Price Outlook\" reports grocery costs are expected to rise faster than average this year",
    "link": "https://nationalpost.com/news/canada/trumps-odd-fascination-with-word-groceries-shows-up-in-tariff-speech",
    "timestamp": "2025-04-03T21:02:07Z"
  },
  {
    "title": "PGA Tour responds to latest PIF demands, 'neither deemed acceptable,' per report",
    "description": "The PGA Tour believes it's in a position of power, and the organization is acting like it.",
    "link": "https://golfweek.usatoday.com/story/sports/golf/liv/2025/04/03/pga-tour-rejects-pif-unification-demands-liv-golf/82798296007/",
    "timestamp": "2025-04-03T21:00:46Z"
  },
  {
    "title": "Dow drops 1,300 as US stocks lead worldwide sell-off",
    "description": "Financial markets around the world are reeling following President Donald Trump’s latest and most severe volley of tariffs.",
    "link": "https://www.wishtv.com/news/business/dow-drops-1300-as-us-stocks-lead-worldwide-sell-off-after-trumps-tariffs-ignite-a-covid-like-shock/",
    "timestamp": "2025-04-03T21:00:43Z"
  },
  {
    "title": "‘Liberation Day’ Donald Trump Tariff Tantrum To Cost Families $2100 Per Year, Market Reacts Negatively",
    "description": "President Donald Trump announces historic tariffs against the importation of foreign goods on Liberation Day\nThe post ‘Liberation Day’ Donald Trump Tariff Tantrum To Cost Families $2100 Per Year, Market Reacts Negatively appeared first on Bossip.",
    "link": "http://bossip.com/2835020/donald-trump-announces-historic-tariffs-on-liberation-day/",
    "timestamp": "2025-04-03T21:00:39Z"
  },
  {
    "title": "Trump: Open to tariff talks in case of good offers",
    "description": "United States President Donald Trump said on Thursday that he is open to negotiating his tariff policy if any other country comes up with a \"phenomenal\" counterproposal while reaffirming that the duti...",
    "link": "https://biztoc.com/x/839917951285ca6b",
    "timestamp": "2025-04-03T21:00:34Z"
  },
  {
    "title": "Suffering from a case of tariff whiplash? Here's what you need to know",
    "description": "The Trump administration announced a new suite of trade measures on dozens of countries Wednesday. Here are answers to some frequently asked tariff questions.",
    "link": "https://www.cbc.ca/news/business/tariff-explainer-1.7501372",
    "timestamp": "2025-04-03T21:00:31Z"
  },
  {
    "title": "Oil Executives Voice Concern Over Trump Energy Policies as Prices Plummet",
    "description": "As U.S. President Donald Trump looks increasingly likely to shift away from the Biden-era acceleration of renewable energy deployment in favour of the expansion of the fossil fuel industry, oil executives are calling on the government to create greater market…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Oil-Executives-Voice-Concern-Over-Trump-Energy-Policies-as-Prices-Plummet.html",
    "timestamp": "2025-04-03T21:00:00Z"
  },
  {
    "title": "Ireland urges caution as EU prepares response to Trump’s tariffs on imports into US",
    "description": "Government has been privately urging the bloc not to escalate the brewing trade war",
    "link": "https://www.irishtimes.com/politics/2025/04/03/ireland-urges-caution-as-european-union-prepares-response-to-trumps-tariffs-on-imports-into-us/",
    "timestamp": "2025-04-03T21:00:00Z"
  },
  {
    "title": "2 candidates vie for federal prosecutor job",
    "description": "President Donald Trump will now consider House minority leader Todd Gilbert and Robert Tracci, an assistant attorney general.",
    "link": "https://roanoke.com/news/local/government-politics/article_c4695e16-6abc-4616-882c-b3be638638aa.html",
    "timestamp": "2025-04-03T21:00:00Z"
  },
  {
    "title": "US stock index suffers biggest one-day fall since 2020 as Trump insists 'markets are going to boom'",
    "description": "The broad-based S&P 500 closed down 4.8%, while the tech-rich Nasdaq Composite tanked 6.0% and the Dow Jones ended the day down 4.0%.",
    "link": "https://www.thejournal.ie/us-stock-market-turmoil-donald-trump-tariffs-6667903-Apr2025/",
    "timestamp": "2025-04-03T20:57:30Z"
  },
  {
    "title": "FEMA hiring freeze ‘a gut punch’ for disaster relief efforts, source says",
    "description": "FEMA notified employees of the hiring freeze and term position renewals it said were in step with President Donald Trump’s executive order.",
    "link": "https://www.wsbtv.com/news/local/dekalb-county/fema-hiring-freeze-gut-punch-disaster-relief-efforts-source-says/MPT24W7TZVBSJJFWJXOIPLFUJ4/",
    "timestamp": "2025-04-03T20:56:33Z"
  },
  {
    "title": "There’s a high cost to Trump’s tariffs: Our allies’ trust",
    "description": "Stephanie Ruhle explains why U.S. allies, CEOs, Wall Street investors and economists are losing trust in the U.S. due to Trump's sweeping tariffs.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-tariffs-united-states-economy-trust-rcna199521",
    "timestamp": "2025-04-03T20:55:19Z"
  },
  {
    "title": "Donald Trump ordered to pay £626,000 legal costs after Steele dossier lawsuit (Jamie Grierson/The Guardian)",
    "description": "Jamie Grierson / The Guardian:\nDonald Trump ordered to pay £626,000 legal costs after Steele dossier lawsuit  —  US president had sued over denied allegations he took part in ‘perverted’ sex acts but UK case was thrown out last year  —  Donald Trump has been …",
    "link": "https://www.memeorandum.com/250403/p130",
    "timestamp": "2025-04-03T20:55:00Z"
  },
  {
    "title": "Republican Chuck Grassley and Democrat Maria Cantwell introduce bill to reassert congressional power on tariffs",
    "description": "Republicans and Democrats in Congress joined to introduce a bill meant to rein in President Donald Trump's ability to declare new tariffs. Trump followed through on his promise to punish foreign countries with increased tariffs in order to bring in more feder…",
    "link": "https://www.theblaze.com/news/grassley-cantwell-bill-tariff-power",
    "timestamp": "2025-04-03T20:55:00Z"
  },
  {
    "title": "'Blowing up the world trading system': Conservative WSJ editors turn on Trump",
    "description": "President Donald Trump's new, sweeping regime of tariffs on imported goods from essentially the entire world is meant to build up American manufacturing, but the president will swiftly discover that it will have the opposite effect, warned the conservative Wa…",
    "link": "https://www.rawstory.com/wsj-trump-tariffs-2671671202/",
    "timestamp": "2025-04-03T20:54:32Z"
  },
  {
    "title": "General Motors to Expand Production at Indiana Plant Thanks to Trump’s Auto Tariffs",
    "description": "General Motors (GM) plans to expand production at one of its plants in Indiana thanks to President Donald Trump’s tariffs on foreign-made cars. On Wednesday evening, Trump announced a 25 percent tariff on all foreign-made cars to protect the nation’s auto ind…",
    "link": "https://freerepublic.com/focus/f-news/4308671/posts",
    "timestamp": "2025-04-03T20:54:29Z"
  },
  {
    "title": "Trump’s Real Motives in Attacking U.S. Universities",
    "description": "How the president’s crackdown on higher education fits into his broader political program.",
    "link": "http://foreignpolicy.com/2025/04/03/trump-attacking-universities-funding-us-politics/",
    "timestamp": "2025-04-03T20:53:55Z"
  },
  {
    "title": "Agriculture Secretary Brooke Rollins on Tariffs: 'The New Golden Age of Prosperity Will Move in Again'",
    "description": "\"The new golden age of prosperity\" will move in again,\" Department of Agriculture Secretary Brook Rollins told reporters this week following President Donald Trump's historic \"Liberation Day\" announcement.\nThe post Agriculture Secretary Brooke Rollins on Tari…",
    "link": "https://www.breitbart.com/politics/2025/04/03/agriculture-secretary-brooke-rollins-on-tariffs-the-new-golden-age-of-prosperity-will-move-in-again/",
    "timestamp": "2025-04-03T20:51:45Z"
  },
  {
    "title": "Wall Street wipeout: Donald Trump’s tariff announcement brings heavy losses, all-out trade war, recession fears",
    "description": "US President Donald Trump’s newly announced sweeping global tariffs have caused carnage on Wall Street, with $3 trillion wiped from the market as all-out trade wars and recession fears take over.",
    "link": "https://thenightly.com.au/business/wall-street-wipeout-donald-trumps-tariff-announcement-brings-heavy-losses-all-out-trade-war-recession-fears-c-18257544",
    "timestamp": "2025-04-03T20:51:35Z"
  },
  {
    "title": "Judge Boasberg Suggests Potential Contempt Hearings With Trump Admin",
    "description": "Boasberg reportedly took a swipe at the DOJ for the \"pretty sketchy looking\" move of not wanting to share information with him.",
    "link": "https://www.newsweek.com/judge-boasberg-suggests-potential-contempt-hearings-trump-administration-2055086",
    "timestamp": "2025-04-03T20:51:15Z"
  },
  {
    "title": "The Trump Administration Keeps Finding Petty New Ways to Punish the State of Maine",
    "description": "Ever since the governor stood up to Trump publicly, the White House appears bent on vengeance.",
    "link": "https://www.esquire.com/news-politics/politics/a64380054/trump-feud-maine-governor-cut-federal-funds/",
    "timestamp": "2025-04-03T20:51:00Z"
  },
  {
    "title": "Trump's 'idiotic' and flawed tariff calculations stun economists (Richard Partington/The Guardian)",
    "description": "Richard Partington / The Guardian:\nTrump's ‘idiotic’ and flawed tariff calculations stun economists  —  ‘Willing sycophants’ came up with simplistic formula that has thrown global economy into disarray  —  Waving a big chart as a prop in the White House Rose …",
    "link": "https://www.memeorandum.com/250403/p127",
    "timestamp": "2025-04-03T20:50:00Z"
  },
  {
    "title": "Yes, Trump Really Put Higher Tariffs on Israel Than Iran",
    "description": "A few hours before President Donald Trump slapped huge new tariffs on nearly all imports to the United States, Israel preemptively dropped all its tariffs on American goods. \nThat's what some of Trump's defenders say is the goal of this whole madcap scheme: t…",
    "link": "https://biztoc.com/x/81f2478f89042536",
    "timestamp": "2025-04-03T20:49:39Z"
  },
  {
    "title": "A running list of companies that have talked about raising prices due to Trump's tariffs",
    "description": "Some companies are preparing to raise prices in response to President Donald Trump's tariff proposals.\nBrandon Bell/Getty, Tyler Le/BI\nTrump followed through on months of tariff threats, announcing levies on dozens of countries.\nEven before his so-called \"Lib…",
    "link": "https://biztoc.com/x/0701a7a8e8dfa644",
    "timestamp": "2025-04-03T20:49:25Z"
  },
  {
    "title": "Bolsas de Nova York têm maior queda desde março de 2020 com tarifaço de Trump",
    "description": "O analista Dan Ives, da Wedbush Securities, chamou o pacote tarifário de \"pior que o pior cenário\" previsto por Wall Street\nThe post Bolsas de Nova York têm maior queda desde março de 2020 com tarifaço de Trump appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/mercados/bolsas-de-nova-york-tem-maior-queda-desde-marco-de-2020-com-tarifaco-de-trump/",
    "timestamp": "2025-04-03T20:49:13Z"
  },
  {
    "title": "Trump Official Declares There Isn't 'Any Chance' Trump Will Back Down From Tariffs as Stock Market Plunges",
    "description": "Howard Lutnick stated his belief that Donald Trump will not change his tune on the implementation of tariffs against some of the U.S.'s biggest trade partners.",
    "link": "https://www.ibtimes.com/trump-official-declares-there-isnt-any-chance-trump-will-back-down-tariffs-stock-market-plunges-3768730",
    "timestamp": "2025-04-03T20:48:12Z"
  },
  {
    "title": "It was a bad day for Nvidia",
    "description": "Nvidia (NVDA) fell with other Magnificent 7 stocks on Thursday as the market reacted to new tariffs — but the company also may’ve slipped because a major bank downgraded it for unrelated reasons.Read more...",
    "link": "https://qz.com/nvidia-stock-trump-tariffs-hsbc-downgrade-ai-1851774647",
    "timestamp": "2025-04-03T20:48:00Z"
  },
  {
    "title": "Yes, Trump Really Put Higher Tariffs on Israel Than Iran",
    "description": "A few hours before President Donald Trump slapped huge new tariffs on nearly all imports to the United States, Israel preemptively dropped all its tariffs",
    "link": "https://reason.com/2025/04/03/yes-trump-really-put-higher-tariffs-on-israel-than-iran/",
    "timestamp": "2025-04-03T20:47:27Z"
  },
  {
    "title": "US to skip Ukraine military aid meeting for first time – media",
    "description": "Pentagon chief Pete Hegseth will reportedly not attend the Ramstein group either virtually or in person Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615207-pentagon-ukraine-military-aid-meeting/",
    "timestamp": "2025-04-03T20:47:25Z"
  },
  {
    "title": "What to know about rumors Musk is leaving his DOGE role",
    "description": "In an X post, Musk called rumors he was being sidelined by the administration \"fake news.\"",
    "link": "https://www.snopes.com//news/2025/04/03/musk-leaving-doge/",
    "timestamp": "2025-04-03T20:47:00Z"
  },
  {
    "title": "Senate Follows House in Killing Biden Reg Imposing Curbs on Energy Use of Walk-In Coolers",
    "description": "Senate Republicans voted to repeal a Biden administration regulation pertaining to walk-in freezers and coolers Thursday, in a move they say will save small-business owners... Read More\nThe post Senate Follows House in Killing Biden Reg Imposing Curbs on Ener…",
    "link": "https://www.dailysignal.com/2025/04/03/senate-follows-house-in-killing-biden-reg-imposing-curbs-on-energy-use-of-walk-in-coolers/",
    "timestamp": "2025-04-03T20:45:19Z"
  },
  {
    "title": "Trump: Netanyahu may visit US next week",
    "description": "US President Donald Trump said he spoke with Israeli Prime Minister Benjamin Netanyahu on Thursday, adding tha",
    "link": "https://www.jpost.com/breaking-news/article-848817",
    "timestamp": "2025-04-03T20:44:04Z"
  },
  {
    "title": "Senate confirms Dr. Oz to oversee Medicare and Medicaid",
    "description": "The former TV host has secured the votes needed to lead CMS.",
    "link": "https://nypost.com/2025/04/03/us-news/us-senate-confirms-trumps-medicare-and-medicaid-nominee-mehmet-oz/",
    "timestamp": "2025-04-03T20:43:48Z"
  },
  {
    "title": "Musk is not the target. We are",
    "description": "'Inadvertently, the left is saying to hell with climate change. We want bigger government'",
    "link": "https://www.wnd.com/2025/04/musk-is-not-the-target-we-are/",
    "timestamp": "2025-04-03T20:43:37Z"
  },
  {
    "title": "Something's Gone Wrong With Microsoft's Huge AI Data Center Investments",
    "description": "Data centers are everywhere. As the world's tech companies demand more compute power to make their software run, the facilities have popped up in every corner of the planet. They makeup the backbone of global network servers, cloud computing, and of course, A…",
    "link": "https://futurism.com/microsoft-huge-data-center-investments-tariffs",
    "timestamp": "2025-04-03T20:43:18Z"
  },
  {
    "title": "A running list of companies that have talked about raising prices due to Trump's tariffs",
    "description": "Trump's tariffs announcement has companies scrambling as their costs increase. Here's which companies have hinted at raising prices.",
    "link": "https://www.businessinsider.com/companies-raising-prices-increases-trump-tariffs-2025",
    "timestamp": "2025-04-03T20:43:14Z"
  },
  {
    "title": "US Senate rejects effort to block arms sales to Israel",
    "description": "The Senate voted 82-15 and 83-15 to reject two resolutions of disapproval over sales of massive bombs and other offensive military equipment.",
    "link": "https://www.jpost.com/international/article-848818",
    "timestamp": "2025-04-03T20:42:55Z"
  },
  {
    "title": "The problem with Trump’s ‘Liberation Day’ tariffs",
    "description": "He should return to his history as a pro-business, pro-markets president as soon as possible",
    "link": "https://www.wnd.com/2025/04/the-problem-with-trumps-liberation-day-tariffs/",
    "timestamp": "2025-04-03T20:41:57Z"
  },
  {
    "title": "HUD Secretary Turner Waives FHA Mortgage Rule to Help L.A. Rebuild",
    "description": "Secretary of Housing and Urban Development (HUD) Scott Turner announced Thursday that his department had waived a key rule that could affect Federal Housing Authority (FHA)-backed loans, to help victims of recent wildfires in Los Angeles.\nThe post HUD Secreta…",
    "link": "https://www.breitbart.com/politics/2025/04/03/hud-secretary-turner-waives-fha-mortgage-rule-to-help-l-a-rebuild/",
    "timestamp": "2025-04-03T20:41:43Z"
  },
  {
    "title": "Federal Appeals Court Pauses Lower Court’s Order on CFPB",
    "description": "A federal appeals court reportedly paused a lower court’s order from last week that reversed President Donald Trump’s actions at the Consumer Financial Protection Bureau (CFPB). At the same time, the appeals court’s ruling left in place provisional agreements…",
    "link": "https://www.pymnts.com/news/cfpb/2025/federal-appeals-court-pauses-lower-courts-order-on-cfpb/",
    "timestamp": "2025-04-03T20:41:37Z"
  },
  {
    "title": "‘We Are Not Kidding!’ CNN’s Dana Bash Roasts Trump for Slapping Tariffs on an Arctic Island Inhabited Solely By Penguins",
    "description": "CNN's Dana Bash on Thursday poked fun at President Donald Trump imposing tariffs on Arctic islands inhabited by penguins and not people.\nThe post ‘We Are Not Kidding!’ CNN’s Dana Bash Roasts Trump for Slapping Tariffs on an Arctic Island Inhabited Solely By P…",
    "link": "https://www.mediaite.com/tv/we-are-not-kidding-cnns-dana-bash-roasts-trump-for-slapping-tariffs-on-an-arctic-island-inhabited-solely-by-penguins/",
    "timestamp": "2025-04-03T20:39:53Z"
  },
  {
    "title": "Trump Invites El Salvador President Nayib Bukele to White House: ‘A Model for Others’",
    "description": "President of El Salvador Nayib Bukele announced on Wednesday that he received an invitation from President Donald Trump to visit the White House on April 14, 2025.\nThe post Trump Invites El Salvador President Nayib Bukele to White House: ‘A Model for Others’ …",
    "link": "https://www.breitbart.com/latin-america/2025/04/03/trump-invites-el-salvador-president-nayib-bukele-to-white-house-a-model-for-others/",
    "timestamp": "2025-04-03T20:39:28Z"
  },
  {
    "title": "Here’s a closer look at Trump’s tariff plan: What to know about the new duties",
    "description": "Trump unveiled the new tariffs in a ceremony at the White House’s Rose Garden on Wednesday for a \"Make America Wealthy Again\" event.",
    "link": "https://www.foxnews.com/politics/heres-close-look-trumps-tariff-plan-what-know-about-new-duties",
    "timestamp": "2025-04-03T20:39:12Z"
  },
  {
    "title": "Is the Great Depression Getting a Sequel? People Cope With Jokes After Trump's Tariffs Announcement",
    "description": "Social media users react to increasing fears over a global trade war and U.S. recession.",
    "link": "https://www.complex.com/life/a/joshua-espinoza/social-media-reactions-great-depression-trump-tariffs",
    "timestamp": "2025-04-03T20:38:54Z"
  },
  {
    "title": "Judge Boasberg Thinks There’s ‘Fair Likelihood’ Trump Administration Violated Court Order With El Salvador Flights",
    "description": "The judge is now deliberating on whether there’s grounds to hold Trump officials in contempt.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/04/03/judge-boasberg-thinks-theres-fair-likelihood-trump-administration-violated-court-order-with-el-salvador-flights/",
    "timestamp": "2025-04-03T20:38:38Z"
  },
  {
    "title": "Senators Make Modest Moves To Reclaim Tariff Powers From Trump",
    "description": "On Wednesday, President Donald Trump made good on his promise to impose tariffs on nearly every nation, principality, and uninhabited island on the planet—an event he dubbed \"Liberation Day.\" The measure would place 10-percent tariffs across the board, with a…",
    "link": "https://biztoc.com/x/58506726e9f22910",
    "timestamp": "2025-04-03T20:38:16Z"
  },
  {
    "title": "Stock market plunges after Trump tariff announcement",
    "description": "The markets closed down around 4% after President Donald Trump’s announcement to slap reciprocal tariffs on global trading partners. The S&P 500 fell 4.8%, while the Nasdaq fell 6% — both their worst since 2020. The Dow Jones Industrial Average declined 4%, o…",
    "link": "https://biztoc.com/x/b77adb67bf779e4c",
    "timestamp": "2025-04-03T20:38:03Z"
  },
  {
    "title": "Trump Won’t Give Up (on) TikTok",
    "description": "The U.S. president has taken negotiations down to the wire to save the popular video-sharing app.",
    "link": "http://foreignpolicy.com/2025/04/03/trump-tiktok-social-media-china-bytedance/",
    "timestamp": "2025-04-03T20:37:55Z"
  },
  {
    "title": "Meghan McCain loses it over indiscretions of fictional character on White Lotus",
    "description": "Meghan McCain continued her war of words Thursday with actor Carrie Coon, who plays \"Laurie\" in Season Three of HBO Max's hit series The White Lotus.\n\nCoon told \nThe Hollywood Reporter that McCain must have felt \"gratified\" at seeing a conservative character …",
    "link": "https://www.rawstory.com/white-lotus-actor-claims-meghan-mccain-is-gratified/",
    "timestamp": "2025-04-03T20:37:48Z"
  },
  {
    "title": "Down Is Up: Kellyanne Conway Hails ‘Positive Reaction’ from U.S. Automaker That Just Laid off 900 Workers Amid Trump Tariffs",
    "description": "Fox News contributor Kellyanne Conway offered an all-time spin job after a major U.S. automaker announced it will temporarily lay off 900 workers in the U.S. \nThe post Down Is Up: Kellyanne Conway Hails ‘Positive Reaction’ from U.S. Automaker That Just Laid o…",
    "link": "https://www.mediaite.com/tv/down-is-up-kellyanne-conway-hails-positive-reaction-from-u-s-automaker-that-just-laid-off-900-workers-amid-trump-tariffs/",
    "timestamp": "2025-04-03T20:37:43Z"
  },
  {
    "title": "Shameless: How a ‘EU aspirant’ silences opponents and threatens them with jail",
    "description": "The detention of regional leader Evgenia Gutsul exposes deepening tensions between Moldova and autonomous Gagauzia Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615211-democracy-in-name-only/",
    "timestamp": "2025-04-03T20:36:40Z"
  },
  {
    "title": "Distress for Lancaster County museums and libraries as Trump dismantles federal agency",
    "description": "Museum admission discounts for low-income families. Digital reading materials during the COVID-19 pandemic. Funding to recruit new education staff.",
    "link": "https://lancasteronline.com/news/local/distress-for-lancaster-county-museums-and-libraries-as-trump-dismantles-federal-agency/article_5d607c76-3249-478e-884b-e27d46fae812.html",
    "timestamp": "2025-04-03T20:36:00Z"
  },
  {
    "title": "Meghan McCain Fires Back at a Confused Carrie Coon for Saying She’s ‘Gratified’ to See a Republican on ‘The White Lotus’",
    "description": "“Is 'gratified' a new trigger word?\" the actress questions of McCain’s anger\nThe post Meghan McCain Fires Back at a Confused Carrie Coon for Saying She’s ‘Gratified’ to See a Republican on ‘The White Lotus’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/meghan-mccain-carrie-coon-the-white-lotus-republican-character/",
    "timestamp": "2025-04-03T20:35:42Z"
  },
  {
    "title": "Trump slapped tariffs on remote islands with no humans — but a thriving penguin population",
    "description": "President Trump imposed tariffs on Heard Island and McDonald Islands, and several other small island economies, while leaving Russia off his list of targets.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-tariffs-heard-mcdonald-islands-russia-australia-rcna199574",
    "timestamp": "2025-04-03T20:35:39Z"
  },
  {
    "title": "Whoopi Goldberg signs off ‘The View’ with call to anti-Trump ‘resistance’",
    "description": "\"The View\" co-host Whoopi Goldberg signed off Thursday's show by rallying the movement resisting President Donald Trump.",
    "link": "https://nypost.com/2025/04/03/us-news/whoopi-goldberg-signs-off-the-view-with-call-to-anti-trump-resistance/",
    "timestamp": "2025-04-03T20:35:25Z"
  },
  {
    "title": "GOP Rep. Mary Miller Plans to Strip Planned Parenthood of Taxpayer Funding Through Reconciliation: ‘Congress Must Fulfill Constitutional Duty’",
    "description": "Republican Rep. Mary Miller (R-IL) has plans to produce legislation that would strip abortion-giant Planned Parenthood of taxpayer funding through budget reconciliation.\nThe post GOP Rep. Mary Miller Plans to Strip Planned Parenthood of Taxpayer Funding Throu…",
    "link": "https://www.breitbart.com/politics/2025/04/03/gop-rep-mary-miller-plans-to-strip-planned-parenthood-of-taxpayer-funding-through-reconciliation-congress-must-fulfill-constitutional-duty/",
    "timestamp": "2025-04-03T20:34:59Z"
  },
  {
    "title": "Dow nosedives 1,600 points, S&P 500 and Nasdaq drop the most since 2020 after Trump’s tariff onslaught",
    "description": "Stocks plummeted Thursday, sending the S&P 500 back into correction territory for its biggest one-day loss since 2020, after President Donald Trump unveiled sweeping tariffs, raising the risk of a global trade war that plunges the economy into a recession.The…",
    "link": "https://freerepublic.com/focus/f-news/4308667/posts",
    "timestamp": "2025-04-03T20:34:31Z"
  },
  {
    "title": "At Least the Memes About the Stock Market Are Good",
    "description": "Donald Trump’s sweeping tariffs have sent the stock market into free fall, which seems … pretty bad? At least people are writing funny tweets and posting good memes about it.",
    "link": "http://www.thecut.com/article/best-tweets-memes-trump-tariffs-economy-market-crash.html",
    "timestamp": "2025-04-03T20:34:02Z"
  },
  {
    "title": "Trump Tariffs Target Both China and U.S. Allies in Asia",
    "description": "The move is a blow to China, but it could also harm U.S. interests in the region.",
    "link": "http://foreignpolicy.com/2025/04/03/trump-tariffs-asia-china-japan-taiwan-south-korea/",
    "timestamp": "2025-04-03T20:34:01Z"
  },
  {
    "title": "There Is Only One Way to Make Sense of the Tariffs",
    "description": "The policy is absurd. It’s also an extension of Trump’s chaotic personality.",
    "link": "https://www.theatlantic.com/politics/archive/2025/04/tariffs-trump-outcomes-incompatible/682286/",
    "timestamp": "2025-04-03T20:33:55Z"
  },
  {
    "title": "Toronto Wants to Woo Foreign Listings Despite Trump Market Chaos",
    "description": "The head of the Toronto Stock Exchange is counting on recent market volatility to sway some companies towards listing in Canada this year, even as tariff-fueled uncertainty dries up risk appetite across the globe.",
    "link": "https://financialpost.com/pmn/business-pmn/toronto-wants-to-woo-foreign-listings-despite-trump-market-chaos",
    "timestamp": "2025-04-03T20:32:38Z"
  },
  {
    "title": "OpenAI Raises $40 Billion, Runway AI Video $380 Million, Amazon, Oracle, TikTok Suitors Await Decision",
    "description": "OpenAI raises $40B, Trump weighs in on TikTok, Runway’s $380 M raise and its stunning Gen-4 AI model, Anthropic warns: AI may lie, plus vibe filmmaking with Deepmind.",
    "link": "https://www.forbes.com/sites/charliefink/2025/04/03/openai-raises-40-billion-runway-ai-video-380-million-amazon-oracle-tiktok-suitors-await-decision/",
    "timestamp": "2025-04-03T20:32:11Z"
  },
  {
    "title": "Child Care Funding Cuts Will Compound Crises for Generations to Come",
    "description": "Access to child care is already inadequate across the US. Trump's funding cuts to Head Start will make it far worse.",
    "link": "https://truthout.org/articles/child-care-funding-cuts-will-compound-crises-for-generations-to-come/",
    "timestamp": "2025-04-03T20:31:30Z"
  },
  {
    "title": "Trump tariffs breach NATO rules – Norway",
    "description": "Norwegian Foreign Minister Espen Barth Eide has said the new US trade policy may violate the military bloc’s economic commitments Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615208-us-violates-nato-rules/",
    "timestamp": "2025-04-03T20:30:19Z"
  },
  {
    "title": "Trump: The Economy Crashing Is Good, Actually",
    "description": "Donald Trump thinks everything is going just fine with his insane tariffs.\r\nIn his lone statement about the tariffs Thursday, Trump didn’t seem bothered when a reporter asked him “The markets today are way down. The worst day in years. Because of the tariffs.…",
    "link": "https://newrepublic.com/post/193592/trump-economy-crashing-good-actually",
    "timestamp": "2025-04-03T20:30:17Z"
  },
  {
    "title": "Trump Must Pay Legal Fees Over Steele Dossier Lawsuit",
    "description": "A London judge ruled Donald Trump must pay $821,500 in legal fees to a private investigations firm the sued over a dossier which alleged ties between his 2016 election campaign and Russia, Reuters reports.",
    "link": "https://politicalwire.com/2025/04/03/trump-must-pay-legal-fees-over-steele-dossier-lawsuit/",
    "timestamp": "2025-04-03T20:30:17Z"
  },
  {
    "title": "Why Trump's Smithsonian executive order is especially painful (Shalise Manza Young/The Contrarian)",
    "description": "Shalise Manza Young / The Contrarian:\nWhy Trump's Smithsonian executive order is especially painful  —  President Donald Trump has been signing executive orders at the pace of a teenager posting to Snapchat, and, for the most part, they are press releases tha…",
    "link": "https://www.memeorandum.com/250403/p124",
    "timestamp": "2025-04-03T20:30:02Z"
  },
  {
    "title": "Venezuela Stages Rally to Demand Release of Tren de Aragua Members Jailed in El Salvador",
    "description": "Venezuelan Foreign Minister Yván Gil demanded on Wednesday that the international community \"put on their pants\" and act to \"free\" the Venezuelan illegal migrants detained in El Salvador.\nThe post Venezuela Stages Rally to Demand Release of Tren de Aragua Mem…",
    "link": "https://www.breitbart.com/latin-america/2025/04/03/venezuela-stages-rally-to-demand-release-of-tren-de-aragua-members-jailed-in-el-salvador/",
    "timestamp": "2025-04-03T20:27:24Z"
  },
  {
    "title": "Fintech stocks such as Affirm, PayPal plunge on concern Trump tariffs will hurt consumer spending",
    "description": "The global market rout on Thursday, sparked by President Donald Trump's announcement of widespread tariffs, had an outsized effect on fintech companies and credit card issuers that are closely tied to consumer spending and credit.\nAffirm, which offers buy now…",
    "link": "https://biztoc.com/x/5c990674be85abe2",
    "timestamp": "2025-04-03T20:27:19Z"
  },
  {
    "title": "Republican Senator Warns Tariffs Cost U.S. Businesses Access to Markets: ‘And They Don’t Come Back’",
    "description": "\"I think we ought to be focused on our economic adversaries and be... less damaging to our economic allies,” said Sen. Jerry Moran\nThe post Republican Senator Warns Tariffs Cost U.S. Businesses Access to Markets: ‘And They Don’t Come Back’ first appeared on M…",
    "link": "https://www.mediaite.com/news/republican-senator-warns-tariffs-cost-u-s-businesses-access-to-markets-and-they-dont-come-back/",
    "timestamp": "2025-04-03T20:27:17Z"
  },
  {
    "title": "Macron Calls For Suspension Of Investment In US Until Tariffs Clarified",
    "description": "French President Emmanuel Macron on Thursday called for a suspension of investment in the United States until Donald Trump's \"brutal and unfounded\" new tariffs against Europe and the rest of the world were clarified.",
    "link": "https://www.ibtimes.com/macron-calls-suspension-investment-us-until-tariffs-clarified-3768745",
    "timestamp": "2025-04-03T20:27:07Z"
  },
  {
    "title": "Did Kid Rock's Suit From White House Visit Violate US Flag Code?",
    "description": "Kid Rock turned heads with his American flag suit during an April 2025 White House visit — but did he also break the law and violate flag code?",
    "link": "https://loudwire.com/kid-rock-white-house-suit-flag-code/",
    "timestamp": "2025-04-03T20:26:43Z"
  },
  {
    "title": "D-FW Fortune 500s lose $49 billion as tariffs take toll on stock markets",
    "description": "Dallas-Fort Worth’s Fortune 500 companies lost $49 billion in market value Thursday by the close of trading. Investors retreated after President Donald Trump...",
    "link": "https://www.dallasnews.com/business/economy/2025/04/03/d-fw-fortune-500s-lose-49-billion-as-tariffs-take-toll-on-stock-markets/",
    "timestamp": "2025-04-03T20:26:16Z"
  },
  {
    "title": "Why is Trump rewriting US economic history? Anyone? | CNN Politics",
    "description": "President Donald Trump wants Americans to see history his way, historians be damned.",
    "link": "https://www.cnn.com/2025/04/03/politics/why-is-trump-rewriting-us-economic-history/index.html",
    "timestamp": "2025-04-03T20:25:50Z"
  },
  {
    "title": "EXCLUSIVE: Biden Department of Education Met With Far-Left Groups While Discussing Pro-Trans Title IX Rewrite",
    "description": "FIRST ON THE DAILY SIGNAL—The Department of Education’s Office for Civil Rights under President Joe Biden held multiple stakeholder meetings with leftist groups—including the Human... Read More\nThe post EXCLUSIVE: Biden Department of Education Met With Far-Le…",
    "link": "https://www.dailysignal.com/2025/04/03/exclusive-biden-department-education-met-far-left-groups-while-discussing-pro-trans-title-ix-rewrite-woketopus/",
    "timestamp": "2025-04-03T20:24:14Z"
  },
  {
    "title": "US Stocks Plunge After Tariff Move, S&P 500 Sees Biggest Decline Since 2020",
    "description": "US stocks plunged Thursday as traders reacted to Donald Trump&#039;s sweeping tariff announcement a day earlier, with the broad-based S&amp;P 500 recording its biggest one-day decline since 2020.",
    "link": "https://www.ndtv.com/world-news/donald-trump-trump-tariffs-reciprocal-tariffs-us-stocks-plunge-after-tariff-move-s-p-500-sees-biggest-decline-since-2020-8081676",
    "timestamp": "2025-04-03T20:23:59Z"
  },
  {
    "title": "Russia calls Trump threats to bomb Iran ‘illegal and unacceptable’",
    "description": "Trump has warned there could be direct conflict if Iran doesn’t halt its nuclear program.",
    "link": "https://nypost.com/2025/04/03/world-news/russia-calls-trump-threats-to-bomb-iran-illegal-and-unacceptable/",
    "timestamp": "2025-04-03T20:23:53Z"
  },
  {
    "title": "Dow drops 1,600 as US stocks lead worldwide sell-off after Trump’s tariffs cause a COVID-like shock",
    "description": "Financial markets around the world reeled following President Donald Trump’s latest and most severe set of tariffs, and the U.S. stock market took the worst of it. The S&P 500 fell 4.8% Thursday, more than other major stock markets. The Dow Jones Industrial A…",
    "link": "https://www.whec.com/business/dow-drops-1600-as-us-stocks-lead-worldwide-sell-off-after-trumps-tariffs-cause-a-covid-like-shock/",
    "timestamp": "2025-04-03T20:23:50Z"
  },
  {
    "title": "'No bottles being popped' as Manitoba grapples with impacts of tariffs, premier says",
    "description": "Canada was largely spared in U.S. President Donald Trump’s long-feared plan to impose tariffs on imports from dozens of countries, but Manitoba's premier said Thursday there are still \"no bottles being popped today.\"",
    "link": "https://www.cbc.ca/news/canada/manitoba/tariffs-premier-reaction-1.7501402",
    "timestamp": "2025-04-03T20:20:56Z"
  },
  {
    "title": "Oh, Laura Loomer Is Now Running The National Security Council. IS THAT FINE?",
    "description": "Why wouldn't it be fine? It's TrumpWorld! Anything goes!",
    "link": "https://www.wonkette.com/p/oh-laura-loomer-is-now-running-the",
    "timestamp": "2025-04-03T20:20:46Z"
  },
  {
    "title": "Manitoba premier says federal tariff retaliation is supported across the board",
    "description": "WINNIPEG — Manitoba Premier Wab Kinew says he and other provincial leaders are backing the federal government’s response to tariffs imposed by the United States. Kinew says there was broad consensus in a virtual meeting Thursday with Prime Minister Mark Carne…",
    "link": "https://financialpost.com/pmn/manitoba-premier-says-federal-tariff-retaliation-is-supported-across-the-board",
    "timestamp": "2025-04-03T20:19:02Z"
  },
  {
    "title": "Should I buy the NDQ ETF after the Wall Street's crash?",
    "description": "Fear is taking over the share market but is this the best time to buy?\nThe post Should I buy the NDQ ETF after the Wall Street's crash? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/04/04/should-i-buy-the-ndq-etf-after-wall-streets-crash/",
    "timestamp": "2025-04-03T20:18:25Z"
  },
  {
    "title": "Dow drops nearly 1,680 in biggest wipeout since 2020 as fears of fallout from tariffs shake markets",
    "description": "Financial markets around the world reeled following President Donald Trump’s latest and most severe set of tariffs, and the U.S. stock market took the worst of it.",
    "link": "https://www.local10.com/business/2025/04/03/stock-market-today-asian-markets-slip-following-trumps-announcements-of-big-tariff-hikes/",
    "timestamp": "2025-04-03T20:17:18Z"
  },
  {
    "title": "B.C. premier wants to bring in more U.S. immigrants, denounces talk of western separatism",
    "description": "David Eby said immigrants from the United States could help bolster the local economy. He said he will be meeting with Mark Carney next week to discuss issues facing the province.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/bc-premier-us-immigrants-1.7501375",
    "timestamp": "2025-04-03T20:17:02Z"
  },
  {
    "title": "Meta Stock Drops 9% Thursday As Tariff Fears Shake Tech Sector: What You Need To Know",
    "description": "Meta Platforms Inc. (NASDAQ:META) shares traded lower on Thursday as broader markets reacted to President Donald Trump's sweeping tariff plan.\nWhat To Know: The Trump administration announced reciprocal tariffs on several countries on Wednesday. Trump invoked…",
    "link": "https://biztoc.com/x/c7adf77270095d0c",
    "timestamp": "2025-04-03T20:16:38Z"
  },
  {
    "title": "Exclusive — JD Vance on ‘Liberation Day’ Tariffs: ‘First Time’ in Decades ‘We Have an American President Saying No More’ to U.S. Being World’s ‘Piggy Bank’",
    "description": "WASHINGTON — Vice President JD Vance told Breitbart News exclusively on Wednesday evening that for the “first time in probably 40 years,” the United States has a president in President Donald Trump who is reversing the trend of the U.S. serving as a “piggy ba…",
    "link": "https://freerepublic.com/focus/f-news/4308663/posts",
    "timestamp": "2025-04-03T20:16:26Z"
  }
]