[
  {
    "title": "Macron snubbed during Trump–Zelensky meeting in Vatican",
    "description": "Trump and Zelensky met ahead of the Pope’s funeral for the first time since their White House clash Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616389-macron-snubbed-during-trump-zelensky-meeting/",
    "timestamp": "2025-04-27T13:57:06Z"
  },
  {
    "title": "Is Vlad calling all the shots?",
    "description": "Is Vlad calling all the shots?\r\n\n \n \n \n (Third column, 4th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:President now expresses doubts Putin willing to end war...\r\nStringing me along!\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.the-sun.com/news/14112235/trump-ukraine-peace-deal-putin/",
    "timestamp": "2025-04-27T13:55:39Z"
  },
  {
    "title": "Will next reveal Vatican's UFO secrets?",
    "description": "Will next reveal Vatican's UFO secrets?\r\n\n \n \n \n (First column, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Pope Francis laid to rest...\r\nSULLIVAN: Why I Loved Him...\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.the-sun.com/news/14115118/trump-pope-ufo-secrets/",
    "timestamp": "2025-04-27T13:55:37Z"
  },
  {
    "title": "Election Diary: a cost-of-living election where neither leader can tell you the price of eggs",
    "description": "The fourth debate asked leaders to produce one-word responses to pictures of the prime minister’s Copacabana house, a three eyed fish and Elon Musk.",
    "link": "https://theconversation.com/election-diary-a-cost-of-living-election-where-neither-leader-can-tell-you-the-price-of-eggs-255385",
    "timestamp": "2025-04-27T13:54:32Z"
  },
  {
    "title": "'Paying the price for Biden': GOP senator blames ex-president for Trump's bad polling",
    "description": "Sen. John Kennedy (R-LA) suggested former President Joe Biden was to blame for President Donald Trump's poor approval rating on ending the war in Ukraine.\n\n\"There are brand new polling numbers that we've got out today that the American people do not think Pre…",
    "link": "https://www.rawstory.com/john-kennedy-trump-polling/",
    "timestamp": "2025-04-27T13:53:54Z"
  },
  {
    "title": "Trump: Income taxes will be reduced due to tariffs",
    "description": "United States President Donald Trump said on Sunday that when his tariffs \"cut in\" the citizens' income taxes will be \"substantially\" reduced, and maybe even eliminated.\"Focus will be on people making...",
    "link": "https://biztoc.com/x/3e6a9789696042f2",
    "timestamp": "2025-04-27T13:53:38Z"
  },
  {
    "title": "‘It’s Like a War Zone’: What Happened When Portland Legalized Fentanyl",
    "description": "After a failed experiment with decriminalization, Oregon’s liberal stronghold tries to chart a path out of the fentanyl crisis. Can the city find a balance between care and coercion?",
    "link": "http://www.rollingstone.com/culture/culture-features/portland-fentanyl-legalized-overdose-crisis-1235323248/",
    "timestamp": "2025-04-27T13:51:10Z"
  },
  {
    "title": "How Donald Trump’s tariffs handed Mark Carney and the Liberals an upper-hand in Canada polls",
    "description": "Donald Trump's return and aggressive trade policies, including tariffs on Canadian imports and annexation suggestions, dramatically reshaped Canada's political landscape. This external pressure propelled Liberal leader Mark Carney, emphasizing crisis manageme…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/how-donald-trumps-tariffs-handed-mark-carney-and-the-liberals-an-upper-hand-in-canada-polls/articleshow/120668536.cms",
    "timestamp": "2025-04-27T13:49:35Z"
  },
  {
    "title": "Secret California Court Settlement Deal Set to Weaken Crucial Oil Refinery Rules",
    "description": "Twelve years after an infamous Chevron fire in Richmond, California, two key regulations are being challenged in court.",
    "link": "https://publichealthwatch.org/2025/04/22/secret-deal-in-california-would-weaken-regulations-for-oil-refineries/",
    "timestamp": "2025-04-27T13:46:51Z"
  },
  {
    "title": "Trump has lowest 100-day approval rating in 80 years: POLL (Gary Langer/ABC News)",
    "description": "Gary Langer / ABC News:\nTrump has lowest 100-day approval rating in 80 years: POLL  —  Majorities of voters disapprove of many of Trump's policies, the poll found.  —  President Donald Trump talks to reporters in the Oval Office of the White House in Washingt…",
    "link": "https://www.memeorandum.com/250427/p15",
    "timestamp": "2025-04-27T13:45:01Z"
  },
  {
    "title": "This is what Trump and Emmanuel Macron said during firm handshake at Pope Francis’ funeral, lip reader reveals",
    "description": "First lady Melania Trump encouraged the President to start shaking hands with other world leaders during Pope Francis’ funeral Saturday. At one point during the three-hour Catholic mass, attendees were invited to share the “sign of peace” by shaking hands wit…",
    "link": "https://freerepublic.com/focus/f-news/4313570/posts",
    "timestamp": "2025-04-27T13:42:44Z"
  },
  {
    "title": "America's aging wind energy is here to stay despite Trump, and it needs a lot of 'repowering' work",
    "description": "On Inauguration Day, President Donald Trump issued an executive order indefinitely halting permits for new onshore wind energy projects on federal land, as well as new leases for offshore wind farms in U.S. coastal waters. The action not only fulfilled Trump'…",
    "link": "https://biztoc.com/x/6e8ca13ed9dfbb5c",
    "timestamp": "2025-04-27T13:42:27Z"
  },
  {
    "title": "Shedeur Sanders draft slide timeline: NFL executives cause media meltdown by rejecting polarizing prospect",
    "description": "Shedeur Sanders falling to the 144th pick in the NFL Draft rocked the nation this weekend, sparking heated conversations about race, religion and scouting.",
    "link": "https://www.foxnews.com/sports/shedeur-sanders-draft-fall-timeline-nfl-executives-cause-media-meltdown-rejecting-polarizing-prospect",
    "timestamp": "2025-04-27T13:40:49Z"
  },
  {
    "title": "'First sliver of hope I've had in a while': Jake Sullivan on Trump-Zelenskyy meeting",
    "description": "Martha Raddatz interviews former Biden White House National Security Adviser Jake Sullivan on \"This Week.\"",
    "link": "https://abcnews.go.com/Politics/trump-zelenskyy-meeting-sliver-hope-former-national-security/story?id=121201274",
    "timestamp": "2025-04-27T13:38:59Z"
  },
  {
    "title": "Trump Guts Farm-to-School Grants, Undermining “Make America Healthy Again” Plan",
    "description": "The U.S. Department of Agriculture cancelled a program intended to provide public schools with locally produced fresh vegetables.",
    "link": "https://grist.org/food-and-agriculture/trumps-latest-usda-cuts-undermine-his-plan-to-make-america-healthy-again/",
    "timestamp": "2025-04-27T13:38:51Z"
  },
  {
    "title": "UFC president says it ‘never stopped’ working with Russian fighters",
    "description": "Athletes from the country have continued to compete despite global tensions, Dana White has confirmed Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616388-ufc-never-stopped-working-with-russia/",
    "timestamp": "2025-04-27T13:37:58Z"
  },
  {
    "title": "Donald Trump's first 100 days wreak havoc in global trade, and now officials are claiming US President has 'torpedoes' in store",
    "description": "President Donald Trump has enacted sweeping changes on a wide range of U.S. domestic and foreign policy priorities since taking office on January 20.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-first-100-days-wreak-havoc-in-global-trade-and-now-officials-are-claiming-us-president-has-torpedoes-in-store/articleshow/120669229.cms",
    "timestamp": "2025-04-27T13:37:08Z"
  },
  {
    "title": "Pope Francis Refused to Be Silent on Gaza. Will His Successor Follow Suit?",
    "description": "Even from his hospital bed, Pope Francis continued his near-daily video calls in solidarity with Palestinians in Gaza.",
    "link": "https://truthout.org/articles/pope-francis-refused-to-be-silent-on-gaza-will-his-successor-follow-suit/",
    "timestamp": "2025-04-27T13:35:07Z"
  },
  {
    "title": "Bessent says he doesn't know if Trump has spoken with China’s Xi",
    "description": "Treasury Secretary Scott Bessent defended Trump’s negotiating strategy on trade deals but said he didn't know if Trump was speaking directly with Chinese President Xi.",
    "link": "https://abcnews.go.com/Politics/bessent-trump-spoken-chinas-xi/story?id=121201271",
    "timestamp": "2025-04-27T13:34:03Z"
  },
  {
    "title": "Trump giving ABC News 1st broadcast interview at 100 days mark",
    "description": "President Trump has prioritized immigration, government efficiency and trade.",
    "link": "https://abcnews.go.com/Politics/trump-giving-abc-news-1st-broadcast-interview-100/story?id=121211341",
    "timestamp": "2025-04-27T13:33:00Z"
  },
  {
    "title": "The Dems’ far-left agenda is just starting — and the worst is yet to come",
    "description": "To most Americans, the big problem with the Democratic Party is that it has moved too far left in recent years. If you’re among those who believe that, brace yourself. The worst is yet to come. A serious push is underway to move the party even further away fr…",
    "link": "https://freerepublic.com/focus/f-chat/4313567/posts",
    "timestamp": "2025-04-27T13:31:09Z"
  },
  {
    "title": "J.D. Vance’s Best Friend, the Canadian Politician, Has No Comment",
    "description": "Jamil Jivani has little to say about Vance in his campaign for Canadian parliament, after Trump destroyed America’s relations with its neighbor",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-canada-jd-vance-jivani-friend-1235325977/",
    "timestamp": "2025-04-27T13:30:00Z"
  },
  {
    "title": "Dutton names China as biggest threat to security as leaders' face off in fiery final debate",
    "description": "The major party leaders went head to head on national security and the cost of living, in a fiery debate hosted by Seven.",
    "link": "https://www.abc.net.au/news/2025-04-27/final-leaders-debate-federal-election/105221652",
    "timestamp": "2025-04-27T13:29:54Z"
  },
  {
    "title": "White House Correspondents’ Association President Delivers Defiant Message Amid Trump’s Dinner Snub: We Are Not ‘The Enemy of the People’",
    "description": "The outgoing head of the White House Correspondents' Association passionately defended the organization during Saturday's White House Correspondents' Dinner.\nThe post White House Correspondents’ Association President Delivers Defiant Message Amid Trump’s Dinn…",
    "link": "https://www.mediaite.com/news/white-house-correspondents-association-president-delivers-defiant-message-amid-trumps-dinner-snub-we-are-not-the-enemy-of-the-people/",
    "timestamp": "2025-04-27T13:27:42Z"
  },
  {
    "title": "Jim Cramer on e.l.f. Beauty, Inc. (ELF): ‘I Would Like You To Be In That Stock’",
    "description": "We recently published an article titled What Happened After Jim Cramer Talked About These 13 Stocks. In this article, we are going to take a look at where...",
    "link": "https://finance.yahoo.com/news/jim-cramer-e-l-f-132636589.html",
    "timestamp": "2025-04-27T13:26:36Z"
  },
  {
    "title": "Elections 2025: On Canadian Sovereignty and Independent Foreign Policy. With Politicians, Chossudovsky and Engler",
    "description": "“The Trump statement in regards to the 51st state is somewhat obsolete, because we’ve gone way past that. Our country is a military area of the United States of America, and without adequate consultations.”\n – Michel Chossudovsky, from this …\nThe post Electio…",
    "link": "https://www.globalresearch.ca/elections-2025-on-canadian-sovereignty-and-independent-foreign-policy-with-politicians-chossudovsky-and-engler/5885353",
    "timestamp": "2025-04-27T13:26:16Z"
  },
  {
    "title": "Experts On Russia Say Donald Trump Is Wrong About The War In Ukraine",
    "description": "Experts say Donald Trump misunderstands the history and causes of Russia’s invasion of Ukraine, making a fair peace deal more difficult.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/04/27/experts-on-russia-say-donald-trump-is-wrong-about-the-war-in-ukraine/",
    "timestamp": "2025-04-27T13:24:41Z"
  },
  {
    "title": "Jim Cramer Says Salesforce, Inc. (CRM) Is ‘Much More Disciplined Than The Critics Thought’",
    "description": "We recently published an article titled What Happened After Jim Cramer Talked About These 13 Stocks. In this article, we are going to take a look at where...",
    "link": "https://finance.yahoo.com/news/jim-cramer-says-salesforce-inc-132316009.html",
    "timestamp": "2025-04-27T13:23:16Z"
  },
  {
    "title": "'It Just Happened': Fox News Host Claims 'Trump Upstaged The Pope At The Funeral'",
    "description": "Fox News host Rachel Campos-Duffy claimed that President Donald Trump \"upstaged\" Pope Francis at his funeral over the weekend by meeting with Ukrainian President Volodymyr Zelenskyy.\n\n\n\"I think this is the takeaway from yesterday's funeral,\" Campos-Duffy said…",
    "link": "https://crooksandliars.com/2025/04/it-just-happened-fox-news-host-claims",
    "timestamp": "2025-04-27T13:22:35Z"
  },
  {
    "title": "An acid test: Trump, trade and troops: South Korea’s nightmare",
    "description": "Trump, trade and troops: South Korea’s nightmare\nAmid the tariff war, an interview with the acting president\nSOME OF the targets of President Donald Trump’s tariff threats, such as China and the European Union, are fighting back. South Korea and Japan feel th…",
    "link": "https://biztoc.com/x/66be6b0f35366c0c",
    "timestamp": "2025-04-27T13:20:31Z"
  },
  {
    "title": "Poll: Americans vent disappointment with Trump ahead of his 100-day mark, especially on tariffs",
    "description": "Americans are delivering a negative verdict on President Donald Trump’s performance as he nears the 100-day mark of his second term, according to a new NBC News Stay Tuned Poll, powered by SurveyMonkey.",
    "link": "https://biztoc.com/x/3ce72e6e14f54f46",
    "timestamp": "2025-04-27T13:20:21Z"
  },
  {
    "title": "CNN Poll: Trump's approval at 100 days lower than any president in at least seven decades (CNN)",
    "description": "CNN:\nCNN Poll: Trump's approval at 100 days lower than any president in at least seven decades  —  Donald Trump won back the Oval Office and took charge of the government amid the strongest poll numbers of his political career, but as the 100-day mark of his …",
    "link": "https://www.memeorandum.com/250427/p11",
    "timestamp": "2025-04-27T13:20:05Z"
  },
  {
    "title": "Lindell's Attorneys Like To Make Stuff Up In Legal Briefs",
    "description": "Mike Lindell has spent the last five years getting into trouble for making shit up about the 2020 elections and the voting machine companies. Feeling left out, Lindell's attorneys are now getting into trouble for making shit up, using AI-generated fake cases …",
    "link": "https://crooksandliars.com/2025/04/lindells-attorneys-make-stuff-legal-briefs",
    "timestamp": "2025-04-27T13:20:01Z"
  },
  {
    "title": "Gov. JB Pritzker, potential 2028 presidential candidate, headlines New Hampshire fundraiser",
    "description": "Gov. JB Pritzker is speaking at a major Democratic fundraiser in New Hampshire as he continues to build his national profile.",
    "link": "https://www.fox32chicago.com/news/pritzker-2028-new-hampshire-fundraiser",
    "timestamp": "2025-04-27T13:15:35Z"
  },
  {
    "title": "Hitler's First 100 Days — And Trump's",
    "description": "The fascism unleashed upon Germany beginning in January 1933 with the appointment of Hitler as Chancellor, the youngest ever, and that which unfolded within America with the second inauguration of Trump in January 2025 as President, the oldest ever, exhibited…",
    "link": "https://www.commondreams.org/opinion/hitler-trump-first-100-days",
    "timestamp": "2025-04-27T13:15:03Z"
  },
  {
    "title": "Iran Explosion Caused by Missile Fuel Supplied by China: Report",
    "description": "A deadly explosion at an Iranian port that killed at least 28 people on Saturday was caused by chemicals used for ballistic missile fuel, which had in turn been imported from China, according to media reports Sunday.\nThe post Iran Explosion Caused by Missile …",
    "link": "https://www.breitbart.com/middle-east/2025/04/27/iran-explosion-caused-by-missile-fuel-supplied-by-china-report/",
    "timestamp": "2025-04-27T13:14:58Z"
  },
  {
    "title": "President Trump's tariffs are hurting Massachusetts construction industry, lawmaker says",
    "description": "Massachusetts Congressman Stephen Lynch said that President Donald Trump's tariff uncertainty is concerning.",
    "link": "https://www.cbsnews.com/boston/news/stephen-lynch-president-trump-tariffs-construction/",
    "timestamp": "2025-04-27T13:14:20Z"
  },
  {
    "title": "America's aging wind energy is here to stay despite Trump climate retreat, and it needs a lot of work",
    "description": "Onshore wind turbines cover many parts of the U.S. and Trump's attacks on renewable energy won't stop that, but aging wind energy infrastructure does need work.",
    "link": "https://www.cnbc.com/2025/04/27/wind-power-trump-climate-change-energy-policy.html",
    "timestamp": "2025-04-27T13:13:30Z"
  },
  {
    "title": "Storm-1977 targets education sector with password spraying, Microsoft warns",
    "description": "Microsoft warns that threat actor Storm-1977 is behind password spraying attacks against cloud tenants in the education sector. Over the past year, Microsoft Threat Intelligence researchers observed a threat actor, tracked as Storm-1977, using AzureChecker.ex…",
    "link": "https://securityaffairs.com/177067/hacking/storm-1977-targets-education-sector-with-password-spraying-microsoft-warns.html",
    "timestamp": "2025-04-27T13:12:34Z"
  },
  {
    "title": "‘Really thrilled’: DHS touts ‘major success’ in one state after nabbing nearly 800 illegals in 4 days",
    "description": "'They can actually make arrests and clean up our streets get these criminal aliens off our streets'",
    "link": "https://www.wnd.com/2025/04/really-thrilled-dhs-touts-major-success-in-one-state-after-nabbing-nearly-800-illegals-in-4-days/",
    "timestamp": "2025-04-27T13:11:41Z"
  },
  {
    "title": "Track President Trump’s approval rating",
    "description": "Follow President Trump’s approval rating in NBC News polls and see how it compared to former Presidents Biden, Obama, Bush and Clinton. Updated regularly.",
    "link": "https://www.nbcnews.com/data-graphics/trump-approval-rating-poll-president-second-term-rcna202372",
    "timestamp": "2025-04-27T13:10:38Z"
  },
  {
    "title": "KEVIN MOONEY: Trump Makes America Independent From The Climate Grift",
    "description": "Donald Trump's abrupt shift back toward an \"America First\" energy policy has predictably caused heads to explode.",
    "link": "https://dailycaller.com/2025/04/27/opinion-trump-makes-america-independent-from-the-climate-grift-kevin-mooney/",
    "timestamp": "2025-04-27T13:09:29Z"
  },
  {
    "title": "Sunday, April 27. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,159.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/04/27/sunday-april-27-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-04-27T13:08:02Z"
  },
  {
    "title": "Ukraine’s Zelenskyy describes Vatican meeting with Trump as ‘productive’",
    "description": "Volodymyr Zelenskyy has described his encounter with Donald Trump at the Vatican as 'productive'.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/4/27/ukraines-zelenskyy-describes-vatican-meeting-with-trump-as",
    "timestamp": "2025-04-27T13:04:52Z"
  },
  {
    "title": "Who saved Donald Trump (and Geroge Bush)? - opinion",
    "description": "AI is pulling back the curtain on the Supreme Court’s unsigned rulings, raising new questions about transparency, authorship, and accountability.",
    "link": "https://www.jpost.com/opinion/article-851680",
    "timestamp": "2025-04-27T13:04:04Z"
  },
  {
    "title": "California, Which Bans Affirmative Action, Sues Trump over Anti-DEI Policy",
    "description": "The State of California joined several other states Friday in suing the Trump administration over a policy banning \"diversity, equity, and inclusion\" (DEI) in federally-funded schools, despite its own Proposition 209.\nThe post California, Which Bans Affirmati…",
    "link": "https://www.breitbart.com/education/2025/04/27/california-which-bans-affirmative-action-sues-trump-over-anti-dei-policy/",
    "timestamp": "2025-04-27T13:03:57Z"
  },
  {
    "title": "Ron and Casey DeSantis were plotting a political dynasty in Florida. Then came a scandal",
    "description": "A year after his presidential ambitions collapsed, Gov. Ron DeSantis and his wife Casey can no longer lay claim to the future of the Republican Party. And in...",
    "link": "https://www.cnn.com/2025/04/27/politics/ron-casey-desantis-florida-scandal",
    "timestamp": "2025-04-27T13:00:52Z"
  },
  {
    "title": "A Baby Boom? In This Economy?",
    "description": "The White House is full of pronatalist rhetoric — and anti-baby policies.",
    "link": "https://www.livemint.com/opinion/online-views/a-baby-boom-in-this-economy-11745758851134.html",
    "timestamp": "2025-04-27T13:00:50Z"
  },
  {
    "title": "Young men and women are taking the 'gender gap' to staggering new levels",
    "description": "The split between men and women is one of the starkest divisions in American politics right now — and that divide is deepest in Gen Z, which is taking the traditional gender gap in American politics and stretching it even further.",
    "link": "https://www.nbcnews.com/politics/elections/young-men-women-are-taking-poll-gender-gap-staggering-new-levels-rcna202672",
    "timestamp": "2025-04-27T13:00:42Z"
  },
  {
    "title": "Ivanka Trump makes Costa Rica splash vacationing with extended family for spring break",
    "description": "Ivanka Trump showed off her surfing skills while enjoying a family beach vacation in Costa Rica. The daughter of President Donald Trump is married to Jared Kushner.",
    "link": "https://www.foxnews.com/entertainment/ivanka-trump-makes-costa-rica-splash-vacationing-extended-family-spring-break",
    "timestamp": "2025-04-27T13:00:04Z"
  },
  {
    "title": "Ethereum’s 2025 Price Outlook: Drivers, Risks And The Range Of Possibilities",
    "description": "Wondering about Ethereum’s price in 2025? Explore this analysis of expert predictions, market trends, and key factors influencing its future value in 2025.",
    "link": "https://www.forbes.com/sites/digital-assets/article/ethereum-ether-price-prediction-2025/",
    "timestamp": "2025-04-27T13:00:00Z"
  },
  {
    "title": "Poll: Americans vent disappointment with Trump ahead of his 100-day mark, especially on tariffs",
    "description": "Americans are delivering a negative verdict on President Donald Trump’s performance as he nears the 100-day mark of his second term, according to a new NBC News Stay Tuned Poll, powered by SurveyMonkey.",
    "link": "https://www.nbcnews.com/politics/trump-administration/poll-americans-vent-disappointment-trump-ahead-100-day-mark-especially-rcna202656",
    "timestamp": "2025-04-27T13:00:00Z"
  },
  {
    "title": "10 charts prove that clean energy is winning — even in the Trump era",
    "description": "Climate progress is actually good business.",
    "link": "http://grist.org/energy/10-charts-prove-that-clean-energy-is-winning-even-in-the-trump-era/",
    "timestamp": "2025-04-27T13:00:00Z"
  },
  {
    "title": "Michael Tomasky: Trump Just Did the Most Corrupt Thing Any President Has Ever Done",
    "description": "Michael Tomasky is a veteran journalist who is the editor of The New Republic and editor in chief of Democracy. He has written for Newsweek, The Daily Beast, The American Prospect, and The New York Review of Books. When reading the article, it’s important to …",
    "link": "https://dianeravitch.net/2025/04/27/michael-tomasky-trump-just-did-the-most-corrupt-thing-any-president-has-ever-done/",
    "timestamp": "2025-04-27T13:00:00Z"
  },
  {
    "title": "Russia launches nearly 150 drones at Ukraine as Trump doubts Putin’s desire to end war",
    "description": "Russia launched a sweeping drone assault and airstrikes across Ukraine overnight into Sunday, killing at least four people, officials said, after U.S. President Donald Trump cast doubt over Russian President Vladimir Putin’s willingness to end the war.",
    "link": "https://nypost.com/2025/04/27/world-news/russia-launches-nearly-150-drones-at-ukraine-as-trump-doubts-putins-desire-to-end-war/",
    "timestamp": "2025-04-27T12:59:52Z"
  },
  {
    "title": "Trump disdains conservatism. His governing philosophy is absolute power | Sidney Blumenthal",
    "description": "The president’s clashes with the judiciary over immigration have launched a constitutional crisis. We’re headed toward a collision\nDonald Trump issued his declaration of war against his “enemies within” at the Department of Justice on 14 March. Thus the presi…",
    "link": "https://biztoc.com/x/a6cbd16b39d2834b",
    "timestamp": "2025-04-27T12:58:28Z"
  },
  {
    "title": "Trump order to loosen fishing regulations poses major risks, experts warn",
    "description": "Conservationists fear fallout from president’s proclamation on fishing in federally protected area of Pacific Ocean\nEnvironmental conservation groups are expressing major concerns over Donald Trump’s recent proclamation to reverse fishing regulations across t…",
    "link": "https://biztoc.com/x/77d44c4c1d5180b9",
    "timestamp": "2025-04-27T12:58:17Z"
  },
  {
    "title": "Heal This Sick Country: ‘Hands Up’ for the National Day of Action for Single Payer",
    "description": "On Jan 17, 2025, on the heels of the shooting of UnitedHealthcare CEO Brian Thompson, we \nwrote\r\n about the failed system of our corporate controlled healthcare and the outrage against the health insurance industry the shooting spawned. We mentioned the possi…",
    "link": "https://www.commondreams.org/opinion/heal-country-with-single-payer",
    "timestamp": "2025-04-27T12:56:02Z"
  },
  {
    "title": "SCOOP: Dolly Parton symphony concert heads to DC's Kennedy Center in event 'no one will want to miss'",
    "description": "The National Symphony Orchestra will perform Dolly Parton's Threads: My Songs in Symphony at the Kennedy Center in June, Fox News Digital exclusively learned.",
    "link": "https://www.foxnews.com/politics/scoop-dolly-parton-symphony-concert-heads-dcs-kennedy-center-event-no-one-want-miss",
    "timestamp": "2025-04-27T12:50:11Z"
  },
  {
    "title": "Trump Stuns Pope Funeral Attendees With Breathtaking Rendition Of 'Ave Maria'",
    "description": "VATICAN CITY — In a stirring tribute to Pope Francis, President Donald Trump took to the microphone during the pontiff's funeral services and stunned attendees by singing a gorgeous, captivating a capella rendition of &#34;Ave Maria&#34;.",
    "link": "https://babylonbee.com/news/trump-wows-pope-funeral-attendees-with-stunning-rendition-of-ave-maria",
    "timestamp": "2025-04-27T12:47:19Z"
  },
  {
    "title": "‘The ground split ... we decided to leave’: Families in Ethiopia displaced by earthquakes face uncertain future",
    "description": "The response to December’s earthquake in the struggling Afar region has been hit by US aid cuts",
    "link": "https://www.irishtimes.com/world/africa/2025/04/27/the-ground-split-we-decided-to-leave-families-in-ethiopia-displaced-by-earthquakes-face-uncertain-future/",
    "timestamp": "2025-04-27T12:40:09Z"
  },
  {
    "title": "SCOOP: Republicans roll out $69B funding plan for new CBP agents, building border wall in Trump budget bill",
    "description": "House Republicans are unveiling their plans for how to handle the border in their massive Trump agenda bill.",
    "link": "https://www.foxnews.com/politics/how-republicans-want-spend-90b-secure-border-trump-budget-bill",
    "timestamp": "2025-04-27T12:37:55Z"
  },
  {
    "title": "Trump’s crackdown on colleges is a good start — but more is needed to fix higher ed",
    "description": "Education Secretary Linda McMahon nailed it: Higher ed is a downright scam. Her Wall Street Journal column should force every taxpayer, official, student and parent to rethink the nation’s perverse system of financing higher ed.",
    "link": "https://nypost.com/2025/04/27/opinion/trump-crackdown-on-student-borrowers-and-colleges-is-great-but-wont-fix-higher-ed/",
    "timestamp": "2025-04-27T12:36:03Z"
  },
  {
    "title": "Trump, Zelenskyy hold ‘productive’ meeting at pope’s funeral",
    "description": "President Donald Trump’s trip to Rome for the pope’s funeral gave him the opportunity to meet face-to-face with Ukrainian President Zelenskyy for the first time since their oval office showdown back in February. Both sides came out of the 15-minute discussion…",
    "link": "https://www.today.com/video/trump-zelenskyy-call-meeting-at-pope-s-funeral-productive-238421573840",
    "timestamp": "2025-04-27T12:34:03Z"
  },
  {
    "title": "Millennials are giving Gen Z advice for their first potential recession | CNN Business",
    "description": "Millennials are giving Gen Z advice for their first potential recession | CNN Businesscnn.com",
    "link": "https://www.cnn.com/2025/04/27/business/millennials-gen-z-recession-advice/index.html",
    "timestamp": "2025-04-27T12:29:11Z"
  },
  {
    "title": "SHOCK POLL: Trump’s Approval Rating Plummets to Lowest in 80 Years for a President at the 100-Day Mark",
    "description": "If a shocking new poll is to be believed, the honeymoon for President Donald Trump is very much over — as his second term hits the 100-day mark.\nThe post SHOCK POLL: Trump’s Approval Rating Plummets to Lowest in 80 Years for a President at the 100-Day Mark fi…",
    "link": "https://www.mediaite.com/news/shock-poll-trumps-approval-rating-plummets-to-lowest-in-80-years-for-a-president-at-the-100-day-mark/",
    "timestamp": "2025-04-27T12:28:49Z"
  },
  {
    "title": "How a conservative legal doctrine — and his own 'stupidity' — could topple Trump",
    "description": "President Donald Trump is unique among “tyrants” — both in his cruelty and his “stupidity,” Guardian foreign affairs commentator Simon Tisdall writes. “Measured by willingness and capacity to harm the world’s poorest and most vulnerable, wreak global economic…",
    "link": "https://www.rawstory.com/trump-stupidity-2671853034/",
    "timestamp": "2025-04-27T12:28:43Z"
  },
  {
    "title": "Things to know about the US coal industry and proposed changes under the Trump administration",
    "description": "The U.S. coal industry has been in a steep decline for decades, and President Donald Trump’s administration has proposed several changes that would affect it",
    "link": "https://biztoc.com/x/dc6a58f9dd7eabb1",
    "timestamp": "2025-04-27T12:25:02Z"
  },
  {
    "title": "Are You Tired of Hearing About Antisemitism? Philip Giraldi",
    "description": "One might well ask how a group composed of little more than 3% of the US population has managed to gain control of the nation’s foreign policy, its legislature and executive branches, its media, its entertainment industry, its financial institutions, …\nThe po…",
    "link": "https://www.globalresearch.ca/tired-hearing-antisemitism/5885437",
    "timestamp": "2025-04-27T12:23:38Z"
  },
  {
    "title": "Ignatius van der Stock, Cashmere Valley Record, Yahoo, More: Sunday ResearchBuzz, April 27, 2025",
    "description": "NEW RESOURCES CODART: New Website Dedicated to Sonian Forest School Painter Ignatius van der Stock (1636-1668). “[The site] is dedicated to the work of Ignatius van der Stock (1636-1668), the fourth major […]",
    "link": "https://researchbuzz.me/2025/04/27/ignatius-van-der-stock-cashmere-valley-record-yahoo-more-sunday-researchbuzz-april-27-2025/",
    "timestamp": "2025-04-27T12:15:59Z"
  },
  {
    "title": "President Trump Wears Blue Suit to Funeral of Pope Francis – Sets Internet Ablaze",
    "description": "President Trump's choice of attire at Pope Francis's funeral has ignited a fervent online debate, reflecting broader cultural tensions. The implications of this event extend well beyond fashion choices.\nThe post President Trump Wears Blue Suit to Funeral of P…",
    "link": "https://www.thegatewaypundit.com/2025/04/hold-president-trump-wears-blue-suit-funeral-pope/",
    "timestamp": "2025-04-27T12:15:57Z"
  },
  {
    "title": "Experts Alarmed by China's Enormous Army of Robots",
    "description": "As Trump's trade war brings new levels of uncertainty to American manufacturing, it seems one aspect has been overlooked: China's massive legion of robot workers. A new report by the New York Times on Chinese robotics is shedding light on enormous scale of au…",
    "link": "https://futurism.com/china-robot-army-tariffs",
    "timestamp": "2025-04-27T12:15:51Z"
  },
  {
    "title": "Market turmoil has many afraid to check retirement savings",
    "description": "As President Donald Trump's trade war has injected turmoil in financial markets, many retired and near-retired Americans are anxiously looking on, worried about outliving their savings or having to put off entries on their bucket lists.",
    "link": "https://www.wsls.com/news/politics/2025/04/27/market-turmoil-has-many-afraid-to-check-retirement-savings/",
    "timestamp": "2025-04-27T12:15:22Z"
  },
  {
    "title": "Trump Is Straining Our Mental Health Then Gutting Support Services",
    "description": "The United States has been in the throes of a mental health and overdose crisis so severe it has spanned five presidential administrations and been classified as an official state of emergency in three of them. No one knows exactly how this emergency will pla…",
    "link": "https://tomdispatch.com/this-mental-health-awareness-month/",
    "timestamp": "2025-04-27T12:15:02Z"
  },
  {
    "title": "Govt to explain measures on US tariffs in May 5 special parliament session, says PM",
    "description": "KANGAR: A special Parliament session will take place from May 5 to explain the measures taken by the government on the issue of tariff hikes imposed by the United States on Malaysia. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/27/govt-to-explain-measures-on-us-tariffs-in-may-5-special-parliament-session-says-pm",
    "timestamp": "2025-04-27T12:15:00Z"
  },
  {
    "title": "The Enduring Joy of American Hitchhiking",
    "description": "Traveling by thumb isn’t popular anymore. Some say it should be.",
    "link": "https://www.theatlantic.com/culture/archive/2025/04/hitchhiking-american-experience/682603/",
    "timestamp": "2025-04-27T12:15:00Z"
  },
  {
    "title": "Things to know about the US coal industry and proposed changes under the Trump administration",
    "description": "The U.S. coal industry has been in a steep decline for decades, and President Donald Trump’s administration has proposed several changes that would affect it",
    "link": "https://abcnews.go.com/Business/wireStory/things-us-coal-industry-proposed-trump-administration-121210710",
    "timestamp": "2025-04-27T12:14:20Z"
  },
  {
    "title": "‘Shattered beyond repair’: Top Dem admits ‘war plan’ to defeat Trump agenda is not enough to retake Senate",
    "description": "Urges to stop being 'weak and woke' and emulate 'the g****** alpha energy' of NFL coach",
    "link": "https://www.wnd.com/2025/04/shattered-beyond-repair-top-dem-admits-war-plan-to-defeat-trump-agenda-is-not-enough-to-retake-senate/",
    "timestamp": "2025-04-27T12:13:05Z"
  },
  {
    "title": "Trump’s first 100 days: Steamrolling government, strong-arming allies and igniting trade wars",
    "description": "In his first 100 days, President Donald Trump exerted his power in a sweep and scale that has no easy historical comparison.",
    "link": "https://www.denverpost.com/2025/04/27/trumps-first-100-days-steamrolling-government-strong-arming-allies-and-igniting-trade-wars/",
    "timestamp": "2025-04-27T12:12:57Z"
  },
  {
    "title": "The implications of Trump’s big bet on tariffs",
    "description": "President Donald Trump’s massive wager on tariffs with your money came together over years. It took just days to fall apart. This is Part 4 of an in-depth, contemporaneous look at the first 100 days of Trump’s second term.",
    "link": "https://www.cnn.com/2025/04/27/politics/tariffs-trump-trade-war/index.html",
    "timestamp": "2025-04-27T12:12:40Z"
  },
  {
    "title": "Donald Trump's Approval Rating Plummets To New Low Ahead of 100 Days",
    "description": "Trump's support has declined among Americans in general, as well as in the key demographics of independents and white voters.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2064743",
    "timestamp": "2025-04-27T12:08:44Z"
  },
  {
    "title": "Prince William reportedly tried to get out of attending Pope Francis’s funeral",
    "description": "Prince William attended Pope Francis’s funeral mass on Saturday in Vatican City. William was not seated or placed in any kind of central position, unlike the actual world leaders, diplomats, kings and queens. William also chose to wear a dark navy suit to a f…",
    "link": "https://www.celebitchy.com/919541/prince_william_reportedly_tried_to_get_out_of_attending_pope_franciss_funeral/",
    "timestamp": "2025-04-27T12:08:31Z"
  },
  {
    "title": "As Musk gained power in Washington, his popularity has fallen, an AP-NORC poll finds",
    "description": "Elon Musk's popularity declines amidst his Washington role. A recent poll indicates a drop in his favorability. Many believe Musk wielded excessive influence. His work with President Trump involved downsizing the government. The Department of Government Effic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/as-musk-gained-power-in-washington-his-popularity-has-fallen-an-ap-norc-poll-finds/articleshow/120667996.cms",
    "timestamp": "2025-04-27T12:07:30Z"
  },
  {
    "title": "Trump's push to save the fading coal industry gets a warm embrace in West Virginia",
    "description": "President Donald Trump's executive orders aimed at boosting coal are getting a warm embrace in West Virginia",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-push-save-fading-coal-industry-gets-warm-121210609",
    "timestamp": "2025-04-27T12:06:32Z"
  },
  {
    "title": "JB Pritzker, a potential 2028 Democratic presidential candidate, headlines New Hampshire fundraiser",
    "description": "Illinois Gov. JB Pritzker is speaking at a major Democratic fundraiser in New Hampshire as he continues to build his national profile",
    "link": "https://abcnews.go.com/US/wireStory/jb-pritzker-potential-2028-democratic-presidential-candidate-headlines-121210800",
    "timestamp": "2025-04-27T12:06:30Z"
  },
  {
    "title": "Donald Trump wore blue to Pope Francis’s funeral, and Melania was there too",
    "description": "Donald Trump was one of two prominent men choosing to wear blue to Pope Francis’s funeral. I know we’re all in hell right now and there is no bottom, but “wearing black to a state funeral” is one of those dress-code rules which civil leaders can and should ad…",
    "link": "https://www.celebitchy.com/919548/donald_trump_wore_blue_to_pope_franciss_funeral_and_melania_was_there_too/",
    "timestamp": "2025-04-27T12:04:07Z"
  },
  {
    "title": "‘It feels personal’: Canadian farmers cope with Chinese tariffs on canola and peas",
    "description": "MOOSE JAW — Canola runs deep on Margaret Rigetti’s farm in southern Saskatchewan. Her grandfather was among the first to grow the bright yellow flowering crop in the 1970s, and it has been a staple ever since. “For a large part of Saskatchewan, the farm econo…",
    "link": "https://financialpost.com/pmn/it-feels-personal-canadian-farmers-cope-with-chinese-tariffs-on-canola-and-peas",
    "timestamp": "2025-04-27T12:01:44Z"
  },
  {
    "title": "Poll: Trump’s approval rating at 100 days in office",
    "description": "As the 100-day mark of Trump’s presidency approaches, Americans’ views of what he’s done so far have turned deeply negative, a new CNN poll conducted by SSRS finds.",
    "link": "https://www.cnn.com/2025/04/27/politics/approval-rating-trump-100-days/index.html",
    "timestamp": "2025-04-27T12:00:50Z"
  },
  {
    "title": "What’s at risk with cuts to federal humanities funding in Colorado? Book awards, library hours, educational resources and more",
    "description": "Colorado Humanities’ $1.5 million annual budget is largely funded by the $1.2 million a year the organization has received from the NEH.",
    "link": "https://www.denverpost.com/2025/04/27/colorado-humanities-libraries-funding-cuts-trump/",
    "timestamp": "2025-04-27T12:00:43Z"
  },
  {
    "title": "However Scared You Are, You Are Not Scared Enough",
    "description": "Back during the campaign, Trump pretended his “Dictator on Day 1” talk was just a joke. One hundred days in, it’s clear he was not joking.",
    "link": "https://www.huffpost.com/entry/trump-autocrat-supreme-court_n_680ab464e4b031fa917d7610",
    "timestamp": "2025-04-27T12:00:07Z"
  },
  {
    "title": "American Panopticon",
    "description": "The Trump administration is pooling data on Americans. Experts fear what comes next.",
    "link": "https://www.theatlantic.com/technology/archive/2025/04/american-panopticon/682616/",
    "timestamp": "2025-04-27T12:00:00Z"
  },
  {
    "title": "Pope Francis Laid to Rest in Sun-Drenched Vatican Funeral as Donald Trump, Joe Biden, and Prince William Look On",
    "description": "The funeral of Pope Francis filled St. Peter’s Square with world leaders, royalty, and the Catholic church’s highest-ranking officials.",
    "link": "https://www.vanityfair.com/news/story/pope-francis-funeral-exclusive-photos",
    "timestamp": "2025-04-27T12:00:00Z"
  },
  {
    "title": "Sunday Morning Talk Show Thread 27 April 2025",
    "description": "The Talk ShowsApril 27th, 2025 Guests to be interviewed today on major television talk shows:FACE THE NATION (CBS): Margaret Brennan anchors: Sen. Jeanne Shaheen (D-N.H.); Russian Foreign Minister Sergey Lavrov; Gary Cohn, former director of the National Econ…",
    "link": "https://freerepublic.com/focus/f-news/4313547/posts",
    "timestamp": "2025-04-27T11:59:33Z"
  },
  {
    "title": "Things to know about the US coal industry and proposed changes under the Trump administration",
    "description": "The U.S. coal industry has been in a steep decline for decades, and President Donald Trump’s administration has proposed several changes that would affect it.",
    "link": "https://www.clickondetroit.com/business/2025/04/27/things-to-know-about-the-us-coal-industry-and-proposed-changes-under-the-trump-administration/",
    "timestamp": "2025-04-27T11:56:29Z"
  },
  {
    "title": "Trump's push to save the fading coal industry gets a warm embrace in West Virginia",
    "description": "President Donald Trump's executive orders aimed at boosting coal are getting a warm embrace in West Virginia.",
    "link": "https://www.clickondetroit.com/business/2025/04/27/trumps-push-to-save-the-fading-coal-industry-gets-a-warm-embrace-in-west-virginia/",
    "timestamp": "2025-04-27T11:56:29Z"
  },
  {
    "title": "White House to evaluate officials’ loyalty to Trump – WSJ",
    "description": "“Faithful administration of the president’s policies” will be key to US civil servants keeping their jobs, the newspaper has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616386-trump-loyalty-official-us/",
    "timestamp": "2025-04-27T11:54:52Z"
  },
  {
    "title": "Russia launches 150 drones at Ukraine as Trump doubts Putin’s desire for peace",
    "description": "Russia launched a sweeping drone assault across Ukraine overnight into Sunday, targeting multiple regions, after US President Donald Trump cast doubt over Russian President Vladimir Putin’s willingness to end the war.",
    "link": "https://www.independent.ie/world-news/russia-launches-150-drones-at-ukraine-as-trump-doubts-putins-desire-for-peace/a494864102.html",
    "timestamp": "2025-04-27T11:48:38Z"
  }
]