[
  {
    "title": "Trump says criminal illegal aliens ‘make Hells Angels look like the sweetest people on Earth’",
    "description": "Trump claims criminal illegal immigrants 'make Hells Angels look like sweetest people' as he touts reverse migration from enhanced border enforcement operations.",
    "link": "https://www.foxnews.com/politics/trump-criminal-illegal-aliens-make-hells-angels-look-like-sweetest-people-earth",
    "timestamp": "2026-01-20T21:56:15Z"
  },
  {
    "title": "Global tourism hit new record level in 2025 despite weak U.S. results: U.N.",
    "description": "Global tourism hit a new record level in 2025 despite a dip in arrivals in North America due to &quot;weak results&quot; in the United States, U.N. Tourism said Tuesday. The number of international tourist arrivals recorded worldwide hit 1.52 billion in 2025,…",
    "link": "https://japantoday.com/category/features/travel/global-tourism-hit-new-record-level-in-2025-despite-%27weak%27-us-results-un",
    "timestamp": "2026-01-20T21:55:29Z"
  },
  {
    "title": "A Brief History of the Enduring American Embargo against Cuba",
    "description": "In recent years, Cubans have been forced to endure one of their worst shortages of basic necessities, such as food, medical supplies, and fuel. The fuel shortage has been particularly devastating, as it causes regular power outages, which makes it …\nThe post …",
    "link": "https://www.globalresearch.ca/brief-history-enduring-american-embargo-cuba/5912684",
    "timestamp": "2026-01-20T21:54:08Z"
  },
  {
    "title": "Mexico sends 37 cartel members to U.S. in latest offer to Trump administration",
    "description": "Mexico's security minister said Tuesday that it had sent another 37 members of Mexican drug cartels to the United States, as the Trump administration ratchets up pressure on governments to crack down on criminal networks it says are smuggling drugs across the…",
    "link": "https://japantoday.com/category/world/mexico-sends-37-cartel-members-to-us-in-latest-offer-to-trump-administration",
    "timestamp": "2026-01-20T21:52:22Z"
  },
  {
    "title": "Venezuela calls for 'symbolic' social media action after Trump post",
    "description": "Venezuela's government on Tuesday called on citizens to post its official map on social media as a &quot;symbolic action&quot; after U.S. ‌President Donald Trump posted an altered image showing U.S. flags over Venezuela, as well as Canada and Greenland. The i…",
    "link": "https://japantoday.com/category/world/venezuela-calls-for-%27symbolic%27-social-media-action-after-trump-post1",
    "timestamp": "2026-01-20T21:52:16Z"
  },
  {
    "title": "Iran warns Trump not to take action against Khamenei",
    "description": "Iran on Tuesday warned Donald Trump not to take any action against the country’s Supreme Leader Ayatollah Ali Khamenei, days after the U.S. president called for an end to Khamenei’s nearly 40-year reign. “Trump knows that if any hand of aggression is extended…",
    "link": "https://japantoday.com/category/world/spokesman-for-iran%27s-armed-forces-warns-trump-against-taking-action-against-khamenei",
    "timestamp": "2026-01-20T21:52:10Z"
  },
  {
    "title": "Justice Department subpoenas Walz and others in immigration enforcement obstruction investigation",
    "description": "Federal prosecutors served six grand jury subpoenas Tuesday to Minnesota officials as part of an investigation into whether they obstructed or impeded federal law enforcement during a sweeping immigration operation in Minneapolis-St. Paul area, a person famil…",
    "link": "https://japantoday.com/category/world/trump-administration-urges-judge-to-reject-minnesota%27s-attempt-to-stop-its-immigration-crackdown",
    "timestamp": "2026-01-20T21:52:05Z"
  },
  {
    "title": "ICE crackdown creates double-edged campaign issue for Republicans and Democrats",
    "description": "President Donald Trump's immigration crackdown is fast becoming a double-edged campaign issue in November's hotly contested midterm congressional elections because of mounting public unease over aggressive tactics by federal immigration officers. After an ICE…",
    "link": "https://japantoday.com/category/world/ice-crackdown-creates-double-edged-campaign-issue-for-republicans-and-democrats",
    "timestamp": "2026-01-20T21:51:40Z"
  },
  {
    "title": "Trump and Putin envoys say Davos meting on Ukraine was 'very positive' and 'constructive'",
    "description": "Envoys for U.S. President Donald Trump and Russian President Vladimir Putin said on Tuesday that their meeting in Davos on a possible ‌future peace deal to end the Ukraine war had been &quot;very positive&quot; and &quot;constructive&quot;. The United States …",
    "link": "https://japantoday.com/category/world/trump-and-putin-envoys-say-davos-meting-on-ukraine-was-%27very-positive%27-and-%27constructive%27",
    "timestamp": "2026-01-20T21:51:33Z"
  },
  {
    "title": "Russia's top diplomat says NATO faces a deep crisis over Greenland",
    "description": "The bid by U.S. President Donald Trump to take over Greenland heralds a “deep crisis” for NATO and raises questions about the alliance's preservation as a single military-political bloc, Russia's top diplomat said Tuesday.  “It was hard to imagine before that…",
    "link": "https://japantoday.com/category/world/russia%27s-top-diplomat-says-nato-faces-a-deep-crisis-over-greenland",
    "timestamp": "2026-01-20T21:51:22Z"
  },
  {
    "title": "Trump unloads on allies as Davos showdown looms",
    "description": "U.S. President Donald Trump has made an astonishing series of attacks apparently designed to humiliate allies France, Britain and Canada as the row over Greenland threatens to engulf the Davos forum. In a flurry of Truth Social posts and comments to reporters…",
    "link": "https://japantoday.com/category/world/trump-unloads-on-allies-as-davos-showdown-looms",
    "timestamp": "2026-01-20T21:50:59Z"
  },
  {
    "title": "Europe's leaders stand firm in Davos as CEOs warn on emotions",
    "description": "European leaders, rattled by Donald Trump's latest global gambit, are looking to present a united front in Davos, as CEOs warned against an emotional response to the U.S. president's ambition to take over Greenland. French President Emmanuel ‌Macron said the …",
    "link": "https://japantoday.com/category/world/europe%27s-leaders-stand-firm-in-davos-as-ceos-warn-on-emotions1",
    "timestamp": "2026-01-20T21:50:51Z"
  },
  {
    "title": "Trump doubts Greenland threats will spoil trade deal with Europe",
    "description": "Donald Trump expressed confidence that the European Union would continue to invest in the U.S. even if he imposed new tariffs. Read on",
    "link": "https://financialpost.com/news/trump-doubts-greenland-threats-spoil-trade-deal-europe",
    "timestamp": "2026-01-20T21:50:15Z"
  },
  {
    "title": "China meets initial soybean purchase goal, but Trump's shifting trade policy could disrupt deal",
    "description": "China has fulfilled its initial commitment to buy 12 million metric tons of soybeans from the U.S., but it's not clear if the trade agreement announced in October can withstand President Donald Trump's ever-shifting trade policy as American farmers are still …",
    "link": "https://japantoday.com/category/business/china-meets-initial-soybean-purchase-goal-but-trump%27s-shifting-trade-policy-could-disrupt-deal",
    "timestamp": "2026-01-20T21:49:44Z"
  },
  {
    "title": "Hochul’s $260 billion budget proposal includes no new taxes, increased spending on kids",
    "description": "Governor Hochul delivers remarks at the National Action Network Dr. Martin Luther King, Jr. Day Public Policy Forum.\n \n\nA strong year on Wall Street is helping net the state more than $10 billion in unexpected revenue. [ more › ]",
    "link": "https://gothamist.com/news/hochuls-260-billion-budget-proposal-includes-no-new-taxes-increased-spending-on-kids",
    "timestamp": "2026-01-20T21:47:00Z"
  },
  {
    "title": "Unprepared Trump looked 'angry' during speech as world pans his grievances: CNN reporter",
    "description": "President Donald Trump appeared unprepared and angry when he spoke at the White House podium during Tuesday's press briefing, according to one CNN reporter. Trump spoke for about 80 minutes at the briefing before taking questions from the press. His speech me…",
    "link": "https://www.rawstory.com/trump-2674914201/",
    "timestamp": "2026-01-20T21:46:53Z"
  },
  {
    "title": "WATCH: Election Denier Who Trump Tried to Pardon Caught On Camera in Prison Fight",
    "description": "Tina Peters was caught by prison security cameras getting into an altercation with another inmate; she is currently in prison for election tampering\nThe post WATCH: Election Denier Who Trump Tried to Pardon Caught On Camera in Prison Fight first appeared on M…",
    "link": "https://www.mediaite.com/politics/watch-election-denier-who-trump-tried-to-pardon-caught-on-camera-in-prison-fight/",
    "timestamp": "2026-01-20T21:46:26Z"
  },
  {
    "title": "Bitcoin enters Delaware Life’s retirement annuity portfolio",
    "description": "Delaware Life said it added a BlackRock index with Bitcoin exposure, using the iShares Bitcoin Trust ETF, issued by BlackRock, to its fixed indexed annuity lineup.",
    "link": "https://cointelegraph.com/news/bitcoin-delaware-life-retirement-annuity-portfolio",
    "timestamp": "2026-01-20T21:45:56Z"
  },
  {
    "title": "Lehigh County says it's evicting ICE agents from Allentown office",
    "description": "Lehigh County Executive Josh Siegel’s announcement to evict the ICE office came shortly after the county’s financial watchdog said the agency owes more than $115,000 in rent.",
    "link": "https://www.mcall.com/2026/01/20/lehigh-county-josh-siegel-evicting-ice-allentown-office/",
    "timestamp": "2026-01-20T21:45:29Z"
  },
  {
    "title": "The Charter of the Board of Peace",
    "description": "The Times of Israel published the text of the Charter of the Board of Peace. As I suspected, this is…\nThe post The Charter of the Board of Peace appeared first on Reason.com.",
    "link": "https://reason.com/volokh/2026/01/20/the-charter-of-the-board-of-peace/",
    "timestamp": "2026-01-20T21:45:07Z"
  },
  {
    "title": "Danish pension fund to sell $100 million in Treasurys, citing 'poor' U.S. government finances (Alex Harring/CNBC)",
    "description": "Alex Harring / CNBC:\nDanish pension fund to sell $100 million in Treasurys, citing ‘poor’ U.S. government finances … Danish pension operator AkademikerPension said it is exiting U.S. Treasurys because of finance concerns as Denmark spars with President Donald…",
    "link": "https://www.memeorandum.com/260120/p100",
    "timestamp": "2026-01-20T21:45:00Z"
  },
  {
    "title": "Trump Tariff Threat Over Greenland Called 'Crazy' & A 'Mistake'— Here's How They Could Impact You",
    "description": "Over the weekend, President Donald Trump proposed tariffs on eight NATO countries who have backed Greenland amid his push to acquire the territory.",
    "link": "https://www.forbes.com/sites/forbestv/2026/01/20/trump-tariff-threat-over-greenland-called-crazy--a-mistake--heres-how-they-could-impact-you/",
    "timestamp": "2026-01-20T21:44:47Z"
  },
  {
    "title": "Takaichi invited to join Trump's controversial Gaza 'Board of Peace'",
    "description": "Japanese Prime Minister Sanae Takaichi has been invited by U.S. President Donald Trump to join a new international body he has proposed to oversee the reconstruction of Gaza, the Foreign Ministry said Tuesday. Takaichi is considering whether to take part in T…",
    "link": "https://japantoday.com/category/politics/japan-pm-takaichi-invited-to-join-trump%27s-controversial-gaza-peace-panel",
    "timestamp": "2026-01-20T21:44:01Z"
  },
  {
    "title": "US stocks sink as Trump threatens tariffs on 8 NATO members",
    "description": "US stocks sink as Trump threatens tariffs on 8 NATO membersnikkei.com",
    "link": "https://asia.nikkei.com/business/markets/equities/us-stocks-sink-as-trump-threatens-tariffs-on-8-nato-members",
    "timestamp": "2026-01-20T21:42:16Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "The Secretary-General condemns in the strongest terms the Israeli authorities’ actions to demolish the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) Sheikh Jarrah compound, urging them to immediately cease the demoliti…",
    "link": "https://press.un.org/en/2026/db260120.doc.htm",
    "timestamp": "2026-01-20T21:41:31Z"
  },
  {
    "title": "Hope Is Not a Policy for Iran",
    "description": "Washington’s record of failed intervention offers an obvious lesson. Trump should heed it.",
    "link": "http://foreignpolicy.com/2026/01/20/trump-iran-syria-iraq-libya-venezuela-intervention/",
    "timestamp": "2026-01-20T21:40:09Z"
  },
  {
    "title": "Trump shared edited photo featuring map with Venezuela, Canada and Greenland covered by US flag",
    "description": "In January 2026, U.S. President Donald Trump shared a photograph of a map with Venezuela, Canada and Greenland covered with the U.S. flag on his Truth Social account.",
    "link": "https://www.snopes.com//fact-check/trump-venezuela-canada-greenland-map/",
    "timestamp": "2026-01-20T21:40:00Z"
  },
  {
    "title": "‘Very Low Energy’: CNN Anchors Marvel At Trump’s Odd Beginning to Lengthy WH Briefing",
    "description": "\"We noticed it right away—it was very low energy in the beginning, sort of reading, sort of doing a weave,” noted Erica Hill\nThe post ‘Very Low Energy’: CNN Anchors Marvel At Trump’s Odd Beginning to Lengthy WH Briefing first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/very-low-energy-cnn-anchors-marvel-at-trumps-odd-beginning-to-lengthy-wh-briefing/",
    "timestamp": "2026-01-20T21:39:27Z"
  },
  {
    "title": "Trump calls out Supreme Court justices after trans athlete hearing: 'Should lose a lot of credibility'",
    "description": "President Donald Trump said Supreme Court justices supporting transgender athletes in women's sports should 'lose credibility' and calls the issue unfair to women.",
    "link": "https://www.foxnews.com/sports/trump-calls-out-supreme-court-justices-after-trans-athlete-hearing-should-lose-lot-credibility",
    "timestamp": "2026-01-20T21:37:48Z"
  },
  {
    "title": "'You'll find out,' Trump says on Greenland takeover strategy",
    "description": "Trump will be meeting with world leaders at the World Economic Forum in Davos, Switzerland later this week.",
    "link": "https://www.cnbc.com/2026/01/20/trump-greenland-takeover-strategy.html",
    "timestamp": "2026-01-20T21:36:26Z"
  },
  {
    "title": "Trump added $2.25 trillion to the national debt in his first year back in charge, watchdog says",
    "description": "The Peter G. Peterson Foundation, a nonpartisan budget watchdog, ran the numbers exclusively for Fortune.",
    "link": "https://fortune.com/2026/01/20/how-much-national-debt-grew-trump-first-year-back-in-office-president/",
    "timestamp": "2026-01-20T21:36:17Z"
  },
  {
    "title": "WATCH: President Trump on Greenland's self-determination",
    "description": "ABC News' Mary Bruce asked President Donald Trump \"what gives the U.S. the right\" to take away the self-determination of Greenlanders who've said they don't want to be part of the U.S.?",
    "link": "https://abcnews.go.com/US/video/president-trump-greenlands-determination-129396881",
    "timestamp": "2026-01-20T21:35:59Z"
  },
  {
    "title": "What’s behind Trump’s push to control Greenland?",
    "description": "As Trump escalates threats to seize Greenland, Inuit Greenlanders reject being treated as geopolitical pawns.",
    "link": "https://www.aljazeera.com/video/the-take-2/2026/1/20/aje-onl-grl_greenlandtakeover_av_v3-200126",
    "timestamp": "2026-01-20T21:35:20Z"
  },
  {
    "title": "Europe’s 'appeasement' strategy with Trump has failed. So what comes next?",
    "description": "On Tuesday, U.S. President Donald Trump accused British Prime Minister Keir Starmer of an act of “great stupidity” for returning an island to Mauritius that houses an important military base. The episode shows how fast Trump can turn on international partners…",
    "link": "https://www.cbc.ca/news/world/trump-eu-greenland-starmer-9.7053146",
    "timestamp": "2026-01-20T21:33:10Z"
  },
  {
    "title": "“That’s Why His Face Is Droopy”: Trump Tries To Shut Down Health Speculation As Doctor Raises Concerns",
    "description": "“Earlier in 2025, he was garbling words,” the doctor said.",
    "link": "https://www.boredpanda.com/donald-trump-shuts-down-health-speculations-doctor-raise-concerns/",
    "timestamp": "2026-01-20T21:32:39Z"
  },
  {
    "title": "Canada Rags On America At Globalist Meetup After Shaking Hands With China",
    "description": "Canadian Prime Minister Mark declared that the global order is experiencing a “rupture” as President Trump continues to push for U.S. control over Greenland.",
    "link": "https://dailycaller.com/2026/01/20/canada-rags-on-america-at-globalist-meetup-after-shaking-hands-with-china/",
    "timestamp": "2026-01-20T21:32:27Z"
  },
  {
    "title": "Trump says he hopes Renee Good's father is still a 'Trump fan' following Minneapolis 'tragedy'",
    "description": "President Donald Trump says he hopes Renee Good's father remains a supporter after the woman died in an ICE shooting in Minneapolis Jan. 7, calling the incident a tragedy.",
    "link": "https://www.foxnews.com/politics/trump-says-he-hopes-renee-goods-father-still-trump-fan-following-minneapolis-tragedy",
    "timestamp": "2026-01-20T21:32:01Z"
  },
  {
    "title": "Trump refuses to say how far he'll go on Greenland",
    "description": "US President Donald Trump has refused to say how far he will go on Greenland, but suggested that he could make a deal as European leaders voice alarm over his threats to seize the territory from ally Denmark.",
    "link": "https://www.rte.ie/news/us/2026/0120/1554189-trump-one-year/",
    "timestamp": "2026-01-20T21:30:49Z"
  },
  {
    "title": "Thousands protest against Trump immigration policies",
    "description": "By Andrew HayJan 20 (Reuters) - Thousands of U.S. workers and students marched through cities and university campuses on Tuesday in opposition to the immigration policies… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/thousands-protest-against-trump-immigration-policies",
    "timestamp": "2026-01-20T21:30:02Z"
  },
  {
    "title": "Imprisoned MAGA ally caught on camera in physical altercation with fellow inmate",
    "description": "New video footage shows imprisoned MAGA election conspiracy theorist ally Tina Peters getting into a physical altercation with a fellow inmate.In the footage, released to Next 9NEWS by the Colorado Department of Corrections, Peters is wheeling a large cart ac…",
    "link": "https://www.rawstory.com/tina-peters-2674913999/",
    "timestamp": "2026-01-20T21:29:06Z"
  },
  {
    "title": "EU faces possibility of ‘entire breakdown’ in transatlantic relationship, Tánaiste says",
    "description": "Bloc’s leaders prepare diplomatic blitz to lobby Donald Trump to row back on Greenland, tariff threats",
    "link": "https://www.irishtimes.com/politics/2026/01/20/eu-faces-possibility-of-entire-breakdown-in-transatlantic-relationship-tanaiste-says/",
    "timestamp": "2026-01-20T21:28:18Z"
  },
  {
    "title": "Senator Calls for Trump to Be Impeached Over Leaked Greenland Texts",
    "description": "Trump said he does not “feel an obligation to think purely of Peace” because he was passed over for the Nobel prize.",
    "link": "https://truthout.org/articles/senator-calls-for-trump-to-be-impeached-over-leaked-greenland-texts/",
    "timestamp": "2026-01-20T21:27:21Z"
  },
  {
    "title": "Trump told to 'f--- off' by Danish lawmaker during European Parliament debate about Greenland",
    "description": "European Parliament member Anders Vistisen confronts President Donald Trump's Greenland interest with profanity-laced rebuke, drawing a reprimand from parliament leadership.",
    "link": "https://www.foxnews.com/world/trump-told-f-k-off-danish-lawmaker-european-parliament-greenland-debate",
    "timestamp": "2026-01-20T21:27:20Z"
  },
  {
    "title": "Reporter Smacks Back at Stephen Miller for Misrepresenting His Report On How Bad Trump Admin Is Doing In Court",
    "description": "Politico senior legal affairs reporter Kyle Cheney smacked back at White House adviser Stephen Miller for sharing a misleading screenshot of a headline from one of his articles.\nThe post Reporter Smacks Back at Stephen Miller for Misrepresenting His Report On…",
    "link": "https://www.mediaite.com/lawcrime/reporter-smacks-back-at-stephen-miller-for-misrepresenting-his-report-on-how-bad-trump-admin-is-doing-in-court/",
    "timestamp": "2026-01-20T21:26:43Z"
  },
  {
    "title": "Usha Vance, Wife of Vice President J.D. Vance, Pregnant With Fourth Child",
    "description": "Reading Time: 2 minutesUsha and J.D. Vance are expecting their fourth child, a boy.\nUsha Vance, Wife of Vice President J.D. Vance, Pregnant With Fourth Child was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/01/usha-vance-wife-of-vice-president-j-d-vance-pregnant-with-fourth-child/",
    "timestamp": "2026-01-20T21:26:24Z"
  },
  {
    "title": "BREAKING: Justice Department Subpoenas Walz, Frey, Other Leaders Amid Opposition to ICE",
    "description": "The Justice Department has issued subpoenas for Minnesota’s Democrat leaders amid claims of conspiracy to impede federal law enforcement, sources say. The Justice Department has... Read More\nThe post BREAKING: Justice Department Subpoenas Walz, Frey, Other Le…",
    "link": "https://www.dailysignal.com/2026/01/20/breaking-justice-department-subpoenas-walz-frey-other-democrats-amid-opposition-ice/",
    "timestamp": "2026-01-20T21:26:05Z"
  },
  {
    "title": "Mayor Mamdani says he supports abolishing ICE, calls for 'humanity' in dealing with immigration issues",
    "description": "Mayor Mamdani says he supports abolishing ICE, calls for 'humanity' in dealing with immigration issuesgo.com",
    "link": "https://abcnews.go.com/Politics/mayor-mamdani-supports-abolishing-ice-calls-humanity-dealing/story?id=129385475",
    "timestamp": "2026-01-20T21:26:00Z"
  },
  {
    "title": "Judge orders Lindsey Halligan to stop using US attorney title or face disciplinary action",
    "description": "Judge orders Lindsey Halligan to stop using US attorney title or face disciplinary actiongo.com",
    "link": "https://abcnews.go.com/US/judge-orders-lindsey-halligan-stop-us-attorney-title/story?id=129394308",
    "timestamp": "2026-01-20T21:26:00Z"
  },
  {
    "title": "Today’s Atlantic Trivia: Nobel? Please, Prize Committee!",
    "description": "Test your knowledge—and read our latest stories for a little extra help.",
    "link": "https://www.theatlantic.com/newsletters/2026/01/daily-trivia-questions-answers-week-15/685685/",
    "timestamp": "2026-01-20T21:24:47Z"
  },
  {
    "title": "J.D. Vance and His Wife Usha Expecting Their Fourth Child",
    "description": "J.D. Vance and his wife Usha are gonna have to add one more seat to their dinner table in the near future -- because they're expecting a fourth child! The second lady shared the big news on his X account on Tuesday, and ... drumroll, please ...…\n Permalink",
    "link": "https://www.tmz.com/2026/01/20/jd-vance-wife-usha-expecting-baby/",
    "timestamp": "2026-01-20T21:24:44Z"
  },
  {
    "title": "Europe's Biggest Advantage in the Showdown Over Greenland? America's Huge Pile of Debt.",
    "description": "America's large and growing national debt is not just a budgetary liability, but increasingly a geopolitical one too.",
    "link": "https://reason.com/2026/01/20/europes-biggest-advantage-in-the-showdown-over-greenland-americas-huge-pile-of-debt/",
    "timestamp": "2026-01-20T21:24:15Z"
  },
  {
    "title": "Wall Street sinks as Trump threatens 8 European countries with tariffs over Greenland",
    "description": "Wall Street sinks as Trump threatens 8 European countries with tariffs over Greenlandlocal10.com",
    "link": "https://www.local10.com//business/2026/01/20/wall-street-sinks-as-trump-threatens-8-european-countries-with-tariffs-over-greenland/",
    "timestamp": "2026-01-20T21:23:23Z"
  },
  {
    "title": "ICE Has Cut Its Detainees Off From Medical Care",
    "description": "Immigrations and Customs Enforcement has stopped paying for immigrant detainees to receive health care—and isn’t planning on paying for months, independent journalist Judd Legum reported Tuesday.  ICE Health Service Corps, the entity that provides immigrants …",
    "link": "https://newrepublic.com/post/205458/ice-detainees-pay-for-medical-care",
    "timestamp": "2026-01-20T21:23:22Z"
  },
  {
    "title": "Sen. Ruben Gallego says Trump is a 'madman' as he threatens NATO ally over Greenland",
    "description": "Sen. Ruben Gallego erupted during a CNN interview, blasting President Donald Trump over renewed threats to annex Greenland and warning that allies are making a dangerous mistake by treating the rhetoric as normal. Calling Trump a “madman” divorced from realit…",
    "link": "https://www.rawstory.com/greenland-2674912780/",
    "timestamp": "2026-01-20T21:22:41Z"
  },
  {
    "title": "The Irish Times view on Trump’s Gaza peace board: another power play by the US president",
    "description": "The board would be an extraordinary personal vehicle for Trump to try to dominate the diplomatic stage",
    "link": "https://www.irishtimes.com/opinion/editorials/2026/01/20/the-irish-times-view-on-trumps-gaza-peace-board-another-power-play-by-the-us-president/",
    "timestamp": "2026-01-20T21:21:00Z"
  },
  {
    "title": "Scott Jennings Gets Very Upset When People Call Him Human Garbage To His Face!",
    "description": "Do it more.",
    "link": "https://www.wonkette.com/p/scott-jennings-gets-very-upset-when",
    "timestamp": "2026-01-20T21:20:24Z"
  },
  {
    "title": "“There can be no going back”: Trump pushes forward on Greenland",
    "description": "Despite European leaders’ pleas, Trump refuses to back down on Greenland",
    "link": "https://www.salon.com/2026/01/20/there-can-be-no-going-back-trump-pushes-forward-on-greenland/",
    "timestamp": "2026-01-20T21:18:57Z"
  },
  {
    "title": "JD Vance And Usha Vance Announce She Is Pregnant",
    "description": "The vice president and second lady are expecting a baby boy due in July.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2026/01/20/jd-vance-and-usha-vance-announce-she-is-pregnant/",
    "timestamp": "2026-01-20T21:17:57Z"
  },
  {
    "title": "Wall Street Sinks As Trump Threatens 8 European Countries With Tariffs Over Greenland",
    "description": "Stocks sank on Wall Street after Trump threatened to hit eight European countries with new tariffs as tensions escalate over his attempts to assert American control over Greenland.",
    "link": "https://www.huffpost.com/entry/ap-financial-markets-wall-street-sinks-trump-threats_n_696ff035e4b06c2b9736c533",
    "timestamp": "2026-01-20T21:17:23Z"
  },
  {
    "title": "Mexico hands over dozens more suspected cartel members to US",
    "description": "Mexico has handed 37 suspected members of drug cartels to the US amid the US president's military threats.",
    "link": "https://www.channelnewsasia.com/world/mexico-drug-cartels-trump-sheinbaum-us-5871936",
    "timestamp": "2026-01-20T21:16:52Z"
  },
  {
    "title": "'Don't Thank Us...': Airline Hits Back At Elon Musk With A Dastardly Deal",
    "description": "The budget airline used the billionaire's platform to whack him on the head over his latest online \"tantrum.\"",
    "link": "https://www.huffpost.com/entry/ryanair-elon-musk-deal_n_696fdb53e4b02ee48dde29ee",
    "timestamp": "2026-01-20T21:16:30Z"
  },
  {
    "title": "Trump Teams Up With MAGA Reporter to Resurrect Bonkers 2020 Election Conspiracy Theory",
    "description": "President Donald Trump teamed up with LindellTV's Cara Castronuova to resurrect a bonkers 2020 election conspiracy theory on Tuesday.\nThe post Trump Teams Up With MAGA Reporter to Resurrect Bonkers 2020 Election Conspiracy Theory first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-teams-up-with-maga-reporter-to-resurrect-bonkers-2020-election-conspiracy-theory/",
    "timestamp": "2026-01-20T21:15:34Z"
  },
  {
    "title": "Donald Trump Tells Reporter “You’ll Find Out” How Far He’ll Go To Acquire Greenland; POTUS Marks A Year In Office With Meandering Press Briefing",
    "description": "Donald Trump appeared in the White House Briefing Room on Tuesday for a marathon session to outline his accomplishments marking one year in office. After nearly 80 minutes of speaking, the president took questions, including ones having to do with his threats…",
    "link": "http://deadline.com/2026/01/trump-greenland-press-briefing-1236690631/",
    "timestamp": "2026-01-20T21:15:20Z"
  },
  {
    "title": "Greenland and threat of Trump tariffs loom over Davos",
    "description": "Corporate chiefs and government leaders, including U.S. President Donald Trump, are meeting in Davos, Switzerland, this week, joining an elite annual World Economic Forum.",
    "link": "https://richmond.com/news/nation-world/business/article_ad82fefc-7967-57dd-97a5-dc36f22620cf.html",
    "timestamp": "2026-01-20T21:15:00Z"
  },
  {
    "title": "Trump v Powell: How the DoJ inquiry raises risks for Fed independence – Generate Wealth Weekly",
    "description": "OPINION: The clash comes as Donald Trump pushes for faster rate cuts before mid-terms.",
    "link": "https://www.nzherald.co.nz/business/personal-finance/investment/trump-vs-powell-how-the-doj-inquiry-raises-risks-for-fed-independence-generate-wealth-weekly/WCLN4VTP4VEALL6AZUJ3GVUPYM/",
    "timestamp": "2026-01-20T21:13:34Z"
  },
  {
    "title": "Trump says 'you’ll find out' when asked how far he’ll go on Greenland takeover",
    "description": "President Trump offered a cryptic \"you'll find out\" response on Greenland takeover plans, dismissing NATO concerns as he prepares to head to Davos amid tariff threats.",
    "link": "https://www.foxnews.com/politics/trump-says-youll-find-out-when-asked-how-far-hell-go-greenland-takeover",
    "timestamp": "2026-01-20T21:12:42Z"
  },
  {
    "title": "Trump says 'you’ll see' when asked how far he’ll go on Greenland takeover",
    "description": "President Trump offers cryptic 'you'll see' response on Greenland takeover plans, dismissing NATO concerns as he prepares to head to Davos amid tariff threats.",
    "link": "https://www.foxnews.com/politics/trump-says-youll-see-when-asked-how-far-hell-go-greenland-takeover",
    "timestamp": "2026-01-20T21:12:42Z"
  },
  {
    "title": "ROOKE: Three Left-Leaning Catholic Cardinals Defy Their Vocation, Launch Attacks On US",
    "description": "Three cardinals banded together to levy a partisan attack on the Trump administration, without consideration for the flock they are required to care for.",
    "link": "https://dailycaller.com/2026/01/20/rooke-catholic-church-blase-cupich-robert-mcelroy-joseph-tobin-trump-greenland/",
    "timestamp": "2026-01-20T21:12:25Z"
  },
  {
    "title": "Beth Rigby: Starmer's bigger crisis could be closer to home - and may decide his fate",
    "description": "While the prime minister focuses on foreign affairs, his deputy Labour leader has a message for those frustrated with his performance back home. But voters will soon have their say, and it looks ominous.",
    "link": "https://news.sky.com/story/beth-rigby-starmers-bigger-crisis-could-be-closer-to-home-and-may-decide-his-fate-13496816",
    "timestamp": "2026-01-20T21:11:00Z"
  },
  {
    "title": "Military archbishop says a US attack on Greenland would be unjust",
    "description": "The archbishop who oversees Catholic priests across the U.S. military questioned the moral justification of an invasion of Greenland.",
    "link": "http://taskandpurpose.com/news/military-chaplain-greenland-disobey-orders/",
    "timestamp": "2026-01-20T21:09:35Z"
  },
  {
    "title": "Europe May Restrict U.S. Trade Over Trump’s Greenland Threats",
    "description": "European leaders have condemned Trump’s push for U.S. control of Greenland.",
    "link": "https://www.forbes.com/sites/tylerroush/2026/01/20/europe-may-restrict-us-trade-over-trumps-greenland-threats/",
    "timestamp": "2026-01-20T21:09:16Z"
  },
  {
    "title": "California Gov. Newsom should fix own ‘broken’ state, White House tells The Post",
    "description": "California Gov. Gavin Newsom should “stop undermining the US on the world stage” and fix his own “broken” state, the White House told The Post in an exclusive statement.",
    "link": "https://nypost.com/2026/01/20/us-news/california-gov-newsom-should-fix-own-broken-state-white-house-tells-the-post/",
    "timestamp": "2026-01-20T21:09:08Z"
  },
  {
    "title": "Trump Proclaims ‘God Is Very Proud’ of His First Year Back in the White House",
    "description": "Trump on Tuesday proclaimed \"God is very proud\" of him and the job he has done since returning to office in a sprawling 105 minute White House press briefing\nThe post Trump Proclaims ‘God Is Very Proud’ of His First Year Back in the White House first appeared…",
    "link": "https://www.mediaite.com/media/news/trump-proclaims-god-is-very-proud-of-his-first-year-back-in-the-white-house/",
    "timestamp": "2026-01-20T21:09:05Z"
  },
  {
    "title": "“If We’re Going to Say His Name, Then We Have to Continue the Fight”",
    "description": "Voices from Seattle's 43rd Annual MLK Day March.\n \n by Marcus Harrison Green\n \n \n \n Photos by John Caplinger for The Stranger\nOn a gentle January morning, against the backdrop of civil rights being dismantled in plain sight across the country, thousands gathe…",
    "link": "https://www.thestranger.com/news/2026/01/20/80429105/if-were-going-to-say-his-name-then-we-have-to-continue-the-fight",
    "timestamp": "2026-01-20T21:09:00Z"
  },
  {
    "title": "Doctor who treated Dick Cheney calls for congressional inquiry into Trump’s presidential fitness - NewsBreak",
    "description": "Doctor who treated Dick Cheney calls for congressional inquiry into Trump’s presidential fitness - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4450906856104-doctor-who-treated-dick-cheney-calls-for-congressional-inquiry-into-trump-s-presidential-fitness?_f=app_share&amp;pd=04jUeKTH&amp;lang=en_US&amp;send_time=1768943306&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.0.49%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-20T21:08:54Z"
  },
  {
    "title": "Ex-Trump Official Unleashes On Trump’s ‘Mentally Ill, Deranged’ Greenland Threats",
    "description": "\"I don’t say this lightly,\" former White House deputy press secretary Sarah Matthews said on MS NOW.",
    "link": "https://www.huffpost.com/entry/trump-greenland-official-deranged-white-house_n_696fc0e5e4b02ee48dde0504",
    "timestamp": "2026-01-20T21:08:52Z"
  },
  {
    "title": "Minnesota Gov. Walz invites Trump to visit state to 'see our values in action' after ICE feud",
    "description": "Minnesota Gov. Tim Walz invited President Trump to visit state amid heated dispute over federal ICE operations in Minneapolis targeting criminal illegal immigrants.",
    "link": "https://www.foxnews.com/politics/minnesota-gov-walz-invites-trump-visit-state-see-our-values-action-ice-feud",
    "timestamp": "2026-01-20T21:08:48Z"
  },
  {
    "title": "Why this Canadian is deputy commanding general of U.S. troops in Alaska that could be sent to Minneapolis",
    "description": "US media have quoted unnamed military sources as saying that the 11th Airborne has been told to prepare for possible deployment to MInnesota",
    "link": "https://nationalpost.com/news/canada/us-11th-airborne-division-alaska-canadian",
    "timestamp": "2026-01-20T21:06:47Z"
  },
  {
    "title": "Watch: Jon Stewart Addresses Rallying Cry for Him to Run for Office",
    "description": "Jon Stewart dismissed a fan's suggestion that he run for office as \"desperation,\" as well as \"dissatisfaction\" with \"the status quo,\" adding, \"You see somebody on television who's saying some of the things that resonate with you, and you think, 'Well, f**k it…",
    "link": "https://www.breitbart.com/entertainment/2026/01/20/watch-jon-stewart-addresses-rallying-cry-for-him-to-run-for-office/",
    "timestamp": "2026-01-20T21:06:46Z"
  },
  {
    "title": "Trump Makes Bold Immigration Claim That Puts Kristi Noem in Hot Seat",
    "description": "At the White House press briefing today, President Donald Trump claimed that in the last eight months, there has been \"zero\" illegal immigration into the United States.",
    "link": "https://www.ibtimes.com/trump-makes-bold-immigration-claim-that-puts-kristi-noem-hot-seat-3795791",
    "timestamp": "2026-01-20T21:06:10Z"
  },
  {
    "title": "365 WINS IN 365 DAYS: President Trump's Return Marks New Era of Success, Prosperity (The White House)",
    "description": "The White House:\n365 WINS IN 365 DAYS: President Trump's Return Marks New Era of Success, Prosperity  —  One year ago today, President Donald J. Trump returned to office with a resounding mandate to restore prosperity, secure the border, rebuild American stre…",
    "link": "https://www.memeorandum.com/260120/p95",
    "timestamp": "2026-01-20T21:05:00Z"
  },
  {
    "title": "California billionaire tax faces potential 'uphill battle,' new poll finds",
    "description": "A poll released Tuesday found the proposed tax initiative starts out with 48% in favor and 38% opposed, but the gap shrinks as voters learn more.",
    "link": "https://www.cnbc.com/2026/01/20/california-billionaire-tax-faces-uphill-battle-new-poll-finds.html",
    "timestamp": "2026-01-20T21:03:40Z"
  },
  {
    "title": "‘I Won’: Trump Takes Victory Lap Over ‘Sick Son of a B*tch’ Jack Smith and Other Nemeses",
    "description": "President Donald Trump declared victory over various political enemies like former Special Counsel Jack Smith in a Tuesday press conference.\nThe post ‘I Won’: Trump Takes Victory Lap Over ‘Sick Son of a B*tch’ Jack Smith and Other Nemeses first appeared on Me…",
    "link": "https://www.mediaite.com/media/tv/i-won-trump-takes-victory-lap-over-sick-son-of-a-btch-jack-smith-and-other-nemeses/",
    "timestamp": "2026-01-20T21:03:30Z"
  },
  {
    "title": "Citigroup CEO Jane Fraser Says Rate Cap Would Restrict Access to Credit",
    "description": "Citigroup Chair and CEO Jane Fraser said Tuesday (Jan. 20) that she does not expect Congress to support the 10% cap on credit card interest rates proposed by President Donald Trump. “There is a very keen understanding that this would have the opposite impact …",
    "link": "https://www.pymnts.com/credit-cards/2026/citigroup-ceo-jane-fraser-says-rate-cap-would-restrict-credit-access/",
    "timestamp": "2026-01-20T21:03:26Z"
  },
  {
    "title": "The Meal Donald Trump Allegedly Sneaks In To Avoid The Fancy Food At State Dinners",
    "description": "He isn't known for having the most refined palate, so it's no surprise that President Donald Trump eats this instead of the fancy food at state dinners.",
    "link": "https://www.mashed.com/2076238/donald-trump-hamburger-state-dinners/",
    "timestamp": "2026-01-20T21:03:00Z"
  },
  {
    "title": "Gavin Newsom attacks Europe’s ‘complicity’ over Trump Greenland demands",
    "description": "Gavin Newsom, the governor of California, has decried Europeans for their “complicity” in failing to stand up to Donald Trump’s demands that he be allowed to buy or annex Greenland. Newsom, a frontrunner among Democratic candidates for president in 2028, told…",
    "link": "https://freerepublic.com/focus/f-news/4363165/posts",
    "timestamp": "2026-01-20T21:01:41Z"
  },
  {
    "title": "Survival Gear Sales SOAR In Greenland",
    "description": "Sales of survival gear have skyrocketed in Greenland. Citing local retailers, CNN reported that the demand for survival supplies and long-lasting food products has soared in Greenland’s capital city of Nuuk.",
    "link": "https://www.shtfplan.com/headline-news/survival-gear-sales-soar-in-greenland",
    "timestamp": "2026-01-20T21:00:05Z"
  },
  {
    "title": "Tina Peters and her attorneys are not helping her cause for clemency (Opinion)",
    "description": "Pro tip to Tina Peters and her legal representatives — lying to the public about easily verifiable claims makes your client less sypathetic to Coloradans wondering if she should get released from jail early.",
    "link": "https://www.denverpost.com/2026/01/20/tina-peters-assault-pueblo-jail-video-clemency/",
    "timestamp": "2026-01-20T21:00:00Z"
  },
  {
    "title": "US military seizes another Venezuela-linked tanker in the Caribbean",
    "description": "WASHINGTON, Jan 20 (Reuters) - The U.S. military said it seized a Venezuela-linked tanker on Tuesday in the Caribbean, marking the seventh such apprehension since the sta… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/us-military-seizes-another-venezuela-linked-tanker-in-the-caribbean",
    "timestamp": "2026-01-20T20:56:39Z"
  },
  {
    "title": "California GOP files emergency application with Supreme Court to challenge Proposition 50",
    "description": "The California Republican Party said Tuesday it had filed an emergency application at the U.S. Supreme Court in the hopes of blocking California from using newly approved congressional district maps in the 2026 elections.",
    "link": "https://www.kcra.com/article/california-gop-emergency-application-supreme-proposition-50/70064253",
    "timestamp": "2026-01-20T20:55:59Z"
  },
  {
    "title": "Sale of top Italian papers means ‘transfer of narrative power’ to foreign owners – journalist (VIDEO)",
    "description": "The planned sale of La Repubblica and La Stampa risks foreign editorial control of Italian media, journalist Simona Mangiante has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631227-italian-media-sale-us/",
    "timestamp": "2026-01-20T20:54:28Z"
  },
  {
    "title": "Jake Paul strange hand gestures to Trump at the CFP title game spark wild theories",
    "description": "Jake Paul managed to draw attention away from the field at the College Football Playoff National Championship on Monday night, with a brief interaction alongside President Donald T",
    "link": "https://www.marca.com/en/boxing/2026/01/20/696feb67ca474111058b4583.html",
    "timestamp": "2026-01-20T20:54:14Z"
  },
  {
    "title": "'Huge drop!' CNN data stunned as GOP enthusiasm collapses",
    "description": "CNN's Harry Enten found evidence that congressional Republicans are shooting themselves in the foot by abdicating their role to President Donald Trump.Republicans took back both houses of Congress when Trump won a second term, but a year into his presidency, …",
    "link": "https://www.rawstory.com/republican-voter-enthusiasm/",
    "timestamp": "2026-01-20T20:53:39Z"
  },
  {
    "title": "The Posting Presidency Has Never Felt More Impotent",
    "description": "From Minnesota to Greenland, Trump knows that he's losing the propaganda war.",
    "link": "https://gizmodo.com/the-posting-presidency-has-never-felt-more-impotent-2000712023",
    "timestamp": "2026-01-20T20:50:55Z"
  },
  {
    "title": "Read Mark Carney's full speech on middle powers navigating a rapidly changing world",
    "description": "Read the full text of Prime Minister Mark Carney's speech about a shakeup of the global order and role of middle powers at the World Economic Forum in Davos, Switzerland.",
    "link": "https://www.cbc.ca/news/politics/mark-carney-speech-davos-rules-based-order-9.7053350",
    "timestamp": "2026-01-20T20:48:24Z"
  }
]