[
  {
    "title": "US Treasury yields, dollar fall as Trump strikes at Fed; US stocks up - Reuters",
    "description": "US Treasury yields, dollar fall as Trump strikes at Fed; US stocks upReuters Donald Trump orders removal of Federal Reserve governor Lisa CookBBC Donald Trump’s battle against the Fed heads for courtroom showdownFinancial Times The Trump administration’s new …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178888792",
    "timestamp": "2025-08-26T23:52:28Z"
  },
  {
    "title": "‘Fox & Friends’ Host Says To Fire 'Vanity Fair' Editor Upset Over Possible Melania Trump Cover",
    "description": "An unnamed editor at the magazine told the Daily Mail they “will walk out the motherf**king door\" if the first lady is featured.",
    "link": "https://www.huffpost.com/entry/fox-and-friends-melania-trump-vanity-fair_n_68ae1e8be4b04e0994d684ab",
    "timestamp": "2025-08-26T23:50:55Z"
  },
  {
    "title": "Cracker Barrel Bringing Back ‘Old Timer’ Logo Following Immense Backlash",
    "description": "Cracker Barrel announced its logo change last week, removing the barrel and Uncle Herschel from it in favor of a logo only featuring the company’s name.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/08/26/cracker-barrel-bringing-back-old-timer-logo-following-immense-backlash/",
    "timestamp": "2025-08-26T23:50:33Z"
  },
  {
    "title": "Asia-Pacific markets set to open higher following Wall Street gains overnight",
    "description": "Asia-Pacific markets were poised to open higher on Wednesday with U.S. tariffs on India set to take effect.",
    "link": "https://www.cnbc.com/2025/08/27/asia-pacific-markets-live-india-tariffs-nifty-50-nikkei-225.html",
    "timestamp": "2025-08-26T23:50:30Z"
  },
  {
    "title": "Donald Trump's unexpected reaction to Taylor Swift and NFL star Travis Kelce's engagement",
    "description": "Donald Trump left many speechless after Taylor Swift and Travis Kelce officially announced their engagement on Tuesday, August 26. During a live-streamed cabinet meeting, reporters",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/08/27/68ae4401ca4741ee118b4577.html",
    "timestamp": "2025-08-26T23:50:20Z"
  },
  {
    "title": "FBI agents who had accused bureau of politicization during Biden administration reach settlements",
    "description": "Empower Oversight announced the resolutions of 10 cases, including eight settlements in two weeks.",
    "link": "https://www.bostonherald.com/2025/08/26/fbi-reinstatements/",
    "timestamp": "2025-08-26T23:49:56Z"
  },
  {
    "title": "#01208770102 in Global Health Council v. Donald J. Trump (D.C. Cir., 25-5097) – CourtListener.com",
    "description": "LETTER [2132152] regarding filing of application to stay preliminary injunction with the Supreme Court filed by AID, Donald J. Trump, DOS, Peter Marocco, OMB, Marco Rubio and Russell T. Vought in 25-5097, AID, DOS, OMB, Marco Rubio, Donald J. Trump and Russel…",
    "link": "https://www.courtlistener.com/docket/69834201/01208770102/global-health-council-v-donald-j-trump/",
    "timestamp": "2025-08-26T23:48:09Z"
  },
  {
    "title": "Trump loyalist who pushed false election claims takes on government role",
    "description": "Heather Honey, who supported Trump's false claims about the 2020 race, has been named to oversee 'election integrity'.",
    "link": "https://www.aljazeera.com/news/2025/8/26/trump-loyalist-who-pushed-false-election-claims-takes-on-government-role",
    "timestamp": "2025-08-26T23:47:04Z"
  },
  {
    "title": "Cracker Barrel relents, says its old logo will return",
    "description": "Cracker Barrel said late Tuesday it's returning to its old logo after critics — including President Donald Trump — protested the company's plan to modernize....",
    "link": "https://www.yahoo.com/news/articles/cracker-barrel-relents-says-old-234701857.html",
    "timestamp": "2025-08-26T23:47:01Z"
  },
  {
    "title": "Carney says port expansions to be fast-tracked under major projects bill",
    "description": "Prime Minister Mark Carney said Tuesday that expansions to ports in Montreal and Manitoba could be among the first projects fast-tracked under his government's new major projects bill.",
    "link": "https://www.nationalobserver.com/2025/08/26/news/carney-says-port-expansions-be-fast-tracked-under-major-projects-bill",
    "timestamp": "2025-08-26T23:46:26Z"
  },
  {
    "title": "Bill Gates Funds Project to Embalm Newborn Babies, Harvest Their Organs",
    "description": "A new project pro-abortion activist billionaire Bill Gates is funding raises pro-life concerns. The Bill & Melinda Gates Foundation is funding a new project that involves embalming deceased newborn babies to harvest tissues and organs for artificial intellige…",
    "link": "https://freerepublic.com/focus/f-chat/4336930/posts",
    "timestamp": "2025-08-26T23:44:26Z"
  },
  {
    "title": "'One of the scariest things I've seen’: Expert stunned by Trump’s new order",
    "description": "An executive order signed Monday by President Donald Trump may permit \"random fascist vigilantes\" to help him crack down on protests across the country, according to one prominent civil rights lawyer.The new order, which comes amid wider concern about Trump's…",
    "link": "https://www.rawstory.com/trump-executive-orders-2673923144/",
    "timestamp": "2025-08-26T23:44:05Z"
  },
  {
    "title": "Venezuela will deploy military vessels to Caribbean and other waters to combat drug trafficking",
    "description": "Venezuela is sending military vessels to the Caribbean Sea to combat drug trafficking",
    "link": "https://abcnews.go.com/International/wireStory/venezuela-deploy-military-vessels-caribbean-waters-combat-drug-125005464",
    "timestamp": "2025-08-26T23:42:26Z"
  },
  {
    "title": "Taylor Swift and Travis Kelce announce engagement",
    "description": "Taylor Swift and Travis Kelce are engaged, the couple announced in a five-photo, flower-laden Instagram post Tuesday.",
    "link": "https://www.bostonherald.com/2025/08/26/taylor-swift-and-travis-kelce-announce-engagement/",
    "timestamp": "2025-08-26T23:41:22Z"
  },
  {
    "title": "Colorado’s legislature has filled a third of budget shortfall by slashing tax breaks. Here’s what comes next.",
    "description": "\"What we did here in this special session is soften the blow,” said Sen. Jeff Bridges, a Greenwood Village Democrat who chairs the legislature's budget committee.",
    "link": "https://www.denverpost.com/2025/08/26/colorado-legislature-budget-gap-jared-polis/",
    "timestamp": "2025-08-26T23:39:37Z"
  },
  {
    "title": "Brazil's top court orders heightened security around former president Bolsonaro's home",
    "description": "Brazilian Supreme Court Justice Alexandre de Moraes on Tuesday ordered police to tighten security around Jair Bolsonaro's home, including 24-hour patrols, citing increased flight risk ahead of final arguments in the former president's trial.",
    "link": "https://www.cbc.ca/news/world/brazil-supreme-court-tightens-security-bolsonaro-home-1.7618554",
    "timestamp": "2025-08-26T23:39:03Z"
  },
  {
    "title": "Is whole milk really unhealthy? Why RFK jnr promotes full-fat dairy.",
    "description": "New research shows full-fat dairy may offer health benefits.",
    "link": "https://www.washingtonpost.com/health/2025/08/25/whole-milk-healthier-rfk-jr/",
    "timestamp": "2025-08-26T23:38:51Z"
  },
  {
    "title": "GOP Marks Abbey Gate Anniversary, Vows Biden-Harris Will ‘Never Be Let Off the Hook’ for ‘Tragic, Reckless’ Exit",
    "description": "Republican lawmakers on Tuesday marked the fourth anniversary of the deadly Abbey Gate bombing by honoring the 13 fallen service members while demanding accountability for what they called former President Joe Biden’s “reckless withdrawal from Afghanistan,” w…",
    "link": "https://www.breitbart.com/politics/2025/08/26/gop-marks-abbey-gate-anniversary-vows-biden-harris-will-never-be-let-off-the-hook-for-tragic-reckless-exit/",
    "timestamp": "2025-08-26T23:38:16Z"
  },
  {
    "title": "Cracker Barrel is changing its logo back after a week of criticism, including from Trump",
    "description": "Cracker Barrel announced it is changing its logo back after criticism of new logo, including from President Donald Trump.",
    "link": "https://www.businessinsider.com/cracker-barrel-changing-logo-back-trump-2025-8",
    "timestamp": "2025-08-26T23:36:20Z"
  },
  {
    "title": "Tom Watson delivers emphatic Ryder Cup warning to captain Keegan Bradley",
    "description": "Keegan Bradley seems all but set to name himself the first player-captain for an American Ryder Cup team since Arnold Palmer did so in 1963.",
    "link": "https://nypost.com/2025/08/26/sports/tom-watson-delivers-ryder-cup-captain-warning-to-keegan-bradley/",
    "timestamp": "2025-08-26T23:34:26Z"
  },
  {
    "title": "After a D.C. homicide, neighborhood residents are split over Trump's crackdown",
    "description": "in the neighborhood where Washington saw its first homicide in nearly two weeks, residents are divided over the value of Trump's surge of federal law-enforcement forces into the city.",
    "link": "https://www.nbcnews.com/politics/donald-trump/dc-homicide-neighborhood-split-trump-crime-crackdown-rcna227367",
    "timestamp": "2025-08-26T23:32:17Z"
  },
  {
    "title": "Trump asks court to toss remaining civil fraud penalties after getting his massive fine thrown out",
    "description": "The non-monetary penalties set strict limitations on his Trump Organization’s ability to do business.",
    "link": "https://www.bostonherald.com/2025/08/26/trump-fraud-lawsuit-appeal-penalties/",
    "timestamp": "2025-08-26T23:31:38Z"
  },
  {
    "title": "Trump Awkwardly Explains Why He Can't Call Pam Bondi 'Beautiful'",
    "description": "The famously superficial president insisted he doesn't like commenting on appearances... right after mocking a top Democrat’s looks.",
    "link": "https://www.huffpost.com/entry/trump-pam-bondi-beautiful_n_68ae16eae4b0ba4856d36d38",
    "timestamp": "2025-08-26T23:31:18Z"
  },
  {
    "title": "Trump to chair 'large meeting' on post-war Gaza - Witkoff",
    "description": "US President Donald Trump will host a meeting on post-war plans for Gaza, his envoy Steve Witkoff said.",
    "link": "https://www.rte.ie/news/middle-east/2025/0827/1530338-middle-east/",
    "timestamp": "2025-08-26T23:29:17Z"
  },
  {
    "title": "Trump to chair 'large meeting' on post-war Gaza",
    "description": "US President Donald Trump will host a meeting on post-war plans for Gaza, his envoy Steve Witkoff has said.",
    "link": "https://www.rte.ie/news/middle-east/2025/0827/1530338-israel-gaza/",
    "timestamp": "2025-08-26T23:29:17Z"
  },
  {
    "title": "FCC Chair Tells Google To Get Deal Done In YouTube-Fox Carriage Fight",
    "description": "FCC chair Brendan Carr put his thumb on the scale in a carriage battle between YouTube TV and Fox, telling Google to “get a deal done.” “Google removing Fox channels from YouTube TV would be a terrible outcome. Millions of Americans are relying on YouTube to …",
    "link": "http://deadline.com/2025/08/fcc-chief-brendan-carr-on-google-youtube-fox-carriage-fight-1236498332/",
    "timestamp": "2025-08-26T23:28:18Z"
  },
  {
    "title": "Lisa Cook’s Lawsuit Against Trump Raises Stakes For Inclusive Monetary Policy",
    "description": "Lisa Cook has announced legal action to block the President’s attempt to dismiss her, spotlighting why diverse voices are vital to the nation's financial health.",
    "link": "https://www.forbes.com/sites/korihale/2025/08/26/lisa-cooks-lawsuit-against-trump-raises-stakes-for-inclusive-monetary-policy/",
    "timestamp": "2025-08-26T23:27:11Z"
  },
  {
    "title": "Trump’s threat to deploy troops to Chicago sparks fear and defiance in a city on edge",
    "description": "President Donald Trump’s threats to deploy National Guard troops to Chicago sent ripples through America’s third-largest city as residents defended their home against Trump’s escalating rhetoric toward violent crime, including claims Chicago is a “kill...",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-threat-deploy-troops-chicago-sparks-fear-defiance-124999169",
    "timestamp": "2025-08-26T23:26:22Z"
  },
  {
    "title": "Cracker Barrel says it will go back to old logo amid redesign controversy",
    "description": "\"Our new logo is going away and our \"Old Timer\" will remain,\" Cracker Barrel said in a statement.",
    "link": "https://abcnews.go.com/GMA/Food/cracker-barrel-old-logo-redesign-controversy/story?id=124987405",
    "timestamp": "2025-08-26T23:25:47Z"
  },
  {
    "title": "Cracker Barrel to keep old logo after public outrage over redesign: 'We said we would listen'",
    "description": "Cracker Barrel to keep old logo after public outrage over redesign: 'We said we would listen'washingtonexaminer.com",
    "link": "https://www.washingtonexaminer.com/news/business/3783656/cracker-barrel-keep-old-logo-public-outrage-redesign/",
    "timestamp": "2025-08-26T23:25:05Z"
  },
  {
    "title": "Fear grips Chicago as Donald Trump's threats to deploy National Guard troops to America's third-largest city",
    "description": "Violent crime in Chicago dropped significantly in the first half of the year, representing the steepest decline in over a decade, according to city data. Shootings are down 37 per cent, and homicides have dropped by 32 per cent, while total violence crime dro…",
    "link": "https://economictimes.indiatimes.com/news/international/us/fear-grips-chicago-as-donald-trumps-threats-to-deploy-national-guard-troops-to-americas-third-largest-city/articleshow/123534712.cms",
    "timestamp": "2025-08-26T23:24:46Z"
  },
  {
    "title": "Trump on Taylor Swift-Travis Kelce Engagement: ‘He’s a Great Guy… She’s a Terrific Person'",
    "description": "President Donald Trump offered well wishes to pop star Taylor Swift and Kansas City Chiefs tight end Travis Kelce after the couple announced their engagement, calling Kelce “a great player” and Swift “a terrific person.”\nThe post Trump on Taylor Swift-Travis …",
    "link": "https://www.breitbart.com/politics/2025/08/26/trump-on-taylor-swift-travis-kelce-engagement-hes-a-great-guy-shes-a-terrific-person/",
    "timestamp": "2025-08-26T23:21:47Z"
  },
  {
    "title": "Why Trump’s challenge to Fed’s independence may make gold the ‘safe haven of choice’ for investors",
    "description": "President Donald Trump made a move to fire a member of the Federal Reserve’s Board of Governors. Investors can see that as a threat to the political independence of the central bank, potentially undermining confidence in the U.S. dollar and Treasury bonds — a…",
    "link": "https://biztoc.com/x/931a0cbb0678183e",
    "timestamp": "2025-08-26T23:19:54Z"
  },
  {
    "title": "Marco Rubio Urges Trump To Issue Executive Order On Serious Marriage Problem In America",
    "description": "Donald Trump and Marco Rubio were in attendance at a Cabinet meeting Tuesday where multiple things were discussed, but the most important was marriage.",
    "link": "https://dailycaller.com/2025/08/26/marco-rubio-college-football-saturday-marriage/",
    "timestamp": "2025-08-26T23:17:06Z"
  },
  {
    "title": "Trump Tries To Normalize Having National Guard Troops In American Cities",
    "description": "The president signed an order potentially expanding the National Guard’s role in domestic law enforcement.",
    "link": "https://www.huffpost.com/entry/trump-national-guard-executive-order-dc_n_68ae0d7fe4b04e0994d67506",
    "timestamp": "2025-08-26T23:14:18Z"
  },
  {
    "title": "Trump's big Fed move raises alarms from investors — and reveals 'bigger surprise'",
    "description": "Investor unease is reportedly mounting as President Donald Trump’s escalating interference in Federal Reserve affairs sends ripples through financial markets.Trump announced on Monday night that he was firing Fed governor Lisa Cook “effective immediately”, ci…",
    "link": "https://www.rawstory.com/trump-fed-2673923095/",
    "timestamp": "2025-08-26T23:13:02Z"
  },
  {
    "title": "CBS Reporter's Reaction to Taylor Swift, Travis Kelce Engagement Goes Viral",
    "description": "CBS' Olivia Rinaldi freaked out when she found out Taylor Swift was engaged, saying at one point, \"I feel like Paul Revere right now.\"",
    "link": "https://www.newsweek.com/cbs-reporter-taylor-swift-engaged-travis-kelce-reaction-watch-video-2119801",
    "timestamp": "2025-08-26T23:12:53Z"
  },
  {
    "title": "Cracker Barrel will go back to old logo after conservative backlash",
    "description": "Uncle Herschel is returning to the Cracker Barrel chair",
    "link": "https://www.nbcnews.com/business/business-news/cracker-barrel-logo-rcna227389",
    "timestamp": "2025-08-26T23:12:16Z"
  },
  {
    "title": "New Social Security Report Raises Alarms for 300 Million Americans",
    "description": "Labor and retiree groups sued SSA over the agency's cooperation with DOGE, though an appeals panel upheld the department's access.",
    "link": "https://www.newsweek.com/social-security-report-doge-trump-alarms-2119818",
    "timestamp": "2025-08-26T23:11:00Z"
  },
  {
    "title": "Utah enters the redistricting battle for 2026, but not by choice",
    "description": "A judge ordered lawmakers this week to quickly redraw the state's congressional map.",
    "link": "https://www.bostonherald.com/2025/08/26/utah-redistricting-battle-2026-election/",
    "timestamp": "2025-08-26T23:10:26Z"
  },
  {
    "title": "Tariffs aren't enough to bring furniture manufacturing back to the U.S., Jim Cramer says",
    "description": "CNBC's Jim Cramer told investors that he believes extensive domestic furniture manufacturing is largely a thing of the past.",
    "link": "https://www.cnbc.com/2025/08/26/tariffs-wont-bring-furniture-manufacturing-to-the-us-jim-cramer.html",
    "timestamp": "2025-08-26T23:09:36Z"
  },
  {
    "title": "Witkoff: Trump will chair Gaza 'day after' meeting at White House",
    "description": "US Middle East envoy Steve Witkoff says President Trump will chair a major White House meeting on a \"comprehensive\" Gaza plan, states that Hamas must be excluded from future governance.",
    "link": "https://www.israelnationalnews.com/news/413925",
    "timestamp": "2025-08-26T23:08:07Z"
  },
  {
    "title": "With surging health insurance costs set to hit western Colorado hardest, Democrats approve a plan to mitigate coverage losses",
    "description": "Coloradans who shop for their own health care rather than receive it through their job are set to face steep price hikes next year if federal subsidies lapse.  In a bid to mitigate some of the price increases and potential loss of coverage, state Democrats ha…",
    "link": "https://www.aspentimes.com/news/colorado-surging-health-insurance-costs-democrats-approve-plan-to-coverage-losses-federal-subsidies-lapse/",
    "timestamp": "2025-08-26T23:08:07Z"
  },
  {
    "title": "Maybe a New Melania Magazine Cover Will Give Trump What He’s Been Seeking",
    "description": "What would’ve happened if long ago, the president got the cultural accolades he’s always wanted?",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/trump-melania-magazine-cover/684019/",
    "timestamp": "2025-08-26T23:06:00Z"
  },
  {
    "title": "Texas election map for 2026 are racially biased, voting-rights advocates say in lawsuit",
    "description": "The lawsuit alleges the map weakens the electoral influence of Black voters.",
    "link": "https://www.bostonherald.com/2025/08/26/election-2026-redistricting-lawsuit-texas/",
    "timestamp": "2025-08-26T23:05:38Z"
  },
  {
    "title": "After right-wing backlash, Cracker Barrel says it will get rid of its new logo | CNN Business",
    "description": "After days of intense backlash, most recently from President Donald Trump, Cracker Barrel is scrapping its new minimalist logo.",
    "link": "https://www.cnn.com/2025/08/26/business/cracker-barrel-old-logo",
    "timestamp": "2025-08-26T23:04:07Z"
  },
  {
    "title": "Actress Mia Farrow Calls Trump a ‘National Emergency’",
    "description": "Far left actress Mia Farrow is calling President Donald Trump a \"national emergency\" because he is \"not rational.\"\nThe post Actress Mia Farrow Calls Trump a ‘National Emergency’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/08/26/actress-mia-farrow-calls-trump-a-national-emergency/",
    "timestamp": "2025-08-26T23:03:57Z"
  },
  {
    "title": "Raskin: Trump Trying to 'Militarize Our Society, Intimidate His Political Opponents'",
    "description": "Tuesday on CNN's \"News Central,\" Rep. Jamie Raskin (D-MD) said that President Donald Trump was trying to \"militarize our society\" and \"intimidate his political opponents\" by sending in the National Guard to cities.\nThe post Raskin: Trump Trying to ‘Militarize…",
    "link": "https://www.breitbart.com/clips/2025/08/26/raskin-trump-trying-to-militarize-our-society-intimidate-his-political-opponents/",
    "timestamp": "2025-08-26T23:02:47Z"
  },
  {
    "title": "Musk’s political group dealt blow as lawsuit from stiffed swing-state voters moves forward",
    "description": "A federal judge has declined to block a lawsuit being advanced against tech billionaire Elon Musk and his political group America PAC, alleging that they refused to pay the advertised money for people who helped get signatures on his pre-2024 election petitio…",
    "link": "https://www.rawstory.com/america-pac-2673922914/",
    "timestamp": "2025-08-26T23:01:02Z"
  },
  {
    "title": "Why meritocratic bureaucracy is good for business",
    "description": "Despite populist attacks on civil service employees and organisations, the fact remains that meritocratic bureaucracy boosts the business environment.\nThe post Why meritocratic bureaucracy is good for business first appeared on LSE Business Review.",
    "link": "https://blogs.lse.ac.uk/businessreview/2025/08/27/why-meritocratic-bureaucracy-is-good-for-business/",
    "timestamp": "2025-08-26T23:01:00Z"
  },
  {
    "title": "Taylor Swift and Travis Kelce get engaged after two-year romance",
    "description": "LOS ANGELES: Pop superstar Taylor Swift and National Football League player Travis Kelce are engaged to be married, the couple announced on social media on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/27/taylor-swift-and-travis-kelce-get-engaged-after-two-year-romance",
    "timestamp": "2025-08-26T23:01:00Z"
  },
  {
    "title": "CNN anchor dismisses DC’s murder-free streak under Trump’s crime crackdown with North Korea comparison",
    "description": "Trump deployed over 2,000 National Guard troops to Washington D.C. for crime control as CNN's Audie Cornish drew parallels to his order and authoritarian regimes.",
    "link": "https://www.foxnews.com/media/cnn-anchor-dismisses-dcs-murder-free-streak-under-trumps-crime-crackdown-north-korea-comparison",
    "timestamp": "2025-08-26T23:00:22Z"
  },
  {
    "title": "Alberta Looks to Japan to Cut Reliance on U.S. Buyers",
    "description": "The government of Canada’s biggest oil-producing province is in talks with Japanese parties with a view to investing in the latter’s refining industry. The move, according to unnamed sources who spoke to Reuters, should secure a table overseas market for Albe…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Alberta-Looks-to-Japan-to-Cut-Reliance-on-US-Buyers.html",
    "timestamp": "2025-08-26T23:00:00Z"
  },
  {
    "title": "The Heart of Patricia Lockwood’s Life and Work",
    "description": "From the daily newsletter: a Profile of the author, ahead of the release of her new novel.",
    "link": "https://www.newyorker.com/newsletter/the-daily/the-heart-of-patricia-lockwoods-life-and-work",
    "timestamp": "2025-08-26T23:00:00Z"
  },
  {
    "title": "Saskatchewan Premier Moe says Canada should remove tariff on Chinese EVs",
    "description": "REGINA — As Saskatchewan Premier Scott Moe prepares to go to China next week, he said he would like the federal government to drop its 100 per cent electric vehicle tariff on Beijing. “From Saskatchewan’s perspective, I would say, ‘Yes, let’s remove the EV ta…",
    "link": "https://financialpost.com/pmn/saskatchewan-premier-moe-says-canada-should-remove-tariff-on-chinese-evs",
    "timestamp": "2025-08-26T22:58:30Z"
  },
  {
    "title": "Cracker Barrel Caves on New Logo Hours After Trump Remark",
    "description": "The company said in a statement Tuesday: \"We said we would listen, and we have,\" affirming that the classic imagery will remain.",
    "link": "https://www.newsweek.com/cracker-barrel-caves-new-logo-hours-after-trump-remark-2119812",
    "timestamp": "2025-08-26T22:58:14Z"
  },
  {
    "title": "Trump’s move to take over the Fed adds more uncertainty to the economy - The Washington Post",
    "description": "Trump’s move to take over the Fed adds more uncertainty to the economyThe Washington Post Donald Trump orders removal of Federal Reserve governor Lisa CookBBC Trump’s Fed Aggression Poses New Test on Limits of Presidential PowerThe Wall Street Journal US Trea…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178888240",
    "timestamp": "2025-08-26T22:53:14Z"
  },
  {
    "title": "Why Trump won’t be sending the National Guard to NYC",
    "description": "With Trump's deployment of the Guard to DC to clamp down on the city's high crime going so well, he's now eyeing other cities for possible fed intervention.",
    "link": "https://nypost.com/2025/08/26/opinion/mr-president-dont-send-the-guard-to-nyc-yet/",
    "timestamp": "2025-08-26T22:53:02Z"
  },
  {
    "title": "Cracker Barrel Dumps New Logo Hours After Trump Gripes About It",
    "description": "\"We said we would listen, and we have,\" the restaurant chain said in a statement Tuesday. \"Our new logo is going away and our 'Old Timer' will remain.\"",
    "link": "https://www.huffpost.com/entry/cracker-barrel-dumps-new-hated-logo-after-outcry_n_68ae3861e4b06cda8b4aed52",
    "timestamp": "2025-08-26T22:53:01Z"
  },
  {
    "title": "US offered ‘support’ for NATO force in Ukraine – FT",
    "description": "Washington is ready to provide “intelligence assets and battlefield oversight” for any European-led initiative in Ukraine, FT reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623556-us-support-eu-ukraine/",
    "timestamp": "2025-08-26T22:52:33Z"
  },
  {
    "title": "Trump's Fed firing: What to know and why it matters",
    "description": "What you need to know about President Donald Trump's decision to fire Federal Reserve Governor Lisa Cook.",
    "link": "https://www.cnbc.com/2025/08/26/trump-fires-lisa-cook-what-to-know.html",
    "timestamp": "2025-08-26T22:50:15Z"
  },
  {
    "title": "Trump’s threat to deploy troops to Chicago sparks fear and defiance in a city on edge",
    "description": "There's fear, frustration and defiance for residents amid historic drops in violent crime.",
    "link": "https://www.bostonherald.com/2025/08/26/trump-chicago-threats/",
    "timestamp": "2025-08-26T22:49:52Z"
  },
  {
    "title": "Trump says “most people” would “rather have a dictator” in the Oval Office",
    "description": "The president maintained that he was \"not a dictator\" while arguing he had \"the right to do anything\" he wants",
    "link": "https://www.salon.com/2025/08/26/trump-says-most-people-would-rather-have-a-dictator-in-the-oval-office/",
    "timestamp": "2025-08-26T22:48:09Z"
  },
  {
    "title": "New research indicates Trump's war on immigrants has little to do with fighting crime",
    "description": "Immigrants are less likely to commit crimes — and also less likely to be victims of most types of violent crime, according to a new Cato Institute analysis.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-ice-national-guard-immigrants-crime-census-rcna227118",
    "timestamp": "2025-08-26T22:47:43Z"
  },
  {
    "title": "Witkoff: Ukraine talks may need Trump to finish the deal",
    "description": "United States Special Envoy to the Middle East Steve Witkoff said it may be necessary for US President Donald Trump to join peace talks to help finalize a deal on the war in Ukraine.\nSpeaking on Fox ...",
    "link": "https://biztoc.com/x/eb3af46e285b1a97",
    "timestamp": "2025-08-26T22:46:11Z"
  },
  {
    "title": "Taylor Swift engaged with Travis Kelce: Shocking offer emerges for catering at wedding",
    "description": "Taylor Swift and  Travis Kelce started dating in 2023 after the singer performed at Arrowhead Stadium - home of Kansas City Chiefs.",
    "link": "https://economictimes.indiatimes.com/news/international/us/taylor-swift-engaged-with-travis-kelce-shocking-offer-emerges-for-catering-at-wedding/articleshow/123534504.cms",
    "timestamp": "2025-08-26T22:46:04Z"
  },
  {
    "title": "Trump family crypto empire expands with Crypto.com partnership",
    "description": "By ALAN SUDERMAN\nPresident Donald Trump’s personal crypto ventures are expanding again, this time with plans for a digital asset treasury company that holds an alternative cryptocurrency.\nRelated Articles\n \n \n \n Lisa Cook is latest target for Bill Pulte, Trum…",
    "link": "https://biztoc.com/x/f17be5a0088b0c47",
    "timestamp": "2025-08-26T22:45:51Z"
  },
  {
    "title": "With Trump’s Military Occupations of U.S. Cities, We Now Live in a Country of Reichstags",
    "description": "Illinois governor JB Pritzker is making statements like those of a political prisoner.",
    "link": "https://www.esquire.com/news-politics/politics/a65903688/trump-chicago-national-guard-illinois-governor-pritkzer/",
    "timestamp": "2025-08-26T22:45:00Z"
  },
  {
    "title": "The Natural Endpoint of Trump’s Falsehoods",
    "description": "Someday, the president may need the American people to believe something he says—and they won’t.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/trump-lisa-cook-federal-reserve-falsehoods/684014/",
    "timestamp": "2025-08-26T22:45:00Z"
  },
  {
    "title": "Trump administration asks US Supreme Court to halt foreign aid payments",
    "description": "President Donald Trump's administration asked the U.S. Supreme Court on Tuesday to lift an injunction that it says will force the State Department to...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-asks-us-supreme-224402264.html",
    "timestamp": "2025-08-26T22:44:02Z"
  },
  {
    "title": "Trump's Intel deal gives US stake in business - and breaks with American tradition",
    "description": "The government's stake in the computer chip maker is not without precedent, but it puts Trump at odds with some conservatives.",
    "link": "https://www.bbc.com/news/articles/cn85n2vg04go",
    "timestamp": "2025-08-26T22:43:33Z"
  },
  {
    "title": "Trump claims 'we're against crime. Democrats like crime'",
    "description": "President Trump says crime will be major 2026 election focus while touting the success of his 12-day federalization push in Washington D.C. with the National Guard.",
    "link": "https://www.foxnews.com/politics/trump-claims-were-against-crime-democrats-like-crime",
    "timestamp": "2025-08-26T22:42:47Z"
  },
  {
    "title": "Trump: We Will Seek Death Penalty as Punishment for Murders Committed in D.C.",
    "description": "President Donald Trump said Tuesday that his administration will seek the death penalty as punishment for murders committed in the nation's capital.\nThe post Trump: We Will Seek Death Penalty as Punishment for Murders Committed in D.C. appeared first on Breit…",
    "link": "https://www.breitbart.com/politics/2025/08/26/trump-we-will-seek-death-penalty-as-punishment-for-murders-committed-in-d-c/",
    "timestamp": "2025-08-26T22:41:30Z"
  },
  {
    "title": "Trump family crypto empire expands with Crypto.com partnership",
    "description": "This move follows a trend where companies buy and hold cryptocurrency as a business strategy.",
    "link": "https://www.denverpost.com/2025/08/26/trump-crypto-empire/",
    "timestamp": "2025-08-26T22:39:12Z"
  },
  {
    "title": "Trump family crypto empire expands with Crypto.com partnership",
    "description": "This move follows a trend where companies buy and hold cryptocurrency as a business strategy.",
    "link": "https://www.bostonherald.com/2025/08/26/trump-crypto-empire/",
    "timestamp": "2025-08-26T22:39:12Z"
  },
  {
    "title": "Wisconsin judge accused of helping man evade ICE arrest loses a bid to drop charges",
    "description": "A federal judge is allowing a case to proceed against a Wisconsin judge accused of helping a man evade U.S. immigration agents seeking to arrest him in her courthouse",
    "link": "https://abcnews.go.com/US/wireStory/wisconsin-judge-accused-helping-man-evade-ice-arrest-124994890",
    "timestamp": "2025-08-26T22:38:13Z"
  },
  {
    "title": "Trump’s Cabinet Meeting Goes Full ‘North Korea’ With Presidential Brown Nosing",
    "description": "President Donald Trump’s personally appointed sycophants were not so subtle in their sucking up to him during a cabinet meeting on Tuesday afternoon. In an...",
    "link": "https://www.thedailybeast.com/trumps-cabinet-meeting-goes-full-north-korea-with-presidential-brown-nosing/",
    "timestamp": "2025-08-26T22:36:14Z"
  },
  {
    "title": "Markets muted after Trump's move to fire Fed's Cook",
    "description": "The US dollar slipped and long-term Treasury yields rose modestly Tuesday after President Donald Trump moved to dismiss a Federal Reserve policymaker.\nThat markets weren’t dramatically upended by Trump’s latest attempt to shape the central bank suggests inves…",
    "link": "https://biztoc.com/x/3fbf0d25b83626c1",
    "timestamp": "2025-08-26T22:35:02Z"
  },
  {
    "title": "Unpacking rumor Trump and RFK Jr. plan to ban COVID-19 vaccine",
    "description": "The claim stemmed from a Daily Beast report that cited Dr. Aseem Malhotra, a British cardiologist and associate of the health secretary.",
    "link": "https://www.snopes.com//news/2025/08/26/trump-rfk-covid-vaccine-ban/",
    "timestamp": "2025-08-26T22:33:00Z"
  },
  {
    "title": "India Braces for 50% Tariff Shock as Trump’s Levies Set to Land",
    "description": "The US will slap a crushing 50% tariff on some Indian goods starting Wednesday — the highest in Asia — as President Donald Trump presses ahead with the levies to punish New Delhi for buying Russian oil.",
    "link": "https://financialpost.com/pmn/business-pmn/india-braces-for-50-tariff-shock-as-trumps-levies-set-to-land",
    "timestamp": "2025-08-26T22:32:08Z"
  },
  {
    "title": "The Enormous Stakes of Trump’s Effort to Fire the Fed Governor Lisa Cook",
    "description": "John Cassidy on President Donald Trump’s efforts to fire Lisa Cook, a Federal Reserve governor, and how his authoritarian power grabs are affecting the American economy.",
    "link": "https://www.newyorker.com/news/the-financial-page/the-enormous-stakes-of-trumps-effort-to-fire-the-fed-governor-lisa-cook",
    "timestamp": "2025-08-26T22:30:22Z"
  },
  {
    "title": "Aging Coal Plants Could Cost Americans Billions",
    "description": "Back in April, U.S. President Donald Trump signed an executive order that, among other things, recognized coal as a critical mineral and opened federal lands to coal mining. Trump ordered the Secretary of Energy to examine the potential for expanding coal-bas…",
    "link": "https://oilprice.com/Energy/Coal/Aging-Coal-Plants-Could-Cost-Americans-Billions.html",
    "timestamp": "2025-08-26T22:30:00Z"
  },
  {
    "title": "‘OUTRAGEOUS’: AGs Condemn Biden EPA Funding for ‘a Scheme to Rig the Courts Against American Energy’",
    "description": "Twenty-three Republican state attorneys general sent a letter to Environmental Protection Agency Administrator Lee Zeldin, demanding the EPA investigate funding for the Environmental Law Institute,... Read More\nThe post ‘OUTRAGEOUS’: AGs Condemn Biden EPA Fun…",
    "link": "https://www.dailysignal.com/2025/08/26/outrageous-ags-condemn-biden-epa-funding-for-a-scheme-to-rig-the-courts-against-american-energy/",
    "timestamp": "2025-08-26T22:30:00Z"
  },
  {
    "title": "Adding Trump to Mt. Rushmore Impossible, Ex-National Park Service Head Says",
    "description": "MAGA supporters eager to see Donald Trump added to Mount Rushmore are about to be disappointed ... because it's nearly impossible to make an addition without destroying the landmark, TMZ has learned. We caught up with former National Park Service…\n Permalink",
    "link": "https://www.tmz.com/2025/08/26/ex-national-park-service-head-trump-mount-rushmore-impossible/",
    "timestamp": "2025-08-26T22:28:09Z"
  },
  {
    "title": "“After marrying Gisele…”: Tom Brady blamed Gisele Bündchen’s strict diet and politics for ruining his friendship with Donald Trump",
    "description": "Tom Brady and Donald Trump's friendship, once marked by mutual admiration, deteriorated over time. Lifestyle differences, particularly Brady's health-conscious diet contrasting with Trump's fast-food habits, created initial distance. Political disagreements f…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/after-marrying-gisele-tom-brady-blamed-gisele-bndchens-strict-diet-and-politics-for-ruining-his-friendship-with-donald-trump/articleshow/123520062.cms",
    "timestamp": "2025-08-26T22:27:29Z"
  },
  {
    "title": "US to publish economic data on blockchain, Commerce chief says",
    "description": "Commerce Secretary Howard Lutnick said the US will put GDP figures on the blockchain, aiming to expand on-chain data distribution across agencies.",
    "link": "https://cointelegraph.com/news/us-economic-data-blockchain-commerce-howard-lutnick",
    "timestamp": "2025-08-26T22:26:45Z"
  },
  {
    "title": "Brazilian high court requests increased security for Bolsonaro",
    "description": "Stronger police presence is called for to monitor the former president, who is under house arrest awaiting trial.",
    "link": "https://www.aljazeera.com/news/2025/8/26/brazilian-high-court-requests-increased-security-for-bolsonaro",
    "timestamp": "2025-08-26T22:23:52Z"
  },
  {
    "title": "Speak up for Jimmy Lai, China’s most dangerous dissident — and for Hong Kong’s liberties",
    "description": "Jimmy Lai, China's most famous political prisoner, faces sentencing this week — and the future of Hong Kong's civil liberties is on trial along with him.",
    "link": "https://nypost.com/2025/08/26/opinion/speak-up-for-brave-dissident-jimmy-lai-and-for-hong-kong/",
    "timestamp": "2025-08-26T22:22:46Z"
  },
  {
    "title": "Trump’s Cabinet Meeting Was Stuffed With Flattery for Dear Leader",
    "description": "Donald Trump's latest Cabinet meeting was a spectacle of flattery, with the president's appointees shamelessly praising him for saving America.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-cabinet-members-lavish-praise-1235416119/",
    "timestamp": "2025-08-26T22:22:07Z"
  },
  {
    "title": "'Warrantless chaos': Trump blamed for soaring grocery bills in new report",
    "description": "As leading grocery chains increase prices on essentials, they are blaming President Donald Trump's tariffs for raising the cost of living for households across the country.According to the Consumer Price Index, the price of food has increased by 3% in the pas…",
    "link": "https://www.rawstory.com/trump-grocery-prices-2673922992/",
    "timestamp": "2025-08-26T22:21:29Z"
  },
  {
    "title": "The White House Is Going to Put Government Statistics on the Blockchain (Yeah, We Don’t Know Why Either)",
    "description": "\"We're just ironing out all the details,\" said Howard Lutnick.",
    "link": "https://gizmodo.com/the-white-house-is-going-to-put-government-statistics-on-the-blockchain-yeah-we-dont-know-why-either-2000648428",
    "timestamp": "2025-08-26T22:20:38Z"
  },
  {
    "title": "Trump, Moore spar as cordial Army-Navy clip resurfaces",
    "description": "Maryland governor Wes Moore denies Trump's claim that he called him the 'greatest president of my lifetime' during their Army-Navy game meeting last year.",
    "link": "https://www.foxnews.com/media/trump-moore-spar-cordial-army-navy-clip-resurfaces",
    "timestamp": "2025-08-26T22:19:31Z"
  },
  {
    "title": "Trump Declares, ‘I Have the Right To Do Anything I Want’ Because ‘I’m the President’",
    "description": "President Donald Trump claimed all-encompassing powers for himself during a marathon cabinet meeting on Tuesday.\nThe post Trump Declares, ‘I Have the Right To Do Anything I Want’ Because ‘I’m the President’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-declares-i-have-the-right-to-do-anything-i-want-because-im-the-president/",
    "timestamp": "2025-08-26T22:19:05Z"
  }
]