[
  {
    "title": "Dem Rep Mikie Sherrill skips 145 House votes as NJ governor's race heats up",
    "description": "New Jersey gubernatorial candidate Rep. Mikie Sherrill leads Republican Jack Ciattarelli by just four points, despite missing most House votes.",
    "link": "https://www.foxnews.com/politics/dem-rep-mikie-sherrill-skips-145-house-votes-nj-governors-race-heats-up",
    "timestamp": "2025-10-21T14:13:47Z"
  },
  {
    "title": "Ecuador releases survivor of US strike on 'drug sub' in Caribbean",
    "description": "Ecuadorian officials say they found no evidence the man had committed a crime, and so had freed him.",
    "link": "https://www.bbc.com/news/articles/cn97vl7vy7xo",
    "timestamp": "2025-10-21T14:13:43Z"
  },
  {
    "title": "Help Me Out Here: What's the Democratic Party's Logic on the Shutdown Fight?",
    "description": "I’m really starting to wonder about the political IQ of the Democratic Party. First, they did just about all they could to elect Donald Trump in the last election. Letting Joe Biden bumble towards a second term was nothing short of crazy, but then anointing K…",
    "link": "https://www.commondreams.org/opinion/help-me-out-here-what-s-the-democratic-party-s-logic-on-the-shutdown-fight",
    "timestamp": "2025-10-21T14:13:06Z"
  },
  {
    "title": "Louisiana Judge Invalidates Permit for LNG Facility, Orders Review of Climate Impact",
    "description": "A Louisiana judge has tossed out a key permit for a liquefied natural gas facility that won approval from President Donald Trump’s administration, ordering a state review of how the facility’s planet-warming emissions would affect Gulf Coast communities vulne…",
    "link": "https://www.insurancejournal.com/news/southcentral/2025/10/21/844592.htm",
    "timestamp": "2025-10-21T14:13:02Z"
  },
  {
    "title": "Pardoned Capitol Rioter Arrested After Threatening Murder Of Hakeem Jeffries",
    "description": "Christopher Moynihan was sentenced to 21 months in prison for his role in the Jan. 6 Capitol riots before Trump gave him clemency.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/10/21/pardoned-capitol-rioter-arrested-after-threatening-murder-of-hakeem-jeffries/",
    "timestamp": "2025-10-21T14:10:37Z"
  },
  {
    "title": "Mumbai suburban hospitals redirect patients to tertiary centres only for medico legal paperwork",
    "description": "Mumbai: Patients rushing to suburban hospitals after road accidents or violent assaults are finding themselves entangled in bureaucratic hurdles. Many.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/mumbai-suburban-hospitals-redirect-patients-to-tertiary-centres-only-for-medico-legal-paperwork/articleshow/124723409.cms",
    "timestamp": "2025-10-21T14:08:47Z"
  },
  {
    "title": "In Chicago, an immense show of force signals a sharp escalation in White House immigration crackdown",
    "description": "A raid last month signaled a sharp escalation in the White House’s immigration crackdown and ratcheted up tensions in a city already on edge.",
    "link": "https://www.denverpost.com/2025/10/21/chicago-white-house-immigration-crackdown/",
    "timestamp": "2025-10-21T14:08:02Z"
  },
  {
    "title": "In Chicago, an immense show of force signals a sharp escalation in White House immigration crackdown",
    "description": "A raid last month signaled a sharp escalation in the White House’s immigration crackdown and ratcheted up tensions in a city already on edge.",
    "link": "https://www.bostonherald.com/2025/10/21/chicago-white-house-immigration-crackdown/",
    "timestamp": "2025-10-21T14:08:02Z"
  },
  {
    "title": "US-Australia deal to combat Chinese rare earths monopoly: 5 things to know",
    "description": "The United States and Australia have committed at least $1 billion towards an $8.5 billion pipeline of projects over the next six months in mining and processing projects, as well as setting a minimum price floor for critical minerals",
    "link": "https://indianexpress.com/article/explained/explained-economics/us-australia-rare-earths-deal-china-5-things-10319260/",
    "timestamp": "2025-10-21T14:07:05Z"
  },
  {
    "title": "GM Raises Outlook as Strong Truck Demand Dulls Tariff Pain",
    "description": "General Motors Co. raised its full-year outlook and posted third-quarter results that topped Wall Street estimates on better-than-expected pickup truck sales and fresh relief from the Trump administration’s tariffs on auto parts.",
    "link": "https://financialpost.com/pmn/business-pmn/gm-raises-outlook-as-strong-truck-demand-dulls-tariff-pain-2",
    "timestamp": "2025-10-21T14:05:56Z"
  },
  {
    "title": "Saudi Arabia’s Crown Prince MBS Said to Visit Trump at White House on Nov. 18",
    "description": "Saudi Arabia’s Crown Prince Mohammed bin Salman is set to meet US President Donald Trump at the White House on Nov. 18 and sign agreements on artificial intelligence, defense, nuclear cooperation and trade, according to a person familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/saudi-arabias-crown-prince-mbs-said-to-visit-trump-at-white-house-on-nov-18",
    "timestamp": "2025-10-21T14:05:37Z"
  },
  {
    "title": "Lamar Jackson injury update: Baltimore Ravens QB misses practice again – will he play must-win game this Sunday against Chicago Bears?",
    "description": "Lamar Jackson's hamstring injury continues to sideline the Baltimore Ravens quarterback, raising doubts about his availability for Sunday's crucial game against the Chicago Bears. Missing the past two games and Monday's practice, Jackson's return is vital for…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/lamar-jackson-injury-update-baltimore-ravens-qb-misses-practice-again-will-he-play-must-win-game-this-sunday-against-chicago-bears/articleshow/124723397.cms",
    "timestamp": "2025-10-21T14:05:23Z"
  },
  {
    "title": "Why many transgender Americans are preparing to flee the country (Vox)",
    "description": "Vox:\nWhy many transgender Americans are preparing to flee the country  —  In his second term, President Trump's rhetoric and policies regarding the trans community have become far more menacing  —  When President Donald Trump first took office in 2017, it was…",
    "link": "https://www.memeorandum.com/251021/p34",
    "timestamp": "2025-10-21T14:05:00Z"
  },
  {
    "title": "U.S. appeals court says Trump can take command of Oregon National Guard troops, though deployment blocked for now",
    "description": "Oregon's attorney general said he would ask a broader appeals court panel to reconsider the ruling.",
    "link": "https://www.pbs.org/newshour/nation/u-s-appeals-court-says-trump-can-take-command-of-oregon-national-guard-troops-though-deployment-blocked-for-now",
    "timestamp": "2025-10-21T14:05:00Z"
  },
  {
    "title": "154,000 students are homeless in New York City schools: Here’s why the crisis is deepening",
    "description": "A record 154,000 students in New York City public schools were classified as homeless during 2024-25, highlighting the city’s deepening housing crisis. Most live in shelters or shared apartments, with Black and Latino students disproportionately affected. Chr…",
    "link": "https://timesofindia.indiatimes.com/education/news/154000-students-are-homeless-in-new-york-city-schools-heres-why-the-crisis-is-deepening/articleshow/124722692.cms",
    "timestamp": "2025-10-21T14:03:57Z"
  },
  {
    "title": "Trump Says Allies Ready To Strike Gaza If Hamas Defies Truce",
    "description": "President Donald Trump said on Truth Social that several U.S. allies in and around the Middle East have offered to deploy forces into Gaza to “straighten out Hamas” if the militant group violates its ceasefire agreement. \nTrump described the regional solidari…",
    "link": "https://biztoc.com/x/9b8bc54639931d52",
    "timestamp": "2025-10-21T14:03:07Z"
  },
  {
    "title": "Breitbart News Hosting Policy Events with Secretary Sean Duffy and EPA Administrator Lee Zeldin",
    "description": "Breitbart News is hosting policy events in November with Transportation Secretary Sean Duffy and Environmental Protection Agency (EPA) Administrator Lee Zeldin, as the Trump administration continues to make progress in key areas of government to make the Amer…",
    "link": "https://www.breitbart.com/politics/2025/10/21/breitbart-news-hosting-policy-events-with-secretary-sean-duffy-and-epa-administrator-lee-zeldin/",
    "timestamp": "2025-10-21T14:02:40Z"
  },
  {
    "title": "Silver Plummets 6% As Traders Take Stock Of Record Rally",
    "description": "Gold and silver slid as traders took stock of record-breaking rallies, with technical indicators looking stretched while US-China tensions ease. Bullion fell by as much as 2.6%, after hitting a fresh peak of $4,381.52 an ounce on Monday. Gold’s ferocious rall…",
    "link": "https://www.ndtvprofit.com/markets/silver-plummets-6-as-traders-take-stock-of-record-rally",
    "timestamp": "2025-10-21T14:01:20Z"
  },
  {
    "title": "Apple fights EU’s Digital Markets Act in landmark antitrust challenge",
    "description": "Apple challenged the European Union's Digital Markets Act (DMA) in the most significant legal test yet of the bloc's antitrust rules…\nThe post Apple fights EU’s Digital Markets Act in landmark antitrust challenge appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/10/21/apple-fights-eus-digital-markets-act-in-landmark-antitrust-challenge/",
    "timestamp": "2025-10-21T14:00:49Z"
  },
  {
    "title": "Trump’s Most Reviled Voting Company Sold to a GOP Official. That’s Not the Worst of It.",
    "description": "Earlier this month, news broke that Dominion Voting Solutions had been sold to a former Republican election official.",
    "link": "https://slate.com/news-and-politics/2025/10/trump-dominion-voting-machines-sold-republican.html",
    "timestamp": "2025-10-21T14:00:00Z"
  },
  {
    "title": "Trump Demolishes East Wing of the White House. This Makes Me Sick!",
    "description": "I have been to the White House on several occasions. I first went there for a State Dinner in 1965 when Lyndon B. Johnson was President. I was there as a guest on several other occasions. Every time, I was in awe, star-struck. I felt as though I was walking o…",
    "link": "https://dianeravitch.net/2025/10/21/trump-demolishes-east-wing-of-the-white-house-this-makes-me-sick/",
    "timestamp": "2025-10-21T14:00:00Z"
  },
  {
    "title": "Inspired by Thatcher, Sanae Takaichi becomes Japan's first female premier",
    "description": "Sanae Takaichi has broken barriers by becoming Japan's first-ever female prime minister. Taking the helm amidst pressing economic issues and foreign policy dilemmas, her plans for extensive public spending could sway the confidence of global investors.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/inspired-by-thatcher-sanae-takaichi-becomes-japans-first-female-premier/articleshow/124723439.cms",
    "timestamp": "2025-10-21T13:58:41Z"
  },
  {
    "title": "Trump Celebrates One Year Since He Served as Honorary McDonald's Employee",
    "description": "One year to the day since President Donald Trump worked a McDonald’s restaurant shift as an honorary employee was celebrated Monday by the White House.\nThe post Trump Celebrates One Year Since He Served as Honorary McDonald’s Employee appeared first on Breitb…",
    "link": "https://www.breitbart.com/politics/2025/10/21/trump-celebrates-one-year-since-he-served-as-honorary-mcdonalds-employee/",
    "timestamp": "2025-10-21T13:57:15Z"
  },
  {
    "title": "RTX shares soar 6% on remarkable earnings news",
    "description": "Company delivers better than expected results Aerospace and defense powerhouse RTX is proving that strong demand can overcome significant economic headwinds. The Arlington, Virginia-based company announced Tuesday that it is raising its full-year profit and r…",
    "link": "https://rollingout.com/2025/10/21/rtx-raises-2025-forecast-demand-tariff/",
    "timestamp": "2025-10-21T13:55:33Z"
  },
  {
    "title": "Trump DOJ Attorney Texts Reporter About NY AG Federal Case, Ghosts Request for Clarity",
    "description": "One of President Donald Trump's hand-picked U.S. Attorneys -- who is currently prosecuting New York Attorney General Letitia James -- reportedly texted with a journalist to complain about her coverage of the high-profile case ... and then tried to walk back t…",
    "link": "https://www.tmz.com/2025/10/21/trump-doj-lindsey-halligan-anna-bower-signal-letitia-james/",
    "timestamp": "2025-10-21T13:54:49Z"
  },
  {
    "title": "Thane girl wins best athlete award at nat’l championship",
    "description": "Thane: Shourya Ambure from Thane once again made her mark in Indian athletics by winning the best athlete award in the girls under-18 category at the .",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/thane-girl-wins-best-athlete-award-at-natl-championship/articleshow/124723371.cms",
    "timestamp": "2025-10-21T13:54:44Z"
  },
  {
    "title": "'Betrayal': Ranchers furious as Trump plans to spend US taxes to buy Argentinian beef",
    "description": "US ranchers and industry groups are responding critically to President Donald Trump’s proposal that the United States\r\n “would buy some beef from Argentina\r\n” in a bid to “bring our beef prices down,” while pursuing an up to $40 billion bailout\r\n for the Sout…",
    "link": "https://www.rawstory.com/betrayal-ranchers-furious-as-trump-uses/",
    "timestamp": "2025-10-21T13:54:41Z"
  },
  {
    "title": "Poland could resort to terrorism – Lavrov",
    "description": "Foreign Minister Sergey Lavrov has accused Poland of considering terrorist acts against Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626773-lavrov-poland-putin-plane/",
    "timestamp": "2025-10-21T13:52:47Z"
  },
  {
    "title": "Trump Threatens to Put a ‘FAST, FURIOUS & BRUTAL’ End to Hamas If It Doesn’t Disarm",
    "description": "Hamas, in recent days, has been filmed publicly executing Palestinians in Gaza, footage of which sparked outrage as reports of Hamas attacks on rival groups continue to come in.\nThe post Trump Threatens to Put a ‘FAST, FURIOUS & BRUTAL’ End to Hamas If It Doe…",
    "link": "https://www.mediaite.com/politics/trump-threatens-to-put-a-fast-furious-brutal-end-to-hamas-if-it-doesnt-disarm/",
    "timestamp": "2025-10-21T13:52:41Z"
  },
  {
    "title": "With legacy on the line, Obama hitting campaign trail to boost Democrats in key governor elections",
    "description": "Democratic gubernatorial candidates Rep. Mikie Sherrill and former Rep. Abigail Spanberger get Barack Obama's support in tight New Jersey and Virginia races.",
    "link": "https://www.foxnews.com/politics/obama-hits-campaign-trail-boost-democrats-weekend-before-election-day-key-governor-showdowns",
    "timestamp": "2025-10-21T13:51:58Z"
  },
  {
    "title": "Analysis: Trump is trying to break China’s monopoly on rare earths, but can’t cut deals fast enough to catch up",
    "description": "As Beijing weaponizes its dominance over rare earths supplies, US President Donald Trump is cutting deals to try to break the stranglehold. But his claim that America will have an abundance of the critical minerals in just one year’s time may be a fantasy.",
    "link": "https://www.cnn.com/2025/10/21/business/us-australia-rare-earth-deal-intl-hnk",
    "timestamp": "2025-10-21T13:51:54Z"
  },
  {
    "title": "Trump’s White House Demolition Is the Perfect Symbol of His Presidency",
    "description": "Trump’s East Wing demolition began before full approval. The marble may shine, but what’s crumbling is the process meant to protect democracy’s house.\nThe post Trump’s White House Demolition Is the Perfect Symbol of His Presidency first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trumps-white-house-demolition-is-the-perfect-symbol-of-his-presidency/",
    "timestamp": "2025-10-21T13:50:33Z"
  },
  {
    "title": "Why Is Trump Inviting Senators to Lunch at the Rose Garden?",
    "description": "In the midst of a government shutdown, President Donald Trump has invited Republican senators to have lunch with him at the White House’s newly renovated... Read More\nThe post Why Is Trump Inviting Senators to Lunch at the Rose Garden? appeared first on The D…",
    "link": "https://www.dailysignal.com/2025/10/21/why-is-trump-inviting-senators-lunch-rose-garden/",
    "timestamp": "2025-10-21T13:50:29Z"
  },
  {
    "title": "Donald Trump Considering Diddy Commutation This Week (TMZ.com)",
    "description": "TMZ.com:\nDonald Trump Considering Diddy Commutation This Week  —  10/21 — 6:33 AM PT — The White House Communications Office is saying our story is not true.  We stand by our story.  —  Donald Trump is considering commuting Diddy's sentence as early as this w…",
    "link": "https://www.memeorandum.com/251021/p30",
    "timestamp": "2025-10-21T13:50:00Z"
  },
  {
    "title": "Pardoned Jan. 6 rioter accused of threatening US Democratic leader Jeffries (Reuters)",
    "description": "Reuters:\nPardoned Jan. 6 rioter accused of threatening US Democratic leader Jeffries  —  A Jan. 6 rioter pardoned by U.S. President Donald Trump has been charged with threatening to kill House of Representatives Democratic leader Hakeem Jeffries, according to…",
    "link": "https://www.memeorandum.com/251021/p27",
    "timestamp": "2025-10-21T13:50:00Z"
  },
  {
    "title": "Bill Ackman calls Trump the 'most pro-business president we've ever had'",
    "description": "Ackman also said Trump has done an \"excellent job.\"",
    "link": "https://www.cnbc.com/2025/10/21/bill-ackman-calls-trump-the-most-pro-business-president-weve-ever-had.html",
    "timestamp": "2025-10-21T13:49:11Z"
  },
  {
    "title": "Japan’s parliament elects Sanae Takaichi as nation’s first female prime minister",
    "description": "Japan's parliament has elected Sanae Takaichi as the country’s first female prime minister.",
    "link": "https://www.bostonherald.com/2025/10/21/japan-first-female-prime-minister/",
    "timestamp": "2025-10-21T13:48:42Z"
  },
  {
    "title": "Rubio – Lavrov meeting in Budapest on 30 October, says Financial Times – What Moscow says",
    "description": "Zakharova described as a \"communication show\" the reports about the US meeting with his Russian counterpart\nThe post Rubio – Lavrov meeting in Budapest on 30 October, says Financial Times – What Moscow says appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/21/rubio-lavrov-meeting-in-budapest-on-30-october-says-financial-times-what-moscow-says/",
    "timestamp": "2025-10-21T13:48:12Z"
  },
  {
    "title": "What did Sam Pepper do? Kick streamer banned for injuring an 8-year-old girl in India with a firecracker",
    "description": "British streamer Sam Pepper is facing backlash after a Diwali fireworks incident in New Delhi allegedly injured a young girl. While live-streaming, Pepper fired a firework towards a group, reportedly hitting a girl and causing a cut above her eyebrow. He has …",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/what-did-sam-pepper-do-kick-streamer-banned-for-injuring-an-8-year-old-girl-in-india-with-a-firecracker/articleshow/124723156.cms",
    "timestamp": "2025-10-21T13:48:11Z"
  },
  {
    "title": "ECB’s Lane flags US dollar risk for banks amid tariff turmoil",
    "description": "Supervisors have been telling banks to watch their dollar exposures amid Trump policy upheaval",
    "link": "https://www.irishtimes.com/business/economy/2025/10/21/ecbs-lane-flags-us-dollar-risk-for-banks-amid-tariff-turmoil/",
    "timestamp": "2025-10-21T13:47:39Z"
  },
  {
    "title": "Maduro Declares Colombia and Venezuela 'Siamese Twins' As Trump Escalates Pressure on Both Nations",
    "description": "Venezuela's authoritarian President Nicolas Maduro said the country and Colombia are \"one country\" as the United States escalates pressure on both countries with military operations in the Caribbean",
    "link": "https://www.ibtimes.com/maduro-declares-colombia-venezuela-siamese-twins-trump-escalates-pressure-both-nations-3787820",
    "timestamp": "2025-10-21T13:47:36Z"
  },
  {
    "title": "Republican support for key Trump nominee collapses following ‘Nazi streak’ texts",
    "description": "Paul Ingrassia’s odds of being confirmed as the next head of the Office of Special Counsel were poor. A leaked text chat made matters vastly worse for him.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republican-support-key-trump-nominee-collapses-nazi-streak-texts-rcna238858",
    "timestamp": "2025-10-21T13:47:00Z"
  },
  {
    "title": "Doubts emerge over Trump-Putin Budapest summit",
    "description": "Kremlin insists conditions for Ukraine ceasefire unchanged following reports suggesting growing US concerns.",
    "link": "https://www.aljazeera.com/news/2025/10/21/doubts-emerge-over-trump-putin-budapest-summit",
    "timestamp": "2025-10-21T13:46:39Z"
  },
  {
    "title": "Trump’s National Guard deployments reignite 200-year-old legal debate over state vs. federal power",
    "description": "The conflicts over President Trump’s deployment of National Guard troops to Illinois and Oregon hinge on a question as old as the Constitution itself: Where does federal power end and state authority begin?",
    "link": "https://theconversation.com/trumps-national-guard-deployments-reignite-200-year-old-legal-debate-over-state-vs-federal-power-267259",
    "timestamp": "2025-10-21T13:44:23Z"
  },
  {
    "title": "Here’s why a swing state Dem governor was in deep red Florida",
    "description": "Governor Gretchen Whitmer (D-MI) is traveling the country to ramp up Democratic messaging ahead of the 2026 midterm elections — and she stopped in deep red Florida, reported The Miami Herald.Whitmer spent Sunday and Monday in South Florida fundraising for the…",
    "link": "https://www.rawstory.com/heres-why-a-swing-state-dem-governor-was-in-deep-red-florida/",
    "timestamp": "2025-10-21T13:41:56Z"
  },
  {
    "title": "Saudi crown prince said to visit WH on November 18",
    "description": "Saudi Arabia's Crown Prince Mohammed bin Salman will supposedly have a bilateral meeting with United States President Donald Trump on November 18 at the White House, CBS News reported on Tuesday.Accor...",
    "link": "https://biztoc.com/x/563e119508c4c34b",
    "timestamp": "2025-10-21T13:41:18Z"
  },
  {
    "title": "Sweden accepts credentials of controversial US ambassador",
    "description": "Sweden on Tuesday accepted the credentials of the new US ambassador Christine Toretti, who was six years ago blocked from becoming ambassador to Malta by the US senate after she was reportedly given a restraining order for threatening her ex-husband's doctor.",
    "link": "https://www.thelocal.se/20251021/sweden-accepts-credentials-of-controversial-us-ambassador",
    "timestamp": "2025-10-21T13:41:15Z"
  },
  {
    "title": "Donald Trump Insists Middle East Allies Want to Fight Hamas",
    "description": "U.S. President Donald Trump said allies in the Middle East are enthusiastic about the idea of fighting Hamas in Gaza if it does not uphold the ceasefire agreement with Israel that he brokered under his 20-point peace plan.\nTrump made the remarks amid reports …",
    "link": "https://biztoc.com/x/659b4906ba8429ae",
    "timestamp": "2025-10-21T13:41:15Z"
  },
  {
    "title": "‘It Was Kind of Funny!’ CNN’s Scott Jennings Throws Down With Liberal Colleague Over Trump’s AI Poop Bomb Video",
    "description": "CNN's Scott Jennings defended the video President Donald Trump posted of himself bombing \"No Kings\" protesters with feces over the weekend.\nThe post ‘It Was Kind of Funny!’ CNN’s Scott Jennings Throws Down With Liberal Colleague Over Trump’s AI Poop Bomb Vide…",
    "link": "https://www.mediaite.com/media/tv/it-was-kind-of-funny-cnns-scott-jennings-throws-down-with-liberal-colleague-over-trumps-ai-poop-bomb-video/",
    "timestamp": "2025-10-21T13:41:12Z"
  },
  {
    "title": "Europe Backs Trump's Ukraine Peace Push As Kremlin Hedges On Summit",
    "description": "European leaders Tuesday threw their support behind President Donald Trump's peace push for Ukraine, while reaffirming their red lines, as the Kremlin cast doubt on chances of an imminent summit between the US leader and Vladimir Putin.",
    "link": "https://www.ibtimes.com/europe-backs-trumps-ukraine-peace-push-kremlin-hedges-summit-3787815",
    "timestamp": "2025-10-21T13:36:17Z"
  },
  {
    "title": "Fact-checking RFK Jr’s false claim linking autism to circumcision",
    "description": "The US health secretary’s claims are false, as research finds no clear connection between circumcision and autism.",
    "link": "https://www.aljazeera.com/news/2025/10/21/fact-checking-rfk-jrs-false-claim-linking-autism-to-circumcision",
    "timestamp": "2025-10-21T13:36:08Z"
  },
  {
    "title": "What’s behind the crisis between Colombia and the US?",
    "description": "US President Donald Trump has accused Colombia’s president of being a drug peddling “lunatic”.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/10/21/whats-behind-the-crisis-between-colombia-and-the-us",
    "timestamp": "2025-10-21T13:35:26Z"
  },
  {
    "title": "Biden’s ex-press secretary Karine Jean-Pierre: ‘Why are Democrats not fighting back?’",
    "description": "Jean-Pierre explains in her memoir Independent why she decided to leave the Democratic party after two decades",
    "link": "https://www.yahoo.com/news/articles/biden-ex-press-secretary-karine-133525827.html",
    "timestamp": "2025-10-21T13:35:25Z"
  },
  {
    "title": "Senate Republicans head to the White House in a show of unity as the shutdown enters its 4th week",
    "description": "GOP Sen. John Barrasso of Wyoming tells Fox News Channel the message during lunch Tuesday will be, \"Republicans are united.\"",
    "link": "https://www.pbs.org/newshour/politics/senate-republicans-head-to-the-white-house-in-a-show-of-unity-as-the-shutdown-enters-its-4th-week",
    "timestamp": "2025-10-21T13:35:05Z"
  },
  {
    "title": "Gold Slumps Most In Four Years As Record-Breaking Rally Cools",
    "description": "Gold slid the most in four years, with technical indicators looking stretched while US-China tensions ease. Bullion fell by as much as 3.8%, after hitting a fresh peak of $4,381.52 an ounce on Monday. Gold’s ferocious rally has measures like relative strength…",
    "link": "https://www.ndtvprofit.com/markets/gold-slumps-most-in-four-years-as-record-breaking-rally-cools",
    "timestamp": "2025-10-21T13:35:05Z"
  },
  {
    "title": "Trump, Saudi Arabia's Mohammed bin Salman to meet Nov. 18: Report",
    "description": "U.S. President Donald Trump and Saudi Crown Prince Mohammed bin Salman plan to meet at the White House on November 18, CBS said on Tuesday, citing sources familiar with the matter.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-saudi-arabias-mohammed-bin-salman-to-meet-nov-18-says-cbs/articleshow/124723042.cms",
    "timestamp": "2025-10-21T13:34:10Z"
  },
  {
    "title": "Countering Cartels and Communists in the Americas",
    "description": "President Donald Trump is in a fight for the destiny of the Americas. Will Central and South America be free and aligned with the United States -- or will half the Western Hemisphere be forever plagued by cartels, communists and Chinese influence? The Cold Wa…",
    "link": "https://freerepublic.com/focus/f-chat/4347705/posts",
    "timestamp": "2025-10-21T13:33:01Z"
  },
  {
    "title": "Senate Republicans head to the White House in a show of unity as the shutdown enters its fourth week",
    "description": "WASHINGTON — As the government shutdown enters its fourth week, Senate Republicans are headed to the White House on Tuesday — not for urgent talks on how to end it but for a display of unity with President Donald Trump as they refuse to negotiate on any Democ…",
    "link": "https://biztoc.com/x/e16d2fc8c4ddbb68",
    "timestamp": "2025-10-21T13:30:03Z"
  },
  {
    "title": "Ackman: Trump is the most pro-business president",
    "description": "Billionaire hedge fund manager Bill Ackman told CNBC in an interview on Tuesday that United States President Donald Trump is \"the most pro-business president.\"Ackman further mentioned that he feels \"p...",
    "link": "https://biztoc.com/x/ec270495ccad380d",
    "timestamp": "2025-10-21T13:29:51Z"
  },
  {
    "title": "Novo Chairman to Step Down in Shakeup After Rift on Board",
    "description": "Novo Nordisk A/S Chairman Helge Lund is stepping down after a boardroom dispute over governance and will be replaced by Lars Rebien Sorensen, a previous leader of the company who now heads its biggest shareholder.",
    "link": "https://financialpost.com/pmn/business-pmn/novo-chairman-to-step-down-in-shakeup-after-rift-on-board",
    "timestamp": "2025-10-21T13:29:48Z"
  },
  {
    "title": "Harry Sisson Whines To Don Lemon After Trump Targeted Him In AI Video",
    "description": "Harry Sisson complained to Don Lemon after Donald Trump posted an artificial intelligence video targeting him at a \"No Kings\" protest.",
    "link": "https://dailycaller.com/2025/10/21/harry-sisson-whines-don-lemon-trump-targeted-him-video/",
    "timestamp": "2025-10-21T13:28:54Z"
  },
  {
    "title": "Trump to Hamas: 'Your end will be fast, furious, and brutal'",
    "description": "US President issues threat to Hamas over ceasefire violations, 'There is still hope that Hamas will do what is right. If they do not, an end to Hamas will be fast, furious, and brutal.'",
    "link": "https://www.israelnationalnews.com/news/416591",
    "timestamp": "2025-10-21T13:27:35Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Drops Blizzard of Receipts on Trump After Comey Filing",
    "description": "CNN anchor Kaitlan Collins dropped a blizzard of receipts on Trump after a filing by James Comey's attorneys seeking the dismissal of criminal charges.\nThe post CNN’s Kaitlan Collins Drops Blizzard of Receipts on Trump After Comey Filing first appeared on Med…",
    "link": "https://www.mediaite.com/media/tv/cnns-kaitlan-collins-drops-blizzard-of-receipts-on-trump-after-comey-filing/",
    "timestamp": "2025-10-21T13:27:07Z"
  },
  {
    "title": "What a potential Trump-Putin summit in Budapest means for Ukraine and Europe",
    "description": "It appears that the US administration is in the process of redefining “victory” in a way that allows Russia, Ukraine and Europe to live with a frozen conflict",
    "link": "https://indianexpress.com/article/opinion/columns/trump-putin-summit-in-budapest-ukraine-europe-10319205/",
    "timestamp": "2025-10-21T13:25:46Z"
  },
  {
    "title": "CNN Forces Hakeem Jeffries To Spend An Entire Minute Talking About AI Video Of Trump Dropping Poop On Protesters",
    "description": "CNN made House Minority Leader Hakeem Jeffries address an AI video of President Donald Trump dropping poop onto \"No Kings\" protesters from a fighter jet.",
    "link": "https://dailycaller.com/2025/10/21/cnn-hakeem-jeffries-ai-poop-video-trump-no-kings/",
    "timestamp": "2025-10-21T13:24:49Z"
  },
  {
    "title": "No tomahawks for Ukraine",
    "description": "No luck for Volodymyr Zelensky. On 17 October, the Ukrainian president met with his US counterpart Donald Trump. The goal: to obtain valuable long-range Tomahawk missiles, weapons that could prove crucial in the war in Ukraine.  Unfortunately for him, his req…",
    "link": "https://voxeurop.eu/en/tomahawks-united-states-ukraine-trump-zelensky/",
    "timestamp": "2025-10-21T13:22:24Z"
  },
  {
    "title": "Gold Slumps Most in Four Years as Record-Breaking Rally Cools",
    "description": "Gold’s ferocious rally has measures like relative strength indicating that prices have passed well into overbought territory.  A strengthening US dollar has ...",
    "link": "https://finance.yahoo.com/news/gold-slumps-most-four-years-132151209.html",
    "timestamp": "2025-10-21T13:21:51Z"
  },
  {
    "title": "George Santos promises prison reform work after Trump commutes his federal fraud sentence",
    "description": "Former New York Rep. George Santos vows to focus on prison reform after President Trump commuted his seven-year sentence for campaign fraud and identity theft.",
    "link": "https://www.foxnews.com/media/george-santos-promises-prison-reform-work-after-trump-commutes-his-federal-fraud-sentence",
    "timestamp": "2025-10-21T13:21:30Z"
  },
  {
    "title": "Donald Trump’s Venezuela campaign will be disastrous",
    "description": "Trump is the latest president to meddle in Latin America — and the outcome will be no different",
    "link": "https://www.salon.com/2025/10/21/donald-trumps-venezuela-campaign-will-be-disastrous/",
    "timestamp": "2025-10-21T13:20:47Z"
  },
  {
    "title": "European leaders back Ukraine ceasefire proposal at current contact line (Euronews)",
    "description": "Euronews:\nEuropean leaders back Ukraine ceasefire proposal at current contact line  —  European leaders have closed ranks in support of Ukraine after US President Donald Trump announced a potential summit with his Russian counterpart Vladimir Putin in Budapes…",
    "link": "https://www.memeorandum.com/251021/p23",
    "timestamp": "2025-10-21T13:20:01Z"
  },
  {
    "title": "Congress Aims For New Tech Restrictions Targeting China In NDAA",
    "description": "The annual defense policy bill includes several amendments aimed at limiting China's access to US advanced technology. However, their chances of passing are unclear.",
    "link": "https://www.forbes.com/sites/owentedford/2025/10/21/congress-aims-for-new-tech-restrictions-targeting-china-in-ndaa/",
    "timestamp": "2025-10-21T13:19:25Z"
  },
  {
    "title": "Trump: M. East allies ready to deploy heavy force in Gaza",
    "description": "United States President Donald Trump said on Tuesday that several US allies in the Middle East are ready to deploy military forces into Gaza at his request.\"Numerous of our NOW GREAT ALLIES in the Mid...",
    "link": "https://biztoc.com/x/7a9ac61267e5c685",
    "timestamp": "2025-10-21T13:19:02Z"
  },
  {
    "title": "What Sanae Takaichi Has Said About Donald Trump",
    "description": "Trump is set to visit Tokyo just days after Sanae Takaichi has become Japan's first female prime minister.",
    "link": "https://biztoc.com/x/71ae6a08b13a331c",
    "timestamp": "2025-10-21T13:19:02Z"
  },
  {
    "title": "Veteran GOP Fundraiser Quits Party, Trashes Donald Trump",
    "description": "Miles Bruner said the GOP had become “a cult of personality that mirrors the worst authoritarian regimes” of the past century.",
    "link": "https://biztoc.com/x/84e1dfb321878fe0",
    "timestamp": "2025-10-21T13:18:54Z"
  },
  {
    "title": "'They are winners': Comey's 'immaculate' court filing praised as Trump team put on spot",
    "description": "The dismissal motions filed by former FBI Director James Comey’s legal team aimed at getting the Department of Justice’s case against him tossed are “immaculate,” according to a former U.S. attorney.On her “Civil Discourse” column on Substack, ex-federal pros…",
    "link": "https://www.rawstory.com/comey-defense/",
    "timestamp": "2025-10-21T13:18:48Z"
  },
  {
    "title": "US, Australia sign deal for critical minerals to limit dependence on China",
    "description": "US President Donald Trump and Australian Prime Minster Anthony Albanese have signed a deal for critical minerals.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/10/21/us-australia-sign-deal-for-critical-minerals-to-limit-dependence-on-china",
    "timestamp": "2025-10-21T13:17:35Z"
  },
  {
    "title": "Four Republicans Turn Against Trump Nominee After Nazi Texts Revealed",
    "description": "Paul Ingrassia—President Donald Trump’s nominee to head the Office of Special Counsel—may not be confirmed after his racist and antisemitic messages were unearthed Monday by Politico, leading some Republican senators to repudiate him.In the private text messa…",
    "link": "https://newrepublic.com/post/202052/republicans-against-trump-nominee-ingrassia-nazi-texts",
    "timestamp": "2025-10-21T13:17:26Z"
  },
  {
    "title": "Schools Find Their Spines",
    "description": "Seven universities rejected a proposal linking federal funds to academic freedom rules, citing threats to institutional independence.",
    "link": "https://reason.com/2025/10/21/schools-find-their-spines/",
    "timestamp": "2025-10-21T13:17:18Z"
  },
  {
    "title": "State Department blasts Dems over shutdown, says national security at risk amid Senate battle",
    "description": "The State Department issued a warning that the government shutdown will \"impact U.S. foreign policy.\"",
    "link": "https://www.foxnews.com/politics/state-department-blasts-dems-over-shutdown-says-national-security-risk-amid-senate-battle",
    "timestamp": "2025-10-21T13:17:02Z"
  },
  {
    "title": "What Triggers The Next Rally In Nvidia Stock?",
    "description": "Historically, Nvidia has staged multiple powerful rallies - from riding the cryptocurrency boom to capitalizing on the Covid-era gaming and remote work surge.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/10/21/what-triggers-the-next-rally-in-nvidia-stock/",
    "timestamp": "2025-10-21T13:15:56Z"
  },
  {
    "title": "Trump Tried to Get 'the Grim Reaper' Laid at Mar-a-Lago (Ewan Palmer/The Daily Beast)",
    "description": "Ewan Palmer / The Daily Beast:\nTrump Tried to Get ‘the Grim Reaper’ Laid at Mar-a-Lago  —  WEIRD WINGMAN  —  Trump is said to have “weirded out” aides with his obsession about arranging a hook-up for OMB Director Russell Vought.  —  Donald Trump reportedly to…",
    "link": "https://www.memeorandum.com/251021/p22",
    "timestamp": "2025-10-21T13:15:02Z"
  },
  {
    "title": "Unilever Delays Ice Cream Spinoff on US Federal Shutdown",
    "description": "The US Securities and Exchange Commission is unable to declare effective the US registration statement required for the ice-cream company’s shares to be...",
    "link": "https://finance.yahoo.com/news/unilever-delays-ice-cream-spinoff-131455370.html",
    "timestamp": "2025-10-21T13:14:55Z"
  },
  {
    "title": "Most Americans are worried they’ll pay more for health care next year, new poll finds",
    "description": "The AP-NORC poll shows about 6 in 10 Americans are “extremely” or “very” concerned about their health costs going up in the next year, a worry that extends across age groups and includes people with and without health insurance.",
    "link": "https://www.mlive.com/news/2025/10/most-americans-are-worried-theyll-pay-more-for-health-care-next-year-new-poll-finds.html",
    "timestamp": "2025-10-21T13:13:44Z"
  },
  {
    "title": "US vice president JD Vance in Israel to shore up fragile Gaza ceasefire",
    "description": "Ceasefire has teetered following a burst of deadly violence and questions over how to move forward with long-term peace plan",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/21/us-vice-president-jd-vance-in-israel-to-shore-up-fragile-gaza-ceasefire/",
    "timestamp": "2025-10-21T13:09:38Z"
  },
  {
    "title": "China has another lever to pull in showdown with Trump: Factory lines",
    "description": "In the face of ongoing trade conflicts with the United States, China's manufacturing prowess takes center stage as a strategic advantage. With factories delivering affordable products, the nation is seeing a surge in exports to international markets. This man…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-has-another-lever-to-pull-in-showdown-with-trump-factory-lines/articleshow/124722598.cms",
    "timestamp": "2025-10-21T13:07:48Z"
  },
  {
    "title": "Federal Appeals Court Overturns Lower Court Ruling – President Trump Can Deploy National Guard to Portland",
    "description": "SNIP SOURCE A three-judge panel for the 9th U.S. Circuit Court of Appeals voted 2-1 to stay a district court order that had prevented the deployment of National Guard troops to the city. The majority opinion found it was likely that the president had lawfully…",
    "link": "https://freerepublic.com/focus/f-chat/4347701/posts",
    "timestamp": "2025-10-21T13:06:01Z"
  },
  {
    "title": "Concerned carmakers race to beat China's rare earths deadline",
    "description": "By Nick Carey and Christina Amann LONDON/BERLIN (Reuters) -Global automakers are scouring the globe for crucial rare earths ahead of looming Chinese export...",
    "link": "https://finance.yahoo.com/news/concerned-carmakers-race-beat-chinas-130434342.html",
    "timestamp": "2025-10-21T13:04:34Z"
  },
  {
    "title": "Trump Fuels Feud With Colombia, Threatens Ending Subsidies",
    "description": "President Donald Trump attacked Colombia's president on social media, and threatened to eliminate subsidies to the country on Sunday.",
    "link": "https://hiphopwired.com/2877035/trump-fuels-feud-with-colombia-threatens-ending-subsidies/",
    "timestamp": "2025-10-21T13:03:17Z"
  },
  {
    "title": "Fall in China's exports of rare earth magnets stokes supply chain fears",
    "description": "BEIJING (Reuters) -China's exports of rare earth magnets fell in September, reigniting fears that the world's top supplier could wield its dominance over a...",
    "link": "https://finance.yahoo.com/news/fall-chinas-exports-rare-earth-130256164.html",
    "timestamp": "2025-10-21T13:02:56Z"
  },
  {
    "title": "The Latest: Senate Republicans gathering at White House as shutdown effects worsen",
    "description": "In this fourth week of the government shutdown, Senate Republicans are gathering at White House — not for urgent talks on how to end it, but for a display of...",
    "link": "https://www.yahoo.com/news/articles/latest-senate-republicans-gathering-white-130207230.html",
    "timestamp": "2025-10-21T13:02:07Z"
  },
  {
    "title": "‘The Apprentice’ Screenwriter Gabriel Sherman Signs With Cinetic (EXCLUSIVE)",
    "description": "Cinetic, the talent management and media advisory company known for its work with indie auteurs, has signed screenwriter and bestselling author Gabriel Sherman. Sherman, whose work often explores the intersection of politics and media, wrote the original scre…",
    "link": "https://variety.com/2025/film/news/gabriel-sherman-author-apprentice-writer-cinetic-1236557612/",
    "timestamp": "2025-10-21T13:02:00Z"
  },
  {
    "title": "White House Slams TMZ Report Claiming Donald Trump Considering Commutation of Sean “Diddy” Combs — Calls It “Completely Fraudulent”",
    "description": "The White House struck back at a fake news report from TMZ alleging that President Donald Trump was “seriously considering” commuting the prison sentence of disgraced rap mogul Sean “Diddy” Combs.\nThe post White House Slams TMZ Report Claiming Donald Trump Co…",
    "link": "https://www.thegatewaypundit.com/2025/10/white-house-slams-tmz-report-claiming-donald-trump/",
    "timestamp": "2025-10-21T13:00:49Z"
  }
]