[
  {
    "title": "Dollar braces for busy week of geopolitics and Fed speak",
    "description": "SINGAPORE (Reuters) -The dollar dithered on Monday ahead of a key meeting between U.S. President Donald Trump and his Ukrainian counterpart Volodymyr...",
    "link": "https://finance.yahoo.com/news/dollar-braces-busy-week-geopolitics-010856672.html",
    "timestamp": "2025-08-18T01:08:56Z"
  },
  {
    "title": "Asian Stocks, Oil Dip Modestly Ahead Of Trump's Talks With Zelenskiy: Markets Wrap",
    "description": "Asian shares and crude oil drifted downward as caution prevailed before Donald Trump’s talks with Ukraine’s President Volodymyr Zelenskiy. Shares in Japan edged higher while Australia’s and South Korea’s retreated. Futures for the S&P 500 inched up 0.1%. Bren…",
    "link": "https://www.ndtvprofit.com/markets/asian-stocks-oil-dip-modestly-ahead-of-trumps-talks-with-zelenskiy-markets-wrap",
    "timestamp": "2025-08-18T01:07:21Z"
  },
  {
    "title": "Oil prices today: Oil rates tank following Donald Trump-Vladimir Putin meeting in Alaska. What will happen next?",
    "description": "China, the world's biggest oil importer is the largest Russian oil buyer followed by India.",
    "link": "https://economictimes.indiatimes.com/news/international/us/oil-prices-today-oil-rates-tank-following-donald-trump-vladimir-putin-meeting-in-alaska-what-will-happen-next/articleshow/123352941.cms",
    "timestamp": "2025-08-18T01:01:29Z"
  },
  {
    "title": "MAGA’s Leontief problem",
    "description": "Structurally, Trump is equating the American economy with sub-Saharan Africa",
    "link": "https://www.thehindubusinessline.com/opinion/magas-leontief-problem/article69944740.ece",
    "timestamp": "2025-08-18T01:00:00Z"
  },
  {
    "title": "CNBC Daily Open: 'Peace' can look different to Trump, Putin and Zelenskyy",
    "description": "\"Peace\" could be the halt of armed warfare, acquiring annexed territory, or look like a shiny golden coin engraved with the profile of Alfred Nobel.",
    "link": "https://www.cnbc.com/2025/08/18/cnbc-daily-open-peace-can-look-different-to-trump-putin-and-zelenskyy-.html",
    "timestamp": "2025-08-18T00:57:48Z"
  },
  {
    "title": "Global markets face shaky week ahead as US pressure mounts on Ukraine",
    "description": "Defense stocks and energy markets are in focus as European leaders support Ukraine amid U.S.-Russia talks. Investors anticipate increased European defense spending due to potential shifts in U.S. policy towards Russia, particularly regarding Arctic energy exp…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-markets-face-shaky-week-ahead-as-us-pressure-mounts-on-ukraine/articleshow/123352898.cms",
    "timestamp": "2025-08-18T00:55:21Z"
  },
  {
    "title": "Ukraine may have to recognize territorial losses under peace deal, says French President Macron",
    "description": "Emmanuel Macron suggests Ukraine might concede territory for peace. He emphasizes guarantees for Ukraine's remaining land. A coalition discussed security for Kyiv. Troop deployment for post-conflict peace is considered. Donald Trump will meet with European le…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/ukraine-may-have-to-recognize-territorial-losses-under-peace-deal-says-french-president-macron/articleshow/123352879.cms",
    "timestamp": "2025-08-18T00:52:18Z"
  },
  {
    "title": "Shares nudge higher in Asia, oil slips on truce talks",
    "description": "Asian stock markets edged higher, with the Nikkei reaching a new high, as investors anticipate the Jackson Hole symposium and potential shifts in U.S. interest rate policy. Oil prices slipped amid easing concerns about Russian supply disruptions, while the do…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/shares-nudge-higher-in-asia-oil-slips-on-truce-talks/articleshow/123352869.cms",
    "timestamp": "2025-08-18T00:50:37Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,271",
    "description": "Here are the key events on day 1,271 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/8/18/russia-ukraine-war-list-of-key-events-day-1271",
    "timestamp": "2025-08-18T00:49:49Z"
  },
  {
    "title": "Modi Bolsters India’s Economy With Tax Cuts Ahead of US Tariffs",
    "description": "India expects consumption tax cuts announced by Prime Minister Narendra Modi will give a boost to the economy without hurting the government’s fiscal deficit, helping to offset the fallout from higher US tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/modi-bolsters-indias-economy-with-tax-cuts-ahead-of-us-tariffs",
    "timestamp": "2025-08-18T00:49:26Z"
  },
  {
    "title": "‘$3.4 billion’: Reporter Tells MSNBC Trump Family Turning Down ‘No Opportunity’ For Cash Since Taking Office",
    "description": "The Trump family's love of money is opening up the White House to potential foreign interference by bad actors looking to curry favor with the president.\nThe post ‘$3.4 billion’: Reporter Tells MSNBC Trump Family Turning Down ‘No Opportunity’ For Cash Since T…",
    "link": "https://www.mediaite.com/politics/trump/3-4-billion-reporter-tells-msnbc-trump-family-turning-down-no-opportunity-for-cash-since-taking-office/",
    "timestamp": "2025-08-18T00:47:22Z"
  },
  {
    "title": "Shares nudge higher in Asia, oil slips on truce talks",
    "description": "SYDNEY :Share markets edged higher in Asia on Monday ahead of what is likely to be an eventful week for U.S. interest rate policy, while oil prices slipped as risks to Russian supplies seemed to fade a little.U.S. President Donald Trump now seemed more aligne…",
    "link": "https://www.channelnewsasia.com/business/shares-nudge-higher-in-asia-oil-slips-truce-talks-5299466",
    "timestamp": "2025-08-18T00:40:15Z"
  },
  {
    "title": "Zelenskyy 'could end war if he wants to', says Trump - ahead of crucial White House meeting",
    "description": "Volodymyr Zelenskyy could \"end the war with Russia almost immediately, if he wants to\", Donald Trump has said - ahead of crucial White House talks on the future of Ukraine.",
    "link": "https://news.sky.com/story/donald-trump-says-volodymyr-zelenskyy-could-end-war-with-russia-if-he-wanted-to-ahead-of-crucial-white-house-meeting-13413879",
    "timestamp": "2025-08-18T00:34:00Z"
  },
  {
    "title": "Putin ready to make concessions ahead of Zelensky meeting at White House, Trump envoy says",
    "description": "Russian President Vladimir Putin made concessions on his demand for Ukrainian “land swaps” during his summit with US President Donald Trump in Alaska on Friday, Trump’s envoy Steve Witkoff said. He declined to offer specifics, but suggested the Kremlin now se…",
    "link": "https://thechronicle.com.gh/putin-ready-to-make-concessions-ahead-of-zelensky-meeting-at-white-house-trump-envoy-says/",
    "timestamp": "2025-08-18T00:25:03Z"
  },
  {
    "title": "WATCH: Hillary Clinton ADMITS TRUMP WAS RIGHT! – Says She is “Encouraged” by NATO Progress",
    "description": "The Democrats are starting to realize that they have no chance in elections if they continue to vehemently oppose everything Trump is doing. Failed presidential candidate and treasonous Russiagate conspirator Hillary Clinton said in a recent interview that sh…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335157/posts",
    "timestamp": "2025-08-18T00:23:01Z"
  },
  {
    "title": "Trump-Putin summit: Veteran diplomat explains why putting peace deal before ceasefire wouldn’t end Ukraine War",
    "description": "Ukraine President Volodymyr Zelenskyy meets with President Donald Trump in the aftermath of an inconclusive summit just days before. A veteran diplomat helps untangle what happened and what’s next.",
    "link": "https://theconversation.com/trump-putin-summit-veteran-diplomat-explains-why-putting-peace-deal-before-ceasefire-wouldnt-end-ukraine-war-263314",
    "timestamp": "2025-08-18T00:22:49Z"
  },
  {
    "title": "Trump-Putin summit: Veteran diplomat explains why putting peace deal before ceasefire wouldn’t end Russia-Ukraine war",
    "description": "Ukraine President Volodymyr Zelenskyy meets with President Donald Trump in the aftermath of an inconclusive summit just days before. A veteran diplomat helps untangle what happened and what’s next.",
    "link": "https://theconversation.com/trump-putin-summit-veteran-diplomat-explains-why-putting-peace-deal-before-ceasefire-wouldnt-end-russia-ukraine-war-263314",
    "timestamp": "2025-08-18T00:22:49Z"
  },
  {
    "title": "Pence says Trump needs to bring the 'hammer' down on Putin with immediate new sanctions",
    "description": "Former Vice President Mike Pence said Sunday that President Donald Trump needs to bring the \"hammer\" down on Russian President Vladimir Putin with additional secondary sanctions. After meeting with Putin at a high-stakes summit in Alaska, Trump shifted from a…",
    "link": "https://freerepublic.com/focus/f-news/4335156/posts",
    "timestamp": "2025-08-18T00:22:27Z"
  },
  {
    "title": "Should Europe wean itself off US tech?",
    "description": "Should Europe wean itself off US tech?\nImagine if US President Donald Trump could flip a switch and turn off Europe's internet.\nIt may sound far-fetched, crazy even. But it's a scenario that has been seriously discussed in tech industry and policy circles in …",
    "link": "https://biztoc.com/x/7cc4c8bc7a35e9f5",
    "timestamp": "2025-08-18T00:21:55Z"
  },
  {
    "title": "Washington talks could prove more vital for Ukraine's future than Trump-Putin summit",
    "description": "The Washington meeting could prove to be crucial to the future of Ukraine, and all of Europe's security.",
    "link": "https://www.bbc.com/news/articles/ckglxlx5vldo",
    "timestamp": "2025-08-18T00:15:39Z"
  },
  {
    "title": "“The weakest president”: Dominik Hasek slams Donald Trump for welcoming Vladimir Putin at Alaska summit",
    "description": "Czech hockey legend Dominik Hasek has strongly condemned the Alaska summit between Donald Trump and Vladimir Putin, labeling Trump as the \"weakest president.\" Hasek criticized the red-carpet welcome given to Putin, calling him the \"greatest criminal of the 21…",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/the-weakest-president-dominik-hasek-slams-donald-trump-for-welcoming-vladimir-putin-at-alaska-summit/articleshow/123352566.cms",
    "timestamp": "2025-08-18T00:11:13Z"
  },
  {
    "title": "Zelensky and allies head to White House for Ukraine talks",
    "description": "European leaders will join Zelensky as he attends a crunch meeting with Trump on the Russia-Ukraine war.",
    "link": "https://www.bbc.com/news/articles/cm21j1ve817o",
    "timestamp": "2025-08-18T00:09:03Z"
  },
  {
    "title": "Putin 'exploited' Trump's aim for a Nobel Peace Prize for 'strategic gains': WSJ editorial",
    "description": "The Wall Street Journal's conservative editorial board slammed last week's Trump-Putin summit in a new op-ed published on Sunday. President Donald Trump and Russian President Vladimir Putin met in Anchorage, Alaska, on Friday to negotiate an end to the war in…",
    "link": "https://www.rawstory.com/trump-2673891274/",
    "timestamp": "2025-08-18T00:01:11Z"
  },
  {
    "title": "Europe Reveals Itself as Ridiculous in Ukraine",
    "description": "By Donald Trump’s transactional criterion, NATO has been a costly failure that needs fixing or needs to be cut lose. Europe has failed to pay the price and has left the U.S. with the financial and military burden of defending Europe. The war in Ukraine has pr…",
    "link": "https://original.antiwar.com/ted_snider/2025/08/17/europe-reveals-itself-as-ridiculous-in-ukraine/",
    "timestamp": "2025-08-18T00:00:56Z"
  },
  {
    "title": "US-Russia Talks: the Choice Between Peace and Escalation",
    "description": "Donald Trump came into office promising to end the war in Ukraine in 24 hours. Now, six months later, his high stakes meeting with Vladimir Putin in Alaska may have put the United States and Russia on a new path toward peace, or, if this initiative fails, cou…",
    "link": "https://original.antiwar.com/mbenjamin/2025/08/17/us-russia-talks-the-choice-between-peace-and-escalation/",
    "timestamp": "2025-08-18T00:00:40Z"
  },
  {
    "title": "Trump’s punishing tariffs to deepen the slump in one large corner of Indian banking",
    "description": "As the disruption caused by Trump's punishing ripples through the economy, Indian banks may not escape a further slowing in a segment that accounts for over a fifth of their loan books.",
    "link": "https://www.livemint.com/industry/trumps-tariffs-further-slow-down-corporate-loan-growth-larger-impact-on-economy-sbi-hdfc-icici-bank-11755411728478.html",
    "timestamp": "2025-08-18T00:00:19Z"
  },
  {
    "title": "Eric Swalwell rejects Michelle Obama's 'when they go low, we go high' message, vows to 'bury' Republicans",
    "description": "Rep. Eric Swalwell, D-Calif., said that he doesn’t have concerns about Democratic redistricting efforts backfiring while fighting against Texas Republicans.",
    "link": "https://www.foxnews.com/media/eric-swalwell-rejects-michelle-obamas-when-go-low-we-go-high-message-vows-bury-republicans",
    "timestamp": "2025-08-18T00:00:02Z"
  },
  {
    "title": "Putin–Trump Summit: Much Ado About What Exactly?",
    "description": "The hastily convened summit between Russian President Vladimir Putin and his American counterpart Donald Trump raises profound questions about how much preparation for this conclave had been made in advance, especially on the American side.",
    "link": "https://www.hoover.org/research/putin-trump-summit-much-ado-about-what-exactly",
    "timestamp": "2025-08-18T00:00:00Z"
  },
  {
    "title": "Maureen Dowd Shocker: Trump Making the Right Moves on D.C. Crime",
    "description": "New York Times columnist and regular Donald Trump basher Maureen Dowd begrudgingly implied over the weekend that Trump is right on the politics and policy when it comes to crime in the nation’s capital.\nThe post Maureen Dowd Shocker: Trump Making the Right Mo…",
    "link": "https://www.breitbart.com/crime/2025/08/17/maureen-dowd-shocker-trump-making-the-right-moves-on-d-c-crime/",
    "timestamp": "2025-08-17T23:51:55Z"
  },
  {
    "title": "Europeans to back Zelensky-Trump meeting in Washington",
    "description": "European leaders will join the Ukrainian President Volodymyr Zelensky to meet Donald Trump in Washington later today, they said, seeking to shore up Mr Zelensky's position as the US president presses Ukraine to accept a quick peace deal to end Europe's deadli…",
    "link": "https://www.rte.ie/news/ukraine/2025/0818/1528895-ukraine-russia-us/",
    "timestamp": "2025-08-17T23:50:34Z"
  },
  {
    "title": "Ukrainian designer predicts Zelenskyy will wear military suit for high-stakes Trump meeting",
    "description": "Fashion designer Elvira Gasanova says Zelenskyy will likely choose military-style clothing for his upcoming meeting with President Trump in Washington.",
    "link": "https://www.foxnews.com/world/ukrainian-designer-predicts-zelenskyy-wear-military-suit-high-stakes-trump-meeting",
    "timestamp": "2025-08-17T23:37:12Z"
  },
  {
    "title": "GOP Senators: Scrap the Post Office Electric Vehicle 'Boondoggle'",
    "description": "“Neither snow nor rain nor heat nor gloom of night stays these couriers from the completion of their appointed rounds” goes the U.S. Postal Service creed – but not with electric vehicles, if some Republican lawmakers have their way.\nThe post GOP Senators: Scr…",
    "link": "https://www.breitbart.com/environment/2025/08/17/30759804gop-senators-scrap-the-post-office-electric-vehicle-boondoggle/",
    "timestamp": "2025-08-17T23:35:37Z"
  },
  {
    "title": "Israeli ‘Dancing With the Stars’ Contestants Go Viral With Donald and Melania Trump Tribute | Video",
    "description": "A piece of Trumpian performance art has taken the internet by storm. Haim Pershtin and internet personality Taylor Malkov, participants on Israel's version of \"Dancing With the Stars\" debuted a routine inspired by Donald and Melania Trump — and set to \"The St…",
    "link": "https://www.thewrap.com/israeli-dancing-with-the-stars-contestants-go-viral-with-donald-and-melania-trump-tribute-video/",
    "timestamp": "2025-08-17T23:34:56Z"
  },
  {
    "title": "\"President applauded the criminal\": Dominik Hašek blasts U.S. for honoring a war criminal as Donald Trump rolls out red carpet for Vladimir Putin",
    "description": "Dominik Hašek, a vocal critic of Russia, has condemned the Alaska summit between Donald Trump and Vladimir Putin. He criticized the red-carpet military welcome given to Putin, labeling him “the greatest criminal of the 21st century.” Hašek's outrage reflects …",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/president-applauded-the-criminal-dominik-haek-blasts-u-s-for-honoring-a-war-criminal-as-donald-trump-rolls-out-red-carpet-for-vladimir-putin/articleshow/123352239.cms",
    "timestamp": "2025-08-17T23:34:43Z"
  },
  {
    "title": "Putin, Trump, and a summit that ended in stalemate",
    "description": "The Alaska Summit between Putin and Trump ended prematurely after three hours without big outcomes, raising worries about unresolved issues. Both leaders expressed differing expectations, and the summit highlighted complexities of US-Russia ties",
    "link": "https://www.livemint.com/opinion/columns/vladimir-putin-donald-trump-alaska-summit-stalemate-zelensky-11755419672195.html",
    "timestamp": "2025-08-17T23:30:17Z"
  },
  {
    "title": "Jobs of 1.73 lakh workers in gems and jewellery trade hang in balance",
    "description": "The new 25-50% tariffs on Indian diamond and studded jewellery imports are expected to severely impact labour-intensive manufacturing hubs in Gujarat, Maharashtra, and Rajasthan.",
    "link": "https://www.livemint.com/industry/jobs-of-1-73-lakh-workers-in-gems-and-jewellery-trade-hang-in-balance-11755436686425.html",
    "timestamp": "2025-08-17T23:30:17Z"
  },
  {
    "title": "EU leaders to join Zelenskyy at White House",
    "description": "European and NATO leaders announced Sunday they will join President Volodymyr Zelenskyy in Washington to present a united front in talks with President Donald Trump on ending Russia's war in Ukraine and firming up U.S. security guarantees now on the negotiati…",
    "link": "https://www.bostonherald.com/2025/08/17/eu-leaders-to-join-zelenskyy-at-white-house/",
    "timestamp": "2025-08-17T23:21:04Z"
  },
  {
    "title": "Trump’s peace-deal demands leave Ukraine's Zelenskyy with only bad options",
    "description": "Ukrainian leader Volodymyr Zelenskyy faces an existential dilemma as he travels to Washington for talks with U.S. President Donald Trump on Monday.",
    "link": "https://www.japantimes.co.jp/news/2025/08/18/world/trump-ukraine-deal-zelenskyy/",
    "timestamp": "2025-08-17T23:21:00Z"
  },
  {
    "title": "Trump’s peace-deal demands leave Ukraine's Zelenskyy with only bad options",
    "description": "Ukrainian leader Volodymyr Zelenskyy faces an existential dilemma as he travels to Washington for talks with U.S. President Donald Trump on Monday.",
    "link": "https://www.japantimes.co.jp/news/2025/08/18/world/politics/trump-ukraine-deal-zelenskyy/",
    "timestamp": "2025-08-17T23:21:00Z"
  },
  {
    "title": "Deal or no deal, Mark Carney has to manage a new relationship with the United States",
    "description": "A week after the latest deadline to somehow resolve the trade war that Donald Trump has launched against Canada — and with Canadian officials now looking ahead to a full renegotiation of the Canada-U.S.-Mexico Agreement — many things remain unclear. But when …",
    "link": "https://freerepublic.com/focus/f-news/4335146/posts",
    "timestamp": "2025-08-17T23:16:02Z"
  },
  {
    "title": "Former FBI Director James Comey confesses he's a 'Swiftie' in new anti-Trump video message",
    "description": "James Comey revealed his family's Taylor Swift obsession and participation in \"Swiftie\" group chat while taking political swipes at Donald Trump in strange video.",
    "link": "https://www.foxnews.com/politics/former-fbi-director-james-comey-confesses-hes-swiftie-new-anti-trump-video-message",
    "timestamp": "2025-08-17T23:15:44Z"
  },
  {
    "title": "'That's not how Putin saw it': Analyst warns Trump's 'show of force' at summit backfired",
    "description": "President Donald Trump may have done more to help Russian President Vladimir Putin than he did to help Ukraine during the summit in Alaska on Friday, according to one analyst. Trump said he intended to negotiate a ceasefire in the three-and-a-half-year war in…",
    "link": "https://www.rawstory.com/trump-2673891247/",
    "timestamp": "2025-08-17T23:12:24Z"
  },
  {
    "title": "European leaders to join Ukraine's Zelenskyy for meeting with Trump",
    "description": "European and NATO leaders will join President Volodymyr Zelenskyy in Washington for talks with President Donald Trump.",
    "link": "https://www.wishtv.com/news/politics/european-leaders-to-join-ukraines-zelenskyy-for-meeting-with-trump/",
    "timestamp": "2025-08-17T23:11:26Z"
  },
  {
    "title": "Trump runs into the difficulty of Putin diplomacy and ending a long war",
    "description": "President Donald Trump walked into a summit with Russia’s Vladimir Putin pressing for a ceasefire deal and threatening “severe consequences” and tough new sanctions if the Kremlin leader failed to agree to halt the fighting in Ukraine. Instead, Trump was the …",
    "link": "https://www.wishtv.com/news/politics/trump-runs-into-the-difficulty-of-putin-diplomacy-and-ending-a-long-war/",
    "timestamp": "2025-08-17T23:11:26Z"
  },
  {
    "title": "Asia Set for Cautious Open Ahead of Ukraine Talks: Markets Wrap",
    "description": "Asian markets are set for a tepid start ahead of talks between Donald Trump and Volodymyr Zelenskiy, after the US-Russia summit on the Ukraine war ended without a ceasefire.",
    "link": "https://financialpost.com/pmn/business-pmn/asia-set-for-cautious-open-ahead-of-ukraine-talks-markets-wrap",
    "timestamp": "2025-08-17T23:07:28Z"
  },
  {
    "title": "US, Russia agree on Ukraine security",
    "description": "Donald Trump and Vladimir Putin agreed at their summit in Alaska last week that the U.S. would be able to offer security guarantees to Ukraine, according to Steve Witkoff, Trump’s special envoy, even as many details of Friday’s meeting remain unclear.",
    "link": "https://www.bostonherald.com/2025/08/17/us-russia-agree-on-ukraine-security/",
    "timestamp": "2025-08-17T23:04:38Z"
  },
  {
    "title": "Mark Cuban warns Donald Trump he will run for President in 2028, but only if he does one thing",
    "description": "There may well be a shift in the political waters coming to the United States as billionaire entrepreneur and former Shark Tank investor Mark Cuban admitted he could be forced to r",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/08/18/68a25f28ca474187738b4586.html",
    "timestamp": "2025-08-17T23:04:29Z"
  },
  {
    "title": "‘NEITHER SIDE IS GOING TO SURRENDER’: Rubio States Russia and Ukraine Will Have to Make Concessions",
    "description": "Secretary of State Marco Rubio argued on ABC’s “This Week” Sunday morning that both Russia and Ukraine are bound to “give and get” in order... Read More\nThe post ‘NEITHER SIDE IS GOING TO SURRENDER’: Rubio States Russia and Ukraine Will Have to Make Concessio…",
    "link": "https://www.dailysignal.com/2025/08/17/trump-administration-priority-promote-peace/",
    "timestamp": "2025-08-17T23:03:43Z"
  },
  {
    "title": "Should Europe wean itself off US tech?",
    "description": "Just three US firms provide 70% of Europe's cloud-computing, leading to fears of overreliance.",
    "link": "https://www.bbc.com/news/articles/c3dpr2zkny0o",
    "timestamp": "2025-08-17T23:03:19Z"
  },
  {
    "title": "Donald Trump deserves praise for having the nerve to meet Vladimir Putin face-to-face",
    "description": "Let’s praise Donald. Thank him. Respect him. Who else had the gizzard, nerves, smarts to stand face-to-face to Satan’s lying teeth in front of the world?",
    "link": "https://nypost.com/2025/08/17/opinion/donald-trump-deserves-praise-for-having-the-nerve-to-meet-vladimir-putin-face-to-face/",
    "timestamp": "2025-08-17T23:02:45Z"
  },
  {
    "title": "Marco Rubio, Sen. Chris Murphy Push Polar Opposite Trump-Putin Summit Takes on ‘Meet the Press’ | Video",
    "description": "\"War criminals are not normally invited to the United States,\" the Connecticut senator says, \nThe post Marco Rubio, Sen. Chris Murphy Push Polar Opposite Trump-Putin Summit Takes on ‘Meet the Press’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/marco-rubio-sen-chris-murphy-opposite-trump-putin-summit-takes/",
    "timestamp": "2025-08-17T23:02:32Z"
  },
  {
    "title": "Zelensky hails 'historic' US commitment to offer Ukraine security guarantees in event of peace",
    "description": "With less than 24 hours to go before he meets Donald Trump again, Volodymyr Zelensky has hailed the president's \"historic decision\" to offer Ukraine security guarantees if a peace deal is reached with Russia. It's unclear exactly what shape this support might…",
    "link": "https://freerepublic.com/focus/f-news/4335142/posts",
    "timestamp": "2025-08-17T23:01:28Z"
  },
  {
    "title": "The stakes are high - and the unity of the alliance against Putin has never been so threatened",
    "description": "The challenge for Volodymyr Zelenskyy for his talks with Donald Trump at the White House is to avoid a repeat of the disastrous encounter the last time they met there.",
    "link": "https://news.sky.com/story/the-stakes-are-high-and-the-unity-of-the-alliance-against-putin-has-never-been-so-threatened-13413864",
    "timestamp": "2025-08-17T23:01:00Z"
  },
  {
    "title": "Trump relaxed restrictions on a key AI chip for China. Beijing isn’t saying thank you. | CNN Business",
    "description": "In a surprising reversal of the United States’ years-long technology restrictions on China, President Donald Trump last month allowed Nvidia to resume sales of a key AI chip designed specifically for the Chinese market.",
    "link": "https://www.cnn.com/2025/08/17/tech/nvidia-china-beijing-trump-ai-intl-hnk",
    "timestamp": "2025-08-17T23:00:42Z"
  },
  {
    "title": "'60 MINUTES' Australia tackls Trump, Epstein... | 'I THOUGHT SHE WAS 16'...",
    "description": "In death, Jeffrey Epstein has managed to do something no one else has been able to - drive a wedge between Donald Trump and his loyal base.",
    "link": "https://9now.nine.com.au/60-minutes/how-jeffrey-epstein-files-have-turned-donald-trump-base-against-him/d68a08aa-c0b6-4663-8ddc-de454473103c",
    "timestamp": "2025-08-17T23:00:04Z"
  },
  {
    "title": "PM Modi urges states to cooperate in implementing proposed GST reforms",
    "description": "NEW DELHI, Aug 17: Prime Minister Narendra Modi on Sunday said the Centre has circulated the draft of the next-generation GST reforms among states and sought their cooperation to implement the proposal before Diwali. He said the reform in GST would benefit po…",
    "link": "https://thehillstimes.in/national/pm-modi-urges-states-to-cooperate-in-implementing-proposed-gst-reforms",
    "timestamp": "2025-08-17T23:00:00Z"
  },
  {
    "title": "Examining rumor Trump wants to lower age of consent and marriage to 14",
    "description": "Some users claimed Trump desired to protect himself from potential future charges for alleged crimes involving convicted sex offender Jeffrey Epstein.",
    "link": "https://www.snopes.com//news/2025/08/17/trump-age-consent-marriage/",
    "timestamp": "2025-08-17T23:00:00Z"
  },
  {
    "title": "Ukrainian mood hardens as MPs insist country should not be forced to surrender",
    "description": "A string of Ukrainian politicians and public figures condemned the idea of handing over unoccupied land to Russia for peace on Sunday, arguing that their country had not been defeated and should not be forced into a surrender. The hardening of the mood came a…",
    "link": "https://freerepublic.com/focus/f-news/4335141/posts",
    "timestamp": "2025-08-17T22:56:10Z"
  },
  {
    "title": "Russia strikes Kharkiv with ballistic missile, injures 11, Ukraine says",
    "description": "KHARKIV (Reuters) -Russia hit a residential area in Kharkiv with a ballistic missile, injuring at least 11 people, Ukrainian authorities said late on Sunday, as the U.S. president presses Kyiv to accept a quick deal to end the war that Moscow had started. Rea…",
    "link": "https://www.thestar.com.my/news/world/2025/08/18/russia-strikes-kharkiv-with-ballistic-missile-injures-11-ukraine-says",
    "timestamp": "2025-08-17T22:51:00Z"
  },
  {
    "title": "Oil Dips as Focus Shifts to Zelenskiy Meet After Putin Summit",
    "description": "Oil slipped as traders turned their attention to Donald Trump’s meeting with Volodymyr Zelenskiy on Monday, with the Ukrainian leader facing US pressure to reach a peace deal with Russia that involves ceding territory.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-dips-as-focus-shifts-to-zelenskiy-meet-after-putin-summit",
    "timestamp": "2025-08-17T22:47:06Z"
  },
  {
    "title": "Oil slips as Russia supply concerns ease after Trump-Putin meet",
    "description": "SINGAPORE (Reuters) -Oil prices slipped in early Asian trade on Monday as the United States did not exert more pressure on Russia to end the Ukraine war by...",
    "link": "https://finance.yahoo.com/news/oil-slips-russia-supply-concerns-224014888.html",
    "timestamp": "2025-08-17T22:40:14Z"
  },
  {
    "title": "Senator Calls Trump-Putin Meeting An 'Embarrassment For The United States'",
    "description": "Sen. Chris Murphy called the failed meeting, in which no ceasefire was reached for the war in Ukraine, a \"disaster\" while on air with NBC News.",
    "link": "https://www.huffpost.com/entry/senator-chris-murphy-trump-putin-meeting-failure_n_68a220f9e4b0858c7642ba2a",
    "timestamp": "2025-08-17T22:38:13Z"
  },
  {
    "title": "South Africa's Head General Visited Iranian Special Forces Unit",
    "description": "South African National Defense Force Chief General Rudzani Maphwanya inspected an Iranian special forces unit last week, despite efforts by the South African government to minimize the importance of his visit.\nThe post South Africa’s Head General Visited Iran…",
    "link": "https://www.breitbart.com/africa/2025/08/17/south-africas-head-general-visited-iranian-special-forces-unit/",
    "timestamp": "2025-08-17T22:35:25Z"
  },
  {
    "title": "‘Not Acceptable’: GOP Rep Ripped For Suggesting Trump Get Permanent Power ‘As Long As He Wants’",
    "description": "Rep. Andy Ogles (R) got major blowback on social media after suggesting that Donald Trump be given a hall pass to do whatever he wants.\nThe post ‘Not Acceptable’: GOP Rep Ripped For Suggesting Trump Get Permanent Power ‘As Long As He Wants’ first appeared on …",
    "link": "https://www.mediaite.com/media/news/not-acceptable-gop-rep-ripped-for-suggesting-trump-get-permanent-power-as-long-as-he-wants/",
    "timestamp": "2025-08-17T22:33:17Z"
  },
  {
    "title": "Trump administration minimizes summit papers left in hotel | Honolulu Star-Advertiser",
    "description": "The Trump administration this weekend downplayed a report that officials left in a public area of a hotel documents describing the confidential movements of President Donald Trump and President Vladimir Putin of Russia during their meeting in Alaska on Friday.",
    "link": "https://www.staradvertiser.com/2025/08/17/breaking-news/trump-administration-minimizes-summit-papers-left-in-hotel/",
    "timestamp": "2025-08-17T22:26:24Z"
  },
  {
    "title": "'Not Much Was Accomplished': Fox News Host Offers Brutal Takedown Of Trump's Putin Summit",
    "description": "Fox News host Howard Kurtz opened his Sunday show by noting that \"not much was accomplished\" at President Donald Trump's summit with Russian President Vladimir Putin on the war in Ukraine.\n\n\n\"Three and a half years into the brutal and bloody war in Ukraine af…",
    "link": "https://crooksandliars.com/2025/08/not-much-was-accomplished-fox-news-host",
    "timestamp": "2025-08-17T22:23:54Z"
  },
  {
    "title": "Trump Tells Ukraine To Surrender After Meeting With Putin",
    "description": "Donald Trump told Fox News host Sean Hannity the only way forward for Ukraine is to “make a deal” with Russia because their war criminal invaders are a war machine.\nThe Alaska summit is one of the most embarrassing summits in US history. It accomplished nothi…",
    "link": "https://crooksandliars.com/2025/08/trump-tells-ukraine-surrender-after-putin",
    "timestamp": "2025-08-17T22:23:54Z"
  },
  {
    "title": "When Putin’s jet refuelled in Alaska, the Russians offered to pay in cash",
    "description": "Donald Trump's Secretary of State Marco Rubio and his special envoy Steve Witkoff have spoken about the Alaska summit, discussing \"the crux of the deal\" they want made between Russia and Ukraine.",
    "link": "https://www.abc.net.au/news/2025-08-18/inside-alaska-summit-with-trump-putin-rubio-witkoff/105665374",
    "timestamp": "2025-08-17T22:20:01Z"
  },
  {
    "title": "Trump administration halts visas for Gazans",
    "description": "A day after conservative activist Laura Loomer posted videos on social media of children from Gaza arriving in the U.S. for medical treatment and questioning how they got visas, the State Department said it was halting all visitor visas for people from Gaza p…",
    "link": "https://www.bostonherald.com/2025/08/17/trump-administration-halts-visas-for-gazans/",
    "timestamp": "2025-08-17T22:19:01Z"
  },
  {
    "title": "Angry Gavin Newsom Files FOIA Request on Border Patrol Raid Outside His Rally to Eliminate Republican Seats",
    "description": "California Gov. Gavin Newsom angrily demanded information Sunday about a U.S. Border Patrol raid outside a rally in downtown Los Angeles on Thursday during his rally to gerrymander the state's congressional seats.\nThe post Angry Gavin Newsom Files FOIA Reques…",
    "link": "https://www.breitbart.com/politics/2025/08/17/angry-gavin-newsom-files-foia-request-on-border-patrol-raid-outside-gerrymandering-rally/",
    "timestamp": "2025-08-17T22:12:09Z"
  },
  {
    "title": "‘We Want to Make DC Safe Again’: US Attorney Pirro Explains Trump’s Agenda",
    "description": "U.S. Attorney for the District of Columbia Jeanine Pirro stated clearly on “My View with Lara Trump” on Saturday that federalizing the Metropolitan Police Department... Read More\nThe post ‘We Want to Make DC Safe Again’: US Attorney Pirro Explains Trump’s Age…",
    "link": "https://www.dailysignal.com/2025/08/17/pirro-vows-end-coddling-teen-criminals-dc/",
    "timestamp": "2025-08-17T22:10:44Z"
  },
  {
    "title": "68 DC suspects arrested in single night as White House touts Trump's push to 'clean up' capital city",
    "description": "Nearly 70 arrests were made on Saturday night during Trump's ongoing cleanup operation in Washington D.C., with charges including assault and weapon possession.",
    "link": "https://www.foxnews.com/us/68-dc-suspects-arrested-single-night-white-house-touts-trumps-push-clean-up-capital-city",
    "timestamp": "2025-08-17T22:09:02Z"
  },
  {
    "title": "Russia Is Pumping Out Disinformation That Looks Like Legitimate News Reports",
    "description": "Despite Donald Trump's whining about \"fake news,\" his administration has rolled back efforts to combat it, allowing fakes to flourish",
    "link": "http://www.rollingstone.com/politics/politics-news/russia-pumping-out-disinformation-fake-news-1235410290/",
    "timestamp": "2025-08-17T22:02:00Z"
  },
  {
    "title": "VIDEO: Migrant Detention Center Opening in Texas Will Be Largest in History",
    "description": "A migrant detention facility of historic proportions is scheduled to open on Sunday in El Paso, Texas.\nThe post VIDEO: Migrant Detention Center Opening in Texas Will Be Largest in History appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/08/17/video-migrant-detention-center-opening-in-texas-will-be-largest-in-history/",
    "timestamp": "2025-08-17T22:01:05Z"
  },
  {
    "title": "Marco Rubio accuses CBS reporter of pushing 'stupid media narrative' in fiery clash over Zelensky",
    "description": "Trump hosted Putin in Alaska summit on Ukraine war but failed to secure ceasefire, though both sides reported progress and planned future meetings",
    "link": "https://www.foxnews.com/media/marco-rubio-accuses-cbs-reporter-pushing-stupid-media-narrative-fiery-clash-over-zelensky",
    "timestamp": "2025-08-17T22:00:50Z"
  },
  {
    "title": "Newsom Files Request for Info on Trump Admin Use of Military",
    "description": "The California Governor has again questioned the tactics of President Trump's administration.",
    "link": "https://www.newsweek.com/newsom-files-request-info-trump-admin-use-military-2114750",
    "timestamp": "2025-08-17T22:00:29Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Ukraine and its allies are scrambling to respond to President Donald Trump’s apparent shift toward Vladimir Putin’s hard-line position after their summit in Alaska",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-august-17-rcna225033",
    "timestamp": "2025-08-17T22:00:00Z"
  },
  {
    "title": "‘Just Vague Assurances’: Fox’s Howard Kurtz Says It’s ‘Clear’ Trump-Putin Summit Didn’t Accomplish Much",
    "description": "Fox News host Howard Kurtz claimed that President Donald Trump walked away from the Alaska summit without much to show for it.\nThe post ‘Just Vague Assurances’: Fox’s Howard Kurtz Says It’s ‘Clear’ Trump-Putin Summit Didn’t Accomplish Much first appeared on M…",
    "link": "https://www.mediaite.com/media/news/just-vague-assurances-foxs-howard-kurtz-says-its-clear-trump-putin-summit-didnt-accomplish-much/",
    "timestamp": "2025-08-17T21:51:40Z"
  },
  {
    "title": "Insufficiently Foreign Affairs Open Thread: RUSSIA RUSSIA RUSSIA",
    "description": "Crow: \"Look at what happened. US military personnel in uniform literally were on hands & knees rolling out a red carpet for the most murderous dictator of the 21st century…we keep on acting like Putin deserves to be brought out in open like any of head of sta…",
    "link": "https://balloon-juice.com/2025/08/17/insufficiently-foreign-affairs-open-thread-russia-russia-russia/",
    "timestamp": "2025-08-17T21:40:57Z"
  },
  {
    "title": "Colin Kaepernick docuseries produced by Spike Lee no longer moving forward at ESPN amid 'creative differences'",
    "description": "Kaepernick reportedly wanted the docuseries to focus more on his career, while Lee wanted the story to cover cultural issues including social justice and police brutality.",
    "link": "https://sports.yahoo.com/nfl/article/colin-kaepernick-docuseries-produced-by-spike-lee-no-longer-moving-forward-at-espn-amid-creative-differences-213849203.html",
    "timestamp": "2025-08-17T21:38:49Z"
  },
  {
    "title": "7NEWS breaking news live blog: Follow along as we bring you morning crime, weather and traffic updates | 7NEWS",
    "description": "7NEWS breaking news live blog: Follow along as we bring you morning crime, weather and traffic updates | 7NEWS7news.com.au",
    "link": "https://7news.com.au/news/7news-breaking-news-live-blog-follow-along-as-we-bring-you-morning-crime-weather-and-traffic-updates-c-19715678",
    "timestamp": "2025-08-17T21:37:24Z"
  },
  {
    "title": "BRIG. GEN. JOHN TEICHERT: Accountability For America’s Afghanistan Catastrophe",
    "description": "August marks the solemn four-year anniversary of the American failure in its tragic withdrawal from Afghanistan under President Joe Biden. On Aug. 15, 2021, the Afghan capital of Kabul fell into the hands of Taliban control. On Aug. 26,, thirteen military mem…",
    "link": "https://dailycaller.com/2025/08/17/opinion-accountability-for-americas-afghanistan-catastrophe-brig-gen-john-teichert/",
    "timestamp": "2025-08-17T21:35:58Z"
  },
  {
    "title": "WATCH -- Chuck Todd: Joe Biden's Legacy Is 'Donald Trump Came Back'",
    "description": "Former NBC host Chuck Todd recently offered a stinging assessment of Joe Biden's (D) presidency and how it turned out.\nThe post WATCH — Chuck Todd: Joe Biden’s Legacy Is ‘Donald Trump Came Back’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/the-media/2025/08/17/watch-chuck-todd-joe-bidens-legacy-is-donald-trump-came-back/",
    "timestamp": "2025-08-17T21:30:22Z"
  },
  {
    "title": "The Alaska Summit: A Symposium",
    "description": "The Realist Review and The American Committee for US-Russia Accord have gathered over a dozen experts on US-Russia relations and US foreign policy to share their thoughts on Friday’s summit in Alaska. Below are contributions from Norman Solomon, Ted Snider, M…",
    "link": "https://www.antiwar.com/blog/2025/08/17/the-alaska-summit-a-symposium/",
    "timestamp": "2025-08-17T21:24:00Z"
  },
  {
    "title": "Peter Alexander said President Donald Trump’s aides’ “eyes were wide” when they left the meeting with Russian President Vladimir Putin.",
    "description": "NBC News Chief White House Correspondent Peter Alexander says he won’t forget the “looks on the faces” of President Donald Trump’s team at his summit with...",
    "link": "https://www.thedailybeast.com/nbc-host-peter-alexander-says-karoline-leavitts-shocking-ashen-look-will-stick-with-me/",
    "timestamp": "2025-08-17T21:23:51Z"
  },
  {
    "title": "A dangerous new idea about what Democrats are doing wrong",
    "description": "Polling is “90% bullshit.” In fact, all political data is “garbage.” The Democratic consultants who traffic in such numbers are perpetrating a “scam” against their own party and are largely responsible for President Donald Trump’s victories. Instead of trying…",
    "link": "https://www.vox.com/politics/458175/democrats-polls-immigration-moderation",
    "timestamp": "2025-08-17T21:21:57Z"
  },
  {
    "title": "German foreign minister criticizes 'aggressive' China ahead of trip to Japan",
    "description": "Germany's foreign minister on Sunday criticized what he called the &quot;aggressive behavior&quot; of China in the Taiwan Strait ahead of a trip to Japan and Indonesia, and stressed the need to strengthen internationally binding rules. Speaking to reporters, …",
    "link": "https://japantoday.com/category/politics/german-foreign-minister-criticises-%27aggressive%27-china-ahead-of-trip-to-japan",
    "timestamp": "2025-08-17T21:20:19Z"
  },
  {
    "title": "U.S. seeks shipbuilding expertise from Japan, S Korea to counter China",
    "description": "American lawmakers are using a trip to Japan and South Korea to explore how the United States can tap those allies’ shipbuilding expertise and capacity to help boost its own capabilities, which are dwarfed by those of China. Sens. Tammy Duckworth, D-Ill, and …",
    "link": "https://japantoday.com/category/politics/us-seeks-shipbuilding-expertise-from-south-korea-and-japan-to-counter-china",
    "timestamp": "2025-08-17T21:19:05Z"
  },
  {
    "title": "Rubio Snaps At Fox News Host After She Calls Him Out For 'No Ceasefire' In Ukraine",
    "description": "Secretary of State Marco Rubio struggled to explain why there had been \"no ceasefire\" between Russia and Ukraine after President Donald Trump's meeting with Russian President Vladimir Putin.\n\n\nFox News host Maria Bartiromo pressed Rubio on the outcome of the …",
    "link": "https://crooksandliars.com/2025/08/rubio-snaps-fox-news-host-after-she-calls",
    "timestamp": "2025-08-17T21:16:15Z"
  },
  {
    "title": "European leaders to join Ukraine's Zelenskyy for meeting with Trump",
    "description": "European and NATO leaders announced Sunday they will join President Volodymyr Zelenskyy in Washington for talks with President Donald Trump on ending Russia’s war in Ukraine, with the possibility of U.S. security guarantees now on the negotiating table. Europ…",
    "link": "https://japantoday.com/category/world/european-leaders-to-join-ukraine%27s-zelenskyy-for-white-house-meeting-with-trump",
    "timestamp": "2025-08-17T21:15:32Z"
  },
  {
    "title": "Putin wins Ukraine concessions in Alaska but did not get all he wanted",
    "description": "In a few short hours in Alaska, Vladimir Putin managed to convince Donald Trump that a Ukraine ceasefire was not the way to go, stave off U.S. sanctions, and spectacularly shatter years of Western attempts to isolate the Russian president. Outside Russia, Put…",
    "link": "https://japantoday.com/category/features/opinions/analysis-putin-wins-ukraine-concessions-in-alaska-but-did-not-get-all-he-wanted",
    "timestamp": "2025-08-17T21:09:19Z"
  },
  {
    "title": "Donald Trump's Mental Health Shows 'Classic Signs' Of Rapid Decline",
    "description": "Donald Trump's mental health shows 'classic signs' of dementia as he continues to display off-script behaviors, putting Americans at risk.",
    "link": "https://okmagazine.com/p/donald-trump-mental-health-worse-horror-disease/",
    "timestamp": "2025-08-17T21:06:15Z"
  },
  {
    "title": "Rubio issues thinly veiled warning to Ukraine",
    "description": "The conflict “is going to get worse” if Kiev does not agree to a peace deal with Moscow, the US Secretary of State has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623130-rubio-warns-ukraine-conflict-going-to-get-worse/",
    "timestamp": "2025-08-17T21:03:49Z"
  }
]