[
  {
    "title": "Lauren Boebert Accuses Black Lawmaker of Waving ‘Pimp Cane’ at Trump",
    "description": "Rep. Lauren Boebert suggested that the Black lawmaker who yelled at President Donald Trump during a joint address to Congress is a \"pimp.\" \nThe post Lauren Boebert Accuses Black Lawmaker of Waving ‘Pimp Cane’ at Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/lauren-boebert-accuses-black-lawmaker-of-waving-pimp-cane-at-trump/",
    "timestamp": "2025-03-07T23:20:03Z"
  },
  {
    "title": "SET demands reforms amid sell-off",
    "description": "<p>The Stock Exchange of Thailand (SET) has asked the Finance Ministry to issue a royal decree to enhance tax benefits for long-term investments and strengthen the Securities and Exchange Commission's (SEC) law enforcement powers in order to revive investor c…",
    "link": "https://www.bangkokpost.com/business/general/2975436/set-demands-reforms-amid-sell-off",
    "timestamp": "2025-03-07T23:18:00Z"
  },
  {
    "title": "SET demands reforms amid sell-off",
    "description": "<p>The Stock Exchange of Thailand (SET) has asked the Finance Ministry to issue a royal decree to enhance tax benefits for long-term investments and strengthen the Securities and Exchange Commission's (SEC) law enforcement powers in order to revive investor c…",
    "link": "https://www.bangkokpost.com/business/investment/2975436/set-demands-reforms-amid-sell-off",
    "timestamp": "2025-03-07T23:18:00Z"
  },
  {
    "title": "Here’s How Much the Guests at Trump’s Crypto Summit Donated to His Inauguration",
    "description": "The list of invitees at the White House crypto summit illustrates the tight link between Trump and new cohort of political donors.\nThe post Here’s How Much the Guests at Trump’s Crypto Summit Donated to His Inauguration appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/03/07/white-house-crypto-summit-trump-donors/",
    "timestamp": "2025-03-07T23:16:17Z"
  },
  {
    "title": "Samsung under spotlight as Trump questions South Korea's tariff policies",
    "description": "In his recent speech to Congress, US president Donald Trump claimed that South Korea's average tariff rate is four times that of the US, raising concerns that the Asian ally, with Samsung Electronics in particular, may become the next target of Trump's trade …",
    "link": "https://www.digitimes.com/news/a20250306PD238/samsung-tariff.html",
    "timestamp": "2025-03-07T23:16:10Z"
  },
  {
    "title": "Ms. Global: On International Women’s Day, What’s the Status of Women Worldwide?",
    "description": "International Women’s Day 2025 finds progress under threat. The global landscape for women’s rights is at a paradox: gains and rollbacks, resilience and repression, victories tempered by the suffocating weight of political inertia. Here's where the fight stan…",
    "link": "https://msmagazine.com/2025/03/07/ms-global-on-international-womens-day-whats-the-status-of-women-worldwide/",
    "timestamp": "2025-03-07T23:15:13Z"
  },
  {
    "title": "How A Tiny Federal Agency’s Lawsuit Could Provide The Smoking Gun Against DOGE",
    "description": "The U.S. African Development Foundation’s standoff with DOGE contradicts the Trump administration’s defenses of Elon Musk’s operation.",
    "link": "https://www.huffpost.com/entry/elon-musk-doge-african-development-foundation_n_67cb6408e4b056d451323cc3",
    "timestamp": "2025-03-07T23:15:09Z"
  },
  {
    "title": "Trump's rare minerals play rattles South Korea's semiconductor supply chain",
    "description": "US President Donald Trump has reportedly demanded a cut of Ukraine's mineral and natural resource revenues in exchange for military and economic aid, a proposal dubbed the \"US-Ukraine minerals deal.\" South Korea's tech industry is on edge, fearing potential d…",
    "link": "https://www.digitimes.com/news/a20250306PD220/supply-chain-ukraine-donald-trump-posco-military.html",
    "timestamp": "2025-03-07T23:14:13Z"
  },
  {
    "title": "Trump Organization sues Capital One bank over account closures after Jan. 6 Capitol riot",
    "description": "The Trump Organization sued Capital One in Florida on Friday for allegedly “unjustifiably” closing more than 300 of the company’s bank accounts on the heels of the Jan.",
    "link": "https://www.nbcnews.com/business/business-news/trump-organization-sues-capital-one-bank-account-closures-jan-6-capito-rcna195313",
    "timestamp": "2025-03-07T23:13:39Z"
  },
  {
    "title": "'Disgusting' Donald Trump speech moment as he spits on himself amid health fears - NewsBreak",
    "description": "A viral moment from Donald Trump's controversial Congress speech on Tuesday night left viewers \"disgusted\", as the US President appeared to spit on himself",
    "link": "https://www.newsbreak.com/share/3844918155182-disgusting-donald-trump-speech-moment-as-he-spits-on-himself-amid-health-fears?s=a2&amp;share_destination_id=MTU3Mzc3OTg2LTE3NDEzODkxNTYzODQ%3D&amp;pd=0AeLCcLK&amp;hl=en_US&amp;send_time=1741389156&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v3%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v4%2Cns_foryou_recall_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v2%2Cns_local_strategy_25q1_exp-v5",
    "timestamp": "2025-03-07T23:13:35Z"
  },
  {
    "title": "HHS said to have asked CDC to study vaccines and autism, despite robust evidence showing no link | CNN",
    "description": "The US Department of Health and Human Services asked the US Centers for Disease Control and Prevention to study vaccines and autism, a person familiar with the situation told CNN, despite strong evidence that vaccines do not cause autism.",
    "link": "https://www.cnn.com/2025/03/07/health/hhs-cdc-vaccines-autism/index.html",
    "timestamp": "2025-03-07T23:13:22Z"
  },
  {
    "title": "Texas governor requiring state employees return to office full-time: 'Present and engaged'",
    "description": "Texas Gov. Greg Abbott will require state employees to return to the office full-time and in person, five days a week. The move comes after President Donald Trump issued a similar mandate at the federal level.",
    "link": "https://www.foxnews.com/us/texas-governor-requiring-state-employees-return-office-full-time-present-engaged",
    "timestamp": "2025-03-07T23:12:22Z"
  },
  {
    "title": "Trump will lead task force preparing for 2026 World Cup",
    "description": "President Donald Trump created a task force Friday to prepare for the 2026 World Cup, which will bring the globe’s premier soccer tournament to North America at a time when Trump’s on-again-off-again tariffs have ratcheted up tensions across the continent",
    "link": "https://abcnews.go.com/US/wireStory/trump-lead-task-force-preparing-2026-world-cup-119574524",
    "timestamp": "2025-03-07T23:10:25Z"
  },
  {
    "title": "Report: Trump's State Department Revokes First Visa of Foreign Pro-Hamas Student",
    "description": "The Trump administration has reportedly revoked the visa of a student who protested in favor of Hamas, the Islamic terrorist organization which attacked Israel on October 7, 2023, according to Fox News.\nThe post Report: Trump’s State Department Revokes First …",
    "link": "https://www.breitbart.com/middle-east/2025/03/07/report-trumps-state-department-revokes-first-visa-of-foreign-pro-hamas-student/",
    "timestamp": "2025-03-07T23:10:01Z"
  },
  {
    "title": "Falcons' Kirk Cousins visits President Trump at White House",
    "description": "President Donald Trump and Atlanta Falcons quarterback Kirk Cousins met in the Oval Office at the White House Friday and posed for a photo to remember it.",
    "link": "https://www.foxnews.com/sports/falcons-kirk-cousins-visits-president-trump-white-house",
    "timestamp": "2025-03-07T23:09:14Z"
  },
  {
    "title": "Fewer than half of Americans sympathize with Israelis over Palestinians",
    "description": "Sympathy for Israelis has dropped in the past few years, as Israel has been led by a hardline right-wing government.",
    "link": "https://www.jpost.com/international/article-845170",
    "timestamp": "2025-03-07T23:08:02Z"
  },
  {
    "title": "Elon Musk's generous gesture towards cancer stricken DJ Daniel, 13, who became target of 'odious' MSNBC",
    "description": "Elon Musk has promised a young boy battling brain cancer a Cybertruck, after the youngster was honored by President Trump. Devarjaye 'DJ' Daniel, 13, was made an honorary member of the Secret Service on Tuesday night by President Donald Trump. Speaking with C…",
    "link": "https://freerepublic.com/focus/f-news/4302846/posts",
    "timestamp": "2025-03-07T23:07:27Z"
  },
  {
    "title": "Trump Reforms Force Closure of More NGOs Resettling Refugees Across U.S.",
    "description": "Another non-governmental organization, which contracted with the federal government to resettle refugees across American communities, is having to close its doors after President Donald Trump froze the government's refugee resettlement program.\nThe post Trump…",
    "link": "https://www.breitbart.com/politics/2025/03/07/trump-reforms-force-closure-of-more-ngos-resettling-refugees-across-u-s/",
    "timestamp": "2025-03-07T23:07:06Z"
  },
  {
    "title": "Coinbase CEO Armstrong Says He'll Hire 1,000 in U.S. as Crypto Tide Turns",
    "description": "Brian Armstrong said recent policy shifts warrant a renewed push in the U.S., and president's working group chief Hines said Trump is delivering on crypto promises.",
    "link": "https://www.coindesk.com/policy/2025/03/07/coinbase-ceo-armstrong-says-he-ll-hire-1-000-in-u-s-as-crypto-tide-turns",
    "timestamp": "2025-03-07T23:06:58Z"
  },
  {
    "title": "Trump to lead task force for 2026 World Cup",
    "description": "President Donald Trump created a task force Friday to prepare for the 2026 World Cup, which will bring the globe's premier soccer tournament to North America.",
    "link": "https://www.espn.com/soccer/story/_/id/44155171/president-donald-trump-task-force-2026-world-cup",
    "timestamp": "2025-03-07T23:06:45Z"
  },
  {
    "title": "As Republicans run from their constituents, Dems have a plan to go on offense",
    "description": "Rep. Ocasio-Cortez mocked Republicans over guidance advising them to avoid in-person town halls as Americans rage over President Donald Trump’s and Elon Musk’s haphazard and authoritarian power grab.",
    "link": "https://www.msnbc.com/top-stories/latest/aoc-town-halls-republicans-trump-musk-doge-rcna195411",
    "timestamp": "2025-03-07T23:06:43Z"
  },
  {
    "title": "Trump Plans to 'Rescind and Amend' IRS Crypto Tax Rules, Sign Stablecoin Bill By August",
    "description": "President Donald Trump detailed how the U.S. plans to assert crypto leadership leadership during a first-ever White House crypto summit.",
    "link": "https://decrypt.co/309172/trump-rescind-irs-crypto-rules-sign-stablecoin-bill",
    "timestamp": "2025-03-07T23:06:29Z"
  },
  {
    "title": "'They get along fantastically well': Trump denies Musk-Rubio clash at White House meeting",
    "description": "Trump says government cuts would continue but with a “scalpel” rather than a “hatchet”.",
    "link": "https://www.thejournal.ie/musk-rubio-6643434-Mar2025/",
    "timestamp": "2025-03-07T23:06:19Z"
  },
  {
    "title": "A Reddit moderation tool is flagging ‘Luigi’ as potentially violent content",
    "description": "Reddit’s automatic moderation tool is flagging the word “Luigi” as potentially violent — even when the content isn’t. Earlier this week, a moderator from r/popculture saw Reddit’s AutoModerator system flag a post about the video game Luigi’s Mansion 3 because…",
    "link": "https://www.theverge.com/news/626139/reddit-luigi-mangione-automod-tool",
    "timestamp": "2025-03-07T23:04:10Z"
  },
  {
    "title": "Elbows up: How Canadians are fighting back against Trump’s tariffs",
    "description": "Replacing Californian tomatoes with Italian tomatoes. Ohio-made pepperoni with meats produced in Ontario and Quebec. Coca Cola with sparkling water, sweetened with Canadian maple syrup.\nAt the end of January, as US President Donald Trump ramped up threats to …",
    "link": "https://biztoc.com/x/b19f24533343c515",
    "timestamp": "2025-03-07T23:02:49Z"
  },
  {
    "title": "Bill O'Reilly Reveals The Dark Future Trump Created For The Democratic Party",
    "description": "Bill O'Reilly Reveals The Dark Future Trump Created For The Democratic Party\n \nAuthored by The Vigilant Fox via modernity.news,\nBestselling political author Bill O’Reilly says Donald Trump has driven the Democratic Party to the edge of total collapse.\nOn Wedn…",
    "link": "https://biztoc.com/x/9235e3f932fe1248",
    "timestamp": "2025-03-07T23:02:36Z"
  },
  {
    "title": "Trump Administration Axes Two Food Safety Committees",
    "description": "The U.S. Department of Agriculture (USDA) has disbanded two food safety advisory committees, members told Reuters on Friday.\nThe move comes as President Donald Trump's administration pushes to streamline federal agencies and reduce costs. According to the con…",
    "link": "https://biztoc.com/x/25e2a778d9427784",
    "timestamp": "2025-03-07T23:02:35Z"
  },
  {
    "title": "Stock market today: Wall Street ends its wild week with what else but more swings",
    "description": "Wall Street rose on Friday, but only after careening through another wild day. It was a fitting ending to a brutal week of scary swings dominated by worries about the U.S. economy and uncertainty about what President Donald Trump will do with tariffs.\nThe S&P…",
    "link": "https://biztoc.com/x/6ac6a5651d4ccfe0",
    "timestamp": "2025-03-07T23:02:29Z"
  },
  {
    "title": "A volatile week for Trump on the economy: From the Politics Desk",
    "description": "It’s been a volatile week for President Donald Trump’s economic and trade policies, with twists and turns on tariffs dominating the headlines — and raising new questions about how voters will react.",
    "link": "https://www.nbcnews.com/politics/politics-news/volatile-week-trump-economy-politics-desk-rcna195419",
    "timestamp": "2025-03-07T23:01:35Z"
  },
  {
    "title": "“Incendiary device” found in arson at northern Colorado Tesla store, police say",
    "description": "Similar cases of arson and vandalism have been reported at Tesla stores across the country.",
    "link": "https://www.denverpost.com/2025/03/07/tesla-arson-colorado-elon-musk-loveland/",
    "timestamp": "2025-03-07T23:01:20Z"
  },
  {
    "title": "Trump threatens reciprocal tariffs on lumber, dairy from Canada (Voice of America)",
    "description": "Voice of America:\nTrump threatens reciprocal tariffs on lumber, dairy from Canada  —  U.S. President Donald Trump said Friday that Canada has been “ripping off” the United States for years with tariffs on lumber and dairy products and threatened to place reci…",
    "link": "https://www.memeorandum.com/250307/p115",
    "timestamp": "2025-03-07T23:00:38Z"
  },
  {
    "title": "Trump Administration Axes Two Food Safety Committees",
    "description": "The move comes as President Donald Trump's administration pushes to streamline federal agencies and reduce costs.",
    "link": "https://www.newsweek.com/trump-administration-axes-two-food-safety-committees-2041546",
    "timestamp": "2025-03-07T22:59:03Z"
  },
  {
    "title": "Russia Rejects Ukraine Ceasefire, Launches Massive Bombing Campaign",
    "description": "Russia said a partial or temporary ceasefire in its war on Ukraine would be “unacceptable\" and launched a massive attack on infrastructure.\nThe post Russia Rejects Ukraine Ceasefire, Launches Massive Bombing Campaign appeared first on Breitbart.",
    "link": "https://www.breitbart.com/national-security/2025/03/07/russia-rejects-ukraine-ceasefire-launches-massive-bombing-campaign/",
    "timestamp": "2025-03-07T22:58:40Z"
  },
  {
    "title": "Marco Rubio pivots to America First diplomacy",
    "description": "It's been a little more than a week since Ukrainian President Volodymyr Zelenskyy met with President Donald Trump in the Oval Office. <br><br>Vice President JD Vance was in the meeting too. And Secretary of State Marco Rubio, the nation's top diplomat, sat on…",
    "link": "https://www.npr.org/2025/03/07/1236538087/marco-rubio-pivots-to-america-first-diplomacy",
    "timestamp": "2025-03-07T22:58:30Z"
  },
  {
    "title": "Federal judge rejects DPS’s request to block immigration enforcement at schools",
    "description": "DPS is believed to be the first school district in the nation to sue the Trump administration over the end of a policy that largely prevented federal agents from making immigration arrests at schools.",
    "link": "https://www.denverpost.com/2025/03/07/denver-public-schools-injunction-ice-raids-homeland-security/",
    "timestamp": "2025-03-07T22:57:51Z"
  },
  {
    "title": "Trump Threatens Russia With Sanctions Over Recent Ukraine Attack",
    "description": "But the U.S. president stopped short of denouncing Moscow’s large-scale attack on Ukraine’s energy infrastructure.",
    "link": "http://foreignpolicy.com/2025/03/07/trump-threatens-russia-sanctions-putin-zelensky-ukraine-nuclear-deal-iran/",
    "timestamp": "2025-03-07T22:57:39Z"
  },
  {
    "title": "Trump Threatens to Sanction Moscow",
    "description": "But the U.S. president stopped short of denouncing Russia’s large-scale attack on Ukraine’s energy infrastructure.",
    "link": "http://foreignpolicy.com/2025/03/07/trump-threatens-russia-sanctions-putin-zelensky-ukraine/",
    "timestamp": "2025-03-07T22:57:34Z"
  },
  {
    "title": "Trump tells crypto leaders at White House summit he's committed to helping their industry",
    "description": "President Donald Trump said Friday that he’s committed to making the U.S. a world leader in cryptocurrencies as industry leaders heaped praise on him for reversing what they said had been unfair attacks on digital assets by the previous administration. The fi…",
    "link": "https://www.seattlepi.com/news/politics/article/trump-tells-crypto-leaders-at-white-house-summit-20209380.php",
    "timestamp": "2025-03-07T22:57:26Z"
  },
  {
    "title": "‘What the actual?’ Outrage over Trump’s new 250% dairy tax spills into social media",
    "description": "The United States’ ongoing trade war with Canada showed no signs of slowing Friday as President Donald Trump threatened to slap a new 250% tariff on U.S. dairy imports arriving into the country.In an escalation a day after the president announced a one-month …",
    "link": "https://www.rawstory.com/trump-tariffs-2671289068/",
    "timestamp": "2025-03-07T22:57:05Z"
  },
  {
    "title": "Trump team hits pause on tariffs - but still sees them as vital tool",
    "description": "The White House sees levies as a means to reshape America's relationship with its global partners.",
    "link": "https://www.bbc.com/news/articles/c4gmjmymg0no?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-03-07T22:56:58Z"
  },
  {
    "title": "Trump team hits pause on tariffs - but still sees them as vital tool",
    "description": "The White House sees levies as a means to reshape America's relationship with its global partners.",
    "link": "https://www.bbc.com/news/articles/c4gmjmymg0no",
    "timestamp": "2025-03-07T22:54:54Z"
  },
  {
    "title": "Paramount Global Seeks to Dismiss Donald Trump’s $20 Billion Lawsuit",
    "description": "CBS News' parent company, Paramount Global, has filed a pair of motions seeking to dismiss President Donald Trump's $20 billion lawsuit against the news organization. The president filed the lawsuit in October 2024 accusing CBS News of aligning itself with \"p…",
    "link": "https://www.adweek.com/tvnewser/paramount-global-dismiss-trump-lawsuit-cbs-news/",
    "timestamp": "2025-03-07T22:53:08Z"
  },
  {
    "title": "Thousands “Stand Up for Science” Across the Country",
    "description": "On Friday, protesters gathered in Washington, DC, and at more than 30 satellite protests nationwide in what appears to be the largest pro-science demonstration of President Donald Trump’s second term. The “Stand Up for Science” rally, led by a small team of s…",
    "link": "https://www.motherjones.com/politics/2025/03/stand-up-for-science-dc-trump-doge-cuts-climate-nobel-laureates-nih-march/",
    "timestamp": "2025-03-07T22:52:21Z"
  },
  {
    "title": "How Donald Trump helped save Canada’s Liberals",
    "description": "Canada's Prime Minister Justin Trudeau looks on during a press conference while responding to U.S. President Donald Trump's orders to impose 25% tariffs on Canadian imports, in Ottawa, Ontario, Canada February 1, 2025.",
    "link": "https://biztoc.com/x/7210dea72fd50437",
    "timestamp": "2025-03-07T22:51:45Z"
  },
  {
    "title": "Donald Trump tells crypto leaders at White House summit he’s committed to helping their industry",
    "description": "President Donald Trump said Friday he’s committed to making the U.S. a world leader in cryptocurrencies as industry leaders heaped praise on him for reversing what they said had been unfair attacks on digital assets by the previous administration.\n“I thought …",
    "link": "https://biztoc.com/x/06cd8932edcb9e3b",
    "timestamp": "2025-03-07T22:51:28Z"
  },
  {
    "title": "Trump Mass Firing of Federal Workers Is a Very Local Issue, Warns Watchdog",
    "description": "While mass layoffs of federal workers and draconian cost-cutting by Elon Musk's Department of Government Efficiency may seem like a distant issue to many Americans, a leading influence-monitoring watchdog warned Thursday that the Trump administration's sweepi…",
    "link": "https://www.commondreams.org/news/trump-musk-mass-firings",
    "timestamp": "2025-03-07T22:51:26Z"
  },
  {
    "title": "Trump Creates Task Force for 2026 FIFA World Cup, Plans to Attend Matches",
    "description": "WASHINGTON – President Donald Trump on Friday created a task force for the FIFA World Cup, the world's most revered soccer competition, which will be held in the United States, Canada, and Mexico in 2026.\nThe post Trump Creates Task Force for 2026 FIFA World …",
    "link": "https://www.breitbart.com/politics/2025/03/07/trump-creates-task-force-for-2026-fifa-world-cup-plans-to-attend-matches/",
    "timestamp": "2025-03-07T22:51:00Z"
  },
  {
    "title": "Rep. Terri Sewell Introduces The ‘John R. Lewis Voting Rights Advancement Act’ Ahead Of Bloody Sunday Anniversary",
    "description": "It’s March 7, which means it’s the 60th anniversary of Bloody Sunday and the legendary freedom march from Selma, Alabama, to Montgomery. And since, under the current presidential administration, every single day is a day to wonder which civil rights protectio…",
    "link": "http://bossip.com/2799743/rep-terri-sewell-bloody-sunday-anniversary/",
    "timestamp": "2025-03-07T22:50:58Z"
  },
  {
    "title": "Saudi Diplomat: Trump Leading ‘New World Order’ of Peace and Cooperation",
    "description": "King Salman bin Abdulaziz expressed strong support for the President's efforts to create a “new world order” based on coexistence and cooperation.\nThe post Saudi Diplomat: Trump Leading ‘New World Order’ of Peace and Cooperation appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/07/judicial-watch-sues-for-intel-agencies-records-on-tim-walzs-relationship-with-china-2/",
    "timestamp": "2025-03-07T22:48:23Z"
  },
  {
    "title": "Hunter Biden Left Homeless After LA Fires, Millions in Debt as He Seeks to Drop Laptop Lawsuit",
    "description": "Hunter Biden, citing millions in debt and homelessness after a wildfire, is seeking to drop his lawsuit against a former Trump aide over leaked laptop emails.",
    "link": "https://www.ibtimes.com/hunter-biden-left-homeless-after-la-fires-millions-debt-he-seeks-drop-laptop-lawsuit-3765583",
    "timestamp": "2025-03-07T22:47:26Z"
  },
  {
    "title": "Disney did something it hasn't done in nearly 30 years — it will delight Christian parents and drive liberals crazy",
    "description": "Disney did something it hasn't done in nearly 30 years — it will delight Christian parents and drive liberals crazytheblaze.com",
    "link": "https://www.theblaze.com/align/win-or-lose-show-controversy-christian-prayer",
    "timestamp": "2025-03-07T22:46:41Z"
  },
  {
    "title": "Trump Threatens New 250 Percent Tariff on Canada",
    "description": "President Donald Trump threatened to slap a new 250% reciprocal tariff on Canadian lumber and dairy products, perhaps as soon as Friday, one day after pausing a 25% tariff on other Canadian goods.Trump made the comments to reporters in the Oval Office on Frid…",
    "link": "https://freerepublic.com/focus/f-news/4302844/posts",
    "timestamp": "2025-03-07T22:46:31Z"
  },
  {
    "title": "Freedom Caucus in Wyoming claims victory with approval of most priorities",
    "description": "Freedom Caucus leaders in the Wyoming House of Representatives are claiming victory after a legislative session in which most of their priorities got passed",
    "link": "https://abcnews.go.com/Politics/wireStory/freedom-caucus-wyoming-claims-victory-approval-priorities-119573505",
    "timestamp": "2025-03-07T22:46:27Z"
  },
  {
    "title": "Trump tells crypto leaders at White House summit he's committed to helping their industry",
    "description": "President Donald Trump said Friday that he’s committed to making the U.S. a world leader in cryptocurrencies as industry leaders heaped praise on him for reversing what they said had been unfair attacks on digital assets by the previous administration",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-tells-crypto-leaders-white-house-summit-committed-119574249",
    "timestamp": "2025-03-07T22:46:22Z"
  },
  {
    "title": "Trump Keeps Pressure on Ukraine as Putin Seen Open to Ceasefire",
    "description": "Donald Trump kept up the pressure on Ukraine to move ahead with a peace deal as signals emerged that the Kremlin would be willing to accept a temporary truce under certain conditions.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-keeps-pressure-on-ukraine-as-putin-seen-open-to-ceasefire",
    "timestamp": "2025-03-07T22:44:05Z"
  },
  {
    "title": "Trump Is Offering Putin Another Munich",
    "description": "Hitler didn’t want a peace deal, and neither does Putin.",
    "link": "https://www.theatlantic.com/international/archive/2025/03/putin-hitler-munich-parallel/681973/",
    "timestamp": "2025-03-07T22:43:54Z"
  },
  {
    "title": "'Disgusting' Donald Trump speech moment as he spits on himself amid health fears - NewsBreak",
    "description": "A viral moment from Donald Trump's controversial Congress speech on Tuesday night left viewers \"disgusted\", as the US President appeared to spit on himself",
    "link": "https://www.newsbreak.com/share/3844918155182-disgusting-donald-trump-speech-moment-as-he-spits-on-himself-amid-health-fears?s=a2&amp;share_destination_id=MjA1MDI5NTA0LTE3NDEzODczMzQyODQ%3D&amp;pd=0DsHXUA8&amp;hl=en_US&amp;send_time=1741387334&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.10.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v1%2Cns_local_strategy_25q1_exp-v3%2Cns_foryou_blend_exp_25q1-control%2Cns_foryou_rank_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v4",
    "timestamp": "2025-03-07T22:43:19Z"
  },
  {
    "title": "Elon Musk, Marco Rubio Clash In Cabinet Meeting Over Staff Cuts: Report",
    "description": "U.S. Secretary of State Marco Rubio and billionaire White House adviser Elon Musk clashed on Thursday during a Cabinet meeting, as President Donald Trump watched, over the level of staff cuts that Rubio has carried out, the New York Times reported.",
    "link": "https://www.ndtv.com/world-news/elon-musk-marco-rubio-clash-in-trump-cabinet-meeting-over-staff-cuts-report-7874116",
    "timestamp": "2025-03-07T22:42:02Z"
  },
  {
    "title": "A single day of Trump and Musk’s cost-cutting campaign remakes huge sections of government",
    "description": "Some changes appeared designed to increase political control over historically autonomous agencies.",
    "link": "https://www.bostonherald.com/2025/03/07/trump-doge-epa/",
    "timestamp": "2025-03-07T22:41:10Z"
  },
  {
    "title": "Trump tells crypto leaders at White House summit he’s committed to helping their industry",
    "description": "Trump reiterated his eagerness to help with friendly legislation and light-touch regulations.",
    "link": "https://www.bostonherald.com/2025/03/07/trump-crypto-summit/",
    "timestamp": "2025-03-07T22:40:32Z"
  },
  {
    "title": "'Disgusting' Donald Trump speech moment as he spits on himself amid health fears - NewsBreak",
    "description": "A viral moment from Donald Trump's controversial Congress speech on Tuesday night left viewers \"disgusted\", as the US President appeared to spit on himself",
    "link": "https://www.newsbreak.com/share/3844918155182-disgusting-donald-trump-speech-moment-as-he-spits-on-himself-amid-health-fears?s=a2&amp;share_destination_id=MTkwMDE2MzI3LTE3NDEzODcwODMwNTQ%3D&amp;pd=0CrHvTAd&amp;hl=en_US&amp;send_time=1741387083&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.45.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v6%2Cns_local_strategy_25q1_exp-holdback",
    "timestamp": "2025-03-07T22:38:32Z"
  },
  {
    "title": "Trump Agenda May Lead to Buyer’s Remorse Among His Voters",
    "description": "Hispanics being hassled by ICE, seniors depending on Social Security, and Catholics siding with their bishops may feel betrayed after backing Trump and then realizing they aren’t exempt from the consequences.",
    "link": "http://nymag.com/intelligencer/article/trump-agenda-may-lead-to-buyers-remorse-among-his-voters.html",
    "timestamp": "2025-03-07T22:35:00Z"
  },
  {
    "title": "The Supreme Court showed it isn't entirely on board with Trump's plans",
    "description": "By a narrow 5-4 vote, the Supreme Court pushed back against President Donald Trump's agenda when it declined to reverse a judge's order.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-supreme-court-eric-adams-deadline-newsletter-rcna195305",
    "timestamp": "2025-03-07T22:34:50Z"
  },
  {
    "title": "Is DOGE Losing Steam?",
    "description": "The Department of Government Efficiency lives. But Donald Trump is reining in Elon Musk.",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/trump-musk-power-restraints/681974/",
    "timestamp": "2025-03-07T22:33:29Z"
  },
  {
    "title": "How Donald Trump helped save Canada’s Liberals",
    "description": "Most Americans are familiar with Canada, a country to America’s north that loves hockey, maple syrup and mispronouncing the word “about.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariffs-canada-trudeau-elections-rcna195338",
    "timestamp": "2025-03-07T22:33:23Z"
  },
  {
    "title": "Trump may give TikTok another reprieve. Will a deal ever get done?",
    "description": "The U.S. government's effort to force either a ban or divestiture of TikTok has hit another snag, and more delays are on the horizon. After talks between the White House and Chinese authorities stalled, President Donald Trump indicated that he will \"probably\"…",
    "link": "https://www.tubefilter.com/2025/03/07/donald-trump-tiktok-ban-divest-deal-extension/",
    "timestamp": "2025-03-07T22:33:06Z"
  },
  {
    "title": "Canada, Mexico trade war makes 2026 World Cup 'exciting': Trump",
    "description": "US President Donald Trump said Friday that trade tensions with Mexico and Canada would be a boost for the 2026 World Cup as he announced the creation of a White House task force to help organize the tournament.Speaking to reporters in the Oval Office alongsid…",
    "link": "https://www.rawstory.com/canada-tariffs-2671289157/",
    "timestamp": "2025-03-07T22:33:03Z"
  },
  {
    "title": "Tiger Woods not among $25 million Players Championship field at TPC Sawgrass",
    "description": "Tiger Woods has decided not to play at The Players Championship, the tournament he has won twice.",
    "link": "https://www.sbnation.com/golf/2025/3/7/24380366/tiger-woods-not-among-players-championship-field",
    "timestamp": "2025-03-07T22:32:50Z"
  },
  {
    "title": "Exclusive — Scott Presler on Wisconsin Supreme Court Race: ‘If Wisconsinites Don’t Pay Attention, History is Going to Repeat Itself’",
    "description": "Democrats view the Wisconsin Supreme Court election as a chance to push policy and redraw legislative maps that could ultimately lose Republicans two U.S. House seats and help Democrats close in on the Republicans' slim majority. \nThe post Exclusive — Scott P…",
    "link": "https://www.breitbart.com/politics/2025/03/07/exclusive-scott-presler-wisconsin-supreme-court-race-if-wisconsinites-dont-pay-attention-history-going-repeat-itself/",
    "timestamp": "2025-03-07T22:32:13Z"
  },
  {
    "title": "ABC Shuts Down Pro-Leftist Polling Site That Claimed Harris Had Better Chance Than Trump",
    "description": "ABC News' shutdown of FiveThirtyEight shows leftist pollsters are losing their grip on the public narrative.",
    "link": "https://thefederalist.com/2025/03/07/abc-shuts-down-pro-leftist-polling-site-that-claimed-harris-had-better-chance-than-trump/",
    "timestamp": "2025-03-07T22:31:39Z"
  },
  {
    "title": "DC Clears Homeless Encampment Near State Dept. Following Trump's Cleanup Call",
    "description": "Washington, D.C., authorities cleared a homeless encampment near the State Department on Friday, following President Donald Trump's call for a citywide cleanup.\nThe post DC Clears Homeless Encampment Near State Dept. Following Trump's Cleanup Call appeared fi…",
    "link": "https://freebeacon.com/latest-news/dc-clears-homeless-encampment-near-state-dept-following-trumps-cleanup-call/",
    "timestamp": "2025-03-07T22:30:54Z"
  },
  {
    "title": "Freedom Caucus in Wyoming claims victory with approval of most priorities",
    "description": "Freedom Caucus leaders in the Wyoming House of Representatives are claiming victory after a legislative session in which most of their priorities got passed",
    "link": "https://abcnews.go.com/US/wireStory/freedom-caucus-wyoming-claims-victory-approval-priorities-119573503",
    "timestamp": "2025-03-07T22:30:33Z"
  },
  {
    "title": "Here’s How The US Could Buy Bitcoin In A ‘Budget-Neutral’ Way: Experts",
    "description": "US President Donald Trump has signed an Executive Order creating a Strategic Bitcoin Reserve (SBR)—a first-of-its-kind program to hold BTC as part of the federal government’s assets. According to the Order, the Reserve will be funded by Bitcoin already in gov…",
    "link": "https://bitcoinist.com/how-us-could-buy-bitcoin-budget-neutral/",
    "timestamp": "2025-03-07T22:30:30Z"
  },
  {
    "title": "Schapiro: In Virginia, Dems party like it's 2017",
    "description": "If 2025 feels a lot like 2017 — with Trump upending Washington and Virginians furious about it — then 2026 could feel a lot like 2014, when chaos over federal spending forced a contraction in state spending.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_f6f6b67e-fb6d-11ef-9d23-bfc8646591d4.html",
    "timestamp": "2025-03-07T22:30:00Z"
  },
  {
    "title": "Trump weighs new sanctions on Russia, days after pausing military aid with Ukraine",
    "description": "President Donald Trump said Friday he is “strongly considering” levying new sanctions and tariffs on Russia for its war against Ukraine.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_17c812a5-8321-56c3-81a4-ac9a5d0bc252.html",
    "timestamp": "2025-03-07T22:30:00Z"
  },
  {
    "title": "Trump weighs new sanctions on Russia, days after pausing military aid with Ukraine",
    "description": "President Donald Trump said Friday he is “strongly considering” levying new sanctions and tariffs on Russia for its war against Ukraine.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_02479081-24ce-58b8-a111-fe1b2ecfd894.html",
    "timestamp": "2025-03-07T22:30:00Z"
  },
  {
    "title": "Why Spending Cuts Will Hurt The Economy - And The GOP Base Most",
    "description": "Medicaid and SNAP are two of the most effective anti-poverty programs in the United States.",
    "link": "https://www.forbes.com/sites/aishanyandoro/2025/03/07/why-spending-cuts-will-hurt-the-economyand-the-gop-base-most/",
    "timestamp": "2025-03-07T22:29:40Z"
  },
  {
    "title": "Kamala Harris Gives Update on Her Political Future: Report",
    "description": "Former Vice President Kamala Harris is reportedly weighing a potential run for California governor against a possible third bid for the White House in 2028, according to a Politico report published Friday morning.\nWhy It Matters\nHarris lost to President Donal…",
    "link": "https://biztoc.com/x/b687d06b74f05a36",
    "timestamp": "2025-03-07T22:29:19Z"
  },
  {
    "title": "Trump threatens reciprocal tariffs on lumber, dairy from Canada",
    "description": "U.S. President Donald Trump said Friday that Canada has been \"ripping off\" the United States for years with tariffs on lumber and dairy products and threatened to place reciprocal tariffs on Canada as early as Friday. \n\n\nSpeaking to reporters in the Oval Offi…",
    "link": "https://www.voanews.com/a/trump-threatens-reciprocal-tariffs-on-lumber-dairy-from-canada/8003064.html",
    "timestamp": "2025-03-07T22:29:12Z"
  },
  {
    "title": "The art of the deal",
    "description": "Despite everything I can never quite get over what a complete moron this guy is: U.S. President Donald Trump complained Thursday that his country’s decades-old security treaty with Japan is nonreciprocal, as he steps up pressure on allies to increase defense …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/the-art-of-the-deal-2",
    "timestamp": "2025-03-07T22:27:46Z"
  },
  {
    "title": "Trump Flips Out When Asked About Testy Musk and Rubio Clash",
    "description": "While speaking to the press in the Oval Office Friday, Donald Trump got upset when a reporter asked him about “clashes” between Elon Musk and members of his Cabinet, including Secretary of State Marco Rubio, during a Thursday meeting.  \r\n“No clash, I was ther…",
    "link": "https://newrepublic.com/post/192506/trump-reaction-musk-rubio-fight-cabinet-meeting",
    "timestamp": "2025-03-07T22:27:12Z"
  },
  {
    "title": "Trump cuts $400 mn from Columbia University over anti-Semitism claims",
    "description": "by Gregory WALTONPresident Donald Trump's administration said Friday it was cutting $400 million in federal grants to Columbia University, accusing it of failing to protect Jewish students from harassment as protesters rallied against Israel's offensive in Ga…",
    "link": "https://www.rawstory.com/columbia-university/",
    "timestamp": "2025-03-07T22:26:37Z"
  },
  {
    "title": "Donald Trump's Support Among Swing Voters Eroding—Data",
    "description": "Swing voters' sentiment toward Trump has declined due largely to foreign policy concerns, according to Impact Social.",
    "link": "https://www.newsweek.com/donald-trumps-support-among-swing-voters-erodingdata-2041507",
    "timestamp": "2025-03-07T22:26:28Z"
  },
  {
    "title": "Kamala Harris Gives Update on Her Political Future: Report",
    "description": "The former vice president is reportedly weighing multiple options concerning potential future runs for office.",
    "link": "https://www.newsweek.com/kamala-harris-gives-update-her-political-future-report-2041524",
    "timestamp": "2025-03-07T22:25:39Z"
  },
  {
    "title": "Feds announce a $6.5 billion aid package for businesses harmed by trade war",
    "description": "Ottawa's new Trade Impact Program earmarks $5 billion over the next two years to help businesses cope with decreased U.S. sales and reach new global markets.",
    "link": "https://www.nationalobserver.com/2025/03/07/news/feds-65-billion-aid-package-businesses-trade-war",
    "timestamp": "2025-03-07T22:24:42Z"
  },
  {
    "title": "Former GOP firebrand governor eyeing run for Congress in key swing district",
    "description": "Paul LePage, the former governor of Maine, is mulling a Republican run for Congress in the 2026 midterm elections in a key swing district.",
    "link": "https://www.foxnews.com/politics/former-gop-firebrand-governor-eying-run-congress-key-swing-district",
    "timestamp": "2025-03-07T22:23:21Z"
  },
  {
    "title": "DOJ, HHS, GSA, DOE Cancel $400 Million in Grants, Contracts to Columbia University",
    "description": "The Trump administration announced that it had cancelled roughly $400 million worth of grants and contracts to Columbia University, citing how the university \"has abandoned\" the obligation to \"comply with all federal antidiscrimination laws\" in order to recei…",
    "link": "https://www.breitbart.com/politics/2025/03/07/doj-hhs-gsa-doe-cancel-400-million-in-grants-contracts-to-columbia-university/",
    "timestamp": "2025-03-07T22:22:21Z"
  },
  {
    "title": "US foreign aid orgs say they are owed more than $671 million by Monday deadline",
    "description": "U.S. foreign aid organizations suing President Donald Trump's administration over its freeze of nearly all foreign aid spending said on Friday that they are owed more than $671 million for past work that a court has ordered be paid by a Monday deadline. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/03/08/us-foreign-aid-orgs-say-they-are-owed-more-than-671-million-by-monday-deadline",
    "timestamp": "2025-03-07T22:22:00Z"
  },
  {
    "title": "AWW! Maga Hella Mad As 'Hamilton' Cancels Kennedy Center",
    "description": "The creators of “Hamilton” refuse to let their hit musical be performed next year at the Kennedy Center, where a now-canceled 8-week run was slated to help celebrate the 250th anniversary of the signing of the Declaration of Independence—and this snub has MAG…",
    "link": "https://crooksandliars.com/2025/03/aww-maga-hella-mad-hamilton-cancels",
    "timestamp": "2025-03-07T22:20:38Z"
  },
  {
    "title": "More Like This, Please: Tiny Agency Blocks DOGE Invaders",
    "description": "A small independent international aid agency on Thursday was waiting to see whether staffers from billionaire mogul Elon Musk's government advisory body would return to fire more than two dozen employees, after a standoff took place Wednesday when Musk's asso…",
    "link": "https://crooksandliars.com/2025/03/more-please-tiny-agency-blocks-doge",
    "timestamp": "2025-03-07T22:20:30Z"
  },
  {
    "title": "Trump signs executive order establishing a strategic bitcoin reserve",
    "description": "President Donald Trump signed an executive order on Thursday creating a strategic bitcoin reserve, marking a major shift in U.S. ...",
    "link": "https://biztoc.com/x/8cd52616ffb6f402",
    "timestamp": "2025-03-07T22:18:44Z"
  },
  {
    "title": "Trump Says Musk and Rubio Get Along Well",
    "description": "President Donald Trump tells reporters in the Oval Office that there was no clash between Elon Musk and US Secretary of State ...",
    "link": "https://biztoc.com/x/8648b4ea4b8a1966",
    "timestamp": "2025-03-07T22:18:41Z"
  },
  {
    "title": "Three Latino Reps. Led Trump To Revoke Chevron's Venezuela Oil License: 'They're Going Crazy'",
    "description": "Reps. Mario Diaz-Balart, Carlos Gimenez and Maria Elvira Salazar suggested they could withhold their votes for the budget deal narrowly passed in the House",
    "link": "https://www.ibtimes.com/three-latino-reps-led-trump-revoke-chevrons-venezuela-oil-license-theyre-going-crazy-3765569",
    "timestamp": "2025-03-07T22:18:33Z"
  },
  {
    "title": "CK Hutchison Is Selling Panama Canal Ports To BlackRock As Part Of A $23 Billion Deal",
    "description": "The deal comes after U.S. President Donald Trump repeatedly threatened to take control of the Panama Canal and end what he ...",
    "link": "https://biztoc.com/x/b37d2b554d7faa76",
    "timestamp": "2025-03-07T22:18:29Z"
  },
  {
    "title": "Trump creates White House task force for the 2026 World Cup",
    "description": "President Donald Trump established a White House Task Force for the 2026 World Cup on Friday by signing an executive order alongside Gianni Infantino, the president of FIFA.",
    "link": "https://www.nbcnews.com/sports/soccer/trump-creates-white-house-task-force-2026-world-cup-rcna195409",
    "timestamp": "2025-03-07T22:18:26Z"
  },
  {
    "title": "Aileen Cannon Questions Lawyers' Gun 'Theory' in Trump Case",
    "description": "Judge Aileen Cannon is questioning a defense \"theory\" concerning a gun tied to last year's second alleged assignation attempt on then-former President Donald Trump.\nNewsweek reached out for comment to attorneys representing defendant Ryan Routh via email on F…",
    "link": "https://biztoc.com/x/f9e76844da32ab94",
    "timestamp": "2025-03-07T22:17:51Z"
  }
]