[
  {
    "title": "Jim Cramer: Trump may be exciting, but can listening to him make you money?",
    "description": "The conundrum of President Donald Trump is one I try to stay away from. Not because I don't want to go there, but because it hasn't been all that lucrative to do so. Because of the president's sheer, endless presence in the media, and his love of CEOS — to ha…",
    "link": "https://biztoc.com/x/aecf4562126f0071",
    "timestamp": "2025-09-07T22:46:28Z"
  },
  {
    "title": "Trump walks back Chicago 'war' threat, but vows to 'clean up' cities",
    "description": "Trump posted online that Chicago was \"about to find out why it's called the Department of WAR,\" but later said his administration wouldn't go to war with American cities but rather \"clean them up.\"",
    "link": "https://www.npr.org/2025/09/07/nx-s1-5533191/trump-chicago-threat-baltimore-new-orleans",
    "timestamp": "2025-09-07T22:41:43Z"
  },
  {
    "title": "White House's review of Smithsonian content could reach into classrooms nationwide",
    "description": "Some history teachers are concerned about what may come of a White House review of the Smithsonian's public-facing content",
    "link": "https://www.wsbtv.com/news/politics/white-houses-review/C2FNGPFMH5H3TFUJEPWAO5X4H4/",
    "timestamp": "2025-09-07T22:41:09Z"
  },
  {
    "title": "Nobel economist warns 'sheer ignorance' of Trump's last 'obsession' may hurt the economy​",
    "description": "A Nobel Prize-winning economist warned on Sunday that President Donald Trump's \"obsession\" with assuming control of the Federal Reserve could have significant impacts on the American economy. Paul Krugman, who won a Nobel Prize in 2008, argued in a new Substa…",
    "link": "https://www.rawstory.com/paul-krugman-2673968696/",
    "timestamp": "2025-09-07T22:40:05Z"
  },
  {
    "title": "Carlos Alcaraz beats rival Jannik Sinner at U.S. Open for 6th Grand Slam title",
    "description": "Sunday's showdown was the third Grand Slam tournament in a row where these elite, young rivals met to decide the champion.",
    "link": "https://www.pbs.org/newshour/world/carlos-alcaraz-beats-rival-jannik-sinner-at-u-s-open-for-6th-grand-slam-title",
    "timestamp": "2025-09-07T22:40:03Z"
  },
  {
    "title": "Trump family's wealth grew by $1.3B following ABTC and WLFI debuts: Report",
    "description": "The Trump family saw their collective net worth rise by as much as $1.3 billion this week after American Bitcoin and World Liberty Financial debuted trading.",
    "link": "https://cointelegraph.com/news/trump-family-wealth-grew-1-3b-abtc-wlfi",
    "timestamp": "2025-09-07T22:37:37Z"
  },
  {
    "title": "'Never seen anything like it' — what Trump's favorite phrase says about his presidency",
    "description": "",
    "link": "https://biztoc.com/x/871462b7a169e516",
    "timestamp": "2025-09-07T22:35:01Z"
  },
  {
    "title": "Newsom slams Trump allies for ‘cheersing Diet Cokes’ at Rose Garden as economy sinks",
    "description": "Gavin Newsom wrote on X that while the economy struggles, Republicans are busy 'cheersing Diet Cokes' at Donald Trump’s new Rose Garden Club",
    "link": "https://news.meaww.com/newsom-slams-trump-allies-for-cheersing-diet-cokes-at-rose-garden-as-economy-sinks",
    "timestamp": "2025-09-07T22:33:47Z"
  },
  {
    "title": "Alcaraz beats Sinner to lift US Open 2025 as Trump watches on",
    "description": "Alcaraz returns to number one spot after winning his sixth Grand Slam title and second of 2025 in four sets in New York.",
    "link": "https://www.aljazeera.com/sports/2025/9/7/alcaraz-beats-sinner-to-lift-us-open-2025-as-trump-watches-on",
    "timestamp": "2025-09-07T22:32:35Z"
  },
  {
    "title": "Oil prices climb as OPEC+ agrees to raise output at slower pace from October",
    "description": "TOKYO : Oil prices climbed on Monday in early trade, trimming some of last week's losses, after OPEC+ agreed over the weekend to raise output at a slower pace from October on expectations of weaker global demand. Brent crude gained 34 cents, or 0.5 per cent, …",
    "link": "https://www.channelnewsasia.com/business/oil-prices-climb-opec-agrees-raise-output-slower-pace-october-5337176",
    "timestamp": "2025-09-07T22:31:54Z"
  },
  {
    "title": "Trump's fiercest critics concede spotlight to president at US Open",
    "description": "President Donald Trump was the main attraction in the stands at the U.S. Open in New York City and some of his fiercest critics were also in attendance.",
    "link": "https://www.foxnews.com/sports/trumps-fiercest-critics-concede-spotlight-president-us-open",
    "timestamp": "2025-09-07T22:31:14Z"
  },
  {
    "title": "Trump Is Taking Credit for Infrastructure Projects Funded by Biden Legislation He Opposed (Peter Wade/Rolling Stone)",
    "description": "Peter Wade / Rolling Stone:\nTrump Is Taking Credit for Infrastructure Projects Funded by Biden Legislation He Opposed  —  The administration is putting up signs that say, “President Donald J. Trump” and “Rebuilding America's Infrastructure” at worksites funde…",
    "link": "https://www.memeorandum.com/250907/p68",
    "timestamp": "2025-09-07T22:25:00Z"
  },
  {
    "title": "New Zealand income growth one of the worst in the world",
    "description": "NZ ranks 25th out of 43 for GDP growth over past decade and 37th for the past two years.",
    "link": "https://www.nzherald.co.nz/business/new-zealand-income-growth-one-of-the-worst-in-the-world/KYYPZP4TBZETHBH5UQKGEZ4VLM/",
    "timestamp": "2025-09-07T22:19:51Z"
  },
  {
    "title": "Who’s in attendance for the US Open men’s final? From Trump’s MAGA entourage to Lindsay Lohan and Courteney Cox",
    "description": "Match between World No. 1 Jannik Sinner and Spain’s star player Carlos Alcaraz was delayed due to Trump’s attendance",
    "link": "https://www.the-independent.com/life-style/us-open-final-celebrities-who-attendance-b2821903.html",
    "timestamp": "2025-09-07T22:15:27Z"
  },
  {
    "title": "How vaccines changed the world and the public health challenges that persist",
    "description": "Vaccination campaigns have nearly eradicated some of the most deadly and transmissible diseases. However, against a backdrop of a rising tide of vaccine hesitancy, and U.S. leaders pulling global support, outbreaks are cropping up again.",
    "link": "https://www.cfr.org/backgrounder/how-vaccines-changed-world",
    "timestamp": "2025-09-07T22:12:40Z"
  },
  {
    "title": "Alcaraz beats Sinner in U.S. Open final for 6th Slam title and No. 1 ranking",
    "description": "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 victory Sunday in the U.S. Open final — the third Grand Slam tournament in a row where these elite, young rivals met to decide the champion — for his second trophy at Flush…",
    "link": "https://japantoday.com/category/sports/Alcaraz-beats-Sinner-in-U.S.-Open-final-for-6th-Slam-title-and-No.-1-ranking",
    "timestamp": "2025-09-07T22:12:21Z"
  },
  {
    "title": "Alcaraz Beats Sinner To Win US Open And Reclaim No.1 Ranking",
    "description": "Carlos Alcaraz beat Jannik Sinner in four sets on Sunday to win the US Open as loud boos -- mixed with a smattering of cheers -- greeted President Donald Trump at the final in New York.",
    "link": "https://www.ibtimes.com/alcaraz-beats-sinner-win-us-open-reclaim-no1-ranking-3782761",
    "timestamp": "2025-09-07T22:12:11Z"
  },
  {
    "title": "Trump Pushes US Nuclear Deals in UK Ahead of State Visit",
    "description": "MOSCOW (Sputnik) - Ahead of US President Donald Trump's state visit to the UK, the White House is lobbying for plans for US companies to build nuclear power plants (NPP) and data centers for artificial intelligence (AI) software in the UK, The Telegraph newsp…",
    "link": "https://sputnikglobe.com/20250907/trump-pushes-us-nuclear-deals-in-uk-ahead-of-state-visit-1122745826.html",
    "timestamp": "2025-09-07T22:11:00Z"
  },
  {
    "title": "Carlos Alcaraz beats Jannik Sinner to claim second US Open title",
    "description": "The Spaniard won four sets against Jannik Sinner to win his sixth grand slam title",
    "link": "https://www.irishtimes.com/sport/2025/09/07/carlos-alcaraz-beats-jannik-sinner-to-claim-second-us-open-title/",
    "timestamp": "2025-09-07T22:10:55Z"
  },
  {
    "title": "Alcaraz bests Sinner to win US Open, sixth Slam",
    "description": "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 win Sunday in the US Open final -- the third Grand Slam tournament in a row where these rivals met to decide the champion -- for his second title at Flushing Meadows.",
    "link": "https://www.espn.com/tennis/story/_/id/46190196/carlos-alcaraz-defeats-rival-jannik-sinner-us-open",
    "timestamp": "2025-09-07T22:10:41Z"
  },
  {
    "title": "Amy Coney Barrett Claims There’s Nothing Unprecedented About Trump’s ‘Conflicts’ With The Judiciary",
    "description": "Supreme Court Justice Amy Coney Barrett expressed a lack of concern over President Donald Trump and his combative stance toward the judicial branch.\nThe post Amy Coney Barrett Claims There’s Nothing Unprecedented About Trump’s ‘Conflicts’ With The Judiciary f…",
    "link": "https://www.mediaite.com/politics/amy-coney-barrett-claims-theres-nothing-unprecedented-about-trumps-conflicts-with-the-judiciary/",
    "timestamp": "2025-09-07T22:08:40Z"
  },
  {
    "title": "Trump's US Open visit sparks boos and long security lines",
    "description": "President Donald Trump attended the U.S. Open on Sunday, drawing boos from the crowd",
    "link": "https://abcnews.go.com/US/wireStory/trumps-us-open-visit-sparks-boos-long-security-125336602",
    "timestamp": "2025-09-07T22:08:10Z"
  },
  {
    "title": "WATCH: Scott Jennings says this household name is true leader of the Democrat Party, and is not even a Dem!",
    "description": "'The only thing they know how to do is be against whatever he is for'",
    "link": "https://www.wnd.com/2025/09/watch-scott-jennings-says-this-household-name-is/",
    "timestamp": "2025-09-07T22:06:35Z"
  },
  {
    "title": "Alcaraz beats Sinner to win US Open and reclaim Number 1 ranking",
    "description": "Loud boos — mixed with a smattering of cheers — greeted President Donald Trump at the event.",
    "link": "https://www.the42.ie/alcaraz-beats-sinner-to-win-us-open-and-reclaim-number-1-ranking-6810300-Sep2025/",
    "timestamp": "2025-09-07T22:02:34Z"
  },
  {
    "title": "Awesome Alcaraz sinks Sinner in US Open final",
    "description": "Carlos Alcaraz reclaimed the world number one ranking and supremacy in his rivalry with Jannik Sinner by dethroning the Italian to win a second US Open title.",
    "link": "https://www.rte.ie/sport/tennis/2025/0907/1532311-awesome-alcaraz-sinks-sinner-in-us-open-final/",
    "timestamp": "2025-09-07T22:01:27Z"
  },
  {
    "title": "Trump clashes with reporters after Chicago ‘war’ meme: ‘That’s not war, that’s common sense’",
    "description": "President Donald Trump posted a provocative 'Apocalypse Now; meme about Chicago deportations, sparking outrage from Illinois officials and a tense confrontation with NBC News.",
    "link": "https://www.foxnews.com/media/trump-clashes-reporters-after-chicago-war-meme-thats-not-war-thats-common-sense",
    "timestamp": "2025-09-07T22:00:02Z"
  },
  {
    "title": "Commentary: With global risks rising, Singapore’s government faces a more complex term",
    "description": "Amid global uncertainty, Singapore’s government must also ensure the success and well-being of every citizen, says former NMP Nicholas Fang.",
    "link": "https://www.channelnewsasia.com/commentary/singapore-parliament-president-tharman-government-global-uncertainties-5336741",
    "timestamp": "2025-09-07T22:00:00Z"
  },
  {
    "title": "Exclusive -- British Ambassador to U.S. Lord Peter Mandelson: ‘The King Is Going to Roll Out the Red Carpet for President Trump’ in State Visit",
    "description": "British Ambassador to the United States Lord Peter Mandelson told Breitbart News exclusively that the United Kingdom is very much looking forward to hosting U.S. President Donald Trump at Windsor Castle for a historic second state visit for Trump later this m…",
    "link": "https://www.breitbart.com/politics/2025/09/07/exclusive-british-ambassador-to-u-s-lord-peter-mandelson-the-king-is-going-to-roll-out-the-red-carpet-for-president-trump-in-state-visit/",
    "timestamp": "2025-09-07T21:59:24Z"
  },
  {
    "title": "Florida official: No need to study end of vax mandates",
    "description": "Florida Surgeon General Joseph Ladapo said there’s no need to do projections of the potential effects of ending vaccine mandates for children, as Governor Ron DeSantis pushes to make his state the first one to scrap immunization requirements.",
    "link": "https://www.bostonherald.com/2025/09/07/florida-official-no-need-to-study-end-of-vax-mandates/",
    "timestamp": "2025-09-07T21:56:50Z"
  },
  {
    "title": "'Total insanity': MAGA lashes out after Chris Christie jabs Trump's 'human middle finger'",
    "description": "Former New Jersey Governor Chris Christie faced significant backlash from MAGA on Sunday after he jabbed Health Secretary Robert F. Kennedy Jr. during a morning interview. Christie told ABC News' George Stephanopoulos on Sunday that the Health and Human Servi…",
    "link": "https://www.rawstory.com/trump-2673968659/",
    "timestamp": "2025-09-07T21:55:18Z"
  },
  {
    "title": "Trump receives mix of applause, boos during US Open appearance",
    "description": "President Donald Trump received a mix of applause and boos on Sunday as he arrived at the U.S. Open men's singles final between Jannik Sinner and Carlos Alcaraz.",
    "link": "https://www.foxnews.com/sports/trump-receives-mix-applause-boos-during-us-open-appearance",
    "timestamp": "2025-09-07T21:52:49Z"
  },
  {
    "title": "Alcaraz defeats Sinner to win US Open and reclaim world number one ranking",
    "description": "NEW YORK: Carlos Alcaraz beat Jannik Sinner in four sets on Sunday (Sep 7) to win the US Open and reclaim the world number one ranking, as loud boos, mixed with some cheers, greeted US President Donald Tr",
    "link": "https://www.channelnewsasia.com/world/alcaraz-defeats-sinner-win-us-open-and-reclaim-world-number-one-ranking-5337156",
    "timestamp": "2025-09-07T21:52:00Z"
  },
  {
    "title": "Sublime Alcaraz outshines Sinner to claim second US Open title",
    "description": "NEW YORK: Carlos Alcaraz ended the reign of Jannik Sinner with a 6-2 3-6 6-1 6-4 victory to claim the US Open title again on Sunday (Sep 7) and tighten his grip on the era-defining rivalry between the torch-bearers of the men's game.In a perfect echo of the t…",
    "link": "https://www.channelnewsasia.com/sport/alcaraz-defeats-sinner-win-us-open-and-reclaim-world-number-one-ranking-5337156",
    "timestamp": "2025-09-07T21:52:00Z"
  },
  {
    "title": "Russia launches biggest attack on Ukraine",
    "description": "Government buildings in Kyiv have been set ablaze after Russia's biggest aerial attack on Ukraine since the war began.",
    "link": "https://7news.com.au/news/ukraine-suffers-biggest-air-attack-of-war-c-19943740",
    "timestamp": "2025-09-07T21:46:58Z"
  },
  {
    "title": "“Apocalypse Now” in Chicago, No Love For Trump in New York: This Weekend’s Top Stories",
    "description": "A roundup of a wild weekend of news.",
    "link": "https://www.yahoo.com/news/articles/apocalypse-now-chicago-no-love-214359098.html",
    "timestamp": "2025-09-07T21:43:59Z"
  },
  {
    "title": "Trump receives mixed reaction at US Open after security delays frustrate fans",
    "description": "Donald Trump receives a mixed reaction at the US Open after security delays frustrate fans ahead of the Jannik Sinner vs Carlos Alcaraz men's singles final.",
    "link": "https://www.abc.net.au/news/2025-09-08/donald-trump-delays-us-open-final-frustrates-fans/105746630",
    "timestamp": "2025-09-07T21:40:23Z"
  },
  {
    "title": "USTA Asks to Censor Fan Reaction to Donald Trump at US Open",
    "description": "The USTA reportedly asked networks to censor fan reactions to Donald Trump's US Open visit during the 2025 men's final match",
    "link": "https://www.usmagazine.com/entertainment/news/usta-asks-to-censor-fan-reaction-to-donald-trump-at-us-open/#article",
    "timestamp": "2025-09-07T21:40:01Z"
  },
  {
    "title": "Carlos Alcaraz sees off Jannik Sinner to take US Open title and world No 1 crown",
    "description": "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 victory in the US Open final — the third Grand Slam tournament in a row where these elite, young rivals met to decide the champion — for his second trophy at Flushing Meado…",
    "link": "https://www.independent.ie/sport/other-sports/tennis/carlos-alcaraz-sees-off-jannik-sinner-to-take-us-open-title-and-world-no-1-crown/a1507227455.html",
    "timestamp": "2025-09-07T21:39:58Z"
  },
  {
    "title": "We're At The Part Where They Say POTUS' Words Were 'Taken Out Of Context'",
    "description": "This continues to happen with the Trump administration and its supporters. Trump says something outrageous, they deny it, and when you provide proof, it's \"taken out of context.\" But in this case, and many others, there is a quote from the loofah-faced shit-g…",
    "link": "https://crooksandliars.com/2025/09/were-part-where-they-say-potuss-words-were",
    "timestamp": "2025-09-07T21:38:58Z"
  },
  {
    "title": "Carlos Alcaraz conquers Jannik Sinner to claim US Open as rivalry shifts again",
    "description": "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 victory Sunday in the U.S. Open final — the third Grand Slam tournament in a row where these elite, young rivals met to decide the champion — for his second trophy at Flush…",
    "link": "https://nypost.com/2025/09/07/sports/carlos-alcaraz-conquers-jannik-sinner-to-claim-us-open/",
    "timestamp": "2025-09-07T21:37:47Z"
  },
  {
    "title": "Alcaraz outshines Sinner to claim second US Open title",
    "description": "NEW YORK : Carlos Alcaraz ended the reign of Jannik Sinner with a 6-2 3-6 6-1 6-4 win to claim the U.S. Open title on Sunday and tighten his grip on the era-defining rivalry between the torch-bearers of the men's game.In a perfect echo of the triumph that fir…",
    "link": "https://www.channelnewsasia.com/sport/alcaraz-outshines-sinner-claim-second-us-open-title-5337151",
    "timestamp": "2025-09-07T21:34:39Z"
  },
  {
    "title": "Carlos Alcaraz captures US Open title with Trump on hand",
    "description": "Carlos Alcaraz won the second U.S. Open title of his career on Sunday as he defeated Jannik Sinner in four sets with President Donald Trump watching.",
    "link": "https://www.foxnews.com/sports/carlos-alcaraz-captures-us-open-title-trump-hand",
    "timestamp": "2025-09-07T21:33:07Z"
  },
  {
    "title": "Trump issues 'last warning' to Hamas to accept hostage deal",
    "description": "President Donald Trump on Sunday issued what he called his “last warning” to Hamas, urging the Palestinian militant group to accept a deal to release hostages from Gaza.“The Israelis have accepted my Terms.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-issues-last-warning-hamas-accept-hostage-deal-rcna229686",
    "timestamp": "2025-09-07T21:30:16Z"
  },
  {
    "title": "Trump's US Open visit sparks boos and long security lines",
    "description": "President Donald Trump attended the U.S. Open on Sunday, drawing boos from the crowd",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-us-open-visit-sparks-boos-long-security-125336604",
    "timestamp": "2025-09-07T21:26:28Z"
  },
  {
    "title": "Analysts warn of stagflation after dismal US jobs report",
    "description": "The report solidified the case for the Federal Reserve to cut interest rates at its next meeting.",
    "link": "https://www.semafor.com/article/09/07/2025/analysts-warn-of-stagflation-after-dismal-us-jobs-report",
    "timestamp": "2025-09-07T21:25:11Z"
  },
  {
    "title": "US Open fans stuck in line due to delay for Trump",
    "description": "Fans remained stuck in a lengthy line while the US Open men's final began due to extra security measures with President Donald Trump attending the match.",
    "link": "https://www.espn.com/tennis/story/_/id/46189259/us-open-fans-stuck-line-trump-attendance-causes-delay",
    "timestamp": "2025-09-07T21:21:52Z"
  },
  {
    "title": "South Korea to bring home over 300 workers detained in US Hyundai plant raid",
    "description": "South Korea to bring home over 300 workers detained in US Hyundai plant raidnikkei.com",
    "link": "https://asia.nikkei.com/business/automobiles/south-korea-to-bring-home-over-300-workers-detained-in-us-hyundai-plant-raid",
    "timestamp": "2025-09-07T21:18:48Z"
  },
  {
    "title": "Trump Now Wants To Take Over The 9/11 Memorial And Museum",
    "description": "After targeting the Smithsonian, Donald J. Trump is now aiming at the 9/11 Memorial because, to him, he believes he should lord over everything. The 9/11 memorial is a sacred place of remembrance and reflection for survivors, victims' families, and the public…",
    "link": "https://crooksandliars.com/2025/09/trump-now-wants-take-over-911-memorial-and",
    "timestamp": "2025-09-07T21:14:02Z"
  },
  {
    "title": "Trump issues 'last warning' to Hamas to accept hostage deal",
    "description": "WASHINGTON: US President Donald Trump on Sunday (Sep 7) issued what he called his \"last warning\" to Hamas, urging the Palestinian militant group to accept a deal to release hostages from Gaza.\"",
    "link": "https://www.channelnewsasia.com/world/trump-issues-last-warning-hamas-accept-hostage-deal-5337131",
    "timestamp": "2025-09-07T21:14:00Z"
  },
  {
    "title": "Trump issues 'last warning' to Hamas to accept hostage deal",
    "description": "WASHINGTON: United States President Donald Trump on Sunday (Sep 7) issued what he called his \"last warning\" to Hamas, urging the Palestinian militant group to accept a deal to release hostages from Gaza.\"The Israelis have accepted my terms. It is time for Ham…",
    "link": "https://www.channelnewsasia.com/world/trump-last-warning-hamas-hostage-deal-israel-gaza-5337131",
    "timestamp": "2025-09-07T21:14:00Z"
  },
  {
    "title": "Trump created a 'lose-lose situation' because of how 'afraid' he is of Mamdani: analysts",
    "description": "President Donald Trump's latest attempt to undercut New York City mayoral candidate Zohran Mamdani shows how afraid the president is of him, according to two analysts. Shaniqua McClendon, vice president of political strategy for Crooked Media, and Ashley Prat…",
    "link": "https://www.rawstory.com/trump-2673968642/",
    "timestamp": "2025-09-07T21:11:36Z"
  },
  {
    "title": "Fans remain stuck in line as U.S. Open final begins because of extra security with Trump attending",
    "description": "Fans enduring a lengthy wait to get into the U.S. Open final booed and chanted “Let us in! Let us in!” when the match between Carlos Alcaraz and Jannik Sinner began Sunday after a delay. With extra security measures in place because President Donald Trump was…",
    "link": "https://japantoday.com/category/sports/fans-remain-stuck-in-line-as-us-open-final-begins-because-of-extra-security-with-trump-attending",
    "timestamp": "2025-09-07T21:11:21Z"
  },
  {
    "title": "Trump Met With Boos, Cheers at US Open as Sinner/Alcaraz Match Delayed | Video",
    "description": "The game between the two men was pushed back by at least 30 minutes due to additional security measures put into place\nThe post Trump Met With Boos, Cheers at US Open as Sinner/Alcaraz Match Delayed | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-us-open-boos-cheers-video/",
    "timestamp": "2025-09-07T21:10:22Z"
  },
  {
    "title": "Trump ready for 'phase two' of Russia sanctions over Ukraine conflict",
    "description": "U.S. President Donald Trump said on Sunday he is ready to move to a second phase of sanctioning Russia, the closest he has come to suggesting he is on the verge of ramping up sanctions against Moscow or its oil buyers over the war in Ukraine. Trump has repeat…",
    "link": "https://japantoday.com/category/world/trump-ready-for-%27phase-two%27-of-russia-sanctions-over-ukraine-conflict",
    "timestamp": "2025-09-07T21:10:15Z"
  },
  {
    "title": "Houthi drone strikes an Israeli airport in rare hit as Israel steps up Gaza City attacks",
    "description": "A drone fired by Yemen's Houthi rebels breached Israel's multilayered air defenses on Sunday and slammed into the country's southern airport, the Israeli military said, blowing out glass windows, wounding one person and briefly shutting down commercial airspa…",
    "link": "https://japantoday.com/category/world/a-houthi-drone-strikes-an-israeli-airport-in-a-rare-hit-as-israel-steps-up-gaza-city-attacks",
    "timestamp": "2025-09-07T21:10:07Z"
  },
  {
    "title": "Russia hits Ukraine with biggest air attack of war, setting government building ablaze",
    "description": "Russia launched its largest air attack of the war on Ukraine overnight, setting the main government building on fire in central Kyiv and killing at least four people, including an infant, Ukrainian officials said on Sunday. President Volodymyr Zelenskyy said …",
    "link": "https://japantoday.com/category/world/russia-hits-ukraine-with-biggest-air-attack-of-war-sets-government-building-ablaze1",
    "timestamp": "2025-09-07T21:09:44Z"
  },
  {
    "title": "Trump Is Taking Credit for Infrastructure Projects Funded by Biden Legislation He Opposed",
    "description": "The administration is putting up signs that say, \"President Donald J. Trump\" and \"Rebuilding America's Infrastructure\" at worksites funded by the 2021 bipartisan bill",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-taking-credit-biden-infrastructure-projects-1235422782/",
    "timestamp": "2025-09-07T21:07:02Z"
  },
  {
    "title": "Hamas open to any initiative that will 'halt agression'",
    "description": "Hamas responded to the earlier proposal for a ceasefire deal made by United States President Donald Trump, saying that it welcomed \"any initiative that contributes to the efforts to halt the aggressio...",
    "link": "https://biztoc.com/x/f7600ebe4c62a3a0",
    "timestamp": "2025-09-07T21:06:15Z"
  },
  {
    "title": "Bessent Warns Tariff Refunds Would Hurt Treasury, Vows Trump Has ‘Other Avenues’ if Supreme Court Strikes Down Powers",
    "description": "Treasury Secretary Scott Bessent joined NBC’s “Meet the Press” Sunday where he said he is “confident” the Trump administration will prevail in the Supreme Court... Read More\nThe post Bessent Warns Tariff Refunds Would Hurt Treasury, Vows Trump Has ‘Other Aven…",
    "link": "https://www.dailysignal.com/2025/09/07/bessent-warns-tariff-refunds-would-hurt-treasury-vows-trump-has-other-avenues/",
    "timestamp": "2025-09-07T21:00:00Z"
  },
  {
    "title": "‘The Conjuring: Last Rites’ Review: Holy Sh*t, Is Anyone Going to Miss These Things?",
    "description": "Michael Chaves delivers a significant step-up from the \"Devil Made Me Do It\" in a mixed-bag film that (theoretically) closes the book on Warner Bros.' divisive and lucrative universe of hauntings.",
    "link": "https://www.indiewire.com/criticism/movies/the-conjuring-last-rites-review-1235149471/",
    "timestamp": "2025-09-07T21:00:00Z"
  },
  {
    "title": "WATCH: ABC News panelists throw fit over RFK Jr. daring to question medical establishment",
    "description": "'So we should dismiss any person on the face of the earth that has a question about vaccine mandates?'",
    "link": "https://www.wnd.com/2025/09/watch-abc-news-panelists-throw-fit-rfk-jr/",
    "timestamp": "2025-09-07T20:58:34Z"
  },
  {
    "title": "‘Gutfeld!’ Outs Pete Hegseth for the ‘Only Weird Thing’ About His Former Office at Fox News | Video",
    "description": "And it was odorous\nThe post ‘Gutfeld!’ Outs Pete Hegseth for the ‘Only Weird Thing’ About His Former Office at Fox News | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/gutfeld-pete-hegseth-weird-thing-former-office-fox-news-video/",
    "timestamp": "2025-09-07T20:56:59Z"
  },
  {
    "title": "People Are Absolutely Losing It Over Donald Trump Getting Booed At The US Open Final",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_279dec2c-07bc-498d-b57f-17a8c980de54",
    "timestamp": "2025-09-07T20:56:17Z"
  },
  {
    "title": "Trump goes off on reporter for asking if he’s going to war with Chicago: ‘Darling, that’s fake news’",
    "description": "“Be quiet, listen!” Trump snapped. “You don’t listen! You never listen. That’s why you’re second-rate.\"",
    "link": "https://nypost.com/2025/09/07/us-news/trump-goes-off-on-reporter-for-asking-if-hes-going-to-war-with-chicago/",
    "timestamp": "2025-09-07T20:56:17Z"
  },
  {
    "title": "Was Trump really booed at the US Open? Videos claim both cheers and jeers as fans complain of being locked out by heightened security",
    "description": "Donald Trump's appearance at the US Open stirred controversy, allegedly delaying the Sinner-Alcaraz final due to heightened security measures. This caused significant entry delays for spectators, sparking online debates about whether he was booed or cheered. …",
    "link": "https://economictimes.indiatimes.com/news/international/us/was-trump-really-booed-at-the-us-open-videos-claim-both-cheers-and-jeers-as-fans-claim-to-be-left-stuck-outside-due-to-security/articleshow/123752686.cms",
    "timestamp": "2025-09-07T20:52:13Z"
  },
  {
    "title": "Adversaries Bruce Springsteen and Donald Trump Both Attend U.S. Open",
    "description": "Bruce Springsteen and Donald Trump were both in the crowd at Sunday night's tennis match for the men's finals at the U.S. Open.",
    "link": "http://www.rollingstone.com/music/music-news/bruce-springsteen-donald-trump-us-open-1235422717/",
    "timestamp": "2025-09-07T20:46:46Z"
  },
  {
    "title": "Chris Christie Unloads on Health Secretary Robert F. Kennedy Jr: ‘He’s a Joke!’",
    "description": "The Republican former governor predicted that President Donald Trump will sack his health secretary “if it gets much worse.”",
    "link": "https://www.thedailybeast.com/chris-christie-unloads-on-health-secretary-robert-f-kennedy-jr-hes-a-joke/",
    "timestamp": "2025-09-07T20:46:02Z"
  },
  {
    "title": "Hamas stipulates terms for ceasefire in response to Trump’s proposal",
    "description": "Hamas responds positively to Trump’s ceasefire proposal, welcoming talks but imposing conditions of Gaza withdrawal, prisoner release, and a commitment to uphold agreements.",
    "link": "https://www.israelnationalnews.com/news/414539",
    "timestamp": "2025-09-07T20:44:24Z"
  },
  {
    "title": "WATCH: President Trump doubles down on crackdowns in major US cities",
    "description": "ABC News' Selina Wang asked President Donald Trump on Sunday why his administration has been targeting Democratic cities, rather than cities in red states where FBI data shows have higher crime rates.",
    "link": "https://abcnews.go.com/Politics/video/president-trump-doubles-crackdowns-major-us-cities-125344834",
    "timestamp": "2025-09-07T20:43:46Z"
  },
  {
    "title": "Trump Got Booed at the U.S. Open, Again",
    "description": "Donald Trump was booed at the U.S. Open. Again. Trump attended the Men’s Final: Sinner vs. Alcaraz, where he was met with the same reception he got in 2015.",
    "link": "http://www.vulture.com/article/donald-trump-us-open-boo.html",
    "timestamp": "2025-09-07T20:43:44Z"
  },
  {
    "title": "Trump Warns Hamas: 'Last Warning'; Hostage Deal or Else",
    "description": "President Donald Trump warned Hamas on Sunday that it had one last chance to reach a hostage deal, or else.\nThe post Trump Warns Hamas: ‘Last Warning’; Hostage Deal or Else appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/09/07/trump-warns-hamas-last-warning-hostage-deal-or-else/",
    "timestamp": "2025-09-07T20:41:37Z"
  },
  {
    "title": "Trump delivers ultimatum to Hamas: hostages home or pay the consequences",
    "description": "President Donald Trump warned Hamas this is his last warning to accept hostage deal terms, with only 20 of 50 remaining hostages believed to still be alive.",
    "link": "https://www.foxnews.com/politics/trump-delivers-ultimatum-hamas-hostages-home-pay-consequences",
    "timestamp": "2025-09-07T20:37:32Z"
  },
  {
    "title": "Trump delivers ultimatum to Hamas: Accept deal and release hostages or pay the consequences",
    "description": "President Donald Trump warned Hamas this is his last warning to accept hostage deal terms, with only 20 of 50 remaining hostages believed to still be alive.",
    "link": "https://www.foxnews.com/politics/trump-delivers-ultimatum-hamas-accept-deal-release-hostages-pay-consequences",
    "timestamp": "2025-09-07T20:37:32Z"
  },
  {
    "title": "Trump Urges Hamas to Accept Terms to End Israel War",
    "description": "The President said his latest message to Hamas is a \"final warning.\"",
    "link": "https://www.newsweek.com/trump-urges-hamas-accept-terms-end-israel-war-2126065",
    "timestamp": "2025-09-07T20:31:03Z"
  },
  {
    "title": "“Be quiet!”: Trump chastises reporter for asking about Chicago plans",
    "description": "The president lashed out after being asked about an AI-generated meme.",
    "link": "https://www.salon.com/2025/09/07/be-quiet-trump-chastises-reporter-for-asking-about-chicago-plans/",
    "timestamp": "2025-09-07T20:30:51Z"
  },
  {
    "title": "Chicago Will 'Absolutely' See ICE Action This Week, Border Czar Says",
    "description": "Leaders at the local, state and national levels have condemned the Trump administration's threats while preparing to protect the city's immigrants.",
    "link": "https://www.huffpost.com/entry/chicago-absolutely-ice-action-immigration_n_68bde17fe4b00b82060b8891",
    "timestamp": "2025-09-07T20:30:13Z"
  },
  {
    "title": "South Korea will bring home 300 workers detained in massive Hyundai plant raid in Georgia",
    "description": "More than 300 South Korean workers detained following a massive immigration raid at a Hyundai plant in Georgia will be released and brought home, the South Korean government announced Sunday.",
    "link": "https://richmond.com/news/nation-world/article_88bddec1-a0f7-5c82-b2af-1eec31255fda.html",
    "timestamp": "2025-09-07T20:30:00Z"
  },
  {
    "title": "Donald Trump Receives Boos While Attending US Open Men’s Final (Photos)",
    "description": "The United States Tennis Association reportedly asked broadcasters to “refrain from showcasing any disruptions or reactions” to the president’s visit on Sunday.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/09/07/donald-trump-receives-boos-while-attending-us-open-mens-final-photos/",
    "timestamp": "2025-09-07T20:29:10Z"
  },
  {
    "title": "'It'll work this time, my dude': Mockery abounds for Trump's 'final warning' to Hamas",
    "description": "President Donald Trump's alleged \"final warning\" to Hamas was mocked by analysts on Sunday. Trump posted on Truth Social that he had \"warned\" Hamas of the consequences of not accepting his offer to end its war with Israel. He made the post while he was attend…",
    "link": "https://www.rawstory.com/trump-2673968624/",
    "timestamp": "2025-09-07T20:28:31Z"
  },
  {
    "title": "Trump Says Hassett, Warsh and Waller Are Finalists For Fed Chair",
    "description": "President Donald Trump said that he saw White House economic adviser Kevin Hassett, Federal Reserve Governor Christopher Waller and former Fed Governor Kevin Warsh as the finalists, as he chooses a replacement for the central bank’s chair, Jerome Powell.\n“You…",
    "link": "https://biztoc.com/x/69ece947e60d9270",
    "timestamp": "2025-09-07T20:21:30Z"
  },
  {
    "title": "‘This is my last warning!’ Trump issues final threat to Hamas to release hostages",
    "description": "'Everyone wants the Hostages HOME. Everyone wants this War to end!'",
    "link": "https://www.wnd.com/2025/09/this-is-my-last-warning-trump-issues-final/",
    "timestamp": "2025-09-07T20:12:52Z"
  },
  {
    "title": "Trump issues ‘last warning’ to Hamas over hostages",
    "description": "US President Donald Trump said Sunday he was issuing a “last warning” to Hamas, saying the Palestinian militant group must accept a deal to release hostages in Gaza. “The Israelis have accepted my terms. It is time for Hamas to accept as well. I have warned H…",
    "link": "https://www.digitaljournal.com/world/trump-issues-last-warning-to-hamas-over-hostages/article",
    "timestamp": "2025-09-07T20:12:20Z"
  },
  {
    "title": "Trump Issues 'Last Warning' To Hamas Over Hostages",
    "description": "US President Donald Trump said Sunday he was issuing a \"last warning\" to Hamas, saying the Palestinian militant group must accept a deal to release hostages in Gaza.",
    "link": "https://www.ibtimes.com/trump-issues-last-warning-hamas-over-hostages-3782753",
    "timestamp": "2025-09-07T20:12:17Z"
  },
  {
    "title": "Bruce Springsteen and Donald Trump Find Themselves Face to Face at US Open",
    "description": "At the US Open finals, Donald Trump sat just feet from his rival Bruce Springsteen, whom he has repeatedly threatened after the rocker’s fiery criticism on tour.",
    "link": "https://consequence.net/2025/09/bruce-springsteen-trump-us-open/",
    "timestamp": "2025-09-07T20:11:34Z"
  },
  {
    "title": "Bruce Springsteen and Donald Trump Find Themselves Face to Face at US Open",
    "description": "The rivals found themselves face to face at Arthur Ashe Stadium.",
    "link": "https://www.yahoo.com/entertainment/music/articles/bruce-springsteen-donald-trump-themselves-201134490.html",
    "timestamp": "2025-09-07T20:11:34Z"
  },
  {
    "title": "Trump's U.S. Open arrival delays match and leaves many seats empty",
    "description": "President Trump attended the U.S. Open on Sunday with Chief of Staff Susie Wiles, Attorney General Pam Bondi, Special Envoy Steve Witkofff and others.",
    "link": "https://www.nbcnews.com/news/us-news/trump-us-open-men-singles-final-sinner-alcaraz-rcna229662",
    "timestamp": "2025-09-07T20:11:28Z"
  },
  {
    "title": "Businesses say getting an export grant is harder than getting a Taylor Swift ticket",
    "description": "Cosmetics entrepreneurs through to tech developers say Austrade's signature export grant has become unfair, badly managed and opaque, all while many are struggling to adjust to Donald Trump's US tariffs.",
    "link": "https://www.abc.net.au/news/2025-09-08/exporters-stressed-and-angry-about-emdg-grant/105734456",
    "timestamp": "2025-09-07T20:08:31Z"
  },
  {
    "title": "US-European sanctions could ‘collapse’ Russian economy: Trump aide",
    "description": "Scott Bessent calls for secondary tariffs on Russian oil importers to bring President Vladimir Putin 'to the table'.",
    "link": "https://www.aljazeera.com/news/2025/9/7/us-european-sanctions-could-collapse-russian-economy-trump-aide",
    "timestamp": "2025-09-07T20:01:46Z"
  },
  {
    "title": "This Kennedy heir is making moves to take on RFK Jr. in Congress",
    "description": "Jack Schlossberg, a young voice in Democratic party, has gone viral on social media for his pop culture posts and attacks on RFK Jr.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/07/jack-schlossberg-congress-rfk-jr/86030343007/",
    "timestamp": "2025-09-07T20:01:17Z"
  },
  {
    "title": "USTA faces heat after muting Trump boos",
    "description": "Cheers and jeers at US Open for Trump, amid debate over USTA’s decision to ask for the muting of on-air reactions",
    "link": "https://www.salon.com/2025/09/07/usta-faces-heat-after-muting-trump-boos/",
    "timestamp": "2025-09-07T20:00:56Z"
  },
  {
    "title": "Amy Coney Barrett defends Supreme Court's Dobbs decision when pressed by CBS",
    "description": "Justice Amy Coney Barrett defended the Dobbs decision on Sunday during an interview with CBS host Norah O'Donnell",
    "link": "https://www.foxnews.com/media/amy-coney-barrett-defends-supreme-courts-dobbs-decision-when-pressed-cbs",
    "timestamp": "2025-09-07T20:00:46Z"
  },
  {
    "title": "A decades-long peace vigil outside the White House is dismantled after Trump's order (Associated Press)",
    "description": "Associated Press:\nA decades-long peace vigil outside the White House is dismantled after Trump's order  —  Law enforcement officials on Sunday removed a peace vigil that had stood outside the White House for more than four decades after President Donald Trump…",
    "link": "https://www.memeorandum.com/250907/p60",
    "timestamp": "2025-09-07T20:00:27Z"
  },
  {
    "title": "U.S. Open Crowd Booed Trump Repeatedly",
    "description": "The U.S. Open crowd booed Donald Trump when he arrived at the stadium and during the national anthem, which could be heard on the national telecast.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-loudly-booed-us-open-1235422786/",
    "timestamp": "2025-09-07T20:00:11Z"
  }
]