[
  {
    "title": "Zelensky says will send US revised plan to end Ukraine war",
    "description": "President Volodymyr Zelensky on Tuesday said he planned to send the United States revised proposals “in the near future” on ending Russia’s war on Ukraine, after meeting with European allies to strategize on their next steps. US President Donald Trump is pres…",
    "link": "https://www.digitaljournal.com/world/zelensky-says-will-send-us-revised-plan-to-end-ukraine-war/article",
    "timestamp": "2025-12-09T16:52:20Z"
  },
  {
    "title": "Cracker Barrel Regulars Grumble About Decline in Chain's Food Quality",
    "description": "Some Cracker Barrel customers say its menu items are not what they used to be, the news coming after the controversy over the chain's logo.  \nThe post Cracker Barrel Regulars Grumble About Decline in Chain’s Food Quality appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/12/09/cracker-barrel-regulars-grumble-about-decline-chains-food-quality/",
    "timestamp": "2025-12-09T16:51:27Z"
  },
  {
    "title": "Infrequently Asked Questions About Jeffrey Epstein, Part Two: Commodity Flow Information (Greg Olear/PREVAIL)",
    "description": "Greg Olear / PREVAIL:\nInfrequently Asked Questions About Jeffrey Epstein, Part Two: Commodity Flow Information  —  The second installment of a mammoth Epstein Q&A, featuring Ghislaine Maxwell, Robert Maxwell, Semion Mogilevich, Bill Barr, Donald Barr, Les Wex…",
    "link": "https://www.memeorandum.com/251209/p69",
    "timestamp": "2025-12-09T16:50:00Z"
  },
  {
    "title": "Kevin Hassett Claims Good Economy To Come From Pre-COVID Trump 'Ideas'",
    "description": "Donald Trump's economic henchman, Kevin Hassett, spewed nonsense at the CNBC host after Joe Kernen called out Trump for ignoring the pain the people are feeling.\nNobody believes Hassett's fairy dust that will magically fix all of Trump's economic problems, wh…",
    "link": "https://crooksandliars.com/2025/12/kevin-hassett-claims-good-economy-coming",
    "timestamp": "2025-12-09T16:48:00Z"
  },
  {
    "title": "Trump Ban on Wind Energy Projects Ruled Illegal by Federal Judge",
    "description": "Less than a year after President Donald Trump banned new wind projects, a federal judge ruled the president’s executive order was illegal. US District Judge Patti Saris said Monday the order is “arbitrary and capricious and contrary to law,” siding …",
    "link": "https://www.insurancejournal.com/news/national/2025/12/09/850405.htm",
    "timestamp": "2025-12-09T16:47:21Z"
  },
  {
    "title": "Opponents of Trump-backed redistricting in Missouri submit a petition to force a public vote",
    "description": "The signatures still must be formally verified by election authorities.",
    "link": "https://www.bostonherald.com/2025/12/09/election-2026-redistricting-missouri-referendum/",
    "timestamp": "2025-12-09T16:46:57Z"
  },
  {
    "title": "Turkstream’s managing company will move its headquarters to Budapest to circumvent sanctions",
    "description": "Through the Turkstream pipeline Turkey helps Moscow bypass sanctions\nThe post Turkstream’s managing company will move its headquarters to Budapest to circumvent sanctions appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/12/09/turkstreams-managing-company-will-move-its-headquarters-to-budapest-to-circumvent-sanctions/",
    "timestamp": "2025-12-09T16:46:05Z"
  },
  {
    "title": "Nobel officials not sure Machado will collect peace prize",
    "description": "Nobel officials cancelled a press conference with peace prize laureate Maria Corina Machado in Oslo today, as it was unclear where the Venezuelan opposition leader was and whether she would collect her award in person.",
    "link": "https://www.rte.ie/news/world/2025/1209/1548106-nobel-officials-not-sure-machado-will-collect-peace-prize/",
    "timestamp": "2025-12-09T16:46:04Z"
  },
  {
    "title": "Trump Brings Up His 2020 Election Conspiracy at Weirdest Possible Time",
    "description": "Donald Trump apparently can’t speak about Kyiv without making the Russia-Ukraine war all about himself.When asked by Politico’s Dasha Burns Monday night if he believed Ukraine had lost its war with Russia, Trump said that the Eastern European nation had lost …",
    "link": "https://newrepublic.com/post/204178/donald-trump-2020-election-conspiracy-ukraine-peace",
    "timestamp": "2025-12-09T16:46:03Z"
  },
  {
    "title": "JD Vance Makes Awkward Penis Size Joke",
    "description": "JD Vance Makes Awkward Penis Size Jokelittlethings.com",
    "link": "https://littlethings.com/entertainment/jd-vance-makes-awkward-penis-joke",
    "timestamp": "2025-12-09T16:44:43Z"
  },
  {
    "title": "“Don’t Be Dramatic”: Trump Shuts Down Concerns About Rising Costs",
    "description": "Donald Trump took offense at an innocuous question while discussing his health care plans during an interview with Politico’s Dasha Burns Monday, snapping when Burns segued into families’ rising costs for the holidays.“So right now, people are buying their ho…",
    "link": "https://newrepublic.com/post/204176/dont-be-dramatic-trump-rising-costs-health-care",
    "timestamp": "2025-12-09T16:43:20Z"
  },
  {
    "title": "'Cheap ceasefire' between Ukraine and Russia would create 'expensive peace' for Europe, Norway's foreign minister warns",
    "description": "A \"cheap ceasefire\" between Ukraine and Russia - with Kyiv forced to surrender land - would create an \"expensive peace\" for the whole of Europe, Norway's foreign minister has warned.",
    "link": "https://news.sky.com/story/cheap-ceasefire-between-ukraine-and-russia-would-create-expensive-peace-for-europe-norways-foreign-minister-warns-13481353",
    "timestamp": "2025-12-09T16:42:00Z"
  },
  {
    "title": "Zelenskyy again resists U.S. pressure on Ukraine to cede any land to Russia as he rallies European support",
    "description": "Other than Zelenskyy's comments Monday, Ukrainian negotiators have said very little in public about the content of the U.S. proposal or their attitude toward it.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-again-resists-u-s-pressure-on-ukraine-to-cede-any-land-to-russia-as-he-rallies-european-support",
    "timestamp": "2025-12-09T16:41:08Z"
  },
  {
    "title": "Zelenskiy says 'refined documents' on peace plan will soon be sent to U.S",
    "description": "KYIV, Dec 9 (Reuters) - Ukraine and its European partners will soon be ready to present the U.S. with \"refined documents\" on a peace plan to end the war with Russia, President Volodymyr Zelenskiy said on Tuesday, following days of high-stakes shuttle diplomac…",
    "link": "https://www.thestar.com.my/news/world/2025/12/10/zelenskiy-says-039refined-documents039-on-peace-plan-will-soon-be-sent-to-us",
    "timestamp": "2025-12-09T16:41:00Z"
  },
  {
    "title": "Honduras seeks arrest of ex-President Hernández after Trump pardon",
    "description": "Hernández had been sentenced to 45 years for helping move cocaine to the U.S.",
    "link": "https://www.bostonherald.com/2025/12/09/honduras-ex-president-trump-pardon/",
    "timestamp": "2025-12-09T16:39:24Z"
  },
  {
    "title": "Trump Is Using the 'Misinformation' Censorship Playbook Republicans Attacked Biden for",
    "description": "A Department of Homeland Security (DHS) spokesperson recently complained about alleged \"lies, smears and AI deepfakes that are designed to deceive Americans\" about President Donald Trump's immigration agenda. Pressed on whether the government was talking with…",
    "link": "https://biztoc.com/x/2dcea01d5ab2583a",
    "timestamp": "2025-12-09T16:38:39Z"
  },
  {
    "title": "Nigeria’s current insecurity not religious — FG",
    "description": "The Nigerian government asserts that the country’s insecurity is not religious, detailing efforts to tackle terrorism and ensure due process in prosecution\n\nRead More: https://punchng.com/nigerias-current-insecurity-not-religious-fg/",
    "link": "https://punchng.com/nigerias-current-insecurity-not-religious-fg/",
    "timestamp": "2025-12-09T16:38:16Z"
  },
  {
    "title": "Amnesty International Describes Alligator Alcatraz Like a Torture-Fueled CIA Black Site",
    "description": "A recent report from Amnesty International describes migrants at Alligator Alcatraz tortured in metal boxes straight from CIA nightmares.",
    "link": "https://www.jezebel.com/alligator-alcatraz-abuse-torture-amnesty-international-report-metal-box-2x2-mosquitos",
    "timestamp": "2025-12-09T16:37:15Z"
  },
  {
    "title": "Furious Karoline Leavitt berates Republicans for not praising Trump enough",
    "description": "As Americans increasingly\r\n lay blame for rising costs squarely at President Donald Trump’s feet, White House Press Secretary Karoline Leavitt took to Fox News Tuesday to bash Republicans for not praising the president enough for his accomplishments.“As Presi…",
    "link": "https://www.rawstory.com/karoline-leavitt-2674382555/",
    "timestamp": "2025-12-09T16:36:44Z"
  },
  {
    "title": "Trump's Word Games Can't Conceal the Murderous Reality of His Anti-Drug Strategy",
    "description": "The administration calling suspected cocaine smugglers \"combatants\" does not justify summarily executing them.",
    "link": "https://reason.com/2025/12/10/trumps-word-games-cant-conceal-the-murderous-reality-of-his-anti-drug-strategy/",
    "timestamp": "2025-12-09T16:36:21Z"
  },
  {
    "title": "Democrats call Mahomes, Kelce and Trump \"washed\"; ignoring Chiefs' respect for Biden at White House visit",
    "description": "The Kansas City Chiefs are barely alive in the playoff race and need everything to go their way if they want to turn around their disappointing season. At the moment, they are thir",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/12/09/693841bb22601d7b128b459e.html",
    "timestamp": "2025-12-09T16:34:29Z"
  },
  {
    "title": "Trump insists prices are ‘coming down,’ blames Biden — but voters say they’re still getting squeezed",
    "description": "Trump faces economic messaging crisis after Democrats won November elections campaigning on affordability as 76% of voters view economy negatively.",
    "link": "https://www.foxnews.com/politics/trump-insists-prices-coming-down-blames-biden-voters-say-theyre-still-getting-squeezed",
    "timestamp": "2025-12-09T16:34:07Z"
  },
  {
    "title": "'Prices are coming down': Trump hails his economy, blames Biden as voters say costs still sting",
    "description": "Trump faces economic messaging crisis after Democrats won November elections campaigning on affordability as 76% of voters view economy negatively.",
    "link": "https://www.foxnews.com/politics/prices-coming-down-trump-hails-his-economy-blames-biden-voters-say-costs-still-sting",
    "timestamp": "2025-12-09T16:34:07Z"
  },
  {
    "title": "ABC signs Jimmy Kimmel to a one-year contract extension, months after temporary suspension",
    "description": "(AP) — President Donald Trump won’t be getting his wish. ABC said Monday it has signed late-night comic Jimmy Kimmel to a one-year contract extension.Kimmel’s previous, multiyear contract had<a class=\"excerpt-read-more\" href=\"https://wsvn.com/entertainment/ab…",
    "link": "https://wsvn.com/entertainment/abc-signs-jimmy-kimmel-to-a-one-year-contract-extension-months-after-temporary-suspension/",
    "timestamp": "2025-12-09T16:30:50Z"
  },
  {
    "title": "‘I Feel Very Sorry for President Trump’: Marjorie Taylor Greene Responds to Trump’s ‘Vitriol’ on CNN",
    "description": "Marjorie Taylor Greene is continuing trade barbs with President Trump during her final weeks in Congress, telling CNN on Tuesday he is a very \"hateful\" man. \nThe post ‘I Feel Very Sorry for President Trump’: Marjorie Taylor Greene Responds to Trump’s ‘Vitriol…",
    "link": "https://www.mediaite.com/media/i-feel-very-sorry-for-president-trump-marjorie-taylor-greene-responds-to-trumps-vitriol-on-cnn/",
    "timestamp": "2025-12-09T16:29:36Z"
  },
  {
    "title": "Nostradamus terrifying Predictions for 2026: 'War, Blood and King Donald’",
    "description": "The Nostradamus predictions for 2026 have once again entered global conversations amid escalating political tensions across regions. The 16th-century French astrologer and seer has often been associated with prophecies believed to foreshadow significant world…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nostradamus-terrifying-predictions-for-2026-war-blood-and-king-donald/articleshow/125873632.cms",
    "timestamp": "2025-12-09T16:29:06Z"
  },
  {
    "title": "Movie Theaters Dread Any Warner Bros. Merger",
    "description": "Cinema owners oppose a megadeal that would see one of the last Hollywood legacy studios snapped up only five years after the demise of 20th Century Fox: \"We have fixed costs.\"",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/warner-bros-merger-movie-theaters-1236444439/",
    "timestamp": "2025-12-09T16:28:37Z"
  },
  {
    "title": "Costa to Trump: Allies must act as allies",
    "description": "European Council President Antonio Costa responded on Tuesday to United States President Donald Trump's criticism of the European Union's incumbent leaders by noting that the bloc is \"allies with Wash...",
    "link": "https://biztoc.com/x/8ac76835a6f61fa4",
    "timestamp": "2025-12-09T16:27:28Z"
  },
  {
    "title": "‘Who Will Be in Charge?’ Sanders Warns of AI Future Dominated by Handful of Billionaires",
    "description": "US Sen. Bernie Sanders said Monday that policymakers in the United States and around the world are at a critical juncture where they must decide whether artificial intelligence will be controlled and exploited by the ultra-wealthy—or utilized for the benefit …",
    "link": "https://www.commondreams.org/news/sanders-ai-billionaires",
    "timestamp": "2025-12-09T16:26:47Z"
  },
  {
    "title": "Half of Israelis oppose pardon for Netanyahu over corruption charges, survey shows",
    "description": "Israeli PM Binyamin Netanyahu has asked president Yitzhak Herzog for a pardon over the charges",
    "link": "https://www.irishtimes.com/world/middle-east/2025/12/09/half-of-israelis-oppose-pardon-for-netanyahu-over-corruption-charges-survey-shows/",
    "timestamp": "2025-12-09T16:26:46Z"
  },
  {
    "title": "Trump Is Using the 'Misinformation' Censorship Playbook Republicans Attacked Biden for",
    "description": "Trump decried the Biden administration for pressuring platforms to police misinformation. His administration seems to have warmed to the idea.",
    "link": "https://reason.com/2025/12/09/trump-is-using-the-misinformation-censorship-playbook-republicans-attacked-biden-for/",
    "timestamp": "2025-12-09T16:25:03Z"
  },
  {
    "title": "December 8, 2025 — Last Wednesday, December 3, a reporter asked President Donald J. Trump ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nDecember 8, 2025  —  Last Wednesday, December 3, a reporter asked President Donald J. Trump if he would release the video of the September 2 strike on a small boat off the coast of Venezuela that killed two s…",
    "link": "https://www.memeorandum.com/251209/p63",
    "timestamp": "2025-12-09T16:25:00Z"
  },
  {
    "title": "Effigy Of ‘Little Tyrant’ Trump Burned At Annual Christmas Festival In Guatemala",
    "description": "“It’s to represent the triumph of good over evil and all bad things and to let go of bad things,” one participant said.",
    "link": "https://www.huffpost.com/entry/trump-effigy-burned-devil-guatemala-christmas_n_69383bf8e4b013f1f7d31bf4",
    "timestamp": "2025-12-09T16:23:02Z"
  },
  {
    "title": "​Sonia Sotomayor hits Elon Musk with 'quid pro quo' accusation",
    "description": "U.S. Supreme Court Justice Sonia Sotomayor suggested that billionaire Elon Musk had a \"quid pro quo\" relationship with President Donald Trump after donating millions to get him re-elected.During a Tuesday hearing on campaign finance laws, Sotomayor made the s…",
    "link": "https://www.rawstory.com/musk-trump-quid-pro-quo/",
    "timestamp": "2025-12-09T16:22:03Z"
  },
  {
    "title": "Donald Trump Scores Approval Rating Boost",
    "description": "President Donald Trump's approval rating has slightly increased, a new poll has found.\nAccording to polling by Reuters/Ipsos, 41 percent of people approve of the president, a 3 percent increase from last month, when 38 percent approved of him.\nNewsweek reache…",
    "link": "https://biztoc.com/x/252db7f8c11c897c",
    "timestamp": "2025-12-09T16:16:32Z"
  },
  {
    "title": "Trump lambasts 'weak' and 'decaying' Europe and hints at walking away from Ukraine (Peter Beaumont/The Guardian)",
    "description": "Peter Beaumont / The Guardian:\nTrump lambasts ‘weak’ and ‘decaying’ Europe and hints at walking away from Ukraine  —  US president recycles far-right tropes on European immigration and presses Zelenskyy to accept his peace plan  —  Donald Trump has hinted he …",
    "link": "https://www.memeorandum.com/251209/p56",
    "timestamp": "2025-12-09T16:15:01Z"
  },
  {
    "title": "Tiny Cars: ‘AMAZING!!!’",
    "description": "Donald Trump has fallen in love with Japan’s adorable micro-cars. Do Americans actually want them?",
    "link": "https://www.theatlantic.com/technology/2025/12/donald-trump-tiny-cars-japan/685190/",
    "timestamp": "2025-12-09T16:13:00Z"
  },
  {
    "title": "Civilisational erasure, but for whom?",
    "description": "Is Europe facing civilizational collapse? That appears to be the view of the Trump administration, as detailed in its National Security Strategy (NSS) roadmap published on December 5. The European Union occupies an important place in the document, which prese…",
    "link": "https://voxeurop.eu/en/civilisational-erasure-europe-donald-trump/",
    "timestamp": "2025-12-09T16:12:07Z"
  },
  {
    "title": "Zelenskyy ready to present new peace proposals to US and Russia after working with European talks",
    "description": "Ukrainian President Volodymyr Zelenskyy announced readiness to present new peace proposals to the U.S. and Russia on Tuesday.",
    "link": "https://www.foxnews.com/politics/zelenskyy-ready-present-new-peace-proposals-us-russia-after-working-european-talks",
    "timestamp": "2025-12-09T16:10:20Z"
  },
  {
    "title": "Judge rules Ghislaine Maxwell grand jury records can be unsealed",
    "description": "In his ruling, Judge Paul Engelmayer cited a new law passed last month requiring the release of files on Jeffrey Epstein.",
    "link": "https://www.bbc.com/news/articles/cn8e2kvzen7o",
    "timestamp": "2025-12-09T16:06:03Z"
  },
  {
    "title": "Dramatic Jasmine Crockett Gets Emotional During Senate Announcement: This Moment Is 'Life or Death'",
    "description": "Radical leftist Rep. Jasmine Crockett (D-TX) got emotional as she formally announced her entry into the Texas Senate race.\nThe post Dramatic Jasmine Crockett Gets Emotional During Senate Announcement: This Moment Is ‘Life or Death’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/12/09/dramatic-jasmine-crockett-gets-emotional-during-senate-announcement-this-moment-is-life-death/",
    "timestamp": "2025-12-09T16:05:12Z"
  },
  {
    "title": "‘Politically toxic’: how CNN became a pawn in blockbuster takeover battle",
    "description": "Netflix-Paramount bidding war leaves future television network detested by Donald Trump up for grabs",
    "link": "https://biztoc.com/x/3709dbc92610ee48",
    "timestamp": "2025-12-09T16:04:51Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
    "description": "Indian markets extended losses ahead of the US Fed decision and trade uncertainties, with IT dragging benchmarks lower. Analysts flagged weak short-term sentiment as Nifty trades below key EMAs despite support at Fibonacci levels. Global cues and FII flows re…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/125873279.cms",
    "timestamp": "2025-12-09T16:03:36Z"
  },
  {
    "title": "Resurfaced Bondi admission could be damning for Trump: report",
    "description": "A legal brief authored by Pam Bondi before she became Donald Trump’s Attorney General could come back to haunt their relationship.On Tuesday, MS NOW host Jonathan Lemire pointed to a report from the New York Times which uncovered work that Bondi did for a con…",
    "link": "https://www.rawstory.com/bondi-trump-2674382238/",
    "timestamp": "2025-12-09T16:03:20Z"
  },
  {
    "title": "US dollar gains after jobs report, as Fed decision nears",
    "description": "LONDON/NEW YORK, Dec 9 : The U.S. dollar rose on Tuesday ahead of an expected rate cut from the Federal Reserve on Wednesday, while the Australian dollar was firmer after its central bank ruled out more easing.     Markets are anticipating a rate cut from the…",
    "link": "https://www.channelnewsasia.com/business/us-dollar-gains-after-jobs-report-fed-decision-nears-5569241",
    "timestamp": "2025-12-09T16:02:35Z"
  },
  {
    "title": "US dollar rises after jobs data; Fed cut expected but hawkish comments likely",
    "description": "NEW YORK, Dec 9 : The U.S. dollar advanced on Tuesday as better-than-expected job-market figures underscored a still resilient labor market ahead of the Federal Reserve's anticipated rate cut, with policymakers likely to emphasize inflation risks that could c…",
    "link": "https://www.channelnewsasia.com/business/us-dollar-rises-after-jobs-data-fed-cut-expected-hawkish-comments-likely-5569241",
    "timestamp": "2025-12-09T16:02:35Z"
  },
  {
    "title": "Honduras presidential candidate alleges election has been 'stolen'",
    "description": "Second-placed candidate Salvador Nasralla alleges fraud as the vote count drags into a ninth day.",
    "link": "https://www.bbc.com/news/articles/cp39v8wd7glo",
    "timestamp": "2025-12-09T16:02:23Z"
  },
  {
    "title": "Former presidential hopeful Gareth Sheridan pictured at Tucker Carlson’s Christmas party",
    "description": "Former Irish presidential election hopeful Gareth Mr Sheridan has been pictured alongside celebrities and right-wing activists at Tucker Carlson’s recent Christmas party.",
    "link": "https://www.independent.ie/irish-news/former-presidential-hopeful-gareth-sheridan-pictured-at-tucker-carlsons-christmas-party/a1257139166.html",
    "timestamp": "2025-12-09T16:02:15Z"
  },
  {
    "title": "Trump’s Venezuela Plans Could Create Millions of Migrant Refugees",
    "description": "While Donald Trump focuses on the alleged \"narco terrorists\" in Venezuela and skirts the line between a war, bigger issues could be brewing. We already know how the Trump administration feels about immigration, but a war with Venezuela will only expand that i…",
    "link": "https://www.shtfplan.com/headline-news/trumps-venezuela-plans-could-create-millions-of-migrant-refugees",
    "timestamp": "2025-12-09T16:00:28Z"
  },
  {
    "title": "The Unraveling of Iran's Influence in Syria",
    "description": "The collapse of longtime Syrian President Bashar al-Assad last year was felt across the Middle East, and nowhere more than in Iran, his closest ally. Assad’s fall was a major blow to Iran, which had used Syria to expand its regional influence and funnel weapo…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/The-Unraveling-of-Irans-Influence-in-Syria.html",
    "timestamp": "2025-12-09T16:00:00Z"
  },
  {
    "title": "Gov. JB Pritzker signs bills protecting Illinois immigrants from federal immigration enforcement",
    "description": "Illinois Gov. JB Pritzker signed a slate of legislation Tuesday morning to protect immigrants from \"unjust\" federal immigration enforcement actions.",
    "link": "https://www.cbsnews.com/chicago/news/governor-jb-pritzker-bills-illinois-federal-immigration-enforcement/",
    "timestamp": "2025-12-09T16:00:00Z"
  },
  {
    "title": "How a Still-Defiant Shepard Fairey Turned Punk Rock Attitude Into 30 Years of Activist Art",
    "description": "In the life and work of artist Shepard Fairey, social justice and the musical counterculture have always collided, igniting many of his most striking images. Most famously, they have come in the form of 18-by-24-inch posters, with messages against police viol…",
    "link": "https://www.spin.com/2025/12/how-a-still-defiant-shepard-fairey-turned-punk-rock-attitude-into-30-years-of-activist-art/",
    "timestamp": "2025-12-09T16:00:00Z"
  },
  {
    "title": "Striking findings from 2025",
    "description": "Here’s a look back at 2025 through 12 of our most striking research findings.\nThe post Striking findings from 2025 appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/short-reads/2025/12/09/striking-findings-from-2025/",
    "timestamp": "2025-12-09T15:59:58Z"
  },
  {
    "title": "A Trump-backed candidate faces a Democrat with national support in Miami’s mayoral race. Here’s what to know",
    "description": "Big-name Republicans and Democrats have joined the campaign trail, making this a significant test for both parties.",
    "link": "https://www.pbs.org/newshour/politics/a-trump-backed-candidate-faces-a-democrat-with-national-support-in-miamis-mayoral-race-heres-what-to-know",
    "timestamp": "2025-12-09T15:58:56Z"
  },
  {
    "title": "Taoiseach tells Trump: EU is strong, not weak",
    "description": "The Taoiseach Micheál Martin has said he disagrees with US President Donald Trump, who described the European Union as \"weak\" and accused member states of letting Ukraine fight \"until they drop\".",
    "link": "https://www.rte.ie/news/ireland/2025/1209/1548095-taoiseach-tells-trump-eu-is-strong-not-weak/",
    "timestamp": "2025-12-09T15:55:22Z"
  },
  {
    "title": "EU is strong, not weak, Taoiseach tells Trump",
    "description": "The Taoiseach has said he disagrees with US President Donald Trump, who described the European Union as \"weak\" and accused member states of letting Ukraine fight \"until they drop\".",
    "link": "https://www.rte.ie/news/ireland/2025/1209/1548095-eu-us-politics/",
    "timestamp": "2025-12-09T15:55:22Z"
  },
  {
    "title": "Trump Personally Intervenes to Block Release of January 6 Documents",
    "description": "The Department of Justice has confirmed that President Donald Trump blocked the release of more than 4,100 documents related to the deadly riot on January 6.In a court filing Monday night, lawyers for the DOJ revealed that Trump had stepped in to prevent the …",
    "link": "https://newrepublic.com/post/204173/donald-trump-personally-intervenes-block-release-january-6-documents",
    "timestamp": "2025-12-09T15:54:09Z"
  },
  {
    "title": "Raul Malo, Lush-Voiced Frontman of the Mavericks, Dies at 60 - The New York Times",
    "description": "Raul Malo, Lush-Voiced Frontman of the Mavericks, Dies at 60The New York Times Raul Malo, Golden-Voiced ‘Maestro’ of the Mavericks, Dead at 60Rolling Stone Raul Malo, the soulful tenor and frontman of The Mavericks, has died at age 60AP News Country music sta…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180341473",
    "timestamp": "2025-12-09T15:52:18Z"
  },
  {
    "title": "Trump Reveals Litmus Test For Next Fed Pick",
    "description": "Donald Trump said on “The Conversation with Dasha Burns” Tuesday that he would only pick a Federal Reserve chair who would promptly reduce interest rates.",
    "link": "https://dailycaller.com/2025/12/09/trump-reveals-litmus-test-for-next-fed-pick/",
    "timestamp": "2025-12-09T15:51:28Z"
  },
  {
    "title": "Trump Threatens Mexico With Additional Tariffs Over Failure to Fulfill Water Agreement",
    "description": "President Donald Trump has threatened to impose new 5% tariffs on Mexico if the country does not “immediately” comply with a decades-old water treaty.   “Mexico still owes the... Read More\nThe post Trump Threatens Mexico With Additional Tariffs Over Failure t…",
    "link": "https://www.dailysignal.com/2025/12/09/trump-threatens-mexico-with-additional-tariffs-over-failure-to-fulfill-water-agreement/",
    "timestamp": "2025-12-09T15:50:01Z"
  },
  {
    "title": "Capitol agenda: What Trump told POLITICO about health care (Calen Razor/Politico)",
    "description": "Calen Razor / Politico:\nCapitol agenda: What Trump told POLITICO about health care  —  TRUMP'S TAKE ON HEALTH TALKS — President Donald Trump in an exclusive interview with POLITICO's Dasha Burns was noncommittal on the fate of Obamacare subsidies set to lapse…",
    "link": "https://www.memeorandum.com/251209/p50",
    "timestamp": "2025-12-09T15:50:00Z"
  },
  {
    "title": "Trump Continues To Distance Himself From Controversial Venezuelan Drug Boat Strike: ‘I Don’t Get Involved’",
    "description": "Trump on Monday walked back his previous support for releasing video footage of the attack.",
    "link": "https://www.forbes.com/sites/saradorn/2025/12/09/trump-continues-to-distance-himself-from-controversial-venezuelan-drug-boat-strike-i-dont-get-involved/",
    "timestamp": "2025-12-09T15:45:48Z"
  },
  {
    "title": "US judge strikes down Trump order blocking wind energy projects",
    "description": "Federal judge declared January executive order unlawful, ruling in favor of a coalition of state attorneys general\nA federal judge on Monday struck down Donald Trump’s executive order blocking wind energy projects, saying the effort to halt virtually all leas…",
    "link": "https://biztoc.com/x/a10a6c5b70714f87",
    "timestamp": "2025-12-09T15:42:51Z"
  },
  {
    "title": "Map Shows Possible Targets as Trump Weighs Land Strikes in Venezuela",
    "description": "As President Donald Trump has declined to rule out sending American troops into Venezuela, a map by Newsweek shows the military sites that could be targets amid a U.S. military buildup in the Caribbean that has set the region on edge.\nWhen asked by Politico w…",
    "link": "https://biztoc.com/x/d0dc2bb2527e10c1",
    "timestamp": "2025-12-09T15:42:46Z"
  },
  {
    "title": "Trump says Nvidia can sell more powerful AI chips to China",
    "description": "Nvidia has received White House approval to start exporting its H200 AI GPU chips to “approved customers” in China and other countries, according to President Donald Trump. In a Truth Social post on Monday, Trump said the deal comes with “conditions that allo…",
    "link": "https://biztoc.com/x/edd07ec626961c87",
    "timestamp": "2025-12-09T15:42:42Z"
  },
  {
    "title": "U.S. Job Openings Barely Budged In October, Coming In Just Below 7.7 Million",
    "description": "Americans are feeling the economic uncertainty the second Trump administration has brought.",
    "link": "https://www.huffpost.com/entry/ap-us-job-openings_n_6938423fe4b0642af12f55de",
    "timestamp": "2025-12-09T15:42:26Z"
  },
  {
    "title": "Donald Trump Pennsylvania Rally: When Is It and How to Watch",
    "description": "The rally is part of a broader push highlighting his administration's efforts to address affordability concerns.",
    "link": "https://biztoc.com/x/08d181bf978cb1c6",
    "timestamp": "2025-12-09T15:42:21Z"
  },
  {
    "title": "How Corporate Democrats Made Trump Possible: A 10-Year Timeline",
    "description": "Ten years after Donald Trump first ran for president, he stands at the helm of Titanic America. How did this happen?No factors were more pivotal than the outlooks and actions of the Democratic Party leadership. Scrutinizing them now is vital not only for clar…",
    "link": "https://www.commondreams.org/opinion/corporate-democrats-made-trump-possible-timeline",
    "timestamp": "2025-12-09T15:41:43Z"
  },
  {
    "title": "If FIFA Doesn't Want People To Think It's Corrupt, It Should Stop Doing Things That Look Corrupt",
    "description": "FIFA has long looked corrupt in its business dealings off the field. But now that corruption is seemingly seeping onto the field, too.",
    "link": "https://reason.com/2025/12/09/if-fifa-doesnt-want-people-to-think-its-corrupt-it-should-stop-doing-things-that-look-corrupt/",
    "timestamp": "2025-12-09T15:39:30Z"
  },
  {
    "title": "Nigeria, US agric trade to hit over $700m – Official",
    "description": "US-Nigeria agricultural trade is set to double, exceeding $700m by 2025. This growing partnership supports farmers and businesses in both countries.\n\nRead More: https://punchng.com/nigeria-us-agric-trade-to-hit-over-700m-official/",
    "link": "https://punchng.com/nigeria-us-agric-trade-to-hit-over-700m-official/",
    "timestamp": "2025-12-09T15:37:25Z"
  },
  {
    "title": "The US gov shut down a $160 million smuggling operation trying to get Nvidia H200 chips into China and also, err, says the GPUs won't be restricted anymore",
    "description": "There'll be 25% fee, though.",
    "link": "https://www.pcgamer.com/hardware/the-us-gov-shut-down-a-usd160-million-smuggling-operation-trying-to-get-nvidia-h200-chips-into-china-and-also-err-says-the-gpus-wont-be-restricted-anymore/",
    "timestamp": "2025-12-09T15:37:08Z"
  },
  {
    "title": "Here Are the Cable News Ratings for November 2025",
    "description": "Fox News remained the most-watched cable network.",
    "link": "https://www.adweek.com/tvnewser/here-are-the-cable-news-ratings-for-november-2025/",
    "timestamp": "2025-12-09T15:35:27Z"
  },
  {
    "title": "U.S. judge grants request to release records of Ghislaine Maxwell sex trafficking case",
    "description": "A U.S. judge on Tuesday granted a request by the Justice Department to make public grand jury documents in the case involving Jeffrey Epstein associate Ghislaine Maxwell, who is in prison for sex trafficking.",
    "link": "https://www.cbc.ca/news/world/judge-release-epstein-grand-jury-documents-9.7008577",
    "timestamp": "2025-12-09T15:35:09Z"
  },
  {
    "title": "The Supreme Court Is Poised to Give the “Apprentice” Star the Right to Fire the Regulators",
    "description": "Elie Mystal\n\n\n\nDuring oral arguments, the conservative justices made clear that they intend to allow Trump to fire FTC commissioner Rebecca Slaughter—and reorder the separation of powers.\r\n\n\r\n\n\nThe post The Supreme Court Is Poised to Give the “Apprentice” Sta…",
    "link": "https://www.thenation.com/article/politics/supreme-court-ftc-slaughter/",
    "timestamp": "2025-12-09T15:33:53Z"
  },
  {
    "title": "VIDEO: Politico's Dasha Burns Risks Job by AGREEING With Trump on Immigration",
    "description": "VIDEOIs Dasha Burns of Politico planning on doing what many non-narrative journalists have already done and go independent? The question has to be asked because during her newly released interview with President Donald Trump she AGREED with him on immigration…",
    "link": "https://freerepublic.com/focus/f-bloggers/4356618/posts",
    "timestamp": "2025-12-09T15:33:34Z"
  },
  {
    "title": "'Weak' and 'decaying': Donald Trump gives withering verdict on European allies",
    "description": "Donald Trump's bruising assessment of Europe as \"weak\" and \"decaying\" is a bitter blow to nations already reeling from the release of his national security strategy.",
    "link": "https://news.sky.com/story/weak-and-decaying-donald-trump-gives-withering-verdict-on-european-allies-13481367",
    "timestamp": "2025-12-09T15:32:00Z"
  },
  {
    "title": "Trump criticises 'weak' and 'decaying' Europe as he lashes out at immigration",
    "description": "The US president criticises Europe's \"weak\" leaders and claims EU nations are \"decaying\" due to immigration.",
    "link": "https://www.abc.net.au/news/2025-12-10/trump-criticises-european-leaders-as-weak/106122876",
    "timestamp": "2025-12-09T15:30:13Z"
  },
  {
    "title": "Jasmine Crockett for US Senate",
    "description": "Some thought they could never come up with a worse candidate than the leftist dorkazoid hipster Robert Francis “Beto” O’Rourke. Texas Democrats sink to the challenge: Jasmine Crockett launched a campaign Monday for the U.S. Senate in Texas, telling President …",
    "link": "https://moonbattery.com/jasmine-crockett-for-us-senate/",
    "timestamp": "2025-12-09T15:29:41Z"
  },
  {
    "title": "Feds bust nefarious plot to ship Nvidia H200s to China and hurt US",
    "description": "As Trump gives green light to ship Nvidia H200s to China and boost US\nThree US-based businessmen face potential prison sentences after authorities dismantled a smuggling network accused of funneling hundreds of millions of dollars worth of Nvidia GPUs to Chin…",
    "link": "https://www.theregister.com/2025/12/09/feds_bust_nefarious_plot_to/",
    "timestamp": "2025-12-09T15:28:54Z"
  },
  {
    "title": "Netflix to Own Disney World? Streaming Service Bids for The ENTIRE Walt Disney Company",
    "description": "The streaming wars have reached a new level of intensity, and the behind-the-scenes maneuvering is even more dramatic than anyone realized. Netflix, the company that revolutionized how we consume entertainment and forced traditional media giants to completely…",
    "link": "https://insidethemagic.net/2025/12/netflix-to-own-disney-world-streaming-service-bids-for-the-entire-walt-disney-company-ad1/",
    "timestamp": "2025-12-09T15:28:35Z"
  },
  {
    "title": "12 FBI agents fired for kneeling during racial justice protest sue to get their jobs back",
    "description": "Twelve former FBI agents fired after kneeling during a 2020 racial justice protest in Washington sued Monday to get their jobs back, saying their action had been intended to de-escalate a volatile situation and was not meant as a political gesture. The agents…",
    "link": "https://freerepublic.com/focus/f-news/4356615/posts",
    "timestamp": "2025-12-09T15:27:25Z"
  },
  {
    "title": "ROOKE: Somali Scam Unknowingly Answers America’s Most Uncomfortable Question",
    "description": "The Somali scam is now a flashpoint that's forced America to confront whether or not a nation can prioritize its own citizens without being labeled xenophobic.",
    "link": "https://dailycaller.com/2025/12/09/somalia-scam-scandal-billions-trump-ilhan-omar-minnesota-tim-walz-fraud-welfare-laundering/",
    "timestamp": "2025-12-09T15:27:00Z"
  },
  {
    "title": "COP30 in Brazil Marked Again by Tensions Over Methods to Address Climate Change",
    "description": "This gathering issued a comprehensive program for preserving the planet, yet the United States continues to sabotage efforts to curb global warming since it rejects the scientific data pointing to a deteriorating environment around the world\n***\nBrazil hosted…",
    "link": "https://www.globalresearch.ca/cop30-brazil-methods-address-climate-change/5908341",
    "timestamp": "2025-12-09T15:26:53Z"
  },
  {
    "title": "Jimmy Kimmel Says Donald Trump Might Have a Crush on Him",
    "description": "Jimmy Kimmel is \"the one who got away\" for Donald Trump ... according to a joke the late-night host made at the president's expense Monday night. As you know ... Trump has been in an ongoing battle with Kimmel, rejoicing when \"Jimmy Kimmel Live!\"…\n Permalink",
    "link": "https://www.tmz.com/2025/12/09/jimmy-kimmel-says-donald-trump-crush/",
    "timestamp": "2025-12-09T15:26:24Z"
  },
  {
    "title": "Hillary Clinton Allegedly 'Finished' With Bill: Ex-POTUS 'Going Down' As Epstein Scandal Explodes, Facing New Orders",
    "description": "The Clinton marriage is said to be on the brink of a $90M divorce as the Epstein scandal explodes. Hillary is reportedly considering flipping on Bill amid new deposition orders and an explosive email revelation.",
    "link": "https://www.ibtimes.com/hillary-clinton-allegedly-finished-bill-ex-potus-going-down-epstein-scandal-explodes-facing-3792182",
    "timestamp": "2025-12-09T15:26:06Z"
  },
  {
    "title": "Trump Again Claims Maduro's Days 'Are Numbered' As Reports Claim He Believes He Can Wait Out Washington's Pressure Campaign",
    "description": "President Donald Trump again said Venezuela's authoritarian leader Nicolas Maduro's days ruling the country are numbered, even as he reportedly believes he can wait out Washington's pressure campaign.",
    "link": "https://www.ibtimes.com/trump-again-claims-maduros-days-are-numbered-reports-claim-he-believes-he-can-wait-out-3792180",
    "timestamp": "2025-12-09T15:25:05Z"
  },
  {
    "title": "As Pope Leo's MAGA criticism builds, Trump suggests he'd meet Catholic leader (Seb Starcevic/Politico)",
    "description": "Seb Starcevic / Politico:\nAs Pope Leo's MAGA criticism builds, Trump suggests he'd meet Catholic leader  —  The American pontiff has rebuked the White House over its treatment of immigrants and the potential invasion of Venezuela.  —  U.S. President Donald Tr…",
    "link": "https://www.memeorandum.com/251209/p46",
    "timestamp": "2025-12-09T15:25:01Z"
  },
  {
    "title": "UN urges new approach to solving multiple environmental problems at once",
    "description": "The world needs a new approach to environmental crises threatening the health of people and the planet by adopting policies to jointly tackle climate change, biodiversity loss, land degradation and pollution, according to a UN report released Tuesday.",
    "link": "https://www.cbc.ca/news/climate/un-environment-report-9.7008478",
    "timestamp": "2025-12-09T15:24:23Z"
  },
  {
    "title": "Jimmy Kimmel Signs 12-Month Contract Extension with Disney’s ABC",
    "description": "Jimmy Kimmel, the late night host who was suspended by ABC over comments he made after the deadly shooting of conservative activist Charlie Kirk, has signed a one-year contract extension through May 2027.\nThe post Jimmy Kimmel Signs 12-Month Contract Extensio…",
    "link": "https://www.breitbart.com/entertainment/2025/12/09/jimmy-kimmel-signs-12-month-contract-extension-with-disneys-abc/",
    "timestamp": "2025-12-09T15:23:14Z"
  },
  {
    "title": "Jasmine Crockett Lets 1 Nemesis Do All The Talking In Senate Ad, And It’s Powerful",
    "description": "The Texas congressperson let her silence be golden as she announced her run for higher office.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-trump-insults-senate-ad_n_693826fbe4b013f1f7d3105c",
    "timestamp": "2025-12-09T15:22:14Z"
  }
]