[
  {
    "title": "Here's the grim truth about Trump's State of the Union",
    "description": "As I considered what to write about Donald Trump’s State of the Union address at the U.S. Capitol tonight, one question nagged: why call it a State of the Union at all? The phrase implies an assessment of the country as it is. What we’ll hear will be a bombas…",
    "link": "https://www.rawstory.com/raw-investigates/trump-state-of-the-union-2675300829/",
    "timestamp": "2026-02-24T10:30:02Z"
  },
  {
    "title": "The Looming Chaos of Tariff Refunds",
    "description": "Companies, consumers, and hedge funds all want a piece of the revenue from the tariffs the Supreme Court invalidated. That will create unnecessary economic damage.\nThe post The Looming Chaos of Tariff Refunds appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/24/looming-chaos-trump-tariff-refunds/",
    "timestamp": "2026-02-24T10:30:00Z"
  },
  {
    "title": "This South Texas region flipped for Trump. Now it's seeing red over his immigration policies.",
    "description": "More than a year since President Donald Trump flipped the traditionally Democratic Rio Grande Valley, his deportation agenda is running headlong into the region’s workforce.",
    "link": "https://www.nbcnews.com/news/us-news/texas-trump-vote-immigration-raids-rio-grande-valley-workers-rcna259790",
    "timestamp": "2026-02-24T10:30:00Z"
  },
  {
    "title": "Iran edges towards high-speed missile deal with China",
    "description": "Iran is close to finalising a deal with China to acquire advanced CM-302 supersonic anti-ship missiles, a move that could significantly boost Tehran’s naval strike capability and threaten United States forces in the region. Negotiations, underway for at least…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-edges-towards-high-speed-missile-deal-with-china/articleshow/128747963.cms",
    "timestamp": "2026-02-24T10:28:00Z"
  },
  {
    "title": "North Korea's Kim Jong-un re-elected General Secretary of Workers' Party",
    "description": "North Korea's Kim Jong-un is re-elected by Congress as the General Secretary of the country's ruling Workers' Party for the third time.",
    "link": "https://www.globalsecurity.org/wmd/library/news/dprk/2026/dprk-260223-presstv01.htm",
    "timestamp": "2026-02-24T10:27:28Z"
  },
  {
    "title": "Rupee declines 6 paise to settle at 90.95 against US dollar",
    "description": "A sharp fall in domestic equity markets and uncertainties over the India-US trade deal further pressured the local unit, while foreign fund inflows lent some support, forex traders said",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-declines-6-paise-to-settle-at-9095-against-us-dollar/article70670796.ece",
    "timestamp": "2026-02-24T10:27:14Z"
  },
  {
    "title": "Jared Kushner's Father Punished By France Over Trump Admin Remarks On Activist's Death",
    "description": "France has decided to revoke government access to U.S. Ambassador Charles Kushner, the father of President Donald Trump's son-in-law, Jared Kushner, after he \"did not appear\" when he was summoned over comments made by the U.S. administration about the death o…",
    "link": "https://crooksandliars.com/2026/02/jared-kushners-father-punished-france-over",
    "timestamp": "2026-02-24T10:27:11Z"
  },
  {
    "title": "Report: Even with aircraft carriers, US strikes could only last a few days",
    "description": "Israeli assessment says US could sustain only days of intense strikes on Iran despite additional carrier deployment",
    "link": "https://www.israelnationalnews.com/news/422907",
    "timestamp": "2026-02-24T10:26:56Z"
  },
  {
    "title": "Taiwan arms sales reported in limbo spark speculation of possibility of delay, triggering concerns from island media about being abandoned by the US",
    "description": "US media recently reported that as the US government weighs stabilizing relations with China, a major arms sale to Taiwan island has fallen into limbo. The reports have reignited speculation in the Taiwan island over possibility of \"US abandoning Taiwan islan…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2026/taiwan-260223-globaltimes01.htm",
    "timestamp": "2026-02-24T10:26:47Z"
  },
  {
    "title": "Iran to US: Sanctions and war failed; try diplomacy and respect",
    "description": "A top Iranian diplomat says the time is ripe for the United States to abandon its \"fruitless\" sanctions and failed policy of war against Iran, urging genuine respect for diplomacy as the only viable path forward.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260223-presstv03.htm",
    "timestamp": "2026-02-24T10:26:47Z"
  },
  {
    "title": "Why and how an Iran-US nuclear agreement may be possible?",
    "description": "A few days before the third round of negotiations, all signs indicate that the path ahead is difficult but passable. If Tehran and Washington can draft a principled framework for agreement that respects red lines, guarantees the peaceful nature of Iran's nucl…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260223-irna03.htm",
    "timestamp": "2026-02-24T10:26:47Z"
  },
  {
    "title": "Greenland leader rejects Trump's idea of sending U.S. hospital ship",
    "description": "Greenlandic Prime Minister Jens-Frederik Nielsen said on Sunday that the autonomous territory of Denmark is not interested in receiving a U.S. hospital ship that U.S. President Donald Trump wants to send to the island.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260224-pdo01.htm",
    "timestamp": "2026-02-24T10:26:47Z"
  },
  {
    "title": "No negotiation based on pre-judgment will bear results: Iran Foreign Ministry",
    "description": "Foreign Ministry spokesperson Esmaeil Baqaei, commenting on the ongoing nuclear talks between Iran and the United States, has stressed that any negotiation initiated on the basis of imposed pre-judgment will not yield results.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260223-irna06.htm",
    "timestamp": "2026-02-24T10:26:47Z"
  },
  {
    "title": "Nouri al-Maliki vows not to withdraw bid for Iraq's premiership despite US threats",
    "description": "Nouri al-Maliki, the former Iraqi prime minister nominated by the largest parliamentary bloc to return to office, says he will not withdraw his candidacy for the premiership despite US threats.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iraq/2026/iraq-260223-presstv01.htm",
    "timestamp": "2026-02-24T10:26:47Z"
  },
  {
    "title": "Trump says top general to lead potential strike on Iran \"if ordered\"",
    "description": "U.S. President Donald Trump said on Monday that Dan Caine, the chairman of the Joint Chiefs of Staff, will lead a potential strike on Iran if he is ordered to do so.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260224-pdo01.htm",
    "timestamp": "2026-02-24T10:26:47Z"
  },
  {
    "title": "Iran to Consider Even 'Limited Strike' by US as Act of Aggression - Foreign Ministry",
    "description": "Iran will consider even a \"limited strike\" by the United States as an act of aggression, Iranian Foreign Ministry spokesman Esmail Baghaei said on Monday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260223-sputnik01.htm",
    "timestamp": "2026-02-24T10:26:47Z"
  },
  {
    "title": "Ukraine Enters 5th Year Of Russia's Full-Scale War Amid Both Talks And Fighting",
    "description": "Ukraine has entered the fifth year of Russia's all-out invasion, the largest armed conflict in Europe since World War II, with its troops holding the line from grinding attacks in frozen trenches while its civilians face nightly mass drone and missile strikes…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260224-rferl01.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "In letter to Araghchi, Hamas outlines repeated Israeli violations of Gaza ceasefire",
    "description": "Hamas has provided a detailed report to Iran outlining repeated Israeli violations of the Gaza ceasefire agreement, urging mediators and the international community to compel Israel to fulfill its commitments under the deal.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260223-presstv08.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "Witkoff Says Trump 'Curious' Why Iran Hasn't 'Capitulated'",
    "description": "Washington's special envoy, Steve Witkoff, has said US President Donald Trump has questioned why Tehran has not \"capitulated\" in the face of a massive buildup of the US military near Iran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260223-rferl04.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "U.S. judge blocks release of report on Trump's classified documents case",
    "description": "A U.S. federal judge on Monday blocked the release of a report by former Special Counsel Jack Smith about President Donald Trump's alleged mishandling of classified documents following his first term.",
    "link": "https://www.globalsecurity.org/intell/library/news/2026/intell-260224-pdo01.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "Trump's top general warns of Iran aggression risks: reports",
    "description": "US media report that General Dan Caine, Chairman of the Joint Chiefs of Staff, has warned President Donald Trump against the myriad dangers associated with acts of aggression against Iran, including the high probability of a costly, long-term entanglement.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260224-presstv01.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "War risks mount in Middle East ahead of scheduled U.S.-Iran Geneva talks",
    "description": "While the United States and Iran are scheduled to resume talks on Thursday, there is little indication of de-escalation in their military standoff.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260224-pdo02.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "France blocks US ambassador from ministerial meetings after summons no-show",
    "description": "France has revoked Ambassador Charles Kushner's privilege of direct access to government members as a direct retaliation for Kushner's decision to skip a mandatory meeting with the Foreign Ministry to address US comments regarding the death of a 23-year-old F…",
    "link": "https://www.globalsecurity.org/wmd/library/news/france/2026/france-260223-presstv01.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "Iranian Students Reignite Anti-Government Protests For Third Day",
    "description": "Iranian students held anti-government protests at several universities for the third consecutive day, according to videos published online and verified by RFE/RL.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260223-rferl03.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "Greenland's Prime Minister on Trump Sending Hospital Ship to Island: 'No, Thanks'",
    "description": "Greenland's Prime Minister Jens-Frederik Nielsen dismissed US President Donald Trump's idea of sending a hospital ship to the island, calling on the United States to engage in dialogue instead of posting \"random comments\" on social media.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260223-sputnik01.htm",
    "timestamp": "2026-02-24T10:25:41Z"
  },
  {
    "title": "U.S. has breached trade deal and Europe is ready to retaliate, top trade lawmaker tells CNBC",
    "description": "The U.S. has breached the terms of its trade deal with the European Union \"several times,\" top EU trade lawmaker Bernd Lange told CNBC.",
    "link": "https://www.cnbc.com/2026/02/24/us-eu-trade-deal-eu-parliament-suspends-trade-deal-trump-tariffs-eu-retaliation-aci.html",
    "timestamp": "2026-02-24T10:24:26Z"
  },
  {
    "title": "Trump team on damage control after Huckabee comments on Israel (Felicia Schwartz/Politico)",
    "description": "Felicia Schwartz / Politico:\nTrump team on damage control after Huckabee comments on Israel … Huckabee's interview has sparked outrage among Arab and Muslim countries, and his comments were a significant departure from the Trump administration's stance on Isr…",
    "link": "https://www.memeorandum.com/260224/p7",
    "timestamp": "2026-02-24T10:20:00Z"
  },
  {
    "title": "‘Don’t be mad because America won’ – Dressing-room beer spray sparks debate over FBI director’s use of US resources",
    "description": "When the American men's hockey team retreated to their dressing room to celebrate their Winter Olympics gold medal win, they were joined by a special guest from the United States: FBI Director Kash Patel.",
    "link": "https://www.independent.ie/world-news/north-america/dont-be-mad-because-america-won-dressing-room-beer-spray-sparks-debate-over-fbi-directors-use-of-us-resources/a1096632745.html",
    "timestamp": "2026-02-24T10:19:00Z"
  },
  {
    "title": "Russian Ambassador to “N”: Moscow is open for an equal and mutually beneficial dialogue",
    "description": "Four years have passed since the start of the Russian invasion of Ukraine, and there is no end in sight.\nThe conflict in Ukraine has now lasted longer than the…\nRussian Ambassador to “N”: Moscow is open for an equal and mutually beneficial dialogue - Η ΝΑΥΤΕΜ…",
    "link": "https://www.naftemporiki.gr/english/2076440/russian-ambassador-to-n-moscow-is-open-for-an-equal-and-mutually-beneficial-dialogue/",
    "timestamp": "2026-02-24T10:18:57Z"
  },
  {
    "title": "Ukraine and Russia ravaged by 4 years of full-scale war without an ending in sight",
    "description": "After another year of talks, a war-ending deal remains frustratingly elusive.",
    "link": "https://abcnews.com/International/ukraine-russia-ravaged-4-years-full-scale-war/story?id=130402979",
    "timestamp": "2026-02-24T10:18:57Z"
  },
  {
    "title": "Wide Boundary News: Biodiversity Depletion, Iran & the Strait of Hormuz, and the Green Wedge",
    "description": "This week’s Frankly is another edition of Nate’s Wide Boundary News series, where he invites listeners to view the constant churn of headlines through a wider-boundary lens. Today’s edition features reflections on renewable energy and CO2 emission trends, upd…",
    "link": "https://www.resilience.org/stories/2026-02-24/wide-boundary-news-biodiversity-depletion-iran-the-strait-of-hormuz-and-the-green-wedge/",
    "timestamp": "2026-02-24T10:18:07Z"
  },
  {
    "title": "France bans US ambassador Charles Kushner from meeting French ministers",
    "description": "Father of Donald Trump’s son-in-law ignored summons over comments on far-right activist’s killing",
    "link": "https://www.irishtimes.com/world/europe/2026/02/24/france-bans-us-ambassador-charles-kushner-from-meeting-french-ministers/",
    "timestamp": "2026-02-24T10:16:47Z"
  },
  {
    "title": "Controversial US envoy's nomination removed, says report",
    "description": "PETALING JAYA: Controversial conservative influencer Nick Adams's nomination as the US ambassador has been removed. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/02/24/controversial-us-envoy039s-nomination-removed-says-report",
    "timestamp": "2026-02-24T10:16:00Z"
  },
  {
    "title": "World shares are mixed after heavy selling of potential AI losers hits Wall Street",
    "description": "A report by Citrini Research outlined a future scenario in which AI's dominance caused the “human-centric consumer economy,” to wither away with dire consequences for employment",
    "link": "https://www.thehindubusinessline.com/markets/world-shares-are-mixed-after-heavy-selling-of-potential-ai-losers-hits-wall-street/article70670734.ece",
    "timestamp": "2026-02-24T10:13:20Z"
  },
  {
    "title": "Supreme Court justices will be at Trump's SOTU. Will sparks be flying?",
    "description": "President Trump's State of the Union speech could be an awkward night for the Supreme Court justices who struck down his sweeping tariffs.",
    "link": "https://www.usatoday.com/story/news/politics/2026/02/24/supreme-court-justice-trump-state-of-the-union/88832125007/",
    "timestamp": "2026-02-24T10:09:13Z"
  },
  {
    "title": "US Must Pressure Russia Over Ukraine to Advance Peace, EU Says",
    "description": "The US strategy of pressuring Ukraine in peace talks is failing, the European Union’s top diplomat said, arguing that President Donald Trump should instead lean on Russia.",
    "link": "https://financialpost.com/pmn/business-pmn/us-must-pressure-russia-over-ukraine-to-advance-peace-eu-says",
    "timestamp": "2026-02-24T10:06:14Z"
  },
  {
    "title": "DAN GAINOR: Trump defeated the press like David smacked Goliath. Can they recover?",
    "description": "Liberal media loses influence as President Donald Trump defeats press opponents through lawsuits and industry upheaval affecting major news organizations.",
    "link": "https://www.foxnews.com/opinion/dan-gainor-trump-defeated-press-like-david-smacked-goliath-can-recover",
    "timestamp": "2026-02-24T10:00:21Z"
  },
  {
    "title": "Trump delivers 2026 State of the Union address | CNN Politics",
    "description": "President Donald Trump is giving his 2026 State of the Union address to a joint session of Congress. Follow for live updates",
    "link": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026",
    "timestamp": "2026-02-24T10:00:16Z"
  },
  {
    "title": "What the Possibility of War Is Like for an Iranian-American",
    "description": "The convergence of the two authoritarian republics is unmistakable.\nThe post What the Possibility of War Is Like for an Iranian-American appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/24/iran-war-trump-tehran-iranian-american-middle-east/",
    "timestamp": "2026-02-24T10:00:00Z"
  },
  {
    "title": "The State of the Union Will Be Even Worse Than Trump’s Polling Numbers",
    "description": "Jeet Heer\n\n\n\nWhat’s a flopping demagogue to do? Lash out at his enemies, pretend he’s doing great, and bore us all into submission.\r\n\n\r\n\n\nThe post The State of the Union Will Be Even Worse Than Trump’s Polling Numbers appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=588172",
    "timestamp": "2026-02-24T10:00:00Z"
  },
  {
    "title": "Trump Angered by Fresh Slide in Polls as Even Fox Admits He’s Tanking",
    "description": "A new CNN poll finds Donald Trump’s approval at an abysmal 36 percent. And a Washington Post survey finds him absolutely tanking on just about all major issues. But to Trump, this cannot be real: He just issued an angry, rambling tirade about how such polls a…",
    "link": "https://newrepublic.com/article/206948/trump-angered-fresh-slide-polls-even-fox-admits-he-tanking",
    "timestamp": "2026-02-24T10:00:00Z"
  },
  {
    "title": "Recognizing Failure, Some Liberals Are Reshaping Their Climate Messaging",
    "description": "The left has been enslaved to their climate change dogma for decades. As such, they’re not ready to give it up entirely. But they are trying to craft a new message – “affordability” – around a tired old issue. Apparently, you can’t teach an old dog new tricks…",
    "link": "https://wattsupwiththat.com/2026/02/24/recognizing-failure-some-liberals-are-reshaping-their-climate-messaging/",
    "timestamp": "2026-02-24T10:00:00Z"
  },
  {
    "title": "Trump heads into the State of the Union facing diminished voter trust on the economy",
    "description": "President Donald Trump has spoken before Congress plenty of times.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-heads-state-union-facing-diminished-voter-trust-economy-rcna259972",
    "timestamp": "2026-02-24T10:00:00Z"
  },
  {
    "title": "As Rep. Julia Letlow runs for Senate, late disclosure of 210 stock trades draws scrutiny",
    "description": "U.S. Rep. Julia Letlow, who President Donald Trump has endorsed to be Louisiana’s next senator, did not follow a federal law that required her to report 210 individual stock trades over the past two years, according to a document she…",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/julia-letlow-stock-trades-congress/article_48bcbeee-8627-5af7-8c83-e08dd373ca9c.html",
    "timestamp": "2026-02-24T10:00:00Z"
  },
  {
    "title": "Why Gavin Newsom refuses to be a \"bystander\" in this political moment",
    "description": "What does the Democratic leader see for himself in the years to come?",
    "link": "https://www.npr.org/2026/02/24/nx-s1-5143015/why-gavin-newsom-refuses-to-be-a-bystander-in-this-political-moment",
    "timestamp": "2026-02-24T10:00:00Z"
  },
  {
    "title": "The Value of Critical Thinking: Humanities in a Technological Era",
    "description": "Often derided as worthless or a fast track to a lower income, the humanities promote the kind of critical thinking that’s needed even in an AI world.\nThe post The Value of Critical Thinking: Humanities in a Technological Era appeared first on Washington Month…",
    "link": "http://washingtonmonthly.com/2026/02/24/the-humanities-in-a-technological-era/",
    "timestamp": "2026-02-24T10:00:00Z"
  },
  {
    "title": "Who Deserves to Be a Citizen?",
    "description": "This obsession with citizenship, which began in the 1990s, surged after the terrorist attacks on September 11, 2001, and the subsequent War on Terror. Politicians charged that there were now citizens and terrorists, good and evil. The border had to",
    "link": "https://lithub.com/who-deserves-to-be-a-citizen/",
    "timestamp": "2026-02-24T09:58:17Z"
  },
  {
    "title": "'A band-aid on a serious wound': More student-loan borrowers are at risk of Social Security and tax refund seizures once Trump's pause lifts",
    "description": "Nearly 9 million student-loan borrowers are in default, and another one in four borrowers is behind on payments, a new report said.",
    "link": "https://www.businessinsider.com/student-loan-borrowers-default-social-security-tax-refunds-trump-pause-2026-2",
    "timestamp": "2026-02-24T09:57:01Z"
  },
  {
    "title": "Tesla’s Europe problem keeps getting worse. Here's why",
    "description": "Tesla's new car registrations fell 17% year-on-year in January, marking the 13th consecutive month in which sales have shrunk across Europe.",
    "link": "https://www.cnbc.com/2026/02/24/tesla-car-sales-elon-musk-europe-autos-trump-evs.html",
    "timestamp": "2026-02-24T09:56:37Z"
  },
  {
    "title": "Stephen Colbert Busts Trump In The Middle Of A Massive 'Golden' Hypocrisy",
    "description": "The \"Late Show\" host put the president on blast after he complained about the Supreme Court.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-supreme-court_n_699d6b36e4b01da50153245e",
    "timestamp": "2026-02-24T09:52:20Z"
  },
  {
    "title": "Specialized and Trek among major bike brands suing US government to recover Trump tariff costs following Supreme Court ruling",
    "description": "Numerous major names from across the bike industry have filed legal proceedings in the hope of receiving tariff rebates. This comes following the Supreme Court’s ruling that the Trump administration’s use of powers associated with wartime or national emergenc…",
    "link": "https://road.cc/news/specialized-and-trek-among-major-bike-brands-suing-us-government-to-recover-trump-tariff-costs-following-supreme-court-ruling",
    "timestamp": "2026-02-24T09:51:02Z"
  },
  {
    "title": "Specialized and Trek among major bike brands suing US government to recover Trump tariff costs following Supreme Court ruling",
    "description": "Numerous major names from across the bike industry have filed legal proceedings in the hope of receiving tariff rebates. This comes following the Supreme Court’s ruling that the Trump administration’s use of powers associated with wartime or national emergenc…",
    "link": "https://road.cc/news/specialized-trek-major-bike-brands-suing-us-government-trump-tariffs",
    "timestamp": "2026-02-24T09:51:02Z"
  },
  {
    "title": "These data center developers asked Trump for an exemption from pollution rules",
    "description": "Though the companies weren't granted exemptions, their requests illustrate the data center industry's desperate quest for energy.",
    "link": "https://grist.org/regulation/these-data-center-developers-asked-trump-for-an-exemption-from-pollution-rules/",
    "timestamp": "2026-02-24T09:45:00Z"
  },
  {
    "title": "'Groundhog day' for Irish exporters amid tariff 'chaos'",
    "description": "A \"Groundhog Day without the comedy\". This is how the CEO of Irish Exporters Association described the renewed \"chaos\" of new US tariffs.",
    "link": "https://www.rte.ie/news/business/2026/0224/1560121-tariff-irish-exporters/",
    "timestamp": "2026-02-24T09:44:02Z"
  },
  {
    "title": "Trump Admits War Would Be Disastrous for Ordinary Iranians as He Weighs Military Assault",
    "description": "President Donald Trump admitted Monday that a US assault on Iran would be disastrous for the Middle East nation's people as he considers options for a military attack, reportedly drawing private warnings from the United States' top general.In a Truth Social p…",
    "link": "https://www.commondreams.org/news/trump-war-iranian-people",
    "timestamp": "2026-02-24T09:43:42Z"
  },
  {
    "title": "The Nowhere Box: Largest Area of the Human Mind",
    "description": "Do you remember how you felt during that embarrassing incident as a child? Or is the memory so painful that you unconsciously filed the embarrassment and other feelings associated with the incident in ‘the nowhere box’?\nThe post The Nowhere Box: Largest Area …",
    "link": "https://www.globalresearch.ca/nowhere-box-largest-area-human-mind/5916877",
    "timestamp": "2026-02-24T09:39:58Z"
  },
  {
    "title": "New US tariffs come in at lower 10% rate",
    "description": "Feb 24 : The United States imposed an additional tariff from Tuesday of 10 per cent on all goods not covered by exemptions, a notice issued by U.S. Customs and Border Protection said, the rate initially announced by President Donald Trump on Friday rather tha…",
    "link": "https://www.channelnewsasia.com/business/new-us-tariffs-come-in-lower-10-rate-5949371",
    "timestamp": "2026-02-24T09:35:24Z"
  },
  {
    "title": "Coinbase USDC revenue could 7x as payments grow, Bloomberg says",
    "description": "Bloomberg Intelligence says Coinbase’s USDC revenues could jump as much as sevenfold, as Congress weighs a ban on stablecoin rewards that could reshape how that money is earned.",
    "link": "https://cointelegraph.com/news/coinbase-usdc-revenue-could-7x-as-payments-grow-bloomberg-says",
    "timestamp": "2026-02-24T09:35:11Z"
  },
  {
    "title": "We, the illegals of France",
    "description": "France’s mass deportation orders reveal how colonial logics persist in migration policy, turning former subjects into administrative problems to be expelled.",
    "link": "https://africasacountry.com/2026/02/we-the-illegals-of-france/",
    "timestamp": "2026-02-24T09:30:15Z"
  },
  {
    "title": "Democrats counter Trump's proposal to limit institutional housing investors",
    "description": "A new bill from Sen. Elizabeth Warren targets investors who own 50-plus single-family homes, and breaks with a White House proposal.",
    "link": "https://www.cnbc.com/2026/02/24/warren-trump-housing-investment-ban-affordability.html",
    "timestamp": "2026-02-24T09:30:02Z"
  },
  {
    "title": "Zelensky marks war anniversary vowing to fight on, says Putin ‘has not achieved his goals’",
    "description": "Ukraine will not betray the sacrifices made by its people in four years of war just to make peace with Russia, President Volodymyr Zelensky vowed on Tuesday, as divisions among his key allies overshadowed commemorations of the start of the conflict.",
    "link": "https://nypost.com/2026/02/24/world-news/zelensky-marks-war-anniversary-vowing-to-fight-on-says-putin-has-not-achieved-his-goals/",
    "timestamp": "2026-02-24T09:28:46Z"
  },
  {
    "title": "'We have preserved Ukraine': Zelenskyy marks 4 years of Russia's war",
    "description": "Ukrainian President Volodymyr Zelenskyy marked the fourth anniversary of Russia's invasion of the country on Tuesday, saying \"We have defended our independence.\"",
    "link": "https://abcnews.com/International/preserved-ukraine-zelenskyy-marks-4-years-russias-war/story?id=130437123",
    "timestamp": "2026-02-24T09:26:09Z"
  },
  {
    "title": "이란 대규모 공습한다는 트럼프 패밀리 이란 창펑",
    "description": "TRUMP’S ‘BOARD OF PEACE’ EYES STABLECOIN FOR GAZAOfficials with Donald Trump’s “Board of Peace” are exploring a US-dollar–backed stablecoin to revive Gaza’s collapsed economy. The initiative, still in early stages, aims to enable digital transactions while li…",
    "link": "https://ryueyes11.tistory.com/512111",
    "timestamp": "2026-02-24T09:26:07Z"
  },
  {
    "title": "Randy Clark: Mexico President 100% Compelled by President Trump to Take Action Against El Mencho",
    "description": "Monday on “The Alex Marlow Show,” Breitbart News’ Randy Clark talked about drug cartels. Clark said, “I think she was 100% compelled by Donald Trump. … I don’t think she was really too upset about not taking a firm hand\nThe post Randy Clark: Mexico President …",
    "link": "https://www.breitbart.com/clips/2026/02/24/randy-clark-mexico-president-100-compelled-by-president-trump-to-take-action-against-el-mencho/",
    "timestamp": "2026-02-24T09:24:33Z"
  },
  {
    "title": "France's row with US ambassador heats up after meeting no-show",
    "description": "A row between Emmanuel Macron's government and the US ambassador to Paris has deepened after the American envoy ignored a summons to meet the French foreign minister.",
    "link": "https://news.sky.com/story/frances-row-with-us-ambassador-charles-kushner-heats-up-after-meeting-no-show-13511425",
    "timestamp": "2026-02-24T09:23:00Z"
  },
  {
    "title": "Trump Lashes Out At Jimmy Kimmel, Who Agrees On 1 Accidentally Accurate Point",
    "description": "The late night host found his name being used in another \"money grab\" attempt by the president.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-fundraising-email_n_699d4c71e4b0f7641da67df5",
    "timestamp": "2026-02-24T09:09:05Z"
  },
  {
    "title": "What to expect in Trump’s first State of the Union address since his return to the White House",
    "description": "<![CDATA[ Analysts say the US president will likely stick to themes that resonate more directly with voters at home. ]]>",
    "link": "https://www.channelnewsasia.com/world/usa-president-donald-trump-state-union-sotu-address-preview-5949066",
    "timestamp": "2026-02-24T09:05:20Z"
  },
  {
    "title": "'Putin will not stop': Zelenskyy warns world on 4th anniversary of Russia's invasion of Ukraine",
    "description": "Ukrainian President Volodymyr Zelenskyy delivered a stark message to the world on the fourth anniversary of Russia's relentless war against his country, warning allies not to turn away or become distracted by other conflicts, lest they be next to need help.",
    "link": "https://www.cbc.ca/news/world/zelenskyy-trump-russia-war-anniversary-support-9.7103150",
    "timestamp": "2026-02-24T09:00:00Z"
  },
  {
    "title": "Trump gives his State of the Union address tonight. Here's what to watch for",
    "description": "U.S. President Donald Trump delivers his State of the Union address tonight, and it comes with his approval ratings sinking as the crucial midterm elections approach.",
    "link": "https://www.cbc.ca/news/world/trump-state-of-the-union-address-watch-9.7102835",
    "timestamp": "2026-02-24T09:00:00Z"
  },
  {
    "title": "Trump Appears To Admit Something About His Support, Then Immediately Changes Tune",
    "description": "The president raised eyebrows with his \"real polls\" theory.",
    "link": "https://www.huffpost.com/entry/donald-trump-polls_n_699d5271e4b01da501531bb2",
    "timestamp": "2026-02-24T08:54:51Z"
  },
  {
    "title": "New US tariffs take effect after Supreme Court ruling",
    "description": "Fresh US tariffs on imported goods came into effect today, as President Donald Trump moved to rebuild his trade agenda after the Supreme Court ruled against a swath of his global duties.",
    "link": "https://www.rte.ie/news/business/2026/0224/1560104-new-us-tariffs-take-effect-after-supreme-court-ruling/",
    "timestamp": "2026-02-24T08:53:40Z"
  },
  {
    "title": "US ambassador to France denied access to government",
    "description": "Washington's ambassador to Paris, Charles Kushner, has been denied direct access to French government members after he failed to attend a Foreign Ministry summons.",
    "link": "https://www.dw.com/en/us-ambassador-to-france-denied-access-to-government/a-76099775",
    "timestamp": "2026-02-24T08:48:00Z"
  },
  {
    "title": "S&P/ASX 200 closes lower as Australian shares struggle for momentum amid tariff tensions and suspense over inflation data; check top gainers and losers",
    "description": "The Australian sharemarket saw the S&P/ASX 200 close lower on Tuesday. Heavyweight banks faced losses, while miners saw gains. Investors watched for domestic data and trade deal clarity. Top gainers included Liontown Limited and Viva Energy Group Limited. ARB…",
    "link": "https://economictimes.indiatimes.com/news/international/australia/sp/asx-200-closes-lower-as-australian-shares-struggle-for-momentum-amid-tariff-tensions-and-suspense-over-inflation-data-check-top-gainers-and-losers/articleshow/128745583.cms",
    "timestamp": "2026-02-24T08:47:35Z"
  },
  {
    "title": "SCOTUS ruling against tariffs is unlikely to mean an end to trade policy chaos",
    "description": "The Supreme Court’s stunning rebuke of President Donald Trump’s most sweeping tariffs means he can’t conjure up new import taxes on a whim anymore",
    "link": "https://abcnews.com/Politics/wireStory/supreme-court-ruling-trumps-tariffs-end-trade-policy-130434774",
    "timestamp": "2026-02-24T08:47:11Z"
  },
  {
    "title": "Hong Kong protests after Panama takes control of 2 key ports on the Panama Canal",
    "description": "Hong Kong protests after Panama takes control of two key ports on the Panama Canal once run by a Hong Kong company",
    "link": "https://abcnews.com/International/wireStory/hong-kong-protests-after-panama-takes-control-2-130437551",
    "timestamp": "2026-02-24T08:43:51Z"
  },
  {
    "title": "Hungary and Slovakia Block New EU Sanctions against Russia",
    "description": "The EU failed to approve a fresh round of sanctions against Russia as Hungary and Slovakia, who accuse Ukraine of disrupting oil deliveries from Russia, halted the measures.",
    "link": "https://www.rigzone.com/news/wire/hungary_and_slovakia_block_new_eu_sanctions_against_russia-24-feb-2026-183054-article/",
    "timestamp": "2026-02-24T08:43:23Z"
  },
  {
    "title": "NASA chief rules out March launch of Moon mission over technical issues",
    "description": "Washington, United States (AFP) Feb 21, 2026\n\n\n NASA chief Jared Isaacman on Saturday ruled out a March launch for Artemis 2, the first crewed flyby mission to the Moon in more than 50 years, citing technical issues. \n\nWorkers detected a problem with helium f…",
    "link": "https://www.spacedaily.com/reports/NASA_chief_rules_out_March_launch_of_Moon_mission_over_technical_issues_999.html",
    "timestamp": "2026-02-24T08:42:37Z"
  },
  {
    "title": "Indonesia ready to step up role in Palestine peace: FM Sugiono",
    "description": "Foreign Minister Sugiono affirmed that Indonesia is ready to take a more active role in promoting a just and sustainable peace for Palestine, including ...",
    "link": "https://en.antaranews.com/news/405770/indonesia-ready-to-step-up-role-in-palestine-peace-fm-sugiono",
    "timestamp": "2026-02-24T08:42:09Z"
  },
  {
    "title": "‘Stupid, Self-Absorbed And Misogynistic’: Keith Olbermann Crashes Out About Team USA Hockey, President Trump Invite",
    "description": "You, me and 330 million Americans were in a state of absolute euphoria after the United States men's hockey team brought home the gold, but not Keith Olbermann.",
    "link": "https://dailycaller.com/2026/02/24/keith-olbermann-team-usa-mens-hockey-trump-invite/",
    "timestamp": "2026-02-24T08:37:32Z"
  },
  {
    "title": "CIA tip ‘instrumental’ in killing of Mexican drug lord – media",
    "description": "CIA intelligence was reportedly “instrumental” in Mexico’s takedown of drug kingpin El Mencho, the head of the Jalisco New Generation Cartel Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632951-cia-intelligence-mexico-kingpin/",
    "timestamp": "2026-02-24T08:30:49Z"
  },
  {
    "title": "Breaking Europe’s Trans-Atlantic Habit: The End of the Senior Partner Myth",
    "description": "When U.S. President Donald Trump floated the possibility of taking Greenland by force, European leaders reacted with outrage — and then, almost immediately, with relief once he backed down. Wolfgang Ischinger, the doyen of the Munich Security Conference, expr…",
    "link": "https://warontherocks.com/2026/02/breaking-europes-transatlantic-habit-the-end-of-the-senior-partner-myth/",
    "timestamp": "2026-02-24T08:15:39Z"
  },
  {
    "title": "Jon Stewart Dubs Kash Patel ‘Make-A-Wish Man’ for Partying With U.S. Hockey Team",
    "description": "Jon Stewart called Kash Patel \"Make-A-Wish Man\" for partying with the U.S. hockey team after their big Olympics win.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jon-stewart-kash-patel-us-hockey-team-the-daily-show-1235521497/",
    "timestamp": "2026-02-24T08:15:06Z"
  },
  {
    "title": "US women’s gold medal ice hockey team declines Trump’s State of the Union",
    "description": "Team has politely turned down an invitation from President Donald Trump to attend Tuesday's address in the capital.",
    "link": "https://www.aljazeera.com/sports/2026/2/24/us-womens-gold-medal-ice-hockey-team-declines-trumps-state-of-the-union",
    "timestamp": "2026-02-24T08:13:06Z"
  },
  {
    "title": "Team USA Women’s Hockey Stars Refuse White House Invite Following Trump’s Controversial Remark",
    "description": "\"Evidently, the women's team has more integrity than the men's team.”",
    "link": "https://www.boredpanda.com/team-usa-womens-hockey-stars-refuse-white-house-invite-following-trump-controversial-remark/",
    "timestamp": "2026-02-24T08:12:11Z"
  },
  {
    "title": "Editorial: Real progress on federal regulatory reform",
    "description": "President Donald Trump ran on a platform that included downsizing the bloated federal administrative state. He has more than delivered.",
    "link": "https://www.bostonherald.com/2026/02/24/editorial-real-progress-on-federal-regulatory-reform/",
    "timestamp": "2026-02-24T08:08:16Z"
  },
  {
    "title": "How the World Cup will disrupt clubs and the start of next season",
    "description": "Why changing the manager mid-season generally makes things worse The media sinks into the mud as Arsenal rise to the heights By Tony Attwood Most fellow Arsenal fans I know are feeling rather good about this season.   Yes we all know that the lead that we had…",
    "link": "https://untold-arsenal.com/archives/119603",
    "timestamp": "2026-02-24T08:01:54Z"
  },
  {
    "title": "Markets scramble to assess Trump tariff fallout",
    "description": "Business Digest: The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2026/02/24/markets-scramble-to-assess-trump-tariff-fallout-and-little-cheer-for-irish-house-buyers-or-renters/",
    "timestamp": "2026-02-24T08:01:42Z"
  }
]