[
  {
    "title": "Canada elections: A look at Mark Carney's promises amid anti-Trump wave and trade tensions with US",
    "description": "Canada has fixed Monday for federal elections. The former boss of England boss Mark Carney is fighting to stay in the job after calling a snap general election. The elections in Canada came after Justin Trudeau quit. The timing is crucial as Mark Carney is ri…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/canada-elections-a-look-at-mark-carneys-promises-amid-anti-trump-wave-and-trade-tensions-with-us/articleshow/120696674.cms",
    "timestamp": "2025-04-28T11:49:51Z"
  },
  {
    "title": "Science is being murdered in the USA, and we know who is doing it",
    "description": "You should know that the National Institutes of Health was the largest supporter of biomedical research in the world. It was huge. It wasn’t just a gigantic research complex located in Bethesda, it administered the funding for most of the biological research …",
    "link": "https://freethoughtblogs.com/pharyngula/2025/04/28/science-is-being-murdered-in-the-usa-and-we-know-who-is-doing-it/",
    "timestamp": "2025-04-28T11:49:37Z"
  },
  {
    "title": "Putin announces surprise Ukraine truce for May 8-10",
    "description": "Russian President Vladimir Putin has ordered a surprise three-day ceasefire from May 8-10, coinciding with Moscow's World War II Victory Day commemorations, the Kremlin said Monday.",
    "link": "https://www.hurriyetdailynews.com/putin-orders-surprise-three-day-ceasefire-in-may-208569",
    "timestamp": "2025-04-28T11:47:00Z"
  },
  {
    "title": "Global shares mostly gain as uncertainty over US tariffs persists",
    "description": "Global markets are mostly higher as investors wait to see what comes of U.S. tariffs.",
    "link": "https://www.bostonherald.com/2025/04/28/stock-market-uncertainty-us-tariffs/",
    "timestamp": "2025-04-28T11:46:01Z"
  },
  {
    "title": "Global shares mostly gain as uncertainty over US tariffs persists",
    "description": "Global markets are mostly higher as investors wait to see what comes of U.S. tariffs.",
    "link": "https://www.denverpost.com/2025/04/28/stock-market-uncertainty-us-tariffs/",
    "timestamp": "2025-04-28T11:46:01Z"
  },
  {
    "title": "A large-scale phishing campaign targets WordPress WooCommerce users",
    "description": "A large-scale phishing campaign targets WordPress WooCommerce users with a fake security alert urging them to download a ‘critical patch’ hiding a backdoor. Patchstack researchers uncovered a large-scale phishing campaign targeting WordPress WooCommerce users…",
    "link": "https://securityaffairs.com/177115/hacking/a-large-scale-phishing-campaign-targets-wordpress-woocommerce-users.html",
    "timestamp": "2025-04-28T11:43:54Z"
  },
  {
    "title": "Trump’s approval rating falls as immigration crackdown escalates",
    "description": "As new poll numbers show that the majority of Americans disapprove of how President Donald Trump is handling immigration, his administration is defending new deportations of families involving children who are allegedly U.S. citizens. Last week a 4-year-old w…",
    "link": "https://biztoc.com/x/45385b78b3eb6305",
    "timestamp": "2025-04-28T11:42:12Z"
  },
  {
    "title": "10 Australian Abattoirs Gain Access To Chinese Market As Demand Rises",
    "description": "Over the weekend, 10 Australian sheep and goat abattoirs received approval to enter the Chinese market for the first time, following a rigorous and lengthy approval process by Beijing.",
    "link": "https://www.ibtimes.com.au/10-australian-abattoirs-gain-access-chinese-market-demand-rises-1858303",
    "timestamp": "2025-04-28T11:42:12Z"
  },
  {
    "title": "Korea Development Bank to sell shares in Hanwha Ocean, paper reports",
    "description": "SEOUL :South Korea's state-run Korea Development Bank plans to sell its shares in Hanwha Ocean, Maeil Business Newspaper reported on Monday. KDB plans to split its 19.5 per cent shares in the shipbuilder into multiple block sales, after a bookbuilding from Mo…",
    "link": "https://www.channelnewsasia.com/business/korea-development-bank-sell-shares-hanwha-ocean-paper-reports-5094796",
    "timestamp": "2025-04-28T11:40:08Z"
  },
  {
    "title": "Managing On PLUTO: 5 Keys For Business In A New Geopolitical Era",
    "description": "For business leaders, the PLUTO scenario is Polarized, Liquid, Unilateral, Tense and Omni-relational.",
    "link": "https://www.forbes.com/sites/iese/2025/04/28/managing-on-pluto-5-keys-for-business-in-a-new-geopolitical-era/",
    "timestamp": "2025-04-28T11:39:24Z"
  },
  {
    "title": "Harvard Cannot Claim To Champion Academic Freedom While Yielding To The CCP",
    "description": "Harvard University is making significant academic concessions to align with the Chinese Communist Party, according to a new report.",
    "link": "https://thefederalist.com/2025/04/28/harvard-cannot-claim-to-champion-academic-freedom-while-yielding-to-the-ccp/",
    "timestamp": "2025-04-28T11:38:24Z"
  },
  {
    "title": "Russia announces 3-day ceasefire in Ukraine from May 8-10 amid Trump's peace efforts",
    "description": "The Kremlin announced a three-day ceasefire in Ukraine from May 8 to May 10, coinciding with Russia's Victory Day celebrations. This announcement follows increased efforts by U.S. President Donald Trump to facilitate a peace agreement in the conflict-ridden n…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-announces-3-day-ceasefire-in-ukraine-from-may-8-10-amid-trumps-peace-efforts/articleshow/120696574.cms",
    "timestamp": "2025-04-28T11:36:59Z"
  },
  {
    "title": "Why Paying Women To Have Babies Is A Terrible Idea — And What To Do Instead",
    "description": "Paying for babies doesn't work. But government could certainly stop making raising kids so expensive and undesirable.",
    "link": "https://thefederalist.com/2025/04/28/why-paying-women-to-have-babies-is-a-terrible-idea-and-what-to-do-instead/",
    "timestamp": "2025-04-28T11:36:25Z"
  },
  {
    "title": "Business Brief: Voting for our economic future",
    "description": "We will soon learn who Canada has chosen to lead us through these tumultuous times",
    "link": "https://www.theglobeandmail.com/business/article-business-brief-voting-for-our-economic-future/",
    "timestamp": "2025-04-28T11:34:56Z"
  },
  {
    "title": "Trump says he’ll eliminate income taxes. There’s a problem with that | CNN Business",
    "description": "President Donald Trump on Sunday night reiterated an extraordinary ambition he and members of his administration have voiced from time to time throughout his young second term: One day, Americans won’t pay any more income tax, and you’ll have Trump’s tariffs …",
    "link": "https://www.cnn.com/2025/04/28/business/taxes-trump-tariffs/index.html",
    "timestamp": "2025-04-28T11:34:55Z"
  },
  {
    "title": "Chuck Schumer Sent A Strongly Worded Letter To Donald. All Is Good Now!",
    "description": "With all of the chaos and unconstitutional, and frankly brutal, sadistic moves from the Trump administration, it's hard to catch your breath. But don't worry, because New York Senator Chuck Schumer, 74, is all over this. Everything will be better because Schu…",
    "link": "https://crooksandliars.com/2025/04/chuck-schumer-sent-strongly-worded-letter",
    "timestamp": "2025-04-28T11:34:51Z"
  },
  {
    "title": "Voters go to the polls today after a 35-day election campaign packed with promises",
    "description": "After a short, intense and heated election campaign of just 35 days, Canadians go to the polls today to elect a new federal government.",
    "link": "https://www.nationalobserver.com/2025/04/28/news/voters-go-polls-today-after-35-day-election-campaign-packed-promises",
    "timestamp": "2025-04-28T11:34:47Z"
  },
  {
    "title": "Voters head to the polls today after a 35-day election campaign packed with promises",
    "description": "After a short, intense and heated election campaign of just 35 days, Canadians go to the polls today to elect a new federal government.",
    "link": "https://www.nationalobserver.com/2025/04/28/news/voters-head-polls-today-after-35-day-election-campaign-packed-promises",
    "timestamp": "2025-04-28T11:34:47Z"
  },
  {
    "title": "Rainn Wilson: The media was like ‘La, la, la, la, la, everything’s fine’ about Biden",
    "description": "2024 was the year where I grew severely disillusioned by most mainstream and left-leaning media outlets. So many people on MSNBC are persona non grata to me, we no longer subscribe to the Washington Post and I will never forget what the Washington press corps…",
    "link": "https://www.celebitchy.com/919744/rainn_wilson_the_media_was_like_la_la_la_la_la_everythings_fine_about_biden/",
    "timestamp": "2025-04-28T11:34:44Z"
  },
  {
    "title": "Iran accuses Israel of seeking to disrupt nuclear talks with US",
    "description": "Israel reiterates demand Iran's nuclear programme be dismantled after Tehran and Washington report positive third round.",
    "link": "https://www.aljazeera.com/news/2025/4/28/iran-accuses-israel-of-seeking-to-disrupt-nuclear-talks-with-us",
    "timestamp": "2025-04-28T11:34:29Z"
  },
  {
    "title": "Putin Announces Ukraine Ceasefire May 8-10",
    "description": "The ceasefire is taking place on Russia&#039;s Victory Day on May 9th, which marks the end of the Second World War.",
    "link": "https://www.ndtv.com/world-news/putin-announces-ukraine-ceasefire-may-8-10-8277713",
    "timestamp": "2025-04-28T11:34:20Z"
  },
  {
    "title": "Vladimir Putin declares a three-day ceasefire in Ukraine",
    "description": "The Kremlin state its ceasefire in Ukraine will take place next month",
    "link": "https://www.ladbible.com/news/world-news/russia-ukraine-ceasefire-vladimir-putin-kremlin-may-037269-20250428",
    "timestamp": "2025-04-28T11:33:52Z"
  },
  {
    "title": "Putin announces surprise three-day ceasefire in Ukraine next week to coincide with VE Day",
    "description": "The Kremlin said Russia would respond to any “violations” of the ceasefire by Ukraine.",
    "link": "https://www.thejournal.ie/putin-announces-three-day-ceasefire-ukraine-6689800-Apr2025/",
    "timestamp": "2025-04-28T11:33:40Z"
  },
  {
    "title": "Several DAs Consider Charges Against Former Death Row Inmates With Commuted Sentences: Report",
    "description": "NBC News reported on Sunday that several district attorneys are considering, or have considered, state charges against some of the 37 men whose sentences Biden commuted.",
    "link": "https://www.huffpost.com/entry/district-attorneys-charges-death-row-biden_n_680ec4e2e4b0d60535dba9b5",
    "timestamp": "2025-04-28T11:33:14Z"
  },
  {
    "title": "‘I can’t find any help’: Employers scramble to solve worker shortages caused by immigration crackdowns",
    "description": "President Donald Trump recently said the government would seek to let some undocumented persons return to the country “if they’re good,” but he was scant on ...",
    "link": "https://www.hrdive.com/news/trump-worker-shortage-immigration-crackdown/746481/",
    "timestamp": "2025-04-28T11:32:00Z"
  },
  {
    "title": "Trump To Order Investigation Into ActBlue For Potentially Illegal Fundraising Methods",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | April 24, 2025\nPresident Donald Trump will sign a presidential memorandum Thursday launching an investigation into ActBlue for potentially illegal methods of fundraising for Democrats, The Daily Signal has le…",
    "link": "https://biztoc.com/x/d013216f6fce0f80",
    "timestamp": "2025-04-28T11:31:36Z"
  },
  {
    "title": "Trump demands free pass for ships crossing Panama, Suez canals",
    "description": "The News\nPresident Donald Trump demanded free transit for US ships crossing the Panama and Suez canals, arguing that the routes wouldn’t exist without Washington.\nTrump asked his secretary of state to “immediately take care” of the issue of US ships being cha…",
    "link": "https://biztoc.com/x/f330dc30d3d24abf",
    "timestamp": "2025-04-28T11:31:26Z"
  },
  {
    "title": "Chinese policy-makers downplay impact of Trump tariffs on economic recovery",
    "description": "Chinese policy-makers on Monday sought to assuage concerns the broad U.S. tariffs could derail efforts to shore up a fragile economic recovery, even as analysts warn the hefty levies raise the risk of a sharp downturn in growth. \nU.S. President Donald Trump’s…",
    "link": "https://biztoc.com/x/0de285799d154196",
    "timestamp": "2025-04-28T11:31:17Z"
  },
  {
    "title": "Foreign Policy Experts Warn Against Strike On Iran’s Nuke Facilities",
    "description": "By Jacob Adams, The Daily Signal | April 24, 2025\nSome lawmakers are calling for President Donald Trump to help Israel strike Iran’s nuclear facilities even as foreign policy experts warn about the potential consequences of such an action. \n“Ultimately, short…",
    "link": "https://biztoc.com/x/0f2569735c0ef903",
    "timestamp": "2025-04-28T11:31:08Z"
  },
  {
    "title": "Trump threats boosted Canada’s Carney, hurt Conservatives as country votes for new leader",
    "description": "President Donald Trump’s threats boosted the ruling Liberals over the Conservatives, but polls show a tighter race as Canadians elect a new leader Monday, with Prime Minister Mark Carney the favorite.",
    "link": "https://www.foxnews.com/world/trump-threats-boosted-canadas-carney-hurt-conservatives-country-votes-new-leader",
    "timestamp": "2025-04-28T11:29:09Z"
  },
  {
    "title": "Lip reader reveals 'what Zelenskyy said to Donald Trump' during meeting at Pope Francis' funeral",
    "description": "Voldoymyr Zelenskyy and Donald Trump had an impromptu meeting in the Vatican before Pope Francis' funeral on Saturday",
    "link": "https://www.ladbible.com/news/politics/what-zelenskyy-said-donald-trump-pope-funeral-meeting-821783-20250428",
    "timestamp": "2025-04-28T11:29:08Z"
  },
  {
    "title": "Trump Opens Up About His Meeting With Zelenskyy In Rome",
    "description": "Their sitdown marked the first time the two men had spoken since their historic Oval Office clash.",
    "link": "https://www.huffpost.com/entry/trump-opens-up-about-zelenskyy-meeting_n_680f4992e4b049bc73d57edb",
    "timestamp": "2025-04-28T11:28:57Z"
  },
  {
    "title": "Transcript: Trump Blurts Out Revealing Admission on Abrego Garcia Case",
    "description": "The following is a lightly edited transcript of the April 28 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresiden…",
    "link": "https://newrepublic.com/article/194466/transcript-trump-blurts-dark-confession-abrego-garcia-case",
    "timestamp": "2025-04-28T11:27:51Z"
  },
  {
    "title": "US generics, domestic market to drive healthy sales growth for pharma companies in Q4",
    "description": "Uncertainties around US tariffs and the end of the limited competition period for generic Revlimid in the US will loom in 2026.",
    "link": "https://www.livemint.com/companies/pharma-companies-cancer-drug-generics-us-revlimid-distribution-exclusivity-dr-reddys-sun-pharma-aurobindo-pharma-11745831409080.html",
    "timestamp": "2025-04-28T11:26:58Z"
  },
  {
    "title": "How Trump could champion fair trade — and save the WTO",
    "description": "US economic policy lacks strategic clarity. Donald Trump is alert to financial markets. His approach to trade may shift significantly. A reconstructed World Trade Organization is possible. Trump paused tariffs and mentioned potential tariff reduction on China…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-trump-could-champion-fair-trade-and-save-the-wto/articleshow/120696299.cms",
    "timestamp": "2025-04-28T11:26:36Z"
  },
  {
    "title": "Trump's deep-sea mining order violates global norms: France",
    "description": "France on Monday accused the United States of violating international law after President Donald Trump signed an order to fast-track deep-sea mining in the open ocean outside his country's territorial waters. The country's ambassador for the oceans, Olivier P…",
    "link": "https://timesofindia.indiatimes.com/world/us/trumps-deep-sea-mining-order-violates-global-norms-france/articleshow/120696082.cms",
    "timestamp": "2025-04-28T11:26:10Z"
  },
  {
    "title": "Conclave to elect next pope will start May 7",
    "description": "Cardinals must chose a successor to Pope Francis, who died on Easter Monday",
    "link": "https://www.politico.eu/article/vatican-rome-pope-conclave-to-elect-will-start-may-7/",
    "timestamp": "2025-04-28T11:25:30Z"
  },
  {
    "title": "Trump to the U.S. Economy to the Brink of Crisis",
    "description": "Stephen Collinson: “Donald Trump spent his first 100 days back in the Oval Office driving an economy that the world envied to the brink of crisis, risking America’s reputation as a financial safe haven and",
    "link": "https://politicalwire.com/2025/04/28/trump-to-the-u-s-economy-to-the-brink-of-crisis/",
    "timestamp": "2025-04-28T11:25:15Z"
  },
  {
    "title": "Trump: Jail those unknown people who ‘operated the Auto Pen’",
    "description": "Who or what group was running the country from noon on Jan. 20, 2021 to noon on Jan. 20, 2025? While average Americans and a few “alternative independent media types” were asking that question on a daily basis, the ”journalist” with “legacy media” were not th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313724/posts",
    "timestamp": "2025-04-28T11:25:01Z"
  },
  {
    "title": "Trump’s approval rating falls as immigration crackdown escalates",
    "description": "As new poll numbers show that the majority of Americans disapprove of how President Donald Trump is handling immigration, his administration is defending new deportations of families involving children who are allegedly U.S. citizens. Last week a 4-year-old w…",
    "link": "https://www.today.com/video/trump-approval-falls-over-handling-of-economy-and-immigration-238453317605",
    "timestamp": "2025-04-28T11:22:50Z"
  },
  {
    "title": "Here’s How the White House Correspondents’ Dinner Addressed an Absent Trump",
    "description": "Both the president and a guest comedian were absent from this year's ceremony.",
    "link": "https://www.adweek.com/tvnewser/donald-trump-amber-ruffin-absent-white-house-correspondents-dinner/",
    "timestamp": "2025-04-28T11:20:46Z"
  },
  {
    "title": "SEE YOU IN COURT: Christian Groups Harmed By Trans Mandate Sue To Block Rehiring Of Biden Staffer",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | April 24, 2025\nTwo Christian organizations are intervening in a lawsuit brought against the Trump administration by a fired independent agency employee who claims her removal was unlawful.\nPresident Donald Tr…",
    "link": "https://biztoc.com/x/43e2a5dd084b382e",
    "timestamp": "2025-04-28T11:20:18Z"
  },
  {
    "title": "Illinois candidate for Durbin Senate seat consolidates support with Duckworth endorsement",
    "description": "Illinois Lt. Gov. Juliana Stratton was endorsed by Sen. Tammy Duckworth in the primary to succeed the retiring Democratic Sen. Dick Durbin.",
    "link": "https://www.foxnews.com/politics/illinois-candidate-durbin-senate-seat-consolidates-support-duckworth-endorsement",
    "timestamp": "2025-04-28T11:19:21Z"
  },
  {
    "title": "모건 스탠리 처 돌았냐?",
    "description": "Trump's tariff fight has rattled Washington and Wall Street, we get tech earnings after the close and Canada heads to the polls. Get all the news you need to start your day with the Bloomberg Daybreak podcast. https://t.co/7bu2dqJP5R— Bloomberg (@business) Ap…",
    "link": "https://ryueyes11.tistory.com/511590",
    "timestamp": "2025-04-28T11:15:02Z"
  },
  {
    "title": "JB Pritzker calls out 'do-nothing' Democrats for failing to push back against Trump (Associated Press)",
    "description": "Associated Press:\nJB Pritzker calls out ‘do-nothing’ Democrats for failing to push back against Trump  —  Illinois Gov. JB Pritzker sharply criticized fellow Democrats on Sunday for not doing enough to oppose President Donald Trump, drawing a clear divide bet…",
    "link": "https://www.memeorandum.com/250428/p6",
    "timestamp": "2025-04-28T11:10:01Z"
  },
  {
    "title": "Trump White House Lines Lawn With Mugshots of Illegal Immigrants",
    "description": "Around 100 posters were laid along the lawn showing arrested illegal immigrants.",
    "link": "https://www.newsweek.com/trump-white-house-lines-lawn-mugshots-illegal-immigrants-2064957",
    "timestamp": "2025-04-28T11:09:40Z"
  },
  {
    "title": "Big Tech’s earnings problem is estimates may be way too high",
    "description": "In This Article:\n(Bloomberg) — The last time Big Tech delivered earnings, Donald Trump had just started his term, stocks were soaring on expectations of a pro-growth government agenda and investors’ main worry was how long it would take companies to convert t…",
    "link": "https://biztoc.com/x/ae5648a1bb5d2157",
    "timestamp": "2025-04-28T11:09:22Z"
  },
  {
    "title": "‘It’s Imminent’—U.S. Dollar Fed Warning Braces Bitcoin For A BlackRock ‘Megaforce’ Price Shock",
    "description": "\"Major\" U.S. dollar warnings are priming bitcoin for a “geopolitical fragmentation megaforce\" shock...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/04/28/major-us-dollar-fed-warning-braces-bitcoin-for-blackrock-megaforce-price-shock/",
    "timestamp": "2025-04-28T11:07:57Z"
  },
  {
    "title": "It's election day in Canada. Here's what you need to know about the three main party leaders",
    "description": "Mark Carney, Pierre Poilievre and Jagmeet Singh, not one of them fought the election he expected. Here's what to know about the federal party leaders",
    "link": "https://nationalpost.com/news/politics/federal_election/what-to-know-jagmeet-singh-mark-carney-pierre-poilievre",
    "timestamp": "2025-04-28T11:07:30Z"
  },
  {
    "title": "Tariff War Draws Investment Warning From $160 Billion Novo Fund",
    "description": "(Bloomberg) -- The $160 billion fund behind Ozempic-maker Novo Nordisk A/S says President Donald Trump’s tariff war has created so much economic uncertainty ...",
    "link": "https://finance.yahoo.com/news/160-billion-fund-behind-novo-063000802.html",
    "timestamp": "2025-04-28T11:07:15Z"
  },
  {
    "title": "St. Louis faces tighter ozone rules after air quality fails to improve",
    "description": "Stricter air-quality rules, pushed through in the last days of the Biden administration, face an uncertain future under a Trump-led Environmental Protection Agency and pushback from Missouri Republicans.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_5dbaef90-00af-4a2e-a3ad-2e3d58df1962.html",
    "timestamp": "2025-04-28T11:05:00Z"
  },
  {
    "title": "Trump Vows To Bring Columbus Day Back 'From The Ashes', Rejects Biden's Move To Honor Indigenous Peoples Day",
    "description": "Despite President Trump's support for Columbus Day, only Congress can create or abolish federal holidays. A president can issue one-time executive orders but cannot permanently change holidays.",
    "link": "https://www.ibtimes.com/trump-vows-bring-columbus-day-back-ashes-rejects-bidens-move-honor-indigenous-peoples-day-3771636",
    "timestamp": "2025-04-28T11:04:01Z"
  },
  {
    "title": "Donald Trump the main reason behind Carney-led Liberals' resurgence, stymied Poilievre's march: Ekos poll",
    "description": "Mark Carney-led Liberal Party is likely to win the 2025 Canadian federal election. Ekos Research predicts a Liberal majority with 184 seats in the 343-member House of Commons. Donald Trump's statements and tariff war are the big factors behind Liberal Party r…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/donald-trump-the-main-reason-behind-carney-led-liberals-resurgence-stymied-poilievres-march-ekos-poll/articleshow/120695708.cms",
    "timestamp": "2025-04-28T11:03:49Z"
  },
  {
    "title": "Eagles star RB Saquon Barkley hangs out with Trump after Jalen Hurts dodges question on White House visit",
    "description": "Philadelphia Eagles star running back Saquon Barkley was seen spending time with US president Donald Trump a day before the team’s visit to the White House to celebrate their recent Super Bowl victory.",
    "link": "https://www.cnn.com/2025/04/28/sport/saquon-barkley-donald-trump-eagles-white-house-spt-intl/index.html",
    "timestamp": "2025-04-28T11:02:33Z"
  },
  {
    "title": "Survey results Trump's job performance and murder charges in Vancouver crash: Morning Rundown",
    "description": "Surveys show how Americans feel about Donald Trump’s job performance and his handling of big issues.",
    "link": "https://www.nbcnews.com/news/us-news/survey-trump-job-performance-murder-vancouver-crash-morning-rundown-rcna203248",
    "timestamp": "2025-04-28T11:02:21Z"
  },
  {
    "title": "How a DOGE review can actually improve the programs that fight HIV/AIDS",
    "description": "If you support maintaining the U.S. approach to fighting HIV/AIDS, you should welcome the DOGE review to ensure that programs meet the needs of the current epidemic.",
    "link": "https://www.foxnews.com/opinion/how-doge-review-can-actually-improve-programs-fight-hiv-aids",
    "timestamp": "2025-04-28T11:00:56Z"
  },
  {
    "title": "EXCLUSIVE: Trump has achieved more in 100 days than 'most presidents' in their lifetimes, Johnson says",
    "description": "Speaker Mike Johnson discussed the first 100 days of Trump being in office and having a Republican trifecta in a call with Fox News Digital.",
    "link": "https://www.foxnews.com/politics/exclusive-trump-has-achieved-more-100-days-than-most-presidents-lifetimes-johnson-says",
    "timestamp": "2025-04-28T11:00:42Z"
  },
  {
    "title": "White House spox unloads on CNN guest for saying 'lots of suspicion' over Trump's weight loss",
    "description": "White House Director of Communications Steven Cheung responded harshly to a CNN guest's comment about President Donald Trump's weight on Sunday.",
    "link": "https://www.foxnews.com/media/white-house-spox-unloads-cnn-guest-saying-lots-suspicion-over-trumps-weight-loss",
    "timestamp": "2025-04-28T11:00:38Z"
  },
  {
    "title": "Black And Latine Shoppers Continue To Boycott Target — And It Might Be Working. Here's Why.",
    "description": "Why this long-term boycott could spark \"generational change.\"",
    "link": "https://www.huffpost.com/entry/target-boycott_l_680a884ae4b042d124856ce9",
    "timestamp": "2025-04-28T11:00:20Z"
  },
  {
    "title": "'Musk Has Made a Mess': Tesla Founder's Popularity Nosedives Amid Backlash Over Trump Ties",
    "description": "Three months into Trump's second term, two-thirds of Americans believe Elon Musk has too much influence in federal affairs.",
    "link": "https://www.ibtimes.com/musk-has-made-mess-tesla-founders-popularity-nosedives-amid-backlash-over-trump-ties-3771617",
    "timestamp": "2025-04-28T11:00:02Z"
  },
  {
    "title": "Meta’s AI spending comes into focus amid Trump’s tariff policies",
    "description": "AI is a hot topic this week for Meta investors as the company hosts its first Llama-branded conference for developers then reports earnings the next day.",
    "link": "https://www.cnbc.com/2025/04/28/metas-ai-spending-comes-into-focus-amid-trumps-tariff-policies.html",
    "timestamp": "2025-04-28T11:00:01Z"
  },
  {
    "title": "St. Louis Zoo and Botanical Garden lose federal money for research on animals, plants",
    "description": "The Missouri Botanical Garden and the St. Louis Zoo lost nearly $1 million amid the Trump administration's funding cuts.",
    "link": "https://www.stltoday.com/news/local/metro/article_2b056641-20cf-4e18-9db5-b8cfb5299375.html",
    "timestamp": "2025-04-28T11:00:00Z"
  },
  {
    "title": "How America Became Afraid of the Other",
    "description": "\"Punishing assorted others quells empathy and dissent, for we do not want to be targeted ourselves,\" writes Viet Thanh Nguyễn.",
    "link": "https://time.com/7280423/immigrants-refugees-america-afraid-of-the-other-essay/",
    "timestamp": "2025-04-28T11:00:00Z"
  },
  {
    "title": "Radio Atlantic: In the Oval Office With Donald Trump",
    "description": "A conversation with Jeffrey Goldberg, Ashley Parker, and Michael Scherer about their recent interview with the president of the United States",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/04/radio-atlantic-oval-office-donald-trump/682621/",
    "timestamp": "2025-04-28T11:00:00Z"
  },
  {
    "title": "Exclusive: Biden Hired an Army of AI-Savvy Workers. Under Trump, Most of Them Are Gone",
    "description": "Biden officials lured more than 200 AI experts to work for the government. Most were fired by Trump, former officials tell TIME",
    "link": "https://time.com/7280528/trump-ai-experts-musk/",
    "timestamp": "2025-04-28T11:00:00Z"
  },
  {
    "title": "As a diversity grant dies, young scientists fear it will haunt their careers",
    "description": "The Trump administration defunded the National Institute of Health's MOSAIC grant program, which launched the careers of scientists from diverse backgrounds.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/04/28/nx-s1-5375917/as-a-diversity-grant-dies-young-scientists-fear-it-will-haunt-their-careers",
    "timestamp": "2025-04-28T11:00:00Z"
  },
  {
    "title": "Tragic final message from air traffic control before helicopter crashed into plane killing 67 people",
    "description": "A tragic final message from air traffic control has been revealed following the devastating crash in the US which saw a helicopter collide with a plane.",
    "link": "https://www.ladbible.com/news/us-news/us-army-helicopter-final-message-plane-crash-traffic-045450-20250428",
    "timestamp": "2025-04-28T10:59:18Z"
  },
  {
    "title": "Trump: No 'certain number' in market to change trade policy",
    "description": "US President Donald Trump said during an interview with the Atlantic and when questioned about whether the threat of a recession would influence him to modify his trade policies, that he sees no \"cert...",
    "link": "https://biztoc.com/x/c8b607c0f7015117",
    "timestamp": "2025-04-28T10:57:48Z"
  },
  {
    "title": "Some Amazon sellers are pulling out of Prime Day amid Trump tariffs",
    "description": "The planned pullback, which hasn't been previously reported, is a way for sellers to protect profit margins amid the US-China trade war triggered by steep tariffs placed by US President Donald Trump on Chinese goods, according to four merchants and six consul…",
    "link": "https://economictimes.indiatimes.com/tech/technology/some-amazon-sellers-are-pulling-out-of-prime-day-amid-trump-tariffs/articleshow/120695632.cms",
    "timestamp": "2025-04-28T10:57:00Z"
  },
  {
    "title": "'Glaring Example of Misplaced Priorities': GOP Unveils Plan to Give $150 Billion More to Pentagon",
    "description": "Congressional Republicans on Sunday released legislation that would pump an additional $150 billion into the Pentagon—a morass of waste and profiteering—over the next decade as part of a sweeping reconciliation package that's also expected to include deep cut…",
    "link": "https://www.commondreams.org/news/republicans-pentagon-budget",
    "timestamp": "2025-04-28T10:56:41Z"
  },
  {
    "title": "Trump says income tax cuts, and perhaps elimination, coming due to tariffs",
    "description": "President Donald Trump indicated that income taxes will be reduced or even eliminated for many people due to tariffs, with a focus on people earning under $200,000 per year.",
    "link": "https://www.foxnews.com/politics/trump-says-income-tax-cuts-perhaps-elimination-coming-due-tariffs",
    "timestamp": "2025-04-28T10:54:52Z"
  },
  {
    "title": "Recession risk deepens, fear haunts economies and businesses as Trump's tariff damage spreads",
    "description": "A recent Reuters poll reveals economists are increasingly worried about a potential global recession this year, largely blaming U.S. tariffs for damaging business confidence. Overwhelmingly, economists view these tariffs negatively, leading to lowered global …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/recession-risk-deepens-fear-haunts-economies-and-businesses-as-trumps-tariff-damage-spreads/articleshow/120695511.cms",
    "timestamp": "2025-04-28T10:54:02Z"
  },
  {
    "title": "Russia says claims over annexed Ukraine regions key to peace",
    "description": "Russia said on Monday it was ready to negotiate directly with Ukraine, but that recognition of its claims over five Ukrainian regions including Crimea were “imperative” to resolving the conflict. Since launching its Ukraine offensive in February 2022, Russia …",
    "link": "https://www.digitaljournal.com/world/russia-says-claims-over-annexed-ukraine-regions-key-to-peace/article",
    "timestamp": "2025-04-28T10:47:20Z"
  },
  {
    "title": "Donald Trump Demands Investigations Into Negative Approval Rating Polls",
    "description": "Trump criticized pollsters working with major news outlets as he suffers a slew of worsening numbers.",
    "link": "https://biztoc.com/x/4cd6d635b7a86dab",
    "timestamp": "2025-04-28T10:46:56Z"
  },
  {
    "title": "Over three-quarters of American Jews lack confidence in Trump’s handling of Iran, indicates survey",
    "description": "In January, 70% of those who supported Trump said they had high confidence in his handling of Iran.",
    "link": "https://www.jpost.com/diaspora/article-851823",
    "timestamp": "2025-04-28T10:46:51Z"
  },
  {
    "title": "Nexo to Return to U.S. After 2022 Exit, Citing Renewed Crypto Optimism Under Trump",
    "description": "Crypto lender Nexo said it is reentering the U.S., marking a comeback two years after regulatory friction forced its exit.\n\"America is back and so is Nexo,\" Co-founder Antoni Trenchev said at a press event Sunday in Bulgaria with Donald Trump Jr., crediting w…",
    "link": "https://biztoc.com/x/b2de9f03ea85b891",
    "timestamp": "2025-04-28T10:46:41Z"
  },
  {
    "title": "Trump Torches ‘Fake News’ Pollsters – Including Fox News – and Demands ‘ELECTION FRAUD’ Probe: ‘THEY ARE SICK’",
    "description": "President Donald Trump went scorched earth on “fake news” pollsters Monday, throwing even Fox News into the mix after a series of brutal polls showed his approval rating plummeting as he nears the 100-day mark of his second term. Multiple polls have found tha…",
    "link": "https://www.mediaite.com/news/trump-torches-fake-news-pollsters-including-fox-news-and-demands-election-fraud-probe-they-are-sick/",
    "timestamp": "2025-04-28T10:45:33Z"
  },
  {
    "title": "Russia says claims over annexed Ukraine regions key to peace",
    "description": "MOSCOW - Russia said on Monday it was ready to negotiate directly with Ukraine, but that recognition of its claims over five Ukrainian regions including Crimea were \"imperative\" to resolving the conflict.",
    "link": "https://www.bangkokpost.com/world/3013101/russia-says-claims-over-annexed-ukraine-regions-key-to-peace",
    "timestamp": "2025-04-28T10:45:00Z"
  },
  {
    "title": "Who are Canadians voting for in this election?",
    "description": "The BBC spoke to eight voters asking who they voted for and what their main election issues are.",
    "link": "https://www.bbc.com/news/articles/c0r54kej8jwo",
    "timestamp": "2025-04-28T10:44:53Z"
  },
  {
    "title": "60 Minutes star launches blistering on-air attack on bosses for bending to Trump",
    "description": "60 Minutes anchor Scott Pelley accused the show's parent company, Paramount, of interfering with their editorial process in a blistering on-air attack Sunday evening.“Our parent company, Paramount, is trying to complete a merger. The Trump administration must…",
    "link": "https://www.rawstory.com/60-min/",
    "timestamp": "2025-04-28T10:43:21Z"
  },
  {
    "title": "Parcel giant DHL says it can deliver packages worth more than $800 to American customers again",
    "description": "DHL temporarily suspended shipments worth over $800 from other countries to US consumers earlier this month following new customs rules.",
    "link": "https://www.businessinsider.com/dhl-resuming-shipments-worth-over-800-to-american-consumers-2025-4",
    "timestamp": "2025-04-28T10:43:07Z"
  },
  {
    "title": "Court Records Offer Glimpse Into Trump’s CFPB Firing Efforts",
    "description": "This week, a judge will hear testimony that could determine the future of the CFPB. The Consumer Financial Protection Bureau (CFPB) has been on shaky ground for months, with President Donald Trump’s administration pushing to cut 90% of its staff. And as the N…",
    "link": "https://www.pymnts.com/news/cfpb/2025/court-records-offer-glimpse-into-trumps-cfpb-firing-efforts/",
    "timestamp": "2025-04-28T10:42:26Z"
  },
  {
    "title": "China Confident in 5% GDP Growth Despite Trade War",
    "description": "China tried to ease concerns on Monday that the trade war with the United States would take a heavy toll on its economic growth. Policy makers expressed confidence that the 5% GDP growth target would be reached and that the lack of agriculture and energy impo…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/China-Confident-in-5-GDP-Growth-Despite-Trade-War.html",
    "timestamp": "2025-04-28T10:42:15Z"
  },
  {
    "title": "Donald Trump Demands Investigations Into Negative Approval Rating Polls",
    "description": "Trump criticized pollsters working with major news outlets as he suffers a slew of worsening numbers.",
    "link": "https://www.newsweek.com/donald-trump-demands-investigations-negative-approval-rating-polls-2064949",
    "timestamp": "2025-04-28T10:40:59Z"
  },
  {
    "title": "Tariffs are making strollers and car seats more expensive. Parents are worried | CNN Business",
    "description": "When soon-to-be moms and dads go to Modern Natural Baby, a baby and children’s gear and toy store outside of Detroit, they are typically looking for advice — the right brand of stroller, whether to buy a rocker or a glider for the nursery, or for help install…",
    "link": "https://www.cnn.com/2025/04/28/business/strollers-car-seats-tariffs/index.html",
    "timestamp": "2025-04-28T10:40:41Z"
  },
  {
    "title": "'You guys make it sound like...': Top Trump officials make big charge against children’s parents amid deportation",
    "description": "The US President Donald Trump’s administration has reportedly deported three US citizen children, including a 4-year-old who was suffering from metastatic cancer along with their mothers, according to the families’ attorneys. But top Trump officials Tom Homan…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-children-citizen-deported-you-guys-make-it-sound-like-top-trump-officials-make-big-charge-against-childrens-parents-amid-deportation/articleshow/120694649.cms",
    "timestamp": "2025-04-28T10:38:26Z"
  },
  {
    "title": "Emerging-Market Stocks Extend Rally Amid Earnings Optimism",
    "description": "Emerging-market stocks rose for a second day, with the benchmark gauge heading for a three-week high amid optimism over corporate earnings.",
    "link": "https://financialpost.com/pmn/business-pmn/emerging-market-stocks-extend-rally-amid-earnings-optimism",
    "timestamp": "2025-04-28T10:34:05Z"
  },
  {
    "title": "Bitcoin price jumps to $94,680, eyes $100,000 amid rising greed signals",
    "description": "10% weekly gain marks Bitcoin’s strongest move in weeks. Profit/Loss ratio close to 1.0, hinting at potential breakout. Greed sentiment reaches its highest level since November 2024. Bitcoin has broken above $90,000 after five weeks of sideways trading, reign…",
    "link": "https://coinjournal.net/news/bitcoin-price-jumps-to-94680-eyes-100000-amid-rising-greed-signals/",
    "timestamp": "2025-04-28T10:32:48Z"
  },
  {
    "title": "10 Monday AM Reads",
    "description": "My back-to-work morning train reads: • The End of the South Florida Dream: A similar phenomenon is taking place across all of South Florida, where a majority of the state’s aging condos are concentrated. Over the past few months, condo listings have shot up i…",
    "link": "https://ritholtz.com/2025/04/10-monday-am-reads-425/",
    "timestamp": "2025-04-28T10:30:05Z"
  },
  {
    "title": "These Colleges Are At Risk As Congress Takes Aim At Endowments",
    "description": "Not only Harvard will pay. As Republicans hunt for revenues, the tax on private college endowments could be raised and broadened. We found 127 schools that might be vulnerable.",
    "link": "https://www.forbes.com/sites/emmawhitford/2025/04/28/these-colleges-are-at-risk-as-congress-takes-aim-at-endowments/",
    "timestamp": "2025-04-28T10:30:00Z"
  },
  {
    "title": "'They are sick!' Raging Trump demands criminal probes into reports of his bad poll numbers",
    "description": "President Donald Trump highlighted findings by a Republican pollster to attack media organizations that found his approval rating was lagging.A survey conducted by ABCNews and the Washington Post found just 39 percent of Americans approve of his performance a…",
    "link": "https://www.rawstory.com/trump-2671856142/",
    "timestamp": "2025-04-28T10:29:59Z"
  },
  {
    "title": "Exclusive -- Shocking Data Suggests Abortion Pill Complications 22 Times Higher Than Previously Reported: ‘FDA Must Reinstate Stronger Safeguards’",
    "description": "While the abortion pill is touted as “safe and effective,” new data suggests complications are 22 times higher than previously reported.\nThe post Exclusive — Shocking Data Suggests Abortion Pill Complications 22 Times Higher Than Previously Reported: ‘FDA Mus…",
    "link": "https://www.breitbart.com/politics/2025/04/28/exclusive-shocking-data-suggests-abortion-pill-complications-22-times-higher-than-previously-reported-fda-must-reinstate-stronger-safeguards/",
    "timestamp": "2025-04-28T10:29:32Z"
  },
  {
    "title": "Russia Says Claims Over Annexed Ukraine Regions Key To Peace",
    "description": "Russia said on Monday it was ready to negotiate directly with Ukraine, but that recognition of its claims over five Ukrainian regions including Crimea were \"imperative\" to resolving the conflict.",
    "link": "https://www.ibtimes.com/russia-says-claims-over-annexed-ukraine-regions-key-peace-3771649",
    "timestamp": "2025-04-28T10:27:18Z"
  },
  {
    "title": "Putin critic Johann Wadephul to become Germany's foreign minister",
    "description": "Germany's next foreign minister, Johann Wadephul, is a former soldier, trained lawyer and conservative MP who has long been a strong supporter of military backing for Ukraine as it fights Russia's invasion.",
    "link": "https://www.thelocal.de/20250428/putin-critic-johann-wadephul-to-become-germanys-foreign-minister",
    "timestamp": "2025-04-28T10:27:13Z"
  },
  {
    "title": "At event with Donald Trump Jr in Bulgaria, crypto firm Nexo announces US return",
    "description": "While hosting the eldest son of U.S. President Donald Trump at a conference in Bulgaria on Sunday, crypto company Nexo Capital said it plans to return to the American market, two years after it paid a $45 million fine to settle U.S. regulatory charges.Donald …",
    "link": "https://www.channelnewsasia.com/business/event-donald-trump-jr-bulgaria-crypto-firm-nexo-announces-us-return-5094656",
    "timestamp": "2025-04-28T10:27:10Z"
  }
]