[
  {
    "title": "Trump Doubles Down On Tariffs Amid Economic Chaos: ‘The Patient Lived, And Is Healing’",
    "description": "The president claimed his tariffs would make the U.S. “FAR STRONGER” even as the stock market plunged in response to his announcement.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/04/03/trump-doubles-down-on-tariffs-amid-economic-chaos-the-patient-lived-and-is-healing/",
    "timestamp": "2025-04-03T13:47:08Z"
  },
  {
    "title": "Tech stocks sink after Trump tariff rollout — Apple heads for worst drop in 5 years",
    "description": "Technology stocks plummeted Thursday after President Donald Trump's new tariff policies sparked widespread market panic.\nApple led the declines among the so-called \"Magnificent Seven\" group, dropping more than 8%. The iPhone maker makes its devices in China a…",
    "link": "https://biztoc.com/x/f2bddd9c9ff85cc7",
    "timestamp": "2025-04-03T13:47:00Z"
  },
  {
    "title": "Sheinbaum: No new tariffs on Mexico good news",
    "description": "Mexican President Claudia Sheinbaum hailed on Thursday the fact that United States President Donald Trump did not introduce a new series of tariffs on her country's exports in his latest move the day ...",
    "link": "https://biztoc.com/x/05f462ca079e6856",
    "timestamp": "2025-04-03T13:46:46Z"
  },
  {
    "title": "Trump’s new tariffs: How key U.S. trading partners are reacting",
    "description": "Sweeping new tariffs announced Wednesday by U.S. President Donald Trump provoked dismay, threats of countermeasures and calls for further negotiations to make trade rules fairer.But responses were measured, highlighting a lack of appetite among key trading pa…",
    "link": "https://biztoc.com/x/06fa4a81cdc734aa",
    "timestamp": "2025-04-03T13:46:46Z"
  },
  {
    "title": "Dow drops 1,100 as US stock market leads a worldwide sell-off following Trump’s tariff announcement",
    "description": "By ELAINE KURTENBACH BANGKOK (AP) — Asian markets and U.S. futures tumbled Thursday following U.S. President Donald Trump’s announcement of big increases in tariffs on imports of goods …",
    "link": "https://www.bostonherald.com/2025/04/02/dow-drops-1500-as-us-stock-market-leads-a-worldwide-sell-off-following-trumps-tariff-shock/",
    "timestamp": "2025-04-03T13:46:36Z"
  },
  {
    "title": "Car and Car Repair Prices Expected to Jump With New Tariffs",
    "description": "Twenty-five percent tariffs on imported cars are now in effect in the U.S.\nAs the New York Times reported Thursday (April 3), it’s a policy that President Donald Trump argues will lead to investments and jobs in the American car industry. Analysts, meanwhile,…",
    "link": "https://biztoc.com/x/c1b0a2da057701a6",
    "timestamp": "2025-04-03T13:46:31Z"
  },
  {
    "title": "Crypto Prices Slip as Tariffs Rattle Investors",
    "description": "U.S cryptocurrency stocks fell in early trading Thursday (April 3) following the latest White House tariffs. As Reuters reported, the sweeping new levies have left investors shaken, leading them to sell riskier assets. Bitcoin fell 2.3%, the report added, wit…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/crypto-prices-slip-as-tariffs-rattle-investors/",
    "timestamp": "2025-04-03T13:46:29Z"
  },
  {
    "title": "Trump tariff stock market crash: Apple, Amazon, Nike, Shopify, Tesla, Walmart shares plummet",
    "description": "Yesterday, President Donald Trump announced a slew of tariffs on nearly every country in the world—over 180 of them, notes CNBC. The tariffs Trump announced are higher than most economists and business leaders feared.\nTrump chose to hold off on announcing the…",
    "link": "https://biztoc.com/x/b896a175e1db3c02",
    "timestamp": "2025-04-03T13:46:26Z"
  },
  {
    "title": "Real reason why Trump's 'first buddy' Elon Musk is quitting DOGE in four months",
    "description": "President Donald Trump's 'first buddy' and billionaire friend Elon Musk is stepping down as DOGE chief in just four months. This has led to speculations where things are not well between Musk and Trump. DOGE is an advisory body announced by Donald Trump to st…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/real-reason-why-trumps-first-buddy-elon-musk-is-quitting-doge-in-four-months/articleshow/119947011.cms",
    "timestamp": "2025-04-03T13:46:26Z"
  },
  {
    "title": "PRIORITY SHIFT: Secretary Pete Hegseth Reported To Skip Ukraine Defense Contact Group Meeting in Brussels",
    "description": "Secretary Pete Hegseth's decision to forgo the critical Ukraine Defense Contact Group meeting at Ramstein raises significant questions about U.S. commitments and priorities in global security.\nThe post PRIORITY SHIFT: Secretary Pete Hegseth Reported To Skip U…",
    "link": "https://www.thegatewaypundit.com/2025/04/priority-shift-secretary-pete-hegseth-reported-skip-ukraine/",
    "timestamp": "2025-04-03T13:45:24Z"
  },
  {
    "title": "As the CDC’s IVF team is gutted, Trump is haunted by ‘fertilization president’ claims",
    "description": "When it comes to in vitro fertilization, Donald Trump is saying one thing while doing the opposite, even after claiming to be the \"fertilization president.\"",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/cdc-ivf-team-cut-trump-fertilization-president-rcna199472",
    "timestamp": "2025-04-03T13:44:54Z"
  },
  {
    "title": "Trump administration exempts computer chips and copper from sweeping tariffs, but only for now — report says chip tariffs coming later",
    "description": "Donald Trump's new tariff plan imposes sweeping import taxes on nearly all U.S. trading partners starting in April, but key exclusions, especially for semiconductors, offer relief to American tech firms even as high-tech goods from Asia face steep price hikes.",
    "link": "https://www.tomshardware.com/tech-industry/trump-administration-exempts-computer-chips-and-copper-from-sweeping-tariffs-but-only-for-now-report-says-chip-tariffs-coming-later",
    "timestamp": "2025-04-03T13:43:14Z"
  },
  {
    "title": "Let’s Be Politically Promiscuous",
    "description": "“Our movements are pretty much just made of our relationships,” says author and activist Dean Spade.",
    "link": "https://truthout.org/audio/lets-be-politically-promiscuous/",
    "timestamp": "2025-04-03T13:42:32Z"
  },
  {
    "title": "Apple production hubs – and Apple stock – hit by U.S. import tariffs",
    "description": "Apple is currently directly in the line of fire of President Donald Trump’s latest tariffs set to kick in on April 9th…\nThe post Apple production hubs – and Apple stock – hit by U.S. import tariffs appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/04/03/apple-production-hubs-and-apple-stock-hit-by-u-s-import-tariffs/",
    "timestamp": "2025-04-03T13:41:38Z"
  },
  {
    "title": "EEOC chief shifts focus to investigating DEI but the methods provoke an outcry",
    "description": "The acting chief of the top federal agency for protecting worker rights has signaled a pivot toward prioritizing President Donald Trump's campaign to stamp...",
    "link": "https://www.yahoo.com/news/eeoc-chief-shift-focus-investigating-134126126.html",
    "timestamp": "2025-04-03T13:41:26Z"
  },
  {
    "title": "Dairy of an Agro phile: How now, holy cow?",
    "description": "US President Donald Trump criticized India's agricultural and dairy import practices in a recent report, citing what he views as unnecessary barriers. The report also noted India's high tariffs on alcoholic beverages. Trump and his administration aim to open …",
    "link": "https://timesofindia.indiatimes.com/world/us/dairy-of-an-agro-phile-how-now-holy-cow/articleshow/119947018.cms",
    "timestamp": "2025-04-03T13:41:24Z"
  },
  {
    "title": "Trump’s tariff shockwaves; Scapia’s fundraise",
    "description": "President Donald Trump's broad import tariffs will have repercussions for the tech world. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/trumps-tariff-shockwaves-scapias-fundraise/articleshow/119946791.cms",
    "timestamp": "2025-04-03T13:39:56Z"
  },
  {
    "title": "US Trade Gap Shrinks on Export Boost as Imports Stay Elevated",
    "description": "The US trade deficit shrank in February from a record at the start of the year as stronger exports blunted the impact of a rush to secure goods and materials before the Trump administration’s sweeping tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/us-trade-gap-shrinks-on-export-boost-as-imports-stay-elevated",
    "timestamp": "2025-04-03T13:39:52Z"
  },
  {
    "title": "How Trump’s tariffs will impact the tech sector",
    "description": "Trump’s blanket 10% tariff on all imports into the US, with steeper levies for select countries, has sent shockwaves through global markets, raising fears of retaliatory measures, inflation, and a potential recession. India is among the hardest hit, facing a …",
    "link": "https://economictimes.indiatimes.com/tech/technology/how-trumps-tariffs-will-impact-the-tech-sector/articleshow/119947119.cms",
    "timestamp": "2025-04-03T13:38:59Z"
  },
  {
    "title": "Liberals widen lead over Conservatives as NDP falls behind – Who do Canadians want as their next prime minister? New poll reveals surprising trends",
    "description": "Liberals widen lead over Conservatives as NDP struggles in the latest Nanos poll. Mark Carney’s Liberals now stand at 46%, ahead of Pierre Poilievre’s Conservatives at 37%, while the NDP drops to 9%. Carney also holds a strong 17-point lead as Canada’s prefer…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/liberals-widen-lead-over-conservatives-as-ndp-falls-behind-who-do-canadians-want-as-their-next-prime-minister/articleshow/119946859.cms",
    "timestamp": "2025-04-03T13:38:32Z"
  },
  {
    "title": "French cognac industry group calls for de-escalation of US, EU trade dispute",
    "description": "PARIS (Reuters) -The European Union and the United States need to de-escalate their trade dispute and wine and spirits should be left untouched by both sides...",
    "link": "https://finance.yahoo.com/news/french-cognac-industry-group-calls-133814909.html",
    "timestamp": "2025-04-03T13:38:14Z"
  },
  {
    "title": "Can Congress Stop Trump's Tariffs?",
    "description": "Can Congress stop Trump's new tariffs? Senate Republicans push back, but legal hurdles and party loyalty limit efforts to curb his trade powers.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-congress-senate-stop-vote-2054671",
    "timestamp": "2025-04-03T13:38:11Z"
  },
  {
    "title": "Donald Trump ally hits out at UK reporter with 'kindergartener' comment before threatening to storm off camera",
    "description": "The US president’s deputy assistant, Sebastian Gorka, made the comment on BBC's Newsnight in what was a fiery interview.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-sebastian-gorka-victoria-derbyshire-kindergartener-751928-20250403",
    "timestamp": "2025-04-03T13:37:34Z"
  },
  {
    "title": "Stable Genius Trump Just Put Tariffs on a U.S. Military Base",
    "description": "Donald Trump announced a range of tariffs on nearly every country in the world—including, inexplicably, some practically uninhabited islands, one of which is home to a U.S. military base. \r\nThe British Indian Ocean Territory, a small cluster of islands in the…",
    "link": "https://newrepublic.com/post/193523/donald-trump-tariffs-us-military-base",
    "timestamp": "2025-04-03T13:37:13Z"
  },
  {
    "title": "Trump Is Wielding Tariffs to Help Billionaires, But They Can Be a Tool for Fair Trade, Too",
    "description": "President Donald Trump has said “tariff” is “the most beautiful word in the dictionary.” He claims tariffs will restore American trade supremacy, bring lost jobs back to the United States, and most bizarrely, replace income taxes.Tariffs can be a useful tool …",
    "link": "https://otherwords.org/tariffs-can-be-useful-but-not-how-trump-is-using-them/",
    "timestamp": "2025-04-03T13:37:03Z"
  },
  {
    "title": "Trump's new tariffs would be laughed away by a high school economic teacher, analyst says",
    "description": "President Donald Trump’s so-called “reciprocal” tariffs haven’t been well received, especially after the White House explained its math.Read more...",
    "link": "https://qz.com/donald-trump-reciprocal-tariffs-retaliation-lutnick-1851774485",
    "timestamp": "2025-04-03T13:37:00Z"
  },
  {
    "title": "'Handshake Deal for America': Ford Offers Employee Pricing on Most of Its Automobiles",
    "description": "Ford Motor Company on Wednesday announced its \"handshake deal for America,\" offering every American employee pricing on most of their automobiles.\nThe post ‘Handshake Deal for America’: Ford Offers Employee Pricing on Most of Its Automobiles appeared first on…",
    "link": "https://www.breitbart.com/politics/2025/04/03/handshake-deal-for-america-ford-offers-employee-pricing-on-most-of-its-automobiles/",
    "timestamp": "2025-04-03T13:36:50Z"
  },
  {
    "title": "BREAKING: Stock Market NOSEDIVES At Opening Following Trump Tariff ‘Liberation Day’",
    "description": "The Dow Jones Industrial Average nosedived Thursday morning as markets opened, following Trump's \"Liberation Day\" of announcing massive tariffs.\nThe post BREAKING: Stock Market NOSEDIVES At Opening Following Trump Tariff ‘Liberation Day’ first appeared on Med…",
    "link": "https://www.mediaite.com/news/breaking-stock-market-nosedives-at-opening-following-trump-tariff-liberation-day/",
    "timestamp": "2025-04-03T13:36:27Z"
  },
  {
    "title": "Liberation Day",
    "description": "You've been liberated from feeling good about your stock portfolio and meeting your household budget! It's Liberation Day, can't you feel it? \nOr at least that's what President Donald Trump wants you to believe. In reality, today is going to be a terrible blo…",
    "link": "https://biztoc.com/x/da69268223b303a9",
    "timestamp": "2025-04-03T13:35:55Z"
  },
  {
    "title": "China Opposes US Tariffs, Says it Will Retaliate",
    "description": "China is upset about the significant tariffs announced by US President Donald Trump on April 2, saying they should be immediately cancelled or it will respond with countermeasures to protect its interests.\nThe Commerce Ministry in Beijing issued a statement o…",
    "link": "https://biztoc.com/x/bcfab2d936fcb1eb",
    "timestamp": "2025-04-03T13:35:52Z"
  },
  {
    "title": "The biggest winners and losers in Europe as Trump announces sweeping tariffs",
    "description": "Global markets and businesses were thrown into disarray by U.S. President Donald Trump's tariff announcements on Thursday.",
    "link": "https://biztoc.com/x/e34642ff0c38e793",
    "timestamp": "2025-04-03T13:35:41Z"
  },
  {
    "title": "Senate Democrat: Tariffs 'will come back to haunt Donald Trump'",
    "description": "Sen. Richard Blumenthal (D-Conn.) weighed in the latest tariff announcement from President Trump, telling reporters that the new taxes will \"come back to haunt\" Trump and cause prices to increase.\n“The President's tariffs threaten recession, but very immediat…",
    "link": "https://biztoc.com/x/c6ca25e6c5bbccf1",
    "timestamp": "2025-04-03T13:35:36Z"
  },
  {
    "title": "Dow plummets 1,100 points at open, Nasdaq down 4%, S&P 3% as Trump tariffs trigger recession fears",
    "description": "Wall Street's major indexes plunged on Thursday, as President Donald Trump's sweeping tariffs on major trade partners ignited fears of an all-out trade war and heightened the risk of a global economic recession.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-plummets-1000-points-at-open-nasdaq-down-4-sp-3-as-trump-tariffs-trigger-recession-fears/articleshow/119947063.cms",
    "timestamp": "2025-04-03T13:35:02Z"
  },
  {
    "title": "Trump trade war escalation sparks global market sell-off",
    "description": "Donald Trump's trade war escalation has sparked a global sell-off, with US markets seeing the biggest declines.",
    "link": "https://news.sky.com/story/trump-trade-war-escalation-sparks-global-market-sell-off-13341274",
    "timestamp": "2025-04-03T13:35:00Z"
  },
  {
    "title": "In the crosshairs of stiff US tariffs, tiny coral islands in the South Pacific and Arctic outposts",
    "description": "The Trump administration appears to be leaving no stone unturned with its sweeping tariffs around the globe, from rocky outcrops home to polar bears in the Arctic to tiny tropical islands to a former British penal colony",
    "link": "https://abcnews.go.com/International/wireStory/crosshairs-stiff-us-tariffs-tiny-coral-islands-south-120447667",
    "timestamp": "2025-04-03T13:34:45Z"
  },
  {
    "title": "Polar bear-inhabited islands affected by Trump tariffs",
    "description": "Here’s a look at some target territories that have little to no production, exports or role in the global economy.",
    "link": "https://www.denverpost.com/2025/04/03/trump-tariffs-tiny-targets/",
    "timestamp": "2025-04-03T13:34:35Z"
  },
  {
    "title": "In the crosshairs of stiff US tariffs, tiny coral islands in the South Pacific and Arctic outposts",
    "description": "Here’s a look at some target territories that have little to no production, exports or role in the global economy.",
    "link": "https://www.bostonherald.com/2025/04/03/trump-tariffs-tiny-targets/",
    "timestamp": "2025-04-03T13:34:35Z"
  },
  {
    "title": "Tech stocks sink after Trump tariff rollout — Apple heads for worst drop in 5 years",
    "description": "Technology stocks plummeted Thursday after President Donald Trump's new tariff policies sparked widespread market panic.",
    "link": "https://www.cnbc.com/2025/04/03/tech-stocks-sink-after-trump-tariff-rollout-apple-leads-drop.html",
    "timestamp": "2025-04-03T13:34:23Z"
  },
  {
    "title": "Russia not on Trump's tariff list",
    "description": "US media quotes the White House press secretary as saying this is because of sanctions on Moscow.",
    "link": "https://www.bbc.com/news/articles/cdjl3k1we8vo",
    "timestamp": "2025-04-03T13:34:09Z"
  },
  {
    "title": "S&P 500 opened down 3.6% threatening top 10 all-time drop as Bitcoin attempts $82k hold",
    "description": "The S&P 500 opened 3.65% lower on April 3, with pre-market pricing at $543.89, following President Donald Trump’s announcement of sweeping tariff policies. [Update: In the moments after the market opened, it recovered 1% in early morning trading.] The move, w…",
    "link": "https://cryptoslate.com/insights/sp-500-to-open-down-3-6-threatening-top-10-all-time-daily-drop-as-bitcoin-attempts-82k-hold/",
    "timestamp": "2025-04-03T13:33:33Z"
  },
  {
    "title": "Cuban-born rep to lobby Trump admin for major actions to ‘starve’ Havana regime: ‘The time is now’",
    "description": "Rep. Carlos Gimenez, R-Fla., the only Cuban-born congressman, is calling for new, decisive actions he says will cripple the Cuban regime economically.",
    "link": "https://www.foxnews.com/politics/cuban-born-rep-lobby-trump-admin-major-actions-starve-havana-regime",
    "timestamp": "2025-04-03T13:32:58Z"
  },
  {
    "title": "Former U.S. Health Secretary Xavier Becerra enters CA governor's race",
    "description": "Becerra, who's Mexican American, enters the race with a lengthy resume including stints as California attorney general, a U.S. House member and a state legislator.",
    "link": "https://www.nbcnews.com/news/latino/xavier-becerra-former-us-health-secretary-enters-california-governors-rcna199470",
    "timestamp": "2025-04-03T13:32:54Z"
  },
  {
    "title": "Trump’s Auto Tariffs to Cover Hundreds of Billions of Dollars of Vehicle, Parts Imports",
    "description": "U.S. President Donald Trump’s 25% auto tariffs will cover hundreds of billions of dollars worth of imports of vehicles and auto parts imports annually, according to a Reuters analysis of tariff codes included in a federal register notice on Wednesday. …",
    "link": "https://www.insurancejournal.com/news/national/2025/04/03/818230.htm",
    "timestamp": "2025-04-03T13:32:43Z"
  },
  {
    "title": "Swedish insurer Folksam drops $160 million Tesla stake over labour rights",
    "description": "Swedish insurance company Folksam said Wednesday it had given up its $160 million stake in Tesla due to the electric carmaker's approach to labour rights.",
    "link": "https://www.thelocal.se/20250403/swedish-insurer-folksam-drops-160-million-tesla-stake-over-labour-rights",
    "timestamp": "2025-04-03T13:32:00Z"
  },
  {
    "title": "Kuo: Apple Can Reduce Impact of Trump's Massive Tariffs in Five Ways",
    "description": "U.S. President Donald Trump on Wednesday announced that massive tariffs will be applied to imports from many countries, starting April 9. The tariffs will significantly impact Apple's supply chain, with iPhones and other products imported to the U.S. from Chi…",
    "link": "https://www.macrumors.com/2025/04/03/kuo-on-how-apple-can-reduce-tariff-impact/",
    "timestamp": "2025-04-03T13:31:34Z"
  },
  {
    "title": "\"Operation Over, Patient Healing\": Trump On US Economy After Tariff Move",
    "description": "President Donald Trump acknowledged the shock brought by his tariffs onslaught Thursday, but said the US economy would emerge &quot;far stronger,&quot; even as world markets tumbled.",
    "link": "https://www.ndtv.com/world-news/operation-over-patient-healing-donald-trump-on-us-economy-after-tariff-announcement-8079150",
    "timestamp": "2025-04-03T13:31:10Z"
  },
  {
    "title": "Republicans Own This",
    "description": "It’s hard to find a single Republican who ran for office promising to raise tariffs. Trade wars have never been part of the modern GOP orthodoxy. And yet, Donald Trump is now fully embracing one—openly",
    "link": "https://politicalwire.com/2025/04/03/republicans-own-this/",
    "timestamp": "2025-04-03T13:31:08Z"
  },
  {
    "title": "Auto industry unlikely to face Trump tariff's heat due to minimal exports",
    "description": "The recent tariff war is expected to have minimal impact on the Indian automobile industry due to limited exports to the US. Automobiles are exempt from new tariffs, while the ongoing US-India trade talks aim for a balanced resolution benefiting both economie…",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-news/auto-industry-unlikely-to-face-trump-tariffs-heat-due-to-minimal-exports/articleshow/119946929.cms",
    "timestamp": "2025-04-03T13:30:34Z"
  },
  {
    "title": "Russia Official Dmitriev to Meet Envoy Witkoff in Washington",
    "description": "Dmitriev on Thursday confirmed he was in Washington for meetings with representatives of the U.S. administration.",
    "link": "https://www.rigzone.com/news/wire/russia_official_dmitriev_to_meet_envoy_witkoff_in_washington-03-apr-2025-180125-article/",
    "timestamp": "2025-04-03T13:30:01Z"
  },
  {
    "title": "HIV workers race to plug funding gaps after Trump USAID cuts",
    "description": "<p>JOHANNESBURG - Tarryn Lokotsch can see the <strong>US aid money</strong> she desperately needs to help South African rape survivors sitting in her organisation's bank account, but she cannot touch a cent of it.</p>",
    "link": "https://www.bangkokpost.com/world/2994991/hiv-workers-race-to-plug-funding-gaps-after-trump-usaid-cuts",
    "timestamp": "2025-04-03T13:30:00Z"
  },
  {
    "title": "The biggest winners and losers in Europe as Trump announces sweeping tariffs",
    "description": "Global markets and businesses were thrown into disarray by U.S. President Donald Trump's tariff announcements on Thursday.",
    "link": "https://www.cnbc.com/2025/04/03/trump-liberation-day-tariffs-biggest-winners-and-losers.html",
    "timestamp": "2025-04-03T13:29:56Z"
  },
  {
    "title": "In the crosshairs of stiff US tariffs, tiny coral islands in the South Pacific and Arctic outposts",
    "description": "MELBOURNE, Australia (AP) — The Trump administration appears to be leaving no stone unturned with its sweeping tariffs around the globe, from rocky outcrops home to polar bears in the Arctic to tiny tropical islands to a former British penal colony whose lead…",
    "link": "https://financialpost.com/pmn/in-the-crosshairs-of-stiff-us-tariffs-tiny-coral-islands-in-the-south-pacific-and-arctic-outposts",
    "timestamp": "2025-04-03T13:29:52Z"
  },
  {
    "title": "Canada Trade Balance Flips to Deficit as Tariff Threats Grow",
    "description": "Canada’s exports to its biggest customer, the US, as well as other countries plunged in February, as threats and implementation of the Trump administration’s tariffs started to redraw global trading flows.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-trade-balance-flips-to-deficit-as-tariff-threats-grow",
    "timestamp": "2025-04-03T13:29:42Z"
  },
  {
    "title": "Trump administration axes more than $125m in LGBTQ health funding, upending research field",
    "description": "The National Institutes of Health has canceled more than 270 grants focused on LGBTQ health in recent weeks.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/trump-administration-axes-125m-lgbtq-health-funding-upending-research-rcna199175",
    "timestamp": "2025-04-03T13:29:27Z"
  },
  {
    "title": "Trump imposes highest tariff on African nation",
    "description": "Lesotho has yet to respond to the measure, which neighboring South Africa has criticized as a barrier to trade Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/615191-trump-imposes-highest-tariff-lesotho/",
    "timestamp": "2025-04-03T13:29:21Z"
  },
  {
    "title": "Kid Rock Says Bill Maher Brought Up Third Term Concerns During Trump Meeting: ‘It Really Freaks Bill Out’",
    "description": "Kid Rock revealed that Bill Maher brought up concerns over President Donald Trump seeking a third term during his recent visit to the White House.\nThe post Kid Rock Says Bill Maher Brought Up Third Term Concerns During Trump Meeting: ‘It Really Freaks Bill Ou…",
    "link": "https://www.mediaite.com/tv/kid-rock-says-bill-maher-brought-up-third-term-concerns-during-trump-meeting-it-really-freaks-bill-out/",
    "timestamp": "2025-04-03T13:28:07Z"
  },
  {
    "title": "Ford rolls out discounts to reassure car buyers on tariffs",
    "description": "With Donald Trump’s tariffs unsettling the economy, Ford Motor Co. is rolling out deep discounts on most of its lineup. Find out more",
    "link": "https://financialpost.com/transportation/autos/ford-rolls-out-tariff-discounts",
    "timestamp": "2025-04-03T13:27:42Z"
  },
  {
    "title": "Seafood producers confident in court challenge against N.L. government, fisheries union",
    "description": "The Association of Seafood Producers had its first day in court on Wednesday, challenging the Newfoundland and Labrador government and fisheries union over what it calls \"political interference\" during price setting negotiations ahead of the snow crab season.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/asp-court-challenge-1.7500743",
    "timestamp": "2025-04-03T13:26:04Z"
  },
  {
    "title": "Donald Trump's Tariffs Are Based on Bizarre Math—The Numbers Explained",
    "description": "The administration appears to have used a simple, two-step formula to calculate the \"reciprocal tariffs\" applied to trading partners.",
    "link": "https://www.newsweek.com/donald-trump-reciprocal-tariff-math-explained-2054743",
    "timestamp": "2025-04-03T13:25:29Z"
  },
  {
    "title": "Rand Paul Issues Dire Warning To Fellow Republicans About Trump Tariffs",
    "description": "The Kentucky senator was one of only four Republicans to vote against the Canada tariffs and the emergency powers Trump is using to impose them.",
    "link": "https://www.huffpost.com/entry/rand-paul-warns-republicans-that-trump-tariffs-will-lead-to-partys-political-decimation_n_67ee5d78e4b058f70b638e30",
    "timestamp": "2025-04-03T13:25:17Z"
  },
  {
    "title": "Elon Musk faces public backlash as approval rating hits rock bottom, Donald Trump’s DOGE chief under fire",
    "description": "Elon Musk's approval rating has plummeted due to his controversial role as a top advisor in Donald Trump's administration. A recent poll shows only 41% support him, with significant disapproval stemming from failed political endorsements and contentious polic…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-faces-public-backlash-as-approval-rating-hits-rock-bottom-donald-trumps-doge-chief-under-fire/articleshow/119946748.cms",
    "timestamp": "2025-04-03T13:25:10Z"
  },
  {
    "title": "Trump Tariffs Set to Wipe Out Nearly $2 Trillion From US Stocks (Bloomberg)",
    "description": "Bloomberg:\nTrump Tariffs Set to Wipe Out Nearly $2 Trillion From US Stocks … Roughly $1.7 trillion is set to be erased from the S&P 500 Index when trading opens Thursday amid worries that President Donald Trump's sweeping new round of tariffs could plunge the…",
    "link": "https://www.memeorandum.com/250403/p38",
    "timestamp": "2025-04-03T13:25:00Z"
  },
  {
    "title": "US and global markets plunge after President Donald Trump tariffs heighten chance of a broader trade war",
    "description": "Wall Street followed global markets sharply lower Thursday after U.S. President Donald Trump announced tariffs on imports of goods from around the world.\nThe double-digit tariff hikes rippled through world markets and economists are warning that the risk of r…",
    "link": "https://biztoc.com/x/011736c9c957470f",
    "timestamp": "2025-04-03T13:24:27Z"
  },
  {
    "title": "Trump Tariffs Take Down Apple, PC, Consumer Electronics Stocks",
    "description": "Apple stock and shares of other tech hardware companies plunged Thursday in response to stiff tariffs imposed late Wednesday by President Donald Trump.\nThe post Trump Tariffs Take Down Apple, PC, Consumer Electronics Stocks appeared first on Investor's Busine…",
    "link": "https://biztoc.com/x/6a07f40603eedb58",
    "timestamp": "2025-04-03T13:24:26Z"
  },
  {
    "title": "Liberation Day",
    "description": "You've been liberated from feeling good about your stock portfolio and meeting your household budget! It's Liberation Day, can't you feel it? Or at least",
    "link": "https://reason.com/2025/04/03/liberation-day-2/",
    "timestamp": "2025-04-03T13:24:25Z"
  },
  {
    "title": "President Donald Trump Unveils Tariffs, Risking Global Trade War",
    "description": "President Trump unveiled the sweeping tariffs on almost all global imports, sending stocks in a freefall and sparking critique from econimists.",
    "link": "https://hiphopwired.com/2667261/president-donald-trump-tariffs-global-trade-war/",
    "timestamp": "2025-04-03T13:24:22Z"
  },
  {
    "title": "Starmer on tariffs: 'New era' for trade, economy",
    "description": "British Prime Minister Keir Starmer on Thursday commented on the newly reciprocal tariffs imposed by the United States President Donald Trump, emphasizing that this is \"the beginning of a new era\" for...",
    "link": "https://biztoc.com/x/5a798af8d433751c",
    "timestamp": "2025-04-03T13:24:19Z"
  },
  {
    "title": "WINNING: Trump’s “Reciprocal Tariffs” Trigger Global Response — Multiple Nations Slash Import Duties on U.S. Goods",
    "description": "​Several countries have announced plans to reduce or eliminate tariffs on U.S. imports in response to President Donald Trump’s “reciprocal tariffs” policy, set to take effect on April 2, 2025. This policy aims to match the tariffs that other nations impose on…",
    "link": "https://freerepublic.com/focus/f-news/4308563/posts",
    "timestamp": "2025-04-03T13:24:18Z"
  },
  {
    "title": "Trump’s pitch on tariffs was built on a foundation of strange lies",
    "description": "President Donald Trump holds up a chart while speaking during a \"Make America Wealthy Again\" trade announcement event in the Rose Garden at the White House on April 2, 2025.",
    "link": "https://biztoc.com/x/d873ce8d834b08d3",
    "timestamp": "2025-04-03T13:24:16Z"
  },
  {
    "title": "Covalon Technologies Ltd. Poised for Strong Benefit From Positive US Tariff Outcome",
    "description": "MISSISSAUGA, Ontario — Covalon Technologies Ltd. (the “Company” or “Covalon”) (TSXV: COV; OTCQX: CVALF), an advanced medical technologies company is pleased to announce the very positive outcome for the Company with regards to the April 2, 2025 tariff announc…",
    "link": "https://financialpost.com/pmn/business-wire-news-releases-pmn/covalon-technologies-ltd-poised-for-strong-benefit-from-positive-us-tariff-outcome",
    "timestamp": "2025-04-03T13:23:51Z"
  },
  {
    "title": "Dollar, Stocks Sink, Gold Hits High On Trump Tariffs",
    "description": "The dollar and equity markets tumbled Thursday after President Donald Trump&#039;s latest tariffs salvo against countries worldwide, fanning a trade war that many fear will spark recession and ramp up inflation.",
    "link": "https://www.ndtv.com/world-news/dollar-stocks-sink-as-gold-hits-high-on-us-president-donald-trump-tariffs-8079091",
    "timestamp": "2025-04-03T13:23:21Z"
  },
  {
    "title": "Pharma Dodges The Tariff Bullet - But For How Long?",
    "description": "As long as pharmaceutical tariffs are being considered, their potential threat to the pharmaceutical industry and the people it serves remains.",
    "link": "https://www.forbes.com/sites/stephenbrozak/2025/04/03/pharma-dodges-the-tariff-bulletbut-for-how-long/",
    "timestamp": "2025-04-03T13:23:19Z"
  },
  {
    "title": "ET Market Watch: Sensex dips 322 points as Trump unleashes 26% tariffs",
    "description": "On Thursday, Indian benchmark indices closed lower, with the BSE Sensex dropping by 322.08 points and finishing the day at 76,295.36. The broader Nifty 50 index also declined, closing at 23,250.10, down by 82.25 points, or 0.35%.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/etmarkets-podcast/et-market-watch-sensex-dips-322-points-as-trump-unleashes-26-tariffs/podcast/119946728.cms",
    "timestamp": "2025-04-03T13:23:07Z"
  },
  {
    "title": "Tesla sales fall again in Germany amid Musk backlash",
    "description": "Tesla sales plunged again in Germany last month even as the broader electric car market rebounded, data showed Thursday, the latest sign of a growing backlash against billionaire owner Elon Musk. Just 2,229 of Tesla’s electric vehicles (EVs) were registered i…",
    "link": "https://www.digitaljournal.com/world/tesla-sales-fall-again-in-germany-amid-musk-backlash/article",
    "timestamp": "2025-04-03T13:22:33Z"
  },
  {
    "title": "Trump says US to emerge ‘stronger’ as markets tumble over tariffs",
    "description": "President Donald Trump acknowledged the shock brought by his tariffs onslaught Thursday, but said the US economy would emerge “far stronger,” even as world markets tumbled. “THE OPERATION IS OVER! THE PATIENT LIVED, AND IS HEALING. THE PROGNOSIS IS THAT THE P…",
    "link": "https://www.digitaljournal.com/world/trump-says-us-to-emerge-stronger-as-markets-tumble-over-tariffs/article",
    "timestamp": "2025-04-03T13:22:33Z"
  },
  {
    "title": "'Oh, sh—': RH CEO reacts live to stock tanking on tariffs, poor earnings",
    "description": "The executive also pointed out that the home furnisher has been contending with the \"worst housing market in almost 50 years.\"",
    "link": "https://www.cnbc.com/2025/04/03/oh-sh-rh-ceo-reacts-live-to-stock-tanking-on-tariffs-poor-earnings.html",
    "timestamp": "2025-04-03T13:21:24Z"
  },
  {
    "title": "Brick-wielding woman bashes Tesla as Boston police hunt suspected street menace",
    "description": "The Boston Police Department is searching for a woman who allegedly vandalized a Tesla with a brick on a Massachusetts street as nationwide attacks continue.",
    "link": "https://www.foxnews.com/us/brick-wielding-woman-bashes-tesla-boston-police-hunt-suspected-street-menace",
    "timestamp": "2025-04-03T13:20:45Z"
  },
  {
    "title": "US Hits India With 27% Reciprocal Tariffs, Cites Telecom Barriers and High Import Duties",
    "description": "The 27% reciprocal tariffs have been imposed as US telecom equipment is subjected to high tariffs in India, leading to a $5.3 billion annual loss in US exports. \nThe post US Hits India With 27% Reciprocal Tariffs, Cites Telecom Barriers and High Import Duties…",
    "link": "https://www.medianama.com/2025/04/223-us-hits-india-with-27-reciprocal-tariffs-cites-telecom-barriers-and-high-import-duties/",
    "timestamp": "2025-04-03T13:20:34Z"
  },
  {
    "title": "‘Come On!’ Trump’s Commerce Secretary Bristles When CBS Anchor Asks If Plug Could Be Pulled on Tariffs Amid Wall Street Bloodbath",
    "description": "Commerce Secretary Howard Lutnick is taking umbrage with the idea that a plunging stock market could get President Donald Trump to reverse course on tariffs.\nThe post ‘Come On!’ Trump’s Commerce Secretary Bristles When CBS Anchor Asks If Plug Could Be Pulled …",
    "link": "https://www.mediaite.com/news/come-on-trumps-commerce-secretary-bristles-when-cbs-anchor-asks-if-plug-could-be-pulled-on-tariffs-amid-wall-street-bloodbath/",
    "timestamp": "2025-04-03T13:18:38Z"
  },
  {
    "title": "Hungary announces ICC withdrawal as Israel's Netanyahu visits",
    "description": "Hungary on Thursday said it will quit the International Criminal Court, just as Prime Minister Viktor Orban hosted his Israeli counterpart Benjamin Netanyahu, whom the tribunal has accused of war crimes in Gaza.",
    "link": "https://www.hurriyetdailynews.com/hungary-announces-icc-withdrawal-as-israels-netanyahu-visits-207643",
    "timestamp": "2025-04-03T13:18:24Z"
  },
  {
    "title": "Russia, Cuba and North Korea escape worst of Trump's tariff wrath",
    "description": "MOSCOW: While US President Donald Trump announced tariffs on allies and foes including Europe, India, Japan and China, some of the world's most heavily sanctioned countries - Russia, Belarus, Cuba and North Korea - avoided being singled out for special puniti…",
    "link": "https://www.channelnewsasia.com/world/russia-cuba-and-north-korea-escape-worst-trumps-tariff-wrath-5042491",
    "timestamp": "2025-04-03T13:16:59Z"
  },
  {
    "title": "‘Extraordinary nonsense’: US author slams Trump’s 'bad math' on tariffs, says it ignores services, White House pushes back",
    "description": "He further pointed out that the administration is ignoring the US surplus in services trade and only factoring in goods when calculating the supposed tariff rates imposed by foreign nations",
    "link": "https://www.businesstoday.in/latest/world/story/extraordinary-nonsense-us-author-slams-trumps-bad-math-on-tariffs-says-it-ignores-services-white-house-pushes-back-470598-2025-04-03",
    "timestamp": "2025-04-03T13:16:46Z"
  },
  {
    "title": "Why Wall Street Bent the Knee to Trump on Tariffs",
    "description": "The stock market has been one of the few data points that Donald Trump cared about, but even that guardrail may have come off as his long-desired tariff scheme roils trading. Meanwhile the banks, who fear becoming Trump’s next flex after big law and academia,…",
    "link": "https://www.vanityfair.com/news/story/trump-wall-street-tariffs-silence",
    "timestamp": "2025-04-03T13:16:16Z"
  },
  {
    "title": "Donald Trump's tariff war: Trade expert breaks down US-India tariff war, says it’s consumers who lose the most",
    "description": "Reacting to the tariff decision, a trade professional laid out the implications clearly in a detailed post that quickly sparked online discussion.",
    "link": "https://www.businesstoday.in/latest/economy/story/donald-trumps-tariff-war-trade-expert-breaks-down-us-india-tariff-war-says-its-consumers-who-lose-the-most-470597-2025-04-03",
    "timestamp": "2025-04-03T13:15:13Z"
  },
  {
    "title": "US tariffs could reduce India's GDP growth by up to 50 basis points: Experts",
    "description": "US President Donald Trump implemented a 27% reciprocal tariff on India, along with increased duties on numerous other nations.",
    "link": "https://www.businesstoday.in/latest/economy/story/us-tariffs-could-reduce-indias-gdp-growth-by-up-to-50-basis-points-experts-470596-2025-04-03",
    "timestamp": "2025-04-03T13:15:05Z"
  },
  {
    "title": "Reciprocal tariffs: you won't believe how they came up with the numbers (Alexandra Scaggs/Financial Times)",
    "description": "Alexandra Scaggs / Financial Times:\nReciprocal tariffs: you won't believe how they came up with the numbers  —  There is some method to the madness — it's just a nonsensical method  —  Americans were told reciprocal tariffs would be simple.  “Reciprocal, that…",
    "link": "https://www.memeorandum.com/250403/p35",
    "timestamp": "2025-04-03T13:15:00Z"
  },
  {
    "title": "Oil Plunges as Trump Tariffs and OPEC+ Output Hike Hurt Market",
    "description": "Oil tumbled the most since 2023 after enduring a twin hit from President Donald Trump’s trade tariffs and an OPEC+ decision to increase output faster than previously announced.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-plunges-as-trump-tariffs-and-opec-output-hike-hurt-market",
    "timestamp": "2025-04-03T13:14:26Z"
  },
  {
    "title": "FACT CHECK: Has R. Kelly Been Released From Prison After Being Pardoned By Trump?",
    "description": "A TikTok video shared on Facebook claims rapper R. Kelly has purportedly been released from prison following a pardon from President Donald Trump. Verdict: False A White House spokesperson denied the claim’s validity in an email to Check Your Fact. Fact Check…",
    "link": "https://checkyourfact.com/2025/04/03/fact-check-r-kelly-released-prison-pardoned-trump/",
    "timestamp": "2025-04-03T13:14:26Z"
  },
  {
    "title": "Markets Gird For Rough Day: Here’s What Stocks Are Losing The Most In Tariff Selloff",
    "description": "The Asia-focused Liberation Day tariffs “could blow up Apple,” one analyst noted, though the iPhone maker is far from the only stock sliding Thursday.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/03/markets-gird-for-rough-day-heres-what-stocks-are-losing-the-most-in-tariff-selloff/",
    "timestamp": "2025-04-03T13:14:04Z"
  },
  {
    "title": "Markets Shudder: Here’s What Stocks Are Losing The Most In Tariff Selloff",
    "description": "The Asia-focused Liberation Day tariffs “could blow up Apple,” one analyst noted, as the iPhone maker led a near $800 billion magnificent seven slide.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/03/markets-shudder-heres-what-stocks-are-losing-the-most-in-tariff-selloff/",
    "timestamp": "2025-04-03T13:14:04Z"
  },
  {
    "title": "How smart investors should respond to new tariffs",
    "description": "U.S. President Donald Trump signed a sweeping tariff bill on Wednesday, imposing reciprocal duties on major trading partners including China, the European Union, Vietnam, and Taiwan. Carley Garner, senior strategist and broker at DeCarley Trading and contribu…",
    "link": "https://biztoc.com/x/0676dc3fadc30ab0",
    "timestamp": "2025-04-03T13:13:19Z"
  },
  {
    "title": "Semiconductors are exempt from Trump's massive 32% tariff on Taiwan though PC gamers will still feel the heat",
    "description": "President Trump says TSMC is \"one of the great companies of the world\" as he praises the chipmaker for investing in the US. But other companies are not so lucky.",
    "link": "https://www.pcgamer.com/hardware/semiconductors-are-exempt-from-trumps-massive-32-percent-tariff-on-taiwan-though-pc-gamers-will-still-feel-the-heat/",
    "timestamp": "2025-04-03T13:13:15Z"
  },
  {
    "title": "'He's flipped the system': Americans react to Trump's tariffs",
    "description": "Everyday Americans share their opinions on President Donald Trump's announcement of global tariffs.",
    "link": "https://www.bbc.com/news/videos/c86jqng2dvlo",
    "timestamp": "2025-04-03T13:12:34Z"
  },
  {
    "title": "'Math makes no sense at all': Lesotho, one of Africa's poorest nations, hit with 50% US tariff",
    "description": "Lesotho, a landlocked country in southern Africa, is part of the Southern African Customs Union (SACU) along with South Africa, Namibia, Eswatini, and Botswana.",
    "link": "https://www.businesstoday.in/latest/economy/story/math-makes-no-sense-at-all-lesotho-one-of-africas-poorest-nations-hit-with-50-us-tariff-470592-2025-04-03",
    "timestamp": "2025-04-03T13:12:17Z"
  }
]