[
  {
    "title": "Brian Cox says Donald Trump is a ‘very good example of a villain’: ‘No empathy whatsoever’",
    "description": "‘Succession’ star argued that the US president is moving the country towards an ‘oligarchy’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/brian-cox-donald-trump-succession-hbo-roy-b2805809.html",
    "timestamp": "2025-08-11T04:18:32Z"
  },
  {
    "title": "Telephone conversation with President of Tajikistan Emomali Rahmon",
    "description": "Vladimir Putin had a telephone conversation with President of the Republic of Tajikistan Emomali Rahmon.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/08/russia-250810-kremlin02.htm",
    "timestamp": "2025-08-11T04:17:45Z"
  },
  {
    "title": "Telephone conversation with President of Kyrgyzstan Sadyr Japarov",
    "description": "Vladimir Putin had a telephone conversation with President of the Kyrgyz Republic Sadyr Japarov.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/08/russia-250810-kremlin01.htm",
    "timestamp": "2025-08-11T04:17:12Z"
  },
  {
    "title": "Musk's Tesla applies to supply power to British homes",
    "description": "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
    "link": "https://www.bbc.com/news/articles/c3v3333rlp7o",
    "timestamp": "2025-08-11T04:17:07Z"
  },
  {
    "title": "Cowardly Israeli Murder of 5 Journalists, including Anas al-Sharif, Smearing them as Hamas",
    "description": "Ann Arbor (Informed Comment) - The Israeli state by now has a long and sanguinary history of murdering writers and journalists in cold blood. In 1972, Israeli commandos murdered novelist, painter and short story writer Ghassan Kanafani in Beirut with a car bo…",
    "link": "https://www.juancole.com/2025/08/cowardly-journalists-including.html",
    "timestamp": "2025-08-11T04:15:58Z"
  },
  {
    "title": "Trump considering deploying up to 1,000 National Guard to D.C. (NBC4 Washington)",
    "description": "NBC4 Washington:\nTrump considering deploying up to 1,000 National Guard to D.C. … President Donald Trump is considering deploying up to 1,000 National Guard troops to D.C. and could make the announcement as early as Monday, one defense official and two U.S. o…",
    "link": "https://www.memeorandum.com/250811/p1",
    "timestamp": "2025-08-11T04:10:00Z"
  },
  {
    "title": "Shrimp Exporters Seek Government Aid As Trump Tariffs Threaten $2 Billion Exports",
    "description": "The Seafood Export Association of India has approached the ministries of commerce and finance to seek emergency financial support as $2 billion worth of shrimp exports to the US face severe disruptions due to increased tariffs imposed by President Donald Trum…",
    "link": "https://www.ndtvprofit.com/business/shrimp-exporters-seek-government-aid-as-trump-tariffs-threaten-2-billion-exports",
    "timestamp": "2025-08-11T04:09:07Z"
  },
  {
    "title": "Federal agents spread out across D.C. streets amid Trump vow to crackdown on crime",
    "description": "President Trump promised a weekend crackdown of Washington, D.C.'s homeless population and criminals. Trump activated federal agents to also be a show of force across the district.",
    "link": "https://www.npr.org/2025/08/11/nx-s1-5497749/dc-trump-crackdown-crime",
    "timestamp": "2025-08-11T04:01:05Z"
  },
  {
    "title": "Trump’s Trade Tantrums and Bullying Hit a Wall of Solid BRICS",
    "description": "U.S. power has become increasingly redundant and indeed something to repudiate. President Donald Trump’s estimation of American power, like that of his own abilities, is increasingly seen to be badly overblown. This week, he threatened some 90 nations with to…",
    "link": "https://www.lewrockwell.com/2025/08/no_author/trumps-trade-tantrums-and-bullying-hit-a-aall-of-solid-brics/",
    "timestamp": "2025-08-11T04:01:00Z"
  },
  {
    "title": "Trump Meets Putin in Alaska",
    "description": "Donald Trump stays true to his line and asserts dominance over the geopolitical chessboard -- symbolically as well as practically. Following the announcement of a trade deal with the EU at his golf resort in Turnberry, Scotland, peace talks in the Uk...",
    "link": "https://www.americanthinker.com/articles/2025/08/trump_meets_putin_in_alaska.html",
    "timestamp": "2025-08-11T04:00:00Z"
  },
  {
    "title": "Barack Obama and the Predictable Coup",
    "description": "Photo Credit:Image: NASA Goddard Space Flight Center via Flickr, CC BY 2.0 (cropped).\r\n\n \n NASA Goddard Space Flight CenterSome people just can’t believe that Obama could do the things he’s accused of. But for those who know him, it’s undeniable.",
    "link": "https://www.americanthinker.com/articles/2025/08/barack_obama_and_the_predictable_coup.html",
    "timestamp": "2025-08-11T04:00:00Z"
  },
  {
    "title": "Inside the August Acceleration: How Comey and Company Ignored the Red Flags",
    "description": "Photo Credit:james comey reading a newspaper headlined bad news with pictures of trump and russia\n \n Chatgpt for American ThinkerAs revelations unfolded through the summer and fall of 2016, top Obama officials, intelligence agencies, and political operatives …",
    "link": "https://www.americanthinker.com/articles/2025/08/the_august_acceleration_how_comey_and_company_ignored_the_red_flags.html",
    "timestamp": "2025-08-11T04:00:00Z"
  },
  {
    "title": "Be like Reagan: Walk away from a bad Russian deal",
    "description": "When President Donald Trump sits down with Vladimir Putin in Alaska this week, he must be ready to do what the Gipper did in Reykjavík: Walk away if the deal is bad for America.\r\n\r\nAt the Reykjavík Summit in 1986, President Ronald Reaga...",
    "link": "https://www.americanthinker.com/blog/2025/08/be_like_reagan_walk_away_from_a_bad_russian_deal.html",
    "timestamp": "2025-08-11T04:00:00Z"
  },
  {
    "title": "Democrats’ hypocritical Epstein assault",
    "description": "In the sweltering summer of 2025, the ghost of Jeffrey Epstein has been resurrected once again as a political bludgeon wielded by desperate Democrats. Whereas the midterm elections loom, House and Senate Democrats are pounding the drum for the full r...",
    "link": "https://www.americanthinker.com/blog/2025/08/democrats_hypocritical_epstein_assault.html",
    "timestamp": "2025-08-11T04:00:00Z"
  },
  {
    "title": "If Trump Can’t Handcuff the Swamp, This Will Do",
    "description": "The Barack Obama and Hillary Clinton plan to undermine an election is unraveling.  Evidence is being revealed.  Whistleblowers are coming forward.  Bureaucrats are being fired.  Criminal referrals are being mad...",
    "link": "https://www.americanthinker.com/articles/2025/08/if_trump_can_t_handcuff_the_swamp_this_will_do.html",
    "timestamp": "2025-08-11T04:00:00Z"
  },
  {
    "title": "Sensex jumps over 100 pts, Nifty above 24,400; PSU banks rally",
    "description": "Indian stock markets saw a slight increase at the start of the week. This follows a six-week period of losses. SBI shares rose after strong quarterly results. Voltas stock declined due to lower-than-expected profits. Concerns remain about potential tariffs fr…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-100-pts-nifty-above-24400-psu-bank-stocks-rally/articleshow/123227321.cms",
    "timestamp": "2025-08-11T03:57:43Z"
  },
  {
    "title": "Trump urges China's Xi to 'quadruple' US soybean orders",
    "description": "United States President Donald Trump voiced his hope that China \"will quickly quadruple\" its soybean orders from the US as a way of \"substantially reducing\" its trade deficit with ...",
    "link": "https://biztoc.com/x/d34cadef910ff7e5",
    "timestamp": "2025-08-11T03:57:42Z"
  },
  {
    "title": "Curtis Sliwa: Trump’s attacks on Mamdani could energize his campaign",
    "description": "Republican NYC mayoral nominee Curtis Sliwa warns that President Trump's involvement in the NYC mayoral race could help Zohran Mamdani.",
    "link": "https://www.israelnationalnews.com/news/413067",
    "timestamp": "2025-08-11T03:54:09Z"
  },
  {
    "title": "Late Night Open Thread: Where’s *Our* Truth & Reconciliation Commission?",
    "description": "Said it before, will say it again: The worst political blunder of my lifetime was letting Nixon’s CREEPsters scuttle off to think-tanks and other safe havens, rather than pursuing them to the full extent of the law, down to the last lowly Dick Cheney. Gerry F…",
    "link": "https://balloon-juice.com/2025/08/10/late-night-open-thread-wheres-our-truth-reconciliation-commission/",
    "timestamp": "2025-08-11T03:50:22Z"
  },
  {
    "title": "Trump orders homeless he passed en route to golf course to leave Washington DC (Robert Mackey/The Guardian)",
    "description": "Robert Mackey / The Guardian:\nTrump orders homeless he passed en route to golf course to leave Washington DC  —  President demands unhoused residents leave US capital or face eviction and vowed to use officers to make arrests  —  In a social media post on Sun…",
    "link": "https://www.memeorandum.com/250810/p69",
    "timestamp": "2025-08-11T03:40:00Z"
  },
  {
    "title": "Though largely symbolic, Palestinian recognition is not an empty gesture",
    "description": "Momentum is building internationally for the recognition of a Palestinian state, with five new countries declaring they are ready to take the step. Though the move is largely seen as symbolic, some say it still carries great diplomatic and moral weight.",
    "link": "https://www.abc.net.au/news/2025-08-11/recognition-of-palestinian-statehood-gaining-momentum/105594476",
    "timestamp": "2025-08-11T03:35:06Z"
  },
  {
    "title": "Going To ‘Be A Big Week’—Bitcoin Suddenly Soars As Crypto Braces For Massive Price Shocks",
    "description": "Bitcoin is braced for price shocks from bitcoin treasury companies as well as all-important U.S. inflation data that could all but confirm a Federal Reserve interest rate cut in September...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/10/going-to-be-a-big-week-bitcoin-suddenly-soars-as-crypto-braces-for-massive-price-shocks/",
    "timestamp": "2025-08-11T03:24:23Z"
  },
  {
    "title": "Asian Markets Waver To Start Key Week For Trade, US Data",
    "description": "Asian markets mostly rose Monday as investors eyed a week dominated by speculation about US inflation data and a prolonged pause for Washington's tariffs on China.",
    "link": "https://www.ibtimes.com/asian-markets-waver-start-key-week-trade-us-data-3780630",
    "timestamp": "2025-08-11T03:21:21Z"
  },
  {
    "title": "Nvidia and AMD will reportedly pay 15% of their Chinese revenue to the US government so they can sell AI-capable chips there, despite warnings from security experts",
    "description": "Nvidia and AMD will reportedly pay 15% of their Chinese revenue to the US government so they can sell AI-capable chips there, despite warnings from security experts",
    "link": "https://www.pcgamer.com/hardware/nvidia-and-amd-will-reportedly-pay-15-percent-of-their-chinese-revenue-to-the-us-government-so-they-can-sell-ai-capable-chips-there-despite-warnings-from-security-experts/",
    "timestamp": "2025-08-11T03:18:21Z"
  },
  {
    "title": "Asian markets waver to start key week for trade, US data",
    "description": "Asian markets mostly rose Monday as investors eyed a week dominated by speculation about US inflation data and a prolonged pause for Washington’s tariffs on China. Observers expect Donald Trump to announce an extension of a trade war truce reached with China …",
    "link": "https://www.digitaljournal.com/world/asian-markets-waver-to-start-key-week-for-trade-us-data/article",
    "timestamp": "2025-08-11T03:17:32Z"
  },
  {
    "title": "Asian markets waver to start key week for trade, US data",
    "description": "Asian markets mostly rose Monday as investors eyed a week dominated by speculation about US inflation data and a prolonged pause for Washington's tariffs on ...",
    "link": "https://finance.yahoo.com/news/asian-markets-waver-start-key-031533490.html",
    "timestamp": "2025-08-11T03:15:33Z"
  },
  {
    "title": "Israel Hamas War: Netanyahu doubles down as Israel plans final push to crush Hamas strongholds in Gaza city",
    "description": "Israel Hamas News: Israeli Prime Minister Benjamin Netanyahu has announced plans to seize Gaza City, aiming to eliminate remaining Hamas strongholds despite rising domestic protests and international alarm. The operation intends to dismantle Hamas's control w…",
    "link": "https://economictimes.indiatimes.com/news/defence/netanyahu-doubles-down-israel-plans-final-push-to-crush-hamas-strongholds-in-gaza-city/articleshow/123226781.cms",
    "timestamp": "2025-08-11T03:01:42Z"
  },
  {
    "title": "Goodbye, $165,000 tech jobs, student coders seek work at Chipotle",
    "description": "Once hailed as a golden career path, computer science drew record enrollments thanks to tech leaders promising high salaries and perks. Now, AI coding tools and tech layoffs are shrinking opportunities, leaving many grads unemployed and shifting industry focu…",
    "link": "https://economictimes.indiatimes.com/tech/technology/goodbye-165000-tech-jobs-student-coders-seek-work-at-chipotle/articleshow/123226737.cms",
    "timestamp": "2025-08-11T02:49:36Z"
  },
  {
    "title": "Little offered to Vietnam farmers displaced for $1.5 billion Trump golf club",
    "description": "While some see opportunity, many of the farmers are elderly and fear they will struggle to find alternative livelihoods in Vietnam's vibrant economy.",
    "link": "https://www.japantimes.co.jp/news/2025/08/11/asia-pacific/vietnam-farmers-trump-golf-club/",
    "timestamp": "2025-08-11T02:49:00Z"
  },
  {
    "title": "Chip giants Nvidia and AMD to pay 15% of China revenue to US",
    "description": "One global trade expert told the BBC that the agreement is \"unprecedented\".",
    "link": "https://www.bbc.co.uk/news/articles/cvgvvnx8y19o",
    "timestamp": "2025-08-11T02:42:34Z"
  },
  {
    "title": "Intel CEO to visit White House on Monday: WSJ",
    "description": "Tan is expected to have a conversation with Trump while looking to explain his personal and professional background, the report said, adding that he could propose ways Intel and the US government could work together. Tan hopes to get Trump's approval by displ…",
    "link": "https://economictimes.indiatimes.com/tech/technology/intel-ceo-to-visit-white-house-on-monday-wsj/articleshow/123226597.cms",
    "timestamp": "2025-08-11T02:41:45Z"
  },
  {
    "title": "Nvidia, AMD to pay 15% of China chip sale revenues to US, official says",
    "description": "US President Donald Trump's administration halted sales of H20 chips to China in April, but Nvidia last month announced the US said that it would allow the company to resume sales and it hoped to start deliveries soon.",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-amd-to-pay-15-of-china-chip-sale-revenues-to-us-official-says/articleshow/123226581.cms",
    "timestamp": "2025-08-11T02:40:55Z"
  },
  {
    "title": "The Russian past of Alaska, where Trump and Putin will meet",
    "description": "Russian influence still endures in parts of the remote state on the northwest edge of the North American continent, which extends just a few miles from Russia.",
    "link": "https://www.japantimes.co.jp/news/2025/08/11/world/politics/russian-past-alaska-trump-putin/",
    "timestamp": "2025-08-11T02:40:00Z"
  },
  {
    "title": "Sanders: Israel becoming a 'pariah state' under Netanyahu’s leadership",
    "description": "Senator Bernie Sanders criticizes PM Netanyahu, claiming recent policies have made Israel \"almost a pariah state\" globally. While recognizing Israel's right to defend itself, Sanders blames Netanyahu government for worsening Gaza's humanitarian crisis.",
    "link": "https://www.israelnationalnews.com/news/413065",
    "timestamp": "2025-08-11T02:38:14Z"
  },
  {
    "title": "'Propaganda hire': Analysts admonish MAGA-aligned economist Trump could pick to lead BLS",
    "description": "Reports indicate President Donald Trump is interviewing candidates for the vacant Bureau of Labor Statistics Commissioner position, and analysts admonished one potential candidate on Sunday. The Wall Street Journal reported that Trump is considering hiring th…",
    "link": "https://www.rawstory.com/trump-2673873731/",
    "timestamp": "2025-08-11T02:27:34Z"
  },
  {
    "title": "Gold slips as dollar firms, investors book profit; US data on tap",
    "description": "Gold prices experienced a dip on Monday, influenced by a stronger dollar and profit-taking after a recent surge. Investors are keenly awaiting U.S. inflation data, crucial for gauging the Federal Reserve's interest rate strategy. Spot gold decreased by 0.7% t…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-slips-as-dollar-firms-investors-book-profit-us-data-on-tap/articleshow/123226450.cms",
    "timestamp": "2025-08-11T02:26:37Z"
  },
  {
    "title": "South Korea, Vietnam leaders to pledge deeper ties amid trade challenges",
    "description": "SEOUL: South Korea and Vietnam will pledge deeper economic and strategic cooperation when their leaders hold a summit on Monday (Aug 11) as the former Cold War-era foes seek to leverage their business ties to navigate a challenging global trading environment.…",
    "link": "https://www.channelnewsasia.com/asia/south-korea-vietnam-leaders-pledege-ties-trade-challenges-5287981",
    "timestamp": "2025-08-11T02:26:10Z"
  },
  {
    "title": "Donald Trump urgently orders homeless to leave Washington DC after golf course drive",
    "description": "On August 10, 2025, President Donald Trump ordered homeless people in Washington DC to leave immediately, promising shelter far from the capital. Despite dropping violent crime rates, he sent federal agents to patrol the city. Local leaders, including Mayor M…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/donald-trump-urgently-orders-homeless-to-leave-washington-dc-after-golf-course-drive/articleshow/123226429.cms",
    "timestamp": "2025-08-11T02:25:35Z"
  },
  {
    "title": "Russia and Ukraine hold fast to their demands ahead of a planned Putin-Trump summit",
    "description": "Russian President Vladimir Putin has maintained Moscow’s uncompromising demands in the war in Ukraine.",
    "link": "https://www.wpxi.com/news/local/russia-ukraine-hold-fast-their-demands-ahead-planned-putin-trump-summit/L5GHT5JPQZBLRKZ2JZY65YXJFY/",
    "timestamp": "2025-08-11T02:21:03Z"
  },
  {
    "title": "U.S. Military Preparing For National Guard Activation In Washington D.C., Officials Say",
    "description": "The U.S. military is preparing for the activation of hundreds of National Guard troops to Washington, D.C., two U.S. officials told Reuters on Sunday.",
    "link": "https://www.huffpost.com/entry/national-guard-washington-dc-trump_n_68995131e4b07d71851c8f66",
    "timestamp": "2025-08-11T02:17:22Z"
  },
  {
    "title": "The Russian past of Alaska, where Trump and Putin will meet",
    "description": "Presidents Donald Trump and Vladimir Putin will hold a high-stakes meeting about the Ukraine war on Friday in Alaska, which the United States bought from Russia more than 150 years ago. They fled just weeks after Putin ordered an unpopular mobilization of cit…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/the-russian-past-of-alaska-where-trump-and-putin-will-meet/articleshow/123226303.cms",
    "timestamp": "2025-08-11T02:07:26Z"
  },
  {
    "title": "Hundreds of National Guard troops to flood Washington DC as Trump posts images of homeless from motorcade: 'We want our Capital BACK'",
    "description": "Hundreds of National Guard troops were expected to flood the streets of Washington DC as President Donald Trump threatens a federal takeover of the capital. The move came as Trump blasted the crime and homelessness in DC while deploying 120 FBI agents to work…",
    "link": "https://freerepublic.com/focus/f-chat/4333866/posts",
    "timestamp": "2025-08-11T02:02:48Z"
  },
  {
    "title": "Via News Corp, Australia’s defence policy continues to be dictated by our economic enemy",
    "description": "Wherever you turn in the defence debate, America maintains a strong presence — particularly via News Corp. Yet the Murdoch-owned entity is only one part of a broader ecosystem of US influence.\nThe post Via News Corp, Australia’s defence policy continues to be…",
    "link": "http://www.crikey.com.au/2025/08/11/defence-news-corp-usa-the-australian-albanese-marles/",
    "timestamp": "2025-08-11T01:59:33Z"
  },
  {
    "title": "Miranda Devine: Trump turns tables on Democrats after years of lawfare — now it’s time to hold them accountable",
    "description": "\"No one is above the law” was the favorite refrain of Democrats as they pursued Donald Trump uphill and down dale in an effort to destroy his first presidency and ensure he could never serve again.",
    "link": "https://nypost.com/2025/08/10/opinion/miranda-devine-trump-turns-tables-on-democrats-after-years-of-lawfare-now-its-time-to-hold-them-accountable/",
    "timestamp": "2025-08-11T01:58:37Z"
  },
  {
    "title": "Will Trump’s Winning Streak Continue When Congress Returns?",
    "description": "By George Caldwell, The Daily Signal | August 10, 2025\nPresident Donald Trump, though working with razor-thin majorities in the House and Senate, has won in almost every single legislative fight of the 119th Congress. But is there a risk his congressional win…",
    "link": "https://biztoc.com/x/8d92372b6e8dff69",
    "timestamp": "2025-08-11T01:55:31Z"
  },
  {
    "title": "Trump Orders Increased Federal Law Enforcement In DC",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | August 08, 2025\nPresident Donald Trump ordered police to increase their presence in the District of Columbia after an attack on a Department of Government Efficiency staffer.\n“President Trump has directed an …",
    "link": "https://biztoc.com/x/70fe7222e916513e",
    "timestamp": "2025-08-11T01:55:21Z"
  },
  {
    "title": "Trump Wanted Intel CEO Out, Now Lip-Bu Tan Is Heading To The White House On Monday: Report",
    "description": "Intel Corporation (NASDAQ:INTC) CEO Lip-Bu Tan is reportedly set to meet with President Donald Trump at the White House on Monday, after facing criticism over his past business ties to China.\nTrump Calls For Tan's Resignation Amid China Ties Controversy\nTan c…",
    "link": "https://biztoc.com/x/d50902f98737378e",
    "timestamp": "2025-08-11T01:55:06Z"
  },
  {
    "title": "War for Ukraine Day 1,263: Ripple Effects",
    "description": "I’m just going to do a quick update tonight covering the basics. We’re continuing to see Trump and his natsec team’s new new position on Ukraine be articulated. This time by the Vice President of a Thousand Names: JD Vance: “We’re done with the funding of the…",
    "link": "https://balloon-juice.com/2025/08/10/war-for-ukraine-day-1263-ripple-effects/",
    "timestamp": "2025-08-11T01:47:16Z"
  },
  {
    "title": "Analyst warns Trump created a 'very new' expectation for GOP — and it could outlast him",
    "description": "President Donald Trump has created a new requirement for people to become members of the Republican Party, and those expectations appear to have some staying power, according to one analyst. Marc Elias, lawyer and founder of Democracy Docket, said in a YouTub…",
    "link": "https://www.rawstory.com/trump-2673873648/",
    "timestamp": "2025-08-11T01:46:16Z"
  },
  {
    "title": "Why Stocks Keeps Rising—Despite Trump’s Tariff Chaos",
    "description": "A Trump hat on the floor at the New York Stock Exchange in New York, US, on Friday, Aug. 8, 2025. Credit - Michael Nagle—Bloomberg/Getty Images\nAs America hikes tariffs sharply, the jobs market slips, and President Donald Trump turns his ire from Harvard to t…",
    "link": "https://biztoc.com/x/e2712c664bab2f1e",
    "timestamp": "2025-08-11T01:44:18Z"
  },
  {
    "title": "Oil prices fall as market eyes US-Russia talks on Ukraine",
    "description": "Oil prices declined in early Asian trading due to increased U.S. tariffs, OPEC output hikes, and hopes for a U.S.-Russia Ukraine ceasefire agreement. Brent crude fell to $66.07 a barrel, while WTI dropped to $63.30. Expectations of eased sanctions on Russian …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-fall-as-market-eyes-us-russia-talks-on-ukraine/articleshow/123226149.cms",
    "timestamp": "2025-08-11T01:43:58Z"
  },
  {
    "title": "Rupee outlook hinges on US tariffs, RBI action; bonds to track inflation data",
    "description": "The Indian Rupee's future hinges on US tariffs and the Reserve Bank of India's actions. The rupee weakened due to US tariffs on Indian goods. The RBI is defending the rupee's low against the dollar. US and India inflation data are key events to watch. Bond yi…",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-outlook-hinges-on-us-tariffs-rbi-action-bonds-to-track-inflation-data/articleshow/123226134.cms",
    "timestamp": "2025-08-11T01:41:57Z"
  },
  {
    "title": "CNBC Daily Open: Chipping away at semiconductor revenues",
    "description": "U.S. stocks have received a strong boost from the artificial intelligence boom, ending the week on a high note.",
    "link": "https://www.cnbc.com/2025/08/11/cnbc-daily-open-chipping-away-at-semiconductor-revenues.html",
    "timestamp": "2025-08-11T01:39:37Z"
  },
  {
    "title": "Trump Family’s Crypto Venture Targets $1.5 Billion Deal",
    "description": "Trump family-backed World Liberty Financial is reportedly pitching investors on a new project. [contact-form-7] The firm aims to create a public company that would hold its WLFI tokens and hopes to raise around $1.5 billion for the venture, Bloomberg News rep…",
    "link": "http://www.pymnts.com/cryptocurrency/2025/trump-familys-crypto-venture-targets-1-5-billion-deal/",
    "timestamp": "2025-08-11T01:36:11Z"
  },
  {
    "title": "Roughly 450 federal agents will roam DC streets overnight as Trump announcement looms",
    "description": "Roughly 450 federal officers are expected to appear around D.C. late Sunday night into early Monday morning as Trump administration again lauds its efforts to c",
    "link": "https://wjla.com/news/local/federal-agents-dc-crime-streets-homeless-drugs-safety-trump-administration-operation-washington-weapons-beauty-autonomy-safe-donald",
    "timestamp": "2025-08-11T01:34:52Z"
  },
  {
    "title": "The Potential Impact of Trump’s NIL Draft Order on Athletes",
    "description": "President Donald Trump has signed an executive order that may change the future of name, image and likeness in collegiate athletics. The order, titled “Saving College Sports,” notably discusses some current unknowns inside the NIL process. It also aims to int…",
    "link": "https://dailyutahchronicle.com/2025/08/10/the-potential-impact-of-trumps-nil-draft-order-on-athletes/",
    "timestamp": "2025-08-11T01:34:05Z"
  },
  {
    "title": "Trump considering deploying up to 1,000 National Guard to D.C.",
    "description": "President Donald Trump is considering deploying up to 1,000 National Guard troops to D.C., according to one defense official and two U.S. officials.",
    "link": "https://www.nbcwashington.com/news/local/trump-considering-deploying-up-to-1000-national-guard-to-d-c/3973239/",
    "timestamp": "2025-08-11T01:26:42Z"
  },
  {
    "title": "Trump warns homeless to leave Washington, D.C., ‘immediately’ - NewsBreak",
    "description": "President Donald Trump said on social media that \"the Homeless have to move out, IMMEDIATELY. We will give you places to stay, but FAR from the Capital.\" I",
    "link": "https://www.newsbreak.com/share/4167300690715-trump-warns-homeless-to-leave-washington-d-c-immediately?s=a99&amp;share_destination_id=MjMzNTc3NTc4LTE3NTQ4NzUzOTExNDA%3D&amp;pd=0Fo4CI0L&amp;hl=en_US&amp;send_time=1754875391&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q3-v8%2Cns_foryou_recall_exp_25q3-v6%2Cns_foryou_blend_exp_25q3-v4%2Cns_foryou_rank_exp_25q3-v5",
    "timestamp": "2025-08-11T01:26:14Z"
  },
  {
    "title": "Nifty, Sensex to open negative amid cautious market sentiment",
    "description": "Cautious market outlook amid escalating India-US tariff tensions, with focus on Putin-Trump meeting and DIIs resilience.",
    "link": "https://www.thehindubusinessline.com/markets/nifty-sensex-to-open-in-negative-amid-cautious-sentiment/article69918643.ece",
    "timestamp": "2025-08-11T01:25:53Z"
  },
  {
    "title": "Oil prices fall as market eyes US-Russia talks on Ukraine",
    "description": "BEIJING :Oil prices fell in early Asian trading on Monday, extending declines of more than 4 per cent last week on higher U.S. tariffs on its trading partners, an OPEC output hike, and expectations the U.S. and Russia were moving closer to a Ukraine ceasefire…",
    "link": "https://www.channelnewsasia.com/business/oil-prices-fall-market-eyes-us-russia-talks-ukraine-5287926",
    "timestamp": "2025-08-11T01:24:53Z"
  },
  {
    "title": "Oil prices fall as market eyes US-Russia talks on Ukraine",
    "description": "BEIJING (Reuters) -Oil prices fell in early Asian trading on Monday, extending declines of more than 4% last week on higher U.S. tariffs on its trading...",
    "link": "https://sg.finance.yahoo.com/news/oil-prices-fall-market-eyes-012453564.html",
    "timestamp": "2025-08-11T01:24:53Z"
  },
  {
    "title": "Oil prices fall as market eyes US-Russia talks on Ukraine",
    "description": "BEIJING (Reuters) -Oil prices fell in early Asian trading on Monday, extending declines of more than 4% last week on higher U.S. tariffs on its trading...",
    "link": "https://finance.yahoo.com/news/oil-prices-fall-market-eyes-012453155.html",
    "timestamp": "2025-08-11T01:24:53Z"
  },
  {
    "title": "Ex-government officials pen letter blasting Kash Patel's FBI 'purge'",
    "description": "Former government officials group The Steady State criticizes FBI Director Kash Patel for removing agents, claiming political weaponization of the bureau.",
    "link": "https://www.foxnews.com/politics/ex-government-officials-pen-letter-blasting-kash-patels-fbi-purge",
    "timestamp": "2025-08-11T01:24:08Z"
  },
  {
    "title": "Share Market Highlights: Sensex rallies 746 points to 80,604; Nifty ends near 24,600",
    "description": "Sensex, Nifty updates on 11 August 2025: The BSE Sensex surged 746 points (0.93%) to close at 80,604.08 on Monday, driven by strong buying in oil, auto, and banking stocks, alongside fresh foreign fund inflows. During intraday trade, the index touched 80,636.…",
    "link": "https://www.thehindubusinessline.com/markets/stock-market-highlights-11-august-2025/article69917488.ece",
    "timestamp": "2025-08-11T01:16:34Z"
  },
  {
    "title": "Of data, analysis and cricket",
    "description": "Cricket is a non-linear sport that makes prediction based on data impossible. So the past is no guide to the future",
    "link": "https://www.thehindubusinessline.com/opinion/of-data-analysis-and-cricket/article69917364.ece",
    "timestamp": "2025-08-11T01:15:00Z"
  },
  {
    "title": "Asian shares edge up, US inflation data looms large",
    "description": "Trade and geopolitics also loom large with a U.S. tariff deadline on China due to expire on Tuesday amid expectations it will get extended again, while President Donald Trump and Russian leader Vladimir Putin are due to meet in Alaska on Friday to discuss Ukr…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-edge-up-us-inflation-data-looms-large/articleshow/123225951.cms",
    "timestamp": "2025-08-11T01:08:34Z"
  },
  {
    "title": "Chip giants Nvidia and AMD to pay 15% of China revenue to US",
    "description": "The agreement is part of a deal to secure export licences to the world's second biggest economy.",
    "link": "https://www.bbc.com/news/articles/cvgvvnx8y19o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-11T01:07:06Z"
  },
  {
    "title": "Trump’s Pakistan Pivot: There is Growing Evidence Islamabad has Seduced the White House With Lucrative Financial Arrangements",
    "description": "Since returning to office in January 2025, President Donald Trump has shown a marked shift in his approach to South Asian geopolitics, displaying what analysts describe as a more favorable stance toward Pakistan while simultaneously straining relations with I…",
    "link": "https://freerepublic.com/focus/f-news/4333861/posts",
    "timestamp": "2025-08-11T01:03:02Z"
  },
  {
    "title": "“Got sent to Iraq”: 20 experiences that changed someone’s political views",
    "description": "Hundreds of honest Redditors came forward to share the events and people they witnessed that changed their political leanings. Sometimes, all it takes is a new experience or a scrap of information to shift one's perspective on life, or, more often, the ill-fa…",
    "link": "https://www.dailydot.com/viral-politics/experiences-that-changed-someones-political-views/",
    "timestamp": "2025-08-11T01:00:08Z"
  },
  {
    "title": "Stocks, US yields lose ground as markets brace for big week for trade, geopolitics",
    "description": "NEW YORK/LONDON (Reuters) -Global equity markets lost ground on Monday in a choppy session while yields of long-dated U.S. Treasuries fell, as investors...",
    "link": "https://finance.yahoo.com/news/shares-edge-asia-us-inflation-005915761.html",
    "timestamp": "2025-08-11T00:59:15Z"
  },
  {
    "title": "Trump wants to evict homeless from Washington and send them 'far from the capital'",
    "description": "President Trump has pledged to address homelessness and crime in Washington, D.C., despite Mayor Bowser's assertion that the city is not experiencing a crime spike. Trump plans to evict homeless individuals and jail criminals, raising questions about the lega…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-wants-to-evict-homeless-from-washington-and-send-them-far-from-the-capital/articleshow/123225837.cms",
    "timestamp": "2025-08-11T00:56:18Z"
  },
  {
    "title": "Russell T Davies issues stark warning for LGBTQ+ community: ‘They’re out to get us’",
    "description": "It’s a Sin and Queer as Folk writer Russell T Davies has warned that the LGBTQ+ community should be ‘revolting in terror’ against the rise of far-right politicians such as Reform. Russell T Davies, best known for his work on the BBC’s long-running sci-fi show…",
    "link": "https://www.thepinknews.com/2025/08/11/russell-t-davies-lgbt-community-right-wing/",
    "timestamp": "2025-08-11T00:49:51Z"
  },
  {
    "title": "Chip giants Nvidia and AMD to pay 15% of China revenue to US",
    "description": "The agreement is part of a deal to secure export licences to the world's second biggest economy.",
    "link": "https://www.bbc.com/news/articles/cvgvvnx8y19o",
    "timestamp": "2025-08-11T00:49:31Z"
  },
  {
    "title": "Zelenskyy wins EU and NATO backing as he seeks place at Trump-Putin talks",
    "description": "A White House official has said President Donald Trump is open to Ukrainian President Volodymyr Zelenskyy attending, but preparations are under way for only a bilateral meeting.",
    "link": "https://www.japantimes.co.jp/news/2025/08/11/world/politics/zelenskyy-eu-nato-trump-putin-talks/",
    "timestamp": "2025-08-11T00:44:00Z"
  },
  {
    "title": "US Gold Futures Slip as Traders Await Clarification on Tariffs",
    "description": "Gold futures in New York declined as traders awaited clarification from the White House over its tariff policy, after a US government agency stunned the market last week by formally ruling that 100-ounce and one-kilogram bullion bars would be subject to dutie…",
    "link": "https://financialpost.com/pmn/business-pmn/us-gold-futures-slip-as-traders-await-clarification-on-tariffs",
    "timestamp": "2025-08-11T00:36:46Z"
  },
  {
    "title": "Europe pushes for Ukraine role in Trump-Putin talks",
    "description": "Ukraine could be a part of negotiations between the United States and Russia, a US official has said, as European leaders pushed for Ukraine's inclusion ahead of talks between presidents Vladimir Putin and Donald Trump.",
    "link": "https://www.rte.ie/news/ukraine/2025/0811/1527830-ukraine-russia/",
    "timestamp": "2025-08-11T00:32:35Z"
  },
  {
    "title": "Europe pushes for Ukraine role in Trump-Putin talks",
    "description": "A US official said Ukraine could be a part of negotiations between the United States and Russia, as European leaders pushed for Ukraine's inclusion ahead of talks between presidents Vladimir Putin and Donald Trump.",
    "link": "https://www.rte.ie/news/world/2025/0811/1527830-ukraine-russia/",
    "timestamp": "2025-08-11T00:32:35Z"
  },
  {
    "title": "Former Palestinian Authority PM Calls Oct. 7 Massacre 'Courageous,' Calls for Hamas-PLO Unity",
    "description": "Former Palestinian Authority Prime Minister Mohammad Shtayyeh described Hamas's October 7 terrorist massacre as a \"courageous and unprecedented operation\" that marked \"an important crossroad in the history of the Palestinian struggle,\" while simultaneously ca…",
    "link": "https://www.breitbart.com/politics/2025/08/10/former-palestinian-authority-pm-praises-oct-7-massacre-courageous-hamas-plo-unity/",
    "timestamp": "2025-08-11T00:28:54Z"
  },
  {
    "title": "Trump-Putin Summit Could Disrupt Alaska Peak Travel Season Visitors",
    "description": "Travelers in Alaska could face delays and disruptions this week due to the summit between US and Russian Presidents Donald J. Trump and Vladimir Putin",
    "link": "https://www.forbes.com/sites/douggollan/2025/08/10/trump-putin-summit-could-disrupt-alaska-peak-travel-season-visitors/",
    "timestamp": "2025-08-11T00:22:42Z"
  },
  {
    "title": "‘No MR. NICE GUY’: Trump spills details of D.C. cleanup as ‘American Public is not going to put up with it any longer’",
    "description": "Guest post by Joe Kovacs ‘Before the tents, squalor, filth, and Crime, it was the most beautiful Capital in the World. It will soon be that again.’ Saying the American public “is not going to put up with it any longer,” President Donald Trump is now providing…",
    "link": "https://freerepublic.com/focus/f-bloggers/4333853/posts",
    "timestamp": "2025-08-11T00:21:33Z"
  },
  {
    "title": "Trump Says To Move Homeless People 'Far' From Washington",
    "description": "President Donald Trump said Sunday that homeless people must be moved \"far\" from Washington, after days of musing about taking federal control of the US capital where he has falsely suggested crime is rising.",
    "link": "https://www.ibtimes.com/trump-says-move-homeless-people-far-washington-3780623",
    "timestamp": "2025-08-11T00:21:19Z"
  },
  {
    "title": "Oil Falls After Weekly Drop Before Trump-Putin Talks on Ukraine",
    "description": "Oil fell after its biggest weekly drop since end-June before a meeting between the US and Russian leaders on Friday, which is raising the prospect of an end to the war in Ukraine and more supply.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-falls-after-weekly-drop-before-trump-putin-talks-on-ukraine",
    "timestamp": "2025-08-11T00:16:30Z"
  },
  {
    "title": "Trump vows to evict homeless from Washington DC",
    "description": "US President Donald Trump says he will evict homeless people from the US capital and jail criminals despite Washington's mayor arguing there is no current spike in crime.",
    "link": "https://www.abc.net.au/news/2025-08-11/trump-vows-to-evict-homeless-from-washington-dc/105635954",
    "timestamp": "2025-08-11T00:14:02Z"
  },
  {
    "title": "Should the U.S. Recognize North Korea as a Nuclear Weapons Power?",
    "description": "The issue of North Korea’s nuclear program has long been the principal stumbling block to the normalization of U.S. relations with that country.  True, Washington has endeavored to make the communist regime a pariah in the international system for a variety o…",
    "link": "https://original.antiwar.com/ted_galen_carpenter/2025/08/10/should-the-u-s-recognize-north-korea-as-a-nuclear-weapons-power/",
    "timestamp": "2025-08-11T00:00:58Z"
  },
  {
    "title": "India is growing strong, but slowing down sequentially: Gustavo Medeiros",
    "description": "Ashmore Group reduces its investment in India due to high valuations. Uncertainty surrounds Donald Trump's tariffs on Indian imports. Foreign investors show less interest in India for six to nine months. This is due to relative value compared to other emergin…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/india-is-growing-strong-but-slowing-down-sequentially-gustavo-medeiros/articleshow/123225094.cms",
    "timestamp": "2025-08-10T23:57:18Z"
  },
  {
    "title": "Intel CEO Lip-Bu Tan set to meet with Trump to discuss his business dealings",
    "description": "Under fire Intel Corp. Chief Executive Lip-Bu Tan is due to meet his fiercest new critic, U.S. President Donald Trump, at the White House today to discuss calls for his resignation over alleged “conflicts of interest” resulting from his ties to Chinese busine…",
    "link": "https://siliconangle.com/2025/08/10/intel-ceo-lip-bu-tan-set-meet-trump-discuss-business-dealings/",
    "timestamp": "2025-08-10T23:56:29Z"
  },
  {
    "title": "Carry traders ramp up bets in EMs as Fed rate cuts loom",
    "description": "Carry trade gains traction as investors eye emerging markets. Expectations of Federal Reserve rate cuts weaken the dollar. Money managers are investing in currencies of Brazil, South Africa, and Egypt. A weaker dollar and easing volatility create favorable co…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/carry-traders-ramp-up-bets-in-ems-as-fed-rate-cuts-loom/articleshow/123225022.cms",
    "timestamp": "2025-08-10T23:53:19Z"
  },
  {
    "title": "Rose wins FedEx St. Jude in playoff. Burmester also needs extra holes at LIV Golf Chicago",
    "description": "Justin Rose made up a three-shot deficit over the last five holes against hard-luck Tommy Fleetwood, and then made two birdies in a playoff against U.S. Open champion J.J. Spaun to win the FedEx St. Jude Championship on Sunday. Rose delivered another sterling…",
    "link": "https://sports.yahoo.com/article/rose-wins-fedex-st-jude-234536726.html",
    "timestamp": "2025-08-10T23:45:36Z"
  },
  {
    "title": "Trump demands homeless people 'immediately' move out of Washington DC",
    "description": "Trump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.",
    "link": "https://www.bbc.com/news/articles/c1kzz4m3ll1o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-10T23:37:07Z"
  },
  {
    "title": "Nvidia, AMD agree to pay 15% of China chip sale revenues to US: Sources",
    "description": "The agreement is part of a deal with the Trump administration to secure export licences. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/nvidia-amd-agree-to-pay-15-of-china-chip-sale-revenues-to-us-sources",
    "timestamp": "2025-08-10T23:33:14Z"
  },
  {
    "title": "NATO Ukraine support: Mark Rutte says alliance ensuring Kyiv has tools to stay in fight ahead of Trump-Putin summit",
    "description": "NATO Secretary-General Mark Rutte reaffirmed NATO Ukraine support ahead of the Aug. 15 Trump-Putin summit in Alaska, stating the alliance is ensuring Kyiv has the resources to remain in the fight. Rutte addressed concerns over Ukraine’s exclusion from the mee…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nato-ukraine-support-mark-rutte-says-alliance-ensuring-kyiv-has-tools-to-stay-in-fight-ahead-of-trump-putin-summit/articleshow/123224712.cms",
    "timestamp": "2025-08-10T23:27:02Z"
  },
  {
    "title": "Federal judge bans commercial fishing in sensitive Hawaii ecosystem",
    "description": "A federal judge in Hawaii has outlawed commercial fishing in the Pacific Islands Heritage marine national monument, a protected and fragile ecosystem in the ...",
    "link": "https://www.upi.com/Top_News/US/2025/08/10/judge-bans-commercial-fishing-in-Hawaii/1141754867264/",
    "timestamp": "2025-08-10T23:24:54Z"
  },
  {
    "title": "The Armenia-Azerbaijan Peace Deal And The New Trump Corridor",
    "description": "The Zangezur Corridor now named after President Trump offers the US as strategic arbiter of a region previously dominated by Russia and Iran",
    "link": "https://www.forbes.com/sites/melikkaylan/2025/08/10/the-armenia-azerbaijan-peace-deal-and-the-new-trump-corridor/",
    "timestamp": "2025-08-10T23:23:53Z"
  },
  {
    "title": "Watch: JD Vance Musters Most Awkward Reaction Yet When Asked If He's Running In 2028",
    "description": "Vice President J.D. Vance mustered an awkward laugh after he was asked if he was running for president in 2028.\n\n\nDuring an interview on Fox News over the weekend, host Maria Bartiromo noted that President Donald Trump suggested that Vance and Secretary of St…",
    "link": "https://crooksandliars.com/2025/08/watch-jd-vance-musters-most-awkward",
    "timestamp": "2025-08-10T23:23:15Z"
  },
  {
    "title": "'Move Out Immediately': Trump To Relocate Homeless 'Far' From Washington, DC",
    "description": "President Donald Trump previewed his plan to have homeless people relocated \"far\" from his government in Washington, D.C.\n\n\n\"We’re having a News Conference tomorrow in the White House. I’m going to make our Capital safer and more beautiful than it ever was be…",
    "link": "https://crooksandliars.com/2025/08/move-out-immediately-trump-relocate",
    "timestamp": "2025-08-10T23:23:14Z"
  },
  {
    "title": "Dem Governor Nails Trump On Redistricting: He Cheats On Wives, Golf, And Voting",
    "description": "Illinois Gov. JB Pritzker (D) pointed out that President Donald Trump had a history of cheating, as evidenced by his demand that Texas lawmakers find new Republican seats through redistricting the state before the 2026 midterm elections.\n\n\nIn a Sunday intervi…",
    "link": "https://crooksandliars.com/2025/08/dem-governor-nails-trump-redistricting-he",
    "timestamp": "2025-08-10T23:23:14Z"
  }
]