[
  {
    "title": "Video: “Cold War” in the Arctic. Trump Wants Greenland",
    "description": "President Donald Trump has  “renewed his threat of using military force to annex Greenland“.\n“saying he wouldn’t rule it out to make the self-governing Danish territory a part of the United States”\nHis objective: seizing control of the resource-rich …\nThe pos…",
    "link": "https://www.globalresearch.ca/video-cold-war-in-the-arctic-trump-wants-greenland/5911804",
    "timestamp": "2026-01-11T20:31:47Z"
  },
  {
    "title": "Live: ASX set to rise after Wall Street hits record despite disappointing jobs data",
    "description": "Stock markets in the US, Europe and UK closed at record highs on Friday, giving the ASX a positive lead for today. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2026-01-12/asx-markets-business-news-live-updates/106218522",
    "timestamp": "2026-01-11T20:31:10Z"
  },
  {
    "title": "Colby Covington shuts down 'quitter' Bo Nickal's callout",
    "description": "Colby Covington won't entertain Bo Nickal's callout in MMA or wrestling.",
    "link": "https://mmajunkie.usatoday.com/story/sports/ufc/2026/01/11/ufc-colby-covington-shuts-down-bo-nickal-callout-calls-him-quitter-raf-mma-wrestling/88131973007/",
    "timestamp": "2026-01-11T20:30:25Z"
  },
  {
    "title": "Democratic Congresswoman On MS NOW Calls for ICE to Be Abolished: ‘They Are Rogue, They Are Racist’",
    "description": "Ayanna Pressley declared that Immigration and Custom Enforcement \"cannot be reformed\" and must be abolished for the safety of all Americans.\nThe post Democratic Congresswoman On MS NOW Calls for ICE to Be Abolished: ‘They Are Rogue, They Are Racist’ first app…",
    "link": "https://www.mediaite.com/media/news/democratic-congresswoman-on-ms-now-calls-for-ice-to-be-abolished-they-are-rogue-they-are-racist/",
    "timestamp": "2026-01-11T20:27:39Z"
  },
  {
    "title": "A Former Senior Border Patrol Agent Warned Us What Was Coming",
    "description": "Former Border Patrol officer Jenn Budd used to write some really powerful and perceptive stuff for us, and now that I look back at her work, I wish more people in the media read blogs. If you listen to her interview and read her posts, you will understand a l…",
    "link": "https://crooksandliars.com/2026/01/former-senior-border-patrol-agent-warned",
    "timestamp": "2026-01-11T20:26:29Z"
  },
  {
    "title": "Danish PM says Greenland showdown at 'decisive moment' after new Trump threats",
    "description": "COPENHAGEN: Denmark's Prime Minister said Sunday (Jan 11) that her country faces a \"decisive moment\" in its diplomatic battle over Greenland after US President Donald Trump again suggested using force t",
    "link": "https://www.channelnewsasia.com/world/danish-pm-says-greenland-showdown-decisive-moment-after-new-trump-threats-5851766",
    "timestamp": "2026-01-11T20:12:55Z"
  },
  {
    "title": "Pritzker dismisses ex-DC police officer's call for Americans to use Second Amendment to protect against ICE",
    "description": "llinois Governor JB Pritzker rejected ex-D.C. police officer Michael Fanone's suggestion that citizens should use their Second Amendment right to protect themselves against ICE.",
    "link": "https://www.foxnews.com/media/pritzker-dismisses-ex-dc-police-officers-call-americans-use-second-amendment-protect-against-ice",
    "timestamp": "2026-01-11T20:11:18Z"
  },
  {
    "title": "‘Let Me Talk’: CNN Panelist Reality Checks Anti-ICE Democrat Rep Who Claims Renee Good Was ‘Murdered’",
    "description": "Dem Arizona Rep. Yassamin Ansari interrupted former Trump campaign adviser David Urban while he was challenging her claim an ICE agent \"murdered\" Renee Good.",
    "link": "https://dailycaller.com/2026/01/11/yassamin-ansari-interrupts-david-urban-renee-good-immigration-customs-enforcement-shooting-state-union-jake-tapper-cnn/",
    "timestamp": "2026-01-11T20:09:30Z"
  },
  {
    "title": "Exclusive -- Sam Nunberg: Maduro Capture 'Boldest Action Taken by a President'",
    "description": "Sam Nunberg, a long-time former adviser to President Donald Trump, described the United States' capture of Venezuela's deposed dictator, Nicolás Maduro, as the \"boldest action taken by a president in the western hemisphere.\"\nThe post Exclusive — Sam Nunberg: …",
    "link": "https://www.breitbart.com/politics/2026/01/11/exclusive-sam-nunberg-maduro-capture-boldest-action-taken-by-a-president/",
    "timestamp": "2026-01-11T20:07:09Z"
  },
  {
    "title": "OMG! – President Trump Posts Amazing Image While Protesters Flood Tehran’s Streets",
    "description": "OH MY GOD – President Trump is on fire.  His statements and communications show the Iranian people protesting against the Islamic regime that the world is behind them!\nThe post OMG! – President Trump Posts Amazing Image While Protesters Flood Tehran’s Streets…",
    "link": "https://joehoft.com/my-god-president-trump-posts-image-while-protesters-flood-tehrans-streets/",
    "timestamp": "2026-01-11T20:00:54Z"
  },
  {
    "title": "Reference to Trump's impeachments removed from National Portrait Gallery",
    "description": "The wall text, which summarized Trump's first presidency and noted his 2024 comeback victory, was part of the museum's \"American Presidents\" exhibition.",
    "link": "https://www.cbsnews.com/news/reference-to-trump-impeachments-removed-from-national-portrait-gallery/",
    "timestamp": "2026-01-11T20:00:08Z"
  },
  {
    "title": "Here's What Happened Today: Sunday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-11-01-26-6923695-Jan2026/",
    "timestamp": "2026-01-11T20:00:03Z"
  },
  {
    "title": "Landman Season 2, Episode 9 Recap",
    "description": "With one episode left before the finale, Taylor Sheridan throws everything at the wall. Spoiler: none of it sticks.",
    "link": "https://www.esquire.com/entertainment/tv/a69960032/landman-season-2-episode-9-recap/",
    "timestamp": "2026-01-11T20:00:00Z"
  },
  {
    "title": "EXCLUSIVE: How One White House Council Is Fighting To End ‘Regulatory Reign Of Terror’",
    "description": "CEQ Chair Katherine Scarlett told the Daily Caller News Foundation that \"excessive\" CEQ regulations have burdened the United States for \"far too long.\"",
    "link": "https://dailycaller.com/2026/01/11/exclusive-white-house-trump-overregulation-permitting-reform-enviromental-council-energy/",
    "timestamp": "2026-01-11T19:58:11Z"
  },
  {
    "title": "MAGA’s Crackdown on Dissent Started With Pro-Palestinian Activists. It Didn’t End There.",
    "description": "Two days after an ICE agent shot and killed Renée Good in Minneapolis, Rep. Roger Williams issued an ultimatum to the Trump administration’s critics in Minnesota and beyond. “People need to quit demonstrating, quit yelling at law enforcement, challenging law …",
    "link": "https://www.motherjones.com/politics/2026/01/trump-renee-good-ice-roger-williams-wesley-hunt-first-amendment/",
    "timestamp": "2026-01-11T19:56:23Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Jan. 11, 2026",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Secretary of Energy Chris Wright and Rep. Ilhan Omar join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-01-11-2026/",
    "timestamp": "2026-01-11T19:49:28Z"
  },
  {
    "title": "Trump ally openly threatens Cuban officials in online frenzy: 'Wipe you out in minutes'",
    "description": "Rep. Carlos Giménez (R-FL), a Cuban-born lawmaker and close ally of President Donald Trump, issued a barrage of open threats to Cuban government officials Sunday, warning them\r\n that the United States had the “capability to wipe [them] all out in a matter of …",
    "link": "https://www.rawstory.com/cuba-2674873298/",
    "timestamp": "2026-01-11T19:46:50Z"
  },
  {
    "title": "Venezuelans demand political prisoners' release, Maduro 'doing well'",
    "description": "Venezuelans are anticipating further political prisoner releases. Ousted president Nicolas Maduro, now in a US jail, states he is well. The interim government began freeing prisoners after pledging cooperation with Washington. The US administration claims cre…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/venezuelans-demand-political-prisoners-release-maduro-doing-well/articleshow/126470754.cms",
    "timestamp": "2026-01-11T19:45:11Z"
  },
  {
    "title": "Trump Confirms Diddy Asked for Presidential Pardon",
    "description": "Trump Confirms Diddy Asked for Presidential Pardoncafemom.com",
    "link": "https://cafemom.com/entertainment/donald-trump-sean-diddy-combs-request-pardon",
    "timestamp": "2026-01-11T19:44:45Z"
  },
  {
    "title": "Iran warns it will target US troops and Israel if America strikes over protests",
    "description": "Protests challenging Iran's theocracy are ongoing. Demonstrations have entered their third week with significant casualties and detentions reported. Iran's parliament speaker has issued threats against the U.S. and Israel. The U.S. President has offered suppo…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-warns-it-will-target-us-troops-and-israel-if-america-strikes-over-protests/articleshow/126470705.cms",
    "timestamp": "2026-01-11T19:36:13Z"
  },
  {
    "title": "Some US senators skeptical about military options for Iran",
    "description": "Jan 11 (Reuters) - Some U.S. ‌lawmakers in both major parties on Sunday questioned whether military action against Iran is the ‌best approach for the United States as Iranian authorities face growing turmoil.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/12/some-us-senators-skeptical-about-military-options-for-iran",
    "timestamp": "2026-01-11T19:31:00Z"
  },
  {
    "title": "Donald Trump once suggested he was one F1 driver’s ‘lucky charm’ after Grand Prix win",
    "description": "Donald Trump last attended a Formula 1 race in 2024 when he was present at the 2024 Miami Grand Prix. The United States now holds more F1 events than any other country, with Miami, Austin and Las Vegas all hosting Grand Prix as part of the 24-race calendar.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_d5961ea4-7d87-4943-a479-5009df3ec2ee",
    "timestamp": "2026-01-11T19:30:00Z"
  },
  {
    "title": "The Purged — The purge began late Friday night, four days after Donald Trump returned to the White House. (Franklin Foer/The Atlantic)",
    "description": "Franklin Foer / The Atlantic:\nThe Purged  —  The purge began late Friday night, four days after Donald Trump returned to the White House.  Seventeen inspectors general—internal watchdogs embedded throughout the federal government—received emails notifying the…",
    "link": "https://www.memeorandum.com/260111/p42",
    "timestamp": "2026-01-11T19:30:00Z"
  },
  {
    "title": "Coinbase Raises Pressure as Crypto Bill Moves to Senate Markup",
    "description": "The largest US crypto exchange may reconsider its support for the digital-asset market-structure bill — scheduled for markup in at least one Senate committee...",
    "link": "https://finance.yahoo.com/news/coinbase-raises-pressure-crypto-bill-192955972.html",
    "timestamp": "2026-01-11T19:29:55Z"
  },
  {
    "title": "‘We want our freedom back’: Iranians protest in Dublin for regime change in Tehran",
    "description": "They express solidarity with demonstrations in Iran against hardline government",
    "link": "https://www.irishtimes.com/ireland/2026/01/11/we-want-our-freedom-back-iranians-protest-in-dublin-for-regime-change-in-tehran/",
    "timestamp": "2026-01-11T19:25:06Z"
  },
  {
    "title": "PETER CRISS Says It Was \"A Dream Of His\" To Do A Full Studio Project Together With Late Guitarist ACE FREHLEY",
    "description": "\"That was a dream of mine, that he and I would do an album together. I'm sorry that never happened.\"\nThe post PETER CRISS Says It Was \"A Dream Of His\" To Do A Full Studio Project Together With Late Guitarist ACE FREHLEY appeared first on Metal Injection.",
    "link": "https://metalinjection.net/news/peter-criss-says-it-was-a-dream-of-his-to-do-a-full-studio-project-together-with-late-guitarist-ace-frehley",
    "timestamp": "2026-01-11T19:21:00Z"
  },
  {
    "title": "Sen. Chris Murphy Accuses Trump of ‘Stealing’ From the American People in 2nd Term: ‘Wildly Corrupt’ | Video",
    "description": "He also insists ICE operations are \"inhumane and illegal\" but stops short of calling for its abolishment\nThe post Sen. Chris Murphy Accuses Trump of ‘Stealing’ From the American People in 2nd Term: ‘Wildly Corrupt’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/tv/sen-chris-murphy-trump-stealing-corrupt-impeach-ice/",
    "timestamp": "2026-01-11T19:19:41Z"
  },
  {
    "title": "Top Indian refiner in talks with US over Venezuelan oil – Reuters",
    "description": "Private refining firm Reliance Industries has reportedly been forced to search for other markets due to Russia sanctions Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630817-top-indian-refiner-us-venezuelan-oil/",
    "timestamp": "2026-01-11T19:18:54Z"
  },
  {
    "title": "After Maduro: Is the US driving global instability?",
    "description": "Risk analyst Ian Bremmer argues that the US is undoing the global system that it built over decades.",
    "link": "https://www.aljazeera.com/video/the-bottom-line/2026/1/11/after-maduro-is-the-us-driving-global-instability",
    "timestamp": "2026-01-11T19:18:04Z"
  },
  {
    "title": "Deaths from Iran protests reach more than 500, rights group says",
    "description": "By Parisa Hafezi, Rami Ayyub and Maayan LubellDUBAI/JERUSALEM, Jan 11 (Reuters) - Unrest in Iran has killed more than 500 people, a rights group said on Sunday, as Tehran… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/11/deaths-from-iran-protests-reach-more-than-500-rights-group-says",
    "timestamp": "2026-01-11T19:14:19Z"
  },
  {
    "title": "US withdrawal won't affect energy transition support in ASEAN: IRENA",
    "description": "International Renewable Energy Agency (IRENA) Director-General Francesco La Camera stated that the United States plan to withdraw from the agency will not ...",
    "link": "https://en.antaranews.com/news/399433/us-withdrawal-wont-affect-energy-transition-support-in-asean-irena",
    "timestamp": "2026-01-11T19:13:22Z"
  },
  {
    "title": "Iran protests: Death toll rises to over 538 — activists",
    "description": "Protests challenging the regime have continued in defiance of a clampdown by Iran's clerical rulers. Emigrant Iranians were seen protesting across cities in Europe. DW has the latest.",
    "link": "https://www.dw.com/en/iran-protests-death-toll-rises-to-over-538-activists/live-75463923",
    "timestamp": "2026-01-11T19:13:00Z"
  },
  {
    "title": "Liberal Guest On Fox News Calls Out ‘The Regime That is Shooting People in the Face’",
    "description": "Corbin Trent contrasted the Trump administration's abhorrence to the violence against protesters in Iran with the recent ICE-involved shooting in Minneapolis.\nThe post Liberal Guest On Fox News Calls Out ‘The Regime That is Shooting People in the Face’ first …",
    "link": "https://www.mediaite.com/media/news/liberal-guest-on-fox-news-calls-out-the-regime-that-is-shooting-people-in-the-face/",
    "timestamp": "2026-01-11T19:09:19Z"
  },
  {
    "title": "Operation Absolute Resolve: Anatomy of a modern decapitation strike",
    "description": "Venezuela 'will be studied for years as an example of what modern joint special operations can achieve'",
    "link": "https://www.wnd.com/2026/01/operation-absolute-resolve-anatomy-modern-decapitation-strike/",
    "timestamp": "2026-01-11T19:08:20Z"
  },
  {
    "title": "Jake Tapper Deflects From Accusations Of ‘Disservice’ To Law Enforcement By Bringing Up Jan. 6",
    "description": "Jake Tapper played a Jan. 6 Capitol riot clip Sunday as he pushed back on Kristi Noem's criticism of media coverage of Wednesday's shooting in Minneapolis.",
    "link": "https://dailycaller.com/2026/01/11/jake-tapper-deflects-kristi-noem-law-enforcement-disservice-accusations-january-6-capitol-riot-video-state-union/",
    "timestamp": "2026-01-11T19:05:20Z"
  },
  {
    "title": "Trump's threats to Venezuela & Greenland stir Canadian fears",
    "description": "While Trump's actions have unnerved leaders around the globe, Canadians have particular reason to worry. After all, with Greenland, Trump and his advisers are seeking control - even raising the possibility of military action - of a territory that is democrati…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-threats-to-venezuela-greenland-stir-canadian-fears/articleshow/126470334.cms",
    "timestamp": "2026-01-11T19:04:43Z"
  },
  {
    "title": "Trump tells Cuba to 'make a deal' as US cuts off Venezuelan oil",
    "description": "The US is enforcing a strict oil blockade on Venezuela, the communist country's main supplier of oil, as the Trump administration continues to push Latin American countries to align with it.",
    "link": "https://www.abc.net.au/news/2026-01-12/trump-says-us-will-block-all-oil-entering-cuba/106218928",
    "timestamp": "2026-01-11T19:04:32Z"
  },
  {
    "title": "The Purged",
    "description": "Donald Trump’s destruction of the civil service is a tragedy not just for the roughly 300,000 workers who have been discarded, but for an entire nation.",
    "link": "https://www.theatlantic.com/magazine/2026/02/trump-federal-worker-layoffs-interviews/685321/",
    "timestamp": "2026-01-11T19:00:00Z"
  },
  {
    "title": "Dave McCormick Pens Inaugural Letter to Pennsylvania Voters",
    "description": "PITTSBURGH—In his inaugural letter to residents of the Commonwealth of Pennsylvania, Sen. Dave McCormick, R-Pa., said that after his first year in office, he believed... Read More\nThe post Dave McCormick Pens Inaugural Letter to Pennsylvania Voters appeared f…",
    "link": "https://www.dailysignal.com/2026/01/11/dave-mccormick-pens-inaugural-letter-to-pennsylvania-voters/",
    "timestamp": "2026-01-11T19:00:00Z"
  },
  {
    "title": "Reference to Trump's impeachments is removed from the display of his Smithsonian photo portrait",
    "description": "President Donald Trump's photo portrait display at the Smithsonian's National Portrait Gallery has had references to his two impeachments removed, the latest...",
    "link": "https://www.yahoo.com/news/articles/reference-trumps-impeachments-removed-display-185207344.html",
    "timestamp": "2026-01-11T18:52:07Z"
  },
  {
    "title": "Trump's Smithsonian portrait display has impeachment reference removed",
    "description": "References to President Donald Trump’s two impeachments have been removed from his photo portrait display at the Smithsonian’s National Portrait Gallery in Washington. It's the latest apparent change at the collections of museums that he's accused of bias as …",
    "link": "https://apnews.com/article/trump-smithsonian-impeachment-national-portrait-gallery-photo-47a192aa3fdb9c434e405812a36b455a",
    "timestamp": "2026-01-11T18:52:07Z"
  },
  {
    "title": "Trump is weighing options against Iran: Reports",
    "description": "Iran has said it will retaliate if the U.S. intervenes amid political unrest in the Middle East country.",
    "link": "https://www.cnbc.com/2026/01/11/trump-iran.html",
    "timestamp": "2026-01-11T18:47:56Z"
  },
  {
    "title": "'These ICE agents are here for sport': Why Minneapolis was targeted",
    "description": "Minneapolis had been the target of a massive immigration enforcement operation in the weeks leading up to Renee Nicole Good's death. Now, the shooting has opened old wounds.",
    "link": "https://www.abc.net.au/news/2026-01-12/minneapolis-targeted-in-largest-ice-operation-before-shooting/106218184",
    "timestamp": "2026-01-11T18:47:14Z"
  },
  {
    "title": "Rand Paul Warns Trump’s Greenland Plan Is Backfiring: You Don’t Win them Over By ‘Denigrating’ Their Citizens",
    "description": "Rand Paul is not a fan of President Trump's approach to acquiring Greenland, saying Trump was not going to win support from Greenlanders by \"denigrating\" them\nThe post Rand Paul Warns Trump’s Greenland Plan Is Backfiring: You Don’t Win them Over By ‘Denigrati…",
    "link": "https://www.mediaite.com/politics/rand-paul-warns-trumps-greenland-plan-is-backfiring-you-dont-win-them-over-by-denigrating-their-citizens/",
    "timestamp": "2026-01-11T18:46:01Z"
  },
  {
    "title": "Cuba defiant in face of 'criminal' US threats",
    "description": "After abducting the leader of Venezuela, the US is now threatening Cuba. Havana says Washington's behavior is a threat to global peace as President Trump jokes about appointing Marco Rubio president of the island nation.",
    "link": "https://www.dw.com/en/cuba-defiant-in-face-of-criminal-us-threats/a-75466799",
    "timestamp": "2026-01-11T18:45:00Z"
  },
  {
    "title": "Demonstrators in London, Paris, Istanbul back Iran protests",
    "description": "Demonstrators rallied in London, Paris and Istanbul on Sunday in support of protests in Iran that have been countered with a deadly crackdown by the country’s security forces. London demonstrations, initially in front of the Iranian embassy and later in front…",
    "link": "https://www.digitaljournal.com/world/demonstrators-in-london-paris-istanbul-back-iran-protests/article",
    "timestamp": "2026-01-11T18:42:20Z"
  },
  {
    "title": "Logistics",
    "description": "The American military is a finite resource. Further, they operate by moving physical resources in time and space. Much of the Discourse does not reflect this. Donald Trump, of course, has had little awareness of such things, and his apparent descent into deme…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/logistics",
    "timestamp": "2026-01-11T18:41:44Z"
  },
  {
    "title": "Donald Trump's endorsement of John Harbaugh to Giants may aid Dolphins",
    "description": "The Giants are the favorites to land John Harbaugh. According to reports, he is studying film of young quarterbacks, including the Giants Jaxson Dart.",
    "link": "https://www.palmbeachpost.com/story/sports/nfl/dolphins/2026/01/11/donald-trump-john-harbaugh-new-york-giants/88131402007/",
    "timestamp": "2026-01-11T18:37:44Z"
  },
  {
    "title": "Iran rights group warns of ‘mass killing’ of protesters",
    "description": "A human rights group warns of a ‘mass killing’ as authorities crack down on the largest Iran protests in years. The death toll rises amid internet shutdown\n\nRead More: https://punchng.com/iran-rights-group-warns-of-mass-killing-of-protesters/",
    "link": "https://punchng.com/iran-rights-group-warns-of-mass-killing-of-protesters/",
    "timestamp": "2026-01-11T18:35:19Z"
  },
  {
    "title": "John Kennedy Drops To Knees Begging John Thune For Another Reconciliation Bill",
    "description": "Republican Louisiana Sen. John Kennedy knelt on the Senate floor on Thursday to urge Senate Majority Leader John Thune to bring up another reconciliation bill. The Republican Party is weighing another reconciliation bill, with Thune saying a potential option …",
    "link": "https://freerepublic.com/focus/f-news/4361568/posts",
    "timestamp": "2026-01-11T18:35:04Z"
  },
  {
    "title": "Iran’s $7 monthly payments fail to ease spiraling economic unrest as Trump weighs military options against Tehran a week after Venezuela raid",
    "description": "The $7 monthly payments offer little relief to beleaguered Iranians who are suffering from food inflation of 64%.",
    "link": "https://fortune.com/2026/01/11/iran-economic-crisis-protests-inflation-currency-crash-trump-military-options/",
    "timestamp": "2026-01-11T18:33:48Z"
  },
  {
    "title": "The “Drug Cartels” and the Laundering of “Dirty Money”",
    "description": "In December 2019, President Donald Trump offered to intervene in Mexico, i.e. “to go after the Drug Cartels”. Mexico’s president AMLO turned down Trump’s “generous offer”. President Trump confirmed that his administration was considering categorizing “drug ca…",
    "link": "https://www.globalresearch.ca/the-drug-cartels-and-the-laundering-of-dirty-money/5911765",
    "timestamp": "2026-01-11T18:31:32Z"
  },
  {
    "title": "Keir Starmer 'could send British troops to Greenland to help guard the Arctic for Donald Trump'",
    "description": "Sir Keir Starmer could send British troops to Greenland as part of a NATO mission to help guard the Arctic for Donald Trump, it has emerged. The Prime Minister is said to share the US President's view that action must be taken to deter Russia's threat in the …",
    "link": "https://freerepublic.com/focus/f-news/4361566/posts",
    "timestamp": "2026-01-11T18:29:00Z"
  },
  {
    "title": "NATO should launch operation to boost security in Arctic, Belgian minister says",
    "description": "By Lili BayerBRUSSELS, Jan 11 (Reuters) - NATO should launch an operation in the Arctic to address U.S. security concerns, Belgium’s defence minister told Reuters on Sund… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/11/nato-should-launch-operation-to-boost-security-in-arctic-belgian-minister-says",
    "timestamp": "2026-01-11T18:27:42Z"
  },
  {
    "title": "Federal judge blocks Trump administration from enforcing mail-in voting rules in executive order",
    "description": "Federal judge blocks Trump administration’s executive order on elections, ruling the president lacked authority to impose the changes on Washington and Oregon.",
    "link": "https://www.foxnews.com/politics/federal-judge-blocks-trump-administration-from-enforcing-mail-in-voting-rules-executive-order",
    "timestamp": "2026-01-11T18:26:06Z"
  },
  {
    "title": "Some US senators skeptical about military options for Iran",
    "description": "By Matt TracyJan 11 (Reuters) - Some U.S. lawmakers in both major parties on Sunday questioned whether military action against Iran is the best approach for the United St… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/11/some-us-senators-skeptical-about-military-options-for-iran",
    "timestamp": "2026-01-11T18:24:44Z"
  },
  {
    "title": "Donnie Draft Dodger ‘Seriously Considering’ Attacking Iran - To Protect Protesters",
    "description": "Just days after Donald Trump made up a reason to give his own goons a stamp of approval for shooting and killing unarmed American protester Renee Nicole Good, he’s threatening to bomb Iran if they are not respectful enough to protesters. Really.\nVia The New Y…",
    "link": "https://crooksandliars.com/2026/01/nyt-trump-seriously-considering-attacking",
    "timestamp": "2026-01-11T18:24:02Z"
  },
  {
    "title": "Hundreds more federal agents being deployed to Minnesota, Noem says",
    "description": "Homeland Security Secretary Kristi Noem signaled that more federal agents will be in Minneapolis, where the fatal shooting of a woman by an ICE agent inflamed strife.",
    "link": "https://www.bostonglobe.com/2026/01/11/business/hundreds-federal-agents-deployed-minnesota-noem/",
    "timestamp": "2026-01-11T18:23:09Z"
  },
  {
    "title": "Britain is in talks with NATO to counter Russia and China in the Arctic",
    "description": "Britain is discussing with NATO allies how to enhance Arctic security against Russia and China",
    "link": "https://abcnews.go.com/International/wireStory/britain-talks-nato-counter-russia-china-arctic-129106620",
    "timestamp": "2026-01-11T18:21:58Z"
  },
  {
    "title": "Will Elon Musk’s X changing the Iranian flag have any impact on the ground?",
    "description": "Analysts say Musk's move may give a small boost to some protesters, but matters little during internet blackouts.",
    "link": "https://www.aljazeera.com/features/2026/1/11/will-elon-musks-x-changing-the-iranian-flag-have-any-impact-on-the-ground",
    "timestamp": "2026-01-11T18:13:14Z"
  },
  {
    "title": "Onus now on Russia to show it wants peace in Ukraine, says EU's von der Leyen",
    "description": "BRUSSELS, Jan 11 (Reuters) - It is now up to Russia to show it is interested in peace, after Kyiv and its allies agreed on a peace plan and security...",
    "link": "https://www.yahoo.com/news/articles/onus-now-russia-show-wants-180920250.html",
    "timestamp": "2026-01-11T18:09:20Z"
  },
  {
    "title": "‘F*ck Them!’ Dave Matthews Excoriates Trump, Noem and ICE Over Minneapolis Shooting",
    "description": "Dave Matthews waded into the fray over the ICE-involved shooting of  Renee Good in Minneapolis, claiming the 37-year old mom was “murdered in cold blood.”\nThe post ‘F*ck Them!’ Dave Matthews Excoriates Trump, Noem and ICE Over Minneapolis Shooting first appea…",
    "link": "https://www.mediaite.com/media/news/fck-them-dave-matthews-excoriates-trump-noem-and-ice-over-minneapolis-shooting/",
    "timestamp": "2026-01-11T18:08:15Z"
  },
  {
    "title": "How to watch and stream tonight’s Golden Globes",
    "description": "Here’s what to look for at the 83rd Golden Globes.",
    "link": "https://www.denverpost.com/2026/01/11/golden-globes-2026/",
    "timestamp": "2026-01-11T18:07:57Z"
  },
  {
    "title": "How to watch and stream tonight’s Golden Globes",
    "description": "Here’s what to look for at the 83rd Golden Globes.",
    "link": "https://www.bostonherald.com/2026/01/11/golden-globes-2026/",
    "timestamp": "2026-01-11T18:07:57Z"
  },
  {
    "title": "7 left-wing groups to watch in 2026",
    "description": "Activists joined by 'rogue district court judges' to try to dilute President Trump's agenda",
    "link": "https://www.wnd.com/2026/01/7-left-wing-groups-watch-2026/",
    "timestamp": "2026-01-11T18:06:20Z"
  },
  {
    "title": "Inside Caroline Kennedy and JFK Jr.’s childhood homes — as experts lift the lid on the siblings’ incredible bond",
    "description": "Caroline and JFK Jr. had far more in common than their family's heartbreaks, having been raised in extraordinary circumstances as the heirs to a political dynasty unlike any other in the world.",
    "link": "https://www.realtor.com/news/celebrity-real-estate/caroline-kennedy-jfk-jr-childhood-homes/",
    "timestamp": "2026-01-11T18:06:03Z"
  },
  {
    "title": "Britain is in talks with NATO to counter Russia and China in the Arctic",
    "description": "Britain is discussing with NATO allies how to bolster Arctic security against Russia and China, according to a government minister. These talks are described as routine, not a direct response to U.S. President Trump's desire to acquire Greenland. The UK agree…",
    "link": "https://economictimes.indiatimes.com/news/defence/britain-is-in-talks-with-nato-to-counter-russia-and-china-in-the-arctic/articleshow/126469042.cms",
    "timestamp": "2026-01-11T18:02:26Z"
  },
  {
    "title": "Trump Mulls Attacks On Iran And Greenland",
    "description": "United States ruler Donald Trump is considering attacking Iran and going the \"hard way\" when it comes to acquiring the Arctic island of Greenland, currently under Denmark's jurisdiction. The rhetoric is increasing as the war is waged and applauded.",
    "link": "https://www.shtfplan.com/headline-news/trump-mulls-attacks-on-iran-and-greenland",
    "timestamp": "2026-01-11T18:00:25Z"
  },
  {
    "title": "Trump's border czar erupts when pressed on alleged $50k bribe: 'I'm not addressing it!'",
    "description": "President Donald Trump’s border czar Tom Homan erupted Sunday after NBC News’ Kristen Welker pressed him on an alleged $50,000 cash bribe\r\n he reportedly took in exchange for dishing out government contracts to private prisons.Last September, it was revealed\r…",
    "link": "https://www.rawstory.com/tom-homan-2674873163/",
    "timestamp": "2026-01-11T18:00:19Z"
  },
  {
    "title": "ISRAEL ON ALERT",
    "description": "As Trump threatens that Washington will 'help' protesters in Iran, speaker of Iranian parliament warns against 'miscalculation'",
    "link": "https://www.middleeasteye.net/news/iran-warns-it-will-strike-israel-and-us-bases-response-attack-tehran",
    "timestamp": "2026-01-11T18:00:17Z"
  },
  {
    "title": "U.S. launches new retaliatory strikes against Islamic State group in Syria",
    "description": "The U.S. has launched another round of retaliatory strikes against the Islamic State group in Syria following last month's ambush that killed two U.S. soldiers and one American civilian interpreter in the country.",
    "link": "https://www.pbs.org/newshour/world/u-s-launches-new-retaliatory-strikes-against-islamic-state-group-in-syria",
    "timestamp": "2026-01-11T17:53:53Z"
  },
  {
    "title": "With Cuban ally Maduro ousted, Trump warns Havana to make a 'deal' before it's too late",
    "description": "There's another warning from President Donald Trump to Cuba in the wake of Nicolás Maduro's ouster in Venezuela",
    "link": "https://abcnews.go.com/US/wireStory/cuban-ally-maduro-ousted-trump-warns-havana-make-129103607",
    "timestamp": "2026-01-11T17:49:46Z"
  },
  {
    "title": "UK says NATO talks on deterring Russia in the Arctic ‘business as usual’",
    "description": "LONDON, Jan 11 (Reuters) - Britain said on Sunday discussions with other NATO members on deterring Russian activity in the Arctic were “business as usual”, after media re… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/11/uk-says-nato-talks-on-deterring-russia-in-the-arctic-business-as-usual",
    "timestamp": "2026-01-11T17:37:04Z"
  },
  {
    "title": "A $400,000 payout after Maduro’s capture is putting prediction markets in the spotlight",
    "description": "Last week, an anonymous trader pocketed more than $400,000 after betting that Maduro would soon be out of office.",
    "link": "https://www.ocregister.com/2026/01/11/a-400000-payout-after-maduros-capture-is-putting-prediction-markets-in-the-spotlight/",
    "timestamp": "2026-01-11T17:27:49Z"
  },
  {
    "title": "Ilhan Omar kicked out of ICE facility after DHS requires week's advance notice",
    "description": "Reps. Ilhan Omar and Angie Craig were removed from Minneapolis ICE facility Saturday after the Trump administration imposed a new rule requiring a week notice.",
    "link": "https://www.foxnews.com/politics/ilhan-omar-kicked-out-ice-facility-after-dhs-requires-weeks-advance-notice",
    "timestamp": "2026-01-11T17:24:12Z"
  },
  {
    "title": "Iran warns it will retaliate if US attacks as protesters defy crackdown",
    "description": "Iran has warned it will retaliate if attacked by the US, as protesters defied a deadly government crackdown on Saturday night. Videos verified by the BBC and eyewitness accounts appeared to show the government ramping up its response to the protests, which ha…",
    "link": "https://freerepublic.com/focus/f-news/4361559/posts",
    "timestamp": "2026-01-11T17:22:23Z"
  },
  {
    "title": "Trump says no more Venezuelan oil or money to go to Cuba, demands ‘deal’",
    "description": "Venezuela is Cuba's biggest oil supplier, but no shipments have departed Venezuelan ports since Maduro's abduction.",
    "link": "https://www.aljazeera.com/news/2026/1/11/trump-says-no-more-venezuelan-oil-or-money-to-go-to-cuba-and-demands-deal",
    "timestamp": "2026-01-11T17:22:04Z"
  },
  {
    "title": "Video captures Minneapolis immigration arrest in a city on edge after shooting of Renee Good",
    "description": "The investigation into the fatal shooting of a woman by an immigration officer in Minneapolis shouldn’t be overseen solely by the federal government, two of the state’s leading Democrats said Sunday.",
    "link": "https://www.denverpost.com/2026/01/11/video-captures-minneapolis-immigration-arrest-in-a-city-on-edge-after-shooting-of-renee-good/",
    "timestamp": "2026-01-11T17:15:16Z"
  },
  {
    "title": "Video captures Minneapolis immigration arrest in a city on edge after shooting of Renee Good",
    "description": "Federal agents carrying out immigration arrests in Minnesota's Twin Cities region already shaken by the fatal shooting of a woman rammed the door of one home...",
    "link": "https://www.yahoo.com/news/articles/minnesota-democrats-demanding-broader-investigation-171516735.html",
    "timestamp": "2026-01-11T17:15:16Z"
  },
  {
    "title": "US and Israel egging on foreign killers embedded in crowds – Iranian president",
    "description": "The people of Iran have a right to protest, unlike terrorists brought in from abroad, Masoud Pezeshkian has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630816-us-israel-iran-protests-pezeshkian/",
    "timestamp": "2026-01-11T17:12:06Z"
  },
  {
    "title": "Murphy: Trump 'Has Committed 10 Times More Impeachable Offenses in His Second Term",
    "description": "Sunday on NBC's \"Meet the Press,\" Sen. Chris Murphy (D-CT) said President Donald Trump had \"committed 10 times more impeachable offenses in his second term.\"\nThe post Murphy: Trump ‘Has Committed 10 Times More Impeachable Offenses in His Second Term appeared …",
    "link": "https://www.breitbart.com/clips/2026/01/11/murphy-trump-has-committed-10-times-more-impeachable-offenses-in-his-second-term/",
    "timestamp": "2026-01-11T17:09:27Z"
  },
  {
    "title": "Onus now on Russia to show it wants peace in Ukraine, says EU’s von der Leyen",
    "description": "BRUSSELS, Jan 11 (Reuters) - It is now up to Russia to show it is interested in peace, after Kyiv and its allies agreed on a peace plan and security guarantees that would… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/11/onus-now-on-russia-to-show-it-wants-peace-in-ukraine-says-eu-s-von-der-leyen",
    "timestamp": "2026-01-11T17:09:20Z"
  },
  {
    "title": "Kristi Noem Goes on TV and Lies Through Her Teeth (Again) About ICE Killing of Renee Nicole Good",
    "description": "Secretary of Homeland Security Kristi Noem sat for a live interview with CNN's Jake Tapper on Sunday morning about the killing of Renee Nicole Good by a federal immigration agent last week and lied straight through her teeth to the American public about what …",
    "link": "https://www.commondreams.org/news/kristi-noem-lies-renee-nicole-good",
    "timestamp": "2026-01-11T17:09:12Z"
  },
  {
    "title": "“Find a new place to live”: Graham threatens Cuban leadership",
    "description": "The Trump administration has repeatedly threatened military action on the island.",
    "link": "https://www.salon.com/2026/01/11/find-a-new-place-to-live-graham-threatens-cuban-leadership/",
    "timestamp": "2026-01-11T17:07:24Z"
  },
  {
    "title": "Death toll in crackdown on protests in Iran spikes to at least 538, activists say",
    "description": "U.S. President Donald Trump said Sunday that Iran proposed negotiations after his threat to strike the Islamic Republic over its bloody crackdown targeting demonstrators there, a move coming as activists said the death toll in protests rose to at least 544.",
    "link": "https://www.wpxi.com/news/local/death-toll-crackdown-protests-iran-spikes-least-538-activists-say/JJA2AGTVM5FKVOS5U5Y5LRF65A/",
    "timestamp": "2026-01-11T17:05:59Z"
  },
  {
    "title": "Trump warns Cuba to make a deal 'before it is too late'",
    "description": "President Donald Trump said in a post on Truth Social that Cuba would no longer receive oil or money from Venezuela.",
    "link": "https://www.businessinsider.com/trump-cuba-deal-oil-economy-venezuela-2026-1",
    "timestamp": "2026-01-11T17:02:05Z"
  },
  {
    "title": "Iran protests: activists say deaths cross 500 amid information blackout",
    "description": "While protesters continue to gather in Tehran, Mashhad and other cities, Iranian leaders have hardened their rhetoric, warning the US and Israel against any military action.",
    "link": "https://www.thehindubusinessline.com/news/world/iran-protests-activists-say-deaths-cross-500-amid-information-blackout/article70498809.ece",
    "timestamp": "2026-01-11T17:00:47Z"
  },
  {
    "title": "Meet The Murderers, Child Rapists ICE Is Arresting In Minnesota",
    "description": "Despite Democrats' raging against the agency, ICE agents are continuing to arrest illegal migrant child rapists and killers in Minnesota.",
    "link": "https://dailycaller.com/2026/01/11/immigration-customs-enforcement-arrests-child-rapists-minnesota/",
    "timestamp": "2026-01-11T17:00:46Z"
  },
  {
    "title": "Trump to Cuba: No More Oil, Make a Deal Before It’s Too Late",
    "description": "President Trump warned Cuba its access to Venezuelan oil has ended and urged Havana to consider a deal with the United States.\nThe post Trump to Cuba: No More Oil, Make a Deal Before It’s Too Late first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/trump-to-cuba-no-more-oil-make-a-deal-before-its-too-late/",
    "timestamp": "2026-01-11T17:00:28Z"
  },
  {
    "title": "Cuba Ready to Defend Itself to 'Last Drop of Blood' Amid US Threats - President",
    "description": "MOSCOW (Sputnik) - Cuban President Miguel Diaz-Canel Bermudez said on Sunday that his country has been under attack by the United States for 66 years and is ready to defend itself to the last drop of blood.",
    "link": "https://sputnikglobe.com/20260111/cuba-ready-to-defend-itself-to-last-drop-of-blood-amid-us-threats---president-1123450812.html",
    "timestamp": "2026-01-11T16:59:13Z"
  },
  {
    "title": "Sen. Chris Murphy says 'it would be the end of NATO' if the U.S. annexed Greenland (Megan Lebowitz/NBC News)",
    "description": "Megan Lebowitz / NBC News:\nSen. Chris Murphy says ‘it would be the end of NATO’ if the U.S. annexed Greenland  —  The senator's comments come after President Donald Trump said that the U.S. would “do something on Greenland, whether they like it or not.”  — Ad…",
    "link": "https://www.memeorandum.com/260111/p31",
    "timestamp": "2026-01-11T16:55:01Z"
  },
  {
    "title": "‘Cut the snake’s head off for good’: Iran’s crown prince in exile has urgent message for President Trump",
    "description": "'Iranians know that you're total opposite to Barack Obama or Joe Biden. They know that you're not going to throw them under the bus as they have had before'",
    "link": "https://www.wnd.com/2026/01/cut-snakes-head-good-irans-crown-prince-exile/",
    "timestamp": "2026-01-11T16:54:36Z"
  }
]