[
  {
    "title": "Bitcoin rallies to $109.7K but pro traders question BTC’s price momentum",
    "description": "Bitcoin moved closer to its all-time high today, but several data points suggest pro traders are not on board yet.",
    "link": "https://cointelegraph.com/news/bitcoin-rallies-to-109-7k-but-pro-traders-question-btc-s-price-momentum",
    "timestamp": "2025-07-02T23:54:06Z"
  },
  {
    "title": "Former FBI Director James Comey’s daughter Maurene suffers high-profile loss as prosecutor in Diddy trial",
    "description": "Maurene Comey is following in her fathers footsteps at the SDNY.",
    "link": "https://nypost.com/2025/07/02/us-news/former-fbi-director-james-comeys-daughter-suffers-loss-as-prosecutor-in-diddy-trial/",
    "timestamp": "2025-07-02T23:53:02Z"
  },
  {
    "title": "Medicaid cuts loom for hundreds of thousands of Midwesterners in 'big, beautiful bill'",
    "description": "Between North Dakota, South Dakota and Minnesota, close to 285,000 people are projected to lose health insurance coverage by 2034.",
    "link": "https://www.inforum.com/health/medicaid-cuts-loom-for-hundreds-of-thousands-of-midwesterners-in-big-beautiful-bill",
    "timestamp": "2025-07-02T23:52:29Z"
  },
  {
    "title": "House Republican Reportedly Informed Oblivious Trump That the ‘Big, Beautiful Bill’ Cuts Medicaid",
    "description": "During a meeting with congressional Republicans on Wednesday, President Donald Trump appeared unaware that the spending legislation he has been working to pass contains massive cuts to Medicaid.\nThe post House Republican Reportedly Informed Oblivious Trump Th…",
    "link": "https://www.mediaite.com/politics/trump/house-republican-reportedly-informed-oblivious-trump-that-the-big-beautiful-bill-cuts-medicaid/",
    "timestamp": "2025-07-02T23:51:51Z"
  },
  {
    "title": "Russiagate was a ploy to ‘screw Trump’ – CIA boss",
    "description": "The Obama-era probe into alleged Russian interference in the 2016 presidential election was a manipulation, the CIA head has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620913-russiagate-probe-political-ploy-cia/",
    "timestamp": "2025-07-02T23:45:22Z"
  },
  {
    "title": "Riley Gaines calls on NCAA to amend Lia Thomas' records after UPenn submits to Trump on issue",
    "description": "Riley Gaines calls NCAA leaders \"spineless\" regarding transgender swimmer Lia Thomas' records. The University of Pennsylvania erased program achievements, but Thomas' NCAA title remains.",
    "link": "https://www.foxnews.com/sports/riley-gaines-calls-ncaa-amend-lia-thomas-records-after-upenn-submits-trump-issue",
    "timestamp": "2025-07-02T23:44:08Z"
  },
  {
    "title": "Vibe shift in House as Trump, GOP leaders begin to flip votes - Roll Call",
    "description": "Republican opposition to the GOP's \"big, beautiful\" reconciliation bill appeared to be softening Wednesday night.",
    "link": "https://rollcall.com/2025/07/02/vibe-shift-in-house-as-trump-gop-leaders-begin-to-flip-votes/",
    "timestamp": "2025-07-02T23:43:36Z"
  },
  {
    "title": "Trump to meet at White House with American hostage freed from Gaza",
    "description": "Edan Alexander, now 21, is an American-Israeli from New Jersey.",
    "link": "https://www.bostonherald.com/2025/07/02/trump-edan-alexander/",
    "timestamp": "2025-07-02T23:43:01Z"
  },
  {
    "title": "Prayers, cheers and baby oil: This is what it was like at the courthouse as Diddy’s verdict was read",
    "description": "The scene outside the federal courthouse was a spectacle after the mogul was acquitted on two of the more serious counts. Kelly Rissman and Ariana Baio report from the Daniel Patrick Moynihan courthouse in New York.",
    "link": "https://www.the-independent.com/news/world/americas/crime/diddy-trial-verdict-courthouse-baby-oil-b2781488.html",
    "timestamp": "2025-07-02T23:40:57Z"
  },
  {
    "title": "GOP Resistance Softens as Trump Presses House on Tax Package",
    "description": "Conservative hardliners’ resistance to Donald Trump’s massive tax and spending package began to soften late Wednesday as the president and his allies worked to win them over.",
    "link": "https://financialpost.com/pmn/business-pmn/gop-resistance-softens-as-trump-presses-house-on-tax-package",
    "timestamp": "2025-07-02T23:37:10Z"
  },
  {
    "title": "Florida’s ‘Alligator Alcatraz’ detention center is set to receive its first group of immigrants",
    "description": "It wasn’t immediately clear when the detainees would arrive or where they were coming from.",
    "link": "https://www.bostonherald.com/2025/07/02/alligator-alcatraz-immigrants/",
    "timestamp": "2025-07-02T23:36:01Z"
  },
  {
    "title": "Florida’s ‘Alligator Alcatraz’ detention center is set to receive its first group of immigrants",
    "description": "It wasn’t immediately clear when the detainees would arrive or where they were coming from.",
    "link": "https://www.denverpost.com/2025/07/02/alligator-alcatraz-immigrants/",
    "timestamp": "2025-07-02T23:36:01Z"
  },
  {
    "title": "'Yes, You Are,' Tlaib Tells Lawmaker Who Said Republicans Aren't 'Little Bitches' Doing Trump's Bidding",
    "description": "Progressive Congresswoman Rashida Tlaib on Wednesday clapped back at one of her Republican colleagues who suggested that the GOP effort to pass the so-called Big Beautiful Bill this week isn't in response to a directive from U.S. President Donald Trump, who h…",
    "link": "https://www.commondreams.org/news/republican-budget-bill",
    "timestamp": "2025-07-02T23:34:29Z"
  },
  {
    "title": "MS-13 leader sentenced to 68 years in federal case involving 8 Long Island murders",
    "description": "Alexi Saenz pleaded guilty last year for his role in ordering and approving the killings as well as other crimes during a rash of bloody violence.",
    "link": "https://nypost.com/2025/07/02/us-news/ms-13-leader-sentenced-to-68-years-in-federal-case-involving-8-long-island-murders/",
    "timestamp": "2025-07-02T23:33:42Z"
  },
  {
    "title": "Iranian nuclear programme degraded by up to two years: Pentagon",
    "description": "WASHINGTON: The Pentagon said on Wednesday (Jul 3) that United States strikes 10 days ago had degraded Iran's nuclear programme by up to two years, suggesting the US military operation like",
    "link": "https://www.channelnewsasia.com/world/iran-nuclear-programme-degraded-two-years-us-pentagon-5217191",
    "timestamp": "2025-07-02T23:32:03Z"
  },
  {
    "title": "Paramount insiders shocked over reported ‘side deal’ with Trump in ‘60 Minutes’ settlement",
    "description": "A source tells us that \"Paramount had absolutely nothing to do with this side deal\" and it was not what the \"Paramount board approved.\"",
    "link": "https://pagesix.com/2025/07/02/entertainment/paramount-insider-shock-over-reported-side-deal-with-trump/",
    "timestamp": "2025-07-02T23:30:47Z"
  },
  {
    "title": "Dems Resort To Cringe Theatrics As Trump’s ‘Big, Beautiful’ Bill Rolls Toward Finish Line",
    "description": "Several Democratic leaders have been attempting to protest President Donald Trump's \"Big, Beautiful Bill\" with a variety of theatrical stunts.",
    "link": "https://dailycaller.com/2025/07/02/democratic-theatrics-hakeem-jeffries-big-beautiful-bill/",
    "timestamp": "2025-07-02T23:29:12Z"
  },
  {
    "title": "Trump turns to Supreme Court in fight to oust Biden-era consumer safety officials",
    "description": "Trump's Justice Department files emergency appeal to Supreme Court seeking to overturn rulings blocking the firing of three Biden-appointed Consumer Product Safety Commission regulators.",
    "link": "https://www.foxnews.com/politics/trump-turns-supreme-court-fight-oust-biden-era-consumer-safety-officials",
    "timestamp": "2025-07-02T23:29:12Z"
  },
  {
    "title": "What’s Next In The Trump-CBS, Paramount-Skydance Saga",
    "description": "In the aftermath of the company’s $16 million settlement of a lawsuit filed by President Donald Trump, Paramount Global CEO George Cheeks told shareholders that there was a reason to do so, even if CBS had long argued that the litigation was meritless. With i…",
    "link": "http://deadline.com/2025/07/trump-paramount-skydance-merger-whats-next-1236448358/",
    "timestamp": "2025-07-02T23:27:16Z"
  },
  {
    "title": "Hamas still won’t do a cease-fire unless it’s handed a fundamental victory",
    "description": "President Donald Trump says he’s hoping Hamas will accept his team’s latest proposal for a 60-day cease-fire with Israel as soon as next week — but if the past is any guide, he (and everyone else) is in for disappointment.",
    "link": "https://nypost.com/2025/07/02/opinion/expect-hamas-to-scuttle-trumps-cease-fire-deal-but-either-way-israel-must-still-destroy-it/",
    "timestamp": "2025-07-02T23:22:33Z"
  },
  {
    "title": "Trump's budget bill is closer to becoming law - here are the remaining sticking points",
    "description": "Potential rebels in the president's party have a range of concerns about the bill, from welfare cuts to national debt.",
    "link": "https://www.bbc.com/news/articles/c20rrxjnx4lo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-02T23:20:52Z"
  },
  {
    "title": "After US and Israeli strikes, some nuclear experts say Iran could be more dangerous",
    "description": "Some experts said they believe the U.S. strikes have the potential to lead to a \"fork-in-the-road\" moment that could result in Tehran taking an even more dangerous path.",
    "link": "https://abcnews.go.com/International/after-us-israeli-strikes-nuclear-experts-iran-dangerous/story?id=123224192",
    "timestamp": "2025-07-02T23:20:02Z"
  },
  {
    "title": "Trump Lifts Sanctions on Syria and Proposes Integrating the Country Into the Abraham Accords to Strengthen Alliances in the Middle East",
    "description": "This is a Gateway Hispanic article.\nThe post Trump Lifts Sanctions on Syria and Proposes Integrating the Country Into the Abraham Accords to Strengthen Alliances in the Middle East appeared first on The Gateway Pundit.",
    "link": "https://gatewayhispanic.com/2025/07/trump-lifts-sanctions-syria-proposes-integrating-country-abraham/",
    "timestamp": "2025-07-02T23:20:00Z"
  },
  {
    "title": "Trump's Spending Plans Target Huge Programs That Favored U.S. Industries. The Upshot For Chip Stocks, Energy And Construction",
    "description": "Biden-era bills funneled billions in contracts and funding to certain U.S. industries. But Donald Trump has his own ideas. What his spending plans mean now for chip stocks, energy and construction.\nThe post Trump's Spending Plans Target Huge Programs That Fav…",
    "link": "https://biztoc.com/x/776d970d3377e54d",
    "timestamp": "2025-07-02T23:16:14Z"
  },
  {
    "title": "What Paramount’s multi-million dollar settlement with Trump means for press freedom",
    "description": "Paramount agreed to pay Donald Trump $16 million to settle a lawsuit over a “60 Minutes” interview with Kamala Harris. Trump alleged the interview was edited to improve how Harris sounded, a claim CBS denied. Paramount said the funds will go to President Trum…",
    "link": "https://biztoc.com/x/293989b676b30011",
    "timestamp": "2025-07-02T23:16:02Z"
  },
  {
    "title": "Iranian Leadership Issues Death Warrants for Trump, Netanyahu",
    "description": "Iran’s clerical leadership recently issued two new fatwas—or religious edicts—authorizing the assassination of President Donald Trump and Israeli prime minister Benjamin Netanyahu, deeming them enemies of Islam. Both decrees also make it substantially easier …",
    "link": "https://freebeacon.com/national-security/iranian-leadership-issues-death-warrants-for-trump-netanyahu/",
    "timestamp": "2025-07-02T23:15:09Z"
  },
  {
    "title": "Trump is not like other presidents – but can he beat the ‘second term curse’ that haunts the White House?",
    "description": "According to myth, the ghost of George Washington cursed anyone serving more than four years. But a nonconsecutive second term is different – as is Donald Trump.",
    "link": "https://theconversation.com/trump-is-not-like-other-presidents-but-can-he-beat-the-second-term-curse-that-haunts-the-white-house-260002",
    "timestamp": "2025-07-02T23:15:04Z"
  },
  {
    "title": "Thanks To Trump, Crops Are Unharvested And Farms Are At Risk",
    "description": "We can add food scarcity to our worries about cuts to Medicaid, SNAP benefits, public health and the tariffs destroying our quality of life (and quite possibly our lives, themselves) under Donald Trump. This latest threat comes via Trump's immigration fascism…",
    "link": "https://crooksandliars.com/2025/07/thanks-trump-crops-are-unharvested-and",
    "timestamp": "2025-07-02T23:14:46Z"
  },
  {
    "title": "How secret ‘side deal’ helped seal Paramount’s $16M settlement with Trump — and here’s who deserves the credit",
    "description": "The move should now clear the way for Paramount's long-awaited sale to independent studio Skydance.",
    "link": "https://nypost.com/2025/07/02/media/how-secret-side-deal-helped-seal-paramounts-16m-settlement-with-trump/",
    "timestamp": "2025-07-02T23:12:47Z"
  },
  {
    "title": "Netanyahu to urge Trump: Pressure Qatar over Hamas leaders",
    "description": "Netanyahu’s expected appeal to Trump follows internal discussions on imposing pressure and sanctions against Hamas leaders in Qatar to help advance a hostage deal.",
    "link": "https://www.israelnationalnews.com/news/411049",
    "timestamp": "2025-07-02T23:11:16Z"
  },
  {
    "title": "Is Japan a Transit Point for Fentanyl?",
    "description": "A synthetic opioid so powerful it can kill with a single tablet is threatening to strain relations between Japan and the United States. Fentanyl, a drug originally developed as a medical anesthetic, has become a national crisis in the U.S. due to its high pot…",
    "link": "https://newsonjapan.com/article/146277.php",
    "timestamp": "2025-07-02T23:07:28Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures hit pause as Wall Street braces for June jobs report",
    "description": "Investors are looking to the June jobs report to help set expectations for the pace of interest-rate cuts.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-hit-pause-as-wall-street-braces-for-june-jobs-report-230626187.html",
    "timestamp": "2025-07-02T23:06:26Z"
  },
  {
    "title": "Veteran analyst sets eye-popping S&P 500 target",
    "description": "Stocks have rallied sharply since April 9, when President Donald Trump announced he would pause implementing most of the widespread tariffs previously announced on April 2, so-called “Liberation Day.”\nThe pause was more than welcome given his Liberation Day a…",
    "link": "https://biztoc.com/x/a928d86ed72721a9",
    "timestamp": "2025-07-02T23:04:50Z"
  },
  {
    "title": "Military veteran gets a life sentence for plotting an FBI attack after his Jan. 6 arrest",
    "description": "Edward Kelley, 36, was one of the first rioters to breach the Capitol.",
    "link": "https://nypost.com/2025/07/02/us-news/military-veteran-gets-a-life-sentence-for-plotting-an-fbi-attack-after-his-jan-6-arrest/",
    "timestamp": "2025-07-02T23:04:12Z"
  },
  {
    "title": "‘All of Us Have To Give Up on Our Personal Preferences’ for Trump’s Bill: Speaker Johnson Urges GOP Holdouts To Get in Line",
    "description": "Speaker Mike Johnson urged the handful of Republican holdouts who are hemming and hawing over a massive spending bill to toe the party line.\nThe post ‘All of Us Have To Give Up on Our Personal Preferences’ for Trump’s Bill: Speaker Johnson Urges GOP Holdouts …",
    "link": "https://www.mediaite.com/media/tv/all-of-us-have-to-give-up-our-personal-preferences-for-trumps-bill-speaker-johnson-urges-gop-holdouts-to-get-in-line/",
    "timestamp": "2025-07-02T23:01:52Z"
  },
  {
    "title": "Reeves' five choices to turn government finances around",
    "description": "The chancellor's financial wriggle room has shrunk after welform reforms were watered down.",
    "link": "https://www.bbc.com/news/articles/cq8z7z0vl2po",
    "timestamp": "2025-07-02T23:00:59Z"
  },
  {
    "title": "Eco-Cult Website ‘Climate.gov’ Being Shuffled Off to a New NOAA Webpage",
    "description": "This is a direct-hit to the climate crisis propagandists who have been directing news content and policy direction.\nThe post Eco-Cult Website ‘Climate.gov’ Being Shuffled Off to a New NOAA Webpage first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/eco-cult-website-climate-gov-being-shuffled-off-to-a-new-noaa-webpage/",
    "timestamp": "2025-07-02T23:00:13Z"
  },
  {
    "title": "Can Europe Build Its Own Atomic Arsenal?",
    "description": "Following the Russian invasion of Ukraine and the on-and-off Russian nuclear threats, scholars have been analyzing Europe’s defense capabilities against Moscow’s huge nuclear warhead fleet.  Mixed messages from U.S. President Donald Trump about NATO before th…",
    "link": "https://oilprice.com/Geopolitics/International/Can-Europe-Build-Its-Own-Atomic-Arsenal.html",
    "timestamp": "2025-07-02T23:00:00Z"
  },
  {
    "title": "‘A lot of pain’: Dems revel in GOP agony over Trump’s Big Beautiful Bill",
    "description": "WASHINGTON — An increasing number of congressional Republicans are nervous that President Donald Trump is forcing them to walk the proverbial plank and pass his “Big Beautiful Bill” — even if that means losing their seat. With the expansive measure stalled in…",
    "link": "https://www.rawstory.com/raw-investigates/one-big-beautiful-bill-act-2672559439/",
    "timestamp": "2025-07-02T22:55:02Z"
  },
  {
    "title": "A good soak in a hot tub might beat a sauna for health benefits",
    "description": "Hot tubs and saunas can both soothe aching muscles and provide welcome warmth, but hot tubs might offer greater health benefits. That's the takeaway from a new study done by researchers which compared the physiological effects of soaking in a hot tub to sitti…",
    "link": "https://freerepublic.com/focus/f-chat/4326590/posts",
    "timestamp": "2025-07-02T22:54:48Z"
  },
  {
    "title": "Dr. Phil’s year-old cable network files for bankruptcy, accusing broadcast partner of reneging on obligations | CNN Business",
    "description": "Dr. Phil’s TV network, Merit Street Media, filed for bankruptcy on Wednesday and sued Christian television giants Trinity Broadcasting Network and TCT Ministries for allegedly harming its business and contributing to its financial woes.",
    "link": "https://www.cnn.com/2025/07/02/media/dr-phil-cable-network-bankruptcy",
    "timestamp": "2025-07-02T22:53:35Z"
  },
  {
    "title": "Nationalism Is the Answer to Globalism",
    "description": "Two 2016 elections — President Donald Trump in the U.S. and Brexit in the United Kingdom — sent our global elites reeling. The only people... Read More\nThe post Nationalism Is the Answer to Globalism appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/02/nationalism-is-answer-globalism-yoram-hazony/",
    "timestamp": "2025-07-02T22:52:11Z"
  },
  {
    "title": "Zohran Mamdani Laid Out The Real Reason He Thinks Donald Trump Is Attacking Him",
    "description": "It's a longstanding tactic the president has used to avoid confronting his own flawed policies.",
    "link": "https://www.huffpost.com/entry/zohran-mamdani-donald-trump_n_6865aa65e4b01e8bcb42d018",
    "timestamp": "2025-07-02T22:51:46Z"
  },
  {
    "title": "White House Closes in on House Passage of Trump’s Big Beautiful Bill",
    "description": "The White House indicated that it is making progress closing in on passing President Donald Trump's Big, Beautiful Bill and getting it to his desk by Independence Day.\nThe post White House Closes in on House Passage of Trump’s Big Beautiful Bill appeared firs…",
    "link": "https://www.breitbart.com/politics/2025/07/02/white-house-closes-in-on-house-passage-of-trumps-big-beautiful-bill/",
    "timestamp": "2025-07-02T22:51:42Z"
  },
  {
    "title": "Mike Johnson Touts ‘Forward Momentum’ As Megabill Vote Put On Ice",
    "description": "'Not going to sail through the house'",
    "link": "https://dailycaller.com/2025/07/02/mike-johnson-forward-momentum-big-beautiful-bill/",
    "timestamp": "2025-07-02T22:51:15Z"
  },
  {
    "title": "Breitbart Business Digest: The Vietnam Peace, Metternich, and Trump's Trade Strategy",
    "description": "The critics said tariffs would start a trade war. Instead, Donald Trump may have just ended one.\nThe post Breitbart Business Digest: The Vietnam Peace, Metternich, and Trump’s Trade Strategy appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/07/02/breitbart-business-digest-the-vietnam-peace-metternich-and-trumps-trade-strategy/",
    "timestamp": "2025-07-02T22:50:10Z"
  },
  {
    "title": "Jim Cramer on two trends moving the market: Global trade and dollar weakness",
    "description": "CNBC's Jim Cramer told investors that it's important to understand impactful trends and current events, and he expanded on global trade and dollar weakness.",
    "link": "https://www.cnbc.com/2025/07/02/jim-cramer-on-trends-moving-the-market-trade-and-dollar-weakness.html",
    "timestamp": "2025-07-02T22:49:07Z"
  },
  {
    "title": "US, India push for trade pact after Trump strikes deal with Vietnam, sources say",
    "description": "WASHINGTON/NEW DELHI (Reuters) -U.S. and India trade negotiators were pushing on Wednesday to try to land a tariff-reducing deal ahead of President Donald...",
    "link": "https://www.yahoo.com/news/us-india-push-trade-pact-224703655.html",
    "timestamp": "2025-07-02T22:47:03Z"
  },
  {
    "title": "AOC denounces Trump budget bill as ‘deal with the devil’ in fiery speech",
    "description": "Rep. Alexandria Ocasio-Cortez denounced President Trump’s Big Beautiful Bill as a “scam” and a “deal with the devil” in a fiery speech Wednesday on the House floor. As the sprawling bill inches toward passage, Ocasio-Cortez accused Trump of lying about the me…",
    "link": "https://freerepublic.com/focus/f-news/4326587/posts",
    "timestamp": "2025-07-02T22:43:13Z"
  },
  {
    "title": "Trump: Powell should resign immediately",
    "description": "United States President Donald Trump insisted on Wednesday that Federal Reserve Chair Jerome Powell should \"resign immediately.\"In a post on Truth Social, Trump described Powell as a \"too-late\" and sh...",
    "link": "https://biztoc.com/x/4a6f0e8f26cd0a87",
    "timestamp": "2025-07-02T22:42:43Z"
  },
  {
    "title": "Everyone's A Critic After Trump Gets A New Portrait In Colorado Capitol",
    "description": "The president said the previous portrait was \"purposefully distorted.\"",
    "link": "https://www.huffpost.com/entry/everyones-a-critic-after-trump-gets-a-new-portrait-in-colorado-capitol_n_68659b0ee4b01e8bcb42c400",
    "timestamp": "2025-07-02T22:42:22Z"
  },
  {
    "title": "Homeland Security Secretary Kristi Noem mulls probe of socialist mayoral candidate Zohran Mamdani as ‘danger’ to NYC",
    "description": "Homeland Security Secretary Kristi Noem is mulling whether to use her powers to probe socialist mayoral candidate Zohran Mamdani as a \"danger\" to New York City, a source familiar with the matter told The Post.",
    "link": "https://nypost.com/2025/07/02/us-news/homeland-security-secretary-kristi-noem-mulls-probe-of-socialist-mayoral-candidate-zohran-mamdani-as-danger-to-nyc/",
    "timestamp": "2025-07-02T22:41:30Z"
  },
  {
    "title": "Trump must reverse the dangerous Ukraine aid halt",
    "description": "The White House confirmed Tuesday that \"to put America’s interests first,\" the United States won't be sending promised (and much-needed) artillery rounds, Patriot air defense, rocket systems, Hellfire missiles and other weapons to Kyiv.",
    "link": "https://nypost.com/2025/07/02/opinion/trump-must-reverse-the-dangerous-ukraine-aid-halt/",
    "timestamp": "2025-07-02T22:39:05Z"
  },
  {
    "title": "Trump can’t let Pentagon meddlers derail ‘peace through strength’ for Ukraine",
    "description": "The Defense Department halt on arms shipments to Ukraine undermines Kyiv's battlefield position, signals fading American support — and undercuts Trump’s leverage in peace negotiations.",
    "link": "https://nypost.com/2025/07/02/opinion/trump-cant-let-pentagon-derail-ukraine-peace-through-strength/",
    "timestamp": "2025-07-02T22:35:41Z"
  },
  {
    "title": "Fleischmann says he’s a ‘yes’ on Trump tax cut bill | Chattanooga Times Free Press",
    "description": "U.S. Rep. Chuck Fleischmann, R-Ooltewah, will vote yes on the Senate's version of a major tax cut and policy bill aimed at ushering in President Donald Trump's second-term agenda.",
    "link": "https://www.timesfreepress.com/news/2025/jul/02/fleischmann-says-hes-a-yes-on-trump-tax-cut-bill/",
    "timestamp": "2025-07-02T22:35:13Z"
  },
  {
    "title": "What Paramount’s multi-million dollar settlement with Trump means for press freedom",
    "description": "Paramount agreed to pay Donald Trump $16 million to settle a lawsuit over a “60 Minutes” interview with Kamala Harris. Trump alleged the interview was edited to improve how Harris sounded, a claim CBS denied. Paramount said the funds will go to President Trum…",
    "link": "https://www.pbs.org/newshour/show/what-paramounts-multi-million-dollar-settlement-with-trump-means-for-press-freedom",
    "timestamp": "2025-07-02T22:35:00Z"
  },
  {
    "title": "Biden-appointed judge halts Trump HHS overhaul after Democrat-led lawsuit",
    "description": "A Biden-appointed judge halted Trump's HHS reorganization that would have laid off as many as 20,000 employees after 19 Democratic attorneys general sued to block reforms.",
    "link": "https://www.foxnews.com/politics/biden-appointed-judge-halts-trump-hhs-overhaul-after-democrat-led-lawsuit",
    "timestamp": "2025-07-02T22:31:20Z"
  },
  {
    "title": "Paramount Board Fretted Trump Settlement Could Spark Shareholder Lawsuit, Congressional Investigations: Report",
    "description": "The decision by Paramount Global, CBS' parent company, to settle the lawsuit President Donald Trump filed against the network over a 6o Minutes interview with then-Vice President Kamala Harris last October conflicted the company's directors who worried refusa…",
    "link": "https://www.mediaite.com/media/news/paramount-board-fretted-trump-settlement-could-spark-shareholder-lawsuit-congressional-investigations-report/",
    "timestamp": "2025-07-02T22:31:15Z"
  },
  {
    "title": "Some education grants in limbo were used for ‘leftwing agenda,’ Trump administration says",
    "description": "The Trump administration has accused states and schools of using federal education grants to help fund “a radical leftwing agenda.”",
    "link": "https://abcnews.go.com/US/wireStory/education-grants-limbo-leftwing-agenda-trump-administration-123430179",
    "timestamp": "2025-07-02T22:30:26Z"
  },
  {
    "title": "'The Godfather Presidency': Donald Trump Facing Accusations He Is Running White House 'Like a Mob Boss'",
    "description": "Donald Trump is being accused of running his presidency like a 'mob operation,' and his critics are terrified of what might happen next.",
    "link": "https://radaronline.com/p/donald-trump-running-white-house-like-mob-boss-godfather/",
    "timestamp": "2025-07-02T22:30:00Z"
  },
  {
    "title": "Harley Lippman: Netanyahu must tell Trump 'Let me win the war'",
    "description": "Senior foreign policy expert Harley Lippman speaks with Arutz Sheva about how Israel can ensure continued American support for the war with Hamas.",
    "link": "https://www.israelnationalnews.com/news/411034",
    "timestamp": "2025-07-02T22:29:13Z"
  },
  {
    "title": "Bush teams up with notorious Trump foes to trash 'colossal mistake' shuttering USAID",
    "description": "Former Presidents Bush and Obama, along with U2's Bono, console USAID employees as the agency is shuttered amid Trump administration claims of fraud and mismanagement.",
    "link": "https://www.foxnews.com/politics/bush-teams-up-notorious-trump-foes-trash-colossal-mistake-shuttering-usaid",
    "timestamp": "2025-07-02T22:25:05Z"
  },
  {
    "title": "Big Pharma Lobbying Group Says It Backs ‘Make America Healthy Again’ Agenda Amid Concerns It Aimed to Oust RFK Jr.",
    "description": "A Big Pharma lobbying group has stated that it is “aligned” with President Donald Trump and Robert F. Kennedy Jr.’s mission to “Make America Health... Read More\nThe post Big Pharma Lobbying Group Says It Backs ‘Make America Healthy Again’ Agenda Amid Concerns…",
    "link": "https://www.dailysignal.com/2025/07/02/big-pharma-lobbying-group-says-backs-make-america-healthy-again-maha-agenda-concerns-aimed-oust-rfk-jr/",
    "timestamp": "2025-07-02T22:24:46Z"
  },
  {
    "title": "Here's how much the ICE budget would increase under Trump's megabill",
    "description": "The 2025 budget package known as the One Big Beautiful Bill Act increases the budget for U.S. Immigration and Customs Enforcement from $3.5 billion to $48.5 billion.",
    "link": "https://www.snopes.com//fact-check/ice-budget-big-beautiful-bill/",
    "timestamp": "2025-07-02T22:23:00Z"
  },
  {
    "title": "RFK Jr.’s Confusing Disdain for Medicaid",
    "description": "The health secretary is cheering on cuts to the program that would worsen America's health woes.",
    "link": "https://www.theatlantic.com/health/archive/2025/07/medicaid-cuts-rfk-jr-maha/683406/",
    "timestamp": "2025-07-02T22:23:00Z"
  },
  {
    "title": "James Carville tells ex-CNN host he’s worried Trump will tamper with 2026 midterm elections",
    "description": "Former CNN anchor Jim Acosta frets Trump will try 'tampering.'",
    "link": "https://nypost.com/2025/07/02/media/james-carville-tells-ex-cnn-host-hes-worried-trump-will-tamper-with-2026-midterm-elections/",
    "timestamp": "2025-07-02T22:21:24Z"
  },
  {
    "title": "Barbaric torture detailed by wrongly deported migrant: Forced to kneel all night",
    "description": "The Maryland father wrongly deported to a brutal Salvadoran prison due to a \"clerical error\" has filed an amended complaint detailing the \"torture\" he endured in the prison. Lawfare's Anna Bower posted screen captures of the filing Kilmar Ábrego García's lawy…",
    "link": "https://www.rawstory.com/kilmar-abrego-garcia-cecot/",
    "timestamp": "2025-07-02T22:20:27Z"
  },
  {
    "title": "RCP Podcast: Crunch Time for BBB, Pendulum Swings on Trans Athletes, The Godfather Presidency, Will American Cities Hit Rock Bottom?",
    "description": "Wednesday on the RealClearPolitics radio show -- weeknights at 6:00 p.m. on SiriusXM's POTUS Channel 124 and then on Apple, Spotify, and here on our website -- Andrew Walworth, Tom Bevan, and Phil Wegmann discuss the final chapter in the \"Big, Beautiful\" bill…",
    "link": "https://www.realclearpolitics.com/video/2025/07/02/rcp_podcast_crunch_time_for_bbb_did_paramount_just_bribe_trump_will_us_cities_get_worse_before_they_get_better.html",
    "timestamp": "2025-07-02T22:15:15Z"
  },
  {
    "title": "'Can anyone spell recession?' Trump slammed as jobs report stuns internet",
    "description": "Payrolls processing firm ADP reported private sector hiring contracted unexpectedly in June, with private payrolls losing 33,000 jobs.The news came as a surprise because economists polled by Dow Jones in the weeks ahead of the ADP report had forecast an incre…",
    "link": "https://www.rawstory.com/trump-jobs/",
    "timestamp": "2025-07-02T22:15:01Z"
  },
  {
    "title": "Rev. Al Sharpton urges Cuomo to step aside in NYC mayoral race: 'What is best for New York'",
    "description": "MSNBC's Rev. Al Sharpton urges Andrew Cuomo to withdraw from New York City mayoral race, suggesting a one-on-one contest would better serve residents.",
    "link": "https://www.foxnews.com/politics/rev-al-sharpton-urges-cuomo-step-nyc-mayoral-race-what-best-new-york",
    "timestamp": "2025-07-02T22:14:37Z"
  },
  {
    "title": "Carney meets with auto CEOs as US trade talks continue",
    "description": "A brief readout from the Prime Minister's Office said the group discussed \"the need to build up a made-in-Canada supply chain as well as diversify our trading partners.\"",
    "link": "https://www.nationalobserver.com/2025/07/02/news/carney-meets-auto-ceos-us-trade-talks-continue",
    "timestamp": "2025-07-02T22:14:18Z"
  },
  {
    "title": "A Bill That Rips Away Food, Healthcare and Dignity From Millions—So Billionaires Can Get Richer",
    "description": "Sen. Ron Johnson (R-Wis.) and others can repeat the lie that no one will lose coverage, but it does not make it so. Seventeen million people will lose healthcare (including 11 million Medicaid beneficiaries). Millions will lose food assistance. The debt will …",
    "link": "https://msmagazine.com/2025/07/02/republicans-budget-bill-food-healthcare-billionaires-tax-cuts/",
    "timestamp": "2025-07-02T22:13:12Z"
  },
  {
    "title": "Jan. 6 rioter pardoned by Trump gets life in prison for plot on FBI",
    "description": "An American military veteran was sentenced Wednesday to life in prison for plotting to attack an FBI office and assassinate law enforcement officers in retaliation for his arrest on charges that he was part of the mob that stormed the Capitol on Jan. 6, 2021,…",
    "link": "https://www.cbc.ca/news/world/jan-6-veteran-sentenced-trump-pardon-1.7575687",
    "timestamp": "2025-07-02T22:11:00Z"
  },
  {
    "title": "Columbia University student data stolen by politically motivated hacker, university says",
    "description": "The June 24 cyberattack prompted widespread network outages on campus.",
    "link": "https://www.bostonherald.com/2025/07/02/columbia-university-hack/",
    "timestamp": "2025-07-02T22:10:12Z"
  },
  {
    "title": "The Trend Disrupting Conventional Housing Wisdom",
    "description": "A conversation with Rogé Karma about whether the Sun Belt is going the way of Los Angeles and San Francisco",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/what-american-housing-can-learn-from-california/683407/",
    "timestamp": "2025-07-02T22:10:00Z"
  },
  {
    "title": "Trump announces deal to impose 20% tariff on trade with Vietnam",
    "description": "Any transshipment will face 40 percent levy, while Vietnam will accept US goods tariff-free.",
    "link": "https://www.aljazeera.com/economy/2025/7/2/trump-announces-deal-to-impose-20-tariff-on-trade-with-vietnam",
    "timestamp": "2025-07-02T22:07:57Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Both the S&P 500 and Nasdaq Composite reached record closes on Wednesday.",
    "link": "https://www.cnbc.com/2025/07/02/stock-market-today-live-updates.html",
    "timestamp": "2025-07-02T22:06:00Z"
  },
  {
    "title": "‘The swamp is gonna swamp’: Chip Roy explains why he’s a no on Senate-passed version of Trump’s megabill",
    "description": "'If the administration isn't willing to lean on everybody and say 'end this craziness,' then why am I on the hook to vote for a bill just so I can get some tax cuts and border, which is what I want, but I don't want all the spending'",
    "link": "https://www.wnd.com/2025/07/swamp-is-gonna-swamp-chip-roy-explains-why/",
    "timestamp": "2025-07-02T22:04:58Z"
  },
  {
    "title": "The Third American Republic",
    "description": "I’m always looking for productive frameworks to use in analyzing our national situation. Over the weekend, the Bluesky account called Shower Cat Love (a friend of the blog) came up with one that resonates with some things I’ve been thinking. I won’t claim any…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/the-third-american-republic",
    "timestamp": "2025-07-02T22:03:54Z"
  },
  {
    "title": "XRP Price Eruption Hangs On As Ripple Applies For US National Bank Charter",
    "description": "Ripple confirmed Wednesday that it has filed an application with the U.S. Office of the Comptroller of the Currency for a national banking license.",
    "link": "https://zycrypto.com/xrp-price-eruption-hangs-on-as-ripple-applies-for-us-national-bank-charter/",
    "timestamp": "2025-07-02T22:02:05Z"
  },
  {
    "title": "Federal Court Rules Against Trump's \"Invasion\" Executive Order",
    "description": "But, notably, the court chose not to rule on the issue of what qualifies as an \"invasion.\"",
    "link": "https://reason.com/volokh/2025/07/02/federal-court-rules-against-trumps-invasion-executive-order/",
    "timestamp": "2025-07-02T22:01:14Z"
  },
  {
    "title": "Democrat Warned To 'Avoid Vulgar Speak' When Ripping Trump-Backed Bill",
    "description": "A Democratic congressman was chided when he accused Republicans of \"s----ing on the middle class\" with their \"big, beautiful bill.\"",
    "link": "https://www.newsweek.com/democrat-warned-vulgar-speak-big-beautiful-bill-2093948",
    "timestamp": "2025-07-02T21:59:58Z"
  },
  {
    "title": "Trump announces US-Vietnam trade deal",
    "description": "Trump announces trade deal with Vietnam\nPresident Donald Trump said on Wednesday that the US will charge 20% tariffs on imports from Vietnam under a new trade deal reached during last-minute negotiations.\nProducts sent from Vietnam to the US had faced a 46% l…",
    "link": "https://biztoc.com/x/7f29c9ec89f167ee",
    "timestamp": "2025-07-02T21:59:00Z"
  },
  {
    "title": "Trump's 'Big Beautiful Bill' stalled by Republican rebellion in Congress",
    "description": "Republican opposition in Congress has stalled a crucial vote on Trump’s major tax and spending bill, casting doubt on its final approval.",
    "link": "https://www.thejournal.ie/trump-big-beautiful-bill-republican-rebellion-congress-6751071-Jul2025/",
    "timestamp": "2025-07-02T21:58:29Z"
  },
  {
    "title": "Fact Check: Are Gas Prices at Four-Year Low as Donald Trump Claims?",
    "description": "On Truth Social, Trump shared a photo of him clapping in front of a gas pump, with the words: \"Gas prices are at a 4 year low.\"",
    "link": "https://biztoc.com/x/1da4d72b09800ce3",
    "timestamp": "2025-07-02T21:58:28Z"
  },
  {
    "title": "Trump vs. after-school programs, briefly explained",
    "description": "President Donald Trump with Education Secretary Linda McMahon at the White House on March 20, 2025. | ﻿Chen Mengtong/China News Service/VCG via Getty Images \nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump ad…",
    "link": "https://biztoc.com/x/8d7242668097c91e",
    "timestamp": "2025-07-02T21:58:19Z"
  },
  {
    "title": "Pentagon Confirms Pause On Ukraine Aid, Blames Biden For Sending Too Many Weapons",
    "description": "The delay comes after Trump told a Ukrainian journalist he would try to make anti-missile systems “available” to defend against Russia’s onslaught.",
    "link": "https://www.huffpost.com/entry/donald-trump-ukraine-weapons-pause_n_6865a131e4b01e8bcb42c73e",
    "timestamp": "2025-07-02T21:55:31Z"
  },
  {
    "title": "Iran's nuclear program knocked back 'closer to 2 years,' Pentagon says",
    "description": "Iran's nuclear program knocked back 'closer to 2 years,' Pentagon saysgo.com",
    "link": "https://abcnews.go.com/Politics/irans-nuclear-program-knocked-back-closer-2-years/story?id=123426615",
    "timestamp": "2025-07-02T21:55:05Z"
  },
  {
    "title": "These Bullish Catalysts Could Spark Bitcoin’s Explosion To $200,000 By Year-End: Standard Chartered Exec",
    "description": "Standard Chartered has forecasted massive gains for Bitcoin, predicting a potential rocket surge to $200,000 in the second half of this year.",
    "link": "https://zycrypto.com/these-bullish-catalysts-could-spark-bitcoins-explosion-to-200000-by-year-end-standard-chartered-exec/",
    "timestamp": "2025-07-02T21:54:32Z"
  },
  {
    "title": "Trump’s legislative win could make him a political loser",
    "description": "President Donald Trump is about to achieve his biggest legislative victory yet: his “one big, beautiful bill” — the massive tax– and Medicaid-cutting, immigration and border spending bill passed the Senate on Tuesday — is on the verge of passing the House of …",
    "link": "https://www.vox.com/politics/418668/trump-bill-reconciliation-unpopular-republican-backlash",
    "timestamp": "2025-07-02T21:53:48Z"
  },
  {
    "title": "There’s No Plan B If Republicans Sink Trump’s Megabill",
    "description": "On the very final hurdle of Trump’s Big Beautiful Bill, Republicans have gotten stuck without the votes to pass it on the House floor. Trump may be able to promise some actions outside the bill to placate critics, but there’s no obvious plan B.",
    "link": "http://nymag.com/intelligencer/article/theres-no-plan-b-if-republicans-sink-trumps-megabill.html",
    "timestamp": "2025-07-02T21:51:30Z"
  },
  {
    "title": "Unpacking claims that 17M people will lose health care with Trump's budget bill",
    "description": "After the U.S. Senate voted to pass the \"Big Beautiful Bill,\" rumors circulated about the consequences of deep cuts to Medicaid.",
    "link": "https://www.snopes.com//news/2025/07/02/trump-budget-bill-health-care/",
    "timestamp": "2025-07-02T21:51:00Z"
  },
  {
    "title": "Federal court blocks Trump’s effort to deny asylum at border",
    "description": "A federal court found the US president cannot categorically deny asylum to migrants who cross the US-Mexico border. The US government can appeal the ruling.",
    "link": "https://www.dw.com/en/federal-court-blocks-trumps-effort-to-deny-asylum-at-border/a-73128413",
    "timestamp": "2025-07-02T21:51:00Z"
  },
  {
    "title": "Fact Check: Are Gas Prices at Four-Year Low as Donald Trump Claims?",
    "description": "On Truth Social, Trump shared a photo of him clapping in front of a gas pump, with the words: \"Gas prices are at a 4 year low.\"",
    "link": "https://www.newsweek.com/fact-check-are-gas-prices-four-year-low-donald-trump-claims-2093889",
    "timestamp": "2025-07-02T21:50:56Z"
  },
  {
    "title": "Live: Microsoft axing jobs in Australia, while Wall Street rises on Trump-Vietnam trade deal",
    "description": "The tech giant is cutting 4 per cent of its global workforce, including in Australia. Meanwhile, the fall-out from the Qantas cyber attack continues. Follow the day's events and insights as they happen with our business reporters on the ABC News live markets …",
    "link": "https://www.abc.net.au/news/2025-07-03/asx-markets-business-live-news-july-3-2025/105488796",
    "timestamp": "2025-07-02T21:50:15Z"
  },
  {
    "title": "Is Zohran Mamdani really that bad for New York’s crypto industry?",
    "description": "Zohran Mamdani has made waves after his primary election victory, but what would he mean for the crypto industry in NYC?",
    "link": "https://cointelegraph.com/news/zohran-mamdani-crypto-election",
    "timestamp": "2025-07-02T21:50:09Z"
  }
]