[
  {
    "title": "Letter from London: Pittufik Off",
    "description": "Media question in 1964 to Beatles during first US tour: ‘How do you find America?’ asks a reporter. ‘Turn left at Greenland,’ replies John Lennon. Above the Northumbrian fireplace where I spent summers as a child after winters in Scotland was a small oil pain…",
    "link": "https://www.counterpunch.org/2025/04/04/letter-from-london-pittufik-off-2/",
    "timestamp": "2025-04-04T05:48:25Z"
  },
  {
    "title": "Why stock market is falling today: 4 reasons behind Rs 9.5 lakh crore wealth wipeout; Sensex down 830 pts, Nifty below 23,000",
    "description": "Indian stock markets experienced a sharp drop as renewed recession fears and President Trump's new tariff announcements sparked a global selloff. The Sensex fell 836 points, with broad-based selling pulling down sectoral indices including metal, pharma, and I…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-falling-today-4-reasons-behind-rs-9-5-lakh-crore-wealth-wipeout-sensex-down-830-pts-nifty-below-23000/articleshow/119968164.cms",
    "timestamp": "2025-04-04T05:47:58Z"
  },
  {
    "title": "BTC, ETH, XRP Set For a Near-Term Bounce as Attention Turns to Rate Cuts",
    "description": "Data shows markets are pricing in four rate cuts in 2025 — 0.25 bps each in June, July, September and December. Rate cuts occur when a central bank, like the Federal Reserve, lowers interest rates to stimulate economic growth by making borrowing cheaper.",
    "link": "https://www.coindesk.com/markets/2025/04/04/btc-eth-xrp-set-for-a-near-term-bounce-as-attention-turns-to-rate-cuts",
    "timestamp": "2025-04-04T05:45:54Z"
  },
  {
    "title": "A Different Approach Is Needed for Survival in the Nuclear Age",
    "description": "Amid growing international chaos, it should come as no surprise that nuclear dangers are increasing. The latest indication is a rising interest among U.S. allies in enhancing their nuclear weapons capability. For many decades, remarkably few of them had been …",
    "link": "https://www.counterpunch.org/2025/04/04/a-different-approach-is-needed-for-survival-in-the-nuclear-age/",
    "timestamp": "2025-04-04T05:45:44Z"
  },
  {
    "title": "Penguin Memes Take Flight After Trump Tariffs Remote Island",
    "description": "Donald Trump&#039;s tariffs have become a black and white issue on social media, where penguin memes have gone viral after he targeted an island inhabited by the flightless birds, but no people.",
    "link": "https://www.ndtv.com/world-news/penguin-memes-take-flight-after-trump-tariffs-remote-island-8083937",
    "timestamp": "2025-04-04T05:45:25Z"
  },
  {
    "title": "Remember Congress?",
    "description": "Commerce Secretary Lutnick recently had this to say:\n\nDonald Trump’s commerce secretary Howard Lutnick Thursday said that people should just let the president run the global economy because he knows what he has been doing.\r\n\n\nOne thing he presumably knows is …",
    "link": "https://www.econlib.org/remember-congress/",
    "timestamp": "2025-04-04T05:44:44Z"
  },
  {
    "title": "Trump Makes History Again? Great…",
    "description": "Donald Trump’s attempts at “fostering unity and a deeper understanding of our shared past” have a chance to succeed — by spurring the very sort of “revisionist movement” he denounces in his March 27 executive order “Restoring Truth and Sanity to American Hist…",
    "link": "https://www.counterpunch.org/2025/04/04/trump-makes-history-again-great/",
    "timestamp": "2025-04-04T05:43:41Z"
  },
  {
    "title": "Texas Attorney General Ken Paxton gears up for potential Senate run after bribery probe dismissed",
    "description": "After months of hinting at a run for U.S. Senate, Texas Attorney General Ken Paxton's path has become clearer since the dismissal of a federal investigation",
    "link": "https://abcnews.go.com/Politics/wireStory/texas-attorney-general-ken-paxton-gears-potential-senate-120477492",
    "timestamp": "2025-04-04T05:42:16Z"
  },
  {
    "title": "Texas Attorney General Ken Paxton gears up for potential Senate run after bribery probe dismissed",
    "description": "After months of hinting at a run for U.S. Senate, Texas Attorney General Ken Paxton's path has become clearer since the dismissal of a federal investigation",
    "link": "https://abcnews.go.com/US/wireStory/texas-attorney-general-ken-paxton-gears-potential-senate-120477491",
    "timestamp": "2025-04-04T05:42:15Z"
  },
  {
    "title": "Academic Freedom Under Attack: From the Government But Also From Within",
    "description": "Universities in the United States are facing one of the most serious attempts to impose political control on higher education since the anticommunist loyalty tests of the 1950s. Whatever one thinks of the issues being debated today, such as the Israel/Palesti…",
    "link": "https://www.counterpunch.org/?p=359425",
    "timestamp": "2025-04-04T05:42:06Z"
  },
  {
    "title": "Trump Says US Near TikTok Deal, Reiterates Trade Relief Offer For China's Approval: 'Tariffs Give Us Great Power To Negotiate'",
    "description": "On Thursday, President Donald Trump confirmed that the U.S. is nearing a deal to spare TikTok from a potential ban, with ongoing discussions involving multiple investors and a possible tariff agreement with China.\nWhat Happened: During remarks aboard Air Forc…",
    "link": "https://biztoc.com/x/e167c7f274bb1c96",
    "timestamp": "2025-04-04T05:41:11Z"
  },
  {
    "title": "Could Working Class Whites Spark Trump’s Undoing?",
    "description": "Lost amidst the firehose of lies uttered by Donald Trump at his address before Congress March 4, was a New Mexico Democratic congresswoman’s succinct description of the crisis facing the United States: Rep. Melanie Stansbury held a small sign that said, “This…",
    "link": "https://www.counterpunch.org/2025/04/04/could-working-class-whites-spark-trumps-undoing/",
    "timestamp": "2025-04-04T05:37:02Z"
  },
  {
    "title": "The Italian Gardener’s Stories",
    "description": "I am Jarvis. I am the Italian gardener. My parents were immigrants who come to this country in 1939, escaping the war everyone know was coming. Or should have. At least my parents figured it out. I am happy they did. Others were not so lucky. My grandmother f…",
    "link": "https://www.counterpunch.org/2025/04/04/the-italian-gardeners-stories/",
    "timestamp": "2025-04-04T05:36:01Z"
  },
  {
    "title": "Trump slaps Job\u0092s Mob with brutal tariffs",
    "description": "Donald [hamburger-eating surrender monkey] Trump has slammed a monster 46 per cent tariff on regions key to the Fruity Cargo Cult Apple\u0092s global production chain, driving up the price of iPhones, Macs, and just about everything else shiny and...",
    "link": "http://www.madshrimps.be/news/item/238212",
    "timestamp": "2025-04-04T05:35:10Z"
  },
  {
    "title": "Donald Trump To Hit Brown With $510 Million Funding Freeze: Report",
    "description": "The Trump administration is poised to block $510 million in federal grants and contracts for Brown University over the school&#039;s response to antisemitism on campus, according to a report.",
    "link": "https://www.ndtv.com/world-news/donald-trump-to-hit-brown-with-510-million-funding-freeze-report-8083867",
    "timestamp": "2025-04-04T05:35:01Z"
  },
  {
    "title": "Asian stocks slide after Wall Street surrenders to a hit by Trump's tariffs",
    "description": "Asian markets have fallen further after Wall Street led the biggest loss among world's markets following U.S. President Donald Trump's “Liberation Day” tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/asian-stocks-slide-after-wall-street-surrenders-hit-120476023",
    "timestamp": "2025-04-04T05:34:20Z"
  },
  {
    "title": "Elon’s father says Tesla tycoon admires Putin",
    "description": "Errol Musk says his family admires the Russian leader for his calm leadership and logical speeches Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615219-elons-father-says-tesla-tycoon-admires-putin/",
    "timestamp": "2025-04-04T05:32:26Z"
  },
  {
    "title": "Don't use defence to negotiate on tariffs, former PM Howard warns",
    "description": "Former prime minister John Howard says defence should never be used as a bargaining chip in negotiating exemptions from US President Donald Trump's tariffs.",
    "link": "https://www.abc.net.au/news/2025-04-04/howard-dutton-defence-tariff-federal-election-2025/105139512",
    "timestamp": "2025-04-04T05:31:25Z"
  },
  {
    "title": "Possibility of tariffs on pharma sector to dominate agenda as Tánaiste chairs Trade Forum",
    "description": "Simon Harris is set to tell the meeting that a “comprehensive and detailed action plan” will be prepared by his departments within six weeks.",
    "link": "https://www.thejournal.ie/simon-harris-government-trade-forum-tariffs-pharma-sector-6667789-Apr2025/",
    "timestamp": "2025-04-04T05:30:50Z"
  },
  {
    "title": "‘There are no winners’: global companies respond to Trump tariffs",
    "description": "Donald Trump’s sweeping tariffs will upend global trade, adding costs and delays to businesses around the world and threatening a recession.\nThe Guardian spoke to eight businesses about the impact.\nItaly: pecorino cheesemaker\nOn the Italian island of Sardinia…",
    "link": "https://biztoc.com/x/949ce1beb718f686",
    "timestamp": "2025-04-04T05:30:04Z"
  },
  {
    "title": "Who Is Laura Loomer and What Is Her Relationship With Trump?",
    "description": "The right-wing personality known for her incendiary social media presence had appeared to be sidelined but may have the President’s ear again, at least for now.",
    "link": "https://time.com/7274753/who-is-laura-loomer-relationship-trump-nsc-firings/",
    "timestamp": "2025-04-04T05:30:00Z"
  },
  {
    "title": "Trump defiant as tariffs send world markets into panic",
    "description": "Wall Street led a global markets bloodbath Thursday as countries around the world reeled from President Donald Trump's trade war, while the White House insisted the U.S. economy will emerge victorious.",
    "link": "https://www.hurriyetdailynews.com/trump-defiant-as-tariffs-send-world-markets-into-panic-207663",
    "timestamp": "2025-04-04T05:29:18Z"
  },
  {
    "title": "Colleges say the Trump administration is using new tactics to expel international students",
    "description": "A crackdown on foreign students is alarming colleges, who say the Trump administration is using new tactics and vague justifications to push some students out of the country",
    "link": "https://abcnews.go.com/US/wireStory/colleges-trump-administration-new-tactics-expel-international-students-120477214",
    "timestamp": "2025-04-04T05:26:25Z"
  },
  {
    "title": "‘He Was Gone’: Gingrich Says Special Committees Must Probe Biden’s Mental Fitness And Ask Four Serious Questions",
    "description": "Former House Speaker Newt Gingrich appeared on Fox News Thursday and called for the creation of either a joint House-Senate",
    "link": "https://ijr.com/he-was-gone-gingrich-says-special-committees-must-probe-bidens-mental-fitness-and-ask-four-serious-questions/",
    "timestamp": "2025-04-04T05:23:52Z"
  },
  {
    "title": "China, US Make First-Known Military Contact Since Trump's Inauguration",
    "description": "Chinese and US defense officials had their first known formal contact since Donald Trump returned to the White House, in a meeting that partially coincided with Beijing conducting large-scale military drills around Taiwan.",
    "link": "https://www.ndtv.com/world-news/china-us-make-first-known-military-contact-since-trumps-inauguration-8083799",
    "timestamp": "2025-04-04T05:23:32Z"
  },
  {
    "title": "How Trump's Tariffs Could Hurt Americans' Wallets",
    "description": "As global financial markets plunge in the wake of US President Donald Trump&#039;s &quot;Liberation Day&quot; tariffs, Americans must also grapple with the potentially long-lasting impact of the move on household budgets.",
    "link": "https://www.ndtv.com/world-news/how-trumps-tariffs-could-hurt-americans-wallets-8083793",
    "timestamp": "2025-04-04T05:20:48Z"
  },
  {
    "title": "Nissan says it will not take new US orders for Mexican-built Infiniti SUVs",
    "description": "Nissan Motor will halt new orders from the U.S. for two Mexican-built Infiniti SUVs due to tariffs imposed by President Trump. It will also retain two production shifts for the Rogue SUV in Tennessee. Despite discontinuing U.S. sales, models like the Infiniti…",
    "link": "https://economictimes.indiatimes.com/news/international/business/nissan-says-it-will-not-take-new-us-orders-for-mexican-built-infiniti-suvs/articleshow/119967306.cms",
    "timestamp": "2025-04-04T05:20:13Z"
  },
  {
    "title": "Countdown for European response – Freezing investments in the US",
    "description": "Ursula von der Leyen insists on dialogue, but individual countries are already preparing their response - Macron calls for freezing billions from French investors in the US in the wake of the tariffs\nThe post Countdown for European response – Freezing investm…",
    "link": "https://en.protothema.gr/2025/04/04/countdown-for-european-response-freezing-investments-in-the-us/",
    "timestamp": "2025-04-04T05:20:08Z"
  },
  {
    "title": "Trump’s maces: countdown for European response – Freezing investments in the US",
    "description": "Ursula von der Leyen insists on dialogue, but individual countries are already preparing their response - Macron calls for freezing billions from French investors in the US in the wake of the tariffs\nThe post Trump’s maces: countdown for European response – F…",
    "link": "https://en.protothema.gr/2025/04/04/trumps-maces-countdown-for-european-response-freezing-investments-in-the-us/",
    "timestamp": "2025-04-04T05:20:08Z"
  },
  {
    "title": "Macron urges French companies to halt investments in the United States",
    "description": "In today’s edition of The Capitals, read about Trump carpet bombing global trade – Irish pharma on borrowed time, Meloni not ruling out tariff response to the US, Greece eyeing Israel for ‘Shield of Achilles’ dome, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-macron-urges-french-companies-to-halt-investments-in-the-united-states/",
    "timestamp": "2025-04-04T05:19:25Z"
  },
  {
    "title": "Nikkei plunges 4% as Trump tariffs jolt global markets",
    "description": "Asia-Pacific markets traded lower on Friday amid mounting global fears sparked by new US tariffs announced by United States President Donald Trump. Japan's Nikkei 225 tumbled as much as 4.21%, its ste...",
    "link": "https://biztoc.com/x/45e3afd9da071f29",
    "timestamp": "2025-04-04T05:18:44Z"
  },
  {
    "title": "Trump’s tariffs bring heavy losses in Tokyo, turmoil in international markets",
    "description": "On Wall Street, the S&P 500 fell the most since the pandemic, with Apple losing $314 billion, Nvidia $209 billion, Amazon $187 billion and Meta $133 billion\nThe post Trump’s tariffs bring heavy losses in Tokyo, turmoil in international markets appeared first …",
    "link": "https://en.protothema.gr/2025/04/04/trumps-tariffs-bring-heavy-losses-in-tokyo-turmoil-in-international-markets/",
    "timestamp": "2025-04-04T05:15:23Z"
  },
  {
    "title": "Cautious Budget on the cards as ministers rule out spending and tax decisions that create new risks",
    "description": "Donohoe said the government will outline its economic forecast for the budget in a few weeks time.",
    "link": "https://www.thejournal.ie/budget-2026-taxation-6667983-Apr2025/",
    "timestamp": "2025-04-04T05:15:03Z"
  },
  {
    "title": "Slovakia: junior coalition partner calls on Fico to “dismiss” Šefčovič over US tariffs",
    "description": "The party criticised Šefčovič for his passive stance regarding US tariffs.",
    "link": "https://www.euractiv.com/section/politics/news/slovakia-junior-coalition-partner-calls-on-fico-to-dismiss-sefcovic-over-us-tariffs/",
    "timestamp": "2025-04-04T05:13:17Z"
  },
  {
    "title": "“There will be blood”: JPMorgan warns of 60% global recession odds under Trump tariffs",
    "description": "Donald Trump’s sweeping new tariffs are raising alarms about a potential U.S. and global recession. Economists from JPMorgan, Goldman Sachs, and Moody’s Analytics warn that the trade war could push inflation higher, weaken consumer confidence, and slow econom…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/there-will-be-blood-jpmorgan-warns-of-60-global-recession-odds-under-trump-tariffs/articleshow/119965761.cms",
    "timestamp": "2025-04-04T05:11:52Z"
  },
  {
    "title": "President Trump: FREE MARINE LE PEN!",
    "description": "The Witch Hunt against Marine Le Pen is another example of European Leftists using Lawfare to silence Free Speech, and censor their Political Opponent, this time going so far as to put that Opponent in prison. It is the same “playbook” that was used against m…",
    "link": "https://freerepublic.com/focus/f-news/4308753/posts",
    "timestamp": "2025-04-04T05:11:04Z"
  },
  {
    "title": "Top Democrats protest after reported firing of National Security Agency director",
    "description": "Top congressional Democrats are protesting the reported firing of Gen_ Tim Haugh as director of the National Security Agency, with one lawmaker saying the decision “makes all of us less safe.”",
    "link": "https://abcnews.go.com/Politics/wireStory/top-democrats-protest-after-reported-firing-national-security-120476025",
    "timestamp": "2025-04-04T05:10:32Z"
  },
  {
    "title": "‘Time To Make The Patient Better’: JD Vance Says ‘Big Transition’ Coming To American Economic Policy",
    "description": "Vice President JD Vance said he believes Americans will \"reap the benefits\" of the economy as the Trump administration makes a \"big transition\" on tariffs.",
    "link": "https://dailycaller.com/2025/04/04/jd-vance-us-economy-tariffs-american-workers/",
    "timestamp": "2025-04-04T05:10:05Z"
  },
  {
    "title": "Ireland urges EU to exempt food and alcohol in tariffs as Trump flags levies for pharma industry in ‘near future’",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/ireland-urges-eu-to-exempt-food-and-alcohol-in-tariffs-as-trump-flags-levies-for-pharma-industry-in-near-future/a616185087.html",
    "timestamp": "2025-04-04T05:10:00Z"
  },
  {
    "title": "Ireland urges EU to exempt food and alcohol in tariffs as fallout from Donald Trump’s ‘Liberation Day’ continues",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/politics/ireland-urges-eu-to-exempt-food-and-alcohol-in-tariffs-as-fallout-from-donald-trumps-liberation-day-continues/a616185087.html",
    "timestamp": "2025-04-04T05:10:00Z"
  },
  {
    "title": "Ireland urges EU to exempt food and alcohol in tariffs as Trump insists things ‘going well’ after bombshell announcement",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/politics/ireland-urges-eu-to-exempt-food-and-alcohol-in-tariffs-as-trump-insists-things-going-well-after-bombshell-announcement/a616185087.html",
    "timestamp": "2025-04-04T05:10:00Z"
  },
  {
    "title": "Apple’s ‘Make in India’ dream meets tariff reality under Trump’s trade salvo",
    "description": "Trump’s tariffs may leave Apple fans in India paying moreIndia, a rising hub for smartphone manufacturing, has been drawn into President Donald Trump’s aggressive new tariff regime. With a 27% reciprocal tariff imposed on Indian exports to the US, major playe…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/trump-tariff-war-apples-make-in-india-dream-meets-tariff-reality-under-trumps-trade-salvo/articleshow/119961139.cms",
    "timestamp": "2025-04-04T05:08:30Z"
  },
  {
    "title": "‘The prices are already high for Irish goods here’: Irish Americans brace themselves for tariffs impact",
    "description": "Businesses face up to prospect of ‘radical rethink’ of their operations",
    "link": "https://www.irishtimes.com/world/us/2025/04/04/the-prices-are-already-high-for-irish-goods-here-irish-americans-brace-themselves-for-tariffs-impact/",
    "timestamp": "2025-04-04T05:06:00Z"
  },
  {
    "title": "Don’t buy just because it’s fallen: Samir Arora warns against catching falling knives",
    "description": "Samir Arora of Helios Capital discusses market volatility, the impact of US tariffs, and effective investment strategies amid economic uncertainties. He emphasizes cautious optimism for India’s market performance while highlighting potential correction in US …",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/dont-buy-just-because-its-fallen-samir-arora-warns-against-catching-falling-knives/articleshow/119966487.cms",
    "timestamp": "2025-04-04T05:01:46Z"
  },
  {
    "title": "XRP Breakout Alert! Could This Surge Send The Altcoin To $3?",
    "description": "XRP is probing critical support levels as the cryptocurrency market struggles with chronic volatility. The digital asset currently trades at $1.98, a daily trading volume of $10.50 billion and market value of $115 billion. Over the last 24 hours, XRP has decl…",
    "link": "http://www.newsbtc.com/altcoin/xrp-breakout-alert-could-this-surge-send-the-altcoin-to-3/",
    "timestamp": "2025-04-04T05:00:16Z"
  },
  {
    "title": "Labour and the Social Democrats are now firmly in the orbit of Sinn Féin",
    "description": "Last week’s shouting down of the Ceann Comhairle by Opposition parties have set a dangerous new tone for Irish politics",
    "link": "https://www.irishtimes.com/opinion/2025/04/04/labour-and-the-social-democrats-are-now-firmly-in-the-orbit-of-sinn-fein/",
    "timestamp": "2025-04-04T05:00:01Z"
  },
  {
    "title": "Microsoft president Brad Smith: ‘Our support for Ireland is steadfast’",
    "description": "Microsoft president Brad Smith says the company, which is celebrating 50 years since it was founded, and 40 years in Ireland, is as committed to the country as it was in the 1980s",
    "link": "https://www.irishtimes.com/business/2025/04/04/microsoft-president-brad-smith-our-support-for-ireland-is-steadfast/",
    "timestamp": "2025-04-04T05:00:00Z"
  },
  {
    "title": "Donald Trump’s tariffs have changed the world. How will the US, EU and Irish economies react?",
    "description": "Trump tariffs: The focus might be on exports but the hit to investment will curb growth and job creation",
    "link": "https://www.irishtimes.com/your-money/2025/04/04/trump-has-changed-the-world-how-will-the-us-eu-and-irish-economies-react/",
    "timestamp": "2025-04-04T05:00:00Z"
  },
  {
    "title": "Japan PM Says Trump Tariffs A 'National Crisis'",
    "description": "US President Donald Trump's tariffs on Japanese goods are a \"national crisis\", Prime Minister Shigeru Ishiba said Friday ahead of cross-party talks on mitigating the impact.",
    "link": "https://www.ibtimes.com/japan-pm-says-trump-tariffs-national-crisis-3768801",
    "timestamp": "2025-04-04T04:57:19Z"
  },
  {
    "title": "Macron calls on French companies to suspend investments in United States",
    "description": "During a meeting held today with representatives of industries most affected by the tariff measures announced by Donald Trump, President Emmanuel Macron urged French manufacturers to suspend \"upcoming investments or those announced in recent weeks\" in the Uni…",
    "link": "https://biztoc.com/x/3cc266353f7b45de",
    "timestamp": "2025-04-04T04:56:23Z"
  },
  {
    "title": "Pharma stocks slide up to 7% as Trump hints at unprecedented tariffs on sector",
    "description": "Shares of Indian pharma companies, including Aurobindo Pharma, Laurus Labs, IPCA Labs, and Lupin, fell up to 7% after U.S. President Donald Trump hinted at imminent tariffs on pharmaceutical imports. Speaking aboard Air Force One, Trump said pharma would be t…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-stocks-slide-up-to-7-as-trump-hints-at-unprecedented-tariffs-on-sector/articleshow/119966661.cms",
    "timestamp": "2025-04-04T04:56:11Z"
  },
  {
    "title": "Critics Make Comedy Gold Out Of Trump's $5 Million Card Reveal",
    "description": "The president offered a first look at a card with his face on it that looks to grant wealthy buyers with a pathway to American citizenship.",
    "link": "https://www.huffpost.com/entry/donald-trump-reveals-gold-card-us-citizenship_n_67ef4e9de4b0b77860e1cfb7",
    "timestamp": "2025-04-04T04:54:30Z"
  },
  {
    "title": "Macron calls on French companies to suspend investments in United States",
    "description": "The French president stressed that the response to the American offensive should be found at the European level.",
    "link": "https://www.euractiv.com/section/politics/news/macron-calls-on-french-companies-to-suspend-investments-in-united-states/",
    "timestamp": "2025-04-04T04:53:10Z"
  },
  {
    "title": "Japan PM says Trump tariffs a ‘national crisis’",
    "description": "US President Donald Trump’s tariffs on Japanese goods are a “national crisis”, Prime Minister Shigeru Ishiba said Friday ahead of cross-party talks on mitigating the impact. Japanese firms are the biggest investors into the United States but Trump on Thursday…",
    "link": "https://www.digitaljournal.com/world/japan-pm-says-trump-tariffs-a-national-crisis/article",
    "timestamp": "2025-04-04T04:52:33Z"
  },
  {
    "title": "US markets plunge on Trump tariffs as Indian indices show resilience",
    "description": "Sensex traded at 75,819.09, down 476.27 points and Nifty at 23,066.15, down 183.95 points at 9.45 am after opening at 76,160.09 and 23,190.40, respectively",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/us-markets-plunge-on-trump-tariffs-as-indian-indices-show-resilience/article69411340.ece",
    "timestamp": "2025-04-04T04:51:58Z"
  },
  {
    "title": "Asian stocks slide after Wall Street surrendered to a hit by Trump's tariffs",
    "description": "Asian markets have fallen further after Wall Street led the biggest loss among world's markets following U.S. President Donald Trump's “Liberation Day” tariffs.",
    "link": "https://www.clickondetroit.com/business/2025/04/04/asian-stocks-slid-after-wall-street-surrendered-to-a-hit-by-trumps-tariffs/",
    "timestamp": "2025-04-04T04:51:33Z"
  },
  {
    "title": "White House Tweaks 14 Tariff Levels Amid Confusion After \"Liberation Day\"",
    "description": "More than a dozen countries set for US reciprocal tariffs spent the first day of President Donald Trump&#039;s tariff rollout not only bracing for the economic fallout but with confusion about exactly what rates they might face.",
    "link": "https://www.ndtv.com/world-news/white-house-tweaks-14-tariff-levels-amid-confusion-after-liberation-day-8083593",
    "timestamp": "2025-04-04T04:50:21Z"
  },
  {
    "title": "Rupee rises 34 paise to 84.96 against US dollar in early trade",
    "description": "The rupee appreciated 34 paise to 84.96 against the US dollar, supported by falling crude oil prices and the weakening of the American currency. Trump's tariffs have sparked fears of inflation and a potential recession, leading to the greenback's broad-based …",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-rises-34-paise-to-84-96-against-us-dollar-in-early-trade/articleshow/119966369.cms",
    "timestamp": "2025-04-04T04:48:55Z"
  },
  {
    "title": "Coforge, Wipro and other IT stocks fall up to 2% amid Trump tariff jitters",
    "description": "Indian IT services stocks fell sharply for the second day in a row, hit by new reciprocal U.S. tariffs. Major companies like TCS, Infosys, and HCL Tech experienced declines, with the Nifty IT index dropping 1.5%. Market sentiment remains weak amid expectation…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/coforge-wipro-and-other-it-stocks-fall-up-to-2-amid-trump-tariff-jitters/articleshow/119966330.cms",
    "timestamp": "2025-04-04T04:47:54Z"
  },
  {
    "title": "Crude oil futures decline amid OPEC+ production increase and US tariff concerns",
    "description": "Crude oil futures decline as OPEC+ increases production; market dynamics impacted by US tariffs, impacting global energy demand.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-decline-amid-opec-production-increase-and-us-tariff-concerns/article69411357.ece",
    "timestamp": "2025-04-04T04:47:33Z"
  },
  {
    "title": "NSA Director and Deputy Reportedly Dismissed: What We Know",
    "description": "The latest high-level shake-up comes late Thursday night and on the heels of President Trump's meeting with far-right activist Laura Loomer.",
    "link": "https://www.newsweek.com/nsa-director-deputy-reportedly-dismissed-what-we-know-2055155",
    "timestamp": "2025-04-04T04:46:51Z"
  },
  {
    "title": "Larry Summers: Trump Administration Has 'Lack of Basic Competence'",
    "description": "Former U.S. Treasury Secretary Larry Summers claimed Thursday on CNN's \"The Arena\" that he was concerned President Donald Trump's tariffs showed a \"lack of basic competence.\"\nThe post Larry Summers: Trump Administration Has ‘Lack of Basic Competence’ appeared…",
    "link": "https://www.breitbart.com/clips/2025/04/03/larry-summers-trump-administration-has-lack-of-basic-competence/",
    "timestamp": "2025-04-04T04:45:58Z"
  },
  {
    "title": "Japan's Ishiba says US tariffs 'national crisis'",
    "description": "Japanese Prime Minister Shigeru Ishiba said that the tariffs imposed on Japanese goods by United States President Donald Trump are a \"national crisis.\"\nThe tariffs on Japanese imports &quot...",
    "link": "https://biztoc.com/x/12a55ee60c6f60e9",
    "timestamp": "2025-04-04T04:45:35Z"
  },
  {
    "title": "Commerce Secretary Howard Lutnick on the US trying to take chip manufacturing from Taiwan: 'Why can't those be made with robotics in America?'",
    "description": "\"All of our electronics are primarily built in Taiwan. It used to be built here. Our policies let Taiwan take it all,\" Lutnick said.",
    "link": "https://www.businessinsider.com/lutnick-us-needs-to-take-chip-production-from-taiwan-2025-4",
    "timestamp": "2025-04-04T04:45:09Z"
  },
  {
    "title": "Dollar wipes out post-Trump rally as tariffs upend global growth",
    "description": "That’s in stark contrast to earlier this year when Trump’s policy plans — such as tax cuts and tariffs — were seen as a reason to bet on a rally in the dollar",
    "link": "https://www.bloomberg.com/news/articles/2025-04-03/dollar-wipes-out-post-trump-rally-as-tariffs-upend-global-growth",
    "timestamp": "2025-04-04T04:44:59Z"
  },
  {
    "title": "‘A Minecraft Movie’ Bound For Platinum Box Office Weekend After $7M+ Thursday Previews",
    "description": "EXCLUSIVE: “Presales just suddenly popped this week,” an exhibitor remarked today at CinemaCon about the potential mushrooming forecast for Warner Bros/Legendary’s A Minecraft Movie. Get excited. At a time when the domestic box office this year is -11% behind…",
    "link": "http://deadline.com/2025/04/box-office-a-minecraft-movie-1236359247/",
    "timestamp": "2025-04-04T04:44:25Z"
  },
  {
    "title": "South Korea Court Ousts Impeached President Yoon",
    "description": "South Korea's Constitutional Court on Friday unanimously upheld President Yoon Suk Yeol's impeachment over his disastrous martial law declaration, stripping him of office and triggering fresh elections after months of political turmoil.",
    "link": "https://www.ibtimes.com.au/south-korea-court-ousts-impeached-president-yoon-1857557",
    "timestamp": "2025-04-04T04:42:06Z"
  },
  {
    "title": "Gold declines as Trump tariff shock sparks selloff from record",
    "description": "Gold, typically seen as a safe haven in times of uncertainty, can join pronounced selloffs as investors are forced to raise cash to offset losses in other markets",
    "link": "https://www.bloomberg.com/news/articles/2025-04-04/gold-steadies-after-us-tariff-shock-sparks-selloff-from-record",
    "timestamp": "2025-04-04T04:40:06Z"
  },
  {
    "title": "Trump tariffs live: Asian markets drop further as Trump's tariffs spark fears of global downturn",
    "description": "On Wednesday, the US president announced taxes on goods coming into his country, including 10% on all UK imports.\nHere are the BBC's Henry Zeffman and Anthony Zurcher on how the fallout has unfolded - and what might come next:\nAsian and Australian markets dro…",
    "link": "https://biztoc.com/x/469c5fac13f00ad1",
    "timestamp": "2025-04-04T04:34:27Z"
  },
  {
    "title": "TikTok to find non-Chinese owner Saturday or face US ban",
    "description": "TikTok on Friday was hours from a deadline to find a non-Chinese owner or face a ban in the United States. The hugely popular video-sharing app, which has more than 170 million American users, is under threat from a US law that passed overwhelmingly last year…",
    "link": "https://punchng.com/tiktok-to-find-non-chinese-owner-saturday-or-face-us-ban/",
    "timestamp": "2025-04-04T04:33:52Z"
  },
  {
    "title": "‘Frightening’: US restaurants, producers face tariff whiplash",
    "description": "This week, Trump unveiled a sweeping 10 percent tariff on most US trading partners, set to take effect on Saturday.\nThe post ‘Frightening’: US restaurants, producers face tariff whiplash appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/life/frightening-us-restaurants-producers-face-tariff-whiplash/article",
    "timestamp": "2025-04-04T04:31:55Z"
  },
  {
    "title": "Southeast Asian Governments React to Punitive Trump Tariffs",
    "description": "They are open to negotiations with Washington, but will also seek to diversify their export markets away from the U.S.",
    "link": "https://thediplomat.com/2025/04/southeast-asian-governments-react-to-punitive-trump-tariffs/",
    "timestamp": "2025-04-04T04:27:00Z"
  },
  {
    "title": "Goldman cuts oil price forecasts amid tariff fears, higher OPEC+ supply",
    "description": "\"The risks to our reduced oil price forecast are to the downside, especially for 2026, given growing risks of recession and to a lesser extent of higher OPEC...",
    "link": "https://finance.yahoo.com/news/goldman-cuts-oil-price-forecasts-042602699.html",
    "timestamp": "2025-04-04T04:26:02Z"
  },
  {
    "title": "A day after raising tariffs on China to 54%, Trump says the US now has 'great power to negotiate' with China to force a TikTok sale",
    "description": "Trump said he would be willing to lower tariffs if countries offer him something \"phenomenal,\" like China with a TikTok deal.",
    "link": "https://www.businessinsider.com/trump-tariffs-us-great-power-negotiate-with-china-tiktok-sale-2025-4",
    "timestamp": "2025-04-04T04:25:31Z"
  },
  {
    "title": "Living happily into your 80s: It can be done",
    "description": "What an unhappy country this is, ranking a dismal 55th in this year’s World Happiness Report. Why should it be so? Japan is democratic and at peace, its streets are safe, its cities clean, its countryside intermittently (where not ravaged) beautiful, its peop…",
    "link": "https://japantoday.com/category/features/kuchikomi/living-happily-into-your-80s-it-can-be-done",
    "timestamp": "2025-04-04T04:25:03Z"
  },
  {
    "title": "Unemployment benefits for striking workers being considered in Oregon, Washington",
    "description": "Lawmakers in Oregon and Washington are considering whether striking workers should receive unemployment benefits",
    "link": "https://abcnews.go.com/Business/wireStory/unemployment-benefits-striking-workers-considered-oregon-washington-120477032",
    "timestamp": "2025-04-04T04:22:28Z"
  },
  {
    "title": "How were Trump's new tariffs calculated? It will shock you",
    "description": "Wonder how Trump's new tariffs were calculated? It would be funny if it wasn't so serious.",
    "link": "https://www.abc.net.au/news/2025-04-04/how-were-trumps-tariffs-calculated/105136808",
    "timestamp": "2025-04-04T04:20:44Z"
  },
  {
    "title": "U.S. economy likely created modest 130,000 jobs last month as Trump trade wars lift recession fears",
    "description": "U.S. job growth is slowing, with predictions of only 130,000 jobs added in March and a slight increase in the unemployment rate. The effects of Trump's trade wars and Musk's federal workforce cuts pose risks to the labor market and overall economy.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/u-s-economy-likely-created-modest-130000-jobs-last-month-as-trump-trade-wars-lift-recession-fears/articleshow/119965333.cms",
    "timestamp": "2025-04-04T04:18:13Z"
  },
  {
    "title": "In vino calamitas: How Trump’s tariffs are threatening EU agriculture",
    "description": "Based on facts, either observed and verified directly by the reporter, or reported and verified from knowledgeable sources.\nThe European spirits, wine dairy and olive oil sectors are bracing for a severe blow after US President Donald Trump announced on Wedne…",
    "link": "https://biztoc.com/x/e13d788b6de5944d",
    "timestamp": "2025-04-04T04:12:46Z"
  },
  {
    "title": "Putin, Zelensky ready to make a deal – Trump",
    "description": "Russia and Ukraine are ready to make a deal, US President Donald Trump has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615218-putin-zelensky-deal-trump/",
    "timestamp": "2025-04-04T04:12:44Z"
  },
  {
    "title": "Unemployment benefits for striking workers being considered in Oregon, Washington",
    "description": "SEATTLE (AP) — Lawmakers in Oregon and Washington are considering whether striking workers should receive unemployment benefits, following recent walkouts by Boeing factory workers, hospital nurses and teachers in the Pacific Northwest that highlighted a new …",
    "link": "https://financialpost.com/pmn/unemployment-benefits-for-striking-workers-being-considered-in-oregon-washington",
    "timestamp": "2025-04-04T04:12:31Z"
  },
  {
    "title": "Gold Price Today: Precious metals witness profit booking. Gold falls by Rs 586/10g, silver down Rs 1,500/kg",
    "description": "Investors took profits from precious metals following US President Trump's imposition of reciprocal tariffs. Gold futures fell by 0.65%, and silver saw heavier profit booking, dropping by 1.6%. Market volatility is expected to persist, influenced by the dolla…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-price-today-precious-metals-witness-profit-booking-gold-falls-by-rs-586/10g-silver-down-rs-1500/kg/articleshow/119965214.cms",
    "timestamp": "2025-04-04T04:12:22Z"
  },
  {
    "title": "Four die in Russia drone strikes on Kharkiv",
    "description": "Russian drone strikes killed at least four people and injured more than 30 in the eastern Ukrainian city of Kharkiv, authorities said Friday. Russia and Ukraine have stepped up aerial attacks even as US President Donald Trump pushes them to agree to a ceasefi…",
    "link": "https://punchng.com/four-die-in-russia-drone-strikes-on-kharkiv/",
    "timestamp": "2025-04-04T04:11:27Z"
  },
  {
    "title": "Sensex Declines 509 Points In Early Trade, Day After Trump Tariff Announcement",
    "description": "Indian frontline indices opened in the red on Friday following global sell-off in the equity markets in reaction to the reciprocal tariffs announced by US President Donald Trump.",
    "link": "https://www.ndtv.com/business-news/sensex-declines-509-points-in-early-trade-day-after-trump-tariff-announcement-8083351",
    "timestamp": "2025-04-04T04:09:39Z"
  },
  {
    "title": "Volkswagen plans to add import fee to price of CBU vehicles sold in the US due to Trump’s auto tariffs",
    "description": "According to a report by The New York Times, Volkswagen has informed its dealers in the United States of plans to add an import fee later this month. This will impact the price of imported vehicles sold in the country, although the exact fee would only be det…",
    "link": "https://paultan.org/2025/04/04/volkswagen-plans-to-add-import-fee-to-price-of-imported-vehicles-sold-in-the-us/",
    "timestamp": "2025-04-04T04:08:51Z"
  },
  {
    "title": "Trump’s self-inflicted tariff crisis sparks confusion, chaos and questions of competence | CNN Politics",
    "description": "There are reasons to question whether President Donald Trump fully grasps the consequences of the tariff barrage that he used to fire up a global trade war.",
    "link": "https://www.cnn.com/2025/04/04/politics/trump-tariffs-chaos-competence/index.html",
    "timestamp": "2025-04-04T04:08:43Z"
  },
  {
    "title": "Chief Justice Roberts’ Secret Friendship with Trump Prosecutor Ally Norm Eisen Exposed",
    "description": "Is the Supreme Court Compromised by Deep State Cronyism? In a bombshell revelation that’s sending shockwaves through conservative circles, it turns out Chief Justice John Roberts has been rubbing elbows with none other than Norm Eisen—the radical leftist oper…",
    "link": "https://freerepublic.com/focus/f-news/4308749/posts",
    "timestamp": "2025-04-04T04:07:42Z"
  },
  {
    "title": "Analysis: Trump tariffs may delay, but won't derail, Japan rate hikes",
    "description": "TOKYO : New U.S. tariffs announced by President Donald Trump may delay, but likely won't derail, the Bank of Japan's plan to raise interest rates further as policymakers seek to avoid renewed yen falls that would worsen inflationary pressures. Trump's decisio…",
    "link": "https://www.channelnewsasia.com/business/analysis-trump-tariffs-may-delay-wont-derail-japan-rate-hikes-5044161",
    "timestamp": "2025-04-04T04:07:00Z"
  },
  {
    "title": "What we learned from Radio-Canada's 'Cinq chefs' party leader interviews",
    "description": "French-speaking Canadians got a first taste of how the five main federal party leaders defend their platforms beyond U.S. tariff threats in the span of two hours Thursday night on Radio-Canada's Cinq chefs, une élection program.",
    "link": "https://www.cbc.ca/news/politics/canada-election-cinq-chefs-french-language-party-leaders-interviewed-src-1.7501815",
    "timestamp": "2025-04-04T04:05:40Z"
  },
  {
    "title": "How to Solve the Immigration Crisis",
    "description": "Republicans in Congress need to act now. \nThe post How to Solve the Immigration Crisis appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/how-to-solve-the-immigration-crisis/",
    "timestamp": "2025-04-04T04:05:00Z"
  },
  {
    "title": "How Trump’s Historically High Tariffs will Hurt the US Economy",
    "description": "ByBedassa Tadesse, University of Minnesota Duluth (The Conversation) - President Donald Trump unveiled a sweeping new tariff plan on April 2, 2025, to reshape U.S. trade and boost domestic industry. Framing the announcement as “Liberation Day,” he proposed a …",
    "link": "https://www.juancole.com/2025/04/historically-tariffs-economy.html",
    "timestamp": "2025-04-04T04:04:40Z"
  },
  {
    "title": "This tiny island has been slugged with Trump's tariffs. Its residents don't know why",
    "description": "Locals on tiny Norfolk Island have been left \"scratching their heads\" at the prospect of being slugged with tariffs by US President Donald Trump.",
    "link": "https://www.abc.net.au/news/2025-04-04/norfolk-island-donald-trump-tariffs-confusion/105136688",
    "timestamp": "2025-04-04T04:03:50Z"
  },
  {
    "title": "Panarchy is the Universal Peace Deal",
    "description": "The winds of March are roaring and everywhere you look peace is in the air, or at least that’s the impression you might get from eyeballing the latest headlines. Every other day it seems like another batch of barrel bomb-flipping butchers is getting together …",
    "link": "https://www.counterpunch.org/2025/04/04/panarchy-is-the-universal-peace-deal/",
    "timestamp": "2025-04-04T04:02:57Z"
  },
  {
    "title": "Trump Tariffs A \"National Crisis\": Japan PM Calls For \"Calm-Headed\" Approach",
    "description": "Japanese firms are the biggest investors into the United States, but Trump on Thursday announced a 24% levy on imports from the close Washington ally.",
    "link": "https://www.ndtv.com/world-news/trump-tariffs-a-national-crisis-japan-pm-shigeru-ishiba-calls-for-a-calm-headed-approach-8083329",
    "timestamp": "2025-04-04T04:02:46Z"
  },
  {
    "title": "Trump calls Le Pen case 'witch hunt,' demands her freedom",
    "description": "United States President Donald Trump voiced support for French politician Marine Le Pen, calling her legal troubles an example of political targeting. In a post on his Truth Social platform, the US pr...",
    "link": "https://biztoc.com/x/383ee0582081cc51",
    "timestamp": "2025-04-04T04:01:25Z"
  }
]