[
  {
    "title": "Will Team USA men's hockey players attend the State of the Union?",
    "description": "Which NHL players, if any, will be at the 2026 State of the Union after Donald Trump's invitation?",
    "link": "https://ftw.usatoday.com/story/sports/nhl/2026/02/24/us-mens-hockey-state-of-the-union-trump/88838701007/",
    "timestamp": "2026-02-24T12:54:56Z"
  },
  {
    "title": "Mac mini Production Coming Soon to New Houston, TX Facility",
    "description": "Apple today announced that it will soon be bringing Mac mini production to the US for the first time ever. The popular Mac model will be manufactured in Houston, TX.Read More...",
    "link": "https://www.mactrast.com/2026/02/mac-mini-production-coming-soon-to-new-houston-tx-facility/",
    "timestamp": "2026-02-24T12:53:30Z"
  },
  {
    "title": "Zelenskyy says Putin has ‘not broken’ Ukrainians as he marks 4 years since Russia’s all-out invasion",
    "description": "Zelenskyy said his country has withstood the onslaught by Russia’s bigger and better equipped army.",
    "link": "https://www.bostonherald.com/2026/02/24/ukraine-russia-invasion-anniversary/",
    "timestamp": "2026-02-24T12:47:17Z"
  },
  {
    "title": "Ex-NHL star fires back at Team USA men's hockey critics: 'It's a real shame'",
    "description": "Former NHL star Jeremy Roenick appeared on Fox News Channel's \"Jesse Watters Primetime\" on Monday and lamented the criticism aimed at Team USA men's hockey.",
    "link": "https://www.foxnews.com/sports/ex-nhl-star-fires-back-team-usa-mens-hockey-critics-its-real-shame",
    "timestamp": "2026-02-24T12:46:51Z"
  },
  {
    "title": "The US women’s hockey team declined an invitation to the Trump White House",
    "description": "I seriously still have whiplash from the US men’s hockey team. They went from national darlings, the first American men to win gold in ice hockey in 46 years, to representing the worst of America’s MAGA politics. And it all happened within the span of about t…",
    "link": "https://www.celebitchy.com/963600/the_us_womens_hockey_team_declined_an_invitation_to_the_trump_white_house/",
    "timestamp": "2026-02-24T12:45:53Z"
  },
  {
    "title": "California governor compares himself to black voters because he ‘cannot read’",
    "description": "California governor Gavin Newsom told a predominantly black audience in Atlanta that he was “like them” because he “cannot read” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632968-newsom-black-voters/",
    "timestamp": "2026-02-24T12:45:28Z"
  },
  {
    "title": "Tuesday: Hili dialogue",
    "description": "Welcome to The Cruelest Day: Tuesday, February 24, 2026, and it’s National Tortilla Chip Day. Better with guacamole than with salsa, this comestible, the backbone of nachos, was popularized, if not invented, in America: Ignacio Anaya used triangles of fried t…",
    "link": "https://whyevolutionistrue.com/2026/02/24/tuesday-hili-dialogue-568/",
    "timestamp": "2026-02-24T12:45:23Z"
  },
  {
    "title": "Senators tell CFTC to make clear ban on prediction market contracts involving deaths",
    "description": "A letter to Commodity Futures Trading Commission Chairman Michael Selig cites three Polymarket contracts related to a NASA launch, Venezuela and Ukraine.",
    "link": "https://www.cnbc.com/2026/02/24/senators-polymarket-prediction-markets-cftc-death-war-terror.html",
    "timestamp": "2026-02-24T12:45:01Z"
  },
  {
    "title": "Stablecoin stagnation, tariffs a headwind for Bitcoin prices, analysts say",
    "description": "Tariff shocks led to a capital rotation from crypto into precious metals and tokenized commodities, as analysts warn that the thin crypto market liquidity is limiting a wider recovery.",
    "link": "https://cointelegraph.com/news/stablecoin-supply-falls-crypto-liquidity-headwind-gold-rotation-xaut",
    "timestamp": "2026-02-24T12:45:00Z"
  },
  {
    "title": "How Full Is the USA Strategic Petroleum Reserve?",
    "description": "Just how full is the U.S. Strategic Petroleum Reserve?",
    "link": "https://www.rigzone.com/news/how_full_is_the_usa_strategic_petroleum_reserve-24-feb-2026-183057-article/",
    "timestamp": "2026-02-24T12:43:57Z"
  },
  {
    "title": "Isaac Hayes estate settles lawsuit over Trump campaign’s ‘unpermitted’ use of song",
    "description": "The lawsuit claimed that Team Trump played “Hold On, I’m Coming” over 100 times at various campaign rallies and events without permission.",
    "link": "https://www.wsbtv.com/news/local/isaac-hayes-estate-settles-lawsuit-over-unpermitted-use-song-trump-campaign-rallies/YK6KCOJJIZAZ7JB7V7CXUH5NKU/",
    "timestamp": "2026-02-24T12:43:54Z"
  },
  {
    "title": "Trump threatens ‘very bad day’ for Iran if no deal",
    "description": "US President Donald Trump again threatened Iran with military action unless it agrees to a nuclear deal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632957-trump-iran-bad-day/",
    "timestamp": "2026-02-24T12:43:19Z"
  },
  {
    "title": "Commentary: Shift of Army-Navy to Thanksgiving week a tough swallow",
    "description": "Commentary: Army football coach Jeff Monken open to moving Navy game to Thanksgiving week, but there are many obstacles.",
    "link": "https://www.recordonline.com/story/sports/college/2026/02/24/ken-mcmillan-column-shift-of-army-navy-football-a-tough-swallow/88831420007/",
    "timestamp": "2026-02-24T12:41:15Z"
  },
  {
    "title": "Ahead of State of the Union, Trump's approval falls to new low of 37% (G. Elliott Morris/Strength In Numbers)",
    "description": "G. Elliott Morris / Strength In Numbers:\nAhead of State of the Union, Trump's approval falls to new low of 37%  —  The new Strength In Numbers/Verasight poll finds Democrats leading on the generic ballot by 10 points among registered voters, and Trump approva…",
    "link": "https://www.memeorandum.com/260224/p17",
    "timestamp": "2026-02-24T12:40:02Z"
  },
  {
    "title": "Hong Kong protests after Panama takes control of 2 key ports on the Panama Canal",
    "description": "Hong Kong protests after Panama takes control of two key ports on the Panama Canal once run by a Hong Kong company",
    "link": "https://www.wokv.com/news/business/hong-kong-protests/FNYGBFY25EZX7DBBN5NKC2TVE4/",
    "timestamp": "2026-02-24T12:39:57Z"
  },
  {
    "title": "'Never be red again': Trump region delivers 'ominous warning' to GOP",
    "description": "President Donald Trump's mass deportation agenda is decimating the Rio Grande Valley economy, threatening to flip Republican gains in the region back to Democratic control just a year after the president's historic win in a traditionally blue area, according …",
    "link": "https://www.rawstory.com/trump-texas-immigration/",
    "timestamp": "2026-02-24T12:37:36Z"
  },
  {
    "title": "US Stocks Today | US stock futures steady after Monday's battering; tariffs, AI concerns dominate",
    "description": "U.S. stock index futures edged up on Tuesday, recovering ​slightly after a broad market selloff the previous session as investors grappled with the uncertain impact of President Donald Trump's tariff maneuvers and escalating AI-related concerns.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-stocks-today-us-stock-futures-steady-after-mondays-battering-tariffs-ai-concerns-dominate/articleshow/128751833.cms",
    "timestamp": "2026-02-24T12:37:27Z"
  },
  {
    "title": "Gas-Guzzler Revival Risks Dead-End Future for US Automakers",
    "description": "Big trucks and engines are back among US automakers, even as electrics gain ground around the globe.",
    "link": "https://financialpost.com/pmn/business-pmn/gas-guzzler-revival-risks-dead-end-future-for-us-automakers",
    "timestamp": "2026-02-24T12:35:39Z"
  },
  {
    "title": "Gold price today: Gold rate crashes, Silver down too. Details here",
    "description": "Gold rate: Gold, a ​traditional safe-haven asset, tends to benefit in times of ​geopolitical and economic uncertainty.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-today-gold-rate-crashes-silver-down-too-details-here/articleshow/128751729.cms",
    "timestamp": "2026-02-24T12:34:21Z"
  },
  {
    "title": "World shares are mixed after heavy selling of potential AI losers hits Wall Street",
    "description": "Still, Tuesday brought gains for computer-chip makers that profit from AI development.",
    "link": "https://www.bostonherald.com/2026/02/24/world-shares-stocks-wall-street/",
    "timestamp": "2026-02-24T12:31:47Z"
  },
  {
    "title": "Bullish Signal? Coinbase Bitcoin Premium Turns Positive After Months In Red",
    "description": "Bitcoin flipped a small but notable technical switch this week when the Coinbase premium moved back above zero, ending a run of negative readings that began after heavy selling on February 6. Related Reading: XRP Fell Nearly 70% — Could History Repeat With An…",
    "link": "http://www.newsbtc.com/news/bitcoin/bullish-signal-coinbase-bitcoin-premium-turns-positive-after-months-in-red/",
    "timestamp": "2026-02-24T12:30:14Z"
  },
  {
    "title": "Plans approved for Trump’s ‘nicest ballroom in the country’ at Doonbeg resort",
    "description": "Planning permission for “the nicest ballroom in the country” at Trump International Golf Links and Hotel in Doonbeg has been conditionally granted by Clare County Council (CCC).",
    "link": "https://www.independent.ie/regionals/clare/news/plans-approved-for-trumps-nicest-ballroom-in-the-country-at-doonbeg-resort/a664552222.html",
    "timestamp": "2026-02-24T12:30:09Z"
  },
  {
    "title": "Trump to deliver State of the Union address as voters sour on his economy",
    "description": "Dem Gov. Abigail Spanberger of Virginia will deliver the official rebuttal for Democrats after romping to victory in 2025 on an affordability-focused agenda.",
    "link": "https://www.cnbc.com/2026/02/24/sotu-trump-to-deliver-address-as-voters-sour-on-his-economy.html",
    "timestamp": "2026-02-24T12:30:01Z"
  },
  {
    "title": "Red States Are Doing What Trump Won’t: Going After Abortion Pills in Court",
    "description": "When the US Supreme Court unanimously blocked a lawsuit against the Food and Drug Administration in 2024 over the agency’s regulation of the abortion drug mifepristone, conservatives were disappointed but undeterred. The justices ruled that anti-abortion doct…",
    "link": "https://www.motherjones.com/politics/2026/02/the-next-major-abortion-case-is-hitting-a-louisiana-court/",
    "timestamp": "2026-02-24T12:30:00Z"
  },
  {
    "title": "Red States Are Doing What Trump Won’t: Going After Abortion Pills in Court",
    "description": "When the US Supreme Court unanimously blocked a lawsuit against the Food and Drug Administration in 2024 over the agency’s regulation of the abortion drug mifepristone, conservatives were disappointed but undeterred. The justices ruled that anti-abortion doct…",
    "link": "https://www.motherjones.com/politics/2026/02/the-next-major-abortion-case-is-hitting-louisiana-court/",
    "timestamp": "2026-02-24T12:30:00Z"
  },
  {
    "title": "Hockey Loss Should Awaken Canada To Its Long-Running Anti-American Decline",
    "description": "Canada lost to the United States on the largest stage and in the one domain in which its superiority felt metaphysically guaranteed.",
    "link": "https://thefederalist.com/2026/02/24/hockey-loss-should-awaken-canada-to-its-long-running-anti-american-decline/",
    "timestamp": "2026-02-24T12:28:24Z"
  },
  {
    "title": "Transcript: Trump Seethes at Bad Polls as Even Fox Admits He’s Tanking",
    "description": "The following is a lightly edited transcript of the February 24 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. With Don…",
    "link": "https://newrepublic.com/article/206949/transcript-trump-seethes-bad-polls-even-fox-admits-he-tanking",
    "timestamp": "2026-02-24T12:24:46Z"
  },
  {
    "title": "U.S women's hockey team declines invitation to attend Trump's state of the union address",
    "description": "The U.S. women's hockey gold medal-winning team said it has to decline an invitation from President Donald Trump to attend his state of the union address on Tuesday night.",
    "link": "https://www.cbc.ca/news/world/us-hockey-teams-trump-state-union-invitation-9.7103592",
    "timestamp": "2026-02-24T12:24:05Z"
  },
  {
    "title": "Factbox-From OpenAI to Nvidia, firms channel billions into AI infrastructure as demand booms",
    "description": "Feb 24 (Reuters) - Advanced Micro Devices has agreed to sell up to $60 billion worth of artificial intelligence chips to Meta Platforms over five years in a ...",
    "link": "https://finance.yahoo.com/news/factbox-openai-nvidia-firms-channel-122400217.html",
    "timestamp": "2026-02-24T12:24:00Z"
  },
  {
    "title": "Trump 'just does not care' that GOP is about to get 'clobbered': Axios founder",
    "description": "As Donald Trump prepares to give his State of the Union speech, he will do it under a cloud of record-low approval numbers that he seemingly refuses to acknowledge — and that has Republicans living in fear.But the president doesn’t care, reported Axios's foun…",
    "link": "https://www.rawstory.com/gop-midterm-2675309533/",
    "timestamp": "2026-02-24T12:23:25Z"
  },
  {
    "title": "Trump's tumbling economic numbers and a frustrated Zelenskyy: Morning Rundown",
    "description": "In today’s newsletter: Trump heads into the State of the Union with voters distrustful on the economy.",
    "link": "https://www.nbcnews.com/news/us-news/trumps-tumbling-economic-numbers-frustrated-zelenskyy-morning-rundown-rcna260375",
    "timestamp": "2026-02-24T12:17:44Z"
  },
  {
    "title": "ESPN’s Josh Pate Turns Off Comments And Claims He’s Being Targeted By Bots After President Trump Interview Bombs",
    "description": "ESPN college football personality Josh Pate seems to be taking his interview with President Trump bombing a bit personally, as he has not only turned off comments on the YouTube interview but also claimed that most of the negative feedback are from bots. At t…",
    "link": "https://brobible.com/sports/article/josh-pate-trump-interview-reaction-response/",
    "timestamp": "2026-02-24T12:12:57Z"
  },
  {
    "title": "Trump sticks to celebratory script in state of the union, with one angry detour",
    "description": "U.S. President Donald Trump delivered a state of the union address that by his standards came across as relatively focused and disciplined, giving a preview of how the Republicans may try to campaign to keep control of Congress in this fall's midterms.",
    "link": "https://www.cbc.ca/news/world/trump-state-of-the-union-address-9.7104968",
    "timestamp": "2026-02-24T12:07:34Z"
  },
  {
    "title": "U.S. state of the union: Trump expected to touch on economy, affordability as president's approval dips",
    "description": null,
    "link": "https://www.cbc.ca/news/world/livestory/state-of-the-union-2026-us-president-donald-trump-live-updates-9.7102910",
    "timestamp": "2026-02-24T12:07:34Z"
  },
  {
    "title": "France ups the ante in spat with US ambassador, says ministers will no longer meet him",
    "description": "France’s spat with the U.S. ambassador to Paris has taken another turn with the French foreign minister now saying the top U.S. diplomat in France must explain himself after ignoring a French summons",
    "link": "https://abcnews.com/International/wireStory/france-ups-ante-spat-us-ambassador-ministers-longer-130437367",
    "timestamp": "2026-02-24T12:05:42Z"
  },
  {
    "title": "British politico Peter Mandelson was arrested over his Jeffrey Epstein connections",
    "description": "We’ve spent a lot of time covering the situation with the degenerate formerly known as Prince Andrew, because in many ways, Andrew’s sordid connection to Jeffrey Epstein was what brought everything out in the open. Because people could pick at that Epstein-An…",
    "link": "https://www.celebitchy.com/963578/british_politico_peter_mandelson_was_arrested_over_his_jeffrey_epstein_connections/",
    "timestamp": "2026-02-24T12:05:06Z"
  },
  {
    "title": "Jimmy Kimmel Roasts Trump for Namedropping Him in ‘Money Grab’ Email: ‘What Even Is That?!’",
    "description": "Picking the email apart line-by-line for the entertainment of his audience and viewers, Kimmel roasted the president throughout.\nThe post Jimmy Kimmel Roasts Trump for Namedropping Him in ‘Money Grab’ Email: ‘What Even Is That?!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/jimmy-kimmel-roasts-trump-for-namedropping-him-in-money-grab-email-what-even-is-that/",
    "timestamp": "2026-02-24T12:03:36Z"
  },
  {
    "title": "Everyone that could be conscripted as Zelenskyy claims WW3 has 'already started'",
    "description": "Zelenskyy says we need to look at how to stop Putin",
    "link": "https://www.ladbible.com/news/ww3-conscription-zelenskyy-putin-war-army-992033-20260224",
    "timestamp": "2026-02-24T12:01:59Z"
  },
  {
    "title": "The Giant Mess Behind the Supreme Court’s Tariffs Ruling",
    "description": "Elie Mystal\n\n\n\nThe 6-3 decision was a rare victory, but it was crafted out of conflicts that leave almost nothing certain—including future tariff rulings.\r\n\n\r\n\n\nThe post The Giant Mess Behind the Supreme Court’s Tariffs Ruling appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/supreme-court-tariffs-major-questions/",
    "timestamp": "2026-02-24T12:01:04Z"
  },
  {
    "title": "Where Trump stands in the eyes of Americans ahead of the State of the Union address",
    "description": "Trump's approval ratings remain underwater, at 44% in the latest Fox News Poll, despite his claims of \"highest poll numbers ever\" as he prepares for State of the Union address.",
    "link": "https://www.foxnews.com/politics/where-trump-stands-eyes-americans-ahead-state-union-address",
    "timestamp": "2026-02-24T12:00:57Z"
  },
  {
    "title": "White House Prioritizes Domestic Phosphorus, Glyphosate Production for Food Security",
    "description": "Glyphosate, Food Security, and the Unsettled Science Behind America’s Dinner Table.\nThe post White House Prioritizes Domestic Phosphorus, Glyphosate Production for Food Security first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/02/white-house-prioritizes-domestic-phosphorus-glyphosate-production-for-food-security/",
    "timestamp": "2026-02-24T12:00:41Z"
  },
  {
    "title": "US Women's Hockey > Those Other Scumbags. Tabs, Tues., Feb. 24, 2026",
    "description": "Progressive morning news roundup, with lots of cussing and righteous anger.",
    "link": "https://www.wonkette.com/p/us-womens-hockey-those-other-scumbags",
    "timestamp": "2026-02-24T12:00:33Z"
  },
  {
    "title": "DAVID MARCUS: Patriotic Team USA wins gold as anti-America whiners flop",
    "description": "Patriotic United States hockey players win Olympic gold while other American athletes who criticized the country struggled in Milan Cortina games.",
    "link": "https://www.foxnews.com/opinion/david-marcus-patriotic-team-usa-wins-gold-anti-america-whiners-flop",
    "timestamp": "2026-02-24T12:00:16Z"
  },
  {
    "title": "The ACA health coverage subsidy lapse hit 22 million people. Here are some of their stories",
    "description": "The lapse of enhanced subsidies for Affordable Care Act marketplace insurance has forced families to make difficult financial choices.",
    "link": "https://www.cnbc.com/2026/02/24/aca-enhanced-subsidy-expiration-effects.html",
    "timestamp": "2026-02-24T12:00:01Z"
  },
  {
    "title": "Democrats tap Spanberger and Padilla to respond to State of the Union",
    "description": "Virginia Gov. Abigail Spanberger will deliver Democrats' response on Tuesday following President Trump's State of the Union address.",
    "link": "https://www.npr.org/2026/02/24/nx-s1-5717047/democrats-tap-spanberger-and-padilla-to-respond-to-state-of-the-union",
    "timestamp": "2026-02-24T12:00:00Z"
  },
  {
    "title": "Iran says students must respect 'red lines' after protests",
    "description": "Students have a right to protest but must \"understand the red lines\", Iran's government spokeswoman said yesterday, in the first official reaction to renewed anti-government rallies on campuses.",
    "link": "https://www.hurriyetdailynews.com/iran-says-students-must-respect-red-lines-after-protests-219280",
    "timestamp": "2026-02-24T11:59:22Z"
  },
  {
    "title": "Jon Stewart throws Trump's own words in his face as he 'obliterates' latest threat",
    "description": "Donald Trump's words have come back to haunt him as Jon Stewart ripped into the president for a claim he made last year.The president bragged about Iran's nuclear capabilities being \"totally obliterated\" in June 2025 — but it seems the threat is still very re…",
    "link": "https://www.rawstory.com/trump-iran-2675309309/",
    "timestamp": "2026-02-24T11:56:27Z"
  },
  {
    "title": "Gaza board explores coin plan for Gaza post-war economy",
    "description": "Officials from the U.S.-led Board of Peace, tasked with overseeing Gaza’s postwar reconstruction, are considering launching a cryptocurrency to help revive the territory’s shattered economy, according to the Financial Times.",
    "link": "https://www.hurriyetdailynews.com/gaza-board-explores-coin-plan-for-gaza-post-war-economy-219278",
    "timestamp": "2026-02-24T11:55:53Z"
  },
  {
    "title": "New US tariffs come in at lower 10% rate",
    "description": "The United States imposed a new tariff from Tuesday of 10 percent on all goods not covered by exemptions, the US Customs and Border Protection said, the rate first announced by President Donald Trump on Friday rather than the 15 percent he promised a day late…",
    "link": "https://www.thedailystar.net/business/news/new-us-tariffs-come-lower-10-rate-4113851",
    "timestamp": "2026-02-24T11:54:13Z"
  },
  {
    "title": "U.S. Olympic Hockey Hero Responds To Diss Of Women's Team By Trump, Men's Squad",
    "description": "\"Everything is so political,\" U.S. star Jack Hughes said.",
    "link": "https://www.huffpost.com/entry/jack-hughes-us-womens-hockey-everything-so-political_n_699d7bbfe4b0f7641da68fd6",
    "timestamp": "2026-02-24T11:53:31Z"
  },
  {
    "title": "France steps up its feud with U.S. ambassador Kushner as Trump's diplomats anger Europe",
    "description": "France Ambassador Charles Kushner has been banned from meeting officials after snubbing a meeting over comments about the death of far-right activist Quentin Deranque.",
    "link": "https://www.nbcnews.com/world/europe/france-ambassador-charles-kushner-banned-meeting-officials-summons-rcna260380",
    "timestamp": "2026-02-24T11:53:27Z"
  },
  {
    "title": "Inside the war bunker where Volodymyr Zelenskyy ran Ukraine’s defense in Russia war",
    "description": "Walking through a warren of tunnels under central Kyiv, Ukrainian President Volodymyr Zelensky said it was from this  secure compound that he started marshalling Ukraine's response to Russia's invasion on February 24, 2022. Sitting on a black leather chair in…",
    "link": "https://economictimes.indiatimes.com/news/defence/inside-the-war-bunker-where-volodymyr-zelenskyy-ran-ukraines-defense-in-russia-war/articleshow/128750459.cms",
    "timestamp": "2026-02-24T11:48:28Z"
  },
  {
    "title": "Most Americans say Trump is growing erratic with age, Reuters/Ipsos poll finds (Jason Lange/Reuters)",
    "description": "Jason Lange / Reuters:\nMost Americans say Trump is growing erratic with age, Reuters/Ipsos poll finds  —  Six in ten Americans including a significant slice of Republicans think President Donald Trump has become erratic as he ages, according to a new Reuters/…",
    "link": "https://www.memeorandum.com/260224/p13",
    "timestamp": "2026-02-24T11:45:00Z"
  },
  {
    "title": "FedEx Sues US Government to Recoup Tariff Losses",
    "description": "FedEx has taken legal action over the tariffs recently struck down by the Supreme Court. The shipping giant’s complaint, filed Monday (Feb. 23), is believed to be the first major lawsuit seeking a reimbursement since the court ruled that President Donald Trum…",
    "link": "https://www.pymnts.com/legal/2026/fedex-sues-us-government-to-recoup-tariff-losses/",
    "timestamp": "2026-02-24T11:44:08Z"
  },
  {
    "title": "Flavor Flav offers alternative Olympics celebration for US women’s hockey team after Trump invite snub",
    "description": "In a locker room call to the men’s team, footage of which has circulated on social media, Trump insinuated he would have to invite the women’s team to the State of the Union address out of obligation",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/us-mens-hockey-controversy-flavor-flav-b2926423.html",
    "timestamp": "2026-02-24T11:41:46Z"
  },
  {
    "title": "Donald Trump’s global tariff takes effect at 10%",
    "description": "US president had said he would raise levy to 15%",
    "link": "https://www.irishtimes.com/business/2026/02/24/donald-trumps-global-tariff-takes-effect-at-10/",
    "timestamp": "2026-02-24T11:38:08Z"
  },
  {
    "title": "'It's chaos — we are in limbo': Supreme Court rebuke can’t stop Trump hurting heartland",
    "description": "President Donald Trump’s sweeping tariffs policy brought Ohio farmer Chris Gibbs into the national spotlight in Trump's first term, when he sent a message\r\n asking Trump to consider how his global trade war hurt American agriculture.After Trump returned to th…",
    "link": "https://www.rawstory.com/raw-investigates/trump-tariffs-2675301137/",
    "timestamp": "2026-02-24T11:37:44Z"
  },
  {
    "title": "Jindal's power arm lines up $1 billion loan in boost for slow market",
    "description": "Jindal Power is securing up to $1 billion in offshore loans to fuel its international expansion, a move offering a much-needed boost to India's dollar loan market.  The conglomerate has already finalized a $500 million loan and aims to raise the remaining hal…",
    "link": "https://economictimes.indiatimes.com/industry/energy/power/jindals-power-arm-lines-up-1-billion-loan-in-boost-for-slow-market/articleshow/128749879.cms",
    "timestamp": "2026-02-24T11:36:34Z"
  },
  {
    "title": "Most Americans say Trump is growing erratic with age, Reuters/Ipsos poll finds",
    "description": "WASHINGTON, Feb 24 (Reuters) - Six in ten Americans including a ⁠significant slice of Republicans think President Donald Trump has become erratic as he ages, according to a new Reuters/Ipsos poll. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/24/most-americans-say-trump-is-growing-erratic-with-age-reutersipsos-poll-finds",
    "timestamp": "2026-02-24T11:36:00Z"
  },
  {
    "title": "Apple shifts Mac Mini assembly from Asia to US under Trump-backed ‘Make in America’ plan",
    "description": "Apple will produce the Mac mini in the United States for the first time, expanding its Houston operations as part of a $600 billion domestic investment plan highlighted during Donald Trump’s presidency. The move includes scaling AI server manufacturing and la…",
    "link": "https://economictimes.indiatimes.com/news/international/business/apple-shifts-mac-mini-assembly-from-asia-to-us-under-trump-backed-make-in-america-plan/articleshow/128749939.cms",
    "timestamp": "2026-02-24T11:33:52Z"
  },
  {
    "title": "Agroecology: rethinking global policy efficiency and funding priorities to overcome the blind spot in climate action",
    "description": "Policy frameworks shaping farming in the EU and beyond are suffering from funding misalignment and fragmented priorities, resulting in ineffective global climate efforts.",
    "link": "https://theconversation.com/agroecology-rethinking-global-policy-efficiency-and-funding-priorities-to-overcome-the-blind-spot-in-climate-action-275839",
    "timestamp": "2026-02-24T11:31:38Z"
  },
  {
    "title": "Pam Bondi’s brother keeps on winning. But why?",
    "description": "Lawmakers demanded documents tied to Brad Bondi’s courtroom winning streak. The DOJ has missed the deadline",
    "link": "https://www.salon.com/2026/02/24/pam-bondis-brother-keeps-on-winning-but-why/",
    "timestamp": "2026-02-24T11:30:27Z"
  },
  {
    "title": "Gavin Newsom’s Father Issues",
    "description": "The California governor’s new memoir is dominated by a parent’s emotional distance.",
    "link": "https://www.theatlantic.com/ideas/2026/02/gavin-newsom-memoir/686089/",
    "timestamp": "2026-02-24T11:30:00Z"
  },
  {
    "title": "Iran nears deal with China for advanced missiles",
    "description": "Report says Iran is close to securing CM-302 anti-ship missiles from China, a move analysts warn could threaten US naval forces in the region.",
    "link": "https://www.israelnationalnews.com/news/422910",
    "timestamp": "2026-02-24T11:29:58Z"
  },
  {
    "title": "Donald Trump Snubbed by US Women’s Hockey Team After Olympic Win",
    "description": "Fresh off a historic Olympic victory, the U.S. women’s hockey team is making headlines for more than its performance on the ice. The gold medal–winning athletes have reportedly declined an invitation connected to President Donald Trump’s upcoming State of the…",
    "link": "https://www.realitytea.com/2026/02/24/donald-trump-us-women-hockey-team-reject-invite-olympic-win/",
    "timestamp": "2026-02-24T11:29:38Z"
  },
  {
    "title": "Keith Olbermann ridicules US men's hockey team for wanting to accept Trump's State of Union invite",
    "description": "Ex-ESPN broadcaster Keith Olbermann criticized the men's Olympic hockey team for considering Trump's State of Union invitation after the women's team declined the same offer.",
    "link": "https://www.foxnews.com/sports/keith-olbermann-ridicules-us-mens-hockey-team-wanting-accept-trumps-state-union-invite",
    "timestamp": "2026-02-24T11:27:53Z"
  },
  {
    "title": "Jimmy Kimmel gloats as vacation ends with Trump 'humiliation': 'Whole thing is a mess'",
    "description": "Donald Trump has suffered the biggest loss of his presidency to date, according to talk show host Jimmy Kimmel.The comedian returned to his late-night show after a week-long absence and said that during his vacation, the president suffered one of the most gru…",
    "link": "https://www.rawstory.com/trump-jimmy-kimmel-2675307787/",
    "timestamp": "2026-02-24T11:26:13Z"
  },
  {
    "title": "State of the Union: Trump expected to tout achievements ahead of midterms",
    "description": "The president will make his case to Americans amid growing controversy over his domestic and foreign policies.",
    "link": "https://abcnews.com/Politics/state-union-trump-expected-tout-achievements-ahead-midterms/story?id=130387697",
    "timestamp": "2026-02-24T11:19:45Z"
  },
  {
    "title": "Team USA men's hockey players sing national anthem while partying at famous Miami nightclub",
    "description": "The U.S. men's hockey team was seen singing the national anthem at E11EVEN in Miami as they celebrated their gold medal win at the Olympics.",
    "link": "https://www.foxnews.com/sports/team-usa-mens-hockey-players-sing-national-anthem-while-partying-famous-miami-nightclub",
    "timestamp": "2026-02-24T11:19:10Z"
  },
  {
    "title": "Apple will soon make (some) Mac Minis in the US",
    "description": "Apple is preparing to move some of its Mac Mini production to the US as part of the company's ongoing efforts to appease the Trump administration's push for domestic investment. Manufacturing is set to begin later this year in north Houston, Texas, at a Foxco…",
    "link": "https://www.theverge.com/tech/883581/apple-mac-mini-production-texas-houston",
    "timestamp": "2026-02-24T11:15:37Z"
  },
  {
    "title": "Trump's economic agenda has delivered on some promises, missed on others",
    "description": "Donald Trump’s economic agenda has produced a complicated picture. Output is expanding faster than many analysts projected, with robust GDP numbers. Yet hiring has slowed, wage gains are uneven, and inflation pressures are eroding purchasing power. A recent S…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-economic-agenda-has-delivered-on-some-promises-missed-on-others/articleshow/128749449.cms",
    "timestamp": "2026-02-24T11:15:25Z"
  },
  {
    "title": "Relief from tariffs may not lower prices, businesses warn",
    "description": "Consumers may not see lower prices despite a Supreme Court ruling on tariffs. Businesses absorbed previous costs and are focused on recouping losses. The government must now figure out how to return billions in collected tariffs. New tariffs are also being im…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/relief-from-trumps-us-tariffs-may-not-lower-prices-businesses-warn-estimate-industry-expectation/articleshow/128749256.cms",
    "timestamp": "2026-02-24T11:14:50Z"
  },
  {
    "title": "‘Alpha-male’ influencer Nick Adams dropped as US ambassador to Malaysia, claims he has been promoted",
    "description": "Adams’ nomination by US President Donald Trump last year had sparked controversy due to reportedly misogynistic remarks the right-wing commentator has made, as well as his public support for Israel in 2024.",
    "link": "https://www.channelnewsasia.com/asia/malaysia-nick-adams-dropped-us-ambassador-donald-trump-5949321",
    "timestamp": "2026-02-24T11:13:47Z"
  },
  {
    "title": "Trump Supporter Learns Hard Way ICE Doesn't Just Target 'Worst of the Worst' (Ewan Palmer/The Daily Beast)",
    "description": "Ewan Palmer / The Daily Beast:\nTrump Supporter Learns Hard Way ICE Doesn't Just Target ‘Worst of the Worst’  —  LEOPARDS EATING FACES  —  A New Jersey couple can't believe “we were MAGA” after their immigration ordeal.  —  A Donald Trump supporter is regretti…",
    "link": "https://www.memeorandum.com/260224/p10",
    "timestamp": "2026-02-24T11:10:01Z"
  },
  {
    "title": "Trump's State of the Union speech could be his best chance to sell voters on Iran plans",
    "description": "President Trump addresses the nation tonight. He seeks support for his Iran policy. US forces are building up in the Middle East. Trump aims for a deal on Iran's nuclear program. He warns of consequences if no agreement is reached. This comes as Republicans f…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-state-of-the-union-could-be-his-best-chance-to-sell-voters-on-iran-plans/articleshow/128749174.cms",
    "timestamp": "2026-02-24T11:06:31Z"
  },
  {
    "title": "France demands explanation from US envoy over no-show",
    "description": "France's foreign minister Tuesday demanded an explanation after U.S. envoy Charles Kushner failed to show up to explain comments about a slain far-right activist but said ties between France and the United States would not be affected.",
    "link": "https://www.hurriyetdailynews.com/france-demands-explanation-from-us-envoy-over-no-show-219273",
    "timestamp": "2026-02-24T11:05:57Z"
  },
  {
    "title": "Home Depot beats Wall Street’s expectations, even as sales decline",
    "description": "Home Depot beat fourth-quarter earnings expectations after missing estimates the prior three quarters.",
    "link": "https://www.cnbc.com/2026/02/24/home-depot-hd-q4-2025-earnings-.html",
    "timestamp": "2026-02-24T11:04:08Z"
  },
  {
    "title": "Conservative super PAC drops six-figure ad buy in major move to defend Trump's trifecta",
    "description": "Conservative group Sentinel Action Fund is launching a $650K voter registration campaign set to begin after Trump's State of the Union address to boost Republican turnout.",
    "link": "https://www.foxnews.com/politics/conservative-super-pac-drops-six-figure-ad-buy-major-move-defend-rumps-trifecta",
    "timestamp": "2026-02-24T11:00:46Z"
  },
  {
    "title": "De Niro gets emotional, teary-eyed as he calls on people to 'resist, resist, resist' Trump during interview",
    "description": "Robert De Niro got teary-eyed during MSNBC interview, calls on Americans to \"resist, resist, resist\" Trump's administration and warns of retribution against New York.",
    "link": "https://www.foxnews.com/media/de-niro-gets-emotional-teary-eyed-he-calls-people-resist-resist-resist-trump-during-interview",
    "timestamp": "2026-02-24T11:00:39Z"
  },
  {
    "title": "“It’s Inappropriate”: Melania Trump’s Governors Dinner Outfit Sparks Fierce Backlash",
    "description": "“That outfit is loud and tacky and definitely not black tie…”",
    "link": "https://www.boredpanda.com/inappropriate-melania-trump-governors-dinner-outfit/",
    "timestamp": "2026-02-24T11:00:35Z"
  },
  {
    "title": "EXCLUSIVE: Trump to center SOTU on working families with sweeping economic case",
    "description": "Trump's State of the Union speech comes amid Supreme Court ruling against his tariff policies and voter concerns about cost of living ahead of November's midterm elections.",
    "link": "https://www.foxnews.com/politics/exclusive-trump-center-sotu-working-families-sweeping-economic-case",
    "timestamp": "2026-02-24T11:00:24Z"
  },
  {
    "title": "For A Lot Of Women, ‘Make America Healthy Again’ Has Changed What It Means To Be A Mom",
    "description": "The Make America Healthy Again movement has created a coalition of mothers who believe they're the the sole person responsible for keeping their children healthy and safe.",
    "link": "https://www.huffpost.com/entry/make-america-healthy-again-motherhood_n_699cafefe4b0f7641da60f3e",
    "timestamp": "2026-02-24T11:00:19Z"
  },
  {
    "title": "Trump’s SOTU Mission Is Clear. He Probably Won’t Pull It Off.",
    "description": "Trump’s mission in the 2026 State of the Union Address is clear: He needs to make a coherent midterms affordability pitch. But that means controlling his rage over immigration, the Democrats, and the Supreme Court. Can he pull it off?",
    "link": "http://nymag.com/intelligencer/article/trump-2026-state-of-the-union-preview.html",
    "timestamp": "2026-02-24T11:00:14Z"
  },
  {
    "title": "Ahead of State of the Union, hints of frustration with Trump emerge in House GOP",
    "description": "Some House Republicans have rebuked Mr. Trump on tariffs, war powers and the Epstein files, and defections could grow as the midterms approach.",
    "link": "https://www.cbsnews.com/news/trump-frustration-house-gop-tariffs-epstein-war-powers/",
    "timestamp": "2026-02-24T11:00:10Z"
  },
  {
    "title": "Russia’s war against Ukraine enters fifth year as experts outline 3 possible outcomes",
    "description": "Experts say three scenarios emerge for Ukraine war: prolonged stalemate, Ukrainian momentum reshaping talks or dangerous erosion of Western resolve against Russia.",
    "link": "https://www.foxnews.com/world/russias-war-against-ukraine-enters-fifth-year-experts-outline-3-possible-outcomes",
    "timestamp": "2026-02-24T11:00:08Z"
  },
  {
    "title": "Is USA hockey at the State of the Union? Latest updates on if Olympic gold medalists are at Donald Trump's address",
    "description": "Here are the latest updates on whether or not the gold medal-winning hockey teams are at President Trump's State of the Union address.",
    "link": "https://www.sportingnews.com/us/nhl/news/usa-hockey-state-union-latest-updates-olympic-gold-medalists/455f0eea7f1dae6626625938",
    "timestamp": "2026-02-24T11:00:02Z"
  },
  {
    "title": "What you need to know as Russia's full-scale war on Ukraine enters its 5th year",
    "description": "Russia launched its full-scale invasion of Ukraine four years ago, and the fighting continues. Here's a look at where the war stands today.",
    "link": "https://www.npr.org/2026/02/24/nx-s1-5721139/russia-ukraine-war",
    "timestamp": "2026-02-24T11:00:00Z"
  }
]