[
  {
    "title": "T-Mobile does a 180 after claiming it was committed to core values",
    "description": "T-Mobile has abandoned its DEI programs to get its pending deals approved.",
    "link": "https://www.phonearena.com/news/t-mobile-ends-dei_id172153",
    "timestamp": "2025-07-10T11:41:48Z"
  },
  {
    "title": "Starmer, Macron to announce closer UK-France nuclear weapons coordination",
    "description": "NATO's two European nuclear powers are expected to sign a declaration on closer bilateral nuclear coordination.",
    "link": "https://www.euractiv.com/section/defence/news/starmer-macron-to-announce-closer-uk-france-nuclear-weapons-coordination/",
    "timestamp": "2025-07-10T11:40:21Z"
  },
  {
    "title": "NATO Ally Warns of Iranian Assassination Threat",
    "description": "The UK faces a \"rising\" and unpredictable threat from Iran, according to a new report that highlights an increase in assassination attempts.",
    "link": "https://www.newsweek.com/uk-report-iran-assassination-threat-espionage-2097144",
    "timestamp": "2025-07-10T11:39:55Z"
  },
  {
    "title": "Trump Has No Reason To Compromise With Democrats On Immigration",
    "description": "Inviting Democrats to sit at the immigration-policy table will accomplish nothing and will jeopardize this core issue of the president’s.",
    "link": "https://thefederalist.com/2025/07/10/trump-has-no-reason-to-compromise-with-democrats-on-immigration/",
    "timestamp": "2025-07-10T11:38:32Z"
  },
  {
    "title": "Explosions, Fires Rock Kyiv In Deadly Russian Barrage",
    "description": "Kyiv was shrouded in dark smoke early Thursday after Russia hammered Ukraine's capital with its second large-scale drone and missile barrage in as many nights.",
    "link": "https://www.ibtimes.com.au/explosions-fires-rock-kyiv-deadly-russian-barrage-1859621",
    "timestamp": "2025-07-10T11:36:18Z"
  },
  {
    "title": "The Fate Of The U.S. If The Left Got Control Of The Supreme Court",
    "description": "Currently at the U.S. Supreme Court, the conservatives hold a 6-3 majority. While there are exceptions, most of the politically sensitive cases break along the 6-3 ideological lines. Recent prominent examples of cases breaking in that way include Trump v. CAS…",
    "link": "https://freerepublic.com/focus/f-chat/4327862/posts",
    "timestamp": "2025-07-10T11:36:18Z"
  },
  {
    "title": "RI seeks to expand exports to other markets amid US tariff talks",
    "description": "The Indonesian government is striving to expand export market access for domestic products to other markets amid ongoing negotiations on reciprocal tariffs ...",
    "link": "https://en.antaranews.com/news/365449/ri-seeks-to-expand-exports-to-other-markets-amid-us-tariff-talks",
    "timestamp": "2025-07-10T11:36:15Z"
  },
  {
    "title": "Nippon Steel IT Subsidiary Hit by \"Zero-Day Attack,\" Causing Data Breach",
    "description": "Personal data of Nippon Steel Solutions’ customers, partners and employees may be compromised",
    "link": "https://www.infosecurity-magazine.com/news/nippon-steel-it-subsidiary-0day/",
    "timestamp": "2025-07-10T11:35:00Z"
  },
  {
    "title": "Israeli strike hits near Gaza medical centre as truce talks continue",
    "description": "An Israeli strike near a Gaza medical centre resulted in 16 fatalities, including children. Ceasefire talks between Israel and Hamas continue in Qatar. A senior Israeli official suggests an agreement is unlikely soon. The strike occurred in Deir al-Balah. The…",
    "link": "https://economictimes.indiatimes.com/news/defence/israeli-strike-hits-near-gaza-medical-centre-as-truce-talks-continue/articleshow/122365961.cms",
    "timestamp": "2025-07-10T11:33:39Z"
  },
  {
    "title": "Senate committee advances Trump's CDC pick Susan Monarez",
    "description": "She was formally nominated in March after President Donald Trump withdrew his initial pick, former Rep. David Weldon.",
    "link": "https://www.fox5atlanta.com/news/senate-committee-advances-trumps-cdc-pick-susan-monarez",
    "timestamp": "2025-07-10T11:32:55Z"
  },
  {
    "title": "Donald Trump pushes to restore Washington’s original NFL name, backed by Native American leaders",
    "description": "Donald Trump has stirred controversy by advocating for the Washington Commanders to revert to their former name, “Redskins,” retired in 2020 due to its offensive nature. This sparked widespread debate, intensified by the Native American Guardians Association'…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/donald-trump-pushes-to-restore-washingtons-original-nfl-name-backed-by-native-american-leaders/articleshow/122365625.cms",
    "timestamp": "2025-07-10T11:32:36Z"
  },
  {
    "title": "Samsung may follow Apple in making India a key hub for smartphone exports to the US",
    "description": "Samsung is contemplating expanding its US-bound smartphone production from India due to potential US tariffs, mirroring Apple's strategy. Amidst trade policy uncertainties under President Trump, Samsung is evaluating tariff differentials and considering shift…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/samsung-may-follow-apple-in-making-india-a-key-hub-for-smartphone-exports-to-the-us/articleshow/122365631.cms",
    "timestamp": "2025-07-10T11:32:00Z"
  },
  {
    "title": "Gay grandfather with stage four cancer fined for trans rights protest",
    "description": "A gay grandad with stage four cancer has been fined thousands of dollars for taking part in a trans rights protest.  Known online as “angry gay grandpa”, James Lantz pleaded guilty to criminal mischief and misdemeanour vandalism, on Tuesday (8 July).  The cha…",
    "link": "https://www.thepinknews.com/2025/07/10/gay-grandfather-with-stage-four-cancer-fined-for-trans-rights-protest/",
    "timestamp": "2025-07-10T11:31:09Z"
  },
  {
    "title": "Why did Linda Yaccarino quit as CEO of X?",
    "description": "At 1:51 a.m. Eastern on Wednesday, X owner Elon Musk tweeted, “Never a dull moment on this platform.” You can say that again. Musk tweeted that hours before his hand-picked […]\nThe post Why did Linda Yaccarino quit as CEO of X? appeared first on Poynter.",
    "link": "https://www.poynter.org/commentary/2025/why-did-linda-yaccarino-step-down-as-ceo-of-x-twitter-elon-musk-grok-nazi/",
    "timestamp": "2025-07-10T11:30:38Z"
  },
  {
    "title": "New book reveals what Obama and 'conqueror' Trump chatted about in viral moment during Carter's funeral",
    "description": "President Donald Trump and former President Barack Obama shared a friendly chat about golf during President Jimmy Carter's funeral, creating a viral moment of bipartisanship before Trump's return to office.",
    "link": "https://www.foxnews.com/politics/new-book-reveals-what-obama-conqueror-trump-chatted-about-viral-moment-during-carters-funeral",
    "timestamp": "2025-07-10T11:30:24Z"
  },
  {
    "title": "Ukrainian US ambassador, seen with head in hands during Oval Office meeting, is departing DC",
    "description": "Ukraine announced Ambassador Oksana Markarova's departure Thursday following controversy and calls for her removal by House Speaker Mike Johnson.",
    "link": "https://www.foxnews.com/politics/ukrainian-us-ambassador-seen-head-hands-during-oval-office-meeting-departing-dc",
    "timestamp": "2025-07-10T11:30:15Z"
  },
  {
    "title": "Brazil vows to match US tariffs after Trump threatens 50% levy",
    "description": "Trump's threat is over what he calls the \"mistreatment\" of his ally, ex-President Jair Bolsonaro.",
    "link": "https://www.bbc.com/news/articles/c62dvyv60z7o",
    "timestamp": "2025-07-10T11:30:07Z"
  },
  {
    "title": "Syria’s Long Road to Recovery",
    "description": "Western sanctions on Syria are being lifted, but the damage they inflicted on the country's healthcare infrastructure is long-term.",
    "link": "https://inthesetimes.com/article/syria-sanction-hts-sharaa-trump-healthcare-gaza-middle-east-assad",
    "timestamp": "2025-07-10T11:30:00Z"
  },
  {
    "title": "Trump wants Japan to import U.S. rice to cut trade deficit but consumers hate it—American rice ‘tastes awful. It lacks stickiness’",
    "description": "Donald Trump’s insistence that “spoiled” Japan imports more US rice is adding to Prime Minister Shigeru Ishiba’s problems ahead of elections that could sink his premiership after less than a year in office.\nJapan is one of more than 20 countries receiving let…",
    "link": "https://biztoc.com/x/e30f08e9210b9202",
    "timestamp": "2025-07-10T11:27:26Z"
  },
  {
    "title": "Business Brief: Trading milk, chocolate and TACOs",
    "description": "Suddenly, tacos are back on the menu. The latest fronts this week in U.S. President Donald Trump’s crusade against trade barely garnered a yawn from markets. Are investors right to bet that on the worst of his trade threats, “Trump Always Chickens Out”? We’ll…",
    "link": "https://biztoc.com/x/6b9636882685ff08",
    "timestamp": "2025-07-10T11:27:04Z"
  },
  {
    "title": "The SEC opened the ‘floodgates’ for crypto ETFs, experts say, marking a new era for the industry",
    "description": "Experts tell Fortune they expect more ETFs tied crypto products like Solana, Ripple’s XRP, and potentially even Trump’s memecoin, to launch",
    "link": "https://fortune.com/crypto/2025/07/10/sec-atkins-trump-gensler-etf-crypto-investing-business/",
    "timestamp": "2025-07-10T11:27:00Z"
  },
  {
    "title": "Canada Sees US Asylum Claim Surge as Both Nations Harden Borders",
    "description": "A growing number of migrants in the US are heading north to seek asylum, even as Canada adopts increasingly restrictive immigration policies of its own.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-sees-us-asylum-claim-surge-as-both-nations-harden-borders",
    "timestamp": "2025-07-10T11:26:28Z"
  },
  {
    "title": "Irish manufacturing soared in the spring amid Trump’s tariffs threat",
    "description": "Domestic production in manufacturing industries was up 34pc between the months of February and April, as factories pumped out products for export in advance of US president Donald Trump’s threatened tariffs.",
    "link": "https://www.independent.ie/irish-news/irish-manufacturing-soared-in-the-spring-amid-trumps-tariffs-threat/a604744768.html",
    "timestamp": "2025-07-10T11:25:18Z"
  },
  {
    "title": "From Texas to Covid, Trump Washes His Hands of Deaths on His Watch",
    "description": "U.S. President Donald Trump may not be very good at running things, but when it comes to shifting blame, he is truly world class. As the magnitude of the disaster in Texas becomes clearer, the one thing we can be certain of is that Trump will accept none of t…",
    "link": "https://cepr.net/publications/trumpian-excuses-on-deaths-in-texas/",
    "timestamp": "2025-07-10T11:25:03Z"
  },
  {
    "title": "Trump Hits Brazil With 50% Tariffs Over 'Witch Hunt' of Bolsonaro",
    "description": "President Donald Trump is announcing a 50% tariff on imports from Brazil starting August 1, citing the ongoing prosecution of one of his longtime allies, Brazil’s former president Jair Bolsonaro, calling it a \"witch hunt.\" It’s the first time the President ha…",
    "link": "https://www.today.com/video/trump-slaps-50-tariffs-on-brazil-over-bolsonaro-prosecution-242988613682",
    "timestamp": "2025-07-10T11:24:12Z"
  },
  {
    "title": "Russia unleashes drones, missiles on Ukraine in second massive air strike in two days",
    "description": "Nineteen people were wounded, and damage was reported in nearly every district of Kyiv in the attack.",
    "link": "https://nypost.com/2025/07/10/world-news/russia-unleashes-drones-missiles-on-ukraine-in-second-massive-air-strike-in-two-days/",
    "timestamp": "2025-07-10T11:23:59Z"
  },
  {
    "title": "\"If you still thought America was one of the world’s good guys ...\"",
    "description": "From the international trade and fiscal moron who brought you Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she’s no longer 'HOT?' ...President da Silva — an actual president of an actual democracy — was somewhat less than intimidated. He annou…",
    "link": "https://www.pmcarpenter.com/post/if-you-still-thought-america-was-one-of-the-world-s-good-guys",
    "timestamp": "2025-07-10T11:23:52Z"
  },
  {
    "title": "Missouri Attorney General Says These AI Chatbots Aren't Being Nice Enough To Trump",
    "description": "Andrew Bailey took issue with how the AI platforms ranked the president on \"a straightforward historical question.\"",
    "link": "https://www.huffpost.com/entry/andrew-bailey-ai-chatbots-arent-nice-to-trump_n_686f8300e4b0d01c494cae60",
    "timestamp": "2025-07-10T11:22:56Z"
  },
  {
    "title": "Grok had a chaotic few days — and now Elon Musk says he's adding the AI to Teslas",
    "description": "xAI removed numerous Grok posts on Tuesday after the chatbot praised Adolf Hitler and made antisemitic jokes. Now Musk says it's coming to Teslas.",
    "link": "https://www.businessinsider.com/grok-tesla-vehicles-elon-musk-2025-7",
    "timestamp": "2025-07-10T11:19:59Z"
  },
  {
    "title": "Elon Musk defends Grok after chatbot's antisemitic rants branding itself 'MechaHitler'",
    "description": "The xAI chatbot posted a string of offensive, antisemitic posts on X, and now Elon Musk has spoken out",
    "link": "https://www.ladbible.com/news/technology/elon-musk-defends-grok-antisemitic-rants-x-152303-20250710",
    "timestamp": "2025-07-10T11:19:30Z"
  },
  {
    "title": "Trump Won't Enforce the TikTok Ban. Is That Constitutional?",
    "description": "The U.S. Constitution requires the president to \"take Care that the Laws be faithfully executed.\" Yet President Donald Trump has not only refused to enforce the federal law banning TikTok, but his administration has also told multiple tech companies that they…",
    "link": "https://biztoc.com/x/d5e4e2ae5b88f415",
    "timestamp": "2025-07-10T11:16:29Z"
  },
  {
    "title": "The One Big Beautiful Bill will have ballot box repercussions (Letters)",
    "description": "\"Rep. Gabe Evan's commercial states that his vote is for Colorado families. Evans is giving them crumbs, however. He voted to give the rich loaves.\" -- James Maki, Dacono",
    "link": "https://www.denverpost.com/2025/07/10/the-one-big-beautiful-bill-voters-congress/",
    "timestamp": "2025-07-10T11:15:41Z"
  },
  {
    "title": "Trump wants Japan to import U.S. rice to cut trade deficit but consumers hate it—American rice ‘tastes awful. It lacks stickiness’",
    "description": "Rice, though, is small fry in the grand scheme of bilateral business between the countries. BMI Fitch Solutions said that it accounts for only 0.37% of U.S. exports to Japan.",
    "link": "https://fortune.com/asia/2025/07/10/trump-japan-import-us-rice-trade-deficit-consumers-hate-tastes-awful-lacks-stickiness/",
    "timestamp": "2025-07-10T11:12:07Z"
  },
  {
    "title": "'Trust is being lost': MAGA feeling 'gaslit' by Trump's attorney general",
    "description": "The furor over the Jeffrey Epstein case doesn't appear likely to blow over with the MAGA base anytime soon.Donald Trump's conspiracy-minded base was blindsided this week by the Justice Department memo stating the notorious sex trafficker had killed himself in…",
    "link": "https://www.rawstory.com/pam-bondi-epstein-case-trust/",
    "timestamp": "2025-07-10T11:12:07Z"
  },
  {
    "title": "Who is Benjamin Song? Hunt Launched For US Veteran After ICE 'Ambush'",
    "description": "Authorities are searching for Song in connection with an attack outside a U.S. Immigrations and Customs Enforcement detention facility in Texas on July 4.",
    "link": "https://www.newsweek.com/benjamin-song-hung-veteran-ice-ambush-2097033",
    "timestamp": "2025-07-10T11:11:47Z"
  },
  {
    "title": "Trump plans 50% tariff on Brazil and 'Superman' immigrant comment criticized: Morning Rundown",
    "description": "Donald Trump said he plans to impose a 50% tariff on imports from Brazil.",
    "link": "https://www.nbcnews.com/news/us-news/trump-tariff-brazil-superman-immigrant-criticism-morning-rundown-rcna217921",
    "timestamp": "2025-07-10T11:08:37Z"
  },
  {
    "title": "Joe Rogan Met Trump for Private Dinner – Just Days Before Ripping ‘Insane’ ICE Raids",
    "description": "Rogan met Trump for a private dinner just days before publicly rebuking the president’s “insane” immigration raids on migrant workers.\nThe post Joe Rogan Met Trump for Private Dinner – Just Days Before Ripping ‘Insane’ ICE Raids first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/joe-rogan-met-trump-for-private-dinner-just-days-before-ripping-insane-ice-raids/",
    "timestamp": "2025-07-10T11:07:34Z"
  },
  {
    "title": "CNBC Daily Open: AI is drawing investors' attention away from fresh tariffs",
    "description": "Just this morning Singapore time, U.S. President Donald Trump said that the 50% tariff on copper imports, which he announced earlier on Tuesday, will begin on Aug. 1.\nOn Wednesday, Trump posted a fresh slate of tariff letters on goods from at least seven more…",
    "link": "https://biztoc.com/x/03df8011ce9b9cc8",
    "timestamp": "2025-07-10T11:05:26Z"
  },
  {
    "title": "Hitting Back at Trump Threat, Lula Says Brazil 'Will Not Accept Any Form of Tutelage'",
    "description": "Brazilian President Luiz Inácio Lula da Silva responded defiantly on Wednesday to U.S. President Donald Trump's threat to impose a 50% tariff on products from the South American nation, a move that Lula said would be reciprocated.\"Brazil is a sovereign nation…",
    "link": "https://www.commondreams.org/news/lula-trump-tariff",
    "timestamp": "2025-07-10T11:05:07Z"
  },
  {
    "title": "Trump quietly claimed a power even King George wasn’t allowed to have",
    "description": "Protesters display an effigy of Donald Trump wearing a crown during a rally in Los Angeles on June 14, 2025. | David Pashaee/Middle East Images/AFP via Getty Images \nJust before the July Fourth holiday, we learned that President Donald Trump secretly claimed …",
    "link": "https://biztoc.com/x/f3ba4c919772de65",
    "timestamp": "2025-07-10T11:05:04Z"
  },
  {
    "title": "Jake Tapper: Trump Is Playing Public For Fools Over Epstein",
    "description": "CNN’s Jake Tapper has accused the Trump administration of playing the public for fools by closing the case on Jeffrey Epstein. Via the Daily Beast:\n\n“This isn’t going to go away,” Tapper warned on his weekday show Tuesday, just hours after President Donald Tr…",
    "link": "https://crooksandliars.com/2025/07/jake-tapper-trump-playing-public-fools",
    "timestamp": "2025-07-10T11:03:09Z"
  },
  {
    "title": "DOGE Boys Now Quizzed Over Whether They Are Loyal To Trump Or Musk",
    "description": "Loyalty tests are a staple in the Trump administration, where employees must vow fealty to the president. Now that Musk and Donald have been publicly feuding, it's becoming more bizarre with each passing day. The bromance is over between the White House and M…",
    "link": "https://crooksandliars.com/2025/07/doge-boys-now-quizzed-over-whether-they",
    "timestamp": "2025-07-10T11:02:02Z"
  },
  {
    "title": "Supreme Court blocks Florida Immigration Law: What it means and will the state keep fighting it?",
    "description": "Florida Attorney General James Uthmeier, who is spearheading the state's defense of the immigration law, had requested both the 11th U.S. Circuit Court of Appeals and the Supreme Court to permit enforcement of the measure while the appeal is underway.",
    "link": "https://economictimes.indiatimes.com/news/international/us/supreme-court-blocks-florida-immigration-law-what-it-means-and-will-the-state-keep-fighting-it/articleshow/122365123.cms",
    "timestamp": "2025-07-10T11:00:42Z"
  },
  {
    "title": "Who Wants to Have Sex?",
    "description": "Sarah Jones reviews ‘The Second Coming,’ by Carter Sherman, and argues that the sexual habits of our youngest adults reflect a complicated sexual reality.",
    "link": "http://nymag.com/intelligencer/article/why-is-gen-z-having-less-sex-than-millennials.html",
    "timestamp": "2025-07-10T11:00:35Z"
  },
  {
    "title": "STEVE MOORE: Trump just scored the biggest conservative victory in three decades",
    "description": "The 'big, beautiful' tax bill includes provisions for expanding opportunity zones, taxing university endowments, and could grow the economy at over 3%",
    "link": "https://www.foxnews.com/opinion/steve-moore-trump-just-scored-biggest-conservative-victory-three-decades",
    "timestamp": "2025-07-10T11:00:32Z"
  },
  {
    "title": "If You See This Word On A Man's Dating Profile... Run",
    "description": "Some women feel \"catfished\" by people who aren't up-front about their politics on the apps.",
    "link": "https://www.huffpost.com/entry/men-lying-dating-apps-politics-moderate_l_686c108fe4b0082b3c90c945",
    "timestamp": "2025-07-10T11:00:17Z"
  },
  {
    "title": "Rubio Meets Russia's Lavrov At ASEAN Talks",
    "description": "US Secretary of State Marco Rubio met with his Russian counterpart in Malaysia on Thursday, bringing the war in Ukraine to the sidelines of ASEAN talks focused on Washington's tariff drive.",
    "link": "https://www.ibtimes.com/rubio-meets-russias-lavrov-asean-talks-3778115",
    "timestamp": "2025-07-10T11:00:10Z"
  },
  {
    "title": "Bearing Witness in Black and White—Sebastião Salgado's Photos Against Environmental and Human Injustice | Opinion",
    "description": "The mourning of Sebastião Salgado's passing in Brazil and around the world is a testament to the power and necessity of his life's work. His legacy is to expose, provoke, and bear witness through art, to the realities of a troubled, yet beautiful, world.",
    "link": "https://www.newsweek.com/bearing-witness-black-whitesebastiao-salgados-photos-against-environmental-human-injustice-2096752",
    "timestamp": "2025-07-10T11:00:02Z"
  },
  {
    "title": "Trump's 'big beautiful bill' cuts food stamps for millions — the average family may lose $146 per month, report finds",
    "description": "A new law includes the largest-ever cuts to Supplemental Nutrition Assistance Program benefits. Here's how much that may reduce what families can spend on food.",
    "link": "https://www.cnbc.com/2025/07/10/trumps-big-beautiful-bill-cuts-snap-for-millions-of-families.html",
    "timestamp": "2025-07-10T11:00:01Z"
  },
  {
    "title": "Will Pete Hegseth’s ‘War on Woke’ Sideline Women?",
    "description": "Donald Trump’s Pentagon chief moderated his stance to get the job but is now pushing for change in the name of high standards.",
    "link": "https://www.theatlantic.com/national-security/archive/2025/07/pete-hegseth-women-combat-troops/683454/",
    "timestamp": "2025-07-10T11:00:00Z"
  },
  {
    "title": "Major Real Estate Investment Firms Face Accusations with Criminal Implications",
    "description": "U.S. Developer Vows Vigorous Litigation & Project CompletionClick for Assets  MIAMI, July  10, 2025  (GLOBE NEWSWIRE) -- Two well-known U.S. real......",
    "link": "https://www.globenewswire.com/news-release/2025/07/10/3113124/0/en/Major-Real-Estate-Investment-Firms-Face-Accusations-with-Criminal-Implications.html",
    "timestamp": "2025-07-10T11:00:00Z"
  },
  {
    "title": "Trump's Tariffs Explained as the Biggest Deadline Gets Delayed Several Weeks",
    "description": "The pause on the biggest of Trump's tariffs won't pass this week, as planned, but the problems they present still loom large.",
    "link": "https://www.cnet.com/personal-finance/trumps-tariffs-explained-as-the-biggest-deadline-gets-delayed-several-weeks/",
    "timestamp": "2025-07-10T11:00:00Z"
  },
  {
    "title": "Social Security & The Big Beautiful Bill",
    "description": "Despite hype, Social Security taxes remain unchanged. The new law adds a temporary Senior Bonus Deduction, offering limited relief for middle-income seniors.",
    "link": "https://www.forbes.com/sites/tomhager/2025/07/10/social-security--the-big-beautiful-bill/",
    "timestamp": "2025-07-10T11:00:00Z"
  },
  {
    "title": "TikTok Working on Standalone App for American Users",
    "description": "TikTok’s standalone U.S. app will reportedly use a separate algorithm and data system. [contact-form-7] That’s according to a report Wednesday (July 9) by Reuters, citing sources familiar with the matter. These moves, the sources say, set the stage for a pote…",
    "link": "http://www.pymnts.com/news/international/2025/tiktok-working-on-standalone-app-for-american-users/",
    "timestamp": "2025-07-10T10:58:26Z"
  },
  {
    "title": "Hamas Says Israeli Troops Sticking Point In Truce Talks As Gaza Pounded",
    "description": "Hamas on Thursday said it opposes any ceasefire deal that includes a large Israeli military presence in Gaza, after offering to release some hostages and as the civil defence reported scores of civilians killed across the Palestinian territory.",
    "link": "https://www.ibtimes.com/hamas-says-israeli-troops-sticking-point-truce-talks-gaza-pounded-3778112",
    "timestamp": "2025-07-10T10:57:22Z"
  },
  {
    "title": "Ukraine Hit With Deadly Attack As Allies Meet On Recovery",
    "description": "Ukraine’s allies gathering in Rome to discuss the nation’s postwar revival will be forced to grapple with the reality that such a prospect is more remote than ever as Russia unleashed its latest deadly air strike on Kyiv.Two people were killed and 16 wounded …",
    "link": "https://www.ndtvprofit.com/world/ukraine-hit-with-deadly-attack-as-allies-meet-on-recovery",
    "timestamp": "2025-07-10T10:55:35Z"
  },
  {
    "title": "Links 7/10/2025",
    "description": "Our ethereal daily links, including Trump unleashes more tariffs while morphing into a Russia hawk again, Epstein under the rug, and earth spinning faster.",
    "link": "https://www.nakedcapitalism.com/2025/07/links-7-10-2025.html",
    "timestamp": "2025-07-10T10:55:09Z"
  },
  {
    "title": "Secret Service Suspends 6 Agents Over Trump Assassination Attempt in Butler, PA: ‘Operational Failure’",
    "description": "The Secret Service suspended six agents without pay in a move acknowledging critical security failures during last year’s assassination attempt on Trump.\nThe post Secret Service Suspends 6 Agents Over Trump Assassination Attempt in Butler, PA: ‘Operational Fa…",
    "link": "https://www.mediaite.com/media/news/secret-service-suspends-6-agents-over-trump-assassination-attempt-in-butler-pa-operational-failure/",
    "timestamp": "2025-07-10T10:50:58Z"
  },
  {
    "title": "Trump asks Liberian president where he learnt English – it’s Liberia’s official language",
    "description": "President Donald Trump praised his Liberian counterpart for his “beautiful English”, during a meeting at the White House on Wednesday (9 July) – seemingly, and very awkwardly, totally unaware that it’s Liberia’s official language. The US president was hosting…",
    "link": "https://www.thepinknews.com/2025/07/10/trump-liberia-president-joseph-boakai-white-house/",
    "timestamp": "2025-07-10T10:50:10Z"
  },
  {
    "title": "Trump is threatening tariffs on BRICS. What’s got him so worried?",
    "description": "As US President Donald Trump wages a trade war across the globe, a new target has come into his line of fire: the BRICS group of emerging major economies.",
    "link": "https://www.cnn.com/2025/07/10/business/brics-tariff-threat-trump",
    "timestamp": "2025-07-10T10:48:21Z"
  },
  {
    "title": "$4 trillion: Nvidia breaks market value record",
    "description": "The silicon valley chip maker briefly reached a record-breaking $4 trillion valuation. Nvidia has seen a consistent rise over the past 2 years, as enthusiam in AI increases. Shortly after the stock market opened on Wednesday morning, Nvidia’s stock price surg…",
    "link": "https://www.dw.com/en/4-trillion-nvidia-breaks-market-value-record/a-73222540",
    "timestamp": "2025-07-10T10:48:00Z"
  },
  {
    "title": "Nvidia breaks market value record of $4 trillion",
    "description": "The silicon valley chip maker briefly topped a record-breaking $4 trillion valuation. Nvidia has seen a consistent rise over the past two years, as enthusiasm for AI-powered tech continues.",
    "link": "https://www.dw.com/en/nvidia-breaks-market-value-record-of-4-trillion/a-73222540",
    "timestamp": "2025-07-10T10:48:00Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "A new U.N. AIDS agency report says the sudden withdrawal of U.S. funding has caused a “systemic shock” to the global effort against AIDS and HIV",
    "link": "https://abcnews.go.com/Business/wireStory/us-funding-hiv-programs-replaced-millions-die-2029-123636206",
    "timestamp": "2025-07-10T10:46:17Z"
  },
  {
    "title": "FEMA’s acting director is MIA — and the media hasn’t even noticed",
    "description": "After the deadly Texas floods, few seem to be questioning Kristi Noem’s apparent takeover of the agency",
    "link": "https://www.salon.com/2025/07/10/femas-acting-director-is-mia-and-the-media-hasnt-even-noticed/",
    "timestamp": "2025-07-10T10:45:22Z"
  },
  {
    "title": "Trump’s tariffs will only accelerate de-dollarization – Kenyan politician",
    "description": "Booker Omole argues that Trump’s proposed tariffs on BRICS nations will only strengthen alternative financial systems Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/621286-trump-tariffs-will-accelerate-de-dollarization/",
    "timestamp": "2025-07-10T10:44:13Z"
  },
  {
    "title": "Iran's Defense Chief Delivers Harsh Warning",
    "description": "With no breakthrough in the resumption of diplomatic talks, tensions between Iran and Israel, backed by the U.S., are growing",
    "link": "https://www.newsweek.com/irans-defense-chief-delivers-harsh-warning-2097105",
    "timestamp": "2025-07-10T10:43:57Z"
  },
  {
    "title": "Trump threatens Brazil with 50% tariff",
    "description": "US President Donald Trump said Brazil would be subject to a 50% tariff, after accusing the country of mistreating former President Jair Bolsonaro.\nTrump has said that Bolsonaro — who is facing a trial over an alleged coup attempt — was the subject of a witch …",
    "link": "https://biztoc.com/x/1c0a000a22683a36",
    "timestamp": "2025-07-10T10:43:17Z"
  },
  {
    "title": "I've run a political party. Elon Musk is not someone you want in that job",
    "description": "Elon Musk listens as President Donald Trump speaks during a news conference in the Oval Office of the White House, Friday, May 30, 2025, in Washington.",
    "link": "https://biztoc.com/x/d77d025af3c72dfd",
    "timestamp": "2025-07-10T10:43:09Z"
  },
  {
    "title": "Donald Trump Scores Major Win Over T-Mobile",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nT-Mobile has announced it is the latest company to scrap its Diversity, Equity and Inclusion (DEI) programs as it seeks regulatory approval from the Federal Communications Commission (FCC) for two new business…",
    "link": "https://biztoc.com/x/aeb63e1fe0f364d7",
    "timestamp": "2025-07-10T10:42:56Z"
  },
  {
    "title": "Trump’s 50% tariffs on copper: Beijing speaks of an “arbitrary” decision that serves no one",
    "description": "\"We have also always believed that the arbitrary imposition of customs duties does not serve the interests of any party,\" a Chinese Foreign Ministry spokesman said.\nThe post Trump’s 50% tariffs on copper: Beijing speaks of an “arbitrary” decision that serves …",
    "link": "https://en.protothema.gr/2025/07/10/trumps-50-tariffs-on-copper-beijing-speaks-of-an-arbitrary-decision-that-serves-no-one/",
    "timestamp": "2025-07-10T10:42:54Z"
  },
  {
    "title": "Why Pam Bondi can’t deliver what MAGA demands",
    "description": "Attorney General Pam Bondi, left, listens to President Donald Trump during a cabinet meeting at the White House, on July 8, 2025.",
    "link": "https://biztoc.com/x/42323dd15089c720",
    "timestamp": "2025-07-10T10:42:49Z"
  },
  {
    "title": "US tariffs: 25% rate not final, says PM after meeting Rubio",
    "description": "KUALA LUMPUR: The 25% tariff rate on Malaysia is not final and there is still one month to negotiate for lower rates with the United States, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/07/10/us-tariffs-25-rate-not-final-says-pm-after-meeting-rubio",
    "timestamp": "2025-07-10T10:40:00Z"
  },
  {
    "title": "Mexico barred from sending cattle to U.S. after some test positive for the flesh-eating New World screwworm",
    "description": "Mexico exported just over one million head of cattle to the United States in 2024, according to official estimates.",
    "link": "https://fortune.com/2025/07/10/mexico-barred-sending-cattle-us-test-positive-flesh-eating-new-world-screwworm/",
    "timestamp": "2025-07-10T10:39:20Z"
  },
  {
    "title": "Trump’s Talk With Senegal’s President Took A Weird Turn. Then Trump Made It Even Weirder.",
    "description": "The cringeworthy exchange went viral on social media.",
    "link": "https://www.huffpost.com/entry/donald-trump-senegal-president_n_686f8db0e4b0d01c494cb608",
    "timestamp": "2025-07-10T10:38:17Z"
  },
  {
    "title": "Europe Court Says S.African Athlete's Trial Wasn't Fair In Gender Testing Case",
    "description": "A top European court Thursday said a Swiss court did not give double Olympic champion Caster Semenya a fair trial in a much-awaited appeals ruling over contested gender testing.",
    "link": "https://www.ibtimes.com.au/europe-court-says-safrican-athletes-trial-wasnt-fair-gender-testing-case-1859618",
    "timestamp": "2025-07-10T10:36:14Z"
  },
  {
    "title": "Medicaid cuts will pummel NY jobs and health care. The Bronx could take the biggest hit.",
    "description": "Medicaid cuts will pummel NY jobs and health care. The Bronx could take the biggest hit.gothamist.com",
    "link": "https://gothamist.com/news/medicaid-cuts-will-pummel-ny-jobs-and-health-care-the-bronx-could-take-the-biggest-hit",
    "timestamp": "2025-07-10T10:35:32Z"
  },
  {
    "title": "Donald Trump Scores Major Win Over T-Mobile",
    "description": "T-Mobile has announced it is ending diversity schemes in a move the Federal Communications Commission chair calls a \"good step.\"",
    "link": "https://www.newsweek.com/donald-trump-scores-major-win-over-t-mobile-2097082",
    "timestamp": "2025-07-10T10:35:06Z"
  },
  {
    "title": "Bill Nye says Texas flood death and destruction compounded by ignoring climate crisis",
    "description": "Bill Nye claims climate change has worsened Texas flooding disasters, arguing that the U.S. government needs to take climate change more seriously.",
    "link": "https://www.foxnews.com/media/bill-nye-says-texas-flood-death-destruction-compounded-ignoring-climate-crisis",
    "timestamp": "2025-07-10T10:30:27Z"
  },
  {
    "title": "‘Flood insurance is not just for coastal or high-risk areas,’ expert says: What homeowners need to know",
    "description": "Homeowners insurance policies typically do not cover flash floods like those in Texas and North Carolina. Here’s what to know about flood insurance.",
    "link": "https://www.cnbc.com/2025/07/10/what-to-know-about-flash-floods-and-homeowners-insurance.html",
    "timestamp": "2025-07-10T10:30:01Z"
  },
  {
    "title": "‘Masterful inactivity’ reigned at Fed’s latest meeting—but notes reveal more officials are coming around to Donald Trump’s way of thinking",
    "description": "Fed officials are increasingly split on rate cuts, though UBS's Paul Donovan says their indecision currently amounts to little more than “masterful inactivity.”",
    "link": "https://fortune.com/2025/07/10/fomc-rate-cut-masterful-inactivity-ubs-deutsche-meeting-notes/",
    "timestamp": "2025-07-10T10:29:37Z"
  },
  {
    "title": "Everything Trump said in leaked audio tapes as Russia responds to 'bomb the s**t' out of Moscow’ threat",
    "description": "Leaked audio tapes revealed that Donald Trump said he told Putin he would 'bomb the s**t out of Moscow', and he's said much more than that",
    "link": "https://www.ladbible.com/news/us-news/trump-leaked-audio-bomb-moscow-russia-018644-20250710",
    "timestamp": "2025-07-10T10:29:36Z"
  },
  {
    "title": "Trump and Congress Make Big Shift on Ukraine",
    "description": "“After half a year of White House skepticism toward Kyiv and friendliness toward Moscow, President Donald Trump and top Republicans have shifted course, with the White House preparing to send additional weaponry to Ukraine and",
    "link": "https://politicalwire.com/2025/07/10/trump-and-congress-make-big-shift-on-ukraine/",
    "timestamp": "2025-07-10T10:28:38Z"
  },
  {
    "title": "U.S. sanctions U.N. expert critical of Israel's war in Gaza",
    "description": "The United States said it was imposing sanctions on Francesca Albanese, the U.N.'s special rapporteur who has been very critical of Israel’s war in Gaza.",
    "link": "https://www.nbcnews.com/world/middle-east/us-sanctions-un-expert-critical-israel-war-gaza-francesca-albanese-rcna217927",
    "timestamp": "2025-07-10T10:26:17Z"
  },
  {
    "title": "Trump Admin Sues California Over Soaring Egg Prices",
    "description": "The lawsuit said California's animal cruelty laws created \"unnecessary red tape\" in egg production, bringing up prices in the U.S.",
    "link": "https://www.newsweek.com/trump-admin-sues-california-over-soaring-egg-prices-2097051",
    "timestamp": "2025-07-10T10:24:39Z"
  },
  {
    "title": "WATCH: Stephen Miller’s Camera Battery Dies in the Middle of ICE Tirade on Fox News",
    "description": "Miller was abruptly cut off mid-rant when his remote camera died as he excitedly talked about new funding that would boost deportations.\nThe post WATCH: Stephen Miller’s Camera Battery Dies in the Middle of ICE Tirade on Fox News first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/watch-stephen-millers-camera-battery-dies-in-the-middle-of-ice-tirade-on-fox-news/",
    "timestamp": "2025-07-10T10:24:24Z"
  },
  {
    "title": "Kremlin says the Ukraine peace process has not stalled",
    "description": "MOSCOW (Reuters) -The Kremlin said on Thursday that Russia did not think peace talks on Ukraine have stalled despite Donald Trump's remarks about Russian President Vladimir Putin and Washington's resumption of some weapons to Ukraine. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/10/kremlin-says-the-ukraine-peace-process-has-not-stalled",
    "timestamp": "2025-07-10T10:23:00Z"
  },
  {
    "title": "Hamas agrees to release 10 hostages as part of Gaza ceasefire talks",
    "description": "Hamas said it would release 10 hostages held in Gaza in a bid reach a ceasefire deal to end 21 months of war in the Palestinian enclave.",
    "link": "https://www.nbcnews.com/world/middle-east/israel-gaza-ceasefire-hamas-hostage-release-trump-netanyahu-rcna217922",
    "timestamp": "2025-07-10T10:19:12Z"
  },
  {
    "title": "US sanctions UN expert critical of Israel's war in Gaza",
    "description": "The United States has said it is imposing sanctions on Francesca Albanese, the United Nations' special rapporteur on human rights in the occupied Palestinian territories, who has been very critical of US ally Israel's war in Gaza.",
    "link": "https://www.rte.ie/news/world/2025/0710/1522837-francesca-albanese/",
    "timestamp": "2025-07-10T10:17:53Z"
  },
  {
    "title": "Virginia’s AG race heats up with GOP's ‘Soft Jay Jones’ campaign",
    "description": "The campaign, paid for by the Virginia GOP and authorized by Republican Attorney General Jason Miyares, portrays Democrat Jay Jones as soft on crime.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_5504e332-eae2-4c53-9997-4b7644d1844d.html",
    "timestamp": "2025-07-10T10:15:00Z"
  },
  {
    "title": "Hundreds gather at high school stadium to honor the many lost to Texas deadly floods",
    "description": "Several hundred people have gathered for a worship ceremony at a high school stadium in Texas",
    "link": "https://abcnews.go.com/US/wireStory/hundreds-gather-high-school-stadium-honor-lost-texas-123633540",
    "timestamp": "2025-07-10T10:14:21Z"
  },
  {
    "title": "What Happened to Democrats' Patriotism? | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\n\"And I'm proud to be an American,\" goes the refrain of Lee Greenwood's \"God Bless the USA,\" an intensely patriotic song the country singer has frequently performed at political rallies and campaign events for …",
    "link": "https://biztoc.com/x/f81fa12146696277",
    "timestamp": "2025-07-10T10:09:39Z"
  },
  {
    "title": "Canada must match the tax incentives in Trump’s ‘Big Beautiful Bill’",
    "description": "Jeff Baryshnik is the president of Republic Funds, a private equity firm.\nOn the Fourth of July, U.S. President Donald Trump signed into law the One Big Beautiful Bill (OBBB). Observers have focused on its impact on the U.S. fiscal situation and its potential…",
    "link": "https://biztoc.com/x/cdebe22d448f29a1",
    "timestamp": "2025-07-10T10:09:35Z"
  },
  {
    "title": "Video showing MAGA fans clicking selfies outside 'Alligator Alcatraz' goes viral with 1.5 million views",
    "description": "A video has surfaced online which shows a MAGA supporters at Florida's 'Alligator Alcatraz' clicking selfies. The video was widely shared on TikTok and has managed to garner around 1.5 million views. US President Donald Trump last week toured the detention ce…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-video-showing-maga-fans-clicking-selfies-outside-alligator-alcatraz-goes-viral-with-1-5-million-views/articleshow/122363677.cms",
    "timestamp": "2025-07-10T10:08:44Z"
  },
  {
    "title": "Sean Duffy Appointed Interim NASA Administrator",
    "description": "“Let’s launch” Says Enthusiastic Secretary Of Transportation President Donald Trump appointed U.S. Secretary of Transportation Sean P. Duffy to take the reins as interim administrator of NASA in a move Trump said reflects the rising priority of space in natio…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=0FA3FEFD-D9BD-46DB-8AA5-C39B23E730F9",
    "timestamp": "2025-07-10T10:05:00Z"
  },
  {
    "title": "Trump’s 50% levy on Brazil shows world nothing is off limits",
    "description": "Donald Trump threatened Brazil with a 50% tariff, demanding the country drop charges against former President Jair Bolsonaro. This unprecedented move, using trade policy for political interference, drew strong condemnation from Brazil's President Lula, who vo…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trumps-50-levy-on-brazil-shows-world-nothing-is-off-limits/articleshow/122363652.cms",
    "timestamp": "2025-07-10T10:04:13Z"
  }
]