[
  {
    "title": "Trump visits police, military carrying out Washington crime crackdown",
    "description": "President Donald Trump declared his crime crackdown in the nation's capital a success on Thursday as he visited federal officers deployed under his plan, which has drawn resident complaints that its tactics are too heavyhanded. Trump visited the U.S. Park Pol…",
    "link": "https://japantoday.com/category/world/trump-visits-police-military-carrying-out-washington-crime-crackdown",
    "timestamp": "2025-08-22T00:55:26Z"
  },
  {
    "title": "Dem Rep. Dean: 'We Struggle with Crime' in Philadelphia, 'Extremely Frightening' Trump Might Deploy Guard Here",
    "description": "On Thursday’s broadcast of MSNBC’s “The Weeknight,” Rep. Madeleine Dean (D-PA) stated that in Philadelphia, “We struggle with crime. We struggle with gun violence.” But “it is extremely frightening” that President Donald Trump might use the National Guard lik…",
    "link": "https://www.breitbart.com/clips/2025/08/21/dem-rep-dean-we-struggle-with-crime-in-philadelphia-extremely-frightening-trump-might-deploy-guard-here/",
    "timestamp": "2025-08-22T00:55:19Z"
  },
  {
    "title": "“TOTAL VICTORY”: Trump’s $500M fine overturned as fraud case continues",
    "description": "The penalty was found to be \"excessive\" by a New York appeals court.",
    "link": "https://www.salon.com/2025/08/21/total-victory-trumps-500m-fine-overturned-as-fraud-case-continues/",
    "timestamp": "2025-08-22T00:52:42Z"
  },
  {
    "title": "Rice price inflation eases in Japan",
    "description": "TOKYO: Rice prices in Japan soared 90.7 per cent in July year-on-year, official data showed on Friday (Aug 22), but the rate of increase slowed from previous month,s offering some relief for Prime Minister Shigeru Ishiba. Overall, Japan's core inflation rate …",
    "link": "https://www.channelnewsasia.com/east-asia/rice-price-core-inflation-japan-5308126",
    "timestamp": "2025-08-22T00:50:56Z"
  },
  {
    "title": "James Dobson’s harsh, disciplinarian Christianity changed GOP politics",
    "description": "James Dobson, a founder of Focus on the Family and a Republican Party kingmaker, was one of the last of a generation who launched the Religious Right in the 1970s.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/religious-right-james-dobson-dead-at-89-rcna226322",
    "timestamp": "2025-08-22T00:46:15Z"
  },
  {
    "title": "Federal Judge Rules Alina Habba Unlawfully Serving as Acting U.S. Attorney of New Jersey",
    "description": "A federal judge ruled on Thursday that Alina Habba has been unlawfully serving as acting U.S. Attorney of New Jersey at the appointment of President Donald Trump.\nThe post Federal Judge Rules Alina Habba Unlawfully Serving as Acting U.S. Attorney of New Jerse…",
    "link": "https://www.breitbart.com/politics/2025/08/21/federal-judge-rules-alina-habba-unlawfully-serving-acting-u-s-attorney-new-jersey/",
    "timestamp": "2025-08-22T00:41:10Z"
  },
  {
    "title": "US to review all visa holders, stop truck driver visas",
    "description": "The Trump administration says it will vet millions of US visa holders for deportable offenses and halt truck driver visas. The moves are the latest in Trump's crackdown on immigration. The US State Department said on Thursday that it will continuously vet mor…",
    "link": "https://www.dw.com/en/us-to-review-all-visa-holders-stop-truck-driver-visas/a-73726131",
    "timestamp": "2025-08-22T00:40:00Z"
  },
  {
    "title": "Rubio pauses worker visas for truck drivers after deadly Florida crash involving illegal immigrant kills 3",
    "description": "Secretary of State Marco Rubio is pausing worker visas for commercial drivers following a deadly Florida Turnpike accident involving an illegal immigrant.",
    "link": "https://www.foxnews.com/politics/rubio-pauses-worker-visas-truck-drivers-deadly-florida-turnpike-crash-kills-three",
    "timestamp": "2025-08-22T00:39:22Z"
  },
  {
    "title": "Ex-Paramount chief feared CBS interview of 'drowsy' Biden would be exposed in Trump lawsuit: report",
    "description": "Former Paramount executive Shari Redstone was concerned President Donald Trump's team would seize on unaired footage of a 2023 \"60 Minutes\" interview with then-President Joe Biden, as she explained why the company settled Trump's lawsuit against CBS News. Red…",
    "link": "https://freerepublic.com/focus/f-news/4335992/posts",
    "timestamp": "2025-08-22T00:32:33Z"
  },
  {
    "title": "'This rarely happens': Fox host admits Trump tariffs driving up prices at massive retailer",
    "description": "One show on President Donald Trump's favorite cable news network is now suggesting one of the administration's signature policies is hitting Americans in the pocket.During a Thursday afternoon segment on Fox Business' \"Claman Countdown,\" guest host Cheryl Cas…",
    "link": "https://www.rawstory.com/trump-tariffs-2673909537/",
    "timestamp": "2025-08-22T00:32:16Z"
  },
  {
    "title": "Putin demands Ukraine give up Donbas, not join NATO and no Western troops: sources",
    "description": "Ukrainian President Volodymyr Zelenskyy has repeatedly dismissed the idea of withdrawing from internationally recognized Ukrainian land as part of a deal.",
    "link": "https://www.japantimes.co.jp/news/2025/08/22/world/politics/putin-ukraine-demands/",
    "timestamp": "2025-08-22T00:32:00Z"
  },
  {
    "title": "Trump Likens Himself to Richard Nixon in Social Media Post",
    "description": "Nixon, of course, is the only president in U.S. history to resign the office.\nThe post Trump Likens Himself to Richard Nixon in Social Media Post first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-likens-himself-to-richard-nixon-in-social-media-post/",
    "timestamp": "2025-08-22T00:30:10Z"
  },
  {
    "title": "China’s move will skew the global copper market",
    "description": "The waiving of treatment and refining charges by China will put Indian smelters at a severe disadvantage",
    "link": "https://www.thehindubusinessline.com/opinion/chinas-move-will-skew-the-global-copper-market/article69961356.ece",
    "timestamp": "2025-08-22T00:30:00Z"
  },
  {
    "title": "Feature: Putin Is Trump’s Medicine",
    "description": "European leaders often portray Russian President Vladimir Putin as a tyrant, a land grabber, and a modern-day Russian bear. And following the outbreak of the Russia-Ukraine War three years ago, the deadliest in Europe since World War II, Putin has gone from b…",
    "link": "https://thechronicle.com.gh/feature-putin-is-trumps-medicine/",
    "timestamp": "2025-08-22T00:24:49Z"
  },
  {
    "title": "Supreme Court allows Trump to cut NIH research funding",
    "description": "The Supreme Court is allowing the Trump administration to slash hundreds of millions of dollars' worth of research funding in its push to cut federal diversity, equity and inclusion efforts.",
    "link": "https://www.wpbf.com/article/supreme-court-trump-nih-research-funding-cuts/65865192",
    "timestamp": "2025-08-22T00:24:34Z"
  },
  {
    "title": "War for Ukraine Day 1,274: If This Is What a Peace Process Looks Like, Ukraine Is Better Off at War",
    "description": "(Image by NEIVANMADE) Here’s the butcher’s bill from Russia’s attack last night: 574 drones. 40 missiles. Last night, russia carried out another combined missile and drone attack on Ukraine, hitting Lviv, Zakarpattia, Dnipro, Khmelnytskyi, Volyn, Cherkasy and…",
    "link": "https://balloon-juice.com/2025/08/21/war-for-ukraine-day-1274-if-this-is-what-a-peace-process-looks-like-ukraine-is-better-off-at-war/",
    "timestamp": "2025-08-22T00:20:10Z"
  },
  {
    "title": "Report: China Meeting Its Massive Oil Demand with Illicit Shipments from Russia, Iran, Venezuela",
    "description": "The Financial Times (FT) on Wednesday published a report co-authored with a research group called C4ADS about a complex global network that is moving huge amounts of oil from Russia, Iran, and Venezuela to China in defiance of sanctions.\nThe post Report: Chin…",
    "link": "https://www.breitbart.com/economy/2025/08/21/report-china-meeting-massive-oil-demand-illicit-shipments-russia-iran-venezuela/",
    "timestamp": "2025-08-22T00:20:06Z"
  },
  {
    "title": "Crypto Gaming Handheld Shipments Delayed Over 'Excessive' Import Duties",
    "description": "Buyers of the SuiPlay0X1 gaming handheld are being slapped with unexpected import duties, some as high as nearly $350 per device.",
    "link": "https://decrypt.co/336347/crypto-gaming-handheld-shipments-delayed-excessive-import-duties",
    "timestamp": "2025-08-22T00:16:35Z"
  },
  {
    "title": "'Total Victory': Court tosses $500 million judgment against Trump",
    "description": "New York appeals court voids the $500 million judgment against Trump in civil fraud case, calling it an \"excessive fine.\" Trump says the ruling is a “total victory”.",
    "link": "https://www.israelnationalnews.com/news/413675",
    "timestamp": "2025-08-22T00:15:07Z"
  },
  {
    "title": "Ukraine kills civilians with US-made rockets – governor",
    "description": "Ukraine has carried out strikes on Russia’s Yenakievo, killing two people and injuring 21 Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/623391-ukraine-shells-yenakievo-himars/",
    "timestamp": "2025-08-22T00:13:38Z"
  },
  {
    "title": "Newsom Calls ICE “A Private Army For Donald Trump”",
    "description": "In a livestreamed ceremony to sign California’s so-called Election Rigging Response Act, Governor Gavin Newson sought the lay out the rationale behind the bill, which calls for a Special Election on November 4 to give Californians a vote on redistricting to c…",
    "link": "http://deadline.com/2025/08/trump-ice-private-army-newsom-1236494870/",
    "timestamp": "2025-08-22T00:07:33Z"
  },
  {
    "title": "The president lasted less than an hour handing out fast food to cops after teasing he would patrol the streets of D.C. Thursday night.",
    "description": "Donald Trump teased he would patrol the streets of D.C. with police on Thursday night but ended up dropping off fast food at a law enforcement facility where...",
    "link": "https://www.thedailybeast.com/trump-does-doordash-for-cops-in-bizarre-patrol-dc-stunt/",
    "timestamp": "2025-08-22T00:04:46Z"
  },
  {
    "title": "Newsom Sends Redistricting Proposal To California Voters To Counter GOP’s Texas Redistricting",
    "description": "If approved by voters, the California redistricting could nullify five new U.S. House seats Republicans are expected to gain from a new redistricting map in Texas.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/08/21/newsom-sends-redistricting-proposal-to-california-voters-to-counter-gops-texas-redistricting/",
    "timestamp": "2025-08-22T00:03:28Z"
  },
  {
    "title": "Is Venezuela the Next Target of the US Empire?",
    "description": "President Donald Trump has deployed several warships and thousands of Marines to the southern Caribbean – just miles off the coast of Venezuela. The provocative mission was launched under the guise of an anti-narcotics crusade, but risks disastrous outcomes f…",
    "link": "https://original.antiwar.com/will_porter/2025/08/21/is-venezuela-the-next-target-of-the-us-empire/",
    "timestamp": "2025-08-22T00:00:46Z"
  },
  {
    "title": "Giving Ukraine a US Security Guarantee Risks National Suicide",
    "description": "Too much of the talk about the recent Alaska summit meeting between President Donald Trump and Russian President Vladimir Putin focuses on the wrong issue.  The key question is not whether an eventual peace accord ending the fighting in Ukraine will require K…",
    "link": "https://original.antiwar.com/ted_galen_carpenter/2025/08/21/giving-ukraine-a-us-security-guarantee-risks-national-suicide/",
    "timestamp": "2025-08-22T00:00:24Z"
  },
  {
    "title": "Rock star melts down after White House calls him 'washed-up,' rages that Trump is a 'low-life fascist'",
    "description": "Jack White and the Trump administration continued to exchange insults this week after the former White Stripes singer called out the White House decor and the administration responded.",
    "link": "https://www.foxnews.com/media/rock-star-melts-down-after-white-house-calls-him-washed-up-rages-trump-low-life-fascist",
    "timestamp": "2025-08-22T00:00:11Z"
  },
  {
    "title": "Letter From DC: Goodbye to John Wall, Hello to Celebrating His Rebel Spirit",
    "description": "Activism\n \n \n / \n August 22, 2025\n \r\n\n \nLetter From DC: Goodbye to John Wall, Hello to Celebrating His Rebel Spirit\r\n\n\n\nThe former Washington Wizards point guard retires from the NBA, but the anti-Trump protests embody his swaggy defiance.\r\n\n\n\r\n\n \n \n Dave Zir…",
    "link": "https://www.thenation.com/article/society/john-wall-washington-dc-trump-protests/",
    "timestamp": "2025-08-22T00:00:00Z"
  },
  {
    "title": "Victor Davis Hanson: Donald Trump Sets Europe Straight",
    "description": "Hoover Institution fellow Victor Davis Hanson talks about the summit involving Trump, Zelensky, and European leaders, the implications of US foreign policy, the perception of American leadership, race and crime in America.",
    "link": "https://www.hoover.org/research/victor-davis-hanson-donald-trump-sets-europe-straight-0",
    "timestamp": "2025-08-22T00:00:00Z"
  },
  {
    "title": "Trump administration not eyeing equity in companies that are increasing US investment, WSJ reports",
    "description": "The Trump administration is considering taking equity stakes in companies receiving funds from the 2022 CHIPS Act but has no plans to seek shares in bigger semiconductor firms that are increasing their U.S. investments, the Wall Street Journal reported on Thu…",
    "link": "https://www.channelnewsasia.com/business/trump-administration-not-eyeing-equity-companies-are-increasing-us-investment-wsj-reports-5308086",
    "timestamp": "2025-08-21T23:58:25Z"
  },
  {
    "title": "Trump administration is not eyeing equity in TSMC, Micron, official says",
    "description": "WASHINGTON :The Trump administration is considering taking equity stakes in companies getting funds from the 2022 CHIPS Act but has no similar plans for bigger firms boosting U.S. investments, such as TSMC and Micron, a White House official told Reuters.The o…",
    "link": "https://www.channelnewsasia.com/business/trump-administration-not-eyeing-equity-tsmc-micron-official-says-5308086",
    "timestamp": "2025-08-21T23:58:25Z"
  },
  {
    "title": "Trump administration not eyeing equity in companies that are increasing US investment, WSJ reports",
    "description": "The development follows comments made by U.S. Commerce Secretary Howard Lutnick, who on Tuesday said the government is continuing to work on the possibility ...",
    "link": "https://finance.yahoo.com/news/trump-administration-not-eyeing-equity-235825056.html",
    "timestamp": "2025-08-21T23:58:25Z"
  },
  {
    "title": "The House Is on Fire and Democrats Are Debating Paint Colors | Opinion",
    "description": "The house is on fire, and Democratic leadership is debating what color to paint the kitchen. Either grab a hose or get out of the way because if we lose this fight, there won't be a democracy left to save.",
    "link": "https://www.newsweek.com/house-fire-democrats-are-debating-paint-colors-opinion-2117415",
    "timestamp": "2025-08-21T23:57:48Z"
  },
  {
    "title": "Trump Treats Police, National Guard to Dinner While Thanking Them for D.C. Crime Cleanup",
    "description": "President Donald Trump brought pizza and hamburgers for members of law enforcement and the National Guard on Thursday and thanked them for their efforts in cracking down on crime in Washington, DC.\nThe post Trump Treats Police, National Guard to Dinner While …",
    "link": "https://www.breitbart.com/politics/2025/08/21/trump-treats-police-national-guard-to-dinner-while-thanking-them-for-d-c-crime-cleanup/",
    "timestamp": "2025-08-21T23:56:39Z"
  },
  {
    "title": "Trump visits police, troops deployed in US capital",
    "description": "President Donald Trump visited police and troops Thursday that he has deployed in the US capital in what he calls a crackdown on crime, saying they were...",
    "link": "https://www.yahoo.com/news/articles/trump-plans-patrol-streets-us-182403364.html",
    "timestamp": "2025-08-21T23:45:08Z"
  },
  {
    "title": "Japan core inflation dips to lowest since March as rice price shock shows signs of fading",
    "description": "The figure — which strips out costs for fresh food — was higher than the 3% expected by economists polled by Reuters.",
    "link": "https://www.cnbc.com/2025/08/22/japan-core-inflation-dips-to-lowest-since-march-as-rice-prices-cool-toyko-cpi-food-energy.html",
    "timestamp": "2025-08-21T23:43:45Z"
  },
  {
    "title": "Report: Israel and Syria to sign security agreement on September 25",
    "description": "According to Arab reports, Israel and Syria are expected to sign a security agreement under US auspices on September 25, without a comprehensive peace deal.",
    "link": "https://www.israelnationalnews.com/news/413674",
    "timestamp": "2025-08-21T23:43:21Z"
  },
  {
    "title": "Workday’s stock falls on disappointing guidance and persistent concerns over AI threat",
    "description": "Workday Inc.’s stock was under pressure in late trading today after the company issued guidance for the current quarter in-line with expectations, eroding whatever optimism was generated by its solid second-quarter earnings results. The company reported a pro…",
    "link": "https://siliconangle.com/2025/08/21/workdays-stock-falls-disappointing-guidance-persistent-concerns-ai-threat/",
    "timestamp": "2025-08-21T23:42:00Z"
  },
  {
    "title": "Mobster's son reveals why Trump caves in big moments: 'He would cry like a little girl'",
    "description": "President Donald Trump seems to have a habit of giving in to people who stand up to him, according to a new report. The Daily Beast spoke with Michael Cody, the son of a late mob-linked union boss in New York named John Cody, about what Trump was like when he…",
    "link": "https://www.rawstory.com/trump-2673909413/",
    "timestamp": "2025-08-21T23:41:08Z"
  },
  {
    "title": "Russians Bomb American-Owned Factory In Major Missile Barrage",
    "description": "Russia unleashed one of its largest aerial strikes of the year against Ukraine overnight, the Ukrainian Air Force said.",
    "link": "https://dailycaller.com/2025/08/21/russians-aerial-strikes-ukraine-volodymyr-zelenskyy-mukachevo/",
    "timestamp": "2025-08-21T23:40:00Z"
  },
  {
    "title": "Podcaster Gavin Newsom Imitates Joe Biden: Says He'll Punch 'Sons of Bitches' Trump, Republicans 'In the Mouth'",
    "description": "Podcaster Gavin Newsom, who is also the Governor of California, did his best Joe Biden imitation Wednesday in threatening to punch \"sons of bitches\" President Donald Trump and the Republicans \"in the mouth.\"\nThe post Podcaster Gavin Newsom Imitates Joe Biden:…",
    "link": "https://www.breitbart.com/politics/2025/08/21/trump-gavin-newsom-punch-violence-mouth/",
    "timestamp": "2025-08-21T23:39:20Z"
  },
  {
    "title": "Gavin Newsom Redistricting Campaign Raises $6.2 Million as Plan Moves to Special Election",
    "description": "The California governor signed the plan Thursday after state lawmakers approved new maps for the state ahead of the Nov. 4 vote\nThe post Gavin Newsom Redistricting Campaign Raises $6.2 Million as Plan Moves to Special Election appeared first on TheWrap.",
    "link": "https://www.thewrap.com/gavin-newsom-california-redistricting-donations-special-election/",
    "timestamp": "2025-08-21T23:37:16Z"
  },
  {
    "title": "Trump caught Democrats in a trap — torn by their Medicaid lies",
    "description": "By suing to stop President Trump from sharing Medicaid data with ICE, Dems practically confessed: Illegal aliens ARE getting Medicaid benefits, and blue states want to keep it that way.",
    "link": "https://nypost.com/2025/08/21/opinion/trump-caught-democrats-in-a-trap-torn-by-medicaid-lies/",
    "timestamp": "2025-08-21T23:32:36Z"
  },
  {
    "title": "Trump Stages Appearance With Troops And Police To Tout DC Crime Crackdown",
    "description": "It was unclear if and when he'd patrol the city's streets like he previously announced.",
    "link": "https://www.huffpost.com/entry/trump-police-national-guard-washington-dc_n_68a79089e4b0c791dbaafc53?utm_campaign=yahoo-recirc",
    "timestamp": "2025-08-21T23:30:57Z"
  },
  {
    "title": "Trump Stages Appearance With Troops And Police To Tout DC Crime Crackdown",
    "description": "It was unclear if and when he'd patrol the city's streets like he previously announced.",
    "link": "https://www.huffpost.com/entry/trump-police-national-guard-washington-dc_n_68a79089e4b0c791dbaafc53",
    "timestamp": "2025-08-21T23:30:57Z"
  },
  {
    "title": "Stellantis unveils new Jeep Cherokee as brand tries to shake off sales declines",
    "description": "Jeep and Stellantis unveiled a new Jeep Cherokee on Thursday in a bid to reinvigorate the company's sales.",
    "link": "https://www.cnbc.com/2025/08/21/stellantis-2026-jeep-cherokee-suv-hybrid.html",
    "timestamp": "2025-08-21T23:30:01Z"
  },
  {
    "title": "Judge rules Trump lawyer Alina Habba is unlawfully serving as US attorney",
    "description": "The Trump administration has ignored a July decision from a panel of judges replacing Habba as interim US attorney.",
    "link": "https://www.aljazeera.com/news/2025/8/21/judge-rules-trump-lawyer-alina-habba-is-unlawfully-serving-as-us-attorney",
    "timestamp": "2025-08-21T23:28:38Z"
  },
  {
    "title": "California Gov. Newsom signs bill calling special election on redrawn congressional map",
    "description": "It's a response to Texas Republicans’ push to adopt a new congressional map favoring the GOP at the urging of President Donald Trump.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_7d0fa33a-3ced-52b4-a078-41a43635abb0.html",
    "timestamp": "2025-08-21T23:28:00Z"
  },
  {
    "title": "Trump's 'Plan' To Rig Elections Sure Is Dumb",
    "description": "President Donald Trump on Monday fired off a batshit Truth Social post in which he promised to sign an executive order that he claims will force states to get rid of both mail-in voting and electronic voting machines.\n\"Remember, the States are merely an ‘agen…",
    "link": "https://crooksandliars.com/2025/08/trumps-plan-rig-elections-sure-dumb",
    "timestamp": "2025-08-21T23:23:33Z"
  },
  {
    "title": "It's The Republican Corruption, Part Infinity",
    "description": "Congressman Rob Bresnahan, a Republican who campaigned on banning stock trading by lawmakers only to make at least 626 stock trades since taking office in January, was under scrutiny Monday for a particular sale he made just before he voted for the largest Me…",
    "link": "https://crooksandliars.com/2025/08/its-republican-corruption-part-infinity",
    "timestamp": "2025-08-21T23:23:33Z"
  },
  {
    "title": "Trump goes on $100 million bond-buying spree: Here’s what it could signal about future interest rates",
    "description": "President Donald Trump has reportedly put $100 million into bonds since taking office in January, through a mixed bet on the debt of both big companies like Meta and Home Depot as well as municipal governments and public entities. The move is notable because …",
    "link": "https://biztoc.com/x/615e26a8e225a20b",
    "timestamp": "2025-08-21T23:21:29Z"
  },
  {
    "title": "'All Eyes On Gaza City' as Israel Ramps Up Campaign of Conquest and Ethnic Cleansing",
    "description": "Operation Gideon's Chariots 2—Israel's plan to conquer, occupy, and ethnically cleanse Gaza—intensified Thursday, with fugitive Prime Minister Benjamin Netanyahu saying Israeli forces will take over all of the embattled strip even if Hamas agrees to a ceasefi…",
    "link": "https://www.commondreams.org/news/netanyahu-approves-gaza-city-conquest",
    "timestamp": "2025-08-21T23:20:24Z"
  },
  {
    "title": "'It’s a lie!' Small-business owner breaks down over Trump tariffs",
    "description": "A Minnesota small-business owner was brought to tears Thursday afternoon on CNN, talking about the effect Donald Trump's tariffs have had on her olive oil and vinegar shop.Sarah Piepenburg, owner of Vinaigrette in Minneapolis, joined \"The Lead\" with fill-in a…",
    "link": "https://www.rawstory.com/trump-tariffs-2673909426/",
    "timestamp": "2025-08-21T23:15:56Z"
  },
  {
    "title": "Trump Says Federal Police Deployment in DC to Last 'a While'",
    "description": "President Donald Trump visited a Park Police operations facility to thank federal law enforcement officers he's deployed to patrol ...",
    "link": "https://biztoc.com/x/0d5211198eed7048",
    "timestamp": "2025-08-21T23:15:39Z"
  },
  {
    "title": "Trump Strikes on Mexico Cartels Could Backfire Disastrously, Experts Warn",
    "description": "The Trump administration is reportedly planning for the possibility of military operations south of the border.",
    "link": "https://www.newsweek.com/trump-plans-military-action-mexico-cartels-2117318",
    "timestamp": "2025-08-21T23:14:52Z"
  },
  {
    "title": "Defamation case against Fox News highlights role of its hosts in promoting 2020 election falsehoods",
    "description": "A $2.7 billion defamation lawsuit against Fox News for its coverage after the 2020 presidential election focuses on the roles of hosts Jeanine Pirro, Maria Bartiromo and Lou Dobbs in spreading false stories about fraud in Democrat Joe Biden's victory o...",
    "link": "https://abcnews.go.com/Politics/wireStory/defamation-case-fox-news-highlights-role-hosts-promoting-124865835",
    "timestamp": "2025-08-21T23:10:37Z"
  },
  {
    "title": "US Supreme Court lets Trump cut diversity-related NIH grants",
    "description": "Summary Researchers and 16 US states challenged NIH grant cuts Cuts involve billions of dollars in research support Trump targets diversity, equity and inclusion efforts The U.S. Supreme Court let President Donald Trump's administration on Thursday proceed wi…",
    "link": "https://freerepublic.com/focus/f-news/4335980/posts",
    "timestamp": "2025-08-21T23:10:36Z"
  },
  {
    "title": "Kilmar Abrego Garcia could be released from jail Friday. Here's what to know",
    "description": "A U.S. magistrate judge is expected to order the release of Kilmar Abrego Garcia from a Tennessee jail while he awaits trial on federal human smuggling charges",
    "link": "https://abcnews.go.com/Politics/wireStory/kilmar-abrego-garcia-released-jail-friday-124865644",
    "timestamp": "2025-08-21T23:10:32Z"
  },
  {
    "title": "Trump’s stunning approval rating: How high can it go?",
    "description": "His popularity could rise sky high if his efforts bring an end to Ukraine war",
    "link": "https://www.wnd.com/2025/08/trumps-stunning-approval-rating-how-high-can-it/",
    "timestamp": "2025-08-21T23:10:25Z"
  },
  {
    "title": "Thursday Night Open Thread",
    "description": "Since Trump took office, white on white crime is just exploding: Cracker Barrel lost $94 million in a day after a disastrous rebrand sparked outrage among President Donald Trump’s “Make America Great Again” base. The new logo for the Southern-themed restauran…",
    "link": "https://balloon-juice.com/2025/08/21/thursday-night-open-thread-86/",
    "timestamp": "2025-08-21T23:08:22Z"
  },
  {
    "title": "Kilmar Abrego Garcia could be released from jail Friday. Here’s what to know",
    "description": "His lawyers have said he will travel to Maryland, where his family lives.",
    "link": "https://www.bostonherald.com/2025/08/21/deportation-error-things-to-know/",
    "timestamp": "2025-08-21T23:00:56Z"
  },
  {
    "title": "Supreme Court Lifts Order, Allowing Trump to Cut NIH Funds That AdvanceDEI",
    "description": "NIH can cut $783 million of research.\nThe post Supreme Court Lifts Order, Allowing Trump to Cut NIH Funds That AdvanceDEI first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/supreme-court-lifts-order-allowing-trump-to-cut-nih-funds-that-advancedei/",
    "timestamp": "2025-08-21T23:00:30Z"
  },
  {
    "title": "US applications for jobless benefits rise last week, but layoffs remain historically low",
    "description": "WASHINGTON (AP) — More Americans filed for unemployment benefits last week, but U.S. layoffs remain in the same historically healthy range of the past few",
    "link": "https://www.thetrucker.com/trucking-news/business/us-applications-for-jobless-benefits-rise-last-week-but-layoffs-remain-historically-low",
    "timestamp": "2025-08-21T23:00:19Z"
  },
  {
    "title": "Doing more and doing differently should be our mantras: Jaishankar on boosting India-Russia ties",
    "description": "NEW DELHI, Aug 21: India and Russia should come out with a creative and innovative approach to confront complex geopolitical challenges, External Affairs Minister S Jaishankar said on Wednesday amid increasing strains in New Delhi’s ties with Washington over …",
    "link": "https://thehillstimes.in/national/doing-more-and-doing-differently-should-be-our-mantras-jaishankar-on-boosting-india-russia-ties",
    "timestamp": "2025-08-21T23:00:00Z"
  },
  {
    "title": "Supreme Court by 5-4 Approves Cuts to NIH Research",
    "description": "The U.S. Supreme Court voted by 5-4 to approve the Trump administration’s cuts to federal research grants on health, due to their possible connection to diversity, equity, and inclusion, and to “radical gender ideology.” Chief Justice John Roberts voted with …",
    "link": "https://dianeravitch.net/2025/08/21/supreme-court-by-5-4-approves-cuts-to-nih-research/",
    "timestamp": "2025-08-21T23:00:00Z"
  },
  {
    "title": "Katie Porter: Redistricting Will Pass Because Californians Feel 'Picked On' by Trump",
    "description": "Thursday on CNN's \"The Agenda,\" Katie Porter, a candidate for California governor, said Californians will pass the new redistricting map because they have been \"picked on\" by President Donald Trump.\nThe post Katie Porter: Redistricting Will Pass Because Calif…",
    "link": "https://www.breitbart.com/clips/2025/08/21/katie-porter-redistricting-will-pass-because-californians-feel-picked-on-by-trump/",
    "timestamp": "2025-08-21T22:59:40Z"
  },
  {
    "title": "Gavin Newsom’s redistricting plan is on its way to voters. What you need to know",
    "description": "Many California Democrats are reluctant to give up the state’s independently drawn congressional districts, but they say it’s a necessary step to counter gerrymanders in Republican states.",
    "link": "https://www.kpbs.org/news/politics/2025/08/21/gavin-newsoms-redistricting-plan-is-on-its-way-to-voters-what-you-need-to-know",
    "timestamp": "2025-08-21T22:56:59Z"
  },
  {
    "title": "The umpire who picked a side: John Roberts and the death of rule of law in America (Ed Pilkington/The Guardian)",
    "description": "Ed Pilkington / The Guardian:\nThe umpire who picked a side: John Roberts and the death of rule of law in America  —  The chief justice of the US has painted himself as a modern institutionalist over the past 20 years.  Experts say he's emboldening Trump's dri…",
    "link": "https://www.memeorandum.com/250821/p115",
    "timestamp": "2025-08-21T22:55:00Z"
  },
  {
    "title": "N.Y. Appeals Court Throws Out $500 Million Civil Fraud Penalty Against Trump - The Wall Street Journal",
    "description": "N.Y. Appeals Court Throws Out $500 Million Civil Fraud Penalty Against TrumpThe Wall Street Journal Opinion | Donald Trump and ‘selective’ prosecutionThe Washington Post Trump’s civil fraud penalty scrapped: 5 takeawaysThe Hill Trump speaks to law enforcement…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178814042",
    "timestamp": "2025-08-21T22:53:50Z"
  },
  {
    "title": "Global Mail Services Halt US Deliveries Ahead of De Minimis End",
    "description": "Postal services across the world are cutting off parcel deliveries to the US as the fast-approaching end of a tariff exception for low-value packages sows chaos in global shipping.",
    "link": "https://financialpost.com/pmn/business-pmn/global-mail-services-halt-us-deliveries-ahead-of-de-minimis-end",
    "timestamp": "2025-08-21T22:47:36Z"
  },
  {
    "title": "US DOJ to probe Fed Reserve’s Cook, urges Powell to remove her: Report",
    "description": "Cook, who has been accused of mortgage fraud, has said she will not be bullied by Trump into resigning.",
    "link": "https://www.aljazeera.com/economy/2025/8/21/us-doj-to-probe-fed-reserves-cook-urges-powell-to-remove-her-report",
    "timestamp": "2025-08-21T22:47:35Z"
  },
  {
    "title": "Trump endorses Burrows after Texas redistricting map",
    "description": "United States President Donald Trump called Texas House Speaker Dustin Burrows a \"True Warrior for Republicans,\" mentioning his \"strong and effective leadership\" as the Texas House...",
    "link": "https://biztoc.com/x/a9754405d240cd74",
    "timestamp": "2025-08-21T22:47:24Z"
  },
  {
    "title": "272 Jihadis Killed: Sebastian Gorka Breaks Down Trump Admin’s Counterterrorism Strategy",
    "description": "Since Jan. 20, the Trump administration has killed 272 “jihadis” around the world, according to Sebastian Gorka, senior director for counterterrorism on the president’s National... Read More\nThe post 272 Jihadis Killed: Sebastian Gorka Breaks Down Trump Admin…",
    "link": "https://www.dailysignal.com/2025/08/21/272-jihadis-killed-sebastian-gorka-breaks-down-trump-admins-counterterrorism-strategy/",
    "timestamp": "2025-08-21T22:46:32Z"
  },
  {
    "title": "The Courage To Act",
    "description": "We wanted action from our elected officials, right? Well, we are starting to get action, more and more.  That’s great, right? Oh, wait, they are doing it wrong?  Fuck that shit. Right now, I need the courage to face what is happening every day, and not tune o…",
    "link": "https://balloon-juice.com/2025/08/21/the-courage-to-act/",
    "timestamp": "2025-08-21T22:46:11Z"
  },
  {
    "title": "Judge: Trump’s former attorney Habba has been illegally serving as top N.J. prosecutor",
    "description": "A New Jersey judge found that Trump's former defense attorney was serving as the state's top prosecutor illegally",
    "link": "https://www.salon.com/2025/08/21/judge-trumps-former-attorney-habba-has-been-illegally-serving-as-n-j-top-prosecutor/",
    "timestamp": "2025-08-21T22:46:02Z"
  },
  {
    "title": "What’s the Texas redistricting fight about, and how has California reacted?",
    "description": "Trump's demand for new district maps in Republican-led states sparked a redistricting fight of the midterm elections.",
    "link": "https://www.aljazeera.com/news/2025/8/21/whats-the-texas-redistricting-fight-about-and-how-has-california-reacted",
    "timestamp": "2025-08-21T22:45:25Z"
  },
  {
    "title": "Collapse of Tish James’ civil-fraud case vs. Trump is the latest blow to Dem lawfare",
    "description": "Chalk up another win for President Donald Trump over Democrats who tried to destroy him with lawfare.",
    "link": "https://nypost.com/2025/08/21/opinion/court-ruling-to-nix-penalty-in-tish-james-civil-fraud-case-vs-trump-is-the-latest-blow-to-dem-lawfare/",
    "timestamp": "2025-08-21T22:44:21Z"
  },
  {
    "title": "Addressing rumor Trump put a 2-year limit on Section 8 rental assistance program",
    "description": "While the time limit appeared in the fiscal year 2026 budget proposal from Trump's White House, it had not been implemented as of this writing.",
    "link": "https://www.snopes.com//news/2025/08/21/trump-section-8-rental-assistance/",
    "timestamp": "2025-08-21T22:42:00Z"
  },
  {
    "title": "California legislature approves redistricting plan in response to Texas effort",
    "description": "California’s Democratic-led legislature has passed the Election Rigging Response Act legislative package, which is aimed at redrawing the state’s congressional districts after Texas’ Republican-led House advanced its controversial new electoral map on Wednesd…",
    "link": "https://www.msnbc.com/top-stories/latest/california-map-redistricting-vote-texas-gerrymandering-newsom-rcna226379",
    "timestamp": "2025-08-21T22:37:16Z"
  },
  {
    "title": "Judge who fined Trump $500 million gets the books thrown at him",
    "description": "Judge Arthur Engoron's $500 million fine against Trump completely rejected by appellate court, with no portion of the judgment preserved",
    "link": "https://www.foxnews.com/opinion/judge-who-fined-trump-500-million-gets-books-thrown-him",
    "timestamp": "2025-08-21T22:36:09Z"
  },
  {
    "title": "Trump visits police, military in Washington amid crime crackdown",
    "description": "U.S. President Donald Trump took his law-and-order message to the streets of the nation's capital on Thursday, visiting a command center to thank law enforcement officers who are carrying out his crime crackdown. Trump last week deployed National Guard soldie…",
    "link": "https://japantoday.com/category/world/trump-visits-police-military-in-washington-amid-crime-crackdown",
    "timestamp": "2025-08-21T22:36:08Z"
  },
  {
    "title": "Judge says former Trump lawyer Alina Habba has been unlawfully serving as US attorney in New Jersey (Mike Catalini/Associated Press)",
    "description": "Mike Catalini / Associated Press:\nJudge says former Trump lawyer Alina Habba has been unlawfully serving as US attorney in New Jersey  —  A federal judge ruled Thursday that President Donald Trump's former lawyer, Alina Habba, has been unlawfully serving as t…",
    "link": "https://www.memeorandum.com/250821/p113",
    "timestamp": "2025-08-21T22:35:00Z"
  },
  {
    "title": "Trump Targets LGBTQ+ History, Migrants, and More in Chilling Smithsonian Hit List",
    "description": "The White House's 26-point bulleted memo includes Amy Sherald's painting of a transgender woman and an animation of Anthony Fauci.",
    "link": "http://hyperallergic.com/1036180/trump-targets-lgbtq-history-migrants-and-more-in-chilling-smithsonian-hit-list/",
    "timestamp": "2025-08-21T22:34:00Z"
  },
  {
    "title": "Gov. Newsom Mocks MAGA's Outrage Over Cracker Barrel's New Logo",
    "description": "The Democratic governor from California ridiculed the right after they accused the restaurant chain of becoming ″woke.”",
    "link": "https://www.huffpost.com/entry/newsom-mocks-maga-cracker-barrel-new-logo_n_68a75159e4b0e8c4a7241881",
    "timestamp": "2025-08-21T22:33:55Z"
  },
  {
    "title": "Newsom Mocks MAGA's Outrage Over Cracker Barrel's New Logo",
    "description": "The Democratic governor from California ridiculed the right after they accused the restaurant chain of becoming ″woke.”",
    "link": "https://www.huffpost.com/entry/newsom-mocks-maga-cracker-barrel-new-logo_n_68a75159e4b0e8c4a7241881?utm_campaign=yahoo-recirc",
    "timestamp": "2025-08-21T22:33:55Z"
  },
  {
    "title": "California Dems, Newsom hit back after Texas passes Trump redistricting map",
    "description": "California Democrats were set Thursday to pass a redistricting map to add up to five blue congressional seats after Texas Republicans rubber-stamped...",
    "link": "https://www.nydailynews.com/2025/08/21/california-democrats-respond-texas-redistricting-map/",
    "timestamp": "2025-08-21T22:31:00Z"
  },
  {
    "title": "It's been a confusing week - and Trump's been made to look weak",
    "description": "A back and forth on security guarantees from Ukraine, Europe, and Russia all makes the president look rather weak, and it's unclear whether Trump's America would truly sign up to anything that obliges them to do anything.",
    "link": "https://news.sky.com/story/its-been-a-confusing-week-and-trumps-been-made-to-look-weak-13415929",
    "timestamp": "2025-08-21T22:31:00Z"
  },
  {
    "title": "Can a Legendary Coach Transform U.N.C. Football?",
    "description": "From the daily newsletter: Paige Williams reports from the early days of the Belichick era in North Carolina.",
    "link": "https://www.newyorker.com/newsletter/the-daily/can-a-legendary-coach-transform-unc-football",
    "timestamp": "2025-08-21T22:30:00Z"
  },
  {
    "title": "Trump says Washington DC now 'safer than ever'",
    "description": "United States President Donald Trump toured Washington DC, crediting law enforcement for a drop in crime and saying the capital is \"at a level you haven't seen in a long time.\"\nTrump cl...",
    "link": "https://biztoc.com/x/4d4c3a12da3cbd1c",
    "timestamp": "2025-08-21T22:25:05Z"
  },
  {
    "title": "Trump hails dismissal of $500M fraud penalty",
    "description": "United States President Donald Trump welcomed the $500 million civil fraud ruling against him being overturned, calling the case a \"witch hunt.\"\n\"You know, they stole $550 million from...",
    "link": "https://biztoc.com/x/66ac99a6726e0aa1",
    "timestamp": "2025-08-21T22:25:04Z"
  },
  {
    "title": "California legislators pass redistricting plans to put a Democratic-drawn map before voters",
    "description": "California's Democratic-controlled state Legislature passed bills Thursday setting up a high-profile special election this fall, when voters will decide whether to approve the party's plan to gerrymander California's congressional map",
    "link": "https://www.nbcnews.com/politics/elections/california-legislators-pass-redistricting-plans-put-democratic-drawn-m-rcna226276",
    "timestamp": "2025-08-21T22:25:04Z"
  },
  {
    "title": "Supreme Court lets Trump cut $783 million of health research funding amid anti-DEI push",
    "description": "The high court majority lifted a judge’s order blocking $783 million worth of cuts made by the National Institutes of Health to align with Republican President Donald Trump’s priorities. The high court did keep Trump administration guidance on future funding …",
    "link": "https://biztoc.com/x/c7333a9aca8aa64d",
    "timestamp": "2025-08-21T22:25:03Z"
  },
  {
    "title": "California Legislature Approves Special Election On New Congressional Map Favoring Democrats",
    "description": "If it goes into effect, the redistricting plan could help Democrats win five more U.S. House seats in 2026.",
    "link": "https://www.huffpost.com/entry/ap-us-election-2026-redistricting_n_68a79bdde4b037ca0b423307",
    "timestamp": "2025-08-21T22:23:42Z"
  },
  {
    "title": "'Jim Crow propaganda': Furious Democrats blast cartoon of prosecutor as 'racist mockery'",
    "description": "Local Democrats in Cobb County, Georgia, are enraged over a series of unflattering cartoons about the recently elected district attorney, Sonya Allen, describing it as \"Jim Crow propaganda.\"The series of cartoons, posted to Facebook by local attorney Megan We…",
    "link": "https://www.rawstory.com/georgia-democrats/",
    "timestamp": "2025-08-21T22:21:35Z"
  },
  {
    "title": "Two Big Signs That ICE Has Way Too Much Money",
    "description": "ICE, now flush with cash from President Trump’s megabill, wants to buy flashy new rides and start its own airline.",
    "link": "http://nymag.com/intelligencer/article/ice-plans-to-buy-new-suvs-and-start-airline.html",
    "timestamp": "2025-08-21T22:21:03Z"
  },
  {
    "title": "In NCLA Amicus Win, NY State Supreme Court, Appellate Div., Scraps Illegal Fine Against Trump",
    "description": "People of the State of New York, by Attorney General Letitia James v. Donald J. Trump, et al. People of the State of New York, by Attorney General Letitia James v. Donald J. Trump, et al.",
    "link": "https://www.globenewswire.com/news-release/2025/08/21/3137601/0/en/In-NCLA-Amicus-Win-NY-State-Supreme-Court-Appellate-Div-Scraps-Illegal-Fine-Against-Trump.html",
    "timestamp": "2025-08-21T22:20:00Z"
  }
]