[
  {
    "title": "UK PM Starmer to recognise Palestinian statehood before UNGA meeting",
    "description": "Multiple recognitions are expected despite strong pushback from Israel and the US amid intensifying attacks on Gaza.",
    "link": "https://www.aljazeera.com/news/2025/9/21/uk-pm-starmer-to-recognise-palestinian-statehood-before-unga-meeting",
    "timestamp": "2025-09-21T07:46:07Z"
  },
  {
    "title": "Ultimate Spellings in The Daily LITG, 21st of September 2025",
    "description": "Ultimate Spellings was the most-read story on Bleeding Cool, yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in a history of comi…",
    "link": "https://bleedingcool.com/comics/ultimate-spellings-in-the-daily-litg-21st-of-september-2025/",
    "timestamp": "2025-09-21T07:45:04Z"
  },
  {
    "title": "DePetris: NATO rose to the challenge in Poland",
    "description": "It’s not every day when NATO, arguably the world’s strongest military alliance, is shooting down hostile aircraft in its airspace.",
    "link": "https://www.bostonherald.com/2025/09/21/depetris-nato-rose-to-the-challenge-in-poland/",
    "timestamp": "2025-09-21T07:42:08Z"
  },
  {
    "title": "Novartis has stockpiles to withstand potential Trump tariffs, CEO says",
    "description": "ZURICH, Sept 20 - Novartis has increased its stockpiles of pharmaceuticals in the United States and is well prepared should its products be hit by President Donald Trump's tariffs, its chief executive said in an interview published on Saturday.\nPharmaceutical…",
    "link": "https://biztoc.com/x/b8cc7ec5c90a9ada",
    "timestamp": "2025-09-21T07:39:18Z"
  },
  {
    "title": "IT industry's profit pool at a 5-year low. Will a wave of new visa fees drown the sector?",
    "description": "A massive H-1B visa fee hike compounds existing woes for Indian IT, pushing an already shrinking profit pool to new lows and darkening the industry's outlook",
    "link": "https://www.livemint.com/industry/it-sector-us-visa-fees-indian-it-sector-slowdown-h-1b-visa-fee-hike-visa-fee-impact-tcs-infosys-wipro-11758423237328.html",
    "timestamp": "2025-09-21T07:38:06Z"
  },
  {
    "title": "Fix your foreign policy, speak plainly: Congress' Pramod Tiwari criticises PM Modi over H1B visa fee hike",
    "description": "Congress MP Pramod Tiwari has criticised Prime Minister Narendra Modi regarding the recent increase in H-1B visa fees by the United States, urging him to address foreign policy and advocate for India's position. Tiwari highlighted the impact on talented India…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/fix-your-foreign-policy-speak-plainly-congress-pramod-tiwari-criticises-pm-modi-over-h1b-visa-fee-hike/articleshow/124025416.cms",
    "timestamp": "2025-09-21T07:30:24Z"
  },
  {
    "title": "Tech companies warn H-1B visa holders to avoid foreign travel",
    "description": "Amazon, Microsoft, Meta and Apple are among companies with the greatest number of H-1B visas. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/tech-companies-warn-h-1b-visa-holders-to-avoid-foreign-travel",
    "timestamp": "2025-09-21T07:30:00Z"
  },
  {
    "title": "91 dead in Israeli strike on Gaza on single day; protests erupt in Tel Aviv",
    "description": "Israeli forces killed ninety-one Palestinians in Gaza. The strikes targeted homes and shelters. Relatives of a hospital director were among the dead. Hamas condemned the attacks. Thousands fled the bombardment. Protests erupted in Tel Aviv, demanding a halt t…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/91-dead-in-israeli-strike-on-gaza-on-single-day-protests-erupt-in-tel-aviv/articleshow/124025406.cms",
    "timestamp": "2025-09-21T07:29:14Z"
  },
  {
    "title": "What Jimmy Kimmel said about Charlie Kirk shooting that got his late night show cancelled",
    "description": "ABC has pulled host’s series from TV schedules ‘indefinitely’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-kimmel-charlie-kirk-comment-trump-abc-b2830664.html",
    "timestamp": "2025-09-21T07:24:10Z"
  },
  {
    "title": "'He has only destroyed Congress....No voter is with him,' BJP's Dilip Jaiswal slams Rahul Gandhi over H-1B visa criticism",
    "description": "Dilip Jaiswal, Bihar BJP President, responded to Rahul Gandhi's criticism of PM Modi over the US H-1B visa fee. Jaiswal stated that Gandhi has only damaged the Congress party. Rahul Gandhi attacked PM Modi after US President Trump imposed a USD 100,000 fee fo…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/he-has-only-destroyed-congress-no-voter-is-with-him-bjps-dilip-jaiswal-slams-rahul-gandhi-over-h-1b-visa-criticism/articleshow/124025325.cms",
    "timestamp": "2025-09-21T07:22:12Z"
  },
  {
    "title": "Erdoğan to raise Gaza atrocities at UN, meet Trump in New York",
    "description": "President Recep Tayyip Erdoğan said on Sunday he would put Israel’s offensive in Gaza at the top of his agenda during his upcoming address to the U.N. General Assembly in New York.",
    "link": "https://www.hurriyetdailynews.com/erdogan-to-raise-gaza-atrocities-at-un-meet-trump-in-new-york-213821",
    "timestamp": "2025-09-21T07:20:15Z"
  },
  {
    "title": "Marvel star announces Disney boycott after Jimmy Kimmel suspension",
    "description": "Actor boldly urged fans to cancel their subscriptions",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/disney-jimmy-kimmel-kirk-marvel-b2830661.html",
    "timestamp": "2025-09-21T07:18:49Z"
  },
  {
    "title": "Best Crypto Presales to Buy After U.S. Bitcoin Reserve Bill Signals Bullish Supply Crunch",
    "description": "Earlier this year, Donald Trump announced the formation of a U.S. Bitcoin strategic reserve, where the government would build its own stash of the token. Now, a new bill, called H.R. 1566, has been passed which sets a 90-day deadline for the Treasury Departme…",
    "link": "https://bitcoinist.com/best-crypto-presales-to-buy-after-us-bitcoin-reserve-bill-supply-crunch/",
    "timestamp": "2025-09-21T07:18:31Z"
  },
  {
    "title": "Trump Halts US Steel Plant Closure Using 'Golden Share' Authority: Report",
    "description": "President Donald Trump has exercised his administration’s “golden share” authority to prevent the shutdown of a U.S. Steel plant in Granite City, Illinois.\n‘Golden Share' Veto\nThe “golden share” grants veto power over certain corporate actions, a condition se…",
    "link": "https://biztoc.com/x/e544eecb1c262e84",
    "timestamp": "2025-09-21T07:17:00Z"
  },
  {
    "title": "EU to block Big Tech from new financial data sharing system",
    "description": "Decision would hand a significant boost to banks in their efforts to fight off a competitive threat from Big Tech groups",
    "link": "https://www.irishtimes.com/business/financial-services/2025/09/21/eu-to-block-big-tech-from-new-financial-data-sharing-system/",
    "timestamp": "2025-09-21T07:16:04Z"
  },
  {
    "title": "Trump Calls On Pam Bondi To Take Action Against Opponents 'Now'",
    "description": "The president called Bondi out by name as he expressed frustration by what he said were delays in the Justice Department's investigations.",
    "link": "https://www.newsweek.com/trump-calls-pam-bondi-take-action-against-opponents-now-2133221",
    "timestamp": "2025-09-21T07:16:03Z"
  },
  {
    "title": "Editorial: Buttigieg to Dems: Identity politics have to go",
    "description": "“You just have to go to voters with what you think you can do for them. Politics is about the results we can get for people and not about these other things.” -- Pete Buttigieg",
    "link": "https://www.bostonherald.com/2025/09/21/editorial-buttigieg-to-dems-identity-politics-have-to-go/",
    "timestamp": "2025-09-21T07:11:42Z"
  },
  {
    "title": "Trump’s H-1B visa fee prompts emergency guidance from companies",
    "description": "White House moves to clarify $100,000 application fee for visas relied on by tech industry",
    "link": "https://www.irishtimes.com/business/work/2025/09/21/trumps-h-1b-visa-fee-prompts-emergency-guidance-from-companies/",
    "timestamp": "2025-09-21T07:05:41Z"
  },
  {
    "title": "Pentagon orders journalists to agree to new reporting rules - or be barred",
    "description": "Journalists at the Pentagon have been told they could be barred if they gather or report information that officials haven't approved first.",
    "link": "https://news.sky.com/story/pentagon-orders-journalists-to-agree-to-new-reporting-rules-or-be-barred-13435347",
    "timestamp": "2025-09-21T07:05:00Z"
  },
  {
    "title": "Charlie Kirk’s memorial service: Start time, speaker list, where to watch live",
    "description": "A public memorial service for the conservative activist Charlie Kirk is set for Sept. 21, with President Donald Trump scheduled to attend.",
    "link": "https://www.usatoday.com/story/news/nation/2025/09/21/charlie-kirk-memorial-service/86247841007/",
    "timestamp": "2025-09-21T07:01:20Z"
  },
  {
    "title": "YouTube account for Venezuela’s Maduro is down as tensions with US escalate",
    "description": "State TV channel Telesur reports that Maduro’s channel has been 'eliminated'.",
    "link": "https://www.aljazeera.com/news/2025/9/21/youtube-account-for-venezuelas-maduro-is-down-as-tensions-with-us-escalate",
    "timestamp": "2025-09-21T06:57:26Z"
  },
  {
    "title": "Trump to lead officials in tributes to murdered Republican activist Charlie Kirk today",
    "description": "Even before the alleged killer was identified or arrested, Trump called Kirk “a martyr for truth and freedom”.",
    "link": "https://www.thejournal.ie/trump-to-lead-officials-in-tributes-to-murdered-republican-activist-charlie-kirk-today-6822755-Sep2025/",
    "timestamp": "2025-09-21T06:53:40Z"
  },
  {
    "title": "India warns new US fee for H-1B visa will have 'humanitarian consequences'",
    "description": "Donald Trump has said those applying for H-1B visas will have to pay $100,000, roughly 60 times the current fee, starting Sunday.",
    "link": "https://www.bbc.com/news/articles/clyll7dlg7lo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-21T06:51:35Z"
  },
  {
    "title": "Pentagon Limits Journalists' Access To Military Information",
    "description": "The US Defense Department is requiring journalists to agree to use only pre-approved information about the military or lose their credentials to cover the Pentagon, the latest Trump administration effort to shape media reporting. The new rule came in a memo b…",
    "link": "https://www.ndtvprofit.com/world/pentagon-limits-journalists-access-to-military-information",
    "timestamp": "2025-09-21T06:44:34Z"
  },
  {
    "title": "Trump to lead tributes at memorial for Charlie Kirk",
    "description": "US President Donald Trump and top officials in his administration will lead tributes to Charlie Kirk at a stadium gathering in Arizona, after the influential conservative activist was fatally shot last week.",
    "link": "https://www.rte.ie/news/2025/0921/1534538-trump-kirk-memorial/",
    "timestamp": "2025-09-21T06:43:13Z"
  },
  {
    "title": "Trump to lead tributes at memorial for activist Kirk",
    "description": "US President Donald Trump will lead tributes to Charlie Kirk at a huge stadium gathering to honour the young right-wing influencer slain in America's latest spasm of political violence.",
    "link": "https://www.rte.ie/news/us/2025/0921/1534538-trump-kirk-memorial/",
    "timestamp": "2025-09-21T06:43:13Z"
  },
  {
    "title": "Minister Hasan, Roeslani to attend 200 UN bilateral meetings, sessions",
    "description": "Coordinating Minister for Food Zulkifli Hasan and Minister of Investment and Downstream Development Rosan Roeslani will take part in 200 meetings during ...",
    "link": "https://en.antaranews.com/news/381272/minister-hasan-roeslani-to-attend-200-un-bilateral-meetings-sessions",
    "timestamp": "2025-09-21T06:35:41Z"
  },
  {
    "title": "'ACT FAST': Trump demands Bondi pursue enemies 'if they're guilty or not'",
    "description": "Donald Trump is lashing out at his own Attorney General Pam Bondi for what he sees as a lack of action in targeting his perceived ...",
    "link": "https://biztoc.com/x/8754c2241c3ff83b",
    "timestamp": "2025-09-21T06:34:51Z"
  },
  {
    "title": "Kenya seeks to strike US trade deal by end of year, Trade CS Kinyanjui says",
    "description": "Kenya expects to conclude a trade deal with the United States by year-end, its trade minister told Reuters, a move that could cushion its exports to a key market if an existing regional trade arrangement that expires this month is not renewed.",
    "link": "https://www.citizen.digital/business/kenya-seeks-to-strike-us-trade-deal-by-end-of-year-trade-cs-kinyanjui-says-n370061",
    "timestamp": "2025-09-21T06:30:10Z"
  },
  {
    "title": "Russian pilots ignored Nato jets while violating Estonian airspace, officials claim",
    "description": "Estonian officials maintained on Saturday that there was no need to trigger Article 5, Nato’s collective defence clause.",
    "link": "https://www.thejournal.ie/russian-pilots-ignored-nato-jets-while-violating-estonian-airspace-6822742-Sep2025/",
    "timestamp": "2025-09-21T06:28:08Z"
  },
  {
    "title": "Stopped India-Pakistan conflict with trade, should get Nobel Prize for ending seven wars: Trump",
    "description": "US President Donald Trump claimed he helped end conflicts between India and Pakistan, Thailand and Cambodia, and several other countries through trade, asserting 60% of wars were stopped this way. Speaking at the American Cornerstone Institute, he said he des…",
    "link": "https://economictimes.indiatimes.com/news/defence/stopped-india-pakistan-conflict-with-trade-should-get-nobel-prize-for-ending-seven-wars-trump/articleshow/124024761.cms",
    "timestamp": "2025-09-21T06:17:58Z"
  },
  {
    "title": "Is free speech under threat in Britain?",
    "description": "The Trump administration thinks that free speech is in retreat in Britain. What do we mean by freedom of speech, and is it in danger?",
    "link": "https://theweek.com/politics/is-free-speech-under-threat-in-britain",
    "timestamp": "2025-09-21T06:15:00Z"
  },
  {
    "title": "Hugh Linehan: Jimmy Kimmel suspension a ratcheting-up of Donald Trump’s attack on free speech",
    "description": "US media panics can seem mildly exotic and slightly incomprehensible, but this one matters",
    "link": "https://www.irishtimes.com/opinion/2025/09/21/hugh-linehan-jimmy-kimmel-suspension-a-ratcheting-up-of-donald-trumps-attack-on-free-speech/",
    "timestamp": "2025-09-21T06:05:00Z"
  },
  {
    "title": "Trump Presses Afghanistan To Return Bagram Air Base To US",
    "description": "President Donald Trump urged Afghanistan to return the Bagram air base to US control, threatening “bad things” for the Taliban-led country if it fails to comply. The demand, made in a post on Truth Social on Saturday, follows comments from Trump earlier this …",
    "link": "https://www.ndtvprofit.com/world/trump-presses-afghanistan-to-return-bagram-air-base-to-us",
    "timestamp": "2025-09-21T06:04:30Z"
  },
  {
    "title": "Trump Says Meeting Democrats To Avert Shutdown Unlikely To Help",
    "description": "Democratic congressional leaders demanded a meeting with Donald Trump ahead of a possible government shutdown, drawing a noncommittal response from the president. “I’d love to meet with them, but I don’t think it’s going to have any impact,” Trump told report…",
    "link": "https://www.ndtvprofit.com/world/trump-says-meeting-democrats-to-avert-shutdown-unlikely-to-help",
    "timestamp": "2025-09-21T06:00:24Z"
  },
  {
    "title": "Permanent standard time emerges as clear winner for public health in landmark study",
    "description": "A new Stanford University study concludes that adopting permanent standard time is the healthiest option for the public, as it aligns clocks more closely with the natural solar cycle. The research found that the biannual clock change itself is the most harmfu…",
    "link": "https://www.naturalnews.com/2025-09-21-study-permanent-standard-time-winner-public-health.html",
    "timestamp": "2025-09-21T06:00:00Z"
  },
  {
    "title": "Cornell MBA students warned against attending “diversity” recruiting events",
    "description": "Cornell University‘s MBA student council advised non-marginalized (primarily White, male and heterosexual) students to avoid diversity recruiting events, warning their attendance could harm job prospects and school partnerships. Critics argue the policy under…",
    "link": "https://www.naturalnews.com/2025-09-21-cornell-mba-students-warned-avoid-diversity-events.html",
    "timestamp": "2025-09-21T06:00:00Z"
  },
  {
    "title": "Stopped India-Pak conflict with trade, should get Nobel Prize for ending 7 wars: Trump",
    "description": "“Think of India and Pakistan. Think of that. And you know how I stopped that — with trade...,” Trump said, adding he was told that if he could stop the conflict between Russia and Ukraine, he should get the Nobel Prize",
    "link": "https://www.thehindubusinessline.com/news/world/stopped-india-pak-conflict-with-trade-should-get-nobel-prize-for-ending-7-wars-trump/article70076461.ece",
    "timestamp": "2025-09-21T05:56:12Z"
  },
  {
    "title": "Trump warns Afghanistan of ‘bad things’ if it does not return Bagram base",
    "description": "Vague threat comes after the Taliban rejected Trump's call to return the airbase previously used by US forces.",
    "link": "https://www.aljazeera.com/news/2025/9/21/trump-warns-afghanistan-of-bad-things-if-it-does-not-return-bagram-base",
    "timestamp": "2025-09-21T05:56:08Z"
  },
  {
    "title": "Trump is already wielding his ‘golden share’ authority at U.S. Steel, overriding the company plans",
    "description": "Just when U.S. Steel thought the ink had dried on its new future with Japan’s Nippon Steel, the company ran into a political reality check: President Donald Trump’s administration and its new “golden share” authority.\nThe golden share—essentially a veto power…",
    "link": "https://biztoc.com/x/4f66cf44933ce938",
    "timestamp": "2025-09-21T05:48:12Z"
  },
  {
    "title": "India - USA: What about diplomacy? | Energonomics | EP 24 | With Meera Shankar and Arun Kumar Singh",
    "description": "Explore the evolving India-US relations amid trade tensions and energy diplomacy with former Indian Ambassadors on Energonomics podcast.",
    "link": "https://www.thehindubusinessline.com/multimedia/video/india-usa-what-about-diplomacy-energonomics-ep-24-with-meera-shankar-and-arun-kumar-singh/article70074242.ece",
    "timestamp": "2025-09-21T05:45:00Z"
  },
  {
    "title": "Trump Renews Pressure On Europe To Stop Buying Russian Oil",
    "description": "President Donald Trump renewed his call for European countries to “stop buying oil” from Russia, a demand he has linked to further US pressure on Vladimir Putin to halt the war in Ukraine. “The Europeans are buying oil from Russia — not supposed to happen, ri…",
    "link": "https://www.ndtvprofit.com/world/trump-renews-pressure-on-europe-to-stop-buying-russian-oil",
    "timestamp": "2025-09-21T05:39:53Z"
  },
  {
    "title": "Trump Rages at ‘Mean Son of a B***h’ Biden in Wild Rant",
    "description": "President Donald Trump took time out of his speech at a black-tie dinner on Saturday night to trash his predecessor, President Joe Biden, calling him “stupid...",
    "link": "https://www.thedailybeast.com/donald-trump-rages-at-mean-son-of-a-bh-joe-biden-in-wild-rant/",
    "timestamp": "2025-09-21T05:22:23Z"
  },
  {
    "title": "Iran says it will suspend cooperation with UN’s nuclear watchdog",
    "description": "President Masoud Pezeshkian also says Tehran will 'overcome obstacles' if wide-ranging UN sanctions are reimposed.",
    "link": "https://www.aljazeera.com/news/2025/9/21/iran-says-e3-move-to-trigger-sanctions-will-halt-cooperation-with-iaea",
    "timestamp": "2025-09-21T05:21:29Z"
  },
  {
    "title": "Trump wanted to DM Attorney General Bondi rebuking her for failing to prosecute Comey, Schiff, and James; instead posted on Truth Social and then deleted it",
    "description": "Donald Trump urged Pam Bondi to prosecute James Comey, Adam Schiff, and Letitia James. He accused Bondi of inaction and cited complaints about delays. Trump's post, later deleted, showed frustration over perceived lack of legal action. This came after Erik Si…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-wanted-to-dm-attorney-general-bondi-rebuking-her-for-failing-to-prosecute-comey-schiff-and-james-instead-posted-on-truth-social-and-then-deleted-it/articleshow/124024226.cms",
    "timestamp": "2025-09-21T05:17:28Z"
  },
  {
    "title": "In West Bank, Palestinian recognition welcomed despite fears of Israeli annexation",
    "description": "Palestinians living in the West Bank describe the impact of Israel's occupying control.",
    "link": "https://www.bbc.com/news/articles/c0ez9qxzl2jo",
    "timestamp": "2025-09-21T05:01:20Z"
  },
  {
    "title": "‘Don’t want to wait any longer’: Trump to make ‘big’ announcement on Autism, why is this brain development condition a matter of concern in the US; all you need to know",
    "description": "Donald Trump will make an announcement related to autism on Monday. Health Secretary Robert F. Kennedy Jr. suggests a link between Tylenol use during pregnancy and autism. Autism diagnoses have risen significantly since 2000. Trump also mentioned that Mehmet …",
    "link": "https://economictimes.indiatimes.com/news/international/us/dont-want-to-wait-any-longer-trump-to-make-big-announcement-on-autism-why-is-this-brain-development-condition-a-matter-of-concern-in-the-us-all-you-need-to-know/articleshow/124024136.cms",
    "timestamp": "2025-09-21T05:00:28Z"
  },
  {
    "title": "Dark cloud hangs over UN headquarters as leaders gather for ‘World Cup of Diplomacy’",
    "description": "Irish delegation to push Government stance on Gaza, Ukraine and Sudan crisis at General Assembly",
    "link": "https://www.irishtimes.com/world/us/2025/09/21/dark-cloud-hangs-over-un-headquarters-as-leaders-gather-for-world-cup-of-diplomacy/",
    "timestamp": "2025-09-21T05:00:01Z"
  },
  {
    "title": "Patricia Lockwood: ‘I went to God’s gang back in the day and our pants were enormous!’",
    "description": "The award-winning author behind ‘Priestdaddy’, Lockwood – aka the Poet Laureate of Twitter – found her mind faltering when she came down with post-Covid mania. She speaks with Annabel Nugent about writing her second novel, quitting social media, and why she w…",
    "link": "https://www.the-independent.com/arts-entertainment/books/features/patricia-lockwood-will-there-ever-be-another-you-b2828444.html",
    "timestamp": "2025-09-21T05:00:00Z"
  },
  {
    "title": "Trump suggests ending quarterly reporting, raising questions for investors",
    "description": "Proposal has resurfaced just as recent earnings reports from listed companies have begun to expose the costs of his trade wars",
    "link": "https://www.irishtimes.com/your-money/2025/09/21/trump-suggests-ending-quarterly-reporting-raising-questions-for-investors/",
    "timestamp": "2025-09-21T05:00:00Z"
  },
  {
    "title": "What is the H-1B visa program, and what changes is Donald Trump making?",
    "description": "The H-1B visa program, a key US skilled immigration pathway, allows employers to hire foreign professionals in tech, education, and STEM fields. President Donald Trump’s new policy introduces a $100,000 fee for new applicants, aiming to prioritize domestic ta…",
    "link": "https://timesofindia.indiatimes.com/education/news/what-is-the-h-1b-visa-program-and-what-changes-is-donald-trump-making/articleshow/124023986.cms",
    "timestamp": "2025-09-21T04:58:38Z"
  },
  {
    "title": "Trump talks about new US attorney nominee",
    "description": "United States President Donald Trump made a second post on Truth Social discussing his new nominee for the post of United States Attorney for the Eastern District of Virginia, Linsey Halligan, who has...",
    "link": "https://biztoc.com/x/f805e6b11a0c753a",
    "timestamp": "2025-09-21T04:52:44Z"
  },
  {
    "title": "Top Russian Orthodox cleric honors ‘martyr’ Charlie Kirk",
    "description": "An influential Russian cleric has praised Charlie Kirk as an earnest Christian and effective preacher Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624999-top-russian-orthodox-cleric-honors/",
    "timestamp": "2025-09-21T04:43:55Z"
  },
  {
    "title": "Kamala Harris Reveals Choosing Gay Man Pete Buttigieg As Her Running Mate Was Too Risky",
    "description": "Ahead of the upcoming release of her memoir, Kamala Harris has revealed she would have liked to have Pete Buttigieg as her running mate in the presidential election, however she ...\nThe post Kamala Harris Reveals Choosing Gay Man Pete Buttigieg As Her Running…",
    "link": "https://www.starobserver.com.au/news/kamala-harris-reveals-choosing-gay-man-pete-buttigieg-as-her-running-mate-was-too-risky/238848",
    "timestamp": "2025-09-21T04:36:33Z"
  },
  {
    "title": "Hindu Sena once did havan for Donald Trump's victory; now says he's lost 'good sense' — What sparked tensions?",
    "description": "India News: Vishnu Gupta, who once called Trump a \\\"hero\\\", now thinks the US president has \\\"lost his good sense\\\".",
    "link": "https://timesofindia.indiatimes.com/india/hindu-sena-once-did-havan-for-donald-trumps-victory-now-says-hes-lost-good-sense-what-sparked-tensions/articleshow/124023861.cms",
    "timestamp": "2025-09-21T04:30:42Z"
  },
  {
    "title": "Dónal Lynch: Jimmy Kimmel is just the latest sacrificial lamb in America’s cultural war of attrition",
    "description": "It is a strange irony that America’s jokiest ever president has been so bad for American comedy.",
    "link": "https://www.independent.ie/opinion/comment/donal-lynch-jimmy-kimmel-is-just-the-latest-sacrificial-lamb-in-americas-cultural-war-of-attrition/a722413768.html",
    "timestamp": "2025-09-21T04:30:00Z"
  },
  {
    "title": "Letters: Racism is hiding behind a host of euphemisms in modern Ireland",
    "description": "Madam — Back in the mists of my youth, I remember writing a school essay on what we would have done if faced with the rise of the kind of racist ideology that thrived in the 1930s and ’40s. How would we react if people around us were being persecuted for who …",
    "link": "https://www.independent.ie/opinion/letters/letters-racism-is-hiding-behind-a-host-of-euphemisms-in-modern-ireland/a150157239.html",
    "timestamp": "2025-09-21T04:30:00Z"
  },
  {
    "title": "Julia Molony: How British royals bent the knee for Donald Trump’s Cinderella moment",
    "description": "He arrived in ­Windsor in a ­helicopter. But he was carried to the castle in a gilded carriage drawn by six liveried horses. Welcomes don’t get more royal, or more Trumpian, than those laid on by an ailing British monarchy engaged in a tense bid to ingratiate…",
    "link": "https://www.independent.ie/opinion/julia-molony-how-british-royals-bent-the-knee-for-donald-trumps-cinderella-moment/a1347096689.html",
    "timestamp": "2025-09-21T04:30:00Z"
  },
  {
    "title": "Trump appointee ratchets up pressure on Dublin Airport over passenger cap and night-flight quota",
    "description": "There are renewed fears that the Irish aviation sector could face restrictions in the US, after Donald Trump’s transportation secretary issued a stark warning about “unjustified operational restrictions” on US airlines at European airports.",
    "link": "https://www.independent.ie/business/irish/trump-appointee-ratchets-up-pressure-on-dublin-airport-over-passenger-cap-and-night-flight-quota/a1758274704.html",
    "timestamp": "2025-09-21T04:30:00Z"
  },
  {
    "title": "Eric Trump’s Irish wish list: Businessman wants Doonbeg cash boost from Government to match Ryder Cup investment",
    "description": "Eric Trump, the son of US president Donald Trump, has hit out at what he described as Ireland’s “incredibly lethargic” planning system.",
    "link": "https://www.independent.ie/irish-news/eric-trumps-irish-wish-list-businessman-wants-doonbeg-cash-boost-from-government-to-match-ryder-cup-investment/a483047648.html",
    "timestamp": "2025-09-21T04:30:00Z"
  },
  {
    "title": "Brendan O’Connor: Why we should all be grateful that our president is powerless",
    "description": "Whatever president we get, we’ll be grateful. And grateful they’ve no power. A damn sight better than a president with too much power.",
    "link": "https://www.independent.ie/opinion/brendan-oconnor-why-we-should-all-be-grateful-that-our-president-is-powerless/a606134504.html",
    "timestamp": "2025-09-21T04:30:00Z"
  },
  {
    "title": "Joe Brolly: Jim Gavin may not be elected as President but his rules fix will live forever",
    "description": "When Henry Shefflin went to Galway, I thought of Martha Wainwright’s great line in her song ‘Factory’, “These are not my people, I should never have come here.”",
    "link": "https://www.independent.ie/sport/gaelic-games/joe-brolly-jim-gavin-may-not-be-elected-as-president-but-his-rules-fix-will-live-forever/a1706742910.html",
    "timestamp": "2025-09-21T04:30:00Z"
  },
  {
    "title": "Trump Wants Afghanistan to Return Bagram Base to US 'Soon'",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump said that he was expecting from the authorities of Afghanistan an immediate transfer of Bagram air base under US control.",
    "link": "https://sputnikglobe.com/20250921/trump-wants-afghanistan-to-return-bagram-base-to-us-soon-1122825398.html",
    "timestamp": "2025-09-21T04:29:56Z"
  },
  {
    "title": "H-1B visa fee hike: Telangana CM urges PM Modi, EAM Jaishankar to address issue on ''war footing''",
    "description": "“The executive orders of President of America had come as a shocker to all,” the CM wrote in post on X.",
    "link": "https://www.thehindubusinessline.com/news/h-1b-visa-fee-hike-telangana-cm-urges-pm-modi-eam-jaishankar-to-address-issue-on-war-footing/article70076357.ece",
    "timestamp": "2025-09-21T04:26:44Z"
  },
  {
    "title": "Trump publicly urges US Justice Department to charge his enemies",
    "description": "Donald Trump has asked the Justice Department to act against his perceived enemies. He criticized the lack of legal action against Adam Schiff and Letitia James. Trump fired a prosecutor overseeing a probe into James. He appointed Lindsey Halligan to fill the…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-publicly-urges-us-justice-department-to-charge-his-enemies/articleshow/124023862.cms",
    "timestamp": "2025-09-21T04:19:19Z"
  },
  {
    "title": "Argentine President to meet with Trump, Netanyahu on sidelines of UN General Assembly",
    "description": "The Argentine President's Office announced that President Javier Milley will meet with US President Donald Trump and Prime Minister Benjamin Netanyahu &#111;n the sidelines of the UN General Assembly in New York.",
    "link": "https://www.israelnationalnews.com/flashes/666911",
    "timestamp": "2025-09-21T04:13:27Z"
  },
  {
    "title": "Donald Trump links oil drilling to halting Russia-Ukraine war at Mount Vernon event",
    "description": "Speaking at Mount Vernon, Donald Trump linked oil drilling to resolving the Russia-Ukraine war, expressing disappointment in Vladimir Putin for the ongoing conflict. He claimed the war wouldn't have occurred if he were president, highlighting his past efforts…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-links-oil-drilling-to-halting-russia-ukraine-war-at-mount-vernon-event/articleshow/124023810.cms",
    "timestamp": "2025-09-21T04:09:57Z"
  },
  {
    "title": "Trump flags 'important' announcement on autism findings",
    "description": "Donald Trump has flagged an announcement on autism, predicting ‘it's gonna be one of the most important things that we will do’.",
    "link": "https://thenightly.com.au/society/health/trump-flags-important-announcement-on-autism-findings-c-20093130",
    "timestamp": "2025-09-21T04:08:32Z"
  },
  {
    "title": "Trump will lead high-profile lineup honoring Charlie Kirk at Arizona service",
    "description": "President Donald Trump and prominent members of his “Make America Great Again” movement will pay tribute Sunday to conservative activist Charlie Kirk, whose slaying has marked a signal moment in America’s fraught political atmosphere.",
    "link": "https://www.bostonherald.com/2025/09/21/trump-will-lead-high-profile-lineup-honoring-charlie-kirk-at-arizona-service/",
    "timestamp": "2025-09-21T04:01:44Z"
  },
  {
    "title": "Trump and his MAGA movement will honor Charlie Kirk at an Arizona memorial service",
    "description": "President Donald Trump and prominent members of his “Make America Great Again” movement will pay tribute Sunday to conservative activist Charlie Kirk, whose slaying has marked a signal moment in America’s fraught political atmosphere.",
    "link": "https://www.bostonherald.com/2025/09/21/trump-and-his-maga-movement-will-honor-charlie-kirk-at-an-arizona-memorial-service/",
    "timestamp": "2025-09-21T04:01:44Z"
  },
  {
    "title": "Trump USDA Ends Annual Hunger Survey For Being ‘Overly Politicized’",
    "description": "Given that public policy issues like hunger in the country are by definition political, the excuse is another attempt to sweep problems under the rug.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/09/21/trump-usda-ends-annual-hunger-survey-for-being-overly-politicized/",
    "timestamp": "2025-09-21T04:01:20Z"
  },
  {
    "title": "President Trump demands Bagram Air Base back, threatens Afghanistan: ‘BAD THINGS ARE GOING TO HAPPEN!’",
    "description": "President Donald Trump has ratcheted-up his demand for Bagram Airfield in Afghanistan and is now threatening the Taliban who took it over when the US pulled out of the country in 2021. “If Afghanistan doesn’t give Bagram Airbase back to those that built it, t…",
    "link": "https://nypost.com/2025/09/21/us-news/president-trump-demands-bagram-air-base-back-threatens-afghanistan-bad-things-are-going-to-happen/",
    "timestamp": "2025-09-21T04:00:55Z"
  },
  {
    "title": "Is Pam Bondi a",
    "description": "On November 25, 2024 I wrote What you don’t know, and need to know, about Pam Bondi. It reminded readers that it was Bondi as Florida’s Attorney General who appointed the corrupt special prosecutor who managed the political, racist p...",
    "link": "https://www.americanthinker.com/blog/2025/09/is_pam_bondi_a_hate_speech_monger.html",
    "timestamp": "2025-09-21T04:00:00Z"
  },
  {
    "title": "America propagandizing Americans",
    "description": "It was never supposed to be this way.",
    "link": "https://www.americanthinker.com/blog/2025/09/america_propagandizing_americans.html",
    "timestamp": "2025-09-21T04:00:00Z"
  },
  {
    "title": "Democrats Pretend to Be for Free Speech: NOPE",
    "description": "On the internet the big story seems to be the indefinite suspension of Jimmy Kimmel by ABC. I confess to being somewhat at a disadvantage. The last time I looked at network television my set had four dials: on/off, vertical, and horizontal, volume, a...",
    "link": "https://www.americanthinker.com/articles/2025/09/democrats_pretend_to_be_for_free_speech_nope.html",
    "timestamp": "2025-09-21T04:00:00Z"
  },
  {
    "title": "The Biden FBI was worse than we knew",
    "description": "Americans paying attention have long known Biden’s Handlers weaponized the DOJ/FBI against Normal Americans. They’ve also known Joe Biden was their doddering, stumbling, little girl and woman groping, barely conscious mouthpiece. Presiden...",
    "link": "https://www.americanthinker.com/blog/2025/09/the_biden_fbi_was_worse_than_we_knew.html",
    "timestamp": "2025-09-21T04:00:00Z"
  },
  {
    "title": "A Thumbnail History of America’s Decline",
    "description": "This brief account of America’s decline begins by pointing out that in this country, the rule of God once outweighed the rule of man. The mainstream of America regarded the Word of God as ultimately the best rule for all to follow. But in our d...",
    "link": "https://www.americanthinker.com/articles/2025/09/a_thumbnail_history_of_america_s_decline.html",
    "timestamp": "2025-09-21T04:00:00Z"
  },
  {
    "title": "Don't make it look like Democrats have moral high ground on justice",
    "description": "Conservatives have spent years arguing that Democrats weaponize government, from the IRS to the Justice Department. If Republicans mimic those tactics, they don’t just risk losing the moral high ground; they also risk validating the left’s narrative.",
    "link": "https://www.americanthinker.com/blog/2025/09/don_t_make_it_look_like_democrats_have_moral_high_ground_on_justice.html",
    "timestamp": "2025-09-21T04:00:00Z"
  },
  {
    "title": "Trump nominates senior White House aide for top federal prosecutor in Virginia",
    "description": "President Donald Trump nominated a senior White House aide as the top federal prosecutor for the Eastern District of Virginia after its U.S. attorney was pushed out on Friday.",
    "link": "https://www.foxnews.com/politics/trump-nominates-senior-white-house-aide-top-federal-prosecutor-virginia",
    "timestamp": "2025-09-21T03:59:47Z"
  },
  {
    "title": "Charlie Kirk’s legacy finds a place in Russian orthodox church publication, assassinated TPUSA co-founder honored for contributions to Christianity with “deepest respect”",
    "description": "A Russian Orthodox Church publication, overseen by Bishop Tikhon, has honored the late Charlie Kirk for his contributions to Christianity. The article highlights Kirk's impact on Christian communities and his advocacy for conservative Christian ideals. Kirill…",
    "link": "https://economictimes.indiatimes.com/news/international/us/charlie-kirks-legacy-finds-a-place-in-russian-orthodox-church-publication-assassinated-tpusa-co-founder-honored-for-contributions-to-christianity-with-deepest-respect/articleshow/124023627.cms",
    "timestamp": "2025-09-21T03:54:16Z"
  },
  {
    "title": "H-1B fee deepens sell-off fears for already battered Indian IT stocks. What to expect on Monday?",
    "description": "Indian IT stocks came under pressure after US President Donald Trump announced a steep hike in H-1B visa fees to $100,000 per year. While the increase applies only to fresh applications, it has rattled investors given that over 70% of H-1B holders are Indians…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/h-1b-fee-deepens-sell-off-fears-for-already-battered-indian-it-stocks-what-to-expect-on-monday/articleshow/124023691.cms",
    "timestamp": "2025-09-21T03:50:12Z"
  },
  {
    "title": "Trump border czar Tom Homan reportedly accepted $50,000 in cash from undercover FBI agents (The Guardian)",
    "description": "The Guardian:\nTrump border czar Tom Homan reportedly accepted $50,000 in cash from undercover FBI agents  —  Alleged handoff occurred before Trump won second presidency, after which administration killed federal corruption case  —  The FBI reportedly recorded…",
    "link": "https://www.memeorandum.com/250920/p80",
    "timestamp": "2025-09-21T03:50:00Z"
  },
  {
    "title": "With cash and aid, Saudi Arabia pursues soft power push in Syria",
    "description": "After losing his arms in an ordnance explosion, Syrian teenager Mohammed Hasram was fitted with prosthetic limbs funded by Saudi Arabia, which is leveraging ...",
    "link": "https://www.yahoo.com/news/articles/cash-aid-saudi-arabia-pursues-034718109.html",
    "timestamp": "2025-09-21T03:47:18Z"
  },
  {
    "title": "Who is Joshua Runkles, the armed man posing as law enforcement detained ahead of Charlie Kirk’s funeral where Trump will speak",
    "description": "Joshua Runkles was arrested at State Farm Stadium. He posed as a law enforcement officer. The stadium is the venue for Charlie Kirk's memorial. Runkles had a Glock pistol, a revolver, and knives. He claimed to work security for Turning Point USA. Secret Servi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-joshua-runkles-the-armed-man-posing-as-law-enforcement-detained-ahead-of-charlie-kirks-funeral-where-trump-will-speak/articleshow/124023567.cms",
    "timestamp": "2025-09-21T03:38:43Z"
  },
  {
    "title": "Trump's pardons cost victims and taxpayers $1.3 billion, House Judiciary Committee Democrats' review says",
    "description": "President Trump's flurry of recent presidential pardons has cost crime victims and taxpayers approximately $1.3 billion in restitution and payments, according to a review by House Judiciary Democrats. The pardons absolved hundreds of convicted criminals from …",
    "link": "https://freerepublic.com/focus/f-news/4341835/posts",
    "timestamp": "2025-09-21T03:34:36Z"
  },
  {
    "title": "Pentagon steps up media restrictions, now requiring approval before reporting even unclassified info",
    "description": "The Pentagon is stepping up restrictions on the media by requiring journalists to sign a pledge not to report on information that has not been authorized for release, including unclassified information.",
    "link": "https://www.news4jax.com/business/2025/09/21/pentagon-steps-up-media-restrictions-now-requiring-approval-before-reporting-even-unclassified-info/",
    "timestamp": "2025-09-21T03:30:33Z"
  },
  {
    "title": "Charlie Kirk Memorial Service: Confusion over armed man at memorial site uncovers security concerns; Turning Point USA clarifies following arrest",
    "description": "A man named Joshua Runkles was arrested at State Farm Stadium. He had weapons and falsely claimed to be a law enforcement officer. The arrest occurred before Charlie Kirk's memorial service. Runkles was doing advance security for a guest. Authorities beefed u…",
    "link": "https://economictimes.indiatimes.com/news/international/us/charlie-kirk-memorial-service-confusion-over-armed-man-at-memorial-site-uncovers-security-concerns-turning-point-usa-clarifies-following-arrest/articleshow/124023484.cms",
    "timestamp": "2025-09-21T03:28:47Z"
  },
  {
    "title": "Prime Minister Anthony Albanese touches down in US for delicate diplomacy mission",
    "description": "The prime minister will walk the diplomatic tight rope as he prepares to depart from US policy in recognising the state of Palestine.",
    "link": "https://7news.com.au/news/prime-minister-anthony-albanese-touches-down-in-us-for-delicate-diplomacy-mission-c-20092427",
    "timestamp": "2025-09-21T03:27:27Z"
  },
  {
    "title": "US says $100,000 fee for H-1B visas will not apply to existing holders",
    "description": "As Trump's order stirs anxiety, White House says the fee applies to new applicants and will be levied per application.",
    "link": "https://www.aljazeera.com/news/2025/9/21/us-says-100000-fee-for-h-1b-visas-will-not-apply-to-existing-holders",
    "timestamp": "2025-09-21T03:25:28Z"
  },
  {
    "title": "트럼프, 시진핑 정상회담 앞두고 아프카니스탄 공군기지 되찾겠다",
    "description": "President Donald Trump urged Afghanistan to return the Bagram air base to US control, threatening “BAD THINGS” for the Taliban-led country if it fails to comply https://t.co/cNKxfp48P3— Bloomberg (@business) September 20, 2025 트럼프가 중국 '핵무기' 제조시설과 1시간 거리의 아프카니…",
    "link": "https://ryueyes11.tistory.com/511879",
    "timestamp": "2025-09-21T03:25:10Z"
  },
  {
    "title": "‘They Think We’re Stupid.’ NAMB Response to SBC Pastor Who Trashed Charlie Kirk Universally Panned",
    "description": "The North American Mission Board has responded after an SBC pastor, who is speaking at their upcoming event, criticized Charlie Kirk during his recent sermon by insulting his character and implying that because he lived by the sword, he died by the sword. Jam…",
    "link": "https://freerepublic.com/focus/f-religion/4341833/posts",
    "timestamp": "2025-09-21T03:22:47Z"
  },
  {
    "title": "Charlie Kirk funeral: Over 100,000 mourners across U.S including President Donald Trump, VP JD Vance to attend Kirk memorial at State Farm Stadium in Arizona",
    "description": "Charlie Kirk funeral: Donald Trump, JD Vance and Charlie Kirk's widow, Erika, will speak. Also in attendance will be Secretary of State Marco Rubio, Defense Secretary Pete Hegseth, Health Secretary Robert F. Kennedy Jr. and Tulsi Gabbard, the director of nati…",
    "link": "https://economictimes.indiatimes.com/news/international/us/charlie-kirk-funeral-over-100000-mourners-across-u-s-including-president-donald-trump-vp-jd-vance-to-attend-kirk-memorial-at-state-farm-stadium-in-arizona/articleshow/124023485.cms",
    "timestamp": "2025-09-21T03:21:27Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,305",
    "description": "Here are the key events on day 1,305 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/9/21/russia-ukraine-war-list-of-key-events-day-1305",
    "timestamp": "2025-09-21T03:03:57Z"
  },
  {
    "title": "Trump hounds Bondi to prosecute adversaries in now-deleted social media post: 'They're all guilty as hell'",
    "description": "President Donald Trump put the heat on Attorney General Pam Bondi Saturday, demanding the prosecution of a list of adversaries in a social media post that he quickly deleted. In a now-deleted Truth Social post, the president called for charges against former …",
    "link": "https://freerepublic.com/focus/f-news/4341832/posts",
    "timestamp": "2025-09-21T03:02:36Z"
  },
  {
    "title": "Trump: Important announcement on Autism on Monday",
    "description": "United States President Donald Trump stated that there would be a very important announcement on Autism on Monday.\"We have to make the announcement,\" Trump said during the dinner, stating that he didn...",
    "link": "https://biztoc.com/x/0ba931c06a13e6f7",
    "timestamp": "2025-09-21T03:01:17Z"
  }
]