[
  {
    "title": "‘I Think You’re Full Of Crap’: Biden’s Fmr Assistant Gets Earful From Sean Hannity",
    "description": "Sean Hannity halted former Biden special assistant after he attempted to defend the former president’s mental fitness, calling him \"full of crap.\"",
    "link": "https://dailycaller.com/2025/06/03/sean-hannity-biden-assistant-michael-larosa-mental-fitness-white-house-fox-news/",
    "timestamp": "2025-06-03T04:56:03Z"
  },
  {
    "title": "CNET's Daily Tariff Price Tracker: I'm Watching 11 Key Products for Price Hikes",
    "description": "Even as the legal fate of Trump's tariff barrage is still up in the air, CNET is tracking any price moves that might result from it.",
    "link": "https://www.cnet.com/tech/cnets-daily-tariff-price-tracker-im-watching-11-key-products-for-price-hikes/",
    "timestamp": "2025-06-03T04:55:00Z"
  },
  {
    "title": "Chuck Todd Reveals Trump Namedrop Led To Alarming Attack Outside D.C. Home",
    "description": "The former \"Meet the Press\" host reminded the president of the \"problem\" with his public insults.",
    "link": "https://www.huffpost.com/entry/chuck-todd-tires-slashed-trump-name-check-attack_n_683e64c7e4b00333c9603021",
    "timestamp": "2025-06-03T04:54:43Z"
  },
  {
    "title": "Man accused of framing other man for deportation by writing letters threatening Trump's life",
    "description": "A Wisconsin man is facing charges accusing him of forging letters threatening President Donald Trump’s life in an effort to get another man deported",
    "link": "https://abcnews.go.com/US/wireStory/man-accused-framing-man-deportation-writing-letters-threatening-122437297",
    "timestamp": "2025-06-03T04:54:28Z"
  },
  {
    "title": "US President Trump, Chinese counterpart Xi “likely” to hold talks this week: White House",
    "description": "WASHINGTON DC: US President Donald Trump and his Chinese counterpart Xi Jinping are “likely” to hold talks this week, White House Press Secretary Karoline Leavitt said on Monday (local time), ABC News reported. While speaking to reporters, Leavitt said that t…",
    "link": "https://english.khabarhub.com/2025/03/473381/",
    "timestamp": "2025-06-03T04:45:51Z"
  },
  {
    "title": "In Canada lake, robot learns to mine without disrupting marine life",
    "description": "COLLINGWOOD (CANADA) - Three robotic arms extended under the water in a Canadian lake, delicately selecting pebbles from the bed, before storing them back inside the machine.",
    "link": "https://www.bangkokpost.com/world/3040902/in-canada-lake-robot-learns-to-mine-without-disrupting-marine-life",
    "timestamp": "2025-06-03T04:45:00Z"
  },
  {
    "title": "What we can learn about Xi's rule by studying his father's life",
    "description": "A new biography explores the life of Xi Zhongxun, father of China's current leader, Xi Jinping. It examines why Xi Jinping's rule echoes Mao's autocracy, despite his father's reformist ideals. The book reveals the inherent contradictions within the Chinese Co…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/what-we-can-learn-about-xis-rule-by-studying-his-fathers-life/articleshow/121587070.cms",
    "timestamp": "2025-06-03T04:41:10Z"
  },
  {
    "title": "One of the Alleged New Orleans Jail Escapees Pleads With NBA YoungBoy and Donald Trump for Help",
    "description": "An alleged video of escapee Antoine Massey claiming his innocence is circulating online.",
    "link": "https://www.complex.com/life/a/alex-ocho/alleged-new-orleans-jail-escapees-pleads-nba-youngboy-donald-trump",
    "timestamp": "2025-06-03T04:39:31Z"
  },
  {
    "title": "Jon Stewart Tackles Elon Musk’s Exit From the Trump Administration: ‘This Guy Has Seen Some S–t’",
    "description": "On this week’s episode of “The Daily Show,” Jon Stewart covered the end of Elon Musk’s chapter with D.O.G.E. and the Trump administration. On May 28, Musk’s time as Donald Trump’s “special government employee” came to a close after 128 days. Per the U.S. Depa…",
    "link": "https://variety.com/2025/tv/news/jon-stewart-elon-musk-exit-trump-doge-the-daily-show-1236416529/",
    "timestamp": "2025-06-03T04:35:04Z"
  },
  {
    "title": "US pushes countries for best offers by Wednesday as tariff deadline looms",
    "description": "It was unclear which countries would receive the letter, but it was directed at those with active negotiations that included meetings and exchanges of documents - European Union, Japan, Vietnam and India",
    "link": "https://www.thehindubusinessline.com/news/world/us-pushes-countries-for-best-offers-by-wednesday-as-tariff-deadline-looms/article69651238.ece",
    "timestamp": "2025-06-03T04:29:45Z"
  },
  {
    "title": "RBA Opts for Quarter-Point Cut to Navigate Uncertain Outlook",
    "description": "Australia’s central bank discussed the case to cut interest rates by an outsized half-percentage point last month, highlighting that a larger reduction would provide greater insurance for the economy against any major US-led trade upheaval.",
    "link": "https://financialpost.com/pmn/business-pmn/rba-opts-for-quarter-point-cut-to-navigate-uncertain-outlook",
    "timestamp": "2025-06-03T04:29:44Z"
  },
  {
    "title": "Top Trump officials visit prolific Alaska oil field amid push to expand drilling",
    "description": "President Donald Trump wants to double the amount of oil coursing through Alaska's vast pipeline system and build a massive natural gas project, a top administration official said Monday.",
    "link": "https://www.npr.org/2025/06/03/nx-s1-5421353/trump-officials-alaska-oil-field-drilling",
    "timestamp": "2025-06-03T04:28:39Z"
  },
  {
    "title": "China Private Factory Gauge Plunges to Weakest in Over Two Years",
    "description": "(Bloomberg) -- China’s manufacturing sector had its worst slump since September 2022, according to a private survey, as higher US tariffs took a toll on...",
    "link": "https://finance.yahoo.com/news/china-private-factory-gauge-plunges-025145283.html",
    "timestamp": "2025-06-03T04:23:20Z"
  },
  {
    "title": "Megyn Kelly Guest Says Chris Cuomo ‘Can Screw Off’ After ‘Insane’ Monologue About Laken Riley, Illegal Immigration",
    "description": "Megyn Kelly guest Emily Jashinsky said Chris Cuomo can \"screw off\" after his \"insane\" take on the death of Laken Riley and illegal immigration in the U.S.",
    "link": "https://dailycaller.com/2025/06/03/megyn-kelly-guest-chris-cuomo-laken-riley-criminal-illegal-migrants-deportations/",
    "timestamp": "2025-06-03T04:19:33Z"
  },
  {
    "title": "TSMC to Trump: $100B project hardly in five years",
    "description": "Taiwan Semiconductor Manufacturing Company Limited (TSMC) Chief Executive Officer (CEO) C. C. Wei (pictured) revealed during a Tuesday shareholder meeting that he told United States President Donald T...",
    "link": "https://biztoc.com/x/7438fce332036f51",
    "timestamp": "2025-06-03T04:18:01Z"
  },
  {
    "title": "Challenge by X to Irish media regulator’s online safety rules set to begin this week",
    "description": "Coimisiún na Meán to contest claims it engaged in regulatory overreach in parts of new online safety code",
    "link": "https://www.irishtimes.com/business/2025/06/03/challenge-by-x-to-irish-media-regulators-online-safety-rules-set-to-begin-this-week/",
    "timestamp": "2025-06-03T04:15:00Z"
  },
  {
    "title": "South Korea votes for new president after failed martial law bid",
    "description": "Millions vote for a new president, after six months of turmoil sparked by a failed martial law attempt and the impeachment of former leader Yoon Suk Yeol.",
    "link": "https://www.bbc.com/news/live/ce81gnvzmr6t?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-06-03T04:14:41Z"
  },
  {
    "title": "Jon Stewart Jokes That the More Karoline Leavitt Lies, the Bigger Her Cross Gets",
    "description": "Stewart roasts the White House Press Secretary as the falsehoods pile up",
    "link": "https://www.cracked.com/article_46833_jon-stewart-jokes-that-the-more-karoline-leavitt-lies-the-bigger-her-cross-gets.html",
    "timestamp": "2025-06-03T04:11:00Z"
  },
  {
    "title": "President Trump deeply admires, respects India, we are going to have great relationship together: Commerce Secretary Lutnick",
    "description": "US Commerce Secretary Howard Lutnick emphasized India's thriving economy, driven by its people's ambition, and highlighted President Trump's admiration for India, anticipating a strong bilateral relationship. Lutnick also introduced the 'Trump Gold Card' to f…",
    "link": "https://economictimes.indiatimes.com/news/india/president-trump-deeply-admires-respects-india-we-are-going-to-have-great-relationship-together-commerce-secretary-lutnick/articleshow/121586296.cms",
    "timestamp": "2025-06-03T04:08:59Z"
  },
  {
    "title": "Two Visions Collide on Ocean Use: Nationalist Raptors and Multilateral Environmentalists",
    "description": "The ocean holds the answer. By Shafraz Rasheed | May 27, 2025 ( Foreign Policy in Focus) - The rise of nationalist leaders epitomized by Donald Trump’s withdrawal from the Paris Agreement, cuts to UN climate funding, and dismissal of multilateralism as “globa…",
    "link": "https://www.juancole.com/2025/06/multilateral-environmentalism-nationalist.html",
    "timestamp": "2025-06-03T04:06:52Z"
  },
  {
    "title": "OAN’s Pentagon reporter learns the limits of expressing her own opinion",
    "description": "Assigned to cover the Pentagon for the conservative outlet One America News Network, Gabrielle Cuccia didn’t pretend to be an unbiased reporter. She describes herself as “a MAGA girl” who is unapologetically defiant in her support of President Donald Trump. Y…",
    "link": "https://financialpost.com/pmn/oans-pentagon-reporter-learns-the-limits-of-expressing-her-own-opinion",
    "timestamp": "2025-06-03T04:05:49Z"
  },
  {
    "title": "EU Says it Will Make Strong Case for US Tariff Cuts This Week",
    "description": "The European Commission said on Monday it would make a strong case this week for the United States to reduce or eliminate tariffs even after Donald Trump said he would double import duties on steel and aluminum to 50%. European …",
    "link": "https://www.insurancejournal.com/news/international/2025/06/03/826025.htm",
    "timestamp": "2025-06-03T04:04:39Z"
  },
  {
    "title": "Haiti Is Burning, but There Is a Path Forward",
    "description": "A successful intervention will provide a model for solving other crises in an era of fraying multilateralism.",
    "link": "http://foreignpolicy.com/2025/06/03/haiti-blackwater-international-peacekeeping-mission/",
    "timestamp": "2025-06-03T04:01:13Z"
  },
  {
    "title": "The Widening Gyre",
    "description": "Do you hear those alarm bells ringing? Looks like June is bustin’ out all over, as the old Broadway ditty goes. Bedlam is in the air, and in more varieties than Heinz has pickles. Take your pick: civil war blooming in France and the UK, maybe even Germany — i…",
    "link": "https://www.lewrockwell.com/2025/06/james-howard-kunstler/the-widening-gyre/",
    "timestamp": "2025-06-03T04:01:00Z"
  },
  {
    "title": "US: Bans on Gender-Affirming Care Harm Trans Youth",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Lily, a 10-year-old trans girl, said she was devastated when her family felt forced to relocate to protect her from anti-trans hostility.\n © 2025 Illustrations by Barrack Rima, Art directed by Studio Safar for Human …",
    "link": "https://www.hrw.org/news/2025/06/03/us-bans-gender-affirming-care-harm-trans-youth",
    "timestamp": "2025-06-03T04:00:01Z"
  },
  {
    "title": "Michelle, (you’re not) my belle",
    "description": "Here in Texas, we’ve had the pleasure of having two Bush ladies enjoying their post-presidency years.  Barbara was a charmer and Laura is equally charming.  My favorite part is that they stick to charities, or sitting next to their fo...",
    "link": "https://www.americanthinker.com/blog/2025/06/michelle_you_re_not_my_belle.html",
    "timestamp": "2025-06-03T04:00:00Z"
  },
  {
    "title": "The soldier who said no",
    "description": "On May 29, 2025, President Donald J. Trump issued a full and unconditional pardon to First Lieutenant Mark Bashaw -- the only service member in U.S. military history court-martialed for refusing to comply with unlawful COVID-19 mandates. It was a lon...",
    "link": "https://www.americanthinker.com/blog/2025/06/the_soldier_who_said_no.html",
    "timestamp": "2025-06-03T04:00:00Z"
  },
  {
    "title": "Donald Trump and the ship of state",
    "description": "Roger Kimball is one of the most thoughtful Americans in public life today.  Everything he writes deserves to be carefully read and thoughtfully considered.\r\n\r\nHe has done it again with his new article, “What Is American Conservatism?...",
    "link": "https://www.americanthinker.com/blog/2025/06/donald_trump_and_the_ship_of_state.html",
    "timestamp": "2025-06-03T04:00:00Z"
  },
  {
    "title": "Why Democrats are now focusing on Joe Biden’s dementia",
    "description": "Since 2019, Conservatives have discussed Joe Biden’s obvious dementia issues. It’s been there for everyone in the world to see (including our enemies). Yet leftists only noticed Joey’s dementia after his disastrous June 2024 debate ...",
    "link": "https://www.americanthinker.com/blog/2025/06/why_democrats_are_now_focusing_on_joe_biden_s_dementia.html",
    "timestamp": "2025-06-03T04:00:00Z"
  },
  {
    "title": "Let’s Create a Populist Nationalist Narrative",
    "description": "Dominic Cummings is a Brit troublemaker who anchored the Brexit campaign in 2016, and he runs a Substack.\r\n\r\nLast week he posted a piece on regime change in Britain. He writes that the ruling class in Britain is afraid. Of Muslim rape gangs? No. Of &...",
    "link": "https://www.americanthinker.com/articles/2025/06/let_s_create_a_populist_nationalist_narrative.html",
    "timestamp": "2025-06-03T04:00:00Z"
  },
  {
    "title": "The Media’s Catch-22: Exposing Joe Biden Would Have Assured Trump’s Re-election",
    "description": "The legacy media finds itself in a dilemma of its own making. The depth and seriousness of Joe Biden’s mental and physical problems during his presidency are being exposed daily—ironically, much of it by the denizens of the legacy media a...",
    "link": "https://www.americanthinker.com/articles/2025/06/the_media_s_catch_22_exposing_joe_biden_would_have_assured_trump_s_re_election.html",
    "timestamp": "2025-06-03T04:00:00Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,195",
    "description": "These are the key events on day 1,195 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/6/3/russia-ukraine-war-list-of-key-events-day-1195",
    "timestamp": "2025-06-03T03:58:53Z"
  },
  {
    "title": "For Syria, Qatar's $7 billion power plan hinges on it fixing its grid",
    "description": "Years of neglect have left the sprawling network of transformer stations and towers stripped as looters continue to steal cables and other components.",
    "link": "https://www.japantimes.co.jp/news/2025/06/03/world/politics/syria-qatar-power-grid/",
    "timestamp": "2025-06-03T03:52:00Z"
  },
  {
    "title": "Jon Stewart Celebrates Elon Musk’s Departure From Government, Says Trump Has “Broken” The “Poor Bastard”",
    "description": "Back from the holiday break, Jon Stewart wasted no time as he dug into recent headlines, dedicating a majority of his segment to Elon Musk’s departure from the Oval Office and his so-called Department of Government Efficiency. “Speaking of misanthropic data-h…",
    "link": "http://deadline.com/2025/06/jon-stewart-elon-musk-departure-government-trump-1236421420/",
    "timestamp": "2025-06-03T03:49:55Z"
  },
  {
    "title": "Asian markets rise as US stock indexes near records amid easing trade tensions",
    "description": "Shares are higher in Asia after U.S. stock indexes drifted closer to records",
    "link": "https://abcnews.go.com/Business/wireStory/asian-markets-rise-us-stock-indexes-records-amid-122436753",
    "timestamp": "2025-06-03T03:42:17Z"
  },
  {
    "title": "Trump judge blocks Alien Enemies Act deportations in central California",
    "description": "A Trump-appointed judge in California on Monday blocked the Alien Enemies Act deportation of a Venezuelan migrant in the Los Angeles area, saying the...",
    "link": "https://www.upi.com/Top_News/US/2025/06/02/california-judge-aliens-enemies-act-trump-administration/9221748919510/",
    "timestamp": "2025-06-03T03:34:27Z"
  },
  {
    "title": "New York Gov. Kathy Hochul Is Getting Primaried By Her Deputy",
    "description": "Lt. Gov. Antonio Delgado is launching a campaign against his current boss — citing a lack of \"decisive\" leadership.",
    "link": "https://www.huffpost.com/entry/antonio-delgado-kathy-hochul-new-york-governor-primary_n_683e5fd1e4b08b77a46144bd",
    "timestamp": "2025-06-03T03:33:58Z"
  },
  {
    "title": "Is Birthright Citizenship A National Suicide Pact?",
    "description": "Is Birthright Citizenship A National Suicide Pact?\n \nAuthored by Frank Miele via RealClearPolitics,\nOn the day of his second inauguration, President Donald Trump issued an executive order entitled “Protecting the Meaning and Value of American Citizenship.”\nSo…",
    "link": "https://biztoc.com/x/49c523a203fb1993",
    "timestamp": "2025-06-03T03:33:14Z"
  },
  {
    "title": "Top Trump officials visit prolific Alaska oil field amid push to expand drilling (Associated Press)",
    "description": "Associated Press:\nTop Trump officials visit prolific Alaska oil field amid push to expand drilling  —  President Donald Trump wants to double the amount of oil coursing through Alaska's vast pipeline system and build a massive natural gas project as its “big,…",
    "link": "https://www.memeorandum.com/250602/p153",
    "timestamp": "2025-06-03T03:30:00Z"
  },
  {
    "title": "Man accused of framing other man for deportation by writing letters threatening Trump's life",
    "description": "A Wisconsin man is facing charges accusing him of forging a letter threatening President Donald Trump's life in an effort to get another man deported...",
    "link": "https://www.yahoo.com/news/man-accused-framing-other-man-032944459.html",
    "timestamp": "2025-06-03T03:29:44Z"
  },
  {
    "title": "Ari Melber Argues Elon Musk Exit Shows Some Pressure Against Trump ‘Is Actually Working’ | Video",
    "description": "\"Real world, external forces can also push back\" on Trump, the MSNBC says\nThe post Ari Melber Argues Elon Musk Exit Shows Some Pressure Against Trump ‘Is Actually Working’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/ari-melber-pressure-is-actually-working-on-trump-musk-msnbc/",
    "timestamp": "2025-06-03T03:26:35Z"
  },
  {
    "title": "Ukraine and Russia agree to swap dead and wounded troops but report no progress toward ending war",
    "description": "Russia and Ukraine met for peace talks, but failed to achieve a breakthrough. They agreed to exchange dead soldiers and wounded troops. Prior to the meeting, Ukraine launched drone attacks on Russian air bases. Russia responded with a large drone attack on Uk…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-and-russia-agree-to-swap-dead-and-wounded-troops-but-report-no-progress-toward-ending-war/articleshow/121585494.cms",
    "timestamp": "2025-06-03T03:20:48Z"
  },
  {
    "title": "Tusk calls confidence vote after nationalist wins Polish presidential election",
    "description": "European far-right leaders welcomed the election of Karol Nawrocki, a fan of U.S. President Donald Trump who has said he will oppose the government's progressive agenda.",
    "link": "https://www.japantimes.co.jp/news/2025/06/03/world/politics/polish-pm-confidence-vote-nationalist/",
    "timestamp": "2025-06-03T03:19:00Z"
  },
  {
    "title": "Asian markets rise as traders eye possible Trump-Xi talks",
    "description": "Asian stocks rallied Tuesday as investors kept tabs on developments in the China-US trade war amid speculation the countries’ leaders will hold talks soon. After a period of relative calm on the tariff front, Donald Trump at the weekend accused Beijing of vio…",
    "link": "https://www.digitaljournal.com/world/asian-markets-rise-as-traders-eye-possible-trump-xi-talks/article",
    "timestamp": "2025-06-03T03:17:32Z"
  },
  {
    "title": "US Secretary Howard Lutnick was very positive about India-US equation: Kumar Mangalam Birla",
    "description": "Kumar Mangalam Birla expressed optimism about India-US trade relations following Howard Lutnick's positive remarks on the partnership. Lutnick highlighted the strong friendship between Prime Minister Modi and President Trump, anticipating a trade deal soon. U…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-secretary-howard-lutnick-was-very-positive-about-india-us-equation-kumar-mangalam-birla/articleshow/121585430.cms",
    "timestamp": "2025-06-03T03:17:15Z"
  },
  {
    "title": "Asian markets rise as traders eye possible Trump-Xi talks",
    "description": "Asian stocks rallied Tuesday as investors kept tabs on developments in the China-US trade war amid speculation the countries' leaders will hold talks...",
    "link": "https://www.yahoo.com/news/asian-markets-rise-traders-eye-031626335.html",
    "timestamp": "2025-06-03T03:16:26Z"
  },
  {
    "title": "Trump administration files appeal to Supreme Court over federal mass firings",
    "description": "SAN FRANCISCO, June 2 (Xinhua) -- The U.S. Trump administration on Monday filed an appeal with the S",
    "link": "http://en.people.cn/n3/2025/0603/c90000-20322753.html",
    "timestamp": "2025-06-03T03:13:19Z"
  },
  {
    "title": "Asian shares dither, U.S. dollar falls as trade angst persists amid tariffs",
    "description": "Asia shares edged cautiously higher on Tuesday while the U.S. dollar fell to a six-week low as the country’s erratic trade policies clouded over markets and investors turned defensive ahead of key developments later in the week.\nU.S. President Donald Trump an…",
    "link": "https://biztoc.com/x/0f36871eb6455085",
    "timestamp": "2025-06-03T03:10:59Z"
  },
  {
    "title": "Conservative Bill Kristol Flames ‘Ridiculous’ ICE Agents Wearing Masks: ‘It’s for Intimidation’",
    "description": "Conservative Bill Kristol ripped federal law enforcement officials who wear masks while they arrest immigrants.\nThe post Conservative Bill Kristol Flames ‘Ridiculous’ ICE Agents Wearing Masks: ‘It’s for Intimidation’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/bill-kristol-flames-ridiculous-ice-agents-wearing-masks-its-for-intimidation/",
    "timestamp": "2025-06-03T03:09:38Z"
  },
  {
    "title": "CDC Decides America’s Children Could Do With More Lead In Their Blood",
    "description": "With all the conversations we’ve had in the past few months about the decline of the Department of Health and Human Services (HHS) under the leadership, or lack thereof, of RFK Jr. and Donald Trump, you might have been left with the impression that everything…",
    "link": "https://www.techdirt.com/2025/06/02/cdc-decides-americas-children-could-do-with-more-lead-in-their-blood/",
    "timestamp": "2025-06-03T03:02:41Z"
  },
  {
    "title": "Is Netanyahu also attempting to cover up an 'original sin' of his own?",
    "description": "Joe Biden's secrecy about his health casts him as a liar and schemer, reminiscent of Benjamin Netanyahu, while Israelis still receive no regular health updates on their prime minister",
    "link": "https://www.haaretz.com/opinion/2025-06-03/ty-article-opinion/.premium/is-netanyahu-also-attempting-to-cover-up-an-original-sin-of-his-own/00000197-3231-dd58-add7-33f3fb110000",
    "timestamp": "2025-06-03T03:01:38Z"
  },
  {
    "title": "Lawsuit Against Trans Athlete In Women’s Sports Has One Highly Unexpected Component, AFPI Counsel Says",
    "description": "AFPI's Jessica Steinmann said in addition to filing a Title IX complaint, she is also requesting they investigate a potential First Amendment violation.",
    "link": "https://dailycaller.com/2025/06/02/complaint-trans-athlete-womens-sports-oregon-afpi-department-education/",
    "timestamp": "2025-06-03T02:59:57Z"
  },
  {
    "title": "The flames in Boulder are extinguished, but the hateful ideology behind them smolders",
    "description": "Protecting Jews’ right to walk, pray, and speak without fear is not a favor to one minority; it is a test of America’s democratic spine.",
    "link": "https://www.jpost.com/opinion/article-856303",
    "timestamp": "2025-06-03T02:59:10Z"
  },
  {
    "title": "Trump’s fresh White House portrait sparks interest amid controversy over National Portrait Gallery leadership",
    "description": "President Donald Trump's new White House portrait is revealed days after he dismissed Kim Sajet from head of the National Portrait Gallery, citing her support for DEI.",
    "link": "https://www.foxnews.com/politics/trumps-fresh-white-house-portrait-sparks-interest-amid-controversy-over-national-portrait-gallery-leadership",
    "timestamp": "2025-06-03T02:58:51Z"
  },
  {
    "title": "Aiming a blow at narcos, Colombia pays farmers to uproot coca",
    "description": "With cocaine production at an all-time high, Colombia’s government is testing a pacific approach to its narcotics problem: paying farmers to uproot crops of coca, the drug’s main ingredient. Among the beneficiaries are Alirio Caicedo and his son Nicolas, who …",
    "link": "https://www.digitaljournal.com/world/aiming-a-blow-at-narcos-colombia-pays-farmers-to-uproot-coca/article",
    "timestamp": "2025-06-03T02:52:32Z"
  },
  {
    "title": "Donald Trump Shoots Down Rumor He Applied to Harvard",
    "description": "President Donald Trump said it is \"totally FALSE\" that he ever applied to the Ivy League university.",
    "link": "https://biztoc.com/x/bda4144a20d9ac87",
    "timestamp": "2025-06-03T02:48:24Z"
  },
  {
    "title": "Donald Trump Shoots Down Rumor He Applied to Harvard",
    "description": "President Donald Trump said it is \"totally FALSE\" that he ever applied to the Ivy League university.",
    "link": "https://www.newsweek.com/donald-trump-shoots-down-rumor-he-applied-harvard-2080095",
    "timestamp": "2025-06-03T02:47:17Z"
  },
  {
    "title": "US Reinstates Funding to Propaganda Outlet NED",
    "description": "National Endowment for Democracy weaponizes “democracy” in Venezuela, Nicaragua and Cuba The brief freeze and rapid partial reinstatement of National Endowment for Democracy (NED) funding in early 2025 helped expose it as a US regime-change tool. Created to r…",
    "link": "https://www.activistpost.com/us-reinstates-funding-to-propaganda-outlet-ned/",
    "timestamp": "2025-06-03T02:45:00Z"
  },
  {
    "title": "Adani Group stocks in focus amid US scrutiny over suspected Iranian LPG imports via Mundra Port",
    "description": "A WSJ report claimed US prosecutors are investigating alleged Iranian LPG imports via the Mundra port. The group denied all allegations, calling the report baseless and stating strict adherence to sanctions and compliance policies. The US Justice Department i…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-stocks-in-focus-amid-us-scrutiny-over-suspected-iranian-lpg-imports-via-mundra-port/articleshow/121584438.cms",
    "timestamp": "2025-06-03T02:39:18Z"
  },
  {
    "title": "The White House unveils Donald Trump's new official presidential portrait; BUT Grok paints it better!",
    "description": "Donald Trump's new official presidential portrait, featuring him in a blue suit and red tie against a black background, was unveiled, sparking internet memes. Grok, an AI chatbot, was prompted to create humorous variations, depicting Trump as a clown, a marbl…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/the-white-house-unveils-donald-trumps-new-official-presidential-portrait-but-grok-paints-it-better/articleshow/121584335.cms",
    "timestamp": "2025-06-03T02:39:06Z"
  },
  {
    "title": "For volatile Trump, trade pacts with China, Europe prove elusive",
    "description": "U.S. President Donald Trump is eager to land more trade deals, but talks with China and Europe continue to languish amid communications breakdowns and fresh tariff threats.\nSo far, there have been few signs of a breakthrough with either of America's two bigge…",
    "link": "https://biztoc.com/x/bed7fa058140941a",
    "timestamp": "2025-06-03T02:37:06Z"
  },
  {
    "title": "India’s Russian arms deals ‘rubbed US the wrong way’, but trends changing now: US Commerce Secretary Lutnick",
    "description": "At the US-India Strategic Partnership Forum in Washington, US Commerce Secretary Howard Lutnick confirmed that a bilateral trade deal with India is “not too distant”. He linked progress to India’s reduced defence purchases from Russia and its willingness to e…",
    "link": "https://economictimes.indiatimes.com/news/defence/indias-russian-arms-deals-rubbed-us-the-wrong-way-but-trends-changing-now-us-commerce-secretary-lutnick/articleshow/121583929.cms",
    "timestamp": "2025-06-03T02:36:55Z"
  },
  {
    "title": "DHS says FEMA head was joking when he said he wasn't aware of hurricane season",
    "description": "Acting Federal Emergency Management Agency Administrator David Richardson was joking when he said at a meeting Monday that he was not aware of the upcoming hurricane season, the Department of Homeland Security said in a statement.",
    "link": "https://www.nbcnews.com/politics/politics-news/dhs-says-fema-head-was-joking-said-wasnt-aware-hurricane-season-rcna210534",
    "timestamp": "2025-06-03T02:31:22Z"
  },
  {
    "title": "For volatile Trump, trade pacts with China, Europe prove elusive",
    "description": "So far, there has been few signs of a breakthrough with either of America's two biggest trading partners.",
    "link": "https://www.japantimes.co.jp/business/2025/06/03/economy/trump-trade-pacts-china-europe/",
    "timestamp": "2025-06-03T02:26:00Z"
  },
  {
    "title": "‘Partner With Me’: Fox News Guest Pitches Trump on ‘AI-Powered Threat Detection System’",
    "description": "Israeli special operations veteran Aaron Cohen used Fox News to pitch President Donald Trump on his \"AI-powered threat detection system\" for law enforcement.\nThe post ‘Partner With Me’: Fox News Guest Pitches Trump on ‘AI-Powered Threat Detection System’ firs…",
    "link": "https://www.mediaite.com/media/tv/partner-with-me-fox-news-guest-pitches-trump-on-ai-powered-threat-detection-system/",
    "timestamp": "2025-06-03T02:25:30Z"
  },
  {
    "title": "Asian markets rise as US stock indexes near records amid easing trade tensions",
    "description": "Shares rose early Tuesday in Asia after U.S. stock indexes drifted closer to records, while oil prices extended gains. Beijing and Washington dialed back trade friction as the U.S. extended exemptions for tariffs on some Chinese goods, including solar manufac…",
    "link": "https://financialpost.com/pmn/asian-markets-rise-as-us-stock-indexes-near-records-amid-easing-trade-tensions",
    "timestamp": "2025-06-03T02:22:34Z"
  },
  {
    "title": "TALKING POINTS: Dem Senator Chris Murphy Claims Republican Bill With Trump Tax Cuts Will Only Benefit the Super Rich (VIDEO)",
    "description": "Dem Senator Chris Murphy of Connecticut appeared on CNN over the weekend to talk about the ‘Big Beautiful Bill’ which contains the Trump tax cuts and did nothing but push left wing talking points.\nThe post TALKING POINTS: Dem Senator Chris Murphy Claims Repub…",
    "link": "https://www.thegatewaypundit.com/2025/06/talking-points-dem-senator-chris-murphy-claims-republican/",
    "timestamp": "2025-06-03T02:20:00Z"
  },
  {
    "title": "Asian markets rise as US stock indexes near records amid easing trade tensions",
    "description": "Shares rose early Tuesday in Asia after U.S. stock indexes drifted closer to records, while oil prices extended gains.  Beijing and Washington dialed back...",
    "link": "https://finance.yahoo.com/news/asian-markets-rise-us-stock-021800443.html",
    "timestamp": "2025-06-03T02:18:00Z"
  },
  {
    "title": "Polish nationalist Nawrocki wins presidency in setback for pro-EU government",
    "description": "In a victory for European conservatives inspired by US President Donald Trump, Nawrocki secured 50.89% of the vote, election commission data showed.",
    "link": "https://www.jpost.com/international/article-856319",
    "timestamp": "2025-06-03T02:17:30Z"
  },
  {
    "title": "China's factory activity cools in May as US tariffs hit",
    "description": "BEIJING: China's factory activity in May shrank for the first time in eight months, a private-sector survey showed on Tuesday (Jun 3), indicating US tariffs are now starting to directly hurt the manufacturing superpower. The Caixin/S&P Global manufacturing PM…",
    "link": "https://www.channelnewsasia.com/business/chinas-factory-activity-cools-may-us-tariffs-hit-5163556",
    "timestamp": "2025-06-03T02:15:07Z"
  },
  {
    "title": "U.S. aluminum and steel prices surge as Trump doubles tariffs",
    "description": "Futures tracking aluminum and steel prices in the U.S. surged after President Donald Trump said he will double tariffs on the metals this week.\nContracts linked to the prices that manufacturers pay to get aluminum delivered to the U.S. Midwest jumped 54% to t…",
    "link": "https://biztoc.com/x/4c18cf16d262c984",
    "timestamp": "2025-06-03T02:15:02Z"
  },
  {
    "title": "Sowell EXPOSES Top 10 WORST US Presidents in History | Thomas Sowell Today",
    "description": "Sowell's top 10 worst US presidents.I think he's nailed to top five. 1. bammy 2. LBJ 3. FDR 4. Wilson 5. Carter",
    "link": "https://freerepublic.com/focus/f-chat/4320652/posts",
    "timestamp": "2025-06-03T02:07:00Z"
  },
  {
    "title": "US pushes countries for best offers by Wednesday as tariff deadline looms",
    "description": "The Trump administration, aiming to meet a tight deadline, is pressing trade partners for their best offers on key trade areas by Wednesday. This push seeks to accelerate negotiations initiated in April, despite legal challenges to the tariffs underpinning th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-pushes-countries-for-best-offers-by-wednesday-as-tariff-deadline-looms/articleshow/121583979.cms",
    "timestamp": "2025-06-03T02:03:26Z"
  },
  {
    "title": "China's May factory activity unexpectedly shrinks, clocking its worst drop since 2022: Caixin",
    "description": "China has grappled with entrenched deflationary pressure, as a prolonged real estate downturn and job insecurity hampered investment, consumer spending.",
    "link": "https://www.cnbc.com/2025/06/03/chinas-may-factory-activity-unexpectedly-shrinks-clocking-its-worst-drop-in-nearly-3-years-caixin-.html",
    "timestamp": "2025-06-03T02:02:46Z"
  },
  {
    "title": "Donald Trump asks US Supreme Court to allow mass federal layoffs",
    "description": "The Trump administration has appealed to the US Supreme Court. They want to stop a court order. This order is blocking job cuts and changes in federal agencies. Earlier, a judge blocked these large-scale layoffs. The Justice Department argues the President ha…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-asks-us-supreme-court-to-allow-mass-federal-layoffs/articleshow/121583958.cms",
    "timestamp": "2025-06-03T02:01:39Z"
  },
  {
    "title": "Tampon Tim Walz Thinks He Has Figured Out Why So Many Young Men Voted for Trump (VIDEO)",
    "description": "Tim Walz really is an idiot.\nThe post Tampon Tim Walz Thinks He Has Figured Out Why So Many Young Men Voted for Trump (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/tampon-tim-walz-thinks-he-has-figured-why/",
    "timestamp": "2025-06-03T02:00:42Z"
  },
  {
    "title": "Elon Musk’s xAI launches $5B debt sale to fuel AI infrastructure investments",
    "description": "xAI Corp., the artificial intelligence startup founded by Elon Musk, is arranging a $5 billion debt sale that will help the company to keep up its lavish spending on data center infrastructure as it strives to keep pace with rivals such as OpenAI and Google L…",
    "link": "https://siliconangle.com/2025/06/02/elon-musks-xai-launches-5b-debt-sale-fuel-ai-infrastructure-investments/",
    "timestamp": "2025-06-03T02:00:03Z"
  },
  {
    "title": "U.S. aluminum and steel prices surge as Trump doubles tariffs",
    "description": "U.S. buyers could end up paying about 50% more than international competitors to get hold of aluminum.",
    "link": "https://www.japantimes.co.jp/business/2025/06/03/markets/us-aluminum-steel-trump-tariffs/",
    "timestamp": "2025-06-03T01:57:00Z"
  },
  {
    "title": "What if Google just broke itself up? A tech insider makes the case.",
    "description": "Google is facing antitrust pressure, with courts urging major divestitures. Analyst Gil Luria suggests a bold self-breakup could unlock $3.7 trillion in value and boost innovation. Historical parallels like AT&T and Microsoft show the risks of resistance. \"Th…",
    "link": "https://economictimes.indiatimes.com/tech/technology/what-if-google-just-broke-itself-up-a-tech-insider-makes-the-case-/articleshow/121583903.cms",
    "timestamp": "2025-06-03T01:57:00Z"
  },
  {
    "title": "Report: 'Thousands' of South African Refugees to Arrive in U.S. by End of Summer",
    "description": "\"Thousands\" of white South African refugees may be in the United States by the end of the summer as massive amounts of applications from Afrikaners — an ethnic minority in the country — continue to pour in, the Daily Caller reported.\nThe post Report: ‘Thousan…",
    "link": "https://www.breitbart.com/africa/2025/06/02/report-thousands-south-african-refugees-arrive-u-s-end-summer/",
    "timestamp": "2025-06-03T01:55:50Z"
  },
  {
    "title": "Gold hovers near four-week peak on weaker dollar, trade concerns",
    "description": "Gold prices climbed to a near four-week high, buoyed by a weaker dollar and escalating U.S.-China trade tensions, increasing demand for the safe-haven asset. Uncertainty surrounding trade negotiations and geopolitical concerns, including discussions between R…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-hovers-near-four-week-peak-on-weaker-dollar-trade-concerns/articleshow/121583879.cms",
    "timestamp": "2025-06-03T01:55:27Z"
  },
  {
    "title": "'Are You Kidding Me?': CNN Data Chief Stunned By Democrats' Polling On This Key Issue",
    "description": "Harry Enten said the GOP is still \"not out of the ballgame\" with Americans, despite fears sparked by the president's trade policy.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-republicans-democrats-economy-polling_n_683e2a7ce4b08b77a4613430",
    "timestamp": "2025-06-03T01:55:26Z"
  },
  {
    "title": "Dollar holds near six-week low as trade war wears on US economy",
    "description": "The dollar has weakened to a six-week low amidst concerns about the U.S. economy due to ongoing trade tensions. Factory and jobs data will be crucial in assessing the impact of trade uncertainty. New tariffs on steel and aluminum are set to double, coinciding…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-holds-near-six-week-low-as-trade-war-wears-on-us-economy/articleshow/121583847.cms",
    "timestamp": "2025-06-03T01:51:48Z"
  },
  {
    "title": "S&P closes higher on trade hopes, Nvidia lifts Nasdaq",
    "description": "The S&P 500 index saw an increase on Monday. This happened because investors felt positive about trade discussions. These discussions involved the United States and its trade partners. This optimism existed even with President Trump's increased tariffs on ste…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-closes-higher-on-trade-hopes-nvidia-lifts-nasdaq/articleshow/121583837.cms",
    "timestamp": "2025-06-03T01:49:32Z"
  },
  {
    "title": "Donald Trump-Xi Jinping call likely to take place this week amid fresh trade tensions, White House confirms",
    "description": "US President Donald Trump and Chinese President Xi Jinping are expected to speak this week amid renewed trade tensions. Trump has accused China of violating a temporary tariff agreement made in Geneva last month. While US officials claim Beijing is dragging i…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-xi-jinping-call-likely-to-take-place-this-week-amid-fresh-trade-tensions-white-house-confirms/articleshow/121583790.cms",
    "timestamp": "2025-06-03T01:48:03Z"
  },
  {
    "title": "Trump Appears To Undercut U.S. Proposal To Iran, Declaring He Won't Allow Any Uranium Enrichment",
    "description": "Trump and Steve Witkoff, who is leading the negotiations for the U.S., have repeatedly offered inconsistent public messages on a deal with Iran.",
    "link": "https://www.huffpost.com/entry/ap-us-united-states-iran_n_683e52d4e4b02a49cce6a6b9",
    "timestamp": "2025-06-03T01:45:01Z"
  },
  {
    "title": "Donald Trump 'open' to meeting Ukraine, Russia leaders to push ceasefire",
    "description": "Donald Trump may meet Russian and Ukrainian leaders in Turkey. This follows stalled ceasefire talks in Istanbul. Recep Tayyip Erdogan proposed the summit. Vladimir Putin has not agreed, but Volodymyr Zelensky is willing. Trump wants both sides to negotiate. A…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-open-to-meeting-ukraine-russia-leaders-to-push-ceasefire/articleshow/121583810.cms",
    "timestamp": "2025-06-03T01:43:01Z"
  },
  {
    "title": "Trump pushes 'Big, Beautiful Bill' as solution to four years of Biden failures: 'Largest tax cut, EVER'",
    "description": "Senate Republicans review Trump's \"Big, Beautiful Bill,\" focusing on spending cuts, tax reforms, energy policies and immigration, amid potential increase in the national debt.",
    "link": "https://www.foxnews.com/politics/trump-pushes-big-beautiful-bill-solution-four-years-biden-failures-largest-tax-cut-ever",
    "timestamp": "2025-06-03T01:42:52Z"
  },
  {
    "title": "Trump appears to undercut US proposal to Iran, declaring he won't allow any uranium enrichment",
    "description": "President Donald Trump has appeared to undercut a proposal that was offered by his special envoy to Iran",
    "link": "https://abcnews.go.com/US/wireStory/trump-appears-undercut-us-proposal-iran-declaring-uranium-122433353",
    "timestamp": "2025-06-03T01:42:28Z"
  },
  {
    "title": "Canada to expedite nation building projects to counter Trump",
    "description": "Prime Minister Mark Carney outlined on Monday his ambitious plan to make Canada \"the strongest economy in the G7\".",
    "link": "https://www.bbc.com/news/articles/clyrd24zg3eo",
    "timestamp": "2025-06-03T01:41:49Z"
  },
  {
    "title": "Putin likes to have the upper hand, but before Istanbul Zelenskyy played an ace",
    "description": "Vladimir Putin and Volodymyr Zelenskyy sent delegates to Istanbul to talk peace, but a day prior Ukraine sent its strongest signal to Russia and any third-party brokers: The war is not lost, writes Emily Clark.",
    "link": "https://www.abc.net.au/news/2025-06-03/ukraine-drone-attack-on-russia-zelenskyy-improved-position/105366260",
    "timestamp": "2025-06-03T01:39:07Z"
  },
  {
    "title": "Iran poised to dismiss U.S. nuclear proposal, Iranian diplomat says",
    "description": "The proposal fails to address Tehran's interests or soften Washington's stance on uranium enrichment, the diplomat says.",
    "link": "https://www.japantimes.co.jp/news/2025/06/03/world/politics/iran-us-nuclear-proposal-diplomat/",
    "timestamp": "2025-06-03T01:37:00Z"
  },
  {
    "title": "The problem with Asia's ‘sell America’ moment",
    "description": "The region’s currencies are enjoying a healthy rally. History warns against anti-dollar triumphalism.",
    "link": "https://www.japantimes.co.jp/commentary/2025/06/03/world/asia-sell-american-moment/",
    "timestamp": "2025-06-03T01:35:00Z"
  },
  {
    "title": "US commerce secretary Howard Lutnick expects India trade deal soon",
    "description": "US Commerce Secretary Howard Lutnick expressed optimism about an impending trade agreement between the United States and India, aiming to avert potential tariffs threatened by President Trump. Lutnick highlighted concerns regarding India's tariff practices an…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-commerce-secretary-howard-lutnick-expects-india-trade-deal-soon/articleshow/121583740.cms",
    "timestamp": "2025-06-03T01:31:15Z"
  },
  {
    "title": "David W Higgins: How the Occupied Territories Bill could risk triggering Ireland’s own damaging trade war",
    "description": "The Trump trade war continues. The EU has joined China with a 90-day reprieve. A burst of dealmaking is unfolding behind the scenes. Exporters are continuing to count the fallout. Everyone has more questions than answers.",
    "link": "https://www.independent.ie/opinion/comment/david-w-higgins-how-the-occupied-territories-bill-could-risk-triggering-irelands-own-damaging-trade-war/a1532283711.html",
    "timestamp": "2025-06-03T01:30:00Z"
  }
]