[
  {
    "title": "White House will allow anonymous donors to contribute to Trump's ballroom project (NBC News)",
    "description": "NBC News:\nWhite House will allow anonymous donors to contribute to Trump's ballroom project  —  While the administration has released a list of some donors for the ballroom addition, an aide told NBC News that “donors also have the option to remain anonymous.…",
    "link": "https://www.memeorandum.com/251024/p131",
    "timestamp": "2025-10-24T23:40:00Z"
  },
  {
    "title": "As Pentagon Takes Secretive Donation for Military Salaries, AFL-CIO Says Pay All Workers Impacted by Shutdown",
    "description": "As the Pentagon plans to put a $130 million donation from an anonymous \"friend\" of President Donald Trump toward military salaries, the largest federation of unions in the United States on Friday demanded that federal lawmakers \"stop playing political games\" …",
    "link": "https://www.commondreams.org/news/government-shutdown-federal-workers",
    "timestamp": "2025-10-24T23:39:46Z"
  },
  {
    "title": "Massachusetts agency’s partisan SNAP blame game ripped, as Rep. Clark calls it ‘leverage’",
    "description": "A million Bay Staters are at risk of losing their SNAP benefits just days from now, as a political firestorm has erupted amid the federal government shutdown, and a message from a state agency turns up the political heat.",
    "link": "https://www.bostonherald.com/2025/10/24/massachusetts-agency-posts-partisan-message-blaming-trump-amid-bitter-fight-over-snap-benefits/",
    "timestamp": "2025-10-24T23:39:13Z"
  },
  {
    "title": "Stephen Miller Dodges Question on Whether Trump Will Send Troops to Venezuela",
    "description": "Deputy White House Chief of Staff for Policy Stephen Miller declined to rule out U.S. soldiers in Venezuela as President Donald Trump ramps up hostilities in the region.\nThe post Stephen Miller Dodges Question on Whether Trump Will Send Troops to Venezuela fi…",
    "link": "https://www.mediaite.com/media/news/stephen-miller-dodges-question-on-whether-trump-will-send-troops-to-venezuela/",
    "timestamp": "2025-10-24T23:38:25Z"
  },
  {
    "title": "Out Rep. Mark Pocan lambastes Trump's trade war, misguided priorities",
    "description": "Democratic U.S. Rep. Mark Pocan of Wisconsin, a gay man who cochairs the Congressional Equality Caucus, lambasted Donald Trump’s trade war and his misguided priorities in a CNN interview Friday.",
    "link": "https://www.advocate.com/politics/mark-pocan-lambastes-trump",
    "timestamp": "2025-10-24T23:37:19Z"
  },
  {
    "title": "Kristi Noem's DHS slapping 'severe' fines on teen migrants to 'coerce' them to self-deport",
    "description": "Unaccompanied immigrant teenagers are being slapped with $5,000 fines from the federal government as a way to pressure them to return to their home countries, according to reporting Friday at The Intercept.\"The fine is one of several new financial penalties f…",
    "link": "https://www.rawstory.com/dhs-immigration-2674231899/",
    "timestamp": "2025-10-24T23:36:32Z"
  },
  {
    "title": "One Crypto Tycoon Pardons Another",
    "description": "The pardon of one of the world’s richest men is an overture to an industry that has made Trump millions.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/10/trump-crypto-pardon-changpeng-zhao/684699/",
    "timestamp": "2025-10-24T23:34:00Z"
  },
  {
    "title": "NCLA Amici Brief with Clients Asks Supreme Court to Rule Emergency Tariffs Lack Legal Authority",
    "description": "Learning Resources, Inc. and hand2mind, Inc. v. President Donald J. Trump, et al.; President Donald J. Trump, et al. v. V.O.S. Selections, Inc., et al. Learning Resources, Inc. and hand2mind, Inc. v. President Donald J. Trump, et al.; President Donald J. Trum…",
    "link": "https://www.globenewswire.com/news-release/2025/10/24/3173129/0/en/NCLA-Amici-Brief-with-Clients-Asks-Supreme-Court-to-Rule-Emergency-Tariffs-Lack-Legal-Authority.html",
    "timestamp": "2025-10-24T23:31:00Z"
  },
  {
    "title": "Pentagon accepts anonymous $130 million donation from Trump 'friend' to pay military",
    "description": "The Trump administration has accepted an anonymous $130 million donation that it plans to use to pay military members during the government shutdown.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/24/trump-130-million-anonymous-donation-pay-military-government-shutown/86884357007/",
    "timestamp": "2025-10-24T23:25:32Z"
  },
  {
    "title": "The Public Deserves to Know What Trump Is Doing to the ‘People’s House’ | Analysis",
    "description": "News outlets overcame reporting obstacles this week to chronicle the sudden, shocking demolition of the White House's East Wing, a story that one Washington Post editor says “hits you in the gut”\nThe post The Public Deserves to Know What Trump Is Doing to the…",
    "link": "https://www.thewrap.com/media-trump-east-wing-demolition/",
    "timestamp": "2025-10-24T23:25:28Z"
  },
  {
    "title": "Video shows Rachel Maddow crying about White House renovations?",
    "description": "A trending topic displayed on Meta's social media platform Threads read, \"Rachel Maddow reacts emotionally to White House renovation plans.\"",
    "link": "https://www.snopes.com//fact-check/maddow-emotional-white-house/",
    "timestamp": "2025-10-24T23:25:00Z"
  },
  {
    "title": "Trump’s toxic influence looms over Paramount Skydance’s bid to buy Warner Bros. Discovery",
    "description": "There’s reportedly a whisper campaign underway to grease the skids for MAGA-friendly Paramount Skydance to acquire Warner Bros. Discovery in a massive deal.",
    "link": "https://www.msnbc.com/top-stories/latest/paramount-skydance-warner-bros-discovery-trump-ellison-rcna239680",
    "timestamp": "2025-10-24T23:24:30Z"
  },
  {
    "title": "Federal monitors to descend on 2 blue states as Trump DOJ pursues 'election integrity'",
    "description": "President Donald Trump's Justice Department is planning to send federal election monitors to California and New Jersey next month after receiving requests from state Republican officials.The Justice Department said it would send monitors to Passaic County, Ne…",
    "link": "https://www.rawstory.com/california-election/",
    "timestamp": "2025-10-24T23:21:34Z"
  },
  {
    "title": "ESPN Viewers Noticed Something Awkward During NBA Gambling Scandal Segment",
    "description": "Now you see it, and now you don't.",
    "link": "https://www.huffpost.com/entry/espn-viewers-react-to-awkward-nba-gambling-segment_n_68fbf132e4b004dff45137e3",
    "timestamp": "2025-10-24T23:20:55Z"
  },
  {
    "title": "Ex-60 Minutes Producer Reveals Blunt Reply to Bosses’ Demand After Kamala Harris Interview",
    "description": "Owens revealed executives at Paramount pressured him to apologize for the now-infamous Kamala Harris interview that prompted a lawsuit from Trump.\nThe post Ex-60 Minutes Producer Reveals Blunt Reply to Bosses’ Demand After Kamala Harris Interview first appear…",
    "link": "https://www.mediaite.com/media/news/ex-60-minutes-producer-reveals-blunt-reply-to-bosses-demand-after-kamala-harris-interview/",
    "timestamp": "2025-10-24T23:20:19Z"
  },
  {
    "title": "What to Know About Trump’s Demolition of the East Wing",
    "description": "With little fanfare, the Trump administration demolished the East Wing of the White House in order to make space for a new 90,000-square-foot ballroom. President Donald Trump teased the project for months, first announcing his plan to build a $100 million add…",
    "link": "https://biztoc.com/x/e267a33374d8fcc1",
    "timestamp": "2025-10-24T23:19:42Z"
  },
  {
    "title": "Canada Caves: Ontario To Yank ‘Fake’ Reagan Ad After Pressure From Trump",
    "description": "Trump ended all trade talks with Canada on ThursdayThe liberal Canadian premier who launched a $75 million anti-tariff ad campaign in the United States featuring former President Ronald Reagan will yank the effort after pressure from President Donald Trump.On…",
    "link": "https://freerepublic.com/focus/f-news/4348463/posts",
    "timestamp": "2025-10-24T23:17:29Z"
  },
  {
    "title": "‘Democrat-Caused’: Stephen Miller Goes Off On Newsom Handing Out CDLs To Illegals, Following Horrific Crash",
    "description": "Stephen Miller tore into Democratic California Gov. Gavin Newsom during a Fox News appearance Friday for policies he said directly enabled a deadly crash.",
    "link": "https://dailycaller.com/2025/10/24/stephen-miller-gavin-newsom-handing-cdl/",
    "timestamp": "2025-10-24T23:15:23Z"
  },
  {
    "title": "Hundreds protests DHS Secretary Noem during press conference at Fort Snelling",
    "description": "Hundreds gathered outside the federal Whipple Building at Fort Snelling Friday to protest the presence of Secretary of Homeland Security Kristi Noem, who is ...",
    "link": "https://minnesotareformer.com/2025/10/24/hundreds-protests-dhs-secretary-noem-during-press-conference-at-fort-snelling/",
    "timestamp": "2025-10-24T23:13:39Z"
  },
  {
    "title": "US starts investigating China’s compliance with 2020 trade deal as Trump heads to Asia",
    "description": "The investigation may aim to find new leverage against Beijing.",
    "link": "https://www.bostonherald.com/2025/10/24/china-2020-trade-deal-investigation/",
    "timestamp": "2025-10-24T23:08:24Z"
  },
  {
    "title": "Mamdani, in emotional speech, decries Islamophobia in New York City mayor's race",
    "description": "Mamdani, in emotional speech, decries Islamophobia in New York City mayor's racego.com",
    "link": "https://abcnews.go.com/Politics/mamdani-emotional-speech-decries-islamophobia-new-york-city/story?id=126846079",
    "timestamp": "2025-10-24T23:07:54Z"
  },
  {
    "title": "Reagan Foundation becomes the latest US institution drawn into Donald Trump's controversies",
    "description": "The Ronald Reagan Presidential Foundation and Institute is drawing blowback and praise for arguing that a Canadian government advertisement playing in U.S. markets misrepresented the 40th president’s words to blast President Donald Trump’s tariff policies. It…",
    "link": "https://www.seattlepi.com/business/article/reagan-foundation-becomes-the-latest-us-21118894.php",
    "timestamp": "2025-10-24T23:07:34Z"
  },
  {
    "title": "What A WBD Week: As Bidders Circle, Paramount’s Shock And Awe Signals A New Media Age",
    "description": "Even in an industry increasingly accustomed to head-snapping change, this has been quite a week. After Paramount Skydance made the third in an escalating series of acquisition offers for Warner Bros. Discovery, the parent of Warner Bros., HBO and CNN official…",
    "link": "http://deadline.com/2025/10/warner-bros-discovery-deal-suitors-1236596524/",
    "timestamp": "2025-10-24T23:06:34Z"
  },
  {
    "title": "Trump just sent a sinister message with 'appalling' ballroom design: Nobel laureate",
    "description": "Economist Paul Krugman said President Donald Trump’s removal of a whole White House wing is typical Trumpian style: an “act of vandalism\" being paid for by large corporate donors — mostly tech and crypto companies — seeking to buy Trump’s favor.“I am sure the…",
    "link": "https://www.rawstory.com/trump-ballroom-2674231902/",
    "timestamp": "2025-10-24T23:03:52Z"
  },
  {
    "title": "Fact-checking Democrats’ claim that White House said ballroom is Trump’s top priority",
    "description": "Leading Democrats said White House press secretary Karoline Leavitt called a new White House ballroom Donald Trump’s top priority as president. But Leavitt said it was his top priority compared only with other White House construction projects.",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-democrats-claim-that-white-house-said-ballroom-is-trumps-top-priority",
    "timestamp": "2025-10-24T23:03:43Z"
  },
  {
    "title": "Milei’s make-or-break moment",
    "description": "On the evening of October 6, Argentina’s President Javier Milei performed an arena rock show, thrashing out nine songs in front of 15,000 fans in Buenos Aires to launch his new book, The Construction of a Miracle. “I want to thank The Forces of Heaven,” roare…",
    "link": "https://freerepublic.com/focus/f-news/4348458/posts",
    "timestamp": "2025-10-24T23:01:13Z"
  },
  {
    "title": "INTERACTIVE: The Trump card among US presidents in Asean",
    "description": "Donald Trump will be the third US president to officially visit Malaysia - the latest of American leaders who have made their presence felt in the Asean region. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/25/interactive-the-trump-card-among-us-presidents-in-asean",
    "timestamp": "2025-10-24T23:00:00Z"
  },
  {
    "title": "Reagan Foundation becomes the latest US institution drawn into Donald Trump’s controversies",
    "description": "The Ronald Reagan Presidential Foundation and Institute is drawing a volatile mix of blowback and praise for arguing that a Canadian government advertisement playing in U.S. markets misrepresented the 40th president’s words to blast President Donald Trump’s t…",
    "link": "https://financialpost.com/pmn/reagan-foundation-becomes-the-latest-us-institution-drawn-into-donald-trumps-controversies",
    "timestamp": "2025-10-24T22:59:50Z"
  },
  {
    "title": "MEHEK COOKE: Democrats’ Shutdown Misplay Gives Trump Rare Opportunity",
    "description": "As the shutdown continues, this is not the usual partisan stalemate but a rare opportunity for President Donald Trump to deliver real results.",
    "link": "https://dailycaller.com/2025/10/24/opinion-democrats-shutdown-misplay-gives-trump-rare-opportunity-mehek-cooke/",
    "timestamp": "2025-10-24T22:58:27Z"
  },
  {
    "title": "Pentagon accepts anonymous $130 million donation to help pay troops",
    "description": "The Pentagon confirmed Friday that it accepted an anonymous $130 million donation to help offset the cost of troops’ salaries and benefits during the shutdown",
    "link": "https://www.nbcnews.com/politics/politics-news/pentagon-accepts-anonymous-130-million-donation-help-pay-troops-rcna239694",
    "timestamp": "2025-10-24T22:56:22Z"
  },
  {
    "title": "Kenny Loggins filed $900M lawsuit against Trump?",
    "description": "Singer-songwriter Kenny Loggins filed a $900 million lawsuit against U.S. President Donald Trump for the unauthorized use of his 1986 hit song \"Danger Zone.\"",
    "link": "https://www.snopes.com//fact-check/kenny-loggins-sues-trump/",
    "timestamp": "2025-10-24T22:56:00Z"
  },
  {
    "title": "Trump’s Tantrum Over Accurate Reagan Quotes Backfires: Millions Learn Reagan Opposed His Tariff Policy",
    "description": "Donald Trump just cut off all trade negotiations with Canada because an Ontario ad campaign quoted Ronald Reagan accurately. The quotes are real. The context is accurate. But Trump called them fake and fraudulent, and the Reagan Foundation—the institution lit…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179865436",
    "timestamp": "2025-10-24T22:53:33Z"
  },
  {
    "title": "Doctor Facing Trump Ally’s ‘Ideologically-Driven’ Lawsuit Moves Practice Out Of Red State",
    "description": "Texas Attorney General Ken Paxton called Dr. May Lau a “radical doctor” and sued her last year for providing gender-affirming care to minors.",
    "link": "https://www.huffpost.com/entry/may-lau-ken-paxton-transgender-trump_n_68fbe6fde4b0bc7dc6200699",
    "timestamp": "2025-10-24T22:52:47Z"
  },
  {
    "title": "Trump administration investigating China’s compliance with 2020 trade deal",
    "description": "The probe comes as the US government seeks additional leverage against Beijing amid escalating trade tensions.",
    "link": "https://www.aljazeera.com/news/2025/10/24/trump-administration-investigating-chinas-compliance-with-2020-trade-deal",
    "timestamp": "2025-10-24T22:51:17Z"
  },
  {
    "title": "CNN Contributor Says With Straight Face Trump Third Term Talk Has Been ‘Incredibly Triggering’ For Democrats",
    "description": "CNN contrib Lulu Garcia-Navarro said talk and trolling about a potential third term for President Donald Trump has been \"incredibly triggering\" for Democrats.",
    "link": "https://dailycaller.com/2025/10/24/cnn-contributor-lulu-garcia-navarro-trolling-donald-trump-third-term-triggering-democrats/",
    "timestamp": "2025-10-24T22:50:39Z"
  },
  {
    "title": "Trump considering plans to target cocaine facilities inside Venezuela, officials say (CNN)",
    "description": "CNN:\nTrump considering plans to target cocaine facilities inside Venezuela, officials say  —  President Donald Trump is considering plans to target cocaine facilities and drug trafficking routes inside Venezuela, though he has not yet made a decision on wheth…",
    "link": "https://www.memeorandum.com/251024/p127",
    "timestamp": "2025-10-24T22:50:01Z"
  },
  {
    "title": "Israel’s Version of ‘Saturday Night Live’ Flaunts Trump as a Conquering Roman Emperor | Video",
    "description": "\"You don't need to know Hebrew to get this,\" The Atlantic's Yair Rosenberg writes on X\nThe post Israel’s Version of ‘Saturday Night Live’ Flaunts Trump as a Conquering Roman Emperor | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-israel-snl-roman-emperor/",
    "timestamp": "2025-10-24T22:42:44Z"
  },
  {
    "title": "Trump Is Rewriting History to Justify His Sketchy Pardon of a Crypto King",
    "description": "Trump directly tied his pardon of Binance founder Changpeng Zhao to the Biden administration’s “war on cryptocurrency.”\nThe post Trump Is Rewriting History to Justify His Sketchy Pardon of a Crypto King appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/24/trump-pardon-crypto-binance-cz/",
    "timestamp": "2025-10-24T22:41:21Z"
  },
  {
    "title": "1st lawsuit filed over White House ballroom construction, but analysis shows few restrictions on project",
    "description": "To be paid for by donors as a $300 million gift to the American people",
    "link": "https://www.wnd.com/2025/10/1st-lawsuit-filed-white-house-ballroom-construction-analysis/",
    "timestamp": "2025-10-24T22:39:26Z"
  },
  {
    "title": "Trump’s Tantrum Over Accurate Reagan Quotes Backfires: Millions Learn Reagan Opposed His Tariff Policy",
    "description": "Donald Trump just cut off all trade negotiations with Canada because an Ontario ad campaign quoted Ronald Reagan accurately. The quotes are real. The context is accurate. But Trump called them “fake” and “fraudulent,” and the Reagan Foundation—the institution…",
    "link": "https://www.techdirt.com/2025/10/24/trumps-tantrum-over-accurate-reagan-quotes-backfires-millions-learn-reagan-opposed-his-tariff-policy/",
    "timestamp": "2025-10-24T22:39:16Z"
  },
  {
    "title": "Trump to jet off to Asia as North Korea fires ballistic missiles and China trade questions loom",
    "description": "Trump's Asia summit tour includes meetings with Chinese President Xi Jinping and other regional leaders as trade tensions with Beijing escalate.",
    "link": "https://www.foxnews.com/politics/trump-jet-off-asia-north-korea-fires-ballistic-missiles-china-trade-questions-loom",
    "timestamp": "2025-10-24T22:37:36Z"
  },
  {
    "title": "Major Hollywood Union Says Paramount Taking over Warner Bros. Discovery Would Be a ‘Disaster’ as Trump Backs the Bid",
    "description": "The Hollywood writer's union is raising the alarm over the possible merger between Warner Bros. Discovery and Paramount Skydance, saying that such a merger would be a \"disaster,\" but President Donald Trump says he is all for the plan.\nThe post Major Hollywood…",
    "link": "https://www.breitbart.com/entertainment/2025/10/24/major-hollywood-union-says-paramount-taking-over-warner-bros-discovery-would-be-a-disaster-as-trump-backs-the-bid/",
    "timestamp": "2025-10-24T22:35:29Z"
  },
  {
    "title": "Is the US killing innocent people?",
    "description": "President Donald Trump speaks to members of the press on October 19, 2025, aboard Air Force One.﻿ | Alex Wong/Getty Images \nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting polit…",
    "link": "https://biztoc.com/x/b1d9cfa113a6ad5e",
    "timestamp": "2025-10-24T22:35:17Z"
  },
  {
    "title": "'Sit this one out': MAGA melts down over big-name Dem's op-ed blasting Trump",
    "description": "MAGA fans melted down Friday at Chelsea Clinton after she blasted President Donald Trump in an op-ed, telling her to \"sit this one out.\"Clinton, the former first daughter of Bill and Hillary Clinton, wrote a personal piece for USA Today and described spending…",
    "link": "https://www.rawstory.com/donald-trump-white-house-2674231797/",
    "timestamp": "2025-10-24T22:35:02Z"
  },
  {
    "title": "Apple Joins Other Tech Firms in Donating to President Trump’s $350M White House Ballroom Project",
    "description": "Apple has joined several other technology firms in contributing to US President Donald Trump’s 90,000-square-foot ballroom construction projects, according to a CNN report. Construction began on the ballroom project earlier this week. Trump has said the new b…",
    "link": "https://www.mactrast.com/2025/10/apple-joins-other-tech-firms-in-donating-to-president-trumps-350m-white-house-ballroom-project/",
    "timestamp": "2025-10-24T22:33:51Z"
  },
  {
    "title": "Elon Musk's SpaceX Moves $133 Million Worth of Bitcoin",
    "description": "Elon Musk's space exploration firm, SpaceX, moved $133 million worth of Bitcoin on Friday after transferring funds earlier this week.",
    "link": "https://decrypt.co/345904/elon-musk-spacex-moves-133-million-worth-bitcoin",
    "timestamp": "2025-10-24T22:31:02Z"
  },
  {
    "title": "Over 25% of New Yorkers will consider fleeing NYC if Zohran Mamdani wins: ‘Could reshape the city’",
    "description": "More than a quarter of New Yorkers will consider fleeing the Big Apple if Zohran Mamdani is elected mayor, according to a new poll that warns that a socialist-run City Hall “could reshape the city for years to come.” The shocking new survey, released Friday m…",
    "link": "https://freerepublic.com/focus/f-news/4348449/posts",
    "timestamp": "2025-10-24T22:29:57Z"
  },
  {
    "title": "More Than the East Wing Got Demolished This Week",
    "description": "Summarily smashing part of the White House without telling people threatens the fundamental idea of the republic.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/10/white-house-east-wing-demolition-trump-ballroom/684698/",
    "timestamp": "2025-10-24T22:29:35Z"
  },
  {
    "title": "Will Trump name the White House ballroom after himself? What we know about funding, construction, & potential name",
    "description": "Trump ballroom naming: Reports suggest President Trump may name the new White House ballroom after himself. However, the White House denies these claims. Spokesperson Davis Ingle stated any naming announcement will come directly from President Trump. Construc…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-trump-name-the-white-house-ballroom-after-himself-what-we-know-about-funding-construction-potential-name/articleshow/124795094.cms",
    "timestamp": "2025-10-24T22:28:04Z"
  },
  {
    "title": "The NBA jumped into bed with gambling. Now the league is getting its due",
    "description": "The NBA scoreboard has turned into a stock ticker. Crowd chants, but half of them are watching their parlays instead of the play. Somewhere a coach calls timeout; somewhere else a bookmaker grins. This was always coming. The NBA invited gambling to the game w…",
    "link": "https://freerepublic.com/focus/f-chat/4348448/posts",
    "timestamp": "2025-10-24T22:27:27Z"
  },
  {
    "title": "As Trump Weaponizes DOJ, NJ and California Poll Monitoring Called Election Interference",
    "description": "With a majority of Americans now recognizing that President Donald Trump is weaponizing the US Department of Justice, the DOJ's Friday announcement that it will send election monitors to California and New Jersey is generating alarm.Republicans in both states…",
    "link": "https://www.commondreams.org/news/us-doj",
    "timestamp": "2025-10-24T22:27:05Z"
  },
  {
    "title": "SC’s state utility enters negotiations on deal to restart of failed nuclear project",
    "description": "COLUMBIA — South Carolina’s state-owned utility company is entering negotiations with a New York investment firm to reboot a pair of partially built nuclear ...",
    "link": "https://scdailygazette.com/2025/10/24/scs-state-utility-enters-negotiations-on-deal-to-restart-of-failed-nuclear-project/",
    "timestamp": "2025-10-24T22:25:55Z"
  },
  {
    "title": "Trump says a Canadian ad misstated Ronald Reagan's views on tariffs. Here are the facts and context (Paul Wiseman/Associated Press)",
    "description": "Paul Wiseman / Associated Press:\nTrump says a Canadian ad misstated Ronald Reagan's views on tariffs.  Here are the facts and context  —  Add AP News on Google Add AP News as your preferred source to see more of our stories on Google.  Share  —  President Don…",
    "link": "https://www.memeorandum.com/251024/p125",
    "timestamp": "2025-10-24T22:25:01Z"
  },
  {
    "title": "Josh Shapiro Will Campaign With Spanberger but Dodges Key Issue in Virginia Race",
    "description": "Pennsylvania Gov. Josh Shapiro will campaign with Virginia Democrat gubernatorial candidate Abigail Spanberger in the Old Dominion Sunday, and despite his strong track record in... Read More\nThe post Josh Shapiro Will Campaign With Spanberger but Dodges Key I…",
    "link": "https://www.dailysignal.com/2025/10/24/josh-shapiro-will-campaign-spanberger-dodges-key-issue-virginia-race-jay-jones/",
    "timestamp": "2025-10-24T22:25:00Z"
  },
  {
    "title": "Is the US killing innocent people?",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: President Donald Trump sanctioned Colombian President …",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/466136/trump-boat-strikes-murder-venezuela-colombia-gustavo-petro",
    "timestamp": "2025-10-24T22:23:14Z"
  },
  {
    "title": "Trump parachutes into key 2025 race as GOP aims to flip governor office in blue-leaning state",
    "description": "With a week and a half until Election Day and the latest polls suggesting Republican nominee Jack Ciattarelli narrowing the gap with Democratic rival Rep. Mikie Sherrill in New Jersey's race for governor, President Donald Trump is stepping in to push his GOP …",
    "link": "https://freerepublic.com/focus/f-news/4348446/posts",
    "timestamp": "2025-10-24T22:22:57Z"
  },
  {
    "title": "Pentagon orders aircraft carrier to Latin America, boosting U.S. military buildup in the region to more than 10,000 sailors and Marines",
    "description": "The USS Gerald R. Ford, which has five destroyers in its strike group, is now deployed to the Mediterranean Sea.",
    "link": "https://fortune.com/2025/10/24/pentagon-aircraft-carrier-latin-america-venezuela-us-military-buildup-10000-troops/",
    "timestamp": "2025-10-24T22:22:56Z"
  },
  {
    "title": "Trump Aims to Sign Mineral Deals in Asia to Raise Pressure on Xi",
    "description": "President Donald Trump will look to sign economic agreements and critical minerals deals with trading partners during his trip to Asia, according to senior US officials, as the administration moves to ramp up pressure on China ahead of a crucial meeting with …",
    "link": "https://financialpost.com/pmn/business-pmn/trump-aims-to-sign-mineral-deals-in-asia-to-raise-pressure-on-xi",
    "timestamp": "2025-10-24T22:20:20Z"
  },
  {
    "title": "'Getting done dirty!' Trump hit with another devastating poll",
    "description": "President Donald Trump's favorability with Hispanics has nosedived by 19 percentage points over the past 10 months, according to an Associated Press-NORC Center poll results released Friday, The Hill reported.A whopping 73 percent of Hispanic voters disapprov…",
    "link": "https://www.rawstory.com/donald-trump-polls-2674231744/",
    "timestamp": "2025-10-24T22:19:30Z"
  },
  {
    "title": "Ontario to stop running anti-tariff advert that angered Trump",
    "description": "The advertisement will be paused from Monday so \"trade talks can resume\" with the US, Doug Ford says.",
    "link": "https://www.bbc.com/news/articles/czr18g3j4j7o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-24T22:18:59Z"
  },
  {
    "title": "Trump Turns East Wing Debris Into Filler at Golf Course He Planned to Refurb: Report",
    "description": "The East Wing rubble dump comes two months after Politico revealed Trump was eyeing a refurb and rebrand of the course.\nThe post Trump Turns East Wing Debris Into Filler at Golf Course He Planned to Refurb: Report first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-turns-east-wing-debris-into-filler-at-golf-course-he-planned-to-refurb-report/",
    "timestamp": "2025-10-24T22:18:53Z"
  },
  {
    "title": "Historic preservation laws don't require Trump to restore White House East Wing",
    "description": "In October 2025, the National Park Service said historic preservation laws in the United States mandated President Donald Trump would have to rebuild the East Wing of the White House, which he had demolished in order to construct a ballroom, exactly as it was…",
    "link": "https://www.snopes.com//fact-check/trump-east-wing-historic-preservation-laws/",
    "timestamp": "2025-10-24T22:14:00Z"
  },
  {
    "title": "Ontario will pull ads that triggered Trump in order to restart trade talks, Ford says",
    "description": "OTTAWA — Ontario is hitting pause on its short-lived anti-tariff television ad campaign in the United States on Monday so that Canada-U.S. trade talks can resume, Ontario Premier Doug Ford said Friday. Ford said he decided to pull the plug on the campaign aft…",
    "link": "https://financialpost.com/pmn/ontario-will-pull-ads-that-triggered-trump-in-order-to-restart-trade-talks-ford-says-2",
    "timestamp": "2025-10-24T22:13:45Z"
  },
  {
    "title": "Trump to Use $130 Million From Private Donor to Help Pay Troops Amid Shutdown",
    "description": "The Pentagon confirmed on Friday that it accepted an anonymous $130 million donation to help fund military pay during the ongoing government shutdown — an extraordinary move made under its general gift acceptance authority, which allows private contributions …",
    "link": "https://www.mediaite.com/media/news/trump-to-use-130-million-from-private-donor-to-help-pay-troops-amid-shutdown/",
    "timestamp": "2025-10-24T22:12:25Z"
  },
  {
    "title": "US hits Colombia’s leader with drug sanctions, sparking sharp rebuke",
    "description": "Washington slapped unprecedented sanctions on Colombia’s leftist president, his wife, son and a top aide Friday, accusing them of enabling drug cartels — and rocking a decades-old alliance. The US Treasury blacklisted Gustavo Petro, first lady Veronica Alcoce…",
    "link": "https://www.digitaljournal.com/world/us-hits-colombias-leader-with-drug-sanctions-sparking-sharp-rebuke/article",
    "timestamp": "2025-10-24T22:12:20Z"
  },
  {
    "title": "WATCH: Trump likely to name White House ballroom after himself, officials say",
    "description": "President Donald Trump will likely name his new $300 million White House ballroom after himself, according to senior administration officials.",
    "link": "https://abcnews.go.com/Politics/video/trump-white-house-ballroom-after-officials-126849428",
    "timestamp": "2025-10-24T22:11:47Z"
  },
  {
    "title": "Abigail Spanberger Fundraises With AOC In Final Stretch Of Governor’s Race",
    "description": "Former Democratic Rep. Abigail Spanberger, her party's nominee for Virginia governor, is fundraising with Democratic New York Rep. Alexandria Ocasio-Cortez.",
    "link": "https://dailycaller.com/2025/10/24/abigail-spanberger-fundraises-aoc-virginia-governor/",
    "timestamp": "2025-10-24T22:10:13Z"
  },
  {
    "title": "White House tightens the clemency process as Trump resumes pardons (NBC News)",
    "description": "NBC News:\nWhite House tightens the clemency process as Trump resumes pardons  —  People familiar with pardon discussions told NBC News that top White House officials became concerned about attempts from outsiders to profit from the clemency process.  —  WASHI…",
    "link": "https://www.memeorandum.com/251024/p122",
    "timestamp": "2025-10-24T22:10:02Z"
  },
  {
    "title": "EXCLUSIVE: Ahead of Trump’s Meeting With Xi, US Families Ask President for Help to Bring Adopted Children Home From China",
    "description": "Hundreds of American families are asking President Donald Trump to help them bring their children home from China.   “Your leadership could unite hundreds of... Read More\nThe post EXCLUSIVE: Ahead of Trump’s Meeting With Xi, US Families Ask President for Help…",
    "link": "https://www.dailysignal.com/2025/10/24/hold-exclusive-ahead-trumps-meeting-with-xi-us-families-ask-president-help-bring-adopted-children-home-china/",
    "timestamp": "2025-10-24T22:10:01Z"
  },
  {
    "title": "Social Security payments to go up 2.8% next year while polls show three-fourths of seniors think 3% isn’t enough to keep up with rising prices",
    "description": "Recipients received a 2.5% cost-of-living boost in 2025 and a 3.2% increase in their benefits in 2024, after a historically large 8.7% benefit increase in 2023.",
    "link": "https://fortune.com/2025/10/24/social-security-cola-cost-of-living-adjustment-payment-increase-2026-inflation/",
    "timestamp": "2025-10-24T22:05:52Z"
  },
  {
    "title": "Chinese drug kingpin captured after audacious escape from house arrest",
    "description": "Zhi Dong Zhang, known as Brother Wang, was attempting to flee to Russia with false papers when his plot unravelled.",
    "link": "https://www.bbc.com/news/articles/cz0xd4dvzlyo",
    "timestamp": "2025-10-24T22:05:47Z"
  },
  {
    "title": "Canada Hails ‘Strategic Partnership’ with China as Trump Cuts Trade Talks",
    "description": "Canadian Foreign Minister Anita Anand on Monday hailed Communist China as a valuable strategic partner, a dramatic turnaround from years of tense relations between Ottawa and Beijing necessitated by Canada’s deteriorating relationship with the United States.\n…",
    "link": "https://www.breitbart.com/economy/2025/10/24/canada-hails-strategic-partnership-with-china-as-trump-cuts-trade-talks/",
    "timestamp": "2025-10-24T22:04:20Z"
  },
  {
    "title": "Michael Kovrig warns of China’s ‘diplomatic wrapping paper’ as Carney pursues deeper ties",
    "description": "As Prime Minister Mark Carney aims to meet with Chinese President Xi Jinping amid a U.S. trade war, a former Canadian diplomat who spent more than a thousand days imprisoned in China is warning Ottawa to remember the threat China poses to Canada.",
    "link": "https://www.cbc.ca/news/politics/michael-kovrig-diplomat-china-carney-trade-9.6952748",
    "timestamp": "2025-10-24T22:04:14Z"
  },
  {
    "title": "What’s at Stake in This Health Care Fight?",
    "description": "Throughout the government shutdown, Democrats have justified their refusal to vote for a short-term funding extension by speaking of an impending health care crisis brought... Read More\nThe post What’s at Stake in This Health Care Fight? appeared first on The…",
    "link": "https://www.dailysignal.com/2025/10/24/whats-stake-this-health-care-fight/",
    "timestamp": "2025-10-24T22:03:24Z"
  },
  {
    "title": "Trump to nominate SEC's 'pro-crypto' Michael Selig as CFTC chair: Report",
    "description": "President Trump will reportedly name the Securities and Exchange Commission's Michael Selig to chair the Commodity Futures Trading Commission (CFTC).",
    "link": "https://cointelegraph.com/news/trump-nominate-sec-michael-selig-cftc-chair",
    "timestamp": "2025-10-24T22:03:19Z"
  },
  {
    "title": "12,000 comments poured in on North Carolina’s new Trump-backed map. And they weren’t positive",
    "description": "Lawmakers held no public forums in the affected areas and did no outreach to voters.",
    "link": "https://www.bostonherald.com/2025/10/24/north-carolina-map-comments/",
    "timestamp": "2025-10-24T22:03:00Z"
  },
  {
    "title": "New South Park Episode: Season 28 Episode 2 Airs Oct. 29",
    "description": "South Park is back with a new South Park episode this week. Season 28, Episode 2 premieres on Wednesday, October 29, 2025, at 10:00 p.m. ET on Comedy Central, with streaming on Paramount+ beginning Thursday, October 30, 2025. The shift from Season 27 to a new…",
    "link": "https://www.buddytv.com/new-south-park-episode-season-28-episode-2-airs-oct-29/",
    "timestamp": "2025-10-24T22:02:24Z"
  },
  {
    "title": "‘CBS Evening News’ Only Broadcast Network To Say Nothing On-Air About Trump Pardon Of Money-Laundering Crypto CEO; Changpeng Zhao Has Biz Connections To POTUS Family",
    "description": "Among the broadcast networks, the CBS Evening News on Thursday was the only news program not to mention Donald Trump’s sudden pardon of money-laundering cryptocurrency billionaire Changpeng Zhao.\nWhile ABC, CBS and PBS all covered the somewhat surprising lega…",
    "link": "https://biztoc.com/x/5f4c73969d1168a2",
    "timestamp": "2025-10-24T22:02:13Z"
  },
  {
    "title": "Kai Trump tries to follow in Travis Kelce's footsteps and ends up leaking the secret that the White House has kept hidden for months",
    "description": "An Instagram post by Kai Trump has inadvertently provided new context to President Donald Trump&apos;s ongoing hand injury, revealing that the bruising may have appeared weeks befo",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/10/24/68fbd6ffe2704e7e438b4576.html",
    "timestamp": "2025-10-24T22:02:02Z"
  },
  {
    "title": "Ben Shapiro Hits Trump for Seeking $230 Million From DOJ: ‘Rife With Conflicts Of Interest’",
    "description": "Conservative podcaster Ben Shapiro took issue with President Donald Trump’s push to receive millions of dollars in damages from the Department of Justice on Friday, warning that the move could lead to “a massive number of lawsuits or even an impeachment in th…",
    "link": "https://www.mediaite.com/media/news/ben-shapiro-hits-trump-for-seeking-230-million-from-doj-rife-with-conflicts-of-interest/",
    "timestamp": "2025-10-24T22:01:28Z"
  },
  {
    "title": "CZ’s Full Pardon Marks New Era For Binance: Asian Expansion And Stablecoin Supremacy",
    "description": "In a stunning turn of events, US President Donald Trump has issued a full pardon for Changpeng “CZ” Zhao, the founder of Binance, the world’s largest cryptocurrency exchange. Zhao had pleaded guilty in late 2023 to a single count of failing to maintain an ade…",
    "link": "https://bitcoinist.com/czs-pardon-marks-new-era-binance-asian-expansion/",
    "timestamp": "2025-10-24T22:00:50Z"
  },
  {
    "title": "Democrats, liberal media figures fume over Trump demolishing White House East Wing for ballroom",
    "description": "Top Democrats and media figures condemned President Donald Trump's White House ballroom construction after crews bulldozed the East Wing on Monday.",
    "link": "https://www.foxnews.com/media/democrats-liberal-media-figures-fume-over-trump-demolishing-white-house-east-wing-ballroom",
    "timestamp": "2025-10-24T22:00:23Z"
  },
  {
    "title": "Union Pacific Eyes Early Filing for Norfolk Southern Takeover",
    "description": "The Class I railroad aims to submit its merger application to the STB by late November as industry rivals push back and the Trump administration signals...",
    "link": "https://sourcingjournal.com/topics/logistics/union-pacific-norfolk-southern-stb-merger-takeover-acquisition-application-filing-november-december-jim-vena-1234786319/",
    "timestamp": "2025-10-24T22:00:12Z"
  },
  {
    "title": "Rattled Trump had terse discussion with Secret Service after protesters got too​ close",
    "description": "President Donald Trump was reportedly so rattled after protesters got \"so close\" to him at a Washington, D.C. restaurant last month that his team had a tense conversation over his security with the Secret Service. Trump doesn't often make unplanned visits — a…",
    "link": "https://www.rawstory.com/donald-trump-2674231688/",
    "timestamp": "2025-10-24T22:00:02Z"
  },
  {
    "title": "Texas state Rep. Jolanda Jones didn't literally call for slashing Republicans' necks",
    "description": "Democratic Texas state Rep. Jolanda Jones said about fighting back against Republicans: \"So if you hit me in my face, I'm not going to punch you back in your face, I'm going to go across your neck. […] You've got to hit hard enough where they won't come back.\"",
    "link": "https://www.snopes.com//fact-check/texas-jolanda-jones-republicans/",
    "timestamp": "2025-10-24T21:58:00Z"
  },
  {
    "title": "Netflix’s Gay Military Drama Isn’t Meant to Be ‘Woke Garbage’ or ‘Propaganda’",
    "description": "The creator of ‘Boots,’ Andy Parker, says he didn’t mean to make a show that is ‘woke garbage’ or ‘military propaganda.’ ‘It’s after something more subtle.”",
    "link": "http://www.vulture.com/article/boots-netflix-creator-pentagon-woke-garbage.html",
    "timestamp": "2025-10-24T21:55:33Z"
  },
  {
    "title": "Trump administration tells Colorado wolves must come from U.S. Rockies states, not Canada",
    "description": "Colorado has been releasing wolves west of the Continental Divide since 2023 after Colorado voters narrowly approved wolf reintroduction in 2020.",
    "link": "https://www.denverpost.com/2025/10/24/colorado-wolves-trump-canada/",
    "timestamp": "2025-10-24T21:52:20Z"
  },
  {
    "title": "Trump administration tells Colorado wolves must come from U.S. Rockies states, not Canada",
    "description": "The Trump administration is telling Colorado to stop importing gray wolves from Canada as part of the state’s efforts to restore the predators, a shift that ...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-tells-colorado-wolves-215220035.html",
    "timestamp": "2025-10-24T21:52:20Z"
  },
  {
    "title": "DHS Is Billing Unaccompanied Immigrant Kids $5,000",
    "description": "The Trump administration is slapping teenagers in federal custody with fees for crossing the border under the One Big Beautiful Bill Act. \nThe post DHS Is Billing Unaccompanied Immigrant Kids $5,000 appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/24/dhs-ice-immigrant-teenagers-detention-fines/",
    "timestamp": "2025-10-24T21:47:25Z"
  },
  {
    "title": "Trump Picks SEC Crypto Task Force’s Mike Selig to Run CFTC: Report",
    "description": "Selig, chief counsel for the SEC’s pro-crypto task force, is the president’s latest choice to run the CFTC, according to a Bloomberg report.",
    "link": "https://decrypt.co/345957/trump-sec-crypto-task-forces-mike-selig-cftc-report",
    "timestamp": "2025-10-24T21:47:12Z"
  },
  {
    "title": "Trump expected to name White House ballroom after himself, report says",
    "description": "President Donald Trump is expected to name the new White House ballroom, being constructed where the East Wing once stood for more than 120 years, after...",
    "link": "https://www.nydailynews.com/2025/10/24/white-house-ballroom-new-name-trump/",
    "timestamp": "2025-10-24T21:47:00Z"
  },
  {
    "title": "Canada Launches Anti-Dumping Probe of Chinese Truck Body Imports",
    "description": "Canada is launching an anti-dumping investigation into truck body imports from China just as Prime Minister Mark Carney is trying to ease trade tensions with the east Asian country.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-launches-anti-dumping-probe-of-chinese-truck-body-imports",
    "timestamp": "2025-10-24T21:45:08Z"
  },
  {
    "title": "S&P 500 Hits Record After Soft CPI, Led by Tech Mega-Cap Gains",
    "description": "US stocks closed at a new high on Friday, as traders cheered softer-than-anticipated inflation data that underpinned expectations for Federal Reserve interest-rate cuts. Technology giants including Nvidia Corp., Apple Inc. and Broadcom Inc. led gains in the S…",
    "link": "https://financialpost.com/pmn/business-pmn/sp-500-hits-record-after-soft-cpi-led-by-tech-mega-cap-gains",
    "timestamp": "2025-10-24T21:45:00Z"
  },
  {
    "title": "Colleen Hoover’s Adorable Trauma Plots",
    "description": "From the daily newsletter: “Regretting You,” the latest adaptation of the author’s, feels somehow formulaic and improbable.",
    "link": "https://www.newyorker.com/newsletter/the-daily/colleen-hoovers-adorable-trauma-plots",
    "timestamp": "2025-10-24T21:43:48Z"
  }
]