[
  {
    "title": "Klobuchar updates on efforts to end Canada tariffs during Moorhead visit",
    "description": "Sean Syverson, owner of Swing Barrel Brewing Company, talked about the ongoing unpredictability businesses are facing around tariffs at a press conference with U.S. Sen. Amy Klobuchar, D-Minn.",
    "link": "https://www.inforum.com/news/moorhead/klobuchar-updates-on-efforts-to-end-canada-tariffs-during-moorhead-visit",
    "timestamp": "2026-02-16T20:15:36Z"
  },
  {
    "title": "GA Senate Candidate Says He Didn’t Vote For Nearly Two Decades",
    "description": "Derek Dooley, a former football coach, says he did not vote for nearly two decades. He thinks that makes him a good candidate to replace Georgia’s Jon Ossoff in the U.S. Senate.\nI guess Herschel Walker was unavailable.\nDooley did not vote for Donald Trump in …",
    "link": "https://crooksandliars.com/2026/02/ga-senate-candidate-says-he-didn-t-vote",
    "timestamp": "2026-02-16T20:13:47Z"
  },
  {
    "title": "Trump Boasts He Now Has Highest Approval Rating Of Any Current U.S. President",
    "description": "WASHINGTON, D.C. — President Donald Trump proudly announced Monday that he now has the highest approval rating of any current U.S. president.",
    "link": "https://babylonbee.com/news/trump-boasts-he-now-has-highest-approval-rating-of-any-current-us-president",
    "timestamp": "2026-02-16T20:13:39Z"
  },
  {
    "title": "Pro-Trump Radio Host Calls Spike Lee a ‘Little P*ssy’ in Wild Rant About Director’s Pro-Palestine Outfit",
    "description": "Sid Rosenberg shredded Spike Lee for wearing a pro-Palestine outfit to the NBA All-Star Game, calling the director a \"little p*ssy\" who deserved a pummeling\nThe post Pro-Trump Radio Host Calls Spike Lee a ‘Little P*ssy’ in Wild Rant About Director’s Pro-Pales…",
    "link": "https://www.mediaite.com/media/pro-trump-radio-host-calls-spike-lee-a-little-pssy-in-wild-rant-about-directors-pro-palestine-outfit/",
    "timestamp": "2026-02-16T20:07:49Z"
  },
  {
    "title": "ROOKE: Vance And Rubio Deliver One-Two Punch To Our Western Allies In Munich",
    "description": "Few maneuvers capture the essence of strategic persuasion as vividly as the \"one-two punch\" masterfully delivered at the Munich Security Conference.",
    "link": "https://dailycaller.com/2026/02/16/jd-vance-marco-rubio-munich-security-conference-christian-hertitage-western-civilization-viral-speech-history/",
    "timestamp": "2026-02-16T20:05:45Z"
  },
  {
    "title": "'Really?' Pam Bondi buried on MS NOW for dragging Marilyn Monroe into Epstein saga",
    "description": "A massive list of names discovered in the Jeffrey Epstein files, which was released over the weekend by Attorney General Pam Bondi, contained a handful of celebrities, including one who died when the accused sex trafficker was still a child.That led to rolled…",
    "link": "https://www.rawstory.com/pam-bondi-2675273128/",
    "timestamp": "2026-02-16T20:01:53Z"
  },
  {
    "title": "Sharia law victim who fled Somalia issues endorsement in critical Senate race",
    "description": "Ayaan Hirsi Ali, who fled Sharia law, has endorsed Sen. John Cornyn, R-Texas, for re-election in a critical Senate race that could determine whether the GOP retains its majority.",
    "link": "https://www.foxnews.com/politics/exclusive-sharia-law-victim-who-fled-somalia-issues-endorsement-critical-senate-race",
    "timestamp": "2026-02-16T20:01:22Z"
  },
  {
    "title": "Treasury boss Iain Rennie raises flags over New Zealand being indebted to opaque foreign investors, as global factors push up interest costs",
    "description": "Around 60% of new New Zealand Government Bonds are now held offshore.",
    "link": "https://www.nzherald.co.nz/business/economy/treasury-boss-iain-rennie-raises-flags-over-nz-being-indebted-to-opaque-foreign-investors-as-global-factors-push-up-interest-costs/premium/LWFOQHVEM5DKVIZXTXCXY3PMSU/",
    "timestamp": "2026-02-16T20:00:00Z"
  },
  {
    "title": "Trump wants critical minerals. So do Cornwall’s MPs.",
    "description": "Global leaders are going head to head over critical minerals and national security. For some U.K. lawmakers, it is chance to grab both investment and votes.",
    "link": "https://www.politico.eu/article/labour-uk-parliament-seat-critical-minerals-noah-law-jayne-kirkham/",
    "timestamp": "2026-02-16T20:00:00Z"
  },
  {
    "title": "Rubio shines on global stage while AOC, Whitmer, and Newsom take heat",
    "description": "Democratic 2028 hopefuls face criticism after Munich Security Conference appearances, with Alexandria Ocasio-Cortez drawing scrutiny for foreign policy stumbles.",
    "link": "https://www.foxnews.com/politics/rubio-shines-global-stage-while-aoc-whitmer-newsom-take-heat",
    "timestamp": "2026-02-16T19:55:59Z"
  },
  {
    "title": "'No way out': Young voters now regret voting for Trump",
    "description": "Young voters who pledged their support to Donald Trump and the Republican Party at the last election are suffering from buyer's remorse. A collection of young people who voted for the GOP at the 2024 election highlighted the many problems now facing their gen…",
    "link": "https://www.rawstory.com/trump-midterms-2675272269/",
    "timestamp": "2026-02-16T19:55:02Z"
  },
  {
    "title": "Stephen A Smith says Trump right to secure border, says 'emergency efforts were necessary' after Biden's term",
    "description": "Stephen A. Smith said he begrudgingly understands President Donald Trump's extraordinary methods to enforce immigration after former President Joe Biden's mishandling of the border.",
    "link": "https://www.foxnews.com/media/stephen-smith-says-trump-right-secure-border-says-emergency-efforts-were-necessary-after-bidens-term",
    "timestamp": "2026-02-16T19:54:23Z"
  },
  {
    "title": "After Years of Border Crisis, Small Texas Town ‘Back to Mayberry’",
    "description": "BRACKETTVILLE, Texas—The chaos caused by millions of illegal immigrants flooding across the southwest border under the Biden administration left scars on this border town. The constant high-speed chases, buzzing helicopters, screaming emergency sirens, hurrie…",
    "link": "https://freerepublic.com/focus/f-chat/4367092/posts",
    "timestamp": "2026-02-16T19:51:20Z"
  },
  {
    "title": "'The Most Severe': Donald Trump Calls for Nancy Guthrie Kidnappers to Face Death Penalty If She Doesn't Come Home Alive",
    "description": "President Donald Trump said he'd want the DOJ to seek the death penalty against Nancy Guthrie's kidnappers.",
    "link": "https://radaronline.com/p/donald-trump-calls-for-nancy-guthrie-kidnapper-death-penalty-if-found-dead/",
    "timestamp": "2026-02-16T19:45:00Z"
  },
  {
    "title": "Senate Dems Push Trump DOJ to Reveal All Talks With Lobbyists About Ouster of Antitrust Chief",
    "description": "A group of Democrats in the US Senate is pressuring President Donald Trump's Justice Department to hand over any and all communications between the agency and corporate lobbyists related to last week's ouster of antitrust chief Gail Slater, which came weeks b…",
    "link": "https://www.commondreams.org/news/gail-slater-firing",
    "timestamp": "2026-02-16T19:44:11Z"
  },
  {
    "title": "Francesca Albanese Defenders Decry Bid to Remove UN Expert Over Misrepresented Israel Remarks",
    "description": "Human rights advocates, United Nations officials, and prominent international artists are among those defending UN independent Palestine expert Francesca Albanese in recent days amid a smear campaign by several European foreign ministers and pro-Israel groups…",
    "link": "https://www.commondreams.org/news/defending-francesca-albanese",
    "timestamp": "2026-02-16T19:42:39Z"
  },
  {
    "title": "France’s Macron eyes fighter jet deal in India",
    "description": "French President Emmanuel Macron begins a three-day visit to India on Tuesday, with talks focused on artificial intelligence cooperation and a potential multibillion dollar Dassault Rafale fighter jet deal. France is seeking to expand its military partnership…",
    "link": "https://www.digitaljournal.com/world/frances-macron-eyes-fighter-jet-deal-in-india/article",
    "timestamp": "2026-02-16T19:42:20Z"
  },
  {
    "title": "Nolte: Trump Warns Kidnappers Death Penalty Awaits if Nancy Guthrie Not Returned Alive",
    "description": "President Donald Trump used the bully pulpit Monday to threaten Nancy Guthrie’s alleged kidnappers with the death penalty if they do not return the 84-year-old alive.\nThe post Nolte: Trump Warns Kidnappers Death Penalty Awaits if Nancy Guthrie Not Returned Al…",
    "link": "https://www.breitbart.com/politics/2026/02/16/nolte-trump-warns-kidnappers-death-penalty-awaits-if-nancy-guthrie-not-returned-alive/",
    "timestamp": "2026-02-16T19:41:08Z"
  },
  {
    "title": "Huckabee warns: Iran faces ‘second kick of a mule’",
    "description": "US Ambassador Mike Huckabee says US and Israel are aligned on Iran, calls Trump-Netanyahu talks historic, warns threat is global.",
    "link": "https://www.israelnationalnews.com/news/422521",
    "timestamp": "2026-02-16T19:31:10Z"
  },
  {
    "title": "President Trump Threatens Nancy Guthrie Kidnappers With Death Penalty",
    "description": "President Donald Trump is issuing a threat to the alleged abductor or abductors of Savannah Guthrie’s mom, Nancy Guthrie. Trump, 79, told the New York Post on Monday, February 16, that her kidnappers would face “very, very severe — the most severe” federal co…",
    "link": "https://www.usmagazine.com/celebrity-news/news/president-trump-threatens-nancy-guthrie-kidnappers-with-death-penalty/",
    "timestamp": "2026-02-16T19:27:28Z"
  },
  {
    "title": "America holds its breath as search for TV host's mother enters third week",
    "description": "People are not watching the search for Nancy Guthrie because they are obligated to, but because this story touches something universal: the ache of not knowing.",
    "link": "https://news.sky.com/story/america-holds-its-breath-as-search-for-tv-host-savannah-guthries-mother-enters-third-week-13508343",
    "timestamp": "2026-02-16T19:25:00Z"
  },
  {
    "title": "STEVE MILLOY: Louisiana Larceny And President Trump’s Lousy Friends",
    "description": "President Donald Trump has a lousy friend in Republican Louisiana Gov. Jeff Landry. The governor recently unveiled a new plan purporting to align Louisiana with",
    "link": "https://dailycaller.com/2026/02/16/opinion-louisiana-larceny-and-president-trumps-lousy-friends-steve-milloy/",
    "timestamp": "2026-02-16T19:23:31Z"
  },
  {
    "title": "CTU on the Death of Ofelia Torres",
    "description": "A statement from the Chicago Teachers Union on the passing of Ofelia Torres, a 16-year-old junior at Lake View High School: After months of fighting both cancer and the cruelty of Trump’s unconscionable and inhumane immigration policies, one of our own precio…",
    "link": "https://www.commondreams.org/newswire/ctu-on-the-death-of-ofelia-torres",
    "timestamp": "2026-02-16T19:19:15Z"
  },
  {
    "title": "Stephen A. Smith Dismisses Idea Racism Could Tank Potential Presidential Run: Americans ‘Don’t Give a Damn’",
    "description": "ESPN star Stephen A. Smith said he is not worried about racism hurting his chances of becoming president, if he decides to run, during a new interview with CBS\nThe post Stephen A. Smith Dismisses Idea Racism Could Tank Potential Presidential Run: Americans ‘D…",
    "link": "https://www.mediaite.com/media/stephen-a-smith-dismisses-idea-racism-could-tank-potential-presidential-run-americans-dont-give-a-damn/",
    "timestamp": "2026-02-16T19:17:23Z"
  },
  {
    "title": "Ukraine's Zelesnkyy says he met with Democratic senators, thanked US for support",
    "description": "Ukraine's President Volodymyr Zelenskyy noted that he thanked America for its support while meeting with U.S. Sens. Richard Blumenthal and Sheldon Whitehouse.",
    "link": "https://www.foxnews.com/world/ukraines-zelesnkyy-says-he-met-democratic-senators-thanked-us-support",
    "timestamp": "2026-02-16T19:14:26Z"
  },
  {
    "title": "Trump Insists Others ‘Brought Up’ Renaming Landmark ‘TRUMP STATION’ — Despite Report He Held Up Billions in Public Funds to Make it Happen",
    "description": "President Donald Trump denied that he wanted to rename New York City's Penn Station the \"TRUMP STATION,\" despite a recent report that he withheld billions of dollars in federal funding to do just that.\nThe post Trump Insists Others ‘Brought Up’ Renaming Landm…",
    "link": "https://www.mediaite.com/media/news/trump-insists-others-brought-up-renaming-landmark-trump-station-despite-report-he-held-up-billions-in-public-funds-to-make-it-happen/",
    "timestamp": "2026-02-16T19:11:58Z"
  },
  {
    "title": "If the SEC stays softer, Aave’s DAO could start capturing $100M+ annualized revenue",
    "description": "Aave Labs posted a governance proposal on Feb. 12 asking tokenholders to endorse a strategic package that would direct 100% of Aave-branded product revenue to the DAO treasury, formalize brand protection, and center the roadmap on Aave V4. The initiative was …",
    "link": "https://cryptoslate.com/if-the-sec-stays-softer-aaves-dao-could-start-capturing-100m-annualized-revenue/",
    "timestamp": "2026-02-16T19:10:50Z"
  },
  {
    "title": "What we know about the dissapearance of Nancy Guthrie two weeks on",
    "description": "There have been several apparent breakthroughs in the case, but two weeks on Nancy’s whereabouts are still unknown.",
    "link": "https://www.thejournal.ie/nancy-guthrie-2-6959071-Feb2026/",
    "timestamp": "2026-02-16T19:09:26Z"
  },
  {
    "title": "Trump Administration Creating Plan for Tech Companies to Pay Full Costs of AI Data Center Power, Water Usage",
    "description": "The Trump administration is exploring measures to require technology companies building data centers to absorb all associated utility and infrastructure costs as electricity prices continue to rise across the United States.\nThe post Trump Administration Creat…",
    "link": "https://www.breitbart.com/tech/2026/02/16/trump-administration-creating-plan-for-tech-companies-to-pay-full-costs-of-ai-data-center-power-water-usage/",
    "timestamp": "2026-02-16T19:06:30Z"
  },
  {
    "title": "It’s The Munich Security Conference, Starring AOC, An Astronaut, And The Woman Who Warned Everybody!",
    "description": "Also featuring a cameo from sniveling dictator-sucker Marco Rubio.",
    "link": "https://www.wonkette.com/p/its-the-munich-security-conference",
    "timestamp": "2026-02-16T19:03:29Z"
  },
  {
    "title": "Pres. Trump coming to north Georgia this week",
    "description": "President Donald Trump is set to speak Thursday in Rome, according to sources.",
    "link": "https://www.wsbtv.com/news/local/pres-trump-coming-north-georgia-this-week/Y6XMKVEQQVA4BARYXQ66X5UC4A/",
    "timestamp": "2026-02-16T19:02:33Z"
  },
  {
    "title": "'Pretty girls should always smile': The oldest trick in the patriarchal playbook",
    "description": "Why men telling women to “smile” and “look happy” has nothing to do with happiness — and everything to do with control, writes Simon Tierney.",
    "link": "https://www.thejournal.ie/readme/women-should-smile-more-6954733-Feb2026/",
    "timestamp": "2026-02-16T19:00:43Z"
  },
  {
    "title": "Agitator arrested on battery charge outside Trump's West Palm Beach golf course",
    "description": "Police arrested a man arrested he allegedly struck an anti-Trump protester outside Trump's West Palm Beach golf course during this weekend.",
    "link": "https://www.foxnews.com/us/agitator-arrested-battery-charge-outside-trumps-west-palm-beach-golf-course",
    "timestamp": "2026-02-16T19:00:02Z"
  },
  {
    "title": "Families fear 'forced confessions' of 'scapegoats' could result in executions",
    "description": "Families of Baha'i youth arrested by Iran's security forces say they've been subject to \"forced confessions\" and fear they may face the death penalty.",
    "link": "https://www.abc.net.au/news/2026-02-17/iran-forced-confessions-bahai-scapegoats-face-execution/106349538",
    "timestamp": "2026-02-16T18:57:54Z"
  },
  {
    "title": "GOP states move to make church service disruptions a felony after Minnesota storming",
    "description": "GOP leaders are mulling efforts to increase penalties on protesters disrupting church services, in direct response to the Minnesota unrest.",
    "link": "https://www.foxnews.com/politics/gop-states-move-make-church-service-disruptions-felony-after-minnesota-storming",
    "timestamp": "2026-02-16T18:56:25Z"
  },
  {
    "title": "George W. Bush launches subtle Presidents' Day digs at Trump",
    "description": "Former President George W. Bush aimed subtle digs at Donald Trump in a Presidents' Day message — laying out observations about the nation's first leader amid the country's current troubled times.The 43rd president of the United States described the significan…",
    "link": "https://www.rawstory.com/george-w-bush-2675273071/",
    "timestamp": "2026-02-16T18:55:48Z"
  },
  {
    "title": "No Plan for Mideast Peace Will Work Without Recognizing Palestinians' Full Humanity",
    "description": "When President Donald Trump convened his so-called Board of Peace in Davos, Switzerland, a key item on the agenda was to endorse his son-in-law Jared Kushner’s extravagant (and, I might add, detached from reality) plan for a “New Gaza.” The rendering of Kushn…",
    "link": "https://www.commondreams.org/opinion/peace-palestinian-rights",
    "timestamp": "2026-02-16T18:51:55Z"
  },
  {
    "title": "Donald Trump Warns Nancy Guthrie Abductors Will Face Death Penalty If She Dies",
    "description": "Donald Trump is making it crystal clear ... if Nancy Guthrie’s kidnappers don’t bring her back alive, they could be staring down the ultimate punishment: the death penalty. The President told the New York Post in a phone call the abductors need…",
    "link": "https://www.tmz.com/2026/02/16/trump-wants-death-penalty-if-nancy-guthrie-is-dead/",
    "timestamp": "2026-02-16T18:51:35Z"
  },
  {
    "title": "UFC CEO Dana White confirms White House card is done",
    "description": "What once looked like a wild idea from President of the United States Donald Trump appears one step closer to materializing. UFC CEO Dana White provided a major update on the event held at the White House later this year.…",
    "link": "https://www.thebiglead.com/ufc-ceo-dana-white-white-house-card-done/",
    "timestamp": "2026-02-16T18:46:12Z"
  },
  {
    "title": "Obama Calls Trump’s Racist Video A ‘Clown Show’",
    "description": "Obama Calls Trump’s Racist Video A ‘Clown Show’littlethings.com",
    "link": "https://littlethings.com/entertainment/obama-speaks-out-trump-racist-ape-post",
    "timestamp": "2026-02-16T18:43:59Z"
  },
  {
    "title": "Nancy Guthrie case update: Trump warns of ‘most severe’ penalties as search for Nancy Guthrie intensifies",
    "description": "President Trump vowed \"most severe\" federal penalties for those responsible for kidnapping Nancy Guthrie, mother of NBC's Savannah Guthrie. He indicated the Justice Department would seek the death penalty if she is killed. The FBI is investigating, with recen…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nancy-guthrie-case-update-trump-warns-of-most-severe-penalties-as-search-for-nancy-guthrie-intensifies/articleshow/128433542.cms",
    "timestamp": "2026-02-16T18:42:40Z"
  },
  {
    "title": "Marco Rubio on Iran Talks: ‘We Are Dealing With Radical Shiite Clerics’ Driven by ‘Pure Theology’",
    "description": "Secretary of State Marco Rubio said the United States is negotiating with Iran’s leadership despite what he described as “radical Shiite clerics” who make political decisions based on “pure theology.”\nThe post Marco Rubio on Iran Talks: ‘We Are Dealing With R…",
    "link": "https://www.breitbart.com/politics/2026/02/16/marco-rubio-on-iran-talks-we-are-dealing-with-radical-shiite-clerics-driven-by-pure-theology/",
    "timestamp": "2026-02-16T18:37:57Z"
  },
  {
    "title": "Orban vital for US ‘national interest’ – Rubio",
    "description": "US Secretary of State Marco Rubio has pledged Washington’s support for Hungarian PM Viktor Orban ahead of parliamentary elections Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632614-us-hungary-orban-support/",
    "timestamp": "2026-02-16T18:37:02Z"
  },
  {
    "title": "Carney Taps Veteran Charette as Chief Trade Negotiator to US",
    "description": "Canadian Prime Minister Mark Carney appointed a veteran public servant as his government’s next chief trade negotiator with the US, putting her at the center of a review of the North American trade pact at a time of testy relations between the two countries.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-taps-veteran-charette-as-chief-trade-negotiator-to-us",
    "timestamp": "2026-02-16T18:31:03Z"
  },
  {
    "title": "Ghislaine Maxwell Could End Up Kissing Her American Citizenship Goodbye",
    "description": "Ghislaine Maxwell's answers on a U.S. citizenship form could come back to haunt her.",
    "link": "https://dailycaller.com/2026/02/16/trump-admin-ghislaine-maxwell-citizenship/",
    "timestamp": "2026-02-16T18:30:29Z"
  },
  {
    "title": "Trump’s Board Of Peace Pledged Thousands Of Troops For Gaza Deployment",
    "description": "United States ruler Donald Trump's Board of Peace has vowed to send thousands of troops to Gaza for deployment. Trump made the announcement in a Truth Social post, saying countries taking part in the initiative will formalize their commitments at a meeting on…",
    "link": "https://www.shtfplan.com/war/trumps-board-of-peace-pledged-thousands-of-troops-for-gaza-deployment",
    "timestamp": "2026-02-16T18:30:19Z"
  },
  {
    "title": "Hungary Seeks Croatian Help As Russian Oil Flows Via Ukraine Halted",
    "description": "Hungary and Slovakia have formally requested that Croatia authorize the transit of Russian crude oil via the Adriatic pipeline, following the complete suspension of oil flows through the Ukrainian section of the Druzhba pipeline, which has been out of service…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Hungary-Seeks-Croatian-Help-As-Russian-Oil-Flows-Via-Ukraine-Halted.html",
    "timestamp": "2026-02-16T18:30:00Z"
  },
  {
    "title": "Judge hits Trump with severe rebuke as admin ordered to return slavery exhibit to museum",
    "description": "A federal judge has ordered President Donald Trump's administration to return an exhibit on slavery to Philadelphia's Independence National Historical Park.In a 40-page ruling on Monday, U.S. District Court Judge Cynthia Rufe compared the Interior Department …",
    "link": "https://www.rawstory.com/trump-slavery-2675273197/",
    "timestamp": "2026-02-16T18:24:28Z"
  },
  {
    "title": "Democrat lawmakers rush to bash Trump even as jobs, inflation reports beat projections",
    "description": "Democrats blast Trump's economy, despite strong January data showing 2.5% inflation and 130,000 jobs added, citing \"unaffordability crisis\" concerns.",
    "link": "https://www.foxnews.com/politics/democrat-lawmakers-rush-bash-trump-even-jobs-inflation-reports-beat-projections",
    "timestamp": "2026-02-16T18:23:43Z"
  },
  {
    "title": "Iran meets UN nuclear watchdog ahead of U.S. talks",
    "description": "\"I am in Geneva with real ideas to achieve a fair and equitable deal,\" Iranian Foreign Minister Abbas Araghchi wrote on X. \"What is not on the table: submission before threats.\"",
    "link": "https://www.pbs.org/newshour/world/iran-meets-un-nuclear-watchdog-ahead-of-u-s-talks",
    "timestamp": "2026-02-16T18:22:40Z"
  },
  {
    "title": "Only solution to Trump is deeper EU integration, Letta says",
    "description": "Former Italian prime minister Enrico Letta says Europe must move to one integrated market if it wants to compete with US and China",
    "link": "https://www.irishtimes.com/business/2026/02/16/only-solution-to-trump-is-deeper-eu-integration-letta-says/",
    "timestamp": "2026-02-16T18:21:34Z"
  },
  {
    "title": "From Gaza to Cuba, Canada Remains the World’s Most Tactful Bystander",
    "description": "The world is witnessing yet another manufactured humanitarian catastrophe unfolding in plain sight in Cuba. This crisis is not the result of any internal collapse or mismanagement. It is the deliberate outcome of United States policy, a policy of collective p…",
    "link": "https://www.commondreams.org/opinion/canada-us-imperialism",
    "timestamp": "2026-02-16T18:18:42Z"
  },
  {
    "title": "Steve Bannon, Who Called Epstein “God,” Finally Responds to Files",
    "description": "Former Donald Trump adviser Steve Bannon once called Jeffrey Epstein “God” during a text message exchange, newly released government files reveal. In May 2018, the two men were having a discussion about currency trading, in which Bannon praised Epstein’s fina…",
    "link": "https://newrepublic.com/post/206621/steve-bannon-epstein-god-files",
    "timestamp": "2026-02-16T18:15:57Z"
  },
  {
    "title": "Backed by Billions in New Funds, Trump's ICE Works to Deputize Local Police Nationwide",
    "description": "The US Department of Homeland Security is partially shut down due to a congressional funding fight, but armed with an extra $75 billion from last year's Republican budget package, Immigration and Customs Enforcement is not only expanding its concentration cam…",
    "link": "https://www.commondreams.org/news/police-ice",
    "timestamp": "2026-02-16T18:15:37Z"
  },
  {
    "title": "GOP lawmaker joins Democrat-led effort to limit Trump's pardon power",
    "description": "GOP Rep. Don Bacon supports a Democrat-led constitutional amendment to create congressional oversight of presidential pardons following President Trump’s recent NFL pardons.",
    "link": "https://www.foxnews.com/politics/gop-lawmaker-joins-democrat-led-effort-limit-trumps-pardon-power",
    "timestamp": "2026-02-16T18:11:35Z"
  },
  {
    "title": "Mercosur deal has \"positive aspects\" - former Italian PM",
    "description": "The Mercosur trade deal, which was controversially opposed by Ireland has \"positive aspects\" which will overcome its other features, the former Italian Prime Minister Enrico Letta said while on a visit to Dublin.",
    "link": "https://www.rte.ie/news/business/2026/0216/1558826-mercorsur-italian-pm/",
    "timestamp": "2026-02-16T18:11:11Z"
  },
  {
    "title": "‘War on Drugs’ crusader Bill Bennett breaks with Trump as White House moves to ease federal marijuana rules",
    "description": "Reagan administration official William Bennett breaks with Trump on cannabis policy, citing concerns about youth marijuana use, school absenteeism and academic performance decline.",
    "link": "https://www.foxnews.com/politics/war-drugs-crusader-bill-bennett-breaks-trump-white-house-moves-ease-federal-marijuana-rules",
    "timestamp": "2026-02-16T18:06:01Z"
  },
  {
    "title": "Dan Turrentine Says AOC ‘Not Ready’ For Primetime After Her World Stage ‘Fumble’",
    "description": "Dan Turrentine said Alexandria Ocasio-Cortez's handling of her rambling response showed she was unprepared to pursue the presidency.",
    "link": "https://dailycaller.com/2026/02/16/dan-turrentine-aoc-not-ready-for-primetime-world-stage/",
    "timestamp": "2026-02-16T18:05:00Z"
  },
  {
    "title": "Kremlin says main Ukraine issues will be discussed in Geneva talks, including territory",
    "description": "Ukraine's \"main issues\" are to be discussed in peace talks held in Geneva this week, the Kremlin says.",
    "link": "https://www.channelnewsasia.com/world/ukraine-russia-us-kremlin-geneva-peace-talks-war-5934786",
    "timestamp": "2026-02-16T18:03:00Z"
  },
  {
    "title": "After Publicly Fleeing the U.S. over Trump, Rosie O'Donnell Quietly Returns to See if It’s 'Safe'",
    "description": "Rosie O'Donnell, who fled the United States and moved to Ireland with her teenage daughter just before President Donald Trump was inaugurated in January 2025 -- has quietly returned to the U.S. to see if it's \"safe\" to do so.",
    "link": "https://www.breitbart.com/entertainment/2026/02/16/after-publicly-fleeing-the-u-s-over-trump-rosie-odonnell-quietly-returns-to-see-if-its-safe/",
    "timestamp": "2026-02-16T18:02:43Z"
  },
  {
    "title": "Poland divided over relations with Trump administration",
    "description": "Marco Rubio praises Trump-friendly leaders of Hungary and Slovakia, while Warsaw wrestles with internal tensions over US ties",
    "link": "https://www.irishtimes.com/world/europe/2026/02/16/poland-divided-over-relations-with-trump-administration/",
    "timestamp": "2026-02-16T18:00:52Z"
  },
  {
    "title": "EHDD completes net-zero AIA Global Campus in Washington DC",
    "description": "The American Institute of Architects' new home in Washington DC has been designed by San Francisco-based EHDD to be \"one of the first fully decarbonised major renovations in the US\". The AIA Global Campus for Architecture & Design is part of a net-zero campus…",
    "link": "https://www.dezeen.com/2026/02/16/aia-global-campus-architecture-design-washington-dc-ehdd/",
    "timestamp": "2026-02-16T18:00:50Z"
  },
  {
    "title": "Israel lays down demands for US-Iran nuclear deal",
    "description": "Any deal with Iran on its nuclear program must strip the country of the ability to enrich uranium, Benjamin Netanyahu insists Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632612-netanyahu-iran-deal-dismantle-nuclear/",
    "timestamp": "2026-02-16T17:58:38Z"
  },
  {
    "title": "Trump Threatens Death Penalty If Nancy Guthrie Is Killed",
    "description": "President Donald Trump threatened Nancy Guthrie's alleged kidnappers with the death penalty if she is not returned alive.",
    "link": "https://dailycaller.com/2026/02/16/trump-threatens-death-penalty-nancy-guthrie-abductors-kash-patel-fbi-savannah/",
    "timestamp": "2026-02-16T17:58:23Z"
  },
  {
    "title": "US troops arrive in Nigeria to help train its military, Nigerian military says",
    "description": "The deployment follows an easing of tensions that flared between the U.S. and Nigeria",
    "link": "https://www.denverpost.com/2026/02/16/us-nigeria-military/",
    "timestamp": "2026-02-16T17:50:07Z"
  },
  {
    "title": "US troops arrive in Nigeria to help train its military, Nigerian military says",
    "description": "The deployment follows an easing of tensions that flared between the U.S. and Nigeria",
    "link": "https://www.bostonherald.com/2026/02/16/us-nigeria-military/",
    "timestamp": "2026-02-16T17:50:07Z"
  },
  {
    "title": "Marco Rubio Says Trump ‘Personally’ Asked Syrian President Ahmed al-Sharaa to End Clashes with Kurds",
    "description": "Secretary of State Marco Rubio said on Sunday that President Donald Trump “engaged personally” with Syrian President Ahmed al-Sharaa and Syrian Democratic Forces (SDF) command Mazloum Abdi to halt clashes between the Syrian army and the Kurdish-led SDF in lat…",
    "link": "https://www.breitbart.com/middle-east/2026/02/16/marco-rubio-says-trump-personally-asked-syrian-president-ahmed-al-sharaa-to-end-clashes-with-kurds/",
    "timestamp": "2026-02-16T17:47:04Z"
  },
  {
    "title": "Paris police raid Arab World Institute in connection with Epstein investigation",
    "description": "French authorities searched the headquarters for the Arab World Institute in relation to a Jeffrey Epstein investigation on Monday.",
    "link": "https://www.foxnews.com/world/paris-police-raid-arab-world-institute-connection-epstein-investigation",
    "timestamp": "2026-02-16T17:38:53Z"
  },
  {
    "title": "Bill Maher says Trump ‘yells’ at him via text for remaining a part of ‘lunatic left’ after their White House dinner",
    "description": "Bill Maher told CNN that President Trump routinely “yells” at him via text for remaining a part of the “lunatic left” following their buddy-buddy dinner at the White House last year.",
    "link": "https://nypost.com/2026/02/16/media/bill-maher-says-trump-routinely-yells-at-him-via-text-after-their-white-house-dinner/",
    "timestamp": "2026-02-16T17:36:16Z"
  },
  {
    "title": "In his Munich speech, Marco Rubio balanced loyalty to Trump with reassurances to Europe",
    "description": "The secretary of state’s speech was less divisive than J.D. Vance’s a year earlier, but it did not mark any significant change in US foreign policy under Trump.",
    "link": "https://theconversation.com/in-his-munich-speech-marco-rubio-balanced-loyalty-to-trump-with-reassurances-to-europe-275983",
    "timestamp": "2026-02-16T17:35:50Z"
  },
  {
    "title": "CBS Staff Furious Over Network Backing Epstein-Linked ‘Star’",
    "description": "CBS Staff Furious Over Network Backing Epstein-Linked ‘Star’thedailybeast.com",
    "link": "https://www.thedailybeast.com/cbs-staff-furious-over-network-backing-epstein-linked-star/",
    "timestamp": "2026-02-16T17:35:35Z"
  },
  {
    "title": "The New Global Order",
    "description": "As the post-Cold War era recedes, a more regional and competitive order is reasserting itself. Under these conditions, it is not surprising that larger powers would seek to shape their immediate surroundings – not only out of ambition, but also because they f…",
    "link": "https://www.project-syndicate.org/commentary/new-global-order-us-china-russia-pressuring-neighbors-because-constrained-elsewhere-by-nancy-qian-2026-02",
    "timestamp": "2026-02-16T17:35:30Z"
  },
  {
    "title": "‘Everything He’s Touched Turns to Garbage’: Trump Loses It on Gavin Newsom Over ‘Inappropriate’ Deal With UK",
    "description": "The comments came hours after Newsom signed a memorandum of understanding in London committing California and the UK to cooperate on clean energy technologies.\nThe post ‘Everything He’s Touched Turns to Garbage’: Trump Loses It on Gavin Newsom Over ‘Inappropr…",
    "link": "https://www.mediaite.com/media/news/everything-hes-touched-turns-to-garbage-trump-loses-it-on-gavin-newsom-over-inappropriate-deal-with-uk/",
    "timestamp": "2026-02-16T17:33:26Z"
  },
  {
    "title": "‘The city is like a ghost town’: Inside Cuba’s tourism collapse as fuel runs dry",
    "description": "Cuba has received no oil or fuel for a month after US president Donald Trump cut off Venezuelan supplies and pressed Mexico to stop  shipments",
    "link": "https://www.irishtimes.com/world/americas/2026/02/16/the-city-is-like-a-ghost-town-inside-cubas-tourism-collapse-as-fuel-runs-dry/",
    "timestamp": "2026-02-16T17:32:22Z"
  },
  {
    "title": "Trump’s revenge tour could have thousands of federal agents in Colorado next (Letters)",
    "description": "\"Don’t be surprised if Trump targets Colorado as the next stop on the ICE circus tour. Aside from his pre-existing grievances against us, we’re a natural target. Coloradans need to start preparing.\" -- Marty Rush, Salida",
    "link": "https://www.denverpost.com/2026/02/16/immigration-enforcement-colorado/",
    "timestamp": "2026-02-16T17:29:27Z"
  },
  {
    "title": "The US deal doesn’t compromise national interest, but brings us big benefits of trade liberalisation",
    "description": "India's trade deal with the US marks a significant breakthrough. The nation's media has overlooked the strategic advantages of strengthening ties with the superpower.  The agreement involves mutual tariff reductions, benefiting India's market access.  This mo…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/the-us-deal-doesnt-compromise-national-interest-but-brings-us-big-benefits-of-trade-liberalisation/articleshow/128432252.cms",
    "timestamp": "2026-02-16T17:29:11Z"
  },
  {
    "title": "Trump Celebrates President’s Day by Declaring Himself “the Hunter”",
    "description": "Donald Trump’s White House is posting about President’s Day in the creepiest way possible.In honor of the holiday, the White House Monday posted a menacing picture of Trump accompanied by the quote: “I was the hunted, and now I’m the hunter.”That particular c…",
    "link": "https://newrepublic.com/post/206619/trump-celebrates-president-day-declaring-the-hunter",
    "timestamp": "2026-02-16T17:28:59Z"
  },
  {
    "title": "Trump tears into Gavin Newsom as California gov signs clean energy deal with the UK: ‘His state has gone to hell’",
    "description": "Gavin Newsom's clean energy deal with the UK is \"inappropriate\" according to President Donald Trump.",
    "link": "https://nypost.com/2026/02/16/us-news/trump-says-gavin-newsoms-clean-energy-deal-with-uk-inappropriate/",
    "timestamp": "2026-02-16T17:26:59Z"
  },
  {
    "title": "Trump Vows Death Penalty for Nancy Guthrie’s Kidnappers if She’s Not Found Safe",
    "description": "President Donald Trump pledged to put Nancy Guthrie's kidnappers to death if the 84-year-old mother of Today show anchor Savannah Guthrie is not found alive.\nThe post Trump Vows Death Penalty for Nancy Guthrie’s Kidnappers if She’s Not Found Safe first appear…",
    "link": "https://www.mediaite.com/media/news/trump-vows-death-penalty-for-nancy-guthries-kidnappers-if-shes-not-found-safe/",
    "timestamp": "2026-02-16T17:24:56Z"
  },
  {
    "title": "Outrage after Israel approves West Bank land registration",
    "description": "Israel's government has approved a process to register land in the West Bank as \"state property\", drawing condemnation from Arab nations and critics who said it would accelerate annexation of the Palestinian territory.",
    "link": "https://www.rte.ie/news/middle-east/2026/0216/1558817-middle-east-latest/",
    "timestamp": "2026-02-16T17:21:06Z"
  },
  {
    "title": "Splinter at the Munich Security Conference: America, The Toxic Ex",
    "description": "Rubio made the MAGA nativism sound nicer, and Democrats promised a post-Trump restoration, but the damage to the Transatlantic relationship has been done.",
    "link": "https://www.jezebel.com/splinter-munich-security-conference",
    "timestamp": "2026-02-16T17:16:02Z"
  },
  {
    "title": "Ahead of Hungary's elections, Rubio says Trump is committed to PM Orban's success",
    "description": "BUDAPEST, Feb 16 (Reuters) - U.S. President ⁠Donald Trump is committed to the success of Hungarian Prime Minister Viktor Orban because his leadership and rapport with Trump are crucial to U.S. interests, ⁠U.S. Secretary of State Marco Rubio said on Monday, of…",
    "link": "https://www.thestar.com.my/news/world/2026/02/17/ahead-of-hungary039s-elections-rubio-says-trump-is-committed-to-pm-orban039s-success",
    "timestamp": "2026-02-16T17:15:00Z"
  },
  {
    "title": "Tom Homan Gets Big Mad On The Sunday Shows",
    "description": "We watch so you never have to!",
    "link": "https://www.wonkette.com/p/tom-homan-gets-big-mad-on-the-sunday",
    "timestamp": "2026-02-16T17:10:28Z"
  },
  {
    "title": "Crown Prince Pahlavi: The regime is stalling for time",
    "description": "In a Fox News interview, Reza Pahlavi urged President Trump and the international community to increase pressure on Iran’s regime and support anti-government protesters.",
    "link": "https://www.israelnationalnews.com/news/422516",
    "timestamp": "2026-02-16T17:09:38Z"
  },
  {
    "title": "How Vaccines Boost Our Immune System",
    "description": "Natural Resources Committee Democrats Respond to Trump’s Advancement of the Keystone and Dakota Access Pipelines\n\n This is a press release from the Natural Resources Committee Democrats, US House of Representatives concerning President Trump's decision and ac…",
    "link": "https://scienceblogs.com/sb-admin/2026/02/16/how-vaccines-boost-our-immune-system-151471",
    "timestamp": "2026-02-16T17:09:13Z"
  },
  {
    "title": "Will Capping Credit-Card Interest Rates Help Ordinary Americans?",
    "description": "The federal cap on credit-card interest rates that US President Donald Trump has proposed would, in theory, prevent issuers from gouging customers. But not everyone agrees that this would be good for Americans, especially lower-income households that are ofte…",
    "link": "https://www.project-syndicate.org/commentary/will-trump-cap-on-credit-card-interest-rates-benefit-americans-by-jeffrey-frankel-2026-02",
    "timestamp": "2026-02-16T17:07:47Z"
  },
  {
    "title": "Netanyahu reiterates Israel’s stance in advance of US-Iran nuclear talks",
    "description": "Tehran considers zero enrichment a violation of country’s rights under nuclear non-proliferation pact",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/16/netanyahu-reiterates-israels-stance-in-advance-of-us-iran-nuclear-talks/",
    "timestamp": "2026-02-16T17:05:42Z"
  },
  {
    "title": "Coco Gauff on situation in US: \"I don't think people should die in the streets just for existing\"",
    "description": "Since the beginning of Donald Trump&apos;s crusade against immigration in Minnesota and the controversial raids by the Immigration and Customs Enforcement Service (ICE), American a",
    "link": "https://www.marca.com/en/tennis/2026/02/16/69934c9f268e3e87148b4587.html",
    "timestamp": "2026-02-16T17:03:59Z"
  },
  {
    "title": "Homan: ‘Small Force’ to Remain in Minnesota After Ending ICE Surge",
    "description": "\"...there will be a small force, a security force, what we call RFQs, that will be our security forces, that will respond to when our agents are out.\"\nThe post Homan: ‘Small Force’ to Remain in Minnesota After Ending ICE Surge first appeared on Le·gal In·sur·…",
    "link": "https://legalinsurrection.com/2026/02/homan-says-a-small-force-to-remain-in-minnesota-after-ending-ice-surge/",
    "timestamp": "2026-02-16T17:00:23Z"
  },
  {
    "title": "Obama clarifies comments on aliens being real, says he saw 'no evidence' they've made contact",
    "description": "Former U.S. president Barack Obama took to Instagram on Sunday to clarify comments he'd made on a podcast about aliens being real, saying he did not see evidence that aliens have made contact with us.",
    "link": "https://www.cbc.ca/news/world/obama-aliens-real-clarification-9.7092280",
    "timestamp": "2026-02-16T16:57:58Z"
  }
]