[
  {
    "title": "Supreme Court Rules on Trump’s Firing of Fed Board Member—for Now",
    "description": "Lisa Cook will keep her post on the Federal Reserve Board of Governors for now at least, as the Supreme Court denied an emergency appeal... Read More\nThe post Supreme Court Rules on Trump’s Firing of Fed Board Member—for Now appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/01/supreme-court-rules-on-trumps-firing-of-fed-board-member-for-now/",
    "timestamp": "2025-10-01T15:30:04Z"
  },
  {
    "title": "JEFFRIES, SCHUMER STATEMENT ON THE TRUMP SHUTDOWN (Democratic Leader Hakeem Jeffries)",
    "description": "Democratic Leader Hakeem Jeffries:\nJEFFRIES, SCHUMER STATEMENT ON THE TRUMP SHUTDOWN  —  Today, House Democratic Leader Hakeem Jeffries and Senate Democratic Leader Chuck Schumer released the following statement:  —  After months of making life harder and mor…",
    "link": "https://www.memeorandum.com/251001/p58",
    "timestamp": "2025-10-01T15:30:01Z"
  },
  {
    "title": "Iran-Aligned Houthis Sanction U.S. Oil Majors",
    "description": "Major U.S. oil companies and their top managers were targeted by sanctions by a Yemeni body affiliated with the Iran-aligned Houthi rebels, for what they say is violating a Houthi embargo. The Humanitarian Operations Coordination Center (HOCC), a Houthi-affil…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Iran-Aligned-Houthis-Sanction-US-Oil-Majors.html",
    "timestamp": "2025-10-01T15:30:00Z"
  },
  {
    "title": "The D Brief: Reactions to Quantico; Shutdown, in effect; USAF chief nom; GOP govs call out troops; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/10/the-d-brief-october-01-2025/408529/",
    "timestamp": "2025-10-01T15:30:00Z"
  },
  {
    "title": "FIFA World Cup 2026 tickets have gone on sale. Here's how to try to get them",
    "description": "Tickets for next year's FIFA World Cup officially go on sale Wednesday.",
    "link": "https://www.stltoday.com/sports/professional/fifa/article_10dcbc00-bc40-55e5-af54-41c77fc070b9.html",
    "timestamp": "2025-10-01T15:30:00Z"
  },
  {
    "title": "Washington Post warns Democrats may have walked into Trump 'trap' over government shutdown",
    "description": "The Washington Post editorial board argued that Congressional Progressive Caucus tactics mirrored failed GOP strategies, leaving Democrats vulnerable during the federal government shutdown.",
    "link": "https://www.foxnews.com/media/washington-post-warns-democrats-may-have-walked-trump-trap-over-government-shutdown",
    "timestamp": "2025-10-01T15:28:34Z"
  },
  {
    "title": "JD Vance Admits Shutdown Will Bring 'Pain,' Uses Misleading Claim To Blame Dems",
    "description": "The vice president said Republicans don’t want to “lay anybody off,” though Speaker Mike Johnson appeared to eye permanent mass job cuts.",
    "link": "https://www.huffpost.com/entry/jd-vance-shutdown-layoffs_n_68dd34ece4b0f3800bcd9ba4",
    "timestamp": "2025-10-01T15:26:05Z"
  },
  {
    "title": "Trump Admin to Put $18 Billion in New York City Infrastructure Projects on Hold Due to Democrat Shutdown",
    "description": "President Donald Trump's administration announced on Wednesday that $18 billion in infrastructure projects in New York City will be put on hold due to Democrats' shutdown of the government.\nThe post Trump Admin to Put $18 Billion in New York City Infrastructu…",
    "link": "https://www.breitbart.com/politics/2025/10/01/trump-admin-to-put-18-billion-in-new-york-city-infrastructure-projects-on-hold-due-to-democrat-shutdown/",
    "timestamp": "2025-10-01T15:24:47Z"
  },
  {
    "title": "Barack Obama's Favorability Compared to Donald Trump's—New Poll",
    "description": "Americans view former President Barack Obama more favorably than President Donald Trump, according to a new poll.\nNewsweek reached out to the White House via email and Obama’s office via his press contact form for comment.\nWhy It Matters\nTrump’s favorability …",
    "link": "https://biztoc.com/x/73e934f86ce7fcb4",
    "timestamp": "2025-10-01T15:24:28Z"
  },
  {
    "title": "Supreme Court Allows Lisa Cook To Stay At Fed Amid Trump's Push To Oust Her",
    "description": "The Supreme Court will allow Lisa Cook to remain as Federal Reserve Governor despite President Donald Trump's attempts to oust her.\nIn a brief, unsigned order, the court said that it would leave Cook in her position until it heard arguments from her and the T…",
    "link": "https://biztoc.com/x/5e51a0cde0e00875",
    "timestamp": "2025-10-01T15:24:17Z"
  },
  {
    "title": "GOP falsely claims Democrats want free health care for those without legal status - NewsBreak",
    "description": "GOP falsely claims Democrats want free health care for those without legal status - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4265965679269-gop-falsely-claims-democrats-want-free-health-care-for-those-without-legal-status?s=a2&amp;share_destination_id=MTI0OTEwNDc2LTE3NTkzMzIxNDE1MzE%3D&amp;pd=08S6v66L&amp;hl=en_US&amp;send_time=1759332141&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-01T15:24:04Z"
  },
  {
    "title": "Young People Are Richer Than Boomers Were",
    "description": "Despite viral claims, a typical 25-year-old Gen Zer has annual household income that's 50 percent above Baby Boomers'.",
    "link": "https://reason.com/2025/10/01/young-people-are-richer-than-boomers-were/",
    "timestamp": "2025-10-01T15:23:54Z"
  },
  {
    "title": "Supreme Court allows Lisa Cook to stay on Fed board for now",
    "description": "President Donald Trump is attempting to assert more control over the historically independent Federal Reserve Board of Governors.",
    "link": "https://biztoc.com/x/322ff7c7defa0000",
    "timestamp": "2025-10-01T15:23:43Z"
  },
  {
    "title": "Japan defends 15% tariffs deal with ‘tough negotiator’ Trump",
    "description": "Japan’s chief trade negotiator has defended a tariffs deal with the U.S., expressing respect for President Donald Trump and calling him a “tough negotiator.”Trade envoy Ryosei Akazawa noted that the pact setting on most Japanese exports to the U.S. at 15% was…",
    "link": "https://biztoc.com/x/d3393a565c0320bf",
    "timestamp": "2025-10-01T15:23:36Z"
  },
  {
    "title": "US Government Shutdown Live Updates: Senate vote opens as shutdown kicks in, Wall Street stocks slide",
    "description": "US Government Shutdown Live Updates: The US is confronting a fresh cycle of uncertainty after President Donald Trump and Congress failed to strike an agreement to keep government programs and services running by Wednesday’s deadline. Disagreement stemmed from…",
    "link": "https://m.economictimes.com/news/international/global-trends/us-government-shutdown-live-news-updates-united-states-services-affected-complete-advisory-white-house-donald-trump-democrats-reaction/liveblog/124262626.cms",
    "timestamp": "2025-10-01T15:23:30Z"
  },
  {
    "title": "BREAKING: Supreme Court Stops Trump From Firing Fed Governor — For Now",
    "description": "Trump's attacks on the Fed have alarmed economists who fear that Trump exercising influence over the Fed could create turmoil in the global economy\nThe post BREAKING: Supreme Court Stops Trump From Firing Fed Governor — For Now first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/just-in-supreme-court-stops-trump-from-firing-fed-governor-for-now/",
    "timestamp": "2025-10-01T15:20:09Z"
  },
  {
    "title": "What Hamas Wants Removed From Trump's Gaza Peace Plan Revealed",
    "description": "Hamas leaders are reportedly seeking to amend some clauses of Donald Trump's Gaza peace plan, including those regarding its disarmament and expulsion from the enclave",
    "link": "https://www.ibtimes.com/what-hamas-wants-removed-trumps-gaza-peace-plan-revealed-3785060",
    "timestamp": "2025-10-01T15:18:15Z"
  },
  {
    "title": "RON HART: 107 Dazed — And Confused",
    "description": "Like most lifelong politicians, she has no marketable skills.",
    "link": "https://dailycaller.com/2025/10/01/ron-hart-107-dazed-and-confused-kamala-harris-book-tour/",
    "timestamp": "2025-10-01T15:17:55Z"
  },
  {
    "title": "Supreme Court lets Lisa Cook stay on Fed board",
    "description": "The Supreme Court is allowing Lisa Cook to remain as a Federal Reserve governor for now.",
    "link": "https://www.wlwt.com/article/supreme-court-lisa-cook-federal-reserve-trump-case/68152452",
    "timestamp": "2025-10-01T15:15:27Z"
  },
  {
    "title": "'The worst in quite some time': Trump hit by bad news as latest job numbers shock",
    "description": "Analysts were left shocked Wednesday after ADP released its latest jobs report that showed private employers had shed 32,000 jobs\r\n in September, a stark contrast to the expected gain of around 50,000 jobs.“Very disappointing, it was a weak number; this is pr…",
    "link": "https://www.rawstory.com/jobs-2674143998/",
    "timestamp": "2025-10-01T15:15:10Z"
  },
  {
    "title": "Supreme Court lets Lisa Cook remain as a Federal Reserve governor for now in unsigned order",
    "description": "In a brief unsigned order, the high court said it would hear arguments in January over President Donald Trump's effort to force Cook off the Fed board.",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-lets-lisa-cook-remain-as-a-federal-reserve-governor-for-now-in-unsigned-order",
    "timestamp": "2025-10-01T15:13:48Z"
  },
  {
    "title": "Supreme Court allows the Fed's Lisa Cook to stay in office for now as Trump pushes to fire her",
    "description": "The Supreme Court will consider President Donald Trump's attempt to fire Federal Reserve board member Lisa Cook.",
    "link": "https://biztoc.com/x/f942ba0c68a99ac1",
    "timestamp": "2025-10-01T15:12:38Z"
  },
  {
    "title": "Trump bid to remove Fed Governor Lisa Cook put on hold as US Supreme Court delays decision",
    "description": "In a brief unsigned order, the court said it would hear arguments in January over President Donald Trump’s push to force Cook off the Fed board.",
    "link": "https://indianexpress.com/article/world/trump-bid-to-remove-fed-governor-lisa-cook-put-on-hold-as-us-supreme-court-delays-decision-10282533/",
    "timestamp": "2025-10-01T15:11:55Z"
  },
  {
    "title": "“America First” President Gives Foreign Nation Massive Boost in Order",
    "description": "Qatar now has NATO-level security protections, thanks to the Trump administration.In an executive order signed Monday, Donald Trump pledged that the tiny, energy-rich, non-NATO ally would receive the same level of protection from the U.S. as some of America’s…",
    "link": "https://newrepublic.com/post/201191/donald-trump-qatar-security-executive-order",
    "timestamp": "2025-10-01T15:11:51Z"
  },
  {
    "title": "We found him: The alleged smoke bomber — and his shocking links to Antifa inside Canada’s military",
    "description": "Mark Carney’s Liberal government appears to be employing Antifa extremists inside federal institutions — even within our national defence system. At Rebel News, we did what the Montreal police should have done. We launched a reward campaign to identify and tr…",
    "link": "https://freerepublic.com/focus/f-news/4343695/posts",
    "timestamp": "2025-10-01T15:11:06Z"
  },
  {
    "title": "Trump's Military Training Order Violates Constitution",
    "description": "During Donald Trump's crazy speech to military leaders at Quantico, Virginia, he proposed using the US military and National Guard to fight Chicago crime as a training grounds for his new war machine - which is blatantly unconstitutional.\nDemented Donald is l…",
    "link": "https://crooksandliars.com/2025/09/trump-illegally-orders-military-training",
    "timestamp": "2025-10-01T15:10:50Z"
  },
  {
    "title": "Inside 'Alligator Alcatraz': Color-coded uniforms, 5:30 am breakfast and strict rules",
    "description": "Detainees arriving at the immigration detention center in the Florida Everglades are given color-coded uniforms and segregated based on criminal history and flight risk",
    "link": "https://abcnews.go.com/US/wireStory/inside-alligator-alcatraz-color-coded-uniforms-530-breakfast-126118864",
    "timestamp": "2025-10-01T15:10:18Z"
  },
  {
    "title": "Supreme Court lets Lisa Cook remain as a Federal Reserve governor for now",
    "description": "The Supreme Court is declining to act on the Trump administration's effort to immediately remove Lisa Cook from the central bank.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_4f1e9dcb-c558-5ace-b215-afacf0209b4f.html",
    "timestamp": "2025-10-01T15:10:00Z"
  },
  {
    "title": "Increasing minimum wage is no way to deal with rising rents, say small businesses",
    "description": "Minimum wage expected to rise by 65 cent, or almost 5%, in next week’s budget",
    "link": "https://www.irishtimes.com/business/2025/10/01/increasing-minimum-wage-is-no-way-to-deal-with-rising-rents-say-small-businesses/",
    "timestamp": "2025-10-01T15:09:32Z"
  },
  {
    "title": "Trump suffers rare Supreme Court loss as justices refuse to let him fire Fed's Lisa Cook",
    "description": "The U.S. Supreme Court refused to allow President Donald Trump to fire Federal Reserve Governor Lisa Cook immediately.On Aug. 25, Trump said he fired Cook, alleging that she committed mortgage fraud. Under the Federal Reserve Act, the president can only fire …",
    "link": "https://www.rawstory.com/trump-supreme-court-lisa-cook/",
    "timestamp": "2025-10-01T15:09:22Z"
  },
  {
    "title": "Anti-war veterans are saying no to Pete Hegseth’s destructive vision",
    "description": "They're fighting back against a cycle of endless wars",
    "link": "https://www.salon.com/2025/10/01/anti-war-veterans-are-saying-no-to-pete-hegseths-destructive-vision_partner/",
    "timestamp": "2025-10-01T15:05:56Z"
  },
  {
    "title": "Supreme Court Finally Puts Its Foot Down on Trump’s Fascist Antics",
    "description": "The Supreme Court will allow Lisa Cook to remain on the Federal Reserve Board of Governors despite President Donald Trump’s attempt to oust her. In a brief one-page order Wednesday, the court said Cook could keep her position pending oral arguments early next…",
    "link": "https://newrepublic.com/post/201189/supreme-court-donald-trump-federal-reserve",
    "timestamp": "2025-10-01T15:05:28Z"
  },
  {
    "title": "DC Police Sergeant Arrested In Chaotic Chase With Federal Agents Despite Liberals Insisting City Is Safe",
    "description": "A D.C. police sergeant is on leave after authorities say he crashed a car into a federal vehicle during a traffic stop and was found with unregistered weapons.",
    "link": "https://dailycaller.com/2025/10/01/dc-police-sergeant-arrested-in-wild-chase-with-federal-agents/",
    "timestamp": "2025-10-01T15:04:59Z"
  },
  {
    "title": "A history of US government shutdowns: Every closure and how long it lasted",
    "description": "The US government has had 20 funding gaps, resulting in 10 shutdowns since 1976, the longest lasting 35 days.",
    "link": "https://www.aljazeera.com/news/2025/10/1/a-history-of-us-government-shutdowns-every-closure-and-how-long-it-lasted",
    "timestamp": "2025-10-01T15:04:54Z"
  },
  {
    "title": "Israel 'tightens siege' of Gaza City as Hamas reviews Trump peace plan",
    "description": "The defence minister warns Palestinians to leave, saying those remaining will be considered \"terrorists and supporters of terror\".",
    "link": "https://www.bbc.com/news/articles/cvgnznkjrx6o",
    "timestamp": "2025-10-01T15:04:39Z"
  },
  {
    "title": "Supreme Court keeps Fed's Lisa Cook in role for now, agrees to review case",
    "description": "Oral arguments are expected to be closely watched, given the unprecedented nature of the case, and the seismic shift that any ruling could have on U.S. economic decisions.",
    "link": "https://www.foxnews.com/politics/supreme-court-keeps-feds-lisa-cook-role-now-agrees-review-case",
    "timestamp": "2025-10-01T15:04:04Z"
  },
  {
    "title": "Philadelphia Raises Chinese Communist Flag",
    "description": "Philadelphia officials on Tuesday raised the flag of the Chinese Communist Party (CCP) at City Hall. The ceremony marked the CCP’s Oct. 1 National Day and involved a co-organizer with ties to Beijing’s regime, according to The Epoch Times. The event reportedl…",
    "link": "https://freerepublic.com/focus/f-news/4343693/posts",
    "timestamp": "2025-10-01T15:03:51Z"
  },
  {
    "title": "Why Is Trump Bailing Out Argentina’s Milei?",
    "description": "It’s not the economy, stupid.",
    "link": "http://foreignpolicy.com/2025/10/01/argentina-bailout-economy-trump-milei-bessent/",
    "timestamp": "2025-10-01T15:03:07Z"
  },
  {
    "title": "MAGA Dude Who Shot Up, Burned Michigan Mormon Church Called LDS 'Antichrist,' Surprise!",
    "description": "More of that 'guns and religion' stuff that goes so well together.",
    "link": "https://www.wonkette.com/p/maga-dude-who-shot-up-burned-michigan",
    "timestamp": "2025-10-01T15:02:56Z"
  },
  {
    "title": "Supreme Court allows Lisa Cook to stay on Fed board for now",
    "description": "President Donald Trump is attempting to assert more control over the historically independent Federal Reserve Board of Governors.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-lisa-cook-federal-reserve-board-trump-rcna232182",
    "timestamp": "2025-10-01T15:02:39Z"
  },
  {
    "title": "US, Israel await Hamas answer after peace deal push",
    "description": "US President Donald Trump announced a peace plan for Gaza as he hosted Israeli Prime Minister Benjamin Netanyahu at the White House on September 29. During a joint press conference, Trump said that the proposal has the backing of numerous Arab and Muslim coun…",
    "link": "https://www.longwarjournal.org/archives/2025/10/us-israel-await-hamas-answer-after-peace-deal-push.php",
    "timestamp": "2025-10-01T15:02:27Z"
  },
  {
    "title": "Jimmy Fallon Says He’s ‘Keeping His Head Down’ And Not Getting ‘Political’ Despite Donald Trump Calling For His Show To Be Canceled",
    "description": "The Tonight Show host Jimmy Fallon says he’s “keeping his head down” as the White House attempts to exert federal pressure in order to purge late night television of programs it finds problematic. Just this summer, The Late Show with Stephen Colbert was cance…",
    "link": "https://brobible.com/culture/article/jimmy-fallon-keeping-head-down-donald-trump/",
    "timestamp": "2025-10-01T15:01:30Z"
  },
  {
    "title": "WATCH LIVE: House Democrats speak out after government shuts down over funding impasse",
    "description": "Democratic leaders across the political spectrum are shrugging off the risks and embracing a government shutdown they say is needed to push back against President Donald Trump and his Republican allies in Congress.",
    "link": "https://biztoc.com/x/6e677296e02f1375",
    "timestamp": "2025-10-01T15:01:24Z"
  },
  {
    "title": "Supreme Court lets Fed Governor Lisa Cook keep job pending oral argument in January",
    "description": "President Donald Trump has sought to fire Federal Reserve Governor Lisa Cook, citing claims that she committed mortgage fraud in connection with two homes.",
    "link": "https://biztoc.com/x/c4556f1a9a79e2df",
    "timestamp": "2025-10-01T15:01:13Z"
  },
  {
    "title": "Montagliani: FIFA will not bow to Trump as 2026 World Cup challenges mount",
    "description": "FIFA vice-president Victor Montagliani insists world football’s governing body will not be dictated to by politicians as planning intensifies for the 2026 World Cup in the United States, Canada and Mexico.",
    "link": "https://hayters.com/montagliani-fifa-will-not-bow-to-trump-as-2026-world-cup-challenges-mount/",
    "timestamp": "2025-10-01T15:01:00Z"
  },
  {
    "title": "Gold Hits Record And Bitcoin Rises Amid Government Shutdown Uncertainty",
    "description": "Investors appeared to search for an economic haven as a government shutdown posed uncertainty—with bitcoin viewed as less risky following record highs it has notched under the Trump administration.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/10/01/gold-hits-record-and-bitcoin-rises-amid-government-shutdown-uncertainty/",
    "timestamp": "2025-10-01T15:00:58Z"
  },
  {
    "title": "California Pulls Plug on its Delusional Electric Truck Mandate",
    "description": "This is one small win for Californians, and one big win for the rest of the country.\nThe post California Pulls Plug on its Delusional Electric Truck Mandate first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/california-pulls-plug-on-its-delusional-electric-truck-mandate/",
    "timestamp": "2025-10-01T15:00:51Z"
  },
  {
    "title": "'Yeah, it was an eye roll': CNN panelist can't hide disdain for ex-Trump aide's claims",
    "description": "A CNN commentator was unable to hide his disdain for the arguments of a former Donald Trump campaign staffer blaming Democrats for the government shutdown.The federal government shut down Wednesday after the Republican-led Congress was unable to pass a fundin…",
    "link": "https://www.rawstory.com/chuck-schumer-government-shutdown/",
    "timestamp": "2025-10-01T15:00:43Z"
  },
  {
    "title": "Pope Leo XIV Praises Trump's 'Realistic Proposal' on Gaza: 'We Hope' Hamas Accepts",
    "description": "Pope Leo XIV said he considered President Donald Trump's plan to end the war in Gaza a \"realistic proposal\" and that Hamas should accept it.\nThe post Pope Leo XIV Praises Trump’s ‘Realistic Proposal’ on Gaza: ‘We Hope’ Hamas Accepts appeared first on Breitbar…",
    "link": "https://www.breitbart.com/middle-east/2025/10/01/pope-leo-xiv-praises-trumps-realistic-proposal-gaza-we-hope-hamas-accepts/",
    "timestamp": "2025-10-01T15:00:42Z"
  },
  {
    "title": "Trump birthright citizenship fight heads back to Supreme Court as new term begins",
    "description": "The Supreme Court may review President Donald Trump's birthright citizenship executive order that opponents say violates the 14th Amendment's citizenship clause.",
    "link": "https://www.foxnews.com/politics/trump-birthright-citizenship-fight-heads-back-supreme-court-new-term-begins",
    "timestamp": "2025-10-01T15:00:37Z"
  },
  {
    "title": "Supremes let Fed Gov Lisa Cook keep job pending oral argument...",
    "description": "President Donald Trump has sought to fire Federal Reserve Governor Lisa Cook, citing claims that she committed mortgage fraud in connection with two homes.",
    "link": "https://www.cnbc.com/2025/10/01/supreme-court-trump-fed-lisa-cook.html",
    "timestamp": "2025-10-01T15:00:09Z"
  },
  {
    "title": "Donald Trump: “Hamas…Will Pay In Hell” If They Don’t Agree to Ceasefire Terms",
    "description": "Donald Trump is becoming increasingly irate with his rhetoric, not just toward American citizens regarding political dissent, but also with nations he's warring with on behalf of others. He recently said that Hamas should agree to the ceasefire terms he's lai…",
    "link": "https://www.shtfplan.com/headline-news/donald-trump-hamas-will-pay-in-hell-if-they-dont-agree-to-ceasefire-terms",
    "timestamp": "2025-10-01T15:00:02Z"
  },
  {
    "title": "Ranking the top resi players in Miami",
    "description": "It’s hard to say when exactly fortunes turned, but real estate players agree: Much of Miami-Dade County is in a buyer’s market.  “It’s definitely a buyer’s market up to $2 million, $3 million bucks,” Duff Rubin, Coldwell Banker’s regional president for the So…",
    "link": "https://therealdeal.com/magazine/october-2025/ranking-the-top-resi-players-in-miami/",
    "timestamp": "2025-10-01T15:00:00Z"
  },
  {
    "title": "Supreme Court lets Lisa Cook remain as a Federal Reserve governor for now",
    "description": "The Supreme Court is allowing Lisa Cook to remain as a Federal Reserve governor for now.",
    "link": "https://www.bostonherald.com/2025/10/01/supreme-court-lisa-cook-trump/",
    "timestamp": "2025-10-01T14:59:17Z"
  },
  {
    "title": "Blame Game: GOP spotlights 'Schumer shutdown' while Dems lash out at Republicans",
    "description": "Chuck Schumer faces political pressure over government shutdown strategy as Republicans and Democrats battle over healthcare funding and blame assignment.",
    "link": "https://www.foxnews.com/politics/blame-game-gop-spotlights-schumer-shutdown-while-dems-lash-out-republicans",
    "timestamp": "2025-10-01T14:59:14Z"
  },
  {
    "title": "The Moral Hollowing Out of the United States",
    "description": "Sasha Abramsky\n\n\n\nOn the brink of a potentially devastating government shutdown, Trump spent his day with Pete Hegseth haranguing generals at a summit that should’ve been an e-mail.\r\n\n\r\n\n\nThe post The Moral Hollowing Out of the United States appeared first on…",
    "link": "https://www.thenation.com/article/politics/trump-shutdown-hegseth-moral-rot/",
    "timestamp": "2025-10-01T14:59:00Z"
  },
  {
    "title": "Supreme Court allows the Fed's Lisa Cook to stay in office for now as Trump pushes to fire her",
    "description": "The Supreme Court will consider President Donald Trump's attempt to fire Federal Reserve board member Lisa Cook.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-feds-lisa-cook-stay-office-trump-fire-case-rcna232933",
    "timestamp": "2025-10-01T14:58:55Z"
  },
  {
    "title": "The Joke’s On You at the Riyadh Comedy Festival",
    "description": "Any writer worth a damn will tell you that writing short is often a lot harder than writing long. You have to get the pacing, the structure, and the tone just right, but when it hits, it really hits. Capturing something essential about the modern world in 80,…",
    "link": "https://www.motherjones.com/politics/2025/10/riyadh-comedy-festival-muhammad-bin-salman-human-rights-chappelle-burr-davidson-trump/",
    "timestamp": "2025-10-01T14:57:28Z"
  },
  {
    "title": "Supreme Court lets Lisa Cook remain as a Federal Reserve governor for now",
    "description": "The Supreme Court is allowing Lisa Cook to remain as a Federal Reserve governor for now. The court is declining to act on the Trump administration’s effort to immediately remove her. In a brief unsigned order Wednesday, the high court said it would hear argum…",
    "link": "https://apnews.com/article/supreme-court-trump-federal-reserve-lisa-cook-5a48941a9e30017b0ed3e5837492d288",
    "timestamp": "2025-10-01T14:57:15Z"
  },
  {
    "title": "Supreme Court Lets Lisa Cook Stay On Fed Board Until At Least January",
    "description": "The Supreme Court will allow Federal Reserve Governor Lisa Cook to remain on the board for now. The justices will consider the Trump administration’s request to remove her during oral arguments in January, according to the court’s order. The Trump administrat…",
    "link": "https://dailycaller.com/2025/10/01/supreme-court-lets-lisa-cook-stay-on-fed-board-until-january/",
    "timestamp": "2025-10-01T14:56:55Z"
  },
  {
    "title": "If you want to understand Russia tomorrow, you can’t afford to miss Putin at Valdai",
    "description": "The Russian leader has often used the meeting to articulate a shift in priorities or to convey new thinking on issues of global importance Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/625704-understand-russia-putin-valdai/",
    "timestamp": "2025-10-01T14:56:33Z"
  },
  {
    "title": "Millions set to get 80% off prescription drugs as White House rolls out ‘TrumpRx’ plan",
    "description": "President Donald Trump has launched TrumpRx, a direct-to-consumer website created to make prescription medications up to 80% cheaper for Americans. The initiative enables people to pay cash for specific drugs at rates negotiated by the government, while Medic…",
    "link": "https://economictimes.indiatimes.com/news/international/us/millions-set-to-get-80-off-prescription-drugs-as-white-house-rolls-out-trumprx-plan/articleshow/124261653.cms",
    "timestamp": "2025-10-01T14:55:18Z"
  },
  {
    "title": "Trump's pharmaceutical tariff threat loses bite after Pfizer deal reassures drugmakers - CNBC",
    "description": "Trump's pharmaceutical tariff threat loses bite after Pfizer deal reassures drugmakersCNBC President announces TrumpRx website for drugs, and pricing deal with PfizerNPR How Trump’s Drug-Buying Site ‘TrumpRx’ Will WorkThe Wall Street Journal Fact Sheet: Presi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179615110",
    "timestamp": "2025-10-01T14:53:39Z"
  },
  {
    "title": "Charlamagne Tha God says 'brand safety' has become a problem and advertisers should rethink it",
    "description": "Charlamagne Tha God questioned advertisers' \"brand safety\" approach and highlighted the importance of understanding show hosts.",
    "link": "https://www.businessinsider.com/charlamagne-tha-god-challenges-advertisers-on-brand-safety-2025-10",
    "timestamp": "2025-10-01T14:51:13Z"
  },
  {
    "title": "How Tony Blair went from post-Iraq ignominy to the heart of Trump's peace plan",
    "description": "The former British prime minister has been named by Trump as the co-head of the so-called Board of Peace to oversee Gaza's reconstruction.",
    "link": "https://www.nbcnews.com/world/united-kingdom/tony-blair-trump-gaza-peace-plan-britain-iraq-rcna234633",
    "timestamp": "2025-10-01T14:50:20Z"
  },
  {
    "title": "Why the Hell Did Trump Have Merch Out During His Shutdown Meeting?",
    "description": "President Donald Trump used his merchandise to mock Democratic leaders during a meeting while pretending he was working to avert a government shutdown. The president shared multiple photographs on Truth Social Wednesday of his meeting the day before with Hous…",
    "link": "https://newrepublic.com/post/201185/donald-trump-2028-merch-shutdown-meeting",
    "timestamp": "2025-10-01T14:49:36Z"
  },
  {
    "title": "Trump nominates Travis Hill to be chair of US FDIC, source says",
    "description": "Donald Trump nominated Travis Hill, the acting FDIC chair, to permanently lead the key U.S. bank regulator. Hill, known for easing post-crisis rules and lightening regulatory oversight, has rolled back Biden-era merger scrutiny and allowed crypto activities. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-nominates-travis-hill-to-be-chair-of-us-fdic-source-says/articleshow/124262026.cms",
    "timestamp": "2025-10-01T14:49:11Z"
  },
  {
    "title": "All the ways the government shutdown will affect student loans, FAFSA",
    "description": "Already diminished by cuts by the Trump administration, the U.S. Education Department will see more of its work come to a halt due to the government shutdown.",
    "link": "https://apnews.com/article/government-shutdown-education-department-student-loans-fafsa-2511421f2e5fe73a83e24ebb6e1df00b",
    "timestamp": "2025-10-01T14:48:46Z"
  },
  {
    "title": "Republicans Weigh Sweeping Cuts as Shutdown Grips Washington",
    "description": "Republican House Speaker Mike Johnson on Wednesday said the White House would quickly move to cut the federal bureaucracy.  The shutdown gives Republicans an...",
    "link": "https://finance.yahoo.com/news/republicans-weigh-sweeping-cuts-shutdown-144815558.html",
    "timestamp": "2025-10-01T14:48:15Z"
  },
  {
    "title": "Trump admin halts $18B for key projects in Dem leaders' city after shutdown",
    "description": "Office of Management and Budget Director Russ Vought announced that President Donald Trump's administration was halting key infrastructure projects in the home state of the two top Democrats in Congress, hours after they declined to prevent a government shutd…",
    "link": "https://www.rawstory.com/russ-vought-new-york-dei/",
    "timestamp": "2025-10-01T14:45:09Z"
  },
  {
    "title": "AOC Dodges When Asked If She Threatened To Primary Chuck Schumer",
    "description": "Alexandria Ocasio-Cortez changed the subject after Chris Hayes asked if she threatened to launch a primary challenge to Democratic Sen. Chuck Schumer.",
    "link": "https://dailycaller.com/2025/10/01/aoc-dodges-when-asked-if-she-threatened-to-primary-chuck-schumer/",
    "timestamp": "2025-10-01T14:44:30Z"
  },
  {
    "title": "Erika Kirk Lands Spot on ‘Time 100 Next’ List, Gets Blasted as …",
    "description": "Reading Time: 3 minutesErika Kirk is at the center of yet another controversy.\nErika Kirk Lands Spot on ‘Time 100 Next’ List, Gets Blasted as … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/erika-kirk-lands-spot-on-time-100-next-list-gets-blasted-as-rightwing-grifter-by-critics/",
    "timestamp": "2025-10-01T14:44:07Z"
  },
  {
    "title": "Gallego: Trump Is an ‘Idiot,’ He Doesn’t Understand How the Military Works [Sen. Gallego (D-AZ)]",
    "description": "Tuesday on CNN’s “NewsCentral,” Sen. Ruben Gallego (D-AZ) claimed President Donald Trump was an “idiot” who “doesn’t actually understand how the military works.” Co-host Boris Sanchez said, “Senator, is there anything in place that would prevent the president…",
    "link": "https://freerepublic.com/focus/f-bloggers/4343686/posts",
    "timestamp": "2025-10-01T14:42:26Z"
  },
  {
    "title": "US Pfizer deal powers European health stocks as Trump policy haze clears",
    "description": "European healthcare stocks jumped on Wednesday, mirroring moves in the United States, propelled by a deal between Pfizer and President Donald Trump to lower prescription drug prices in the Medicaid programme in exchange for tariff relief.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-pfizer-deal-powers-european-health-stocks-as-trump-policy-haze-clears/articleshow/124261882.cms",
    "timestamp": "2025-10-01T14:42:21Z"
  },
  {
    "title": "The Protocol: Solana’s Firedancer Proposes Uncapping Block Compute-Unit Limit",
    "description": "Also: Denials of Bitcoin Hard Fork, UN Experiments With Blockchain, and Gate Rolls Out Token Launcher.",
    "link": "https://www.coindesk.com/tech/2025/10/01/the-protocol-solana-s-firedancer-proposes-uncapping-block-compute-unit-limit",
    "timestamp": "2025-10-01T14:41:16Z"
  },
  {
    "title": "Trump holds up $18 billion for NYC rail projects",
    "description": "New York Sen. Chuck Schumer says President Donald Trump's freeze on $18 billion in funding for a couple of major New York City rail projects because of the government shutdown will harm commuters. The Democratic senator says obstructing the projects is “stupi…",
    "link": "https://apnews.com/article/shutdown-new-york-rail-projects-money-withheld-ada494e08ae9ae5269c6ce554ecdbd43",
    "timestamp": "2025-10-01T14:40:07Z"
  },
  {
    "title": "Netanyahu's Apology To Qatar Scripted? White House Releases Compelling Photo",
    "description": "A compelling photograph was included in the White House website's gallery section showing Israeli Prime Minister Benjamin Netanyahu in the Oval Office reading from a page while speaking into a telephone with US President Donald Trump holding the phone. Accord…",
    "link": "https://www.ndtvprofit.com/world/netanyahus-apology-to-qatar-scripted-white-house-releases-compelling-photo",
    "timestamp": "2025-10-01T14:40:02Z"
  },
  {
    "title": "Jimmy Kimmel calls Trump a 'son of a b----' over president's celebration of show's suspension",
    "description": "Late-night hosts Jimmy Kimmel and Stephen Colbert called President Donald Trump a \"son of a b----\" on Tuesday as the late-night personalities appeared on each others' shows.",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-calls-trump-son-b-over-presidents-celebration-shows-suspension",
    "timestamp": "2025-10-01T14:39:24Z"
  },
  {
    "title": "‘Pain will be inflicted’ as shutdown drags on, Mike Johnson says",
    "description": "Speaker Mike Johnson and fellow Republican congressional leaders blasted Democrats Wednesday for opposing their short-term funding stopgap and triggering the pending federal shutdown. \nJohnson on Wednesday echoed threats from President Donald Trump that a shu…",
    "link": "https://biztoc.com/x/dd3b5cb8421fdb81",
    "timestamp": "2025-10-01T14:39:17Z"
  },
  {
    "title": "Ron DeSantis just took over $66 million worth of prime Miami real estate and gifted it to Trump for a presidential library",
    "description": "Florida officials decided Tuesday to set aside nearly three acres of prime downtown Miami real estate next to the historic Freedom Tower as a potential site of the future presidential library of President Donald Trump.\nRepublican Gov. Ron DeSantis and the Flo…",
    "link": "https://biztoc.com/x/af9a27dd8544d5fe",
    "timestamp": "2025-10-01T14:39:06Z"
  },
  {
    "title": "How the government shutdown will affect the already shrunken Education Department",
    "description": "Investigations into civil rights complaints will stop, the department will not issue new federal grants and about 87% of its workforce will be furloughed, according to a department contingency plan.",
    "link": "https://www.pbs.org/newshour/politics/how-the-government-shutdown-will-affect-the-already-shrunken-education-department",
    "timestamp": "2025-10-01T14:38:46Z"
  },
  {
    "title": "Trump’s direct threats against NYC mayoral candidate are backfiring hard: insider",
    "description": "President Donald Trump’s open threats against New York City mayoral candidate Zohran Mamdani have not only failed to slow down Mamdani’s campaign as the Democratic Party nominee to win the general election — but have actually bolstered his support among voter…",
    "link": "https://www.rawstory.com/zohran-mamdani-2674143631/",
    "timestamp": "2025-10-01T14:38:32Z"
  },
  {
    "title": "Joe Rogan Suggests Pete Hegseth Convening Generals Was Necessary After ‘Crazy People’ Ran Biden Admin",
    "description": "Joe Rogan suggested it was important for Pete Hegseth to order military leadership to convene in Quantico, Virginia following Joe Biden's administration.",
    "link": "https://dailycaller.com/2025/10/01/joe-rogan-calls-pete-hegseth-convening-generals-necessary-after-biden-administration/",
    "timestamp": "2025-10-01T14:38:29Z"
  },
  {
    "title": "Trump's Gaza plan finds Indonesia, Pakistan as Asian backers",
    "description": "The governments of Asia's largest Muslim-majority countries are backing the US president's peace plan. But amid public backlash, will that support come at a cost?",
    "link": "https://www.dw.com/en/trumps-gaza-plan-finds-indonesia-pakistan-as-asian-backers/a-74203903",
    "timestamp": "2025-10-01T14:38:00Z"
  },
  {
    "title": "Florida was a top destination for immigrants who came to the US under Biden",
    "description": "Government data shows that no state was more affected by the immigrant surge under Biden than Florida.",
    "link": "https://www.bostonherald.com/2025/10/01/us-immigration-florida-under-biden/",
    "timestamp": "2025-10-01T14:37:33Z"
  },
  {
    "title": "Maine Family Planning to close primary care practice",
    "description": "Maine Family Planning to close primary care practice due to defunding of Medicaid. That will affect thousands of patients in Maine.",
    "link": "http://www.bangordailynews.com/2025/10/01/state/state-health/maine-family-planning-primary-care-closure/",
    "timestamp": "2025-10-01T14:35:29Z"
  },
  {
    "title": "What happens now that a government shutdown is underway",
    "description": "A lot of government continues during a federal shutdown.",
    "link": "https://www.pbs.org/newshour/politics/what-happens-now-that-a-government-shutdown-is-underway",
    "timestamp": "2025-10-01T14:34:38Z"
  },
  {
    "title": "Israel bankrolling influencers to boost image in US – media",
    "description": "Israel is reportedly paying influencers to promote a positive image in the US as public approval declines over Gaza war Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625705-israel-us-influence-campaign/",
    "timestamp": "2025-10-01T14:34:11Z"
  },
  {
    "title": "Democrats embrace a shutdown fight in a rare moment of unity against Trump",
    "description": "Democrats are unified in embracing a government shutdown to challenge President Trump and Republicans, insisting on extending healthcare subsidies. Driven by frustration, they believe this fight is necessary despite political risks and Trump's strong rhetoric…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/democrats-embrace-a-shutdown-fight-in-a-rare-moment-of-unity-against-trump/articleshow/124261707.cms",
    "timestamp": "2025-10-01T14:33:47Z"
  },
  {
    "title": "Why many young adults turn on TV or movie subtitles, according to poll",
    "description": "About 4 in 10 adults under 45 use subtitles at least “often” when watching TV or movies.",
    "link": "https://www.dailycamera.com/2025/10/01/why-young-adults-use-subtitles/",
    "timestamp": "2025-10-01T14:33:10Z"
  },
  {
    "title": "“Never Beating The Red Hat Allegations”: Rapper Under Fire For Twerking With Sydney Sweeney",
    "description": "Sydney Sweeney has great jeans—and, according to some netizens, a red hat.",
    "link": "https://www.boredpanda.com/sexyy-red-political-backlash-after-photo-twerking-with-sydney-sweeney/",
    "timestamp": "2025-10-01T14:32:36Z"
  },
  {
    "title": "Trump to Keep Oil Permits Moving in Shutdown, Freezes Renewables",
    "description": "The Trump administration plans to allow permits for oil drilling and other work on “priority conventional energy projects” to continue during the government shutdown, while work on some renewable energy projects will halt.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-keep-oil-permits-moving-in-shutdown-freezes-renewables",
    "timestamp": "2025-10-01T14:32:28Z"
  },
  {
    "title": "US government shutdown begins as nation faces new period of uncertainty",
    "description": "US government shutdown leads to uncertainty, furloughs, and potential firings as Trump and Congress fail to reach agreement.",
    "link": "https://www.thehindubusinessline.com/news/world/us-government-shutdown-begins-as-nation-faces-new-period-of-uncertainty/article70116449.ece",
    "timestamp": "2025-10-01T14:31:43Z"
  },
  {
    "title": "Walmart plans to remove artificial colors and other food additives from store brands by 2027",
    "description": "NEW YORK (AP) — Walmart said Wednesday that it plans to remove synthetic food dyes and 30 other ingredients, including some preservatives, artificial sweeteners and fat substitutes, from its store brands sold in the United States by January 2027. The move ann…",
    "link": "https://www.wivb.com/news/business/ap-walmart-sets-a-timeline-for-removing-synthetic-dyes-and-other-additives-from-its-food-brands/",
    "timestamp": "2025-10-01T14:31:06Z"
  },
  {
    "title": "Making It Seem Easy",
    "description": "Pritzker:\nAfter President Donald Trump on Tuesday suggested cities like Chicago should be used as \"training grounds for our military,\" Gov. JB Pritzker said the 25th Amendment should be invoked to remove the president from office, saying \"there is something g…",
    "link": "https://www.eschatonblog.com/2025/10/making-it-seem-easy.html",
    "timestamp": "2025-10-01T14:31:00Z"
  }
]