[
  {
    "title": "Trump Celebrates a Major Win as Jobs Report Blows Economists' Expectations Out of the Water",
    "description": "The March jobs report shows that the president who promised more jobs for Americans is already delivering on his promise.",
    "link": "https://www.westernjournal.com/trump-celebrates-major-win-jobs-report-blows-economists-expectations-water/",
    "timestamp": "2025-04-04T15:14:15Z"
  },
  {
    "title": "Nintendo delays Switch 2 US pre-orders following Trump tariffs",
    "description": "Nintendo is delaying US Switch 2 pre-orders in response to the sweeping tariffs announced by President Donald Trump earlier this week, reports Polygon. As of Nintendo's announcement of the console on Wednesday, pre-orders in the United States were scheduled t…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176924901",
    "timestamp": "2025-04-04T15:13:46Z"
  },
  {
    "title": "Trump Shares TikTok Video Claiming He Is ‘Purposefully CRASHING the Market’",
    "description": "“It also weakens the dollar and drops mortgage rates. Now it's a wild chess move, but it's working. Now you're probably wondering, what about his tariffs?\"\nThe post Trump Shares TikTok Video Claiming He Is ‘Purposefully CRASHING the Market’ first appeared on …",
    "link": "https://www.mediaite.com/news/trump-shares-tiktok-video-claiming-he-is-purposefully-crashing-the-market/",
    "timestamp": "2025-04-04T15:13:21Z"
  },
  {
    "title": "This Week in Women’s Representation: With Crawford’s Win in Wisconsin, Six of Seven Justices Are Women; Bipartisan Push for Proxy Voting in Congress for New Parents",
    "description": "Weekend Reading for Women's Representation is a compilation of stories about women's representation. \nThis week: Remembering Abigail Adams' warning to her husband, \"Remember all Men would be tyrants if they could\"; Susan Crawford won the most expensive judici…",
    "link": "https://msmagazine.com/2025/04/04/women-representation-women-proxy-voting-congress-wisconsin-supreme-court-susan-crawford/",
    "timestamp": "2025-04-04T15:12:59Z"
  },
  {
    "title": "Tariffs will drive up the cost of airplanes, the United States' star export",
    "description": "Airplanes engines and other aerospace parts would get more expensive under the new tariffs.",
    "link": "https://www.cnbc.com/2025/04/04/tariffs-drive-up-the-cost-of-airplanes-the-united-states-star-export.html",
    "timestamp": "2025-04-04T15:12:13Z"
  },
  {
    "title": "Canada Loses Jobs For First Time In 3 Years As US Tariffs Bite",
    "description": "Employment in Canada fell for the first time in three years in March, the national statistical agency said Friday, as uncertainty over US tariffs led businesses to cut staff and stall hiring.",
    "link": "https://www.ibtimes.com/canada-loses-jobs-first-time-3-years-us-tariffs-bite-3768851",
    "timestamp": "2025-04-04T15:12:07Z"
  },
  {
    "title": "NASA astronaut and Russian cosmonauts team up for new eight month mission to the ISS",
    "description": "A NASA astronaut and Russian cosmonauts are going to team up on a new eight month mission to space later this year.",
    "link": "https://www.ladbible.com/news/science/nasa-astronaut-russia-america-space-mission-iss-113117-20250404",
    "timestamp": "2025-04-04T15:10:52Z"
  },
  {
    "title": "Who Could Buy TikTok? What We Know",
    "description": "These are the rumored and potential buyers for the platform as a ban looms.",
    "link": "https://www.newsweek.com/who-could-buy-tiktok-2055408",
    "timestamp": "2025-04-04T15:10:51Z"
  },
  {
    "title": "Nintendo Reportedly Delays Switch 2 Preorders Citing Need to Assess 'Impact of Tariffs'",
    "description": "High tariffs on Vietnam and Cambodia have caused Nintendo to push back the preorder date for the Switch 2 as the company assesses market conditions.",
    "link": "https://www.newsweek.com/entertainment/video-games/nintendo-reportedly-delays-switch-2-preorders-citing-need-assess-impact-tariffs-2055465",
    "timestamp": "2025-04-04T15:10:34Z"
  },
  {
    "title": "Nasdaq heads toward bear market as trade war worries grow; Chinese cos JD.com, Alibaba down 9%",
    "description": "Wall Street fell sharply for a second straight session on Friday, pushing the Nasdaq toward a bear market, after China imposed fresh tariffs on all U.S. goods in response to the Trump administration's sweeping levies, escalating a global trade war.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-heads-toward-bear-market-as-trade-war-worries-grow-chinese-cos-jd-com-alibaba-down-9/articleshow/119985560.cms",
    "timestamp": "2025-04-04T15:10:20Z"
  },
  {
    "title": "FDI firms love Ireland's labour force but housing and planning are a problem for doing business",
    "description": "A survey by the IDA has revealed the factors that are the biggest challenges for companies doing business here.",
    "link": "https://www.thejournal.ie/fdi-firms-love-ireland-labour-housing-and-planning-are-probllem-for-doing-business-6668666-Apr2025/",
    "timestamp": "2025-04-04T15:10:15Z"
  },
  {
    "title": "Donald Trump's Tariffs Could Make Bibles More Expensive",
    "description": "China, the world's biggest Bible printer, was among the countries hit with higher tariffs this week.",
    "link": "https://www.newsweek.com/trump-tariffs-make-bibles-expensive-2055398",
    "timestamp": "2025-04-04T15:09:32Z"
  },
  {
    "title": "Nintendo Switch 2 Pre-Orders Paused Due to Trump Tariffs",
    "description": "Nintendo said, \"Pre-orders for Nintendo Switch 2 in the US will not start April 9, 2025 in order to assess the potential impact.\"",
    "link": "https://www.newsweek.com/nintendo-switch-2-pre-orders-paused-due-trump-tariffs-2055462",
    "timestamp": "2025-04-04T15:09:15Z"
  },
  {
    "title": "Fact-checking director warns of 'crisis' as Meta, Trump's DOGE cuts threaten their 'honorable, patriotic' work",
    "description": "International Fact-Checking Network Director Angie Drobnic Holan defended the profession as crucial for democracy and fighting disinformation worldwide.",
    "link": "https://www.foxnews.com/media/fact-checking-director-warns-crisis-meta-trumps-doge-cuts-threaten-honorable-patriotic-work",
    "timestamp": "2025-04-04T15:09:14Z"
  },
  {
    "title": "Tariffs Drive Automakers to Adapt Quickly as Consumer Costs Climb",
    "description": "Likely no business vertical will emerge unscathed from the latest round of tariffs imposed by the President Donald Trump administration, but the automotive industry stands to be hit the hardest. Manufacturers and dealerships are navigating a complex landscape…",
    "link": "https://www.pymnts.com/economy/2025/tariffs-drive-automakers-adapt-quickly-consumer-costs-climb/",
    "timestamp": "2025-04-04T15:09:00Z"
  },
  {
    "title": "Nintendo Switch 2 Pre-orders in US Delayed Due to Trump's Tariffs",
    "description": "The Switch 2 launch of June 5 is still happening, and pre-orders outside the US seem unchanged.",
    "link": "https://www.cnet.com/tech/gaming/nintendo-switch-2-us-pre-orders-delayed-due-to-trumps-tariffs/",
    "timestamp": "2025-04-04T15:09:00Z"
  },
  {
    "title": "Is Europe the Last Champion of Liberal Democracy?",
    "description": "John Feffer\n\n\n\nAt the moment, unfortunately, it seems more likely that Europe will be the last powerful holdout in a world entering a new political Dark Age.\r\n\n\r\n\n\nThe post Is Europe the Last Champion of Liberal Democracy? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/european-union-liberal-democracy/",
    "timestamp": "2025-04-04T15:08:31Z"
  },
  {
    "title": "Eurogas chief: New EU gas contracts face uncertainty, and Trump tariffs won’t help",
    "description": "\"We still definitely consider US exporters as a reliable partner\" Eurogas’ chief Andreas Guth told Euractiv in an interview.",
    "link": "https://www.euractiv.com/section/eet/interview/eurogas-chief-new-eu-gas-contracts-face-uncertainty-and-trump-tariffs-wont-help/",
    "timestamp": "2025-04-04T15:08:26Z"
  },
  {
    "title": "‘Oligarchy’: Trump exempts big oil donors from tariffs package",
    "description": "Trump’s new 10% universal tariffs will not apply to many fossil fuel products in sign of his fealty, advocates say\nUS politics live – latest updates\nThe sweeping package of tariffs unveiled by Donald Trump on Wednesday includes an exemption for the energy sec…",
    "link": "https://biztoc.com/x/4a2cf172cc09dcfc",
    "timestamp": "2025-04-04T15:07:32Z"
  },
  {
    "title": "Stellantis to lay off 900 U.S. workers in ‘horrifying consequence’ of Trump’s tariffs",
    "description": "Stellantis NV said on Thursday it was temporarily laying off 900 workers at five U.S. facilities and pausing production at one assembly plant each in Mexico and Canada, after U.S. President Donald Trump’s tariffs were announced.\nTrump broadened the tariffs to…",
    "link": "https://biztoc.com/x/9be1bf19597527b8",
    "timestamp": "2025-04-04T15:07:31Z"
  },
  {
    "title": "The Ming Emperors Have Some Advice for America",
    "description": "",
    "link": "https://biztoc.com/x/98c2a9d81fd80a4a",
    "timestamp": "2025-04-04T15:07:16Z"
  },
  {
    "title": "Tariff countdown triggers shopping spree: Americans rush to buy key goods before Donald Trump’s trade war hits their wallets",
    "description": "Donald Trump’s tariffs have sparked a massive shopping rush across the U.S. as Americans scramble to buy essentials like shoes, coffee, furniture, and cars before prices spike. With new reciprocal tariffs hitting imports hard, experts warn that common items w…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tariff-countdown-triggers-shopping-spree-americans-rush-to-buy-key-goods-before-donald-trumps-trade-war-hits-their-wallets/articleshow/119985343.cms",
    "timestamp": "2025-04-04T15:06:17Z"
  },
  {
    "title": "Russia's Puppet Goes All Caps Over China's Reciprocal Tariffs On US Goods",
    "description": "Donald responded on Truth Social after China said Friday that it would impose reciprocal 34% tariffs on all imports from the United States from April 10, which they vowed to do if Trump escalated a trade war. Trump levied an additional 34% tariff on Chinese g…",
    "link": "https://crooksandliars.com/2025/04/krasnov-goes-all-caps-over-chinas",
    "timestamp": "2025-04-04T15:05:28Z"
  },
  {
    "title": "4 High-Paying, In-Demand Government Jobs To Consider in 2025",
    "description": "When looking for a good job, people often prioritize good benefits such as reliable healthcare, solid retirement plan with matching funds and a reasonable...",
    "link": "https://finance.yahoo.com/news/4-high-paying-demand-government-150527665.html",
    "timestamp": "2025-04-04T15:05:27Z"
  },
  {
    "title": "The Trump Administration’s Illogical Approach to State Secrets",
    "description": "Officials have been careless with sensitive information while claiming that innocuous facts can’t be public.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/national-security-secrets-trump-signal/682288/",
    "timestamp": "2025-04-04T15:05:00Z"
  },
  {
    "title": "US Aims to Bolster Its Arctic Presence to Control Polar Vast Resources",
    "description": "As the world fixates on the battlefields of Ukraine and the volatile Middle East, a quieter but no less consequential struggle is unfolding in the Arctic. Washington’s latest maneuver—planning to acquire icebreakers from Finland amid what some call an …\nThe p…",
    "link": "https://www.globalresearch.ca/us-aims-bolster-arctic-presence-control-polar-vast-resources/5883484",
    "timestamp": "2025-04-04T15:04:37Z"
  },
  {
    "title": "Trump's Treasury secretary 'looking for an exit door' after two months on the job: MSNBC",
    "description": "In the wake of Donald Trump's highly controversial decision to put in place a wall of international tariffs that has roiled the business world, the president's Treasury Secretary Scott Bessent is reportedly looking to move on from his current job after slight…",
    "link": "https://www.rawstory.com/bessent-trump-tariffs/",
    "timestamp": "2025-04-04T15:04:31Z"
  },
  {
    "title": "Trump’s Tariffs May Target Pharmaceuticals—Here’s How Drug Prices Could Change",
    "description": "Trump previously floated a 25% tariff on all imported drugs, though they were unaffected by recent reciprocal levies.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/04/trumps-tariffs-may-target-pharmaceuticals-heres-how-drug-prices-could-change/",
    "timestamp": "2025-04-04T15:04:30Z"
  },
  {
    "title": "Trump tariffs will hurt one and all",
    "description": "World economy and markets may well see a replay of 2008. The outlook for India is none too bright",
    "link": "https://www.thehindubusinessline.com/opinion/cartoons/trump-tariffs-will-hurt-one-and-all/article69413522.ece",
    "timestamp": "2025-04-04T15:03:25Z"
  },
  {
    "title": "Charlie Kirk As Stock Markets Collapse: You All Voted For Delayed Gratification",
    "description": "Watching the MAGA cult attempt to put lipstick on pig Trump's economy-destroying tariffs is like witnessing a horrible carnival act that falls to their death from the high wire. \nDuring the runup to the election, Trump, MAGA influencers and propagandists said…",
    "link": "https://crooksandliars.com/2025/04/charlie-kirk-you-all-voted-delayed",
    "timestamp": "2025-04-04T15:02:51Z"
  },
  {
    "title": "Trump Gal Pal Laura Loomer Got 6 National Security Officials Fired",
    "description": "The most important thing to know about a New York Times account of Laura Loomer’s meeting at the White House that resulted in the firing of six national security officials is that not a single member of Signalgate lost his job. \nNo, the six were fired for not…",
    "link": "https://crooksandliars.com/2025/04/trump-gal-pal-laura-loomer-got-6-national",
    "timestamp": "2025-04-04T15:02:41Z"
  },
  {
    "title": "Despite Promise of Better Regulation, Trump’s Tariffs Pose Serious Danger to Bitcoin‬ Price",
    "description": "The Bitcoin community is split. Some market players identify potential risks for Bitcoin and the broader cryptocurrency market, such as implementing higher tariff rates for many countries, while others note that the market stands to gain more from President T…",
    "link": "https://zycrypto.com/despite-promise-of-better-regulation-trumps-tariffs-pose-serious-danger-to-bitcoin-price/",
    "timestamp": "2025-04-04T15:02:26Z"
  },
  {
    "title": "Nintendo delays Switch 2 preorders over tariff concerns",
    "description": "Nintendo is pushing back preorders for the Switch 2 due to concerns about Donald Trump’s newly announced tariffs. According to a statement sent to The Verge by Eddie Garcia on behalf of Nintendo, it says preorders will no longer begin on April 9th: Pre-orders…",
    "link": "https://www.theverge.com/news/643483/nintendo-switch-2-preorders-delayed-tariffs",
    "timestamp": "2025-04-04T15:01:53Z"
  },
  {
    "title": "Trump threatens tariffs on pharma: Industry braces for tariffs, counter-tariffs and bilaterals",
    "description": "Industry-insiders are pegging much hope on the bi-lateral negotiations between officials of both countries, and the fact that generic drugs from India helped keep healthcare costs in check for the US",
    "link": "https://www.thehindubusinessline.com/news/national/trump-threatens-tariffs-on-pharma-industry-braces-for-tariffs-counter-tariffs-and-bilaterals/article69413474.ece",
    "timestamp": "2025-04-04T15:01:41Z"
  },
  {
    "title": "Trump threatens tariffs on pharma: Industry braces for tariffs, counter-tariffs and bilaterals",
    "description": "Industry-insiders are pegging much hope on the bi-lateral negotiations between officials of both countries, and the fact that generic drugs from India helped keep healthcare costs in check for the US",
    "link": "https://www.thehindubusinessline.com/economy/trump-threatens-tariffs-on-pharma-industry-braces-for-tariffs-counter-tariffs-and-bilaterals/article69413474.ece",
    "timestamp": "2025-04-04T15:01:41Z"
  },
  {
    "title": "Closed for Business: The Oddities of Trump’s Tariffs",
    "description": "Liberation Day, as April 2 was described by US President Donald Trump, had all the elements of reality television perversion.  It also had a dreamy, aspirational hope: that factories would spring up from rust belt soil in a few …\nThe post Closed for Business:…",
    "link": "https://www.globalresearch.ca/oddities-trump-tariffs/5883488",
    "timestamp": "2025-04-04T15:01:28Z"
  },
  {
    "title": "Trump's tariffs: How will they impact your wallet and what can you do to prepare yourself?",
    "description": "President Trump's new tariffs on imported goods will likely increase consumer prices on essentials and big-ticket items, disproportionately affecting low-income households. Economists highlight potential job losses and inflation impacts. Prices for groceries,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariffs-how-will-they-impact-your-wallet-and-what-can-you-do-to-prepare-yourself/articleshow/119985388.cms",
    "timestamp": "2025-04-04T15:01:12Z"
  },
  {
    "title": "Fidelity’s Solana ETF nears approval – Will SOL bounce back after 22% monthly crash?",
    "description": "What’s behind Fidelity’s crypto push—timing, tech, or something more strategic?",
    "link": "https://ambcrypto.com/fidelitys-solana-etf-nears-approval-will-sol-bounce-back-after-22-monthly-crash/",
    "timestamp": "2025-04-04T15:00:40Z"
  },
  {
    "title": "Nations Divided Ahead Of Decisive Week For Shipping Emissions",
    "description": "Members of the International Maritime Organization (IMO) are divided over whether to approve a carbon tax on international shipping, ahead of a meeting starting on Monday to finalise emissions-reduction measures.",
    "link": "https://www.ibtimes.com/nations-divided-ahead-decisive-week-shipping-emissions-3768849",
    "timestamp": "2025-04-04T15:00:21Z"
  },
  {
    "title": "Kansas mental health providers brace for impact of anti-trans laws",
    "description": "With gender-affirming care for minors now banned in Kansas, the weight of their transgender care falls largely on mental health providers. Nobody can police what a therapist talks to their client about.",
    "link": "https://lawrencekstimes.com/2025/04/04/ks-providers-brace-for-anti-trans-laws/",
    "timestamp": "2025-04-04T15:00:18Z"
  },
  {
    "title": "American Farmers Brace for Trade War Pain",
    "description": "The U.S. agricultural sector remains highly vulnerable to retaliation.",
    "link": "http://foreignpolicy.com/2025/04/04/trump-tariff-china-trade-war-agriculture-farmer/",
    "timestamp": "2025-04-04T15:00:15Z"
  },
  {
    "title": "Trump Administration Touts “Explosive” Jobs Report as Economy Implodes",
    "description": "The Trump administration is attempting to use the positive jobs report from March to assuage widespread economic panic over the unprecedented trade war the president launched on Wednesday. \r\n“Today’s jobs report shows the private sector is roaring back under …",
    "link": "https://newrepublic.com/post/193617/trump-administration-touts-explosive-jobs-report-economy-implodes",
    "timestamp": "2025-04-04T14:59:25Z"
  },
  {
    "title": "Letters to Editor",
    "description": "Letters to Editor",
    "link": "https://www.thehindubusinessline.com/opinion/letters-to-editor/article69413556.ece",
    "timestamp": "2025-04-04T14:59:06Z"
  },
  {
    "title": "Defying the Courts Will Backfire",
    "description": "The public has not responded kindly to other politicians who have tried this in the past.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/constitutional-crisis-trump/682294/",
    "timestamp": "2025-04-04T14:58:12Z"
  },
  {
    "title": "After Putin envoy's US talks, Kremlin says Putin and Trump have no plans to speak",
    "description": "MOSCOW (Reuters) -The Kremlin said on Friday that Russian President Vladimir Putin and U.S. President Donald Trump had no plans to talk after a visit to Washington by Putin's investment envoy as wider negotiations over a ceasefire in Ukraine appeared stalled.…",
    "link": "https://www.thestar.com.my/news/world/2025/04/04/after-putin-envoy039s-us-talks-kremlin-says-putin-and-trump-have-no-plans-to-speak",
    "timestamp": "2025-04-04T14:58:00Z"
  },
  {
    "title": "US job growth strong in March but Trump tariff impact still to come",
    "description": "US hiring soared past expectations in March, government data showed Friday, but analysts warn this is “old news” as the full effects of President Donald Trump’s tariffs and federal cuts have yet to ripple through the country. The world’s biggest economy added…",
    "link": "https://www.digitaljournal.com/world/us-job-growth-strong-in-march-but-trump-tariff-impact-still-to-come/article",
    "timestamp": "2025-04-04T14:57:33Z"
  },
  {
    "title": "Trump goads China after Beijing retaliates in global trade war",
    "description": "President Donald Trump goaded a “panicked” China on Friday after the chief US economic rival retaliated against his tariffs and he dismissed stock market panic over the growing global trade war, touting the chance to “get rich.” “China played it wrong, they p…",
    "link": "https://www.digitaljournal.com/world/trump-goads-china-after-beijing-retaliates-in-global-trade-war/article",
    "timestamp": "2025-04-04T14:57:32Z"
  },
  {
    "title": "Poll: AOC Might Steal Chuck Schumer’s Senate Seat In 2028",
    "description": "A poll by Data for Progress found that 55% of Democratic likely voters said they supported or leaned toward supporting Ocasio-Cortez.",
    "link": "https://dailycaller.com/2025/04/04/poll-aoc-might-steal-chuck-schumers-senate-seat-in-2028/",
    "timestamp": "2025-04-04T14:57:30Z"
  },
  {
    "title": "Trump Goads China After Beijing Retaliates In Global Trade War",
    "description": "President Donald Trump goaded a \"panicked\" China on Friday after the chief US economic rival retaliated against his tariffs and he dismissed stock market panic over the growing global trade war, touting the chance to \"get rich.\"",
    "link": "https://www.ibtimes.com/trump-goads-china-after-beijing-retaliates-global-trade-war-3768848",
    "timestamp": "2025-04-04T14:57:22Z"
  },
  {
    "title": "US DoE wants developers to fast-track AI datacenters on its land",
    "description": "But Bernstein analysts say tariffs could disrupt equipment supply chains\nThe US Department of Energy (DoE) is looking to co-locate datacenters with energy generation facilities to further America's AI ambitions, and is putting up its own land for this purpose…",
    "link": "https://www.theregister.com/2025/04/04/doe_ai_datacenters/",
    "timestamp": "2025-04-04T14:57:15Z"
  },
  {
    "title": "Trump Shares Video that Says He's 'Purposely Crashing the Market'",
    "description": "9 min ago\nTrump Shares Video that Says He's 'Purposely Crashing the Market'\nThose holding out hope President Donald Trump will dial back tariffs in the face of steep stock market declines may want to check in on his social media feed.\nTrump shared a video Thu…",
    "link": "https://biztoc.com/x/3d7f7a8636d16d71",
    "timestamp": "2025-04-04T14:56:15Z"
  },
  {
    "title": "Donald Trump to Skip US Soldier Memorial, White House Confirms",
    "description": "President Donald Trump will not attend the dignified transfer of the bodies of four American troops who died during a recent training exercise in Lithuania.\n\"The Secretary of Defense will represent the Administration at the dignified transfer for the four bra…",
    "link": "https://biztoc.com/x/96b43f81806e1fb9",
    "timestamp": "2025-04-04T14:56:08Z"
  },
  {
    "title": "From Stuttgart to Detroit: How Europe’s car giants are bracing for Trump’s tariff tsunami",
    "description": "Automakers have already started to adapt to the 25-percent tariff imposed on car imports by US President Donald Trump, from pausing production to raising prices or halting certain models.\nThe additional levy came into effect on Thursday and applies to all car…",
    "link": "https://biztoc.com/x/471c79cf35453426",
    "timestamp": "2025-04-04T14:55:48Z"
  },
  {
    "title": "The Purpose of Trump’s Cruel Deportation Theater",
    "description": "As the economy teeters on the brink, the president is banking on his hardline immigration policies more than ever.",
    "link": "http://nymag.com/intelligencer/article/the-purpose-of-trumps-cruel-deportation-theater.html",
    "timestamp": "2025-04-04T14:55:24Z"
  },
  {
    "title": "From firing to re-hiring: RFK Jr says some US health staff will be reinstated after being 'mistakenly' cut",
    "description": "Some of the roughly 10,000 employees fired from the Department of Health and Human Services are being asked to come back. HHS Secretary Robert F. Kennedy Jr. said  some of the programs and workers purged in last week's dramatic restructuring plan to shed 20,0…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/from-firing-to-hiring-again-rfk-jr-says-some-us-health-staff-will-be-reinstated-after-being-mistakenly-cut/articleshow/119985241.cms",
    "timestamp": "2025-04-04T14:54:43Z"
  },
  {
    "title": "Maryland Lawmakers Pass Bill to Study Reparations",
    "description": "Lawmakers in Maryland this week overwhelmingly approved a measure to study reparations for slavery.\nThe post Maryland Lawmakers Pass Bill to Study Reparations appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/04/maryland-lawmakers-pass-bill-to-study-reparations/",
    "timestamp": "2025-04-04T14:54:24Z"
  },
  {
    "title": "Ukraine commits new ceasefire violations – MOD",
    "description": "Kiev used UAVs and artillery to hit Russian energy facilites in Bryansk, Tambov and Lipetsk Regions, the Defense Ministry in Moscow has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615240-ukraine-energy-ceasefire-violation/",
    "timestamp": "2025-04-04T14:54:12Z"
  },
  {
    "title": "When you suffer huge stock market losses, Warren Buffett suggests reading a poem",
    "description": "Global stock markets plunged after President Trump announced a 10% blanket tariff on all U.S. trading partners, with higher rates for surplus countries like India at 26%. This triggered fears of a trade war and recession, impacting the Indian Sensex and Nifty…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/when-you-suffer-huge-stock-market-losses-warren-buffett-suggests-reading-a-poem/articleshow/119985246.cms",
    "timestamp": "2025-04-04T14:54:04Z"
  },
  {
    "title": "Fashion industry reacts to sweeping tariff changes",
    "description": "Experts say the new policies are likely to raise prices and weaken consumer confidence, and are unlikely to bring U.S. manufacturing back.",
    "link": "https://www.fashiondive.com/news/trump-tariffs-reciprocal-de-minimis-fashion-reacts/744380/",
    "timestamp": "2025-04-04T14:54:00Z"
  },
  {
    "title": "Will TikTok be banned after April 5? Latest updates on buyers and President Donald Trump's plans",
    "description": "Under the current law, TikTok must be sold or face removal from U.S. app stores. There have been a lot of proposals to buy the social media platform. Here’s a list of potential buyers and what’s next for TikTok.",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-tiktok-be-banned-after-april-5-latest-updates-on-buyers-and-president-donald-trumps-plans/articleshow/119985091.cms",
    "timestamp": "2025-04-04T14:53:55Z"
  },
  {
    "title": "JUST IN: Trump to Skip ‘Dignified Transfer’ of Four Dead Soldiers at Dover AFB to Attend LIV Golf Tournament",
    "description": "Trump is sending Defense Secretary Pete Hegseth to Dover AFB for the dignified transfer of four American soldiers killed in a training exercise in Lithuania.\nThe post JUST IN: Trump to Skip ‘Dignified Transfer’ of Four Dead Soldiers at Dover AFB to Attend LIV…",
    "link": "https://www.mediaite.com/trump/just-in-trump-to-skip-dignified-transfer-of-four-dead-soldiers-at-dover-afb-to-attend-liv-golf-tournament/",
    "timestamp": "2025-04-04T14:53:35Z"
  },
  {
    "title": "Oil falls to lowest level in more than three years amid recession fears, OPEC+ production hikes",
    "description": "President Trump's tariffs have raised fears of a recession just as projections for global oil supply have jumped.",
    "link": "https://www.cnbc.com/2025/04/04/oil-falls-to-3-year-low-amid-recession-fears-opec-production-hikes-.html",
    "timestamp": "2025-04-04T14:52:58Z"
  },
  {
    "title": "Trump 'Stopped World War 3' Says Russian Envoy: Ukraine Update for April 4",
    "description": "Moscow praises Trump for \"preventing World War 3,\" U.S. officials reassure NATO and analysts warn of renewed Russian offensives.",
    "link": "https://www.newsweek.com/russia-ukraine-war-update-trump-ceasefire-negotiations-2055333",
    "timestamp": "2025-04-04T14:52:48Z"
  },
  {
    "title": "Nintendo delays Switch 2 preorders over tariff concerns",
    "description": "Nintendo is pushing back preorders for the Switch 2 due to concerns about tariffs. According to a statement sent to The Verge by Eddie Garcia on behalf of Nintendo, it says preorders will no longer begin on April 9th: Pre-orders for Nintendo Switch 2 in the U…",
    "link": "https://www.theverge.com/news/643483/nintendo-switch-2-preoders-delayed-tariffs",
    "timestamp": "2025-04-04T14:52:41Z"
  },
  {
    "title": "American doctors want to leave U.S. How Canada could benefit from this reverse brain drain",
    "description": "How Canada Wins: The opportunity to lure doctors and top-tier medical research talent is enormous, medical experts say",
    "link": "https://nationalpost.com/health/america-canada-brain-drain",
    "timestamp": "2025-04-04T14:51:41Z"
  },
  {
    "title": "Carney: America Became an Economic Powerhouse Behind a Big Tariff Wall",
    "description": "On Thursday’s “Alex Marlow Show,” Breitbart News economics editor John Carney discussed tariffs. Carney stated, “[W]e built a sustainable economy, we did this thing, starting with Alexander Hamilton, where we said it’s really going to matter that we make thin…",
    "link": "https://freerepublic.com/focus/f-chat/4308818/posts",
    "timestamp": "2025-04-04T14:51:06Z"
  },
  {
    "title": "Donald Trump's AI-Generated Reciprocal Tariff Formula Theories",
    "description": "Donald Trump's AI-Generated Reciprocal Tariff Formula Theories, also known as Trump's Tariff Formula Controversy or Trump's AI Tariff Debate, refers to the viral discussions and controversy surrounding the potential use of Artificial Intelligence tools, such …",
    "link": "https://knowyourmeme.com/memes/donald-trumps-ai-generated-reciprocal-tariff-formula-theories",
    "timestamp": "2025-04-04T14:50:55Z"
  },
  {
    "title": "Donald Trump's AI-Generated Reciprocal Tariffs Formula Theories",
    "description": "Donald Trump's AI-Generated Reciprocal Tariff Formula Theories, also known as Trump's Tariff Formula Controversy or Trump's AI Tariff Debate, refers to the viral discussions and controversy surrounding the potential use of Artificial Intelligence tools, such …",
    "link": "https://knowyourmeme.com/memes/donald-trumps-ai-generated-reciprocal-tariffs-formula-theories",
    "timestamp": "2025-04-04T14:50:55Z"
  },
  {
    "title": "Nintendo halts Switch 2 preorders in the United States to assess tariff impact",
    "description": "Nintendo has halted its plans to begin Switch 2 preorders next week, citing President Donald Trump's newly announced tariffs as the reason.",
    "link": "https://www.digitaltrends.com/gaming/nintendo-halts-switch-2-preorders-in-the-united-states-to-assess-tariff-impact/",
    "timestamp": "2025-04-04T14:50:47Z"
  },
  {
    "title": "Donald Trump’s new tariff plans, explained",
    "description": "On Wednesday, the US president announced a slew of tariffs on countries around the globe. Here, we break down everything you need to know about the new raft of measures",
    "link": "https://www.dazeddigital.com/life-culture/article/66543/1/donald-trumps-new-tariff-plans-explained-liberation-day-taxes-imports?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=donald-trump-s-new-tariff-plans-explained",
    "timestamp": "2025-04-04T14:50:00Z"
  },
  {
    "title": "Nintendo delays Switch 2 pre-orders in response to Trump tariffs",
    "description": "Nintendo has delayed pre-orders in the U.S. for Switch 2 in response to sweeping new tariffs outlined the Trump administration earlier this week. Pre-orders were scheduled to begin on April 9, but have been delayed indefinitely. “Pre-orders for Nintendo Switc…",
    "link": "https://www.polygon.com/nintendo-switch-2/553133/pre-orders-delayed-trump-tariff",
    "timestamp": "2025-04-04T14:49:48Z"
  },
  {
    "title": "'Woo – buckle in': Trump reported to be risking 'full-blown economic crisis' with new move",
    "description": "A financial journalist laid out a \"disaster scenario\" that could be triggered by president Donald Trump's sweeping tariffs.The president announced double-digit tariffs against nearly 100 nations, and CNN's global economic analyst Rana Foroohar warned that thi…",
    "link": "https://www.rawstory.com/trump-economic-crisis-buckle-in/",
    "timestamp": "2025-04-04T14:48:51Z"
  },
  {
    "title": "Iran and U.S. Threat of War: Seven Signs To Watch",
    "description": "The U.S. has threatened Iran with military action if it does not come to the negotiation table. Iran has refused direct talks with the U.S. and warned of hitting back if attacked",
    "link": "https://www.newsweek.com/iran-us-conflict-seven-signs-list-2055175",
    "timestamp": "2025-04-04T14:48:29Z"
  },
  {
    "title": "Trump says China ‘played it wrong’ with tariff retaliation, vows ‘my policies will never change’",
    "description": "President Trump stood by his “Liberation Day” reciprocal tariff package Friday after China hit back with a 34% tariff on US goods, promising investors that his “policies will never change.” In a string of all-caps Truth Social posts, the president argued his …",
    "link": "https://nypost.com/2025/04/04/us-news/trump-says-china-played-it-wrong-with-tariff-retaliation-vows-my-policies-will-never-change/",
    "timestamp": "2025-04-04T14:47:32Z"
  },
  {
    "title": "Canadians Advised to Take Burner Phones When Travelling to US",
    "description": "Immigration lawyers have advised Canadians to leave their regular phones at home following border searches of people's personal devices.",
    "link": "https://www.newsweek.com/canadians-advised-take-burner-phones-when-travelling-us-2055299",
    "timestamp": "2025-04-04T14:47:03Z"
  },
  {
    "title": "How Donald Trump's Tariffs Will Impact California",
    "description": "After Trump's \"Liberation Day\" announcement on Wednesday, California is bracing for the impact of the president's new tariffs.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-california-food-prices-2055394",
    "timestamp": "2025-04-04T14:46:04Z"
  },
  {
    "title": "Dollar Wipes Out Post-Trump Rally as Tariffs Upend Global Growth",
    "description": "The dollar has wiped out all of its gains since Donald Trump won the presidency in November as his aggressive tariffs upend global markets.",
    "link": "https://financialpost.com/pmn/business-pmn/dollar-wipes-out-post-trump-rally-as-tariffs-upend-global-growth",
    "timestamp": "2025-04-04T14:46:03Z"
  },
  {
    "title": "Rand Paul Rages Against Trump Tariffs In Fox Op-Ed, Warns Republicans They’re Inviting ‘Electoral Disasters’",
    "description": "Sen. Rand Paul (R-KY) warned Republicans that \"electoral disasters\" are coming if they do not abandon support for President Donald Trump's tariffs.\nThe post Rand Paul Rages Against Trump Tariffs In Fox Op-Ed, Warns Republicans They’re Inviting ‘Electoral Disa…",
    "link": "https://www.mediaite.com/news/rand-paul-rages-against-trump-tariffs-in-fox-op-ed-warns-republicans-theyre-inviting-electoral-disasters/",
    "timestamp": "2025-04-04T14:45:16Z"
  },
  {
    "title": "Obama rips into law firms, universities bowing to Trump threats at Hamilton College (Emily Hallas/Washington Examiner)",
    "description": "Emily Hallas / Washington Examiner:\nObama rips into law firms, universities bowing to Trump threats at Hamilton College  —  Former President Barack Obama urged academic and legal institutions to step up resistance to President Donald Trump's agenda during a s…",
    "link": "https://www.memeorandum.com/250404/p42",
    "timestamp": "2025-04-04T14:45:00Z"
  },
  {
    "title": "Trump touts $5M visa gold card: 'Anybody want to buy one?'",
    "description": "President Donald Trump showed off his administration's new revenue-generating $5 million \"gold card\" immigrant visa on Thursday, flashing the gilded pocket-sized document with his image emblazoned across the front.\n\"For $5 million, this could be yours,\" Trump…",
    "link": "https://biztoc.com/x/dc5221c0dd6bf5b9",
    "timestamp": "2025-04-04T14:44:55Z"
  },
  {
    "title": "Austria Issues Warning to Republican States Over Trump Tariffs",
    "description": "\"We have to hit Republican states and we have to hit Donald Trump's friends,\" a top European official told his colleagues.",
    "link": "https://biztoc.com/x/93d30d57d0582608",
    "timestamp": "2025-04-04T14:44:49Z"
  },
  {
    "title": "‘Scary times’: New York shopkeepers plan ‘astronomical’ price hikes under Trump tariffs",
    "description": "Small businesses that import goods brace for steep price increases that they have to pass on to their customers\nIt’s just two days since Donald Trump launched his extraordinary tariff assault on the world in a bid to rebuild the US economy and roll back an er…",
    "link": "https://biztoc.com/x/7624047ba8a329d3",
    "timestamp": "2025-04-04T14:44:44Z"
  },
  {
    "title": "Retail traders keep buying the dip — and they keep getting burned",
    "description": "\"Despite a sea of red, retail investors stood firm and not only bought the dip but did so at a historic pace,\" JPMorgan said on Thursday.",
    "link": "https://www.businessinsider.com/retail-investors-buy-dip-trump-tariff-trade-war-tsla-nvidia-2025-4",
    "timestamp": "2025-04-04T14:44:38Z"
  },
  {
    "title": "Rutte: Trump committed to NATO collective defense",
    "description": "North Atlantic Treaty Organization (NATO) Secretary General Mark Rutte said on Friday that United States President Donald Trump has not thwarted the alliance's Article Five principle of collective def...",
    "link": "https://biztoc.com/x/53b4686bf594e34e",
    "timestamp": "2025-04-04T14:44:34Z"
  },
  {
    "title": "Five things to know from Radio-Canada's leader interviews",
    "description": "Quebecers got a first taste of what they can expect in about two weeks, when all political leaders will face off in their first debate.",
    "link": "https://nationalpost.com/news/politics/five-things-to-know-from-radio-canadas-leader-interviews",
    "timestamp": "2025-04-04T14:44:07Z"
  },
  {
    "title": "US Age Groups Most Vulnerable to Social Security Cuts",
    "description": "The SSA, which distributes benefits to around 70 million Americans, has undergone various changes thanks to DOGE works.",
    "link": "https://www.newsweek.com/us-age-groups-most-vulnerable-doge-social-security-cuts-2055330",
    "timestamp": "2025-04-04T14:43:26Z"
  },
  {
    "title": "Jim Cramer on Ollie’s Bargain (OLLI) – “I’m a Proud Member of Ollie’s Army!”",
    "description": "We recently published a list of Jim Cramer’s Take on These 10 Stocks. In this article, we are going to take a look at where Ollie’s Bargain Outlet Holdings, ...",
    "link": "https://finance.yahoo.com/news/jim-cramer-ollie-bargain-olli-144222483.html",
    "timestamp": "2025-04-04T14:42:22Z"
  },
  {
    "title": "Amid turmoil, Trump heads to Florida for a golf event (again)",
    "description": "It doesn’t look great for Donald Trump to take a golf trip after setting much of the economy — and your retirement account — on fire, but he’s doing it anyway.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-florida-golf-event-tariffs-soldiers-lithuania-rcna199706",
    "timestamp": "2025-04-04T14:42:22Z"
  },
  {
    "title": "Germany says adding explosive drones to weapons arsenal",
    "description": "Germany said Friday it would buy explosive drones for the first time as Berlin boosts investments in its armed forces to counter the threat from Russia.",
    "link": "https://www.thelocal.de/20250404/germany-says-adding-explosive-drones-to-weapons-arsenal",
    "timestamp": "2025-04-04T14:41:51Z"
  },
  {
    "title": "Multinational cite housing and gas costs as biggest downside to doing business in Ireland",
    "description": "Planning process also tops lists",
    "link": "https://www.irishtimes.com/business/2025/04/04/multinational-cite-housing-and-gas-costs-as-biggest-downside-to-doing-business-in-ireland/",
    "timestamp": "2025-04-04T14:41:19Z"
  },
  {
    "title": "South Korea Ousts President over Martial Law Decree, Election Expected in June",
    "description": "The Constitutional Court of South Korea voted to remove impeached President Yoon Suk-yeol on Friday, ending a four-month-long drama that began with Yoon abruptly attempting, and failing, to impose martial law on the country.\nThe post South Korea Ousts Preside…",
    "link": "https://www.breitbart.com/asia/2025/04/04/south-korea-ousts-president-over-martial-law-decree-election-expected-in-june/",
    "timestamp": "2025-04-04T14:40:47Z"
  },
  {
    "title": "FactCheck: Does the EU impose a 39% tariff on US goods as Donald Trump's massive chart claimed?",
    "description": "How accurate are Trump’s ‘Liberation Day’ figures?",
    "link": "https://www.thejournal.ie/eu-tariffs-united-states-donald-trump-factcheck-6668226-Apr2025/",
    "timestamp": "2025-04-04T14:40:18Z"
  },
  {
    "title": "Brookfield to Buy Colonial Pipeline Owner in $9B Deal",
    "description": "A group of investors led by Brookfield agreed to acquire Colonial Enterprises in a deal that values the operator of the biggest U.S. fuel pipeline at about $9 billion.",
    "link": "https://www.rigzone.com/news/wire/brookfield_to_buy_colonial_pipeline_owner_in_9b_deal-04-apr-2025-180140-article/",
    "timestamp": "2025-04-04T14:38:58Z"
  },
  {
    "title": "Trump abruptly fires the general who headed the National Security Agency",
    "description": "It's unclear who's now in charge of the NSA and the Cyber Command.",
    "link": "https://www.denverpost.com/2025/04/04/trump-national-security-agency-democrats/",
    "timestamp": "2025-04-04T14:38:43Z"
  }
]