[
  {
    "title": "What if India and China stop buying Russian oil?",
    "description": "Donald Trump is tightening sanctions loopholes that fund Moscow's war machine. What does a crackdown on Russia's oil trade mean for global markets — and economic heavyweights like China and India?",
    "link": "https://biztoc.com/x/a6be35cdfb79fab9",
    "timestamp": "2025-08-06T15:52:52Z"
  },
  {
    "title": "Trump Predicts Who Will Replace Him In 2028",
    "description": "By Mariane Angela, Daily Caller News Foundation | August 05, 2025\nPresident Donald Trump said Tuesday that Vice President JD Vance is “probably favored” to carry the MAGA mantle in 2028, while leaving the door open for Secretary of State Marco Rubio to join t…",
    "link": "https://biztoc.com/x/e9efcaacd7584a12",
    "timestamp": "2025-08-06T15:52:51Z"
  },
  {
    "title": "Apple Stock Is Rising Wednesday: What's Going On?",
    "description": "Apple Inc (NASDAQ:AAPL) shares are trading higher Wednesday following reports that the company will make an investment commitment announcement at the White House.\nWhat To Know: Bloomberg reported that President Donald Trump is set to announce a $100 billion d…",
    "link": "https://biztoc.com/x/8a16df2e295c84be",
    "timestamp": "2025-08-06T15:52:48Z"
  },
  {
    "title": "Trump to impose extra 25% import tax on India for Russian oil purchases, brings combined tariffs to 50%",
    "description": "President Donald Trump signed an executive order Wednesday to place an additional 25 per cent tariff on India for its purchases of Russian oil, bringing the combined tariffs imposed by the United States on its ally to 50 per cent.\nThe tariffs would go into ef…",
    "link": "https://biztoc.com/x/fcafb9c9a3391921",
    "timestamp": "2025-08-06T15:52:42Z"
  },
  {
    "title": "\"Dialogue Will Prevail\": Unexpected Scenes Of Witkoff & Putin Envoy Strolling Through Moscow Park",
    "description": "\"Dialogue Will Prevail\": Unexpected Scenes Of Witkoff & Putin Envoy Strolling Through Moscow Park\n \nBloomberg is reporting Wednesday that President Donald Trump suggested he would hike tariffs on more countries buying Russian energy, including China, as the d…",
    "link": "https://biztoc.com/x/5dff18a63c38b526",
    "timestamp": "2025-08-06T15:52:39Z"
  },
  {
    "title": "Former Shin Bet, Mossad heads urge Trump to 'compel Netanyahu' to end Gaza war",
    "description": "Former Mossad chief Tamir Pardo, former Shin Bet chief Ami Ayalon, and former deputy IDF chief Matan Vilnai on Sunday announced they had sent a letter to US President Donald Trump requesting that he compel Prime Minister Benjamin Netanyahu to end the current …",
    "link": "https://freerepublic.com/focus/f-news/4333031/posts",
    "timestamp": "2025-08-06T15:52:36Z"
  },
  {
    "title": "U.S. jobs data can be seen as 99.9% correct",
    "description": "Is there something really wrong with the nation’s employment counts?\nQuestions about the quality of the jobs data came into the spotlight this month when President Donald Trump fired the boss of the Bureau of Labor Statistics after its latest report showed, a…",
    "link": "https://biztoc.com/x/1841ddc1142e3e5f",
    "timestamp": "2025-08-06T15:52:27Z"
  },
  {
    "title": "'Sydney Sweeney has great jeans' ads lift American Eagle stock price",
    "description": "The ad is a cheeky play on the words genes and jeans. After Donald Trump weighed in, share prices climbed.",
    "link": "https://nationalpost.com/entertainment/sydney-sweeney-american-eagle-jeans",
    "timestamp": "2025-08-06T15:52:19Z"
  },
  {
    "title": "How U.S. Trade Tactics Are Reshaping Venture Capital In Europe",
    "description": "The VC landscape is getting heated and expanding over AI, but another topic seems to be populating investment memos, GTM strategies and expansion plans. Tariffs, those seemingly boring policy tools, are redrawing the investment map across continents and decid…",
    "link": "https://www.forbes.com/sites/josipamajic/2025/08/06/how-us-trade-tactics-are-reshaping-venture-capital-in-europe/",
    "timestamp": "2025-08-06T15:51:23Z"
  },
  {
    "title": "'South Park' Tells ICE 'Eat a Bag of Dicks'",
    "description": "Comedy Central's long-running \"South Park\" series told the U.S. Department of Homeland Security to \"eat a bag of dicks\" on Tuesday.\nThe post ‘South Park’ Tells ICE ‘Eat a Bag of Dicks’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/08/06/south-park-tells-ice-eat-a-bag-of-dicks/",
    "timestamp": "2025-08-06T15:50:43Z"
  },
  {
    "title": "Nationalist Bosnian Serb leader rejects ruling to remove him from office",
    "description": "Separatist Milorad Dodik is backed by Russia, Hungary and Serbia, and seeks US support",
    "link": "https://www.irishtimes.com/world/europe/2025/08/06/nationalist-bosnian-serb-leader-rejects-ruling-to-remove-him-from-office/",
    "timestamp": "2025-08-06T15:47:50Z"
  },
  {
    "title": "India caught in a bind on Russian crude after Trump tariff, may look to diversify further",
    "description": "Faced with potential tariffs, Indian refiners are re-evaluating their reliance on Russian oil imports. While no official directive has been issued, companies are considering diversifying their crude sources, potentially increasing imports from the US and Midd…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-caught-in-a-bind-on-russian-crude-after-trump-tariff-may-look-to-diversify-further/articleshow/123145894.cms",
    "timestamp": "2025-08-06T15:47:30Z"
  },
  {
    "title": "Survivors of Israel’s pager attack on Hezbollah last year struggle to recover",
    "description": "More than 3,000 wounded Lebanese are on a slow, painful path to recovery.",
    "link": "https://www.bostonherald.com/2025/08/06/lebanon-pager-attack-survivors/",
    "timestamp": "2025-08-06T15:47:20Z"
  },
  {
    "title": "India Condemns New US Tariffs as Unjust, Vows to Take 'All Necessary Measures' in Response",
    "description": "NEW DELHI (Sputnik) - India considers the US actions to impose new tariffs unfair, unjustified, and unreasonable and will take all necessary measures to protect its national interests, Indian Foreign Ministry spokesman Randhir Jaiswal said on Wednesday.",
    "link": "https://sputnikglobe.com/20250806/india-condemns-new-us-tariffs-as-unjust-vows-to-take-all-necessary-measures-in-response-1122563366.html",
    "timestamp": "2025-08-06T15:46:01Z"
  },
  {
    "title": "Lockdown ordered at Ft. Stewart",
    "description": "Multiple people were wounded in an active shooting situation at Fort Stewart-Hunter Army Airfield on Wednesday.",
    "link": "https://www.wsbtv.com/news/georgia/lockdown-ordered-ft-stewart/3PEFVCVRBJAPVLQX5FT7GRMHQE/",
    "timestamp": "2025-08-06T15:45:52Z"
  },
  {
    "title": "China Is Digging a 10,000-Meter Hole Into the Earth—And Their True Motive Might Surprise You",
    "description": "China is drilling one of the deepest holes ever attempted—down to 10,000 meters—through layers of Earth’s crust untouched for millions of years. In one of the world’s most ambitious geoscience projects to date, Chinese engineers have begun drilling a 10,000-m…",
    "link": "https://freerepublic.com/focus/f-chat/4333029/posts",
    "timestamp": "2025-08-06T15:45:46Z"
  },
  {
    "title": "Donald Trump's Niece Claims His Mental Health is 'Declining Rapidly'— Shares Multiple Proofs From This Week Alone",
    "description": "Mary Trump, long time critic of President Donald Trump explains he’s mentally and psychologically declining each passing day. She calls it dangerous.",
    "link": "https://www.inquisitr.com/donald-trumps-niece-claims-his-mental-health-is-declining-rapidly-shares-multiple-proofs-from-this-week-alone",
    "timestamp": "2025-08-06T15:45:17Z"
  },
  {
    "title": "Swiss Firms Rethink Global Strategy After Tariff Surge",
    "description": "Simon Michel couldn’t take the risk of waiting any longer.",
    "link": "https://www.livemint.com/companies/news/swiss-firms-rethink-global-strategy-after-tariff-surge-11754495055810.html",
    "timestamp": "2025-08-06T15:44:15Z"
  },
  {
    "title": "New federal school voucher program poses a quandary for states: Opt in or opt out?",
    "description": "States can also choose to redraw the program's footprint.",
    "link": "https://www.bostonherald.com/2025/08/06/new-federal-school-voucher-program-poses-a-quandary-for-states-opt-in-or-opt-out/",
    "timestamp": "2025-08-06T15:43:58Z"
  },
  {
    "title": "Apple to invest $100bn after pressure from Trump",
    "description": "The US president has called on Apple to do more of its manufacturing in the US.",
    "link": "https://www.bbc.com/news/articles/cdx0n7y29kdo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-06T15:43:52Z"
  },
  {
    "title": "EU nation shelves purchase of US F-35 fighter jets – media",
    "description": "Spain’s decision reportedly reflects a broader EU militarization drive aimed at defense sovereignty and reduced reliance on US weapons Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622560-spain-us-fighter-jets/",
    "timestamp": "2025-08-06T15:43:11Z"
  },
  {
    "title": "Shock Poll: Trump now less popular than AOC and Bernie Sanders — Gallup reveals stunning numbers",
    "description": "A new Gallup poll reveals Donald Trump’s favorability has plummeted, particularly among independents, dropping to 29%. His economic strategies, legal controversies, and perceived disregard for democratic norms are eroding support. Concerns over tariffs, infla…",
    "link": "https://economictimes.indiatimes.com/news/international/us/shock-poll-trump-now-less-popular-than-aoc-and-bernie-sanders-gallup-reveals-stunning-numbers/articleshow/123145785.cms",
    "timestamp": "2025-08-06T15:41:45Z"
  },
  {
    "title": "JD Vance Is Planning To Get Very Involved In The Epstein Controversy",
    "description": "President Donald Trump has unsuccessfully tried to dampen the public's interest in the story, so his vice president is stepping in.",
    "link": "https://www.huffpost.com/entry/vance-epstein-strategy-meeting_n_689358e5e4b07e7958a14d59",
    "timestamp": "2025-08-06T15:41:10Z"
  },
  {
    "title": "Backfire: Barack Obama Weighs In On the Texas Redistricting Controversy and It Promptly Blows Up In His Face",
    "description": "Obama decided to weigh in on Texas Republicans’ efforts to redistrict mid-decade, and he may have wanted to wait to hit send instead. ... President Trump urged Texas Governor Greg Abbott and the Texas State Legislature to create five additional Republican con…",
    "link": "https://freerepublic.com/focus/f-news/4333028/posts",
    "timestamp": "2025-08-06T15:40:43Z"
  },
  {
    "title": "U.S. jobs data can be seen as 99.9% correct",
    "description": "It's a battle over a 133,000 smaller job count for June vs. nearly 160 million U.S. jobs.",
    "link": "https://www.bostonherald.com/2025/08/06/u-s-jobs-data-can-be-seen-as-99-9-correct/",
    "timestamp": "2025-08-06T15:40:24Z"
  },
  {
    "title": "Trump administration staffer known as 'Big Balls' assaulted in DC (Politico)",
    "description": "Politico:\nTrump administration staffer known as ‘Big Balls’ assaulted in DC … President Donald Trump posted a photo on his social media platform showing a shirtless Coristine with what appeared to be blood spattered on his face, body and pants.  He called for…",
    "link": "https://www.memeorandum.com/250806/p57",
    "timestamp": "2025-08-06T15:40:02Z"
  },
  {
    "title": "Tulsi Gabbard’s “Irrefutable” Obama Evidence Is a Big Pile of Nothing",
    "description": "Intelligence Director Tulsi Gabbard’s stupendous evidence that former President Barack Obama masterminded the Trump-Russia investigation boils down to a single word choice.Gabbard was pressed to explain her theory—which has been roundly condemned as a thinly …",
    "link": "https://newrepublic.com/post/198856/tulsi-gabbard-obama-russia-evidence",
    "timestamp": "2025-08-06T15:39:42Z"
  },
  {
    "title": "Colbert confronts JB Pritzker with map showing Illinois gerrymandering",
    "description": "Late-night host Stephen Colbert confronted Democratic Illinois Gov. JB Pritzker with gerrymandered maps of Illinois congressional districts on Tuesday amid Texas Republicans' efforts to redraw the state's congressional map. \"If you are considering doing a lit…",
    "link": "https://freerepublic.com/focus/f-chat/4333027/posts",
    "timestamp": "2025-08-06T15:38:38Z"
  },
  {
    "title": "Trump Advisers Push for a Temporary Fed Governor to Fill Open Seat",
    "description": "Donald Trump’s advisers are encouraging him to nominate a temporary Federal Reserve governor to fill the soon-to-be vacant seat on the central bank’s board, according to people familiar with the discussions.",
    "link": "https://www.livemint.com/companies/news/trump-advisers-push-for-a-temporary-fed-governor-to-fill-open-seat-11754494686691.html",
    "timestamp": "2025-08-06T15:38:06Z"
  },
  {
    "title": "TRUMP TARGETS GAYLE KING FOR RUIN...",
    "description": "TRUMP TARGETS GAYLE KING FOR RUIN...\r\n\n \n \n \n (Top headline, 2nd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Ellison Begins High Wire Act at New PARAMOUNT...",
    "link": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/05/donald-trump-gayle-king-comments/85526607007/",
    "timestamp": "2025-08-06T15:37:37Z"
  },
  {
    "title": "Ellison Begins High Wire Act at New PARAMOUNT...",
    "description": "Ellison Begins High Wire Act at New PARAMOUNT...\r\n\n \n \n \n (Top headline, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:TRUMP TARGETS GAYLE KING FOR RUIN...\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "http://www.hollywoodreporter.com/business/business-news/david-ellison-paramount-skydance-plan-tech-1236338245/",
    "timestamp": "2025-08-06T15:37:36Z"
  },
  {
    "title": "Heritage officials asked if CBC and Radio-Canada should be split, internal document shows",
    "description": "As the government rejected the idea of splitting CBC and Radio-Canada, Canadian Heritage officials pondered whether it was worth exploring.",
    "link": "https://nationalpost.com/news/politics/heritage-officials-asked-if-cbc-and-radio-canada-should-be-split-internal-document-shows",
    "timestamp": "2025-08-06T15:37:15Z"
  },
  {
    "title": "Heritage officials asked if CBC and Radio-Canada should be split, internal document shows",
    "description": "As the government rejected the idea of splitting CBC and Radio-Canada, Canadian Heritage officials pondered whether it was worth exploring.",
    "link": "https://nationalpost.com/news/canada/heritage-officials-asked-if-cbc-and-radio-canada-should-be-split-internal-document-shows",
    "timestamp": "2025-08-06T15:37:15Z"
  },
  {
    "title": "Time For India To Turn Crisis Into Opportunity, Says Anand Mahindra",
    "description": "With US President Donald Trump setting the total tariff on India at 50% Anand Mahindra, chairperson of the Mahindra Group, has called on India to proactively harness the ongoing global tariff disruptions to drive transformative domestic reform. In his post on…",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-tariffs-time-for-india-to-turn-crisis-into-opportunity-says-anand-mahindra",
    "timestamp": "2025-08-06T15:36:59Z"
  },
  {
    "title": "Russia, China practice destroying 'enemy' submarine in naval drill after Trump moves US nuclear assets",
    "description": "The Russian and Chinese militaries practiced destroying an \"enemy\" submarine during joint naval drills Wednesday, just days after President Donald Trump moved a pair of nuclear submarines toward Russia, a report said. The drills involved Il-38 planes from Rus…",
    "link": "https://freerepublic.com/focus/f-news/4333025/posts",
    "timestamp": "2025-08-06T15:33:48Z"
  },
  {
    "title": "Where could India look to replace Russian oil?",
    "description": "India, which sources over 35% of its crude oil from Russia, may look to Middle Eastern, African, and other suppliers if U.S. penalties force a cut in Russian imports. Russian oil, offered at discounted rates after Western sanctions in 2022, helped India manag…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/where-could-india-look-to-replace-russian-oil/articleshow/123145691.cms",
    "timestamp": "2025-08-06T15:32:36Z"
  },
  {
    "title": "Trump and Putin Are Flexing Their Way Toward a Nuclear Stand-Off",
    "description": "\"Rhetoric sometimes turns into action in unpredictable ways,\" a former senior U.S. arms control official told Newsweek.",
    "link": "https://www.newsweek.com/trump-putin-flexing-way-toward-nuclear-stand-off-2109376",
    "timestamp": "2025-08-06T15:32:22Z"
  },
  {
    "title": "Tim Scott pressed on CBS about how he can ‘reconcile’ his Christian faith with supporting Trump",
    "description": "Sen. Tim Scott (R-S.C.) was asked how he could support President Donald Trump as a devout Christian during an interview Tuesday on \"CBS Mornings Plus.\"",
    "link": "https://nypost.com/2025/08/06/media/tim-scott-pressed-on-cbs-about-how-he-can-reconcile-his-christian-faith-with-supporting-trump/",
    "timestamp": "2025-08-06T15:32:17Z"
  },
  {
    "title": "'Dear Colleague' Trump order completely ignored by half of US states",
    "description": "Hilary Lustick, UMass LowellDonald Trump's aggressive assault on diversity, equity and inclusion programs in schools resulted in a letter sent to all school that receive funding that began with \"Dear Colleague,\" and then made open threats.But six months after…",
    "link": "https://www.rawstory.com/trump-dei-schools/",
    "timestamp": "2025-08-06T15:32:00Z"
  },
  {
    "title": "Ken Paxton and Greg Abbott’s dubious threat against Texas Democrats",
    "description": "Amid redistricting fight, Paxton stated that he will ask for a court ruling declaring vacant the seats of quorum-breaking Democratic members of the Texas House if they don't return by Friday.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/texas-democrats-threats-redistricting-ken-paxton-greg-abbot-rcna223351",
    "timestamp": "2025-08-06T15:31:40Z"
  },
  {
    "title": "Sen. Marsha Blackburn jumps into race for Tennessee governor",
    "description": "Blackburn's announcement sets up a Republican primary clash in August 2026 against Rep. John Rose who is also a Trump backer.",
    "link": "https://www.pbs.org/newshour/politics/sen-marsha-blackburn-jumps-into-race-for-tennessee-governor",
    "timestamp": "2025-08-06T15:30:36Z"
  },
  {
    "title": "On Texas Republicans’ redistricting scheme, Trump gives away the game",
    "description": "Then-former President Donald Trump, right, is introduced by Texas Gov. Greg Abbott at the South Texas International Airport, in Edinburg, Texas, on Nov. 19, 2023.",
    "link": "https://biztoc.com/x/1cfa8804791a90d8",
    "timestamp": "2025-08-06T15:30:34Z"
  },
  {
    "title": "India: US tariffs 'unfair, unjustified, unreasonable'",
    "description": "India on Wednesday condemned the latest US tariffs as \"unfair, unjustified and unreasonable,\" after President Donald Trump signed an executive order imposing an additional 25% duty on Indian goods in ...",
    "link": "https://biztoc.com/x/cf38c4ef52cb94ef",
    "timestamp": "2025-08-06T15:30:18Z"
  },
  {
    "title": "Justice Department Opens Grand Jury Probe Into ‘Russiagate’",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | August 04, 2025\nThe Department of Justice staff will act on the criminal referral from Director of National Intelligence Tulsi Gabbard related to the reputed conspiracy to tie Donald Trump to Russia before an…",
    "link": "https://biztoc.com/x/77edc15b694941fd",
    "timestamp": "2025-08-06T15:30:13Z"
  },
  {
    "title": "Why India is in Trump’s crosshairs when crude is not even sanctioned",
    "description": "If India were to stop buying Russian oil today, global crude prices would jump, industry sources in the Indian petroleum sector told CNBC,",
    "link": "https://www.cnbc.com/2025/08/06/why-india-is-in-trumps-crosshairs-when-crude-is-not-even-sanctioned.html",
    "timestamp": "2025-08-06T15:29:23Z"
  },
  {
    "title": "“South Park” trolls Homeland Security for using show in ICE recruitment post",
    "description": "On Tuesday, Aug 6, South Park clapped back at the U.S. Department of Homeland Security on social media. The federal agency used a teaser image from the satirical TV show to promote recruitment for Immigration and Customs Enforcement (ICE) on X. The animated s…",
    "link": "https://www.dailydot.com/viral-politics/south-park-homeland-security-ice/",
    "timestamp": "2025-08-06T15:29:20Z"
  },
  {
    "title": "Virginia Giuffre's Family Reacts to JD Vance's 'Strategy Mission' Over Epstein Files",
    "description": "The family of Virginia Giuffre has called for sexual abuse survivors of Jeffrey Epstein to be included in the administration's \"strategy mission.\" Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/jeffrey-epstein-files-virginia-giuffre-trump-live-updates-2109750",
    "timestamp": "2025-08-06T15:29:17Z"
  },
  {
    "title": "Was ‘The Howard Stern Show’ Canceled? What We Know So Far",
    "description": "A new report claims that Stern's show is about to end after nearly 20 years. Get updates about 'The Howard Stern Show's future here.",
    "link": "https://hollywoodlife.com/feature/was-howard-stern-show-canceled-5433129/",
    "timestamp": "2025-08-06T15:28:59Z"
  },
  {
    "title": "Murder, Rape, and Robbery Rates Fall, New FBI Date Shows",
    "description": "New FBI data shows crime rates fell in 2024, with violent crime as a whole falling by 4.5% compared with 2023. The FBI estimates a... Read More\nThe post Murder, Rape, and Robbery Rates Fall, New FBI Date Shows appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/06/murder-rape-and-robbery-rates-fall-new-fbi-date-shows/",
    "timestamp": "2025-08-06T15:28:44Z"
  },
  {
    "title": "Trump-Modi ties hit rock bottom with new tariffs on India over Russian oil",
    "description": "Trump's tariff threats and social media outbursts have raised concerns about the state of India-US relations.",
    "link": "https://www.bbc.com/news/articles/c15lqe7v302o",
    "timestamp": "2025-08-06T15:28:28Z"
  },
  {
    "title": "Apple to invest $100bn after pressure from Trump",
    "description": "The US president has called on Apple to do more of its manufacturing in the US.",
    "link": "https://www.bbc.com/news/articles/cdx0n7y29kdo",
    "timestamp": "2025-08-06T15:27:39Z"
  },
  {
    "title": "Trump Hits India With Additional Tariff Over Russia Oil",
    "description": "U.S. President Donald Trump imposed an additional 25 percent tariff on Indian goods over its purchase of Russian energy, the White House said Wednesday.",
    "link": "https://www.rigzone.com/news/wire/trump_hits_india_with_additional_tariff_over_russia_oil-06-aug-2025-181394-article/",
    "timestamp": "2025-08-06T15:27:23Z"
  },
  {
    "title": "Trump Doubles Tariff on India to 50 Pct",
    "description": "U.S. President Donald Trump doubled tariffs on Indian goods to 50 percent as a penalty for its purchases of Russian oil.",
    "link": "https://www.rigzone.com/news/wire/trump_doubles_tariff_on_india_to_50_pct-06-aug-2025-181394-article/",
    "timestamp": "2025-08-06T15:27:23Z"
  },
  {
    "title": "Apple's iPhone manufacturing plan hit by Trump doubling tariffs on India",
    "description": "Apple's iPhone production shift to India has been hit by a doubling of tariffs, as President Donald Trump hammers the country for buying Russian oil.The iPhone 17 is supposed to be imported to the U.S. from India - Image Credit: AppleInsiderApple has worked h…",
    "link": "https://appleinsider.com/articles/25/08/06/apples-iphone-manufacturing-plan-hit-by-trump-doubling-tariffs-on-india",
    "timestamp": "2025-08-06T15:27:14Z"
  },
  {
    "title": "Illinois governor dispatches state police to protect Texas Dem lawmakers after bomb threat",
    "description": "Texas Democrats stashed in Illinois received a bomb threat, and the governor there is dispatching police for protection. On Wednesday morning, Gov. J.B. Pritzker (D) announced on X that he was aware of the threats made against the Texas officials and intends …",
    "link": "https://www.rawstory.com/texas-democrats-2673863451/",
    "timestamp": "2025-08-06T15:27:09Z"
  },
  {
    "title": "Scandal-Ridden Wrestling Legend Hulk Hogan Laid To Rest In Florida",
    "description": "The famous entertainer died at his Clearwater home late last month from a heart attack.",
    "link": "https://www.huffpost.com/entry/hulk-hogan-funeral_n_68936de0e4b0d3424bc47973",
    "timestamp": "2025-08-06T15:27:02Z"
  },
  {
    "title": "Trump blasts Schumer, Democrats as 'country-hating thugs' amid blockade on Senate nominees",
    "description": "Senate Republicans may change filibuster rules after Chuck Schumer and the Democrats hold up President Donald Trump's nominees with an unprecedented effort.",
    "link": "https://www.foxnews.com/politics/trump-blasts-schumer-blocking-nominees-derides-dems-country-hating-thugs",
    "timestamp": "2025-08-06T15:26:44Z"
  },
  {
    "title": "Brazilian justice eases Bolsonaro's house arrest to allow unrestricted family visits",
    "description": "Brazilian Supreme Court Justice Alexandre de Moraes has eased a key term of former President Jair Bolsonaro’s house arrest",
    "link": "https://abcnews.go.com/International/wireStory/brazilian-justice-eases-bolsonaros-house-arrest-unrestricted-family-124414493",
    "timestamp": "2025-08-06T15:26:29Z"
  },
  {
    "title": "The Internet Wants to Check Your I.D.",
    "description": "Kyle Chayka on how safety rules that require users to verify their identities before gaining access to sites could end the relative anonymity that we’ve come to expect online.",
    "link": "https://www.newyorker.com/culture/infinite-scroll/the-internet-wants-to-check-your-id",
    "timestamp": "2025-08-06T15:26:11Z"
  },
  {
    "title": "Trump hits India with additional 25% tariff: Breaking down US' latest move against New Delhi",
    "description": "U.S. President Donald Trump has imposed an additional 25% tariff on Indian goods, raising the total to 50%, citing India’s continued purchase and resale of Russian oil. India called the move unfair and politically motivated. Analysts warn of a hit to exports …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-hits-india-with-additional-25-tariff-breaking-down-us-latest-move-against-new-delhi/articleshow/123145482.cms",
    "timestamp": "2025-08-06T15:25:49Z"
  },
  {
    "title": "Apple to Announce Additional $100 Billion Pledge for US Production at White House",
    "description": "The tech giant will now be investing $600 billion in U.S. manufacturing over the next four years\nThe post Apple to Announce Additional $100 Billion Pledge for US Production at White House appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-apple-expects-additional-100-billion-pledge/",
    "timestamp": "2025-08-06T15:25:32Z"
  },
  {
    "title": "Trump Slaps India With Another 25% Tariff, Following Through on Threat for Buying Russian Oil",
    "description": "President Donald Trump has slapped an additional tariff on India over its Russian oil purchases, raising India's tariffs to 50 percent overall.\nThe post Trump Slaps India With Another 25% Tariff, Following Through on Threat for Buying Russian Oil first appear…",
    "link": "https://www.mediaite.com/media/news/trump-slaps-india-with-another-25-tariff-following-through-on-threat-for-buying-russian-oil/",
    "timestamp": "2025-08-06T15:25:31Z"
  },
  {
    "title": "America Changes Its Mind About Jeffrey Epstein's Death—Polls",
    "description": "Opinions over whether or not the New York financier killed himself have changed drastically over the past month.",
    "link": "https://www.newsweek.com/jeffrey-epstein-murder-suicide-poll-2109690",
    "timestamp": "2025-08-06T15:24:23Z"
  },
  {
    "title": "Shopify and its merchants ‘remaining resilient’ amid escalating tariff war: CFO",
    "description": "Tariffs don’t appear to be weighing on Shopify Inc. The Ottawa-based purveyor of e-commerce software reported a profit Wednesday of US$906 million in its latest quarter as its revenue grew by 31 per cent. The numbers belie the ongoing trade dispute, which pos…",
    "link": "https://financialpost.com/pmn/shopify-and-its-merchants-remaining-resilient-amid-escalating-tariff-war-cfo",
    "timestamp": "2025-08-06T15:24:21Z"
  },
  {
    "title": "What if India and China stop buying Russian oil?",
    "description": "Donald Trump is tightening sanctions loopholes that fund Moscow's war machine. What does a crackdown on Russia's oil trade mean for global markets — and economic heavyweights like China and India?",
    "link": "https://www.dw.com/en/what-if-india-and-china-stop-buying-russian-oil/a-73520311",
    "timestamp": "2025-08-06T15:23:00Z"
  },
  {
    "title": "Conservative Pundit Jabs GOP Senator for Wanting to Give Away Senate’s ‘Last Living Function’ to Trump",
    "description": "McLaughlin, however, took issue with Lee’s pushing for recess appointments. “At that point, the Senate may as well disband.”\nThe post Conservative Pundit Jabs GOP Senator for Wanting to Give Away Senate’s ‘Last Living Function’ to Trump first appeared on Medi…",
    "link": "https://www.mediaite.com/politics/conservative-pundit-jabs-gop-senator-for-wanting-to-give-away-senates-last-living-function-to-trump/",
    "timestamp": "2025-08-06T15:22:48Z"
  },
  {
    "title": "India calls additional US tariff ‘unfair, unjustified and unreasonable’, says will take actions to protect national interests",
    "description": "The statement came after Trump signed an executive order penalising India for continuing oil trade with Russia. The MEA criticised the move as “unfair, unjustified and unreasonable.”",
    "link": "https://indianexpress.com/article/india/trump-50-tariff-india-response-unfair-national-interest-10174000/",
    "timestamp": "2025-08-06T15:21:13Z"
  },
  {
    "title": "Apple will commit another $100 billion to US manufacturing, Trump set to announce",
    "description": "Apple will invest an additional $100 billion in US manufacturing, US President Donald Trump is set to announce Wednesday, the latest corporate move to placate Washington amid his tariff threats.\nThe new commitment follows Apple’s $500 billion pledge earlier t…",
    "link": "https://biztoc.com/x/ac419237e1f7c801",
    "timestamp": "2025-08-06T15:19:24Z"
  },
  {
    "title": "Tim Cook to join Trump at White House for Apple investment announcement",
    "description": "Apple CEO Tim Cook will join President Donald Trump on Wednesday for an event touting what the White House calls a new $100 billion investment commitment by the tech giant in the U.S.\nThe announcement in the Oval Office, set for 4:30 p.m. ET, includes Apple's…",
    "link": "https://biztoc.com/x/34153474d943e69b",
    "timestamp": "2025-08-06T15:19:21Z"
  },
  {
    "title": "Brazil starts WTO lawsuit against US tariffs",
    "description": "The Brazilian government started a process at the World Trade Organization (WTO) on Wednesday, challenging tariffs imposed by the United States. US President Donald Trump announced an additional 40% l...",
    "link": "https://biztoc.com/x/cdf8aae1487d1496",
    "timestamp": "2025-08-06T15:19:16Z"
  },
  {
    "title": "Trump's Immigration Plan Pushes College Students Admissions Elsewhere",
    "description": "The Trump admin has urged U.S. colleges to cut dependence on foreign enrollment while ramping up scrutiny of student visa applicants.",
    "link": "https://www.newsweek.com/trump-immigration-international-college-student-applications-admissions-2109748",
    "timestamp": "2025-08-06T15:18:23Z"
  },
  {
    "title": "In letter to Trump, alcohol groups say tariffs put $2 billion in sales at risk",
    "description": "The United States' 15% tariff on EU goods could reduce the value of alcohol sales by almost $2 billion and put 25,000 U.S. jobs at risk, a group of 57 alcohol industry groups wrote in a letter sent to President Trump on Tuesday. The letter was signed by organ…",
    "link": "https://freerepublic.com/focus/f-news/4333021/posts",
    "timestamp": "2025-08-06T15:17:46Z"
  },
  {
    "title": "Musk Pounds Another Nail Into The Tesla Sales Coffin, Taylor Swift Deepfake Edition",
    "description": "Tesla sales continue to spiral downwards as CEO Elon Musk seeks to close the EV gender gap with...\"spicy\" deepfakes generated by the new Grok Imagine tool?\nThe post Musk Pounds Another Nail Into The Tesla Sales Coffin, Taylor Swift Deepfake Edition appeared f…",
    "link": "https://cleantechnica.com/2025/08/06/musk-pounds-another-nail-into-the-tesla-sales-coffin-taylor-swift-deepfake-edition/",
    "timestamp": "2025-08-06T15:17:00Z"
  },
  {
    "title": "Barack Obama calls Texas maps undemocratic power grab",
    "description": "Former President Barack Obama entered the heated national redistricting battle this week, sharply criticizing Texas Republicans for their efforts to redraw congressional maps in ways that would add five new GOP seats. Obama characterized the Republican push a…",
    "link": "https://rollingout.com/2025/08/06/barack-obama-calls-texas-maps-power-grab/",
    "timestamp": "2025-08-06T15:16:42Z"
  },
  {
    "title": "Apple reportedly set to invest $100 billion into the production of 'critical components' in the U.S. to avoid tariffs on iPhones — domestic commitments reach $600 billion",
    "description": "Apple will reportedly invest an extra $100 billion in U.S. manufacturing —raising its total domestic commitment to $600 billion — in an effort to avoid steep iPhone tariffs.",
    "link": "https://www.tomshardware.com/tech-industry/apple-reportedly-set-to-invest-usd100-billion-into-the-production-of-critical-components-in-the-u-s-to-avoid-tariffs-on-iphones-domestic-commitments-reach-usd600-billion",
    "timestamp": "2025-08-06T15:16:39Z"
  },
  {
    "title": "CNN's Harry Enten Pushes Back Hard On Trump's Rating Lie",
    "description": "When CNBC host Joe Kernen tried to correct Donald Trump's claim that he has a 71% overall approval rating, the president insisted that he has \"the best poll numbers I've ever had.\" Even Trump's favorite pollster, Rasmeussen, doesn't show him with a 71% approv…",
    "link": "https://crooksandliars.com/2025/08/cnn-data-analyst-claps-back-after-trump",
    "timestamp": "2025-08-06T15:16:37Z"
  },
  {
    "title": "With only one nuclear arms pact left between the US and Russia, a new arms race is possible",
    "description": "The last remaining agreement expires in February.",
    "link": "https://www.bostonherald.com/2025/08/06/eu-russia-us-treaties/",
    "timestamp": "2025-08-06T15:16:06Z"
  },
  {
    "title": "Free Speech Wins: Judge Sides with Elon Musk and X, Strikes Down California Law Restricting Election Parody Videos",
    "description": "In a win for free speech, a federal judge on Tuesday struck down California's law on AI-generated election parody videos. The lawsuit was filed from Elon Musk, his X platform, the Babylon Bee, and video platform Rumble.\nThe post Free Speech Wins: Judge Sides …",
    "link": "https://www.breitbart.com/tech/2025/08/06/free-speech-wins-judge-sides-with-elon-musk-and-x-strikes-down-california-law-restricting-election-parody-videos/",
    "timestamp": "2025-08-06T15:15:59Z"
  },
  {
    "title": "Jasmine Crockett Accuses Trump of Racism on CNN in Clap-Back to New Insults",
    "description": "Rep. Jasmine Crockett accused Donald Trump of racism on CNN, telling Kaitlan Collins that his latest jabs show he \"has a problem with people of color.\"\nThe post Jasmine Crockett Accuses Trump of Racism on CNN in Clap-Back to New Insults first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/jasmine-crockett-accuses-trump-of-racism-on-cnn-in-clap-back-to-new-insults/",
    "timestamp": "2025-08-06T15:14:21Z"
  },
  {
    "title": "Tim Cook to join Trump at White House for Apple investment announcement",
    "description": "Apple CEO Tim Cook will join President Donald Trump on Wednesday for an event touting what the White House calls a new $100 billion investment commitment by the tech giant in the U.S. The announcement in the Oval Office, set for 4:30 p.m. ET, includes Apple’s…",
    "link": "https://freerepublic.com/focus/f-news/4333019/posts",
    "timestamp": "2025-08-06T15:13:50Z"
  },
  {
    "title": "Trump's ultimatum to Taiwan: 15% tariff only if TSMC buys 49% stake in Intel and invests $400 billion in US",
    "description": "Taiwan-US tariff latest updates: Taiwan is facing immense pressure from the United States in trade negotiations, with a proposed 20% tariff looming over Taiwanese exporters. To secure a more favorable 15% tariff, former President Trump demanded that TSMC acqu…",
    "link": "https://economictimes.indiatimes.com/news/international/us/taiwan-us-tariff-latest-updates-trumps-ultimatum-to-taiwan-15-tariff-only-if-tsmc-buys-49-stake-in-intel-and-invests-400-billion-in-us/articleshow/123144273.cms",
    "timestamp": "2025-08-06T15:13:39Z"
  },
  {
    "title": "Netanyahu wants to ‘occupy Gaza’, what do Israeli people, military think?",
    "description": "Netanyahu's plan for Gaza goes against domestic, international and even his own military's opinion.",
    "link": "https://www.aljazeera.com/news/2025/8/6/what-do-israelis-military-think-of-netanyahus-plan-to-occupy",
    "timestamp": "2025-08-06T15:12:23Z"
  },
  {
    "title": "How Democrats Plan to Battle the GOP’s Redistricting Power Grab",
    "description": "For years, Republicans have sought to consolidate power at the state and federal level by controlling the redistricting process through which congressional boundaries are drawn. In places such as Wisconsin and Ohio, they have crafted cartoonishly distorted di…",
    "link": "https://www.motherjones.com/politics/2025/08/how-democrats-plan-to-battle-the-gops-redistricting-power-grab-texas-gerrymandering/",
    "timestamp": "2025-08-06T15:11:53Z"
  },
  {
    "title": "Survivors of Israel’s pager attack on Hezbollah last year struggle to recover",
    "description": "The Associated Press explores the human toll of Sept. 17, 2024, when thousands of pagers distributed to the Hezbollah group blew up across Lebanon, remotely detonated by Israel. Over 10 months later, more than 3,000 wounded Lebanese are on a slow, painful pat…",
    "link": "https://www.pbs.org/newshour/world/survivors-of-israels-pager-attack-on-hezbollah-last-year-struggle-to-recover",
    "timestamp": "2025-08-06T15:11:20Z"
  },
  {
    "title": "Trump Could Derail Deal Between ESPN and the NFL",
    "description": "\"The wild card in the proposed NFL-ESPN deal is Donald Trump. The blockbuster agreement, which would give the league a multibillion-dollar equity stake in the Disney-owned company, could be delayed or blocked by the president,\"",
    "link": "https://politicalwire.com/2025/08/06/trump-could-derail-deal-between-espn-and-the-nfl/",
    "timestamp": "2025-08-06T15:10:25Z"
  },
  {
    "title": "Apple CEO Tim Cook pledges $100 billion for Trump manufacturing program",
    "description": "Apple CEO Tim Cook has reportedly pledged $100 billion from the company to the Trump Administration's new “American Manufacturing Program.\"",
    "link": "https://www.advocate.com/news/tim-cook-manufacturing-trump-investments",
    "timestamp": "2025-08-06T15:10:23Z"
  },
  {
    "title": "USA Today columnist labels Trump 'toddler' for taking a role in 2028 Olympics planning",
    "description": "Trump's LA Olympics task force drew fire from USA Today's Nancy Armour, who likened him to a toddler given a toy to stay busy and avoid causing chaos.",
    "link": "https://www.foxnews.com/sports/usa-today-columnist-labels-trump-toddler-taking-role-2028-olympics-planning",
    "timestamp": "2025-08-06T15:10:05Z"
  },
  {
    "title": "Trump will highlight Apple’s plans to invest $100 billion more in US, raising total to $600 billion",
    "description": "By JOSH BOAK, Associated Press\nWASHINGTON (AP) — President Donald Trump on Wednesday is expected to celebrate at the White House a commitment by Apple to increase its U.S. investments by an additional $100 billion over the next four years.\n“Today’s announceme…",
    "link": "https://biztoc.com/x/30dd18f47732fb3d",
    "timestamp": "2025-08-06T15:07:58Z"
  },
  {
    "title": "As Trump raises tariffs on India, Jindal Stainless seeks dumping duty to protect domestic players",
    "description": "Fresh tariff threats from Trump reignite India-US trade uncertainty, prompting Jindal Stainless to call for anti-dumping duties.",
    "link": "https://www.thehindubusinessline.com/companies/as-trumps-tariff-threats-jolt-india-us-trade-jindal-stainless-seeks-urgent-anti-dumping-support-to-protect-domestic-players/article69902060.ece",
    "timestamp": "2025-08-06T15:07:57Z"
  },
  {
    "title": "Trump to put additional 25% import taxes on India, bringing combined tariffs to 50%",
    "description": "Many American companies have seen India as an alternative to the Chinese manufacturing that Trump had hoped to diminish through the use of tariffs.",
    "link": "https://www.pbs.org/newshour/politics/trump-to-put-additional-25-import-taxes-on-india-bringing-combined-tariffs-to-50",
    "timestamp": "2025-08-06T15:07:47Z"
  },
  {
    "title": "Russia, China practice destroying 'enemy' submarine in naval drill after Trump moves US nuclear assets",
    "description": "A mock submarine was destroyed in a joint Russia-China naval drill just days President Donald Trump moved U.S. nuclear assets toward Russia, a report said.",
    "link": "https://www.foxnews.com/world/russia-china-practice-destroying-enemy-submarine-naval-drill-after-trump-moves-us-nuclear-assets",
    "timestamp": "2025-08-06T15:07:29Z"
  },
  {
    "title": "Trump to put additional 25% import taxes on India, bringing combined tariffs to 50%",
    "description": "WASHINGTON (AP) — President Donald Trump signed an executive order Wednesday to place an additional 25% tariff on India for its purchases of Russian oil, bringing the combined tariffs imposed by the United States on its ally to 50%. The tariffs would go into …",
    "link": "https://financialpost.com/pmn/trump-to-put-additional-25-import-taxes-on-india-bringing-combined-tariffs-to-50",
    "timestamp": "2025-08-06T15:07:27Z"
  },
  {
    "title": "Former Washington Post Fact-Checker Complains Outlet Wasn’t Liberal Enough",
    "description": "Glenn Kessler, who had written \"The Fact Checker\" since 2011, expressed dismay on Tuesday about the outlet becoming less left-leaning.",
    "link": "https://dailycaller.com/2025/08/06/former-washington-post-fact-checker-complains-outlet-wasnt-liberal-enough/",
    "timestamp": "2025-08-06T15:06:24Z"
  },
  {
    "title": "Citizen Lab director warns cyber industry about US authoritarian descent | TechCrunch",
    "description": "Ron Deibert, the head of the prominent digital human rights groups Citizen Lab, sounds the alarm at the Black Hat security conference about the \"dramatic descent into authoritarianism,\" but one that the cyber community can help to defend against.",
    "link": "https://techcrunch.com/2025/08/06/citizen-lab-director-warns-cyber-industry-about-us-authoritarian-descent/",
    "timestamp": "2025-08-06T15:03:50Z"
  },
  {
    "title": "Diddy 'hopeful' about a possible Trump pardon after his camp reached out to the administration, attorney says",
    "description": "President Donald Trump recently suggested in an interview that it was unlikely he'd pardon Sean \"Diddy\" Combs.",
    "link": "https://www.businessinsider.com/sean-diddy-combs-camp-contacted-trump-administration-about-possible-pardon-2025-8",
    "timestamp": "2025-08-06T15:01:09Z"
  },
  {
    "title": "College applications rise outside US as Trump cracks down on international students",
    "description": "International student applications soar in the UK and Asia as US visa hurdles rise.",
    "link": "https://nypost.com/2025/08/06/world-news/college-applications-rise-outside-us-as-trump-cracks-down-on-international-students/",
    "timestamp": "2025-08-06T15:00:59Z"
  }
]