[
  {
    "title": "Overhaul of the troubled US air traffic control system will revolutionize the industry, Trump says",
    "description": "Amid safety concerns from a spate of plane crashes and near misses, President Donald Trump said Thursday that a planned massive overhaul of the U.S. air traffic control system will revolutionize flying. Transportation Secretary Sean Duffy was expected to reve…",
    "link": "https://financialpost.com/pmn/overhaul-of-the-troubled-us-air-traffic-control-system-will-revolutionize-the-industry-trump-says",
    "timestamp": "2025-05-08T17:12:00Z"
  },
  {
    "title": "Donald Trump Reacts to New Pope",
    "description": "President Donald Trump reacted to the selection of the new pope and leader of the Catholic Church on Thursday.",
    "link": "https://www.newsweek.com/donald-trump-reacts-new-pope-2069798",
    "timestamp": "2025-05-08T17:11:54Z"
  },
  {
    "title": "Trump Exposes Own Idiocy With Comment About Looming Shortages",
    "description": "President Donald Trump said Thursday that it was “a good thing, not a bad thing” that he’d crippled the international economy, putting workers’ livelihoods in jeopardy.\r\nDuring a press briefing in the Oval Office, Trump downplayed concerns over job security s…",
    "link": "https://newrepublic.com/post/195015/donald-trump-comment-looming-supply-shortages",
    "timestamp": "2025-05-08T17:10:25Z"
  },
  {
    "title": "Trump Optimistic On China Trade Talks, Tariffs Set To Drop",
    "description": "President Donald Trump on Thursday predicted “substantive” trade negotiations between the U.S. and China this weekend, saying both sides were eager to reach an agreement. Treasury Secretary Scott Bessent and top trade negotiator Jamieson Greer will meet Chine…",
    "link": "https://biztoc.com/x/0a0cac939f484342",
    "timestamp": "2025-05-08T17:10:06Z"
  },
  {
    "title": "Fact Sheet: U.S.-UK Reach Historic Trade Deal (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nFact Sheet: U.S.-UK Reach Historic Trade Deal  —  ESTABLISHING A NEW PARADIGM FOR OUR SPECIAL RELATIONSHIP: Today, on the 80th anniversary of Victory Day for World War II, President Donald J. Trump and Prime Minist…",
    "link": "https://www.memeorandum.com/250508/p73",
    "timestamp": "2025-05-08T17:10:00Z"
  },
  {
    "title": "Trump asks US Supreme Court to allow revocation of migrants' legal status (Andrew Chung/Reuters)",
    "description": "Andrew Chung / Reuters:\nTrump asks US Supreme Court to allow revocation of migrants' legal status  —  President Donald Trump's administration asked the U.S. Supreme Court on Thursday to intervene in its bid to revoke the temporary legal status granted by his …",
    "link": "https://www.memeorandum.com/250508/p74",
    "timestamp": "2025-05-08T17:10:00Z"
  },
  {
    "title": "GOP centrists revolt against steep cuts to Medicaid and other programs in Trump’s tax breaks bill",
    "description": "It's the more centrist-leaning conservatives who could sink the bill.",
    "link": "https://www.bostonherald.com/2025/05/08/congress-tax-cuts-centrists/",
    "timestamp": "2025-05-08T17:09:58Z"
  },
  {
    "title": "Donald Trump has reduced tariffs on British metals and cars, but how important is this trade deal? Experts react",
    "description": "Being first in the queue was a political win for Keir Starmer.",
    "link": "https://theconversation.com/donald-trump-has-reduced-tariffs-on-british-metals-and-cars-but-how-important-is-this-trade-deal-experts-react-256240",
    "timestamp": "2025-05-08T17:09:48Z"
  },
  {
    "title": "Trump's tariffs have launched global trade wars. Here's a timeline of how we got here",
    "description": "Long-threatened tariffs from U.S. President Donald Trump have plunged the country into trade wars abroad — all while on-again, off-again new levies continue to escalate uncertainty",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-tariffs-launched-global-trade-wars-timeline-121605758",
    "timestamp": "2025-05-08T17:06:35Z"
  },
  {
    "title": "Joe Biden blames Kamala Harris’ loss on sexism and racism, rejects age concerns",
    "description": "Biden said he’s responsible for Donald Trump’s victory last fall.",
    "link": "https://www.bostonherald.com/2025/05/08/biden-2024-election/",
    "timestamp": "2025-05-08T17:04:47Z"
  },
  {
    "title": "US planning new thermonuclear bomb production",
    "description": "US B61-13 air-dropped thermonuclear bombs are expected to be in full production later this year Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617051-us-planning-thermonuclear-bomb-production/",
    "timestamp": "2025-05-08T17:04:16Z"
  },
  {
    "title": "India and Pakistan Claim to Shoot Down Each Other's Drones as Kashmir Clash Continues",
    "description": "The conflict between India and Pakistan continued on Thursday, with each side accusing the other of using drones to attack military targets in a major escalation of hostilities.\nThe post India and Pakistan Claim to Shoot Down Each Other’s Drones as Kashmir Cl…",
    "link": "https://www.breitbart.com/asia/2025/05/08/india-and-pakistan-claim-to-shoot-down-each-others-drones-as-kashmir-clash-continues/",
    "timestamp": "2025-05-08T17:03:00Z"
  },
  {
    "title": "Bitcoin Retakes $100,000 Amid an Easing of Global Trade Tensions",
    "description": "Bitcoin crossed the $100,000 threshold for the first time since February, fueled by expectations for an easing of global trade tensions.",
    "link": "https://financialpost.com/pmn/business-pmn/bitcoin-retakes-100000-amid-an-easing-of-global-trade-tensions",
    "timestamp": "2025-05-08T17:02:43Z"
  },
  {
    "title": "UK unveils 'historic' US trade deal at Tata Motors' Jaguar Land Rover factory",
    "description": "British Prime Minister Keir Starmer announced a historic trade deal with the US, following a similar agreement with India. The US deal, finalized after a call with President Trump, cuts car export tariffs and eliminates steel tariffs, benefiting UK carmakers,…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/uk-unveils-historic-us-trade-deal-at-tata-motors-jaguar-land-rover-factory/articleshow/121005155.cms",
    "timestamp": "2025-05-08T17:00:57Z"
  },
  {
    "title": "Walking the GOP track",
    "description": "The distressing spectacle at the University of Michigan this past week is captured well by this piece in the CHE from Silke-Maria Weineck. The short version is that five Democratic regents published an extremely restrained op-ed in the Michigan Daily, the uni…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/walking-the-gop-track",
    "timestamp": "2025-05-08T17:00:16Z"
  },
  {
    "title": "Trump Urges Republicans to Raise Taxes on the Wealthy",
    "description": "President Donald Trump privately urged Speaker Mike Johnson to raise taxes on wealthy Americans during a phone call Wednesday, Punchbowl News reports. Trump urged Johnson to raise the top tax rate and restated his interest",
    "link": "https://politicalwire.com/2025/05/08/trump-urges-republicans-to-raise-taxes-on-the-wealthy/",
    "timestamp": "2025-05-08T17:00:14Z"
  },
  {
    "title": "Ludicrously Expensive Fighter Jets Keep Mysteriously Tumbling Off of an Aircraft Carrier",
    "description": "For the third time in six months, an-uber expensive military fighter jet has fallen into the ocean off of the same Navy ship. As the Washington Post reports, a $67 million F/A-18F jet did not slow down fast enough when attempting to land on the USS Truman air…",
    "link": "https://futurism.com/the-byte/fighter-jets-red-sea-navy-warship",
    "timestamp": "2025-05-08T17:00:04Z"
  },
  {
    "title": "Europe: Tariffs on US Cars Could Come if Trade War Doesn’t End",
    "description": "The European Union (EU) is threatening to tariff American car exports if trade negotiations fail. As the Financial Times (FT) reported on Thursday (May 8), the tariffs on 95 billion euros ($107 billion) of exports, including cars and vehicle parts, would like…",
    "link": "https://www.pymnts.com/economy/2025/europe-tariffs-on-us-cars-could-come-if-trade-war-doesnt-end/",
    "timestamp": "2025-05-08T17:00:03Z"
  },
  {
    "title": "Conservative Radio Star Absolutely Destroys Trump’s ‘Sh*tty’ UK Trade Deal",
    "description": "Erick Erickson panned President Donald Trump's newly-announced trade deal with the United Kingdom on Thursday, deeming it \"shitty.\"\nThe post Conservative Radio Star Absolutely Destroys Trump’s ‘Sh*tty’ UK Trade Deal first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/conservative-radio-star-absolutely-destroys-trumps-shtty-uk-trade-deal/",
    "timestamp": "2025-05-08T17:00:02Z"
  },
  {
    "title": "Here's what we know about rumors Met Gala co-chair Anna Wintour banned Trump from attending 2025 event",
    "description": "Anna Wintour said in October 2017 that she would \"never\" invite Donald Trump back to the Met Gala.",
    "link": "https://www.snopes.com//fact-check/trump-met-gala-ban/",
    "timestamp": "2025-05-08T17:00:00Z"
  },
  {
    "title": "Congress Counters Trump Threat to Abolish FEMA with Massive Restructuring Plan",
    "description": "A bipartisan group in Congress is drafting a sweeping bill to overhaul the Federal Emergency Management Agency—in some cases, expanding its work",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/05/08/congress-counters-trump-with-massive-fema-restructuring-plan-00334634",
    "timestamp": "2025-05-08T17:00:00Z"
  },
  {
    "title": "Trump pulls his nomination for DC US attorney, says he'll reveal new pick soon",
    "description": "Trump nominated Ed Martin, a former defense attorney who represented Americans charged in the Jan. 6 riot at the Capitol, for the role in January.",
    "link": "https://www.foxnews.com/politics/trump-pulls-his-nomination-dc-us-attorney-says-hell-reveal-new-pick-soon",
    "timestamp": "2025-05-08T16:59:27Z"
  },
  {
    "title": "Joe Biden’s ‘The View’ Interview Was a Botched Attempt to Restore His Legacy",
    "description": "“It is very difficult to process how much has happened since Joe Biden was last at this table,” Whoopi Goldberg said at the start of Thursday’s episode of “The View.”  That’s an understatement. Biden last went on the show in September 2024, during the heat of…",
    "link": "https://variety.com/2025/tv/columns/joe-biden-the-view-interview-failed-legacy-1236391058/",
    "timestamp": "2025-05-08T16:58:03Z"
  },
  {
    "title": "Nick Saban Joins Donald Trump In Move To Back Up Prior Claims About ‘Unsustainable’ NIL Landscape",
    "description": "Nick Saban believes the college athletics landscape, particularly in college football, is broken. The legendary Alabama head coach believes NIL is a large reason that it is broken. He believes that someone needs to step in quickly in order to fix it, lest we …",
    "link": "https://brobible.com/sports/article/nick-saban-joins-donald-trump-nil-commission/",
    "timestamp": "2025-05-08T16:57:47Z"
  },
  {
    "title": "'Trump did this': Observers blast president over latest attempt to blame Joe Biden",
    "description": "In a Truth Social rant on Thursday, President Donald Trump blamed former President Joe Biden's administration for the air traffic issue facing the nation. Folks aren't buying it, however. As Newark airport deals with an air traffic controller crisis in New Je…",
    "link": "https://www.rawstory.com/trump-air-traffic-control-2671918982/",
    "timestamp": "2025-05-08T16:56:47Z"
  },
  {
    "title": "Joe Biden Takes Responsibility for Donald Trump's Win for First Time",
    "description": "The former president maintained he would have beaten Trump in the election, but said he accepted some blame for Trump's victory.",
    "link": "https://www.newsweek.com/joe-biden-takes-responsibility-donald-trumps-win-first-time-2069774",
    "timestamp": "2025-05-08T16:55:26Z"
  },
  {
    "title": "Trump basks in ‘end of the beginning’ of new US-UK trade arrangement",
    "description": "Framework will open UK market up to US meat products, including poultry",
    "link": "https://www.irishtimes.com/business/2025/05/08/trump-basks-in-end-of-the-beginning-of-new-us-uk-trade-arrangement/",
    "timestamp": "2025-05-08T16:55:22Z"
  },
  {
    "title": "Missouri bill ending capital gains tax heads to governor for signature",
    "description": "Missouri House Bill 594, a bill that would eliminate capital gains tax in the US state, has passed a vote in the state House of Representatives and now heads to Missouri Governor Mike Kehoe's desk for signature.According to attorney Aaron Brogan, the bill sti…",
    "link": "https://cointelegraph.com/news/missouri-could-become-first-state-eliminate-capital-gains",
    "timestamp": "2025-05-08T16:55:03Z"
  },
  {
    "title": "Trump’s ‘trade deal’ with the United Kingdom isn’t yet an actual trade deal",
    "description": "Donald Trump said he's reached a “conclusive” and “comprehensive” trade deal with the U.K. Reality suggests otherwise.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-trade-deal-united-kingdom-isnt-yet-actual-trade-deal-rcna205623",
    "timestamp": "2025-05-08T16:54:45Z"
  },
  {
    "title": "Trump Appoints Former ‘Real Housewives Of New Jersey’ Star To Holocaust Museum Board",
    "description": "The Israeli-born reality star has a connection to the Jan. 6 attack on the U.S. Capitol.",
    "link": "https://www.huffpost.com/entry/trump-appoints-former-real-housewives-of-new-jersey-star-to-holocaust-museum-board_n_681cb7d4e4b0b11c4979cb39",
    "timestamp": "2025-05-08T16:53:08Z"
  },
  {
    "title": "“Ongoing Trump tariff insecurity” to blame as high-end bike component brand Rotor shuts US office",
    "description": "The Spanish manufacturer says its North American subsidiary will close in June, thanking staff for “their professionalism in light of the difficult situation”",
    "link": "https://road.cc/content/news/rotor-shuts-us-office-and-blames-trump-tariffs-313903",
    "timestamp": "2025-05-08T16:52:16Z"
  },
  {
    "title": "Jesse Watters: I'd Like To See A Little More Retribution From Trump, Democrats Are \"Begging\" To Get Arrested",
    "description": "JESSE WATTERS, FOX NEWS CHANNEL HOST: Biden is back and he's angry.\r\n\r\nJOE BIDEN, FORMER PRESIDENT OF THE UNITED STATES OF AMERICA: What the hell is going on here?\r\n\r\nPAM BONDI, U.S. ATTORNEY GENERAL: There are tens of thousands of videos of Epstein with chil…",
    "link": "https://www.realclearpolitics.com/video/2025/05/08/jesse_watters_id_like_to_see_a_little_more_retribution_from_trump_democrats_are_begging_to_get_arrested.html",
    "timestamp": "2025-05-08T16:51:52Z"
  },
  {
    "title": "Warren Buffett’s Parting Gift To Japan Is Economic Gold",
    "description": "At least on Japan, Warren Buffett’s investment strategy seems to be of the better-late-than-never variety.",
    "link": "https://www.forbes.com/sites/williampesek/2025/05/08/warren-buffetts-parting-gift-to-japan-is-economic-gold/",
    "timestamp": "2025-05-08T16:50:58Z"
  },
  {
    "title": "House Democrat Gives Trump Stark Reminder About Presidential Duties",
    "description": "Rep. Dan Goldman (D-N.Y.) excoriated the president Wednesday for suggesting that he doesn't need to uphold the Constitution because he was elected.",
    "link": "https://www.huffpost.com/entry/dan-goldman-reminder-donald-trump-constitution_n_681ca4e8e4b0b11c4979bed8",
    "timestamp": "2025-05-08T16:50:42Z"
  },
  {
    "title": "U.S. wants to send deportees to Libya, site of migrant mass graves and brutal detention centres",
    "description": "The Donald Trump administrations plans for mass deportations now include Libya, which would represent a remarkable development given both the north African country's controversial treatment of migrants, and its fraught history with the U.S.",
    "link": "https://www.cbc.ca/news/world/us-libya-deportations-1.7529612",
    "timestamp": "2025-05-08T16:50:14Z"
  },
  {
    "title": "Transcript: Trump Erupts as Top DOJ Pick Implodes in Huge Blow to MAGA (New Republic)",
    "description": "New Republic:\nTranscript: Trump Erupts as Top DOJ Pick Implodes in Huge Blow to MAGA … Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.  I'm your host, Greg Sargent.  —  Suddenly, President Donald Trump i…",
    "link": "https://www.memeorandum.com/250508/p69",
    "timestamp": "2025-05-08T16:50:00Z"
  },
  {
    "title": "Tech Weirdos Want to Transform Guantánamo Into a ‘Freedom City’",
    "description": "The proposal would be laughable if Trump hadn't already expressed his support of so-called \"charter cities\".",
    "link": "https://gizmodo.com/tech-weirdos-want-to-transform-guantanamo-into-a-freedom-city-2000599624",
    "timestamp": "2025-05-08T16:50:00Z"
  },
  {
    "title": "Trump asks US Supreme Court to allow revocation of migrants' legal status",
    "description": "(Reuters) - President Donald Trump's administration asked the U.S. Supreme Court on Thursday to intervene in its bid to revoke the temporary legal status granted by his predecessor Joe Biden to hundreds of thousands of Venezuelan, Cuban, Haitian and Nicaragua…",
    "link": "https://www.thestar.com.my/news/world/2025/05/09/trump-asks-us-supreme-court-to-allow-revocation-of-migrants039-legal-status",
    "timestamp": "2025-05-08T16:50:00Z"
  },
  {
    "title": "DRC-Rwanda Agreement Could Prove Disastrous for African Great Lakes",
    "description": "United States President Donald Trump during a White House meeting on April 18 with Italian Prime Minister Giorgia Meloni made several comments about the detentions and deportations of migrants to a maximum-security prison in El Salvador.\nDuring his comments a…",
    "link": "https://www.globalresearch.ca/drc-rwanda-agreement-disastrous-african-great-lakes/5886384",
    "timestamp": "2025-05-08T16:49:58Z"
  },
  {
    "title": "Gold Slides as Dollar Climbs on Trump’s Trade Framework With UK",
    "description": "(Bloomberg) -- Gold slipped as the dollar extended gains after President Donald Trump announced a trade framework with the UK, sapping haven demand stemming ...",
    "link": "https://finance.yahoo.com/news/gold-extends-decline-trump-says-095309713.html",
    "timestamp": "2025-05-08T16:49:51Z"
  },
  {
    "title": "What does Netanyahu’s plan for ‘conquering’ Gaza mean for Israel, Palestine and their neighbours? Expert Q&A",
    "description": "Israel has announced that it intends to further\nintensify military operations and indefinitely occupy Gaza.",
    "link": "https://theconversation.com/what-does-netanyahus-plan-for-conquering-gaza-mean-for-israel-palestine-and-their-neighbours-expert-qanda-256150",
    "timestamp": "2025-05-08T16:49:16Z"
  },
  {
    "title": "Woman Suing Taylor Swift Is Using Police To Try To Find Her",
    "description": "A Florida woman suing Taylor Swift is turning to police to help serve the singer with legal documents.",
    "link": "https://www.newsweek.com/woman-suing-taylor-swift-using-police-try-find-her-2069754",
    "timestamp": "2025-05-08T16:49:14Z"
  },
  {
    "title": "How India and Pakistan Can Pull Back From the Brink",
    "description": "Exaggerated claims of military success—amplified by the two countries’ media—could help each side save face.",
    "link": "http://foreignpolicy.com/2025/05/08/india-pakistan-kashmir-military-war-media/",
    "timestamp": "2025-05-08T16:49:12Z"
  },
  {
    "title": "Treasuries Slide as Trump Pushes Investors Toward Riskier Assets",
    "description": "(Bloomberg) -- US Treasuries sank as President Donald Trump a rally in the stock market and unveiled a trade framework with the UK.Most Read from BloombergIs...",
    "link": "https://finance.yahoo.com/news/us-treasury-yields-rise-fed-133419709.html",
    "timestamp": "2025-05-08T16:46:11Z"
  },
  {
    "title": "Catholic cardinals elect new pope, white smoke billows from Sistine Chapel | Honolulu Star-Advertiser",
    "description": "VATICAN CITY >> Cardinal Robert Prevost, a little-known missionary from Chicago, was elected in a surprise choice to be the new leader of the Catholic Church today, becoming the first U.S. pope and taking the name Leo XIV.",
    "link": "https://www.staradvertiser.com/2025/05/08/breaking-news/catholic-cardinals-elect-new-pope-white-smoke-billows-from-sistine-chapel/",
    "timestamp": "2025-05-08T16:45:02Z"
  },
  {
    "title": "US removes tariffs on UK steel and aluminium, and cuts car rate to 10%, as Trump and Starmer unveil deal (Anthony Zurcher/BBC)",
    "description": "Anthony Zurcher / BBC:\nUS removes tariffs on UK steel and aluminium, and cuts car rate to 10%, as Trump and Starmer unveil deal  —  Starmer and Trump Announce Tariff Deal  —  Summary  — Donald Trump removes the 25% tariff on UK steel and aluminium, and immedi…",
    "link": "https://www.memeorandum.com/250508/p65",
    "timestamp": "2025-05-08T16:45:01Z"
  },
  {
    "title": "‘The View’: Joe Biden “Wasn’t Surprised” That Kamala Harris Lost To Trump, Says He Would’ve Won If He Stayed In The Race",
    "description": "\"They went the sexist route.\"",
    "link": "https://decider.com/2025/05/08/the-view-joe-biden-wasnt-surprised-kamala-harris-lost-trump-says-he-wouldve-won-stayed-race/",
    "timestamp": "2025-05-08T16:44:12Z"
  },
  {
    "title": "Trump operation against Houthis cost more than $1 billion",
    "description": "President Donald Trump’s fight against the Houthis never dealt a crippling blow to the militant group, but it has cost America more than $1 billion since March.",
    "link": "https://www.nbcnews.com/politics/national-security/trump-operation-houthis-cost-1-billion-rcna205333",
    "timestamp": "2025-05-08T16:43:48Z"
  },
  {
    "title": "Trump's tariffs have launched global trade wars. Here's a timeline of how we got here",
    "description": "Long-threatened tariffs from U.S. President Donald Trump have plunged the country into trade wars abroad — all while on-again, off-again new levies continue ...",
    "link": "https://www.yahoo.com/news/trumps-tariffs-launched-global-trade-164330325.html",
    "timestamp": "2025-05-08T16:43:30Z"
  },
  {
    "title": "What is in the UK-US tariff deal?",
    "description": "The two nations have announced a deal to reduce tariffs - here's what you need to know.",
    "link": "https://www.bbc.com/news/articles/c15ng4g5g0eo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-08T16:42:18Z"
  },
  {
    "title": "Trump Pulls Nomination For Ed Martin As Top Federal Prosecutor Post",
    "description": "Senate Republicans came out against Ed Martin, who has held the post as U.S. Prosecutor on an interim basis while advancing his nomination.",
    "link": "https://www.newsweek.com/trump-pulls-nomination-ed-martin-top-federal-prosecutor-post-2069775",
    "timestamp": "2025-05-08T16:42:03Z"
  },
  {
    "title": "Donald Trump announces a comprehensive trade deal with Britain; here is the total breakdown, how will both the nations benefit?",
    "description": "Donald Trump UK trade deal headlines global news as the U.S. and Britain seal a major post-Brexit economic pact on VE Day. The deal slashes tariffs on UK car and steel exports, opens UK doors to U.S. beef and ethanol, and boosts tech ties in AI, 5G, and aeros…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-announces-a-comprehensive-trade-deal-with-britain-here-is-the-total-breakdown-how-will-both-the-nations-benefit/articleshow/121004593.cms",
    "timestamp": "2025-05-08T16:41:19Z"
  },
  {
    "title": "Trump says he will replace D.C. U.S. attorney pick Ed Martin",
    "description": "President Donald Trump said Thursday that he will replace interim U.S. attorney Ed Martin, his embattled nominee to serve as the top prosecutor for D.C., after 15 tumultuous weeks in office marked by his threats to investigate Trump’s perceived political adve…",
    "link": "https://freerepublic.com/focus/f-chat/4315761/posts",
    "timestamp": "2025-05-08T16:41:11Z"
  },
  {
    "title": "NASA May Accelerate Mars Mission Timeline Following Trump Budget Proposal",
    "description": "The agency's shift of focus could mean turning to SpaceX's Starship for a mission to Mars in 2026.",
    "link": "https://gizmodo.com/nasa-may-accelerate-mars-mission-timeline-following-trump-budget-proposal-2000599643",
    "timestamp": "2025-05-08T16:40:42Z"
  },
  {
    "title": "Biden blames Kamala Harris' loss on sexism and racism, rejects age concerns...",
    "description": "Former President Joe Biden says he's responsible for Donald Trump's victory last fall, but he attributed Kamala Harris ' loss, at least in part, to sexism...",
    "link": "https://www.yahoo.com/news/joe-biden-blames-kamala-harris-162426795.html",
    "timestamp": "2025-05-08T16:40:36Z"
  },
  {
    "title": "Francis appointed 108 of 133 cardinals voting for his successor...",
    "description": "Francis appointed 108 of 133 cardinals voting for his successor...\r\n\n \n \n \n (Top headline, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:THERE IS A NEW POPE... DEVELOPING...\r\n267th... MORE...\r\nLIVE...",
    "link": "https://www.yahoo.com/news/latest-cardinals-vote-vatican-second-070223482.html",
    "timestamp": "2025-05-08T16:40:36Z"
  },
  {
    "title": "Congressman: Biden’s DEI agenda NOW threatens safety of American travelers",
    "description": "Trump administration making plans to hire thousands of new air traffic controllers",
    "link": "https://www.wnd.com/2025/05/congressman-bidens-dei-agenda-now-threatens-safety-of-american-travelers/",
    "timestamp": "2025-05-08T16:40:28Z"
  },
  {
    "title": "Did Elmo Really Get Laid Off? Viral Shitpost Urges Support for PBS",
    "description": "A viral LinkedIn post suggested Elmo had been laid off from PBS's 'Sesame Street' because of public-media funding cuts from the Trump White House.",
    "link": "http://www.rollingstone.com/culture/culture-news/elmo-pbs-defunding-trump-administration-bias-1235334407/",
    "timestamp": "2025-05-08T16:40:00Z"
  },
  {
    "title": "Trump Appoints Former ‘Real Housewives’ Cast Member to Holocaust Museum Board",
    "description": "The former \"Real Housewives of New Jersey\" cast member Siggy Flicker is among several Trump supporters appointed to the US Holocaust Memorial Council.",
    "link": "https://www.artnews.com/art-news/news/trump-real-housewives-siggy-flicker-holocaust-museum-board-1234741438/",
    "timestamp": "2025-05-08T16:39:35Z"
  },
  {
    "title": "Joe Biden Reveals On ‘The View’ That He And Kamala Harris Used To “Argue Like Hell”",
    "description": "Biden defended his former VP in his first interview since leaving the White House.",
    "link": "https://decider.com/2025/05/08/joe-biden-view-kamala-harris-argue/",
    "timestamp": "2025-05-08T16:39:14Z"
  },
  {
    "title": "UK-US trade deal a Whitehall win - but PM must show public how it directly benefits them",
    "description": "In politics as in life, there can be a disconnect between what is said and what is heard.",
    "link": "https://news.sky.com/story/uk-us-trade-deal-a-whitehall-win-but-pm-must-show-public-how-it-directly-benefits-them-13363980",
    "timestamp": "2025-05-08T16:39:00Z"
  },
  {
    "title": "Bill Gates says Elon Musk is ‘killing the world’s poorest children’ with DOGE cuts to USAID",
    "description": "Gates pointed to Musk’s role in cutting funds to a hospital in Africa that helps prevent mothers with HIV from transmitting the virus to their babies.",
    "link": "https://nypost.com/2025/05/08/business/bill-gates-elon-musk-killing-the-worlds-poorest-children-with-usaid-cuts/",
    "timestamp": "2025-05-08T16:38:18Z"
  },
  {
    "title": "Trump Announces First Post-Tariff Trade Deal",
    "description": "President Donald Trump announced the United States has formed a trade agreement with the United Kingdom, the first since he imposed broad tariffs last month.",
    "link": "https://dailycaller.com/2025/05/08/trump-announces-first-post-tariff-trade-deal/",
    "timestamp": "2025-05-08T16:38:12Z"
  },
  {
    "title": "Bill Gates speeds up giving away fortune, blasts Musk",
    "description": "Microsoft co-founder Bill Gates announced Thursday an accelerated timeframe for giving away his fortune as he touted artificial intelligence as a game-changer to boost public health and save lives globally. Under a new timetable, the Gates Foundation will spe…",
    "link": "https://www.digitaljournal.com/news/bill-gates-speeds-up-giving-away-fortune-blasts-musk/article",
    "timestamp": "2025-05-08T16:37:20Z"
  },
  {
    "title": "Bill Gates speeds up giving away fortune, blasts Musk",
    "description": "Microsoft co-founder Bill Gates announced Thursday an accelerated timeframe for giving away his fortune as he touted artificial intelligence as a game-changer to boost public health and save lives globally. Under a new timetable, the Gates Foundation will spe…",
    "link": "https://www.digitaljournal.com/world/bill-gates-speeds-up-giving-away-fortune-blasts-musk/article",
    "timestamp": "2025-05-08T16:37:20Z"
  },
  {
    "title": "Bill Gates speeds up giving away fortune, blasts Musk",
    "description": "Microsoft co-founder Bill Gates announced Thursday an accelerated timeframe for giving away his fortune as he touted artificial intelligence as a game-changer to boost public health and save lives globally. Under a new timetable, the Gates Foundation will spe…",
    "link": "https://www.digitaljournal.com/business/bill-gates-speeds-up-giving-away-fortune-blasts-musk/article",
    "timestamp": "2025-05-08T16:37:20Z"
  },
  {
    "title": "‘Save public media’: Elmo says he was laid off from Sesame Street in now-deleted LinkedIn post",
    "description": "Recession indicators are popping up everywhere, and the latest one seems to have hit a popular television show neighborhood hard—Sesame Street, to be exact. Elmo, the show’s furry-red Muppet with a consistently cheerful view on life, shared that he was “laid …",
    "link": "https://www.dailydot.com/culture/elmo-linkedin-laid-off/",
    "timestamp": "2025-05-08T16:37:15Z"
  },
  {
    "title": "Trump and Starmer confirm ‘breakthrough’ US-UK trade deal",
    "description": "Announcement makes UK the first country to agree deal with US since Trump unveiled sweeping tariffs in April\nUK politics live – latest updates\nUS politics live – latest updates\nDonald Trump and Keir Starmer have announced a “breakthrough” trade deal that is e…",
    "link": "https://biztoc.com/x/58033d76db8ce6ce",
    "timestamp": "2025-05-08T16:37:13Z"
  },
  {
    "title": "House appropriators question justification for proposed CISA budget cuts",
    "description": "CISA’s $3 billion budget would see a $491 million cut from what it received in fiscal year 2025. Lawmakers on both sides of the aisle wanted more detail on the rationale.",
    "link": "https://www.nextgov.com/cybersecurity/2025/05/house-appropriators-question-justification-proposed-cisa-budget-cuts/405161/",
    "timestamp": "2025-05-08T16:37:00Z"
  },
  {
    "title": "Ed Martin Pulled From DC Prosecutor Pick, Trump Hints At Potential DOJ Role",
    "description": "President Donald Trump on Thursday announced he will withdraw his nomination of Ed Martin to serve as U.S. attorney for the District of Columbia, following growing Republican opposition over Martin’s support for January 6 defendants. \n“He is a terrific person…",
    "link": "https://biztoc.com/x/1eba6226dfeedf02",
    "timestamp": "2025-05-08T16:36:52Z"
  },
  {
    "title": "DOGE May Leave Behind Nothing But Stupidity and Chaos",
    "description": "As federal courts unravel DOGE attacks on government, federal spending continues to rise, and Congress can’t or won’t ratify Elon Musk’s raids. All that will be left is a legacy of stupidity and chaos.",
    "link": "http://nymag.com/intelligencer/article/doge-may-leave-behind-nothing-but-stupidity-and-chaos.html",
    "timestamp": "2025-05-08T16:36:18Z"
  },
  {
    "title": "Bill Gates Speeds Up Giving Away Fortune, Blasts Musk",
    "description": "Microsoft co-founder Bill Gates announced Thursday an accelerated timeframe for giving away his fortune as he touted artificial intelligence as a game-changer to boost public health and save lives globally.",
    "link": "https://www.ibtimes.com/bill-gates-speeds-giving-away-fortune-blasts-musk-3772961",
    "timestamp": "2025-05-08T16:36:09Z"
  },
  {
    "title": "Trump drops Israel normalization requirement in Saudi Nuclear talks",
    "description": "Policy shift removes Israel normalization as a prerequisite for advancing nuclear cooperation with the kingdom.",
    "link": "https://www.israelnationalnews.com/news/408059",
    "timestamp": "2025-05-08T16:36:04Z"
  },
  {
    "title": "Western firms quietly returning to Russia – Putin aide",
    "description": "A trend has emerged but there is “no publicity” around it, Kirill Dmitriev has said Read Full Article at RT.com",
    "link": "https://www.rt.com/business/617042-western-firms-quietly-returning-russia/",
    "timestamp": "2025-05-08T16:35:48Z"
  },
  {
    "title": "Bill Gates Announces He Will Shutter His Left-Wing Foundation Early",
    "description": "Liberal billionaire Bill Gates announced Thursday that he will permanently shutter the Gates Foundation, which has given money to organizations and agencies run by the Chinese Communist Party, on Dec. 31, 2045—decades earlier than planned—as the Trump adminis…",
    "link": "https://freebeacon.com/latest-news/bill-gates-announces-he-will-shutter-his-left-wing-foundation-early/",
    "timestamp": "2025-05-08T16:35:11Z"
  },
  {
    "title": "Xi stands with Putin against ‘international bullying’ amid Trump trade war",
    "description": "Putin and Xi say they 'intend' to play a role in US-Iran nuclear negotiations. Chinese President Xi Jinping and Russian President Vladimir Putin met for formal talks on Thursday for the first time since President Donald Trump exacerbated the U.S.-China trade …",
    "link": "https://freerepublic.com/focus/f-chat/4315759/posts",
    "timestamp": "2025-05-08T16:35:00Z"
  },
  {
    "title": "Bitcoin hits $101k to reclaim six-figures as Trump confirms US, UK trade deal",
    "description": "Bitcoin (BTC) reclaimed the $100,000 mark for the first time in over two months, driven by bullish market sentiment, rising institutional adoption, and renewed macroeconomic confidence after President Donald Trump announced a major trade deal with the UK on M…",
    "link": "https://cryptoslate.com/bitcoin-hits-101k-to-reclaim-six-figures-as-trump-confirms-us-uk-trade-deal/",
    "timestamp": "2025-05-08T16:32:42Z"
  },
  {
    "title": "World leaders have performed a diplomatic dance in Trump's Oval Office. Has it paid off?",
    "description": "Mark Carney became the most recent world leader to meet U.S. President Donald Trump in the Oval Office, an event that has taken on an unusual significance for political observers. Here's a look at their varying approaches to dealing with the president and wha…",
    "link": "https://www.cbc.ca/news/world/trump-world-leaders-oval-office-meetings-1.7528485",
    "timestamp": "2025-05-08T16:32:19Z"
  },
  {
    "title": "White Smoke Issuing From Sistine Chapel: How to Watch the New Pope Being Announced",
    "description": "It's not yet known which Cardinal has been chosen, or what his name will be.",
    "link": "https://www.cnet.com/tech/services-and-software/white-smoke-issuing-from-sistine-chapel-how-to-watch-the-new-pope-being-announced/",
    "timestamp": "2025-05-08T16:32:00Z"
  },
  {
    "title": "Smoke above Sistine Chapel indicates new pope has been chosen",
    "description": "Identity expected to be revealed soon",
    "link": "https://www.wnd.com/2025/05/smoke-above-sistine-chapel-indicates-new-pope-has-been-chosen/",
    "timestamp": "2025-05-08T16:31:54Z"
  },
  {
    "title": "Joe Biden reveals he 'wasn't surprised' Kamala Harris lost election",
    "description": "Former President Joe Biden appeared on 'The View' and told the cohosts he 'wasn't surprised' that Vice President Kamala Harris, whom he stepped aside to endorse, lost the election to Donald Trump.",
    "link": "https://ew.com/the-view-joe-biden-wasnt-surprised-kamala-harris-lost-election-11730743",
    "timestamp": "2025-05-08T16:30:00Z"
  },
  {
    "title": "Trump: Iran Has to Turn Over Uranium, Destroy Centrifuges or Get Blown Up",
    "description": "On Wednesday’s “Hugh Hewitt Show,” President Donald Trump discussed nuclear talks with Iran and stated that Iran has to turn over its uranium and either deactivate or destroy their centrifuges or else they will face strikes from the United States.",
    "link": "https://freerepublic.com/focus/f-chat/4315757/posts",
    "timestamp": "2025-05-08T16:29:28Z"
  },
  {
    "title": "Here’s Everything Trump Is Doing To Protect Bad Cops, Make Things Worse For Crime Victims",
    "description": "Trump was never about law and order. He cozied up to cops and praised police brutality, but when push came to literal shove, he sat back and watched his supporters attack law enforcement officers and commit federal crimes for the sole purpose of destroying de…",
    "link": "https://www.techdirt.com/2025/05/08/heres-everything-trump-is-doing-to-protect-bad-cops-make-things-worse-for-crime-victims/",
    "timestamp": "2025-05-08T16:29:12Z"
  },
  {
    "title": "Trump Renames San Francisco Bay 'Gulf Of Criminals'",
    "description": "SAN FRANCISCO, CA — As part of his ongoing crusade to change the name of each body of water in the world, President Donald Trump announced on Wednesday that the San Francisco Bay would now be known as the \"Gulf of Criminals.\" The move to rename the bay coinci…",
    "link": "https://freerepublic.com/focus/f-chat/4315756/posts",
    "timestamp": "2025-05-08T16:28:41Z"
  },
  {
    "title": "‘Father of neoliberalism’ dies aged 88",
    "description": "Joseph Nye introduced the term ‘soft power’ in international relations Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617036-nye-us-neoliberalism-dies/",
    "timestamp": "2025-05-08T16:27:58Z"
  },
  {
    "title": "Sen. Ron Wyden Seeks Answers on RFK Jr.’s Purge of FOIA Staff",
    "description": "“Citizen oversight is a cornerstone of a functioning democracy,” Oregon Sen. Ron Wyden wrote to Health and Human Services Secretary Robert F. Kennedy Jr., demanding answers to more than two dozen questions, including who was involved in decisions to fire staf…",
    "link": "https://kffhealthnews.org/news/article/foia-staff-purge-health-agencies-rfk-jr-senator-ron-wyden-oregon/",
    "timestamp": "2025-05-08T16:27:22Z"
  },
  {
    "title": "Bitcoin is back above $100,000",
    "description": "Bitcoin just went above the $100,000 mark for the first time since February, as trade talks between the United States and the United Kingdom coincided with a broad surge across sectors.Read more...",
    "link": "https://qz.com/bitcoin-cryptocurrency-trump-tariffs-trade-deal-1851779750",
    "timestamp": "2025-05-08T16:27:00Z"
  },
  {
    "title": "Trump's New Budget Is Another Blueprint for Big Spending",
    "description": "President Donald Trump's 2026 \"skinny budget\" is out, and at first glance it gives small government advocates reason to cheer. It proposes deep cuts to",
    "link": "https://reason.com/2025/05/08/trumps-new-budget-is-another-blueprint-for-big-spending/",
    "timestamp": "2025-05-08T16:26:23Z"
  },
  {
    "title": "US and UK cement ‘breakthrough deal’ on trade",
    "description": "The deal marks the first trade agreement by the US since President Donald Trump imposed a universal 10-percent tariff.",
    "link": "https://www.aljazeera.com/economy/2025/5/8/us-and-uk-cement-breakthrough-deal-on-trade",
    "timestamp": "2025-05-08T16:25:57Z"
  },
  {
    "title": "Trump’s tariffs – part 3",
    "description": "A leaked copy of Jon Voight’s plan to revitalise Hollywood has given new context to how Donald Trump came to send his hysteria-inducing post about placing 100% tariffs on movies from abroad. But, perhaps surprisingly, Voight’s draft proposals have ini",
    "link": "https://www.c21media.net/department/c21investigates/trumps-tariffs-part-3/",
    "timestamp": "2025-05-08T16:25:50Z"
  },
  {
    "title": "Should A Woman Be Forced To Carry A Dead Fetus For Weeks? South Carolina Says 'Yes!'",
    "description": "SC's 'Heartbeat Bill' forced Elisabeth Weber to carry a fetus without a heartbeat for several weeks.",
    "link": "https://www.wonkette.com/p/should-a-woman-be-forced-to-carry",
    "timestamp": "2025-05-08T16:25:49Z"
  },
  {
    "title": "Donald Trump's Most Favorable Poll Notes Collapse in Approval Rating",
    "description": "The percentage of those who disapprove of the president has declined, according to Big Data Poll.",
    "link": "https://www.newsweek.com/donald-trump-poll-approval-rating-2069552",
    "timestamp": "2025-05-08T16:25:31Z"
  },
  {
    "title": "‘Les Miserables’ Actors to Boycott Kennedy Center Performance Over Trump’s Attendance",
    "description": "At least 10 Les Miserables cast members are expected to boycott a June 11 performance of the musical at the Kennedy Center, which President Donald Trump is planning to attend. Following the controversies at the once-prestigious Washington, D.C. performing art…",
    "link": "https://freerepublic.com/focus/f-chat/4315755/posts",
    "timestamp": "2025-05-08T16:25:29Z"
  },
  {
    "title": "Cardinals pick new pope as white smoke seen at Vatican",
    "description": "A huge crowd in St. Peter's Square awaited the announcement of the name of the new Roman Catholic pope.",
    "link": "https://www.cnbc.com/2025/05/08/new-pope-white-smoke-vatican.html",
    "timestamp": "2025-05-08T16:24:48Z"
  }
]