[
  {
    "title": "One big takeaway from Trump’s SOTU, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: President Donald Trump gave a very long State of the U…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/480562/donald-trump-state-of-union-speech-save-act-voting",
    "timestamp": "2026-02-25T22:58:06Z"
  },
  {
    "title": "Donald Trump’s 108-minute State of Unreality",
    "description": "Donald Trump's State of the Union address wasn’t so much a verdict on the state of the nation as it was a reflection of the state of its narrator: unapologetically optimistic, often at odds with verifiable data, and impervious to contradiction.\nThe post Donal…",
    "link": "http://www.crikey.com.au/2026/02/26/donald-trump-state-of-the-union-address-facts-lies/",
    "timestamp": "2026-02-25T22:57:37Z"
  },
  {
    "title": "Will Mexico’s Jalisco cartel’s violent biz model survive El Mencho’s death?",
    "description": "El Mencho consolidated Mexico’s most powerful criminal organisations in part due to a unique franchise-based structure.",
    "link": "https://www.aljazeera.com/economy/2026/2/25/will-mexicos-jalisco-cartels-violent-biz-model-survive-el-menchos-death",
    "timestamp": "2026-02-25T22:57:27Z"
  },
  {
    "title": "Hilary Knight says Trump’s ‘distasteful joke' overshadowing women’s hockey gold",
    "description": "Olympian Hilary Knight responded to President Trump's comments about the women's hockey team during a leaked call.",
    "link": "https://www.usatoday.com/story/sports/olympics/2026/02/25/hilary-knight-donald-trump-womens-hockey-team-distasteful-joke/88867246007/",
    "timestamp": "2026-02-25T22:56:14Z"
  },
  {
    "title": "Minnesota remains frontline in Vance's 'war on fraud' as Walz given 60 days 'to clean up the systems'",
    "description": "Vice President JD Vance announces temporary halt of Minnesota Medicaid payments following alleged $19 billion fraud scandal. Mehmet Oz says largest fraud enforcement ever taken.",
    "link": "https://www.foxnews.com/politics/minnesota-remains-frontline-vances-war-fraud-walz-given-60-days-to-clean-up-systems",
    "timestamp": "2026-02-25T22:55:45Z"
  },
  {
    "title": "Watch: Tom Homan Rebukes Pope Leo, 'Doesn't Understand... Illegal Migration'",
    "description": "Border chief Tom Homan rebuked Pope Leo XIV for failing to understand that President Donald Trump's border policies are saving the lives of thousands of migrants each year. \nThe post Watch: Tom Homan Rebukes Pope Leo, ‘Doesn’t Understand… Illegal Migration’ a…",
    "link": "https://www.breitbart.com/immigration/2026/02/25/watch-tom-homan-rebukes-pope-leo-doesnt-understand-illegal-migration/",
    "timestamp": "2026-02-25T22:54:03Z"
  },
  {
    "title": "BREAKING: Vance, Oz to withhold Medicaid funds from Minnesota in 'war on fraud'",
    "description": "Vice President JD Vance announced that the Trump administration will temporarily halt certain Medicaid funding to Minnesota as part of its effort to combat rampant fraud in the state. \"We're announcing today that we have decided to temporarily halt certain am…",
    "link": "https://freerepublic.com/focus/f-bloggers/4368301/posts",
    "timestamp": "2026-02-25T22:50:32Z"
  },
  {
    "title": "Ann Coulter Mocked for Anti-Immigrant Post About Becoming President — Which Unwittingly Jabbed Trump",
    "description": "Ann Coulter's tweet arguing in favor of restricting the presidency to those who had been U.S. citizens for multiple generations drew spirited mockery.\nThe post Ann Coulter Mocked for Anti-Immigrant Post About Becoming President — Which Unwittingly Jabbed Trum…",
    "link": "https://www.mediaite.com/online/ann-coulter-mocked-for-anti-immigrant-post-about-becoming-president-which-unwittingly-jabbed-trump/",
    "timestamp": "2026-02-25T22:49:09Z"
  },
  {
    "title": "Zelenskyy speaks with Trump about peace efforts, eyes leaders-level talks",
    "description": "Conversation precedes meeting between US and Ukrainian envoys in Geneva on Thursday.",
    "link": "https://www.aljazeera.com/news/2026/2/25/zelenskyy-speaks-with-trump-about-peace-efforts-eyes-leaders-level-talks",
    "timestamp": "2026-02-25T22:47:39Z"
  },
  {
    "title": "Trump says Muslim lawmakers Omar, Tlaib should be removed from US after speech clash",
    "description": "By Kanishka Singh WASHINGTON, Feb 25 (Reuters) - President Donald Trump said Wednesday that two Muslim Democratic U.S.",
    "link": "https://www.yahoo.com/news/articles/trump-says-muslim-lawmakers-omar-224638780.html",
    "timestamp": "2026-02-25T22:46:38Z"
  },
  {
    "title": "House Republicans Strike Down Ted Cruz's Aviation Safety Bill To Prevent The Next Potomac Crash",
    "description": "The whole ordeal is a showcase of how hard it is to pass meaningful legislation even in the face of catastrophe.",
    "link": "https://www.jalopnik.com/2110309/house-republicans-strike-down-ted-cruz-aviation-safety-bill/",
    "timestamp": "2026-02-25T22:45:16Z"
  },
  {
    "title": "Fox News Sports Huddle Newsletter: Historic hockey gold caps US Olympic triumph, Eileen Gu picks China's flag",
    "description": "Receive your weekly recap of all the happenings around the world of sports.",
    "link": "https://www.foxnews.com/sports/fox-news-sports-huddle-newsletter-historic-hockey-gold-caps-us-olympic-triumph-eileen-gu-picks-chinas-flag",
    "timestamp": "2026-02-25T22:44:05Z"
  },
  {
    "title": "DHS Elections Official Says ICE Won’t Be At The Polls — But Take It With A Grain Of Salt",
    "description": "“I realized it was her and so I knew I couldn’t believe it,” said Arizona’s Secretary of State Adrien Fontes, who was on the call.",
    "link": "https://www.huffpost.com/entry/dhs-ice-midterm-election_n_699f7153e4b0ef1afcc098e7",
    "timestamp": "2026-02-25T22:44:02Z"
  },
  {
    "title": "The U.S. Supreme Court’s tariff ruling shows American checks and balances are still at work",
    "description": "Equating controversial or legally contested executive actions with the collapse of 250 years of constitutional democracy risks conflating the overreach of a singular president.",
    "link": "https://theconversation.com/the-u-s-supreme-courts-tariff-ruling-shows-american-checks-and-balances-are-still-at-work-276602",
    "timestamp": "2026-02-25T22:42:28Z"
  },
  {
    "title": "WATCH: Vance says administration is pausing some Medicaid funding to Minnesota over fraud concerns",
    "description": "Vice President JD Vance said the administration was taking the action \"in order to ensure that the state of Minnesota takes its obligations seriously to be good stewards of the American people's tax money.\"",
    "link": "https://www.pbs.org/newshour/politics/watch-vance-says-administration-is-pausing-some-medicaid-funding-to-minnesota-over-fraud-concerns",
    "timestamp": "2026-02-25T22:40:51Z"
  },
  {
    "title": "Democrats investigating whether U.S. DOJ withheld Epstein documents about abuse accusation against Trump",
    "description": "Democratic lawmakers on the House oversight and government reform committee promised on Tuesday to investigate allegations that the U.S. Department of Justice (DOJ) withheld material about an accusation against U.S. President Donald Trump from the Epstein fil…",
    "link": "https://www.cbc.ca/news/world/doj-epstein-trump-abuse-9.7105923",
    "timestamp": "2026-02-25T22:40:00Z"
  },
  {
    "title": "“Deranged”: Trump calls Omar, Tlaib “lunatics” with “bulging, bloodshot eyes”",
    "description": "The president said the progressive pair had the \"bulging eyes of crazy people\" during his State of the Union speech",
    "link": "https://www.salon.com/2026/02/25/deranged-trump-calls-omar-tlaib-lunatics-with-bulging-bloodshot-eyes/",
    "timestamp": "2026-02-25T22:38:04Z"
  },
  {
    "title": "Rep. Mike Levin responds to State of the Union speech",
    "description": "We hear reaction from local Congressmember Mike Levin following President Donald Trump's State of the Union address.",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/rep-mike-levin-responds-to-state-of-the-union-speech",
    "timestamp": "2026-02-25T22:36:00Z"
  },
  {
    "title": "White House seeks clean extension on controversial spying law",
    "description": "Despite Donald Trump’s previous misgivings, his administration is signaling confidence in the statute with its current stance.",
    "link": "https://www.nextgov.com/policy/2026/02/white-house-seeks-clean-extension-controversial-spying-law/411701/",
    "timestamp": "2026-02-25T22:36:00Z"
  },
  {
    "title": "College profs are so liberal students have to pretend to be, too  — viewpoint diversity in crisis",
    "description": "Advocating for diverse viewpoints on campuses is now apparently akin to saying “All Lives Matter,” or pushing a sinister MAGA plot.",
    "link": "https://nypost.com/2026/02/25/opinion/college-profs-are-so-liberal-students-have-to-pretend-to-be-too-viewpoint-diversity-in-crisis/",
    "timestamp": "2026-02-25T22:35:17Z"
  },
  {
    "title": "Democrats are spoiling for a fight in Texas: From the Politics Desk",
    "description": "This is the online version of From the Politics Desk, a daily newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail",
    "link": "https://www.nbcnews.com/politics/politics-news/democrats-are-spoiling-fight-texas-politics-desk-rcna260699",
    "timestamp": "2026-02-25T22:34:10Z"
  },
  {
    "title": "Vance: US has evidence Iran is rebuilding nuclear program",
    "description": "Vice President JD Vance says the US has evidence Iran is attempting to rebuild its nuclear program, stresses Trump prefers diplomacy but retains other options.",
    "link": "https://www.israelnationalnews.com/news/422996",
    "timestamp": "2026-02-25T22:33:14Z"
  },
  {
    "title": "Bill and Hillary Clinton, battle-tested, gear up for another Washington fight",
    "description": "Bill and Hillary Clinton are slated to testify this week in a House investigation into Jeffrey Epstein, part of a deal with Republicans after it became clear that Congress — with the help of some Democrats — was on track to hold them in contempt if the...",
    "link": "https://abcnews.com/Politics/wireStory/bill-hillary-clinton-battle-tested-gear-washington-fight-130506244",
    "timestamp": "2026-02-25T22:31:11Z"
  },
  {
    "title": "Lawmakers from both parties back data center permitting reform",
    "description": "Sen. Ted Budd, R-N.C., estimates the U.S. will need “about 85 gigawatts [more] a year in order to keep pace with our demand.”",
    "link": "https://www.nextgov.com/artificial-intelligence/2026/02/lawmakers-both-parties-back-data-center-permitting-reform/411700/",
    "timestamp": "2026-02-25T22:29:00Z"
  },
  {
    "title": "US women’s hockey star Hilary Knight calls Trump’s White House visit quip a ‘distasteful joke’",
    "description": "Hilary Knight wasn’t a fan of president Donald Trump’s “distasteful joke” about the United States women's hockey team.",
    "link": "https://nypost.com/2026/02/25/sports/us-womens-hockey-star-hilary-knight-calls-trumps-quip-a-distasteful-joke/",
    "timestamp": "2026-02-25T22:28:27Z"
  },
  {
    "title": "New Book Details How Tucker Carlson’s Show Once Acted as ‘Effectively a Senior Adviser’ to Trump",
    "description": "Tucker Carlson's Fox News show was \"effectively a senior adviser\" to President Donald Trump during his first term, according to a new book from Jason Zengerle\nThe post New Book Details How Tucker Carlson’s Show Once Acted as ‘Effectively a Senior Adviser’ to …",
    "link": "https://www.mediaite.com/media/new-book-details-how-tucker-carlsons-show-once-acted-as-effectively-a-senior-adviser-to-trump/",
    "timestamp": "2026-02-25T22:27:10Z"
  },
  {
    "title": "Hilary Knight calls out Donald Trump over 'distasteful joke' made about U.S. women's hockey team",
    "description": "Knight addressed Trump's comments during an appearance on SportsCenter.",
    "link": "https://www.sportingnews.com/us/olympics/news/hilary-knight-donald-trump-distasteful-joke-womens-hockey/a328a9be1fd4de072c542258",
    "timestamp": "2026-02-25T22:25:31Z"
  },
  {
    "title": "FBI subpoenaed Kash Patel and Susie Wiles phone records in federal Trump investigation",
    "description": "Special Counsel Jack Smith's investigation into Donald Trump included FBI subpoenas of Kash Patel and Susie Wiles' phone records when both were private citizens.",
    "link": "https://www.foxnews.com/politics/fbi-subpoenaed-kash-patel-susie-wiles-phone-records-federal-trump-investigation",
    "timestamp": "2026-02-25T22:24:53Z"
  },
  {
    "title": "CNN Host Asks John Fetterman If He Would Become Republican, Accept Trump’s Endorsement",
    "description": "Democratic Sen. John Fetterman of Pennsylvania told CNN host Kasie Hunt his record was “solid Democrat” when asked if he would consider a party switch.",
    "link": "https://dailycaller.com/2026/02/25/cnn-host-asks-john-fetterman-if-he-would-become-republican-accept-trumps-endorsement/",
    "timestamp": "2026-02-25T22:24:26Z"
  },
  {
    "title": "WATCH: Markey asks Dr. Means if Trump's order promoting glyphosate production puts health at risk",
    "description": "President Donald Trump's nominee for surgeon general, Dr. Casey Means, faced questions on Wednesday about the president's recent executive order promoting more domestic production of the glyphosate, an ingredient in weedkiller, and how that might conflict wit…",
    "link": "https://www.pbs.org/newshour/politics/watch-markey-asks-dr-means-if-trumps-order-promoting-glyphosate-production-puts-health-at-risk",
    "timestamp": "2026-02-25T22:22:04Z"
  },
  {
    "title": "Fewer Bigger Deals for Fashion? Experts Say, Maybe",
    "description": "Last year saw a smaller number of bigger deals in the consumer space, a trend that could continue this year.",
    "link": "http://wwd.com/business-news/financial/fashion-ma-deals-2025-experts-weigh-in-1238627886/",
    "timestamp": "2026-02-25T22:21:40Z"
  },
  {
    "title": "5-Year-Old’s Near-Death Experience Moves Congress to Stop Illegals from Truck Driving",
    "description": "Congressional Republicans are pushing to prevent illegal immigrants from obtaining Commercial Driver’s Licenses in the wake of President Donald Trump acknowledging five-year-old Dalilah Coleman during... Read More\nThe post 5-Year-Old’s Near-Death Experience M…",
    "link": "https://www.dailysignal.com/2026/02/25/5-year-olds-near-death-experience-moves-congress-to-stop-illegals-from-truck-driving/",
    "timestamp": "2026-02-25T22:20:42Z"
  },
  {
    "title": "Venezuela Announces 'Transformation' of Helicoide Torture Complex into a 'Social Center'",
    "description": "Venezuela's socialist regime this week announced the start of a construction project to \"transform\" the Helicoide (\"The Helix\"), its largest and most infamous torture complex, into a \"cultural center.\"\nThe post Venezuela Announces ‘Transformation’ of Helicoid…",
    "link": "https://www.breitbart.com/latin-america/2026/02/25/venezuelan-socialists-announce-transformation-of-infamous-torture-center-into-a-social-center/",
    "timestamp": "2026-02-25T22:18:27Z"
  },
  {
    "title": "Trump's Surgeon General Nominee Dodges Senators' Questions on Vaccines, Conflicts of Interest",
    "description": "The US Senate's confirmation hearing for Casey Means, President Donald Trump's nominee to be the next US surgeon general, showcased \"just how profoundly unqualified\" the wellness influencer is to serve as the nation's top doctor, said one consumer advocate af…",
    "link": "https://www.commondreams.org/news/casey-means-surgeon-general-hearing",
    "timestamp": "2026-02-25T22:17:56Z"
  },
  {
    "title": "The Iranian proposal the US will find difficult to accept",
    "description": "An Arab diplomat who has reviewed key clauses in the draft Iranian proposal claims that Tehran is prepared to reduce its uranium enrichment level from 60% to below 4%.",
    "link": "https://www.israelnationalnews.com/news/422995",
    "timestamp": "2026-02-25T22:16:35Z"
  },
  {
    "title": "Donald Trump Lashes Out at Robert De Niro for Telling Americans to ‘Resist’ the President: ‘A Sick and Demented Person With an Extremely Low IQ’",
    "description": "Donald Trump lashed out at Robert De Niro in a Truth Social rant amid their ongoing public feud. The president slammed the Oscar-winning actor as “a sick and demented person” after De Niro fought back tears in a recent interview on “The Best People With Nicol…",
    "link": "https://variety.com/2026/film/news/donald-trump-robert-de-niro-sick-demented-person-1236672982/",
    "timestamp": "2026-02-25T22:15:14Z"
  },
  {
    "title": "Trump’s State of the Union speech made no mention of Make America Healthy Again",
    "description": "On Tuesday the U.S. president largely steered clear of his administration’s health care agenda amid a broader push to downplay antivaccine efforts ahead of upcoming midterm elections",
    "link": "https://www.scientificamerican.com/article/trumps-state-of-the-union-speech-made-no-mention-of-make-america-healthy/",
    "timestamp": "2026-02-25T22:15:00Z"
  },
  {
    "title": "Chuck Schumer leads New York Democrats’ bill to protect Pride flags at Stonewall & national park sites",
    "description": "Democratic lawmakers introduced legislation Wednesday to protect the Pride flag at national park sites, including New York City's Stonewall National Monument, after the Trump administration previously ordered the flag removed from the historic LGBTQ+ landmark.",
    "link": "https://www.advocate.com/politics/national/schumer-democrats-pride-flag-bill",
    "timestamp": "2026-02-25T22:12:44Z"
  },
  {
    "title": "DOJ now 'reviewing' tranche of Epstein records that mysteriously vanished",
    "description": "The Department of Justice on Wednesday responded to the missing FBI reports related to a woman who claimed she was sexually assaulted when she was a minor by both late financier and child sex offender Jeffrey Epstein and President Donald Trump in the 1980s. T…",
    "link": "https://www.rawstory.com/doj-reviewing-missing-epstein-documents/",
    "timestamp": "2026-02-25T22:12:37Z"
  },
  {
    "title": "Four People on a Florida Speedboat Killed in Shootout With Cuban Troops",
    "description": "This is a developing story… Please check back for updates… In a deadly development that could further strain relations between Havana and Washington DC, Cuba's Ministry of the Interior announced Wednesday afternoon that four people on a Florida-registered spe…",
    "link": "https://www.commondreams.org/news/trump-cuba",
    "timestamp": "2026-02-25T22:10:36Z"
  },
  {
    "title": "Communist Regime Kills Four On US Boat Amid Shootout, Officials Say",
    "description": "Cuban border guards killed 4 people on a Florida registered speedboat early this morning, alleging the occupants opened fired on the guards.",
    "link": "https://dailycaller.com/2026/02/25/cuba-border-guards-boat-shoutout/",
    "timestamp": "2026-02-25T22:08:08Z"
  },
  {
    "title": "Trump calls for ‘deranged’ Rashida Tlaib and Ilhan Omar to be ‘institutionalized’ after State of the Union",
    "description": "President Donald Trump unleashed on Reps. Ilhan Omar (D-MN) and Rashida Tlaib (D-MI), after they heckled him in his State of the Union address, saying they should be institutionalized or deported. Omar and Tlaib were two of the most outspoken members of the a…",
    "link": "https://freerepublic.com/focus/f-chat/4368295/posts",
    "timestamp": "2026-02-25T22:07:43Z"
  },
  {
    "title": "BBC orders probe into ‘serious mistake’ over Bafta racial slur",
    "description": "There was a two-hour delay between filming and the television broadcast.",
    "link": "https://www.nzherald.co.nz/entertainment/bbc-orders-probe-into-serious-mistake-over-bafta-racial-slur/U5HSH4BV3FCN7EPV2JLWTIRXBQ/",
    "timestamp": "2026-02-25T22:04:07Z"
  },
  {
    "title": "EXCLUSIVE: ICE Urges Authorities Not To Free Cuban Illegal Charged With Sodomizing Mother",
    "description": "U.S. Immigration and Customs Enforcement is urging local Kentucky law enforcement not to release an illegal immigrant charged with sexual assault after placing a detainer on him, the Daily Caller News Foundation first learned. On Feb. 5, Yordan Basilio Diaz V…",
    "link": "https://dailycaller.com/2026/02/25/exclusive-ice-urges-authorities-not-to-free-cuban-illegal-charged-with-sodomizing-mother/",
    "timestamp": "2026-02-25T22:03:28Z"
  },
  {
    "title": "Trump administration pauses some Medicaid funding to Minnesota",
    "description": "Vice President JD Vance announced Wednesday that the Trump administration would “temporarily halt” some Medicaid funding to the state of Minnesota over fraud concerns, as part of what he described as an aggressive crackdown on misuse of public funds. Vance, w…",
    "link": "https://apnews.com/article/minnesota-medicaid-funding-fraud-trump-47b160fd664cdfeef355ae00ca5fecc0",
    "timestamp": "2026-02-25T22:02:21Z"
  },
  {
    "title": "Erika Kirk Goes Viral After People Notice What She Mouthed At State Of The Union",
    "description": "Erika Kirk’s three-word reaction to Donald Trump’s State of the Union tribute to Charlie has sparked emotional and critical reactions online.",
    "link": "https://www.boredpanda.com/erika-kirk-viral-people-notice-what-she-mouthed-trump-mention-state-of-the-union/",
    "timestamp": "2026-02-25T22:01:45Z"
  },
  {
    "title": "Jeremy Swayman admits U.S. men's hockey team 'should've reacted differently' to controversial moment of Trump call",
    "description": "The Boston Bruins' standout goalie emphasized that he and his teammates have \"so much respect\" for the gold medal-winning U.S. women's team.",
    "link": "https://sports.yahoo.com/olympics/article/jeremy-swayman-admits-us-mens-hockey-team-shouldve-reacted-differently-to-controversial-moment-of-trump-call-220104044.html",
    "timestamp": "2026-02-25T22:01:04Z"
  },
  {
    "title": "US hockey star Hilary Knight responds to Trump’s ‘distasteful joke’ about women’s team",
    "description": "Hilary Knight, the captain of the US women’s ice hockey team, has responded to comments made by Donald Trump after the Americans won gold at the Winter Olympics, calling the president’s quip a “distasteful joke”. After the US men’s ice hockey team won gold on…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_8b7d23e0-7ac3-4a84-86a7-73c3c3a9bee9",
    "timestamp": "2026-02-25T22:00:29Z"
  },
  {
    "title": "‘It’s all fool’s gold’: Team USA hockey State of the Union invite sparks feminist outrage",
    "description": "President Donald Trump made waves when he invited the U.S. men’s Olympic hockey team to his State of the Union address after the men struck gold at the Milan Cortina Olympics this Sunday.But it’s not just Trump’s invitation that has the left up in arms.FBI Di…",
    "link": "https://www.theblaze.com/shows/fearless-with-jason-whitlock/its-all-fools-gold-team-usa-hockey-sotu-invite-sparks-feminist-outrage",
    "timestamp": "2026-02-25T22:00:00Z"
  },
  {
    "title": "Southeast Asia caught between relief and new risks after US court strikes down Trump tariffs",
    "description": "Southeast Asian countries could benefit from a temporary lowering of tariffs, but analysts warn there are other means United States President Donald Trump can use to keep his trade agenda alive.",
    "link": "https://www.channelnewsasia.com/asia/southeast-asia-tariff-trump-us-supreme-court-5952201",
    "timestamp": "2026-02-25T22:00:00Z"
  },
  {
    "title": "Rubio Meets With Caribbean Leaders to Discuss U.S. Policy",
    "description": "Many regional leaders worry that the U.S. oil embargo on Cuba will have spillover consequences.",
    "link": "http://foreignpolicy.com/2026/02/25/caribbean-caricom-rubio-cuba-oil-trump-donroe-doctrine/",
    "timestamp": "2026-02-25T21:59:41Z"
  },
  {
    "title": "Rubio Joins Caribbean Summit to Discuss Donroe Doctrine",
    "description": "Many regional leaders worry that the U.S. oil embargo on Cuba will have spillover consequences.",
    "link": "http://foreignpolicy.com/2026/02/25/caribbean-caricom-rubio-cuba-oil-trump-donroe/",
    "timestamp": "2026-02-25T21:59:36Z"
  },
  {
    "title": "Netflix CEO to Visit White House as Republican AGs Turn Against Him",
    "description": "Netflix CEO Ted Sarandos will go to the White House Thursday as he looks to push through a merger that even Republicans say presents antitrust concerns.The proposed deal would see Netflix acquire Warner Bros. Discovery at the cost of $70 billion. Though it’s …",
    "link": "https://newrepublic.com/post/207069/netflix-ceo-visit-white-house-republican-attorneys-general-doj-merger",
    "timestamp": "2026-02-25T21:58:47Z"
  },
  {
    "title": "Cornyn’s Nasty Attack on Paxton May Haunt Texas Republicans",
    "description": "John Cornyn’s nasty attack on Ken Paxton may haunt Texas Republicans. Senator John Cornyn goes medieval on ‘Crooked Ken’ Paxton in a new ad. Their brutal primary could be a boon to Democrats as they try to flip the Senate.",
    "link": "http://nymag.com/intelligencer/article/cornyns-nasty-attack-on-paxton-may-haunt-texas-republicans.html",
    "timestamp": "2026-02-25T21:58:34Z"
  },
  {
    "title": "Voters react as Trump touts signature tariff plan at State of the Union",
    "description": "Republicans were pleased after Trump spoke during the State of the Union about his plan to continue imposing global tariffs after the Supreme Court dealt him a setback.",
    "link": "https://www.foxnews.com/politics/voters-react-trump-touts-signature-tariff-plan-state-union",
    "timestamp": "2026-02-25T21:57:17Z"
  },
  {
    "title": "Travis Kelce Praises US Men’s Hockey Team, Draws Criticism From Irate Swifties",
    "description": "Reading Time: 3 minutesTravis Kelce is getting flak for his comments about the US men's hockey team.\nTravis Kelce Praises US Men’s Hockey Team, Draws Criticism From Irate Swifties was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/02/travis-kelce-praises-us-mens-hockey-team-draws-criticism-from-irate-swifties/",
    "timestamp": "2026-02-25T21:57:05Z"
  },
  {
    "title": "Trump's election schemes threatened by his own lawyers' incompetence: analysis",
    "description": "President Donald Trump has been gearing up to interfere in the 2026 midterm elections — but he could hit a brick wall, Jim Saksa wrote for the liberal election law group Democracy Docket, because of the ineptitude of his own legal team.\"With Trump’s poll numb…",
    "link": "https://www.rawstory.com/trump-elections-2675334778/",
    "timestamp": "2026-02-25T21:54:36Z"
  },
  {
    "title": "DOJ has not released some Epstein files related to a woman who made an allegation against Trump",
    "description": "WASHINGTON — The Department of Justice has not released summaries and notes from three separate interviews the FBI conducted with a South Carolina woman who alleged she was a sexual assault victim of Jeffrey Epstein and also made sexual abuse allegations agai…",
    "link": "https://www.nbcnews.com/politics/justice-department/doj-not-released-epstein-files-related-woman-made-allegation-trump-rcna260672",
    "timestamp": "2026-02-25T21:54:05Z"
  },
  {
    "title": "Team USA goalie Jake Oettinger reacts to Trump's locker room comments about the women's hockey team",
    "description": "Dallas Stars goalie Jake Oettinger reacted to President Donald Trump's comments about the U.S. women's hockey team in the locker room after the men's hockey team's win.",
    "link": "https://www.foxnews.com/sports/team-usa-goalie-jake-oettinger-reacts-trumps-locker-room-comments-about-womens-hockey-team",
    "timestamp": "2026-02-25T21:53:59Z"
  },
  {
    "title": "House Dems project midterm optimism at annual policy retreat following State of the Union",
    "description": "House Democrats hammered home economic concerns ahead of 2026 elections at their annual policy conference, the day after President Trump's State of the Union.",
    "link": "https://www.cnbc.com/2026/02/25/state-of-the-union-house-democrats-midterms-retreat.html",
    "timestamp": "2026-02-25T21:53:57Z"
  },
  {
    "title": "JD Vance Rips Democrats Who Showed ‘Cowardice’ For Not Standing Up At 1 Trump SOTU Moment",
    "description": "“They were all looking around for cues from their colleagues because they didn't have the courage to stand on their own,\" Vance said.",
    "link": "https://www.huffpost.com/entry/jd-vance-democrats-not-standing-at-trump-state-of-the-union_n_699f6143e4b01b76c0e37e0d",
    "timestamp": "2026-02-25T21:53:46Z"
  },
  {
    "title": "Feds give record $27B in loans for utility expansion in Georgia and Alabama",
    "description": "Federal energy officials say they will loan a record $27 billion federal loan to Georgia Power and Alabama Power to expand electricity supply",
    "link": "https://abcnews.com/Business/wireStory/feds-give-record-27b-loans-utility-expansion-georgia-130504877",
    "timestamp": "2026-02-25T21:53:37Z"
  },
  {
    "title": "MAGA voter crashes 'scumbag' Dem senator's SOTU boycott speech: 'Go Trump!'",
    "description": "A MAGA supporter crashed Democrats' \"People's State of the Union\" counter-event on Tuesday, calling Sen. Murphy a \"scumbag\" before being escorted out by security staff.",
    "link": "https://www.foxnews.com/politics/maga-voter-crashes-scumbag-dem-senators-sotu-boycott-rally-go-trump",
    "timestamp": "2026-02-25T21:52:28Z"
  },
  {
    "title": "Gavin Newsom Trolls Trump During SOTU With Some Unsolicited Hair Advice",
    "description": "The White House responded to Newsom's jab with searing words.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-trump-hair-state-of-union-address_n_699f2d07e4b0100c254688eb",
    "timestamp": "2026-02-25T21:52:03Z"
  },
  {
    "title": "Trump Provides Oxygen to SAVE America Act in SOTU",
    "description": "After President Donald Trump’s State of the Union Address, congressional Republicans have a clear homework assignment from the White House—to pass the SAVE America Act,... Read More\nThe post Trump Provides Oxygen to SAVE America Act in SOTU appeared first on …",
    "link": "https://www.dailysignal.com/2026/02/25/trump-provides-oxygen-to-save-america-act-in-sotu/",
    "timestamp": "2026-02-25T21:51:40Z"
  },
  {
    "title": "8,000 pages of files reveal Fani Willis conspired with Biden DOJ and Jan. 6 Democrats against Trump",
    "description": "Asked for conference with Rep. Bennie Thompson, who was running Pelosi's partisan group",
    "link": "https://www.wnd.com/2026/02/8000-pages-files-reveal-fani-willis-conspired-biden/",
    "timestamp": "2026-02-25T21:51:09Z"
  },
  {
    "title": "US Men’s Hockey Player Admits Team ‘Should’ve Reacted Differently’ to Trump’s Joke About Women’s Team",
    "description": "Boston Bruins goalie Jeremy Swayman said he and his Olympic teammates should've handled their phone call with President Donald Trump differently.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_70925ad3-c904-4740-8285-45d69902e39e",
    "timestamp": "2026-02-25T21:50:17Z"
  },
  {
    "title": "US Men’s Hockey Player Admits Team ‘Should’ve Reacted Differently’ to Trump’s Joke About Women’s Team",
    "description": "Boston Bruins goalie Jeremy Swayman said he and his Olympic teammates should've handled their phone call with President Donald Trump differently.\nThe post US Men’s Hockey Player Admits Team ‘Should’ve Reacted Differently’ to Trump’s Joke About Women’s Team fi…",
    "link": "https://www.mediaite.com/media/sports/us-mens-hockey-player-admits-team-shouldve-reacted-differently-to-trumps-joke-about-womens-team/",
    "timestamp": "2026-02-25T21:50:17Z"
  },
  {
    "title": "Trump administration's 'third country' deportation policy is unlawful, judge rules",
    "description": "The Trump administration's latest policy of deporting immigrants to “third countries” to which they have no ties is unlawful and must be set aside, a federal judge ruled Wednesday in a case that already reached the nation's highest court. U.S. District Judge …",
    "link": "https://japantoday.com/category/world/trump-administration%27s-%27third-country%27-deportation-policy-is-unlawful-judge-rules",
    "timestamp": "2026-02-25T21:49:25Z"
  },
  {
    "title": "Despite differences, China's Xi and Germany's Merz seek to deepen ties",
    "description": "There are many things that China and Germany do not see eye-to-eye on — notably Russia's war in Ukraine — but the leaders of the world's second and third largest economies nonetheless pledged Wednesday to work to deepen ties in an era of global turbulence. Bo…",
    "link": "https://japantoday.com/category/world/german-leader-arrives-in-china-to-press-for-fair-trade-and-help-ending-ukraine-war",
    "timestamp": "2026-02-25T21:49:19Z"
  },
  {
    "title": "U.S. expands sanctions on Iran over oil sales, weapons programs",
    "description": "The U.S. Treasury Department on Wednesday imposed sanctions on more than 30 individuals, ‌entities and &quot;shadow fleet&quot; vessels it said enabled Iran's illicit petroleum sales, ballistic missiles and weapons production. Treasury's Office of Foreign Ass…",
    "link": "https://japantoday.com/category/world/us-expands-sanctions-on-iran-over-oil-sales-weapons-programs1",
    "timestamp": "2026-02-25T21:49:12Z"
  },
  {
    "title": "Rubio urges Caribbean leaders to cooperate on gangs as Cuba worries grow",
    "description": "U.S. Secretary of State Marco Rubio on Wednesday called for deeper cooperation on tackling criminal gangs as he met Caribbean leaders, even as regional ‌concerns grew over the potential fallout from Washington's squeeze on Cuba. The Trump administration is bl…",
    "link": "https://japantoday.com/category/world/rubio-urges-caribbean-leaders-to-cooperate-on-gangs-as-cuba-worries-grow",
    "timestamp": "2026-02-25T21:48:52Z"
  },
  {
    "title": "Trump's post-State of the Union sales job begins now",
    "description": "President Donald Trump has delivered the State of the Union. Now the challenge for him is to make that message stick. His address Tuesday was a declaration of pride in the achievements of his still-young second term, as he boasted of an economic renaissance a…",
    "link": "https://japantoday.com/category/world/trump-plans-to-take-his-state-of-the-union-message-on-the-road-%E2%80%94-eventually",
    "timestamp": "2026-02-25T21:48:19Z"
  },
  {
    "title": "Zelenskyy, after speaking with Trump, says talks should lead to leaders' meeting",
    "description": "Ukrainian President Volodymyr Zelenskyy said on Wednesday that he and U.S. President Donald Trump agreed that the next session of trilateral talks in March on a war settlement should lead ‌to a meeting of the countries' leaders. Zelenskyy, speaking after a ph…",
    "link": "https://japantoday.com/category/world/zelenskiy-after-speaking-with-trump-says-talks-should-lead-to-leaders%27-meeting",
    "timestamp": "2026-02-25T21:48:04Z"
  },
  {
    "title": "CIA’s social media guide to evading Iranian internet restrictions racks up millions of views as Trump considers military action",
    "description": "The agency posted a Farsi-language message across social media platforms offering tips to potential informants.",
    "link": "https://fortune.com/2026/02/25/potential-us-strike-on-iran-cia-offers-tips-to-informants-trump-military-action/",
    "timestamp": "2026-02-25T21:47:16Z"
  },
  {
    "title": "Crude Volatile Ahead Of Iran Talks",
    "description": "Oil prices fluctuated as traders weighed Iran risks and supply signals.",
    "link": "https://www.rigzone.com/news/wire/crude_volatile_ahead_of_iran_talks-25-feb-2026-183073-article/",
    "timestamp": "2026-02-25T21:47:04Z"
  },
  {
    "title": "Donald Trump Lamented Jared Kushner Ruining His Daughter Ivanka’s Chance To Date Tom Brady While Kushner Was Sitting Right There – Report",
    "description": "In an except from his new memoir Young Man in a Hurry: A Memoir of Discovery, California Governor Gavin Newsom detailed his first meeting with President Donald Trump, which featured a conversation about his daughter missing the chance to date future Hall of F…",
    "link": "https://brobible.com/sports/article/donald-trump-ivanka-tom-brady-jared-kushner/",
    "timestamp": "2026-02-25T21:46:58Z"
  },
  {
    "title": "Japan ready to win hearts at Women's Asian Cup",
    "description": "Japan's Greenland-born women's soccer coach Nils Nielsen is no fan of Donald Trump but he loves his team and believes they can become fan favorites at the Asian Cup in Australia. The tournament kicks off on Sunday and Japan are among the favorites, with a tal…",
    "link": "https://japantoday.com/category/sports/humble-japan-ready-to-win-hearts-at-women%27s-asian-cup",
    "timestamp": "2026-02-25T21:46:13Z"
  },
  {
    "title": "Trump, Zelenskyy Speak By Phone Ahead Of Geneva Talks As Pressure Mounts For Tougher Line On Russia",
    "description": "US President Donald Trump and Ukrainian President Volodymyr Zelenskyy spoke by phone on February 25, a high-stakes conversation confirmed by both the White House and Kyiv as diplomatic efforts intensify ahead of renewed negotiations in Geneva.",
    "link": "https://www.rferl.org/a/trump-zelenskyy-call-geneva-talks-russia-ukraine-pressure/33688205.html",
    "timestamp": "2026-02-25T21:46:11Z"
  },
  {
    "title": "‘Classic Democrat’: Glenn Greenwald Fumes At Elizabeth Warren Applauding Trump on Iran",
    "description": "Glenn Greenwald ripped Sen. Elizabeth Warren for applauding President Trump's tough talk on Iran, just hours after she called for \"No War\" with the country\nThe post ‘Classic Democrat’: Glenn Greenwald Fumes At Elizabeth Warren Applauding Trump on Iran first a…",
    "link": "https://www.mediaite.com/politics/classic-democrat-glenn-greenwald-fumes-at-elizabeth-warren-applauding-trump-on-iran/",
    "timestamp": "2026-02-25T21:43:48Z"
  },
  {
    "title": "Federal energy officials announce record $27B loan for Georgia and Alabama utilities",
    "description": "Federal energy officials say they will loan a record $27 billion federal loan to Georgia Power and Alabama Power to expand electricity supply. U.S. Energy Secretary Chris Wright announced the loan Wednesday, saying subsidized interest rates will save customer…",
    "link": "https://apnews.com/article/georgia-alabama-electricity-power-loans-energy-wright-3aa78ffb7e67ae8e5ce3c42b7d4d3134",
    "timestamp": "2026-02-25T21:42:53Z"
  },
  {
    "title": "The Great Hope of the Democratic Party Just Released a New Memoir. We’re Doomed.",
    "description": "If nothing else, the book is good for a game of politician-memoir bingo.",
    "link": "https://slate.com/news-and-politics/2026/02/gavin-newsom-book-democratic-presidential-race-biden-trump.html",
    "timestamp": "2026-02-25T21:41:49Z"
  },
  {
    "title": "US women's hockey gold medalist Hilary Knight brushes off men's reaction to Trump remark",
    "description": "U.S. captain Hilary Knight said President Donald Trump’s joke about the women’s hockey team was “distasteful\" and detracted from Team USA’s Olympic gold medal win.",
    "link": "https://www.foxnews.com/sports/us-womens-hockey-gold-medalist-hilary-knight-brushes-off-mens-reaction-trump-remark",
    "timestamp": "2026-02-25T21:40:43Z"
  },
  {
    "title": "WATCH: JD Vance Rips Shameful Democrats for Not Standing During Trump’s SOTU Call to Protect Americans First, ‘Sad Commentary on the Party!’",
    "description": "Vice President JD Vance slammed congressional Democrats as cowards for refusing to stand during President Donald Trump’s State of the Union address when he declared that the government’s top priority should be protecting American citizens over illegal aliens.…",
    "link": "https://www.thegatewaypundit.com/2026/02/watch-jd-vance-rips-shameful-democrats-not-standing/",
    "timestamp": "2026-02-25T21:40:09Z"
  },
  {
    "title": "Trump Leaves China Out of His State of the Union – Except to Mock Them",
    "description": "President Donald Trump's State of the Union address made no mention of China, except for a little teasing about Chinese military hardware.\nThe post Trump Leaves China Out of His State of the Union – Except to Mock Them appeared first on Breitbart.",
    "link": "https://www.breitbart.com/asia/2026/02/25/trump-leaves-china-out-his-state-union-except-mock-them/",
    "timestamp": "2026-02-25T21:40:00Z"
  },
  {
    "title": "Ukrainian officials will meet Trump envoys in Geneva for talks",
    "description": "A Ukrainian delegation will meet with U.S. President Donald Trump's envoys in the run-up to another round of trilateral talks with Russia, Ukrainian President Volodymyr Zelenskyy said Wednesday.",
    "link": "https://www.pbs.org/newshour/world/ukrainian-officials-will-meet-trump-envoys-in-geneva-for-talks",
    "timestamp": "2026-02-25T21:38:34Z"
  },
  {
    "title": "DHS official tells state election chiefs there won't be ICE agents at polling places",
    "description": "A senior Department of Homeland Security official said on a call with state election officials Wednesday that immigration agents will not show up at polling places this year, according to three call participants.“Any suggestion that ICE is going to be present…",
    "link": "https://www.nbcnews.com/politics/elections/dhs-official-state-election-chiefs-wont-be-ice-agents-polling-places-rcna260706",
    "timestamp": "2026-02-25T21:37:44Z"
  },
  {
    "title": "Exclusive-FBI obtained Kash Patel and Susie Wiles phone records during Biden administration",
    "description": "WASHINGTON, Feb 25 (Reuters) - The FBI subpoenaed records of phone calls made by ⁠Kash Patel and Susie Wiles, now the FBI director and White House Chief of Staff, when they were both private citizens in 2022 and 2023 during the federal probe of Donald Trump, …",
    "link": "https://www.thestar.com.my/news/world/2026/02/26/exclusive-fbi-obtained-kash-patel-and-susie-wiles-phone-records-during-biden-administration",
    "timestamp": "2026-02-25T21:36:00Z"
  },
  {
    "title": "Sad State of the Union: President stresses division to a country in need of collaboration (Letters)",
    "description": "\"Over and over in opportunities for collaboration, (Trump) created blame, shame and division.\" -- David L. Stevenson, Denver",
    "link": "https://www.denverpost.com/2026/02/25/trump-divisive-in-state-of-union-speech/",
    "timestamp": "2026-02-25T21:35:47Z"
  },
  {
    "title": "Trump’s Cruelty Is Strangling Cuba — Its Oil Reserves Could Be Empty by March",
    "description": "The Supreme Court struck down Trump’s threatened tariffs on countries that send oil to Cuba, but the crisis persists.",
    "link": "https://truthout.org/articles/trumps-cruelty-is-strangling-cuba-its-oil-reserves-could-be-empty-by-march/",
    "timestamp": "2026-02-25T21:35:13Z"
  },
  {
    "title": "Team USA goalie admits players 'should have reacted differently' to Trump's quip about women's team",
    "description": "Team USA’s Jeremy Swayman reflected on the team’s reaction to President Donald Trump’s phone call, saying the players “should have reacted differently\" over the women’s team mention.",
    "link": "https://www.foxnews.com/sports/team-usa-goalie-admits-players-should-have-reacted-differently-trumps-quip-about-womens-team",
    "timestamp": "2026-02-25T21:34:36Z"
  },
  {
    "title": "Iryna Zarutska back in national spotlight; Trump rebukes Democrats’ response during speech",
    "description": "Six months after Iryna Zarutska was killed on a Charlotte light rail train, her mother sat inside the House chamber Tuesday night as President Donald Trump detailed the attack during his State of the Union address.",
    "link": "https://www.wsoctv.com/news/local/iryna-zarutska-back-national-spotlight-trump-rebukes-democrats-response-during-speech/L3RXXIYBXJHRFM6YQQ5EOPSJA4/",
    "timestamp": "2026-02-25T21:34:35Z"
  },
  {
    "title": "Trump's pick to lead new Justice Department unit scrutinized as president declares 'war on fraud'",
    "description": "President Donald Trump's pick to lead a new Justice Department division dedicated to rooting out fraud said Wednesday he would pursue prosecutions \"without fear or favor\" as questions grow about how the new unit will operate free of political influence.",
    "link": "https://www.pbs.org/newshour/politics/trumps-pick-to-lead-new-justice-department-unit-scrutinized-as-president-declares-war-on-fraud",
    "timestamp": "2026-02-25T21:33:21Z"
  },
  {
    "title": "Hegseth moves to restore punishment of Mark Kelly over video about ‘illegal orders’",
    "description": "Secretary of War Pete Hegseth is pushing to revive his effort to punish Sen. Mark Kelly (D-Ariz.) for partaking in a video with other Democratic veteran lawmakers urging service members to “refuse illegal orders.”",
    "link": "https://nypost.com/2026/02/25/us-news/pete-hegseth-moves-to-restore-punishment-of-mark-kelly-over-video-about-illegal-orders/",
    "timestamp": "2026-02-25T21:30:52Z"
  }
]