[
  {
    "title": "Trump says authorizing energy production using coal",
    "description": "United States President Donald Trump said on Truth Social that he is authorizing his administration to \"immediately begin producing Energy with BEAUTIFUL, CLEAN COAL.\"\nTrump said the move c...",
    "link": "https://biztoc.com/x/e918570fb9ebe59b",
    "timestamp": "2025-03-17T23:32:32Z"
  },
  {
    "title": "Conor McGregor's White House immigration comments draw rebuke from Irish PM",
    "description": "Irish mixed martial arts fighter Conor McGregor used a St. Patrick's Day visit to President Donald Trump at the White House on Monday to criticize Ireland's ...",
    "link": "https://ca.news.yahoo.com/conor-mcgregors-white-house-immigration-233210351.html",
    "timestamp": "2025-03-17T23:32:10Z"
  },
  {
    "title": "Relatives of missing Venezuelan migrants desperate for answers after US deportations to El Salvador",
    "description": "(Reuters) - Family members of Venezuelan migrants who suspect their loved ones were sent to El Salvador as part of a rapid U.S. deportation operation over the weekend are struggling to get more information as a legal battle plays out. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/18/relatives-of-missing-venezuelan-migrants-desperate-for-answers-after-us-deportations-to-el-salvador",
    "timestamp": "2025-03-17T23:32:00Z"
  },
  {
    "title": "Trump hangs a copy of Declaration of Independence in Oval Office",
    "description": "President Donald Trump has hung a copy of the Declaration of Independence in the Oval Office, according to images he shared on social media",
    "link": "https://abcnews.go.com/US/wireStory/trump-hangs-copy-declaration-independence-oval-office-119892028",
    "timestamp": "2025-03-17T23:31:36Z"
  },
  {
    "title": "U.S. Continues Strikes in Yemen as part of Large-Scale Campaign Against Houthis",
    "description": "U.S. Forces have launched a large-scale campaign to dismantle the Houthis’ ability to target ships at sea, striking dozens of targets across Yemen. On Mar. 15, 2025, U.S. forces launched a large-scale operation against Houthi targets in Yemen, after U.S. Pres…",
    "link": "https://theaviationist.com/2025/03/18/us-strikes-large-scale-campaign-against-houthis/",
    "timestamp": "2025-03-17T23:30:17Z"
  },
  {
    "title": "Buyers of America, Unite!",
    "description": "“Foreign goods may get a little more expensive, but American goods are going to get cheaper; and you’re going to be helping Americans by buying American.” — US Secretary of Commerce, Howard Lutnick - - -Americans, it’s time to rejoice. We know that you have b…",
    "link": "https://www.mcsweeneys.net/articles/buyers-of-america-unite",
    "timestamp": "2025-03-17T23:30:00Z"
  },
  {
    "title": "Links to pages about Black, Hispanic and female veterans missing from Arlington National Cemetery's website",
    "description": "The Arlington National Cemetery website removed links to webpages about Black, Hispanic and female veterans buried at the site.",
    "link": "https://www.snopes.com//fact-check/arlington-national-cemetery-website-veterans/",
    "timestamp": "2025-03-17T23:29:00Z"
  },
  {
    "title": "Trump revokes Secret Service protection for Hunter and Ashley Biden",
    "description": "The president extended Secret Service protection for his own children before he left office in 2021.",
    "link": "https://www.cbsnews.com/news/trump-revokes-secret-service-protection-hunter-ashley-biden/",
    "timestamp": "2025-03-17T23:24:45Z"
  },
  {
    "title": "Exclusive -- White Coat Waste: Trump's NIH Cuts Grants for Transgender Experiments on Animals",
    "description": "The administration of President Donald Trump has cut taxpayer-funded funding for transgender experiments on animals, the watchdog White Coat Waste Project (WCW) told Breitbart News exclusively.\nThe post Exclusive — White Coat Waste: Trump’s NIH Cuts Grants fo…",
    "link": "https://www.breitbart.com/politics/2025/03/17/exclusive-trumps-nih-cuts-grants-for-transgender-experiments-on-animals-white-coat-waste-reveals/",
    "timestamp": "2025-03-17T23:22:19Z"
  },
  {
    "title": "Assault charges dismissed against Donald 'Whitey' Taylor in Boones Mill dispute",
    "description": "Three employees at the Trump Store that Taylor owns had accused him of assault and indecent exposure.",
    "link": "https://roanoke.com/news/local/crime-courts/article_d7876a28-0382-11f0-94b5-db639792bcf0.html",
    "timestamp": "2025-03-17T23:22:00Z"
  },
  {
    "title": "Trump Vows To Release All JFK Files, But People Are Skeptical",
    "description": "People on social media predicted Tuesday's document dump will be as unsatisfying as the recent release of the Epstein files.",
    "link": "https://www.huffpost.com/entry/trump-to-release-jfk-files-mar-18_n_67d88e51e4b06829460ffc35",
    "timestamp": "2025-03-17T23:21:44Z"
  },
  {
    "title": "US Institute of Peace says DOGE has broken into its building",
    "description": "Employees of Elon Musk’s Department of Government Efficiency have entered the U.S. Institute of Peace despite protests from the nonprofit that it is not part…",
    "link": "https://www.nbcwashington.com/news/president-trump-politics/us-institute-of-peace-doge-trump-administration/3869923/",
    "timestamp": "2025-03-17T23:20:30Z"
  },
  {
    "title": "EXCLUSIVE: Tom Emmer Taunts ‘Completely Lost’ House Democrats — ‘We Don’t Need Their Votes’",
    "description": "Democrats are divided with bitter infighting among the party's leadership ranks spilling out into the open.",
    "link": "https://dailycaller.com/2025/03/17/exclusive-tom-emmer-taunts-completely-lost-house-democrats-we-dont-need-their-votes/",
    "timestamp": "2025-03-17T23:20:09Z"
  },
  {
    "title": "'A remarkable comeback': Liberals leading Conservatives in exclusive new poll",
    "description": "However, there's a wild card: 28 per cent say they don't know enough about Carney to have an opinion, compared to just 12 per cent who say that about Poilievre",
    "link": "https://nationalpost.com/news/politics/federal_election/a-remarkable-comeback-liberals-leading-conservatives-in-exclusive-new-poll",
    "timestamp": "2025-03-17T23:19:22Z"
  },
  {
    "title": "Trying to buy Canadian, this P.E.I. shopper wants more transparency on grocery labels",
    "description": "With many Islanders committed to buying Canadian products in the midst of a trade war with the United States, some are learning that figuring out what country a product is from can be complicated.",
    "link": "https://www.cbc.ca/news/canada/prince-edward-island/pei-sobeys-grocery-labels-us-mexico-produce-1.7486156",
    "timestamp": "2025-03-17T23:18:47Z"
  },
  {
    "title": "Treasury Secretary Scott Bessent says corrections are 'healthy' and 'normal.' Jim Cramer disagrees",
    "description": "CNBC's Jim Cramer on Monday parsed recent market action.",
    "link": "https://www.cnbc.com/2025/03/17/scott-bessent-says-corrections-are-healthy-jim-cramer-disagrees.html",
    "timestamp": "2025-03-17T23:16:49Z"
  },
  {
    "title": "What to know about claims the FBI is trying to 'criminalize' Habitat for Humanity",
    "description": "Habitat for Humanity was among organizations whose Citibank accounts the FBI froze while investigating the EPA's Greenhouse Gas Reduction Fund.",
    "link": "https://www.snopes.com//news/2025/03/17/habitat-for-humanity-fbi/",
    "timestamp": "2025-03-17T23:16:00Z"
  },
  {
    "title": "Livestream: Vermont victory against Israeli apartheid",
    "description": "Towns vote for anti-apartheid pledge, the arrest of Mahmoud Khalil, forced displacement in the West Bank, Yemen reimposes sea blockade and more, on the latest episode.",
    "link": "https://electronicintifada.net/blogs/eli-gerzon/livestream-vermont-victory-against-israeli-apartheid",
    "timestamp": "2025-03-17T23:15:58Z"
  },
  {
    "title": "RBA watching US economy as Macquarie warns of potential share crash",
    "description": "The Reserve Bank's chief economist says current economic uncertainty, especially around US tariffs, makes forecasting and rate setting more difficult, as Macquarie Bank warns Donald Trump's economic policies run the risk of sparking a stock market crash.",
    "link": "https://www.abc.net.au/news/2025-03-18/rba-watching-us-economic-chaos-macquarie-market-crash-warning/105064718",
    "timestamp": "2025-03-17T23:15:33Z"
  },
  {
    "title": "Fulton judge says DA’s office violated open records law, orders Willis to pay $54,000",
    "description": "Another setback for Fulton County District Attorney Fani Willis’ prosecution of President Donald Trump and others.",
    "link": "https://www.wsbtv.com/news/local/atlanta/fulton-judge-says-das-office-violated-open-records-law-orders-willis-pay-54000/WB7A2BN7G5DPNFWQ5QS7YIL2KI/",
    "timestamp": "2025-03-17T23:15:30Z"
  },
  {
    "title": "The Trump Counterrevolution’s Next Moves Abroad",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post The Trump Counterrevolution’s Next Moves Abroad appeared first on The D…",
    "link": "https://www.dailysignal.com/2025/03/17/the-trump-counterrevolutions-next-moves-abroad/",
    "timestamp": "2025-03-17T23:14:27Z"
  },
  {
    "title": "Oman's hidden role in empowering Houthi rebels - opinion",
    "description": "By reducing reliance on Omani ports and land routes, the leverage Muscat holds over regional trade can be diminished, further incentivizing it to abandon its support for the Houthis.",
    "link": "https://www.jpost.com/opinion/article-846386",
    "timestamp": "2025-03-17T23:14:14Z"
  },
  {
    "title": "Houthis Launch Drone and Missile Barrage Toward U.S. Aircraft Carrier",
    "description": "Ending attacks on shipping vessels transiting the Red Sea remains a top priority for the White House.\nThe post Houthis Launch Drone and Missile Barrage Toward U.S. Aircraft Carrier appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/houthis-launch-drone-and-missile-barrage-toward-u-s-aircraft-carrier/",
    "timestamp": "2025-03-17T23:13:38Z"
  },
  {
    "title": "Canadian breweries face $330-million annual cost hike as aluminum tariffs hit beer cans",
    "description": "Canada’s beer industry will be hit with a $330-million increase to the annual cost of cans if U.S. President Donald Trump refuses to back down from the 25-per-cent tariff he slapped on Canada’s aluminum industry last week.\nAluminum beer cans are currently sub…",
    "link": "https://biztoc.com/x/785c84d78eb28816",
    "timestamp": "2025-03-17T23:10:44Z"
  },
  {
    "title": "How much will the U.S. energy mix change under Trump? Maybe not much",
    "description": "From Joe Biden to Donald Trump, the vibes have shifted dramatically when it comes to energy and the environment. But even though Green New Deal aspirations have given way to “Drill, baby drill!” this country is likely to continue its all-of-the-above approach…",
    "link": "https://biztoc.com/x/ec181883c65c213d",
    "timestamp": "2025-03-17T23:10:36Z"
  },
  {
    "title": "Trump revokes secret service protection for Biden's children Hunter and Ashley (Reuters)",
    "description": "Reuters:\nTrump revokes secret service protection for Biden's children Hunter and Ashley  —  U.S. President Donald Trump on Monday revoked secret service protection for former president Joe Biden's children Hunter Biden and Ashley Biden.  —  “Hunter Biden has …",
    "link": "https://www.memeorandum.com/250317/p124",
    "timestamp": "2025-03-17T23:10:01Z"
  },
  {
    "title": "‘I Couldn’t Disagree More’: Piers Morgan Clashes With Democrat Strategist Who Claims Trump Isn’t ‘Mentally Well’",
    "description": "British host Piers Morgan disagreed with a Democratic strategist Julie Roginsky's claim on Monday that President Donald Trump might not be mentally well.",
    "link": "https://dailycaller.com/2025/03/17/piers-morgan-julie-roginsky-donald-trump-mental-state/",
    "timestamp": "2025-03-17T23:09:49Z"
  },
  {
    "title": "Homan turns the tables on reporter who asked about '200-year-old' immigration law",
    "description": "Border czar Tom Homan turned a reporter's question back around on him after being asked about using the Alien Enemies Act of 1798 to deport criminal migrants.",
    "link": "https://www.foxnews.com/media/homan-turns-tables-reporter-who-asked-about-200-year-old-immigration-law",
    "timestamp": "2025-03-17T23:07:43Z"
  },
  {
    "title": "Judge Incredulous As Administration Contends His Verbal Court Order On Deportation Isn't Binding",
    "description": "A federal judge was incredulous at the Trump administration's contention that his directive to turn around deportation flights wasn't binding because it was made verbally.",
    "link": "https://www.huffpost.com/entry/judge-trump-deportations-verbal-court-order_n_67d8a738e4b0dade360d1cf1",
    "timestamp": "2025-03-17T23:04:35Z"
  },
  {
    "title": "Trump Rages Against ‘Radical Left Lunatic’ Reporter Who Doesn’t Know He ‘Won The Presidency THREE Times’",
    "description": "President Donald Trump railed against MSNBC analyst and The Atlantic staff writer Ashley Parker after she reached out about conducting an interview.\nThe post Trump Rages Against ‘Radical Left Lunatic’ Reporter Who Doesn’t Know He ‘Won The Presidency THREE Tim…",
    "link": "https://www.mediaite.com/politics/trump-rages-against-radical-left-lunatic-reporter-who-doesnt-know-he-won-the-presidency-three-times/",
    "timestamp": "2025-03-17T23:04:30Z"
  },
  {
    "title": "This is why Kamala Harris really lost",
    "description": "Democrats have spent months debating how and why they lost the 2024 election. But the full picture of what happened on Election Day is only now coming into view. The most authoritative election analyses draw on a variety of different data sources, including l…",
    "link": "https://www.vox.com/politics/403364/tik-tok-young-voters-2024-election-democrats-david-shor",
    "timestamp": "2025-03-17T23:03:19Z"
  },
  {
    "title": "Cotton Predicts SCOTUS Will Deliver 'Rebuke' to Liberal Judges Interfering with Core Presidential Responsibilities",
    "description": "On Monday, during an appearance on Hugh Hewitt's nationally syndicated radio show, Sen. Tom Cotton (R-AR) said he expected the Supreme Court to rebuke liberal judges who interfere with the \"core responsibilities of the commander-in-chief.\"\nThe post Cotton Pre…",
    "link": "https://www.breitbart.com/clips/2025/03/17/cotton-predicts-scotus-will-deliver-rebuke-to-liberal-judges-interfering-with-core-presidential-responsibilities/",
    "timestamp": "2025-03-17T23:02:47Z"
  },
  {
    "title": "India formally asks US for USAID spend info",
    "description": "India has requested the US embassy to provide detailed expenditure reports of USAID-funded projects in the country over the past decade. Minister of State for External Affairs, Kirti Vardhan Singh, stated that this information, which includes financial detail…",
    "link": "https://timesofindia.indiatimes.com/india/india-formally-asks-us-for-usaid-spend-info/articleshow/119134595.cms",
    "timestamp": "2025-03-17T23:02:00Z"
  },
  {
    "title": "WATCH: Trump yanks all Secret Service protection for Hunter and Ashley Biden",
    "description": "'There are as many as 18 people on this Detail, which is ridiculous!'",
    "link": "https://www.wnd.com/2025/03/watch-trump-yanks-all-secret-service-protection-for-hunter-and-ashley-biden/",
    "timestamp": "2025-03-17T23:01:30Z"
  },
  {
    "title": "A D.O.J. lawyer repeatedly refuses to answer a federal judge’s questions about deportations to El Salvador.",
    "description": "The Trump administration on Monday repeatedly stonewalled a federal judge seeking answers about whether the government had violated his order barring the deportation of more than 200 noncitizens without due process, escalating a conflict that threatened to be…",
    "link": "https://freerepublic.com/focus/f-news/4304948/posts",
    "timestamp": "2025-03-17T23:01:04Z"
  },
  {
    "title": "Judge Orders Fani Willis to Pay $54K for Intentionally Violating Open Record Laws",
    "description": "Her actions “were intentional, not done in good faith, and were substantially groundless and vexatious.”\nThe post Judge Orders Fani Willis to Pay $54K for Intentionally Violating Open Record Laws first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/03/judge-orders-fani-willis-to-pay-54k-for-intentionally-violating-open-record-laws/",
    "timestamp": "2025-03-17T23:00:51Z"
  },
  {
    "title": "Trump Revokes Secret Service Protection For Joe Biden's Children",
    "description": "U.S. President Donald Trump on Monday revoked secret service protection for former president Joe Biden&#039;s children Hunter Biden and Ashley Biden.",
    "link": "https://www.ndtv.com/world-news/trump-revokes-secret-service-protection-for-joe-bidens-children-hunter-and-ashley-7947394",
    "timestamp": "2025-03-17T23:00:09Z"
  },
  {
    "title": "Trump Bitcoin Reserve under fire: EU sounds alarm over ‘American brutality’",
    "description": "Could U.S. crypto policies trigger the next global financial crisis? Europe thinks so.",
    "link": "https://ambcrypto.com/trump-bitcoin-reserve-under-fire-eu-sounds-alarm-over-american-brutality/",
    "timestamp": "2025-03-17T23:00:04Z"
  },
  {
    "title": "Eric Adams won't rule out running for reelection as an independent (Politico)",
    "description": "Politico:\nEric Adams won't rule out running for reelection as an independent  —  The New York City mayor remains a registered Democrat but has distanced himself from his party amid his embrace of President Donald Trump.  —  NEW YORK — Mayor Eric Adams remains…",
    "link": "https://www.memeorandum.com/250317/p123",
    "timestamp": "2025-03-17T23:00:01Z"
  },
  {
    "title": "Little Marco Expels South African Ambassador",
    "description": "U.S. Secretary of State Marco Rubio has faced a flood of condemnation since announcing on social media Friday that \"South Africa's ambassador to the United States is no longer welcome in our great country.\"\n\"Ebrahim Rasool is a race-baiting politician who hat…",
    "link": "https://crooksandliars.com/2025/03/little-marco-expels-south-african",
    "timestamp": "2025-03-17T23:00:01Z"
  },
  {
    "title": "Trump notes progress with Putin on Ukraine deal",
    "description": "United States President Donald Trump said ahead of his call with Russian President Vladimir Putin tomorrow that \"many elements of a Final Agreement have been agreed to.\"\n\"Tomorrow morn...",
    "link": "https://biztoc.com/x/38ad6323d10d7053",
    "timestamp": "2025-03-17T22:59:43Z"
  },
  {
    "title": "US Institute of Peace says DOGE has broken into its building",
    "description": "It was not immediately clear what the DOGE staffers were doing or looking for.",
    "link": "https://www.bostonherald.com/2025/03/17/trump-doge-foreign-aid/",
    "timestamp": "2025-03-17T22:59:36Z"
  },
  {
    "title": "Trump's World Liberty Financial crypto project says it sold $550 million in tokens",
    "description": "World Liberty Financial said it completed its second token sale, bringing in $550 million.",
    "link": "https://www.cnbc.com/2025/03/17/trump-world-liberty-financial-crypto-sold-550-million-in-tokens.html",
    "timestamp": "2025-03-17T22:58:22Z"
  },
  {
    "title": "Trump Says He’s Ending Secret Service Protection For Hunter Biden",
    "description": "President Donald Trump announced on Monday that he is revoking the Secret Service protection for former President Joe Biden's son, Hunter Biden.",
    "link": "https://dailycaller.com/2025/03/17/donald-trump-secret-service-protection-hunter-biden/",
    "timestamp": "2025-03-17T22:58:01Z"
  },
  {
    "title": "Trump nominates Fed Governor Michelle Bowman to be central bank’s top cop: ‘Economy has been mismanaged’",
    "description": "Her nomination was quickly met with praise from the banking industry and congressional Republicans, who touted her efforts to resist tougher industry rules.",
    "link": "https://nypost.com/2025/03/17/business/trump-nominates-fed-governor-michelle-bowman-as-vice-chair-for-supervision/",
    "timestamp": "2025-03-17T22:57:20Z"
  },
  {
    "title": "Courtney Love reveals she’s getting her UK citizenship after Trump’s re-election: ‘It’s frightening now’",
    "description": "The 60-year-old actress and singer, who is a vocal critic of President Donald Trump, spoke at the Royal Geographical Society in London and said she plans to become a permanent UK resident. “It’s so great to live here. I’m finally getting my British citizenshi…",
    "link": "https://freerepublic.com/focus/f-news/4304947/posts",
    "timestamp": "2025-03-17T22:57:13Z"
  },
  {
    "title": "Trump warns Iran will face 'dire' consequences unless Houthi attacks stop",
    "description": "\"Every shot fired by the Houthis\" will be blamed on Iran, Trump says as the US escalates attacks on Yemen.",
    "link": "https://www.bbc.com/news/articles/cwyd2l17ygpo",
    "timestamp": "2025-03-17T22:56:47Z"
  },
  {
    "title": "'No credibility!' Trump lashes out at 'terrible' magazine as he ducks interview",
    "description": "President Donald Trump lashed out Monday afternoon at the award-winning magazine The Atlantic, calling the publication \"third rate\" and even lashing out at two of its staffers, who he decried as \"terrible\" biased and members of the \"radical left.\"Trump took t…",
    "link": "https://www.rawstory.com/the-atlantic/",
    "timestamp": "2025-03-17T22:55:05Z"
  },
  {
    "title": "Trump says he’s ending Secret Service protection for Biden’s adult children",
    "description": "Protection afforded to immediate families over the age of 16 ends when presidents leave office.",
    "link": "https://www.bostonherald.com/2025/03/17/trump-biden-secret-service/",
    "timestamp": "2025-03-17T22:54:49Z"
  },
  {
    "title": "'We're not stopping': Trump officials raise the stakes in showdowns with judges",
    "description": "President Donald Trump and his allies have launched a multi-pronged attack on the judiciary.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-officials-raise-stakes-showdowns-judges-rcna196702",
    "timestamp": "2025-03-17T22:54:41Z"
  },
  {
    "title": "Trump's next target? Canada's go-to think-tank in Washington",
    "description": "The Wilson Center is a longstanding destination of choice for Canadian newsmakers visiting Washington, with its Canada Institute providing a venue for news conferences, and discussions, just over a block from the White House. It's now on the list of organizat…",
    "link": "https://www.cbc.ca/news/world/wilson-center-trump-target-list-1.7486057",
    "timestamp": "2025-03-17T22:52:28Z"
  },
  {
    "title": "Donald Trump Held Another Million-Dollar 'Candlelight' Dinner—With Elon Musk in Tow",
    "description": "Unlike the previous fundraiser, this event did not appear on President Donald Trump's official schedule.",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176756009",
    "timestamp": "2025-03-17T22:52:20Z"
  },
  {
    "title": "What Trump’s Latest Houthi Strike Really Means",
    "description": "The administration has a broader geopolitical agenda—one that includes countering China’s economic leverage, particularly Beijing’s reliance on Iranian oil. President Donald Trump, in his first week in office, pledged to designate Ansarallah (“Partisans of Go…",
    "link": "https://nationalinterest.org/blog/middle-east-watch/what-trumps-latest-houthi-strike-really-means/",
    "timestamp": "2025-03-17T22:51:41Z"
  },
  {
    "title": "Trump: Putin agred to 'many elements' of a final agreement for war in Ukraine",
    "description": "US President Donald Trump said that Russian President Vladimir Putin has agreed to \"many elements of a Final A",
    "link": "https://www.jpost.com/breaking-news/article-846470",
    "timestamp": "2025-03-17T22:51:15Z"
  },
  {
    "title": "Canada’s Carney meets with European allies as Trump targets his country’s sovereignty and economy",
    "description": "Canadian Prime Minister Mark Carney met the leaders of Britain and France on Monday during his first official overseas trip, seeking support from two of Ottawa’s oldest allies as U.S. President Donald Trump targets Canada’s sovereignty and economy. Canadians …",
    "link": "https://freerepublic.com/focus/f-news/4304944/posts",
    "timestamp": "2025-03-17T22:50:26Z"
  },
  {
    "title": "Why Stock Markets Don’t Like Trade Wars",
    "description": "In just a few weeks, Trump’s tariff policy has wiped out trillions in stock market value.",
    "link": "http://foreignpolicy.com/2025/03/17/why-stock-markets-dont-like-trade-wars/",
    "timestamp": "2025-03-17T22:49:06Z"
  },
  {
    "title": "The ugly history behind the obscure law Trump is using for mass deportations",
    "description": "President Donald Trump has invoked an 18th-century wartime law to carry out a large-scale deportation operation.  As he promised on the campaign trail, Trump used the Alien Enemies Act to send hundreds of people with alleged Venezuelan gang ties to El Salvado…",
    "link": "https://www.vox.com/politics/404745/alien-enemies-act-trump-venezuela-history-world-war",
    "timestamp": "2025-03-17T22:48:51Z"
  },
  {
    "title": "Trump Pulls Hunter Biden’s Secret Service Detail After Reporter Tells Him About It: ‘Ridiculous!’",
    "description": "President Donald Trump yanked Hunter Biden's Secret Service detail on Monday after a reporter informed him about it.\nThe post Trump Pulls Hunter Biden’s Secret Service Detail After Reporter Tells Him About It: ‘Ridiculous!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/trump/trump-pulls-hunter-bidens-secret-service-detail-after-reporter-tells-him-about-it-ridiculous/",
    "timestamp": "2025-03-17T22:48:43Z"
  },
  {
    "title": "Black Medal of Honor recipient deleted from Pentagon website, then restored",
    "description": "A post celebrating a Black Medal of Honor recipient was deleted from the U.S. Department of Defense website and “DEI” (diversity, equity and inclusion) to the page's former URL on or about March 15, 2025.",
    "link": "https://www.snopes.com//fact-check/charles-rogers-medal-of-honor/",
    "timestamp": "2025-03-17T22:46:00Z"
  },
  {
    "title": "Working 9 to 5 — and 6 to 11. Maybe weekends too.",
    "description": "About 8.9 million. That’s how many U.S. workers worked more than one job in February — an all-time high, according to the Bureau of Labor Statistics. We spoke with some workers holding multiple job about why this economy necessitates a second (or third) gig. …",
    "link": "https://www.marketplace.org/shows/marketplace/working-9-to-5-and-6-to-11-maybe-weekends-too/",
    "timestamp": "2025-03-17T22:45:37Z"
  },
  {
    "title": "Weissmann: AG Bondi, Press Sec Leavitt Comments Leading to 'Constitutional Crisis'",
    "description": "Former federal prosecutor Andrew Weissmann said that Monday, on MSNBC's \"Deadline,\" White House press secretary Karoline Leavitt and Attorney General Pam Bondi's comments led to a constitutional crisis.\nThe post Weissmann: AG Bondi, Press Sec Leavitt Comments…",
    "link": "https://www.breitbart.com/clips/2025/03/17/weissmann-ag-bondi-press-sec-leavitt-comments-leading-to-constitutional-crisis/",
    "timestamp": "2025-03-17T22:43:27Z"
  },
  {
    "title": "Donald Trump Held Another Million-Dollar 'Candlelight' Dinner—With Elon Musk in Tow",
    "description": "Unlike the previous million-dollar \"candlelight\" dinner, this event did not appear on Donald Trump's official schedule. Oh, and Elon Musk was there too, WIRED has learned.",
    "link": "https://www.wired.com/story/trump-million-dollar-candlelight-dinner-elon-musk/",
    "timestamp": "2025-03-17T22:43:03Z"
  },
  {
    "title": "Trump ‘disappointed’ after first Kennedy Center tour since naming himself chairman: ‘This is a shame’",
    "description": "\"Kennedy Center is in tremendous disrepair, as is a lot of the rest of our country, most of it because of bad management. This is a shame, what I've watched and witnessed.\"",
    "link": "https://nypost.com/2025/03/17/us-news/trump-disappointed-after-first-kennedy-center-tour-since-naming-himself-chairman/",
    "timestamp": "2025-03-17T22:41:49Z"
  },
  {
    "title": "Ex-Credit Suisse Client Pleads Guilty to Hiding Money From IRS",
    "description": "A Brazilian-American businessman became the second former Credit Suisse Group AG client to plead guilty within the last week to hiding millions of dollars in assets from US tax authorities.",
    "link": "https://www.livemint.com/companies/news/excredit-suisse-client-pleads-guilty-to-hiding-money-from-irs-11742251285754.html",
    "timestamp": "2025-03-17T22:41:25Z"
  },
  {
    "title": "Lawyers and advocates say 48 people are unaccounted for after ICE raid in New Mexico",
    "description": "An attorney for the ACLU in the state said community advocates were “on the verge of tears” Monday because they had  little to no information on the people who were arrested.",
    "link": "https://www.nbcnews.com/news/latino/lawyers-advocates-say-48-people-are-unaccounted-ice-raid-new-mexico-rcna196773",
    "timestamp": "2025-03-17T22:41:11Z"
  },
  {
    "title": "BREAKING: Article III Project, War Room and Rep. Brandon Gill Move to Impeach Obama Judge Boasberg Who Ordered Trump to Transport 100’s of Thousands of Violent Gang Bangers Back into US – HERE’S HOW YOU CAN JOIN IN",
    "description": "Representative Brandon Gill's bold move to impeach Judge James Boasberg for blocking President Trump's deportation efforts highlights a fierce battle over immigration policy and judicial authority. Engage with the unfolding political drama.\nThe post BREAKING:…",
    "link": "https://www.thegatewaypundit.com/2025/03/breaking-article-iii-project-war-room-rep-brandon/",
    "timestamp": "2025-03-17T22:40:21Z"
  },
  {
    "title": "Empty shelves, idle escalators: Shoppers look for piece of history at the Bay stores",
    "description": "Empty shelves and idle escalators greeted shoppers Monday as they poked through Hudson’s Bay stores looking for bargains and perhaps a piece of history. In Edmonton, some racks at two Bay locations were picked clean as a mere handful of older men and women to…",
    "link": "https://financialpost.com/pmn/empty-shelves-idle-escalators-shoppers-look-for-piece-of-history-at-the-bay-stores",
    "timestamp": "2025-03-17T22:39:34Z"
  },
  {
    "title": "Trump EPA Pulls Massive Offshore Wind Boondoggle Permit",
    "description": "A federal judge revoked a permit that may create more obstructions or completely end ambitions for New Jersey's first offshore wind energy farm.",
    "link": "https://dailycaller.com/2025/03/17/trump-epa-pulls-massive-offshore-wind-boondoggle-permit/",
    "timestamp": "2025-03-17T22:38:49Z"
  },
  {
    "title": "82 U.S. House members demand rejection of Trump's anti-transgender passport policy",
    "description": "Eighty-two members of the U.S. House of Representatives have signed on to a letter opposing the implementation of the Trump administration’s anti-transgender passport policy.",
    "link": "https://www.advocate.com/politics/congresspeople-oppose-transgender-passport-change",
    "timestamp": "2025-03-17T22:38:38Z"
  },
  {
    "title": "Brightline West oversells bond offering for Vegas-to-SoCal high-speed rail",
    "description": "Brightline West far exceeded expectations for its private activity bond offering, signaling investor confidence in the Las Vegas-to-Southern California high-speed rail project.",
    "link": "https://www.reviewjournal.com/post/3322361",
    "timestamp": "2025-03-17T22:38:17Z"
  },
  {
    "title": "Trump Says John F. Kennedy Assassination Files To Be Released Today",
    "description": "Donald Trump said his administration would be releasing Tuesday remaining government files on the assassination of president John F. Kennedy -- a case that still fuels conspiracy theories more than 60 years after his death.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-john-f-kennedy-assassination-files-to-be-released-today-7947333",
    "timestamp": "2025-03-17T22:38:11Z"
  },
  {
    "title": "Tesla Rival Can Charge EV in 5 Minutes Flat. But You Won't See One in US",
    "description": "Cars could travel nearly 250 miles after being charged, according to BYD, a global rival to Tesla.",
    "link": "https://www.newsweek.com/byd-charge-electric-vehicle-five-minutes-2046185",
    "timestamp": "2025-03-17T22:34:55Z"
  },
  {
    "title": "White House, Border Patrol troll critics with deportation ‘Closing Time’ meme video: ‘Can’t stay here’",
    "description": "\"It's closing time. We are making America safe again,\" US Customs and Border Protection said in its post.",
    "link": "https://nypost.com/2025/03/17/us-news/white-house-border-patrol-troll-critics-with-deportation-closing-time-meme-video-cant-stay-here/",
    "timestamp": "2025-03-17T22:34:48Z"
  },
  {
    "title": "US EV market faces slowdown as hybrids gain traction",
    "description": "The US electric vehicle market is losing momentum as policy shifts under President Donald Trump reshape incentives and supply chains. While battery electric vehicle (BEV) sales continue to grow, S&P Global Mobility forecasts a slower pace, extending the decel…",
    "link": "https://www.digitimes.com/news/a20250317PD211/market-vehicle-bev-sales-policy.html",
    "timestamp": "2025-03-17T22:32:47Z"
  },
  {
    "title": "Trump and Putin to discuss power plants, land in talks to end Ukraine war",
    "description": "Trump has been trying to win Putin's support for a 30-day ceasefire proposal that Ukraine accepted last week.",
    "link": "https://www.japantimes.co.jp/news/2025/03/18/world/politics/trump-putin-power-plants-ukraine-talks/",
    "timestamp": "2025-03-17T22:31:00Z"
  },
  {
    "title": "VA will no longer provide transgender care for some veterans",
    "description": "Transgender veterans will no longer be provided hormone therapy through the Department of Veterans Affairs unless they were already receiving such care through the department or the military, the VA announced.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/va-will-no-longer-provide-transgender-care-veterans-rcna196802",
    "timestamp": "2025-03-17T22:30:54Z"
  },
  {
    "title": "How Republicans Learned to Love High Prices (Scott Lincicome/The Atlantic)",
    "description": "Scott Lincicome / The Atlantic:\nHow Republicans Learned to Love High Prices  —  After spending most of the 2024 campaign blaming Democrats for inflation and insisting that tariffs don't increase prices, Donald Trump and his allies have a new economic message:…",
    "link": "https://www.memeorandum.com/250317/p119",
    "timestamp": "2025-03-17T22:30:00Z"
  },
  {
    "title": "Onyx Boox has increased their prices for e-readers and e-notes",
    "description": "Onyx Boox has just increased prices on e-readers and e-notebooks on Amazon and the Boox Official Store.\nThe post Onyx Boox has increased their prices for e-readers and e-notes first appeared on Good e-Reader.",
    "link": "https://goodereader.com/blog/onyx-boox/onyx-boox-has-increased-their-prices-for-e-readers-and-e-notes",
    "timestamp": "2025-03-17T22:29:43Z"
  },
  {
    "title": "Whither the Panther?",
    "description": "It doesn’t take much to see that the problems of one little fifth generation fighter plane don’t amount to a hill of beans in this crazy world, but it’s nonetheless been interesting to try to figure out what Trump and Elon are doing. One point in favor; they …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/whither-the-panther",
    "timestamp": "2025-03-17T22:27:59Z"
  },
  {
    "title": "BREAKING: President Trump just announced Hunter and Ashley Biden will no longer receive Secret Service protection.",
    "description": "Benny Johnson @bennyjohnson BREAKING: President Trump just announced Hunter and Ashley Biden will no longer receive Secret Service protection. 5:13 PM · Mar 17, 2025",
    "link": "https://freerepublic.com/focus/f-news/4304940/posts",
    "timestamp": "2025-03-17T22:27:24Z"
  },
  {
    "title": "Donald Trump Revokes Hunter Biden's Secret Service: 'Effective Immediately'",
    "description": "In a post on Truth Social on Monday, President Trump said he was revoking Secret Service protection for Hunter and Ashley Biden.",
    "link": "https://biztoc.com/x/bdf2d16fc8b4b1b9",
    "timestamp": "2025-03-17T22:26:16Z"
  },
  {
    "title": "Trump Taps Republic Airways CEO to Lead FAA",
    "description": "Trump’s pick to head the FAA comes as the agency faces potential DOGE cuts and an air traffic controller shortage. -Meghna Maharishi",
    "link": "http://skift.com/2025/03/17/trump-taps-republic-airways-ceo-to-lead-faa/",
    "timestamp": "2025-03-17T22:25:08Z"
  },
  {
    "title": "Canary Capital continues flurry of US crypto ETF filings with Sui proposal",
    "description": "Canary Capital Group, a digital assets investment firm, said on Monday that it is seeking the green light from regulators to launch an exchange-traded fund tied to the spot price of Sui, a cryptocurrency associated with Sui Network, a blockchain service provi…",
    "link": "https://www.channelnewsasia.com/business/canary-capital-continues-flurry-us-crypto-etf-filings-sui-proposal-5006676",
    "timestamp": "2025-03-17T22:24:35Z"
  },
  {
    "title": "Donald Trump Revokes Hunter Biden's Secret Service: 'Effective Immediately'",
    "description": "In a post on Truth Social on Monday, President Trump said he was revoking Secret Service protection for Hunter and Ashley Biden.",
    "link": "https://www.newsweek.com/donald-trump-revokes-hunter-bidens-secret-service-effective-immediately-2046191",
    "timestamp": "2025-03-17T22:24:28Z"
  },
  {
    "title": "Trump nominates Republic Airways CEO Bryan Bedford to lead the FAA, appoints new military academy boards",
    "description": "Bryan Bedford, the CEO of Indiana-based regional airline Republic Airways, has been named as President Donald Trump's nominee for Administrator of the Federal Aviation Administration (FAA).",
    "link": "https://www.foxnews.com/politics/trump-nominates-republic-airways-ceo-bryan-bedford-lead-faa-appoints-new-military-academy-boards",
    "timestamp": "2025-03-17T22:24:26Z"
  },
  {
    "title": "Ignoring All the President’s Women, Vanity Fair Ludicrously Accuses Trump of Nazi-Style Sexism",
    "description": "For a fresh look at how infantile, indolent, and insane the “Hate Trump” media have become, look no further than Olivia Campbell’s latest finger painting in... Read More\nThe post Ignoring All the President’s Women, Vanity Fair Ludicrously Accuses Trump of Naz…",
    "link": "https://www.dailysignal.com/2025/03/17/ignoring-all-presidents-women-vanity-fair-accuses-trump-nazi-style-sexism/",
    "timestamp": "2025-03-17T22:21:48Z"
  },
  {
    "title": "Beatings, overcrowding and food deprivation: US deportees face distressing human rights conditions in El Salvador’s mega-prison",
    "description": "El Salvador has the highest prison population rate in the world. The US administration intends to increase the number of people behind bars there.",
    "link": "https://theconversation.com/beatings-overcrowding-and-food-deprivation-us-deportees-face-distressing-human-rights-conditions-in-el-salvadors-mega-prison-250739",
    "timestamp": "2025-03-17T22:21:30Z"
  },
  {
    "title": "Trump Taps Republic Airways CEO to Lead US Aviation Regulator",
    "description": "President Donald Trump has nominated Bryan Bedford, the chief executive officer of regional airline Republic Airways Holdings Inc., to be the next leader of the Federal Aviation Administration.",
    "link": "https://www.livemint.com/companies/company-results/trump-taps-republic-airways-ceo-to-lead-us-aviation-regulator-11742250001722.html",
    "timestamp": "2025-03-17T22:20:01Z"
  },
  {
    "title": "Judges, Politicians Who Aren't Backing Down from Trump and Talks of Dictatorship",
    "description": "Photo: Andrew Harnik (Getty Images)\r\nWith all the talks about dictatorship and ongoing fears about President Donald Trump’s administration, there are still many political leaders who refuse to let the president slide. In fact, Trump and his administration hav…",
    "link": "https://www.theroot.com/judges-politicians-who-arent-backing-down-from-trump-a-1851770512",
    "timestamp": "2025-03-17T22:20:00Z"
  },
  {
    "title": "US could recognize Crimea as Russian – Semafor",
    "description": "The Trump administration is reportedly considering recognizing Crimea as Russian territory Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614369-trump-discussing-recognizing-crimea/",
    "timestamp": "2025-03-17T22:18:04Z"
  },
  {
    "title": "Trump taps Michelle Bowman to be US Fed vice chair for supervision",
    "description": "US President Donald Trump on Monday picked Michelle Bowman to be the Federal Reserve’s next vice chair for supervision, tapping someone seen as favoring a lighter touch to banking regulation. The important central bank role requires confirmation by the Senate…",
    "link": "https://www.digitaljournal.com/world/trump-taps-michelle-bowman-to-be-us-fed-vice-chair-for-supervision/article",
    "timestamp": "2025-03-17T22:17:33Z"
  },
  {
    "title": "Biden-era tax on natural gas repealed, a boon for energy industry",
    "description": "America’s natural gas industry celebrated Monday after President Donald Trump signed into law a resolution repealing Biden-era fees on methane emissions. The Waste Emissions Charge, which Republicans say is the equivalent of a natural gas tax, was authorized …",
    "link": "https://freerepublic.com/focus/f-news/4304937/posts",
    "timestamp": "2025-03-17T22:16:23Z"
  },
  {
    "title": "Leaked Ford document outlines its strategy to combat tariffs",
    "description": "On March 5, President Donald Trump gave automakers a one-month exemption from tariffs on goods originating from Mexico and Canada, which had been implemented the day before. \n⏰Get expert insights and actionable trade alerts from veteran investing experts and …",
    "link": "https://biztoc.com/x/b3de4946fa6c81f4",
    "timestamp": "2025-03-17T22:15:23Z"
  },
  {
    "title": "Trump, Associates Net $390 Million Payday From World Liberty Token Sale",
    "description": "The DeFi project announced Monday it closed a $550 million sale of WLFI, its governance token. After expenses, 75% of that goes to Trump and his partners.",
    "link": "https://decrypt.co/310250/trump-390-million-payday-world-liberty-token-sale",
    "timestamp": "2025-03-17T22:15:02Z"
  }
]