[
  {
    "title": "Memphis and Portland, Ore. brace for troops. Why Chicago might be next",
    "description": "Illinois Gov. JB Pritzker said the Department of Homeland Security has requested for 100 military personnel to help protect ICE agents and facilities in his state.",
    "link": "https://www.npr.org/2025/09/30/nx-s1-5557337/chicago-portland-memphis-national-guard",
    "timestamp": "2025-09-30T10:10:28Z"
  },
  {
    "title": "Shutdown would add to Hawaii’s economic woes | Honolulu Star-Advertiser",
    "description": "Federal workers in Hawaii who are worried about a shutdown of the federal government that could begin at 6:01 p.m. today (12:01 a.m EDT Wednesday) are likely already cutting back on local spending, adding to Hawaii’s already sluggish economy, according to the…",
    "link": "https://www.staradvertiser.com/2025/09/30/hawaii-news/shutdown-would-add-to-hawaiis-economic-woes/",
    "timestamp": "2025-09-30T10:08:56Z"
  },
  {
    "title": "Wall Street Journal Slams ‘Suffering’ Caused By Key Trump Policy",
    "description": "The newspaper made a damning prediction, too.",
    "link": "https://www.huffpost.com/entry/wall-street-journal-suffering-donald-trump_n_68dba62ee4b003b6c8dbfeb2",
    "timestamp": "2025-09-30T10:08:11Z"
  },
  {
    "title": "Tata bought slabs from rival British Steel as it sought to beat Trump tariff plans",
    "description": "Sale of product from Scunthorpe plant came when Indian-owned firm tried to avoid US rules that were later dropped\nBusiness live – latest updates\nBritish Steel has made the unusual move to sell slabs of metal to its rival Tata Steel, as the latter sought ways …",
    "link": "https://biztoc.com/x/ec0759e0b1476f13",
    "timestamp": "2025-09-30T10:07:13Z"
  },
  {
    "title": "Hamas weighs its response to Trump's Gaza peace proposal",
    "description": "DUBAI/CAIRO (Reuters) -A U.S.-sponsored ceasefire proposal for Gaza on Tuesday was hinging on Hamas's response to the 20-point plan which President Donald...",
    "link": "https://ca.news.yahoo.com/hamas-weighs-response-trumps-gaza-100625105.html",
    "timestamp": "2025-09-30T10:06:25Z"
  },
  {
    "title": "US government faces brain drain as 154,000 federal workers exit this week",
    "description": "WASHINGTON (Reuters) -More than 150,000 federal employees will leave the U.S. government payroll this week after accepting buyouts - the largest single-year ...",
    "link": "https://www.yahoo.com/news/articles/us-government-faces-brain-drain-100606151.html",
    "timestamp": "2025-09-30T10:06:06Z"
  },
  {
    "title": "New US$100,000 H-1B visa fee does not apply to H-1B1 visa available to Singaporeans: US Embassy",
    "description": "The H-1B1 visa is a special variant of the H-1B visa that is only available to citizens of Singapore and Chile.",
    "link": "https://www.channelnewsasia.com/world/new-us100000-h-1b-visa-fee-does-not-apply-h-1b1-visas-available-singaporeans-us-embassy-5377346",
    "timestamp": "2025-09-30T10:05:12Z"
  },
  {
    "title": "States to end nutrition education programs after Trump cuts",
    "description": "WASHINGTON/SAN FRANCISCO (Reuters) -On a warm September day in the courtyard of a San Francisco senior living community, a dozen residents shake their hips...",
    "link": "https://www.yahoo.com/news/articles/states-end-nutrition-education-programs-100421519.html",
    "timestamp": "2025-09-30T10:04:21Z"
  },
  {
    "title": "The Real Violent Extremists Are The Freaks Who Run The US Empire",
    "description": "I think it’s worth remembering this as the empire harnesses the emotional hysteria around Charlie Kirk’s death to whip up a moral panic about violent radical leftists in the United States in order to justify increased authoritarian measures to stomp out polit…",
    "link": "https://www.activistpost.com/the-real-violent-extremists-are-the-freaks-who-run-the-us-empire/",
    "timestamp": "2025-09-30T10:04:00Z"
  },
  {
    "title": "Trump's Gaza peace plan wins global support as world awaits Hamas response",
    "description": "President Donald Trump's peace plan was met with cautious optimism Tuesday by leaders across the Middle East and the world, but others were more skeptical about the proposal — and whether it would be welcomed by Hamas.",
    "link": "https://www.nbcnews.com/world/middle-east/trump-gaza-peace-plan-israel-support-hamas-response-rcna234620",
    "timestamp": "2025-09-30T10:03:30Z"
  },
  {
    "title": "PMO: Summit invitation to Trump reflects Asean mandate, not policy endorsement",
    "description": "KUALA LUMPUR: The participation of United States President Donald Trump and other world leaders at the 47th Asean Summit to be held in Kuala Lumpur in October is part of the diplomatic mandate entrusted to Malaysia. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/09/30/pmo-summit-invitation-to-trump-reflects-asean-mandate-not-policy-endorsement",
    "timestamp": "2025-09-30T10:02:00Z"
  },
  {
    "title": "Opinion: Canada’s innovation paradox is a business problem and being 'nice' won’t fix it",
    "description": "Alice de Koning and Yrjo Koskinen: Canadian niceness is a virtue in civic life; in business, it can blur into comfortable mediocrity",
    "link": "https://financialpost.com/technology/canada-innovation-paradox-business-problem-being-nice-wont-fix-it",
    "timestamp": "2025-09-30T10:00:33Z"
  },
  {
    "title": "How much digital sovereignty does the UK have left?",
    "description": "Policy experts and CIOs alike are fretting over the extent to which the UK tech sector is beholden to US tech giants.",
    "link": "https://www.techmonitor.ai/policy/digital-sovereignty-uk-future/",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "The Stunning Reversal in U.S.-India Relations",
    "description": "Isaac Chotiner interviews Milan Vaishnav on the tensions between India and the United States and the role that Donald Trump and Narendra Modi play in the fraying relationship.",
    "link": "https://www.newyorker.com/news/q-and-a/the-stunning-reversal-in-us-india-relations",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "The New Deal Masterpieces Threatened by Trump’s D.C. Downsizing",
    "description": "Last Friday, the Voice of America’s Washington staff—a skeletal remnant of its workforce because President Donald Trump has fired everybody else or placed them on administrative leave—received a text from H.R. stating that they’ll be relocated “as quickly as …",
    "link": "https://newrepublic.com/article/201055/ben-shahn-wpa-art-trump",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "Erika Kirk isn't in the Epstein files as a 'recruiter'",
    "description": "Erika Kirk, widow of conservative activist Charlie Kirk, recruited victims for convicted sex offender Jeffrey Epstein and had her husband killed to keep him quiet about her ties to Epstein.",
    "link": "https://www.snopes.com//fact-check/erika-kirk-recruit-victims-epstein/",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "Zohran Mamdani and the Future of American Politics",
    "description": "NYC’s mayoral candidate has Kennedy-like charisma, a global profile, and nepo baby instincts. He is also a proud democratic socialist who has both Donald Trump and the left-wing establishment in a lather. Is Zohran Mamdani the future of American politics—or a…",
    "link": "https://www.vanityfair.com/news/story/zohran-mamdani-and-the-future-of-american-politics",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "Losing the shutdown in the best way is Democrats' only realistic goal",
    "description": "Monday's White House meeting with President Trump and Democrats Chuck Schumer and Hakeem Jeffries didn't appear to help the country avoid a government shutdown.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/chuck-schumer-hakeem-jeffries-meeting-trump-was-never-going-stop-shutd-rcna233994",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "The Slow and Steady passive portfolio update: Q3 2025",
    "description": "Are you watching Donald Trump?\nThe post The Slow and Steady passive portfolio update: Q3 2025 appeared first on Monevator.",
    "link": "https://monevator.com/the-slow-and-steady-passive-portfolio-update-q3-2025/",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "Venezuelan President Nicolas Maduro expands his powers in case US attacks",
    "description": "Venezuela's President Nicolas Maduro has signed a decree to give himself increased security powers should the US military enter the country.",
    "link": "https://news.sky.com/story/venezuelan-president-nicolas-maduro-expands-his-powers-in-case-us-attacks-13441463",
    "timestamp": "2025-09-30T09:58:00Z"
  },
  {
    "title": "Trump admin may defund inspector general watch group",
    "description": "United States President Donald Trump's administration is planning to stop funding the Council of the Inspectors General on Integrity and Efficiency (CIGIE), the oversight group comprising 72 inspector...",
    "link": "https://biztoc.com/x/36aab5b01fc68998",
    "timestamp": "2025-09-30T09:56:11Z"
  },
  {
    "title": "Long Read: How a new European ideological patriotism could be a counter for Trumpism",
    "description": "Donald Trump’s second administration has upturned many long-established approaches to political decision-making. Peter Nedergaard writes that Trump’s challenges to these approaches have included moving from a regime based on free trade to high tariffs, fiscal…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/09/30/long-read-how-a-new-european-ideological-patriotism-could-be-a-counter-for-trumpism/",
    "timestamp": "2025-09-30T09:54:18Z"
  },
  {
    "title": "Entire Ukrainian family killed in Russian drone strike, officials say",
    "description": "The bodies of two young boys and their parents were recovered from their destroyed home in the Sumy region, rescuers say.",
    "link": "https://www.bbc.co.uk/news/articles/cdxqdpgznzeo",
    "timestamp": "2025-09-30T09:53:28Z"
  },
  {
    "title": "Gold Slips as Traders Take Stock of Record-Breaking Rally",
    "description": "The precious metal jumped more than 10% this month.  “Following a non-stop rally throughout September, I suspect we are seeing some end-of-month profit...",
    "link": "https://finance.yahoo.com/news/gold-hits-fresh-record-us-044125912.html",
    "timestamp": "2025-09-30T09:53:23Z"
  },
  {
    "title": "Hamas yet to respond on Trump’s Gaza plan",
    "description": "Hamas had yet to respond Tuesday to Donald Trump on his plan for Gaza, while Prime Minister Benjamin Netanyahu said the Israeli military would stay in most of the territory after he gave the US president his backing. The plan calls for a ceasefire, release of…",
    "link": "https://www.digitaljournal.com/world/hamas-yet-to-respond-on-trumps-gaza-plan/article",
    "timestamp": "2025-09-30T09:52:20Z"
  },
  {
    "title": "Bennett criticizes: 'Apology to Qatar was difficult but necessary'",
    "description": "Former PM Naftali Bennett praised President Donald Trump’s role in securing hostage release but blasted Israel for the deal, calling it a heavy price and a grave failure.",
    "link": "https://www.israelnationalnews.com/news/415621",
    "timestamp": "2025-09-30T09:48:00Z"
  },
  {
    "title": "Tariffs, tech and trouble: Gurmeet Chadha sees bubble in US stocks",
    "description": "Concerns over stretched US tech valuations are mounting as Donald Trump revives tariff-driven trade policies. Gurmeet Chadha warns of a potential “big bubble,” citing digital sovereignty and declining global dependence on American platforms, threatening futur…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariffs-tech-and-trouble-gurmeet-chadha-sees-bubble-in-us-stocks/articleshow/124231439.cms",
    "timestamp": "2025-09-30T09:46:54Z"
  },
  {
    "title": "US to deport hundreds of Iranians after deal with Tehran: official",
    "description": "\"In the first step, they decided to deport 120 Iranians who entered the US illegally, most of whom through Mexico.\"",
    "link": "https://nypost.com/2025/09/30/us-news/us-to-deport-hundreds-of-iranians-after-deal-with-tehran-iranian-official-says/",
    "timestamp": "2025-09-30T09:46:22Z"
  },
  {
    "title": "CNBC Daily Open: Fed's path ahead could be clouded if U.S. government shuts down",
    "description": "After a seemingly unproductive meeting between lawmakers and U.S. President Donald Trump on Monday, the chances that the country's government will be shutting down two days later appear to be growing.\nIf the U.S. government shuts down, it's essentially like a…",
    "link": "https://biztoc.com/x/34180c029a559cb0",
    "timestamp": "2025-09-30T09:44:50Z"
  },
  {
    "title": "‘Cruel joke’: How Indian H-1B dreams are crash-landing after Trump fee hike",
    "description": "Thousands of young Indians have mapped their adult lives with the aim of moving to the US, plans that now lie in tatters. Meghna Gupta* had planned it all – a master’s degree by 23, a few years of working in India, and then a move to the United States before …",
    "link": "https://freerepublic.com/focus/f-chat/4343430/posts",
    "timestamp": "2025-09-30T09:37:54Z"
  },
  {
    "title": "China Backs Trump's Peace Plan To End Gaza War",
    "description": "US administration led by President Donald Trump introduced a 20 point peace plan on Sept. 29 for Israel and Hamas. The plan was accepted by Israeli Prime Minister Benjamin Netanyahu. If it comes into the effect, it will result in full withdrawal of Israel Def…",
    "link": "https://www.ndtvprofit.com/markets/china-backs-trumps-peace-plan-to-end-gaza-war",
    "timestamp": "2025-09-30T09:37:04Z"
  },
  {
    "title": "EA $55 Billion Deal Might Bring Massive Layoffs Between AI Pivot and $20 Billion of Debt",
    "description": "Just a few days after the original rumor, Electronic Arts (EA) confirmed yesterday that it is indeed getting a $55 billion buyout from a Consortium of investors that includes PIF, Saudi Arabia's sovereign investment fund, Silver Lake (an American global priva…",
    "link": "https://wccftech.com/ea-55-billion-deal-might-bring-massive-layoffs-ai-pivot-20-billion-debt/",
    "timestamp": "2025-09-30T09:35:00Z"
  },
  {
    "title": "Senators Draft Plan to Curb Hidden L-1 Visa Migration Program",
    "description": "A bipartisan duo in the Senate has drafted an unprecedented bill to curb the little-known but huge L-1 visa program, which allows multinationals to import hundreds of thousands of white collar workers while paying them home country wages.\nThe post Senators Dr…",
    "link": "https://www.breitbart.com/economy/2025/09/30/senators-draft-plan-to-curb-hidden-l-1-visa-migration-program/",
    "timestamp": "2025-09-30T09:32:10Z"
  },
  {
    "title": "Boeing’s scramble to ramp up production mustn’t go with reduced regulatory oversight",
    "description": "Boeing is racing to roll out more aircraft in response to demand, but the FAA is prematurely returning some certification authority to the company. Given its record on aircraft safety—especially the 737 Max scandal—this could be risky.",
    "link": "https://www.livemint.com/opinion/online-views/boeing-production-ramp-up-faa-oversight-737-max-airworthiness-certificates-dreamliner-kelly-ortberg-accident-us-america-11759132642310.html",
    "timestamp": "2025-09-30T09:30:10Z"
  },
  {
    "title": "This laughable J6 rewrite isn't funny when you see the sinister motive behind it",
    "description": "January 6 was one of the single most devastating days in American history. In the months and years after, Donald Trump and MAGA manufactured a nearly inconceivable whitewashing of the whole insurrection. Now, Trump and his supporters are engineering a direct …",
    "link": "https://www.rawstory.com/raw-investigates/fbi-january-6/",
    "timestamp": "2025-09-30T09:30:02Z"
  },
  {
    "title": "Argentina's soy exports to China soar amid US bailout, fuelling tensions in Trump camp",
    "description": "Argentina's soybean export orders surged to a seven-year high this month as Chinese importers bought millions of tonnes of the staple crop during a brief...",
    "link": "https://finance.yahoo.com/news/argentinas-soy-exports-china-soar-093000455.html",
    "timestamp": "2025-09-30T09:30:00Z"
  },
  {
    "title": "China welcomes Trump's peace plan to end war in Gaza",
    "description": "China has endorsed US President Donald Trump's Gaza peace plan, advocating an immediate ceasefire and the release of 20 Israeli hostages. The 20-point proposal details a phased withdrawal, Hamas disarmament, and a temporary \"technocratic\" governance for Gaza …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-welcomes-trumps-peace-plan-to-end-war-in-gaza/articleshow/124231021.cms",
    "timestamp": "2025-09-30T09:24:34Z"
  },
  {
    "title": "Schumer and Democrats find themselves in new role as shutdown looms: Analysis",
    "description": "With roles reversed from previous shutdowns, Democrats could bear the brunt.",
    "link": "https://abcnews.go.com/Politics/schumer-democrats-find-new-role-shutdown-looms-analysis/story?id=126038340",
    "timestamp": "2025-09-30T09:21:23Z"
  },
  {
    "title": "Entire Ukrainian family killed in Russian drone strike, officials say",
    "description": "The bodies of two young boys and their parents were recovered from their destroyed home in the Sumy region, rescuers say.",
    "link": "https://www.bbc.com/news/articles/cdxqdpgznzeo",
    "timestamp": "2025-09-30T09:20:57Z"
  },
  {
    "title": "Zohran Mamdani Issues Defiant Response To Donald Trump's Funding Threat",
    "description": "The New York City mayoral candidate promised to do one thing.",
    "link": "https://www.huffpost.com/entry/mamdami-trump-threat_n_68db8d20e4b0d2dd3157c3e2",
    "timestamp": "2025-09-30T09:20:47Z"
  },
  {
    "title": "Would a government shutdown hurt the economy? Experts explain",
    "description": "The federal government is hurtling toward a possible shutdown Tuesday night.",
    "link": "https://abcnews.go.com/Business/government-shutdown-hurt-economy-experts-explain/story?id=126038221",
    "timestamp": "2025-09-30T09:13:48Z"
  },
  {
    "title": "US government on brink of first shutdown in almost 7 years amid partisan standoff in Congress",
    "description": "Senate Democrats have voted down a Republican bill to keep funding the government, putting it on a path to a shutdown after midnight Wednesday",
    "link": "https://www.wftv.com/news/politics/democrats-vote-down/ARRSJUUOQNARBAVTQ7O2CXE3CI/",
    "timestamp": "2025-09-30T09:13:38Z"
  },
  {
    "title": "Scoop: Vance, Trump Jr. tighten ties to Charlie Kirk's group",
    "description": "Vice President Vance and Donald Trump Jr. are planning to bolster Turning Point USA — the conservative group co-founded by the late Charlie Kirk — by appearing at its events in the coming months, Axios has learned. \nWhy it matters: The move further solidifies…",
    "link": "https://biztoc.com/x/fb97a8a1aaead795",
    "timestamp": "2025-09-30T09:11:16Z"
  },
  {
    "title": "PVR Inox, Ranbir Kapoor-backed firm's shares slide 5% as Trump slaps 100% tariff on foreign films",
    "description": "US President Donald Trump's announcement of a 100% tariff on foreign-made films sent shockwaves through the global entertainment industry. Indian firms PVR Inox and Prime Focus saw their shares decline 5% following the protectionist move. This decision, part …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/pvr-inox-ranbir-kapoor-backed-firms-shares-slide-5-as-trump-slaps-100-tariff-on-foreign-films/articleshow/124230587.cms",
    "timestamp": "2025-09-30T09:06:50Z"
  },
  {
    "title": "Donald Trump announces timber and furniture tariffs in national security probe",
    "description": "Latest levies to rise to as high as 50% for countries that do not strike trade deals with US",
    "link": "https://www.irishtimes.com/business/2025/09/30/donald-trump-announces-timber-and-furniture-tariffs-in-national-security-probe/",
    "timestamp": "2025-09-30T09:05:19Z"
  },
  {
    "title": "An American Friend: The Trump-Appointed Diplomat Accused of Shielding El Salvador’s President From Law Enforcement",
    "description": "by T. Christian Miller, Sebastian Rotella, Kirsten Berg and Brett Murphy \n \n\n \n Leer en español.\n\n \n\n \n\n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n …",
    "link": "https://www.propublica.org/article/ambassador-ronald-johnson-nayib-bukele-trump-el-salvador",
    "timestamp": "2025-09-30T09:05:00Z"
  },
  {
    "title": "DFLP official: Trump plan 'a blatant attack on the Palestinian political entity as a whole'",
    "description": "Arkan Badr, a Member of the Political Bureau of the Democratic Front for the Liberation of Palestine (DFLP) terror organization, criticized US President Donald Trump's plan to end the war in Gaza.\"Trump's plan aims to eradicate the entire Palestinian people, …",
    "link": "https://www.israelnationalnews.com/flashes/667440",
    "timestamp": "2025-09-30T09:03:43Z"
  },
  {
    "title": "Trump Gaza Plan Wins Support of Arab, Muslim World -- and Palestinian Authority",
    "description": "President Donald Trump's proposal to end the Gaza war has not only won support from Israel, but also from the Arab and Muslim world -- and from the Palestinian Authority, which has opposed his plans in the past.\nThe post Trump Gaza Plan Wins Support of Arab, …",
    "link": "https://www.breitbart.com/middle-east/2025/09/30/trump-gaza-plan-wins-support-of-arab-muslim-world-and-palestinian-authority/",
    "timestamp": "2025-09-30T09:02:33Z"
  },
  {
    "title": "MORNING GLORY: October is the best month for baseball",
    "description": "The Cleveland Guardians made baseball history with their September comeback against Detroit Tigers, setting up a dramatic playoff matchup at Progressive Field.",
    "link": "https://www.foxnews.com/opinion/morning-glory-october-best-month-baseball",
    "timestamp": "2025-09-30T09:00:51Z"
  },
  {
    "title": "Top GOP senator steps up efforts to protect Republican majority in 2026 midterms",
    "description": "Arkansas Senator Tom Cotton backs Representative Ashley Hinson for Iowa's open Senate seat as Republicans work to defend their 53-47 majority in 2026.",
    "link": "https://www.foxnews.com/politics/top-gop-senator-steps-up-efforts-protect-republican-majority-2026-midterms",
    "timestamp": "2025-09-30T09:00:35Z"
  },
  {
    "title": "Kennedy Center president criticizes Jimmy Kimmel's one-sided late-night programming approach",
    "description": "Ric Grenell commented the on business decisions behind the return of \"Jimmy Kimmel Live!\" to the air after ABC sidelined the program earlier this month.",
    "link": "https://www.foxnews.com/media/kennedy-center-president-criticizes-jimmy-kimmels-one-sided-late-night-programming-approach",
    "timestamp": "2025-09-30T09:00:25Z"
  },
  {
    "title": "Trump’s Casino Jackpot",
    "description": "The Trump Organization is one step away from making $175 million once a casino license for Bally’s is approved, Noah Shachtman reports. Helping make it happen was Mayor Eric Adams.",
    "link": "http://nymag.com/intelligencer/article/trump-ballys-casino-payday-eric-adams.html",
    "timestamp": "2025-09-30T09:00:19Z"
  },
  {
    "title": "Five races to watch with 5 weeks to go until Election Day 2025",
    "description": "Gubernatorial races in New Jersey and Virginia, a mayoral showdown in New York City, California's Prop 50, and Pennsylvania's Supreme Court contests top the ballot box on Election Day 2025",
    "link": "https://www.foxnews.com/politics/five-races-watch-5-weeks-go-until-election-day-2025",
    "timestamp": "2025-09-30T09:00:19Z"
  },
  {
    "title": "Calling in the generals: What Hegseth’s top-brass meeting should — and shouldn't — mean",
    "description": "The rare mass gathering of U.S. flag officers at Quantico is an opportunity to clarify civilian-military relations as leaders plan -course corrections.",
    "link": "https://www.foxnews.com/opinion/calling-generals-what-hegseths-top-brass-meeting-should-shouldnt-mean",
    "timestamp": "2025-09-30T09:00:14Z"
  },
  {
    "title": "YouTube to pay Trump €21m to settle lawsuit over account suspension",
    "description": "Platform blamed its suspension of US president’s channel after Capitol riot on pressure from Joe Biden",
    "link": "https://www.irishtimes.com/world/us/2025/09/30/youtube-to-pay-trump-21m-to-settle-lawsuit-over-account-suspension/",
    "timestamp": "2025-09-30T09:00:02Z"
  },
  {
    "title": "LIZ PEEK: Trump White House fired up about King Coal’s return to power",
    "description": "The Trump administration plans to spend $625 million modernizing coal plants and reversing policies that transition away from coal production and mining.",
    "link": "https://www.foxnews.com/opinion/liz-peek-trump-white-house-fired-up-about-king-coals-return-power",
    "timestamp": "2025-09-30T09:00:02Z"
  },
  {
    "title": "Trump’s UN Speech: The Climate Emperor Now Stands Exposed",
    "description": "Like the boy in the fairytale, Trump has dared to speak the truth that others feared to acknowledge. The climate emperor stands exposed, and the world now faces a choice: continue to applaud the illusion or embrace the reality that affordable, reliable energy…",
    "link": "https://wattsupwiththat.com/2025/09/30/trumps-un-speech-the-climate-emperor-now-stands-exposed/",
    "timestamp": "2025-09-30T09:00:00Z"
  },
  {
    "title": "Health Care’s Employment Growth Clouded by Immigration Crackdown, Medicaid Cuts",
    "description": "The health care sector has accounted for nearly half of this year’s U.S. job growth. But economists say immigration crackdowns and Medicaid cuts could create a drag on the sector just as more workers are needed to support a growing population of older America…",
    "link": "https://kffhealthnews.org/news/article/health-care-employment-growth-immigration-crackdown-medicaid-cuts/",
    "timestamp": "2025-09-30T09:00:00Z"
  },
  {
    "title": "The US may be heading toward a drone-filled future",
    "description": "On Thursday, I published a story about the police-tech giant Flock Safety selling its drones to the private sector to track shoplifters. Keith Kauffman, a former police chief who now leads Flock’s drone efforts, described the ideal scenario: A security team a…",
    "link": "https://www.technologyreview.com/2025/09/30/1124470/the-us-may-be-heading-toward-a-drone-filled-future/",
    "timestamp": "2025-09-30T09:00:00Z"
  },
  {
    "title": "A major Democratic demand in the shutdown fight could help the GOP in the midterms",
    "description": "To avoid a government shutdown, Democrats are urging President Donald Trump and Republicans to agree to extend Obamacare subsidies that expire at the end of the year.",
    "link": "https://www.nbcnews.com/politics/congress/democratic-demands-shutdown-fight-obamacare-republicans-midterms-rcna234454",
    "timestamp": "2025-09-30T09:00:00Z"
  },
  {
    "title": "Japan’s outgoing Prime Minister Ishiba and South Korea’s Lee hold final summit in Busan",
    "description": "SEOUL, South Korea (AP) — Japan’s outgoing Prime Minister Shigeru Ishiba held a summit Tuesday with South Korean President Lee Jae Myung, as U.S. President Donald Trump’s trade wars have pushed the two often-feuding Asian neighbors to seek to improve coordina…",
    "link": "https://financialpost.com/pmn/japans-outgoing-prime-minister-ishiba-and-south-koreas-lee-hold-final-summit-in-busan",
    "timestamp": "2025-09-30T08:59:35Z"
  },
  {
    "title": "Japan's outgoing Prime Minister Ishiba and South Korea's Lee hold final summit in Busan",
    "description": "Japan’s outgoing Prime Minister Shigeru Ishiba held a summit Tuesday with South Korean President Lee Jae Myung, as U.S. President Donald Trump’s trade wars...",
    "link": "https://www.yahoo.com/news/articles/japans-outgoing-prime-minister-ishiba-085704597.html",
    "timestamp": "2025-09-30T08:57:04Z"
  },
  {
    "title": "독재자 트럼프 셧다운 앞두고 광역 관세",
    "description": "Federal Reserve Bank of Cleveland President Beth Hammack said US inflation is “too high” and for her forecast, “probably won’t get back to target for another one to two years\" https://t.co/BCg1HksGt0 pic.twitter.com/0XlXxeaXES— Bloomberg TV (@BloombergTV) Sep…",
    "link": "https://ryueyes11.tistory.com/511893",
    "timestamp": "2025-09-30T08:53:57Z"
  },
  {
    "title": "Trump’s H1B Policy Hits Indian Students Hard",
    "description": "Several Indian students who secured job offers in the United States have seen their offers withdrawn after US President Donald Trump announced the $1,00,000 H-1B visa policy. Under the new rule, US employers who are looking to sponsor H-1B visas should pay a …",
    "link": "https://freerepublic.com/focus/f-chat/4343428/posts",
    "timestamp": "2025-09-30T08:52:30Z"
  },
  {
    "title": "Think beyond gold, silver is shining well for investors: Will it reach Rs 3 lakh in 5 years?",
    "description": "Silver prices have risen by 54% in just 1 year. In the last 5 years, the white metal has given 19.10% annualised return. The gold-silver ratio is also near 80. Amid such a scenario, how soon can silver price reach Rs 3 lakh/kg? With the silver price scaling n…",
    "link": "https://economictimes.indiatimes.com/wealth/invest/think-beyond-gold-silver-is-shining-well-for-investors-will-it-reach-rs-3-lakh-in-5-years/articleshow/124230229.cms",
    "timestamp": "2025-09-30T08:51:42Z"
  },
  {
    "title": "Why Starmer wants to keep talking about Farage",
    "description": "The Labour leader insists his battle with Reform UK represents a different kind of political fight.",
    "link": "https://www.bbc.com/news/articles/cge20pnx1rqo",
    "timestamp": "2025-09-30T08:46:30Z"
  },
  {
    "title": "Arab and Muslim states back Trump Gaza plan, say ready to work with U.S. to finalize deal",
    "description": "Foreign ministers from seven countries across Asia and North Africa said President Trump's plan must create a path toward a just peace on the basis of the two-state solution, under which Gaza will be integrated with the West Bank in a Palestinian state",
    "link": "https://www.haaretz.com/israel-news/2025-09-30/ty-article/.premium/arab-and-muslim-states-back-trump-gaza-plan-say-ready-to-work-with-u-s-to-finalize-deal/00000199-9988-df33-a5dd-9dff60a10000",
    "timestamp": "2025-09-30T08:45:35Z"
  },
  {
    "title": "Gaza peace plan: Trump the businessman’s big imprint; for India, reasons for relief, caution",
    "description": "What is the new Gaza peace plan? Why is Tony Blair being talked about again? With Trump welcoming Pakistan's role, what should New Delhi watch out for?",
    "link": "https://indianexpress.com/article/explained/explained-global/gaza-peace-plan-trump-businessman-india-pakistan-10280037/",
    "timestamp": "2025-09-30T08:42:02Z"
  },
  {
    "title": "Tánaiste urges Hamas to accept Trump’s Gaza peace proposal",
    "description": "US president’s 20-point draft deal includes his plans to chair international board of peace",
    "link": "https://www.irishtimes.com/politics/2025/09/30/tanaiste-urges-hamas-to-accept-trumps-gaza-peace-proposal/",
    "timestamp": "2025-09-30T08:39:39Z"
  },
  {
    "title": "EU will have new climate targets by COP30 summit, Ursula von der Leyen says",
    "description": "The European Union will set 2035 and 2040 emissions-cutting targets for the COP30 climate summit in November, after missing a UN deadline. Ursula von der Leyen acknowledged the need for pragmatism amid member state divisions and global competition. Uncertaint…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-will-have-new-climate-targets-by-cop30-summit-ursula-von-der-leyen-says/articleshow/124230149.cms",
    "timestamp": "2025-09-30T08:38:34Z"
  },
  {
    "title": "Asean Summit: No point in turning Trump away, says PM's press sec",
    "description": "PETALING JAYA: Turning away Donald Trump from the 47th Asean Summit next month would not resolve any issue, says Tunku Nashrul Abaidah. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/09/30/asean-summit-no-point-in-turning-trump-away-says-pm039s-press-sec",
    "timestamp": "2025-09-30T08:35:00Z"
  },
  {
    "title": "Key points from US peace proposal for Gaza",
    "description": "The White House has released a 20-point peace proposal that calls for an immediate ceasefire in Gaza, an exchange of hostages held by Hamas for Palestinian prisoners held by Israel, a staged Israeli withdrawal from Gaza, and Hamas disarmament.",
    "link": "https://www.rte.ie/news/middle-east/2025/0930/1536020-20-point-plan/",
    "timestamp": "2025-09-30T08:32:26Z"
  },
  {
    "title": "The US dollar dominates the global trade. But China’s renminbi is catching up as an invoice currency",
    "description": "The US dollar still dominates global trade invoicing, but cracks are appearing. China’s renminbi is slowly gaining space, driven by geopolitics and trade realignments. Could this gradual shift reshape the global currency order or is the greenback’s dominance …",
    "link": "https://www.livemint.com/opinion/columns/us-dollar-china-yuan-renminbi-trade-invoicing-argentina-currency-crisis-japan-javier-milei-federal-reserve-trump-xi-11759130879952.html",
    "timestamp": "2025-09-30T08:30:09Z"
  },
  {
    "title": "10 years after the Paris Agreement, countries are still missing climate deadlines",
    "description": "Meanwhile, emissions have continued to rise since the landmark treaty was signed.",
    "link": "https://grist.org/international/ndc-deadlines-paris-agreement-cop30/",
    "timestamp": "2025-09-30T08:30:00Z"
  },
  {
    "title": "Zohran Madmani: 'NYC should comply with arrest warrants against Netanyahu'",
    "description": "Zohran declared, 'I think that our city should uphold the warrants that the International Criminal Court issues, whether for Benjamin Netanyahu or Valdimir Putin.'",
    "link": "https://www.israelnationalnews.com/news/415619",
    "timestamp": "2025-09-30T08:28:04Z"
  },
  {
    "title": "Hamas Yet To Respond On Trump's Gaza Plan",
    "description": "Hamas had yet to respond Tuesday to Donald Trump on his plan for Gaza, while Prime Minister Benjamin Netanyahu said the Israeli military would stay in most of the territory after he gave the US president his backing.",
    "link": "https://www.ibtimes.com.au/hamas-yet-respond-trumps-gaza-plan-1860657",
    "timestamp": "2025-09-30T08:27:25Z"
  },
  {
    "title": "YouTube pays $24.5M to settle Trump lawsuit over account suspension",
    "description": "YouTube will pay $24.5 million to resolve a lawsuit by US President Donald Trump over his 2021 account suspension, marking the final settlement with major tech firms.",
    "link": "https://www.israelnationalnews.com/news/415618",
    "timestamp": "2025-09-30T08:27:23Z"
  },
  {
    "title": "Hamas Yet To Respond On Trump's Gaza Plan",
    "description": "Hamas had yet to respond Tuesday to Donald Trump on his plan for Gaza, while Prime Minister Benjamin Netanyahu said the Israeli military would stay in most of the territory after he gave the US president his backing.",
    "link": "https://www.ibtimes.com/hamas-yet-respond-trumps-gaza-plan-3784828",
    "timestamp": "2025-09-30T08:27:07Z"
  },
  {
    "title": "JB Pritzker says ICE ‘harassing people for not being white’",
    "description": "Illinois Governor JB Pritzker accuses U.S. Immigration and Customs Enforcement of harassing people for not being white during Chicago operations.",
    "link": "https://www.foxnews.com/politics/jb-pritzker-says-ice-harassing-people-not-being-white",
    "timestamp": "2025-09-30T08:26:54Z"
  },
  {
    "title": "China Reacts to Donald Trump's New Tariffs",
    "description": "Trump imposed a range of new and higher tariffs, including on furniture.",
    "link": "https://biztoc.com/x/6ef87e6f51ae4491",
    "timestamp": "2025-09-30T08:26:28Z"
  },
  {
    "title": "What’s in Trump’s 20-point peace plan for Gaza?",
    "description": "Immediate end to war, restoration of aid, Gaza envisaged as ‘deradicalized terror-free zone’, no governance role for Hamas – yet little detail on execution of key points",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/30/whats-in-trumps-20-point-peace-plan-for-gaza/",
    "timestamp": "2025-09-30T08:25:18Z"
  },
  {
    "title": "Merz: Trump’s plan is the best chance to end the war in Gaza",
    "description": "\"The suffering of the hostages and their families must be stopped immediately\", the German Chancellor said after meeting with relatives of the German hostages\nThe post Merz: Trump’s plan is the best chance to end the war in Gaza appeared first on ProtoThema E…",
    "link": "https://en.protothema.gr/2025/09/30/merz-trumps-plan-is-the-best-chance-to-end-the-war-in-gaza/",
    "timestamp": "2025-09-30T08:23:21Z"
  },
  {
    "title": "Gold hits record, stocks mixed as US shutdown looms",
    "description": "Gold hit another record Tuesday, while equity markets were mixed as traders prepared for a possible US government shutdown that could affect the release of...",
    "link": "https://finance.yahoo.com/news/stocks-rise-gold-hits-record-024213568.html",
    "timestamp": "2025-09-30T08:22:47Z"
  },
  {
    "title": "Trump releases Gaza ‘peace plan’",
    "description": "The Gaza ‘peace plan’ agreed by the US and Israel calls for an immediate halt to military operations and outlines future governance Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625624-trump-gaza-peace-plan/",
    "timestamp": "2025-09-30T08:19:46Z"
  },
  {
    "title": "Why the US government might shut down and what to know",
    "description": "If no deal is struck by the end of Tuesday, the US will have its first shutdown in nearly seven years.",
    "link": "https://www.bbc.com/news/articles/crrj1znp0pyo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-30T08:18:24Z"
  },
  {
    "title": "Venezuela’s Maduro ready to declare state of emergency if US attacks",
    "description": "Maduro also gives himself special powers to mobilise army and give it authority over public services and oil industry.",
    "link": "https://www.aljazeera.com/news/2025/9/30/venezuelas-maduro-says-ready-to-declare-state-of-emergency-if-us-attacks",
    "timestamp": "2025-09-30T08:17:03Z"
  },
  {
    "title": "Stephen Colbert Taunts Trump With An Absolutely Bananas Reminder",
    "description": "The \"Late Show\" host tried to make sense of the president's latest conspiracy theory.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-medbeds_n_68db7044e4b07ad4cec70d98",
    "timestamp": "2025-09-30T08:15:27Z"
  },
  {
    "title": "Ukraine wants conflict with Russia to end this year – foreign minister",
    "description": "Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/625621-sibiga-conflict-end-sanctions/",
    "timestamp": "2025-09-30T08:14:17Z"
  },
  {
    "title": "We can build fighter jet without Germany: France's Dassault",
    "description": "Cergy-Pontoise, France (AFP) Sept 23, 2025\n\n\n The head of French defence company Dassault said on Tuesday his firm could build the future European fighter jet by itself, as tensions persist with Germany over the multi-billion-euro project. \n\nThe Future Combat…",
    "link": "https://www.spacedaily.com/reports/We_can_build_fighter_jet_without_Germany_Frances_Dassault_999.html",
    "timestamp": "2025-09-30T08:13:43Z"
  },
  {
    "title": "Trump to attend meeting with hundreds of senior U.S. military officers",
    "description": "Washington DC (UPI) Sep 28, 2025 \n\n\n President Donald Trump said Sunday that he will attend a meeting organized by Defense Secretary Peter Hegseth that aims to gather hundreds of senior military officers near Washington this week. \n Trump confirmed his Tuesda…",
    "link": "https://www.spacewar.com/reports/Trump_to_attend_meeting_with_hundreds_of_senior_US_military_officers_999.html",
    "timestamp": "2025-09-30T08:13:43Z"
  },
  {
    "title": "FMCSA official reveals bolstered vetting of ELD providers on the way",
    "description": "FMCSA Senior Policy Advisor Michael Hampton met with truckers at the Guilty by Association Truck Show and talked ELDs/hours, broker transparency, parking, CDL training and more.",
    "link": "https://www.overdriveonline.com/regulations/article/15768233/fmcsa-official-pledged-better-vetting-of-eld-providers",
    "timestamp": "2025-09-30T08:09:03Z"
  },
  {
    "title": "Finnish president welcomes Trump's Gaza plan; government faces confidence vote over Palestine policy",
    "description": "President Alexander Stubb says he is ready to recognise Palestinian statehood, but the government is split over the issue. It faces an interpellation on its Palestine policy on Tuesday.",
    "link": "https://yle.fi/a/74-20185729",
    "timestamp": "2025-09-30T08:05:11Z"
  }
]