[
  {
    "title": "Higher tariffs to take effect August 1, U.S. Commerce Secretary Lutnick says",
    "description": "U.S. President Donald Trump on Sunday said some trade deals had been made with trading partners and letters would go out to other countries notifying them of higher tariff rates.\nCommerce Secretary Howard Lutnick told reporters that the higher tariffs would t…",
    "link": "https://biztoc.com/x/acac5e492e569744",
    "timestamp": "2025-07-06T21:58:07Z"
  },
  {
    "title": "Trump lies as GOP protects their stocks while ripping health care from 17 million Americans - NewsBreak",
    "description": "Trump lies as GOP protects their stocks while ripping health care from 17 million Americans - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4090926780672-trump-lies-as-gop-protects-their-stocks-while-ripping-health-care-from-17-million-americans?s=a2&amp;share_destination_id=MTk3NDMyNTQxLTE3NTE4Mzg3ODQ2NDk%3D&amp;pd=0DMPDpUv&amp;hl=en_US&amp;send_time=1751838784&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.17.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v9%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q3-v8",
    "timestamp": "2025-07-06T21:53:43Z"
  },
  {
    "title": "‘Texans Are Tough’: Cornyn Praises Heroic Rescues, Mourns Losses Amid Ongoing Flood Dangers",
    "description": "Texas is unified in prayer and rescue efforts as the flooding hazard remains, Sen. John Cornyn shared on Fox News’ “Sunday Morning Futures” this morning.... Read More\nThe post ‘Texans Are Tough’: Cornyn Praises Heroic Rescues, Mourns Losses Amid Ongoing Flood…",
    "link": "https://www.dailysignal.com/2025/07/06/texans-are-tough-cornyn-praises-heroic-rescues-mourns-losses-amid-ongoing-flood-dangers/",
    "timestamp": "2025-07-06T21:48:29Z"
  },
  {
    "title": "What to expect from Netanyahu and Trump’s high-stakes White House meeting",
    "description": "Israeli Prime Minister Benjamin Netanyahu is set to meet with President Donald Trump at the White House Monday. Netanyahu left Israel Sunday for the two leaders’ first in-person meeting since last month’s joint U.S.-Israeli assault on Iranian nuclear faciliti…",
    "link": "https://biztoc.com/x/a191582f559a0afb",
    "timestamp": "2025-07-06T21:46:57Z"
  },
  {
    "title": "US Commerce Secretary Lutnick says tariffs take effect on August 1",
    "description": "U.S. President Donald Trump on Sunday said some trade deals had been made with trading partners and letters would go out to other countries notifying them of...",
    "link": "https://www.yahoo.com/news/us-commerce-secretary-lutnick-says-214043339.html",
    "timestamp": "2025-07-06T21:40:43Z"
  },
  {
    "title": "'Bad, bad, bad day': GOP lawmakers panicky as Trump 'threatens House majority'",
    "description": "Republican lawmakers helped Donald Trump secure a win on his so-called \"big, beautiful bill,\" and now they're facing the consequences, according to a new report.Politico on Sunday published a piece called, \"Republicans just cut Medicaid. Will it cost them con…",
    "link": "https://www.rawstory.com/trump-threatens-slim-house-majority/",
    "timestamp": "2025-07-06T21:40:04Z"
  },
  {
    "title": "What to expect from Netanyahu and Trump’s high-stakes White House meeting",
    "description": "Israeli Prime Minister Benjamin Netanyahu is set to meet with President Donald Trump at the White House Monday. Netanyahu left Israel Sunday for the two leaders’ first in-person meeting since last month’s joint U.S.-Israeli assault on Iranian nuclear faciliti…",
    "link": "https://www.pbs.org/newshour/show/what-to-expect-from-netanyahu-and-trumps-high-stakes-white-house-meeting",
    "timestamp": "2025-07-06T21:40:03Z"
  },
  {
    "title": "Should John Brennan Be in Prison?",
    "description": "Former CIA top dog John Brennan is the poster child for the catastrophically widespread corruption of our intelligence apparatus, or at least of our intelligence apparatus before Donald Trump became president again. If this were indeed a land of impartial jus…",
    "link": "https://freerepublic.com/focus/f-news/4327193/posts",
    "timestamp": "2025-07-06T21:39:58Z"
  },
  {
    "title": "Death toll in central Texas flash floods rises to 70 as sheriff says 11 campers remain missing",
    "description": "The death toll from flash floods that raged through central Texas rose to 70 after searchers found more bodies.",
    "link": "https://richmond.com/news/nation-world/weather/article_8aa79e07-67e6-5269-be17-b60a7358c53a.html",
    "timestamp": "2025-07-06T21:39:00Z"
  },
  {
    "title": "Death toll in central Texas flash floods rises to 70 as sheriff says 11 campers remain missing",
    "description": "The death toll from flash floods that raged through central Texas rose to 70 after searchers found more bodies.",
    "link": "https://roanoke.com/news/nation-world/weather/article_b2f36dee-482d-5c08-bf33-3dad49f085d8.html",
    "timestamp": "2025-07-06T21:39:00Z"
  },
  {
    "title": "Netanyahu to Visit White House as Peace Talks With Hamas Continue",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAmid the ongoing Israel-Hamas war, Israeli Prime Minister Benjamin Netanyahu is headed to the United States for talks on Monday with President Donald Trump.\nThe visit has been in the works for over a week, wit…",
    "link": "https://biztoc.com/x/6b878125828cb6f3",
    "timestamp": "2025-07-06T21:35:18Z"
  },
  {
    "title": "NYC voters torn over Zohran Mamdani’s big plans to hike taxes on wealthy, corporations: poll",
    "description": "Democratic mayoral nominee Zohran Mamdani's tax the rich proposals to fund his spending plans gets mixed grades from likely general election voters despite widespread agreement that New York City is struggling with an affordability crisis, a new survey claims.",
    "link": "https://nypost.com/2025/07/06/us-news/nyc-voters-torn-over-zohran-mamdanis-big-plans-to-hike-taxes-on-wealthy-corporations-poll/",
    "timestamp": "2025-07-06T21:35:11Z"
  },
  {
    "title": "Yangzijiang Financial jumps over 22%; STI hits all-time high of 4,019",
    "description": "Property plays and construction counters also rallied. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/yangzijiang-financial-jumps-over-22-sti-hits-all-time-high-of-4019",
    "timestamp": "2025-07-06T21:34:44Z"
  },
  {
    "title": "Time to Say It Out Loud: The Trump Tax Cuts Worked",
    "description": "In politics, good news is rarely treated as news at all. For the past seven years, the Trump tax cuts have been maligned, distorted, and largely ignored, especially when the data didn’t fit the preferred narrative. Yet here we are in 2025, with President Dona…",
    "link": "https://freerepublic.com/focus/f-news/4327192/posts",
    "timestamp": "2025-07-06T21:34:32Z"
  },
  {
    "title": "TikTok is splitting into two apps for America",
    "description": "TikTok is making a separate app for American users.",
    "link": "https://www.phonearena.com/news/tiktok-splitting-into-two-apps-for-america_id172007",
    "timestamp": "2025-07-06T21:32:22Z"
  },
  {
    "title": "Young U.S. college graduates face employment crisis",
    "description": "Over two years, Rebecca Atkins filed more than 250 job applications, and felt like every one was going into a gaping chasm -- one opened by the highest unemployment rate for recent college graduates in the United States in more than a decade. &quot;It was ext…",
    "link": "https://japantoday.com/category/business/%27into-a-void%27-young-us-college-graduates-face-employment-crisis",
    "timestamp": "2025-07-06T21:28:21Z"
  },
  {
    "title": "MICHAEL GLASSNER: Socialist Fantasy, Urban Decay: What New York’s Mayoral Race Means For America",
    "description": "The rise of Zohran Mamdani in New York City politics may seem like a local curiosity — just another far-left firebrand in a deep-blue city. But his nomination as the Democratic standard-bearer for mayor is a canary in the coal mine. The Democratic Party’s fli…",
    "link": "https://dailycaller.com/2025/07/06/opinion-what-new-yorks-mayoral-race-means-for-america-michael-glassner/",
    "timestamp": "2025-07-06T21:28:19Z"
  },
  {
    "title": "Rescuers find 2 girls in tree, 30-feet up, near Comfort [Texas]",
    "description": "Two girls were rescued alive from a tree nearly 30 feet high Sunday in the flood zone between Comfort and Homillus Road in Center Point, according to multiple sources, as search teams also recovered four bodies in the area. The dramatic rescue occurred closer…",
    "link": "https://freerepublic.com/focus/f-news/4327191/posts",
    "timestamp": "2025-07-06T21:28:05Z"
  },
  {
    "title": "Exclusive: John Brennan May Face Perjury Issues After CIA Director Ratcliffe's Review Uncovers Russia Hoax Testimony Problems",
    "description": "Former CIA Director John Brennan may be exposed to perjury problems after current CIA Director John Ratcliffe released an internal review of the agency's Russia hoax materials, Breitbart News has learned exclusively.\nThe post Exclusive: John Brennan May Face …",
    "link": "https://www.breitbart.com/politics/2025/07/06/exclusive-john-brennan-may-face-perjury-issues-after-cia-director-ratcliffes-review-uncovers-russia-hoax-testimony-problems/",
    "timestamp": "2025-07-06T21:27:21Z"
  },
  {
    "title": "Med Students Say Big, Beautiful Bill's Student Loan Cap Means They Won't Be Able to Finish School As Experts Predict Massive Doctor Shortage by 2037",
    "description": "Due to dramatic cuts to federal student loan programs in Trump's OBBB, many prospective medical students say they can no longer afford to attend medical school.",
    "link": "https://www.ibtimes.com/med-students-say-big-beautiful-bill-student-loan-cap-wont-finish-med-school-doctor-shortage-3777773",
    "timestamp": "2025-07-06T21:27:01Z"
  },
  {
    "title": "Netanyahu to Visit White House as Peace Talks With Hamas Continue",
    "description": "This marks the first meeting between President Donald Trump and Israeli Prime Minister Benjamin Netanyahu since the war with Iran.",
    "link": "https://www.newsweek.com/netanyahu-visit-white-house-peace-talks-hamas-continue-2095222",
    "timestamp": "2025-07-06T21:25:50Z"
  },
  {
    "title": "Crew abandon ship under attack in Red Sea off Yemen, UK maritime agency says",
    "description": "The crew of a ship set on fire in an attack in the Red Sea on Sunday abandoned the vessel as it took on water, a British maritime agency and a security firm said, in an assault that one of them said bore the hallmarks of the Houthi militant group.…",
    "link": "https://japantoday.com/category/world/crew-abandon-ship-under-attack-in-red-sea-off-yemen-uk-maritime-agency-says",
    "timestamp": "2025-07-06T21:25:41Z"
  },
  {
    "title": "트럼프 관세 협상 전략은 불확실성 확대",
    "description": "Mukesh Ambani's family is enjoying celebrity status in Washington, writes @andymukherjee70. The Indian billionaire is pivoting his petrochemicals empire toward US ethane, opportunistically replacing Chinese buyers (via @opinion) https://t.co/4sWcuyZcUY— Bloom…",
    "link": "https://ryueyes11.tistory.com/511716",
    "timestamp": "2025-07-06T21:25:40Z"
  },
  {
    "title": "BRICS leaders in Rio defend multilateralism under attack",
    "description": "Leaders of the BRICS group of developing nations condemned attacks on Iran, Gaza and Kashmir during their summit on Sunday, presenting the bloc as a defender of multilateral diplomacy while indirectly criticizing U.S. military and trade policy. With forums su…",
    "link": "https://japantoday.com/category/world/brics-leaders-in-rio-defend-multilateralism-under-attack",
    "timestamp": "2025-07-06T21:25:28Z"
  },
  {
    "title": "Hezbollah leader refuses to disarm until Israel withdraws from southern Lebanon",
    "description": "Hezbollah leader Naim Kassem reiterated Sunday the militant group’s refusal to lay down its weapons before Israel withdraws from all of southern Lebanon and stops its airstrikes. He spoke in a video address, as thousands gathered in Beirut’s southern suburbs …",
    "link": "https://japantoday.com/category/world/hezbollah-leader-refuses-to-disarm-until-israel-withdraws-from-southern-lebanon",
    "timestamp": "2025-07-06T21:25:21Z"
  },
  {
    "title": "Israel sends delegation to Qatar for Gaza talks ahead of Netanyahu trip to U.S.",
    "description": "An Israeli delegation left for Qatar on Sunday for talks on a possible Gaza hostage and ceasefire deal, an Israeli official said, hours before Prime Minister Benjamin Netanyahu was due to head to Washington to meet U.S. President Donald Trump. Public pressure…",
    "link": "https://japantoday.com/category/world/israel-sends-delegation-to-qatar-for-gaza-talks-ahead-of-netanyahu-trip-to-us",
    "timestamp": "2025-07-06T21:25:15Z"
  },
  {
    "title": "Russia and Ukraine trade drone strikes as Kyiv signs deals to boost drone production",
    "description": "Russia and Ukraine struck each other with hundreds of drones on Sunday, throwing Russian air travel in disarray, shortly after Ukrainian President Volodymyr Zelenskyy announced deals with Western partners that would allow Kyiv to scale up drone production. Ph…",
    "link": "https://japantoday.com/category/world/russia-and-ukraine-trade-drone-strikes-disrupting-air-travel",
    "timestamp": "2025-07-06T21:25:04Z"
  },
  {
    "title": "U.S. tariffs to kick in Aug 1, barring trade deals: Bessent",
    "description": "U.S. tariffs will kick in on August 1 if trading partners from Taiwan to the European Union do not strike deals with Washington, Treasury Secretary Scott Bessent said Sunday. The rates will &quot;boomerang back&quot; to the sometimes very high levels that Pre…",
    "link": "https://japantoday.com/category/world/us-tariffs-to-kick-in-aug-1-barring-trade-deals-treasury-secretary",
    "timestamp": "2025-07-06T21:24:56Z"
  },
  {
    "title": "Death toll from Texas floods reaches 69, including 21 children",
    "description": "The death toll from catastrophic floods in Texas reached at least 69 on Sunday, including at least 21 children, as the search for girls missing from a summer camp entered a third day. Texas Governor Greg Abbott, speaking at a press conference on Sunday aftern…",
    "link": "https://japantoday.com/category/world/death-toll-from-texas-floods-reaches-69-including-21-children",
    "timestamp": "2025-07-06T21:24:50Z"
  },
  {
    "title": "‘Leguizamo Does America’ Returns With Perfect Timing Amid Anti-Latino Rhetoric and Deportations Under Trump",
    "description": "Nothing will ever deport the truth about Latinos; not even Donald Trump. In a year clouded by political vitriol and the steady erasure of Latino narratives, the return of John Leguizamo’s vital and entertaining series “Leguizamo Does America” becomes the cult…",
    "link": "https://variety.com/2025/tv/columns/leguizamo-does-america-season-2-latino-representation-1236448270/",
    "timestamp": "2025-07-06T21:11:37Z"
  },
  {
    "title": "Bessent hints at trade talk extensions",
    "description": "Major U.S. trading partners hurried over the weekend to secure trade deals or lobby for extra time, while Treasury Secretary Scott Bessent indicated that some countries lacking an agreement by the deadline Wednesday will have the option of a three-week extens…",
    "link": "https://www.bostonherald.com/2025/07/06/bessent-hints-at-trade-talk-extensions/",
    "timestamp": "2025-07-06T21:06:45Z"
  },
  {
    "title": "Mexico braced for Trump’s mass deportations. They haven’t happened.",
    "description": "Trump has largely shut down the southwest border by ending asylum programs and deploying troops. But those moves have shrunk the pool of easy-to-deport migrants.TIJUANA, Mexico — When President Donald Trump pledged to launch the “largest deportation operation…",
    "link": "https://freerepublic.com/focus/f-news/4327188/posts",
    "timestamp": "2025-07-06T21:06:39Z"
  },
  {
    "title": "‘Doom-Mongering’: WH Economist Says Summers, CBO Wrong on Trump’s Big Beautiful Bill and ‘It’s Not the First Time’",
    "description": "The Economic Council Chair said that there's always \"fear-mongering\" and \"doom-mongering\" but it often doesn't pan out, dismissing Larry Summers.\nThe post ‘Doom-Mongering’: WH Economist Says Summers, CBO Wrong on Trump’s Big Beautiful Bill and ‘It’s Not the F…",
    "link": "https://www.mediaite.com/politics/doom-mongering-wh-economist-says-summers-cbo-wrong-on-trumps-big-beautiful-bill-and-its-not-the-first-time/",
    "timestamp": "2025-07-06T21:06:21Z"
  },
  {
    "title": "Albanese pressured to act on antisemitism after Melbourne attacks",
    "description": "A series of attacks in Melbourne over the weekend has placed pressure on the Albanese government to do more to combat antisemitism. \nThe post Albanese pressured to act on antisemitism after Melbourne attacks appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/07/07/albanese-tony-burke-antisemitism-attacks-interest-rates-china/",
    "timestamp": "2025-07-06T21:01:12Z"
  },
  {
    "title": "Texas flood death toll rises to 70 including 21 children, search for survivors continues",
    "description": "Texas flood death toll rises to 70 including 21 children, search for survivors continues7news.com.au",
    "link": "https://7news.com.au/news/texas-flood-death-toll-rises-to-70-including-21-children-amid-search-for-missing-c-19271448",
    "timestamp": "2025-07-06T21:00:38Z"
  },
  {
    "title": "Gov. Beshear weighing 2028 Democratic bid for presidency",
    "description": "Andy Beshear, the Democratic governor of Kentucky, explained why he was considering launching a 2028 bid for the presidency on Sunday during an interview.",
    "link": "https://www.foxnews.com/media/gov-beshear-weighing-2028-democratic-bid-presidency",
    "timestamp": "2025-07-06T21:00:33Z"
  },
  {
    "title": "Populist Rage and Woke Folly: Le Figaro Interviews Mario Loyola",
    "description": "On June 12, 2025, the leading French newspaper Le Figaro published an extended interview with Heritage Foundation senior fellow Mario Loyola. In “Populist Rage and... Read More\nThe post Populist Rage and Woke Folly: Le Figaro Interviews Mario Loyola appeared …",
    "link": "https://www.dailysignal.com/2025/07/06/populist-rage-and-woke-folly-le-figaro-interviews-mario-loyola/",
    "timestamp": "2025-07-06T21:00:00Z"
  },
  {
    "title": "EPA Suspends over 140 Toxic Employees Who Wrote Letter Denouncing Trump Policies",
    "description": "The best part of this story is two fold. First, these individuals have done a good job of self-identif[ying] themselves as fifth columnists inside the Trump administration, making it easier to get rid of them.",
    "link": "https://wattsupwiththat.com/2025/07/06/epa-suspends-over-140-toxic-employees-who-wrote-letter-denouncing-trump-policies/",
    "timestamp": "2025-07-06T21:00:00Z"
  },
  {
    "title": "‘Improved’ Grok criticizes Democrats and Hollywood’s ‘Jewish executives’ | TechCrunch",
    "description": "On Friday morning, Elon Musk declared, “We have improved @Grok significantly. You should notice a difference when you ask Grok questions.”",
    "link": "https://techcrunch.com/2025/07/06/improved-grok-criticizes-democrats-and-hollywoods-jewish-executives/",
    "timestamp": "2025-07-06T20:58:44Z"
  },
  {
    "title": "Israel to carry out airstrikes on Yemen, issues evacuation orders",
    "description": "Israeli military to target three ports and power station",
    "link": "https://www.irishtimes.com/world/middle-east/2025/07/06/israel-to-carry-out-airstrikes-on-yemen-issues-evacuation-orders/",
    "timestamp": "2025-07-06T20:57:34Z"
  },
  {
    "title": "Meidas Interview: Ben Folds on Trump's Takeover of the Kennedy Center",
    "description": "MeidasTouch host Ben Meiselas reports on the impact of Donald Trump’s disastrous cuts across all sectors—from cancer research to weather forecasting to the arts. Meiselas interviews legendary musician Ben Folds, who resigned from his lead advisory position at…",
    "link": "https://littlegreenfootballs.com/article/54737_Meidas_Interview-_Ben_Folds_on",
    "timestamp": "2025-07-06T20:54:20Z"
  },
  {
    "title": "5 things to watch on the ASX 200 on Monday",
    "description": "Here's what to expect on the local market on Monday.\nThe post 5 things to watch on the ASX 200 on Monday appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/07/07/5-things-to-watch-on-the-asx-200-on-monday-07-july-2025/",
    "timestamp": "2025-07-06T20:49:09Z"
  },
  {
    "title": "U.S. border city residents put their 'Elbows Up' for Canada amid trade war",
    "description": "Several hundred people sang O Canada and waved across the international border during a rally held Saturday in Ogdensburg, N.Y.",
    "link": "https://www.cbc.ca/news/canada/ottawa/u-s-border-city-residents-put-their-elbows-up-for-canada-amid-trade-war-1.7578367",
    "timestamp": "2025-07-06T20:45:42Z"
  },
  {
    "title": "Death Toll From Texas Floods Rises To 67 As 11 Campers Remain Missing",
    "description": "President Donald Trump signed a disaster declaration to send emergency relief as families and search teams continue to look for missing loved ones.",
    "link": "https://www.huffpost.com/entry/death-toll-texas-floods-67-campers-missing_n_686a987ae4b03fde5adbf423",
    "timestamp": "2025-07-06T20:43:50Z"
  },
  {
    "title": "The message that Herzog shouldn’t be conveying",
    "description": "The Israeli president’s official role is to represent the face of the country abroad and foster national unity at home. But his partisanship is getting in the way.",
    "link": "https://www.israelnationalnews.com/news/411233",
    "timestamp": "2025-07-06T20:32:42Z"
  },
  {
    "title": "The Department of Education Is in Limbo. Let's Kill It.",
    "description": "Congress should now turn its attention to abolishing the unnecessary federal education bureaucracy.",
    "link": "https://reason.com/2025/07/07/the-department-of-education-is-in-limbo-lets-kill-it/",
    "timestamp": "2025-07-06T20:32:22Z"
  },
  {
    "title": "‘2,000 Days of Death!’ Larry Summers Rips Trump Signing Big Beautiful Bill as July 4 Deadly and ‘Shameful Act’",
    "description": "\"In my 70 years, I’ve never been as embarrassed for my country on July 4th,\" said Summers in blasting Trump's \"Big Beautiful Bill\" as dangerous and deadly.\nThe post ‘2,000 Days of Death!’ Larry Summers Rips Trump Signing Big Beautiful Bill as July 4 Deadly an…",
    "link": "https://www.mediaite.com/politics/2000-days-of-death-larry-summers-rips-trump-signing-big-beautiful-bill-as-july-4-deadly-and-shameful-act/",
    "timestamp": "2025-07-06T20:32:20Z"
  },
  {
    "title": "Texas Hill Country’s Lack of Flash Flood Protection Exposed by July 4th Disaster",
    "description": "Ignoring the realities of the reasons behind the Guadalupe River flood disaster to craft the \"Trump Katrina\" narrative is as dangerous as it is shameful.\nThe post Texas Hill Country’s Lack of Flash Flood Protection Exposed by July 4th Disaster first appeared …",
    "link": "https://legalinsurrection.com/2025/07/texas-hill-countrys-lack-of-flash-flood-protection-exposed-by-july-4th-disaster/",
    "timestamp": "2025-07-06T20:30:26Z"
  },
  {
    "title": "Dana Carvey on ‘SNL’ Joe Biden Impression: ‘It Was a Delicate Thing’",
    "description": "The comedy star discussed taking on the role during the consequential 2024 election and his approach to portraying a president who, per Carvey, was \"compromised mentally — I mean, it was obvious.\"",
    "link": "https://www.indiewire.com/news/general-news/dana-carvey-snl-joe-biden-impression-delicate-1235136937/",
    "timestamp": "2025-07-06T20:30:00Z"
  },
  {
    "title": "Trump Signs Order Raising Park Fees for Foreign Tourists",
    "description": "President Donald Trump signed an executive order Thursday to increase entry fees to U.S. national parks for international visitors in order to “improve services, access,... Read More\nThe post Trump Signs Order Raising Park Fees for Foreign Tourists appeared f…",
    "link": "https://www.dailysignal.com/2025/07/06/new-fee-targets-international-visitors/",
    "timestamp": "2025-07-06T20:30:00Z"
  },
  {
    "title": "Kyiv signs deals to boost drone production as Russia and Ukraine trade strikes",
    "description": "Russia and Ukraine struck each other with hundreds of drones on Sunday, throwing Russian air travel in disarray, shortly after Ukrainian President Volodymyr Zelenskyy announced deals with Western partners that would allow Kyiv to scale up drone production.",
    "link": "https://www.pbs.org/newshour/world/kyiv-signs-deals-to-boost-drone-production-as-russia-and-ukraine-trade-strikes",
    "timestamp": "2025-07-06T20:27:53Z"
  },
  {
    "title": "TikTok building new version of app ahead of expected US sale, The Information reports",
    "description": "TikTok is building a new version of its app for users in the United States ahead of a planned sale of the app to a group of investors, The Information reported on Sunday, citing unnamed sources. This comes as U.S. President Donald Trump said on Friday he will…",
    "link": "https://freerepublic.com/focus/f-news/4327184/posts",
    "timestamp": "2025-07-06T20:27:39Z"
  },
  {
    "title": "Israel and Hamas begin ceasefire talks in Qatar as Netanyahu heads to Washington",
    "description": "The latest round of indirect negotiations come as Israeli Prime Minister Benjamin Netanyahu heads to Washington.",
    "link": "https://www.bbc.co.uk/news/articles/crenx445170o",
    "timestamp": "2025-07-06T20:27:17Z"
  },
  {
    "title": "Gaza ceasefire talks begin in Qatar as Netanyahu heads to Washington",
    "description": "Hamas said it has responded to the latest ceasefire proposal positively but there are still gaps to be bridged.",
    "link": "https://www.bbc.com/news/articles/crenx445170o",
    "timestamp": "2025-07-06T20:27:17Z"
  },
  {
    "title": "Report: Obama was the sleeper cell, Mamdani is the detonator to collapse America",
    "description": "'The fruits of his deception are visible for anyone who dares to see through the smokescreen of media propaganda and elite manipulation'",
    "link": "https://www.wnd.com/2025/07/report-obama-was-sleeper-cell-mamdani-is-detonator/",
    "timestamp": "2025-07-06T20:23:21Z"
  },
  {
    "title": "'Worst thing Trump could imagine': Ex-aide warns of president's 'ferocious' plan",
    "description": "Donald Trump was just hit with the worst news he could imagine, and his response will be \"ferocious,\" according to an ex-insider.Lev Parnas, a former insider of the Trump administration who said he \"saw how he thinks\" and \"how he operates,\" recently called ou…",
    "link": "https://www.rawstory.com/worst-thing-trump-musk-ferocious/",
    "timestamp": "2025-07-06T20:20:35Z"
  },
  {
    "title": "TikTok Planning U.S. Version Of App Ahead Of Sale – Report",
    "description": "TikTok is purportedly building a new version of its platform for users in the United States ahead of a planned sale to a group of investors, per technology publication The Information, which cited anonymous sources for the report. As it stands, the Chinese in…",
    "link": "http://deadline.com/2025/07/tiktok-united-states-new-app-version-sale-1236450595/",
    "timestamp": "2025-07-06T20:19:47Z"
  },
  {
    "title": "Rosie O’Donnell Blames Trump for Causing Texas Flooding: Put the U.S. ‘In So Much Danger’",
    "description": "Rosie O’Donnell, who self-deported to Ireland, cast blame on President Donald Trump for the devasting flash-flooding that has occurred in Texas after torrential rainfall led to the Guadalupe River rising roughly 26 feet within 45 minutes. In a video on TikTok…",
    "link": "https://freerepublic.com/focus/f-chat/4327182/posts",
    "timestamp": "2025-07-06T20:17:48Z"
  },
  {
    "title": "Trump officials keep up tariff pressure but hint at flexibility on deadline",
    "description": "\"There are deadlines, and there are things that are close, so maybe things will push back past the deadline or maybe they won’t.\"",
    "link": "https://fortune.com/2025/07/06/trump-tariffs-deadline-july-9-flexibility-trade-talks-hassett-miran/",
    "timestamp": "2025-07-06T20:12:19Z"
  },
  {
    "title": "Musk says he's forming a new political party after split with Trump",
    "description": "Elon Musk said he’s carrying out his threat to form a new political party.",
    "link": "https://abcnews.go.com/Politics/wireStory/musk-forming-new-political-party-after-split-trump-123517477",
    "timestamp": "2025-07-06T20:04:20Z"
  },
  {
    "title": "Dustin Poirier, Max Holloway, Sean O’Malley open as betting favorites to headline UFC White House event",
    "description": "Dustin Poirier, Max Holloway, and Sean O’Malley open as betting favorites to headline the proposed UFC White House event in 2026.",
    "link": "https://www.mmafighting.com/2025/7/6/24462585/dustin-poirier-max-holloway-sean-omalley-open-as-betting-favorites-to-headline-ufc-white-house-event",
    "timestamp": "2025-07-06T20:00:00Z"
  },
  {
    "title": "The End of Patriotism?",
    "description": "America has a major problem: nearly half of Americans—42%— don’t believe in America. According to Gallup, just 58% of adults say they are either “extremely”... Read More\nThe post The End of Patriotism? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/06/the-end-of-patriotism/",
    "timestamp": "2025-07-06T20:00:00Z"
  },
  {
    "title": "Musk forms new party after split with Trump",
    "description": "Elon Musk said he's carrying out his threat to form a new political party after his fissure with President Donald Trump, announcing the America Party in response to the president's sweeping tax cuts law.",
    "link": "https://www.bostonherald.com/2025/07/06/musk-forms-new-party-after-split-with-trump/",
    "timestamp": "2025-07-06T19:57:01Z"
  },
  {
    "title": "Ex-Trump Lawyer Sent This Message To Elon Musk After Feud With Donald Trump Erupted",
    "description": "In the midst of a public spat with President Donald Trump, Elon Musk, CEO of Tesla Inc., has received an unexpected offer of support from Michael Cohen, Trump’s former personal attorney.\nWhat Happened: Last month Cohen reached out to Musk following a series o…",
    "link": "https://biztoc.com/x/57e29bef28005bf0",
    "timestamp": "2025-07-06T19:54:32Z"
  },
  {
    "title": "Disaster declared as flood death toll rises in Texas",
    "description": "Children from a Christian summer camp are among those still missing after flash flooding killed dozens of people in Texas.",
    "link": "https://www.abc.net.au/news/2025-07-07/texas-flooding-death-toll-rises/105501108",
    "timestamp": "2025-07-06T19:46:05Z"
  },
  {
    "title": "CHRIS JOHNSON And AIDEN BUZZETTI: The Left’s Prophesy Of Environmental Apocalypse Demands Revival On The Right",
    "description": "Today’s Left has a religious aversion to the most normal aspects of life: having kids, driving a car, charging a phone, or grilling burgers in the backyard. If you are wondering why your college freshman is convinced that everything you are doing—and, in fact…",
    "link": "https://dailycaller.com/2025/07/06/opinion-the-lefts-prophesy-of-environmental-apocalypse-demands-revival-on-the-right-chris-johnson-and-aiden-buzzetti/",
    "timestamp": "2025-07-06T19:32:34Z"
  },
  {
    "title": "Elections 2026: Will Republicans Counter Democrat Disinformation Campaign Against Big Beautiful Bill?",
    "description": "To hold the House, Republicans will have to expose the Democrats’ disinformation campaign and set the record straight.\nThe post Elections 2026: Will Republicans Counter Democrat Disinformation Campaign Against Big Beautiful Bill? first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/07/elections-2026-will-republicans-counter-democrat-disinformation-campaign-against-big-beautiful-bill/",
    "timestamp": "2025-07-06T19:30:17Z"
  },
  {
    "title": "All Blacks v France: What to make of a weird test to open All Blacks season - Phil Gifford",
    "description": "The All Blacks-France opener had a weird, bizarre air to it from start to finish.",
    "link": "https://www.nzherald.co.nz/sport/rugby/all-blacks/all-blacks-v-france-what-to-make-of-a-weird-test-to-open-all-blacks-season-phil-gifford/J5HT3HUB7ZGHVE4R5L2LZRYUMU/",
    "timestamp": "2025-07-06T19:30:00Z"
  },
  {
    "title": "US tariffs on European goods threaten to shake up the world's largest trade relationship",
    "description": "America’s largest trade partner is awaiting word on whether U.S. President Donald Trump will impose punishing tariffs on its goods.",
    "link": "https://www.wishtv.com/news/business/us-tariffs-on-european-goods-threaten-to-shake-up-the-worlds-largest-trade-relationship/",
    "timestamp": "2025-07-06T19:30:00Z"
  },
  {
    "title": "Fighting Socialism with a Socialist",
    "description": "The New York Democratic Party has finally found someone it wants to fight. No, not Donald Trump are you kidding me. Nope, it’s Zohran Mamdani. Have to support the landlords after all. My favorite version of this came from Tom Suozzi, who rants about Mamdami’s…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/fighting-socialism-with-a-socialist",
    "timestamp": "2025-07-06T19:24:00Z"
  },
  {
    "title": "What Prevents Trump From Implementing The \"Chainsaw\" Approach Like Milei?",
    "description": "What Prevents Trump From Implementing The \"Chainsaw\" Approach Like Milei?\n \nAuthored by Daniel Lacalle,\nIn recent months, many libertarians have criticised Donald Trump’s economic policies, arguing that he is not implementing drastic public spending cuts like…",
    "link": "https://biztoc.com/x/787b6f7fc3a8a6e6",
    "timestamp": "2025-07-06T19:21:33Z"
  },
  {
    "title": "How America’s economy is dodging disaster",
    "description": "How America’s economy is dodging disaster\nIt is astonishingly dynamic, even under the weight of tariffs\nEconomic doom beckoned after President Donald Trump announced his “Liberation Day” tariffs on April 2nd. Stocks crashed; forecasters predicted a recession …",
    "link": "https://biztoc.com/x/847b658cb4a4ffa5",
    "timestamp": "2025-07-06T19:21:22Z"
  },
  {
    "title": "FLOP: Without Russia’s Putin and China’s XI, the BRICS Summit in Rio de Janeiro Is Emptied, Reflecting Brazil’s Lula da Silva Disastrous Foreign Policy",
    "description": "A few days ago, British magazine The Economist ran a piece called: ‘Brazil’s president is losing clout abroad and unpopular at home’, highlighting how Lula da Silva’s foreign policy is all wrong, and how he has become a very unpopular figurehead inside Brazil…",
    "link": "https://www.thegatewaypundit.com/2025/07/flop-without-russias-putin-chinas-xi-brics-summit/",
    "timestamp": "2025-07-06T19:20:35Z"
  },
  {
    "title": "Rosie O'Donnell Blames Trump for Causing Texas Flooding: Put the U.S. 'In So Much Danger'",
    "description": "Rosie O'Donnell, who self-deported to Ireland, cast blame on President Donald Trump for the devasting flash-flooding that has occurred in Texas after torrential rainfall led to the Guadalupe River rising roughly 26 feet within 45 minutes.\nThe post Rosie O’Don…",
    "link": "https://www.breitbart.com/entertainment/2025/07/06/rosie-odonnell-blames-trump-for-causing-texas-flooding-put-the-u-s-in-so-much-danger/",
    "timestamp": "2025-07-06T19:10:20Z"
  },
  {
    "title": "Michael Douglas Says America Is 'Flirting with Autocracy'",
    "description": "Actor Michael Douglas is down on the United States and claims that the country has become an \"autocracy\" because people are going into politics just for the money.\nThe post Michael Douglas Says America Is ‘Flirting with Autocracy’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/07/06/michael-douglas-says-america-is-flirting-with-autocracy/",
    "timestamp": "2025-07-06T19:05:57Z"
  },
  {
    "title": "Who is Vaibhav Taneja, Indian-origin Tesla CFO declared Treasurer of Elon Musk's party?",
    "description": "Elon Musk, once close to Donald Trump, is reportedly distancing himself. He has launched the America Party. A form circulating online shows the party's headquarters in Hawthorne. Tesla CFO Vaibhav Taneja is listed as the treasurer. Taneja, an Indian-origin ex…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/who-is-vaibhav-taneja-indian-origin-tesla-cfo-declared-treasurer-of-elon-musks-party/articleshow/122283928.cms",
    "timestamp": "2025-07-06T19:05:16Z"
  },
  {
    "title": "Here's What Happened Today: Sunday",
    "description": "Fianna Fáil take action in attempt to boost housing supply, Texas death roll rises, and Sinn Féin TD’s case against ‘super juniors’ at Cabinet to be heard in the High Court.",
    "link": "https://www.thejournal.ie/news-fix-06-07-25-6755125-Jul2025/",
    "timestamp": "2025-07-06T19:00:37Z"
  },
  {
    "title": "Olympic champion dons Trump costume for straw race",
    "description": "The former triathlete took part in the 50th Oxenhope Straw Race on Sunday.",
    "link": "https://www.bbc.com/news/articles/c24vld9nerpo",
    "timestamp": "2025-07-06T19:00:34Z"
  },
  {
    "title": "Musk Says Party Paperwork Is ‘False’ After MAGA Melt Down",
    "description": "Former “First Buddy” Elon Musk’s plan to wade back into politics with a new political party has roiled MAGA influencers across X. However, despite reports...",
    "link": "https://www.thedailybeast.com/maga-melts-down-as-elon-musk-files-paperwork-for-america-party/",
    "timestamp": "2025-07-06T18:56:52Z"
  },
  {
    "title": "Dallas Cowboys, Houston Texans, NFL pool together donations for Texas flooding recovery efforts",
    "description": "At least 70 are dead after devastating floods ravaged central Texas",
    "link": "https://www.cbssports.com/nfl/news/dallas-cowboys-houston-texans-nfl-pool-together-donations-for-texas-flooding-recovery-efforts/",
    "timestamp": "2025-07-06T18:56:03Z"
  },
  {
    "title": "Tragedy in Pictures: Texas Flooding Damage as Waters Recede",
    "description": "Flash floods that hit central Texas devastated Hill Country during the Fourth of July holiday weekend, killing dozens of people.",
    "link": "https://www.newsweek.com/tragedy-pictures-texas-flooding-damage-water-recede-2095207",
    "timestamp": "2025-07-06T18:55:31Z"
  },
  {
    "title": "Musk forms new political party after split with Trump over president's signature tax cuts law (Michelle L. Price/Associated Press)",
    "description": "Michelle L. Price / Associated Press:\nMusk forms new political party after split with Trump over president's signature tax cuts law  —  BRIDGEWATER, N.J. (AP) — Elon Musk said he's carrying out his threat to form a new political party after his fissure with P…",
    "link": "https://www.memeorandum.com/250706/p35",
    "timestamp": "2025-07-06T18:50:00Z"
  },
  {
    "title": "Jeff Landry doesn’t just talk the talk, he walks the walk on energy dominance",
    "description": "'Top 10 states for residential electricity prices ... would do well to copy Louisiana's new law. Their lower electricity prices would benefit their residents'",
    "link": "https://www.wnd.com/2025/07/jeff-landry-doesnt-just-talk-talk-he-walks/",
    "timestamp": "2025-07-06T18:49:29Z"
  },
  {
    "title": "Puerto Rican Pop Megastar Bad Bunny Conflates Illegal Aliens and Legal Immigration In Music Video Featuring AI-Generated Trump Voice",
    "description": "Puerto Rican pop megastar Bad Bunny conflated illegal aliens and legal immigrants in the music video for the opening track from his new album by using an imitation of President Donald Trump's voice to deliver a pro-immigrant speech.\nThe post Puerto Rican Pop …",
    "link": "https://www.breitbart.com/entertainment/2025/07/06/puerto-rican-pop-megastar-bad-bunny-conflates-illegal-aliens-and-legal-immigration-in-music-video-featuring-ai-generated-trump-voice/",
    "timestamp": "2025-07-06T18:45:01Z"
  },
  {
    "title": "Texas floods: Death toll reaches at least 69, with 12 missing as rescue efforts continue",
    "description": "Waters recede, but officials say they will not stop searching until every person is found",
    "link": "https://www.irishtimes.com/world/us/2025/07/06/texas-floods-death-toll-reaches-at-least-69-with-12-missing-as-rescue-efforts-continue/",
    "timestamp": "2025-07-06T18:43:36Z"
  },
  {
    "title": "Democrats Uncork Crazy Talk on the ‘Big Beautiful Bill’",
    "description": "Democrats can say the wildest and craziest things and know that all those badly named “mainstream” media outlets and fact-checkers won’t care in the slightest.... Read More\nThe post Democrats Uncork Crazy Talk on the ‘Big Beautiful Bill’ appeared first on The…",
    "link": "https://www.dailysignal.com/2025/07/06/democrats-uncork-crazy-talk-on-the-big-beautiful-bill/",
    "timestamp": "2025-07-06T18:40:00Z"
  },
  {
    "title": "…\"wasted little time VERB.ing\"…",
    "description": "Commenters noted the ambiguity of this sentence quoted earlier today in \"Rococo\": When President Donald Trump returned to the White House in January, he wasted little time redecorating. From Bob Ladd: \"I was genuinely uncertain when I read the sentence about …",
    "link": "https://languagelog.ldc.upenn.edu/nll/?p=69799",
    "timestamp": "2025-07-06T18:38:52Z"
  },
  {
    "title": "‘We feel blindsided’: Family of Trump supporters shocked after Canadian mother living in US for 35 years detained over immigration status",
    "description": "Cynthia Olivera, a Canadian national and Trump supporter residing in the US, faces deportation despite living there for 35 years. Detained during a green card interview, Olivera's past illegal entry after a prior deportation order has resurfaced under the Tru…",
    "link": "https://economictimes.indiatimes.com/news/international/us/we-feel-blindsided-family-of-trump-supporters-shocked-after-canadian-mother-living-in-us-for-35-years-detained-over-immigration-status/articleshow/122283625.cms",
    "timestamp": "2025-07-06T18:38:38Z"
  },
  {
    "title": "Rural hospitals will be hit hard by Trump’s signature spending package",
    "description": "Drastic cuts to Medicaid and other public health provisions in the new law will mean even less money to rural hospitals, many of which are already at risk of closing.",
    "link": "https://theconversation.com/rural-hospitals-will-be-hit-hard-by-trumps-signature-spending-package-260164",
    "timestamp": "2025-07-06T18:38:11Z"
  },
  {
    "title": "After Texas Floods, GOP Leaders Offer Prayers",
    "description": "Republicans were full of feel-good substitutes following the disaster.",
    "link": "https://www.huffpost.com/entry/jd-vance-mike-johnson-republicans-texas-flood-response_n_686aa2abe4b0762f74e11229",
    "timestamp": "2025-07-06T18:34:38Z"
  },
  {
    "title": "Trump Administration Cuts Funding For Black Infant Health Research, Labeling It A DEI Initiative - NewsBreak",
    "description": "A study exploring why Black babies in Detroit are disproportionately born prematurely has been abruptly terminated by the NIH.",
    "link": "https://www.newsbreak.com/share/4087820406608-trump-administration-cuts-funding-for-black-infant-health-research-labeling-it-a-dei-initiative?_f=app_share&amp;pd=07OsjUTm&amp;lang=en_US&amp;send_time=1751826839&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.27.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q3-v9%2Cns_foryou_blend_exp_25q2-v2%2Cns_foryou_rank_exp_25q2-v5&amp;s=i2",
    "timestamp": "2025-07-06T18:34:33Z"
  }
]