[
  {
    "title": "Democrats push DOJ to reveal hidden half of Jack Smith report as GOP prepares tense deposition",
    "description": "Democrats demand DOJ release Volume II of Special Counsel Jack Smith's report before his Wednesday deposition, with Rep. Jamie Raskin saying Smith's work should speak for itself.",
    "link": "https://www.foxnews.com/politics/democrats-push-doj-reveal-hidden-half-jack-smith-report-gop-prepares-tense-deposition",
    "timestamp": "2025-12-16T19:25:13Z"
  },
  {
    "title": "Trump wants to build out AI with a new ‘Tech Force’",
    "description": "The growing ubiquity of artificial intelligence remains a divisive topic among the public, but the White House is fully leaning into the AI boom. President Donald Trump has announced the creation of a new AI-based ‘United States Tech Force’ that will seek to …",
    "link": "https://biztoc.com/x/1347b50600fbd5cb",
    "timestamp": "2025-12-16T19:23:51Z"
  },
  {
    "title": "Leavitt: Trump may tease 2026 policy in Dec. 17 address",
    "description": "White House Press Secretary Karoline Leavitt told Fox News on Tuesday that US President Donald Trump's speech on Wednesday night will focus on his achievements during his year in office and may hint a...",
    "link": "https://biztoc.com/x/a7c65d32c732b36b",
    "timestamp": "2025-12-16T19:23:32Z"
  },
  {
    "title": "Trump administration’s latest battle for presidential power: defending his White House ballroom",
    "description": "President Donald Trump’s second term has been marked by epic legal disputes over presidential power. On Tuesday afternoon, his administration will be in court defending Trump’s power to build a ballroom.\nThe National Trust for Historic Preservation filed a la…",
    "link": "https://biztoc.com/x/135633f32469b758",
    "timestamp": "2025-12-16T19:23:25Z"
  },
  {
    "title": "Susie Wiles Pours Cold Water on One of Trump's Favorite Claims About Epstein",
    "description": "The current Chief of Staff under President Donald Trump has contradicted the president, stating that there is no evidence that Bill Clinton ever visited Jeffrey Epstein's Island.",
    "link": "https://www.ibtimes.com/susie-wiles-pours-cold-water-one-trumps-favorite-claims-about-epstein-3792838",
    "timestamp": "2025-12-16T19:23:11Z"
  },
  {
    "title": "Sheryl Sandberg says corporate climate 'one of the worst' she has ever seen",
    "description": "Sheryl Sandberg says corporate climate is 'one of the worst' ever and there is no excuse for companies to backslide on efforts to level career playing field.",
    "link": "https://www.cnbc.com/2025/12/16/sheryl-sandberg-corporate-culture-women-careers-opportunities.html",
    "timestamp": "2025-12-16T19:21:04Z"
  },
  {
    "title": "RFK, Jr.-Backed Lyme Disease Conspiracy Theory May Be Probed under New Bill (Claire Cameron/Scientific American)",
    "description": "Claire Cameron / Scientific American:\nRFK, Jr.-Backed Lyme Disease Conspiracy Theory May Be Probed under New Bill  —  President Donald Trump is expected to sign a defense bill this week that orders an investigation into whether the U.S. military bioengineered…",
    "link": "https://www.memeorandum.com/251216/p80",
    "timestamp": "2025-12-16T19:20:00Z"
  },
  {
    "title": "Trump Says He'll Deliver Prime-Time Address Wednesday Night (Courtney Subramanian/Bloomberg)",
    "description": "Courtney Subramanian / Bloomberg:\nTrump Says He'll Deliver Prime-Time Address Wednesday Night  —  President Donald Trump said he would deliver a prime-time address to the nation on Wednesday night, an opportunity to tout his agenda to voters with polls showin…",
    "link": "https://www.memeorandum.com/251216/p81",
    "timestamp": "2025-12-16T19:20:00Z"
  },
  {
    "title": "Crypto Lending Protocol Aave Says SEC Has Ended 4-Year Investigation: 'DeFi Will Win'",
    "description": "Decentralized finance lending protocol Aave says the SEC has closed its investigation into the project after four years.",
    "link": "https://decrypt.co/352584/crypto-lending-protocol-aave-says-sec-ended-4-year-investigation",
    "timestamp": "2025-12-16T19:18:57Z"
  },
  {
    "title": "‘I Know What It’s Like’: Vance Shines as Republican Messenger on Affordability",
    "description": "LEHIGH VALLEY, Penn—When Vice President JD Vance recalled his grandmother’s choice between putting food on their table and paying for her medications, he arose as... Read More\nThe post ‘I Know What It’s Like’: Vance Shines as Republican Messenger on Affordabi…",
    "link": "https://www.dailysignal.com/2025/12/16/i-know-what-its-like-vance-shines-as-republican-messenger-on-affordability/",
    "timestamp": "2025-12-16T19:18:55Z"
  },
  {
    "title": "US designates Colombian cocaine gang a terrorist group",
    "description": "The move is seen as a further escalation of the Trump administration's war on drugs in Latin America.",
    "link": "https://www.bbc.com/news/articles/cpq4wgle4x5o",
    "timestamp": "2025-12-16T19:17:06Z"
  },
  {
    "title": "Trump thinks Russia’s Putin wants all of Ukraine: WH Chief Susie Wiles",
    "description": "Trump for months has been convinced Putin is hellbent on taking over the entirety of Ukraine with his nearly four-year-old war there — disagreeing with unnamed advisors who felt giving him Ukraine's easternmost region would be enough.",
    "link": "https://nypost.com/2025/12/16/world-news/trump-thinks-russias-putin-wants-all-of-ukraine-wh-chief-susie-wiles/",
    "timestamp": "2025-12-16T19:17:01Z"
  },
  {
    "title": "Trump's approval rating slips to 39%, economy weighs, Reuters/Ipsos poll finds",
    "description": "WASHINGTON, Dec 16 (Reuters) - President Donald Trump's approval rating slipped in recent days to nearly its lowest level of his current term as voters from his Republican Party soured on his handling of the economy, according to a new Reuters/Ipsos poll. Rea…",
    "link": "https://www.thestar.com.my/news/world/2025/12/17/trump039s-approval-rating-slips-to-39-economy-weighs-reutersipsos-poll-finds",
    "timestamp": "2025-12-16T19:16:00Z"
  },
  {
    "title": "Federal Government Employment Dropped in October as DOGE Cuts Took Effect",
    "description": "Federal government employment dropped sharply in October and continued to fall in November as cuts made by the Department of Government Efficiency (DOGE) earlier this year began to impact employment numbers. Employment in the sector dropped by 162,000 in Octo…",
    "link": "https://www.pymnts.com/personnel/2025/federal-government-employment-dropped-in-october-as-doge-cuts-took-effect/",
    "timestamp": "2025-12-16T19:15:41Z"
  },
  {
    "title": "Vance touts an \"A+++\" economy (Politico)",
    "description": "Politico:\nVance touts an “A+++” economy  —  BULLETIN: President Donald Trump announced via Truth Social that he'll be giving an address to the nation tomorrow night at 9 p.m. live from the White House.  “I look forward to ‘seeing’ you then.  It has been a gre…",
    "link": "https://www.memeorandum.com/251216/p77",
    "timestamp": "2025-12-16T19:15:00Z"
  },
  {
    "title": "US designates Colombia's largest drug gang as terror group",
    "description": "Designating \"Clan del Golfo\" as a terrorist organization comes as the Trump administration pressures Colombia's government to crack down on cocaine production. The United States on Tuesday designated Colombia's largest armed drug-trafficking group, \"Clan del …",
    "link": "https://www.dw.com/en/us-designates-colombias-largest-drug-gang-as-terror-group/a-75191506",
    "timestamp": "2025-12-16T19:15:00Z"
  },
  {
    "title": "US offers Ukraine NATO-like security pact, with caveats",
    "description": "The Trump administration has offered Ukraine security guarantees similar to those it would receive from NATO",
    "link": "https://theweek.com/world-news/ukraine-us-security-guarantees",
    "timestamp": "2025-12-16T19:14:34Z"
  },
  {
    "title": "Replica Statue of Liberty Topples in Urban Hellscape",
    "description": "\"Just looked up metaphor in the dictionary and this was the image.\"\nThe post Replica Statue of Liberty Topples in Urban Hellscape appeared first on Futurism.",
    "link": "http://futurism.com/future-society/replica-statue-liberty-hellscape",
    "timestamp": "2025-12-16T19:13:32Z"
  },
  {
    "title": "Sen. Mark Kelly calls Pentagon investigation into his remarks a move to chill military dissent",
    "description": "Kelly said the Defense Department did not notify him of an investigation.",
    "link": "https://www.bostonherald.com/2025/12/16/mark-kelly-pentagon-investigation/",
    "timestamp": "2025-12-16T19:10:02Z"
  },
  {
    "title": "Aristotle’s Politics has wisdoms and warnings for our age of tech utopias and inequality",
    "description": "Are we all political animals? Aristotle thought so. Politics, he believed, was the art of the possible, but extremes of wealth could harm democracies.",
    "link": "https://theconversation.com/aristotles-politics-has-wisdoms-and-warnings-for-our-age-of-tech-utopias-and-inequality-270154",
    "timestamp": "2025-12-16T19:09:29Z"
  },
  {
    "title": "Rep. Garbarino ‘disappointed’ Senate hasn’t approved Trump’s CISA nominee",
    "description": "The House Homeland Security Committee chairman also questioned a recent FCC vote to reverse telecom security rules put in place after a major Chinese cyber intrusion.",
    "link": "https://www.nextgov.com/cybersecurity/2025/12/rep-garbarino-disappointed-senate-hasnt-approved-trumps-cisa-nominee/410201/",
    "timestamp": "2025-12-16T19:09:00Z"
  },
  {
    "title": "Trump to address nation Wednesday night",
    "description": "\"It has been a great year for our Country,\" he said about the 9 p.m. ET speech.",
    "link": "https://abcnews.go.com/Politics/trump-address-nation-wednesday-night/story?id=128458587",
    "timestamp": "2025-12-16T19:08:52Z"
  },
  {
    "title": "Prosecutors weigh charges for son of slain filmmaker Rob Reiner",
    "description": "LOS ANGELES, Dec 16 (Reuters) - Prosecutors in Los Angeles were weighing possible criminal charges on Tuesday for the son of Hollywood actor-director and political activist Rob Reiner and his wife Michele, who were found slain in their home over the weekend. …",
    "link": "https://www.thestar.com.my/news/world/2025/12/17/prosecutors-weigh-charges-for-son-of-slain-filmmaker-rob-reiner",
    "timestamp": "2025-12-16T19:08:00Z"
  },
  {
    "title": "Trump wants to build out AI with a new ‘Tech Force’",
    "description": "The administration is looking to add roughly 1,000 jobs",
    "link": "https://theweek.com/politics/tech-trump-artificial-intelligence-jobs",
    "timestamp": "2025-12-16T19:06:42Z"
  },
  {
    "title": "Susie Wiles, White House respond to 'disingenuously framed' profile in Vanity Fair",
    "description": "White House Chief of Staff Susie Wiles slammed Vanity Fair's profile about her as a \"disingenuously framed hit piece\" against herself and the Trump administration.",
    "link": "https://www.foxnews.com/media/susie-wiles-white-house-respond-disingenuously-framed-profile-vanity-fair",
    "timestamp": "2025-12-16T19:03:40Z"
  },
  {
    "title": "Netflix’s Military Show With 90% on Rotten Tomatoes Cancelled After Just One Season",
    "description": "Netflix has cancelled one of its newest shows, despite the series having 90% ratings from both critics and viewers on Rotten Tomatoes. It’s almost become an unofficial part of Netflix’s brand to have the streaming service cancel its original series before eve…",
    "link": "http://comicbook.com/tv-shows/news/netflixs-military-show-with-90-on-rotten-tomatoes-cancelled-after-just-one-season/",
    "timestamp": "2025-12-16T19:02:45Z"
  },
  {
    "title": "Could capital gains tax cuts reduce high home costs?",
    "description": "DC lawmakers are weighing reforms to the federal exclusion on primary-home sales.",
    "link": "https://www.realtor.com/news/trends/home-prices-capital-gains-fix/?cid=eml__1946:66e221571a4446d4e6969d41:rm202512161130_Marketing_Consumer_Daily_EditorialRSSDynamic",
    "timestamp": "2025-12-16T19:01:51Z"
  },
  {
    "title": "Ex-Trump voters swung hard to Democrats over costs in NJ & VA, new research shows",
    "description": "Voters who backed Donald Trump in 2024 and swung to Democrats in this year's Virginia and New Jersey elections did so over economic concerns, according to focus groups conducted by a Democratic pollster and obtained by POLITICO.",
    "link": "https://biztoc.com/x/6a260f6b3b02fc1e",
    "timestamp": "2025-12-16T19:01:14Z"
  },
  {
    "title": "Peace proposal to end Ukraine war could be presented to Russia within days, Zelenskyy says",
    "description": "Following the latest discussions, US officials on Monday said that Washington has reportedly agreed to provide security guarantees to Ukraine as part of a peace deal to end Russia's nearly four-year war.",
    "link": "https://indianexpress.com/article/world/peace-proposal-to-end-ukraine-war-could-be-presented-to-russia-within-days-zelenskyy-says-10424065/",
    "timestamp": "2025-12-16T19:00:48Z"
  },
  {
    "title": "'He fantasizes!' Trump accused of exposing 'breathtaking depravity' with made-up tale",
    "description": "Donald Trump's Truth Social post commenting on the death of film director Rob Reiner highlights the president's \"thirst for political violence,\" an analyst claimed Tuesday.Writing in The Bulwarks' Morning Shots newsletter, Mona Charen suggested Trump had a lu…",
    "link": "https://www.rawstory.com/trump-reiner-2674403803/",
    "timestamp": "2025-12-16T18:59:31Z"
  },
  {
    "title": "CBP announces record-breaking $200 billion in tariff revenue amid Trump administration enforcement push",
    "description": "U.S. Customs and Border Protection said it collected over $200 billion in tariffs revenue under the Trump administration through enhanced enforcement.",
    "link": "https://www.foxnews.com/politics/cbp-announces-record-breaking-200-billion-tariff-revenue-amid-trump-administration-enforcement-push",
    "timestamp": "2025-12-16T18:59:25Z"
  },
  {
    "title": "Nurses Are the Best of Us. Trump's Republican Party Should Take Notes.",
    "description": "Apart from his “concepts of a plan,” it’s clear that Donald Trump doesn’t know much about healthcare. But there is one cardinal rule: don’t mess with nurses. After all, these are the folks who keep our healthcare system alive. My mother and grandmother are bo…",
    "link": "https://www.commondreams.org/opinion/nurses-are-the-best-of-us-trump-s-republican-party-should-take-notes",
    "timestamp": "2025-12-16T18:55:15Z"
  },
  {
    "title": "JD Vance brushes off Susie Wiles calling him conspiracy theorist in new Vanity Fair report",
    "description": "Vice President JD Vance embraced his 'conspiracy theorist' label, defends White House chief of staff Susie Wiles after Vanity Fair report.",
    "link": "https://www.foxnews.com/politics/jd-vance-brushes-off-susie-wiles-calling-him-conspiracy-theorist-new-vanity-fair-report",
    "timestamp": "2025-12-16T18:54:47Z"
  },
  {
    "title": "EU ‘light years away’ from seizing Russian assets – Polish PM",
    "description": "The EU will not be able to directly tap into Russia’s frozen assets any time soon, Polish Prime Minister Donald Tusk has admitted Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629526-eu-russian-frozen-assets/",
    "timestamp": "2025-12-16T18:54:36Z"
  },
  {
    "title": "White House Response to the Susie Wiles Story Made It Much Worse",
    "description": "The White House’s rapid, coordinated defense of Susie Wiles turned a damaging Vanity Fair profile into a full-blown PR disaster driven by forced loyalty.\nThe post White House Response to the Susie Wiles Story Made It Much Worse first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/white-house-response-to-the-susie-wiles-story-made-it-much-worse/",
    "timestamp": "2025-12-16T18:54:23Z"
  },
  {
    "title": "Trump has already issued more executive orders in his second term than in his first",
    "description": "Before Trump, the last time a president surpassed 100 executive orders in the first year of a term was 1945, when Harry Truman took over the presidency after FDR’s death.\nThe post Trump has already issued more executive orders in his second term than in his f…",
    "link": "http://www.pewresearch.org/short-reads/2025/12/16/trump-has-already-issued-more-executive-orders-in-his-second-term-than-in-his-first/",
    "timestamp": "2025-12-16T18:54:15Z"
  },
  {
    "title": "It's official: three new casinos are coming to NYC",
    "description": "Here are the details about the three casinos that were granted official licenses to operate in NYC earlier this week.",
    "link": "https://www.timeout.com/newyork/news/its-official-three-new-casinos-are-coming-to-nyc-121625",
    "timestamp": "2025-12-16T18:53:58Z"
  },
  {
    "title": "Susie Wiles Rips Vanity Fair for ‘Disingenuously Framed Hit Piece’",
    "description": "White House Chief of Staff Susie Wiles blasted Vanity Fair on Tuesday for its \"disingenuously framed hit piece,\" which she says omitted crucial context.\nThe post Susie Wiles Rips Vanity Fair for ‘Disingenuously Framed Hit Piece’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/12/16/susie-wiles-rips-vanity-fair-for-disingenuously-framed-hit-piece/",
    "timestamp": "2025-12-16T18:53:28Z"
  },
  {
    "title": "Fox News Panel Shames Trump for ‘Trolling’ Rob Reiner’s Murder: ‘Well Beneath Him and Beneath the Office’ | Video",
    "description": "\"It would have been better if the president had made no comment,\" Fox's Howard Kurtz shares\nThe post Fox News Panel Shames Trump for ‘Trolling’ Rob Reiner’s Murder: ‘Well Beneath Him and Beneath the Office’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/fox-news-donald-trump-rob-reiner-special-report/",
    "timestamp": "2025-12-16T18:52:52Z"
  },
  {
    "title": "White House Chief Of Staff Susie Wiles Tells Vanity Fair That Donald Trump Has “An Alcoholic’s Personality,” Refers To JD Vance As “Cons",
    "description": "White House Chief Of Staff Susie Wiles Tells Vanity Fair That Donald Trump Has “An Alcoholic’s Personality,” Refers To JD Vance As “Conspiracy Theorist”Deadline Trump’s Inner Circle, On the Record (Part 2 of 2)Vanity Fair 6 jarring quotes from Trump's chief o…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180398533",
    "timestamp": "2025-12-16T18:52:26Z"
  },
  {
    "title": "Trump Allies Defend Chief Of Staff Over Blunt Vanity Fair Quotes",
    "description": "Senior Trump administration officials moved quickly to defend White House Chief of Staff Susie Wiles after Vanity Fair published a lengthy profile featuring her blunt remarks about President Donald Trump and top officials.\nThroughout the first year of Donald …",
    "link": "https://biztoc.com/x/1792d54e31615df4",
    "timestamp": "2025-12-16T18:49:58Z"
  },
  {
    "title": "Latest US Strikes On Drug Boats Came Hours After Trump Labelled Fentanyl 'WMD'",
    "description": "Latest US Strikes On Drug Boats Came Hours After Trump Labelled Fentanyl 'WMD'\n \nThe Pentagon released the latest footage showing fresh airstrikes targeting several alleged drug-trafficking boats near Latin America late on Monday, just hours after President D…",
    "link": "https://biztoc.com/x/a47b6684a7207fcb",
    "timestamp": "2025-12-16T18:49:52Z"
  },
  {
    "title": "Don Jr. and Bettina Anderson’s MAGA Fairy-Tale Engagement",
    "description": "The Don Jr. and Bettina Anderson engagement is a MAGA fairy tale. A year after Trump sent Don Jr.’s ex-fiancée Kimberly Guilfoyle off to Greece, he announced his son’s new engagement, and Laura Loomer spread the happy news.",
    "link": "http://nymag.com/intelligencer/article/don-jr-bettina-anderson-engagement.html",
    "timestamp": "2025-12-16T18:48:51Z"
  },
  {
    "title": "The final batch of pennies sold for $16.7 million",
    "description": "Special collector sets of the final batch of US pennies ever made set a record at a specialized coin auction site.",
    "link": "https://www.businessinsider.com/the-final-batch-of-pennies-sold-for-16-7-million-2025-12",
    "timestamp": "2025-12-16T18:48:33Z"
  },
  {
    "title": "US Threatens to Retaliate Against EU Firms Over Digital Tax",
    "description": "The Trump administration threatened retaliation against the European Union in response to efforts to tax American tech companies, singling out prominent companies, including Accenture Plc, Siemens AG and Spotify Technology SA, as possible targets for new rest…",
    "link": "https://financialpost.com/pmn/business-pmn/us-threatens-to-retaliate-against-eu-firms-over-digital-tax",
    "timestamp": "2025-12-16T18:47:59Z"
  },
  {
    "title": "As Americans continue to feel the pain from tariffs and inflation, Lidl launches holiday meal deal for less than $4 per person",
    "description": "The total 12-person meal costs $42.66 as Americans’ affordability concerns grow.",
    "link": "https://fortune.com/2025/12/16/americans-pain-tariffs-inflation-lidl-holiday-meal-deal/",
    "timestamp": "2025-12-16T18:47:08Z"
  },
  {
    "title": "At the Turning of the Tide : How to Fight Our Way out of the Trump Era",
    "description": "We revisit the structural forces behind Trump's return to power, review the events of 2025, and propose a strategy for how to fight our way out of the Trump era.",
    "link": "https://crimethinc.com/2025/12/16/at-the-turning-of-the-tide-how-fight-our-way-out-of-the-trump-era",
    "timestamp": "2025-12-16T18:46:49Z"
  },
  {
    "title": "Officers say at trial of Milwaukee judge her actions made their job more dangerous",
    "description": "Prosecutors are trying to paint a Milwaukee judge as rudely approaching federal officers and making it more dangerous for them to do their jobs when she helped an immigrant escape arrest",
    "link": "https://abcnews.go.com/Politics/wireStory/officers-trial-milwaukee-judge-actions-made-job-dangerous-128458921",
    "timestamp": "2025-12-16T18:46:34Z"
  },
  {
    "title": "Trump Has Announced Nine Different Things He’s Going To Spend His Unconstitutional Tariff Tax Revenue On",
    "description": "The President of the United States is currently promising to spend the same pot of money on at least nine different things. The pot in question: revenue from all the random and fluctuating tariff duties that are almost certainly unconstitutional, which means …",
    "link": "https://www.techdirt.com/2025/12/16/trump-has-announced-nine-different-things-hes-going-to-spend-his-unconstitutional-tariff-tax-revenue-on/",
    "timestamp": "2025-12-16T18:46:18Z"
  },
  {
    "title": "Zelenskyy says peace proposals to end war in Ukraine could be presented to Russia within days",
    "description": "Ukrainian President Zelenskyy believes a peace deal with Russia could be finalized within days, with US officials presenting proposals to the Kremlin. While 90% of a US-authored plan has consensus, key issues like occupied Ukrainian territory remain unresolve…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskyy-says-peace-proposals-to-end-war-in-ukraine-could-be-presented-to-russia-within-days/articleshow/126017828.cms",
    "timestamp": "2025-12-16T18:46:16Z"
  },
  {
    "title": "Trump designates deadly drug a weapon of mass destruction",
    "description": "President Donald Trump this week took additional action to end the nation’s drug crisis.During a Mexican Border Defense Medal presentation on Monday, Trump announced that he was issuing an executive order designating fentanyl a weapon of mass destruction. 'No…",
    "link": "https://www.theblaze.com/news/trump-designates-deadly-drug-a-weapon-of-mass-destruction",
    "timestamp": "2025-12-16T18:45:00Z"
  },
  {
    "title": "Why are conservatives so glum about Mid-Term elections?",
    "description": "Donald Trump has very high \"strongly disapprove\" ratings. And it seems like conservative social-media users and on-air personalities seem to be presuming this will translate into a bloodbath on Election Day 2026. But polling data doesn't bear this out. First,…",
    "link": "https://freerepublic.com/focus/f-chat/4357685/posts",
    "timestamp": "2025-12-16T18:43:54Z"
  },
  {
    "title": "Trump Cuts Shrink Federal Workforce Back To Obama Levels",
    "description": "President Donald Trump's cuts have dramatically shrunk the federal workforce to the smallest level in over a decade, according to economic data out Tuesday.",
    "link": "https://dailycaller.com/2025/12/16/trump-federal-workforce-cuts-jobs/",
    "timestamp": "2025-12-16T18:43:42Z"
  },
  {
    "title": "BREAKING: Trump announces mystery 'address to the nation' coming Wednesday",
    "description": "President Donald Trump announced plans to give an \"address to the nation\" on Wednesday night but did not explain why.\"My Fellow Americans: I will be giving an ADDRESS TO THE NATION tomorrow night, LIVE FROM THE WHITE HOUSE, at 9 P.M. EST. I look forward to \"s…",
    "link": "https://www.rawstory.com/trump-address-the-nation/",
    "timestamp": "2025-12-16T18:37:07Z"
  },
  {
    "title": "Trump announces primetime address to the nation",
    "description": "President Donald Trump will address the nation live from the White House on Wednesday night, he announced Tuesday on social media.",
    "link": "https://www.foxnews.com/politics/trump-announces-primetime-address-nation",
    "timestamp": "2025-12-16T18:35:27Z"
  },
  {
    "title": "Trump Team Tries Deranged New Argument on Classified Documents Case",
    "description": "The Trump administration is trying to claim that the FBI believed it didn’t have probable cause to search Donald Trump’s Mar-a-Lago estate in 2022, citing a Fox News article claiming to have declassified emails. White House press secretary Karoline Leavitt po…",
    "link": "https://newrepublic.com/post/204503/trump-team-tries-deranged-new-argument-classified-documents-case",
    "timestamp": "2025-12-16T18:32:20Z"
  },
  {
    "title": "WWE legend leaving company over its ties with Trump administration",
    "description": "WWE legend Mick Foley announced on social media he will be parting ways with the company over its ties to President Donald Trump's administration.",
    "link": "https://www.foxnews.com/sports/wwe-legend-leaving-company-over-its-ties-trump-administration",
    "timestamp": "2025-12-16T18:31:30Z"
  },
  {
    "title": "Rob Reiner Was Good",
    "description": "Rob Reiner was better than most at making classic movies, Hollywood careers, and California policy change. In a memorial essay, @mattzollerseitz remembers the sheer force of a beloved director whose influence runs deep.",
    "link": "http://www.vulture.com/article/rob-reiner-was-good.html",
    "timestamp": "2025-12-16T18:30:52Z"
  },
  {
    "title": "US Gaza Plan Prevented Bloodshed, Yet Lasting Ceasefire Not Achieved - Russian Envoy to UN",
    "description": "UNITED NATIONS (Sputnik) – US President Donald Trump’s peace plan has helped reduce large-scale fighting and hunger in the Gaza Strip, though a lasting ceasefire remains elusive, Russian Deputy Permanent Representative to the United Nations Dmitry Polyanskiy …",
    "link": "https://sputnikglobe.com/20251216/us-gaza-plan-prevented-bloodshed-yet-lasting-ceasefire-not-achieved---russian-envoy-to-un-1123308434.html",
    "timestamp": "2025-12-16T18:30:00Z"
  },
  {
    "title": "Trump Has an 'Alcoholic's Personality': The Don's Chief of Staff Susie Wiles Makes Bold Statements About Her Boss' Controversial Public Persona",
    "description": "White House Chief of Staff Susie Wiles called out her boss in a shocking interview, pulling the curtain back on the president.",
    "link": "https://radaronline.com/p/trump-alcoholic-personality-chief-of-staff-susie-wiles-interview/",
    "timestamp": "2025-12-16T18:30:00Z"
  },
  {
    "title": "Susie Wiles slams Vanity Fair 'hit piece,' which included her unflattering comments about Trump and his team (Christian Datoc/Washington Examiner)",
    "description": "Christian Datoc / Washington Examiner:\nSusie Wiles slams Vanity Fair ‘hit piece,’ which included her unflattering comments about Trump and his team  —  Susie Wiles, described by President Donald Trump as the most powerful woman in the world, has hit back at a…",
    "link": "https://www.memeorandum.com/251216/p70",
    "timestamp": "2025-12-16T18:30:00Z"
  },
  {
    "title": "Hegseth: No plans to release unedited boat strike video to public | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> U.S. Defense Secretary Pete Hegseth said today there are no plans to release the unedited video of September 2 strikes on a suspected drug trafficking boat in the Caribbean that has fueled concerns about the Trump administration’s plans for Vene…",
    "link": "https://www.staradvertiser.com/2025/12/16/breaking-news/hegseth-no-plans-to-release-unedited-boat-strike-video-to-public/",
    "timestamp": "2025-12-16T18:26:37Z"
  },
  {
    "title": "Larry Ellison’s big dumb gift to his large adult son",
    "description": "Media is a business about dreams, and Larry Ellison's son is dreaming big. This might explain why the case for Paramount Skydance to buy Warner Bros. Discovery is so incoherent. In October, Warner Bros. put itself up for sale, leading to a number of bids. The…",
    "link": "https://www.theverge.com/entertainment/845532/larry-ellison-paramount-wb-netflix-takeover-oracle",
    "timestamp": "2025-12-16T18:25:17Z"
  },
  {
    "title": "Susie Wiles, Trump’s chief of staff, criticizes Bondi’s handling of Epstein files in Vanity Fair interview",
    "description": "White House chief of staff Susie Wiles is criticizing Attorney General Pam Bondi’s handling of the Jeffrey Epstein case and broadly defending Donald Trump's second presidency in a series of interviews published Tuesday.",
    "link": "https://www.pbs.org/newshour/politics/susie-wiles-trumps-chief-of-staff-criticizes-bondis-handling-of-epstein-files-in-vanity-fair-interview",
    "timestamp": "2025-12-16T18:24:19Z"
  },
  {
    "title": "FBI did not believe it had probable cause to raid Mar-a-Lago for classified documents, bombshell files show",
    "description": "The FBI did not believe agents had probable cause to execute a search warrant at President Trump's Mar-a-Lago estate, according to internal records released Tuesday by Sen. Chuck Grassley (R-Iowa).",
    "link": "https://nypost.com/2025/12/16/us-news/fbi-did-not-believe-it-had-probable-cause-to-raid-mar-a-lago-for-classified-documents-bombshell-files-show/",
    "timestamp": "2025-12-16T18:24:03Z"
  },
  {
    "title": "Marjorie Taylor Greene and Brian Glenn are getting married",
    "description": "NEW YORK — Republican Rep. Marjorie Taylor Greene is engaged to Right Side Broadcasting Network personality Brian Glenn. The pair announced their impending...",
    "link": "https://www.nydailynews.com/2025/12/15/marjorie-taylor-greene-engaged-to-brian-glenn-are-getting-married/",
    "timestamp": "2025-12-16T18:22:00Z"
  },
  {
    "title": "JD Vance Fires Back — Says He Hopes Trump Admin Has Learned ‘Lesson’ After Susie Wiles Called Him a ‘Conspiracy Theorist’ in Vanity Fair",
    "description": "Vice President JD Vance on Tuesday responded to White House Chief of Staff Susie Wiles calling him a conspiracy theorist in a recent Vanity Fair story.\nThe post JD Vance Fires Back — Says He Hopes Trump Admin Has Learned ‘Lesson’ After Susie Wiles Called Him …",
    "link": "https://www.mediaite.com/politics/jd-vance-fires-back-says-he-hopes-trump-admin-has-learned-lesson-after-susie-wiles-called-him-a-conspiracy-theorist-in-vanity-fair/",
    "timestamp": "2025-12-16T18:21:48Z"
  },
  {
    "title": "8 MAGA Celebrities Who Had Wildly Different Reactions To Rob Reiner's Death Than Donald Trump",
    "description": "\"Human beings, Rob Reiner and his wife Michelle have been tragically killed today. I am deeply saddened.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/maga-celebs-on-rob-reiner",
    "timestamp": "2025-12-16T18:21:32Z"
  },
  {
    "title": "Arctic is again the hottest it's been in 125 years, NOAA report says",
    "description": "The National Oceanic and Atmospheric Administration’s annual Arctic report card shows how rapidly and profoundly climate change is warming and altering the region.",
    "link": "https://www.nbcnews.com/science/climate-change/arctic-hot-record-low-sea-ice-noaa-report-card-rcna249372",
    "timestamp": "2025-12-16T18:21:14Z"
  },
  {
    "title": "FBI widens net in hunt for Brown University shooter",
    "description": "The FBI is leading a major manhunt for the suspect in the Brown University shooting that killed two students. A $50,000 reward is being offered.\n\nRead More: https://punchng.com/fbi-widens-net-in-hunt-for-brown-university-shooter/",
    "link": "https://punchng.com/fbi-widens-net-in-hunt-for-brown-university-shooter/",
    "timestamp": "2025-12-16T18:20:40Z"
  },
  {
    "title": "Trump executive order credited with helping FBI foil New Year's Eve bombing plot in California",
    "description": "Prosecutors say a Trump executive order helped the FBI thwart a planned New Year’s Eve attack by a group officials describe as far-left and targeting California companies.",
    "link": "https://www.foxnews.com/media/trump-executive-order-credited-helping-fbi-foil-new-years-eve-bombing-plot-california",
    "timestamp": "2025-12-16T18:18:43Z"
  },
  {
    "title": "Donald Trump Declares Fentanyl a Weapon of Mass Destruction",
    "description": "President Donald Trump has classified fentanyl -- and many of the chemicals used in the narcotic's production -- weapons of mass destruction. Trump issued an executive order regarding the drug Monday, describing fentanyl as \"closer to a chemical…\n Permalink",
    "link": "https://www.tmz.com/2025/12/16/donald-trump-executive-order-fentanyl-wmd/",
    "timestamp": "2025-12-16T18:18:02Z"
  },
  {
    "title": "Trump Security Strategy Meant to Guide Europe, US Official Says",
    "description": "The Trump administration’s recently released national security strategy was not intended as empty criticism of Europe but was designed to help steer the continent back on track, a top State Department official said.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-security-strategy-meant-to-guide-europe-us-official-says",
    "timestamp": "2025-12-16T18:17:54Z"
  },
  {
    "title": "US banks could soon issue stablecoins under FDIC plan to implement GENIUS Act",
    "description": "The Federal Deposit Insurance Corp.'s proposal outlines how banks could seek approval to issue payment stablecoins as US regulators move from legislation to rule-making.",
    "link": "https://cointelegraph.com/news/us-banks-issue-stablecoins-fdic-genius-act",
    "timestamp": "2025-12-16T18:15:27Z"
  },
  {
    "title": "Accused Lefty Extremist Texted FBI Snitch About ‘Terrorist Diary’: ‘Lmaooooo I Have To Get Rid Of That’",
    "description": "Leftists charged in a bombing plot in California told an FBI informant of their intentions several times before their Friday arrest, court records allege.",
    "link": "https://dailycaller.com/2025/12/16/left-wing-extremism-fbi-terrorism-bombings-california-turtle-island-palestine/",
    "timestamp": "2025-12-16T18:14:52Z"
  },
  {
    "title": "Mick Foley to leave WWE due to company’s relationship with Donald Trump",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_f642733c-264b-442b-b376-632b1f4d8603",
    "timestamp": "2025-12-16T18:12:43Z"
  },
  {
    "title": "ROOKE: Trump Admin Sends Much Needed Lifeline To American Farmers Just In Nick Of Time",
    "description": "Trump's tariff policy will bring short-term pain for a long-term gain, but that doesn't mean he plans to leave farmers to shoulder the suffering alone.",
    "link": "https://dailycaller.com/2025/12/16/rooke-donald-trump-farmers-tariff-aid-china-farmer-bridge-assistance/",
    "timestamp": "2025-12-16T18:11:09Z"
  },
  {
    "title": "Susie Wiles Disavows Her Own On-the-Record Admissions Revealing White House Chaos",
    "description": "Hours after a Vanity Fair piece in which President Donald Trump’s chief of staff made a series of damaging, on-the-record remarks about the president, his policies, and allies, Susie Wiles appears to be attempting damage control. “A disingenuously framed hit …",
    "link": "https://www.motherjones.com/politics/2025/12/susie-wiles-vanity-fair-interview-trump-alcoholic/",
    "timestamp": "2025-12-16T18:10:48Z"
  },
  {
    "title": "Donald Trump Jr announces engagement to Bettina Anderson",
    "description": "President Donald Trump's oldest son, Donald Trump Jr., is engaged to Bettina Anderson, who has said she felt \"like the luckiest girl in the world.\"",
    "link": "https://www.foxnews.com/politics/donald-trump-jr-announces-engagement-bettina-anderson",
    "timestamp": "2025-12-16T18:08:38Z"
  },
  {
    "title": "Leslie Jones' Extended Bleeps Say It All In $#@!! Trump Takedown",
    "description": "The ex-\"SNL\" star let loose on Nicolle Wallace's show, and the censor button got a workout.",
    "link": "https://www.huffpost.com/entry/leslie-jones-bleep-bleep-donald-trump-piggy_n_69417eb0e4b0a75967045d5a",
    "timestamp": "2025-12-16T18:08:20Z"
  },
  {
    "title": "Republican women in Congress are tired of Mike Johnson",
    "description": "Frustrations are mounting in the Republican conference despite the GOP controlling the House, the Senate, and the White House. There is a growing feeling — from women specifically — that they just can’t get anything done. The target of members’ ire? House Spe…",
    "link": "https://www.vox.com/politics/472434/republican-women-revolt-house-mike-johnson",
    "timestamp": "2025-12-16T18:08:10Z"
  },
  {
    "title": "Liberals Are Falling for Extremely Obvious AI Fakes",
    "description": "\"Why are Democrats using the same AI slop that Republicans started using in the fall?\"\nThe post Liberals Are Falling for Extremely Obvious AI Fakes appeared first on Futurism.",
    "link": "http://futurism.com/artificial-intelligence/liberals-democrats-ai-deepfakes",
    "timestamp": "2025-12-16T18:08:08Z"
  },
  {
    "title": "Analysis Shows Electric Bills Have Spiked 13% in Trump’s First Year—And His Own Policies Are to Blame",
    "description": "Americans across the country are struggling to pay higher utility bills, and one clean energy advocacy group is pointing the finger squarely at President Donald Trump.Climate Power last week released a new report that cited data from the US Energy Information…",
    "link": "https://www.commondreams.org/news/electric-bill-price-increase",
    "timestamp": "2025-12-16T18:06:18Z"
  },
  {
    "title": "Pot stocks keep blazing, after Trump says he’s ‘very strongly’ looking at rescheduling cannabis",
    "description": "Shares of U.S. and Canadian cannabis stocks continued their rally on Tuesday, after President Donald Trump a day earlier said he was “very strongly” weighing an executive order to reschedule the drug, a move that could lift some regulations on the substance.",
    "link": "https://biztoc.com/x/26be5cbf7906fdd6",
    "timestamp": "2025-12-16T18:06:04Z"
  },
  {
    "title": "Trump sues BBC for $10 billion over edited clips of his Jan. 6 speech",
    "description": "Donald Trump had already made clear he intended to sue the BBC. The question was how much he’d seek in his civil lawsuit.\nA month ago, the president said he expected to ask for $1 billion. Soon after, the Republican suggested the figure could be $5 billion. E…",
    "link": "https://biztoc.com/x/5496d4f073ef2362",
    "timestamp": "2025-12-16T18:05:46Z"
  },
  {
    "title": "Citadel chief Ken Griffin says White House must ‘distance’ itself from Fed",
    "description": "Hedge fund billionaire is latest Wall Street figure to express concerns Donald Trump will pick ally to chair central bank",
    "link": "https://biztoc.com/x/c9497a6911646d93",
    "timestamp": "2025-12-16T18:05:28Z"
  },
  {
    "title": "White House chief of staff says Trump has 'alcoholic's personality,' thinks there's 'nothing he can't do'",
    "description": "White House Chief of Staff Susie Wiles described President Donald Trump as having an alcoholic's personality in an interview on Tuesday, saying he feels there's nothing \"he can't do.\"",
    "link": "https://www.foxnews.com/media/white-house-chief-staff-says-trump-has-alcoholics-personality-thinks-theres-nothing-he-cant-do",
    "timestamp": "2025-12-16T18:03:07Z"
  },
  {
    "title": "New Roadmap Shows How to Cut a Surprisingly Big Source of Emissions",
    "description": "Electricity can replace natural gas to provide the low- and medium-grade heat needed to make food, paper and chemicals.",
    "link": "https://financialpost.com/pmn/business-pmn/new-roadmap-shows-how-to-cut-a-surprisingly-big-source-of-emissions",
    "timestamp": "2025-12-16T18:02:06Z"
  },
  {
    "title": "Trump's Chief of Staff Susie Wiles Acknowledges He's In the Jeffrey Epstein File, On the Flight Manifest But Not for 'Doing Anything Awful'",
    "description": "White House Chief of Staff Susie Wiles is making waves with her viral Vanity Fair piece. If you don’t know, the tell-all has gone viral for several reasons, one of them being the way the 68-year-old described Donald Trump, JD Vance, and others in the cabinet.…",
    "link": "https://www.justjared.com/2025/12/16/trumps-chief-of-staff-susie-wiles-acknowledges-hes-in-the-jeffrey-epstein-file-on-the-flight-manifest-but-not-for-doing-anything-awful/",
    "timestamp": "2025-12-16T18:01:04Z"
  },
  {
    "title": "Celebrities Call Out President Trump's Comments About Rob Reiner's Death",
    "description": "Several celebrities have expressed shock over President Donald Trump’s comments about Rob Reiner in the wake of the director’s death alongside his wife, Michele Singer Reiner. Rob, 78, and Michele, 68, were found dead in their home in Los Angeles on Sunday, D…",
    "link": "https://www.usmagazine.com/celebrity-news/news/celebrities-call-out-president-trumps-comments-about-rob-reiners-death/#article",
    "timestamp": "2025-12-16T18:00:59Z"
  }
]