[
  {
    "title": "Budget airline Norse is axing half its US to Europe routes, making cheap Transatlantic travel more difficult",
    "description": "Norse Atlantic Airways is cutting six routes between the US and Europe as it struggles to turn a profit, instead focusing on taking Europeans to Asia.",
    "link": "https://www.businessinsider.com/norse-atlantic-airways-cutting-half-its-us-routes-2025-8",
    "timestamp": "2025-08-21T11:16:33Z"
  },
  {
    "title": "US and EU frame the ongoing deal between the trading partners and solidify some commitments",
    "description": "WASHINGTON (AP) — The United States and the European Union on Thursday issued a joint statement that frames the ongoing deal between the trading partners and solidifies some trade commitments. “This Framework Agreement will put our trade and investment relati…",
    "link": "https://financialpost.com/pmn/us-and-eu-frame-the-ongoing-deal-between-the-trading-partners-and-solidify-some-commitments",
    "timestamp": "2025-08-21T11:15:58Z"
  },
  {
    "title": "White House Suspends Public Tours Due To Trump's Ballroom Construction",
    "description": "It's not clear when they will resume as work on the $200 million addition gets underway.",
    "link": "https://www.huffpost.com/entry/trump-white-house-tours-construction_n_68a697a2e4b0903a790deecf",
    "timestamp": "2025-08-21T11:15:54Z"
  },
  {
    "title": "Nexstar Media Group buying Tegna in deal worth $6.2 billion",
    "description": "Nexstar Media Group is buying broadcast rival Tegna for $6.2 billion, bringing together two major players in U.S. television and the country’s local news landscape",
    "link": "https://abcnews.go.com/US/wireStory/nexstar-media-group-buying-tegna-deal-worth-62-124838290",
    "timestamp": "2025-08-21T11:15:07Z"
  },
  {
    "title": "Russia launches major air strike and drone attack on Ukraine",
    "description": "Ukrainian President Volodymyr Zelenskyy says this attack shows the world that Russia is acting like \"nothing has changed at all\".",
    "link": "https://www.abc.net.au/news/2025-08-21/russia-drone-strike-ukraine/105683302",
    "timestamp": "2025-08-21T11:14:04Z"
  },
  {
    "title": "DHS to Open ‘Cornhusker Clink’ Migrant Detention Center in Nebraska",
    "description": "The Department of Homeland Security has unveiled plans to open a facility dedicated to housing detained migrants in Nebraska, dubbed the \"Cornhusker Clink.\"\nThe post DHS to Open ‘Cornhusker Clink’ Migrant Detention Center in Nebraska first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/news/dhs-to-open-cornhusker-clink-migrant-detention-center-in-nebraska/",
    "timestamp": "2025-08-21T11:12:54Z"
  },
  {
    "title": "Walmart hikes forecast as low price focus draws shoppers",
    "description": "Walmart has today raised its fiscal year sales and profit forecast, driven by strong demand from shoppers across all income levels, who have turned to the world's largest retailer as they worry about rising costs.",
    "link": "https://www.rte.ie/news/business/2025/0821/1529491-walmart-hikes-forecast-as-low-price-focus-draws-shoppers/",
    "timestamp": "2025-08-21T11:12:36Z"
  },
  {
    "title": "Tariffs are giving parents back-to-school sticker shock | CNN Business",
    "description": "Parents who are back-to-school shopping are finding that prices are higher and there are fewer deals.",
    "link": "https://www.cnn.com/2025/08/21/business/prices-economy-back-to-school-tariffs",
    "timestamp": "2025-08-21T11:12:28Z"
  },
  {
    "title": "US and EU frame the ongoing deal between the trading partners and solidify some commitments",
    "description": "The United States and the European Union on Thursday issued a joint statement that frames the ongoing deal between the trading partners and solidifies some...",
    "link": "https://finance.yahoo.com/news/us-eu-frame-ongoing-deal-111152154.html",
    "timestamp": "2025-08-21T11:11:52Z"
  },
  {
    "title": "Trump backs down on threats of higher tariffs for E.U. pharma and chips",
    "description": "President Donald Trump speaks as French President Emmanuel Macron, left, and Italian Prime Minister Giorgia Meloni, right, listen at a meeting with Ukrainian President Volodymyr Zelenskyy, foreground left, and other European leaders in the East Room of the Wh…",
    "link": "https://biztoc.com/x/e125f1128ca9b9b7",
    "timestamp": "2025-08-21T11:10:28Z"
  },
  {
    "title": "Asia’s LNG Imports Are Surging but Will Still Fall Short of U.S. Trade Pledges",
    "description": "Asia’s liquefied natural gas imports are set to reach the second-highest on record in October, but even these elevated volumes will not be near enough to meet the pledges of North Asian countries to buy American LNG and energy under the trade deals.   Asia is…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Asias-LNG-Imports-Are-Surging-but-Will-Still-Fall-Short-of-US-Trade-Pledges.html",
    "timestamp": "2025-08-21T11:10:00Z"
  },
  {
    "title": "FBI Director Patel and foundation win defamation lawsuit against blogger, awarded $250,000",
    "description": "Stewartson accused Patel of being a \"Kremlin asset,\" of trying to overthrow the U.S. government, and of planning the Jan. 6, 2021, attack on the U.S. Capitol by supporters of President Donald Trump...Stewartson told CNBC in a text message on Friday, \"I was ne…",
    "link": "https://freerepublic.com/focus/f-news/4335815/posts",
    "timestamp": "2025-08-21T11:08:45Z"
  },
  {
    "title": "US, EU lock in trade deal; US official sees auto tariff relief in weeks",
    "description": "The United States and European Union have finalized a trade deal. The US will impose a 15% tariff on most EU imports. This includes autos, pharmaceuticals, semiconductors, and lumber. The US will lower car tariffs once the EU cuts tariffs on US goods. Tariff …",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-eu-lock-in-trade-deal-us-official-sees-auto-tariff-relief-in-weeks/articleshow/123431574.cms",
    "timestamp": "2025-08-21T11:08:11Z"
  },
  {
    "title": "CA Supreme Court denies GOP request for hold on Dem-pushed redistricting legislation",
    "description": "California Supreme Court denies GOP request for hold on Dem-pushed redistricting legislation.",
    "link": "https://abcnews.go.com/Politics/california-supreme-court-denies-gop-request-hold-dem/story?id=124834564",
    "timestamp": "2025-08-21T11:07:56Z"
  },
  {
    "title": "U.S. and EU spell out tariffs for autos, pharmaceuticals, and more",
    "description": "The U.S. and European Union had first struck a trade agreement in July, but many details were left unresolved at the time.",
    "link": "https://www.cnbc.com/2025/08/21/us-eu-trade-agreement-details.html",
    "timestamp": "2025-08-21T11:02:51Z"
  },
  {
    "title": "'This has got to change now': Ex-GOP lawmaker issues big 'wake up call' to his new party",
    "description": "A former Republican lawmaker is sounding the alarm about the Democratic voter registration deficit.Joe Walsh, a former GOP congressman who challenged Donald Trump for the 2020 presidential nomination, on his Social Contract Substack page pointed to new report…",
    "link": "https://www.rawstory.com/joe-walsh-democrat-wake-up/",
    "timestamp": "2025-08-21T11:01:25Z"
  },
  {
    "title": "Couple can’t decide whether to break up or have baby",
    "description": "A COUPLE are torn between splitting up and starting a new chapter in their lives together by having a baby.",
    "link": "https://www.thedailymash.co.uk/news/relationships/couple-cant-decide-whether-to-break-up-or-have-baby-20250821259812",
    "timestamp": "2025-08-21T11:00:56Z"
  },
  {
    "title": "Democrats Face Nationwide Voter Registration Crisis, Party Is ‘Hemorrhaging Voters’",
    "description": "From 2020 to 2024, Democrats lost roughly 2.1 million registered voters across the 30 states and D.C. that track party affiliation, while the GOP gained approximately 2.4 million.\nThe post Democrats Face Nationwide Voter Registration Crisis, Party Is ‘Hemorrh…",
    "link": "https://legalinsurrection.com/2025/08/democrats-face-nationwide-voter-registration-crisis-says-the-ny-times/",
    "timestamp": "2025-08-21T11:00:44Z"
  },
  {
    "title": "You Might Be 'Quietly Cracking' At Work And Not Even Know It",
    "description": "Don't ignore these warning signs.",
    "link": "https://www.huffpost.com/entry/quiet-cracking-signs-work_l_68a5145de4b0ad2e4622376c",
    "timestamp": "2025-08-21T11:00:18Z"
  },
  {
    "title": "U.S.-Canada Bridge Nears Completion, Wrapping Up A Decades Old Tale",
    "description": "A new U.S.-Canada is supposed to open this year. Its completion will be the climax of long soap opera.",
    "link": "https://www.forbes.com/sites/billkoenig/2025/08/21/us-canada-bridge-nears-completion-wrapping-up-a-decades-old-tale/",
    "timestamp": "2025-08-21T11:00:00Z"
  },
  {
    "title": "Trump backs down on threats of higher tariffs for E.U. pharma and chips",
    "description": "The United States has agreed to limit tariffs on pharmaceuticals, lumber and semiconductors imported from the European Union to 15%, according to an agreement released Thursday",
    "link": "https://www.nbcnews.com/business/economy/trump-white-house-eu-tariffs-lumber-pharma-15-percent-rcna226206",
    "timestamp": "2025-08-21T11:00:00Z"
  },
  {
    "title": "Trump Has No (Legal) Power to Mess With the Election",
    "description": "But that won’t stop him from finding ways to make chaos.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/08/trump-mail-voting-election-machines/683934/",
    "timestamp": "2025-08-21T11:00:00Z"
  },
  {
    "title": "‘There’s nobody left’: Israeli offensive forces exodus from West Bank refugee camp",
    "description": "Two years ago, the UN said nearly 14,000 people were living in Nur Shams camp. Now, it is practically empty",
    "link": "https://www.irishtimes.com/world/middle-east/2025/08/21/theres-nobody-left-israeli-offensive-forces-exodus-from-west-bank-refugee-camp/",
    "timestamp": "2025-08-21T11:00:00Z"
  },
  {
    "title": "Transcript: Stephen Miller’s Crazed Fascist Rant to Media Is Revealing",
    "description": "The following is a lightly edited transcript of the August 21 episode of theDaily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.This week, S…",
    "link": "https://newrepublic.com/article/199377/transcript-stephen-miller-crazed-fascist-rant-media-revealing",
    "timestamp": "2025-08-21T10:57:09Z"
  },
  {
    "title": "The Texas House OK'd GOP-favored redistricting. California intends to counter with map of its own",
    "description": "California's Democratic Legislature is expected to counter Texas' mid-decade redraw of its congressional map with one of its own",
    "link": "https://abcnews.go.com/Politics/wireStory/texas-house-okd-gop-favored-redistricting-california-intends-124839105",
    "timestamp": "2025-08-21T10:54:26Z"
  },
  {
    "title": "Take steps to restart SAARC, pursue peace: Farooq Abdullah",
    "description": "Farooq Abdullah advocates for SAARC's revival, urging PM Modi to pursue peace with Pakistan for global advancement. He highlights the need for India to prioritize humanity over military or economic power, drawing inspiration from Gandhi's message of peace. Ab…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/take-steps-to-restart-saarc-pursue-peace-farooq-abdullah/articleshow/123431296.cms",
    "timestamp": "2025-08-21T10:53:47Z"
  },
  {
    "title": "Steve Bannon issues dire warning that blind spot could spell disaster for GOP in 2026",
    "description": "Steve Bannon issued a grave warning to Republicans ahead of the 2026 midterm elections, saying that unless GOP lawmakers do more to sell the One Big Beautiful Bill Act to their constituents, the party could face an electoral whalloping next year.“The 2026 mid…",
    "link": "https://www.rawstory.com/steve-bannon-2673907028/",
    "timestamp": "2025-08-21T10:49:08Z"
  },
  {
    "title": "Switzerland Is Having an Economic Identity Crisis",
    "description": "After trade talks with Trump, the Swiss government is reconsidering everything it knows about itself.",
    "link": "http://foreignpolicy.com/2025/08/21/switzerland-trump-tariffs-identity-crisis/",
    "timestamp": "2025-08-21T10:45:46Z"
  },
  {
    "title": "To defeat Trumpism, Democrats must speak the language of pain",
    "description": "Effective political messaging targets — and wins — the heart",
    "link": "https://www.salon.com/2025/08/21/to-defeat-trumpism-democrats-must-speak-the-language-of-pain/",
    "timestamp": "2025-08-21T10:45:44Z"
  },
  {
    "title": "Russian Missiles Strike US Electronics Plant in Western Ukraine",
    "description": "Russia attacked a civilian factory in western Ukraine owned by US company Flex Ltd, causing a massive fire and wounding at least 15 people.",
    "link": "https://www.livemint.com/companies/news/russian-missiles-strike-us-electronics-plant-in-western-ukraine-11755773017481.html",
    "timestamp": "2025-08-21T10:43:36Z"
  },
  {
    "title": "Russia’s foreign minister says some issues will have to be worked out before Putin and Zelenskiy can meet",
    "description": "Russian President Vladimir Putin has repeatedly said he is ready to meet Ukrainian President Volodymyr Zelenskiy, but there are some issues that need to be resolved before such a meeting could happen, Russian Foreign Minister Sergei Lavrov said on Thursday.",
    "link": "https://www.independent.ie/world-news/europe/russias-foreign-minister-says-some-issues-will-have-to-be-worked-out-before-putin-and-zelenskiy-can-meet/a2037347127.html",
    "timestamp": "2025-08-21T10:42:19Z"
  },
  {
    "title": "Trump Bashes Gavin Newsom for First Time Since Gov’s Social Media Troll Campaign Began: ‘I Will Save California!!!’",
    "description": "President Trump blasted Gavin Newsom in a late-night tirade, the president's first anti-Newsom post since the California governor's social media team launched a snippy troll campaign against the White House.\nThe post Trump Bashes Gavin Newsom for First Time S…",
    "link": "https://www.mediaite.com/media/news/trump-bashes-gavin-newsom-for-first-time-since-govs-social-media-troll-campaign-began-i-will-save-california/",
    "timestamp": "2025-08-21T10:38:08Z"
  },
  {
    "title": "Trump's war on statistics risks leaving us all in the dark",
    "description": "President Donald Trump has begun a war on any numbers that don’t serve him, from economic statistics to crime data that doesn’t support his demand for power.",
    "link": "https://biztoc.com/x/ccbdd2718cb1b4dd",
    "timestamp": "2025-08-21T10:37:07Z"
  },
  {
    "title": "China acts to curb Nvidia chip sales after US Commerce Secretary's ‘insulting’ remark: ‘We don't sell them our best…'",
    "description": "China restricted Nvidia's H20 processor sales after US Commerce Secretary Howard Lutnick's remarks were deemed insulting. Chinese regulators advised tech firms to halt orders, citing security concerns.",
    "link": "https://www.livemint.com/companies/china-hits-back-at-nvidia-chip-sales-after-us-commerce-secretarys-insulting-remark-we-dont-sell-them-our-best-11755766912933.html",
    "timestamp": "2025-08-21T10:30:54Z"
  },
  {
    "title": "Americans fear democracy at risk as gerrymandering battles intensify, poll finds",
    "description": "A recent Reuters/Ipsos poll reveals that a majority of Americans, 55%, oppose partisan redistricting, viewing it as detrimental to democracy. The poll also highlights a significant concern, with 57% fearing American democracy is in danger. Distrust exists bet…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/americans-fear-democracy-at-risk-as-gerrymandering-battles-intensify-poll-finds/articleshow/123430812.cms",
    "timestamp": "2025-08-21T10:28:44Z"
  },
  {
    "title": "Tracking US and NATO support for Ukraine: A full breakdown",
    "description": "Ukraine has received at least 309 billion euros ($360bn) in aid from 41 countries since the start of the war.",
    "link": "https://www.aljazeera.com/news/2025/8/21/tracking-us-and-nato-support-for-ukraine-a-full-breakdown",
    "timestamp": "2025-08-21T10:28:09Z"
  },
  {
    "title": "How Fed Chair Powell has used Jackson Hole to signal what's next",
    "description": "Federal Reserve Chair Jerome Powell is set to deliver his annual Jackson Hole speech, a closely watched event for clues about the Fed's next moves. His past speeches have offered insights into the central bank's thinking, influencing interest rate decisions a…",
    "link": "https://economictimes.indiatimes.com/news/international/business/how-fed-chair-powell-has-used-jackson-hole-to-signal-whats-next/articleshow/123430772.cms",
    "timestamp": "2025-08-21T10:26:12Z"
  },
  {
    "title": "EAM Jaishankar roots for increased Indian exports of agri, pharma to Russia",
    "description": "External Affairs Minister S. Jaishankar, after meeting Russian Foreign Minister Sergey Lavrov, reaffirmed India and Russia's commitment to expanding bilateral trade. He stressed the need for a more balanced relationship by boosting Indian exports in sectors l…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/eam-jaishankar-roots-for-increased-indian-exports-of-agri-pharma-to-russia/articleshow/123430640.cms",
    "timestamp": "2025-08-21T10:25:54Z"
  },
  {
    "title": "Why Putin wasn’t arrested in the US despite ICC warrant and won’t be nabbed in Europe either",
    "description": "The Russian leader moved freely in Alaska meeting Trump. Now, a European summit with Zelensky may follow and legal loopholes could once again protect him.",
    "link": "https://7news.com.au/news/world/why-putin-wasnt-arrested-in-the-us-despite-icc-warrant-and-wont-be-nabbed-in-europe-either-c-19758554",
    "timestamp": "2025-08-21T10:22:27Z"
  },
  {
    "title": "Posti suspends commercial freight services to US",
    "description": "US President Donald Trump's decision to remove a duty exemption on shipments of a certain value has had \"a global impact on all operators transporting goods to the United States\", Posti said.",
    "link": "https://yle.fi/a/74-20178678",
    "timestamp": "2025-08-21T10:21:31Z"
  },
  {
    "title": "Russia’s third largest aerial attack on Ukraine this year leaves at least one dead, 15 injured",
    "description": "The attack mostly targeted western regions of the country, the air force said, where much of the military aid provided by Ukraine’s Western allies is believed to be delivered and stored.",
    "link": "https://nypost.com/2025/08/21/world-news/major-russian-drone-and-missile-attack-on-ukraine-kills-1-injures-15/",
    "timestamp": "2025-08-21T10:21:09Z"
  },
  {
    "title": "Gavin Newsom’s Desperate Meme Act Will Definitely Save Democrats",
    "description": "MAGA better run and hide. Democrat California Gov. Gavin Newsom is mocking Donald Trump on the internet! That’s a real narrative that Democrats and the dying news media are trying to push this week in what is another naked attempt at giving that corpse of a p…",
    "link": "https://thefederalist.com/2025/08/21/gavin-newsoms-desperate-meme-act-will-definitely-save-democrats/",
    "timestamp": "2025-08-21T10:20:00Z"
  },
  {
    "title": "The Trump Effect: How a $1M Bitcoin Prediction Shines a Light on Bitcoin Hyper ($HYPER)",
    "description": "At the Wyoming Blockchain Symposium in Jackson Hole, Eric Trump, son of President Donald Trump, made a bold prediction: he’s convinced Bitcoin will someday be worth over $1M. He’s completely committed to this belief, to the point that he now spends over half …",
    "link": "https://bitcoinist.com/eric-trump-predicts-1m-bitcoin-market-spotlight-on-hyper/",
    "timestamp": "2025-08-21T10:15:14Z"
  },
  {
    "title": "Americans worry democracy in danger amid gerrymandering fights, Reuters/Ipsos poll finds",
    "description": "WASHINGTON (Reuters) -Most Americans believe that efforts to redraw U.S. House of Representatives districts to maximize partisan gains, like those under way in Texas and California, are bad for democracy, a new Reuters/Ipsos poll found. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/21/americans-worry-democracy-in-danger-amid-gerrymandering-fights-reutersipsos-poll-finds",
    "timestamp": "2025-08-21T10:15:00Z"
  },
  {
    "title": "North Korea may have a secret base near China with missiles that could reach the U.S.",
    "description": "North Korea has a covert military base near the Chinese border that poses a “potential nuclear threat” to the United States mainland, according to new research",
    "link": "https://www.nbcnews.com/world/asia/north-korea-secret-missile-base-china-nuclear-kim-jong-un-rcna226231",
    "timestamp": "2025-08-21T10:13:08Z"
  },
  {
    "title": "Trans volleyball player incident unleashes parade of angry parents on Illinois school board meeting",
    "description": "A trans athlete made the Conant High School girls' volleyball team in Illinois, sparking heated debate among parents at a District 211 school board meeting.",
    "link": "https://www.foxnews.com/sports/trans-volleyball-player-incident-unleashes-parade-angry-parents-illinois-school-board-meeting",
    "timestamp": "2025-08-21T10:09:22Z"
  },
  {
    "title": "How to still think Trump’s a bellend if he somehow secures peace",
    "description": "IF Trump has somehow helped to bring peace to Ukraine you might be forced to reevaluate your view of him. If that happens, here’s how to remember he’s still a colossal dickhead.",
    "link": "https://www.thedailymash.co.uk/news/international/how-to-still-think-trumps-a-bellend-if-he-somehow-secures-peace-20250821259794",
    "timestamp": "2025-08-21T10:04:20Z"
  },
  {
    "title": "Countries Are Strategizing How to Please Trump",
    "description": "",
    "link": "https://biztoc.com/x/dd51f196d620f5d7",
    "timestamp": "2025-08-21T10:03:29Z"
  },
  {
    "title": "The Sad Legacy of the Bush Political Dynasty: George H.W. Bush",
    "description": "It has been more than 16 years since the second Bush of the father-son political dynasty left office, but the damage done by these two men continues to affect the lives not only of people in the country but around the world. Unfortunately, in the present age …",
    "link": "https://biztoc.com/x/a8f3f142336fbaf7",
    "timestamp": "2025-08-21T10:03:05Z"
  },
  {
    "title": "RFK Jr. vowed to find the causes of autism. Then he shut down research trying to do just tha",
    "description": "Federal funding for autism research has been gutted in Trump's second term.",
    "link": "https://www.salon.com/2025/08/21/rfk-jr-vowed-to-find-the-causes-of-autism-then-he-shut-down-research-trying-to-do-just-tha_partner/",
    "timestamp": "2025-08-21T10:00:50Z"
  },
  {
    "title": "Ex-Biden spin doctor Ian Sams, slammed by Trump as 'below average,' grilled in House autopen probe",
    "description": "Former Biden spokesman Ian Sams is appearing before the House Oversight Committee for a transcribed interview on Thursday.",
    "link": "https://www.foxnews.com/politics/ex-biden-spin-doctor-ian-sams-slammed-trump-below-average-grilled-house-autopen-probe",
    "timestamp": "2025-08-21T10:00:47Z"
  },
  {
    "title": "William Watson: The ‘post-American world economy’ will be a grim place",
    "description": "For 80 years the U.S. provided insurance for a stable world trading system. Now it's extracting profits from its allies and former friends",
    "link": "https://financialpost.com/opinion/post-american-world-economy-grim-place",
    "timestamp": "2025-08-21T10:00:11Z"
  },
  {
    "title": "$21M Bitcoin blitz! – Winklevoss twins back Trump’s crypto vision",
    "description": "The new PAC will also fund Bitcoin and crypto bill of rights to codify right to self-custody.",
    "link": "https://ambcrypto.com/21m-bitcoin-blitz-winklevoss-twins-back-trumps-crypto-vision/",
    "timestamp": "2025-08-21T10:00:03Z"
  },
  {
    "title": "Ex-Paramount chief feared CBS interview of 'drowsy' Biden would be exposed in Trump lawsuit: Report",
    "description": "Shari Redstone, the former head of Paramount, revealed CBS personnel had told her then-President Biden appeared drowsy during a 2023 interview with Scott Pelley.",
    "link": "https://www.foxnews.com/media/ex-paramount-chief-feared-cbs-interview-drowsy-biden-would-exposed-trump-lawsuit-report",
    "timestamp": "2025-08-21T10:00:02Z"
  },
  {
    "title": "Liberals: Alas, the Time Has Come to Throw John Rawls Under the Bus",
    "description": "As fascism has returned to political power, elite liberalism seems to have been caught off guard, left unsure how to respond, how to argue for itself. Why?Pre-Trump liberalism did not cause or provoke a far-right backlash: Fascism is an agential ideology with…",
    "link": "https://newrepublic.com/article/199273/john-rawls-liberals-philosopher-bus-neutrality",
    "timestamp": "2025-08-21T10:00:00Z"
  },
  {
    "title": "Elon Musk Just Won His War on Labor Unions",
    "description": "The Fifth Circuit Court of Appeals ruled on Tuesday that the National Labor Relations Board’s structure is unconstitutional, dealing another severe blow to the board’s ability to resolve labor-management disputes and enforce federal labor laws across the coun…",
    "link": "https://newrepublic.com/article/199356/elon-musk-won-war-labor",
    "timestamp": "2025-08-21T10:00:00Z"
  },
  {
    "title": "The Joseph McCarthy of the Trump Era",
    "description": "Laura Loomer declares: “We need to make McCarthy great again.”",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/laura-loomer-trump-era-joseph-mccarthy/683928/",
    "timestamp": "2025-08-21T10:00:00Z"
  },
  {
    "title": "Trump's war on statistics risks leaving us all in the dark",
    "description": "President Donald Trump has begun a war on any numbers that don’t serve him, from economic statistics to crime data that doesn’t support his demand for power.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-statistics-crime-economy-health-rcna226069",
    "timestamp": "2025-08-21T10:00:00Z"
  },
  {
    "title": "Trump’s USDA Eliminates Support for Renewable Energy, a Lifeline for Farmers",
    "description": "This story was originally published by Inside Climate News and is reproduced here as part of the Climate Desk collaboration. The US Department of Agriculture announced this week that it will stop funding wind and solar energy on American farmland, a move that…",
    "link": "https://www.motherjones.com/politics/2025/08/usda-wind-solar-projects-funding-grants-farmers/",
    "timestamp": "2025-08-21T10:00:00Z"
  },
  {
    "title": "I Live Where DC Crime Actually Happens. Here’s What Trump Is Missing.",
    "description": "On August 3, someone was shot about five blocks from my house in Washington, DC. Just two nights before, we had called 911 because of gunfire nearby—not an unusual occurrence. A week later, someone was murdered six or seven blocks away, in broad daylight. My …",
    "link": "https://www.motherjones.com/politics/2025/08/i-live-where-dc-crime-actually-happens-heres-what-trump-is-missing/",
    "timestamp": "2025-08-21T10:00:00Z"
  },
  {
    "title": "Iran holds military drills after big losses in war with Israel",
    "description": "DUBAI: Iran on Thursday (Aug 21) launched its first solo military exercises since its June war with Israel, state media reported, seeking to reassert an image of strength after suffering heavy losse",
    "link": "https://www.channelnewsasia.com/world/iran-holds-military-drills-after-big-losses-war-israel-5306631",
    "timestamp": "2025-08-21T09:59:00Z"
  },
  {
    "title": "Ukraine-Russia conflict: Zelenskiy calls for strong US response if Putin refuses to meet him",
    "description": "Russian strikes kill one, injure 18 in largest aerial attack of August",
    "link": "https://www.irishtimes.com/world/europe/2025/08/21/ukraine-russia-conflict-zelenskiy-calls-for-strong-us-response-if-putin-refuses-to-meet-him/",
    "timestamp": "2025-08-21T09:56:14Z"
  },
  {
    "title": "Major Russian drone and missile attack on Ukraine kills 1, injures 15",
    "description": "The attack mostly targeted western regions of the country, the air force said, where much of the military aid provided by Ukraine's Western allies is believed to be delivered and stored",
    "link": "https://www.npr.org/2025/08/21/nx-s1-5509468/russia-ukraine-drone-missile-strike-kyiv",
    "timestamp": "2025-08-21T09:52:24Z"
  },
  {
    "title": "US college declines to oppose Trump travel ban after Iranian students’ plea",
    "description": "Letter called on University of Texas at Austin to denounce ban on Iranians and take 'immediate legal action'.",
    "link": "https://www.aljazeera.com/news/2025/8/21/us-college-declines-to-oppose-trump-travel-ban-after-iranian-students-plea",
    "timestamp": "2025-08-21T09:48:16Z"
  },
  {
    "title": "Oil Market Braced For Glut as Asian Refiners Look Further Afield For Crude",
    "description": "Asian oil refiners have been hunting for crude from further afield than their usual suppliers in the Middle East, but this more diversified strategy isn’t stirring a market that’s bracing for a glut.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-market-braced-for-glut-as-asian-refiners-look-further-afield-for-crude",
    "timestamp": "2025-08-21T09:44:20Z"
  },
  {
    "title": "Uganda agrees to conditional US migrant deal",
    "description": "Uganda said it would accept some migrants deported from the US, but not those with criminal records. The Trump administration earlier deported migrants to the third countries of Eswatini and South Sudan.",
    "link": "https://www.dw.com/en/uganda-agrees-to-conditional-us-migrant-deal/a-73715803",
    "timestamp": "2025-08-21T09:44:00Z"
  },
  {
    "title": "China is expanding into digital currencies, hoping to promote use of its 'people's money'",
    "description": "China has been expanding use of digital currencies as it promotes wider use of its yuan, or renminbi, to reflect its status as the world's second-largest economy",
    "link": "https://abcnews.go.com/Technology/wireStory/china-expanding-digital-currencies-hoping-promote-peoples-money-124838031",
    "timestamp": "2025-08-21T09:42:29Z"
  },
  {
    "title": "First security guarantees, then Putin summit, Zelensky says",
    "description": "Ukrainian President Volodymyr Zelensky said he could meet with Russian President Vladimir Putin, but only after his allies agreed on security guarantees for Ukraine that would deter future Russian attacks once the fighting stops. In comments released Thursday…",
    "link": "https://www.digitaljournal.com/world/first-security-guarantees-then-putin-summit-zelensky-says/article",
    "timestamp": "2025-08-21T09:42:20Z"
  },
  {
    "title": "First Security Guarantees, Then Putin Summit, Zelensky Says",
    "description": "Ukrainian President Volodymyr Zelensky said he could meet with Russian President Vladimir Putin, but only after his allies agreed on security guarantees for Ukraine that would deter future Russian attacks once the fighting stops.",
    "link": "https://www.ibtimes.com/first-security-guarantees-then-putin-summit-zelensky-says-3781365",
    "timestamp": "2025-08-21T09:42:08Z"
  },
  {
    "title": "Health remedies for a hazardous world",
    "description": "Health interventions can help remedy many of the hazards around us, whether disease, discomfort, uncertainty, or instability. Drugs for attention deficit/hyperactivity disorder have proved useful to alleviate core symptoms, but in a first of its kind a large …",
    "link": "https://www.bmj.com/content/390/bmj.r1775",
    "timestamp": "2025-08-21T09:41:02Z"
  },
  {
    "title": "Trump’s Global War on Decarbonization",
    "description": "The Trump administration is doing everything it can to ensure that fossil fuels remain dominant in the energy mix of the twenty-first century. If it succeeds, the short-term returns to the US will be huge; but the long-term damage to the planet will be orders…",
    "link": "https://www.project-syndicate.org/commentary/trump-global-war-on-decarbonization-green-technologies-by-mark-blyth-and-daniel-driscoll-2025-08",
    "timestamp": "2025-08-21T09:40:34Z"
  },
  {
    "title": "La guerra global de Trump contra la descarbonización",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/trump-global-war-on-decarbonization-green-technologies-by-mark-blyth-and-daniel-driscoll-2025-08/spanish",
    "timestamp": "2025-08-21T09:40:34Z"
  },
  {
    "title": "Sean 'Diddy' Combs judge urged by prosecutors to reject request for acquittal or retrial",
    "description": "Prosecutors in the Sean \"Diddy\" Combs case have urged the judge to reject a request by the hip-hop mogul for acquittal or retrial on prostitution-related charges.",
    "link": "https://gold.manxradio.com/news/entertainment/sean-diddy-combs-judge-urged-by-prosecutors-to-reject-request-for-acquittal-or-retrial/",
    "timestamp": "2025-08-21T09:40:00Z"
  },
  {
    "title": "‘We Have a Crisis’: Alex Jones Warns That Trump Is Headed for Health ‘Collapse’ - NewsBreak",
    "description": "Alex Jones warned that President Donald Trump is \"declining faster and faster,\" and headed for a health \"collapse\" on Wednesday.  The post ‘We Have a Crisi",
    "link": "https://www.newsbreak.com/share/4186018905970-we-have-a-crisis-alex-jones-warns-that-trump-is-headed-for-health-collapse?_f=app_share&amp;pd=00SZiqXz&amp;lang=en_US&amp;send_time=1755769118&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.20.0.20%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button-v2&amp;s=i2",
    "timestamp": "2025-08-21T09:39:08Z"
  },
  {
    "title": "Sean Hannity’s Viral 'Loony' Line Sparks Irony Fest On Social Media",
    "description": "\"Irony is dead,\" snarked one critic. Many others agreed.",
    "link": "https://www.huffpost.com/entry/sean-hannity-irony_n_68a6e1e2e4b0903a790e14b7",
    "timestamp": "2025-08-21T09:36:34Z"
  },
  {
    "title": "Trump Can’t Actually Ban Mail Ballots. He Can Still Do a Ton of Damage.",
    "description": "His threats serve another nefarious purpose.",
    "link": "https://slate.com/news-and-politics/2025/08/trump-mail-ballots-ban-voting-executive-order.html",
    "timestamp": "2025-08-21T09:35:00Z"
  },
  {
    "title": "Türkiye to kick off vital railway project for Zangezur Corridor",
    "description": "Türkiye will lay the foundation on Aug. 22 for a major railway project in the country’s east that will form a strategic segment of the Zangezur Corridor, a planned key route in the South Caucasus.",
    "link": "https://www.hurriyetdailynews.com/turkiye-to-kick-off-vital-railway-project-for-zangezur-corridor-212758",
    "timestamp": "2025-08-21T09:34:36Z"
  },
  {
    "title": "China is more eager to use Nvidia’s AI chips than it lets on",
    "description": "Beijing has warned Chinese tech firms of ‘backdoor’ devices in US-made chips, but this may be a feint. China wants Huawei to catch-up, given its goal of chip self-reliance, but clearly needs Nvidia’s AI chips till then. America’s easing of export curbs to Chi…",
    "link": "https://www.livemint.com/opinion/online-views/nvidia-ai-chips-h20-china-jensen-huang-donald-trump-huawei-technologies-bytedance-alibaba-deepseek-iflytek-tariff-truce-11755692896326.html",
    "timestamp": "2025-08-21T09:30:10Z"
  },
  {
    "title": "CASEY: What to make of the latest Roanoke College political poll",
    "description": "The August survey of 702 likely Virginia voters found Democratic Rep. Abigail Spanberger is leading Republican Lieutenant Gov. Winsome Earle-Sears by 7%. But another Roanoke College poll in May put Spanberger’s lead at 17%, leading some to suggest the Republi…",
    "link": "https://roanoke.com/news/local/government-politics/elections/article_579645dc-9950-4f45-890f-887dae651c49.html",
    "timestamp": "2025-08-21T09:30:00Z"
  },
  {
    "title": "'South Park' teases jab at Trump’s D.C. takeover as Season 27 episode 3 drops explosive trailer. How to watch for free",
    "description": "'South Park', one of the longest-running animated comedies in television history, has once again taken potshots at the Trump administration in its latest episode. The new episode will be entitled “Sickofancy,” and in it, it appears that Towelie will make his …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-south-park-teases-jab-at-trumps-d-c-takeover-as-season-27-episode-3-drops-trailer-how-to-watch-for-free/articleshow/123429438.cms",
    "timestamp": "2025-08-21T09:29:29Z"
  },
  {
    "title": "Fed governor targeted with mortgage fraud probe",
    "description": "President Donald Trump has new, familiar ammunition in his pressure campaign against the Federal Reserve: mortgage fraud.\nThe president called on Governor Lisa Cook to resign Wednesday after Federal Housing Finance Agency Director Bill Pulte asked Attorney Ge…",
    "link": "https://biztoc.com/x/b3ede2e54ea299cb",
    "timestamp": "2025-08-21T09:29:04Z"
  },
  {
    "title": "Trump official responds to rock star’s slam about Oval Office decor: ‘A washed up, has-been loser’",
    "description": "The remarks are in response to an Instagram post the musician made ridiculing President Trump and his redecoration of the Oval Office.",
    "link": "https://www.pennlive.com/entertainment/2025/08/trump-official-responds-to-rock-stars-slam-about-oval-office-decor-a-washed-up-has-been-loser.html",
    "timestamp": "2025-08-21T09:26:12Z"
  },
  {
    "title": "D.C’s Senator Knew This Would Happen",
    "description": "rime was already on the decline—but it was never really about crime.",
    "link": "https://slate.com/podcasts/what-next/2025/08/senator-ankit-jain-speaks-up-for-washington-d-c",
    "timestamp": "2025-08-21T09:20:00Z"
  },
  {
    "title": "Russian drone and missile attack on Ukraine kills one, wounds 15",
    "description": "Russia unleashes a major attack on Ukraine in the wake of renewed efforts to strike a ceasefire.",
    "link": "https://www.aljazeera.com/news/2025/8/21/russian-drone-and-missile-attack-on-ukraine-kills-one-wounds-15",
    "timestamp": "2025-08-21T09:18:49Z"
  },
  {
    "title": "Indian Oil and Bharat Petroleum resume Russian oil purchases",
    "description": "The move could impact the supply to China, which had increased its intake during the Indian refiners' hiatus.",
    "link": "https://www.offshore-technology.com/news/indian-oil-bharat-petroleum-russian-purchases/",
    "timestamp": "2025-08-21T09:16:37Z"
  },
  {
    "title": "Elon Musk and JD Vance's Relationship Under Scrutiny Amid 2028 Talk",
    "description": "The tech mogul and the vice president have a personal friendship, but will it last until the next election?",
    "link": "https://www.newsweek.com/elon-musk-jd-vance-relationship-2028-2116776",
    "timestamp": "2025-08-21T09:16:25Z"
  },
  {
    "title": "‘South Park’ Continues Mocking Trump—Also Takes Aim At ChatGPT And Tech CEOs",
    "description": "The episode “Sickofancy” depicted the likes of Apple CEO Tim Cook and Meta CEO Mark Zuckerberg trying to flatter the president with lavish gifts in exchange for favors.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/08/21/south-park-continues-mocking-trump-also-takes-aim-at-chatgpt-and-tech-ceos/",
    "timestamp": "2025-08-21T09:12:39Z"
  },
  {
    "title": "Tensions flare over gender pronouns as trans rights and religious freedom collide",
    "description": "Gender pronouns are at the forefront of a growing workplace conflict pitting religious beliefs against the rights of trans and nonbinary people.",
    "link": "https://www.usatoday.com/story/money/2025/08/21/transgender-rights-religious-freedom-gender-pronouns-controversy/85666816007/",
    "timestamp": "2025-08-21T09:12:23Z"
  },
  {
    "title": "Uganda Agrees to Migrant Deal With Trump Administration",
    "description": "The deportation agreement comes with certain conditions.",
    "link": "https://www.newsweek.com/uganda-trump-migrant-deal-deportations-2116814",
    "timestamp": "2025-08-21T09:11:45Z"
  }
]