[
  {
    "title": "Here’s How Many Guns the Trump Administration Kept From Mexican Cartels",
    "description": "The Trump administration has stopped more than 4,000 firearms from going to Mexican drug cartels over the last year, and estimates it kept about 1,600... Read More\nThe post Here’s How Many Guns the Trump Administration Kept From Mexican Cartels appeared first…",
    "link": "https://www.dailysignal.com/2026/02/19/heres-how-many-guns-the-trump-administration-kept-from-mexican-cartels/",
    "timestamp": "2026-02-19T15:48:22Z"
  },
  {
    "title": "Trump gives Hamas 'a lot of credit' for digging up dead bodies of hostages they murdered",
    "description": "President Donald Trump argued that Hamas deserved \"a lot of credit\" for digging up the dead bodies of their victims.During the first Board of Peace meeting in Washington, D.C., on Thursday, Trump noted that \"every last remaining hostage, both living and dead,…",
    "link": "https://www.rawstory.com/trump-hostages-hamas-credit/",
    "timestamp": "2026-02-19T15:48:21Z"
  },
  {
    "title": "Trump Warns Iran ‘Must Make a Deal’ — Hints at Timeline For Possible Attack",
    "description": "\"They must make a deal. Or if that doesn't happen, I maybe can understand. If it doesn't happen, it doesn't happen. But bad things will happen if it doesn't\"\nThe post Trump Warns Iran ‘Must Make a Deal’ — Hints at Timeline For Possible Attack first appeared o…",
    "link": "https://www.mediaite.com/media/news/trump-warns-iran-must-make-a-deal-hints-at-timeline-for-possible-attack/",
    "timestamp": "2026-02-19T15:45:59Z"
  },
  {
    "title": "Trump announces $7 billion Gaza relief pledge from nine countries at Board of Peace meeting",
    "description": "President Trump announced that nine members of the inaugural Board of Peace have agreed to pledge $7 billion toward a Gaza relief package",
    "link": "https://www.wmur.com/article/trump-inaugural-board-of-peace-meeting/70417933",
    "timestamp": "2026-02-19T15:44:50Z"
  },
  {
    "title": "Trump announces $7 billion Gaza relief pledge from nine countries at Board of Peace meeting",
    "description": "President Trump announced that nine members of the inaugural Board of Peace have agreed to pledge $7 billion toward a Gaza relief package",
    "link": "https://www.wcvb.com/article/trump-inaugural-board-of-peace-meeting/70417933",
    "timestamp": "2026-02-19T15:44:45Z"
  },
  {
    "title": "Tariffs paid by midsized US firms tripled last year, new analysis from JPMorganChase Institute shows",
    "description": "It's part of a growing body of economic analyses that counter the administration's claims that foreigners pay the tariffs.",
    "link": "https://www.bostonherald.com/2026/02/19/trump-tariffs-midsized-companies/",
    "timestamp": "2026-02-19T15:44:05Z"
  },
  {
    "title": "Tariffs paid by midsized US firms tripled last year, new analysis from JPMorganChase Institute shows",
    "description": "It's part of a growing body of economic analyses that counter the administration's claims that foreigners pay the tariffs.",
    "link": "https://www.denverpost.com/2026/02/19/trump-tariffs-midsized-companies/",
    "timestamp": "2026-02-19T15:44:05Z"
  },
  {
    "title": "Trump announces $7 billion Gaza relief pledge from nine countries at Board of Peace meeting",
    "description": "President Trump announced that nine members of the inaugural Board of Peace have agreed to pledge $7 billion toward a Gaza relief package",
    "link": "https://www.wtae.com/article/trump-inaugural-board-of-peace-meeting/70417933",
    "timestamp": "2026-02-19T15:43:03Z"
  },
  {
    "title": "Trump officials reportedly planning 5,000 person military base in Gaza",
    "description": "The Trump administration is moving forward with constructing a significant military base in southern Gaza as part of the peacekeeping efforts in President Trump's plan for the region, The Guardian reports",
    "link": "https://www.haaretz.com/gaza/2026-02-19/ty-article/trump-officials-reportedly-planning-5-000-person-military-base-in-gaza/0000019c-7633-d759-a7bf-febbef7e0000",
    "timestamp": "2026-02-19T15:41:22Z"
  },
  {
    "title": "Reporters Arrested at Trump’s Secret Deportation Compound in Cameroon",
    "description": "Four journalists and a lawyer were arrested in Cameroon trying to cover Donald Trump’s secret deportation program.The journalists were interviewing deported immigrants at a government detention center in the capital, Yaoundé, when they were detained by police…",
    "link": "https://newrepublic.com/post/206771/reporters-arrested-trump-secret-deportation-compound-cameroon",
    "timestamp": "2026-02-19T15:41:16Z"
  },
  {
    "title": "Trump Says Climate Repeal Saves $1.3 Trillion. The EPA’s Math Differs",
    "description": "The agency’s own cost-benefit assessment for revoking the endangerment finding points to steep costs that may outweigh the savings.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-climate-repeal-saves-1-3-trillion-the-epas-math-differs",
    "timestamp": "2026-02-19T15:40:59Z"
  },
  {
    "title": "FIFA boss Gianni Infantino dons MAGA-style hat at Trump's Board of Peace meeting",
    "description": "FIFA president Gianni Infantino was in attendance on Thursday, Feb. 19 as President Donald Trump convened the first meeting of his Board of Peace.",
    "link": "https://www.usatoday.com/story/sports/soccer/worldcup/2026/02/19/gianni-infantino-trump-board-of-peace-maga-hat/88755552007/",
    "timestamp": "2026-02-19T15:38:09Z"
  },
  {
    "title": "US hawk insults Iranian leadership",
    "description": "Senator Lindsey Graham has called Iran’s supreme leader a “fat man,” dismissing threats against US warships amid soaring regional tensions Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632788-us-graham-iran-insult/",
    "timestamp": "2026-02-19T15:37:57Z"
  },
  {
    "title": "96 Percent of People Charged With Human Trafficking Are U.S. Citizens",
    "description": "Just 26 undocumented immigrants faced federal trafficking charges in 2023.",
    "link": "https://reason.com/2026/02/19/96-percent-of-people-charged-with-human-trafficking-are-u-s-citizens/",
    "timestamp": "2026-02-19T15:37:48Z"
  },
  {
    "title": "Trump Says Washington Will Contribute $10Bln to Board of Peace Gaza Reconstruction Effort",
    "description": "WASHINGTON (Sputnik) - The United States will contribute $10 billion to the Board of Peace reconstruction efforts for Gaza, President Donald Trump said on Thursday.",
    "link": "https://sputnikglobe.com/20260219/trump-says-washington-will-contribute-10bln-to-board-of-peace-gaza-reconstruction-effort-1123660809.html",
    "timestamp": "2026-02-19T15:37:00Z"
  },
  {
    "title": "OpenAI reportedly finalizing $100B deal at more than $850B valuation",
    "description": "OpenAI is reportedly getting close to closing a $100 billion deal, with backers including Amazon, Nvidia, SoftBank, and Microsoft. The deal would value the...",
    "link": "https://finance.yahoo.com/news/openai-reportedly-finalizing-100b-deal-153558378.html",
    "timestamp": "2026-02-19T15:35:58Z"
  },
  {
    "title": "Trump Calls AOC a ‘Young, Attractive Woman’ While Dragging Her for Munich Gaffe",
    "description": "Donald Trump predicted Alexandria Ocasio-Cortez may see her political career come crashing down after stumbling while answering a question about China.\nThe post Trump Calls AOC a ‘Young, Attractive Woman’ While Dragging Her for Munich Gaffe first appeared on …",
    "link": "https://www.mediaite.com/media/tv/trump-calls-aoc-a-young-attractive-woman-while-dragging-her-for-munich-gaffe/",
    "timestamp": "2026-02-19T15:35:04Z"
  },
  {
    "title": "Donald Trump is mentioned in the Epstein Files over a million times. This is an illustration of what that looks like. (Greg Olear/PREVAIL)",
    "description": "Greg Olear / PREVAIL:\nDonald Trump is mentioned in the Epstein Files over a million times.  This is an illustration of what that looks like.  —  A short video.  —  Replace every word in Anna Karenina, The Decameron, Ulysses, and Moby-Dick with the words “Dona…",
    "link": "https://www.memeorandum.com/260219/p34",
    "timestamp": "2026-02-19T15:35:00Z"
  },
  {
    "title": "Jon Ossoff calls Trump's election victories sign of ‘disease’ in America",
    "description": "Georgia Sen. Jon Ossoff called President Donald Trump a \"symptom of a deeper disease\" in American society during an interview with late-night host Stephen Colbert.",
    "link": "https://www.foxnews.com/media/jon-ossoff-calls-trumps-election-victories-sign-disease-america",
    "timestamp": "2026-02-19T15:34:45Z"
  },
  {
    "title": "US and Israel issue dire warnings to Iran alongside US military buildup",
    "description": "President Trump issued a stark warning to Iran, demanding a  meaningful deal  within 10 days or facing  bad things,  as the US deploys significant military assets to the region.  These escalating tensions follow Omani-mediated talks aimed at preventing Iran's…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-and-israel-issue-dire-warnings-to-iran-alongside-us-military-buildup/articleshow/128565538.cms",
    "timestamp": "2026-02-19T15:33:05Z"
  },
  {
    "title": "Oh the Irony: Trump Leads ‘Board of Peace’ While US Carrier Groups Mass Near Iran",
    "description": "As warships gather near Iran, Trump’s “Board of Peace” tests whether leverage and Gulf alliances can deliver results without the old transatlantic architecture.\nThe post Oh the Irony: Trump Leads ‘Board of Peace’ While US Carrier Groups Mass Near Iran first a…",
    "link": "https://www.mediaite.com/opinion/oh-the-irony-trump-leads-board-of-peace-while-us-carrier-groups-mass-near-iran/",
    "timestamp": "2026-02-19T15:31:07Z"
  },
  {
    "title": "Trump, 79, Struggles to Read Names of Multiple World Leaders",
    "description": "The inaugural meeting of Donald Trump’s Board of Peace took place Thursday morning in Washington, convening leaders from two dozen countries in order to oversee the Gaza Peace Plan. But Trump, who spoke at the top of the assembly, very obviously had a difficu…",
    "link": "https://newrepublic.com/post/206779/donald-trump-forgets-names-titles-world-leaders",
    "timestamp": "2026-02-19T15:30:59Z"
  },
  {
    "title": "Donald Trump claims $7 billion aid pledge for Gaza from allies",
    "description": "Former President Donald Trump announced that his allies have collectively pledged more than $7 billion towards relief efforts in Gaza. This significant financial commitment aims to address the ongoing humanitarian crisis and support rebuilding initiatives in …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-claims-7-billion-aid-pledge-for-gaza-from-allies/articleshow/128565368.cms",
    "timestamp": "2026-02-19T15:30:36Z"
  },
  {
    "title": "White House Disses Springsteen in Statement, Politician Responds",
    "description": "The White House Communications Director dissed Bruce Springsteen in a statement only for a Maryland politician to respond in defense. Continue reading…",
    "link": "https://loudwire.com/white-house-disses-bruce-springsteen-again-politician-fires-back/",
    "timestamp": "2026-02-19T15:29:44Z"
  },
  {
    "title": "CNN Host Lets White Liberal Lecture Black Conservative On Race",
    "description": "“CNN NewsNight” Abby Phillip sat quietly Wednesday as a white comedian lectured Republican strategist Shermichael Singleton about race.",
    "link": "https://dailycaller.com/2026/02/19/cnn-newsnight-paul-mecurio-shermichael-singleton-race/",
    "timestamp": "2026-02-19T15:28:29Z"
  },
  {
    "title": "Lawrence O’Donnell Sounds Alarm on Trump’s Rigged Election ‘Crime Spree’: ‘The Most Important Story This Year’ | Video",
    "description": "The MS NOW host warns the president is planning crimes \"even worse than the conspiracy he was indicted for running\"\nThe post Lawrence O’Donnell Sounds Alarm on Trump’s Rigged Election ‘Crime Spree’: ‘The Most Important Story This Year’ | Video appeared first …",
    "link": "https://www.thewrap.com/creative-content/tv-shows/lawrence-odonnell-trump-crime-spree-midterms/",
    "timestamp": "2026-02-19T15:26:30Z"
  },
  {
    "title": "Attacking Iran Would Be Monstrous",
    "description": "The Financial Times’ report on the approaching U.S. attack on Iran opens with this line: As oil prices surge and Donald Trump orders one of the largest American military build-ups in the Middle East since the Iraq war, negotiations between the US and Iran inc…",
    "link": "https://www.antiwar.com/blog/2026/02/19/attacking-iran-would-be-monstrous/",
    "timestamp": "2026-02-19T15:25:29Z"
  },
  {
    "title": "Peace Council underway: Possible deal with Iran in 10 days, says Trump (live)",
    "description": "Leaders from 40 countries have pledged to provide $5 billion and thousands of personnel for the reconstruction of Gaza\nThe post Peace Council underway: Possible deal with Iran in 10 days, says Trump (live) appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2026/02/19/possible-deal-with-iran-in-10-days-says-trump-peace-council-underway-live/",
    "timestamp": "2026-02-19T15:23:49Z"
  },
  {
    "title": "Trump Says Clarity Around Iran Nuclear Negotiations Will Likely be Known in Next 10 Days",
    "description": "WASHINGTON (Sputnik) - The United States will likely be getting more clarity around the negotiations on Iran's nuclear program in the next ten days, President Donald Trump said on Thursday.",
    "link": "https://sputnikglobe.com/20260219/trump-says-clarity-around-iran-nuclear-negotiations-will-likely-be-known-in-next-10-days-1123660434.html",
    "timestamp": "2026-02-19T15:22:50Z"
  },
  {
    "title": "Trump says US needs to make meaningful deal with Iran, cites good talks",
    "description": "President Donald Trump has emphasized the necessity of a significant agreement with Iran. He mentioned positive discussions are underway. Trump stated that failing to reach a meaningful deal could lead to negative consequences. Indirect talks were held in Gen…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-us-needs-to-make-meaningful-deal-with-iran-cites-good-talks/articleshow/128565067.cms",
    "timestamp": "2026-02-19T15:22:24Z"
  },
  {
    "title": "Trump yet again claims he threatened India, Pakistan with 200% tariffs to deter conflict",
    "description": "US President Donald Trump revealed he once warned India and Pakistan of imposing a hefty 200% tariff on both nations should they engage in conflict. Speaking at a peace event, Trump framed this as a past deterrent, emphasizing his strong personal ties with Pr…",
    "link": "https://economictimes.indiatimes.com/news/india/trump-yet-again-claims-he-threatened-india-pakistan-with-200-tariffs-to-deter-conflict/articleshow/128564263.cms",
    "timestamp": "2026-02-19T15:20:49Z"
  },
  {
    "title": "Trump admits he hoped to get paid for 'Board of Peace': 'Could always use extra cash'",
    "description": "President Donald Trump opened his first Board of Peace meeting by admitting he expected to be personally paid.Speaking on Thursday from the recently-named Donald J. Trump U.S. Institute of Peace, the president insisted that world leaders, such as Pope Leo XII…",
    "link": "https://www.rawstory.com/trump-board-of-peace-cash/",
    "timestamp": "2026-02-19T15:20:40Z"
  },
  {
    "title": "The Epstein Hoax Obsessives Keep Lying About Their Critics",
    "description": "Tara Palmeri insinuated that Michael Tracey disagrees with her because he's paid by Epstein associates. That's a lie.",
    "link": "https://reason.com/2026/02/19/the-epstein-hoax-obsessives-keep-lying-about-their-critics/",
    "timestamp": "2026-02-19T15:20:12Z"
  },
  {
    "title": "Epstein Conspiracy: Actress Mia Farrow Suggests Trump Killed or Freed Ghislaine Maxwell, Swapped with Body Double",
    "description": "Actress Mia Farrow took to the leftist echo chamber social media platform Bluesky to bizarrely suggest that President Donald Trump killed or freed Ghislaine Maxwell -- the longtime associate of the late disgraced financier and convicted sex offender, Jeffrey …",
    "link": "https://www.breitbart.com/entertainment/2026/02/19/epstein-conspiracy-actress-mia-farrow-suggests-trump-killed-or-freed-ghislaine-maxwell-swapped-with-body-double/",
    "timestamp": "2026-02-19T15:20:00Z"
  },
  {
    "title": "There may be no way to leave Iran in a few hours, Poland says",
    "description": "Summary- Polish Prime Minister Donald Tusk urged Polish citizens in Iran to leave immediately on Thursday, warning that evacuation might soon no longer be possible as security conditions worsened amid rising US-Iran tensions. - US president Donald Trump said …",
    "link": "https://freerepublic.com/focus/f-chat/4367473/posts",
    "timestamp": "2026-02-19T15:19:18Z"
  },
  {
    "title": "Indonesia's Prabowo attends first Board of Peace Summit in Washington",
    "description": "Indonesian President Prabowo Subianto arrived at the US Institute of Peace in Washington, D.C., on Thursday morning local time to attend the inaugural Board ...",
    "link": "https://en.antaranews.com/news/405170/indonesias-prabowo-attends-first-board-of-peace-summit-in-washington",
    "timestamp": "2026-02-19T15:19:15Z"
  },
  {
    "title": "Russia offers a $12 trillion package to the US in exchange for the lifting of sanctions",
    "description": "Alongside peace in Ukraine, the Americans and Russians discuss bilateral trade cooperation between them - The Witkoff-Dmitriev talks and the document presented by Putin to Trump in Alaska - How simple is the lifting of sanctions\nThe post Russia offers a $12 t…",
    "link": "https://en.protothema.gr/2026/02/19/russia-offers-a-12-trillion-package-to-the-us-in-exchange-for-the-lifting-of-sanctions/",
    "timestamp": "2026-02-19T15:17:25Z"
  },
  {
    "title": "US trade deficit in goods widens to new record in 2025",
    "description": "The US trade deficit in goods expanded to a new record in 2025, government data showed Thursday, despite sweeping tariffs that President Donald Trump imposed during his first year back in the White House.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-trade-deficit-in-goods-widens-to-new-record-in-2025/articleshow/128564881.cms",
    "timestamp": "2026-02-19T15:17:12Z"
  },
  {
    "title": "U.S. trade deficit slipped to $901 billion last year amid Trump tariffs",
    "description": "The U.S. trade deficit slipped modestly in 2025, a year in which President Donald Trump upended global commerce by slapping double digit tariffs on imports from most countries",
    "link": "https://abcnews.com/Business/wireStory/us-trade-deficit-slipped-901-billion-year-amid-130297929",
    "timestamp": "2026-02-19T15:11:54Z"
  },
  {
    "title": "Where Climate Coverage Goes to Die",
    "description": "Kyle Pope\n\n\n\nThe very notion of public service journalism is under assault at precisely the moment that it’s most needed.\r\n\n\r\n\n\nThe post Where Climate Coverage Goes to Die appeared first on The Nation.",
    "link": "https://www.thenation.com/article/environment/climate-coverage-bezos-washington-post/",
    "timestamp": "2026-02-19T15:11:45Z"
  },
  {
    "title": "5 Takeaways From Our Investigation Into Congressman Cory Mills",
    "description": "Over the past few months, I’ve spoken to more than a dozen people who know Rep. Cory Mills, watched hours of court testimony, and reviewed hundreds of pages of public records to piece together the rise of a Florida Republican now plagued by numerous scandals.…",
    "link": "https://www.motherjones.com/politics/2026/02/takeaways-cory-mills-investigation-florida/",
    "timestamp": "2026-02-19T15:11:45Z"
  },
  {
    "title": "Everybody Hates Cory",
    "description": "Over the past few months, I have spoken to over a dozen people who know Rep. Cory Mills. Nearly everyone, I found, dislikes him. Some outright despise him: “repulsive and vile,” “schmuck,” “little bitch.” Others were more formal. “I have no use for people wit…",
    "link": "https://www.motherjones.com/politics/2026/02/cory-mills-florida-investigation-profile-stolen-valor-trump-sex-workers-pacem-restraining-order-miss-us/",
    "timestamp": "2026-02-19T15:11:36Z"
  },
  {
    "title": "Should the EU and UK join Trump’s board of peace?",
    "description": "After rushing to praise the initiative European leaders are now alarmed",
    "link": "https://theweek.com/politics/trump-eu-uk-board-of-peace-gaza",
    "timestamp": "2026-02-19T15:10:43Z"
  },
  {
    "title": "In-Your-Face DOJ Aide Rides Prosecutors for 'Chief Client' Trump (Ben Penn/Bloomberg Law)",
    "description": "Ben Penn / Bloomberg Law:\nIn-Your-Face DOJ Aide Rides Prosecutors for ‘Chief Client’ Trump  —  When leaders of all 93 US attorneys' offices met for their weekly video chat last month, the 33-year-old Justice Department aide who presided had a blunt message.  …",
    "link": "https://www.memeorandum.com/260219/p29",
    "timestamp": "2026-02-19T15:10:01Z"
  },
  {
    "title": "Rosenior: No place in football for anyone found guilty of racism",
    "description": "Chelsea head coach Liam Rosenior said anyone in football who is found guilty of racism “should not be in the game.”",
    "link": "https://www.skysports.com/football/news/11661/13509603/liam-rosenior-chelsea-boss-says-there-is-no-place-in-football-for-anyone-found-guilty-of-racism",
    "timestamp": "2026-02-19T15:09:00Z"
  },
  {
    "title": "Dropkick Murphys Bring Punk and Activism to Their St. Patrick’s Day Tour: Photos + Video",
    "description": "The veteran punk act played a career-spanning 23-song set in Port Chester, New York.\nDropkick Murphys Bring Punk and Activism to Their St. Patrick’s Day Tour: Photos + Video\nSpencer Kaufman",
    "link": "https://consequence.net/2026/02/dropkick-murphys-port-chester-review-photos/",
    "timestamp": "2026-02-19T15:04:56Z"
  },
  {
    "title": "Former Prince Andrew Arrested! Former South Korean Prez Going To Jail For Life! Accountability! Democracy!",
    "description": "Look at all these nice examples for struggling democracies like the United States to follow.",
    "link": "https://www.wonkette.com/p/former-prince-andrew-arrested-former",
    "timestamp": "2026-02-19T15:02:00Z"
  },
  {
    "title": "US trade deficit widens sharply in December; goods trade gap highest on record in 2025",
    "description": "WASHINGTON, Feb 19 (Reuters) - The U.S. trade deficit widened sharply in December amid a surge in imports, and the goods shortfall in 2025 was the highest on record despite President Donald Trump's tariffs on foreign manufactured merchandise. The trade gap ba…",
    "link": "https://freerepublic.com/focus/f-news/4367471/posts",
    "timestamp": "2026-02-19T15:01:35Z"
  },
  {
    "title": "CBS slammed for 'caving' to Trump FCC's 'bullyboy blustering' on Stephen Colbert",
    "description": "CBS News' decision to pressure Stephen Colbert against airing his interview with Texas Democratic Senate candidate James Talarico is something more insidious than direct censorship, warned analyst Terry Moran in a long-form post to X on Thursday — rather, it'…",
    "link": "https://www.rawstory.com/colbert-media-cbs-slammed-bullying/",
    "timestamp": "2026-02-19T15:01:12Z"
  },
  {
    "title": "‘Free speech is pure bulls**t’ – Macron",
    "description": "French President Emmanuel Macron has blasted social media platforms’ free speech claims as “bulls**t,” calling for transparent algorithms Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632781-macron-free-speech-bull/",
    "timestamp": "2026-02-19T15:00:36Z"
  },
  {
    "title": "IRAN MISSILE SHOW...",
    "description": "Iran and the United States are both applying naval pressure to the talks over Tehran's nuclear program. Tehran held drills Thursday with Russia. Meanwhile, the Americans brought another aircraft carrier closer to the Mideast, the USS Gerald R. Ford. The movem…",
    "link": "https://apnews.com/article/iran-us-russia-drill-nuclear-talks-aircraft-carrier-0456903e0d7a24cfcdc33d53732dee2f",
    "timestamp": "2026-02-19T15:00:14Z"
  },
  {
    "title": "ANALYSIS: How Close Are the U.S. and Iran to War?",
    "description": "WATCH: How Close Are the U.S.\nThe post ANALYSIS: How Close Are the U.S. and Iran to War? appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/analysis-how-close-are-u-s-iran-war/",
    "timestamp": "2026-02-19T15:00:14Z"
  },
  {
    "title": "Trump’s Backlash to Black History",
    "description": "The efforts to whitewash history call for a new approach to memorializing Black history.",
    "link": "https://www.theatlantic.com/podcasts/2026/02/trump-black-history-month/686042/",
    "timestamp": "2026-02-19T15:00:00Z"
  },
  {
    "title": "Epstein’s Island And The Gateway To The Psychology Of Evil",
    "description": "Conspiracy theorists are almost always right. We have been proved right time and time again and we will continue to be right about many things that the corporate media used to call “fringe.” For those out there who are like me; people who have been trying to …",
    "link": "https://www.activistpost.com/epsteins-island-and-the-gateway-to-the-psychology-of-evil/",
    "timestamp": "2026-02-19T14:57:00Z"
  },
  {
    "title": "Trump administration issues warning to hundreds of colleges with low student loan repayment rates",
    "description": "Trump officials are turning up the pressure on colleges to ensure their students repay their federal student loans or risk losing their financial aid.",
    "link": "https://www.cnbc.com/2026/02/19/trump-colleges-low-student-loan-repayment-rates.html",
    "timestamp": "2026-02-19T14:52:47Z"
  },
  {
    "title": "FIFA president Gianni Infantino makes bold 2026 World Cup attendance claim despite widespread ticket prices criticism: ‘Every match is sold out’",
    "description": "Amid the ticket pricing storm, FIFA president Gianni Infantino has remained a central figure in defending the tournament’s commercial model, while insisting that demand has never been higher.\n The build-up to the 2026 World Cup has already turned into a globa…",
    "link": "https://worldsoccertalk.com/news/fifa-president-gianni-infantino-makes-bold-2026-world-cup-attendance-claim-despite-widespread-ticket-prices-criticism-every-match-is-sold-out/",
    "timestamp": "2026-02-19T14:50:53Z"
  },
  {
    "title": "Trump’s ‘Board of Peace’ convenes for first time",
    "description": "Led by US President Donald Trump, the “Board of Peace” convened for its first meeting to discuss Gaza reconstruction.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/19/trumps-board-of-peace-convenes-for-first-time",
    "timestamp": "2026-02-19T14:49:33Z"
  },
  {
    "title": "US succeeds in erasing climate from global energy body’s priorities",
    "description": "Trump's energy chief had threatened to leave the International Energy Agency if it continued to focus on climate.",
    "link": "https://www.politico.eu/article/us-succeeds-in-banishing-climate-from-global-energy-bodys-priorities/",
    "timestamp": "2026-02-19T14:49:28Z"
  },
  {
    "title": "Guest Contribution: “Usury laws and Trump’s proposed cap on credit card interest rates”",
    "description": "Today, we present a guest post written by Jeffrey Frankel, Harpel Professor at Harvard’s Kennedy School of Government, and formerly a member of the White House Council of Economic Advisers. A shorter version was published in Project Syndicate.   Feb. 19, 2026…",
    "link": "https://econbrowser.com/archives/2026/02/guest-contribution-usury-laws-and-trumps-proposed-cap-on-credit-card-interest-rates",
    "timestamp": "2026-02-19T14:47:27Z"
  },
  {
    "title": "DOJ Scrubs Record of Interviews With Trump Accuser From Epstein Files",
    "description": "The Department of Justice spoke four separate times to a woman who credibly accused Donald Trump of having sex with a minor he met through Jeffrey Epstein—but most accusations against the president appear to have been removed from the government’s documents o…",
    "link": "https://newrepublic.com/post/206765/department-justice-fbi-interviews-donald-trump-accuser-epstein",
    "timestamp": "2026-02-19T14:47:26Z"
  },
  {
    "title": "Karl Rove Reveals Gavin Newsom’s Greatest Weakness Heading Into 2028",
    "description": "Karl Rove identified California Governor Gavin Newsom's (D) Achilles' heel heading into the 2028 election cycles in a new column for The Wall Street Journal.\nThe post Karl Rove Reveals Gavin Newsom’s Greatest Weakness Heading Into 2028 first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/karl-rove-reveals-gavin-newsoms-greatest-weakness-heading-into-2028/",
    "timestamp": "2026-02-19T14:46:54Z"
  },
  {
    "title": "Team USA OT hero Quinn Hughes calls America ‘the greatest country in the world’ in powerful message",
    "description": "Team USA's hero felt the love and reciprocated it.",
    "link": "https://nypost.com/2026/02/19/sports/usa-hero-quinn-hughes-calls-america-the-greatest-country-in-the-world/",
    "timestamp": "2026-02-19T14:46:17Z"
  },
  {
    "title": "U.S. trade deficit totaled $901 billion in 2025 despite Trump's tariffs",
    "description": "The U.S. trade deficit swelled in December, closing out a year in which the imbalance was essentially unchanged.",
    "link": "https://www.cnbc.com/2026/02/19/us-trade-deficit-totaled-901-billion-in-2025-despite-trumps-tariffs.html",
    "timestamp": "2026-02-19T14:43:08Z"
  },
  {
    "title": "Live: Trump addresses Board of Peace inaugural meeting",
    "description": "Representatives of nearly 50 nations attend frst meeting of President Trump's new Board of Peace.",
    "link": "https://www.israelnationalnews.com/news/422681",
    "timestamp": "2026-02-19T14:43:00Z"
  },
  {
    "title": "Federal proposal limiting foreign scientists at Boulder lab disrupts Colorado's quantum industry",
    "description": "A proposed update to a federal security policy on government-funded research could shut out non-US associates from the federal lab after March",
    "link": "http://coloradosun.com/2026/02/19/colorado-quantum-industry-scientists-foreign-nist-federal-labs/",
    "timestamp": "2026-02-19T14:42:55Z"
  },
  {
    "title": "'It's Gotten Old': Don Trump Jr Brushes Off Conflicts Of Interest",
    "description": "Donald Trump Jr told CNBC that conflicts of interest about the White House and his businesses are nonsense and claimed it was another conspiracy to destroy his family.\nOf course, this skirts hundreds of years of precedents and laws under the US Constitution. …",
    "link": "https://crooksandliars.com/2026/02/don-trump-jr-dissmisses-all-conflicts",
    "timestamp": "2026-02-19T14:41:19Z"
  },
  {
    "title": "U.N. nuclear chief warns of 2 major risks if U.S.-Iran deal not reached",
    "description": "The head of the U.N. nuclear watchdog agency says Iran's enriched uranium \"is still there,\" as he stresses the urgency of diplomacy to avert a U.S.-Iran war.",
    "link": "https://www.cbsnews.com/news/us-iran-war-risks-iaea-says-nuclear-material-still-there-war-could-spiral/",
    "timestamp": "2026-02-19T14:39:25Z"
  },
  {
    "title": "Dozens of Texas Schools Now Under Investigation for Alleged Role in Anti‑ICE Walkouts",
    "description": "The investigation into anti‑ICE student walkouts widened on Monday, with three additional Texas school districts added to a growing probe examining whether officials coordinated or encouraged students to join the January 30 protests.\nThe post Dozens of Texas …",
    "link": "https://www.breitbart.com/border/2026/02/19/dozens-of-texas-schools-now-under-investigation-for-alleged-role-in-anti%e2%80%91ice-walkouts/",
    "timestamp": "2026-02-19T14:37:25Z"
  },
  {
    "title": "Tariffs paid by midsized US firms tripled last year, new analysis from JPMorganChase Institute shows (Josh Boak/Associated Press)",
    "description": "Josh Boak / Associated Press:\nTariffs paid by midsized US firms tripled last year, new analysis from JPMorganChase Institute shows  —  Tariffs paid by midsized U.S. businesses tripled over the course of last year, new research tied to one of America's leading…",
    "link": "https://www.memeorandum.com/260219/p23",
    "timestamp": "2026-02-19T14:35:01Z"
  },
  {
    "title": "What the Latest Bombshell Epstein Arrest Means for Trump",
    "description": "The global elite are beginning to face consequences for their affiliations with Jeffrey Epstein, and the dominoes may soon cascade into American politics.Andrew Mountbatten-Windsor, the former British prince and Duke of York, was arrested Thursday (his birthd…",
    "link": "https://newrepublic.com/post/206764/prince-andrew-epstein-arrest-donald-trump",
    "timestamp": "2026-02-19T14:34:44Z"
  },
  {
    "title": "US farmers to sow more soybeans in 2026, less corn, USDA says",
    "description": "American farmers are shifting focus in 2026, planting more soybeans and less corn. This change comes amid a global surplus and increasing costs for essential farm supplies. Despite challenges, the US Department of Agriculture projects significant harvests for…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-farmers-to-sow-more-soybeans-in-2026-less-corn-usda-says/articleshow/128563056.cms",
    "timestamp": "2026-02-19T14:32:57Z"
  },
  {
    "title": "Dem gov baits Trump after being banned from White House dinner: 'Getting under their skin'",
    "description": "An amused Gov. Jared Polis (D-CO) taunted Donald Trump on Thursday morning for running scared of him by singling him and Gov. Wes Moore (D-MD) out for exclusion from a black-tie dinner on Saturday, where governors from both sides of the aisle are being welcom…",
    "link": "https://www.rawstory.com/tyrump-governors-polis/",
    "timestamp": "2026-02-19T14:32:48Z"
  },
  {
    "title": "War With Iran?",
    "description": "Plus: the same ole hawkish lies, a familial connection to Barry Goldwater's nomination, and the future of media is prediction markets on Substack.",
    "link": "https://reason.com/2026/02/19/war-with-iran-2/",
    "timestamp": "2026-02-19T14:32:30Z"
  },
  {
    "title": "Crypto Billionaires On Their Own? Senator Urges US Regulators To Reject Bailouts",
    "description": "US senator Elizabeth Warren has sent a sharp note to regulators, warning against any move that could let public money shore up the crypto market. She argues such steps would hand a windfall to the richest holders in the sector and risk fueling public anger. R…",
    "link": "https://bitcoinist.com/crypto-billionaires-on-their-own-senator-urges-us-regulators-to-reject-bailouts/",
    "timestamp": "2026-02-19T14:30:13Z"
  },
  {
    "title": "BAFTA Film Awards: BBC On Alert For Politically-Charged Speeches (And Swearing) After Glastonbury “Death To The IDF” Debacle",
    "description": "EXCLUSIVE: The BBC will be monitoring the BAFTA Film Awards closely for politically-charged speeches after the UK broadcaster sparked a national scandal last year by streaming a Glastonbury Festival act chanting “death to the IDF.” Deadline hears that the Bob…",
    "link": "http://deadline.com/2026/02/bafta-bbc-alert-political-speech-glastonbury-bob-vylan-1236729126/",
    "timestamp": "2026-02-19T14:29:36Z"
  },
  {
    "title": "Trump Considering Military Action Within Days After Previously Warning Country 'Time is Running Out' (Reports)",
    "description": "Donald Trump is reportedly getting ready for a possible military strike in Iran, and some sources have said that it could start within the coming days. The 79-year-old president has previously leveraged the threat of military action against the Middle Eastern…",
    "link": "https://www.justjared.com/2026/02/19/trump-considering-military-action-within-days-after-warning-iran-time-is-running-out-reports/",
    "timestamp": "2026-02-19T14:29:04Z"
  },
  {
    "title": "Top European spies sceptical US will clinch Ukraine peace deal this year",
    "description": "European intelligence chiefs express deep pessimism regarding a Russia-Ukraine peace deal this year, contradicting Donald Trump's claims of progress. They believe Moscow is using talks for sanctions relief and business deals, not genuine peace. Russia's strat…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/top-european-spies-sceptical-us-will-clinch-ukraine-peace-deal-this-year/articleshow/128562951.cms",
    "timestamp": "2026-02-19T14:24:31Z"
  },
  {
    "title": "MAGA senator endorses his wife for statewide office — even though she's a Democrat",
    "description": "In a triumph of family over politics, Sen. Pete Ricketts (R-NE), a loyal ally of President Donald Trump in the Senate, is endorsing his wife for a key state education special election — even though she's a Democrat.Susanne Shore, the former first lady of Nebr…",
    "link": "https://www.rawstory.com/pete-ricketts-2675284843/",
    "timestamp": "2026-02-19T14:24:03Z"
  },
  {
    "title": "Selected Articles: Protecting Sex Predators: The Sordid Reality of the Global Power Elite",
    "description": "Protecting Sex Predators: The Sordid Reality of the Global Power Elite\nBy John W. Whitehead and Nisha Whitehead, February 19, 2026\nThe question is no longer whether Jeffrey Epstein—the hedge fund billionaire/convicted serial pedophile and sex trafficker—commi…",
    "link": "https://www.globalresearch.ca/selected-articles-protecting-sex-predators-sordid-reality-global-power-elite/5916458",
    "timestamp": "2026-02-19T14:23:42Z"
  },
  {
    "title": "Russia warns U.S. military buildup heightening Iran tensions",
    "description": "Russia warned against an \"unprecedented escalation of tension\" around Iran on Thursday and urged restraint amid a U.S. military buildup in the region that a senior American official said should be complete by mid-March.",
    "link": "https://www.cbc.ca/news/world/russia-iran-u-s-military-9.7097088",
    "timestamp": "2026-02-19T14:23:13Z"
  },
  {
    "title": "From mom-and-pops to Goldman Sachs, Jesse Jackson’s vision for American business sparked a revolution",
    "description": "The civil rights leader, whose dealmaking skills pushed Wall Street to invest in minority-owned businesses, died on Tuesday.",
    "link": "https://fortune.com/2026/02/19/jesse-jackson-diversity-leadership-goldman-sachs-business/",
    "timestamp": "2026-02-19T14:22:39Z"
  },
  {
    "title": "DC mayor declares emergency, asks President Trump for help on sewage spill on the Potomac",
    "description": "The leak dumped 250 million gallons of raw sewage into the Potomac River in its early stages.",
    "link": "https://www.bostonherald.com/2026/02/19/dc-potomac-sewage-spill/",
    "timestamp": "2026-02-19T14:17:20Z"
  },
  {
    "title": "CNN’s Abby Phillip Corners Trump Defender On ‘Racism’ and ‘Anti-Diversity’ Trump",
    "description": "Abby Phillip cornered Shermichael Singleton after he equated being \"anti-diversity\" with being racist — then admitted Trump is explicitly anti-diversity.\nThe post CNN’s Abby Phillip Corners Trump Defender On ‘Racism’ and ‘Anti-Diversity’ Trump first appeared …",
    "link": "https://www.mediaite.com/media/news/cnns-abby-phillip-corners-trump-defender-on-racism-and-anti-diversity-trump/",
    "timestamp": "2026-02-19T14:15:06Z"
  },
  {
    "title": "Intent vs results. I had this conversation with Grok.",
    "description": "Intent vs results. I had this conversation with Grok.Me:This person was planning to be a nursing assistant, but they died in a car crash and were not wearing a seat belt.It seems to me that if someone was not wearing a seat belt, they’d probably be very bad a…",
    "link": "https://freerepublic.com/focus/f-bloggers/4367464/posts",
    "timestamp": "2026-02-19T14:13:24Z"
  },
  {
    "title": "Donald Trump to host G20 summit in Miami on December 14-15",
    "description": "The United States will host the G20 leaders' summit in Miami on December 14-15, with President Donald Trump expected to preside. Preparatory discussions among G20 finance ministers and central bank governors will take place in Asheville, North Carolina, from …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-to-host-g20-summit-in-miami-on-december-14-15/articleshow/128562415.cms",
    "timestamp": "2026-02-19T14:10:44Z"
  },
  {
    "title": "Banks can’t seem to service crypto, even as it goes mainstream",
    "description": "Crypto’s reputation is improving, but investors still complain that their banks are blocking their accounts for interacting with digital assets.",
    "link": "https://cointelegraph.com/news/banks-service-crypto-even-mainstream",
    "timestamp": "2026-02-19T14:10:43Z"
  },
  {
    "title": "Fyodor Lukyanov: Why India won’t take orders from Washington",
    "description": "Sovereignty doesn’t mean obedience, and New Delhi knows it Read Full Article at RT.com",
    "link": "https://www.rt.com/india/632778-fyodor-lukyanov-india-us-russia/",
    "timestamp": "2026-02-19T14:10:17Z"
  },
  {
    "title": "UFC Fighter Slams Pro-Trump Opponent’s Racist Post: ‘I’m Going To F**king Torture Him'",
    "description": "UFC star Anthony Hernandez shared some terrifying words for his upcoming opponent, Sean Strickland, who recently mocked his Mexican roots.",
    "link": "https://www.huffpost.com/entry/ufc-fighter-anthony-hernandez-slams-pro-trump-opponent-sean-strickland-racist-post_n_6996e062e4b012cccb3cc4b5",
    "timestamp": "2026-02-19T14:09:48Z"
  },
  {
    "title": "TRUMP vs. the BBC",
    "description": "When a sitting or former US president sues a media organization, it’s big news. When they sue the British Broadcasting Corporation for $10 billion, it’s something else, closer to a geopolitical spectacle than a legal action. Florida judge Roy K. Altman has se…",
    "link": "https://www.fairobserver.com/world-news/us-news/trump-vs-the-bbc/",
    "timestamp": "2026-02-19T14:08:37Z"
  },
  {
    "title": "WATCH LIVE: Trump hosts first Board of Peace meeting as some U.S. allies remain skeptical",
    "description": "President Donald Trump will gather Thursday with representatives from more than two dozen countries that have joined his Board of Peace — and several that have opted not to — for an inaugural meeting that will focus on reconstruction and building an internati…",
    "link": "https://www.pbs.org/newshour/world/watch-live-trump-hosts-first-board-of-peace-meeting-as-some-u-s-allies-remain-skeptical",
    "timestamp": "2026-02-19T14:06:49Z"
  },
  {
    "title": "US Plans to Build 5,000-Person Military Base in Gaza Strip – Reports",
    "description": "WASHINGTON (Sputnik) - The administration of US President Donald Trump plans to establish a military base in the Gaza Strip for 5,000 personnel, the Guardian reported on Thursday, citing Board of Peace contracting documents.",
    "link": "https://sputnikglobe.com/20260219/us-plans-to-build-5000-person-military-base-in-gaza-strip--reports-1123659829.html",
    "timestamp": "2026-02-19T14:04:59Z"
  }
]