[
  {
    "title": "Sen. Elizabeth Warren discusses future of Mass Pike project, Cape Cod bridges and President Trump",
    "description": "Massachusetts Sen. Elizabeth Warren spoke to WBZ-TV's Jon Keller about a wide range of issues on this week's \"Keller at Large.\"",
    "link": "https://www.cbsnews.com/boston/news/elizabeth-warren-wbz-tv-interview/",
    "timestamp": "2025-08-10T13:02:46Z"
  },
  {
    "title": "Illinois Gov. JB Pritzker blasts Abbott and Trump over GOP redistricting efforts",
    "description": "Illinois Gov. JB Pritzker slammed President Donald Trump as a \"cheater\" and Texas Gov.",
    "link": "https://www.nbcnews.com/politics/politics-news/illinois-gov-jb-pritzker-blasts-texas-gov-greg-abbott-trump-gop-redist-rcna224081",
    "timestamp": "2025-08-10T13:00:41Z"
  },
  {
    "title": "Trump nominates ex-Fox commentator Tammy Bruce for deputy UN ambassador (Coral Murphy Marcos/The Guardian)",
    "description": "Coral Murphy Marcos / The Guardian:\nTrump nominates ex-Fox commentator Tammy Bruce for deputy UN ambassador  —  Bruce, dubbed a ‘great patriot’ by Trump in announcement, now serves as state department spokesperson  —  Donald Trump said on Saturday he was nomi…",
    "link": "https://www.memeorandum.com/250810/p12",
    "timestamp": "2025-08-10T13:00:04Z"
  },
  {
    "title": "Offshore wind leasing is officially dead under Trump",
    "description": "Over 3.5 million acres of federal waters are no longer eligible for offshore wind development following an order from the Interior Department.",
    "link": "https://www.canarymedia.com/articles/offshore-wind/trump-interior-revokes-leasing-areas",
    "timestamp": "2025-08-10T13:00:00Z"
  },
  {
    "title": "Trump Considers Inviting Zelenskyy to Putin Meeting in Alaska",
    "description": "Meet the Press moderator Kristen Welker joins Sunday TODAY’s Willie Geist to discuss the White House potentially inviting Ukraine President Volodymyr Zelenskyy to President Donald Trump's meeting with Russia’s Vladimir Putin in Alaska.",
    "link": "https://www.today.com/video/trump-considers-inviting-zelenskyy-to-putin-meeting-in-alaska-244668485844",
    "timestamp": "2025-08-10T12:54:23Z"
  },
  {
    "title": "Trump Suggests Ukraine Will Have to Give up Land in Peace Deal",
    "description": "President Donald Trump announced his meeting with Russian President Vladimir Putin will take place in Alaska. After Trump suggested Ukraine may have to cede some of its land as part of a peace agreement, Ukrainian President Volodymyr Zelenskyy slammed the pro…",
    "link": "https://www.today.com/video/trump-suggests-ukraine-will-have-to-give-up-land-in-peace-deal-244667973959",
    "timestamp": "2025-08-10T12:50:01Z"
  },
  {
    "title": "Laura Loomer Blasts Return of FDA Vaccine Chief She Helped Force Out",
    "description": "The conservative activist also said she \"will be ramping up\" exposés of officials at the FDA.",
    "link": "https://www.newsweek.com/laura-loomer-fda-vaccine-chief-vinay-prasad-2111358",
    "timestamp": "2025-08-10T12:49:03Z"
  },
  {
    "title": "Tim Cook's White House visit shows the true cost of tariffs",
    "description": "President Trump's tariff policies, ostensibly aimed at boosting US manufacturing, are riddled with exemptions granted based on political favor rather than objective criteria. This system, exemplified by Apple's tariff exemption in exchange for investment pled…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/tim-cooks-white-house-visit-shows-the-true-cost-of-tariffs/articleshow/123218012.cms",
    "timestamp": "2025-08-10T12:48:12Z"
  },
  {
    "title": "Trump Media Gave CEO Devin Nunes $5.9 Million In Stock—Despite Firm’s $20 Million Loss",
    "description": "As it builds a bitcoin war chest and rolls out new tech products, Trump Media is handing executives millions in stock awards—despite mounting losses.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/08/09/trump-media-djt-devin-nunes-stock-truth-social-bitcoin-losses/",
    "timestamp": "2025-08-10T12:47:00Z"
  },
  {
    "title": "Ukraine Reacts to Reports Trump May Invite Zelensky to Alaska Talks",
    "description": "The planned summit between U.S. President Donald Trump and Russian leader Vladimir Putin is a \"highly anticipated meeting,\" the Republican said.",
    "link": "https://biztoc.com/x/dea17f6d1e04869a",
    "timestamp": "2025-08-10T12:44:18Z"
  },
  {
    "title": "Far-right leader's attack exposes Netanyahu's political weakness",
    "description": "Bezalel Smotrich declared in a social media video that he has 'lost confidence' in Netanyahu's ability to lead the IDF to victory. Has the prime minister lost all control of his coalition, or is this a coordinated pre-election move?",
    "link": "https://www.haaretz.com/israel-news/2025-08-10/ty-article/.premium/far-right-leaders-attack-exposes-netanyahus-political-weakness/00000198-935d-d2b6-a9d9-bfff63f20000",
    "timestamp": "2025-08-10T12:44:05Z"
  },
  {
    "title": "Moscow strikes kill five in Ukraine, refinery hit in Russia",
    "description": "A new round of Moscow's shelling and drone attacks killed five people in Ukraine Sunday, authorities said, while Kyiv hit an oil refinery in Russia's Saratov region.  The Ukrainian army claimed its drones had hit a large oil refinery in Russia's western Sarat…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/moscow-strikes-kill-five-in-ukraine-refinery-hit-in-russia/articleshow/123217969.cms",
    "timestamp": "2025-08-10T12:42:14Z"
  },
  {
    "title": "Watch: Democrat Surrogate Jimmy Kimmel Sobs over 'Repulsive' Liberals Driving People Away from Democratic Party",
    "description": "Scolding Democrats are \"repulsive\" and driving people away from the very party they pledge to support, late-night host Jimmy Kimmel despaired during an appearance on the Sarah Silverman Podcast.",
    "link": "https://www.breitbart.com/entertainment/2025/08/10/watch-democrat-surrogate-jimmy-kimmel-sobs-over-repulsive-liberals-driving-people-away-from-democratic-party/",
    "timestamp": "2025-08-10T12:40:57Z"
  },
  {
    "title": "School Assembly Headlines for August 11: Top national, international, sports and business updates",
    "description": "Today's headlines cover a range of significant events, from PM Modi's launch of Bengaluru's Yellow Line metro and the Army's bridge construction in Uttarkashi, to international discussions between Lula and Putin regarding Ukraine peace. In sports, Samson cred…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/school-assembly-headlines-for-august-11-top-national-international-sports-and-business-updates/articleshow/123217938.cms",
    "timestamp": "2025-08-10T12:38:46Z"
  },
  {
    "title": "Ukraine Reacts to Reports Trump May Invite Zelensky to Alaska Talks",
    "description": "The planned summit between U.S. President Donald Trump and Russian leader Vladimir Putin is a \"highly anticipated meeting,\" the Republican said.",
    "link": "https://www.newsweek.com/ukraine-volodymyr-zelensky-russia-vladimir-putin-meeting-donald-trump-alaska-ceasefire-2111362",
    "timestamp": "2025-08-10T12:34:18Z"
  },
  {
    "title": "Trump's 401(k) order offers retirement savers crypto, private assets, but also higher fees and more risk - Reuters",
    "description": "Trump's 401(k) order offers retirement savers crypto, private assets, but also higher fees and more riskReuters Trump 401k changes: What to knowNBC News Private Equity in Your 401(k). What Could Go Wrong?The New York Times What Trump's 401(k) executive order …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178632796",
    "timestamp": "2025-08-10T12:33:08Z"
  },
  {
    "title": "Donald Trump, Julian Fellowes and the Gilded Age Finale (Molly Jong-Fast/New York Times)",
    "description": "Molly Jong-Fast / New York Times:\nDonald Trump, Julian Fellowes and the Gilded Age Finale  —  HBO's “The Gilded Age,” Julian Fellowes's frothy, decorous, lavishly set-decorated historical soap opera set amid the social-climbing robber barons of New York City …",
    "link": "https://www.memeorandum.com/250810/p8",
    "timestamp": "2025-08-10T12:25:00Z"
  },
  {
    "title": "Trump's ex-lawyer makes 'bold prediction' about president's 'king'-like ambition",
    "description": "Donald Trump's former attorney on Sunday made a \"bold, public prediction\" about the president's ambitions.When Americans stepped into the voting booth in 2024, they brought to power something more like a monarchy that a presidency, according to the president'…",
    "link": "https://www.rawstory.com/trump-bold-prediction-cohen-king/",
    "timestamp": "2025-08-10T12:22:16Z"
  },
  {
    "title": "Bravo Star Jennifer Welch Says Ban Trump Voters from Mexican, Chinese Restaurants: ‘Get Your Fat Asses over to Cracker Barrel’",
    "description": "Bravo star Jennifer Welch has had it with Trump supporters who have \"the nerve and audacity\" to dine at foreign-themed restaurants or go to a \"gay hairdresser\" if they truly believe in the president's aim to rid the country of illegal immigrants. Instead she …",
    "link": "https://www.breitbart.com/entertainment/2025/08/10/actress-jennifer-welch-says-ban-trump-voters-from-mexican-chinese-restaurants-get-your-fat-asses-over-to-cracker-barrel/",
    "timestamp": "2025-08-10T12:19:30Z"
  },
  {
    "title": "Zelenskiy thanks Europe for its support as Kyiv seeks place at table with Trump and Putin",
    "description": "(Reuters) -Ukrainian President Volodymyr Zelenskiy thanked European leaders on Sunday for backing his demand for a seat at the table as Russia and the United States prepare for a summit this week where Kyiv fears they could seek to dictate terms to it for end…",
    "link": "https://www.thestar.com.my/news/world/2025/08/10/zelenskiy-thanks-europe-for-its-support-as-kyiv-seeks-place-at-table-with-trump-and-putin",
    "timestamp": "2025-08-10T12:13:00Z"
  },
  {
    "title": "Trump Targets Banks For Crypto Bias, Scaramucci Flags 'Ethereum Killer,' Kiyosaki Slams 'Marxist Fed' As BTC Booms — This Week In Crypto",
    "description": "The past week has been a whirlwind of news in the world of cryptocurrency and finance. From Robert Kiyosaki’s bold predictions of the U.S. Federal Reserve to President Donald Trump’s potential penalties on banks, there’s a lot to unpack.\nLet’s dive into the t…",
    "link": "https://biztoc.com/x/b0b029f4134baa06",
    "timestamp": "2025-08-10T12:10:53Z"
  },
  {
    "title": "Ireland signs letter with other European countries ‘strongly condemning’ Netanyahu’s plan to intensify Gaza war",
    "description": "Ireland has signed a letter with other European countries in strongly condemning Israel’s plan to expand the war in Gaza.",
    "link": "https://www.independent.ie/world-news/middle-east/ireland-signs-letter-with-other-european-countries-strongly-condemning-netanyahus-plan-to-intensify-gaza-war/a917606618.html",
    "timestamp": "2025-08-10T12:10:00Z"
  },
  {
    "title": "A massive economic own goal",
    "description": "Despite Donald Trump’s repeated claims that tariffs are a tax paid by foreign countries, research consistently shows that US companies and consumers bear the tariff burden",
    "link": "https://timesofmalta.com/article/a-massive-economic-goal.1114301",
    "timestamp": "2025-08-10T12:05:44Z"
  },
  {
    "title": "The One Trump Flaw Most Americans Can't Tolerate (Peter Wehner/The Atlantic)",
    "description": "Peter Wehner / The Atlantic:\nThe One Trump Flaw Most Americans Can't Tolerate  —  Democrats should emphasize not that the president is corrupt or inmoral, but that he is incompetent.  —  tens of millions of Americans voted for President Donald Trump in the be…",
    "link": "https://www.memeorandum.com/250810/p7",
    "timestamp": "2025-08-10T12:05:00Z"
  },
  {
    "title": "Sunday Morning Talk Show Thread 10 August 2025",
    "description": "The Talk ShowsAugust 10th, 2025 Guests to be interviewed today on major television talk shows:FACE THE NATION (CBS): Margaret Brennan anchors: Sen. Mark Kelly (D-Ariz.); Rep. Tony Gonzales (R-Texas); Ukrainian Ambassador to the USA Oksana Markarova; former Tr…",
    "link": "https://freerepublic.com/focus/f-news/4333728/posts",
    "timestamp": "2025-08-10T12:02:28Z"
  },
  {
    "title": "A year into Aurora’s apartments saga, tenants, city officials and property owners are still dealing with the fallout",
    "description": "When Yorkiss Ramos first arrived in Denver, she heard about an Aurora apartment complex that offered cheap rent and required little documentation. She would soon get caught in a political firestorm.",
    "link": "https://www.denverpost.com/2025/08/10/colorado-cbz-apartments-gang-takeover-claims-aurora/",
    "timestamp": "2025-08-10T12:00:34Z"
  },
  {
    "title": "It's not just Democrats. Socialist Mamdani's plans should worry Republicans nationwide",
    "description": "Democrats' embrace of NYC mayoral candidate who wants to 'seize means of production' signals alarming shift in party ideology. And it has implications for Republicans, too.",
    "link": "https://www.foxnews.com/opinion/its-not-just-democrats-socialist-mamdanis-plans-should-worry-republicans-nationwide",
    "timestamp": "2025-08-10T12:00:32Z"
  },
  {
    "title": "Progressives are stopping progress when it comes to addressing NYC’s housing shortage",
    "description": "The Brooklyn Marine Terminal could be turned into thousands of much-needed apartments, but its misguided opponents are stuck in the past.",
    "link": "https://nypost.com/2025/08/10/opinion/progressives-are-stopping-progress-when-it-comes-to-addressing-nycs-housing-shortage/",
    "timestamp": "2025-08-10T12:00:00Z"
  },
  {
    "title": "In a Trump-Putin Summit, Ukraine Fears Losing Say Over Its Future - The New York Times",
    "description": "In a Trump-Putin Summit, Ukraine Fears Losing Say Over Its FutureThe New York Times Here's How Trump Says He'll Punish Russia Over Ceasefire DeadlineTime Magazine Donald Trump must not reward Vladimir Putin’s aggressionThe Independent Trump says he'll meet wi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178632614",
    "timestamp": "2025-08-10T11:55:39Z"
  },
  {
    "title": "What to know about how Trump's judicial picks could reshape abortion rights for decades",
    "description": "A review by The Associated Press shows that several of President Donald Trump’s nominees to the federal courts have revealed anti-abortion views, been associated with anti-abortion groups or defended abortion restrictions",
    "link": "https://abcnews.go.com/Health/wireStory/trumps-judicial-picks-reshape-abortion-rights-decades-124520724",
    "timestamp": "2025-08-10T11:50:28Z"
  },
  {
    "title": "Trump has said abortion is a state issue. His judicial picks could shape it nationally for decades",
    "description": "Many of President Donald Trump's picks to be federal judges have revealed anti-abortion views, been associated with anti-abortion groups or defended abortion restrictions",
    "link": "https://abcnews.go.com/Health/wireStory/trump-abortion-state-issue-judicial-picks-shape-nationally-124520722",
    "timestamp": "2025-08-10T11:50:27Z"
  },
  {
    "title": "Republican Winsome Earle-Sears is on the defensive in Virginia's race for governor",
    "description": "Republican Winsome Earle-Sears says she's running her campaign for Virginia governor like a military-style operation",
    "link": "https://abcnews.go.com/Politics/wireStory/republican-winsome-earle-sears-defensive-virginias-race-governor-124520880",
    "timestamp": "2025-08-10T11:50:26Z"
  },
  {
    "title": "European Leaders Rally Around Zelensky, Demand More 'Pressure' on Putin Ahead of Trump Summit",
    "description": "European leaders urged more \"pressure\" on Russia overnight Saturday, after the announcement of a Trump-Putin summit to end the war in Ukraine raised concern that an agreement would require Kyiv to cede swathes of territory.\nThe post European Leaders Rally Aro…",
    "link": "https://www.breitbart.com/europe/2025/08/10/european-leaders-rally-around-zelensky-demand-more-pressure-on-putin-ahead-of-trump-summit/",
    "timestamp": "2025-08-10T11:49:59Z"
  },
  {
    "title": "Two Trump-appointed economists—and longtime friends—are clashing over Trump’s jobs data",
    "description": "Former Bureau of Labor Statistics (BLS) Commissioner William Beach—a Trump nominee—said every number on the jobs chart President Donald Trump touted in the Oval Office on Thursday was wrong.\nStill bitter over last week’s “rigged” jobs report, which showed wea…",
    "link": "https://biztoc.com/x/9586762e34c82e90",
    "timestamp": "2025-08-10T11:48:50Z"
  },
  {
    "title": "H-1B visas: Federal government mandates in-person interviews for overseas renewals",
    "description": "Amid furious debate among supporters of President Donald Trump over the H-1B visa for foreign workers, federal authorities are making in-person interviews mandatory for renewals in visa holders’ home countries.\nTechnology companies say the visas — intended fo…",
    "link": "https://biztoc.com/x/2b04911050cd3feb",
    "timestamp": "2025-08-10T11:48:38Z"
  },
  {
    "title": "Gold may rally further amid macro uncertainty, global tariff tensions: Analysts",
    "description": "Gold prices may rise next week. Macroeconomic uncertainty and tariff disputes support investor interest. Traders will watch UK, EU, and US economic data. Federal Reserve speeches will be key. Domestic gold prices are cushioned by rupee weakness. Geopolitical …",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/fashion-/-cosmetics-/-jewellery/gold-may-rally-further-amid-macro-uncertainty-global-tariff-tensions-analysts/articleshow/123217474.cms",
    "timestamp": "2025-08-10T11:47:38Z"
  },
  {
    "title": "Crime blotter: Woman charged with two Apple Store thefts",
    "description": "A $15 million trailer theft includes Apple products, multiple iPhone thefts are reported in the nation's capital, and an airline is sued over a stolen iPad, in this week's Apple Crime Blotter.The Apple Store in Glasgow The latest in an occasional AppleInsider…",
    "link": "https://appleinsider.com/articles/25/08/10/crime-blotter-woman-charged-with-two-apple-store-thefts",
    "timestamp": "2025-08-10T11:47:26Z"
  },
  {
    "title": "PM Modi pushes 'Atmanirbhar Bharat' mission with \"Zero Defect, Zero Effect\"",
    "description": "Narendra Modi highlights India's economic progress. He says India aims to be the third largest global economy. He mentions infrastructure development like metro lines and airport expansion. Modi urges focus on 'Make in India' with zero defects and environment…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-pushes-atmanirbhar-bharat-mission-with-zero-defect-zero-effect/articleshow/123217417.cms",
    "timestamp": "2025-08-10T11:41:47Z"
  },
  {
    "title": "Zelenskiy thanks Europe for its support as Kyiv seeks place at table with Trump and Putin",
    "description": "Volodymyr Zelenskiy seeks European support amid fears that a U.S.-Russia summit could dictate unfavorable terms for Ukraine to end the war. While Trump considers a territorial swap, European leaders insist on Ukraine's inclusion in peace talks and demand secu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelenskiy-thanks-europe-for-its-support-as-kyiv-seeks-place-at-table-with-trump-and-putin/articleshow/123217405.cms",
    "timestamp": "2025-08-10T11:40:43Z"
  },
  {
    "title": "Restaurants under threat as costs skyrocket and consumers cut back...",
    "description": "Restaurants under threat as costs skyrocket and consumers cut back...\r\n\n \n \n \n (Second column, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Republican Congressman: 'Prices Are Up' -- but It's 'For Good of Country'...\r\nInflation to Rise as Higher Tariffs Feed…",
    "link": "https://www.cnn.com/2025/08/10/business/restaurants-food-costs-consumer-spending",
    "timestamp": "2025-08-10T11:40:38Z"
  },
  {
    "title": "Zelenskyy rejects ‘gifting land’ to Russia ahead of Trump-Putin meeting",
    "description": "Ukrainian President Volodymyr Zelenskyy has staunchly rejected a suggestion by Donald Trump of 'swapping territory’.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/8/10/zelenskyy-rejects-gifting-land-to-russia-ahead-of-trump-putin-meeting",
    "timestamp": "2025-08-10T11:38:55Z"
  },
  {
    "title": "What to know about how Trump's judicial picks could reshape abortion rights for decades",
    "description": "A review by The Associated Press shows that several of President Donald Trump’s nominees to the federal courts have revealed anti-abortion views, been associated with anti-abortion groups or defended abortion restrictions.",
    "link": "https://www.click2houston.com/health/2025/08/10/what-to-know-about-how-trumps-judicial-picks-could-reshape-abortion-rights-for-decades/",
    "timestamp": "2025-08-10T11:35:03Z"
  },
  {
    "title": "Two Trump-appointed economists—and longtime friends—are clashing over Trump’s jobs data",
    "description": "William Beach, who Stephen Moore calls a “good friend,” said Trump's numbers shared during his Oval Office presser were “the strangest thing in the world.”",
    "link": "https://fortune.com/2025/08/10/william-beach-stephen-moore-clash-trump-jobs-report-bls-press-conference/",
    "timestamp": "2025-08-10T11:35:00Z"
  },
  {
    "title": "Trump finally committed the 'unforgivable sin' that voters 'can't tolerate': GOP insider",
    "description": "Donald Trump's polling reveals that he has finally stepped in it in a way that can't be forgiven, according to a man who served under three Republican presidents.Peter Hermann Wehner, a former speechwriter for the administrations of three Republican U.S. pres…",
    "link": "https://www.rawstory.com/trump-unforgivable-sin-cant-tolerate/",
    "timestamp": "2025-08-10T11:33:18Z"
  },
  {
    "title": "Trump has said abortion is a state issue. His judicial picks could shape it nationally for decades",
    "description": "Many of President Donald Trump's picks to be federal judges have revealed anti-abortion views, been associated with anti-abortion groups or defended abortion restrictions",
    "link": "https://www.wsbradio.com/news/health/trump-has-said/FC4JQXQI6RFBFDL6BBGG3DZGBM/",
    "timestamp": "2025-08-10T11:32:31Z"
  },
  {
    "title": "Trump has said abortion is a state issue; his judicial picks could shape it nationally for decades",
    "description": "Donald Trump's judicial picks show anti-abortion leanings. Many have defended abortion restrictions. Some even have ties to anti-abortion groups. These appointments could impact abortion access long after Trump leaves office. Experts say this is a way to shap…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-has-said-abortion-is-a-state-issue-his-judicial-picks-could-shape-it-nationally-for-decades/articleshow/123217269.cms",
    "timestamp": "2025-08-10T11:25:39Z"
  },
  {
    "title": "CIA Leakers Weaponize “Sources and Methods” Talking Points to Target DNI Tulsi Gabbard",
    "description": "CIA Leakers Weaponize “Sources and Methods” Talking Points to Target DNI Tulsi GabbardAugust 9, 2025 | Sundance Insiders within the Intelligence Community (IC), and specifically ongoing operators within the CIA, are targeting Director of National Intelligence…",
    "link": "https://freerepublic.com/focus/f-bloggers/4333719/posts",
    "timestamp": "2025-08-10T11:22:15Z"
  },
  {
    "title": "Trump Envoy Slammed for 'Damaging Incompetence' Over Putin Talks",
    "description": "Michael McFaul, a former U.S. ambassador to the Russian Federation, accused Steve Witkoff of \"deeply damaging incompetence.\"",
    "link": "https://www.newsweek.com/steve-witkoff-putin-russia-talks-trump-2111348",
    "timestamp": "2025-08-10T11:21:01Z"
  },
  {
    "title": "‘Literally Every Republican’: Liberals Dust Off Lisa Kudrow’s Scathing GOP Spox Skit for Trump 2.0",
    "description": "Kudrow’s biting parody of a Republican spox is enjoying a fresh burst of attention online, going viral as a pitch-perfect satire of the MAGA political playbook.\nThe post ‘Literally Every Republican’: Liberals Dust Off Lisa Kudrow’s Scathing GOP Spox Skit for …",
    "link": "https://www.mediaite.com/online/literally-every-republican-liberals-dust-off-lisa-kudrows-scathing-gop-spox-skit-for-trump-2-0/",
    "timestamp": "2025-08-10T11:19:56Z"
  },
  {
    "title": "What investing in private equity and crypto means for your 401(k)",
    "description": "options could change soon. President Donald Trump signed an executive order Thursday to clear the way for Americans to invest their retirement savings in private equity, cryptocurrency, real estate and other alternative assets.\nIt’s a big win for the asset in…",
    "link": "https://biztoc.com/x/6f1c4e6be0279540",
    "timestamp": "2025-08-10T11:15:42Z"
  },
  {
    "title": "Sunday Morning Open Thread",
    "description": "Summer’s most dazzling meteor shower peaks soon. This year, a bright moon will dampen viewing at the time of peak early Wednesday morning. [image or embed] — The Associated Press (@apnews.com) August 8, 2025 at 12:00 PM === Faith leaders in Southern Californi…",
    "link": "https://balloon-juice.com/2025/08/10/sunday-morning-open-thread-50/",
    "timestamp": "2025-08-10T11:12:33Z"
  },
  {
    "title": "Crypto debanking is ‘still occurring’ as banks stick to Chokepoint policies",
    "description": "Unicoin CEO Alex Konanykhin says major U.S. banks are still closing crypto firm accounts under “Operation Chokepoint,” even as Trump readies an order to curb debanking.",
    "link": "https://cointelegraph.com/news/crypto-debanking-persists-despite-trump-pro-crypto-push",
    "timestamp": "2025-08-10T11:11:52Z"
  },
  {
    "title": "European leaders rally behind Ukraine ahead of Trump-Putin meeting",
    "description": "European nations have rallied behind Ukraine, emphasizing that peace cannot be achieved without Kyiv's involvement",
    "link": "https://abcnews.go.com/International/wireStory/european-leaders-rally-ukraine-ahead-trump-putin-meeting-124520272",
    "timestamp": "2025-08-10T11:10:01Z"
  },
  {
    "title": "Donald Trump exposes US retirees to new world of risk with 401k order",
    "description": "",
    "link": "https://biztoc.com/x/9c90eae17d8a83f5",
    "timestamp": "2025-08-10T11:04:23Z"
  },
  {
    "title": "What investing in private equity and crypto means for your 401(k)",
    "description": "Your 401(k) options could change soon.",
    "link": "https://www.nbcnews.com/business/personal-finance/trump-401k-changes-what-to-know-rcna223615",
    "timestamp": "2025-08-10T11:03:41Z"
  },
  {
    "title": "Hollywood Actress Emma Thompson Reveals Trump Asked Her Out — on the Day of Her Divorce",
    "description": "Thompson revealed that Trump once personally asked her out on a date, inviting to dinner on the very day her divorce came through.\nThe post Hollywood Actress Emma Thompson Reveals Trump Asked Her Out — on the Day of Her Divorce first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/hollywood-actress-emma-thompson-reveals-trump-asked-her-out-on-the-day-of-her-divorce/",
    "timestamp": "2025-08-10T11:02:25Z"
  },
  {
    "title": "Former megachurch pastor declares Trump supporters can't be 'good' people in fiery essay",
    "description": "Progressive activist John Pavlovitz called it an \"oxymoron\" to be a good person and support President Donald Trump, in a scathing blog post last week.",
    "link": "https://www.foxnews.com/media/former-megachurch-pastor-declares-trump-supporters-cant-good-people-fiery-essay",
    "timestamp": "2025-08-10T11:00:17Z"
  },
  {
    "title": "How Virginia's colleges became the epicenter of Trump's efforts to end DEI",
    "description": "The role of Gov. Glenn Youngkin, personal links between the colleges and the Trump administration and the state's recent history voting Democratic all factored into why Virginia's colleges came under the microscope before others, political experts said.",
    "link": "https://richmond.com/news/local/education/higher-education/article_45d3de13-1f64-458b-8bc2-1428c604e604.html",
    "timestamp": "2025-08-10T11:00:00Z"
  },
  {
    "title": "Give the Moon a Big, Beautiful Base",
    "description": "The construction of a lunar settlement may be the most wondrous space achievement of our lives.",
    "link": "https://www.theatlantic.com/science/archive/2025/08/moon-base-nuclear-reactor/683802/",
    "timestamp": "2025-08-10T11:00:00Z"
  },
  {
    "title": "The Apprentice’s Sorcerer",
    "description": "One of the most anticipated books this summer in style-conscious circles has been Empire of the Elite: Inside Condé Nast, the Media Dynasty That Reshaped America, a history of the magazine firm that has long epitomized the ultimate in fashion, celebrity, and …",
    "link": "http://www.nybooks.com/online/2025/08/10/the-apprentices-sorcerer-conde-nast-si-newhouse-trump/",
    "timestamp": "2025-08-10T11:00:00Z"
  },
  {
    "title": "India world's most 'dashing and dynamic' economy, some people not liking it: Rajnath",
    "description": "Rajnath Singh praises India's growing economy, emphasizing rapid development and increasing defense exports, despite opposition from some.",
    "link": "https://www.thehindubusinessline.com/news/national/india-worlds-most-dashing-and-dynamic-economy-some-people-not-liking-it-rajnath/article69916363.ece",
    "timestamp": "2025-08-10T10:58:07Z"
  },
  {
    "title": "Russians cheer Putin’s Alaska invitation, envision no concessions on Ukraine - The Washington Post",
    "description": "Russians cheer Putin’s Alaska invitation, envision no concessions on UkraineThe Washington Post White House hasn’t ruled out Zelensky being in Alaska during Trump-Putin meeting on FridayCNN Putin Tells U.S. He’ll Halt War in Exchange for Eastern UkraineThe Wa…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178632254",
    "timestamp": "2025-08-10T10:55:43Z"
  },
  {
    "title": "Donald Trump exposes US retirees to new world of risk with 401k order - Financial Times",
    "description": "Donald Trump exposes US retirees to new world of risk with 401k orderFinancial Times Private Equity in Your 401(k). What Could Go Wrong?The New York Times What Trump's 401(k) executive order could mean for investorsABC News Crypto may be coming to 401(k) plan…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178632248",
    "timestamp": "2025-08-10T10:55:18Z"
  },
  {
    "title": "Our ailing, flailing, failing empire is lashing out",
    "description": "To fight Trump, tyranny and war, America must have profiles in courage — not cowardice",
    "link": "https://www.salon.com/2025/08/10/our-ailing-flailing-failing-empire-is-lashing-out/",
    "timestamp": "2025-08-10T10:45:53Z"
  },
  {
    "title": "AT&T CEO laid out a new vision for the company's culture. Business Insider broke down the aftermath.",
    "description": "In this Sunday edition of Business Insider Today, we're talking about AT&T CEO's bombshell memo and what it means for workplace loyalty.",
    "link": "https://www.businessinsider.com/bi-today-sunday-newsletter-att-ceo-company-culture-2025-8",
    "timestamp": "2025-08-10T10:40:02Z"
  },
  {
    "title": "Rajrishi Singhal: Look East to grasp why Trump is ghosting India",
    "description": "A White House tilt in favour of Pakistan—with Field Marshal Asim Munir being feted—hints of the country being deployed by the US for leverage with China, which is playing hardball with America over trade. But Trump risks alienating India.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-india-pakistan-nixon-bangladesh-xi-jinping-china-tariffs-rapprochement-geopolitics-asim-munir-us-america-11754798618340.html",
    "timestamp": "2025-08-10T10:30:07Z"
  },
  {
    "title": "Medicaid protects 1 in 5 Americans — but it's all about to change. Here are the big losers from the Big Beautiful Bill",
    "description": "Medicaid has grown from an afterthought to a relied-upon safety net for millions.",
    "link": "https://www.yahoo.com/news/articles/medicaid-protects-1-5-americans-102500464.html",
    "timestamp": "2025-08-10T10:25:00Z"
  },
  {
    "title": "Pakistan Army chief Asim Munir meets political, military leaders during his second US visit since June",
    "description": "Pakistan's Army chief, Asim Munir, recently concluded a visit to Washington. He engaged with top US political and military figures. Munir attended a ceremony for US Central Command. Discussions covered mutual interests and regional security. Munir invited Gen…",
    "link": "https://economictimes.indiatimes.com/news/defence/pakistan-army-chief-asim-munir-meets-political-military-leaders-during-his-second-us-visit-since-june/articleshow/123216671.cms",
    "timestamp": "2025-08-10T10:17:57Z"
  },
  {
    "title": "Ukrainian Drone Strike Kills One, Damages Industrial Site, Russia Says",
    "description": "Ukraine has repeatedly attacked sites in the southwestern cities of Saratov and Engels, around 365 miles from the border.",
    "link": "https://www.newsweek.com/ukraine-drone-russia-oil-refinery-saratov-2111350",
    "timestamp": "2025-08-10T10:17:29Z"
  },
  {
    "title": "Trump Launches Attack on Nancy Pelosi: 'Disgusting Degenerate'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has called former House Speaker Nancy Pelosi a \"disgusting degenerate\" in a Truth Social post, accusing the longtime Democratic U.S. representative for California's husband of using insi…",
    "link": "https://biztoc.com/x/e3f4171d15fc8b97",
    "timestamp": "2025-08-10T10:08:51Z"
  },
  {
    "title": "How NATO Is Using Creative Accounting to Meet Trump's Spending Demands",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump may have had success in convincing NATO member states to ramp up defense spending, but a key caveat allowing allies to spend a portion of this budget on defense-related projects has pave…",
    "link": "https://biztoc.com/x/4ced2286180977cd",
    "timestamp": "2025-08-10T10:08:42Z"
  },
  {
    "title": "Hawaii hospitals brace for cuts to Medicaid | Honolulu Star-Advertiser",
    "description": "Hawaii hospitals are bracing for a financial hit from Medicaid cuts approved by Congress.",
    "link": "https://www.staradvertiser.com/2025/08/10/hawaii-news/hawaii-hospitals-brace-for-cuts-to-medicaid/",
    "timestamp": "2025-08-10T10:07:01Z"
  },
  {
    "title": "Trump Launches Attack on Nancy Pelosi: 'Disgusting Degenerate'",
    "description": "Trump also mocked the former House speaker in a post on Truth Social for her involvement in his impeachments.",
    "link": "https://www.newsweek.com/trump-launches-attack-nancy-pelosi-disgusting-degenerate-2111343",
    "timestamp": "2025-08-10T10:01:05Z"
  },
  {
    "title": "How the New Atheists Joined the MAHA War on Science",
    "description": "Sarah Jones writes that the road to MAGA winds through New Atheism, at least in part, and that includes the war on science.",
    "link": "http://nymag.com/intelligencer/article/new-atheists-maha-war-on-science.html",
    "timestamp": "2025-08-10T10:00:30Z"
  },
  {
    "title": "Veterans’ care at risk under Trump as doctors and nurses reject working at VA hospitals",
    "description": "Nearly 40% of the doctors offered jobs at the VA from January through March of this year turned them down.",
    "link": "https://www.salon.com/2025/08/10/veterans-care-at-risk-under-trump-as-doctors-and-nurses-reject-working-at-va-hospitals/",
    "timestamp": "2025-08-10T10:00:04Z"
  },
  {
    "title": "How NATO Is Using Creative Accounting to Meet Trump's Spending Demands",
    "description": "In the Trump-brokered agreement for NATO to increase its defense spending, 'defense-related' projects take on a new definition.",
    "link": "https://www.newsweek.com/how-nato-using-creative-accounting-meet-trumps-spending-demands-2110969",
    "timestamp": "2025-08-10T10:00:02Z"
  },
  {
    "title": "Can Democrats Fight Back Against Trump’s Redistricting Scheme?",
    "description": "Fleeing lawmakers in Texas are unlikely to stop Republicans from redrawing the state’s congressional maps, Jonathan Blitzer writes, but their effort has offered a rallying cry—and a reminder of the Democratic Party’s weaknesses.",
    "link": "https://www.newyorker.com/magazine/2025/08/18/can-democrats-fight-back-against-trumps-redistricting-scheme",
    "timestamp": "2025-08-10T10:00:00Z"
  },
  {
    "title": "Fox News cheered RFK Jr. for years. Then came his latest vaccine announcement.",
    "description": "Fox News has almost entirely ignored Kennedy's  termination of nearly $500 million in funding for vaccines and other treatments based on mRNA technology.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/rfk-jr-kennedy-mrna-vaccines-fox-news-rcna223917",
    "timestamp": "2025-08-10T10:00:00Z"
  },
  {
    "title": "The One Trump Flaw Most Americans Can’t Tolerate",
    "description": "Democrats should emphasize not that the president is corrupt or inmoral, but that he is incompetent.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/trump-incompetence/683779/",
    "timestamp": "2025-08-10T10:00:00Z"
  },
  {
    "title": "Russia and Ukraine exchange drone attacks amid peace talks maneuvers",
    "description": "Russia and Ukraine exchanged large waves of attack drones overnight into Sunday as the two combatants maneuvered ahead of Friday's planned summit in Alaska.",
    "link": "https://abcnews.go.com/International/russia-ukraine-exchange-drone-attacks-amid-peace-talks/story?id=124520013",
    "timestamp": "2025-08-10T09:56:21Z"
  },
  {
    "title": "Israel’s Genocide Is Big Business – And the Face of the Future",
    "description": "US corporations and military planners welcome the ‘legal maneuver space’ Israel has opened up for them to profit from warfare that slaughters and starves civilians",
    "link": "https://jonathancook.substack.com/p/israels-genocide-is-big-business",
    "timestamp": "2025-08-10T09:54:26Z"
  },
  {
    "title": "India world's most 'dashing and dynamic' economy, some people not liking it: Rajnath Singh",
    "description": "Defence Minister Rajnath Singh lauded India's economy as globally \"dashing and dynamic,\" attributing its growth to the nation's capabilities. He criticized those attempting to hinder India's progress through tariffs and trade barriers. Singh highlighted India…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/india-worlds-most-dashing-and-dynamic-economy-some-people-not-liking-it-rajnath-singh/articleshow/123216457.cms",
    "timestamp": "2025-08-10T09:52:24Z"
  },
  {
    "title": "Zelensky might not be able to attend Trump-Putin meeting",
    "description": "Ukrainian President Volodymyr Zelensky is unlikely to attend the meeting between United States President Donald Trump and Russian President Vladimir Putin in Alaska on August 15, Sky News reported on ...",
    "link": "https://biztoc.com/x/8e370e2563a3837e",
    "timestamp": "2025-08-10T09:46:23Z"
  },
  {
    "title": "Big-Name Actor Says Donald Trump Asked Her Out On Day Her Divorce Was Finalized",
    "description": "The Oscar winner surmised the \"stalking\" future president was looking for a \"suitable\" divorcee.",
    "link": "https://www.huffpost.com/entry/emma-thompson-donald-trump-asked-her-out-dinner_n_6898505fe4b07a70fa088387",
    "timestamp": "2025-08-10T09:44:40Z"
  },
  {
    "title": "European leaders urge more 'pressure' on Russia",
    "description": "European leaders urged more \"pressure\" on Russia on early Sunday, after the announcement of a Trump-Putin summit to end the war in Ukraine raised concern that an agreement would require Kiev to cede swathes of territory.",
    "link": "https://www.hurriyetdailynews.com/european-leaders-urge-more-pressure-on-russia-212364",
    "timestamp": "2025-08-10T09:32:04Z"
  },
  {
    "title": "India should consider whether cheap Russian oil beneficial after US imposes tariffs: Nobel laureate Abhijit Banerjee",
    "description": "Nobel laureate Abhijit Banerjee suggests India re-evaluate the benefits of cheap Russian oil imports following the US imposition of a 25% tariff on Indian goods, effectively raising duties to 50%. He proposes considering halting Russian oil purchases to poten…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/india-should-consider-whether-cheap-russian-oil-beneficial-after-us-imposes-tariffs-nobel-laureate-abhijit-banerjee/articleshow/123216243.cms",
    "timestamp": "2025-08-10T09:31:22Z"
  },
  {
    "title": "Eric Trump Says ETH Shorts ‘Got Smoked’ As Bitcoin, Ethereum Surge",
    "description": "Eric Trump, the son of US President Donald Trump, taunted bearish traders on X as crypto prices jumped on Friday. Related Reading: JUST IN – Trump Executive Order To Expand 401(k) Investment Options, Including Crypto He told his nearly 6 million followers tha…",
    "link": "https://bitcoinist.com/eric-trump-says-eth-shorts-got-smoked-as-bitcoin-ethereum-surge/",
    "timestamp": "2025-08-10T09:30:52Z"
  },
  {
    "title": "Zelensky says Ukraine ‘fully supports’ joint statement by European leaders on achieving peace",
    "description": "Ukraine's President Volodymyr Zelensky urged that \"the end of the war must be fair.\"",
    "link": "https://nypost.com/2025/08/10/world-news/zelensky-says-ukraine-fully-supports-joint-statement-by-european-leaders/",
    "timestamp": "2025-08-10T09:30:11Z"
  },
  {
    "title": "Leading Israeli Rabbi Challenges Pope Leo XIV over Gaza Rhetoric",
    "description": "Rabbi Eliezer Simcha Weisz of the Inter-Religious Council of the Chief Rabbinate of Israel has written to Pope Leo XIV to complain about rhetoric he has used to describe Israel’s war of self-defense against Hamas. Last month, the Pope accused Israel\nThe post …",
    "link": "https://www.breitbart.com/faith/2025/08/10/leading-israeli-rabbi-challenges-pope-leo-xiv-over-gaza-rhetoric/",
    "timestamp": "2025-08-10T09:28:53Z"
  },
  {
    "title": "India likely to ready tariff strike on US goods after Trump’s 50% steel, aluminium duty",
    "description": "Move could mark New Delhi’s first retaliation since US slapped sweeping levies on Indian exports in August.",
    "link": "https://www.moneycontrol.com/news/business/economy/india-likely-to-ready-tariff-strike-on-us-goods-after-trump-s-50-steel-aluminium-duty-13430931.html",
    "timestamp": "2025-08-10T09:26:24Z"
  },
  {
    "title": "India apparel exporters look to diversify to UK, EU to soften Trump tariff blow",
    "description": "With the US slapping punitive tariffs, India's top apparel and textile exporters are looking to shift orders to the UK and EU and other markets that offer tariff advantage, as they struggle to offset the losses in their top market.",
    "link": "https://www.livemint.com/companies/indian-textile-apparel-export-diversify-eu-uk-fta-vietnam-production-hub-readymade-garments-old-navy-bangladesh-tariff-11754652482692.html",
    "timestamp": "2025-08-10T09:20:03Z"
  },
  {
    "title": "Qatari jet could be ready for use as Air Force One in 6 months, Trump says. Experts are deeply skeptical",
    "description": "President Donald Trump told reporters last month the donated Qatari jet could be ready for his use as Air Force One in February 2026, well ahead of the long-delayed delivery of two presidential planes from Boeing through a more traditional acquisition process.",
    "link": "https://www.cnn.com/2025/08/10/politics/qatar-jet-trump-air-force",
    "timestamp": "2025-08-10T09:14:24Z"
  },
  {
    "title": "European leaders urge more 'pressure' on Russia ahead of Trump-Putin summit",
    "description": "European leaders urged more \"pressure\" on Russia overnight Saturday, after the announcement of a Trump-Putin summit to end the war in Ukraine raised concern that an agreement would require Kyiv to cede swathes of territory.",
    "link": "https://www.thelocal.com/20250810/european-leaders-urge-more-pressure-on-russia-ahead-of-trump-putin-summit",
    "timestamp": "2025-08-10T09:07:15Z"
  },
  {
    "title": "Texas Democrats fled the state to oppose GOP redistricting. Why this one stayed behind.",
    "description": "Texas state Rep. Richard Peña Raymond battled a Republican redistricting plan in 2003. He's doing it again this year but staying in Texas to fight.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/10/texas-democrats-redistricting-gerrymandering/85569661007/",
    "timestamp": "2025-08-10T09:05:50Z"
  },
  {
    "title": "Ruben Gallego Fires Up Iowa Crowd With Attack on Trump's Tax Bill",
    "description": "The Arizona senator appeared at a town hall in Davenport where he slammed the Republican Party's tax and spending plans.",
    "link": "https://www.newsweek.com/ruben-gallego-iowa-town-hall-trump-tax-bill-2111340",
    "timestamp": "2025-08-10T09:05:22Z"
  },
  {
    "title": "What to expect at upcoming Trump-Putin summit in Alaska?",
    "description": "BEIJING, Aug. 10 (Xinhua) — U.S. President Donald Trump and Russian President Vladimir Putin are set to meet on August […]\nThe post What to expect at upcoming Trump-Putin summit in Alaska? appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/10/what-to-expect-at-upcoming-trump-putin-summit-in-alaska/",
    "timestamp": "2025-08-10T09:04:55Z"
  },
  {
    "title": "European leaders insist Ukraine must be part of peace talks",
    "description": "KYIV: Ukraine’s European allies have reaffirmed their support for Kyiv, declaring that any peace negotiations with Russia must directly involve Ukraine. This united stance was outlined in a joint statement from leaders of the UK, France, Italy, Germany, Polan…",
    "link": "https://english.khabarhub.com/2025/10/490178/",
    "timestamp": "2025-08-10T09:03:40Z"
  }
]