[
  {
    "title": "Türkiye’s return to F-35 program vital for NATO security: Erdoğan",
    "description": "President Recep Tayyip Erdoğan has said Türkiye’s return to the F-35 fighter jet program is necessary not only for Ankara and Washington but also for NATO’s collective security.",
    "link": "https://www.hurriyetdailynews.com/turkiyes-return-to-f-35-program-vital-for-nato-security-erdogan-217499",
    "timestamp": "2026-01-05T08:47:47Z"
  },
  {
    "title": "Venezuela’s acting president meets cabinet ministers",
    "description": "Venezuela’s interim president Delcy Rodriguez met with the country’s cabinet of ministers after Maduro's abduction.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/5/venezuelas-acting-president-meets-cabinet-ministers",
    "timestamp": "2026-01-05T08:42:16Z"
  },
  {
    "title": "Chinese military affairs experts analyze US strikes in Venezuela and operation to capture Maduro",
    "description": "After the US military strikes on Venezuela on Saturday, which reportedly led to the capture of Venezuelan President Nicolas Maduro and his wife, Chinese military affairs experts analyzed how the US Delta Force carried out the mission, while stressing the ille…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260103-globaltimes06.htm",
    "timestamp": "2026-01-05T08:41:51Z"
  },
  {
    "title": "Blow to China From Venezuela Oil Loss Eased by Hoard at Sea",
    "description": "The US’s shock intervention in Venezuela will likely choke oil flows to China, although the short-term impact will be softened by large volumes of sanctioned crude being stored at sea.",
    "link": "https://financialpost.com/pmn/business-pmn/blow-to-china-from-venezuela-oil-loss-eased-by-hoard-at-sea",
    "timestamp": "2026-01-05T08:36:06Z"
  },
  {
    "title": "Jimmy Kimmel Takes Aim at ‘Donald Jennifer Trump’ in Critics Choice Speech",
    "description": "Jimmy Kimmel took aim at \"Donald Jennifer Trump\" during his acceptance speech for Best Talk Show at the Critics Choice Awards on Sunday night.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jimmy-kimmel-donald-trump-critics-choice-speech-1235493954/",
    "timestamp": "2026-01-05T08:29:07Z"
  },
  {
    "title": "Donald Trump’s would-be forklift assassin | ASSASSINS",
    "description": "There have been at least seven attempts to assassinate Donald Trump. But no doubt the most unusual was by Gregory Lee ...",
    "link": "https://biztoc.com/x/726d272358ea6151",
    "timestamp": "2026-01-05T08:28:10Z"
  },
  {
    "title": "Is Trump’s Venezuela Oil Plan a $100 Billion Gamble?",
    "description": "President Donald Trump said US oil companies will spend billions of dollars to rebuild Venezuela's energy infrastructure after the ...",
    "link": "https://biztoc.com/x/fef1270192cd7f99",
    "timestamp": "2026-01-05T08:27:47Z"
  },
  {
    "title": "Stubb: Only Greenland and Denmark can decide on their own future",
    "description": "US President Donald Trump has reiterated his threat to take Greenland from Nato ally Denmark.",
    "link": "https://yle.fi/a/74-20202603",
    "timestamp": "2026-01-05T08:27:44Z"
  },
  {
    "title": "Jimmy Kimmel credits Donald Trump as he accepts Critics Choice award",
    "description": "Jimmy Kimmel mocked Donald Trump whilst accepting Best Talk Show at the 2026 Critics Choice Awards.",
    "link": "https://www.the-independent.com/tv/culture/jimmy-kimmel-trump-critics-choice-awards-speech-video-b2894465.html",
    "timestamp": "2026-01-05T08:26:30Z"
  },
  {
    "title": "Donald Trump Issues Greenland Deadline",
    "description": "\"We need Greenland from a national security situation,\" Trump told reporters on Air Force One.",
    "link": "https://biztoc.com/x/6abf489478ed9eff",
    "timestamp": "2026-01-05T08:25:14Z"
  },
  {
    "title": "US Attack Not Backed by Anyone, Condemned by Int'l Community - Venezuelan Foreign Minister",
    "description": "No one supports the US attack on Venezuela; it is condemned by the international community, Venezuelan Foreign Minister Ivan Gil told Sputnik.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-sputnik07.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Colombia Calls Meeting of UN Security Council on Venezuela",
    "description": "Colombia has requested an emergency UNSC meeting over US aggression in Venezuela, along with sessions of the OAS Permanent Council and foreign ministers from CELAC, Angie Rodriguez, director of Colombia's Administrative Department of the Presidency, said.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-sputnik06.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Trump says U.S. needs Greenland \"for defense\" following strikes on Venezuela",
    "description": "U.S. President Donald Trump on Sunday stressed that the United States needs Greenland \"for defense,\" claiming that Venezuela may not be the last country subject to U.S. intervention, according to The Atlantic.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260105-pdo03.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Death Toll Rises As Protests Continue Across Iran",
    "description": "The death toll and number of arrests rose further in Iran as protests sparked by the country's worst economic crisis in years continued for an eighth straight day on January 4.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260104-rferl01.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Trump threatens Venezuela's acting president over refusal to cooperate with U.S.",
    "description": "U.S. President Donald Trump on Sunday threatened that Venezuelan acting president Delcy Rodríguez could \"pay a very big price, probably bigger than\" that of Venezuelan President Nicolás Maduro, if she continued to refuse cooperation with the United States.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260105-pdo01.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Venezuelan military stands with acting president Rodriguez after US kidnapping of Maduro",
    "description": "Venezuela's military high command on Sunday formally recognized Delcy Rodriguez as the nation's acting president, following the lawless abduction of democratically elected leader Nicolas Maduro by US forces.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-presstv03.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Immediate opposition from leaders of Denmark and Greenland to US renewed Greenland push after Venezuela strike",
    "description": "US President Donald Trump's fresh claim of US \"absolutely\" needing Greenland for defense has met immediate opposition from leaders of Denmark and Greenland, who urged the US to stop threatening to take over the Danish territory.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260105-globaltimes01.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "German Vice Chancellor calls for U.S. to \"respect international law\"",
    "description": "German Vice Chancellor and Finance Minister Lars Klingbeil said on Sunday that U.S. intervention in Venezuela is \"very worrying,\" stressing that international law must be respected.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260105-pdo02.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "US Launched Operation in Venezuela With Cyberattack Blacking Out Caracas - Reports",
    "description": "The United States launched an operation to capture Venezuelan President Nicolas Maduro and his wife, Cilia Flores, spearheaded by a cyberattack that caused power outages in many areas of Caracas, a newspaper reported, citing unnamed officials familiar with th…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-sputnik04.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Make 'right decision' or face more US pressure, Rubio tells Venezuela's Rodriguez",
    "description": "US Secretary of State Marco Rubio has warned Venezuelan officials to make the \"right decision\" or face mounting pressure from the United States.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-presstv05.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Trump's Team Working on Plan for Governing Venezuela After Maduro's Capture - Reports",
    "description": "US President Donald Trump's national security team is drafting a plan to govern Venezuela after President Nicolas Maduro was captured by US forces, media reported, citing senior officials.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-sputnik05.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "How the world is reacting to US bombing of Venezuela and kidnapping of Maduro",
    "description": "The United States' invasion of Venezuela and the kidnapping of President Nicolas Maduro and his wife, in a clear violation of the United Nations Charter and international law, have sparked widespread condemnations, except from Trump's European and Israeli all…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-irna01.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Cuba's Strong Condemnation of the Cowardly U.S. Aggression Against Venezuela and Its Absolute Support for That Sister Nation",
    "description": "The Revolutionary Government strongly condemns, in the strongest possible terms, the military aggression carried out by the United States against Venezuela, while categorically reaffirming Cuba's absolute support and solidarity with the sister Bolivarian Repu…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-cubaminrex01.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Trump Warns Venezuela's Rulers To 'Cooperate' Or Pay A 'Very Big Price'",
    "description": "With deposed Venezuelan leader Nicolas Maduro in a US jail, President Donald Trump warned the South American country's authoritarian rulers they will \"pay a very big price\" if they don't \"cooperate\" with Washington, even amid global concerns over the US milit…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-rferl02.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Trump Says Venezuelan Vice President Will Pay Higher Price Than Maduro if She Disobeys US",
    "description": "US President Donald Trump warned on Sunday that Venezuelan Vice President Delcy Rodriguez might have to pay an even higher price than Venezuelan President Nicolas Maduro if she did not make the \"right\" decisions.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-sputnik01.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Trump's 'insane' Venezuela attack triggers furious US Democrats to float retaliation",
    "description": "US President Donald Trump's \"insane\" attack against Venezuela on Saturday, abducting President Nicolas Maduro and his wife, has triggered lawmakers opposed to the move to float retaliation.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-presstv08.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Russia, China urge Maduro's release after US abduction",
    "description": "Russia and China have called on the United States to immediately release Venezuelan President Nicolas Maduro, who is illegally jailed in New York after being kidnapped during an armed aggression against his country.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-presstv06.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Impact of US strike against Venezuela on global oil price limited in the short term, but long-term uncertainties heighten: analysts",
    "description": "Following the US strike against Venezuela, US President Donald Trump claimed that US oil companies will spend billions of dollars to rebuild Venezuela's \"crumbling energy infrastructure,\" according to a Bloomberg report on Sunday. He also said that the embarg…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-globaltimes05.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Bolton: Removing Maduro from Venezuela a 'hollow victory' for US",
    "description": "John Bolton, a former US national security advisor, has described Washington's aggression against Venezuela and the capture of its leader, Nicolás Maduro, as a \"hollow victory\" unless the United States pursues full \"regime change\" in the Latin American countr…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260104-irna02.htm",
    "timestamp": "2026-01-05T08:24:10Z"
  },
  {
    "title": "Colombia, Cuba, Mexico, Greenland or Iran - where could Trump strike next?",
    "description": "Donald Trump's comments following his capture of Venezuelan president Nicolas Maduro suggest more muscular foreign intervention could soon follow elsewhere in the world.",
    "link": "https://news.sky.com/story/colombia-cuba-mexico-greenland-or-iran-where-could-trump-strike-next-13490602",
    "timestamp": "2026-01-05T08:24:00Z"
  },
  {
    "title": "A tale of two 'Maduros': Trump nabbed one, pardoned another",
    "description": "US President Donald Trump's actions have drawn criticism for a double standard. He pardoned former Honduran President Juan Orlando Hernandez, convicted of drug trafficking. Simultaneously, Trump pursued Venezuelan President Nicolas Maduro for similar charges.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-tale-of-two-maduros-trump-nabbed-one-pardoned-another/articleshow/126348253.cms",
    "timestamp": "2026-01-05T08:23:44Z"
  },
  {
    "title": "Trump’s Venezuela Gambit Tests Investor Appetite for Geopolitical Risk",
    "description": "Markets may have shrugged off the audacious U.S. capture of Venezuelan President Nicolas Maduro, but some investors warn that geopolitical risks are perhaps being underestimated after Donald Trump threatened further action in the Americas. Investors held thei…",
    "link": "https://www.insurancejournal.com/news/international/2026/01/05/853028.htm",
    "timestamp": "2026-01-05T08:23:11Z"
  },
  {
    "title": "Erdogan Says Turkish Return to F-35 Program Key to NATO Security",
    "description": "President Recep Tayyip Erdogan called for Turkey’s re-entry into the US-led F-35 fighter jet-program, saying it would help cement ties with Washington and strengthen the security of NATO.",
    "link": "https://financialpost.com/pmn/business-pmn/erdogan-says-turkish-return-to-f-35-program-key-to-nato-security",
    "timestamp": "2026-01-05T08:20:55Z"
  },
  {
    "title": "Critics Choice Awards: The BIG Winners",
    "description": "The Critics Choice Awards was held at the Barker Hangar in Santa Monica and saw Hollywood's A-listers get honoured at the first awards ceremony of the year.",
    "link": "https://www.rediff.com/movies/report/critics-choice-awards-the-big-winners/20260105.htm",
    "timestamp": "2026-01-05T08:16:12Z"
  },
  {
    "title": "Trump’s Move for Regime Change in Venezuela Threatens a New MAGA Rift - The New York Times",
    "description": "Trump’s Move for Regime Change in Venezuela Threatens a New MAGA RiftThe New York Times The surprising US plan in Venezuela comes with huge risks for TrumpCNN Monday briefing: Why the US moved to oust Venezuela’s presidentThe Guardian How The Times Assessed T…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180516587",
    "timestamp": "2026-01-05T08:13:42Z"
  },
  {
    "title": "US ‘has no right’ to take over Greenland, Danish PM says after latest Trump threats",
    "description": "Donald Trump doubles down on his claim that Greenland should become part of the United States",
    "link": "https://www.irishtimes.com/world/americas/2026/01/05/us-has-no-right-to-take-over-greenland-danish-pm-says-after-latest-trump-threats/",
    "timestamp": "2026-01-05T08:13:18Z"
  },
  {
    "title": "2 top stock recommendations from Rajesh Bhosale",
    "description": "Indian stock markets are consolidating after hitting record highs. Experts suggest this is a temporary pause, not a sign of weakness. Investors are advised to buy on dips, expecting the uptrend to continue. Specific stocks like MFSL and Tata Consumer Products…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/2-top-stock-recommendations-from-rajesh-bhosale/articleshow/126348168.cms",
    "timestamp": "2026-01-05T08:11:51Z"
  },
  {
    "title": "India must end Russian oil ambiguity as tariffs loom: GTRI",
    "description": "As tensions rise, India faces a pivotal choice regarding its imports of Russian oil, especially with President Trump issuing threats of increased tariffs on Indian products. The stakes are high, as Senator Graham is advocating for penalties on nations linked …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-trump-tariff-threat-russian-oil-imports-gtri-report-trade-pressure/articleshow/126347930.cms",
    "timestamp": "2026-01-05T08:05:41Z"
  },
  {
    "title": "Greenland: NATO Allies Who Fear Russia Invasion Warn Donald Trump",
    "description": "Trump's seizure of Maduro from Venezuela has shaken the global order and intensified concern that he will move on Greenland too.",
    "link": "https://biztoc.com/x/a899d3ad9163df47",
    "timestamp": "2026-01-05T08:03:27Z"
  },
  {
    "title": "Trump Sends Warning To Colombia, Mexico After Venezuela Raid: Live Updates",
    "description": "President Donald Trump sent a warning to Colombia and Mexico - and predicted Cuba could soon fall - after the U.S. raid on Venezuela and capture of leader Nicolas Maduro.\nSpeaking to reporters aboard Air Force One on Sunday, Trump also reiterated his wish to …",
    "link": "https://biztoc.com/x/8077056715fc86c2",
    "timestamp": "2026-01-05T08:03:25Z"
  },
  {
    "title": "Trump says US oil firms were informed of Caracas raid before it happened",
    "description": "Trump repeatedly talked about the intervention that US oil companies will carry out in the South American country when asked if elections were being planned there.",
    "link": "https://www.thejournal.ie/trump-oil-companies-6918333-Jan2026/",
    "timestamp": "2026-01-05T07:59:16Z"
  },
  {
    "title": "Gov. Tim Walz expected to drop reelection bid amid Minnesota Somali fraud probe: report",
    "description": "The failed veep candidate has come under national scrutiny over his handling of alleged Medicaid and day care fraud in Minnesota, with losses that could reach into the multi-billions.",
    "link": "https://nypost.com/2026/01/05/us-news/gov-tim-walz-expected-to-drop-reelection-bid-amid-minnesota-somali-fraud-probe-report/",
    "timestamp": "2026-01-05T07:55:46Z"
  },
  {
    "title": "China Asks Banks to Report Exposure to Venezuela After US Raid",
    "description": "China’s top financial regulator asked its policy banks and other major lenders to report their lending exposure to Venezuela after the US ousted the South American country’s Beijing-friendly leader, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/china-asks-banks-to-report-exposure-to-venezuela-after-us-raid",
    "timestamp": "2026-01-05T07:55:13Z"
  },
  {
    "title": "US moves Maduro from palace to 'dangerous, barbaric' jail with rotten food before this secret transfer",
    "description": "Ousted Venezuelan President Nicolás Maduro and his wife, Cilia Flores, are now housed in Brooklyn's notorious Metropolitan Detention Center, facing life-altering charges. Their arrival followed a dramatic raid and journey, contrasting sharply with their forme…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-moves-maduro-from-palace-to-dangerous-barbaric-jail-with-rotten-food-before-this-secret-transfer/articleshow/126347530.cms",
    "timestamp": "2026-01-05T07:53:40Z"
  },
  {
    "title": "Jimmy Kimmel fires warning to 'ridiculous' Trump ahead of talk show return",
    "description": "Jimmy Kimmel has issued a warning to Donald Trump ahead of his return to late night television.The Live! host will be back on air from tonight (January 5), and picked up a Critics' Choice Award for Best Talk Show the day before. Using his speech to thank the …",
    "link": "https://www.rawstory.com/jimmy-kimmel-trump-2674847002/",
    "timestamp": "2026-01-05T07:53:35Z"
  },
  {
    "title": "Venezuela to cut oil output due to US export embargo",
    "description": "Venezuela's state-run oil company PDVSA has begun cutting crude production because it is running out of storage capacity due to an ongoing US oil blockade that has reduced exports to zero.",
    "link": "https://www.rte.ie/news/business/2026/0105/1551486-venezuela-oil-output/",
    "timestamp": "2026-01-05T07:53:35Z"
  },
  {
    "title": "UK government refuses to say if US would be wrong to invade Greenland",
    "description": "Donald Trump has said the US \"does need Greenland\", prompting concern he will invade the Danish territory after attacking Venezuela and capturing the country's president.",
    "link": "https://news.sky.com/story/uk-government-refuses-to-say-if-us-would-be-wrong-to-invade-greenland-13490589",
    "timestamp": "2026-01-05T07:51:00Z"
  },
  {
    "title": "Trump says he's 'very serious' about taking Greenland - despite warnings it will end NATO",
    "description": "Donald Trump has doubled down on his territorial ambitions for Greenland - despite warnings that his plans for the Danish territory could destroy NATO.",
    "link": "https://news.sky.com/story/trump-says-hes-very-serious-about-taking-greenland-despite-warnings-it-will-end-nato-13490953",
    "timestamp": "2026-01-05T07:51:00Z"
  },
  {
    "title": "80 people killed in US raid on Venezuela – NYT",
    "description": "The death toll from the US raid that seized Venezuelan President Nicolas Maduro has risen to 80, the New York Times reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630586-80-people-killed-venezuela/",
    "timestamp": "2026-01-05T07:46:23Z"
  },
  {
    "title": "Trump threatens Colombia’s Petro, says Cuba looks ‘ready to fall’",
    "description": "Washington, Jan 5: United States President Donald Trump has threatened his Colombian counterpart, Gustavo Petro, following Washington’s capture of Venezuela’s leader, […]\nThe post Trump threatens Colombia’s Petro, says Cuba looks ‘ready to fall’ appeared firs…",
    "link": "https://mypeoplesreview.com/2026/01/05/trump-threatens-colombias-petro-says-cuba-looks-ready-to-fall/",
    "timestamp": "2026-01-05T07:45:00Z"
  },
  {
    "title": "Japan's Nikkei ends at over 2-month high as markets shrug off Venezuela tension",
    "description": "Japan's Nikkei closed ‍at a more than two-month ​high on the first trading day of 2026, led ⁠by chip-related stocks, as investors brushed off the potential impact of U.S. military action in Venezuela.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-at-over-2-month-high-as-markets-shrug-off-venezuela-tension/articleshow/126347753.cms",
    "timestamp": "2026-01-05T07:44:54Z"
  },
  {
    "title": "REMINDER: SCHUMER MOCKED TRUMP IN 2020 FOR NOT REMOVING MADURO",
    "description": " REMINDER: SCHUMER MOCKED TRUMP IN 2020 FOR NOT REMOVING MADURO \"He brags about all these things he wants to do or is doing, but his actions belie his words. Maybe the best metaphor was his claim to bring democracy to Venezuela. There was a big policy…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360461/posts",
    "timestamp": "2026-01-05T07:41:22Z"
  },
  {
    "title": "REMINDER: SCHUMER MOCKED TRUMP IN 2020 FOR NOT REMOVING MADURO",
    "description": " REMINDER: SCHUMER MOCKED TRUMP IN 2020 FOR NOT REMOVING MADURO \"He brags about all these things he wants to do or is doing, but his actions belie his words. Maybe the best metaphor was his claim to bring democracy to Venezuela. There was a big policy…",
    "link": "https://freerepublic.com/focus/f-news/4360461/posts",
    "timestamp": "2026-01-05T07:41:22Z"
  },
  {
    "title": "Trump threatens India with higher tariffs over Russian oil",
    "description": "The US imposed a 50% tariff on India in 2025, half of which was a penalty for buying Russian oil Read Full Article at RT.com",
    "link": "https://www.rt.com/india/630584-trump-threatens-india-with-higher/",
    "timestamp": "2026-01-05T07:40:05Z"
  },
  {
    "title": "Critics Choice Analysis: It Is One Win After Another For ‘One Battle After Another’ As It Continues Steam-Rolling Through Awards Season",
    "description": "The now four-time host for the just concluded 31st Annual Critics Choice Awards, Chelsea Handler might have meant her opening monologue line as a joke, but it certainly has a ring of truth to it. “This is the first awards show of the season so we are going to…",
    "link": "http://deadline.com/2026/01/critics-choice-awards-analysis-one-battle-after-another-1236661799/",
    "timestamp": "2026-01-05T07:39:26Z"
  },
  {
    "title": "U.S. military operation kills 32 Cubans in Venezuela",
    "description": "Thirty-two Cubans were killed in the U.S. military operation in Venezuela on Saturday, according to Havana.",
    "link": "https://www.upi.com/Top_News/World-News/2026/01/05/cuba-32-Cubans-killed-Venezuela/8821767595915/",
    "timestamp": "2026-01-05T07:38:54Z"
  },
  {
    "title": "Maduro’s fall tests Venezuela’s ruling ‘club’",
    "description": "The ousting of Nicolas Maduro as Venezuela’s president puts to the test his “Chavista” factions that have governed the oil-rich nation for 27 years. What happens to the so-called “club of five” powerful leftist figures, now that two of its most important memb…",
    "link": "https://www.digitaljournal.com/world/maduros-fall-tests-venezuelas-ruling-club/article",
    "timestamp": "2026-01-05T07:37:20Z"
  },
  {
    "title": "Orsted challenges US halt of $5 billion wind project",
    "description": "Denmark's Orsted is challenging the US government's suspension of the lease for its Revolution Wind joint venture and said it would seek a court injunction against the decision to halt its $5 billion offshore wind project.",
    "link": "https://www.rte.ie/news/business/2026/0105/1551485-orsted-challenges-us-halt-of-5-billion-wind-project/",
    "timestamp": "2026-01-05T07:34:31Z"
  },
  {
    "title": "France backs Greenland after fresh Trump threats",
    "description": "France expresses solidarity with Denmark, stating Greenland belongs to its people after US President Trump doubles down on threats to take over the territo\n\nRead More: https://punchng.com/france-backs-greenland-after-fresh-trump-threats/",
    "link": "https://punchng.com/france-backs-greenland-after-fresh-trump-threats/",
    "timestamp": "2026-01-05T07:34:19Z"
  },
  {
    "title": "‘Down to the wire’: ECB’s digital euro project faces decisive vote in 2026",
    "description": "Central bank aims to introduce the tokens in 2029 but parties in the European parliament are divided",
    "link": "https://www.irishtimes.com/business/financial-services/2026/01/05/down-to-the-wire-ecbs-digital-euro-project-faces-decisive-vote-in-2026/",
    "timestamp": "2026-01-05T07:33:07Z"
  },
  {
    "title": "Selected Articles: Why Venezuela’s Military Did Not Fight",
    "description": "Why Venezuela’s Military Did Not Fight\nBy Miguel Santos García, January 04, 2026\nHours after Trump’s press conference Delcy Rodriguez made a televised address to the South American nation in which she made it clear that she considered the …\nThe post Selected …",
    "link": "https://www.globalresearch.ca/selected-articles-why-venezuela-military-did-not-fight/5911004",
    "timestamp": "2026-01-05T07:31:34Z"
  },
  {
    "title": "Trump Threatens 'Worse Than Maduro' Military Action In Venezuela If Current Leader Doesn't Co-Operate, Hints At Colombia And Mexico Next",
    "description": "President Donald Trump suggested the possibility of a second military intervention in Venezuela and hinted at similar moves in Colombia and Mexico.\nTrump Floats More Military Action Over Drugs\nWhile speaking to reporters on Air Force One on Sunday, Trump warn…",
    "link": "https://biztoc.com/x/974d18426ece3fc0",
    "timestamp": "2026-01-05T07:30:42Z"
  },
  {
    "title": "CNBC Daily Open: Investors had much to cheer in 2025 — but 2026's starting out rocky",
    "description": "The S&P 500 rallied 16.39% in 2025, mostly on the back of enthusiasm over AI. But investors have to contend with the U.S.' attack on Venezuela.",
    "link": "https://www.cnbc.com/2026/01/05/cnbc-daily-open-investors-had-much-to-cheer-in-2025-but-2026s-starting-out-rocky.html",
    "timestamp": "2026-01-05T07:30:01Z"
  },
  {
    "title": "How would Donald Trump tap ‘tremendous’ wealth from Venezuelan oil?",
    "description": "Industry insiders have warned the process could take years — and cost tens of billions of dollars",
    "link": "https://www.irishtimes.com/world/americas/2026/01/05/how-would-donald-trump-tap-tremendous-wealth-from-venezuelan-oil/",
    "timestamp": "2026-01-05T07:30:00Z"
  },
  {
    "title": "Trump admin must avoid 'messy free-for-all' in Venezuela during crucial first week: expert",
    "description": "Donald Trump's administration must take action now so as to avoid a \"messy free-for-all\" in Venezuela, a geopolitical analysist has warned. Irina Tsukerman says the weeks following the arrest of Nicolas Maduro will need to be managed intensely by the Trump ad…",
    "link": "https://www.rawstory.com/trump-venezuela-2674846955/",
    "timestamp": "2026-01-05T07:28:47Z"
  },
  {
    "title": "Thirty-two Cubans killed during US attack on Venezuela",
    "description": "Cuba's president said military and intelligence operatives were providing protection to captured leader Nicolás Maduro.",
    "link": "https://www.bbc.com/news/articles/cj9r0eyw0jno",
    "timestamp": "2026-01-05T07:23:24Z"
  },
  {
    "title": "Islamic Republic in ‘survival mode’ amid protests, Iranian officials said to believe",
    "description": "Senior officials in Iran have acknowledged that the country has been “thrust into survival mode” amid growing and increasingly violent protests against the Islamic Republic’s regime, the New York Times reported. At least 16 people have been killed during a we…",
    "link": "https://freerepublic.com/focus/f-news/4360460/posts",
    "timestamp": "2026-01-05T07:21:40Z"
  },
  {
    "title": "House Democratic Leader Calls US Intervention in Venezuela Unauthorized ‘Act of War’",
    "description": "WASHINGTON (Sputnik) - House Democratic leader Hakeem Jeffries has rejected claims by the Trump administration that the US military intervention in Venezuela was a law enforcement operation, calling it an \"act of war\" that required congressional approval.",
    "link": "https://sputnikglobe.com/20260105/house-democratic-leader-calls-us-intervention-in-venezuela-unauthorized-act-of-war-1123420247.html",
    "timestamp": "2026-01-05T07:19:01Z"
  },
  {
    "title": "Venezuela acting president seeks US govt collaboration",
    "description": "Jan 5 (Reuters) - Venezuela's Acting ‌President Delcy Rodriguez invited the U.S. government to collaborate on ‌an agenda of cooperation, in a statement on social media ‌that struck a conciliatory tone following the U.S. capture of President Nicolas Maduro. Re…",
    "link": "https://www.thestar.com.my/news/world/2026/01/05/venezuela-acting-president-seeks-us-govt-collaboration",
    "timestamp": "2026-01-05T07:19:00Z"
  },
  {
    "title": "Chinese Foreign Ministry on Events in Venezuela: No One Can Act as International Policeman",
    "description": "BEIJING (Sputnik) - The events in Venezuela have attracted significant international attention. China believes that no country can act as an international policeman or judge, Chinese Foreign Minister Wang Yi said.",
    "link": "https://sputnikglobe.com/20260105/chinese-foreign-ministry-on-events-in-venezuela-no-one-can-act-as-international-policeman-1123420101.html",
    "timestamp": "2026-01-05T07:16:39Z"
  },
  {
    "title": "Venezuela acting president seeks US govt collaboration",
    "description": "Venezuela's Acting President Delcy Rodriguez has extended an invitation to the United States government. She seeks collaboration on a cooperation agenda, aiming for balanced and respectful relations. Rodriguez emphasized Venezuela's commitment to peace and in…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/venezuela-acting-president-seeks-us-govt-collaboration/articleshow/126347175.cms",
    "timestamp": "2026-01-05T07:13:59Z"
  },
  {
    "title": "Two killed in series of Russian attacks on Ukraine",
    "description": "Russia has bombarded Ukraine early this morning, killing two people in the Kyiv region, authorities said on the eve of a diplomatic summit in France.",
    "link": "https://www.rte.ie/news/ukraine/2026/0105/1551478-ukraine-russia/",
    "timestamp": "2026-01-05T07:13:43Z"
  },
  {
    "title": "Trump killed 80 during the mosquito catching operation.",
    "description": "On January 3, 2026, the American military launched a large-scale air and ground operation targeting Caracas, the capital of Venezuela. This operation marked a new and decisive turn in the long-standing diplomatic crisis between the United States and Venezuela…",
    "link": "https://english.gossiplankanews.com/2026/01/trump-killed-80-during-mosquito.html",
    "timestamp": "2026-01-05T07:05:19Z"
  },
  {
    "title": "Trump spurns Kremlin’s Putin residence attack claim, Russia kills 2 in Kyiv",
    "description": "Russia’s Defence Ministry had published a video of a downed drone it said Ukraine had launched at Putin’s residence.",
    "link": "https://www.aljazeera.com/news/2026/1/5/trump-spurns-kremlins-putin-residence-attack-claim-russia-kills-2-in-kyiv",
    "timestamp": "2026-01-05T07:02:20Z"
  },
  {
    "title": "Nicolás Maduro the latest high-profile inmate of NY jail branded ‘hell on earth’",
    "description": "The facility where detained Venezuelan President Nicolás Maduro has been taken is a notorious New York jail that has held a string of high-profile and celebrity criminals, from drug cartel leaders to hip-hop stars.",
    "link": "https://www.abc.net.au/news/2026-01-05/nicol%C3%A1s-maduro-in-the-new-york-metropolitan-detention-center/106199184",
    "timestamp": "2026-01-05T07:01:15Z"
  },
  {
    "title": "‘Yes’ shares surged before the news – Polymarket’s Maduro warning decoded",
    "description": "How did anonymous traders anticipate a classified military operation?",
    "link": "https://ambcrypto.com/yes-shares-surged-before-the-news-polymarkets-maduro-warning-decoded/",
    "timestamp": "2026-01-05T07:00:59Z"
  },
  {
    "title": "Sen. Chris Murphy: Pete Hegseth, Marco Rubio ‘Literally Lied To Our Face’ Before Venezuela Takeover",
    "description": "“They knew they weren’t telling the truth in that room,\" the Connecticut senator said.",
    "link": "https://www.huffpost.com/entry/chris-murphy-hegseth-rubio-venezuela_n_695ac71be4b09f7f2fbccbd1",
    "timestamp": "2026-01-05T07:00:06Z"
  },
  {
    "title": "Investors rush for safe havens after Trump Venezuela strike, as oil price dips",
    "description": "The price of \"safe haven\" metals - gold, silver and copper - all rose on Monday morning in an apparent reaction from worried investors to Donald Trump's intervention in Venezuela.",
    "link": "https://news.sky.com/story/investors-rush-for-safe-havens-after-trump-venezuela-strike-as-oil-price-dips-13490574",
    "timestamp": "2026-01-05T06:56:00Z"
  },
  {
    "title": "Restoring the Nobel Peace Prize to Its Peace-Promotion Vocation",
    "description": "On 27 November 1897 the multi-millionaire Swedish chemist and industrialist Alfred Nobel signed his last will and testament establishing a foundation to honour, among others “champions of peace”, those “who shall have done the most or the best work for creati…",
    "link": "https://www.counterpunch.org/2026/01/05/restoring-the-nobel-peace-prize-to-its-peace-promotion-vocation/",
    "timestamp": "2026-01-05T06:53:48Z"
  },
  {
    "title": "Trump threatens Colombia’s president, says Cuba is “ready to fall”",
    "description": "Donald Trump has threatened Colombia’s president following the US’s abduction of Venezuelan leader Nicolas Maduro.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/5/trump-threatens-colombias-president-says-cuba-is-ready-to",
    "timestamp": "2026-01-05T06:53:43Z"
  },
  {
    "title": "Deposed Venezuelan leader to be brought before US court on drug trafficking charges",
    "description": "Meanwhile, the UN Security Council is due to hold an emergency session at Venezuela’s request.",
    "link": "https://www.thejournal.ie/deposed-venezuelan-leader-to-be-brought-before-us-court-on-drug-trafficking-charges-6918310-Jan2026/",
    "timestamp": "2026-01-05T06:52:54Z"
  },
  {
    "title": "Trump warns new Venezuelan leader as Maduro set to appear in court - BBC",
    "description": "Trump warns new Venezuelan leader as Maduro set to appear in courtBBC Live Updates: Venezuela’s New Leader Softens Tone as Trump Threatens ColombiaThe New York Times The surprising US plan in Venezuela comes with huge risks for TrumpCNN Live updates: Trump th…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180516295",
    "timestamp": "2026-01-05T06:52:48Z"
  },
  {
    "title": "Fraud, Drugs, and Hope for 2026",
    "description": "The year 2025 ends the way Donald Trump began his foray into politics: full-fledged, unapologetic racism. Team Trump is pushing his anti-Somali campaign for three big reasons. First, insofar as he succeeds, it justifies his mass deportation. He has explicitly…",
    "link": "https://www.counterpunch.org/2026/01/05/fraud-drugs-and-hope-for-2026/",
    "timestamp": "2026-01-05T06:52:32Z"
  },
  {
    "title": "Trump threatens Iran as more protest deaths reported",
    "description": "Amid deadly protests in Iran sparked by economic woes, US President Trump warned that the regime in Tehran would be \"hit very hard\" by the US if more protesters were killed.",
    "link": "https://www.dw.com/en/trump-threatens-iran-as-more-protest-deaths-reported/a-75388284",
    "timestamp": "2026-01-05T06:52:00Z"
  },
  {
    "title": "What Planet Are We On?",
    "description": "As 2026 begins, what a strange planet we find ourselves on. The two great empires of my youth, the Soviet Union (now Russia) and my own country, are clearly experiencing some version of imperial decline, even if Vladimir Putin is acting otherwise in Ukraine (…",
    "link": "https://www.counterpunch.org/2026/01/05/what-planet-are-we-on/",
    "timestamp": "2026-01-05T06:48:03Z"
  },
  {
    "title": "Maduro before U.S. Justice: From cell to courtroom and Trump’s threats toward Colombia, Mexico, and Greenland",
    "description": "The new interim president of Venezuela is striking a calmer tone and speaking for the first time about “cooperation,” even as the U.S. president demands “full access” — “It sounds like a good idea,” Trump says about the scenario of an operation in Colombia\nTh…",
    "link": "https://en.protothema.gr/2026/01/05/maduro-before-u-s-justice-from-cell-to-courtroom-and-trumps-threats-toward-colombia-mexico-and-greenland/",
    "timestamp": "2026-01-05T06:47:50Z"
  },
  {
    "title": "Trump warns of potential second strike on Venezuela",
    "description": "Trump told reporters that the US is ready to carry out a second strike on Venezuela if its government doesn't cooperate.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/5/trump-warns-of-potential-second-strike-on-venezuela",
    "timestamp": "2026-01-05T06:45:52Z"
  },
  {
    "title": "Venezuela’s Maduro to appear in US court as Trump says further strikes possible",
    "description": "Country’s interim leader Delcy Rodriguez says she hopes to build ‘respectful relations’ with US president",
    "link": "https://www.irishtimes.com/world/americas/2026/01/05/venezuelas-maduro-to-appear-in-us-court-as-trump-says-further-strikes-possible/",
    "timestamp": "2026-01-05T06:44:32Z"
  },
  {
    "title": "Trump declares US ‘in charge’ of Venezuela and Maduro goes to court",
    "description": "President Donald Trump’s claim that the United States is “in charge” of Venezuela will be underscored Monday when the oil-rich nation’s deposed leader is hauled before a New York court, while his successor offers to cooperate. Leftist strongman Nicolas Maduro…",
    "link": "https://www.digitaljournal.com/world/trump-declares-us-in-charge-of-venezuela-and-maduro-goes-to-court/article",
    "timestamp": "2026-01-05T06:42:20Z"
  },
  {
    "title": "Two killed in series of Russian attacks on Ukraine",
    "description": "Russia bombarded Ukraine early Monday, killing two people in the Kyiv region, authorities said on the eve of a diplomatic summit in France. A countrywide siren was issued just after midnight, while Ukraine’s military said air defences were operating in severa…",
    "link": "https://www.digitaljournal.com/world/two-killed-in-series-of-russian-attacks-on-ukraine/article",
    "timestamp": "2026-01-05T06:42:20Z"
  },
  {
    "title": "This Vietnamese town boomed as factories left China. Now it’s asking what’s next?",
    "description": "Once known for its rice fields and folk songs, Bac Ninh has become one of Vietnam’s busiest factory zones",
    "link": "https://abcnews.go.com/Business/wireStory/vietnamese-town-boomed-factories-left-china-now-whats-128902840",
    "timestamp": "2026-01-05T06:37:56Z"
  },
  {
    "title": "Trump says that Ukraine didn't target Putin residence in a drone strike as Kremlin claims",
    "description": "President Donald Trump said that U.S. national security officials have determined that Ukraine did not target a residence belonging to Russian President Vladimir Putin in a drone attack last week",
    "link": "https://abcnews.go.com/US/wireStory/trump-ukraine-target-putin-residence-drone-strike-kremlin-128899037",
    "timestamp": "2026-01-05T06:37:32Z"
  },
  {
    "title": "Surprise interim leader Delcy Rodriguez emerges in Venezuela after Maduro’s capture - AP News",
    "description": "Surprise interim leader Delcy Rodriguez emerges in Venezuela after Maduro’s captureAP News Live Updates: Venezuela’s New Leader Softens Tone as Trump Threatens ColombiaThe New York Times The surprising US plan in Venezuela comes with huge risks for TrumpCNN D…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180516243",
    "timestamp": "2026-01-05T06:33:32Z"
  },
  {
    "title": "India's rush to sign a web of bilateral trade agreements: Driven by good economics or smart geopolitics?",
    "description": "India’s flurry of pacts signed with various countries may not boost our trade all that much, but these seem designed to act as an insurance policy against trade fragmentation caused by the policies of US President Donald Trump.",
    "link": "https://www.livemint.com/opinion/online-views/india-free-trade-agreements-ftas-trade-deals-countries-economics-smart-geopolitics-insurance-fragmentation-donald-trump-11767246453792.html",
    "timestamp": "2026-01-05T06:30:12Z"
  },
  {
    "title": "Venezuela: Trump declares US ‘in charge’ as Maduro heads to court",
    "description": "Following a shock US assault, Trump declares the US is ‘in charge’ of Venezuela as Maduro faces charges, raising global concerns over US intentions.\n\nRead More: https://punchng.com/venezuela-trump-declares-us-in-charge-as-maduro-heads-to-court/",
    "link": "https://punchng.com/venezuela-trump-declares-us-in-charge-as-maduro-heads-to-court/",
    "timestamp": "2026-01-05T06:29:00Z"
  },
  {
    "title": "This Vietnamese town boomed as factories left China. Now it’s asking what’s next?",
    "description": "Once known for its rice fields and folk songs, Bac Ninh has become one of Vietnam’s busiest factory zones",
    "link": "https://abcnews.go.com/International/wireStory/vietnamese-town-boomed-factories-left-china-now-whats-128902839",
    "timestamp": "2026-01-05T06:27:43Z"
  }
]