[
  {
    "title": "Gavin Newsom Shreds Trump for National Guard Blindside: ‘Stone Cold Liar!’",
    "description": "Newsom branded Trump a “stone-cold liar” for failing to mention his intent to deploy the National Guard to Los Angeles during a phone call on Saturday morning.\nThe post Gavin Newsom Shreds Trump for National Guard Blindside: ‘Stone Cold Liar!’ first appeared …",
    "link": "https://www.mediaite.com/media/tv/gavin-newsom-shreds-trump-for-national-guard-blindside-stone-cold-liar/",
    "timestamp": "2025-06-09T11:39:55Z"
  },
  {
    "title": "'Are they trained?' Expert shares massive red flags as troops go into LA",
    "description": "President Donald Trump has ordered 2,000 National Guard troops to Los Angeles in response to widespread protests against immigration raids, but a national security correspondent said the government hasn't provided answers to some basic questions about how the…",
    "link": "https://www.rawstory.com/los-angeles-national-guard-deployment/",
    "timestamp": "2025-06-09T11:37:13Z"
  },
  {
    "title": "Reconstruir el consenso sobre la ayuda",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/governments-must-rebuild-consensus-on-international-development-assistance-by-kevin-watkins-2025-06/spanish",
    "timestamp": "2025-06-09T11:36:01Z"
  },
  {
    "title": "Donald Trump sent in the National Guard to escalate the situation in LA",
    "description": "Los Angeles is home to a huge immigrant population, and a huge first-gen American population. Angelenos pride themselves on their city’s diversity and inclusivity. So when ICE decided to begin conducting raids with LA, Angelenos were like “hell to the no.” I’…",
    "link": "https://www.celebitchy.com/926014/donald_trump_sent_in_the_national_guard_to_escalate_the_situation_in_la/",
    "timestamp": "2025-06-09T11:35:52Z"
  },
  {
    "title": "Unlawful assembly declared in downtown LA",
    "description": "Dozens of arrests have been made after three days of protests, with the National Guard now patrolling the city.",
    "link": "https://www.bbc.com/news/articles/c87jnnj1pxno",
    "timestamp": "2025-06-09T11:35:21Z"
  },
  {
    "title": "We Don't Need To Welcome In People Who Hate Us",
    "description": "Yesterday in Boulder, Colorado, a perpetrator sprayed a flammable liquid on a group of mostly elderly Jews protesting the continued holding of hostages in Gaza. Then he threw Molotov cocktails to set several of the demonstrators on fire. The New York Post rep…",
    "link": "https://freerepublic.com/focus/f-chat/4321841/posts",
    "timestamp": "2025-06-09T11:33:50Z"
  },
  {
    "title": "Kamala Harris Torches Trump Over 'Cruel, Calculated' Move Targeting Los Angeles",
    "description": "\"This Administration's actions are not about public safety — they're about stoking fear,” the former vice president wrote on social media.",
    "link": "https://www.huffpost.com/entry/kamala-harris-torches-trump-over-los-angeles-action_n_6846a75de4b0ee4cf20cbb38",
    "timestamp": "2025-06-09T11:31:39Z"
  },
  {
    "title": "Trump Talks Feud With Musk as Sweeping Travel Ban Takes Effect",
    "description": "President Donald Trump’s sweeping new travel ban barring citizens from a dozen countries primarily in Africa and the Middle East, is now in full effect. Meanwhile, the president is making it clear he has \"no reason\" to repair his relationship with former top …",
    "link": "https://www.today.com/video/trump-travel-ban-takes-effect-says-alliance-with-musk-is-over-241159749608",
    "timestamp": "2025-06-09T11:31:17Z"
  },
  {
    "title": "The Democrats Have an Authenticity Gap",
    "description": "What creates the “relatable dude-bro” audience is organic connection, not donor checks.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/democrats-authenticity-rogan/683072/",
    "timestamp": "2025-06-09T11:30:00Z"
  },
  {
    "title": "Democrats are drawing closer to the crypto industry despite Trump divisions",
    "description": "The crypto industry is seeing growing support from the Democratic Party, though it's far from unanimous",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-drawing-closer-crypto-industry-despite-trump-divisions-122646179",
    "timestamp": "2025-06-09T11:28:31Z"
  },
  {
    "title": "Colorado outdoor businesses are reeling from Trump's trade war",
    "description": "Colorado outdoor companies struggling with tariff uncertainty. “It feels like our country is systematically working against small businesses.”",
    "link": "http://coloradosun.com/2025/06/09/colorado-outdoor-businesses-trade-war/",
    "timestamp": "2025-06-09T11:26:41Z"
  },
  {
    "title": "Newsom Says He's Suing Feds, Dares Homan to Arrest Him",
    "description": "The tensions in Los Angeles over the city's protests of immigration raids may play out in the courts as well as on the streets. California Gov. Gavin Newsom tweeted Sunday night that he will sue President Trump over the president's decision to deploy the Nati…",
    "link": "https://www.newser.com/story/369943/newsom-says-hes-suing-feds-dares-homan-to-arrest-him.html",
    "timestamp": "2025-06-09T11:20:06Z"
  },
  {
    "title": "‘Harry Potter’ Star Tom Felton Praises J.K. Rowling When Asked About Her Trans Pushback",
    "description": "British author J.K. Rowling's political views have zero impact on actor Tom Felton who has nothing but thanks and praise to offer the person whose Harry Potter creation catapulted him to international stardom.\nThe post ‘Harry Potter’ Star Tom Felton Praises J…",
    "link": "https://www.breitbart.com/entertainment/2025/06/09/harry-potter-star-tom-felton-praises-j-k-rowling-when-asked-about-her-trans-pushback/",
    "timestamp": "2025-06-09T11:18:31Z"
  },
  {
    "title": "Southern Baptists target porn, sports betting and same-sex marriage",
    "description": "Southern Baptists meeting this week in Dallas will be asked to approve resolutions calling for a legal ban on pornography and reversing the U.S. Supreme Court’s approval of same-sex marriage",
    "link": "https://abcnews.go.com/US/wireStory/southern-baptists-target-porn-sports-betting-same-sex-122646173",
    "timestamp": "2025-06-09T11:16:10Z"
  },
  {
    "title": "Don't let deep sea become 'wild west', Guterres tells world leaders",
    "description": "United Nations Secretary General Antonio Guterres said on Monday the world could not let the deepest oceans \"become the wild west\", at the start in France of a global summit on the seas.",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/09/don039t-let-deep-sea-become-039wild-west039-guterres-tells-world-leaders",
    "timestamp": "2025-06-09T11:16:00Z"
  },
  {
    "title": "Democrats are drawing closer to the crypto industry despite Trump divisions",
    "description": "As Trump embraces crypto, hosting investors and backing a pro-industry agenda, Democrats face internal division over regulating digital assets. While some support the bipartisan GENIUS Act, others criticise its exclusion of presidential profit restrictions. M…",
    "link": "https://economictimes.indiatimes.com/tech/technology/democrats-are-drawing-closer-to-the-crypto-industry-despite-trump-divisions/articleshow/121727653.cms",
    "timestamp": "2025-06-09T11:15:36Z"
  },
  {
    "title": "OpenAI bans ChatGPT accounts linked to Russian, Chinese cyber ops",
    "description": "OpenAI banned ChatGPT accounts tied to Russian and Chinese hackers using the tool for malware, social media abuse, and U.S. satellite tech research. OpenAI banned ChatGPT accounts that were used by Russian-speaking threat actors and two Chinese nation-state a…",
    "link": "https://securityaffairs.com/178797/intelligence/openai-bans-chatgpt-accounts-linked-to-russian-chinese-cyber-ops.html",
    "timestamp": "2025-06-09T11:15:09Z"
  },
  {
    "title": "Crypto Daybook Americas: Bitcoin Options Point to Gains as Bullish Flow Builds Ahead of CPI Data",
    "description": "The day ahead in crypto: June 9, 2025",
    "link": "https://www.coindesk.com/daybook-us/2025/06/09/crypto-daybook-americas-bitcoin-options-point-to-gains-as-bullish-flow-builds-ahead-of-cpi-data",
    "timestamp": "2025-06-09T11:15:00Z"
  },
  {
    "title": "Elon Musk comments on LA protest turmoil",
    "description": "Security forces have deployed tear gas and rubber bullets as immigration raid rallies continue for a third day Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618838-elon-musk-los-angeles-protests/",
    "timestamp": "2025-06-09T11:12:24Z"
  },
  {
    "title": "Iran says to submit own nuclear proposal to US soon",
    "description": "Iran said Monday it will soon present a counter-proposal on a nuclear deal with the United States, after it had described Washington’s offer as containing “ambiguities”. Tehran and Washington have held five rounds of talks since April to thrash out a new nucl…",
    "link": "https://www.digitaljournal.com/world/iran-says-to-submit-own-nuclear-proposal-to-us-soon/article",
    "timestamp": "2025-06-09T11:12:20Z"
  },
  {
    "title": "Trump’s tariff chaos threatens his push for rust belt revival",
    "description": "Donald Trump's trade policies face criticism. These policies may hinder the revival of US manufacturing. Tariffs are creating uncertainty for businesses. Companies are delaying investments due to fluctuating costs. The Midwest region, a manufacturing hub, is …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariff-chaos-threatens-his-push-for-rust-belt-revival/articleshow/121727041.cms",
    "timestamp": "2025-06-09T11:11:30Z"
  },
  {
    "title": "Treasury Secretary Scott Bessent Allegedly BEAT UP Elon Musk",
    "description": "Elon Musk might have caught more than just heat in the White House, according to Steve Bannon, who alleged that the tech boss got beat down by Treasury Secretary Scott Bessent on his way out as head of DOGE. According to a new report from The Washington Post,…",
    "link": "https://mediatakeout.com/treasury-secretary-scott-bessent-allegedly-beat-up-elon-musk/",
    "timestamp": "2025-06-09T11:10:34Z"
  },
  {
    "title": "Putin unleashes a summer offensive to break Ukraine (The Economist)",
    "description": "The Economist:\nPutin unleashes a summer offensive to break Ukraine  —  His killing machine has been told to deliver a glorious victory at any cost  —  After weeks of nebulous ceasefire talks at the urging of a semi-engaged President Donald Trump, the war betw…",
    "link": "https://www.memeorandum.com/250609/p9",
    "timestamp": "2025-06-09T11:10:06Z"
  },
  {
    "title": "Los Angeles police order immigration protesters in downtown to go home",
    "description": "LOS ANGELES (Reuters) -Police declared all of downtown Los Angeles to be an unlawful assembly area and ordered protesters to go home on Sunday night after a third day of violence hit demonstrations against President Donald Trump's immigration policy. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/06/09/los-angeles-police-order-immigration-protesters-in-downtown-to-go-home",
    "timestamp": "2025-06-09T11:09:00Z"
  },
  {
    "title": "Iran Trolls US Over LA Riots",
    "description": "Iran's trolling of the U.S. over domestic protests serves as a strategic move to amplify American instability during fragile nuclear talks.",
    "link": "https://www.newsweek.com/iran-trolls-online-us-riots-la-2082701",
    "timestamp": "2025-06-09T11:08:48Z"
  },
  {
    "title": "Chicago immigration advocates hold rally as LA protests continue",
    "description": "The tensions in Los Angeles between protestors and ICE agents came days after a chaotic ICE confrontation in the South Loop.",
    "link": "https://www.nbcchicago.com/news/local/chicago-immigration-advocates-say-trumps-deployment-of-national-guard-in-la-highlights-the-cruelty-of-the-administration/3763387/",
    "timestamp": "2025-06-09T11:08:19Z"
  },
  {
    "title": "Defence or environment? London faces spending choices",
    "description": "Torn between growing geopolitical tensions and constrained public finances, Britain’s finance minister Rachel Reeves is set to unveil feared trade-offs in a government spending review on Wednesday. Prime Minister Keir Starmer is boosting the defence budget, a…",
    "link": "https://www.digitaljournal.com/world/defence-or-environment-london-faces-spending-choices/article",
    "timestamp": "2025-06-09T11:02:33Z"
  },
  {
    "title": "Drone Stocks Soar On Trump eVTOL Executive Order",
    "description": "Drone Stocks Soar On Trump eVTOL Executive Order\n \nPresident Donald Trump on Friday signed three executive orders aimed at jumpstarting the development, domestic manufacturing, integration, and global export of U.S.-made drones and electric vertical takeoff a…",
    "link": "https://biztoc.com/x/a78f75b3fc7be791",
    "timestamp": "2025-06-09T11:02:24Z"
  },
  {
    "title": "Newsom brands Trump a 'dictator' after National Guard deployed",
    "description": "California Governor Gavin Newsom accused US President Donald Trump of acting like a “dictator” by sending the National Guard into Los Angeles to quell protests.\nIt marks the first time that federal troops have been deployed on domestic soil against the wishes…",
    "link": "https://biztoc.com/x/84fbaa33c8efe4e4",
    "timestamp": "2025-06-09T11:02:21Z"
  },
  {
    "title": "Trump says Elon Musk will face 'very serious consequences' if he funds Democratic candidates",
    "description": "President Donald Trump on Saturday said there would be “serious consequences” if tech mogul Elon Musk funds Democratic candidates to run against Republicans who vote in favor of the GOP’s sweeping budget bill.",
    "link": "https://biztoc.com/x/b8070dca17694b9e",
    "timestamp": "2025-06-09T11:02:18Z"
  },
  {
    "title": "Elon Musk's Father Says 'Trump Will Prevail,' Blames Son's Feud 'Mistake' On Stress As Tesla Stock Slides Nearly 2.5% In Monday Pre-Market",
    "description": "Errol Musk, the father of Tesla Inc. (NASDAQ:TSLA) CEO Elon Musk, publicly criticized his son for his ongoing feud with President Donald Trump and predicted that Trump will emerge victorious. \nWhat Happened: Errol Musk was in Moscow to attend a forum hosted b…",
    "link": "https://biztoc.com/x/43e5b6076cf5fc50",
    "timestamp": "2025-06-09T11:02:16Z"
  },
  {
    "title": "Alterra’s Secret Sauce: Public Companies That Need Truck Parking",
    "description": "A construction company’s ejection from a Boston crane yard a little less than a decade ago is as unlikely a place as any to start an industrial investment empire, but the partners of Alterra Property Group realized it was not a heavy lift. Leo Addimando, Alte…",
    "link": "http://commercialobserver.com/2025/06/alterra-ios-investment-2025/",
    "timestamp": "2025-06-09T11:00:30Z"
  },
  {
    "title": "Education Department pays over $7 million a month to employees forced to sit idle | CNN Politics",
    "description": "The US Department of Education is paying more than $7 million a month to employees it has forced to go on leave, according to analysis from the American Federation of Government Employees Local 252, the union that represents department employees.",
    "link": "https://www.cnn.com/2025/06/09/politics/education-department-idle-employees",
    "timestamp": "2025-06-09T11:00:03Z"
  },
  {
    "title": "EXCLUSIVE: Joe Biden 'Has Been Muzzled by Furious Ex-President Barack Obama' As He's 'Furious' Over Democrats' Trump Loss",
    "description": "Joe Biden is said to have been gagged by ex-president Barack Obama amid ongoing fury over the Democrats' devastating loss to Donald Trump in the 2024 presdential election.",
    "link": "https://radaronline.com/p/joe-biden-muzzled-barack-obama-democrats-trump-loss-fury/",
    "timestamp": "2025-06-09T11:00:00Z"
  },
  {
    "title": "Russia Unleashes Summer Offensive",
    "description": "The Economist: “After weeks of nebulous ceasefire talks at the urging of a semi-engaged President Donald Trump, the war between Russia and Ukraine is intensifying again in savage style and with escalating stakes.” “In the",
    "link": "https://politicalwire.com/2025/06/09/russia-unleashes-summer-offensive/",
    "timestamp": "2025-06-09T11:00:00Z"
  },
  {
    "title": "What Victor Hugo Would Make of Trump",
    "description": "As the president prepares to host Les Mis at the Kennedy Center, a Hugo biographer imagines the French author’s perspective.",
    "link": "https://www.theatlantic.com/books/archive/2025/06/what-victor-hugo-would-make-trump/683067/",
    "timestamp": "2025-06-09T11:00:00Z"
  },
  {
    "title": "Trump Administration Revises Cybersecurity Rules, Replaces Biden and Obama Orders",
    "description": "A new Trump Executive Order limits the use of cybersecurity-related sanctions only against foreign malicious actors",
    "link": "https://www.infosecurity-magazine.com/news/trump-new-cyber-executive-order/",
    "timestamp": "2025-06-09T11:00:00Z"
  },
  {
    "title": "Trump’s One Big Beautiful Bill: Tech And Cybersecurity Implications",
    "description": "Trump’s sweeping “Big Beautiful Bill” reshapes tech, AI and cybersecurity policy while fueling tensions in Washington and triggering a high-stakes digital reset.",
    "link": "https://www.forbes.com/sites/emilsayegh/2025/06/09/trumps-one-big-beautiful-bill-tech-and-cybersecurity-implications/",
    "timestamp": "2025-06-09T11:00:00Z"
  },
  {
    "title": "Boeing sent a new plane on a 3-day journey to China in fresh sign of easing trade tensions",
    "description": "The Xiamen Airlines 737 Max was the first to be sent to China since Boeing returned some planes after tariff tensions boiled over.",
    "link": "https://www.businessinsider.com/boeing-plane-china-in-a-sign-tariff-war-is-easing-2025-6",
    "timestamp": "2025-06-09T10:55:53Z"
  },
  {
    "title": "Trump Administration Violating Yet More Individual Rights in Escalation Over ICE Raid Protests in Los Angeles",
    "description": "We are now in the midst of what Lambert would call an overly dynamic situation, so forgive me if I omitted important information with respect to the rapidly devolving confrontation in Los Angeles between Federal forces and the National Guard versus immigrant …",
    "link": "https://www.nakedcapitalism.com/2025/06/trump-administration-violating-yet-more-individual-rights-in-escalation-over-ice-raid-protests-in-los-angeles.html",
    "timestamp": "2025-06-09T10:54:33Z"
  },
  {
    "title": "Transcript: As Trump Tariff Fiasco Worsens, Even Fox News Is Noticing",
    "description": "The following is a lightly edited transcript of the June 9 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nThe econom…",
    "link": "https://newrepublic.com/article/196274/transcript-trump-tariff-fiasco-worsens-even-fox-news-noticing",
    "timestamp": "2025-06-09T10:53:22Z"
  },
  {
    "title": "\"It's Time For Courage, Not Susan Collins' 'Concern' \"",
    "description": "Last time Susan Collins had to face Maine’s voters, (2020) she barely cracked 50%. Unfortunately, the DC Democratic establishment had chosen a garden variety Democrat who was… better than Collins, but not better enough to excite many voters— or win. She only …",
    "link": "https://crooksandliars.com/2025/06/its-time-courage-not-susan-collins-concern",
    "timestamp": "2025-06-09T10:52:45Z"
  },
  {
    "title": "Tesla faces new challenge as leader announces exit",
    "description": "As Elon Musk shifts his focus back to Tesla (TSLA) amid an ongoing disagreement with President Donald Trump, his company is preparing for another leadership change.\nThe automaker has expanded into other areas of technology in recent years, prompting its leade…",
    "link": "https://biztoc.com/x/90cf70b7dc2e6aed",
    "timestamp": "2025-06-09T10:50:59Z"
  },
  {
    "title": "Diet Coke is making a comeback in US after four years and internet can't keep calm",
    "description": "Coca-Cola seems to be pushing Coke Zero Sugar, but Diet Coke maintains its strong customer base, remaining a popular choice. In exciting news for Diet Coke enthusiasts, Diet Cherry Coke is making a limited-time return with retro packaging, sparking excitement…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/diet-coke-is-making-a-comeback-in-us-after-four-years-and-internet-cant-keep-calm/articleshow/121727009.cms",
    "timestamp": "2025-06-09T10:49:44Z"
  },
  {
    "title": "Should I Attend Trump’s Army Birthday Parade In Washington, DC?",
    "description": "President Donald John Trump has ordered a military parade in Washington, DC this Saturday to commemorate the 250th anniversary of the US Army. The parade also happens to fall on the President’s 79th birthday. Should I check out this spectacle first-hand? I’m …",
    "link": "https://liveandletsfly.com/trump-army-military-parade/",
    "timestamp": "2025-06-09T10:49:22Z"
  },
  {
    "title": "America’s new stealth jets don’t need pilots",
    "description": "Donald Trump has commissioned a new fleet of stealth jets – but they are costing more than is necessary because humans will fly them",
    "link": "http://thespectator.com/technology/americas-new-stealth-jets-dont-need-pilots/",
    "timestamp": "2025-06-09T10:48:23Z"
  },
  {
    "title": "Republican senators to watch in the maneuvering over Trump's big bill",
    "description": "The Senate has set an ambitious timeline to pass President Donald Trump’s sweeping legislation to cut taxes and spending",
    "link": "https://abcnews.go.com/Business/wireStory/republican-senators-watch-maneuvering-trumps-big-bill-122645420",
    "timestamp": "2025-06-09T10:46:30Z"
  },
  {
    "title": "Trump travel ban in effect, citizens from 12 nations barred from US; citizens from Afghanistan and Myanmar among affected",
    "description": "President Donald Trump's sweeping new travel ban came into effect early Monday immediately after midnight, barring citizens from a dozen nations from entering the United States and reviving a divisive measure from his first term. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/09/trump-travel-ban-in-effect-citizens-from-12-nations-barred-from-us-citizens-from-afghanistan-and-myanmar-among-affected",
    "timestamp": "2025-06-09T10:45:00Z"
  },
  {
    "title": "Wall Street futures subdued ahead of US-China trade talks",
    "description": "The second-round of meetings comes four days after U.S. President Donald Trump and Chinese leader Xi Jinping spoke by phone, their first direct interaction...",
    "link": "https://finance.yahoo.com/news/wall-street-futures-subdued-ahead-104259312.html",
    "timestamp": "2025-06-09T10:42:59Z"
  },
  {
    "title": "'Right now!' Trump demands troops swarm LA as he fumes over protest inaction",
    "description": "President Donald Trump continued to rage Monday against protests against immigration raids in Los Angeles after deploying National Guard troops.Nearly 60 demonstrators were arrested over the weekend as protesters were ordered to leave the downtown area, and t…",
    "link": "https://www.rawstory.com/trump-los-angeles-national-guard/",
    "timestamp": "2025-06-09T10:41:43Z"
  },
  {
    "title": "New Leadership Addresses Bureau Of Prisons Employee Misconduct",
    "description": "It has been nearly 5 years since the AP wrote a story on corruption in the BOP ... corruption persists and the new Director has some tough words for violators",
    "link": "https://www.forbes.com/sites/walterpavlo/2025/06/09/new-leadership-addresses-bureau-of-prisons-employee-misconduct/",
    "timestamp": "2025-06-09T10:41:00Z"
  },
  {
    "title": "Tesla, Children's Place And Other Big Stocks Moving Lower In Monday's Pre-Market Session",
    "description": "U.S. stock futures were slightly higher this morning, with the Dow futures gaining around 0.1% points on Monday.\nShares of Tesla, Inc. (NASDAQ:TSLA) fell sharply in today's pre-market trading.\nPresident Donald Trump issued a warning to Elon Musk, stating that…",
    "link": "https://biztoc.com/x/fa3608bce4dd72e5",
    "timestamp": "2025-06-09T10:40:01Z"
  },
  {
    "title": "Japan’s Taiyo Oil Imports Russian Crude on US-Sanctioned Tanker",
    "description": "The Japanese oil refiner Taiyo Oil Co. is taking delivery of a cargo of Russian crude on a tanker that’s blacklisted by both the US Treasury and the European Union.",
    "link": "https://financialpost.com/pmn/business-pmn/japans-taiyo-oil-imports-russian-crude-on-us-sanctioned-tanker",
    "timestamp": "2025-06-09T10:36:53Z"
  },
  {
    "title": "U.S. Solar Growth Faces Tax Credit and Tariff Challenges",
    "description": "The United States just saw one of its strongest quarters in solar capacity additions on record, but growth will slow down going forward due to the federal trade and energy policies, the Solar Energy Industries Association (SEIA) said on Monday. During the fir…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Solar-Growth-Faces-Tax-Credit-and-Tariff-Challenges.html",
    "timestamp": "2025-06-09T10:36:27Z"
  },
  {
    "title": "Ether crypto funds see $296M inflows in best week since Trump election",
    "description": "Ether investment products saw $296 million in inflows last week despite a market slowdown, as investors await clarity from the US Fed’s June rate decision.",
    "link": "https://cointelegraph.com/news/ether-funds-296m-inflows-largest-week-trump-election",
    "timestamp": "2025-06-09T10:32:44Z"
  },
  {
    "title": "Apple WWDC 2025: iPhone maker woos software developers amid AI, regulatory challenges",
    "description": "Apple WWDC 2025 is taking place as the company faces technical and regulatory hurdles, its AI advancements lag behind competitors like Google and Microsoft, impacting its stock value. Delayed AI features and potential App Store regulation coincide with tariff…",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-wwdc-2025-iphone-maker-woos-software-developers-amid-ai-regulatory-challenges/articleshow/121726663.cms",
    "timestamp": "2025-06-09T10:32:41Z"
  },
  {
    "title": "Most Russians No Longer See US as Enemy Nation: Poll",
    "description": "The Levada Center survey shows a big drop in those who view the U.S. as a hostile country.",
    "link": "https://www.newsweek.com/russia-united-states-poll-propaganda-2082665",
    "timestamp": "2025-06-09T10:32:10Z"
  },
  {
    "title": "ABC News' Terry Moran's history of attacking Trump dates back to first term in 2017",
    "description": "ABC News correspondent Terry Moran has a history of attacking President Donald Trump on air before he was suspended for an X post attacking him on Sunday.",
    "link": "https://www.foxnews.com/media/abc-news-terry-morans-history-attacking-trump-dates-back-first-term-2017",
    "timestamp": "2025-06-09T10:30:41Z"
  },
  {
    "title": "Is Trump in the Epstein files? What to know after his social media fight with Elon Musk",
    "description": "What began as a public blowup over a federal tax and spending bill between President Donald Trump and just-departed adviser Elon Musk devolved into the billionaire tech businessman accusing Trump […]\nThe post Is Trump in the Epstein files? What to know after …",
    "link": "https://www.poynter.org/fact-checking/2025/donald-trump-jeffrey-epstein-files-elon-musk/",
    "timestamp": "2025-06-09T10:30:06Z"
  },
  {
    "title": "Farage Backs Reopening Coal Mines in Wales to Save British Steel Industry",
    "description": "Reform UK leader Nigel Farage has called for the re-opening of coal mines in Wales to help revitalise Britain's anemic steel industry in yet another shot across the bow against Sir Keir Starmer's government.\nThe post Farage Backs Reopening Coal Mines in Wales…",
    "link": "https://www.breitbart.com/europe/2025/06/09/farage-backs-reopening-coal-mines-in-wales-to-save-british-steel-industry/",
    "timestamp": "2025-06-09T10:29:17Z"
  },
  {
    "title": "Republican senators to watch in the maneuvering over Trump’s big bill",
    "description": "WASHINGTON (AP) — The Senate has set an ambitious timeline for passing President Donald Trump’s sweeping legislation to cut taxes and spending. But getting it on the Republican president’s desk by July 4 will require some big decisions, and soon. Republican s…",
    "link": "https://financialpost.com/pmn/republican-senators-to-watch-in-the-maneuvering-over-trumps-big-bill",
    "timestamp": "2025-06-09T10:28:05Z"
  },
  {
    "title": "US and China to take second shot at averting trade war in London talks",
    "description": "Senior delegations expected to discuss fragile tariffs deal in bid to avert trade war.",
    "link": "https://www.aljazeera.com/news/2025/6/9/us-and-china-to-take-second-shot-at-averting-trade-war-in-london-talks",
    "timestamp": "2025-06-09T10:26:32Z"
  },
  {
    "title": "NATO’s Rutte to urge ‘quantum leap’ in defense readiness as Putin lurks",
    "description": "Transatlantic military alliance leaders are expected to agree to a new 5 percent of GDP defense spending goal this month.",
    "link": "https://www.politico.eu/article/natos-rutte-to-urge-quantum-leap-in-defense-readiness-as-putin-lurks/",
    "timestamp": "2025-06-09T10:26:21Z"
  },
  {
    "title": "'Straight out of authoritarian playbook': Mass. lawmakers blast Trump's response to Los Angeles protests",
    "description": "Demonstrators who blocked a major freeway, set self-driving cars on fire and clashed with authorities were hit with tear gas and flash bangs after Trump sent in the National Guard to restore order.",
    "link": "https://www.wcvb.com/article/straight-out-of-authoritarian-playbook-mass-lawmakers-blast-trumps-response-to-los-angeles-protests/65008221",
    "timestamp": "2025-06-09T10:25:39Z"
  },
  {
    "title": "Is Donald Trump An Authentic Leader?",
    "description": "Your likelihood of being perceived as authentic increases when you are not honest with yourself.",
    "link": "https://www.forbes.com/sites/tomaspremuzic/2025/06/09/is-donald-trump-an-authentic-leader/",
    "timestamp": "2025-06-09T10:25:35Z"
  },
  {
    "title": "Robert De Niro attacks Donald Trump in Tony Awards speech",
    "description": "Robert De Niro used his Tony Awards speech to take aim at US President Donald Trump.",
    "link": "https://www.the-independent.com/tv/news/robert-de-niro-donald-trump-tony-awards-video-b2766373.html",
    "timestamp": "2025-06-09T10:25:25Z"
  },
  {
    "title": "‘Image of creepiness’: Fury over masked ICE agents has Tommy Tuberville laughing",
    "description": "WASHINGTON — Masked ICE agents are the mysterious and menacing face of the Trump administration’s mass deportation drive. Increasingly alarmed, Democrats are trying to conduct oversight on the Department of Homeland Security, which oversees U.S. Immigration a…",
    "link": "https://www.rawstory.com/raw-investigates/image-of-creepiness-senate-gop-laughs-off-dem-concerns-over-masked-ice-agents/",
    "timestamp": "2025-06-09T10:24:26Z"
  },
  {
    "title": "USAID cuts threaten 'God's food,' made in Georgia for children in need",
    "description": "MANA Nutrition, a non-profit in Georgia, faces a crisis due to deep cuts in U.S. aid programs under the Trump administration. The organization, which produces peanut butter paste to combat child malnutrition globally, has lost USAID contracts, its primary fun…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/usaid-cuts-threaten-gods-food-made-in-georgia-for-children-in-need/articleshow/121726397.cms",
    "timestamp": "2025-06-09T10:24:00Z"
  },
  {
    "title": "Los Angeles protest: Journalist shot at during live broadcast in harrowing moment caught on camera",
    "description": "Los Angeles protest: An Australian reporter was hit in the leg with a rubber bullet fired by a police officer while on live television. Her employer 9News said she was unharmed. The viral moment was caught on camera amid rising tensions in Los Angeles this we…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/los-angeles-protest-journalist-shot-at-during-live-broadcast-in-harrowing-moment-caught-on-camera/articleshow/121726186.cms",
    "timestamp": "2025-06-09T10:20:28Z"
  },
  {
    "title": "Harari warns of ‘spiritual catastrophe’ for Judaism at Unholy stage show appearance",
    "description": "Jonathan Freedland and Yonit Lev interviewed Israeli historian Yuval Noah Harari as they took their Unholy podcast to the stage at London's Queen Elizabeth Hall",
    "link": "https://www.jewishnews.co.uk/harari-warns-of-spiritual-catastrophe-for-judaism-at-unholy-stage-show-appearance/",
    "timestamp": "2025-06-09T10:19:23Z"
  },
  {
    "title": "‘Worse and More Violent’: LA Riots Escalate",
    "description": "UPDATE: Los Angeles Police Chief Jim McDonnell said in a Sunday evening press conference that the violence was “getting increasingly worse and more violent.” “This... Read More\nThe post ‘Worse and More Violent’: LA Riots Escalate appeared first on The Daily S…",
    "link": "https://www.dailysignal.com/2025/06/09/trump-deploys-national-guard-los-angeles-amid-riots-response-ice-raids/",
    "timestamp": "2025-06-09T10:19:00Z"
  },
  {
    "title": "KCAL Reporter Hit by Tear Gas During LA Protests",
    "description": "The cops used tear gas to disperse the crowds",
    "link": "https://www.adweek.com/tvspy/kcal-reporter-hit-by-tear-gas-during-la-protests/",
    "timestamp": "2025-06-09T10:17:38Z"
  },
  {
    "title": "Trump’s Tariff Chaos Threatens His Push for Rust Belt Revival",
    "description": "President Donald Trump’s signature trade policy is threatening to backfire by upending other top priorities: the revival of US manufacturing and the American Rust Belt.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-tariff-chaos-threatens-his-push-for-rust-belt-revival",
    "timestamp": "2025-06-09T10:16:30Z"
  },
  {
    "title": "Fox host gets Trump aide to admit he can't name single country with trade deal",
    "description": "President Donald Trump declared April 2, “Liberation Day” and launched a series of erratic, wildly fluctuating, country-specific tariffs, citing a “national emergency” over the U.S. trade deficit—a trend that has persisted since 1975.He has also vowed to make…",
    "link": "https://www.rawstory.com/fox-host-gets-trump-advisor-to-admit-he-can-t-name-sing-country-that-agreed-to-a/",
    "timestamp": "2025-06-09T10:16:23Z"
  },
  {
    "title": "Dems Absolutely Lose It Over Trump's Swift Action to Restore Order in LA Amid Anti-ICE Chaos",
    "description": "California Democrats are absolutely melting down over President Donald Trump’s decision to deploy the National Guard to Los Angeles in response to the violent anti-ICE riots engulfing the city. As federal law enforcement officers face attacks, vandalism, and …",
    "link": "https://freerepublic.com/focus/f-news/4321836/posts",
    "timestamp": "2025-06-09T10:16:06Z"
  },
  {
    "title": "Protests intensify in Los Angeles after Trump deploys National Guard troops",
    "description": "Tensions in Los Angeles escalated on Sunday as thousands of protesters took to the streets in response to US President Donald Trump’s deployment of the National Guard.",
    "link": "https://www.independent.ie/world-news/north-america/protests-intensify-in-los-angeles-after-trump-deploys-national-guard-troops/a1737968189.html",
    "timestamp": "2025-06-09T10:15:03Z"
  },
  {
    "title": "What sparked the Los Angeles protests and is Trump allowed to deploy the National Guard?",
    "description": "President Donald Trump has deployed National Guard troops to Los Angeles after two days of protests by hundreds of demonstrators against immigration raids.",
    "link": "https://www.channelnewsasia.com/world/los-angeles-protests-immigration-raids-national-guard-trump-5171041",
    "timestamp": "2025-06-09T10:13:37Z"
  },
  {
    "title": "Reporter Gets Hit By Rubber Bullet At L.A. Protest, Sparking Shock Allegation",
    "description": "Lauren Tomasi's outlet pointed out the \"inherent dangers\" that journalists face.",
    "link": "https://www.huffpost.com/entry/australian-reporter-lauren-tomasi-rubber-bullet-los-angeles_n_6846a1d6e4b0bf9944bcd3a9",
    "timestamp": "2025-06-09T10:12:50Z"
  },
  {
    "title": "Is Trump Getting Ready to Cut Off California?",
    "description": "The Trump administration's efforts to bring California back into the mainstream could escalate, a new report said.",
    "link": "https://www.westernjournal.com/trump-getting-ready-cut-off-california/",
    "timestamp": "2025-06-09T10:12:35Z"
  },
  {
    "title": "Analysis-Argentine leader Milei licking his chops ahead of October elections",
    "description": "BUENOS AIRES (Reuters) -Argentina's firebrand right-wing President Javier Milei has largely tamed runaway inflation with a ruthless austerity plan and he aims to solidify power when his party and its allies take on a divided opposition in legislative election…",
    "link": "https://www.thestar.com.my/news/world/2025/06/09/analysis-argentine-leader-milei-licking-his-chops-ahead-of-october-elections",
    "timestamp": "2025-06-09T10:11:00Z"
  },
  {
    "title": "Unrest in Los Angeles over immigration raids as troops sent by Trump fan out",
    "description": "Police ordered the public to disperse from downtown Los Angeles after further unrest, with cars torched and security forces firing tear gas at protesters, in the wake of Donald Trump's deployment of National Guard troops to America's second-biggest city. At l…",
    "link": "https://timesofindia.indiatimes.com/world/us/unrest-in-los-angeles-over-immigration-raids-as-troops-sent-by-trump-fan-out/articleshow/121725750.cms",
    "timestamp": "2025-06-09T10:10:30Z"
  },
  {
    "title": "LA protests: Trump tests limits of presidential authority by sending in the troops",
    "description": "Critics warn administration is increasingly ruling in defiance of US constitution and political norms",
    "link": "https://www.irishtimes.com/world/us/2025/06/09/la-protests-trump-tests-limits-of-presidential-authority-by-sending-in-the-troops/",
    "timestamp": "2025-06-09T10:09:43Z"
  },
  {
    "title": "Democrat Support is Finally Bouncing Back",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAfter months of lagging poll numbers and internal party anxieties, Democrats are seeing signs of a rebound.\nThe Democrats have faced less than impressive polling since President Donald Trump won against Kamala…",
    "link": "https://biztoc.com/x/f52455e44def84f2",
    "timestamp": "2025-06-09T10:07:12Z"
  },
  {
    "title": "WWDC: Apple faces AI, regulatory challenges as it woos software developers",
    "description": "CUPERTINO, California :Apple is facing an unprecedented set of technical and regulatory challenges as some of its key executives are set to take the stage on Monday at the company's annual software developer conference.On the technical side, many of the long-…",
    "link": "https://www.channelnewsasia.com/business/wwdc-apple-faces-ai-regulatory-challenges-it-woos-software-developers-5171201",
    "timestamp": "2025-06-09T10:06:33Z"
  },
  {
    "title": "Trump’s big, beautiful bill, explained in 5 charts",
    "description": "President Donald Trump, joined by Speaker of the House Mike Johnson, speaks to members of the media as he arrives for a House Republican meeting at the Capitol on May 20, 2025. | Andrew Harnik/Getty Images\nThe fight over President Donald Trump’s so-called big…",
    "link": "https://biztoc.com/x/17ef91cdb8c5e5f9",
    "timestamp": "2025-06-09T10:06:32Z"
  },
  {
    "title": "President Trump Removes Barriers To Supersonic Flight",
    "description": "Stimulating Innovation, Reinvigorating R&D, Promoting Int’l Engagement President Donald Trump issued an executive order on June 6 that, among other things, directs the FAA to rescind the prohibition of supersonic flight in the U.S. over land, establishes nois…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=01EA6CC6-7BFF-4165-B9C9-6B2CA0CDAE08",
    "timestamp": "2025-06-09T10:05:00Z"
  },
  {
    "title": "The MAGA odd couple turns combustible",
    "description": "The world’s most powerful man and the world’s richest man have fallen out. No matter who wins, America loses.",
    "link": "https://www.japantimes.co.jp/commentary/2025/06/09/japan/destructive-musk-trump-feud/",
    "timestamp": "2025-06-09T10:02:00Z"
  },
  {
    "title": "Donald Trump Has a Bad Case of Hurt Feelings",
    "description": "Why did Elon Musk turn against Trump in the first place, and will there be a rapprochement between the two petty and powerful men? Axios White House reporter Marc Caputo makes sense of the feud.",
    "link": "http://nymag.com/intelligencer/article/why-did-elon-musk-turn-against-trump-in-the-first-place.html",
    "timestamp": "2025-06-09T10:00:51Z"
  },
  {
    "title": "Finneas says he was tear-assed in LA protests: 'They're inciting this'",
    "description": "Finneas says he was tear-assed in LA protests: 'They're inciting this'pennlive.com",
    "link": "https://www.pennlive.com/entertainment/2025/06/grammy-winning-artist-tear-gassed-at-very-peaceful-protest-in-la-theyre-inciting-this.html",
    "timestamp": "2025-06-09T10:00:46Z"
  },
  {
    "title": "The Origins of the Campus Wars",
    "description": "As governor of California, Reagan laid the path for Trump’s assault on higher education.",
    "link": "http://foreignpolicy.com/2025/06/09/trump-university-attack-reagan-education-campus/",
    "timestamp": "2025-06-09T10:00:43Z"
  },
  {
    "title": "'Billboard Chris' sounds off after arrest in 'most woke city' for opposing transgender treatments for kids",
    "description": "Activists detained in Europe for anti-transgender medical treatment signs share their experience of harassment, arrest, and concerns about free speech.",
    "link": "https://www.foxnews.com/media/billboard-chris-sounds-off-after-arrest-most-woke-city-opposing-transgender-treatments-kids",
    "timestamp": "2025-06-09T10:00:36Z"
  }
]