[
  {
    "title": "Fact Sheet: President Donald J. Trump Prioritizes the Warfighter in Defense Contracting",
    "description": "PUTTING OUR WARFIGHTERS FIRST: Today, President Donald J. Trump signed an Executive Order to stop defense contractors from putting stock buybacks and excessive corporate distributions ahead of production capacity, innovation, and on-time delivery for America’…",
    "link": "https://biztoc.com/x/9a645a490532166d",
    "timestamp": "2026-01-08T12:48:25Z"
  },
  {
    "title": "White House Does Not Rule Out Use of Military In Greenland Following Operations in Venezuela",
    "description": "The White House said the use of the military \"is always an option\" in pursuing control of Greenland despite warnings from major European powers that they will continue to defend the island's sovereignty.",
    "link": "https://www.ibtimes.com/white-house-does-not-rule-out-use-military-greenland-following-operations-venezuela-3794725",
    "timestamp": "2026-01-08T12:45:47Z"
  },
  {
    "title": "Venezuela reports 100 killed in U.S. operation; poll shows limited U.S. support",
    "description": "Americans are far more likely to support a crackdown when they believe it targets drug trafficking rather than oil reserves.",
    "link": "https://www.wsbradio.com/news/politics/venezuela-reports-100-killed-us-operation-poll-shows-limited-us-support/U37WLRHJHJHL5CWVL4M7PXWAT4/",
    "timestamp": "2026-01-08T12:45:31Z"
  },
  {
    "title": "Details emerge of how close ‘perfectly executed’ Maduro raid came to going wrong for US",
    "description": "Helicopter pilot who led Caracas mission was hit three times, while more than 40 Venezuelans and 32 Cubans were killed",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2026/01/07/us/politics/trump-venezuela-helicopter.html",
    "timestamp": "2026-01-08T12:44:24Z"
  },
  {
    "title": "GOP Votes Down Pressley's Motion to Investigate Minneapolis ICE Shooting",
    "description": "Congresswoman Ayanna Pressley told her fellow members of the US House Oversight Committee on Wednesday that a motion she was introducing during a hearing was \"pretty straightforward\": The committee, she said, should conduct oversight regarding a federal agent…",
    "link": "https://www.commondreams.org/news/ice-shoot-woman",
    "timestamp": "2026-01-08T12:44:21Z"
  },
  {
    "title": "Trump’s lesbian niece calls him out for ‘ignoring’ Capitol officers injured or killed on 6 January",
    "description": "Donald Trump’s lesbian niece Mary, who is one of his most vocal critics, has lambasted the Republican president for ignoring the Capitol officers who were injured or killed during the 6 January riots – the fifth anniversary of which took place on Monday. The …",
    "link": "https://www.thepinknews.com/2026/01/08/mary-trump-donald-trump-6-january-us-capitol/",
    "timestamp": "2026-01-08T12:43:40Z"
  },
  {
    "title": "Markets plunge on 500% US tariff threat; Nifty breaches 26,000 mark",
    "description": "Markets plunge as Nifty dips below 26,000 amid fears of a 500% US tariff on Russian oil imports.",
    "link": "https://www.thehindubusinessline.com/markets/markets-plunge-on-500-us-tariff-threat-nifty-breaches-26000-mark/article70486433.ece",
    "timestamp": "2026-01-08T12:42:07Z"
  },
  {
    "title": "Markets plunge on 500% US tariff threat, Nifty breaches 26,000 mark",
    "description": "Markets plunge as Nifty dips below 26,000 amid fears of a 500% US tariff on Russian oil imports.",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/markets-plunge-on-500-us-tariff-threat-nifty-breaches-26000-mark/article70486433.ece",
    "timestamp": "2026-01-08T12:42:07Z"
  },
  {
    "title": "How will the Iran protests end? Arash Azizi says 'This won't be a classic revolution'",
    "description": "Once Again, Iranians Have Taken to the Streets. Starting in Late December, the Plummeting Value of the National Currency, Along With the Soaring Cost of Living,",
    "link": "https://www.haaretz.com/israel-news/podcasts/2026-01-08/ty-article-podcast/how-will-the-iran-protests-end-arash-azizi-says-this-wont-be-a-classic-revolution/0000019b-981f-dc05-af9b-989fe5910000",
    "timestamp": "2026-01-08T12:40:03Z"
  },
  {
    "title": "Trump says US oversight of Venezuela could last years",
    "description": "During what the New York Times described as a wide-ranging, two-hour interview, the paper said Trump also appeared to lift a threat to take military action against Venezuela's neighbour Colombia. Trump invited Colombia's leftist leader, whom he had previously…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-oversight-of-venezuela-could-last-years/articleshow/126415340.cms",
    "timestamp": "2026-01-08T12:38:49Z"
  },
  {
    "title": "This action before ICE killing blows apart key claim by Trump and Noem: journalist",
    "description": "A fuming Jonathan Lemire thoroughly dismantled what he determined to be lies by Donald Trump and DHS Secretary Kristi about the point-blank killing of 37-year-old Renee Good in Minneapolis on Wednesday by an ICE agent, an incident which has set off a national…",
    "link": "https://www.rawstory.com/trump-noem-minnesota-shooting/",
    "timestamp": "2026-01-08T12:37:25Z"
  },
  {
    "title": "City on edge after fatal shooting...",
    "description": "Minneapolis is on edge following the fatal shooting of a woman by an Immigration and Customs Enforcement officer taking part in the Trump administration’s latest immigration crackdown. The governor called for people to remain calm and the city’s school distri…",
    "link": "https://apnews.com/article/minnesota-immigration-enforcement-crackdown-woman-shot-5158ce0838305b491c95db97b970cd03",
    "timestamp": "2026-01-08T12:34:37Z"
  },
  {
    "title": "Professional Stylist Reveals Why Trump’s Hair Has Turned Pink",
    "description": "\"He's using pink candyfloss instead of yellow.\"",
    "link": "https://www.boredpanda.com/professional-stylist-reveals-why-donald-trumps-hair-has-turned-pink/",
    "timestamp": "2026-01-08T12:34:30Z"
  },
  {
    "title": "As Trump ramps up the heat on Greenland, Denmark warns it would shoot US forces",
    "description": "Denmark has confirmed army rules allowing soldiers to attack invading forces immediately. This comes as the US explores seizing Greenland. European leaders have united to defend the island's territorial integrity. President Trump has criticized NATO allies fo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-trump-ramps-up-the-heat-on-greenland-denmark-warns-it-would-shoot-us-forces/articleshow/126414302.cms",
    "timestamp": "2026-01-08T12:34:18Z"
  },
  {
    "title": "How a GOP Rep Is Working with Trump to Ban Large Investors From Buying Single-Family Homes",
    "description": "When Rep. Mary Miller saw President Donald Trump’s announcement of plans to ban large investors from buying single-family homes, she immediately volunteered to introduce a... Read More\nThe post How a GOP Rep Is Working with Trump to Ban Large Investors From B…",
    "link": "https://www.dailysignal.com/2026/01/08/how-a-gop-rep-is-working-with-trump-to-ban-large-investors-from-buying-single-family-homes/",
    "timestamp": "2026-01-08T12:30:00Z"
  },
  {
    "title": "OPEC Held Supply Flat Last Month as Venezuela Output Fell, Survey Shows",
    "description": "OPEC’s crude production held steady in December as a slump in Venezuela’s output to the lowest in two years was offset by increases in Iraq and some other members, a Bloomberg survey showed.",
    "link": "https://financialpost.com/pmn/business-pmn/opec-held-supply-flat-last-month-as-venezuela-output-fell-survey-shows",
    "timestamp": "2026-01-08T12:29:40Z"
  },
  {
    "title": "Who was Renee Nicole Good, the woman killed in ICE Minneapolis shooting?",
    "description": "Trump administration officials allege the shooting victim was interfering with an ICE agent's work.",
    "link": "https://www.aljazeera.com/news/2026/1/8/who-is-renee-nicole-good-the-woman-killed-in-the-ice-minneapolis-shooting",
    "timestamp": "2026-01-08T12:28:03Z"
  },
  {
    "title": "Kai Trump admits she stays out of politics ‘completely,’ calling it a ‘dangerous thing’",
    "description": "President Donald Trump’s granddaughter Kai, 18, is focusing on her golf career at the University of Miami and said she has no plans to enter politics.",
    "link": "https://www.foxnews.com/sports/kai-trump-admits-she-stays-out-politics-completely-calling-dangerous-thing",
    "timestamp": "2026-01-08T12:28:02Z"
  },
  {
    "title": "Denmark sees talks with US as a chance for 'dialogue that is needed' over Greenland",
    "description": "Denmark has welcomed a meeting with the U.S. next week to discuss the Trump administration's renewed interest in acquiring Greenland",
    "link": "https://abcnews.go.com/International/wireStory/denmark-sees-talks-us-chance-dialogue-needed-greenland-129012305",
    "timestamp": "2026-01-08T12:26:25Z"
  },
  {
    "title": "Zelenskiy says US security guarantees document set to be finalised with Trump",
    "description": "KYIV, Jan 8 (Reuters) - Ukrainian President Volodymyr Zelenskiy said on Thursday the text of a bilateral security guarantee between Kyiv and Washington was “essentially r… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/08/zelenskiy-says-us-security-guarantees-document-set-to-be-finalised-with-trump",
    "timestamp": "2026-01-08T12:26:08Z"
  },
  {
    "title": "Trump Suggests US Could Run Venezuela and its Oil for Years",
    "description": "In a new interview, President Donald Trump is signaling the United States could be involved in Venezuela for years and says he intends to rebuild its oil industry. Tensions over that oil are playing out on the global stage with the U.S. seizing two more tanke…",
    "link": "https://www.today.com/video/trump-suggests-us-could-run-venezuela-and-its-oil-for-years-255606341719",
    "timestamp": "2026-01-08T12:26:01Z"
  },
  {
    "title": "Could Venezuela Production Get Back to 3MM Barrels Per Day?",
    "description": "Could Venezuelan oil production get back to three million barrels per day?",
    "link": "https://www.rigzone.com/news/could_venezuela_production_get_back_to_3mm_barrels_per_day-08-jan-2026-182716-article/",
    "timestamp": "2026-01-08T12:25:03Z"
  },
  {
    "title": "Kai Trump reveals major surgery following a record-breaking golf season",
    "description": "Kai Trump announced on Monday through her social media a significant personal update, revealing that she had undergone a major surgery. As she begins her road to recovery, the news",
    "link": "https://www.marca.com/en/golf/2026/01/08/695f993846163f617f8b4592.html",
    "timestamp": "2026-01-08T12:24:04Z"
  },
  {
    "title": "Vitol and Trafigura in talks with US on Venezuelan oil sales, sources say",
    "description": "LONDON, Jan 8 : ‌Vitol and Trafigura, two of the world's largest commodity traders, are in talks with the administration of U.S. President Donald Trump about the marketing of Venezuelan oil, four sources familiar with the matter said. European trading houses …",
    "link": "https://www.channelnewsasia.com/business/vitol-and-trafigura-in-talks-us-venezuelan-oil-sales-sources-say-5846306",
    "timestamp": "2026-01-08T12:22:59Z"
  },
  {
    "title": "Exclusive-Vitol and Trafigura invited to White House on Friday for Venezuelan oil talks",
    "description": "LONDON, Jan 8 : U.S. President Donald Trump's administration has invited bosses from commodity trading houses Vitol and Trafigura to the White House on Friday for talks on marketing Venezuelan oil, four sources familiar with the matter told Reuters. European …",
    "link": "https://www.channelnewsasia.com/business/exclusive-vitol-and-trafigura-invited-white-house-friday-venezuelan-oil-talks-5846306",
    "timestamp": "2026-01-08T12:22:59Z"
  },
  {
    "title": "Trump Scrambles Health Care Talks Again",
    "description": "Punchbowl News: “For a moment, it seemed like President Donald Trump was nudging Republicans to make a health care deal with Democrats and address one of the biggest election-year vulnerabilities facing the GOP.” “But it may have the exact opposite effect.” “…",
    "link": "https://politicalwire.com/2026/01/08/trump-scrambles-health-care-talks-again/",
    "timestamp": "2026-01-08T12:22:53Z"
  },
  {
    "title": "350.org on the US withdrawal from the UNFCCC & other international bodies",
    "description": "US President Donald Trump has signed an executive order withdrawing the United States from 66 international organizations, including the UN Framework Convention on Climate Change (UNFCCC), the 1992 treaty that underpins all global climate cooperation, and the…",
    "link": "https://www.commondreams.org/newswire/350-org-on-the-us-withdrawal-from-the-unfccc-other-international-bodies",
    "timestamp": "2026-01-08T12:20:28Z"
  },
  {
    "title": "Morgan urges PM to stand up to Trump on Venezuela and Greenland",
    "description": "Welsh first minister says  there comes a point when you have to \"say up to here and no further\".",
    "link": "https://www.bbc.com/news/articles/c1evnl3201jo",
    "timestamp": "2026-01-08T12:17:03Z"
  },
  {
    "title": "Dense, sticky and heavy: why Venezuela’s oil is valuable to Trump – video explainer",
    "description": "The Venezuelan oil industry is ‘a total bust’ according to Donald Trump, something he has promised to ‘fix’ after attacking Caracas and seizing the country’s leader. But with analysts estimating it could take up to 14 years and billions to fix, what is in it …",
    "link": "https://biztoc.com/x/5f7d42e1611384f0",
    "timestamp": "2026-01-08T12:15:24Z"
  },
  {
    "title": "ICE agents killed a 37-year-old mother & US citizen in Minneapolis",
    "description": "Embed from Getty Images Donald Trump sent a huge ICE force into Minneapolis this week as part of a BS “crackdown” on immigration. As we’ve seen for the past year, Trump sends huge ICE contingents into Democratic-stronghold cities with the express purpose of c…",
    "link": "https://www.celebitchy.com/956236/ice_agents_killed_a_37-year-old_mother_us_citizen_in_minneapolis/",
    "timestamp": "2026-01-08T12:15:09Z"
  },
  {
    "title": "ICE Agent's Fatal Shooting Of Woman In Minneapolis Triggers Protests, Official Dispute",
    "description": "The woman was identified as Renee Nicole Good, 37, a mother of three who had recently moved to Minnesota. Authorities have said she was not the target of an immigration enforcement action at the time of the incident.",
    "link": "https://www.ibtimes.com/ice-agents-fatal-shooting-woman-minneapolis-triggers-protests-official-dispute-3794724",
    "timestamp": "2026-01-08T12:14:52Z"
  },
  {
    "title": "RBI considering fresh exporter relief steps after low take‑up of loan moratorium, sources say",
    "description": "The Reserve Bank of India is exploring new measures to aid Indian exporters facing U.S. tariffs. A previous loan repayment moratorium saw limited participation. The central bank is now considering easing eligibility for the moratorium or offering fresh subsid…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/rbi-considering-fresh-exporter-relief-us-tariff-steps-after-low-takeup-of-loan-moratorium-sources-say/articleshow/126414720.cms",
    "timestamp": "2026-01-08T12:13:36Z"
  },
  {
    "title": "Iran ready to fight back if US or Israel attacks again, says foreign minister",
    "description": "Iran's foreign minister says his country does not want war with Israel or the U.S., but is ready to fight back if attacked",
    "link": "https://abcnews.go.com/International/wireStory/iran-ready-fight-back-us-israel-attacks-foreign-129010809",
    "timestamp": "2026-01-08T12:13:31Z"
  },
  {
    "title": "Even When It's Pointless, the Trump Admin Automatically Ignores Judge's Rulings",
    "description": "A judge ruled U.S. attorney Lindsey Halligan was illegally appointed. She's continued at the Justice Department anyway for the last six weeks.",
    "link": "https://www.jezebel.com/lindsey-halligan-us-attorney-judge-orders-ruling-ignored-trump-justice-department-illegal",
    "timestamp": "2026-01-08T12:12:55Z"
  },
  {
    "title": "Russian war deaths are rising to unsustainable levels, says Ukraine",
    "description": "Russian mortality rates reportedly soar, troops test new tactics and Zelenskyy reshuffles Defence Ministry.",
    "link": "https://www.aljazeera.com/news/2026/1/8/russian-war-fatalities-are-rising-to-unsustainable-levels-says-ukraine",
    "timestamp": "2026-01-08T12:12:11Z"
  },
  {
    "title": "Vance criticises Denmark and Europe's handling of 'critical' Greenland",
    "description": "European allies of Denmark have rejected Trump's ideas to annex the semi-autonomous territory.",
    "link": "https://www.bbc.com/news/articles/c2lgjd51v95o",
    "timestamp": "2026-01-08T12:11:27Z"
  },
  {
    "title": "Trump seeks more than $6M from Fani Willis's office in wake of election interference case",
    "description": "President Donald Trump's lawyers in Georgia filed a motion this week seeking more than $6 million from the Fulton County District Attorney's Office.",
    "link": "https://www.foxnews.com/politics/trump-seeks-more-than-6m-from-fani-williss-office-wake-election-interference-case",
    "timestamp": "2026-01-08T12:11:24Z"
  },
  {
    "title": "500% Trump Tariffs? India could pay the price on Russian oil sanctions while China cruises free",
    "description": "A proposed sanctions bill in the US is set to deliver heavy tariffs on nations importing inexpensive Russian oil. India could face significant repercussions, while China appears insulated from these measures.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/500-trump-tariffs-india-could-pay-the-price-on-russian-oil-sanctions-while-china-cruises-free/articleshow/126414487.cms",
    "timestamp": "2026-01-08T12:10:37Z"
  },
  {
    "title": "Community reacts to ICE shooting in Minnesota. And, RFK Jr. unveils new food pyramid",
    "description": "Minnesota law enforcement and the FBI are investigating an ICE officer's fatal shooting of a Minneapolis woman. And, Health Secretary RFK Jr. unveils new dietary guidelines for Americans.",
    "link": "https://www.npr.org/2026/01/08/g-s1-105040/up-first-newsletter-ice-shooting-minneapolis-venezuela-tanker-dietary-guidelines",
    "timestamp": "2026-01-08T12:10:18Z"
  },
  {
    "title": "Trump defends ICE officer who shot and killed Minneapolis woman and Russia reacts to seized oil tanker: Morning Rundown",
    "description": "In today’s newsletter: Minneapolis woman is shot dead by an ICE officer.",
    "link": "https://www.nbcnews.com/news/us-news/fatal-ice-shooting-seized-oil-tanker-food-pyramid-morning-rundown-rcna252935",
    "timestamp": "2026-01-08T12:09:51Z"
  },
  {
    "title": "Trump overseeing 'rogue state' that 'demands compliance' from the world: columnist",
    "description": "Donald Trump is overseeing a \"rogue state\" administration which \"demands compliance\" from countries all over the world, a political analyst has suggested. The president's desire to take over Greenland and run the oil refineries in Venezuela has prompted colum…",
    "link": "https://www.rawstory.com/trump-greenland-2674859807/",
    "timestamp": "2026-01-08T12:09:17Z"
  },
  {
    "title": "Foreign troops in Ukraine 'legitimate targets'",
    "description": "Russia said that any troops sent to Ukraine by Western governments would be \"legitimate combat targets\", after the UK and France announced plans to deploy a multinational force there in the event of a ceasefire.",
    "link": "https://www.rte.ie/news/world/2026/0108/1552102-ukraine-russia/",
    "timestamp": "2026-01-08T12:09:15Z"
  },
  {
    "title": "Gaza, Venezuela, Ukraine: The fault lines shaping 2026",
    "description": "This year could be a turning point for Trump’s foreign policy, and for the balance of power Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630722-gaza-venezuela-ukraine-fault-lines/",
    "timestamp": "2026-01-08T12:09:01Z"
  },
  {
    "title": "Democratic Fulton County commissioner announces bid to become Georgia secretary of state",
    "description": "Fulton County Commissioner Dana Barrett has announced her candidacy to become Georgia's secretary of state",
    "link": "https://abcnews.go.com/US/wireStory/democratic-fulton-county-commissioner-announces-bid-become-georgia-129012087",
    "timestamp": "2026-01-08T12:06:14Z"
  },
  {
    "title": "Trump to meet with Colombian president as tensions escalate",
    "description": "US President Donald Trump offered to host his Colombian counterpart for talks soon, pointing to a detente just days after he suggested Washington could follow up its intervention in Caracas with one in Bogotá.\nColombia — a hub of the global drug trade — and t…",
    "link": "https://biztoc.com/x/b7d8c39ea8e563b7",
    "timestamp": "2026-01-08T12:04:44Z"
  },
  {
    "title": "3 Photos of Renee Good: Minneapolis Woman Killed by ICE Agent Called 'Amazing Human Being' by Mother",
    "description": "Renee Nicole Good, 37, identified as woman fatally shot by ICE agent in Minneapolis. Trump defends shooting as self-defence whilst local officials demand federal accountability.",
    "link": "https://www.ibtimes.com/3-photos-renee-good-minneapolis-woman-killed-ice-agent-called-amazing-human-being-mother-3794718",
    "timestamp": "2026-01-08T12:02:57Z"
  },
  {
    "title": "How to Fix America’s Broken Arsenal",
    "description": "The defense establishment has severe knowledge gaps about its own, aging industrial base.",
    "link": "http://foreignpolicy.com/2026/01/08/defense-industrial-base-arsenal-hegseth-trump/",
    "timestamp": "2026-01-08T12:00:39Z"
  },
  {
    "title": "Drugmakers brace for Europe pricing battle",
    "description": "Global drugmakers face a battle in 2026 to secure higher prices for their prescription medicines in Europe after agreeing to cut U.S. pricing last year under pressure from President Donald Trump.",
    "link": "https://www.rte.ie/news/business/2026/0108/1552101-pharma-europe-us/",
    "timestamp": "2026-01-08T12:00:30Z"
  },
  {
    "title": "Universities slash 9,000+ positions in 2025 as Trump targets federal funding and foreign students: report",
    "description": "Higher education faces crisis as 9,000+ jobs lost in 2025, with Trump policies allegedly impacting university funding and international student enrollment.",
    "link": "https://www.foxnews.com/media/higher-education-hemorrhaging-jobs-across-nation-trump-administration-policies-take-toll-report",
    "timestamp": "2026-01-08T12:00:28Z"
  },
  {
    "title": "Palau agrees to take up to 75 deportees from US under $7.5M deal",
    "description": "In December 2025, the U.S. and Palau signed a $7.5 million agreement that will allow the U.S. to send up to 75 non-criminal deportees to the island nation.",
    "link": "https://www.snopes.com//fact-check/palau-us-migrants-deal/",
    "timestamp": "2026-01-08T12:00:00Z"
  },
  {
    "title": "‘Aren’t We Supposed to Be the Good Guys Here?’",
    "description": "Senator Mark Kelly says that taking Greenland “would probably be the biggest mistake any president has made in the history of this country.”",
    "link": "https://www.theatlantic.com/podcasts/2026/01/mark-kelly-greenland-hegseth-trump/685543/",
    "timestamp": "2026-01-08T12:00:00Z"
  },
  {
    "title": "Inside Donald Trump’s Attack on NASA’s Science Missions",
    "description": "During his first year back in office, the president tried to bring America’s age of discovery to an end.",
    "link": "https://www.theatlantic.com/magazine/2026/02/trump-nasa-budget-american-space-program/685332/",
    "timestamp": "2026-01-08T12:00:00Z"
  },
  {
    "title": "Russia says foreign troops in Ukraine would be targets after UK and France pledge post-ceasefire deployment",
    "description": "MOSCOW, Jan 8 (Reuters) - Russia said on ‌Thursday that any troops sent to Ukraine by Western governments would be \"legitimate combat targets\", after ‌Britain and France announced plans to deploy a multinational force there in the event of ‌a ceasefire. Read …",
    "link": "https://www.thestar.com.my/news/world/2026/01/08/russia-says-foreign-troops-in-ukraine-would-be-targets-after-uk-and-france-pledge-post-ceasefire-deployment",
    "timestamp": "2026-01-08T11:59:00Z"
  },
  {
    "title": "ICE Agents Blocked A Doctor From Checking On Renee Nicole Good After Fatal Shooting: 'We Have Our Own Medics'",
    "description": "The Minneapolis ICE shooting of Renee Nicole Good features video of agents blocking a doctor from aiding her after fatal shots, sparking disputes, protests, and investigations",
    "link": "https://www.ibtimes.com/ice-agents-blocked-doctor-checking-renee-nicole-good-after-fatal-shooting-we-have-our-own-3794705",
    "timestamp": "2026-01-08T11:56:18Z"
  },
  {
    "title": "Trump’s Gangsterism Escalation: Plans to Steal and Sell Venezuela Oil; Seizure of Russian And Chinese Tankers; Greenlight of Maximum Pressure Sanctions; Venezuela and Denmark Not On Board With Heists",
    "description": "Trump continues on a warpath on multiple fronts: Venezuela, Russia, China, and Denmark.",
    "link": "https://www.nakedcapitalism.com/2026/01/trumps-gangsterism-escalation-plans-to-steal-and-sell-venezuela-oil-seizure-of-russian-and-chinese-tankers-greenlight-of-maximum-pressure-sanctions-venezuela-and-denmark-not-on-board-with-heists.html",
    "timestamp": "2026-01-08T11:54:10Z"
  },
  {
    "title": "Afternoon recap: Fubara impeachment, Adichie’s loss, Nigerian words in Oxford, other top stories",
    "description": "Get your afternoon recap of Nigerian news, including the Fubara impeachment, Adichie’s loss, and new Nigerian words in the Oxford Dictionary.\n\nRead More: https://punchng.com/afternoon-recap-fubara-impeachment-adichies-loss-nigerian-words-in-oxford-other-top-s…",
    "link": "https://punchng.com/afternoon-recap-fubara-impeachment-adichies-loss-nigerian-words-in-oxford-other-top-stories/",
    "timestamp": "2026-01-08T11:54:09Z"
  },
  {
    "title": "Donald Trump asserts control over Venezuela—and all the Americas",
    "description": "Donald Trump asserts control over Venezuela—and all the Americas\nBut the president’s claim of dominance over the western hemisphere may backfire\nThe action, in the form of American forces’ lightning raid to capture Nicolás Maduro, Venezuela’s strongman presid…",
    "link": "https://biztoc.com/x/bcccfdb5ef621a3d",
    "timestamp": "2026-01-08T11:53:28Z"
  },
  {
    "title": "\"I run the show\": Jerry Jones compares himself to Donald Trump and the Cowboys to Venezuela",
    "description": "Press conferences in all sports leagues and specifically in the National Football League (NFL) tend to be politically correct, with cliches and trying not to reveal much more than",
    "link": "https://www.marca.com/en/nfl/dallas-cowboys/2026/01/08/695f96fde2704ef60a8b4589.html",
    "timestamp": "2026-01-08T11:51:44Z"
  },
  {
    "title": "Greenland should hold talks with the US without Denmark, opposition leader says",
    "description": "Pele Broberg's Naleraq party has said it wants a defence agreement with Washington and could pursue a \"free association\" arrangement under which Greenland would receive US support and protection in exchange for military rights, without becoming a US territory.",
    "link": "https://www.channelnewsasia.com/world/greenland-talks-us-without-denmark-pele-boleberg-5846151",
    "timestamp": "2026-01-08T11:49:00Z"
  },
  {
    "title": "Trump Reveals How Long US Plans to Run Venezuela and Control Its Oil",
    "description": "Trump signalled an open-ended involvement in the country while declining to say what circumstances might lead to American troops being sent in.\nThe post Trump Reveals How Long US Plans to Run Venezuela and Control Its Oil first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-reveals-how-long-us-plans-to-run-venezuela-and-control-its-oil/",
    "timestamp": "2026-01-08T11:48:36Z"
  },
  {
    "title": "US Senate to vote on reining in Trump on Venezuela",
    "description": "WASHINGTON, Jan 8 (Reuters) - The U.S. ‌Senate is due to consider a resolution on Thursday that would block President Donald Trump from taking further ‌military action against Venezuela without congressional authorization, and backers said the measure could p…",
    "link": "https://www.thestar.com.my/news/world/2026/01/08/us-senate-to-vote-on-reining-in-trump-on-venezuela",
    "timestamp": "2026-01-08T11:47:00Z"
  },
  {
    "title": "Trump says US control of oil-rich Venezuela could last years",
    "description": "The United States could oversee Venezuela and control its oil revenue for years, President Donald Trump said in an interview published on Thursday.",
    "link": "https://www.independent.ie/world-news/latin-america/trump-says-us-control-of-oil-rich-venezuela-could-last-years/a920525544.html",
    "timestamp": "2026-01-08T11:46:36Z"
  },
  {
    "title": "Trump's Foreign Moves Aren't Distractions, They Are Hastening The US Sovereign Debt And Dollar Crisis: Peter Schiff",
    "description": "Economist Peter Schiff slammed President Donald Trump’s increasingly incendiary foreign policy rhetoric, warning that it is now more than a mere distraction ...",
    "link": "https://finance.yahoo.com/news/trumps-foreign-moves-arent-distractions-114604592.html",
    "timestamp": "2026-01-08T11:46:04Z"
  },
  {
    "title": "Cracks in Democrats' Venezuela response reveal foreign policy muddle (Washington Post)",
    "description": "Washington Post:\nCracks in Democrats' Venezuela response reveal foreign policy muddle  —  The party has struggled to counter Trump's “America First” rhetoric: “We really have to reassert ourselves,” one senator said.  —  Just now  —  In the days following the…",
    "link": "https://www.memeorandum.com/260108/p14",
    "timestamp": "2026-01-08T11:45:04Z"
  },
  {
    "title": "Campaigners urge UK to develop digital sovereignty strategy",
    "description": "UK digital rights campaigners have urged UK parliamentarians to implement a digital sovereignty strategy as part of the forthcoming Cybersecurity and Resilience Bill to reduce reliance on technology subject to foreign interference",
    "link": "https://www.computerweekly.com/news/366637125/Campaigners-urge-UK-to-develop-digital-sovereignty-strategy",
    "timestamp": "2026-01-08T11:45:00Z"
  },
  {
    "title": "America needs a moral reckoning in 2026",
    "description": "Defeating Trumpism requires fluency in moral language",
    "link": "https://www.salon.com/2026/01/08/america-needs-a-moral-reckoning-in-2026/",
    "timestamp": "2026-01-08T11:45:00Z"
  },
  {
    "title": "Dem Rep. Steny Hoyer, 86, to announce retirement after career spanning four decades",
    "description": "Maryland Rep. Steny Hoyer expected to announce retirement from Congress after four decades of service, ending a historic career as second-ranking Democrat.",
    "link": "https://www.foxnews.com/politics/dem-rep-steny-hoyer-86-announce-retirement-after-career-spanning-four-decades",
    "timestamp": "2026-01-08T11:43:59Z"
  },
  {
    "title": "'I would say much longer': Trump gives ominous response to question about ruling Venezuela",
    "description": "President Donald Trump said the United States would take control of Venezuela indefinitely after capturing its leader Nicolás Maduro.The 79-year-old president told the New York Times during a nearly two-hour interview that he expected the U.S. to run the Sout…",
    "link": "https://www.rawstory.com/donald-trump-venezuela-oil/",
    "timestamp": "2026-01-08T11:43:27Z"
  },
  {
    "title": "German President Issues Grave ‘Den Of Robbers’ Warning About Trump And The World Order",
    "description": "In unusually strong remarks, former foreign minister Frank-Walter Steinmeier said global democracy was being attacked as never before.",
    "link": "https://www.huffpost.com/entry/german-president-slams-donald-trump-foreign-policy_n_695f91fbe4b05f1e1aabcd8a",
    "timestamp": "2026-01-08T11:35:00Z"
  },
  {
    "title": "Protests in Iran sparked by economic woes now nationwide, say activists",
    "description": "DUBAI (AP): Protests in Iran sparked by economic woes have now gone nationwide in the Islamic Republic, activists said Thursday, signaling both their staying power and intensity as they challenge the country's theocracy. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/08/protests-in-iran-sparked-by-economic-woes-now-nationwide-say-activists",
    "timestamp": "2026-01-08T11:35:00Z"
  },
  {
    "title": "Importers brace for $150 billion tariff refund fight if Trump loses at Supreme Court",
    "description": "Gold may hit $5,000/oz in 1H’26 - HSBC\nBy David Lawder and Timothy Aeppel\nWASHINGTON, Jan 8 (Reuters) - Company executives, customs brokers and trade lawyers are bracing for a Supreme Court ruling on the legality of President Donald Trump’s sweeping global ta…",
    "link": "https://biztoc.com/x/63307d06a631ab11",
    "timestamp": "2026-01-08T11:30:58Z"
  },
  {
    "title": "Trump plans to use Venezuela’s huge oil reserves ‘to cut US consumer price to $50 a barrel’",
    "description": "President reportedly hopes falling price will cut domestic consumer energy bills\nBusiness live – latest updates\nDonald Trump plans to use Venezuela’s vast crude reserves to establish control of most of the western hemisphere’s oil in an attempt to drive the m…",
    "link": "https://biztoc.com/x/370830e8bac999dc",
    "timestamp": "2026-01-08T11:30:47Z"
  },
  {
    "title": "Trump, Colombian Leader Hold Call As Tensions Ease",
    "description": "President Donald Trump spoke Wednesday with Colombian President Gustavo Petro, signaling a possible easing of months-long tensions marked by sharp rhetoric and policy clashes. \nTrump said he appreciated Petro’s call and tone, adding that the two leaders plan …",
    "link": "https://biztoc.com/x/a00d06c23feb40e7",
    "timestamp": "2026-01-08T11:30:43Z"
  },
  {
    "title": "Chaos!: Democrats Use Minneapolis Shooting to Push Their Anti-Trump 2026 Campaign Theme",
    "description": "Democrats are using the shooting death of a progressive street protestor to magnify their 2026 campaign theme: That President Donald Trump is imposing \"chaos\" on stable American communities.\nThe post Chaos!: Democrats Use Minneapolis Shooting to Push Their An…",
    "link": "https://www.breitbart.com/economy/2026/01/08/tim-walz-maxes-democrats-chaos-election-strategy/",
    "timestamp": "2026-01-08T11:29:25Z"
  },
  {
    "title": "AUR submitted a bill to declare 2026 as „The Year of the United States in Romania”",
    "description": "On Thursday, the Alliance for the Union of Romanians (AUR) submitted a bill to Parliament proposing that 2026 be declared \"The Year of the United States of America in Romania.\"",
    "link": "https://www.mediafax.ro/english/aur-submitted-a-bill-to-declare-2026-as-the-year-of-the-united-states-in-romania-23668410",
    "timestamp": "2026-01-08T11:23:56Z"
  },
  {
    "title": "Sensex slips 800 points and Nifty sees a decisive breakdown. Can investors ignore Trump to buy the dip?",
    "description": "Indian markets extended losses as the Sensex slid 800 points and the Nifty broke key technical levels amid renewed US tariff concerns. Analysts advise caution, citing geopolitical risks and weak momentum, even as long-term fundamentals remain supportive.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-800-points-and-nifty-sees-a-decisive-breakdown-can-investors-ignore-trump-to-buy-the-dip/articleshow/126413655.cms",
    "timestamp": "2026-01-08T11:20:11Z"
  },
  {
    "title": "Trump team to pitch White House ballroom project to oversight body led by one of his aides",
    "description": "Gold may hit $5,000/oz in 1H’26 - HSBC\nBy Jeff Mason\nWASHINGTON, Jan 8 (Reuters) - The White House will make its case on Thursday for a new $400 million ballroom before a commission that oversees federal building construction in Washington and is led by one o…",
    "link": "https://biztoc.com/x/10b93e4400afb2c4",
    "timestamp": "2026-01-08T11:20:02Z"
  },
  {
    "title": "Explainer-Can the ICE agent who shot a Minneapolis woman be prosecuted?",
    "description": "NEW YORK, Jan ‌8 (Reuters) - A U.S. Immigration and Customs Enforcement agent shot and killed a 37-year-old woman in her car in Minneapolis ‌on Wednesday amid President Donald Trump's federal crackdown. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/08/explainer-can-the-ice-agent-who-shot-a-minneapolis-woman-be-prosecuted",
    "timestamp": "2026-01-08T11:20:00Z"
  },
  {
    "title": "'It's good to scare people sometimes': Anduril founder Palmer Luckey says he 'broadly' backs Trump's new defense regulations",
    "description": "\"I'd say I'm broadly aligned,\" Anduril founder Palmer Luckey said in an interview on Wednesday, adding that some of Trump's plans might be \"bad moves.\"",
    "link": "https://www.businessinsider.com/anduril-founder-palmer-luckey-trump-defense-regulations-2026-1",
    "timestamp": "2026-01-08T11:19:54Z"
  },
  {
    "title": "Trump's Approval Rating on Economy Drops With Key Voter Group",
    "description": "President Donald Trump's approval rating on economic issues has dropped among independent voters, according to recent polling.\nNewsweek contacted the White House for comment via email outside regular business hours.\nWhy It Matters\nThis trend signals potential…",
    "link": "https://biztoc.com/x/114a1c34cab8245f",
    "timestamp": "2026-01-08T11:19:51Z"
  },
  {
    "title": "Donald Trump Is 'Hero of the World,' Says Bondi Beach's Ahmed al Ahmed",
    "description": "Ahmed al Ahmed, the man who disarmed one of the attackers at Bondi Beach as they fired at a crowd of Jewish people celebrating the Hanukkah holiday, called U.S. President Donald Trump a \"hero of the world\" as he arrived in the U.S. for treatment of his injuri…",
    "link": "https://biztoc.com/x/426ace307565d87d",
    "timestamp": "2026-01-08T11:19:31Z"
  },
  {
    "title": "Multiple Episodes Censored and Banned on Disney+, Missing for Every User",
    "description": "In the streaming era, content is king. But at Disney+, some titles have been quietly banished from the kingdom. Episodes of various TV series, both old and new, have either disappeared from the platform or never been uploaded in the first place, leaving a tra…",
    "link": "https://insidethemagic.net/2026/01/multiple-episodes-censored-missing-for-every-single-disney-user-cj1/",
    "timestamp": "2026-01-08T11:15:41Z"
  },
  {
    "title": "US To Leave Global Forum on Cyber Expertise",
    "description": "The Trump administration decided to leave 66 international organizations, including the GFCE and the European Centre of Excellence for Countering Hybrid Threats",
    "link": "https://www.infosecurity-magazine.com/news/us-leave-global-forum-on-cyber/",
    "timestamp": "2026-01-08T11:15:00Z"
  },
  {
    "title": "Venezuela’s economy will be a mess for whoever runs it next | CNN Business",
    "description": "Venezuela’s economy will be a mess for whoever runs it next | CNN Businesscnn.com",
    "link": "https://www.cnn.com/2026/01/08/business/venezuela-economic-problems-beyond-oil",
    "timestamp": "2026-01-08T11:14:58Z"
  },
  {
    "title": "Danish troops told to 'shoot first, ask questions later' if US invades Greenland",
    "description": "The European nation's rules of engagement requires soldiers to “immediately” counter-attack invading forces without awaiting orders",
    "link": "https://www.lbc.co.uk/article/danish-troops-shoot-first-us-greenland-5HjdQNW_2/",
    "timestamp": "2026-01-08T11:11:34Z"
  },
  {
    "title": "We fought hard for this Colorado water project. Congress needs to override Trump’s veto",
    "description": "In the first veto of his second term, President Donald Trump chose to halt a bipartisan 130-mile water infrastructure project 60 years in the making. With one stroke of a pen, he denied clean drinking water to 50,000 Americans in rural southeast Colorado.\nThi…",
    "link": "https://biztoc.com/x/a889cdc85b96cdd2",
    "timestamp": "2026-01-08T11:08:31Z"
  },
  {
    "title": "RTX Corp, Lockheed, L3Harris, Other Defense Stocks Climb In Thursday Pre-Market: What's Going On?",
    "description": "Shares of U.S. defense stocks rose in trading before the bell on Thursday, after President Donald Trump called for raising government defense spending. \nNorthrop Grumman Corp. (NYSE:NOC) led the rally with a 7.82% jump, while Lockheed Martin Corp. (NYSE:LMT) …",
    "link": "https://biztoc.com/x/b23f53a1b580b1c1",
    "timestamp": "2026-01-08T11:08:24Z"
  },
  {
    "title": "Donald Trump Gets Warning Sign on Economy From US Voters",
    "description": "According to a new survey, Americans' confidence in the country's fiscal health has declined over the past 12 months.",
    "link": "https://biztoc.com/x/fde65d0045edf984",
    "timestamp": "2026-01-08T11:08:24Z"
  },
  {
    "title": "Trump’s Venezuela strike wasn’t only about oil",
    "description": "President Donald Trump has long expressed interest in seizing Venezuelan oil, and after his Saturday military operation detaining Venezuelan President Nicolás Maduro, he promised to fulfill that wish and make way for U.S. companies to extract vast amounts of …",
    "link": "https://biztoc.com/x/6274073c953ac677",
    "timestamp": "2026-01-08T11:08:10Z"
  },
  {
    "title": "Thousands protest in US after immigration official shoots woman",
    "description": "A US immigration officer shoots a woman in Minneapolis, leading to her death and sparking thousands to protest against ICE and the Trump administration.\n\nRead More: https://punchng.com/thousands-protest-in-us-after-immigration-official-shoots-woman/",
    "link": "https://punchng.com/thousands-protest-in-us-after-immigration-official-shoots-woman/",
    "timestamp": "2026-01-08T11:06:21Z"
  },
  {
    "title": "Trump says US role in Venezuela could last for years",
    "description": "Venezuela’s interior minister says US operation to abduct Maduro killed 100 people and wounded dozens.",
    "link": "https://www.aljazeera.com/news/2026/1/8/trump-says-us-could-run-venezuela-for-years-report",
    "timestamp": "2026-01-08T11:05:37Z"
  }
]