[
  {
    "title": "Pete Hegseth Doesn’t Want to Talk About Golden Dome",
    "description": "National missile defense is still impossible—and expensive.",
    "link": "https://www.theatlantic.com/national-security/archive/2025/08/trump-reagan-golden-dome-missile-defense/683799/",
    "timestamp": "2025-08-08T14:57:26Z"
  },
  {
    "title": "Vance And Lammy Talk Gaza, Fish As US VP Starts UK Holiday",
    "description": "British foreign minister David Lammy and JD Vance talked Gaza during a meeting on Friday as the US vice president kicked off his holiday in the United Kingdom.",
    "link": "https://www.ibtimes.com/vance-lammy-talk-gaza-fish-us-vp-starts-uk-holiday-3780533",
    "timestamp": "2025-08-08T14:57:17Z"
  },
  {
    "title": "Trump may engage military in fighting drug cartels",
    "description": "United States President Donald Trump signed an order directing the US military to engage in the fight against some Latin American drug cartels, the New York Times reported on Friday, citing people bri...",
    "link": "https://biztoc.com/x/db4fa5c4c42343ca",
    "timestamp": "2025-08-08T14:57:02Z"
  },
  {
    "title": "Trump Cracks Down On DC Crime With New Policing Push",
    "description": "President Donald Trump has ordered a surge of federal law enforcement personnel into Washington, DC, beginning Thursday night. The effort, led by the U.S. Park Police and supported by multiple agencies including the FBI, DEA, U.S. Marshals, and Capitol Police…",
    "link": "https://biztoc.com/x/da593ba031c9bd35",
    "timestamp": "2025-08-08T14:57:01Z"
  },
  {
    "title": "Oil prices are projected to continue sliding. Here’s why",
    "description": "Oil prices edged higher on Friday but were poised for the steepest weekly losses since late June on a tariff-hit economic outlook and a potential meeting between U.S. President Donald Trump and Russian counterpart Vladimir Putin.\nBrent crude futures were up 5…",
    "link": "https://biztoc.com/x/891f75c9ea9bd878",
    "timestamp": "2025-08-08T14:56:51Z"
  },
  {
    "title": "‘A death sentence to all hostages’: Israel plan to take control of Gaza City met with dismay",
    "description": "US strikes note of solidarity with Israel, with ambassador pointing to Hamas as blockade to peace",
    "link": "https://www.irishtimes.com/world/middle-east/2025/08/08/a-death-sentence-to-all-hostages-israel-plan-to-take-control-of-gaza-city-met-with-dismay/",
    "timestamp": "2025-08-08T14:56:38Z"
  },
  {
    "title": "Elon Musk Is The Most Disliked Figure In America: Survey",
    "description": "Musk has dropped a massive 24 points since his peak just a few months ago, a feat only matched by Rubio.",
    "link": "https://www.jalopnik.com/1934574/elon-musk-most-dislked-america/",
    "timestamp": "2025-08-08T14:56:35Z"
  },
  {
    "title": "The Senate’s Gone for August: Here’s What They Left Behind",
    "description": "The Constitution gives the president the power to nominate and, with the Senate’s “advice and consent,” to appoint men and women to approximately 2,000 positions... Read More\nThe post The Senate’s Gone for August: Here’s What They Left Behind appeared first o…",
    "link": "https://www.dailysignal.com/2025/08/08/senates-gone-august-heres-what-they-left-behind/",
    "timestamp": "2025-08-08T14:56:15Z"
  },
  {
    "title": "Tariffs Are Starting to Squeeze Profits for Trump-Loving Farmers",
    "description": "President Donald Trump has repeatedly said he loves farmers. His actions, though, are rippling across the agriculture industry as tariffs raise the cost of everything from tractors to fertilizers and squeeze profits for US growers already contending with low …",
    "link": "https://financialpost.com/pmn/business-pmn/tariffs-are-starting-to-squeeze-profits-for-trump-loving-farmers",
    "timestamp": "2025-08-08T14:56:15Z"
  },
  {
    "title": "Trump 'secretly' signs order deploying military against cartels: NYT's Maggie Haberman",
    "description": "President Donald Trump said during his 2024 campaign that he wanted to bomb the drug cartels in Mexico, which he links to the high rate of opioid addiction in the U.S. Now, he has secretly moved to deploy soldiers to begin an all-out war with the cartels. The…",
    "link": "https://www.rawstory.com/trump-cartel-war-secret-order/",
    "timestamp": "2025-08-08T14:55:47Z"
  },
  {
    "title": "Treasury Chief Scott Bessent admits: Americans, not foreigners, are paying Trump’s tariffs",
    "description": "Scott Bessent Trump tariff statement: New retaliatory tariffs imposed by Donald Trump have taken effect, impacting numerous countries. However, Treasury Secretary Scott Bessent indirectly confirmed that American importers bear the cost, ultimately affecting c…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-tariffs-news-treasury-chief-scott-bessent-admits-americans-not-foreigners-are-paying-trumps-tariffs/articleshow/123190554.cms",
    "timestamp": "2025-08-08T14:55:32Z"
  },
  {
    "title": "Imposition of additional trade tariffs on India an issue of ‘national security’, says White House trade adviser",
    "description": "White House trade adviser Peter Navarro discusses national security implications of India's refusal to stop buying Russian oil.",
    "link": "https://www.thehindubusinessline.com/economy/imposition-of-additional-trade-tariffs-on-india-an-issue-of-national-security-says-white-house-trade-adviser/article69910445.ece",
    "timestamp": "2025-08-08T14:54:56Z"
  },
  {
    "title": "Justice Department Opens Criminal Investigation Into New York Attorney General Letitia James",
    "description": "New York Attorney General Letitia James is now under criminal investigation over her targeting of both President Donald Trump and another instance, Breitbart News has learned. Two sources briefed on the matter told Breitbart News that subpoenas have been sent…",
    "link": "https://www.breitbart.com/politics/2025/08/08/justice-department-opens-criminal-investigation-into-new-york-attorney-general-letitia-james/",
    "timestamp": "2025-08-08T14:54:52Z"
  },
  {
    "title": "Cutting federal funds for mRNA vaccine leaves the US vulnerable, experts say | CNN",
    "description": "This week, President Donald Trump called Operation Warp Speed, a public-private federal program that helped speed up the development and distribution of mRNA Covid-19 vaccines in record time “one of the most incredible things ever done in this country.” It wa…",
    "link": "https://www.cnn.com/2025/08/08/health/mrna-vaccines-pandemic-preparedness",
    "timestamp": "2025-08-08T14:54:28Z"
  },
  {
    "title": "Fox News Has Gone Quiet on the Economy. That’s Very Bad News For Your Wallet.",
    "description": "Fox News has sharply cut coverage of inflation and economy despite persistent price pressures. This media silence risks leaving Americans in the dark.\nThe post Fox News Has Gone Quiet on the Economy. That’s Very Bad News For Your Wallet. first appeared on Med…",
    "link": "https://www.mediaite.com/opinion/fox-news-has-gone-quiet-on-the-economy-thats-very-bad-news-for-your-wallet/",
    "timestamp": "2025-08-08T14:53:58Z"
  },
  {
    "title": "Kristi Noem Slams South Park as 'Lazy, Petty' After ICE Takedown - Variety",
    "description": "Kristi Noem Slams South Park as 'Lazy, Petty' After ICE TakedownVariety Noem on ‘South Park’ portrayal: ‘So lazy’The Hill Kristi Noem Rips ‘South Park’ Portrayal As ‘Lazy’ And ‘Petty’Forbes ‘South Park’ Finds New Relevance Skewering the Trump EraThe New York …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178614774",
    "timestamp": "2025-08-08T14:52:50Z"
  },
  {
    "title": "Trump Tariffs: Rajnath’s US visit in abeyance; slowdown in defence deal negotiations with the US",
    "description": "Defence Minister Rajnath Singh's US visit delayed amid tariff threats, pricing issues, and strain in bilateral relations.",
    "link": "https://www.thehindubusinessline.com/news/national/trump-tariffs-rajnaths-us-visit-in-abeyance-slowdown-in-defence-deal-negotiations-with-the-us/article69910120.ece",
    "timestamp": "2025-08-08T14:52:09Z"
  },
  {
    "title": "US-Russia Peace Deal Proposed, Huge Win for Putin: Report",
    "description": "Proposed peace deal would lock in Russia's gains in Ukraine, handing Putin a huge win, reports stated.",
    "link": "https://www.newsweek.com/russia-us-peace-deal-ukraine-vladimir-putin-trump-2110865",
    "timestamp": "2025-08-08T14:51:33Z"
  },
  {
    "title": "Putin Taps Key Allies Ahead Of Trump Summit, Sanctions Deadline",
    "description": "Russian President Vladimir Putin on Friday held consultations with the leaders of China and India, seeking support from his key allies ahead of a likely summit with Donald Trump.",
    "link": "https://www.ibtimes.com/putin-taps-key-allies-ahead-trump-summit-sanctions-deadline-3780531",
    "timestamp": "2025-08-08T14:51:22Z"
  },
  {
    "title": "Federal appeals court halts criminal contempt proceedings against Trump officials in immigration case | CNN Politics",
    "description": "A divided federal appeals court ruled on Friday that US District Court Judge James Boasberg cannot move ahead with criminal contempt proceedings against Trump administration officials involved in a high-stakes immigration case.",
    "link": "https://www.cnn.com/2025/08/08/politics/boasberg-criminal-contempt-trump-immigration",
    "timestamp": "2025-08-08T14:51:07Z"
  },
  {
    "title": "Trump Shouted Down Netanyahu for Trying to Convince Him Gaza Starvation Is Fake",
    "description": "Trump began “yelling” at Netanyahu during a phone call as the president angrily rejected the foreign leader’s claims that reports of Gaza starvation were lies.\nThe post Trump Shouted Down Netanyahu for Trying to Convince Him Gaza Starvation Is Fake first appe…",
    "link": "https://www.mediaite.com/media/news/trump-shouted-down-netanyahu-for-trying-to-convince-him-gaza-starvation-is-fake/",
    "timestamp": "2025-08-08T14:50:56Z"
  },
  {
    "title": "WNBA Dildo Throwing Controversy Began as Crypto Marketing Stunt",
    "description": "Green Dildo Coin backers say dildo-throwing stunts at WNBA games are part of a “funny” coordinated marketing campaign to pump their coin.",
    "link": "https://decrypt.co/334280/wnba-dildo-throwing-crypto-marketing-stunt",
    "timestamp": "2025-08-08T14:49:31Z"
  },
  {
    "title": "DOJ opens investigation into New York AG's office that brought fraud case against Trump",
    "description": "Federal prosecutors are in the early stages of an investigation into the office of New York Attorney General Letitia James, who brought a civil fraud case against President Donald Trump.",
    "link": "https://www.nbcnews.com/politics/justice-department/doj-opens-investigation-new-york-ags-office-brought-fraud-case-trump-rcna223731",
    "timestamp": "2025-08-08T14:49:15Z"
  },
  {
    "title": "How Donald Trump is transforming the white house with gold, flagpoles, and a $200 million ballroom",
    "description": "Donald Trump is leaving his indelible mark on the White House during his second term, overseeing significant renovations. These include towering flagpoles, a stone-paved Rose Garden reminiscent of Mar-a-Lago, and ambitious plans for a massive 90,000-square-fo…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/how-donald-trump-is-transforming-the-white-house-with-gold-flagpoles-and-a-200-million-ballroom/articleshow/123190653.cms",
    "timestamp": "2025-08-08T14:48:04Z"
  },
  {
    "title": "U.S capital on high alert: Why is Donald Trump deploying troops on a war footing in Washington, DC?",
    "description": "Donald Trump has repeatedly suggested that the rule of Washington could be returned to federal authorities. Doing so would require a repeal of the Home Rule Act of 1973 in Congress, a step Trump said lawyers are examining — but could face steep pushback.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-capital-on-high-alert-why-is-donald-trump-deploying-troops-on-a-war-footing-in-washington-dc/articleshow/123191084.cms",
    "timestamp": "2025-08-08T14:45:04Z"
  },
  {
    "title": "New lawsuit on Epstein case seeks records of Trump administration communications",
    "description": "An organization challenging President Donald Trump's administration on multiple fronts is suing the Justice Department and the FBI for records detailing their handling of the Jeffrey Epstein sex trafficking investigation.",
    "link": "https://apnews.com/article/epstein-files-trump-justice-department-lawsuit-77748e5801d9278ecead678bd0852d46",
    "timestamp": "2025-08-08T14:45:00Z"
  },
  {
    "title": "DOJ opens grand jury investigation into Letitia James tied to Trump civil case",
    "description": "The DOJ opened a grand jury investigation in New York into state Attorney General Letitia James tied to her lawsuit against President Donald Trump.",
    "link": "https://www.foxnews.com/politics/doj-opens-grand-jury-investigation-letitia-james-tied-trump-civil-case",
    "timestamp": "2025-08-08T14:44:50Z"
  },
  {
    "title": "Trump Is Putting Confederate Statues Back Up. Here’s Why They Must Fall Again.",
    "description": "Monuments to racism license racist violence. White supremacists, for their part, know this well.\nThe post Trump Is Putting Confederate Statues Back Up. Here’s Why They Must Fall Again. appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/08/08/trump-confederate-statues/",
    "timestamp": "2025-08-08T14:42:56Z"
  },
  {
    "title": "Anti-DEI activist Robby Starbuck settles lawsuit over Meta on AI chatbot defamation",
    "description": "Starbuck filed suit in Delaware Superior Court against Meta in April after its chatbot allegedly falsely accused him of being a \"White nationalist\" who was arrested on Jan. 6 and claimed he had been sued for defamation.",
    "link": "https://www.foxbusiness.com/media/robby-starbuck-meta-settle-lawsuit-after-ai-chatbot-defamed-him",
    "timestamp": "2025-08-08T14:42:40Z"
  },
  {
    "title": "GOP Senator Bill Cassidy, Who Was Key Vote to Confirm RFK Jr., Blasts Health Honcho for Massive Cuts to Vaccine Funding",
    "description": "Sen. Bill Cassidy (R-LA) criticized Health and Human Services (HHS) Secretary Robert F. Kennedy’s decision to cut vaccine funding months after being a key",
    "link": "https://www.newsbreak.com/share/4161769551554-gop-senator-bill-cassidy-who-was-key-vote-to-confirm-rfk-jr-blasts-health-honcho-for-massive-cuts-to-vaccine-funding?s=a1&amp;share_destination_id=MjUxNTg0MjIwLTE3NTQ2NjM4MTg2Mjc%3D&amp;pd=0H1cY0ct&amp;hl=en_US&amp;send_time=1754663818&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q3-v4%2Cns_foryou_rank_exp_25q3-v1%2Cns_foryou_model_exp_25q3-v4%2Cns_foryou_recall_exp_25q3-v2",
    "timestamp": "2025-08-08T14:39:24Z"
  },
  {
    "title": "US has ‘no plans’ to recognize Palestinian state, Vance says before talks with UK foreign secretary",
    "description": "JD Vance met with U.K. Foreign Secretary David Lammy on Friday.",
    "link": "https://www.bostonherald.com/2025/08/08/britain-vp-vance-visit/",
    "timestamp": "2025-08-08T14:38:45Z"
  },
  {
    "title": "US And Russia Plan Truce Deal To Cement Putin's Gains In Ukraine",
    "description": "Washington and Moscow are aiming to reach a deal to halt the war in Ukraine that would lock in Russia’s occupation of territory seized during its military invasion, according to people familiar with the matter.",
    "link": "https://www.ndtvprofit.com/world/us-and-russia-plan-truce-deal-to-cement-putins-gains-in-ukraine",
    "timestamp": "2025-08-08T14:37:34Z"
  },
  {
    "title": "Nonprofit Refuses $1.5M Science Grant Due To New Federal DEI Rules",
    "description": "A coding nonprofit turned down a $1.5M NSF grant after new DEI restrictions, highlighting the clash between federal policy and scientific community values.",
    "link": "https://www.forbes.com/sites/johndrake/2025/08/08/nonprofit-refuses-15m-science-grant-due-to-new-federal-dei-rules/",
    "timestamp": "2025-08-08T14:36:25Z"
  },
  {
    "title": "Dollar heads for weekly loss on dovish Fed expectations",
    "description": "NEW YORK :The dollar firmed on Friday but was heading for a weekly fall as weakening economic data leads traders to price in the probability of more interest rate cuts this year, and as investors evaluate U.S. President Donald Trump’s nominations to the Feder…",
    "link": "https://www.channelnewsasia.com/business/dollar-heads-weekly-loss-dovish-fed-expectations-5284261",
    "timestamp": "2025-08-08T14:35:25Z"
  },
  {
    "title": "Minerva Foods flags potential $300m-plus revenue impact from US tariffs",
    "description": "Minerva Foods, one of Brazil’s largest meat processors, has quantified the potential impact on revenue from President Donald Trump’s tariffs.\nTrump exercised his pledge made in July on Wednesday (6 August) to raise import tariffs on Brazilian goods to 50% fro…",
    "link": "https://biztoc.com/x/4c4e1bf51847eb99",
    "timestamp": "2025-08-08T14:34:36Z"
  },
  {
    "title": "Former Washington Post Fact-Checker Glenn Kessler Falls All Over Himself Claiming Outlet Isn’t Biased",
    "description": "Former Washington Post editor Glenn Kessler struggled to defend his position that his former outlet wasn't biased toward conservatives.",
    "link": "https://dailycaller.com/2025/08/08/former-washington-post-fact-checker-glenn-kessler-falls-all-over-himself-claiming-outlet-isnt-biased/",
    "timestamp": "2025-08-08T14:33:47Z"
  },
  {
    "title": "Why the stock market shrugged off weak data, recession fears - ABC News",
    "description": "Why the stock market shrugged off weak data, recession fearsABC News Trump’s Oval Office ‘session’ on the economy? Charts about Biden.The Washington Post What if You Can’t Believe the Official Numbers?The New York Times Trump Just Did What Not Even Nixon Dare…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178614638",
    "timestamp": "2025-08-08T14:32:46Z"
  },
  {
    "title": "A quick guide to past meetings between Putin and U.S. presidents",
    "description": "Bilateral meetings between Russian President Vladimir Putin and his U.S. counterparts were a regular occurrence early in his tenure.",
    "link": "https://www.pbs.org/newshour/politics/a-quick-guide-to-past-meetings-between-putin-and-u-s-presidents",
    "timestamp": "2025-08-08T14:32:16Z"
  },
  {
    "title": "Greg Abbott Is Looking Desperate to Pressure Texas Democrats",
    "description": "In interviews, Texas governor Greg Abbott vowed to keep the redistricting fight going for years and threatened to gerrymander the map even further if Democrats don’t return.",
    "link": "http://nymag.com/intelligencer/article/greg-abbott-is-looking-desperate-to-pressure-texas-democrats.html",
    "timestamp": "2025-08-08T14:31:06Z"
  },
  {
    "title": "Stocks rise on Wall Street and hold on to weekly gains",
    "description": "Stocks are rising on Wall Street, keeping the market on track for its third weekly gain in the last four.",
    "link": "https://www.bostonherald.com/2025/08/08/stock-market-steady-after-tariffs/",
    "timestamp": "2025-08-08T14:30:23Z"
  },
  {
    "title": "Crude’s Disconnect – What It Means and How to Trade It",
    "description": "This past week, energy markets behaved in what many people view as an unusual manner. As crude oil futures exhibited one of the largest weekly declines in a while, natural gas held steady and even rallied around the middle of the week. To add even more confus…",
    "link": "https://oilprice.com/Energy/Energy-General/Crudes-Disconnect-What-It-Means-and-How-to-Trade-It.html",
    "timestamp": "2025-08-08T14:30:00Z"
  },
  {
    "title": "Mirroring US Shale, Saudi Arabia Slows Down Oil Drilling",
    "description": "Numbers Report – August 08, 2025 In the latest edition of the Numbers Report, we will take a look at some of the most interesting figures put out this week in the energy and metals sectors. Each week we’ll dig into some data and provide a bit of explanation o…",
    "link": "https://oilprice.com/Energy/Energy-General/Mirroring-US-Shale-Saudi-Arabia-Slows-Down-Oil-Drilling.html",
    "timestamp": "2025-08-08T14:30:00Z"
  },
  {
    "title": "Asean News Headlines at 10pm on Friday (Aug 8, 2025)",
    "description": "Here's a look at the news highlights from Asean countries in the Star-AseanPlus section for Friday (Aug 8, 2025). Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/08/08/asean-news-headlines-at-10pm-on-friday-aug-8-2025",
    "timestamp": "2025-08-08T14:29:00Z"
  },
  {
    "title": "Trump Orders Increased Federal Law Enforcement in DC",
    "description": "President Donald Trump ordered police to increase their presence in the District of Columbia after an attack on a Department of Government Efficiency staffer. “President... Read More\nThe post Trump Orders Increased Federal Law Enforcement in DC appeared first…",
    "link": "https://www.dailysignal.com/2025/08/08/trump-orders-increased-federal-law-enforcement-in-dc/",
    "timestamp": "2025-08-08T14:28:48Z"
  },
  {
    "title": "Candace Owens Melts Down Over Trump’s ‘Silence’ on Macron ‘Penis’ Lawsuit",
    "description": "Candace Owens sounded off on President Donald Trump and his administration for not defending her amidst her legal battle with the Macrons.\nThe post Candace Owens Melts Down Over Trump’s ‘Silence’ on Macron ‘Penis’ Lawsuit first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/candace-owens-melts-down-over-trumps-silence-on-macron-penis-lawsuit/",
    "timestamp": "2025-08-08T14:27:03Z"
  },
  {
    "title": "Trump Secretly Approved Using Military Force Against Cartels, Report Claims",
    "description": "Donald Trump secretly approved the use of military force on certain Latin American cartels, according to a new report",
    "link": "https://www.ibtimes.com/trump-secretly-approved-using-military-force-against-cartels-report-claims-3780526",
    "timestamp": "2025-08-08T14:24:34Z"
  },
  {
    "title": "The dam is breaking on Britain’s illegal immigration crisis — and the results could be ugly",
    "description": "Britain’s Labour government is in trouble: Its program of massive third-world immigration from places like Pakistan and Somalia is wildly, overwhelmingly unpopular. But that’s not the real problem. The real problem is that despite the best efforts of Prime Mi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4333424/posts",
    "timestamp": "2025-08-08T14:23:28Z"
  },
  {
    "title": "US targets new country, stops visas, escalating Trump travel ban",
    "description": "At the start of June, President Donald Trump reintroduced a travel ban that was repealed after he finished his first term in the White House.\nWith the administration singling out certain nations as posing \"a very high risk to the United States,\" citizens of I…",
    "link": "https://biztoc.com/x/f6caa1e2d3d7616f",
    "timestamp": "2025-08-08T14:23:26Z"
  },
  {
    "title": "U.S. Secures Strategic Transit Route In Armenia-Azerbaijan Deal",
    "description": "President Donald Trump is set to host the leaders of Armenia and Azerbaijan at the White House on Friday to finalize a landmark peace deal. The agreement includes a strategic infrastructure corridor through Armenia, granting the United States exclusive develo…",
    "link": "https://biztoc.com/x/2b7e23c62fa3f9b6",
    "timestamp": "2025-08-08T14:23:15Z"
  },
  {
    "title": "Roman Storm conviction for Tornado Cash sets ‘dangerous precedent’",
    "description": "Tornado Cash co-founder Roman Storm’s conviction could criminalize open-source software developers and threaten US tech leadership, Blockchain Association warns.",
    "link": "https://cointelegraph.com/news/roman-storm-conviction-tornado-cash-sets-dangerous-precedent",
    "timestamp": "2025-08-08T14:22:31Z"
  },
  {
    "title": "Greg Gutfeld Tells Story About Being ‘Wasted’ And ‘Wrestling’ Jimmy Fallon In ‘Tonight Show’ Appearance",
    "description": "Fox News host Greg Gutfeld received praise from NBC News' Jimmy Fallon and his audience during his unlikely appearance on \"The Tonight Show.\"",
    "link": "https://dailycaller.com/2025/08/08/greg-gutfeld-jimmy-fallon-softball-tv-appearance/",
    "timestamp": "2025-08-08T14:22:04Z"
  },
  {
    "title": "Saks Completes $600M Financing Early, 98% of Debt Holders Sign on to Exchange",
    "description": "While the company looks forward to focusing on integrating Neiman Marcus, the controversial exchange might prompt S&P to declare a technical default.",
    "link": "https://wwd.com/business-news/financial/saks-600m-financing-debt-exchange-bond-1238032208/",
    "timestamp": "2025-08-08T14:21:46Z"
  },
  {
    "title": "Saks Completes $600M Financing Early, 98% of Debt Holders Sign on to Exchange",
    "description": "While the company looks forward to focusing on integrating Neiman Marcus, the controversial exchange might prompt S&P to declare a technical default.",
    "link": "http://wwd.com/business-news/financial/saks-600m-financing-debt-exchange-bond-1238032208/",
    "timestamp": "2025-08-08T14:21:46Z"
  },
  {
    "title": "Trump's 50% India Tariff, RBI's Repo Rate Unchanged, ED Heat On Anil Ambani - The Week That Was",
    "description": "India-US trade tensions took centre stage this week as President Donald Trump raised the heat by imposing a unilateral 50% tariff on Indian exports. The Reserve Bank of India kept its benchmark interest rate and monetary policy stance unchanged, besides proje…",
    "link": "https://www.ndtvprofit.com/business/trumps-50-india-tariff-rbis-repo-rate-unchanged-ed-heat-on-anil-ambani-the-week-that-was",
    "timestamp": "2025-08-08T14:21:31Z"
  },
  {
    "title": "A Fight Is Brewing in the Midwest Over Immigrant Mass Detention",
    "description": "As ICE expands its presence across the Midwest, activists fight the reopening of private prisons to jail migrants.",
    "link": "https://truthout.org/articles/a-fight-is-brewing-in-the-midwest-over-immigrant-mass-detention/",
    "timestamp": "2025-08-08T14:21:25Z"
  },
  {
    "title": "Gold Prices Hit An All-Time High As Trump’s ‘Surprise’ Tariffs Roil Market—Here’s What To Know",
    "description": "One analyst said the Trump administration tacking on new tariffs was “precisely what the market feared.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/08/08/gold-prices-hit-an-all-time-high-as-trumps-surprise-tariffs-roil-market-heres-what-to-know/",
    "timestamp": "2025-08-08T14:21:18Z"
  },
  {
    "title": "Carney Is Patching Up Ties With Mexico in Face of Trump Threats",
    "description": "Canada is working to reset its ties with Mexico as Donald Trump threatens his neighbors with punishing US tariffs ahead of a planned review of the North American free-trade pact.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-is-patching-up-ties-with-mexico-in-face-of-trump-threats",
    "timestamp": "2025-08-08T14:20:42Z"
  },
  {
    "title": "Intel CEO Tan Addresses US Gov't Allegations, Promising To Address Misinformation",
    "description": "You probably didn't have U.S. President Donald Trump calling for the immediate resignation of Intel CEO Lip-Bu Tan on your 2025 Bingo card, but here we are. Trump's demand sparked a wave of headlines and also resulted in a drop in Intel's share price. By the …",
    "link": "https://hothardware.com/news/intel-ceo-tan-addresses-us-govt-allegations",
    "timestamp": "2025-08-08T14:20:00Z"
  },
  {
    "title": "Reuters report on Indian pause of US defense purchases ‘incorrect’ – RT sources",
    "description": "Reuters had reported that India suspended plans to buy P-8I aircraft, Stryker vehicles, and Javelin missiles Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622666-reuters-report-on-indian-pause/",
    "timestamp": "2025-08-08T14:19:56Z"
  },
  {
    "title": "Minerva Foods flags potential $300m-plus revenue impact from US tariffs",
    "description": "President Donald Trump make good on a pledge to raise import levies on Brazil to 50% this week.",
    "link": "https://www.just-food.com/news/minerva-foods-flags-potential-300m-plus-revenue-impact-from-us-tariffs/",
    "timestamp": "2025-08-08T14:19:02Z"
  },
  {
    "title": "Azerbaijan and Armenia to sign peace agreement: White House",
    "description": "WASHINGTON: Azerbaijan and Armenia will sign an initial peace agreement on Friday (Aug 8) to boost economic ties between the two countries after decades of conflict, the White House said, with President Donald Trump set to welcome the leaders of both nations …",
    "link": "https://www.channelnewsasia.com/world/azerbaijan-armenia-us-peace-agreement-strategic-transit-corridor-5285246",
    "timestamp": "2025-08-08T14:17:39Z"
  },
  {
    "title": "ICE Responds After Arresting “Trump Burger” Co-Owner",
    "description": "The Department of Homeland Security is doubling down on the arrest of the man behind the infamous Donald Trump-themed burger restaurant, who now faces deportation, Chron reported Thursday.Roland Mehrez Beainy, a 28-year-old Lebanese immigrant, opened the orig…",
    "link": "https://newrepublic.com/post/198928/ice-arrests-trump-burger-owner",
    "timestamp": "2025-08-08T14:16:55Z"
  },
  {
    "title": "Leaked Drafts Show Trump Administration Scrubbing Out Human Rights Violations of Favored Nations",
    "description": "U.S. President Donald Trump's administration earned condemnation from Amnesty International on Thursday over its leaked plans to downplay human rights violations in countries favored by the American government.News of the plan was originally reported on Wedne…",
    "link": "https://www.commondreams.org/news/trump-administration-human-rights-reports",
    "timestamp": "2025-08-08T14:16:18Z"
  },
  {
    "title": "Trump Moves To Keep Leftists From Pilfering Tax Dollars For Radical Agendas",
    "description": "Trump signed an executive order on Thursday requiring his appointees to review federal grants and prevent \"offensive waste of tax dollars.\"",
    "link": "https://dailycaller.com/2025/08/08/trump-move-liberals-left-pilfering-tax-dollars-radical-agendas/",
    "timestamp": "2025-08-08T14:16:02Z"
  },
  {
    "title": "Zambia concerned by 'financial strain' of new US visa bond",
    "description": "LUSAKA (Reuters) -Zambia's government said on Friday it was concerned about the \"unnecessary financial strain\" that would be caused by a new rule requiring...",
    "link": "https://www.yahoo.com/news/articles/zambia-concerned-financial-strain-us-141522677.html",
    "timestamp": "2025-08-08T14:15:22Z"
  },
  {
    "title": "Trump is underwater on trade in 40 states (G. Elliott Morris/Strength In Numbers)",
    "description": "G. Elliott Morris / Strength In Numbers:\nTrump is underwater on trade in 40 states  —  According to analysis of issue approval data in Strength In Numbers/Verasight polls  —  This week, Donald Trump put in place a fresh set of tariffs on imports from nearly 7…",
    "link": "https://www.memeorandum.com/250808/p45",
    "timestamp": "2025-08-08T14:15:00Z"
  },
  {
    "title": "Putin and Xi discuss Ukraine ahead of expected Russia-US summit",
    "description": "The Russian president has briefed his Chinese counterpart on talks with US envoy Steve Witkoff Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622662-putin-xi-phone-call/",
    "timestamp": "2025-08-08T14:13:41Z"
  },
  {
    "title": "Donald Trump Jr posts meme showing his father throwing sex toy onto WNBA court",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_ae2eb1e2-66b1-4829-b0b5-cd0dd39e10ad",
    "timestamp": "2025-08-08T14:13:18Z"
  },
  {
    "title": "Donald Trump Jr posts meme showing his father throwing sex toy onto WNBA court",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_613e5362-ee8e-4fc9-926e-eb2b7de548f9",
    "timestamp": "2025-08-08T14:13:18Z"
  },
  {
    "title": "CNN’s Donie O’Sullivan Confronts Anti-Trump Bomb-Thrower Destiny Over Explosive Post",
    "description": "Donie O’Sullivan confronted popular anti-Trump streamer Destiny over an explosive social media post, asking if he \"regrets\" sending it.\nThe post CNN’s Donie O’Sullivan Confronts Anti-Trump Bomb-Thrower Destiny Over Explosive Post first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/cnns-donie-osullivan-confronts-anti-trump-bomb-thrower-destiny-over-explosive-post/",
    "timestamp": "2025-08-08T14:12:29Z"
  },
  {
    "title": "RFK Jr. Outlines Commitment to Native American Food Sovereignty; Shares Insights on Opioid Recovery and Whether or Not He would Ban Hot Cheetos on the Rez",
    "description": "NiMiiPuu&nbsp;culture&nbsp;and existence are at the foundation of the Nez Perce Tribal Hatchery. It’s why the tribal management plan implements Nez Perce traditional language, Nimiipúu timpt, into the restoration work that produces 1.4 million Chinook salmon …",
    "link": "https://nativenewsonline.net/health/rfk-jr-outlines-commitment-to-native-american-food-sovereignty-shares-insights-on-opioid-recovery-and-whether-or-not-he-would-ban-hot-cheetos-on-the-rez",
    "timestamp": "2025-08-08T14:11:27Z"
  },
  {
    "title": "JD Vance: I do not want UK to go down 'dark path' of losing free speech",
    "description": "JD Vance said he does not want the UK to go down a \"very dark path\" of losing free speech during a meeting with the foreign secretary at his country estate.",
    "link": "https://news.sky.com/story/jd-vance-warns-against-uk-going-down-dark-path-of-losing-free-speech-during-meeting-with-david-lammy-13408626",
    "timestamp": "2025-08-08T14:11:00Z"
  },
  {
    "title": "President Trump orders federal law enforcement officers to patrol Washington, D.C. streets",
    "description": "President Trump ordered an increased federal law enforcement presence in Washington, D.C. after a former DOGE staffer was assaulted.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/08/trump-deploys-federal-law-enforcement-washington-dc-crime/85572918007/",
    "timestamp": "2025-08-08T14:10:23Z"
  },
  {
    "title": "US gold futures hit record high after Trump tariff blindsides global market (Leslie Hook/Financial Times)",
    "description": "Leslie Hook / Financial Times:\nUS gold futures hit record high after Trump tariff blindsides global market  —  Unexpected levy from Trump administration could redraw trade in the metal, analysts and investors warn  —  US gold futures hit a record high on Frid…",
    "link": "https://www.memeorandum.com/250808/p44",
    "timestamp": "2025-08-08T14:10:01Z"
  },
  {
    "title": "Federal court says Alabama must use map that creates 2nd Black majority district (Aaron Pellish/Politico)",
    "description": "Aaron Pellish / Politico:\nFederal court says Alabama must use map that creates 2nd Black majority district … Two of the judges, Anna Manasco and Terry Moorer, were appoint to their seats by President Donald Trump.  The third, Stanley Marcus, was appointed by …",
    "link": "https://www.memeorandum.com/250808/p43",
    "timestamp": "2025-08-08T14:10:01Z"
  },
  {
    "title": "On Epstein, Even MAGA World Can\nSmell That Trump Is Hiding Something",
    "description": "It’s exactly four weeks ago today that the Jeffrey Epstein story broke, or re-broke in its current form. On Friday, July 11, the world learned of the tense meeting that took place at the White House that previous Wednesday, in which FBI Deputy Director Dan Bo…",
    "link": "https://newrepublic.com/article/198931/epstein-maga-world-trump-hiding-something",
    "timestamp": "2025-08-08T14:09:04Z"
  },
  {
    "title": "US VP Vance says US has no plans to recognise Palestinian state",
    "description": "U.S. Vice President JD Vance stated that the United States does not intend to recognize a Palestinian state, citing the absence of a functional government. Vance plans to discuss this issue with British Foreign Minister David Lammy during a meeting. He affirm…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-vp-vance-says-us-has-no-plans-to-recognise-palestinian-state/articleshow/123190619.cms",
    "timestamp": "2025-08-08T14:07:04Z"
  },
  {
    "title": "Trump Unleashes Federal Law Enforcement to Secure DC Streets",
    "description": "President Donald Trump has ordered federal law enforcement to patrol Washington, D.C., for seven days starting at midnight on Friday, the White House announced. The move comes in response to a surge in violent crime in the overwhelmingly Democrat-run nation's…",
    "link": "https://freerepublic.com/focus/f-news/4333415/posts",
    "timestamp": "2025-08-08T14:06:01Z"
  },
  {
    "title": "Trump's deadline arrives for Putin to agree to a ceasefire or face sanctions",
    "description": "President Donald Trump's deadline is here for Russia's Vladimir Putin to agree to a ceasefire with Ukraine or face secondary sanctions.",
    "link": "https://abcnews.go.com/Politics/trumps-deadline-arrives-putin-agree-ceasefire-face-sanctions/story?id=124479057",
    "timestamp": "2025-08-08T14:05:11Z"
  },
  {
    "title": "American Nazis: The Aryan Freedom Network is riding high in Trump era (Reuters)",
    "description": "Reuters:\nAmerican Nazis: The Aryan Freedom Network is riding high in Trump era  —  With Donald Trump's return to power, a neo-Nazi group buoyed by his rhetoric is expanding its reach and changing the face of white extremism in America.  Its leaders: a Texas c…",
    "link": "https://www.memeorandum.com/250808/p42",
    "timestamp": "2025-08-08T14:05:00Z"
  },
  {
    "title": "Trump White House worried as GOP lawmakers become more willing to 'defect and defy': MSNBC",
    "description": "Above and beyond Donald Trump having to deal with the relentless blowback over the failure to release the Jeffrey Epstein files, his White House is in turmoil over the poor jobs report and a softening of his support in Congress.Building upon his report for Th…",
    "link": "https://www.rawstory.com/trump-gop-defect-and-defy/",
    "timestamp": "2025-08-08T14:04:55Z"
  },
  {
    "title": "Intel CEO Lip-Bu Tan responds to Trump allegations in letter: 'I have always operated within the highest legal and ethical standards'",
    "description": "Intel CEO Lip-Bu Tan defended his record and pledged cooperation with the U.S. government in a letter to employees after President Trump called for his resignation citing conflict of interests.",
    "link": "https://www.tomshardware.com/pc-components/cpus/intel-ceo-lip-bu-tan-responds-to-trump-allegations-in-letter-i-have-always-operated-within-the-highest-legal-and-ethical-standards",
    "timestamp": "2025-08-08T14:04:11Z"
  },
  {
    "title": "Biden-nominated judge slaps nationwide injunction on Trump birthright citizenship order",
    "description": "Biden-appointed federal judge Deborah Boardman blocks Trump's birthright citizenship order with nationwide injunction, citing likely constitutional violation.",
    "link": "https://www.foxnews.com/politics/biden-nominated-judge-slaps-nationwide-injunction-trump-birthright-citizenship-order",
    "timestamp": "2025-08-08T14:03:35Z"
  },
  {
    "title": "Donald Trump Demands New, Better, Illegal Census To Count Only Red Hat Owners",
    "description": "Completely unconstitutional, a detail left out by more than a few outlets.",
    "link": "https://www.wonkette.com/p/donald-trump-demands-new-better-illegal",
    "timestamp": "2025-08-08T14:03:18Z"
  },
  {
    "title": "'Horrifying Escalation': Global Outcry as Israeli Cabinet Approves Military Takeover of Gaza City",
    "description": "Foreign ministers from countries around the world, the United Nations' human rights chief, the families of Israeli hostages, and aid organizations were among those condemning the Israeli security cabinet's approval of a plan early Friday for a full military t…",
    "link": "https://www.commondreams.org/news/israel-takeover-gaza-city",
    "timestamp": "2025-08-08T14:01:05Z"
  },
  {
    "title": "Here’s Why The Bitcoin And Ethereum Prices Are Rallying Today",
    "description": "The Bitcoin and Ethereum prices are rallying today, recording notable gains in the process. This follows Donald Trump’s signing of two executive orders that could significantly boost the crypto industry.  Why The Bitcoin and Ethereum Prices Are Rallying Today…",
    "link": "https://bitcoinist.com/bitcoin-and-ethereum-prices/",
    "timestamp": "2025-08-08T14:00:51Z"
  },
  {
    "title": "Apple’s $100 billion American Manufacturing deal with President Trump marked a ‘remarkable turn’ – Jim Cramer",
    "description": "Apple this week announced a new $100 billion commitment to America, a significant acceleration of its U.S. investment that now totals…\nThe post Apple’s $100 billion American Manufacturing deal with President Trump marked a ‘remarkable turn’ – Jim Cramer appea…",
    "link": "https://macdailynews.com/2025/08/08/apples-100-billion-american-manufacturing-deal-with-president-trump-marked-a-remarkable-turn-jim-cramer/",
    "timestamp": "2025-08-08T14:00:34Z"
  },
  {
    "title": "Greg Abbott Lobs New Threat At Democrats Who Fled Texas To Stop Gerrymandering",
    "description": "The White House is already looking to expand its redistricting effort to more red states.",
    "link": "https://www.huffpost.com/entry/greg-abbott-texas-democrats-redistricting_n_6895ef5fe4b001d68aee0158",
    "timestamp": "2025-08-08T14:00:15Z"
  },
  {
    "title": "Intel CEO Hits Out at 'Misinformation' After US President Calls on Him To Resign",
    "description": "Intel's chief executive Lip-Bu Tan has hit out at \"misinformation\" over his career after U.S. President Donald Trump alleged the semiconductor industry veteran was \"highly conflicted\" and should resign. From a report: In a letter to Intel staff published late…",
    "link": "https://news.slashdot.org/story/25/08/08/0721242/intel-ceo-hits-out-at-misinformation-after-us-president-calls-on-him-to-resign",
    "timestamp": "2025-08-08T14:00:00Z"
  },
  {
    "title": "On Independence Day, Foreign Agribusiness Will Be Told Get Out, “Quit India!”",
    "description": "On 15 August, India will celebrate its Independence Day. There will be the usual celebratory flag-waving and flypasts in Delhi along with sound bites about ‘the world’s biggest democracy’. But what has ‘independence’ come to mean? Placing an X on a ballot pap…",
    "link": "https://www.activistpost.com/on-independence-day-foreign-agribusiness-will-be-told-get-out-quit-india/",
    "timestamp": "2025-08-08T14:00:00Z"
  },
  {
    "title": "SoftBank Buys Foxconn’s Ohio Plant to Boost Stargate AI Push",
    "description": "(Bloomberg) -- SoftBank Group Corp. is the buyer taking ownership of Foxconn Technology Group’s electric vehicle plant in Ohio, a move aimed at kick-starting...",
    "link": "https://finance.yahoo.com/news/softbank-buys-foxconn-ohio-plant-100208420.html",
    "timestamp": "2025-08-08T13:59:56Z"
  },
  {
    "title": "Trump Asks SCOTUS to Lift Curbs on ICE Enforcement in Los Angeles",
    "description": "President Donald Trump's deputies have asked the Supreme Court to override curbs imposed by pro-migration, anti-enforcement judges in Los Angeles and California. \nThe post Trump Asks SCOTUS to Lift Curbs on ICE Enforcement in Los Angeles appeared first on Bre…",
    "link": "https://www.breitbart.com/economy/2025/08/08/trump-asks-scotus-to-lift-curbs-on-ice-enforcement-in-los-angeles/",
    "timestamp": "2025-08-08T13:59:28Z"
  },
  {
    "title": "Trump will host Armenia and Azerbaijan for a White House peace summit to end decades of conflict",
    "description": "President Donald Trump will convene a peace summit at the White House with the leaders of Armenia and Azerbaijan",
    "link": "https://abcnews.go.com/US/wireStory/trump-host-armenia-azerbaijan-white-house-peace-summit-124480815",
    "timestamp": "2025-08-08T13:58:27Z"
  },
  {
    "title": "China Announces Breakthrough in Planned Moon Landing",
    "description": "A former NASA astronaut previously told Newsweek that China could absolutely beat the U.S. back to the moon.",
    "link": "https://www.newsweek.com/china-announces-breakthrough-planned-moon-landing-2110667",
    "timestamp": "2025-08-08T13:58:26Z"
  },
  {
    "title": "Trump will host Armenia and Azerbaijan for a White House peace summit to end decades of conflict",
    "description": "Trump says the two leaders will participate in a peace ceremony and sign economic agreements with the U.S.",
    "link": "https://www.bostonherald.com/2025/08/08/trump-armenia-azerbaijan-peace-summit/",
    "timestamp": "2025-08-08T13:57:05Z"
  },
  {
    "title": "China Defends Buying Russian Oil After Trump’s Tariff Threat",
    "description": "China said its imports of Russian oil are justified, pushing back against US threats of new tariffs after Washington slapped secondary levies on India for buying energy from Moscow.",
    "link": "https://gcaptain.com/china-defends-buying-russian-oil-after-trumps-tariff-threat/",
    "timestamp": "2025-08-08T13:56:27Z"
  },
  {
    "title": "Kristi Noem Rips ‘South Park’ Portrayal As ‘Lazy’ And ‘Petty’",
    "description": "Homeland Security Secretary Kristi Noem criticized “South Park,” stating it is “lazy to constantly make fun of women for how they look.”",
    "link": "https://www.forbes.com/sites/conormurray/2025/08/08/kristi-noem-rips-south-park-portrayal-as-lazy-and-petty/",
    "timestamp": "2025-08-08T13:55:56Z"
  }
]