[
  {
    "title": "Steve Soboroff Agrees to Work for Free, After $500,000 Salary Exposed",
    "description": "Los Angeles \"Chief Recovery Officer\" Steve Soboroff said Saturday night that he would work for free, after coming under fire for earning $500,000 for three months of work, even though his salary was to have been paid privately.\nThe post Steve Soboroff Agrees …",
    "link": "https://www.breitbart.com/politics/2025/02/09/steve-soboroff-agrees-work-for-free-after-500000-salary-exposed/",
    "timestamp": "2025-02-09T13:31:24Z"
  },
  {
    "title": "More Profiles of Courage, Patriotism and Resistance in standing up to Trump (Dean Obeidallah/The Dean's Report)",
    "description": "Dean Obeidallah / The Dean's Report:\nMore Profiles of Courage, Patriotism and Resistance in standing up to Trump  —  These are inspiring moments for us!  —  If you just watched corporate news—and I sincerely hope you watch more than that—you would think Donal…",
    "link": "https://www.memeorandum.com/250209/p12",
    "timestamp": "2025-02-09T13:30:01Z"
  },
  {
    "title": "Texmaco targets more export of rail components to the US",
    "description": "Texmaco Rail & Engineering aims to boost exports to US and Europe amid changing geopolitical conditions.",
    "link": "https://www.thehindubusinessline.com/economy/logistics/texmaco-targets-more-export-of-rail-components-to-the-us/article69199534.ece",
    "timestamp": "2025-02-09T13:29:48Z"
  },
  {
    "title": "Expert: How I know Trump is about to open the floodgates when it comes to UFOs (Steven Greer)",
    "description": "Donald Trump could be poised to pull back the curtain on UFOs, according to an expert. Dr Steven Greer, one of the driving forces behind the UFO disclosure movement, claims the new administration is considering executive orders that would publicize the govern…",
    "link": "https://freerepublic.com/focus/f-chat/4296196/posts",
    "timestamp": "2025-02-09T13:27:51Z"
  },
  {
    "title": "How Elon Musk's access to the Treasury system could affect your Social Security benefits?",
    "description": "The United States of America appears to be being governed in a way that has never happened before. \nWhilst President Donald Trump is the man in power, there is a huge amount of mys",
    "link": "https://www.marca.com/en/lifestyle/us-news/personal-finance/2025/02/09/67a89016e2704e8d148b4571.html",
    "timestamp": "2025-02-09T13:27:09Z"
  },
  {
    "title": "Gavin Newsom approves $50 million ‘Trump proof’ funds after begging him for federal help just days before",
    "description": "'None of the funding in this bill is intended to be used for immigration-related legal services for noncitizens convicted of serious violent felonies'",
    "link": "https://www.wnd.com/2025/02/gavin-newsom-approves-50-million-trump-proof-funds-after-begging-him-for-federal-help-just-days-before/",
    "timestamp": "2025-02-09T13:24:55Z"
  },
  {
    "title": "Why Trump blinked before imposing his ‘beautiful’ tariffs on Canada and Mexico",
    "description": "Trump has teased two of the US’s biggest trading partners with levies but has moved the goalpost at least three times in two weeks\nDonald Trump was in his element in the Oval Office this week. Surrounded by cameras, flanked by billionaire allies and confronte…",
    "link": "https://biztoc.com/x/43f30d1572c6566d",
    "timestamp": "2025-02-09T13:22:46Z"
  },
  {
    "title": "Trump faces pushback as he works to reshape federal government",
    "description": "Meet the Press moderator Kristen Welker joins Joe Fryer on Sunday TODAY to discuss the two dozen lawsuits against President Donald Trump that are aimed at slowing down his attempts to reshape the federal government, cut jobs, freeze domestic and foreign spend…",
    "link": "https://www.today.com/video/trump-faces-pushback-as-he-works-to-reshape-federal-government-231498309714",
    "timestamp": "2025-02-09T13:20:22Z"
  },
  {
    "title": "How Republican skeptics in the Senate got to 'yes' on RFK Jr. and Gabbard",
    "description": "Republican skepticism in the Senate of President Donald Trump’s Cabinet nominees has been worn down",
    "link": "https://abcnews.go.com/US/wireStory/republican-skeptics-senate-rfk-jr-gabbard-118619157",
    "timestamp": "2025-02-09T13:18:22Z"
  },
  {
    "title": "Trump says he’s spoken with Putin about Ukraine war",
    "description": "President Donald Trump is set to become the first sitting president to ever attend the Super Bowl, making security even tighter than usual at the big game. Meanwhile, the President says he has spoken with Russia’s President Vladimir Putin as the three-year an…",
    "link": "https://www.today.com/video/trump-set-to-become-first-sitting-president-to-attend-super-bowl-231495749747",
    "timestamp": "2025-02-09T13:16:52Z"
  },
  {
    "title": "Designating Cartels As Terrorists Will Have Huge Consequences, Say Analysts",
    "description": "Designating Cartels As Terrorists Will Have Huge Consequences, Say Analysts\n \nAuthored by Chris Summers via The Epoch Times,\nOn Jan. 20, President Donald Trump signed an executive order that started a process by which international organized crime cartels wou…",
    "link": "https://biztoc.com/x/4555701cf8c8c8bb",
    "timestamp": "2025-02-09T13:11:49Z"
  },
  {
    "title": "Trump is bringing back the least useful Obama-era ritual",
    "description": "President Donald Trump’s chat with Fox News’ Bret Baier, airing before the Super Bowl kickoff time will give us little valuable information.",
    "link": "https://biztoc.com/x/524586f92a1ad58e",
    "timestamp": "2025-02-09T13:11:39Z"
  },
  {
    "title": "As Trump steamrolls Washington, courts flex their power to slow him down (Kyle Cheney/Politico)",
    "description": "Kyle Cheney / Politico:\nAs Trump steamrolls Washington, courts flex their power to slow him down  —  Numerous federal district judges around the country have blocked major portions of Trump's early agenda — but Supreme Court showdowns loom.  —  President Dona…",
    "link": "https://www.memeorandum.com/250209/p10",
    "timestamp": "2025-02-09T13:10:02Z"
  },
  {
    "title": "DEI needs to fix systems, not people",
    "description": "Experts argue that bias is systemic, and solutions should focus on changing policies and structures, not just individual behaviour.",
    "link": "https://theconversation.com/dei-needs-to-fix-systems-not-people-247877",
    "timestamp": "2025-02-09T13:09:06Z"
  },
  {
    "title": "Why Canada must seize the moment and launch its long-awaited Africa strategy",
    "description": "Africa’s rise is unfolding now. Canada has the tools, the values and the economic imperative to form strong partnerships on the continent in the face of Donald Trump’s threats.",
    "link": "https://theconversation.com/why-canada-must-seize-the-moment-and-launch-its-long-awaited-africa-strategy-249255",
    "timestamp": "2025-02-09T13:08:28Z"
  },
  {
    "title": "Bolstering Canada’s right to repair could shield it against U.S. tariffs and trade uncertainty",
    "description": "The right to repair can increase the amount of well-paying Canadian jobs and reduce Canada’s dependence on unpredictable global markets.",
    "link": "https://theconversation.com/bolstering-canadas-right-to-repair-could-shield-it-against-u-s-tariffs-and-trade-uncertainty-248970",
    "timestamp": "2025-02-09T13:08:07Z"
  },
  {
    "title": "How China Dominated Nuclear Energy",
    "description": "China is on a clear course to become the world’s first “electrostate\" — and is likely to eclipse the U.S. in atomic power in the next decade.",
    "link": "https://www.huffpost.com/entry/china-nuclear-power_n_67a29a03e4b0b9a29af3dd3b",
    "timestamp": "2025-02-09T13:02:13Z"
  },
  {
    "title": "What will Trump’s “Unleashing American Energy” mean for Colorado, nation?",
    "description": "The \"drill, baby, drill\" mantra could become reality if President Donald Trump's executive orders succeed in ramping up oil and gas production in Colorado and nationwide.",
    "link": "https://www.denverpost.com/2025/02/09/trump-drill-baby-oil-gas-fossil-fuels-energy-public-lands-colorado/",
    "timestamp": "2025-02-09T13:00:54Z"
  },
  {
    "title": "A presidential first: Trump at the Super Bowl, latest chapter in a complicated legacy with football",
    "description": "By DARLENE SUPERVILLE WEST PALM BEACH, Fla. (AP) — As a student, Donald Trump played high school football. As a business baron, he owned a team in an upstart rival to the NFL and then sued the established league. As president, he denigrated pros who took a kn…",
    "link": "https://www.denverpost.com/2025/02/09/a-presidential-first-trump-at-the-super-bowl-latest-chapter-in-a-complicated-legacy-with-football/",
    "timestamp": "2025-02-09T13:00:43Z"
  },
  {
    "title": "A presidential first: Trump at the Super Bowl, latest chapter in a complicated legacy with football",
    "description": "As a student, Donald Trump played high school football. As a business baron, he owned a team in an upstart rival to the NFL and then sued the established league. As president, he denigrated pros who took a knee during the national anthem as part of a social j…",
    "link": "https://www.denverpost.com/2025/02/09/super-bowl-2025-trump-football-end-racism/",
    "timestamp": "2025-02-09T13:00:43Z"
  },
  {
    "title": "USAID Helped Dems Steal 2020 Election by Funding Wuhan Lab That Created COVID, the Ultimate Excuse for Illegal Election Tampering",
    "description": "Amid increasing scrutiny, this analysis uncovers how USAID's funding may have inadvertently influenced the 2020 election landscape, intertwining pandemic response with political maneuvering in a compelling narrative of accountability and consequence.\nThe post…",
    "link": "https://www.thegatewaypundit.com/2025/02/usaid-helped-dems-steal-2020-election-funding-wuhan/",
    "timestamp": "2025-02-09T13:00:33Z"
  },
  {
    "title": "Despite Trump’s anti-public lands stance, Colorado advocates still hope to protect Dolores River canyonlands",
    "description": "Colorado largely supports federal lands as neighboring Utah and Wyoming seek to claw back control.",
    "link": "https://www.denverpost.com/2025/02/09/donald-trump-public-lands-colorado-dolores-river-monument/",
    "timestamp": "2025-02-09T13:00:20Z"
  },
  {
    "title": "Trump Wants to Reduce the Trade Deficit. Here's Why That Matters",
    "description": "President Donald Trump has long sought to tackle the country's overall trade deficit.\n- The combined goods and services trade deficit hit $918.4 billion in 2024, a big increase from 2023.\n- There hasn't been a trade surplus in the United States since 1975.\nTh…",
    "link": "https://biztoc.com/x/995835fb26063538",
    "timestamp": "2025-02-09T13:00:10Z"
  },
  {
    "title": "Air traffic controllers in peril nationwide: 'Work force missing'...",
    "description": "Elon Musk and his band of DOGE techies have been asked to upgrade the nation's aviation system in the wake of the midair crash near Washington, D.C.",
    "link": "https://www.sfgate.com/travel/article/musk-doge-tapped-overhaul-air-traffic-control-20149118.php",
    "timestamp": "2025-02-09T13:00:05Z"
  },
  {
    "title": "The real estate of empire: How colonial gentrification fuels Trump's Gaza plan",
    "description": "By Peter Bloom/Common DreamsU.S. President Donald Trump's latest proposal concerning the future of Gaza has sent shockwaves throughout the international community. The plan, which envisions the mass displacement of Palestinians to make way for large-scale rea…",
    "link": "https://www.rawstory.com/the-real-estate-of-empire-how-colonial-gentrification-fuels-trump-s-gaza-plan/",
    "timestamp": "2025-02-09T13:00:03Z"
  },
  {
    "title": "Market pros tell us why they're not worried about tariff whiplash — and why stocks are poised to keep rallying",
    "description": "The economy could be too strong for Trump's tariffs to derail the outlook for stocks, investors and economists told BI.",
    "link": "https://markets.businessinsider.com/news/stocks/stock-market-outlook-trump-tariffs-inflation-sp500-buying-opportunity-dip-2025-2",
    "timestamp": "2025-02-09T13:00:01Z"
  },
  {
    "title": "‘A Very Christian Concept’",
    "description": "The faith’s mandate is more arduous than J. D. Vance’s account seems to allow.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/02/catholic-charities-trump/681610/",
    "timestamp": "2025-02-09T13:00:00Z"
  },
  {
    "title": "Sunday Morning Talk Show Thread 9 February 2025",
    "description": "The Talk Shows February 9th, 2025 Guests to be interviewed today on major television talk shows:FACE THE NATION (CBS): Margaret Brennan anchors: Sen. Bill Hagerty (R-Tenn.); Rep. Ilhan Omar (D-Somalia.) … Rep. Michael McCaul (R-Texas) … Samantha Vinograd, DHS…",
    "link": "https://freerepublic.com/focus/f-news/4296189/posts",
    "timestamp": "2025-02-09T12:56:44Z"
  },
  {
    "title": "Parents of American murdered by Hamas make 'plea' to Trump after latest hostage release",
    "description": "The parents of murdered Israeli-American hostage Hersh Goldberg-Polin pleaded with President Donald Trump to get the remaining 76 hostages home.",
    "link": "https://www.foxnews.com/world/parents-american-murdered-hamas-make-plea-trump-latest-hostage-release",
    "timestamp": "2025-02-09T12:56:28Z"
  },
  {
    "title": "US and China teeter on edge of trade war as tariff deadline looms",
    "description": "Donald Trump’s shock tactics may have pushed Beijing away from negotiating table, experts say",
    "link": "https://www.irishtimes.com/business/economy/2025/02/09/us-and-china-teeter-on-edge-of-trade-war-as-tariff-deadline-looms/",
    "timestamp": "2025-02-09T12:51:52Z"
  },
  {
    "title": "Ukraine's rare earths are key to its bargaining power",
    "description": "The US wants to trade further military and financial aid to Ukraine for access to the country's vast rare earth reserves. But some might already be under Russian control, and the EU is moving in for its share, too.",
    "link": "https://www.dw.com/en/ukraines-rare-earths-are-key-to-its-bargaining-power/a-71531476",
    "timestamp": "2025-02-09T12:50:00Z"
  },
  {
    "title": "Ukraine's rare earths are key to its bargaining power",
    "description": "The US wants to trade further military and financial aid to Ukraine for access to the country's vast rare earth reserves. But some might already be under Russian control, and the EU is moving in for its share, too. US President Donald Trump has placed new con…",
    "link": "https://www.dw.com/en/ukraines-rare-earths-are-key-to-its-bargaining-power/a-71531476",
    "timestamp": "2025-02-09T12:50:00Z"
  },
  {
    "title": "Ukraine's rare minerals the US, EU and Russia want access to",
    "description": "The US wants to trade further military and financial aid to Ukraine for access to the country's vast rare earth reserves. But some might already be under Russian control, and the EU is moving in for its share, too. US President Donald Trump has placed new con…",
    "link": "https://www.dw.com/en/ukraine-russia-war-mineral-wealth-us-eu-v2/a-71531476",
    "timestamp": "2025-02-09T12:50:00Z"
  },
  {
    "title": "Sunday: Hili dialogue",
    "description": "This is post 29,998! Welcome to the Sabbath for goyische cats: it’s Sunday, February 9, 2025, and National Pizza Day.  Chicago the Mecca of American Pizzas, and the only pizza I deliberately seek out is the famous stuffed pizza, which cannot be duplicated in …",
    "link": "https://whyevolutionistrue.com/2025/02/09/sunday-hili-dialogue-520/",
    "timestamp": "2025-02-09T12:45:22Z"
  },
  {
    "title": "Israel withdraws from key road cutting through Gaza as pregnant woman shot dead in West Bank",
    "description": "Egypt will host a summit of Arab nations on 27 February to discuss “the latest serious developments” concerning the Palestinian territories.",
    "link": "https://www.thejournal.ie/israeli-forces-withdraw-from-key-road-cutting-through-gaza-ahead-of-phase-two-of-ceasefire-deal-6618001-Feb2025/",
    "timestamp": "2025-02-09T12:43:53Z"
  },
  {
    "title": "Chiefs vs. Bills: Super Bowl 2025 preview, prediction, what to watch for",
    "description": "An inside look at the Chiefs-Eagles Super Bowl 2025 battle in New Orleans on Sunday night:",
    "link": "https://nypost.com/2025/02/09/sports/chiefs-vs-eagles-super-bowl-2025-preview-prediction-what-to-watch-for/",
    "timestamp": "2025-02-09T12:38:30Z"
  },
  {
    "title": "From Dogecoin to $Trump: everything you need know about the wild world of meme coins",
    "description": "Are they the same as crypto, why has the US president launched one, and who’s really coining it in? Here’s a complete guide to the latest digital money mania\nThree days before his inauguration as US president, Donald Trump made an unusual move. He launched $T…",
    "link": "https://biztoc.com/x/f68241f2ca5e49ac",
    "timestamp": "2025-02-09T12:38:10Z"
  },
  {
    "title": "Some US health clinics grapple with federal funding squeeze",
    "description": "A Reuters analysis found that tens of billions of dollars in congressionally approved spending for programs across industries, such as clean energy, remain frozen under various Trump administration orders",
    "link": "https://www.rappler.com/world/some-us-health-clinics-grapple-federal-funding-squeeze-february-9-2025/",
    "timestamp": "2025-02-09T12:37:54Z"
  },
  {
    "title": "Ben Stiller Denies Taking USAID Money: 'Lies Coming from Russian Media'",
    "description": "A report claimed that actor Ben Stiller and other celebrities received millions of taxpayer dollars to visit Ukraine.",
    "link": "https://www.westernjournal.com/ben-stiller-denies-taking-usaid-money-lies-coming-russian-media/",
    "timestamp": "2025-02-09T12:37:35Z"
  },
  {
    "title": "Digitising house-buying process eyed as way to speed up transactions",
    "description": "Digitising more of the house-buying process is being explored by the government as a way to speed up transactions.",
    "link": "https://news.sky.com/story/digitising-house-buying-process-eyed-as-way-to-speed-up-transactions-13306006",
    "timestamp": "2025-02-09T12:35:00Z"
  },
  {
    "title": "Prince Harry's criticism of 'weak moral character' felt like a jibe at Trump",
    "description": "Prince Harry's memoir dropped so many bombshells, his admission of drug-taking certainly was not the most jaw-dropping revelation.",
    "link": "https://news.sky.com/story/prince-harrys-criticism-of-weak-moral-character-at-invictus-games-felt-like-a-jibe-at-donald-trump-13305960",
    "timestamp": "2025-02-09T12:34:00Z"
  },
  {
    "title": "New Evidence Could Be About To Blow Up The Mystery Of Bitcoin’s Satoshi Nakamoto",
    "description": "A Coinbase executive has claimed Satoshi Nakamoto’s identity may be known by the rival crypto exchange Kraken...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/02/09/new-evidence-could-be-about-to-blow-up-the-mystery-of-bitcoins-satoshi-nakamoto/",
    "timestamp": "2025-02-09T12:31:27Z"
  },
  {
    "title": "China to roll back clean power subsidies after boom",
    "description": "BEIJING: China's top economic planning agency said on Sunday (Feb 9) it was taking steps to scale back subsidies for renewable energy projects after a boom in solar and wind power installations. China broke its own records for new solar installations in 2024 …",
    "link": "https://www.channelnewsasia.com/business/china-scale-back-subsidies-renewable-energy-projects-4926786",
    "timestamp": "2025-02-09T12:27:27Z"
  },
  {
    "title": "Dear Diary: Today I was let out of prison after three years and charges of seditious conspiracy acts. Now I'm thinking about entering politics. P.S. Donald Trump is so DREAMY [Facepalm]",
    "description": "Dear Diary: Today I was let out of prison after three years and charges of seditious conspiracy acts. Now I'm thinking about entering politics. P.S. Donald Trump is so DREAMY",
    "link": "https://www.fark.com/comments/13555650/Dear-Diary-Today-I-was-let-out-of-prison-after-three-years-charges-of-seditious-conspiracy-acts-Now-Im-thinking-about-entering-politics-PS-Donald-Trump-is-so-DREAMY",
    "timestamp": "2025-02-09T12:20:43Z"
  },
  {
    "title": "As the Trump upheaval continues, are there restraints that could slow him down? (Dan Balz/Washington Post)",
    "description": "Dan Balz / Washington Post:\nAs the Trump upheaval continues, are there restraints that could slow him down?  —  Questions remain on what constitutional or other checks can be put on the president and his wide-ranging actions.  —  Rare is the president who doe…",
    "link": "https://www.memeorandum.com/250209/p4",
    "timestamp": "2025-02-09T12:20:00Z"
  },
  {
    "title": "Some US health clinics grapple with federal funding squeeze",
    "description": "President Donald Trump's executive orders have begun to disrupt patient care in the United States, as some providers cannot access essential federal funding, according to interviews with a dozen healthcare providers and policy advocates. Facilities in Virgini…",
    "link": "https://www.channelnewsasia.com/world/us-health-clinics-federal-funding-trump-4926896",
    "timestamp": "2025-02-09T12:19:18Z"
  },
  {
    "title": "Lutnick Says EU ESG Regulations Will Harm U.S. Energy Producers",
    "description": "Commerce Secretary Howard Lutnick promises to use all the tools at his disposal to address concerns about new ESG regulations imposed by the EU on U.S. businesses.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/02/09/lutnick-says-eu-esg-regulations-will-harm-us-energy-producers/",
    "timestamp": "2025-02-09T12:19:06Z"
  },
  {
    "title": "Trump vows to tap America’s ‘liquid gold’ oil reserves and ‘drill baby, drill’—the only problem is, it’s not up to him",
    "description": "Trump vows to tap America’s ‘liquid gold’ oil reserves and ‘drill baby, drill’—the only problem is, it’s not up to him\nDonald Trump wanted to tap America's oil reserves to power the economy in his administration—but it's not his call to make\nBonnie Cash/UPI/B…",
    "link": "https://biztoc.com/x/2d0f61ba2c76e616",
    "timestamp": "2025-02-09T12:15:42Z"
  },
  {
    "title": "How to watch US coverage of Super Bowl in the UK so you can see iconic adverts and film trailers",
    "description": "Here is everything you need to know about watching US coverage of Super Bowl in the UK as the Kansas City Chiefs take on the Philadelphia Eagles.",
    "link": "https://www.ladbible.com/news/sport/super-bowl-2025-how-to-watch-uk-017967-20250209",
    "timestamp": "2025-02-09T12:10:25Z"
  },
  {
    "title": "Trans Lawmaker Sarah McBride Drops Brutal Trump Assessment After GOP Rep's Misgendering",
    "description": "McBride called out the president's administration for its \"cycle of chaos, corruption and cynicism\" as she declined to respond to her Republican colleague.",
    "link": "https://www.huffpost.com/entry/trans-lawmaker-sarah-mcbride-mary-miller-misgendering_n_67a84515e4b03ba5c011cd3f",
    "timestamp": "2025-02-09T12:08:56Z"
  },
  {
    "title": "Democrats Plot Strategy in Shutdown Fight",
    "description": "“Democrats have been powerless as they’ve watched President Donald Trump systematically move to dismantle federal agencies and push the bounds of his office with little concern about the fallout,” CNN reports. “But they do have",
    "link": "https://politicalwire.com/2025/02/09/democrats-plot-strategy-in-shutdown-fight/",
    "timestamp": "2025-02-09T12:08:48Z"
  },
  {
    "title": "Elon Musk outlines 'super obvious' changes DOGE and Treasury have agreed to make",
    "description": "Billionaire Elon Musk says the Treasury Department has agreed to a list of \"super obvious\" changes to allow more audits of government payments.",
    "link": "https://www.foxnews.com/politics/elon-musk-outlines-super-obvious-changes-doge-treasury-have-agreed-make",
    "timestamp": "2025-02-09T12:05:55Z"
  },
  {
    "title": "As Trump steamrolls Washington, courts flex their power to slow him down",
    "description": "President Donald Trump’s “shock and awe” assertion of executive power has hit a wall in the courtroom — at least for now. \nAt least nine federal judges — from Washington, D.C., to Washington state — have halted aspects of Trump’s early-term blitz, from his ef…",
    "link": "https://biztoc.com/x/395dc577e3eb8308",
    "timestamp": "2025-02-09T12:04:58Z"
  },
  {
    "title": "Dalal Street Week Ahead: India & US inflation, Q3 earnings, Powell testimony among 10 key factors to watch",
    "description": "Dalal Street Week Ahead: India & US inflation, Q3 earnings, Powell testimony among 10 key factors to watchmoneycontrol.com",
    "link": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-india-us-inflation-q3-earnings-powell-testimony-among-10-key-factors-to-watch-12934850.html",
    "timestamp": "2025-02-09T12:04:15Z"
  },
  {
    "title": "Russia Claims Another Village in Eastern Ukraine",
    "description": "Moscow said on Friday that its forces had seized a handful of settlements in Donetsk since the start of the month.",
    "link": "https://www.newsweek.com/russia-donetsk-ukraine-chasiv-yar-toretsk-2028402",
    "timestamp": "2025-02-09T12:01:46Z"
  },
  {
    "title": "Trump is making himself inescapable | CNN Business",
    "description": "White House aides have indicated the president’s ubiquity is partly a strategy to impress Republican voters and disorient Democratic opponents.",
    "link": "https://www.cnn.com/2025/02/09/business/trump-super-bowl-media/index.html",
    "timestamp": "2025-02-09T12:00:10Z"
  },
  {
    "title": "Trump Orders NASA to Purge All Mentions of Women in Leadership On Its Websites",
    "description": "[Redacted] As President Donald Trump's anti-DEI agenda comes to bear on NASA, we're getting a revealing look at what his administration apparently considers to be too woke: women. In a directive sent out just days after Trump's inauguration, NASA personnel we…",
    "link": "https://futurism.com/the-byte/trump-nasa-purge-mentions-women",
    "timestamp": "2025-02-09T12:00:08Z"
  },
  {
    "title": "Bitcoin May Reach $200K Despite Trade War Fears. Can the Biggest Presale $WEPE 100x?",
    "description": "Fred Thiel, the CEO of Marathon Digital, a Bitcoin mining giant, is extremely bullish on Bitcoin and predicts it can reach $200K in 2025. BTC is currently trading around the $97,000 mark, which means it can double from current prices as per Fred. The CEO cred…",
    "link": "http://www.newsbtc.com/news/bitcoin-may-reach-200k-despite-trade-war-fears-can-the-biggest-presale-wepe-100x/",
    "timestamp": "2025-02-09T12:00:03Z"
  },
  {
    "title": "Taylor Swift at the Super Bowl 2025: Everything We Know",
    "description": "The pop star is set to make an appearance at Super Bowl LIX in New Orleans. Here's everything we know about her plans.",
    "link": "https://www.newsweek.com/taylor-swift-super-bowl-lix-2025-details-travis-kelce-2027796",
    "timestamp": "2025-02-09T12:00:02Z"
  },
  {
    "title": "Super Bowl LIX, The Floor Premiere, Puppy Bowl and More",
    "description": "To help you anticipate and navigate all that television has to offer across broadcast, cable and streaming, TVLine offers daily, weekly and monthly What to Watch digests, as well as an overview of every new TV show premiering in 2025. On TV this Sunday: The C…",
    "link": "https://tvline.com/what-to-watch/super-bowl-2025-chiefs-eagles-fox/",
    "timestamp": "2025-02-09T12:00:00Z"
  },
  {
    "title": "A potential U.S. trade war has breathed some life into the fraught idea of shipping oil through Hudson Bay",
    "description": "Canada is suddenly considering its short- and long-term export and transport options for the oil industry, which includes breathing some life into the idea of transporting oil across northern Manitoba and filling tankers at a Hudson Bay port.",
    "link": "https://www.cbc.ca/news/canada/manitoba/port-nelson-hudson-bay-1.7454115",
    "timestamp": "2025-02-09T12:00:00Z"
  },
  {
    "title": "President Clinton’s Better Vision for Gaza’s Future",
    "description": "\"If history has taught us anything, it is that lasting peace requires engagement, not exclusion.\"",
    "link": "https://time.com/7214120/gaza-future-bill-clinton/",
    "timestamp": "2025-02-09T12:00:00Z"
  },
  {
    "title": "Secrets of Donald Trump's 'Plot' to Boot Prince Harry out of U.S. — As Royal Exile's Visa Drugs Scandal Deepens",
    "description": "Donald Trump is hatching an alleged plot to oust Prince Harry as the royal's U.S. visa drugs scandal deepens.",
    "link": "https://radaronline.com/p/trump-plot-oust-prince-from-us-harry-visa-drugs-scandal-grows/",
    "timestamp": "2025-02-09T12:00:00Z"
  },
  {
    "title": "Links 2/9/2025",
    "description": "Our lazy daily links",
    "link": "https://www.nakedcapitalism.com/2025/02/links-2-9-2025.html",
    "timestamp": "2025-02-09T11:58:06Z"
  },
  {
    "title": "The EEOC exists to fight discrimination. Fired official fears a hobbling under Trump - NPR",
    "description": "The EEOC exists to fight discrimination. Fired official fears a hobbling under TrumpNPR US equality chief fired by Trump condemns ‘demonization of the term DEI’The Guardian US Trump fires EEOC commissioners in late-night purgeMSNBC Evidence That the Right's A…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176163461",
    "timestamp": "2025-02-09T11:52:37Z"
  },
  {
    "title": "FO° Talks: US Immigration Policy Under Donald Trump 2.0",
    "description": "Founder, CEO and Editor-in-Chief Atul Singh speaks with Douglas Hauer-Gilad about US immigration policy under a second term for US President Donald Trump. The discussion focuses on Trump’s policy objectives, the feasibility of them and their impact on immigra…",
    "link": "https://www.fairobserver.com/politics/fo-talks-us-immigration-policy-under-donald-trump-2-0/",
    "timestamp": "2025-02-09T11:52:07Z"
  },
  {
    "title": "Consumer Financial Protection Bureau is ordered by Russell Vought to stop fighting financial abuse",
    "description": "Russell Vought, the newly installed acting director of the Consumer Financial Protection Bureau, sent an email Saturday night ordering all employees at the consumer watchdog to stop virtually all work – including fighting financial abuse.",
    "link": "https://www.cnn.com/2025/02/09/business/cfpb-vought-stop-activity/index.html",
    "timestamp": "2025-02-09T11:50:02Z"
  },
  {
    "title": "Secret Service airing Michael Bay recruitment ad...",
    "description": "Secret Service airing Michael Bay recruitment ad...\r\n\n \n \n \n (First column, 14th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Super Fog Could Steal Spotlight in New Orleans...\r\nTONIGHT: CHIEFS CHASE HISTORIC THREE-PEAT...\r\nSuper Bowl simulated -- EAGLES win!\r\nES…",
    "link": "https://www.cnn.com/2025/02/08/politics/secret-service-super-bowl-ad/index.html",
    "timestamp": "2025-02-09T11:46:39Z"
  },
  {
    "title": "Hamas says Israel withdraws from key Gaza road",
    "description": "<p>GAZA CITY (PALESTINIAN TERRITORIES) - A Hamas official said Israeli troops on Sunday completed their withdrawal from a strategic road bisecting the Gaza Strip, part of a fragile truce deal that Israel said it was implementing.</p>",
    "link": "https://www.bangkokpost.com/world/2957430/hamas-says-israel-withdraws-from-key-gaza-road",
    "timestamp": "2025-02-09T11:45:00Z"
  },
  {
    "title": "Trump is making himself inescapable",
    "description": "Last year, President Joe Biden passed up a chance to be interviewed on the highly rated Super Bowl pregame show. This year, not only is President Donald Trump being interviewed, he is coming here for the big game in person.\nBy becoming the first sitting presi…",
    "link": "https://biztoc.com/x/ef63e0c900a8df03",
    "timestamp": "2025-02-09T11:42:53Z"
  },
  {
    "title": "Donald Trump Is Back. The World Is Worried.",
    "description": "President Donald Trump’s return to power has alarmed many countries around the world. It is important to remember that Trump the individual represents two deep and persistent trends in American politics: isolationism and nativism. Remember that after World Wa…",
    "link": "https://www.fairobserver.com/world-news/us-news/donald-trump-is-back-the-world-is-worried/",
    "timestamp": "2025-02-09T11:42:38Z"
  },
  {
    "title": "Israeli soldiers risk possible prosecution abroad from Gaza war",
    "description": "<p>It&rsquo;s a hallowed Israeli tradition: after completing military service, backpack through South America or hitchhike across Asia. But global outrage at the Gaza war, threats of arrest and the ubiquity of social media are causing some soldiers and reserv…",
    "link": "https://www.bangkokpost.com/world/2957421/israeli-soldiers-risk-possible-prosecution-abroad-from-gaza-war",
    "timestamp": "2025-02-09T11:41:00Z"
  },
  {
    "title": "Super Bowl LIX Game Day Picks, Props And Eagles-Chiefs Betting Data",
    "description": "It’s game day for Super Bowl LIX, and nearing the coin toss and kickoff for the Super Bowl rematch between the Philadelphia Eagles and Kansas City Chiefs. Additional betting picks, props, insight and betting data from top online sportsbooks with information y…",
    "link": "https://www.forbes.com/sites/jayginsbach/2025/02/09/super-bowl-lix-game-day-picks-props-and-eagles-chiefs-betting-data/",
    "timestamp": "2025-02-09T11:40:14Z"
  },
  {
    "title": "Japan’s Ishiba Shows How to Work With Trump in First Summit",
    "description": "Japanese Prime Minister Shigeru Ishiba went into his first summit meeting with US President Donald Trump amid concerns in Tokyo that Japan could be next in the firing line of US allies after Canada and others.",
    "link": "https://financialpost.com/pmn/business-pmn/japans-ishiba-shows-how-to-work-with-trump-in-first-summit",
    "timestamp": "2025-02-09T11:31:15Z"
  },
  {
    "title": "10 Sunday Reads",
    "description": "Avert your eyes! My Sunday morning look at incompetency, corruption and policy failures: • That Giant Sucking Sound? It’s Climate Change Devouring Your Home’s Value. As the compounding impacts of climate-driven disasters take effect, we are seeing home insura…",
    "link": "https://ritholtz.com/2025/02/sunday-reads-405/",
    "timestamp": "2025-02-09T11:30:41Z"
  },
  {
    "title": "Herzog slams BBC for 'false equivalence' of Israeli hostages, Palestinian prisoners",
    "description": "Herzog called for an end to what he described as a “preposterous” narrative that equates Israel’s legal system with Hamas’s brutality.",
    "link": "https://www.jpost.com/israel-news/article-841308",
    "timestamp": "2025-02-09T11:30:23Z"
  },
  {
    "title": "All the presidents ate",
    "description": "The inauguration of Donald Trump as the 47th president of the U.S. has been in the news in many ways. Especially the luncheon he hosted afterward was closely watched over by the press. Who was invited was one of the most talked about aspects, the photo of tec…",
    "link": "https://www.hurriyetdailynews.com/opinion/aylin-oney-tan/an-inauguration-feast-205618",
    "timestamp": "2025-02-09T11:26:35Z"
  },
  {
    "title": "Richard Gere Scolds Trump as a 'Bully' and 'Thug' with America 'In a Very Dark Place'",
    "description": "Actor Richard Gere called President Donald Trump a \"bully\" and a \"thug\" on Saturday, choosing an awards ceremony in Spain to deliver his insults before lamenting the U.S. is now in a \"very dark place.\"\nThe post Richard Gere Scolds Trump as a ‘Bully’ and ‘Thug…",
    "link": "https://www.breitbart.com/entertainment/2025/02/09/richard-gere-scolds-trump-as-a-bully-and-thug-with-america-in-a-very-dark-place/",
    "timestamp": "2025-02-09T11:24:31Z"
  },
  {
    "title": "Top 6 Meme Coins to Buy as SEC Acknowledges First-Ever Solana ETF Application",
    "description": "The US Securities and Exchange Commission (SEC) has finally acknowledged a bid to create an exchange-traded fund (ETF) for Solana. The bid was filed by Grayscale, a crypto asset management firm. This is particularly noteworthy because it reflects a change of …",
    "link": "http://www.newsbtc.com/news/top-6-meme-coins-to-buy-as-sec-acknowledges-first-ever-solana-etf-application/",
    "timestamp": "2025-02-09T11:23:40Z"
  },
  {
    "title": "How Silk Road drug kingpin Ross Ulbricht could reclaim $6.5B worth of Bitcoin after being pardoned by Trump",
    "description": "The founder of online drug marketplace Silk Road could claw back the $6.5billion worth of Bitcoin seized from the platform after being pardoned by Donald Trump and freed from a life sentence behind bars. Ross Ulbricht, who was sentenced in 2015, could mount a…",
    "link": "https://freerepublic.com/focus/f-chat/4296178/posts",
    "timestamp": "2025-02-09T11:17:59Z"
  },
  {
    "title": "Trump’s executive order on trans youth health care fudges facts",
    "description": "How accurate are claims from President Donald Trump's executive order about gender-affirming care? PolitiFact has answers.",
    "link": "https://www.statesman.com/story/news/politics/politifact/2025/02/09/trumps-executive-order-on-trans-youth-health-care-fudges-facts/78331559007/",
    "timestamp": "2025-02-09T11:11:10Z"
  },
  {
    "title": "Trump is making himself inescapable",
    "description": "Last year, President Joe Biden passed up a chance to be interviewed on the highly rated Super Bowl pregame show. This year, not only is President Donald Trump being interviewed, he is coming here for the big game in person.\nBy becoming the first sitting presi…",
    "link": "https://biztoc.com/x/a1408db28126144a",
    "timestamp": "2025-02-09T11:08:56Z"
  },
  {
    "title": "Inside the 'lawfare' plot to sabotage DOGE",
    "description": "Donald Trump's ambitious plan to overhaul the wasteful federal government is rapidly becoming mired in the 'lawfare' that plagued his first administration. Elon Musk's Department of Government Efficiency (DOGE) has been tearing through Washington at warp spee…",
    "link": "https://freerepublic.com/focus/f-news/4296177/posts",
    "timestamp": "2025-02-09T11:08:39Z"
  },
  {
    "title": "From bagels to ‘Canadianos,’ Trump tariff threat inspires symbolic acts of patriotism",
    "description": "U.S. President Donald Trump’s threats to impose across-the-board tariffs on Canada — not to mention his musings about making the country the 51st American state — have unleashed an uncharacteristic wave of patriotism across the country, marked by acts big and…",
    "link": "https://financialpost.com/pmn/from-bagels-to-canadianos-trump-tariff-threat-inspires-symbolic-acts-of-patriotism",
    "timestamp": "2025-02-09T11:02:18Z"
  },
  {
    "title": "What you need to know about the Patriots for Europe summit",
    "description": "Sovereignty is firmly back on the table as Patriots say an 'era' has come to a close.",
    "link": "https://www.euractiv.com/section/politics/news/what-you-need-to-know-about-the-patriots-for-europe-summit/",
    "timestamp": "2025-02-09T11:01:51Z"
  },
  {
    "title": "Trump’s desire for Greenland sets feelings on fire in the Arctic | CNN",
    "description": "CNN’s Donie O’Sullivan went to Nuuk to hear what people were saying about President Trump’s desire for control over Greenland.",
    "link": "https://www.cnn.com/2025/02/09/americas/greenland-views-on-trump/index.html",
    "timestamp": "2025-02-09T11:00:48Z"
  },
  {
    "title": "The Lessons From 2024 Democrats Really Need Right Now",
    "description": "While post-election recriminations won’t do Democrats much good, some lessons from 2024 on issues like inflation, immigration, threats to democracy, and the deep-seated desire for change, can help them deal with Trump in 2025.",
    "link": "http://nymag.com/intelligencer/article/the-lessons-from-2024-that-democrats-need-now-against-trump.html",
    "timestamp": "2025-02-09T11:00:48Z"
  }
]