[
  {
    "title": "Nebraskans raise concerns about health care cuts in fed budget reconciliation",
    "description": "Nebraskans who attended Monday say they want Congress to consider the negative impacts of possible health care cuts.",
    "link": "https://www.1011now.com/2025/06/24/nebraskans-raise-concerns-about-health-care-cuts-fed-budget-reconciliation/",
    "timestamp": "2025-06-24T16:57:56Z"
  },
  {
    "title": "New York City Mayor Election: Updates on Cuomo, Mamdani & More",
    "description": "Former Governor Andrew Cuomo and fellow mayoral candidate Zohran Mamdani were leading in the polls. Get an update on the primary Democratic election here.",
    "link": "https://hollywoodlife.com/2025/06/24/new-york-city-mayor-election-updates/",
    "timestamp": "2025-06-24T16:57:47Z"
  },
  {
    "title": "'Go Ahead and Try Impeaching Me Again -- MAKE MY DAY!' Trump Mocks 'Stupid' AOC, 'Low IQ' Crockett",
    "description": "President Donald Trump mocked far leftist Rep. Alexandria Ocasio-Cortez (D-NY) and others for wanting to impeach him, daring them to \"MAKE MY DAY.\"\nThe post ‘Go Ahead and Try Impeaching Me Again — MAKE MY DAY!’ Trump Mocks ‘Stupid’ AOC, ‘Low IQ’ Crockett appe…",
    "link": "https://www.breitbart.com/pre-viral/2025/06/24/go-ahead-try-me-impeaching-me-again-make-my-day-trump-mocks-stupid-aoc-low-iq-crockett/",
    "timestamp": "2025-06-24T16:55:59Z"
  },
  {
    "title": "Western Canada holds potential to become a ‘critical minerals processing behemoth,’ expert says",
    "description": "Western Canada could be a hub for critical minerals processing according to two new reports that look at opportunities for nine metals. Read on.",
    "link": "https://financialpost.com/commodities/mining/western-canada-critical-minerals-processing-behemoth",
    "timestamp": "2025-06-24T16:55:28Z"
  },
  {
    "title": "Slog AM: Trump Fails to Mediate War Via Social Media, ICE Has Detained More Immigrants Than Ever, and the Supreme Court Could Give a Shit About Doing Anything About It",
    "description": "The Stranger's morning news roundup.\n \n by Megan Seling\n \n \n \n The War Is Over! (If You Want It): On Monday evening, Israel and Iran supposedly “agreed” to a ceasefire to end a war that began on June 12, according to a delusional Trump and ABC News. Trump pos…",
    "link": "https://www.thestranger.com/slog-am/2025/06/24/80115623/slog-am-trump-fails-to-mediate-war-via-social-media-ice-has-detained-more-immigrants-than-ever-and-the-supreme-court-could-give-a-shit-abou",
    "timestamp": "2025-06-24T16:55:00Z"
  },
  {
    "title": "Trump is trying to script the perfect ending to war in Iran. Will the rest of the world go along?",
    "description": "President Trump orchestrated a brief but explosive intervention in the Middle East, culminating in a ceasefire between Israel and Iran, which he dubbed \"THE 12 DAY WAR.\" Despite initial praise, the ceasefire's stability remains uncertain, with lingering quest…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-is-trying-to-script-the-perfect-ending-to-war-in-iran-will-the-rest-of-the-world-go-along/articleshow/122052920.cms",
    "timestamp": "2025-06-24T16:53:32Z"
  },
  {
    "title": "Trump faces new trouble as Al Green drops explosive article of impeachment in D.C. showdown",
    "description": "In Washington, Al Green has initiated impeachment proceedings against Donald Trump. Green alleges that Trump's military action in Iran bypassed Congressional approval. This move reignites debates on presidential war powers. The White House defends Trump, citi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-faces-new-trouble-as-al-green-drops-explosive-article-of-impeachment-in-d-c-showdown/articleshow/122052450.cms",
    "timestamp": "2025-06-24T16:52:44Z"
  },
  {
    "title": "‘Golden Dome’ comprehensive weapons defenses in the works as lawmakers make Trump dream a reality",
    "description": "Legislation builds on former President Ronald Reagan's \"Star Wars\" legacy with advanced technology to counter Iranian, Russian and Chinese missile capabilities.",
    "link": "https://www.foxnews.com/politics/us-golden-dome-comprehensive-weapons-defenses-works-lawmakers-make-trump-dream-reality",
    "timestamp": "2025-06-24T16:51:56Z"
  },
  {
    "title": "Sae Joon Park, US war hero, self-deports after 50 years — sparks outrage over immigration system",
    "description": "Sae Joon Park, a US Army veteran, faced deportation to South Korea. He served in the US Army and earned a Purple Heart. Drug charges and a missed court appearance from years ago triggered the deportation. Park attributes his legal issues to untreated PTSD aft…",
    "link": "https://economictimes.indiatimes.com/news/international/us/sae-joon-park-us-war-hero-self-deports-after-50-years-sparks-outrage-over-immigration-system-us-immigration-news-sae-joon-park-deportation-news/articleshow/122052287.cms",
    "timestamp": "2025-06-24T16:51:53Z"
  },
  {
    "title": "Cuomo is trying a comeback in New York’s mayoral primary, but Zohran Mamdani stands in his way",
    "description": "A winner might not emerge for a week because of the city’s ranked choice voting system.",
    "link": "https://www.bostonherald.com/2025/06/24/new-york-mayor-primary/",
    "timestamp": "2025-06-24T16:50:58Z"
  },
  {
    "title": "Duo Still Pressing for House War Powers Resolution on Iran, but Speaker Says It’s Not ‘Necessary’",
    "description": "Reps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif., are spearheading a war powers resolution that would direct President Donald Trump to cease using the military... Read More\nThe post Duo Still Pressing for House War Powers Resolution on Iran, but Speaker Sa…",
    "link": "https://www.dailysignal.com/2025/06/24/war-powers-resolution-introduced-house-curb-trumps-power/",
    "timestamp": "2025-06-24T16:50:50Z"
  },
  {
    "title": "Ceasefire? Nah. Trump’s Faux ‘Peace Deal’ Crumbles As Israel Vows Retaliation Against Iran",
    "description": "Donald Trump’s ceasefire deal collapses as Israel vows to retaliate against Iran for missle strike \nThe post Ceasefire? Nah. Trump’s Faux ‘Peace Deal’ Crumbles As Israel Vows Retaliation Against Iran appeared first on Bossip.",
    "link": "https://bossip.com/3231332/donald-trump-ceasefire-violated/",
    "timestamp": "2025-06-24T16:50:45Z"
  },
  {
    "title": "S&P 500, Nasdaq near record highs, Dow Jones soars 500 points on Israel-Iran ceasefire hopes",
    "description": "Wall Street's S&P 500 approached a record high following a ceasefire announcement regarding Israel and Iran, coupled with Federal Reserve Chair Jerome Powell's cautious stance on interest rate cuts. Financial and technology sectors led the market rally, while…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-near-record-highs-dow-jones-soars-500-points-on-israel-iran-ceasefire-hopes/articleshow/122052888.cms",
    "timestamp": "2025-06-24T16:50:02Z"
  },
  {
    "title": "Ivanka Trump and Jared Kushner Are Investing $1.4 Billion To Turn Abandoned Soviet Weapons Base in Albania Into Luxury Island Resort",
    "description": "Trump and Kushner are set to begin building a luxury resort on an Albanian island that once served as a Soviet weapons base.",
    "link": "https://www.yahoo.com/lifestyle/articles/ivanka-trump-jared-kushner-investing-164900790.html",
    "timestamp": "2025-06-24T16:49:00Z"
  },
  {
    "title": "Jeff Bezos forced to move wedding after protests in Venice",
    "description": "The wedding party of the billionaire Amazon founder and his journalist fiancee Lauren Sanchez has been moved after weeks of protests against plans to transform Venice into a \"private amusement park\".",
    "link": "https://www.abc.net.au/news/2025-06-25/jeff-bezos-moves-wedding/105456664",
    "timestamp": "2025-06-24T16:47:49Z"
  },
  {
    "title": "NATO chief praises Trump for making Europe ‘pay in a BIG way’ on defense ahead of historic summit",
    "description": "The allies are expected to endorse a goal of spending 5% of their gross domestic product on their security.",
    "link": "https://www.pbs.org/newshour/world/nato-chief-praises-trump-for-making-europe-pay-in-a-big-way-on-defense-ahead-of-historic-summit",
    "timestamp": "2025-06-24T16:47:30Z"
  },
  {
    "title": "Warning for Trump as Surprise Poll Offers Harsh Verdict on Iran Strike",
    "description": "If any political commentators or Democratic politicians are tempted to see the political battle over President Trump’s bombing of Iran through the prism of the runup to the Iraq War two decades ago, here’s a tip: Don’t.\r\nFor politicians and pundits of a certa…",
    "link": "https://newrepublic.com/article/197159/trump-poll-iran-strike-harsh-verdict",
    "timestamp": "2025-06-24T16:47:13Z"
  },
  {
    "title": "House Speaker Johnson argues the War Powers Act is unconstitutional",
    "description": "President Donald Trump called Republican Rep. Thomas Massie, who introduced a War Powers resolution to bar U.S. military engagement in Iran, a \"LOSER.\"",
    "link": "https://biztoc.com/x/997ad5077e0af26d",
    "timestamp": "2025-06-24T16:47:05Z"
  },
  {
    "title": "Off Ramps, On Ramps",
    "description": "Off Ramps, On Ramps\n \nBy Benjamin Picton, Senior Market Strategist at Rabobank\nMarkets are in a jubilant mood as Donald Trump announced that Israel and Iran have agreed to a ceasefire to begin within hours. Brent crude prices have fallen by more than 7% at ti…",
    "link": "https://biztoc.com/x/9a5867ff924ec10d",
    "timestamp": "2025-06-24T16:47:00Z"
  },
  {
    "title": "Lawmaker Slams Trump Admin For Postponing Classified Iran Briefings",
    "description": "Sen. Chuck Schumer has slammed Donald Trump's administration for temporarily canceling Tuesday's Congressional classified briefings on Iran.",
    "link": "https://biztoc.com/x/c4f128e8ce6efea6",
    "timestamp": "2025-06-24T16:47:00Z"
  },
  {
    "title": "Iran’s Pezeshkian expresses ‘regret’ to the emir of Qatar",
    "description": "Iranian president says neither Qatar nor its people were targets of attack on US base in the gas-rich Gulf nation.",
    "link": "https://www.aljazeera.com/news/2025/6/24/irans-pezeshkian-expresses-regret-to-the-emir-of-qatar",
    "timestamp": "2025-06-24T16:46:25Z"
  },
  {
    "title": "Lawmaker Slams Trump Admin For Postponing Classified Iran Briefings",
    "description": "Sen. Chuck Schumer has slammed Donald Trump's administration for temporarily canceling Tuesday's Congressional classified briefings on Iran.",
    "link": "https://www.newsweek.com/lawmaker-slams-trump-admin-postponing-classified-iran-briefings-2090100",
    "timestamp": "2025-06-24T16:45:32Z"
  },
  {
    "title": "Jan. 6 rioters received pardons from Trump, but that didn’t make civil suits go away",
    "description": "A federal jury this week awarded $500,000 to the widow and estate of a police officer who took his own life after the Jan. 6 attack.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jan-6-rioters-received-pardons-trump-didnt-make-civil-suits-go-away-rcna214772",
    "timestamp": "2025-06-24T16:42:59Z"
  },
  {
    "title": "The real crisis behind America's unrest, Trump 'defanged' Iran, and more from Fox News Opinion",
    "description": "Read the latest from Fox News Opinion & watch videos from Sean Hannity, Raymond Arroyo & more.",
    "link": "https://www.foxnews.com/opinion/real-crisis-behind-americas-unrest-trump-defanged-iran-more-from-fox-news-opinion",
    "timestamp": "2025-06-24T16:42:56Z"
  },
  {
    "title": "Steven Van Zandt Recovering from Surgery, Will Miss Upcoming Springsteen Shows",
    "description": "The E Street Band guitarist underwent emergency surgery for appendicitis.\nSteven Van Zandt Recovering from Surgery, Will Miss Upcoming Springsteen Shows\nEddie Fu",
    "link": "https://consequence.net/2025/06/steven-van-zandt-surgery-bruce-springsteen-tour/",
    "timestamp": "2025-06-24T16:42:50Z"
  },
  {
    "title": "The Internet’s Alpha Males Flip-Flop on Trump’s War",
    "description": "After 72 hours of silence, the manosphere's biggest stars are back—and they're praising the war they claimed to oppose.",
    "link": "https://gizmodo.com/the-internets-alpha-males-flip-flop-on-trumps-war-2000619594",
    "timestamp": "2025-06-24T16:42:40Z"
  },
  {
    "title": "Florida's 'Alligator Alcatraz': Krishti Noem spills beans to use federal funds to build 'terrifying' detention center",
    "description": "In Florida, officials have started constructing a migrant detention facility dubbed as 'Alligator Alcatraz' which will be funded by US  Department of Homeland Security. We will expand facilities and bed space in just days, thanks to our partnership with Flori…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/floridas-alligator-alcatraz-krishti-noem-spills-beans-to-use-federal-funds-to-build-terrifying-detention-center/articleshow/122052583.cms",
    "timestamp": "2025-06-24T16:42:36Z"
  },
  {
    "title": "House Speaker Johnson argues the War Powers Act is unconstitutional",
    "description": "President Donald Trump called Republican Rep. Thomas Massie, who introduced a War Powers resolution to bar U.S. military engagement in Iran, a \"LOSER.\"",
    "link": "https://www.cnbc.com/2025/06/24/johnson-war-powers-trump-iran.html",
    "timestamp": "2025-06-24T16:41:25Z"
  },
  {
    "title": "Who’s Predicted To Win NYC Mayoral Primary? Here Are The Betting Odds.",
    "description": "Zohran Mamdani, the socialist state lawmaker running for New York City mayor, could snag the Democratic nomination from former Gov. Andrew Cuomo, betting markets and polls show.",
    "link": "https://www.forbes.com/sites/yezensaadah/2025/06/24/whos-predicted-to-win-nyc-mayoral-primary-here-are-the-betting-odds/",
    "timestamp": "2025-06-24T16:41:01Z"
  },
  {
    "title": "Russia Ukraine war: Russian drones, missiles kill 24, air traffic halted at two Moscow airports. Will Donald Trump, Western forces now join Kyiv?",
    "description": "Russia-Ukraine war have killed more than 12,000 people, according to the United Nations. When will the conflict between Kyiv and Moscow end?",
    "link": "https://economictimes.indiatimes.com/news/international/us/russia-ukraine-war-russian-drones-missiles-kill-24-air-traffic-halted-at-two-moscow-airports-will-donald-trump-western-forces-now-help-kyiv/articleshow/122052650.cms",
    "timestamp": "2025-06-24T16:40:57Z"
  },
  {
    "title": "Disgraced former Rep. Anthony Weiner among scandal-ridden New York City candidates",
    "description": "After a slew of sexting scandals, Weiner attempts another political comeback.",
    "link": "https://abcnews.go.com/Politics/disgraced-former-rep-anthony-weiner-scandal-ridden-new/story?id=123130128",
    "timestamp": "2025-06-24T16:40:32Z"
  },
  {
    "title": "Conservative Strategist Proclaims US Violates Other Countries' Sovereignty 'All the Time' in Defense of Trump's Iran Strikes",
    "description": "A conservative strategist declared that the U.S. violates the sovereignty of other countries \"all the time\" in defense of President Donald Trump's strikes on Iranian nuclear sites.",
    "link": "https://www.ibtimes.com/conservative-strategist-proclaims-us-violates-other-countries-sovereignty-all-time-defense-3776703",
    "timestamp": "2025-06-24T16:40:14Z"
  },
  {
    "title": "Trump: ‘I Don’t Want’ Iran Regime Change, Creates ‘So Much Chaos’",
    "description": "President Donald Trump told reporters on Tuesday that he is not seeking “regime change” in Iran, noting that the endeavor would likely result in “so much chaos.”In response to inquiries about whether there is any desire to try “regime change” — two words that…",
    "link": "https://freerepublic.com/focus/f-news/4325025/posts",
    "timestamp": "2025-06-24T16:39:00Z"
  },
  {
    "title": "Donald Trump's F-bomb on Israel-Iran conflict explodes across social media",
    "description": "President Trump expressed his frustration with Iran and Israel after a ceasefire he brokered quickly fell apart. He criticized both nations for violating the agreement, using strong language during a public statement before departing for a NATO summit. Trump'…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/donald-trumps-f-bomb-on-israel-iran-conflict-explodes-across-social-media/articleshow/122052631.cms",
    "timestamp": "2025-06-24T16:37:58Z"
  },
  {
    "title": "Trump Signals Sanctions Relief for China to Buy Iran’s Oil",
    "description": "\"President Donald Trump said China could purchase oil from Iran, in an apparent reversal of policy after his administration spent months imposing sanctions on Chinese refineries for buying Iranian crude,\" the Financial Times reports. Said",
    "link": "https://politicalwire.com/2025/06/24/trump-signals-sanctions-relief-for-china-to-buy-irans-oil/",
    "timestamp": "2025-06-24T16:37:33Z"
  },
  {
    "title": "He’s Not the Left’s Joe Rogan — But He May Be Even Better",
    "description": "Aaron Parnas has taken off with his endless to-the-point new summaries, meeting his Gen Z peers where they already are: TikTok.",
    "link": "http://www.rollingstone.com/culture/culture-features/aaron-parnas-tiktok-substack-news-1235370720/",
    "timestamp": "2025-06-24T16:37:13Z"
  },
  {
    "title": "Federal Reserve Chair Jerome Powell testifies amid Trump attacks over interest rates",
    "description": "President Donald Trump wants the Federal Reserve to cut interest rates. Fed Chair Jerome Powell says that cannot happen yet.\nThose two competing visions collided Tuesday as Powell defended the central bank's decision to stand pat since the start of the year, …",
    "link": "https://biztoc.com/x/c23bd496427a9c9e",
    "timestamp": "2025-06-24T16:36:20Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "U.S. stock futures are pointing higher after President Donald Trump announced a ceasefire between Israel and Iran; oil futures are dropping on the news, taking shares of energy companies Chevron (CVX), ExxonMobil (XOM), and Occidental (OXY) lower in premarket…",
    "link": "https://biztoc.com/x/5f2d2be3fed8beea",
    "timestamp": "2025-06-24T16:36:11Z"
  },
  {
    "title": "Flatterer-in-chief: How NATO's Rutte worked to win over Trump",
    "description": "Mark Rutte is trying to keep Donald Trump happy. He is doing this with a NATO spending deal. The deal aims to meet Trump's demands. It asks allies to spend five percent of GDP on defence. Rutte used diplomacy and flattery. This approach seeks to avoid conflic…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/flatterer-in-chief-how-natos-rutte-worked-to-win-over-trump/articleshow/122052678.cms",
    "timestamp": "2025-06-24T16:34:55Z"
  },
  {
    "title": "Jerome Powell says Fed is ‘on alert’ for possible Iranian cyber attacks because ‘we’re a target as well’",
    "description": "Hackers connected to the Iranian government have a history of trying to attack U.S. government agencies and the financial sector.",
    "link": "https://fortune.com/2025/06/24/jerome-powell-federal-reserve-iran-cyberattacks-united-states/",
    "timestamp": "2025-06-24T16:34:09Z"
  },
  {
    "title": "Israel kills 40 in Gaza after agreeing to ceasefire with Iran",
    "description": "Israel-Iran deal raises hopes among Palestinians of end to Gaza war",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/24/israel-kills-40-in-gaza-after-agreeing-to-ceasefire-with-iran/",
    "timestamp": "2025-06-24T16:33:25Z"
  },
  {
    "title": "24 Civilians Killed in Ukraine by Russian Drone, Missile, and Artillery Strikes Says Kyiv",
    "description": "Russian drones, missiles and artillery killed at least 24 civilians and injured more than 200 others in Ukraine, officials said Tuesday.\nThe post 24 Civilians Killed in Ukraine by Russian Drone, Missile, and Artillery Strikes Says Kyiv appeared first on Breit…",
    "link": "https://www.breitbart.com/europe/2025/06/24/24-civilians-killed-in-ukraine-by-russian-drone-missile-and-artillery-strikes-says-kyiv/",
    "timestamp": "2025-06-24T16:32:14Z"
  },
  {
    "title": "Trump Mocked for Being 'Grumpy' Over Israel and Iran Ceasefire Tensions: 'He is Desperate for a Nobel Peace Prize'",
    "description": "President Donald Trump is being mocked for his testy response to questions about tensions between Iran and Israel following the declaration of a ceasefire.",
    "link": "https://www.ibtimes.com/trump-mocked-being-grumpy-over-israel-iran-ceasefire-tensions-he-desperate-nobel-peace-3776702",
    "timestamp": "2025-06-24T16:32:13Z"
  },
  {
    "title": "‘Mr President, Dear Donald, Congratulations’: Trump discloses flattering message from Nato chief Rutte",
    "description": "Text message shows extent of efforts to made by officials to curry favour with US president",
    "link": "https://www.irishtimes.com/world/europe/2025/06/24/mr-president-dear-donald-congratulations-trump-discloses-flattering-message-from-nato-chief-rutte/",
    "timestamp": "2025-06-24T16:31:51Z"
  },
  {
    "title": "Trump dares AOC to try to impeach him: 'Make my day'",
    "description": "President Trump fires back at Rep. Ocasio-Cortez's impeachment threats, challenging her to a cognitive test and criticizing other progressive Democrats.",
    "link": "https://www.foxnews.com/politics/trump-dares-aoc-try-impeach-him-make-my-day",
    "timestamp": "2025-06-24T16:30:33Z"
  },
  {
    "title": "Former US nuclear power regulators blast Trump's firing of NRC commissioner",
    "description": "WASHINGTON (Reuters) -Nearly 30 former officials and employees at the U.S. nuclear power regulator on Tuesday blasted President Donald Trump's firing of a...",
    "link": "https://www.yahoo.com/news/former-us-nuclear-power-regulators-162906771.html",
    "timestamp": "2025-06-24T16:29:06Z"
  },
  {
    "title": "'Dear Donald.' Trump posts fawning private text from NATO chief on social media",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_a5b935f1-5859-4297-9508-e5d8427e86e2",
    "timestamp": "2025-06-24T16:28:40Z"
  },
  {
    "title": "What's NATO without America?",
    "description": " Listen to Sky News Daily on your podcast app ",
    "link": "https://news.sky.com/story/whats-nato-without-america-13387982",
    "timestamp": "2025-06-24T16:28:00Z"
  },
  {
    "title": "Supreme Court Blesses Human Trafficking With No Explanation In Stunning Abandonment Of Rule Of Law",
    "description": "The Supreme Court just gave the Trump administration a green light to traffic humans to random countries around the world—including war zones where migrants face torture, slavery, or death. And they did so while offering literally zero explanation for why thi…",
    "link": "https://www.techdirt.com/2025/06/24/supreme-court-blesses-human-trafficking-with-no-explanation-in-stunning-abandonment-of-rule-of-law/",
    "timestamp": "2025-06-24T16:27:00Z"
  },
  {
    "title": "CBS blasts Trump’s lawsuit as ‘meritless’ despite recent $15 million settlement offer",
    "description": "President Trump's election interference lawsuit against CBS was again called meritless despite the network making a $15 million offer to settle it earlier this month.",
    "link": "https://www.foxnews.com/media/cbs-blasts-trumps-lawsuit-meritless-despite-recent-15-million-settlement-offer",
    "timestamp": "2025-06-24T16:26:03Z"
  },
  {
    "title": "Trump administration postpones classified briefings for lawmakers on Iran",
    "description": "Lawmakers are looking for answers about Trump’s directed strikes on Iran.",
    "link": "https://www.bostonherald.com/2025/06/24/mideast-wars-congress/",
    "timestamp": "2025-06-24T16:25:40Z"
  },
  {
    "title": "Iran's military strength is a fraction of Israel's. Tehran still has 3 key cards it can play if the ceasefire falls apart.",
    "description": "Iran retains several strategic options should the fragile ceasefire with Israel, first announced by President Donald Trump, collapse. None are good.",
    "link": "https://www.businessinsider.com/iran-israel-key-responses-if-trump-ceasefire-fails-strait-hormuz-2025-6",
    "timestamp": "2025-06-24T16:24:51Z"
  },
  {
    "title": "CNBC’s Joe Kernen Battles Rand Paul Over Whether He’ll Ever Admit Trump’s Iran Strike Was ‘Brilliant’",
    "description": "Joe Kernen pressed Rand Paul on whether he would flip his criticism of President Donald Trump and praise his strikes on Iran as \"brilliant\" and \"courageous.\"\nThe post CNBC’s Joe Kernen Battles Rand Paul Over Whether He’ll Ever Admit Trump’s Iran Strike Was ‘B…",
    "link": "https://www.mediaite.com/media/tv/cnbcs-joe-kernen-battles-rand-paul-over-whether-hell-ever-admit-trumps-iran-strike-was-brilliant/",
    "timestamp": "2025-06-24T16:24:48Z"
  },
  {
    "title": "Donald Trump’s Nobel Peace prize dream crumbles as nomination is abruptly withdrawn amid global uproar",
    "description": "Donald Trump faces setback as Nobel Peace Prize nomination gets withdrawn. A Ukrainian lawmaker rescinds nomination due to Trump's failure to resolve Ukraine-Russia conflict. Trump's attempts to mediate stalled, drawing criticism for perceived leniency toward…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-nobel-peace-prize-dream-crumbles-as-nomination-is-abruptly-withdrawn-amid-global-uproar/articleshow/122052433.cms",
    "timestamp": "2025-06-24T16:24:45Z"
  },
  {
    "title": "Trump to meet Zelenskyy at NATO summit as Russia-Ukraine war rages on",
    "description": "A two-day NATO summit at The Hague is intended to signal to Russian President Vladimir Putin that the alliance remains united, despite US President Donald Trump's repeated criticisms and threats to pull out if defence spending targets aren't met.",
    "link": "https://www.abc.net.au/news/2025-06-25/nato-summit-the-hague-defence-spending-trump-zelenskyy/105456498",
    "timestamp": "2025-06-24T16:24:08Z"
  },
  {
    "title": "Rogue federal judge says his deportation agenda to protect criminals, overturned by Supreme Court, still stands",
    "description": "'The district court judge in Boston has said he’s going to defy the ruling. So expect fireworks tomorrow when we hold this judge accountable for refusing to obey the Supreme Court'",
    "link": "https://www.wnd.com/2025/06/rogue-federal-judge-says-his-deportation-agenda-protect/",
    "timestamp": "2025-06-24T16:23:43Z"
  },
  {
    "title": "GOP Rep. Massie: 'I Have the Trump Antibodies'",
    "description": "Representative Thomas Massie (R-KY) said Monday on MSNBC's \"All In\" that he was not bothered by President Donald Trump's criticisms because he had developed what he called \"Trump antibodies.\"\nThe post GOP Rep. Massie: ‘I Have the Trump Antibodies’ appeared fi…",
    "link": "https://www.breitbart.com/clips/2025/06/24/gop-rep-massie-i-have-the-trump-antibodies/",
    "timestamp": "2025-06-24T16:23:15Z"
  },
  {
    "title": "South Dakota eager for Trump’s statue garden near Mount Rushmore despite local opposition",
    "description": "The Black Hills are a longstanding point of contention between South Dakota and its tribes.",
    "link": "https://www.bostonherald.com/2025/06/24/trump-statue-garden/",
    "timestamp": "2025-06-24T16:23:12Z"
  },
  {
    "title": "Trump blasts Israel as it threatens fragile ceasefire with Iran",
    "description": "\"I'm not happy with Israel,” Trump told reporters, after Israeli fire threatened a fragile ceasefire with Iran. \"They don’t know what the fuck they’re doing,\" the president continued, referring to both of the countries.",
    "link": "https://mondoweiss.net/2025/06/trump-blasts-israel-as-it-threatens-fragile-ceasefire-with-iran/",
    "timestamp": "2025-06-24T16:23:06Z"
  },
  {
    "title": "Trump Took a Break from Bragging About His “Ceasefire” to Insult AOC",
    "description": "Seems like it’s back to regularly scheduled programming from our mentally unstable president.",
    "link": "https://www.esquire.com/news-politics/politics/a65172140/trump-ceasefire-truth-social-posts/",
    "timestamp": "2025-06-24T16:23:00Z"
  },
  {
    "title": "Group calls for boycott of McDonald's for scaling back its DEI initiatives",
    "description": "The grassroots progressive group The People’s Union USA, has called for an “economic blackout” of the fast food giant.",
    "link": "https://www.nbcnews.com/news/nbcblk/mc-donalds-boycott-dei-economic-blackout-rcna214733",
    "timestamp": "2025-06-24T16:22:59Z"
  },
  {
    "title": "Establishment Dems Suffer Huge Blow in Ranking Oversight Member Vote",
    "description": "Representative Robert Garcia was elected Tuesday to become the Democrats’ newest ranking member on the House Oversight Committee, potentially marking a changing tide in the Democratic Party. \r\nForty-seven-year-old Garcia, who is only on his second term in Con…",
    "link": "https://newrepublic.com/post/197163/democrats-oversight-ranking-member-robert-garcia",
    "timestamp": "2025-06-24T16:22:42Z"
  },
  {
    "title": "Melinda French Gates takes aim at Trump's billionaire tech titans after ex-husband Bill's chat with president",
    "description": "Melinda French Gates has made a glaring dig at Donald Trump's tech billionaire friends for not staying true to their values. The billionaire philanthropist and businesswoman, 60, voiced her concern over Silicon Valley's political shift to the right and argued…",
    "link": "https://freerepublic.com/focus/f-chat/4325019/posts",
    "timestamp": "2025-06-24T16:21:12Z"
  },
  {
    "title": "Charlamagne tha God: Democrats 'Sound Like Hypocrites' for Demanding Congressional Approval for Iran Strikes",
    "description": "Left-wing radio host Charlamagne tha God said Democrat lawmakers \"sound like hypocrites\" for demanding President Donald Trump seek congressional approval for bombing Iranian nuclear facilities, noting that past presidents have taken similar action, and it nev…",
    "link": "https://www.breitbart.com/entertainment/2025/06/24/charlamagne-tha-god-democrats-sound-like-hypocrites-for-demanding-congressional-approval-for-iran-strikes/",
    "timestamp": "2025-06-24T16:20:47Z"
  },
  {
    "title": "Bombshell whistleblower letter reveals 'lawlessness' inside Trump's DOJ",
    "description": "Senior Justice Department official Emile Bove told lawyers under him that he was willing to ignore court orders to ensure President Donald Trump got what he wanted, a whistleblower letter to the Senate said.Bove, Trump's former personal lawyer, has been nomin…",
    "link": "https://www.rawstory.com/emil-bove-2672425606/",
    "timestamp": "2025-06-24T16:20:32Z"
  },
  {
    "title": "Battery CEO Says US Senate’s Clean Energy Bill Is ‘Workable’",
    "description": "Battery storage company Fluence Energy Inc. said it can work with US Senate Republicans’ latest version of President Donald Trump’s fiscal package, which would preserve tax credits for the industry while gutting incentives for wind and solar power.",
    "link": "https://financialpost.com/pmn/business-pmn/battery-ceo-says-us-senates-clean-energy-bill-is-workable",
    "timestamp": "2025-06-24T16:20:14Z"
  },
  {
    "title": "Meghan McCain and Ben Domenech’s Relationship Timeline",
    "description": "Meghan McCain and Ben Domenech have been going strong for nearly two decades. Although it’s unclear when they met, the twosome began dating around 2014 and got engaged in July 2017. “We’ve been together for years and we have been engaged for a while,” McCain …",
    "link": "https://www.usmagazine.com/celebrity-news/news/meghan-mccain-and-ben-domenechs-relationship-timeline/#article",
    "timestamp": "2025-06-24T16:19:47Z"
  },
  {
    "title": "Powell says Fed can wait to reduce interest rates as Trump demands cuts",
    "description": "WASHINGTON (AP) — The Federal Reserve will continue to wait and see how the economy evolves before deciding whether to reduce its key interest rate, Chair Jerome Powell said Tuesday, a stance directly at odds with President Donald Trump’s calls for immediate …",
    "link": "https://financialpost.com/pmn/powell-says-fed-can-wait-to-reduce-interest-rates-as-trump-demands-cuts",
    "timestamp": "2025-06-24T16:18:53Z"
  },
  {
    "title": "Exclusive — Energy Secretary Chris Wright: Price of Oil Vindicates 'Trump's Agenda of Energy Dominance'",
    "description": "Energy Secretary Chris Wright on Tuesday walked through what the U.S. has done to become \"energy dominant\" under the leadership of President Donald Trump, explaining that the price of oil is a \"great testament\" to this agenda.\nThe post Exclusive — Energy Secr…",
    "link": "https://www.breitbart.com/politics/2025/06/24/exclusive-energy-secretary-chris-wright-price-of-oil-vindicates-trumps-agenda-of-energy-dominance/",
    "timestamp": "2025-06-24T16:18:05Z"
  },
  {
    "title": "'Declaring War Is Our Job,' Declare Congressmen Who Never Do Their Job",
    "description": "WASHINGTON, D.C. — Ongoing hostilities in the Middle East raised tensions in the nation's capital as well, with frustrated legislators who fail to meet their responsibilities on a daily basis reminded everyone that launching military actions was their respons…",
    "link": "https://freerepublic.com/focus/f-bloggers/4325017/posts",
    "timestamp": "2025-06-24T16:17:02Z"
  },
  {
    "title": "Jerome Powell says rate cuts can wait as Federal Reserve studies tariff impacts",
    "description": "Federal Reserve Chair Jerome Powell indicated to Congress that potential tariff-driven inflation this summer will influence the Fed's consideration of rate cuts. Despite pressure for immediate rate cuts, Powell emphasized a cautious approach, citing a strong …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/jerome-powell-says-rate-cuts-can-wait-as-federal-reserve-studies-tariff-impacts/articleshow/122052487.cms",
    "timestamp": "2025-06-24T16:15:32Z"
  },
  {
    "title": "Today’s News in a Nutshell",
    "description": "KATHMANDU: Khabarhub brings you a glimpse of major developments of the day in Nepal, including politics, business/economy, sports, entertainment, and more. House passes Appropriation Bill 2025 The House of Representatives on Tuesday passed the Appropriation B…",
    "link": "https://english.khabarhub.com/2025/24/480132/",
    "timestamp": "2025-06-24T16:15:20Z"
  },
  {
    "title": "Trump Appointee Prosecuting LA Protesters Defended Jan. 6 Suspects",
    "description": "Bill Essayli once warned Jan. 6 prosecutions would “criminalize political differences.” Now he’s throwing the book at anti-ICE protesters.\nThe post Trump Appointee Prosecuting LA Protesters Defended Jan. 6 Suspects appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/24/trump-bill-essayli-la-protests-ice/",
    "timestamp": "2025-06-24T16:15:17Z"
  },
  {
    "title": "WATCH: Matt Gaetz Caught Getting Scolded By His Mom For Criticizing Trump",
    "description": "Former Rep. Matt Gaetz (R-FL) was caught on camera getting scolded by his own mother for his recent criticism of President Donald Trump.\nThe post WATCH: Matt Gaetz Caught Getting Scolded By His Mom For Criticizing Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/watch-matt-gaetz-caught-getting-scolded-by-his-mom-for-criticizing-trump/",
    "timestamp": "2025-06-24T16:14:08Z"
  },
  {
    "title": "Donald Trump Faces New Articles of Impeachment Over Iran Strikes",
    "description": "Congressman Al Greene introduced the articles, which accuse the president of starting an \"illegal and unconstitutional war.\"",
    "link": "https://biztoc.com/x/437b42f103865c87",
    "timestamp": "2025-06-24T16:13:55Z"
  },
  {
    "title": "From Fordow to Fallout: Global Hegemony on Trial",
    "description": "This article was written and submitted before the latest development in the Iran-Israel-U.S. crisis: the announcement by U.S. President Donald Trump of an agreed cease-fire between Iran and Israel, subsequently confirmed by Iranian state television. While the…",
    "link": "https://www.commondreams.org/opinion/iran-attack-hegemony",
    "timestamp": "2025-06-24T16:11:30Z"
  },
  {
    "title": "‘Bibi Got His *sshole Ripped’: Marc Caputo Tells Steve Bannon Trump Dressed Down Netanyahu as Ceasefire Faltered",
    "description": "President Donald Trump tore Israeli Prime Minister Benjamin Netanyahu a new one in a fiery Tuesday morning phone call, Marc Caputo told Steve Bannon.\nThe post ‘Bibi Got His *sshole Ripped’: Marc Caputo Tells Steve Bannon Trump Dressed Down Netanyahu as Ceasef…",
    "link": "https://www.mediaite.com/media/news/bibi-got-his-sshole-ripped-marc-caputo-tells-steve-bannon-trump-dressed-down-netanyahu-as-ceasefire-faltered/",
    "timestamp": "2025-06-24T16:10:23Z"
  },
  {
    "title": "Netanyahu sees redemption in Iran war, but Gaza looms large",
    "description": "Israel's strike on Iran, ordered by Prime Minister Netanyahu, has significantly altered his political standing after facing criticism for the October 7th security failure. The operation, which targeted Iranian nuclear and missile facilities, led to a ceasefir…",
    "link": "https://economictimes.indiatimes.com/news/defence/netanyahu-sees-redemption-in-iran-war-but-gaza-looms-large/articleshow/122052434.cms",
    "timestamp": "2025-06-24T16:09:57Z"
  },
  {
    "title": "AOC Blasts Trump For His Moronic Truth Social Diatribe",
    "description": "Donald Trump attacked Rep. Alexandria Ocasio-Cortez after she called for his impeachment for attacking Iran without congressional approval.\nThe Queens congresswoman clapped back at Demented Donald.\nMr. President, don’t take your anger out on me - I’m just a s…",
    "link": "https://crooksandliars.com/2025/06/aoc-blasts-trump-his-moronic-truth-social",
    "timestamp": "2025-06-24T16:09:39Z"
  },
  {
    "title": "Mozambique: IS-linked group behind mass child kidnappings",
    "description": "The group Human Rights Watch (HRW) has claimed that the Islamist group al-Shabab has abducted hundreds of children this year. The children are forced into fighting, labor or even marriage.",
    "link": "https://www.dw.com/en/mozambique-is-linked-group-behind-mass-child-kidnappings/a-73025683",
    "timestamp": "2025-06-24T16:09:00Z"
  },
  {
    "title": "'Declaring War Is Our Job,' Declare Congressmen Who Never Do Their Job",
    "description": "WASHINGTON, D.C. — Ongoing hostilities in the Middle East raised tensions in the nation's capital as well, with frustrated legislators who fail to meet their responsibilities on a daily basis reminded everyone that launching military actions was their respons…",
    "link": "https://babylonbee.com/news/declaring-war-is-our-job-declare-congressmen-who-never-do-their-job",
    "timestamp": "2025-06-24T16:07:10Z"
  },
  {
    "title": "Pedro Pascal on calling out JK Rowling’s ‘loser behaviour’: ‘I want to protect the people I love’",
    "description": "Pedro Pascal has admitted that he worried whether or not he was helping the trans community after he called out JK Rowling. The actor, whose sister Lux is trans, criticised the author following the outcome of the UK Supreme Court ruling in April about how the…",
    "link": "https://www.thepinknews.com/2025/06/24/pedro-pascal-jk-rowling-trans/",
    "timestamp": "2025-06-24T16:06:27Z"
  },
  {
    "title": "Donald Trump Faces New Articles of Impeachment Over Iran Strikes",
    "description": "Congressman Al Greene introduced the articles, which accuse the president of starting an \"illegal and unconstitutional war.\"",
    "link": "https://www.newsweek.com/donald-trump-faces-new-articles-impeachment-over-iran-strikes-2090074",
    "timestamp": "2025-06-24T16:05:55Z"
  },
  {
    "title": "High tariffs give Trump less room for error in Iran | CNN Business",
    "description": "The US economy needs the fragile ceasefire President Donald Trump brokered in the Middle East to hold.",
    "link": "https://www.cnn.com/2025/06/24/economy/oil-prices-iran-israel-ceasefire",
    "timestamp": "2025-06-24T16:05:40Z"
  },
  {
    "title": "UN official gave Israel cover – and Iran paid the price",
    "description": "The IAEA chief’s ambiguous language helped justify illegal military action Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620434-iaea-grossi-iran-israel/",
    "timestamp": "2025-06-24T16:05:30Z"
  },
  {
    "title": "From WhatsApp to TikTok: App bans that have swept US government devices",
    "description": "WhatsApp is the latest in the list of apps that were banned on US government devices over privacy and security concerns.",
    "link": "https://economictimes.indiatimes.com/tech/technology/from-whatsapp-to-tiktok-app-bans-that-have-swept-us-government-devices/articleshow/122052318.cms",
    "timestamp": "2025-06-24T16:05:23Z"
  },
  {
    "title": "What Tariffs Will — and Won’t — Change for U.S. Bitcoin Miners",
    "description": "Hashrate growth is going to slow down in the United States. But it won’t be just because of tariffs.",
    "link": "https://www.coindesk.com/news-analysis/2025/06/24/what-tariffs-will-and-wont-change-for-us-bitcoin-miners",
    "timestamp": "2025-06-24T16:05:07Z"
  },
  {
    "title": "Trump Is Botching the Bombing of Iran (Will Saletan/The Bulwark)",
    "description": "Will Saletan / The Bulwark:\nTrump Is Botching the Bombing of Iran  —  His lies and gaffes are making a mess of the mission and its aftermath.  —  Notes  —  DONALD TRUMP'S FLUFFERS say he's the genius behind Saturday's bombing of the Iranian nuclear program.  …",
    "link": "https://www.memeorandum.com/250624/p67",
    "timestamp": "2025-06-24T16:05:00Z"
  },
  {
    "title": "Trump Admin Ordered To Return Man Deported To El Salvador",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's administration has been ordered to return a Salvadoran man who was deported minutes after a federal appeals court blocked his removal.\nJordin Melgar-Salmeron was deported to El Salvado…",
    "link": "https://biztoc.com/x/845213820d31dd17",
    "timestamp": "2025-06-24T16:03:17Z"
  },
  {
    "title": "Trump Complains Biden Let Thunderstorms Into the U.S.",
    "description": "President Donald Trump got a little tongue-tied speaking with reporters on Air Force One, appearing to suggest his predecessor had left the United States...",
    "link": "https://www.thedailybeast.com/trump-complains-joe-biden-let-thunderstorms-into-the-united-states/",
    "timestamp": "2025-06-24T16:03:09Z"
  },
  {
    "title": "Donald Trump Sends New 'Vacation' Warning to Republicans",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump issued a new warning to Republicans on Capitol Hill over his \"big, beautiful bill.\"\nThe president posted on Truth Social on Tuesday, \"Now that we have made PEACE abroad, we must finish t…",
    "link": "https://biztoc.com/x/343588ba2a75b4a7",
    "timestamp": "2025-06-24T16:02:58Z"
  },
  {
    "title": "Trump's Fragile Ceasefire: Israel and Iran “Don't Know What the F--k They’re Doing”",
    "description": "On TruthSocial, the president is taking a victory lap after announcing a truce between Israel and Iran. But will the peace hold?",
    "link": "https://www.vanityfair.com/news/story/trump-israel-iran-ceasefire-agreement",
    "timestamp": "2025-06-24T16:02:51Z"
  },
  {
    "title": "Trump says Iran and Israel agreed to ceasefire",
    "description": "What happened\nIsrael and Iran said Tuesday morning they had agreed to a ceasefire announced by President Donald Trump late Monday, though Israel accused Tehran of immediately violating the deal. Trump proclaimed an end to \"what should be called the 12-day war…",
    "link": "https://biztoc.com/x/5ee71f71426770ca",
    "timestamp": "2025-06-24T16:02:45Z"
  },
  {
    "title": "Donald Trump Sends New 'Vacation' Warning to Republicans",
    "description": "The One Big Beautiful Bill Act is central to Trump's economic agenda and Republican hopes of reshaping federal spending.",
    "link": "https://www.newsweek.com/trump-vacation-warning-house-senate-republicans-budget-bill-2090073",
    "timestamp": "2025-06-24T16:01:50Z"
  }
]