[
  {
    "title": "Don Lemon Was Arrested After Covering a Minnesota Protest",
    "description": "On Thursday, federal agents arrested Don Lemon — former CNN anchor and a longtime critic of President Donald Trump — after he covered an anti-ICE protest at a church in Minnesota.",
    "link": "http://www.thecut.com/article/don-lemon-was-arrested-after-covering-a-minnesota-protest.html",
    "timestamp": "2026-01-30T16:12:06Z"
  },
  {
    "title": "DOJ releases new trove of long-awaited Epstein files",
    "description": "The Department of Justice on Friday resumed releasing more of the long-awaited investigative files relating to the late sex offender Jeffrey Epstein",
    "link": "https://www.nbcnews.com/politics/justice-department/doj-releases-new-trove-long-awaited-epstein-files-rcna256714",
    "timestamp": "2026-01-30T16:11:39Z"
  },
  {
    "title": "Justice Department releasing 3 million pages from its Jeffrey Epstein files",
    "description": "It includes some of the several million pages of records withheld from an initial release.",
    "link": "https://www.bostonherald.com/2026/01/30/more-epstein-files-released/",
    "timestamp": "2026-01-30T16:11:15Z"
  },
  {
    "title": "Justice Department releasing 3 million pages from its Jeffrey Epstein files",
    "description": "It includes some of the several million pages of records withheld from an initial release.",
    "link": "https://www.denverpost.com/2026/01/30/more-epstein-files-released/",
    "timestamp": "2026-01-30T16:11:15Z"
  },
  {
    "title": "What Trump’s Fed Pick Kevin Warsh Means for Crypto",
    "description": "U.S. President Donald Trump has nominated Kevin Warsh to replace Jerome Powell, elevating a former Fed governor with mixed views on crypto.",
    "link": "https://decrypt.co/356486/what-trumps-fed-pick-kevin-warsh-means-for-crypto",
    "timestamp": "2026-01-30T16:10:58Z"
  },
  {
    "title": "Trump reveals Fed boss nominee",
    "description": "US President Donald Trump has nominated Kevin Warsh to serve as Federal Reserve chair Read Full Article at RT.com",
    "link": "https://www.rt.com/business/631780-trump-kevin-warsh-fed/",
    "timestamp": "2026-01-30T16:10:21Z"
  },
  {
    "title": "Rooftop Solar Panels By Subscription: Up To 50% Savings On Electricity Bills",
    "description": "The US startup Terra Energy is expanding its subscription-based rooftop solar panel business in California, Florida, and Texas, the three hottest solar markets in the US.\nThe post Rooftop Solar Panels By Subscription: Up To 50% Savings On Electricity Bills ap…",
    "link": "https://cleantechnica.com/2026/01/30/rooftop-solar-panels-by-subscription-up-to-50-savings-on-electricity-bills/",
    "timestamp": "2026-01-30T16:10:03Z"
  },
  {
    "title": "Trump moves to take over LA wildfire rebuilding with new executive order",
    "description": "President Donald Trump has signed an executive order intended to allow him to take over Los Angeles wildfire recovery efforts from local and state authorities. Over 16,000 structures were destroyed across the Pacific Palisades and Altadena in wildfires in ear…",
    "link": "https://archinect.com/news/article/150522291/trump-moves-to-take-over-la-wildfire-rebuilding-with-new-executive-order",
    "timestamp": "2026-01-30T16:10:00Z"
  },
  {
    "title": "Bombardier warns of ‘significant impact’ to air traffic if Trump carries out threat to decertify Canadian planes",
    "description": "President Trump accuses Canada of 'illegally' refusing to certify U.S. aircraft and threatens 50% tariffs and on Canadian planes. Read on",
    "link": "https://financialpost.com/transportation/airlines/trump-takes-aim-bombardier-decertification-tariff-threats",
    "timestamp": "2026-01-30T16:08:37Z"
  },
  {
    "title": "AmEx projects upbeat 2026 profit as affluent spending holds up; shares dip",
    "description": "American Express forecast annual profit largely above Wall Street expectations on Friday, underscoring resilient spending by its young and affluent customers, but a small miss on holiday-quarter profit weighed on its shares.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/amex-projects-upbeat-2026-profit-as-affluent-spending-holds-up-shares-dip/articleshow/127805361.cms",
    "timestamp": "2026-01-30T16:08:32Z"
  },
  {
    "title": "Eli Lilly to build $3.5 billion Pennsylvania plant in US manufacturing push",
    "description": "WASHINGTON, Jan 30 (Reuters) - Eli Lilly announced on Friday that it will build a pharmaceutical manufacturing facility in Pennsylvania, its fourth new site ...",
    "link": "https://finance.yahoo.com/news/eli-lilly-build-3-5-160649482.html",
    "timestamp": "2026-01-30T16:08:24Z"
  },
  {
    "title": "Trump says airlines can fly to Venezuela again — and American wants to be the first to return",
    "description": "American Airlines is the first airline to announce plans to reinstate flights to Venezuela, adding that it would share details \"in the coming months.\"",
    "link": "https://www.businessinsider.com/trump-american-airlines-fly-to-venezuela-announces-plans-2026-1",
    "timestamp": "2026-01-30T16:08:05Z"
  },
  {
    "title": "Judge Bars Prosecutors From Seeking Death Penalty Against Luigi Mangione",
    "description": "A judge has ruled that federal prosecutors can’t seek the death penalty against Luigi Mangione in the killing of UnitedHealthcare CEO Brian Thompson.",
    "link": "https://www.huffpost.com/entry/luigi-mangione-no-death-penalty_n_697cd5a0e4b0c378a7e7eb22",
    "timestamp": "2026-01-30T16:07:50Z"
  },
  {
    "title": "Crisis poised to trigger 'imminent financial collapse' across the world: UN chief",
    "description": "Weeks after President Donald Trump\r\n withdrew the US from dozens of United Nations\r\n organizations, the UN’s chief warns that the UN is at risk of an “imminent financial collapse.”“The crisis is deepening, threatening program delivery and risking financial co…",
    "link": "https://www.rawstory.com/crisis-poised-to-trigger-imminent-financial-collapse-across-the-world-by-july-un-chief/",
    "timestamp": "2026-01-30T16:07:46Z"
  },
  {
    "title": "With gold and silver plunging, ETFs crash as investors book profits",
    "description": "Gold and silver prices plummet as investors cash out, driven by a stronger dollar and new Fed leadership.",
    "link": "https://www.thehindubusinessline.com/markets/gold/with-gold-and-silver-plunging-etfs-crash-as-investors-book-profits/article70570691.ece",
    "timestamp": "2026-01-30T16:07:26Z"
  },
  {
    "title": "South Africa and Israel expel envoys in deepening feud",
    "description": "South Africa ordered Israel’s top diplomat to leave the country within 72 hours on Friday, citing a “series of violations” and prompting the Israeli government to expel Pretoria’s own diplomatic representative. Ties between the nations are already strained by…",
    "link": "https://www.digitaljournal.com/world/south-africa-and-israel-expel-envoys-in-deepening-feud/article",
    "timestamp": "2026-01-30T16:07:20Z"
  },
  {
    "title": "EXCLUSIVE: Epstein emails to be released as DOJ says no criminal or inappropriate conduct by Trump",
    "description": "FIRST ON FOX: The Justice Department is releasing Jeffrey Epstein’s personal emails on Friday, with Deputy Attorney General Todd Blanche telling Fox News Digital that “in none of these communications, even when doing his best to disparage President Trump, did…",
    "link": "https://www.foxnews.com/politics/exclusive-epstein-emails-released-doj-says-no-criminal-inappropriate-conduct-trump",
    "timestamp": "2026-01-30T16:07:13Z"
  },
  {
    "title": "Trump Admin Tries To Step In As Reports Surface That Iran Will Execute 19-Year-Old Wrestling Star",
    "description": "The Trump admin is intervening as reports indicate Iran is preparing to execute a 19-year-old wrestling champion for his involvement in anti-regime protests.",
    "link": "https://dailycaller.com/2026/01/30/trump-admin-tries-to-step-in-as-reports-surface-that-iran-will-execute-19-year-old-wrestling-star/",
    "timestamp": "2026-01-30T16:07:08Z"
  },
  {
    "title": "WATCH LIVE: Deputy Attorney General Todd Blanche announces release of more Epstein files",
    "description": "The Justice Department on Friday released many more records from its investigative files on Jeffrey Epstein, resuming disclosures under a law intended to reveal what the government knew about the millionaire financier's sexual abuse of young girls and his int…",
    "link": "https://www.pbs.org/newshour/politics/watch-live-deputy-attorney-general-todd-blanche-announces-release-of-more-epstein-files",
    "timestamp": "2026-01-30T16:06:00Z"
  },
  {
    "title": "Prosecutors can't seek death penalty against Luigi Mangione, judge rules",
    "description": "Federal prosecutors can’t seek the death penalty against Luigi Mangione in the killing of UnitedHealthcare CEO Brian Thompson, a judge ruled Friday, foiling the Trump administration’s bid to see him executed for what it called a “premeditated, cold-blooded as…",
    "link": "https://www.cbc.ca/news/world/luigi-mangione-death-penalty-9.7068139",
    "timestamp": "2026-01-30T16:05:32Z"
  },
  {
    "title": "Bombardier shares drop 9% after Trump threatens Canada with aircraft tariffs, decertification",
    "description": "Bombardier shares ‍dropped 9% on Friday after U.S. ​President Donald Trump threatened to decertify the private jet maker's ⁠large-cabin planes \"and all Aircraft made in Canada\" and slap 50% import tariffs on new planes until Canada certified the latest aircra…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/bombardier-shares-drop-9-after-trump-threatens-canada-with-aircraft-tariffs-decertification/articleshow/127805306.cms",
    "timestamp": "2026-01-30T16:04:46Z"
  },
  {
    "title": "Former CNN anchor Don Lemon arrested after protest inside Minneapolis church",
    "description": "Journalist Don Lemon was arrested in connection with an anti-immigration protest that disrupted a service at a Minnesota church, his lawyer said Friday.",
    "link": "https://www.cbc.ca/news/world/minnesota-arrest-don-lemon-9.7067848",
    "timestamp": "2026-01-30T16:02:25Z"
  },
  {
    "title": "Lefty radicals storm Jewish temple and hurl obscenities, mock LI Dem Rep. Suozzi over his vote to boost ICE $$",
    "description": "The activists -- from the extremist advocacy group Climate Defiance -- caused chaos inside the house of worship in Roslyn where Suozzi was speaking Wednesday night, crudely showing up with diapers and knee pads and cursing the self-described “moderate” Dem fo…",
    "link": "https://nypost.com/2026/01/30/us-news/lefties-storm-jewish-temple-to-mock-li-rep-suozzi-over-ice/",
    "timestamp": "2026-01-30T16:02:21Z"
  },
  {
    "title": "Eli Lilly plans $3.5 billion manufacturing plant in Pennsylvania to make next-generation obesity injections",
    "description": "The plant will help make Lilly's experimental drug called retatrutide, which has shown the highest weight loss seen to date in a late-stage trial.",
    "link": "https://www.cnbc.com/2026/01/30/eli-lilly-3point5-billion-pennsylvania-plant-obesity-drugs.html",
    "timestamp": "2026-01-30T16:02:20Z"
  },
  {
    "title": "Minnesota: A Hero Judge",
    "description": "The Trump fascists have many problems in Minnesota. One of them is the Chief U.S. District Judge of Minnesota, Patrick J. Schiltz, appointed by President George W. Bush. Judge Schiltz believes in his oath of office. He believes in upholding the Constitution. …",
    "link": "https://dianeravitch.net/2026/01/30/minnesota-a-hero-judge/",
    "timestamp": "2026-01-30T16:00:00Z"
  },
  {
    "title": "10 claims about Trump's 'border czar' Tom Homan we've investigated",
    "description": "We dug through our archives after Trump dispatched Homan to Minneapolis to oversee the administration's self-described immigration crackdown there.",
    "link": "https://www.snopes.com/collections/tom-homan-claims/",
    "timestamp": "2026-01-30T16:00:00Z"
  },
  {
    "title": "After Minneapolis, Tech CEOs Are Struggling to Stay Silent",
    "description": "Silicon Valley’s power brokers spent the past year currying favor with President Trump. Two deadly shootings in Minneapolis are now exposing the price of that bargain.",
    "link": "https://www.wired.com/story/after-minneapolis-tech-ceos-are-struggling-to-stay-silent/",
    "timestamp": "2026-01-30T16:00:00Z"
  },
  {
    "title": "US Judge bars federal prosecutors from seeking death penalty against Luigi Mangione",
    "description": "A federal judge has blocked prosecutors from seeking the death penalty against Luigi Mangione in the killing of UnitedHealthcare CEO Brian Thompson. The judge dismissed the federal murder charge, citing technical flaws, though stalking charges remain. This de…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-judge-bars-federal-prosecutors-from-seeking-death-penalty-against-luigi-mangione/articleshow/127805242.cms",
    "timestamp": "2026-01-30T15:59:14Z"
  },
  {
    "title": "‘Melania’ Reviews Are Out And Delivering The LOLs: “If They Showed This On A Plane, People Would Still Walk Out”",
    "description": "One critic admitted they \"didn't watch this\" but \"imagine it’s similar to giving yourself a lobotomy.\"",
    "link": "https://decider.com/2026/01/30/melania-reviews-lols/",
    "timestamp": "2026-01-30T15:58:37Z"
  },
  {
    "title": "Top Kennedy Center Official Resigns Less Than 2 Weeks Into The Job",
    "description": "Donald Trump’s effort to glorify himself by illegally tacking his name onto the John F. Kennedy Memorial Center for the Performing Arts has backfired bigly. Artists have been canceling shows ever since because they want nothing to do with Trump’s murderous as…",
    "link": "https://crooksandliars.com/2026/01/top-kennedy-center-official-resigns-less-2",
    "timestamp": "2026-01-30T15:58:30Z"
  },
  {
    "title": "Stock Exchange: Monthly rise of 9.15% and 7th consecutive weekly rise",
    "description": "Second day of correction, with the General Index closing at daily lows but remaining close to multi-year records - 2.2% gain in five days - HELLENiQ ENERGY above 9 euros, at a 6.5-year high\nThe post Stock Exchange: Monthly rise of 9.15% and 7th consecutive we…",
    "link": "https://en.protothema.gr/2026/01/30/stock-exchange-monthly-rise-of-9-15-and-7th-consecutive-weekly-rise/",
    "timestamp": "2026-01-30T15:58:26Z"
  },
  {
    "title": "Post Powell Panic! Gold And Silver Crash Following Fed’s Decision To Do Nothingb",
    "description": "Call it the Post Powell Panic! After The Fed decided to do nothing at the FOMC meeting. Gold is down -12% from the peak, trading below $5,000. Silver is down -21%, trading below $100 for the first time since Friday, officially in a BEAR MARKET. Rough night in…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364698/posts",
    "timestamp": "2026-01-30T15:58:14Z"
  },
  {
    "title": "UK & Chinese Animation Reaps Reward Of Prime Minister’s Trip To China",
    "description": "EXCLUSIVE: A UK Prime Minister’s first trip to China in eight years could lead to a boon for the UK and Chinese animation industries. Keir Starmer’s controversial trip to China this week was taken with a delegation of 60 companies including one sole represent…",
    "link": "http://deadline.com/2026/01/keir-starmer-trip-china-mou-animation-8-lions-cmg-1236703387/",
    "timestamp": "2026-01-30T15:57:45Z"
  },
  {
    "title": "Can Trump’s ‘madman theory’ reshape Iran and the Middle East?",
    "description": "The 'madman theory' aims to pressure adversaries but risks backfiring when opponents feel they have nothing to lose.",
    "link": "https://www.aljazeera.com/news/2026/1/30/can-trumps-madman-theory-reshape-iran-and-the-middle-east",
    "timestamp": "2026-01-30T15:57:30Z"
  },
  {
    "title": "'WHO can you kill?' Minnesota crisis collides with Rand Paul’s ideological crusade",
    "description": "Rand Paul made his name as a gadfly preaching about the dangers of a tyrannical federal government. Now, after the killings of two Minnesota residents at the hands of Homeland Security agents, the Kentucky Republican has a chance to do something about it. The…",
    "link": "https://freerepublic.com/focus/f-chat/4364697/posts",
    "timestamp": "2026-01-30T15:55:08Z"
  },
  {
    "title": "Bitcoin Traders See Nearly Even Odds for $69K Drop or $100K Recovery",
    "description": "Bitcoin sentiment on Myriad flipped bearish for first time in two months as traders bet on further downside amid shutdown fears and extreme market volatility.",
    "link": "https://decrypt.co/356461/bitcoin-traders-see-nearly-even-odds-69k-drop-100k-recovery",
    "timestamp": "2026-01-30T15:55:08Z"
  },
  {
    "title": "Death Penalty Charges Dropped for Luigi Mangione",
    "description": "The 27-year-old defendant, accused of murdering UnitedHealthcare CEO Brian Thompson, now faces a maximum penalty of life in prison without the possibility of parole",
    "link": "http://www.rollingstone.com/culture/culture-news/luigi-mangione-death-penalty-dropped-1235507484/",
    "timestamp": "2026-01-30T15:52:43Z"
  },
  {
    "title": "Federal prosecutors can't seek death penalty against Luigi Mangione, judge rules",
    "description": "U.S. District Judge Margaret Garnett dismissed a federal murder charge against Mangione, finding it was technically flawed. Garnett left in place stalking charges that carry a maximum punishment of life in prison.",
    "link": "https://www.pbs.org/newshour/nation/federal-prosecutors-cant-seek-death-penalty-against-luigi-mangione-judge-rules",
    "timestamp": "2026-01-30T15:52:05Z"
  },
  {
    "title": "Warsh’s challenge: Navigating Fed independence and Trump’s demands",
    "description": "Now that Warsh is in line for the job, the enormity of the challenge ahead of him is clear.",
    "link": "https://www.bostonherald.com/2026/01/30/warsh-challenge-next-fed-chair/",
    "timestamp": "2026-01-30T15:51:53Z"
  },
  {
    "title": "Tesla throws in the towel on car sales",
    "description": "Is Tesla still a car company? It's a question we've been asking ourselves more frequently over the past year, especially as the company's car business shrinks and Elon Musk continues to push the message that Tesla should be seen more as an AI and robotics lea…",
    "link": "https://www.theverge.com/transportation/870332/tesla-throws-in-the-towel-on-car-sales",
    "timestamp": "2026-01-30T15:51:12Z"
  },
  {
    "title": "Press Conference by Secretary-General António Guterres at United Nations Headquarters",
    "description": "Following is a transcript of UN Secretary-General António Guterres’ press conference on his 2026 priorities, in New York today:",
    "link": "https://press.un.org/en/2026/sgsm22995.doc.htm",
    "timestamp": "2026-01-30T15:50:54Z"
  },
  {
    "title": "Laken Riley’s killer Jose Ibarra returns to court as illegal immigrant requests new trial in student’s murder",
    "description": "Convicted killer Jose Ibarra seeks new trial in Laken Riley murder case that sparked national immigration debate. The illegal immigrant appears Friday in court.",
    "link": "https://www.foxnews.com/us/laken-riley-killer-jose-ibarra-returns-court-illegal-immigrant-requests-new-trial-students-murder",
    "timestamp": "2026-01-30T15:50:34Z"
  },
  {
    "title": "Meet the billionaire wife of Kevin Warsh, Donald Trump's pick for next Fed Chief. What is Jane Lauder's net worth?",
    "description": "US President Donald Trump has nominated former Federal Reserve official Kevin Warsh to replace Jerome Powell as the next Fed chair, bringing renewed attention to his personal and professional background. The spotlight has also shifted to Warsh’s wife, Jane La…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/meet-the-billionaire-wife-of-kevin-warsh-donald-trumps-pick-for-next-fed-chief-what-is-jane-lauders-net-worth/articleshow/127804581.cms",
    "timestamp": "2026-01-30T15:48:37Z"
  },
  {
    "title": "Billionaire's Melania snub suggests 'buyer's remorse' among Trump's enablers: analyst",
    "description": "The celebrities missing from the red carpet glitz of the Kennedy Center's premiere of Melania says more about Trump's fortunes than who was there, a Guardian columnist wrote Friday.Most notably, Amazon founder and billionaire Jeff Bezos and his wife snubbed t…",
    "link": "https://www.rawstory.com/melania-documentary-2675062277/",
    "timestamp": "2026-01-30T15:47:57Z"
  },
  {
    "title": "Tax refunds could be $1,000 higher this season, on average, White House says. How much you can expect",
    "description": "Tax refunds could be $1,000 higher this season, the White House said this week. But the average depends on your situation, experts say.",
    "link": "https://www.cnbc.com/2026/01/30/tax-refunds.html",
    "timestamp": "2026-01-30T15:45:43Z"
  },
  {
    "title": "Chevron CEO says Venezuela is taking positive steps to protect private oil investment",
    "description": "Chevron is the only U.S. oil major operating in Venezuela through a special license issued by the Treasury Department.",
    "link": "https://www.cnbc.com/2026/01/30/chevron-ceo-says-venezuela-taking-positive-steps-to-protect-oil-investment.html",
    "timestamp": "2026-01-30T15:45:24Z"
  },
  {
    "title": "Trump Admin Sues Illegal Migrant For Nearly $1 Million Over Failure To Self-Deport",
    "description": "The Trump administration is demanding nearly one million dollars from an illegal migrant in Virginia who is refusing to follow through with a deportation order.",
    "link": "https://dailycaller.com/2026/01/30/trump-admin-sues-illegal-woman-1-million/",
    "timestamp": "2026-01-30T15:44:56Z"
  },
  {
    "title": "Pushed by Trump, US allies are resetting relations with China",
    "description": "Western leaders are engaging with China for trade and diplomacy. Canada, the UK, and Germany are among nations seeking to reset relations. This shift comes as some allies re-evaluate their approach to global powers. The moves aim to secure economic interests …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/pushed-by-trump-us-allies-are-resetting-relations-with-china/articleshow/127804996.cms",
    "timestamp": "2026-01-30T15:44:09Z"
  },
  {
    "title": "Blue was the surprising color of the night at Melania Trump's movie premiere. Here's what attendees wore.",
    "description": "Melania Trump was joined by her husband and political allies at the premiere of her new film. Many of them wore simple, blue outfits for the occasion.",
    "link": "https://www.businessinsider.com/melania-trump-movie-premiere-photos-what-people-wore-2026-1",
    "timestamp": "2026-01-30T15:43:44Z"
  },
  {
    "title": "The D Brief: Shutdown watch; Lingering defense-strategy qs; JAGs’ unusual new jobs; Secret drone’s recent mission; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2026/01/the-d-brief-january-30-2026/411084/",
    "timestamp": "2026-01-30T15:42:01Z"
  },
  {
    "title": "Trump says Putin agreed to temporary halt in energy attacks on Ukraine, but terms remain unclear",
    "description": "Trump announced this on Thursday, but details about the timing and scope remain unclear.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-putin-agreed-to-temporary-halt-in-energy-attacks-on-ukraine-but-terms-remain-unclear",
    "timestamp": "2026-01-30T15:40:20Z"
  },
  {
    "title": "High school soccer standout ID’d as teen killed in sledding accident during rare winter storm in Texas",
    "description": "A rising soccer star was identified as the 16-year-old girl tragically killed in a freak sledding accident during a rare winter storm in Texas over the weekend. Elizabeth Angle and one of her teammates hitched a sled to the back of a 16-year-old boy’s Jeep fo…",
    "link": "https://freerepublic.com/focus/f-chat/4364689/posts",
    "timestamp": "2026-01-30T15:39:55Z"
  },
  {
    "title": "Largest crypto exchange announces surprising plan after Bitcoin crashes",
    "description": "Investors globally are still trying to process what happened on Jan. 29. The Thursday sell-off, triggered by a cocktail of reasons, has pushed market...",
    "link": "https://www.thestreet.com/crypto/markets/largest-crypto-exchange-announces-surprising-plan-after-bitcoin-crashes",
    "timestamp": "2026-01-30T15:39:51Z"
  },
  {
    "title": "Conniving Effort – Alexander Vindman Launches Democrat Senate Campaign in Florida",
    "description": "This is infuriating, and entirely due to something else in the background {GO DEEP}. Former National Security Council member (Russia/EurAsia desk) Alexander Vindman is running for a Florida senate seat against Republican Ashley Moody. First, Alexander Vindman…",
    "link": "https://freerepublic.com/focus/f-chat/4364688/posts",
    "timestamp": "2026-01-30T15:38:07Z"
  },
  {
    "title": "Hegseth says Department of War 'will be prepared to deliver' whatever Trump wants following Iran warning",
    "description": "Secretary of War Pete Hegseth says military will \"deliver whatever this president expects\" as President Donald Trump warns Iran about nuclear program development.",
    "link": "https://www.foxnews.com/politics/hegseth-says-department-war-will-prepared-deliver-whatever-trump-wants-following-iran-warning",
    "timestamp": "2026-01-30T15:37:20Z"
  },
  {
    "title": "BREAKING: Bexar County, TX Judge Rosie Speedlin-Gonzalez ARRESTED for allegedly unlawfully having an attorney HANDCUFFED and locking him in a jury box",
    "description": "BREAKING: Bexar County, TX Judge Rosie Speedlin-Gonzalez ARRESTED for allegedly unlawfully having an attorney HANDCUFFED and locking him in a jury box Rosie was celebrated as the first openly gay judge to be elected in Bexar County",
    "link": "https://freerepublic.com/focus/f-news/4364687/posts",
    "timestamp": "2026-01-30T15:37:02Z"
  },
  {
    "title": "Is Iran Next?",
    "description": "The Trump administration has targets but no endgame.",
    "link": "https://www.theatlantic.com/national-security/2026/01/iran-trump-military-venezuela/685824/",
    "timestamp": "2026-01-30T15:36:44Z"
  },
  {
    "title": "US sees India as key partner in Pax Silica AI push",
    "description": "The US is positioning India as a key future partner in a new economic security framework aimed at securing global supply chains for artificial intelligence and advanced technologies, Under Secretary of State for Economic Affairs Jacob Helberg said on Friday.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-sees-india-as-key-partner-in-pax-silica-ai-push/articleshow/127804874.cms",
    "timestamp": "2026-01-30T15:35:50Z"
  },
  {
    "title": "Donald Trump nominates Kevin Warsh as Federal Reserve chair (Claire Jones/Financial Times)",
    "description": "Claire Jones / Financial Times:\nDonald Trump nominates Kevin Warsh as Federal Reserve chair  —  President's decision on successor to Jay Powell comes at pivotal moment for world's most important central bank  —  Donald Trump has said he has nominated Kevin Wa…",
    "link": "https://www.memeorandum.com/260130/p54",
    "timestamp": "2026-01-30T15:35:00Z"
  },
  {
    "title": "Mexico to seek diplomatic solution after US threatens Cuba oil tariffs",
    "description": "MEXICO CITY, Jan 30 (Reuters) - Mexico’s President Claudia Sheinbaum said on Friday her country would seek diplomatic solutions and alternatives to help Cuba after the Un… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/30/mexico-to-seek-diplomatic-solution-after-us-threatens-cuba-oil-tariffs",
    "timestamp": "2026-01-30T15:33:52Z"
  },
  {
    "title": "Why Trump's pick for Fed chair is causing gold and silver to tumble from records",
    "description": "Gold and silver plunged on Friday as traders reacted to Kevin Warsh's nomination as Fed chair. The dollar jumped and the debasement trade took a hit.",
    "link": "https://www.businessinsider.com/silver-gold-price-today-trump-fed-kevin-warsh-interest-rates-2026-1",
    "timestamp": "2026-01-30T15:33:05Z"
  },
  {
    "title": "Donald Trump Jr. Celebrates 'Built In America' Stablecoin Of Family-Linked World Liberty Financial As Market Cap Touches $5 Billion",
    "description": "Donald Trump Jr., co-founder of World Liberty Financial, cheered the dollar-pegged World Liberty Financial USD (USD1) stablecoin hitting a $5 billion market ...",
    "link": "https://finance.yahoo.com/news/donald-trump-jr-celebrates-built-153111817.html",
    "timestamp": "2026-01-30T15:31:11Z"
  },
  {
    "title": "NRO Officially Declassifies JUMPSEAT First Gen Signals Intelligence Satellites",
    "description": "Launched between 1971 and 1987 primarily to collect intelligence data on foreign weapon testing, the last satellites in the JUMPSEAT family were withdrawn from service in 2006.  A memorandum dated Dec. 4, 2025 from the office of Christopher J. Scolese, Direct…",
    "link": "https://theaviationist.com/2026/01/30/nro-jumpseat-sigint-satellites-declassified/",
    "timestamp": "2026-01-30T15:30:57Z"
  },
  {
    "title": "Trump Calls for Arrest of Barrack Obama",
    "description": "State of the Union: The president said his predecessor had attempted a coup during the 2016 presidential election.\nThe post Trump Calls for Arrest of Barrack Obama appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-calls-for-arrest-of-barrack-obama/",
    "timestamp": "2026-01-30T15:30:07Z"
  },
  {
    "title": "Welcome to Santa Clara! Your one-stop guide to Super Bowl LX",
    "description": "The big game is Feb. 8 at Levi's Stadium in the Bay Area.",
    "link": "https://www.bostonherald.com/2026/01/30/super-bowl-60-bay-area-guide/",
    "timestamp": "2026-01-30T15:30:05Z"
  },
  {
    "title": "Capitol agenda: Senate shutdown deal hits a Lindsey Graham snag (Mia McCarthy/Politico)",
    "description": "Mia McCarthy / Politico:\nCapitol agenda: Senate shutdown deal hits a Lindsey Graham snag  —  A partial shutdown of multiple federal agencies is just 16 hours away as the Senate deals with a Lindsey Graham-sized snag and House Republicans face pressure from Pr…",
    "link": "https://www.memeorandum.com/260130/p52",
    "timestamp": "2026-01-30T15:30:01Z"
  },
  {
    "title": "Glut To Trump Geopolitics to Keep Oil Price around $60 This Year",
    "description": "The global oversupply is set to override geopolitical flare-ups this year, keeping oil prices close to the $60 per barrel mark, the monthly Reuters poll showed on Friday. Brent Crude prices are expected to average $62.02 per barrel in 2026, according to 31 ec…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Glut-To-Trump-Geopolitics-to-Keep-Oil-Price-around-60-This-Year.html",
    "timestamp": "2026-01-30T15:30:00Z"
  },
  {
    "title": "25 killed in Nigeria's deadliest reported Islamist attack since US Christmas strikes",
    "description": "MAIDUGURI, Nigeria, ‌Jan 30 (Reuters) - At least 25 people were killed ‌when suspected Boko Haram militants attacked a town ‌in northern Nigeria, relatives of victims said, the deadliest reported Islamist attack since U.S. President Donald Trump ordered air s…",
    "link": "https://www.thestar.com.my/news/world/2026/01/30/25-killed-in-nigeria039s-deadliest-reported-islamist-attack-since-us-christmas-strikes",
    "timestamp": "2026-01-30T15:29:00Z"
  },
  {
    "title": "Cash surge: House GOP smashes fundraising records as Republicans gear up to defend slim majority",
    "description": "House Republicans shatter fundraising records with $117.2 million haul as they prepare to defend their narrow majority in November's competitive midterm elections.",
    "link": "https://www.foxnews.com/politics/house-gop-smashes-fundraising-records-republicans-gear-up-defend-slim-majority",
    "timestamp": "2026-01-30T15:25:37Z"
  },
  {
    "title": "Trump Suggests Alex Pretti Deserved to Get Shot Dead",
    "description": "For all his platitudes in the wake of Alex Pretti’s death, Donald Trump doesn’t seem to care about or respect the slain ICU nurse one bit.In a Truth Social post late Thursday night, the president coldly referred to Pretti as an “agitator” and claimed that his…",
    "link": "https://newrepublic.com/post/205943/donald-trump-alex-pretti-deserved-shot-video",
    "timestamp": "2026-01-30T15:25:22Z"
  },
  {
    "title": "Missouri launches sweeping lawsuit to block census from counting illegal immigrants: 'hijack representation'",
    "description": "Missouri Attorney General Catherine Hanaway demands the Census Bureau redo its 2020 population count, excluding illegal immigrants and visa holders.",
    "link": "https://www.foxnews.com/politics/missouri-launches-sweeping-lawsuit-block-census-from-counting-illegal-immigrants-hijack-representation",
    "timestamp": "2026-01-30T15:24:53Z"
  },
  {
    "title": "Judge bars federal prosecutors from seeking death penalty against Luigi Mangione",
    "description": "The judge dismissed a federal murder charge against Mangione.",
    "link": "https://www.denverpost.com/2026/01/30/judge-bars-mangione-death-penalty/",
    "timestamp": "2026-01-30T15:23:59Z"
  },
  {
    "title": "Judge bars federal prosecutors from seeking death penalty against Luigi Mangione",
    "description": ".S. District Judge Margaret Garnett's ruling Friday foiled the Trump administration’s bid to see Mangione executed.",
    "link": "https://www.bostonherald.com/2026/01/30/judge-bars-mangione-death-penalty/",
    "timestamp": "2026-01-30T15:23:59Z"
  },
  {
    "title": "MS NOW changes AI-altered image of Minnesota shooting victim Alex Pretti after backlash",
    "description": "MS NOW admitted to using AI-enhanced image of Alex Pretti, a Minneapolis ICU nurse killed by Border Patrol agent, during a segment on \"Deadline: White House.\"",
    "link": "https://www.foxnews.com/media/ms-now-changes-ai-altered-image-minnesota-shooting-victim-alex-pretti-after-backlash",
    "timestamp": "2026-01-30T15:23:13Z"
  },
  {
    "title": "WATCH LIVE: Senate scrambles to avoid shutdown after Democrats strike deal with White House",
    "description": "Even if the Senate passes the funding measure, it would need House approval before becoming law. The House is not expected to return until Monday, raising the possibility of at least a temporary partial shutdown over the weekend.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-scrambles-to-avoid-shutdown-after-democrats-strike-deal-with-white-house",
    "timestamp": "2026-01-30T15:22:47Z"
  },
  {
    "title": "The Wealth Concentration Engine: Rethinking America’s Financial Plumbing",
    "description": "A Jan. 17 article on Quartz Markets by Catherine Baab reports that JPMorgan Chase, Goldman Sachs, Wells Fargo, Citigroup and Bank of America returned nearly all of their 2025 profits to shareholders. \nThe post The Wealth Concentration Engine: Rethinking Ameri…",
    "link": "https://www.globalresearch.ca/wealth-concentration-engine-rethinking-america-financial-plumbing/5914142",
    "timestamp": "2026-01-30T15:22:43Z"
  },
  {
    "title": "Nobel Institute confirms leak of peace prize winner",
    "description": "The Norwegian Nobel Institute on Friday confirmed that the name of the winner of the 2025 peace prize had been \"illegally\" leaked before the announcement, without ruling out that a state actor may have been involved. The Nobel Committee, which selects the lau…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/nobel-institute-confirms-leak-of-peace-prize-winner/articleshow/127804707.cms",
    "timestamp": "2026-01-30T15:21:47Z"
  },
  {
    "title": "Trump Hangs Over Canada Conservatives’ Vote on Divisive Leader",
    "description": "Canadian Conservative Leader Pierre Poilievre has a Donald Trump problem, and it has returned just as he faces a public review from members of his party.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-hangs-over-canada-conservatives-vote-on-divisive-leader",
    "timestamp": "2026-01-30T15:21:45Z"
  },
  {
    "title": "Obama and Clinton Add Fuel to the Fire Following Killing of Minneapolis Paramedic",
    "description": "Calls for Americans to “speak out” by former Democrat presidents Barack Obama and Bill Clinton after the death of paramedic Alex Pretti in Minneapolis on January 24 are fueling tensions at a time when emotions are running high on both …\nThe post Obama and Cli…",
    "link": "https://www.globalresearch.ca/obama-clinton-add-fuel-fire-killing-minneapolis-paramedic/5914221",
    "timestamp": "2026-01-30T15:21:17Z"
  },
  {
    "title": "Fox Host Calls Don Lemon Arrest ‘Unimpeachable’ Citing Grand Jury — Trump Was Indicted by Multiple Grand Juries",
    "description": "Fox News host Charlie Hurt said that if Don Lemon's arrest was the result of a grand jury, \"That's pretty unimpeachable\" — which Trump faced multiple times.\nThe post Fox Host Calls Don Lemon Arrest ‘Unimpeachable’ Citing Grand Jury — Trump Was Indicted by Mul…",
    "link": "https://www.mediaite.com/media/news/fox-host-calls-don-lemon-arrest-unimpeachable-citing-grand-jury-trump-was-indicted-by-multiple-grand-juries/",
    "timestamp": "2026-01-30T15:20:20Z"
  },
  {
    "title": "Trump says U.S. will decertify Canadian-made planes, threatens 50% tariff (Victoria Craw/Washington Post)",
    "description": "Victoria Craw / Washington Post:\nTrump says U.S. will decertify Canadian-made planes, threatens 50% tariff  —  The president accused Canada of blocking the sale of U.S.-made Gulfstream aircraft and said he would raise tariffs in the latest dispute to rock the…",
    "link": "https://www.memeorandum.com/260130/p46",
    "timestamp": "2026-01-30T15:20:01Z"
  },
  {
    "title": "Tom Homan is not the adult in the room (Christian Paz/Vox)",
    "description": "Christian Paz / Vox:\nTom Homan is not the adult in the room  —  Trump's new man in Minneapolis, explained. … When President Donald Trump announced that border czar Tom Homan would be taking over immigration enforcement operations in Minnesota, many anti-Immig…",
    "link": "https://www.memeorandum.com/260130/p47",
    "timestamp": "2026-01-30T15:20:01Z"
  },
  {
    "title": "US stocks dip and gold swings as markets react to Trump’s choice to lead the Federal Reserve",
    "description": "Financial markets are uneasy as investors try to figure out what President Donald Trump’s new nominee to lead the Federal Reserve will mean.",
    "link": "https://www.bostonherald.com/2026/01/30/markets-react-trump-fed-chair-nominee/",
    "timestamp": "2026-01-30T15:19:45Z"
  },
  {
    "title": "Sydney Sweeney refuses to be Hollywood's political 'pawn' amid MAGA Barbie labeling",
    "description": "Sydney Sweeney addresses being called \"MAGA Barbie\" despite never publicly sharing political beliefs, telling Cosmopolitan she's being used as a \"pawn.\"",
    "link": "https://www.foxnews.com/entertainment/sydney-sweeney-refuses-hollywoods-political-pawn-amid-maga-barbie-labeling",
    "timestamp": "2026-01-30T15:18:25Z"
  },
  {
    "title": "Federal murder charge against Luigi Mangione dismissed, death penalty off the table",
    "description": "A judge has ruled that federal prosecutors can’t seek the death penalty against Luigi Mangione in the killing of UnitedHealthcare CEO Brian Thompson. U.S. District Judge Margaret Garnett's ruling Friday foiled the Trump administration’s bid to see Mangione ex…",
    "link": "https://apnews.com/article/mangione-unitedhealthcare-death-penalty-dismissed-killing-1d17a30d0297acda29fc82dbf54d2677",
    "timestamp": "2026-01-30T15:18:06Z"
  },
  {
    "title": "Former CNN anchor Don Lemon arrested after anti-ICE protests at Minnesota church",
    "description": "Pam Bondi, President Donald Trump’s attorney general, alleges that Lemon was involved in a ‘coordinated attack on Cities Church in St. Paul, Minnesota’.",
    "link": "https://www.thejournal.ie/don-lemon-arrested-anti-ice-protests-minnesota-church-6942991-Jan2026/",
    "timestamp": "2026-01-30T15:17:23Z"
  },
  {
    "title": "‘External interference’: China criticises Trump’s tariff threat on ‘any country selling oil to Cuba’",
    "description": "US President Donald Trump on Thursday signed an executive order imposing a tariff on any goods from countries that sell or provide oil to Cuba.",
    "link": "https://indianexpress.com/article/world/china-criticises-trumps-tariff-threat-on-any-country-selling-oil-to-cuba-10504135/",
    "timestamp": "2026-01-30T15:17:06Z"
  },
  {
    "title": "Tulsi Gabbard under scrutiny for showing up at FBI raid of Georgia election hub",
    "description": "WASHINGTON — When President Donald Trump watched a live feed of the U.S. military operation that captured Venezuelan President Nicolás Maduro, the director of national intelligence, Tulsi Gabbard, was not in the room. Just two days earlier, she had posted pho…",
    "link": "https://freerepublic.com/focus/f-news/4364686/posts",
    "timestamp": "2026-01-30T15:15:24Z"
  },
  {
    "title": "Ex-college football coach Lou Holtz reportedly entering hospice care",
    "description": "Holtz had a viral feud with Ohio State head coach Ryan Day ahead of the national championship in the 2024-25 season.",
    "link": "https://www.dispatch.com/story/sports/college/football/2026/01/30/college-football-coach-lou-holtz-entering-hospice-care-per-reports/88429503007/",
    "timestamp": "2026-01-30T15:15:04Z"
  },
  {
    "title": "College Football Legend Lou Holtz In Hospice Care, Reports",
    "description": "One of college football’s most iconic voices may be facing his toughest battle yet: Lou Holtz is reportedly in hospice care. Holtz, 89, is one of the most accomplished coaches the game has seen ... forever tied to Notre Dame’s classic 1988…\n Permalink",
    "link": "https://www.tmz.com/2026/01/30/college-football-coaching-legend-lou-holtz-receiving-hospice-care-reports/",
    "timestamp": "2026-01-30T15:13:33Z"
  },
  {
    "title": "Why are US stock market index futures Dow, S&P 500 and Nasdaq down now and who are biggest losers and gainers? Here's what should investors do now",
    "description": "Why are US stock market index futures Dow, S&P 500 and Nasdaq down now and who are biggest losers and gainers? US futures fell after Donald Trump named Kevin Warsh as Fed Chair pick. Precious metals dropped. Mining stocks declined. Asian markets slipped. Some…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-are-us-stock-market-index-futures-dow-sp-500-and-nasdaq-down-now-and-who-are-biggest-losers-and-gainers-heres-what-should-investors-do-now/articleshow/127751635.cms",
    "timestamp": "2026-01-30T15:13:14Z"
  }
]