[
  {
    "title": "JPMorgan raises risk of recession to 60% as Trump tariff turmoil upends markets worldwide",
    "description": "The report branded the tariffs as a \"functional tax increase\" on US household and business purchases of imported goods.",
    "link": "https://nypost.com/2025/04/04/business/jpmorgan-raises-risk-of-recession-to-60-amid-trump-tariff-turmoil/",
    "timestamp": "2025-04-04T18:36:54Z"
  },
  {
    "title": "Where the market stands going into the weekend after a brutal two days of tariff-driven selling",
    "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "link": "https://www.cnbc.com/2025/04/04/where-the-market-stands-after-a-brutal-two-days-of-trump-tariff-driven-selling.html",
    "timestamp": "2025-04-04T18:36:45Z"
  },
  {
    "title": "Celebrity Hot Spot Nello to Move From UES to Midtown",
    "description": "Italian restaurant Nello, a popular hangout for A-list celebrities, is coming back with a new location in Manhattan. Nello closed its 696 Madison Avenue location last year after the restaurant’s owner, Thomas Makkos, was hit with an eviction notice after fail…",
    "link": "http://commercialobserver.com/2025/04/celebrities-nello-lease-sl-green-midtown/",
    "timestamp": "2025-04-04T18:36:41Z"
  },
  {
    "title": "Canada to break up and cease being a country? Senior Conservative leader sounds alarm as Western secession threat spreads beyond Alberta and Saskatchewan",
    "description": "Preston Manning has sparked controversy in Canadian politics by warning that a Liberal victory under Mark Carney could lead to Western provinces seceding. Conservative leader Pierre Poilievre has urged calm and national unity, emphasizing that a Conservative …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/canada-to-break-up-and-cease-being-a-country-senior-conservative-leader-sounds-alarm-as-western-secession-threat-spreads-beyond-alberta-and-saskatchewan/articleshow/119990094.cms",
    "timestamp": "2025-04-04T18:36:33Z"
  },
  {
    "title": "Merch of the anti-MAGA hat: From Greenland to Canada, protest caps go viral, will Mexico be next?",
    "description": "Vice President JD Vance's visit to Greenland brought attention to the 'Make America Go Away' hat, which has gained popularity as a form of political protest. Echoing a similar movement in Canada, these hats symbolize resistance and national pride, cutting thr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/merch-of-the-anti-maga-hat-from-greenland-to-canada-protest-caps-go-viral-will-mexico-be-next/articleshow/119990128.cms",
    "timestamp": "2025-04-04T18:36:03Z"
  },
  {
    "title": "Trump's Tariff Blueprint Called for 'Careful Planning' and 'Precise Execution'",
    "description": "If you want to understand what President Donald Trump is trying to accomplish with his massive tariff hikes, the best place to start is probably a report",
    "link": "https://reason.com/2025/04/04/trumps-tariff-blueprint-called-for-careful-planning-and-precise-execution/",
    "timestamp": "2025-04-04T18:35:25Z"
  },
  {
    "title": "Klarna And StubHub Delay IPOs After Trump’s Tariffs Cause Stock Market Dive",
    "description": "Far-reaching reciprocal tariffs for U.S. trade partners were announced earlier this week.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/04/klarna-and-stubhub-delay-ipos-after-trumps-tariffs-cause-stock-market-dive/",
    "timestamp": "2025-04-04T18:35:24Z"
  },
  {
    "title": "Capitol agenda: Trump tariff turmoil overshadows budget rescue (Politico)",
    "description": "Politico:\nCapitol agenda: Trump tariff turmoil overshadows budget rescue  —  The markets might be in free fall, but Capitol Hill Republicans are managing to move forward with President Donald Trump's legislative agenda.  Senate Majority Leader John Thune is f…",
    "link": "https://www.memeorandum.com/250404/p90",
    "timestamp": "2025-04-04T18:35:01Z"
  },
  {
    "title": "China announces 34% retaliatory tariff on US while South Korea, UK, Japan, and others seek deals with Trump",
    "description": "President Donald Trump's plan to reorganize the global economy is coming into focus after China announces retaliatory tariffs while other countries seek trade deals with the president. Authorities in Beijing said a new 34% tariff on imports from the U.S. woul…",
    "link": "https://www.theblaze.com/news/china-tariffs-against-us-trump",
    "timestamp": "2025-04-04T18:35:00Z"
  },
  {
    "title": "Congress has power over tariffs, but stopping Trump isn't likely as of now",
    "description": "Stock market indices have sharply fallen on the heels of President Trump imposing higher tariffs on more than 180 countries.",
    "link": "https://www.cnbc.com/2025/04/04/trump-tariffs-congress-constitution-law-trade.html",
    "timestamp": "2025-04-04T18:34:17Z"
  },
  {
    "title": "'I lost people!' MAGA senator's 'fuhrer' insult leaves Chuck Schumer sick",
    "description": "The Senate's top Democrat expressed his outrage to CNN after a Republican senator called him a \"fuhrer,\" a German term meaning \"leader\" that's commonly associated with Nazi leader Adolf Hitler.\n\nSen. Bernie Moreno (R-OH) told reporters, \"Republicans are indep…",
    "link": "https://www.rawstory.com/chuck-schumer-2671676297/",
    "timestamp": "2025-04-04T18:34:12Z"
  },
  {
    "title": "US sanctions against Russia are unprecedented – here’s why there’s no effort to end them",
    "description": "By hitting Moscow with never-before-seen economic warfare, the West has helped it thrive Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615250-russia-sanctions-unprecedented-relief/",
    "timestamp": "2025-04-04T18:33:44Z"
  },
  {
    "title": "EXCLUSIVE: Explosive JFK Evidence Government Sat On For 62 Years Finally Exposed — Including New French Tourist Suspect and Link to Radical Terror Mob",
    "description": "Newly declassified government records revealed former French Army captain Jean René Souètre as a possible suspect.",
    "link": "https://radaronline.com/p/jfk-files-evidence-french-tourist-suspect/",
    "timestamp": "2025-04-04T18:33:10Z"
  },
  {
    "title": "US will know in weeks if Russia serious about Ukraine ceasefire, Rubio says",
    "description": "US will know in weeks if Russia serious about Ukraine ceasefire, Rubio saysaljazeera.com",
    "link": "https://www.aljazeera.com/news/2025/4/4/us-will-know-in-weeks-if-russia-serious-about-ceasefire-rubio-says",
    "timestamp": "2025-04-04T18:32:56Z"
  },
  {
    "title": "Germany's DAX index plunges by nearly 5 pct",
    "description": "FRANKFURT, April 4 (Xinhua) -- Germany's benchmark DAX index on Friday fell by nearly 5 percent as concerns about the escalation of trade conflicts in the wake of the new U.S. tariffs continue to weigh on German stocks. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/05/germany039s-dax-index-plunges-by-nearly-5-pct",
    "timestamp": "2025-04-04T18:31:00Z"
  },
  {
    "title": "‘Everyone Is Terrified’ of Trump",
    "description": "\"Capitol Hill Republicans, corporate America and White House allies are terrified about what’s next in President Donald Trump’s escalating trade war. But they fear Trump’s wrath even more,\" Politico reports. \"Republican lawmakers are signaling they’re",
    "link": "https://politicalwire.com/2025/04/04/everyone-is-terrified-of-trump/",
    "timestamp": "2025-04-04T18:30:52Z"
  },
  {
    "title": "Gold price today crashes as recession fears set in. Gold rate to fall further?",
    "description": "Gold rate today was down from the record high even as the bullion is still up about 15.6 per cent this year.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-today-crashes-as-recession-fears-set-in-gold-rate-to-fall-further/articleshow/119989720.cms",
    "timestamp": "2025-04-04T18:30:18Z"
  },
  {
    "title": "Trump’s Health Fraud Focus at Odds With Past Pardons",
    "description": "Get our weekly newsletter, The Week in Brief, featuring a roundup of our original coverage, Fridays at 2 p.m. ET.",
    "link": "https://kffhealthnews.org/news/article/the-week-in-brief-trump-health-fraud-pardons/",
    "timestamp": "2025-04-04T18:30:00Z"
  },
  {
    "title": "Russia-Ukraine war: Kyiv allies want 'quick answer' from Putin on truce plan",
    "description": "The appeal by some of Kyiv's key western allies is an attempt to call Moscow out on its willingness to reach a ceasefire. Emerging from three days of meetings with North Atlantic Treaty Organization (NATO) foreign ministers in Brussels, US secretary of state …",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-ukraine-war-kyiv-allies-want-quick-answer-from-putin-on-truce-plan/articleshow/119989885.cms",
    "timestamp": "2025-04-04T18:29:24Z"
  },
  {
    "title": "Nintendo Delays Switch 2 Preorders Over Trump Tariffs",
    "description": "Within hours of President Donald Trump's announcement that he would impose double-digit tariffs on all imports from nearly every country, markets reacted negatively with stock sell-offs and plummeting share prices. \nNintendo has responded by delaying orders o…",
    "link": "https://biztoc.com/x/a6779cf6d52f082e",
    "timestamp": "2025-04-04T18:28:52Z"
  },
  {
    "title": "Trump Reveals Vietnam Trade Talks As Nike Stock Rallies On Surprise Turnaround",
    "description": "Shares of clothing and footwear retailers are climbing on Friday after President Donald Trump revealed that Vietnam is interested in negotiations to reduce tariffs. \nThe Details: President Trump said in a post on Truth Social that he had a \"very productive ca…",
    "link": "https://biztoc.com/x/2bf516e8cc0ed916",
    "timestamp": "2025-04-04T18:28:42Z"
  },
  {
    "title": "Trump extends deadline for TikTok sale to non-Chinese buyer to avoid ban",
    "description": "Deadline set by US president was supposed to be Saturday, with Trump now considering decreasing tariffs to get deal\nDonald Trump on Friday afternoon extended by 75 days a deadline for the Chinese technology company ByteDance to sell US assets of the popular s…",
    "link": "https://biztoc.com/x/31e5f8497452a95a",
    "timestamp": "2025-04-04T18:28:23Z"
  },
  {
    "title": "What this disastrous week taught us about the Trump presidency",
    "description": "President Donald Trump gestures while speaking during an executive order signing event in the Oval Office of the White House on March 31, 2025, in Washington, DC.\nDonald Trump’s tariffs were at once predictable and shocking.\nPredictable, in the sense that Tru…",
    "link": "https://biztoc.com/x/a5c133ab3f5c2448",
    "timestamp": "2025-04-04T18:28:22Z"
  },
  {
    "title": "The Trouble With TikTok Is Getting Old",
    "description": "As the deadline for action on the TikTok ban-or-sell issue is once again extended, who cares anymore?",
    "link": "https://www.theatlantic.com/technology/archive/2025/04/tiktok-ban-extension/682302/",
    "timestamp": "2025-04-04T18:28:02Z"
  },
  {
    "title": "US tariffs: Risks may open new avenues for Indian economy",
    "description": "The Indian economy may face challenges as the US imposes tariffs on around 60 countries, including India. However, this could also bring opportunities for India due to shifts in global supply chains. Ongoing trade talks with the US might result in tariff redu…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/us-tariffs-risks-may-open-new-avenues-for-indian-economy/articleshow/119989851.cms",
    "timestamp": "2025-04-04T18:28:00Z"
  },
  {
    "title": "You Wouldn't Want to Be Him on That Dreadful Day",
    "description": "“Perhaps history is teaching us that today’s popular leaders like Donald Trump and Marine Le Pen are not the people’s last chance. They are the globalist’s last chance.” — Kurt Schlichter Do you see the pattern? Populist party leaders all over Western Civ get…",
    "link": "https://freerepublic.com/focus/f-news/4308861/posts",
    "timestamp": "2025-04-04T18:27:34Z"
  },
  {
    "title": "Trump says he’s giving TikTok another 75 days to find a US buyer",
    "description": "Trump has recently entertained an array of offers from U.S. businesses seeking to buy a share of the popular social media site, but China’s ByteDance, which owns TikTok and its closely-held algorithm, has insisted the platform is not for sale.",
    "link": "https://www.wsbtv.com/news/national/trump-says-hes-giving-tiktok-another-75-days-find-us-buyer/FJJOSF3MYRBRPAF6BCP4DTBPFE/",
    "timestamp": "2025-04-04T18:26:27Z"
  },
  {
    "title": "Trump And GOP Target Student Loan Forgiveness, Plunging Programs Into Uncertainty",
    "description": "Student loan forgiveness programs are being targeted on multiple fronts through executive actions, legal challenges, and legislation. Here's where things stand.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/04/04/trump-and-gop-target-student-loan-forgiveness-plunging-programs-into-uncertainty/",
    "timestamp": "2025-04-04T18:26:11Z"
  },
  {
    "title": "African Nation of Lesotho, Hit Hardest by Tariffs, Prepares Delegation to Trump",
    "description": "The government of Lesotho is organizing a delegation to Washington to speak with President Donald Trump as soon as possible regarding the imposition of a 50 percent tariff on its exports, local media confirmed on Friday.\nThe post African Nation of Lesotho, Hi…",
    "link": "https://www.breitbart.com/africa/2025/04/04/african-nation-of-lesotho-hit-hardest-by-tariffs-prepares-delegation-to-trump/",
    "timestamp": "2025-04-04T18:26:08Z"
  },
  {
    "title": "Sell-off worsens worldwide and Dow drops 1,300 after China retaliates against Trump tariffs (Stan Choe/Associated Press)",
    "description": "Stan Choe / Associated Press:\nSell-off worsens worldwide and Dow drops 1,300 after China retaliates against Trump tariffs  —  Stock markets worldwide are careening even lower Friday after China matched President Donald Trump's big raise in tariffs in an escal…",
    "link": "https://www.memeorandum.com/250404/p88",
    "timestamp": "2025-04-04T18:25:09Z"
  },
  {
    "title": "Kamala Harris Finally Says What We've All Been Thinking",
    "description": "Throughout the 2024 Presidential campaign, we heard plenty of warnings about how bad another four years of Donald Trump as President would be for the United States. But no one warned us as loudly as his Democratic opponent, Vice President Kamala Harris. Read …",
    "link": "https://www.theroot.com/kamala-harris-finally-says-what-weve-all-been-thinking-1851774832",
    "timestamp": "2025-04-04T18:25:00Z"
  },
  {
    "title": "German president criticizes US 'self-anointed elite'",
    "description": "President Frank-Walter Steinmeier has criticized elements of US domestic and foreign policies, from the treatment of LGBTQ+ people in public institutions to the weakening of the transatlantic alliance. US President Donald Trump and his administration are thre…",
    "link": "https://www.dw.com/en/german-president-criticizes-us-self-anointed-elite/a-72146208",
    "timestamp": "2025-04-04T18:24:00Z"
  },
  {
    "title": "German president criticizes US 'self-anointed elite'",
    "description": "President Frank-Walter Steinmeier has criticized elements of US domestic and foreign policies, from the treatment of LGBTQ+ people in public institutions to the weakening of the transatlantic alliance.",
    "link": "https://www.dw.com/en/german-president-criticizes-us-self-anointed-elite/a-72146208",
    "timestamp": "2025-04-04T18:24:00Z"
  },
  {
    "title": "Green Card Marriages: Interviews, application process, financial disclosures — changes made by Trump administration",
    "description": "Green card applicants navigating these new rules must stay informed, seek legal guidance, and ensure thorough documentation of their marriages to avoid unnecessary delays or denials.",
    "link": "https://economictimes.indiatimes.com/news/international/us/green-card-marriages-interviews-application-process-financial-disclosures-changes-made-by-trump-administration/articleshow/119989660.cms",
    "timestamp": "2025-04-04T18:23:55Z"
  },
  {
    "title": "Nintendo Delays Pre-Orders Of Switch 2 Amid Tariff Uncertainty, But June Launch Date Unchanged",
    "description": "Nintendo is delaying the long-awaited pre-order date for its new Switch 2 video game device, citing uncertainty caused by President Donald Trump’s tariffs. The original pre-sale date was next Wednesday. As of now, the June 5 launch date for the Switch 2 remai…",
    "link": "http://deadline.com/2025/04/nintendo-delays-switch-2-preorders-trump-tariff-uncertainty-1236359874/",
    "timestamp": "2025-04-04T18:23:34Z"
  },
  {
    "title": "Trump Skips Honoring Soldiers Killed in Lithuania to Watch Golf",
    "description": "Donald Trump skipped a ceremony to recieve the bodies of four soldiers killed in Lithuania in order to attent a LIV golf tournament at his Doral club.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-skips-transfer-soldiers-killed-lithuania-liv-golf-1235310901/",
    "timestamp": "2025-04-04T18:23:25Z"
  },
  {
    "title": "Russian missile strike kills 14 in Ukraine leader's home city",
    "description": "A Russian ballistic missile strike on Volodymyr Zelensky's home city of Kryvyi Rig killed 14 people on Friday, including six children, the Ukrainian leader...",
    "link": "https://www.yahoo.com/news/russian-missile-strike-kills-14-174429362.html",
    "timestamp": "2025-04-04T18:23:22Z"
  },
  {
    "title": "Trump ‘Saves’ TikTok With Yet Another Extension for Potential Sale",
    "description": "The president said China was \"not happy\" with his tariffs, which are currently decimating the U.S. stock market.",
    "link": "https://gizmodo.com/trump-saves-tiktok-with-yet-another-extension-for-potential-sale-2000585337",
    "timestamp": "2025-04-04T18:22:30Z"
  },
  {
    "title": "TikTok Has Another 75 Days To Find A Buyer, Trump Says; Walmart Considering A Bid",
    "description": "TikTok's fate in the US will not be decided just yet. US President Donald Trump said today that he will sign an executive order that will keep the social media site running in the US for another 75 days. This is coming about amid reports of Amazon and Walmart…",
    "link": "https://www.gamespot.com/articles/tiktok-has-another-75-days-to-find-a-buyer-trump-says-walmart-considering-a-bid/1100-6530637/",
    "timestamp": "2025-04-04T18:22:00Z"
  },
  {
    "title": "'There Will Be Blood': JPMorgan Hikes Odds of Trump-Triggered Recession to 60%",
    "description": "Alarm over U.S. President Donald Trump's tariffs continues to grow, with stocks \nplummeting and JPMorgan warning that \"the risk of recession in the global economy this year is raised to 60%, up from 40%.\"\nAfter China announced new 34% tariffs on all American …",
    "link": "https://www.commondreams.org/news/trump-tariffs-recession",
    "timestamp": "2025-04-04T18:21:59Z"
  },
  {
    "title": "Trump tariffs: American businesses are 'angry,' worried about survival, and say keeping prices low will be 'really hard'",
    "description": "U.S. business owners say the Trump administration's newly announced tariffs would increase their costs, potentially forcing them to raise prices for customers.",
    "link": "https://www.cnbc.com/2025/04/04/trump-tariffs-us-businesses-are-angry-worried-about-survival-price-hikes.html",
    "timestamp": "2025-04-04T18:21:06Z"
  },
  {
    "title": "What this disastrous week taught us about the Trump presidency",
    "description": "Donald Trump’s tariffs were at once predictable and shocking. Predictable, in the sense that Trump had been crystal-clear about wanting across-the-board tariffs during the campaign. Shocking, because they have been implemented in a manner that appears extreme…",
    "link": "https://www.vox.com/politics/407222/trump-tariff-loomer-kennedy",
    "timestamp": "2025-04-04T18:20:50Z"
  },
  {
    "title": "Think twice before bailing out of the stock market, financial advisers say",
    "description": "For investing drops of this size have happened throughout history.",
    "link": "https://www.bostonherald.com/2025/04/04/financial-advisers-stock-market/",
    "timestamp": "2025-04-04T18:20:49Z"
  },
  {
    "title": "‘Signalgate’: how the US government creates and guards its secrets",
    "description": "The US system that classifies and protects secrets has emerged in a curious way since the 20th century.",
    "link": "https://theconversation.com/signalgate-how-the-us-government-creates-and-guards-its-secrets-253569",
    "timestamp": "2025-04-04T18:20:27Z"
  },
  {
    "title": "Utah’s Decision to Ban Fluoride Is a Bad Move for Kids",
    "description": "Becoming the first state to ban fluoride is going to cost Utah, both financially and dentally",
    "link": "https://www.scientificamerican.com/article/utahs-decision-to-ban-fluoride-is-a-bad-move-for-kids/",
    "timestamp": "2025-04-04T18:20:00Z"
  },
  {
    "title": "Remember that European war? Only you-know-who could make it even worse.",
    "description": "The Russia-Ukraine war is mostly out of news sight, what with Trump's shall we say rather lively happenings at home, such as inflicting U.S.-harming tariffs, which \"shows no comprehension as to what he is doing,\" converting the world's oldest democracy into h…",
    "link": "https://www.pmcarpenter.com/post/remember-that-european-war-only-you-know-who-could-make-it-even-worse",
    "timestamp": "2025-04-04T18:19:46Z"
  },
  {
    "title": "Meta to Shutter Fact-Checking in the United States on Monday",
    "description": "Meta on Friday announced it will officially end its fact-checking program in favor of community notes on its Facebook, Instagram, and Threads platforms on Monday.\nThe post Meta to Shutter Fact-Checking in the United States on Monday appeared first on Breitbar…",
    "link": "https://www.breitbart.com/politics/2025/04/04/meta-to-shutter-fact-checking-in-the-united-states-monday/",
    "timestamp": "2025-04-04T18:19:17Z"
  },
  {
    "title": "Donald Trump signs Executive Order giving TikTok another 75 days to find a US buyer",
    "description": "The president has recently entertained an array of offers from US businesses seeking to buy a share of the popular social media site.",
    "link": "https://www.thejournal.ie/trump-signs-executive-order-giving-tiktok-another-75-days-to-find-a-us-buyer-6669057-Apr2025/",
    "timestamp": "2025-04-04T18:19:03Z"
  },
  {
    "title": "Ben Shapiro Hammers Trump’s Tariffs, Warns They Are Likely Unconstitutional And Based On Backward Logic",
    "description": "\"It is predicated on a bad idea of how international trade works. A fundamental misunderstanding of trade deficits,\" Shapiro said of Trump's policy\nThe post Ben Shapiro Hammers Trump’s Tariffs, Warns They Are Likely Unconstitutional And Based On Backward Logi…",
    "link": "https://www.mediaite.com/podcasts/ben-shapiro-hammers-trumps-tariffs-warns-they-are-likely-unconstitutional-and-based-on-backward-logic/",
    "timestamp": "2025-04-04T18:18:52Z"
  },
  {
    "title": "TikTok Gets Another 75-Day Reprieve From Ban",
    "description": "U.S. President Donald Trump today said that he is signing an executive order to keep TikTok running for an additional 75 days as his administration continues to work on the sale of the social network's U.S. operations.\n\n\n\n\n\nTikTok was barred from operating in…",
    "link": "https://www.macrumors.com/2025/04/04/tiktok-75-day-ban-extension/",
    "timestamp": "2025-04-04T18:18:15Z"
  },
  {
    "title": "Joe Biden Was “a Shell of Himself” by End of Term. Hunter Biden Didn’t Help.",
    "description": "Veteran political journalists Jonathan Allen and Amie Parnes share details from their new book about Joe Biden’s decline; his relationship with Hunter Biden, his “closest political adviser”; and his campaign’s attempt to undermine Kamala Harris.",
    "link": "https://www.vanityfair.com/news/story/joe-biden-was-a-shell-of-himself-hunter-didnt-help",
    "timestamp": "2025-04-04T18:17:55Z"
  },
  {
    "title": "Trump says he will extend TikTok ban deadline again",
    "description": "Trump said he would sign an executive order allowing TikTok to operate in the United States for 75 additional days.\nAndrew Harnik/Getty Images\nPresident Donald Trump announced on Friday he would extend the TikTok ban deadline.\nTikTok's Chinese owner, ByteDanc…",
    "link": "https://biztoc.com/x/ef511dc56be9cb75",
    "timestamp": "2025-04-04T18:17:41Z"
  },
  {
    "title": "Nasdaq falls into bear market territory as stocks extend selloff after Powell signals no imminent rate cuts",
    "description": "The stock market continued its collapse Friday as the Nasdaq fell into a bear market amid the fallout from President Donald Trump’s hefty “Liberation Day” tariffs. China matched the U.S. by imposing 34% retaliatory tariffs on U.S. imports. Amid the market tur…",
    "link": "https://biztoc.com/x/0fad2a8c4c2fdc28",
    "timestamp": "2025-04-04T18:17:33Z"
  },
  {
    "title": "Trump says he will again extend the deadline for TikTok’s sale",
    "description": "President Donald Trump said Friday that he is signing an executive order to extend TikTok’s deadline to find a non-Chinese buyer by another 75 days, giving parent company ByteDance more time to make a deal for the popular social media app.",
    "link": "https://biztoc.com/x/7424a23b526bf285",
    "timestamp": "2025-04-04T18:17:31Z"
  },
  {
    "title": "Trump’s tariff formula has fancy Greek symbols. No one is sure why",
    "description": "President Donald Trump this week unleashed an economic hurricane by hitting dozens of countries with a punishing wave of tariffs. In order to explain the specific tariff imposed on any given country, the White House shared a sophisticated-looking formula that…",
    "link": "https://biztoc.com/x/f990c1186eb19bf7",
    "timestamp": "2025-04-04T18:17:27Z"
  },
  {
    "title": "US tariffs: Europe prepares 'calm & unified' response",
    "description": "Nations from Canada to China have readied retaliation in an escalating trade war after Trump raised tariff barriers to their highest level in more than a century this week, leading to a plunge in world financial markets. In Japan, one of US' top trading partn…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-tariffs-europe-prepares-calm-unified-response/articleshow/119989512.cms",
    "timestamp": "2025-04-04T18:16:58Z"
  },
  {
    "title": "Republicans Advance Trillion-Dollar Tax Cuts As Trump Threatens To Blow Up Economy",
    "description": "Tariffs? What tariffs? Senate Republicans are rushing to pass tax cuts while odds of an economic recession spike.",
    "link": "https://www.huffpost.com/entry/donald-trump-tariffs-tax-cus_n_67f00f60e4b0bb67eb7add13",
    "timestamp": "2025-04-04T18:15:56Z"
  },
  {
    "title": "Price analysis 4/4: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, TON, LEO, LINK",
    "description": "Bitcoin (BTC) price has managed to stay above the $80,000 level as volatility wrecked US stock markets on April 3 and April 4. The failure of the bears to capitalize on the opportunity shows a lack of selling at lower levels.Risky assets were rattled after US…",
    "link": "https://cointelegraph.com/news/price-analysis-4-4-btc-eth-xrp-bnb-sol-doge-ada-ton-leo-link",
    "timestamp": "2025-04-04T18:15:00Z"
  },
  {
    "title": "Keep calm and heed Warren Buffett — history shows market meltdowns are short-lived",
    "description": "Ted Rechtshaffen: The market will settle where it should and big swings are simply opportunities along the way",
    "link": "https://financialpost.com/investing/heed-warren-buffett-stock-market-meltdowns-short-lived",
    "timestamp": "2025-04-04T18:12:13Z"
  },
  {
    "title": "Trump raises eyebrows by sharing video claiming he's 'purposely CRASHING the market'",
    "description": "President Donald Trump raised eyebrows Friday by sharing a video on Truth Social that claims he purposefully crashed the stock market to \"push cash into treasuries.\" Trump's timing was especially provocative because his rollout of tariffs the previous day res…",
    "link": "https://freerepublic.com/focus/f-news/4308859/posts",
    "timestamp": "2025-04-04T18:12:04Z"
  },
  {
    "title": "TikTok Won’t Go Dark, Yet; Trump Gives App Another Reprieve As China Tariffs Now Linked To Deal",
    "description": "TikTok will not be going dark tomorrow for the over 135 million users of the social media app, thanks to Donald Trump. Pummeled by bad news and a cratering stock market in response to his global tariffs unveiling on April 2 a.k.a. “Liberation Day,” POTUS typi…",
    "link": "http://deadline.com/2025/04/tiktok-ban-delayed-trump-tariffs-1236359850/",
    "timestamp": "2025-04-04T18:11:21Z"
  },
  {
    "title": "Jerome Powell goes against Donald Trump, warns tariffs could stoke inflation flames, signals Fed will hit pause on rate moves until economic dust settles",
    "description": "Jerome Powell warns that Trump’s tariffs could drive inflation higher and slow economic growth. The Federal Reserve is holding off on interest rate changes until the economic impact becomes clear. Powell emphasized the need to keep inflation in check, despite…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jerome-powell-goes-against-donald-trump-warns-tariffs-could-stoke-inflation-flames-signals-fed-will-hit-pause-on-rate-moves-until-economic-dust-settles/articleshow/119989330.cms",
    "timestamp": "2025-04-04T18:11:20Z"
  },
  {
    "title": "MAGA Mandate: Trump Gives Dept. Of Education 10 Days To Dead DEI Programs Or Lose Funding",
    "description": "Donald Trump's administration sent a letter to states and school demanding that they end DEI programs in ten days or lose federal funding\nThe post MAGA Mandate: Trump Gives Dept. Of Education 10 Days To Dead DEI Programs Or Lose Funding appeared first on Boss…",
    "link": "http://bossip.com/2837080/department-of-education-to-lose-federal-funds-if-dei-continues/",
    "timestamp": "2025-04-04T18:10:45Z"
  },
  {
    "title": "US seeks ideas for Golden Dome's missile interceptors in space",
    "description": "The Missile Defense Agency and US Space Force are holding a series of meetings to discuss space-based interceptors.",
    "link": "https://www.jpost.com/international/article-848912",
    "timestamp": "2025-04-04T18:10:39Z"
  },
  {
    "title": "Trump delays TikTok ban again",
    "description": "Donald Trump’s 75-day delay of the TikTok ban law taking effect would’ve expired this weekend, but on Friday, he announced on Truth Social that “I am signing an Executive Order to keep TikTok up and running for an additional 75 days.” Despite several publicly…",
    "link": "https://www.theverge.com/news/643730/tiktok-ban-delay-donald-trump",
    "timestamp": "2025-04-04T18:09:49Z"
  },
  {
    "title": "Deadline for US sale of TikTok is extended",
    "description": "Trump says additional 75 days will allow US companies more time to finalise acquisition deal",
    "link": "https://www.irishtimes.com/business/2025/04/04/deadline-for-us-sale-of-tiktok-is-extended/",
    "timestamp": "2025-04-04T18:09:24Z"
  },
  {
    "title": "13 years after it was first teased, the official Mewgenics trailer is here with live-action sexual dysfunction, brutal violence, a divine grudge, and more than 100 truly awful cats",
    "description": "It's not often I point to a videogame trailer and say \"you gotta see this,\" but you gotta see this.",
    "link": "https://www.pcgamer.com/games/roguelike/13-years-after-it-was-first-teased-the-official-mewgenics-trailer-is-here-with-live-action-sexual-dysfunction-brutal-violence-a-divine-grudge-and-more-than-100-truly-awful-cats/",
    "timestamp": "2025-04-04T18:09:16Z"
  },
  {
    "title": "20 items and goods most exposed to price shocks from Trump tariffs",
    "description": "President Donald Trump's tariffs will raise the prices on some goods more dramatically than others. See which items will suffer the biggest jumps.",
    "link": "https://www.cnbc.com/2025/04/04/trump-tariffs-20-items-and-goods-most-exposed-to-price-shocks.html",
    "timestamp": "2025-04-04T18:09:11Z"
  },
  {
    "title": "Laura Loomer Knows What Makes Trump Tick",
    "description": "Forget Signalgate. If there's one thing Trump won't tolerate, it's disloyalty.",
    "link": "https://www.vanityfair.com/news/story/laura-loomer-trump-firing",
    "timestamp": "2025-04-04T18:09:01Z"
  },
  {
    "title": "Nintendo Delays Switch 2 Preorders Over Trump Tariffs",
    "description": "Within hours of President Donald Trump's announcement that he would impose double-digit tariffs on all imports from nearly every country, markets reacted",
    "link": "https://reason.com/2025/04/04/nintendo-delays-switch-2-preorders-over-trump-tariffs/",
    "timestamp": "2025-04-04T18:08:08Z"
  },
  {
    "title": "Trump Fires National Security Agency Director Timothy Haugh: Report",
    "description": "US President Donald Trump fired General Timothy Haugh as director of the National Security Agency, in a national security purge that sources said on Friday included more than a dozen staff at the White House national security council.",
    "link": "https://www.ndtv.com/world-news/trump-fires-national-security-agency-director-timothy-haugh-report-8089385",
    "timestamp": "2025-04-04T18:07:57Z"
  },
  {
    "title": "Nintendo delays Switch 2 preorders in the U.S. over tariff impacts",
    "description": "Nintendo says Switch 2 preorders won't go live in the U.S. on April 9, citing President Trump's newly revealed tariffs.",
    "link": "https://venturebeat.com/games/nintendo-delays-switch-2-preorders-in-the-u-s-over-tariff-impacts/",
    "timestamp": "2025-04-04T18:07:28Z"
  },
  {
    "title": "Judge tells Trump administration that it has to stop its freeze on FEMA grants — for real this time",
    "description": "President Donald Trump's executive orders have prompted lawsuits.\nJim WATSON / AFP\nA judge ordered the Trump administration to stop freezing FEMA grants to states.\nThe ruling followed a lawsuit 22 states and Washington, DC, brought against the administration.…",
    "link": "https://biztoc.com/x/6cbd682ccb691ac2",
    "timestamp": "2025-04-04T18:06:30Z"
  },
  {
    "title": "Trump's tariff rates for other countries radically larger than Word Trade data",
    "description": "President Donald Trump announced an aggressive, far-reaching \"reciprocal tariff\" policy this week, leaving many economists and U.S. trade partners to question how the White House calculated its rates.\nTrump's plan established a 10% baseline tariff on almost e…",
    "link": "https://biztoc.com/x/cdcc9d494d3a2a4d",
    "timestamp": "2025-04-04T18:06:27Z"
  },
  {
    "title": "Don't expect the Fed to rescue stocks from tariff gambit",
    "description": "President Donald Trump, posting a message from a golf course in Florida on Friday, renewed his call for a Federal Reserve interest-rate cut amid the worst two-day stock selloff on Wall Street since the global pandemic. \nFederal Reserve Chairman Jerome Powell,…",
    "link": "https://biztoc.com/x/4fbdd1c6223bd505",
    "timestamp": "2025-04-04T18:06:23Z"
  },
  {
    "title": "1,000+ 'Hands Off!' Protests Planned Across US Saturday in Mass Mobilization Against Trump",
    "description": "In what one outlet has reported is slated to be the largest single-day action to resist the Trump administration since U.S. President Donald Trump's return to power, hundreds of thousands of people nationwide are planning to mobilize on Saturday to say: \"Hand…",
    "link": "https://www.commondreams.org/news/hands-off-actions-april-5",
    "timestamp": "2025-04-04T18:06:18Z"
  },
  {
    "title": "Trump says he’s giving TikTok another 75 days to find a US buyer",
    "description": "WEST PALM BEACH, Fla. (AP) — President Donald Trump on Friday said is signing an executive order to keep TikTok running in the U.S. for another 75 days to give his administration more time to broker a deal to bring the social media platform under American own…",
    "link": "https://biztoc.com/x/c3c8be2196db0dc2",
    "timestamp": "2025-04-04T18:06:16Z"
  },
  {
    "title": "Trump extends deadline to keep TikTok running in US",
    "description": "US President Donald Trump has extended the TikTok ban deadline by an additional 75 days.",
    "link": "https://www.bbc.com/news/articles/cx256dd1znpo",
    "timestamp": "2025-04-04T18:06:13Z"
  },
  {
    "title": "Trump won on nostalgia, but he's delivering on something else",
    "description": "The View From DAVID WEIGEL\n, the new 2024 campaign tell-all from Jonathan Allen and Amie Parnes, is loaded with bad Democratic omens. One of them was apparent to a Kamala Harris strategist, who kept encountering Black men who were converts for Donald Trump, a…",
    "link": "https://biztoc.com/x/199a36f07e54a1dc",
    "timestamp": "2025-04-04T18:06:10Z"
  },
  {
    "title": "Hinge Health is considering delaying its IPO as the markets plummet on Trump tariffs",
    "description": "The healthcare startup is considering putting its public market debut on pause, Business Insider has learned, as the markets sink on Trump's tariffs.",
    "link": "https://www.businessinsider.com/hinge-health-delaying-planned-ipo-2025-4",
    "timestamp": "2025-04-04T18:05:26Z"
  },
  {
    "title": "Bitcoin Will Be Out of the Woods if Major Support Level Holds Over Next Two Weeks, Says Arthur Hayes",
    "description": "BitMEX co-founder Arthur Hayes believes Bitcoin (BTC) may remain in an uptrend if it can hold one key level amid the massive selloff roiling the markets. Hayes tells his 662,400 followers on the social media platform X that if Bitcoin holds $76,500 as support…",
    "link": "https://dailyhodl.com/2025/04/04/bitcoin-will-be-out-of-the-woods-if-major-support-level-holds-over-next-two-weeks-says-arthur-hayes/",
    "timestamp": "2025-04-04T18:05:24Z"
  },
  {
    "title": "Averting ayatollah's atomic Auschwitz: The US, Israel should bomb Iran now",
    "description": "With each passing day, the would-be Hitler of Persia is drawing ever closer to his goal of obtaining a nuclear arsenal, threatening everyone and everything that all of us hold dear.",
    "link": "https://www.jpost.com/opinion/article-848734",
    "timestamp": "2025-04-04T18:05:23Z"
  },
  {
    "title": "Trump Kicks TikTok Can Down Road For 75 More Days As American Firms Vie For App",
    "description": "President Donald Trump announced Friday via Truth Social that he would be signing a 75-day extension of TikTok, giving the app more time to find a buyer.",
    "link": "https://dailycaller.com/2025/04/04/donald-trump-tik-tok-extension-china-deal-75-days/",
    "timestamp": "2025-04-04T18:05:21Z"
  },
  {
    "title": "Dan Rather Shaded Trump With A “Turkish Proverb,” And It’s Gone Hugely Viral",
    "description": "The veteran broadcast journalist shared one simple sentence on Facebook that got nearly a million likes and more than 60,000 comments.",
    "link": "https://www.huffpost.com/entry/dan-rather-donald-trump-turkish-proverb-facebook_n_67efe3b0e4b0d50ac8763c56",
    "timestamp": "2025-04-04T18:05:15Z"
  },
  {
    "title": "Bank of Canada Seen Making Deeper Rate Cuts Amid Stock Rout, Job Losses",
    "description": "The Bank of Canada is expected to cut interest rates more deeply as US President Donald Trump’s tariff barrage sends world markets into a tailspin and data show the Canadian job market already taking damage.",
    "link": "https://financialpost.com/pmn/business-pmn/bank-of-canada-seen-making-deeper-rate-cuts-amid-stock-rout-job-losses",
    "timestamp": "2025-04-04T18:04:36Z"
  },
  {
    "title": "Bank of Canada expected to make deeper rate cuts amid stock rout, job losses",
    "description": "The Bank of Canada could cut interest rates more deeply as U.S. President Donald Trump’s tariffs send world markets into a chaos. Read more.",
    "link": "https://financialpost.com/news/economy/bank-of-canada-deeper-rate-cuts-stock-rout-job-losses",
    "timestamp": "2025-04-04T18:04:36Z"
  },
  {
    "title": "Trump's tariff rates for other countries radically larger than Word Trade data",
    "description": "A report suggests the trade-weighted average tariff rates in most countries are much different than the figures touted by the Trump administration.",
    "link": "https://www.cnbc.com/2025/04/04/trumps-tariff-rates-for-other-countries-larger-than-word-trade-data.html",
    "timestamp": "2025-04-04T18:04:25Z"
  },
  {
    "title": "Bryson DeChambeau lauds Trump as ‘great ambassador for the game’ as PGA Tour, LIV Golf talks continue Y",
    "description": "Amid continued talks between the PGA Tour and the financial backers of LIV Golf, Bryson DeChambeau is happy to have President Donald Trump as an \"ambassador\" for the sport.",
    "link": "https://www.foxnews.com/sports/bryson-dechambeau-lauds-trump-great-ambassador-game-pga-tour-liv-golf-talks-continue",
    "timestamp": "2025-04-04T18:04:13Z"
  },
  {
    "title": "Liberation Day and Trump tariffs are not the end of trade. It's only the beginning",
    "description": "Our economists say the invisible hand will take care of us. But they ignore what is right in front of them. Manufacturing remains the most productive sector of the American economy.",
    "link": "https://www.foxnews.com/opinion/liberation-day-trump-tariffs-not-end-trade-its-only-beginning",
    "timestamp": "2025-04-04T18:03:33Z"
  },
  {
    "title": "Trump again extends TikTok ban deadline with executive order",
    "description": "Trump said he would again sign an executive order extending the deadline for TikTok to find a new owner for its US operations.",
    "link": "https://www.businessinsider.com/tiktok-ban-deadline-trump-executive-order-2025-4",
    "timestamp": "2025-04-04T18:03:32Z"
  },
  {
    "title": "Why top minds at Goldman Sachs say clients aren't giving up on US stocks — yet",
    "description": "Stocks are melting down across the globe, and US market leadership is in jeopardy. But clients of Goldman Sachs Asset Management aren't panicking.",
    "link": "https://www.businessinsider.com/stock-market-crash-outlook-us-equities-goldman-sachs-investing-strategy-2025-4",
    "timestamp": "2025-04-04T18:03:19Z"
  },
  {
    "title": "Trump says he will sign an EO to keep TikTok running for an additional 75 days, as a deal \"requires more work to ensure all necessary approvals are signed\" (Jonathan Vanian/CNBC)",
    "description": "Jonathan Vanian / CNBC:\nTrump says he will sign an EO to keep TikTok running for an additional 75 days, as a deal “requires more work to ensure all necessary approvals are signed”  —  President Donald Trump on Friday extended a deadline requiring China-based …",
    "link": "https://mediagazer.com/250404/p7",
    "timestamp": "2025-04-04T18:02:14Z"
  },
  {
    "title": "Judge tells Trump administration that it has to stop its freeze on FEMA grants — for real this time",
    "description": "A federal judge wrote in an order on Friday that FEMA's manual review process was in violation of a previous court order.",
    "link": "https://www.businessinsider.com/federal-judge-trump-administration-fema-grants-lawsuit-violation-2025-4",
    "timestamp": "2025-04-04T18:01:20Z"
  },
  {
    "title": "Trump says he's giving TikTok another 75 days to find a US buyer",
    "description": "President Donald Trump says he's signing an executive order to keep TikTok running in the U.S. for another 75 days to give his administration more time to broker a deal to bring the social media platform under American ownership.",
    "link": "https://www.ksat.com/business/2025/04/04/trump-says-hes-giving-tiktok-another-75-days-to-find-a-us-buyer/",
    "timestamp": "2025-04-04T18:01:02Z"
  },
  {
    "title": "Despite Share Slide, Jeff Bezos And Amazon Look Likely To End Up Tariff Winners",
    "description": "Amazon's share price—and Jeff Bezos' net worth—slid after Trump's tariff announcements. But Amazon is positioned well to withstand the tariff blows. Here's why.",
    "link": "https://www.forbes.com/sites/phoebeliu/2025/04/04/despite-share-slide-billionaire-jeff-bezos-and-amazon-look-likely-trump-tariff-winners/",
    "timestamp": "2025-04-04T18:00:18Z"
  },
  {
    "title": "US oil service firms set for hit from Trump tariffs, tumbling oil prices",
    "description": "U.S. oilfield service firms are bracing for a hit as President Donald Trump's tariffs throw supply chains into disarray and tumbling oil prices set the stage...",
    "link": "https://finance.yahoo.com/news/us-oil-firms-set-hit-180007581.html",
    "timestamp": "2025-04-04T18:00:07Z"
  },
  {
    "title": "Trump’s tariffs: How will it hit me in my pocket and shopping trolley?",
    "description": "Trade war to push inflation higher, causing elevated prices in supermarkets and elsewhere",
    "link": "https://www.irishtimes.com/ireland/2025/04/04/trumps-tariffs-how-will-it-hit-me-in-my-pocket-and-shopping-trolley/",
    "timestamp": "2025-04-04T18:00:01Z"
  }
]