[
  {
    "title": "Cboe BZX files Solana ETF application on behalf of Franklin Templeton",
    "description": "The Chicago Board Options BZX Exchange (Cboe) has submitted an application on behalf of asset manager Franklin Templeton to list a Solana (SOL) exchange-traded fund (ETF) in the United States.According to the March 12 filing, Franklin Templeton’s proposed ETF…",
    "link": "https://cointelegraph.com/news/cboe-files-solana-etf-application-behalf-franklin-templeton",
    "timestamp": "2025-03-12T18:36:05Z"
  },
  {
    "title": "Ford talks to Carney, premiers ahead of trade meeting in Washington",
    "description": "TORONTO — Ontario Premier Doug Ford and federal Finance Minister Dominic LeBlanc suggested Wednesday they want to come out of a meeting with a top U.S. official with a “coherent plan” for the tariff road ahead. The pair, along with Kirsten Hillman, Canada’s a…",
    "link": "https://financialpost.com/pmn/ford-talks-to-carney-premiers-ahead-of-trade-meeting-in-washington",
    "timestamp": "2025-03-12T18:35:40Z"
  },
  {
    "title": "After PM Modi's Visit, US Vice-President, Top Officials To Be In India",
    "description": "US Vice President JD Vance will visit India this month as well as his two top officials -- National Intelligence Director Tulsi Gabbard and National Security Advisor Mike Waltz.",
    "link": "https://www.ndtv.com/india-news/after-pm-narendra-modis-visit-us-vice-president-jd-vance-tulsi-gabbard-mike-waltz-to-be-in-india-7911073",
    "timestamp": "2025-03-12T18:35:26Z"
  },
  {
    "title": "PEACE DEAL: Can Trump pull it off?",
    "description": "Well, Freepers? Can he get Putin to accept this deal? This is the most IMPORTANT peace deal I can remember in YEARS. Donald Trump is taking a huge risk and can succeed. I believe it!",
    "link": "https://freerepublic.com/focus/f-chat/4303817/posts",
    "timestamp": "2025-03-12T18:34:52Z"
  },
  {
    "title": "How steel and aluminum are a fundamental part of American life",
    "description": "Steel and aluminum are ubiquitous in Americans’ lives. A stainless steel refrigerator holds aluminum soda cans.",
    "link": "https://www.pbs.org/newshour/politics/how-steel-and-aluminum-are-a-fundamental-part-of-american-life",
    "timestamp": "2025-03-12T18:33:35Z"
  },
  {
    "title": "Blumenthal: Trump ‘Destroying’ Rule of Law, World Order",
    "description": "Senator Richard Blumenthal (D-CT) said on Wednesday on MSNBC’s “Ana Cabrera Reports” that President Donald Trump was “destroying” both the rule of law and the world order. Blumenthal said, “I’ve been to Ukraine six times. I’ve met with Volodymyr Zelensky prob…",
    "link": "https://freerepublic.com/focus/f-news/4303816/posts",
    "timestamp": "2025-03-12T18:33:18Z"
  },
  {
    "title": "EPA likely to move to further limit federal protections for wetlands",
    "description": "The Trump administration on Wednesday announced it will reconsider the reach of the nation’s bedrock clean water law and likely further limit the wetlands it covers",
    "link": "https://abcnews.go.com/Business/wireStory/epa-move-limit-federal-protections-wetlands-119724600",
    "timestamp": "2025-03-12T18:32:46Z"
  },
  {
    "title": "EPA likely to move to further limit federal protections for wetlands",
    "description": "The Trump administration on Wednesday announced it will reconsider the reach of the nation’s bedrock clean water law and likely further limit the wetlands it covers, building on a Supreme Court decision two years ago that removed federal protections for signi…",
    "link": "https://financialpost.com/pmn/epa-likely-to-move-to-further-limit-federal-protections-for-wetlands",
    "timestamp": "2025-03-12T18:32:36Z"
  },
  {
    "title": "Trump tariffs threaten Smurfit WestRock’s US supply",
    "description": "CEO Tony Smurfit tells Inside Business podcast he believes reason will win out in US trade policy",
    "link": "https://www.irishtimes.com/business/2025/03/12/trump-tariffs-threaten-smurfit-westrock-us-supply/",
    "timestamp": "2025-03-12T18:32:34Z"
  },
  {
    "title": "Shoe Prices Slowed ‘Modestly’ in February – But New Tariffs Could Dramatically Change That, FDRA Warns",
    "description": "Shoe prices decelerated in February in tandem with overall inflation as the threat of more tariffs loom, according to the latest data from the FDRA.",
    "link": "http://footwearnews.com/business/business-news/shoe-prices-february-2025-rise-inflation-tariffs-1234781632/",
    "timestamp": "2025-03-12T18:32:25Z"
  },
  {
    "title": "Rand Paul: Businesses and Workers Think Tariffs Are a Bad Idea",
    "description": "President Donald Trump's broad-based tariffs on imported goods from Canada and Mexico have drawn support from some businesses that stand to benefit from",
    "link": "https://reason.com/2025/03/12/rand-paul-tariffs-trump-continuing-resolution/",
    "timestamp": "2025-03-12T18:32:09Z"
  },
  {
    "title": "Moscow’s dilemma: Russia and Trump set the stage for Ukraine, but can Kiev be trusted?",
    "description": "The Jeddah talks have confirmed the long-obvious fact that Zelensky’s regime has no real options Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614102-moscows-dilemma-russia-and-trump/",
    "timestamp": "2025-03-12T18:32:07Z"
  },
  {
    "title": "Canada Tariffs on US Goods: 2024 and 2025 Compared",
    "description": "Canada has retaliated against the U.S. with new tariffs on American goods. How does the flood of tariffs compare to last year?",
    "link": "https://www.newsweek.com/canada-us-retaliatory-tariffs-donald-trump-2024-comparison-2043678",
    "timestamp": "2025-03-12T18:31:56Z"
  },
  {
    "title": "Education Department layoffs gut its civil rights office, leaving discrimination cases in limbo",
    "description": "The Education Department’s civil rights branch is losing nearly half its staff in the Trump administration’s layoffs, effectively gutting an office that already faced a backlog of thousands of complaints from students and families across the country",
    "link": "https://abcnews.go.com/US/wireStory/education-department-layoffs-gut-civil-rights-office-leaving-119724314",
    "timestamp": "2025-03-12T18:31:39Z"
  },
  {
    "title": "Volkswagen welcomes weapons opportunity",
    "description": "All options are on the table, Oliver Blume said, after the EU announced a massive boost to defense spending Read Full Article at RT.com",
    "link": "https://www.rt.com/business/614098-volkswagen-open-military-production/",
    "timestamp": "2025-03-12T18:31:00Z"
  },
  {
    "title": "Just Being A Bit More Crass About It",
    "description": "There isn't any difference between what Trump is saying and the erasure by most media organizations of Jewishness based on actual support for Palestinians over the past 15 months. Protests run by Jewish organizations have been labeled as antisemitic, and the …",
    "link": "https://www.eschatonblog.com/2025/03/just-being-bit-more-crass-about-it.html",
    "timestamp": "2025-03-12T18:30:00Z"
  },
  {
    "title": "Iran’s Khamenei says nuclear talks with US won’t lift sanctions",
    "description": "Supreme leader criticises the US for abandoning the nuclear deal and imposing sanctions, questions the value of talks.",
    "link": "https://www.aljazeera.com/news/2025/3/12/irans-khamenei-says-nuclear-talks-with-us-wont-lift-sanctions",
    "timestamp": "2025-03-12T18:29:56Z"
  },
  {
    "title": "What did Ratan Tata say about Elon Musk? Indian business icon’s wise advice might be the solution for tech mogul's Tesla struggles",
    "description": "Elon Musk faces immense challenges as Tesla's market value drops by $125 billion, driven by declining sales in Europe and China. Protests and the #TeslaTakedown movement further exacerbate the situation. Ratan Tata once praised Musk’s innovative spirit, but n…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/what-did-ratan-tata-say-about-elon-musk-indian-business-icons-wise-advice-might-be-the-solution-for-tech-moguls-tesla-struggles/articleshow/118945878.cms",
    "timestamp": "2025-03-12T18:29:27Z"
  },
  {
    "title": "Tangible Irish relief as Brussels bears brunt of Trump's anger",
    "description": "Well, that went well.",
    "link": "https://news.sky.com/story/tangible-irish-relief-as-brussels-bears-brunt-of-donald-trumps-anger-13327277",
    "timestamp": "2025-03-12T18:29:00Z"
  },
  {
    "title": "Big Banks ‘Back in Action’ on Commercial Real Estate Financing: MIPIM Panelists",
    "description": "After a few tough post-pandemic years for real estate, the capital markets in the U.S. “are open” as banks have more liquidity to lend again, according to panelists at the MIPIM global real estate convention in Cannes, France.  Issuance for commercial mortgag…",
    "link": "http://commercialobserver.com/2025/03/banks-liquidity-cre-mipim/",
    "timestamp": "2025-03-12T18:28:45Z"
  },
  {
    "title": "Trump campaigned as a protector of free speech but critics say his actions threaten it",
    "description": "President Donald Trump campaigned as a champion of free speech, but First Amendment advocates say they’ve never seen freedom of speech under attack the way it has been in his second term.",
    "link": "https://biztoc.com/x/71b35f2399f3ddb9",
    "timestamp": "2025-03-12T18:28:29Z"
  },
  {
    "title": "Concrete Climate Action? Rainforest Paved for Global Elite Global Warming Gathering",
    "description": "In preparation for an international climate summit this fall, Brazilian state officials are clearing tens of thousands of acres of the Amazon rainforest to complete... Read More\nThe post Concrete Climate Action? Rainforest Paved for Global Elite Global Warmin…",
    "link": "https://www.dailysignal.com/2025/03/12/brazil-highway-cuts-down-rainforest-for-cop30-summit/",
    "timestamp": "2025-03-12T18:28:11Z"
  },
  {
    "title": "Trump tariffs could destroy U.S. demand for aluminum: Industry group",
    "description": "Canada's aluminum industry says Trump's 25 per cent tariffs could destroy demand for the metal in the American market. Read more.",
    "link": "https://financialpost.com/news/trump-tariffs-us-demand-aluminum",
    "timestamp": "2025-03-12T18:28:06Z"
  },
  {
    "title": "Stocks will be volatile until the cost of Trump's tariffs become clear, strategist says",
    "description": "Investors will need to have a sense of the cost of Donald Trump’s tariffs before the U.S. stock market finds a bottom, Empower’s chief investment strategist said, as reflected in the modest rebound in stocks after today’s better-than-expected CPI report.Read …",
    "link": "https://qz.com/stocks-trump-tariffs-volatility-investing-empower-1851769456",
    "timestamp": "2025-03-12T18:27:00Z"
  },
  {
    "title": "Shoppers are ditching Target after its DEI waffling and more are choosing Costco",
    "description": "Customer foot traffic and market share have shifted away from Target and toward Costco as the retailers diverge in their defense of DEI, survey shows.",
    "link": "https://www.businessinsider.com/shoppers-ditching-target-choosing-costco-after-dei-shift-2025-3",
    "timestamp": "2025-03-12T18:25:37Z"
  },
  {
    "title": "Climate Group Funded by Bill Gates Slashes Staff in Major Retreat",
    "description": "Breakthrough Energy, an umbrella organization funded by Bill Gates that works on a sprawling range of climate issues, announced deep cuts to its operations in an internal memo on Tuesday. Dozens of staff members were cut, including Breakthrough Energy’s unit …",
    "link": "https://freerepublic.com/focus/f-news/4303813/posts",
    "timestamp": "2025-03-12T18:25:30Z"
  },
  {
    "title": "Trump Sniffs Out NBC News Reporter’s Attempt To Guilt Trip Him Over Firing Federal Employees",
    "description": "President Donald Trump dodged an NBC News reporter's attempt Wednesday to guilt trip him for firing nearly half of the federal employees at the DOE.",
    "link": "https://dailycaller.com/2025/03/12/trump-nbc-kelly-odonnell-department-education/",
    "timestamp": "2025-03-12T18:25:29Z"
  },
  {
    "title": "Donald Trump Bought a $90,000 Tesla With 37 Recall Notices Against It (Jeremy White/Wired)",
    "description": "Jeremy White / Wired:\nDonald Trump Bought a $90,000 Tesla With 37 Recall Notices Against It  —  Here's hoping Elon Musk won't have to personally fix President Trump's new EV anytime soon.  —  In remarkable scenes outside the White House, the President of the …",
    "link": "https://www.memeorandum.com/250312/p92",
    "timestamp": "2025-03-12T18:25:01Z"
  },
  {
    "title": "EPA to Reconsider Legal Basis of US Climate Change Rules",
    "description": "The Environmental Protection Agency said Wednesday it will reconsider the Obama administration’s so-called endangerment finding, a move that could dismantle the legal foundation for sweeping climate change rules.",
    "link": "https://financialpost.com/pmn/business-pmn/epa-to-reconsider-legal-basis-of-us-climate-change-rules",
    "timestamp": "2025-03-12T18:24:34Z"
  },
  {
    "title": "Watch: Trump Mocks Rosie O'Donnell in Front of Irish Leader Day After She Announced She Fled to Ireland",
    "description": "One day after Rosie O'Donnell announced she moved to Ireland after President Donald Trump's election, Trump was in the White House Oval Office cracking jokes about his longtime rival.",
    "link": "https://www.breitbart.com/entertainment/2025/03/12/watch-trump-mocks-rosie-odonnell-in-front-of-irish-leader-day-after-she-announced-she-fled-to-ireland/",
    "timestamp": "2025-03-12T18:24:07Z"
  },
  {
    "title": "From soup cans to airplanes, steel and aluminum are a fundamental part of American life",
    "description": "Steel and aluminum are ubiquitous in Americans’ lives. A stainless steel refrigerator holds aluminum soda cans. A stainless steel drum tumbles inside an aluminum washing machine. They’re the metals used in cars and airplanes, phones and frying pans, skyscrape…",
    "link": "https://financialpost.com/pmn/from-soup-cans-to-airplanes-steel-and-aluminum-are-a-fundamental-part-of-american-life-2",
    "timestamp": "2025-03-12T18:23:22Z"
  },
  {
    "title": "Donald Trump’s ‘everything’s computer’ quote becomes a catchphrase meme",
    "description": "\"Everything's computer\" has become the hot new catchphrase meme after Donald Trump used it to describe the dashboard of a Tesla. The President and Elon Musk held a press conference to show off a red Model S Plaid following mass protests at Tesla dealerships a…",
    "link": "https://www.dailydot.com/memes/everythings-computer-trump-quote-meme/",
    "timestamp": "2025-03-12T18:23:10Z"
  },
  {
    "title": "Jim Cramer Wonders If Trump Is 'Manufacturing' A Recession",
    "description": "\"It doesn't make any sense,\" the CNBC host said.",
    "link": "https://www.huffpost.com/entry/jim-cramer-donald-trump-manufacturing-recession_n_67d1b228e4b0668b4e9d294a",
    "timestamp": "2025-03-12T18:22:40Z"
  },
  {
    "title": "Foreign-born highest since 1890 — shock new figures show how much Biden changed America",
    "description": "The record level of immigration has profound implications for taxpayers, schools, American workers, and our ability to assimilate so many people.",
    "link": "https://nypost.com/2025/03/12/opinion/foreign-born-highest-since-1890-shock-new-figures-show-how-much-biden-changed-america/",
    "timestamp": "2025-03-12T18:21:59Z"
  },
  {
    "title": "Steel At Heart Of New Trump Trade War",
    "description": "US President Donald Trump's new tariffs on steel target a major industry that is found in everything from cars to buildings but was already facing a range of challenges.",
    "link": "https://www.ibtimes.com.au/steel-heart-new-trump-trade-war-1856809",
    "timestamp": "2025-03-12T18:21:07Z"
  },
  {
    "title": "Trump campaigned as a protector of free speech but critics say his actions threaten it",
    "description": "President Donald Trump campaigned as a champion of free speech, but First Amendment advocates say they’ve never seen freedom of speech under attack the way it has been in his second term.",
    "link": "https://www.pbs.org/newshour/politics/trump-campaigned-as-a-protector-of-free-speech-but-critics-say-his-actions-threaten-it",
    "timestamp": "2025-03-12T18:20:41Z"
  },
  {
    "title": "Trump Declares He Could Do ‘Devastating’ Things to Russia, But Doesn’t Want to Because He Want to ‘Get Peace’",
    "description": "President Donald Trump said that he could do \"devastating\" things to Russia, but doesn't want to because he hopes to broker a peace between it and Ukraine\nThe post Trump Declares He Could Do ‘Devastating’ Things to Russia, But Doesn’t Want to Because He Want …",
    "link": "https://www.mediaite.com/news/trump-declares-he-could-do-devastating-things-to-russia-but-doesnt-want-to-because-he-want-to-get-peace/",
    "timestamp": "2025-03-12T18:20:11Z"
  },
  {
    "title": "Donald Trump says Putin faces 'very bad punishment' if he doesn't accept Ukraine ceasefire",
    "description": "Ukrainian officials have signalled for a 30-day ceasefire with Russia as Trump calls for an end to the war",
    "link": "https://www.ladbible.com/news/world-news/trump-ukraine-putin-russia-ceasefire-consequences-490558-20250312",
    "timestamp": "2025-03-12T18:19:55Z"
  },
  {
    "title": "'Who are you with?' Trump scoffs at reporter from Kari Lake's Voice of America",
    "description": "President Donald Trump lashed out at a reporter from Voice of America, which failed Arizona Republican candidate Kari Lake advises.During a Wednesday meeting in the Oval Office, Irish Prime Minister Micheál Martin said his country backed a two-state solution …",
    "link": "https://www.rawstory.com/trump-voice-of-america/",
    "timestamp": "2025-03-12T18:19:47Z"
  },
  {
    "title": "Gavin Newsom's Latest Podcast Sees Democrat Governor 'Enjoy' Chummy Chat With Steve Bannon",
    "description": "The MAGA kingpin joked about turning the \"globalist\" California governor into a \"populist nationalist,\" while Newsom quipped about his \"deprogramming.\"",
    "link": "https://www.huffpost.com/entry/gavin-newsom-steve-bannon-podcast_n_67d18fc6e4b0668b4e9cfc88",
    "timestamp": "2025-03-12T18:19:43Z"
  },
  {
    "title": "Ontario aluminum packaging maker squeezed by tariffs — not just Canada-U.S. levies",
    "description": "A company that makes pie tins, takeout containers and other items out of aluminum foil is getting squeezed by tariffs — and not just the ones being fired between Canada and the U.S. Sam Thang, the plant manager at Wohler Canada Inc. in Mississauga, Ont., says…",
    "link": "https://financialpost.com/pmn/ontario-aluminum-packaging-maker-squeezed-by-tariffs-not-just-canada-u-s-levies",
    "timestamp": "2025-03-12T18:18:49Z"
  },
  {
    "title": "Time for a boycott of all things American? | Brief letters",
    "description": "Donald Trump and Gianni Infantino | Wartime allies | Popular insult | Cinema adverts | Clean air\nWith Donald Trump and Gianni Infantino cosying up to each other, we will have to boycott the 2026 World Cup and all things American (Gianni Infantino and Donald T…",
    "link": "https://biztoc.com/x/3e585328aa1d8e0c",
    "timestamp": "2025-03-12T18:18:29Z"
  },
  {
    "title": "Trump warns Putin of “devastating” sanctions if ceasefire talks fail",
    "description": "U.S. President Donald Trump issued a stark warning to Russian President Vladimir Putin on Wednesday, stating that Russia could face \"devastating\" economic sanctions if it rejects a proposed 30-day ceasefire in Ukraine\nThe post Trump warns Putin of “devastatin…",
    "link": "https://en.protothema.gr/2025/03/12/trump-warns-putin-of-devastating-sanctions-if-ceasefire-talks-fail/",
    "timestamp": "2025-03-12T18:17:55Z"
  },
  {
    "title": "Trump Admin To Cut EPA Environmental Justice Offices Expanded Under Biden",
    "description": "The Environmental Protection Agency (EPA) is set to cut all environmental justice offices, according to an internal memo first reported by The New York Times",
    "link": "https://dailycaller.com/2025/03/12/trump-admin-epa-environmental-justice-offices-biden/",
    "timestamp": "2025-03-12T18:17:15Z"
  },
  {
    "title": "Canada to impose 25% tariffs on $29.8B in U.S. goods starting Thursday",
    "description": "OTTAWA — The federal government will impose 25 per cent tariffs on U.S. goods worth $29.8 billion in retaliation for steel and aluminum tariffs the administration of U.S. President Donald Trump imposed today. All countries, including Canada, were hit Wednesda…",
    "link": "https://financialpost.com/pmn/canada-to-impose-25-tariffs-on-29-8b-in-u-s-goods-starting-thursday",
    "timestamp": "2025-03-12T18:17:13Z"
  },
  {
    "title": "Business leaders know the economy is in trouble. Why won’t they stand up to Trump?",
    "description": "Stephanie Ruhle reacts to a meeting between Trump and America's top business leaders amid his tariff threats and explains what's going on behind the scenes.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-tariffs-business-leaders-stock-market-rcna196037",
    "timestamp": "2025-03-12T18:16:12Z"
  },
  {
    "title": "Done Deal: Historic ILA-USMX Contract Brings Six Years of ‘Labor Peace’ to East and Gulf Coast Ports",
    "description": "International Longshoremen’s Association (ILA) and United States Maritime Alliance (USMX) officials gathered in North Bergen, New Jersey on Tuesday to formally sign a landmark six-year master contract agreement, securing unprecedented...",
    "link": "https://gcaptain.com/done-deal-historic-ila-usmx-contract-brings-six-years-of-labor-peace-to-east-and-gulf-coast-ports/",
    "timestamp": "2025-03-12T18:14:32Z"
  },
  {
    "title": "US clears out remaining migrants from Guantanamo Bay",
    "description": "PENTAGON — The United States has cleared out the last migrants being held at its naval base at Guantanamo Bay, Cuba, sending them back to the U.S. mainland as they await deportation.\nTwo U.S. defense officials told VOA on Wednesday that 40 detainees, includin…",
    "link": "https://www.voanews.com/a/us-clears-out-remaining-migrants-from-guantanamo-bay/8008349.html",
    "timestamp": "2025-03-12T18:13:51Z"
  },
  {
    "title": "Trump says he feels 'very badly' for fired federal workers but 'many of them don't work at all'",
    "description": "President Trump said he feels \"very badly\" for the thousands of federal workers who lost their jobs in recent weeks but \"many of them don't work at all.\"",
    "link": "https://www.nbcnews.com/politics/doge/trump-feels-badly-fired-federal-workers-many-dont-work-rcna196068",
    "timestamp": "2025-03-12T18:13:39Z"
  },
  {
    "title": "‘Your Home for a Long Time’: Reporter Hits Back at Trump Calling NBC ‘One of the Worst Networks on Television’",
    "description": "An NBC reporter fired back at President Donald Trump as he bashed the network as “one of the worst on television.” The exchange occurred as Trump took questions from reporters as he sat with Ireland Prime Minister Micheál Martin at the White House. The presid…",
    "link": "https://www.mediaite.com/news/your-home-for-a-long-time-reporter-hits-back-at-trump-calling-nbc-one-of-the-worst-networks-on-television/",
    "timestamp": "2025-03-12T18:12:34Z"
  },
  {
    "title": "Cautious Russia awaits details from US on Ukraine ceasefire plan",
    "description": "After Russian forces made gains in 2024, U.S. President Donald Trump reversed U.S. policy on the war, launching bilateral talks with Moscow and suspending military assistance to Ukraine, demanding that it take steps to end the conflict.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/cautious-russia-awaits-details-from-us-on-ukraine-ceasefire-plan/articleshow/118946209.cms",
    "timestamp": "2025-03-12T18:12:05Z"
  },
  {
    "title": "Trump's Comments On Electric Vehicles Come Back To Haunt Him After Tesla Photo-Op",
    "description": "The president purchased one of Elon Musk's Teslas on Tuesday, which reminded social media users of his past comments on electric vehicles.",
    "link": "https://www.huffpost.com/entry/trumps-old-comments-on-electric-vehicles-come-back-to-haunt-him-after-tesla-photo-op_n_67d19e83e4b0598996917044",
    "timestamp": "2025-03-12T18:11:41Z"
  },
  {
    "title": "Can the devastated Gaza be brought back to life?",
    "description": "The Arab League has a solid plan to rebuild the enclave, but it could be doomed by opposition from Israel and the US Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614091-gaza-reconstruction-arab-plan/",
    "timestamp": "2025-03-12T18:10:59Z"
  },
  {
    "title": "What's at stake in the Mahmoud Khalil deportation fight?",
    "description": "Vague accusations and First Amendment concerns",
    "link": "https://theweek.com/politics/mahmoud-khalil-deportation-fight-stakes-trump-administration-first-amendment",
    "timestamp": "2025-03-12T18:10:30Z"
  },
  {
    "title": "Trump’s Tariffs Target Steel and Aluminum, a Fundamental Part of American Life",
    "description": "President Donald Trump's 25% tariffs on all steel and aluminum imports could have widespread impact on manufacturers and consumers.",
    "link": "https://time.com/7267296/trump-tariffs-target-steel-and-aluminum/",
    "timestamp": "2025-03-12T18:09:47Z"
  },
  {
    "title": "Donald Trump Bought a $90,000 Tesla With 37 Recall Notices Against It",
    "description": "No, you're not dreaming. In remarkable scenes outside the White House, the president of the United States has just gone and paid the better part of $100,000 for a car he's not yet driven, and which during the course of its production has been the subject of d…",
    "link": "https://biztoc.com/x/0ea2ed046b9e9601",
    "timestamp": "2025-03-12T18:09:15Z"
  },
  {
    "title": "Gingrich Warns Of ‘Very Dangerous’ Consequences as Dems Attack Trump",
    "description": "Former House Speaker Newt Gingrich is warning that Democrats’ “very dangerous” rhetoric and behavior could lead to something “serious” against President Donald Trump. During an interview on Fox News, Gingrich dismissed a claim by House Minority Leader Hakeem …",
    "link": "https://freerepublic.com/focus/f-bloggers/4303810/posts",
    "timestamp": "2025-03-12T18:09:10Z"
  },
  {
    "title": "Mark Carney responds to Trump’s trade war and annexation threats",
    "description": "Canada’s incoming prime minister, Mark Carney, urges respectful trade talks with Trump as retaliatory tariffs and annexation rhetoric escalate.",
    "link": "https://www.wbaltv.com/article/canada-trade-war-mark-carney-trump/64164623",
    "timestamp": "2025-03-12T18:09:03Z"
  },
  {
    "title": "'The View': Whoopi Rewrites 1980s Commercial Jingle With Elon Musk Lyrics",
    "description": "Following Donald Trump's stunt of shopping for and buying a Tesla from Elon Musk on the White House lawn this week, \"The View\" host Whoopi Goldberg decided to create a jingle for the \"infomercial,\" as she referred to the event. Well, more accurately, she deci…",
    "link": "https://freerepublic.com/focus/f-chat/4303807/posts",
    "timestamp": "2025-03-12T18:08:13Z"
  },
  {
    "title": "Why is a new Air Force One taking so long to build?",
    "description": "President Donald Trump wants a new plane — and he wants it sooner rather than later. But building a new Air Force One has taken longer and is more expensive than expected, which is raising the president's ire.\nTrump is \"angry over delays\" in completing a new …",
    "link": "https://biztoc.com/x/5fc4df093d7ac712",
    "timestamp": "2025-03-12T18:08:06Z"
  },
  {
    "title": "‘In DOGE we trust:’ House GOP governs by embracing Trump’s effort to cut government",
    "description": "The story the Democrats have leveraged for years may no longer be as true.",
    "link": "https://www.bostonherald.com/2025/03/12/house-gop-embraces-cuts/",
    "timestamp": "2025-03-12T18:07:43Z"
  },
  {
    "title": "JPMorgan sounds US recession alarm",
    "description": "President Donald Trump’s trade policies could undermine economic growth, according to JPMorgan investment bank Read Full Article at RT.com",
    "link": "https://www.rt.com/business/614093-us-tariffs-recession-risk/",
    "timestamp": "2025-03-12T18:06:36Z"
  },
  {
    "title": "Iran's Khamenei rejects idea of nuclear talks with US",
    "description": "DUBAI — Iran's Supreme Leader Ayatollah Ali Khamenei on Wednesday rejected the idea of holding negotiations with the United States over a nuclear deal, as a letter arrived from U.S. President Donald Trump calling for such talks. \nTrump said last week he had s…",
    "link": "https://www.voanews.com/a/iran-s-khamenei-rejects-idea-of-nuclear-talks-with-us/8008333.html",
    "timestamp": "2025-03-12T18:05:45Z"
  },
  {
    "title": "U.S. budget deficit surged in February, passing $1 trillion for new year-to-date record",
    "description": "The U.S. debt and deficit problem worsened during President Donald Trump's first month in office.",
    "link": "https://www.cnbc.com/2025/03/12/us-budget-deficit-surged-in-february-passing-1-trillion-for-new-year-to-date-record.html",
    "timestamp": "2025-03-12T18:05:45Z"
  },
  {
    "title": "RFK Jr. Blames Malnutrition For Measles Outbreak’s Severe Illnesses And Deaths",
    "description": "Let’s stipulate something before we dive into this post so that there is no misunderstanding: the rise of the anti-vax movement did not begin with Donald Trump’s foray into American politics. It’s been around since well before 2016, slowly but surely gaining …",
    "link": "https://www.techdirt.com/2025/03/12/rfk-jr-blames-malnutrition-for-measles-outbreaks-severe-illnesses-and-deaths/",
    "timestamp": "2025-03-12T18:04:40Z"
  },
  {
    "title": "The Trump Administration Should Not Risk A Recession And Its Economic Scarring",
    "description": "The economy is already showing signs of slowing: less hiring and possibly rising inflation.",
    "link": "https://www.forbes.com/sites/christianweller/2025/03/12/the-trump-administration-should-not-risk-a-recession-and-its-economic-scarring/",
    "timestamp": "2025-03-12T18:03:48Z"
  },
  {
    "title": "Senan Molony: Sighs of relief from the White House to Leinster House as Taoiseach earns Trump’s respect in Washington showdown",
    "description": "Phew! Taoiseach Micheál Martin survived a marathon open-mic session at the Oval Office as questions flew like bullets.",
    "link": "https://www.independent.ie/irish-news/politics/senan-molony-sighs-of-relief-from-the-white-house-to-leinster-house-as-taoiseach-earns-trumps-respect-in-washington-showdown/a1163189549.html",
    "timestamp": "2025-03-12T18:03:41Z"
  },
  {
    "title": "Senan Molony: Sighs of relief from the White House to Leinster House as Taoiseach earns Trump’s respect in Washington showdown",
    "description": "Phew! Taoiseach Micheál Martin survived a marathon open-mic session at the Oval Office as questions flew like bullets.",
    "link": "https://www.independent.ie/irish-news/senan-molony-sighs-of-relief-from-the-white-house-to-leinster-house-as-taoiseach-earns-trumps-respect-in-washington-showdown/a1163189549.html",
    "timestamp": "2025-03-12T18:03:41Z"
  },
  {
    "title": "‘He’s Not Jewish Anymore’: Trump Escalates Attack On Chuck Schumer Being ‘Palestinian’ By Taking Away His Religion",
    "description": "Trump concluded by jabbing Chuck Schumer in an escalation of his regular attack calling the top Democrat a \"Palestinian.\"\nThe post ‘He’s Not Jewish Anymore’: Trump Escalates Attack On Chuck Schumer Being ‘Palestinian’ By Taking Away His Religion first appeare…",
    "link": "https://www.mediaite.com/tv/hes-not-jewish-anymore-trump-escalates-attack-on-chuck-schumer-being-palestinian-by-taking-away-his-religion/",
    "timestamp": "2025-03-12T18:03:39Z"
  },
  {
    "title": "‘Purposely Misleading’: Trump Officials Accuse Biden Admin Of Deceptively Inflating ICE Arrest Stats",
    "description": "Senior ICE officials are accusing the Biden administration of egregiously misrepresenting data to make ICE arrests appear higher than they actually were.",
    "link": "https://dailycaller.com/2025/03/12/trump-admin-accuses-biden-admin-ice-stats/",
    "timestamp": "2025-03-12T18:02:15Z"
  },
  {
    "title": "Donald Trump and Elon Musk Are Driving America Over the Edge",
    "description": "The president and his billionaire sidekick turned the White House into a makeshift Tesla showroom amid a recession scare—a perfect encapsulation of the Trump-Musk regime.",
    "link": "https://www.vanityfair.com/trump-elon-musk-tesla-recession-2025",
    "timestamp": "2025-03-12T18:02:08Z"
  },
  {
    "title": "Is Public Service Loan Forgiveness Going Away? Understanding Trump’s Executive Order",
    "description": "PSLF isn’t going anywhere, yet. Trump’s Executive Order is vague and PSLF is protected by law. In the meantime, keep records of your payments and employment.",
    "link": "https://www.nerdwallet.com/article/loans/student-loans/pslf-executive-order#article",
    "timestamp": "2025-03-12T18:02:06Z"
  },
  {
    "title": "USAID instructs its staff in D.C. to shred and burn documents",
    "description": "If Team Trump had a problem with document destruction in the first term, the issue appears to have metastasized in the second term.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/usaid-instructs-staff-dc-shred-burn-documents-rcna196080",
    "timestamp": "2025-03-12T18:01:57Z"
  },
  {
    "title": "Global trade tensions escalate as EU and Canada impose retaliatory tariffs on US goods: Here’s what it means",
    "description": "The European Union and Canada have announced billions in retaliatory tariffs on US exports in response to President Donald Trump’s steel and aluminum levies. The trade dispute raises concerns about economic slowdown, rising consumer prices, and global market …",
    "link": "https://economictimes.indiatimes.com/news/international/us/global-trade-tensions-escalate-as-eu-and-canada-impose-retaliatory-tariffs-on-us-goods-heres-what-it-means/articleshow/118945844.cms",
    "timestamp": "2025-03-12T18:01:53Z"
  },
  {
    "title": "Trump Adds ‘Toyotathon’ And ‘Happy Honda Days’ To List Of Banned Woke DEI Words",
    "description": "Reflections on yesterday's Tesla sales event at the White House.",
    "link": "https://www.wonkette.com/p/trump-adds-toyotathon-and-happy-honda",
    "timestamp": "2025-03-12T18:01:42Z"
  },
  {
    "title": "Why is a new Air Force One taking so long to build?",
    "description": "Trump may look for alternatives for his new plane",
    "link": "https://theweek.com/politics/new-air-force-one-delays-trump-boeing",
    "timestamp": "2025-03-12T18:00:47Z"
  },
  {
    "title": "Inflation Cooled More Than Expected in Trump's First Full Month Back in Office",
    "description": "Inflation slowed more than expected in February, President Donald Trump's first full month back in office, according to Labor Department data released Wednesday.\nThe post Inflation Cooled More Than Expected in Trump's First Full Month Back in Office appeared …",
    "link": "https://freebeacon.com/latest-news/inflation-cooled-more-than-expected-in-trumps-first-full-month-back-in-office/",
    "timestamp": "2025-03-12T18:00:22Z"
  },
  {
    "title": "Britain Says Its ‘Disappointed’ That Trump Imposed Tariffs On Metals",
    "description": "Prime Minister Keir Starmer is treading softly with his response to Donald Trump’s increased tariffs on steel and aluminum in the hopes that he can negotiate a wider trade deal with the U.S.",
    "link": "https://www.forbes.com/sites/robertolsen-1/2025/03/12/britain-says-its-disappointed-that-trump-imposed-tariffs-on-metals/",
    "timestamp": "2025-03-12T18:00:08Z"
  },
  {
    "title": "Cross-border Montreal shopper feels 'punished' after being stung by tariffs on return home",
    "description": "Canadian cross-border shoppers are getting charged a surtax on some goods on their return home because of the trade war with the U.S. Here's what you need to know if you're planning to buy food across the border.",
    "link": "https://www.cbc.ca/news/canada/montreal/cross-border-shopping-u-s-canada-tariffs-1.7481220",
    "timestamp": "2025-03-12T18:00:00Z"
  },
  {
    "title": "Trump has opened a stark pre-election opened between Albanese and Dutton",
    "description": "The government is banking on voters appreciating that this time around with Trump is different.",
    "link": "https://www.abc.net.au/news/2025-03-13/anthony-albanese-labor-trump-tariffs/105041630",
    "timestamp": "2025-03-12T18:00:00Z"
  },
  {
    "title": "Disney Is Setting ‘Snow White’ Star Rachel Zegler Up To Fail",
    "description": "The Mouse House has laid the groundwork for her to be the scapegoat if the movie tanks.",
    "link": "https://decider.com/2025/03/12/disney-rachel-zegler-snow-white-scapegoat/",
    "timestamp": "2025-03-12T18:00:00Z"
  },
  {
    "title": "'The Bear' Star Ayo Edebiri: Elon Musk an ‘Idiot’ and a ‘Fascist’",
    "description": "Ayo Edebiri, the actress perhaps best known for her Golden Globe-winning performance in the critically acclaimed FX cooking drama \"The Bear,\" responded to Elon Musk sharing a rumor that she's starring in the next Pirates of the Caribbean film by blasting the …",
    "link": "https://www.breitbart.com/entertainment/2025/03/12/the-bear-star-ayo-edebiri-elon-musk-an-idiot-and-a-fascist/",
    "timestamp": "2025-03-12T17:58:10Z"
  },
  {
    "title": "Bank of Canada cuts its key interest rate to 2.75% as tariffs roil economy",
    "description": "OTTAWA — The Bank of Canada lowered its benchmark interest rate by a quarter point on Wednesday as the tariff battle with the United States starts to weigh on the Canadian economy. The policy rate stands at 2.75 per cent after the central bank’s seventh conse…",
    "link": "https://financialpost.com/pmn/bank-of-canada-cuts-its-key-interest-rate-to-2-75-as-tariffs-roil-economy-2",
    "timestamp": "2025-03-12T17:57:31Z"
  },
  {
    "title": "Watch Live: Donald Trump Holds Joint Press Conference with Irish Prime Minister",
    "description": "President Donald Trump holds a joint press conference with Irish Prime Minister Michael Martin on Wednesday, March 12.\nThe post Watch Live: Donald Trump Holds Joint Press Conference with Irish Prime Minister appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/12/watch-live-donald-trump-holds-joint-press-conference-with-irish-prime-minister/",
    "timestamp": "2025-03-12T17:56:38Z"
  },
  {
    "title": "Trump vows to take back 'stolen' wealth as tariffs on steel and aluminum imports go into effect",
    "description": "President Donald Trump is openly challenging U.S. allies by increasing tariffs on all steel and aluminum imports to 25% as he vows to take back wealth he says was “stolen” by other countries, drawing quick retaliation from Europe and Canada",
    "link": "https://biztoc.com/x/d549cba6fc2d26be",
    "timestamp": "2025-03-12T17:56:37Z"
  },
  {
    "title": "Trump Labor Department Cuts Child Care Programs For Its Own Employees",
    "description": "The changes likely won’t save huge sums of money but will help the Trump administration continue to signal it is cracking down on the federal workforce.",
    "link": "https://www.huffpost.com/entry/trump-labor-department-backup-child-care_n_67d1c116e4b00defe498771d",
    "timestamp": "2025-03-12T17:56:30Z"
  },
  {
    "title": "Steve Bannon Mocks Gavin Newsom: ‘You Love All the Oligarchs, and Particularly Elon, Until They Flip’",
    "description": "The political strategist says Silicon Valley has become an \"apartheid state\" under the Democratic governor\nThe post Steve Bannon Mocks Gavin Newsom: ‘You Love All the Oligarchs, and Particularly Elon, Until They Flip’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bannon-mocks-gavin-newsom-over-musk-podcast/",
    "timestamp": "2025-03-12T17:56:23Z"
  },
  {
    "title": "In 2020, what shaped support for Donald Trump switched from anti-Muslim to pro-police and anti-Black Lives matter sentiments",
    "description": "Recent US elections have illustrated the role that the way many Americans feel about race plays in shaping who they vote for. In new research, Nazita Lajevardi and Jan Zilinsky investigate how anti-Muslim and anti-Black Lives Matter sentiments shaped support …",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/03/12/in-2020-what-shaped-support-for-donald-trump-switched-from-anti-muslim-to-pro-police-and-anti-black-lives-matter-sentiments/",
    "timestamp": "2025-03-12T17:56:10Z"
  },
  {
    "title": "European shares snap losing streak on Ukraine ceasefire proposal",
    "description": "Retailers and sportswear-makers decline after bleak Puma forecast",
    "link": "https://www.irishtimes.com/business/2025/03/12/european-shares-snap-losing-streak-on-ukraine-ceasefire-proposal/",
    "timestamp": "2025-03-12T17:56:00Z"
  },
  {
    "title": "FCC Chair Asks YouTube TV Why It Hates God",
    "description": "Brendan Carr thinks YouTube TV might be discriminating against \"faith-based programming.\"",
    "link": "https://gizmodo.com/fcc-chair-asks-youtube-tv-why-it-hates-god-2000575057",
    "timestamp": "2025-03-12T17:55:05Z"
  },
  {
    "title": "Inflation Figures Show Smallest Yearly Increase in Housing Index Since 2021",
    "description": "The latest inflation numbers were hardly reflective of tariff anxieties, which have sent the stock market into a frenzied period of selloffs in recent weeks. The consumer price index (CPI) for all items rose 2.8 percent for the 12 months ending in February, w…",
    "link": "http://commercialobserver.com/2025/03/inflation-february-housing/",
    "timestamp": "2025-03-12T17:55:00Z"
  },
  {
    "title": "Who is Mahmoud Khalil, Palestinian student activist facing US deportation?",
    "description": "The Columbia University graduate had a key role in student protests over Gaza. Trump said his arrest was the first of \"many to come\".",
    "link": "https://www.bbc.com/news/articles/cgj5nlxz44yo",
    "timestamp": "2025-03-12T17:54:37Z"
  },
  {
    "title": "Comedian Matt Friend cracks up 'Fox & Friends' with viral Trump, Obama impressions",
    "description": "Comedian Matt Friend joins 'Fox & Friends' to show off his Trump, Obama and McConnell impersonations and describes what goes into his comedic mindset.",
    "link": "https://www.foxnews.com/media/comedian-matt-friend-cracks-up-fox-friends-viral-trump-obama-impressions",
    "timestamp": "2025-03-12T17:54:27Z"
  },
  {
    "title": "Pressed to accept a ceasefire in Ukraine, Putin seems likely to seek his own conditions",
    "description": "Putin has repeatedly ruled out a temporary break in hostilities.",
    "link": "https://www.bostonherald.com/2025/03/12/russia-ukraine-ceasefire/",
    "timestamp": "2025-03-12T17:54:24Z"
  },
  {
    "title": "FCC chairman asks the public to list every regulation he should remove",
    "description": "Federal Communications Commission chair Brendan Carr is asking the public to help him identify “unnecessary” regulations created by the agency so that he can eliminate them. Carr announced “In re: Delete, Delete, Delete” on Wednesday, in response to President…",
    "link": "https://www.theverge.com/news/628288/fcc-chair-brendan-carr-deregulate-delete",
    "timestamp": "2025-03-12T17:54:13Z"
  },
  {
    "title": "Tesla investor survey shows 85% believe Elon Musk's politics are having 'negative' or 'extremely negative' impact on company",
    "description": "More than eight out of every 10 respondents to a Morgan Stanley survey believe Tesla CEO Elon Musk’s controversial political activities are hurting his business.",
    "link": "https://www.nbcnews.com/business/business-news/tesla-investor-survey-shows-85-percent-believe-elon-musks-politics-rcna196086",
    "timestamp": "2025-03-12T17:53:21Z"
  }
]