[
  {
    "title": "Asian benchmarks slip after US stocks sink and Japan faces political uncertainty",
    "description": "Asian shares declined Wednesday, echoing a fall on Wall Street, as political uncertainty took centerstage in Japan, making for cautious trading on the Tokyo ...",
    "link": "https://finance.yahoo.com/news/asian-benchmarks-slip-us-stocks-033000760.html",
    "timestamp": "2025-09-03T03:30:00Z"
  },
  {
    "title": "Europe’s missing moment and the back-to-school blues",
    "description": "If Europe started the year with a long to-do list, at least there was optimism for a \"European Moment\". That hope now seems further off than ever",
    "link": "https://www.euractiv.com/section/politics/opinion/europes-lost-moment-and-the-back-to-school-blues/",
    "timestamp": "2025-09-03T03:28:17Z"
  },
  {
    "title": "Appeals Court Rules Trump Cannot Use Alien Enemies Act To Deport Members Of Venezuelan Gang",
    "description": "The move blocks a signature administration push that is destined for a final showdown at the U.S. Supreme Court.",
    "link": "https://www.huffpost.com/entry/trump-alien-enemies-act_n_68b7b4ebe4b06793d89c5d8a",
    "timestamp": "2025-09-03T03:26:52Z"
  },
  {
    "title": "Fmr US Army Special Forces Warns Cartels Of ‘Holy Hell Unleashed’ If They Try Anything Against America",
    "description": "Fmr U.S. Army Special Forces Jim Hanson warned drug cartels a \"holy hell\" would be \"unleashed\" if they tried to retaliate against US' crackdown on their crimes.",
    "link": "https://dailycaller.com/2025/09/02/fmr-us-army-special-forces-cartels-warning-counter-strike-us/",
    "timestamp": "2025-09-03T03:23:47Z"
  },
  {
    "title": "Late Night Open Thread: Chicago Throws Down",
    "description": "A bold move given recent protests and the size/weight of a Portillo's Italian Beef [image or embed] — Robert Downen (@robertdownen.bsky.social) September 2, 2025 at 4:36 PM Per Heather Cherone, at Chicago’s WTTW: … “Unidentifiable agents in unmarked vehicles …",
    "link": "https://balloon-juice.com/2025/09/02/late-night-open-thread-chicago-throws-down/",
    "timestamp": "2025-09-03T03:22:17Z"
  },
  {
    "title": "China showcases military might as Xi, Putin, Kim share stage in Beijing parade",
    "description": "The high-profile event in Beijing drew 26 foreign leaders, among them Russian President Vladimir Putin, North Korean leader Kim Jong Un, Pakistan’s Prime Minister Shehbaz Sharif, Nepal’s K.P. Sharma Oli, and Maldives President Mohamed Muizzu.",
    "link": "https://www.thehindubusinessline.com/news/world/china-showcases-military-might-as-xi-putin-kim-share-stage-in-beijing-parade/article70006641.ece",
    "timestamp": "2025-09-03T03:14:26Z"
  },
  {
    "title": "White House pushes back on speculation over Trump’s health",
    "description": "President Donald Trump was back in public Tuesday to announce a new location for US Space Command headquarters — and prove that rumors of his demise have been greatly exaggerated.",
    "link": "https://www.kitv.com/news/white-house-pushes-back-on-speculation-over-trump-s-health/article_14805d50-0733-5125-9e48-b286ee6650fd.html",
    "timestamp": "2025-09-03T03:13:32Z"
  },
  {
    "title": "Trump health misinformation swirls despite denial",
    "description": "From manipulated images to out-of-context photos, false claims that Donald Trump is seriously ill -- or even dead -- have swirled online.\nThe post Trump health misinformation swirls despite denial appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/trump-health-misinformation-swirls-despite-denial/article",
    "timestamp": "2025-09-03T03:12:20Z"
  },
  {
    "title": "U.S. Military Strike Sinks Venezuelan Drug Boat, 11 Dead",
    "description": "President Donald Trump announced Tuesday that U.S. military forces carried out a precision strike against a Venezuelan drug vessel tied to the cartel Tren de Aragua, killing 11 people. The operation took place in international waters in the southern Caribbean…",
    "link": "https://biztoc.com/x/62c2135a3ec62ac0",
    "timestamp": "2025-09-03T03:11:16Z"
  },
  {
    "title": "Intelligence meeting canceled after attacks by far-right activist Laura Loomer, Democratic senator says",
    "description": "Senate Intelligence Committee Vice Chairman Mark Warner said Tuesday that he is being blocked from a scheduled oversight meeting after interference from far-right activist Laura Loomer",
    "link": "https://www.nbcnews.com/politics/politics-news/intelligence-meeting-canceled-attacks-far-right-activist-laura-loomer-rcna228710",
    "timestamp": "2025-09-03T03:09:57Z"
  },
  {
    "title": "MAGA pushed Trump for the Epstein files but 99pc remain hidden",
    "description": "After weeks of growing pressure, the US House Committee has released part of the Epstein files. But it's unlikely to give people the answers they were hoping for.",
    "link": "https://www.abc.net.au/news/2025-09-03/epstein-files-released-after-pressure-but-reveal-nothing-new/105729026",
    "timestamp": "2025-09-03T03:09:19Z"
  },
  {
    "title": "Federal appeals court says Trump unlawfully invoked the Alien Enemies Act for deportations | CNN Politics",
    "description": "A divided federal appeals court on Tuesday said President Donald Trump’s use of the Alien Enemies Act to rapidly deport alleged Venezuelan gang members is unlawful and blocked its use in several southern states, issuing another blow to Trump’s invocation of t…",
    "link": "https://www.cnn.com/2025/09/02/politics/appeals-court-ruling-trump-alien-enemies-act-deportations-unlawful",
    "timestamp": "2025-09-03T03:07:08Z"
  },
  {
    "title": "Putin’s Energy Wins in China Deal a Blow to Trump’s Export Push",
    "description": "On his first day in office, President Donald Trump vowed he would establish US energy dominance over the globe. Seven months on, that goal is under threat as the world’s largest importer flexes its economic and geopolitical muscle.",
    "link": "https://financialpost.com/pmn/business-pmn/putins-energy-wins-in-china-deal-a-blow-to-trumps-export-push",
    "timestamp": "2025-09-03T03:06:47Z"
  },
  {
    "title": "China Displays Its Military Strength With Parade On 80th Anniversary Of WWII's End",
    "description": "Chinese leader Xi Jinping emphasized the choice between peace and war during the anniversary parade, which also aimed to show China's influence on the world stage.",
    "link": "https://www.huffpost.com/entry/ap-as-china-parade_n_68b7ad03e4b06793d89c54ad",
    "timestamp": "2025-09-03T03:00:15Z"
  },
  {
    "title": "Crypto expected to handle a tenth of post-trade market by 2030: Citi survey",
    "description": "A survey of over 500 finance executives found that 10% of the post-trade market turnover was expected to use tokens and digital assets, such as stablecoins, by 2030.",
    "link": "https://cointelegraph.com/news/citi-tokenized-assets-stablecoins-genai-2030-trading-forecast",
    "timestamp": "2025-09-03T03:00:05Z"
  },
  {
    "title": "China’s Xi hosts largest-ever military parade alongside Vladimir Putin and Kim Jong Un",
    "description": "China kicked off its largest-ever military parade on Wednesday, a show of its growing firepower and geopolitical clout as President Xi Jinping seeks to cast Beijing as the custodian of a post-US international order.",
    "link": "https://nypost.com/2025/09/02/world-news/chinas-xi-hosts-largest-ever-military-parade-alongside-vladimir-putin-and-kim-jong-un/",
    "timestamp": "2025-09-03T02:57:51Z"
  },
  {
    "title": "Partial release of Epstein files feeds view the whole truth is being covered up",
    "description": "Of 33,000 pages released by the House committee, Democrats said 97% were already public and that, in any case, we're talking about less than 1% of all the Epstein files.",
    "link": "https://news.sky.com/story/partial-release-of-epstein-files-feeds-view-the-whole-truth-is-being-covered-up-13424048",
    "timestamp": "2025-09-03T02:54:00Z"
  },
  {
    "title": "Trump to attend Yankees game in New York on 24th anniversary of Sept. 11 attacks: sources",
    "description": "President Donald Trump will attend the New York Yankees game against the Detroit Tigers on Sept. 11, marking the 24th anniversary of the 9/11 attacks.",
    "link": "https://www.foxnews.com/sports/trump-attend-yankees-game-new-york-24th-anniversary-sept-11th-attacks-sources",
    "timestamp": "2025-09-03T02:52:06Z"
  },
  {
    "title": "Trump Unveils New Troll Of Joe Biden’s Autopen In Oval Office",
    "description": "By Reagan Reese, Daily Caller News Foundation | September 02, 2025\nPresident Donald Trump revealed to the Daily Caller that he is installing a “Presidential Wall of Fame” in the Rose Garden and will be hanging a “Biden Autopen” portrait to mark the Biden pres…",
    "link": "https://biztoc.com/x/bee7544c20fcaebf",
    "timestamp": "2025-09-03T02:49:47Z"
  },
  {
    "title": "Fed Governor Lisa Cook 'did not ever commit mortgage fraud,' attorneys say",
    "description": "Lawyers for Fed Governor Lisa Cook said the alleged contradictions in her mortgage records were already disclosed to the government.",
    "link": "https://www.businessinsider.com/lisa-cook-fed-governor-mortgage-fraud-allegations-attorneys-response-2025-9",
    "timestamp": "2025-09-03T02:48:52Z"
  },
  {
    "title": "Xi Jinping — flanked by Putin and Kim — speaks of choice between war and peace at huge military parade",
    "description": "Chinese President Xi Jinping warned the world was facing a choice between peace or war as he held his country's largest-ever military parade at Tiananmen Square flanked by Russia's Vladimir Putin and North Korea's Kim Jong Un.",
    "link": "https://www.cbc.ca/news/world/china-military-parade-xi-putin-kim-1.7623751",
    "timestamp": "2025-09-03T02:47:00Z"
  },
  {
    "title": "Trump accuses Xi, Kim and Putin of conspiring against US",
    "description": "President Donald Trump accused the leaders of China, North Korea and Russia late Tuesday of conspiring against the United States as they gathered in Beijing for a massive military parade. As North Korean leader Kim Jong Un and Russia's Vladimir Putin flanked …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-accuses-xi-kim-and-putin-of-conspiring-against-us/articleshow/123668005.cms",
    "timestamp": "2025-09-03T02:46:58Z"
  },
  {
    "title": "Trump calls health speculation ‘fake news’ after days out of view",
    "description": "At 79, Trump has been seen with bruising on his hand and swelling around his ankles, which the White House attributed to chronic venous insufficiency and aspirin use.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-calls-health-speculation-fake-news-after-days-out-of-view/article70006594.ece",
    "timestamp": "2025-09-03T02:43:27Z"
  },
  {
    "title": "Texas Representative Sues Newsom Over California Redistricting",
    "description": "A congressman from Texas is asking a federal judge to block a retaliatory move by California to wipe out Republican congressional gains the Trump administration hopes to secure through Texas’ controversial mid-decade redistricting. California’s response to Te…",
    "link": "https://freerepublic.com/focus/f-news/4338304/posts",
    "timestamp": "2025-09-03T02:42:35Z"
  },
  {
    "title": "CNN’s Elie Honig Explains Why Court Decision Won’t Stop Trump’s Guard Deployment",
    "description": "Elie Honig said on CNN Tuesday that a new court ruling marked only a temporary and limited setback for President Donald Trump.",
    "link": "https://dailycaller.com/2025/09/02/elie-honig-donald-trump-national-guard-deployment/",
    "timestamp": "2025-09-03T02:42:21Z"
  },
  {
    "title": "US military kills 11 people in strike on alleged drug boat from Venezuela, Trump says",
    "description": "WASHINGTON: The United States military killed 11 people on Tuesday (Sep 2) in a strike on a vessel from Venezuela allegedly carrying illegal narcotics, President Donald Trump said, in the first known operation since his administration's recent deployment of w…",
    "link": "https://www.channelnewsasia.com/world/us-military-kills-strike-alleged-drug-boat-venezuela-trump-5329446",
    "timestamp": "2025-09-03T02:42:00Z"
  },
  {
    "title": "Voters rejected migration as an election issue in 2025. How many times have politicans and the media misread the room?",
    "description": "Political leaders and commentators across the media often lean into issues they believe are election-defining for voters. They have often been wrong.\nThe post Voters rejected migration as an election issue in 2025. How many times have politicans and the media…",
    "link": "http://www.crikey.com.au/2025/09/03/migration-election-issue-media-misreading/",
    "timestamp": "2025-09-03T02:38:51Z"
  },
  {
    "title": "Trump, who questioned his opponents' health, rebuffs rumors about his own",
    "description": "President Donald Trump is alive, rebuffing rumors about his health after he was not seen in public for a few days and amid speculation about bruises on his hand.",
    "link": "https://biztoc.com/x/53babcdadb46eff4",
    "timestamp": "2025-09-03T02:38:03Z"
  },
  {
    "title": "Long bond yields rise, gold hits record on fiscal concerns",
    "description": "The 30-year Japanese government bond (JGB) yield hit an unprecedented 3.255%, following a run-up in similarly dated gilts and Treasuries overnight.  Japan's ...",
    "link": "https://finance.yahoo.com/news/long-bond-yields-rise-gold-023717989.html",
    "timestamp": "2025-09-03T02:37:17Z"
  },
  {
    "title": "Long bond yields rise, gold hits record on fiscal concerns",
    "description": "TOKYO :A global slide in long-dated bonds extended into Asia on Wednesday, while gold climbed to a new peak as concerns mounted over government debt and economic growth.The 30-year Japanese government bond (JGB) yield hit an unprecedented 3.255 per cent, foll…",
    "link": "https://www.channelnewsasia.com/business/long-bond-yields-rise-gold-hits-record-fiscal-concerns-5329866",
    "timestamp": "2025-09-03T02:37:17Z"
  },
  {
    "title": "Asia markets down as gold hits fresh high",
    "description": "HONG KONG: Asia markets were down on Wednesday (Sep 3) while gold extended its six-day rally after reaching a record high as investors sought safe havens following a selloff in equity and bond markets.Bullion for immediate delivery hit a fresh record as Asia …",
    "link": "https://www.channelnewsasia.com/business/asia-markets-down-gold-hits-fresh-high-5329866",
    "timestamp": "2025-09-03T02:37:00Z"
  },
  {
    "title": "Released From Hospital, Rudy Giuliani Speaks Out About New Hampshire Car Crash",
    "description": "Rudy Giuliani says he experienced the most pain he'd ever felt when he was in a highway car crash last weekend.",
    "link": "https://www.huffpost.com/entry/rudy-giuliani-speaks-car-crash_n_68b7a8d3e4b0e9fcc5f31e76",
    "timestamp": "2025-09-03T02:36:45Z"
  },
  {
    "title": "China’s Chemicals Makers Reap Reward of Shift From Oil to Coal",
    "description": "Falling coal prices are shifting the profitability of China’s chemicals sector, away from traditional oil-based producers to the growing number of plants that use the solid fuel as their feedstock.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-chemicals-makers-reap-reward-of-shift-from-oil-to-coal",
    "timestamp": "2025-09-03T02:36:19Z"
  },
  {
    "title": "Trump suffers setback in bid to act as national police chief after chaos on streets of LA",
    "description": "Donald Trump has not been shy about his desire to deploy the National Guard into cities across America - from Los Angeles to Washington DC. He's unlikely to let this setback dampen his ambition.",
    "link": "https://news.sky.com/story/trump-suffers-setback-in-bid-to-act-as-national-police-chief-after-chaos-on-streets-of-la-13424047",
    "timestamp": "2025-09-03T02:35:00Z"
  },
  {
    "title": "As Xi hosts Putin, Kim at Beijing parade, Trump fumes at 'conspiracy against US'",
    "description": "As Beijing rolled out its largest military parade in decades, US President Donald Trump trained his guns at Xi Jinping, accusing the Chinese President of “conspiring” with Russia and North Korea against the United States. \"Please give my warmest regards to Vl…",
    "link": "https://freerepublic.com/focus/f-chat/4338303/posts",
    "timestamp": "2025-09-03T02:34:28Z"
  },
  {
    "title": "US President: Relationship with India strong, but tariffs lopsided",
    "description": "Trump says India–US ties strong but trade was “one-sided” for years with India imposing high tariffs, citing Harley-Davidson’s 200% motorcycle duty as an example.",
    "link": "https://www.thehindubusinessline.com/news/us-president-relationship-with-india-strong-but-tariffs-lopsided/article70006597.ece",
    "timestamp": "2025-09-03T02:27:29Z"
  },
  {
    "title": "Trump reacts as Putin, Kim Jong Un and Xi appear together at China's military parade",
    "description": "Trump reacts as Putin, Kim Jong Un and Xi appear together at China's military paradego.com",
    "link": "https://abcnews.go.com/Politics/trump-reacts-putin-kim-jong-xi-chinas-military/story?id=125201888",
    "timestamp": "2025-09-03T02:24:46Z"
  },
  {
    "title": "What effects could losing Space Command have on Colorado's growing aerospace economy?",
    "description": "The aerospace industry has long been a shining star for Colorado’s economy, but state leaders are already concerned about the effects of President Donald Trump’s decision to move Space Command",
    "link": "https://denvergazette.com/news/business/colorado-aerospace-economy-trump-space-command-alabama/article_4217f291-eb74-417b-b62c-7e5a4c131f7c.html",
    "timestamp": "2025-09-03T02:21:31Z"
  },
  {
    "title": "Vaccine expert who is a frequent critic of RFK Jr. is blocked from participating in FDA advisory committee | CNN",
    "description": "Dr. Paul Offit, a frequent critic of US Health and Human Services Secretary Robert F. Kennedy Jr., has been blocked from participating in a panel of independent experts who advise the US Food and Drug Administration on vaccines. An HHS spokesperson told CNN t…",
    "link": "https://www.cnn.com/2025/09/02/health/offit-fda-vrbpac",
    "timestamp": "2025-09-03T02:18:20Z"
  },
  {
    "title": "Eight killed and 50 wounded in Chicago over long weekend as Trump warns of federal deployment",
    "description": "Chicago grappled with a surge of gun violence over the Labor Day weekend, resulting in eight fatalities and 50 injuries. The shootings, concentrated on the South and West sides, prompted criticism from Donald Trump, who falsely labeled Chicago as the most dan…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/eight-killed-and-50-wounded-in-chicago-over-long-weekend-as-trump-warns-of-federal-deployment/articleshow/123667605.cms",
    "timestamp": "2025-09-03T02:17:15Z"
  },
  {
    "title": "SEC, CFTC-Registered Exchanges Receive Blessing to Facilitate Spot Crypto Trading",
    "description": "A joint statement follows a report earlier this year by a President's Working Group to provide \"regulatory clarity\" on certain assets.",
    "link": "https://decrypt.co/337811/exchanges-sec-cftc-facilitate-spot-crypto-trading",
    "timestamp": "2025-09-03T02:15:33Z"
  },
  {
    "title": "Trump says video showing items thrown from White House is AI after his team indicates it's real (Michelle L. Price/Associated Press)",
    "description": "Michelle L. Price / Associated Press:\nTrump says video showing items thrown from White House is AI after his team indicates it's real  —  President Donald Trump said Tuesday that a video circulating online that showed items being tossed out of an upstairs win…",
    "link": "https://www.memeorandum.com/250902/p136",
    "timestamp": "2025-09-03T02:15:01Z"
  },
  {
    "title": "China's Xi hosts massive military parade with Putin, Kim to mark end of World War II",
    "description": "Chinese President Xi Jinping warned the world was facing a choice between peace or war as he held his country's largest-ever military parade at Tiananmen Square flanked by Russia's Vladimir Putin and North Korea's Kim Jong Un. The lavish event to mark 80 year…",
    "link": "https://japantoday.com/category/world/%27peace-or-war%27-china%27s-xi-hosts-massive-military-parade-with-putin-and-kim",
    "timestamp": "2025-09-03T02:14:58Z"
  },
  {
    "title": "Hateful homophobe Rand Paul says gay CDC official's 'lifestyle' made him unfit to be in government",
    "description": "Dr. Demetre Daskalakis, the Centers for Disease Control and Prevention official who resigned last week over the anti-science policies of Donald Trump and Robert F. Kennedy Jr., is unfit to be in government because of his “lifestyle,” U.S. Sen. Rand Paul said …",
    "link": "https://www.advocate.com/politics/homophobe-rand-paul-slams-daskalakis",
    "timestamp": "2025-09-03T02:13:20Z"
  },
  {
    "title": "Oil prices hold on to gains from US sanctions",
    "description": "Oil prices are stable in Asian trading. The market is awaiting the OPEC+ meeting. U.S. imposed sanctions on companies smuggling Iranian oil. U.S. crude oil stockpiles are expected to fall. Economic data is soft. China is holding a military parade. Xi Jinping,…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-hold-on-to-gains-from-us-sanctions/articleshow/123667541.cms",
    "timestamp": "2025-09-03T02:06:08Z"
  },
  {
    "title": "China's Xi says the world faces 'peace or war' as Trump claims Beijing conspiring against U.S",
    "description": "BEIJING — Chinese President Xi Jinping said Wednesday that the world was facing a choice of \"peace or war\" and \"dialogues or confrontation\" as the country hosts its largest military parade commemorating the 80th anniversary of the end of World War II.\nThe spe…",
    "link": "https://biztoc.com/x/37ebd6babf99ccda",
    "timestamp": "2025-09-03T02:05:01Z"
  },
  {
    "title": "King Charles 'has good reason' to think 'Trump will speak out of turn'",
    "description": "King Charles and Queen Camilla will be hosting Donald Trump’s state visit later this month, and it's being said, the king has his concerns, but even so, he and Camilla will be gracious hosts, says one royal expert. Charles is reportedly nervous that Trump wil…",
    "link": "https://freerepublic.com/focus/f-news/4338301/posts",
    "timestamp": "2025-09-03T02:01:30Z"
  },
  {
    "title": "US military kills 11 in strike on alleged drug boat tied to Venezuelan cartel",
    "description": "The US president shared footage of the attack in a significant escalation of his war on foreign cartels.",
    "link": "https://7news.com.au/news/us-military-kills-11-in-strike-on-alleged-drug-boat-tied-to-venezuelan-cartel-president-donald-trump-says-c-19894388",
    "timestamp": "2025-09-03T02:00:33Z"
  },
  {
    "title": "Gold extends record run as US rate-cut bets lift appeal",
    "description": "Gold prices continued their record-breaking surge, surpassing $3,500 per ounce, fueled by strong investor expectations of a U.S. Federal Reserve interest rate cut in September. The anticipation of lower interest rates and increased holdings in gold-backed ETF…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-extends-record-run-as-us-rate-cut-bets-lift-appeal/articleshow/123667496.cms",
    "timestamp": "2025-09-03T01:58:29Z"
  },
  {
    "title": "Released from hospital, Rudy Giuliani speaks out about New Hampshire car crash",
    "description": "Rudy Giuliani says he experienced the most pain he'd ever felt when he was in a highway car crash last weekend",
    "link": "https://abcnews.go.com/US/wireStory/released-hospital-rudy-giuliani-speaks-new-hampshire-car-125183038",
    "timestamp": "2025-09-03T01:58:16Z"
  },
  {
    "title": "Xi flanked by Putin and Kim during lavish military parade in China",
    "description": "China has held its largest-ever military parade in a display of its growing firepower and geopolitical clout as President Xi Jinping seeks to cast Beijing as the custodian of a post-US international order.",
    "link": "https://www.abc.net.au/news/2025-09-03/china-hosts-lavish-military-parade/105728210",
    "timestamp": "2025-09-03T01:58:12Z"
  },
  {
    "title": "Wall Street ends lower as ruling on Trump tariffs raises concerns",
    "description": "Wall Street experienced a downturn on Tuesday, influenced by uncertainty surrounding President Trump's tariffs after a court ruling deemed them largely illegal. Investors are also anticipating the upcoming U.S. payrolls report amidst concerns of weak job grow…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-as-ruling-on-trump-tariffs-raises-concerns/articleshow/123667476.cms",
    "timestamp": "2025-09-03T01:56:39Z"
  },
  {
    "title": "China's Xi says the world faces 'peace or war' as Trump claims Beijing conspiring against U.S.",
    "description": "Russian President Vladimir Putin and North Korea's Kim Jong Un are among the leaders from more than 20 countries attending the \"Victory Day\" military parade in Beijing.",
    "link": "https://www.cnbc.com/2025/09/03/china-military-day-parade-xi-trump-beijing-us.html",
    "timestamp": "2025-09-03T01:55:19Z"
  },
  {
    "title": "Australia's GDP expands more than expected; fastest pace since September 2023",
    "description": "The country's GDP grew 1.8% year over year, higher than the 1.6% expected by economists polled by Reuters.",
    "link": "https://www.cnbc.com/2025/09/03/australias-gdp-expands-more-than-expected-fastest-pace-since-september-2023.html",
    "timestamp": "2025-09-03T01:54:48Z"
  },
  {
    "title": "Reliance Industries Plans $2 Billion Asset-Backed Securities Deal",
    "description": "Billionaire Mukesh Ambani’s Reliance Group is planning to raise about 180 billion rupees ($2 billion) through asset-backed securities, according to people familiar with the matter, in what could be one of the largest such deals in India this year.",
    "link": "https://www.ndtvprofit.com/markets/reliance-industries-plans-2-billion-asset-backed-securities-deal",
    "timestamp": "2025-09-03T01:52:58Z"
  },
  {
    "title": "Russia, China and North Korea ‘conspiring’ against US – Trump",
    "description": "President Donald Trump has accused China, Russia and North Korea of conspiring against the US Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623989-trump-china-russia-nk/",
    "timestamp": "2025-09-03T01:52:23Z"
  },
  {
    "title": "Wife of Trump Supporter Faces Deportation After 37 Years in U.S.",
    "description": "A Missouri veteran says he “100 percent” regrets voting for President Donald Trump after his British-born wife, a longtime green card holder, was detained by federal agents and now faces deportation. Donna Hughes-Brown, 59, was stopped by officers at Chicago’…",
    "link": "https://freerepublic.com/focus/f-news/4338300/posts",
    "timestamp": "2025-09-03T01:50:30Z"
  },
  {
    "title": "The Peace President takes the war on drugs literally",
    "description": "It’s the non-interventionist mindset, you wouldn’t understand: President Donald Trump said Tuesday the U.S. has carried out a strike in the southern Caribbean against a drug-carrying vessel that departed from Venezuela and was operated by the Tren de Aragua g…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/the-peace-president-takes-the-war-on-drugs-literally",
    "timestamp": "2025-09-03T01:50:13Z"
  },
  {
    "title": "Xi hails 'great regeneration of China' with dramatic show of military might",
    "description": "Vladimir Putin and Kim Jong Un flanked Xi Jinping at the start of a major military parade marking the end of the Second World War in Beijing.",
    "link": "https://news.sky.com/story/president-xi-hails-great-regeneration-of-china-with-dramatic-show-of-military-power-13424044",
    "timestamp": "2025-09-03T01:49:00Z"
  },
  {
    "title": "How Xi Jinping just redrew world's geopolitical map",
    "description": "While US Treasury Secretary Scott Bessent dismissed the SCO summit, telling Fox News it was “largely performative,” to other observers Xi has pulled off a meaningful shift in the balance of diplomatic power.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/how-xi-jinping-just-redrew-worlds-geopolitical-map/articleshow/123667385.cms",
    "timestamp": "2025-09-03T01:48:33Z"
  },
  {
    "title": "House committee releases some Justice Department files in Epstein case, but most already public",
    "description": "The House Oversight Committee released Justice Department files on the Jeffrey Epstein and Ghislaine Maxwell investigations, fulfilling congressional demands for more transparency. However, much of the released information was already public, including court …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/house-committee-releases-some-justice-department-files-in-epstein-case-but-most-already-public/articleshow/123667405.cms",
    "timestamp": "2025-09-03T01:46:57Z"
  },
  {
    "title": "‘Inappropriate Videos’: FTC’s Chris Mufarrige Explains Disney’s $10M Settlement Over ‘Collecting’ Kids’ Data",
    "description": "FTCs Chris Mufarrige detailed Disney’s $10 million settlement over an investigation into collecting children’s data through YouTube.",
    "link": "https://dailycaller.com/2025/09/02/federal-trade-commission-consumer-protection-disney-settlement-kids-data/",
    "timestamp": "2025-09-03T01:45:41Z"
  },
  {
    "title": "37 Nepalis deported from the US to arrive in Kathmandu today",
    "description": "KATHMANDU: A total of 37 Nepali nationals deported from the United States are scheduled to arrive in Kathmandu on Wednesday via a chartered flight, marking the third such deportation this year. Ram Chandra Tiwari, Director General of the Department of Immigra…",
    "link": "https://english.khabarhub.com/2025/03/494060/",
    "timestamp": "2025-09-03T01:45:12Z"
  },
  {
    "title": "Over 600 economists back Fed Governor Cook as Trump attempts ouster",
    "description": "Nearly 600 economists have signed an open letter expressing support for Federal Reserve Governor Lisa Cook and US central bank independence, as Cook battles President Donald Trump's attempt to fire her. \"Recent public statements about Governor Cook -- includi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/over-600-economists-back-fed-governor-cook-as-trump-attempts-ouster/articleshow/123667391.cms",
    "timestamp": "2025-09-03T01:44:05Z"
  },
  {
    "title": "Trump's Labor Day gaffe thanking American workers sparks concerns over his mental fitness: Report",
    "description": "The caption on Donald Trump's Labor Day celebration post sparks concerns as it adds to his growing pile of eyebrow-raising slipups",
    "link": "https://news.meaww.com/trumps-labor-day-gaffe-thanking-american-workers-sparks-concerns-over-his-mental-fitness-report",
    "timestamp": "2025-09-03T01:43:12Z"
  },
  {
    "title": "Labor, the Coalition, the media — there’s plenty of blame to go around on migration. But it’s the right trying to normalise hate",
    "description": "In Australia's migration debate, there are few players with clean hands. But one group has particularly malignant intentions, and Trump has shown them a path forward.\nThe post Labor, the Coalition, the media — there’s plenty of blame to go around on migration…",
    "link": "http://www.crikey.com.au/2025/09/03/migration-labor-coalition-media-right-wing-extremism/",
    "timestamp": "2025-09-03T01:42:39Z"
  },
  {
    "title": "US military conducts deadly strike on Venezuelan ‘drug vessel,’ Trump says",
    "description": "US President Donald Trump said Tuesday that the military had conducted a lethal strike on a Venezuelan vessel in the Caribbean, targeting alleged “narcoterrorists.” The operation, which Trump said killed 11 people, appears to be the first time his administrat…",
    "link": "https://biztoc.com/x/8c0d56d2442082be",
    "timestamp": "2025-09-03T01:42:33Z"
  },
  {
    "title": "Trump addresses health rumors after days without public events",
    "description": "The 79-year-old president has been seen with bruising on his hand and swelling around his ankles.",
    "link": "https://www.kold.com/2025/09/02/trump-addresses-health-rumors-after-days-without-public-events/",
    "timestamp": "2025-09-03T01:41:17Z"
  },
  {
    "title": "Trump says he will deploy National Guard to Chicago but doesn't say when - ABC News",
    "description": "Trump says he will deploy National Guard to Chicago but doesn't say whenABC News Donald Trump announcement today: President says he's sending National Guard to Chicago, points to Chicago shootings this weekendABC7 Chicago 9 killed, 52 wounded over Labor Day w…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178985838",
    "timestamp": "2025-09-03T01:32:33Z"
  },
  {
    "title": "Trump Posts Video of U.S. Bombing ‘Narcoterrorists’ in International Waters: ‘BEWARE!’",
    "description": "President Donald Trump took a victory lap on Tuesday after the U.S. blew up a boat carrying 11 \"narcoterrorists\" in international waters.\nThe post Trump Posts Video of U.S. Bombing ‘Narcoterrorists’ in International Waters: ‘BEWARE!’ first appeared on Mediait…",
    "link": "https://www.mediaite.com/politics/trump-posts-video-of-u-s-bombing-narcoterrorists-in-international-waters-beware/",
    "timestamp": "2025-09-03T01:32:18Z"
  },
  {
    "title": "Trump ‘not concerned’ about China and Russia forming axis against US",
    "description": "Trump says Beijing and Moscow would never use military force against US due to its superior military.",
    "link": "https://www.aljazeera.com/news/2025/9/3/trump-not-concerned-about-china-and-russia-forming-axis-against-us",
    "timestamp": "2025-09-03T01:31:01Z"
  },
  {
    "title": "Elon Musk’s transgender daughter Vivian claims she’s broke, lives with 3 roommates after spurning world’s richest dad",
    "description": "“People assume I have a lot of money. I don’t have hundreds of thousands of dollars at my disposal,” the 21-year-old aspiring model said.",
    "link": "https://nypost.com/2025/09/02/us-news/elon-musks-trans-daughter-vivian-wilson-claims-she-not-rich-lives-with-3-roommates/",
    "timestamp": "2025-09-03T01:30:37Z"
  },
  {
    "title": "Tariffs, migration and cartels will top Rubio's talks in Mexico and Ecuador this week",
    "description": "Security, sovereignty, tariffs, trade, drugs and migration will top Secretary of State Marco Rubio’s agenda this week on his third trip to Latin America since becoming chief U.S. diplomat",
    "link": "https://abcnews.go.com/International/wireStory/tariffs-migration-cartels-top-rubios-talks-mexico-ecuador-125188525",
    "timestamp": "2025-09-03T01:26:28Z"
  },
  {
    "title": "Tariffs, migration and cartels will top Rubio's talks in Mexico and Ecuador this week",
    "description": "Security, sovereignty, tariffs, trade, drugs and migration will top Secretary of State Marco Rubio’s agenda this week on his third trip to Latin America since becoming chief U.S. diplomat",
    "link": "https://abcnews.go.com/US/wireStory/tariffs-migration-cartels-top-rubios-talks-mexico-ecuador-125188517",
    "timestamp": "2025-09-03T01:26:28Z"
  },
  {
    "title": "Oil Steadies As Geopolitical Risks Dominate Before OPEC+ Meeting",
    "description": "Oil steadied after closing at the highest in a month as investors weighed a host of geopolitical risks, including a potential escalation of US sanctions on Russia, in the run-up to an OPEC+ meeting on supply.",
    "link": "https://www.ndtvprofit.com/markets/oil-steadies-as-geopolitical-risks-dominate-before-opec-meeting",
    "timestamp": "2025-09-03T01:23:59Z"
  },
  {
    "title": "US House committee releases over 33,000 pages of Epstein-related records",
    "description": "Committee on Oversight and Government Reform publishes documents but two lawmakers push for 'full release' of files.",
    "link": "https://www.aljazeera.com/news/2025/9/3/us-house-committee-releases-over-33000-pages-of-epstein-related-records",
    "timestamp": "2025-09-03T01:21:24Z"
  },
  {
    "title": "CNBC Daily Open: Trump says stocks \"want the tariffs\" — but it might be Treasurys instead",
    "description": "Labor Day in the U.S., which took place Monday, marks the unofficial end of summer — which means saying goodbye to the promise of all life could be and once again squeezing it to fit the four walls of the office.\nBut there was someone eager to get back to wor…",
    "link": "https://biztoc.com/x/0180bf999486a293",
    "timestamp": "2025-09-03T01:20:23Z"
  },
  {
    "title": "Trump downplays China-Russia alliance as threat to U.S. dominance",
    "description": "WASHINGTON DC: U.S. President Donald Trump has dismissed concerns that closer ties between China, Russia, and their allies present a serious challenge to the United States on the global stage. Speaking to reporters in the Oval Office, Trump emphasized his str…",
    "link": "https://english.khabarhub.com/2025/03/494057/",
    "timestamp": "2025-09-03T01:16:00Z"
  },
  {
    "title": "Warming up to Japan",
    "description": "India, Japan must join hands to counter Trump tariffs",
    "link": "https://www.thehindubusinessline.com/opinion/warming-up-to-japan/article70005121.ece",
    "timestamp": "2025-09-03T01:15:00Z"
  },
  {
    "title": "CNBC Daily Open: Trump says stocks \"want the tariffs\" — but it might be Treasurys instead",
    "description": "The yield on the 30-year bond nearly touched 5% as investors feared a hit to the U.S. government's coffers if deprived of tariff revenue.",
    "link": "https://www.cnbc.com/2025/09/03/cnbc-daily-open-trump-says-stocks-want-tariffs-but-it-might-be-treasurys.html",
    "timestamp": "2025-09-03T01:13:08Z"
  },
  {
    "title": "Wes Moore spotted on George Clooney’s yacht in Italy",
    "description": "Maryland Gov. Wes Moore is facing sharp criticism after being photographed vacationing on George Clooney’s yacht in Italy amid rising crime in Baltimore and a public feud with President Donald Trump over National Guard intervention, fueling speculation about …",
    "link": "https://www.washingtonexaminer.com/politics/3790533/gov-wes-moore-spotted-on-george-clooneys-yacht-in-italy-fueling-2028-speculation-backlash/",
    "timestamp": "2025-09-03T01:12:28Z"
  },
  {
    "title": "Trump Health Misinformation Swirls Despite Denial",
    "description": "From manipulated images to out-of-context photos, false claims that Donald Trump is seriously ill -- or even dead -- have swirled online, with the misinformation persisting even after the US president publicly rejected it on Tuesday.",
    "link": "https://www.ibtimes.com/trump-health-misinformation-swirls-despite-denial-3782295",
    "timestamp": "2025-09-03T01:12:15Z"
  },
  {
    "title": "US House panel releases 33,000 pages of Epstein files",
    "description": "But Republicans and Democrats alike say the files, including jail CCTV, contain little new information.",
    "link": "https://www.bbc.com/news/articles/cp949lrj373o",
    "timestamp": "2025-09-03T01:12:07Z"
  },
  {
    "title": "Key GOP senator declines to elaborate on planned 'oversight' of RFK Jr. after CDC exodus",
    "description": "Sen. Bill Cassidy, chair of the Health Committee, declined to elaborate on “oversight” he plans to conduct of RFK Jr. after the CDC director was fired and others quit.",
    "link": "https://www.nbcnews.com/politics/congress/republican-senator-oversight-robert-f-kennedy-hhs-cdc-firing-resigns-rcna228688",
    "timestamp": "2025-09-03T01:08:55Z"
  },
  {
    "title": "China's Xi, flanked by Putin and Kim, hosts military parade in defiance of West",
    "description": "Xi Jinping welcomed Vladimir Putin and Kim Jong Un in Beijing. A massive parade marked 80 years since World War II's end. China showcased military strength. The Shanghai Cooperation Organisation summit preceded the parade. Xi criticised 'bullying behaviour', …",
    "link": "https://economictimes.indiatimes.com/news/defence/chinas-xi-flanked-by-putin-and-kim-hosts-military-parade-in-defiance-of-west/articleshow/123667156.cms",
    "timestamp": "2025-09-03T01:08:54Z"
  },
  {
    "title": "Treasuries stabilize after debt-sale jitters and budget concerns rattle markets",
    "description": "Treasuries stabilized in Asian trading following corporate-debt sales and budget worries that impacted bonds and stocks. US 30-year bond yields remained near 5%, affecting tech shares, while Japan's ultra-long bonds also declined. Investors are navigating eco…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/treasuries-stabilize-after-debt-sale-jitters-and-budget-concerns-rattle-markets/articleshow/123667141.cms",
    "timestamp": "2025-09-03T01:08:37Z"
  },
  {
    "title": "Japanese Ultra-Long Bonds Fall After Treasuries: Markets Wrap",
    "description": "Treasuries steadied in early Asian trading after a rush of corporate-debt sales and worries over developed-world budgets sent bonds and stocks lower. US 30-year bond yields held close to 5% on Wednesday after a spike overnight weighed on tech shares on Wall S…",
    "link": "https://www.ndtvprofit.com/markets/global-stock-markets-asian-indices-hang-seng-nikkei-dax-ftse-nasdaq-s-and-p-dow-jones-news-today-03-sep-2025",
    "timestamp": "2025-09-03T01:06:37Z"
  },
  {
    "title": "Kim, Putin at Xi’s side for massive China military parade",
    "description": "North Korean leader Kim Jong Un and Russia’s Vladimir Putin arrived Wednesday morning ahead of a massive parade in Beijing to cap a week of diplomatic grandstanding by President Xi Jinping and his allies against the West. In unprecedented scenes, Xi shook bot…",
    "link": "https://www.digitaljournal.com/world/kim-putin-at-xis-side-for-massive-china-military-parade/article",
    "timestamp": "2025-09-03T01:02:20Z"
  },
  {
    "title": "MSNBC host urges Pritzker to do the 'radical' thing and work with Trump",
    "description": "MSNBC host Joe Scarborough argued on Tuesday that Illinois Gov. JB Pritzker should partner with President Donald Trump to combat crime in his home state.",
    "link": "https://www.foxnews.com/media/msnbc-host-urges-pritzker-do-radical-thing-work-trump",
    "timestamp": "2025-09-03T01:00:25Z"
  },
  {
    "title": "Oil prices hold on to gains from US sanctions",
    "description": "BEIJING (Reuters) -Oil prices were steady in Asian trading on Wednesday, holding on to sanctions-driven gains from the previous session as the market looked ...",
    "link": "https://finance.yahoo.com/news/oil-prices-hold-gains-us-005953483.html",
    "timestamp": "2025-09-03T00:59:53Z"
  },
  {
    "title": "Many of the Epstein case files that were just released by a House committee were already public",
    "description": "The House Oversight Committee on Tuesday publicly posted the files it has received from the Justice Department on the sex trafficking investigations into Jeffrey Epstein and his former girlfriend Ghislaine Maxwell, responding to mounting pressure in Congress …",
    "link": "https://www.pbs.org/newshour/politics/many-of-the-epstein-case-files-that-were-just-released-by-a-house-committee-were-already-public",
    "timestamp": "2025-09-03T00:59:33Z"
  },
  {
    "title": "House committee releases some Justice Department files in Epstein case, but most already public",
    "description": "The House Oversight Committee has publicly posted the files it has received from the Justice Department on the sex trafficking investigations into Jeffrey Epstein and his former girlfriend Ghislaine Maxwell.",
    "link": "https://www.fox23.com/news/house-committee-releases-some-justice-department-files-in-epstein-case-but-most-already-public/article_1ddf2248-c86a-53e0-89fd-89de05785152.html",
    "timestamp": "2025-09-03T00:59:27Z"
  },
  {
    "title": "Kim, Putin at Xi's side for massive China military parade",
    "description": "North Korean leader Kim Jong Un and Russia's Vladimir Putin arrived Wednesday morning ahead of a massive parade in Beijing to cap a week of diplomatic...",
    "link": "https://www.yahoo.com/news/articles/kim-putin-join-chinas-xi-210150460.html",
    "timestamp": "2025-09-03T00:59:25Z"
  },
  {
    "title": "'I would feel more worried' - Chicagoans on Trump's plan to deploy troops",
    "description": "President Donald Trump says he will send the National Guard to Chicago to help fight crime but has not specified when that could occur.",
    "link": "https://www.bbc.com/news/videos/cj9w9gxwp0po",
    "timestamp": "2025-09-03T00:54:52Z"
  }
]