[
  {
    "title": "Stocks push higher as investors digest Trump's walk-back of Greenland threats",
    "description": "NEW YORK/ LONDON, Jan 22 : MSCI's global equities gauge eyed a second straight advance on Thursday and the dollar dipped as investors showed signs of relief a day after U.S. President Donald Trump dropped tariff threats against eight European countries and ru…",
    "link": "https://www.channelnewsasia.com/business/stocks-push-higher-investors-digest-trumps-walk-back-greenland-threats-5877231",
    "timestamp": "2026-01-22T18:20:59Z"
  },
  {
    "title": "Stocks rise as dollar dips after Trump's walk-back of Greenland threats",
    "description": "NEW YORK/ LONDON, Jan 22 : MSCI's global equities gauge was higher on Thursday and the dollar dipped as investors showed signs of relief a day after U.S. President Donald Trump dropped tariff threats against eight European countries and ruled out seizing Gree…",
    "link": "https://www.channelnewsasia.com/business/stocks-rise-dollar-dips-after-trumps-walk-back-greenland-threats-5877231",
    "timestamp": "2026-01-22T18:20:59Z"
  },
  {
    "title": "‘My country pulled world into a black abyss’: Chancellor urges leaders to learn from Germany",
    "description": "Friedrich Merz addressed Davos while EU leaders met in Brussels to discuss ‘new normal’ of US relations",
    "link": "https://www.irishtimes.com/world/europe/2026/01/22/my-country-pulled-world-into-black-abyss-chancellor-urges-leaders-to-learn-from-germany/",
    "timestamp": "2026-01-22T18:20:30Z"
  },
  {
    "title": "Trump sues Jamie Dimon, JPMorgan Chase over alleged 'political' debanking (CNBC)",
    "description": "CNBC:\nTrump sues Jamie Dimon, JPMorgan Chase over alleged ‘political’ debanking … President Donald Trump sued JPMorgan Chase and its CEO, Jamie Dimon, on Thursday for closing his and related entities' accounts in early 2021 after decades of being customers of…",
    "link": "https://www.memeorandum.com/260122/p77",
    "timestamp": "2026-01-22T18:20:00Z"
  },
  {
    "title": "Trump Reiterates Commitment to Keep US as the “Capital of Crypto”",
    "description": "US President Donald Trump has reiterated his commitment to keep the U.S. at the top of the crypto pecking order.",
    "link": "https://zycrypto.com/trump-reiterates-commitment-to-keep-us-as-the-capital-of-crypto/",
    "timestamp": "2026-01-22T18:19:14Z"
  },
  {
    "title": "Zelensky is ‘a man in a desperate position’ – Orban",
    "description": "Hungarian Prime Minister Viktor Orban has accused Vladimir Zelensky of refusing to end the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631376-orban-zelensky-desperate-davos/",
    "timestamp": "2026-01-22T18:19:07Z"
  },
  {
    "title": "Bitwise launches actively managed ETF pairing Bitcoin with gold",
    "description": "Bitwise has launched an actively managed ETF combining Bitcoin, gold and mining equities, reflecting crypto’s growing role in macro and inflation-hedging strategies.",
    "link": "https://cointelegraph.com/news/bitwise-bitcoin-gold-currency-debasement-etf",
    "timestamp": "2026-01-22T18:19:03Z"
  },
  {
    "title": "Marco Rubio: Board of Peace Is Also 'a Board of Action'",
    "description": "Secretary of State Marco Rubio declared that the President Trump-led Board of Peace is also \"a board of action\" in his remarks at the body's charter announcement in Davos, Switzerland. \nThe post Marco Rubio: Board of Peace Is Also ‘a Board of Action’ appeared…",
    "link": "https://www.breitbart.com/politics/2026/01/22/marco-rubio-board-peace-is-also-board-action/",
    "timestamp": "2026-01-22T18:18:46Z"
  },
  {
    "title": "Trump to sue New York Times over unfavorable opinion poll",
    "description": "Trump to sue New York Times over unfavorable opinion polltimesofmalta.com",
    "link": "https://timesofmalta.com/article/trump-sue-new-york-times-unfavorable-opinion-poll.1122935",
    "timestamp": "2026-01-22T18:18:00Z"
  },
  {
    "title": "Merz and Meloni reshape Germany-Italy relations",
    "description": "Chancellor Friedrich Merz and Prime Minister Giorgia Meloni are showing closer ties than their countries have in years. Meloni is no longer seen as a right-wing outsider, taking on a role as mediator with Donald Trump.",
    "link": "https://www.dw.com/en/merz-and-meloni-reshape-germany-italy-relations/a-75607617",
    "timestamp": "2026-01-22T18:18:00Z"
  },
  {
    "title": "Zelenskiy tells Europe: have courage to finally 'act now'",
    "description": "KYIV, Jan 22 (Reuters) - President ‌Volodymyr Zelenskiy criticised Europe on Thursday as a \"fragmented ‌kaleidoscope of small and middle powers\" lacking courage ‌to act decisively and facing a dark future unless it stood up to U.S. and Russian power. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2026/01/23/zelenskiy-tells-europe-have-courage-to-finally-039act-now039",
    "timestamp": "2026-01-22T18:18:00Z"
  },
  {
    "title": "The West's Already-Messy Divorce",
    "description": "Mark Carney's speech, and Donald Trump's blunderbussing, foreshadow future ruptures.",
    "link": "https://reason.com/2026/01/22/the-wests-already-messy-divorce/",
    "timestamp": "2026-01-22T18:17:05Z"
  },
  {
    "title": "Who would want to join Donald Trump’s ‘Board of Peace’?",
    "description": "Trump's \"Board of Peace\", a nascent rival to the UN, has delighted the autocracies seeking to ingratiate themselves with the U.S. Read on",
    "link": "https://financialpost.com/financial-times/donald-trump-board-of-peace",
    "timestamp": "2026-01-22T18:16:05Z"
  },
  {
    "title": "Jim Jordan launches his attacks on Jack Smith (Hailey Fuchs/Politico)",
    "description": "Hailey Fuchs / Politico:\nJim Jordan launches his attacks on Jack Smith  —  House Judiciary Chair Jim Jordan is looking to paint former special counsel Jack Smith as the culmination of a yearslong campaign by Democrats to leverage law enforcement activities ag…",
    "link": "https://www.memeorandum.com/260122/p74",
    "timestamp": "2026-01-22T18:15:00Z"
  },
  {
    "title": "Florida Democratic state Rep. Angie Nixon announces challenge to GOP U.S. Sen. Ashley Moody",
    "description": "Democratic state Rep. Angie Nixon has announced her candidacy for the Florida U.S. Senate seat held by Republican Ashley Moody in the 2026 election",
    "link": "https://abcnews.go.com/Politics/wireStory/florida-democratic-state-rep-angie-nixon-announces-challenge-129463194",
    "timestamp": "2026-01-22T18:14:16Z"
  },
  {
    "title": "Executive powers: Appeals court allows Trump more authority to cut grants",
    "description": "Supreme Court already twice had affirmed president's power to decide",
    "link": "https://www.wnd.com/2026/01/executive-powers-appeals-court-allows-trump-more-authority/",
    "timestamp": "2026-01-22T18:13:27Z"
  },
  {
    "title": "Jim Jordan says FBI searched Barron Trump’s room during Mar-a-Lago raid at Jack Smith hearing",
    "description": "Former special counsel Jack Smith faced tough questions as Jim Jordan accused the DOJ of breaking FBI protocol during the 2022 Mar-a-Lago raid.",
    "link": "https://www.foxnews.com/politics/jim-jordan-says-fbi-searched-barron-trump-room-mar-a-lago-raid-jack-smith-hearing",
    "timestamp": "2026-01-22T18:13:03Z"
  },
  {
    "title": "Fifa president Gianni Infantino aims dig at British football fans in speech to world leaders",
    "description": "Fifa president Gianni Infantino made a joke about British football fans’ behaviour and defended ticket prices for this summer’s World Cup in North America during a speech to world leaders on Thursday.",
    "link": "https://www.independent.ie/sport/soccer/fifa-president-gianni-infantino-aims-dig-at-british-football-fans-in-speech-to-world-leaders/a901129692.html",
    "timestamp": "2026-01-22T18:12:51Z"
  },
  {
    "title": "Gold slips as easing geopolitical strains lift risk appetite",
    "description": "Gold prices ticked down on Thursday, pausing a three-session rally to record ‍highs, as easing tensions over ‍Greenland boosted risky assets.",
    "link": "https://www.cnbc.com/2026/01/22/gold-falls-as-easing-geopolitical-tensions-dampen-safe-haven-demand.html",
    "timestamp": "2026-01-22T18:10:29Z"
  },
  {
    "title": "AP report: Army orders military police to get ready for possible Minneapolis deployment",
    "description": "The U.S. Army has ordered several dozen additional active-duty soldiers to prepare for a possible deployment to Minneapolis if needed, a defense official said Wednesday, amid protests over the Trump administration's immigration enforcement crackdown.",
    "link": "https://www.pbs.org/newshour/politics/ap-report-army-orders-military-police-to-get-ready-for-possible-minneapolis-deployment",
    "timestamp": "2026-01-22T18:10:19Z"
  },
  {
    "title": "Trump Sues JPMorgan, Dimon for $5 Billion Over Alleged Debanking (Bloomberg)",
    "description": "Bloomberg:\nTrump Sues JPMorgan, Dimon for $5 Billion Over Alleged Debanking  —  President Donald Trump sued JPMorgan Chase & Co. and its Chief Executive Officer, Jamie Dimon, for at least $5 billion over allegations that the lender stopped offering him bankin…",
    "link": "https://www.memeorandum.com/260122/p73",
    "timestamp": "2026-01-22T18:10:00Z"
  },
  {
    "title": "Trump budget office orders review of funds to Democratic-controlled states (Jacob Bogage/Washington Post)",
    "description": "Jacob Bogage / Washington Post:\nTrump budget office orders review of funds to Democratic-controlled states  —  President Donald Trump said his administration would cut off federal resources to “sanctuary cities” on Feb. 1.  —  The Trump administration has ord…",
    "link": "https://www.memeorandum.com/260122/p71",
    "timestamp": "2026-01-22T18:10:00Z"
  },
  {
    "title": "Former US prosecutor says Trump 'willfully' broke laws",
    "description": "Ex-Special Counsel Jack Smith said there was \"proof beyond a reasonable doubt\" that Donald Trump \"engaged in criminal activity\" to overturn the 2020 election results. Trump has called the inquiry politically motivated. Former US Special Counsel Jack Smith, wh…",
    "link": "https://www.dw.com/en/former-us-prosecutor-says-trump-willfully-broke-laws/a-75612566",
    "timestamp": "2026-01-22T18:09:00Z"
  },
  {
    "title": "Lawmakers Grill Health CEOs on Costs as ACA Hangs Over Debate",
    "description": "Lawmakers pointed the finger at insurance executives for high US health costs in a hearing Thursday, as Congress seeks to deflect blame for a health system that’s become unaffordable to many Americans.",
    "link": "https://financialpost.com/pmn/business-pmn/lawmakers-grill-health-ceos-on-costs-as-aca-hangs-over-debate",
    "timestamp": "2026-01-22T18:08:28Z"
  },
  {
    "title": "Jake and Logan Paul’s Mom Thinks Trump Sees Himself in Sons: Read Excerpt",
    "description": "Jake and Logan Paul’s mom, Pam Stepnick, is pulling back the curtain on their lives in her new memoir. In F*** the Pauls: Written by Their Mother, out Tuesday, January 27, Pam chronicles raising her two sons — who rose to fame on Vine and YouTube and have bec…",
    "link": "https://www.usmagazine.com/celebrity-news/news/jake-and-logan-pauls-mom-thinks-trump-sees-himself-in-sons-excerpt/#article",
    "timestamp": "2026-01-22T18:08:21Z"
  },
  {
    "title": "Trump's son called UK police after seeing woman 'beat up', court hears",
    "description": "President Trump's youngest son told officers in London he had seen a friend being attacked during a video call.",
    "link": "https://www.bbc.com/news/articles/cg5gg05y0mlo",
    "timestamp": "2026-01-22T18:06:55Z"
  },
  {
    "title": "Donald Trump Rages Over His Poor Marks In New York Times/Siena Poll, Says He’ll Add It To His Defamation Lawsuit",
    "description": "Donald Trump raged at the latest New York Times/Siena Poll, which shows him with low approval after a year in office, and said that he’ll add what he called the “fake results” to his defamation claim against the Gray Lady. Trump’s Truth Social post on Thursda…",
    "link": "http://deadline.com/2026/01/trump-new-york-times-poll-lawsuit-1236693150/",
    "timestamp": "2026-01-22T18:06:11Z"
  },
  {
    "title": "Purple Bruise Appears On Trump’s Left Hand After Similar Marks On Right Hand",
    "description": "President Donald Trump was shown to have purple bruising to his left hand while speaking in Switzerland, similar to bruising he has had on his right hand.",
    "link": "https://www.forbes.com/sites/mikestunson/2026/01/22/purple-bruise-appears-on-trumps-left-hand-after-similar-marks-on-right-hand/",
    "timestamp": "2026-01-22T18:06:09Z"
  },
  {
    "title": "Karoline Leavitt comes up with tale to explain away Trump's badly bruised hand in Davos",
    "description": "White House Press Secretary Karoline Leavitt offered an explanation after President Donald Trump was pictured in Switzerland with new bruising on his left hand.“At the Board of Peace event today in Davos, President Trump hit his hand on the corner of the sign…",
    "link": "https://www.rawstory.com/trump-leavitt-bruising/",
    "timestamp": "2026-01-22T18:03:45Z"
  },
  {
    "title": "Senior Israeli commentator: 'Donald Trump is trying to make the world a better place'",
    "description": "Channel 12 News International Commentator and Foreign Editor Arad Nir says 'we need to keep our fingers crossed for Trump's success' following the announcement of the Board of Peace charter.",
    "link": "https://www.israelnationalnews.com/news/421327",
    "timestamp": "2026-01-22T18:02:11Z"
  },
  {
    "title": "‘Abortion-on-demand agenda’: Trump confronts millions in COVID funding for Planned Parenthood",
    "description": "'As you know, fraudulent loan applications can trigger both civil and criminal penalties'",
    "link": "https://www.wnd.com/2026/01/abortion-demand-agenda-trump-confronts-millions-covid-funding/",
    "timestamp": "2026-01-22T18:02:01Z"
  },
  {
    "title": "Hakeem Jeffries: ‘ICE Should Not be Able to Storm Houses of Worship’",
    "description": "\"It’s like the actual church storming never happened.\"\nThe post Hakeem Jeffries: ‘ICE Should Not be Able to Storm Houses of Worship’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/hakeem-jeffries-ice-should-not-be-able-to-storm-houses-of-worship/",
    "timestamp": "2026-01-22T18:00:52Z"
  },
  {
    "title": "THE DON SUES CHASE, DIMON FOR $5 BILLION...",
    "description": "FIRST ON FOX: President Donald Trump is suing JPMorgan Chase and its CEO Jamie Dimon in a $5 billion lawsuit filed Thursday, accusing the financial institution of debanking him for political reasons.",
    "link": "https://www.foxbusiness.com/politics/trump-sues-jpmorgan-chase-ceo-jamie-dimon-5b-over-alleged-political-debanking",
    "timestamp": "2026-01-22T18:00:18Z"
  },
  {
    "title": "New $2.5 Billion Agency Will Boost U.S. Critical Mineral Production",
    "description": "A bipartisan group of lawmakers has proposed creating a new $2.5 billion agency to accelerate U.S. production of rare earths and other critical minerals, according to AP and MSN.  The effort comes as the Trump administration has already taken aggressive steps…",
    "link": "https://oilprice.com/Metals/Commodities/New-25-Billion-Agency-Will-Boost-US-Critical-Mineral-Production.html",
    "timestamp": "2026-01-22T18:00:00Z"
  },
  {
    "title": "Trust is broken. Europe-US relations have never been lower",
    "description": "Relations between Europe and United States badly damaged by Trump’s Greenland ambitions",
    "link": "https://www.irishtimes.com/world/europe/2026/01/22/trust-is-broken-europe-us-relations-have-never-been-lower/",
    "timestamp": "2026-01-22T18:00:00Z"
  },
  {
    "title": "Glenn Beck: Trump’s tariffs and Greenland push have a hidden meaning — and it’s bigger than you realize",
    "description": "President Donald Trump has recently intensified his push to acquire Greenland for U.S. national security reasons, refusing to rule out military force or economic coercion, including tariffs on Denmark and European allies. The U.S. will get control of Greenlan…",
    "link": "https://www.theblaze.com/shows/the-glenn-beck-program/glenn-beck-trumps-tariffs-and-greenland-push-have-a-hidden-meaning-and-its-bigger-than-you-realize",
    "timestamp": "2026-01-22T18:00:00Z"
  },
  {
    "title": "China and US Approve TikTok Spinoff Sale",
    "description": "The U.S. and China have approved a deal to sell TikTok’s U.S. business to a group led by Oracle and Silver Lake, ending the threat of a nationwide ban.\nThe post China and US Approve TikTok Spinoff Sale first appeared on iPhone in Canada.",
    "link": "https://www.iphoneincanada.ca/2026/01/22/china-and-us-approve-tiktok-spinoff-sale/",
    "timestamp": "2026-01-22T17:58:34Z"
  },
  {
    "title": "Betting Odds Increase On Donald Trump Leaving The White House Early",
    "description": "Those predictions follow Trump's embarrassing performance on the world stage at Davos, where he continued to bash our European allies who oppose his bid to purchase Greenland.",
    "link": "https://hiphopwired.com/3012343/betting-odds-increase-donald-trump-leaving-white-house-early/",
    "timestamp": "2026-01-22T17:57:42Z"
  },
  {
    "title": "Wealth Quote of the Day by Charlie Munger, “Most people get interested in stocks when everyone else is. The time to get interested is when no one else is” The Munger–Buffett partnership and the power of patience",
    "description": "Wealth Quote of the Day by Charlie Munger, “Most people get interested in stocks when everyone else is. The time to get interested is when no one else is” Charlie Munger, legendary investor, built Berkshire Hathaway into a trillion-dollar empire. He favors qu…",
    "link": "https://economictimes.indiatimes.com/news/international/us/wealth-quote-of-the-day-by-charlie-munger-most-people-get-interested-in-stocks-when-everyone-else-is-the-time-to-get-interested-is-when-no-one-else-is-the-mungerbuffett-partnership-and-the-power-of-patience/articleshow/127166602.cms",
    "timestamp": "2026-01-22T17:56:25Z"
  },
  {
    "title": "Trump sues JPMorgan and CEO Jamie Dimon for $5 billion over alleged debanking",
    "description": "Trump sued the nation's largest bank and its famous CEO for allegations of political debanking.",
    "link": "https://www.businessinsider.com/trump-sues-jpmorgan-dimon-for-5-billion-over-alleged-debanking-2026-1",
    "timestamp": "2026-01-22T17:55:46Z"
  },
  {
    "title": "Trump sues JPMorgan and Jamie Dimon for dropping him as a customer after Jan. 6 attack | CNN Business",
    "description": "President Donald Trump is suing JPMorgan Chase, the nation’s largest bank, and its CEO Jamie Dimon, charging it improperly dropped him as a client in 2021 for political reasons.",
    "link": "https://www.cnn.com/2026/01/22/business/jpmorgan-chase-trump-lawsuit-debanking",
    "timestamp": "2026-01-22T17:54:00Z"
  },
  {
    "title": "‘Classic Trump’: Byron York dissects strategy president used to get Greenland deal",
    "description": "'The other side’s happy because they think they dodged a bullet'",
    "link": "https://www.wnd.com/2026/01/classic-trump-byron-york-dissects-strategy-president-used/",
    "timestamp": "2026-01-22T17:53:32Z"
  },
  {
    "title": "Tenacious D’s Kyle Gass reveals Jack Black fallout after ‘terrible’ Trump assassination joke",
    "description": "\"It was terrible. It was terrible judgment, obviously.\"",
    "link": "https://nypost.com/2026/01/22/entertainment/tenacious-ds-kyle-gass-reveals-jack-black-fallout-after-trump-assassination-joke/",
    "timestamp": "2026-01-22T17:53:02Z"
  },
  {
    "title": "People in Gaza dig through garbage for things to burn to keep warm — a far cry from Trump’s vision",
    "description": "The scenes contrasted starkly with the vision of the territory projected by world leaders.",
    "link": "https://www.bostonherald.com/2026/01/22/gaza-winter-struggles/",
    "timestamp": "2026-01-22T17:52:50Z"
  },
  {
    "title": "President POS: Donald Trump Hopes Renee Good’s MAGA Father Is ‘Still A Fan’ After ICE Killed Her",
    "description": "Trump's callous response to a woman's death at ICE's hands reveals his disregard for human life and empathy.\nThe post President POS: Donald Trump Hopes Renee Good’s MAGA Father Is ‘Still A Fan’ After ICE Killed Her appeared first on Bossip.",
    "link": "https://bossip.com/4300676/donald-trump-hopes-renee-goods-maga-father-is-still-a-fan/",
    "timestamp": "2026-01-22T17:51:59Z"
  },
  {
    "title": "Markets rise as geopolitical tensions ease",
    "description": "Euronext Dublin finished the day up 1.5% mainly on the back of a surge from Bank of Ireland",
    "link": "https://www.irishtimes.com/business/2026/01/22/markets-rise-as-geopolitical-tensions-ease/",
    "timestamp": "2026-01-22T17:48:43Z"
  },
  {
    "title": "Venezuelan Thug-in-Chief Diosdado Cabello Panics over Reports Hinting He Betrayed Maduro to the U.S.",
    "description": "Venezuelan socialist strongman Diosdado Cabello dared \"anyone\" to find evidence of his alleged conversations with the United States.\nThe post Venezuelan Thug-in-Chief Diosdado Cabello Panics over Reports Hinting He Betrayed Maduro to the U.S. appeared first o…",
    "link": "https://www.breitbart.com/latin-america/2026/01/22/venezuelas-thug-in-chief-diosdado-cabello-panics-over-reports-hinting-he-betrayed-maduro-u-s/",
    "timestamp": "2026-01-22T17:48:43Z"
  },
  {
    "title": "Signs that Trump’s economic policies are alienating his rural Maga base",
    "description": "Deportations are draining the pool of agricultural workers, while tariffs are forcing up costs for farmers and small businesses.",
    "link": "https://theconversation.com/signs-that-trumps-economic-policies-are-alienating-his-rural-maga-base-273876",
    "timestamp": "2026-01-22T17:47:36Z"
  },
  {
    "title": "Donald Trump’s Board of Peace signed at Davos – key points I took away from my visit to the ski resort",
    "description": "Trump is seeking to hand himself powers not even enjoyed by the dictators of the world.",
    "link": "https://theconversation.com/donald-trumps-board-of-peace-signed-at-davos-key-points-i-took-away-from-my-visit-to-the-ski-resort-274140",
    "timestamp": "2026-01-22T17:47:33Z"
  },
  {
    "title": "Ursula von der Leyen’s trade troubles are just beginning",
    "description": "Despite notching up wins abroad, the European Commission has hit a wall with EU countries and lawmakers.",
    "link": "https://www.politico.eu/article/ursula-von-der-leyen-trade-trouble-beginning/",
    "timestamp": "2026-01-22T17:46:50Z"
  },
  {
    "title": "'New Gaza' Plan by Far-Right Zionist Jared Kushner Decried as 'Ethnic Extermination'",
    "description": "The presentation on the future of Gaza given by President Donald Trump's son-in-law and adviser, Jared Kushner, inyelloe Davos on Thursday, offered what one journalist called \"a sanitized, cosmetic image\" of an exclave that, due largely to US policy, is actua…",
    "link": "https://www.commondreams.org/news/new-gaza",
    "timestamp": "2026-01-22T17:46:48Z"
  },
  {
    "title": "America could ‘lose the AI race’ because of too much ‘pessimism,’ White House AI czar David Sacks says",
    "description": "Trump’s technology czar worries AI dread will equate to a “self-inflicted injury.” He’s also against the California billionaires tax.",
    "link": "https://fortune.com/2026/01/22/david-sacks-warns-america-could-lose-the-ai-race-because-of-pessimism/",
    "timestamp": "2026-01-22T17:46:26Z"
  },
  {
    "title": "‘They Have to Pay a Price!’ Trump Absolutely LOSES IT Over Dismal NYT Poll",
    "description": "President Donald Trump declared that The New York Times must “pay a price” on Thursday after the Gray Lady and Siena University released a new poll suggesting that just 40% of registered voters approve of him. In a write-up about the survey, the Times’ chief …",
    "link": "https://freerepublic.com/focus/f-chat/4363438/posts",
    "timestamp": "2026-01-22T17:45:51Z"
  },
  {
    "title": "Trump sues Jamie Dimon, JPMorgan Chase over debanking",
    "description": "Chase Bank closed Trump's accounts on the heels of the Jan. 6, 2021, U.S. Capitol riot and the president exiting the White House later that same month.",
    "link": "https://www.cnbc.com/2026/01/22/trump-sues-jamie-dimon-jpmorgan-chase.html",
    "timestamp": "2026-01-22T17:45:40Z"
  },
  {
    "title": "Trump administration scraps multimillion-dollar solar projects in Puerto Rico as grid crumbles",
    "description": "The projects were aimed at helping 30,000 low-income families in rural areas across the territory.",
    "link": "https://www.bostonherald.com/2026/01/22/trump-puerto-rico-solar/",
    "timestamp": "2026-01-22T17:45:26Z"
  },
  {
    "title": "ICE officers detain five-year-old after using him as 'bait' to capture dad, school claims",
    "description": "US Immigration and Customs Enforcement (ICE) officers have detained a five-year-old boy - after using him as \"bait\" to capture his father, officials claim.",
    "link": "https://news.sky.com/story/ice-officers-detain-five-year-old-after-using-him-as-bait-to-capture-dad-school-claims-13497748",
    "timestamp": "2026-01-22T17:45:00Z"
  },
  {
    "title": "Trump threatens Jack Smith as he testifies: 'The Attorney General is looking'",
    "description": "President Donald Trump lashed out at former special counsel Jack Smith while he was testifying before the House Judiciary Committee on Thursday.The president took to Truth Social to issue his threat against Smith.\"Deranged Jack Smith is being DECIMATED before…",
    "link": "https://www.rawstory.com/trump-threatens-jack-smith/",
    "timestamp": "2026-01-22T17:42:51Z"
  },
  {
    "title": "Weekly quiz: How did this cow surprise scientists?",
    "description": "How much attention did you pay to what happened in the world over the past seven days?",
    "link": "https://www.bbc.com/news/articles/c86v5nj39g1o",
    "timestamp": "2026-01-22T17:42:37Z"
  },
  {
    "title": "Tesla to sell Optimus robots to public next year, Elon Musk says",
    "description": "Tesla is already using some of the robots to do simple tasks in its factory, Musk says in Davos speech",
    "link": "https://www.irishtimes.com/business/2026/01/22/tesla-to-sell-optimus-robots-to-public-next-year-elon-musk-says/",
    "timestamp": "2026-01-22T17:41:59Z"
  },
  {
    "title": "Zelenskyy suggests trilateral Ukraine, Russia and US talks, while slamming 'lost' Europe",
    "description": "The Kremlin is yet to comment on the Ukrainian president's announcement, made at the World Economic Forum in Davos.",
    "link": "https://www.abc.net.au/news/2026-01-23/zelenskyy-announces-ukraine-talks-with-russia-us/106260134",
    "timestamp": "2026-01-22T17:41:25Z"
  },
  {
    "title": "The U.S. Is Forcing Afghan Allies Into Exile With No Way Forward",
    "description": "After being moved to Qatar and left in bureaucratic limbo for years, Afghan evacuees are now being relocated again—but no one knows where to.",
    "link": "https://reason.com/2026/01/22/the-u-s-is-forcing-afghan-allies-into-exile-with-no-way-forward/",
    "timestamp": "2026-01-22T17:41:21Z"
  },
  {
    "title": "Elon Musk warns the U.S. could soon be producing more chips than we can turn on. And China doesn’t have the same issue",
    "description": "“The limiting factor for AI deployment is fundamentally electrical power,” Musk said at the World Economic Forum on Thursday.",
    "link": "https://fortune.com/2026/01/22/elon-musk-ai-data-center-chips-electrical-power-china-world-economic-forum/",
    "timestamp": "2026-01-22T17:41:17Z"
  },
  {
    "title": "Never mind Trump's global romps, strong India-US ties continue to matter very much to both sides",
    "description": "For global peace and stability, the dynamics of US-India relations are pivotal, especially in counteracting China's expansive reach, yet trade dialogues face significant hurdles. Trade issues and migration of skilled workers pose challenges, but their coopera…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/never-mind-trumps-global-romps-strong-india-us-ties-continue-to-matter-very-much-to-both-sides/articleshow/127180609.cms",
    "timestamp": "2026-01-22T17:41:06Z"
  },
  {
    "title": "‘My Office Didn’t Spy On Anyone’: Jack Smith Spars With GOP Congressman In Tense Hearing",
    "description": "Darrell Issa accused Jack Smith of \"spying\" on his political enemies as he sought to bring criminal charges against Donald Trump.\nThe post ‘My Office Didn’t Spy On Anyone’: Jack Smith Spars With GOP Congressman In Tense Hearing first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/my-office-didnt-spy-on-anyone-jack-smith-spars-with-gop-congressman-in-tense-hearing/",
    "timestamp": "2026-01-22T17:40:20Z"
  },
  {
    "title": "Semantic Collapse: “My Own Morality” in Trump’s Political Rhetoric",
    "description": "This article examines Donald Trump’s invocation of the phrase “my own morality” as a case study in the degradation of moral language within contemporary populist political discourse.\nThe post Semantic Collapse: “My Own Morality” in Trump’s Political Rhetoric …",
    "link": "https://www.globalresearch.ca/semantic-collapse-moral-language-trump-political-rhetoric/5913209",
    "timestamp": "2026-01-22T17:40:05Z"
  },
  {
    "title": "Trump accused of 'criminal scheme' to overturn election",
    "description": "Former special counsel Jack Smith defended his prosecution of US President Donald Trump, accusing him of engaging in a \"criminal scheme\" to overturn the results of the 2020 presidential election he lost to Democrat Joe Biden.",
    "link": "https://www.rte.ie/news/world/2026/0122/1554587-trump-election/",
    "timestamp": "2026-01-22T17:38:08Z"
  },
  {
    "title": "DAVID MARCUS: New York Dems pull dirty districting trick as 'aw shucks' Indiana GOP folds",
    "description": "New York judge allegedly targets GOP Rep. Nicole Malliotakis' district in controversial partisan ruling that could reshape the congressional map significantly.",
    "link": "https://www.foxnews.com/opinion/david-marcus-new-york-dems-pull-dirty-districting-trick-aw-shucks-indiana-gop-folds",
    "timestamp": "2026-01-22T17:38:06Z"
  },
  {
    "title": "Trump's European threats could cause lasting damage to US standing in the world",
    "description": "Joe Biden's promise of \"America is back\" has been challenged by Donald Trump's presidency, which has strained long-standing alliances with Europe. Trump's transactional approach, including threats over Greenland and accusations of ingratitude, has left allies…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-european-threats-could-cause-lasting-damage-to-us-standing-in-the-world/articleshow/127181019.cms",
    "timestamp": "2026-01-22T17:36:53Z"
  },
  {
    "title": "Britain Refuses To Join Donald Trump's New International Peace Board Over Vladimir Putin Concerns",
    "description": "Britain refuses to join Trump's Board of Peace over Putin's inclusion, citing concerns about inviting an aggressor to a peace summit whilst Ukraine remains at war.",
    "link": "https://www.ibtimes.com/britain-refuses-join-donald-trumps-new-international-peace-board-over-vladimir-putin-concerns-3796069",
    "timestamp": "2026-01-22T17:36:16Z"
  },
  {
    "title": "Trump sues JPMorgan Chase, CEO Dimon over alleged 'political' debanking: Report",
    "description": "Former President Donald Trump has filed a $5 billion lawsuit against JPMorgan Chase and CEO Jamie Dimon, alleging the bank debanked him for political reasons. The lawsuit, filed in Florida state court, stems from Trump's claims that the bank took this action …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-sues-jpmorgan-chase-ceo-dimon-over-alleged-political-debanking-report/articleshow/127180899.cms",
    "timestamp": "2026-01-22T17:35:44Z"
  },
  {
    "title": "Vance heads to Minnesota as tensions rise after school says children detained by ICE",
    "description": "Tensions appeared unlikely to subside after school officials in a nearby suburb said ICE agents had detained a 5-year-old boy.",
    "link": "https://www.inforum.com/news/minnesota/vance-heads-to-minnesota-as-tensions-rise-after-school-says-children-detained-by-ice",
    "timestamp": "2026-01-22T17:35:35Z"
  },
  {
    "title": "America Officially Withdraws from the World Health Organization",
    "description": "With the Pandemic Treaty in place, the Gates Foundation and GAVI now fill the power vacuum as top funders — putting WHO member states in danger.",
    "link": "https://www.thefocalpoints.com/p/america-officially-withdraws-from",
    "timestamp": "2026-01-22T17:34:37Z"
  },
  {
    "title": "Paramount extends its deadline for its Warner Bros. tender offer, again",
    "description": "Warner stockholders now have until February 20 to sell shares for $30 each.",
    "link": "https://www.bostonherald.com/2026/01/22/paramount-extends-warner-bros-deadline/",
    "timestamp": "2026-01-22T17:33:47Z"
  },
  {
    "title": "ICE Kidnaps 5-Year-Old As Bait, House Dems Will Vote To Send Firm Message To Please Stop That",
    "description": "Maybe Chuck Schumer and Senate Dems will hold ICE accountable. That could happen.",
    "link": "https://www.wonkette.com/p/ice-kidnaps-5-year-old-as-bait-house",
    "timestamp": "2026-01-22T17:31:11Z"
  },
  {
    "title": "Here are the countries joining Trump's 'Board of Peace' so far",
    "description": "U.S. President Donald Trump launched his newly formed \"Board of Peace\" on an international stage Thursday as more countries responded to his invitation for a seat at the table that will initially aim to rebuild Gaza.",
    "link": "https://www.cbc.ca/news/world/board-of-peace-gaza-trump-list-of-countries-9.7055866",
    "timestamp": "2026-01-22T17:31:05Z"
  },
  {
    "title": "ICE Detained a 5-Year-Old Minnesota Boy and Used Him As “Bait”",
    "description": "Immigration and Customs Enforcement agents detained a 5-year-old on his way home from school on Tuesday and used him as “bait” to knock on his front door to see if anyone was home, according to school officials in Minnesota.  Liam Conejo Ramos, a preschooler,…",
    "link": "https://www.motherjones.com/politics/2026/01/liam-ramos-ice-arrest-detained-minnesota/",
    "timestamp": "2026-01-22T17:31:04Z"
  },
  {
    "title": "Why Conservatives Defend ICE",
    "description": "Republicans deplore the mayhem in Minnesota—but blame protesters and Democrats for it.",
    "link": "https://www.theatlantic.com/ideas/2026/01/ice-conservatives-minnesota-dhs-protests/685705/",
    "timestamp": "2026-01-22T17:30:33Z"
  },
  {
    "title": "Finnish president Stubb says Trump is putting pressure on Russia",
    "description": "DAVOS, Switzerland, Jan 22 (Reuters) - Finnish President Alexander Stubb said on Thursday U.S. President Donald Trump is putting pressure on Russia over the war in Ukrain… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/22/finnish-president-stubb-says-trump-is-putting-pressure-on-russia",
    "timestamp": "2026-01-22T17:30:29Z"
  },
  {
    "title": "Yelling erupts in Jack Smith's hearing as lawmakers clash: 'I yield in disgust'",
    "description": "Shouting broke out between lawmakers during former Special Counsel Jack Smith's first public testimony on Thursday. Rep. Darrell Issa (R-CA) and Rep. Jamie Raskin (D-MD) got into a yelling match during the House Judiciary Committee hearing over Smith's invest…",
    "link": "https://www.rawstory.com/jack-smith-donald-trump-2675005399/",
    "timestamp": "2026-01-22T17:28:11Z"
  },
  {
    "title": "‘They Have to Pay a Price!’ Trump Absolutely LOSES IT Over Dismal NYT Poll",
    "description": "President Donald Trump declared that The New York Times must \"pay a price\" on Thursday after it released a poll suggesting he has a 40% approval rating.\nThe post ‘They Have to Pay a Price!’ Trump Absolutely LOSES IT Over Dismal NYT Poll first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/they-have-to-pay-a-price-trump-absolutely-loses-it-over-dismal-nyt-poll/",
    "timestamp": "2026-01-22T17:28:02Z"
  },
  {
    "title": "Washington Dem pushes bill to bar recent ICE hires from future police jobs, slamming Trump's 'occupying force'",
    "description": "A Washington state Democrat introduced the ICE Out Act of 2026, which would block state law enforcement from hiring recently sworn-in ICE officers.",
    "link": "https://www.foxnews.com/politics/washington-dem-pushes-bill-bar-recent-ice-hires-future-police-jobs-slamming-trump-occupying-force",
    "timestamp": "2026-01-22T17:25:50Z"
  },
  {
    "title": "‘Trump whisperer’ Rutte steers NATO around Greenland crisis",
    "description": "By Anthony Deutsch, Andrew Gray, Lili Bayer and John IrishAMSTERDAM/BRUSSELS, Jan 22 (Reuters) - As tensions over Greenland between Donald Trump and Europe neared boiling… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/22/trump-whisperer-rutte-steers-nato-around-greenland-crisis",
    "timestamp": "2026-01-22T17:25:15Z"
  },
  {
    "title": "Trump's Uneven Complexion Fuels Health Speculation",
    "description": "The president’s hand bruising was more prominent than ever on Thursday.",
    "link": "https://www.thedailybeast.com/trumps-uneven-complexion-fuels-health-speculation/",
    "timestamp": "2026-01-22T17:24:14Z"
  },
  {
    "title": "Bruising on Trump’s Hand Looks Worse Than Ever at Davos Board of Peace Signing",
    "description": "Several images circulating on social media on Thursday show intense bruising on President Donald Trump’s hands as new questions erupt over his health.\nThe post Bruising on Trump’s Hand Looks Worse Than Ever at Davos Board of Peace Signing first appeared on Me…",
    "link": "https://www.mediaite.com/media/news/bruising-on-trumps-hand-looks-worse-than-ever-at-davos-board-of-peace-signing/",
    "timestamp": "2026-01-22T17:23:41Z"
  },
  {
    "title": "House committee delivers facts about Jack Smith as he testifies",
    "description": "Determined to have violated 'the fundamental tenet of the American legal system of innocent until proven guilty'",
    "link": "https://www.wnd.com/2026/01/house-committee-delivers-facts-about-jack-smith-as/",
    "timestamp": "2026-01-22T17:23:08Z"
  },
  {
    "title": "US Murder Rate Plunges To Lowest Level In Over 100 Years, Report Shows",
    "description": "The U.S. murder rate plunged to the lowest level in more than 100 years in 2025, according to a report released Thursday.",
    "link": "https://dailycaller.com/2026/01/22/murder-rate-lowest-century-report/",
    "timestamp": "2026-01-22T17:22:36Z"
  },
  {
    "title": "Trump says will sue New York Times over unfavorable opinion poll",
    "description": "Former US President Donald Trump has announced plans to sue The New York Times. This action follows the publication of an opinion poll by the newspaper. The poll indicated a decline in voter support for the Republican figure. Trump stated on his Truth Social …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-will-sue-new-york-times-over-unfavorable-opinion-poll/articleshow/127179703.cms",
    "timestamp": "2026-01-22T17:22:29Z"
  },
  {
    "title": "Trump’s European threats could cause lasting damage to US standing in the world",
    "description": "Canada's Mark Carney highlighted a global shift, calling the rules-based order an \"illusion.\"",
    "link": "https://www.bostonherald.com/2026/01/22/trump-european-threats/",
    "timestamp": "2026-01-22T17:22:23Z"
  },
  {
    "title": "WATCH: Jack Smith warns that Americans are taking the rule of law for granted",
    "description": "\"The rule of law is not self-executing. It depends on our collective commitment to apply it. It requires dedicated service on behalf of others, especially when that service is difficult and comes with costs,\" Smith said.",
    "link": "https://www.pbs.org/newshour/politics/watch-jack-smith-warns-that-americans-are-taking-rule-of-law-for-granted",
    "timestamp": "2026-01-22T17:20:50Z"
  },
  {
    "title": "Super Bowl LX Lineup Grows More Anti-Trump With Green Day",
    "description": "The NFL's Super Bowl LX entertainment lineup has drawn political backlash after the league added Green Day to an event already headlined by Bad Bunny, two artists who have repeatedly criticized President Donald Trump. The league announced that Green Day will …",
    "link": "https://freerepublic.com/focus/f-chat/4363434/posts",
    "timestamp": "2026-01-22T17:19:50Z"
  },
  {
    "title": "EIA Confirms Crude Oil Inventory Builds in US",
    "description": "Crude oil inventories in the United States increased by 3.6 million barrels during the week ending January 21, according to new data from the U.S. Energy Information Administration (EIA) released on Thursday. The increase brings commercial stockpiles to 426 m…",
    "link": "https://oilprice.com/Energy/Crude-Oil/EIA-Confirms-Crude-Oil-Inventory-Builds-in-US.html",
    "timestamp": "2026-01-22T17:19:10Z"
  },
  {
    "title": "Bitcoin, Ethereum ETFs Shed $1 Billion Amid Trump Waffling on Greenland and Tariffs",
    "description": "Investors sought refuge from crypto exposure on Wednesday as President Donald Trump pulled back from his Greenland-related threats.",
    "link": "https://decrypt.co/355506/bitcoin-ethereum-etfs-shed-1-billion-trump-waffling-greenland-tariffs",
    "timestamp": "2026-01-22T17:18:49Z"
  },
  {
    "title": "Paramount extends its deadline for its Warner Bros. Discovery tender offer, again",
    "description": "Paramount is extending its offer to buy Warner Bros. Discovery. The company is also preparing for a proxy fight. Warner's board favors a deal with Netflix. Paramount argues its offer is better for shareholders. The battle for Warner is complex, with different…",
    "link": "https://economictimes.indiatimes.com/news/international/business/paramount-extends-its-deadline-for-its-warner-bros-discovery-tender-offer-again/articleshow/127179370.cms",
    "timestamp": "2026-01-22T17:18:47Z"
  }
]