[
  {
    "title": "US trans-shipment tariff to create major compliance issues for companies: Moody's",
    "description": "Moody's said its analysis suggests that the sectors most likely to face trans-shipment risks across ASEAN, India and Mexico include machinery, electrical equipment and consumer optical products, including semiconductors",
    "link": "https://www.thehindubusinessline.com/economy/logistics/us-trans-shipment-tariff-to-create-major-compliance-issues-for-companies-moodys/article70185711.ece",
    "timestamp": "2025-10-21T08:56:29Z"
  },
  {
    "title": "Arizona Police Agencies Were Once at the Forefront of Local Immigration Enforcement. Now Most Are Avoiding It.",
    "description": "by Rafael Carranza, Arizona Luminaria \n \n\n \n This article was produced for ProPublica’s Local Reporting Network in partnership with Arizona Luminaria. Sign up for Dispatches to get our stories in your inbox every week.\n\n \n\n \n \n \n\n\n\n \nArizona law enforcement a…",
    "link": "https://www.propublica.org/article/arizona-police-immigration-ice-287g",
    "timestamp": "2025-10-21T08:55:00Z"
  },
  {
    "title": "US-Canada trade deal may be ready by APEC summit",
    "description": "United States President Donald Trump and Canadian Prime Minister Mark Carney may be able to sign a trade deal on steel, aluminum, and energy as early as later this month at the Asia-Pacific Economic C...",
    "link": "https://biztoc.com/x/f06c8c03faa13827",
    "timestamp": "2025-10-21T08:52:29Z"
  },
  {
    "title": "Russia Works on What Lavrov, Rubio Discussed - Deputy Foreign Head",
    "description": "Moscow is currently working on what Russian Foreign Minister Sergey Lavrov and US Secretary of State Marco Rubio discussed during the recent phone call, the issue of a meeting was not specifically raised, Russian Deputy Foreign Minister Sergey Ryabkov said.",
    "link": "https://sputnikglobe.com/20251021/russia-works-on-what-lavrov-rubio-discussed---deputy-foreign-head-1122995467.html",
    "timestamp": "2025-10-21T08:52:14Z"
  },
  {
    "title": "San Francisco Rejects Trump's Help, Amid AI-Driven 'Comeback'",
    "description": "San Francisco Mayor Daniel Lurie has rejected President Donald Trump's suggestion of bringing the National Guard to the city to fight crime, amid a recovery that is driven by the artificial intelligence (AI) boom.\nThe post San Francisco Rejects Trump’s Help, …",
    "link": "https://www.breitbart.com/politics/2025/10/21/san-francisco-rejects-trumps-help-amid-ai-driven-comeback/",
    "timestamp": "2025-10-21T08:50:59Z"
  },
  {
    "title": "Sanae Takaichi Wins Historic Vote to Become Japan's First Female Prime Minister",
    "description": "Conservative Sanae Takaichi is Japan's first female prime minister after the 64-year-old triumphed Tuesday in an historic vote to clear the way for her ascendancy.\nThe post Sanae Takaichi Wins Historic Vote to Become Japan’s First Female Prime Minister appear…",
    "link": "https://www.breitbart.com/asia/2025/10/21/sanae-takaichi-wins-historic-vote-to-become-japans-first-female-prime-minister/",
    "timestamp": "2025-10-21T08:48:26Z"
  },
  {
    "title": "Trump's higher education compact: Which universities have not rejected it yet and why",
    "description": "The Trump administration proposed linking federal funding to university alignment with presidential priorities, including restrictions on academic freedom and potential closure of units critical of conservative ideas. Seven universities rejected the plan, cit…",
    "link": "https://timesofindia.indiatimes.com/education/news/trumps-higher-education-compact-which-universities-have-not-rejected-it-yet-and-why/articleshow/124717679.cms",
    "timestamp": "2025-10-21T08:45:08Z"
  },
  {
    "title": "Why Democrats aren’t talking about climate change much anymore",
    "description": "As Democrats reflect on the 2024 election, talking about the \"planetary emergency\" is out, and \"cheap energy\" is in.",
    "link": "https://grist.org/politics/democrats-arent-talking-about-climate-change-cheap-energy/",
    "timestamp": "2025-10-21T08:45:00Z"
  },
  {
    "title": "Diwali bonus dispute triggers toll plaza chaos: Agra-Lucknow Expressway workers open gates; vehicles pass without paying",
    "description": "Toll gates on the Agra-Lucknow Expressway were opened by protesting workers demanding a higher Diwali bonus, causing thousands of vehicles to pass without payment. Police intervened, leading to discussions where the company agreed to a 10% salary hike, restor…",
    "link": "https://timesofindia.indiatimes.com/city/agra/diwali-bonus-dispute-triggers-toll-plaza-chaos-agra-lucknow-expressway-workers-open-gates-vehicles-pass-without-paying/articleshow/124717269.cms",
    "timestamp": "2025-10-21T08:37:06Z"
  },
  {
    "title": "Swiss exports to US surge in September as pharma shipments rise",
    "description": "ZURICH (Reuters) -Swiss exports to the United States rebounded sharply in September, with pharmaceutical companies ramping up their shipments ahead of the...",
    "link": "https://finance.yahoo.com/news/swiss-exports-us-surge-september-083417280.html",
    "timestamp": "2025-10-21T08:34:17Z"
  },
  {
    "title": "US and Australia sign critical-minerals agreement as a way to counter China",
    "description": "WASHINGTON (AP) — President Donald Trump and Australian Prime Minister Anthony Albanese signed a critical-minerals deal at the White House on Monday as the U.S. eyes the continent’s rich rare-earth resources at a time when China is imposing tougher rules on e…",
    "link": "https://financialpost.com/pmn/us-and-australia-sign-critical-minerals-agreement-as-a-way-to-counter-china",
    "timestamp": "2025-10-21T08:32:30Z"
  },
  {
    "title": "Sanae Takaichi makes history as Japan's first female prime minister",
    "description": "A staunch conservative, she takes over as Japan grapples with rising cost-of-living and mounting debt.",
    "link": "https://www.bbc.com/news/articles/c751z23n3n7o",
    "timestamp": "2025-10-21T08:31:28Z"
  },
  {
    "title": "SCOOP: Trump-backed former Navy SEAL launches GOP primary challenge against Massie",
    "description": "Ed Gallrein, a longtime Navy SEAL and Kentucky farmer, announces GOP primary challenge against Rep. Thomas Massie in the state's 4th Congressional District.",
    "link": "https://www.foxnews.com/politics/scoop-trump-backed-former-navy-seal-launches-gop-primary-challenge-against-massie",
    "timestamp": "2025-10-21T08:30:04Z"
  },
  {
    "title": "Map Shows Donald Trump’s Approval Rating in Each State After Nine Months",
    "description": "Data from Civiqs shows that Trump is underwater in every swing state, which could prove costly in the upcoming midterm elections.",
    "link": "https://biztoc.com/x/6bd91a3432d38a4c",
    "timestamp": "2025-10-21T08:30:03Z"
  },
  {
    "title": "Crisis-hit Argentina inks US$20 billion rescue with US",
    "description": "BUENOS AIRES, Argentina: Argentina and the United States signed off on a US$20 billion financial lifeline Monday (Oct 20), hoping to avert economic meltdown and boost President Javier Milei ahead of tough legislative elections.President Donald Trump has plied…",
    "link": "https://www.channelnewsasia.com/world/argentina-economic-crisis-20-billion-rescue-us-donald-trip-5414901",
    "timestamp": "2025-10-21T08:29:21Z"
  },
  {
    "title": "Diwali Muhurat Trading 2025: Sensex jumps 270 points, Nifty nears 26,000 on festive optimism",
    "description": "Indian equity benchmarks opened on a firm note during the special one-hour Muhurat trading session on Tuesday, marking the beginning of the new Samvat 2082 -- the traditional Hindu calendar year followed by traders to mark the start of a new financial journey.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-muhurat-trading-2025-sensex-jumps-270-points-nifty-nears-26000-on-festive-optimism/articleshow/124717380.cms",
    "timestamp": "2025-10-21T08:26:09Z"
  },
  {
    "title": "‘Ay Yay Yay’: Donald Trump Panics Over A Mirror During White House Meeting",
    "description": "The minor mishap went viral on social media.",
    "link": "https://www.huffpost.com/entry/donald-trump-mirror_n_68f733b4e4b09d351b45425c",
    "timestamp": "2025-10-21T08:20:40Z"
  },
  {
    "title": "The best days to cleanse your hair; Based on astrology",
    "description": "Astrology suggests specific days for hair washing can impact luck and energy. Favorable days include Wednesday for clarity, Friday for beauty, Monday for emotional balance, and Thursday for growth. Conversely, Saturday is often seen as inauspicious due to Sat…",
    "link": "https://timesofindia.indiatimes.com/astrology/others/the-best-days-to-cleanse-your-hair-based-on-astrology/articleshow/124717038.cms",
    "timestamp": "2025-10-21T08:20:07Z"
  },
  {
    "title": "Sanae Takaichi becomes Japan’s first female prime minister",
    "description": "Big spending plans and nationalistic positions could cause concern, political analysts say",
    "link": "https://www.irishtimes.com/world/asia-pacific/2025/10/21/sanae-takaichi-becomes-japans-first-female-prime-minister/",
    "timestamp": "2025-10-21T08:19:49Z"
  },
  {
    "title": "Stocks rise and gold dips as investors recover risk appetite",
    "description": "LONDON (Reuters) -Stocks rose on Tuesday, taking comfort from a possible easing in trade tensions between the U. and China and as nerves over credit risks in...",
    "link": "https://finance.yahoo.com/news/stocks-rise-gold-dips-investors-081112583.html",
    "timestamp": "2025-10-21T08:11:12Z"
  },
  {
    "title": "What to expect for Japan's economy under Sanae Takaichi, its 1st female prime minister",
    "description": "Share prices have soared in Japan recently on hopes that conservative lawmaker Sanae Takaichi, who was chosen Tuesday to be Japan’s first female prime minister, will double down on market friendly policies",
    "link": "https://abcnews.go.com/Business/wireStory/expect-japans-economy-sanae-takaichi-1st-female-prime-126709297",
    "timestamp": "2025-10-21T08:05:45Z"
  },
  {
    "title": "Trump is going to Asia — what happens next is anyone's guess",
    "description": "President Donald Trump is preparing for a significant trip to Asia, aiming to address international trade tensions",
    "link": "https://abcnews.go.com/Business/wireStory/trump-asia-anyones-guess-126703311",
    "timestamp": "2025-10-21T08:05:26Z"
  },
  {
    "title": "'Vengeance on Rudd' not a priority for Trump, says Turnbull",
    "description": "Former prime minister Malcoim Turnbull says any talk of removing Kevin Rudd as Ambassador to the United States should be ignored.",
    "link": "https://www.abc.net.au/news/2025-10-21/rudd-should-not-be-sacked-after-trump-rebuke-turnbull-insists/105917016",
    "timestamp": "2025-10-21T08:01:43Z"
  },
  {
    "title": "On Ukraine, Trump reverts yet again to the Kremlin's view",
    "description": "After dangling the prospect of supplying Ukraine with Tomahawk cruise missiles, Trump has backed away from a deal and said repeatedly that he believes Putin wants peace.",
    "link": "https://www.cbc.ca/news/world/trump-ukraine-putin-russia-9.6945537",
    "timestamp": "2025-10-21T08:00:00Z"
  },
  {
    "title": "Putin-Trump Budapest summit may be stalled as Lavrov-Rubio pre-meeting postponed indefinitely, says US broadcaster",
    "description": "A planned meeting between Russian Foreign Minister Sergey Lavrov and US Secretary of State Marco Rubio has been indefinitely postponed. This comes after a phone call where disagreements on settling the Ukraine conflict were evident. The summit between Preside…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/putin-trump-budapest-summit-may-be-stalled-as-lavrov-rubio-pre-meeting-postponed-indefinitely-says-us-broadcaster/articleshow/124716719.cms",
    "timestamp": "2025-10-21T07:45:45Z"
  },
  {
    "title": "Trump Considering Commuting Diddy's Sentence as Early as This Week: Report",
    "description": "President Donald Trump is considering commuting Sean “Diddy” Combs’ sentence as early as this week, according to a report. TMZ reported on Monday, October 20, that Trump is contemplating a commutation following Diddy’s 50-month sentence on two prostitution-re…",
    "link": "https://www.usmagazine.com/celebrity-news/news/trump-considering-commuting-diddys-sentence-this-week-report/#article",
    "timestamp": "2025-10-21T07:44:57Z"
  },
  {
    "title": "Rohini, Chitra, Purva Phalguni, Swati, Anuradha, and Revati; Six nakshatras that naturally attract attention and jealousy",
    "description": "Certain individuals possess an undeniable charm that draws admiration, yet can also invite envy, a phenomenon explored through Vedic astrology's nakshatras. Six constellations – Rohini, Chitra, Purva Phalguni, Swati, Anuradha, and Revati – are highlighted for…",
    "link": "https://timesofindia.indiatimes.com/astrology/planets-transits/rohini-chitra-purva-phalguni-swati-anuradha-and-revati-six-nakshatras-that-naturally-attract-attention-and-jealousy/articleshow/124716586.cms",
    "timestamp": "2025-10-21T07:39:43Z"
  },
  {
    "title": "Historic critical minerals framework signed by President Trump and Prime Minister Albanese",
    "description": "Prime Minister Anthony Albanese and President of the United States Donald J. Trump signed a landmark bilateral framework on critical minerals and rare earths at the White House in Washington DC. This will see an accelerated pipeline of priority projects deliv…",
    "link": "https://www.globalsecurity.org/wmd/library/news/australia/2025/australia-251021-australia-pm01.htm",
    "timestamp": "2025-10-21T07:38:53Z"
  },
  {
    "title": "Hungarian Opposition Leader Magyar Tells RFE/RL No Quick End To Russian Energy Imports",
    "description": "Hungarian opposition leader Peter Magyar says there will be no rapid shift away from importing Russian fossil fuels if he wins parliamentary elections expected to be held this spring.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/10/russia-251014-rferl01.htm",
    "timestamp": "2025-10-21T07:38:42Z"
  },
  {
    "title": "Gaza: $70 billion needed to rebuild shattered enclave, says UN",
    "description": "Around $70 billion will be needed to reconstruct Gaza and make it safe after two years of war, UN development experts said on Tuesday, while aid agencies reported that far too little aid is getting in to meet the needs of desperate Palestinians.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251014-unnews02.htm",
    "timestamp": "2025-10-21T07:38:42Z"
  },
  {
    "title": "Russia Sidelined In New Middle East After Trump's Israel-Gaza Deal",
    "description": "In late 2015, the Kremlin achieved a key victory when it launched a military intervention in Syria to rescue the fast-sinking regime of then-Syrian President Bashar al-Assad and enshrine its role as a leading player in the Middle East.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/10/russia-251014-rferl03.htm",
    "timestamp": "2025-10-21T07:38:24Z"
  },
  {
    "title": "Budrys: The only place for Putin in Europe is in front of the Hague Tribunal",
    "description": "Today, on 20 October in Luxembourg, the Minister of Foreign Affairs, Kęstutis Budrys, participates in the European Union's Foreign Affairs Council (FAC).",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/10/russia-251020-lithuania-mfa01.htm",
    "timestamp": "2025-10-21T07:38:16Z"
  },
  {
    "title": "Ted Cruz again proposes allowing Taiwan servicemen to wear uniforms in U.S.",
    "description": "U.S. Senator Ted Cruz on Monday reintroduced a bill that would allow Taiwanese diplomats and military personnel to display the Taiwan flag and wear uniforms while in the United States on official business.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251021-cna02.htm",
    "timestamp": "2025-10-21T07:38:16Z"
  },
  {
    "title": "Taiwan keeping close tabs on upcoming Trump-Xi meeting: Official",
    "description": "A senior Taiwanese foreign affairs official said Tuesday that Taipei is in close contact with Washington to make sure its interests are protected, ahead of a meeting between United States President Donald Trump and Chinese President Xi Jinping (習近平), which is…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251021-cna03.htm",
    "timestamp": "2025-10-21T07:38:16Z"
  },
  {
    "title": "Despite US push, China poised to dominate rare earths for years",
    "description": "Breaking China's stranglehold on supplies of the critical minerals is likely to take at least a decade, experts say.",
    "link": "https://www.aljazeera.com/economy/2025/10/21/despite-us-push-china-poised-to-dominate-rare-earths-for-years",
    "timestamp": "2025-10-21T07:37:59Z"
  },
  {
    "title": "Trump is going to Asia — what happens next is anyone's guess",
    "description": "President Donald Trump is expected to leave for Asia at the end of the week, betting that an around-the-world journey will help him untangle big issues that he can’t afford to get wrong. At stake is nothing less than the future of the global economy, which co…",
    "link": "https://japantoday.com/category/politics/trump-is-going-to-asia-%E2%80%94-what-happens-next-is-anyone%27s-guess",
    "timestamp": "2025-10-21T07:31:16Z"
  },
  {
    "title": "Stephen Colbert Tears Into Trump’s ‘Vile’ New Attack",
    "description": "The \"Late Show\" host called out the president's \"insane\" video attacking protesters.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-poop-video_n_68f727a4e4b09d351b453e14",
    "timestamp": "2025-10-21T07:30:31Z"
  },
  {
    "title": "WATCH: George Santos hits out at critics after prison release",
    "description": "The disgraced former congressman slammed critics who opposed his release from prison after President Donald Trump commuted his sentence for wire fraud and aggravated identity theft.",
    "link": "https://abcnews.go.com/Politics/video/george-santos-hits-critics-after-prison-release-126709305",
    "timestamp": "2025-10-21T07:29:40Z"
  },
  {
    "title": "Japan's parliament elects Sanae Takaichi as nation's first female prime minister",
    "description": "Japan's parliament elected Sanae Takaichi as the country's first female prime minister Tuesday, after her party struck a coalition deal expected to pull her governing bloc further to the right.",
    "link": "https://www.npr.org/2025/10/21/nx-s1-5581178/japan-sanae-takaichi-female-prime-minister",
    "timestamp": "2025-10-21T07:27:54Z"
  },
  {
    "title": "Europe backs Trump's Ukraine peace push",
    "description": "European leaders threw their support behind President Donald Trump's peace push for Ukraine, while reaffirming their red lines, as the Kremlin cast doubt on chances of an imminent summit between the US leader and Vladimir Putin.",
    "link": "https://www.rte.ie/news/ukraine/2025/1021/1539693-ukraine-russia-europe/",
    "timestamp": "2025-10-21T07:27:47Z"
  },
  {
    "title": "Trump tells Australian envoy ‘I don’t like you either’",
    "description": "During talks at the White House with Australia&#039;s prime minister, US President Donald Trump told Australian Ambassador Ke",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/10/21/trump-tells-australian-envoy-i-dont-like-you",
    "timestamp": "2025-10-21T07:24:38Z"
  },
  {
    "title": "Trump’s pharma strategy ‘holds Europe hostage’, Finnish MEP warns",
    "description": "As a member of the EU-US delegation, Finnish MEP Maria Guzenina (S&D) has closely followed how Donald Trump has shifted his negotiation tactics with the pharma industry. After initially trying to cut drug prices through executive orders, the US president has …",
    "link": "https://biztoc.com/x/9bcc958372cdf491",
    "timestamp": "2025-10-21T07:23:39Z"
  },
  {
    "title": "Demolition begins at White House for new ballroom",
    "description": "Demolition crews have begun tearing down part of the White House's storied East Wing to begin building President Donald Trump's ballroom, a project he had said would not interfere with the existing landmark.",
    "link": "https://www.rte.ie/news/newslens/2025/1021/1539689-white-house-washington-dc/",
    "timestamp": "2025-10-21T07:22:42Z"
  },
  {
    "title": "Europe opens mostly flat with Trump, Putin in focus",
    "description": "Major stock market indexes in Europe opened mostly flat on Tuesday amid hopes that the meeting between the presidents of the United States and Russia, Donald Trump and Vladimir Putin, respectively, co...",
    "link": "https://biztoc.com/x/741f1a616e4533dd",
    "timestamp": "2025-10-21T07:12:31Z"
  },
  {
    "title": "US appeals court enables Trump to deploy National Guard in Portland amid controversy",
    "description": "A divided Ninth Circuit panel allowed President Trump to deploy National Guard troops to Portland, overriding local objections. The ruling temporarily lifts lower court blocks, citing statutory authority for federalizing the Guard when federal laws cannot be …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-appeals-court-enables-trump-to-deploy-national-guard-in-portland-amid-controversy/articleshow/124716107.cms",
    "timestamp": "2025-10-21T07:11:33Z"
  },
  {
    "title": "Sanae Takaichi becomes Japan’s first woman prime minister after coalition deal",
    "description": "Her minority coalition faces a crucial visit from US President Donald Trump.",
    "link": "https://www.nzherald.co.nz/world/sanae-takaichi-becomes-japans-first-woman-prime-minister-after-coalition-deal/HIYFSPPRZJDENLCDEZCX5Q6UDY/",
    "timestamp": "2025-10-21T07:11:14Z"
  },
  {
    "title": "Japan’s parliament confirms hardliner Takaichi as country’s first female PM",
    "description": "Appointment clinched via a last-minute coalition deal, but government remains without a majority.",
    "link": "https://www.aljazeera.com/news/2025/10/21/japans-parliament-confirms-hardliner-takaichi-as-countrys-first-female-pm",
    "timestamp": "2025-10-21T07:08:48Z"
  },
  {
    "title": "Jon Stewart Dubs Donald Trump the ‘Imitation Crab of Kings’ on ‘The Daily Show’",
    "description": "\"Maybe Trump isn’t an all-powerful king, the kind who can do whatever he wants. But he’s undeniably king-adjacent, king-esque, moving for more,\" the host noted",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jon-stewart-donald-trump-no-kings-the-daily-show-1235450991/",
    "timestamp": "2025-10-21T07:05:55Z"
  },
  {
    "title": "Trump Presidential Library nonprofit dissolved just before Miami land transfer [The Miami Times]",
    "description": "A nonprofit connected to the future Donald Trump Presidential Library has gone inactive, leaving questions about where its funds have gone.",
    "link": "https://www.miamitimesonline.com/business/trump-presidential-library-nonprofit-dissolved-just-before-miami-land-transfer/article_dd2e653a-23e5-473d-91d2-6c53c35feacc.html",
    "timestamp": "2025-10-21T07:05:11Z"
  },
  {
    "title": "Incoming Oxford Union president loses confidence vote sparked by Charlie Kirk comments - but disputes result",
    "description": "The incoming president of the Oxford Union debating society has lost a confidence vote over remarks he made about the shooting of US conservative personality Charlie Kirk.",
    "link": "https://news.sky.com/story/incoming-oxford-union-president-george-abaraonye-loses-confidence-vote-sparked-by-charlie-kirk-comments-but-disputes-result-13453099",
    "timestamp": "2025-10-21T07:05:00Z"
  },
  {
    "title": "Trump Gutted the Institute of Education Sciences. Its Renewal Is in Doubt.",
    "description": "Trump Gutted the Institute of Education Sciences. Its Renewal Is in Doubt.\n\n \n\n\n \nRyan Quinn\n\nTue, 10/21/2025 - 03:00 AM\n\nThe Education Department recently requested ideas on how to “modernize” the data collection and education research funding agency, and it…",
    "link": "https://www.insidehighered.com/news/government/science-research-policy/2025/10/21/trump-gutted-ies-skepticism-its-renewal-abounds",
    "timestamp": "2025-10-21T07:00:00Z"
  },
  {
    "title": "Demolition begins on White House East Wing for Trump's £186m ballroom",
    "description": "Demolition on parts of the White House’s East Wing has begun in order to build Donald Trump’s new ballroom.",
    "link": "https://news.sky.com/story/demolition-work-begins-on-white-house-east-wing-for-trumps-186m-ballroom-13454284",
    "timestamp": "2025-10-21T06:59:00Z"
  },
  {
    "title": "Japan elects Takaichi as first female prime minister",
    "description": "Japan has elected its first female prime minister after Sanae Takaichi forged an 11th-hour coalition deal.",
    "link": "https://www.rte.ie/news/world/2025/1021/1539682-japan-prime-minister/",
    "timestamp": "2025-10-21T06:56:31Z"
  },
  {
    "title": "Trump vows to reach a 'fantastic deal' with China after future meeting with Xi",
    "description": "President Donald Trump has expressed confidence in reaching a \"fantastic deal\" with Chinese President Xi Jinping",
    "link": "https://biztoc.com/x/e184f01d1322a7af",
    "timestamp": "2025-10-21T06:50:08Z"
  },
  {
    "title": "Italy in uproar after Trump claims Meloni seeks ‘EU-defying’ trade deal",
    "description": "A White House staffer’s video hailing Meloni as defiant toward the EU has reignited tensions over Italy’s transatlantic loyalties",
    "link": "https://www.euractiv.com/news/italy-in-uproar-after-trump-claims-meloni-seeks-eu-defying-trade-deal/",
    "timestamp": "2025-10-21T06:49:09Z"
  },
  {
    "title": "The Syria withdrawal announcement shows that Donald Trump is now freelancing US foreign policy",
    "description": "Gani, Jasmine K. ORCID: 0000-0002-8218-1807 (2018) The Syria withdrawal announcement shows that Donald Trump is now freelancing US foreign policy. USApp-American Politics and Policy Blog (20 Dec 2018). Blog Entry.",
    "link": "https://eprints.lse.ac.uk/129881/",
    "timestamp": "2025-10-21T06:48:03Z"
  },
  {
    "title": "Trump's take on China should shift the tone of war talk in Australia",
    "description": "Trump's remarks downplaying the threat of confrontation over Taiwan are highly significant for Australia. They should also shift the tone of much of the strategic discussion among China hawks on the prospects of imminent war.",
    "link": "https://www.abc.net.au/news/2025-10-21/trump-take-china-taiwan-shift-tone-war-talk-australia/105916520",
    "timestamp": "2025-10-21T06:45:30Z"
  },
  {
    "title": "The 8 at 8: Tuesday",
    "description": "Waterford town missing garda unit after assaults, Trump warns Hamas against breaching Gaza ceasefire and emissions.",
    "link": "https://www.thejournal.ie/8-at-8-tuesday-124-6850023-Oct2025/",
    "timestamp": "2025-10-21T06:45:08Z"
  },
  {
    "title": "Virginia Giuffre Shines Light On Epstein Ordeal In New Memoir",
    "description": "A memoir by one of Jeffrey Epstein's main accusers whose claims led to the downfall of Britain's Prince Andrew was released Tuesday, promising to keep Epstein's ties to President Donald Trump in the spotlight.",
    "link": "https://www.ibtimes.com/virginia-giuffre-shines-light-epstein-ordeal-new-memoir-3787782",
    "timestamp": "2025-10-21T06:42:18Z"
  },
  {
    "title": "Trump demolishes part of the White House to build extravagant ballroom",
    "description": "Part of the White House has been demolished by Donald Trump as he wants to make space for his ballroom",
    "link": "https://www.ladbible.com/news/us-news/trump-demolishes-white-house-ballroom-077090-20251021",
    "timestamp": "2025-10-21T06:37:11Z"
  },
  {
    "title": "Trump's hopes for swift summit with Putin may be stalled: Report",
    "description": "President Trump's planned summit with President Putin in Budapest faces a potential delay. A key preparatory meeting between top foreign policy aides has been put on hold. This development raises questions about the timing of the leaders' discussions. Both si…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trumps-hopes-for-swift-summit-with-putin-may-be-stalled-report/articleshow/124715572.cms",
    "timestamp": "2025-10-21T06:34:11Z"
  },
  {
    "title": "Trump's hopes for swift summit with Putin may be stalled, CNN reports",
    "description": "US President Donald Trump's hopes for a quick summit in Budapest with Russian President Vladimir Putin may be stalled after a preparatory session between the leaders' top foreign-policy aides this week was put on hold, CNN said on Monday (Aug 20).Trump has re…",
    "link": "https://www.channelnewsasia.com/world/trumps-hopes-swift-summit-putin-may-be-stalled-cnn-reports-5414671",
    "timestamp": "2025-10-21T06:33:00Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Tuesday",
    "description": "Criticism of the chancellor's distasteful anti-immigration comments continue, biathletes swap skis for skates in Munich, German companies hire huge numbers of people to deal with bureaucracy and more news on Tuesday, October 21st.",
    "link": "https://www.thelocal.de/20251021/today-in-germany-a-roundup-of-the-latest-news-on-tuesday-95",
    "timestamp": "2025-10-21T06:32:56Z"
  },
  {
    "title": "'Are You Kidding Me?!?': CNN Panelist Shuts Down Journalist For Dismissing Trump's Racism",
    "description": "Keith Boykin hit Batya Ungar-Sargon with an \"unquestionable\" reality check in a fiery exchange.",
    "link": "https://www.huffpost.com/entry/cnn-keith-boykin-batya-ungar-sargon-trump-racism_n_68f70c05e4b02abf9d440716",
    "timestamp": "2025-10-21T06:28:18Z"
  },
  {
    "title": "Maddow: 'No Kings' protests send message to Trump from EVERY state in the nation",
    "description": "Not even a year into his new term and Donald Trump is already seeing people take to the streets by the millions to voice their ...",
    "link": "https://biztoc.com/x/89af8e43cebd53b8",
    "timestamp": "2025-10-21T06:26:10Z"
  },
  {
    "title": "Tuesday's papers: A seat at the table, a renter's market, and kids eat too",
    "description": "Will Finland have a seat at the table in the upcoming Trump-Putin talks?",
    "link": "https://yle.fi/a/74-20189470",
    "timestamp": "2025-10-21T06:20:40Z"
  },
  {
    "title": "Demolitions begin for Trump's ballroom in the latest White House renovation",
    "description": "Demolition work has begun for Donald Trump's new ballroom. It is one of many changes to the White House over the years.",
    "link": "https://www.abc.net.au/news/2025-10-21/trump-begins-demolition-to-prepare-for-white-house-ballroom/105915632",
    "timestamp": "2025-10-21T06:20:37Z"
  },
  {
    "title": "Jon Stewart Gives Trump A Royal Reaming With A Fact-Check For The Ages",
    "description": "The \"Daily Show\" host looked to the original blueprint for the \"No Kings\" movement to see what he could learn about the president.",
    "link": "https://www.huffpost.com/entry/jon-stewart-king-trump_n_68f704dae4b09d351b452893",
    "timestamp": "2025-10-21T06:18:19Z"
  },
  {
    "title": "Nordic American Tankers (NAT) Surges Amid Boost for Shipping Industry",
    "description": "The share price of Nordic American Tankers Limited (NYSE:NAT) surged by 8.07% between October 10 and October 17, 2025, putting it among the Energy Stocks...",
    "link": "https://finance.yahoo.com/news/nordic-american-tankers-nat-surges-061218101.html",
    "timestamp": "2025-10-21T06:12:18Z"
  },
  {
    "title": "Oklo Inc. (OKLO) Hit a Fresh High Following Newcleo Agreement",
    "description": "The share price of Oklo Inc. (NYSE:OKLO) surged by 11.03% between October 10 and October 17, 2025, putting it among the Energy Stocks that Gained the Most...",
    "link": "https://finance.yahoo.com/news/oklo-inc-oklo-hit-fresh-061211074.html",
    "timestamp": "2025-10-21T06:12:11Z"
  },
  {
    "title": "Trump's plan: Deja vu all over again",
    "description": "The pipe dreaming Gaza peace plan hits reality. And things go back to where they were. Opinion.",
    "link": "https://www.israelnationalnews.com/news/416567",
    "timestamp": "2025-10-21T06:09:00Z"
  },
  {
    "title": "China imports no US soybeans in September for first time in seven years",
    "description": "<![CDATA[ It comes as Chinese buyers continue to shun American cargoes amid ongoing trade tensions. ]]>",
    "link": "https://www.channelnewsasia.com/east-asia/china-soybean-imports-us-record-zero-5412581",
    "timestamp": "2025-10-21T06:08:44Z"
  },
  {
    "title": "Trump warns Hamas not to breach Gaza deal as Vance heads to Israel",
    "description": "U.S. President Donald Trump threatened to \"eradicate\" Hamas if it breached its ceasefire deal with Israel, as Vice President JD Vance travelled to the region Tuesday to bolster the fragile Gaza truce.",
    "link": "https://www.hurriyetdailynews.com/trump-warns-hamas-not-to-breach-gaza-deal-as-vance-heads-to-israel-214868",
    "timestamp": "2025-10-21T06:05:39Z"
  },
  {
    "title": "Inspired by Thatcher, Sanae Takaichi becomes Japan's first female premier",
    "description": "TOKYO: Hardline conservative Sanae Takaichi was voted in by parliament as Japan's first female prime minister on Tuesday (Oct 21), emulating her hero, Britain's late leader Margare",
    "link": "https://www.channelnewsasia.com/east-asia/sanae-takaichi-japan-first-female-prime-minister-ldp-5414606",
    "timestamp": "2025-10-21T06:02:41Z"
  },
  {
    "title": "Zelensky hails progress on Patriot missile deal after tense Trump meeting",
    "description": "Ukrainian President Volodymyr Zelensky confirmed that Ukraine is finalizing a contract with the U.S. for 25 Patriot missile systems, a critical boost for Ukraine’s war effort against Russia. Each system costs approximately $1 billion, and Ukraine is exploring…",
    "link": "https://www.naturalnews.com/2025-10-21-zelensky-hails-progress-on-patriot-missile-deal.html",
    "timestamp": "2025-10-21T06:00:00Z"
  },
  {
    "title": "Bulgaria offers air corridor for Putin to meet Trump in Budapest peace summit",
    "description": "President Trump and Vladimir Putin are planning a summit in Budapest to discuss the Ukraine conflict. Bulgaria has offered an air corridor to help Putin bypass an EU flight ban to attend. Hungary has assured it will facilitate Putin’s entry and exit for the t…",
    "link": "https://www.naturalnews.com/2025-10-21-bulgaria-offers-air-corridor-putin-trump-budapest.html",
    "timestamp": "2025-10-21T06:00:00Z"
  },
  {
    "title": "Israel receives body of slain soldier as 15 deceased hostages still held in Gaza",
    "description": "Hamas confirms the transfer of an Israeli hostage’s body. The ceasefire deal requires the return of all deceased hostages. Only 13 of 28 bodies have been returned, causing major delays. Israel accuses Hamas of being deliberately obstructive. Hamas cites the d…",
    "link": "https://www.naturalnews.com/2025-10-21-israel-receives-body-soldier-deceased-hostages-still-held-gaza.html",
    "timestamp": "2025-10-21T06:00:00Z"
  },
  {
    "title": "Chinaâ\u0080\u0099s economic slowdown deepens amid renewed U.S. trade war threats",
    "description": "China’s GDP growth slowed to 3.9 percent in Q3 2025, down from 4.9 percent in the same period last year. Lockdown policies suppress consumer spending, exacerbating economic stagnation. Trade tensions escalate as U.S. threatens 100 percent tariffs on Chinese i…",
    "link": "https://www.naturalnews.com/2025-10-21-chinas-economic-slowdown-amid-us-trade-war-threats.html",
    "timestamp": "2025-10-21T06:00:00Z"
  },
  {
    "title": "Trump REJECTS Zelensky’s request for Tomahawk missiles",
    "description": "President Trump denied Ukraine’s urgent request for long-range Tomahawk cruise missiles during a tense White House meeting, signaling a major shift in U.S. policy. Trump argued that providing such weapons would undermine peace negotiations with Russia. Trump …",
    "link": "https://www.naturalnews.com/2025-10-21-trump-rejects-zelensky-request-for-tomahawk-missiles.html",
    "timestamp": "2025-10-21T06:00:00Z"
  },
  {
    "title": "'No Kings' protest driven by profoundly American impulse",
    "description": "What came through from the demonstrators we spoke to was that they were animated not by a hatred of America, but by a profoundly American impulse to stand up for their constitution, and the liberties it promises, writes Sean Whelan.",
    "link": "https://www.rte.ie/news/us/2025/1021/1539670-no-kings-protests/",
    "timestamp": "2025-10-21T05:59:00Z"
  },
  {
    "title": "Asian markets extend gains, Japan's Nikkei nears 50,000-level",
    "description": "Asian markets have advanced, with Japan's benchmark approaching the symbolically important 50,000 level for the first time as conservative lawmaker Sanae Takaichi was poised to become the country's first female prime minister",
    "link": "https://abcnews.go.com/Business/wireStory/asian-markets-extend-gains-japans-nikkei-nears-50000-126708345",
    "timestamp": "2025-10-21T05:57:47Z"
  },
  {
    "title": "Trump threatens to 'eradicate' Hamas if it breaches fragile ceasefire with Israel",
    "description": "US Vice President JD Vance is travelling to Israel today in an attempt to bolster the agreement.",
    "link": "https://www.thejournal.ie/trump-hamas-breaches-gaza-ceasefire-jd-vance-israel-6850014-Oct2025/",
    "timestamp": "2025-10-21T05:55:11Z"
  },
  {
    "title": "Keith Duggan: Staying loyal to Donald Trump tests Republican speaker’s survival skills",
    "description": "Mike Johnson finds himself with plenty of explaining to do amid US government shutdown, the president’s social media outbursts and growing pressure to release the Jeffrey Epstein files",
    "link": "https://www.irishtimes.com/world/us/2025/10/21/staying-loyal-to-donald-trump-tests-republican-speakers-survival-skills/",
    "timestamp": "2025-10-21T05:55:00Z"
  },
  {
    "title": "U.S. Chamber Slams Trump's $100,000 H-1B Fee, Migration Policy",
    "description": "The U.S. Chamber of Commerce is suing the administration to block President Donald Trump's emerging curbs on the H-1B outsourcing program.\nThe post U.S. Chamber Slams Trump’s $100,000 H-1B Fee, Migration Policy appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/10/20/u-s-chamber-slams-trumps-migration-reforms-100000-h-1b-fee/",
    "timestamp": "2025-10-21T05:54:29Z"
  },
  {
    "title": "What to expect for Japan's economy under Sanae Takaichi, its 1st female prime minister",
    "description": "Share prices have soared recently in Tokyo on hopes that conservative Japanese lawmaker Sanae Takaichi, who was chosen Tuesday to be Japan’s first female...",
    "link": "https://finance.yahoo.com/news/expect-japans-economy-under-sanae-055405453.html",
    "timestamp": "2025-10-21T05:54:05Z"
  },
  {
    "title": "Goldman Sachs flags risk of disruption in supply of rare earths, key minerals",
    "description": "Goldman Sachs warns of supply chain risks for rare earths, highlighting China's dominance and potential export curbs impacting global industries.",
    "link": "https://www.thehindubusinessline.com/news/goldman-sachs-flags-risk-of-disruption-in-supply-of-rare-earths-key-minerals/article70185341.ece",
    "timestamp": "2025-10-21T05:51:56Z"
  },
  {
    "title": "Senate Republicans head to White House amid stalemate on shutdown",
    "description": "As the government shutdown enters its fourth week, Senate Republicans are headed to the White House — not for urgent talks on how to end it, but for a display of unity with President Donald Trump as they refuse to negotiate on any Democratic demands",
    "link": "https://abcnews.go.com/Politics/wireStory/senate-republicans-head-white-house-amid-stalemate-shutdown-126707678",
    "timestamp": "2025-10-21T05:49:43Z"
  },
  {
    "title": "Senate Republicans head to White House amid stalemate on shutdown",
    "description": "As the government shutdown enters its fourth week, Senate Republicans are headed to the White House — not for urgent talks on how to end it, but for a display of unity with President Donald Trump as they refuse to negotiate on any Democratic demands",
    "link": "https://abcnews.go.com/Health/wireStory/senate-republicans-head-white-house-amid-stalemate-shutdown-126707677",
    "timestamp": "2025-10-21T05:49:42Z"
  },
  {
    "title": "Folk legend Kenny Loggins shreds Trump for using his song in bizarre AI poop bomb video",
    "description": "Loggins’ song ‘Danger Zone’ was recorded for the soundtrack of ‘Top Gun’",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/trump-danger-zone-kenny-loggins-truth-social-ai-poop-bomb-video-b2849005.html",
    "timestamp": "2025-10-21T05:49:24Z"
  },
  {
    "title": "Europe’s dependence moment",
    "description": "In today’s edition: Europe’s dependence on the US grows as Trump shapes foreign policy from afar, Bulgaria opens its skies for Putin ahead of the Budapest summit, and the Commission begins quietly dismantling the Green Deal under political pressure",
    "link": "https://www.euractiv.com/news/rapporteur-europes-dependence-moment/",
    "timestamp": "2025-10-21T05:47:37Z"
  },
  {
    "title": "Conscience calls: “For over twelve years, I worked inside the Republican ecosystem…”",
    "description": "“…. over the last few months, the compartmentalization and coping stopped working to silence my conscience” \n\nThe more do this the more we have a country worth fighting for. It is also a very honest description of why he stayed so long.",
    "link": "https://www.thebulwark.com/p/my-last-day-as-an-accomplice-of-the-republican-party-miles-bruner",
    "timestamp": "2025-10-21T05:47:02Z"
  }
]