[
  {
    "title": "Americans remain concerned about press freedoms, but partisan views have flipped since 2024",
    "description": "A majority of Democrats (60%) are highly concerned about press freedoms – about double the share of Republicans (28%).\nThe post Americans remain concerned about press freedoms, but partisan views have flipped since 2024 appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/short-reads/2025/04/24/americans-remain-concerned-about-press-freedoms-but-partisan-views-have-flipped-since-2024/",
    "timestamp": "2025-04-24T17:57:47Z"
  },
  {
    "title": "Free Expression Seen as Important Globally, but Not Everyone Thinks Their Country Has Press, Speech and Internet Freedoms",
    "description": "Across 35 countries, there are some disconnects between how people rate the importance of free expression and how free they feel they actually are.\nThe post Free Expression Seen as Important Globally, but Not Everyone Thinks Their Country Has Press, Speech an…",
    "link": "http://www.pewresearch.org/global/2025/04/24/free-expression-seen-as-important-globally-but-not-everyone-thinks-their-country-has-press-speech-and-internet-freedoms/",
    "timestamp": "2025-04-24T17:56:44Z"
  },
  {
    "title": "China Cheers on Trump's Iran Talks, Supports Tehran Nuclear Program",
    "description": "Chinese Foreign Minister Wang Yi told Iranian Foreign Minister Abbas Araghchi on Wednesday, during the latter's visit to Beijing, that the Chinese Communist Party supported ongoing talks between the Iranian terror state and the administration of President Don…",
    "link": "https://www.breitbart.com/asia/2025/04/24/china-cheers-on-trumps-iran-talks-supports-tehran-nuclear-program/",
    "timestamp": "2025-04-24T17:55:05Z"
  },
  {
    "title": "Trump says giving 'baby bonus' payments to mothers 'sounds like a good idea'",
    "description": "President Donald Trump said giving baby bonuses to U.S. mothers after delivering a child \"sounds like a good idea.\"",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/24/donald-trump-baby-bonus-payments-mothers/83248817007/",
    "timestamp": "2025-04-24T17:54:42Z"
  },
  {
    "title": "‘Overwhelming demand’ for Nintendo Switch 2 preorders creates frustrations for hopeful buyers",
    "description": "U.S. preorders for the Nintendo Switch 2 kicked off shortly after the clock struck midnight Thursday. But chaos soon ensued amid high demand.",
    "link": "https://www.pbs.org/newshour/nation/overwhelming-demand-for-nintendo-switch-2-preorders-creates-frustrations-for-hopeful-buyers",
    "timestamp": "2025-04-24T17:54:05Z"
  },
  {
    "title": "Pakistan warns Kashmir row could lead to 'all-out war' with India",
    "description": "Pakistan's defence minister has told Sky News that a row over a mass shooting in Kashmir could lead to an \"all-out war\" between his country and India.",
    "link": "https://news.sky.com/story/pakistan-warns-kashmir-row-could-lead-to-all-out-war-with-india-13355033",
    "timestamp": "2025-04-24T17:53:00Z"
  },
  {
    "title": "Trump fans furious he called out Putin for striking Kyiv: ‘Zelensky caused this’",
    "description": "Right-wingers on Truth Social are breaking with President Donald Trump after he criticized Russian strikes on Kyiv for impeding peace talks.\n\n\n\"I am not happy with the Russian strikes on KYIV,\" Trump posted Thursday morning. \"Not necessary, and very bad timin…",
    "link": "https://www.dailydot.com/debug/donald-trump-putin-truth-social-kyiv/",
    "timestamp": "2025-04-24T17:51:38Z"
  },
  {
    "title": "Letitia James unleashes fiery response to Trump’s ‘revenge tour’ in wake of mortgage fraud accusations",
    "description": "The federal criminal referral against Letitia James is a meritless, hypocritical salvo in President Trump’s “revenge tour” against his nemesis, the state attorney general’s lawyer charged Thursday.…",
    "link": "https://nypost.com/2025/04/24/us-news/letitia-james-unleashes-fiery-response-to-trumps-revenge-tour-in-wake-of-mortgage-fraud-accusations/",
    "timestamp": "2025-04-24T17:51:34Z"
  },
  {
    "title": "Why ZELENSKY can't and won't give up Crimea",
    "description": "Vladimir Putin initially denied having anything to do with Russia's capture of Crimea in February 2014, when mysterious masked commandos in unidentified green uniforms seized the local parliament and fanned out across the peninsula. Those \"little green men\" m…",
    "link": "https://freerepublic.com/focus/f-chat/4313014/posts",
    "timestamp": "2025-04-24T17:50:51Z"
  },
  {
    "title": "Donald Trump aspires to a third term, but do Americans wish the same? Approval ratings reveal a surprising picture",
    "description": "Despite Donald Trump’s musings about running for a third term, most Americans oppose the idea, with recent polls showing 75% against it, including 53% of Republicans. Trump's approval rating has dropped to 40%, further dampening enthusiasm. While some, like R…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/donald-trump-aspires-to-a-third-term-but-do-americans-wish-the-same-approval-ratings-reveal-a-surprising-picture/articleshow/120593502.cms",
    "timestamp": "2025-04-24T17:50:42Z"
  },
  {
    "title": "JD Vance's family joins India trip: What to know about his wife, kids",
    "description": "JD Vance and his wife Usha Vance are the parents of three kids.",
    "link": "https://abcnews.go.com/GMA/Family/jd-vance-family/story?id=117803845",
    "timestamp": "2025-04-24T17:50:30Z"
  },
  {
    "title": "The Turn Of The Screw. JPMorgan's Jamie Dimon Warns Trump Trade War Could See The U.S. Lose Credibility",
    "description": "In This Article:\nJPMorgan Chase (NYSE:JPM) CEO Jamie Dimon has fired a warning shot about President Donald Trump‘s trade war, which has put the stock market on a wild ride, unnerving investors. The Wall Street titan warned of a loss of U.S. credibility on the…",
    "link": "https://biztoc.com/x/b646faa5245066af",
    "timestamp": "2025-04-24T17:50:14Z"
  },
  {
    "title": "Trump to sit for interview with 'SignalGate' journalist Jeffrey Goldberg (Irie Sentner/Politico)",
    "description": "Irie Sentner / Politico:\nTrump to sit for interview with ‘SignalGate’ journalist Jeffrey Goldberg  —  “The way I look at it, what can be so bad,” the president said of the interview.  —  President Donald Trump is meeting Thursday with the journalist responsib…",
    "link": "https://www.memeorandum.com/250424/p84",
    "timestamp": "2025-04-24T17:50:01Z"
  },
  {
    "title": "Trump Store Selling ‘Trump 2028’ Hats—Weeks After Trump Says He’s ‘Not Joking’ About Potential Third Term",
    "description": "The “Made in America Trump 2028” hats retail for $50 on the Trump Store website.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/04/24/trump-store-selling-trump-2028-hats-weeks-after-trump-says-hes-not-joking-about-potential-third-term/",
    "timestamp": "2025-04-24T17:50:01Z"
  },
  {
    "title": "Trump Slams Door on Higher Tax Rate for the Rich (Ed Kilgore/New York Magazine)",
    "description": "Ed Kilgore / New York Magazine:\nTrump Slams Door on Higher Tax Rate for the Rich  —  Republicans have both an arithmetic and a messaging problem as they try to enact Donald Trump's second-term agenda via a giant budget-reconciliation bill.  The former involve…",
    "link": "https://www.memeorandum.com/250424/p83",
    "timestamp": "2025-04-24T17:50:01Z"
  },
  {
    "title": "‘Never Again Means Now’: President Trump Honors Holocaust Victims, Calls Out ‘Leftist, Anti-American Colleges’ for Fueling Hate",
    "description": "President Donald J. Trump issued a solemn proclamation on Wednesday marking the Days of Remembrance of Victims of the Holocaust, honoring the memory of six million Jews murdered, while sharply rebuking “leftist, anti-American colleges and universities” for fu…",
    "link": "https://www.breitbart.com/politics/2025/04/24/never-again-means-now-president-trump-honors-holocaust-victims-calls-out-leftist-anti-american-colleges-for-fueling-hate/",
    "timestamp": "2025-04-24T17:49:43Z"
  },
  {
    "title": "SoFi Stock Is Up 11% This Week: What's Going On?",
    "description": "Shares of SoFi Technologies Inc (NASDAQ:SOFI) have surged 11% since Monday’s open to $12.20. The broader market is higher for the week after President Donald Trump said he has no intention of firing Fed Chair Jerome Powell. Trump this week also indicated the …",
    "link": "https://biztoc.com/x/38a4dbd5bf0a9c1b",
    "timestamp": "2025-04-24T17:49:30Z"
  },
  {
    "title": "How Trump's deportations could hurt Social Security",
    "description": "President Donald Trump's cuts to immigration could make Social Security face a shortfall sooner than expected.",
    "link": "https://www.msnbc.com/top-stories/latest/immigration-social-security-trump-newsletter-rcna202760",
    "timestamp": "2025-04-24T17:46:32Z"
  },
  {
    "title": "Trump agenda drives record outflows from global sustainable funds, Morningstar says",
    "description": "(Reuters) -Investors withdrew a record $8.6 billion from global sustainable funds in the first quarter, researcher Morningstar said on Thursday, attributing ...",
    "link": "https://finance.yahoo.com/news/trump-agenda-drives-record-outflows-174627113.html",
    "timestamp": "2025-04-24T17:46:27Z"
  },
  {
    "title": "'I Like That Question': Trump Approves After Reporter Asks if He Deserves a Nobel Peace Prize (Kipp Jones/Mediaite)",
    "description": "Kipp Jones / Mediaite:\n‘I Like That Question’: Trump Approves After Reporter Asks if He Deserves a Nobel Peace Prize  —  President Donald Trump expressed approval Thursday after a reporter asked Norwegian Prime Minister Jonas Gahr Støre whether Trump should b…",
    "link": "https://www.memeorandum.com/250424/p82",
    "timestamp": "2025-04-24T17:45:01Z"
  },
  {
    "title": "Judge blocks parts of Trump’s overhaul of US elections, including proof-of-citizenship requirement",
    "description": "Trump called for sweeping changes to U.S. elections in an executive order signed in March.",
    "link": "https://www.bostonherald.com/2025/04/24/trump-elections-overhaul/",
    "timestamp": "2025-04-24T17:45:00Z"
  },
  {
    "title": "Judge blocks parts of Trump’s overhaul of US elections, including proof-of-citizenship requirement",
    "description": "Trump called for sweeping changes to U.S. elections in an executive order signed in March.",
    "link": "https://www.denverpost.com/2025/04/24/trump-elections-overhaul/",
    "timestamp": "2025-04-24T17:45:00Z"
  },
  {
    "title": "Unemployment filings inch up as labor market remains strong despite downturn fears",
    "description": "U.S. applications for jobless benefits rose modestly last week as business continue to retain workers despite fears of a possible economic downturn.",
    "link": "https://www.pbs.org/newshour/nation/unemployment-filings-inch-up-as-labor-market-remains-strong-despite-downturn-fears",
    "timestamp": "2025-04-24T17:44:53Z"
  },
  {
    "title": "Pope Francis’ Funeral: King Charles III to miss ceremony — Why Prince William will attend alone",
    "description": "King Charles III will not be seen in attendance during Pope Francis' funeral. In place of the King, Prince William will represent the British royal family at the ceremony.",
    "link": "https://economictimes.indiatimes.com/news/international/us/pope-francis-funeral-king-charles-iii-to-miss-ceremony-why-prince-william-will-attend-alone/articleshow/120593308.cms",
    "timestamp": "2025-04-24T17:44:49Z"
  },
  {
    "title": "‘Outright Evidence of Corruption’: Senate Dem Calls for Investigation Into Trump’s ‘Private Dinner’ With Meme Coin Holders",
    "description": "\"The only difference between the corruption that we've seen in any other past administration, this one is President Trump seems to be self-dealing right out in the open\"\nThe post ‘Outright Evidence of Corruption’: Senate Dem Calls for Investigation Into Trump…",
    "link": "https://www.mediaite.com/tv/outright-evidence-of-corruption-senate-dem-calls-for-investigation-into-trumps-private-dinner-with-meme-coin-holders/",
    "timestamp": "2025-04-24T17:43:49Z"
  },
  {
    "title": "“Infected an Entire Generation”: AG Bondi Targets Trans-Affirming Health Care in Leaked Memo",
    "description": "“Infected an Entire Generation”: AG Bondi Targets Trans-Affirming Health Care in Leaked Memoerininthemorning.com",
    "link": "https://www.erininthemorning.com/p/infected-an-entire-generation-ag",
    "timestamp": "2025-04-24T17:42:22Z"
  },
  {
    "title": "Iran and France signal readiness for nuclear talks amid US negotiations",
    "description": "Third round of talks between Tehran and Washington due to be held on Saturday in Oman",
    "link": "https://www.irishtimes.com/world/middle-east/2025/04/24/iran-and-france-signal-readiness-for-nuclear-talks-amid-us-negotiations/",
    "timestamp": "2025-04-24T17:41:56Z"
  },
  {
    "title": "Trump-Appointed Judge: Administration Must Return Another Man Deported to El Salvador",
    "description": "A federal judge appointed by U.S. President Donald Trump during his first term \ndirected his second administration on Wednesday to facilitate the return of a 20-year-old Venezuelan deported to El Salvador in breach of a settlement agreement—as the government …",
    "link": "https://www.commondreams.org/news/deportations-to-el-salvador",
    "timestamp": "2025-04-24T17:41:26Z"
  },
  {
    "title": "Yale New Haven Health (YNHHS) data breach impacted 5.5 million patients",
    "description": "Yale New Haven Health (YNHHS) announced that threat actors stole the personal data of 5.5 million patients in a cyberattack. Yale New Haven Health (YNHHS) disclosed a data breach that exposed personal information of 5.5 million patients following a cyberattac…",
    "link": "https://securityaffairs.com/176937/data-breach/yale-new-haven-health-ynhhs-data-breach-impacted-5-5-million-patients.html",
    "timestamp": "2025-04-24T17:41:19Z"
  },
  {
    "title": "Ireland to give 141 million euros to World Bank fund for poorest countries",
    "description": "WASHINGTON (Reuters) -Ireland will contribute about 141.4 million euros ($161 million)to the World Bank's latest replenishment of its fund for the poorest countries, a 33.5% increase over the country's previous contribution, Finance Minister Paschal Donohoe s…",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/ireland-to-give-141-million-euros-to-world-bank-fund-for-poorest-countries",
    "timestamp": "2025-04-24T17:41:00Z"
  },
  {
    "title": "China denies any suggestion it is currently in talks with the US over tariffs",
    "description": "China on Thursday denied any suggestion that it was in active negotiations with the administration of U.S. President Donald Trump over tariffs, saying that any notion of progress in the matter was as groundless as “trying to catch the wind.” China’s comments …",
    "link": "https://freerepublic.com/focus/f-news/4313013/posts",
    "timestamp": "2025-04-24T17:40:53Z"
  },
  {
    "title": "Stephanie Ruhle Doesn't Know There's Fact-Checking on X",
    "description": "One of my biggest pet peeves is when media figures make hyperbolic claims about the spread of misinformation online and suggest that journalists, misinfo",
    "link": "https://reason.com/2025/04/24/stephanie-ruhle-doesnt-know-theres-fact-checking-on-x/",
    "timestamp": "2025-04-24T17:40:01Z"
  },
  {
    "title": "Trump and Speaker Mike Johnson shoot down millionaire tax hike (Sahil Kapur/NBC News)",
    "description": "Sahil Kapur / NBC News:\nTrump and Speaker Mike Johnson shoot down millionaire tax hike  —  Some Republicans had debated breaking from party orthodoxy by allowing taxes to go up on wealthy Americans to help pay for a massive bill for Trump's agenda.  —  WASHIN…",
    "link": "https://www.memeorandum.com/250424/p81",
    "timestamp": "2025-04-24T17:40:00Z"
  },
  {
    "title": "Trump Attacks Ukraine President Zelensky As A Media Hog",
    "description": "Donald Trump's AI press secretary told the media that he's frustrated by the Ukraine president because he is litigating the peace deal in the press.\nThat something Trump does every day. \nthe US putting forth a Russian stamp of approval surrender deal is not w…",
    "link": "https://crooksandliars.com/2025/04/trump-attacks-ukraine-president-zelensky",
    "timestamp": "2025-04-24T17:39:32Z"
  },
  {
    "title": "Trump to Be In Third Tier Seats at Pope’s Funeral",
    "description": "\"Donald Trump may be the most famous person on the planet and leader of the free world, but he could be deeply disappointed when he sees the seating plan for the funeral of Pope Francis,\"",
    "link": "https://politicalwire.com/2025/04/24/trump-to-be-in-third-tier-seats-at-popes-funeral/",
    "timestamp": "2025-04-24T17:39:09Z"
  },
  {
    "title": "Zelensky urges stronger US stance on Russia",
    "description": "Ukrainian President Volodymyr Zelensky commented Thursday on US President Donald Trump's recent remarks during an interview with conservative commentator Ben Shapiro.\"I understand what Trump is doing,...",
    "link": "https://biztoc.com/x/9d9ee1ceb0cff1ce",
    "timestamp": "2025-04-24T17:38:54Z"
  },
  {
    "title": "Americans expect higher prices from Trump’s tariffs, new poll shows",
    "description": "An Associated Press-NORC poll suggests Americans’ trust in President Donald Trump to bolster the U.S. economy appears to be faltering.",
    "link": "https://biztoc.com/x/60c54eb7d0c2545b",
    "timestamp": "2025-04-24T17:38:22Z"
  },
  {
    "title": "Americans Support Pulling Funds from Harvard, Taxing Endowments According to Poll",
    "description": "Americans are broadly supportive of the Trump administration’s battle with Harvard University, and majorities even support the federal government taxing the endowments of wealthy universities. This... Read More\nThe post Americans Support Pulling Funds from Ha…",
    "link": "https://www.dailysignal.com/2025/04/24/americans-support-pulling-funds-from-harvard-taxing-endowments-according-poll/",
    "timestamp": "2025-04-24T17:38:22Z"
  },
  {
    "title": "'Cruel irony': Skeptical analyst trounces White House claim that Trump 'follows science'",
    "description": "CNN's chief climate correspondent Bill Weir scoffed Thursday at the White House assertion that President Donald Trump 'follows science.'\n\nThe Trump administration put out a statement, titled, \"On Earth Day, We Finally Have a President Who Follows Science,\" th…",
    "link": "https://www.rawstory.com/trump-climate-change-2671839900/",
    "timestamp": "2025-04-24T17:38:10Z"
  },
  {
    "title": "Trump's 2-Word Plea To Putin Is Making People Face-Palm On Social Media",
    "description": "The world is mocking the president's request.",
    "link": "https://www.huffpost.com/entry/donald-trump-vladimir-putin-kyiv-attack-plea_n_680a60e3e4b0b3e1a66f1081",
    "timestamp": "2025-04-24T17:37:37Z"
  },
  {
    "title": "Iran signals willingness to hold nuclear talks with Europeans",
    "description": "France has indicated that European powers are also ready for dialogue if Tehran shows it is seriously engaged",
    "link": "https://www.aljazeera.com/news/2025/4/24/iran-signals-willingness-to-hold-nuclear-talks-with-europeans",
    "timestamp": "2025-04-24T17:36:48Z"
  },
  {
    "title": "What time is Pope Francis' funeral? Vatican reveals full schedule of Saturday ceremony",
    "description": "Public visitation will come to an end Friday, April 25 before a funeral for Pope Francis takes place Saturday in St. Peter's Square.",
    "link": "https://www.usatoday.com/story/news/world/2025/04/24/pope-francis-funeral-full-schedule/83245299007/",
    "timestamp": "2025-04-24T17:36:39Z"
  },
  {
    "title": "Watch: 'The Office' Star Rainn Wilson Calls Out 'Left-Leaning News' that Gave Biden a Pass Now Going After Trump",
    "description": "\"The Office\" star Rainn Wilson is bucking the liberal narrative on the clash between President Donald Trump and the media.\nThe post Watch: ‘The Office’ Star Rainn Wilson Calls Out ‘Left-Leaning News’ that Gave Biden a Pass Now Going After Trump appeared first…",
    "link": "https://www.breitbart.com/entertainment/2025/04/24/rainn-wilson-calls-out-left-leaning-news-that-gave-biden-a-pass-now-going-after-trump/",
    "timestamp": "2025-04-24T17:35:44Z"
  },
  {
    "title": "Trump Announces Interview With Reporter Who Uncovered Chat Leak Scandal",
    "description": "President Donald Trump announced Thursday he will sit for an interview with the reporter who uncovered a major security lapse after being inadvertently added to a group chat in which top US officials shared secret military strike plans.",
    "link": "https://www.ndtv.com/world-news/trump-announces-interview-with-reporter-jeffrey-goldberg-who-uncovered-signal-chat-leak-scandal-yemen-chat-leak-8248508",
    "timestamp": "2025-04-24T17:35:35Z"
  },
  {
    "title": "Trump Attacks Jeff Mason at White House Photo Op for ‘Wrong’ Reporting — Which Was Completely Accurate",
    "description": "Trump attacked Reuters White House correspondent Jeff Mason over reporting he claimed was \"wrong\" — but which was in fact completely accurate.\nThe post Trump Attacks Jeff Mason at White House Photo Op for ‘Wrong’ Reporting — Which Was Completely Accurate firs…",
    "link": "https://www.mediaite.com/news/trump-attacks-jeff-mason-at-white-house-photo-op-for-wrong-reporting-which-was-completely-accurate/",
    "timestamp": "2025-04-24T17:34:43Z"
  },
  {
    "title": "Judge Blocks Trump Push To End DEI Programs In Public Schools",
    "description": "A lawsuit accused the Republican administration of violating teachers’ due process and First Amendment rights.",
    "link": "https://www.huffpost.com/entry/trump-dei-ruling_n_680a750be4b0d1cc4a5a95b5",
    "timestamp": "2025-04-24T17:34:02Z"
  },
  {
    "title": "Nelly’s ‘Country Grammar’ Stagecoach Victory Lap And The Rise Of Hick Hop",
    "description": "Getty Image/Merle Cooper\r\n\nNelly’s “Country Grammar (Hot Shit),” the lead single from his 2000 album Country Grammar, is comfortably at home in 2025. He mentions AI, Donald Trump, and lighting up and taking a puff of chronic, all of which arguably have a stro…",
    "link": "https://uproxx.com/country/nellys-country-grammar-stagecoach-victory-lap-and-the-rise-of-hick-hop/",
    "timestamp": "2025-04-24T17:33:57Z"
  },
  {
    "title": "When Serving the Country Means Erasing My Trans Child",
    "description": "A military mom on the heartbreak of watching her country strip away the rights, safety and dignity of her trans child:\n\"In recent months, lawmakers voted to strip military families of the right to access life-saving, evidence-based medical care for their tran…",
    "link": "https://msmagazine.com/2025/04/24/trump-military-parent-trans-child-healthcare-testosterone-gender-affirming-mental-health/",
    "timestamp": "2025-04-24T17:31:55Z"
  },
  {
    "title": "Trump Declares Putin and Zelensky ‘Both Want Peace’ Hours After Kyiv Bombing Left 12 Dead",
    "description": "President Donald Trump is insisting that both Russia and Ukraine \"want peace,\" despite a deadly bombing in Ukraine's capital hours earlier.\nThe post Trump Declares Putin and Zelensky ‘Both Want Peace’ Hours After Kyiv Bombing Left 12 Dead first appeared on Me…",
    "link": "https://www.mediaite.com/news/trump-declares-putin-and-zelensky-both-want-peace-hours-after-kyiv-bombing-left-12-dead/",
    "timestamp": "2025-04-24T17:31:52Z"
  },
  {
    "title": "Mr. President Trump, if you want to shoot — shoot, don’t talk",
    "description": "First and foremost, Mr. President, continue your efforts to bring home all 59 of our hostages, alive and all at once. This won’t happen without your pressure.",
    "link": "https://www.jpost.com/opinion/article-851420",
    "timestamp": "2025-04-24T17:31:51Z"
  },
  {
    "title": "New DHS portal to help migrants register biometrics to comply with Trump order",
    "description": "A new DHS tool will help millions of unlawful migrants living in the U.S. comply with a Trump order to register their biometric data and carry documentation at all times.",
    "link": "https://www.foxnews.com/politics/new-dhs-portal-help-migrants-register-biometrics-comply-trump-order",
    "timestamp": "2025-04-24T17:31:28Z"
  },
  {
    "title": "Democrats Launch Inquiry Into Dismantling of Administration for Community Living",
    "description": "On Thursday, House Reps. Bobby Scott (D-Va.) and Suzanne Bonamici (D-Ore.) introduced a formal inquiry demanding more information from Health and Human Services Secretary Robert F. Kennedy Jr. on the decision to dismantle the Administration for Community Livi…",
    "link": "https://www.motherjones.com/politics/2025/04/rfk-jr-bill-community-living/",
    "timestamp": "2025-04-24T17:31:15Z"
  },
  {
    "title": "The Real Winners of the Trump Memecoin Feeding Frenzy",
    "description": "Donald Trump will attend a dinner with the largest holders of his own-brand crypto coin, sending its price through the roof. But the real profits have already been made just out of view.",
    "link": "https://www.wired.com/story/trump-memecoin-dinner-winners/",
    "timestamp": "2025-04-24T17:30:11Z"
  },
  {
    "title": "WATCH: NYC Protesters Swarm 'Sick Freak' Andrew Cuomo During Mayoral Candidate Forum",
    "description": "Protesters stormed the stage on Wednesday during an event with former Gov. Andrew Cuomo (D-NY), who is running for New York City mayor.\nThe post WATCH: NYC Protesters Swarm ‘Sick Freak’ Andrew Cuomo During Mayoral Candidate Forum appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/24/watch-nyc-protesters-swarm-sick-freak-andrew-cuomo-mayoral-candidate-forum/",
    "timestamp": "2025-04-24T17:30:05Z"
  },
  {
    "title": "Time Is A Flat Circle",
    "description": "We know that some CEOs put the fear of God into Trump about empty shelves, but I suspect he doesn't understand that you can't just turn the boats back on and fill those shelves instantly with a \"BEAUTIFUL DEAL WITH CHINA\" tweet.\nI know nothing, but I'd guess …",
    "link": "https://www.eschatonblog.com/2025/04/time-is-flat-circle.html",
    "timestamp": "2025-04-24T17:30:00Z"
  },
  {
    "title": "GM to boost transmission production at Ohio plant",
    "description": "The move is aimed at supporting the production of light-duty trucks assembled in Fort Wayne, Indiana, and other locations.",
    "link": "https://www.just-auto.com/news/gm-boost-transmission-ohio/",
    "timestamp": "2025-04-24T17:29:45Z"
  },
  {
    "title": "DOJ Attorneys Brutally Mocked for Accidentally Filing Letter Admitting Weaknesses of Case in Public Docket",
    "description": "Court watchers quickly pounced Wednesday evening after realizing what the DOJ had filed, mocking both the document mixup and the admissions that the federal government's case was fundamentally flawed.\nThe post DOJ Attorneys Brutally Mocked for Accidentally Fi…",
    "link": "https://www.mediaite.com/news/doj-attorneys-brutally-mocked-for-accidentally-filing-letter-admitting-weaknesses-of-case-in-public-docket/",
    "timestamp": "2025-04-24T17:29:21Z"
  },
  {
    "title": "Trans inmate who killed baby blames Trump admin for alleged assaults in prison: Lawsuit",
    "description": "Transgender inmate who killed baby and is seeking a sex reassignment surgery has now sued President Donald Trump for alleged assaults while in prison.",
    "link": "https://www.foxnews.com/politics/trans-inmate-who-killed-baby-blames-trump-admin-alleged-assaults-prison-lawsuit",
    "timestamp": "2025-04-24T17:28:08Z"
  },
  {
    "title": "Americans expect higher prices from Trump’s tariffs, new poll shows",
    "description": "An Associated Press-NORC poll suggests Americans’ trust in President Donald Trump to bolster the U.S. economy appears to be faltering.",
    "link": "https://www.pbs.org/newshour/politics/americans-expect-higher-prices-from-trumps-tariffs-new-poll-shows",
    "timestamp": "2025-04-24T17:27:40Z"
  },
  {
    "title": "Zelenskiy Cuts Short South Africa Trip After Russian Strike in Kyiv",
    "description": "Ukrainian President Volodymyr Zelenskiy reinforced his rejection of concessions to Russia as the war-battered nation was hit by the biggest air strike this year and US President Donald Trump piled pressure on Kyiv to accept a peace deal.\nDuring a visit to Sou…",
    "link": "https://biztoc.com/x/d40129ab8835fb92",
    "timestamp": "2025-04-24T17:27:39Z"
  },
  {
    "title": "Trump Store Now Selling 'Trump 2028' Hats",
    "description": "Almost half of the Republicans who identify as members of the MAGA movement have said Trump can run for a third term in office.",
    "link": "https://www.newsweek.com/trump-store-now-selling-trump-2028-hats-2063775",
    "timestamp": "2025-04-24T17:27:38Z"
  },
  {
    "title": "Trump Slams Door on Higher Tax Rate for the Rich",
    "description": "The idea of a mostly symbolic boost in income tax rates for the rich might have thwarted Democratic messaging and made it easier to pay for Trump’s agenda. But tax cut orthodoxy reigns supreme in the GOP as Trump and Mike Johnson said ‘no.’",
    "link": "http://nymag.com/intelligencer/article/trump-slams-door-on-higher-tax-rate-for-the-rich.html",
    "timestamp": "2025-04-24T17:26:35Z"
  },
  {
    "title": "Magic: The Gathering Final Fantasy Is Already The Best-Selling Expansion In History",
    "description": "The upcoming collaboration between Magic: The Gathering and Final Fantasy continues to be the most anticipated expansion of the year. Today, during a call with investors, Hasbro CEO Chris Cocks revealed just how popular the set is proving to be, as Magic: The…",
    "link": "https://www.gamespot.com/articles/magic-the-gathering-final-fantasy-is-already-the-best-selling-expansion-in-history/1100-6531100/",
    "timestamp": "2025-04-24T17:26:00Z"
  },
  {
    "title": "Ukraine’s path to peace appears to be rapidly disappearing",
    "description": "Are Donald Trump and the US getting ready to walk away from peace negotiations?",
    "link": "https://theconversation.com/ukraines-path-to-peace-appears-to-be-rapidly-disappearing-255272",
    "timestamp": "2025-04-24T17:24:31Z"
  },
  {
    "title": "Ex-GOP lawmaker mulls run for Florida governor — as a Dem",
    "description": "During his years in the U.S. House of Representatives, then-Rep. David Jolly (R-Florida) was known for being a moderate Republican. Jolly leaned conservative but wasn't far-right.Like many other Never Trumpers, however, Jolly expressed his disdain for Preside…",
    "link": "https://www.rawstory.com/ex-gop-lawmaker-mulls-run-for-florida-governor-as-a-dem/",
    "timestamp": "2025-04-24T17:23:13Z"
  },
  {
    "title": "Crimea is a focus of discussions to end Russia’s war in Ukraine. Here’s why it’s so coveted",
    "description": "Kyiv and most of the world never recognized Russia's annexation of Crimea.",
    "link": "https://www.bostonherald.com/2025/04/24/russia-ukraine-crimea-explained/",
    "timestamp": "2025-04-24T17:22:57Z"
  },
  {
    "title": "State Department Launches First Trump Admin Substack to Spread Trump's America First Agenda Without 'Spin, Bias, or Censorship'",
    "description": "The State Department on Tuesday became the first department to launch a Substack as part of its mission to spread President Donald Trump's America First message on emerging platforms and bypass the filter of \"legacy, traditional media outlets.\"\nThe post State…",
    "link": "https://www.breitbart.com/politics/2025/04/24/state-department-launches-first-trump-admin-substack-to-spread-trumps-america-first-agenda-without-spin-bias-or-censorship/",
    "timestamp": "2025-04-24T17:22:29Z"
  },
  {
    "title": "It's not just Abrego Garcia. Another judge ordered another man's return from El Salvador.",
    "description": "A Trump-appointed judge cited Judge Xinis’ order in the Abrego Garcia case to order the Trump administration to “facilitate” another return.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-judge-cristian-el-salvador-abrego-garcia-rcna202759",
    "timestamp": "2025-04-24T17:21:23Z"
  },
  {
    "title": "Trump's latest polling should make Gavin Newsom think twice about his strategy",
    "description": "Gavin Newsom seems to think that Democrats can only win if they abandon the justice principles that are the foundation of our party. The polls say otherwise.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-gavin-newsom-poll-democrat-voters-rcna202810",
    "timestamp": "2025-04-24T17:21:23Z"
  },
  {
    "title": "‘The Office’ Alum Rainn Wilson Pushes Back On MSNBC Host For Claims Donald Trump & Elon Musk Fueled Mistrust In Traditional Media",
    "description": "Rainn Wilson had MSNBC host Stephanie Ruhle on his Soul Boom podcast, where they discussed why people distrusted traditional media. The host of The 11th Hour noted that people “losing trust is not by accident” and it was “by design.” Ruhle said Donald Trump’s…",
    "link": "http://deadline.com/2025/04/the-office-rainn-wilson-msnbc-host-donald-trump-elon-musk-mistrust-traditional-media-1236376225/",
    "timestamp": "2025-04-24T17:20:19Z"
  },
  {
    "title": "‘I Like That Question’: Trump Approves After Reporter Asks if He Deserves a Nobel Peace Prize",
    "description": "President Donald Trump expressed approval Thursday after a reporter asked whether Trump should be nominated for a Nobel Peace Prize.\nThe post ‘I Like That Question’: Trump Approves After Reporter Asks if He Deserves a Nobel Peace Prize first appeared on Media…",
    "link": "https://www.mediaite.com/tv/i-like-that-question-trump-approves-after-reporter-asks-if-he-deserves-a-nobel-peace-prize/",
    "timestamp": "2025-04-24T17:17:31Z"
  },
  {
    "title": "Angola's oil export revenue drops by 18 pct in Q1",
    "description": "LUANDA, April 24 (Xinhua) -- Angola generated 6.4 billion U.S. dollars in crude oil export revenue during the first quarter of 2025, marking an 18 percent year-on-year decline, Secretary of State for Oil and Gas Jose Barroso said on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/angola039s-oil-export-revenue-drops-by-18-pct-in-q1",
    "timestamp": "2025-04-24T17:17:00Z"
  },
  {
    "title": "HBCUs are celebrating Trump's recent order. What will it change?",
    "description": "The largely symbolic order rehouses a bipartisan presidential initiative on HBCUs at the White House, rather than the Education Department.",
    "link": "https://www.usatoday.com/story/news/education/2025/04/24/hbcu-donald-trump-executive-order/83248770007/",
    "timestamp": "2025-04-24T17:15:52Z"
  },
  {
    "title": "Trump and Speaker Mike Johnson shoot down millionaire tax hike - NBC News",
    "description": "Trump and Speaker Mike Johnson shoot down millionaire tax hikeNBC News GOP talks on millionaire tax hike come from party's populist streak, strategists sayFox News Trump’s inner circle weighs push for higher taxes on millionairesThe Washington Post Donald Tru…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177124645",
    "timestamp": "2025-04-24T17:13:06Z"
  },
  {
    "title": "Trump Asks Supreme Court to Revive Ban on Transgender Troops - The New York Times",
    "description": "Trump Asks Supreme Court to Revive Ban on Transgender TroopsThe New York Times Trump Calls on Putin to ‘STOP’ Russian Strikes on Ukraine: Live UpdatesThe New York Times Pentagon to resume medical care for transgender troopsPolitico Donald Trump Makes Emergenc…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177124641",
    "timestamp": "2025-04-24T17:12:46Z"
  },
  {
    "title": "German finance minister says trust not yet broken with U.S., prefers zero-for-zero tariff solution",
    "description": "The trust between Europe and the U.S. is not yet broken despite President Donald Trump's tariff policies, Joerg Kukies, acting German finance minister, said.",
    "link": "https://www.cnbc.com/2025/04/24/german-finance-minister-prefers-zero-for-zero-tariff-solution.html",
    "timestamp": "2025-04-24T17:12:40Z"
  },
  {
    "title": "Most Americans think tariffs will mean higher prices, poll says",
    "description": "The public’s perception of President Donald Trump’s economic policies continues to fall, with a new poll showing that most Americans think tariffs will mean higher prices. They also think a recession is likely.Read more...",
    "link": "https://qz.com/trump-approval-rating-economy-tariffs-recession-poll-1851777716",
    "timestamp": "2025-04-24T17:12:00Z"
  },
  {
    "title": "Thermo Fisher counters tariffs with $2bn investment into US manufacturing",
    "description": "Following in the footsteps of several pharma companies, life sciences giant Thermo Fisher is doubling down on investments at its US sites.",
    "link": "https://www.pharmaceutical-technology.com/news/thermo-fisher-counters-tariffs-with-2bn-investment-into-us-manufacturing/",
    "timestamp": "2025-04-24T17:11:28Z"
  },
  {
    "title": "Trump's Approval Rating Is Steadily Tanking, Even Worse Than 100 Day-Marks for Biden, Obama, or Bush",
    "description": "You can probably guess how he feels about the polling (though of course he says the numbers are \"fake\")",
    "link": "https://www.vanityfair.com/news/story/trumps-approval-rating-100-days",
    "timestamp": "2025-04-24T17:11:14Z"
  },
  {
    "title": "Judge rules the Trump administration violated a 2019 settlement in deporting a man to El Salvador",
    "description": "The 20-year-old, a Venezuelan native identified as Cristian in court papers, was deported March 15.",
    "link": "https://www.bostonherald.com/2025/04/24/immigration-settlement-violated/",
    "timestamp": "2025-04-24T17:11:04Z"
  },
  {
    "title": "Nintendo Switch 2 preorders see ‘overwhelming’ demand, frustrations for hopeful buyers",
    "description": "NEW YORK (AP) — U.S. preorders for the Nintendo Switch 2 kicked off shortly after the clock struck midnight Thursday. But chaos soon ensued amid high demand. Scores of consumers hoping to be among the first to own Nintendo’s latest gaming console — which is s…",
    "link": "https://financialpost.com/pmn/nintendo-switch-2-preorders-see-overwhelming-demand-frustrations-for-hopeful-buyers",
    "timestamp": "2025-04-24T17:10:36Z"
  },
  {
    "title": "Median CEO pay in US hits record high even as markets tumble",
    "description": "Margins between CEO pay have long been a point of contention between workers and a rallying cry for progressives.",
    "link": "https://www.aljazeera.com/economy/2025/4/24/median-ceo-pay-in-us-hits-record-high-even-as-markets-tumble",
    "timestamp": "2025-04-24T17:08:27Z"
  },
  {
    "title": "Trump-Appointed Judge Orders Second Immigrant Returned From El Salvador",
    "description": "The courts have already said Kilmar Abrego Garcia should come home. Now a judge says a 20-year-old man should be returned.",
    "link": "https://www.huffpost.com/entry/trump-appointed-judge-orders-second-immigrant-returned-from-el-salvador-prison_n_680a562de4b0b3e1a66f06d3",
    "timestamp": "2025-04-24T17:07:53Z"
  },
  {
    "title": "New York Magazine Runs Slobbery 7,959-Word Profile of ‘Loyal Parasite’ Alex Soros",
    "description": "The left-wing fanatics over at New York Magazine chose to use Earth Day to celebrate the budding legacy of George Soros’s “loyal parasite” son Alex Soros, the crown prince of his empire. “Alex, 39, is dressed in black leather boots, black pants, and a black t…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313008/posts",
    "timestamp": "2025-04-24T17:07:35Z"
  },
  {
    "title": "'Existential threat': Latest Trump order triggers panic mode over plans",
    "description": "Critics and education voices were quick to criticize several executive orders signed by U.S. President Donald Trump on Wednesday which target college accreditation, endeavor to foster artificial intelligence \"competency\" in K-12 schools, and more—the latest m…",
    "link": "https://www.rawstory.com/existential-threat-latest-trump-order-triggers-panic-mode-over-plans/",
    "timestamp": "2025-04-24T17:07:13Z"
  },
  {
    "title": "Nintendo Switch 2 preorders see 'overwhelming' demand, frustrations for hopeful buyers",
    "description": "U.S. preorders for the Nintendo Switch 2 kicked off shortly after the clock struck midnight Thursday.  Scores of consumers hoping to be among the first to...",
    "link": "https://tech.yahoo.com/gaming/articles/nintendo-switch-2-preorders-see-170704558.html",
    "timestamp": "2025-04-24T17:07:04Z"
  },
  {
    "title": "Syria wants peace with Israel under one condition, congressman reveals",
    "description": "In an exclusive interview with the 'Post', congressman Stutzman said Syria's president said he was open to normalizing ties with Israel.",
    "link": "https://www.jpost.com/middle-east/abraham-accords/article-851393",
    "timestamp": "2025-04-24T17:06:15Z"
  },
  {
    "title": "Trump offers private dinner to the top investors in his meme coin",
    "description": "The value of President Donald Trump’s meme coin soared Wednesday after a website promoting it announced that some holders of the coin would receive an invitation to a private dinner with Trump – in a stark illustration of his family’s drive to profit off cryp…",
    "link": "https://biztoc.com/x/cfddef5212b709f6",
    "timestamp": "2025-04-24T17:05:30Z"
  },
  {
    "title": "N.L., N.B. sign agreement to explore breaking down interprovincial trade barriers",
    "description": "Newfoundland and Labrador and New Brunswick have announced the signing of a memorandum of understanding to explore how interprovincial trade barriers can be broken down between the two provinces.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/nl-nb-trade-barriers-mou-1.7517657",
    "timestamp": "2025-04-24T17:05:17Z"
  },
  {
    "title": "Trump Admin Mistakenly Shares Doomed Plan to Kill Congestion Pricing (Nia Prater/New York Magazine)",
    "description": "Nia Prater / New York Magazine:\nTrump Admin Mistakenly Shares Doomed Plan to Kill Congestion Pricing  —  Despite Donald Trump's attempts to vanquish it, New York City's congestion-pricing program has continued unabated, blowing past a mandated April 20 deadli…",
    "link": "https://www.memeorandum.com/250424/p76",
    "timestamp": "2025-04-24T17:05:01Z"
  },
  {
    "title": "Donald Trump issues major mandate for U.S schools; here are 7 things all American parents need to know",
    "description": "Donald Trump’s latest education executive orders are creating major waves across schools and colleges in the U.S. From pushing AI learning in high schools to cutting back on woke college accreditation, his new plan is all about discipline, job skills, and tra…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-issues-major-mandate-for-u-s-schools-here-are-7-things-all-american-parents-need-to-know/articleshow/120592064.cms",
    "timestamp": "2025-04-24T17:04:46Z"
  },
  {
    "title": "Trump To Give Interview To Journalist Who Broke Signalgate: 'Are They Capable Of Writing a Fair Story?'",
    "description": "President Donald Trump anticipated that he will give an interview to Jeffrey Goldberg, the editor-in-chief of The Atlantic and who broke Signalgate",
    "link": "https://www.ibtimes.com/trump-give-interview-journalist-who-broke-signalgate-are-they-capable-writing-fair-story-3771268",
    "timestamp": "2025-04-24T17:04:28Z"
  },
  {
    "title": "Bitcoin rebounds as bulls eye $100K and bears scramble to cover short positions",
    "description": "Key takeaways: <ul><li>Bearish Bitcoin traders were caught off guard by BTC’s rally above $90,000.\r\n</li><li>Spot volumes are driving the Bitcoin price rally.\r\n</li><li>Derivatives positions with a bearish bias remain at risk of liquidation.\r\n</li></ul>Bitcoi…",
    "link": "https://cointelegraph.com/news/bitcoin-rallies-as-bulls-eye-100-k-and-bears-rush-to-cover-shorts",
    "timestamp": "2025-04-24T17:04:25Z"
  },
  {
    "title": "The ‘shouting match’ between Musk and Bessent is part of a larger White House problem",
    "description": "The “chest-to-chest” clash in the West Wing between Treasury Secretary Scott Bessent and Elon Musk was emblematic of a serious problem on Team Trump.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/musk-bessent-shouting-match-white-house-rcna202830",
    "timestamp": "2025-04-24T17:03:58Z"
  },
  {
    "title": "Trump asks Supreme Court to allow ban on transgender military members, for now",
    "description": "The high court filing Thursday follows a brief order from a federal appeals court that kept in place a court order blocking the policy nationwide.",
    "link": "https://www.pbs.org/newshour/world/trump-asks-supreme-court-to-allow-ban-on-transgender-military-members-for-now",
    "timestamp": "2025-04-24T17:02:50Z"
  },
  {
    "title": "European ‘warmongers’ working to undermine Trump’s peace efforts – Russian intel",
    "description": "British and French spy services are attempting to sabotage the Ukraine peace talks, according to Russian Foreign Intelligence Agency Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616205-eu-trump-russia-ukraine-conflict/",
    "timestamp": "2025-04-24T17:02:38Z"
  }
]