[
  {
    "title": "DOGE Terminates Tree-Planting Grant for Low-Income Communities",
    "description": "The U.S. Forest Service has ended a $75 million grant to the Arbor Day Foundation, defunding 105 environmental projects.",
    "link": "https://www.newsweek.com/doge-terminates-tree-planting-grant-low-income-communities-2038814",
    "timestamp": "2025-03-03T17:09:45Z"
  },
  {
    "title": "Michelle O’Neill says White House visit ‘different’ for Taoiseach as he gets ‘one-on-one time’",
    "description": "‘The Taoiseach is uniquely in a position where he will have the opportunity to engage directly with the US president,’ said O’Neill.",
    "link": "https://www.thejournal.ie/sinn-fein-michelle-oneill-taoiseach-micheal-martin-white-house-st-patricks-day-visit-6638630-Mar2025/",
    "timestamp": "2025-03-03T17:09:02Z"
  },
  {
    "title": "Trust in US Trade Is Dead and Stocks Are Vulnerable, CIBC Says",
    "description": "Trade risks are set to dominate financial markets in the coming weeks as the US heads toward tariff deadlines set by the Trump administration, according to analysts at Canadian Imperial Bank of Commerce.",
    "link": "https://financialpost.com/pmn/business-pmn/trust-in-us-trade-is-dead-and-stocks-are-vulnerable-cibc-says",
    "timestamp": "2025-03-03T17:08:54Z"
  },
  {
    "title": "Uncertainty Delays 2025’s M&A Boom",
    "description": "Also in the Forbes CEO newsletter: The markets may be the only check on Trump, consumer activists boycott retailers and brands, CEOs tend to exercise and rest.",
    "link": "https://www.forbes.com/sites/meganpoinski/2025/03/03/uncertainty-delays-2025s-ma-boom/",
    "timestamp": "2025-03-03T17:08:27Z"
  },
  {
    "title": "Trump Reacts to Zelensky's Latest Prediction: 'What Are They Thinking?'",
    "description": "A deal to end the war with Russia \"is still very, very far away,\" Ukrainian President Volodymyr Zelenskyy said during a briefing.",
    "link": "https://www.newsweek.com/trump-reacts-zelenskys-latest-prediction-what-are-they-thinking-2038858",
    "timestamp": "2025-03-03T17:08:18Z"
  },
  {
    "title": "VA psychologist resigns over worry about Trump’s ‘unethical’ orders restricting care for trans vets",
    "description": "A Virginia\r\n psychologist who coordinated care for transgender, nonbinary, and other LGBTQ+ veterans at the Hampton VA Medical Center, has resigned in protest, calling the agency’s recent directives on LGBTQ\r\n+ health care\r\n “unethical.”",
    "link": "https://www.advocate.com/news/va-hospital-psychologist-resigns",
    "timestamp": "2025-03-03T17:08:02Z"
  },
  {
    "title": "Fresh Donald Trump health fears emerged after yet another limping video on golf course - NewsBreak",
    "description": "US President Donald Trump has once again sparked fresh health concerns with another video that seems to show his legs buckle underneath him while he's play",
    "link": "https://www.newsbreak.com/share/3837727517709-fresh-donald-trump-health-fears-emerged-after-yet-another-limping-video-on-golf-course?_f=app_share&amp;pd=07ZaHgKj&amp;lang=en_US&amp;send_time=1741021645&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.51.0.21%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v1%2Cns_local_strategy_25q1_exp-v15%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v7&amp;s=i2",
    "timestamp": "2025-03-03T17:07:54Z"
  },
  {
    "title": "How Americans Feel About Trump",
    "description": "A new PBS News/NPR/Marist poll finds Donald Trump's job approval remains underwater, with 49% disapproving and 45% approving of his record so far. However, the poll also found a growing sense from the public that",
    "link": "https://politicalwire.com/2025/03/03/how-americans-feel-about-trump/",
    "timestamp": "2025-03-03T17:07:06Z"
  },
  {
    "title": "Trump blames town hall drama on paid 'troublemakers' (Meredith Lee Hill/Politico)",
    "description": "Meredith Lee Hill / Politico:\nTrump blames town hall drama on paid ‘troublemakers’  —  President Donald Trump on Monday dismissed a spate of contentious town halls that congressional Republicans have faced in recent weeks as being the work of “paid ‘troublema…",
    "link": "https://www.memeorandum.com/250303/p44",
    "timestamp": "2025-03-03T17:05:00Z"
  },
  {
    "title": "‘Whose Side Are You On?’",
    "description": "NBC News reports on a TV ad campaign by two liberal groups featuring a veteran named Leb from Virginia, speaking to Donald Trump and saying he voted for him to “lower costs and protect jobs.”",
    "link": "https://politicalwire.com/2025/03/03/whose-side-are-you-on-2/",
    "timestamp": "2025-03-03T17:04:43Z"
  },
  {
    "title": "Starmer: Netanyahu ‘completely wrong’ to block Gaza aid",
    "description": "PM tells MPs the UK must now look to 'other ways of raising money and finance for development and aid overseas' after confirming cut to government's foreign aid budget",
    "link": "https://www.jewishnews.co.uk/starmer-netanyahu-completely-wrong-to-block-gaza-aid/",
    "timestamp": "2025-03-03T17:04:28Z"
  },
  {
    "title": "Trump says Zelensky made 'worst statement' in recent comments about war's end",
    "description": "Trump slams Zelensky for saying war's end is \"very far away,\" warning \"America will not put up with it\" after heated Oval Office clash.",
    "link": "https://www.jpost.com/breaking-news/article-844529",
    "timestamp": "2025-03-03T17:03:39Z"
  },
  {
    "title": "‘The View’s Whoopi Goldberg Calls Trump-Zelensky Meeting “Chilling”, Tells Viewers “If You Support Ukraine, Say It Out Loud”",
    "description": "Calling last week’s Trump-Zelensky-Vance Oval Office showdown “one of the most embarrassing things I’ve ever seen,” The View moderator Whoopi Goldberg made no secret of which side she’s on. “I do stand with you, Zelensky, because you’ve been fighting, your co…",
    "link": "http://deadline.com/2025/03/whoopi-goldberg-ukraine-trump-zelensky-the-view-1236309368/",
    "timestamp": "2025-03-03T17:03:17Z"
  },
  {
    "title": "Dems hit Medicaid, Elon Musk fears in expensive campaign targeting 23 House Republicans",
    "description": "Democrats are preparing to use Elon Musk and Medicaid as two lightning rods in the 2026 midterms, a new ad campaign suggests.",
    "link": "https://www.foxnews.com/politics/dems-hit-medicaid-elon-musk-fears-expensive-campaign-targeting-23-house-republicans",
    "timestamp": "2025-03-03T17:02:48Z"
  },
  {
    "title": "Trump's 'Gold Card' Would Offer Tax Benefit Unavailable to Americans",
    "description": "President Donald Trump's proposed Gold Card visa for the rich could offer a tax incentive that other immigration pathways currently don't, experts say.\nThe $5 million \"Green Card plus,\" as Trump and his Commerce Secretary Howard Lutnick touted in the Oval Off…",
    "link": "https://biztoc.com/x/a3bf2672b3d8b8a6",
    "timestamp": "2025-03-03T17:02:36Z"
  },
  {
    "title": "High Prices 'Troubling' for Trump, Former Adviser Says",
    "description": "President Donald Trump is facing \"troubling\" trends on prices more than a month after his return to the White House, his former economic adviser Stephen Moore warned on Sunday.\nNewsweek has reached out to the White House for comment via email.\nWhy It Matters\n…",
    "link": "https://biztoc.com/x/6255928feb51a767",
    "timestamp": "2025-03-03T17:02:36Z"
  },
  {
    "title": "TSMC CEO to visit White House to hike U.S. investment",
    "description": "BARCELONA, Spain -- The chairman of Taiwan Semiconductor Manufacturing Co. meets with U.S. President Donald Trump in the White House later Monday, with the visit by C.C. Wei likely signaling greater investment in the U.S. by the world's top contract chipmaker…",
    "link": "https://biztoc.com/x/6d60ffb001c52ab7",
    "timestamp": "2025-03-03T17:02:29Z"
  },
  {
    "title": "Trump said to hold meeting on possible Ukraine aid freeze",
    "description": "United States President Donald Trump will discuss the next steps regarding the Russia-Ukraine conflict, including potentially suspending US military aid to Kiev, during a meeting this afternoon, Axios...",
    "link": "https://biztoc.com/x/05f769cefff092f2",
    "timestamp": "2025-03-03T17:02:26Z"
  },
  {
    "title": "Trump sends crypto prices soaring after surprise announcement of strategic government reserve",
    "description": "Cryptocurrency prices jumped after President Donald Trump’s surprise announcement he wants the U.S. government to purchase and hold a variety of digital assets in a strategic reserve fund, an announcement that highlights Trump’s growing attempts to use...",
    "link": "https://abcnews.go.com/Business/wireStory/trump-sends-crypto-prices-soaring-after-surprise-announcement-119389813",
    "timestamp": "2025-03-03T17:02:24Z"
  },
  {
    "title": "Melania Trump goes to Capitol Hill to lobby for anti-revenge porn bill",
    "description": "Melania Trump is heading to the Capitol to lend her support to an online safety bill",
    "link": "https://abcnews.go.com/Politics/wireStory/melania-trump-capitol-hill-lobby-anti-revenge-porn-119389806",
    "timestamp": "2025-03-03T17:02:15Z"
  },
  {
    "title": "Trump send crypto prices soaring after surprise announcement of strategic government reserve",
    "description": "By ALAN SUDERMAN\nCryptocurrency prices jumped after President Donald Trump’s surprise announcement he wants the U.S. government to purchase and hold a variety of digital assets in a strategic reserve fund, an announcement that highlights Trump’s growing attem…",
    "link": "https://biztoc.com/x/17bb4ecd02c84f71",
    "timestamp": "2025-03-03T17:02:07Z"
  },
  {
    "title": "A meltdown in the White House over Ukraine",
    "description": "An Oval Office meeting devolved into a televised shouting match Friday. President Donald Trump and Vice President JD Vance accused Ukrainian President Volodymyr Zelenskyy of “gambling with World War III” and being ungrateful for U.S. aid. What this unpreceden…",
    "link": "https://www.wbur.org/onpoint/2025/03/03/white-house-ukraine-vance-trump-zelenskyy-aid",
    "timestamp": "2025-03-03T17:01:10Z"
  },
  {
    "title": "‘A Deep Den of Anti-Semitism!’ Trump’s U.N. Ambassador Rails Against the U.N.",
    "description": "Recently appointed UN Ambassador Elise Stefanik made abundantly clear how she feels about the United Nations during a speech to the Anti-Defamation League.\nThe post ‘A Deep Den of Anti-Semitism!’ Trump’s U.N. Ambassador Rails Against the U.N. first appeared o…",
    "link": "https://www.mediaite.com/politics/a-deep-den-of-anti-semitism-trumps-u-n-ambassador-rails-against-the-u-n/",
    "timestamp": "2025-03-03T17:00:32Z"
  },
  {
    "title": "Trump's plan to make America the 'crypto capital' is light on detail — here's what we know",
    "description": "Plenty of questions remain about President Donald Trump's plan for a US crypto reserve that would include bitcoin, ether, XRP, sol, and ada.",
    "link": "https://www.businessinsider.com/trump-crypto-reserve-bitcoin-btc-eth-prices-coins-rally-questions-2025-3",
    "timestamp": "2025-03-03T17:00:21Z"
  },
  {
    "title": "Fresh Trump health fears after another limping video...",
    "description": "Donald Trump‘s recent appearance has yet again evoked speculation about his deteriorating health. The President could be seen limping in the recent video t",
    "link": "https://www.newsbreak.com/news/3837831157866-donald-trump-s-limp-raises-alarms-is-he-hiding-any-serious-health-condition",
    "timestamp": "2025-03-03T17:00:02Z"
  },
  {
    "title": "Trump Is Right to Snub the EU",
    "description": "The White House has signaled that it wants sensible partners, not wild-eyed Russia hawks, in Europe. \nThe post Trump Is Right to Snub the EU appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-is-right-to-snub-the-eu/",
    "timestamp": "2025-03-03T17:00:00Z"
  },
  {
    "title": "Ray Dalio: Debt crisis could cause 'economic heart attack' for US economy in the next 3 years",
    "description": "Billionaire hedge fund manager Ray Dalio believes the US economy is at a critical inflection point as the debt situation becomes more dire.",
    "link": "https://finance.yahoo.com/news/ray-dalio-debt-crisis-could-cause-economic-heart-attack-for-us-economy-in-the-next-3-years-165939619.html",
    "timestamp": "2025-03-03T16:59:39Z"
  },
  {
    "title": "New polls reveal where Trump stands on eve of his first major address to Congress",
    "description": "Americans appear divided on the job President Donald Trump is doing, according to the latest polls, ahead of his first major address to Congress since returning to the White House in January",
    "link": "https://www.foxnews.com/politics/new-polls-reveal-where-trump-stands-eve-his-first-major-address-congress",
    "timestamp": "2025-03-03T16:59:04Z"
  },
  {
    "title": "Ethereum NFT Collections Pudgy Penguins, CryptoPunks Jump Amid ETH, Bitcoin Surge",
    "description": "The top NFT collections are all green in the last 24 hours.",
    "link": "https://decrypt.co/308467/ethereum-nft-collections-pudgy-penguins-cryptopunks-jump-amid-eth-bitcoin-surge",
    "timestamp": "2025-03-03T16:59:04Z"
  },
  {
    "title": "Growing up, with uncertainties",
    "description": "New GDP estimates show Q3 growth has improved to 6.2% and the FY25 growth estimate has been revised to 6.5%. Previous fiscal growth estimates were also revised upward. However, global economic uncertainties and possible trade wars under Trump introduce unpred…",
    "link": "https://m.economictimes.com/opinion/et-commentary/growing-up-with-uncertainties/articleshow/118689729.cms",
    "timestamp": "2025-03-03T16:58:43Z"
  },
  {
    "title": "59% of Republicans Believe the Media Is ‘Fake News’",
    "description": "The percentage of Republicans who have no trust in the mainstream media has more than doubled since Donald Trump first campaigned for president \nThe post 59% of Republicans Believe the Media Is ‘Fake News’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/most-republicans-believe-media-fake-news-trump-poll/",
    "timestamp": "2025-03-03T16:58:00Z"
  },
  {
    "title": "Trump sends crypto prices soaring after surprise announcement of strategic government reserve",
    "description": "Trump said his admin is working toward creating a “Crypto Strategic Reserve”",
    "link": "https://www.bostonherald.com/2025/03/03/crypto-trump/",
    "timestamp": "2025-03-03T16:57:50Z"
  },
  {
    "title": "Trump Says \"Will Not Put Up\" With Zelensky's Stance On Ceasefire",
    "description": "Donald Trump said Monday that Washington would &quot;not put up with&quot; Volodymyr Zelensky&#039;s rhetoric much longer, as the US president prepared to meet his top team after a disastrous Oval Office row with the Ukrainian.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-will-not-put-up-with-zelenskys-stance-on-ukraine-russia-ceasefire-7840156",
    "timestamp": "2025-03-03T16:57:35Z"
  },
  {
    "title": "The Big Changes Ukraine And The USA Have Made To Savage Dragon #275",
    "description": "Spoilers! Spoilers! Spoilers! Savage Dragon by Erik Larsen goes there more than most comics. And numerical milestone issues go there more than most. Such as last month's Savage Dragon #275. Which has Malcolm Dragon fighting against people who want parallel di…",
    "link": "https://bleedingcool.com/comics/the-big-changes-ukraine-and-the-usa-have-made-to-savage-dragon-275/",
    "timestamp": "2025-03-03T16:57:08Z"
  },
  {
    "title": "Did the Democrats nudge Ukraine's Zelensky to reject mineral deal with U.S? Here's what a report is saying",
    "description": "Volodymyr Zelensky's meeting with Democratic lawmakers influenced his decision to reject a key mineral deal with the US, resulting in a tense confrontation with President Trump. Democrats advised Zelensky to reject the deal, leading to a missed opportunity fo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-the-democrats-nudge-ukraines-zelensky-to-reject-mineral-deal-with-u-s-heres-what-a-report-is-saying/articleshow/118688971.cms",
    "timestamp": "2025-03-03T16:56:43Z"
  },
  {
    "title": "Trump's 'Gold Card' Would Offer Tax Benefit Unavailable to Americans",
    "description": "The president's $5 million visa program has been met with skepticism, including over its potential tax loophole.",
    "link": "https://www.newsweek.com/trump-gold-card-tax-loophole-taxes-2038822",
    "timestamp": "2025-03-03T16:56:39Z"
  },
  {
    "title": "‘Can’t Even Sleep’: Drug Lords Reportedly Quake In Their Boots After Trump Unleashes Cartel Crackdown",
    "description": "President Donald Trump's crackdown on drug cartels and unprecedented pressure on the Mexican government to take more action has drug lords feeling the pinch.",
    "link": "https://dailycaller.com/2025/03/03/trump-crackdown-has-drug-cartels-scared/",
    "timestamp": "2025-03-03T16:56:01Z"
  },
  {
    "title": "Make trade cool again: A well-crafted, flexible US-India trade agreement can unlock lasting economic opportunities",
    "description": "American ships in the early 1800s brought ice to India, revolutionising its food preservation and trade, while returning with valuable products like indigo and silk. Today, a US-India trade agreement could enhance India's manufacturing potential and US market…",
    "link": "https://m.economictimes.com/opinion/et-commentary/make-trade-cool-again-a-well-crafted-flexible-us-india-trade-agreement-can-unlock-lasting-economic-opportunities/articleshow/118689700.cms",
    "timestamp": "2025-03-03T16:55:57Z"
  },
  {
    "title": "Mark Cuban Suggests Fired Federal Employees Turn Into Government Consultants",
    "description": "The smiling billionaire’s pleasant suggestion is to privatize government services.",
    "link": "https://gizmodo.com/mark-cuban-suggests-fired-federal-employees-turn-into-government-consultants-2000570787",
    "timestamp": "2025-03-03T16:55:53Z"
  },
  {
    "title": "'Selling the Nazi Mobile:' Leftist Tesla Owners Revolt Against Former Darling Elon Musk",
    "description": "Leftist Tesla fans, formerly the core supporters of Elon Musk's EVs, are now selling their vehicles in protest of Musk's political support for Donald Trump. Emboldened by celebrities, labeling Tesla vehicles as \"Swastikars\" is now the left's virtue signal of …",
    "link": "https://www.breitbart.com/tech/2025/03/03/selling-the-nazi-mobile-leftist-tesla-owners-revolt-against-former-darling-elon-musk/",
    "timestamp": "2025-03-03T16:55:35Z"
  },
  {
    "title": "Treasury Department suspends enforcement of ownership information reporting for millions of businesses",
    "description": "The Treasury Department has halted enforcement of beneficial ownership information, or BOI, reporting for millions of businesses.",
    "link": "https://www.cnbc.com/2025/03/03/treasury-department-boi-reporting-deadline.html",
    "timestamp": "2025-03-03T16:54:28Z"
  },
  {
    "title": "US Manufacturing Expands For Second Month Under Trump, Driven by Stronger Demand and Policy Shifts",
    "description": "S&P Global PMI Shows Strongest Growth Since 2022, While ISM Reports Weaker Demand\nThe post US Manufacturing Expands For Second Month Under Trump, Driven by Stronger Demand and Policy Shifts appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/03/03/us-manufacturing-expands-for-second-month-under-trump-driven-by-stronger-demand-and-policy-shifts/",
    "timestamp": "2025-03-03T16:54:28Z"
  },
  {
    "title": "In Oscars Speech, Kieran Culkin Confirms The Real Reward In Life Is Building A Family",
    "description": "Despite our increasingly anti-child culture, getting hitched and having kids is one of the most fulfilling things someone can do.",
    "link": "https://thefederalist.com/2025/03/03/in-oscars-speech-kieran-culkin-confirms-the-real-reward-in-life-is-building-a-family/",
    "timestamp": "2025-03-03T16:54:12Z"
  },
  {
    "title": "High Prices 'Troubling' for Trump, Former Adviser Says",
    "description": "From houses to eggs, prices remain high more than a month into Trump's second term.",
    "link": "https://www.newsweek.com/high-prices-troubling-donald-trump-stephen-moore-2038820",
    "timestamp": "2025-03-03T16:54:11Z"
  },
  {
    "title": "Treasury ends enforcement of business ownership database meant to stop shell company formation - ABC News",
    "description": "Treasury ends enforcement of business ownership database meant to stop shell company formationABC News ‘Exciting News’: Trump Brags About Gutting Anti-Money Laundering LawRolling Stone Trump praises Treasury Department's move to suspend enforcement of BOI req…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176600751",
    "timestamp": "2025-03-03T16:53:13Z"
  },
  {
    "title": "David Frum Taunts Sexually ‘Inadequate’ Trump Fans on CNN for Casting Oval Blowup as ‘So Manly’",
    "description": "David Frum cruelly taunted Trump fans over their gushing response to the brutal blowup between Trump and Ukrainian President Volodymyr Zelensky. \nThe post David Frum Taunts Sexually ‘Inadequate’ Trump Fans on CNN for Casting Oval Blowup as ‘So Manly’ first ap…",
    "link": "https://www.mediaite.com/news/david-frum-taunts-sexually-inadequate-trump-fans-on-cnn-for-casting-oval-blowup-as-so-manly/",
    "timestamp": "2025-03-03T16:52:52Z"
  },
  {
    "title": "Israel PM Netanyahu Says It's Time To Give Gazans \"Freedom To Leave\"",
    "description": "Israeli Prime Minister Benjamin Netanyahu on Monday said it was time to give Palestinians &quot;the freedom to leave&quot; Gaza, praising US President Donald Trump&#039;s &quot;visionary and innovative&quot; plan to forcibly remove the territory&#039;s reside…",
    "link": "https://www.ndtv.com/world-news/israel-pm-benjamin-netanyahu-says-its-time-to-give-gazans-freedom-to-leave-7840141",
    "timestamp": "2025-03-03T16:52:52Z"
  },
  {
    "title": "This is the worst statement that could have been made by Zelenskyy",
    "description": "This is the worst statement that could have been made by Zelenskyy, and America will not put up with it for much longer! It is what I was saying, this guy doesn’t want there to be Peace as long as he has America’s backing and, Europe, in the meeting they had …",
    "link": "https://freerepublic.com/focus/f-news/4301755/posts",
    "timestamp": "2025-03-03T16:51:56Z"
  },
  {
    "title": "Trump sends crypto prices soaring after surprise announcement of strategic government reserve",
    "description": "Cryptocurrency prices jumped after President Donald Trump's surprise announcement he wants the U.S. government to purchase and hold a variety of digital assets in a strategic reserve fund, an announcement that highlights Trump's growing attempts to use volati…",
    "link": "https://biztoc.com/x/829b29a2293e01c8",
    "timestamp": "2025-03-03T16:51:50Z"
  },
  {
    "title": "Petitions to Cancel Donald Trump's UK State Visit Hit 250,000 Signatures",
    "description": "The president was offered an unprecedented second state visit the day before his tense Oval Office meeting with Volodymyr Zelensky.",
    "link": "https://www.newsweek.com/petitions-donald-trump-state-visit-uk-king-charles-zelensky-2038733",
    "timestamp": "2025-03-03T16:51:41Z"
  },
  {
    "title": "King Charles Signals Support for Canada Amid Trump Attacks",
    "description": "The British monarch met Justin Trudeau in a public display of support after Donald Trump spoke of annexing Canada.",
    "link": "https://biztoc.com/x/1cf629a0e757e272",
    "timestamp": "2025-03-03T16:51:36Z"
  },
  {
    "title": "Trump tariffs will raise gasoline and electricity prices in the U.S., Canada energy minister says",
    "description": "President Donald Trump's tariffs on Canada will raise energy prices for U.S. consumers if the levies go into effect on March 4 as expected, the country's energy minister said Monday.\nJohnathan Wilkinson, Canada's minister of energy and natural resources, said…",
    "link": "https://biztoc.com/x/311897a453f2275e",
    "timestamp": "2025-03-03T16:51:28Z"
  },
  {
    "title": "Trump crypto rally fizzles amid reserves plan skepticism",
    "description": "Plans to include three lesser-known digital tokens in U.S. strategic crypto reserve met doubt as coins gave up some initial gains. Read on",
    "link": "https://financialpost.com/fp-finance/cryptocurrency/trump-crypto-rally-fizzles-amid-skepticism",
    "timestamp": "2025-03-03T16:51:09Z"
  },
  {
    "title": "MAHA furious at ‘total fraud’ RFK Jr. after he backs measles vaccine amid outbreak",
    "description": "Supporters of President Donald Trump are up in arms after Robert F. Kennedy Jr. (RFK Jr.) endorsed the measles, mumps, and rubella (MMR) vaccine.\n\n\nIn an op-ed for Fox News, RFK Jr., Trump's Secretary of Health and Human Services, said that the vaccine provid…",
    "link": "https://www.dailydot.com/debug/rfk-jr-measles-vaccine-endorsement-maga-backlash/",
    "timestamp": "2025-03-03T16:47:52Z"
  },
  {
    "title": "King Charles Signals Support for Canada Amid Trump Attacks",
    "description": "The British monarch met Justin Trudeau in a public display of support after Donald Trump spoke of annexing Canada.",
    "link": "https://www.newsweek.com/king-charles-high-stakes-diplomacy-donald-trump-zelensky-trudeau-2038743",
    "timestamp": "2025-03-03T16:46:54Z"
  },
  {
    "title": "Zelenskyy's Future Uncertain After Historic Oval Office Clash With Trump",
    "description": "Foreign leaders rallied around Zelenskyy this weekend, but Trump still has the power to cause lasting damage to Kyiv's war effort against Russia.",
    "link": "https://www.huffpost.com/entry/volodymyr-zelenskyy-trump-ukraine_n_67c589fce4b004142b83170e",
    "timestamp": "2025-03-03T16:46:50Z"
  },
  {
    "title": "Trump tariffs will raise gasoline and electricity prices in the U.S., Canada energy minister says",
    "description": "Canadian Energy Minister Jonathan Wilkinson said tariffs are a \"lose, lose proposition\" for the U.S. and Canada.",
    "link": "https://www.cnbc.com/2025/03/03/trump-tariffs-will-raise-gasoline-electricity-prices-canada-minister.html",
    "timestamp": "2025-03-03T16:46:08Z"
  },
  {
    "title": "Former Social Security Administrator Warns DOGE Cuts Mean System Will ‘Collapse’ in ‘Next 30 to 90 Days’ - NewsBreak",
    "description": "Former Social Security Commissioner Martin O’Malley warned the Department of Government Efficiency’s (DOGE) cuts will trigger a catastrophic “collapse” of",
    "link": "https://www.newsbreak.com/share/3838164394006-former-social-security-administrator-warns-doge-cuts-mean-system-will-collapse-in-next-30-to-90-days?_f=app_share&pd=09v3KXsV&lang=en_US&send_time=1741050539&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v7%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_model_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-v7%2Cns_foryou_rank_exp_25q1-v6%2Cns_local_strategy_25q1_exp-v3&s=i2",
    "timestamp": "2025-03-03T16:46:07Z"
  },
  {
    "title": "Former Social Security Administrator Warns DOGE Cuts Mean System Will ‘Collapse’ in ‘Next 30 to 90 Days’",
    "description": "Former Social Security Commissioner Martin O’Malley warned the Department of Government Efficiency’s (DOGE) cuts will trigger a catastrophic “collapse” of the Social Security system “within the next 30 to 90 days.” O’Malley, a longtime fixture in Democratic p…",
    "link": "https://www.mediaite.com/news/former-social-security-administrator-warns-doge-cuts-mean-system-will-collapse-in-next-30-to-90-days/",
    "timestamp": "2025-03-03T16:46:07Z"
  },
  {
    "title": "Former Social Security Administrator Warns DOGE Cuts Mean System Will ‘Collapse’ in ‘Next 30 to 90 Days’ - NewsBreak",
    "description": "Former Social Security Commissioner Martin O’Malley warned the Department of Government Efficiency’s (DOGE) cuts will trigger a catastrophic “collapse” of",
    "link": "https://www.newsbreak.com/share/3838164394006-former-social-security-administrator-warns-doge-cuts-mean-system-will-collapse-in-next-30-to-90-days?_f=app_share&pd=04r7Qtde&lang=en_US&send_time=1741030814&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v4%2Cns_foryou_rank_exp_25q1-v7%2Cns_foryou_blend_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v7%2Cns_local_strategy_25q1_exp-v10&s=i2",
    "timestamp": "2025-03-03T16:46:07Z"
  },
  {
    "title": "Chinese Spies, United Front Operations in the U.S.",
    "description": "China's aggressive cyberespionage and influence operations pose a significant threat to U.S. national security. This analysis reveals the intricate tactics employed by Beijing to undermine American institutions and gather sensitive information.\nThe post Chine…",
    "link": "https://www.thegatewaypundit.com/2025/03/chinese-spies-united-front-operations-u-s/",
    "timestamp": "2025-03-03T16:45:09Z"
  },
  {
    "title": "Trump has spent a quarter of his presidency golfing as anger over distraction grows - NewsBreak",
    "description": "Trump was spotted hitting the golf course at his Mar-a-Lago estate in Palm Beach, Florida, on Sunday, just days after telling off Ukrainian President Volod",
    "link": "https://www.newsbreak.com/share/3837773242635-trump-has-spent-a-quarter-of-his-presidency-golfing-as-anger-over-distraction-grows?_f=app_share&amp;pd=07yC5Pp2&amp;lang=en_US&amp;send_time=1741020096&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v3%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v2%2Cns_local_strategy_25q1_exp-v9%2Cns_push_exp_rt_bucketv12-v5&amp;s=i2",
    "timestamp": "2025-03-03T16:42:10Z"
  },
  {
    "title": "Oval Office blowup fallout: The 5 biggest moves in markets with a Russia-Ukraine deal in jeopardy",
    "description": "Betting markets are shifting, with the odds of the war ending in the first 90 days of Trump's presidency down to about 20% on Monday.",
    "link": "https://www.businessinsider.com/stock-market-impact-russia-ukraine-war-trump-oval-office-blowup-2025-3",
    "timestamp": "2025-03-03T16:41:44Z"
  },
  {
    "title": "Elon Musk Tags ‘Retard Finder’ Account in Response to Critic Claiming He’s Suffering From ‘Cognitive Decline’",
    "description": "Elon Musk continues to reclaim the controversial term \"retard\" as an acceptable insult, this time in response to a post suggesting he's suffering from cognitive decline.\nThe post Elon Musk Tags ‘Retard Finder’ Account in Response to Critic Claiming He’s Suffe…",
    "link": "https://www.mediaite.com/news/elon-musk-tags-retard-finder-account-in-response-to-critic-claiming-hes-suffering-from-cognitive-decline/",
    "timestamp": "2025-03-03T16:41:26Z"
  },
  {
    "title": "Trump’s $5 million 'gold card' visa opens a door for wealthy college applicants from overseas, experts say",
    "description": "President Trump’s proposed $5 million \"gold card\" for U.S. residency could be particularly attractive for an elite cohort of international students.",
    "link": "https://www.cnbc.com/2025/03/03/trump-gold-card-visa-may-attract-rich-college-applicants-from-abroad.html",
    "timestamp": "2025-03-03T16:41:01Z"
  },
  {
    "title": "Trudeau Meets King Charles, with Trump's '51st State' Comments at the Fore",
    "description": "Outgoing Canadian Prime Minister Justin Trudeau met with King Charles III in London on Monday.\nThe post Trudeau Meets King Charles, with Trump’s ’51st State’ Comments at the Fore appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/03/03/trudeau-meets-king-charles-trumps-51st-state-comments-at-fore/",
    "timestamp": "2025-03-03T16:40:18Z"
  },
  {
    "title": "Trump’s Tariffs Will Hurt Mexico – and America",
    "description": "US President Donald Trump’s border crackdowns and planned tariffs on Mexican goods could push Mexico into a deep recession. Rather than reducing migration, these policies will likely cause widespread economic hardship, driving even more people to leave for th…",
    "link": "https://www.project-syndicate.org/commentary/trump-mexico-tariffs-both-sides-lose-by-anne-o-krueger-2025-03",
    "timestamp": "2025-03-03T16:40:09Z"
  },
  {
    "title": "Donald Trump Is Backed by the Business Elite (Steven Rattner/New York Times)",
    "description": "Steven Rattner / New York Times:\nDonald Trump Is Backed by the Business Elite  —  Over lunch last week with a friend of mine — a major technology investor who has been an ardent Democrat — the talk quickly turned to politics.  Like many businessmen, he refuse…",
    "link": "https://www.memeorandum.com/250303/p43",
    "timestamp": "2025-03-03T16:40:00Z"
  },
  {
    "title": "White House takes aim at Zelenskyy’s ‘body language’ and fashion choices",
    "description": "What exactly did Volodymyr Zelenskyy do that left officials in the West Wing so offended? They have a list, but it's awfully pitiful.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-house-takes-aim-zelenskyys-body-language-fashion-choices-rcna194515",
    "timestamp": "2025-03-03T16:39:45Z"
  },
  {
    "title": "Leslie Bibb Says She Thought ‘White Lotus’ Trump Conversation Would be ‘Irrelevant’",
    "description": "Leslie Bibb spoke about the 'randomly current' conversation about Donald Trump in Episode Three of 'The White Lotus,' which was written in 2022.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/white-lotus-trump-scene-leslie-bibb-1235286506/",
    "timestamp": "2025-03-03T16:39:13Z"
  },
  {
    "title": "California Democrats Purge Five Republicans, and One Moderate Democrat, from Committees",
    "description": "California State Assembly Speaker Robert Rivas (D-Hollister) purged five Republicans and one moderate Democrat from legislative committees late Friday, apparently in retaliation for their efforts at oversight and bipartisanship.\nThe post California Democrats …",
    "link": "https://www.breitbart.com/politics/2025/03/03/california-democrats-purge-five-republicans-and-one-moderate-democrat-from-committees/",
    "timestamp": "2025-03-03T16:39:03Z"
  },
  {
    "title": "MAGA supporter facing possible prison time in Jan. 6-related case despite Trump pardons",
    "description": "A supporter of President Donald Trump was facing a possible prison sentence in a case related to the Jan. 6 attacks despite pardons for other defendants.CBS News Texas reported Monday that a federal judge was expected to move forward with sentencing for Abiga…",
    "link": "https://www.rawstory.com/abigail-jo-shry-january-6/",
    "timestamp": "2025-03-03T16:36:34Z"
  },
  {
    "title": "Fight To Protect Women’s Sports Could Stall In Senate",
    "description": "A commonsense issue that Americans overwhelmingly support could stall in the Senate.",
    "link": "https://dailycaller.com/2025/03/03/bill-protecting-womens-sports-could-stall-senate/",
    "timestamp": "2025-03-03T16:35:38Z"
  },
  {
    "title": "US manufacturing expansion cools in February",
    "description": "US manufacturing activity saw a marginal expansion in February, marking the second consecutive month of growth after a prolonged contraction period. However, demand weakened, and prices surged due to tariff threats, causing new order placement backlogs and op…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-manufacturing-expansion-cools-in-february/articleshow/118689486.cms",
    "timestamp": "2025-03-03T16:35:29Z"
  },
  {
    "title": "Trump Issues Questionable Order Making English the Official Language of the US",
    "description": "More than 67 million people in the US speak a language other than English in their homes.",
    "link": "https://truthout.org/articles/trump-issues-questionable-order-making-english-the-official-language-of-the-us/",
    "timestamp": "2025-03-03T16:35:20Z"
  },
  {
    "title": "Trump nominates Paul Dabbar as Commerce deputy secretary",
    "description": "Dabbar previously worked in the Department of Energy during the first Trump administration, and will now focus on global trade and technology for Commerce.",
    "link": "https://www.nextgov.com/people/2025/03/trump-nominates-paul-dabbar-commerce-deputy-secretary/403410/",
    "timestamp": "2025-03-03T16:35:00Z"
  },
  {
    "title": "Palestinian Filmmaker Demands End to US-Backed 'Ethnic Cleansing' of Gaza, West Bank in Oscar Speech",
    "description": "The winner of the 2025 Academy Award for Best Documentary Feature Film has been unable to obtain distribution in theaters or on streaming platforms in the U.S.—despite being the highest-grossing Oscar-nominated documentary in the rest of the world—but America…",
    "link": "https://www.commondreams.org/news/no-other-land-documentary",
    "timestamp": "2025-03-03T16:33:27Z"
  },
  {
    "title": "Economic woes cast shadow over Iran holiday season",
    "description": "Shops and markets in central Tehran, usually teeming with customers ahead of the Persian New Year, now barely see any buyers, a sombre reflection of the dire state of the Iranian economy. The plummeting currency and double-digit inflation, which have reduced …",
    "link": "https://www.digitaljournal.com/world/economic-woes-cast-shadow-over-iran-holiday-season/article",
    "timestamp": "2025-03-03T16:32:33Z"
  },
  {
    "title": "Mexican Communities in US Rise in Protest Against Trump’s Deportation Threats",
    "description": "You won’t have seen them on the news, but widespread demonstrations are taking place in barrios on the urban fringe.",
    "link": "https://truthout.org/articles/mexican-communities-in-us-rise-in-protest-against-trumps-deportation-threats/",
    "timestamp": "2025-03-03T16:31:16Z"
  },
  {
    "title": "Treasury ends enforcement of business ownership database meant to stop shell company formation",
    "description": "Trump said the database is “outrageous and invasive.”",
    "link": "https://www.denverpost.com/2025/03/03/treasury-business-database/",
    "timestamp": "2025-03-03T16:30:27Z"
  },
  {
    "title": "Crypto market is becoming a weapon of US warns CryptoQuant CEO",
    "description": "CryptoQuant CEO Ki Young Ju has voiced concerns over the United States’ growing influence in crypto, suggesting that the country may be leveraging digital assets to serve its national interests. In a March 3 post on X, Young Ju highlighted the rapid shift in …",
    "link": "https://cryptoslate.com/crypto-market-is-becoming-a-weapon-of-us-warns-cryptoquant-ceo/",
    "timestamp": "2025-03-03T16:30:07Z"
  },
  {
    "title": "What to watch when Trump gives his big speech to Congress on Tuesday",
    "description": "Trump's speech on Tuesday isn't technically a State of the Union address, but there's no distinguishable difference for anyone watching at home. Here's an idea of what to look for.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_9c99829f-0d25-5768-932c-20dbc2df2496.html",
    "timestamp": "2025-03-03T16:30:00Z"
  },
  {
    "title": "Chase Strangio, One of the Lead Lawyers Battling Trump, Explains What We Can Do When the Law Fails Us",
    "description": "“The more we have our needs met by caring for each other, the more we're going to be equipped to fight back against whatever is coming.”",
    "link": "https://slate.com/news-and-politics/2025/03/chase-strangio-aclu-trump-transgender-bans.html",
    "timestamp": "2025-03-03T16:30:00Z"
  },
  {
    "title": "Bitcoin, Ether, Solana, Cardano and more cryptocurrencies to watch this week",
    "description": "Just three days ago, Bitcoin was in a sharp decline, falling below $80,000. However, in a dramatic reversal, the leading cryptocurrency has surged by over $14,000, or 20%, fueled by Donald Trump. Over the weekend, the president revealed plans to establish a c…",
    "link": "https://qz.com/bitcoin-ether-solana-cardano-xrp-and-others-to-watch-1851767351",
    "timestamp": "2025-03-03T16:30:00Z"
  },
  {
    "title": "Here are the 5 cryptocurrencies Trump wants to buy with your tax dollars",
    "description": "Here are the 5 cryptocurrencies Trump wants to buy with your tax dollars\nPresident Donald Trump is a self-proclaimed \"crypto president.\"\nTom Williams—CQ-Roll Call, Inc/Getty Images",
    "link": "https://biztoc.com/x/bd20b310f57f8099",
    "timestamp": "2025-03-03T16:29:45Z"
  },
  {
    "title": "‘Replacing Me Won’t be Easy’: Zelensky Says He’d Just Get Elected Again in Fresh Ukraine Elections",
    "description": "Ukraine’s lack of elections has been cited as a concern by some Western figures as President Donald Trump tries to bring peace to the region, but President Volodymyr Zelensky insists he’s so popular you’d have to ban him from office to prevent him returning t…",
    "link": "https://freerepublic.com/focus/f-news/4301753/posts",
    "timestamp": "2025-03-03T16:29:44Z"
  },
  {
    "title": "Donald Trump to Replace Benjamin Franklin on $100 Bill Under GOP Proposal",
    "description": "Rep. Brandon Gill said that he plans to introduce a bill to feature Trump's likeness on the $100 note after his current term.",
    "link": "https://biztoc.com/x/fd1e95857524a044",
    "timestamp": "2025-03-03T16:29:31Z"
  },
  {
    "title": "Warren Buffett Weighs In on Donald Trump Tariff Plans",
    "description": "Legendary investor Warren Buffett has warned that President Donald Trump's tariffs on goods imported from foreign countries such as Canada and Mexico could have a disastrous impact on American consumers.\nIn a rare admission for the so-called \"Oracle of Omaha,…",
    "link": "https://biztoc.com/x/c9c49329aa031577",
    "timestamp": "2025-03-03T16:29:30Z"
  },
  {
    "title": "Lawsuit Seeks to Prevent DOGE, Musk From Gutting U.S. Environmental Agencies",
    "description": "The Center Biological Diversity sued five cabinet-level agencies today seeking to stop the so-called Department of Government Efficiency and its DOGE teams from taking further actions against multiple environmental agencies until each team fully complies with…",
    "link": "https://www.commondreams.org/newswire/lawsuit-seeks-to-prevent-doge-musk-from-gutting-u-s-environmental-agencies",
    "timestamp": "2025-03-03T16:28:36Z"
  },
  {
    "title": "NATO is talking about sending troops to Ukraine—this is how world wars start",
    "description": "For months, the talk has been about weapons, aid, and financial support. Now, NATO countries are openly discussing sending troops into Ukraine, bypassing the U.S. in the process. If that happens, and Russia responds? Article 5 gets invoked. Suddenly, it’s not…",
    "link": "https://freerepublic.com/focus/f-bloggers/4301752/posts",
    "timestamp": "2025-03-03T16:27:37Z"
  },
  {
    "title": "Fallout continues from Trump-Zelenskyy Oval Office outburst",
    "description": "Europe unites for Ukraine under Starmer's plan, America remains uncertain",
    "link": "https://www.kcci.com/article/starmer-ukraine-support-plan/64017017",
    "timestamp": "2025-03-03T16:26:59Z"
  },
  {
    "title": "Measles outbreak is call to action for all of us",
    "description": "As the Secretary of the U.S. Department of Health and Human Services, I am deeply concerned about the recent measles outbreak. This situation has escalated rapidly, with the Texas Department of State Health Services (DSHS) reporting 146 confirmed cases since …",
    "link": "https://freerepublic.com/focus/f-chat/4301751/posts",
    "timestamp": "2025-03-03T16:26:51Z"
  },
  {
    "title": "One Trader Made Millions Betting $200M on BTC Just Before Trump's Crypto Reserve News",
    "description": "At one point the trader was just $50 away from being liquidated.",
    "link": "https://www.coindesk.com/markets/2025/03/03/one-trader-made-millions-betting-usd200m-on-btc-just-before-trump-s-crypto-reserve-news",
    "timestamp": "2025-03-03T16:26:47Z"
  },
  {
    "title": "Bitcoin returns under $90K as crypto market liquidates $150M in hours",
    "description": "Bitcoin and crypto are back liquidating late longs as the Wall Street open brings a fresh round of sell-side pressure with markets keen for Trump reserve cues.",
    "link": "https://cointelegraph.com/news/bitcoin-returns-under-90k-crypto-market-liquidates-150m",
    "timestamp": "2025-03-03T16:26:02Z"
  },
  {
    "title": "Fallout continues from Trump-Zelenskyy Oval Office outburst",
    "description": "Europe unites for Ukraine under Starmer's plan, America remains uncertain",
    "link": "https://www.wmur.com/article/starmer-ukraine-support-plan/64017017",
    "timestamp": "2025-03-03T16:25:27Z"
  },
  {
    "title": "Scott Bessent Delivers Small Business Relief with CTA Suspension",
    "description": "Treasury Secretary Scott Bessent on Sunday announced that the department will not enforce any fines or penalties associated with the Corporate Transparency Act.\nThe post Scott Bessent Delivers Small Business Relief with CTA Suspension appeared first on Breitb…",
    "link": "https://www.breitbart.com/politics/2025/03/03/scott-bessent-delivers-small-business-relief-with-cta-suspension/",
    "timestamp": "2025-03-03T16:23:24Z"
  },
  {
    "title": "Europe’s inflation fell to 2.4% in February. How analysts expect the Central Bank to respond",
    "description": "Inflation in Europe eased to an annual 2.4% in February, supporting the case for another interest rate cut from the European Central Bank—but leaving open how far the central bank will go in lowering borrowing costs for an economy that’s still struggling to s…",
    "link": "https://www.fastcompany.com/91288808/europes-inflation-fell-2-4-february-how-analysts-expect-central-bank-respond",
    "timestamp": "2025-03-03T16:22:41Z"
  }
]