[
  {
    "title": "Trump Blames Courts For Blocking Deportations",
    "description": "President Donald Trump on Tuesday accused the U.S. court system of obstructing his administration’s immigration enforcement efforts, specifically targeting judges he labeled as “activist.” In a post on Truth Social, Trump wrote, “Our court system is not letti…",
    "link": "https://biztoc.com/x/3138b4b6067d4bbf",
    "timestamp": "2025-05-07T17:07:47Z"
  },
  {
    "title": "Pulitzer Prize-Winning Outlet Silently Scrubbed ‘China Virus,’ ‘Wuhan Virus’ From Early Pandemic Coverage",
    "description": "The New York Times quietly edited its early articles on the COVID-19 pandemic to scrub the phrases “China virus” and “Wuhan virus,” archived stories show.",
    "link": "https://dailycaller.com/2025/05/07/new-york-times-stealth-edits-early-pandemic-coverage/",
    "timestamp": "2025-05-07T17:06:41Z"
  },
  {
    "title": "Why would Trump’s EPA shut down the successful Energy Star program?",
    "description": "The Trump administration is reportedly ending the uncontroversial Energy Star program, and it's worth appreciating why.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-epa-shut-successful-energy-star-program-rcna205341",
    "timestamp": "2025-05-07T17:06:16Z"
  },
  {
    "title": "Disney to build its 7th theme park, this one in the United Arab Emirates",
    "description": "A real-estate boom has made Dubai a destination as well as a layover.",
    "link": "https://www.bostonherald.com/2025/05/07/disney-united-arab-emirates/",
    "timestamp": "2025-05-07T17:04:15Z"
  },
  {
    "title": "Trump Dealt Massive Blow as Judge Blocks Executive Order on Libraries",
    "description": "Three federal agencies on Donald Trump’s chopping block have been saved by a federal judge.\r\nU.S. District Judge John McConnell Jr. sided with a 21-state coalition Tuesday, issuing a preliminary injunction to halt one of Trump’s executive orders dismantling f…",
    "link": "https://newrepublic.com/post/194967/donald-trump-loss-judge-blocks-executive-order-libraries",
    "timestamp": "2025-05-07T17:03:00Z"
  },
  {
    "title": "Obama Library Update: Foundation Hits Back At Trump Claims",
    "description": "The project's increasing budget has drawn the ire of President Trump, who slammed the construction as \"woke.\"",
    "link": "https://www.newsweek.com/barack-obama-presidential-library-donald-trump-2069149",
    "timestamp": "2025-05-07T17:02:03Z"
  },
  {
    "title": "Biden Crawls Out of Obscurity for BBC Interview — Gets Asked if He ‘Regrets’ Not Dropping Out Sooner (VIDEO)",
    "description": "The interview was Biden's first since leaving the White House in January. Robinson began, \"I can hear your passion. I can here your anxiety that the world is changing the way it has.\".\nThe post Biden Crawls Out of Obscurity for BBC Interview — Gets Asked if H…",
    "link": "https://www.thegatewaypundit.com/2025/05/biden-crawls-obscurity-bbc-interview-gets-asked-if/",
    "timestamp": "2025-05-07T17:00:46Z"
  },
  {
    "title": "Government spent $20k flying former Donald Trump aide, expat New Zealander Chris Liddell to Auckland investment summit",
    "description": "The expat Kiwi was offered a business premium seat from New York.",
    "link": "https://www.nzherald.co.nz/nz/politics/government-spent-20k-flying-former-donald-trump-aide-expat-new-zealander-chris-liddell-to-auckland-investment-summit/3EZIMCVRBVFJLPI5FXRLSJYF2I/",
    "timestamp": "2025-05-07T17:00:00Z"
  },
  {
    "title": "How an India-Pakistan War Could Derail Central Asia’s Future",
    "description": "If India and Pakistan spiral into war, there will be consequences for Central Asia. A war between Pakistan and India would likely have significant ripple effects on Central Asia, given the region's proximity to Afghanistan and flourishing economic ties across…",
    "link": "https://oilprice.com/Geopolitics/Asia/How-an-India-Pakistan-War-Could-Derail-Central-Asias-Future.html",
    "timestamp": "2025-05-07T17:00:00Z"
  },
  {
    "title": "EPA is reportedly killing Energy Star program",
    "description": "The program for energy-efficient home appliances has saved consumers billions in energy costs since its 1992 launch",
    "link": "https://theweek.com/environment/epa-energy-star-eliminated",
    "timestamp": "2025-05-07T16:59:18Z"
  },
  {
    "title": "Discounter Breeze to start flights from Fort Lauderdale",
    "description": "Breeze Airways, a 4-year-old discount carrier, will start flying to Ohio and North Carolina from Fort Lauderdale-Hollywood International Airport in November.",
    "link": "https://www.sun-sentinel.com/2025/05/07/discounter-breeze-to-start-flights-in-november-at-fort-lauderdale-hollywood-international/",
    "timestamp": "2025-05-07T16:58:42Z"
  },
  {
    "title": "Trump Withdraws Sadler Nomination, Taps Industry Veteran Stephen Carmel to Lead MARAD",
    "description": "President Donald Trump has withdrawn the nomination of retired U.S. Navy Captain Brent Sadler and nominated Stephen Carmel of Virginia to be the next Administrator of the U.S. Maritime Administration....",
    "link": "https://gcaptain.com/trump-withdraws-sadler-nomination-taps-industry-veteran-stephen-carmel-to-lead-marad/",
    "timestamp": "2025-05-07T16:57:38Z"
  },
  {
    "title": "The 2024 election is finally over",
    "description": "Republican Jefferson Griffin has conceded the 2024 North Carolina Supreme Court election months after voters last cast their ballots.\nRobert Willett/The News & Observer/Tribune News Service via Getty Images\nSix months later, the 2024 election has ended.\nDonal…",
    "link": "https://biztoc.com/x/b59f4c32b5626079",
    "timestamp": "2025-05-07T16:56:46Z"
  },
  {
    "title": "The old global economic order is dead",
    "description": "China and others must think afresh as the US steps away from its role as balancer of last resort",
    "link": "https://www.irishtimes.com/business/2025/05/07/the-old-global-economic-order-is-dead/",
    "timestamp": "2025-05-07T16:55:45Z"
  },
  {
    "title": "Voice of America will carry One America News programming (Scott Nover/Washington Post)",
    "description": "Scott Nover / Washington Post:\nVoice of America will carry One America News programming  —  Staffers at the government-funded broadcaster condemned the announcement from Kari Lake, given OAN's right-wing slant and support of President Donald Trump.  —  Voice …",
    "link": "https://www.memeorandum.com/250507/p68",
    "timestamp": "2025-05-07T16:55:00Z"
  },
  {
    "title": "Trump designates Thursday as a day for the US to celebrate victory in World War II",
    "description": "President Donald Trump has signed a proclamation designating Thursday as a day for the United States to celebrate victory in World War II as countries in...",
    "link": "https://www.yahoo.com/news/trump-designates-thursday-day-us-165419453.html",
    "timestamp": "2025-05-07T16:54:19Z"
  },
  {
    "title": "Democratic Senator Investigates Trump’s ‘Chilling’ Crypto Ventures",
    "description": "Opposition lawmakers continue to criticize the president’s crypto ambitions.",
    "link": "https://decrypt.co/318358/democratic-senator-investigates-trumps-chilling-crypto-ventures",
    "timestamp": "2025-05-07T16:54:18Z"
  },
  {
    "title": "Potential adoption roadblocks could soon be removed as GOP ramps up pressure: 'Safe, loving homes'",
    "description": "Republican lawmakers are re-introducing legislation to make sure parents seeking to only raise a child of their biological sex do not face extra roadblocks in the adoption and fostering process.",
    "link": "https://www.foxnews.com/politics/potential-adoption-roadblocks-could-soon-be-removed-gop-ramps-up-pressure-safe-loving-homes",
    "timestamp": "2025-05-07T16:53:17Z"
  },
  {
    "title": "Josh Hawley Introduces Law To Ban Mailing Of Abortion Pills, Citing Junk Science Report",
    "description": "It’s unlikely the bill will pass, but it sends a clear message that Republicans are unafraid to use misinformation to ramp up attacks on abortion.",
    "link": "https://www.huffpost.com/entry/josh-hawley-introduces-law-to-ban-mailing-of-abortion-pills-citing-junk-science-report_n_681b808ce4b01488b7bfa2a7",
    "timestamp": "2025-05-07T16:53:04Z"
  },
  {
    "title": "Trump Renames San Francisco Bay 'Gulf Of Criminals'",
    "description": "SAN FRANCISCO, CA — As part of his ongoing crusade to change the name of each body of water in the world, President Donald Trump announced on Wednesday that the San Francisco Bay would now be known as the &#34;Gulf of Criminals.&#34;",
    "link": "https://babylonbee.com/news/trump-renames-san-francisco-bay-gulf-of-criminals",
    "timestamp": "2025-05-07T16:52:46Z"
  },
  {
    "title": "After Marathon Markup, House GOP Advances 'Most Extreme Anti-Environment Bill in American History'",
    "description": "Leading up to and after an early Wednesday morning vote by a key GOP-controlled committee in the U.S. House of Representatives, Democratic lawmakers and conservationists renewed their criticism of \"a corporate polluter's wish list\" that Republicans aim to inc…",
    "link": "https://www.commondreams.org/news/trump-drill-baby-drill",
    "timestamp": "2025-05-07T16:51:33Z"
  },
  {
    "title": "Trump says Trudeau 'wrongly' pushed Russia out of G8 — when Harper was in power",
    "description": "U.S. President Donald Trump said former prime minister Justin Trudeau led the effort to have Russia removed from the G8, even though the decision took place more than a year before Trudeau came to power.",
    "link": "https://www.cbc.ca/news/politics/trump-wrongly-credits-trudeau-russia-g8-removal-1.7528717",
    "timestamp": "2025-05-07T16:50:20Z"
  },
  {
    "title": "A Guy I Once Dated Is Now Famous, And It's As Weird As You'd Imagine",
    "description": "\"He always shows up when I least expect it ― and I really should expect it by now.\"",
    "link": "https://www.huffpost.com/entry/famous-ex-boyfriend-actor-dating_n_681b8e4de4b0e4a3876a84c4",
    "timestamp": "2025-05-07T16:49:16Z"
  },
  {
    "title": "Donald Trump says reinstating Russia into world football could be ‘incentive’ for peace deal with Ukraine",
    "description": "United States president Donald Trump said reinstating Russia into world football could be a \"good incentive\" for them to agree a peace deal with Ukraine.",
    "link": "https://www.independent.ie/sport/soccer/international-soccer/donald-trump-says-reinstating-russia-into-world-football-could-be-incentive-for-peace-deal-with-ukraine/a293162594.html",
    "timestamp": "2025-05-07T16:48:54Z"
  },
  {
    "title": "Talk of Alberta separatism gets sympathy — but not support — from B.C. leaders",
    "description": "Politicians and business leaders in British Columbia say talk of separation in Alberta is an opening for better co-operation between Ottawa and Western provinces, but dividing the country is a step too far",
    "link": "https://www.cbc.ca/news/canada/edmonton/alberta-separatism-pushback-in-b-c-1.7528640",
    "timestamp": "2025-05-07T16:47:07Z"
  },
  {
    "title": "The 2024 election is finally over",
    "description": "After months of legal wrangling, Republican Jefferson Griffin has conceded to Democrat Allison Riggs in the North Carolina Supreme Court race.",
    "link": "https://www.businessinsider.com/2024-election-is-finally-over-2025-5",
    "timestamp": "2025-05-07T16:47:07Z"
  },
  {
    "title": "U.S. and China officials agree on first high-level trade talks since Trump announced tariffs",
    "description": "Top U.S. officials are set to meet with a high-level Chinese delegation this weekend in Switzerland in the first major talks between the two nations since President Donald Trump sparked a trade war with stiff tariffs on imports.\nTreasury Secretary Scott Besse…",
    "link": "https://biztoc.com/x/6e874300d8587948",
    "timestamp": "2025-05-07T16:45:26Z"
  },
  {
    "title": "AI is creeping into every space of our lives, experts caution",
    "description": "Early in Poynter’s community conversation Tuesday night, a visual was displayed for the audience that sparked laughter, amusement and confusion. Here was Jesus Christ, underwater. His eyes were closed, and […]\nThe post AI is creeping into every space of our l…",
    "link": "https://www.poynter.org/fact-checking/2025/generative-aritificial-intelligence-images-growing-threat/",
    "timestamp": "2025-05-07T16:44:25Z"
  },
  {
    "title": "OAN Will Provide News Feed Services to VOA",
    "description": "Kari Lake described the arrangement as an \"enormous benefit\" to U.S. taxpayers, but others dispute the plan.",
    "link": "https://www.adweek.com/tvnewser/oan-voa-news-feed-services-kari-lake/",
    "timestamp": "2025-05-07T16:44:10Z"
  },
  {
    "title": "WeightWatchers Files For Bankruptcy, Plans Pivot To Telehealth",
    "description": "The company has struggled with a heavy debt burden -- and competition from new prescription drugs.",
    "link": "https://www.huffpost.com/entry/weightwatchers-bankruptcy-telehealth_n_681b8aede4b0a7eb6001db34",
    "timestamp": "2025-05-07T16:43:16Z"
  },
  {
    "title": "Why Trump’s plans for tariffs on foreign films probably won’t have a happy ending",
    "description": "Does Hollywood really need Trump to protect it with tariffs?",
    "link": "https://theconversation.com/why-trumps-plans-for-tariffs-on-foreign-films-probably-wont-have-a-happy-ending-256004",
    "timestamp": "2025-05-07T16:42:50Z"
  },
  {
    "title": "Dem Gov Who Suggested JD Vance Family Member Should Be Raped Reportedly Prepping 2028 Run",
    "description": "A Democratic governor who once suggested a family member of Vice President JD Vance should be raped is reportedly prepping for a possible 2028 presidential run.",
    "link": "https://dailycaller.com/2025/05/07/dem-gov-who-suggested-jd-vance-family-member-should-be-raped-reportedly-prepping-2028-run/",
    "timestamp": "2025-05-07T16:41:43Z"
  },
  {
    "title": "Trump administration to announce U.S. will call Persian Gulf the Arabian Gulf during Middle East visit: Report",
    "description": "The name of the body of water has long been a point of contention for many Arab countries.",
    "link": "https://www.cnbc.com/2025/05/07/trump-administration-to-announce-us-will-call-persian-gulf-the-arabian-gulf.html",
    "timestamp": "2025-05-07T16:41:37Z"
  },
  {
    "title": "RFK Jr Gives Update on Autism Research Involving Medicare, Medicaid Members",
    "description": "Researchers will be able to examine datasets to explore patterns, treatment outcomes, and potential causes linked to autism.",
    "link": "https://www.newsweek.com/rfk-autism-medicare-medicaid-data-update-2069186",
    "timestamp": "2025-05-07T16:40:31Z"
  },
  {
    "title": "Supreme Court allows transgender troop ban",
    "description": "The US Supreme Court will let the Trump administration begin executing its ban on transgender military service members",
    "link": "https://theweek.com/politics/supreme-court-transgender-troop-ban",
    "timestamp": "2025-05-07T16:38:07Z"
  },
  {
    "title": "Against college for all: the AFT president",
    "description": "Bryan Alexander, \n\nMay 07, 2025\n\n\n \n \r\nBryan Alexander writes about the \"shattering\" of the \"bipartisan consensus\" that everybody should go to \"college\". I use the quotes because this debate has a uniquely American framing that not only posits giving up on th…",
    "link": "https://bryanalexander.org/k-12/against-college-for-all-the-aft-president/",
    "timestamp": "2025-05-07T16:37:00Z"
  },
  {
    "title": "Why are India and Pakistan on the brink of war and how dangerous is the situation? An expert explains",
    "description": "The conflict between India and Pakistan puts two of the world’s nuclear powers head to head.",
    "link": "https://theconversation.com/why-are-india-and-pakistan-on-the-brink-of-war-and-how-dangerous-is-the-situation-an-expert-explains-256125",
    "timestamp": "2025-05-07T16:36:39Z"
  },
  {
    "title": "Federal judge orders Trump administration to unblock pandemic relief money for schools",
    "description": "A federal judge has mandated the Education Department to reverse its freeze on remaining COVID-19 relief funds for schools. Education Secretary Linda McMahon's decision to accelerate the deadline, citing the pandemic's end, prompted a lawsuit from sixteen sta…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/federal-judge-orders-trump-administration-to-unblock-pandemic-relief-money-for-schools/articleshow/120970952.cms",
    "timestamp": "2025-05-07T16:36:28Z"
  },
  {
    "title": "Pete Hegseth's mistake cost US up to $2.2 million. It caught Pentagon and White House off guard",
    "description": "The Pentagon under Pete Hegseth stopped arms shipments to Ukraine in February without being ordered to do so by Donald Trump. Pete Hegseth reportedly paused military aid to Ukraine without approval from Donald Trump or the White House. The order led US Transp…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-pete-hegseth-mistakenly-stopped-weapons-shipments-to-ukraine-cost-us-up-to-2-2-million-days-after-trump-took-office/articleshow/120970786.cms",
    "timestamp": "2025-05-07T16:36:24Z"
  },
  {
    "title": "Europe is moving to reposition itself in Donald Trump’s new global order",
    "description": "On defence, energy and trade, Europe is now forging new partnerships to become more independent.",
    "link": "https://theconversation.com/europe-is-moving-to-reposition-itself-in-donald-trumps-new-global-order-255344",
    "timestamp": "2025-05-07T16:36:15Z"
  },
  {
    "title": "We Need to Talk About the Worst Generation in American History",
    "description": "I had two experiences over the last weekend that highlight how generational change is going to help make America great again. Driving through Manhattan Beach, a Los Angeles suburb where people have more money than common sense, we passed a crew of elderly boo…",
    "link": "https://freerepublic.com/focus/f-news/4315558/posts",
    "timestamp": "2025-05-07T16:35:31Z"
  },
  {
    "title": "Vice President Vance's half-brother advances in race to become Cincinnati's mayor",
    "description": "Cory Bowman, who shares a father with Vance, says he was inspired to enter the race after his half-brother's inauguration. A Republican last ran for Cincinnati mayor, unsuccessfully, in 2009.",
    "link": "https://www.npr.org/2025/05/07/nx-s1-5389536/vance-brother-cory-bowman-cincinnati-mayor",
    "timestamp": "2025-05-07T16:35:10Z"
  },
  {
    "title": "Why Trump fails to understand China’s trade war tactics, and what his negotiators should be reading",
    "description": "US diplomats may do well to read some Chinese history to understand Beijing’s tactics in any trade talks.",
    "link": "https://theconversation.com/why-trump-fails-to-understand-chinas-trade-war-tactics-and-what-his-negotiators-should-be-reading-256126",
    "timestamp": "2025-05-07T16:34:39Z"
  },
  {
    "title": "Federal judge orders Trump administration to unblock pandemic relief money for schools",
    "description": "The federal government provided $189 billion in aid for schools during the COVID-19 pandemic.",
    "link": "https://www.bostonherald.com/2025/05/07/education-pandemic-aid-money/",
    "timestamp": "2025-05-07T16:33:57Z"
  },
  {
    "title": "Federal judge orders Trump administration to unblock pandemic relief money for schools",
    "description": "The federal government provided $189 billion in aid for schools during the COVID-19 pandemic.",
    "link": "https://www.denverpost.com/2025/05/07/education-pandemic-aid-money/",
    "timestamp": "2025-05-07T16:33:57Z"
  },
  {
    "title": "China's Xi arrives in Moscow in show of support for Putin after Ukrainian drones target capital",
    "description": "President Xi Jinping's visit to Moscow occurs amidst escalating tensions, highlighted by Ukrainian drone attacks on the Russian capital. Xi's presence at the World War Two commemoration parade offers Putin a significant diplomatic boost, showcasing a united f…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/chinas-xi-arrives-in-moscow-in-show-of-support-for-putin-after-ukrainian-drones-target-capital/articleshow/120970874.cms",
    "timestamp": "2025-05-07T16:33:04Z"
  },
  {
    "title": "The SCOTUS Decision to Allow Trump's Ban on Trans Service Members Is Profoundly Inhumane",
    "description": "It also does not bode well for the future of 'Obergefell.'",
    "link": "https://www.esquire.com/news-politics/politics/a64701930/scotus-trump-transgender-ban-military-passes/",
    "timestamp": "2025-05-07T16:33:00Z"
  },
  {
    "title": "Yet Again, The Data Shows Migrants Are More Law-Abiding Than US Citizens",
    "description": "This has always been the truth. And it has always been ignored by people like Donald Trump, who combine if it bleeds, it leads media narratives with the always-exploitable fear of others. Whether a migrant is in this country legally or illegally, the odds of …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177368915",
    "timestamp": "2025-05-07T16:32:50Z"
  },
  {
    "title": "How You Can Help Stop Big Tech Censorship",
    "description": "The Trump administration has vowed to root out Big Tech censorship that was openly practiced under former President Joe Biden. In 2021, Biden administration press secretary Jen... Read More\nThe post How You Can Help Stop Big Tech Censorship appeared first on …",
    "link": "https://www.dailysignal.com/2025/05/07/how-you-can-help-stop-big-tech-censorship/",
    "timestamp": "2025-05-07T16:32:00Z"
  },
  {
    "title": "How the Met Gala Discourse Shifted Under Trump",
    "description": "Following fashion's biggest night, the internet has taken a different approach to the Gala.",
    "link": "https://www.newsweek.com/how-met-gala-discourse-shifted-under-trump-arts-funding-2069143",
    "timestamp": "2025-05-07T16:31:55Z"
  },
  {
    "title": "North Carolina GOP Judge Finally Concedes After Six-Month Effort to Steal Election Fails",
    "description": "Six months after the November election, Republican state supreme court candidate Jefferson Griffin finally conceded to Democratic Justice Allison Riggs on Wednesday after his unprecedented effort to throw out thousands of votes and overturn Riggs’ win was rej…",
    "link": "https://www.motherjones.com/politics/2025/05/gop-judge-jefferson-griffin-concedes-north-carolina-supreme-court-race-allison-riggs/",
    "timestamp": "2025-05-07T16:31:39Z"
  },
  {
    "title": "Yet Again, The Data Shows Migrants Are More Law-Abiding Than US Citizens",
    "description": "This has always been the truth. And it has always been ignored by people like Donald Trump, who combine “if it bleeds, it leads” media narratives with the always-exploitable fear of “others.” Whether a migrant is in this country legally or illegally, the odds…",
    "link": "https://www.techdirt.com/2025/05/07/yet-again-the-data-shows-migrants-are-more-law-abiding-than-us-citizens/",
    "timestamp": "2025-05-07T16:31:24Z"
  },
  {
    "title": "Pam Bondi Blaming Epstein Files Release Delay on 'Tens of Thousands of Videos' Exasperates Users: 'Yet Still No Arrests'",
    "description": "Attorney General Pam Bondi's explanation that the FBI is still reviewing tens of thousands of Epstein-related videos has done little to quell public outrage.",
    "link": "https://www.ibtimes.com/pam-bondi-blaming-epstein-files-release-delay-tens-thousands-videos-exasperates-users-yet-3772818",
    "timestamp": "2025-05-07T16:31:08Z"
  },
  {
    "title": "Pam Bondi reveals new excuse for not releasing Jeffrey Epstein files",
    "description": "Attorney General Pam Bondi offered another excuse this week for the delay in releasing files related to wealthy sex trafficker Jeffrey Epstein.Over two months after Bondi initially claimed she was releasing the Epstein documents, the attorney general was aske…",
    "link": "https://www.rawstory.com/bondi-epstein-files/",
    "timestamp": "2025-05-07T16:31:01Z"
  },
  {
    "title": "Trump’s Kennedy Center CEO Attacks Lin-Manuel Miranda And “America’s Got Talent”",
    "description": "Ric Grenell complained after Monday’s episode revealed that Miranda, who has declined to perform at the venue after its Trump-led makeover, will be mentoring contestants in the lead-up to the Season 23 finale later this month. – The Daily Beast",
    "link": "https://www.thedailybeast.com/trumps-kennedy-center-head-throws-hissy-fit-at-lin-manuel-miranda/",
    "timestamp": "2025-05-07T16:31:00Z"
  },
  {
    "title": "Ivanka Trump's Bodyguard Shoves Man In Viral Video, Internet Divided",
    "description": "The clip shows Ivanka Trump walking hand-in-hand with her husband, Jared Kushner, as they exit an event and head to their car.",
    "link": "https://www.ndtv.com/world-news/ivanka-trumps-bodyguard-shoves-man-in-viral-video-internet-divided-8356555",
    "timestamp": "2025-05-07T16:30:59Z"
  },
  {
    "title": "Car dealerships see thinner lots as auto tariffs sink in",
    "description": "Auto dealers, squeezed by Trump’s tariffs, are already seeing a tighter supply of vehicles to offer buyers at a time when sticker prices are set to climb.",
    "link": "https://www.nbcnews.com/business/autos/car-dealerships-see-thinner-lots-auto-tariffs-sink-rcna205194",
    "timestamp": "2025-05-07T16:30:41Z"
  },
  {
    "title": "Fed Expected to Hold Interest Rates Steady",
    "description": "\"The Federal Reserve on Wednesday is set to announce its first decision on the level of interest rates since President Donald Trump last month intensified calls for lower borrowing costs and voiced eagerness about the",
    "link": "https://politicalwire.com/2025/05/07/fed-expected-to-hold-interest-rates-steady/",
    "timestamp": "2025-05-07T16:30:01Z"
  },
  {
    "title": "Energy Transfer Aims for FID on Lake Charles LNG Project by End-2025",
    "description": "Energy Transfer is targeting a final investment decision on its Lake Charles LNG export project in Louisiana by the end of the year as it is progressing with contracting LNG offtake volumes, the U.S. pipeline giant said during the Q1 earnings call. Energy Tra…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Energy-Transfer-Aims-for-FID-on-Lake-Charles-LNG-Project-by-End-2025.html",
    "timestamp": "2025-05-07T16:30:00Z"
  },
  {
    "title": "GOP Plans To Cut Medicaid Would Kick Millions Off Health Insurance, New Analysis Says",
    "description": "An authoritative analysis by Congressional Budget Office is House Speaker Mike Johnson's latest headache.",
    "link": "https://www.huffpost.com/entry/cbo-medicaid-cuts-fmap-reduction_n_681b76fee4b0c2b15d971fc0",
    "timestamp": "2025-05-07T16:29:37Z"
  },
  {
    "title": "Victory Day for World War II, 2025",
    "description": "BY THE PRESIDENT OF THE UNITED STATES OF AMERICA A PROCLAMATION Today, our Nation proudly commemorates the 80th anniversary of the Allied Powers’ triumph over national socialism and fascism, and the end of World War II in Europe — one of the most epic victori…",
    "link": "https://freerepublic.com/focus/f-chat/4315556/posts",
    "timestamp": "2025-05-07T16:26:06Z"
  },
  {
    "title": "The U.S. Navy Lost a Second $60 Million Fighter Jet in the Ocean",
    "description": "You read that right. The second one.",
    "link": "https://gizmodo.com/the-u-s-navy-lost-a-second-60-million-fighter-jet-in-the-ocean-2000599065",
    "timestamp": "2025-05-07T16:25:13Z"
  },
  {
    "title": "ROOKE: There’s A Massive Donkey Blocking Democrats’ New Plan To Attack Trump",
    "description": "Instead of dealing with the hard truths, Democrats found another way to go after President Donald Trump and his family.",
    "link": "https://dailycaller.com/2025/05/07/rooke-murphy-trump-meme-act-pelosi/",
    "timestamp": "2025-05-07T16:24:04Z"
  },
  {
    "title": "A currency-market ‘avalanche’ is heading for the U.S. dollar, and the tremors started this week",
    "description": "Investors are right to be concerned that the wild swings in the global currency market seen over the past few days could portend more pain for the U.S...",
    "link": "https://www.marketwatch.com/story/a-currency-market-avalanche-is-heading-for-the-u-s-dollar-and-the-tremors-started-this-week-93c8d7ec",
    "timestamp": "2025-05-07T16:22:00Z"
  },
  {
    "title": "Federal judge says Libya deportation flight could violate prior court order | CNN Politics",
    "description": "The Trump administration is moving forward with plans to transport a group of undocumented immigrants to Libya on a US military plane, an administration official told CNN.",
    "link": "https://www.cnn.com/2025/05/07/politics/trump-immigrants-libya-transport",
    "timestamp": "2025-05-07T16:21:55Z"
  },
  {
    "title": "Libyan authorities reject report they will take in US deportees",
    "description": "The Trump administration has sought agreements allowing it to send immigrants to third countries for detention.",
    "link": "https://www.aljazeera.com/news/2025/5/7/libyan-authorities-reject-report-they-will-take-in-us-deportees",
    "timestamp": "2025-05-07T16:21:46Z"
  },
  {
    "title": "Conservative Ex-Fox News Editor Slams Trump’s MAGA Base: ‘They Think That Winning Is for Losers’",
    "description": "Chris Stirewalt called out President Donald Trump's base in a recent appearance on The Remnant with Jonah Goldberg, arguing they won't let the GOP win.\nThe post Conservative Ex-Fox News Editor Slams Trump’s MAGA Base: ‘They Think That Winning Is for Losers’ f…",
    "link": "https://www.mediaite.com/news/conservative-commentator-slams-trumps-maga-base-they-think-that-winning-is-for-losers/",
    "timestamp": "2025-05-07T16:19:42Z"
  },
  {
    "title": "House Republicans push to sell thousands of acres of public lands in the West",
    "description": "The plan would sell thousands of acres of public lands in Nevada and Utah",
    "link": "https://www.bostonherald.com/2025/05/07/congress-public-lands/",
    "timestamp": "2025-05-07T16:19:26Z"
  },
  {
    "title": "House Republicans push to sell thousands of acres of public lands in the West",
    "description": "The plan would sell thousands of acres of public lands in Nevada and Utah",
    "link": "https://www.denverpost.com/2025/05/07/congress-public-lands/",
    "timestamp": "2025-05-07T16:19:26Z"
  },
  {
    "title": "GOP candidate concedes long-unsettled NC court election to Democratic incumbent",
    "description": "A federal judge ruled that potentially thousands of disputed ballots challenged by Jefferson Griffin must remain in the final tally.",
    "link": "https://www.pbs.org/newshour/politics/gop-candidate-concedes-long-unsettled-nc-court-election-to-democratic-incumbent",
    "timestamp": "2025-05-07T16:17:32Z"
  },
  {
    "title": "New poll shows nearly half of Gazans would leave if given opportunity",
    "description": "A new survey conducted by the Palestinian Center for Policy and Survey Research shows that over half of Gazans would leave if given opportunity",
    "link": "https://nypost.com/2025/05/07/world-news/new-poll-shows-nearly-half-of-gazans-would-leave-if-given-opportunity/",
    "timestamp": "2025-05-07T16:15:13Z"
  },
  {
    "title": "Fed Interest Rate Decision Comes Today—Don’t Expect A Rate Cut Despite Trump’s Demands",
    "description": "Fed Chairman Jerome Powell will talk to reporters Wednesday as Trump deems him a “major loser” and a “total stiff.”",
    "link": "https://www.forbes.com/sites/dereksaul/2025/05/07/fed-interest-rate-decision-comes--today-dont-expect-a-rate-cut-despite-trumps-demands/",
    "timestamp": "2025-05-07T16:14:58Z"
  },
  {
    "title": "Trump memecoin dinner attendees could include foreign nationals — Report",
    "description": "At least some of the top holders of Donald Trump’s memecoin who apply to attend a private dinner with the president could be based outside the United States.According to a May 7 Bloomberg report based on an analysis of the top TRUMP tokenholders, 19 of the to…",
    "link": "https://cointelegraph.com/news/donald-trump-memecoin-dinner-foreign",
    "timestamp": "2025-05-07T16:14:30Z"
  },
  {
    "title": "Canadian PM asks Trump to rein in his taunts",
    "description": "Mark Carney has requested the US president stop referring to his country as the 51st state during a White House meeting Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616973-canada-pm-trump-taunts/",
    "timestamp": "2025-05-07T16:12:57Z"
  },
  {
    "title": "Biden Defends Decision To Run Again Despite Age Concerns: I Was ‘So Successful’ It Was ‘Difficult To Walk Away’",
    "description": "Former president Joe Biden, 82, offered a semi-coherent defense of his decision to seek reelection in his first sit-down interview since leaving office in disgrace. \"What happened was, I had become what we set out to do, no one thought we could do, and become…",
    "link": "https://freebeacon.com/democrats/biden-defends-decision-to-run-again-despite-age-concerns-i-was-so-successful-it-was-difficult-to-walk-away/",
    "timestamp": "2025-05-07T16:11:39Z"
  },
  {
    "title": "Trump Keeps Doing Sh*t Nobody Voted For, Like Eliminating 'PBS Kids'",
    "description": "Kids' programming on PBS defunded, once again illegally.",
    "link": "https://www.wonkette.com/p/trump-keeps-doing-sht-nobody-voted",
    "timestamp": "2025-05-07T16:10:03Z"
  },
  {
    "title": "EU Trade Chief Says Accelerating Free Trade Talks With Asia",
    "description": "The European Union is accelerating free trade talks with Asia following hefty tariffs by US President Donald Trump, the bloc's trade chief said Wednesday.",
    "link": "https://www.ibtimes.com/eu-trade-chief-says-accelerating-free-trade-talks-asia-3772810",
    "timestamp": "2025-05-07T16:06:20Z"
  },
  {
    "title": "US-Houthi Ceasefire Deal Does Not Include Israel",
    "description": "A ceasefire deal between Yemen's Houthis and the U.S. does not include sparing Israel, the group said on Wednesday, suggesting its shipping attacks that have disrupted global trade and challenged world powers will not come to a complete halt.",
    "link": "https://gcaptain.com/us-houthi-ceasefire-deal-does-not-include-israel/",
    "timestamp": "2025-05-07T16:05:39Z"
  },
  {
    "title": "Kristi Noem Seeks Death Penalty After Boat Capsizes Near US Border",
    "description": "Homeland Secretary speaks out after at least three are killed, including a 14-year-old boy, in alleged human trafficking operation.",
    "link": "https://www.newsweek.com/kristi-noem-death-penalty-boat-capsizes-2069070",
    "timestamp": "2025-05-07T16:05:17Z"
  },
  {
    "title": "U.S. as the 11th province could be 'the best thing': Shatner jokingly makes a counter-offer to Trump",
    "description": "&#34I’ve dealt a little in real estate and I’m going to say to Carney, 'Do a real estate deal. Make a counter offer,'&#34 says Shatner.",
    "link": "https://nationalpost.com/news/canada/11th-province-william-shatner-trump-carney",
    "timestamp": "2025-05-07T16:04:57Z"
  },
  {
    "title": "US appeals court orders Rümeysa Öztürk transferred to Vermont",
    "description": "A federal appeals court on Wednesday ordered detained Turkish doctoral student Rumeysa Öztürk transferred to a court in Vermont in a blow to the Trump administration as it seeks to deport her for her pro-Palestinian speech.",
    "link": "https://www.hurriyetdailynews.com/us-appeals-court-orders-rumeysa-ozturk-transferred-to-vermont-208917",
    "timestamp": "2025-05-07T16:03:47Z"
  },
  {
    "title": "Houthi-Held Ras Isa Port Becomes New Flashpoint in Red Sea Shipping Crisis",
    "description": "Seafarers at Yemen’s Ras Isa Port face escalating safety concerns amid reports of vessels being forcibly detained and armed confrontations, according to maritime authorities. “I am deeply concerned by the...",
    "link": "https://gcaptain.com/houthi-held-ras-isa-port-becomes-new-flashpoint-in-red-sea-shipping-crisis/",
    "timestamp": "2025-05-07T16:03:17Z"
  },
  {
    "title": "Israeli airstrikes 'kill 48 in Gaza'",
    "description": "At least 48 people have been killed in Gaza following a series of Israeli airstrikes, according to local health officials.",
    "link": "https://news.sky.com/story/israeli-airstrikes-kill-48-and-injure-dozens-in-gaza-city-say-palestinian-health-officials-13363448",
    "timestamp": "2025-05-07T16:03:00Z"
  },
  {
    "title": "Colbert calls out CBS parent company pressuring '60 Minutes'",
    "description": "\"Late Show\" host Stephen Colbert called out his employer, CBS parent company Paramount, on Tuesday over reports its owner pressured the network to avoid tough Trump stories.",
    "link": "https://www.foxnews.com/media/colbert-calls-out-cbs-parent-company-pressuring-60-minutes",
    "timestamp": "2025-05-07T16:02:38Z"
  },
  {
    "title": "EU trade chief says accelerating free trade talks with Asia",
    "description": "The European Union is accelerating free trade talks with Asia following hefty tariffs by US President Donald Trump, the bloc’s trade chief said Wednesday. Trump has slapped a series of higher tariffs on Europe since March and in his biggest move, he imposed a…",
    "link": "https://www.digitaljournal.com/world/eu-trade-chief-says-accelerating-free-trade-talks-with-asia/article",
    "timestamp": "2025-05-07T16:02:20Z"
  },
  {
    "title": "Mike Johnson Brushes Off Trump’s ‘I Don’t Know’ About Upholding the Constitution Comment: He Isn’t ‘Expected to be an Expert’",
    "description": "Johnson replied with a question of his own, “Is the President expected to be an expert on all of the Supreme Court cases? I don’t think so.”\nThe post Mike Johnson Brushes Off Trump’s ‘I Don’t Know’ About Upholding the Constitution Comment: He Isn’t ‘Expected …",
    "link": "https://www.mediaite.com/politics/mike-johnson-brushes-off-trumps-i-dont-know-about-upholding-the-constitution-comment-he-isnt-expected-to-be-an-expert/",
    "timestamp": "2025-05-07T16:01:21Z"
  },
  {
    "title": "20 attorneys general ask federal judge to reverse deep cuts to US Health and Human Services",
    "description": "Attorneys general in 19 states and Washington, D.C., are challenging cuts to the U.S. Health and Human Services agency.",
    "link": "https://www.wbko.com/2025/05/07/20-attorneys-general-ask-federal-judge-reverse-deep-cuts-us-health-human-services/",
    "timestamp": "2025-05-07T16:01:05Z"
  },
  {
    "title": "China Reacts to Trump Claims About 'Suffering' Chinese Economy",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nBeijing has pushed back against U.S. President Donald Trump's claims that its economy is \"suffering greatly\" under American tariffs.\n\"No external shock can change the fundamentals of China's stable economic fo…",
    "link": "https://biztoc.com/x/715051d3ac39ae8a",
    "timestamp": "2025-05-07T16:01:02Z"
  },
  {
    "title": "EU readies $114B worth of tariffs including Boeing, US-made cars if trade talks with Trump fail: report",
    "description": "The European Union is preparing to impose tariffs on Boeing aircraft and American-made cars as part of a sweeping response to the Trump administration’s levies on imports from the Continent if ongoing trade talks fail to ease mounting transatlantic tensions, …",
    "link": "https://nypost.com/2025/05/07/business/eu-readies-114b-worth-of-tariffs-on-boeing-us-made-cars/",
    "timestamp": "2025-05-07T16:00:49Z"
  },
  {
    "title": "What Is the Risk of a Conflict Spiral Between India and Pakistan?",
    "description": "Officials in New Delhi and Islamabad have remained sanguine, but there is still reason to fear extreme escalation.",
    "link": "http://foreignpolicy.com/2025/05/07/india-pakistan-strike-conflict-spiral-kashmir/",
    "timestamp": "2025-05-07T16:00:39Z"
  },
  {
    "title": "U. Chicago Prof Cancels Midterm, Tells Students to Join Anti-Trump Protest Instead",
    "description": "\"As a small contribution to this day of action I am cancelling the midterm and calling you, if you are able, to join the Chicago demonstration\"\nThe post U. Chicago Prof Cancels Midterm, Tells Students to Join Anti-Trump Protest Instead first appeared on Le·ga…",
    "link": "https://legalinsurrection.com/2025/05/u-chicago-prof-cancels-midterm-tells-students-to-join-anti-trump-protest-instead/",
    "timestamp": "2025-05-07T16:00:37Z"
  },
  {
    "title": "Trump planning to change how US refers to Persian Gulf | CNN Politics",
    "description": "President Donald Trump is making plans for the United States to begin referring to the Persian Gulf as the Gulf of Arabia or the Arabian Gulf, two administration officials familiar with the discussions told CNN.",
    "link": "https://www.cnn.com/2025/05/07/politics/trump-persian-gulf-change",
    "timestamp": "2025-05-07T16:00:05Z"
  },
  {
    "title": "‘We will be cautious with US tariffs’",
    "description": "PETALING JAYA: Malaysia will adopt a cautious and prudent approach in addressing the tariff issue concerning the United States, says Prime Minister Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/05/08/we-will-be-cautious-with-us-tariffs",
    "timestamp": "2025-05-07T16:00:00Z"
  }
]