[
  {
    "title": "Trump's migration stance overshadowed ties with Pope Francis",
    "description": "After Pope Francis' death, President Trump ordered flags lowered. This action contrasts with their past disagreements. Trump will attend the funeral in Rome with his wife. He praised the Pope, despite earlier clashes over immigration. Their differences began …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-migration-stance-overshadowed-ties-with-pope-francis/articleshow/120618045.cms",
    "timestamp": "2025-04-25T11:21:30Z"
  },
  {
    "title": "Trump and Zelenskyy among dignitaries converging on Rome for funeral of Pope Francis",
    "description": "U.S. President Donald Trump and Argentine President Javier Milei are among the leaders arriving Friday.",
    "link": "https://www.bostonherald.com/2025/04/25/vatican-pope-trump-zelenskyy-attendees/",
    "timestamp": "2025-04-25T11:20:54Z"
  },
  {
    "title": "Russia kills 5 people in Ukraine as US envoy Witkoff arrives in Moscow",
    "description": "Lavrov says US-proposed peace deal with Ukraine moving in the right direction, but requires adjustments.",
    "link": "https://www.aljazeera.com/news/2025/4/25/russian-drone-attack-kills-five-in-ukraine-including-child",
    "timestamp": "2025-04-25T11:20:18Z"
  },
  {
    "title": "Ukraine may have to cede land ‘temporarily’ for peace: Kiev mayor",
    "description": "Ukraine may have to cede territory in order to secure \"temporary\" peace with Russia, Kiev mayor Vitali Klitschko told the BBC in an interview published on April 24.",
    "link": "https://www.hurriyetdailynews.com/ukraine-may-have-to-cede-land-temporarily-for-peace-kiev-mayor-208470",
    "timestamp": "2025-04-25T11:18:37Z"
  },
  {
    "title": "FIRST READING: Analysts predict loonie to rally in case of Conservative win",
    "description": "Assumption is that trade war would wrap up sooner under Poilievre",
    "link": "https://nationalpost.com/opinion/analysts-predict-loonie-to-rally-in-case-of-conservative-win",
    "timestamp": "2025-04-25T11:14:35Z"
  },
  {
    "title": "US-Iran nuclear talks explained | Start Here",
    "description": "Trump, Iran and everything you need to know about the nuclear talks.",
    "link": "https://www.aljazeera.com/program/start-here/2025/4/25/us-iran-nuclear-talks-explained-start-here",
    "timestamp": "2025-04-25T11:14:02Z"
  },
  {
    "title": "Higher tariffs could keep a stockpile of unused products and fears over Medicaid funding: Morning Rundown",
    "description": "Companies warn stores could see far less stocked shelves unless Trump changes his tune on tariffs. A woman worries that potential cuts to Medicaid would threaten life-saving treatments for her son. And a polarizing NFL prospect remains on the board for the dr…",
    "link": "https://www.nbcnews.com/news/us-news/higher-tariffs-keep-stockpile-unused-products-fears-medicaid-funding-m-rcna202939",
    "timestamp": "2025-04-25T11:13:52Z"
  },
  {
    "title": "Ukraine says Russia kills 3 in another drone attack after Trump rebukes Putin",
    "description": "The strike happened one day after US President Donald Trump rebuked Russia’s leader for a deadly missile and drone attack on Kyiv.",
    "link": "https://nypost.com/2025/04/25/world-news/ukraine-says-russia-kills-3-in-another-drone-attack-after-trump-rebukes-putin/",
    "timestamp": "2025-04-25T11:13:42Z"
  },
  {
    "title": "Brandon Johnson: Tariffs Are Costing City, I Want to Raise Taxes",
    "description": "During an interview with WVON on Thursday, Chicago Mayor Brandon Johnson said “the fluctuations of the market and Trump’s tariffs” have resulted in massive losses to the city “just because of the uncertainty and the chaos.” And also stated that\nThe post Brand…",
    "link": "https://www.breitbart.com/clips/2025/04/25/brandon-johnson-tariffs-are-costing-city-i-want-to-raise-taxes/",
    "timestamp": "2025-04-25T11:11:18Z"
  },
  {
    "title": "Trump Just Pardoned One Of The Worst Fraudsters Imaginable",
    "description": "When Conover Kennard wrote about Fiore’s conviction on all seven counts of her federal fraud case (each of which could lead to 20 years in prison), we learned that Fiore spent the money donors thought would go to the memorial on “rent, plastic surgery, and he…",
    "link": "https://crooksandliars.com/2025/04/trump-just-pardoned-one-worst-fraudsters",
    "timestamp": "2025-04-25T11:10:35Z"
  },
  {
    "title": "Boeing will find it ‘relatively easy’ to find customers for China’s rejected planes, says jet leasing CEO",
    "description": "China’s refusal to accept Boeing planes has become one of the most visible flashpoints of the U.S.-China trade war. Beijing has even sent planes assembled in China back to the U.S. as it retaliates against steep tariffs imposed by President Donald Trump. \nBoe…",
    "link": "https://biztoc.com/x/e8f432744ac828a3",
    "timestamp": "2025-04-25T11:08:31Z"
  },
  {
    "title": "Trump: I didn't stop Israel from striking Iran's nuclear sites",
    "description": "United States President Donald Trump said in a Time magazine interview published on Friday that he didn't stop Israel from hitting Iran's nuclear sites, but did make it uncomfortable for them to do so...",
    "link": "https://biztoc.com/x/271e511f5098d6e5",
    "timestamp": "2025-04-25T11:08:08Z"
  },
  {
    "title": "Steve Rattner: Trump is 'desperate' to show progress on tariffs",
    "description": "China on Thursday directly contradicted President Donald Trump’s claims that Beijing and Washington are actively discussing resolutions to a trade war that threatens to upend the global economy. The Morning Joe panel discusses.",
    "link": "https://biztoc.com/x/9c24b3636bb87711",
    "timestamp": "2025-04-25T11:08:03Z"
  },
  {
    "title": "Poll slump shows Trump honeymoon period is over",
    "description": "Donald Trump’s honeymoon period is over — if it ever existed at all.",
    "link": "https://www.independent.ie/world-news/poll-slump-shows-trump-honeymoon-period-is-over/a1200445310.html",
    "timestamp": "2025-04-25T11:07:59Z"
  },
  {
    "title": "Steve Bannon Makes Bold Prediction About Karoline Leavitt’s Future",
    "description": "Steve Bannon offered the bullish prediction that White House Press Secretary Karoline Leavitt won’t be behind the podium for long and that President Donald Trump may offer her a major cabinet position. “After she’s spokesman for a year or two, I think she’s g…",
    "link": "https://www.mediaite.com/news/steve-bannon-makes-bold-prediction-about-karoline-leavitts-future/",
    "timestamp": "2025-04-25T11:06:57Z"
  },
  {
    "title": "Trump Orders Probe Into Democratic Fundraising Platform ActBlue; Bondi To Report Findings Within 180 Days",
    "description": "ActBlue said it will pursue all legal options to protect and defend itself.",
    "link": "https://www.ibtimes.com/trump-orders-probe-democratic-fundraising-platform-actblue-bondi-report-findings-within-180-days-3771357",
    "timestamp": "2025-04-25T11:05:01Z"
  },
  {
    "title": "Can Germany ditch its 1 and 2-cent coins?",
    "description": "Many countries have dropped low-denomination coins in the past. But can cash-loving Germany follow suit and stop accepting the smallest euro coins? Other European nations are showing the way.",
    "link": "https://www.dw.com/en/cash-hoarding-can-germany-ditch-its-billions-of-1-and-2-cent-coins/a-72216366",
    "timestamp": "2025-04-25T11:02:00Z"
  },
  {
    "title": "'Authoritarianism in Action': Trump Orders DOJ Probe of Democratic Donation Platform ActBlue",
    "description": "U.S. President Donald Trump on Thursday launched his latest attack on political opponents by directing the Justice Department to investigate ActBlue, a critical fundraising platform for Democrats and progressive organizations.\n\nThe order came in the form of a…",
    "link": "https://www.commondreams.org/news/donald-trump-actblue",
    "timestamp": "2025-04-25T11:01:01Z"
  },
  {
    "title": "The Drivers (and Passengers) of Trump’s Foreign Policy",
    "description": "Who has been front and center and who has been sidelined in the administration during the U.S. president’s first 100 days.",
    "link": "http://foreignpolicy.com/2025/04/25/trump-100-days-influential-officials-navarro-bessent-witkoff/",
    "timestamp": "2025-04-25T11:00:38Z"
  },
  {
    "title": "CEOs stay mum but quietly fear Trump won’t pull off ‘Art of the Deal’ in trade war",
    "description": "Job losses targeting the very people Trump considers his base — Middle America -- are very much in the cards.",
    "link": "https://nypost.com/2025/04/25/business/ceos-stay-mum-but-quietly-fear-trump-wont-pull-off-art-of-the-deal-in-trade-war/",
    "timestamp": "2025-04-25T11:00:00Z"
  },
  {
    "title": "What Fiction Can Predict, and What It Can’t",
    "description": "Imagine a surveillance state powerful enough to incarcerate people for the wrong dreams. In 2025, it doesn’t feel like such a leap.",
    "link": "https://www.theatlantic.com/books/archive/2025/04/laila-lalami-what-fiction-can-and-cant-predict/682575/",
    "timestamp": "2025-04-25T11:00:00Z"
  },
  {
    "title": "Transgender comedian cancels U.S. tour stops because of new gender policies",
    "description": "A comedian stopping in Saskatoon and a Regina art gallery CEO talk about their experience with U.S. visa and passport changes and delays.",
    "link": "https://www.cbc.ca/news/canada/saskatoon/transgender-comedian-cancels-u-s-tour-stops-because-of-new-gender-policies-1.7518066",
    "timestamp": "2025-04-25T11:00:00Z"
  },
  {
    "title": "Uncertainty blankets Metro Vancouver as Liberals gain traction in historically NDP, Conservative ridings",
    "description": "A couple of weeks ago, the polls were showing the potential that the Liberals may win every seat in the Metro Vancouver area. As of April 24, the region's leanings aren't quite as clear; 338.com data shows a toss up in several ridings.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/metro-vancouver-election-ridings-uncertainty-1.7517743",
    "timestamp": "2025-04-25T11:00:00Z"
  },
  {
    "title": "The cop who didn’t shoot Trump",
    "description": "Planning a secret government assassination requires careful coordination, attention to detail, and tight-lipped secrecy, to mention nothing of ingenuity, resolve, and a cold-hearted view of politicians and humanity.\nPresident Donald Trump\r\n recently issued an…",
    "link": "https://www.dailydot.com/debug/deplatformed-the-cop-who-didnt-shoot-trump/",
    "timestamp": "2025-04-25T11:00:00Z"
  },
  {
    "title": "Russian general killed in Moscow car blast on day of Trump envoy visit",
    "description": "Lt Gen Yaroslav Moskalik named as victim of explosion that appears similar to previous attacks claimed by Ukraine",
    "link": "https://www.yahoo.com/news/russian-general-killed-car-blast-105933866.html",
    "timestamp": "2025-04-25T10:59:33Z"
  },
  {
    "title": "How a Professional Bully Is Winning Control of the Media",
    "description": "U.S. President Donald Trump is following the authoritarian’s handbook that Prime Minister Viktor Orbán used to consolidate power in Hungary. He is attacking the independent institutions that comprise the infrastructure supporting democracy—universities, law f…",
    "link": "https://www.commondreams.org/opinion/trump-controls-media",
    "timestamp": "2025-04-25T10:58:03Z"
  },
  {
    "title": "How To Tariff-Proof Your Finances",
    "description": "Tariffs are impacting American households but there are steps you can take to mitigate their impact.",
    "link": "https://www.forbes.com/sites/jimwang/2025/04/25/how-to-tariff-proof-your-finances/",
    "timestamp": "2025-04-25T10:57:55Z"
  },
  {
    "title": "Trump: I didn't stop Israel from striking Iran",
    "description": "United States President Donald Trump said in a Time magazine interview published on Friday that he didn't stop Israel from hitting Iran's nuclear sites, but did make it uncomfortable for them to do so...",
    "link": "https://biztoc.com/x/220cc6640c3db229",
    "timestamp": "2025-04-25T10:57:14Z"
  },
  {
    "title": "Trump Says Xi Called Him, China Trade Talks Active: Report",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump reportedly said China's President Xi Jinping had called him, and there are active talks to strike a trade deal.\nTime reported that he made the comments during an interview on Tuesday, Ap…",
    "link": "https://biztoc.com/x/92501d0510a32a70",
    "timestamp": "2025-04-25T10:57:03Z"
  },
  {
    "title": "Crimea Will Remain Part of Russia Under Settlement Deal on Ukraine - Trump",
    "description": "MOSCOW (Sputnik) - Crimea will remain a part of Russia as part of the settlement deal in Ukraine, US President Donald Trump told TIME magazine in his \"100 days\" interview.",
    "link": "https://sputnikglobe.com/20250425/crimea-will-remain-part-of-russia-under-settlement-deal-on-ukraine---trump-1121931188.html",
    "timestamp": "2025-04-25T10:56:23Z"
  },
  {
    "title": "‘Bitcoin Jesus’ Pays Trump Ally Roger Stone $600,000 to Lobby Against Exit Tax",
    "description": "Roger Ver has hired Trump confidant Roger Stone to lobby against the U.S. “exit tax” tied to his federal tax evasion charges.",
    "link": "https://decrypt.co/316387/bitcoin-jesus-pays-trump-ally-roger-stone-600000-to-lobby-against-exit-tax",
    "timestamp": "2025-04-25T10:53:57Z"
  },
  {
    "title": "Trump Says Xi Called Him, China Trade Talks Active: Report",
    "description": "\"I don't think that's a sign of weakness on his behalf,\" Trump said of China's Xi.",
    "link": "https://www.newsweek.com/trump-xi-call-china-trade-deal-2064078",
    "timestamp": "2025-04-25T10:53:07Z"
  },
  {
    "title": "Bhutanese deported from the US again face statelessness",
    "description": "Suddenly deported after having lived for years in the US, a group of Nepali-speaking Bhutanese are caught in limbo, with both Nepal and Bhutan unwilling to provide them with citizenship rights.",
    "link": "https://www.dw.com/en/bhutanese-deported-from-the-us-again-face-statelessness/a-72352038",
    "timestamp": "2025-04-25T10:53:00Z"
  },
  {
    "title": "Trump edition: Breaking the Pentagon",
    "description": "Donald Trump's defence secretary Pete Hegseth shared classified information on an unsecured group chat - not once but twice, ...",
    "link": "https://biztoc.com/x/e8077990e3dc8c94",
    "timestamp": "2025-04-25T10:51:05Z"
  },
  {
    "title": "After Bob Iger’s Claims, Price Hack for Walt Disney World Resort Vacations Quietly Revealed",
    "description": "A hack for a cheaper vacation to the Walt Disney World Resort is coming soon–but there’s a catch. It’s no secret that the cost to vacation at the Walt Disney World Resort in Orlando, Central Florida, is high. In fact, the price many pay to experience Disney’s…",
    "link": "https://insidethemagic.net/?p=769594&preview=true&preview_id=769594",
    "timestamp": "2025-04-25T10:49:42Z"
  },
  {
    "title": "Trump Admin's Deal With Contractor To Build Tent City for Migrants Falls Through, Posing Obstacle in Mass Deportation Efforts",
    "description": "A deal between the Trump administration and contractor Deployed Resources to build tent facilities for migrants waiting deportation was terminated.",
    "link": "https://www.ibtimes.com/trump-admins-deal-contractor-build-tent-city-migrants-falls-through-posing-obstacle-mass-3771373",
    "timestamp": "2025-04-25T10:49:40Z"
  },
  {
    "title": "Operation SyncHole: Lazarus APT targets supply chains in South Korea",
    "description": "The North Korea-linked Lazarus Group targeted at least six firms in South Korea in a cyber espionage campaign called Operation SyncHole. Kaspersky researchers reported that the North Korea-linked APT group Lazarus targeted at least six firms in South Korea in…",
    "link": "https://securityaffairs.com/176964/apt/operation-synchole-lazarus-apt-targets-supply-chains-in-south-korea.html",
    "timestamp": "2025-04-25T10:49:11Z"
  },
  {
    "title": "Don't Make 'Disappointing' Retreat On Climate, COP30 CEO Urges EU",
    "description": "Europe is \"absolutely vital\" to the fight against global warming and its leadership must not waver as climate ambition backslides elsewhere, the CEO of November's COP30 summit in Brazil told AFP.\nIn an interview in Paris, Ana Toni urged the European Union to …",
    "link": "https://www.ibtimes.com/dont-make-disappointing-retreat-climate-cop30-ceo-urges-eu-3771372",
    "timestamp": "2025-04-25T10:48:12Z"
  },
  {
    "title": "Don't Make 'Disappointing' Retreat On Climate, COP30 CEO Urges EU",
    "description": "Europe is \"absolutely vital\" to the fight against global warming and its leadership must not waver as climate ambition backslides elsewhere, the CEO of November's COP30 summit in Brazil told AFP.\nIn an interview in Paris, Ana Toni urged the European Union to …",
    "link": "https://www.ibtimes.com.au/dont-make-disappointing-retreat-climate-cop30-ceo-urges-eu-1858232",
    "timestamp": "2025-04-25T10:48:05Z"
  },
  {
    "title": "Pope Francis: Crowds gather in Vatican ahead of funeral",
    "description": "Around St. Peter's Square in Vatican City, large crowds of faithful queued to bid farewell to the late Pope Francis. More than 128,000 people have come since the St. Peter's Basilica opened for the public on Wednesday.",
    "link": "https://www.dw.com/en/pope-francis-crowds-gather-in-vatican-ahead-of-funeral/a-72351199",
    "timestamp": "2025-04-25T10:48:00Z"
  },
  {
    "title": "Trump: I have made 200 trade deals",
    "description": "United States President Donald Trump claimed in an interview with Time magazine published on Friday that he has made 200 deals since he imposed trade tariffs. He did not provide any details, saying th...",
    "link": "https://biztoc.com/x/c7f3faf3db17604d",
    "timestamp": "2025-04-25T10:46:27Z"
  },
  {
    "title": "China vows to ready emergency plans, signals calm amid trade war",
    "description": "China said it will “fully prepare” emergency plans to ward against increasing external shocks, taking a patient approach in defending growth as a deepening trade war with Donald Trump piles pressure on the world’s No. 2 economy.\nThe decision-making Politburo …",
    "link": "https://biztoc.com/x/34534600f550eacd",
    "timestamp": "2025-04-25T10:46:10Z"
  },
  {
    "title": "Arms maker Saab posts record sales as Europe rearms",
    "description": "Swedish defence group Saab on Friday reported soaring quarterly earnings and record sales as European countries beef up their defence capacities amid geopolitical tensions and uncertainties. The company noted however that the uncertainties, including those ov…",
    "link": "https://www.digitaljournal.com/world/arms-maker-saab-posts-record-sales-as-europe-rearms/article",
    "timestamp": "2025-04-25T10:42:33Z"
  },
  {
    "title": "Don’t make ‘disappointing’ retreat on climate, COP30 CEO urges EU",
    "description": "Europe is “absolutely vital” to the fight against global warming and its leadership must not waver as climate ambition backslides elsewhere, the CEO of November’s COP30 summit in Brazil told AFP. In an interview in Paris, Ana Toni urged the European Union to …",
    "link": "https://www.digitaljournal.com/world/dont-make-disappointing-retreat-on-climate-cop30-ceo-urges-eu/article",
    "timestamp": "2025-04-25T10:42:20Z"
  },
  {
    "title": "Jon Ossoff's 2026 campaign looks to pressure GOP on public health cuts",
    "description": "The U.S. senator will hold a town hall today in Cobb County that includes staffers from the Centers for Disease Control and Prevention who lost their jobs.",
    "link": "https://www.ajc.com/politics/politically-georgia/jon-ossoffs-2026-campaign-looks-to-pressure-gop-on-public-health-cuts/VGMYBQOZ6JAZTKBVQTSVVNXC7U/",
    "timestamp": "2025-04-25T10:39:26Z"
  },
  {
    "title": "Trump predicts Saudi Arabia will go into the Abraham Accords",
    "description": "US President Donald Trump said he believes “Saudi Arabia will go into the Abraham Accords,” in a Friday interv",
    "link": "https://www.jpost.com/breaking-news/article-851523",
    "timestamp": "2025-04-25T10:38:52Z"
  },
  {
    "title": "Crimea will stay with Russia – Trump",
    "description": "The US president has claimed that even Zelensky understands the peninsula will remain under Moscow’s control in a final settlement Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616277-crimea-stay-russia-trump/",
    "timestamp": "2025-04-25T10:38:12Z"
  },
  {
    "title": "UN agencies for food, refugees plan deep cuts as funding plummets",
    "description": "GENEVA - The United Nations (UN) gencies for food and refugees are planning deep cuts due to unprecedented funding shortfalls, with the former set to reduce its workforce by up to 30%, affecting up to 6,000 jobs, according to internal memos sent to staff and …",
    "link": "https://www.bangkokpost.com/world/3011340/un-agencies-for-food-refugees-plan-deep-cuts-as-funding-plummets",
    "timestamp": "2025-04-25T10:38:00Z"
  },
  {
    "title": "Wine's big dip as global consumption hits 61-year low | Marketing Edge Magazine",
    "description": "The world consumption of wine was reported to have fallen drastically to its lowest level since in more than 60 years, as the threat of",
    "link": "https://marketingedge.com.ng/wines-big-dip-as-global-consumption-hits-61-year-low/",
    "timestamp": "2025-04-25T10:37:37Z"
  },
  {
    "title": "Trump signs order to boost deep-sea mining, seeking to break China's critical minerals dominance",
    "description": "The practice of deep-sea mining involves using heavy machinery to remove minerals and metals from the seabed, where they build up into potato-sized nodules.",
    "link": "https://www.cnbc.com/2025/04/25/trump-signs-executive-order-to-fast-track-deep-sea-mining-industry.html",
    "timestamp": "2025-04-25T10:36:00Z"
  },
  {
    "title": "Trump: 50% tariff in a year would be 'total victory'",
    "description": "United States President Donald Trump said he would consider it a \"total victory\" if the US still imposed tariffs on imports of up to 50% in a year's time. He claimed the US \"will be making a fortune\" ...",
    "link": "https://biztoc.com/x/a89b61e0f7dd7c7c",
    "timestamp": "2025-04-25T10:35:03Z"
  },
  {
    "title": "Food, Fighter Jets Eyed as Southeast Asia Seeks to Avert Tariffs",
    "description": "Southeast Asian nations are pledging to increase purchases of a swathe of US goods to strengthen their case for lower tariffs, as the International Monetary Fund warned of significant economic fallout for the trade-reliant region.",
    "link": "https://financialpost.com/pmn/business-pmn/food-fighter-jets-eyed-as-southeast-asia-seeks-to-avert-tariffs",
    "timestamp": "2025-04-25T10:34:12Z"
  },
  {
    "title": "China's Top Leaders Pledge Economic Support As Trade War Rages",
    "description": "China's top leaders pledged on Friday to step up support for the economy and oppose \"unilateral bullying\" in global trade in a veiled rebuke of hefty tariffs imposed by US President Donald Trump.",
    "link": "https://www.ibtimes.com/chinas-top-leaders-pledge-economic-support-trade-war-rages-3771371",
    "timestamp": "2025-04-25T10:33:13Z"
  },
  {
    "title": "China’s top leaders pledge economic support as trade war rages",
    "description": "China’s top leaders pledged on Friday to step up support for the economy and oppose “unilateral bullying” in global trade in a veiled rebuke of hefty tariffs imposed by US President Donald Trump. The world’s two largest economies are engaged in a high-stakes …",
    "link": "https://www.digitaljournal.com/world/chinas-top-leaders-pledge-economic-support-as-trade-war-rages/article",
    "timestamp": "2025-04-25T10:32:20Z"
  },
  {
    "title": "Donald Trump's ActBlue Drama Explained",
    "description": "The President has issued a memorandum to investigate what he said were unlawful election contributions to the Democratic Party.",
    "link": "https://www.newsweek.com/actblue-donald-trump-democratic-fundraising-2063997",
    "timestamp": "2025-04-25T10:30:18Z"
  },
  {
    "title": "S. Korea’s former president claims his bribery indictment ‘unjust’",
    "description": "South Korea’s former president Moon Jae-in claimed Friday that prosecutors abused their power, were politically motivated and “unjust” to indict him on bribery charges. Moon, known for his dovish approach to North Korea and peacemaking efforts, was indicted T…",
    "link": "https://www.digitaljournal.com/world/s-koreas-former-president-claims-his-bribery-indictment-unjust/article",
    "timestamp": "2025-04-25T10:27:20Z"
  },
  {
    "title": "UN agencies for food, refugees plan deep cuts as funding plummets, documents show",
    "description": "GENEVA (Reuters) -The U.N. agencies for food and refugees are planning deep cuts due to unprecedented funding shortfalls, with the former set to reduce its workforce by up to 30%, affecting up to 6,000 jobs, according to internal memos sent to staff and seen …",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/un-agencies-for-food-refugees-plan-deep-cuts-as-funding-plummets-documents-show",
    "timestamp": "2025-04-25T10:24:00Z"
  },
  {
    "title": "Bangladesh textile sector seeks duty-free access on US cotton garments",
    "description": "The Bangladesh Textile Mills Association (BTMA) has reached out to the US embassy and the National Cotton Council of America (NCC) with a request to allow...",
    "link": "https://www.just-style.com/news/bangladesh-textile-tariff-us/",
    "timestamp": "2025-04-25T10:23:49Z"
  },
  {
    "title": "Susan Rice Blasts Trump’s Attacks on DEI While ‘Dumb as a Rock’ Pete Hegseth ‘Deemed Qualified’",
    "description": "Former United Nations Ambassador Susan Rice torched President Donald Trump for railing against diversity, equity, and inclusion (DEI) while “dumb as a rock” MAGA loyalists like Secretary of Defense Pete Hegseth are “deemed qualified” for ranking administratio…",
    "link": "https://www.mediaite.com/tv/susan-rice-blasts-trumps-attacks-on-dei-while-dumb-as-a-rock-pete-hegseth-deemed-qualified/",
    "timestamp": "2025-04-25T10:22:56Z"
  },
  {
    "title": "Apple to move production of US iPhones from China to India over tariffs – report",
    "description": "Experts have already warned the price of electronics generally, and not just Apple products, are likely to rise.",
    "link": "https://www.the-independent.com/tech/apple-china-india-experts-asia-b2739434.html",
    "timestamp": "2025-04-25T10:22:54Z"
  },
  {
    "title": "The problem of Pakistan couldn't have come at a worse time for Indian stock market. Will it limit upside?",
    "description": "Rising India-Pakistan tensions have rattled investor sentiment, causing a sharp market selloff. Analysts say the impact appears short-term and sentiment-driven, with a potential rebound likely next week. Weak earnings momentum, particularly in IT and FMCG, ad…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-problem-of-pakistan-couldnt-have-come-at-a-worse-time-for-indian-stock-market-will-it-limit-upside/articleshow/120616380.cms",
    "timestamp": "2025-04-25T10:22:02Z"
  },
  {
    "title": "China’s Xi Prepares to Eat America’s Lunch as Trump Cedes Leadership on Clean Energy",
    "description": "This story was originally published by the Guardian and is reproduced here as part of the Climate Desk collaboration. China will continue to push forward on the climate crisis, Xi Jinping has said while appearing to criticize the “protectionism” of Donald Tru…",
    "link": "https://www.motherjones.com/politics/2025/04/china-xi-trump-abandoning-us-leadership-clean-energy-solar-rare-earth-industry/",
    "timestamp": "2025-04-25T10:19:00Z"
  },
  {
    "title": "Scope of Gazans fleeing the territory: 36 thousand have left so far to Hamas's dismay",
    "description": "Since the war began, over 36 thousand people have left the Gaza Strip - an unprecedented number, showing a growing emigration trend. There is a growing wave of emigration from the Gaza Strip, mostly through the Rafah Crossing into Egyptian territory. Accordin…",
    "link": "https://freerepublic.com/focus/f-news/4313127/posts",
    "timestamp": "2025-04-25T10:18:54Z"
  },
  {
    "title": "United CEO calls Trump's tariffs a 'chess game'",
    "description": "United Airlines CEO Scott Kirby said Trump's tariffs could help \"create good careers,\" although airlines have warned of reduced travel demand.",
    "link": "https://www.businessinsider.com/united-airlines-ceo-trump-tariffs-are-a-chess-game-2025-4",
    "timestamp": "2025-04-25T10:17:58Z"
  },
  {
    "title": "‘Trump 2028’ hats and t-shirts on sale at Trump store in chilling nod to third term ambitions",
    "description": "The online store of US president Donald Trump is selling merch promoting ‘Trump 2028’, the year of the next election which Trump is constitutionally unable to run for. Despite the Constitution explicitly stating Trump cannot run for a third term – having won …",
    "link": "https://www.thepinknews.com/2025/04/25/trump-2028-store-donald-trump-us-president-third-term/",
    "timestamp": "2025-04-25T10:17:10Z"
  },
  {
    "title": "Hegseth Lost It In F-Word Rant At Joint Chiefs Chair Over Suspected Leak: Report",
    "description": "The Wall Street Journal reported on the defense secretary's hissy fit amid growing chaos.",
    "link": "https://www.huffpost.com/entry/pete-hegseth-hook-you-up-to-fucking-polygraph-wall-street-journal_n_680b4be9e4b04aefca79cfb0",
    "timestamp": "2025-04-25T10:17:07Z"
  },
  {
    "title": "Trump's migration stance overshadowed ties with Pope Francis",
    "description": "WASHINGTON (Reuters) - Shortly after Pope Francis' death was announced on Monday, President Donald Trump ordered American flags dropped to half-staff, offering nothing but praise for the world's Roman Catholic leader. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/trump039s-migration-stance-overshadowed-ties-with-pope-francis",
    "timestamp": "2025-04-25T10:16:00Z"
  },
  {
    "title": "Dem Senator Says Party Needs to Stop Attacking ‘Oligarchy’ and Focus on Losing ‘Woke’ Reputation",
    "description": "Sen. Elissa Slotkin (D-MI) urged her Democratic colleagues to stop attacking the \"oligarchy,\" arguing that the word did not resonate with most Americans.\nThe post Dem Senator Says Party Needs to Stop Attacking ‘Oligarchy’ and Focus on Losing ‘Woke’ Reputation…",
    "link": "https://www.mediaite.com/news/dem-senator-says-party-needs-to-stop-attacking-oligarchy-and-focus-on-losing-woke-reputation/",
    "timestamp": "2025-04-25T10:15:30Z"
  },
  {
    "title": "Trump’s executive order mandating proof of citizenship to vote blocked by federal judge after flurry of legal setbacks",
    "description": "A federal judge in Washington, D.C., on Thursday blocked a portion of President Donald Trump’s executive order on election integrity, specifically provisions related to providing documentary proof of citizenship before being allowed to register to vote. Judge…",
    "link": "https://freerepublic.com/focus/f-chat/4313126/posts",
    "timestamp": "2025-04-25T10:15:26Z"
  },
  {
    "title": "Car Bomb Kills Russian General Near Moscow",
    "description": "Videos shared from the scene show a burning car and a man's remains amid the charred damage.",
    "link": "https://www.newsweek.com/car-bomb-kills-russian-general-moscow-2064057",
    "timestamp": "2025-04-25T10:15:17Z"
  },
  {
    "title": "More say US should bring back Abrego Garcia, mixed on other deportation issues: POLL",
    "description": "Americans hold mixed views on President Donald Trump's immigration policies, according to a ABC News/Washington Post/Ipsos poll.",
    "link": "https://abcnews.go.com/Politics/americans-us-bring-back-abrego-garcia-views-mixed/story?id=121123625",
    "timestamp": "2025-04-25T10:14:58Z"
  },
  {
    "title": "Trump Jr. Embarks on a Balkan Business Odyssey",
    "description": "",
    "link": "https://biztoc.com/x/33b283202e5c06bf",
    "timestamp": "2025-04-25T10:13:33Z"
  },
  {
    "title": "Trump Says He May Deserve A Nobel Peace Prize For This Reason",
    "description": "U.S. President Donald Trump hinted that his contribution to the Abraham Accords could potentially make him a worthy contender for the Nobel Peace Prize.\nWhat Happened: During a meeting with Norwegian Prime Minister Jonas Gahr Støre in the Oval Office on Thurs…",
    "link": "https://biztoc.com/x/7ad06ddefbe4b48c",
    "timestamp": "2025-04-25T10:13:22Z"
  },
  {
    "title": "If the soft approach doesn’t work with Trump, we shouldn’t fear getting tough",
    "description": "Jerry Dias is a retired national president of Unifor and helped in the negotiation of the Canada-United States-Mexico Agreement in 2018. Jordan Brennan is a former chief economist at Unifor.\nOn Wednesday, U.S. President Donald Trump threatened to raise the ta…",
    "link": "https://biztoc.com/x/290aa1a339ffff72",
    "timestamp": "2025-04-25T10:12:57Z"
  },
  {
    "title": "Trump Admin Fires Climate Aid, Policy Workers As State Department Faces Major Overhaul Under Rubio: Report",
    "description": "The State Department, with backing from President Trump, has reportedly dismissed federal employees that worked under its climate aid and climate policy office.",
    "link": "https://www.ibtimes.com/trump-admin-fires-climate-aid-policy-workers-state-department-faces-major-overhaul-under-rubio-3771360",
    "timestamp": "2025-04-25T10:11:24Z"
  },
  {
    "title": "What the tomato teaches us about free trade",
    "description": "The US Department of Commerce imposed a 21% tariff on most Mexican tomatoes, effective July 14. This action highlights the benefits of trade, providing Americans with year-round access to tomatoes and allowing countries to focus on their comparative advantage…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-the-tomato-teaches-us-about-free-trade/articleshow/120615963.cms",
    "timestamp": "2025-04-25T10:08:48Z"
  },
  {
    "title": "Europe and China Must Unite Against Trump’s Trade Assault",
    "description": "Europeans’ refusal to push back hard against US President Donald Trump’s tariffs has played into the US administration’s hands. EU leaders urgently need to devise a new strategy to isolate Trump, deter American aggression, and defend the multilateral system.",
    "link": "https://www.project-syndicate.org/commentary/european-countries-must-push-back-against-trump-tariffs-by-marcel-fratzscher-2025-04",
    "timestamp": "2025-04-25T10:06:28Z"
  },
  {
    "title": "China Says Wind And Solar Energy Capacity Exceeds Thermal For First Time",
    "description": "China's wind and solar energy capacity has surpassed that of mostly coal-powered thermal for the first time, the national energy body said Friday.",
    "link": "https://www.ibtimes.com/china-says-wind-solar-energy-capacity-exceeds-thermal-first-time-3771370",
    "timestamp": "2025-04-25T10:06:21Z"
  },
  {
    "title": "Trump sparks row with deep-sea mining order",
    "description": "The US president speeds up permits for a practice opposed by many countries and environmentalists.",
    "link": "https://www.bbc.com/news/articles/cx2v37z333lo",
    "timestamp": "2025-04-25T10:06:10Z"
  },
  {
    "title": "US shale patch slows down as oil prices sink",
    "description": "HOUSTON(Reuters) -Some small U.S. shale producers are putting the brakes on oil drilling as crude prices sink to multi-year lows and steep tariffs drive...",
    "link": "https://finance.yahoo.com/news/us-shale-patch-slows-down-100529912.html",
    "timestamp": "2025-04-25T10:05:29Z"
  },
  {
    "title": "ICE to spend up to $45 billion on contractors for immigrant detention, deportation",
    "description": "Private prison company CEO calls $45 billion detention expansion plans 'exciting' as President Trump ramps up deportations",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/25/trump-contractors-ice-detentions-deportations/83250623007/",
    "timestamp": "2025-04-25T10:04:13Z"
  },
  {
    "title": "China says wind and solar energy capacity exceeds thermal for first time",
    "description": "China’s wind and solar energy capacity has surpassed that of mostly coal-powered thermal for the first time, the national energy body said Friday. China, the world’s largest emitter of greenhouse gases that drive climate change, has pledged to peak carbon emi…",
    "link": "https://www.digitaljournal.com/world/china-says-wind-and-solar-energy-capacity-exceeds-thermal-for-first-time/article",
    "timestamp": "2025-04-25T10:03:16Z"
  },
  {
    "title": "The Story Behind TIME’s Donald Trump 100 Days Cover",
    "description": "This was the fourth interview the U.S. President has done with TIME since clinching the Republican nomination for President last spring.",
    "link": "https://time.com/7280111/donald-trump-2025-interview-cover/",
    "timestamp": "2025-04-25T10:03:00Z"
  },
  {
    "title": "Fact-Checking What Donald Trump Said in His ‘100 Days’ Interview With TIME",
    "description": "U.S. President Donald Trump sat down with TIME ahead of the 100th day of his second term and made inaccurate statements. Here’s what they are.",
    "link": "https://time.com/7280129/donald-trump-fact-check-2025-interview/",
    "timestamp": "2025-04-25T10:02:00Z"
  },
  {
    "title": "Read the Full Transcript of Donald Trump’s ‘100 Days’ Interview With TIME",
    "description": "President Trump discussed his trade war and the economy, immigration, presidential power, and the situations in Ukraine and the Middle East.",
    "link": "https://time.com/7280114/donald-trump-2025-interview-transcript/",
    "timestamp": "2025-04-25T10:01:00Z"
  },
  {
    "title": "Corporate America is sounding the alarm on tariffs | CNN Business",
    "description": "Some of America’s biggest companies say President Donald Trump’s erratic trade policy is leading consumers to spend less, raising costs for their businesses and making it impossible to plan for the future.",
    "link": "https://www.cnn.com/2025/04/25/business/chipotle-pepsi-tariffs-business/index.html",
    "timestamp": "2025-04-25T10:00:52Z"
  },
  {
    "title": "Immigration Lawyer in US for 24 Years Told to Self-Deport",
    "description": "\"I am not deportable. But I do want everybody to know that these kinds of things are happening,\" Carlos Trujillo told KTVX.",
    "link": "https://www.newsweek.com/immigration-lawyer-us-self-deport-2064016",
    "timestamp": "2025-04-25T10:00:34Z"
  },
  {
    "title": "Why Trudeau's exit was the worst thing that ever happened to Pierre Poilievre",
    "description": "Conservatives worked hard to establish what they thought the election would be about: affordability. Then Donald Trump changed the ballot question",
    "link": "https://nationalpost.com/news/politics/federal_election/the-problem-solver-poilievre-battles-to-win-an-election-that-took-an-unexpected-turn",
    "timestamp": "2025-04-25T10:00:33Z"
  },
  {
    "title": "Arms Maker Saab Posts Record Sales As Europe Rearms",
    "description": "The company noted however that the uncertainties, including those over US President Donald Trump's tariffs scheme, also \"present challenges and make it difficult to predict the future\".",
    "link": "https://www.ibtimes.com/arms-maker-saab-posts-record-sales-europe-rearms-3771361",
    "timestamp": "2025-04-25T10:00:31Z"
  },
  {
    "title": "When a Democrat says it, it's not a lie",
    "description": "A belated happy Earth Day (April 22) to anyone who gives a shit. If CNN's chief climate correspondent Bill Weir is right (he definitely isn't, but for the sake of argument), it could be the last one we'll ever get to celebrate. Even by the low standards of ma…",
    "link": "https://freebeacon.com/newsletters/when-a-democrat-says-it-its-not-a-lie/",
    "timestamp": "2025-04-25T10:00:19Z"
  },
  {
    "title": "Rising Michigan senator urges Democrats to stop being 'weak and woke' and 'f---ing retake the flag'",
    "description": "Sen. Elissa Slotkin, D-Mich., criticized her own party as part of a series of speeches she plans to give to take on President Donald Trump and the Republicans.",
    "link": "https://www.foxnews.com/media/rising-michigan-senator-urges-democrats-stop-being-weak-woke-f-ing-retake-flag",
    "timestamp": "2025-04-25T10:00:19Z"
  },
  {
    "title": "As Trump Administration Considers Retreat on Tariffs, Will It Resort to Usual US Fallback Option?",
    "description": "Washington's focus on global chokepoints could see extra attention in wake of tariffs debacle.",
    "link": "https://www.nakedcapitalism.com/2025/04/as-trump-administration-considers-retreat-on-tariffs-will-it-resort-to-usual-us-fallback-option.html",
    "timestamp": "2025-04-25T10:00:17Z"
  }
]