[
  {
    "title": "Bari Weiss Reportedly Trying to Poach Scott Jennings From CNN and Bring Him to CBS",
    "description": "New CBS News editor-in-chief Bari Weiss is reportedly aiming to take conservative commentator Scott Jennings away from CNN and bring him to the Tiffany Network\nThe post Bari Weiss Reportedly Trying to Poach Scott Jennings From CNN and Bring Him to CBS first a…",
    "link": "https://www.mediaite.com/media/news/bari-weiss-reportedly-trying-to-poach-scott-jennings-from-cnn-and-bring-him-to-cbs/",
    "timestamp": "2025-10-27T19:25:31Z"
  },
  {
    "title": "Russia says three more Ukraine villages captured",
    "description": "Russia said Monday its troops had captured three more villages in Ukraine, with Moscow trying to press its advantage on the battlefield amid stalled peace efforts. Ukraine's army said over the weekend that around 200 Russian troops had entered the city of Pok…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-says-three-more-ukraine-villages-captured/articleshow/124857672.cms",
    "timestamp": "2025-10-27T19:24:00Z"
  },
  {
    "title": "Trump tells Putin: ‘We’re ‘right off their shores’",
    "description": "President Trump rattled a saber at Russian President Vladimir Putin on Monday, reminding the communist leader that the United States has state-of-the-art submarines and weaponry “right off their shores.” “We have a nuclear submarine, the greatest in the world…",
    "link": "https://www.bostonherald.com/2025/10/27/trump-tells-putin-were-right-off-their-shores/",
    "timestamp": "2025-10-27T19:23:11Z"
  },
  {
    "title": "Trump Floats Xi Jinping Visiting Mar-A-Lago After Future Meeting In China",
    "description": "President Donald Trump said he would be willing to host Chinese President Xi Jinping at Mar-a-Lago after a potential visit to China next year",
    "link": "https://dailycaller.com/2025/10/27/trump-floats-xi-jinping-visiting-mar-a-lago-after-future-meeting-in-china/",
    "timestamp": "2025-10-27T19:20:00Z"
  },
  {
    "title": "U.S Dollar today: Why is USD down against Euro, Chinese Yuan, top currencies?",
    "description": "U.S. dollar index was last down 0.11 per cent at 98.84, with the euro up 0.15 per cent at $1.1643.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-dollar-today-why-is-usd-down-against-euro-chinese-yuan-top-currencies/articleshow/124857480.cms",
    "timestamp": "2025-10-27T19:19:01Z"
  },
  {
    "title": "Swalwell: Dem Presidential Hopefuls Must Vow To Destroy Trump Ballroom On ‘Day One’",
    "description": "By Lorenzo Prieto, The Daily Signal | October 27, 2025\nPresident Donald Trump’s plans to build a new White House ballroom continue to send Democrats and the Left into full meltdown mode.\nRep. Eric Swalwell, D-Calif., is the latest to suffer from what Republic…",
    "link": "https://biztoc.com/x/659a1cc9349b000c",
    "timestamp": "2025-10-27T19:18:44Z"
  },
  {
    "title": "How New Jersey's verdict on Trump and its Democratic leadership are shaping the governor's race",
    "description": "Donald Trump looms over the New Jersey governor's race. But the results will also be tied to how voters in New Jersey view another politician: Democratic Gov. Phil Murphy.",
    "link": "https://biztoc.com/x/6cc42dfbb325c4e9",
    "timestamp": "2025-10-27T19:18:41Z"
  },
  {
    "title": "US debt set to soar above Italy and Greece after Trump’s ‘big, beautiful bill’",
    "description": "Donald Trump is on course to push US debt levels above those of Italy and Greece by the end of the decade after wide-ranging tax cuts and increased defence spending, according to International Monetary Fund (IMF) forecasts.\nIllustrating the rising debt levels…",
    "link": "https://biztoc.com/x/a8d06686c1f683d0",
    "timestamp": "2025-10-27T19:18:16Z"
  },
  {
    "title": "Putin terminates plutonium disposal agreement with US",
    "description": "Russian President Vladimir Putin signed a law on Monday terminating an already defunct plutonium disposal agreement with the United States that aimed to prevent both sides from building more nuclear weapons. The law that Putin signed on Monday, approved by Ru…",
    "link": "https://economictimes.indiatimes.com/news/defence/putin-terminates-plutonium-disposal-agreement-with-us/articleshow/124857565.cms",
    "timestamp": "2025-10-27T19:17:56Z"
  },
  {
    "title": "Kamala Harris Suggests She’s Considering Another Presidential Run, Slams Billionaires Bending The Knee To ‘Tyrant’ Trump",
    "description": "Kamala Harris says her political story isn’t over, and she’s not shutting the door on another White House run. Not only that, but she’s candidly calling out billionaires who are succinctly submitting to “tyrant” Trump. In an interview set to air on the BBC’s …",
    "link": "https://bossip.com/4005165/kamala-harris-2028-presidential-run/",
    "timestamp": "2025-10-27T19:17:07Z"
  },
  {
    "title": "Prime Minister Christopher Luxon reveals plans for stronger trade ties with Asia",
    "description": "The PM wants to sign a new ‘comprehensive strategic partnership’ with ASEAN.",
    "link": "https://www.nzherald.co.nz/nz/prime-minister-christopher-luxon-reveals-plans-for-stronger-trade-ties-with-asia/MZZJBFK5SJC7LGWY3S2QIFVQ4Y/",
    "timestamp": "2025-10-27T19:13:03Z"
  },
  {
    "title": "International Gaza Force Could Include Troops from Pakistan, Azerbaijan, Indonesia",
    "description": "The International Stabilization Force (ISF) that is to patrol Gaza as part of President Donald Trump’s 20-point Gaza ceasefire plan could include troops from Azerbaijan, Indonesia, and Pakistan, one report says. The New York Times reported last week that Arab…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348955/posts",
    "timestamp": "2025-10-27T19:10:55Z"
  },
  {
    "title": "Controversial UFC fighter takes back his Trump support in wild rant: 'I was fooled'",
    "description": "UFC fighter Bryce Mitchell disavowed President Donald Trump in a scathing rant on Friday, calling him the \"Antichrist\" in a video posted to social media.",
    "link": "https://www.foxnews.com/sports/controversial-ufc-fighter-takes-back-his-trump-support-wild-rant-i-fooled",
    "timestamp": "2025-10-27T19:10:26Z"
  },
  {
    "title": "Trump gets royal welcome in Japan, China truce hopes rise",
    "description": "US President Donald Trump received a royal welcome in Japan, hoping to secure a trade war truce with Chinese President Xi Jinping. Trump announced significant investment pledges from Japan and is set to meet Xi in South Korea, with negotiators agreeing to a f…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-gets-royal-welcome-in-japan-china-truce-hopes-rise/articleshow/124857311.cms",
    "timestamp": "2025-10-27T19:07:37Z"
  },
  {
    "title": "Canada Is Way More Popular in US Than Donald Trump",
    "description": "Polls say Americans view Canada more favorably than President Donald Trump, whose feud with the political leaders of Washington’s northern neighbor has intensified in recent days.\nWhy It Matters\nThe U.S. and Canada, which share a border more than 5,000 miles …",
    "link": "https://biztoc.com/x/81487956ae5dea87",
    "timestamp": "2025-10-27T19:07:32Z"
  },
  {
    "title": "After courts hampered earlier efforts, Trump wants to cancel more funding during shutdown",
    "description": "President Donald Trump’s administration has canceled, or threatened to cancel, billions of dollars of previously approved federal spending and wants to go after even more funding during the shutdown.",
    "link": "https://biztoc.com/x/ec32632cc6f23a0b",
    "timestamp": "2025-10-27T19:07:11Z"
  },
  {
    "title": "Most Americans disapprove of Trump’s AI videos – poll",
    "description": "70% of US citizens disapprove of the AI-generated video depicting President Donald Trump dropping sludge on protesters, a survey has found Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627025-trump-ai-videos-poll-negative/",
    "timestamp": "2025-10-27T19:07:11Z"
  },
  {
    "title": "'We achieved our goal': Ford stands firm on Reagan anti-tariff ad",
    "description": "The premier said the advert was viewed one billion times as Trump said he has no plans to meet with his Canadian counterpart.",
    "link": "https://www.bbc.com/news/articles/cn40lp7xqy4o",
    "timestamp": "2025-10-27T19:06:37Z"
  },
  {
    "title": "Turkiye signs deal with the UK to buy 20 Eurofighter jets",
    "description": "Britain's Keir Starmer and Turkiye's Recep Tayyip Erdogan met in Ankara on Monday to cement the almost $11bn agreement.",
    "link": "https://www.aljazeera.com/news/2025/10/27/turkiye-signs-deal-with-the-uk-to-buy-20-eurofighter-jets",
    "timestamp": "2025-10-27T19:04:24Z"
  },
  {
    "title": "How Trump Could Win Over the Developing World",
    "description": "At a time when developing countries are under fiscal pressure and struggling to invest in future growth, the United States could come to the rescue – and without putting one cent of its own money on the line. Rarely has there been a better moment for a new is…",
    "link": "https://www.project-syndicate.org/commentary/us-trump-administration-should-push-for-imf-sdr-not-swap-lines-by-vera-songwe-2025-10",
    "timestamp": "2025-10-27T19:01:08Z"
  },
  {
    "title": "Trump on Vice President Run: ‘It Wouldn’t be Right’",
    "description": "The left is so convinced Trump won't go away.\nThe post Trump on Vice President Run: ‘It Wouldn’t be Right’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/trump-on-vice-president-run-it-wouldnt-be-right/",
    "timestamp": "2025-10-27T19:00:33Z"
  },
  {
    "title": "Swalwell mocked for demanding 2028 Democrats pledge to demolish Trump's ballroom",
    "description": "Rep. Eric Swalwell demanded 2028 Democratic presidential candidates pledge to demolish President Donald Trump's ballroom, drawing mockery from conservatives.",
    "link": "https://www.foxnews.com/media/swalwell-mocked-demanding-2028-democrats-pledge-demolish-trumps-ballroom",
    "timestamp": "2025-10-27T19:00:15Z"
  },
  {
    "title": "Monroe Doctrine II, Trump Style",
    "description": "President Trump, with the help of his Treasury secretary, just pulled off a rescue that few thought possible, promising $40 billion to Argentina. What’s notable is not the novelty of Trump’s inter-American imperialism but the broad continuity with past U.S. p…",
    "link": "http://prospect.org/2025/10/27/monroe-doctrine-ii-trump-style/",
    "timestamp": "2025-10-27T19:00:00Z"
  },
  {
    "title": "Freepers, what's more important to you: immigration reform or education reform?",
    "description": "Obviously both are important and require a massive shift away from the status-quo, but if you had to pick one, which is more critical for the well-being of America?I'd personally think immigration reform is slightly more important, but understand if that's no…",
    "link": "https://freerepublic.com/focus/f-chat/4348951/posts",
    "timestamp": "2025-10-27T18:56:53Z"
  },
  {
    "title": "Diddy’s Prison Release Date Revealed: What’s Next for the Mogul?",
    "description": "Diddy will have to hearing a different type of bars for the next couple of years. His release date has been confirmed.",
    "link": "https://hiphopwired.com/2885319/diddy-prison-release-date-revealed/",
    "timestamp": "2025-10-27T18:56:36Z"
  },
  {
    "title": "Fetterman Criticizes Kamala Harris For Calling Trump A Fascist",
    "description": "By Jacob Adams, The Daily Signal | October 24, 2025\nSen. John Fetterman, D-Pa., made headlines this week by chastising his party’s 2024 presidential candidate, Kamala Harris, over her campaign rhetoric.\n“When Vice President Harris referred to President [Donal…",
    "link": "https://biztoc.com/x/999c1fb024831d12",
    "timestamp": "2025-10-27T18:56:00Z"
  },
  {
    "title": "Capitol agenda: Brace for sharper shutdown pain (Calen Razor/Politico)",
    "description": "Calen Razor / Politico:\nCapitol agenda: Brace for sharper shutdown pain  —  Congress is just days away from a significant escalation of shutdown pain.  But with President Donald Trump in Asia all week, there's little hope of an immediate breakthrough.  Come N…",
    "link": "https://www.memeorandum.com/251027/p81",
    "timestamp": "2025-10-27T18:55:04Z"
  },
  {
    "title": "Ashley Longshore celebrates new pop-up gallery with Christian Siriano, Trump impersonator, scantily clad servers",
    "description": "Longshore launched a pop-up gallery, steps away from Jean-Michel Basquiat's studio on Great Jones St.",
    "link": "https://pagesix.com/2025/10/27/society/ashley-longshore-parties-with-christian-siriano/",
    "timestamp": "2025-10-27T18:54:38Z"
  },
  {
    "title": "After courts hampered earlier efforts, Trump wants to cancel more funding during shutdown",
    "description": "President Donald Trump’s administration has canceled, or threatened to cancel, billions of dollars of previously approved federal spending and wants to go after even more funding during the shutdown.",
    "link": "https://www.pbs.org/newshour/politics/after-courts-hampered-earlier-efforts-trump-wants-to-cancel-more-funding-during-shutdown",
    "timestamp": "2025-10-27T18:52:24Z"
  },
  {
    "title": "Monday Afternoon Open Thread: What We Could’ve Had",
    "description": "Former President Joe Biden spoke publicly for the first time since completing a round of radiation therapy for an aggressive form of prostate cancer. He addressed an audience in Boston on Sunday after winning the Lifetime Achievement Award from the Edward M. …",
    "link": "https://balloon-juice.com/2025/10/27/monday-afternoon-open-thread-what-we-couldve-had/",
    "timestamp": "2025-10-27T18:51:38Z"
  },
  {
    "title": "Trump acknowledges recent MRI but hedges on why doctors ordered it",
    "description": "After conceding that he recently had an MRI, Donald Trump failed to disclose why his doctors ordered one, despite his frequent boasts about transparency.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-acknowledges-recent-mri-hedges-doctors-ordered-one-rcna240094",
    "timestamp": "2025-10-27T18:51:15Z"
  },
  {
    "title": "MSNBC’s Nicolle Wallace Nods And Smiles As JB Pritzker Claims Antifa Is ‘Mythical Thing’",
    "description": "Nicolle Wallace nodded along and flashed a smile as Democratic Illinois Gov. JB Pritzker claimed Antifa does not even exist.",
    "link": "https://dailycaller.com/2025/10/27/msnbcs-nicolle-wallace-jb-pritzker-claims-antifa-mythical/",
    "timestamp": "2025-10-27T18:51:07Z"
  },
  {
    "title": "This Shady Right-Wing Billionaire Gave Trump a Major Shutdown Bailout",
    "description": "The mystery donor who wrote President Donald Trump a $130 million check for the military is believed to be 83-year-old conservative billionaire Tim Mellon.Two people familiar with the conversations identified Mellon to The New York Times, which published the …",
    "link": "https://newrepublic.com/post/202303/right-wing-billionaire-donald-trump-donation-military-shutdown",
    "timestamp": "2025-10-27T18:51:05Z"
  },
  {
    "title": "UFC Fighter Who Vowed To Take A Bullet For Trump Has Revelation",
    "description": "Bryce Mitchell, who once called Hitler a “good guy,” made a wild claim of biblical proportions about the president.",
    "link": "https://www.huffpost.com/entry/ufc-fighter-bryce-mitchell-calls-trump-the-antichrist_n_68ffa6f4e4b0ebfddfbaff28",
    "timestamp": "2025-10-27T18:50:22Z"
  },
  {
    "title": "Kathy Hochul oddly drags Buffalo Bills into ‘tax the rich’ chant that overwhelmed her appearance at Zohran Mamdani rally",
    "description": "Those aren’t the bills they’re looking for. Gov. Kathy Hochul bizarrely tried to run interference on the embarrassing “tax the rich” chants she was heckled with at Zohran Mamdani‘s rally — claiming Monday she thought it was a pro-Buffalo Bills chorus. “I thou…",
    "link": "https://freerepublic.com/focus/f-news/4348949/posts",
    "timestamp": "2025-10-27T18:49:55Z"
  },
  {
    "title": "How New Jersey's verdict on Trump and one other leader is shaping the governor's race",
    "description": "Donald Trump looms over the New Jersey governor's race. But the results will also be tied to how voters in New Jersey view another politician: Democratic Gov. Phil Murphy.",
    "link": "https://www.nbcnews.com/politics/elections/new-jersey-election-trump-phil-murphy-approval-rating-rcna237661",
    "timestamp": "2025-10-27T18:49:02Z"
  },
  {
    "title": "Democrats Just Lost a Key Ally in the Shutdown Fight",
    "description": "As the AFGE, the biggest federal-employees union, tells Democrats to give up on the government shutdown, the question is whether they can find an off-ramp on Obamacare subsidies and claim some sort of victory.",
    "link": "http://nymag.com/intelligencer/article/government-shutdown-can-afge-union-force-democrats-to-cave.html",
    "timestamp": "2025-10-27T18:47:07Z"
  },
  {
    "title": "US Navy jet and chopper mysteriously crash in South China Sea within 30 minutes — Trump calls it very unusual",
    "description": "A U.S. Navy F/A-18F Super Hornet jet and MH-60R Sea Hawk helicopter crashed within 30 minutes of each other above the South China Sea, prompting an emergency rescue mission. President Donald Trump described the  situation“very unusual” and hinted at potential…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-navy-jet-and-chopper-mysteriously-crash-in-south-china-sea-within-30-minutes-trump-calls-it-very-unusual/articleshow/124856393.cms",
    "timestamp": "2025-10-27T18:47:07Z"
  },
  {
    "title": "Hostin: Trump Is 'Most Definitely Going to Try to Remain in Power'",
    "description": "Monday on ABC's \"The View,\" co-host Sunny Hostin said President Donald Trump was \"most definitely going to try to remain in power.\"\nThe post Hostin: Trump Is ‘Most Definitely Going to Try to Remain in Power’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/10/27/hostin-trump-is-most-definitely-going-to-try-to-remain-in-power/",
    "timestamp": "2025-10-27T18:46:29Z"
  },
  {
    "title": "“It was perfect”: Trump won’t say why he received MRI at Walter Reed",
    "description": "The president boasted about a \"perfect\" MRI he received at Walter Reed, but wouldn't say why it was necessary.",
    "link": "https://www.salon.com/2025/10/27/it-was-perfect-trump-wont-say-why-he-received-mri-at-walter-reed/",
    "timestamp": "2025-10-27T18:46:26Z"
  },
  {
    "title": "The More Disturbing the Dirt, the Better Democrats Like Their Dirtbags",
    "description": "Am I shocked by the myriad scandals of Graham Platner, the cosplay workin’ man running for the Democrat nomination for Maine senator, a guy with more baggage than the third wife of a Middle Eastern emir? Absolutely not. Sure, he has a Nazi tattoo and a histor…",
    "link": "https://freerepublic.com/focus/f-news/4348948/posts",
    "timestamp": "2025-10-27T18:45:20Z"
  },
  {
    "title": "Trump Secures \"Landmark Peace And Trade Wins\" On Asia Tour",
    "description": "President Donald J. Trump opened his Asia tour in Malaysia with a series of high-impact diplomatic and economic victories aimed at advancing the “America First” agenda.\nPresident Trump Opens Asia Trip by Securing Landmark Wins for America https://t.co/CFc38qu…",
    "link": "https://biztoc.com/x/556930c495f6ae4d",
    "timestamp": "2025-10-27T18:45:04Z"
  },
  {
    "title": "WATCH: CNBC’s Becky Quick Completely Wrecks Hakeem Jeffries on Shutdown Hypocrisy",
    "description": "It looks like CNBC Squawk Box co-anchor Becky Quick is fed up with the Democrats’ hypocritical nonsense over the ongoing government shutdown. Quick skewered House Minority Leader Hakeem Jeffries (D-NY) during the October 24 edition of Squawk Box. Quick scolde…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348947/posts",
    "timestamp": "2025-10-27T18:43:26Z"
  },
  {
    "title": "British Pro-Palestine Speaker Detained By ICE After Right-Wing Social Campaign",
    "description": "Extremists Laura Loomer and Amy Mekelburg claimed victory for Sami Hamdi's visa revocation.",
    "link": "https://www.huffpost.com/entry/british-pro-palestine-speaker-detained-by-ice-after-right-wing-social-campaign_n_68ff9c7de4b0ebfddfbaeb9f",
    "timestamp": "2025-10-27T18:43:15Z"
  },
  {
    "title": "Trump: Vance-Rubio Ticket in 2028 Would Be 'Unstoppable'",
    "description": "President Donald Trump said Monday that he does not know if anyone would run against a hypothetical ticket of Vice President JD Vance and Secretary of State Marco Rubio in 2028, adding they would be \"unstoppable.\" \nThe post Trump: Vance-Rubio Ticket in 2028 W…",
    "link": "https://www.breitbart.com/politics/2025/10/27/trump-vance-rubio-ticket-in-2028-would-be-unstoppable/",
    "timestamp": "2025-10-27T18:42:20Z"
  },
  {
    "title": "Indiana’s governor calls in legislature to approve GOP gerrymander, but lacks votes",
    "description": "Under pressure from the Trump administration and conservative influencers, Indiana Republican Gov.",
    "link": "https://www.msnbc.com/top-stories/latest/mike-braun-indiana-gerrymander-republicans-rcna240077",
    "timestamp": "2025-10-27T18:41:49Z"
  },
  {
    "title": "Federal workers brace for missed paycheck as shutdown enters 5th week",
    "description": "Government shutdown enters fifth week as federal workers face missed paychecks. Senate votes continue to fail while air traffic controllers and military await pay.",
    "link": "https://www.foxnews.com/politics/federal-workers-brace-missed-paycheck-shutdown-enters-5th-week",
    "timestamp": "2025-10-27T18:40:51Z"
  },
  {
    "title": "‘CBS Evening News’ Co-Host Announces He’s Leaving Show As Speculation Swirls Over Bari Weiss’ Next Moves",
    "description": "“CBS Evening News” co-host John Dickerson announced Monday he would be leaving the network via a social media post.",
    "link": "https://dailycaller.com/2025/10/27/cbs-evening-news-co-host-announces-departure-following-bari-weiss-editor-in-chief/",
    "timestamp": "2025-10-27T18:40:29Z"
  },
  {
    "title": "“These Are Dark Days… It’s Time to Fight Like Hell!” — An Angry, Fist-Shaking Joe Biden Emerges from Hiding to Blast Trump and Issue a Furious Call to Action (VIDEO)",
    "description": "An angry Joe Biden emerges from hiding to trash Trump as he accepts a lifetime achievement award for inspired leadership from the Edward M. Kennedy Institute in Boston. Credit: Fox News screenshot ==============================================================…",
    "link": "https://freerepublic.com/focus/f-news/4348945/posts",
    "timestamp": "2025-10-27T18:40:14Z"
  },
  {
    "title": "US officials descending on Israel spark claims of 'Bibi-sitting'",
    "description": "Some of the most senior officials from the US arriving in Israel has prompted some to re-imagine the phrase \"Bibi-sitting\" — and question the motive behind it.",
    "link": "https://www.abc.net.au/news/2025-10-28/netanyahu-rejects-us-babysitting-claims-israel-gaza-war/105937532",
    "timestamp": "2025-10-27T18:39:51Z"
  },
  {
    "title": "Target To Axe 1.8K Jobs After Boycott Impact",
    "description": "Target announced their first round of layoffs in a decade, the result of sustaining economic boycotts after it began to roll back DEI efforts earlier this year.",
    "link": "https://hiphopwired.com/2885168/target-to-axe-1800-jobs-after-boycott-impact/",
    "timestamp": "2025-10-27T18:39:35Z"
  },
  {
    "title": "German pharma grows on Trump tariff fears, industry says",
    "description": "Germany's pharmaceutical industry is anticipating strong growth in production and sales in 2025, even as the broader economy struggles, industry figures...",
    "link": "https://dpa-international.com/economics/urn:newsml:dpa.com:20090101:251027-99-454823/",
    "timestamp": "2025-10-27T18:39:28Z"
  },
  {
    "title": "Israeli families wait for release of remaining hostages in Gaza",
    "description": "The father of one of the dead hostages still in Gaza says he does not trust Hamas's assurances it is doing all it can to find and return the remains of Israelis.",
    "link": "https://www.abc.net.au/news/2025-10-28/israeli-families-wait-for-release-of-remaining-hostages-in-gaza/105940792",
    "timestamp": "2025-10-27T18:37:57Z"
  },
  {
    "title": "Michael Selig confirms CFTC nomination as agency faces leadership void",
    "description": "Michael Selig will likely face a hearing to consider his nomination as CFTC chair, but with a pending market structure bill, some concerns linger about the regulator’s leadership.",
    "link": "https://cointelegraph.com/news/mike-selig-cftc-chair-nomination-questions",
    "timestamp": "2025-10-27T18:37:50Z"
  },
  {
    "title": "Democrat Firm Sues To Take Out Blue City’s Latina GOP Rep, Crying Racial Discrimination",
    "description": "'A naked attempt to disenfranchise voters'",
    "link": "https://dailycaller.com/2025/10/27/nicole-malliotakis-new-york-redistricting-marc-elias/",
    "timestamp": "2025-10-27T18:35:04Z"
  },
  {
    "title": "Americanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again?",
    "description": "Harris and Trump have both said they’d be open to assuming the presidency after 2028.",
    "link": "https://www.bbc.co.uk/sounds/play/p0mc3v1g",
    "timestamp": "2025-10-27T18:35:00Z"
  },
  {
    "title": "Tariffs anxiety prompts US importers to place spring orders early",
    "description": "(Corrects surname to Curtis McGill from Curtis Gill in paragraph 23)  NEW YORK (Reuters) -Small importers for large U. retailers rushed in China-made...",
    "link": "https://finance.yahoo.com/news/tariffs-anxiety-prompts-us-importers-183433575.html",
    "timestamp": "2025-10-27T18:34:33Z"
  },
  {
    "title": "Putin boasts about new nuclear-powered missile as he digs in over Russia’s demands on Ukraine",
    "description": "Russian President Vladimir Putin is sending a message to President Donald Trump: Moscow wouldn’t be cowed into concessions on Ukraine.",
    "link": "https://biztoc.com/x/821ac2ff09c82829",
    "timestamp": "2025-10-27T18:33:37Z"
  },
  {
    "title": "Trapped between US and China, South Korea feels trade war's pressure",
    "description": "The delicate equilibrium South Korea has maintained between the security demands of the U.S. and the economic ties to China is facing unprecedented challenges. President Lee Jae Myung has recognized that the time has come for a strategic decision.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trapped-between-us-and-china-south-korea-feels-trade-wars-pressure/articleshow/124856487.cms",
    "timestamp": "2025-10-27T18:33:07Z"
  },
  {
    "title": "Poll Shows Stark Political Divide Over Bad Bunny Super Bowl Half-Time Show",
    "description": "A new poll shows support for the Spanish-performing musician is split along party lines.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2025/10/27/poll-shows-stark-political-divide-over-bad-bunny-super-bowl-half-time-show/",
    "timestamp": "2025-10-27T18:32:30Z"
  },
  {
    "title": "Mamdani rallies NYC voters with support from Bernie Sanders and AOC",
    "description": "New York City mayoral candidate Zohran Mamdani has rallied supporters with heavyweight support from U.S. Sen. Bernie Sanders and Rep. Alexandria Ocasio-Cortez.",
    "link": "https://www.pbs.org/newshour/politics/mamdani-rallies-nyc-voters-with-support-from-bernie-sanders-and-aoc",
    "timestamp": "2025-10-27T18:30:17Z"
  },
  {
    "title": "Donald Trump's Final Insult to Mike Pence Over Capitol Hill Riots Revealed in Former Deputy Prez's Secret Handwritten Notes",
    "description": "Donald Trump told his former deputy Mike Pence he would be forever remembered as a 'wimp' in their final phone call before the infamous January 6th riots.",
    "link": "https://radaronline.com/p/donald-trump-final-insult-mike-pence-capitol-hill-riots-handwritten-notes/",
    "timestamp": "2025-10-27T18:30:00Z"
  },
  {
    "title": "Jon Stewart Is ‘Working on Staying’ at ‘The Daily Show’ Past Current Contract",
    "description": "Stewart intends to continue his once-weekly schedule, but it’s not entirely up to him",
    "link": "https://www.cracked.com/article_48911_jon-stewart-is-working-on-staying-at-the-daily-show-past-current-contract.html",
    "timestamp": "2025-10-27T18:30:00Z"
  },
  {
    "title": "What another Fed cut could mean for borrowers — some rates may barely budge",
    "description": "Many types of consumer loans are impacted when the Fed trims its overnight lending rate.",
    "link": "https://www.cnbc.com/2025/10/27/federal-reserve-interest-rate-cut-what-to-expect.html",
    "timestamp": "2025-10-27T18:27:09Z"
  },
  {
    "title": "Donald Trump Confirms He Underwent MRI, Reveals Results of Medical Test",
    "description": "Donald Trump has revealed he got an MRI done, and revealed the results to the world. While on Air Force One, the 79-year-old POTUS shared the information. Keep reading to find out more… “I did. I got an MRI. It was perfect,” he said (via CNN). “I gave you the…",
    "link": "https://www.justjared.com/2025/10/27/donald-trump-confirms-he-underwent-mri-reveals-results-of-medical-test/",
    "timestamp": "2025-10-27T18:25:32Z"
  },
  {
    "title": "Bank of America revisits S&P 500 targets for rest of 2025",
    "description": "The stock market has defied gravity this year, rallying sharply higher in the face of weakening jobs data, rising inflation, and tariff-driven headwinds to profits. \nThe 35% rally in the S&P 500 since President Donald Trump paused most reciprocal tariffs in e…",
    "link": "https://biztoc.com/x/cba53a66597fe7aa",
    "timestamp": "2025-10-27T18:22:53Z"
  },
  {
    "title": "Why Did President Trump Get An mRNA COVID-19 Shot?",
    "description": "By David Gortler & Jay Richards via The Daily Signal | October 27, 2025\nOn Oct. 10, President Donald Trump’s physician, Dr. Sean P. Barbabella, announced that after conducting a battery of tests, he found that the president “remains in exceptional health” and…",
    "link": "https://biztoc.com/x/3f39c37bb0495c75",
    "timestamp": "2025-10-27T18:22:39Z"
  },
  {
    "title": "Trump says he underwent an MRI during Walter Reed visit",
    "description": "President Donald Trump revealed Monday that he underwent magnetic resonance imaging during his visit to Walter Reed National Military Medical Center earlier this month.",
    "link": "https://biztoc.com/x/5c3805bc990496f1",
    "timestamp": "2025-10-27T18:22:22Z"
  },
  {
    "title": "Putin boasts about new nuclear-powered missile as he digs in over Russia’s demands on Ukraine",
    "description": "Russian President Vladimir Putin is sending a message to President Donald Trump: Moscow wouldn’t be cowed into concessions on Ukraine.",
    "link": "https://www.pbs.org/newshour/world/putin-boasts-about-new-nuclear-powered-missile-as-he-digs-in-over-russias-demands-on-ukraine",
    "timestamp": "2025-10-27T18:21:42Z"
  },
  {
    "title": "'I know this sounds wacko': Key signs flagged that Trump will never leave the White House",
    "description": "An analyst pointed to signs that President Donald Trump will never leave the White House, admitting, \"I know this sounds crazy.\" Strategist Julie Roginsky tells MSNBC anchor Chris Jansing on Monday that Trump's response that he's not ruling out a third term —…",
    "link": "https://www.rawstory.com/donald-trump-third-term-2674237050/",
    "timestamp": "2025-10-27T18:20:06Z"
  },
  {
    "title": "Mexico’s Sheinbaum says she and Trump agreed to extend trade deadline",
    "description": "A 90-day pause in rise in US tariffs on Mexico from 25 to 30 percent was set to expire at the end of October.",
    "link": "https://www.aljazeera.com/economy/2025/10/27/mexicos-sheinbaum-says-she-and-trump-agreed-to-extend-trade-deadline",
    "timestamp": "2025-10-27T18:19:49Z"
  },
  {
    "title": "6 ways the shutdown is about to get worse",
    "description": "The government shutdown gets uglier at the end of this week. With President Donald Trump traveling abroad and Congress still deeply divided over a path to fund federal agencies, a pileup of deadlines on and around Nov. 1 is set to put many U.S. households at …",
    "link": "https://freerepublic.com/focus/f-bloggers/4348942/posts",
    "timestamp": "2025-10-27T18:18:37Z"
  },
  {
    "title": "Trump Makes Bizarre Boast About Beating AOC, Jasmine Crockett In Dementia Test",
    "description": "Trump suggested a test involving identifying \"a tiger, an elephant, a giraffe\" is a measure of intelligence.",
    "link": "https://www.huffpost.com/entry/trump-iq-dementia-test-aoc-crockett_n_68ff9fade4b0fb1b9515815e",
    "timestamp": "2025-10-27T18:18:34Z"
  },
  {
    "title": "Trump Hopes to Bully SCOTUS Into Upholding His Tariffs",
    "description": "Will it work?",
    "link": "https://reason.com/2025/10/28/trump-hopes-to-bully-scotus-into-upholding-his-tariffs/",
    "timestamp": "2025-10-27T18:17:54Z"
  },
  {
    "title": "Courts are hampering Trump's efforts to cancel funding approved by Congress",
    "description": "President Donald Trump’s administration has canceled, or threatened to cancel, billions of dollars of previously approved federal spending and wants to go after even more funding during the shutdown. But an Associated Press analysis shows courts have hampered…",
    "link": "https://apnews.com/article/trump-spending-impoundment-congress-constitution-51c422c4f0c8b646643cc1ea7f699474",
    "timestamp": "2025-10-27T18:17:22Z"
  },
  {
    "title": "British political commentator Sami Hamdi detained by ICE while on U.S. speaking tour",
    "description": "British political commentator Sami Hamdi has been detained by U.S. Immigration and Customs Enforcement officers at San Francisco International Airport.",
    "link": "https://www.pbs.org/newshour/nation/british-political-commentator-sami-hamdi-detained-by-ice-while-on-u-s-speaking-tour",
    "timestamp": "2025-10-27T18:15:31Z"
  },
  {
    "title": "Trump doubles down, announces massive construction project as critics fume over ballroom takedown",
    "description": "President Donald Trump is emphasizing fresh renovations at the Kennedy Center while experiencing backlash for his $300 million, 90,000-square-foot ballroom initiative at the White House. Although promising not to “interfere” with the past structure, Trump cit…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-doubles-down-announces-massive-construction-project-as-critics-fume-over-ballroom-takedown/articleshow/124854393.cms",
    "timestamp": "2025-10-27T18:14:25Z"
  },
  {
    "title": "Republicans work to make Zohran Mamdani the face of the Democratic Party",
    "description": "Republicans are working to tie Zohran Mamdani, the Democratic socialist running for New York mayor, to the entire Democratic Party ahead of the midterm elections next year.",
    "link": "https://www.nbcnews.com/politics/elections/republicans-work-make-zohran-mamdani-face-democratic-party-rcna240069",
    "timestamp": "2025-10-27T18:13:39Z"
  },
  {
    "title": "‘The View’ Co-Host Sunny Hostin Says Trump Is ‘Hooking Up’ the White House ‘Because He Doesn’t Plan on Leaving’",
    "description": "\"He's done everything that people thought he would never do,\" she adds\nThe post ‘The View’ Co-Host Sunny Hostin Says Trump Is ‘Hooking Up’ the White House ‘Because He Doesn’t Plan on Leaving’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-view-sunny-hostin-trump-third-term-ballroom/",
    "timestamp": "2025-10-27T18:13:16Z"
  },
  {
    "title": "TDS-Suffering Author Stephen King’s Nasty Social Media Attack on Trump Spectacularly Backfires After Users Notice a Blatant Error on His Part",
    "description": "Trump-hating author Stephen King clearly lives in the world of fiction because he proved on Sunday that he cannot distinguish between satire and reality. King and some of his fellow leftists thought they saw an opportunity to dunk on President Trump for a pos…",
    "link": "https://freerepublic.com/focus/f-chat/4348940/posts",
    "timestamp": "2025-10-27T18:12:43Z"
  },
  {
    "title": "Israel says it has received body of deceased hostage transferred from Hamas | CNN",
    "description": "Israeli authorities said Monday they had received the coffin of a deceased hostage from Gaza.",
    "link": "https://www.cnn.com/2025/10/27/middleeast/hamas-return-hostage-body-monday-latam-intl",
    "timestamp": "2025-10-27T18:12:20Z"
  },
  {
    "title": "Milei’s Party Wins Argentina Midterm Vote in Major Comeback",
    "description": "President Javier Milei’s party won Argentina’s midterm vote Sunday, a result that will give the libertarian leader a strong foothold in Congress to continue pursuing aggressive free-market policies that have won praise and a financial lifeline from Donald Tru…",
    "link": "https://biztoc.com/x/fa313c85385428df",
    "timestamp": "2025-10-27T18:11:25Z"
  },
  {
    "title": "Fox News' Jesse Watters to interview Erika Kirk in her first sit-down since husband's assassination",
    "description": "Fox News host Jesse Watters conducted an exclusive interview with Erika Kirk, the new Turning Point USA CEO, and widow of assassinated founder Charlie Kirk that will air on Nov. 5.",
    "link": "https://www.foxnews.com/media/fox-news-jesse-watters-interview-erika-kirk-her-first-sit-down-since-husbands-assassination",
    "timestamp": "2025-10-27T18:11:09Z"
  },
  {
    "title": "Ford defends Ontario's anti-tariff ad that angered Trump, says he achieved his goal",
    "description": "Premier Doug Ford says he achieved his goal with an advertisement by the Ontario government that uses the former U.S. president Ronald Reagan's own words to send an anti-tariff message to American audiences.",
    "link": "https://www.cbc.ca/news/canada/toronto/ford-defends-ontario-anti-tariff-campaign-9.6955261",
    "timestamp": "2025-10-27T18:11:05Z"
  },
  {
    "title": "'It won’t work': Analyst warns Trump repeating major mistake from ex-president",
    "description": "An analyst warns the \"Trump-inflicted damage\" to the U.S. economy will backfire on the Republican Party because \"Americans are not fooled.\" In an opinion piece for MSNBC, Helaine R. Olen, author of \"Pound Foolish: Exposing the Dark Side of the Personal Financ…",
    "link": "https://www.rawstory.com/donald-trump-economy-2674236833/",
    "timestamp": "2025-10-27T18:09:37Z"
  },
  {
    "title": "Trump Casually Admits He Got an MRI — and the Internet Has Some Serious Questions",
    "description": "After President Donald Trump casually told reporters aboard Air Force One that he underwent a \"perfect\" MRI during his last physical, keyboard physicians are hard at work, speculating over one key question: Why?\nThe post Trump Casually Admits He Got an MRI — …",
    "link": "https://www.mediaite.com/online/trump-casually-admits-he-got-an-mri-and-the-internet-has-some-serious-questions/",
    "timestamp": "2025-10-27T18:08:00Z"
  },
  {
    "title": "Tell Us More About Your 'Perfect' MRI, Mr. President, Sir",
    "description": "Donald J. Trump, the oldest man to be inaugurated as US president, told reporters on Monday that he had undergone an MRI scan during his recent visit to Walter Reed Medical Center. “It was perfect,” he said. However, there is no such thing as a \"perfect\" MRI,…",
    "link": "https://crooksandliars.com/2025/10/tell-us-more-about-your-perfect-mri-mr",
    "timestamp": "2025-10-27T18:06:31Z"
  },
  {
    "title": "Diddy to Be Released From Prison in May 2028",
    "description": "Sean “Diddy” Combs is expected to be released from prison on May 8, 2028, according to the Federal Bureau of Prisons. On Oct. 3, the Bad Boy Records founder was sentenced to 50 months behind bars after he was convicted on two counts of transportation to engag…",
    "link": "https://variety.com/2025/music/news/when-will-diddy-be-released-from-prison-1236562240/",
    "timestamp": "2025-10-27T18:06:05Z"
  },
  {
    "title": "What Trump Could Learn From Ulysses S. Grant",
    "description": "The last American crisis over civilian-military relations ended with a general’s historic choice.",
    "link": "https://www.theatlantic.com/politics/archive/2025/10/history-civil-military-relations/684640/",
    "timestamp": "2025-10-27T18:05:34Z"
  },
  {
    "title": "The New Sign Trump Is Planning a Midterm-Elections Power Grab",
    "description": "In Truth Social posts blasting the voting methods a majority of voters prefer, Trump is again signaling he’ll do whatever it takes to pull off a midterms power grab.",
    "link": "http://nymag.com/intelligencer/article/trump-prop-50-attack-early-mail-in-voting-midterm-elections-power-grab.html",
    "timestamp": "2025-10-27T18:04:16Z"
  },
  {
    "title": "Run It Back? : Kamala Harris Strongly Hints At Running For President Again",
    "description": "Kamala Harris spoke with Laura Kuenssberg and gave folks the strongest vibes yet that she wants to run again, while shutting down polls claiming that she isn't the favorite to earn the Democratic nomination for president.",
    "link": "https://hiphopwired.com/2885244/kamala-harris-possible-second-presidential-run-reactions/",
    "timestamp": "2025-10-27T18:03:57Z"
  },
  {
    "title": "A neurological issue was the first possibility the doctor mentioned.",
    "description": "A prominent cardiologist believes President Donald Trump may have quietly had an MRI scan because he showed symptoms associated with a neurological issue. Dr...",
    "link": "https://www.thedailybeast.com/why-do-people-need-an-mri-scan-doctors-tell-why-trump-quietly-got-one/",
    "timestamp": "2025-10-27T18:03:12Z"
  },
  {
    "title": "Seeing the National Guard on our streets is bad — but we must beware Trump's Plan B",
    "description": "I saw some of my former Naval War College colleagues at the recent No Kings rally in Providence. Given that National Guard troops and protestors had clashed in Los Angeles at an earlier June rally protesting ICE raids, we wondered whether we would see Nationa…",
    "link": "https://www.rawstory.com/national-guard-2674236469/",
    "timestamp": "2025-10-27T18:01:29Z"
  },
  {
    "title": "Jon Stewart ‘working’ to remain at Comedy Central despite being ‘upset’ by parent company",
    "description": "It has been unclear if Jon Stewart would remain at Comedy Central once his current contract expires with newly merged Paramount, a Skydance Corporation, installed as its parent company.",
    "link": "https://www.foxnews.com/media/jon-stewart-working-remain-comedy-central-despite-being-upset-parent-company",
    "timestamp": "2025-10-27T18:01:28Z"
  },
  {
    "title": "That Trump Tweet About the World Series Being ‘Rigged’ Is Fake",
    "description": "It's getting harder to tell which unhinged Trump tweets are real.",
    "link": "https://gizmodo.com/trump-blue-jays-dodgers-fake-tweet-2000677520",
    "timestamp": "2025-10-27T18:00:57Z"
  },
  {
    "title": "Trump Sons' American Bitcoin Stock Jumps After Adding $163 Million to BTC Treasury",
    "description": ", the publicly traded Bitcoin treasury and mining company backed by Eric Trump and Donald Trump Jr., has added 1,414 Bitcoin currently worth $163 million to its holdings, according to an announcement on Monday.\nMiami, Florida-based American Bitcoin, a subsidi…",
    "link": "https://biztoc.com/x/37f3b72a42eb498f",
    "timestamp": "2025-10-27T18:00:47Z"
  },
  {
    "title": "Why Trump’s Argentine beef plan angers his own party",
    "description": "President Donald Trump has stumbled into an unexpected political minefield that has fractured his typically loyal Republican base: a decision to dramatically increase beef imports from Argentina that has cattle ranchers and their congressional representatives…",
    "link": "https://rollingout.com/2025/10/27/why-trumps-argentine-beef-plan-angers/",
    "timestamp": "2025-10-27T18:00:24Z"
  },
  {
    "title": "Coffee Break: American Politics Follow the Money & Power Edition",
    "description": "\"Follow the money (plus)\" is an essential guide for those wishing to understand American politics in the Trump 2.0 era. Let's follow the money to The White House bunker and below.",
    "link": "https://www.nakedcapitalism.com/2025/10/follow-the-money-power-trump-mellon-mamdani-east-wing-bunker.html",
    "timestamp": "2025-10-27T18:00:20Z"
  }
]