[
  {
    "title": "Communist Cuba \"On Edge of Collapse\" Due to Trump's Oil Embargo of Cuba's Key Ally Venezuela",
    "description": "Late last week, Trump seized a second Venezuelan tanker. Now he's tracking a third tanker from the \"dark fleet.\" The U.S. Coast Guard is pursuing a sanctioned oil tanker near Venezuela as President Donald Trump intensifies his pressure campaign against...",
    "link": "https://acecomments.mu.nu/?post=417808",
    "timestamp": "2025-12-22T20:32:44Z"
  },
  {
    "title": "Are banks and post offices open Christmas Eve and Christmas Day?",
    "description": "Here's which public services will be open and closed Dec. 24 and Dec. 25 in Greater Cincinnati.",
    "link": "https://www.cincinnati.com/story/news/2025/12/22/are-cincinnati-banks-post-offices-open-christmas-eve-christmas/87883945007/",
    "timestamp": "2025-12-22T20:31:59Z"
  },
  {
    "title": "Bari Weiss Just Gave Trump a Kill Switch Over 60 Minutes",
    "description": "The most dangerous part of Bari Weiss’s decision to pull a “60 Minutes” segment last weekend isn’t that she exercised her authority. It’s the precedent she set.\nThe post Bari Weiss Just Gave Trump a Kill Switch Over 60 Minutes first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/bari-weiss-just-gave-trump-a-kill-switch-over-60-minutes/",
    "timestamp": "2025-12-22T20:30:43Z"
  },
  {
    "title": "WATCH LIVE: President Trump, War Secretary Hegseth make an announcement | Fox News Video",
    "description": "President Donald Trump makes an announcement in Palm Beach, Florida, joined by Secretary of War Pete Hegseth and Secretary of the Navy John Phelan.",
    "link": "https://www.foxnews.com/video/6386840485112",
    "timestamp": "2025-12-22T20:29:58Z"
  },
  {
    "title": "NBA YoungBoy Gifts Son Kentrell Jr. A Puppy, Yaya Mayweather Reveals: \"Best Christmas Surprise\"",
    "description": "NBA YoungBoy bought his son Kentrell DeSean Gaulden Jr. a puppy for Christmas, and Yaya Mayweather shared the news online. See the adorable photos on Rap-Up.",
    "link": "https://www.rap-up.com/article/nba-youngboy-kentrell-jr-puppy-christmas-gift",
    "timestamp": "2025-12-22T20:25:18Z"
  },
  {
    "title": "Trump to make announcement with Hegseth after latest oil tanker seizure near Venezuela",
    "description": "President Donald Trump is scheduled to make an announcement from his home in Florida on Monday alongside Defense Secretary Pete Hegseth and Secretary of the Navy John Phelan. The event is planned for 4:30 p.m. ET, but further details have not been released ab…",
    "link": "https://freerepublic.com/focus/f-news/4358590/posts",
    "timestamp": "2025-12-22T20:24:05Z"
  },
  {
    "title": "MAGA Hosts Say Trump Should Die Before Renaming Kennedy Center",
    "description": "Hosts of the pro-MAGA Real America's Voice network agreed that the Kennedy Center should not be renamed until President Donald Trump is dead.\n\n\nHosts Emily Finn, Gina Loudon, Terrance Bates, and David Brody discussed the name change on Monday.\n\n\n\"Now, Congres…",
    "link": "https://crooksandliars.com/2025/12/maga-hosts-say-trump-should-die-renaming",
    "timestamp": "2025-12-22T20:24:03Z"
  },
  {
    "title": "George Conway files paperwork to run for Congress as a Democrat (Ben Kamisar/NBC News)",
    "description": "Ben Kamisar / NBC News:\nGeorge Conway files paperwork to run for Congress as a Democrat  —  Conway would run in the crowded primary for the New York House seat currently held by retiring Rep. Jerry Nadler.  —  George Conway, the former conservative lawyer tur…",
    "link": "https://www.memeorandum.com/251222/p84",
    "timestamp": "2025-12-22T20:20:00Z"
  },
  {
    "title": "Trump-Endorsed Health Care Plan Suffers Major Blow - NewsBreak",
    "description": "President Donald Trump endorsed a GOP plan to address rising healthcare costs by providing one-time Health Savings Account (HSA) deposits for certain Affor",
    "link": "https://www.newsbreak.com/share/4408470327986-trump-endorsed-health-care-plan-suffers-major-blow?s=a7&amp;share_destination_id=Njc1MTA5NDktMTc2NjQzNDQ2NjU3OQ%3D%3D&amp;pd=04ZGgHsy&amp;hl=en_US&amp;send_time=1766434466&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.51.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-22T20:17:49Z"
  },
  {
    "title": "Devastating New Poll Shows Trump Underwater by 23 Points — and a Whopping 43 Points With Independents",
    "description": "A devastating new poll showed no improvement in Donald Trump's approval ratings, which remained at the lowest point they've been in his second term.\nThe post Devastating New Poll Shows Trump Underwater by 23 Points — and a Whopping 43 Points With Independents…",
    "link": "https://www.mediaite.com/media/news/devastating-new-poll-shows-trump-underwater-by-23-points-and-a-whopping-43-points-with-independents/",
    "timestamp": "2025-12-22T20:16:52Z"
  },
  {
    "title": "Marsha Blackburn Bundles Every Bad Tech Bill Into One, Slaps Trump’s Name On It",
    "description": "Fourteen years ago, right after the FCC issued its order on net neutrality, Marsha Blackburn flipped out and released a video talking (misleadingly!) about how wonderful Facebook and Twitter were and how they would be destroyed if the big evil government inte…",
    "link": "https://www.techdirt.com/2025/12/22/marsha-blackburn-bundles-every-bad-tech-bill-into-one-slaps-trumps-name-on-it/",
    "timestamp": "2025-12-22T20:16:41Z"
  },
  {
    "title": "Trump Is Ignoring the Biggest Obstacle to Peace in Ukraine",
    "description": "The president doesn’t seem to understand that making peace is not a one-off gesture.",
    "link": "https://slate.com/news-and-politics/2025/12/trump-russia-ukraine-putin-witkoff-talks.html",
    "timestamp": "2025-12-22T20:15:38Z"
  },
  {
    "title": "'Blatant Act of Retaliation': Trump Denies Colorado Request for Fire, Flooding Disaster Relief",
    "description": "Top Democratic officials in Colorado are among those condemning President Donald Trump's denial of two disaster relief requests from Gov. Jared Polis—his latest action in a state that critics say he is retaliating against for its prosecution of a former count…",
    "link": "https://www.commondreams.org/news/colorado-flood",
    "timestamp": "2025-12-22T20:15:26Z"
  },
  {
    "title": "Trump's New Greenland Ambassador Immediately Angers Denmark After Taking Envoy Job",
    "description": "After being appointed the US's special envoy to Greenland, Louisiana Governor Jeff Landry echoed President Donald Trump's plans to make Greenland part of the US, angering Denmark.",
    "link": "https://www.ibtimes.com/trumps-new-greenland-ambassador-immediately-angers-denmark-after-taking-envoy-job-3793483",
    "timestamp": "2025-12-22T20:12:26Z"
  },
  {
    "title": "'Corruption, Pure and Simple': Probe Identifies Rich Donors Benefiting From Trump Presidency",
    "description": "A detailed investigation published Monday shows that many wealthy and powerful contributors to US President Donald Trump's staggering post-election fundraising haul—now at roughly $2 billion—have seen a return on their money in the form of pardons, corporate-…",
    "link": "https://www.commondreams.org/news/trump-post-election-donors",
    "timestamp": "2025-12-22T20:12:20Z"
  },
  {
    "title": "Gold jumps to all-time peak, silver follows with record gain | Honolulu Star-Advertiser",
    "description": "Gold jumped more than 2% to a record high today, powered by safe-haven flows as U.S.-Venezuela tensions flared, while silver also touched an all-time peak.",
    "link": "https://www.staradvertiser.com/2025/12/22/breaking-news/gold-jumps-to-all-time-peak-silver-follows-with-record-gain/",
    "timestamp": "2025-12-22T20:08:24Z"
  },
  {
    "title": "OK, Which One Of You Forced Poor JD Vance To Apologize For Being White?",
    "description": "He's very upset about it!",
    "link": "https://www.wonkette.com/p/ok-which-one-of-you-forced-poor-jd",
    "timestamp": "2025-12-22T20:07:04Z"
  },
  {
    "title": "Trump-Endorsed Health Care Plan Suffers Major Blow - NewsBreak",
    "description": "President Donald Trump endorsed a GOP plan to address rising healthcare costs by providing one-time Health Savings Account (HSA) deposits for certain Affor",
    "link": "https://www.newsbreak.com/share/4408470327986-trump-endorsed-health-care-plan-suffers-major-blow?_f=app_share&amp;pd=05axlBno&amp;lang=en_US&amp;send_time=1766433951&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.51.0.54%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-22T20:06:19Z"
  },
  {
    "title": "Trump’s Plan to Corrupt the Media Is Starting to Work",
    "description": "CBS pulled a critical story after the president complained about the network’s coverage.",
    "link": "https://www.theatlantic.com/politics/2025/12/cbs-news-bari-weiss-trump-media-influence/685381/",
    "timestamp": "2025-12-22T20:06:00Z"
  },
  {
    "title": "11 of Our Most Memorable Pieces from 2025",
    "description": "Revisit writing from this year that we’re proud to have run. \nThe post 11 of Our Most Memorable Pieces from 2025  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/12/22/11-of-our-most-memorable-pieces-from-2025/",
    "timestamp": "2025-12-22T20:04:38Z"
  },
  {
    "title": "Trump team triples bonus to $3,000 for migrants who self-deport",
    "description": "The $3,000 stipend is triple the $1,000 payout the department unveiled in May.",
    "link": "https://fortune.com/2025/12/22/trump-administration-offering-3000-bonus-paid-travel-voluntary-deportation/",
    "timestamp": "2025-12-22T20:04:17Z"
  },
  {
    "title": "FCC Commissioner Calls CBS News Decision To Pull ’60 Minutes’ Segment “Deeply Alarming,” Warns Of Trump Getting “Veto Power Over Critical Reporting”",
    "description": "The sole Democrat on the FCC said that the CBS News decision to pull a 60 Minutes segment on Trump administration deportations is “deeply alarming” and risks giving the government “veto power over critical reporting by simply refusing to engage.” Commissioner…",
    "link": "http://deadline.com/2025/12/fcc-60-minutes-bari-weiss-deportation-segment-1236655315/",
    "timestamp": "2025-12-22T20:03:27Z"
  },
  {
    "title": "The Epstein files divided Trump's base and now more fights are brewing",
    "description": "The release of the Epstein files followed a rare revolt against Donald Trump by some of his dedicated supporters. Here are six more issues that could also divide Republicans.",
    "link": "https://www.abc.net.au/news/2025-12-23/issues-dividing-donald-trump-maga-republicans/106156312",
    "timestamp": "2025-12-22T20:02:46Z"
  },
  {
    "title": "Trump Loses GOP Support on China Policy",
    "description": "Add Republican objections to Trump’s China capitulations to the growing realm of defections from leaders of his own party.\nThe post Trump Loses GOP Support on China Policy appeared first on The American Prospect.",
    "link": "http://prospect.org/2025/12/22/trump-loses-gop-support-china-policy/",
    "timestamp": "2025-12-22T20:00:00Z"
  },
  {
    "title": "'Be wary': Analysts raise questions over 'uncertainty' of Trump's DJT stock and merger",
    "description": "DJT, Trump Media & Technology Group Corp., stock has reportedly been performing well, but investors may want to exercise caution.Investors should not count on Trump Media after last week's surge, following President Donald Trump's announcement of a major merg…",
    "link": "https://www.rawstory.com/donald-trump-stock-price/",
    "timestamp": "2025-12-22T19:59:05Z"
  },
  {
    "title": "Megyn Kelly Says Ben Shapiro's Attack “Flabbergasted” Her: “Betrayal By a Friend”",
    "description": "As AmericaFest convened the likes of Erika Kirk, Tucker Carlson, Kelly, Shapiro, and other conservative stars, MAGA was anything but united.",
    "link": "https://www.vanityfair.com/news/story/megyn-kelly-ben-shapiro-americafest-maga",
    "timestamp": "2025-12-22T19:58:53Z"
  },
  {
    "title": "Nicki Minaj showed up at at Turning Point event, made an “assassin” joke, and turned a surprise cameo into a mess",
    "description": "Nicki Minaj made a surprise appearance at Turning Point USA’s AmericaFest on Sunday, joining Erika Kirk onstage in a moment that quickly sent social media into a spiral. \n\n\nThe rapper, who has recently aligned herself with MAGA politics and publicly praised P…",
    "link": "https://www.dailydot.com/viral-politics/erika-kirk-nicki-minaj-turning-point-usa/",
    "timestamp": "2025-12-22T19:58:08Z"
  },
  {
    "title": "5 things to watch on the ASX 200 on Tuesday",
    "description": "Here's what to expect on the local market today.\nThe post 5 things to watch on the ASX 200 on Tuesday appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/12/23/5-things-to-watch-on-the-asx-200-on-tuesday-23-december-2025/",
    "timestamp": "2025-12-22T19:58:07Z"
  },
  {
    "title": "Maryland congresswoman introduces legislation to overturn Kennedy Center renaming efforts",
    "description": "Congresswoman April McClain Delaney called the renaming \"a betrayal of President Kennedy's legacy.\"",
    "link": "https://www.wusa9.com/article/entertainment/kennedy-center-name-change-legislation/65-bf4090f9-5572-4819-9591-f1e966a47607",
    "timestamp": "2025-12-22T19:57:37Z"
  },
  {
    "title": "‘Hostile’ European NATO policies raise risk of clash – Moscow",
    "description": "Russian Deputy Foreign Minister Sergey Ryabkov has accused European NATO members of escalating the risk of a direct conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629881-ryabkov-hostile-nato-policies/",
    "timestamp": "2025-12-22T19:57:20Z"
  },
  {
    "title": "EXCLUSIVE: New Trump Admin Rules To Weed Out Migrants Defrauding Domestic Abuse Benefits",
    "description": "The Trump administration's USCIS is rolling out new guidelines intended to put a stop to foreigners exploiting domestic abuse claims for immigration benefits.",
    "link": "https://dailycaller.com/2025/12/22/uscis-to-weed-out-vawa-migrant-fraud/",
    "timestamp": "2025-12-22T19:56:57Z"
  },
  {
    "title": "Ted Cruz Eyes 2028 Bid, Vance Showdown Looms",
    "description": "Sen. Ted Cruz, R-Texas, reportedly is considering a 2028 presidential run, which could put him on a collision course with Vice President JD Vance.Cruz privately has been signaling to allies that he's hearing growing encouragement to jump into the next open Re…",
    "link": "https://freerepublic.com/focus/f-bloggers/4358584/posts",
    "timestamp": "2025-12-22T19:56:04Z"
  },
  {
    "title": "Ted Cruz Eyes 2028 Bid, Vance Showdown Looms",
    "description": "Sen. Ted Cruz, R-Texas, reportedly is considering a 2028 presidential run, which could put him on a collision course with Vice President JD Vance.Cruz privately has been signaling to allies that he's hearing growing encouragement to jump into the next open Re…",
    "link": "https://freerepublic.com/focus/f-news/4358584/posts",
    "timestamp": "2025-12-22T19:56:04Z"
  },
  {
    "title": "Judge urged to visit 'Alligator Alcatraz' to assess detainees' access to lawyers",
    "description": "Attorneys for detainees at a Florida immigration detention center known as “Alligator Alcatraz” want a federal judge to visit the facility",
    "link": "https://abcnews.go.com/Politics/wireStory/attorneys-urge-judge-visit-alligator-alcatraz-assess-detainees-128626163",
    "timestamp": "2025-12-22T19:55:52Z"
  },
  {
    "title": "JUST IN: US conducts surveillance flights over Nigeria after Trump threats — Report",
    "description": "Recent reports indicate the US is conducting intelligence-gathering flights over Nigeria, signaling new security cooperation between the two nations.\n\nRead More: https://punchng.com/just-in-us-conducts-surveillance-flights-over-nigeria-after-trump-threats-rep…",
    "link": "https://punchng.com/?p=2016893",
    "timestamp": "2025-12-22T19:54:15Z"
  },
  {
    "title": "Evita Duffy-Alonso, daughter of transportation secretary, accuses TSA of ‘absurdly invasive’ pat-down",
    "description": "“All this for an unconstitutional agency that isn’t even good at its job,” she said, adding that she nearly missed her flight.",
    "link": "https://fortune.com/2025/12/22/evita-duffy-alonso-daughter-of-transportation-secretary-accuses-tsa-of-absurdly-invasive-pat-down/",
    "timestamp": "2025-12-22T19:51:19Z"
  },
  {
    "title": "Pentagon calls for investigation of Vindman brothers’ money-making schemes",
    "description": "Ukraine operations required 'pre-approval' from officials at State, Army",
    "link": "https://www.wnd.com/2025/12/pentagon-calls-investigation-vindman-brothers-money-making-schemes/",
    "timestamp": "2025-12-22T19:47:46Z"
  },
  {
    "title": "What to know about Trump's $1 million 'Gold Card' visas",
    "description": "For the hefty price of $1 million, plus at least $15,000 in fees, you can get permanent residency in the United States.",
    "link": "https://www.businessinsider.com/trump-gold-platinum-card-corporate-immigration-visas-2025-12",
    "timestamp": "2025-12-22T19:47:19Z"
  },
  {
    "title": "‘Rats fleeing sinking Ukrainian ship’ – Russian intel",
    "description": "Ukrainian officials expect the Zelensky regime to collapse and are moving their families abroad, Russia’s Foreign Intelligence Service says Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629891-svr-ukrainian-officials-preparing-flee-abroad/",
    "timestamp": "2025-12-22T19:46:40Z"
  },
  {
    "title": "Notorious crypto conman Sam Bankman-Fried has a prison passion project: giving legal advice to other inmates",
    "description": "The face of crypto fraud is helping other criminals prepare for their court cases.",
    "link": "https://fortune.com/2025/12/22/notorious-crypto-conman-sam-bankman-fried-giving-legal-advice-to-other-inmates/",
    "timestamp": "2025-12-22T19:45:55Z"
  },
  {
    "title": "'I'll Give Him Hell': Trump Threatens to 'Fire' His Son Donald Jr Over His Speech During Annual Turning Point Conference",
    "description": "Donald Trump bizarrely threatened to 'fire' his son Donald Jr. while he was speaking at a Turning Point USA event.",
    "link": "https://radaronline.com/p/donald-trump-donald-jr-fired-threat/",
    "timestamp": "2025-12-22T19:45:00Z"
  },
  {
    "title": "Nicki Minaj Goes Radio Silent After Joking J.D. Vance Is An ‘Assassin’ To Widow Erika Kirk, VP Proceeds To Profoundly Praise Onika",
    "description": "Nicki Minaj makes awkward onstage flub, J.D. Vance responds with grace, highlighting unity over division.\nThe post Nicki Minaj Goes Radio Silent After Joking J.D. Vance Is An ‘Assassin’ To Widow Erika Kirk, VP Proceeds To Profoundly Praise Onika appeared firs…",
    "link": "https://bossip.com/4214455/nicki-minaj-jd-vance-erika-kirk/",
    "timestamp": "2025-12-22T19:44:33Z"
  },
  {
    "title": "Bitcoin does cultural diplomacy in a dive bar",
    "description": "Bitcoin culture, by nature, is anarchical and chaotic. It has to be, given the nature of Bitcoin itself and the people who adopted it: free-market libertarians who've gone all in on turning computer code into a form of money divorced from central banks, gover…",
    "link": "https://www.theverge.com/policy/849133/pubkey-dc-opening-bitcoin-bar",
    "timestamp": "2025-12-22T19:43:43Z"
  },
  {
    "title": "Hamas-Linked Activist Org Sets Up Shop In America’s Capital",
    "description": "An activist group steeped in legal battles over alleged support for Hamas announced its new DMV chapter, expanding its presence around the nation's capital.",
    "link": "https://dailycaller.com/2025/12/22/hamas-linked-activist-org-sets-up-shop-in-americas-capital/",
    "timestamp": "2025-12-22T19:42:45Z"
  },
  {
    "title": "Car bomb kills Russian army general in Moscow, officials say",
    "description": "The Kremlin is probing who is behind the killing, which has similarities to previous attacks by Ukrainian special services.",
    "link": "https://www.abc.net.au/news/2025-12-23/russian-general-fanil-sarvarov-killed-by-car-bomb-in-moscow/106172592",
    "timestamp": "2025-12-22T19:41:58Z"
  },
  {
    "title": "Trump-Endorsed Health Care Plan Suffers Major Blow - NewsBreak",
    "description": "President Donald Trump endorsed a GOP plan to address rising healthcare costs by providing one-time Health Savings Account (HSA) deposits for certain Affor",
    "link": "https://www.newsbreak.com/share/4408470327986-trump-endorsed-health-care-plan-suffers-major-blow?_f=app_share&amp;pd=0M8pYS7D&amp;lang=en_US&amp;send_time=1766432327&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.51.0.54%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-22T19:41:39Z"
  },
  {
    "title": "The 9th Circuit Upholds a University of Washington Professor's Right to Mock 'Land Acknowledgments'",
    "description": "The appeals court ruled that administrators violated Stuart Reges' First Amendment rights when they investigated and threatened to punish him for constitutionally protected speech.",
    "link": "https://reason.com/2025/12/22/the-9th-circuit-upholds-a-university-of-washington-professors-right-to-mock-land-acknowledgments/",
    "timestamp": "2025-12-22T19:41:24Z"
  },
  {
    "title": "The MAGA civil war takes center stage at the Turning Point USA conference",
    "description": "‘Americafest 2025′ was a who’s who of right-wing heavyweights eager to settle scores and lay claim to the future of MAGA",
    "link": "https://theweek.com/politics/tp-usa-maga-civil-war-vance-fuentes-carlton-owens-kirk",
    "timestamp": "2025-12-22T19:39:34Z"
  },
  {
    "title": "Trump has always hated offshore wind. Now he’s moving to kill it.",
    "description": "The Trump administration has halted five already approved offshore wind projects despite rising electricity demand.",
    "link": "https://grist.org/energy/trump-has-always-hated-offshore-wind-now-hes-moving-to-kill-it/",
    "timestamp": "2025-12-22T19:36:25Z"
  },
  {
    "title": "Trump has always hated offshore wind. Now he’s moving to kill it.",
    "description": "The Trump administration has halted 5 already approved offshore wind projects despite rising electricity demand.",
    "link": "https://grist.org/climate-energy/trump-has-always-hated-offshore-wind-now-hes-moving-to-kill-it/",
    "timestamp": "2025-12-22T19:36:25Z"
  },
  {
    "title": "'That’s the knife twist': Ex-GOP strategist warns latest Trump 'cover-up will not survive'",
    "description": "Former GOP strategist Rick Wilson warned President Donald Trump on Monday that Jeffrey Epstein's survivors and the public won't give up on pursuing the truth. In his Substack essay, the Lincoln Project co-founder described how \"Donald Trump, Pam Bondi, Todd B…",
    "link": "https://www.rawstory.com/donald-trump-epstein-survivors/",
    "timestamp": "2025-12-22T19:36:12Z"
  },
  {
    "title": "Bari Weiss’ CBS News Gaffes Pile Up as Paramount Tries to Woo Warner",
    "description": "CBS News is increasingly looking like something out of a scripted drama by Aaron Sorkin. In shows like “The Newsroom” and “Sports Night,” the well-regarded writer sketched stories of feisty media outlets just trying to get news to the people, even though doin…",
    "link": "https://variety.com/2025/tv/news/bari-weiss-cbs-news-gaffes-paramount-warner-deal-1236615047/",
    "timestamp": "2025-12-22T19:33:05Z"
  },
  {
    "title": "Is USPS open on Christmas Eve? Here's what’s open and closed on Christmas Eve 2025? Stock market, mail and delivery services explained",
    "description": "Christmas Eve 2025 brings changes for many services. Federal offices will largely close, though essential services remain. Post offices will operate with regular mail delivery. UPS and FedEx offer modified delivery and pickup options. Amazon continues its del…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-usps-open-on-christmas-eve-heres-whats-open-and-closed-on-christmas-eve-2025-stock-market-mail-and-delivery-services-explained/articleshow/126127731.cms",
    "timestamp": "2025-12-22T19:32:34Z"
  },
  {
    "title": "Syria: At least 2 killed in Aleppo clashes between army and SDF",
    "description": "The Syrian army and the Kurdish-led SDF traded the blame over the reason for the attacks in Aleppo. Turkey blames Kurdish forces for not wanting to integrate into Syria's newly-established army. A series of clashes erupted in the Syrian city of Aleppo, result…",
    "link": "https://www.dw.com/en/syria-at-least-2-killed-in-aleppo-clashes-between-army-and-sdf/a-75275615",
    "timestamp": "2025-12-22T19:32:00Z"
  },
  {
    "title": "Attorneys urge judge to visit Florida detention center to assess detainees’ access to lawyers",
    "description": "The case is one of three federal lawsuits challenging practices at the immigration detention center.",
    "link": "https://www.bostonherald.com/2025/12/22/florida-immigration-detention-center-lawyers/",
    "timestamp": "2025-12-22T19:26:56Z"
  },
  {
    "title": "Trump-backed Donalds vows to maintain DeSantis 'trajectory,' take Florida to 'whole new level'",
    "description": "Republican Rep. Byron Donalds, a MAGA champion, maintains frontrunner status in Florida's gubernatorial race with Trump's endorsement and massive fundraising lead over GOP rivals.",
    "link": "https://www.foxnews.com/politics/trump-backed-donalds-vows-maintain-desantis-trajectory-take-florida-whole-new-level",
    "timestamp": "2025-12-22T19:26:12Z"
  },
  {
    "title": "‘Adjust Your Meds’: NewsNation Host Gets Endlessly Mocked Over Her ‘One Word’ to Describe Trump",
    "description": "NewsNation host Batya Ungar-Sargon kicked up a firestorm of mockery over the weekend with some praise of President Donald Trump that left her critics scratching their heads.\nThe post ‘Adjust Your Meds’: NewsNation Host Gets Endlessly Mocked Over Her ‘One Word…",
    "link": "https://www.mediaite.com/media/adjust-your-meds-newsnation-host-gets-endlessly-mocked-over-her-one-word-to-describe-trump/",
    "timestamp": "2025-12-22T19:22:52Z"
  },
  {
    "title": "Zelenskyy says progress in U.S.-led peace talks is ‘quite solid’",
    "description": "U.S. proposals for a peace deal between Ukraine and Russia meet many of Kyiv's demands, according to Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-says-progress-in-u-s-led-peace-talks-is-quite-solid",
    "timestamp": "2025-12-22T19:19:53Z"
  },
  {
    "title": "Trump admin halts US offshore wind projects citing ‘national security’",
    "description": "The Trump administration has paused all US offshore wind projects, citing unspecified national security risks and casting doubt on the renewable energy ind\n\nRead More: https://punchng.com/trump-admin-halts-us-offshore-wind-projects-citing-national-security/",
    "link": "https://punchng.com/trump-admin-halts-us-offshore-wind-projects-citing-national-security/",
    "timestamp": "2025-12-22T19:18:23Z"
  },
  {
    "title": "Russia pledges ‘full support’ for Venezuela against US ‘hostilities’",
    "description": "Russia on Monday expressed “full support” for Venezuela as the South American country confronts a blockade of sanctioned oil tankers by US forces deployed in the Caribbean. The pledge from Moscow, itself embroiled in the war in Ukraine, came on the eve of a U…",
    "link": "https://www.digitaljournal.com/world/russia-pledges-full-support-for-venezuela-against-us-hostilities/article",
    "timestamp": "2025-12-22T19:17:20Z"
  },
  {
    "title": "Fuming Denmark summons US ambassador over Greenland envoy",
    "description": "Denmark said Monday it would summon the US ambassador after President Donald Trump appointed a special envoy to Greenland who immediately vowed to make the Danish autonomous territory “a part of the US”. Since returning to the White House in January, Trump ha…",
    "link": "https://www.digitaljournal.com/world/fuming-denmark-summons-us-ambassador-over-greenland-envoy/article",
    "timestamp": "2025-12-22T19:17:20Z"
  },
  {
    "title": "Poll: Trump's Approval Rating Lands at 50 Percent, 9 Points Above Water",
    "description": "President Donald Trump enjoys a 50 percent approval rating, with a net approval rating of plus 9 points, according to the latest polling from InsiderAdvantage.\nThe post Poll: Trump’s Approval Rating Lands at 50 Percent, 9 Points Above Water appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/12/22/poll-trumps-approval-rating-lands-at-50-percent-9-points-above-water/",
    "timestamp": "2025-12-22T19:15:25Z"
  },
  {
    "title": "Clinton camp demands DOJ drop remaining Epstein files, accuses Trump admin of ‘protection’",
    "description": "Department of Justice faces criticism for new redacted Epstein document release as Former President Bill Clinton's spokesman argues partial disclosure violates transparency law.",
    "link": "https://www.foxnews.com/politics/clinton-camp-demands-doj-drop-remaining-epstein-files-accuses-trump-admin-protection",
    "timestamp": "2025-12-22T19:10:45Z"
  },
  {
    "title": "A chaotic 'up-crash' for markets riding a turbulent 2025",
    "description": "AI. Market records. Tariffs. Penguins. TACO. It's been a big year of economic shocks and surges as the international framework of global trade was shredded. Here's how key players saw the year that was.",
    "link": "https://www.abc.net.au/news/2025-12-23/trump-tariffs-interest-rates-and-ai-2025-was-a-chaotic-up-crash/106086538",
    "timestamp": "2025-12-22T19:10:08Z"
  },
  {
    "title": "Sweden reiterates support for Denmark on Greenland issue",
    "description": "HELSINKI, Dec. 22 (Xinhua) -- Sweden on Monday voiced strong support for Denmark amid Copenhagen's disappointment over a U.S. public statement announcing that U.S. President Donald Trump has appointed a special representative for Greenland. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/23/sweden-reiterates-support-for-denmark-on-greenland-issue",
    "timestamp": "2025-12-22T19:09:00Z"
  },
  {
    "title": "DHS to send illegal aliens 'home for the holidays' with new Christmastime incentive",
    "description": "The Department of Homeland Security is running an end-of-year Christmas special to further incentivize illegal aliens to self-deport. DHS Secretary Kristi Noem announced that the department will be tripling the cash incentives from $1,000 to $3,000, urging il…",
    "link": "https://freerepublic.com/focus/f-bloggers/4358575/posts",
    "timestamp": "2025-12-22T19:08:12Z"
  },
  {
    "title": "World's largest warship looms near Venezuela as US warns of land attacks",
    "description": "The Pentagon moved the USS Gerald R Ford, the world's largest aircraft carrier, to the Caribbean last month. Now President Donald Trump is repeating threats of imminent strikes against Venezuelan territory.",
    "link": "https://www.abc.net.au/news/2025-12-23/uss-gerald-r-ford-near-venezuela-trump-warns-of-land-strikes/106114524",
    "timestamp": "2025-12-22T19:07:50Z"
  },
  {
    "title": "Trump Threatens To Fire Don Jr. In Awkward Speech At Turning Point Conference",
    "description": "The cringeworthy comments sure made an impression.",
    "link": "https://www.huffpost.com/entry/donald-trump-threatens-fire-don-jr_n_6949848ee4b099a75cbda82e",
    "timestamp": "2025-12-22T19:07:30Z"
  },
  {
    "title": "Nicki Minaj Urges Men to Look to 'Amazing Role Models' Trump & Vance at Turning Point USA's AmericaFest",
    "description": "Rap megastar Nicki Minaj urged men to look to “amazing role models,” such as President Donald Trump and Vice President JD Vance, at Turning Point USA’s AmericaFest conference on Sunday. After being asked by Mrs. Erika Kirk to share her advice\nThe post Nicki M…",
    "link": "https://www.breitbart.com/entertainment/2025/12/22/nicki-minaj-urges-men-to-look-to-amazing-role-models-trump-vance-at-turning-point-usas-americafest/",
    "timestamp": "2025-12-22T19:07:30Z"
  },
  {
    "title": "Colorado governor says Trump playing ‘political games’ by denying disaster declaration request",
    "description": "Colorado Gov. Jared Polis has accused President Donald Trump of playing “political games” after the Trump administration denied disaster declaration requests made by the state.",
    "link": "https://www.pbs.org/newshour/nation/colorado-governor-says-trump-playing-political-games-by-denying-disaster-declaration-request",
    "timestamp": "2025-12-22T19:07:01Z"
  },
  {
    "title": "Understanding the Dangerous Trump-MAGA National Security Strategy",
    "description": "After living on life support in the last half of the post-Cold War, Pax America is now a memory. It was relegated to the dustbin of history with the “Trump” National Security Strategy published earlier this month. President Donald Trump and his clique are not…",
    "link": "https://www.commondreams.org/opinion/trump-s-national-security-strategy",
    "timestamp": "2025-12-22T19:06:10Z"
  },
  {
    "title": "Nicki Minaj Makes a Very Awkward Comment About JD Vance in Front of Erika Kirk & Audience Goes Silent at Turning Point USA Event",
    "description": "Nicki Minaj accidentally made an awkward blunder at AmericaFest. The 43-year-old “Stupid Hoe” rapper made a surprise appearance at conservative organization Turning Point USA’s event on Sunday (December 21), and was introduced to the stage by Charlie Kirk‘s w…",
    "link": "https://www.justjared.com/2025/12/22/nicki-minaj-makes-a-very-awkward-comment-about-jd-vance-in-front-of-erika-kirk-audience-goes-silent-at-turning-point-usa-event/",
    "timestamp": "2025-12-22T19:05:02Z"
  },
  {
    "title": "Source: Bari Weiss got personally involved with political stories, after Trump criticized 60 Minutes for interviewing Marjorie Taylor Greene earlier this month (Brian Stelter/CNN)",
    "description": "Brian Stelter / CNN:\nSource: Bari Weiss got personally involved with political stories, after Trump criticized 60 Minutes for interviewing Marjorie Taylor Greene earlier this month  —  Earlier this month, after President Donald Trump blasted “60 Minutes” for …",
    "link": "https://mediagazer.com/251222/p15",
    "timestamp": "2025-12-22T19:05:00Z"
  },
  {
    "title": "Can diplomacy end the conflict between Thailand and Cambodia?",
    "description": "The neighbouring countries hold their first direct meeting in regional push for peace.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/12/22/can-diplomacy-end-the-conflict-between-thailand-and-cambodia",
    "timestamp": "2025-12-22T19:04:35Z"
  },
  {
    "title": "Gay NYC Council member Erik Bottcher drops U.S. House bid, will run for state Senate instead",
    "description": "New York City Council member Erik Bottcher, who is gay, is ending his race for Congress and will run for New York State Senate instead.",
    "link": "https://www.advocate.com/politics/erik-bottcher-ny-state-senate",
    "timestamp": "2025-12-22T19:03:07Z"
  },
  {
    "title": "US Navy announces new ship project under Trump’s “golden fleet” plan",
    "description": "Synopsis - The US Navy plans to build a new warship under Trump’s Golden Fleet program to boost American shipbuilding. The move aims to fix ship shortages and improve defense strength. The project focuses on faster building, future upgrades, and using US work…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-navy-announces-new-ship-project-under-trumps-golden-fleet-plan/articleshow/126127892.cms",
    "timestamp": "2025-12-22T19:01:55Z"
  },
  {
    "title": "This GOP candidate offers nothing but rage — even his deep-red state should reject him",
    "description": "Tommy Tuberville’s escalating attacks on Muslim Americans culminated last week in a demand for their mass deportation.We’ve seen this from Alabama’s senior U.S. senator before.Tuberville once said that Black Americans “do the crime.” He called most immigrants…",
    "link": "https://www.rawstory.com/tommy-tuberville-2674821514/",
    "timestamp": "2025-12-22T19:01:38Z"
  },
  {
    "title": "Coffee Break: Democrats Looking to Coast on Anti-Trump Sentiment",
    "description": "Democratic Party leadership is sending signals that they intend to coast on anti-Trump sentiment rather than serious self-examination, open primaries, and vigorous policy debate, thanks to the 'Blue MAGA' cult behavior of Dem voters they won't have to.",
    "link": "https://www.nakedcapitalism.com/2025/12/democrats-anti-trump-sentiment-jeffries-schumer-harris-cuellar.html",
    "timestamp": "2025-12-22T19:00:55Z"
  },
  {
    "title": "InsiderAdvantage Poll: Trump Approval Rating Hits 50%",
    "description": "President Donald Trump got a dose of good news on the political front Monday, as a new InsiderAdvantage survey of likely voters showed his job approval back at the 50% mark, his strongest showing in nearly three months. InsiderAdvantage asked respondents, \"Wh…",
    "link": "https://freerepublic.com/focus/f-news/4358573/posts",
    "timestamp": "2025-12-22T19:00:28Z"
  },
  {
    "title": "Pam Bondi Faces Legal Trouble Over Unreleased Jeffrey Epstein Material — as Cover-Up Claims Erupt After All 16 Photos Are Mysteriously Deleted From Files",
    "description": "Two congressmen who co-authored the law demanding the full release of the Epstein files are threatening Pam Bondi with an arcane punishment.",
    "link": "https://radaronline.com/p/pam-bondi-legal-trouble-unreleased-epstein-material-thomas-massie/",
    "timestamp": "2025-12-22T19:00:00Z"
  },
  {
    "title": "Crypto laments loss of key ally on Capitol Hill after Lummis announces retirement",
    "description": "Sen. Cynthia Lummis’ retirement tees up a Republican primary in Wyoming, where the victor will be heavily favored in November.",
    "link": "https://www.cnbc.com/2025/12/22/crypto-lummis-retirement-key-ally-capitol-hill.html",
    "timestamp": "2025-12-22T18:58:55Z"
  },
  {
    "title": "Top Democrat Moves to Force Trump's DOJ to Release Full Epstein Files: 'The Law is Crystal Clear'",
    "description": "Senate Minority Leader Chuck Schumer has announced that he will be introducing a new resolution in the Senate to force the Department of Justice to release all of the Epstein files.",
    "link": "https://www.ibtimes.com/top-democrat-moves-force-trumps-doj-release-full-epstein-files-law-crystal-clear-3793482",
    "timestamp": "2025-12-22T18:57:32Z"
  },
  {
    "title": "Meidas: Trump Shuts Down CBS over Story He Feared",
    "description": "MeidasTouch host Ben Meiselas reports on Donald Trump conspiring with CBS Editor-In-Chief Bari Weiss to shutdown and cancel a 60 minutes episode that was critical of Trump’s handling of migrants sent to El Salvador.",
    "link": "https://littlegreenfootballs.com/article/55155_Meidas-_Trump_Shuts_Down_CBS_o",
    "timestamp": "2025-12-22T18:57:03Z"
  },
  {
    "title": "For Sikh truckers, a new wariness on the road",
    "description": "After the first crash, Transportation Secretary Sean Duffy said foreign drivers without proper training or licenses were a long-standing problem. About 200,000 foreign drivers hold licenses that allow them to drive commercial vehicles.",
    "link": "https://indianexpress.com/article/world/for-sikh-truckers-a-new-wariness-on-the-road-10433719/",
    "timestamp": "2025-12-22T18:55:10Z"
  },
  {
    "title": "New HHS Panel Appointee Pushed Unfounded Theory Linking COVID Shots to Cancer",
    "description": "“There is no evidence that COVID-19 vaccines cause cancer,” the National Cancer Institute says.",
    "link": "https://truthout.org/articles/new-hhs-panel-appointee-pushed-unfounded-theory-linking-covid-shots-to-cancer/",
    "timestamp": "2025-12-22T18:52:51Z"
  },
  {
    "title": "Trump's appointment of Greenland envoy sparks fresh row with Denmark",
    "description": "The BBC's diplomatic correspondent James Landale explains how Trump's appoinment of a special envoy to Greenland has shaken diplomatic with Denmark.",
    "link": "https://www.bbc.com/news/videos/cwywe5zw384o",
    "timestamp": "2025-12-22T18:52:03Z"
  },
  {
    "title": "Turning Point USA’s AmericaFest attendees reveal who is the most popular and unpopular Trump Cabinet member",
    "description": "A poll taken at Turning Point USA’s AmFest this weekend revealed which members of President Trump’s Cabinet are most popular and unpopular amongst the conference’s heavily conservative audience.",
    "link": "https://www.foxnews.com/politics/turning-point-usas-americafest-attendees-reveal-who-most-popular-unpopular-trump-cabinet-member",
    "timestamp": "2025-12-22T18:51:14Z"
  },
  {
    "title": "Turning Point poll reveals conservatives 'all in' for JD Vance 2028 presidential run",
    "description": "A straw poll taken at Turning Point USA’s AmericaFest this weekend revealed that conservatives are, as a spokesman described, “all in\" for Vice President JD Vance running for president in 2028.",
    "link": "https://www.foxnews.com/politics/turning-point-poll-reveals-conservatives-all-in-jd-vance-2028-presidential-run",
    "timestamp": "2025-12-22T18:51:14Z"
  },
  {
    "title": "59% of Illegal Alien Families On Welfare Programs, Costing $42 Billion: Scott Turner",
    "description": "Housing and Urban Services Secretary Scott Turner said a majority of illegal alien families in the United States rely on taxpayer-funded welfare programs, costing tens of billions of dollars each year and placing significant strain on housing, healthcare, edu…",
    "link": "https://freerepublic.com/focus/f-rlc/4358571/posts",
    "timestamp": "2025-12-22T18:51:04Z"
  },
  {
    "title": "US pauses offshore wind projects over security concerns",
    "description": "The Trump administration has long opposed wind power, most often citing cost and reliability concerns.",
    "link": "https://www.bbc.com/news/articles/cd74lyr094vo",
    "timestamp": "2025-12-22T18:51:00Z"
  },
  {
    "title": "Trump’s Big Beautiful Bill 2026 tax refunds — SALT deduction relief and why homeowners may benefit most as new rules could raise April checks",
    "description": "Trump’s Big Beautiful Bill 2026 tax refunds: The One Big Beautiful Bill Act, signed into law by Donald Trump on July 4, 2025, is set to reshape how millions of Americans experience the 2026 tax refund season. The law locks in many provisions of the 2017 Tax C…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-big-beautiful-bill-reshapes-2026-tax-refunds-salt-deduction-relief-and-why-homeowners-may-benefit-most-as-new-rules-could-raise-april-checks/articleshow/126124330.cms",
    "timestamp": "2025-12-22T18:50:15Z"
  },
  {
    "title": "EJ Antoni on Affordability: ‘Keep Your Foot Down on the Throttle, Mr. President’",
    "description": "The new buzzword today seems to be affordability. Suddenly, the entire media has woken up to the fact that Americans are in a cost-of-living crisis, something... Read More\nThe post EJ Antoni on Affordability: ‘Keep Your Foot Down on the Throttle, Mr. Presiden…",
    "link": "https://www.dailysignal.com/2025/12/22/ej-antoni-on-affordability-keep-your-foot-down-on-the-throttle-mr-president/",
    "timestamp": "2025-12-22T18:49:22Z"
  },
  {
    "title": "Is Nicki Minaj an Immigrant? Inside Her Background, Where She Was Born & More",
    "description": "Minaj has expressed her support of Donald Trump's 'MAGA' mission in recent years. Find out if she's an undocumented immigrant and where she comes from.",
    "link": "https://hollywoodlife.com/feature/is-nicki-minaj-an-undocumented-immigrant-5495074/",
    "timestamp": "2025-12-22T18:49:00Z"
  },
  {
    "title": "US Suspends Offshore Wind Leases In Fresh Blow To The Industry",
    "description": "The US is suspending leases for all five wind farms under construction off the East Coast in the latest blow to a sector that’s been targeted repeatedly by the Trump administration as part of its broader attack on clean energy. The US Interior Department anno…",
    "link": "https://www.ndtvprofit.com/global-economics/us-suspends-offshore-wind-leases-in-fresh-blow-to-the-industry",
    "timestamp": "2025-12-22T18:48:26Z"
  },
  {
    "title": "Bari Weiss F*cking Up CBS News Even Faster Than Predicted!",
    "description": "Respect is earned, but has she ever had to earn anything in her life?",
    "link": "https://www.wonkette.com/p/bari-weiss-fcking-up-cbs-news-even",
    "timestamp": "2025-12-22T18:48:04Z"
  },
  {
    "title": "Why Trump backs Bayer in Roundup weedkiller cancer battle",
    "description": "The Trump administration has diverged from the position of former US President Joe Biden, throwing its weight behind German chemical giant Bayer in its courtroom battle over the pesticide Roundup. The long-running legal fight over Bayer's weedkiller Roundup h…",
    "link": "https://www.dw.com/en/donald-trump-backs-bayer-in-roundup-weedkiller-cancer-battle-court-case/a-75188139",
    "timestamp": "2025-12-22T18:48:00Z"
  },
  {
    "title": "Anti-Trump ex-husband of president's 2016 campaign manager launches congressional bid as Democrat",
    "description": "Trump critic George Conway files to run for Jerry Nadler's congressional seat in the Democratic primary with JFK's grandson and other candidates.",
    "link": "https://www.foxnews.com/politics/anti-trump-ex-husband-presidents-2016-campaign-manager-launches-congressional-bid-democrat",
    "timestamp": "2025-12-22T18:47:37Z"
  }
]