[
  {
    "title": "World Cup draw winners and losers: Big day for USMNT, Donald Trump",
    "description": "The draw for the biggest World Cup in history was probably the cringiest as the two-hour event didn't feature much soccer.",
    "link": "https://www.usatoday.com/story/sports/soccer/worldcup/2025/12/05/world-cup-2026-draw-winners-losers/87628302007/",
    "timestamp": "2025-12-05T22:09:02Z"
  },
  {
    "title": "Are Most Americans Even Paying Attention?",
    "description": "Elie Mystal\n\n\n\nIn this week’s Elie v. U.S., The Nation’s justice correspondent digs into the latest legal news, Trump news, and Nuzzi news—along with a look at how few people actually follow said news.\r\n\n\r\n\n\nThe post Are Most Americans Even Paying Attention? …",
    "link": "https://www.thenation.com/article/politics/are-most-americans-even-following-what-trump-is-doing/",
    "timestamp": "2025-12-05T22:08:37Z"
  },
  {
    "title": "Supreme Court Agrees to Hear Case That Could Bless Trump's Bid to End Birthright Citizenship",
    "description": "The United States Supreme Court on Friday agreed to decide whether US President Donald Trump's executive order ending birthright citizenship—as guaranteed under the 14th Amendment for more than 150 years—is constitutional.Next spring, the justices will hear o…",
    "link": "https://www.commondreams.org/news/scotus-birthright-citizenship",
    "timestamp": "2025-12-05T22:07:53Z"
  },
  {
    "title": "Trump's National Security Plan: 'Era of Mass Migration Is Over'",
    "description": "President Donald Trump's National Security Strategy rejects the establishment's much-repeated claim that diverse migration makes the nation stronger.\nThe post Trump’s National Security Plan: ‘Era of Mass Migration Is Over’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/12/05/trumps-national-security-plan-era-of-mass-migration-is-over/",
    "timestamp": "2025-12-05T22:07:24Z"
  },
  {
    "title": "FULL CEREMONY: Trump, Infantino, Sheinbaum & Carney Attend Historic FIFA World Cup 2026 Draw | AC1E",
    "description": "Experience the full official ceremony of the FIFA World Cup 2026 Draw, held at the John F. Kennedy Center for the Performing Arts in Washington, D.C., on December 5, 2025. This historic event brought together major world leaders and FIFA officials, including:…",
    "link": "https://freerepublic.com/focus/f-chat/4356129/posts",
    "timestamp": "2025-12-05T22:06:27Z"
  },
  {
    "title": "Exclusive: Boat at center of double-tap strike controversy was meeting vessel headed to Suriname, admiral told lawmakers | CNN Politics",
    "description": "The alleged drug traffickers killed by the US military in a strike on September 2 were heading to link up with another, larger vessel that was bound for Suriname — a small South American country east of Venezuela – the admiral who oversaw the operation told l…",
    "link": "https://www.cnn.com/2025/12/05/politics/suriname-boat-strike-bradley",
    "timestamp": "2025-12-05T22:05:42Z"
  },
  {
    "title": "Sheinbaum: Trade talks with US, Canada to continue",
    "description": "Mexican President Claudia Sheinbaum said on Friday that she had an \"excellent\" meeting with Canadian Prime Minister Mark Carney and United States President Donald Trump, and that the three of them agr...",
    "link": "https://biztoc.com/x/37ef72098012dd9b",
    "timestamp": "2025-12-05T22:05:26Z"
  },
  {
    "title": "Sen. Bennet temporarily blocks dozens of Trump nominees from being confirmed (CO)",
    "description": "Sen. Bennet temporarily blocks dozens of Trump nominees from being confirmed by: Jacob FactorDec 4, 2025 DENVER (KDVR) — A slate of more than 80 of President Donald Trump’s nominees is on hold after Colorado’s Democratic Sen. Michael Bennet called out a Senat…",
    "link": "https://freerepublic.com/focus/f-news/4356128/posts",
    "timestamp": "2025-12-05T22:04:51Z"
  },
  {
    "title": "Trump Takes to Campaigning for His Economic Agenda",
    "description": "“Donald Trump is going on the road next week as he tries to break through Americans’ gloom about the economy,” Bloomberg reports. “The president is heading Tuesday to Pennsylvania — a key swing state he beat Kamala Harris in the 2024 election but lost to Joe …",
    "link": "https://politicalwire.com/2025/12/05/trump-takes-to-campaigning-for-his-economic-agenda/",
    "timestamp": "2025-12-05T22:03:40Z"
  },
  {
    "title": "Trump says America should change football's name so soccer can have it: 'It really doesn't make sense'",
    "description": "FIFA awarded President Donald Trump its inaugural Peace Prize, and Trump suggested soccer should be called football and the NFL should be renamed during the World Cup.",
    "link": "https://www.foxnews.com/sports/trump-says-america-should-change-footballs-name-it-really-doesnt-make-sense",
    "timestamp": "2025-12-05T22:03:17Z"
  },
  {
    "title": "Supreme Court Takes Up Trump's Birthright Citizenship Ban as Legal Battle Reaches Final Stage",
    "description": "The Supreme Court will weigh Trump's bid to end birthright citizenship via executive order, a policy blocked by lower courts as violating the 14th Amendment's guarantee of citizenship by birth.",
    "link": "https://www.ibtimes.com/supreme-court-takes-trumps-birthright-citizenship-ban-legal-battle-reaches-final-stage-3792047",
    "timestamp": "2025-12-05T22:02:35Z"
  },
  {
    "title": "Sabrina Carpenter Ratios Trump; The White House Deletes ICE Video",
    "description": "In case you missed out on the first part, here's a quick history lesson. Donald Trump's folks used music superstar Sabrina Carpenter's song \"Juno\" in one of their ICE deportation fetish videos glorifying human suffering for the sake of Trump's \"Red, White & B…",
    "link": "https://bleedingcool.com/tv/sabrina-carpenter-ratios-trump-the-white-house-deletes-ice-video/",
    "timestamp": "2025-12-05T22:02:04Z"
  },
  {
    "title": "Photos emerge of Somali illegal's ties to top Minnesota Dems after ICE arrest",
    "description": "ICE arrested a Somali illegal immigrant convicted of fraud and connected to several high-profile Minnesota politicians, including former Dem vice presidential nominee Gov. Tim Walz.",
    "link": "https://www.foxnews.com/politics/photos-emerge-somali-illegals-ties-top-minnesota-dems-after-ice-arrest",
    "timestamp": "2025-12-05T22:00:58Z"
  },
  {
    "title": "Europe will be 'unrecognizable' in 20 years due to immigration, White House strategy document claims",
    "description": "A new national security document released by the White House late Thursday claimed without evidence that Europe is facing “civilizational erasure” and will be “unrecognizable in 20 years or less” due to immigration that has made European powers militarily wea…",
    "link": "https://www.nbcnews.com/politics/politics-news/europe-will-unrecognizable-20-years-due-immigration-white-house-strate-rcna247534",
    "timestamp": "2025-12-05T22:00:00Z"
  },
  {
    "title": "Commentary: The US may be running the wrong AI race",
    "description": "China’s favouring of small and cheap models such as DeepSeek could prove to be the better bet, says John Thornhill for Financial Times.",
    "link": "https://www.channelnewsasia.com/commentary/us-china-ai-race-chatgpt-deepseek-tech-5563681",
    "timestamp": "2025-12-05T22:00:00Z"
  },
  {
    "title": "Video shows survivors waving before fatal follow-up boat strike | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> The two survivors of the U.S. military’s first boat strike on Sept. 2 climbed atop the overturned hull and waved to something overhead, according to multiple people who have seen video of the attack.",
    "link": "https://www.staradvertiser.com/2025/12/05/breaking-news/video-shows-survivors-waving-before-fatal-follow-up-boat-strike/",
    "timestamp": "2025-12-05T22:00:00Z"
  },
  {
    "title": "Canada draws Switzerland, Qatar and spectre of Italy as World Cup groups revealed",
    "description": "The men’s World Cup draw was going well for Canada until Pot 4. Instead of one of the weakest teams, Canada drew the winner of UEFA Playoff A, which will see favourite Italy, the 12th-ranked team in the world, compete against Wales, Bosnia, and Northern Irela…",
    "link": "https://www.cbc.ca/sports/soccer/canada-world-cup-draw-switzerland-qatar-analysis-chris-jones-dec5-9.7005017",
    "timestamp": "2025-12-05T21:56:44Z"
  },
  {
    "title": "Ex-House Republican Blasts ‘Nonsensical’ Legal Argument Supporting Trump Boat Strikes",
    "description": "\"It doesn’t matter that they’re 'designated terrorists.' The 2001 AUMF doesn’t care about any executive branch designation; it’s just for the perpetrators of 9/11.\"\nThe post Ex-House Republican Blasts ‘Nonsensical’ Legal Argument Supporting Trump Boat Strikes…",
    "link": "https://www.mediaite.com/politics/ex-house-republican-blasts-nonsensical-legal-argument-supporting-trump-boat-strikes/",
    "timestamp": "2025-12-05T21:55:09Z"
  },
  {
    "title": "Indiana House Republicans pass Trump-backed map, setting up high-stakes Senate fight (Isabella Volmert/Associated Press)",
    "description": "Isabella Volmert / Associated Press:\nIndiana House Republicans pass Trump-backed map, setting up high-stakes Senate fight  —  Indiana state House Republicans passed a new state congressional map Friday at the behest of President Donald Trump, advancing the le…",
    "link": "https://www.memeorandum.com/251205/p108",
    "timestamp": "2025-12-05T21:55:01Z"
  },
  {
    "title": "As Carney goes to Washington, he must stand firm and keep his elbows up",
    "description": "John Rapley is a contributing columnist for The Globe and Mail. He is an author and academic whose books include Why Empires Fall and Twilight of the Money Gods.\nBefore his meeting with U.S. President Donald Trump on Friday, the Prime Minister had played down…",
    "link": "https://biztoc.com/x/42b3f1ef1c8aabc3",
    "timestamp": "2025-12-05T21:54:12Z"
  },
  {
    "title": "A shaky year for American EVs could set the tone for 2026",
    "description": "If you like both electric vehicles and emotional roller coasters, 2025 was an excellent year. However, for those of us whose nerves are already sufficiently frazzled, the highs and lows of the last 12 months were a bit hard to stomach. In 2025, we saw the int…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180301239",
    "timestamp": "2025-12-05T21:53:29Z"
  },
  {
    "title": "North American leaders take stage together for the first time",
    "description": "The World Cup draw marked the first time that Mexican President Claudia Sheinbaum has met Trump.",
    "link": "https://www.bbc.com/news/articles/cz7nlp8l4j0o",
    "timestamp": "2025-12-05T21:52:54Z"
  },
  {
    "title": "US Department of Transportation doubles down on gas, cuts fuel efficiency standards",
    "description": "The Department of Transportation under President Donald Trump is moving to reverse more of the climate policies that had been enacted by President Joe Biden. Under a proposed rulemaking by the National Highway Traffic Safety Administration, fuel efficiency st…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180301221",
    "timestamp": "2025-12-05T21:52:16Z"
  },
  {
    "title": "US Supreme Court to consider Trump’s bid to end birthright citizenship",
    "description": "The Supreme Court is likely to hear oral arguments early next year, with a ruling in June.",
    "link": "https://www.aljazeera.com/news/2025/12/5/us-supreme-court-to-consider-trumps-bid-to-end-birthright-citizenship",
    "timestamp": "2025-12-05T21:48:37Z"
  },
  {
    "title": "Trump, Infantino and the YMCA: World Cup draw at once unwatchable and mesmerising",
    "description": "World Cup draw was for tournament to be jointly hosted by the United States, Canada and Mexico",
    "link": "https://www.irishtimes.com/sport/soccer/2025/12/05/trump-infantino-and-the-ymca-world-cup-draw-at-once-unwatchable-and-mesmerising/",
    "timestamp": "2025-12-05T21:47:21Z"
  },
  {
    "title": "Journalists React to Trump’s Latest Attack: “There Needs to Be a Lot More Outrage”",
    "description": "One editor whose publication made the White House’s new “media offender” database says his reporter has been subjected to “days and days and days of emails” after being named—an onslaught of “disgusting, hateful shit.”",
    "link": "https://www.vanityfair.com/news/story/donald-trump-white-house-journalists-media-offenders",
    "timestamp": "2025-12-05T21:47:19Z"
  },
  {
    "title": "MAGA Pastor Reveals How He Got Barron Trump ‘Very Close’ To Embracing Christianity",
    "description": "“That was the only thing that stuck with him,” Stuart Knechtle shared of his conversation with the 19-year-old first son.",
    "link": "https://www.huffpost.com/entry/maga-pastor-barron-trump-religious-awakening_n_6933162de4b06a47b6d3cb54",
    "timestamp": "2025-12-05T21:46:47Z"
  },
  {
    "title": "Netflix–Warner Bros. deal sets pp $72 billion antitrust test",
    "description": "The company faces a lengthy DOJ review and a possible lawsuit seeking to block the deal if it doesn’t adopt some remedies to get it cleared, analysts said.",
    "link": "https://fortune.com/2025/12/05/netflix-warner-bros-antitrust-outlook-doj-review-72-billion-merger/",
    "timestamp": "2025-12-05T21:46:17Z"
  },
  {
    "title": "'Sensitive' Trump Raging Over Being Compared to Rival 'Sleepy Joe' After Prez Busted Struggling to Stay Awake... as Health Rumors Explode",
    "description": "Donald Trump is said to be livid over recent reports comparing him to Joe Biden, after he was apparently caught snoozing.",
    "link": "https://radaronline.com/p/sensitive-trump-raging-over-sleepy-joe-health-rumors/",
    "timestamp": "2025-12-05T21:45:00Z"
  },
  {
    "title": "Egypt’s economy stabilises, but poverty challenges persist",
    "description": "Investments boost Egypt's economy, but rural poverty highlights unequal benefits from economic recovery efforts.",
    "link": "https://www.aljazeera.com/economy/2025/12/5/egypts-economy-stabilises-but-poverty-challenges-persist",
    "timestamp": "2025-12-05T21:44:56Z"
  },
  {
    "title": "Karoline Leavitt’s Brother Had Grim Custody Fight With ICE-Arrested Ex",
    "description": "The mother of Karoline Leavitt’s nephew was reportedly engaged in a nasty years-long custody battle with the White House press secretary’s brother before she was detained by Immigration and Customs enforcement last month, WBUR reported Friday.Bruna Ferreira—a…",
    "link": "https://newrepublic.com/post/204059/karoline-leavitt-brother-mother-nephew-custody-fight-ice",
    "timestamp": "2025-12-05T21:43:54Z"
  },
  {
    "title": "‘This is a bad idea made worse’: Senate Dems’ plan to fix Obamacare premiums adds nearly $300 billion to deficit, CRFB says",
    "description": "The plan to protect Obamacare would cost nearly $550 billion over 10 years if it were made permanent, the budget watchdog said.",
    "link": "https://fortune.com/2025/12/05/us-debt-health-insurance-premiums-expire-aca-democrats-300-billion-deficit-crfb/",
    "timestamp": "2025-12-05T21:43:16Z"
  },
  {
    "title": "President Trump, Tom Brady and other sports legends reveal 2026 FIFA World Cup groupings",
    "description": "President Donald Trump and Tom Brady were among the sports and political figures who helped reveal the groupings for the 2026 FIFA World Cup on Friday.",
    "link": "https://www.foxnews.com/sports/president-trump-tom-brady-other-sports-legends-reveal-2026-fifa-world-cup-groupings",
    "timestamp": "2025-12-05T21:43:00Z"
  },
  {
    "title": "World Cup draw could hardly have gone better for US",
    "description": "It would be a major disappointment if the USMNT failed to advance from this group.",
    "link": "https://www.bostonherald.com/2025/12/05/world-cup-draw-analysis/",
    "timestamp": "2025-12-05T21:42:55Z"
  },
  {
    "title": "Trump finally got his peace prize—from a soccer federation widely known for corruption",
    "description": "President Donald Trump was awarded the new FIFA peace prize on Friday at the 2026 World Cup draw — giving the spectacle to set matchups for the quadrennial soccer tournament even more of a Trumpian flair.\nTrump, who has openly campaigned for the Nobel Peace P…",
    "link": "https://biztoc.com/x/d962c07bdd64dcee",
    "timestamp": "2025-12-05T21:42:53Z"
  },
  {
    "title": "Trump’s New National Security Strategy Goes Full ‘America First’",
    "description": "The long-anticipated plan aims to selectively impose the U.S. president’s worldview around the globe.",
    "link": "http://foreignpolicy.com/2025/12/05/trump-national-security-strategy-america-first/",
    "timestamp": "2025-12-05T21:42:33Z"
  },
  {
    "title": "EU fines Elon Musk’s X 120 million euros for breaching bloc’s social media law",
    "description": "The European Commission issued its decision following an investigation it opened two years ago into X under the 27-nation bloc’s Digital Services Act, also known as the DSA.",
    "link": "https://www.pbs.org/newshour/world/eu-fines-elon-musks-x-120-million-euros-for-breaching-blocs-social-media-law",
    "timestamp": "2025-12-05T21:40:50Z"
  },
  {
    "title": "RFK fans demand Trump oust other Cabinet official: He's 'poisoning Americans'",
    "description": "A big rift is brewing in the Trump administration, as allies of Health and Human Services Secretary Robert F. Kennedy Jr. — the mastermind of the so-called \"Make America Healthy Again\" movement — lobby President Donald Trump to fire Lee Zeldin, the head of th…",
    "link": "https://www.rawstory.com/lee-zeldin-2674374077/",
    "timestamp": "2025-12-05T21:40:49Z"
  },
  {
    "title": "The Supreme Court takes up the most unconstitutional thing Trump has done (Ian Millhiser/Vox)",
    "description": "Ian Millhiser / Vox:\nThe Supreme Court takes up the most unconstitutional thing Trump has done  —  Last January, when Reagan-appointed Judge John Coughenour became the first federal judge to block President Donald Trump's attack on birthright citizenship, he …",
    "link": "https://www.memeorandum.com/251205/p107",
    "timestamp": "2025-12-05T21:40:01Z"
  },
  {
    "title": "World Cup draw could hardly have gone better for US",
    "description": "The United States could hardly have asked for a better draw at the 2026 World Cup. The co-host should expect to stick around at its own party until at least the round of 32 after being grouped with Paraguay, Australia and the winner of a European playoff betw…",
    "link": "https://sports.yahoo.com/articles/world-cup-draw-could-hardly-213949101.html",
    "timestamp": "2025-12-05T21:39:49Z"
  },
  {
    "title": "The National Security Strategy Is Incoherent Babble",
    "description": "But mixed in with the ranting are three valuable points.",
    "link": "https://www.theatlantic.com/ideas/2025/12/national-security-strategy-incoherent-babble/685166/",
    "timestamp": "2025-12-05T21:39:13Z"
  },
  {
    "title": "Mi'kmaq chiefs, former attorney general disappointed with N.S. cannabis directive",
    "description": "Sipekne'katik First Nation Chief Michelle Glasgow said in a statement on Friday she and her council are \"appalled\" by the province's directive, which she calls a direct threat to their communities' safety.",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/mi-kmaq-chiefs-former-ag-disappointed-cannabis-directive-9.7005178",
    "timestamp": "2025-12-05T21:39:12Z"
  },
  {
    "title": "Trump finally got his peace prize—from a soccer federation widely known for corruption",
    "description": "Trump, who has openly campaigned for the Nobel Peace Prize, had been heavily expected to receive the newly created FIFA prize.",
    "link": "https://fortune.com/2025/12/05/trump-fifa-peace-prize-world-cup-gianni-infantino/",
    "timestamp": "2025-12-05T21:36:39Z"
  },
  {
    "title": "FIFA President Gianni Infantino, Trump and world leaders take center stage at World Cup draw in DC",
    "description": "The World Cup draw featured Gianni Infantino, Donald Trump and other host-nation leaders as FIFA unveiled the 12 four-team groups for next year's tournament.",
    "link": "https://www.foxnews.com/sports/fifa-president-gianni-infantino-trump-world-leaders-center-stage-world-cup-draw-dc",
    "timestamp": "2025-12-05T21:36:18Z"
  },
  {
    "title": "Starbucks, union workers face off as old tensions over wages spill over",
    "description": "Hundreds of baristas launched an an open ended strike across the United States, some joined by politicians.",
    "link": "https://www.aljazeera.com/economy/2025/12/5/starbucks-union-workers-face-off-as-old-tensions-over-wages-spill-over",
    "timestamp": "2025-12-05T21:35:50Z"
  },
  {
    "title": "'Sensitive' Donald Trump Is Fuming Over 'Sleepy Joe' Comparisons as He 'Fixates' on Coverage About His Health Decline 'for Several Days'",
    "description": "'Sensitive' Donald Trump Is Fuming Over 'Sleepy Joe' Comparisons as He 'Fixates' on Coverage About His Health Decline 'for Several Days'newsbreak.com",
    "link": "https://www.newsbreak.com/share/4383029954345-sensitive-donald-trump-is-fuming-over-sleepy-joe-comparisons-as-he-fixates-on-coverage-about-his-health-decline-for-several-days?s=a2&amp;share_destination_id=MjM0MDQ4ODgtMTc2NDk3MDQ3ODQ2Mg%3D%3D&amp;pd=01aCgCa3&amp;hl=en_US&amp;send_time=1764970478&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.49.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-05T21:35:04Z"
  },
  {
    "title": "What to know as lawmakers disclose vivid new details of US boat strikes",
    "description": "It is testing the scope of laws that have long governed soldiers on the battlefield.",
    "link": "https://www.bostonherald.com/2025/12/05/trump-boat-strikes-what-to-know/",
    "timestamp": "2025-12-05T21:34:06Z"
  },
  {
    "title": "Stephen Miller bashed for pushing restrictions that 'are no longer on the books'",
    "description": "A law professor bashed Stephen Miller for pushing discriminatory immigration restrictions in America that have long been gone. Miller, the Trump administration's immigrant policy architect and Homeland Security Advisor, has tried to revive \"nationality-based …",
    "link": "https://www.rawstory.com/stephen-miller-2674374093/",
    "timestamp": "2025-12-05T21:33:35Z"
  },
  {
    "title": "World Cup draw rigged for USA? Soccer fans think USMNT landing in 'easiest' group is no coincidence",
    "description": "While other sides were greeted by international superstars when their World Cup group was read, the United States was met with fairly unheralded nations, at least by World Cup standards.",
    "link": "https://www.sportingnews.com/us/soccer/news/world-cup-draw-rigged-usa-soccer-donald-trump/8175870eb0d92f5c66d8dd04",
    "timestamp": "2025-12-05T21:33:11Z"
  },
  {
    "title": "'You will be defeated': Rebel red state Republicans get 'final warning' for defying Trump",
    "description": "Several groups affiliated with President Donald Trump's MAGA movement are now applying pressure to Republican state legislators in Indiana, who have yet to pass a heavily gerrymandered congressional redistricting map.Politico reported Friday that Turning Poin…",
    "link": "https://www.rawstory.com/alternet-posts/maga-warning-republican-holdouts/",
    "timestamp": "2025-12-05T21:32:17Z"
  },
  {
    "title": "Trump Shouts About ‘Tiny Cars’ Coming to U.S. in Wild Post",
    "description": "President Donald Trump used a breathless caps-heavy blast on Truth Social to announce Friday that he had “approved TINY CARS to be built in America.”\n“These cars of the very near future are inexpensive, safe, fuel efficient and, quite simply, AMAZING!!! START…",
    "link": "https://biztoc.com/x/afdfe1b459ea8e4f",
    "timestamp": "2025-12-05T21:31:58Z"
  },
  {
    "title": "4 times in 7 seconds: Trump calls Somali immigrants ‘garbage’",
    "description": "He said it four times in seven seconds: Somali immigrants in the United States are “garbage.”\nIt was no mistake. In fact, President Donald Trump’s rhetorical attacks on immigrants have been building since he said Mexico was sending “rapists” across the border…",
    "link": "https://biztoc.com/x/0e9438833359480b",
    "timestamp": "2025-12-05T21:31:44Z"
  },
  {
    "title": "Would Donald Trump Try to Block Netflix’s Takeover of Warner Bros.?",
    "description": "The seismic deal Netflix inked to buy Warner Bros. — with an eye-popping $83 billion value — will need to get approval from regulators in the U.S. and abroad. And domestically, there’s one individual whose opinion on the matter, President Donald Trump, is of …",
    "link": "https://variety.com/2025/biz/news/would-trump-block-netflix-warner-bros-deal-regulatory-approvals-1236601031/",
    "timestamp": "2025-12-05T21:31:43Z"
  },
  {
    "title": "DeSantis warns GOP faces 'issue' keeping Trump voters engaged in future elections",
    "description": "Florida governor urges Republicans to be bolder and draw sharper contrasts with Democrats to keep Trump-aligned voters engaged in future elections.",
    "link": "https://www.foxnews.com/media/desantis-warns-gop-faces-issue-keeping-trump-voters-engaged-future-elections",
    "timestamp": "2025-12-05T21:28:49Z"
  },
  {
    "title": "US judge clears Justice Department to release Epstein grand jury transcripts",
    "description": "All transcripts relating to the 2005 and 2007 investigation of convicted paedophile Jeffrey Epstein and his accomplice-girlfriend will be unsealed.",
    "link": "https://www.channelnewsasia.com/world/epstein-trump-us-files-justice-jury-5564786",
    "timestamp": "2025-12-05T21:25:34Z"
  },
  {
    "title": "Trump gets award, lines up with other world leaders at 2026 FIFA World Cup draw",
    "description": "The president received a peace prize from FIFA leader Gianni Infantino",
    "link": "https://www.deseret.com/politics/2025/12/05/trump-fifa-world-cup-draw-2026-mexico-canada/",
    "timestamp": "2025-12-05T21:24:56Z"
  },
  {
    "title": "4 times in 7 seconds: Trump calls Somali immigrants ‘garbage’",
    "description": "“We don't want ‘em in our country,” Trump said five times of the nation's 260,000 people of Somali descent.",
    "link": "https://fortune.com/2025/12/05/trump-somalia-immigration-garbage-racism/",
    "timestamp": "2025-12-05T21:24:11Z"
  },
  {
    "title": "Federal judge appears skeptical of Trump’s effort to retain control of California National Guard",
    "description": "Trump initially called up more than 4,000 California National Guard troops in response to protests.",
    "link": "https://www.bostonherald.com/2025/12/05/federal-enforcement-national-guard-california/",
    "timestamp": "2025-12-05T21:19:21Z"
  },
  {
    "title": "Coast Guard helicopter sniper takes out narco-boat engines in stunning exclusive video",
    "description": "EXCLUSIVE: The Coast Guard seized over 20,000 pounds of cocaine from a go-fast vessel during Operation Pacific Viper, a joint U.S. initiative to counter drug trafficking.",
    "link": "https://www.foxnews.com/politics/coast-guard-helicopter-sniper-takes-out-narco-boat-engines-stunning-exclusive-video",
    "timestamp": "2025-12-05T21:18:40Z"
  },
  {
    "title": "Gianni Infantino’s Trump problem - Politico",
    "description": "Gianni Infantino’s Trump problemPolitico WATCH: Trump awarded new FIFA peace prizePBS Gianni Infantino Awards Trump a FIFA Peace Prize and Announces World Cup DrawThe New York Times Live updates: Donald Trump attends 2026 World Cup draw; Indiana House OKs new…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180300905",
    "timestamp": "2025-12-05T21:12:57Z"
  },
  {
    "title": "Defending World Cup champion Argentina to open tournament vs. Algeria",
    "description": "With eyes across the globe focused on 48 balls being plucked from four bowls, next year's World Cup came into focus Friday when a draw determined Argentina and Lionel Messi will start their title defence against Algeria.",
    "link": "https://www.cbc.ca/sports/soccer/worldcup/world-cup-draw-roundup-dec5-9.7005137",
    "timestamp": "2025-12-05T21:10:46Z"
  },
  {
    "title": "Supreme Court Lets Trump Get Closer to Ending Birthright Citizenship",
    "description": "The Supreme Court agreed Friday to hear arguments over the legality of Donald Trump’s plan to end birthright citizenship, the 1868 constitutional detail that entitles any person born on U.S. soil to an American passport.In doing so, the nation’s highest judic…",
    "link": "https://newrepublic.com/post/204056/supreme-court-donald-trump-ending-birthright-citizenship",
    "timestamp": "2025-12-05T21:10:35Z"
  },
  {
    "title": "'One of the Worst Awards Someone Could Possibly Get': FIFA Blasted for Giving Trump Made-Up 'Peace Prize'",
    "description": "President Donald Trump, whose administration is engaged in a boat-bombing campaign in the Caribbean that human rights organizations and legal experts consider a murder spree, has finally been given a peace prize.Although Trump tried unsuccessfully this year t…",
    "link": "https://www.commondreams.org/news/trump-fifa-peace-prize",
    "timestamp": "2025-12-05T21:10:07Z"
  },
  {
    "title": "‘No basis in reality’: Steve Rattner fact-checks Trump on inflation, affordability",
    "description": "“Morning Joe” economic analyst Steve Rattner broke out his charts on Friday to fact-check Donald Trump’s false claims about the economy, which he said have “no basis in reality.” \nDuring a Cabinet meeting on Tuesday, Trump said he had inherited the “worst inf…",
    "link": "https://biztoc.com/x/a2f927209e459307",
    "timestamp": "2025-12-05T21:09:33Z"
  },
  {
    "title": "3 Down, Thousands To Go: Intel Reveals Many Afghan Terrorists Left Lurking In US",
    "description": "Nearly 2,000 Afghans with ties to potential terrorists were admitted into the country under the Biden administration, according to a senior official with ODNI.",
    "link": "https://dailycaller.com/2025/12/05/joe-kent-afghanistan-joe-biden-national-counterterrorism-center/",
    "timestamp": "2025-12-05T21:08:53Z"
  },
  {
    "title": "EU hits Elon Musk's X with 120 million euro fine for breaching bloc's social media law",
    "description": "European Union regulators on Friday fined X, Elon Musk’s social media platform, 120 million euros ($140 million) for breaches of the bloc’s digital regulations, in a move that risks rekindling tensions with Washington over free speech. The European Commission…",
    "link": "https://japantoday.com/category/tech/eu-regulators-hit-elon-musk%27s-x-with-120-million-euro-fine-for-breaching-bloc%27s-social-media-law",
    "timestamp": "2025-12-05T21:06:50Z"
  },
  {
    "title": "Carney, Trump and Sheinbaum met privately on sidelines of 2026 World Cup draw in D.C.",
    "description": "Prime Minister Mark Carney is meeting privately today with U.S. President Donald Trump and Mexican President Claudia Sheinbaum, with no staff in the room.",
    "link": "https://www.cbc.ca/news/politics/us-mexico-canada-fifa-meeting-9.7005088",
    "timestamp": "2025-12-05T21:05:47Z"
  },
  {
    "title": "'It doesn't make sense': Trump wants to rename American football",
    "description": "Spurred on by World Cup 2026 fever, US President Donald Trump said Friday that American football should be renamed as the game played with a round ball, soccer, was the one true football. &quot;We have a little bit of a conflict with another thing that's call…",
    "link": "https://japantoday.com/category/sports/%27it-doesn%27t-make-sense%27-trump-wants-to-rename-american-football",
    "timestamp": "2025-12-05T21:04:58Z"
  },
  {
    "title": "Xi, Macron Seize Symbolic Victories in Unorthodox Summit",
    "description": "Both China and France hope to strengthen their images on the world stage amid growing isolationism.",
    "link": "http://foreignpolicy.com/2025/12/05/xi-jinping-macron-china-chengdu-france-trade-multilateralism-tariffs/",
    "timestamp": "2025-12-05T21:04:49Z"
  },
  {
    "title": "Argentina to open World Cup against Algeria; U.S. starts against Paraguay",
    "description": "Argentina will start its World Cup title defense against Algeria, while the U.S. was drawn Friday to open against Paraguay as soccer’s quadrennial championship returns to North America for the first time since 1994. Three-time champion Argentina also will pla…",
    "link": "https://japantoday.com/category/sports/world-cup-match-schedule-to-come-into-focus-as-draw-begins-at-kennedy-center",
    "timestamp": "2025-12-05T21:04:44Z"
  },
  {
    "title": "FIFA gives Trump a peace prize in departure from its traditional focus on sport",
    "description": "President Donald Trump was awarded the new FIFA peace prize on Friday at the 2026 World Cup draw — giving the spectacle to set matchups for the quadrennial soccer tournament even more of a Trumpian flair. Trump, who has openly campaigned for the Nobel Peace P…",
    "link": "https://japantoday.com/category/sports/fifa-gives-president-donald-trump-a-peace-prize-in-a-departure-from-its-traditional-focus-on-sport",
    "timestamp": "2025-12-05T21:04:37Z"
  },
  {
    "title": "Seventy Years After Rosa Parks’ Arrest: How We Commit to Carrying the Work Forward",
    "description": "Weekend Reading for Women’s Representation is a compilation of stories about women’s representation in politics, sports and entertainment, judicial offices and the private sector—with a little gardening mixed in!\nThis week:\n—The 2025 elections prove that vote…",
    "link": "https://msmagazine.com/2025/12/05/women-politics-representation-rosa-parks-claudette-colvin-bus-boycott/",
    "timestamp": "2025-12-05T21:04:09Z"
  },
  {
    "title": "Renewed fighting in eastern Congo threatens 'historic' peace deal brokered by Trump",
    "description": "Residents of eastern Congo said fighting has intensified despite a peace agreement that was signed by the Congolese and Rwandan presidents in Washingtion, D.C., with U.S. President Donald Trump in attendance. Presidents Felix Tshisekedi of Congo and Paul Kaga…",
    "link": "https://japantoday.com/category/world/renewed-fighting-in-eastern-congo-threatens-%27historic%27-peace-deal-brokered-by-trump",
    "timestamp": "2025-12-05T21:04:05Z"
  },
  {
    "title": "Another line of attack: White House sets up a hall of shame for news outlets",
    "description": "President Donald Trump's White House is taking on the role of media critic and asking for help from “everyday Americans.&quot; The White House launched a web portal it says will spotlight bias on the part of news outlets, targeting the Boston Globe, CBS News,…",
    "link": "https://japantoday.com/category/world/another-line-of-attack-white-house-sets-up-a-hall-of-shame-for-news-outlets",
    "timestamp": "2025-12-05T21:03:45Z"
  },
  {
    "title": "Trump strategy document revives Monroe Doctrine, slams Europe",
    "description": "The United States will reassert its dominance in the Western Hemisphere, build military strength in the Indo-Pacific, and possibly reassess its relationship with Europe, President Donald Trump said on Friday in a sweeping strategy document that seeks to refra…",
    "link": "https://japantoday.com/category/world/trump-strategy-document-revives-monroe-doctrine-slams-europe1",
    "timestamp": "2025-12-05T21:03:25Z"
  },
  {
    "title": "ICE says agents have arrested 12 people in Minneapolis as part of immigration operation",
    "description": "Federal agents have arrested a dozen people in Minneapolis since launching an enforcement operation this week primarily focused on Somali immigrants living unlawfully in the U.S., but fewer than half of those detained are Somali. U.S. Immigration and Customs …",
    "link": "https://japantoday.com/category/world/ice-says-agents-have-arrested-12-people-in-minneapolis-as-part-of-immigration-operation",
    "timestamp": "2025-12-05T21:02:34Z"
  },
  {
    "title": "ICC prosecutor says Putin warrant won’t disappear even if Ukraine peace talks are successful",
    "description": "The deputy prosecutor of the International Criminal Court said Friday that the court's investigation into the invasion of Ukraine cannot be halted by peace talks but could be deferred by the U.N. Security Council. “If we have an ongoing investigation, then we…",
    "link": "https://japantoday.com/category/world/icc-prosecutor-says-putin-warrant-won%E2%80%99t-disappear-even-if-ukraine-peace-talks-are-successful",
    "timestamp": "2025-12-05T21:02:27Z"
  },
  {
    "title": "These voters backed Trump in 2024 and Democrats in 2025. What will they do in 2026?",
    "description": "Voters who backed Democratic governors in New Jersey and Virginia this year after voting for President Donald Trump in 2024 have a message for both parties: reject your party’s extremes and run campaigns about more than just Trump",
    "link": "https://www.nbcnews.com/politics/elections/voters-backed-trump-2024-democrats-2025-will-2026-rcna246847",
    "timestamp": "2025-12-05T21:00:42Z"
  },
  {
    "title": "Scotland's World Cup draw: Key questions answered",
    "description": "It FINALLY feels real. Scotland ARE going to the World Cup.",
    "link": "https://www.skysports.com/football/news/11095/13479737/scotlands-world-cup-draw-the-key-questions-as-steve-clarkes-side-are-drawn-against-brazil-morocco-and-haiti",
    "timestamp": "2025-12-05T21:00:00Z"
  },
  {
    "title": "Did 'South Park' Torpedo Paramount’s Plan to Acquire Warner Bros.?",
    "description": "“Oh my God, they killed the Warner Bros. deal!”",
    "link": "https://www.cracked.com/article_49409_did-south-park-torpedo-paramounts-plan-to-acquire-warner-bros.html",
    "timestamp": "2025-12-05T21:00:00Z"
  },
  {
    "title": "Bitcoin’s end-of-year run to $100K heavily depends on Fed pivot outcomes",
    "description": "Bitcoin’s chance of hitting $100,000 before New Year’s Eve depends on investors’ reaction to the Fed policy pivot, and the market’s response to soaring BigTech and AI company debt.",
    "link": "https://cointelegraph.com/news/bitcoin-s-end-of-year-run-to-100k-heavily-depends-on-fed-pivot-outcomes",
    "timestamp": "2025-12-05T21:00:00Z"
  },
  {
    "title": "Trump calls affordability a ‘Democrat scam’ and ‘con job’ — but nearly three-quarters of his voters think cost of living is bad or the worst ever",
    "description": "President Donald Trump and his administration insist that costs are coming down, but voters are skeptical, including those who put him back in the White House.\nDespite Republicans getting hammered on affordability in off-year elections last month, Trump conti…",
    "link": "https://biztoc.com/x/c60d02eeac8fd614",
    "timestamp": "2025-12-05T20:58:34Z"
  },
  {
    "title": "Venezuela War Update: Maduro Debuts Confusing Sketch Comedy Bit",
    "description": "Socialist dictator of Venezuela Nicolás Maduro on Thursday starred in a bizarre \"comedy sketch\" involving an antique rotary phone — apparently alluding to his recent phone call with President Donald Trump.\nThe post Venezuela War Update: Maduro Debuts Confusin…",
    "link": "https://www.breitbart.com/latin-america/2025/12/05/venezuela-war-update-maduro-debuts-confusing-sketch-comedy-bit/",
    "timestamp": "2025-12-05T20:56:14Z"
  },
  {
    "title": "Police: Felon with 29 Priors Arrested for Suspected Fentanyl Trafficking in Texas",
    "description": "Police in Lake Worth, Texas, nabbed a felon with a lengthy criminal history during a traffic stop involving suspected fentanyl. \nThe post Police: Felon with 29 Priors Arrested for Suspected Fentanyl Trafficking in Texas appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2025/12/05/police-felon-29-priors-arrested-suspected-fentanyl-trafficking-texas/",
    "timestamp": "2025-12-05T20:55:27Z"
  },
  {
    "title": "Trump's Bruised Hand Is Looking Pretty Swollen",
    "description": "It could be the light, but in addition to the now-familiar bandage covering the bruise, the president's hand appeared more than a little swollen.",
    "link": "https://www.huffpost.com/entry/trumps-bruised-hand-is-looking-pretty-swollen_n_69333ed3e4b03cea5ab440d8",
    "timestamp": "2025-12-05T20:54:12Z"
  },
  {
    "title": "Trump calls affordability a ‘Democrat scam’ and ‘con job’ — but nearly three-quarters of his voters think cost of living is bad or the worst ever",
    "description": "A Politico poll found that 37% of Americans who voted for Trump in 2024 believe the cost of living is the worst they can ever remember.",
    "link": "https://fortune.com/2025/12/05/trump-economy-affordability-con-job-cost-of-living-inflation-republican-voters/",
    "timestamp": "2025-12-05T20:51:52Z"
  },
  {
    "title": "Amid strained ties between India and U.S., Modi and Putin are full of praise for each other",
    "description": "A summit between Indian Prime Minister Narendra Modi and Russian President Vladimir Putin that tackled a trade imbalance and pushed to deepen defence ties between the two countries was also steeped in symbolism.",
    "link": "https://www.cbc.ca/news/world/putin-india-analysis-9.7004598",
    "timestamp": "2025-12-05T20:50:46Z"
  },
  {
    "title": "Three cheers for President Trump for letting motorists choose gas-powered cars",
    "description": "This uneconomical push for electric vehicles over gas-powered ones ignored consumer preferences and relied on high-handed executive overreach.",
    "link": "https://nypost.com/2025/12/05/opinion/good-on-president-trump-for-letting-motorists-choose-gas-powered-cars/",
    "timestamp": "2025-12-05T20:50:16Z"
  },
  {
    "title": "How White House attack on journalists affects US press freedom",
    "description": "A new government website lists journalists and media outlets that Donald Trump's administration considers liars. Experts say the move endangers free media ― and thus erodes democracy in the US. It's no secret that the current US administration doesn't have to…",
    "link": "https://www.dw.com/en/how-white-house-attack-on-journalists-affects-us-press-freedom/a-75040640",
    "timestamp": "2025-12-05T20:50:00Z"
  },
  {
    "title": "Netflix agrees to buy Warner Bros., including its game studios, for nearly $83 billion-with-a-B, but the fight may not be over yet",
    "description": "Paramount Skydance was also vying for WBD and it doesn't seem willing to take \"no\" for an answer.",
    "link": "https://www.pcgamer.com/gaming-industry/netflix-agrees-to-buy-warner-bros-including-its-game-studios-for-nearly-usd83-billion-with-a-b-but-the-fight-may-not-be-over-yet/",
    "timestamp": "2025-12-05T20:48:25Z"
  },
  {
    "title": "Judge Weighs Jailing Trump-Pardoned Jan 6 Rioter After Security Scare With Top Dem",
    "description": "A January 6 Capitol rioter pardoned by Trump is in fresh legal trouble after turning up near the home of Rep. Jamie Raskin (D-MD).\nThe post Judge Weighs Jailing Trump-Pardoned Jan 6 Rioter After Security Scare With Top Dem first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/judge-weighs-jailing-trump-pardoned-jan-6-rioter-after-security-scare-with-top-dem/",
    "timestamp": "2025-12-05T20:47:55Z"
  },
  {
    "title": "FACT FOCUS: Trump said weaker gas mileage rules will mean cheaper cars. Experts say don’t bet on it",
    "description": "By ALEXA ST. JOHN\nDETROIT (AP) — President Donald Trump this week announced plans to weaken rules for how far automakers’ new vehicles need to travel on a gallon of gasoline, set under former President Joe Biden.\nThe Trump administration said the rules, known…",
    "link": "https://biztoc.com/x/957bb3cf42bcd0b6",
    "timestamp": "2025-12-05T20:47:14Z"
  }
]