[
  {
    "title": "\"Somebody got to her\": Virginia Giuffre's father delivers controversial message to authorities as he rejects suicide narrative",
    "description": "The death of Virginia Giuffre, a leading figure in exposing Jeffrey Epstein&apos;s sex trafficking ring, has sparked controversy, with her father, Sky Roberts, publicly rejecting t",
    "link": "https://www.marca.com/en/lifestyle/celebrities/2025/05/02/6814255fe2704e6f0f8b45bc.html",
    "timestamp": "2025-05-02T04:47:11Z"
  },
  {
    "title": "Gaza community kitchens warn food is running out after two months of Israeli blockade",
    "description": "Many Palestinians depend on community kitchens, but one says they have only two weeks of supplies left.",
    "link": "https://www.bbc.com/news/articles/cx2vz02e7g8o",
    "timestamp": "2025-05-02T04:47:00Z"
  },
  {
    "title": "Fake news and the election campaign - how worried should voters be?",
    "description": "New research reveals a growing number of Australians are  encountering political misinformation and disinformation in the election campaign and are worried about it.",
    "link": "https://theconversation.com/fake-news-and-the-election-campaign-how-worried-should-voters-be-255514",
    "timestamp": "2025-05-02T04:45:25Z"
  },
  {
    "title": "China says open to US trade talks offer but wants tariffs scrapped",
    "description": "BEIJING &mdash; China said Friday it is evaluating a US offer for negotiations on tariffs but insisted Washington must be ready to scrap levies that have roiled global markets and supply chains before talks can begin.",
    "link": "https://www.bangkokpost.com/business/general/3016232/china-says-open-to-us-trade-talks-offer-but-wants-tariffs-scrapped",
    "timestamp": "2025-05-02T04:45:00Z"
  },
  {
    "title": "'Alarming deterioration' of US press freedom under Trump, says RSF",
    "description": "PARIS - Media rights group RSF warned Friday about \"an alarming deterioration in press freedom\" in the United States under President Donald Trump as well as \"unprecedented\" difficulties for independent journalists around the world.",
    "link": "https://www.bangkokpost.com/world/3016242/alarming-deterioration-of-us-press-freedom-under-trump-says-rsf",
    "timestamp": "2025-05-02T04:45:00Z"
  },
  {
    "title": "Trump signs executive order cutting funding for public broadcasters",
    "description": "The White House, in a social media posting announcing the order, says broadcasters PBS and NPR \"receive millions from taxpayers to spread radical, woke propaganda disguised as 'news'\".",
    "link": "https://www.abc.net.au/news/2025-05-02/donald-trump-cuts-funding-for-pbs-npr/105244626",
    "timestamp": "2025-05-02T04:41:34Z"
  },
  {
    "title": "Trump Ripped Over 'Shameful' Plan For A Massive Military Birthday Parade",
    "description": "Critics slammed Trump for cutting essential services while still finding cash for a big celebration.",
    "link": "https://www.huffpost.com/entry/trump-birthday-parade-reaction_n_68143061e4b0c3c651ebaf96",
    "timestamp": "2025-05-02T04:41:24Z"
  },
  {
    "title": "The Take: Could Trump tip Australia’s 2025 election?",
    "description": "Australians head to the polls on May 3. Will Donald Trump be a factor for voters?",
    "link": "https://www.aljazeera.com/podcasts/2025/5/2/the-take-could-trump-tip-australias-2025-election",
    "timestamp": "2025-05-02T04:41:06Z"
  },
  {
    "title": "India's response to Pahalgam attack should avoid regional war, says US VP Vance",
    "description": "Following the Pahalgam terror attack, US officials commented on the India-Pakistan situation. JD Vance urged a response that avoids broader conflict. Pete Hegseth conveyed condolences and US support to Rajnath Singh. Military operations directors from India a…",
    "link": "https://economictimes.indiatimes.com/news/defence/indias-response-to-pahalgam-attack-should-avoid-regional-war-says-us-vp-vance/articleshow/120811578.cms",
    "timestamp": "2025-05-02T04:36:18Z"
  },
  {
    "title": "A $250,000 Grant for Iowa’s International Writing Program",
    "description": "Philanthropist Hugh. F. Culverhouse Jr. moves on news from Iowa's International Writing Program after the Trump state department cancels its usual grants.\nThe post A $250,000 Grant for Iowa’s International Writing Program appeared first on Publishing Perspect…",
    "link": "https://publishingperspectives.com/2025/05/update-a-250000-matching-grant-for-iowas-international-writing-program/",
    "timestamp": "2025-05-02T04:35:41Z"
  },
  {
    "title": "U.S. Supreme Court Justice Jackson criticizes Trump's attacks on judges",
    "description": "U.S. Supreme Court Justice Ketanji Brown Jackson said on Thursday attacks by Republican President Donald Trump and his allies on judges were &quot;not random&quot; and seemed &quot;designed to intimidate the judiciary.&quot; U.S. Chief Justice John Roberts re…",
    "link": "https://japantoday.com/category/world/us-supreme-court-justice-jackson-criticizes-trump%27s-attacks-on-judges",
    "timestamp": "2025-05-02T04:34:04Z"
  },
  {
    "title": "Nigel Farage's Reform UK Party ahead by four votes in key election race",
    "description": "LONDON (Reuters) - Britain's right-wing Reform UK party made early gains in local election results on Friday and was ahead by just four votes in a battle for a seat in parliament in the first major electoral test since last year's general election. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/05/02/nigel-farage039s-reform-uk-party-ahead-by-four-votes-in-key-election-race",
    "timestamp": "2025-05-02T04:33:00Z"
  },
  {
    "title": "Australia votes – but what does it mean for Europe?",
    "description": "Labor vs Liberal-National Coalition: Australia's next government is set to shape the country’s path on defence and international trade.",
    "link": "https://www.euractiv.com/section/politics/news/australia-votes-but-what-does-it-mean-for-europe/",
    "timestamp": "2025-05-02T04:30:23Z"
  },
  {
    "title": "China Shipping Loophole Closed by Trump, Raising Prices for US Consumers",
    "description": "Small-value packages shipped to the US from China will no longer be exempted from tariffs starting Friday, when President Donald Trump’s move against an exception he called a “big scam” takes effect.",
    "link": "https://financialpost.com/pmn/business-pmn/china-shipping-loophole-closed-by-trump-raising-prices-for-us-consumers",
    "timestamp": "2025-05-02T04:30:20Z"
  },
  {
    "title": "Trump appoints eight new members to Holocaust Memorial Council",
    "description": "Among the new appointees are real estate developer Alex Witkoff and radio host Sid Rosenberg.",
    "link": "https://www.israelnationalnews.com/news/407734",
    "timestamp": "2025-05-02T04:28:12Z"
  },
  {
    "title": "'Alarming Deterioration' Of US Press Freedom Under Trump, Says RSF",
    "description": "Media rights group RSF warned Friday about \"an alarming deterioration in press freedom\" in the United States under President Donald Trump as well as \"unprecedented\" difficulties for independent journalists around the world.",
    "link": "https://www.ibtimes.com/alarming-deterioration-us-press-freedom-under-trump-says-rsf-3772233",
    "timestamp": "2025-05-02T04:27:17Z"
  },
  {
    "title": "Trump nominates Hermandorfer as US appeals court judge",
    "description": "United States President Donald Trump nominated Whitney Hermandorfer to serve as a judge on the United States Court of Appeals for the Sixth Circuit.\n\"Whitney has been serving the Great People of...",
    "link": "https://biztoc.com/x/8eb99977d3efe4ea",
    "timestamp": "2025-05-02T04:25:27Z"
  },
  {
    "title": "Trump Signs Executive Order to End Federal Funding of NPR, PBS",
    "description": "In an executive order, Donald Trump directed an end to federal funding for NPR and PBS. The Trump Administration cited concerns over \"the taxpayer subsidization of biased media.\"",
    "link": "https://consequence.net/2025/05/trump-signs-executive-order-to-end-federal-funding-of-npr-pbs/",
    "timestamp": "2025-05-02T04:25:19Z"
  },
  {
    "title": "Trump signs order that aims to cut funding to NPR, PBS",
    "description": "WASHINGTON (Reuters) -Donald Trump signed an executive order that aims to cut funding to news outlets NPR and PBS, the White House said, marking the U.S...",
    "link": "https://finance.yahoo.com/news/trump-signs-order-aims-cut-042247268.html",
    "timestamp": "2025-05-02T04:22:47Z"
  },
  {
    "title": "Trump signs executive order directing federal funding cuts to PBS and NPR",
    "description": "The order instructs the Corporation for Public Broadcasting and other federal agencies “to cease Federal funding for NPR and PBS.\"",
    "link": "https://www.pbs.org/newshour/politics/trump-signs-executive-order-directing-federal-funding-cuts-to-pbs-and-npr",
    "timestamp": "2025-05-02T04:21:28Z"
  },
  {
    "title": "Factories Key to Trump’s ‘Golden Age’ Urge China Tariff Relief",
    "description": "Almost as swiftly as he has erected his tariff wall around the US over the past 100 days, President Donald Trump has issued exemptions for a select but growing family of products like auto parts and smartphones.",
    "link": "https://financialpost.com/pmn/business-pmn/factories-key-to-trumps-golden-age-urge-china-tariff-relief",
    "timestamp": "2025-05-02T04:20:10Z"
  },
  {
    "title": "Trump Declares ‘We Will Always Protect Women’s Sports’ During Speech, Nick Saban Tells Glorious ‘Red Button’ Story",
    "description": "President Donald Trump showed up Thursday evening to the University of Alabama to deliver a commencement address to the college's Class of 2025. It was awesome.",
    "link": "https://dailycaller.com/2025/05/02/donald-trump-nick-saban-womens-sports-red-button-alabama/",
    "timestamp": "2025-05-02T04:19:54Z"
  },
  {
    "title": "SEC files to drop crypto promo case against YouTuber Ian Balina",
    "description": "The US Securities and Exchange Commission has filed to drop another of its crypto lawsuits, this time its unregistered securities sales case against crypto influencer and YouTuber Ian Balina. The SEC said in a May 1 joint stipulation with Balina to an Austin …",
    "link": "https://cointelegraph.com/news/sec-to-drop-crypto-promo-case-against-youtuber-ian-balina",
    "timestamp": "2025-05-02T04:18:57Z"
  },
  {
    "title": "Justice Kentanji Brown Jackson criticizes Trump’s attacks on judges",
    "description": "Supreme Court Justice Ketanji Brown Jackson said Thursday that  attacks by President Donald Trump on judges were “not random” and seemed “designed to intimidate the judiciary.”",
    "link": "https://www.nbcnews.com/news/us-news/justice-kentanji-brown-jackson-criticizes-trumps-attacks-judges-rcna204359",
    "timestamp": "2025-05-02T04:18:47Z"
  },
  {
    "title": "Trump signs executive order directing federal funding cuts to PBS and NPR",
    "description": "President Donald Trump on Thursday signed an executive order aiming to slash public subsidies to PBS and NPR as he alleged “bias” in the broadcasters’ reporting.",
    "link": "https://www.wsls.com/news/politics/2025/05/02/trump-signs-executive-order-directing-federal-funding-cuts-to-pbs-and-npr/",
    "timestamp": "2025-05-02T04:15:54Z"
  },
  {
    "title": "Trump Claims US Did ‘More Than Any Other Country’ to Win World War II",
    "description": "MOSCOW (Sputnik) - US President Donald Trump declared May 8 Victory Day, saying that the United States did \"more than any other country\" to win World War II.",
    "link": "https://sputnikglobe.com/20250502/trump-claims-us-did-more-than-any-other-country-to-win-world-war-ii-1121965577.html",
    "timestamp": "2025-05-02T04:15:52Z"
  },
  {
    "title": "Trump administration discontinues $1 billion in school mental health grants - NewsBreak",
    "description": "The Trump administration will not renew Biden-era grants worth $1 billion that were aimed at boosting mental health services in schools, a Department of E",
    "link": "https://www.newsbreak.com/share/3987831392442-trump-administration-discontinues-1-billion-in-school-mental-health-grants?s=a2&amp;share_destination_id=MTk5OTMxOTEwLTE3NDYxNTkyODA4NjY%3D&amp;pd=0DWtQE1t&amp;hl=en_US&amp;send_time=1746159280&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.17.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v2%2Cns_foryou_blend_exp_25q2-v2%2Cns_local_strategy_25q1_exp-v16%2Cns_foryou_recall_exp_25q2-v5",
    "timestamp": "2025-05-02T04:15:44Z"
  },
  {
    "title": "Trump Signs Executive Order Cutting Cuts to PBS and NPR",
    "description": "It's the latest move by the Trump administration to utilize federal powers to control or hamstring institutions whose actions or viewpoints he disagrees with.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/trump-funding-cuts-pbs-npr-1236205852/",
    "timestamp": "2025-05-02T04:15:02Z"
  },
  {
    "title": "France and Poland deepen defence ties in signal to Putin and Trump",
    "description": "Leaders Emmanuel Macron and Donald Tusk set to sign wide-ranging pact next week",
    "link": "https://biztoc.com/x/d17577acb4482e10",
    "timestamp": "2025-05-02T04:14:57Z"
  },
  {
    "title": "Tariff uncertainty seen slowing US job growth in April",
    "description": "Although companies are still holding onto workers amid economic ambiguity, analysts expect a sharp moderation in hiring.",
    "link": "https://www.thehindubusinessline.com/news/world/tariff-uncertainty-seen-slowing-us-job-growth-in-april/article69529312.ece",
    "timestamp": "2025-05-02T04:14:44Z"
  },
  {
    "title": "Trump tariff fallout: Asia’s manufacturing activity declines amid weakening demand",
    "description": "Manufacturing in Asia contracts due to weaker demand and US tariffs, impacting major economies like South Korea and Taiwan.",
    "link": "https://www.bloomberg.com/news/articles/2025-05-02/asia-s-factories-suffer-major-blow-as-trump-s-tariffs-hit-demand",
    "timestamp": "2025-05-02T04:14:26Z"
  },
  {
    "title": "How a US tax loophole supercharged China's exports",
    "description": "A recent policy shift ended tariff-free imports from China to the United States. This change impacts both American shoppers and Chinese exporters. Prices are rising for consumers in America. Factories in China are facing closures and job losses. The trade ten…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-a-us-tax-loophole-supercharged-chinas-exports/articleshow/120811109.cms",
    "timestamp": "2025-05-02T04:12:48Z"
  },
  {
    "title": "Trump signs executive order directing federal funding cuts to PBS and NPR",
    "description": "President Trump signed an executive order aiming to slash public subsidies to PBS and NPR, alleging bias in their reporting. The order instructs federal agencies to cease funding and root out indirect financing for the news organizations.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-executive-order-directing-federal-funding-cuts-to-pbs-and-npr/articleshow/120811087.cms",
    "timestamp": "2025-05-02T04:11:10Z"
  },
  {
    "title": "Newt Gingrich Explains Methods Media Uses To Churn Out ‘Dishonest’ Polls To Hurt Trump And How GOP Must Respond",
    "description": "Newt Gingrich said Republicans need to be \"tougher and clearer\" in against Dems opposition to Trump, calling out polls against the president.",
    "link": "https://dailycaller.com/2025/05/02/newt-gingrich-polls-donald-trump-legacy-media-gop-sean-hannity/",
    "timestamp": "2025-05-02T04:09:17Z"
  },
  {
    "title": "Trump Slashes Federal Funding to PBS, NPR in Executive Order",
    "description": "Trump calls the outlets \"woke propaganda disguised as ‘news'\" in sweeping order\nThe post Trump Slashes Federal Funding to PBS, NPR in Executive Order appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-executive-order-cuts-npr-and-pbs-funding/",
    "timestamp": "2025-05-02T04:09:09Z"
  },
  {
    "title": "Waiting for a shoe to drop in the US jobs market",
    "description": "WASHINGTON (AP) — Trouble may be coming for the American job market as President Donald Trump wages trade wars, purges federal workers and deports immigrants working in the United States illegally. But it’s probably not here yet. Economists expect the U.S. La…",
    "link": "https://financialpost.com/pmn/waiting-for-a-shoe-to-drop-in-the-us-jobs-market",
    "timestamp": "2025-05-02T04:06:46Z"
  },
  {
    "title": "From the Chinese Exclusion Act to pro-Palestinian Activists: The Evolution of politically motivated Deportations",
    "description": "By Rick Baldoz, Brown University (The Conversation) - The recent deportation orders targeting foreign students in the U.S. have prompted a heated debate about the legality of these actions. The Trump administration made no secret that many individuals were fa…",
    "link": "https://www.juancole.com/2025/05/palestinian-politically-deportations.html",
    "timestamp": "2025-05-02T04:06:11Z"
  },
  {
    "title": "John Bolton: Trump Decisions 'Random Neuron Flashes,' 'Playing Regular Chess'",
    "description": "Former National Security Advisor John Bolton said Thursday on CNN's \"Anderson Cooper 360\" that President Donald Trump's decisions were \"random neuron flashes.\"\nThe post John Bolton: Trump Decisions ‘Random Neuron Flashes,’ ‘Playing Regular Chess’ appeared fir…",
    "link": "https://www.breitbart.com/clips/2025/05/01/john-bolton-trump-decisions-random-neuron-flashes-playing-regular-chess/",
    "timestamp": "2025-05-02T04:06:10Z"
  },
  {
    "title": "Sensex jumps 750 pts, Nifty tops 24,500; IT, bank stocks lead gainers",
    "description": "Indian stock markets surged on Friday, fuelled by positive IT sector results and optimism surrounding potential trade deals between the U.S. and India. President Trump's remarks and renewed foreign investment inflows, marking an 11-session buying streak, furt…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-600-pts-nifty-tops-24500-it-bank-stocks-lead-gainers/articleshow/120810882.cms",
    "timestamp": "2025-05-02T04:05:17Z"
  },
  {
    "title": "Establishment of the Religious Liberty Commission (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nEstablishment of the Religious Liberty Commission  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and P…",
    "link": "https://www.memeorandum.com/250502/p1",
    "timestamp": "2025-05-02T04:05:03Z"
  },
  {
    "title": "Climate Change Summer or Nuclear Winter in Trumpworld",
    "description": "( Tomdispatch.com ) - Yes, give us human beings credit. In our relatively brief history, it’s no small thing to have come up with two different ways of thoroughly devastating Planet Earth and its inhabitants. One of them, of course, is the long-term, slow-mot…",
    "link": "https://www.juancole.com/2025/05/climate-nuclear-trumpworld.html",
    "timestamp": "2025-05-02T04:04:30Z"
  },
  {
    "title": "China Says Open To US Trade Talks Offer But Wants Tariffs Scrapped",
    "description": "China said Friday it is evaluating a US offer for negotiations on tariffs but insisted Washington must be ready to scrap levies that have roiled global markets and supply chains before talks can begin.",
    "link": "https://www.ibtimes.com/china-says-open-us-trade-talks-offer-wants-tariffs-scrapped-3772231",
    "timestamp": "2025-05-02T04:00:14Z"
  },
  {
    "title": "Crypto Confidence Returns: Galaxy Digital To List On Nasdaq",
    "description": "Cryptocurrency investment firm Galaxy Digital intends to shift the listing of its shares from Canada to the US early next month. The company, established by Mike Novogratz, who is a known Bitcoin advocate, will migrate to the Nasdaq from the Toronto Stock Exc…",
    "link": "https://bitcoinist.com/crypto-confidence-returns-galaxy-digital-to-list-on-nasdaq/",
    "timestamp": "2025-05-02T04:00:11Z"
  },
  {
    "title": "Harvard is reverting to its norm: Antisemitism, but Trump is on the job.",
    "description": "Yesterday, the news was that the Harvard Law Review offered a $65,000 fellowship to a man named Ibrahim Bharmal to do public interest with CAIR. The only problem is that, before receiving the fellowship, Bharmal was charged with assaulting a Jewish s...",
    "link": "https://www.americanthinker.com/blog/2025/05/harvard_is_reverting_to_its_norm_antisemitism_but_trump_is_on_the_job.html",
    "timestamp": "2025-05-02T04:00:00Z"
  },
  {
    "title": "Diluting Hitler: How the Left is Creating a Pale Ghost of the Real Adolf Hitler … and Turning Off Voters",
    "description": "I once heard a comic say, “Hitler – a man widely known for liking large dogs and small children – wasn’t really evil.  He just had a bad day.  Sure, it lasted twelve years and caused twenty million deaths, but it was...",
    "link": "https://www.americanthinker.com/articles/2025/05/diluting_hitler_how_the_left_is_creating_a_pale_ghost_of_the_real_adolf_hitler_and_turning_off_voters.html",
    "timestamp": "2025-05-02T04:00:00Z"
  },
  {
    "title": "Dealing with woke damage",
    "description": "Let’s separate the facts from the fiction with respect to the damage caused by wokism.\r\n\r\nWoke, which includes ESG, DEI, climate change, and other wasteful, misguided and discriminatory initiatives, has caused billions and probably trillions of...",
    "link": "https://www.americanthinker.com/blog/2025/05/dealing_with_woke_damage.html",
    "timestamp": "2025-05-02T04:00:00Z"
  },
  {
    "title": "Microsoft Irish dividends top $41bn",
    "description": "Tech giant employs more than 4,000 in Ireland",
    "link": "https://www.irishtimes.com/business/2025/05/02/microsoft-irish-dividends-top-41bn/",
    "timestamp": "2025-05-02T04:00:00Z"
  },
  {
    "title": "Turning Trump’s tariff pause into trading prosperity",
    "description": "Americans’ retirement funds are swinging like a carnival ride as the markets try to anticipate how President Donald Trump’s tariff moves will affect global trade. His 90-day pause on tariffs has provided some relief as everyone tries to d...",
    "link": "https://www.americanthinker.com/blog/2025/05/turning_trump_s_tariff_pause_into_trading_prosperity.html",
    "timestamp": "2025-05-02T04:00:00Z"
  },
  {
    "title": "Rogue judges will not stop Trump’s America first agenda",
    "description": "The American people spoke with a roar in 2024, delivering Donald Trump a mandate to unleash his America First agenda. But a cabal of rogue judges, intoxicated by their own power, dares to defy the will of the nation. These unelected, black-robed...",
    "link": "https://www.americanthinker.com/blog/2025/05/rogue_judges_will_not_stop_trump_s_america_first_agenda.html",
    "timestamp": "2025-05-02T04:00:00Z"
  },
  {
    "title": "Trump 2.0: An Imperial Presidency, or the People’s President?",
    "description": "Donald Trump once said, “I Run the Country and the World” and his critics quickly pounced on America’s imperial president, and the man who would be king. Like many things POTUS says, this needs to be taken with a grain of salt mixed...",
    "link": "https://www.americanthinker.com/articles/2025/05/trump_2_0_an_imperial_presidency_or_the_people_s_president.html",
    "timestamp": "2025-05-02T04:00:00Z"
  },
  {
    "title": "Reuters, along with most of the media, are just pure propagandists for the Democrat party",
    "description": "Here, Reuters intentionally misleads the public into believing that President Trump’s policies are leading to 20,000 layoffs at UPS:\r\n\r\n\r\nApril 29 (Reuters) - United Parcel Service said on Tuesday it would slash 20,000 jobs and shut 73 faciliti...",
    "link": "https://www.americanthinker.com/blog/2025/05/reuters_along_with_most_of_the_media_are_just_pure_propagandists_for_the_democrat_party.html",
    "timestamp": "2025-05-02T04:00:00Z"
  },
  {
    "title": "Trump Brutally Mocked Over Wild 'Challenge' To University Of Alabama Graduates",
    "description": "Trump weighed in on a real estate developer's \"trophy wife\" and \"tariff\" being the \"most beautiful word in the world\" in a rambling commencement address.",
    "link": "https://www.huffpost.com/entry/trump-business-majors-university-of-alabama-commencement-address-2025_n_68141b1be4b0fe32871bb63c",
    "timestamp": "2025-05-02T03:59:20Z"
  },
  {
    "title": "China says it’s evaluating the possibility of trade talks with the U.S.",
    "description": "China said it is evaluating U.S. overtures to initiate trade negotiations, potentially paving the way for the world’s two largest economies to start talks to resolve a trade war that has rumbled financial markets and cast a pall on global economic activity. S…",
    "link": "https://freerepublic.com/focus/f-news/4314550/posts",
    "timestamp": "2025-05-02T03:59:03Z"
  },
  {
    "title": "US auto tariffs backfire: supply chains prioritize cash management",
    "description": "The US will implement automotive parts tariffs starting on May 3rd, 2025, although President Donald Trump recently offered limited exemptions for certain vehicles and components. However, these tariffs have largely acted like a boomerang, especially with reta…",
    "link": "https://www.digitimes.com/news/a20250502PD214/automotive-canada-magna-donald-trump-supply-chain.html",
    "timestamp": "2025-05-02T03:59:02Z"
  },
  {
    "title": "‘Find your limits and then smash through everything’: Donald Trump’s 10 life tips for graduates",
    "description": "Donald Trump delivered a commencement speech at the University of Alabama, advising graduates to believe in themselves and work hard. He encouraged them to take risks and never give up, emphasizing their potential for success at a young age. The speech includ…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/find-your-limits-and-then-smash-through-everything-donald-trumps-10-life-tips-for-graduates/articleshow/120810877.cms",
    "timestamp": "2025-05-02T03:58:58Z"
  },
  {
    "title": "China Says Evaluating US Offer Of Tariff Talks But Wants 'Sincerity'",
    "description": "Punishing US tariffs that have reached 145 percent on many Chinese products came into force in April while Beijing has responded with fresh 125 percent duties on imports from the United States.",
    "link": "https://www.ibtimes.com/china-says-evaluating-us-offer-tariff-talks-wants-sincerity-3772228",
    "timestamp": "2025-05-02T03:53:41Z"
  },
  {
    "title": "3 House Democrats withdraw their names from cosponsorship of new Trump articles of impeachment",
    "description": "Three Democrats in the House of Representatives have quietly withdrawn their names from the list of co-sponsors of the articles of impeachment filed against President Trump on Tuesday, according to a report.",
    "link": "https://nypost.com/2025/05/01/us-news/3-house-democrats-withdraw-their-names-from-cosponsorship-of-new-trump-articles-of-impeachment/",
    "timestamp": "2025-05-02T03:53:35Z"
  },
  {
    "title": "China Says 'Evaluating' US Tariff Talks Talks, But Wants Trump's \"Sincerity\"",
    "description": "Punishing US tariffs that have reached 145 percent on many Chinese products came into force in April while Beijing has responded with fresh 125 percent duties on imports from the United States.",
    "link": "https://www.ndtv.com/world-news/china-says-evaluating-us-tariff-talks-talks-but-wants-trumps-sincerity-8309424",
    "timestamp": "2025-05-02T03:53:06Z"
  },
  {
    "title": "Trump Demands Sisi Give US Ships Free Passage Through Suez, Support Against Houthis",
    "description": "Trump Demands Sisi Give US Ships Free Passage Through Suez, Support Against Houthis\n \nVia Middle East Eye\nUS President Donald Trump asked his Egyptian counterpart, Abdel Fattah el-Sisi, for American ships to enjoy free passage through the Suez Canal in an Apr…",
    "link": "https://biztoc.com/x/9036873585e169e8",
    "timestamp": "2025-05-02T03:52:39Z"
  },
  {
    "title": "Asian stocks gain after China teases US tariff talks",
    "description": "HONG KONG: Asian markets largely rose on Friday (May 2), tracking Wall Street gains, as China said it was considering a United States offer to negotiate steep tariffs. US markets forged higher on Thursday f",
    "link": "https://www.channelnewsasia.com/asia/asian-stocks-gain-china-teases-us-tariff-talks-5104086",
    "timestamp": "2025-05-02T03:51:00Z"
  },
  {
    "title": "Asia’s factories suffer major blow as Trump’s tariffs hit demand",
    "description": "Manufacturing activity across most of Asia contracted in April, with companies struggling with weaker demand and pausing new orders in the face of US President Donald Trump&rsquo;s baseline 10% tariff.",
    "link": "https://www.bangkokpost.com/business/general/3016192/asias-factories-suffer-major-blow-as-trumps-tariffs-hit-demand",
    "timestamp": "2025-05-02T03:49:00Z"
  },
  {
    "title": "Australia's prime minister, opposition make final election pitch in Trump's shadow",
    "description": "SYDNEY (Reuters) - Australia's Prime Minister Anthony Albanese campaigned in his conservative opponent Peter Dutton's constituency on the final day before Saturday's election, with polls favouring the incumbent in a campaign overshadowed by Donald Trump's vol…",
    "link": "https://www.thestar.com.my/news/world/2025/05/02/australia039s-prime-minister-opposition-make-final-election-pitch-in-trump039s-shadow",
    "timestamp": "2025-05-02T03:48:00Z"
  },
  {
    "title": "Trump Takes a Surprise Dig at Elon Musk After Tesla CEO’s White House Exit",
    "description": "Donald Trump took an awkward dig at his “first buddy” Elon Musk just days after the billionaire left the White House. The president was speaking in front of ...",
    "link": "https://www.thedailybeast.com/trump-takes-a-surprise-dig-at-elon-musk-after-tesla-ceos-white-house-exit/",
    "timestamp": "2025-05-02T03:47:47Z"
  },
  {
    "title": "Global May Day protests held against Trump tariffs, administration",
    "description": "Hundreds of thousands of people across the globe have held May Day protests opposing US President Donald Trump's agenda.",
    "link": "https://www.abc.net.au/news/2025-05-02/us-global-may-day-protests-against-donald-trump/105244034",
    "timestamp": "2025-05-02T03:45:55Z"
  },
  {
    "title": "China says it’s assessing US talks, hinting at possible thaw",
    "description": "China said it is assessing the possibility of trade talks with the US, the first sign since Donald Trump hiked tariffs last month that negotiations could begin between the two sides.",
    "link": "https://www.bangkokpost.com/business/general/3016180/china-says-its-assessing-us-talks-hinting-at-possible-thaw",
    "timestamp": "2025-05-02T03:45:00Z"
  },
  {
    "title": "Trump vs Toyota? Why US cars are a rare sight in Japan",
    "description": "FUKAYA (JAPAN) - With their sleek curves and chrome grilles, the classic American cars on sale at Yosuke Fukuda's yard ooze Californian cool but on Japanese roads new US vehicles are a rare sight -- much to President Donald Trump's annoyance.",
    "link": "https://www.bangkokpost.com/business/general/3016157/trump-vs-toyota-why-us-cars-are-a-rare-sight-in-japan",
    "timestamp": "2025-05-02T03:45:00Z"
  },
  {
    "title": "Backyard barnyard: rising egg prices prompt hen hires in US",
    "description": "LA CRESCENTA (UNITED STATES) - Stung by the rocketing price of eggs -- and US supermarkets rationing a basic breakfast staple -- Yong-mi Kim decided to get some chickens to secure her own supply in southern California.",
    "link": "https://www.bangkokpost.com/world/3016162/backyard-barnyard-rising-egg-prices-prompt-hen-hires-in-us",
    "timestamp": "2025-05-02T03:45:00Z"
  },
  {
    "title": "Vice President JD Vance Explains Mike Waltz's Removal As National Security Advisor—It's Not What You Think It Is",
    "description": "Former Army Special Forces officer and Republican Florida representative Mike Waltz was removed from his post as national security advisor to President Trump Thursday. The spin from the leftist media was immediately that he was fired over his role in the “Sig…",
    "link": "https://freerepublic.com/focus/f-bloggers/4314546/posts",
    "timestamp": "2025-05-02T03:44:41Z"
  },
  {
    "title": "Trump signs executive order cutting PBS and NPR funding",
    "description": "President Trump signed an executive order aiming to slash public subsidies to PBS and NPR as he alleged \"bias\" in the broadcasters' reporting.",
    "link": "https://www.wcvb.com/article/trump-order-cuts-pbs-npr-funding/64649731",
    "timestamp": "2025-05-02T03:44:31Z"
  },
  {
    "title": "Trump signs executive order cutting PBS and NPR funding",
    "description": "President Trump signed an executive order aiming to slash public subsidies to PBS and NPR as he alleged \"bias\" in the broadcasters' reporting.",
    "link": "https://www.wmur.com/article/trump-order-cuts-pbs-npr-funding/64649731",
    "timestamp": "2025-05-02T03:44:06Z"
  },
  {
    "title": "Navigating the tariff storm: AUO's strategic response and the viability of US-based manufacturing",
    "description": "As the global supply chain continues to reel from the tariff war ignited by US President Donald Trump, Paul SL Peng, chairman of AUO, offers a measured analysis of the situation. He observes that, as panels are classified as components, tariffs have a relativ…",
    "link": "https://www.digitimes.com/news/a20250502PD205/auo-manufacturing-supply-chain-market-production.html",
    "timestamp": "2025-05-02T03:44:00Z"
  },
  {
    "title": "Microsoft Ditches Law Firm That Cut Deal With Trump — And Hires White House Adversary",
    "description": "Court documents showed Microsoft has hired Jenner & Block to replace Simpson Thacher in a lawsuit over its $69 billion purchase of Activision Blizzard.",
    "link": "https://www.huffpost.com/entry/microsoft-swaps-law-firms-trump_n_68143c2fe4b0c3c651ebb6a5",
    "timestamp": "2025-05-02T03:38:57Z"
  },
  {
    "title": "Jill Sobule, singer behind I Kissed A Girl and Supermodel, dead at 66",
    "description": "While best known for 90s hits 'Supermodel' and 'I Kissed A Girl', Jill Sobule's career spanned three decades, 12 albums and more.",
    "link": "https://www.abc.net.au/news/2025-05-02/jill-sobule-dead-obituary-i-kissed-a-girl/105243812",
    "timestamp": "2025-05-02T03:34:48Z"
  },
  {
    "title": "Asia’s Factories Suffer Major Blow as Trump’s Tariffs Hit Demand",
    "description": "Manufacturing activity across most of Asia contracted in April, with companies struggling with weaker demand and pausing new orders in the face of US President Donald Trump’s baseline 10% tariff.",
    "link": "https://financialpost.com/pmn/business-pmn/asias-factories-suffer-major-blow-as-trumps-tariffs-hit-demand",
    "timestamp": "2025-05-02T03:34:22Z"
  },
  {
    "title": "Supreme Court Justice Calls Out Trump Admin Attacks on Judges: 'Not Random'",
    "description": "Ketanji Brown Jackson said the attacks do not seem random and appear \"designed to intimidate.\"",
    "link": "https://www.newsweek.com/supreme-court-justice-ketanji-brown-jackson-rips-trump-attacks-judges-2067060",
    "timestamp": "2025-05-02T03:32:32Z"
  },
  {
    "title": "News Summary-Intelligence Report 5/1/2025*Newsdump Thursday*Israeli Air Attack In Damascus*US-Iran Talks Postponed Amid US Threats*Netanyahu Puts Military Victory Over Hostage Release*Court Rules Against South Korean Presidential Candidate*",
    "description": "A missile fired from Yemen intercepted before it could reach Israel... Russian air defenses confronting a major drone attack... Israeli Air Strike Near The Presidential Palace In Damascus Prime Minister Benjamin Netanyahu and Defense Minister Israel Katz sayi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4314544/posts",
    "timestamp": "2025-05-02T03:31:32Z"
  },
  {
    "title": "What can Asian countries offer Trump in tariff negotiations?",
    "description": "TOKYO -- Asian economies are set to use imports of U.S. energy resources as leverage in negotiations with U.S. President Donald Trump to back down from his hefty \"reciprocal\" tariffs, but concessions in other areas like automobiles and agriculture could prove…",
    "link": "https://biztoc.com/x/84641e9eb6c0d4ed",
    "timestamp": "2025-05-02T03:30:53Z"
  },
  {
    "title": "Amazon CEO Andy Jassy Says Many Shoppers Are “Stocking Up” To Get Ahead Of Tariffs – Update",
    "description": "Amazon CEO Andy Jassy says some customers are “stocking up” in advance of widespread tariffs planned by President Donald Trump.\n“Obviously, none of us knows exactly where tariffs will settle, or when,” Jassy told Wall Street analysts on the tech giant’s first…",
    "link": "https://biztoc.com/x/230a463380f51ae1",
    "timestamp": "2025-05-02T03:30:53Z"
  },
  {
    "title": "Asian stocks gain after China teases US tariff talks",
    "description": "Asian markets largely rose Friday, tracking Wall Street gains, as China said it was considering a US offer to negotiate steep tariffs. US markets forged higher Thursday following strong results from tech giants Microsoft and Meta that helped offset lingering …",
    "link": "https://www.digitaljournal.com/world/asian-stocks-gain-after-china-teases-us-tariff-talks/article",
    "timestamp": "2025-05-02T03:27:32Z"
  },
  {
    "title": "Asian Stocks Gain After China Teases US Tariff Talks",
    "description": "Asian markets largely rose Friday, tracking Wall Street gains, as China said it was considering a US offer to negotiate steep tariffs.",
    "link": "https://www.ibtimes.com/asian-stocks-gain-after-china-teases-us-tariff-talks-3772219",
    "timestamp": "2025-05-02T03:27:21Z"
  },
  {
    "title": "China says it's evaluating US overtures for trade talks, but tariffs remain an obstacle",
    "description": "China's Commerce Ministry says Beijing is evaluating multiple approaches by the Trump administration for trade talks",
    "link": "https://abcnews.go.com/US/wireStory/china-evaluating-us-overtures-trade-talks-tariffs-remain-121384718",
    "timestamp": "2025-05-02T03:26:38Z"
  },
  {
    "title": "Amazon Braces for Tougher Business Climate Amid Trump Trade War",
    "description": "Amazon.com Inc. said it’s bracing for a tougher business climate in the coming months, echoing concerns from a range of companies that tariffs and related economic turmoil could crimp consumer spending.",
    "link": "https://www.livemint.com/companies/news/amazon-braces-for-tougher-business-climate-amid-trump-trade-war-11746156392504.html",
    "timestamp": "2025-05-02T03:26:32Z"
  },
  {
    "title": "China says assessing US proposals for talks to reduce tariffs",
    "description": "China considers engaging in talks with the US over tariffs after recent outreach, demanding sincerity and concrete actions from the US.",
    "link": "https://www.thehindubusinessline.com/news/world/china-says-assessing-us-proposals-for-talks-to-reduce-tariffs/article69529255.ece",
    "timestamp": "2025-05-02T03:24:35Z"
  },
  {
    "title": "Nebraska hospitals express concern over tariff-related price hikes",
    "description": "Potential price increases on essential items like syringes and medications, many of which come from China, are leaving hospitals concerned for the future.",
    "link": "https://www.klkntv.com/nebraska-hospitals-express-concern-over-tariff-related-price-hikes/",
    "timestamp": "2025-05-02T03:23:27Z"
  },
  {
    "title": "Microsoft raises Xbox prices globally, following Sony",
    "description": "Microsoft announced Thursday that it will increase Xbox console prices worldwide, citing \"market conditions\" just days after Sony made a similar move with its PlayStation 5. In mid-April, Sony announced price increases for several PlayStation 5 models in sele…",
    "link": "https://economictimes.indiatimes.com/tech/technology/microsoft-raises-xbox-prices-globally-following-sony/articleshow/120809783.cms",
    "timestamp": "2025-05-02T03:20:09Z"
  },
  {
    "title": "They love a parade: President Trump and U.S. Army to celebrate their June 14 birthdays",
    "description": "Plans for the parade include 6,000 soldiers, helicopters and armored vehicles, such as Strykers, Bradley Fighting Vehicles and possibly Abrams tanks.",
    "link": "https://www.usatoday.com/story/news/politics/2025/05/01/birthday-bash-president-donald-trump-and-army-plan-june-14-parade/83401058007/",
    "timestamp": "2025-05-02T03:19:27Z"
  },
  {
    "title": "Texas Lawmaker Urges US Government to Put Crypto ATMs in Federal Buildings",
    "description": "A Texas Republican pushes to install crypto ATMs in federal buildings, aiming to align with what they describe as part of \"Trump’s vision.\"",
    "link": "https://decrypt.co/317519/texas-lawmaker-government-crypto-atms-federal-buildings",
    "timestamp": "2025-05-02T03:18:42Z"
  },
  {
    "title": "Elon Musk, DOGE Team Reveal Which Agency Fought Them Hardest",
    "description": "Elon Musk and members of DOGE team appeared on Fox News Thursday and named the federal agency that resisted their oversight efforts most aggressively.",
    "link": "https://dailycaller.com/2025/05/01/elon-musk-doge-team-institute-peace-taliban/",
    "timestamp": "2025-05-02T03:16:36Z"
  },
  {
    "title": "Trump Administration Asks Supreme Court to Strip Temporary Protected Status From 350,000 Venezuelan Migrants",
    "description": "The White House has moved aggressively to withdraw various protections that have allowed immigrants to remain in the country.",
    "link": "https://time.com/7282143/tps-temporary-protected-status-venezuelans-trump-supreme-court-immigration/",
    "timestamp": "2025-05-02T03:15:00Z"
  },
  {
    "title": "Tokyo's tariff envoy says US talks 'constructive'",
    "description": "WASHINGTON: Tokyo's envoy for United States tariff talks in Washington said on Thursday (May 1) that the second round of negotiations between the two countries had been \"frank and constructive\".",
    "link": "https://www.channelnewsasia.com/east-asia/japan-tokyo-tariff-envoy-us-talks-constructive-5104046",
    "timestamp": "2025-05-02T03:14:52Z"
  },
  {
    "title": "Trump Budget Seeks 23% Domestic Spending Cut, 13% Defense Hike",
    "description": "President Donald Trump is asking Congress for deep cuts to domestic agencies and a boost to the military in a preliminary outline of his 2026 budget request to be released Friday.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-budget-seeks-23-domestic-spending-cut-13-defense-hike",
    "timestamp": "2025-05-02T03:13:44Z"
  },
  {
    "title": "Trump Squeaks During Bizarre Weightlifting Reenactment: ‘Mom, I’m Gonna Do It’",
    "description": "President Donald Trump gave a college commencement address that was virtually indistinguishable from a rally speech on Thursday night. \nThe post Trump Squeaks During Bizarre Weightlifting Reenactment: ‘Mom, I’m Gonna Do It’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/trump-squeaks-during-bizarre-weightlifting-reenactment-mom-im-gonna-do-it/",
    "timestamp": "2025-05-02T03:12:21Z"
  },
  {
    "title": "Oil prices rise as China says it's open for trade talks with US",
    "description": "Oil prices saw a boost in Asian trading following China's indication of openness to U.S. trade talks, fueling hopes for de-escalation. Brent crude rose to $62.51 a barrel, while U.S. WTI crude reached $59.62. President Trump's threat of sanctions on Iranian o…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-rise-as-china-says-its-open-for-trade-talks-with-us/articleshow/120809330.cms",
    "timestamp": "2025-05-02T03:07:47Z"
  },
  {
    "title": "US blacklist on China is riddled with errors, outdated details",
    "description": "Doris Au, a seller of door locks and hardware in Hong Kong for 25 years, received a letter from her bank, DBS Group, last June stating that her business...",
    "link": "https://www.yahoo.com/news/us-blacklist-china-riddled-errors-030500525.html",
    "timestamp": "2025-05-02T03:05:00Z"
  },
  {
    "title": "China wants 'sincerity' as it evaluates tariff offer from the US",
    "description": "China's Commerce Ministry said it was evaluating an offer on tariff negotiations from the United States. It said it wanted to the US to show \"sincerity\" and not take unilateral measures. China's Commerce Ministry on Friday said it was \"currently evaluating\" a…",
    "link": "https://www.dw.com/en/china-wants-sincerity-as-it-evaluates-tariff-offer-from-the-us/a-72411501",
    "timestamp": "2025-05-02T03:04:00Z"
  }
]