[
  {
    "title": "Putin shocks Trump, says 'We like Melania better'; US President then shares his hilarious response",
    "description": "US President Donald Trump revealed details of his call with Russia's Vladimir Putin at an event where he signed a law that makes posting so-called \"revenge porn\" and deepfake explicit content illegal. Trump revealed that Putin said Russians respect his wife M…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-putin-ceasefire-putin-shocks-trump-says-we-like-melania-better-us-president-then-shares-his-hilarious-response/articleshow/121289215.cms",
    "timestamp": "2025-05-20T09:46:44Z"
  },
  {
    "title": "Here's what queer, transgender, and intersex people should know about prostate cancer",
    "description": "On Sunday, a short statement from the personal office of former President Joe Biden stunned the country and unsettled many, including LGBTQ+ Americans.",
    "link": "https://www.advocate.com/health/lgbtq-prostate-cancer-health",
    "timestamp": "2025-05-20T09:45:04Z"
  },
  {
    "title": "VCU Health building $90 million surgery center in Chesterfield",
    "description": "In January, VCU Health System bought the undeveloped, 8-acre parcel from Cogbill Land Associates for $1.5 million.",
    "link": "https://richmond.com/news/local/business/health-care/article_19319922-ea55-434a-8948-d4c5f5aca11b.html",
    "timestamp": "2025-05-20T09:45:00Z"
  },
  {
    "title": "Can House Republicans Govern? This Week Will Pose a Big Test.",
    "description": "The House GOP’s biggest week of the year has finally arrived.",
    "link": "https://slate.com/news-and-politics/2025/05/trump-big-beautiful-bill-republicans-medicaid-tax-cuts.html",
    "timestamp": "2025-05-20T09:45:00Z"
  },
  {
    "title": "Media Ignored Biden’s Health After Spending Years Obsessing Over Trump’s",
    "description": "It’s become fairly obvious that for four years under Joe Biden, the United States was subjected to a puppet presidency in which its commander-in-chief was out to lunch on major policy initiatives enacted by unknown officials within his administration. And for…",
    "link": "https://thefederalist.com/2025/05/20/media-ignored-bidens-health-after-spending-years-obsessing-over-trumps/",
    "timestamp": "2025-05-20T09:45:00Z"
  },
  {
    "title": "UK’s Legal Aid Agency discloses a data breach following April cyber attack",
    "description": "The UK’s Legal Aid Agency suffered a cyberattack in April and has now confirmed that sensitive data was stolen during the incident. The Legal Aid Agency (LAA) revealed that it had suffered a cyberattack on its systems on April 23.  The Legal Aid Agency (LAA),…",
    "link": "https://securityaffairs.com/178088/data-breach/uks-legal-aid-agency-discloses-data-breach-following-april-cyber-attack.html",
    "timestamp": "2025-05-20T09:44:39Z"
  },
  {
    "title": "Commodity Radar: Aluminium prices fall on rising output, Trump’s tariff impact. Here’s how to trade it",
    "description": "Aluminium prices declined as US tariffs and higher Chinese output pressured global supply-demand dynamics. Domestic futures slipped, while technical resistance capped recent recovery momentum near ₹245 levels.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/commodity-radar-aluminium-prices-fall-on-rising-output-trumps-tariff-impact-heres-how-to-trade-it/articleshow/121289114.cms",
    "timestamp": "2025-05-20T09:43:50Z"
  },
  {
    "title": "Trump alleges 'genocide' in South Africa. At an agricultural fair, even Afrikaner farmers scoff",
    "description": "An extraordinary new U.S. refugee policy welcoming white Afrikaner farmers who the Trump administration claims are persecuted is topping the agenda at a White House meeting between President Donald Trump and South Africa’s president.\n\nThe Associated Press vis…",
    "link": "https://abcnews.go.com/International/wireStory/trump-alleges-genocide-south-africa-agricultural-fair-afrikaner-121978210",
    "timestamp": "2025-05-20T09:42:52Z"
  },
  {
    "title": "World shares advance after China cuts interest rates to boost economy",
    "description": "Shares have gained in Asia and Europe after China cut key interest rates to help fend off an economic malaise worsened by trade friction with Washington",
    "link": "https://abcnews.go.com/Business/wireStory/world-shares-advance-after-china-cuts-interest-rates-121974555",
    "timestamp": "2025-05-20T09:42:18Z"
  },
  {
    "title": "GOP Sen. Spills On Trump Qatari Jet Plan: 'Probably Shouldn’t Be Breaking That Story'",
    "description": "\"A lot of it’s still classified,\" claimed South Dakota Republican Mike Rounds.",
    "link": "https://www.huffpost.com/entry/mike-rounds-donald-trump-qatari-jet-plan_n_682c4088e4b095274fad43ea",
    "timestamp": "2025-05-20T09:42:14Z"
  },
  {
    "title": "Zelensky says Russia 'trying to buy time' to 'continue war'",
    "description": "Ukrainian President Volodymyr Zelensky on Tuesday accused Russia of not seriously engaging in peace talks and of wanting to continue its three-year invasion, a day after Donald Trump held calls with both Zelensky and Vladimir Putin on the war.",
    "link": "https://www.hurriyetdailynews.com/zelensky-says-russia-trying-to-buy-time-to-continue-war-209386",
    "timestamp": "2025-05-20T09:36:29Z"
  },
  {
    "title": "Trump vows to turn the Kennedy Center around as he seeks to remake arts and culture in America",
    "description": "Donald Trump is actively reshaping the Kennedy Center, appointing loyalists to the board and criticizing past programming as \"woke.\" He aims to overhaul the national arts scene, slashing federal funding and advocating for content that promotes American cultur…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-vows-to-turn-the-kennedy-center-around-as-he-seeks-to-remake-arts-and-culture-in-america/articleshow/121288867.cms",
    "timestamp": "2025-05-20T09:35:55Z"
  },
  {
    "title": "Trump-Putin High Stakes Call Reaction; Trump's Push for Tax Bill",
    "description": "On today's podcast: 1) Eleven days ago, European leaders took heart when President Donald Trump called for a 30-day ceasefire in Ukraine and threatened new sanctions on Russia. A telephone call with Vladimir Putin on Monday revealed those hopes were misplaced…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/trump-putin-high-stakes-call-reaction-trumps-push-for-tax-bill",
    "timestamp": "2025-05-20T09:34:28Z"
  },
  {
    "title": "The second Trump administration's indiscriminate economic sanctions",
    "description": "While the global economy has been shaken by the Trump administration's aggressive imposition of tariffs, there is an additional cascade of problems resulting from economic sanctions — economic measures imposed for political objectives, as distinct from tariff…",
    "link": "https://mondediplo.com/outside-in/sanctions-trump",
    "timestamp": "2025-05-20T09:32:04Z"
  },
  {
    "title": "NATO Ally Gives Blunt Assessment of Trump-Putin Call",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nGermany's defense minister Boris Pistorius said Russian President Vladimir Putin should be judged by his actions, not words, and that he is \"continuing to play for time\" with \"lip service\" after his call with …",
    "link": "https://biztoc.com/x/9f95cd04a70a2150",
    "timestamp": "2025-05-20T09:32:00Z"
  },
  {
    "title": "Comey claims he had no 'dark intention' with '86 47' seashell post, isn't scared of Trump",
    "description": "Former FBI Director James Comey defended his Instagram post of '86 47' seashells, saying he had no ill intent but that he did regret the distraction it caused.",
    "link": "https://www.foxnews.com/media/comey-claims-he-had-no-dark-intention-86-47-seashell-post-isnt-scared-trump",
    "timestamp": "2025-05-20T09:30:59Z"
  },
  {
    "title": "Trump Finally Enters the Fray",
    "description": "Punchbowl News: “President Donald Trump will leave the gold-gilded White House this morning to join a rambunctious and divided House Republican Conference in the dank Capitol basement.” “Trump’s goal is to try to get the",
    "link": "https://politicalwire.com/2025/05/20/trump-finally-enters-the-fray/",
    "timestamp": "2025-05-20T09:30:37Z"
  },
  {
    "title": "What the Global South takes away from the US-China deal",
    "description": "With its Beijing truce, the Trump administration may have confirmed suspicions that it places profit over principles. This may relieve some developing nations, but could also spell greater global instability in time to come.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-xi-jinping-jimmy-lai-hong-kong-xinjiang-global-south-saudi-arabia-mohammed-bin-salman-united-states-china-11747666884689.html",
    "timestamp": "2025-05-20T09:30:13Z"
  },
  {
    "title": "Global retailers' tariff strategy risks spreading pain beyond US consumer",
    "description": "Global retailers like Birkenstock and Pandora are planning to increase prices worldwide. This is to offset the impact of US tariffs. This strategy could lead to inflation in Europe and Britain. Central banks are closely monitoring the situation. Some companie…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/global-retailers-tariff-strategy-risks-spreading-pain-beyond-us-consumer/articleshow/121288934.cms",
    "timestamp": "2025-05-20T09:27:10Z"
  },
  {
    "title": "Iran's Supreme Leader Speaks Out on Nuclear Deal With Trump",
    "description": "Khamenei has called U.S. demands to stop Iran's enrichment of uranium \"nonsense\"",
    "link": "https://www.newsweek.com/irans-supreme-leader-speaks-out-nuclear-deal-trump-2074499",
    "timestamp": "2025-05-20T09:27:02Z"
  },
  {
    "title": "Biden’s Late Cancer Diagnosis Exposes Democrats And The Media As Legitimate National Security Risks",
    "description": "Until Democrats start naming names and apologizing for their reckless, craven conduct as it relates to Joe Biden, I don’t want to hear another word about Pete Hegseth’s Signal chats. It was fine timing to get news over the weekend that the former president, a…",
    "link": "https://thefederalist.com/2025/05/20/bidens-late-cancer-diagnosis-exposes-democrats-and-the-media-as-legitimate-national-security-risks/",
    "timestamp": "2025-05-20T09:26:00Z"
  },
  {
    "title": "Analysis-Global retailers' tariff strategy risks spreading pain beyond US consumer",
    "description": "LONDON/FRANKFURT (Reuters) -Global retailers including sandal maker Birkenstock and  jeweller Pandora are looking at spreading the cost of U.S. tariffs by...",
    "link": "https://finance.yahoo.com/news/analysis-global-retailers-tariff-strategy-092316811.html",
    "timestamp": "2025-05-20T09:23:16Z"
  },
  {
    "title": "Putin and Trump Solidify Positions as the Real Power Brokers in Ukraine Peace Push",
    "description": "Dmitry Suslov, deputy director at Russia's Higher School of Economics and the Russian Council on Foreign and Defense Policy, breaks down the key takeaways from Monday's potentially historic telephone conversation between the Russian and US presidents.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250519-sputnik01.htm",
    "timestamp": "2025-05-20T09:21:34Z"
  },
  {
    "title": "Trump Says Call With Putin Went 'Very Well'",
    "description": "US President Donald Trump said Monday that his call with Russian President Vladimir Putin earlier in the day went \"very well\" and that the tone and the spirit of the conversation were \"excellent.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250519-sputnik02.htm",
    "timestamp": "2025-05-20T09:21:34Z"
  },
  {
    "title": "President Pezeshkian: Deal 'within reach' only if US stops bullying tactics",
    "description": "Iranian President Masoud Pezeshkian says that reaching an agreement with the United States is possible but only if Washington abandons its bullying tactics.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250519-presstv06.htm",
    "timestamp": "2025-05-20T09:21:34Z"
  },
  {
    "title": "As US Pushes For Zero Enrichment, Iran Insists It Won't Give Up Nuclear Program",
    "description": "US Middle East envoy Steve Witkoff declared that the Donald Trump administration's \"red line\" in the nuclear talks with Iran is Tehran's ability to enrich uranium at any level, prompting Iran to say it will continue enrichment \"with or without a deal.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250519-rferl01.htm",
    "timestamp": "2025-05-20T09:20:47Z"
  },
  {
    "title": "Vladimir Putin's statement to the media following a telephone conversation with US President Donald Trump",
    "description": "Vladimir Putin made a statement to the media following a telephone conversation with President of the United States of America Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250519-kremlin01.htm",
    "timestamp": "2025-05-20T09:20:47Z"
  },
  {
    "title": "Syrians heading home find few of the basics needed to survive",
    "description": "Syrians trying to rebuild their lives in their war-torn country urgently need the support of the rest of the world to help them start again, UN aid agencies insist.",
    "link": "https://www.globalsecurity.org/wmd/library/news/syria/2025/syria-250519-unnews01.htm",
    "timestamp": "2025-05-20T09:20:47Z"
  },
  {
    "title": "Trump Says Moscow, Kyiv To 'Immediately' Begin Direct Talks Following Call with Putin",
    "description": "US President Donald Trump said that Moscow and Kyiv will \"immediately\" begin cease-fire talks following his latest call with Russian leader Vladimir Putin.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250519-rferl02.htm",
    "timestamp": "2025-05-20T09:20:47Z"
  },
  {
    "title": "Houthi: Persian Gulf states' money flowing to US must be used to stop Gaza genocide",
    "description": "A high-ranking Yemeni official denounced certain Persian Gulf states for striking multi-billion-dollar deals with US President Donald Trump during his recent tour of the region, stressing that financial gains from such agreements must be used to stop the ongo…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250519-presstv03.htm",
    "timestamp": "2025-05-20T09:20:47Z"
  },
  {
    "title": "Trump says phone call with Putin \"went very well\"",
    "description": "U.S. President Donald Trump said his telephone conversation Monday morning with his Russian counterpart Vladimir Putin \"went very well.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250520-pdo01.htm",
    "timestamp": "2025-05-20T09:20:47Z"
  },
  {
    "title": "Vance Skips Visit to Israel to Avoid Encouraging New IDF Operation in Gaza - Reports",
    "description": "US Vice President JD Vance has decided against his trip to Israel over the weekend amid the new offensive in the Gaza Strip, media reported on Monday, citing US officials.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250519-sputnik01.htm",
    "timestamp": "2025-05-20T09:20:47Z"
  },
  {
    "title": "Johnnie Walker owner Diageo says Trump tariffs could hit profits by $150m",
    "description": "Diageo, the drinks business behind Guinness and Johnnie Walker whisky, has said Donald Trump’s tariffs could hit its profits by $150m (£112m) each year, although it expects to be able to cushion about half of the expected blow.\nThe FTSE 100 group, which sells…",
    "link": "https://biztoc.com/x/738299fda6f96d5d",
    "timestamp": "2025-05-20T09:20:46Z"
  },
  {
    "title": "NATO Ally Gives Blunt Assessment of Trump-Putin Call",
    "description": "President Donald Trump hailed his \"excellent\" call with Russian President Vladimir Putin.",
    "link": "https://www.newsweek.com/nato-ally-gives-blunt-assessment-trump-putin-call-2074520",
    "timestamp": "2025-05-20T09:20:42Z"
  },
  {
    "title": "'I'll shove it up their...': Trump says nobody gonna mention that he got Olympics and Fifa World Cup",
    "description": "Donald Trump revealed his reasons for contesting the 2024 elections at a White House meeting. He repeated his claim of a rigged 2020 election. Trump boasted about securing the Olympics and FIFA World Cup for the US. He criticized the Kennedy Center's previous…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-ill-shove-it-up-their-ass-trump-says-nobody-gonna-mention-that-he-got-olympics-and-fifa-world-cup/articleshow/121288442.cms",
    "timestamp": "2025-05-20T09:10:34Z"
  },
  {
    "title": "Turkey's Erdogan Has Become One of World's Most Powerful Men—And Trump Ally",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs President Donald Trump seeks to reshape Washington's foreign policy in the Middle East, the U.S. leader has increasingly looked to the head of a longtime ally who has emerged as one of the most influential …",
    "link": "https://biztoc.com/x/ae95b4b4cdd53b43",
    "timestamp": "2025-05-20T09:09:48Z"
  },
  {
    "title": "Melania Trump Makes Rare Public Appearance to Sign 'Revenge Porn' Bill",
    "description": "Melania Trump, a vocal proponent of the bill, joined President Donald Trump in signing the Take It Down Act, a new law targeting revenge porn and AI deepfakes.",
    "link": "https://biztoc.com/x/330b801925f12b74",
    "timestamp": "2025-05-20T09:09:45Z"
  },
  {
    "title": "A French company is making a rival to the US-made HIMARS that has been critical in Ukraine",
    "description": "France's Turgis Gaillard said it's developing a long-range strike system that can fire rockets and missiles. It's similar to Lockheed Martin's HIMARS.",
    "link": "https://www.businessinsider.com/france-making-rival-us-made-himars-ukraine-war-shows-need-2025-5",
    "timestamp": "2025-05-20T09:07:01Z"
  },
  {
    "title": "First Cracks Emerge in US-China Trade Truce",
    "description": "Barely a week after a high-profile joint statement signaled a pause in trade hostilities, the U.S. and China are disagreeing again.",
    "link": "https://www.newsweek.com/china-accuses-us-undermining-trade-agreement-geneva-talks-2074446",
    "timestamp": "2025-05-20T09:05:31Z"
  },
  {
    "title": "The Tapper Dossier: How the CNN 'Journalist' Covered (Up) the Biden Cover-Up—Before Writing a Best-Selling Book About It",
    "description": "CNN host Jake Tapper has been under fire since announcing he was writing a book about President Joe Biden's cognitive decline and the extensive efforts to conceal that decline from public view. Many have pointed out that Tapper, his network, and the mainstrea…",
    "link": "https://freebeacon.com/media/the-tapper-dossier-how-the-cnn-host-covered-up-the-biden-cover-up-before-writing-a-book-about-it/",
    "timestamp": "2025-05-20T09:00:52Z"
  },
  {
    "title": "Rare bipartisan support moves GENIUS Act closer to law despite key Democrats opposition",
    "description": "The US Senate has moved the GENIUS Act one step closer to becoming law, following a 66–32 cloture vote on May 19. The vote signals rare bipartisan support, with over a dozen Democrats joining Republicans to move the bill forward after weeks of negotiation. No…",
    "link": "https://cryptoslate.com/rare-bipartisan-support-moves-genius-act-closer-to-law-despite-key-democrats-opposition/",
    "timestamp": "2025-05-20T09:00:48Z"
  },
  {
    "title": "Reagan and Trump are more alike than you think",
    "description": "Ronald Reagan and Donald Trump share a legacy of challenging the GOP establishment, both embracing conservative values and appealing to blue-collar voters.",
    "link": "https://www.foxnews.com/opinion/reagan-trump-more-alike-you-think",
    "timestamp": "2025-05-20T09:00:48Z"
  },
  {
    "title": "UNB law prof warns academics to avoid U.S. border where due process 'is on life support'",
    "description": "Academics are being warned to avoid all non-essential travel to the U.S. after a spike in cases of people being detained or denied entry.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/unb-prof-warns-academics-to-avoid-u-s-travel-1.7537038",
    "timestamp": "2025-05-20T09:00:39Z"
  },
  {
    "title": "60 Minutes’ Scott Pelley Tells College Grads: ‘Freedom of Speech is Under Attack’ By Trump Administration",
    "description": "Scott Pelley, 60 Minutes correspondent and former CBS Evening News anchor, on Monday took shots at President Donald Trump, his supporters, and CBS News owner Paramount in a commencement address at Wake Forest University.\nThe post 60 Minutes’ Scott Pelley Tell…",
    "link": "https://freebeacon.com/media/60-minutes-scott-pelley-tells-college-grads-freedom-of-speech-is-under-attack-by-trump-administration/",
    "timestamp": "2025-05-20T09:00:38Z"
  },
  {
    "title": "Pittsburgh's progressive mayor faces stiff challenge from 'old guard' in primary",
    "description": "Steel City voters choose between incumbent's progressive agenda and Corey O'Connor's more moderate Democratic vision.",
    "link": "https://www.foxnews.com/politics/pittsburghs-progressive-mayor-faces-stiff-challenge-from-old-guard-primary",
    "timestamp": "2025-05-20T09:00:18Z"
  },
  {
    "title": "LIZ PEEK: Biden cancer announcement has my sympathy and my skepticism",
    "description": "Former President Joe Biden's stage 4 prostate cancer diagnosis raises skepticism about its timing, political implications, and media coverage amid Democratic Party concerns.",
    "link": "https://www.foxnews.com/opinion/liz-peek-biden-cancer-announcement-has-my-sympathy-my-skepticism",
    "timestamp": "2025-05-20T09:00:18Z"
  },
  {
    "title": "MORNING GLORY: A triumphant trip for Trump",
    "description": "President Donald Trump had a very successful trip to the Middle East, but only time will tell if his visit with Syria's president will pay off.",
    "link": "https://www.foxnews.com/opinion/morning-glory-triumphant-trip-trump",
    "timestamp": "2025-05-20T09:00:15Z"
  },
  {
    "title": "CBS News staffers rattled by CEO's abrupt exit as Trump lawsuit looms over network",
    "description": "Journalists at CBS News have been rattled by the resignation of their boss Wendy McMahon, fueling more speculation that parent company Paramount will settle Trump lawsuit.",
    "link": "https://www.foxnews.com/media/cbs-news-staffers-rattled-ceos-abrupt-exit-trump-lawsuit-looms-over-network",
    "timestamp": "2025-05-20T09:00:14Z"
  },
  {
    "title": "Turkey's Erdogan Has Become One of World's Most Powerful Men—And Trump Ally",
    "description": "\"I think both countries can mutually benefit in this new era,\" President Recep Tayyip Erdogan's chief adviser told Newsweek.",
    "link": "https://www.newsweek.com/turkeys-erdogan-has-become-one-worlds-most-powerful-men-trump-ally-2073930",
    "timestamp": "2025-05-20T09:00:01Z"
  },
  {
    "title": "Trump Exaggerates Speed and Certainty of Prescription Drug Price Reductions",
    "description": "According to the timeline in the May 12 executive order, prescription drug price reductions would not happen \"almost immediately,” but rather could take months or years. And extending the savings to Americans outside federal health insurance programs such as …",
    "link": "https://kffhealthnews.org/news/article/drug-price-pricing-executive-order-may-12-most-favored-nation-fact-check-timing/",
    "timestamp": "2025-05-20T09:00:00Z"
  },
  {
    "title": "Five years after George Floyd's death, calls to reform qualified immunity mostly fall silent",
    "description": "WASHINGTON — The death of George Floyd at the hands of a police officer in May 2020 gave momentum to a cross-ideological effort to reform the legal defense known as \"qualified immunity,\" which can protect cops even when they have violated the Constitution.",
    "link": "https://www.nbcnews.com/politics/supreme-court/five-years-george-floyds-death-calls-reform-qualified-immunity-mostly-rcna205338",
    "timestamp": "2025-05-20T09:00:00Z"
  },
  {
    "title": "Four reasons to be optimistic about AI’s energy usage",
    "description": "The day after his inauguration in January, President Donald Trump announced Stargate, a $500 billion initiative to build out AI infrastructure, backed by some of the biggest companies in tech. Stargate aims to accelerate the construction of massive data cente…",
    "link": "https://www.technologyreview.com/2025/05/20/1116337/ai-energy-use-optimism/",
    "timestamp": "2025-05-20T09:00:00Z"
  },
  {
    "title": "A Teacher Dragged a 6-Year-Old With Autism by His Ankle. Federal Civil Rights Officials Might Not Do Anything.",
    "description": "by Jennifer Smith Richards and Jodi S. Cohen \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.\n\n …",
    "link": "https://www.propublica.org/article/garrison-school-illinois-autistic-student-dragged-ankle",
    "timestamp": "2025-05-20T09:00:00Z"
  },
  {
    "title": "How the Trump Administration Aims To Slash Health Care Spending",
    "description": "One thing experts agree on: The damage from the funding cuts will be varied and immense.",
    "link": "https://kffhealthnews.org/news/article/health-care-spending-cuts-research-trump-administration-tariffs-public-health/",
    "timestamp": "2025-05-20T09:00:00Z"
  },
  {
    "title": "Trump’s Angry Walmart Tirade Backfires, Wrecking His Own Tariff Scam",
    "description": "President Donald Trump’s feud with Walmart is intensifying. After the retail giant warned that its prices will go up due to Trump’s tariffs, he erupted on Truth Social and even threatened Walmart to get it to “eat” the costs of his levies. Then White House pr…",
    "link": "https://newrepublic.com/article/195460/trump-angry-walmart-tirade-backfires-wrecking-tariff-scam",
    "timestamp": "2025-05-20T09:00:00Z"
  },
  {
    "title": "Joe Biden Has Nothing to Do With the 2028 Election",
    "description": "Democratic presidential aspirants should not feel obligated to self-flagellate to win back the public trust. \nThe post Joe Biden Has Nothing to Do With the 2028 Election  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/05/20/joe-biden-has-nothing-to-do-with-the-2028-election/",
    "timestamp": "2025-05-20T09:00:00Z"
  },
  {
    "title": "This News Might Ruin Your Appetite — And Summer",
    "description": "Fresh studies expose a gap in the FDA’s assessments of foods: Widely used additives could damage the mix of bacteria in your gut, causing health problems.",
    "link": "https://kffhealthnews.org/news/article/emulsifiers-foods-chemical-risks-fda-regulation-ice-cream-gut-microbiome-polysorbate-80/",
    "timestamp": "2025-05-20T09:00:00Z"
  },
  {
    "title": "Bernie Sanders and AOC are popular with Democrats. Here’s a timeline of their alliance",
    "description": "Among Democrats on Capitol Hill, Senate Minority Leader Chuck Schumer wields far more power than New York Rep. Alexandria Ocasio-Cortez and Vermont Sen. Bernie Sanders. But the progressive champions have the hearts of Democratic voters across the country. Abo…",
    "link": "https://freerepublic.com/focus/f-chat/4318035/posts",
    "timestamp": "2025-05-20T08:59:43Z"
  },
  {
    "title": "Melania Trump Makes Rare Public Appearance to Sign 'Revenge Porn' Bill",
    "description": "Melania Trump, a vocal proponent of the bill, joined President Donald Trump in signing the Take It Down Act, a new law targeting revenge porn and AI deepfakes.",
    "link": "https://www.newsweek.com/donald-melania-trump-revenge-porn-take-it-down-act-2074457",
    "timestamp": "2025-05-20T08:59:27Z"
  },
  {
    "title": "Former US Diplomat Calls For Urgent Trump-Xi Jinping Talks As Trade Truce Deadline Nears, Slams 'Horrible' Lack Of US-China Contact",
    "description": "A former senior U.S. diplomat has called for urgent direct talks between U.S. President Donald Trump and Chinese President Xi Jinping before the 90-day trade truce ends.\nWhat Happened: Michael McFaul, the former U.S. ambassador to Russia during the Obama Admi…",
    "link": "https://biztoc.com/x/9a0b425cb8604dec",
    "timestamp": "2025-05-20T08:58:37Z"
  },
  {
    "title": "Gaza Rescuers Say 44 Killed As Israel Steps Up Offensive",
    "description": "Gaza's civil defence agency said Israeli strikes killed at least 44 people on Tuesday across the war-ravaged Palestinian territory, where Israel has intensified a military offensive aimed at crushing Hamas.",
    "link": "https://www.ibtimes.com.au/gaza-rescuers-say-44-killed-israel-steps-offensive-1858981",
    "timestamp": "2025-05-20T08:57:13Z"
  },
  {
    "title": "Trump Heads To Capitol Hill To Convince GOP Holdouts To Back His 'Big, Beautiful' Bill",
    "description": "The president's visit to address House Republicans at their weekly conference meeting comes at a pivotal moment, testing his deal-making powers.",
    "link": "https://www.huffpost.com/entry/trump-heads-to-capitol-hill-gop-house-meeting_n_682c4155e4b095274fad4574",
    "timestamp": "2025-05-20T08:57:05Z"
  },
  {
    "title": "Russia is only playing for time in Ukraine peace talks, Germany says",
    "description": "BRUSSELS (Reuters) -German Defence Minister Boris Pistorius on Tuesday accused Russian President Vladimir Putin of not really being interested in peace in Ukraine, saying he was only playing for time in talks with the United States. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/20/russia-is-only-playing-for-time-in-ukraine-peace-talks-germany-says",
    "timestamp": "2025-05-20T08:56:00Z"
  },
  {
    "title": "Has Trump Buyer's Remorse Already Set In? | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA slew of polls marked the first 100 days of the second Trump presidency. All the major ones showed increasing disapproval of Donald Trump's handling of his job during his second term. In fact, the numbers are…",
    "link": "https://biztoc.com/x/f6754b8fd2863332",
    "timestamp": "2025-05-20T08:47:21Z"
  },
  {
    "title": "Has Trump Buyer's Remorse Already Set In? | Opinion",
    "description": "A slew of polls marked the first 100 days of the second Trump presidency. All the major ones showed increasing disapproval of Donald Trump's handling of his job during his second term.",
    "link": "https://www.newsweek.com/has-trump-buyers-remorse-already-set-opinion-2073216",
    "timestamp": "2025-05-20T08:44:01Z"
  },
  {
    "title": "Livestream: Big tech powers genocide gut Microsoft workers organize",
    "description": "We speak to fired tech workers, Asem Alnabih in Gaza about Israel’s starvation, cover the latest resistance operations in Gaza, Trump’s Gulf tour and much more.",
    "link": "https://electronicintifada.net/blogs/eli-gerzon/livestream-big-tech-powers-genocide-microsoft-workers-organize",
    "timestamp": "2025-05-20T08:43:36Z"
  },
  {
    "title": "Donald Trump Drops Crude Line At Kennedy Center Dinner In Bizarre Rant About 2020 Election",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_5203b992-efce-4f09-98de-1a4f6bae5b0c",
    "timestamp": "2025-05-20T08:40:15Z"
  },
  {
    "title": "Trump Drops Crude Line At Kennedy Center Dinner In Bizarre Rant About 2020 Election",
    "description": "The pro-MAGA audience lapped up the president's remark.",
    "link": "https://www.huffpost.com/entry/donald-trump-kennedy-center-board-line_n_682c32cce4b0f527e57add1b",
    "timestamp": "2025-05-20T08:40:15Z"
  },
  {
    "title": "Russia attacks Ukraine with drones as Trump lauds Putin phone call",
    "description": "Russia launched more than 100 drones into Ukraine following the conclusion of a phone call between Presidents Donald Trump and Vladimir Putin.",
    "link": "https://abcnews.go.com/International/russia-attacks-ukraine-drones-trump-lauds-putin-phone/story?id=121976770",
    "timestamp": "2025-05-20T08:37:36Z"
  },
  {
    "title": "Gaza rescuers say 44 killed as Israel steps up offensive",
    "description": "Gaza’s civil defence agency said Israeli strikes killed at least 44 people on Tuesday across the war-ravaged Palestinian territory, where Israel has intensified a military offensive aimed at crushing Hamas. Aid trickled into the Gaza Strip on Monday for the f…",
    "link": "https://www.digitaljournal.com/world/gaza-rescuers-say-44-killed-as-israel-steps-up-offensive/article",
    "timestamp": "2025-05-20T08:37:20Z"
  },
  {
    "title": "White House study raises alarm: 9 million Americans could lose health insurance in 'major' recession if...",
    "description": "White House has warned that 8.2 to 9.2 million people could lose health insurance if Trump's 'big, beautiful bill' doesn't pass. The White House projects that the expiration of the 2017 Trump tax cuts in 2026 and other shocks would trigger a \"moderate to seve…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-white-house-study-raises-alarm-9-million-americans-could-lose-health-insurance-in-major-recession-if-trump-one-big-beautiful-bill-not-passed/articleshow/121287418.cms",
    "timestamp": "2025-05-20T08:34:20Z"
  },
  {
    "title": "Stephen Colbert Loves His Audience's Reaction To Trump Moment",
    "description": "The \"Late Show\" host slammed the president's latest attack on a major American figure.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-taylor-swift_n_682c228ee4b0dc52ee2c3d15",
    "timestamp": "2025-05-20T08:31:09Z"
  },
  {
    "title": "JPMorgan Opens The Door To Bitcoin: CEO Supports Client Crypto Purchases",
    "description": "JPMorgan Chase has announced it will allow clients to purchase Bitcoin (BTC), marking a notable development in the mainstream acceptance of cryptocurrency. However, CEO Jamie Dimon, a long-time critic of Bitcoin and the broader crypto market, clarified that h…",
    "link": "https://bitcoinist.com/jpmorgan-opens-the-door-to-bitcoin-ceo-supports/",
    "timestamp": "2025-05-20T08:30:04Z"
  },
  {
    "title": "Van Orden Leaves No Back Unstabbed",
    "description": "We already knew that Rep. Drunken Van Orden was a mean drunk when he drunk raged at the teenaged senate pages. But now, DVO has shown the world that he is just a mean, backstabbing SOB. \nDVO had always claimed to be all in for the farmers who make up a large …",
    "link": "https://crooksandliars.com/2025/05/van-orden-leaves-no-back-unstabbed",
    "timestamp": "2025-05-20T08:28:47Z"
  },
  {
    "title": "Sesame Street heading to Netflix after Trump cut PBS funding",
    "description": "Netflix and Sesame Street have agreed a deal that will bring the children's show to the streaming platform's wider audience after President Trump cut federal funding for the free-to-air TV network Public Broadcasting Service (PBS).",
    "link": "https://news.sky.com/story/sesame-street-heading-to-netflix-after-trump-cut-pbs-funding-13371338",
    "timestamp": "2025-05-20T08:28:00Z"
  },
  {
    "title": "GOP Lawmakers Cower Over Trump's $400M Qatar Payoff",
    "description": "Congressional Cowards is a weekly series highlighting the worst Donald Trump defenders on Capitol Hill, who refuse to criticize him—no matter how disgraceful or lawless his actions.\n\nNot even accepting a $400 million bribe from a foreign country is enough to …",
    "link": "https://crooksandliars.com/2025/05/gop-lawmakers-cower-over-trumps-400m-qatar",
    "timestamp": "2025-05-20T08:27:18Z"
  },
  {
    "title": "US cuts another $60m in grants to Harvard University",
    "description": "Government says funding freeze is due to the university's alleged failure to address anti-Semitism on campus.",
    "link": "https://www.aljazeera.com/news/2025/5/20/us-cuts-another-60m-in-grants-to-harvard-university",
    "timestamp": "2025-05-20T08:26:07Z"
  },
  {
    "title": "Equities rebound to track Wall St up as China cuts rates",
    "description": "Most markets rose Tuesday as risk appetite returned following the previous day's US rating-fuelled losses, with sentiment also boosted after China cut...",
    "link": "https://finance.yahoo.com/news/asian-markets-rebound-track-wall-032331830.html",
    "timestamp": "2025-05-20T08:25:16Z"
  },
  {
    "title": "Donald Trump demands 'facts' on Joe Biden's cancer diagnosis in shock statement to White House",
    "description": "US president Donald Trump has demanded the 'facts' on Joe Biden's cancer diagnosis in a shock statement to the White House",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-joe-biden-cancer-white-house-859244-20250520",
    "timestamp": "2025-05-20T08:23:52Z"
  },
  {
    "title": "Iran reviewing proposal for 5th round of nuclear talks",
    "description": "DUBAI (Reuters) -Iran received and is reviewing a proposal for a fifth round of nuclear talks with the United States, Deputy Foreign Minister Kazem Gharibabadi said on Tuesday, according to state media. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/20/iran-reviewing-proposal-for-5th-round-of-nuclear-talks",
    "timestamp": "2025-05-20T08:18:00Z"
  },
  {
    "title": "Taiwan wants peace with China but needs tight defense — Lai",
    "description": "Taiwan's president, Lai Ching-te, says his country wants dialogue with China but still needs to prepare for war. Lai, who is marking a year in power, rejects Beijing's claim of sovereignty over the self-ruled island.",
    "link": "https://www.dw.com/en/taiwan-wants-peace-with-china-but-needs-tight-defense-lai/a-72603679",
    "timestamp": "2025-05-20T08:17:00Z"
  },
  {
    "title": "The one thing Trump might be getting right",
    "description": "His plan to cut the budgets of US intelligence agencies is a rare challenge to unchecked power.",
    "link": "https://www.aljazeera.com/opinions/2025/5/20/the-one-thing-trump-might-be-getting-right",
    "timestamp": "2025-05-20T08:12:46Z"
  },
  {
    "title": "Digital Services Tax Bill scrapped by Revenue Minister Simon Watts after Donald Trump threatens retaliation",
    "description": "'We needed to ask ourselves if adopting the bill was in NZ's best interests' – minister",
    "link": "https://www.nzherald.co.nz/nz/politics/digital-services-tax-bill-scrapped-by-revenue-minister-simon-watts-after-donald-trump-threatens-retaliation/FMDSRPVFMJG6PEYFK4B4G7YJ5M/",
    "timestamp": "2025-05-20T08:10:42Z"
  },
  {
    "title": "Max Boot: Putin is playing trump for a fool, and the US president still doesn’t see it",
    "description": "President Donald Trump is not known for being patient or forgiving with those who defy his will.",
    "link": "https://www.independent.ie/opinion/comment/max-boot-putin-is-playing-trump-for-a-fool-and-the-us-president-still-doesnt-see-it/a686945345.html",
    "timestamp": "2025-05-20T08:09:44Z"
  },
  {
    "title": "Max Boot: If only Donald Trump confronted Vladimir Putin the way he has done with Bono, Bruce Springsteen and others",
    "description": "President Donald Trump is not known for being patient or forgiving with those who defy his will.",
    "link": "https://www.independent.ie/opinion/comment/max-boot-if-only-donald-trump-confronted-vladimir-putin-the-way-he-has-done-with-bono-bruce-springsteen-and-others/a686945345.html",
    "timestamp": "2025-05-20T08:09:44Z"
  },
  {
    "title": "Trump U-Turn on $5 Billion NY Wind Farm Lifts an Ailing Industry",
    "description": "The Trump administration’s surprise reversal of an order to halt a $5 billion wind energy project off the coast of New York offered some respite to a beleaguered industry whose future in the US has been in doubt.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-u-turn-on-5-billion-ny-wind-farm-lifts-an-ailing-industry",
    "timestamp": "2025-05-20T08:09:02Z"
  },
  {
    "title": "An unexpected victim of Trump's tariffs: musicians",
    "description": "Thanks to Trump's tariffs, prices for guitars and other instruments are about to go up. That's bad news for beginners and experienced musicians.",
    "link": "https://www.businessinsider.com/trump-tariffs-instrument-prices-guitars-music-stores-expensive-2025-5",
    "timestamp": "2025-05-20T08:07:01Z"
  },
  {
    "title": "Qatar Defends 'Normal' Jet Gift to Trump's US",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Qatari prime minister defended his country's offer of a $400 million 747 jet as a gift to the Trump Administration, calling it a \"normal thing\" for allies.\nPresident Donald Trump wants to accept the gift t…",
    "link": "https://biztoc.com/x/801c44d3ab74a86c",
    "timestamp": "2025-05-20T08:03:34Z"
  },
  {
    "title": "Japan's super-long bond yields soar to records as market frets about demand",
    "description": "TOKYO :The longest-dated Japanese government bond yields soared to all-time highs on Tuesday, as investors' worries about demand for the debts flared following a poor auction of 20-year securities.Super-long JGB yields have been rising for weeks against a bac…",
    "link": "https://www.channelnewsasia.com/business/japans-super-long-bond-yields-soar-records-market-frets-about-demand-5141441",
    "timestamp": "2025-05-20T08:03:23Z"
  },
  {
    "title": "Qatar Defends 'Normal' Jet Gift to Trump's US",
    "description": "The Qataris have offered the Trump Administration a $400 million jet to replace Air Force One. President Trump wants to accept it.",
    "link": "https://www.newsweek.com/qatar-defends-normal-jet-gift-trumps-us-2074484",
    "timestamp": "2025-05-20T08:02:44Z"
  }
]