[
  {
    "title": "‘No One Will Know’: Red State Schools ‘Openly’ Violate Law On Male Students In Female Spaces, Complaint Alleges",
    "description": "Ohio schools are facing complaints alleging they are \"openly violating\" state and federal laws after administrators agreed to hide kids' gender identities.",
    "link": "https://dailycaller.com/2025/11/12/no-one-will-know-red-state-schools-openly-violate-law-on-male-students-in-female-spaces-complaint-alleges/",
    "timestamp": "2025-11-12T22:43:23Z"
  },
  {
    "title": "Penny comes to naught",
    "description": "The U.S. Mint on Wednesday ended production of the penny, a change made to save money and because the 1-cent coin that could once buy a snack or a piece of candy had become increasingly irrelevant.",
    "link": "https://www.bostonherald.com/2025/11/12/penny-comes-to-naught/",
    "timestamp": "2025-11-12T22:42:46Z"
  },
  {
    "title": "SNAP Recipients Crushed by Democrats Caving on Shutdown: “They Just Wasted It All”",
    "description": "People on food stamps said they were willing to sacrifice to protect health care benefits. They’re furious that the Democrats gave up.\nThe post SNAP Recipients Crushed by Democrats Caving on Shutdown: “They Just Wasted It All” appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/11/12/government-shutdown-deal-snap-medicaid/",
    "timestamp": "2025-11-12T22:41:15Z"
  },
  {
    "title": "US Mint Ceases Penny Production, Citing High Costs and Supply Surplus",
    "description": "The U.S. Treasury announced it would halt the production of the nation’s circulating one-cent coin this week, citing escalating manufacturing costs and deeming the currency unnecessary for modern commerce, USA Today reported Wednesday (Nov. 12). According to …",
    "link": "https://www.pymnts.com/commerce/2025/us-mint-ceases-penny-production-citing-high-costs-and-supply-surplus/",
    "timestamp": "2025-11-12T22:41:12Z"
  },
  {
    "title": "‘The tariffs are a big tax increase’: Top bank crunches the numbers on how much Americans are paying for Trump’s trade regime",
    "description": "\"A decent chunk of the economy is in recession,\" according to UBS economists.",
    "link": "https://fortune.com/2025/11/12/tariffs-big-tax-increase-decent-chunk-economy-in-recession-ubs/",
    "timestamp": "2025-11-12T22:39:30Z"
  },
  {
    "title": "Epstein emails: The Dems and their lapdogs with laptops cry Wolff again",
    "description": "What a low and cynical move by Democrats on the House Oversight Committee — releasing just enough of a Jeffrey Epstein email early Wednesday to inspire the most hysterical possible Trump-smearing coverage.",
    "link": "https://nypost.com/2025/11/12/opinion/epstein-emails-the-dems-and-their-lapdogs-with-laptops-cry-wolff-again/",
    "timestamp": "2025-11-12T22:39:28Z"
  },
  {
    "title": "Trump pushes to block House vote on Epstein files: Here's what happened after Lauren Boebert's meeting with Trump officials regarding Epstein Transparency",
    "description": "Colorado Rep. Lauren Boebert met with Trump administration officials at the White House regarding her support for the \"Epstein Files Transparency Act.\" This bill aims to compel the Justice Department to release unclassified documents related to Jeffrey Epstei…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-pushes-to-block-house-vote-on-epstein-files-heres-what-happened-after-lauren-boeberts-meeting-with-trump-officials-regarding-epstein-transparency/articleshow/125285285.cms",
    "timestamp": "2025-11-12T22:38:15Z"
  },
  {
    "title": "Trump administration holds Situation Room meeting over House effort to force release of all of DOJ’s Epstein files",
    "description": "Top Trump administration officials met Wednesday with a key GOP lawmaker about an effort in the US House to force a vote on releasing Justice Department case files related to Jeffrey Epstein, according to multiple sources familiar with the meeting. White Hous…",
    "link": "https://freerepublic.com/focus/f-news/4352190/posts",
    "timestamp": "2025-11-12T22:36:46Z"
  },
  {
    "title": "Trump blasts Democrat attempts to ‘deflect’ from government shutdown with ‘Epstein Hoax’",
    "description": "Democrats are demanding sex offender be given 'credibility he does not deserve'",
    "link": "https://www.wnd.com/2025/11/trump-blasts-democrat-attempts-deflect-government-shutdown-epstein/",
    "timestamp": "2025-11-12T22:36:03Z"
  },
  {
    "title": "New emails claim Trump ‘spent hours’ with Epstein victim",
    "description": "Emails released by US lawmakers say Donald Trump \"spent hours\" with a victim of the convicted sex offender Jeffrey Epstein. The White House has accused Democrats of selectively leaking the emails to push a fake narrative against the President.\n\nAlso in the pr…",
    "link": "https://www.bbc.co.uk/programmes/w172zssf8c05nk8",
    "timestamp": "2025-11-12T22:36:00Z"
  },
  {
    "title": "Mass. lawmakers react to newly released Epstein emails, Trump connection",
    "description": "In a 2011 email, Jeffrey Epstein wrote Donald Trump had spent hours at Epstein's house with a sex trafficking victim.",
    "link": "https://www.wcvb.com/article/epstein-emails-trump-questions/69414735",
    "timestamp": "2025-11-12T22:35:13Z"
  },
  {
    "title": "Did Trump say George Washington received MRI scan while discussing his own 'perfect' results?",
    "description": "U.S. President Donald Trump said, \"I got an MRI, it was perfect. They found nothing. The doctors were amazed. They said of all the MRIs done on presidents going back to George Washington, this is the first time nothing was found.”",
    "link": "https://www.snopes.com//fact-check/trump-mri-george-washington-quote/",
    "timestamp": "2025-11-12T22:35:00Z"
  },
  {
    "title": "Nicolle Wallace rips Trump and his Cabinet over economy claims: ‘Wildly out of touch’",
    "description": "Nicolle Wallace says the American people are \"furious\" over Trump's failure to address the affordability crisis in the United States.",
    "link": "https://www.msnbc.com/top-stories/latest/nicolle-wallace-rips-trump-cabinet-economy-claims-wildly-touch-rcna243553",
    "timestamp": "2025-11-12T22:34:26Z"
  },
  {
    "title": "UC Berkeley’s Top Cop In Charge Of Campus Chaos Once Oversaw Botched Jan. 6 Intel",
    "description": "Berkeley Chief of Police Yogananda Pittman previously led the U.S. Capitol Police’s protective and intelligence operations during the 2021 Capitol riot.",
    "link": "https://dailycaller.com/2025/11/12/uc-berkeleys-top-cop-in-charge-of-campus-chaos-once-oversaw-botched-jan-6-intel/",
    "timestamp": "2025-11-12T22:34:17Z"
  },
  {
    "title": "Trump's 50-Year Mortgage Plan Brings Outrage From His Own Party: 'In Debt For Life!' Says Majorie Taylor Greene",
    "description": "President Donald Trump recently proposed the idea of a 50-year mortgage to address housing affordability in the U.S. The plan, intended to reduce monthly payments for homebuyers, has drawn controversy and outrage — even from members of the President's own par…",
    "link": "https://biztoc.com/x/6318f8c1e22dfb16",
    "timestamp": "2025-11-12T22:33:56Z"
  },
  {
    "title": "House lawmakers to vote this evening on deal to end longest-ever U.S. government shutdown",
    "description": "The U.S. House of Representatives will try to end the longest government shutdown in U.S. history on Wednesday, with a vote on a stopgap funding package to restart disrupted food assistance, pay hundreds of thousands of federal workers, and revive a hobbled a…",
    "link": "https://www.cbc.ca/news/world/us-government-shutdown-vote-9.6976658",
    "timestamp": "2025-11-12T22:32:45Z"
  },
  {
    "title": "House Republicans Scramble as Epstein Files Petition Hits Magic Number — Several Announce They’re Now Voting in Favor",
    "description": "\"Trump would have to sign it into law, which he has made very clear how opposed he is to this bill. So it becoming law seems very, very unlikely at this point.\"\nThe post House Republicans Scramble as Epstein Files Petition Hits Magic Number — Several Announce…",
    "link": "https://www.mediaite.com/media/tv/house-republicans-scramble-as-epstein-files-petition-hits-magic-number-several-announce-theyre-now-voting-in-favor/",
    "timestamp": "2025-11-12T22:31:56Z"
  },
  {
    "title": "Trump vs the BBC…what happens next?",
    "description": "And the US president is mentioned in new Epstein emails",
    "link": "https://www.bbc.co.uk/sounds/play/p0mg9x04",
    "timestamp": "2025-11-12T22:30:00Z"
  },
  {
    "title": "Judge Boasberg Enabled Feds To Spy On Conservatives — Now He Must Pay The Price",
    "description": "Washington was rocked in early October with the revelation that the Biden administration, by way of Jack Smith’s investigation into the 2020 election, had ordered the FBI to seize data from the cell phones of eight Republican senators and congressmen. Over th…",
    "link": "https://freerepublic.com/focus/f-news/4352188/posts",
    "timestamp": "2025-11-12T22:26:51Z"
  },
  {
    "title": "Trump Admin To Make Big Oil Buy In Bid To Refill Reserves Biden Drained",
    "description": "The DOE announced Wednesday that it is officially moving to acquire one million barrels to begin replenishing the U.S. Strategic Petroleum Reserve (SPR).",
    "link": "https://dailycaller.com/2025/11/12/trump-admin-big-oil-buy-strategic-petroleum-reserves-biden/",
    "timestamp": "2025-11-12T22:25:09Z"
  },
  {
    "title": "Donald Trump Surprises Supporters By Defending H1-B Visas",
    "description": "\"You can’t take people off an unemployment line and say, 'I’m going to put you into a factory where we’re going to make missiles.'\"",
    "link": "https://littlethings.com/entertainment/donald-trump-talented-workers",
    "timestamp": "2025-11-12T22:25:08Z"
  },
  {
    "title": "Federal Judge Orders Over 600 ICE Detainees To Be Released From Custody",
    "description": "The order was made after finding that these individuals were arrested without a warrant or probable cause, and in violation of a consent decree.",
    "link": "https://reason.com/2025/11/12/federal-judge-orders-over-600-ice-detainees-to-be-released-from-custody/",
    "timestamp": "2025-11-12T22:22:55Z"
  },
  {
    "title": "White House Comments on Trump-Epstein Emails",
    "description": "Democrats returned to pressing Donald Trump on his ties to Jeffrey Epstein, highlighting a selection of emails in which the late financier and convicted sex trafficker suggested the president knew of his activities.\nA congressional committee on Wednesday rele…",
    "link": "https://biztoc.com/x/2a6c2ab34cc2f939",
    "timestamp": "2025-11-12T22:22:35Z"
  },
  {
    "title": "Ocasio-Cortez Notes Schumer's Role in Democratic Failure That Got 'Nothing' in Shutdown Fight",
    "description": "As the US House of Representatives prepared for a vote to reopen the federal government, Rep. Alexandria Ocasio-Cortez on Wednesday called out members of her own Democratic Party in the Senate, including Minority Leader Chuck Schumer, who capitulated to Repub…",
    "link": "https://www.commondreams.org/news/aoc-schumer",
    "timestamp": "2025-11-12T22:20:08Z"
  },
  {
    "title": "Supreme Court to hear arguments on Trump bid to fire Fed Gov. Lisa Cook on Jan. 21 (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nSupreme Court to hear arguments on Trump bid to fire Fed Gov. Lisa Cook on Jan. 21 … The Supreme Court said Wednesday that it will hear oral arguments in the case challenging President Donald Trump's authority to fire Federal Reserve Gov. L…",
    "link": "https://www.memeorandum.com/251112/p123",
    "timestamp": "2025-11-12T22:20:00Z"
  },
  {
    "title": "New Epstein bombshell could make GOP s​upport for Trump 'unsustainable': analyst",
    "description": "President Donald Trump appears to be trying to keep the GOP from breaking after Democrats leaked emails from disgraced financier Jeffrey Epstein showing new ties between him and the president, according to one analyst. Investigative political journalist Tara …",
    "link": "https://www.rawstory.com/trump-2674289969/",
    "timestamp": "2025-11-12T22:19:37Z"
  },
  {
    "title": "Charlie Kirk’s Death Is Just The Beginning",
    "description": "“This is a train that doesn’t stop running after Kirk’s death. In fact, I think that it only rolls faster.”",
    "link": "https://www.huffpost.com/entry/turning-point-usa-charlie-kirk-death_n_68ffcc53e4b0fb1b9515ee1c",
    "timestamp": "2025-11-12T22:14:57Z"
  },
  {
    "title": "What we know about new Epstein emails that mention Trump",
    "description": "In emails released by Democrats, Epstein says Trump \"knew about the girls\". The White House says they are an attempt to \"smear\" the president.",
    "link": "https://www.bbc.com/news/articles/c3rj0d97ynvo",
    "timestamp": "2025-11-12T22:14:21Z"
  },
  {
    "title": "House Democrats Press Paramount-Skydance To “Fully Comply” With Their Merger Investigation, Call Responses “Inadequate And Incomplete”",
    "description": "Two House Democrats who have been investigating the Skydance-Paramount merger are once again pressing CEO David Ellison to answer a series of questions about the transaction, including whether there was a “side deal” with Donald Trump as CBS settled the presi…",
    "link": "http://deadline.com/2025/11/trump-paramount-skydance-merger-side-deal-democrats-1236615699/",
    "timestamp": "2025-11-12T22:13:07Z"
  },
  {
    "title": "Chicago treasurer vows to not buy US bonds as protest against President Donald Trump",
    "description": "Chicago Treasurer Melissa Conyears-Ervin announced Wednesday that she will launch a boycott against investing the city’s cash in U.S treasury securities in a protest against President Donald Trump.\nThe boycott would start immediately, Conyears-Ervin told alde…",
    "link": "https://biztoc.com/x/86dd9e92eb3de8cc",
    "timestamp": "2025-11-12T22:11:23Z"
  },
  {
    "title": "Chicago treasurer vows to not buy US bonds as protest against President Donald Trump",
    "description": "Chicago Treasurer Melissa Conyears-Ervin announced Wednesday that she will launch a boycott against investing the city’s cash in U.S treasury securities in a protest against President Donald Trump.\nThe boycott would start immediately, Conyears-Ervin told alde…",
    "link": "https://biztoc.com/x/86dd9e92eb3de8cc",
    "timestamp": "2025-11-12T22:11:23Z"
  },
  {
    "title": "White House Slams Democrats Over Release Of Epstein Files Mentioning Trump: 'Tired CON JOB To Smear The President'",
    "description": "The White House slammed Democrats for releasing documents related to Jeffrey Epstein that mention President Donald Trump by name, calling it a \"tired CON JOB to smear the President.\"",
    "link": "https://www.ibtimes.com/white-house-slams-democrats-over-release-epstein-files-mentioning-trump-tired-con-job-smear-3790189",
    "timestamp": "2025-11-12T22:10:41Z"
  },
  {
    "title": "The White House Responded to the Leaked Epstein Emails About Trump But the Internet Is Skeptical",
    "description": "Further evidence linking President Donald Trump and disgraced financier and sex trafficker Jeffrey Epstein was released on Wednesday by Democrats on the House Oversight Committee.",
    "link": "https://www.ibtimes.com/white-house-responded-leaked-epstein-emails-about-trump-internet-skeptical-3790191",
    "timestamp": "2025-11-12T22:10:07Z"
  },
  {
    "title": "She’s Got Eyes on Elon Musk! Donald Trump Jr.’s Influencer Girlfriend Bettina Anderson ‘Wanted to Have Babies’ With Tesla Billionaire Before Settling for Prez's Son",
    "description": "Don Jr's girlfriend 'had her eye on moving on to Elon Musk' and 'wanted' to have children with the billionaire tycoon.",
    "link": "https://radaronline.com/p/donald-trump-jr-girlfriend-bettina-anderson-wanted-elon-musk-babies/",
    "timestamp": "2025-11-12T22:10:04Z"
  },
  {
    "title": "You Paid For It. Now He'll Pay You Back? The Hidden Cost Behind Trump's $2,000 Dividend",
    "description": "Donald Trump's promised $2,000 \"dividend\" for Americans faces major financial and legal hurdles, with experts warning that tariffs cannot cover the cost and could instead deepen national debt.",
    "link": "https://www.ibtimes.com/you-paid-it-now-hell-pay-you-back-hidden-cost-behind-trumps-2000-dividend-3790192",
    "timestamp": "2025-11-12T22:09:12Z"
  },
  {
    "title": "No surprises versus plausible deniability.",
    "description": "The sordid saga of Jevon McSkimming reminds us of the inherent tension between two largely unspoken axioms of democratic politics. These are the “no surprises” and “plausible deniability” rules. Infrequently formalised in written instructions and more commonl…",
    "link": "https://www.kiwipolitico.com/2025/11/no-surprises-versus-plausible-deniability/",
    "timestamp": "2025-11-12T22:08:39Z"
  },
  {
    "title": "'Donald Trump Knew About The Girls': Epstein's Final Warning Before Jail Death",
    "description": "Explosive emails from Jeffrey Epstein to author Michael Wolff claim Donald Trump 'knew about the girls' months before Epstein's death. Delve into the latest revelations in the Trump Epstein scandal and the conflicting testimony from Ghislaine Maxwell.",
    "link": "https://www.ibtimes.com/donald-trump-knew-about-girls-epsteins-final-warning-before-jail-death-3790194",
    "timestamp": "2025-11-12T22:08:35Z"
  },
  {
    "title": "Latest Nation to Join Abraham Accords Could Create ‘Domino Effect,’ Expert Predicts",
    "description": "Kazakhstan is joining the Abraham Accords, making it the first nation in five years to do so. The move, according to pro-Israel advocates and politicians, signals an opportunity.   With more... Read More\nThe post Latest Nation to Join Abraham Accords Could Cr…",
    "link": "https://www.dailysignal.com/2025/11/12/latest-nation-to-join-abraham-accords-could-create-domino-effect-expert-predicts/",
    "timestamp": "2025-11-12T22:05:49Z"
  },
  {
    "title": "US House report accuses China of minerals market interference",
    "description": "By Ernest Scheyder and Pratima Desai (Reuters) -China for decades has sought to manipulate global critical minerals prices, using its control as an economic ...",
    "link": "https://www.yahoo.com/news/articles/us-house-report-accuses-china-220450069.html",
    "timestamp": "2025-11-12T22:05:34Z"
  },
  {
    "title": "NFL legend Brett Favre trashes Bad Bunny pick for Super Bowl halftime show: ‘Pick someone who loves this country’",
    "description": "Athlete said he’d rather have Jason Aldean or George Strait perform",
    "link": "https://www.the-independent.com/life-style/brett-favre-bad-bunny-nfl-super-bowl-halftime-b2864136.html",
    "timestamp": "2025-11-12T22:03:30Z"
  },
  {
    "title": "12 far-right groups with extreme anti-LGBTQ+ positions that threaten civil rights",
    "description": "These groups have made it their mission to strip LGBTQ+ people of hard-fought rights the community has secured.",
    "link": "https://www.advocate.com/news/far-right-anti-lgbtq-groups",
    "timestamp": "2025-11-12T22:03:30Z"
  },
  {
    "title": "Time to show transparency, says SC on courts reserving verdicts",
    "description": "Seven High Courts faced criticism for failing to provide Supreme Court with data on reserved verdicts. The apex court had ordered this information following delays in judgment pronouncements. Justices Kant and Bagchi emphasized transparency, directing the Hig…",
    "link": "https://timesofindia.indiatimes.com/india/time-to-show-transparency-says-sc-on-courts-reserving-verdicts/articleshow/125285278.cms",
    "timestamp": "2025-11-12T22:03:13Z"
  },
  {
    "title": "Kathy Griffin Just Revealed The Cost of Her Third Face-Lift — And We Are Shocked",
    "description": "Griffin has no problem sharing her secrets.",
    "link": "https://www.huffpost.com/entry/kathy-griffin-facelift-price_n_6914f441e4b0bf453c7b3962",
    "timestamp": "2025-11-12T22:03:08Z"
  },
  {
    "title": "Trump v the BBC: a legal expert explains how the case could play out",
    "description": "Trump must meet set requirements to prove that the footage was actually defamatory.",
    "link": "https://theconversation.com/trump-v-the-bbc-a-legal-expert-explains-how-the-case-could-play-out-269551",
    "timestamp": "2025-11-12T22:01:11Z"
  },
  {
    "title": "Trump’s backing of H-1B visa program exposes cracks within MAGA movement",
    "description": "President Donald Trump faced renewed criticism from his MAGA base after defending H-1B visas for foreign workers in a Fox News interview this week.",
    "link": "https://www.foxnews.com/politics/trumps-backing-h-1b-visa-program-exposes-cracks-within-maga-movement",
    "timestamp": "2025-11-12T22:00:57Z"
  },
  {
    "title": "Kimmel's wife says daughter 'burst into tears' after dad's show suspended, son asked if Trump was responsible",
    "description": "Late-night host Jimmy Kimmel's wife, Molly McNearney, opened up about telling their children about their father's show being suspended on the \"We Can Do Hard Things\" podcast.",
    "link": "https://www.foxnews.com/media/kimmels-wife-says-daughter-burst-tears-after-dads-show-suspended-son-asked-trump-responsible",
    "timestamp": "2025-11-12T22:00:50Z"
  },
  {
    "title": "It's Official: The House Will Vote To Release The Epstein Files",
    "description": "The long-awaited showdown is sure to annoy Trump.",
    "link": "https://www.huffpost.com/entry/adelita-grijalva-discharge-petition-epstein-files_n_6914ef27e4b0bf453c7b345a",
    "timestamp": "2025-11-12T22:00:14Z"
  },
  {
    "title": "Trump Administration: Still No Economic Data Will Be Released",
    "description": "NEC Director Kevin Hassett told CNBC that has no idea when the Trump administration will be able to release any economic data, especially with the government shutdown.\nTrump's economic record and jobs reports have been terrible so he's been attacking those re…",
    "link": "https://crooksandliars.com/2025/11/trump-administratio-still-no-economic-data",
    "timestamp": "2025-11-12T22:00:01Z"
  },
  {
    "title": "Sydney Sweeney Wrecked Her Movie With A Terrible Press Tour",
    "description": "Why go full MAGA when you’re promoting a film about subjects that base doesn’t care about?",
    "link": "https://www.cracked.com/article_49117_sydney-sweeney-wrecked-her-movie-with-a-terrible-press-tour.html",
    "timestamp": "2025-11-12T22:00:00Z"
  },
  {
    "title": "MSNBC is changing its name and embracing the ethos of a startup",
    "description": "Asked what viewers should expect when television’s MSNBC makes its corporate divorce from NBC News final this weekend, network president Rebecca Kutler points to a poster on the wall of a conference room at its new offices off Times Square.\n\n\n\nIts message rea…",
    "link": "https://apnews.com/article/msnbc-ms-now-new-company-network-tv-a3813857af61282876ba847afa1c7ef9",
    "timestamp": "2025-11-12T22:00:00Z"
  },
  {
    "title": "Trump’s History With Jeffrey Epstein: Here’s The Full Timeline",
    "description": "House Democrats released a trove of new emails sent by Jeffrey Epstein discussing his relationship with Trump.",
    "link": "https://www.forbes.com/sites/saradorn/2025/11/12/trumps-history-with-jeffrey-epstein-heres-the-full-timeline/",
    "timestamp": "2025-11-12T21:59:44Z"
  },
  {
    "title": "Boosie Badazz Patient for Trump Pardon But Excited About NBA YoungBoy Collab",
    "description": "Boosie Badazz will be facing a judge later this month when he's sentenced in California for gun possession ... but he's still making the most out of his November with a birthday album release with NBA YoungBoy!!! TMZ Hip Hop caught up with Boosie…",
    "link": "https://www.tmz.com/2025/11/12/boosie-badazz-waiting-for-trump-pardon/",
    "timestamp": "2025-11-12T21:59:12Z"
  },
  {
    "title": "Banks Now Requiring Your Grandkids To Co-Sign Your 50-Year Mortgage",
    "description": "https://babylonbee.com/news/banks-now-requiring-your-grandkids-to-co-sign-your-50-year-mortgage U.S. — Banks across the United States announced today that they would now require an applicant's grandkids to co-sign on a 50-year mortgage \"just in case.\" \"You ne…",
    "link": "https://freerepublic.com/focus/f-chat/4352184/posts",
    "timestamp": "2025-11-12T21:56:45Z"
  },
  {
    "title": "Trump Responds to Epstein Emails Released by Democrats",
    "description": "Trump Responds to Epstein Emails Released by Democratscafemom.com",
    "link": "https://cafemom.com/entertainment/donald-trump-epstein-emails",
    "timestamp": "2025-11-12T21:56:16Z"
  },
  {
    "title": "Trump 'spent hours' at Epstein's house with victim of sex trafficking, email alleges (Financial Times)",
    "description": "Financial Times:\nTrump ‘spent hours’ at Epstein's house with victim of sex trafficking, email alleges  —  Democrats say new correspondence ‘raises glaring questions’ about president's ties with late paedophile  —  Jeffrey Epstein said Donald Trump “spent hour…",
    "link": "https://www.memeorandum.com/251112/p118",
    "timestamp": "2025-11-12T21:55:00Z"
  },
  {
    "title": "The penny was always worth more than one cent",
    "description": "As the last penny is minted in Philadelphia, the humble one-cent piece remains an important part of American culture and language.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/last-penny-minted-discontinued-us-mint-rcna243453",
    "timestamp": "2025-11-12T21:54:59Z"
  },
  {
    "title": "EXCLUSIVE: GOP Chairman Reveals ‘Key to Victory’ in Midterms",
    "description": "GOP candidates who run on President Donald Trump‘s successful policies will win their 2026 midterm elections, said Republican National Committee Chairman Joe Gruters in an... Read More\nThe post EXCLUSIVE: GOP Chairman Reveals ‘Key to Victory’ in Midterms appe…",
    "link": "https://www.dailysignal.com/2025/11/12/exclusive-gop-chairman-reveals-key-to-victory-in-midterms/",
    "timestamp": "2025-11-12T21:53:59Z"
  },
  {
    "title": "EU Reportedly Investigating Google Over Alleged Demotion of News Publishers",
    "description": "Two unnamed officials told The Financial Times that the European Commission, the EU’s antitrust watchdog, is preparing to launch a new investigation into Google’s parent company, Alphabet. Google is alleged to be in violation of the EU’s Digital Markets Act (…",
    "link": "https://www.pymnts.com/google/2025/eu-reportedly-investigating-google-over-alleged-demotion-of-news-publishers/",
    "timestamp": "2025-11-12T21:51:17Z"
  },
  {
    "title": "Mailbag: Does a UFC 322 win instantly make Islam Makhachev one of MMA's all-time greats?",
    "description": "What would a win at UFC 322 do for Islam Makhachev's standing about the all-time greats of MMA? Answers to that and other reader questions in this week's mailbag.",
    "link": "https://sports.yahoo.com/mma/article/mailbag-does-a-ufc-322-win-instantly-make-islam-makhachev-one-of-mmas-all-time-greats-215113145.html",
    "timestamp": "2025-11-12T21:51:13Z"
  },
  {
    "title": "'Where is my president?': Some MAGA supporters in uproar over Trump's H-1B visa comments",
    "description": "'Where is my president?': Some MAGA supporters in uproar over Trump's H-1B visa commentsgo.com",
    "link": "https://abcnews.go.com/Politics/president-maga-supporters-uproar-trumps-1b-visa-comments/story?id=127458610",
    "timestamp": "2025-11-12T21:50:32Z"
  },
  {
    "title": "Jeffrey Epstein files: House petition secures final signature to force vote on releasing docs",
    "description": "The Trump administration has been criticized for failing to release files about convicted sex offender Jeffrey Epstein, a former friend of President Trump.",
    "link": "https://www.cnbc.com/2025/11/12/jeffrey-epstein-files-house-vote-grijalva.html",
    "timestamp": "2025-11-12T21:49:45Z"
  },
  {
    "title": "US House to vote on deal to end longest government shutdown in history",
    "description": "Eight Senate Democrats on Monday broke with party leadership to pass the funding package, which would extend funding through Jan 30.",
    "link": "https://www.channelnewsasia.com/world/us-house-vote-deal-end-longest-government-shutdown-in-history-5463746",
    "timestamp": "2025-11-12T21:46:27Z"
  },
  {
    "title": "US House to vote on deal to end longest government shutdown in history",
    "description": "Eight Senate Democrats on Monday broke with party leadership to pass the funding package, which would extend funding through Jan 30.",
    "link": "https://www.channelnewsasia.com/world/us-house-vote-deal-end-longest-government-shutdown-5463746",
    "timestamp": "2025-11-12T21:46:00Z"
  },
  {
    "title": "Kennedy heir Jack Schlossberg wants to fight Trump by running for Congress",
    "description": "\"He will be addressing three crisis: a cost crisis, a corruption crisis, a constitutional crisis,\" says the source.",
    "link": "https://pagesix.com/2025/11/12/society/kennedy-heir-jack-schlossberg-wants-to-fight-trump-by-running-for-congress/",
    "timestamp": "2025-11-12T21:45:02Z"
  },
  {
    "title": "Adelita Grijalva sworn in as the House's newest member",
    "description": "After weeks of delay, Democrat Adelita Grijalva of Arizona is a member of the U.S. House.",
    "link": "https://www.koco.com/article/adelita-grijalva-sworn-in-congress/69414808",
    "timestamp": "2025-11-12T21:44:35Z"
  },
  {
    "title": "Adelita Grijalva sworn in as the House's newest member",
    "description": "After weeks of delay, Democrat Adelita Grijalva of Arizona is a member of the U.S. House.",
    "link": "https://www.ketv.com/article/adelita-grijalva-sworn-in-congress/69414808",
    "timestamp": "2025-11-12T21:44:28Z"
  },
  {
    "title": "Democrat's swearing-in tips scales for House battle to unseal Epstein documents",
    "description": "Rep. Adelita Grijalva joins Thomas Massie, three other Republicans and House Democrats in bipartisan effort to force December vote on Jeffrey Epstein documentation release.",
    "link": "https://www.foxnews.com/politics/democrats-swearing-in-tips-scales-house-battle-unseal-epstein-documents",
    "timestamp": "2025-11-12T21:44:14Z"
  },
  {
    "title": "Trump and the Epstein questions that will not go away",
    "description": "Emails from the estate of Jeffrey Epstein, released by a congressional committee, don't allege any criminal activity by the president.",
    "link": "https://news.sky.com/story/trump-and-the-epstein-questions-that-will-not-go-away-13469364",
    "timestamp": "2025-11-12T21:44:00Z"
  },
  {
    "title": "U.S. thins ranks of spare change as mint stops making pennies",
    "description": "Over a decade after Canada stopped producing the penny, the U.S. Mint on Wednesday announced it's ending production of one-cent coins to save money and because they had become increasingly irrelevant.",
    "link": "https://www.cbc.ca/news/world/us-mint-ends-penny-production-9.6976561",
    "timestamp": "2025-11-12T21:43:43Z"
  },
  {
    "title": "Michael Wolff Speaks Out After Release of His Emails With Epstein: We’re ‘Getting Close to a Smoking Gun’ on Trump",
    "description": "Michael Wolff addressed the emails between himself and Jeffrey Epstein released by the House Oversight Committee on Wednesday in a video released on Instagram.\nThe post Michael Wolff Speaks Out After Release of His Emails With Epstein: We’re ‘Getting Close to…",
    "link": "https://www.mediaite.com/media/news/michael-wolff-speaks-out-after-release-of-his-emails-with-epstein-were-getting-close-to-a-smoking-gun-on-trump/",
    "timestamp": "2025-11-12T21:41:31Z"
  },
  {
    "title": "Pat McAfee Says You ‘Hate The Troops’ If You Criticize His Interview With President Trump On Veterans Day",
    "description": "Pat McAfee is doubling down in the defense of his Donald Trump interview. On Veterans Day, Trump made a surprise appearance on the Pat McAfee show, while McAfee was in Parris Island, South Carolina. “I’m only joining you because I hear you say such nice thing…",
    "link": "https://brobible.com/sports/article/pat-mcafee-president-trump-mcafee/",
    "timestamp": "2025-11-12T21:41:18Z"
  },
  {
    "title": "Here's What Happened Today: Wednesday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/heres-what-happened-today-wednesday-83-6872478-Nov2025/",
    "timestamp": "2025-11-12T21:41:14Z"
  },
  {
    "title": "JD Vance hails Trump admin's 'bulldozer' approach to public health, discusses how Appalachia was 'left behind' (Alexandra Koch/Fox News)",
    "description": "Alexandra Koch / Fox News:\nJD Vance hails Trump admin's ‘bulldozer’ approach to public health, discusses how Appalachia was ‘left behind’  —  Vice president defends RFK Jr. against critics who call health conclusions conspiracy theories  —  Vice President JD …",
    "link": "https://www.memeorandum.com/251112/p113",
    "timestamp": "2025-11-12T21:40:00Z"
  },
  {
    "title": "Fox News Sports Huddle Newsletter: Trump makes rare NFL appearance, trans athlete challenges SCOTUS case",
    "description": "Receive your weekly recap of all the happenings around the world of sports.",
    "link": "https://www.foxnews.com/sports/fox-news-sports-huddle-newsletter-trump-rare-nfl-appearance-trans-athlete-challenges-scotus-case",
    "timestamp": "2025-11-12T21:36:07Z"
  },
  {
    "title": "“I Know How Dirty Donald Is”: GOP Releases More Damning Epstein Emails",
    "description": "Republicans have just made things even worse for Donald Trump.",
    "link": "https://newrepublic.com/post/203113/i-know-how-dirty-donald-is-jeffrey-epstein-emails-trump",
    "timestamp": "2025-11-12T21:36:00Z"
  },
  {
    "title": "Toyota to invest extra $10 billion in U.S. to make EV batteries",
    "description": "Toyota Motor Corp. said Wednesday it will make an additional investment of up to $10 billion in the United States over the next five years, as the Japanese automaker ramps up battery production for hybrid and electric vehicles. The announcement was made as To…",
    "link": "https://japantoday.com/category/business/toyota-to-invest-extra-10-billion-in-u.s.-to-make-ev-batteries",
    "timestamp": "2025-11-12T21:35:54Z"
  },
  {
    "title": "50-year mortgages? $2,000 tariff checks? What experts think of some of Trump’s unique policy ideas",
    "description": "Each idea is, for now, little more than a presidential musing on social media.",
    "link": "https://www.pbs.org/newshour/politics/50-year-mortgages-2000-tariff-checks-what-experts-think-of-some-of-trumps-unique-policy-ideas",
    "timestamp": "2025-11-12T21:32:07Z"
  },
  {
    "title": "U.S. Mint in Philadelphia presses final pennies as the 1-cent coin gets canceled",
    "description": "The U.S. Mint on Wednesday ended production of the penny, a change made to save money and because the 1-cent coin that could once buy a snack or a piece of candy had become increasingly irrelevant. The last pennies were struck at the mint in Philadelphia, whe…",
    "link": "https://japantoday.com/category/world/unlucky-penny-us-mint-in-philadelphia-to-press-final-penny-as-the-1-cent-coin-gets-canceled",
    "timestamp": "2025-11-12T21:32:02Z"
  },
  {
    "title": "Cambodia and Thailand's border conflict heats up again as Cambodian villager reported killed",
    "description": "Cambodia's prime minister said a villager was killed when shooting broke out Wednesday along the volatile border with Thailand, as the ceasefire partly brokered by U.S. President Donald Trump that ended five days of combat between the two nations appeared to …",
    "link": "https://japantoday.com/category/world/cambodia-and-thailand%27s-border-conflict-heats-up-again-as-cambodian-villager-is-reported-killed",
    "timestamp": "2025-11-12T21:31:47Z"
  },
  {
    "title": "Trump's decision that U.S. boycott G20 summit is 'their loss,' South African president says",
    "description": "U.S. President Donald Trump's decision that the United States government boycott the Group of 20 summit next weekend in South Africa is “their loss,” South Africa's leader said Wednesday. South African President Cyril Ramaphosa added that “the United States n…",
    "link": "https://japantoday.com/category/world/trump%27s-decision-that-the-us-boycott-the-g20-summit-is-%27their-loss-%27-south-african-president-says",
    "timestamp": "2025-11-12T21:31:35Z"
  },
  {
    "title": "Ukraine's foreign minister presses G7 allies for support as Russia targets energy grid before winter",
    "description": "Top diplomats from the Group of Seven industrialized democracies met with Ukraine's foreign minister Wednesday as Kyiv tries to fend off relentless Russian aerial attacks that have brought rolling blackouts across the country ahead of winter. Ukrainian Foreig…",
    "link": "https://japantoday.com/category/world/top-diplomats-will-talk-with-ukraine%27s-foreign-minister-at-the-g7-meeting-in-canada",
    "timestamp": "2025-11-12T21:31:26Z"
  },
  {
    "title": "Tlaib-backed Senate candidate in the hot seat after deleting 'defund the police' social media posts",
    "description": "A new CNN investigation revealed US Senate candidate from Michigan, Abdul El-Sayed, quietly removed about a dozen posts backing the defund the police movement from 2020-2021.",
    "link": "https://www.foxnews.com/politics/tlaib-backed-senate-candidate-hot-seat-after-deleting-defund-police-social-media-posts",
    "timestamp": "2025-11-12T21:31:19Z"
  },
  {
    "title": "More Americans unhappy with way Trump is managing the government, AP-NORC poll shows",
    "description": "Approval of the way President Donald Trump is managing the government has dropped sharply since early in his second term, according to a new AP-NORC poll, with much of the rising discontent coming from fellow Republicans. The survey from The Associated Press-…",
    "link": "https://japantoday.com/category/world/what-americans-think-about-trump%27s-management-of-the-government-according-to-a-new-ap-norc-poll",
    "timestamp": "2025-11-12T21:31:07Z"
  },
  {
    "title": "Epstein email says Trump 'knew about the girls' as White House calls its release a Democratic smear",
    "description": "Jeffrey Epstein wrote in a 2019 email to a journalist that Donald Trump “knew about the girls,&quot; according to documents made public Wednesday, but what he knew — and whether it pertained to the sex offender’s crimes — is unclear. The White House quickly a…",
    "link": "https://japantoday.com/category/world/epstein-emails-released-by-democrats-say-trump-%27knew-about-the-girls%27-and-spent-time-with-a-victim",
    "timestamp": "2025-11-12T21:30:42Z"
  },
  {
    "title": "Zcash Drops, Then Pops as Bitcoin Billionaire Arthur Hayes Warns Holders to Remove ZEC From Exchanges",
    "description": "The privacy coin slid hard on Wednesday but then regained ground. Hayes has been outspoken on a range of digital asset topics.",
    "link": "https://decrypt.co/348377/zcash-drops-pops-bitcoin-billionaire-hayes-warns-zec-exchanges",
    "timestamp": "2025-11-12T21:30:35Z"
  },
  {
    "title": "Leavitt, 28, Flees After Question About Health of Trump, 79",
    "description": "The White House press secretary remains evasive about why the president needed an MRI scan.",
    "link": "https://www.thedailybeast.com/leavitt-28-flees-after-question-about-health-of-trump-79/",
    "timestamp": "2025-11-12T21:29:46Z"
  },
  {
    "title": "Sneako reacts to Kash Patel–Alexis Wilkins ‘honeypot’ claims amid online controversy",
    "description": "Online speculation about FBI Director Kash Patel and singer Alexis Wilkins' relationship has intensified after streamer Sneako dismissed the 'honeypot' conspiracy. Wilkins is suing Elijah Schaffer for defamation over his claims. Sneako suggested the relations…",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/sneako-reacts-to-kash-patelalexis-wilkins-honeypot-claims-amid-online-controversy/articleshow/125285028.cms",
    "timestamp": "2025-11-12T21:29:25Z"
  },
  {
    "title": "Woman gets over 2 years in prison for threatening call to judge in Trump's criminal case",
    "description": "(Reuters) -A Texas woman who made violent threats in a voicemail left with the federal judge who oversaw the since-dismissed criminal election subversion case against President Donald Trump was sentenced on Wednesday to 27 months in prison. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/13/woman-gets-over-2-years-in-prison-for-threatening-call-to-judge-in-trump039s-criminal-case",
    "timestamp": "2025-11-12T21:29:00Z"
  },
  {
    "title": "Trump Asks Israeli President to Pardon Netanyahu From Corruption Charges",
    "description": "This is one of numerous times that Trump has tried to intervene in Netanyahu’s trial.",
    "link": "https://truthout.org/articles/trump-asks-israeli-president-to-pardon-netanyahu-from-corruption-charges/",
    "timestamp": "2025-11-12T21:28:43Z"
  },
  {
    "title": "Mixed interest: 50-year mortgage proposal gets cool reception",
    "description": "The White House says it is considering backing a 50-year mortgage to help alleviate the home affordability crisis in the country.",
    "link": "https://www.bostonherald.com/2025/11/12/mixed-interest-trumps-50-year-mortgage-proposal-gets-cool-reception/",
    "timestamp": "2025-11-12T21:27:33Z"
  },
  {
    "title": "Steve Bannon gets a boost in Supreme Court appeal of his contempt conviction",
    "description": "Steve Bannon on Oct. 29, 2024 in \nNYC.\nrecords by Donald Trump. (Photo by Lev Radin/Pacific Press/LightRocket via Getty Images)",
    "link": "https://biztoc.com/x/01afd4ba17703148",
    "timestamp": "2025-11-12T21:26:20Z"
  },
  {
    "title": "In Trump-dominated media world, editing video takes on new significance — as BBC uproar shows",
    "description": "In the space of a few months, one of the more straightforward journalistic tasks — editing tape for broadcast — has been behind a $16 million legal settlement, a network's change in how it offers interviews on a news show and, now, the resignation of two top …",
    "link": "https://japantoday.com/category/features/opinions/in-trump-dominated-media-world-editing-video-takes-on-new-significance-%E2%80%94-as-bbc-uproar-shows",
    "timestamp": "2025-11-12T21:26:04Z"
  },
  {
    "title": "Adelita Grijalva is finally sworn in as Trump scrambles to derail Epstein files measure",
    "description": "As Adelita Grijalva is sworn in, Donald Trump is scrambling to kill the Epstein files discharge petition the Arizona Democrat is poised to sign.",
    "link": "https://biztoc.com/x/0fe7b58b964ef7e8",
    "timestamp": "2025-11-12T21:25:57Z"
  }
]