[
  {
    "title": "Trump: I won't be extorted by Democrats",
    "description": "United States President Donald Trump told CBS’s \"60 Minutes\" that he would not be \"extorted by the Democrats who have lost their way,\" when asked about his efforts to reach an agreement that would end...",
    "link": "https://biztoc.com/x/bae7229b14bdb7d8",
    "timestamp": "2025-11-03T01:12:30Z"
  },
  {
    "title": "Trump the Great? President steps up power moves",
    "description": "Driving in a golf buggy with Donald Trump recently, his 18-year-old granddaughter Kai asked him if there was a dream he was still trying to chase.Trump...",
    "link": "https://www.yahoo.com/news/articles/trump-great-president-steps-power-011229359.html",
    "timestamp": "2025-11-03T01:12:29Z"
  },
  {
    "title": "US not planning nuclear explosions at this time, energy secretary says",
    "description": "America is restarting nuclear weapons testing. Energy Secretary Chris Wright clarified these are system tests, not actual nuclear explosions. The focus is on ensuring new weapon designs function correctly. This move follows President Donald Trump's directive.…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-not-planning-nuclear-explosions-at-this-time-energy-secretary-says/articleshow/125044456.cms",
    "timestamp": "2025-11-03T01:12:23Z"
  },
  {
    "title": "‘Where is That Plan?!’ Trump Grilled On Lack of a Healthcare Proposal in Tense Skirmish to Open ’60 Minutes’ Showdown",
    "description": "60 Minutes correspondent Norah O'Donnell pressed President Trump on what his \"plan\" was to replace Obamacare and end the government shutdown in a fiery opening\nThe post ‘Where is That Plan?!’ Trump Grilled On Lack of a Healthcare Proposal in Tense Skirmish to…",
    "link": "https://www.mediaite.com/media/where-is-that-plan-trump-grilled-on-lack-of-a-healthcare-proposal-in-tense-skirmish-to-open-60-minutes-showdown/",
    "timestamp": "2025-11-03T01:11:20Z"
  },
  {
    "title": "Trump says Nvidia's Blackwell AI chip not for 'other people'",
    "description": "By Alexandra Alper (Reuters) -Nvidia's advanced Blackwell chip for artificial intelligence would not be available to \"other people,\" U.S. President Donald...",
    "link": "https://finance.yahoo.com/news/trump-says-nvidias-blackwell-ai-011021463.html",
    "timestamp": "2025-11-03T01:10:21Z"
  },
  {
    "title": "‘Is This Retribution?’ Norah O’Donnell Confronts Trump On Whether He’s Using the DOJ to Punish His Foes",
    "description": "President Donald Trump denied he was using the Department of Justice to punish his enemies on Sunday's 60 Minutes when confronted by Norah O'Donnell.\nThe post ‘Is This Retribution?’ Norah O’Donnell Confronts Trump On Whether He’s Using the DOJ to Punish His F…",
    "link": "https://www.mediaite.com/media/news/is-this-retribution-norah-odonnell-confronts-trump-on-whether-hes-using-the-doj-to-punish-his-foes/",
    "timestamp": "2025-11-03T01:06:54Z"
  },
  {
    "title": "Kiev has received more Patriot missile systems – Zelensky",
    "description": "Vladimir Zelensky has said that Germany delivered additional US-made Patriot missile systems to Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627273-ukraine-receives-new-patriot-systems/",
    "timestamp": "2025-11-03T01:05:46Z"
  },
  {
    "title": "$1 billion in the shadows: How “ghost students” are haunting California’s colleges",
    "description": "California's community colleges are grappling with a significant fraud crisis involving \"ghost students\" who occupy seats and claim financial aid. Despite official claims of minor losses, faculty observations and national estimates suggest a much larger probl…",
    "link": "https://timesofindia.indiatimes.com/education/news/1-billion-in-the-shadows-how-ghost-students-are-haunting-californias-colleges/articleshow/125044311.cms",
    "timestamp": "2025-11-03T01:02:17Z"
  },
  {
    "title": "Senator Ted Cruz Weighs in on “Arctic Frost” Investigation – Says It’s “Joe Biden’s Watergate” (VIDEO)",
    "description": "Senator Ted Cruz was on “Sunday Morning Futures” with host Maria Bartiromo to discuss the “Arctic Frost” investigation.\nThe post Senator Ted Cruz Weighs in on “Arctic Frost” Investigation – Says It’s “Joe Biden’s Watergate” (VIDEO) appeared first on The Gatew…",
    "link": "https://www.thegatewaypundit.com/2025/11/senator-ted-cruz-weighs-arctic-frost-investigation-says/",
    "timestamp": "2025-11-03T01:00:52Z"
  },
  {
    "title": "Gov. Newsom Brutally Shreds Trump For Being ‘Underwater’ In ‘Every Core Category’",
    "description": "The California governor said \"people are starting to realize\" Trump hasn't followed through on his promises.",
    "link": "https://www.huffpost.com/entry/governor-newsom-americans-poorer-sicker-trump_n_69078671e4b05a8637e7e2fc",
    "timestamp": "2025-11-03T00:57:07Z"
  },
  {
    "title": "Shutdown threatens to delay home heating aid for millions of low-income families",
    "description": "With temperatures beginning to drop in areas across the U.S., some states are warning that funding for the Low-Income Home Energy Assistance Program is being delayed because of the federal government shutdown, now in its fifth week.",
    "link": "https://www.pbs.org/newshour/nation/shutdown-threatens-to-delay-home-heating-aid-for-millions-of-low-income-families",
    "timestamp": "2025-11-03T00:54:07Z"
  },
  {
    "title": "As global consensus against nuclear testing frays, India should re-evaluate its options",
    "description": "India’s restraint after tests in 1998 demonstrated maturity. Its willingness to re-examine that restraint today, in light of Trump's announcement that the US will resume testing, would demonstrate confidence.",
    "link": "https://indianexpress.com/article/opinion/columns/as-global-consensus-against-nuclear-testing-frays-india-should-re-evaluate-its-options-10342216/",
    "timestamp": "2025-11-03T00:52:17Z"
  },
  {
    "title": "Bitcoin Fails to Rally on US-China Truce; What’s Next for Price?",
    "description": "Bitcoin lags despite US-China truce. Powell’s hint of a December rate pause fuels uncertainty. Focus shifts to jobs data and Fed speakers.",
    "link": "https://beincrypto.com/bitcoin-fails-to-rally-on-us-china-truce-whats-next-for-price/",
    "timestamp": "2025-11-03T00:50:50Z"
  },
  {
    "title": "Is mega-phony Gavin Newsom the best the Democrats can do?",
    "description": "In an interview with “CBS News Sunday Morning,” Newsom said he'd be \"lying\" if he claimed that he's not considering a bid for the White House in 2028, while coyly avoiding making any explicit commitment.",
    "link": "https://nypost.com/2025/11/02/opinion/is-mega-phony-gavin-newsom-the-best-the-democrats-can-do/",
    "timestamp": "2025-11-03T00:46:24Z"
  },
  {
    "title": "World awaits landmark US Supreme Court decision on Trump's tariffs",
    "description": "The top US court will decide if many of Trump's tariffs are legal in a case with major implications for presidential power and billions of dollars.",
    "link": "https://www.bbc.com/news/articles/cn4jyk9jyv3o",
    "timestamp": "2025-11-03T00:45:40Z"
  },
  {
    "title": "Trump says he will not attend Supreme Court's oral arguments on tariffs",
    "description": "By Jasper Ward and Andrea Shalal WASHINGTON (Reuters) -U.S.",
    "link": "https://www.yahoo.com/news/articles/trump-says-not-attend-supreme-004437785.html",
    "timestamp": "2025-11-03T00:44:37Z"
  },
  {
    "title": "South Korea factory output contracts in Oct, PMI shows",
    "description": "SEOUL () -South Korea's factory activity contracted in October after briefly expanding a month earlier as businesses remained cautious amid a global outlook ...",
    "link": "https://finance.yahoo.com/news/south-korea-factory-output-contracts-004026139.html",
    "timestamp": "2025-11-03T00:40:26Z"
  },
  {
    "title": "Trump says immigration raid efforts ‘haven’t gone far enough’",
    "description": "President Donald Trump said that immigration raids “haven’t gone far enough” despite videos showing physical confrontations among federal agents, immigrants and protesters.\n“I think they haven’t gone far enough because we’ve been held back by the judges, by t…",
    "link": "https://biztoc.com/x/4d42be41d35b106b",
    "timestamp": "2025-11-03T00:39:05Z"
  },
  {
    "title": "Gabbard proclaims the era of ‘regime change’ is over amid rising Venezuela tensions",
    "description": "U.S. Director of National Intelligence Tulsi Gabbard informed reporters that the era of “regime change or nation building” has ended under the leadership of President Donald Trump. As tensions rise between the United States and Venezuela due to Venezuelan lea…",
    "link": "https://freerepublic.com/focus/f-news/4350325/posts",
    "timestamp": "2025-11-03T00:37:20Z"
  },
  {
    "title": "South Korea factory output contracts in Oct, PMI shows",
    "description": "SEOUL :South Korea's factory activity contracted in October after briefly expanding a month earlier as businesses remained cautious amid a global outlook clouded by Washington's tariff policies.The Purchasing Managers Index (PMI) for manufacturers in Asia's f…",
    "link": "https://www.channelnewsasia.com/business/south-korea-factory-output-contracts-in-oct-pmi-shows-5441256",
    "timestamp": "2025-11-03T00:36:09Z"
  },
  {
    "title": "Trump on nuclear testing, the government shutdown, immigration and tariffs",
    "description": "Watch as President Trump discusses testing nuclear weapons, U.S.-China relations, Israel, the government shutdown, immigration, tariffs, and whether he'll try to stay in the White House beyond 2028.",
    "link": "https://www.cbsnews.com/news/trump-on-nuclear-testing-government-shutdown-immigration-tariffs-china-60-minutes-transcript/",
    "timestamp": "2025-11-03T00:34:39Z"
  },
  {
    "title": "President Donald Trump: The 2025 60 Minutes Interview",
    "description": "Watch as President Trump discusses testing nuclear weapons, U.S.-China relations, Israel, the government shutdown, immigration, tariffs, and whether he'll try to stay in the White House beyond 2028.",
    "link": "https://www.cbsnews.com/video/president-donald-trump-the-2025-60-minutes-interview/",
    "timestamp": "2025-11-03T00:33:00Z"
  },
  {
    "title": "Read the full transcript of 60 Minutes' interview with President Trump",
    "description": "Read the full transcript of Norah O'Donnell's interview with President Trump here.",
    "link": "https://www.cbsnews.com/news/read-full-transcript-norah-odonnell-60-minutes-interview-with-president-trump/",
    "timestamp": "2025-11-03T00:32:49Z"
  },
  {
    "title": "WATCH: Gavin Newsom’s Desperate Attempts To Avoid The Biden Question",
    "description": "Governor Gavin Newsom (D-CA) appeared desperate to evade any and all questions about his support for former President Joe Biden — support that continued even after it became painfully obvious that Biden was declining rapidly.Newsom repeatedly dodged questions…",
    "link": "https://freerepublic.com/focus/f-news/4350324/posts",
    "timestamp": "2025-11-03T00:32:41Z"
  },
  {
    "title": "Stock futures climb as investors await Supreme Court showdown on Trump tariffs and shareholder vote on Musk’s $1 trillion pay package",
    "description": "Markets signaled another positive session as futures rose Sunday night ahead of a big week for President Donald Trump’s tariffs and Tesla CEO Elon Musk’s blockbuster compensation plan.\nFutures tied to the Dow Jones industrial average rose 107 points, or 0.22%…",
    "link": "https://biztoc.com/x/311dbf9a24d30239",
    "timestamp": "2025-11-03T00:28:15Z"
  },
  {
    "title": "CIA launches EU charm offensive – Politico",
    "description": "CIA chief John Ratcliffe has traveled to the EU in an effort to repair strained relations Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627272-cia-eu-charm-offensive/",
    "timestamp": "2025-11-03T00:27:29Z"
  },
  {
    "title": "Matthew Lillard Says ‘F— Ice’ During ‘Scream’ Fan Screening: ‘We Need to Lead With Love’",
    "description": "Matthew Lillard surprised fans during Cinespia’s “Scream” Halloween party screening on Friday night, and while talking to the crowd, he shared an emboldened message to Immigration and Customs Enforcement. “Fuck ICE,” Lillard said. “In this time, in this city,…",
    "link": "https://variety.com/2025/film/news/matthew-lillard-scream-ice-trump-1236568111/",
    "timestamp": "2025-11-03T00:27:12Z"
  },
  {
    "title": "Trump says immigration raid efforts ‘haven’t gone far enough’",
    "description": "Trump said the tactics used by immigration agents were acceptable “because you have to get the people out.”",
    "link": "https://fortune.com/2025/11/02/trump-immigration-crackdown-ice-raid-tactics-deportation/",
    "timestamp": "2025-11-03T00:27:01Z"
  },
  {
    "title": "Russian Oil Finds Fewer Takers in China After Hit From Sanctions",
    "description": "Chinese oil refiners are shunning Russian shipments after the US and others blacklisted Moscow’s top producers and some of its customers.",
    "link": "https://financialpost.com/pmn/business-pmn/russian-oil-finds-fewer-takers-in-china-after-hit-from-sanctions",
    "timestamp": "2025-11-03T00:26:48Z"
  },
  {
    "title": "'Not what we're talking about': Trump ally undercuts key claim about drug strikes",
    "description": "One of President Donald Trump's allies in Congress on Sunday undercut a key claim the president has made about the administration's strikes against drug boats in international waters, according to a new report. Over the last several weeks, the Trump administr…",
    "link": "https://www.rawstory.com/dan-crenshaw-2674258031/",
    "timestamp": "2025-11-03T00:24:50Z"
  },
  {
    "title": "Trump nuke tests won’t be explosions",
    "description": "New tests of the U.S. nuclear weapons system ordered up by President Donald Trump will not include nuclear explosions, Energy Secretary Chris Wright said Sunday.",
    "link": "https://www.bostonherald.com/2025/11/02/trump-nuke-tests-wont-be-explosions/",
    "timestamp": "2025-11-03T00:24:24Z"
  },
  {
    "title": "Coalition’s primary vote plunges to record low and One Nation surges to record high in Newspoll",
    "description": "The Coalition’s primary vote fell to 24%, just nine points higher than One Nation. One Nation could be on track to overtake the Coalition as the main right-wing party.",
    "link": "https://theconversation.com/coalitions-primary-vote-plunges-to-record-low-and-one-nation-surges-to-record-high-in-newspoll-268563",
    "timestamp": "2025-11-03T00:22:17Z"
  },
  {
    "title": "\"I Am Declining Fast\": Cancer-Striken Scott Adams Urges Trump To Help Secure Treatment After Kaiser 'Dropped the Ball'",
    "description": "\"I Am Declining Fast\": Cancer-Striken Scott Adams Urges Trump To Help Secure Treatment After Kaiser 'Dropped the Ball'\n \nScott Adams, the 67-year-old Dilbert creator, will publicly ask President Donald Trump on Monday to intervene and save his life. In a post…",
    "link": "https://biztoc.com/x/b7a5e3b0ceb4f7a2",
    "timestamp": "2025-11-03T00:17:17Z"
  },
  {
    "title": "Indian carmakers on alert after Dutch takeover of China-owned Nexperia triggers global chip crunch",
    "description": "The Dutch government’s move to take control of chipmaker Nexperia has provoked Chinese retaliation, constricting supplies of critical chips used in millions of vehicles across the world, including those made by Indian carmakers.",
    "link": "https://www.livemint.com/industry/manufacturing/indian-carmakers-on-alert-after-dutch-government-takeover-of-china-owned-nexperia-triggers-global-chip-crunch-11762066867299.html",
    "timestamp": "2025-11-03T00:15:06Z"
  },
  {
    "title": "Stock futures climb as investors await Supreme Court showdown on Trump tariffs and shareholder vote on Musk’s $1 trillion pay package",
    "description": "On Thursday, Tesla shareholders will gather for the company's annual meeting and will vote on Musk's $1 trillion compensation package.",
    "link": "https://fortune.com/2025/11/02/stock-market-today-dow-futures-trump-tariffs-supreme-court-elon-musk-pay-package-tesla-shareholder-vote/",
    "timestamp": "2025-11-03T00:14:11Z"
  },
  {
    "title": "Can Prince William drag attention away from Andrew during Brazil visit?",
    "description": "Prince William has spoken of the need for people to \"work together with optimism and courage\" on the environment as he heads for Brazil, hoping to leave behind the problems of his uncle, Andrew Mountbatten Windsor.",
    "link": "https://news.sky.com/story/prince-william-to-attend-earthshot-prize-and-cop30-in-brazil-with-his-team-hoping-to-refocus-attention-away-from-andrew-13463000",
    "timestamp": "2025-11-03T00:01:00Z"
  },
  {
    "title": "Beyond the ‘Unbreakable Bond’: Is the US Reclaiming the Wheel from a Self-Destructive Israel?",
    "description": "Has Donald Trump’s sharp rebuke of Israel in his October 23 Time Magazine interview fundamentally changed the calculus in the Middle East? His comments immediately sparked two opposing views: for some, his position represents the clear demarcation of a genuin…",
    "link": "https://original.antiwar.com/ramzy-baroud/2025/11/02/beyond-the-unbreakable-bond-is-the-us-reclaiming-the-wheel-from-a-self-destructive-israel/",
    "timestamp": "2025-11-03T00:00:37Z"
  },
  {
    "title": "Trump’s Yokosuka Spectacle: The Pageantry of Power and Japan’s Hidden PFAS Crisis",
    "description": "When President Donald Trump strode onto the flight deck of the USS George Washington at Yokosuka, Japan, it looked like a campaign scene, perhaps choreographed for his unconstitutional 3rd term bid. The imperial president, flanked by sailors and television ca…",
    "link": "https://original.antiwar.com/pat_elder/2025/11/02/trumps-yokosuka-spectacle-the-pageantry-of-power-and-japans-hidden-pfas-crisis/",
    "timestamp": "2025-11-03T00:00:11Z"
  },
  {
    "title": "Energy Transition Stalls 10 Years After Paris Agreement",
    "description": "Ten years after the landmark Paris Agreement to pursue net-zero emissions by 2050, the world faces a slowing transition to clean energy despite record-breaking renewable capacity installations.    Much has changed in the energy systems in the decade since the…",
    "link": "https://oilprice.com/Energy/Energy-General/Energy-Transition-Stalls-10-Years-After-Paris-Agreement.html",
    "timestamp": "2025-11-03T00:00:00Z"
  },
  {
    "title": "How to fight climate change without the US: a guide to global action",
    "description": "With the US government absent from the COP30 global climate summit, it will be up to others to avert catastrophe.",
    "link": "https://www.nature.com/articles/d41586-025-03571-x",
    "timestamp": "2025-11-03T00:00:00Z"
  },
  {
    "title": "Trump-Xi Truce Offers A Pause, Not Peace, In US-China Rivalry",
    "description": "US President Donald Trump has returned from his trip to East Asia, where, among other leaders, he met President Xi Jinping of China.",
    "link": "https://www.hoover.org/research/trump-xi-truce-offers-pause-not-peace-us-china-rivalry",
    "timestamp": "2025-11-03T00:00:00Z"
  },
  {
    "title": "Dismantling of US federal agencies will ‘destroy science’",
    "description": "From NASA to the National Institutes of Health, federal agencies conduct research that universities cannot. Agency scientists speak out about the irreplaceable facilities, institutional knowledge and training opportunities that the country is losing.",
    "link": "https://www.nature.com/articles/d41586-025-03575-7",
    "timestamp": "2025-11-03T00:00:00Z"
  },
  {
    "title": "US signs critical minerals cooperation MOUs with Thailand and Malaysia amid domestic concerns",
    "description": "The ASEAN summit concluded on October 28 with US President Donald Trump signing memorandums of understanding (MOUs) on critical minerals cooperation with Thailand and Malaysia. The agreements have raised concerns domestically in both countries, prompting offi…",
    "link": "https://www.digitimes.com/news/a20251031PD210/asean-donald-trump-investment-exports.html",
    "timestamp": "2025-11-02T23:59:04Z"
  },
  {
    "title": "From protest to persuasion: how Silicon Valley learned to talk to Trump",
    "description": "After hosting GTC DC to discuss quantum computing, 6G, and autonomous driving, Nvidia CEO Jensen Huang flew to South Korea to attend the APEC CEO Summit and meet with leading Korean tech companies. However, Huang has unexpectedly found himself in the politica…",
    "link": "https://www.digitimes.com/news/a20251031PD218/gtc-quantum-computing-silicon-valley-6g-ceo.html",
    "timestamp": "2025-11-02T23:58:44Z"
  },
  {
    "title": "Barack “The Closer” Obama Rips & Mocks Trump & Billionaire Pals On Campaign Trail: “It’s All Tricks & No Treats” - Dea",
    "description": "Barack “The Closer” Obama Rips & Mocks Trump & Billionaire Pals On Campaign Trail: “It’s All Tricks & No Treats”Deadline Democrats are searching for their next leader. But they still have Obama.Politico Barack Obama, Kamala Harris campaign for Democrats, as D…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179944366",
    "timestamp": "2025-11-02T23:53:06Z"
  },
  {
    "title": "Trump to reporters: Hamas returned the body of Omer Neutra, I spoke to his parents",
    "description": "US President Donald Trump told reporters aboard his plane that Hamas has returned the body of hostage Omer Neutra, who was an American citizen, along with the bodies of two other deceased hostages.Trump noted that he had spoken with Neutra’s parents.Read more",
    "link": "https://www.israelnationalnews.com/flashes/669691",
    "timestamp": "2025-11-02T23:53:00Z"
  },
  {
    "title": "Trump Fumes at Reporter Over ‘Very Secret Plans’ For Venezuela Attack: ‘Who Would Say That?!’",
    "description": "President Donald Trump berated a reporter aboard Air Force One Sunday evening who asked when he was planning to launch air strikes on Venezuelan land.\nThe post Trump Fumes at Reporter Over ‘Very Secret Plans’ For Venezuela Attack: ‘Who Would Say That?!’ first…",
    "link": "https://www.mediaite.com/media/news/trump-fumes-at-reporter-over-very-secret-plans-for-venezuela-attack-who-would-say-that/",
    "timestamp": "2025-11-02T23:50:51Z"
  },
  {
    "title": "A toy maker takes his case against Trump’s tariffs to the Supreme Court",
    "description": "The U.S. president’s tariffs have hit small- and medium-sized businesses particularly hard.",
    "link": "https://www.japantimes.co.jp/business/2025/11/03/markets/toy-maker-trump-tariffs-supreme-court/",
    "timestamp": "2025-11-02T23:48:00Z"
  },
  {
    "title": "Trump says won't attend Supreme Court tariff arguments",
    "description": "United States President Donald Trump said he won't be attending the Supreme Court's arguments about his tariffs, noting that it's \"not about\" him.More to come......",
    "link": "https://biztoc.com/x/936f9300878dda5c",
    "timestamp": "2025-11-02T23:44:00Z"
  },
  {
    "title": "Barack Obama Mocks Donald Trump For Expensive White House Renovations",
    "description": "Former President Barack Obama went right at President Donald Trump over his expensive renovations to the White House while some Medicare patients struggle to find treatment amid the government shutdown. Speaking to a crowd in Virginia over the…",
    "link": "https://www.tmz.com/2025/11/02/obama-mocks-trump-expensive-white-house-renovations/",
    "timestamp": "2025-11-02T23:36:29Z"
  },
  {
    "title": "How the Democrats Can Play Offense",
    "description": "The November/December issue is here.\nThe post How the Democrats Can Play Offense appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/02/editors-note-november-december-issue-how-the-democrats-can-go-on-offense/",
    "timestamp": "2025-11-02T23:33:27Z"
  },
  {
    "title": "Trump says 'could be' US boots on ground in Nigeria",
    "description": "United States President Donald Trump said there \"could be\" US troops on the ground or air strikes in Nigeria, citing the \"record numbers\" of Christian killings there.More to come......",
    "link": "https://biztoc.com/x/d20a067ffd5528f2",
    "timestamp": "2025-11-02T23:33:12Z"
  },
  {
    "title": "Trump: Not considering giving Ukraine Tomahawk missiles",
    "description": "When asked whether his administration is considering providing Ukraine with long-range Tomahawk missiles, United States President Donald Trump said, \"No, not really.\"\"That could change, but at this mo...",
    "link": "https://biztoc.com/x/4656555a9256f305",
    "timestamp": "2025-11-02T23:33:07Z"
  },
  {
    "title": "Dave Ramsey Says We Keep Electing The 'Same Morons' To Congress. If They Worked For You, You'd 'Fire Their Butt' For Incompetence",
    "description": "Personal finance expert Dave Ramsey delivered a sharp critique during a 2022 episode of “The Ramsey Show,” where he slammed Congress for what he called...",
    "link": "https://finance.yahoo.com/news/dave-ramsey-says-keep-electing-233150397.html",
    "timestamp": "2025-11-02T23:31:50Z"
  },
  {
    "title": "Draining the Online Swamp",
    "description": "Instead of accepting the existing digital political battlefield as inevitable, Democrats should challenge it as a root cause of our dysfunctional politics, and vow to be the party that cleans it up.\nThe post Draining the Online Swamp appeared first on Washing…",
    "link": "http://washingtonmonthly.com/2025/11/02/social-media-reform-democrats/",
    "timestamp": "2025-11-02T23:31:09Z"
  },
  {
    "title": "Trump Defends ICE Raids in CBS Interview, Says ‘They Haven’t Gone Far Enough’",
    "description": "“We have to start off with a policy, and the policy has to be that ‘you came into the country illegally, you’re going to go out.\"\nThe post Trump Defends ICE Raids in CBS Interview, Says ‘They Haven’t Gone Far Enough’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/trump-defends-ice-raids-in-cbs-interview-says-they-havent-gone-far-enough/",
    "timestamp": "2025-11-02T23:30:55Z"
  },
  {
    "title": "How Democrats Can Save Social Security—and Win Elections",
    "description": "The trust fund can be rescued from insolvency without unpopular taxes on workers, and with significant benefit to economic productivity and the security of the middle class.\nThe post How Democrats Can Save Social Security—and Win Elections appeared first on W…",
    "link": "http://washingtonmonthly.com/2025/11/02/how-democrats-can-save-social-security-and-win-elections/",
    "timestamp": "2025-11-02T23:29:30Z"
  },
  {
    "title": "Rural Revival",
    "description": "With the onset of the Great Depression, the United States appeared on the verge of political revolt in rural areas. For half a century, rural people had felt increasingly marginalized by changes in American society and the economy and ignored by political lea…",
    "link": "http://washingtonmonthly.com/2025/11/02/rural-divide-democrats-fdr-trump/",
    "timestamp": "2025-11-02T23:27:50Z"
  },
  {
    "title": "Gov. JB Pritzker tells President Donald Trump to 'f--- all the way off' in viral video",
    "description": "Gov. JB Pritzker told President Donald Trump and his Republican allies to “f--- right off” during a speech last month before Illinois’ largest teachers union. Video of Pritzker’s F-bomb started gaining traction on social media Sunday, two weeks after the Demo…",
    "link": "https://freerepublic.com/focus/f-news/4350312/posts",
    "timestamp": "2025-11-02T23:27:03Z"
  },
  {
    "title": "Trump’s Industrial Policy: What’s Right and Wrong",
    "description": "The president uses government leverage to extract equity stakes, profit-sharing deals, and special voting rights from major corporations. These are familiar tools—but Trump’s unchecked dealmaking could be disastrous.\nThe post Trump’s Industrial Policy: What’s…",
    "link": "http://washingtonmonthly.com/2025/11/02/trumps-industrial-policies-whats-right-and-wrong/",
    "timestamp": "2025-11-02T23:25:19Z"
  },
  {
    "title": "Analysis: How much could the federal government shutdown cost the economy?",
    "description": "In past shutdowns, estimates of lost economic activity have reached into the billions of dollars. In the context of a $30 trillion economy, that’s not a lot. But on the margins, economists say it can have an effect.",
    "link": "https://www.pbs.org/newshour/politics/analysis-how-much-could-the-federal-government-shutdown-cost-the-economy",
    "timestamp": "2025-11-02T23:24:44Z"
  },
  {
    "title": "How to Crush the American Battery Boom",
    "description": "Biden policies put the U.S. in a strong position, but Trump is destroying the American battery industry and good American jobs.\nThe post How to Crush the American Battery Boom appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/02/how-to-crush-the-american-battery-boom/",
    "timestamp": "2025-11-02T23:23:49Z"
  },
  {
    "title": "Trump says US immigration raids 'haven't gone far enough'",
    "description": "Since returning to the White House in January, Trump has pushed for a massive wave of deportations, a hallmark of his 2024 presidential campaign.",
    "link": "https://www.channelnewsasia.com/world/us-president-donald-trump-us-immigration-raids-ice-havent-gone-far-enough-5441176",
    "timestamp": "2025-11-02T23:23:00Z"
  },
  {
    "title": "Trump Promised a Shipbuilding Boom. He’s Sinking It Instead",
    "description": "After pledging to restore America’s maritime might, the president has gutted the very offices, funding streams, and foreign partnerships that could have made it possible.\nThe post Trump Promised a Shipbuilding Boom. He’s Sinking It Instead appeared first on W…",
    "link": "http://washingtonmonthly.com/2025/11/02/trump-promised-a-shipbuilding-boom-hes-sinking-it-instead/",
    "timestamp": "2025-11-02T23:21:56Z"
  },
  {
    "title": "Trump Scoffs at Zohran Mamdani Comparison: ‘I’m a Much Better Looking Person’",
    "description": "President Donald Trump scoffed at a comparison between himself and NYC mayoral frontrunner Zohran Mamdani, saying one difference is he is \"much better looking\"\nThe post Trump Scoffs at Zohran Mamdani Comparison: ‘I’m a Much Better Looking Person’ first appear…",
    "link": "https://www.mediaite.com/media/trump-scoffs-at-zohran-mamdani-comparison-im-a-much-better-looking-person/",
    "timestamp": "2025-11-02T23:18:08Z"
  },
  {
    "title": "'We're Not A Violent City': Chicago's Locals Take On ICE Block-By-Block",
    "description": "The city's patchwork of close-knit neighborhoods has created a type of zone defense meant to slow immigration agents and even force them to withdraw.",
    "link": "https://www.huffpost.com/entry/chicago-locals-take-on-ice-block_n_6907de1ae4b00afef15f36bb",
    "timestamp": "2025-11-02T23:16:41Z"
  },
  {
    "title": "Pure Evil: Sister of Slain Firefighter Corey Comperatore Receives Vile Letter Mocking His Death — Signed and Sent Proudly by “Another Deranged Democrat”",
    "description": "A hateful handwritten letter sent to Kelly Comperatore Meeder, the sister of fallen firefighter Corey Comperatore Kelly Comperatore Meeder, the sister of fallen firefighter Corey Comperatore, who was tragically killed during the assassination attempt on Presi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4350310/posts",
    "timestamp": "2025-11-02T23:15:13Z"
  },
  {
    "title": "Ex-ISIS Envoy Who Killed Americans In Iraq To Be Hosted At White House This Month",
    "description": "Ex-ISIS Envoy Who Killed Americans In Iraq To Be Hosted At White House This Month\n \nPresident Donald Trump is set to host Syria's self-appointed interim leader later this month for talks in Washington, marking the first ever visit by a Syrian head of state to…",
    "link": "https://biztoc.com/x/d7f21bfc9de72d0e",
    "timestamp": "2025-11-02T23:11:01Z"
  },
  {
    "title": "Trump held 'Gatsby'-themed Halloween party as SNAP benefits were due to be cut off (USA Today)",
    "description": "USA Today:\nTrump held ‘Gatsby’-themed Halloween party as SNAP benefits were due to be cut off  —  President Donald Trump hosted a 1920's theme party at Mar-A-Lago on Oct. 31, as multiple federal judges ruled the administration could not stop funding food aid …",
    "link": "https://www.memeorandum.com/251102/p72",
    "timestamp": "2025-11-02T23:10:01Z"
  },
  {
    "title": "Donald Trump Suggests Seth Meyers' Jokes About Him Might Be Illegal",
    "description": "Donald Trump says Seth Meyers is such a hater that it might even be illegal ... ripping into the star in another Truth Social rant. The President of the United States shared his raw thoughts about \"Late Night With Seth Meyers\" host Saturday ...…\n Permalink",
    "link": "https://www.tmz.com/2025/11/02/donald-trump-suggests-seth-meyers-comments-about-him-might-be-illegal/",
    "timestamp": "2025-11-02T23:02:33Z"
  },
  {
    "title": "USDA Tells Grocery Stores They Can't Give Discounts to People Hit by Trump's Food Stamp Freeze",
    "description": "As the Trump administration continued its illegal freeze on food assistance, the US Department of Agriculture sent a warning to grocery stores not to provide discounts to the more than 42 million Americans affected.Several grocery chains and food delivery app…",
    "link": "https://www.commondreams.org/news/usda-tells-grocery-stores-they-can-t-give-discounts-to-people-hit-by-trump-s-food-stamp-freeze",
    "timestamp": "2025-11-02T23:02:21Z"
  },
  {
    "title": "SNAP benefits cut off during shutdown, driving long lines at food pantries",
    "description": "Long lines have formed at food pantries across the U.S. as federal food benefits were cut off due to the government shutdown",
    "link": "https://abcnews.go.com/Health/wireStory/snap-benefits-cut-off-shutdown-driving-long-lines-127096897",
    "timestamp": "2025-11-02T23:01:30Z"
  },
  {
    "title": "‘IITians should transform their viewpoint from being job seekers to being job creators’: IIT Kharagpur director at Idea Exchange",
    "description": "A mechanical engineer by training, he is known for his work in fluid mechanics, biomedical engineering and affordable health and diagnostics",
    "link": "https://indianexpress.com/article/idea-exchange/suman-chakraborty-at-idea-exchange-iitians-should-transform-their-viewpoint-from-being-job-seekers-to-being-job-creators-10342290/",
    "timestamp": "2025-11-02T23:00:20Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Democrats have an early lead in next year’s battle for control of Congress amid an ongoing government shutdown, as more voters say President Donald Trump has not lived up to their expectations on several major issues that propelled him back to the White House…",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-november-2-rcna241207",
    "timestamp": "2025-11-02T23:00:00Z"
  },
  {
    "title": "Trump’s New Nuke Tests Won’t Include ‘Explosions’ or ‘Mushroom Clouds,’ Energy Secretary Admits",
    "description": "Chris Wright declared Sunday that Donald Trump's order to start testing the U.S. nuclear arsenal will not include nuclear \"explosions\" in the Nevada desert.\nThe post Trump’s New Nuke Tests Won’t Include ‘Explosions’ or ‘Mushroom Clouds,’ Energy Secretary Admi…",
    "link": "https://www.mediaite.com/media/news/trumps-new-nuke-tests-wont-include-explosions-or-mushroom-clouds-energy-secretary-admits/",
    "timestamp": "2025-11-02T22:58:06Z"
  },
  {
    "title": "Nicki Minaj Sings Trump’s Praises For His Nigeria Comments",
    "description": "The rap superstar said the president’s comments about the West African country gave her a “deep sense of gratitude.”",
    "link": "https://www.huffpost.com/entry/nicki-minaj-trump-nigeria-christian-killings_n_690785c9e4b05a8637e7e2f8",
    "timestamp": "2025-11-02T22:50:25Z"
  },
  {
    "title": "US energy secretary reveals details about nuclear weapon tests",
    "description": "The nuclear weapons tests ordered by President Donald Trump would not involve nuclear explosions, the US energy chief said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627265-us-energy-secretary-nuclear-tests/",
    "timestamp": "2025-11-02T22:49:32Z"
  },
  {
    "title": "Trump’s nuclear weapons tests will involve ‘noncritical explosions,’ not atomic blasts, energy secretary says",
    "description": "New tests of the U.S. nuclear weapons system ordered up by President Donald Trump will not include nuclear explosions, Energy Secretary Chris Wright said Sunday.\nIt was the first clarity from the Trump administration since the president took to social media l…",
    "link": "https://biztoc.com/x/6680b536bfb33c1c",
    "timestamp": "2025-11-02T22:48:49Z"
  },
  {
    "title": "Trump renews call to remove Omar after Somali allegiance comments",
    "description": "Trump shares footage of Rep. Ilhan Omar saying “Somalia is our home” during a Minnesota rally, urging her to “go back” to Somalia.US President Donald Trump on Saturday criticized Rep. Ilhan Omar (D-MN), a member of “The Squad” of anti-Israel Democrats, in a p…",
    "link": "https://freerepublic.com/focus/f-news/4350304/posts",
    "timestamp": "2025-11-02T22:43:25Z"
  },
  {
    "title": "Trump confirms he's helping Scott Adams get cancer treatment: 'On it'",
    "description": "President Donald Trump on Sunday publicly confirmed that he was working to help \"Dilbert\" creator Scott Adams secure treatment for prostate cancer. Adams publicly reached out to Trump seeking his aid the same day. Trump promptly responded by sharing Adams's p…",
    "link": "https://freerepublic.com/focus/f-news/4350303/posts",
    "timestamp": "2025-11-02T22:42:59Z"
  },
  {
    "title": "Trump says he is ‘on it’ after ‘Dilbert’ creator Scott Adams pleads for lifesaving help",
    "description": "The news comes after Adams, a supporter of Trump, previewed on X that he would ask the president for help receiving a treatment that would “give me a...",
    "link": "https://www.cnn.com/2025/11/02/politics/trump-dilbert-scott-adams-cancer",
    "timestamp": "2025-11-02T22:37:41Z"
  },
  {
    "title": "Faced with footage of ICE tear gassing residential streets and tackling young women, Trump said that his agents have been ‘held back’ in their tactics by liberal judges.",
    "description": "Donald Trump has stood by the growing violence of ICE raids across the country—and said that only “liberal judges” are standing in the way of them getting ev...",
    "link": "https://www.thedailybeast.com/trump-says-his-bloody-ice-raids-havent-gone-far-enough/",
    "timestamp": "2025-11-02T22:37:39Z"
  },
  {
    "title": "Apple Gears Up For A Pivotal Year With Major Product Releases And Challenges",
    "description": "As 2026 approaches, Apple is gearing up for a critical year filled with significant product launches and potential executive changes, all while grappling with regulatory and tariff-related challenges.",
    "link": "https://www.benzinga.com/markets/tech/25/11/48581363/apple-gears-up-for-a-pivotal-year-with-major-product-releases-and-challenges",
    "timestamp": "2025-11-02T22:37:04Z"
  },
  {
    "title": "Hamas Hands Over 3 More Hostages' Bodies As Israeli Airstrike Kills Palestinian Man",
    "description": "The Red Cross is transporting the remains while Israel and Hamas trade blame over repeated violations of the shaky Gaza truce.",
    "link": "https://www.huffpost.com/entry/hamas-hands-over-3-more-hostages-israel-airstrike-palestine-gaza_n_6907d70ee4b0c4a0f50978a0",
    "timestamp": "2025-11-02T22:36:28Z"
  },
  {
    "title": "Trump: ICE Raids 'Haven't Gone Far Enough'",
    "description": "On Sunday, CBS released a preview clip of President Donald Trump's interview, scheduled to air later on \"60 Minutes,\" in which he discussed his immigration policy.\nThe post Trump: ICE Raids ‘Haven’t Gone Far Enough’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/11/02/trump-ice-raids-havent-gone-far-enough/",
    "timestamp": "2025-11-02T22:35:06Z"
  },
  {
    "title": "Trump’s nuclear weapons tests will involve ‘noncritical explosions,’ not atomic blasts, energy secretary says",
    "description": "The planned testing involves “all the other parts of a nuclear weapon to make sure they deliver the appropriate geometry and they set up the nuclear explosion.”",
    "link": "https://fortune.com/2025/11/02/trump-nuclear-weapons-tests-noncritical-explosions-energy-secretary/",
    "timestamp": "2025-11-02T22:34:58Z"
  },
  {
    "title": "Trump Tells ’60 Minutes’ ICE Raid Tactics of Tear Gas, Breaking Car Windows ‘Haven’t Gone Far Enough’ | Video",
    "description": "The president adds that he approves of the brute use of force \"because you have to get the people out\"\nThe post Trump Tells ’60 Minutes’ ICE Raid Tactics of Tear Gas, Breaking Car Windows ‘Haven’t Gone Far Enough’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-60-minutes-ice-raid-havent-gone-far-enough-video/",
    "timestamp": "2025-11-02T22:17:25Z"
  },
  {
    "title": "Trump says Mamdani 'far worse than a socialist'",
    "description": "United States President Donald Trump labeled New York City mayoral frontrunner Zohran Mamdani as being \"far worse than a socialist,\" in his interview with CBS News' \"60 Minutes.\"More to come......",
    "link": "https://biztoc.com/x/a5c53ac182c9c1ec",
    "timestamp": "2025-11-02T22:15:43Z"
  },
  {
    "title": "Newsom says he saw nothing to suggest Biden couldn't serve through 2029 in NBC interview",
    "description": "Gov. Gavin Newsom, D-Calif., was pressed by NBC News host Kristen Welker on whether he thought former President Joe Biden could have served through 2029, his defense of the former president and Kamala Harris' failed campaign during \"Meet the Press\" on Sunday.…",
    "link": "https://freerepublic.com/focus/f-news/4350299/posts",
    "timestamp": "2025-11-02T22:14:01Z"
  },
  {
    "title": "Trump Insists ICE Raids Haven’t ‘Gone Far Enough’ and Are Stifled By ‘Liberal Judges’ During Stern ’60 Minutes’ Interview",
    "description": "President Trump said he would like to see ICE get even more aggressive deporting people but that its being thwarted by \"liberal judges,\" while on \"60 Minutes\"\nThe post Trump Insists ICE Raids Haven’t ‘Gone Far Enough’ and Are Stifled By ‘Liberal Judges’ Durin…",
    "link": "https://www.mediaite.com/politics/trump-insists-ice-raids-havent-gone-far-enough-and-are-stifled-by-liberal-judges-during-stern-60-minutes-interview/",
    "timestamp": "2025-11-02T22:10:08Z"
  },
  {
    "title": "Trump's testing plans for US nuclear weapons won't include explosions, energy secretary says",
    "description": "Energy Secretary Chris Wright says that new tests of the U.S. nuclear weapons system ordered up by President Donald Trump will not include nuclear explosions",
    "link": "https://abcnews.go.com/US/wireStory/trumps-testing-plans-us-nuclear-weapons-include-explosions-127116261",
    "timestamp": "2025-11-02T22:05:54Z"
  },
  {
    "title": "Airyn De Niro Says Dad Robert De Niro Has Been 'Non-Stop' Supportive of His Transition",
    "description": "Airyn De Niro says His actor dad Robert De Niro has been \"non-stop\" supportive since Airyn came out as transgender.\nThe post Airyn De Niro Says Dad Robert De Niro Has Been ‘Non-Stop’ Supportive of His Transition appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/11/02/airyn-de-niro-says-dad-robert-de-niro-has-been-non-stop-supportive-of-his-transition/",
    "timestamp": "2025-11-02T22:02:03Z"
  },
  {
    "title": "Trump quips: I can’t imagine we didn’t do better with the Jewish vote",
    "description": "President Trump addresses Republican Jewish Coalition’s Annual Leadership Summit, touts his record on Israel, national security, and fighting antisemitism: “Israel has never had a better friend than President Donald J. Trump.”",
    "link": "https://www.israelnationalnews.com/news/417196",
    "timestamp": "2025-11-02T22:01:09Z"
  },
  {
    "title": "What Zohran Mamdani’s Bid for Mayor Reveals About Being Muslim in America",
    "description": "Rozina Ali writes about the Islamophobic attacks on the candidate, which carry the weight of history and the urgency of the present.",
    "link": "https://www.newyorker.com/news/the-lede/what-zohran-mamdanis-bid-for-mayor-reveals-about-being-muslim-in-america",
    "timestamp": "2025-11-02T22:00:20Z"
  },
  {
    "title": "Trump’s Trip to Asia Signals Second Term China Policy",
    "description": "President Donald Trump recently wrapped up a crucial weeklong trip to Asia, including a significant summit with Xi Jinping, General Secretary of the Communist Party... Read More\nThe post Trump’s Trip to Asia Signals Second Term China Policy appeared first on …",
    "link": "https://www.dailysignal.com/2025/11/02/trumps-trip-to-asia-signals-second-term-china-policy/",
    "timestamp": "2025-11-02T22:00:00Z"
  },
  {
    "title": "Colombia’s ELN rebels face US drug threats amid push for peace talks",
    "description": "The US focus on drugs and nearby Venezuela brings an international dimension to what was an internal Colombian conflict.",
    "link": "https://www.aljazeera.com/news/2025/11/2/colombias-eln-rebels-face-us-drug-threats-amid-push-for-peace-talks",
    "timestamp": "2025-11-02T21:59:30Z"
  },
  {
    "title": "Trump's Testing Plans For U.S. Nuclear Weapons Won't Include Explosions, Energy Secretary Says",
    "description": "Energy Secretary Chris Wright says that new tests of the U.S. nuclear weapons system ordered up by President Donald Trump will not include nuclear explosions.",
    "link": "https://www.huffpost.com/entry/us-trump-nuclear-tests_n_6907d183e4b00afef15f3137",
    "timestamp": "2025-11-02T21:52:32Z"
  }
]