[
  {
    "title": "Watch: Trump forgets hostage in Gaza, bereaved father calls him out",
    "description": "During a Hanukkah reception at the White House, President Trump said all hostages had been returned from Gaza, before a bereaved father noted that Ran Gvili remains held by Hamas.",
    "link": "https://www.israelnationalnews.com/news/419504",
    "timestamp": "2025-12-17T14:23:00Z"
  },
  {
    "title": "Fed chair candidate Waller says he will 'absolutely' emphasize importance of the central bank's independence to Trump",
    "description": "Federal Reserve Governor Christopher Waller told CNBC on Wednesday that he will \"absolutely\" emphasize the importance of central bank independence to President Donald Trump.\nWaller is one of five finalists to potentially succeed Jerome Powell when the Federal…",
    "link": "https://biztoc.com/x/9b49b1a06662e833",
    "timestamp": "2025-12-17T14:19:15Z"
  },
  {
    "title": "Dan Newhouse will not run for reelection",
    "description": "Rep. Dan Newhouse (R-Wash.) — one of 10 Republicans who voted to impeach President Donald Trump after the Jan. 6, 2021 attack at the Capitol — announced Wednesday he will not seek reelection in 2026. \n“This decision comes with no reservations or remorse, only…",
    "link": "https://biztoc.com/x/918d36ea59de5fae",
    "timestamp": "2025-12-17T14:18:45Z"
  },
  {
    "title": "'That push-back sounds ridiculous': Karoline Leavitt flattened over Susie Wiles defense",
    "description": "White House Press Secretary Karoline Leavitt’s attempt to put out the firestorm over a Vanity Fair interview with Susie Wiles was laughed off on MS NOW on Wednesday morning as co-hosts Mika Brzezinski and Jonathan Lemire tore it apart.The interview with Donal…",
    "link": "https://www.rawstory.com/wiles-karoline-leavitt-ridiculous/",
    "timestamp": "2025-12-17T14:18:08Z"
  },
  {
    "title": "Trump is previewing his 2026 agenda in an address to the nation as his popularity wanes (Josh Boak/Associated Press)",
    "description": "Josh Boak / Associated Press:\nTrump is previewing his 2026 agenda in an address to the nation as his popularity wanes  —  President Donald Trump intends to preview his agenda for next year and beyond in a live speech from the White House on Wednesday night, r…",
    "link": "https://www.memeorandum.com/251217/p32",
    "timestamp": "2025-12-17T14:15:00Z"
  },
  {
    "title": "The Bondi Strike: Who Will Control the Narrative?",
    "description": "How key players are starting to throw down markers to shape perceptions of the Bondi mass shooting.",
    "link": "https://www.nakedcapitalism.com/2025/12/the-bondi-strike-who-will-control-the-narrative.html",
    "timestamp": "2025-12-17T14:14:07Z"
  },
  {
    "title": "Norman Podhoretz, among the last of the ‘New York intellectuals’ and liberal turned neocon turned anti-anti-Trumper, dies at 95",
    "description": "Despised by former allies, he found new friends from President Reagan to President George W. Bush, who awarded him the Presidential Medal of Freedom.",
    "link": "https://fortune.com/2025/12/17/norman-podhoretz-neoconservative-new-york-intellectual-obituary-dead-95/",
    "timestamp": "2025-12-17T14:13:32Z"
  },
  {
    "title": "Federal judge signals he may side with Trump on White House ballroom project. Here’s why",
    "description": "A federal judge said Tuesday he’s leaning toward denying a preservationist group’s request to temporarily halt President Donald Trump’s White House ballroom project, saying the organization failed to show that “irreparable harm” would be caused if the project…",
    "link": "https://newsroom.ap.org/detail/FederaljudgesayshesinclinedtodenypreservationistsrequesttohaltTrumpsballroomproject/193127d844171495565379c8684afad3/text",
    "timestamp": "2025-12-17T14:12:58Z"
  },
  {
    "title": "Big Tech bent the knee for Trump in 2025",
    "description": "Sure, we've seen millions poured into lobbying and other means of influence during every presidency, but the last two years set a whole new bar. Business leaders, including those from almost every Big Tech company, stepped over themselves to prove fealty to D…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180410663",
    "timestamp": "2025-12-17T14:12:54Z"
  },
  {
    "title": "Trump's plot to 'turn CNN full MAGA' fails following Paramount deal collapse",
    "description": "A chance for Donald Trump to turn CNN \"full MAGA\" has failed following the breakdown in talks between Paramount and Warner Bros. Paramount had been looking to merge with Warner Bros., though the studio has instead opted for a merger with Netflix, Newsweek rep…",
    "link": "https://www.rawstory.com/donald-trump-cnn-2674407438/",
    "timestamp": "2025-12-17T14:11:49Z"
  },
  {
    "title": "Can't Buy Our Love",
    "description": "The president has suggesting sending tariff revenue rebate checks to voters, ignoring the obvious economic downsides.",
    "link": "https://reason.com/2025/12/17/cant-buy-our-love/",
    "timestamp": "2025-12-17T14:11:17Z"
  },
  {
    "title": "US dramatically escalates air strikes on Somalia under Trump this year",
    "description": "Tump's strike total on conflict-ridden East African nation exceeds Bush, Obama and Biden administrations combined.",
    "link": "https://www.aljazeera.com/news/2025/12/17/us-dramatically-escalates-air-strikes-on-somalia-under-trump-this-year",
    "timestamp": "2025-12-17T14:10:24Z"
  },
  {
    "title": "‘Completely surrounded’: Trump orders major escalation against Venezuela",
    "description": "'The largest Armada ever assembled in the History of South America'",
    "link": "https://www.wnd.com/2025/12/completely-surrounded-trump-orders-major-escalation-against-venezuela/",
    "timestamp": "2025-12-17T14:10:06Z"
  },
  {
    "title": "Over half the workers in the $85 billion Union Pacific/Northern Southern railroads oppose the merger",
    "description": "“No customer is asking for this. This is strictly a Wall Street play for shareholders,” said Zak Andersen, chief of staff for Berkshire-owned BNSF.",
    "link": "https://fortune.com/2025/12/17/union-pacific-norfolk-southern-merger-union-opposition/",
    "timestamp": "2025-12-17T14:08:39Z"
  },
  {
    "title": "Live updates: Trump to give speech amid Venezuela tensions, Epstein files controversy and health care battle | CNN Politics",
    "description": "President Donald Trump will deliver remarks to the nation tonight. The White House said his speech will highlight the administration’s actions during the past year and tease priorities for 2026. Follow for live updates.",
    "link": "https://www.cnn.com/politics/live-news/trump-administration-news-12-17-25",
    "timestamp": "2025-12-17T14:08:08Z"
  },
  {
    "title": "Trump Adds On To Rob Reiner Insult, Netting Online Backlash",
    "description": "As tributes flowed in for the late director and actor Rob Reiner, President Donald Trump used his Truth Social platform to bash him. In a press event at the White House on Monday (December 15), when questioned about his remarks, Trump showed no regret or remo…",
    "link": "https://hiphopwired.com/2952711/trump-adds-on-to-rob-reiner-insult-netting-online-backlash/",
    "timestamp": "2025-12-17T14:05:57Z"
  },
  {
    "title": "Drama: Warner Bros. Discovery Board Rejects Paramount’s ‘Inadequate’ $108.4 Billion Hostile Takeover Bid",
    "description": "NEW YORK -- Warner Bros. is telling shareholders to reject a takeover bid from Paramount Skydance, saying that a rival bid from Netflix will be better for customers.\nThe post Drama: Warner Bros. Discovery Board Rejects Paramount’s ‘Inadequate’ $108.4 Billion …",
    "link": "https://www.breitbart.com/entertainment/2025/12/17/drama-warner-bros-discovery-board-rejects-paramounts-inadequate-108-4-billion-hostile-takeover-bid/",
    "timestamp": "2025-12-17T14:04:07Z"
  },
  {
    "title": "'Waiting for him to die': Columnist says Susie Wiles just revealed a surprising dynamic",
    "description": "President Donald Trump's widely condemned reaction to Rob Reiner's murder made clear he wishes his enemies dead, but a columnist argued that his own Republicans allies are biding their time until his demise.The president responded to the slaying of the belove…",
    "link": "https://www.rawstory.com/susie-wiles-interview-2674407436/",
    "timestamp": "2025-12-17T14:03:33Z"
  },
  {
    "title": "Venezuela blockade: What it would mean for the Maduro regime and oil markets",
    "description": "US President Donald Trump has threatened Venezuela with a naval blockade to thwart its oil exports — a move that would hit the Maduro government hard but may leave global oil markets unfazed.",
    "link": "https://www.dw.com/en/venezuela-blockade-what-it-would-mean-for-the-maduro-regime-and-oil-markets/a-75201861",
    "timestamp": "2025-12-17T14:03:00Z"
  },
  {
    "title": "Trump is previewing his 2026 agenda in an address to the nation as his popularity wanes",
    "description": "President Donald Trump plans to give a preview of his 2026 agenda in a speech at the White House. Wednesday night's remarks come as Trump's popularity erodes. Polls show most U.S. adults are frustrated with Trump's handling of the economy.…",
    "link": "https://apnews.com/article/trump-address-economy-popularity-midterms-65d3b79a613cfb778432bcc719a313ab",
    "timestamp": "2025-12-17T14:02:00Z"
  },
  {
    "title": "Jennifer Welch Suddenly Worried About Toxicity",
    "description": "Left-wing podcaster Jennifer Welch voiced concern on “I’ve Had It” Tuesday about toxicity in American politics despite her record of using hateful rhetoric against conservatives. Welch previously praised a “No Kings” protester who rejoiced over Charlie Kirk’s…",
    "link": "https://freerepublic.com/focus/f-bloggers/4357787/posts",
    "timestamp": "2025-12-17T14:01:54Z"
  },
  {
    "title": "Susie Wiles' net worth: How wealthy is Trump's viral Chief of Staff?",
    "description": "Susie Wiles, Donald Trump's chief of staff, is in the spotlight following a Vanity Fair interview. She made notable comments about Trump and Elon Musk. Wiles has a significant career in politics and consulting. Her net worth is estimated at $10 million. She e…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/susie-wiles-net-worth-how-wealthy-is-trumps-viral-chief-of-staff/articleshow/126040231.cms",
    "timestamp": "2025-12-17T14:01:39Z"
  },
  {
    "title": "Trump “Jokes” About Third Term as Miriam Adelson Offers Him Millions",
    "description": "Donald Trump bragged about one of his biggest donors, Miriam Adelson, donating $250 million to his campaign in 2024, at a White House Hanukkah event Tuesday night. Adelson then told the audience that Trump could run for a third term and whispered something in…",
    "link": "https://newrepublic.com/post/204532/trump-jokes-third-term-miriam-adelson",
    "timestamp": "2025-12-17T14:01:05Z"
  },
  {
    "title": "Wednesday, December 17, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/wednesday-december-17-2025/",
    "timestamp": "2025-12-17T14:00:12Z"
  },
  {
    "title": "Documents Reveal That, for AG Garland, Probable Cause for Mar-a-Lago Raid was Optional",
    "description": "\"As everyone is tracking, WFO does not believe (and has articulated to DOJ CES), that we have established probable cause for the search warrant for classified records at Mar-a-Lago.\"\nThe post Documents Reveal That, for AG Garland, Probable Cause for Mar-a-Lag…",
    "link": "https://legalinsurrection.com/2025/12/documents-reveal-that-for-ag-garland-probable-cause-for-mar-a-lago-raid-was-optional/",
    "timestamp": "2025-12-17T14:00:11Z"
  },
  {
    "title": "Republicans are quiet quitting on Trump (Amanda Marcotte/Salon)",
    "description": "Amanda Marcotte / Salon:\nRepublicans are quiet quitting on Trump  —  The White House chief of staff says the president has “an alcoholic's personality”  —  Donald Trump is worried that Republicans aren't as afraid of him as they used to be.  Despite his self-…",
    "link": "https://www.memeorandum.com/251217/p29",
    "timestamp": "2025-12-17T14:00:00Z"
  },
  {
    "title": "Who loves Trump? Apparently fewer people than ever (Aaron Blake/CNN)",
    "description": "Aaron Blake / CNN:\nWho loves Trump?  Apparently fewer people than ever  —  Donald Trump Congressional news January 6th  —  A year ago, President Donald Trump spoke as though the American people had just delivered him a landslide for the ages.  —  “America has…",
    "link": "https://www.memeorandum.com/251217/p31",
    "timestamp": "2025-12-17T14:00:00Z"
  },
  {
    "title": "Cambodia, Thailand agree to attend Asean Foreign Ministers meet in KL, says PM",
    "description": "PUTRAJAYA: Cambodia and Thailand have both agreed to attend the Asean Foreign Ministers special meeting on Dec 22 in Kuala Lumpur to kickstart talks to prevent further escalation along the disputed border, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/12/17/cambodia-thailand-agree-to-attend-asean-foreign-ministers-meet-in-kl-says-pm",
    "timestamp": "2025-12-17T14:00:00Z"
  },
  {
    "title": "Paramount’s Bid for Warner Bros. Discovery May Face Impossible Odds as Board Rejects Hostile Offer",
    "description": "WBD's rejection comes a day after Trump slammed the Ellisons, raising questions about their relationship with the White House\nThe post Paramount’s Bid for Warner Bros. Discovery May Face Impossible Odds as Board Rejects Hostile Offer appeared first on TheWrap.",
    "link": "https://www.thewrap.com/paramount-regulatory-hurdles-warner-bros-bid-analysis/",
    "timestamp": "2025-12-17T14:00:00Z"
  },
  {
    "title": "Trump’s Inflation Trap",
    "description": "What can Donald Trump do to stop morphing into Joe Biden? The two presidents could hardly be more different in most ways—but in the one... Read More\nThe post Trump’s Inflation Trap appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/12/17/trumps-inflation-trap/",
    "timestamp": "2025-12-17T14:00:00Z"
  },
  {
    "title": "Jack Smith Testifies Before The House Judiciary Committee (Joyce Vance/Civil Discourse ...)",
    "description": "Joyce Vance / Civil Discourse with Joyce Vance:\nJack Smith Testifies Before The House Judiciary Committee  —  Making sense of the circus  —  On Wednesday, former Special Counsel Jack Smith, who investigated and charged Donald Trump in two separate cases, will…",
    "link": "https://www.memeorandum.com/251217/p30",
    "timestamp": "2025-12-17T14:00:00Z"
  },
  {
    "title": "Trump admin said it rescued more than 62K children from sex trafficking and abuse. Here are the facts",
    "description": "A November 2025 initiative by ICE is focused on the sponsors migrant children have been placed with.",
    "link": "https://www.snopes.com//news/2025/12/17/trump-admin-children-sex-trafficking-abuse/",
    "timestamp": "2025-12-17T14:00:00Z"
  },
  {
    "title": "Glenn Kessler: Trump’s Top Ten Lies of 2025",
    "description": "Glenn Kessler spent 15 years as the Washington Post fact-checker. He stepped aside recently and now writes at his Substack blog. For years, he has had the daunting task of counting Trump’s lies. Trump has the unparalleled ability to lie with great sincerity e…",
    "link": "https://dianeravitch.net/2025/12/17/glenn-kessler-trumps-top-ten-lies-of-2025/",
    "timestamp": "2025-12-17T14:00:00Z"
  },
  {
    "title": "Trafficked, exploited, married off: Rohingya children’s lives crushed by foreign aid cuts",
    "description": "UKHIYA, Bangladesh (AP) — In moments when she is alone, when there is a break in the beatings from her husband, the girl cries for the school that was once her place of peace in a world that has otherwise offered her none. Ever since the military in her homel…",
    "link": "https://freerepublic.com/focus/f-news/4357786/posts",
    "timestamp": "2025-12-17T13:59:42Z"
  },
  {
    "title": "That's PETE HEGSETH'S Boat Murder Jerkoff Porno Movie, YOU CAN'T WATCH IT",
    "description": "He might accidentally put it on Signal, though, so reporters should watch out for that.",
    "link": "https://www.wonkette.com/p/thats-pete-hegseths-boat-murder-jerkoff",
    "timestamp": "2025-12-17T13:55:18Z"
  },
  {
    "title": "Daughter warns China not to make Jimmy Lai a 'martyr'",
    "description": "Washington, United States (AFP) Dec 15, 2025\n\n The daughter of Hong Kong pro-democracy media tycoon Jimmy Lai, who was convicted on Monday, warned China her father would be a \"martyr\" if he dies in prison, as she voiced alarm again for his health. \n\nLai, 78, …",
    "link": "https://www.terradaily.com/reports/Daughter_warns_China_not_to_make_Jimmy_Lai_a_martyr_999.html",
    "timestamp": "2025-12-17T13:53:39Z"
  },
  {
    "title": "M23 still in seized Congo town despite withdrawal pledge, residents say",
    "description": "KINSHASA, Dec 17 (Reuters) - Rwanda-backed M23 rebels have not withdrawn from the eastern Congolese town of Uvira despite an announcement earlier this week that they would pull back, residents told Reuters on Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/17/m23-still-in-seized-congo-town-despite-withdrawal-pledge-residents-say",
    "timestamp": "2025-12-17T13:52:00Z"
  },
  {
    "title": "Watch ‘Melania’ Trailer: First Glimpse At Documentary About First Lady Includes Donald Trump Teaser",
    "description": "The trailer for Melania, an upcoming documentary about Melania Trump, debuted on Wednesday, with the first lady posting it on her X account. “MELANIA, the film, exclusively in theaters worldwide on January 30th, 2026,” the first lady wrote. “Everyone wants to…",
    "link": "http://deadline.com/2025/12/melania-trailer-trump-documentary-1236651032/",
    "timestamp": "2025-12-17T13:51:12Z"
  },
  {
    "title": "‘Say that’s what it is’: Dems demand answers on Trump's Venezuela regime change push",
    "description": "WASHINGTON — Turns out, Secretary of State Marco Rubio and Defense Secretary Pete Hegseth aren’t very good actors.Congress doesn’t agree on much, but when it comes to Venezuela and U.S. military strikes on purported drug smugglers, on Tuesday Congress was bas…",
    "link": "https://www.rawstory.com/raw-investigates/trump-venezuela-2674407497/",
    "timestamp": "2025-12-17T13:50:45Z"
  },
  {
    "title": "Shaping the conversation means offering context to extreme ideas, not just a platform",
    "description": "Should all points of view be heard from? Defending certain values and ideas makes it a bit more complicated than simply listening to all sides.",
    "link": "https://theconversation.com/shaping-the-conversation-means-offering-context-to-extreme-ideas-not-just-a-platform-269883",
    "timestamp": "2025-12-17T13:43:52Z"
  },
  {
    "title": "Pakistan says ‘hostile countries’ behind false online claims linking it to Australia shootings",
    "description": "Pakistan has been wrongly blamed in an online campaign following the deadly shooting at Australia’s Bondi Beach, the Information Minister has said",
    "link": "https://abcnews.go.com/International/wireStory/pakistan-hostile-countries-false-online-claims-linking-australia-128480891",
    "timestamp": "2025-12-17T13:41:52Z"
  },
  {
    "title": "The #iwasfifteen hashtag and ongoing Epstein coverage show how traffickers exploit the vulnerabilities of teens and tweens",
    "description": "The conversation around #iwasfifteen sheds light on the dynamics of abusive relationships and the experiences of trafficking victims.",
    "link": "https://theconversation.com/the-iwasfifteen-hashtag-and-ongoing-epstein-coverage-show-how-traffickers-exploit-the-vulnerabilities-of-teens-and-tweens-270349",
    "timestamp": "2025-12-17T13:39:47Z"
  },
  {
    "title": "Trump’s second term is reshaping US science with unprecedented cuts and destabilizing policy changes",
    "description": "The Trump administration is rewriting the 80-year-old American social contract for science research.",
    "link": "https://theconversation.com/trumps-second-term-is-reshaping-us-science-with-unprecedented-cuts-and-destabilizing-policy-changes-271079",
    "timestamp": "2025-12-17T13:38:36Z"
  },
  {
    "title": "US visa restrictions: Shehu Sani urges Nigerians to focus on rebuilding Nigeria",
    "description": "Shehu Sani reacts to new US visa restrictions on Nigeria, calling the policy exclusionary and urging citizens to stay back and build their country.\n\nRead More: https://punchng.com/us-visa-restrictions-shehu-sani-urges-nigerians-to-focus-on-rebuilding-nigeria/",
    "link": "https://punchng.com/us-visa-restrictions-shehu-sani-urges-nigerians-to-focus-on-rebuilding-nigeria/",
    "timestamp": "2025-12-17T13:35:43Z"
  },
  {
    "title": "Fed chair candidate Waller says he will 'absolutely' emphasize importance of the central bank's independence to Trump",
    "description": null,
    "link": "https://www.cnbc.com/2025/12/17/fed-chair-candidate-waller-says-he-will-absolutely-emphasize-importance-of-the-central-banks-independence-to-trump.html",
    "timestamp": "2025-12-17T13:35:38Z"
  },
  {
    "title": "A week after telling Americans their kids may get fewer dolls and pencils because of tariffs, Trump vows ‘THE BEST IS YET TO COME’",
    "description": "President Donald Trump intends to preview his agenda for next year and beyond in a live speech from the White House on Wednesday night, remarks that come at a crucial juncture as he tries to rebuild his steadily eroding popularity.\nThe White House offered few…",
    "link": "https://biztoc.com/x/79f1486fe4a22894",
    "timestamp": "2025-12-17T13:34:20Z"
  },
  {
    "title": "Bullish investors pile into stocks as cash levels sink to record low",
    "description": "Asset managers' cash holdings have fallen to a record low in a sign of bullishness about the AI-fuelled stock market rally. Read more.",
    "link": "https://financialpost.com/financial-times/bullish-investors-stocks-cash-levels-sink-record-low",
    "timestamp": "2025-12-17T13:34:19Z"
  },
  {
    "title": "Senator Reaches Damning Conclusions After Classified Briefing With Hegseth, Rubio",
    "description": "Sen. Chris Murphy trashed a meeting with the Cabinet duo about the Trump administration's boat bombings.",
    "link": "https://www.huffpost.com/entry/chris-murphy-pete-hegseth-marco-rubio-briefing-boat-strikes_n_69428d09e4b0ec0b2f95c5c4",
    "timestamp": "2025-12-17T13:33:52Z"
  },
  {
    "title": "Dan Bongino Clearing Out His Office in Preparation for FBI Exit: NY Times",
    "description": "Times sources claimed Bongino has begun shipping office “knickknacks” and other personal belongings back to Florida, where he plans to resume podcasting.\nThe post Dan Bongino Clearing Out His Office in Preparation for FBI Exit: NY Times first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/dan-bongino-clearing-out-his-office-in-preparation-for-fbi-exit-ny-times/",
    "timestamp": "2025-12-17T13:31:05Z"
  },
  {
    "title": "Trump Files $10 billion Lawsuit Against BBC; Let It Burn",
    "description": "President Donald Trump has filed a $10 billion defamation lawsuit against the British Broadcasting Corporation (“BBC”), alleging the broadcaster deceptively edited clips from his 6 January 2021 speech to make it appear he incited violence during the Capitol r…",
    "link": "https://www.shtfplan.com/headline-news/trump-files-10-billion-lawsuit-against-bbc-let-it-burn",
    "timestamp": "2025-12-17T13:30:47Z"
  },
  {
    "title": "‘Melania’ Trailer: Trump’s First Lady Takes Center Stage as Doc Invites Audiences to ‘Witness History in the Making’",
    "description": "“Hi, Mr. President, congratulations,” Melania Trump says on the phone, speaking from a golden bathroom in the first trailer for “Melania,” Amazon MGM Studio‘s upcoming documentary about the First Lady. “Did you watch it?” Trump asks on the other end of the ca…",
    "link": "https://variety.com/2025/film/global/melania-doc-trailer-trumps-first-lady-takes-center-stage-1236610721/",
    "timestamp": "2025-12-17T13:30:05Z"
  },
  {
    "title": "Fox News viewers urge Donald Trump to 'resign' after announcement live on air",
    "description": "President Donald Trump announced legal action against the BBC in a live broadcast, claiming the broadcaster used AI to manipulate his January 6 speech, sparking calls for his resignation from some viewers",
    "link": "https://www.irishstar.com/culture/entertainment/fox-news-trump-resign-bbc-36415701",
    "timestamp": "2025-12-17T13:28:29Z"
  },
  {
    "title": "India likely to record about 7% growth in FY26: Gita Gopinath",
    "description": "India's economy is set for robust growth this fiscal year, exceeding initial projections.  Former IMF chief economist Gita Gopinath anticipates a 7 percent expansion.  Achieving ambitious national goals requires sustained reforms and maintaining high growth r…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/india-likely-to-record-about-7-growth-in-fy26-gita-gopinath/articleshow/126039874.cms",
    "timestamp": "2025-12-17T13:26:56Z"
  },
  {
    "title": "A week after telling Americans their kids may get fewer dolls and pencils because of tariffs, Trump vows ‘THE BEST IS YET TO COME’",
    "description": "A report released on Tuesday showed a jobs market that looks increasingly fragile, even if the overall economy still appears to be stable.",
    "link": "https://fortune.com/2025/12/17/trump-best-yet-to-come-tariffs-dolls-pencils-affordability/",
    "timestamp": "2025-12-17T13:26:54Z"
  },
  {
    "title": "Trump is previewing his 2026 agenda in an address to the nation as his popularity wanes",
    "description": "President Donald Trump plans to give a preview of his 2026 agenda in a speech at the White House",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-previewing-2026-agenda-address-nation-popularity-wanes-128480189",
    "timestamp": "2025-12-17T13:26:03Z"
  },
  {
    "title": "Putin warns that Russia will seek to extend its gains in Ukraine if peace talks fail",
    "description": "Russian President Vladimir Putin is warning that Moscow will extend its gains in Ukraine if Kyiv and its Western allies reject the Kremlin's demands in peace talks",
    "link": "https://abcnews.go.com/International/wireStory/putin-warns-russia-seek-extend-gains-ukraine-peace-128480142",
    "timestamp": "2025-12-17T13:25:36Z"
  },
  {
    "title": "Oil prices rally as Trump orders blockade of tankers",
    "description": "Oil prices rallied by nearly 2% today after US President Donald Trump ordered a complete blockade of all sanctioned oil tankers entering and leaving Venezuela, raising global political tensions at a time of concerns over demand.",
    "link": "https://www.rte.ie/news/business/2025/1217/1549479-oil-prices-rally-as-trump-orders-blockade-of-tankers/",
    "timestamp": "2025-12-17T13:24:48Z"
  },
  {
    "title": "Trump stays on sidelines as GOP falters in push to unite on healthcare plan",
    "description": "Republicans have two weeks to decide on Obamacare subsidies affecting 24 million enrollees, while President Donald Trump takes a hands-off legislative approach.",
    "link": "https://www.foxnews.com/politics/trump-stays-sidelines-gop-falters-push-unite-healthcare-plan",
    "timestamp": "2025-12-17T13:24:37Z"
  },
  {
    "title": "Trump previews his 2026 agenda in a national address",
    "description": "President Donald Trump plans to give a preview of his 2026 agenda in a speech at the White House",
    "link": "https://www.wsbradio.com/news/politics/trump-is-previewing/DH4Y343PEU2EFIGVNAGHS4TP7A/",
    "timestamp": "2025-12-17T13:23:59Z"
  },
  {
    "title": "GOP 'losing enthusiasm' in defending Trump and cannot 'hide frustrations': analysis",
    "description": "The Republican Party are \"losing enthusiasm\" in Donald Trump as they begin to make their frustrations with the president known, an analyst said.Trump's recent comments on the death of film director Rob Reiner, as well as administrative failings on healthcare …",
    "link": "https://www.rawstory.com/gop-trump-2674407239/",
    "timestamp": "2025-12-17T13:23:51Z"
  },
  {
    "title": "India’s 2025 geopolitical tightrope: Defying trade wars through strategic autonomy",
    "description": "In 2025, India has tried to straddle two boats - Trump tariffs and relations with Russia. With no resolution in sight, the issues trickle over into 2026. It remains to be seen how India navigates these waters.",
    "link": "https://www.thehindubusinessline.com/economy/indias-2025-geopolitical-tightrope-defying-trade-wars-through-strategic-autonomy/article70407472.ece",
    "timestamp": "2025-12-17T13:23:20Z"
  },
  {
    "title": "Oil rebounds from lowest levels since 2021 after Trump orders Venezuela oil tanker blockade",
    "description": "President Donald Trump said he ordered a \"total and complete\" blockade of sanctioned oil tankers leaving and entering Venezuela.",
    "link": "https://biztoc.com/x/dc4563e8d823809c",
    "timestamp": "2025-12-17T13:23:16Z"
  },
  {
    "title": "The Latest: Jack Smith set for private interview with lawmakers about Trump investigations",
    "description": "Former Justice Department special counsel Jack Smith is set for a closed-door interview with House Republicans on Wednesday after lawmakers rebuffed his...",
    "link": "https://www.yahoo.com/news/articles/latest-jack-smith-set-private-132313203.html",
    "timestamp": "2025-12-17T13:23:13Z"
  },
  {
    "title": "Mark Kelly Is Right: Military Members Have the Power to Resist What They Know Is Wrong",
    "description": "Any story about resistance within the military must begin by recognizing that it’s not an easy thing to do. Apparently, that’s true even for a much-decorated retired Navy commander, former astronaut, and sitting United States senator. I’m talking about Arizon…",
    "link": "https://tomdispatch.com/doin-the-right-thing-rag/",
    "timestamp": "2025-12-17T13:20:02Z"
  },
  {
    "title": "Who’s Responsible When a Military Order Is Illegal?",
    "description": "Originally appeared at TomDispatch: Any story about resistance within the military must begin by recognizing that it’s not an easy thing to do. Apparently, that’s true even for a much-decorated retired Navy commander, former astronaut, and sitting United Stat…",
    "link": "https://www.antiwar.com/blog/2025/12/17/whos-responsible-when-a-military-order-is-illegal/",
    "timestamp": "2025-12-17T13:15:48Z"
  },
  {
    "title": "Oil rebounds from lowest levels since 2021 after Trump orders Venezuela oil tanker blockade",
    "description": "President Donald Trump said he ordered a \"total and complete\" blockade of sanctioned oil tankers leaving and entering Venezuela.",
    "link": "https://www.cnbc.com/2025/12/17/crude-oil-prices-today.html",
    "timestamp": "2025-12-17T13:14:17Z"
  },
  {
    "title": "Washington demands answers after South African raid on refugee center",
    "description": "Washington is seeking immediate clarification from South Africa after arrests at a facility handling US-bound refugee applications Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/629560-washington-demands-answers-south-africa-raid-refugee-center/",
    "timestamp": "2025-12-17T13:14:00Z"
  },
  {
    "title": "Analyst Upgrade Highlights 18% Upside in JBS N.V. (JBS)",
    "description": "JBS N.V. (NYSE:JBS) is among the consumer defensive stocks to buy according to analysts. On December 11, Guilherme Palhares from Grupo Santander upgraded JBS...",
    "link": "https://finance.yahoo.com/news/analyst-upgrade-highlights-18-upside-131353472.html",
    "timestamp": "2025-12-17T13:13:53Z"
  },
  {
    "title": "Unemployment rate rises, Tesla's 2025 turnaround, Siri's AI upgrade and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/12/17/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-12-17T13:13:42Z"
  },
  {
    "title": "Warner Bros. shareholders were ‘consistently misled’ by Paramount, board says in rejection letter: There’s no Ellison family backstop, and never was",
    "description": "Jilted Paramount CEO David Ellison painted a picture of no engagement from WBD. That's simply not true, according to the Warner board.",
    "link": "https://fortune.com/2025/12/17/warner-bros-rejects-paramount-no-ellison-backstop-illusory-offer-netflix/",
    "timestamp": "2025-12-17T13:12:56Z"
  },
  {
    "title": "Capitol agenda: Jack Smith jumps into a Judiciary minefield",
    "description": "Jack Smith wants to make his case against Donald Trump to Congress — but he’s walking into a political and legal minefield. \nThe Biden-era special counsel who brought the first and only federal criminal charges ever leveled against a former president is set t…",
    "link": "https://biztoc.com/x/c2ee6cf555183d35",
    "timestamp": "2025-12-17T13:11:49Z"
  },
  {
    "title": "Wrestling legend Mick Foley cuts WWE ties over Trump's Reiner comments",
    "description": "In an Instagram post, Mick Foley cited Trump's \"incredibly cruel comments\" following Rob Reiner's death as the \"final straw\" in his WWE association.",
    "link": "https://www.usatoday.com/story/sports/2025/12/17/mick-foley-leaves-wwe-trump-reiner-comments/87807716007/",
    "timestamp": "2025-12-17T13:11:40Z"
  },
  {
    "title": "Donald Trump’s Own Staff Alarmed by His Mental Health After “Objectionable” Remarks on Rob Reiner’s Death, Author Claims",
    "description": "Donald Trump’s Own Staff Alarmed by His Mental Health After “Objectionable” Remarks on Rob Reiner’s Death, Author Claimsinquisitr.com",
    "link": "https://www.inquisitr.com/donald-trumps-own-staff-alarmed-by-his-mental-health-after-objectionable-remarks-on-rob-reiners-death-author-claims",
    "timestamp": "2025-12-17T13:10:04Z"
  },
  {
    "title": "The Man Who Rules the Country Presides Over Nothing (Jamelle Bouie/New York Times)",
    "description": "Jamelle Bouie / New York Times:\nThe Man Who Rules the Country Presides Over Nothing  —  There is a presidency at work in Washington, but it is not clear that there is a president at work in the Oval Office.  —  Ask Donald Trump about the goings on of his admi…",
    "link": "https://www.memeorandum.com/251217/p20",
    "timestamp": "2025-12-17T13:10:00Z"
  },
  {
    "title": "John Fetterman Defends Trump's Blockade On Venezuelan Tankers: 'Funds That Support Regimes Like Iran'",
    "description": "Democratic Sen. John Fetterman defended President Donald Trump's naval blockade of sanctioned oil tankers off Venezuela's coast, saying the asset \"will support Iran\" and its proceeds will be used to fund \"terrorism.\"",
    "link": "https://www.ibtimes.com/john-fetterman-defends-trumps-blockade-venezuelan-tankers-funds-that-support-regimes-like-iran-3792954",
    "timestamp": "2025-12-17T13:09:59Z"
  },
  {
    "title": "‘Melania’ Trump documentary trailer shows run-up to husband Donald’s inauguration: ‘Here we go again’",
    "description": "First lady Melania Trump is taking center stage, with the first teaser trailer for a highly anticipated documentary dropping Wednesday.",
    "link": "https://nypost.com/2025/12/17/us-news/melania-trump-documentary-trailer-shows-run-up-to-husband-donalds-inauguration/",
    "timestamp": "2025-12-17T13:07:33Z"
  },
  {
    "title": "Susie Wiles flipped out after Trump accusation: Vanity Fair reporter",
    "description": "During an appearance on MS NOW on Wednesday morning, author Chris Whipple, who conducted the bombshell interview with White House Chief of Staff Susie Wiles, pushed back on her contention that her comments were taken out of context.After he pointed out he had…",
    "link": "https://www.rawstory.com/trump-susie-wiles-2674407209/",
    "timestamp": "2025-12-17T13:06:26Z"
  },
  {
    "title": "Goodbye to the penny: Final $16.7M U.S. penny auction marks the end of an American coin era",
    "description": "The last U.S. penny auction signals the historic end of America’s smallest coin following more than two centuries of circulation. Special commemorative sets featuring the final minted pennies produced over sixteen million dollars, showcasing intense collector…",
    "link": "https://economictimes.indiatimes.com/news/international/us/goodbye-to-the-penny-final-16-7m-u-s-penny-auction-marks-the-end-of-an-american-coin-era/articleshow/126039410.cms",
    "timestamp": "2025-12-17T13:03:15Z"
  },
  {
    "title": "Donald Trump to address nation in live primetime speech on Dec. 17: when and where to watch",
    "description": "President Donald Trump is set to give a live primetime speech to the nation on Dec. 17. The White House address comes at the end of the year and during his recent public talks on the economy. Trump shared the announcement on social media, creating interest ab…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-to-address-nation-in-live-primetime-speech-on-dec-17-when-and-where-to-watch/articleshow/126039521.cms",
    "timestamp": "2025-12-17T13:02:33Z"
  },
  {
    "title": "Watch Fed Governor Christopher Waller speak on interest rates and the race to succeed Powell",
    "description": "Waller is one of the five finalists considered for to replace Fed Chairman Jerome Powell when his term expires in May.",
    "link": "https://www.cnbc.com/2025/12/17/watch-fed-governor-christopher-waller-speak-on-interest-rates-and-the-race-to-succeed-powell.html",
    "timestamp": "2025-12-17T13:02:31Z"
  },
  {
    "title": "Trump's support collapses to post-Jan. 6 lows: analysis",
    "description": "President Donald Trump returned to office riding a self-proclaimed historical landslide, but he has tumbled to new lows in support less than a year into his second term.The now-79-year-old president declared the election had granted him \"an unprecedented and …",
    "link": "https://www.rawstory.com/trump-strong-approval-jan-6/",
    "timestamp": "2025-12-17T13:02:14Z"
  },
  {
    "title": "Putin warns that Russia will seek to extend its gains in Ukraine if peace talks fail",
    "description": "By The Associated Press Russian President Vladimir Putin warned Wednesday that Moscow will seek to extend its gains in Ukraine if Kyiv and its Western allies reject the Kremlin’s demands in peace talks. U.S. President Donald Trump has unleashed an extensive d…",
    "link": "https://www.bostonherald.com/2025/12/17/putin-warns-that-russia-will-seek-to-extend-its-gains-in-ukraine-if-peace-talks-fail/",
    "timestamp": "2025-12-17T13:01:52Z"
  },
  {
    "title": "Putin warns that Russia will seek to extend its gains in Ukraine if peace talks fail",
    "description": "Russian President Vladimir Putin warned Wednesday that Moscow will seek to extend its gains in Ukraine if Kyiv and its Western allies reject the Kremlin's...",
    "link": "https://www.yahoo.com/news/articles/putin-warns-russia-seek-extend-130152417.html",
    "timestamp": "2025-12-17T13:01:52Z"
  },
  {
    "title": "UK's Duke of Marlborough charged with intentional strangulation",
    "description": "LONDON, Dec 17 (Reuters) - Britain's Duke of Marlborough, a distant relative of Winston Churchill, has been charged with three counts of intentional strangulation, British police said on Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/17/uk039s-duke-of-marlborough-charged-with-intentional-strangulation",
    "timestamp": "2025-12-17T13:01:00Z"
  },
  {
    "title": "An A+++++ Economy, My A++ — Trump made big boasts but he isn't delivering (Paul Krugman)",
    "description": "Paul Krugman:\nAn A+++++  Economy, My A++  —  Trump made big boasts but he isn't delivering  —  When Politico recently asked Donald Trump to grade the current U.S. economy, he replied “A-plus-plus-plus-plus-plus.”  He made this boast at a time when actual econ…",
    "link": "https://www.memeorandum.com/251217/p17",
    "timestamp": "2025-12-17T13:00:31Z"
  },
  {
    "title": "The Republican Party Is Fracturing Over Trump's Labor Agenda (Jade Lozada/NOTUS)",
    "description": "Jade Lozada / NOTUS:\nThe Republican Party Is Fracturing Over Trump's Labor Agenda  —  Trump has made several moves undermining unions.  His party isn't coalescing around an agenda.  — Copy  —  Despite President Donald Trump's claims to be a champion for Ameri…",
    "link": "https://www.memeorandum.com/251217/p18",
    "timestamp": "2025-12-17T13:00:31Z"
  },
  {
    "title": "Posthaste: Feel like the cost of living is at its worst? You’re not alone",
    "description": "If you're feeling like the cost of living is pinching you more than ever before, you're not alone, according to new research. Read more.",
    "link": "https://financialpost.com/news/most-canadians-believe-the-cost-of-living-worst-in-memory",
    "timestamp": "2025-12-17T13:00:19Z"
  },
  {
    "title": "Trump Pardoned Fraudsters, Cop-Assaulters And A Drug Lord – Is Ghislaine Maxwell Next?",
    "description": "The president has said he has the right to pardon the world’s most notorious living child sex trafficker and has repeatedly refused to rule it out.",
    "link": "https://www.huffpost.com/entry/trump-maxwell-pardon-possibility_n_693a49a0e4b053d6e8eded7d",
    "timestamp": "2025-12-17T13:00:17Z"
  },
  {
    "title": "Lest We Forget the Horrors: An Unending Catalog of Trump’s Cruelties, Collusions, Corruptions, and Crimes: November 2025: Atrocities 530-580",
    "description": "Early in President Trump’s first term, McSweeney’s editors began to catalog the head-spinning number of misdeeds coming from his administration. We called this list a collection of Trump’s cruelties, collusions, corruptions, and crimes, and it felt urgent to …",
    "link": "https://www.mcsweeneys.net/articles/november-2025-atrocities-530-580",
    "timestamp": "2025-12-17T13:00:00Z"
  },
  {
    "title": "U.S. Blockade Threatens Venezuela's Crucial Russian Naphtha Supply",
    "description": "Venezuela’s supply of Russian naphtha is at risk of crumbling, threatening the South American country’s crude exports, after U.S. President Donald Trump ordered a blockade of sanctioned tankers heading to or departing from Venezuela.  Russian exports of napht…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Blockade-Threatens-Venezuelas-Crucial-Russian-Naphtha-Supply.html",
    "timestamp": "2025-12-17T13:00:00Z"
  },
  {
    "title": "“I Guess They Used AI or Something”: Trump Says BBC Journalists Deepfaked “Words in My Mouth, Literally”",
    "description": "That's not what his own lawsuit alleges.\nThe post “I Guess They Used AI or Something”: Trump Says BBC Journalists Deepfaked “Words in My Mouth, Literally” appeared first on Futurism.",
    "link": "http://futurism.com/artificial-intelligence/trump-bbc-journalists-ai-deepfake",
    "timestamp": "2025-12-17T13:00:00Z"
  },
  {
    "title": "Trump's push to 'knock out' filibuster gains new GOP traction as funding deadline nears",
    "description": "Some Senate Republicans are beginning to shift their position on getting rid of the filibuster after President Donald Trump again called on lawmakers to \"knock out\" the longstanding procedural safeguard.",
    "link": "https://www.foxnews.com/politics/trumps-push-knock-out-filibuster-gains-new-gop-traction-funding-deadline-nears",
    "timestamp": "2025-12-17T12:59:24Z"
  },
  {
    "title": "Mick Foley Leaves WWE After Donald Trump Fallout — Rob Reiner Possibly the Breaking Point No One Saw Coming",
    "description": "Mick Foley confirms he is leaving WWE, citing Donald Trump fallout and comments involving Rob Reiner as the moment that pushed him to step away.",
    "link": "https://www.ibtimes.com/mick-foley-leaves-wwe-after-donald-trump-fallout-rob-reiner-possibly-breaking-point-no-one-saw-3792951",
    "timestamp": "2025-12-17T12:57:08Z"
  },
  {
    "title": "Russian glide bomb attacks in Zaporizhzhia injures 26",
    "description": "Russian glide bomb attacks on apartment blocks in Ukraine's Zaporizhzhia region wounded 26 people, including a child, regional Governor Ivan Fedorov said.",
    "link": "https://www.rte.ie/news/ukraine/2025/1217/1549420-ukraine-russia/",
    "timestamp": "2025-12-17T12:56:03Z"
  }
]