[
  {
    "title": "MTG's farewell gift to Speaker Johnson: Longshot plot to oust him...",
    "description": "Rep. Marjorie Taylor Greene has been gauging whether there's enough support among her GOP colleagues to remove Rep. Mike Johnson from the speakership.",
    "link": "https://www.ms.now/news/marjorie-taylor-greene-mike-johnson-motion-to-vacate",
    "timestamp": "2025-12-12T13:00:15Z"
  },
  {
    "title": "Maduro Accuses U.S. of 'Kidnapping' Crew After Military Seizure of Oil Tanker by U.S.",
    "description": "Maduro also described the operation as a \"military assault, kidnapping and robbery, like Caribbean pirates, against a private commercial vessel\"",
    "link": "https://www.ibtimes.com/maduro-accuses-us-kidnapping-crew-after-military-seizure-oil-tanker-us-3792452",
    "timestamp": "2025-12-12T13:00:04Z"
  },
  {
    "title": "DOGE isn’t dead—it’s been absorbed into the bloodstream of the government, federal employees say",
    "description": "“It’s like taking the dust jacket off of the book and saying, ‘We’ve got rid of the book,’” one federal employee said.",
    "link": "https://fortune.com/2025/12/12/doge-is-still-alive-federal-employees-irs-nih-elon-musk/",
    "timestamp": "2025-12-12T13:00:00Z"
  },
  {
    "title": "The Legend of Barry Bonds, Baseball’s Greatest Antihero",
    "description": "He was the game’s ultimate slugger—and its biggest heel. Two decades after the steroid scandal that upended his career, America still doesn’t know what to do with him.",
    "link": "https://www.theatlantic.com/culture/2025/12/barry-bonds-mlb-hall-of-fame-steroids/685208/",
    "timestamp": "2025-12-12T13:00:00Z"
  },
  {
    "title": "The Washington Post’s Sunday Slobber Over Rosie O’Donnell",
    "description": "The Washington Post would like you to pretend along with them that they’re the essence of fact-based neutrality, that they don’t play favorites. Then you... Read More\nThe post The Washington Post’s Sunday Slobber Over Rosie O’Donnell appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/12/12/washington-posts-sunday-slobber-over-rosie-odonnell/",
    "timestamp": "2025-12-12T13:00:00Z"
  },
  {
    "title": "Church Nativity scenes add zip ties, gas masks and ICE to protest raids",
    "description": "Church Nativity scenes add zip ties, gas masks and ICE to protest raidsbostonherald.com",
    "link": "https://www.bostonherald.com/2025/12/12/us-immigration-enforcement-nativity-protests/",
    "timestamp": "2025-12-12T12:59:40Z"
  },
  {
    "title": "Trump is 'breaking': Analyst says president is being crushed by latest 'failure'",
    "description": "President Donald Trump’s efforts to criminally prosecute his political adversaries have finally “collapsed,” at least according to journalist Jason Easley, who argued the latest court rebuke to the Trump administration to be the final nail in the coffin for t…",
    "link": "https://www.rawstory.com/trump-2674394370/",
    "timestamp": "2025-12-12T12:58:39Z"
  },
  {
    "title": "Inflation is hurting the holiday shopping season, poll finds",
    "description": "Roughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts.",
    "link": "https://www.pennlive.com/business/2025/12/inflation-is-hurting-the-holiday-shopping-season-poll-finds.html",
    "timestamp": "2025-12-12T12:56:46Z"
  },
  {
    "title": "Efforts to require Asian American history in schools after anti-Asian hate starting to pay off",
    "description": "Since pandemic-fueled anti-Asian hate surged in 2020, Asian American, Native Hawaiian and Pacific Islander advocates have mobilized to make AAPI history mandatory learning",
    "link": "https://abcnews.go.com/US/wireStory/efforts-require-asian-american-history-schools-after-anti-128340316",
    "timestamp": "2025-12-12T12:53:55Z"
  },
  {
    "title": "Germany summons Russian ambassador over alleged sabotage, cyberattacks and election interference",
    "description": "BERLIN (AP) — Germany summoned Russia’s ambassador Friday following accusations of sabotage, cyberattacks and election interference, an official said. The German government has also accused Moscow of perpetrating disinformation campaigns. “The goal of these R…",
    "link": "https://financialpost.com/pmn/germany-summons-russian-ambassador-over-alleged-sabotage-cyberattacks-and-election-interference",
    "timestamp": "2025-12-12T12:53:15Z"
  },
  {
    "title": "A U.S.-Saudi Partnership Cannot Be Built on Denial | Opinion",
    "description": "At the recent invitation of President Donald Trump, Saudi Crown Prince Mohammed bin Salman arrived in Washington expecting a victory lap. His visit was engineered to signal a renewed closeness between the United States and Saudi Arabia, with discussions about…",
    "link": "https://biztoc.com/x/c1a935ae16df2f4c",
    "timestamp": "2025-12-12T12:51:19Z"
  },
  {
    "title": "Shoppers say ’tis the season for inflation, an AP-NORC poll finds",
    "description": "By JOSH BOAK and AMELIA THOMSON-DEVEAUX, Associated Press\nWASHINGTON (AP) — This holiday season isn’t quite so merry for American shoppers as large shares are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut u…",
    "link": "https://biztoc.com/x/18c79d7185e92b68",
    "timestamp": "2025-12-12T12:51:16Z"
  },
  {
    "title": "Disguises, freezing waves, and a special forces veteran: Inside rescue to sneak Nobel winner out of Venezuela",
    "description": "The man who led the operation says María Corina Machado crossed “very rough seas” in “pitch-black darkness”.",
    "link": "https://www.bbc.com/news/articles/c4g990exxq4o",
    "timestamp": "2025-12-12T12:51:09Z"
  },
  {
    "title": "Trump Wrings Laughs Out Of Somalia Hate At Congressional Ball",
    "description": "The president included GOP Minnesota Rep. Tom Emmer in his bit as someone yelled, \"Send them home!\"",
    "link": "https://www.huffpost.com/entry/donald-trump-tom-emmer-big-fan-somalia_n_693bf674e4b0898f0300066d",
    "timestamp": "2025-12-12T12:50:33Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Flat-Out Says ‘Trump’s Pressure Campaign Has Failed’ After Redistricting Bombshell",
    "description": "CNN's Kaitlan Collins told viewers flat-out that \"Trump’s pressure campaign has failed\" after a redistricting law he supported went down in flames.\nThe post CNN’s Kaitlan Collins Flat-Out Says ‘Trump’s Pressure Campaign Has Failed’ After Redistricting Bombshe…",
    "link": "https://www.mediaite.com/media/tv/cnns-kaitlan-collins-flat-out-says-trumps-pressure-campaign-has-failed-after-redistricting-bombshell/",
    "timestamp": "2025-12-12T12:48:24Z"
  },
  {
    "title": "Ukraine could join EU by 2027 under draft peace plan",
    "description": "Rapid entry to bloc being discussed by US and Ukrainian officials backed by Brussels in drive to end Russia’s war",
    "link": "https://www.irishtimes.com/world/europe/2025/12/12/ukraine-could-join-eu-by-2027-under-draft-peace-plan/",
    "timestamp": "2025-12-12T12:46:59Z"
  },
  {
    "title": "Time Magazine’s 2025 Persons of the Year are the ‘architects of AI’- boooo",
    "description": "AI has become a chicken/egg dilemma for me. What came first, stupid people who needed AI to do their work for them, or did AI make people dumber? Beyond the Terminator-esque “rise of the machines” aspect of all of this, the economics of AI make little sense t…",
    "link": "https://www.celebitchy.com/953942/time_magazines_2025_persons_of_the_year_are_the_architects_of_ai-_boooo/",
    "timestamp": "2025-12-12T12:45:22Z"
  },
  {
    "title": "'Uh': Onlookers stunned after Trump makes 'bizarrely monstrous' comment about youngest son",
    "description": "Political observers were shocked late on Thursday night when Donald Trump made a comment about his son, Barron, that some deemed to be \"weird.\"At an event, the president said of his wife Melania's most recent project, \"I just heard about that for the first ti…",
    "link": "https://www.rawstory.com/barron-trump-2674393918/",
    "timestamp": "2025-12-12T12:45:12Z"
  },
  {
    "title": "Voltaire, International Newsletter N°155",
    "description": "Our director of publication and editor-in-chief directed French magazines several years ago, and has won journalism awards abroad. He has regularly contributed to some fifteen major dailies and magazines around the world. \nVoltaire, International Newsletter i…",
    "link": "https://www.voltairenet.org/article223360.html",
    "timestamp": "2025-12-12T12:43:33Z"
  },
  {
    "title": "Donald Trump, Security Threat (Paul Krugman)",
    "description": "Paul Krugman:\nDonald Trump, Security Threat  —  The call is coming from inside the White House  —  To update Samuel Johnson, these days national security is the last refuge of a scoundrel.  According to Donald Trump, anything he doesn't like is a threat to na…",
    "link": "https://www.memeorandum.com/251212/p12",
    "timestamp": "2025-12-12T12:40:00Z"
  },
  {
    "title": "Can Anyone Believe Anything?",
    "description": "\"The fire consuming you is the fire that tempers.\" —EKO on \"X\"",
    "link": "https://www.kunstler.com/p/can-anyone-believe-anything",
    "timestamp": "2025-12-12T12:39:04Z"
  },
  {
    "title": "Venezuela's Nobel laureate Machado says she aims for peaceful transition after Maduro",
    "description": "OSLO, Dec 12 (Reuters) - Nobel Peace Prize winner Maria Corina Machado said on Friday that Venezuela's President Nicolas Maduro would leave power, whether there was a negotiated changeover or not, adding that she was focused on achieving a peaceful transition…",
    "link": "https://www.thestar.com.my/news/world/2025/12/12/venezuela039s-nobel-laureate-machado-says-she-aims-for-peaceful-transition-after-maduro",
    "timestamp": "2025-12-12T12:39:00Z"
  },
  {
    "title": "'All bets are off': Abysmal vision shows what happens if Dems squander midterms",
    "description": "Intelligencer writer Adam Kilgore says Friday thaat four years under President Donald Trump felt \"like 40” during his first administration — but that was nothing \"compared to his second.\"In just a year, Kilgore wrote, the nation saw the appointment “of some o…",
    "link": "https://www.rawstory.com/alternet-posts/trump-economy-immigration-medicaid/",
    "timestamp": "2025-12-12T12:38:51Z"
  },
  {
    "title": "Shoppers say ’tis the season for inflation, an AP-NORC poll finds",
    "description": "Roughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts.",
    "link": "https://www.bostonherald.com/2025/12/12/holiday-shopping-inflation-trump-economy/",
    "timestamp": "2025-12-12T12:36:44Z"
  },
  {
    "title": "Deportation Is The Only ‘Due Process’ Illegal Aliens Deserve",
    "description": "How can there be a legal injury in removing a citizen of Somalia, Venezuela, Afghanistan, Mexico, or any other country, from the U.S.?",
    "link": "https://thefederalist.com/2025/12/12/deportation-is-the-only-due-process-illegal-aliens-deserve/",
    "timestamp": "2025-12-12T12:35:57Z"
  },
  {
    "title": "White House denies congresswoman's suggestion that Trump's taking Alzheimer drug",
    "description": "A Democratic lawmaker's \"curious\" theory about President Donald Trump's health forced an official White House denial.Rep. Sydney Kamlager-Dove (D-CA) tweeted last week that the 79-year-old president is showing signs he’s taking the Alzheimer’s disease drug Le…",
    "link": "https://www.rawstory.com/trump-dementia-2674394109/",
    "timestamp": "2025-12-12T12:31:52Z"
  },
  {
    "title": "Donald Trump’s mission to get CNN sold",
    "description": "There’s no doubt about it at this point. President Donald Trump has great interest in what happens to CNN. CNN is a part of Warner Bros. Discovery. And, at the […]\nThe post Donald Trump’s mission to get CNN sold appeared first on Poynter.",
    "link": "https://www.poynter.org/commentary/2025/donald-trumps-mission-to-get-cnn-sold/",
    "timestamp": "2025-12-12T12:30:46Z"
  },
  {
    "title": "The Man Who Broke Offshore Wind",
    "description": "This story was originally published by Canary Media and is reproduced here as part of the Climate Desk collaboration. David Stevenson stood in a circle of friends and colleagues in an Orlando, Florida, hotel lobby. Everyone but him wore a lapel pin that read …",
    "link": "https://www.motherjones.com/politics/2025/12/david-stevenson-conservative-activist-blocking-offshore-wind-farms-donald-trump/",
    "timestamp": "2025-12-12T12:30:00Z"
  },
  {
    "title": "This Young Soccer Squad Has Never Faced a Rival Like Donald Trump",
    "description": "When I first encountered 21-year-old Dilan Pinzón back in April, he was sitting on the sidelines of a soccer field in Oakland, California, clad in cleats and a blue jersey, pondering his team’s fate. It was the third game of the season for Soccer Without Bord…",
    "link": "https://www.motherjones.com/politics/2025/12/soccer-without-borders-academy-immigrants-futbol-unaccompanied-minors-donald-trump-ice-deportations/",
    "timestamp": "2025-12-12T12:30:00Z"
  },
  {
    "title": "Former Iraqi president named next UN refugee chief",
    "description": "Former Iraqi President Barham Salih, who once fled Saddam Hussein’s persecution, has been named the next U.N. High Commissioner for Refugees, marking a break from the long-standing practice of choosing leaders mainly from major European donor countries.",
    "link": "https://www.hurriyetdailynews.com/former-iraqi-president-named-next-un-refugee-chief-216751",
    "timestamp": "2025-12-12T12:27:03Z"
  },
  {
    "title": "Eight wars ended? What’s happened to Trump’s peace deals",
    "description": "US President Donald Trump has claimed to have ended eight wars and secured peace in the Middle East.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/12/eight-wars-ended-whats-happened-to-trumps-peace-deals",
    "timestamp": "2025-12-12T12:26:58Z"
  },
  {
    "title": "Indiana Republicans help defy Trump's push to redistrict House seats, including some who faced bomb threats",
    "description": "Indiana's Republican-led Senate has decisively rejected a redrawn congressional map desired by the White House that would have favoured their party. Two Republicans who received bomb threats amid the highly charged battle were among those voting against the m…",
    "link": "https://www.cbc.ca/news/world/us-indiana-redistricting-vote-9.7013117",
    "timestamp": "2025-12-12T12:18:16Z"
  },
  {
    "title": "White House Signals AI Power Shift to Washington",
    "description": "The long-awaited Federal government campaign to quash state-by-state AI regulations is on. President Donald Trump signed an executive order on Dec. 11 directing the federal government to establish a new national approach to artificial intelligence and to push…",
    "link": "https://biztoc.com/x/4dabbf5c62c019e8",
    "timestamp": "2025-12-12T12:17:55Z"
  },
  {
    "title": "Shoppers say 'tis the season for inflation, an AP-NORC poll finds",
    "description": "A new AP-NORC poll finds this holiday season isn’t quite so merry for American shoppers as large shares of them are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump.",
    "link": "https://www.click2houston.com/business/2025/12/12/shoppers-say-tis-the-season-for-inflation-an-ap-norc-poll-finds/",
    "timestamp": "2025-12-12T12:17:40Z"
  },
  {
    "title": "New York Mandates AI Advertising Disclosures, Faces Showdown Over Trump Executive Order",
    "description": "New York state legislation now mandates AI disclosure in advertising, while SAG-AFTRA lobbies for nationwide No Fakes Act protections.",
    "link": "https://decrypt.co/352132/new-york-mandates-ai-advertising-disclosures-faces-showdown-over-trump-executive-order",
    "timestamp": "2025-12-12T12:16:50Z"
  },
  {
    "title": "Trump targets state AI laws and major flooding in the Pacific Northwest: Morning Rundown",
    "description": "An executive order aims to tackle state regulation on artificial intelligence.",
    "link": "https://www.nbcnews.com/news/us-news/trump-targets-state-ai-laws-major-flooding-pacific-northwest-morning-r-rcna248795",
    "timestamp": "2025-12-12T12:15:04Z"
  },
  {
    "title": "Former Trump appointee raises red flag over 'elderly' president dragging the GOP down",
    "description": "During an appearance on MS NOW on Friday morning, a former Donald Trump appointee to the State Department expressed alarm at the president’s collapse when it comes to addressing voters' concerns and suggested age maybe taking it’s toll.Speaking with “Way Too …",
    "link": "https://www.rawstory.com/trump-decline-2674394086/",
    "timestamp": "2025-12-12T12:12:30Z"
  },
  {
    "title": "Tom Cruise is no longer set to make history in space as the actor's NASA movie with Edge of Tomorrow director has reportedly been scrapped",
    "description": "Tom Cruise was set to star in the first narrative movie filmed in space, but the project is no longer going ahead",
    "link": "https://www.gamesradar.com/entertainment/action-movies/tom-cruise-is-no-longer-set-to-make-history-in-space-as-the-actors-nasa-movie-with-edge-of-tomorrow-director-has-reportedly-been-scrapped/",
    "timestamp": "2025-12-12T12:10:46Z"
  },
  {
    "title": "Most Americans see higher prices for groceries and gifts, poll finds",
    "description": "A new AP-NORC poll finds this holiday season isn’t quite so merry for American shoppers as large shares of them are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump. The vast major…",
    "link": "https://apnews.com/article/poll-economy-inflation-groceries-costs-trump-affordability-d27635d279b27e5e2c19700c006ebb1d",
    "timestamp": "2025-12-12T12:08:22Z"
  },
  {
    "title": "3 theories that explain Trump’s collapsing support",
    "description": "President Donald Trump delivers remarks about his administration's economic agenda and its efforts to lower the cost of living during an event on December 9, 2025, in Mount Pocono, Pennsylvania. | Alex Wong/Getty Images \nThe second Trump administration starte…",
    "link": "https://biztoc.com/x/17c8cd2276b0a9e0",
    "timestamp": "2025-12-12T12:06:43Z"
  },
  {
    "title": "The Call Is Coming From Inside the White House",
    "description": "Paul Krugman: “To update Samuel Johnson, these days national security is the last refuge of a scoundrel. According to Donald Trump, anything he doesn’t like is a threat to national security. Question his clearly illegal tariffs? You’re a dark and sinister for…",
    "link": "https://politicalwire.com/2025/12/12/the-call-is-coming-from-inside-the-white-house/",
    "timestamp": "2025-12-12T12:06:21Z"
  },
  {
    "title": "Crypto CEOs “41-year” prison run rate predicts a brutal future doubling the 83-year record Do Kwon just set",
    "description": "U.S. federal courts have imposed about 83 years of prison terms on crypto company leaders since early 2024. That total grew yesterday with Terraform Labs co-founder Do Kwon’s 15-year sentence tied to the TerraUSD and Luna collapse. Kwon was sentenced in Decem…",
    "link": "https://cryptoslate.com/crypto-ceos-41-year-prison-run-rate-predicts-a-brutal-future-that-doubles-the-83-year-record-do-kwon-just-set/",
    "timestamp": "2025-12-12T12:05:13Z"
  },
  {
    "title": "Shoppers say ’tis the season for inflation, an AP-NORC poll finds",
    "description": "WASHINGTON (AP) — This holiday season isn’t quite so merry for American shoppers as large shares are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump, a new AP-NORC poll finds. The…",
    "link": "https://financialpost.com/pmn/shoppers-say-tis-the-season-for-inflation-an-ap-norc-poll-finds",
    "timestamp": "2025-12-12T12:04:07Z"
  },
  {
    "title": "Killing the penny was just the start. Trump is rewriting the rules on America’s coins | CNN Business",
    "description": "Killing the penny was just the start. Trump is rewriting the rules on America’s coins | CNN Businesscnn.com",
    "link": "https://www.cnn.com/2025/12/12/business/trump-changes-coins-policy",
    "timestamp": "2025-12-12T12:01:40Z"
  },
  {
    "title": "Cheap coffee is winning in grocery aisles — except when shoppers want Starbucks",
    "description": "An InMarket report found that, though consumers favor store brand coffee as prices continue to rise, Starbucks products remain their top choice.",
    "link": "https://www.businessinsider.com/bargain-coffee-versus-starbucks-2025-12",
    "timestamp": "2025-12-12T12:01:01Z"
  },
  {
    "title": "'Trump tells the truth': House Republicans back racist attacks on Somalia, Omar and more",
    "description": "WASHINGTON — President Donald Trump spoke the “unvarnished truth” when he openly complained about immigrants from “sh–hole” countries, one senior U.S. House Republican told Raw Story, amid outcry over the president’s spate of racist remarks.“Trump tells the t…",
    "link": "https://www.rawstory.com/raw-investigates/trump-tells-the-truth-house-gop-doubles-down-over-racist-on-african-countries/",
    "timestamp": "2025-12-12T12:00:15Z"
  },
  {
    "title": "Could 'Trump Gold Card' visas bring in president's predicted profits? What we know",
    "description": "Scores of millionaires could afford the visas, but it was unclear how many would buy them.",
    "link": "https://www.snopes.com//news/2025/12/12/gold-platinum-visas-profits/",
    "timestamp": "2025-12-12T12:00:00Z"
  },
  {
    "title": "Border czar says Catholic leaders should ‘support’ safety",
    "description": "Trump Administration Border Czar Tom Homan speaks to Raymond Arroyo on \"The World Over,\" Thursday, Dec. 11, 2025 / Credit: EWTN News\n\nWashington, D.C. Newsroom, Dec 12, 2025 / 07:00 am (CNA).\nU.S. border czar Tom Homan said “the Catholic Church should support…",
    "link": "https://www.catholicnewsagency.com/news/268419/border-czar-says-catholic-leaders-should-support-safety",
    "timestamp": "2025-12-12T12:00:00Z"
  },
  {
    "title": "Why I Won’t Celebrate the Firing of Racists",
    "description": "The left should be promoting working-class solidarity, not delighting in seeing workers summarily dismissed.",
    "link": "https://www.theatlantic.com/ideas/2025/12/racist-cinnabon-firing-labor-protections/685217/",
    "timestamp": "2025-12-12T12:00:00Z"
  },
  {
    "title": "White House Signals AI Power Shift to Washington",
    "description": "The long-awaited Federal government campaign to quash state-by-state AI regulations is on. President Donald Trump signed an executive order on Dec. 11 directing the federal government to establish a new national approach to artificial intelligence and to push…",
    "link": "https://www.pymnts.com/artificial-intelligence-2/2025/white-house-signals-ai-power-shift-to-washington/",
    "timestamp": "2025-12-12T11:49:35Z"
  },
  {
    "title": "The commitment of Russian assets will change the course of the war in Ukraine, Paris believes",
    "description": "The 27 EU members decided yesterday to maintain the sanctions against Moscow that form the basis of the freezing of Russian assets\nThe post The commitment of Russian assets will change the course of the war in Ukraine, Paris believes appeared first on ProtoTh…",
    "link": "https://en.protothema.gr/2025/12/12/the-commitment-of-russian-assets-will-change-the-course-of-the-war-in-ukraine-paris-believes/",
    "timestamp": "2025-12-12T11:48:29Z"
  },
  {
    "title": "The Empire of Lies Is Once Again Sowing Chaos In Its Own “Back Yard”",
    "description": "This is unlikely to end well for all parties concerned, including the US.",
    "link": "https://www.nakedcapitalism.com/2025/12/the-empire-of-lies-is-once-again-spreading-chaos-in-its-own-back-yard.html",
    "timestamp": "2025-12-12T11:45:38Z"
  },
  {
    "title": "GOP will regret pushing Jasmine Crockett to run for the Senate",
    "description": "Democratic voters want a fighter, and the Texas congresswoman is definitely that",
    "link": "https://www.salon.com/2025/12/12/gop-will-regret-pushing-jasmine-crockett-to-run-for-the-senate/",
    "timestamp": "2025-12-12T11:45:34Z"
  },
  {
    "title": "Trump plans bonfire of US state-level AI regulation",
    "description": "US president’s executive order targets state-level AI regulatory frameworks across the country, saying they are too onerous and endangering leadership in the field",
    "link": "https://www.computerweekly.com/news/366636336/Trump-plans-bonfire-of-US-state-level-AI-regulation",
    "timestamp": "2025-12-12T11:45:00Z"
  },
  {
    "title": "Melania Trump teases new legislative push after passage of anti-revenge porn law",
    "description": "First lady Melania Trump teased her legislative initiative aimed at helping children during the Congressional Ball in the White House on Thursday night.",
    "link": "https://nypost.com/2025/12/12/us-news/melania-trump-teases-new-legislative-push-after-passage-of-anti-revenge-porn-law/",
    "timestamp": "2025-12-12T11:41:55Z"
  },
  {
    "title": "Autopsy Results: Why the Democrats Lost in 2024—And How to Start Winning Again",
    "description": "Why and how did Kamala Harris lose the 2024 presidential race? How can Democrats learn from this preventable loss and turn the tide in 2026 and beyond? Even as this November’s election saw numerous hopeful Democratic victories—most notably the remarkable wins…",
    "link": "https://www.commondreams.org/opinion/democratic-party-autopsy-2024",
    "timestamp": "2025-12-12T11:37:02Z"
  },
  {
    "title": "Transcript: Trump Explodes over Cratering Polls as GOP Losses Worsen",
    "description": "The following is a lightly edited transcript of the December 12 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent.This week…",
    "link": "https://newrepublic.com/article/204332/transcript-trump-explodes-cratering-polls-gop-losses-worsen",
    "timestamp": "2025-12-12T11:34:41Z"
  },
  {
    "title": "US inflation may slow, but the affordability debate is likely to keep raging",
    "description": "Top 3 US Energy Stocks for 2026, According to William Blair\nBy Howard Schneider\nWASHINGTON, Dec 12 (Reuters) - Even if overall inflation slows next year as the U.S. Federal Reserve anticipates, President Donald Trump will still face political headwinds over t…",
    "link": "https://biztoc.com/x/83383f7fb79e9bfb",
    "timestamp": "2025-12-12T11:33:15Z"
  },
  {
    "title": "Colorado Says Trump’s Pardon For Jailed County Clerk Is A ‘Lawless Act’ - Forbes",
    "description": "Colorado Says Trump’s Pardon For Jailed County Clerk Is A ‘Lawless Act’Forbes Trump announces pardon for Tina Peters, increasing pressure to free her though he can’t erase state chargesCNN Trump Symbolically Pardons Tina Peters, Colorado Clerk Convicted of El…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180368569",
    "timestamp": "2025-12-12T11:32:27Z"
  },
  {
    "title": "10 Friday AM Reads",
    "description": "My end-of-week morning train WFH reads: • Howard Marks: Is It a Bubble? Ours is a remarkable moment in world history. A transformative technology is ascending, and its supporters claim it will forever change the world. To build it requires companies to invest…",
    "link": "https://ritholtz.com/2025/12/10-friday-am-reads-479/",
    "timestamp": "2025-12-12T11:30:54Z"
  },
  {
    "title": "Victor Davis Hanson: We’ve Had Enough of the Fraud and Failure to Assimilate",
    "description": "On this episode of “Victor Davis Hanson: In His Own Words,” Victor Davis Hanson and Sami Winc discuss the Democrats’ acceptance of fraud and today’s immigrants... Read More\nThe post Victor Davis Hanson: We’ve Had Enough of the Fraud and Failure to Assimilate …",
    "link": "https://www.dailysignal.com/2025/12/12/victor-davis-hanson-weve-had-enough-of-the-fraud-and-failure-to-assimilate/",
    "timestamp": "2025-12-12T11:30:00Z"
  },
  {
    "title": "UK hits Sudan’s warlords with fresh sanctions",
    "description": "U.K. slaps asset freezes and travel bans on key figures accused of mass killings, sexual violence and targeted attacks on civilians.",
    "link": "https://www.politico.eu/article/uk-hits-sudans-warlords-with-fresh-sanctions/",
    "timestamp": "2025-12-12T11:28:46Z"
  },
  {
    "title": "The Far Right’s Gender Playbook",
    "description": "Around the world, authoritarian leaders are weaponizing gender-based grievances to rally supporters and roll back women’s and LGBTQ+ rights. By casting feminism as a threat to “family stability” and the “moral order,” they seek to shift public sentiment towar…",
    "link": "https://www.project-syndicate.org/onpoint/gender-politics-authoritarians-secret-weapon-by-cynthia-miller-idriss-2025-12",
    "timestamp": "2025-12-12T11:28:33Z"
  },
  {
    "title": "The Indiana GOP Just Told Trump Where to Stick His Gerrymander",
    "description": "Displaying significantly more backbone than usual, Indiana Republicans told Trump they wouldn't illegally gerrymander their state.",
    "link": "https://www.jezebel.com/indiana-gerrymander-vote-redistricting-gop-republicans-trump-senate-defiance",
    "timestamp": "2025-12-12T11:24:47Z"
  },
  {
    "title": "Todd McFarlane Returns To Spider-Man – Daily LITG, 12th December 2025",
    "description": "Todd McFarlane Returns To Spider-Man was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in …",
    "link": "https://bleedingcool.com/comics/todd-mcfarlane-returns-to-spider-man-daily-litg-12th-december-2025/",
    "timestamp": "2025-12-12T11:23:03Z"
  },
  {
    "title": "Americans skeptical of Trump on Epstein, but Republican doubts ease, Reuters/Ipsos poll finds",
    "description": "WASHINGTON, Dec 12 (Reuters) - Americans are deeply skeptical of President Donald Trump's handling of the Jeffrey Epstein scandal, though he is shoring up support among his core Republican followers who have long focused on the case, a new Reuters/Ipsos poll …",
    "link": "https://www.thestar.com.my/news/world/2025/12/12/americans-skeptical-of-trump-on-epstein-but-republican-doubts-ease-reutersipsos-poll-finds",
    "timestamp": "2025-12-12T11:23:00Z"
  },
  {
    "title": "AI Is Powering Trump’s Economy, But American Voterss Are Getting Worried",
    "description": "President Donald Trump is heading into the 2026 election year vowing to pull out all the stops to promote artificial intelligence — just as American voters are starting to voice some doubts.",
    "link": "https://financialpost.com/pmn/business-pmn/ai-is-powering-trumps-economy-but-american-voterss-are-getting-worried",
    "timestamp": "2025-12-12T11:21:56Z"
  },
  {
    "title": "Jimmy Kimmel Mocks Trump’s $1M Gold Card: ‘Never Mind Your Poor and Tired!’",
    "description": "Kimmel lampooned the expedited visa pathway for foreigners willing to pay at least $1 million and jibed that “the best people are the rich people.”\nThe post Jimmy Kimmel Mocks Trump’s $1M Gold Card: ‘Never Mind Your Poor and Tired!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/jimmy-kimmel-mocks-trumps-1m-gold-card-visa-never-mind-your-poor-and-tired/",
    "timestamp": "2025-12-12T11:21:01Z"
  },
  {
    "title": "Lululemon boss to step down early next year",
    "description": "Calvin McDonald's decision to leave at the end of January comes amid a run of poor sales for the firm in the US.",
    "link": "https://www.bbc.com/news/articles/cj388r2dl4ro",
    "timestamp": "2025-12-12T11:19:48Z"
  },
  {
    "title": "Kilmar Abrego Garcia freed from immigration detention on judge’s order — returns to Maryland home",
    "description": "Abrego Garcia had been held at Moshannon Valley Processing Center, about 115 miles northeast of Pittsburgh.",
    "link": "https://nypost.com/2025/12/12/us-news/kilmar-abrego-garcia-freed-from-immigration-detention-on-judges-order-returns-to-maryland-home/",
    "timestamp": "2025-12-12T11:19:36Z"
  },
  {
    "title": "Uncommon Knowledge: Trump Targets His Own Voters’ Cheap Broadband",
    "description": "The affordability crisis is a hoax, according to President Donald Trump, as he repeatedly brushes off the cost-of-living angst that keeps showing up in polls. Voters disagree: a new AP-NORC survey shows approval of his handling of the economy is at 31 percent…",
    "link": "https://biztoc.com/x/40dd8d757235a42c",
    "timestamp": "2025-12-12T11:11:25Z"
  },
  {
    "title": "Trump ran as a friend of the working class — now he’s selling immigration ‘Gold Cards’ for a million bucks",
    "description": "In her 2016 book “Strangers in Their Own Land,” sociologist Arlie Russell Hochschild explored the motivations and terrors that drove Donald Trump’s support among the American working class. \nOne of the central narratives for that support, she realized, was a …",
    "link": "https://biztoc.com/x/1cd6dd46a778d0a0",
    "timestamp": "2025-12-12T11:10:26Z"
  },
  {
    "title": "The America Marc Benioff believes in",
    "description": "Marc Benioff is the textbook example of a California tech entrepreneur who struck Silicon Valley gold.",
    "link": "https://www.washingtonexaminer.com/premium/3914476/america-marc-benioff-believes-in/",
    "timestamp": "2025-12-12T11:08:41Z"
  },
  {
    "title": "UK’s Standard Chartered Partners with AirAsia Founder over Stablecoin Plans",
    "description": "Capital A, the operator behind AirAsia, and Standard Chartered Bank Malaysia signed a letter of intent to launch a ringgit-backed stablecoin. The plan...",
    "link": "https://www.coinspeaker.com/uk-standard-chartered-partners-airasia-founder-stablecoin/",
    "timestamp": "2025-12-12T11:07:43Z"
  },
  {
    "title": "How Indiana's redistricting rejection affects Trump's push nationwide",
    "description": "Indiana's rejection of President Donald Trump's redistricting push makes the math more tenuous for ensuring a Republican majority in Congress.",
    "link": "https://www.indystar.com/story/news/politics/2025/12/12/how-indianas-redistricting-rejection-affects-trumps-push-nationwide/87723995007/",
    "timestamp": "2025-12-12T11:05:59Z"
  },
  {
    "title": "Trump asks when he'll be credited with creating 'perhaps the Greatest Economy' ever in US history",
    "description": "In a Truth Social post President Donald Trump asked when he will be credited for creating \"perhaps the Greatest Economy in the History of our Country.\"",
    "link": "https://www.foxnews.com/politics/trump-asks-when-hell-credited-creating-perhaps-greatest-economy-ever-us-history",
    "timestamp": "2025-12-12T11:05:38Z"
  },
  {
    "title": "Friday links: December 12, 2025",
    "description": "In the face of government oppression, it's time to encrypt.",
    "link": "https://werd.io/friday-links-december-12-2025/",
    "timestamp": "2025-12-12T11:00:47Z"
  },
  {
    "title": "She lost a date over Trump; he swears Liberals won’t date him. The night politics crashed the party scene",
    "description": "Political dating challenges emerge as attendees discuss cross-party relationships, with some facing rejection over Trump support while others remain open.",
    "link": "https://www.foxnews.com/media/she-lost-date-over-trump-he-swears-liberals-wont-date-him-night-politics-crashed-party-scene",
    "timestamp": "2025-12-12T11:00:39Z"
  },
  {
    "title": "What You Will — and Won’t — Find in the Epstein Files",
    "description": "On December 19, at long last, the files will be made public — at least the ones Pam Bondi decides not to hold back, writes legal columnist Elie Honig.",
    "link": "http://nymag.com/intelligencer/article/what-you-will-and-wont-find-in-the-epstein-file-dump.html",
    "timestamp": "2025-12-12T11:00:26Z"
  },
  {
    "title": "Fox News Digital's News Quiz: December 12, 2025",
    "description": "College football coach Sherrone Moore was fired and arrested Wednesday, while actress Amanda Seyfried said she's not apologizing for her comments.",
    "link": "https://www.foxnews.com/lifestyle/fox-news-digital-news-quiz-december-12-2025",
    "timestamp": "2025-12-12T11:00:12Z"
  },
  {
    "title": "Utah Leaders Are Hindering Efforts to Develop Solar Despite a Goal to Double the State’s Energy Supply",
    "description": "Solar power accounts for two-thirds of the new projects waiting to connect to the state’s power grid. Utah Republicans’ hard turn against solar mirrors President Donald Trump’s hostile approach to the industry.",
    "link": "http://www.propublica.org/article/utah-solar-energy-operation-gigawatt-spencer-cox",
    "timestamp": "2025-12-12T11:00:00Z"
  },
  {
    "title": "2025 Was David Lynch",
    "description": "The filmmaker, who died in January, showed us what our world was becoming, and how we should respond, Jessica Winter writes.",
    "link": "https://www.newyorker.com/culture/2025-in-review/2025-was-david-lynch",
    "timestamp": "2025-12-12T11:00:00Z"
  },
  {
    "title": "Tariffs are taxes and they were used to finance the federal government until the 1913 income tax. A top economist breaks it down",
    "description": "The last major U.S. tariff law was the Smoot-Hawley Tariff Act of 1930, which established an average tariff rate of 20% on all imports by 1933.",
    "link": "https://fortune.com/2025/12/12/why-are-tariffs-bad-for-the-economy-taxes-explainer/",
    "timestamp": "2025-12-12T11:00:00Z"
  },
  {
    "title": "America’s Top 100 Charities: A Year Of Pain After Trump Cuts",
    "description": "Save The Children Federation and International Rescue Committee are among the Forbes 2025 Top 100 Charities  scrambling to make up for budget shortfalls.",
    "link": "https://www.forbes.com/sites/williampbarrett/2025/12/12/americas-top-100-charities-a-year-of-pain-after-trump-cuts/",
    "timestamp": "2025-12-12T11:00:00Z"
  },
  {
    "title": "“Trump Has Appointed Himself, Judge, Jury, and Executioner”",
    "description": "The Trump administration is killing civilians in the Caribbean and Pacific and trying to suppress videos of boat strikes and press coverage.\nThe post “Trump Has Appointed Himself, Judge, Jury, and Executioner”  appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/12/12/venezuela-boat-strikes-video-press-coverage/",
    "timestamp": "2025-12-12T11:00:00Z"
  },
  {
    "title": "Inside 1789’s $2 billion bet on ‘patriotic capitalism’",
    "description": "\"Defense tech and re-industrialization of the United States are probably now the most important part of the overall patriotic capitalism bucket,\" Omeed Malik said of 1789's investment ethos.",
    "link": "https://nypost.com/2025/12/12/business/inside-the-2-billion-bet-on-patriotic-capitalism/",
    "timestamp": "2025-12-12T11:00:00Z"
  },
  {
    "title": "Ford, SK On dissolving BlueOval SK battery joint venture",
    "description": "The automaker’s planned investment in the joint venture announced in 2021 was the largest-ever manufacturing commitment in company history, Ford said at the ...",
    "link": "https://www.wardsauto.com/news/ford-skon-dissolving-blueoval-sk-ev-battery-joint-venture/807726/",
    "timestamp": "2025-12-12T11:00:00Z"
  },
  {
    "title": "Trump Reportedly Plans Major Shift To Ease Federal Marijuana Rules",
    "description": "President Donald Trump is reportedly planning to advocate for a significant relaxation of federal regulations on marijuana, a move that could have a substantial impact on the industry.\nPlan to Shift Marijuana to Schedule III\nTrump is expected to direct federa…",
    "link": "https://biztoc.com/x/0e488b1ba7cae4fc",
    "timestamp": "2025-12-12T10:59:42Z"
  },
  {
    "title": "Fiat's adorable 8-horsepower, 28-mph mini car is coming to the USA",
    "description": "Japanese kei cars have a cult following – and for good reason, too. They’re ultra-compact, lightweight vehicles that are essentially designed to meet Japan’s unique “kei” regulations, which cap engine displacement, exterior dimensions, and power output to mak…",
    "link": "https://newatlas.com/automotive/fiat-topolino-confirmed-usa/",
    "timestamp": "2025-12-12T10:57:00Z"
  }
]