[
  {
    "title": "Trump Issues More Letters To Countries In Push For Tariff Deals",
    "description": "US President Donald Trump released a fresh set of letters to trading partners Wednesday, setting out tariff rates for six countries as Washington pushes to bring about a flurry of trade deals.",
    "link": "https://www.ibtimes.com/trump-issues-more-letters-countries-push-tariff-deals-3778006",
    "timestamp": "2025-07-09T16:51:19Z"
  },
  {
    "title": "'A Call to Conscience': Damning Report Shows Every Major US LNG Project Fails Climate Test",
    "description": "As U.S. President Donald Trump ramps up fossil fuel production under his \"drill, baby, drill\" energy policy, a report published Wednesday highlights the climate and financial harms posed by new liquefied natural gas export projects—all of which fail a \"climat…",
    "link": "https://www.commondreams.org/news/a-call-to-conscience-damning-report-shows-every-major-us-lng-project-fails-climate-test",
    "timestamp": "2025-07-09T16:50:57Z"
  },
  {
    "title": "The Supreme Court and Congress have Planned Parenthood in their crosshairs",
    "description": "Trump's budget bill, ruling threaten abortion access",
    "link": "https://theweek.com/politics/supreme-court-congress-planned-parenthood-trump-budget",
    "timestamp": "2025-07-09T16:50:26Z"
  },
  {
    "title": "Israeli strikes kill 40 in Gaza, with no sign of a breakthrough after Trump’s talks with Netanyahu",
    "description": "Included among the killed were 10 from the same family sheltering in a tent.",
    "link": "https://www.bostonherald.com/2025/07/09/mideast-wars-gaza-strikes/",
    "timestamp": "2025-07-09T16:50:06Z"
  },
  {
    "title": "Israeli strikes kill 40 in Gaza, with no sign of a breakthrough after Trump’s talks with Netanyahu",
    "description": "Included among the killed were 10 from the same family sheltering in a tent.",
    "link": "https://www.denverpost.com/2025/07/09/mideast-wars-gaza-strikes/",
    "timestamp": "2025-07-09T16:50:06Z"
  },
  {
    "title": "TikTok prepares U.S.-only app, sources say",
    "description": "TikTok is preparing to launch a standalone app for U.S. users that is expected to operate on a separate algorithm and data system from its global app, laying the groundwork for a potential sale orchestrated by U.S. President Donald Trump, according to people …",
    "link": "https://biztoc.com/x/a31c46a97e398f58",
    "timestamp": "2025-07-09T16:48:38Z"
  },
  {
    "title": "Russia Attacks Ukraine After Trump Pledges More Arms",
    "description": "Russia launched its largest drone assault on Ukraine to date, just hours after U.S. President Donald Trump accused Vladimir Putin of stalling peace talks and pledged more weapons to Kyiv, reported CNN. \nUkraine’s Air Force said it shot down 718 of 728 drones …",
    "link": "https://biztoc.com/x/bd155c9a89379515",
    "timestamp": "2025-07-09T16:48:37Z"
  },
  {
    "title": "Dow Rises as Trump Says More Tariff Letters Are Coming",
    "description": "LIVE UPDATES\nDow Rises as Trump Says More Tariff Letters Are Coming\nThe S&P 500 and Nasdaq were also gaining as investors braced for more trade developments from President Donald Trump.\nLast Updated:\nJuly 9, 2025 at 12:20 PM ET\nKey Events\nPinned Post\nThe stoc…",
    "link": "https://biztoc.com/x/2733462f2ec78254",
    "timestamp": "2025-07-09T16:48:30Z"
  },
  {
    "title": "Trump targets Brunei, Libya and Moldova with latest threat of US tariffs",
    "description": "Latest threats heighten fears that Trump’s erratic trade strategy risks exacerbating inflation across the US\nUS politics live – latest updates\nDonald Trump continued to fire off letters threatening steep US tariffs on foreign exports, targeting countries incl…",
    "link": "https://biztoc.com/x/475b2101f8aef71d",
    "timestamp": "2025-07-09T16:48:23Z"
  },
  {
    "title": "Trump’s trade blitz produces few deals but lots of uncertainty",
    "description": "By PAUL WISEMAN, AP Economics Writer\nWASHINGTON (AP) — President Donald Trump and his advisers promised a lightning round of global trade negotiations with dozens of countries back in April.\nWhite House trade adviser Peter Navarro predicted “90 deals in 90 da…",
    "link": "https://biztoc.com/x/4bca1606f9c4a4d6",
    "timestamp": "2025-07-09T16:48:22Z"
  },
  {
    "title": "‘You Should Be Drinking A Nice Fruit Spritzer’: James Carville Brutally Mocks Dem Messaging To Men",
    "description": "Democratic strategist James Carville ranted for over four minutes on a Tuesday podcast about how the Democratic Party has alienated male voters.",
    "link": "https://dailycaller.com/2025/07/09/james-carville-brutally-mocks-dem-messaging-to-men/",
    "timestamp": "2025-07-09T16:48:18Z"
  },
  {
    "title": "Fears Grow That Texas Floods Death Toll Could Surge",
    "description": "Fears grew Wednesday that the death toll of 110 in the Texas floods could still surge as hopes fade of finding survivors among the many reported still missing several days after the disaster.",
    "link": "https://www.ibtimes.com.au/fears-grow-that-texas-floods-death-toll-could-surge-1859604",
    "timestamp": "2025-07-09T16:48:17Z"
  },
  {
    "title": "Jen Psaki calls out Trump for focusing more on White House redecorating than Texas floods",
    "description": "Jen Psaki called out Trump over comments about White House decor during a Cabinet meeting, as flood rescue efforts in Texas continue.",
    "link": "https://www.msnbc.com/top-stories/latest/jen-psaki-calls-out-trump-over-cabinet-comments-texas-floods-rcna217749",
    "timestamp": "2025-07-09T16:48:07Z"
  },
  {
    "title": "Beer to Boeing jets - Why is Donald Trump and 27-nation bloc EU Tariff trade deal the most important?",
    "description": "USA European Union trade deal has become the most important thing as the EU is the biggest bilateral trading partner of the U.S.",
    "link": "https://economictimes.indiatimes.com/news/international/us/beer-to-boeing-jets-why-is-donald-trump-and-27-nation-bloc-eu-tariff-trade-deal-the-most-important/articleshow/122347713.cms",
    "timestamp": "2025-07-09T16:47:07Z"
  },
  {
    "title": "The career rise of Linda Yaccarino, from NBCU intern to leading Elon Musk's X before stepping down",
    "description": "From her early days as an intern at NBCU to getting hired by Elon Musk to be CEO of X, follow Linda Yaccarino's career rise.",
    "link": "https://www.businessinsider.com/who-is-linda-yaccarino",
    "timestamp": "2025-07-09T16:46:27Z"
  },
  {
    "title": "With new power, Trump will move immediately to lay off federal workers",
    "description": "For now, the Trump administration can continue with a February plan for large-scale layoffs.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/09/trump-wins-broad-authority-to-lay-off-federal-workers-without-congress/84520149007/",
    "timestamp": "2025-07-09T16:45:56Z"
  },
  {
    "title": "New book sheds light on Harris decision to pick Walz as her running mate over Shapiro: 'Went with her gut'",
    "description": "A new book about Kamala Harris' 2024 presidential campaign examines the thought process that went into selecting Minnesota Gov. Tim Walz as her running mate.",
    "link": "https://www.foxnews.com/politics/new-book-sheds-light-harris-decision-pick-walz-as-her-running-mate-over-shapiro-went-with-her-gut",
    "timestamp": "2025-07-09T16:45:53Z"
  },
  {
    "title": "When Texans desperately sought higher ground, Ted Cruz climbed to the Parthenon in Greece",
    "description": "When disaster strikes in Texas\r\n, there’s one thing residents can count on: U.S. Sen. Ted Cruz \r\nwill be far, far away. Possibly somewhere warm. Probably somewhere scenic. Almost certainly lying about it.",
    "link": "https://www.advocate.com/voices/ted-cruz-absent-flooding",
    "timestamp": "2025-07-09T16:44:48Z"
  },
  {
    "title": "What The Big Beautiful Bill Really Means For Billionaires",
    "description": "The newly enacted law has been criticized for disproportionately benefiting the ultra-wealthy. But billionaires aren’t necessarily thrilled.",
    "link": "https://www.forbes.com/sites/martinadilicosa/2025/07/09/what-the-big-beautiful-bill-really-means-for-billionaires/",
    "timestamp": "2025-07-09T16:44:11Z"
  },
  {
    "title": "Closing NATO’s Indo-Pacific Gap",
    "description": "European allies should strengthen NATO’s Indo-Pacific ties as Washington wavers.",
    "link": "http://foreignpolicy.com/2025/07/09/nato-china-indo-pacific-australia-japan-trump/",
    "timestamp": "2025-07-09T16:44:02Z"
  },
  {
    "title": "Trump Moving To Slap U.S. Sanctions On Prominent U.N. Official Critical Of Israel",
    "description": "The expected move against Francesca Albanese comes amid a Washington visit by Israeli Prime Minister Benjamin Netanyahu.",
    "link": "https://www.huffpost.com/entry/francesca-albanese-sanctions-trump_n_686e8d35e4b07e11dd9a37f1",
    "timestamp": "2025-07-09T16:42:34Z"
  },
  {
    "title": "Trump’s trade blitz produces few deals but lots of uncertainty",
    "description": "After 90 days, the tally of trade deals stands at two.",
    "link": "https://www.denverpost.com/2025/07/09/trump-trade-talks/",
    "timestamp": "2025-07-09T16:41:42Z"
  },
  {
    "title": "Trump’s trade blitz produces few deals but lots of uncertainty",
    "description": "After 90 days, the tally of trade deals stands at two.",
    "link": "https://www.bostonherald.com/2025/07/09/trump-trade-talks/",
    "timestamp": "2025-07-09T16:41:42Z"
  },
  {
    "title": "Linda Yaccarino steps down as chief executive of X",
    "description": "Former NBCUniversal executive leaves platform after two years",
    "link": "https://www.irishtimes.com/business/2025/07/09/linda-yaccarino-steps-down-as-chief-executive-of-x/",
    "timestamp": "2025-07-09T16:41:39Z"
  },
  {
    "title": "Nicki Minaj Claims She Was \"Attacked\" by Democrats over Her Cousin's Friend's Balls, JAY-Z Owes Her $200 Million",
    "description": "Nicki Minaj has a long history of inciting beef and generally crashing out on the social media platform formerly known as Twitter. Back in",
    "link": "https://exclaim.ca/music/article/nicki-minaj-claims-she-was-attacked-by-democrats-over-her-cousin-s-friend-s-balls-jay-z-owes-her-200-million",
    "timestamp": "2025-07-09T16:41:37Z"
  },
  {
    "title": "Schumer: Trump Is 88 Countries Short of Promise",
    "description": "President Trump sent tariff letters to six more countries Wednesday as Senate Minority Leader Chuck Schumer criticized him for falling 88 countries short of his goal of 90 trade deals. \"Ninety days ago Donald Trump promised the world that his tariffs would le…",
    "link": "https://www.newser.com/story/371610/trump-sends-tariff-letters-to-6-more-countries.html",
    "timestamp": "2025-07-09T16:40:45Z"
  },
  {
    "title": "Deep State Launches Purge Against Key Trump Nominee",
    "description": "The deep state blob is highly resistant to change, especially when that change threatens to upend years of accepted D.C. wisdom and policy.",
    "link": "https://dailycaller.com/2025/07/09/deep-state-purge-elbridge-colby-dod-china-ukraine/",
    "timestamp": "2025-07-09T16:40:26Z"
  },
  {
    "title": "Ex-Trump adviser 'confused' president is 'jeopardizing it all' with latest moves",
    "description": "c, the former chief of staff to ex-Vice President Mike Pence in the first Trump term, said that he can't understand why President Donald Trump is putting any of his successes in jeopardy with his trade war. July 9 marked the end of Trump's \"90 Deals in 90 Day…",
    "link": "https://www.rawstory.com/trump-trade-war-2673041427/",
    "timestamp": "2025-07-09T16:38:47Z"
  },
  {
    "title": "U.K. Preparing for Trump Visit",
    "description": "Plans are being drawn up for a potential Donald Trump visit to the U.K. in the coming weeks -- perhaps at the end of July or beginning of August, Sky News reports.",
    "link": "https://politicalwire.com/2025/07/09/u-k-preparing-for-trump-visit/",
    "timestamp": "2025-07-09T16:38:20Z"
  },
  {
    "title": "Trump’s sweeping tariffs may overshadow Rubio’s official trip to Asia",
    "description": "The Trump administration is seeking to boost relations with Indo-Pacific nations to counter China's growing influence in the region. Trump on Monday sent notice to several countries about higher tariffs if they don't make trade deals with the U.S.",
    "link": "https://www.pbs.org/newshour/politics/trumps-sweeping-tariffs-may-overshadow-rubios-official-trip-to-asia",
    "timestamp": "2025-07-09T16:37:59Z"
  },
  {
    "title": "The 1600: Trump's Epstein Mess",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-trumps-epstein-mess-2096798",
    "timestamp": "2025-07-09T16:37:42Z"
  },
  {
    "title": "Trump’s 200% tariff threat could send shockwaves through pharma supply chains",
    "description": "US President Donald Trump's 200% tariff threat on the pharmaceutical industry is a \"shock\" that will reverberate through global supply chains.\nSpeaking at the White House on 8 July, Trump said: “We’ll be announcing something very soon on pharmaceuticals. We’r…",
    "link": "https://biztoc.com/x/cd79e94598b2d0f5",
    "timestamp": "2025-07-09T16:37:34Z"
  },
  {
    "title": "Netanyahu’s Washington visit: A diplomatic balancing act of hope and peril",
    "description": "History will judge Trump and Netanyahu not by their handshakes and public camaraderie, but by whether they secured Israel’s future while upholding the values that have long defined its alliance with the United States. Opposition.",
    "link": "https://www.israelnationalnews.com/news/411403",
    "timestamp": "2025-07-09T16:36:00Z"
  },
  {
    "title": "US to Impose 30% Tariff on Algeria, Libya, Iraq Starting from August 1",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump on Wednesday sent trade letters to Algeria, Libya, and Iraq, announcing that the countries will be subjected to a 30% tariff on exports to the United States.",
    "link": "https://sputnikglobe.com/20250709/us-to-impose-30-tariff-on-algeria-libya-iraq-starting-from-august-1---1122419134.html",
    "timestamp": "2025-07-09T16:35:44Z"
  },
  {
    "title": "Student loans are about to get worse",
    "description": "University tuition in the United States is notoriously expensive — so much so that Americans currently have over $1.6 trillion in student loan debt. But now, the routine process of taking out student loans has been overhauled as a result of the One Big Beauti…",
    "link": "https://www.vox.com/policy/419317/student-loans-big-beautiful-bill-trump",
    "timestamp": "2025-07-09T16:33:30Z"
  },
  {
    "title": "Trump Shuts Down Reporter Asking About Epstein Client List",
    "description": "Trump famously said that Epstein was a \"fun\" guy who liked women as much as he did — and liked them young.",
    "link": "https://littlethings.com/entertainment/trump-lashes-out-at-reporter-for-asking-about-epstein-client-list",
    "timestamp": "2025-07-09T16:32:47Z"
  },
  {
    "title": "Cronos Jumps 18% After Trump Media ETF Proposal Lists Token Among Holdings",
    "description": "The token surged after a proposed ETF backed by Trump Media included CRO alongside bitcoin, ether, solana and XRP.",
    "link": "https://www.coindesk.com/markets/2025/07/09/cronos-jumps-18-after-trump-media-etf-proposal-lists-token-among-holdings",
    "timestamp": "2025-07-09T16:32:39Z"
  },
  {
    "title": "1st LD: Trump sends tariff letters to 6 more countries",
    "description": "NEW YORK, July 9 (Xinhua) -- U.S. President Donald Trump sent letters to the leaders of six more countries Wednesday morning, notifying them that new tariffs will be charged on goods imported by the United States from these countries starting Aug. 1. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/07/10/1st-ld-trump-sends-tariff-letters-to-6-more-countries",
    "timestamp": "2025-07-09T16:32:00Z"
  },
  {
    "title": "The Great Disappointment",
    "description": "Nick Cattogio points out that Jeffrey Epstein’s client list was \"the moral pillar\" upon which Donald Trump’s \"authoritarian pretensions rested.\" “If Trump won, the thousands of predators who supposedly populate our elite institutions would be",
    "link": "https://politicalwire.com/2025/07/09/the-great-disappointment/",
    "timestamp": "2025-07-09T16:31:36Z"
  },
  {
    "title": "'Are you nuts?' Steve Bannon calls on Trump to strip Musk of federal contracts",
    "description": "MAGA influencer Steve Bannon argued that President Donald Trump's administration should move to strip Elon Musk's federal contracts after he floated launching a new political party.On his Wednesday War Room podcast, Bannon noted that Linda Yaccarino, the CEO …",
    "link": "https://www.rawstory.com/steve-bannon-elon-musk-contracts/",
    "timestamp": "2025-07-09T16:31:29Z"
  },
  {
    "title": "10 Actions Black Business Owners Can Take To Lessen The Sting Of Tariffs",
    "description": "Tariffs are making it more costly for small businesses to buy imported goods and are creating operational hurdles.",
    "link": "https://finance.yahoo.com/news/10-actions-black-business-owners-163056410.html",
    "timestamp": "2025-07-09T16:30:56Z"
  },
  {
    "title": "Stalin of the EU: How the unelected Queen of the Union plans to keep her grip on power",
    "description": "If Brussels followed its professed ideals, the European Commission and its head would fall Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621229-eu-leyen-no-confidence/",
    "timestamp": "2025-07-09T16:30:47Z"
  },
  {
    "title": "Bitcoin Asia 2025: Eric Trump To Address Hong Kong’s Growing Role In Crypto",
    "description": "Eric Trump, son of President Donald Trump, is set to make headlines next month when speaking at the Bitcoin Asia 2025 conference in Hong Kong, amid the presidential family’s growing interest in digital assets. This event aims to establish the city as a leadin…",
    "link": "https://bitcoinist.com/bitcoin-asia-2025-eric-trump-to-address-hong-kong/",
    "timestamp": "2025-07-09T16:30:15Z"
  },
  {
    "title": "Texas flooding, and politics around it, underscore challenges Trump faces in replacing FEMA",
    "description": "After months of promises to overhaul or eliminate FEMA, Trump and his administration are touting a fast and robust federal response to the devastating Texas floods.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_c357f7a7-23aa-5912-a70b-868702e4828b.html",
    "timestamp": "2025-07-09T16:30:00Z"
  },
  {
    "title": "Terry Gilliam Says Trump’s Return Ruined His Anti-Woke Comedy",
    "description": "By\n Matt Solomon\n Published: July 09th, 2025",
    "link": "https://www.cracked.com/article_47280_terry-gilliam-says-trumps-return-ruined-his-anti-woke-comedy.html",
    "timestamp": "2025-07-09T16:30:00Z"
  },
  {
    "title": "The Protocol: Vitalik Buterin's Latest Proposal – Transaction Gas Cap",
    "description": "Also: Jack Dorsey’s Bitchat, Volkswagen and Hivemapper Team Up, and EigenLabs Layoffs.",
    "link": "https://www.coindesk.com/tech/2025/07/09/the-protocol-vitalik-buterin-s-latest-proposal-transaction-gas-cap",
    "timestamp": "2025-07-09T16:29:24Z"
  },
  {
    "title": "Trump sent copper prices soaring to records with talk of new tariffs. Morgan Stanley flags 2 companies set to benefit.",
    "description": "Trump said on Tuesday that he would impose a 50% tariff on copper. Though the remarks were light on specifics, his comments sent the metal to all-time highs.",
    "link": "https://www.businessinsider.com/copper-prices-trump-tariffs-commodities-trade-war-fcx-scco-2025-7",
    "timestamp": "2025-07-09T16:29:05Z"
  },
  {
    "title": "Linda Yaccarino steps down as CEO of X",
    "description": "Yaccarino wrote on X that she will ‘cheer’ on the company’s remaining team as they ‘continue to change the world.’",
    "link": "https://www.campaignlive.com/article/linda-yaccarino-steps-down-ceo-x/1924947",
    "timestamp": "2025-07-09T16:28:32Z"
  },
  {
    "title": "Trump sends out tariff letters to 6 more countries but he avoids major US trade partners",
    "description": "President Donald Trump sent out tariff letters to six smaller U.S. trading partners on Wednesday with a pledge to announce import taxes on other countries...",
    "link": "https://www.yahoo.com/news/trump-sends-tariff-letters-6-162818040.html",
    "timestamp": "2025-07-09T16:28:18Z"
  },
  {
    "title": "El Salvador Throws DOJ Under The Bus: Tells UN That US Has “Exclusive” Jurisdiction Over Renditioned Detainees",
    "description": "For months, the DOJ has insisted to US courts that it has no jurisdiction over the people it rendered to Salvadoran detention facilities. But when the UN came asking, El Salvador told a very different story: these detainees are “exclusively” under US jurisdic…",
    "link": "https://www.techdirt.com/2025/07/09/el-salvador-throws-doj-under-the-bus-tells-un-that-us-has-exclusive-jurisdiction-over-renditioned-detainees/",
    "timestamp": "2025-07-09T16:28:02Z"
  },
  {
    "title": "Open to supply products to US mkt from multiple sites, India based on tariff outcomes: Samsung",
    "description": "Samsung is preparing to shift its US-bound production to factories in India and other locations in response to potential trade policy changes under the Trump administration. This strategic move aims to mitigate risks associated with new tariffs and ensure bus…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/open-to-supply-products-to-us-mkt-from-multiple-sites-india-based-on-tariff-outcomes-samsung/articleshow/122347543.cms",
    "timestamp": "2025-07-09T16:27:36Z"
  },
  {
    "title": "US firms dodging restrictions to get China’s minerals – Reuters",
    "description": "Customs data shows a surge in shipments of key Chinese metals via Thailand and Mexico Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621255-us-firms-dodge-restrictions-china-minerals/",
    "timestamp": "2025-07-09T16:27:14Z"
  },
  {
    "title": "No detailed discussion on Trump tariffs at 58th AMM: minister",
    "description": "Foreign Affairs Minister Sugiono has said that the 58th ASEAN Foreign Ministers&rsquo; Meeting (AMM) did not discuss the import tariffs imposed by US ...",
    "link": "https://en.antaranews.com/news/365221/no-detailed-discussion-on-trump-tariffs-at-58th-amm-minister",
    "timestamp": "2025-07-09T16:26:22Z"
  },
  {
    "title": "3 of the Worst Examples of Military Spending in the 'Big, Beautiful Bill'",
    "description": "President Donald Trump signed the One Big Beautiful Bill Act (OBBBA) into law on July 4. The 870-page spending legislation directs $157 billion to the already-bloated military-industrial complex. The following are a few of the most egregious examples of waste…",
    "link": "https://biztoc.com/x/240fb2ec772bbe4c",
    "timestamp": "2025-07-09T16:26:21Z"
  },
  {
    "title": "Trump Sends More Letters Outlining New US Tariff Rates",
    "description": "Trump Sends More Letters Outlining New US Tariff Ratestheepochtimes.com",
    "link": "https://www.theepochtimes.com/business/trump-sends-more-letters-outlining-new-us-tariff-rates-5884950",
    "timestamp": "2025-07-09T16:25:32Z"
  },
  {
    "title": "'As Insulting as It Gets': ABC News Quietly Edits Piece Calling Israeli Hostages 'Detainees'",
    "description": "ABC News in a Tuesday article referred to the Israeli hostages who remain in Hamas captivity as “detainees,\" then quietly changed the language, issuing only a vague editor's note at the bottom of the piece that did not refer to the original wording.\nThe post …",
    "link": "https://freebeacon.com/latest-news/as-insulting-as-it-gets-abc-news-quietly-edits-piece-calling-israeli-hostages-detainees/",
    "timestamp": "2025-07-09T16:25:29Z"
  },
  {
    "title": "Trump’s 200% tariff threat could send shockwaves through pharma supply chains",
    "description": "Despite the threat of a 200% tariff, most pharma stocks remained stable.",
    "link": "https://www.pharmaceutical-technology.com/news/trumps-200-tariff-threat-could-send-shockwaves-through-pharma-supply-chains/",
    "timestamp": "2025-07-09T16:23:25Z"
  },
  {
    "title": "Trump’s 200% tariff threat could send shockwaves through pharma supply chains",
    "description": "Despite the threat of a 200% tariff, most pharma stocks remained stable.",
    "link": "https://www.clinicaltrialsarena.com/news/trumps-200-tariff-threat-could-send-shockwaves-through-pharma-supply-chains/",
    "timestamp": "2025-07-09T16:23:25Z"
  },
  {
    "title": "UPDATE: Biden's doctor refuses to testify to Congress about ex-president's health...",
    "description": "UPDATE: Biden's doctor refuses to testify to Congress about ex-president's health...\r\n\n \n \n \n (Third column, 8th story, link)\r\n\n \r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.the-sun.com/news/14665400/joe-biden-doctor-kevin-oconnor-hearing-congress-health/",
    "timestamp": "2025-07-09T16:22:39Z"
  },
  {
    "title": "US Stocks Climb as Traders Sift Tariff News, Look to Fed Minutes",
    "description": "US equities inched higher as traders continued to assess the constant stream of tariff news and waited for potential insight on rate trajectories from the Federal Reserve’s meeting minutes.",
    "link": "https://financialpost.com/pmn/business-pmn/us-stocks-climb-as-traders-sift-tariff-news-look-to-fed-minutes",
    "timestamp": "2025-07-09T16:22:35Z"
  },
  {
    "title": "Sun Valley: From Navigating Trump to AI Fears, Here’s What’s on the Minds of Media Moguls",
    "description": "Forgive the media moguls if they don’t have their usual Masters of the Universe swagger when they touch down in Sun Valley this week for Allen & Co.’s annual conference. The event, dubbed “summer camp for billionaires,” is the place to be seen for business le…",
    "link": "https://variety.com/2025/biz/news/sun-valley-donald-trump-ai-bob-iger-media-moguls-1236450830/",
    "timestamp": "2025-07-09T16:22:22Z"
  },
  {
    "title": "3 of the Worst Examples of Military Spending in the 'Big, Beautiful Bill'",
    "description": "The 870-page spending legislation directs $157 billion to the already-bloated military-industrial complex. What are the worst costs?",
    "link": "https://reason.com/2025/07/09/3-of-the-worst-examples-of-military-spending-in-the-big-beautiful-bill/",
    "timestamp": "2025-07-09T16:21:12Z"
  },
  {
    "title": "Texas flooding, and politics around it, underscore the challenges Trump faces in replacing FEMA",
    "description": "Just weeks ago, Trump said he wanted to begin “phasing out” FEMA.",
    "link": "https://www.bostonherald.com/2025/07/09/texas-flooding-fema/",
    "timestamp": "2025-07-09T16:20:58Z"
  },
  {
    "title": "Texas flooding, and politics around it, underscore the challenges Trump faces in replacing FEMA",
    "description": "Just weeks ago, Trump said he wanted to begin “phasing out” FEMA.",
    "link": "https://www.denverpost.com/2025/07/09/texas-flooding-fema/",
    "timestamp": "2025-07-09T16:20:58Z"
  },
  {
    "title": "This U.N. document undercuts Trump’s darkest mass deportation claims",
    "description": "Trump's Justice Department has said Venezuelans deported to El Salvador's CECOT mega-prison are out of U.S. reach. A new United Nations report says otherwise.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-deportations-el-salvador-prison-immigration-un-document-rcna217502",
    "timestamp": "2025-07-09T16:19:40Z"
  },
  {
    "title": "BNB Climbs as Faster Blocks and Tokenized Stocks Spark Investor Interest",
    "description": "The recent Maxwell hard fork, which reduced block times, and the introduction of tokenized equities by Kraken and Backed Finance, have contributed to this growth.",
    "link": "https://www.coindesk.com/markets/2025/07/09/bnb-climbs-as-faster-blocks-and-tokenized-stocks-spark-investor-interest",
    "timestamp": "2025-07-09T16:18:47Z"
  },
  {
    "title": "Libs Publicly Call for Vance’s Assassination",
    "description": "You can see why liberals hate JD Vance. Smart as a whip, articulate, and principled, he is a potent political force opposed to their objectives. What is harder to understand — in light of at least four attempts to kill Donald Trump — is why they are allowed t…",
    "link": "https://moonbattery.com/libs-publicly-call-for-vances-assassination/",
    "timestamp": "2025-07-09T16:18:29Z"
  },
  {
    "title": "Crypto Industry Pitches Market Structure Ideas to U.S. Senators in Hearing",
    "description": "In the runup to 'Crypto Week' in the House next week, a Senate Banking Committee hearing dug into policy ideas as Senator Warren flagged Trump \"corruption.\"",
    "link": "https://www.coindesk.com/policy/2025/07/09/crypto-industry-pitches-market-structure-ideas-to-u-s-senators-in-hearing",
    "timestamp": "2025-07-09T16:17:49Z"
  },
  {
    "title": "What Are the Chances for Peace in Ukraine Right Now?",
    "description": "David Goeßmann: The talks a few weeks ago between Russia and Ukraine in Istanbul came to nothing. What are the chances for peace?Anatol Lieven: I see no prospect for an end to the war at present. Russia and Ukraine remain far apart on peace terms, and the Tru…",
    "link": "https://www.commondreams.org/opinion/peace-in-ukraine-2673041453",
    "timestamp": "2025-07-09T16:16:43Z"
  },
  {
    "title": "Biden White House Leak Reveals Advisers Urged Early Debate",
    "description": "By George Caldwell, The Daily Signal | July 07, 2025\n A newly leaked White House memo from April 2024 reveals that former President Joe Biden’s advisers urged him to debate now-President Donald Trump early in the election cycle to “reach the widest audience p…",
    "link": "https://biztoc.com/x/3890519c82ba3557",
    "timestamp": "2025-07-09T16:15:20Z"
  },
  {
    "title": "EU eyes quick trade deal as Trump announces more tariffs",
    "description": "The EU says a trade deal with the US could be days away as Trump has threatened fresh tariffs. Several new duties were announced after the US president said he would hit partners like Japan and South Korea from August 1.",
    "link": "https://www.dw.com/en/eu-eyes-quick-trade-deal-as-trump-announces-more-tariffs/a-73218680",
    "timestamp": "2025-07-09T16:15:00Z"
  },
  {
    "title": "New Round Of Trump Tariffs Hits Brunei, Iraq, Libya",
    "description": "President Donald Trump announced new tariffs on six additional countries Tuesday via a series of posts on Truth Social, as part of his broader trade pressure campaign. The letters, addressed to the heads of state, outlined specific tariff rates on goods expor…",
    "link": "https://biztoc.com/x/8e2a112c8769c4f9",
    "timestamp": "2025-07-09T16:14:47Z"
  },
  {
    "title": "Kara Swisher Argues Linda Yaccarino Didn’t Leave X Over Grok’s ‘MechaHitler Controversy’",
    "description": "“The MechaHitler controversy was not it btw,\" Swisher said of Yaccarino's sudden departure from X\nThe post Kara Swisher Argues Linda Yaccarino Didn’t Leave X Over Grok’s ‘MechaHitler Controversy’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/kara-swisher-argues-linda-yaccarino-didnt-leave-x-over-groks-mechahitler-controversy/",
    "timestamp": "2025-07-09T16:14:37Z"
  },
  {
    "title": "Türkiye’s Deterrence in the Age of Instability and Global Collapse. Ret. Adm. Cem Gurdeniz",
    "description": "Türkiye was integrated into the West within the scope of NATO membership after World War II and the rimland geopolitics shaped on the USA’s hostility to communism and the USSR. \nAfter the coup d’état of September 12, 1980, secularism was …\nThe post Türkiye’s …",
    "link": "https://www.globalresearch.ca/turkiye-deterrence-age-irregularity-global-collapse/5894413",
    "timestamp": "2025-07-09T16:13:47Z"
  },
  {
    "title": "College Student in Green Card Process Detained by ICE",
    "description": "Sara Lizeth Lopez Garcia, 20, a student at New York's Suffolk County Community College is being held by ICE in Louisiana.",
    "link": "https://www.newsweek.com/college-student-green-card-process-detained-ice-2096665",
    "timestamp": "2025-07-09T16:12:32Z"
  },
  {
    "title": "Open Letter Backs Sequoia’s Maguire After Mamdani ‘Islamist’ Comments",
    "description": "The open letter criticizes the backlash against Maguire as “ideological mobbing disguised as a moral virtue.”",
    "link": "https://www.forbes.com/sites/conormurray/2025/07/09/open-letter-backs-sequoias-maguire-after-mamdani-islamist-comments/",
    "timestamp": "2025-07-09T16:12:24Z"
  },
  {
    "title": "The ‘Russia Hoax,’ Revisited",
    "description": "CIA Director John Ratcliffe wants to rewrite history.",
    "link": "https://www.theatlantic.com/national-security/archive/2025/07/cia-note-russia-hoax/683464/",
    "timestamp": "2025-07-09T16:11:00Z"
  },
  {
    "title": "Trump warns New York City faces dire future if 'communist' Mamdani takes office as mayor",
    "description": "Trump labels New York City Democratic mayoral nominee Zohran Mamdani a \"communist\" as Republicans aim to paint the progressive assemblyman as an extremist ahead of midterm elections.",
    "link": "https://www.foxnews.com/politics/trump-warns-new-york-city-faces-dire-future-communist-mamdani-takes-office-mayor",
    "timestamp": "2025-07-09T16:10:58Z"
  },
  {
    "title": "InnovationRx: The Secretive Company Hawking Bad Health Advice On Facebook",
    "description": "In this week’s edition of InnovationRx, we look at Immuneering’s slow-and-steady approach to cancer fighting, litigation over vaccine limits, venture funding for digital health, and more.",
    "link": "https://www.forbes.com/sites/innovationrx/2025/07/09/innovationrx-the-secretive-company-hawking-bad-health-advice-on-facebook/",
    "timestamp": "2025-07-09T16:09:52Z"
  },
  {
    "title": "India in a wait and watch mode as Trump prepares more tariff letters",
    "description": "India waits as Trump sends tariff letters to more countries, including the Philippines, with a deadline of August 1.",
    "link": "https://www.thehindubusinessline.com/economy/india-in-a-wait-and-watch-mode-as-trump-prepares-more-tariff-letters/article69793173.ece",
    "timestamp": "2025-07-09T16:09:24Z"
  },
  {
    "title": "Selected Articles: From “Fake Peace” to “Real War”: Obama’s One Trillion Dollar “Humanitarian” Nuclear Weapons Program",
    "description": "From “Fake Peace” to “Real War”: Obama’s One Trillion Dollar “Humanitarian” Nuclear Weapons Program. Prevent Al Qaeda Terrorists from Acquiring Nukes\nBy Prof Michel Chossudovsky, July 09, 2025\nPresident Obama in 2010 pointed  to Al Qaeda’s intent to Acquire ……",
    "link": "https://www.globalresearch.ca/selected-articles-obama-one-trillion-dollar-humanitarian-nuclear-weapons-program/5894449",
    "timestamp": "2025-07-09T16:09:22Z"
  },
  {
    "title": "The Brief – How the far right just spiced up European politics",
    "description": "The lively debate on von der Leyen’s doomed censure lit up a Parliament languishing on the EU’s sidelines. Pro-EU MEPs should now reclaim the political theatre.",
    "link": "https://www.euractiv.com/section/politics/opinion/the-brief-how-the-far-right-just-spiced-up-european-politics/",
    "timestamp": "2025-07-09T16:09:14Z"
  },
  {
    "title": "DEI Hire Ketanji Brown Jackson: I Write Supreme Court Opinions To ‘Tell People How I Feel’",
    "description": "On Saturday, Justice Ketanji Brown Jackson said SCOTUS opinions give her the chance to tell people how she 'feel[s] about the issues.'",
    "link": "https://thefederalist.com/2025/07/09/dei-hire-ketanji-brown-jackson-i-write-supreme-court-opinions-to-tell-people-how-i-feel/",
    "timestamp": "2025-07-09T16:08:35Z"
  },
  {
    "title": "Trump administration sues California over transgender athletes",
    "description": "President Donald Trump's administration sued the California Department of Education on Wednesday for allowing transgender girls to compete on girls sports teams, alleging the policy violates federal law.",
    "link": "https://www.kcra.com/article/trump-administration-sues-california-transgender-athletes/65352499",
    "timestamp": "2025-07-09T16:08:08Z"
  },
  {
    "title": "WATCH LIVE: Trump hosts West African leaders as region hit by U.S. aid cuts",
    "description": "The surprise meeting with the leaders of Liberia, Senegal, Gabon, Mauritania and Guinea-Bissau comes after sweeping U.S. aid cuts and the dismantling of the U.S. Agency for International Development.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-hosts-west-african-leaders-as-region-hit-by-u-s-aid-cuts",
    "timestamp": "2025-07-09T16:06:44Z"
  },
  {
    "title": "'Who is this guy?' Insiders describe chaos as Pete Hegseth aide goes rogue",
    "description": "Donald Trump's Pentagon is in disarray as Defense Secretary Pete Hegseth's top policy chief has gone rogue, blindsiding White House officials and foreign allies with unauthorized foreign policy decisions that have sent shockwaves through the administration, a…",
    "link": "https://www.rawstory.com/hegseth-aide-pentagon/",
    "timestamp": "2025-07-09T16:06:42Z"
  },
  {
    "title": "Elon Musk Reacts Tersely to Resignation of X CEO Amid Nazi Grok Scandal",
    "description": "Elon Musk offered a terse reaction to his X CEO Linda Yaccarino stepping down following controversies erupting over the social media platform's AI assistant.\nThe post Elon Musk Reacts Tersely to Resignation of X CEO Amid Nazi Grok Scandal first appeared on Me…",
    "link": "https://www.mediaite.com/media/news/elon-musk-reacts-tersely-to-resignation-of-x-ceo-amid-nazi-grok-scandal/",
    "timestamp": "2025-07-09T16:06:15Z"
  },
  {
    "title": "Russia batters Ukraine with more than 700 drones, the largest barrage of the war, as attacks intensify",
    "description": "According to Ukrainian President Volodymyr Zelenskyy, the city of Lutsk was the hardest hit. It lies near the border with Poland in western Ukraine, a region that is a crucial hub for receiving foreign military aid.",
    "link": "https://www.pbs.org/newshour/world/russia-batters-ukraine-with-more-than-700-drones-the-largest-barrage-of-the-war-as-attacks-intensify",
    "timestamp": "2025-07-09T16:06:03Z"
  },
  {
    "title": "Florida bishop: No problem with removing criminals, but ‘Alligator Alcatraz’ is troubling",
    "description": "Rows of bunk beds line the interior of the so-called “Alligator Alcatraz” detention facility in the Florida Everglades, a repurposed training center now designated for holding immigrants. President Donald Trump appears in the background during a July 1, 2025,…",
    "link": "https://www.catholicnewsagency.com/news/265259/florida-bishop-no-problem-with-removing-criminals-but-alligator-alcatraz-is-troubling",
    "timestamp": "2025-07-09T16:06:00Z"
  },
  {
    "title": "Trump’s Big Beautiful Political Concentration Camps",
    "description": "Donald Trump’s “Alligator Alcatraz” in the Florida Everglades is not designed exclusively for “illegals,” as the establishment media reports, but rather as a template for a system of concentration camps to intern and disappear political dissidents and others …",
    "link": "https://www.globalresearch.ca/trump-big-beautiful-political-concentration-camps/5894254",
    "timestamp": "2025-07-09T16:05:56Z"
  },
  {
    "title": "Why Are 'Epstein Didn't Kill Himself' Jokes Making a Comeback Online? The 'Missing Minute' In The DOJ-Released CCTV Video Explained",
    "description": "New revelations from the Department of Justice and the FBI have done nothing to quell conspiracy theories about Jeffrey Epstein's death. Here's why the meme is making a comeback.",
    "link": "https://knowyourmeme.com/editorials/guides/why-are-epstein-didnt-kill-himself-jokes-making-a-comeback-online-the-missing-minute-in-the-doj-released-cctv-video-explained",
    "timestamp": "2025-07-09T16:05:53Z"
  },
  {
    "title": "ICE Deports 20-Year-Old With No Criminal Record: 'Man of Faith'",
    "description": "A 20-year-old Guatemalan national with no criminal record was deported days after being detained by U.S. immigration agents.",
    "link": "https://www.newsweek.com/ice-deports-20-year-old-no-criminal-record-man-faith-2096620",
    "timestamp": "2025-07-09T16:05:01Z"
  },
  {
    "title": "How Dr. Phil’s TV Network Fell Apart After Barely More Than A Year",
    "description": "“Phil McGraw‘s Merit Street Media is in bankruptcy court and is simultaneously suing its distribution partner, Trinity Broadcasting, for breach of contract that the company says led to the chapter 11 filing. But signs that the 15-month-old network was struggl…",
    "link": "http://www.hollywoodreporter.com/business/business-news/dr-phil-merit-street-media-bankruptcy-2-1236309158/",
    "timestamp": "2025-07-09T16:04:00Z"
  },
  {
    "title": "Trump Demands Major Rate Cut, Slams Fed Chair As “Too Late”",
    "description": "President Donald Trump renewed his attacks on the Federal Reserve Tuesday, demanding an aggressive interest rate cut of at least three percentage points to ease U.S. debt servicing costs. \n“Our Fed rate is at least 3 points too high,” Trump wrote on Truth Soc…",
    "link": "https://biztoc.com/x/2bc0559c77e491af",
    "timestamp": "2025-07-09T16:03:51Z"
  },
  {
    "title": "Man Charged Over Death Threats Against Donald Trump on Truth Social—DOJ",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA Rhode Island man accused of threatening to kill President Donald Trump and two senior federal officials is set to appear in U.S. District Court in Providence on Wednesday. Federal prosecutors allege that Car…",
    "link": "https://biztoc.com/x/3233ab56a058f6ef",
    "timestamp": "2025-07-09T16:03:50Z"
  }
]