[
  {
    "title": "'Master troll': MSNBC's Nicolle Wallace cheers WSJ after searing takedown of Trump",
    "description": "MSNBC's Nicolle Wallace championed the Wall Street Journal editorial board during her Wednesday show after they shamed President Donald Trump for his trade war with Mexico, Canada and China. Wallace called it a \"master-troll\" because the board wrote that the …",
    "link": "https://www.rawstory.com/trump-trade-war-2671318789/",
    "timestamp": "2025-03-12T22:16:29Z"
  },
  {
    "title": "The Elon Musk company you should be worried about right now",
    "description": "The next phase of Elon Musk’s plan to entangle his companies with the workings of the federal government is well underway. That entails not only President Donald Trump’s photo op with a Tesla in front of the White House but also, surprisingly, the future of y…",
    "link": "https://www.vox.com/technology/403721/tesla-trump-elon-musk-doge-starlink",
    "timestamp": "2025-03-12T22:15:21Z"
  },
  {
    "title": "US CPI comes in lower than expected — Are rate cuts coming?",
    "description": "The latest US core Consumer Price Index (CPI) print, a measure of inflation, came in lower than expected at 3.1%, beating expectations of 3.2%, with a corresponding 0.1% drop in headline inflation figures.According to Matt Mena, crypto research strategist at …",
    "link": "https://cointelegraph.com/news/us-cpi-lower-expected-rate-cuts-coming",
    "timestamp": "2025-03-12T22:15:00Z"
  },
  {
    "title": "From tallboys to houses, latest aluminum and steel tariffs driving up costs",
    "description": "More pain is on tap for craft breweries, homebuilders and manufacturers as U.S. tariffs on imported aluminum — and the counter-levies Canada is lobbing back — drive up costs. Blair Berdusco, chair of the Canadian Craft Brewers Association, said it amounts to …",
    "link": "https://financialpost.com/pmn/from-tallboys-to-houses-latest-aluminum-and-steel-tariffs-driving-up-costs",
    "timestamp": "2025-03-12T22:14:11Z"
  },
  {
    "title": "From tallboys to houses, latest aluminum and steel tariffs driving up costs",
    "description": "More pain is on tap for craft breweries, homebuilders and manufacturers as U.S. tariffs on imported aluminum drive up costs. Read more.",
    "link": "https://financialpost.com/news/tallboys-houses-aluminum-steel-tariffs-driving-costs",
    "timestamp": "2025-03-12T22:14:11Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Softer-than-expected February inflation data helped stock futures come off their lows on Thursday.",
    "link": "https://www.cnbc.com/2025/03/12/stock-market-today-live-updates.html",
    "timestamp": "2025-03-12T22:13:49Z"
  },
  {
    "title": "Trump says US team headed to Moscow for Ukraine truce talks",
    "description": "The president said he can 'do things financially' that would be painful for Russia if the war continues.",
    "link": "https://www.bbc.com/news/articles/cpv4729jvm9o",
    "timestamp": "2025-03-12T22:13:35Z"
  },
  {
    "title": "Trade war escalates as Trump pledges more tariffs",
    "description": "Trump repeated trade threats after the European Union and Canada retaliated to US steel and aluminium tariffs.",
    "link": "https://www.bbc.com/news/articles/c3e4d8epdzdo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-03-12T22:11:55Z"
  },
  {
    "title": "Fox Business Host Blasts Trump Administration For Dodging Questions On Economy",
    "description": "Dagen McDowell took aim at White House officials for snubbing her network's requests as fears of a recession rise.",
    "link": "https://www.huffpost.com/entry/fox-business-host-trump-economy-messaging_n_67d1e8f5e4b0668b4e9d4f76",
    "timestamp": "2025-03-12T22:11:50Z"
  },
  {
    "title": "Trump, Irish leader meet amid differences on trade, Gaza war",
    "description": "WASHINGTON — U.S. President Donald Trump met Irish Prime Minister Micheal Martin on Wednesday for wide-ranging talks that reflected differences over trade and the conflict in Gaza, although both leaders pledged to expand cooperation between the two countries.…",
    "link": "https://www.voanews.com/a/trump-irish-leader-meet-amid-differences-on-trade-gaza-war/8008689.html",
    "timestamp": "2025-03-12T22:11:22Z"
  },
  {
    "title": "U.S. stocks close mixed as weak CPI growth eases concerns",
    "description": "NEW YORK, March 12 (Xinhua) -- U.S. stocks ended mixed on Wednesday after the release of a reassuring consumer price report, which helped the market recover from a sharp downturn driven by concerns over the economy's health. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/13/us-stocks-close-mixed-as-weak-cpi-growth-eases-concerns",
    "timestamp": "2025-03-12T22:11:00Z"
  },
  {
    "title": "Trump on Ukraine ceasefire: US negotiators travel to Moscow",
    "description": "Donald Trump has confirmed that US officials are travelling to Russia, to discuss a proposed 30 day ceasefire with Ukraine. Kyiv accepted the proposals during a meeting in Saudi Arabia on Tuesday, led by the US Secretary of State, Marco Rubio. Mr Trump said a…",
    "link": "https://www.bbc.co.uk/programmes/w172zb9f651qhny",
    "timestamp": "2025-03-12T22:11:00Z"
  },
  {
    "title": "JD Vance scolds CBS for ‘harassing’ his mother-in-law over DEI differences ‘in order to attack’ Trump",
    "description": "JD Vance mocked CBS News, suggesting his mother-in-law was being “harassed\" in an attempt to attack President Trump over DEI policies, in a statement that was printed by the outlet.",
    "link": "https://www.foxnews.com/media/jd-vance-scolds-cbs-harassing-mother-in-law-dei-differences-order-attack-trump",
    "timestamp": "2025-03-12T22:10:52Z"
  },
  {
    "title": "Ten topics that came up in Oval Office – from shamrock socks to Doonbeg and ‘great guy’ Rory McIlroy",
    "description": "There was a kaleidoscope of questions raised in the Oval Office when Micheál Martin met Donald Trump yesterday, ranging from tariffs to celebrities and the US president’s hotel in Co Clare – here are 10 of the many highlights.",
    "link": "https://www.independent.ie/irish-news/ten-topics-that-came-up-in-oval-office-from-shamrock-socks-to-doonbeg-and-great-guy-rory-mcilroy/a2057931061.html",
    "timestamp": "2025-03-12T22:10:22Z"
  },
  {
    "title": "Ten topics that came up in Oval Office – from shamrock socks to Doonbeg and ‘great guy’ Rory McIlroy",
    "description": "There was a kaleidoscope of questions raised in the Oval Office when Micheál Martin met Donald Trump yesterday, ranging from tariffs to celebrities and the US president’s hotel in Co Clare – here are 10 of the many highlights.",
    "link": "https://www.independent.ie/irish-news/politics/ten-topics-that-came-up-in-oval-office-from-shamrock-socks-to-doonbeg-and-great-guy-rory-mcilroy/a2057931061.html",
    "timestamp": "2025-03-12T22:10:22Z"
  },
  {
    "title": "Trump says US officials en route to Moscow for Ukraine ceasefire talks",
    "description": "Russian officials said that they were awaiting details from negotiations which took place between US and Ukrainian officials this week.",
    "link": "https://www.thejournal.ie/trump-us-officials-russia-ukraine-negotiations-6647858-Mar2025/",
    "timestamp": "2025-03-12T22:10:07Z"
  },
  {
    "title": "From soup cans to airplanes, steel and aluminum are a fundamental part of American life",
    "description": "Here are some of the industries and products that rely on aluminum and steel.",
    "link": "https://www.bostonherald.com/2025/03/12/steel-aluminum-tariffs/",
    "timestamp": "2025-03-12T22:09:11Z"
  },
  {
    "title": "Behind Trump’s green velvet tones and smiles, of course, is the steely determination to punish Europe",
    "description": "Economic storms may await but as the president reminisced about the ‘very special’ Irish, those clouds seemed not so ominous",
    "link": "https://www.irishtimes.com/politics/2025/03/12/behind-trumps-green-velvet-tones-and-smiles-of-course-is-the-steely-determination-to-punish-europe/",
    "timestamp": "2025-03-12T22:07:30Z"
  },
  {
    "title": "US steered Syrian Kurds toward Damascus deal, sources say",
    "description": "DAMASCUS, SYRIA — The United States encouraged its Syrian Kurdish allies to reach Monday's landmark deal with the Islamist-led government in Damascus, six sources said, an agreement that could stave off further conflict in northern Syria at a time of uncertai…",
    "link": "https://www.voanews.com/a/us-steered-syrian-kurds-toward-damascus-deal-sources-say/8008684.html",
    "timestamp": "2025-03-12T22:06:41Z"
  },
  {
    "title": "Trump’s tariffs could have significant impact on packaging",
    "description": "The potential impact of Trump’s tariffs could also adjust shipping routes or the actual method of transportation.\nThe post Trump’s tariffs could have significant impact on packaging appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/trumps-tariffs-could-have-significant-impact-on-packaging/article",
    "timestamp": "2025-03-12T22:05:22Z"
  },
  {
    "title": "Affordable Housing Threatened As Trump Halts $1 Billion Program To Extend Life Of Buildings",
    "description": "Preserving tens of thousands of low-income units is a centerpiece of efforts to address the nation's housing crisis.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-affordable-housing-preservation_n_67d20353e4b09f3dcf39680e",
    "timestamp": "2025-03-12T22:04:56Z"
  },
  {
    "title": "Gabija Gataveckaite: MAGA rants, ‘trade deficit’ and McGregor’s tattoos make for a fascinating face-to-face in the White House",
    "description": "Micheál Martin was once dubbed the most unlucky taoiseach. He was finally elected as leader of the country after many agonising years in politics. This happened in the middle of the Covid pandemic, meaning he was unable to celebrate his election with his fami…",
    "link": "https://www.independent.ie/opinion/analysis/gabija-gataveckaite-maga-rants-trade-deficit-and-mcgregors-tattoos-make-for-a-fascinating-face-to-face-in-the-white-house/a1014785764.html",
    "timestamp": "2025-03-12T22:03:21Z"
  },
  {
    "title": "'Blank check to shut down government': Multiple senators are no fans of GOP's funding bill",
    "description": "WASHINGTON — The House developed a six-month bill that would continue funding the government and raise the debt ceiling, while making drastic cuts, but some senators aren't fans of the legislation. And they're floating just a 30-day stopgap. Sen. Patty Murray…",
    "link": "https://www.rawstory.com/raw-investigates/government-shutdown-2671318494/",
    "timestamp": "2025-03-12T22:02:39Z"
  },
  {
    "title": "The Hilarious Reason Why Elon Musk Is Panicking Over Tesla Stock Value",
    "description": "Donald Trump transformed the White House into a car dealership to save Elon Musk’s floundering Tesla stock—to keep him from defaulting on his massive loans. \r\nTrump took a shot at being a shady car salesman Tuesday during a press event for Tesla at the White …",
    "link": "https://newrepublic.com/post/192687/elon-musk-panicking-tesla-stock-value",
    "timestamp": "2025-03-12T22:02:28Z"
  },
  {
    "title": "Trump says Ireland cheats the US as its leader joins him to celebrate St. Patrick’s Day",
    "description": "As they sat in the Oval Office, Trump said Ireland takes advantage of the United States.",
    "link": "https://www.bostonherald.com/2025/03/12/trump-ireland-prime-minister/",
    "timestamp": "2025-03-12T22:02:18Z"
  },
  {
    "title": "Fionnán Sheahan: Micheál Martin ducked, weaved and didn’t defend Donald Trump’s victims in Oval Office octagon",
    "description": "There were cringe moments, there were awkward instances, there were times when the Taoiseach could have said more and couldn’t get a word in edgeways.",
    "link": "https://www.independent.ie/opinion/comment/fionnan-sheahan-micheal-martin-ducked-weaved-and-didnt-defend-donald-trumps-victims-in-oval-office-octagon/a1203751892.html",
    "timestamp": "2025-03-12T22:02:16Z"
  },
  {
    "title": "President Trump slams Rosie O'Donnell after she flees US: 'You're better off not knowing' her",
    "description": "During a White House press conference, President Donald Trump slammed comedian and actress Rosie O'Donnell after she fled the U.S. and moved to Ireland.",
    "link": "https://www.foxnews.com/entertainment/president-trump-rosie-odonnell-flees-us",
    "timestamp": "2025-03-12T22:00:40Z"
  },
  {
    "title": "Disney scales back premiere of controversial live action ‘Snow White’ remake",
    "description": "Following years of controversy, the premiere of Disney's live action \"Snow White\" movie will be a smaller event than the studio's other big-budget premieres.",
    "link": "https://www.foxnews.com/media/disney-scales-back-premiere-controversial-live-action-snow-white-remake",
    "timestamp": "2025-03-12T22:00:14Z"
  },
  {
    "title": "XRP, ADA, SOL Fall Harder Than BTC as White House Crypto Summit Fails to Wow Traders",
    "description": "Expectations of bigger plans for the largest cryptocurrencies fell short on Friday as the first-ever presidential crypto summit ended with promises of stablecoin legislation and lower regulatory resistance. What to know: The much-anticipated White House Crypt…",
    "link": "https://www.activistpost.com/xrp-ada-sol-fall-harder-than-btc-as-white-house-crypto-summit-fails-to-wow-traders/",
    "timestamp": "2025-03-12T22:00:00Z"
  },
  {
    "title": "Trump Loves Conor (And His Tattoos)",
    "description": "Today (Weds., March 12, 2025), U.S. President Donald Trump met with Ireland’s Taoiseach—also known as Ireland’s prime minister—Micheál Martin and talked about Conor McGregor",
    "link": "https://www.mmamania.com/2025/3/12/24384363/video-donald-trump-shouts-out-ufcs-conor-mcgregor-during-meeting-with-irish-prime-minister-hes-great",
    "timestamp": "2025-03-12T22:00:00Z"
  },
  {
    "title": "Commentary: Watching India’s approach to navigating Trump 2.0",
    "description": "There is significant anxiety in India that United States President Donald Trump ultimately believes in the possibility of negotiating a bilateral deal with China, says Sinderpal Singh of the S Rajaratnam School of International Studies.",
    "link": "https://www.channelnewsasia.com/commentary/us-india-trump-modi-china-tariffs-trade-war-4995456",
    "timestamp": "2025-03-12T22:00:00Z"
  },
  {
    "title": "U.S. House votes ‘292-132’ to overturn IRS DeFi rule – Details here",
    "description": "U.S. House votes to overturn IRS DeFi rule, sending it to Trump for final approval.",
    "link": "https://ambcrypto.com/u-s-house-votes-292-132-to-overturn-irs-defi-rule-details-here/",
    "timestamp": "2025-03-12T22:00:00Z"
  },
  {
    "title": "Commentary: How Trump could win, and deserve, a Nobel Peace Prize",
    "description": "Averting a nuclear arms race with successful talks among the US, Russia and China is something that US President Donald Trump might just pull off, says Andreas Kluth for Bloomberg Opinion.",
    "link": "https://www.channelnewsasia.com/commentary/donald-trump-diplomatic-talks-russia-ukraine-conflict-nuclear-weapons-4995351",
    "timestamp": "2025-03-12T22:00:00Z"
  },
  {
    "title": "How the Manosphere Came to Love Zyn",
    "description": "From the March 12, 2025, edition of The New Yorker newsletter: Carrie Battan goes back to the origins of the nicotine product. Plus: where Trump might be right about Ukraine; the Administration’s latest attacks on elections; and Amy Sedaris gets laid off.",
    "link": "https://www.newyorker.com/newsletter/the-daily/how-the-manosphere-came-to-love-zyn",
    "timestamp": "2025-03-12T22:00:00Z"
  },
  {
    "title": "Is the US headed for a recession?",
    "description": "Donald Trump has a gift for inheriting valuable things. And the economy of January 2025 was no exception.  When the president took office, stock values were hitting record highs, unemployment was hovering near historic lows, and consumer confidence was stable…",
    "link": "https://www.vox.com/politics/403737/recession-stock-market-trump-tariffs-economy",
    "timestamp": "2025-03-12T21:58:26Z"
  },
  {
    "title": "U.S.-EU trade war helps no one: Slovak president",
    "description": "BRATISLAVA, March 12 (Xinhua) -- A trade war won't help anyone, and there's no winner in such a war, Slovak President Peter Pellegrini said here Wednesday in response to the worsening trade relations between the United States and the European Union (EU). Read…",
    "link": "https://www.thestar.com.my/news/world/2025/03/13/us-eu-trade-war-helps-no-one-slovak-president",
    "timestamp": "2025-03-12T21:55:00Z"
  },
  {
    "title": "New Zealand Pitches Itself as Safe Haven in ‘Global Storm’",
    "description": "New Zealand’s prime minister pitched his country as a safe haven in an unstable world as he opened an Investor Summit aimed at attracting foreign capital.",
    "link": "https://financialpost.com/pmn/business-pmn/new-zealand-pitches-itself-as-safe-haven-in-global-storm",
    "timestamp": "2025-03-12T21:53:15Z"
  },
  {
    "title": "Arrest of Columbia student protester sends chill across campus, say faculty",
    "description": "The arrest and threatened deportation of a student activist at Columbia University is a threat to free speech on campus and across the U.S., says professor Michael Thaddeus.",
    "link": "https://www.cbc.ca/radio/asithappens/mahmoud-khalil-columbia-chill-1.7481915",
    "timestamp": "2025-03-12T21:52:39Z"
  },
  {
    "title": "Amid federal ‘attacks,’ Boston City Council votes to declare ‘sanctuary city’ protections for transgender people",
    "description": "Amid “attacks” from the federal government, the Boston City Council passed a resolution that recognizes the Hub as a sanctuary city for transgender people and the LGBTQ community.",
    "link": "https://www.bostonherald.com/2025/03/12/amid-federal-attacks-boston-city-council-votes-to-declare-sanctuary-city-protections-for-transgender-people/",
    "timestamp": "2025-03-12T21:52:20Z"
  },
  {
    "title": "‘Innuendo And Rumor Stories’: VA Secretary Collins Blasts Media Hacktivist’s Anti-DOGE Hatchet Job",
    "description": "First, it was ABC’s Martha Raddatz. Then, it was CBS’s Margaret Brennan. And now, Military.com’s Patricia Kime is the latest member of the propaganda press to get a well-deserved scolding from the Trump administration for masquerading her left-wing activism a…",
    "link": "https://freerepublic.com/focus/f-news/4303858/posts",
    "timestamp": "2025-03-12T21:52:05Z"
  },
  {
    "title": "Kuwait frees a group of jailed Americans, including contractors held on drug charges",
    "description": "Kuwait has released a group of American prisoners, including veterans and military contractors jailed for years on drug-related charges",
    "link": "https://abcnews.go.com/US/wireStory/kuwait-frees-group-jailed-americans-including-contractors-held-119732937",
    "timestamp": "2025-03-12T21:50:49Z"
  },
  {
    "title": "Fact check: Nine Trump false claims about Canada (Daniel Dale/CNN)",
    "description": "Daniel Dale / CNN:\nFact check: Nine Trump false claims about Canada  —  President Donald Trump keeps saying he wants Canada to become the 51st US state.  To support his pitch, he keeps making false claims about Canada.  —  In 2025 alone, Trump has:  — Falsely…",
    "link": "https://www.memeorandum.com/250312/p130",
    "timestamp": "2025-03-12T21:50:00Z"
  },
  {
    "title": "Mahmoud Khalil’s Constitutional Rights and the Power of ICE",
    "description": "Isaac Chotiner interviews the legal scholar Lindsay Nash about the unusual justification for the arrest of the Columbia graduate Mahmoud Khalil, and what it could augur for immigration enforcement in Donald Trump’s second term.",
    "link": "https://www.newyorker.com/news/q-and-a/mahmoud-khalils-constitutional-rights-and-the-power-of-ice",
    "timestamp": "2025-03-12T21:49:07Z"
  },
  {
    "title": "SET urges investors to take a long-term outlook amid dip",
    "description": "<p>Investors must take a long-term approach as the Stock Exchange of Thailand (SET) has entered a correction phase, the bourse said yesterday, but insisted dividend yield remain attractive despite a downturn.</p>",
    "link": "https://www.bangkokpost.com/business/general/2978703/set-urges-investors-to-take-a-long-term-outlook-amid-dip",
    "timestamp": "2025-03-12T21:49:00Z"
  },
  {
    "title": "Trump, Bitcoin, and the dollar",
    "description": "<p>In a March 6 executive order, US President Donald Trump established a \"digital gold\" Bitcoin reserve, to be capitalised with any BTC seized by federal law enforcement. With the supply of BTC capped at 21 million coins, the administration wants the United S…",
    "link": "https://www.bangkokpost.com/opinion/opinion/2978888/trump-bitcoin-and-the-dollar",
    "timestamp": "2025-03-12T21:49:00Z"
  },
  {
    "title": "PM in talks with committee on how to handle Trump",
    "description": "<p>The Joint Standing Committee on Commerce, Industry and Banking will meet the prime minister on Thursday to discuss measures to deal with the new US trade policy, which is concerning entrepreneurs.</p>",
    "link": "https://www.bangkokpost.com/business/general/2978843/pm-in-talks-with-committee-on-how-to-handle-trump",
    "timestamp": "2025-03-12T21:49:00Z"
  },
  {
    "title": "California exploiting Medicaid 'loophole' to pay billions for illegal immigrants' health care, study says - NewsBreak",
    "description": "A new study is accusing California of exploiting a Medicaid funding loophole to funnel billions into healthcare for illegal immigrants.",
    "link": "https://www.newsbreak.com/share/3853089325852-california-exploiting-medicaid-loophole-to-pay-billions-for-illegal-immigrants-health-care-study-says?s=a99&amp;share_destination_id=MTgxNjgxMzUxLTE3NDE4MTU5NDQ1ODA%3D&amp;pd=0CIJcNMD&amp;hl=en_US&amp;send_time=1741815944&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.10.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-control%2Cns_foryou_model_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v7%2Cns_foryou_rank_exp_25q1-v3%2Cns_local_strategy_25q1_exp-v17",
    "timestamp": "2025-03-12T21:47:38Z"
  },
  {
    "title": "One of Tesla's Biggest Supporters Is Running Out of Patience",
    "description": "Wall Street is getting increasingly fed up with Tesla CEO Elon Musk, who has seemingly abandoned the carmaker in favor of gutting the federal government with the help of his so-called Department of Government Efficiency. Even one of the brand's most prominent…",
    "link": "https://futurism.com/tesla-biggest-supporter-out-of-patience",
    "timestamp": "2025-03-12T21:47:08Z"
  },
  {
    "title": "Ancient Roman Gossip Book Makes The Bestseller List 2,000 Years After Its Original Publication",
    "description": "Roman historian Suetonius wrote The Lives of the Caesars in the second century C.E., and it's full of gossip and scandalous rumors about Julius Caesar and the first 11 Roman emperors.\nThe post Ancient Roman Gossip Book Makes The Bestseller List 2,000 Years Af…",
    "link": "https://allthatsinteresting.com/the-lives-of-the-caesars-tom-holland",
    "timestamp": "2025-03-12T21:45:51Z"
  },
  {
    "title": "Trade war will 'hurt us both,' Canadian delegation tells American municipal leaders",
    "description": "A Nova Scotia municipal leader on a recent Canadian delegation to Washington, D.C., says the group stressed to their American counterparts the current trade war will make life more expensive for citizens on both sides of the border.",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/canadian-delegation-american-municipal-leaders-trade-war-1.7481909",
    "timestamp": "2025-03-12T21:45:50Z"
  },
  {
    "title": "EPA workers silenced as agency cancels hundreds of grants",
    "description": "EPA staffers have been told they are prohibited from communicating with grantee partners they are supposed to monitor, according to multiple sources inside the agency.",
    "link": "https://abcnews.go.com/Politics/epa-workers-silenced-agency-cancels-hundreds-grants/story?id=119715963",
    "timestamp": "2025-03-12T21:45:46Z"
  },
  {
    "title": "Trump makes good on threats to pull funding from Maine due to trans sports defiance",
    "description": "Money flow halted while investigation under way into violations of federal law",
    "link": "https://www.wnd.com/2025/03/trump-makes-good-on-threats-to-pull-funding-from-maine-due-to-trans-sports-defiance/",
    "timestamp": "2025-03-12T21:45:01Z"
  },
  {
    "title": "Rumble embraces Trump-era crypto strategy with $17M BTC purchase",
    "description": "Video-sharing platform Rumble says it had purchased more than $17 million worth of Bitcoin as part of a previously announced investment strategy.In a March 12 notice, Rumble said it had added 188 Bitcoin (BTC) to its treasury for roughly $17.1 million. The in…",
    "link": "https://cointelegraph.com/news/rumble-bitcoin-purchase-donald-trump-inflation-hedge",
    "timestamp": "2025-03-12T21:45:00Z"
  },
  {
    "title": "Things to know about a potential Trump presidential library in Florida",
    "description": "A Florida legislator said that state has a 'high likelihood' of getting its first presidential library.",
    "link": "https://www.bostonherald.com/2025/03/12/trump-presidential-library-florida/",
    "timestamp": "2025-03-12T21:44:44Z"
  },
  {
    "title": "In meeting with Irish leader, Trump accuses Ireland of taking U.S. companies via taxation",
    "description": "President Donald Trump accused Ireland of taking U.S companies via taxation during an hour-long meeting with Irish Taoiseach Micheal Martin at the White...",
    "link": "https://www.upi.com/Top_News/US/2025/03/12/Ireland-Trump-Martin-EU/9821741792469/",
    "timestamp": "2025-03-12T21:44:18Z"
  },
  {
    "title": "Federal judge appears skeptical probationary firings were for performance",
    "description": "Nearly 20 states are seeking a temporary restraining order to stop any more firings.",
    "link": "https://www.bostonherald.com/2025/03/12/trump-mass-firings/",
    "timestamp": "2025-03-12T21:44:11Z"
  },
  {
    "title": "Judge hopes to rule next week on Trump order banning transgender people from military service",
    "description": "It is her 'strong hope' to issue a decision next Tuesday or Wednesday, she said.",
    "link": "https://www.bostonherald.com/2025/03/12/trump-transgender-troops-ruling/",
    "timestamp": "2025-03-12T21:43:49Z"
  },
  {
    "title": "‘Where is Elon Musk?!’ House Dem Loses It Over GOP Colleagues Refusing to Bring Musk in to Talk DOGE",
    "description": "\"He's been on television the last couple of days talking exactly about Social Security, Medicare, and Medicaid and what he intends to do. Privatize it!\"\nThe post ‘Where is Elon Musk?!’ House Dem Loses It Over GOP Colleagues Refusing to Bring Musk in to Talk D…",
    "link": "https://www.mediaite.com/politics/where-is-elon-musk-house-dem-loses-it-over-gop-colleagues-refusing-to-bring-musk-in-to-talk-doge/",
    "timestamp": "2025-03-12T21:42:32Z"
  },
  {
    "title": "What is the Immigration Act of 1952 and why do Trump officials keep talking about it?",
    "description": "Again and again, the Trump White House has turned to a 73-year-old legal statute to defend its immigration crackdown",
    "link": "https://abcnews.go.com/US/wireStory/immigration-act-1952-trump-officials-talking-119733035",
    "timestamp": "2025-03-12T21:42:31Z"
  },
  {
    "title": "Trump blasts Ireland on trade during traditional visit",
    "description": "WASHINGTON: It was perhaps not the welcome Irish Prime Minister Micheal Martin had hoped for on an annual US trip to mark Saint Patrick's Day - a dressing down from Donald Trump on trade and tariffs. \"We do have a massive deficit with Ireland,\" the US preside…",
    "link": "https://www.channelnewsasia.com/world/trump-blasts-ireland-trade-during-traditional-visit-4996971",
    "timestamp": "2025-03-12T21:42:25Z"
  },
  {
    "title": "Mark Carney to be sworn in as prime minister Friday: sources",
    "description": "Prime minister-designate Mark Carney and his cabinet will be sworn in on Friday at Rideau Hall, Radio-Canada and CBC News have learned.",
    "link": "https://www.cbc.ca/news/politics/carney-swearing-in-friday-1.7482023",
    "timestamp": "2025-03-12T21:41:59Z"
  },
  {
    "title": "The five radical leftist groups protesting Elon Musk – one of which received $7.6m from George Soros",
    "description": "Coordinated protests against Elon Musk are being financed by billionaire philanthropist George Soros and moneyed Democrats.",
    "link": "https://nypost.com/2025/03/12/us-news/radical-anti-elon-musk-group-received-7-6m-from-george-soros/",
    "timestamp": "2025-03-12T21:41:52Z"
  },
  {
    "title": "Explainer: The problematic planning history of Trump’s Doonbeg hotel and golf course",
    "description": "Doonbeg’s ‘grey dunes’ and presence of endangered snail hampered original developer’s plans",
    "link": "https://www.irishtimes.com/politics/2025/03/12/explainer-the-problematic-planning-history-of-trumps-doonbeg-hotel-and-golf-course/",
    "timestamp": "2025-03-12T21:40:13Z"
  },
  {
    "title": "Donald Trump crowns Conor McGregor as his favorite Irishman",
    "description": "President Donald Trump has once again expressed his admiration for UFC star Conor McGregor, despite the fighter&apos;s ongoing legal troubles and extended absence from competition.",
    "link": "https://www.marca.com/en/ufc/2025/03/12/67d1fb5622601d1a558b4596.html",
    "timestamp": "2025-03-12T21:39:24Z"
  },
  {
    "title": "As Elon Musk makes thousands of federal workers jobless, tycoon pushes for $56B Tesla pay deal",
    "description": "Not so much thrown under a bus as under an unwanted electric car Elon Musk is trying yet again to get his $56 billion Tesla pay package reinstated with an appeal to the Delaware Supreme Court. …",
    "link": "https://www.theregister.com/2025/03/12/elon_musk_appeals_voided_pay_package/",
    "timestamp": "2025-03-12T21:38:53Z"
  },
  {
    "title": "‘Everything Is Transgender,’ Complains President Obsessed With Trans People",
    "description": "Donald Trump complained that he hears about transgender people too much as Congress hosted a “Detrans Awareness Day.”",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-complains-everything-transgender-1235294888/",
    "timestamp": "2025-03-12T21:38:49Z"
  },
  {
    "title": "‘Deranged bigot’: Law expert warns of 'popular uprising' over Trump's 'political prisoner'",
    "description": "The Saturday night immigration arrest of former Columbia University graduate student Mahmoud Khalil raises a multitude of legal questions – but none as important as how the “kidnapping” of President Donald Trump’s “first political prisoner” was allowed to unf…",
    "link": "https://www.rawstory.com/mahmoud-khalil-2671318570/",
    "timestamp": "2025-03-12T21:38:42Z"
  },
  {
    "title": "Nomura 2nd Japanese bank to exit global climate alliance for industry",
    "description": "Nomura Holdings Inc said Wednesday it has withdrawn from a global climate coalition for banks, becoming the second Japanese financial institution to do so after climate-skeptic U.S. President Donald Trump returned to office. The decision to withdraw from the …",
    "link": "https://japantoday.com/category/business/nomura-2nd-japanese-bank-to-exit-global-climate-alliance-for-industry",
    "timestamp": "2025-03-12T21:38:37Z"
  },
  {
    "title": "The Many Misrepresentations of Mahmoud Khalil",
    "description": "Early this week, as Columbia students scrambled to respond to the United States government’s arrest of recent graduate Mahmoud Khalil, a series of logistical hurdles emerged. What would the protesters do if approached by police? What did the fine print of Col…",
    "link": "https://www.motherjones.com/politics/2025/03/mahmoud-khalil-columbia-arrest-columbia-student-activists-misrepresentations/",
    "timestamp": "2025-03-12T21:38:31Z"
  },
  {
    "title": "Intel names chip industry veteran Lip-Bu Tan as next CEO",
    "description": "New boss is tasked with restoring the fortunes of a pioneering chipmaker that’s become an industry laggard",
    "link": "https://www.irishtimes.com/business/2025/03/12/intel-names-chip-industry-veteran-lip-bu-tan-as-next-ceo/",
    "timestamp": "2025-03-12T21:38:17Z"
  },
  {
    "title": "Kuwait frees a group of jailed Americans, including contractors held on drug charges",
    "description": "The move is seen as a gesture of goodwill between two allies.",
    "link": "https://www.bostonherald.com/2025/03/12/kuwait-americans-released/",
    "timestamp": "2025-03-12T21:37:41Z"
  },
  {
    "title": "What is the Immigration Act of 1952 and why do Trump officials keep talking about it?",
    "description": "The act comes up so frequently because it is the legal foundation of modern immigration law",
    "link": "https://www.bostonherald.com/2025/03/12/immigration-act-of-1952/",
    "timestamp": "2025-03-12T21:37:28Z"
  },
  {
    "title": "Judge denies Pulitzer board’s effort to delay Trump (Russia collusion) defamation case",
    "description": "The ruling paves the way for the discovery process, where Trump’s lawyers are seeking the board’s internal deliberations in its 2018 awards to the New York Times and Washington Post for Russia collusion coverage. A Florida circuit court judge has denied the P…",
    "link": "https://freerepublic.com/focus/f-news/4303856/posts",
    "timestamp": "2025-03-12T21:36:39Z"
  },
  {
    "title": "Liberal North Carolina city's DEI plan for hurricane relief shut down by HUD secretary",
    "description": "Secretary of Department of Housing and Urban Development Scott Turner shut down an Asheville, North Carolina, Hurricane Helene relief plan that included DEI initiatives.",
    "link": "https://www.foxnews.com/politics/liberal-north-carolina-citys-dei-plan-hurricane-relief-shut-down-hud-secretary",
    "timestamp": "2025-03-12T21:36:12Z"
  },
  {
    "title": "Banks acting as validators risks centralization — Everstake exec",
    "description": "New US regulatory guidance allowing banks to become validators for blockchain networks is a major step for institutional adoption but worsens centralization risks, Bohdan Opryshko, chief operating officer of staking service provider Everstake, told Cointelegr…",
    "link": "https://cointelegraph.com/news/banks-as-validators-risks-centralization-everstake-exec",
    "timestamp": "2025-03-12T21:35:59Z"
  },
  {
    "title": "U.S. Senate Democrats debate path forward on government funding bill",
    "description": "U.S. Senate Democrats were wrestling on Wednesday with how to respond to a stopgap funding bill passed by the Republican-controlled House of Representatives, choosing between voting for a bill many of them oppose or allowing a government shutdown. President D…",
    "link": "https://japantoday.com/category/world/us-senate-democrats-debate-path-forward-on-government-funding-bill1",
    "timestamp": "2025-03-12T21:34:48Z"
  },
  {
    "title": "Trump blasts Ireland on trade during traditional visit",
    "description": "It was perhaps not the welcome Irish Prime Minister Micheal Martin had hoped for on an annual U.S. trip to mark St Patrick's Day -- a dressing down from Donald Trump on trade and tariffs. &quot;We do have a massive deficit with Ireland,&quot; the U.S. preside…",
    "link": "https://japantoday.com/category/world/trump-blasts-ireland-on-trade-during-traditional-visit",
    "timestamp": "2025-03-12T21:34:39Z"
  },
  {
    "title": "Iran's Khamenei spurns U.S. talks offer as UAE envoy delivers Trump letter",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei on Wednesday rejected holding negotiations with the United States over a nuclear deal, as a letter was delivered from U.S. President Donald Trump calling for such talks. Last week, Trump said he had sent the letter…",
    "link": "https://japantoday.com/category/world/iran%27s-khamenei-spurns-us-talks-offer-as-uae-envoy-delivers-trump-letter",
    "timestamp": "2025-03-12T21:34:32Z"
  },
  {
    "title": "Cautious Russia weighs Ukraine ceasefire plan as U.S. tries to seal a deal",
    "description": "The Kremlin said on Wednesday it was awaiting details from Washington about a proposal for a 30-day ceasefire in Ukraine before responding, while U.S. Secretary of State Marco Rubio  hoped a deal would be struck within days. As Moscow considered the plan, Pre…",
    "link": "https://japantoday.com/category/world/cautious-russia-weighs-ukraine-ceasefire-plan-as-us-tries-to-seal-a-deal1",
    "timestamp": "2025-03-12T21:34:25Z"
  },
  {
    "title": "Trump vows to take back 'stolen' wealth as tariffs on steel, aluminum imports go into effect worldwide",
    "description": "U.S. President Donald Trump openly challenged U.S. allies on Wednesday by increasing tariffs on all steel and aluminum imports to 25% as he vowed to take back wealth “stolen” by other countries, drawing quick retaliation from Europe and Canada. The Republican…",
    "link": "https://japantoday.com/category/world/trump-vows-to-take-back-%27stolen%27-wealth-as-tariffs-on-steel-and-aluminum-imports-go-into-effect",
    "timestamp": "2025-03-12T21:32:25Z"
  },
  {
    "title": "Fox News Sports Huddle Newsletter: Maine's funding paused after governor, Trump feud over trans athletes",
    "description": "Receive your weekly recap of all the happenings around the world of sports.",
    "link": "https://www.foxnews.com/sports/fox-news-sports-huddle-newsletter-trump-takes-aim-maine-amid-transgender-athlete-executive-order-dispute",
    "timestamp": "2025-03-12T21:32:17Z"
  },
  {
    "title": "AMERICA PRAYER VIGIL (Mar, 13, 2025) *PRAYER*",
    "description": "Join with fellow FREEPERS to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Agri-Business; End to Sex Slavery; Healthcare, Education, Churches, and the Media. This is the confidence we have in approaching God: that if we a…",
    "link": "https://freerepublic.com/focus/f-religion/4303855/posts",
    "timestamp": "2025-03-12T21:32:08Z"
  },
  {
    "title": "Where U.S.-Canada Relations Go From Here",
    "description": "Quebec’s international relations minister on Trump’s tariffs and the potential for cross-border economic pain.",
    "link": "http://foreignpolicy.com/2025/03/12/quebec-international-relations-minister-trump-tariffs-united-states-canada/",
    "timestamp": "2025-03-12T21:31:44Z"
  },
  {
    "title": "Trump feels 'very badly' after mass firings — but insists 'many of them don't work at all'",
    "description": "President Donald Trump justified his administration's mass firings of federal workers by claiming, without evidence, that many of them simply were collecting a paycheck and doing nothing, NBC4 Washington reported on Wednesday.The firings cover some 200,000 \"p…",
    "link": "https://www.rawstory.com/trump-worker-firings/",
    "timestamp": "2025-03-12T21:31:08Z"
  },
  {
    "title": "Kuwait Frees a Group of Jailed Americans",
    "description": "The release follows a recent visit to the region by Adam Boehler, the Trump administration's top hostage envoy.",
    "link": "https://time.com/7267447/kuwait-frees-jailed-americans/",
    "timestamp": "2025-03-12T21:31:03Z"
  },
  {
    "title": "JD Vance's Sock Choice Stops President Trump Mid-Sentence During Oval Office Meeting",
    "description": "Trump seemed tickled by Vance's decision to honor Wednesday's White House guest with a small outfit choice.",
    "link": "https://www.huffpost.com/entry/trump-reacts-jd-vance-shamrock-socks_n_67d1dec1e4b0668b4e9d48c5",
    "timestamp": "2025-03-12T21:30:51Z"
  },
  {
    "title": "Senate Retirements Make Midterms Harder for Democrats",
    "description": "Democrats should benefit from a stiff midterm breeze in 2026. But with a tough landscape and three seats open (the latest caused by Jeanne Shaheen’s retirement), it’s unlikely they can flip the Senate.",
    "link": "http://nymag.com/intelligencer/article/senate-retirements-make-midterms-harder-for-democrats.html",
    "timestamp": "2025-03-12T21:30:24Z"
  },
  {
    "title": "This Is Why European Stocks Might Be One Of The Best Investment Opportunity In Years",
    "description": "Russia's westward push and U.S. indifference towards European worries may trigger a strong economic revival in the region, benefiting stocks. The new German Chancellor is pushing for that to happen.",
    "link": "https://www.forbes.com/sites/raulelizalde/2025/03/12/this-is-why-european-stocks-might-be-one-of-the-best-investment-opportunity-in-years/",
    "timestamp": "2025-03-12T21:30:23Z"
  },
  {
    "title": "Grad student's detention will stretch on as lawyers spar over Trump's plan to deport him",
    "description": "Mahmoud Khalil will remain detained in Louisiana until at least next week after an initial court hearing Wednesday over the Trump administration's plans to deport the Columbia University graduate student.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_d75682ff-d57a-5718-8746-e6a0ab5c9663.html",
    "timestamp": "2025-03-12T21:30:00Z"
  },
  {
    "title": "Federal judge orders Trump administration to pay foreign aid contracts for finished work",
    "description": "null / sergign/Shutterstock.\n\nWashington, D.C. Newsroom, Mar 12, 2025 / 17:30 pm (CNA).\nA federal judge has ordered the administration of U.S. President Donald Trump to make foreign aid payments to non-governmental organizations (NGOs) for completed work, but…",
    "link": "https://www.catholicnewsagency.com/news/262701/federal-judge-orders-trump-administration-to-pay-foreign-aid-contracts-for-finished-work",
    "timestamp": "2025-03-12T21:30:00Z"
  },
  {
    "title": "Schapiro: Demographics, not DEI, imperil Va. schools",
    "description": "Virginia Military Institute and Sweet Briar College can thrive through faith in the future rather than a love affair with the past.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_4eebc146-ff54-11ef-9bc6-47cbd056e906.html",
    "timestamp": "2025-03-12T21:30:00Z"
  },
  {
    "title": "Grad student's detention will stretch on as lawyers spar over Trump's plan to deport him",
    "description": "Mahmoud Khalil will remain detained in Louisiana until at least next week after an initial court hearing Wednesday over the Trump administration's plans to deport the Columbia University graduate student.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_50b0008e-e537-5970-9fed-a40ddca6ecee.html",
    "timestamp": "2025-03-12T21:30:00Z"
  },
  {
    "title": "How Many Americans Have Died of COVID-19?",
    "description": "This week marks five years since March 13, 2020, the day President Donald Trump declared a national state of emergency over the novel coronavirus outbreak. By that date, only 57 Americans had died of COVID-19 and 1,645 had been diagnosed with the virus. Three…",
    "link": "https://biztoc.com/x/d1a34727f895f0f3",
    "timestamp": "2025-03-12T21:29:32Z"
  },
  {
    "title": "In rural Louisiana, Speaker Mike Johnson’s constituents fear potential Medicaid cuts",
    "description": "In House Speaker Mike Johnson’s backyard, many residents rely on anti-poverty programs to help make ends meet — and are pleading with the Louisiana Republican to protect those benefits as Congress weighs steep federal spending cuts.",
    "link": "https://www.nbcnews.com/politics/congress/rural-louisiana-speaker-mike-johnson-potential-medicaid-cuts-rcna196007",
    "timestamp": "2025-03-12T21:28:52Z"
  },
  {
    "title": "AG Bondi to report back to Trump on whether Biden policies infringe on 2nd Amendment",
    "description": "Attorney General Pam Bondi is looking into whether Biden administration policies infringe on Americans' right to bear arms.",
    "link": "https://abcnews.go.com/Politics/ag-bondi-report-back-trump-biden-policies-infringe/story?id=119678797",
    "timestamp": "2025-03-12T21:28:16Z"
  }
]