[
  {
    "title": "Pakistan violates agreement to stop military action, India retaliates swiftly",
    "description": "India accused Pakistan of violating the newly established ceasefire agreement just hours after it went into effect, citing repeated violations. Explosions rocked Srinagar and other parts of Kashmir, raising concerns about the deal's viability. Despite claims …",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/pakistan-violates-agreement-to-stop-military-action-india-retaliates-swiftly/articleshow/121066633.cms",
    "timestamp": "2025-05-10T23:31:00Z"
  },
  {
    "title": "Officials counter Rubio on India-Pakistan ceasefire agreement, say no decision on talks at neutral site",
    "description": "NEW DELHI: While US President Donald Trump, the first to announce the development, said both India and Pakistan had agreed to a \"full and immediate ce.",
    "link": "https://timesofindia.indiatimes.com/india/officials-counter-rubio-on-india-pakistan-ceasefire-agreement-say-no-decision-on-talks-at-neutral-site/articleshow/121068301.cms",
    "timestamp": "2025-05-10T23:28:36Z"
  },
  {
    "title": "Who are Afrikaners? Trump welcomes white South Africans as other refugees are halted.",
    "description": "After suspending the U.S. refugee program, President Trump is making an exception for white South Africans, known as Africaners",
    "link": "https://www.usatoday.com/story/news/politics/2025/05/10/afrikaner-refugees-trump-welcoming-white-south-africans/83557827007/",
    "timestamp": "2025-05-10T23:25:31Z"
  },
  {
    "title": "Putin proposes direct peace talks with Ukraine after three years of war",
    "description": "MOSCOW: Russian President Vladimir Putin on Sunday (May 11) proposed direct talks with Ukraine in Istanbul on May 15 that he said should be aimed at achieving a durable peace and eliminating the root causes of the war. The announcement came hours after Kyiv a…",
    "link": "https://www.channelnewsasia.com/world/russia-ukraine-war-putin-direct-talks-may-15-istanbul-5122171",
    "timestamp": "2025-05-10T23:25:24Z"
  },
  {
    "title": "Zelenskyy cautious after Putin proposes direct peace talks with Ukraine",
    "description": "Ukrainian President Volodymyr Zelenskyy responded guardedly on Sunday (May 11) to a proposal from Russian President Vladimir Putin of rapid direct talks aimed at ending the war, saying Kyiv was willing to talk but only after Moscow agreed to a ceasefire. Puti…",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-cautious-russia-ukraine-war-putin-direct-talks-may-15-istanbul-5122171",
    "timestamp": "2025-05-10T23:25:00Z"
  },
  {
    "title": "Trump’s DHS Says More Dem Arrests Are ‘On The Table’ Following ICE Facility Protest",
    "description": "A DHS spokesperson accused several Democratic lawmakers, who were conducting a legal oversight at an ICE detention facility, of trespassing and assaulting federal agents.",
    "link": "https://www.huffpost.com/entry/dhs-spokesperson-arrest-new-jersey-democrats_n_681fc755e4b0330bb9855c72",
    "timestamp": "2025-05-10T23:24:40Z"
  },
  {
    "title": "Donald Trump claims credit for India-Pakistan ceasefire; agreement after Pakistan reached out, says government",
    "description": "India News: NEW DELHI: After three nights of intense aerial warfare, India and Pakistan reached an understanding to end the fighting that President Donald Trump c.",
    "link": "https://timesofindia.indiatimes.com/india/from-near-war-to-pause-to-violation-ceasefire-donald-trump-claims-credit-agreement-after-pakistan-reached-out-says-government/articleshow/121067756.cms",
    "timestamp": "2025-05-10T23:20:13Z"
  },
  {
    "title": "U.S. and China conclude first day of talks in bid to ease trade war",
    "description": "U.S. Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng are leading the negotiations expected to span two days in Geneva.",
    "link": "https://www.japantimes.co.jp/business/2025/05/11/economy/us-china-trade-talks/",
    "timestamp": "2025-05-10T23:19:00Z"
  },
  {
    "title": "Tesla Fired Employee Who Created Website Criticizing Billionaire Elon Musk: Report",
    "description": "Matthew Labrot, a Tesla employee, was reportedly fired for setting up a website criticizing CEO Elon Musk's political views.",
    "link": "https://www.benzinga.com/news/25/05/45336364/tesla-fired-employee-who-created-website-criticizing-billionaire-elon-musk-report",
    "timestamp": "2025-05-10T23:12:30Z"
  },
  {
    "title": "Golfer Phil Mickelson Drops Snarky Slam at Newsom Over Trump Infrastructure Tweet: Show Him California’s ‘Great High Speed Rail’",
    "description": "Newsom announced he was suing Trump over his decision to withhold billions of dollars in funding approved by Congress for electric vehicle infrastructure.\nThe post Golfer Phil Mickelson Drops Snarky Slam at Newsom Over Trump Infrastructure Tweet: Show Him Cal…",
    "link": "https://www.mediaite.com/news/golfer-phil-mickelson-drops-snarky-slam-at-newsom-over-trump-infrastructure-tweet-show-him-californias-great-high-speed-rail/",
    "timestamp": "2025-05-10T23:11:47Z"
  },
  {
    "title": "India and Pakistan reach U.S.-backed truce though clashes erupt anew",
    "description": "The Indian and Pakistani militaries had targeted each others’ bases, fueling fears of an all-out war — and the possibility of nuclear weapons being used.",
    "link": "https://www.japantimes.co.jp/news/2025/05/11/asia-pacific/india-pakistan-ceasefire/",
    "timestamp": "2025-05-10T23:11:00Z"
  },
  {
    "title": "'Latest controversy' erupts in Oval Office as statue showing Trump being shot appears",
    "description": "The \"latest controversy\" in the Oval Office is a statue that has been \"spotted\" there, according to a new report.Donald Trump's rally where a wannabe assassin grazed Trump's ear with a bullet became a flashpoint of the election, and now it's creating drama in…",
    "link": "https://www.rawstory.com/trump-shooter-statue-oval-office/",
    "timestamp": "2025-05-10T23:10:08Z"
  },
  {
    "title": "India and Pakistan accuse each other of breaking ceasefire as explosions rock border region",
    "description": "Pakistan’s prime minister has declared ‘victory’ as tensions remain on a knife-edge between the two countries.",
    "link": "https://7news.com.au/news/india-and-pakistan-blame-each-other-for-ceasefire-violation-as-explosions-rock-border-region-c-18652738",
    "timestamp": "2025-05-10T23:03:08Z"
  },
  {
    "title": "Wells Fargo execs got reduced fines for fraud, but no evidence it was due to bank's donation to Trump's inauguration",
    "description": "Fines for former banking executives involved in a fraud scandal plummeted from a combined $8.5 million to a combined $150,000.",
    "link": "https://www.snopes.com//news/2025/05/10/wells-fargo-execs-reduced-fines/",
    "timestamp": "2025-05-10T23:00:00Z"
  },
  {
    "title": "Rumors Swirl After Prediction That Trump Will Recognize Palestinian State, Fundamentally Change Balance of Power in Middle East",
    "description": "Could President Donald Trump officially recognize Palestine as an independent state on his trip to the Middle East? That’s what some analysts are predicting as a lively debate rages in the Arab media sphere over just how far the U.S. president will go while a…",
    "link": "https://freerepublic.com/focus/f-bloggers/4316218/posts",
    "timestamp": "2025-05-10T22:56:55Z"
  },
  {
    "title": "Donald Trump labeled 'so dumb' over awkward Barbie doll trade tariff mix-up",
    "description": "Donald Trump labeled 'so dumb' over awkward Barbie doll trade tariff mix-up\nUS President Donald Trump spoke out in response to Mattel CEO Ynon Kreiz after he pledged to seek more toy manufacturing opportunities outside of China - but not in the US\nIt seems no…",
    "link": "https://biztoc.com/x/3cda4bbdf0a88862",
    "timestamp": "2025-05-10T22:48:06Z"
  },
  {
    "title": "Trump team mulls suspending the constitutional right of habeas corpus to speed deportations. Can it?",
    "description": "White House deputy chief of staff Stephen Miller says President Donald Trump is looking for ways to expand its legal power to deport migrants who are in the United States illegally. To achieve that, he says the administration is “actively looking at” suspendi…",
    "link": "https://biztoc.com/x/e4c65897775acf0a",
    "timestamp": "2025-05-10T22:48:01Z"
  },
  {
    "title": "Economist says Labor's victory could change global energy trade",
    "description": "Hydrogen is not dead, and Labor's historic victory could change the global energy trade, economist Ross Garnaut says.",
    "link": "https://www.abc.net.au/news/2025-05-11/labor-victory-could-change-global-energy-trade-says-ross-garnaut/105269302",
    "timestamp": "2025-05-10T22:44:32Z"
  },
  {
    "title": "US ‘not genuine’ in talks over Tehran’s nuclear program, Iranian official says | CNN",
    "description": "An Iranian official told CNN that recent indirect talks with the United States aimed at addressing Tehran’s nuclear program and lifting sanctions were “not genuine” from the American side and were likely designed from the outset as a “trap to draw the situati…",
    "link": "https://www.cnn.com/2025/05/10/middleeast/us-iran-nuclear-talks-latam-intl",
    "timestamp": "2025-05-10T22:41:04Z"
  },
  {
    "title": "Ticker: Trump’s trip to Saudi Arabia raises the prospect of US nuclear cooperation with the kingdom",
    "description": "Saudi Arabia wants U.S. help developing its own civil nuclear program. Plus: Google will pay Texas $1.4B to settle claims the company collected users' data without permission.",
    "link": "https://www.bostonherald.com/2025/05/10/ticker-trumps-trip-to-saudi-arabia-raises-the-prospect-of-us-nuclear-cooperation-with-the-kingdom/",
    "timestamp": "2025-05-10T22:33:30Z"
  },
  {
    "title": "Is Bitcoin Price Heading To $137K? Market Expert Says BTC Broke Out Since Nov. 2024",
    "description": "After a somewhat sluggish start to 2025, the Bitcoin price has begun to impress in the year’s second quarter. The premier cryptocurrency reclaimed the $100,000 mark earlier this week and seems to be making a play for its all-time high price at $108,786 over t…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-price-heading-to-137000-market-btc-broke-out/",
    "timestamp": "2025-05-10T22:30:29Z"
  },
  {
    "title": "‘They’ll Be Arrested!’ Trump Border Czar Homan Warns Dems Can ‘Scream All They Want’ But Can’t ‘Cross the Line’ and Impede ICE Or Else",
    "description": "Tom Homan accused Democrats of caring about politics, not due process, and warned them they'll be arrested if they try to stop ICE from enforcement.\nThe post ‘They’ll Be Arrested!’ Trump Border Czar Homan Warns Dems Can ‘Scream All They Want’ But Can’t ‘Cross…",
    "link": "https://www.mediaite.com/tv/theyll-be-arrested-trump-border-czar-homan-warns-dems-can-scream-all-they-want-but-cant-cross-the-line-and-impede-ice-or-else/",
    "timestamp": "2025-05-10T22:30:13Z"
  },
  {
    "title": "Press Sec Leavitt Tells A Whopper About Firing Librarian Of Congress",
    "description": "The Trump administration is pretending that Carla Hayden, the just-fired Librarian of Congress lost her job because she was promoting “inappropriate books for children.” But the Library of Congress is a research library that has NOTHING to do with promoting b…",
    "link": "https://crooksandliars.com/2025/05/press-sec-leavitt-tells-whopper-about",
    "timestamp": "2025-05-10T22:30:02Z"
  },
  {
    "title": "Canada as our 51st state would mean a House Speaker Hakeem Jeffries",
    "description": "Politics of U.S. neighbor would likely bring 34 more Dems to Congress",
    "link": "https://www.wnd.com/2025/05/canada-as-our-51st-state-would-mean-a-house-speaker-hakeem-jeffries/",
    "timestamp": "2025-05-10T22:27:13Z"
  },
  {
    "title": "Mutually Assured Law Enforcement Destruction",
    "description": "'Unilateral disarmament in the face of an insatiable foe is a proven strategic failure'",
    "link": "https://www.wnd.com/2025/05/mutually-assured-law-enforcement-destruction/",
    "timestamp": "2025-05-10T22:25:44Z"
  },
  {
    "title": "Mexico sues Google for labeling Gulf of Mexico as ‘Gulf of America’",
    "description": "Mexico has sued tech giant Google over its labelling of the Gulf of Mexico as the Gulf of America, a change made by U.S. President Donald Trump via executive order, Mexico President Claudia Sheinbaum said Friday.\nSheinbaum did not provide details of the lawsu…",
    "link": "https://biztoc.com/x/137621c92a8143dc",
    "timestamp": "2025-05-10T22:25:37Z"
  },
  {
    "title": "US-China tariff talks to continue Sunday, an official says",
    "description": "Sensitive talks between U.S. and Chinese delegations over tariffs that threaten to upend the global economy ended after a day of prolonged negotiations and will resume Sunday, an official told The Associated Press.",
    "link": "https://www.bostonherald.com/2025/05/10/us-china-tariff-talks-to-continue-sunday-an-official-says/",
    "timestamp": "2025-05-10T22:25:19Z"
  },
  {
    "title": "Trump 'screws MAGA voters' over as attempt to burn Biden backfires: analyst",
    "description": "Donald Trump recently went all out in an effort to reverse a Joe Biden-era program, only to hurt his own voters in the process, according to a report.Greg Sargent, staff writer at the New Republic, wrote over the weekend that the president \"grew angry over a …",
    "link": "https://www.rawstory.com/trump-screws-over-maga-voters/",
    "timestamp": "2025-05-10T22:24:46Z"
  },
  {
    "title": "Camryn Kinsey to return this week on Fox News show she fainted on",
    "description": "\"It was very scary,\" Kinsey recounted. \"I honestly felt worse for the audience and the Fox News crew that was helping me than I than I did myself.\"",
    "link": "https://nypost.com/2025/05/10/us-news/camryn-kinsey-to-return-to-fox-news-after-fainting-on-air/",
    "timestamp": "2025-05-10T22:17:29Z"
  },
  {
    "title": "The FTC puts off enforcing its ‘click-to-cancel’ rule",
    "description": "The Federal Trade Commission (FTC) was set to start enforcing the remaining provisions of its “click-to-cancel” rule on May 14th, requiring that subscriptions be as easy to cancel as to start. Now, the agency says it won’t enforce the rule until July 14th, as…",
    "link": "https://www.theverge.com/news/664730/ftc-delay-click-to-cancel-rule",
    "timestamp": "2025-05-10T22:14:25Z"
  },
  {
    "title": "Key prosecutor in Trump’s classified documents case to testify in front of House Judiciary Committee | CNN Politics",
    "description": "A key federal prosecutor in the classified documents case against President Donald Trump is expected to privately testify in front of the House Judiciary Committee in the coming days, a source familiar with the process told CNN.",
    "link": "https://www.cnn.com/2025/05/10/politics/jay-bratt-classified-documents-judiciary-committee",
    "timestamp": "2025-05-10T22:13:03Z"
  },
  {
    "title": "Jen Psaki’s MSNBC Show is a Ratings Disaster in Most Important Demographic",
    "description": "\"shed a staggering 53% of its demo viewers compared to the first episode only one day prior\"\nThe post Jen Psaki’s MSNBC Show is a Ratings Disaster in Most Important Demographic first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/jen-psakis-msnbc-show-is-a-ratings-disaster-in-most-important-demographic/",
    "timestamp": "2025-05-10T22:00:49Z"
  },
  {
    "title": "BlackRock Meets With SEC To Discuss Staking, Tokenization, Others – Details",
    "description": "Executives of American investment firm BlackRock met with the US Securities and Exchange Commission (SEC) ‘s crypto task force on Friday to discuss various matters pertaining to cryptocurrency spot exchange-traded products (ETPs). This discussion, among other…",
    "link": "https://bitcoinist.com/blackrock-sec-to-discuss-staking-tokenization-other/",
    "timestamp": "2025-05-10T22:00:09Z"
  },
  {
    "title": "Donald Trump's Approval Rating Double-Digits Above Water on Key Issue—Poll",
    "description": "A majority of Americans are supportive of the president's transgender policies, according to a new AP-NORC poll.",
    "link": "https://www.newsweek.com/donald-trumps-approval-rating-double-digits-above-water-key-issue-poll-2070604",
    "timestamp": "2025-05-10T21:59:17Z"
  },
  {
    "title": "Transgender issues are a strength for Trump, poll finds",
    "description": "About half of U.S. adults approve of how President Donald Trump is handling transgender issues, according to a new poll — a relative high point for a president who has the approval overall of about 4 in 10 Americans.",
    "link": "https://www.bostonherald.com/2025/05/10/transgender-issues-are-a-strength-for-trump-poll-finds/",
    "timestamp": "2025-05-10T21:52:28Z"
  },
  {
    "title": "Trump must halt mass layoffs of federal workers, judge rules",
    "description": "The Trump administration must temporarily cease from engaging in widespread layoffs and firings for government workers, a California federal court ruled Friday.\nPresident Donald Trump’s February executive order calling for a radical reorganization of the fede…",
    "link": "https://biztoc.com/x/2e6ceb213b3a88a5",
    "timestamp": "2025-05-10T21:52:20Z"
  },
  {
    "title": "Trump must halt mass layoffs of federal workers, judge rules",
    "description": "The Trump administration must temporarily cease from engaging in widespread layoffs and firings for government workers, a California federal court ruled.",
    "link": "https://www.bostonherald.com/2025/05/10/trump-must-halt-mass-layoffs-of-federal-workers-judge-rules/",
    "timestamp": "2025-05-10T21:51:05Z"
  },
  {
    "title": "Ukraine and allies urge Putin to commit to a 30-day ceasefire or face new sanctions",
    "description": "European leaders proposed a 30-day ceasefire in Ukraine. They warned Russia of increased sanctions if the offer gets rejected. The proposal has the backing of US President Donald Trump. Ukrainian President Volodymyr Zelenskyy called the meeting a very importa…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-and-allies-urge-putin-to-commit-to-a-30-day-ceasefire-or-face-new-sanctions/articleshow/121066933.cms",
    "timestamp": "2025-05-10T21:49:35Z"
  },
  {
    "title": "Trump Abruptly Fires Carla Hayden, First Black Librarian Of Congress",
    "description": "The first Black woman to lead the Library of Congress was fired by email. Critics say the move is part of a broader war on truth, books, and history.",
    "link": "http://www.essence.com/news/trump-fires-first-black-librarian-of-congress/",
    "timestamp": "2025-05-10T21:45:37Z"
  },
  {
    "title": "John Cleese Admits He 'Actively Thinks About' Suspending Donald Trump's Deputy Chief of Staff Stephen Miller 'By The Neck'",
    "description": "John Cleese's comment was in response to Stephen Miller's recent comments about potentially suspending the constitutional right of habeas corpus",
    "link": "https://radaronline.com/p/john-cleese-thinks-about-hanging-donald-trump-stephen-miller/",
    "timestamp": "2025-05-10T21:45:00Z"
  },
  {
    "title": "As Trump heads to the Middle East, fixing explosive crises takes a back seat to deal-making",
    "description": "U.S. President Donald Trump will start his Middle East trip Tuesday by visiting Saudi Arabia. The country has opened up and relaxed its strict social code in recent years as it looks for partners to help it transition away from an oil economy. But the war in …",
    "link": "https://www.cbc.ca/news/world/trump-middle-east-trip-1.7532075",
    "timestamp": "2025-05-10T21:42:52Z"
  },
  {
    "title": "Actor John Cleese Suggests Suspending Stephen Miller 'By the Neck,' Deletes Tweet",
    "description": "\"Harry Potter\" and \"Monty Python and the Holy Grail\" actor John Cleese suggested in a now-deleted post on social media, that White House deputy chief of staff Stephen Miller be suspended by his neck over comments made regarding habeas corpus.\nThe post Actor J…",
    "link": "https://www.breitbart.com/entertainment/2025/05/10/actor-john-cleese-suggests-suspending-stephen-miller-by-the-neck-deletes-tweet/",
    "timestamp": "2025-05-10T21:36:49Z"
  },
  {
    "title": "'Bigger problem': Conservative highlights 'worse explanation' for lack of Trump pushback",
    "description": "Donald Trump's most dangerous actions are flying under the radar for an even worse reason than some might expect, a conservative Atlantic columnist said Saturday.Former Republican Tom Nichols appeared on MSNBC for an extended interview over the weekend, and w…",
    "link": "https://www.rawstory.com/there-s-a-worse-explanation/",
    "timestamp": "2025-05-10T21:34:51Z"
  },
  {
    "title": "World's two largest economies meet in Geneva to discuss trade tariffs",
    "description": "Talks between the United States and China aimed at easing their potentially devastating battles over trade will continue on Sunday in Geneva.",
    "link": "https://www.abc.net.au/news/2025-05-11/china-us-trade-talks-in-geneva-to-continue/105278420",
    "timestamp": "2025-05-10T21:34:11Z"
  },
  {
    "title": "'There Is One Specific Candidate': Jasmine Crockett Hints At Dem Nominee For 2028",
    "description": "\"I had a donor on the phones with me telling me that all the donors are lining up behind that candidate,\" the Texas Democrat teased Thursday.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-democratic-candidate-2028_n_681f9525e4b06987bce122ea",
    "timestamp": "2025-05-10T21:31:33Z"
  },
  {
    "title": "‘This Facility is ABOUT Due Process!’ Trump Border Czar Trashes Dem Mayor Arrested at ICE Facility Protest: ‘He’s Not Very Smart’",
    "description": "Border czar Tom Homan said the Newark Mayor isn't smart and that the ICE facility that was the site of a major confrontation is actually \"about\" due process.\nThe post ‘This Facility is ABOUT Due Process!’ Trump Border Czar Trashes Dem Mayor Arrested at ICE Fa…",
    "link": "https://www.mediaite.com/news/this-facility-is-about-due-process-trump-border-czar-trashes-dem-mayor-arrested-at-ice-facility-protest-hes-not-very-smart/",
    "timestamp": "2025-05-10T21:30:47Z"
  },
  {
    "title": "Trillions in sales for S&P 500 companies at stake as US-China talks begin",
    "description": "U.S. equity investors will be watching closely as trade talks kick off between the Trump administration and China, with trillions of dollars hanging in the balance for American companies. The average member of the S&P 500 made 6.1% of its revenue from selling…",
    "link": "https://www.bostonherald.com/2025/05/10/trillions-in-sales-for-sp-500-companies-at-stake-as-us-china-talks-begin/",
    "timestamp": "2025-05-10T21:30:00Z"
  },
  {
    "title": "Measles outbreak in North Dakota prompts local health officials to quarantine unvaccinated schoolchildren - NewsBreak",
    "description": "Measles cases continue to accumulate in the United States in what is already the second-worst year since the disease was declared eliminated a quarter-cent",
    "link": "https://www.newsbreak.com/news/3999725586902-measles-outbreak-in-north-dakota-prompts-local-health-officials-to-quarantine-unvaccinated-schoolchildren?noAds=1&amp;_f=app_share&amp;s=a2&amp;share_destination_id=Mjg0MjI3ODEyLTE3NDY5MTIyNzYxODg%3D",
    "timestamp": "2025-05-10T21:25:06Z"
  },
  {
    "title": "WATCH: Body Cam Footage Catches Democrats ‘Screaming in ICE Agents’ Faces’ at NJ Facility Where Mayor Was Arrested",
    "description": "According to Fox News, the video showed “New Jersey Democratic representatives shoving DHS agents and screaming in ICE agents' faces while trying to enter.\"\nThe post WATCH: Body Cam Footage Catches Democrats ‘Screaming in ICE Agents’ Faces’ at NJ Facility Whe…",
    "link": "https://www.mediaite.com/tv/watch-body-cam-footage-catches-democrats-screaming-in-ice-agents-faces-at-nj-facility-where-mayor-was-arrested/",
    "timestamp": "2025-05-10T21:23:30Z"
  },
  {
    "title": "Trump’s New Weaponization Czar Ed Martin Unleashes Hell on Deep State — Quietly Investigates Russiagate Architects and Lawfare Operatives Including Weissmann",
    "description": "President Donald Trump has appointed Ed Martin as the head of the newly formed Justice Department Weaponization Working Group — a move that has Democrats, NeverTrumpers, and deep state operatives sweating bullets.\nThe post Trump’s New Weaponization Czar Ed Ma…",
    "link": "https://www.thegatewaypundit.com/2025/05/trumps-new-weaponization-czar-ed-martin-unleashes-hell/",
    "timestamp": "2025-05-10T21:20:10Z"
  },
  {
    "title": "Tesla Fired Employee Who Created Website Criticizing Billionaire Elon Musk: Report",
    "description": "35-year-old Matthew Labrot was reportedly fired by Tesla Inc. (NASDAQ:TSLA) for setting up a website criticizing the company's CEO, Elon Musk. What Happened:...",
    "link": "https://finance.yahoo.com/news/tesla-fired-employee-created-website-211230442.html",
    "timestamp": "2025-05-10T21:12:30Z"
  },
  {
    "title": "트럼프 무역 정책, 지속적 인플레이션 압력과 높은 실업률 초래할 것",
    "description": "On a day when more than half of the Federal Reserve’s policymakers offered public remarks, not one made it sound like the US central bank was near lowering interest rates https://t.co/CSx2p8Qep0— Bloomberg (@business) May 10, 2025 Treasury Secretary Scott Bes…",
    "link": "https://ryueyes11.tistory.com/511620",
    "timestamp": "2025-05-10T21:09:47Z"
  },
  {
    "title": "Report: Humanitarian aid to Gaza set to restart in two weeks",
    "description": "IDF to provide security, private American companies to distribute aid, prevent Hamas interference.",
    "link": "https://www.israelnationalnews.com/news/408131",
    "timestamp": "2025-05-10T21:09:30Z"
  },
  {
    "title": "Senator tells Charlie Kirk if he thinks Judge Jeanine will be confirmed",
    "description": "Trump says he will nominate Fox host for interim U.S. attorney for Washington, D.C.",
    "link": "https://www.wnd.com/2025/05/senator-tells-charlie-kirk-if-he-thinks-judge-jeanine-will-be-confirmed/",
    "timestamp": "2025-05-10T21:09:06Z"
  },
  {
    "title": "Ukraine demands 30-day truce backed by allies including US",
    "description": "A refusal by Russian President Vladimir Putin to observe the truce would trigger a fresh wave of sanctions targeting energy and the financial sector, Ukrainian President Volodymyr Zelenskyy said in Kyiv on Saturday.",
    "link": "https://www.bostonherald.com/2025/05/10/ukraine-demands-30-day-truce-backed-by-allies-including-us/",
    "timestamp": "2025-05-10T21:08:56Z"
  },
  {
    "title": "India, Pakistan end hostilities after US mediates ceasefire",
    "description": "The ceasefire comes after the Indian and Pakistani militaries targeted each others’ bases. World powers including China, Saudi Arabia, and the Group of Seven had urged a dialog after dozens of civilians were killed in a series of attacks.",
    "link": "https://www.bostonherald.com/2025/05/10/india-pakistan-end-hostilities-after-us-mediates-ceasefire/",
    "timestamp": "2025-05-10T21:03:25Z"
  },
  {
    "title": "Vatican goes viral: TikTokers fascinated by pope election",
    "description": "The ritual for electing a new pope took social media by storm this week as content creators reacted to the ancient tradition with memes, skits and parodies.",
    "link": "https://www.foxnews.com/media/vatican-goes-viral-tiktokers-fascinated-who-next-pope",
    "timestamp": "2025-05-10T21:00:48Z"
  },
  {
    "title": "Trump Replaces Acting FEMA Head With Unqualified Lackey",
    "description": "The Trump administration fired acting FEMA chief Cameron Hamilton one day after he dared to testify to Congress that he did not support dismantling the agency:\nCameron Hamilton, who was appointed by President Donald Trump, was escorted out of FEMA’s headquart…",
    "link": "https://crooksandliars.com/2025/05/trump-replaces-acting-fema-head",
    "timestamp": "2025-05-10T21:00:01Z"
  },
  {
    "title": "Facing a ‘Cinematic Extinction Event,’ Hollywood Must Stage a Comeback | Guest Column",
    "description": "A pandemic, production exodus, wildfires and now Trump tariffs? It's time for this town to stand strong\nThe post Facing a ‘Cinematic Extinction Event,’ Hollywood Must Stage a Comeback | Guest Column appeared first on TheWrap.",
    "link": "https://www.thewrap.com/hollywood-stage-a-comeback-trump-tariffs-richard-stellar/",
    "timestamp": "2025-05-10T21:00:00Z"
  },
  {
    "title": "Military scrambles to follow order to remove transgender troops",
    "description": "Pete Hegseth's new order gives active duty troops until June 6 to identify themselves as transgender and voluntarily begin to leave the service. National Guard and Reserve troops have until July 7.",
    "link": "https://www.wdsu.com/article/military-hegseth-order-remove-transgender-troops/64733867",
    "timestamp": "2025-05-10T20:55:47Z"
  },
  {
    "title": "Military scrambles to follow order to remove transgender troops",
    "description": "Pete Hegseth's new order gives active duty troops until June 6 to identify themselves as transgender and voluntarily begin to leave the service. National Guard and Reserve troops have until July 7.",
    "link": "https://www.wcvb.com/article/military-hegseth-order-remove-transgender-troops/64733867",
    "timestamp": "2025-05-10T20:55:44Z"
  },
  {
    "title": "Military scrambles to follow order to remove transgender troops",
    "description": "Pete Hegseth's new order gives active duty troops until June 6 to identify themselves as transgender and voluntarily begin to leave the service. National Guard and Reserve troops have until July 7.",
    "link": "https://www.wyff4.com/article/military-hegseth-order-remove-transgender-troops/64733867",
    "timestamp": "2025-05-10T20:51:33Z"
  },
  {
    "title": "Military scrambles to follow order to remove transgender troops",
    "description": "Pete Hegseth's new order gives active duty troops until June 6 to identify themselves as transgender and voluntarily begin to leave the service. National Guard and Reserve troops have until July 7.",
    "link": "https://www.wmur.com/article/military-hegseth-order-remove-transgender-troops/64733867",
    "timestamp": "2025-05-10T20:51:29Z"
  },
  {
    "title": "Military scrambles to follow order to remove transgender troops",
    "description": "Pete Hegseth's new order gives active duty troops until June 6 to identify themselves as transgender and voluntarily begin to leave the service. National Guard and Reserve troops have until July 7.",
    "link": "https://www.wlky.com/article/military-hegseth-order-remove-transgender-troops/64733867",
    "timestamp": "2025-05-10T20:51:29Z"
  },
  {
    "title": "Military scrambles to follow order to remove transgender troops",
    "description": "Pete Hegseth's new order gives active duty troops until June 6 to identify themselves as transgender and voluntarily begin to leave the service. National Guard and Reserve troops have until July 7.",
    "link": "https://www.ketv.com/article/military-hegseth-order-remove-transgender-troops/64733867",
    "timestamp": "2025-05-10T20:51:28Z"
  },
  {
    "title": "Military scrambles to follow order to remove transgender troops",
    "description": "Pete Hegseth's new order gives active duty troops until June 6 to identify themselves as transgender and voluntarily begin to leave the service. National Guard and Reserve troops have until July 7.",
    "link": "https://www.kcra.com/article/military-hegseth-order-remove-transgender-troops/64733867",
    "timestamp": "2025-05-10T20:51:26Z"
  },
  {
    "title": "Trump: India, Pakistan Agree To ‘Full And Immediate’ Cease-fire",
    "description": "President Donald Trump has announced a “full immediate ceasefire” between Pakistan and India. On Saturday, the president announced the ceasefire in a post on his Truth Social. “After a long night of talks mediated by the United States, I am pleased to announc…",
    "link": "https://freerepublic.com/focus/f-news/4316206/posts",
    "timestamp": "2025-05-10T20:50:27Z"
  },
  {
    "title": "Iran will not back down from nuclear rights, foreign minister says",
    "description": "Iranian Foreign Minister Abbas Araqchi said on Saturday that if the United States' goal is to deprive Iran of its &quot;nuclear rights&quot;, Tehran will never back down over those rights. Araqchi was speaking in Doha a day ahead of another round of planned n…",
    "link": "https://japantoday.com/category/world/iran-will-not-back-down-from-nuclear-rights-foreign-minister-says",
    "timestamp": "2025-05-10T20:50:27Z"
  },
  {
    "title": "Trump team mulls suspending constitutional right of habeas corpus to speed deportations",
    "description": "White House deputy chief of staff Stephen Miller says President Donald Trump is looking for ways to expand its legal power to deport migrants who are in the United States illegally. To achieve that, he says the administration is “actively looking at” suspendi…",
    "link": "https://japantoday.com/category/world/trump-team-mulls-suspending-the-constitutional-right-of-habeas-corpus-to-speed-deportations.-can-it",
    "timestamp": "2025-05-10T20:49:42Z"
  },
  {
    "title": "U.S. and Chinese officials to resume talks to ease trade war on Sunday",
    "description": "Top U.S. and Chinese officials wrapped up the first day of talks in Switzerland on Saturday aimed at defusing a trade war that threatens to hammer the global economy and planned to resume negotiations on Sunday, a source close to the discussions said. Chinese…",
    "link": "https://japantoday.com/category/world/us-and-chinese-officials-to-resume-talks-to-ease-trade-war-on-sunday1",
    "timestamp": "2025-05-10T20:49:28Z"
  },
  {
    "title": "European leaders tell Putin to agree to Ukraine ceasefire or face new sanctions",
    "description": "Major European powers threw their weight behind an unconditional 30-day Ukraine ceasefire on Saturday, with the backing of U.S. President Donald Trump, and threatened President Vladimir Putin with &quot;massive&quot; new sanctions if he did not accept within …",
    "link": "https://japantoday.com/category/world/european-leaders-tell-putin-to-agree-to-ukraine-ceasefire-or-face-new-sanctions1",
    "timestamp": "2025-05-10T20:49:18Z"
  },
  {
    "title": "US envoy calls enrichment 'red line' ahead of new Iran talks",
    "description": "WASHINGTON - The United States and Iran will hold a new round of nuclear talks Sunday in Oman ahead of a visit to the region by Donald Trump, whose key negotiator staked out an increasingly hard line on the issue of uranium enrichment.",
    "link": "https://www.bangkokpost.com/world/3022417/us-envoy-calls-enrichment-red-line-ahead-of-new-iran-talks",
    "timestamp": "2025-05-10T20:49:00Z"
  },
  {
    "title": "India, Pakistan reach ceasefire -- but trade claims of violations",
    "description": "India and Pakistan traded accusations of ceasefire violations early Sunday, hours after U.S. President Donald Trump announced that the nuclear-armed neighbors had stepped back from the brink of full-blown war. India's foreign secretary said Pakistan had commi…",
    "link": "https://japantoday.com/category/world/india-claims-pakistan-violated-truce-says-it-is-retaliating",
    "timestamp": "2025-05-10T20:48:42Z"
  },
  {
    "title": "Measles Cases In The U.S. Just Hit 1,000. RFK Jr. Still Isn't Taking It Seriously.",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. has downplayed the deadly spread and promoted a range of unproven treatments.",
    "link": "https://www.huffpost.com/entry/us-measles-cases-1000-rfk-jr-hhs_n_681f8e4be4b0108bb6b70ed3",
    "timestamp": "2025-05-10T20:41:42Z"
  },
  {
    "title": "Exclusive – Ed Martin Assumes Powerful DOJ Post: 'Greatest Job I Could Ever Envision' to Target Weaponization",
    "description": "Ed Martin has a message for the forces who blocked his nomination for U.S. Attorney for the District of Columbia: Be careful what you wish for.\nThe post Exclusive – Ed Martin Assumes Powerful DOJ Post: ‘Greatest Job I Could Ever Envision’ to Target Weaponizat…",
    "link": "https://www.breitbart.com/politics/2025/05/10/exclusive-ed-martin-assumes-powerful-doj-post-greatest-job-i-could-ever-envision-to-target-weaponization/",
    "timestamp": "2025-05-10T20:41:26Z"
  },
  {
    "title": "Defeating the Ayatollahs—despite Donald Trump",
    "description": "Netanyahu now faces a fateful choice: tolerate Iran’s sprint toward a nuclear bomb, or act unilaterally and risk sacrificing American military and diplomatic support. Opinion.",
    "link": "https://www.israelnationalnews.com/news/408130",
    "timestamp": "2025-05-10T20:40:56Z"
  },
  {
    "title": "Mexico sues Google for following Trump’s ‘Gulf of America’ name change, Sheinbaum says",
    "description": "Mexico has sued Google for adopting the name “Gulf of America” for users of Google Maps in the United States, President Claudia Sheinbaum said, making good on an earlier threat to take legal action against the tech company over the name change.",
    "link": "https://www.msnbc.com/top-stories/latest/mexico-sues-google-gulf-america-claudia-sheinbaum-maps-rcna206037",
    "timestamp": "2025-05-10T20:39:34Z"
  },
  {
    "title": "Meet The New Pope: Chicago Native Leo XIV Doesn’t Like Trump’s Immigration Policies, Pontchartrain Pontiff Has Covert Creole Roots",
    "description": "There’s a new pope of the Catholic Curch, and he’s the first pope to be born here in the U.SA. Not only that, but Pope Leo XIV, born Robert Francis Prevost, is of a Creole lineage that traces back to New Orleans, according to Jari Honora, a local genealogist …",
    "link": "http://bossip.com/2934057/meet-the-new-pope-chicago-native-leo-xiv-doesnt-like-trumps-immigration-policies-pontchartrain-pontiff-has-covert-creole-roots/",
    "timestamp": "2025-05-10T20:37:36Z"
  },
  {
    "title": "David Tennant Takes On \"Antichrist\" Trump's Alcatraz Plans & More",
    "description": "When it comes to U.S. POtuS Donald Trump, as with many important social issues, David Tennant (Doctor Who, Good Omens, Rivals) doesn't shy away from sharing how he feels – or from doing a little comedic knife-twisting along the way (look no further that this …",
    "link": "https://bleedingcool.com/tv/david-tennant-takes-on-antichrist-trumps-alcatraz-plans-more/",
    "timestamp": "2025-05-10T20:37:08Z"
  },
  {
    "title": "Trump, European leaders threaten ‘massive’ sanctions if Putin doesn’t accept 30-day cease-fire by Monday",
    "description": "President Trump and European leaders are demanding Russian President Vladimir Putin agree to a 30-day cease-fire starting Monday.",
    "link": "https://nypost.com/2025/05/10/us-news/trump-european-leaders-demand-putin-accepts-full-30-day-cease-fire/",
    "timestamp": "2025-05-10T20:36:16Z"
  },
  {
    "title": "Donald Trump's Legal Woes Deepen With Major Lawsuit From 15 States",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is facing another lawsuit from a coalition of states, this time over his efforts to fast-track energy-related projects that the plaintiffs say have attempted to bypass environmental prot…",
    "link": "https://biztoc.com/x/8df794fa9fd0436b",
    "timestamp": "2025-05-10T20:34:29Z"
  },
  {
    "title": "Donald Trump's Legal Woes Deepen With Major Lawsuit From 15 States",
    "description": "The president signed an executive order to fast-track energy initiatives on his first day back in office.",
    "link": "https://www.newsweek.com/donald-trump-legal-woes-deepen-major-lawsuit-states-2070582",
    "timestamp": "2025-05-10T20:31:46Z"
  },
  {
    "title": "Inside the White House's effort to pull India, Pakistan back from the brink of war",
    "description": "Twenty-four hours before President Donald Trump announced a ceasefire had been reached between India and Pakistan, the White House worked to de-escalate the situation.",
    "link": "https://www.foxnews.com/politics/inside-white-houses-effort-pull-india-pakistan-back-brink-war",
    "timestamp": "2025-05-10T20:23:40Z"
  },
  {
    "title": "Transgender issues are a strength for Trump, AP-NORC poll finds",
    "description": "A new AP-NORC poll finds that most U.S. adults agree with President Donald Trump that whether a person is a man or woman is determined by their sex at birth.WASHINGTON (AP) — About half of U.S. adults approve of how President Donald Trump is handling transgen…",
    "link": "https://freerepublic.com/focus/f-news/4316198/posts",
    "timestamp": "2025-05-10T20:23:17Z"
  },
  {
    "title": "India and Pakistan accuse each other of violating ceasefire hours after reaching deal",
    "description": "The blame game began only hours after President Trump announced Saturday that the U.S. had mediated an immediate ceasefire.",
    "link": "https://www.npr.org/2025/05/10/g-s1-65728/india-and-pakistan-accuse-each-other-of-violating-ceasefire-hours-after-reaching-deal",
    "timestamp": "2025-05-10T20:22:32Z"
  },
  {
    "title": "European leaders tell Putin to agree to Ukraine ceasefire or face new sanctions",
    "description": "KYIV: Major European powers threw their weight behind an unconditional 30-day Ukraine ceasefire on Saturday (May 10), with the backing of US President Donald Trump, and threatened President Vladimir Putin with \"mas",
    "link": "https://www.channelnewsasia.com/world/european-leaders-tell-putin-agree-ukraine-ceasefire-or-face-new-sanctions-5122041",
    "timestamp": "2025-05-10T20:22:24Z"
  },
  {
    "title": "India, Pakistan reach ceasefire — but trade claims of violations",
    "description": "India and Pakistan traded accusations of ceasefire violations early Sunday, hours after US President Donald Trump announced that the nuclear-armed neighbours had stepped back from the brink of full-blown war. India’s foreign secretary said Pakistan had commit…",
    "link": "https://www.digitaljournal.com/world/india-pakistan-reach-ceasefire-but-trade-claims-of-violations/article",
    "timestamp": "2025-05-10T20:22:20Z"
  },
  {
    "title": "Slow-motion thriller in US-China negotiations on Swiss tariffs – Beijing will hardly back down, says Politico",
    "description": "Small steps, no big twists in the US-China trade talks being held in Switzerland - Analysts closely following developments do not expect immediate concessions from Beijing\nThe post Slow-motion thriller in US-China negotiations on Swiss tariffs – Beijing will …",
    "link": "https://en.protothema.gr/2025/05/10/slow-motion-thriller-in-us-china-negotiations-on-swiss-tariffs-beijing-will-hardly-back-down-says-politico/",
    "timestamp": "2025-05-10T20:16:59Z"
  },
  {
    "title": "Are the Chinese Preparing to Take Over U.S. Oil Assets in Venezuela?",
    "description": "SCOOP:  Chinese representatives spotted at @PDVSA headquarters in Venezuela ahead of expiring US licenses for American oil companies in Venezuela  There are 17 more days left until the licenses for American oil companies in Venezuela will expire. Sources …",
    "link": "https://freerepublic.com/focus/f-news/4316196/posts",
    "timestamp": "2025-05-10T20:16:54Z"
  },
  {
    "title": "Trump Fires First Black Woman Librarian Of Congress Over DEI, Says She ‘Did Not Fit the Needs Of The American People’",
    "description": "In case it wasn’t already egregiously obvious, the White House is shamelessly showing that diversity is not part of its vision. According to USA Today, President Donald Trump has fired Carla Hayden, the first Black American and the first woman to lead the Lib…",
    "link": "http://bossip.com/2937375/trump-carla-hayden-firing/",
    "timestamp": "2025-05-10T20:14:49Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez Gets Unexpected Praise From Republican Colleague",
    "description": "Representative Mike Lawler of New York said his progressive colleague is now the \"leader\" of the Democratic Party.",
    "link": "https://www.newsweek.com/alexandria-ocasio-cortez-gets-unexpected-praise-republican-colleague-2070588",
    "timestamp": "2025-05-10T20:14:17Z"
  },
  {
    "title": "India and Pakistan accuse each other of 'violations' after ceasefire deal",
    "description": "Delhi and Islamabad accused each other of breaching a ceasefire brokered after four days of cross-border attacks.",
    "link": "https://www.bbc.com/news/articles/cvg9d913v20o",
    "timestamp": "2025-05-10T20:12:01Z"
  },
  {
    "title": "John Legend says it’s ‘shocking’ to watch former friend Kanye West’s ‘devolution’",
    "description": "\"He had so much optimism, so much creativity [in the mid-2000s]. It does feel sad, sometimes shocking, to see where he is now,\" Legend said of West.",
    "link": "https://pagesix.com/2025/05/10/celebrity-news/john-legend-says-its-shocking-to-watch-former-friend-kanye-wests-devolution/",
    "timestamp": "2025-05-10T20:09:44Z"
  },
  {
    "title": "New DNC vice chair tells Maher Dems lost because they used $2 billion to tell voters Biden’s not ‘too old’",
    "description": "DNC Vice Chair David Hogg said his party lost the 2024 election because it insisted to voters that former President Biden was cognitively fine and that the economy was good.",
    "link": "https://www.foxnews.com/media/new-dnc-vice-chair-tells-maher-dems-lost-because-2-billion-voters-bidens-not-too-old",
    "timestamp": "2025-05-10T20:05:48Z"
  },
  {
    "title": "J&K shaken by series of drone sightings, explosions hours after Indo-Pak ceasefire",
    "description": "STATE TIMES NEWS SRINAGAR/JAMMU: Barely hours after India and Pakistan reached an understanding to end military action on Saturday, Jammu and Kashmir was shaken by a series of drone sightings followed by explosions, prompting security personnel to engage air …",
    "link": "https://statetimes.in/jk-shaken-by-series-of-drone-sightings-explosions-hours-after-indo-pak-ceasefire/",
    "timestamp": "2025-05-10T20:02:59Z"
  }
]