[
  {
    "title": "AI, crypto and Trump super PACs stash millions to spend on the midterms",
    "description": "Political groups tied to the cryptocurrency and artificial intelligence industries have raked in tens of millions of dollars, according to new campaign finance reports.",
    "link": "https://www.nbcnews.com/politics/2026-election/ai-crypto-trump-super-pacs-stash-millions-spend-midterms-rcna256622",
    "timestamp": "2026-02-01T03:33:38Z"
  },
  {
    "title": "Trump says his Fed nominee Kevin Warsh could pick up support from Democrats",
    "description": "President Donald Trump expressed confidence in his Federal Reserve nominee Kevin Warsh. Trump believes Warsh can secure votes from some Democrats in the Senate. He anticipates Warsh will lower interest rates if confirmed. Trump described Warsh as a high-quali…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-says-federal-reserve-nominee-kevin-warsh-could-pick-up-support-from-democrats/articleshow/127831784.cms",
    "timestamp": "2026-02-01T03:32:30Z"
  },
  {
    "title": "US may make a deal on Cuba, Trump says",
    "description": "ABOARD AIR FORCE ONE, Jan 31 (Reuters) - U.S. President Donald Trump said on Saturday that he believed the United States would “work a deal” on Cuba.His comments came day… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/01/us-may-make-a-deal-on-cuba-trump-says",
    "timestamp": "2026-02-01T03:22:20Z"
  },
  {
    "title": "Persisterhood hosts another protest, 'Ice out for Good,' calls for ICE reform",
    "description": "ST. JOSEPH, Mo. (KQTV) -- In freezing temperatures, event organizers say over 300 people gathered in St. Joseph on Saturday for a rally organized in just five days, protesting what",
    "link": "https://www.kq2.com/news/persisterhood-hosts-another-protest-ice-out-for-good-calls-for-ice-reform/article_d0d6197e-21d8-4616-ba86-9e1532db364d.html",
    "timestamp": "2026-02-01T03:22:03Z"
  },
  {
    "title": "LA Olympic chief 'deeply regrets' flirty Maxwell emails in Epstein files",
    "description": "LOS ANGELES: Los Angeles Olympics chief Casey Wasserman apologised on Saturday (Jan 31) after decades-old flirty emails between him and Jeffrey Epstein's jailed former girlfriend appeared in a fresh cache of files",
    "link": "https://www.channelnewsasia.com/world/la-olympic-chief-deeply-regrets-flirty-maxwell-emails-in-epstein-files-5898831",
    "timestamp": "2026-02-01T03:18:39Z"
  },
  {
    "title": "MCX shares in focus on Budget day amid silver and gold sell-off",
    "description": "MCX shares are in focus as India’s commodity exchange opens for a rare Sunday trading session alongside the Union Budget, as gold and silver prices suffer a sharp global sell-off amid dollar strength and shifting expectations around US Federal Reserve leaders…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-in-focus-on-budget-day-amid-silver-and-gold-sell-off/articleshow/127831635.cms",
    "timestamp": "2026-02-01T03:17:11Z"
  },
  {
    "title": "Israeli Ceasefire Breaches in Gaza Jeopardize Peace Settlement - Egyptian Foreign Ministry",
    "description": "Israel's repeated ceasefire violations in the Gaza Strip undermine prospects for a political conflict resolution, the Egyptian Foreign Ministry said.",
    "link": "https://sputnikglobe.com/20260201/israeli-ceasefire-breaches-in-gaza-jeopardize-peace-settlement---egyptian-foreign-ministry-1123558733.html",
    "timestamp": "2026-02-01T03:14:00Z"
  },
  {
    "title": "Exxon, Chevron clock best month since 2022 as crude oil surges",
    "description": "Exxon was up 18 per cent in January and Chevron higher by 16 per cent. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/exxon-chevron-clock-best-month-since-2022-as-crude-oil-surges",
    "timestamp": "2026-02-01T03:05:45Z"
  },
  {
    "title": "'Spy Sheikh' Bought Secret Stake in Trump Company (Wall Street Journal)",
    "description": "Wall Street Journal:\n‘Spy Sheikh’ Bought Secret Stake in Trump Company  —  $500 million investment for 49% of World Liberty came months before U.A.E. won access to tightly guarded American AI chips  —  Four days before Donald Trump's inauguration last year, l…",
    "link": "https://www.memeorandum.com/260131/p63",
    "timestamp": "2026-02-01T02:55:01Z"
  },
  {
    "title": "Is the EU about to Dissolve Itself?",
    "description": "Just two days ago, I wrote an analysis on the European Union’s alleged “fears” that the United States would push it toward dissolution. Brussels is not very fond of President Donald Trump (mildly speaking) and is now openly blaming him for an attempt to facil…",
    "link": "https://www.globalresearch.ca/is-the-eu-about-to-dissolve-itself/5914354",
    "timestamp": "2026-02-01T02:54:22Z"
  },
  {
    "title": "Trump says India will buy oil from Venezuela, not Iran",
    "description": "U.S. President Donald Trump said on Saturday that India is likely to source its oil from Venezuela rather than Iran, as Washington continues to push its partners to cut ties with Tehran.",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/trump-says-india-will-buy-venezuelan-oil/articleshow/127831368.cms",
    "timestamp": "2026-02-01T02:48:24Z"
  },
  {
    "title": "Iranian President: War would benefit neither Iran nor US",
    "description": "Iranian President Pezeshkian tells Egypt's Al-Sisi that Tehran doesn't seek war with the US. Iran's top security official says progress has been made in negotiations despite US warships off Iran's shores.",
    "link": "https://www.israelnationalnews.com/news/421758",
    "timestamp": "2026-02-01T02:46:00Z"
  },
  {
    "title": "US judge orders release of five-year-old and father from ICE detention",
    "description": "Judge says the case stemmed from 'ill-conceived and incompetently-implemented' deportation quotas.",
    "link": "https://www.aljazeera.com/news/2026/2/1/us-judge-orders-release-of-five-year-old-and-father-from-ice-detention",
    "timestamp": "2026-02-01T02:32:15Z"
  },
  {
    "title": "US special envoy for Iraq Mark Savaya no longer in the post, reports",
    "description": "The move comes amid growing tensions between Washington and Baghdad over Washington's push to curb Iranian influence in Iraqi politics.",
    "link": "https://indianexpress.com/article/world/us-news/us-special-envoy-for-iraq-mark-savaya-no-longer-in-the-post-sources-say-10506279/",
    "timestamp": "2026-02-01T02:29:29Z"
  },
  {
    "title": "AARON MASAITIS: Donald Trump Is The President Europe Needs",
    "description": "After nearly 20 years of service in the United States Marine Corps, I've learned one enduring truth: peace is achieved through strength. America’s strength,",
    "link": "https://dailycaller.com/2026/01/31/opinion-donald-trump-is-the-president-europe-needs-aaron-masaitis/",
    "timestamp": "2026-02-01T02:28:49Z"
  },
  {
    "title": "Trump: I hope we can reach a deal with Iran that will be acceptable",
    "description": "US President Donald Trump spoke to reporters on Saturday night and reiterated his hopes of reaching a deal with Iran.“I hope we can reach a deal with Iran that will be acceptable. The Iranians are negotiating seriously,\" he said.",
    "link": "https://www.israelnationalnews.com/flashes/675505",
    "timestamp": "2026-02-01T02:27:00Z"
  },
  {
    "title": "Utah Expands Supreme Court Ahead Of Redistricting Appeal",
    "description": "'I would err on the side that seven sets of eyes reviewing the most complex and difficult issues our state has ever faced is better than having only five sets of eyes'",
    "link": "https://dailycaller.com/2026/01/31/utah-bill-expands-supreme-court-spencer-cox-redistricting-efforting/",
    "timestamp": "2026-02-01T02:26:14Z"
  },
  {
    "title": "Indian markets likely to open higher ahead of Union Budget",
    "description": "Indian stock markets anticipate a positive opening today. Investors await the federal budget presentation for insights into government spending and support for export sectors. The budget aims to balance growth initiatives with fiscal discipline. Expectations …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-markets-likely-to-open-higher-ahead-of-union-budget/articleshow/127831173.cms",
    "timestamp": "2026-02-01T02:23:12Z"
  },
  {
    "title": "Trump calls Cuba a failed nation and questions its future viability (VIDEO)",
    "description": "President Donald Trump once again addressed the situation in Cuba, rejecting the idea that his policy toward the island could be described as an attempt to “strangle” it and arguing instead that the real problem lies in the Cuban regime’s structural failure.\n…",
    "link": "https://gatewayhispanic.com/video/trump-calls-cuba-failed-nation-questions-its-future/",
    "timestamp": "2026-02-01T02:20:54Z"
  },
  {
    "title": "AMERICA PRAYER VIGIL - FEBRUARY 1, 2026 - (PRAYER)",
    "description": "Praying daily since 2015: Join with hundreds of FReepers in praying daily on FR for President Donald TRUMP, Vice President,J.D. Vance, and AMERICA: Government, Family, Military, Business, Education, Churches, Healthcare Systems and the Media. I urge, then, fi…",
    "link": "https://freerepublic.com/focus/f-religion/4364946/posts",
    "timestamp": "2026-02-01T02:19:11Z"
  },
  {
    "title": "'Melania' earns $8M opening weekend, marking best documentary debut in over 10 years",
    "description": "\"Melania\" documentary expected to earn upwards of $8 million in its opening weekend to finish third behind \"Iron Lung and \"Send Help.\"",
    "link": "https://www.foxnews.com/lifestyle/melania-documentary-earns-8m-opening-weekend-marking-best-documentary-debut-over-10-years",
    "timestamp": "2026-02-01T02:17:57Z"
  },
  {
    "title": "India Budget Seen Balancing Jobs Push With Fiscal Discipline",
    "description": "India’s Finance Minister Nirmala Sitharaman is expected to prioritize job-creating growth while emphasizing fiscal prudence in Sunday’s budget, as the country grapples with geopolitical risks and steep US tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/india-budget-seen-balancing-jobs-push-with-fiscal-discipline",
    "timestamp": "2026-02-01T02:10:30Z"
  },
  {
    "title": "Amber Rose defends Charlie Kirk's widow against online critics",
    "description": "Amber Rose defends Charlie Kirk's widow against online criticism, saying \"everyone grieves differently\" during recent livestream appearance with Sneako.",
    "link": "https://www.foxnews.com/entertainment/amber-rose-defends-charlie-kirks-widow-against-online-critics",
    "timestamp": "2026-02-01T02:03:03Z"
  },
  {
    "title": "Panama Supreme Court Ends Chinese Port Control, Marking Major Geopolitical Shift in Canal Zone",
    "description": "The “Donroe Doctrine” has not only halted Beijing’s quiet expansion into the Western Hemisphere but has also reasserted America’s influence over one of the most vital trade routes in the world.\nThe post Panama Supreme Court Ends Chinese Port Control, Marking …",
    "link": "https://legalinsurrection.com/2026/01/panama-supreme-court-ends-chinese-port-control-marking-major-geopolitical-shift-in-canal-zone/",
    "timestamp": "2026-02-01T02:00:36Z"
  },
  {
    "title": "Trump Admin Uses Equity Stakes, New Mines to Secure Critical Minerals Supply Chain",
    "description": "Since the beginning of President Donald Trump’s second term, the administration has been aggressively pursuing the development of new mines for critical minerals and rare earths, wherever they can be found (and, in particular, if the source is American or a r…",
    "link": "https://wattsupwiththat.com/2026/01/31/trump-admin-uses-equity-stakes-new-mines-to-secure-critical-minerals-supply-chain/",
    "timestamp": "2026-02-01T02:00:00Z"
  },
  {
    "title": "These are criminals, not protesters",
    "description": "The moment violence erupts — assaults, vandalism, arson, obstruction, as we saw in LA — the argument is over. Those are crimes, not political statements.",
    "link": "https://nypost.com/2026/01/31/opinion/criminals-not-protesters/",
    "timestamp": "2026-02-01T01:55:42Z"
  },
  {
    "title": "With Trump mum, last US-Russia nuclear pact set to end",
    "description": "The final global treaty restricting nuclear weapon deployment, New START, is set to expire on Thursday, leaving the US and Russia without limitations. Despite Russian President Putin's suggestion for a one-year extension, President Trump has remained largely …",
    "link": "https://economictimes.indiatimes.com/news/defence/with-trump-mum-last-us-russia-nuclear-pact-set-to-end/articleshow/127830974.cms",
    "timestamp": "2026-02-01T01:53:41Z"
  },
  {
    "title": "Power tie: Why Demi Moore, Nicole Kidman are reviving the necktie on red carpets as a feminist statement",
    "description": "Fashion experts say the tie’s cyclical return often mirrors periods when women’s gains feel under threat, turning an old male-coded accessory into a modern statement.",
    "link": "https://cnalifestyle.channelnewsasia.com/style-beauty/nicole-kidman-demi-moore-wear-ties-577911",
    "timestamp": "2026-02-01T01:50:00Z"
  },
  {
    "title": "Hakeem Jeffries Sticks Up for Don Lemon: ‘No Basis in Law or Fact’ to Justify Arrest",
    "description": "\"Donald Trump is trying to intimidate people who stand up to him,\" he tells \"PoliticsNation\" host Al Sharpton\nThe post Hakeem Jeffries Sticks Up for Don Lemon: ‘No Basis in Law or Fact’ to Justify Arrest appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/tv/hakeem-jeffries-no-basis-law-or-fact-don-lemon-arrest/",
    "timestamp": "2026-02-01T01:48:42Z"
  },
  {
    "title": "Democrat Taylor Rehmet leads Republican Leigh Wambsganss in early vote for State Senate District 9 seat in Tarrant County",
    "description": "Democrat Taylor Rehmet holds a nearly 5,700‑vote advantage over Republican Leigh Wambsganss in the race to fill the seat vacated by former Sen. Kelly Hancock, with Election Day results expected later tonight.",
    "link": "https://www.cbsnews.com/texas/news/texas-senate-district-9-early-vote-rehmet-leads-wambsganss-tarrant-county/",
    "timestamp": "2026-02-01T01:47:00Z"
  },
  {
    "title": "From Elon Musk to the former Prince Andrew, a who's who of powerful men are named in Epstein files",
    "description": "A vast release of documents connected to Jeffrey Epstein's investigations has revealed interactions between the financier and numerous powerful men, including Prince Andrew, Elon Musk, and Richard Branson. Many individuals have denied close ties or involvemen…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/from-elon-musk-to-the-former-prince-andrew-a-whos-who-of-powerful-men-are-named-in-epstein-files/articleshow/127830926.cms",
    "timestamp": "2026-02-01T01:46:32Z"
  },
  {
    "title": "India, Arab League nations back 2-state solution to Palestine issue",
    "description": "India and Arab League nations have agreed to deepen ties, advocating for a sovereign Palestine state alongside Israel and emphasizing UN Charter principles. Both sides condemned cross-border terror, vowing collective action against its infrastructure and fina…",
    "link": "https://economictimes.indiatimes.com/news/india/india-arab-league-nations-back-2-state-solution-to-palestine-issue/articleshow/127830882.cms",
    "timestamp": "2026-02-01T01:38:13Z"
  },
  {
    "title": "Hindustan Zinc, MCX, Muthoot Finance, other stocks in focus amid gold-silver crash: What to expect?",
    "description": "Gold and silver prices have seen a significant decline in the second half of last week, after scaling fresh lifetime highs just before.",
    "link": "https://www.moneycontrol.com/news/business/markets/hindustan-zinc-mcx-muthoot-finance-other-stocks-in-focus-amid-gold-silver-crash-what-to-expect-13802077.html",
    "timestamp": "2026-02-01T01:35:53Z"
  },
  {
    "title": "Bitcoin Plunges Below $80,000 As The Crypto Slide Deepens",
    "description": "Bitcoin fell as much as 10% to $75,709.88 during New York afternoon trading hours, while other tokens posted steeper losses. Ether, the second-largest digital asset, shed as much as 17%, and Solana at one point dropped over 17%.",
    "link": "https://www.ndtvprofit.com/world/bitcoin-plunges-below-80-000-as-the-crypto-slide-deepens-10922375",
    "timestamp": "2026-02-01T01:21:07Z"
  },
  {
    "title": "Iran says progress made towards US talks despite attack jitters",
    "description": "\"(Iran is) talking to us, and we'll see if we can do something, otherwise we'll see what happens ... We have a big fleet heading out there,\" Trump told Fox News.",
    "link": "https://www.channelnewsasia.com/world/iran-says-progress-made-towards-us-talks-despite-attack-jitters-5898766",
    "timestamp": "2026-02-01T01:18:02Z"
  },
  {
    "title": "A who’s who of powerful men are named in the Epstein files",
    "description": "Prominent political and business leaders are named in the documents released by the Justice Department in connection with its investigations into Jeffrey Epstein. Elon Musk, Britain’s former Prince Andrew, New York Giants co-owner Steven Tisch, U.S. Commerce …",
    "link": "https://apnews.com/article/epstein-trump-musk-andrew-tisch-google-682447e50bf9a3643a36c9b54ccdfa22",
    "timestamp": "2026-02-01T01:14:13Z"
  },
  {
    "title": "Iran says progress made towards US talks",
    "description": "Iran's top security official said that progress had been made towards negotiations with the United States, even as the Islamic republic's army chief warned the US against launching military strikes.",
    "link": "https://www.rte.ie/news/world/2026/0201/1556188-iran-us/",
    "timestamp": "2026-02-01T01:14:00Z"
  },
  {
    "title": "Trump Directs DHS Not to Participate in 'Poorly Run' Dem City Protests",
    "description": "President Donald Trump revealed that he told Department of Homeland Security (DHS) Secretary Kristi Noem the administration will not be participating with \"various poorly run Democrat Cities with regard\" to protests and riots.\nThe post Trump Directs DHS Not t…",
    "link": "https://www.breitbart.com/immigration/2026/01/31/trump-directs-dhs-not-to-participate-in-poorly-run-dem-city-protests/",
    "timestamp": "2026-02-01T01:11:44Z"
  },
  {
    "title": "New US envoy arrives in Venezuela after Maduro's ouster",
    "description": "The arrival of charge d'affaires Laura Dogu comes one month after US forces kidnapped leader Nicolas Maduro and brought him to New York to face trial. Dogu is a veteran diplomat and Spanish speaker.",
    "link": "https://www.dw.com/en/new-us-envoy-arrives-in-venezuela-after-maduros-ouster/a-75745389",
    "timestamp": "2026-02-01T01:03:00Z"
  },
  {
    "title": "Epstein files lead to resignation of top Slovakian official, while British prime minister calls on former prince to cooperate with U.S. authorities",
    "description": "Robert Fico, Slovakia’s prime minister, said Saturday that he had accepted the resignation of Lajcak, his national security adviser.",
    "link": "https://fortune.com/2026/01/31/epstein-files-resignation-top-slovakian-official-british-prime-minister-prince-andrew/",
    "timestamp": "2026-02-01T01:02:48Z"
  },
  {
    "title": "Why Trump’s new pick for Fed chair hit gold and silver markets – for good reasons",
    "description": "Though Trump clearly remains sceptical of central bank independence, his appointment of Warsh suggests he recognises the importance Fed credibility.",
    "link": "https://theconversation.com/why-trumps-new-pick-for-fed-chair-hit-gold-and-silver-markets-for-good-reasons-273233",
    "timestamp": "2026-02-01T00:59:23Z"
  },
  {
    "title": "Powell Out. Warsh In. What Trump’s Fed Pick Means for Rates and Market",
    "description": "President Donald Trump on Friday formally nominated former Federal Reserve governor Kevin Warsh to succeed Jerome Powell as chair of the U.S. central bank, bringing a turbulent and politically charged transition at the Fed closer to resolution. The decision c…",
    "link": "https://freerepublic.com/focus/f-news/4364941/posts",
    "timestamp": "2026-02-01T00:56:10Z"
  },
  {
    "title": "Trump orders federal agents to stay away from protests in Democrat cities",
    "description": "Order comes amid mounting criticism of Trump administration's deadly immigration crackdown in Democratic-run cities.",
    "link": "https://www.aljazeera.com/news/2026/2/1/trump-orders-federal-agents-to-stay-away-from-protests-in-democrat-cities",
    "timestamp": "2026-02-01T00:52:03Z"
  },
  {
    "title": "House Democrats mutiny Schumer’s deal with White House, threatening longer shutdown",
    "description": "House Democrats are divided from Senate Democrats on a deal struck with the White House to fund the federal government and negotiate DHS dollars.",
    "link": "https://www.foxnews.com/politics/house-democrats-mutiny-schumers-deal-white-house-threatening-longer-shutdown",
    "timestamp": "2026-02-01T00:47:30Z"
  },
  {
    "title": "Jay-Z, Harvey Weinstein and Pusha T Mentioned in Latest Epstein File Release",
    "description": "The Department of Justice on Friday released 3 million documents from the Jeffrey Epstein files, along with 2,000 videos and roughly 180,000 images. The latest batch included mention of celebrities like Jay-Z, Pusha T and Harvey Weinstein. Mentions of the tri…",
    "link": "https://variety.com/2026/film/news/jay-z-harvey-weinstein-pusha-t-epstein-files-1236647297/",
    "timestamp": "2026-02-01T00:46:49Z"
  },
  {
    "title": "Health Care Workers Hold Vigil At CT Capitol For ICU Nurse Killed By Federal Agents In Minneapolis",
    "description": "Speakers at the Hartford vigil repeatedly linked Pretti’s death to immigration enforcement activity they said is already being felt in Connecticut, citing detentions in communities including Newington and Southington.",
    "link": "http://ctnewsjunkie.com/2026/01/31/health-care-workers-hold-vigil-at-ct-capitol-for-icu-nurse-killed-by-federal-agents-in-minneapolis/",
    "timestamp": "2026-02-01T00:44:38Z"
  },
  {
    "title": "Trump: Source of the strongest arguments against joining Trump’s Board of Peace",
    "description": "I suspect blowing up fishing boats, kidnapping a leader and threatening to nuke NATO contributed. But this article posits that Bruised Springsteen’s hints that he wants to replace the UN made the new BOP unattractive to many of the people he invited to join. …",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/trump-source-of-the-strongest-arguments-against-joining-trumps-board-of-peace",
    "timestamp": "2026-02-01T00:43:00Z"
  },
  {
    "title": "US firms spent N3bn on permits for Nigerian workers – Report",
    "description": "US companies spent over N3.23bn to sponsor 880 Nigerian professionals for H-1B visas in FY 2024, leading all African nations in skilled worker permits.\n\nRead More: https://punchng.com/us-firms-spent-n3bn-on-permits-for-nigerian-workers-report/",
    "link": "https://punchng.com/us-firms-spent-n3bn-on-permits-for-nigerian-workers-report/",
    "timestamp": "2026-02-01T00:36:40Z"
  },
  {
    "title": "British PM calls on Prince Andrew to testify over Epstein links",
    "description": "UK Prime Minister Keir Starmer has said Andrew Mountbatten-Windsor should share any information he has about his links to Jeffrey Epstein Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631816-prince-andrew-epstein-testify/",
    "timestamp": "2026-02-01T00:36:20Z"
  },
  {
    "title": "The US Supreme Court Is Quietly Aiding an Economic War on Cuba",
    "description": "Lawsuits by an oil giant and Cuban-American hardliners could lay the groundwork for US-backed regime change in Cuba.",
    "link": "https://www.levernews.com/the-supreme-courts-quiet-war-on-cuba/",
    "timestamp": "2026-02-01T00:35:31Z"
  },
  {
    "title": "Josh Harris insists his relationship with Jeffrey Epstein was strictly business",
    "description": "Jeffrey Epstein&apos;s tentacles reached every aspect of U.S. political and business life. As demonstrated by the latest batch of documents released by the Department of Justice (D",
    "link": "https://www.marca.com/en/basketball/nba/philadelphia-76ers/2026/02/01/697e9d81ca474164728b4583.html",
    "timestamp": "2026-02-01T00:34:25Z"
  },
  {
    "title": "Butler man accused of threatening president, police online",
    "description": "A Butler man is accused of threatening multiple government and law enforcement officials online.",
    "link": "https://www.wpxi.com/news/local/butler-man-accused-threatening-president-police-online/FP4RR4DLC5CUHA4LNEFGIAYGKU/",
    "timestamp": "2026-02-01T00:24:11Z"
  },
  {
    "title": "Humans are chasing conspiracies. What will the bots think?",
    "description": "Maybe the Reddit-trained bots on Moltbook will prove me wrong, and unearth something in the Epstein files. But for now, the evidence for a conspiracy is thin.",
    "link": "https://www.semafor.com/article/01/31/2026/the-humans-are-chasing-conspiracies-what-will-the-bots-think",
    "timestamp": "2026-02-01T00:16:36Z"
  },
  {
    "title": "New U.S. charge d’affaires arrives in Venezuela to reopen diplomatic mission after 7 years",
    "description": "U.S. charge d’affaires Laura Dogu arrived in Caracas on Saturday to reopen the American diplomatic mission in Venezuela after seven years of severed ties. The move comes almost one month after a military action ordered by U.S. President Donald Trump removed t…",
    "link": "https://japantoday.com/category/world/us-ambassador-arrives-in-venezuela-to-reopen-diplomatic-mission-after-7-years",
    "timestamp": "2026-02-01T00:15:50Z"
  },
  {
    "title": "Melania Trump ridiculed for saying her 'loved by all' movie is '#1': 'Alternate reality'",
    "description": "Melania Trump on Saturday was accused of living in an \"alternate reality\" after she bragged that her new documentary, which has reportedly struggled in sales, is \"#1\" and is \"loved by all.\"The Guardian sent a writer to watch the documentary, Melania, at the b…",
    "link": "https://www.rawstory.com/melania-movie-2675065839/",
    "timestamp": "2026-02-01T00:15:13Z"
  },
  {
    "title": "‘The Definition of Domestic Terrorism’: Fox News Analyst Pushes Trump to Invoke Insurrection Act Against Anti-ICE ‘Radicals’",
    "description": "Fox's Lisa Boothe said it is time for President Trump to invoke the Insurrection Act because anti-ICE \"radicals\" are attempting to subvert immigration law\nThe post ‘The Definition of Domestic Terrorism’: Fox News Analyst Pushes Trump to Invoke Insurrection Ac…",
    "link": "https://www.mediaite.com/media/the-definition-of-domestic-terrorism-fox-news-analyst-pushes-trump-to-invoke-insurrection-act-against-anti-ice-radicals/",
    "timestamp": "2026-02-01T00:14:39Z"
  },
  {
    "title": "Ukraine and Moldova hit by blackouts from grid malfunction",
    "description": "Parts of Ukraine and Moldova, including the neighboring countries' capitals, were plunged into blackouts on Saturday caused by a ‌malfunction of high-voltage power lines, officials said. Power was restored later in the day. Officials did not directly link the…",
    "link": "https://japantoday.com/category/world/ukraine-and-moldova-hit-by-blackouts-from-grid-malfunction-before-power-restored",
    "timestamp": "2026-02-01T00:12:01Z"
  },
  {
    "title": "Malnutrition looms as funding cuts deepen hunger among Nigerians",
    "description": "Funding cuts for health programs are fueling a severe malnutrition crisis in Nigeria, leaving millions of children and pregnant women vulnerable. Learn mor\n\nRead More: https://punchng.com/malnutrition-looms-as-funding-cuts-deepen-hunger-among-nigerians/",
    "link": "https://punchng.com/malnutrition-looms-as-funding-cuts-deepen-hunger-among-nigerians/",
    "timestamp": "2026-02-01T00:10:03Z"
  },
  {
    "title": "Trump says feds won't intervene during protests in Democratic-led cities unless asked to do so",
    "description": "President Donald Trump said Saturday that he has instructed Homeland Security Secretary Kristi Noem not to intervene in protests occurring in cities led by Democrats unless local authorities ask for federal help amid mounting criticism of his administration's…",
    "link": "https://japantoday.com/category/world/trump-says-feds-won%27t-intervene-during-protests-in-democratic-led-cities-unless-asked-to-do-so",
    "timestamp": "2026-02-01T00:09:50Z"
  },
  {
    "title": "Exclusive-US special envoy for Iraq Mark Savaya no longer in the post, sources say",
    "description": "By Andrea Shalal, Timour Azhari and Humeyra PamukWASHINGTON/RIYADH, Jan 31 (Reuters) - Mark Savaya, named by U.S. President Donald Trump as special envoy for Iraq in Octo… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/01/exclusive-us-special-envoy-for-iraq-mark-savaya-no-longer-in-the-post-sources-say",
    "timestamp": "2026-02-01T00:07:17Z"
  },
  {
    "title": "Epstein Files Allege Bill Gates Caught STD And Tried To Secretly Give Melinda Antibiotics",
    "description": "New Epstein files alleged Bill Gates caught an STD from Russian girl and slipped antibiotics to his then-wife Melinda.",
    "link": "https://www.boredpanda.com/bill-gates-caught-std-from-russian-girls-according-to-epstein-files/",
    "timestamp": "2026-02-01T00:06:48Z"
  },
  {
    "title": "From Elon Musk to the former Prince Andrew, a who’s who of powerful men are named in Epstein files",
    "description": "From Elon Musk to the former Prince Andrew, a who’s who of powerful men are named in Epstein files",
    "link": "https://www.livemint.com/companies/from-elon-musk-to-the-former-prince-andrew-a-who-s-who-of-powerful-men-are-named-in-epstein-files-11769904388790.html",
    "timestamp": "2026-02-01T00:06:28Z"
  },
  {
    "title": "Articles On: PLA, Carney Doctrine, Keir Starmer, Canada, Taiwan, Chinese Embassy, Tech, and South America",
    "description": "This section collects opinion pieces from across the world commenting on the harms caused by the activities of the Chinese Communist Party and provides insight into the various solutions that experts and leaders suggest we pursue to protect our interests.",
    "link": "https://www.hoover.org/research/articles-pla-carney-doctrine-keir-starmer-canada-taiwan-chinese-embassy-tech-and-south",
    "timestamp": "2026-02-01T00:00:00Z"
  },
  {
    "title": "Music Notes",
    "description": "My first Music Notes of the year, after a bit of a holiday layoff, when I wasn’t listening to a whole lot of new music or seeing shows. Let’s get this off the ground for 2026. While flying to Asia at the end of December, I watched Becoming Led Zeppelin, the d…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/music-notes-233",
    "timestamp": "2026-02-01T00:00:00Z"
  },
  {
    "title": "House minority leader says Republicans can’t rely on Democrats to pass funding bill, raising fears of longer shutdown",
    "description": "(CNN) — House Minority Leader Hakeem Jeffries told Speaker Mike Johnson on Saturday that Democrats won’t help Republicans pass a funding bill to reopen the government if they attempt to fast-track the measure Monday, according to two sources familiar with a c…",
    "link": "https://freerepublic.com/focus/f-news/4364935/posts",
    "timestamp": "2026-01-31T23:58:28Z"
  },
  {
    "title": "Trump says feds won't intervene during protests in Democratic-led cities unless asked to do so",
    "description": "President Donald Trump says he's instructed Homeland Security Secretary Kristi Noem not to intervene in protests in Democratic-led cities unless local authorities request federal help",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-feds-intervene-protests-democratic-led-cities-asked-129742438",
    "timestamp": "2026-01-31T23:57:44Z"
  },
  {
    "title": "Fox to broadcast The Freedom 250 in Washington, D.C. following Donald Trump's executive order - Awful Announcing",
    "description": "Fox to broadcast The Freedom 250 in Washington, D.C. following Donald Trump's executive orderAwful Announcing Trump orders IndyCar race on streets of DC as part of nation's 250th celebrationABC News Freedom 250 Grand Prix of Washington, D.C. Coming in AugustI…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180711320",
    "timestamp": "2026-01-31T23:52:30Z"
  },
  {
    "title": "New US charge d’affaires arrives in Venezuela to reopen diplomatic mission after 7 years",
    "description": "U.S. charge d’affaires Laura Dogu has arrived in Caracas to reopen the American diplomatic mission in Venezuela after seven years of severed ties",
    "link": "https://abcnews.go.com/US/wireStory/new-us-charge-daffaires-arrives-venezuela-reopen-diplomatic-129741504",
    "timestamp": "2026-01-31T23:49:28Z"
  },
  {
    "title": "Trump: Iran is talking to us, I can’t tell our plan to Gulf allies",
    "description": "Speaking to Fox News, President Trump says the US cannot share Iran military plans with Gulf allies while negotiating with Tehran: “Iran is talking to us, and we'll see if we can do something, otherwise we'll see what happens.\"",
    "link": "https://www.israelnationalnews.com/news/421755",
    "timestamp": "2026-01-31T23:48:18Z"
  },
  {
    "title": "Justice Department's Misconduct Complaint Against Judge Boasberg Gets Tossed",
    "description": "Boasberg, an appointee of Democratic former President Barack Obama, declined to comment.",
    "link": "https://www.huffpost.com/entry/justice-departments-misconduct-complaint-against-judge-boasberg-gets-tossed_n_697e905de4b0c862d1f49c00",
    "timestamp": "2026-01-31T23:40:06Z"
  },
  {
    "title": "Trump wants deep-sea minerals. Can these US territories say no?",
    "description": "A Trump administration push to begin deep-sea mining is gathering momentum — and stirring alarm in United States Pacific territories.",
    "link": "https://www.abc.net.au/news/2026-02-01/trump-administration-seabed-mining-pacific-territories/106272964",
    "timestamp": "2026-01-31T23:39:19Z"
  },
  {
    "title": "Uh Oh: Trump Nominates Unknown Spanish Economist Ronaldo Paulino As Fed Chair",
    "description": "WASHINGTON, D.C. — In a surprise choice to succeed Jerome Powell when his term expired in the spring, President Donald Trump nominated an unknown Spanish economist named Ronaldo Paulino as chairman of the Federal Reserve. According to administration insiders,…",
    "link": "https://freerepublic.com/focus/f-chat/4364932/posts",
    "timestamp": "2026-01-31T23:38:18Z"
  },
  {
    "title": "Marjorie Taylor Greene Backs Charges Against Don Lemon: 'I Completely Support His Arrest'",
    "description": "The former congresswoman was a guest on \"Real Time With Bill Maher\" and contended that Lemon \"violated the FACE Act.\"",
    "link": "https://www.huffpost.com/entry/marjorie-taylor-greene-backs-don-lemon-charges-against-don-lemon-i-completely-support-his-arrest_n_697e4f10e4b05062c1d661bf",
    "timestamp": "2026-01-31T23:35:10Z"
  },
  {
    "title": "The heartbreaking truth on how close Bill Belichick was to HOF",
    "description": "Since the shocking snub, fans have pondered how close the legendary coach was to being a first-ballot Hall of Famer. Now, we have an idea.",
    "link": "https://touchdownwire.usatoday.com/story/sports/nfl/touchdown/2026/01/31/the-heartbreaking-truth-on-how-close-bill-belichick-was-to-hof/88452841007/",
    "timestamp": "2026-01-31T23:34:58Z"
  },
  {
    "title": "Trump says federal law enforcement won't respond to protests in 'Democrat Cities' until they 'ask for help'",
    "description": "President Donald Trump said that federal law enforcement will not respond to protests or riots in \"poorly run Democrat Cities\" until support is requested, but will still protect federal property, in a Truth Social post on Saturday.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-says-federal-law-enforcement-wont-respond-protests-democrat-citi-rcna256883",
    "timestamp": "2026-01-31T23:30:35Z"
  },
  {
    "title": "Trump nominates government economist to lead Bureau of Labor Statistics",
    "description": "President Donald Trump said that he is nominating Brett Matsumoto to lead the Bureau of Labor Statistics, after having accused the federal agency of releasing low monthly jobs numbers in order to make him look bad.",
    "link": "https://www.bostonherald.com/2026/01/31/trump-nominates-government-economist-to-lead-bureau-of-labor-statistics/",
    "timestamp": "2026-01-31T23:20:40Z"
  },
  {
    "title": "Opinion: President of bad taste – The Arc de Sleaze in Washington will probably be golden",
    "description": "Suggestion – Tear this insult down ASAP.\nThe post Opinion: President of bad taste – The Arc de Sleaze in Washington will probably be golden appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/opinion-president-of-bad-taste-the-arc-de-sleaze-in-washington-will-probably-be-golden/article",
    "timestamp": "2026-01-31T23:19:38Z"
  },
  {
    "title": "Hundreds protest Trump's NATO comments and Greenland demands at US embassy in Copenhagen",
    "description": "Hundreds demonstrated in Copenhagen Saturday after President Trump's NATO remarks sparked outrage among Danish military veterans who served in Iraq and Afghanistan.",
    "link": "https://www.foxnews.com/world/hundreds-protest-trumps-nato-comments-greenland-demands-us-embassy-copenhagen",
    "timestamp": "2026-01-31T23:15:17Z"
  },
  {
    "title": "‘Unbelievable Any Of Them Have a Job!’ Epstein Survivor Rails Against DOJ Redactions to CNN",
    "description": "Epstein survivor Jess Michaels railed against Donald Trump's DOJ for failing miserably with its redactions of the latest release of Epstein files.\nThe post ‘Unbelievable Any Of Them Have a Job!’ Epstein Survivor Rails Against DOJ Redactions to CNN first appea…",
    "link": "https://www.mediaite.com/media/news/unbelievable-any-of-them-have-a-job-epstein-survivor-rails-against-doj-redactions-to-cnn/",
    "timestamp": "2026-01-31T23:11:55Z"
  },
  {
    "title": "San Jose Mayor Matt Mahan Enters California Governor’s Race",
    "description": "San Jose Mayor Matt Mahan entered the crowded race to succeed term-limited Gov. Gavin Newsom, pitching himself as a results-driven Democrat focused on public safety,... Read More\nThe post San Jose Mayor Matt Mahan Enters California Governor’s Race appeared fi…",
    "link": "https://www.dailysignal.com/2026/01/31/san-jose-mayor-matt-mahan-enters-california-governors-race/",
    "timestamp": "2026-01-31T23:00:00Z"
  },
  {
    "title": "The platform independence imperative",
    "description": "Who controls what we see and hear? Read full story",
    "link": "https://www.thestar.com.my/opinion/columnists/all-the-pieces-matter/2026/02/01/the-platform-independence-imperative",
    "timestamp": "2026-01-31T23:00:00Z"
  },
  {
    "title": "BRICS could become a new pillar of global governance—if its rapid growth doesn’t erode its newfound clout",
    "description": "Enlargement may look pretty on paper, but BRICS needs ground rules, enforcement, and even just a common message.",
    "link": "https://fortune.com/2026/01/31/brics-expansion-china-india-tariffs-trump/",
    "timestamp": "2026-01-31T23:00:00Z"
  },
  {
    "title": "What if NATO Died?",
    "description": "Forged under the pressure of the Cold War in 1949, the North Atlantic Treaty Organization, or NATO, is in critical condition. It has been brought to the brink of death by Donald Trump’s threat to take Greenland, an autonomous territory of Denmark, a founding …",
    "link": "https://www.activistpost.com/what-if-nato-died/",
    "timestamp": "2026-01-31T23:00:00Z"
  },
  {
    "title": "Trump vows not to help blue cities with riots, instructs ICE and Border Patrol to protect federal property",
    "description": "President Donald Trump on Saturday announced the government will not assist blue cities with ongoing anti-immigration enforcement riots unless help is requested, adding he has instructed ICE and Border Patrol to be \"very forceful\" in the protection of federal…",
    "link": "https://freerepublic.com/focus/f-news/4364923/posts",
    "timestamp": "2026-01-31T22:59:24Z"
  },
  {
    "title": "Federal judge strikes down parts of Trump executive order on citizenship verification for voter registration",
    "description": "A federal judge on Friday struck down key portions of President Donald Trump’s executive order aimed at tightening citizenship verification for voter registration and absentee ballot applications, ruling the White House overstepped its constitutional authorit…",
    "link": "https://freerepublic.com/focus/f-news/4364921/posts",
    "timestamp": "2026-01-31T22:55:54Z"
  },
  {
    "title": "U.S. Ambassador Arrives In Venezuela To Reopen Diplomatic Mission After 7 Years",
    "description": "Venezuela and the United States broke off diplomatic relations in February 2019.",
    "link": "https://www.huffpost.com/entry/united-states-ambassador-arrives-in-venezuela-reopen-diplomatic-mission-7-years_n_697e8493e4b05062c1d8c200",
    "timestamp": "2026-01-31T22:55:18Z"
  },
  {
    "title": "'Melania' Director Brett Ratner Pictured on Couch with Jeffrey Epstein & Women",
    "description": "Brett Ratner makes an appearance in the latest dump of the infamous Epstein Files ... sitting next to Jeffrey Epstein and two redacted women in newly released photos. The director -- who helmed the new documentary \"Melania\" about First Lady Melania…\n Permalink",
    "link": "https://www.tmz.com/2026/01/31/brett-ratner-with-epstein-women-photos-files/",
    "timestamp": "2026-01-31T22:53:53Z"
  },
  {
    "title": "The rise of the new confederacy",
    "description": "'Will Trump pull the trigger? Maybe. After all, there's nothing new under the sun'",
    "link": "https://www.wnd.com/2026/01/rise-new-confederacy/",
    "timestamp": "2026-01-31T22:45:02Z"
  },
  {
    "title": "How much control will the US have over Venezuela’s oil?",
    "description": "Caracas says it is opening up the sector to private players.",
    "link": "https://www.aljazeera.com/video/inside-story/2026/1/31/how-much-control-will-the-us-have-over-venezuelas-oil",
    "timestamp": "2026-01-31T22:43:28Z"
  },
  {
    "title": "Fed chair nominee Kevin Warsh could crush Trump’s rate-cut hopes and risk suffering the same level of abuse that Powell got, analysts say",
    "description": "\"Should Warsh find himself in the minority, he would have to decide whether he would tolerate being outvoted.\"",
    "link": "https://fortune.com/2026/01/31/fed-chair-nominee-kevin-warsh-trump-rate-cuts-abuse-jerome-powell/",
    "timestamp": "2026-01-31T22:36:46Z"
  },
  {
    "title": "US ambassador arrives in Venezuela to reopen diplomatic mission after 7 years",
    "description": "U.S. charge d’affaires Laura Dogu arrived in Caracas on Saturday to reopen the American diplomatic mission in Venezuela after seven years of severed ties...",
    "link": "https://www.yahoo.com/news/articles/us-ambassador-arrives-venezuela-reopen-223545153.html",
    "timestamp": "2026-01-31T22:35:45Z"
  },
  {
    "title": "Donald Trump Ridicules Ilhan Omar and Demands She Be Jailed or 'Sent Back to Somalia' After Sick Attack",
    "description": "Trump blasted Rep. Ilhan Omar, calling for jail or deportation just days after she was attacked.",
    "link": "https://radaronline.com/p/trump-erupts-ilhan-omar-demands-jailed-sent-back-somalia-after-sick-attack/",
    "timestamp": "2026-01-31T22:35:00Z"
  },
  {
    "title": "Trump refuses to reveal his Iran ‘plan’ even to closest allies",
    "description": "Both sides have indicated that diplomatic backchannels remain open, even as Washington has ramped up military pressure on Tehran Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631815-trump-iran-plan-allies/",
    "timestamp": "2026-01-31T22:25:57Z"
  }
]